[
    {
        "Salmonella is a ": null
    },
    {
        "genus": "https://en.wikipedia.org/wiki/Genus"
    },
    {
        " of ": null
    },
    {
        "rod-shaped": "https://en.wikipedia.org/wiki/Bacillus_(shape)"
    },
    {
        " (bacillus) ": null
    },
    {
        "Gram-negative": "https://en.wikipedia.org/wiki/Gram-negative"
    },
    {
        "bacteria": "https://en.wikipedia.org/wiki/Bacteria"
    },
    {
        " of the family ": null
    },
    {
        "Enterobacteriaceae": "https://en.wikipedia.org/wiki/Enterobacteriaceae"
    },
    {
        ". The two species of Salmonella are ": null
    },
    {
        "Salmonella enterica": "https://en.wikipedia.org/wiki/Salmonella_enterica"
    },
    {
        " and ": null
    },
    {
        "Salmonella bongori": "https://en.wikipedia.org/wiki/Salmonella_bongori"
    },
    {
        ". S. enterica is the type species and is further divided into six ": null
    },
    {
        "subspecies": "https://en.wikipedia.org/wiki/Subspecies"
    },
    {
        " that include over 2,600 ": null
    },
    {
        "serotypes": "https://en.wikipedia.org/wiki/Serotype"
    },
    {
        ".Salmonella was named after ": null
    },
    {
        "Daniel Elmer Salmon": "https://en.wikipedia.org/wiki/Daniel_Elmer_Salmon"
    },
    {
        " (1850–1914), an American veterinary surgeon. ": null
    },
    {
        "Salmonella species are non-": null
    },
    {
        "spore": "https://en.wikipedia.org/wiki/Endospore"
    },
    {
        "-forming, predominantly ": null
    },
    {
        "motile": "https://en.wikipedia.org/wiki/Motility"
    },
    {
        "enterobacteria": "https://en.wikipedia.org/wiki/Enterobacteriaceae"
    },
    {
        " with cell diameters between about 0.7 and 1.5 ": null
    },
    {
        "µm": "https://en.wikipedia.org/wiki/Micrometre"
    },
    {
        ", lengths from 2 to 5 µm, and peritrichous ": null
    },
    {
        "flagella": "https://en.wikipedia.org/wiki/Flagellum"
    },
    {
        " (all around the cell body). They are ": null
    },
    {
        "chemotrophs": "https://en.wikipedia.org/wiki/Chemotrophs"
    },
    {
        ", obtaining their energy from ": null
    },
    {
        "oxidation and reduction reactions": "https://en.wikipedia.org/wiki/Redox"
    },
    {
        " using organic sources. They are also ": null
    },
    {
        "facultative aerobes": "https://en.wikipedia.org/wiki/Facultative_aerobic_organism"
    },
    {
        ", capable of generating ": null
    },
    {
        "ATP": "https://en.wikipedia.org/wiki/Adenosine_triphosphate"
    },
    {
        " with oxygen (\"aerobically\") when it is available, or when ": null
    },
    {
        "oxygen": "https://en.wikipedia.org/wiki/Oxygen"
    },
    {
        " is not available, using other electron acceptors or fermentation (\"anaerobically\").S. enterica subspecies are found worldwide in all ": null
    },
    {
        "warm-blooded": "https://en.wikipedia.org/wiki/Warm-blooded"
    },
    {
        " animals and in the environment. S. bongori is restricted to ": null
    },
    {
        "cold-blooded animals": "https://en.wikipedia.org/wiki/Ectotherm"
    },
    {
        ", particularly ": null
    },
    {
        "reptiles": "https://en.wikipedia.org/wiki/Reptile"
    },
    {
        ".": null
    },
    {
        "Salmonella species are ": null
    },
    {
        "intracellular pathogens": "https://en.wikipedia.org/wiki/Intracellular_pathogen"
    },
    {
        "; certain serotypes causing illness. Nontyphoidal serotypes can be transferred from animal-to-human and from human-to-human. They usually invade only the gastrointestinal tract and cause ": null
    },
    {
        "salmonellosis": "https://en.wikipedia.org/wiki/Salmonellosis"
    },
    {
        ", the symptoms of which can be resolved without ": null
    },
    {
        "antibiotics": "https://en.wikipedia.org/wiki/Antibiotics"
    },
    {
        ". However, in ": null
    },
    {
        "sub-Saharan Africa": "https://en.wikipedia.org/wiki/Sub-Saharan_Africa"
    },
    {
        ", nontyphoidal Salmonella can be invasive and cause ": null
    },
    {
        "paratyphoid fever": "https://en.wikipedia.org/wiki/Paratyphoid_fever"
    },
    {
        ", which requires immediate treatment with antibiotics. Typhoidal serotypes can only be transferred from human-to-human, and can cause food-borne infection, ": null
    },
    {
        "typhoid fever": "https://en.wikipedia.org/wiki/Typhoid_fever"
    },
    {
        ", and paratyphoid fever. Typhoid fever is caused by Salmonella invading the bloodstream (the typhoidal form), or in addition spreads throughout the body, invades organs, and secretes ": null
    },
    {
        "endotoxins": "https://en.wikipedia.org/wiki/Endotoxin"
    },
    {
        " (the septic form). This can lead to life-threatening ": null
    },
    {
        "hypovolemic shock": "https://en.wikipedia.org/wiki/Hypovolemic_shock"
    },
    {
        " and ": null
    },
    {
        "septic shock": "https://en.wikipedia.org/wiki/Septic_shock"
    },
    {
        ", and requires ": null
    },
    {
        "intensive care": "https://en.wikipedia.org/wiki/Intensive_care_unit"
    },
    {
        " including antibiotics.": null
    },
    {
        "The collapse of the ": null
    },
    {
        "Aztec": "https://en.wikipedia.org/wiki/Aztec"
    },
    {
        " society in ": null
    },
    {
        "Mesoamerica": "https://en.wikipedia.org/wiki/Mesoamerica"
    },
    {
        " is linked to a catastrophic Salmonella outbreak, one of humanity's deadliest, that occurred after the ": null
    },
    {
        "Spanish conquest": "https://en.wikipedia.org/wiki/Spanish_conquest_of_the_Aztec_Empire"
    },
    {
        ".": null
    },
    {
        "The genus Salmonella is part of the family of Enterobacteriaceae. Its taxonomy has been revised and has the potential to confuse. The genus comprises two species, S. bongori and S. enterica, the latter of which is divided into six subspecies: S. e. enterica, S. e. salamae, S. e. arizonae, S. e. diarizonae, S. e. houtenae, and S. e. indica. The taxonomic group contains more than 2500 ": null
    },
    {
        "serotypes": "https://en.wikipedia.org/wiki/Serotype"
    },
    {
        " (also serovars) defined on the basis of the somatic O (": null
    },
    {
        "lipopolysaccharide": "https://en.wikipedia.org/wiki/Lipopolysaccharide"
    },
    {
        ") and flagellar H antigens (the ": null
    },
    {
        "Kauffman–White classification": "https://en.wikipedia.org/wiki/Kauffman%E2%80%93White_classification"
    },
    {
        "). The full name of a serotype is given as, for example, Salmonella enterica subsp. enterica serotype Typhimurium, but can be abbreviated to Salmonella Typhimurium. Further differentiation of strains to assist ": null
    },
    {
        "clinical": "https://en.wikipedia.org/wiki/Clinical_research"
    },
    {
        " and ": null
    },
    {
        "epidemiological": "https://en.wikipedia.org/wiki/Epidemiology"
    },
    {
        " investigation may be achieved by ": null
    },
    {
        "antibiotic sensitivity testing": "https://en.wikipedia.org/wiki/Antibiotic_sensitivity"
    },
    {
        " and by other ": null
    },
    {
        "molecular biology": "https://en.wikipedia.org/wiki/Molecular_biology"
    },
    {
        " techniques such as ": null
    },
    {
        "pulsed-field gel electrophoresis": "https://en.wikipedia.org/wiki/Pulsed-field_gel_electrophoresis"
    },
    {
        ", ": null
    },
    {
        "multilocus sequence typing": "https://en.wikipedia.org/wiki/Multilocus_sequence_typing"
    },
    {
        ", and, increasingly, ": null
    },
    {
        "whole genome sequencing": "https://en.wikipedia.org/wiki/Whole_genome_sequencing"
    },
    {
        ". Historically, salmonellae have been clinically categorized as invasive (typhoidal) or noninvasive (nontyphoidal salmonellae) based on host preference and disease manifestations in humans.": null
    },
    {
        "Salmonella was first visualized in 1880 by ": null
    },
    {
        "Karl Eberth": "https://en.wikipedia.org/wiki/Karl_Joseph_Eberth"
    },
    {
        " in the ": null
    },
    {
        "Peyer's patches": "https://en.wikipedia.org/wiki/Peyer%27s_patch"
    },
    {
        " and ": null
    },
    {
        "spleens": "https://en.wikipedia.org/wiki/Spleen"
    },
    {
        " of typhoid patients. Four years later, ": null
    },
    {
        "Georg Theodor Gaffky": "https://en.wikipedia.org/wiki/Georg_Theodor_August_Gaffky"
    },
    {
        " was able to successfully grow the pathogen in pure culture. A year after that, medical research scientist ": null
    },
    {
        "Theobald Smith": "https://en.wikipedia.org/wiki/Theobald_Smith"
    },
    {
        " discovered what would be later known as ": null
    },
    {
        "Salmonella enterica": "https://en.wikipedia.org/wiki/Salmonella_enterica"
    },
    {
        " (var. Choleraesuis).  At the time, Smith was working as a research laboratory assistant in the Veterinary Division of the ": null
    },
    {
        "United States Department of Agriculture": "https://en.wikipedia.org/wiki/United_States_Department_of_Agriculture"
    },
    {
        ". The department was under the administration of ": null
    },
    {
        "Daniel Elmer Salmon": "https://en.wikipedia.org/wiki/Daniel_Elmer_Salmon"
    },
    {
        ", a veterinary pathologist.  Initially, Salmonella Choleraesuis was thought to be the causative agent of ": null
    },
    {
        "hog cholera": "https://en.wikipedia.org/wiki/Classical_swine_fever"
    },
    {
        ", so Salmon and Smith named it \"Hog-cholerabacillus\".  The name Salmonella was not used until 1900, when Joseph Leon Lignières proposed that the pathogen discovered by Salmon's group be called Salmonella in his honor.": null
    },
    {
        "Serotyping is done by mixing cells with antibodies for a particular antigen. It can give some idea about risk. For example, in 2014, a study showed that S. Reading is very common among young turkey samples, but it is not a significant contributor to human salmonellosis. Serotyping can assist identify the source of contamination. For example, if we have a case of food illness. There are two ways to figure out the source of contamination. One of them is serotyping the Salmonella in infected people, and serotyping Salmonella found at possible source of contamination (e.g. where food was prepared), and then determining if the serotypes match. The other way is to serotype the Salmonella in infected people, see the result and if the result matches with a particular kind of serotype of Salmonella that can only found in a particular species of animals or at particular place, then we can know our source of contamination.  Moreover, serotyping may suggest adequate treatment by giving us the idea about the antibiotic resistance of salmonella species. For example, sulfonamides are antibiotics which are appropriate for treatment of Salmonellaenterica serotype Typhi (normally it is just shortened to S.Typhi). Serotyping is a faster method than antibiotic sensitivity testing culture methods.": null
    },
    {
        "Most subspecies of Salmonella produce ": null
    },
    {
        "hydrogen sulfide": "https://en.wikipedia.org/wiki/Hydrogen_sulfide"
    },
    {
        ", which can readily be detected by growing them on ": null
    },
    {
        "media": "https://en.wikipedia.org/wiki/Growth_medium"
    },
    {
        " containing ": null
    },
    {
        "ferrous sulfate": "https://en.wikipedia.org/wiki/Ferrous_sulfate"
    },
    {
        ", such as is used in the ": null
    },
    {
        "triple sugar iron": "https://en.wikipedia.org/wiki/TSI_slant"
    },
    {
        " test. Most isolates exist in two phases, a motile phase I and a nonmotile phase II. Cultures that are nonmotile upon primary culture may be switched to the motile phase using a ": null
    },
    {
        "Craigie tube": "https://en.wikipedia.org/wiki/Craigie_tube"
    },
    {
        " or ditch plate.": null
    },
    {
        "RVS broth": "https://en.wikipedia.org/wiki/Rappaport_Vassiliadis_soya_peptone_broth"
    },
    {
        " can be used to enrich for Salmonella species for detection in a clinical sample.": null
    },
    {
        "Salmonella can also be detected and subtyped using ": null
    },
    {
        "multiplex": "https://en.wikipedia.org/wiki/Multiplex_polymerase_chain_reaction"
    },
    {
        " or ": null
    },
    {
        "real-time": "https://en.wikipedia.org/wiki/Real-time_polymerase_chain_reaction"
    },
    {
        "polymerase chain reactions": "https://en.wikipedia.org/wiki/Polymerase_chain_reaction"
    },
    {
        " (PCR) from extracted Salmonella DNA.": null
    },
    {
        "Mathematical models of Salmonella growth kinetics have been developed for chicken, pork, tomatoes, and melons.Salmonella reproduce asexually with a cell division interval of 40 minutes.": null
    },
    {
        "Salmonella species lead predominantly host-associated lifestyles, but the bacteria were found to be able to persist in a bathroom setting for weeks following contamination, and are frequently isolated from water sources, which act as bacterial reservoirs and may help to facilitate transmission between hosts.Salmonella is notorious for its ability to survive desiccation and can persist for years in dry environments and foods.": null
    },
    {
        "The bacteria are not destroyed by freezing, but ": null
    },
    {
        "UV light": "https://en.wikipedia.org/wiki/Ultraviolet_radiation"
    },
    {
        " and heat accelerate their destruction. They perish after being heated to 55 °C (131 °F) for 90 min, or to 60 °C (140 °F) for 12 min. To protect against Salmonella infection, heating food to an internal temperature of 75 °C (167 °F) is recommended.": null
    },
    {
        "Salmonella species can be found in the digestive tracts of humans and animals, especially reptiles. Salmonella on the skin of reptiles or amphibians can be passed to people who handle the animals. Food and water can also be contaminated with the bacteria if they come in contact with the feces of infected people or animals.": null
    },
    {
        "Initially, each Salmonella \"species\" was named according to clinical considerations, for example Salmonella typhi-murium (mouse typhoid fever), S. cholerae-suis. After  host specificity  was recognized to not exist for many species, new strains received species names according to the location at which the new strain was isolated. Later, molecular findings led to the hypothesis that Salmonella consisted of only one species,S. enterica, and the serotypes were classified into six groups, two of which are medically relevant. As this now-formalized nomenclature is not in harmony with the traditional usage familiar to specialists in microbiology and infectologists, the traditional nomenclature is still common. Currently, the two recognized species are ": null
    },
    {
        "S. enterica": "https://en.wikipedia.org/wiki/Salmonella_enterica"
    },
    {
        ", and ": null
    },
    {
        "S. bongori": "https://en.wikipedia.org/wiki/Salmonella_bongori"
    },
    {
        ". In 2005, a third species, Salmonella subterranean, was proposed, but according to the World Health Organization, the bacterium reported does not belong in the genus Salmonella.  The six main recognised subspecies are: enterica (serotype I), salamae (serotype II), arizonae (IIIa), diarizonae (IIIb), houtenae (IV), and indica (VI). The former serotype (V) was bongori, which is now considered its own species.": null
    },
    {
        "The serotype or serovar, is a classification of Salmonella into subspecies based on antigens that the organism presents. It is based on the Kauffman-White classification scheme that differentiates serological varieties from each other. Serotypes are usually put into subspecies groups after the genus and species, with the serotypes/serovars capitalized, but not italicized:  An example is Salmonella enterica serovar Typhimurium. More modern approaches for typing and subtyping Salmonella include DNA-based methods such as ": null
    },
    {
        "pulsed field gel electrophoresis": "https://en.wikipedia.org/wiki/Pulsed_field_gel_electrophoresis"
    },
    {
        ", ": null
    },
    {
        "multiple-loci VNTR analysis": "https://en.wikipedia.org/wiki/Multiple_Loci_VNTR_Analysis"
    },
    {
        ", ": null
    },
    {
        "multilocus sequence typing": "https://en.wikipedia.org/wiki/Multilocus_sequence_typing"
    },
    {
        ", and multiplex-": null
    },
    {
        "PCR": "https://en.wikipedia.org/wiki/PCR"
    },
    {
        "-based methods.": null
    },
    {
        "Salmonella species are facultative ": null
    },
    {
        "intracellular pathogens": "https://en.wikipedia.org/wiki/Intracellular_pathogen"
    },
    {
        ". A facultative organism uses oxygen to make ": null
    },
    {
        "ATP": "https://en.wikipedia.org/wiki/Adenosine_triphosphate"
    },
    {
        "; when it is not available, it \"exercises its option\"—the literal meaning of the term—and makes ATP by ": null
    },
    {
        "fermentation": "https://en.wikipedia.org/wiki/Fermentation"
    },
    {
        ", or  by substituting one or more of four less efficient electron acceptors as oxygen at the end of the electron transport chain: ": null
    },
    {
        "sulfate": "https://en.wikipedia.org/wiki/Sulfate"
    },
    {
        ", ": null
    },
    {
        "nitrate": "https://en.wikipedia.org/wiki/Nitrate"
    },
    {
        ", ": null
    },
    {
        "sulfur": "https://en.wikipedia.org/wiki/Sulfur"
    },
    {
        ", or ": null
    },
    {
        "fumarate": "https://en.wikipedia.org/wiki/Fumarate"
    },
    {
        ".": null
    },
    {
        "Most infections are due to ingestion of food contaminated by animal feces, or by human feces, such as by a food-service worker at a commercial eatery. Salmonella serotypes can be divided into two main groups—typhoidal and nontyphoidal. Nontyphoidal serotypes are more common, and usually cause self-limiting gastrointestinal disease. They can infect a range of animals, and are ": null
    },
    {
        "zoonotic": "https://en.wikipedia.org/wiki/Zoonotic"
    },
    {
        ", meaning they can be transferred between humans and other animals. Typhoidal serotypes include Salmonella Typhi and Salmonella Paratyphi A, which are adapted to humans and do not occur in other animals.": null
    },
    {
        "Infection with nontyphoidal serotypes of Salmonella generally results in food poisoning. Infection usually occurs when a person ingests foods that contain a high concentration of the bacteria. Infants and young children are much more susceptible to infection, easily achieved by ingesting a small number of bacteria. In infants, infection through inhalation of bacteria-laden dust is possible.": null
    },
    {
        "The organisms enter through the digestive tract and must be ingested in large numbers to cause disease in healthy adults. An infection can only begin after living salmonellae (not merely Salmonella-produced toxins) reach the gastrointestinal tract. Some of the microorganisms are killed in the stomach, while the surviving ones enter the small intestine and multiply in tissues. Gastric acidity is responsible for the destruction of the majority of ingested bacteria, but Salmonella has evolved a degree of tolerance to acidic environments that allows a subset of ingested bacteria to survive. Bacterial colonies may also become trapped in mucus produced in the esophagus. By the end of the incubation period, the nearby host cells are poisoned by ": null
    },
    {
        "endotoxins": "https://en.wikipedia.org/wiki/Lipopolysaccharide"
    },
    {
        " released from the dead salmonellae. The local response to the endotoxins is enteritis and gastrointestinal disorder.": null
    },
    {
        "About 2,000 serotypes of nontyphoidal Salmonella are known, which may be responsible for as many as 1.4 million illnesses in the United States each year. People who are at risk for severe illness include infants, elderly, organ-transplant recipients, and the immunocompromised.": null
    },
    {
        "While in developed countries, nontyphoidal serotypes present mostly as gastrointestinal disease, in sub-Saharan Africa, these serotypes can create a major problem in bloodstream infections, and are the most commonly isolated bacteria from the blood of those presenting with fever. Bloodstream infections caused by nontyphoidal salmonellae in Africa were reported in 2012 to have a ": null
    },
    {
        "case fatality rate": "https://en.wikipedia.org/wiki/Case_fatality_rate"
    },
    {
        " of 20–25%. Most cases of invasive nontyphoidal salmonella infection (iNTS) are caused by S. typhimurium or S. enteritidis. A new form of Salmonella typhimurium (ST313) emerged in the southeast of the African continent 75 years ago, followed by a second wave which came out of central Africa 18 years later. This second wave of iNTS possibly originated in the Congo Basin, and early in the event picked up a gene that made it resistant to the antibiotic ": null
    },
    {
        "chloramphenicol": "https://en.wikipedia.org/wiki/Chloramphenicol"
    },
    {
        ". This created the need to use expensive antimicrobial drugs in areas of Africa that were very poor, making treatment difficult. The increased prevalence of iNTS in sub-Saharan Africa compared to other regions is thought to be due to the large proportion of the African population with some degree of immune suppression or impairment due to the burden of HIV, malaria, and malnutrition, especially in children. The genetic makeup of iNTS is evolving into a more typhoid-like bacterium, able to efficiently spread around the human body. Symptoms are reported to be diverse, including fever, ": null
    },
    {
        "hepatosplenomegaly": "https://en.wikipedia.org/wiki/Hepatosplenomegaly"
    },
    {
        ", and respiratory symptoms, often with an absence of gastrointestinal symptoms.": null
    },
    {
        "Typhoid fever is caused by Salmonella serotypes which are strictly adapted to humans or higher primates—these include ": null
    },
    {
        "Salmonella typhi": "https://en.wikipedia.org/wiki/Salmonella_enterica_subsp._enterica#Serovars"
    },
    {
        ", Paratyphi A, Paratyphi B, and Paratyphi C. In the systemic form of the disease, salmonellae pass through the lymphatic system of the intestine into the blood of the patients (typhoid form) and are carried to various organs (liver, spleen, kidneys) to form secondary foci (septic form). Endotoxins first act on the vascular and nervous apparatus, resulting in increased permeability and decreased tone of the vessels, upset of thermal regulation, and vomiting and diarrhoea. In severe forms of the disease, enough liquid and electrolytes are lost to upset the water-salt metabolism, decrease the circulating blood volume and arterial pressure, and cause ": null
    },
    {
        "hypovolemic shock": "https://en.wikipedia.org/wiki/Hypovolemia"
    },
    {
        ". ": null
    },
    {
        "Septic shock": "https://en.wikipedia.org/wiki/Septicaemia"
    },
    {
        " may also develop. Shock of mixed character (with signs of both hypovolemic and septic shock) is more common in severe ": null
    },
    {
        "salmonellosis": "https://en.wikipedia.org/wiki/Salmonellosis"
    },
    {
        ". ": null
    },
    {
        "Oliguria": "https://en.wikipedia.org/wiki/Oliguria"
    },
    {
        " and ": null
    },
    {
        "azotemia": "https://en.wikipedia.org/wiki/Azotemia"
    },
    {
        " may develop in severe cases as a result of renal involvement due to ": null
    },
    {
        "hypoxia": "https://en.wikipedia.org/wiki/Hypoxia_(medical)"
    },
    {
        " and ": null
    },
    {
        "toxemia": "https://en.wikipedia.org/wiki/Bacteremia"
    },
    {
        ".": null
    },
    {
        "In Germany, food-borne infections must be reported. From 1990 to 2016, the number of officially recorded cases decreased from about 200,000 to about 13,000 cases. In the United States, about 1,200,000 cases of Salmonella infection are estimated to occur each year. A World Health Organization study estimated that  21,650,974 cases of typhoid fever occurred in 2000, 216,510 of which resulted in death, along with 5,412,744 cases of paratyphoid fever.": null
    },
    {
        "Mechanisms of infection differ between typhoidal and nontyphoidal serotypes, owing to their different targets in the body and the different symptoms that they cause. Both groups must enter by crossing the barrier created by the intestinal cell wall, but once they have passed this barrier, they use different strategies to cause infection.": null
    },
    {
        "Nontyphoidal serotypes preferentially enter ": null
    },
    {
        "M cells": "https://en.wikipedia.org/wiki/Microfold_cell"
    },
    {
        " on the intestinal wall by bacterial-mediated ": null
    },
    {
        "endocytosis": "https://en.wikipedia.org/wiki/Endocytosis"
    },
    {
        ", a process associated with intestinal inflammation and diarrhoea. They are also able to disrupt ": null
    },
    {
        "tight junctions": "https://en.wikipedia.org/wiki/Tight_junction"
    },
    {
        " between the cells of the intestinal wall, impairing the cells' ability to stop the flow of ": null
    },
    {
        "ions": "https://en.wikipedia.org/wiki/Ions"
    },
    {
        ", water, and immune cells into and out of the intestine. The combination of the inflammation caused by bacterial-mediated endocytosis and the disruption of tight junctions is thought to contribute significantly to the induction of diarrhoea.": null
    },
    {
        "Salmonellae are also able to breach the intestinal barrier via ": null
    },
    {
        "phagocytosis": "https://en.wikipedia.org/wiki/Phagocytosis"
    },
    {
        " and trafficking by ": null
    },
    {
        "CD18": "https://en.wikipedia.org/wiki/CD18"
    },
    {
        "-positive immune cells, which may be a mechanism key to typhoidal Salmonella infection. This is thought to be a more stealthy way of passing the intestinal barrier, and may, therefore, contribute to the fact that lower numbers of typhoidal Salmonella are required for infection than nontyphoidal Salmonella.Salmonella cells are able to enter ": null
    },
    {
        "macrophages": "https://en.wikipedia.org/wiki/Macrophage"
    },
    {
        " via ": null
    },
    {
        "macropinocytosis": "https://en.wikipedia.org/wiki/Macropinosome"
    },
    {
        ". Typhoidal serotypes can use this to achieve dissemination throughout the body via the ": null
    },
    {
        "mononuclear phagocyte system": "https://en.wikipedia.org/wiki/Mononuclear_phagocyte_system"
    },
    {
        ", a network of connective tissue that contains immune cells, and surrounds tissue associated with the immune system throughout the body.": null
    },
    {
        "Much of the success of Salmonella in causing infection is attributed to two ": null
    },
    {
        "type III secretion systems": "https://en.wikipedia.org/wiki/Type_III_secretion_system"
    },
    {
        " which function at different times during an infection. One is required for the invasion of ": null
    },
    {
        "nonphagocytic cells": "https://en.wikipedia.org/wiki/Phagocytic_cell"
    },
    {
        ", colonization of the intestine, and induction of intestinal inflammatory responses and diarrhea. The other is important for survival in macrophages and establishment of systemic disease. These systems contain many genes which must work co-operatively to achieve infection.": null
    },
    {
        "The AvrA toxin injected by the SPI1 type III secretion system of S. Typhimurium works to inhibit the ": null
    },
    {
        "innate immune system": "https://en.wikipedia.org/wiki/Innate_immune_system"
    },
    {
        " by virtue of its ": null
    },
    {
        "serine": "https://en.wikipedia.org/wiki/Serine"
    },
    {
        "/": null
    },
    {
        "threonine": "https://en.wikipedia.org/wiki/Threonine"
    },
    {
        "acetyltransferase": "https://en.wikipedia.org/wiki/Acetyltransferase"
    },
    {
        " activity, and requires binding to ": null
    },
    {
        "eukaryotic": "https://en.wikipedia.org/wiki/Eukaryotic_cell"
    },
    {
        " target cell ": null
    },
    {
        "phytic acid": "https://en.wikipedia.org/wiki/Phytic_acid"
    },
    {
        " (IP6). This leaves the host more susceptible to infection.": null
    },
    {
        "Salmonellosis is known to be able to cause ": null
    },
    {
        "back pain": "https://en.wikipedia.org/wiki/Back_pain"
    },
    {
        " or ": null
    },
    {
        "spondylosis": "https://en.wikipedia.org/wiki/Spondylosis"
    },
    {
        ".  It can manifest as five clinical patterns: gastrointestinal tract infection, enteric fever, bacteremia, local infection, and the chronic reservoir state. The initial symptoms are nonspecific fever, weakness, and myalgia among others. In the bacteremia state, it can spread to any parts of the body and this induces localized infection or it forms abscesses. The forms of localized Salmonella infections are arthritis, urinary tract infection, infection of the central nervous system, bone infection, soft tissue infection, etc.  Infection may remain as the latent form for a long time, and when the function of ": null
    },
    {
        "reticular endothelial cells": "https://en.wikipedia.org/wiki/Mononuclear_phagocyte_system"
    },
    {
        " is deteriorated, it may become activated and consequently, it may secondarily induce spreading infection in the bone several months or several years after acute salmonellosis.": null
    },
    {
        "A 2018 ": null
    },
    {
        "Imperial College London": "https://en.wikipedia.org/wiki/Imperial_College_London"
    },
    {
        " study shows how salmonella disrupt specific arms of the ": null
    },
    {
        "immune system": "https://en.wikipedia.org/wiki/Immune_system"
    },
    {
        " (e.g. 3 of 5 ": null
    },
    {
        "NF-kappaB": "https://en.wikipedia.org/wiki/NF-kappaB"
    },
    {
        " proteins) using a family of ": null
    },
    {
        "zinc metalloproteinase": "https://en.wikipedia.org/wiki/Zinc_metalloproteinase"
    },
    {
        " effectors, leaving others untouched.": null
    },
    {
        "A hallmark of Salmonella pathogenesis is the ability of the bacterium to survive and proliferate within ": null
    },
    {
        "phagocytes": "https://en.wikipedia.org/wiki/Phagocyte"
    },
    {
        ".  Phagocytes produce DNA-damaging agents such as ": null
    },
    {
        "nitric oxide": "https://en.wikipedia.org/wiki/Nitric_oxide"
    },
    {
        " and oxygen ": null
    },
    {
        "radicals": "https://en.wikipedia.org/wiki/Radical_(chemistry)"
    },
    {
        " as a defense against pathogens.  Thus, Salmonella species must face attack by molecules that challenge genome integrity.  Buchmeier et al. showed that mutants of S. enterica lacking RecA or RecBC protein function are highly sensitive to oxidative compounds synthesized by macrophages, and furthermore these findings indicate that successful systemic infection by S. enterica requires RecA- and RecBC-mediated recombinational repair of DNA damage.": null
    },
    {
        "S. enterica, through some of its serotypes such as Typhimurium and Enteriditis, shows signs of the ability to infect several different mammalian host species, while other serotypes such as Typhi seem to be restricted to only a few hosts. Some of the ways that Salmonella serotypes have ": null
    },
    {
        "adapted": "https://en.wikipedia.org/wiki/Host_adaptation"
    },
    {
        " to their hosts include loss of genetic material and mutation. In more complex mammalian species, ": null
    },
    {
        "immune systems": "https://en.wikipedia.org/wiki/Immune_system"
    },
    {
        ", which include pathogen specific immune responses, target serovars of Salmonella through binding of antibodies to structures such as flagella. Through the loss of the genetic material that codes for a flagellum to form, Salmonella can evade a host's ": null
    },
    {
        "immune system": "https://en.wikipedia.org/wiki/Immune_system"
    },
    {
        ".mgtC": null
    },
    {
        "leader RNA": "https://en.wikipedia.org/wiki/Five_prime_untranslated_region"
    },
    {
        " from bacteria virulence gene (mgtCBR operon) decreases flagellin production during infection by directly base pairing  with mRNAs of the fljB gene  encoding flagellin and  promotes degradation.  In the study by Kisela et al., more pathogenic serovars of S. enterica were found to have certain adhesins in common that have developed out of convergent evolution. This means that, as these strains of Salmonella have been exposed to similar conditions such as immune systems, similar structures evolved separately to negate these similar, more advanced defenses in hosts.  Still, many questions remain about the way that Salmonella has evolved into so many different types, but Salmonella may have evolved through several phases.  As Baumler et al. have suggested, Salmonella most likely evolved through ": null
    },
    {
        "horizontal gene transfer": "https://en.wikipedia.org/wiki/Horizontal_gene_transfer"
    },
    {
        ", formation of new serovars due to additional ": null
    },
    {
        "pathogenicity islands": "https://en.wikipedia.org/wiki/Pathogenicity_island"
    },
    {
        ". and  an approximation of its ancestry. So, Salmonella could have evolved into its many different serotypes through gaining genetic information from different pathogenic bacteria. The presence of several ": null
    },
    {
        "pathogenicity islands": "https://en.wikipedia.org/wiki/Pathogenicity_island"
    },
    {
        " in the genome of different serotypes has lent credence to this theory.": null
    },
    {
        "Salmonella sv. Newport has signs of adaptation to a plant colonization lifestyle, which may play a role in its disproportionate association with foodborne illness linked to produce. A variety of functions selected for during sv. Newport persistence in tomatoes have been reported to be similar to those selected for in sv. Typhimurium from animal hosts. The papA gene, which is unique to sv. Newport, contributes to the strain's fitness in tomatoes, and has homologs in genomes of other Enterobacteriaceae that are able to colonize plant and animal hosts.": null
    },
    {
        "In addition to its importance as a pathogen, S. enterica serovar Typhimurium has been instrumental in the development of genetic tools that led to an understanding of fundamental bacterial physiology. These developments were enabled by the discovery of the first generalized transducing phage, P22, in Typhimurium that allowed quick and easy genetic exchange that allowed fine structure genetic analysis. The large number of mutants led to a revision of genetic nomenclature for bacteria. Many of the uses of transposons as genetic tools, including transposon delivery, mutagenesis, construction of chromosome rearrangements, were also developed in Typhimurium. These genetic tools also led to a simple test for carcinogens, the Ames test.": null
    }
]