[
    {
        "The coyote (from ": null
    },
    {
        "Nahuatl": "https://en.wikipedia.org/wiki/Nahuatl"
    },
    {
        "coyōtl), prairie wolf or brush wolf (Canis latrans) is a ": null
    },
    {
        "canine": "https://en.wikipedia.org/wiki/Canis"
    },
    {
        " native to ": null
    },
    {
        "North America": "https://en.wikipedia.org/wiki/North_America"
    },
    {
        ". It is smaller than its close relative, the ": null
    },
    {
        "gray wolf": "https://en.wikipedia.org/wiki/Wolf"
    },
    {
        ", and slightly smaller than the closely related ": null
    },
    {
        "eastern wolf": "https://en.wikipedia.org/wiki/Eastern_wolf"
    },
    {
        " and ": null
    },
    {
        "red wolf": "https://en.wikipedia.org/wiki/Red_wolf"
    },
    {
        ". It fills much of the same ": null
    },
    {
        "ecological niche": "https://en.wikipedia.org/wiki/Ecological_niche"
    },
    {
        " as the ": null
    },
    {
        "golden jackal": "https://en.wikipedia.org/wiki/Golden_jackal"
    },
    {
        " does in ": null
    },
    {
        "Eurasia": "https://en.wikipedia.org/wiki/Eurasia"
    },
    {
        ", though it is larger and more predatory, and is sometimes called the American ": null
    },
    {
        "jackal": "https://en.wikipedia.org/wiki/Jackal"
    },
    {
        " by zoologists.": null
    },
    {
        "The coyote is listed as ": null
    },
    {
        "least concern": "https://en.wikipedia.org/wiki/Least_Concern"
    },
    {
        " by the ": null
    },
    {
        "International Union for Conservation of Nature": "https://en.wikipedia.org/wiki/International_Union_for_Conservation_of_Nature"
    },
    {
        " due to its wide distribution and abundance throughout North America, southwards through ": null
    },
    {
        "Mexico": "https://en.wikipedia.org/wiki/Mexico"
    },
    {
        ", and into ": null
    },
    {
        "Central America": "https://en.wikipedia.org/wiki/Central_America"
    },
    {
        ". The species is versatile, able to adapt to and expand into environments modified by humans. It is enlarging its range, with coyotes moving into urban areas in the Eastern U.S., and was sighted in eastern Panama (across the ": null
    },
    {
        "Panama Canal": "https://en.wikipedia.org/wiki/Panama_Canal"
    },
    {
        " from their home range) for the first time in 2013.": null
    },
    {
        "As of 2005, 19 coyote ": null
    },
    {
        "subspecies": "https://en.wikipedia.org/wiki/Subspecies"
    },
    {
        " are recognized. The average male weighs 8 to 20 kg (18 to 44 lb) and the average female 7 to 18 kg (15 to 40 lb). Their fur color is predominantly light gray and red or ": null
    },
    {
        "fulvous": "https://en.wikipedia.org/wiki/Fulvous"
    },
    {
        " interspersed with black and white, though it varies somewhat with geography. It is highly flexible in social organization, living either in a family unit or in loosely knit packs of unrelated individuals. It has a varied diet consisting primarily of animal meat, including ": null
    },
    {
        "deer": "https://en.wikipedia.org/wiki/Deer"
    },
    {
        ", ": null
    },
    {
        "rabbits": "https://en.wikipedia.org/wiki/Rabbit"
    },
    {
        ", ": null
    },
    {
        "hares": "https://en.wikipedia.org/wiki/Hare"
    },
    {
        ", ": null
    },
    {
        "rodents": "https://en.wikipedia.org/wiki/Rodent"
    },
    {
        ", ": null
    },
    {
        "birds": "https://en.wikipedia.org/wiki/Bird"
    },
    {
        ", ": null
    },
    {
        "reptiles": "https://en.wikipedia.org/wiki/Reptile"
    },
    {
        ", ": null
    },
    {
        "amphibians": "https://en.wikipedia.org/wiki/Amphibian"
    },
    {
        ", ": null
    },
    {
        "fish": "https://en.wikipedia.org/wiki/Fish"
    },
    {
        ", and ": null
    },
    {
        "invertebrates": "https://en.wikipedia.org/wiki/Invertebrate"
    },
    {
        ", though it may also eat fruits and vegetables on occasion. Its characteristic vocalization is a howl made by solitary individuals. Humans are the coyote's greatest threat, followed by ": null
    },
    {
        "cougars": "https://en.wikipedia.org/wiki/North_American_cougar"
    },
    {
        " and gray wolves. In spite of this, coyotes sometimes mate with gray, eastern, or red wolves, producing \"": null
    },
    {
        "coywolf": "https://en.wikipedia.org/wiki/Coywolf"
    },
    {
        "\" hybrids. In the northeastern regions of North America, the ": null
    },
    {
        "eastern coyote": "https://en.wikipedia.org/wiki/Eastern_coyote"
    },
    {
        " (a larger subspecies, though still smaller than wolves) is the result of various historical and recent matings with various types of wolves. Genetic studies show that most North American wolves contain some level of coyote DNA.": null
    },
    {
        "The coyote is a prominent character in ": null
    },
    {
        "Native American": "https://en.wikipedia.org/wiki/Indigenous_peoples_of_the_Americas"
    },
    {
        " folklore, mainly in the ": null
    },
    {
        "Southwestern United States": "https://en.wikipedia.org/wiki/Southwestern_United_States"
    },
    {
        " and Mexico, usually depicted as a ": null
    },
    {
        "trickster": "https://en.wikipedia.org/wiki/Trickster"
    },
    {
        " that alternately assumes the form of an actual coyote or a man. As with other trickster figures, the coyote uses deception and humor to rebel against social conventions. The animal was especially respected in ": null
    },
    {
        "Mesoamerican": "https://en.wikipedia.org/wiki/Mesoamerica"
    },
    {
        "cosmology": "https://en.wikipedia.org/wiki/Cosmology"
    },
    {
        " as a symbol of military might. After the ": null
    },
    {
        "European colonization of the Americas": "https://en.wikipedia.org/wiki/European_colonization_of_the_Americas"
    },
    {
        ", it was reviled in ": null
    },
    {
        "Anglo-American": "https://en.wikipedia.org/wiki/Anglo-America"
    },
    {
        " culture as a cowardly and untrustworthy animal. Unlike wolves (gray, eastern, or red), which have undergone an improvement of their public image, attitudes towards the coyote remain largely negative.": null
    },
    {
        "Coyote males average 8 to 20 kg (18 to 44 lb) in weight, while females average 7 to 18 kg (15 to 40 lb), though size varies geographically. Northern subspecies, which average 18 kg (40 lb), tend to grow larger than the southern subspecies of Mexico, which average 11.5 kg (25 lb). Body length ranges on average from 1.0 to 1.35 m (3 ft 3 in to 4 ft 5 in), and tail length 40 cm (16 in), with females being shorter in both body length and height. The largest coyote on record was a male killed near ": null
    },
    {
        "Afton, Wyoming": "https://en.wikipedia.org/wiki/Afton,_Wyoming"
    },
    {
        ", on November19, 1937, which measured 1.5 m (4 ft 11 in) from nose to tail, and weighed 34 kg (75 lb). Scent glands are located at the upper side of the base of the tail and are a bluish-black color.": null
    },
    {
        "The color and texture of the coyote's fur varies somewhat geographically. The hair's predominant color is light gray and red or ": null
    },
    {
        "fulvous": "https://en.wikipedia.org/wiki/Fulvous"
    },
    {
        ", interspersed around the body with black and white. Coyotes living at high elevations tend to have more black and gray shades than their ": null
    },
    {
        "desert": "https://en.wikipedia.org/wiki/Desert"
    },
    {
        "-dwelling counterparts, which are more fulvous or whitish-gray. The coyote's fur consists of short, soft underfur and long, coarse guard hairs. The fur of northern subspecies is longer and denser than in southern forms, with the fur of some Mexican and Central American forms being almost hispid (bristly). Generally, adult coyotes (including coywolf hybrids) have a sable coat color, dark neonatal coat color, bushy tail with an active ": null
    },
    {
        "supracaudal gland": "https://en.wikipedia.org/wiki/Supracaudal_gland"
    },
    {
        ", and a white facial mask.": null
    },
    {
        "Albinism": "https://en.wikipedia.org/wiki/Albinism"
    },
    {
        " is extremely rare in coyotes; out of a total of 750,000 coyotes killed by federal and cooperative hunters between March22, 1938, and June30, 1945, only two were albinos.": null
    },
    {
        "The coyote is typically smaller than the gray wolf, but has longer ears and a relatively larger ": null
    },
    {
        "braincase": "https://en.wikipedia.org/wiki/Neurocranium"
    },
    {
        ", as well as a thinner frame, face, and muzzle. The scent glands are smaller than the gray wolf's, but are the same color. Its fur color variation is much less varied than that of a wolf. The coyote also carries its tail downwards when running or walking, rather than horizontally as the wolf does.": null
    },
    {
        "Coyote tracks can be distinguished from those of dogs by their more elongated, less rounded shape. Unlike dogs, the upper canines of coyotes extend past the ": null
    },
    {
        "mental foramina": "https://en.wikipedia.org/wiki/Mental_foramina"
    },
    {
        ".": null
    },
    {
        "At the time of the European colonization of the Americas, coyotes were largely confined to open plains and arid regions of the western half of the continent. In early post-Columbian historical records, distinguishing between coyotes and wolves is often difficult. One record from 1750 in ": null
    },
    {
        "Kaskaskia, Illinois": "https://en.wikipedia.org/wiki/Kaskaskia,_Illinois"
    },
    {
        ", written by a local priest, noted that the \"wolves\" encountered there were smaller and less daring than European wolves. Another account from the early 1800s in ": null
    },
    {
        "Edwards County": "https://en.wikipedia.org/wiki/Edwards_County,_Illinois"
    },
    {
        " mentioned wolves howling at night, though these were likely coyotes. This species was encountered several times during the ": null
    },
    {
        "Lewis and Clark Expedition": "https://en.wikipedia.org/wiki/Lewis_and_Clark_Expedition"
    },
    {
        " (1804–1806), though it was already well known to European traders on the upper ": null
    },
    {
        "Missouri": "https://en.wikipedia.org/wiki/Missouri_River"
    },
    {
        ". ": null
    },
    {
        "Lewis": "https://en.wikipedia.org/wiki/Meriwether_Lewis"
    },
    {
        ", writing on 5 May 1805, in northeastern ": null
    },
    {
        "Montana": "https://en.wikipedia.org/wiki/Montana"
    },
    {
        ", described the coyote in these terms:": null
    },
    {
        "The small woolf or burrowing dog of the prairies are the inhabitants almost invariably of the open plains; they usually ascociate in bands of ten or twelve sometimes more and burrow near some pass or place much frequented by game; not being able alone to take ": null
    },
    {
        "deer": "https://en.wikipedia.org/wiki/Deer"
    },
    {
        " or goat they are rarely ever found alone but hunt in bands; they frequently watch and seize their prey near their burrows; in these burrows they raise their young and to them they also resort when pursued; when a person approaches them they frequently bark, their note being precisely that of the small dog. They are of an intermediate size between that of the ": null
    },
    {
        "fox": "https://en.wikipedia.org/wiki/Fox"
    },
    {
        " and dog, very active fleet and delicately formed; the ears large erect and pointed the head long and pointed more like that of the fox; tale long ... the hair and fur also resembles the fox, tho' is much coarser and inferior. They are of a pale redish-brown colour. The eye of a deep sea green colour small and piercing. Their [claws] are reather longer than those of the ordinary wolf or that common to the Atlantic states, none of which are to be found in this quarter, nor I believe above the river Plat.": null
    },
    {
        "The coyote was first scientifically described by ": null
    },
    {
        "naturalist": "https://en.wikipedia.org/wiki/Naturalist"
    },
    {
        "Thomas Say": "https://en.wikipedia.org/wiki/Thomas_Say"
    },
    {
        " in September 1819, on the site of Lewis and Clark's Council Bluffs, fifteen miles up the Missouri River from the mouth of the Platte during a ": null
    },
    {
        "government-sponsored expedition": "https://en.wikipedia.org/wiki/Stephen_Harriman_Long#1817-23_expeditions_up_the_Missouri_and_Platte_Rivers"
    },
    {
        " with Major ": null
    },
    {
        "Stephen Long": "https://en.wikipedia.org/wiki/Stephen_Harriman_Long"
    },
    {
        ". He had the first edition of the Lewis and Clark journals in hand, which contained Biddle's edited version of Lewis's observations dated 5 May 1805. His account was published in 1823. ": null
    },
    {
        "Say": "https://en.wikipedia.org/wiki/Thomas_Say"
    },
    {
        " was the first person to document the difference between a \"prairie wolf\" (coyote) and on the next page of his journal a wolf which he named Canis nubilus (": null
    },
    {
        "Great Plains wolf": "https://en.wikipedia.org/wiki/Great_Plains_wolf"
    },
    {
        "). Say described the coyote as:": null
    },
    {
        "Canis latrans. Cinereous or gray, varied with black above, and dull fulvous, or cinnamon; hair at base dusky plumbeous, in the middle of its length dull cinnamon, and at tip gray or black, longer on the vertebral line; ears erect, rounded at tip, cinnamon behind, the hair dark plumbeous at base, inside lined with gray hair; eyelids edged with black, superior eyelashes black beneath, and at tip above; supplemental lid margined with black-brown before, and edged with black brown behind; iris yellow; pupil black-blue; spot upon the lachrymal sac black-brown; ": null
    },
    {
        "rostrum": "https://en.wikipedia.org/wiki/Rostrum_(anatomy)"
    },
    {
        " cinnamon, tinctured with grayish on the nose; lips white, edged with black, three series of black seta; head between the ears intermixed with gray, and dull cinnamon, hairs dusky plumbeous at base; sides paler than the back, obsoletely fasciate with black above the legs; legs cinnamon on the outer side, more distinct on the posterior hair: a dilated black abbreviated line on the anterior ones near the wrist; tail bushy, fusiform, straight, varied with gray and cinnamon, a spot near the base above, and tip black; the tip of the trunk of the tail, attains the tip of the ": null
    },
    {
        "os calcis": "https://en.wikipedia.org/wiki/Calcaneus"
    },
    {
        ", when the leg is extended; beneath white, immaculate, tail cinnamon towards the tip, tip black; posterior feet four toed, anterior five toed.": null
    },
    {
        "The earliest written reference to the species comes from the ": null
    },
    {
        "naturalist": "https://en.wikipedia.org/wiki/Naturalist"
    },
    {
        "Francisco Hernández's": "https://en.wikipedia.org/wiki/Francisco_Hern%C3%A1ndez_de_Toledo"
    },
    {
        "Plantas y Animales de la Nueva España (1651), where it is described as a \"Spanish fox\" or \"jackal\". The first published usage of the word \"coyote\" (which is a Spanish borrowing of its ": null
    },
    {
        "Nahuatl": "https://en.wikipedia.org/wiki/Nahuatl"
    },
    {
        " name coyōtl) comes from the ": null
    },
    {
        "historian": "https://en.wikipedia.org/wiki/Historian"
    },
    {
        "Francisco Javier Clavijero": "https://en.wikipedia.org/wiki/Francisco_Javier_Clavijero"
    },
    {
        "'s Historia de México in 1780. The first time it was used in ": null
    },
    {
        "English": "https://en.wikipedia.org/wiki/English_language"
    },
    {
        " occurred in ": null
    },
    {
        "William Bullock": "https://en.wikipedia.org/wiki/William_Bullock_(collector)"
    },
    {
        "'s Six months' residence and travels in Mexico (1824), where it is variously transcribed as cayjotte and cocyotie. The word's spelling was standardized as \"coyote\" by the 1880s. Alternative English names for the coyote include \"prairie wolf\", \"brush wolf\", \"cased wolf\", \"little wolf\" and \"American jackal\". Its ": null
    },
    {
        "binomial name": "https://en.wikipedia.org/wiki/Binomial_name"
    },
    {
        "Canis latrans translates to \"barking dog\", a reference to the many vocalizations they produce.": null
    },
    {
        "Xiaoming Wang": "https://en.wikipedia.org/wiki/Xiaoming_Wang_(paleontologist)"
    },
    {
        " and ": null
    },
    {
        "Richard H. Tedford": "https://en.wikipedia.org/wiki/Richard_H._Tedford"
    },
    {
        ", one of the foremost ": null
    },
    {
        "authorities": "https://en.wikipedia.org/wiki/Author_citation_(zoology)"
    },
    {
        " on carnivore evolution, proposed that the genus Canis was the descendant of the coyote-like ": null
    },
    {
        "Eucyon davisi": "https://en.wikipedia.org/wiki/Eucyon_davisi"
    },
    {
        " and its remains first appeared in the ": null
    },
    {
        "Miocene": "https://en.wikipedia.org/wiki/Miocene"
    },
    {
        " 6million years ago (Mya) in the southwestern US and Mexico. By the ": null
    },
    {
        "Pliocene": "https://en.wikipedia.org/wiki/Pliocene"
    },
    {
        " (5Mya), the larger ": null
    },
    {
        "Canis lepophagus": "https://en.wikipedia.org/wiki/Canis_lepophagus"
    },
    {
        " appeared in the same region and by the ": null
    },
    {
        "early Pleistocene": "https://en.wikipedia.org/wiki/Early_Pleistocene"
    },
    {
        " (1Mya) C.latrans (the coyote) was in existence. They proposed that the progression from Eucyon davisi to Clepophagus to the coyote was linear evolution. Additionally, C.latrans and C. aureus are closely related to ": null
    },
    {
        "C.edwardii": "https://en.wikipedia.org/wiki/Canis_edwardii"
    },
    {
        ", a species that appeared earliest spanning the mid-": null
    },
    {
        "Blancan": "https://en.wikipedia.org/wiki/Blancan"
    },
    {
        " (": null
    },
    {
        "late Pliocene": "https://en.wikipedia.org/wiki/Late_Pliocene"
    },
    {
        ") to the close of the ": null
    },
    {
        "Irvingtonian": "https://en.wikipedia.org/wiki/Irvingtonian"
    },
    {
        " (late Pleistocene), and coyote remains indistinguishable from C.latrans were contemporaneous with C.edwardii in North America. Johnston describes C.lepophagus as having a more slender skull and skeleton than the modern coyote. Ronald Nowak found that the early populations had small, delicate, narrowly proportioned skulls that resemble small coyotes and appear to be ancestral to C.latrans.": null
    },
    {
        "C. lepophagus was similar in weight to modern coyotes, but had shorter limb bones that indicates a less ": null
    },
    {
        "cursorial": "https://en.wikipedia.org/wiki/Cursorial"
    },
    {
        " lifestyle. The coyote represents a more primitive form of Canis than the gray wolf, as shown by its relatively small size and its comparatively narrow skull and jaws, which lack the grasping power necessary to hold the large prey in which wolves specialize. This is further corroborated by the coyote's ": null
    },
    {
        "sagittal crest": "https://en.wikipedia.org/wiki/Sagittal_crest"
    },
    {
        ", which is low or totally flattened, thus indicating a weaker bite than the wolf's. The coyote is not a specialized carnivore as the wolf is, as shown by the larger chewing surfaces on the ": null
    },
    {
        "molars": "https://en.wikipedia.org/wiki/Molar_(tooth)"
    },
    {
        ", reflecting the species' relative dependence on vegetable matter. In these respects, the coyote resembles the fox-like progenitors of the genus more so than the wolf.": null
    },
    {
        "The oldest fossils that fall within the range of the modern coyote date to 0.74–0.85 ": null
    },
    {
        "Ma": "https://en.wikipedia.org/wiki/Megaannum"
    },
    {
        " (million years) in Hamilton Cave, West Virginia; 0.73 Ma in Irvington, California; 0.35–0.48 Ma in Porcupine Cave, Colorado and in Cumberland Cave, Pennsylvania. Modern coyotes arose 1,000 years after the ": null
    },
    {
        "Quaternary extinction event": "https://en.wikipedia.org/wiki/Quaternary_extinction_event"
    },
    {
        ". Compared to their modern ": null
    },
    {
        "Holocene": "https://en.wikipedia.org/wiki/Holocene"
    },
    {
        " counterparts, ": null
    },
    {
        "Pleistocene coyotes": "https://en.wikipedia.org/wiki/Pleistocene_coyote"
    },
    {
        " (C.l. orcutti) were larger and more robust, likely in response to larger ": null
    },
    {
        "competitors": "https://en.wikipedia.org/wiki/Competition_(biology)"
    },
    {
        " and prey. Pleistocene coyotes were likely more specialized carnivores than their descendants, as their teeth were more adapted to shearing meat, showing fewer grinding surfaces suited for processing vegetation. Their reduction in size occurred within 1000 years of the Quaternary extinction event, when their large prey died out. Furthermore, Pleistocene coyotes were unable to exploit the big-game hunting ": null
    },
    {
        "niche": "https://en.wikipedia.org/wiki/Ecological_niche"
    },
    {
        " left vacant after the extinction of the ": null
    },
    {
        "dire wolf": "https://en.wikipedia.org/wiki/Dire_wolf"
    },
    {
        " (C.dirus), as it was rapidly filled by gray wolves, which likely actively killed off the large coyotes, with ": null
    },
    {
        "natural selection": "https://en.wikipedia.org/wiki/Natural_selection"
    },
    {
        " favoring the modern gracile morph.": null
    },
    {
        "In 1993, a study proposed that the wolves of North America display skull traits more similar to the coyote than wolves from  Eurasia. In 2010, a study found that the coyote was a ": null
    },
    {
        "basal": "https://en.wikipedia.org/wiki/Lineage_(genetic)#Basal_lineage"
    },
    {
        " member of the clade that included the ": null
    },
    {
        "Tibetan wolf": "https://en.wikipedia.org/wiki/Tibetan_wolf"
    },
    {
        ", the ": null
    },
    {
        "domestic dog": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        ", the ": null
    },
    {
        "Mongolian wolf": "https://en.wikipedia.org/wiki/Mongolian_wolf"
    },
    {
        " and the ": null
    },
    {
        "Eurasian wolf": "https://en.wikipedia.org/wiki/Eurasian_wolf"
    },
    {
        ", with the Tibetan wolf diverging early from wolves and domestic dogs. In 2016, a ": null
    },
    {
        "whole-genome": "https://en.wikipedia.org/wiki/Whole_genome_sequencing"
    },
    {
        " DNA study proposed, based on the assumptions made, that all of the North American wolves and coyotes diverged from a common ancestor less than 6,000–117,000 years ago. The study also indicated that all North American wolves have a significant amount of coyote ancestry and all coyotes some degree of wolf ancestry, and that the red wolf and eastern wolf are highly ": null
    },
    {
        "admixed": "https://en.wikipedia.org/wiki/Genetic_admixture"
    },
    {
        " with different proportions of gray wolf and coyote ancestry. The proposed timing of the wolf/coyote divergence conflicts with the finding of a coyote-like specimen in strata dated to 1 Mya.": null
    },
    {
        "Genetic studies relating to wolves or dogs have inferred phylogenetic relationships based on the only reference genome available, that of the Boxer dog. In 2017, the first reference genome of the wolf Canis lupus lupus was mapped to aid future research. In 2018, a study looked at the genomic structure and admixture of North American wolves, wolf-like canids, and coyotes using specimens from across their entire range that mapped the largest dataset of nuclear genome sequences against the wolf reference genome. The study supports the findings of previous studies that North American gray wolves and wolf-like canids were the result of complex gray wolf and coyote mixing. A polar wolf from Greenland and a coyote from Mexico represented the purest specimens. The coyotes fromAlaska, California, Alabama, and Quebec show almost no wolf ancestry. Coyotes from Missouri, Illinois, and Florida exhibit 5–10% wolf ancestry. There was 40%:60% wolf to coyote ancestry in red wolves, 60%:40% in Eastern timber wolves, and 75%:25% in the Great Lakes wolves. There was 10% coyote ancestry in Mexican wolves and the Atlantic Coast wolves, 5% in Pacific Coast and Yellowstone wolves, and less than 3% in Canadian archipelago wolves. If a third canid had been involved in the admixture of the North American wolf-like canids then its genetic signature would have been found in coyotes and wolves, which it has not.": null
    },
    {
        "In 2018, ": null
    },
    {
        "whole genome sequencing": "https://en.wikipedia.org/wiki/Whole_genome_sequencing"
    },
    {
        " was used to compare members of genus Canis. The study indicates that the common ancestor of the coyote and gray ": null
    },
    {
        "wolf": "https://en.wikipedia.org/wiki/Wolf"
    },
    {
        " has genetically ": null
    },
    {
        "admixed": "https://en.wikipedia.org/wiki/Genetic_admixture"
    },
    {
        " with a ": null
    },
    {
        "ghost population": "https://en.wikipedia.org/wiki/Ghost_population"
    },
    {
        " of an extinct unidentified canid. The canid was genetically close to the ": null
    },
    {
        "dhole": "https://en.wikipedia.org/wiki/Dhole"
    },
    {
        " and had evolved after the divergence of the ": null
    },
    {
        "African wild dog": "https://en.wikipedia.org/wiki/African_wild_dog"
    },
    {
        " from the other canid species. The ": null
    },
    {
        "basal": "https://en.wikipedia.org/wiki/Basal_(phylogenetics)"
    },
    {
        " position of the coyote compared to the wolf is proposed to be due to the coyote retaining more of the mitochondrial genome of this unknown canid.": null
    },
    {
        "As of 2005, 19 subspecies are recognized. Geographic variation in coyotes is not great, though taken as a whole, the eastern subspecies (C. l. thamnos and C. l. frustor) are large, dark-colored animals, with a gradual paling in color and reduction in size westward and northward (C. l. texensis, C. l. latrans, C. l. lestes, and C. l. incolatus), a brightening of ": null
    },
    {
        "ochraceous": "https://en.wikipedia.org/wiki/Ochre"
    },
    {
        " tones–deep orange or brown–towards the Pacific coast (C. l. ochropus, C. l. umpquensis), a reduction in size in the Southwestern United States (C. l. microdon, C. l. mearnsi) and a general trend towards dark reddish colors and short muzzles in Mexican and Central American populations.": null
    },
    {
        "Coyotes have occasionally mated with ": null
    },
    {
        "domestic dogs": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        ", sometimes producing crosses colloquially known as \"": null
    },
    {
        "coydogs": "https://en.wikipedia.org/wiki/Coydog"
    },
    {
        "\". Such matings are rare in the wild, as the mating cycles of dogs and coyotes do not coincide, and coyotes are usually antagonistic towards dogs. Hybridization usually only occurs when coyotes are expanding into areas where conspecifics are few, and dogs are the only alternatives. Even then, pup survival rates are lower than normal, as dogs do not form pair bonds with coyotes, thus making the rearing of pups more difficult. In captivity, ": null
    },
    {
        "F hybrids": "https://en.wikipedia.org/wiki/F1_hybrid"
    },
    {
        " (first generation) tend to be more mischievous and less manageable as pups than dogs, and are less trustworthy on maturity than ": null
    },
    {
        "wolf-dog hybrids": "https://en.wikipedia.org/wiki/Wolfdog"
    },
    {
        ". Hybrids vary in appearance, but generally retain the coyote's . F hybrids tend to be intermediate in form between dogs and coyotes, while F hybrids (second generation) are more varied. Both F and F hybrids resemble their coyote parents in terms of shyness and intrasexual aggression. Hybrids are fertile and can be successfully bred through four generations.": null
    },
    {
        "Melanistic": "https://en.wikipedia.org/wiki/Melanism"
    },
    {
        " coyotes owe their black pelts to a mutation that first arose in domestic dogs. A population of nonalbino white coyotes in Newfoundland owe their coloration to a ": null
    },
    {
        "melanocortin 1 receptor": "https://en.wikipedia.org/wiki/Melanocortin_1_receptor"
    },
    {
        " mutation inherited from ": null
    },
    {
        "Golden Retrievers": "https://en.wikipedia.org/wiki/Golden_Retriever"
    },
    {
        ".": null
    },
    {
        "Coyotes have hybridized with wolves to varying degrees, particularly in eastern ": null
    },
    {
        "North America": "https://en.wikipedia.org/wiki/North_America"
    },
    {
        ". The so-called \"": null
    },
    {
        "eastern coyote": "https://en.wikipedia.org/wiki/Eastern_coyote"
    },
    {
        "\" of northeastern North America probably originated in the aftermath of the extermination of gray and eastern wolves in the northeast, thus allowing coyotes to colonize former wolf ranges and mix with remnant wolf populations. This hybrid is smaller than either the gray or eastern wolf, and holds smaller territories, but is in turn larger and holds more extensive home ranges than the typical western coyote. As of 2010, the eastern coyote's genetic makeup is fairly uniform, with minimal influence from eastern wolves or western coyotes. Adult eastern coyotes are larger than western coyotes, with female eastern coyotes weighing 21% more than male western coyotes. Physical differences become more apparent by the age of 35 days, with eastern coyote pups having longer legs than their western counterparts. Differences in dental development also occurs, with ": null
    },
    {
        "tooth eruption": "https://en.wikipedia.org/wiki/Tooth_eruption"
    },
    {
        " being later, and in a different order in the eastern coyote. Aside from its size, the eastern coyote is physically similar to the western coyote. The four color phases range from dark brown to blond or reddish blond, though the most common phase is gray-brown, with reddish legs, ears, and flanks. No significant differences exist between eastern and western coyotes in aggression and fighting, though eastern coyotes tend to fight less, and are more playful. Unlike western coyote pups, in which fighting precedes play behavior, fighting among eastern coyote pups occurs after the onset of play. Eastern coyotes tend to reach ": null
    },
    {
        "sexual maturity": "https://en.wikipedia.org/wiki/Sexual_maturity"
    },
    {
        " at two years of age, much later than in western coyotes.": null
    },
    {
        "Eastern and red wolves are also products of varying degrees of wolf-coyote hybridization. The eastern wolf probably was a result of a wolf-coyote admixture, combined with extensive ": null
    },
    {
        "backcrossing": "https://en.wikipedia.org/wiki/Backcrossing"
    },
    {
        " with parent gray wolf populations. The red wolf may have originated during a time of declining wolf populations in the southeastern United States, forcing a wolf-coyote hybridization, as well as backcrossing with local parent coyote populations to the extent that about 75–80% of the modern red wolf's genome is of coyote derivation.": null
    },
    {
        "Like the Eurasian golden jackal, the coyote is gregarious, but not as dependent on ": null
    },
    {
        "conspecifics": "https://en.wikipedia.org/wiki/Biological_specificity"
    },
    {
        " as more social canid species like wolves are. This is likely because the coyote is not a specialized hunter of large prey as the latter species is. The basic social unit of a coyote pack is a family containing a reproductive female. However, unrelated coyotes may join forces for companionship, or to bring down prey too large to attack singly. Such \"nonfamily\" packs are only temporary, and may consist of bachelor males, nonreproductive females and subadult young. Families are formed in midwinter, when females enter ": null
    },
    {
        "estrus": "https://en.wikipedia.org/wiki/Estrus"
    },
    {
        ". Pair bonding can occur 2–3 months before actual ": null
    },
    {
        "copulation": "https://en.wikipedia.org/wiki/Copulation_(zoology)"
    },
    {
        " takes place. The ": null
    },
    {
        "copulatory tie": "https://en.wikipedia.org/wiki/Copulatory_tie"
    },
    {
        " can last 5–45 minutes. A female entering estrus attracts males by scent marking and howling with increasing frequency. A single female in heat can attract up to seven reproductive males, which can follow her for as long as a month. Although some squabbling may occur among the males, once the female has selected a mate and copulates, the rejected males do not intervene, and move on once they detect other estrous females. Unlike the wolf, which has been known to practice both ": null
    },
    {
        "monogamous": "https://en.wikipedia.org/wiki/Monogamy_in_animals"
    },
    {
        " and ": null
    },
    {
        "bigamous": "https://en.wikipedia.org/wiki/Bigamous"
    },
    {
        " matings, the coyote is strictly monogamous, even in areas with high coyote densities and abundant food. Females that fail to mate sometimes assist their sisters or mothers in raising their pups, or join their siblings until the next time they can mate. The newly mated pair then establishes a territory and either constructs their own den or cleans out abandoned ": null
    },
    {
        "badger": "https://en.wikipedia.org/wiki/American_badger"
    },
    {
        ", ": null
    },
    {
        "marmot": "https://en.wikipedia.org/wiki/Marmot"
    },
    {
        ", or ": null
    },
    {
        "skunk": "https://en.wikipedia.org/wiki/Skunk"
    },
    {
        " earths. During the pregnancy, the male frequently hunts alone and brings back food for the female. The female may line the den with dried grass or with fur pulled from her belly. The ": null
    },
    {
        "gestation period": "https://en.wikipedia.org/wiki/Gestation_period"
    },
    {
        " is 63 days, with an average litter size of six, though the number fluctuates depending on coyote population density and the abundance of food.": null
    },
    {
        "Coyote pups are born in dens, hollow trees, or under ledges, and weigh 200 to 500 g (0.44 to 1.10 lb) at birth. They are ": null
    },
    {
        "altricial": "https://en.wikipedia.org/wiki/Altricial"
    },
    {
        ", and are completely dependent on ": null
    },
    {
        "milk": "https://en.wikipedia.org/wiki/Milk"
    },
    {
        " for their first 10 days. The ": null
    },
    {
        "incisors": "https://en.wikipedia.org/wiki/Incisor"
    },
    {
        " erupt at about 12 days, the ": null
    },
    {
        "canines": "https://en.wikipedia.org/wiki/Canine_teeth"
    },
    {
        " at 16, and the second ": null
    },
    {
        "premolars": "https://en.wikipedia.org/wiki/Premolar"
    },
    {
        " at 21. Their eyes open after 10 days, by which point the pups become increasingly more mobile, walking by 20 days, and running at the age of six weeks. The parents begin supplementing the pup's diet with regurgitated solid food after 12–15 days. By the age of four to six weeks, when their ": null
    },
    {
        "milk teeth": "https://en.wikipedia.org/wiki/Milk_teeth"
    },
    {
        " are fully functional, the pups are given small food items such as mice, rabbits, or pieces of ungulate carcasses, with ": null
    },
    {
        "lactation": "https://en.wikipedia.org/wiki/Lactation"
    },
    {
        " steadily decreasing after two months. Unlike wolf pups, coyote pups begin seriously fighting (as opposed to play fighting) prior to engaging in play behavior. A common play behavior includes the coyote \"hip-slam\". By three weeks of age, coyote pups bite each other with less inhibition than wolf pups. By the age of four to five weeks, pups have established dominance hierarchies, and are by then more likely to play rather than fight. The male plays an active role in feeding, grooming, and guarding the pups, but abandons them if the female goes missing before the pups are completely ": null
    },
    {
        "weaned": "https://en.wikipedia.org/wiki/Weaning"
    },
    {
        ". The den is abandoned by June to July, and the pups follow their parents in patrolling their territory and hunting. Pups may leave their families in August, though can remain for much longer. The pups attain adult dimensions at eight months, and gain adult weight a month later.": null
    },
    {
        "Individual feeding territories vary in size from 0.4 to 62 km (0.15 to 24 sq mi), with the general concentration of coyotes in a given area depending on food abundance, adequate denning sites, and competition with conspecifics and other predators. The coyote generally does not defend its territory outside of the denning season, and is much less aggressive towards intruders than the wolf is, typically chasing and sparring with them, but rarely killing them. Conflicts between coyotes can arise during times of food shortage. Coyotes mark their territories by ": null
    },
    {
        "raised-leg urination": "https://en.wikipedia.org/wiki/Raised-leg_urination"
    },
    {
        " and ground-scratching.": null
    },
    {
        "Like wolves, coyotes use a den (usually the deserted holes of other species) when gestating and rearing young, though they may occasionally give birth under sagebrushes in the open. Coyote dens can be located in ": null
    },
    {
        "canyons": "https://en.wikipedia.org/wiki/Canyon"
    },
    {
        ", ": null
    },
    {
        "washouts": "https://en.wikipedia.org/wiki/Washout_(erosion)"
    },
    {
        ", ": null
    },
    {
        "coulees": "https://en.wikipedia.org/wiki/Coulee"
    },
    {
        ", ": null
    },
    {
        "banks": "https://en.wikipedia.org/wiki/Bank_(geography)"
    },
    {
        ", rock bluffs, or level ground. Some dens have been found under abandoned homestead shacks, grain bins, drainage pipes, railroad tracks, hollow logs, thickets, and thistles. The den is continuously dug and cleaned out by the female until the pups are born. Should the den be disturbed or infested with fleas, the pups are moved into another den. A coyote den can have several entrances and passages branching out from the main chamber. A single den can be used year after year.": null
    },
    {
        "While the popular consensus is that ": null
    },
    {
        "olfaction": "https://en.wikipedia.org/wiki/Olfaction"
    },
    {
        " is very important for hunting, two studies that experimentally investigated the role of olfactory, auditory, and visual cues found that visual cues are the most important ones for hunting in red foxes and coyotes.": null
    },
    {
        "When hunting large prey, the coyote often works in pairs or small groups. Success in killing large ": null
    },
    {
        "ungulates": "https://en.wikipedia.org/wiki/Ungulate"
    },
    {
        " depends on factors such as snow depth and crust density. Younger animals usually avoid participating in such hunts, with the breeding pair typically doing most of the work. Unlike the wolf, which attacks large prey from the rear, the coyote approaches from the front, lacerating its prey's head and throat. Like other canids, the coyote ": null
    },
    {
        "caches": "https://en.wikipedia.org/wiki/Hoarding_(animal_behavior)"
    },
    {
        " excess food. Coyotes catch mouse-sized rodents by pouncing, whereas ": null
    },
    {
        "ground squirrels": "https://en.wikipedia.org/wiki/Ground_squirrel"
    },
    {
        " are chased. Although coyotes can live in large groups, small prey is typically caught singly. Coyotes have been observed to kill ": null
    },
    {
        "porcupines": "https://en.wikipedia.org/wiki/North_American_porcupine"
    },
    {
        " in pairs, using their paws to flip the rodents on their backs, then attacking the soft underbelly. Only old and experienced coyotes can successfully prey on porcupines, with many predation attempts by young coyotes resulting in them being injured by their prey's quills. Coyotes sometimes ": null
    },
    {
        "urinate": "https://en.wikipedia.org/wiki/Urination"
    },
    {
        " on their food, possibly to claim ownership over it. Recent evidence demonstrates that at least some coyotes have become more nocturnal in hunting, presumably to avoid humans.": null
    },
    {
        "Coyotes may occasionally form ": null
    },
    {
        "mutualistic": "https://en.wikipedia.org/wiki/Mutualism_(biology)"
    },
    {
        " hunting relationships with ": null
    },
    {
        "American badgers": "https://en.wikipedia.org/wiki/American_badger"
    },
    {
        ", assisting each other in digging up rodent prey. The relationship between the two species may occasionally border on apparent \"friendship\", as some coyotes have been observed laying their heads on their badger companions or licking their faces without protest. The amicable interactions between coyotes and badgers were known to pre-Columbian civilizations, as shown on a Mexican jar dated to 1250–1300 ": null
    },
    {
        "CE": "https://en.wikipedia.org/wiki/Current_era"
    },
    {
        " depicting the relationship between the two.": null
    },
    {
        "Being both a gregarious and solitary animal, the variability of the coyote's visual and vocal repertoire is intermediate between that of the solitary foxes and the highly social wolf. The aggressive behavior of the coyote bears more similarities to that of foxes than it does that of wolves and dogs. An aggressive coyote arches its back and lowers its tail. Unlike dogs, which solicit playful behavior by performing a \"play-bow\" followed by a \"play-leap\", play in coyotes consists of a bow, followed by side-to-side head flexions and a series of \"spins\" and \"dives\". Although coyotes will sometimes bite their playmates' scruff as dogs do, they typically approach low, and make upward-directed bites. Pups fight each other regardless of sex, while among adults, aggression is typically reserved for members of the same sex. Combatants approach each other waving their tails and snarling with their jaws open, though fights are typically silent. Males tend to fight in a vertical stance, while females fight on all four paws. Fights among females tend to be more serious than ones among males, as females seize their opponents' forelegs, throat, and shoulders.": null
    },
    {
        "The coyote has been described as \"the most vocal of all [wild] North American mammals\". Its loudness and range of vocalizations was the cause for its binomial name Canis latrans, meaning \"barking dog\". At least 11 different vocalizations are known in adult coyotes. These sounds are divided into three categories: agonistic and alarm, greeting, and contact. Vocalizations of the first category include woofs, growls, huffs, barks, bark howls, yelps, and high-frequency whines. Woofs are used as low-intensity threats or alarms, and are usually heard near den sites, prompting the pups to immediately retreat into their burrows. Growls are used as threats at short distances, but have also been heard among pups playing and copulating males. Huffs are high-intensity threat vocalizations produced by rapid expiration of air. Barks can be classed as both long-distance threat vocalizations and as alarm calls. Bark howls may serve similar functions. Yelps are emitted as a sign of submission, while high-frequency whines are produced by dominant animals acknowledging the submission of subordinates. Greeting vocalizations include low-frequency whines, 'wow-oo-wows', and group yip howls. Low-frequency whines are emitted by submissive animals, and are usually accompanied by tail wagging and muzzle nibbling. The sound known as 'wow-oo-wow' has been described as a \"greeting song\". The group yip howl is emitted when two or more pack members reunite, and may be the final act of a complex greeting ceremony. Contact calls include lone howls and group howls, as well as the previously mentioned group yip howls. The lone howl is the most iconic sound of the coyote, and may serve the purpose of announcing the presence of a lone individual separated from its pack. Group howls are used as both substitute group yip howls and as responses to either lone howls, group howls, or group yip howls.": null
    },
    {
        "Prior to the near extermination of wolves and cougars, the coyote was most numerous in ": null
    },
    {
        "grasslands": "https://en.wikipedia.org/wiki/Grassland"
    },
    {
        " inhabited by ": null
    },
    {
        "bison": "https://en.wikipedia.org/wiki/American_bison"
    },
    {
        ", ": null
    },
    {
        "pronghorn": "https://en.wikipedia.org/wiki/Pronghorn"
    },
    {
        ", ": null
    },
    {
        "elk": "https://en.wikipedia.org/wiki/Elk"
    },
    {
        ", and other deer, doing particularly well in short-grass areas with ": null
    },
    {
        "prairie dogs": "https://en.wikipedia.org/wiki/Prairie_dog"
    },
    {
        ", though it was just as much at home in semiarid areas with ": null
    },
    {
        "sagebrush": "https://en.wikipedia.org/wiki/Sagebrush"
    },
    {
        " and ": null
    },
    {
        "jackrabbits": "https://en.wikipedia.org/wiki/Jackrabbit"
    },
    {
        " or in deserts inhabited by ": null
    },
    {
        "cactus": "https://en.wikipedia.org/wiki/Cactus"
    },
    {
        ", ": null
    },
    {
        "kangaroo rats": "https://en.wikipedia.org/wiki/Kangaroo_rat"
    },
    {
        ", and ": null
    },
    {
        "rattlesnakes": "https://en.wikipedia.org/wiki/Rattlesnake"
    },
    {
        ". As long as it was not in direct competition with the wolf, the coyote ranged from the ": null
    },
    {
        "Sonoran Desert": "https://en.wikipedia.org/wiki/Sonoran_Desert"
    },
    {
        " to the alpine regions of adjoining mountains or the plains and mountainous areas of ": null
    },
    {
        "Alberta": "https://en.wikipedia.org/wiki/Alberta"
    },
    {
        ". With the extermination of the wolf, the coyote's range expanded to encompass broken forests from the tropics of ": null
    },
    {
        "Guatemala": "https://en.wikipedia.org/wiki/Guatemala"
    },
    {
        " and the northern slope of ": null
    },
    {
        "Alaska": "https://en.wikipedia.org/wiki/Alaska"
    },
    {
        ".": null
    },
    {
        "Coyotes walk around 5–16 kilometres (3–10 mi) per day, often along trails such as logging roads and paths; they may use iced-over rivers as travel routes in winter. They are often ": null
    },
    {
        "crepuscular": "https://en.wikipedia.org/wiki/Crepuscular"
    },
    {
        ", being more active around evening and the beginning of the night than during the day. Like many canids, coyotes are competent swimmers, reported to be able to travel at least 0.8 kilometres (0.5 mi) across water.": null
    },
    {
        "The coyote is roughly the North American equivalent of the Eurasian ": null
    },
    {
        "golden jackal": "https://en.wikipedia.org/wiki/Golden_jackal"
    },
    {
        ". Likewise, the coyote is highly versatile in its choice of food, but is primarily carnivorous, with 90% of its diet consisting of meat. Prey species include ": null
    },
    {
        "bison": "https://en.wikipedia.org/wiki/American_bison"
    },
    {
        " (largely as ": null
    },
    {
        "carrion": "https://en.wikipedia.org/wiki/Carrion"
    },
    {
        "), ": null
    },
    {
        "deer": "https://en.wikipedia.org/wiki/Deer"
    },
    {
        ", ": null
    },
    {
        "sheep": "https://en.wikipedia.org/wiki/Sheep"
    },
    {
        ", ": null
    },
    {
        "rabbits": "https://en.wikipedia.org/wiki/Rabbit"
    },
    {
        ", ": null
    },
    {
        "hares": "https://en.wikipedia.org/wiki/Hare"
    },
    {
        ", ": null
    },
    {
        "rodents": "https://en.wikipedia.org/wiki/Rodent"
    },
    {
        ", ": null
    },
    {
        "birds": "https://en.wikipedia.org/wiki/Bird"
    },
    {
        " (especially ": null
    },
    {
        "galliforms": "https://en.wikipedia.org/wiki/Galliforms"
    },
    {
        ", young ": null
    },
    {
        "water birds": "https://en.wikipedia.org/wiki/Water_bird"
    },
    {
        " and ": null
    },
    {
        "pigeons and doves": "https://en.wikipedia.org/wiki/Columbidae"
    },
    {
        "), ": null
    },
    {
        "amphibians": "https://en.wikipedia.org/wiki/Amphibian"
    },
    {
        " (except ": null
    },
    {
        "toads": "https://en.wikipedia.org/wiki/Toad"
    },
    {
        "), ": null
    },
    {
        "lizards": "https://en.wikipedia.org/wiki/Lizard"
    },
    {
        ", ": null
    },
    {
        "snakes": "https://en.wikipedia.org/wiki/Snake"
    },
    {
        ", ": null
    },
    {
        "turtles": "https://en.wikipedia.org/wiki/Turtle"
    },
    {
        " and ": null
    },
    {
        "tortoises": "https://en.wikipedia.org/wiki/Tortoise"
    },
    {
        ", ": null
    },
    {
        "fish": "https://en.wikipedia.org/wiki/Fish"
    },
    {
        ", ": null
    },
    {
        "crustaceans": "https://en.wikipedia.org/wiki/Crustacean"
    },
    {
        ", and ": null
    },
    {
        "insects": "https://en.wikipedia.org/wiki/Insect"
    },
    {
        ". Coyotes may be picky over the prey they target, as animals such as ": null
    },
    {
        "shrews": "https://en.wikipedia.org/wiki/Shrew"
    },
    {
        ", ": null
    },
    {
        "moles": "https://en.wikipedia.org/wiki/Mole_(animal)"
    },
    {
        ", and ": null
    },
    {
        "brown rats": "https://en.wikipedia.org/wiki/Brown_rat"
    },
    {
        " do not occur in their diet in proportion to their numbers. However, ": null
    },
    {
        "terrestrial": "https://en.wikipedia.org/wiki/Terrestrial_animals"
    },
    {
        " and/or burrowing small mammals such as ": null
    },
    {
        "ground squirrels": "https://en.wikipedia.org/wiki/Ground_squirrel"
    },
    {
        " and associated species (": null
    },
    {
        "marmots": "https://en.wikipedia.org/wiki/Marmot"
    },
    {
        ", ": null
    },
    {
        "prairie dogs": "https://en.wikipedia.org/wiki/Prairie_dog"
    },
    {
        ", ": null
    },
    {
        "chipmunks": "https://en.wikipedia.org/wiki/Chipmunk"
    },
    {
        ") as well as ": null
    },
    {
        "voles": "https://en.wikipedia.org/wiki/Vole"
    },
    {
        ", ": null
    },
    {
        "pocket gophers": "https://en.wikipedia.org/wiki/Pocket_gopher"
    },
    {
        ", ": null
    },
    {
        "kangaroo rats": "https://en.wikipedia.org/wiki/Kangaroo_rat"
    },
    {
        " and other ground-favoring rodents may be quite common foods, especially for lone coyotes. More unusual prey include ": null
    },
    {
        "fishers": "https://en.wikipedia.org/wiki/Fisher_(animal)"
    },
    {
        ", young ": null
    },
    {
        "black bear": "https://en.wikipedia.org/wiki/American_black_bear"
    },
    {
        " cubs,": null
    },
    {
        "harp seals": "https://en.wikipedia.org/wiki/Harp_seal"
    },
    {
        " and ": null
    },
    {
        "rattlesnakes": "https://en.wikipedia.org/wiki/Rattlesnake"
    },
    {
        ". Coyotes kill rattlesnakes mostly for food (but also to protect their pups at their dens) by teasing the snakes until they stretch out and then biting their heads and snapping and shaking the snakes. Birds taken by coyotes may range in size from ": null
    },
    {
        "thrashers": "https://en.wikipedia.org/wiki/Thrasher"
    },
    {
        ", ": null
    },
    {
        "larks": "https://en.wikipedia.org/wiki/Lark"
    },
    {
        " and ": null
    },
    {
        "sparrows": "https://en.wikipedia.org/wiki/Passerellidae"
    },
    {
        " to adult ": null
    },
    {
        "wild turkeys": "https://en.wikipedia.org/wiki/Wild_turkey"
    },
    {
        " and, possibly, brooding adult ": null
    },
    {
        "swans": "https://en.wikipedia.org/wiki/Trumpeter_swan"
    },
    {
        " and ": null
    },
    {
        "pelicans": "https://en.wikipedia.org/wiki/American_white_pelican"
    },
    {
        ". If working in packs or pairs, coyotes may have access to larger prey than lone individuals normally take, such as various prey weighing more than 10 kg (22 lb). In some cases, packs of coyotes have dispatched much larger prey such as adult ": null
    },
    {
        "Odocoileus": "https://en.wikipedia.org/wiki/Odocoileus"
    },
    {
        " deer, cow ": null
    },
    {
        "elk": "https://en.wikipedia.org/wiki/Elk"
    },
    {
        ", ": null
    },
    {
        "pronghorns": "https://en.wikipedia.org/wiki/Pronghorn"
    },
    {
        " and  ": null
    },
    {
        "wild sheep": "https://en.wikipedia.org/wiki/Ovis"
    },
    {
        ", although the young fawn, calves and lambs of these animals are considerably more often taken even by packs, as well as ": null
    },
    {
        "domestic sheep": "https://en.wikipedia.org/wiki/Domestic_sheep"
    },
    {
        " and ": null
    },
    {
        "domestic cattle": "https://en.wikipedia.org/wiki/Cattle"
    },
    {
        ". In some cases, coyotes can bring down prey weighing up to 100 to 200 kg (220 to 440 lb) or more. When it comes to adult ungulates such as wild deer, they often exploit them when vulnerable such as those that are infirm, stuck in snow or ice, otherwise winter-weakened or heavily pregnant, whereas less wary domestic ungulates may be more easily exploited.": null
    },
    {
        "Although coyotes prefer fresh meat, they will scavenge when the opportunity presents itself. Excluding the insects, fruit, and grass eaten, the coyote requires an estimated 600 g (1.3 lb) of food daily, or 250 kg (550 lb) annually. The coyote readily ": null
    },
    {
        "cannibalizes": "https://en.wikipedia.org/wiki/Cannibalism_(zoology)"
    },
    {
        " the carcasses of ": null
    },
    {
        "conspecifics": "https://en.wikipedia.org/wiki/Conspecifics"
    },
    {
        ", with coyote fat having been successfully used by coyote hunters as a lure or poisoned bait. The coyote's winter diet consists mainly of large ungulate carcasses, with very little plant matter. Rodent prey increases in importance during the spring, summer, and fall.": null
    },
    {
        "The coyote feeds on a variety of different ": null
    },
    {
        "produce": "https://en.wikipedia.org/wiki/Produce"
    },
    {
        ", including ": null
    },
    {
        "blackberries": "https://en.wikipedia.org/wiki/Blackberry"
    },
    {
        ", ": null
    },
    {
        "blueberries": "https://en.wikipedia.org/wiki/Blueberry"
    },
    {
        ", ": null
    },
    {
        "peaches": "https://en.wikipedia.org/wiki/Peach"
    },
    {
        ", ": null
    },
    {
        "pears": "https://en.wikipedia.org/wiki/Pear"
    },
    {
        ", ": null
    },
    {
        "apples": "https://en.wikipedia.org/wiki/Apple"
    },
    {
        ", ": null
    },
    {
        "prickly pears": "https://en.wikipedia.org/wiki/Opuntia"
    },
    {
        ", ": null
    },
    {
        "chapotes": "https://en.wikipedia.org/wiki/Chapote"
    },
    {
        ", ": null
    },
    {
        "persimmons": "https://en.wikipedia.org/wiki/Persimmon"
    },
    {
        ", ": null
    },
    {
        "peanuts": "https://en.wikipedia.org/wiki/Peanut"
    },
    {
        ", ": null
    },
    {
        "watermelons": "https://en.wikipedia.org/wiki/Watermelon"
    },
    {
        ", ": null
    },
    {
        "cantaloupes": "https://en.wikipedia.org/wiki/Cantaloupe"
    },
    {
        ", and ": null
    },
    {
        "carrots": "https://en.wikipedia.org/wiki/Carrot"
    },
    {
        ". During the winter and early spring, the coyote eats large quantities of grass, such as green ": null
    },
    {
        "wheat": "https://en.wikipedia.org/wiki/Wheat"
    },
    {
        " blades. It sometimes eats unusual items such as ": null
    },
    {
        "cotton cake": "https://en.wikipedia.org/wiki/Cottonseed_meal"
    },
    {
        ", ": null
    },
    {
        "soybean": "https://en.wikipedia.org/wiki/Soybean"
    },
    {
        " meal, domestic animal droppings, ": null
    },
    {
        "beans": "https://en.wikipedia.org/wiki/Bean"
    },
    {
        ", and cultivated ": null
    },
    {
        "grain": "https://en.wikipedia.org/wiki/Grain"
    },
    {
        " such as ": null
    },
    {
        "maize": "https://en.wikipedia.org/wiki/Maize"
    },
    {
        ", wheat, and ": null
    },
    {
        "sorghum": "https://en.wikipedia.org/wiki/Sorghum"
    },
    {
        ".": null
    },
    {
        "In coastal California, coyotes now consume a higher percentage of marine-based food than their ancestors, which is thought to be due to the extirpation of the grizzly bear from this region. In ": null
    },
    {
        "Death Valley": "https://en.wikipedia.org/wiki/Death_Valley"
    },
    {
        ", coyotes may consume great quantities of ": null
    },
    {
        "hawkmoth": "https://en.wikipedia.org/wiki/Hawkmoth"
    },
    {
        "caterpillars": "https://en.wikipedia.org/wiki/Caterpillar"
    },
    {
        " or ": null
    },
    {
        "beetles": "https://en.wikipedia.org/wiki/Beetle"
    },
    {
        " in the spring flowering months.": null
    },
    {
        "In areas where the ranges of coyotes and gray wolves overlap, interference competition and predation by wolves has been hypothesized to limit local coyote densities. Coyote ranges expanded during the 19th and 20th centuries following the extirpation of wolves, while coyotes were driven to extinction on ": null
    },
    {
        "Isle Royale": "https://en.wikipedia.org/wiki/Isle_Royale"
    },
    {
        " after wolves colonized the island in the 1940s. One study conducted in ": null
    },
    {
        "Yellowstone National Park": "https://en.wikipedia.org/wiki/Yellowstone_National_Park"
    },
    {
        ", where both species coexist, concluded that the coyote population in the ": null
    },
    {
        "Lamar River Valley": "https://en.wikipedia.org/wiki/Lamar_River"
    },
    {
        " declined by 39% following the reintroduction of wolves in the 1990s, while coyote populations in wolf inhabited areas of the ": null
    },
    {
        "Grand Teton National Park": "https://en.wikipedia.org/wiki/Grand_Teton_National_Park"
    },
    {
        " are 33% lower than in areas where they are absent. Wolves have been observed to not tolerate coyotes in their vicinity, though coyotes have been known to trail wolves to feed on their kills.": null
    },
    {
        "Coyotes may compete with ": null
    },
    {
        "cougars": "https://en.wikipedia.org/wiki/Cougar"
    },
    {
        " in some areas. In the eastern ": null
    },
    {
        "Sierra Nevadas": "https://en.wikipedia.org/wiki/Sierra_Nevada_(U.S.)"
    },
    {
        ", coyotes compete with cougars over ": null
    },
    {
        "mule deer": "https://en.wikipedia.org/wiki/Mule_deer"
    },
    {
        ". Cougars normally outcompete and dominate coyotes, and may kill them occasionally, thus reducing coyote predation pressure on smaller carnivores such as foxes and ": null
    },
    {
        "bobcats": "https://en.wikipedia.org/wiki/Bobcat"
    },
    {
        ". Coyotes that are killed are sometimes not eaten, perhaps indicating that these compromise competitive interspecies interactions, however there are multiple confirmed cases of cougars also eating coyotes. In northeastern ": null
    },
    {
        "Mexico": "https://en.wikipedia.org/wiki/Mexico"
    },
    {
        ", cougar predation on coyotes continues apace but coyotes were absent from the prey spectrum of sympatric ": null
    },
    {
        "jaguars": "https://en.wikipedia.org/wiki/Jaguar"
    },
    {
        ", apparently due to differing habitat usages.": null
    },
    {
        "Other than by gray wolves and cougars, predation on adult coyotes is relatively rare but multiple other predators can be occasional threats. In some cases, adult coyotes have been preyed upon by both ": null
    },
    {
        "American black": "https://en.wikipedia.org/wiki/American_black_bear"
    },
    {
        " and ": null
    },
    {
        "grizzly bears": "https://en.wikipedia.org/wiki/Grizzly_bear"
    },
    {
        ",": null
    },
    {
        "American alligators": "https://en.wikipedia.org/wiki/American_alligator"
    },
    {
        ", large ": null
    },
    {
        "Canada lynx": "https://en.wikipedia.org/wiki/Canada_lynx"
    },
    {
        " and ": null
    },
    {
        "golden eagles": "https://en.wikipedia.org/wiki/Golden_eagle"
    },
    {
        ". At kill sites and carrion, coyotes, especially if working alone, tend to be dominated by wolves, cougars, bears, ": null
    },
    {
        "wolverines": "https://en.wikipedia.org/wiki/Wolverine"
    },
    {
        " and, usually but not always, ": null
    },
    {
        "eagles": "https://en.wikipedia.org/wiki/Eagle"
    },
    {
        " (i.e., ": null
    },
    {
        "bald": "https://en.wikipedia.org/wiki/Bald_eagle"
    },
    {
        " and golden). When such larger, more powerful and/or more aggressive predators such as these come to a shared feeding site, a coyote may either try to fight, wait until the other predator is done or occasionally share a kill, but if a major danger such as wolves or an adult cougar is present, the coyote will tend to flee.": null
    },
    {
        "Coyotes rarely kill healthy adult ": null
    },
    {
        "red foxes": "https://en.wikipedia.org/wiki/Red_fox"
    },
    {
        ", and have been observed to feed or den alongside them, though they often kill foxes caught in traps. Coyotes may kill fox kits, but this is not a major source of mortality. In southern California, coyotes frequently kill ": null
    },
    {
        "gray foxes": "https://en.wikipedia.org/wiki/Gray_fox"
    },
    {
        ", and these smaller canids tend to avoid areas with high coyote densities.": null
    },
    {
        "In some areas, coyotes share their ranges with bobcats. These two similarly-sized species rarely physically confront one another, though bobcat populations tend to diminish in areas with high coyote densities. However, several studies have demonstrated interference competition between coyotes and bobcats, and in all cases coyotes dominated the interaction. Multiple researchers reported instances of coyotes killing bobcats, whereas bobcats killing coyotes is more rare. Coyotes attack bobcats using a bite-and-shake method similar to what is used on medium-sized prey. Coyotes (both single individuals and groups) have been known to occasionally kill bobcats – in most cases, the bobcats were relatively small specimens, such as adult females and juveniles. However, coyote attacks (by an unknown number of coyotes) on adult male bobcats have occurred. In California, coyote and bobcat populations are not negatively correlated across different habitat types, but predation by coyotes is an important source of mortality in bobcats. Biologist ": null
    },
    {
        "Stanley Paul Young": "https://en.wikipedia.org/wiki/Stanley_Paul_Young"
    },
    {
        " noted that in his entire trapping career, he had never successfully saved a captured bobcat from being killed by coyotes, and wrote of two incidents wherein coyotes chased bobcats up trees. Coyotes have been documented to directly kill ": null
    },
    {
        "Canada lynx": "https://en.wikipedia.org/wiki/Canada_lynx"
    },
    {
        " on occasion, and compete with them for prey, especially ": null
    },
    {
        "snowshoe hares": "https://en.wikipedia.org/wiki/Snowshoe_hare"
    },
    {
        ". In some areas, including central Alberta, lynx are more abundant where coyotes are few, thus interactions with coyotes appears to influence lynx populations more than the availability of snowshoe hares.": null
    },
    {
        "Due to the coyote's wide range and abundance throughout North America, it is listed as ": null
    },
    {
        "Least Concern": "https://en.wikipedia.org/wiki/Least_Concern"
    },
    {
        " by the ": null
    },
    {
        "International Union for Conservation of Nature": "https://en.wikipedia.org/wiki/International_Union_for_Conservation_of_Nature"
    },
    {
        " (IUCN). The coyote's pre-Columbian range was limited to the Southwest and Plains regions of North America, and northern and central Mexico. By the 19th century, the species expanded north and east, expanding further after 1900, coinciding with land conversion and the extirpation of wolves. By this time, its range encompassed the entire North American continent, including all of the United States and Mexico, southward into Central America, and northward into most of Canada and Alaska. This expansion is ongoing, and the species now occupies the majority of areas between 8°N (Panama) and 70°N (northern Alaska).": null
    },
    {
        "Although it was once widely believed that coyotes are recent immigrants to southern Mexico and Central America, aided in their expansion by deforestation, Pleistocene and Early Holocene records, as well as records from the pre-Columbian period and early European colonization show that the animal was present in the area long before modern times. Nevertheless, range expansion did occur south of ": null
    },
    {
        "Costa Rica": "https://en.wikipedia.org/wiki/Costa_Rica"
    },
    {
        " during the late 1970s and northern Panama in the early 1980s, following the expansion of cattle-grazing lands into tropical rain forests. The coyote is predicted to appear in northern ": null
    },
    {
        "Belize": "https://en.wikipedia.org/wiki/Belize"
    },
    {
        " in the near future, as the habitat there is favorable to the species. Concerns have been raised of a possible expansion into South America through the ": null
    },
    {
        "Panamanian Isthmus": "https://en.wikipedia.org/wiki/Isthmus_of_Panama"
    },
    {
        ", should the ": null
    },
    {
        "Darién Gap": "https://en.wikipedia.org/wiki/Dari%C3%A9n_Gap"
    },
    {
        " ever be closed by the ": null
    },
    {
        "Pan-American Highway": "https://en.wikipedia.org/wiki/Pan-American_Highway"
    },
    {
        ". This fear was partially confirmed in January 2013, when the species was recorded in eastern Panama's ": null
    },
    {
        "Chepo District": "https://en.wikipedia.org/wiki/Chepo_District"
    },
    {
        ", beyond the ": null
    },
    {
        "Panama Canal": "https://en.wikipedia.org/wiki/Panama_Canal"
    },
    {
        ".": null
    },
    {
        "A recent genetic study proposes that coyotes were originally not found in the eastern United States. From the 1890s, dense forests were transformed into agricultural land and wolf control implemented on a large scale, leaving a niche for coyotes to disperse into. There were two major dispersals from two populations of genetically distinct coyotes. The first major dispersal to the northeast came in the early 20th century from those coyotes living in the northern Great Plains. These came to New England via the northern Great Lakes region and southern Canada, and to Pennsylvania via the southern Great Lakes region, meeting together in the 1940s in New York and Pennsylvania. These coyotes have hybridized with the remnant gray wolf and eastern wolf populations, which has added to coyote genetic diversity and may have assisted adaptation to the new niche. The second major dispersal to the southeast came in the mid-20th century from Texas and reached the Carolinas in the 1980s. These coyotes have hybridized with the remnant red wolf populations before the 1970s when the red wolf was extirpated in the wild, which has also added to coyote genetic diversity and may have assisted adaptation to this new niche as well. Both of these two major coyote dispersals have experienced rapid population growth and are forecast to meet along the mid-Atlantic coast. The study concludes that for coyotes the long range dispersal, gene flow from local populations, and rapid population growth may be inter-related.": null
    },
    {
        "Among large North American carnivores, the coyote probably carries the largest number of diseases and parasites, likely due to its wide range and varied diet.": null
    },
    {
        "Viral diseases": "https://en.wikipedia.org/wiki/Viral_diseases"
    },
    {
        " known to infect coyotes include ": null
    },
    {
        "rabies": "https://en.wikipedia.org/wiki/Rabies"
    },
    {
        ", ": null
    },
    {
        "canine distemper": "https://en.wikipedia.org/wiki/Canine_distemper"
    },
    {
        ", ": null
    },
    {
        "infectious canine hepatitis": "https://en.wikipedia.org/wiki/Infectious_canine_hepatitis"
    },
    {
        ", four strains of ": null
    },
    {
        "equine encephalitis": "https://en.wikipedia.org/wiki/Equine_encephalitis_(disambiguation)"
    },
    {
        ", and ": null
    },
    {
        "oral papillomatosis": "https://en.wikipedia.org/wiki/Oral_florid_papillomatosis"
    },
    {
        ". By the late 1970s, serious rabies outbreaks in coyotes had ceased to be a problem for over 60 years, though sporadic cases every 1–5 years did occur. Distemper causes the deaths of many pups in the wild, though some specimens can survive infection. ": null
    },
    {
        "Tularemia": "https://en.wikipedia.org/wiki/Tularemia"
    },
    {
        ", a ": null
    },
    {
        "bacterial disease": "https://en.wikipedia.org/wiki/Bacterial_disease"
    },
    {
        ", infects coyotes from tick bites and through their rodent and lagomorph prey, and can be deadly for pups.": null
    },
    {
        "Coyotes can be infected by both ": null
    },
    {
        "demodectic": "https://en.wikipedia.org/wiki/Demodicosis"
    },
    {
        " and ": null
    },
    {
        "sarcoptic mange": "https://en.wikipedia.org/wiki/Sarcoptic_mange"
    },
    {
        ", the latter being the most common. ": null
    },
    {
        "Mite": "https://en.wikipedia.org/wiki/Mite"
    },
    {
        " infestations are rare and incidental in coyotes, while ": null
    },
    {
        "tick": "https://en.wikipedia.org/wiki/Tick"
    },
    {
        " infestations are more common, with seasonal peaks depending on locality (May–August in the Northwest, March–November in Arkansas). Coyotes are only rarely infested with ": null
    },
    {
        "lice": "https://en.wikipedia.org/wiki/Louse"
    },
    {
        ", while ": null
    },
    {
        "fleas": "https://en.wikipedia.org/wiki/Flea"
    },
    {
        " infest coyotes from puphood, though they may be more a source of irritation than serious illness. ": null
    },
    {
        "Pulex simulans": "https://en.wikipedia.org/wiki/Pulex"
    },
    {
        " is the most common species to infest coyotes, while ": null
    },
    {
        "Ctenocephalides canis": "https://en.wikipedia.org/wiki/Ctenocephalides_canis"
    },
    {
        " tends to occur only in places where coyotes and dogs (its primary host) inhabit the same area. Although coyotes are rarely host to ": null
    },
    {
        "flukes": "https://en.wikipedia.org/wiki/Trematoda"
    },
    {
        ", they can nevertheless have serious effects on coyotes, particularly ": null
    },
    {
        "Nanophyetus salmincola": "https://en.wikipedia.org/wiki/Nanophyetus_salmincola"
    },
    {
        ", which can infect them with ": null
    },
    {
        "salmon poisoning disease": "https://en.wikipedia.org/wiki/Salmon_poisoning_disease"
    },
    {
        ", a disease with a 90% mortality rate. Trematode ": null
    },
    {
        "Metorchis conjunctus": "https://en.wikipedia.org/wiki/Metorchis_conjunctus"
    },
    {
        " can also infect coyotes.": null
    },
    {
        "Tapeworms": "https://en.wikipedia.org/wiki/Tapeworm"
    },
    {
        " have been recorded to infest 60–95% of all coyotes examined. The most common species to infest coyotes are ": null
    },
    {
        "Taenia pisiformis": "https://en.wikipedia.org/wiki/Taenia_pisiformis"
    },
    {
        " and ": null
    },
    {
        "Taenia crassiceps": "https://en.wikipedia.org/wiki/Taenia_crassiceps"
    },
    {
        ", which uses cottontail rabbits as intermediate hosts. The largest species known in coyotes is T. hydatigena, which enters coyotes through infected ungulates, and can grow to lengths of 80 to 400 cm (31 to 157 in). Although once largely limited to wolves, ": null
    },
    {
        "Echinococcus granulosus": "https://en.wikipedia.org/wiki/Echinococcus_granulosus"
    },
    {
        " has expanded to coyotes since the latter began colonizing former wolf ranges. The most frequent ": null
    },
    {
        "ascaroid": "https://en.wikipedia.org/wiki/Ascarididae"
    },
    {
        " roundworm in coyotes is ": null
    },
    {
        "Toxascaris leonina": "https://en.wikipedia.org/wiki/Toxascaris_leonina"
    },
    {
        ", which dwells in the coyote's small intestine and has no ill effects, except for causing the host to eat more frequently. ": null
    },
    {
        "Hookworms": "https://en.wikipedia.org/wiki/Hookworm"
    },
    {
        " of the genus ": null
    },
    {
        "Ancylostoma": "https://en.wikipedia.org/wiki/Ancylostoma"
    },
    {
        " infest coyotes throughout their range, being particularly prevalent in humid areas. In areas of high moisture, such as coastal Texas, coyotes can carry up to 250 hookworms each. The blood-drinking ": null
    },
    {
        "A. caninum": "https://en.wikipedia.org/wiki/Ancylostoma_caninum"
    },
    {
        " is particularly dangerous, as it damages the coyote through blood loss and lung congestion. A 10-day-old pup can die from being host to as few as 25 A. caninum worms.": null
    },
    {
        "Coyote features as a ": null
    },
    {
        "trickster": "https://en.wikipedia.org/wiki/Trickster"
    },
    {
        " figure and ": null
    },
    {
        "skin-walker": "https://en.wikipedia.org/wiki/Skin-walker"
    },
    {
        " in the folktales of some ": null
    },
    {
        "Native Americans in the United States": "https://en.wikipedia.org/wiki/Native_Americans_in_the_United_States"
    },
    {
        ", notably several nations in the ": null
    },
    {
        "Southwestern": "https://en.wikipedia.org/wiki/Southwestern_United_States"
    },
    {
        " and ": null
    },
    {
        "Plains": "https://en.wikipedia.org/wiki/Plains_Indians"
    },
    {
        " regions, where he alternately assumes the form of an actual coyote or that of a man. As with other trickster figures, Coyote acts as a picaresque hero who rebels against social convention through deception and humor. Folklorists such as Harris believe coyotes came to be seen as tricksters due to the animal's intelligence and adaptability. After the European colonization of the Americas, ": null
    },
    {
        "Anglo-American": "https://en.wikipedia.org/wiki/Anglo-America"
    },
    {
        " depictions of Coyote are of a cowardly and untrustworthy animal. Unlike the gray wolf, which has undergone a radical improvement of its public image, Anglo-American cultural attitudes towards the coyote remain largely negative.": null
    },
    {
        "In the ": null
    },
    {
        "Maidu": "https://en.wikipedia.org/wiki/Maidu"
    },
    {
        " creation story, Coyote introduces work, suffering, and death to the world. ": null
    },
    {
        "Zuni": "https://en.wikipedia.org/wiki/Zuni_people"
    },
    {
        " lore has Coyote bringing winter into the world by stealing light from the ": null
    },
    {
        "kachinas": "https://en.wikipedia.org/wiki/Kachina"
    },
    {
        ". The ": null
    },
    {
        "Chinook": "https://en.wikipedia.org/wiki/Chinookan_peoples"
    },
    {
        ", Maidu, ": null
    },
    {
        "Pawnee": "https://en.wikipedia.org/wiki/Pawnee_people"
    },
    {
        ", ": null
    },
    {
        "Tohono O'odham": "https://en.wikipedia.org/wiki/Tohono_O%27odham"
    },
    {
        ", and ": null
    },
    {
        "Ute": "https://en.wikipedia.org/wiki/Ute_people"
    },
    {
        " portray the coyote as the companion of ": null
    },
    {
        "The Creator": "https://en.wikipedia.org/wiki/Creator_deity"
    },
    {
        ". A Tohono O'odham ": null
    },
    {
        "flood story": "https://en.wikipedia.org/wiki/Flood_myth"
    },
    {
        " has Coyote helping ": null
    },
    {
        "Montezuma": "https://en.wikipedia.org/wiki/Montezuma_(mythology)"
    },
    {
        " survive a global deluge that destroys humanity. After The Creator creates humanity, Coyote and Montezuma teach people how to live. The ": null
    },
    {
        "Crow": "https://en.wikipedia.org/wiki/Crow_Nation"
    },
    {
        " creation story portrays Old Man Coyote as The Creator. In ": null
    },
    {
        "The Dineh creation story": "https://en.wikipedia.org/wiki/Din%C3%A9_Bahane%CA%BC"
    },
    {
        ", Coyote was present in the First World with First Man and First Woman, though a different version has it being created in the Fourth World. The Navajo Coyote brings death into the world, explaining that without death, too many people would exist, thus no room to plant corn.": null
    },
    {
        "Prior to the ": null
    },
    {
        "Spanish conquest of the Aztec Empire": "https://en.wikipedia.org/wiki/Spanish_conquest_of_the_Aztec_Empire"
    },
    {
        ", Coyote played a significant role in Mesoamerican cosmology. The coyote symbolized military might in ": null
    },
    {
        "Classic era": "https://en.wikipedia.org/wiki/Mesoamerican_chronology#Classic_Era"
    },
    {
        "Teotihuacan": "https://en.wikipedia.org/wiki/Teotihuacan"
    },
    {
        ", with warriors dressing up in coyote costumes to call upon its predatory power. The species continued to be linked to Central Mexican warrior cults in the centuries leading up to the post-Classic Aztec rule. In ": null
    },
    {
        "Aztec mythology": "https://en.wikipedia.org/wiki/Aztec_mythology"
    },
    {
        ", ": null
    },
    {
        "Huehuecóyotl": "https://en.wikipedia.org/wiki/Huehuecoyotl"
    },
    {
        " (meaning \"old coyote\"), the god of dance, music and carnality, is depicted in several codices as a man with a coyote's head. He is sometimes depicted as a ": null
    },
    {
        "womanizer": "https://en.wikipedia.org/wiki/Promiscuity"
    },
    {
        ", responsible for bringing war into the world by seducing ": null
    },
    {
        "Xochiquetzal": "https://en.wikipedia.org/wiki/Xochiquetzal"
    },
    {
        ", the goddess of love.": null
    },
    {
        "Epigrapher": "https://en.wikipedia.org/wiki/Epigraphy"
    },
    {
        "David H. Kelley": "https://en.wikipedia.org/wiki/David_H._Kelley"
    },
    {
        " argued that the god Quetzalcoatl owed its origins to pre-Aztec ": null
    },
    {
        "Uto-Aztecan": "https://en.wikipedia.org/wiki/Uto-Aztecan_languages"
    },
    {
        " mythological depictions of the coyote, which is portrayed as mankind's \"Elder Brother\", a creator, seducer, trickster, and culture hero linked to the morning star.": null
    },
    {
        "Coyote attacks on humans are uncommon and rarely cause serious injuries, due to the relatively small size of the coyote, but have been increasingly frequent, especially in ": null
    },
    {
        "California": "https://en.wikipedia.org/wiki/California"
    },
    {
        ". There have been only two confirmed fatal attacks: one on a three-year-old named ": null
    },
    {
        "Kelly Keen": "https://en.wikipedia.org/wiki/Kelly_Keen_coyote_attack"
    },
    {
        " in ": null
    },
    {
        "Glendale, California": "https://en.wikipedia.org/wiki/Glendale,_California"
    },
    {
        " and another on a nineteen-year-old named ": null
    },
    {
        "Taylor Mitchell": "https://en.wikipedia.org/wiki/Taylor_Mitchell"
    },
    {
        " in ": null
    },
    {
        "Nova Scotia": "https://en.wikipedia.org/wiki/Nova_Scotia"
    },
    {
        ", Canada. In the 30 years leading up to March 2006, at least 160 attacks occurred in the United States, mostly in the ": null
    },
    {
        "Los Angeles County": "https://en.wikipedia.org/wiki/Los_Angeles_County"
    },
    {
        " area. Data from ": null
    },
    {
        "United States Department of Agriculture": "https://en.wikipedia.org/wiki/United_States_Department_of_Agriculture"
    },
    {
        " (USDA) Wildlife Services, the California Department of Fish and Game, and other sources show that while 41 attacks occurred during the period of 1988–1997, 48 attacks were verified from 1998 through 2003. The majority of these incidents occurred in Southern California near the suburban-wildland interface.": null
    },
    {
        "In the absence of the harassment of coyotes practiced by rural people, urban coyotes are losing their fear of humans, which is further worsened by people intentionally or unintentionally feeding coyotes. In such situations, some coyotes have begun to act aggressively toward humans, chasing joggers and bicyclists, confronting people walking their dogs, and stalking small children. Non-rabid coyotes in these areas sometimes target small children, mostly under the age of 10, though some adults have been bitten.": null
    },
    {
        "Although media reports of such attacks generally identify the animals in question as simply \"coyotes\", research into the genetics of the eastern coyote indicates those involved in attacks in northeast North America, including Pennsylvania, New York, New England, and eastern Canada, may have actually been coywolves, hybrids of Canis latrans and C. lupus, not fully coyotes.": null
    },
    {
        "Coyotes are presently the most abundant livestock predators in western North America, causing the majority of sheep, goat, and cattle losses. For example, according to the ": null
    },
    {
        "National Agricultural Statistics Service": "https://en.wikipedia.org/wiki/National_Agricultural_Statistics_Service"
    },
    {
        ", coyotes were responsible for 60.5% of the 224,000 sheep deaths attributed to predation in 2004. The total number of sheep deaths in 2004 comprised 2.22% of the total sheep and lamb population in the United States, which, according to the National Agricultural Statistics Service USDA report, totaled 4.66 million and 7.80 million heads respectively as of July 1, 2005. Because coyote populations are typically many times greater and more widely distributed than those of wolves, coyotes cause more overall predation losses. United States government agents routinely shoot, poison, trap, and kill about 90,000 coyotes each year to protect livestock. An Idaho census taken in 2005 showed that individual coyotes were 5% as likely to attack livestock as individual wolves. In Utah, more than 11,000 coyotes were killed for bounties totaling over $500,000 in the fiscal year ending June 30, 2017.": null
    },
    {
        "Livestock guardian dogs": "https://en.wikipedia.org/wiki/Livestock_guardian_dog"
    },
    {
        " are commonly used to aggressively repel predators and have worked well in both fenced pasture and range operations. A 1986 survey of sheep producers in the USA found that 82% reported the use of dogs represented an economic asset.": null
    },
    {
        "Re-wilding cattle, which involves increasing the natural protective tendencies of cattle, is a method for controlling coyotes discussed by ": null
    },
    {
        "Temple Grandin": "https://en.wikipedia.org/wiki/Temple_Grandin"
    },
    {
        " of Colorado State University. This method is gaining popularity among producers who allow their herds to calve on the range and whose cattle graze open pastures throughout the year.": null
    },
    {
        "Coyotes typically bite the throat just behind the jaw and below the ear when attacking adult sheep or goats, with death commonly resulting from suffocation. Blood loss is usually a secondary cause of death. Calves and heavily fleeced sheep are killed by attacking the flanks or hindquarters, causing shock and blood loss. When attacking smaller prey, such as young lambs, the kill is made by biting the skull and spinal regions, causing massive tissue and bone damage. Small or young prey may be completely carried off, leaving only blood as evidence of a kill. Coyotes usually leave the hide and most of the skeleton of larger animals relatively intact, unless food is scarce, in which case they may leave only the largest bones. Scattered bits of wool, skin, and other parts are characteristic where coyotes feed extensively on larger carcasses.": null
    },
    {
        "Tracks are an important factor in distinguishing coyote from dog predation. Coyote tracks tend to be more oval-shaped and compact than those of domestic dogs, and their claw marks are less prominent and the tracks tend to follow a straight line more closely than those of dogs. With the exception of ": null
    },
    {
        "sighthounds": "https://en.wikipedia.org/wiki/Sighthound"
    },
    {
        ", most dogs of similar weight to coyotes have a slightly shorter stride. Coyote kills can be distinguished from wolf kills by less damage to the underlying tissues in the former. Also, coyote scat tends to be smaller than wolf scat.": null
    },
    {
        "Coyotes are often attracted to ": null
    },
    {
        "dog food": "https://en.wikipedia.org/wiki/Dog_food"
    },
    {
        " and animals that are small enough to appear as prey. Items such as garbage, pet food, and sometimes feeding stations for birds and squirrels attract coyotes into backyards. About three to five pets attacked by coyotes are brought into the Animal Urgent Care hospital of ": null
    },
    {
        "South Orange County": "https://en.wikipedia.org/wiki/South_Orange_County"
    },
    {
        " (California) each week, the majority of which are dogs, since cats typically do not survive the attacks. Scat analysis collected near ": null
    },
    {
        "Claremont, California": "https://en.wikipedia.org/wiki/Claremont,_California"
    },
    {
        ", revealed that coyotes relied heavily on pets as a food source in winter and spring. At one location in Southern California, coyotes began relying on a colony of ": null
    },
    {
        "feral cats": "https://en.wikipedia.org/wiki/Feral_cat"
    },
    {
        " as a food source. Over time, the coyotes killed most of the cats, and then continued to eat the cat food placed daily at the colony site by people who were maintaining the cat colony.Coyotes usually attack smaller-sized dogs, but they have been known to attack even large, powerful breeds such as the ": null
    },
    {
        "Rottweiler": "https://en.wikipedia.org/wiki/Rottweiler"
    },
    {
        " in exceptional cases. Dogs larger than coyotes, such as ": null
    },
    {
        "greyhounds": "https://en.wikipedia.org/wiki/Greyhound"
    },
    {
        ", are generally able to drive them off, and have been known to kill coyotes. Smaller breeds are more likely to suffer injury or death.": null
    },
    {
        "Prior to the mid-19th century, coyote fur was considered worthless. This changed with the diminution of ": null
    },
    {
        "beavers": "https://en.wikipedia.org/wiki/North_American_beaver"
    },
    {
        ", and by 1860, the hunting of coyotes for their fur became a great source of income (75 ": null
    },
    {
        "cents": "https://en.wikipedia.org/wiki/Penny_(United_States_coin)"
    },
    {
        " to ": null
    },
    {
        "$": "https://en.wikipedia.org/wiki/United_States_dollar"
    },
    {
        "1.50 per skin) for ": null
    },
    {
        "wolfers": "https://en.wikipedia.org/wiki/Wolfers_(hunting)"
    },
    {
        " in the ": null
    },
    {
        "Great Plains": "https://en.wikipedia.org/wiki/Great_Plains"
    },
    {
        ". Coyote pelts were of significant economic importance during the early 1950s, ranging in price from $5 to $25 per pelt, depending on locality. The coyote's fur is not durable enough to make rugs, but can be used for coats and jackets, scarves, or muffs. The majority of pelts are used for making ": null
    },
    {
        "trimmings": "https://en.wikipedia.org/wiki/Trim_(sewing)"
    },
    {
        ", such as coat collars and sleeves for women's clothing. Coyote fur is sometimes dyed black as imitation ": null
    },
    {
        "silver fox": "https://en.wikipedia.org/wiki/Silver_fox_(animal)"
    },
    {
        ".": null
    },
    {
        "Coyotes were occasionally eaten by trappers and mountain men during the ": null
    },
    {
        "western expansion": "https://en.wikipedia.org/wiki/Manifest_destiny"
    },
    {
        ". Coyotes sometimes featured in the feasts of the ": null
    },
    {
        "Plains Indians": "https://en.wikipedia.org/wiki/Plains_Indians"
    },
    {
        ", and coyote pups were eaten by the indigenous people of ": null
    },
    {
        "San Gabriel, California": "https://en.wikipedia.org/wiki/San_Gabriel,_California"
    },
    {
        ". The taste of coyote meat has been likened to that of the wolf, and is more tender than ": null
    },
    {
        "pork": "https://en.wikipedia.org/wiki/Pork"
    },
    {
        " when boiled. Coyote fat, when taken in the fall, has been used on occasion to grease leather or eaten as a ": null
    },
    {
        "spread": "https://en.wikipedia.org/wiki/Spread_(food)"
    },
    {
        ".": null
    },
    {
        "Coyotes were probably semidomesticated by various pre-Columbian cultures. Some 19th-century writers wrote of coyotes being kept in native villages in the Great Plains. The coyote is easily tamed as a pup, but can become destructive as an adult. Both full-blooded and hybrid coyotes can be playful and confiding with their owners, but are suspicious and shy of strangers, though coyotes being tractable enough to be used for practical purposes like ": null
    },
    {
        "retrieving": "https://en.wikipedia.org/wiki/Retriever"
    },
    {
        " and ": null
    },
    {
        "pointing": "https://en.wikipedia.org/wiki/Pointing_breed"
    },
    {
        " have been recorded. A tame coyote named \"Butch\", caught in the summer of 1945, had a short-lived career in ": null
    },
    {
        "cinema": "https://en.wikipedia.org/wiki/Film"
    },
    {
        ", appearing in ": null
    },
    {
        "Smoky": "https://en.wikipedia.org/wiki/Smoky_(1946_film)"
    },
    {
        " and ": null
    },
    {
        "Ramrod": "https://en.wikipedia.org/wiki/Ramrod_(film)"
    },
    {
        " before being shot while raiding a henhouse.": null
    }
]