[
    {
        "Northern or North Sami (davvisámegiella; disapproved ": null
    },
    {
        "exonym": "https://en.wikipedia.org/wiki/Exonym"
    },
    {
        "Lappish or Lapp), sometimes also simply referred to as Sami, is the most widely spoken of all ": null
    },
    {
        "Sami languages": "https://en.wikipedia.org/wiki/Sami_languages"
    },
    {
        ". The area where Northern Sami is spoken covers the northern parts of ": null
    },
    {
        "Norway": "https://en.wikipedia.org/wiki/Norway"
    },
    {
        ", ": null
    },
    {
        "Sweden": "https://en.wikipedia.org/wiki/Sweden"
    },
    {
        " and ": null
    },
    {
        "Finland": "https://en.wikipedia.org/wiki/Finland"
    },
    {
        ". The number of Northern Sami speakers is estimated to be somewhere between 15,000 and 25,000. About 2,000 of these live in Finland and between 5,000 and 6,000 in Sweden.": null
    },
    {
        "Among the first printed Sami texts is Svenske och Lappeske ABC Book (\"Swedish and Lappish ABC book\"), written in Swedish and what is likely a form of Northern Sami. It was published in two editions in 1638 and 1640 and includes 30 pages of prayers and confessions of Protestant faith. It has been described as the first book \"with a regular Sami language form\".": null
    },
    {
        "Northern Sami was first described by ": null
    },
    {
        "Knud Leem": "https://en.wikipedia.org/wiki/Knud_Leem"
    },
    {
        " (En lappisk Grammatica efter den Dialect, som bruges af Field-Lapperne udi Porsanger-Fiorden) in 1748 and in dictionaries in 1752 and 1768. One of Leem's fellow grammaticians, who had also assisted him, was ": null
    },
    {
        "Anders Porsanger": "https://en.wikipedia.org/wiki/Anders_Porsanger"
    },
    {
        ", himself Sami and in fact the first Sami to receive higher education, who studied at the Trondheim Cathedral School and other schools, but who was unable to publish his work on Sami due to racist attitudes at the time. The majority of his work has disappeared.": null
    },
    {
        "The mass mobilization during the ": null
    },
    {
        "Alta controversy": "https://en.wikipedia.org/wiki/Alta_controversy"
    },
    {
        " as well as a more tolerant political environment caused a change to the Norwegian policy of assimilation during the last decades of the twentieth century.In Norway, Northern Sami is currently an official language of two ": null
    },
    {
        "counties": "https://en.wikipedia.org/wiki/Counties"
    },
    {
        " (": null
    },
    {
        "Finnmark": "https://en.wikipedia.org/wiki/Finnmark"
    },
    {
        " and ": null
    },
    {
        "Troms": "https://en.wikipedia.org/wiki/Troms"
    },
    {
        ") and six municipalities (": null
    },
    {
        "Kautokeino": "https://en.wikipedia.org/wiki/Kautokeino"
    },
    {
        ", ": null
    },
    {
        "Karasjok": "https://en.wikipedia.org/wiki/Karasjok"
    },
    {
        ", ": null
    },
    {
        "Nesseby": "https://en.wikipedia.org/wiki/Nesseby"
    },
    {
        ", ": null
    },
    {
        "Tana": "https://en.wikipedia.org/wiki/Deatnu_-_Tana"
    },
    {
        ", ": null
    },
    {
        "Porsanger": "https://en.wikipedia.org/wiki/Porsanger"
    },
    {
        " and ": null
    },
    {
        "Gáivuotna": "https://en.wikipedia.org/wiki/G%C3%A1ivuotna"
    },
    {
        " (": null
    },
    {
        "Kåfjord": "https://en.wikipedia.org/wiki/K%C3%A5fjord,_Troms"
    },
    {
        ")). Sami born before 1977 have never learned to write Sami according to the currently used orthography in school, so it is only in recent years that there have been Sami capable of writing their own language for various administrative positions.": null
    },
    {
        "The consonant inventory of Northern Sami is large, contrasting voicing for many consonants. Some analyses of Northern Sami phonology may include preaspirated stops and affricates (, , , , ) and pre-stopped or pre-glottalised nasals (voiceless , , ,  and voiced , , , ). However, these can be treated as clusters for the purpose of phonology, since they are clearly composed of two segments and only the first of these lengthens in quantity 3. The terms \"preaspirated\" and \"pre-stopped\" will be used in this article to describe these combinations for convenience.": null
    },
    {
        "Notes:": null
    },
    {
        "Not all Northern Sami dialects have identical consonant inventories. Some consonants are absent from some dialects, while others are distributed differently.": null
    },
    {
        "Consonants, including ": null
    },
    {
        "clusters": "https://en.wikipedia.org/wiki/Consonant_cluster"
    },
    {
        ", that occur after a stressed syllable can occur in multiple distinctive length types, or quantities. These are conventionally labelled quantity 1, 2 and 3 or Q1, Q2 and Q3 for short. The consonants of a word alternate in a process known as ": null
    },
    {
        "consonant gradation": "https://en.wikipedia.org/wiki/Consonant_gradation"
    },
    {
        ", where consonants appear in different quantities depending on the specific grammatical form. Normally, one of the possibilities is named the strong grade, while the other is named weak grade. The consonants of a weak grade are normally quantity 1 or 2, while the consonants of a strong grade are normally quantity 2 or 3.": null
    },
    {
        "Throughout this article and related articles, consonants that are part of different syllables are written with two consonant letters in IPA, while the lengthening of consonants in quantity 3 is indicated with an IPA length mark ().": null
    },
    {
        "Not all consonants can occur in every quantity type. The following limitations exist:": null
    },
    {
        "When a consonant can occur in all three quantities, quantity 3 is termed \"overlong\".": null
    },
    {
        "In quantity 3, if the syllable coda consists of only ,  or , the additional length of this consonant is realised phonetically as an epenthetic vowel. This vowel assimilates to the quality of the surrounding vowels:": null
    },
    {
        "This does not occur if the second consonant is a dental/alveolar stop, e.g. gielda, phonetically , or sálti, phonetically .": null
    },
    {
        "Northern Sami possesses the following vowels:": null
    },
    {
        "Closing diphthongs such as ái also exist, but these are phonologically composed of a vowel plus one of the semivowels  or . The semivowels still behave as consonants in clusters.": null
    },
    {
        "Not all of these vowel phonemes are equally prevalent; some occur generally while others occur only in specific contexts as the result of sound changes. The following rules apply for stressed syllables:": null
    },
    {
        "The distribution in post-stressed syllables (unstressed syllables following a stressed one) is more restricted:": null
    },
    {
        "In a second unstressed syllable (one that follows another unstressed syllable), no long vowels occur and  and  are the only vowels that occur frequently.": null
    },
    {
        "The standard orthography of Northern Sami distinguishes vowel length in the case of ⟨a⟩  versus ⟨á⟩ , although this is primarily on an etymological basis. Not all instances of ⟨á⟩ are phonemically long, due to both stressed and unstressed vowel shortening. Some dialects also have lengthening of ⟨a⟩ under certain circumstances. Nonetheless, a default length can be assumed for these two letters. For the remaining vowels, vowel length is not indicated in the standard orthography. In reference works, macrons can be placed above long vowels that occur in a position where they can be short. Length of ⟨i⟩ and ⟨u⟩ in a post-stressed syllable is assumed, and not indicated, except in the combinations ⟨ii⟩ and ⟨ui⟩, where these letters can also indicate short vowels.": null
    },
    {
        "The Eastern Finnmark dialects possess additional contrasts that other dialects of Northern Sami do not:": null
    },
    {
        "Some Torne dialects have  and  instead of stressed  and  (from diphthong simplification) as well as unstressed  and .": null
    },
    {
        "Diphthong simplification, also known as ": null
    },
    {
        "umlaut": "https://en.wikipedia.org/wiki/Umlaut_(linguistics)"
    },
    {
        ", is a process whereby a diphthong loses its second component and becomes a long monophthong:": null
    },
    {
        "Historically, diphthong simplification was caused by a short i or u in the following syllable, the same conditioning that still exists in neighbouring ": null
    },
    {
        "Lule Sami": "https://en.wikipedia.org/wiki/Lule_Sami"
    },
    {
        ". In Northern Sami, these vowels have now become short  and , except when followed by , so simplification can occur when the next syllable contains  or , or the sequences  or .": null
    },
    {
        "The process is complicated by two factors. Firstly, vowel length is not indicated in the spelling, so it's not possible to tell whether the first vowel in ui is short or long. It is short in the illative singular and thus causes simplification (viessu \"house\" → vssui \"into the house\"), but it is long in the plural forms and does not cause any simplification (viessūide \"into the houses\"). A second complicating factor is that under some circumstances, original long i and u in unstressed syllables have shortened to e and o (denoted in grammars and dictionaries with an underdot ẹ and ọ to distinguish them). These shortened vowels do not cause simplification, but are indistinguishable from the older originally short vowels that do trigger it. These cases must simply be memorised.": null
    },
    {
        "Shortening of long vowels in unstressed syllables occurs irregularly. It commonly occurs in the first element of a compound word, in a fourth syllable, and in various other unpredictable circumstances. When shortened,  and  are lowered to  and , except before . Shortened vowels are denoted here, and in other reference works, with an underdot: ạ, ẹ, ọ, to distinguish them from originally-short vowels.": null
    },
    {
        "When a long vowel or diphthong occurs in the stressed syllable before the shortened vowel, it becomes half-long/rising.": null
    },
    {
        "When the consonant preceding the shortened vowel is quantity 3, any lengthened elements are shortened so that it becomes quantity 2. However, the resulting consonant is not necessarily the weak-grade equivalent of that consonant. If the consonant was previously affected by consonant lengthening (below), this process shortens it again.": null
    },
    {
        "In the Eastern Finnmark dialects, long vowels as well as diphthongs are shortened before a quantity 3 consonant. This is phonemic due to the loss of length in quantity 3 in these dialects.": null
    },
    {
        "Outside Eastern Finnmark, long  is only shortened before a long preaspirate, not before any other consonants. The shortening of diphthongs remains allophonic due to the preservation of quantity 3 length, but the shortening of long vowels that result from diphthong simplification is phonemic.": null
    },
    {
        "In the Eastern Finnmark dialects, short vowels are lengthened when they occur before a quantity 1 or 2 consonant. Combined with the preceding change, vowel length in stressed syllables becomes conditioned entirely by the following consonant quantity. Moreover, because the coda lengthening in quantity 3 is lost in these dialects, vowel length becomes the only means for distinguishing quantities 3 and 2 in many cases.": null
    },
    {
        "In the Western Finnmark dialects, a short  in a post-stressed syllable is lengthened to  if the preceding consonants are quantity 1 or 2, and the preceding syllable contains a short vowel. Compare the Eastern Finnmark pronunciations of these words under \"stressed vowel lengthening\".": null
    },
    {
        "A long  that originates from this process does not trigger consonant lengthening.": null
    },
    {
        "In dialects outside Eastern Finnmark, in quantity 2, the last coda consonant is lengthened if the following vowel is long, and the preceding vowel is a short monophthong. Since the coda now contains a long consonant, it is considered as quantity 3, but the lengthening is mostly allophonic and is not indicated orthographically. It is phonemic in the Western Finnmark dialects when the following vowel is , because lengthening is triggered by an original long  but not by an original short  that was lengthened (as described above).": null
    },
    {
        "The new consonant may coincide with its Q3 consonant gradation counterpart, effectively making a weak grade strong, or it may still differ in other ways. In particular, no change is made to syllable division, so that in case of Q2 consonants with a doubled final consonant, it is actually the first of this pair that lengthens, making it overlong.": null
    },
    {
        "Lengthening also occurs if the preceding vowel is a close diphthong  or . In this case, the diphthong also shortens before the new quantity 3 consonant.": null
    },
    {
        "Stress is generally not phonemic in Northern Sami; the first syllable of a word always carries primary stress. Like most Sami languages, Northern Sami follows a pattern of alternating (": null
    },
    {
        "trochaic": "https://en.wikipedia.org/wiki/Trochaic"
    },
    {
        ") stress, in which each odd-numbered syllable after the first is secondarily stressed and even-numbered syllables are unstressed. The last syllable of a word is never stressed, unless the word has only one syllable.": null
    },
    {
        "Consequently, words can follow three possible patterns:": null
    },
    {
        "This gives the following pattern, which can be extended indefinitely in theory. S indicates stress, _ indicates no stress:": null
    },
    {
        "The number of syllables, and the resulting stress pattern, is important for grammatical reasons. Words with stems having an even number of syllables from the last  inflect differently from words with stems having an odd number of syllables. This is detailed further in the grammar section.": null
    },
    {
        "In compound words, which consist of several distinct word roots, each word retains its own stress pattern, potentially breaking from the normal trochaic pattern. If the first element of a compound has an odd number of syllables, then there will be a sequence of two unstressed syllables followed by a stressed one, which does not occur in non-compound words. In some cases, the first element of a compound has only one syllable, resulting in two adjacent stressed syllables. Hence, stress is lexically significant in that it can distinguish compounds from non-compounds.": null
    },
    {
        "Recent loanwords generally keep the stress of the language they were borrowed from, assigning secondary stress to the syllable that was stressed in the original word. The normal trochaic pattern can also be broken in this case, but words will still be made to fit into the even or odd inflection patterns. Words with penultimate stress ending in a consonant will follow the odd inflection:": null
    },
    {
        "Words with antepenultimate or earlier stress will have the stress modified, as this is not allowed in Northern Sami:": null
    },
    {
        "Final stress is not allowed, so if the original word has final stress, an extra dummy syllable (generally a) is added in Northern Sami to avoid this.": null
    },
    {
        "As a result of retaining the original stress pattern, some loanwords have sequences of three unstressed syllables, which don't occur in any other environment:": null
    },
    {
        "Conjunctions": "https://en.wikipedia.org/wiki/Conjunctions"
    },
    {
        ", ": null
    },
    {
        "postpositions": "https://en.wikipedia.org/wiki/Postpositions"
    },
    {
        ", ": null
    },
    {
        "particles": "https://en.wikipedia.org/wiki/Grammatical_particle"
    },
    {
        ", and monosyllabic pronouns tend to be unstressed altogether, and therefore fall outside the above rules.": null
    },
    {
        "Sammallahti divides Northern Sami dialects as follows:": null
    },
    {
        "The written language is primarily based on the western Finnmark dialects, with some elements from the eastern Finnmark dialects.": null
    },
    {
        "Features of the western Finnmark dialects are:": null
    },
    {
        "The eastern Finnmark dialects have the following characteristics:": null
    },
    {
        "Northern Sami has a long ": null
    },
    {
        "orthographic": "https://en.wikipedia.org/wiki/Orthography"
    },
    {
        " history, which has had no fewer than 9 ": null
    },
    {
        "Latin alphabets": "https://en.wikipedia.org/wiki/Latin_script"
    },
    {
        ".": null
    },
    {
        "The roots of the current orthography for Northern Sami were laid by ": null
    },
    {
        "Rasmus Rask": "https://en.wikipedia.org/wiki/Rasmus_Rask"
    },
    {
        " who, after discussions with ": null
    },
    {
        "Nils Vibe Stockfleth": "https://en.wikipedia.org/wiki/Nils_Vibe_Stockfleth"
    },
    {
        ", published Ræsonneret lappisk sproglære efter den sprogart, som bruges af fjældlapperne i Porsangerfjorden i Finmarken. En omarbejdelse af Prof. Knud Leems Lappiske grammatica in 1832. Rask opted for a ": null
    },
    {
        "phonemic orthographic": "https://en.wikipedia.org/wiki/Phonemic_orthography"
    },
    {
        " system. All of the orthographies that have been used for Northern Sami trace their roots back to Rask's system, unlike the orthographies used for ": null
    },
    {
        "Lule": "https://en.wikipedia.org/wiki/Lule_Sami"
    },
    {
        " and ": null
    },
    {
        "Southern Sami": "https://en.wikipedia.org/wiki/Southern_Sami"
    },
    {
        ", which are mainly based on the orthographical conventions of ": null
    },
    {
        "Swedish": "https://en.wikipedia.org/wiki/Swedish_language"
    },
    {
        " and ": null
    },
    {
        "Norwegian": "https://en.wikipedia.org/wiki/Norwegian_language"
    },
    {
        ". Following in the tradition of Rask meant that diacritics were used with some consonants (č, đ, ŋ, š, ŧ and ž), which caused data-processing problems before ": null
    },
    {
        "Unicode": "https://en.wikipedia.org/wiki/Unicode"
    },
    {
        " was introduced. Both Stockfleth and ": null
    },
    {
        "J. A. Friis": "https://en.wikipedia.org/wiki/Jens_Andreas_Friis"
    },
    {
        " went on to publish grammar books and dictionaries for Sami. It can be said that Northern Sami was better described than Norwegian was before ": null
    },
    {
        "Ivar Aasen": "https://en.wikipedia.org/wiki/Ivar_Aasen"
    },
    {
        " published his grammar on Norwegian.": null
    },
    {
        "Northern Sami was and is used in three countries, each of which used its own orthography for years. Friis' orthography was used when work on translating the Bible into Northern Sami commenced, in the first Sami newspaper called ": null
    },
    {
        "Saǥai Muittalægje": "https://en.wikipedia.org/wiki/Sa%C7%A5ai_Muittal%C3%A6gje"
    },
    {
        ", and in the Finnemisjonen's own newspaper ": null
    },
    {
        "Nuorttanaste": "https://en.wikipedia.org/wiki/Nuorttanaste"
    },
    {
        ". The groundwork for Northern Sami lexicography was laid by ": null
    },
    {
        "Konrad Nielsen": "https://en.wikipedia.org/wiki/Konrad_Nielsen"
    },
    {
        " who used an orthography of his own creation in his dictionary Lappisk ordbok. Starting in 1948, the orthographies used in Norway and Sweden were combined into a single ": null
    },
    {
        "Bergsland": "https://en.wikipedia.org/wiki/Knut_Bergsland"
    },
    {
        "-": null
    },
    {
        "Ruong": "https://en.wikipedia.org/wiki/Israel_Ruong"
    },
    {
        " orthography. It was not greatly used in Norway. In 1979, an official orthography for Northern Sami was adopted for use in Norway, Sweden and Finland.": null
    },
    {
        "Thus, until the official orthography currently in use was adopted in 1979, each country had its own, slightly different standard, so it is quite possible to come across older books that are difficult to understand for people unacquainted with the orthography:": null
    },
    {
        "(The children have come to school.)": null
    },
    {
        "The first sentence is from Antti Outakoski's Samekiela kiellaoahpa from 1950; the second one is how it would be written according to the current orthography.": null
    },
    {
        "The most recent alphabet was approved in 1979 and last modified in 1985:": null
    },
    {
        "When typing, if there is no way of entering the letters particular to Northern Sami (Áá Čč Đđ Ŋŋ Šš Ŧŧ Žž) correctly, an acute accent is sometimes placed over the corresponding ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_script"
    },
    {
        " letter as a substitute. These substitutions are still found in books printed after the common orthography was adopted due to system limitations when typing.": null
    },
    {
        "Some additional marks are used in dictionaries, grammars and other reference works, including in this article. They are not used in normal writing. The following are used in ": null
    },
    {
        "Pekka Sammallahti": "https://en.wikipedia.org/wiki/Pekka_Sammallahti"
    },
    {
        "'s Sámi-suoma sátnegirji:": null
    },
    {
        "Northern Sami orthography includes many combinations of multiple letters. In most cases, a double consonant letter corresponds to a doubled consonant phoneme, e.g. mm stands for . Overlong (quantity 3) consonants are not distinguished from regular double consonants, but are commonly denoted with a vertical line between the two consonant letters (⟨fˈf⟩, ⟨mˈm⟩, ⟨sˈs⟩ etc.) in reference works.": null
    },
    {
        "Combinations of different consonant letters stand for their equivalent individual phonemes, as described by the pronunciations of the individual letters, above. The last consonant in a sequence may be doubled. This indicates that the consonant cluster is quantity 2, while a cluster with an undoubled last consonant is generally quantity 3. It often also indicates a doubling of the corresponding consonant phoneme, but not if the preceding consonant is voiceless.": null
    },
    {
        "The following details combinations of multiple letters which are exceptions to the general pronunciation rules of each letter.": null
    },
    {
        "The diphthongs, as may be expected, are written using a combination of two letters. Length is not indicated, nor is the distinction between normal and rising diphthongs. This distinction can be inferred by the presence of ⟨e⟩ and ⟨o⟩ in the next syllable (which must always be shortened vowels when following a diphthong), and in reference works by the presence of vowels with an underdot in the next syllable.": null
    },
    {
        "The combinations ⟨dj⟩, ⟨lj⟩ and ⟨nj⟩ indicate ,  and  respectively. The first letter is doubled to indicate longer versions, and a vertical line is then used for overlong .": null
    },
    {
        "In the case of ⟨lj⟩, there are two possible interpretations: as a single quantity 2 consonant , or as a quantity 3 consonant cluster  (e.g. ": null
    },
    {
        "olju": "https://en.wiktionary.org/wiki/olju#Northern_Sami"
    },
    {
        "), although the latter is rare. These two cases are distinguished by their behaviour in consonant gradation. In the first case, ⟨llj⟩ appears in the strong grade while ⟨lj⟩ appears in the weak grade, and these represent overlong  and long  respectively. In the second case, ⟨lj⟩ appears in the strong grade while ⟨ljj⟩ appears in the weak grade, representing the clusters  and  respectively.": null
    },
    {
        "Preaspiration is indicated with a preceding ⟨h⟩. Long preaspiration is indicated by doubling the second letter. This is exactly the opposite of how normal clusters are written.": null
    },
    {
        "Voiceless sonorants are also indicated by a preceding ⟨h⟩, but they have three lengths. Overlong length is indicated by a vertical line in reference works, as with other sonorants.": null
    },
    {
        "Pre-stopped nasal consonants (Q2) are indicated by a preceding letter for a voiceless stop. Voiced pre-stopped nasals (Q3) are written with a voiced stop in place of the voiceless one.": null
    },
    {
        "With just a single consonant between syllables, the hyphen goes before that consonant.": null
    },
    {
        "If a word contains a double consonant letter, the hyphen is always placed between those two letters. The combination ij, when preceded by a vowel, counts as a double consonant and thus gets a hyphen in between.": null
    },
    {
        "With other combinations of two consonants, the hyphen goes between those. Again, if i counts as a consonant, it goes between that and the next one.": null
    },
    {
        "There are a few exceptions where the hyphen goes before all consonants.": null
    },
    {
        "In compound words, a hyphen always goes between two parts of a compound.": null
    },
    {
        "Northern Sami is an ": null
    },
    {
        "agglutinative": "https://en.wikipedia.org/wiki/Agglutinative"
    },
    {
        ", highly inflected language that shares many grammatical features with the other ": null
    },
    {
        "Uralic languages": "https://en.wikipedia.org/wiki/Uralic_languages"
    },
    {
        ". Sami has also developed considerably into the direction of fusional and inflected morphology, much like ": null
    },
    {
        "Estonian": "https://en.wikipedia.org/wiki/Estonian_language"
    },
    {
        " to which it is distantly related. Therefore, morphemes are marked not only by suffixes but also by ": null
    },
    {
        "morphophonological": "https://en.wikipedia.org/wiki/Morphophonology"
    },
    {
        " modifications to the root. Of the various morphophonological alterations, the most important and complex is the system of ": null
    },
    {
        "consonant gradation": "https://en.wikipedia.org/wiki/Consonant_gradation"
    },
    {
        ".": null
    },
    {
        "Consonant gradation is a pattern of alternations between pairs of consonants that appears in the inflection of words. The system of consonant gradation in Northern Sami is complex, especially compared to that found in the Finnic languages. A word stem can appear in two grades: the strong grade and the weak grade. A given word can alternate either between quantity 3 in the strong grade and quantity 2 in the weak grade, or between quantity 2 in the strong grade and quantity 1 in the weak grade. Historically, the weak grade appeared when the syllable following the consonant was closed (ended in a consonant), but the loss of certain vowels or consonants have obscured this in Northern Sami and it is now a more-or-less opaque process.": null
    },
    {
        "In verbs, some nouns, and in some processes of word derivation, a Q2 strong grade can become \"extra strong\" Q3, alternating in all three quantities. This is caused by the historical loss of a consonant (often  or ) between the second and third syllable, which triggered ": null
    },
    {
        "compensatory lengthening": "https://en.wikipedia.org/wiki/Compensatory_lengthening"
    },
    {
        " on the gradating consonant.": null
    },
    {
        "Alternations between quantities 3 and 2 are either consonant clusters or sequences of two identical consonants. In the strong grade, the first consonant forms the coda of the preceding syllable, and the remaining consonants form the onset of the following syllable. In the weak grade, only the last consonant belongs to the onset of the next syllable, and the remaining consonants belong to the coda of the preceding syllable. Thus, when there are three or more consonants, the syllable division changes between the grades. In addition, the strong grade by default has a lengthened consonant in the coda, while this lengthening is generally absent in the weak grade. However, this lengthening is subject to the modifying effects of consonant lengthening and unstressed vowel shortening, which can in some occasions level the length distinctions, so that length not an absolute indicator of grade (though it is of quantity). In Eastern Finnmark, no lengthening is found at all, instead of length the preceding vowel is short, while the vowel becomes long when the length would be absent.": null
    },
    {
        "Doubling of the last consonant is another distinguishing feature of the weak grade, although it only occurs if the preceding consonant is voiced. The additional consonant is always assigned to the coda (the double consonant is split between syllables), so that it obligatorily shifts the syllable boundary relative to the strong grade:": null
    },
    {
        "Consonant lengthening can then, in turn, lengthen the first of this pair again (the one in the coda). In writing, the last consonant is doubled in the weak grade, even if the preceding consonant is voiceless, simply to distinguish the two grades visually:": null
    },
    {
        "Sequences of two identical consonants gradate in the same way, with lengthening of the first consonant in the strong grade (again, subject to modification, and not in Eastern Finnmark), but without any doubling of the last consonant in the weak grade. For most pairs of consonants, no difference is made between the grades orthographically, both are written with a double consonant. In reference works, the special mark ˈ is placed between the consonants to indicate the strong grade.": null
    },
    {
        "Some cases are indicated specially in the orthography, but behave as expected from a phonological point of view:": null
    },
    {
        "In some clusters, there is an alternation in the quality of the first consonant between the two grades.": null
    },
    {
        "Alternations between 2 and 1 are less predictable than alternations between quantities 3 and 2. The weak grade is always represented by a single consonant, which forms the onset of the next syllable, and the preceding syllable has no coda. The corresponding strong grade additionally has a single consonant in the coda, which may the same as the following onset consonant or different. The coda consonant in the strong grade may undergo consonant lengthening to receive additional length.": null
    },
    {
        "A double consonant in the strong grade always alternates with a single consonant in the weak grade. This occurs with all nasals, sonorants and fricatives (except  and ). Orthographically, this is represented as a double versus a single consonant letter.": null
    },
    {
        "A cluster of short  and a voiceless consonant (preaspirated) in the strong grade alternates with a single voiced consonant in the weak grade.": null
    },
    {
        "A cluster of a voiceless pre-stopped nasal in the strong grade drops the stop in the weak grade. In Sea Sami, the strong grade has a double nasal, without the stop.": null
    },
    {
        "Double  alternates with .": null
    },
    {
        "Only a limited number of consonants are allowed at the end of a word. Therefore, consonants will be modified when they come to stand word-finally:": null
    },
    {
        "Certain inflectional endings and derivational suffixes trigger changes in the first unstressed (post-stressed) vowel of the stem. These changes are generally the result of umlaut effects in Proto-Samic. The following changes may be noted. An empty table cell means there is no change, S indicates diphthong simplification.": null
    },
    {
        "There are some vowel alternations that don't have a clear rule or cause. For example, the change of a to á in the present tense third-person singular of verbs is unexpected and must simply be taken as-is. Likewise, the appearance of u or o in some verb imperative forms is not based on any rule, but is an inherent part of the ending.": null
    },
    {
        "All inflected words, whether nouns, adjectives or verbs, can be divided into three main inflectional classes. The division is based on whether there is an even or odd number of syllables from the last stressed syllable to the end of the word.": null
    },
    {
        "For nouns and adjectives, the stem is taken from the accusative/genitive singular rather than the nominative, as the latter often drops the final vowel and sometimes also the preceding consonant. For verbs, the infinitive is used to determine the stem, by removing the infinitive ending -t.": null
    },
    {
        "Words with even and contracted inflection can be divided further, based on the final vowel of the stem. For even-inflected words, this vowel is most commonly a, i or u, while for contracted words it is mostly á, e or o. Words with odd inflection are not differentiated by stem-final vowel.": null
    },
    {
        "Nouns inflect in singular (ovttaidlohku) and plural (máŋggaidlohku), and also in 7 ": null
    },
    {
        "cases": "https://en.wikipedia.org/wiki/Grammatical_case"
    },
    {
        ". The following table shows the general endings; the actual forms can differ based on consonant gradation and the inflection type of the word.": null
    },
    {
        "The accusative and genitive are usually identical. There is no singular-plural distinction in the essive, so for example mánnán is interpreted as either \"as a child\" or \"as children\".": null
    },
    {
        "Nouns with even inflection have consonant gradation of the last consonant in the stem. The strong grade appears in the nominative singular, illative singular and essive, while the weak grade appears in the remaining forms.": null
    },
    {
        "The most common of this type are the nouns with a stem ending in -a, -i or slightly rarer -u.": null
    },
    {
        "Even-syllable nouns with a stem ending in -á, -e or -o also exist, but are much rarer.": null
    },
    {
        "Even-syllable nouns with four or more syllables sometimes drop the final vowel in the nominative singular. Consequently, simplification of the final consonant occurs. The stem of these nouns always ends in -a.": null
    },
    {
        "Nouns with odd inflection have consonant gradation. The weak grade appears in the nominative and essive singular, while the strong grade appears in the remaining forms. Some nouns also have other alternations in the stem of the strong grade, such as changes of i to á, u to o, or addition of a consonant.": null
    },
    {
        "Nouns with contracted inflection have consonant gradation. The pattern follows that of odd-inflection nouns, with the weak grade in the nominative and essive singular, and the strong grade in the remainder. If the weak grade is level 1, the strong grade will be level 3. The final syllable is generally altered along with the gradation as well.": null
    },
    {
        "The possessive suffixes are similar in meaning to the English personal possessive determiners my, your, their and so on. There are 9 possessive suffixes: one for each person in singular, dual and plural. Possessive suffixes attach to the end of a noun, after the case ending. Thus, for example, ruovttus \"in a house\" may become ruovttustan \"in my house\".": null
    },
    {
        "Like noun case endings, the suffixes have different forms depending on whether they are attached to a stem with an even or odd number of syllables, and (in the case of even-syllable stems) depending on the last vowel of the stem. The following table shows the suffixes:": null
    },
    {
        "The suffixes attach to a combination of noun plus case ending, so the stem that the suffix is attached to may not be the stem of the noun. Rather, a new \"possessive stem\" is formed from the noun with its case ending included. This stem is not always identical to the ending of the noun on its own; some case endings undergo modifications or the addition of a final vowel. Thus, certain cases may have possessive stems that inherently end in -a, other cases may have -i, but this is only significant if the combination has an even number of syllables.": null
    },
    {
        "The following table shows the possessive stems for each case, for four of the nouns whose inflection was given above. If the stem ends in a vowel, it is even and the suffixes with the matching vowel are used. If the stem ends in a consonant, it is odd and the odd endings are used.": null
    },
    {
        "In the comitative plural, the possessive suffix attaches between the possessive stem and the final -guin.": null
    },
    {
        "As can be seen in the table, for the nominative, accusative and genitive singular cases, the possessive stem is identical to the noun stem. The stem also undergoes consonant gradation in the accusative and genitive singular forms, and endings beginning with e or o also trigger diphthong simplification. The noun is in the strong grade with the first-person possessive suffixes, and in the weak grade with the second- and third-person possessives.": null
    },
    {
        "The possessive forms of ruoktu are:": null
    },
    {
        "Adjectives inflect the same as nouns do, and have the same cases and inflection types.": null
    },
    {
        "Adjectives also have an additional form, the attributive form (attribuhttahápmi). This form is used when the adjective is used ": null
    },
    {
        "attributively": "https://en.wikipedia.org/wiki/Adjectives#Types_of_use"
    },
    {
        ", where it precedes the noun. The attributive does not receive any endings, so it does not have cases or number. Its formation is also unpredictable: for some adjectives, it's formed from the nominative singular by adding an extra ending of some kind to the stem, while for others the attributive is formed by removing part of the stem. It may also be identical to the nominative singular. Some examples:": null
    },
    {
        "Not all adjectives have an attributive form. For example, the frequently-used adjective buorre \"good\" has only case forms. When there is no attributive form, this doesn't mean it can't be used attributively. Instead, the case and number of the adjective matches that of the noun it is an attribute of (as in for example Finnish).": null
    },
    {
        "The personal pronouns inflect irregularly, and also have a third number, the ": null
    },
    {
        "dual": "https://en.wikipedia.org/wiki/Dual_(grammatical_number)"
    },
    {
        " (guvttiidlohku). The dual is used to refer to exactly two people. The following table shows the forms.": null
    },
    {
        "The five demonstrative determiners/pronouns inflect somewhat irregularly as well. The nominative singular and nominative plural are identical, and some other cases have endings not found in nouns.": null
    },
    {
        "When these words modify a noun rather than standing alone, the demonstrative is in the same case as the noun, with the following exceptions:": null
    },
    {
        "The interrogative/relative pronouns/determiners gii \"who\" and mii \"what\" are likewise irregular.": null
    },
    {
        "In the accusative singular of mii, there are two possible forms. The \"regular\" form man is used when there is an implication of a choice from a limited number of options. The form máid has no such implication.": null
    },
    {
        "These two pronouns, as well as other interrogatives (which inflect regularly) can act as determiners and modify nouns. The rules for which case to use are the same as for the demonstrative. The form máid is followed by a noun in the accusative plural form.": null
    },
    {
        "The reflexive pronoun is ieš (dual and plural ieža), meaning myself, yourself, himself, herself and so on. In its base form, the pronoun occurs only in the nominative case and is never used on its own; it always occurs next to the subject of the sentence, where it acts as an adverb to strengthen it. Compare for example sentences such as I myself have never seen it..": null
    },
    {
        "The other cases can occur by themselves, but only in the singular, and are always used in combination with a possessive suffix that matches the subject of the sentence (i.e. always I see myself, never I see himself). These forms are irregular as well as ": null
    },
    {
        "suppletive": "https://en.wikipedia.org/wiki/Suppletion"
    },
    {
        ": the illative and locative forms derive from completely different roots. There are also several alternative stems.": null
    },
    {
        "The conjugation of Northern Sami ": null
    },
    {
        "verbs": "https://en.wikipedia.org/wiki/Verb"
    },
    {
        " resembles that of Finnish. There are three ": null
    },
    {
        "grammatical persons": "https://en.wikipedia.org/wiki/Grammatical_person"
    },
    {
        " (persovnnat), and three ": null
    },
    {
        "grammatical numbers": "https://en.wikipedia.org/wiki/Grammatical_number"
    },
    {
        " (logut), singular, dual and plural. There are four or five ": null
    },
    {
        "grammatical moods": "https://en.wikipedia.org/wiki/Grammatical_mood"
    },
    {
        " (vuogit):": null
    },
    {
        "Tense": "https://en.wikipedia.org/wiki/Grammatical_tense"
    },
    {
        " is also distinguished, but only in the indicative. There are two tenses  (tempusat):": null
    },
    {
        "In addition, each mood and tense has a so-called ": null
    },
    {
        "connegative": "https://en.wikipedia.org/wiki/Connegative"
    },
    {
        " form. This form is used in negative sentences, when combined with the negative verb.": null
    },
    {
        "Finally, there are several ": null
    },
    {
        "non-finite forms": "https://en.wikipedia.org/wiki/Non-finite_verb"
    },
    {
        ".": null
    },
    {
        "The ": null
    },
    {
        "infinitive": "https://en.wikipedia.org/wiki/Infinitive"
    },
    {
        " is the dictionary form of the verb.": null
    },
    {
        "The present ": null
    },
    {
        "participle": "https://en.wikipedia.org/wiki/Participle"
    },
    {
        " is an adjective indicating a current or ongoing action. It is identical in form to the ": null
    },
    {
        "agent noun": "https://en.wikipedia.org/wiki/Agent_noun"
    },
    {
        ", and has the same origin. However, the participle has only an attributive form, no case forms.": null
    },
    {
        "The past participle is an adjective indicating a past or completed action. Like the present participle, it has only an attributive form. It is also used in forming the ": null
    },
    {
        "periphrastic": "https://en.wikipedia.org/wiki/Periphrastic"
    },
    {
        " perfect tense, and as the connegative form of the past indicative.": null
    },
    {
        "The agent participle is an adjective indicating a past or completed action that has been completed by a particular agent. It only exists for transitive verbs. The agent precedes the participle and is in the genitive case, much like its Finnish counterpart:": null
    },
    {
        "The negative participle is an adjective indicating an action that has not been done by or to something. It can be either active or passive in meaning.": null
    },
    {
        "The ": null
    },
    {
        "action noun": "https://en.wikipedia.org/wiki/Action_noun"
    },
    {
        " is a noun which indicates the action itself. It is not a verb form as such, but is often used in verbal constructions.": null
    },
    {
        "The action inessive (also called the \"action essive\") indicates \"in (the process of)\" or \"while\". It is used together with the copula leat to express a current, ongoing action, much like the English continuous.": null
    },
    {
        "The action inessive originates in the inessive case of the action noun, a case which no longer exists for nouns in Northern Sami.": null
    },
    {
        "The action elative (also called the \"action locative\") indicates \"from (the action of)\". It is used to indicate the cessation of an action, but is also required idiomatically by certain verbs.": null
    },
    {
        "The action elative originates in the elative case of the action noun, a case which became the locative in regular nouns.": null
    },
    {
        "The action comitative indicates \"through\" or \"by\". It originates in the comitative case of the action noun.": null
    },
    {
        "The purposive ": null
    },
    {
        "converb": "https://en.wikipedia.org/wiki/Converb"
    },
    {
        " expresses \"in order to\".": null
    },
    {
        "The simultaneous converb expresses that an action took place \"during\" or \"while (doing)\" another one. It is always accompanied by a possessive suffix.": null
    },
    {
        "The negative converb (also called the \"verb abessive\") expresses \"without\".": null
    },
    {
        "The verb genitive is an adverbial form often used to indicate the way/method, accompanied by a verb of motion. It only exists for some verbs and is not very productive, so it is better considered a derivational form rather than an inflectional form.": null
    },
    {
        "The ": null
    },
    {
        "supine": "https://en.wikipedia.org/wiki/Supine"
    },
    {
        " expresses \"in order to\". It is only used in western Northern Sami dialects.": null
    },
    {
        "Northern Sami, like other Uralic languages, has a ": null
    },
    {
        "negative verb": "https://en.wikipedia.org/wiki/Negative_verb"
    },
    {
        " that conjugates according to ": null
    },
    {
        "mood": "https://en.wikipedia.org/wiki/Grammatical_mood"
    },
    {
        " (indicative and imperative), ": null
    },
    {
        "person": "https://en.wikipedia.org/wiki/Grammatical_person"
    },
    {
        " (1st, 2nd and 3rd) and ": null
    },
    {
        "number": "https://en.wikipedia.org/wiki/Grammatical_number"
    },
    {
        " (singular, dual and plural). It does not conjugate according to ": null
    },
    {
        "tense": "https://en.wikipedia.org/wiki/Grammatical_tense"
    },
    {
        ".": null
    },
    {
        "Northern Sami uses a ": null
    },
    {
        "decimal": "https://en.wikipedia.org/wiki/Decimal"
    },
    {
        " numeral system. Cardinal numbers inflect like adjectives, but have no attributive form. Instead, the numeral matches the noun it modifies in case and number. All numerals except for okta (1) use the nominative singular form also for the accusative singular (both are in the same consonant grade). For čieža (7), gávcci (8), ovcci (9), logi (10) and čuođi (100), the genitive singular form is used also for the nominative and accusative singular (they're all in the weak grade). In the plural, they inflect like all other nominals.": null
    },
    {
        "The numbers from 0 to 10 are:": null
    },
    {
        "The numbers 11 to 19 are formed by compounding a number from 1 to 9 with -nuppẹlohkái (literally \"into the second ten\").": null
    },
    {
        "The decades 20 to 90 are formed by simply compounding the multiple with logi.": null
    },
    {
        "Combinations of a decade and a unit are constructed by compounding the decade with the unit directly, as in English. For example:": null
    },
    {
        "100 is čuođi. Multiples of 100 are expressed like multiples of 10, by simple compounding: 200 guoktẹčuođi, 300 golbmačuođi and so on. Combinations of a hundred and a lower number follow the same pattern, again by compounding, with the hundred coming first.": null
    },
    {
        "1000 is duhát. The pattern is the same as with the hundreds.": null
    },
    {
        "Northern Sami uses the ": null
    },
    {
        "long scale system": "https://en.wikipedia.org/wiki/Long_and_short_scales"
    },
    {
        ".": null
    },
    {
        "Combinations with lower numbers are much the same as with the thousands. Multiples use the accusative/genitive forms miljovnna and miljárdda instead.": null
    },
    {
        "Ordinal numbers behave and inflect like regular adjectives. Except for nubbi, they have an attributive form, which is identical to the nominative singular.": null
    },
    {
        "For the vast majority of numbers, the ordinal form is created by suffixing -t, and putting the stem in the weak grade. The final vowel of the stem is often altered as well.": null
    },
    {
        "When a number is composed of multiple parts, only the last one is converted to an ordinal, the rest stay in their cardinal form. Thus, 13th golbmanuppẹlogát, 22nd guoktẹloginubbi, 409th njealljẹčuođiovccát, 9001st ovcciduhátvuosttaš.": null
    },
    {
        "Northern Sami is an ": null
    },
    {
        "SVO language": "https://en.wikipedia.org/wiki/Subject%E2%80%93verb%E2%80%93object"
    },
    {
        ".": null
    }
]