[
    {
        "Sufism, or Taṣawwuf(": null
    },
    {
        "Arabic": "https://en.wikipedia.org/wiki/Arabic_language"
    },
    {
        ": ‎), variously defined as \"": null
    },
    {
        "Islamic": "https://en.wikipedia.org/wiki/Islamic"
    },
    {
        "mysticism": "https://en.wikipedia.org/wiki/Mysticism"
    },
    {
        "\", \"the inward dimension of ": null
    },
    {
        "Islam": "https://en.wikipedia.org/wiki/Islam"
    },
    {
        "\" or \"the phenomenon of mysticism within Islam\",  is mysticism in Islam, \"characterized ... [by particular] values, ritual practices, doctrines and institutions\" which began very early in ": null
    },
    {
        "Islamic history": "https://en.wikipedia.org/wiki/Islamic_history"
    },
    {
        " and represents \"the main manifestation and the most important and central crystallization of\" mystical practice in Islam. Practitioners of Sufism have been referred to as \"Sufis\" (from ‎ ṣūfiyy / ṣūfī).": null
    },
    {
        "Historically, Sufis have often belonged to different ": null
    },
    {
        "ṭuruq": "https://en.wikipedia.org/wiki/Tariqa"
    },
    {
        " or \"orders\" – congregations formed around a grand master referred to as a ": null
    },
    {
        "wali": "https://en.wikipedia.org/wiki/Wali"
    },
    {
        " who traces a direct ": null
    },
    {
        "chain of successive teachers": "https://en.wikipedia.org/wiki/Silsilah"
    },
    {
        " back to the Islamic prophet, ": null
    },
    {
        "Muhammad": "https://en.wikipedia.org/wiki/Muhammad"
    },
    {
        ". These orders meet for spiritual sessions (": null
    },
    {
        "majalis": "https://en.wikipedia.org/wiki/Majalis"
    },
    {
        ") in meeting places known as ": null
    },
    {
        "zawiyas": "https://en.wikipedia.org/wiki/Zawiya_(institution)"
    },
    {
        ", ": null
    },
    {
        "khanqahs": "https://en.wikipedia.org/wiki/Khanqah"
    },
    {
        " or tekke. They strive for ": null
    },
    {
        "ihsan": "https://en.wikipedia.org/wiki/Ihsan"
    },
    {
        " (perfection of worship), as detailed in a ": null
    },
    {
        "hadith": "https://en.wikipedia.org/wiki/Hadith"
    },
    {
        ": \"Ihsan is to worship Allah as if you see Him; if you can't see Him, surely He sees you.\" Sufis regard Muhammad as ": null
    },
    {
        "al-Insān al-Kāmil": "https://en.wikipedia.org/wiki/Al-Ins%C4%81n_al-K%C4%81mil"
    },
    {
        ", the primary perfect man who exemplifies the morality of God, and see him as their leader and prime spiritual guide.": null
    },
    {
        "All Sufi orders trace most of their original precepts from Muhammad through his cousin and son-in-law ": null
    },
    {
        "Ali": "https://en.wikipedia.org/wiki/Ali_ibn_Abi_Talib"
    },
    {
        ", with the notable exception of one.": null
    },
    {
        "Although the overwhelming majority of Sufis, both pre-modern and modern, were and are adherents of ": null
    },
    {
        "Sunni Islam": "https://en.wikipedia.org/wiki/Sunni_Islam"
    },
    {
        ", there also developed certain strands of Sufi practice within the ambit of ": null
    },
    {
        "Shia Islam": "https://en.wikipedia.org/wiki/Shia_Islam"
    },
    {
        " during the late medieval period, particularly after the ": null
    },
    {
        "forced conversion of Iran from majority Sunni to Shia": "https://en.wikipedia.org/wiki/Safavid_conversion_of_Iran_to_Shia_Islam"
    },
    {
        ". Traditional ": null
    },
    {
        "Sufi orders": "https://en.wikipedia.org/wiki/Tariqa"
    },
    {
        " during the first five centuries of Islam were all based in ": null
    },
    {
        "Sunni Islam": "https://en.wikipedia.org/wiki/Sunni_Islam"
    },
    {
        ". Although Sufis were opposed to dry legalism, they strictly observed Islamic law and belonged to various schools of Islamic jurisprudence and theology.": null
    },
    {
        "Sufis have been characterized by their ": null
    },
    {
        "asceticism": "https://en.wikipedia.org/wiki/Asceticism"
    },
    {
        ", especially by their attachment to ": null
    },
    {
        "dhikr": "https://en.wikipedia.org/wiki/Dhikr"
    },
    {
        ", the practice of remembrance of God, often performed after prayers. They gained adherents among a number of Muslims as a reaction against the worldliness of the early ": null
    },
    {
        "Umayyad Caliphate": "https://en.wikipedia.org/wiki/Umayyad_Caliphate"
    },
    {
        " (661–750)and have spanned several continents and cultures over a millennium, initially expressing their beliefs in Arabic and later expanding into ": null
    },
    {
        "Persian": "https://en.wikipedia.org/wiki/Persian_language"
    },
    {
        ", ": null
    },
    {
        "Turkish": "https://en.wikipedia.org/wiki/Turkish_language"
    },
    {
        ", and ": null
    },
    {
        "Urdu": "https://en.wikipedia.org/wiki/Urdu"
    },
    {
        ", among others. Sufis played an important role in the formation of Muslim societies through their missionary and educational activities. According to ": null
    },
    {
        "William Chittick": "https://en.wikipedia.org/wiki/William_Chittick"
    },
    {
        ", \"In a broad sense, Sufism can be described as the interiorization, and intensification of Islamic faith and practice.\"": null
    },
    {
        "Despite a relative decline of Sufi orders in the modern era and criticism of some aspects of Sufism by ": null
    },
    {
        "modernist thinkers": "https://en.wikipedia.org/wiki/Islamic_modernism"
    },
    {
        " and ": null
    },
    {
        "conservative Salafists": "https://en.wikipedia.org/wiki/Salafism"
    },
    {
        ", Sufism has continued to play an important role in the Islamic world, and has also influenced various forms of spirituality in the West.": null
    },
    {
        "The Arabic word tasawwuf (lit. being or becoming a Sufi), generally translated as Sufism, is commonly defined by Western authors as Islamic mysticism. The Arabic term sufi has been used in Islamic literature with a wide range of meanings, by both proponents and opponents of Sufism. Classical Sufi texts, which stressed certain teachings and practices of the ": null
    },
    {
        "Quran": "https://en.wikipedia.org/wiki/Quran"
    },
    {
        " and the ": null
    },
    {
        "sunnah": "https://en.wikipedia.org/wiki/Sunnah"
    },
    {
        " (exemplary teachings and practices of the Islamic prophet ": null
    },
    {
        "Muhammad": "https://en.wikipedia.org/wiki/Muhammad"
    },
    {
        "),  gave definitions of tasawwuf that described ethical and spiritual goals and functioned as teaching tools for their attainment. Many other terms that described particular spiritual qualities and roles were used instead in more practical contexts.": null
    },
    {
        "Some modern scholars have used other definitions of Sufism such as  \"intensification of Islamic faith and practice\" and \"process of realizing ethical and spiritual ideals\".": null
    },
    {
        "The term Sufism was originally introduced into European languages in the 18th century by Orientalist scholars, who viewed it mainly as an intellectual doctrine and literary tradition at variance with what they saw as sterile monotheism of Islam. In modern scholarly usage the term serves to describe a wide range of social, cultural, political and religious phenomena associated with Sufis.": null
    },
    {
        "The original meaning of sufi seems to have been \"one who wears wool (ṣūf)\", and the  ": null
    },
    {
        "Encyclopaedia of Islam": "https://en.wikipedia.org/wiki/Encyclopaedia_of_Islam"
    },
    {
        " calls other etymological hypotheses \"untenable\". Woollen clothes were traditionally associated with ascetics and mystics.": null
    },
    {
        "Al-Qushayri": "https://en.wikipedia.org/wiki/Al-Qushayri"
    },
    {
        " and ": null
    },
    {
        "Ibn Khaldun": "https://en.wikipedia.org/wiki/Ibn_Khaldun"
    },
    {
        " both rejected all possibilities other than ṣūf on linguistic grounds.": null
    },
    {
        "Another explanation traces the lexical root of the word to ṣafā(), which in Arabic means \"purity\", and in this context another similar idea of tasawuf as considered in Islam is ": null
    },
    {
        "tazkiyah": "https://en.wikipedia.org/wiki/Tazkiyah"
    },
    {
        " (, meaning: self-purification), which is also widely includently used in sufism. These two explanations were combined by the Sufi al-Rudhabari (d. 322 AH), who said, \"The Sufi is the one who wears wool on top of purity\".": null
    },
    {
        "Others have suggested that the word comes from the term ": null
    },
    {
        "ahl aṣ-ṣuffah": "https://en.wikipedia.org/wiki/Ashab_al-Suffa"
    },
    {
        " (\"the people of the ": null
    },
    {
        "suffah": "https://en.wikipedia.org/wiki/Suffah"
    },
    {
        " or the bench\"), who were a group of impoverished companions of Muhammad who held regular gatherings of dhikr, one of the most prominent companion among them was ": null
    },
    {
        "Abu Huraira": "https://en.wikipedia.org/wiki/Abu_Huraira"
    },
    {
        ". These men and women who sat at ": null
    },
    {
        "al-Masjid an-Nabawi": "https://en.wikipedia.org/wiki/Al-Masjid_an-Nabawi"
    },
    {
        " are considered by some to be the first Sufis.": null
    },
    {
        "According to ": null
    },
    {
        "Carl W. Ernst": "https://en.wikipedia.org/wiki/Carl_W._Ernst"
    },
    {
        " the earliest figures of Sufism are Muhammad himself and his companions (": null
    },
    {
        "Sahabah": "https://en.wikipedia.org/wiki/Sahabah"
    },
    {
        "). Sufi orders are based on the \"bay‘ah\" (بَيْعَةbay‘ah, مُبَايَعَةmubāya‘ah \"pledge, allegiance\") that was given to Muhammad by his Ṣahabah. By pledging allegiance to Muhammad, the Sahabah had committed themselves to the service of God.": null
    },
    {
        "Verily, those who give Bai'âh (pledge) to you (O Muhammad) they are giving Bai'âh (pledge) to Allâh. The Hand of Allâh is over their hands. Then whosoever breaks his pledge, breaks it only to his own harm, and whosoever fulfils what he has covenanted with Allâh, He will bestow on him a great reward. — [Translation of Quran, 48:10]": null
    },
    {
        "Sufis believe that by giving bayʿah (pledging allegiance) to a legitimate Sufi ": null
    },
    {
        "shaykh": "https://en.wikipedia.org/wiki/Shaykh"
    },
    {
        ", one is pledging allegiance to Muhammad; therefore, a spiritual connection between the seeker and Muhammad is established. It is through Muhammad that Sufis aim to learn about, understand and connect with God. Ali is regarded as one of the major figures amongst the Sahaba who have directly pledged allegiance to Muhammad, and Sufis maintain that through Ali, knowledge about Muhammad and a connection with Muhammad may be attained. Such a concept may be understood by the hadith, which Sufis regard to be authentic, in which Muhammad said, \"I am the city of knowledge and Ali is its gate\". Eminent Sufis such as ": null
    },
    {
        "Ali Hujwiri": "https://en.wikipedia.org/wiki/Ali_Hujwiri"
    },
    {
        " refer to Ali as having a very high ranking in Tasawwuf. Furthermore, ": null
    },
    {
        "Junayd of Baghdad": "https://en.wikipedia.org/wiki/Junayd_of_Baghdad"
    },
    {
        " regarded Ali as ": null
    },
    {
        "sheikh": "https://en.wikipedia.org/wiki/Sheikh"
    },
    {
        " of the principals and practices of Tasawwuf.": null
    },
    {
        "Historian Jonathan A.C. Brown notes that during the lifetime of Muhammad, some companions were more inclined than others to \"intensive devotion, pious abstemiousness and pondering the divine mysteries\" more than Islam required, such as ": null
    },
    {
        "Abu Dhar al-Ghifari": "https://en.wikipedia.org/wiki/Abu_Dhar_al-Ghifari"
    },
    {
        ". ": null
    },
    {
        "Hasan al-Basri": "https://en.wikipedia.org/wiki/Hasan_al-Basri"
    },
    {
        ", a ": null
    },
    {
        "tabi": "https://en.wikipedia.org/wiki/Tabi%E2%80%98un"
    },
    {
        ", is considered a \"founding figure\" in the \"science of purifying the heart\".": null
    },
    {
        "Practitioners of Sufism hold that in its early stages of development Sufism effectively referred to nothing more than the internalization of Islam. According to one perspective, it is directly from the Qur'an, constantly recited, meditated, and experienced, that Sufism proceeded, in its origin and its development. Other practitioners have held that Sufism is the strict emulation of the way of Muhammad, through which the heart's connection to the Divine is strengthened.": null
    },
    {
        "Modern academics and scholars have rejected early Orientalist theories asserting a non-Islamic origin of Sufism, The consensus is that it emerged in ": null
    },
    {
        "Western Asia": "https://en.wikipedia.org/wiki/Western_Asia"
    },
    {
        ". Many have asserted Sufism to be unique within the confines of the Islamic religion, and contend that Sufism developed from people like ": null
    },
    {
        "Bayazid Bastami": "https://en.wikipedia.org/wiki/Bayazid_Bastami"
    },
    {
        ", who, in his utmost reverence to the ": null
    },
    {
        "sunnah": "https://en.wikipedia.org/wiki/Sunnah"
    },
    {
        ", refused to eat a watermelon because he did not find any proof that Muhammad ever ate it. According to the late medieval mystic ": null
    },
    {
        "Jami": "https://en.wikipedia.org/wiki/Jami"
    },
    {
        ", ": null
    },
    {
        "Abd-Allah ibn Muhammad ibn al-Hanafiyyah": "https://en.wikipedia.org/wiki/Abd-Allah_ibn_Muhammad_ibn_al-Hanafiyyah"
    },
    {
        " (died c. 716) was the first person to be called a \"Sufi\".": null
    },
    {
        "Important contributions in writing are attributed to ": null
    },
    {
        "Uwais al-Qarani": "https://en.wikipedia.org/wiki/Uwais_al-Qarani"
    },
    {
        ", ": null
    },
    {
        "Hasan of Basra": "https://en.wikipedia.org/wiki/Hasan_of_Basra"
    },
    {
        ", ": null
    },
    {
        "Harith al-Muhasibi": "https://en.wikipedia.org/wiki/Harith_al-Muhasibi"
    },
    {
        ", ": null
    },
    {
        "Abu Nasr as-Sarraj": "https://en.wikipedia.org/wiki/Abu_Nasr_as-Sarraj"
    },
    {
        " and ": null
    },
    {
        "Said ibn al-Musayyib": "https://en.wikipedia.org/wiki/Said_ibn_al-Musayyib"
    },
    {
        ".": null
    },
    {
        "Ruwaym": "https://en.wikipedia.org/wiki/Ruwaym"
    },
    {
        ", from the second generation of Sufis in Baghdad, was also an influential early figure, as was Junayd of Baghdad; a number of early practitioners of Sufism were disciples of one of the two.": null
    },
    {
        "Sufism had a long history already before the subsequent institutionalization of Sufi teachings into devotional orders (tarîqât) in the early Middle Ages. The Naqshbandi order is a notable exception to general rule of orders tracing their spiritual lineage through Muhammad's grandsons, as it traces the origin of its teachings from Muhammad to the first ": null
    },
    {
        "Islamic Caliph": "https://en.wikipedia.org/wiki/Islamic_Caliph"
    },
    {
        ", Abu Bakr.": null
    },
    {
        "Over the years, Sufi orders have influenced and been adopted by various Shi'i movements, especially ": null
    },
    {
        "Isma'ilism": "https://en.wikipedia.org/wiki/Isma%27ilism"
    },
    {
        ", which led to the ": null
    },
    {
        "Safaviyya": "https://en.wikipedia.org/wiki/Safaviyya"
    },
    {
        " order's conversion to Shia Islam from Sunni Islam and the spread of ": null
    },
    {
        "Twelverism": "https://en.wikipedia.org/wiki/Twelver"
    },
    {
        " throughout Iran.": null
    },
    {
        "Sufi orders": "https://en.wikipedia.org/wiki/List_of_Sufi_orders"
    },
    {
        " include ": null
    },
    {
        "Ba 'Alawiyya": "https://en.wikipedia.org/wiki/Ba_%27Alawiyya"
    },
    {
        ", ": null
    },
    {
        "Badawiyya": "https://en.wikipedia.org/wiki/Badawiyya"
    },
    {
        ", ": null
    },
    {
        "Bektashi": "https://en.wikipedia.org/wiki/Bektashi_Order"
    },
    {
        ", ": null
    },
    {
        "Burhaniyya": "https://en.wikipedia.org/wiki/Burhaniyya"
    },
    {
        ", ": null
    },
    {
        "Chishti": "https://en.wikipedia.org/wiki/Chishti_Order"
    },
    {
        ", ": null
    },
    {
        "Khalwati": "https://en.wikipedia.org/wiki/Khalwati_order"
    },
    {
        ", ": null
    },
    {
        "Mevlevi": "https://en.wikipedia.org/wiki/Mevlevi_Order"
    },
    {
        ", Naqshbandi, ": null
    },
    {
        "Ni'matullāhī": "https://en.wikipedia.org/wiki/Ni%27matull%C4%81h%C4%AB"
    },
    {
        ", ": null
    },
    {
        "Uwaisi": "https://en.wikipedia.org/wiki/Uwaisi"
    },
    {
        ", ": null
    },
    {
        "Qadiriyya": "https://en.wikipedia.org/wiki/Qadiriyya"
    },
    {
        ", ": null
    },
    {
        "Qalandariyya": "https://en.wikipedia.org/wiki/Qalandariyya"
    },
    {
        ", ": null
    },
    {
        "Rifa'i": "https://en.wikipedia.org/wiki/Rifa%27i"
    },
    {
        ", ": null
    },
    {
        "Sarwari Qadiri": "https://en.wikipedia.org/wiki/Qadiriyya#Sarwari_Qadiri"
    },
    {
        ", ": null
    },
    {
        "Shadhiliyya": "https://en.wikipedia.org/wiki/Shadhili"
    },
    {
        ", ": null
    },
    {
        "Suhrawardiyya": "https://en.wikipedia.org/wiki/Suhrawardiyya"
    },
    {
        ", ": null
    },
    {
        "Tijaniyyah": "https://en.wikipedia.org/wiki/Tijaniyyah"
    },
    {
        ", ": null
    },
    {
        "Zinda Shah Madariya": "https://en.wikipedia.org/wiki/Madariyya"
    },
    {
        ", and others.": null
    },
    {
        "Existing in both Sunni and Shia Islam, Sufism is not a distinct sect, as is sometimes erroneously assumed, but a method of approaching or a way of understanding the religion, which strives to take the regular practice of the religion to the \"supererogatory level\" through simultaneously \"fulfilling ... [the obligatory] religious duties\" and finding a \"way and a means of striking a root through the 'narrow gate' in the depth of the ": null
    },
    {
        "soul": "https://en.wikipedia.org/wiki/R%C5%AB%E1%B8%A5"
    },
    {
        " out into the domain of the pure arid unimprisonable ": null
    },
    {
        "Spirit": "https://en.wikipedia.org/wiki/Holy_Spirit_(Islam)"
    },
    {
        " which itself opens out on to the Divinity.\" Academic studies of Sufism confirm that Sufism, as a separate tradition from Islam apart from so-called pure Islam, is frequently a product of ": null
    },
    {
        "Western orientalism": "https://en.wikipedia.org/wiki/Orientalism"
    },
    {
        " and modern ": null
    },
    {
        "Islamic fundamentalists": "https://en.wikipedia.org/wiki/Islamic_fundamentalism"
    },
    {
        ".": null
    },
    {
        "As a mystic and ascetic aspect of Islam, it is considered as the part of Islamic teaching that deals with the purification of the inner self. By focusing on the more spiritual aspects of religion, Sufis strive to obtain direct experience of God by making use of \"intuitive and emotional faculties\" that one must be trained to use.Tasawwuf is regarded as a science of the soul that has always been an integral part of Orthodox Islam. In his Al-Risala al-Safadiyya, ": null
    },
    {
        "ibn Taymiyyah": "https://en.wikipedia.org/wiki/Ibn_Taymiyyah"
    },
    {
        " describes the Sufis as those who belong to the path of the Sunna and represent it in their teachings and writings.": null
    },
    {
        "Ibn Taymiyya's Sufi inclinations and his reverence for Sufis like ": null
    },
    {
        "Abdul-Qadir Gilani": "https://en.wikipedia.org/wiki/Abdul-Qadir_Gilani"
    },
    {
        " can also be seen in his hundred-page commentary on Futuh al-ghayb, covering only five of the seventy-eight sermons of the book, but showing that he considered tasawwuf essential within the life of the Islamic community.": null
    },
    {
        "In his commentary, Ibn Taymiyya stresses that the primacy of the sharia forms the soundest tradition in tasawwuf, and to argue this point he lists over a dozen early masters, as well as more contemporary ": null
    },
    {
        "shaykhs": "https://en.wikipedia.org/wiki/Shaykhs"
    },
    {
        " like his fellow ": null
    },
    {
        "Hanbalis": "https://en.wikipedia.org/wiki/Hanbali"
    },
    {
        ", al-Ansari al-Harawi and Abdul-Qadir, and the latter's own shaykh, Hammad al-Dabbas the upright. He cites the early shaykhs (shuyukh al-salaf) such as ": null
    },
    {
        "Al-Fuḍayl ibn ‘Iyāḍ": "https://en.wikipedia.org/wiki/Al-Fu%E1%B8%8Dayl_ibn_%E2%80%98Iy%C4%81%E1%B8%8D"
    },
    {
        ", ": null
    },
    {
        "Ibrahim ibn Adham": "https://en.wikipedia.org/wiki/Ibrahim_ibn_Adham"
    },
    {
        ", ": null
    },
    {
        "Ma`ruf al-Karkhi": "https://en.wikipedia.org/wiki/Maruf_Karkhi"
    },
    {
        ", ": null
    },
    {
        "Sirri Saqti": "https://en.wikipedia.org/wiki/Sirri_Saqti"
    },
    {
        ", Junayd of Baghdad, and others of the early teachers, as well as ": null
    },
    {
        "Abdul-Qadir Gilani": "https://en.wikipedia.org/wiki/Abdul-Qadir_Gilani"
    },
    {
        ", Hammad, Abu al-Bayan and others of the later masters— that they do not permit the followers of the Sufi path to depart from the divinely legislated command and prohibition.": null
    },
    {
        "Al-Ghazali narrates in Al-Munqidh min al-dalal:": null
    },
    {
        "The vicissitudes of life, family affairs and financial constraints engulfed my life and deprived me of the congenial solitude. The heavy odds confronted me and provided me with few moments for my pursuits. This state of affairs lasted for ten years, but whenever I had some spare and congenial moments I resorted to my intrinsic proclivity. During these turbulent years, numerous astonishing and indescribable secrets of life were unveiled to me. I was convinced that the group of Aulia (holy mystics) is the only truthful group who follow the right path, display best conduct and surpass all sages in their wisdom and insight. They derive all their overt or covert behaviour from the illumining guidance of the holy Prophet, the only guidance worth quest and pursuit.": null
    },
    {
        "In the eleventh-century, Sufism, which had previously been a less \"codified\" trend in Islamic piety, began to be \"ordered and crystallized\" into ": null
    },
    {
        "orders": "https://en.wikipedia.org/wiki/Tariqa"
    },
    {
        " which have continued until the present day. All these orders were founded by a major Islamic scholar, and some of the largest and most widespread included the ": null
    },
    {
        "Qadiriyya": "https://en.wikipedia.org/wiki/Qadiriyya"
    },
    {
        " (after ": null
    },
    {
        "Abdul-Qadir Gilani": "https://en.wikipedia.org/wiki/Abdul-Qadir_Gilani"
    },
    {
        " [d. 1166]), the ": null
    },
    {
        "Rifa'iyya": "https://en.wikipedia.org/wiki/Rifa%27i"
    },
    {
        " (after ": null
    },
    {
        "Ahmed al-Rifa'i": "https://en.wikipedia.org/wiki/Ahmed_al-Rifa%27i"
    },
    {
        " [d. 1182]), the ": null
    },
    {
        "Chishtiyya": "https://en.wikipedia.org/wiki/Chishti_Order"
    },
    {
        " (after ": null
    },
    {
        "Moinuddin Chishti": "https://en.wikipedia.org/wiki/Moinuddin_Chishti"
    },
    {
        " [d. 1236]), the ": null
    },
    {
        "Shadiliyya": "https://en.wikipedia.org/wiki/Shadiliyya"
    },
    {
        " (after ": null
    },
    {
        "Abul Hasan ash-Shadhili": "https://en.wikipedia.org/wiki/Abul_Hasan_ash-Shadhili"
    },
    {
        " [d. 1258]), the Hamadaniyyah (after ": null
    },
    {
        "Sayyid Ali Hamadani": "https://en.wikipedia.org/wiki/Mir_Sayyid_Ali_Hamadani"
    },
    {
        " [d. 1384], the Naqshbandiyya (after ": null
    },
    {
        "Baha-ud-Din Naqshband Bukhari": "https://en.wikipedia.org/wiki/Baha-ud-Din_Naqshband_Bukhari"
    },
    {
        " [d. 1389]). Contrary to popular perception in the West, however, neither the founders of these orders nor their followers ever considered themselves to be anything other than orthodox Sunni Muslims, and in fact all of these orders were attached to one of the ": null
    },
    {
        "four orthodox legal schools": "https://en.wikipedia.org/wiki/Maddhab"
    },
    {
        " of Sunni Islam. Thus, the ": null
    },
    {
        "Qadiriyya": "https://en.wikipedia.org/wiki/Qadiriyya"
    },
    {
        " order was ": null
    },
    {
        "Hanbali": "https://en.wikipedia.org/wiki/Hanbali"
    },
    {
        ", with its founder, ": null
    },
    {
        "Abdul-Qadir Gilani": "https://en.wikipedia.org/wiki/Abdul-Qadir_Gilani"
    },
    {
        ", being a renowned  jurist; the ": null
    },
    {
        "Chishtiyya": "https://en.wikipedia.org/wiki/Chishti_Order"
    },
    {
        " was ": null
    },
    {
        "Hanafi": "https://en.wikipedia.org/wiki/Hanafi"
    },
    {
        "; the ": null
    },
    {
        "Shadiliyya": "https://en.wikipedia.org/wiki/Shadiliyya"
    },
    {
        " order was ": null
    },
    {
        "Maliki": "https://en.wikipedia.org/wiki/Maliki"
    },
    {
        "; and the Naqshbandiyya order was ": null
    },
    {
        "Hanafi": "https://en.wikipedia.org/wiki/Hanafi"
    },
    {
        ". Thus, it is precisely because it is historically proven that \"many of the most eminent defenders of Islamic orthodoxy, such as ": null
    },
    {
        "Abdul-Qadir Gilani": "https://en.wikipedia.org/wiki/Abdul-Qadir_Gilani"
    },
    {
        ", ": null
    },
    {
        "Ghazali": "https://en.wikipedia.org/wiki/Ghazali"
    },
    {
        ", and the Sultan Ṣalāḥ ad-Dīn (": null
    },
    {
        "Saladin": "https://en.wikipedia.org/wiki/Saladin"
    },
    {
        ") were connected with Sufism\" that the popular studies of writers like ": null
    },
    {
        "Idries Shah": "https://en.wikipedia.org/wiki/Idries_Shah"
    },
    {
        " are continuously disregarded by scholars as conveying the fallacious image that \"Sufism\" is somehow distinct from \"Islam.\"": null
    },
    {
        "Towards the end of the first millennium, a number of manuals began to be written summarizing the doctrines of Sufism and describing some typical Sufi practices. Two of the most famous of these are now available in English translation: the ": null
    },
    {
        "Kashf al-Mahjûb": "https://en.wikipedia.org/wiki/Kashf_ul_Mahjoob"
    },
    {
        " of ": null
    },
    {
        "Ali Hujwiri": "https://en.wikipedia.org/wiki/Ali_Hujwiri"
    },
    {
        " and the Risâla of Al-Qushayri.": null
    },
    {
        "Two of al-Ghazali's greatest treatises are the Revival of Religious Sciences and what he termed \"its essence\", the ": null
    },
    {
        "Kimiya-yi sa'ādat": "https://en.wikipedia.org/wiki/Kimiya-yi_sa%27%C4%81dat"
    },
    {
        ". He argued that Sufism originated from the Qur'an and thus was compatible with mainstream Islamic thought and did not in any way contradict Islamic Law—being instead necessary to its complete fulfillment. Ongoing efforts by both traditionally trained Muslim scholars and Western academics are making al-Ghazali's works more widely available in English translation, allowing English-speaking readers to judge for themselves the compatibility of Islamic Law and Sufi doctrine. Several sections of the Revival of Religious Sciences have been published in translation by the Islamic Texts Society. An abridged translation (from an Urdu translation) of The Alchemy of Happiness was published by Claud Field (": null
    },
    {
        "ISBN": "https://en.wikipedia.org/wiki/International_Standard_Book_Number"
    },
    {
        "978-0935782288": "https://en.wikipedia.org/wiki/Special:BookSources/978-0935782288"
    },
    {
        ") in 1910. It has been translated in full by Muhammad Asim Bilal (2001).": null
    },
    {
        "Historically, Sufism became \"an incredibly important part of Islam\" and \"one of the most widespread and omnipresent aspects of Muslim life\" in ": null
    },
    {
        "Islamic civilization": "https://en.wikipedia.org/wiki/Islamic_Civilization_during_the_European_Renaissance"
    },
    {
        " from the early medieval period onwards, when it began to permeate nearly all major aspects of Sunni Islamic life in regions stretching from ": null
    },
    {
        "India": "https://en.wikipedia.org/wiki/India"
    },
    {
        " and ": null
    },
    {
        "Iraq": "https://en.wikipedia.org/wiki/Iraq"
    },
    {
        " to the ": null
    },
    {
        "Balkans": "https://en.wikipedia.org/wiki/Balkans"
    },
    {
        " and ": null
    },
    {
        "Senegal": "https://en.wikipedia.org/wiki/Senegal"
    },
    {
        ".": null
    },
    {
        "The rise of Islamic civilization coincides strongly with the spread of Sufi philosophy in Islam. The spread of Sufism has been considered a definitive factor in the spread of Islam, and in the creation of integrally Islamic cultures, especially in Africa and Asia. The ": null
    },
    {
        "Senussi": "https://en.wikipedia.org/wiki/Senussi"
    },
    {
        " tribes of ": null
    },
    {
        "Libya": "https://en.wikipedia.org/wiki/Libya"
    },
    {
        " and the ": null
    },
    {
        "Sudan": "https://en.wikipedia.org/wiki/Sudan"
    },
    {
        " are one of the strongest adherents of Sufism. Sufi poets and philosophers such as ": null
    },
    {
        "Khoja Akhmet Yassawi": "https://en.wikipedia.org/wiki/Khoja_Akhmet_Yassawi"
    },
    {
        ", Rumi, and ": null
    },
    {
        "Attar of Nishapur": "https://en.wikipedia.org/wiki/Attar_of_Nishapur"
    },
    {
        " (c. 1145 – c. 1221) greatly enhanced the spread of Islamic culture in ": null
    },
    {
        "Anatolia": "https://en.wikipedia.org/wiki/Anatolia"
    },
    {
        ", ": null
    },
    {
        "Central Asia": "https://en.wikipedia.org/wiki/Central_Asia"
    },
    {
        ", and ": null
    },
    {
        "South Asia": "https://en.wikipedia.org/wiki/South_Asia"
    },
    {
        ". Sufism also played a role in creating and propagating the culture of the ": null
    },
    {
        "Ottoman": "https://en.wikipedia.org/wiki/Ottoman_Empire"
    },
    {
        " world, and in resisting European imperialism in North Africa and South Asia.": null
    },
    {
        "Between the 13th and 16th centuries, Sufism produced a flourishing intellectual culture throughout the Islamic world, a \"Golden Age\" whose physical artifacts survive. In many places a person or group would endow a ": null
    },
    {
        "waqf": "https://en.wikipedia.org/wiki/Waqf"
    },
    {
        " to maintain a lodge (known variously as a zawiya, khanqah, or tekke) to provide a gathering place for Sufi adepts, as well as lodging for itinerant seekers of knowledge. The same system of endowments could also pay for a complex of buildings, such as that surrounding the ": null
    },
    {
        "Süleymaniye Mosque": "https://en.wikipedia.org/wiki/S%C3%BCleymaniye_Mosque"
    },
    {
        " in Istanbul, including a lodge for Sufi seekers, a ": null
    },
    {
        "hospice": "https://en.wikipedia.org/wiki/Hospice"
    },
    {
        " with kitchens where these seekers could serve the poor and/or complete a period of initiation, a library, and other structures. No important domain in the civilization of Islam remained unaffected by Sufism in this period.": null
    },
    {
        "Opposition to Sufi teachers and orders  from more literalist and legalist strains of Islam existed in various forms throughout Islamic history. It took on a particularly violent form in the 18th century with the emergence of the ": null
    },
    {
        "Wahhabi": "https://en.wikipedia.org/wiki/Wahhabi"
    },
    {
        " movement.": null
    },
    {
        "Around the turn of the 20th century, Sufi rituals and doctrines also came under sustained criticism from ": null
    },
    {
        "modernist Islamic reformers": "https://en.wikipedia.org/wiki/Islamic_modernism"
    },
    {
        ", liberal nationalists, and, some decades later, socialist movements in the Muslim world. Sufi orders were accused of fostering popular superstitions, resisting modern intellectual attitudes, and standing in the way of progressive reforms. Ideological attacks on Sufism were reinforced by agrarian and educational reforms, as well as new forms of taxation, which were instituted by Westernizing national governments, undermining the economic foundations of Sufi orders. The extent to which Sufi orders declined in the first half of the 20th century varied from country to country, but by the middle of the century the very survival of the orders and traditional Sufi lifestyle appeared doubtful to many observers.": null
    },
    {
        "However, defying these predictions, Sufism and Sufi orders have continued to play a major role in the Muslim world, also expanding into Muslim-minority countries. Its ability to articulate an inclusive Islamic identity with greater emphasis on personal and small-group piety has made Sufism especially well-suited for contexts characterized by religious pluralism and secularist perspectives.": null
    },
    {
        "In the modern world, the classical interpretation of Sunni orthodoxy, which sees in Sufism an essential dimension of Islam alongside the disciplines of ": null
    },
    {
        "jurisprudence": "https://en.wikipedia.org/wiki/Fiqh"
    },
    {
        " and ": null
    },
    {
        "theology": "https://en.wikipedia.org/wiki/Aqidah"
    },
    {
        ", is represented by institutions such as ": null
    },
    {
        "Egypt": "https://en.wikipedia.org/wiki/Egypt"
    },
    {
        "'s ": null
    },
    {
        "Al-Azhar University": "https://en.wikipedia.org/wiki/Al-Azhar_University"
    },
    {
        " and ": null
    },
    {
        "Zaytuna College": "https://en.wikipedia.org/wiki/Zaytuna_College"
    },
    {
        ", with Al-Azhar's current ": null
    },
    {
        "Grand Imam": "https://en.wikipedia.org/wiki/Grand_Imam_of_al-Azhar"
    },
    {
        "Ahmed el-Tayeb": "https://en.wikipedia.org/wiki/Ahmed_el-Tayeb"
    },
    {
        " recently defining \"Sunni orthodoxy\" as being a follower \"of any of the four schools of [legal] thought (": null
    },
    {
        "Hanafi": "https://en.wikipedia.org/wiki/Hanafi"
    },
    {
        ", ": null
    },
    {
        "Shafi’i": "https://en.wikipedia.org/wiki/Shafi%E2%80%99i"
    },
    {
        ", ": null
    },
    {
        "Maliki": "https://en.wikipedia.org/wiki/Maliki"
    },
    {
        " or ": null
    },
    {
        "Hanbali": "https://en.wikipedia.org/wiki/Hanbali"
    },
    {
        ") and ... [also] of the Sufism of Imam Junayd of Baghdad in doctrines, manners and [spiritual] purification.\"": null
    },
    {
        "Current Sufi orders include ": null
    },
    {
        "Alians": "https://en.wikipedia.org/wiki/Alians"
    },
    {
        ", ": null
    },
    {
        "Bektashi Order": "https://en.wikipedia.org/wiki/Bektashi_Order"
    },
    {
        ", ": null
    },
    {
        "Mevlevi Order": "https://en.wikipedia.org/wiki/Mevlevi_Order"
    },
    {
        ", ": null
    },
    {
        "Ba 'Alawiyya": "https://en.wikipedia.org/wiki/Ba_%27Alawiyya"
    },
    {
        ", ": null
    },
    {
        "Chishti Order": "https://en.wikipedia.org/wiki/Chishti_Order"
    },
    {
        ", ": null
    },
    {
        "Jerrahi": "https://en.wikipedia.org/wiki/Jerrahi"
    },
    {
        ", Naqshbandi, ": null
    },
    {
        "Mujaddidi": "https://en.wikipedia.org/w/index.php?title=Mujaddidi&action=edit&redlink=1"
    },
    {
        ", ": null
    },
    {
        "Ni'matullāhī": "https://en.wikipedia.org/wiki/Ni%27matull%C4%81h%C4%AB"
    },
    {
        ", ": null
    },
    {
        "Qadiriyya": "https://en.wikipedia.org/wiki/Qadiriyya"
    },
    {
        ", ": null
    },
    {
        "Qalandariyya": "https://en.wikipedia.org/wiki/Qalandariyya"
    },
    {
        ", ": null
    },
    {
        "Sarwari Qadiriyya": "https://en.wikipedia.org/wiki/Qadiriyya#Sarwari_Qadiri"
    },
    {
        ", ": null
    },
    {
        "Shadhiliyya": "https://en.wikipedia.org/wiki/Shadhili"
    },
    {
        ", ": null
    },
    {
        "Suhrawardiyya": "https://en.wikipedia.org/wiki/Suhrawardiyya"
    },
    {
        ", Saifiah (Naqshbandiah), and ": null
    },
    {
        "Uwaisi": "https://en.wikipedia.org/wiki/Uwaisi"
    },
    {
        ". The relationship of Sufi orders to modern societies is usually defined by their relationship to governments.": null
    },
    {
        "Turkey and Persia together have been a center for many Sufi lineages and orders. The Bektashi were closely affiliated with the Ottoman ": null
    },
    {
        "Janissaries": "https://en.wikipedia.org/wiki/Janissaries"
    },
    {
        " and are the heart of Turkey's large and mostly liberal ": null
    },
    {
        "Alevi": "https://en.wikipedia.org/wiki/Alevism"
    },
    {
        " population. They have spread westwards to ": null
    },
    {
        "Cyprus": "https://en.wikipedia.org/wiki/Cyprus"
    },
    {
        ", ": null
    },
    {
        "Greece": "https://en.wikipedia.org/wiki/Greece"
    },
    {
        ", ": null
    },
    {
        "Albania": "https://en.wikipedia.org/wiki/Albania"
    },
    {
        ", ": null
    },
    {
        "Bulgaria": "https://en.wikipedia.org/wiki/Bulgaria"
    },
    {
        ", ": null
    },
    {
        "Republic of Macedonia": "https://en.wikipedia.org/wiki/Republic_of_Macedonia"
    },
    {
        ", ": null
    },
    {
        "Bosnia and Herzegovina": "https://en.wikipedia.org/wiki/Bosnia_and_Herzegovina"
    },
    {
        ", ": null
    },
    {
        "Kosovo": "https://en.wikipedia.org/wiki/Kosovo"
    },
    {
        ", and, more recently, to the United States, via ": null
    },
    {
        "Albania": "https://en.wikipedia.org/wiki/Albania"
    },
    {
        ".": null
    },
    {
        "Sufism is popular in such African countries as ": null
    },
    {
        "Egypt": "https://en.wikipedia.org/wiki/Egypt"
    },
    {
        ", ": null
    },
    {
        "Tunisia": "https://en.wikipedia.org/wiki/Tunisia"
    },
    {
        ", ": null
    },
    {
        "Algeria": "https://en.wikipedia.org/wiki/Algeria"
    },
    {
        ", ": null
    },
    {
        "Morocco": "https://en.wikipedia.org/wiki/Morocco"
    },
    {
        ", and ": null
    },
    {
        "Senegal": "https://en.wikipedia.org/wiki/Senegal"
    },
    {
        ", where it is seen as a mystical expression of Islam. Sufism is traditional in Morocco, but has seen a growing revival with the renewal of Sufism under contemporary spiritual teachers such as ": null
    },
    {
        "Hamza al Qadiri al Boutchichi": "https://en.wikipedia.org/wiki/Hamza_al_Qadiri_al_Boutchichi"
    },
    {
        ". Mbacke suggests that one reason Sufism has taken hold in Senegal is because it can accommodate local beliefs and customs, which tend toward the ": null
    },
    {
        "mystical": "https://en.wikipedia.org/wiki/Mysticism"
    },
    {
        ".": null
    },
    {
        "The life of the Algerian Sufi master ": null
    },
    {
        "Abdelkader El Djezairi": "https://en.wikipedia.org/wiki/Abdelkader_El_Djezairi"
    },
    {
        " is instructive in this regard. Notable as well are the lives of ": null
    },
    {
        "Amadou Bamba": "https://en.wikipedia.org/wiki/Amadou_Bamba"
    },
    {
        " and ": null
    },
    {
        "El Hadj Umar Tall": "https://en.wikipedia.org/wiki/El_Hadj_Umar_Tall"
    },
    {
        " in ": null
    },
    {
        "West Africa": "https://en.wikipedia.org/wiki/West_Africa"
    },
    {
        ", and ": null
    },
    {
        "Sheikh Mansur": "https://en.wikipedia.org/wiki/Sheikh_Mansur"
    },
    {
        " and ": null
    },
    {
        "Imam Shamil": "https://en.wikipedia.org/wiki/Imam_Shamil"
    },
    {
        " in the ": null
    },
    {
        "Caucasus": "https://en.wikipedia.org/wiki/Caucasus"
    },
    {
        ". In the twentieth century, some Muslims have called Sufism a superstitious religion which holds back Islamic achievement in the fields of science and technology.": null
    },
    {
        "A number of Westerners have embarked with varying degrees of success on the path of Sufism. One of the first to return to Europe as an official representative of a Sufi order, and with the specific purpose to spread Sufism in Western Europe, was the ": null
    },
    {
        "Swedish": "https://en.wikipedia.org/wiki/Sweden"
    },
    {
        "-born wandering Sufi ": null
    },
    {
        "Ivan Aguéli": "https://en.wikipedia.org/wiki/Ivan_Agu%C3%A9li"
    },
    {
        ". ": null
    },
    {
        "René Guénon": "https://en.wikipedia.org/wiki/Ren%C3%A9_Gu%C3%A9non"
    },
    {
        ", the French scholar, became a Sufi in the early twentieth century and was known as Sheikh Abdul Wahid Yahya. His manifold writings defined the practice of Sufism as the essence of Islam, but also pointed to the universality of its message. Other spiritualists, such as ": null
    },
    {
        "George Gurdjieff": "https://en.wikipedia.org/wiki/George_Gurdjieff"
    },
    {
        ", may or may not conform to the tenets of Sufism as understood by orthodox Muslims.": null
    },
    {
        "Other noteworthy Sufi teachers who have been active in the West in recent years include ": null
    },
    {
        "Bawa Muhaiyaddeen": "https://en.wikipedia.org/wiki/Bawa_Muhaiyaddeen"
    },
    {
        ", ": null
    },
    {
        "Inayat Khan": "https://en.wikipedia.org/wiki/Inayat_Khan"
    },
    {
        ", ": null
    },
    {
        "Nazim Al-Haqqani": "https://en.wikipedia.org/wiki/Nazim_Al-Haqqani"
    },
    {
        ", ": null
    },
    {
        "Muhammad Alauddin Siddiqui": "https://en.wikipedia.org/w/index.php?title=Muhammad_Alauddin_Siddiqui&action=edit&redlink=1"
    },
    {
        ", ": null
    },
    {
        "Javad Nurbakhsh": "https://en.wikipedia.org/wiki/Javad_Nurbakhsh"
    },
    {
        ", ": null
    },
    {
        "Bulent Rauf": "https://en.wikipedia.org/wiki/Bulent_Rauf"
    },
    {
        ", ": null
    },
    {
        "Irina Tweedie": "https://en.wikipedia.org/wiki/Irina_Tweedie"
    },
    {
        ", ": null
    },
    {
        "Idries Shah": "https://en.wikipedia.org/wiki/Idries_Shah"
    },
    {
        ", ": null
    },
    {
        "Muzaffer Ozak": "https://en.wikipedia.org/wiki/Muzaffer_Ozak"
    },
    {
        ", ": null
    },
    {
        "Nahid Angha": "https://en.wikipedia.org/wiki/Nahid_Angha"
    },
    {
        ", and ": null
    },
    {
        "Ali Kianfar": "https://en.wikipedia.org/wiki/Ali_Kianfar"
    },
    {
        ".": null
    },
    {
        "Currently active Sufi academics and publishers include ": null
    },
    {
        "Llewellyn Vaughan-Lee": "https://en.wikipedia.org/wiki/Llewellyn_Vaughan-Lee"
    },
    {
        ", ": null
    },
    {
        "Nuh Ha Mim Keller": "https://en.wikipedia.org/wiki/Nuh_Ha_Mim_Keller"
    },
    {
        ", ": null
    },
    {
        "Abdullah Nooruddeen Durkee": "https://en.wikipedia.org/wiki/Nooruddeen_Durkee"
    },
    {
        ", ": null
    },
    {
        "Waheed Ashraf": "https://en.wikipedia.org/wiki/Waheed_Ashraf"
    },
    {
        ", ": null
    },
    {
        "Omer Tarin": "https://en.wikipedia.org/wiki/Omer_Tarin"
    },
    {
        ", Ahmed abdu r Rashid and ": null
    },
    {
        "Timothy Winter": "https://en.wikipedia.org/wiki/Timothy_Winter"
    },
    {
        ".": null
    },
    {
        "While all Muslims believe that they are on the pathway to Allah and hope to become close to God in ": null
    },
    {
        "Paradise": "https://en.wikipedia.org/wiki/Paradise"
    },
    {
        "—after death and after the ": null
    },
    {
        "Last Judgment": "https://en.wikipedia.org/wiki/Last_Judgment"
    },
    {
        "—Sufis also believe that it is possible to draw closer to God and to more fully embrace the ": null
    },
    {
        "divine presence": "https://en.wikipedia.org/wiki/Divine_presence"
    },
    {
        " in this life. The chief aim of all Sufis is to seek the pleasing of God by working to restore within themselves the primordial state of ": null
    },
    {
        "fitra": "https://en.wikipedia.org/wiki/Fitra"
    },
    {
        ".": null
    },
    {
        "To Sufis, the outer law consists of rules pertaining to worship, transactions, marriage, judicial rulings, and criminal law—what is often referred to, broadly, as \"": null
    },
    {
        "qanun": "https://en.wikipedia.org/wiki/Qanun_(law)"
    },
    {
        "\". The inner law of Sufism consists of rules about repentance from sin, the purging of contemptible qualities and evil traits of character, and adornment with virtues and good character.": null
    },
    {
        "To the Sufi, it is the transmission of divine light from the teacher's heart to the heart of the student, rather than worldly knowledge, that allows the adept to progress. They further believe that the teacher should attempt inerrantly to follow the Divine Law.": null
    },
    {
        "According to ": null
    },
    {
        "Moojan Momen": "https://en.wikipedia.org/wiki/Moojan_Momen"
    },
    {
        " \"one of the most important doctrines of Sufism is the concept of al-Insan al-Kamil \"the Perfect Man\". This doctrine states that there will always exist upon the earth a \"": null
    },
    {
        "Qutb": "https://en.wikipedia.org/wiki/Qutb"
    },
    {
        "\" (Pole or Axis of the Universe)—a man who is the perfect channel of grace from God to man and in a state of ": null
    },
    {
        "wilayah": "https://en.wikipedia.org/wiki/Wilayah"
    },
    {
        " (sanctity, being under the protection of Allah). The concept of the Sufi Qutb is similar to that of the ": null
    },
    {
        "Shi'i Imam": "https://en.wikipedia.org/wiki/Imamah_(Shia_doctrine)"
    },
    {
        ". However, this belief puts Sufism in \"direct conflict\" with Shia Islam, since both the Qutb (who for most Sufi orders is the head of the order) and the Imam fulfill the role of \"the purveyor of spiritual guidance and of Allah's grace to mankind\". The vow of obedience to the Shaykh or Qutb which is taken by Sufis is considered incompatible with devotion to the Imam\".": null
    },
    {
        "As a further example, the prospective adherent of the Mevlevi Order would have been ordered to serve in the kitchens of a hospice for the poor for 1001 days prior to being accepted for spiritual instruction, and a further 1,001 days in solitary retreat as a precondition of completing that instruction.": null
    },
    {
        "Some teachers, especially when addressing more general audiences, or mixed groups of Muslims and non-Muslims, make extensive use of ": null
    },
    {
        "parable": "https://en.wikipedia.org/wiki/Parable"
    },
    {
        ", ": null
    },
    {
        "allegory": "https://en.wikipedia.org/wiki/Allegory"
    },
    {
        ", and ": null
    },
    {
        "metaphor": "https://en.wikipedia.org/wiki/Metaphor"
    },
    {
        ". Although approaches to teaching vary among different Sufi orders, Sufism as a whole is primarily concerned with direct personal experience, and as such has sometimes been compared to other, non-Islamic forms of ": null
    },
    {
        "mysticism": "https://en.wikipedia.org/wiki/Mysticism"
    },
    {
        " (e.g., as in the books of ": null
    },
    {
        "Hossein Nasr": "https://en.wikipedia.org/wiki/Hossein_Nasr"
    },
    {
        ").": null
    },
    {
        "Many Sufi believe that to reach the highest levels of success in Sufism typically requires that the disciple live with and serve the teacher for a long period of time. An example is the folk story about ": null
    },
    {
        "Baha-ud-Din Naqshband Bukhari": "https://en.wikipedia.org/wiki/Baha-ud-Din_Naqshband_Bukhari"
    },
    {
        ", who gave his name to the Naqshbandi Order. He is believed to have served his first teacher, Sayyid Muhammad Baba As-Samasi, for 20 years, until as-Samasi died. He is said to then have served several other teachers for lengthy periods of time. He is said to have helped the poorer members of the community for many years and after this concluded his teacher directed him to care for animals cleaning their wounds, and assisting them.": null
    },
    {
        "Devotion to Muhammad is an exceptionally strong practice within Sufism. Sufis have historically revered Muhammad as the prime personality of spiritual greatness. The Sufi poet ": null
    },
    {
        "Saadi Shirazi": "https://en.wikipedia.org/wiki/Saadi_Shirazi"
    },
    {
        " stated, \"He who chooses a path contrary to that of the prophet, shall never reach the destination. O Saadi, do not think that one can treat that way of purity except in the wake of the chosen one.\" Rumi attributes his self-control and abstinence from worldly desires as qualities attained by him through the guidance of Muhammad. Rumi states, \"I 'sewed' my two eyes shut from [desires for] this world and the next – this I learned from Muhammad.\"": null
    },
    {
        "Ibn Arabi": "https://en.wikipedia.org/wiki/Ibn_Arabi"
    },
    {
        " regards Muhammad as the greatest man and states, \"Muhammad's wisdom is uniqueness (fardiya) because he is the most perfect existent creature of this human species. For this reason, the command began with him and was sealed with him. He was a Prophet while Adam was between water and clay, and his elemental structure is the Seal of the Prophets.\"": null
    },
    {
        "Attar of Nishapur": "https://en.wikipedia.org/wiki/Attar_of_Nishapur"
    },
    {
        " claimed that he praised Muhammad in such a manner that was not done before by any poet, in his book the Ilahi-nama. Fariduddin Attar stated, \"Muhammad is the exemplar to both worlds, the guide of the descendants of Adam. He is the sun of creation, the moon of the celestial spheres, the all-seeing eye...The seven heavens and the eight gardens of paradise were created for him, he is both the eye and the light in the light of our eyes.\" Sufis have historically stressed the importance of Muhammad's perfection and his ability to intercede. The persona of Muhammad has historically been and remains an integral and critical aspect of Sufi belief and practice. Bayazid Bastami is recorded to have been so devoted to the ": null
    },
    {
        "sunnah": "https://en.wikipedia.org/wiki/Sunnah"
    },
    {
        " of Muhammad that he refused to eat a watermelon because he could not establish that Muhammad ever ate one.": null
    },
    {
        "In the 13th century, a Sufi poet from ": null
    },
    {
        "Egypt": "https://en.wikipedia.org/wiki/Egypt"
    },
    {
        ", ": null
    },
    {
        "Al-Busiri": "https://en.wikipedia.org/wiki/Al-Busiri"
    },
    {
        ", wrote the al-Kawākib ad-Durrīya fī Madḥ Khayr al-Barīya (The Celestial Lights in Praise of the Best of Creation) commonly referred to as ": null
    },
    {
        "Qaṣīdat al-Burda": "https://en.wikipedia.org/wiki/Al-Burda"
    },
    {
        " (\"Poem of the Mantle\"), in which he extensively praised Muhammad. This poem is still widely recited and sung amongst Sufi groups all over the world.": null
    },
    {
        "According to Ibn Arabi, Islam is the best religion because of Muhammad. Ibn Arabi regards that the first entity that was brought into existence is the reality or essence of Muhammad (al-ḥaqīqa al-Muhammadiyya). Ibn Arabi regards Muhammad as the supreme human being and master of all creatures. Muhammad is therefore the primary ": null
    },
    {
        "role model": "https://en.wikipedia.org/wiki/Role_model"
    },
    {
        " for human beings to aspire to emulate. Ibn Arabi believes that God's attributes and names are manifested in this world and that the most complete and perfect display of these divine attributes and names are seen in Muhammad. Ibn Arabi believes that one may see God in the mirror of Muhammad, meaning that the divine attributes of God are manifested through Muhammad. Ibn Arabi maintains that Muhammad is the best proof of God and by knowing Muhammad one knows God. Ibn Arabi also maintains that Muhammad is the master of all of humanity in both this world and the afterlife. In this view, Islam is the best religion, because Muhammad is Islam.": null
    },
    {
        "Sufis maintain that Muhammad is Al-Insān al-Kāmil. Sufis believe that aid and support may be received from Muhammad, even today. Sufis believe that Muhammad listens to them when they call upon him. Sufis strive towards having a relationship with Muhammad and seeking to see Muhammad in a dream is a common Sufi practice.": null
    },
    {
        "Sufis believe the sharia (exoteric \"canon\"), ": null
    },
    {
        "tariqa": "https://en.wikipedia.org/wiki/Tariqa"
    },
    {
        " (\"order\") and ": null
    },
    {
        "haqiqa": "https://en.wikipedia.org/wiki/Haqiqa"
    },
    {
        " (\"truth\") are mutually interdependent. Sufism leads the adept, called ": null
    },
    {
        "salik": "https://en.wikipedia.org/wiki/Salik"
    },
    {
        " or \"wayfarer\", in his sulûk or \"road\" through different stations (": null
    },
    {
        "maqaam": "https://en.wikipedia.org/wiki/Maqaam"
    },
    {
        ") until he reaches his goal, the perfect ": null
    },
    {
        "tawhid": "https://en.wikipedia.org/wiki/Tawhid"
    },
    {
        ", the existential confession that God is One. Ibn Arabi says, \"When we see someone in this Community who claims to be able to guide others to God, but is remiss in but one rule of the Sacred Law—even if he manifests miracles that stagger the mind—asserting that his shortcoming is a special dispensation for him, we do not even turn to look at him, for such a person is not a sheikh, nor is he speaking the truth, for no one is entrusted with the secrets of God Most High save one in whom the ordinances of the Sacred Law are preserved. (Jamiʿ karamat al-awliyaʾ)\".": null
    },
    {
        "The ": null
    },
    {
        "Amman Message": "https://en.wikipedia.org/wiki/Amman_Message"
    },
    {
        ", a detailed statement issued by 200 leading Islamic scholars in 2005 in ": null
    },
    {
        "Amman": "https://en.wikipedia.org/wiki/Amman"
    },
    {
        ", specifically recognized the validity of Sufism as a part of Islam. This was adopted by the Islamic world's political and temporal leaderships at the ": null
    },
    {
        "Organisation of the Islamic Conference": "https://en.wikipedia.org/wiki/Organisation_of_Islamic_Cooperation"
    },
    {
        " summit at Mecca in December 2005, and by six other international Islamic scholarly assemblies including the International Islamic Fiqh Academy of Jeddah, in July 2006. The definition of Sufism can vary drastically between different traditions (what may be intended is simple ": null
    },
    {
        "tazkiah": "https://en.wikipedia.org/wiki/Tazkiah"
    },
    {
        " as opposed to the various manifestations of Sufism around the Islamic world).": null
    },
    {
        "The literature of Sufism emphasizes highly subjective matters that resist outside observation, such as the subtle states of the heart. Often these resist direct reference or description, with the consequence that the authors of various Sufi treatises took recourse to allegorical language. For instance, much Sufi poetry refers to intoxication, which Islam expressly forbids. This usage of indirect language and the existence of interpretations by people who had no training in Islam or Sufism led to doubts being cast over the validity of Sufism as a part of Islam. Also, some groups emerged that considered themselves above the sharia and discussed Sufism as a method of bypassing the rules of Islam in order to attain salvation directly. This was disapproved of by traditional scholars.": null
    },
    {
        "For these and other reasons, the relationship between traditional Islamic scholars and Sufism is complex and a range of scholarly opinion on Sufism in Islam has been the norm. Some scholars, such as Al-Ghazali, helped its propagation while other scholars opposed it. ": null
    },
    {
        "William Chittick": "https://en.wikipedia.org/wiki/William_Chittick"
    },
    {
        " explains the position of Sufism and Sufis this way:": null
    },
    {
        "In short, Muslim scholars who focused their energies on understanding the normative guidelines for the body came to be known as jurists, and those who held that the most important task was to train the mind in achieving correct understanding came to be divided into three main schools of thought: theology, philosophy, and Sufism. This leaves us with the third domain of human existence, the spirit. Most Muslims who devoted their major efforts to developing the spiritual dimensions of the human person came to be known as Sufis.": null
    },
    {
        "The term \"neo-Sufism\" was originally coined by ": null
    },
    {
        "Fazlur Rahman": "https://en.wikipedia.org/wiki/Fazlur_Rahman"
    },
    {
        " and used by other scholars to describe reformist currents among 18th century Sufi orders, whose goal was to remove some of the more ecstatic and pantheistic elements of the Sufi tradition and reassert the importance of Islamic law as the basis for inner spirituality and social activism. In recent times, it has been increasingly used by scholars like Mark Sedgwick in another sense, to describe various forms of Sufi-influenced spirituality in the West, in particular the deconfessionalized spiritual movements which emphasize universal elements of the Sufi tradition and de-emphasize its Islamic context. Such groups include ": null
    },
    {
        "The Sufi Order in the West": "https://en.wikipedia.org/wiki/Sufi_Order_In%C4%81yati"
    },
    {
        ", founded by ": null
    },
    {
        "Inayat Khan": "https://en.wikipedia.org/wiki/Inayat_Khan"
    },
    {
        ", which teaches the essential unity of all faiths, and accepts members of all creeds. ": null
    },
    {
        "Sufism Reoriented": "https://en.wikipedia.org/wiki/Sufism_Reoriented"
    },
    {
        " is an offshoot of it charted by the ": null
    },
    {
        "syncretistic": "https://en.wikipedia.org/wiki/Syncretism"
    },
    {
        " teacher ": null
    },
    {
        "Meher Baba": "https://en.wikipedia.org/wiki/Meher_Baba"
    },
    {
        ". The ": null
    },
    {
        "Golden Sufi Center": "https://en.wikipedia.org/w/index.php?title=Golden_Sufi_Center&action=edit&redlink=1"
    },
    {
        " exists in England, Switzerland and the United States. It was founded by ": null
    },
    {
        "Llewellyn Vaughan-Lee": "https://en.wikipedia.org/wiki/Llewellyn_Vaughan-Lee"
    },
    {
        " to continue the work of his teacher ": null
    },
    {
        "Irina Tweedie": "https://en.wikipedia.org/wiki/Irina_Tweedie"
    },
    {
        ", herself a practitioner of both ": null
    },
    {
        "Hinduism": "https://en.wikipedia.org/wiki/Hinduism"
    },
    {
        " and neo-Sufism. Other Western Sufi organisations include the Sufi Foundation of America and the ": null
    },
    {
        "International Association of Sufism": "https://en.wikipedia.org/wiki/International_Association_of_Sufism"
    },
    {
        ".": null
    },
    {
        "Traditional Islamic scholars have recognized two major branches within the practice of Sufism, and use this as one key to differentiating among the approaches of different masters and devotional lineages.": null
    },
    {
        "On the one hand there is the order from the signs to the Signifier (or from the arts to the Artisan). In this branch, the seeker begins by purifying the lower self of every corrupting influence that stands in the way of recognizing all of creation as the work of God, as God's active Self-disclosure or theophany. This is the way of Imam Al-Ghazali and of the majority of the Sufi orders.": null
    },
    {
        "On the other hand, there is the order from the Signifier to His signs, from the Artisan to His works. In this branch the seeker experiences divine attraction (": null
    },
    {
        "jadhba": "https://en.wikipedia.org/w/index.php?title=Jadhba&action=edit&redlink=1"
    },
    {
        "), and is able to enter the order with a glimpse of its endpoint, of direct apprehension of the Divine Presence towards which all spiritual striving is directed. This does not replace the striving to purify the heart, as in the other branch; it simply stems from a different point of entry into the path. This is the way primarily of the masters of the Naqshbandi and ": null
    },
    {
        "Shadhili": "https://en.wikipedia.org/wiki/Shadhili"
    },
    {
        " orders.": null
    },
    {
        "Contemporary scholars may also recognize a third branch, attributed to the late ": null
    },
    {
        "Ottoman": "https://en.wikipedia.org/wiki/Ottoman_Empire"
    },
    {
        " scholar ": null
    },
    {
        "Said Nursi": "https://en.wikipedia.org/wiki/Said_Nursi"
    },
    {
        " and explicated in his vast Qur'an commentary called the ": null
    },
    {
        "Risale-i Nur": "https://en.wikipedia.org/wiki/Risale-i_Nur"
    },
    {
        ". This approach entails strict adherence to the way of Muhammad, in the understanding that this wont, or ": null
    },
    {
        "sunnah": "https://en.wikipedia.org/wiki/Sunnah"
    },
    {
        ", proposes a complete devotional spirituality adequate to those without access to a master of the Sufi way.": null
    },
    {
        "Sufism has contributed significantly to the elaboration of theoretical perspectives in many domains of intellectual endeavor. For instance, the doctrine of \"subtle centers\" or centers of subtle cognition (known as ": null
    },
    {
        "Lataif-e-sitta": "https://en.wikipedia.org/wiki/Lataif-e-sitta"
    },
    {
        ") addresses the matter of the awakening of spiritual intuition. In general, these subtle centers or latâ'if are thought of as faculties that are to be purified sequentially in order to bring the seeker's wayfaring to completion. A concise and useful summary of this system from a living exponent of this tradition has been published by ": null
    },
    {
        "Muhammad Emin Er": "https://en.wikipedia.org/wiki/Muhammad_Emin_Er"
    },
    {
        ".": null
    },
    {
        "Sufi psychology": "https://en.wikipedia.org/wiki/Sufi_psychology"
    },
    {
        " has influenced many areas of thinking both within and outside of Islam, drawing primarily upon three concepts. ": null
    },
    {
        "Ja'far al-Sadiq": "https://en.wikipedia.org/wiki/Ja%27far_al-Sadiq"
    },
    {
        " (both an ": null
    },
    {
        "imam": "https://en.wikipedia.org/wiki/Imamah_(Shi%27a_doctrine)"
    },
    {
        " in the ": null
    },
    {
        "Shia": "https://en.wikipedia.org/wiki/Shia"
    },
    {
        " tradition and a respected scholar and link in chains of Sufi transmission in all Islamic sects) held that human beings are dominated by a lower self called the ": null
    },
    {
        "nafs": "https://en.wikipedia.org/wiki/Nafs"
    },
    {
        " (self, ego, person), a faculty of spiritual intuition called the ": null
    },
    {
        "qalb": "https://en.wikipedia.org/wiki/Qalb"
    },
    {
        " (heart), and ": null
    },
    {
        "ruh": "https://en.wikipedia.org/wiki/Ruh"
    },
    {
        " (soul). These interact in various ways, producing the spiritual types of the tyrant (dominated by nafs), the person of faith and moderation (dominated by the spiritual heart), and the person lost in love for God (dominated by the ruh).": null
    },
    {
        "Of note with regard to the spread of Sufi psychology in the West is ": null
    },
    {
        "Robert Frager": "https://en.wikipedia.org/wiki/Robert_Frager"
    },
    {
        ", a Sufi teacher authorized in the ": null
    },
    {
        "Khalwati": "https://en.wikipedia.org/wiki/Khalwati"
    },
    {
        "Jerrahi": "https://en.wikipedia.org/wiki/Jerrahi"
    },
    {
        " order. Frager was a trained psychologist, born in the United States, who converted to Islam in the course of his practice of Sufism and wrote extensively on Sufism and psychology.": null
    },
    {
        "Sufi cosmology": "https://en.wikipedia.org/wiki/Sufi_cosmology"
    },
    {
        " and ": null
    },
    {
        "Sufi metaphysics": "https://en.wikipedia.org/wiki/Sufi_metaphysics"
    },
    {
        " are also noteworthy areas of intellectual accomplishment.": null
    },
    {
        "The devotional practices of Sufis vary widely. This is because an acknowledged and authorized master of the Sufi path is in effect a physician of the heart, able to diagnose the seeker's impediments to knowledge and pure intention in serving God, and to prescribe to the seeker a course of treatment appropriate to his or her maladies. The consensus among Sufi scholars is that the seeker cannot self-diagnose, and that it can be extremely harmful to undertake any of these practices alone and without formal authorization.": null
    },
    {
        "Prerequisites to practice include rigorous adherence to Islamic norms (ritual prayer in its five prescribed times each day, the fast of Ramadan, and so forth). Additionally, the seeker ought to be firmly grounded in supererogatory practices known from the life of Muhammad (such as the \"sunnah prayers\"). This is in accordance with the words, attributed to God, of the following, a famous ": null
    },
    {
        "Hadith Qudsi": "https://en.wikipedia.org/wiki/Hadith_Qudsi"
    },
    {
        ":": null
    },
    {
        "My servant draws near to Me through nothing I love more than that which I have made obligatory for him. My servant never ceases drawing near to Me through supererogatory works until I love him. Then, when I love him, I am his hearing through which he hears, his sight through which he sees, his hand through which he grasps, and his foot through which he walks.": null
    },
    {
        "It is also necessary for the seeker to have a correct creed (aqidah), and to embrace with certainty its tenets. The seeker must also, of necessity, turn away from sins, love of this world, the love of company and renown, obedience to satanic impulse, and the promptings of the lower self. (The way in which this purification of the heart is achieved is outlined in certain books, but must be prescribed in detail by a Sufi master.) The seeker must also be trained to prevent the corruption of those good deeds which have accrued to his or her credit by overcoming the traps of ostentation, pride, arrogance, envy, and long hopes (meaning the hope for a long life allowing us to mend our ways later, rather than immediately, here and now).": null
    },
    {
        "Sufi practices, while attractive to some, are not a means for gaining knowledge. The traditional scholars of Sufism hold it as absolutely axiomatic that knowledge of God is not a psychological state generated through breath control. Thus, practice of \"techniques\" is not the cause, but instead the occasion for such knowledge to be obtained (if at all), given proper prerequisites and proper guidance by a master of the way. Furthermore, the emphasis on practices may obscure a far more important fact: The seeker is, in a sense, to become a broken person, stripped of all habits through the practice of (in the words of Imam Al-Ghazali) solitude, silence, sleeplessness, and hunger.": null
    },
    {
        "Magic may have also been a part of some Sufi practices, notably in India.": null
    },
    {
        "Dhikr is the remembrance of Allah commanded in the ": null
    },
    {
        "Qur'an": "https://en.wikipedia.org/wiki/Qur%27an"
    },
    {
        " for all ": null
    },
    {
        "Muslims": "https://en.wikipedia.org/wiki/Muslims"
    },
    {
        " through a specific devotional act, such as the repetition of divine names, supplications and aphorisms from hadith literature and the Quran. More generally, dhikr takes a wide range and various layers of meaning. This includes dhikr as any activity in which the Muslim maintains awareness of Allah. To engage in dhikr is to practice consciousness of the Divine Presence and ": null
    },
    {
        "love": "https://en.wikipedia.org/wiki/Love_of_God#Islam"
    },
    {
        ", or \"to seek a state of godwariness\". The Quran refers to Muhammad as the very embodiment of dhikr of Allah (65:10–11). Some types of dhikr are prescribed for all Muslims and do not require Sufi initiation or the prescription of a Sufi master because they are deemed to be good for every seeker under every circumstance.": null
    },
    {
        "The dhikr may slightly vary among each order. Some Sufi orders engage in ritualized dhikr ceremonies, or ": null
    },
    {
        "sema": "https://en.wikipedia.org/wiki/Sema"
    },
    {
        ". Sema includes various forms of worship such as ": null
    },
    {
        "recitation": "https://en.wikipedia.org/wiki/Recitation"
    },
    {
        ", ": null
    },
    {
        "singing": "https://en.wikipedia.org/wiki/Singing"
    },
    {
        " (the most well known being the ": null
    },
    {
        "Qawwali": "https://en.wikipedia.org/wiki/Qawwali"
    },
    {
        " music of the Indian subcontinent), ": null
    },
    {
        "instrumental music": "https://en.wikipedia.org/wiki/Instrumental_music"
    },
    {
        ", ": null
    },
    {
        "dance": "https://en.wikipedia.org/wiki/Dance"
    },
    {
        " (most famously the ": null
    },
    {
        "Sufi whirling": "https://en.wikipedia.org/wiki/Sufi_whirling"
    },
    {
        " of the ": null
    },
    {
        "Mevlevi order": "https://en.wikipedia.org/wiki/Mevlevi_order"
    },
    {
        "), ": null
    },
    {
        "incense": "https://en.wikipedia.org/wiki/Incense"
    },
    {
        ", ": null
    },
    {
        "meditation": "https://en.wikipedia.org/wiki/Meditation"
    },
    {
        ", ": null
    },
    {
        "ecstasy": "https://en.wikipedia.org/wiki/Religious_ecstasy"
    },
    {
        ", and ": null
    },
    {
        "trance": "https://en.wikipedia.org/wiki/Altered_state_of_consciousness"
    },
    {
        ".": null
    },
    {
        "Some Sufi orders stress and place extensive reliance upon dhikr. This practice of dhikr is called ": null
    },
    {
        "Dhikr-e-Qulb": "https://en.wikipedia.org/wiki/Dhikr-e-Qulb"
    },
    {
        " (invocation of Allah within the heartbeats). The basic idea in this practice is to visualize the Allah as having been written on the disciple's heart.": null
    },
    {
        "The practice of muraqaba can be likened to the practices of ": null
    },
    {
        "meditation": "https://en.wikipedia.org/wiki/Meditation"
    },
    {
        " attested in many faith communities.": null
    },
    {
        "While variation exists, one description of the practice within a Naqshbandi lineage reads as follows:": null
    },
    {
        "He is to collect all of his bodily senses in concentration, and to cut himself off from all preoccupation and notions that inflict themselves upon the heart. And thus he is to turn his full consciousness towards God Most High while saying three times: \"Ilahî anta maqsûdî wa-ridâka matlûbî—my God, you are my Goal and Your good pleasure is what I seek\". Then he brings to his heart the Name of the Essence—Allâh—and as it courses through his heart he remains attentive to its meaning, which is \"Essence without likeness\". The seeker remains aware that He is Present, Watchful, Encompassing of all, thereby exemplifying the meaning of his saying (may God bless him and grant him peace): \"Worship God as though you see Him, for if you do not see Him, He sees you\". And likewise the prophetic tradition: \"The most favored level of faith is to know that God is witness over you, wherever you may be\".": null
    },
    {
        "Sufi whirling": "https://en.wikipedia.org/wiki/Sufi_whirling"
    },
    {
        " (or Sufi spinning) is a form of ": null
    },
    {
        "Sama": "https://en.wikipedia.org/wiki/Sama_(Sufism)"
    },
    {
        " or physically active ": null
    },
    {
        "meditation": "https://en.wikipedia.org/wiki/Meditation"
    },
    {
        " which originated among Sufis, and which is still practised by the Sufi ": null
    },
    {
        "Dervishes": "https://en.wikipedia.org/wiki/Dervish"
    },
    {
        " of the ": null
    },
    {
        "Mevlevi": "https://en.wikipedia.org/wiki/Mevlevi_Order"
    },
    {
        " order. It is a customary dance performed within the sema, through which dervishes (also called semazens, from ": null
    },
    {
        "Persian": "https://en.wikipedia.org/wiki/Persian_language"
    },
    {
        ") aim to reach the source of all perfection, or kemal. This is sought through abandoning one's ": null
    },
    {
        "nafs": "https://en.wikipedia.org/wiki/Nafs"
    },
    {
        ", ": null
    },
    {
        "egos": "https://en.wikipedia.org/wiki/Ego_(spirituality)"
    },
    {
        " or personal desires, by listening to the music, focusing on ": null
    },
    {
        "God": "https://en.wikipedia.org/wiki/God"
    },
    {
        ", and spinning one's body in repetitive circles, which has been seen as a symbolic imitation of planets in the ": null
    },
    {
        "Solar System": "https://en.wikipedia.org/wiki/Solar_System"
    },
    {
        " orbiting the sun.": null
    },
    {
        "As explained by Sufis:": null
    },
    {
        "In the symbolism of the Sema ritual, the semazen's camel's hair hat (sikke) represents the tombstone of the ego; his wide, white skirt (tennure) represents the ego's shroud. By removing his black cloak (hırka), he is spiritually reborn to the truth. At the beginning of the Sema, by holding his arms crosswise, the semazen appears to represent the number one, thus testifying to God's unity. While whirling, his arms are open: his right arm is directed to the sky, ready to receive God's beneficence; his left hand, upon which his eyes are fastened, is turned toward the earth. The semazen conveys God's spiritual gift to those who are witnessing the Sema. Revolving from right to left around the heart, the semazen embraces all humanity with love. The human being has been created with love in order to love. Mevlâna Jalâluddîn Rumi says, \"All loves are a bridge to Divine love. Yet, those who have not had a taste of it do not know!\"": null
    },
    {
        "Qawwali": "https://en.wikipedia.org/wiki/Qawwali"
    },
    {
        " is a form of Sufi devotional music popular in ": null
    },
    {
        "South Asia": "https://en.wikipedia.org/wiki/South_Asia"
    },
    {
        ", usually performed at ": null
    },
    {
        "dargahs": "https://en.wikipedia.org/wiki/Dargah"
    },
    {
        ". Sufi saint ": null
    },
    {
        "Amir Khusrow": "https://en.wikipedia.org/wiki/Amir_Khusrow"
    },
    {
        " is said to have infused Persian, Arabic Turkish and ": null
    },
    {
        "Indian classical": "https://en.wikipedia.org/wiki/Indian_classical_music"
    },
    {
        " musical styles to create the genre in the 13th century. The songs are classified into ": null
    },
    {
        "hamd": "https://en.wikipedia.org/wiki/Hamd"
    },
    {
        ", ": null
    },
    {
        "na'at": "https://en.wikipedia.org/wiki/Na%60at"
    },
    {
        ", ": null
    },
    {
        "manqabat": "https://en.wikipedia.org/wiki/Manqabat"
    },
    {
        ", ": null
    },
    {
        "marsiya": "https://en.wikipedia.org/wiki/Marsiya"
    },
    {
        " or ": null
    },
    {
        "ghazal": "https://en.wikipedia.org/wiki/Ghazal"
    },
    {
        ", among others. The songs lasting for about 15 to 30 minutes, are performed by a group of singers, and instruments including the ": null
    },
    {
        "harmonium": "https://en.wikipedia.org/wiki/Pump_organ"
    },
    {
        ", ": null
    },
    {
        "tabla": "https://en.wikipedia.org/wiki/Tabla"
    },
    {
        " and ": null
    },
    {
        "dholak": "https://en.wikipedia.org/wiki/Dholak"
    },
    {
        " are used. Pakistani singing maestro ": null
    },
    {
        "Nusrat Fateh Ali Khan": "https://en.wikipedia.org/wiki/Nusrat_Fateh_Ali_Khan"
    },
    {
        " is credited with popularizing ": null
    },
    {
        "qawwali": "https://en.wikipedia.org/wiki/Qawwali"
    },
    {
        " all over the world.": null
    },
    {
        "Walī (": null
    },
    {
        "Arabic": "https://en.wikipedia.org/wiki/Arabic_language"
    },
    {
        ": ‎, plural ʾawliyāʾ) is an Arabic word whose literal meanings include \"custodian\", \"protector\", \"helper\", and \"friend.\" In the vernacular, it is most commonly used by Muslims to indicate an Islamic ": null
    },
    {
        "saint": "https://en.wikipedia.org/wiki/Saint"
    },
    {
        ", otherwise referred to by the more literal \"friend of God.\" In the traditional Islamic understanding of ": null
    },
    {
        "saints": "https://en.wikipedia.org/wiki/Saint"
    },
    {
        ", the saint is portrayed as someone \"marked by [special] divine favor ... [and] holiness\", and who is specifically \"chosen by God and endowed with exceptional gifts, such as the ability to work ": null
    },
    {
        "miracles": "https://en.wikipedia.org/wiki/Miracle_worker"
    },
    {
        ".\" The doctrine of saints was articulated by Islamic scholars very early on in Muslim history, and particular verses of the ": null
    },
    {
        "Quran": "https://en.wikipedia.org/wiki/Quran"
    },
    {
        " and certain hadith were interpreted by early Muslim thinkers as \"documentary evidence\" of the existence of saints.": null
    },
    {
        "Since the first Muslim hagiographies were written during the period when Sufism began its rapid expansion, many of the figures who later came to be regarded as the major saints in Sunni Islam were the early Sufi mystics, like ": null
    },
    {
        "Hasan of Basra": "https://en.wikipedia.org/wiki/Hasan_of_Basra"
    },
    {
        " (d. 728), ": null
    },
    {
        "Farqad Sabakhi": "https://en.wikipedia.org/wiki/Farqad_Sabakhi"
    },
    {
        " (d. 729), ": null
    },
    {
        "Dawud Tai": "https://en.wikipedia.org/wiki/Dawud_Tai"
    },
    {
        " (d. 777-81) ": null
    },
    {
        "Rabi'a al-'Adawiyya": "https://en.wikipedia.org/wiki/Rabi%27a_al-%27Adawiyya"
    },
    {
        " (d. 801), ": null
    },
    {
        "Maruf Karkhi": "https://en.wikipedia.org/wiki/Maruf_Karkhi"
    },
    {
        " (d. 815), and Junayd of Baghdad (d. 910). From the twelfth to the fourteenth century, \"the general veneration of saints, among both people and sovereigns, reached its definitive form with the organization of Sufism ... into orders or brotherhoods.\" In the common expressions of Islamic piety of this period, the saint was understood to be \"a contemplative whose state of spiritual perfection ... [found] permanent expression in the teaching bequeathed to his disciples.\"": null
    },
    {
        "In popular Sufism (i.e. devotional practices that have achieved currency in world cultures through Sufi influence), one common practice is to ": null
    },
    {
        "visit or make pilgrimages": "https://en.wikipedia.org/wiki/Ziyarat"
    },
    {
        " to the tombs of saints, renowned scholars, and righteous people. This is a particularly common practice in South Asia, where famous tombs include such saints as ": null
    },
    {
        "Sayyid Ali Hamadani": "https://en.wikipedia.org/wiki/Mir_Sayyid_Ali_Hamadani"
    },
    {
        " in ": null
    },
    {
        "Kulob": "https://en.wikipedia.org/wiki/Kulob"
    },
    {
        ", Tajikistan; ": null
    },
    {
        "Afāq Khoja": "https://en.wikipedia.org/wiki/Afaq_Khoja"
    },
    {
        ", near ": null
    },
    {
        "Kashgar": "https://en.wikipedia.org/wiki/Kashgar"
    },
    {
        ", China; ": null
    },
    {
        "Lal Shahbaz Qalandar": "https://en.wikipedia.org/wiki/Lal_Shahbaz_Qalandar"
    },
    {
        " in ": null
    },
    {
        "Sindh": "https://en.wikipedia.org/wiki/Sindh"
    },
    {
        "; ": null
    },
    {
        "Ali Hujwari": "https://en.wikipedia.org/wiki/Ali_Hujwiri"
    },
    {
        " in ": null
    },
    {
        "Lahore": "https://en.wikipedia.org/wiki/Lahore"
    },
    {
        ", Pakistan; ": null
    },
    {
        "Bahauddin Zakariya": "https://en.wikipedia.org/wiki/Bahauddin_Zakariya"
    },
    {
        " in ": null
    },
    {
        "Multan": "https://en.wikipedia.org/wiki/Multan"
    },
    {
        " Pakistan; ": null
    },
    {
        "Moinuddin Chishti": "https://en.wikipedia.org/wiki/Moinuddin_Chishti"
    },
    {
        " in ": null
    },
    {
        "Ajmer": "https://en.wikipedia.org/wiki/Ajmer"
    },
    {
        ", India; ": null
    },
    {
        "Nizamuddin Auliya": "https://en.wikipedia.org/wiki/Nizamuddin_Auliya"
    },
    {
        " in ": null
    },
    {
        "Delhi": "https://en.wikipedia.org/wiki/Delhi"
    },
    {
        ", India; and ": null
    },
    {
        "Shah Jalal": "https://en.wikipedia.org/wiki/Shah_Jalal"
    },
    {
        " in ": null
    },
    {
        "Sylhet": "https://en.wikipedia.org/wiki/Sylhet"
    },
    {
        ", Bangladesh.": null
    },
    {
        "Likewise, in ": null
    },
    {
        "Fez": "https://en.wikipedia.org/wiki/Fes,_Morocco"
    },
    {
        ", Morocco, a popular destination for such pious visitation is the ": null
    },
    {
        "Zaouia Moulay Idriss II": "https://en.wikipedia.org/wiki/Zaouia_Moulay_Idriss_II"
    },
    {
        " and the yearly visitation to see the current Sheikh of the Qadiri Boutchichi ": null
    },
    {
        "Tariqah": "https://en.wikipedia.org/wiki/Tariqah"
    },
    {
        ", Sheikh Sidi Hamza al Qadiri al Boutchichi to celebrate the ": null
    },
    {
        "Mawlid": "https://en.wikipedia.org/wiki/Mawlid"
    },
    {
        " (which is usually televised on Moroccan National television).": null
    },
    {
        "In Islamic mysticism, karamat (": null
    },
    {
        "Arabic": "https://en.wikipedia.org/wiki/Arabic_language"
    },
    {
        ": ‎ karāmāt, pl. of karāmah, lit. generosity, high-mindedness) refers to supernatural wonders performed by ": null
    },
    {
        "Muslim saints": "https://en.wikipedia.org/wiki/Wali"
    },
    {
        ". In the technical vocabulary of Islamic religious sciences, the singular form karama has a sense similar to ": null
    },
    {
        "charism": "https://en.wikipedia.org/wiki/Charism"
    },
    {
        ", a favor or spiritual gift freely bestowed by God. The marvels ascribed to Islamic saints have included supernatural physical actions, predictions of the future, and \"interpretation of the secrets of hearts\". Historically, a \"belief in the miracles of saints (karāmāt al-awliyāʾ, literally 'marvels of the friends [of God]')\" has been \"a requirement in Sunni Islam.\"": null
    },
    {
        "Persecution of Sufis and Sufism has included destruction of Sufi shrines and mosques, suppression of orders, and discrimination against adherents in a number of Muslim-majority countries. The Turkish Republican state banned all Sufi orders and abolished their institutions in 1925 after Sufis opposed the new secular order. The Iranian Islamic Republic has harassed Shia Sufis, reportedly for their lack of support for the government doctrine of \"": null
    },
    {
        "governance of the jurist": "https://en.wikipedia.org/wiki/Islamic_Government:_Governance_of_the_Jurist"
    },
    {
        "\" (i.e., that the supreme ": null
    },
    {
        "Shiite": "https://en.wikipedia.org/wiki/Shiite"
    },
    {
        " jurist should be the nation's political leader).": null
    },
    {
        "In most other Muslim countries, attacks on Sufis and especially their shrines have come from ": null
    },
    {
        "Salafis": "https://en.wikipedia.org/wiki/Salafis"
    },
    {
        " who believe that practices such as ": null
    },
    {
        "celebration of the birthdays of Sufi saints": "https://en.wikipedia.org/wiki/Mawlid#Other_uses_of_the_term"
    },
    {
        ", and dhikr (\"remembrance\" of God) ceremonies are ": null
    },
    {
        "bid‘ah": "https://en.wikipedia.org/wiki/Bid%E2%80%98ah"
    },
    {
        " or impure innovation, and polytheistic (": null
    },
    {
        "Shirk": "https://en.wikipedia.org/wiki/Shirk_(Islam)"
    },
    {
        ").": null
    },
    {
        "At least 305 people were killed and more than 100 wounded during a ": null
    },
    {
        "November 2017 attack": "https://en.wikipedia.org/wiki/2017_Sinai_mosque_attack"
    },
    {
        " on a mosque in Sinai.": null
    },
    {
        "Abdul-Qadir Gilani": "https://en.wikipedia.org/wiki/Abdul-Qadir_Gilani"
    },
    {
        " (1077–1166) was a Persian ": null
    },
    {
        "Hanbali": "https://en.wikipedia.org/wiki/Hanbali"
    },
    {
        " jurist and Sufi based in ": null
    },
    {
        "Baghdad": "https://en.wikipedia.org/wiki/Baghdad"
    },
    {
        ". Qadiriyya was his patronym. Gilani spent his early life in Na'if, the town of his birth. There, he pursued the study of ": null
    },
    {
        "Hanbali": "https://en.wikipedia.org/wiki/Hanbali"
    },
    {
        " law. ": null
    },
    {
        "Abu Saeed Mubarak Makhzoomi": "https://en.wikipedia.org/wiki/Abu_Saeed_Mubarak_Makhzoomi"
    },
    {
        " gave Gilani lessons in ": null
    },
    {
        "fiqh": "https://en.wikipedia.org/wiki/Fiqh"
    },
    {
        ". He was given lessons about hadith by Abu Bakr ibn Muzaffar. He was given lessons about Tafsir by Abu Muhammad Ja'far, a commentator. His Sufi spiritual instructor was Abu'l-Khair Hammad ibn Muslim al-Dabbas. After completing his education, Gilani left Baghdad. He spent twenty-five years as a reclusive wanderer in the desert regions of Iraq. In 1127, Gilani returned to Baghdad and began to preach to the public. He joined the teaching staff of the school belonging to his own teacher, ": null
    },
    {
        "Abu Saeed Mubarak Makhzoomi": "https://en.wikipedia.org/wiki/Abu_Saeed_Mubarak_Makhzoomi"
    },
    {
        ", and was popular with students. In the morning he taught hadith and ": null
    },
    {
        "tafsir": "https://en.wikipedia.org/wiki/Tafsir"
    },
    {
        ", and in the afternoon he held discourse on the science of the heart and the virtues of the Quran.": null
    },
    {
        "Abul Hasan ash-Shadhili": "https://en.wikipedia.org/wiki/Abul_Hasan_ash-Shadhili"
    },
    {
        " (died 1258), the founder of the ": null
    },
    {
        "Shadhiliyya": "https://en.wikipedia.org/wiki/Shadhiliyya"
    },
    {
        " order, introduced dhikr jahri (the remembrance of God out loud, as opposed to the silent dhikr). He taught that his followers need not abstain from what Islam has not forbidden, but to be grateful for what God has bestowed upon them, in contrast to the majority of Sufis, who preach to deny oneself and to destroy the ego-self (": null
    },
    {
        "nafs": "https://en.wikipedia.org/wiki/Nafs"
    },
    {
        ") \"Order of Patience\" (Tariqus-Sabr), Shadhiliyya is formulated to be \"Order of Gratitude\" (Tariqush-Shukr). Imam Shadhili also gave eighteen valuable ": null
    },
    {
        "hizbs": "https://en.wikipedia.org/wiki/Manzil"
    },
    {
        " (litanies) to his followers out of which the notable Hizb al-Bahr is recited worldwide even today.": null
    },
    {
        "Ahmad al-Tijani": "https://en.wikipedia.org/wiki/Ahmad_al-Tijani"
    },
    {
        "Abu al-ʿAbbâs Ahmad ibn Muhammad at-Tijânî or Ahmed Tijani (1735–1815), in Arabic سيدي أحمد التجاني (Sidi Ahmed Tijani), is the founder of the ": null
    },
    {
        "Tijaniyya": "https://en.wikipedia.org/wiki/Tijaniyya"
    },
    {
        "Sufi": "https://en.wikipedia.org/wiki/Sufi"
    },
    {
        " order. He was born in a Berber family, in ": null
    },
    {
        "Aïn Madhi": "https://en.wikipedia.org/wiki/A%C3%AFn_Madhi"
    },
    {
        ", present-day ": null
    },
    {
        "Algeria": "https://en.wikipedia.org/wiki/Algeria"
    },
    {
        " and died in ": null
    },
    {
        "Fez, Morocco": "https://en.wikipedia.org/wiki/Fez,_Morocco"
    },
    {
        " at the age of 80.": null
    },
    {
        "Bayazid Bastami": "https://en.wikipedia.org/wiki/Bayazid_Bastami"
    },
    {
        " is a very well recognized and influential Sufi personality. Bastami was born in 804 in ": null
    },
    {
        "Bastam": "https://en.wikipedia.org/wiki/Bastam"
    },
    {
        ". Bayazid is regarded for his devout commitment to the ": null
    },
    {
        "Sunnah": "https://en.wikipedia.org/wiki/Sunnah"
    },
    {
        " and his dedication to fundamental Islamic principals and practices.": null
    },
    {
        "Bawa Muhaiyaddeen": "https://en.wikipedia.org/wiki/Bawa_Muhaiyaddeen"
    },
    {
        " (died 1986) is a Sufi Sheikh from Sri Lanka. He was first found by a group of religious pilgrims in the early 1900s meditating in the jungles of Kataragama in Sri Lanka (Ceylon). Awed and inspired by his personality and the depth of his wisdom, he was invited to a nearby village. Since that time, people of all walks of life from paupers to prime ministers belonging to all religious and ethnic backgrounds have flocked to see Sheikh Bawa Muhaiyaddeen to seek comfort, guidance and help. Sheikh Bawa Muhaiyaddeen tirelessly spent the rest of his life preaching, healing and comforting the many souls that came to see him.": null
    },
    {
        "Muhyiddin Muhammad b. 'Ali ": null
    },
    {
        "Ibn 'Arabi": "https://en.wikipedia.org/wiki/Ibn_Arabi"
    },
    {
        " (or Ibn al-'Arabi) (AH 561 – AH 638; July 28, 1165 – November 10, 1240) is considered to be one of the most important Sufi masters, although he never founded any order (tariqa). His writings, especially al-Futuhat al-Makkiyya and Fusus al-hikam, have been studied within all the Sufi orders as the clearest expression of tawhid (Divine Unity), though because of their recondite nature they were often only given to initiates. Later those who followed his teaching became known as the school of wahdat al-wujud (the Oneness of Being). He himself considered his writings to have been divinely inspired. As he expressed the Way to one of his close disciples, his legacy is that 'you should never ever abandon your servant-hood (ʿubudiyya), and that there may never be in your soul a longing for any existing thing'.": null
    },
    {
        "Junayd al-Baghdadi": "https://en.wikipedia.org/wiki/Junayd_of_Baghdad"
    },
    {
        " (830–910) was one of the great early Sufis. His order was Junaidia, which links to the golden chain of many Sufi orders. He laid the groundwork for sober mysticism in contrast to that of God-intoxicated Sufis like al-Hallaj, Bayazid Bastami and Abusaeid Abolkheir. During the trial of al-Hallaj, his former disciple, the Caliph of the time demanded his fatwa. In response, he issued this fatwa: \"From the outward appearance he is to die and we judge according to the outward appearance and God knows better\". He is referred to by Sufis as Sayyid-ut Taifa—i.e., the leader of the group. He lived and died in the city of Baghdad.": null
    },
    {
        "Mansur Al-Hallaj": "https://en.wikipedia.org/wiki/Mansur_Al-Hallaj"
    },
    {
        " (died 922) is renowned for his claim, Ana-l-Haqq (\"I am The Truth\"). His refusal to recant this utterance, which was regarded as ": null
    },
    {
        "apostasy": "https://en.wikipedia.org/wiki/Apostasy"
    },
    {
        ", led to a long trial. He was imprisoned for 11 years in a Baghdad prison, before being tortured and publicly dismembered on March 26, 922. He is still revered by Sufis for his willingness to embrace torture and death rather than recant. It is said that during his prayers, he would say \"O Lord! You are the guide of those who are passing through the Valley of Bewilderment. If I am a heretic, enlarge my heresy\".": null
    },
    {
        "Khwaja Moinuddin Chishti": "https://en.wikipedia.org/wiki/Moinuddin_Chishti"
    },
    {
        " was born in 1141 and died in 1236. Also known as Gharīb Nawāz (\"Benefactor of the Poor\"), he is the most famous Sufi saint of the Chishti Order. Moinuddin Chishti introduced and established the order in the Indian subcontinent. The initial spiritual chain or silsila of the Chishti order in India, comprising Moinuddin Chishti, ": null
    },
    {
        "Bakhtiyar Kaki": "https://en.wikipedia.org/wiki/Qutbuddin_Bakhtiar_Kaki"
    },
    {
        ", ": null
    },
    {
        "Baba Farid": "https://en.wikipedia.org/wiki/Fariduddin_Ganjshakar"
    },
    {
        ", ": null
    },
    {
        "Nizamuddin Auliya": "https://en.wikipedia.org/wiki/Nizamuddin_Auliya"
    },
    {
        " (each successive person being the disciple of the previous one), constitutes the great Sufi saints of Indian history. Moinuddin Chishtī turned towards India, reputedly after a dream in which Muhammad blessed him to do so. After a brief stay at Lahore, he reached ": null
    },
    {
        "Ajmer": "https://en.wikipedia.org/wiki/Ajmer"
    },
    {
        " along with Sultan ": null
    },
    {
        "Shahāb-ud-Din Muhammad Ghori": "https://en.wikipedia.org/wiki/Muhammad_of_Ghor"
    },
    {
        ", and settled down there. In Ajmer, he attracted a substantial following, acquiring a great deal of respect amongst the residents of the city. Moinuddin Chishtī practiced the Sufi Sulh-e-Kul (peace to all) concept to promote understanding between Muslims and non-Muslims.": null
    },
    {
        "Rabi'a al-'Adawiyya": "https://en.wikipedia.org/wiki/Rabi%27a_al-%27Adawiyya"
    },
    {
        " or Rabia of Basra (died 801) was a mystic who represents countercultural elements of Sufism, especially with regards to the status and power of women. Prominent Sufi leader ": null
    },
    {
        "Hasan of Basra": "https://en.wikipedia.org/wiki/Hasan_of_Basra"
    },
    {
        " is said to have castigated himself before her superior merits and sincere virtues. Rabi'a was born of very poor origin, but was captured by bandits at a later age and sold into slavery. She was however released by her master when he awoke one night to see the light of sanctity shining above her head. Rabi'a al-Adawiyya is known for her teachings and emphasis on the centrality of the love of God to a holy life. She is said to have proclaimed, running down the streets of ": null
    },
    {
        "Basra": "https://en.wikipedia.org/wiki/Basra"
    },
    {
        ", Iraq:": null
    },
    {
        "O God! If I worship You for fear of Hell, burn me in Hell, and if I worship You in hope of Paradise, exclude me from Paradise. But if I worship You for Your Own sake, grudge me not Your everlasting Beauty.": null
    },
    {
        "She died in ": null
    },
    {
        "Jerusalem": "https://en.wikipedia.org/wiki/Jerusalem"
    },
    {
        " and is thought to have been buried in the ": null
    },
    {
        "Chapel of the Ascension": "https://en.wikipedia.org/wiki/Chapel_of_the_Ascension_(Jerusalem)"
    },
    {
        ".": null
    },
    {
        "A ": null
    },
    {
        "Dargah": "https://en.wikipedia.org/wiki/Dargah"
    },
    {
        " (": null
    },
    {
        "Persian": "https://en.wikipedia.org/wiki/Persian_language"
    },
    {
        ": درگاه dargâh or درگه dargah, also in ": null
    },
    {
        "Urdu": "https://en.wikipedia.org/wiki/Urdu"
    },
    {
        ") is a ": null
    },
    {
        "shrine": "https://en.wikipedia.org/wiki/Shrine"
    },
    {
        " built over the grave of a revered religious figure, often a Sufi ": null
    },
    {
        "saint": "https://en.wikipedia.org/wiki/Saint"
    },
    {
        " or ": null
    },
    {
        "dervish": "https://en.wikipedia.org/wiki/Dervish"
    },
    {
        ". Sufis often visit the shrine for ": null
    },
    {
        "ziyarat": "https://en.wikipedia.org/wiki/Ziyarat"
    },
    {
        ", a term associated with religious visits and pilgrimages. Dargahs are often associated with Sufi eating and meeting rooms and hostels, called ": null
    },
    {
        "khanqah": "https://en.wikipedia.org/wiki/Khanqah"
    },
    {
        " or hospices. They usually include a mosque, meeting rooms, Islamic religious schools (": null
    },
    {
        "madrassas": "https://en.wikipedia.org/wiki/Madrassas"
    },
    {
        "), residences for a teacher or caretaker, hospitals, and other buildings for community purposes.": null
    },
    {
        "The term Tariqa is used for a school or order of Sufism, or especially for the mystical teaching and spiritual practices of such an order with the aim of seeking ": null
    },
    {
        "ḥaqīqah": "https://en.wikipedia.org/wiki/Haqiqa"
    },
    {
        " (ultimate truth). A tariqa has a ": null
    },
    {
        "murshid": "https://en.wikipedia.org/wiki/Murshid"
    },
    {
        " (guide) who plays the role of leader or spiritual director. The members or followers of a tariqa are known as ": null
    },
    {
        "murīdīn": "https://en.wikipedia.org/wiki/Murid"
    },
    {
        " (singular murīd), meaning \"desirous\", viz. \"desiring the knowledge of knowing God and loving God\".": null
    },
    {
        "The Bektashi Order was founded in the 13th century by the Islamic saint Haji Bektash Veli, and greatly influenced during its fomulative period by the ": null
    },
    {
        "Hurufi": "https://en.wikipedia.org/wiki/Hurufism"
    },
    {
        " Ali al-'Ala in the 15th century and reorganized by ": null
    },
    {
        "Balım Sultan": "https://en.wikipedia.org/wiki/Bal%C4%B1m_Sultan"
    },
    {
        " in the 16th century.": null
    },
    {
        "The Chishti Order (": null
    },
    {
        "Persian": "https://en.wikipedia.org/wiki/Persian_language"
    },
    {
        ": ‎) was founded by (": null
    },
    {
        "Khawaja": "https://en.wikipedia.org/wiki/Khawaja"
    },
    {
        ") ": null
    },
    {
        "Abu Ishaq Shami": "https://en.wikipedia.org/wiki/Abu_Ishaq_Shami"
    },
    {
        " (\"the Syrian\"; died 941) who brought Sufism to the town of ": null
    },
    {
        "Chisht": "https://en.wikipedia.org/w/index.php?title=Chisht&action=edit&redlink=1"
    },
    {
        ", some 95 miles east of ": null
    },
    {
        "Herat": "https://en.wikipedia.org/wiki/Herat"
    },
    {
        " in present-day Afghanistan. Before returning to the Levant, Shami initiated, trained and deputized the son of the local ": null
    },
    {
        "Emir": "https://en.wikipedia.org/wiki/Emir"
    },
    {
        " (Khwaja) ": null
    },
    {
        "Abu Ahmad Abdal": "https://en.wikipedia.org/w/index.php?title=Abu_Ahmad_Abdal&action=edit&redlink=1"
    },
    {
        " (died 966). Under the leadership of Abu Ahmad's descendants, the Chishtiyya as they are also known, flourished as a regional mystical order.": null
    },
    {
        "The ": null
    },
    {
        "Kubrawiya": "https://en.wikipedia.org/wiki/Kubrawiya"
    },
    {
        " order is a ": null
    },
    {
        "Sufi": "https://en.wikipedia.org/wiki/Sufi"
    },
    {
        " order (\"": null
    },
    {
        "tariqa": "https://en.wikipedia.org/wiki/Tariqa"
    },
    {
        "\") named after its 13th-century founder ": null
    },
    {
        "Najmuddin Kubra": "https://en.wikipedia.org/wiki/Najmuddin_Kubra"
    },
    {
        ". The ": null
    },
    {
        "Kubrawiya": "https://en.wikipedia.org/wiki/Kubrawiya"
    },
    {
        "Sufi": "https://en.wikipedia.org/wiki/Sufi"
    },
    {
        " order was founded in the 13th century by ": null
    },
    {
        "Najmuddin Kubra": "https://en.wikipedia.org/wiki/Najmuddin_Kubra"
    },
    {
        " in ": null
    },
    {
        "Bukhara": "https://en.wikipedia.org/wiki/Bukhara"
    },
    {
        " in modern ": null
    },
    {
        "Uzbekistan": "https://en.wikipedia.org/wiki/Uzbekistan"
    },
    {
        ". The ": null
    },
    {
        "Mongols": "https://en.wikipedia.org/wiki/Mongols"
    },
    {
        " had captured Bukhara in 1221, they committed ": null
    },
    {
        "genocide": "https://en.wikipedia.org/wiki/Genocide"
    },
    {
        " and killed nearly the whole population. ": null
    },
    {
        "Sheikh Nadjm ed-Din Kubra": "https://en.wikipedia.org/wiki/Najmuddin_Kubra"
    },
    {
        " was among those killed by the Mongols.": null
    },
    {
        "The ": null
    },
    {
        "Mevlevi Order": "https://en.wikipedia.org/wiki/Mevlevi_Order"
    },
    {
        " is better known in the West as the \"whirling dervishes\".": null
    },
    {
        "Mouride": "https://en.wikipedia.org/wiki/Mouride"
    },
    {
        " is a large Islamic Sufi order most prominent in ": null
    },
    {
        "Senegal": "https://en.wikipedia.org/wiki/Senegal"
    },
    {
        " and ": null
    },
    {
        "The Gambia": "https://en.wikipedia.org/wiki/The_Gambia"
    },
    {
        ", with headquarters in the holy city of ": null
    },
    {
        "Touba, Senegal": "https://en.wikipedia.org/wiki/Touba,_Senegal"
    },
    {
        ".": null
    },
    {
        "The Naqshbandi order is one of the major Sufi orders of Islam, previously known as Siddiqiyya as the order stems from Mohammad through Abū Bakr as-Șiddīq. It is considered by some to be a \"sober\" order known for its silent dhikr (remembrance of God) rather than the vocalized forms of dhikr common in other orders. The word \"Naqshbandi\" () is ": null
    },
    {
        "Persian": "https://en.wikipedia.org/wiki/Persian_language"
    },
    {
        ", taken from the name of the founder of the order, ": null
    },
    {
        "Baha-ud-Din Naqshband Bukhari": "https://en.wikipedia.org/wiki/Baha-ud-Din_Naqshband_Bukhari"
    },
    {
        ". Some have said that the translation means \"related to the image-maker\", some also consider it to mean \"Pattern Maker\" rather than \"image maker\", and interpret \"Naqshbandi\" to mean \"Reformer of Patterns\", and others consider it to mean \"Way of the Chain\" or \"": null
    },
    {
        "Silsilat al-dhahab": "https://en.wikipedia.org/wiki/Silsilat_al-dhahab"
    },
    {
        "\".": null
    },
    {
        "The Ni'matullāhī order is the most widespread Sufi order of ": null
    },
    {
        "Persia": "https://en.wikipedia.org/wiki/Persia"
    },
    {
        " today. It was founded by ": null
    },
    {
        "Shah Ni'matullah Wali": "https://en.wikipedia.org/wiki/Shah_Nimatullah_Wali"
    },
    {
        " (died 1367), established and transformed from his inheritance of the ": null
    },
    {
        "Ma'rufiyyah": "https://en.wikipedia.org/w/index.php?title=Ma%27rufiyyah&action=edit&redlink=1"
    },
    {
        " circle. There are several suborders in existence today, the most known and influential in the West following the lineage of ": null
    },
    {
        "Dr. Javad Nurbakhsh": "https://en.wikipedia.org/wiki/Javad_Nurbakhsh"
    },
    {
        " who brought the order to the West following the ": null
    },
    {
        "1979 Revolution": "https://en.wikipedia.org/wiki/Iranian_Revolution"
    },
    {
        " in ": null
    },
    {
        "Iran": "https://en.wikipedia.org/wiki/Iran"
    },
    {
        ".": null
    },
    {
        "The Qadiri Order is one of the oldest Sufi Orders. It derives its name from ": null
    },
    {
        "Abdul-Qadir Gilani": "https://en.wikipedia.org/wiki/Abdul-Qadir_Gilani"
    },
    {
        " (1077–1166), a native of the Iranian province of ": null
    },
    {
        "Gīlān": "https://en.wikipedia.org/wiki/G%C4%ABl%C4%81n_Province"
    },
    {
        ". The order is one of the most widespread of the Sufi orders in the Islamic world, and has a huge presence in ": null
    },
    {
        "Central Asia": "https://en.wikipedia.org/wiki/Central_Asia"
    },
    {
        ", ": null
    },
    {
        "Pakistan": "https://en.wikipedia.org/wiki/Pakistan"
    },
    {
        ", ": null
    },
    {
        "Turkey": "https://en.wikipedia.org/wiki/Turkey"
    },
    {
        ", ": null
    },
    {
        "Balkans": "https://en.wikipedia.org/wiki/Balkans"
    },
    {
        " and much of ": null
    },
    {
        "East": "https://en.wikipedia.org/wiki/East_Africa"
    },
    {
        " and ": null
    },
    {
        "West Africa": "https://en.wikipedia.org/wiki/West_Africa"
    },
    {
        ". The Qadiriyyah have not developed any distinctive doctrines or teachings outside of mainstream Islam. They believe in the fundamental principles of Islam, but interpreted through mystical experience.": null
    },
    {
        "Senussi is a religious-political Sufi order established by ": null
    },
    {
        "Muhammad ibn Ali as-Senussi": "https://en.wikipedia.org/wiki/Muhammad_ibn_Ali_as-Senussi"
    },
    {
        ". Muhammad ibn Ali as-Senussi founded this movement due to his criticism of the Egyptian ": null
    },
    {
        "ulema": "https://en.wikipedia.org/wiki/Ulema"
    },
    {
        ". Originally from Mecca, as-Senussi left due to pressure from ": null
    },
    {
        "Wahhabis": "https://en.wikipedia.org/wiki/Wahhabism"
    },
    {
        " to leave and settled in ": null
    },
    {
        "Cyrenaica": "https://en.wikipedia.org/wiki/Cyrenaica"
    },
    {
        " where he was well received.": null
    },
    {
        "Idris bin Muhammad al-Mahdi as-Senussi": "https://en.wikipedia.org/wiki/Idris_of_Libya"
    },
    {
        " was later recognized as Emir of Cyrenaica and eventually became ": null
    },
    {
        "King of Libya": "https://en.wikipedia.org/wiki/Kingdom_of_Libya"
    },
    {
        ". The monarchy was abolished by ": null
    },
    {
        "Muammar Gaddafi": "https://en.wikipedia.org/wiki/Muammar_Gaddafi"
    },
    {
        " but, a third of Libyan still claim to be Senussi.": null
    },
    {
        "The ": null
    },
    {
        "Shadhili": "https://en.wikipedia.org/wiki/Shadhili"
    },
    {
        " is a Sufi order founded by ": null
    },
    {
        "Abu-l-Hassan ash-Shadhili": "https://en.wikipedia.org/wiki/Abu-l-Hassan_ash-Shadhili"
    },
    {
        ". Ikhwans (Murids - followers) of the Shadhiliyya are often known as Shadhilis. Fassiya a branch of Shadhiliyya founded by ": null
    },
    {
        "Imam al Fassi": "https://en.wikipedia.org/wiki/Al-Fassi_family"
    },
    {
        " of Makkah is the widely practiced Sufi order in Saudi Arabia, Egypt, India, Sri Lanka, Bangladesh, Pakistan, Malaysia, Singapore, Mauritius, Indonesia and other middle east countries.": null
    },
    {
        "The Suhrawardiyya order (": null
    },
    {
        "Arabic": "https://en.wikipedia.org/wiki/Arabic_language"
    },
    {
        ": ‎) is a Sufi order founded by ": null
    },
    {
        "Abu al-Najib al-Suhrawardi": "https://en.wikipedia.org/wiki/Abu_al-Najib_al-Suhrawardi"
    },
    {
        " (1097–1168). The order was formalized by his nephew, ": null
    },
    {
        "Shahab al-Din Abu Hafs Umar Suhrawardi": "https://en.wikipedia.org/wiki/Shahab_al-Din_Abu_Hafs_Umar_Suhrawardi"
    },
    {
        ".": null
    },
    {
        "The ": null
    },
    {
        "Tijaniyyah": "https://en.wikipedia.org/wiki/Tijaniyyah"
    },
    {
        " order attach a large importance to culture and education, and emphasize the individual adhesion of the ": null
    },
    {
        "disciple": "https://en.wikipedia.org/wiki/Apprenticeship"
    },
    {
        " (": null
    },
    {
        "murīd": "https://en.wikipedia.org/wiki/Murid"
    },
    {
        ").": null
    },
    {
        "Sufi mysticism has long exercised a fascination upon the Western world, and especially its Orientalist scholars. Figures like Rumi have become well known in the United States, where Sufism is perceived as a peaceful and apolitical form of Islam. Orientalists have proposed a variety of diverse theories pertaining to the nature of Sufism, such as it being influenced by ": null
    },
    {
        "Neoplatonism": "https://en.wikipedia.org/wiki/Neoplatonism"
    },
    {
        " or as an ": null
    },
    {
        "Aryan": "https://en.wikipedia.org/wiki/Aryan_race"
    },
    {
        " historical reaction against \"": null
    },
    {
        "Semitic": "https://en.wikipedia.org/wiki/Semitic_people"
    },
    {
        "\" cultural influence.": null
    },
    {
        "Hossein Nasr": "https://en.wikipedia.org/wiki/Hossein_Nasr"
    },
    {
        " states that the preceding theories are false according to the point of view of Sufism.": null
    },
    {
        "The Islamic Institute in Mannheim, Germany, which works towards the integration of ": null
    },
    {
        "Europe": "https://en.wikipedia.org/wiki/Europe"
    },
    {
        " and Muslims, sees Sufism as particularly suited for interreligious dialogue and intercultural harmonisation in democratic and pluralist societies; it has described Sufism as a symbol of tolerance and ": null
    },
    {
        "humanism": "https://en.wikipedia.org/wiki/Humanism"
    },
    {
        "—nondogmatic, flexible and non-violent. According to ": null
    },
    {
        "Philip Jenkins": "https://en.wikipedia.org/wiki/Philip_Jenkins"
    },
    {
        ", a Professor at Baylor University, \"the Sufis are much more than tactical allies for the West: they are, potentially, the greatest hope for pluralism and democracy within Muslim nations.\" Likewise, several governments and organisations have advocated the promotion of Sufism as a means of combating intolerant and ": null
    },
    {
        "violent strains of Islam": "https://en.wikipedia.org/wiki/Islam_and_violence"
    },
    {
        ". For example, the Chinese and Russian governments openly favor Sufism as the best means of protecting against Islamist subversion. The British government, especially following the ": null
    },
    {
        "7 July 2005 London bombings": "https://en.wikipedia.org/wiki/7_July_2005_London_bombings"
    },
    {
        ", has favoured Sufi groups in its battle against ": null
    },
    {
        "Muslim extremist": "https://en.wikipedia.org/wiki/Muslim_extremist"
    },
    {
        " currents. The influential ": null
    },
    {
        "RAND Corporation": "https://en.wikipedia.org/wiki/RAND_Corporation"
    },
    {
        ", an American think-tank, issued a major report titled \"Building Moderate Muslim Networks,\" which urged the US government to form links with and bolster Muslim groups that opposed Islamist extremism. The report stressed the Sufi role as moderate traditionalists open to change, and thus as allies against violence. News organisations such as the BBC, Economist and Boston Globe have also seen Sufism as a means to deal with violent Muslim extremists.": null
    },
    {
        "Idries Shah": "https://en.wikipedia.org/wiki/Idries_Shah"
    },
    {
        " states that Sufism is universal in nature, its roots predating the rise of Islam and Christianity. He quotes ": null
    },
    {
        "Suhrawardi": "https://en.wikipedia.org/wiki/Abu_al-Najib_al-Suhrawardi"
    },
    {
        " as saying that \"this [Sufism] was a form of wisdom known to and practiced by a succession of sages including the mysterious ancient ": null
    },
    {
        "Hermes of Egypt": "https://en.wikipedia.org/wiki/Hermes_Trismegistus"
    },
    {
        ".\", and that ": null
    },
    {
        "Ibn al-Farid": "https://en.wikipedia.org/wiki/Ibn_al-Farid"
    },
    {
        " \"stresses that Sufism lies behind and before systematization; that 'our wine existed before what you call the grape and the vine' (the school and the system)...\" Shah's views have however been rejected by modern scholars. Such modern trends of neo-Sufis in Western countries allow non-Muslims to receive \"instructions on following the Sufi path\", not without opposition by Muslims who consider such instruction outside the sphere of Islam.": null
    },
    {
        "Both Judaism and Islam are monotheistic. There is evidence that Sufism did influence the development of some schools of Jewish philosophy and ethics. In the first writing of this kind, we see \"Kitab al-Hidayah ila Fara'iḍ al-Ḳulub\", ": null
    },
    {
        "Duties of the Heart": "https://en.wikipedia.org/wiki/Duties_of_the_Heart"
    },
    {
        ", of ": null
    },
    {
        "Bahya ibn Paquda": "https://en.wikipedia.org/wiki/Bahya_ibn_Paquda"
    },
    {
        ". This book was translated by ": null
    },
    {
        "Judah ibn Tibbon": "https://en.wikipedia.org/wiki/Judah_ibn_Tibbon"
    },
    {
        " into ": null
    },
    {
        "Hebrew": "https://en.wikipedia.org/wiki/Hebrew"
    },
    {
        " under the title \"Ḥōḇōṯ Ha-lleḇāḇōṯ\".": null
    },
    {
        "The precepts prescribed by the ": null
    },
    {
        "Torah": "https://en.wikipedia.org/wiki/Torah"
    },
    {
        " number 613 only; those dictated by the intellect are innumerable.": null
    },
    {
        "It is noteworthy that in the ethical writings of the Sufis ": null
    },
    {
        "Al-Kusajri": "https://en.wikipedia.org/w/index.php?title=Al-Kusajri&action=edit&redlink=1"
    },
    {
        " and ": null
    },
    {
        "Al-Harawi": "https://en.wikipedia.org/wiki/Harawi_(genre)"
    },
    {
        " there are sections which treat of the same subjects as those treated in the \"Ḥovot ha-Lebabot\" and which bear the same titles: e.g., \"Bab al-Tawakkul\"; \"Bab al-Taubah\"; \"Bab al-Muḥasabah\"; \"Bab al-Tawaḍu'\"; \"Bab al-Zuhd\". In the ninth gate, Baḥya directly quotes sayings of the Sufis, whom he calls Perushim. However, the author of the Ḥōḇōṯ Ha-lleḇāḇōṯ did not go so far as to approve of the asceticism of the Sufis, although he showed a marked predilection for their ethical principles.": null
    },
    {
        "Abraham ben Moses ben Maimon": "https://en.wikipedia.org/wiki/Avraham_son_of_Rambam"
    },
    {
        ", the son of the Jewish philosopher ": null
    },
    {
        "Maimonides": "https://en.wikipedia.org/wiki/Maimonides"
    },
    {
        ", believed that Sufi practices and doctrines continue the tradition of the Biblical prophets. See Sefer Hammaspiq, \"Happerishuth\", Chapter 11 (\"Ha-mmaʿaḇāq\") s.v. hithbonen efo be-masoreth mufla'a zo, citing the Talmudic explanation of Jeremiah 13:27 in Chagigah 5b; in Rabbi Yaakov Wincelberg's translation, \"The Way of Serving God\" (Feldheim), p. 429 and above, p. 427. Also see ibid., Chapter 10 (\"Iqquḇim\"), s.v. wa-halo yoḏeʾaʿ atta; in \"The Way of Serving God\", p. 371.": null
    },
    {
        "Abraham Maimuni's principal work is originally composed in ": null
    },
    {
        "Judeo-Arabic": "https://en.wikipedia.org/wiki/Judeo-Arabic"
    },
    {
        " and entitled \"כתאב כפאיה אלעאבדין\" Kitāb Kifāyah al-'Ābidīn (\"A Comprehensive Guide for the Servants of God\"). From the extant surviving portion it is conjectured that Maimuni's treatise was three times as long as his father's Guide for the Perplexed. In the book, Maimuni evidences a great appreciation for, and affinity to, Sufism. Followers of his path continued to foster a Jewish-Sufi form of pietism for at least a century, and he is rightly considered the founder of this pietistic school, which was centered in ": null
    },
    {
        "Egypt": "https://en.wikipedia.org/wiki/Egypt"
    },
    {
        ".": null
    },
    {
        "The followers of this path, which they called, interchangeably, Hasidism (not to be confused with the [later] ": null
    },
    {
        "Jewish": "https://en.wikipedia.org/wiki/Jewish"
    },
    {
        "Hasidic": "https://en.wikipedia.org/wiki/Hasidic_Judaism"
    },
    {
        " movement) or Sufism (Tasawwuf), practiced spiritual retreats, solitude, fasting and sleep deprivation. The Jewish Sufis maintained their own ": null
    },
    {
        "brotherhood": "https://en.wikipedia.org/wiki/Sufi_order"
    },
    {
        ", guided by a religious leader—like a Sufi ": null
    },
    {
        "sheikh": "https://en.wikipedia.org/wiki/Sheikh"
    },
    {
        ".": null
    },
    {
        "The ": null
    },
    {
        "Jewish Encyclopedia": "https://en.wikipedia.org/wiki/Jewish_Encyclopedia"
    },
    {
        " in its entry on Sufism states that the revival of Jewish mysticism in Muslim countries is probably due to the spread of Sufism in the same geographical areas. The entry details many parallels to Sufic concepts found in the writings of prominent Kabbalists during the ": null
    },
    {
        "Golden age of Jewish culture in Spain": "https://en.wikipedia.org/wiki/Golden_age_of_Jewish_culture_in_Spain"
    },
    {
        ".": null
    },
    {
        "In 2005, Indian musician ": null
    },
    {
        "Rabbi Shergill": "https://en.wikipedia.org/wiki/Rabbi_Shergill"
    },
    {
        " released a Sufi rock song called \"": null
    },
    {
        "Bulla Ki Jaana": "https://en.wikipedia.org/wiki/Bulla_Ki_Jaana"
    },
    {
        "\", which became a chart-topper in India and Pakistan.": null
    },
    {
        "The 13h century Persian poet ": null
    },
    {
        "Rumi": "https://en.wikipedia.org/wiki/Rumi"
    },
    {
        ", is considered one of the most influential figures of Sufism, as well as one of the greatest poets of all time. He has become one of the most widely read poets in the United States, thanks largely to the interpretative translations published by ": null
    },
    {
        "Coleman Barks": "https://en.wikipedia.org/wiki/Coleman_Barks"
    },
    {
        ".": null
    },
    {
        "Elif Şafak": "https://en.wikipedia.org/wiki/Elif_%C5%9Eafak"
    },
    {
        "'s novel The Forty Rules of Love is a fictionalized account of Rumi's encounter with the Persian dervish ": null
    },
    {
        "Shams Tabrizi": "https://en.wikipedia.org/wiki/Shams_Tabrizi"
    },
    {
        ".": null
    },
    {
        "Allama Iqbal": "https://en.wikipedia.org/wiki/Muhammad_Iqbal"
    },
    {
        ", one of the greatest ": null
    },
    {
        "Urdu": "https://en.wikipedia.org/wiki/Urdu"
    },
    {
        " poets has discussed Sufism, philosophy and Islam in his English work ": null
    },
    {
        "The Reconstruction of Religious Thought in Islam": "https://en.wikipedia.org/wiki/The_Reconstruction_of_Religious_Thought_in_Islam"
    },
    {
        ".": null
    }
]