[
    {
        "Cat communication is the transfer of information by one or more ": null
    },
    {
        "cats": "https://en.wikipedia.org/wiki/Cat"
    },
    {
        " that has an effect on the current or future behaviour of another animal, including humans.  Cats use a range of communication modalities including vocal, visual, tactile and olfactory. Cats have intricate feelings that many people believe they can sense due to their strong connections with their individual cats.": null
    },
    {
        "The communication modalities used by domestic cats have been affected by ": null
    },
    {
        "domestication": "https://en.wikipedia.org/wiki/Domestication"
    },
    {
        ".": null
    },
    {
        "Cat vocalisations have been categorised according to a range of characteristics.": null
    },
    {
        "Susanne Schötz categorised vocalizations according to three mouth actions:": null
    },
    {
        "Brown et al. categorised vocal responses of cats according to the behavioural context: during separation of kittens from mother cats, during food deprivation, during pain, prior to or during threat or attack behavior, as in disputes over territory or food, during a painful or acutely stressful experience, as in routine prophylactic injections and during kitten deprivation. Less commonly recorded calls from mature cats included purring, ": null
    },
    {
        "conspecific": "https://en.wikipedia.org/wiki/Biological_specificity"
    },
    {
        " greeting calls or murmurs, extended vocal dialogues between cats in separate cages, \"frustration\" calls during training or extinction of conditioned responses.": null
    },
    {
        "Miller classified vocalisations into five categories according to the sound produced: the purr, chirr, call, meow and growl/snarl/hiss.": null
    },
    {
        "Owens et al. (2017) categorized cat vocalisations based on their acoustic structures. There are three categories: tonal sounds, pulse sounds, and broadband sounds. Tonal sounds are further categorized into groups of harmonically structured sounds or regular tonal sounds. Pulse vocalisations are separated into pulse bursts and hybrid pulse bursts with tonal endings. Broadband sounds are separated into four groups: non-tonal broadband sounds, broadband sounds with tonal beginnings, broadband sounds with short tonal elements, and broadband sounds with long tonal endings.": null
    },
    {
        "The purr is a continuous, soft, vibrating sound made in the throat by most species of ": null
    },
    {
        "felines": "https://en.wikipedia.org/wiki/Felidae"
    },
    {
        ". Domestic kittens can purr as early as two days of age.  This tonal rumbling can characterize different personalities in domestic cats. Purring is often believed to indicate a ": null
    },
    {
        "positive emotional state": "https://en.wikipedia.org/wiki/Emotion_in_animals#Cats"
    },
    {
        ", but cats sometimes purr when they are ill, tense, or experiencing traumatic or painful moments such as giving birth. A more expansive definition is \"purring signals a friendly social mood, and it can be given as a signal to, say, a vet from an injured cat indicating the need for friendship, or as a signal to an owner, saying thank you for friendship given.\"": null
    },
    {
        "The mechanism of how cats purr is elusive. This is partly because cats do not have a unique anatomical feature that is clearly responsible for this vocalization.  One hypothesis, supported by ": null
    },
    {
        "electromyographic": "https://en.wikipedia.org/wiki/Electromyographic"
    },
    {
        " studies, is that cats produce the purring noise by using the ": null
    },
    {
        "vocal folds": "https://en.wikipedia.org/wiki/Vocal_folds"
    },
    {
        " and/or the muscles of the ": null
    },
    {
        "larynx": "https://en.wikipedia.org/wiki/Larynx"
    },
    {
        " to alternately dilate and constrict the ": null
    },
    {
        "glottis": "https://en.wikipedia.org/wiki/Glottis"
    },
    {
        " rapidly, causing air vibrations during inhalation and exhalation. Combined with the steady inhalation and exhalation as the cat breathes, a purring noise is produced with strong ": null
    },
    {
        "harmonics": "https://en.wikipedia.org/wiki/Harmonics"
    },
    {
        ". Purring is sometimes accompanied by other sounds, though this varies between individuals.  Some may only purr, while other cats also emit low level outbursts sometimes described as \"lurps\" or \"yowps\".": null
    },
    {
        "Domestic cats purr at varying ": null
    },
    {
        "frequencies": "https://en.wikipedia.org/wiki/Frequency"
    },
    {
        ". One study reported that domestic cats purr at average frequencies of 21.98 Hz in the ": null
    },
    {
        "egressive": "https://en.wikipedia.org/wiki/Egressive"
    },
    {
        " phase and 23.24 Hz in the ": null
    },
    {
        "ingressive": "https://en.wikipedia.org/wiki/Ingressive"
    },
    {
        " phase with an overall mean of 22.6 Hz. Further research on purring in four domestic cats found that the ": null
    },
    {
        "fundamental frequency": "https://en.wikipedia.org/wiki/Fundamental_frequency"
    },
    {
        " varied between 20.94 and 27.21 Hz for the egressive phase and between 23.0 and 26.09 Hz for the ingressive phase. There was considerable variation between the four cats in the relative amplitude, duration and frequency between egressive and ingressive phases, although this variation generally occurred within the normal range.": null
    },
    {
        "One study on a single ": null
    },
    {
        "cheetah": "https://en.wikipedia.org/wiki/Cheetah"
    },
    {
        " (Acinonyx jubatus) showed it purred with an average frequency of 20.87 Hz (egressive phases) and 18.32 Hz (ingressive phases).  A further study on four adult cheetahs found that mean frequencies were between 19.3 Hz and 20.5 Hz in ingressive phases, and between 21.9 Hz and 23.4 Hz in egressive phases.  The egressive phases were longer than ingressive phases and moreover, the amplitude was greater in the egressive phases.": null
    },
    {
        "It was once believed that only the cats of the ": null
    },
    {
        "genus": "https://en.wikipedia.org/wiki/Genus"
    },
    {
        "Felis": "https://en.wikipedia.org/wiki/Felis"
    },
    {
        " could purr. However, felids of the genus ": null
    },
    {
        "Panthera": "https://en.wikipedia.org/wiki/Panthera"
    },
    {
        " (tigers, lions, jaguars and leopards) also produce sounds similar to purring, but only when exhaling. The subdivision of the Felidae into 'purring cats' on the one hand and 'roaring cats' (i.e. non-purring) on the other, originally goes back to Owen (1834/1835) and was definitely introduced by Pocock (1916), based on a difference in ": null
    },
    {
        "hyoid": "https://en.wikipedia.org/wiki/Hyoid_bone"
    },
    {
        " anatomy. The 'roaring cats' (lion, Panthera leo; tiger, P. tigris; jaguar, P. onca; leopard, P. pardus) have an incompletely ossified hyoid, which according to this theory, enables them to roar but not to purr. On the other hand, the ": null
    },
    {
        "snow leopard": "https://en.wikipedia.org/wiki/Snow_leopard"
    },
    {
        " (Uncia uncia), as the fifth felid species with an incompletely ossified hyoid, purrs (Hemmer, 1972). All remaining species of the family Felidae ('purring cats') have a completely ossified hyoid which enables them to purr but not to roar. However, Weissengruber et al. (2002) argued that the ability of a cat species to purr is not affected by the anatomy of its hyoid, i.e. whether it is fully ossified or has a ligamentous ": null
    },
    {
        "epihyoid": "https://en.wiktionary.org/wiki/epihyoid"
    },
    {
        ", and that, based on a technical acoustic definition of roaring, the presence of this vocalization type depends on specific characteristics of the vocal folds and an elongated vocal tract, the latter rendered possible by an incompletely ossified hyoid. Cats may purr for a variety of reasons, including when they're hungry, happy, or anxious.": null
    },
    {
        "The most familiar vocalisation of adult cats is a \"meow\" or \"miaow\" sound (pronounced ). The meow can be assertive, plaintive, friendly, bold, welcoming, attention-soliciting, demanding, or complaining.  It can even be silent, where the cat opens its mouth but does not vocalize. Just like humans who talk a lot when they're happy, cats can too. According to ": null
    },
    {
        "The Purrington Post": "https://en.wikipedia.org/wiki/The_Purrington_Post"
    },
    {
        ", a chatty cat is likely happy too.": null
    },
    {
        "A mew is a high-pitched meow often produced by domestic kittens. It is apparently used to solicit attention from the kitten's mother, and adult cats may use it as well. The mew is similar to what is described in Brown et al. 1978 as an isolation call. By around three to four weeks of age kittens do not mew when at least one littermate is present, and at four to five months of age kittens stop mewing altogether. Adult cats rarely meow to each other, and so adult meowing to human beings is likely to be a post-domestication extension of mewing by kittens.": null
    },
    {
        "The chirr or chirrup sounds like a meow rolled on the tongue. It is commonly used by mother cats calling their kittens inside the nest. Kittens recognize their own mother's chirp, and do not respond to the chirps of other mothers. It is also used by friendly cats when eliciting the approach of another cat or a human.  Humans can mimic the sound to reassure and greet pet cats.": null
    },
    {
        "Cats sometimes make excited chirping or chattering noises when observing or stalking prey. These range from quiet clicking sounds to loud but sustained chirping mixed with the occasional meow.": null
    },
    {
        "Some researchers believe this chattering may also be an involuntary instinctual imitation of the moment a killing bite on the neck occurs. This action activates a vibration of the feline's jaws to allow the precision to slide between a prey's spine.": null
    },
    {
        "Chirping is also used by mothers to comfort and get the attention of the kittens in their litters. The kittens learn to identify their mothers' chirps fairly early in life. There was also mention of a call, that presumably was a chirp, in Brown et al. 1978 where a five-week-old kitten had wandered from the nest and when the mother chirped and the kitten immediately turned back in her direction.": null
    },
    {
        "The call is a loud, rhythmic vocalisation made with the mouth closed.  It is primarily associated with female cats soliciting males, and sometimes occurs in males when fighting with each other.  A caterwaul is the cry of a cat ": null
    },
    {
        "in heat": "https://en.wikipedia.org/wiki/Estrus"
    },
    {
        " (estrus).": null
    },
    {
        "The growl, snarl, and hiss are all vocalisations associated with either offensive or defensive aggression. They are usually accompanied by a postural display intended to have a visual effect on the perceived threat. The communication may be directed at cats as well as other species – the puffed-up hissing and spitting display of a cat toward an approaching dog is a well-known behavior. Cats hiss when they are startled, scared, angry, or in pain, and also to scare off intruders into their territory. If the hiss and growl warning does not remove the threat, an attack by the cat may follow. Kittens as young as two to three weeks will hiss and spit when first picked up by a human. \"Spitting\" is a shorter but louder and more emphatic version of hissing.": null
    },
    {
        "These sounds are commonly used during threatening situations. Howls are more tonal, while moans are long and slowly modulated. Anger wails are combined with growls, and yowls are similar to howls, but longer.": null
    },
    {
        "Very high frequency (\"ultrasonic\") response components have been observed in kitten vocalizations.": null
    },
    {
        "Cats use postures and movement to communicate a wide range of information. There are various responses such as when cats arch their backs, erect their hairs and adopt a sideward posture to communicate fear or aggression.  Others may be only a single behavioural change (as perceived by humans) such as slowly blinking to signal relaxation.": null
    },
    {
        "Domestic cats frequently use visual communication with their eyes, ears, mouths, tails, coats and body postures.  It has been stated that a cat's facial features change the most and are probably the best indicator of cat communication.": null
    },
    {
        "When cats lie on their back with their belly exposed, they are in a position of vulnerability.  Therefore, this position may communicate a feeling of trust or comfort; however, cats may also roll onto their back to defend themselves with their claws, or to bask in areas of bright sunlight.": null
    },
    {
        "When cats are calm, they tend to stand relaxed with a still tail.  If they become aggressive, the hind legs stiffen, the rump elevates but the back stays flat, tail hairs are erected, the nose is pushed forward and the ears are pulled back slightly.  Because cats have both claws and teeth, they can easily cause injury if they become involved in a fight, so this posture is an attempt to elicit deference by a competitor without fighting.  The aggressor may attempt to make challengers retreat and will pursue them if they do not flee.  A fearful, defensive cat makes itself smaller, lowers itself toward the ground, arches its back and leans its body away from the threat rather than forward.  Fighting usually occurs only when escape is impossible.": null
    },
    {
        "In cats, flattened ears generally indicate that an individual feels threatened and may attack.  Having the mouth open and no teeth exposed indicates playfulness.": null
    },
    {
        "Cats can change the position of their ears very quickly, in a continuum from erect when the cat is alert and focused, slightly relaxed when the cat is calm, and flattened against the head when extremely defensive or aggressive.": null
    },
    {
        "A direct stare by a cat usually communicates a challenge or threat and is more likely to be seen in high-ranking cats; lower-ranking cats usually withdraw in response. The direct stare is often used during predation or for territorial reasons.": null
    },
    {
        "In contrast to a direct stare, cats will lower their eyelids or slowly blink them to show trust and affection to their owners. According to Gary Weitzman, a licensed veterinarian and animal author, this type of feline body language is similar to a \"kitty kiss\". He further explains in his book, \"How To Speak Cat: A Guide to Decoding Cat Language,\" slow blinking could be a physiological response to lowered stress hormonal levels from being in a calm state.": null
    },
    {
        "\"The slow blink really is an acceptance gesture,\" Weitzman said. \"They do that when they're absolutely comfortable with you, and they do it with other cats as well.\" It's not clear why cats do this when they're feeling calm and comfortable, but Weitzman said, \"it's likely an autonomic response … having to do with the cat having its cortisol [stress hormone] levels down.\"": null
    },
    {
        "In fact, Weitzman encourages cat owners to mimic this behavior to return not only a message of affection, but one that reinforces a nonthreatening position. This behavior is not exclusive to domestic house cats. Since cats can be very territorial, in the wild they utilize this slow blinking with other cats to signal themselves as friendly or nonthreatening.": null
    },
    {
        "Cats often use their tails to communicate. A cat holding its tail vertically generally indicates positive emotions such as happiness or confidence; the vertical tail is often used as a friendly greeting toward human beings or other cats (usually close relatives).  A half-raised tail can indicate less pleasure, and unhappiness is indicated with a tail held low. In addition, a cat's tail may swing from side to side.  If this motion is slow and \"lazy\", it generally indicates that the cat is in a relaxed state.  Cats will twitch the tip of their tail when hunting or when otherwise alert or playful. Abrupt, full-tail twitching indicates a state of indecision. A stalking domestic cat will typically hold its tail low to the ground while in a crouch, and twitch it quickly from side to side.  This tail behavior is also seen when a cat has become \"irritated\" and is nearing the point of lashing out, typically by biting or swatting with claws extended.  A cat may also twitch its tail when playing.": null
    },
    {
        "Sometimes during play, a cat, or more commonly, a kitten, will raise the base of its tail high and stiffen all but the tip into a shape like an upside-down \"U\". This signals great excitement, to the point of hyperactivity. This may also be seen when younger cats chase each other, or when they run around by themselves. When greeting their owner, cats often hold their tails straight up with a quivering motion that indicates extreme happiness.  A scared or surprised cat may erect the hairs on its tail and back.  In addition, it may stand more upright and turn its body sideways to increase its apparent size as a threat. Tailless cats, such as the ": null
    },
    {
        "Manx": "https://en.wikipedia.org/wiki/Manx_(cat)"
    },
    {
        ", which possess only a small stub of a tail, move the stub around as if they have a full tail.": null
    },
    {
        "Cats often lick other cats as ": null
    },
    {
        "allogrooming": "https://en.wikipedia.org/wiki/Allogrooming"
    },
    {
        " or to bond (this grooming is usually done between familiar cats). They also sometimes lick humans, which may indicate affection.": null
    },
    {
        "Cats sometimes repeatedly tread their front paws on humans or soft objects with a ": null
    },
    {
        "kneading action": "https://en.wikipedia.org/wiki/Kneading_(cats)"
    },
    {
        ".  This is instinctive to cats and in adults, is presumably derived from the action used to stimulate milk let-down by the mother during nursing.  Cats often purr during this behaviour, usually taken to indicate contentment and affection.": null
    },
    {
        "Cats have scent glands on the underside of their paws.  When they knead or scratch objects or people, it is likely these ": null
    },
    {
        "pheromones": "https://en.wikipedia.org/wiki/Pheromones"
    },
    {
        " are transferred to the person or object being kneaded or scratched.": null
    },
    {
        "Touching noses, sometimes referred to as \"sniffing noses\", is a friendly, tactile greeting for cats.": null
    },
    {
        "Some cats rub their faces on humans, apparently as a friendly greeting or indicating affection. This tactile action is combined with olfactory communication as the contact leaves scent from glands located around the mouth and cheeks. Cats also sometimes \"head-bump\" humans or other cats with the front part of the head; this action is referred to as \"": null
    },
    {
        "bunting": "https://en.wikipedia.org/wiki/Bunting_(animal_behavior)"
    },
    {
        "\".  Again this communication might have an olfactory component as there are scent glands in this area of the body, and is possibly for seeking attention when the cat turns their head down or to the side while doing so.": null
    },
    {
        "Head-bumping and cheek rubbing may be displays of social dominance as they are often exhibited by a dominant cat towards a subordinate.": null
    },
    {
        "Gentle biting (often accompanied by purring and kneading) can communicate affection or playfulness, directed at the human owner or another cat; however, stronger bites that are often accompanied by hissing or growling usually communicate aggression. When cats mate, the tom bites the scruff of the female's neck as she assumes a ": null
    },
    {
        "lordosis": "https://en.wikipedia.org/wiki/Lordosis_behavior"
    },
    {
        " position which communicates that she is receptive to mating.": null
    },
    {
        "Cats communicate ": null
    },
    {
        "olfactarily": "https://en.wikipedia.org/wiki/Olfaction"
    },
    {
        " through scent in ": null
    },
    {
        "urine": "https://en.wikipedia.org/wiki/Urine"
    },
    {
        ", ": null
    },
    {
        "feces": "https://en.wikipedia.org/wiki/Feces"
    },
    {
        ", and chemicals or ": null
    },
    {
        "pheromones": "https://en.wikipedia.org/wiki/Cat_pheromone"
    },
    {
        " from glands located around the mouth, chin, forehead, cheeks, lower back, tail and paws.  Their rubbing and head-bumping behaviors are methods of depositing these scents on substrates, including humans.": null
    },
    {
        "Urine spraying": "https://en.wikipedia.org/wiki/Urine_spraying"
    },
    {
        " is also a ": null
    },
    {
        "territorial marking": "https://en.wikipedia.org/wiki/Territorial_marking"
    },
    {
        ".  Although cats may mark with both sprayed and non-sprayed urine, the spray is usually more thick and oily than normally deposited urine, and may contain additional secretions from anal sacs that help the sprayer to make a stronger communication.  While cats mark their territory both by rubbing of the scent glands and by urine and fecal deposits, spraying, most frequently engaged in by unneutered male cats in competition with others of their same sex and species, seems to be the loudest feline olfactory statement. Female cats also sometimes spray.": null
    },
    {
        "The urine of mature male cats in particular contains the ": null
    },
    {
        "amino acid": "https://en.wikipedia.org/wiki/Amino_acid"
    },
    {
        " known as ": null
    },
    {
        "felinine": "https://en.wikipedia.org/wiki/Felinine"
    },
    {
        " which is a precursor to ": null
    },
    {
        "3-mercapto-3-methylbutan-1-ol": "https://en.wikipedia.org/wiki/3-mercapto-3-methylbutan-1-ol"
    },
    {
        " (MMB), the sulfur-containing compound that gives cat urine its characteristically strong odor. Felinine is produced in the urine from 3-methylbutanol-cysteinylglycine (3-MBCG) by the excreted ": null
    },
    {
        "peptidase": "https://en.wikipedia.org/wiki/Peptidase"
    },
    {
        "cauxin": "https://en.wikipedia.org/wiki/Cauxin"
    },
    {
        ". It then slowly degrades via bacterial ": null
    },
    {
        "lyase": "https://en.wikipedia.org/wiki/Lyase"
    },
    {
        " into the more-volatile chemical MMB.   Felinine is a possible ": null
    },
    {
        "cat pheromone": "https://en.wikipedia.org/wiki/Cat_pheromone"
    },
    {
        ".": null
    }
]