[
    {
        "The pupil is a black hole located in the center of the ": null
    },
    {
        "iris": "https://en.wikipedia.org/wiki/Iris_(anatomy)"
    },
    {
        " of the ": null
    },
    {
        "eye": "https://en.wikipedia.org/wiki/Human_eye"
    },
    {
        " that allows light to strike the ": null
    },
    {
        "retina": "https://en.wikipedia.org/wiki/Retina"
    },
    {
        ". It appears black because light rays entering the pupil are either absorbed by the ": null
    },
    {
        "tissues": "https://en.wikipedia.org/wiki/Biological_tissue"
    },
    {
        " inside the eye directly, or absorbed after diffuse reflections within the eye that mostly miss exiting the narrow pupil. The term “pupil” was created by ": null
    },
    {
        "Gerard of Cremona": "https://en.wikipedia.org/wiki/Gerard_of_Cremona"
    },
    {
        ".": null
    },
    {
        "In humans, the pupil is round, but other species, such as some ": null
    },
    {
        "cats": "https://en.wikipedia.org/wiki/Cat_eyes"
    },
    {
        ", have vertical slit pupils, ": null
    },
    {
        "goats": "https://en.wikipedia.org/wiki/Goats#Anatomy_and_health"
    },
    {
        " have horizontally oriented pupils, and some ": null
    },
    {
        "catfish": "https://en.wikipedia.org/wiki/Catfish"
    },
    {
        " have annular types. In optical terms, the anatomical pupil is the eye's ": null
    },
    {
        "aperture": "https://en.wikipedia.org/wiki/Aperture"
    },
    {
        " and the iris is the ": null
    },
    {
        "aperture stop": "https://en.wikipedia.org/wiki/Aperture_stop"
    },
    {
        ". The image of the pupil as seen from outside the eye is the ": null
    },
    {
        "entrance pupil": "https://en.wikipedia.org/wiki/Entrance_pupil"
    },
    {
        ", which does not exactly correspond to the location and size of the physical pupil because it is magnified by the ": null
    },
    {
        "cornea": "https://en.wikipedia.org/wiki/Cornea"
    },
    {
        ".  On the inner edge lies a prominent structure, the collarette, marking the junction of the embryonic pupillary membrane covering the embryonic pupil.": null
    },
    {
        "The pupil is a hole located in the centre of the ": null
    },
    {
        "iris": "https://en.wikipedia.org/wiki/Iris_(anatomy)"
    },
    {
        " of the ": null
    },
    {
        "eye": "https://en.wikipedia.org/wiki/Human_eye"
    },
    {
        " that allows light to strike the ": null
    },
    {
        "retina": "https://en.wikipedia.org/wiki/Retina"
    },
    {
        ". It appears black because light rays entering the pupil are either absorbed by the ": null
    },
    {
        "tissues": "https://en.wikipedia.org/wiki/Biological_tissue"
    },
    {
        " inside the eye directly, or absorbed after diffuse reflections within the eye that mostly miss exiting the narrow pupil.": null
    },
    {
        "The ": null
    },
    {
        "iris": "https://en.wikipedia.org/wiki/Iris_(anatomy)"
    },
    {
        " is a contractile structure, consisting mainly of ": null
    },
    {
        "smooth muscle": "https://en.wikipedia.org/wiki/Smooth_muscle"
    },
    {
        ", surrounding the pupil. Light enters the eye through the pupil, and the iris regulates the amount of light by controlling the size of the pupil. This is known as the ": null
    },
    {
        "pupillary light reflex": "https://en.wikipedia.org/wiki/Pupillary_light_reflex"
    },
    {
        ".": null
    },
    {
        "The iris contains two groups of smooth muscles; a circular group called the ": null
    },
    {
        "sphincter pupillae": "https://en.wikipedia.org/wiki/Iris_sphincter_muscle"
    },
    {
        ", and a radial group called the dilator pupillae. When the sphincter pupillae contract, the iris decreases or constricts the size of the pupil. The dilator pupillae, innervated by sympathetic nerves from the superior cervical ganglion, cause the pupil to dilate when they contract. These muscles are sometimes referred to as intrinsic eye muscles.": null
    },
    {
        "The sensory pathway (rod or cone, bipolar, ganglion) is linked with its counterpart in the other eye by a partial crossover of each eye's fibers.  This causes the effect in one eye to carry over to the other.": null
    },
    {
        "The pupil gets wider in the dark and narrower in light.  When narrow, the diameter is 2 to 4 millimeters.  In the dark it will be the same at first, but will approach the maximum distance for a wide pupil 3 to 8 mm. In any human age group there is however considerable variation in maximal pupil size. For example, at the peak age of 15, the dark-adapted pupil can vary from 4 mm to 9 mm with different individuals. After 25 years of age the average pupil size decreases, though not at a steady rate.  At this stage the pupils do not remain completely still, therefore may lead to oscillation, which may intensify and become known as ": null
    },
    {
        "hippus": "https://en.wikipedia.org/wiki/Hippus"
    },
    {
        ".  The constriction of the pupil and near vision are closely tied.  In bright light, the pupils constrict to prevent aberrations of light rays and thus attain their expected acuity; in the dark this is not necessary, so it is chiefly concerned with admitting sufficient light into the eye.": null
    },
    {
        "When bright light is shone on the eye, light sensitive cells in the retina, including rod and cone photoreceptors and ": null
    },
    {
        "melanopsin": "https://en.wikipedia.org/wiki/Melanopsin"
    },
    {
        "ganglion cells": "https://en.wikipedia.org/wiki/Retinal_ganglion_cell"
    },
    {
        ", will send signals to the ": null
    },
    {
        "oculomotor nerve": "https://en.wikipedia.org/wiki/Oculomotor_nerve"
    },
    {
        ", specifically the ": null
    },
    {
        "parasympathetic": "https://en.wikipedia.org/wiki/Parasympathetic"
    },
    {
        " part coming from the ": null
    },
    {
        "Edinger-Westphal nucleus": "https://en.wikipedia.org/wiki/Edinger-Westphal_nucleus"
    },
    {
        ", which terminates on the circular iris sphincter muscle. When this muscle contracts, it reduces the size of the pupil.  This is the ": null
    },
    {
        "pupillary light reflex": "https://en.wikipedia.org/wiki/Pupillary_light_reflex"
    },
    {
        ", which is an important test of ": null
    },
    {
        "brainstem": "https://en.wikipedia.org/wiki/Brainstem"
    },
    {
        " function. Furthermore, the pupil will dilate if a person sees an object of interest.": null
    },
    {
        "If the drug pilocarpine is administered, the pupils will constrict and accommodation is increased due to the parasympathetic action on the circular muscle fibers, conversely, atropine will cause paralysis of accommodation (cycloplegia) and dilation of the pupil.": null
    },
    {
        "Certain drugs cause constriction of the pupils, such as ": null
    },
    {
        "opioids": "https://en.wikipedia.org/wiki/Opioids"
    },
    {
        ". Other drugs, such as ": null
    },
    {
        "atropine": "https://en.wikipedia.org/wiki/Atropine"
    },
    {
        ", ": null
    },
    {
        "LSD": "https://en.wikipedia.org/wiki/LSD"
    },
    {
        ", ": null
    },
    {
        "MDMA": "https://en.wikipedia.org/wiki/MDMA"
    },
    {
        ", ": null
    },
    {
        "mescaline": "https://en.wikipedia.org/wiki/Mescaline"
    },
    {
        ", ": null
    },
    {
        "psilocybin mushrooms": "https://en.wikipedia.org/wiki/Psilocybin_mushrooms"
    },
    {
        ", ": null
    },
    {
        "cocaine": "https://en.wikipedia.org/wiki/Cocaine"
    },
    {
        " and ": null
    },
    {
        "amphetamines": "https://en.wikipedia.org/wiki/Amphetamines"
    },
    {
        " may cause pupil dilation.": null
    },
    {
        "The sphincter muscle has a parasympathetic innervation, and the dilator has a sympathetic innervation.  In pupillary constriction induced by pilocarpine, not only is the sphincter nerve supply activated but that of the dilator is inhibited.  The reverse is true, so control of pupil size is controlled by differences in contraction intensity of each muscle.": null
    },
    {
        "Another term for the constriction of the pupil is ": null
    },
    {
        "miosis": "https://en.wikipedia.org/wiki/Miosis"
    },
    {
        ".  Substances that cause miosis are described as miotic.  Dilation of the pupil is ": null
    },
    {
        "mydriasis": "https://en.wikipedia.org/wiki/Mydriasis"
    },
    {
        ".  Dilation can be caused by mydriatic substances such as an eye drop solution containing ": null
    },
    {
        "tropicamide": "https://en.wikipedia.org/wiki/Tropicamide"
    },
    {
        ".": null
    },
    {
        "A condition called bene dilitatism occurs when the optic nerves are partially damaged.  This condition is typified by chronically widened pupils due to the decreased ability of the optic nerves to respond to light.  In normal lighting, people afflicted with this condition normally have dilated pupils, and bright lighting can cause pain.  At the other end of the spectrum, people with this condition have trouble seeing in darkness.  It is necessary for these people to be especially careful when driving at night due to their inability to see objects in their full perspective.  This condition is not otherwise dangerous.": null
    },
    {
        "The size of the pupil can be a ": null
    },
    {
        "symptom": "https://en.wikipedia.org/wiki/Symptom"
    },
    {
        " of an underlying disease. Dilation of the pupil is known as ": null
    },
    {
        "mydriasis": "https://en.wikipedia.org/wiki/Mydriasis"
    },
    {
        " and contraction as ": null
    },
    {
        "miosis": "https://en.wikipedia.org/wiki/Miosis"
    },
    {
        ".": null
    },
    {
        "Not all variations in size are indicative of disease however. In addition to dilation and contraction caused by light and darkness, it has been shown that solving simple multiplication problems affects the size of the pupil. The simple act of recollection can dilate the size of the pupil, however when the brain is required to process at a rate above its maximum capacity, the pupils contract. There is also evidence that pupil size is related to the extent of positive or negative emotional arousal experienced by a person.": null
    },
    {
        "Not all ": null
    },
    {
        "animals": "https://en.wikipedia.org/wiki/Animal"
    },
    {
        " have circular pupils. Some have slits or ovals which may be oriented vertically, as in ": null
    },
    {
        "crocodiles": "https://en.wikipedia.org/wiki/Crocodile"
    },
    {
        ", ": null
    },
    {
        "vipers": "https://en.wikipedia.org/wiki/Viperidae"
    },
    {
        ", ": null
    },
    {
        "cats": "https://en.wikipedia.org/wiki/Felidae"
    },
    {
        " and ": null
    },
    {
        "foxes": "https://en.wikipedia.org/wiki/Fox"
    },
    {
        ", or horizontally as in some ": null
    },
    {
        "rays": "https://en.wikipedia.org/wiki/Batoidea"
    },
    {
        ", ": null
    },
    {
        "flying frogs": "https://en.wikipedia.org/wiki/Flying_frog"
    },
    {
        ", ": null
    },
    {
        "mongooses": "https://en.wikipedia.org/wiki/Mongoose"
    },
    {
        " and ": null
    },
    {
        "artiodactyls": "https://en.wikipedia.org/wiki/Artiodactyl"
    },
    {
        " such as ": null
    },
    {
        "sheep": "https://en.wikipedia.org/wiki/Sheep"
    },
    {
        ", ": null
    },
    {
        "elk": "https://en.wikipedia.org/wiki/Elk"
    },
    {
        ", ": null
    },
    {
        "red deer": "https://en.wikipedia.org/wiki/Red_deer"
    },
    {
        ", ": null
    },
    {
        "reindeer": "https://en.wikipedia.org/wiki/Reindeer"
    },
    {
        " and ": null
    },
    {
        "hippopotamus": "https://en.wikipedia.org/wiki/Hippopotamus"
    },
    {
        ", as well as the domestic ": null
    },
    {
        "horse": "https://en.wikipedia.org/wiki/Horse"
    },
    {
        ". ": null
    },
    {
        "Goats": "https://en.wikipedia.org/wiki/Goat"
    },
    {
        ", ": null
    },
    {
        "toads": "https://en.wikipedia.org/wiki/Toad"
    },
    {
        " and ": null
    },
    {
        "octopus": "https://en.wikipedia.org/wiki/Octopus"
    },
    {
        " pupils tend to be horizontal and rectangular with rounded corners.  Some skates and rays have crescent shaped pupils,": null
    },
    {
        "gecko": "https://en.wikipedia.org/wiki/Gecko"
    },
    {
        " pupils range from circular, to a slit, to a series of pinholes, and the ": null
    },
    {
        "cuttlefish": "https://en.wikipedia.org/wiki/Cuttlefish"
    },
    {
        " pupil is a smoothly curving W shape. Although human pupils are normally circular, abnormalities like ": null
    },
    {
        "colobomas": "https://en.wikipedia.org/wiki/Coloboma"
    },
    {
        " can result in unusual pupil shapes, such as teardrop, keyhole or oval pupil shapes.": null
    },
    {
        "There may be differences in pupil shape even between closely related animals. In felids, there are differences between small- and large eyed species. The domestic ": null
    },
    {
        "cat": "https://en.wikipedia.org/wiki/Cat"
    },
    {
        "(Felis sylvestris domesticus) has vertical slit pupils, its large relative the ": null
    },
    {
        "Siberian tiger": "https://en.wikipedia.org/wiki/Siberian_tiger"
    },
    {
        "(Panthera tigris altaica) has circular pupils and the ": null
    },
    {
        "Eurasian lynx": "https://en.wikipedia.org/wiki/Eurasian_lynx"
    },
    {
        "(Lynx lynx) is intermediate between those of the domestic cat and the Siberian tiger. A similar difference between small and large species may be present in canines. The small European ": null
    },
    {
        "red fox": "https://en.wikipedia.org/wiki/Red_fox"
    },
    {
        "(Vulpes vulpes) has vertical slit pupils whereas their large relatives, the ": null
    },
    {
        "gray wolf": "https://en.wikipedia.org/wiki/Gray_wolf"
    },
    {
        "(Canis lupus lupus) and domestic ": null
    },
    {
        "dogs": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        "(Canis lupus familiaris) have round pupils.": null
    },
    {
        "One explanation for the ": null
    },
    {
        "evolution": "https://en.wikipedia.org/wiki/Evolution"
    },
    {
        " of slit pupils is that they can exclude light more effectively than a circular pupil. This would explain why slit pupils tend to be found in the eyes of animals with a ": null
    },
    {
        "crepuscular": "https://en.wikipedia.org/wiki/Crepuscular"
    },
    {
        " or ": null
    },
    {
        "nocturnal": "https://en.wikipedia.org/wiki/Nocturnal"
    },
    {
        " lifestyle that need to protect their eyes during daylight. Constriction of a circular pupil (by a ring-shaped muscle) is less complete than closure of a slit pupil, which uses two additional muscles that laterally compress the pupil. For example, the cat's slit pupil can change the light intensity on the retina 135-fold compared to 10-fold in humans.  However, this explanation does not account for circular pupils that can be closed to a very small size (e.g., 0.5 mm in the ": null
    },
    {
        "tarsier": "https://en.wikipedia.org/wiki/Tarsier"
    },
    {
        ") and the rectangular pupils of many ": null
    },
    {
        "ungulates": "https://en.wikipedia.org/wiki/Ungulate"
    },
    {
        " which do not close to a narrow slit in bright light.  An alternative explanation is that a partially constricted circular pupil shades the peripheral zones of the lens which would lead to poorly focused images at relevant wavelengths. The vertical slit pupil allows for use of all wavelengths across the full diameter of the lens, even in bright light.  It has also been suggested that in ambush predators such as some snakes, vertical slit pupils may aid in camouflage, breaking up the circular outline of the eye.": null
    },
    {
        "In a study of ": null
    },
    {
        "Australian": "https://en.wikipedia.org/wiki/Australia"
    },
    {
        "snakes": "https://en.wikipedia.org/wiki/Snake"
    },
    {
        ", pupil shapes correlated both with ": null
    },
    {
        "diel": "https://en.wikipedia.org/wiki/Diel"
    },
    {
        " activity times and with foraging behaviour. Most snake species with vertical pupils were ": null
    },
    {
        "nocturnal": "https://en.wikipedia.org/wiki/Nocturnal"
    },
    {
        " and also ambush foragers, and most snakes with circular pupils were ": null
    },
    {
        "diurnal": "https://en.wikipedia.org/wiki/Diurnality"
    },
    {
        " and active foragers. Overall, foraging behaviour predicted pupil shape accurately in more cases than did diel time of activity, because many active-foraging snakes with circular pupils were not diurnal.  It has been suggested that there may be a similar link between foraging behaviour and pupil shape amongst the felidae and canidae discussed above.": null
    },
    {
        "A 2015 study confirmed the hypothesis that elongated pupils have increased dynamic range, and furthered the correlations with diel activity. However it noted that other hypotheses could not explain the orientation of the pupils. They showed that vertical pupils enable ambush predators to optimise their depth perception, and horizontal pupils to optimise the field of view and image quality of horizontal contours. They further explained why elongated pupils are correlated with the animal's height.": null
    },
    {
        "In a surprising number of unrelated languages, the ": null
    },
    {
        "etymological meaning": "https://en.wikipedia.org/wiki/Etymology"
    },
    {
        " of the term for pupil is \"little person\". This is true, for example, of the word pupil itself: this comes into English from Latin pūpilla, which means \"doll, girl\", and is a diminutive form of pupa, \"girl\". (The double meaning in Latin is preserved in English, where pupil means both \"schoolchild\" and \"dark central portion of the eye within the iris\".) This may be because the reflection of one's image in the pupil is a minuscule version of one's self. In the Old Babylonian period (c. 1800-1600 BC) in ancient Mesopotamia, the expression \"protective spirit of the eye\" is attested, perhaps arising from the same phenomenon.": null
    },
    {
        "The English phrase ": null
    },
    {
        "apple of my eye": "https://en.wikipedia.org/wiki/Apple_of_my_eye"
    },
    {
        " arises from an ": null
    },
    {
        "Old English": "https://en.wikipedia.org/wiki/Old_English"
    },
    {
        " usage, in which the word apple meant not only the fruit but also the pupil or eyeball.": null
    }
]