[
    {
        "Infection is the invasion of an organism's body ": null
    },
    {
        "tissues": "https://en.wikipedia.org/wiki/Tissue_(biology)"
    },
    {
        " by ": null
    },
    {
        "disease": "https://en.wikipedia.org/wiki/Disease"
    },
    {
        "-causing agents, their multiplication, and the reaction of ": null
    },
    {
        "host": "https://en.wikipedia.org/wiki/Host_(biology)"
    },
    {
        " tissues to the infectious agents and the ": null
    },
    {
        "toxins": "https://en.wikipedia.org/wiki/Toxin"
    },
    {
        " they produce.Infectious disease, also known as ": null
    },
    {
        "transmissible disease": "https://en.wikipedia.org/wiki/Transmission_(medicine)"
    },
    {
        " or communicable disease, is ": null
    },
    {
        "illness": "https://en.wikipedia.org/wiki/Disease#Terminology"
    },
    {
        " resulting from an infection.": null
    },
    {
        "Infections are caused by infectious agents (": null
    },
    {
        "pathogens": "https://en.wikipedia.org/wiki/Pathogen"
    },
    {
        ") including:": null
    },
    {
        "Hosts can fight infections using their ": null
    },
    {
        "immune system": "https://en.wikipedia.org/wiki/Immune_system"
    },
    {
        ". ": null
    },
    {
        "Mammalian": "https://en.wikipedia.org/wiki/Mammal"
    },
    {
        " hosts react to infections with an ": null
    },
    {
        "innate": "https://en.wikipedia.org/wiki/Innate_immune_system"
    },
    {
        " response, often involving ": null
    },
    {
        "inflammation": "https://en.wikipedia.org/wiki/Inflammation"
    },
    {
        ", followed by an ": null
    },
    {
        "adaptive": "https://en.wikipedia.org/wiki/Adaptive_immune_system"
    },
    {
        " response.": null
    },
    {
        "Specific ": null
    },
    {
        "medications": "https://en.wikipedia.org/wiki/Pharmaceutical_drug"
    },
    {
        " used to treat infections include ": null
    },
    {
        "antibiotics": "https://en.wikipedia.org/wiki/Antibiotic"
    },
    {
        ", ": null
    },
    {
        "antivirals": "https://en.wikipedia.org/wiki/Antiviral_drug"
    },
    {
        ", ": null
    },
    {
        "antifungals": "https://en.wikipedia.org/wiki/Antifungal_medication"
    },
    {
        ", ": null
    },
    {
        "antiprotozoals": "https://en.wikipedia.org/wiki/Antiprotozoal_agent"
    },
    {
        ", and ": null
    },
    {
        "antihelminthics": "https://en.wikipedia.org/wiki/Antihelminthic"
    },
    {
        ". Infectious diseases resulted in 9.2 million deaths in 2013 (about 17% of all deaths). The branch of ": null
    },
    {
        "medicine": "https://en.wikipedia.org/wiki/Medicine"
    },
    {
        " that focuses on infections is referred to as ": null
    },
    {
        "infectious disease": "https://en.wikipedia.org/wiki/Infectious_disease_(medical_specialty)"
    },
    {
        ".": null
    },
    {
        "Symptomatic infections are apparent and clinical, whereas an infection that is active but does not produce noticeable symptoms may be called inapparent,silent,": null
    },
    {
        "subclinical": "https://en.wikipedia.org/wiki/Subclinical_infection"
    },
    {
        ", or ": null
    },
    {
        "occult": "https://en.wiktionary.org/wiki/occult#Adj1"
    },
    {
        ". An infection that is inactive or dormant is called a ": null
    },
    {
        "latent infection": "https://en.wikipedia.org/wiki/Latent_infection"
    },
    {
        ". An example of a latent bacterial infection is ": null
    },
    {
        "latent tuberculosis": "https://en.wikipedia.org/wiki/Latent_tuberculosis"
    },
    {
        ". Some viral infections can also be latent, examples of ": null
    },
    {
        "latent viral infections": "https://en.wikipedia.org/wiki/Viral_latency"
    },
    {
        " are any of those from the ": null
    },
    {
        "Herpesviridae": "https://en.wikipedia.org/wiki/Herpesviridae"
    },
    {
        " family.": null
    },
    {
        "The word infection can ": null
    },
    {
        "denote": "https://en.wikipedia.org/wiki/Denotation"
    },
    {
        " any presence of a particular pathogen at all (no matter how little) but also is often used in a ": null
    },
    {
        "sense": "https://en.wikipedia.org/wiki/Word_sense"
    },
    {
        " implying a clinically apparent infection (in other words, a case of infectious disease). This fact occasionally creates some ": null
    },
    {
        "ambiguity": "https://en.wikipedia.org/wiki/Ambiguity"
    },
    {
        " or prompts some ": null
    },
    {
        "usage": "https://en.wikipedia.org/wiki/Usage"
    },
    {
        " discussion. To get around the usage annoyance, it is common for ": null
    },
    {
        "health professionals": "https://en.wikipedia.org/wiki/Health_professional"
    },
    {
        " to speak of  (rather than infection) when they mean that some of the pathogens are present but that no clinically apparent infection (no disease) is present.": null
    },
    {
        "Different terms are used to describe infections. The first is an acute infection. An acute infection is one in which symptoms develop rapidly; its course can either be rapid or protracted. The next is a chronic infection. A chronic infection is when symptoms develop gradually, over weeks or months, and are slow to resolve. A subacute infection is one in which symptoms take longer to develop than in an acute infection but arise more quickly than a chronic infection. A latent infection is a type of infection that may occur after an acute episode; the organism is present but symptoms are not; after time the disease can reappear. A focal infection is defined as the initial site of infection from which organisms travel via the bloodstream to another area of the body.": null
    },
    {
        " Among the many varieties of ": null
    },
    {
        "microorganisms": "https://en.wikipedia.org/wiki/Microorganisms"
    },
    {
        ", relatively few cause disease in otherwise healthy individuals. Infectious disease results from the interplay between those few ": null
    },
    {
        "pathogens": "https://en.wikipedia.org/wiki/Pathogen"
    },
    {
        " and the defenses of the hosts they infect. The appearance and severity of disease resulting from any pathogen, depends upon the ability of that pathogen to damage the host as well as the ability of the host to resist the pathogen. However a host's immune system can also cause damage to the host itself in an attempt to control the infection. Clinicians therefore classify infectious microorganisms or microbes according to the status of host defenses - either as primary pathogens or as ": null
    },
    {
        "opportunistic pathogens": "https://en.wikipedia.org/wiki/Opportunistic_infection"
    },
    {
        ":": null
    },
    {
        "Other types of infection consist of mixed, latrogenic, nosocomial, and community-acquired infection. A mixed infection is an infection that is cause by two or more pathogens. An example of this is Appendicitis, which is caused by Bacteroides fragilis and Escherichia coli. The second is a latrogenic infection. This type of infection is one that is transmitted from a health care worker to a patient. A nosocomial infection is also one that occurs in a health care setting. Nosocomial infections are those that are acquired during a hospital stay. Lastly a community-acquired infection is one in which the infection is acquired from a whole community.": null
    },
    {
        "One way of proving that a given disease is \"infectious\", is to satisfy ": null
    },
    {
        "Koch's postulates": "https://en.wikipedia.org/wiki/Koch%27s_postulates"
    },
    {
        " (first proposed by ": null
    },
    {
        "Robert Koch": "https://en.wikipedia.org/wiki/Robert_Koch"
    },
    {
        "), which require that first, the ": null
    },
    {
        "infectious agent": "https://en.wikipedia.org/wiki/Infectious_agent"
    },
    {
        " be identifiable only in patients who have the disease, and not in healthy controls, and second, that patients who contract the infectious agent also develop the disease. These postulates were first used in the discovery that ": null
    },
    {
        "Mycobacteria": "https://en.wikipedia.org/wiki/Mycobacteria"
    },
    {
        " species cause ": null
    },
    {
        "tuberculosis": "https://en.wikipedia.org/wiki/Tuberculosis"
    },
    {
        ".": null
    },
    {
        "However, Koch's postulates cannot usually be tested in modern practice for ethical reasons. Proving them would require experimental infection of a healthy individual with a ": null
    },
    {
        "pathogen": "https://en.wikipedia.org/wiki/Pathogen"
    },
    {
        " produced as a pure culture. Conversely, even clearly infectious diseases do not always meet the infectious criteria; for example, ": null
    },
    {
        "Treponema pallidum": "https://en.wikipedia.org/wiki/Treponema_pallidum"
    },
    {
        ", the causative ": null
    },
    {
        "spirochete": "https://en.wikipedia.org/wiki/Spirochete"
    },
    {
        " of ": null
    },
    {
        "syphilis": "https://en.wikipedia.org/wiki/Syphilis"
    },
    {
        ", cannot be ": null
    },
    {
        "cultured": "https://en.wikipedia.org/wiki/Microbiological_culture"
    },
    {
        "in vitro – however the organism can be cultured in rabbit ": null
    },
    {
        "testes": "https://en.wikipedia.org/wiki/Testes"
    },
    {
        ". It is less clear that a pure culture comes from an animal source serving as host than it is when derived from microbes derived from plate culture.": null
    },
    {
        "Epidemiology": "https://en.wikipedia.org/wiki/Epidemiology"
    },
    {
        ", or the study and analysis of in who, why and where disease occurs, and what determines whether various populations have a disease, is another important tool used to understand infectious disease. Epidemiologists may determine differences among groups within a population, such as whether certain age groups have a greater or lesser rate of infection; whether groups living in different neighborhoods are more likely to be infected; and by other factors, such as gender and race. Researchers also may assess whether a disease ": null
    },
    {
        "outbreak": "https://en.wikipedia.org/wiki/Outbreak"
    },
    {
        " is sporadic, or just an occasional occurrence; ": null
    },
    {
        "endemic": "https://en.wikipedia.org/wiki/Endemic_(epidemiology)"
    },
    {
        ", with a steady level of regular cases occurring in a region; ": null
    },
    {
        "epidemic": "https://en.wikipedia.org/wiki/Epidemic"
    },
    {
        ", with a fast arising, and unusually high number of cases in a region; or ": null
    },
    {
        "pandemic": "https://en.wikipedia.org/wiki/Pandemic"
    },
    {
        ", which is a global epidemic. If the cause of the infectious disease is unknown, epidemiology can be used to assist with tracking down the sources of infection.": null
    },
    {
        "Infectious diseases are sometimes called ": null
    },
    {
        "contagious disease": "https://en.wikipedia.org/wiki/Contagious_disease"
    },
    {
        " when they are easily transmitted by contact with an ill person or their secretions (e.g., ": null
    },
    {
        "influenza": "https://en.wikipedia.org/wiki/Influenza"
    },
    {
        "). Thus, a contagious disease is a subset of infectious disease that is especially infective or easily transmitted. Other types of infectious, transmissible, or communicable diseases with more specialized routes of infection, such as vector transmission or sexual transmission, are usually not regarded as \"contagious\", and often do not require medical isolation (sometimes loosely called ": null
    },
    {
        "quarantine": "https://en.wikipedia.org/wiki/Quarantine"
    },
    {
        ") of victims. However, this specialized connotation of the word \"contagious\" and \"contagious disease\" (easy transmissibility) is not always respected in popular use.Infectious diseases are commonly transmitted from person to person through direct contact. The types of contact are through person to person and droplet spread. Indirect contact such as airborne transmission, contaminated objects, food and drinking water, animal person contact, animal reservoirs, insect bites, and environmental reservoirs  are another way infectious diseases are transmitted,": null
    },
    {
        "Infections can be classified by the anatomic location or ": null
    },
    {
        "organ system": "https://en.wikipedia.org/wiki/Organ_system"
    },
    {
        " infected, including:": null
    },
    {
        "In addition, locations of ": null
    },
    {
        "inflammation": "https://en.wikipedia.org/wiki/Inflammation"
    },
    {
        " where infection is the most common cause include ": null
    },
    {
        "pneumonia": "https://en.wikipedia.org/wiki/Pneumonia"
    },
    {
        ", ": null
    },
    {
        "meningitis": "https://en.wikipedia.org/wiki/Meningitis"
    },
    {
        " and ": null
    },
    {
        "salpingitis": "https://en.wikipedia.org/wiki/Salpingitis"
    },
    {
        ".": null
    },
    {
        "The symptoms of an infection depends on the type of disease. Some signs of infection affect the whole body generally, such as ": null
    },
    {
        "fatigue": "https://en.wikipedia.org/wiki/Fatigue"
    },
    {
        ", loss of appetite, weight loss, ": null
    },
    {
        "fevers": "https://en.wikipedia.org/wiki/Fever"
    },
    {
        ", night sweats, chills, aches and pains. Others are specific to individual body parts, such as skin ": null
    },
    {
        "rashes": "https://en.wikipedia.org/wiki/Rash"
    },
    {
        ", ": null
    },
    {
        "coughing": "https://en.wikipedia.org/wiki/Cough"
    },
    {
        ", or a ": null
    },
    {
        "runny nose": "https://en.wikipedia.org/wiki/Rhinorrhea"
    },
    {
        ".": null
    },
    {
        "In certain cases, infectious diseases may be ": null
    },
    {
        "asymptomatic": "https://en.wikipedia.org/wiki/Asymptomatic"
    },
    {
        " for much or even all of their course in a given host. In the latter case, the disease may only be defined as a \"disease\" (which by definition means an illness) in hosts who secondarily become ill after contact with an asymptomatic carrier. An infection is not synonymous with an infectious disease, as some infections do not cause illness in a host.": null
    },
    {
        "Bacterial and viral infections can both cause the same kinds of symptoms. It can be difficult to distinguish which is the cause of a specific infection. It's important to distinguish, because viral infections cannot be cured by ": null
    },
    {
        "antibiotics": "https://en.wikipedia.org/wiki/Antibiotic"
    },
    {
        ".": null
    },
    {
        "There is a general chain of events that applies to infections. The chain of events involves several steps—which include the infectious agent, reservoir, entering a susceptible host, exit and transmission to new hosts. Each of the links must be present in a chronological order for an infection to develop. Understanding these steps helps health care workers target the infection and prevent it from occurring in the first place.": null
    },
    {
        "Infection begins when an organism successfully enters the body, grows and multiplies. This is referred to as colonization. Most humans are not easily infected. Those who are weak, sick, malnourished, have cancer or are diabetic have increased susceptibility to chronic or persistent infections. Individuals who have a suppressed ": null
    },
    {
        "immune system": "https://en.wikipedia.org/wiki/Immune_system"
    },
    {
        " are particularly susceptible to ": null
    },
    {
        "opportunistic infections": "https://en.wikipedia.org/wiki/Opportunistic_infection"
    },
    {
        ". Entrance to the host at ": null
    },
    {
        "host-pathogen interface": "https://en.wikipedia.org/wiki/Host-pathogen_interface"
    },
    {
        ", generally occurs through the ": null
    },
    {
        "mucosa": "https://en.wikipedia.org/wiki/Mucous_membrane"
    },
    {
        " in orifices like the ": null
    },
    {
        "oral cavity": "https://en.wikipedia.org/wiki/Oral_cavity"
    },
    {
        ", nose, eyes, genitalia, anus, or the microbe can enter through open wounds. While a few organisms can grow at the initial site of entry, many migrate and cause systemic infection in different organs. Some pathogens grow within the host cells (intracellular) whereas others grow freely in bodily fluids.": null
    },
    {
        "Wound": "https://en.wikipedia.org/wiki/Wound"
    },
    {
        " colonization refers to nonreplicating microorganisms within the wound, while in infected wounds, replicating organisms exist and tissue is injured. All ": null
    },
    {
        "multicellular organisms": "https://en.wikipedia.org/wiki/Multicellular_organism"
    },
    {
        " are colonized to some degree by extrinsic organisms, and the vast majority of these exist in either a ": null
    },
    {
        "mutualistic": "https://en.wikipedia.org/wiki/Mutualism_(biology)"
    },
    {
        " or ": null
    },
    {
        "commensal": "https://en.wikipedia.org/wiki/Commensal"
    },
    {
        " relationship with the host. An example of the former is the ": null
    },
    {
        "anaerobic bacteria": "https://en.wikipedia.org/wiki/Anaerobic_organism"
    },
    {
        " species, which colonizes the ": null
    },
    {
        "mammalian": "https://en.wikipedia.org/wiki/Mammal"
    },
    {
        "colon": "https://en.wikipedia.org/wiki/Colon_(anatomy)"
    },
    {
        ", and an example of the latter are the various species of ": null
    },
    {
        "staphylococcus": "https://en.wikipedia.org/wiki/Staphylococcus"
    },
    {
        " that exist on ": null
    },
    {
        "human skin": "https://en.wikipedia.org/wiki/Human_skin"
    },
    {
        ". Neither of these colonizations are considered infections. The difference between an infection and a colonization is often only a matter of circumstance. Non-pathogenic organisms can become pathogenic given specific conditions, and even the most ": null
    },
    {
        "virulent": "https://en.wikipedia.org/wiki/Virulent"
    },
    {
        " organism requires certain circumstances to cause a compromising infection. Some colonizing bacteria, such as ": null
    },
    {
        "Corynebacteria": "https://en.wikipedia.org/wiki/Corynebacteria"
    },
    {
        " sp. and ": null
    },
    {
        "viridans streptococci": "https://en.wikipedia.org/wiki/Viridans_streptococci"
    },
    {
        ", prevent the adhesion and colonization of pathogenic bacteria and thus have a symbiotic relationship with the host, preventing infection and speeding ": null
    },
    {
        "wound healing": "https://en.wikipedia.org/wiki/Wound_healing"
    },
    {
        ".": null
    },
    {
        "The variables involved in the outcome of a host becoming inoculated by a pathogen and the ultimate outcome include:": null
    },
    {
        "As an example, several ": null
    },
    {
        "staphylococcal": "https://en.wikipedia.org/wiki/Staphylococcus"
    },
    {
        " species remain harmless on the skin, but, when present in a normally ": null
    },
    {
        "sterile": "https://en.wikipedia.org/wiki/Sterile_technique"
    },
    {
        " space, such as in the capsule of a ": null
    },
    {
        "joint": "https://en.wikipedia.org/wiki/Joint"
    },
    {
        " or the ": null
    },
    {
        "peritoneum": "https://en.wikipedia.org/wiki/Peritoneum"
    },
    {
        ", multiply without resistance and cause harm.": null
    },
    {
        "An interesting fact that ": null
    },
    {
        "gas chromatography–mass spectrometry": "https://en.wikipedia.org/wiki/Gas_chromatography%E2%80%93mass_spectrometry"
    },
    {
        ", ": null
    },
    {
        "16S ribosomal RNA": "https://en.wikipedia.org/wiki/16S_ribosomal_RNA"
    },
    {
        " analysis, ": null
    },
    {
        "omics": "https://en.wikipedia.org/wiki/Omics"
    },
    {
        ", and other advanced technologies have made more apparent to humans in recent decades is that microbial colonization is very common even in environments that humans think of as being nearly ": null
    },
    {
        "sterile": "https://en.wikipedia.org/wiki/Asepsis"
    },
    {
        ". Because it is normal to have bacterial colonization, it is difficult to know which chronic wounds can be classified as infected and how much risk of progression exists. Despite the huge number of wounds seen in clinical practice, there are limited quality data for evaluated symptoms and signs. A review of chronic wounds in the Journal of the American Medical Association's \"Rational Clinical Examination Series\" quantified the importance of increased pain as an indicator of infection. The review showed that the most useful finding is an increase in the level of pain [likelihood ratio (LR) range, 11–20] makes infection much more likely, but the absence of pain (negative likelihood ratio range, 0.64–0.88) does not rule out infection (summary LR 0.64–0.88).": null
    },
    {
        "Disease": "https://en.wikipedia.org/wiki/Disease"
    },
    {
        " can arise if the host's protective immune mechanisms are compromised and the organism inflicts damage on the host. ": null
    },
    {
        "Microorganisms": "https://en.wikipedia.org/wiki/Microorganism"
    },
    {
        " can cause tissue damage by releasing a variety of toxins or destructive enzymes. For example, ": null
    },
    {
        "Clostridium tetani": "https://en.wikipedia.org/wiki/Clostridium_tetani"
    },
    {
        " releases a toxin that paralyzes muscles, and ": null
    },
    {
        "staphylococcus": "https://en.wikipedia.org/wiki/Staphylococcus"
    },
    {
        " releases toxins that produce shock and sepsis. Not all infectious agents cause disease in all hosts. For example, less than 5% of individuals infected with ": null
    },
    {
        "polio": "https://en.wikipedia.org/wiki/Polio"
    },
    {
        " develop disease. On the other hand, some infectious agents are highly virulent. The ": null
    },
    {
        "prion": "https://en.wikipedia.org/wiki/Prion"
    },
    {
        " causing ": null
    },
    {
        "mad cow disease": "https://en.wikipedia.org/wiki/Bovine_spongiform_encephalopathy"
    },
    {
        " and ": null
    },
    {
        "Creutzfeldt–Jakob disease": "https://en.wikipedia.org/wiki/Creutzfeldt%E2%80%93Jakob_disease"
    },
    {
        " invariably kills all animals and people that are infected.": null
    },
    {
        "Persistent infections occur because the body is unable to clear the organism after the initial infection. Persistent infections are characterized by the continual presence of the infectious organism, often as latent infection with occasional recurrent relapses of active infection. There are some viruses that can maintain a persistent infection by infecting different cells of the body. Some viruses once acquired never leave the body. A typical example is the herpes virus, which tends to hide in nerves and become reactivated when specific circumstances arise.": null
    },
    {
        "Persistent infections cause millions of deaths globally each year. Chronic infections by parasites account for a high morbidity and mortality in many underdeveloped countries.": null
    },
    {
        "For infecting organisms to survive and repeat the infection cycle in other hosts, they (or their progeny) must leave an existing reservoir and cause infection elsewhere. Infection transmission can take place via many potential routes:": null
    },
    {
        "The relationship between ": null
    },
    {
        "virulence versus transmissibility": "https://en.wikipedia.org/wiki/Optimal_virulence"
    },
    {
        " is complex; if a disease is rapidly fatal, the host may die before the microbe can be passed along to another host.": null
    },
    {
        "Diagnosis of infectious disease sometimes involves identifying an infectious agent either directly or indirectly. In practice most minor infectious diseases such as ": null
    },
    {
        "warts": "https://en.wikipedia.org/wiki/Wart"
    },
    {
        ", ": null
    },
    {
        "cutaneous": "https://en.wikipedia.org/wiki/Cutaneous"
    },
    {
        "abscesses": "https://en.wikipedia.org/wiki/Abscesses"
    },
    {
        ", ": null
    },
    {
        "respiratory system": "https://en.wikipedia.org/wiki/Respiratory_system"
    },
    {
        " infections and ": null
    },
    {
        "diarrheal diseases": "https://en.wikipedia.org/wiki/Diarrheal_diseases"
    },
    {
        " are diagnosed by their clinical presentation and treated without knowledge of the specific causative agent. Conclusions about the cause of the disease are based upon the likelihood that a patient came in contact with a particular agent, the presence of a microbe in a community, and other epidemiological considerations. Given sufficient effort, all known infectious agents can be specifically identified. The benefits of identification, however, are often greatly outweighed by the cost, as often there is no specific treatment, the cause is obvious, or the outcome of an infection is ": null
    },
    {
        "benign": "https://en.wikipedia.org/wiki/Benign"
    },
    {
        ".": null
    },
    {
        "Diagnosis of infectious disease is nearly always initiated by ": null
    },
    {
        "medical history": "https://en.wikipedia.org/wiki/Medical_history"
    },
    {
        " and physical examination. More detailed identification techniques involve the culture of infectious agents isolated from a patient. Culture allows identification of infectious organisms by examining their microscopic features, by detecting the presence of substances produced by pathogens, and by directly identifying an organism by its genotype. Other techniques (such as ": null
    },
    {
        "X-rays": "https://en.wikipedia.org/wiki/X-ray"
    },
    {
        ", ": null
    },
    {
        "CAT scans": "https://en.wikipedia.org/wiki/CAT_scans"
    },
    {
        ", ": null
    },
    {
        "PET scans": "https://en.wikipedia.org/wiki/PET_scan"
    },
    {
        " or ": null
    },
    {
        "NMR": "https://en.wikipedia.org/wiki/NMR"
    },
    {
        ") are used to produce images of internal abnormalities resulting from the growth of an infectious agent. The images are useful in detection of, for example, a bone ": null
    },
    {
        "abscess": "https://en.wikipedia.org/wiki/Abscess"
    },
    {
        " or a ": null
    },
    {
        "spongiform encephalopathy": "https://en.wikipedia.org/wiki/Spongiform_encephalopathy"
    },
    {
        " produced by a ": null
    },
    {
        "prion": "https://en.wikipedia.org/wiki/Prion"
    },
    {
        ".": null
    },
    {
        "The diagnosis is aided by the presenting symptoms in any individual with an infectious disease, yet it usually needs additional diagnostic techniques to confirm the suspicion. Some signs are specifically characteristic and indicative of a disease and are called ": null
    },
    {
        "pathognomonic": "https://en.wikipedia.org/wiki/Pathognomonic"
    },
    {
        " signs; but these are rare. Not all infections are symptomatic.": null
    },
    {
        "In children the presence of ": null
    },
    {
        "cyanosis": "https://en.wikipedia.org/wiki/Cyanosis"
    },
    {
        ", rapid breathing, poor peripheral perfusion, or a ": null
    },
    {
        "petechial rash": "https://en.wikipedia.org/wiki/Petechial_rash"
    },
    {
        " increases the risk of a serious infection by greater than 5 fold. Other important indicators include parental concern, clinical instinct, and temperature greater than 40 °C.": null
    },
    {
        "Microbiological culture": "https://en.wikipedia.org/wiki/Microbiological_culture"
    },
    {
        " is a principal tool used to diagnose infectious disease. In a microbial culture, a ": null
    },
    {
        "growth medium": "https://en.wikipedia.org/wiki/Growth_medium"
    },
    {
        " is provided for a specific agent. A sample taken from potentially diseased tissue or fluid is then tested for the presence of an infectious agent able to grow within that medium. Most pathogenic bacteria are easily grown on nutrient ": null
    },
    {
        "agar": "https://en.wikipedia.org/wiki/Agar#Microbiology"
    },
    {
        ", a form of solid medium that supplies carbohydrates and proteins necessary for growth of a ": null
    },
    {
        "bacterium": "https://en.wikipedia.org/wiki/Bacterium"
    },
    {
        ", along with copious amounts of water. A single bacterium will grow into a visible mound on the surface of the plate called a ": null
    },
    {
        "colony": "https://en.wikipedia.org/wiki/Colony_(biology)"
    },
    {
        ", which may be separated from other colonies or melded together into a \"lawn\". The size, color, shape and form of a colony is characteristic of the bacterial species, its specific genetic makeup (its ": null
    },
    {
        "strain": "https://en.wikipedia.org/wiki/Strain_(biology)"
    },
    {
        "), and the environment that supports its growth. Other ingredients are often added to the plate to aid in identification. Plates may contain substances that permit the growth of some bacteria and not others, or that change color in response to certain bacteria and not others. Bacteriological plates such as these are commonly used in the clinical identification of infectious bacterium. Microbial culture may also be used in the identification of ": null
    },
    {
        "viruses": "https://en.wikipedia.org/wiki/Virus"
    },
    {
        ": the medium in this case being cells grown in culture that the virus can infect, and then alter or kill. In the case of viral identification, a region of dead cells results from viral growth, and is called a \"plaque\". ": null
    },
    {
        "Eukaryotic": "https://en.wikipedia.org/wiki/Eukaryotic"
    },
    {
        "parasites": "https://en.wikipedia.org/wiki/Parasites"
    },
    {
        " may also be grown in culture as a means of identifying a particular agent.": null
    },
    {
        "In the absence of suitable plate culture techniques, some microbes require culture within live animals. Bacteria such as ": null
    },
    {
        "Mycobacterium leprae": "https://en.wikipedia.org/wiki/Mycobacterium_leprae"
    },
    {
        " and ": null
    },
    {
        "Treponema pallidum": "https://en.wikipedia.org/wiki/Treponema_pallidum"
    },
    {
        " can be grown in animals, although serological and microscopic techniques make the use of live animals unnecessary. Viruses are also usually identified using alternatives to growth in culture or animals. Some viruses may be grown in ": null
    },
    {
        "embryonated": "https://en.wikipedia.org/wiki/Embryo"
    },
    {
        " eggs. Another useful identification method is Xenodiagnosis, or the use of a vector to support the growth of an infectious agent. ": null
    },
    {
        "Chagas disease": "https://en.wikipedia.org/wiki/Chagas_disease"
    },
    {
        " is the most significant example, because it is difficult to directly demonstrate the presence of the causative agent, ": null
    },
    {
        "Trypanosoma cruzi": "https://en.wikipedia.org/wiki/Trypanosoma_cruzi"
    },
    {
        " in a patient, which therefore makes it difficult to definitively make a diagnosis. In this case, xenodiagnosis involves the use of the ": null
    },
    {
        "vector": "https://en.wikipedia.org/wiki/Vector_(epidemiology)"
    },
    {
        " of the Chagas agent T. cruzi, an uninfected ": null
    },
    {
        "triatomine": "https://en.wikipedia.org/wiki/Triatominae"
    },
    {
        " bug, which takes a blood meal from a person suspected of having been infected. The bug is later inspected for growth of T. cruzi within its gut.": null
    },
    {
        "Another principal tool in the diagnosis of infectious disease is ": null
    },
    {
        "microscopy": "https://en.wikipedia.org/wiki/Microscopy"
    },
    {
        ". Virtually all of the culture techniques discussed above rely, at some point, on microscopic examination for definitive identification of the infectious agent. Microscopy may be carried out with simple instruments, such as the compound ": null
    },
    {
        "light microscope": "https://en.wikipedia.org/wiki/Light_microscope"
    },
    {
        ", or with instruments as complex as an ": null
    },
    {
        "electron microscope": "https://en.wikipedia.org/wiki/Electron_microscope"
    },
    {
        ". Samples obtained from patients may be viewed directly under the light microscope, and can often rapidly lead to identification. Microscopy is often also used in conjunction with ": null
    },
    {
        "biochemical": "https://en.wikipedia.org/wiki/Biochemical"
    },
    {
        "staining": "https://en.wikipedia.org/wiki/Staining"
    },
    {
        " techniques, and can be made exquisitely specific when used in combination with ": null
    },
    {
        "antibody": "https://en.wikipedia.org/wiki/Antibody"
    },
    {
        " based techniques. For example, the use of ": null
    },
    {
        "antibodies": "https://en.wikipedia.org/wiki/Antibody"
    },
    {
        " made artificially ": null
    },
    {
        "fluorescent": "https://en.wikipedia.org/wiki/Fluorescent"
    },
    {
        " (fluorescently labeled antibodies) can be directed to bind to and identify a specific ": null
    },
    {
        "antigens": "https://en.wikipedia.org/wiki/Antigen"
    },
    {
        " present on a pathogen. A ": null
    },
    {
        "fluorescence microscope": "https://en.wikipedia.org/wiki/Fluorescence_microscope"
    },
    {
        " is then used to detect fluorescently labeled antibodies bound to internalized antigens within clinical samples or cultured cells. This technique is especially useful in the diagnosis of viral diseases, where the light microscope is incapable of identifying a virus directly.": null
    },
    {
        "Other microscopic procedures may also aid in identifying infectious agents. Almost all cells readily stain with a number of basic ": null
    },
    {
        "dyes": "https://en.wikipedia.org/wiki/Dye"
    },
    {
        " due to the ": null
    },
    {
        "electrostatic": "https://en.wikipedia.org/wiki/Electrostatic"
    },
    {
        " attraction between negatively charged cellular molecules and the positive charge on the dye. A cell is normally transparent under a microscope, and using a stain increases the contrast of a cell with its background. Staining a cell with a dye such as ": null
    },
    {
        "Giemsa": "https://en.wikipedia.org/wiki/Giemsa"
    },
    {
        " stain or ": null
    },
    {
        "crystal violet": "https://en.wikipedia.org/wiki/Crystal_violet"
    },
    {
        " allows a microscopist to describe its size, shape, internal and external components and its associations with other cells. The response of bacteria to different staining procedures is used in the ": null
    },
    {
        "taxonomic classification": "https://en.wikipedia.org/wiki/Taxonomic_classification"
    },
    {
        " of microbes as well. Two methods, the ": null
    },
    {
        "Gram stain": "https://en.wikipedia.org/wiki/Gram_stain"
    },
    {
        " and the ": null
    },
    {
        "acid-fast": "https://en.wikipedia.org/wiki/Acid-fast"
    },
    {
        " stain, are the standard approaches used to classify bacteria and to diagnosis of disease. The Gram stain identifies the bacterial groups ": null
    },
    {
        "Firmicutes": "https://en.wikipedia.org/wiki/Firmicutes"
    },
    {
        " and ": null
    },
    {
        "Actinobacteria": "https://en.wikipedia.org/wiki/Actinobacteria"
    },
    {
        ", both of which contain many significant human pathogens. The acid-fast staining procedure identifies the Actinobacterial genera ": null
    },
    {
        "Mycobacterium": "https://en.wikipedia.org/wiki/Mycobacterium"
    },
    {
        " and ": null
    },
    {
        "Nocardia": "https://en.wikipedia.org/wiki/Nocardia"
    },
    {
        ".": null
    },
    {
        "Biochemical tests used in the identification of infectious agents include the detection of ": null
    },
    {
        "metabolic": "https://en.wikipedia.org/wiki/Metabolic"
    },
    {
        " or ": null
    },
    {
        "enzymatic": "https://en.wikipedia.org/wiki/Enzymatic"
    },
    {
        " products characteristic of a particular infectious agent. Since bacteria ferment ": null
    },
    {
        "carbohydrates": "https://en.wikipedia.org/wiki/Carbohydrate"
    },
    {
        " in patterns characteristic of their ": null
    },
    {
        "genus": "https://en.wikipedia.org/wiki/Genus"
    },
    {
        " and ": null
    },
    {
        "species": "https://en.wikipedia.org/wiki/Species"
    },
    {
        ", the detection of ": null
    },
    {
        "fermentation": "https://en.wikipedia.org/wiki/Fermentation_(biochemistry)"
    },
    {
        " products is commonly used in bacterial identification. ": null
    },
    {
        "Acids": "https://en.wikipedia.org/wiki/Acids"
    },
    {
        ", ": null
    },
    {
        "alcohols": "https://en.wikipedia.org/wiki/Alcohols"
    },
    {
        " and ": null
    },
    {
        "gases": "https://en.wikipedia.org/wiki/Gases"
    },
    {
        " are usually detected in these tests when bacteria are grown in ": null
    },
    {
        "selective": "https://en.wikipedia.org/wiki/Growth_medium#Selective_media"
    },
    {
        " liquid or solid media.": null
    },
    {
        "The isolation of ": null
    },
    {
        "enzymes": "https://en.wikipedia.org/wiki/Enzymes"
    },
    {
        " from infected tissue can also provide the basis of a biochemical diagnosis of an infectious disease. For example, humans can make neither ": null
    },
    {
        "RNA replicases": "https://en.wikipedia.org/wiki/RNA_replicase"
    },
    {
        " nor ": null
    },
    {
        "reverse transcriptase": "https://en.wikipedia.org/wiki/Reverse_transcriptase"
    },
    {
        ", and the presence of these enzymes are characteristic., of specific types of viral infections. The ability of the viral protein ": null
    },
    {
        "hemagglutinin": "https://en.wikipedia.org/wiki/Hemagglutinin"
    },
    {
        " to bind ": null
    },
    {
        "red blood cells": "https://en.wikipedia.org/wiki/Red_blood_cells"
    },
    {
        " together into a detectable matrix may also be characterized as a biochemical test for viral infection, although strictly speaking hemagglutinin is not an enzyme and has no metabolic function.": null
    },
    {
        "Serological": "https://en.wikipedia.org/wiki/Serological"
    },
    {
        " methods are highly sensitive, specific and often extremely rapid tests used to identify microorganisms. These tests are based upon the ability of an antibody to bind specifically to an antigen. The antigen, usually a protein or carbohydrate made by an infectious agent, is bound by the antibody. This binding then sets off a chain of events that can be visibly obvious in various ways, dependent upon the test. For example, \"": null
    },
    {
        "Strep throat": "https://en.wikipedia.org/wiki/Strep_throat"
    },
    {
        "\" is often diagnosed within minutes, and is based on the appearance of antigens made by the causative agent, ": null
    },
    {
        "S. pyogenes": "https://en.wikipedia.org/wiki/S._pyogenes"
    },
    {
        ", that is retrieved from a patient's throat with a cotton swab. Serological tests, if available, are usually the preferred route of identification, however the tests are costly to develop and the reagents used in the test often require ": null
    },
    {
        "refrigeration": "https://en.wikipedia.org/wiki/Refrigeration"
    },
    {
        ". Some serological methods are extremely costly, although when commonly used, such as with the \"strep test\", they can be inexpensive.": null
    },
    {
        "Complex serological techniques have been developed into what are known as ": null
    },
    {
        "Immunoassays": "https://en.wikipedia.org/wiki/Immunoassays"
    },
    {
        ". Immunoassays can use the basic antibody – antigen binding as the basis to produce an electro-magnetic or particle radiation signal, which can be detected by some form of instrumentation. Signal of unknowns can be compared to that of standards allowing quantitation of the target antigen. To aid in the diagnosis of infectious diseases, immunoassays can detect or measure antigens from either infectious agents or proteins generated by an infected organism in response to a foreign agent. For example, immunoassay A may detect the presence of a surface protein from a virus particle. Immunoassay B on the other hand may detect or measure antibodies produced by an organism's immune system that are made to neutralize and allow the destruction of the virus.": null
    },
    {
        "Instrumentation can be used to read extremely small signals created by secondary reactions linked to the antibody – antigen binding. Instrumentation can control sampling, reagent use, reaction times, signal detection, calculation of results, and data management to yield a cost effective automated process for diagnosis of infectious disease.": null
    },
    {
        "Technologies based upon the ": null
    },
    {
        "polymerase chain reaction": "https://en.wikipedia.org/wiki/Polymerase_chain_reaction"
    },
    {
        " (PCR) method will become nearly ubiquitous gold standards of diagnostics of the near future, for several reasons. First, the catalog of infectious agents has grown to the point that virtually all of the significant infectious agents of the human population have been identified. Second, an infectious agent must grow within the human body to cause disease; essentially it must amplify its own nucleic acids in order to cause a disease. This amplification of nucleic acid in infected tissue offers an opportunity to detect the infectious agent by using PCR. Third, the essential tools for directing PCR, ": null
    },
    {
        "primers": "https://en.wikipedia.org/wiki/Primer_(molecular_biology)"
    },
    {
        ", are derived from the ": null
    },
    {
        "genomes": "https://en.wikipedia.org/wiki/Genomes"
    },
    {
        " of infectious agents, and with time those genomes will be known, if they are not already.": null
    },
    {
        "Thus, the technological ability to detect any infectious agent rapidly and specifically are currently available. The only remaining blockades to the use of PCR as a standard tool of diagnosis are in its cost and application, neither of which is insurmountable. The diagnosis of a few diseases will not benefit from the development of PCR methods, such as some of the ": null
    },
    {
        "clostridial": "https://en.wikipedia.org/wiki/Clostridia"
    },
    {
        " diseases (": null
    },
    {
        "tetanus": "https://en.wikipedia.org/wiki/Tetanus"
    },
    {
        " and ": null
    },
    {
        "botulism": "https://en.wikipedia.org/wiki/Botulism"
    },
    {
        "). These diseases are fundamentally biological poisonings by relatively small numbers of infectious bacteria that produce extremely potent ": null
    },
    {
        "neurotoxins": "https://en.wikipedia.org/wiki/Neurotoxin"
    },
    {
        ". A significant proliferation of the infectious agent does not occur, this limits the ability of PCR to detect the presence of any bacteria.": null
    },
    {
        "Given the wide range of bacteria, viruses, and other pathogens that cause debilitating and life-threatening illness, the ability to quickly identify the cause of infection is important yet often challenging. For example, more than half of cases of ": null
    },
    {
        "encephalitis": "https://en.wikipedia.org/wiki/Encephalitis"
    },
    {
        ", a severe illness affecting the brain, remain undiagnosed, despite extensive testing using state-of-the-art clinical laboratory methods. ": null
    },
    {
        "Metagenomics": "https://en.wikipedia.org/wiki/Metagenomics"
    },
    {
        " is currently being researched for clinical use, and shows promise as a sensitive and rapid way to diagnose infection using a single all-encompassing test. This test is similar to current PCR tests; however, amplification of genetic material is unbiased rather than using ": null
    },
    {
        "primers": "https://en.wikipedia.org/wiki/Primer_(molecular_biology)"
    },
    {
        " for a specific infectious agent. This amplification step is followed by next-generation sequencing and ": null
    },
    {
        "alignment comparisons": "https://en.wikipedia.org/wiki/Sequence_alignment"
    },
    {
        " using large databases of thousands of organismic and viral genomes.": null
    },
    {
        "Metagenomic sequencing could prove especially useful for diagnosis when the patient is ": null
    },
    {
        "immunocompromised": "https://en.wikipedia.org/wiki/Immunocompromised"
    },
    {
        ". An ever-wider array of infectious agents can cause serious harm to individuals with immunosuppression, so clinical screening must often be broader. Additionally, the expression of symptoms is often atypical, making clinical diagnosis based on presentation more difficult. Thirdly, diagnostic methods that rely on the detection of antibodies are more likely to fail. A broad, sensitive test for pathogens that detects the presence of infectious material rather than antibodies is therefore highly desirable.": null
    },
    {
        "There is usually an ": null
    },
    {
        "indication": "https://en.wikipedia.org/wiki/Indication_(medicine)"
    },
    {
        " for a specific identification of an infectious agent only when such identification can aid in the treatment or prevention of the disease, or to advance knowledge of the course of an illness prior to the development of effective therapeutic or preventative measures. For example, in the early 1980s, prior to the appearance of ": null
    },
    {
        "AZT": "https://en.wikipedia.org/wiki/Zidovudine"
    },
    {
        " for the treatment of ": null
    },
    {
        "AIDS": "https://en.wikipedia.org/wiki/AIDS"
    },
    {
        ", the course of the disease was closely followed by monitoring the composition of patient blood samples, even though the outcome would not offer the patient any further treatment options. In part, these studies on the appearance of ": null
    },
    {
        "HIV": "https://en.wikipedia.org/wiki/HIV"
    },
    {
        " in specific communities permitted the advancement of ": null
    },
    {
        "hypotheses": "https://en.wikipedia.org/wiki/Hypotheses"
    },
    {
        " as to the route of transmission of the virus. By understanding how the disease was transmitted, resources could be targeted to the communities at greatest risk in campaigns aimed at reducing the number of new infections. The specific ": null
    },
    {
        "serological": "https://en.wikipedia.org/wiki/Serological"
    },
    {
        " diagnostic identification, and later ": null
    },
    {
        "genotypic": "https://en.wikipedia.org/wiki/Genotypic"
    },
    {
        " or molecular identification, of HIV also enabled the development of hypotheses as to the ": null
    },
    {
        "temporal": "https://en.wikipedia.org/wiki/Time"
    },
    {
        " and ": null
    },
    {
        "geographical": "https://en.wikipedia.org/wiki/Geographic"
    },
    {
        " origins of the virus, as well as a myriad of other hypothesis. The development of molecular diagnostic tools have enabled physicians and researchers to monitor the efficacy of treatment with ": null
    },
    {
        "anti-retroviral drugs": "https://en.wikipedia.org/wiki/Anti-retroviral_drugs"
    },
    {
        ". Molecular diagnostics are now commonly used to identify HIV in healthy people long before the onset of illness and have been used to demonstrate the existence of people who are genetically resistant to HIV infection. Thus, while there still is no cure for AIDS, there is great therapeutic and predictive benefit to identifying the virus and monitoring the virus levels within the blood of infected individuals, both for the patient and for the community at large.": null
    },
    {
        "Techniques like hand washing, wearing gowns, and wearing face masks can help prevent infections from being passed from one person to another. ": null
    },
    {
        "Aseptic technique": "https://en.wikipedia.org/wiki/Asepsis"
    },
    {
        " was introduced in medicine and surgery in the late 19th century and greatly reduced the incidence of infections caused by surgery. Frequent ": null
    },
    {
        "hand washing": "https://en.wikipedia.org/wiki/Hand_washing"
    },
    {
        " remains the most important defense against the spread of unwanted organisms. There are other forms of prevention such as avoiding the use of illicit drugs, using a condom, wearing gloves, and having a healthy lifestyle with a balanced diet and regular exercise. Cooking foods well and avoiding foods that have been left outside for a long time is also important.": null
    },
    {
        "Antimicrobial substances": "https://en.wikipedia.org/wiki/Antimicrobials"
    },
    {
        " used to prevent transmission of infections include:": null
    },
    {
        "One of the ways to prevent or slow down the transmission of infectious diseases is to recognize the different characteristics of various diseases. Some critical disease characteristics that should be evaluated include ": null
    },
    {
        "virulence": "https://en.wikipedia.org/wiki/Virulence"
    },
    {
        ", distance traveled by victims, and level of contagiousness. The human strains of ": null
    },
    {
        "Ebola": "https://en.wikipedia.org/wiki/Ebola"
    },
    {
        " virus, for example, incapacitate their victims extremely quickly and kill them soon after. As a result, the victims of this disease do not have the opportunity to travel very far from the initial infection zone. Also, this virus must spread through skin lesions or permeable membranes such as the eye. Thus, the initial stage of ": null
    },
    {
        "Ebola": "https://en.wikipedia.org/wiki/Ebola"
    },
    {
        " is not very contagious since its victims experience only internal hemorrhaging. As a result of the above features, the spread of Ebola is very rapid and usually stays within a relatively confined geographical area. In contrast, the ": null
    },
    {
        "Human Immunodeficiency Virus": "https://en.wikipedia.org/wiki/Human_Immunodeficiency_Virus"
    },
    {
        " (": null
    },
    {
        "HIV": "https://en.wikipedia.org/wiki/HIV"
    },
    {
        ") kills its victims very slowly by attacking their immune system. As a result, many of its victims transmit the virus to other individuals before even realizing that they are carrying the disease. Also, the relatively low virulence allows its victims to travel long distances, increasing the likelihood of an ": null
    },
    {
        "epidemic": "https://en.wikipedia.org/wiki/Epidemic"
    },
    {
        ".": null
    },
    {
        "Another effective way to decrease the transmission rate of infectious diseases is to recognize the effects of ": null
    },
    {
        "small-world networks": "https://en.wikipedia.org/wiki/Small-world_networks"
    },
    {
        ". In epidemics, there are often extensive interactions within hubs or groups of infected individuals and other interactions within discrete hubs of susceptible individuals. Despite the low interaction between discrete hubs, the disease can jump to and spread in a susceptible hub via a single or few interactions with an infected hub. Thus, infection rates in small-world networks can be reduced somewhat if interactions between individuals within infected hubs are eliminated (Figure 1). However, infection rates can be drastically reduced if the main focus is on the prevention of transmission jumps between hubs. The use of needle exchange programs in areas with a high density of drug users with HIV is an example of the successful implementation of this treatment method.  Another example is the use of ring culling or vaccination of potentially susceptible livestock in adjacent farms to prevent the spread of the ": null
    },
    {
        "foot-and-mouth": "https://en.wikipedia.org/wiki/Foot-and-mouth"
    },
    {
        " virus in 2001.": null
    },
    {
        "A general method to prevent transmission of ": null
    },
    {
        "vector": "https://en.wikipedia.org/wiki/Vector_(epidemiology)"
    },
    {
        "-borne pathogens is ": null
    },
    {
        "pest control": "https://en.wikipedia.org/wiki/Pest_control"
    },
    {
        ".": null
    },
    {
        "Infection with most pathogens does not result in death of the host and the offending organism is ultimately cleared after the symptoms of the disease have waned. This process requires ": null
    },
    {
        "immune mechanisms": "https://en.wikipedia.org/wiki/Immune_system"
    },
    {
        " to kill or inactivate the ": null
    },
    {
        "inoculum": "https://en.wikipedia.org/wiki/Inoculation"
    },
    {
        " of the pathogen. Specific acquired ": null
    },
    {
        "immunity": "https://en.wikipedia.org/wiki/Immunity_(medical)"
    },
    {
        " against infectious diseases may be mediated by ": null
    },
    {
        "antibodies": "https://en.wikipedia.org/wiki/Antibody"
    },
    {
        " and/or ": null
    },
    {
        "T lymphocytes": "https://en.wikipedia.org/wiki/T_lymphocyte"
    },
    {
        ". Immunity mediated by these two factors may be manifested by:": null
    },
    {
        "The immune system response to a microorganism often causes symptoms such as a high ": null
    },
    {
        "fever": "https://en.wikipedia.org/wiki/Fever"
    },
    {
        " and ": null
    },
    {
        "inflammation": "https://en.wikipedia.org/wiki/Inflammation"
    },
    {
        ", and has the potential to be more devastating than direct damage caused by a microbe.": null
    },
    {
        "Resistance to infection (": null
    },
    {
        "immunity": "https://en.wikipedia.org/wiki/Immunity_(medical)"
    },
    {
        ") may be acquired following a disease, by ": null
    },
    {
        "asymptomatic carriage": "https://en.wikipedia.org/wiki/Asymptomatic_carrier"
    },
    {
        " of the pathogen, by harboring an organism with a similar structure (crossreacting), or by ": null
    },
    {
        "vaccination": "https://en.wikipedia.org/wiki/Vaccination"
    },
    {
        ". Knowledge of the protective antigens and specific acquired host immune factors is more complete for primary pathogens than for ": null
    },
    {
        "opportunistic pathogens": "https://en.wikipedia.org/wiki/Opportunistic_pathogen"
    },
    {
        ".There is also the phenomenon of ": null
    },
    {
        "herd immunity": "https://en.wikipedia.org/wiki/Herd_immunity"
    },
    {
        " which offers a measure of protection to those otherwise vulnerable people when a large enough proportion of the population has acquired immunity from certain infections.": null
    },
    {
        "Immune resistance to an infectious disease requires a critical level of either antigen-specific antibodies and/or T cells when the host encounters the pathogen. Some individuals develop natural ": null
    },
    {
        "serum": "https://en.wikipedia.org/wiki/Blood_plasma"
    },
    {
        " antibodies to the surface ": null
    },
    {
        "polysaccharides": "https://en.wikipedia.org/wiki/Polysaccharide"
    },
    {
        " of some agents although they have had little or no contact with the agent, these natural antibodies confer specific protection to adults and are ": null
    },
    {
        "passively transmitted": "https://en.wikipedia.org/wiki/Passive_immunization"
    },
    {
        " to newborns.": null
    },
    {
        "The organism that is the target of an infecting action of a specific infectious agent is called the host. The host harbouring an agent that is in a mature or sexually active stage phase is called the definitive host. The intermediate host comes in contact during the larvae stage. A host can be anything living and can attain to asexual and sexual reproduction.The clearance of the pathogens, either treatment-induced or spontaneous, it can be influenced by the genetic variants carried by the individual patients. For instance, for genotype 1 hepatitis C treated with ": null
    },
    {
        "Pegylated interferon-alpha-2a": "https://en.wikipedia.org/wiki/Pegylated_interferon-alpha-2a"
    },
    {
        " or ": null
    },
    {
        "Pegylated interferon-alpha-2b": "https://en.wikipedia.org/wiki/Pegylated_interferon-alpha-2b"
    },
    {
        " (brand names Pegasys or PEG-Intron) combined with ": null
    },
    {
        "ribavirin": "https://en.wikipedia.org/wiki/Ribavirin"
    },
    {
        ", it has been shown that genetic polymorphisms near the human IL28B gene, encoding interferon lambda 3, are associated with significant differences in the treatment-induced clearance of the virus. This finding, originally reported in Nature, showed that genotype 1 hepatitis C patients carrying certain genetic variant alleles near the IL28B gene are more possibly to achieve sustained virological response after the treatment than others. Later report from Nature demonstrated that the same genetic variants are also associated with the natural clearance of the genotype 1 hepatitis C virus.": null
    },
    {
        "When infection attacks the body, anti-infective drugs can suppress the infection. Several broad types of anti-infective drugs exist, depending on the type of organism targeted; they include antibacterial (": null
    },
    {
        "antibiotic": "https://en.wikipedia.org/wiki/Antibiotic"
    },
    {
        "; including ": null
    },
    {
        "antitubercular": "https://en.wikipedia.org/wiki/Mycobacterium#Pathogenicity"
    },
    {
        "), ": null
    },
    {
        "antiviral": "https://en.wikipedia.org/wiki/Antiviral_drug"
    },
    {
        ", ": null
    },
    {
        "antifungal": "https://en.wikipedia.org/wiki/Antifungal_medication"
    },
    {
        " and ": null
    },
    {
        "antiparasitic": "https://en.wikipedia.org/wiki/Antiparasitic"
    },
    {
        " (including ": null
    },
    {
        "antiprotozoal": "https://en.wikipedia.org/wiki/Antiprotozoal"
    },
    {
        " and ": null
    },
    {
        "antihelminthic": "https://en.wikipedia.org/wiki/Antihelminthic"
    },
    {
        ") agents. Depending on the severity and the type of infection, the antibiotic may be given by mouth or by injection, or may be applied ": null
    },
    {
        "topically": "https://en.wikipedia.org/wiki/Topical"
    },
    {
        ". Severe infections of the ": null
    },
    {
        "brain": "https://en.wikipedia.org/wiki/Human_brain"
    },
    {
        " are usually treated with ": null
    },
    {
        "intravenous": "https://en.wikipedia.org/wiki/Intravenous_therapy"
    },
    {
        " antibiotics. Sometimes, multiple antibiotics are used in case there is ": null
    },
    {
        "resistance": "https://en.wikipedia.org/wiki/Antibiotic_resistance"
    },
    {
        " to one antibiotic. Antibiotics only work for bacteria and do not affect viruses. Antibiotics work by slowing down the multiplication of bacteria or killing the bacteria. The most common classes of antibiotics used in medicine include ": null
    },
    {
        "penicillin": "https://en.wikipedia.org/wiki/Penicillin"
    },
    {
        ", ": null
    },
    {
        "cephalosporins": "https://en.wikipedia.org/wiki/Cephalosporin"
    },
    {
        ", ": null
    },
    {
        "aminoglycosides": "https://en.wikipedia.org/wiki/Aminoglycoside"
    },
    {
        ", ": null
    },
    {
        "macrolides": "https://en.wikipedia.org/wiki/Macrolide"
    },
    {
        ", ": null
    },
    {
        "quinolones": "https://en.wikipedia.org/wiki/Quinolone_antibiotic"
    },
    {
        " and ": null
    },
    {
        "tetracyclines": "https://en.wikipedia.org/wiki/Tetracycline"
    },
    {
        ".": null
    },
    {
        "Not all infections require treatment, and for many ": null
    },
    {
        "self-limiting": "https://en.wikipedia.org/wiki/Self-limiting_(biology)"
    },
    {
        " infections the treatment may cause more side-effects than benefits. ": null
    },
    {
        "Antimicrobial stewardship": "https://en.wikipedia.org/wiki/Antimicrobial_stewardship"
    },
    {
        " is the concept that healthcare providers should treat an infection with an antimicrobial that specifically works well for the target pathogen for the shortest amount of time and to only treat when there is a known or highly suspected pathogen that will respond to the medication.": null
    },
    {
        "In 2010, about 10 million people died of infectious diseases.": null
    },
    {
        "The ": null
    },
    {
        "World Health Organization": "https://en.wikipedia.org/wiki/World_Health_Organization"
    },
    {
        " collects information on global deaths by ": null
    },
    {
        "International Classification of Disease (ICD) code categories": "https://en.wikipedia.org/wiki/ICD"
    },
    {
        ". The following table lists the top infectious disease by number of deaths in 2002. 1993 data is included for comparison.": null
    },
    {
        "The top three single agent/disease killers are ": null
    },
    {
        "HIV": "https://en.wikipedia.org/wiki/HIV"
    },
    {
        "/": null
    },
    {
        "AIDS": "https://en.wikipedia.org/wiki/AIDS"
    },
    {
        ", ": null
    },
    {
        "TB": "https://en.wikipedia.org/wiki/Tuberculosis"
    },
    {
        " and ": null
    },
    {
        "malaria": "https://en.wikipedia.org/wiki/Malaria"
    },
    {
        ". While the number of deaths due to nearly every disease have decreased, deaths due to HIV/AIDS have increased fourfold. Childhood diseases include ": null
    },
    {
        "pertussis": "https://en.wikipedia.org/wiki/Pertussis"
    },
    {
        ", ": null
    },
    {
        "poliomyelitis": "https://en.wikipedia.org/wiki/Poliomyelitis"
    },
    {
        ", ": null
    },
    {
        "diphtheria": "https://en.wikipedia.org/wiki/Diphtheria"
    },
    {
        ", ": null
    },
    {
        "measles": "https://en.wikipedia.org/wiki/Measles"
    },
    {
        " and ": null
    },
    {
        "tetanus": "https://en.wikipedia.org/wiki/Tetanus"
    },
    {
        ". Children also make up a large percentage of lower respiratory and diarrheal deaths. In 2012, approximately 3.1 million people have died due to lower respiratory infections, making it the number 4 leading cause of death in the world.": null
    },
    {
        "A ": null
    },
    {
        "pandemic": "https://en.wikipedia.org/wiki/Pandemic"
    },
    {
        " (or global ": null
    },
    {
        "epidemic": "https://en.wikipedia.org/wiki/Epidemic"
    },
    {
        ") is a disease that affects people over an extensive geographical area.": null
    },
    {
        "In most cases, microorganisms live in harmony with their hosts via ": null
    },
    {
        "mutual": "https://en.wikipedia.org/wiki/Mutualism_(biology)"
    },
    {
        " or ": null
    },
    {
        "commensal": "https://en.wikipedia.org/wiki/Commensalism"
    },
    {
        " interactions. Diseases can emerge when existing parasites become pathogenic or when new pathogenic parasites enter a new host.": null
    },
    {
        "Several human activities have led to the emergence of ": null
    },
    {
        "zoonotic": "https://en.wikipedia.org/wiki/Zoonotic"
    },
    {
        " human pathogens, including viruses, bacteria, protozoa, and rickettsia, and spread of ": null
    },
    {
        "vector-borne": "https://en.wikipedia.org/wiki/Vector_(epidemiology)"
    },
    {
        " diseases, see also ": null
    },
    {
        "globalization and disease": "https://en.wikipedia.org/wiki/Globalization_and_disease"
    },
    {
        " and ": null
    },
    {
        "wildlife disease": "https://en.wikipedia.org/wiki/Wildlife_disease"
    },
    {
        ":": null
    },
    {
        "A basic form of contagion theory dates back to ": null
    },
    {
        "medicine in the medieval Islamic world": "https://en.wikipedia.org/wiki/Medicine_in_the_medieval_Islamic_world"
    },
    {
        ", where it was proposed by ": null
    },
    {
        "Persian physician": "https://en.wikipedia.org/wiki/Ancient_Iranian_medicine"
    },
    {
        "Ibn Sina": "https://en.wikipedia.org/wiki/Ibn_Sina"
    },
    {
        " (known as Avicenna in Europe) in ": null
    },
    {
        "The Canon of Medicine": "https://en.wikipedia.org/wiki/The_Canon_of_Medicine"
    },
    {
        " (1025), which later became the most authoritative medical textbook in Europe up until the 16th century. In Book IV of the Canon, Ibn Sina discussed ": null
    },
    {
        "epidemics": "https://en.wikipedia.org/wiki/Epidemics"
    },
    {
        ", outlining the classical ": null
    },
    {
        "miasma theory": "https://en.wikipedia.org/wiki/Miasma_theory"
    },
    {
        " and attempting to blend it with his own early contagion theory. He mentioned that people can transmit disease to others by breath, noted contagion with ": null
    },
    {
        "tuberculosis": "https://en.wikipedia.org/wiki/Tuberculosis"
    },
    {
        ", and discussed the transmission of disease through water and dirt. The concept of invisible contagion was later discussed by several ": null
    },
    {
        "Islamic scholars": "https://en.wikipedia.org/wiki/Islamic_scholars"
    },
    {
        " in the ": null
    },
    {
        "Ayyubid Sultanate": "https://en.wikipedia.org/wiki/Ayyubid_Sultanate"
    },
    {
        " who referred to them as ": null
    },
    {
        "najasat": "https://en.wikipedia.org/wiki/Najasat"
    },
    {
        " (\"impure substances\"). The ": null
    },
    {
        "fiqh": "https://en.wikipedia.org/wiki/Fiqh"
    },
    {
        " scholar ": null
    },
    {
        "Ibn al-Haj al-Abdari": "https://en.wikipedia.org/wiki/Ibn_al-Haj_al-Abdari"
    },
    {
        " (c. 1250–1336), while discussing ": null
    },
    {
        "Islamic diet": "https://en.wikipedia.org/wiki/Islamic_dietary_laws"
    },
    {
        " and ": null
    },
    {
        "hygiene": "https://en.wikipedia.org/wiki/Islamic_hygienical_jurisprudence"
    },
    {
        ", gave warnings about how contagion can contaminate water, food, and garments, and could spread through the water supply, and may have implied contagion to be unseen particles.": null
    },
    {
        "When the ": null
    },
    {
        "Black Death": "https://en.wikipedia.org/wiki/Black_Death"
    },
    {
        "bubonic plague": "https://en.wikipedia.org/wiki/Bubonic_plague"
    },
    {
        " reached ": null
    },
    {
        "Al-Andalus": "https://en.wikipedia.org/wiki/Al-Andalus"
    },
    {
        " in the 14th century, the Arab physicians Ibn Khatima (c. 1369) and ": null
    },
    {
        "Ibn al-Khatib": "https://en.wikipedia.org/wiki/Ibn_al-Khatib"
    },
    {
        " (1313–1374) hypothesised that infectious diseases were caused by \"minute bodies\" and described how they can be transmitted through garments, vessels and earrings. Ideas of contagion became more popular in Europe during the ": null
    },
    {
        "Renaissance": "https://en.wikipedia.org/wiki/Renaissance"
    },
    {
        ", particularly through the writing of the Italian physician ": null
    },
    {
        "Girolamo Fracastoro": "https://en.wikipedia.org/wiki/Girolamo_Fracastoro"
    },
    {
        ".": null
    },
    {
        "Anton van Leeuwenhoek": "https://en.wikipedia.org/wiki/Anton_van_Leeuwenhoek"
    },
    {
        " (1632–1723) advanced the science of ": null
    },
    {
        "microscopy": "https://en.wikipedia.org/wiki/Microscopy"
    },
    {
        " by being the first to observe microorganisms, allowing for easy visualization of bacteria.": null
    },
    {
        "In the mid-19th century ": null
    },
    {
        "John Snow": "https://en.wikipedia.org/wiki/John_Snow_(physician)"
    },
    {
        " and ": null
    },
    {
        "William Budd": "https://en.wikipedia.org/wiki/William_Budd"
    },
    {
        " did important work demonstrating the contagiousness of typhoid and cholera through contaminated water. Both are credited with decreasing epidemics of cholera in their towns by implementing measures to prevent contamination of water.": null
    },
    {
        "Louis Pasteur": "https://en.wikipedia.org/wiki/Louis_Pasteur"
    },
    {
        " proved beyond doubt that certain diseases are caused by infectious agents, and developed a vaccine for ": null
    },
    {
        "rabies": "https://en.wikipedia.org/wiki/Rabies"
    },
    {
        ". ": null
    },
    {
        "Robert Koch": "https://en.wikipedia.org/wiki/Robert_Koch"
    },
    {
        ", provided the study of infectious diseases with a scientific basis known as ": null
    },
    {
        "Koch's postulates": "https://en.wikipedia.org/wiki/Koch%27s_postulates"
    },
    {
        ". ": null
    },
    {
        "Edward Jenner": "https://en.wikipedia.org/wiki/Edward_Jenner"
    },
    {
        ", ": null
    },
    {
        "Jonas Salk": "https://en.wikipedia.org/wiki/Jonas_Salk"
    },
    {
        " and ": null
    },
    {
        "Albert Sabin": "https://en.wikipedia.org/wiki/Albert_Sabin"
    },
    {
        " developed effective vaccines for ": null
    },
    {
        "smallpox": "https://en.wikipedia.org/wiki/Smallpox"
    },
    {
        " and ": null
    },
    {
        "polio": "https://en.wikipedia.org/wiki/Polio"
    },
    {
        ", which would later result in the ": null
    },
    {
        "eradication": "https://en.wikipedia.org/wiki/Eradication_of_infectious_diseases"
    },
    {
        " and near-eradication of these diseases, respectively. ": null
    },
    {
        "Alexander Fleming": "https://en.wikipedia.org/wiki/Alexander_Fleming"
    },
    {
        " discovered the world's first ": null
    },
    {
        "antibiotic": "https://en.wikipedia.org/wiki/Antibiotic"
    },
    {
        ", ": null
    },
    {
        "Penicillin": "https://en.wikipedia.org/wiki/Penicillin"
    },
    {
        ", which Florey and Chain then developed. ": null
    },
    {
        "Gerhard Domagk": "https://en.wikipedia.org/wiki/Gerhard_Domagk"
    },
    {
        " developed ": null
    },
    {
        "sulphonamides": "https://en.wikipedia.org/wiki/Sulfonamide_(medicine)"
    },
    {
        ", the first broad spectrum ": null
    },
    {
        "synthetic": "https://en.wikipedia.org/wiki/Chemical_synthesis"
    },
    {
        " antibacterial drugs.": null
    },
    {
        "The ": null
    },
    {
        "medical treatment": "https://en.wikipedia.org/wiki/Medicine"
    },
    {
        " of infectious diseases falls into the ": null
    },
    {
        "medical field": "https://en.wikipedia.org/wiki/Specialty_(medicine)"
    },
    {
        " of ": null
    },
    {
        "Infectious Disease": "https://en.wikipedia.org/wiki/Infectious_disease_(medical_specialty)"
    },
    {
        " and in some cases the study of propagation pertains to the field of ": null
    },
    {
        "Epidemiology": "https://en.wikipedia.org/wiki/Epidemiology"
    },
    {
        ". Generally, infections are initially diagnosed by ": null
    },
    {
        "primary care": "https://en.wikipedia.org/wiki/Primary_care"
    },
    {
        " physicians or ": null
    },
    {
        "internal medicine": "https://en.wikipedia.org/wiki/Internal_medicine"
    },
    {
        " specialists. For example, an \"uncomplicated\" ": null
    },
    {
        "pneumonia": "https://en.wikipedia.org/wiki/Pneumonia"
    },
    {
        " will generally be treated by the ": null
    },
    {
        "internist": "https://en.wikipedia.org/wiki/Internist"
    },
    {
        " or the ": null
    },
    {
        "pulmonologist": "https://en.wikipedia.org/wiki/Pulmology"
    },
    {
        " (lung physician). The work of the infectious diseases specialist therefore entails working with both patients and general practitioners, as well as ": null
    },
    {
        "laboratory scientists": "https://en.wikipedia.org/wiki/Research"
    },
    {
        ", ": null
    },
    {
        "immunologists": "https://en.wikipedia.org/wiki/Immunology"
    },
    {
        ", ": null
    },
    {
        "bacteriologists": "https://en.wikipedia.org/wiki/Bacteriology"
    },
    {
        " and other specialists.": null
    },
    {
        "An infectious disease team may be alerted when:": null
    },
    {
        "A number of studies have reported associations between pathogen load in an area and human behavior. Higher pathogen load is associated with decreased size of ethnic and religious groups in an area. This may be due high pathogen load favoring avoidance of other groups, which may reduce pathogen transmission, or a high pathogen load preventing the creation of large settlements and armies that enforce a common culture. Higher pathogen load is also associated with more restricted sexual behavior, which may reduce pathogen transmission. It also associated with higher preferences for health and attractiveness in mates. Higher ": null
    },
    {
        "fertility rates": "https://en.wikipedia.org/wiki/Fertility_rate"
    },
    {
        " and shorter or less parental care per child is another association that may be a compensation for the higher mortality rate. There is also an association with ": null
    },
    {
        "polygyny": "https://en.wikipedia.org/wiki/Polygyny"
    },
    {
        " which may be due to higher pathogen load, making selecting males with a high genetic resistance increasingly important. Higher pathogen load is also associated with more collectivism and less individualism, which may limit contacts with outside groups and infections. There are alternative explanations for at least some of the associations although some of these explanations may in turn ultimately be due to pathogen load. Thus, polygny may also be due to a lower male:female ratio in these areas but this may ultimately be due to male infants having increased mortality from infectious diseases. Another example is that poor socioeconomic factors may ultimately in part be due to high pathogen load preventing economic development.": null
    },
    {
        "Evidence of infection in fossil remains is a subject of interest for ": null
    },
    {
        "paleopathologists": "https://en.wikipedia.org/wiki/Paleopathologists"
    },
    {
        ", scientists who study occurrences of injuries and illness in extinct life forms. Signs of infection have been discovered in the bones of carnivorous dinosaurs. When present, however, these infections seem to tend to be confined to only small regions of the body. A skull attributed to the early carnivorous dinosaur ": null
    },
    {
        "Herrerasaurus ischigualastensis": "https://en.wikipedia.org/wiki/Herrerasaurus_ischigualastensis"
    },
    {
        " exhibits pit-like wounds surrounded by swollen and porous bone. The unusual texture of the bone around the wounds suggests they were afflicted by a short-lived, non-lethal infection. Scientists who studied the skull speculated that the bite marks were received in a fight with another Herrerasaurus. Other carnivorous dinosaurs with documented evidence of infection include ": null
    },
    {
        "Acrocanthosaurus": "https://en.wikipedia.org/wiki/Acrocanthosaurus"
    },
    {
        ", ": null
    },
    {
        "Allosaurus": "https://en.wikipedia.org/wiki/Allosaurus"
    },
    {
        ", ": null
    },
    {
        "Tyrannosaurus": "https://en.wikipedia.org/wiki/Tyrannosaurus"
    },
    {
        " and a tyrannosaur from the ": null
    },
    {
        "Kirtland Formation": "https://en.wikipedia.org/wiki/Kirtland_Formation"
    },
    {
        ". The infections from both tyrannosaurs were received by being bitten during a fight, like the Herrerasaurus specimen.": null
    },
    {
        "A 2006 Space Shuttle experiment found that ": null
    },
    {
        "Salmonella typhimurium": "https://en.wikipedia.org/wiki/Salmonella_typhimurium"
    },
    {
        ", a bacterium that can cause ": null
    },
    {
        "food poisoning": "https://en.wikipedia.org/wiki/Food_poisoning"
    },
    {
        ", became more virulent when cultivated in space. On April 29, 2013, scientists in Rensselaer Polytechnic Institute, funded by ": null
    },
    {
        "NASA": "https://en.wikipedia.org/wiki/NASA"
    },
    {
        ", reported that, during ": null
    },
    {
        "spaceflight": "https://en.wikipedia.org/wiki/Spaceflight"
    },
    {
        " on the ": null
    },
    {
        "International Space Station": "https://en.wikipedia.org/wiki/International_Space_Station"
    },
    {
        ", ": null
    },
    {
        "microbes": "https://en.wikipedia.org/wiki/Microbes"
    },
    {
        " seem to adapt to the ": null
    },
    {
        "space environment": "https://en.wikipedia.org/wiki/Space_environment"
    },
    {
        " in ways \"not observed on Earth\" and in ways that \"can lead to increases in growth and ": null
    },
    {
        "virulence": "https://en.wikipedia.org/wiki/Virulence"
    },
    {
        "\". More recently, in 2017, ": null
    },
    {
        "bacteria": "https://en.wikipedia.org/wiki/Bacteria"
    },
    {
        " were found to be more resistant to ": null
    },
    {
        "antibiotics": "https://en.wikipedia.org/wiki/Antibiotic"
    },
    {
        " and to thrive in the near-weightlessness of space.": null
    },
    {
        "Microorganisms": "https://en.wikipedia.org/wiki/Microorganism"
    },
    {
        " have been observed to survive the ": null
    },
    {
        "vacuum": "https://en.wikipedia.org/wiki/Vacuum"
    },
    {
        " of outer space.": null
    }
]