[
    {
        "Standard anatomical terms of location deal unambiguously with the ": null
    },
    {
        "anatomy": "https://en.wikipedia.org/wiki/Anatomy"
    },
    {
        " of ": null
    },
    {
        "animals": "https://en.wikipedia.org/wiki/Animal"
    },
    {
        ", including humans.": null
    },
    {
        "All ": null
    },
    {
        "vertebrates": "https://en.wikipedia.org/wiki/Vertebrate"
    },
    {
        " (including humans) have the same basic ": null
    },
    {
        "body plan": "https://en.wikipedia.org/wiki/Body_plan"
    },
    {
        " –  they are strictly ": null
    },
    {
        "bilaterally symmetrical": "https://en.wikipedia.org/wiki/Symmetry_in_biology"
    },
    {
        " in early embryonic stages and largely bilaterally symmetrical in adulthood. That is, they have mirror-image left and right halves if divided down the middle. For these reasons, the basic directional terms can be considered to be those used in vertebrates. By extension, the same terms are used for many other (": null
    },
    {
        "invertebrate": "https://en.wikipedia.org/wiki/Invertebrate"
    },
    {
        ") organisms as well.": null
    },
    {
        "While these terms are standardized within specific fields of ": null
    },
    {
        "biology": "https://en.wikipedia.org/wiki/Biology"
    },
    {
        ", they are unavoidable, sometimes dramatic differences between some disciplines. For example, differences in terminology remain a problem that, to some extent, still separates the  from that used in the study of various other zoological categories.": null
    },
    {
        "Standardized ": null
    },
    {
        "anatomical": "https://en.wikipedia.org/wiki/Anatomy"
    },
    {
        " and ": null
    },
    {
        "zoological": "https://en.wikipedia.org/wiki/Zoology"
    },
    {
        " terms of location have been developed, usually based on ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin"
    },
    {
        " and ": null
    },
    {
        "Greek": "https://en.wikipedia.org/wiki/Greek_language"
    },
    {
        " words, to enable all biological and medical scientists to precisely delineate and communicate information about animal bodies and their component organs, even though the meaning of some of the terms often is context-sensitive.": null
    },
    {
        "The ": null
    },
    {
        "vertebrates": "https://en.wikipedia.org/wiki/Vertebrate"
    },
    {
        " and ": null
    },
    {
        "Craniata": "https://en.wikipedia.org/wiki/Craniata"
    },
    {
        " share a substantial heritage and common structure, so many of the same terms are used for location. To avoid ambiguities this terminology is based on the anatomy of each animal in a standard way.": null
    },
    {
        "For humans, one type of vertebrate, anatomical terms may differ from other forms of vertebrates. For one reason, this is because humans have a different ": null
    },
    {
        "neuraxis": "https://en.wikipedia.org/wiki/Neuraxis"
    },
    {
        " and, unlike animals that rest on four limbs, humans are considered when describing anatomy as being in the ": null
    },
    {
        "standard anatomical position": "https://en.wikipedia.org/wiki/Standard_anatomical_position"
    },
    {
        ". Thus what is on \"top\" of a human is the ": null
    },
    {
        "head": "https://en.wikipedia.org/wiki/Head"
    },
    {
        ", whereas the \"top\" of a dog may be its back, and the \"top\" of a ": null
    },
    {
        "flounder": "https://en.wikipedia.org/wiki/Flounder"
    },
    {
        " could refer to either its left or its right side.": null
    },
    {
        "For ": null
    },
    {
        "invertebrates": "https://en.wikipedia.org/wiki/Invertebrate"
    },
    {
        ", standard application of locational terminology often becomes difficult or debatable at best when the differences in ": null
    },
    {
        "morphology": "https://en.wikipedia.org/wiki/Morphology_(biology)"
    },
    {
        " are so radical that common concepts are not ": null
    },
    {
        "homologous": "https://en.wikipedia.org/wiki/Homology_(biology)"
    },
    {
        " and do not refer to common concepts. For example, many species are not even ": null
    },
    {
        "bilaterally symmetrical": "https://en.wikipedia.org/wiki/Symmetry_in_biology"
    },
    {
        ". In these species, terminology depends on their type of symmetry (if any).": null
    },
    {
        "Because ": null
    },
    {
        "animals": "https://en.wikipedia.org/wiki/Animal"
    },
    {
        " can change orientation with respect to their environment, and because ": null
    },
    {
        "appendages": "https://en.wikipedia.org/wiki/Appendage"
    },
    {
        " like ": null
    },
    {
        "limbs": "https://en.wikipedia.org/wiki/Limb_(anatomy)"
    },
    {
        " and ": null
    },
    {
        "tentacles": "https://en.wikipedia.org/wiki/Tentacle"
    },
    {
        " can change position with respect to the main body, positional descriptive terms need to refer to the animal as in its ": null
    },
    {
        "standard anatomical position": "https://en.wikipedia.org/wiki/Standard_anatomical_position"
    },
    {
        ". All descriptions are with respect to the organism in its standard anatomical position, even when the organism in question has appendages in another position. This helps avoid confusion in terminology when referring to the same organism in different postures.": null
    },
    {
        "In humans, this refers to the body in a standing position with arms at the side and palms facing forward (thumbs out and to the sides). While the universal vertebrate terminology used in veterinary medicine would work in human medicine, the human terms are thought to be ": null
    },
    {
        "too well established to be worth changing": "https://en.wikipedia.org/wiki/Status_quo_bias"
    },
    {
        ".": null
    },
    {
        "Many anatomical terms can be combined, either to indicate a position in two axes simultaneously or to indicate the direction of a movement relative to the body. For example, \"anterolateral\" indicates a position that is both anterior and lateral to the body axis (such as the bulk of the ": null
    },
    {
        "pectoralis major": "https://en.wikipedia.org/wiki/Pectoralis_major"
    },
    {
        " muscle). In ": null
    },
    {
        "radiology": "https://en.wikipedia.org/wiki/Radiology"
    },
    {
        ", an ": null
    },
    {
        "X-ray": "https://en.wikipedia.org/wiki/X-ray"
    },
    {
        " image may be said to be \"anteroposterior\", indicating that the beam of X-rays pass from their source to patient's ": null
    },
    {
        "anterior": "https://en.wikipedia.org/wiki/Anterior"
    },
    {
        " body wall through the body to exit through ": null
    },
    {
        "posterior": "https://en.wikipedia.org/wiki/Posterior_(anatomy)"
    },
    {
        " body wall.": null
    },
    {
        "There is no definite limit to the contexts in which terms may be modified to qualify each other in such combinations. Generally the modifier term is truncated and an \"o\" or an \"i\" is added in prefixing it to the qualified term. For example, a view of an animal from an aspect at once dorsal and lateral might be called a \"dorsolateral\" view; and the effect of dorsolateral flattening in an organism such as a ": null
    },
    {
        "krait": "https://en.wikipedia.org/wiki/Bungarus"
    },
    {
        " gives its body a triangular cross section. Again, in describing the ": null
    },
    {
        "morphology": "https://en.wikipedia.org/wiki/Morphology_(biology)"
    },
    {
        " of an organ or ": null
    },
    {
        "habitus": "https://en.wikipedia.org/wiki/Habit_(biology)"
    },
    {
        " of an animal such as many of the ": null
    },
    {
        "Platyhelminthes": "https://en.wikipedia.org/wiki/Platyhelminthes"
    },
    {
        ", one might speak of it as \"dorsiventrally\" flattened as opposed to bilaterally flattened animals such as ": null
    },
    {
        "ocean sunfish": "https://en.wikipedia.org/wiki/Ocean_sunfish"
    },
    {
        ".": null
    },
    {
        "Where desirable three or more terms may be ": null
    },
    {
        "agglutinated": "https://en.wikipedia.org/wiki/Agglutination"
    },
    {
        " or ": null
    },
    {
        "concatenated": "https://en.wikipedia.org/wiki/Concatenation"
    },
    {
        ", as in \"anteriodorsolateral\". Such terms sometimes used to be hyphenated, but the modern tendency is to omit the hyphen. There is however little basis for any strict rule to interfere with choice of convenience in such usage.": null
    },
    {
        "A special sagittal plane is the median plane or midsagittal plane in the midline of the body, and divides the body into left and right (sinister and dexter) portions. This passes through the ": null
    },
    {
        "head": "https://en.wikipedia.org/wiki/Head"
    },
    {
        ", ": null
    },
    {
        "spinal cord": "https://en.wikipedia.org/wiki/Spinal_cord"
    },
    {
        ", ": null
    },
    {
        "navel": "https://en.wikipedia.org/wiki/Navel"
    },
    {
        ", and, in many animals, the ": null
    },
    {
        "tail": "https://en.wikipedia.org/wiki/Tail"
    },
    {
        ". The term \"median plane\" can also refer to the midsagittal plane of other structures, such as a digit.": null
    },
    {
        "In human anatomy:": null
    },
    {
        "To begin with, distinct, polar-opposite ends of the ": null
    },
    {
        "organism": "https://en.wikipedia.org/wiki/Organism"
    },
    {
        " are chosen. By definition, each pair of opposite points defines an ": null
    },
    {
        "axis": "https://en.wikipedia.org/wiki/Rotation_around_a_fixed_axis"
    },
    {
        ". In a bilaterally symmetrical organism, there are 6 polar opposite points, giving three axes that intersect at right angles –  the x, y, and z axes familiar from three-dimensional geometry.": null
    },
    {
        "The terms \"intermediate\", \"ipsilateral\", \"contralateral\", \"superficial\", and \"deep\", while indicating directions, are relative terms and thus do not properly define fixed anatomical axes. Also, while the \"rostrocaudal\" and anteroposterior directionality are equivalent in a significant portion of the human body, they are different directions in other parts of the body.": null
    },
    {
        "In anatomical terminology superior (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        ", meaning 'above') is used to refer to what is above something, and inferior (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        ", meaning 'below') to what is below it. For example, in the ": null
    },
    {
        "anatomical position": "https://en.wikipedia.org/wiki/Anatomical_position"
    },
    {
        " the most superior part of the human body is the head, and the most inferior is the feet. As a second example, in humans the ": null
    },
    {
        "neck": "https://en.wikipedia.org/wiki/Neck"
    },
    {
        " is superior to the ": null
    },
    {
        "chest": "https://en.wikipedia.org/wiki/Chest"
    },
    {
        " but inferior to the ": null
    },
    {
        "head": "https://en.wikipedia.org/wiki/Head"
    },
    {
        ".": null
    },
    {
        "Anterior refers to what is in front (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " ante, meaning \"before\") and  posterior, what is to the back of the subject (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " post, meaning \"after\"). For example, in a dog the ": null
    },
    {
        "nose": "https://en.wikipedia.org/wiki/Nose"
    },
    {
        " is anterior to the eyes and the ": null
    },
    {
        "tail": "https://en.wikipedia.org/wiki/Tail"
    },
    {
        " is considered the most posterior part; in many ": null
    },
    {
        "fish": "https://en.wikipedia.org/wiki/Fish"
    },
    {
        " the ": null
    },
    {
        "gill": "https://en.wikipedia.org/wiki/Gill"
    },
    {
        " openings are posterior to the eyes, but anterior to the tail. In ": null
    },
    {
        "projectional radiography terminology": "https://en.wikipedia.org/wiki/Projectional_radiography#Projectional_radiography_terminology"
    },
    {
        ", an anteroposterior (AP) projection is taken with the ": null
    },
    {
        "X-ray generator": "https://en.wikipedia.org/wiki/X-ray_generator"
    },
    {
        " anteriorly (such as in the front of a human), and the ": null
    },
    {
        "X-ray detector": "https://en.wikipedia.org/wiki/X-ray_detector"
    },
    {
        " posteriorly. In contrast, a posteroanterior (PA) projection is taken with the ": null
    },
    {
        "X-ray generator": "https://en.wikipedia.org/wiki/X-ray_generator"
    },
    {
        " posteriorly.": null
    },
    {
        "Lateral (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " lateralis, meaning 'to the side') refers to the sides of an animal, as in \"left lateral\" and \"right lateral\". The term medial (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " medius, meaning 'middle') is used to refer to structures close to the centre of an organism, called the \"median plane\". For example, in a human, imagine a line down the center of the body from the head though the navel and going between the legs— the medial side of the foot would be the big toe side; the medial side of the knee would be the side adjacent to the other knee. To describe the sides of the knees touching each other would be \"right medial\" and \"left medial\".": null
    },
    {
        "The terms \"left\" and \"right\" are sometimes used, or their Latin alternatives (": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        ": dexter; \"right\", ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        ": sinister; \"left\"). However, as left and right sides are ": null
    },
    {
        "mirror images": "https://en.wikipedia.org/wiki/Mirror_images"
    },
    {
        ", using these words is somewhat confusing, as structures are duplicated on both sides. For example, it is very confusing to say the ": null
    },
    {
        "dorsal fin": "https://en.wikipedia.org/wiki/Dorsal_fin"
    },
    {
        " of a ": null
    },
    {
        "dolphin": "https://en.wikipedia.org/wiki/Dolphin"
    },
    {
        " is \"right of\" the left ": null
    },
    {
        "pectoral fin": "https://en.wikipedia.org/wiki/Pectoral_fin"
    },
    {
        ", but is \"left of\" the right ": null
    },
    {
        "eye": "https://en.wikipedia.org/wiki/Eye"
    },
    {
        ", but much easier and clearer to say \"the dorsal fin is medial to the pectoral fins\".": null
    },
    {
        "Derived terms include:": null
    },
    {
        "Varus": "https://en.wikipedia.org/wiki/Varus_deformity"
    },
    {
        " and ": null
    },
    {
        "valgus": "https://en.wikipedia.org/wiki/Valgus_deformity"
    },
    {
        " correspond to medial and lateral, respectively, regarding the distal segment's vector relative to the proximal segment's vector.": null
    },
    {
        "The terms proximal (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " proximus, meaning 'nearest') and distal (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " distare, meaning 'to stand away from') are used to describe parts of a feature that are close to or distant from the main mass of the body, respectively. Thus the upper arm in humans is proximal and the hand is distal.": null
    },
    {
        "These terms are frequently used when describing ": null
    },
    {
        "appendages": "https://en.wikipedia.org/wiki/Appendage"
    },
    {
        " such as ": null
    },
    {
        "fins": "https://en.wikipedia.org/wiki/Fins"
    },
    {
        ", ": null
    },
    {
        "tentacles": "https://en.wikipedia.org/wiki/Tentacle"
    },
    {
        ", ": null
    },
    {
        "limbs": "https://en.wikipedia.org/wiki/Limb_(anatomy)"
    },
    {
        " or any structure that extends that can potentially move separately from the main body. Although the direction indicated by \"proximal\" and \"distal\" is always respectively towards or away from the point of attachment, a given structure can be either proximal or distal in relation to another point of reference. Thus the elbow is distal to a wound on the upper arm, but proximal to a wound on the lower arm.": null
    },
    {
        "This terminology is also employed in molecular biology and therefore by extension is also used in chemistry, specifically referring to the atomic loci of molecules from the overall moiety of a given compound.": null
    },
    {
        "Central and peripheral are terms that are closely related to concepts such as proximal and distal, but they are so widely applicable that in many respects their flexibility makes them hard to define. Loosely speaking, they distinguish near and far, inside and out, or even organs of vital importance such as heart and lungs, from peripheral organs such as fingers, that undoubtedly may be important, but which it may not be life-threatening to dispense with. Examples of the application of the terms are the distinction between ": null
    },
    {
        "central-": "https://en.wikipedia.org/wiki/Central_nervous_system"
    },
    {
        " and ": null
    },
    {
        "peripheral nervous systems": "https://en.wikipedia.org/wiki/Peripheral_nervous_system"
    },
    {
        ", and between peripheral blood vessels and the central circulatory organs, such as the heart and major vessels. The terms also can apply to large and complex molecules such as proteins, where central amino acid ": null
    },
    {
        "residues": "https://en.wikipedia.org/wiki/Residue_(chemistry)#Biochemistry"
    },
    {
        " are protected from antibodies or the like, but peripheral residues are important in docking and other interactions. Other examples include Central and peripheral circadian clocks, and central versus peripheral vision.": null
    },
    {
        "These two terms relate to the distance of a structure from the surface of an animal.": null
    },
    {
        "Deep (from ": null
    },
    {
        "Old English": "https://en.wikipedia.org/wiki/Old_English_language"
    },
    {
        ") refers to something further away from the surface of the organism. For example, the ": null
    },
    {
        "external oblique muscle": "https://en.wikipedia.org/wiki/External_oblique_muscle"
    },
    {
        " of the abdomen is deep to the skin. \"Deep\" is one of the few anatomical terms of location derived from ": null
    },
    {
        "Old English": "https://en.wikipedia.org/wiki/Old_English"
    },
    {
        " rather than Latin – the anglicised Latin term would have been \"profound\" (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " profundus, meaning 'due to depth').": null
    },
    {
        "Superficial (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " superficies, meaning 'surface') refers to something near the outer surface of the organism. For example, in ": null
    },
    {
        "skin": "https://en.wikipedia.org/wiki/Skin"
    },
    {
        " the ": null
    },
    {
        "epidermis": "https://en.wikipedia.org/wiki/Epidermis"
    },
    {
        " is superficial to the ": null
    },
    {
        "subcutis": "https://en.wikipedia.org/wiki/Subcutis"
    },
    {
        ".": null
    },
    {
        "These two terms, used in anatomy and ": null
    },
    {
        "embryology": "https://en.wikipedia.org/wiki/Embryology"
    },
    {
        ", refer to back (dorsal) and front or belly (ventral) of an organism.": null
    },
    {
        "The dorsal (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " dorsum, meaning 'back') surface of an organism refers to the back, or upper side, of an organism. If talking about the skull, the dorsal side is the top.": null
    },
    {
        "The ventral (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " venter, meaning 'belly') surface refers to the front, or lower side, of an organism.": null
    },
    {
        "For example, in a fish the ": null
    },
    {
        "pectoral fins": "https://en.wikipedia.org/wiki/Pectoral_fins"
    },
    {
        " are dorsal to the ": null
    },
    {
        "anal fin": "https://en.wikipedia.org/wiki/Anal_fin"
    },
    {
        ", but ventral to the ": null
    },
    {
        "dorsal fin": "https://en.wikipedia.org/wiki/Dorsal_fin"
    },
    {
        ".": null
    },
    {
        "Specific terms exist to describe how close or far something is to the head or tail of an animal. To describe how close to the head of an animal something is, three distinct terms are used:": null
    },
    {
        "For example, in the ": null
    },
    {
        "horse": "https://en.wikipedia.org/wiki/Horse"
    },
    {
        ", the eyes are caudal to the nose and rostral to the back of the head.": null
    },
    {
        "These terms are generally preferred in veterinary medicine and not used as often in human medicine. In humans, \"cranial\" and \"cephalic\" are used to refer to the skull, with \"cranial\" being used more commonly. The term \"rostral\" is rarely used in human anatomy, apart from embryology, and refers more to the front of the face than the superior aspect of the organism. Similarly, the term \"caudal\" is only occasionally used in human anatomy.  This is because the brain is situated at the superior part of the head whereas the nose is situated in the anterior part. Thus the \"rostrocaudal axis\" refers to a C shape (see image).": null
    },
    {
        "The location of anatomical structures can also be described with relation to different ": null
    },
    {
        "anatomical landmarks": "https://en.wikipedia.org/wiki/Anatomical_landmark"
    },
    {
        ".": null
    },
    {
        "Structures may be described as being at the level of a specific ": null
    },
    {
        "spinal vertebra": "https://en.wikipedia.org/wiki/Spinal_vertebrae"
    },
    {
        ", depending on the section of the ": null
    },
    {
        "vertebral column": "https://en.wikipedia.org/wiki/Vertebral_column"
    },
    {
        " the structure is at. The position is often abbreviated. For example, structures at the level of the fourth ": null
    },
    {
        "cervical vertebra": "https://en.wikipedia.org/wiki/Cervical_vertebra"
    },
    {
        " may be abbreviated as \"C4\", at the level of the fourth ": null
    },
    {
        "thoracic vertebra": "https://en.wikipedia.org/wiki/Thoracic_vertebra"
    },
    {
        " \"T4\", and at the level of the third ": null
    },
    {
        "lumbar vertebra": "https://en.wikipedia.org/wiki/Lumbar_vertebra"
    },
    {
        " \"L3\". Because the ": null
    },
    {
        "sacrum": "https://en.wikipedia.org/wiki/Sacrum"
    },
    {
        " and coccyx are fused,  they are not often used to provide location.": null
    },
    {
        "References may also take origin from  ": null
    },
    {
        "superficial anatomy": "https://en.wikipedia.org/wiki/Superficial_anatomy"
    },
    {
        ", made to landmarks that are on the skin or visible underneath. For example, structures may be described relative to the ": null
    },
    {
        "anterior superior iliac spine": "https://en.wikipedia.org/wiki/Anterior_superior_iliac_spine"
    },
    {
        ", the ": null
    },
    {
        "medial malleolus": "https://en.wikipedia.org/wiki/Medial_malleolus"
    },
    {
        " or the ": null
    },
    {
        "medial epicondyle": "https://en.wikipedia.org/wiki/Medial_epicondyle_of_the_humerus"
    },
    {
        ".": null
    },
    {
        "Anatomical lines": "https://en.wikipedia.org/wiki/List_of_anatomical_lines"
    },
    {
        ", theoretical lines drawn through structures, are also used to describe anatomical location. For example, the mid-clavicular line is used as part of the ": null
    },
    {
        "cardiac exam": "https://en.wikipedia.org/wiki/Cardiac_examination"
    },
    {
        " in medicine to feel the ": null
    },
    {
        "apex beat": "https://en.wikipedia.org/wiki/Apex_beat"
    },
    {
        " of the ": null
    },
    {
        "heart": "https://en.wikipedia.org/wiki/Heart"
    },
    {
        ".": null
    },
    {
        "Fields such as ": null
    },
    {
        "osteology": "https://en.wikipedia.org/wiki/Osteology"
    },
    {
        ", ": null
    },
    {
        "palaeontology": "https://en.wikipedia.org/wiki/Palaeontology"
    },
    {
        " and dentistry apply special terms of location to describe the mouth and teeth. This is because although teeth may be aligned with their main axes within the jaw, some different relationships require special terminology as well; for example teeth also can be rotated, and in such contexts terms like \"anterior\" or \"lateral\" become ambiguous. Terms such as \"distal\" and \"proximal\" are also redefined to mean the distance away or close to the ": null
    },
    {
        "mandibular symphysis": "https://en.wikipedia.org/wiki/Mandibular_symphysis"
    },
    {
        ". Terms used to describe structures include \"buccal\" (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " bucca, meaning 'cheek') and \"palatal\" (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        ") referring to structures close to the ": null
    },
    {
        "cheek": "https://en.wikipedia.org/wiki/Cheek"
    },
    {
        " and ": null
    },
    {
        "hard palate": "https://en.wikipedia.org/wiki/Hard_palate"
    },
    {
        " respectively.": null
    },
    {
        "Several anatomical terms are particular to the hands and feet.": null
    },
    {
        "For improved clarity, the directional term palmar (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " palma, meaning 'palm of the hand') is usually used to describe the front of the hand, and dorsal is the back of the hand. For example, the top of a ": null
    },
    {
        "dog": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        "'s ": null
    },
    {
        "paw": "https://en.wikipedia.org/wiki/Paw"
    },
    {
        " is its dorsal surface; the underside, either the palmar (on the forelimb) or the plantar (on the hindlimb) surface. The ": null
    },
    {
        "palmar fascia": "https://en.wikipedia.org/wiki/Palmar_fascia"
    },
    {
        " is palmar to the ": null
    },
    {
        "tendons": "https://en.wikipedia.org/wiki/Tendon"
    },
    {
        " of muscles which flex the fingers, and the ": null
    },
    {
        "dorsal venous arch": "https://en.wikipedia.org/wiki/Dorsal_venous_arch"
    },
    {
        " is so named because it is on the dorsal side of the foot.": null
    },
    {
        "Volar can also be used to refer to the underside of the ": null
    },
    {
        "palm": "https://en.wikipedia.org/wiki/Hand#Areas"
    },
    {
        " or ": null
    },
    {
        "sole": "https://en.wikipedia.org/wiki/Sole_(foot)"
    },
    {
        ", which are themselves also sometimes used to describe location as ": null
    },
    {
        "palmar": "https://en.wiktionary.org/wiki/palmar#Adjective"
    },
    {
        " and ": null
    },
    {
        "plantar": "https://en.wiktionary.org/wiki/plantar#Adjective"
    },
    {
        ". For example, volar pads are those on the underside of hands, fingers, feet, and toes.": null
    },
    {
        "These terms are used to avoid confusion when describing the median surface of the hand and what is the \"anterior\" or \"posterior\" surface –  \"anterior\" can be used to describe the ": null
    },
    {
        "palm": "https://en.wikipedia.org/wiki/Hand"
    },
    {
        " of the hand, and \"posterior\" can be used to describe the back of the hand and arm. This confusion can arise because the forearm can ": null
    },
    {
        "pronate": "https://en.wikipedia.org/wiki/Pronate"
    },
    {
        " and ": null
    },
    {
        "supinate": "https://en.wikipedia.org/wiki/Supinate"
    },
    {
        ".": null
    },
    {
        "Similarly, in the forearm, for clarity, the sides are named after the bones. Structures closer to the ": null
    },
    {
        "radius": "https://en.wikipedia.org/wiki/Radius_(bone)"
    },
    {
        " are radial, structures closer to the ": null
    },
    {
        "ulna": "https://en.wikipedia.org/wiki/Ulna"
    },
    {
        " are ulnar, and structures relating to both bones are referred to as radioulnar. Similarly, in the lower leg, structures near the ": null
    },
    {
        "tibia": "https://en.wikipedia.org/wiki/Tibia"
    },
    {
        " (shinbone) are tibial and structures near the ": null
    },
    {
        "fibula": "https://en.wikipedia.org/wiki/Fibula"
    },
    {
        " are fibular (or peroneal).": null
    },
    {
        "Most terms of anatomical location are relative to linear motion (": null
    },
    {
        "translation": "https://en.wikipedia.org/wiki/Degrees_of_freedom_(mechanics)#Six_degrees_of_freedom"
    },
    {
        ") along the X- Y- and Z-axes, but there are other ": null
    },
    {
        "degrees of freedom": "https://en.wikipedia.org/wiki/Degrees_of_freedom_(mechanics)#Six_degrees_of_freedom"
    },
    {
        " as well, in particular, rotation around any of those three axes.": null
    },
    {
        "Anteversion and retroversion are complementary anatomical terms of location, describing the degree to which an anatomical structure is rotated forwards (towards the front of the body) or backwards (towards the back of the body) respectively, relative to some datum position. The terms also describe the positioning of surgical implants, such as in ": null
    },
    {
        "arthroplasty": "https://en.wikipedia.org/wiki/Arthroplasty"
    },
    {
        ".": null
    },
    {
        "Several other terms are also used to describe location. These terms are not used to form the fixed axes. Terms include:": null
    },
    {
        "Directional and locational prefixes can modify many anatomical and morphological terms, sometimes in formally standard usage, but often attached arbitrarily according to need or convenience.": null
    },
    {
        "Prefixes": null
    },
    {
        "Suffixes": null
    },
    {
        "Commonly when, for example, one anatomical feature is nearer to something than another, one may use an expression such as \"nearer the distal end\" or \"distal to\". However, an unambiguous and concise convention is to use the Latin suffix -ad, meaning \"towards\", or sometimes \"to\".  So for example, \"distad\" means \"in the distal direction\", and \"distad of the femur\" means \"beyond the femur in the distal direction\". The suffix may be used very widely, as in the following examples: anteriad (towards the anterior), apicad (towards the apex), basad (towards the basal end), caudad, centrad, cephalad (towards the cephalic end), craniad, dextrad, dextrocaudad, dextrocephalad, distad, dorsad, ectad (towards the ectal, or exterior, direction), entad (towards the interior), laterad, mediad, mesad, neurad, orad, posteriad, proximad, rostrad, sinistrad, sinistrocaudad, sinistrocephalad, ventrad.": null
    },
    {
        "The large variety of ": null
    },
    {
        "body shapes": "https://en.wikipedia.org/wiki/Body_plan"
    },
    {
        " present in invertebrates presents a difficult problem when attempting to apply standard directional terms. Depending on the organism, some terms are taken by analogy from vertebrate anatomy, and appropriate novel terms are applied as needed. Some such borrowed terms are widely applicable in most invertebrates; for example proximal, literally meaning \"near\" refers to the part of an appendage nearest to where it joins the body, and distal, literally meaning \"standing away from\" is used for the part furthest from the point of attachment. In all cases, the usage of terms is dependent on the ": null
    },
    {
        "body plan": "https://en.wikipedia.org/wiki/Body_plan"
    },
    {
        " of the organism.": null
    },
    {
        "For example, especially in organisms without distinct heads for reasons of broader applicability, \"anterior\" is usually preferred.": null
    },
    {
        "As humans are approximately ": null
    },
    {
        "bilaterally symmetrical": "https://en.wikipedia.org/wiki/Symmetry_in_biology"
    },
    {
        " organisms, anatomical descriptions usually use the same terms as those for vertebrates and other members of the taxonomic group ": null
    },
    {
        "Bilateria": "https://en.wikipedia.org/wiki/Bilateria"
    },
    {
        ". However, for historical and other reasons, standard human directional terminology has several differences from that used for other bilaterally symmetrical organisms.": null
    },
    {
        "The terms of zootomy and anatomy came into use at a time when all scientific communication took place in Latin. In their original Latin forms the respective meanings of \"anterior\" and \"posterior\" are in front of (or before) and behind (or after), those of \"dorsal\" and \"ventral\" are toward the spine and toward the belly, and those of \"superior\" and \"inferior\" are above and below.": null
    },
    {
        "Humans, however, have the rare property of having an upright torso. This makes their anterior/posterior and dorsal/ventral directions the same, and the inferior/superior directions necessary.": null
    },
    {
        "Most animals, furthermore, are capable of moving relative to their environment. So while \"up\" might refer to the direction of a standing human's head, the same term (\"up\") might be used to refer to the direction of the belly of a ": null
    },
    {
        "supine": "https://en.wikipedia.org/wiki/Supine_position"
    },
    {
        " human. It is also necessary to employ some specific anatomical knowledge in order to apply the terminology unambiguously: For example, while the ears would be superior to (above) the shoulders in a human, this fails when describing the ": null
    },
    {
        "armadillo": "https://en.wikipedia.org/wiki/Armadillo"
    },
    {
        ", where the shoulders are above the ears. Thus, in ": null
    },
    {
        "veterinary": "https://en.wikipedia.org/wiki/Veterinary_medicine"
    },
    {
        " terminology, the ears would be cranial to (i.e., \"toward the head from\") the shoulders in the armadillo, the ": null
    },
    {
        "dog": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        ", the ": null
    },
    {
        "kangaroo": "https://en.wikipedia.org/wiki/Kangaroo"
    },
    {
        ", or any other ": null
    },
    {
        "terrestrial": "https://en.wiktionary.org/wiki/terrestrial"
    },
    {
        " vertebrate, including the human. Likewise, while the belly is considered anterior to (in front of) the back in humans, this terminology fails for the flounder, the armadillo, and the dog. In veterinary terms, the belly would be ventral (\"toward the abdomen\") in all vertebrates.": null
    },
    {
        "While it would be possible to introduce a system of axes that is completely consistent between humans and other vertebrates by having two separate pairs of axes, one used exclusively for the head (e.g., anterior/posterior and inferior/superior) and the other exclusively for the torso (e.g., dorsal/ventral and caudal/rostral, or \"toward the tail\"/\"toward the beak\"), doing so would require the renaming of many anatomical structures.": null
    },
    {
        "In organisms with a changeable shape, such as ": null
    },
    {
        "amoeboid": "https://en.wikipedia.org/wiki/Amoeboid"
    },
    {
        " organisms, most directional terms are meaningless, since the shape of the organism is not constant and no distinct axes are fixed. Similarly, in ": null
    },
    {
        "spherically symmetrical": "https://en.wikipedia.org/wiki/Spherical_symmetry"
    },
    {
        " organisms, there is nothing to distinguish one line through the centre of the organism from any other. An indefinite number of triads of mutually perpendicular axes could be defined, but any such choice of axes would be useless, as nothing would distinguish a chosen triad from any others. In such organisms, only terms such as superficial and deep, or sometimes proximal and distal, are usefully descriptive.": null
    },
    {
        "In organisms that maintain a constant shape and have one dimension longer than the other, at least two directional terms can be used. The long or longitudinal axis is defined by points at the opposite ends of the organism. Similarly, a perpendicular transverse axis can be defined by points on opposite sides of the organism. There is typically no basis for the definition of a third axis. Usually such organisms are ": null
    },
    {
        "planktonic": "https://en.wikipedia.org/wiki/Planktonic"
    },
    {
        " (free-swimming) ": null
    },
    {
        "protists": "https://en.wikipedia.org/wiki/Protists"
    },
    {
        ", and are nearly always viewed on ": null
    },
    {
        "microscope slides": "https://en.wikipedia.org/wiki/Microscope_slide"
    },
    {
        ", where they appear essentially two-dimensional. In some cases a third axis can be defined, particularly where a non-terminal ": null
    },
    {
        "cytostome": "https://en.wikipedia.org/wiki/Cytostome"
    },
    {
        " or other unique structure is present.": null
    },
    {
        "Some elongated ": null
    },
    {
        "protists": "https://en.wikipedia.org/wiki/Protists"
    },
    {
        " have distinctive ends of the body. In such organisms, the end with a mouth (or equivalent structure, such as the ": null
    },
    {
        "cytostome": "https://en.wikipedia.org/wiki/Cytostome"
    },
    {
        " in ": null
    },
    {
        "Paramecium": "https://en.wikipedia.org/wiki/Paramecium"
    },
    {
        " or ": null
    },
    {
        "Stentor": "https://en.wikipedia.org/wiki/Stentor"
    },
    {
        "), or the end that usually points in the direction of the organism's ": null
    },
    {
        "locomotion": "https://en.wikipedia.org/wiki/Animal_locomotion"
    },
    {
        " (such as the end with the ": null
    },
    {
        "flagellum": "https://en.wikipedia.org/wiki/Flagellum"
    },
    {
        " in ": null
    },
    {
        "Euglena": "https://en.wikipedia.org/wiki/Euglena"
    },
    {
        "), is normally designated as the anterior end. The opposite end then becomes the posterior end. Properly, this terminology would apply only to an organism that is always ": null
    },
    {
        "planktonic": "https://en.wikipedia.org/wiki/Planktonic"
    },
    {
        " (not normally attached to a surface), although the term can also be applied to one that is ": null
    },
    {
        "sessile": "https://en.wikipedia.org/wiki/Sessility_(zoology)"
    },
    {
        " (normally attached to a surface).": null
    },
    {
        "Organisms that are attached to a ": null
    },
    {
        "substrate": "https://en.wikipedia.org/wiki/Substrate_(biology)"
    },
    {
        ", such as ": null
    },
    {
        "sponges": "https://en.wikipedia.org/wiki/Porifera"
    },
    {
        ", or some ": null
    },
    {
        "animal-like protists": "https://en.wikipedia.org/wiki/Protista"
    },
    {
        " also have distinctive ends. The part of the organism attached to the substrate is usually referred to as the basal end (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " basis, meaning 'support/foundation'), whereas the end furthest from the attachment is referred to as the apical end (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " apex, meaning 'peak/tip').": null
    },
    {
        "Radially symmetrical organisms": "https://en.wikipedia.org/wiki/Radial_symmetry"
    },
    {
        " include those in the group ": null
    },
    {
        "Radiata": "https://en.wikipedia.org/wiki/Radiata"
    },
    {
        " –  primarily ": null
    },
    {
        "jellyfish, sea anemones and corals": "https://en.wikipedia.org/wiki/Cnidaria"
    },
    {
        " and the ": null
    },
    {
        "comb jellies": "https://en.wikipedia.org/wiki/Ctenophora"
    },
    {
        ". Adult ": null
    },
    {
        "echinoderms": "https://en.wikipedia.org/wiki/Echinodermata"
    },
    {
        ", such as ": null
    },
    {
        "starfish": "https://en.wikipedia.org/wiki/Starfish"
    },
    {
        ", ": null
    },
    {
        "sea urchins": "https://en.wikipedia.org/wiki/Sea_urchin"
    },
    {
        ", ": null
    },
    {
        "sea cucumbers": "https://en.wikipedia.org/wiki/Sea_cucumber"
    },
    {
        " and others are also included, since they are pentaradial, meaning they have five ": null
    },
    {
        "discrete rotational": "https://en.wikipedia.org/wiki/Rotational_symmetry#n-fold_rotational_symmetry"
    },
    {
        "symmetry": "https://en.wikipedia.org/wiki/Symmetry_(biology)"
    },
    {
        ". Echinoderm ": null
    },
    {
        "larvae": "https://en.wikipedia.org/wiki/Larva"
    },
    {
        " are not included, since they are ": null
    },
    {
        "bilaterally symmetrical": "https://en.wikipedia.org/wiki/Symmetry_in_biology"
    },
    {
        ". Radially symmetrical organisms always have one distinctive axis.": null
    },
    {
        "Cnidarians": "https://en.wikipedia.org/wiki/Cnidaria"
    },
    {
        " (jellyfish, sea anemones and corals) have an incomplete digestive system, meaning that one end of the organism has a mouth, and the opposite end has no opening from the gut (coelenteron). For this reason, the end of the organism with the mouth is referred to as the oral end (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " ōrālis, meaning 'of the mouth'), and the opposite surface is the aboral end (from ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin_language"
    },
    {
        " ab-, meaning 'away from').": null
    },
    {
        "Unlike vertebrates, cnidarians have no other distinctive axes. \"Lateral\", \"dorsal\", and \"ventral\" have no meaning in such organisms, and all can be replaced by the generic term peripheral (from ": null
    },
    {
        "Ancient Greek": "https://en.wikipedia.org/wiki/Ancient_Greek_language"
    },
    {
        " περιφέρεια, meaning 'circumference'). Medial can be used, but in the case of radiates indicates the central point, rather than a central axis as in vertebrates. Thus, there are multiple possible radial axes and medio-peripheral (half-) axes. However, it is noteworthy that some biradially symmetrical ": null
    },
    {
        "comb jellies": "https://en.wikipedia.org/wiki/Ctenophora"
    },
    {
        " do have distinct \"tentacular\" and \"pharyngeal\" axes and are thus anatomically equivalent to ": null
    },
    {
        "bilaterally symmetrical": "https://en.wikipedia.org/wiki/Bilateria"
    },
    {
        " animals.": null
    },
    {
        "As with vertebrates, ": null
    },
    {
        "appendages": "https://en.wikipedia.org/wiki/Appendage"
    },
    {
        " that move independently of the body (": null
    },
    {
        "tentacles": "https://en.wikipedia.org/wiki/Tentacles"
    },
    {
        " in ": null
    },
    {
        "cnidarians": "https://en.wikipedia.org/wiki/Cnidaria"
    },
    {
        " and ": null
    },
    {
        "comb jellies": "https://en.wikipedia.org/wiki/Ctenophora"
    },
    {
        "), have a definite proximodistal axis (Fig. 9).": null
    },
    {
        "Two specialized terms are useful in describing views of ": null
    },
    {
        "arachnid": "https://en.wikipedia.org/wiki/Arachnid"
    },
    {
        " legs and ": null
    },
    {
        "pedipalps": "https://en.wikipedia.org/wiki/Pedipalp"
    },
    {
        ". Prolateral refers to the surface of a leg that is closest to the anterior end of an arachnid's body. Retrolateral refers to the surface of a leg that is closest to the posterior end of an arachnid's body.": null
    },
    {
        "Because of the unusual nature and positions of the eyes of the ": null
    },
    {
        "Araneae": "https://en.wikipedia.org/wiki/Spider"
    },
    {
        " (spiders), and their importance in taxonomy, evolution and anatomy, special terminology with associated abbreviations has become established in arachnology. Araneae normally have eight eyes in four pairs. All the eyes are on the ": null
    },
    {
        "carapace": "https://en.wikipedia.org/wiki/Carapace"
    },
    {
        " of the ": null
    },
    {
        "prosoma": "https://en.wikipedia.org/wiki/Prosoma"
    },
    {
        ", and their sizes, shapes and locations are characteristic of various spider families and other ": null
    },
    {
        "taxa": "https://en.wikipedia.org/wiki/Taxon"
    },
    {
        ". In some taxa not all four pairs of eyes are present, the relevant species having only three, two, or one pair of eyes. Some species (mainly ": null
    },
    {
        "troglobites": "https://en.wikipedia.org/wiki/Troglobite"
    },
    {
        ") have no functional eyes at all.": null
    },
    {
        "In what is seen as the likeliest ancestral arrangement of the eyes of the Araneae, there are two roughly parallel, horizontal, symmetrical, transverse rows of eyes, each containing two symmetrically placed pairs, respectively called: anterior and posterior lateral eyes (ALE) and (PLE); and anterior and posterior median eyes (AME) and (PME).": null
    },
    {
        "As a rule it is not difficult to guess which eyes are which in a living or preserved specimen, but sometimes it can be. Apart from the fact that in some species one or more pairs may be missing, sometimes eyes from the posterior and anterior rows may be very close to each other, or even fused. Also, either one row or both might be so grossly curved that some of the notionally anterior eyes actually may lie posterior to some of the eyes in the posterior row. In some species the curve is so gross that the eyes apparently are arranged into two anteroposterior parallel rows of eyes.": null
    },
    {
        "Categories:": null
    }
]