[
    {
        "The stoat (Mustela erminea), also known as the short-tailed weasel or simply the weasel in ": null
    },
    {
        "Ireland": "https://en.wikipedia.org/wiki/Ireland"
    },
    {
        " where the ": null
    },
    {
        "least weasel": "https://en.wikipedia.org/wiki/Least_weasel"
    },
    {
        " does not live, is a mammal of the ": null
    },
    {
        "genus": "https://en.wikipedia.org/wiki/Genus"
    },
    {
        "Mustela of the ": null
    },
    {
        "family": "https://en.wikipedia.org/wiki/Family_(biology)"
    },
    {
        "Mustelidae": "https://en.wikipedia.org/wiki/Mustelidae"
    },
    {
        " native to ": null
    },
    {
        "Eurasia": "https://en.wikipedia.org/wiki/Eurasia"
    },
    {
        " and ": null
    },
    {
        "North America": "https://en.wikipedia.org/wiki/North_America"
    },
    {
        ", distinguished from the least weasel by its larger size and longer tail with a prominent black tip. Originally from Eurasia, it crossed into North America some 500,000 years ago, where it naturalized and joined the notably larger, closely related native ": null
    },
    {
        "long-tailed weasel": "https://en.wikipedia.org/wiki/Long-tailed_weasel"
    },
    {
        ".": null
    },
    {
        "The name ermine is used for any species in the genus ": null
    },
    {
        "Mustela": "https://en.wikipedia.org/wiki/Weasel"
    },
    {
        ", especially the stoat, in its pure white winter coat, or the fur thereof. In the late 19th century, stoats were ": null
    },
    {
        "introduced into New Zealand": "https://en.wikipedia.org/wiki/Stoats_in_New_Zealand"
    },
    {
        " to control rabbits, where they have had a devastating effect on native bird populations.": null
    },
    {
        "The stoat is classed by the ": null
    },
    {
        "International Union for Conservation of Nature": "https://en.wikipedia.org/wiki/International_Union_for_Conservation_of_Nature"
    },
    {
        " (IUCN) as ": null
    },
    {
        "least concern": "https://en.wikipedia.org/wiki/Least_concern"
    },
    {
        ", due to its wide circumpolar distribution, and because it does not face any significant threat to its survival. It was nominated as one of the world's top 100 \"worst invaders\".": null
    },
    {
        "Ermine luxury fur was used in the 15th century by ": null
    },
    {
        "Catholic monarchs": "https://en.wikipedia.org/wiki/Catholic_monarch"
    },
    {
        ", who sometimes used it as the ": null
    },
    {
        "mozzetta": "https://en.wikipedia.org/wiki/Mozzetta"
    },
    {
        " cape. It was also used in capes on images such as the ": null
    },
    {
        "Infant Jesus of Prague": "https://en.wikipedia.org/wiki/Infant_Jesus_of_Prague"
    },
    {
        ".": null
    },
    {
        "The ": null
    },
    {
        "root word": "https://en.wikipedia.org/wiki/Root_word"
    },
    {
        " for \"stoat\" is likely either the Dutch word stout (\"naughty\") or the ": null
    },
    {
        "Gothic": "https://en.wikipedia.org/wiki/Gothic_language"
    },
    {
        " word  (stautan, \"to push\"). According to ": null
    },
    {
        "John Guillim": "https://en.wikipedia.org/wiki/John_Guillim"
    },
    {
        ", in his Display of Heraldrie, the word \"ermine\" is likely derived from ": null
    },
    {
        "Armenia": "https://en.wikipedia.org/wiki/Armenia"
    },
    {
        ", the nation where it was thought the species originated, though other authors have linked it to the ": null
    },
    {
        "Norman French": "https://en.wikipedia.org/wiki/Norman_French"
    },
    {
        " from the ": null
    },
    {
        "Teutonic": "https://en.wikipedia.org/wiki/Teutonic_language"
    },
    {
        "harmin (": null
    },
    {
        "Anglo-Saxon": "https://en.wikipedia.org/wiki/Anglo_Saxon_language"
    },
    {
        "hearma). This seems to come from the ": null
    },
    {
        "Lithuanian": "https://en.wikipedia.org/wiki/Lithuanian_language"
    },
    {
        " word šarmu. In ": null
    },
    {
        "Ireland": "https://en.wikipedia.org/wiki/Ireland"
    },
    {
        " (where the least weasel does not occur), the stoat is referred to as a weasel, while in North America it is called a short-tailed weasel. A male stoat is called a dog, hob or jack, while a female is called a jill. The ": null
    },
    {
        "collective noun": "https://en.wikipedia.org/wiki/Collective_noun"
    },
    {
        " for stoats is either gang or pack.": null
    },
    {
        "The stoat's direct ancestor was Mustela palerminea, a common carnivore in central and eastern Europe during the ": null
    },
    {
        "Middle Pleistocene": "https://en.wikipedia.org/wiki/Middle_Pleistocene"
    },
    {
        ", that spread to North America during the late ": null
    },
    {
        "Blancan": "https://en.wikipedia.org/wiki/Blancan"
    },
    {
        " or early ": null
    },
    {
        "Irvingtonian": "https://en.wikipedia.org/wiki/Irvingtonian"
    },
    {
        ". The stoat is the product of a process begun 5–7 million years ago, when northern forests were replaced by open grassland, thus prompting an explosive evolution of small, burrowing rodents. The stoat's ancestors were larger than the current form, and underwent a reduction in size as they exploited the new food source. The stoat first arose in Eurasia, shortly after the ": null
    },
    {
        "long-tailed weasel": "https://en.wikipedia.org/wiki/Long-tailed_weasel"
    },
    {
        " arose as its mirror image in North America 2 million years ago. The stoat thrived during the ": null
    },
    {
        "Ice Age": "https://en.wikipedia.org/wiki/Ice_Age"
    },
    {
        ", as its small size and long body allowed it to easily operate beneath snow, as well as hunt in burrows. The stoat and the long-tailed weasel remained separated until 500,000 years ago, when falling ": null
    },
    {
        "sea levels": "https://en.wikipedia.org/wiki/Sea_level"
    },
    {
        " exposed the ": null
    },
    {
        "Bering land bridge": "https://en.wikipedia.org/wiki/Bering_land_bridge"
    },
    {
        ".": null
    },
    {
        "Combined ": null
    },
    {
        "phylogenetic": "https://en.wikipedia.org/wiki/Phylogenetics"
    },
    {
        " analyses indicate the stoat's closest living relative is the ": null
    },
    {
        "mountain weasel": "https://en.wikipedia.org/wiki/Mountain_weasel"
    },
    {
        " (Mustela altaica), though it is also closely related to the ": null
    },
    {
        "least weasel": "https://en.wikipedia.org/wiki/Least_weasel"
    },
    {
        " (Mustela nivalis) and long-tailed weasel (Mustela frenata). Its next closest relatives are the ": null
    },
    {
        "New World": "https://en.wikipedia.org/wiki/New_World"
    },
    {
        "Colombian weasel": "https://en.wikipedia.org/wiki/Colombian_weasel"
    },
    {
        " (Mustela felipei) and the ": null
    },
    {
        "Amazon weasel": "https://en.wikipedia.org/wiki/Amazon_weasel"
    },
    {
        " (Mustela africana).": null
    },
    {
        "As of 2005, 37 ": null
    },
    {
        "subspecies": "https://en.wikipedia.org/wiki/Subspecies"
    },
    {
        " are recognized.": null
    },
    {
        "The stoat is entirely similar to the least weasel in general proportions, manner of posture, and movement, though the tail is relatively longer, always exceeding a third of the body length, though it is shorter than that of the long-tailed weasel. The stoat has an elongated neck, the head being set exceptionally far in front of the shoulders. The trunk is nearly cylindrical, and does not bulge at the abdomen. The greatest circumference of body is littlemore than half its length. The skull, although very similar to that of the least weasel, is relatively longer, with a narrower ": null
    },
    {
        "braincase": "https://en.wikipedia.org/wiki/Braincase"
    },
    {
        ". The projections of the skull and teeth are weakly developed, but stronger than those of the least weasel. The eyes are round, black and protrude slightly. The ": null
    },
    {
        "whiskers": "https://en.wikipedia.org/wiki/Whiskers"
    },
    {
        " are brown or white in colour, and very long. The ears are short, rounded and lie almost flattened against the skull. The claws are not retractable, and are large in proportion to the digits. Each foot has five toes. The male stoat has a curved ": null
    },
    {
        "baculum": "https://en.wikipedia.org/wiki/Baculum"
    },
    {
        " with a proximal knob that increases in weight as it ages.": null
    },
    {
        "Fat": "https://en.wikipedia.org/wiki/Fat"
    },
    {
        " is deposited primarily along the spine and kidneys, then on gut mesenteries, under the limbs and around the shoulders. The stoat has four pairs of nipples, though they are visible only in females.": null
    },
    {
        "The dimensions of the stoat are variable, but not as significantly as the least weasel's. Unusual among the Carnivora, the size of stoats tends to decrease proportionally with latitude, in contradiction to ": null
    },
    {
        "Bergmann's rule": "https://en.wikipedia.org/wiki/Bergmann%27s_rule"
    },
    {
        ".": null
    },
    {
        "Sexual dimorphism": "https://en.wikipedia.org/wiki/Sexual_dimorphism"
    },
    {
        " in size is pronounced, with males being roughly 25% larger than females and 1.5-2.0 times their weight. On average, males measure 187–325 mm (7.4–12.8 in) in body length, while females measure 170–270 mm (6.7–10.6 in). The tail measures 75–120 mm (3.0–4.7 in) in males and 65–106 mm (2.6–4.2 in) in females. In males, the hind foot measures 40.0–48.2 mm (1.57–1.90 in), while in females it is 37.0–47.6 mm (1.46–1.87 in). The height of the ear measures 18.0–23.2 mm (0.71–0.91 in) in males and 14.0–23.3 mm (0.55–0.92 in). The skulls of males measure 39.3–52.2 mm (1.55–2.06 in) in length, while those of females measure 35.7–45.8 mm (1.41–1.80 in). Males average 258 grams (9.1 oz) in weight, while females weigh less than 180 grams (6.3 oz).": null
    },
    {
        "The stoat has large anal ": null
    },
    {
        "scent glands": "https://en.wikipedia.org/wiki/Scent_gland"
    },
    {
        " measuring 8.5 mm × 5 mm (0.33 in × 0.20 in) in males and smaller in females. Scent glands are also present on the cheeks, belly and flanks.": null
    },
    {
        "Epidermal": "https://en.wikipedia.org/wiki/Epidermis_(zoology)"
    },
    {
        " secretions, which are deposited during body rubbing, are chemically distinct from the products of the anal scent glands, which contain a higher proportion of volatile chemicals. When attacked or being aggressive, the stoat secretes the contents of its anal glands, giving rise to a strong, musky odour produced by several sulphuric compounds. The odour is distinct from that of least weasels.": null
    },
    {
        "The winter fur is very dense and silky, but quite closely lying and short, while the summer fur is rougher, shorter and sparse. In summer, the fur is sandy-brown on the back and head and a white below. The division between the dark back and the light belly is usually straight, though this trait is only present in 13.5% of Irish stoats. The stoat moults twice a year. In spring, the moult is slow, starting from the forehead, across the back, toward the belly. In autumn, the moult is quicker, progressing in the reverse direction. The moult, initiated by ": null
    },
    {
        "photoperiod": "https://en.wikipedia.org/wiki/Photoperiod"
    },
    {
        ", starts earlier in autumn and later in spring at higher latitudes. In the stoat's northern range, it adopts a completely white coat (save for the black tail-tip) during the winter period. Differences in the winter and summer coats are less apparent in southern forms of the species. In the species' southern range, the coat remains brown, but is denser and sometimes paler than in summer.": null
    },
    {
        "In the Northern Hemisphere, mating occurs in the April–July period. In spring, the male's ": null
    },
    {
        "testes": "https://en.wikipedia.org/wiki/Testes"
    },
    {
        " are enlarged, a process accompanied by an increase of ": null
    },
    {
        "testosterone": "https://en.wikipedia.org/wiki/Testosterone"
    },
    {
        " concentration in the ": null
    },
    {
        "plasma": "https://en.wikipedia.org/wiki/Blood_plasma"
    },
    {
        ". ": null
    },
    {
        "Spermatogenesis": "https://en.wikipedia.org/wiki/Spermatogenesis"
    },
    {
        " occurs in December, and the males are fertile from May to August, after which the testes regress. Female stoats are usually only ": null
    },
    {
        "in heat": "https://en.wikipedia.org/wiki/Estrous_cycle"
    },
    {
        " for a brief period, which is triggered by changes in day length.": null
    },
    {
        "Copulation": "https://en.wikipedia.org/wiki/Copulation_(zoology)"
    },
    {
        " can last as long as 1 hour. Stoats are not ": null
    },
    {
        "monogamous": "https://en.wikipedia.org/wiki/Monogamous"
    },
    {
        ", with litters often being of mixed paternity. Stoats undergo ": null
    },
    {
        "embryonic diapause": "https://en.wikipedia.org/wiki/Embryonic_diapause"
    },
    {
        ", meaning that the embryo does not immediately implant in the uterus after fertilization, but rather lies dormant for a period of nine to ten months. The ": null
    },
    {
        "gestation period": "https://en.wikipedia.org/wiki/Gestation_period"
    },
    {
        " is therefore variable but typically around 300 days, and after mating in the summer, the offspring will not be born until the following spring – female stoats spend almost all their lives either pregnant or in heat. Females can reabsorb embryos and in the event of a severe winter they may reabsorb their entire litter. Males play no part in rearing the young, which are born blind, deaf, toothless and covered in fine white or pinkish down. The ": null
    },
    {
        "milk teeth": "https://en.wikipedia.org/wiki/Milk_teeth"
    },
    {
        " erupt after three weeks, and solid food is eaten after four weeks. The eyes open after five to six weeks, with the black tail-tip appearing a week later. ": null
    },
    {
        "Lactation": "https://en.wikipedia.org/wiki/Lactation"
    },
    {
        " ends after 12 weeks. Prior to the age of five to seven weeks, kits have poor ": null
    },
    {
        "thermoregulation": "https://en.wikipedia.org/wiki/Thermoregulation"
    },
    {
        ", so they huddle for warmth when the mother is absent. Males become sexually mature at 10–11 months, while females are sexually mature at the age of 2–3 weeks whilst still blind, deaf and hairless, and are usually mated with adult males before being ": null
    },
    {
        "weaned": "https://en.wikipedia.org/wiki/Weaning"
    },
    {
        ".": null
    },
    {
        "Stoat territoriality has a generally mustelid spacing pattern, with male territories encompassing smaller female territories, which they defend from other males. The size of the territory and the ranging behaviour of its occupants varies seasonally, depending on the abundance of food and mates. During the breeding season, the ranges of females remain unchanged, while males either become roamers, strayers or transients. Dominant older males have territories 50 times larger than those of younger, socially inferior males. Both sexes ": null
    },
    {
        "mark their territories": "https://en.wikipedia.org/wiki/Territorial_marking"
    },
    {
        " with ": null
    },
    {
        "urine": "https://en.wikipedia.org/wiki/Urine"
    },
    {
        ", ": null
    },
    {
        "faeces": "https://en.wikipedia.org/wiki/Faeces"
    },
    {
        " and two types of ": null
    },
    {
        "scent marks": "https://en.wikipedia.org/wiki/Scent_mark"
    },
    {
        "; anal drags are meant to convey territorial occupancy, and body rubbing is associated with agonistic encounters.": null
    },
    {
        "The stoat does not dig its own burrows, instead using the burrows and nest chambers of the rodents it kills. The skins and underfur of rodent prey are used to line the nest chamber. The nest chamber is sometimes located in seemingly unsuitable places, such as among logs piled against the walls of houses. The stoat also inhabits old and rotting stumps, under tree roots, in heaps of brushwood, haystacks, in bog hummocks, in the cracks of vacant mud buildings, in rock piles, rock clefts, and even in ": null
    },
    {
        "magpie": "https://en.wikipedia.org/wiki/Magpie"
    },
    {
        " nests. Males and females typically live apart, but close to each other. Each stoat has several dens dispersed within its range. A single den has several galleries, mainly within 30 cm (12 in) of the surface.": null
    },
    {
        "As with the least weasel, mouse-like rodents predominate in the stoat's diet. However, unlike the least weasel, which almost exclusively feeds on small ": null
    },
    {
        "voles": "https://en.wikipedia.org/wiki/Vole"
    },
    {
        ", the stoat regularly preys on larger rodent and ": null
    },
    {
        "lagomorph": "https://en.wikipedia.org/wiki/Lagomorph"
    },
    {
        " species, and will take down individuals far larger than itself. In Russia, its prey includes rodents and lagomorphs such as ": null
    },
    {
        "European water voles": "https://en.wikipedia.org/wiki/European_water_vole"
    },
    {
        ", ": null
    },
    {
        "common hamsters": "https://en.wikipedia.org/wiki/Common_hamster"
    },
    {
        ", ": null
    },
    {
        "pikas": "https://en.wikipedia.org/wiki/Pika"
    },
    {
        ", and others, which it overpowers in their burrows. Prey species of secondary importance include small ": null
    },
    {
        "birds": "https://en.wikipedia.org/wiki/Bird"
    },
    {
        ", ": null
    },
    {
        "fish": "https://en.wikipedia.org/wiki/Fish"
    },
    {
        ", and ": null
    },
    {
        "shrews": "https://en.wikipedia.org/wiki/Shrew"
    },
    {
        " and, more rarely, ": null
    },
    {
        "amphibians": "https://en.wikipedia.org/wiki/Amphibian"
    },
    {
        ", ": null
    },
    {
        "lizards": "https://en.wikipedia.org/wiki/Lizard"
    },
    {
        ", and ": null
    },
    {
        "insects": "https://en.wikipedia.org/wiki/Insect"
    },
    {
        ". In Great Britain, ": null
    },
    {
        "European rabbits": "https://en.wikipedia.org/wiki/European_rabbit"
    },
    {
        " are an important food source, with the frequency in which stoats prey on them having increased between the 1960s and mid 1990s since the end of the ": null
    },
    {
        "myxomatosis": "https://en.wikipedia.org/wiki/Myxomatosis"
    },
    {
        " epidemic. Typically, male stoats prey on rabbits more frequently than females do, which depend to a greater extent on smaller rodent species. British stoats rarely kill shrews, ": null
    },
    {
        "rats": "https://en.wikipedia.org/wiki/Rat"
    },
    {
        ", ": null
    },
    {
        "squirrels": "https://en.wikipedia.org/wiki/Squirrel"
    },
    {
        " and water voles, though rats may be an important food source locally. In Ireland, shrews and rats are frequently eaten. In mainland Europe, water voles make up a large portion of the stoat's diet. ": null
    },
    {
        "Hares": "https://en.wikipedia.org/wiki/Hare"
    },
    {
        " are sometimes taken, but are usually young specimens. In North America, where the ": null
    },
    {
        "ecological niche": "https://en.wikipedia.org/wiki/Ecological_niche"
    },
    {
        " for rat and rabbit sized prey is taken by the larger long-tailed weasel, the stoat preys on mice, voles, shrews, and young ": null
    },
    {
        "cottontails": "https://en.wikipedia.org/wiki/Cottontail"
    },
    {
        ". In New Zealand, the stoat feeds principally on birds, including the rare ": null
    },
    {
        "kiwi": "https://en.wikipedia.org/wiki/Kiwi"
    },
    {
        ", ": null
    },
    {
        "kaka": "https://en.wikipedia.org/wiki/New_Zealand_kaka"
    },
    {
        ", ": null
    },
    {
        "mohua": "https://en.wikipedia.org/wiki/Yellowhead_(bird)"
    },
    {
        ", ": null
    },
    {
        "yellow-crowned parakeet": "https://en.wikipedia.org/wiki/Yellow-crowned_parakeet"
    },
    {
        ", and ": null
    },
    {
        "New Zealand dotterel": "https://en.wikipedia.org/wiki/New_Zealand_dotterel"
    },
    {
        ". Cases are known of stoats preying on young ": null
    },
    {
        "muskrats": "https://en.wikipedia.org/wiki/Muskrat"
    },
    {
        ". The stoat typically eats about 50 grams (1.8 oz) of food a day, which is equivalent to 25% of the animal's live weight.": null
    },
    {
        "The stoat is an opportunistic predator, which moves rapidly and checks every available burrow or crevice for food. Because of their larger size, male stoats are less successful than females in pursuing rodents far into tunnels. Stoats regularly climb trees to gain access to birds' nests, and are common raiders of nest boxes, particularly those of large species. The stoat reputedly mesmerises prey such as rabbits by a \"dance\" (sometimes called the ": null
    },
    {
        "weasel war dance": "https://en.wikipedia.org/wiki/Weasel_war_dance"
    },
    {
        "), though this behaviour could be linked to ": null
    },
    {
        "Skrjabingylus": "https://en.wikipedia.org/wiki/Metastrongylidae"
    },
    {
        " infections. The stoat seeks to immobilize large prey such as rabbits with a bite to the spine at the back of the neck. The stoat may ": null
    },
    {
        "surplus kill": "https://en.wikipedia.org/wiki/Surplus_killing"
    },
    {
        " when the opportunity arises, though excess prey is usually cached and eaten later to avoid ": null
    },
    {
        "obesity": "https://en.wikipedia.org/wiki/Obesity"
    },
    {
        ", as overweight stoats tend to be at a disadvantage when pursuing prey into their burrows. Small prey typically die instantly from a bite to the back of the neck, while larger prey, such as rabbits, typically die of ": null
    },
    {
        "shock": "https://en.wikipedia.org/wiki/Shock_(circulatory)"
    },
    {
        ", as the stoat's canine teeth are too short to reach the spinal column or major arteries.": null
    },
    {
        "The stoat is a usually silent animal, but can produce a range of sounds similar to those of the least weasel. Kits produce a fine chirping noise. Adults trill excitedly before mating, and indicate submission through quiet trilling, whining and squealing. When nervous, the stoat hisses, and will intersperse this with sharp barks or shrieks and prolonged screeching when aggressive.": null
    },
    {
        "Aggressive behaviour in stoats is categorised in these forms:": null
    },
    {
        "Submissive stoats express their status by avoiding higher-ranking animals, fleeing from them or making whining or squealing sounds.": null
    },
    {
        "The stoat has a ": null
    },
    {
        "circumboreal": "https://en.wikipedia.org/wiki/Circumboreal"
    },
    {
        " range throughout ": null
    },
    {
        "North America": "https://en.wikipedia.org/wiki/North_America"
    },
    {
        ", ": null
    },
    {
        "Europe": "https://en.wikipedia.org/wiki/Europe"
    },
    {
        ", and ": null
    },
    {
        "Asia": "https://en.wikipedia.org/wiki/Asia"
    },
    {
        ", from ": null
    },
    {
        "Greenland": "https://en.wikipedia.org/wiki/Greenland"
    },
    {
        " and the Canadian and Siberian Arctic islands south to about 35°N. Stoats in North America are found throughout ": null
    },
    {
        "Alaska": "https://en.wikipedia.org/wiki/Alaska"
    },
    {
        " and ": null
    },
    {
        "Canada": "https://en.wikipedia.org/wiki/Canada"
    },
    {
        " south through most of the northern ": null
    },
    {
        "United States": "https://en.wikipedia.org/wiki/United_States"
    },
    {
        " to central ": null
    },
    {
        "California": "https://en.wikipedia.org/wiki/California"
    },
    {
        ", northern ": null
    },
    {
        "Arizona": "https://en.wikipedia.org/wiki/Arizona"
    },
    {
        ", northern ": null
    },
    {
        "New Mexico": "https://en.wikipedia.org/wiki/New_Mexico"
    },
    {
        ", ": null
    },
    {
        "Iowa": "https://en.wikipedia.org/wiki/Iowa"
    },
    {
        ", the ": null
    },
    {
        "Great Lakes": "https://en.wikipedia.org/wiki/Great_Lakes"
    },
    {
        " region, ": null
    },
    {
        "New England": "https://en.wikipedia.org/wiki/New_England"
    },
    {
        ", and ": null
    },
    {
        "Pennsylvania": "https://en.wikipedia.org/wiki/Pennsylvania"
    },
    {
        ", but are absent from most of the ": null
    },
    {
        "Great Plains": "https://en.wikipedia.org/wiki/Great_Plains"
    },
    {
        ", and the ": null
    },
    {
        "Southeastern United States": "https://en.wikipedia.org/wiki/Southeastern_United_States"
    },
    {
        ". The stoat in Europe is found as far south as 41ºN in ": null
    },
    {
        "Portugal": "https://en.wikipedia.org/wiki/Portugal"
    },
    {
        ", and inhabits most islands with the exception of ": null
    },
    {
        "Iceland": "https://en.wikipedia.org/wiki/Iceland"
    },
    {
        ", ": null
    },
    {
        "Svalbard": "https://en.wikipedia.org/wiki/Svalbard"
    },
    {
        ", the ": null
    },
    {
        "Mediterranean": "https://en.wikipedia.org/wiki/Mediterranean"
    },
    {
        " islands and some small ": null
    },
    {
        "North Atlantic": "https://en.wikipedia.org/wiki/North_Atlantic"
    },
    {
        " islands. In ": null
    },
    {
        "Japan": "https://en.wikipedia.org/wiki/Japan"
    },
    {
        ", it is present in central mountains (northern and central ": null
    },
    {
        "Japan Alps": "https://en.wikipedia.org/wiki/Japan_Alps"
    },
    {
        ") to northern part of ": null
    },
    {
        "Honshu": "https://en.wikipedia.org/wiki/Honshu"
    },
    {
        " (primarily above 1,200 m) and Hokkaido. Its vertical range is from sea level to 3,000 m.": null
    },
    {
        "Stoats were introduced into ": null
    },
    {
        "New Zealand": "https://en.wikipedia.org/wiki/New_Zealand"
    },
    {
        " during the late 19th century to control rabbits and hares, but are now a major threat to native bird populations. The introduction of stoats was opposed by scientists in New Zealand and Britain, including the New Zealand ornithologist ": null
    },
    {
        "Walter Buller": "https://en.wikipedia.org/wiki/Walter_Buller"
    },
    {
        ". The warnings were ignored and stoats began to be introduced from Britain in the 1880s, resulting in a noticeable decline in bird populations within six years. Stoats are a serious threat to ground- and hole-nesting birds, since the latter have very few means of escaping predation. The highest rates of stoat predation occur after seasonal gluts in southern ": null
    },
    {
        "beechmast": "https://en.wikipedia.org/wiki/Beechmast"
    },
    {
        " (beechnuts), which encourage the reproduction of rodents on which stoats also feed, encouraging stoats to increase their own numbers. For instance, the endangered ": null
    },
    {
        "South Island takahē": "https://en.wikipedia.org/wiki/South_Island_takah%C4%93"
    },
    {
        "'s wild population dropped by a third between 2006 and 2007, after a stoat plague triggered by the 2005–06 ": null
    },
    {
        "mast": "https://en.wikipedia.org/wiki/Mast_(botany)"
    },
    {
        " wiped out more than half the takahē in untrapped areas.": null
    },
    {
        "Tuberculosis": "https://en.wikipedia.org/wiki/Tuberculosis"
    },
    {
        " has been recorded in stoats inhabiting the former Soviet Union and New Zealand. They are largely resistant to ": null
    },
    {
        "tularemia": "https://en.wikipedia.org/wiki/Tularemia"
    },
    {
        ", but are reputed to suffer from ": null
    },
    {
        "canine distemper": "https://en.wikipedia.org/wiki/Canine_distemper"
    },
    {
        " in captivity. Symptoms of ": null
    },
    {
        "mange": "https://en.wikipedia.org/wiki/Mange"
    },
    {
        " have also been recorded.": null
    },
    {
        "Stoats are vulnerable to ": null
    },
    {
        "ectoparasites": "https://en.wikipedia.org/wiki/Ectoparasite"
    },
    {
        " associated with their prey and the nests of other animals on which they do not prey. The ": null
    },
    {
        "louse": "https://en.wikipedia.org/wiki/Louse"
    },
    {
        "Trichodectes erminea is recorded in stoats living in Canada, Ireland and New Zealand. In continental Europe, 26 ": null
    },
    {
        "flea": "https://en.wikipedia.org/wiki/Flea"
    },
    {
        " species are recorded to infest stoats, including Rhadinospylla pentacantha, Megabothris rectangulatus, Orchopeas howardi, Spilopsyllus ciniculus, Ctenophthalamus nobilis, ": null
    },
    {
        "Dasypsyllus gallinulae": "https://en.wikipedia.org/wiki/Moorhen_flea"
    },
    {
        ", ": null
    },
    {
        "Nosopsyllus fasciatus": "https://en.wikipedia.org/wiki/Northern_rat_flea"
    },
    {
        ", Leptospylla segnis, Ceratophyllus gallinae, Parapsyllus n. nestoris, Amphipsylla kuznetzovi and Ctenopsyllus bidentatus. ": null
    },
    {
        "Tick": "https://en.wikipedia.org/wiki/Tick"
    },
    {
        " species known to infest stoats are Ixodes canisuga, ": null
    },
    {
        "I. hexagonus": "https://en.wikipedia.org/wiki/Ixodes_hexagonus"
    },
    {
        ", and ": null
    },
    {
        "I. ricinus": "https://en.wikipedia.org/wiki/Ixodes_ricinus"
    },
    {
        " and ": null
    },
    {
        "Haemaphysalis longicornis": "https://en.wikipedia.org/wiki/Haemaphysalis_longicornis"
    },
    {
        ". Louse species known to infest stoats include Mysidea picae and ": null
    },
    {
        "Polyplax spinulosa": "https://en.wikipedia.org/wiki/Polyplax_spinulosa"
    },
    {
        ". ": null
    },
    {
        "Mite": "https://en.wikipedia.org/wiki/Mite"
    },
    {
        " species known to infest stoats include ": null
    },
    {
        "Neotrombicula autumnalis": "https://en.wikipedia.org/wiki/Neotrombicula"
    },
    {
        ", ": null
    },
    {
        "Demodex erminae": "https://en.wikipedia.org/wiki/Demodex"
    },
    {
        ", ": null
    },
    {
        "Eulaelaps stabulans": "https://en.wikipedia.org/wiki/Eulaelaps"
    },
    {
        ", Gymnolaelaps annectans, Hypoaspis nidicorva, and ": null
    },
    {
        "Listrophorus mustelae": "https://en.wikipedia.org/wiki/Listrophorus"
    },
    {
        ".": null
    },
    {
        "The ": null
    },
    {
        "nematode": "https://en.wikipedia.org/wiki/Nematode"
    },
    {
        "Skrjabingylus nasicola": "https://en.wikipedia.org/wiki/Skrjabingylus_nasicola"
    },
    {
        " is particularly threatening to stoats, as it erodes the bones of the ": null
    },
    {
        "nasal sinuses": "https://en.wikipedia.org/wiki/Nasal_sinus"
    },
    {
        " and decreases fertility. Other nematode species known to infect stoats include ": null
    },
    {
        "Capillaria putorii": "https://en.wikipedia.org/wiki/Capillaria_(genus)"
    },
    {
        ", Molineus patens and Strongyloides martes. ": null
    },
    {
        "Cestode": "https://en.wikipedia.org/wiki/Cestode"
    },
    {
        " species known to infect stoats include ": null
    },
    {
        "Taenia tenuicollis": "https://en.wikipedia.org/wiki/Taenia_(tapeworm)"
    },
    {
        ", Mesocestoides lineatus and rarely ": null
    },
    {
        "Acanthocephala": "https://en.wikipedia.org/wiki/Acanthocephala"
    },
    {
        ".": null
    },
    {
        "In ": null
    },
    {
        "Irish mythology": "https://en.wikipedia.org/wiki/Irish_mythology"
    },
    {
        ", stoats were viewed ": null
    },
    {
        "anthropomorphically": "https://en.wikipedia.org/wiki/Anthropomorphism"
    },
    {
        " as animals with families, which held rituals for their dead. They were also viewed as noxious animals prone to thieving, and their saliva was said to be able to poison a grown man. To encounter a stoat when setting out for a journey was considered bad luck, but one could avert this by greeting the stoat as a neighbour. Stoats were also supposed to hold the souls of infants who died before ": null
    },
    {
        "baptism": "https://en.wikipedia.org/wiki/Baptism"
    },
    {
        ". In the folklore of the ": null
    },
    {
        "Komi people": "https://en.wikipedia.org/wiki/Komi_people"
    },
    {
        " of the ": null
    },
    {
        "Urals": "https://en.wikipedia.org/wiki/Urals"
    },
    {
        ", stoats are symbolic of beautiful and coveted young women. In the ": null
    },
    {
        "Zoroastrian": "https://en.wikipedia.org/wiki/Zoroastrianism"
    },
    {
        " religion, the stoat is considered a sacred animal, as its white winter coat represented purity. Similarly, ": null
    },
    {
        "Mary Magdalene": "https://en.wikipedia.org/wiki/Mary_Magdalene"
    },
    {
        " was depicted as wearing a white stoat pelt as a sign of her reformed character. One popular European legend had it that a white stoat would die before allowing its pure white coat to be besmirched. When it was being chased by hunters, it would supposedly turn around and give itself up to the hunters rather than risk soiling itself. The former nation (now province) of ": null
    },
    {
        "Brittany": "https://en.wikipedia.org/wiki/Brittany"
    },
    {
        " in France uses a stylized ermine-fur pattern in forming the Coat of Arms and ": null
    },
    {
        "Flag of Brittany": "https://en.wikipedia.org/wiki/Flag_of_Brittany"
    },
    {
        ". ": null
    },
    {
        "Gilles Servat": "https://en.wikipedia.org/wiki/Gilles_Servat"
    },
    {
        "'s song La blanche Hermine (\"The White Ermine\") became an ": null
    },
    {
        "anthem": "https://en.wikipedia.org/wiki/Anthem"
    },
    {
        " for ": null
    },
    {
        "Bretons": "https://en.wikipedia.org/wiki/Bretons"
    },
    {
        " (and is popular among French people in general).": null
    },
    {
        "Stoat skins are prized by the fur trade, especially in winter coat, and used to trim coats and stoles. The fur from the winter coat is referred to as ermine and is the traditional ancient symbol of the ": null
    },
    {
        "Duchy of Brittany": "https://en.wikipedia.org/wiki/Duchy_of_Brittany"
    },
    {
        " forming the earliest flag of that nation. There is also a design called ": null
    },
    {
        "ermine": "https://en.wikipedia.org/wiki/Ermine_(heraldry)"
    },
    {
        " inspired by the winter coat of the stoat and painted onto other furs, such as rabbit. In Europe these furs are a symbol of royalty and high status; the ceremonial robes of members of the ": null
    },
    {
        "UK": "https://en.wikipedia.org/wiki/United_Kingdom"
    },
    {
        "House of Lords": "https://en.wikipedia.org/wiki/House_of_Lords"
    },
    {
        " and the ": null
    },
    {
        "academic hoods of the universities of Oxford": "https://en.wikipedia.org/wiki/Academic_dress_of_the_University_of_Oxford"
    },
    {
        " and ": null
    },
    {
        "Cambridge": "https://en.wikipedia.org/wiki/Academic_dress_of_the_University_of_Cambridge"
    },
    {
        " are traditionally trimmed with ermine although in practice rabbit or fake fur is now often used instead due to expense or ": null
    },
    {
        "animal rights": "https://en.wikipedia.org/wiki/Animal_rights"
    },
    {
        " concerns. ": null
    },
    {
        "Prelates": "https://en.wikipedia.org/wiki/Prelates"
    },
    {
        " of the Catholic Church still wear ecclesiastical garments featuring ermine (a sign of their status equal to that of the nobility). ": null
    },
    {
        "Cecilia Gallerani": "https://en.wikipedia.org/wiki/Cecilia_Gallerani"
    },
    {
        " is depicted holding an ermine in her portrait, ": null
    },
    {
        "Lady with an Ermine": "https://en.wikipedia.org/wiki/Lady_with_an_Ermine"
    },
    {
        ", by ": null
    },
    {
        "Leonardo da Vinci": "https://en.wikipedia.org/wiki/Leonardo_da_Vinci"
    },
    {
        ". ": null
    },
    {
        "Henry Peacham": "https://en.wikipedia.org/wiki/Henry_Peacham_(born_1578)"
    },
    {
        "'s Emblem 75, which depicts an ermine being pursued by a hunter and two hounds, is entitled \"Cui candor morte redemptus\" (\"Purity bought with his own death\"). Peacham goes on to preach that men and women should follow the example of the ermine and keep their minds and consciences as pure as the legendary ermine keeps its fur.": null
    },
    {
        "Ermine were also valued by the ": null
    },
    {
        "Tlingit": "https://en.wikipedia.org/wiki/Tlingit"
    },
    {
        " and other ": null
    },
    {
        "indigenous peoples of the Pacific Northwest Coast": "https://en.wikipedia.org/wiki/Indigenous_peoples_of_the_Pacific_Northwest_Coast"
    },
    {
        ". They could be attached to traditional regalia and cedar bark hats as status symbols, or they were also made into shirts.": null
    },
    {
        "The stoat was a fundamental item in the fur trade of the ": null
    },
    {
        "Soviet Union": "https://en.wikipedia.org/wiki/Soviet_Union"
    },
    {
        ", with no less than half the global catch coming from within its borders. The Soviet Union also contained the highest grades of stoat pelts, with the best grade North American pelts being comparable only to the 9th grade in the quality criteria of former Soviet stoat standards. However, stoat harvesting never became a specialty in any Soviet republic, with most stoats being captured incidentally in traps or near villages. Stoats in the Soviet Union were captured either with dogs or with box-traps or jaw-traps. Guns were rarely used, as they could damage the pelt.": null
    }
]