[
    {
        "The Maine Coon is the largest domesticated ": null
    },
    {
        "cat breed": "https://en.wikipedia.org/wiki/Breeds_of_cats"
    },
    {
        ". It has a distinctive physical appearance and valuable hunting skills. It is one of the oldest ": null
    },
    {
        "natural breeds": "https://en.wikipedia.org/wiki/Natural_breed"
    },
    {
        " in North America, specifically ": null
    },
    {
        "native": "https://en.wikipedia.org/wiki/Indigenous_(ecology)"
    },
    {
        " to the state of ": null
    },
    {
        "Maine": "https://en.wikipedia.org/wiki/Maine"
    },
    {
        ", where it is the official ": null
    },
    {
        "state cat": "https://en.wikipedia.org/wiki/List_of_U.S._state_pets"
    },
    {
        ".": null
    },
    {
        "No records of the Maine Coon's exact origins and date of introduction to the United States exist, so several competing hypotheses have been suggested. The breed was popular in cat shows in the late 19th century, but its existence became threatened when long-haired breeds from overseas were introduced in the early 20th century. The Maine Coon has since made a comeback and is now one of the more popular cat breeds in the USA.": null
    },
    {
        "The Maine Coon is a large and sociable cat, hence its nickname, \"the gentle giant.\" It is characterized by a prominent ruff along its chest, robust bone structure, rectangular body shape, an uneven two layered coat with longer guard hairs with a silky satin under layer undercoat, and a long, bushy tail.  The breed's colors vary widely, with only lilac and chocolate disallowed for pedigree.  Reputed for its intelligence and playful, gentle personality, the Maine Coon is often cited as having \"": null
    },
    {
        "dog-like": "https://en.wikipedia.org/wiki/Dog-like_cat"
    },
    {
        "\" characteristics. Professionals notice certain health problems in the breed including ": null
    },
    {
        "feline hypertrophic cardiomyopathy": "https://en.wikipedia.org/wiki/Hypertrophic_cardiomyopathy"
    },
    {
        " and ": null
    },
    {
        "hip dysplasia": "https://en.wikipedia.org/wiki/Hip_dysplasia_(canine)"
    },
    {
        ", but reputable breeders use modern screening methods to minimize the frequency of these problems.": null
    },
    {
        "The ancestral origins of the Maine Coon are unknown — there are only speculation and ": null
    },
    {
        "folk tales": "https://en.wikipedia.org/wiki/Folklore"
    },
    {
        ". One such folk tale involves ": null
    },
    {
        "Marie Antoinette": "https://en.wikipedia.org/wiki/Marie_Antoinette"
    },
    {
        ", the ": null
    },
    {
        "Queen of France": "https://en.wikipedia.org/wiki/List_of_Queens_and_Empresses_of_France"
    },
    {
        ", who was executed in 1793. The story goes that before her death, Antoinette attempted to escape France with the help of Captain Samuel Clough. She loaded Clough's ship with her most prized possessions, including six of her favorite ": null
    },
    {
        "Turkish Angora": "https://en.wikipedia.org/wiki/Turkish_Angora"
    },
    {
        " cats. Although she did not make it to the United States, her pets safely reached the shores of ": null
    },
    {
        "Wiscasset": "https://en.wikipedia.org/wiki/Wiscasset,_Maine"
    },
    {
        ", Maine, where they bred with other short-haired breeds and developed into the modern breed of the Maine Coon.": null
    },
    {
        "Another folk tale involves Captain Charles Coon, an English seafarer who kept long-haired cats aboard his ships. Whenever Coon's ship would anchor in ": null
    },
    {
        "New England": "https://en.wikipedia.org/wiki/New_England"
    },
    {
        " ports, the felines would exit the ship and mate with the local ": null
    },
    {
        "feral": "https://en.wikipedia.org/wiki/Feral"
    },
    {
        " cat population. When long-haired kittens began appearing in the litters of the local cat population, they were referred to as one of \"Coon's cats\".": null
    },
    {
        "A myth which is trait-based, though genetically impossible, is the idea that the modern Maine Coon descended from ancestors of semi-feral domestic cats and ": null
    },
    {
        "raccoons": "https://en.wikipedia.org/wiki/Raccoon"
    },
    {
        ". This myth is likely based on the common color of the breed (": null
    },
    {
        "brown tabby": "https://en.wikipedia.org/wiki/Tabby_cat"
    },
    {
        ") and its bushy tail. Another idea is that the Maine Coon originated from the matings of domestic cats and wild ": null
    },
    {
        "bobcats": "https://en.wikipedia.org/wiki/Bobcat"
    },
    {
        ", which could explain the tufts of hair that are so commonly seen on the tips of the ears.": null
    },
    {
        "The generally accepted hypothesis among breeders is that the Maine Coon is descended from the pairings of local short-haired domestic cats and long-haired breeds brought overseas by English seafarers (possibly by Captain Charles Coon) or 11th-century ": null
    },
    {
        "Norsemen": "https://en.wikipedia.org/wiki/Norsemen"
    },
    {
        ". The connection to the Norsemen is seen in the strong resemblance of the Maine Coon to the ": null
    },
    {
        "Norwegian Forest Cat": "https://en.wikipedia.org/wiki/Norwegian_Forest_Cat"
    },
    {
        ", another breed that is said to be a descendant of cats that traveled with the Norsemen.": null
    },
    {
        "The first mention of Maine Coon cats in a literary work was in 1861, in Frances Simpson's The Book of the Cat (1903). F.R. Pierce, who owned several Maine Coons, wrote a chapter about the breed. During the late 1860s, farmers located in Maine told stories about their cats and held the \"Maine State Champion Coon Cat\" contest at the local ": null
    },
    {
        "Skowhegan": "https://en.wikipedia.org/wiki/Skowhegan,_Maine"
    },
    {
        " Fair.": null
    },
    {
        "In 1895, a dozen Maine Coons were entered into a show in ": null
    },
    {
        "Boston": "https://en.wikipedia.org/wiki/Boston"
    },
    {
        ". On 8 May 1895, the first North American cat show was hosted at ": null
    },
    {
        "Madison Square Garden": "https://en.wikipedia.org/wiki/Madison_Square_Garden_(1890)"
    },
    {
        " in ": null
    },
    {
        "New York City": "https://en.wikipedia.org/wiki/New_York_City"
    },
    {
        ". A female Maine Coon brown tabby, named Cosey, was entered into the show. Owned by Mrs. Fred Brown, Cosey won the silver collar and medal and was named Best in Show. The silver collar was purchased by the ": null
    },
    {
        "Cat Fanciers' Association": "https://en.wikipedia.org/wiki/Cat_Fanciers%27_Association"
    },
    {
        " (CFA) Foundation with the help of a donation from the National Capital Cat Show. The collar is housed at the CFA Central Office in the Jean Baker Rose Memorial Library.": null
    },
    {
        "In the early 20th century, the Maine Coon's popularity began to decline with the introduction of other long-haired breeds, such as the ": null
    },
    {
        "Persian": "https://en.wikipedia.org/wiki/Persian_(cat)"
    },
    {
        ", which originated in the ": null
    },
    {
        "Middle East": "https://en.wikipedia.org/wiki/Middle_East"
    },
    {
        ". The last recorded win by a Maine Coon in a national cat show for over 40 years was in 1911 at a show in ": null
    },
    {
        "Portland, Oregon": "https://en.wikipedia.org/wiki/Portland,_Oregon"
    },
    {
        ". The breed was rarely seen after that. The decline was so severe that the breed was declared extinct in the 1950s, although this declaration was considered to be exaggerated and reported prematurely at the time. The Central Maine Cat Club (CMCC) was created in the early 1950s by Ethylin Whittemore, Alta Smith and Ruby Dyer in attempts to increase the popularity of the Maine Coon. For 11 years, the CMCC held cat shows and hosted exhibitions of photographs of the breed and is noted for creating the first written ": null
    },
    {
        "breed standards": "https://en.wikipedia.org/wiki/Breed_standard"
    },
    {
        " for the Maine Coon.": null
    },
    {
        "The Maine Coon was denied provisional breed status—one of the three steps required for a breed not yet recognized by the CFA to be able to compete in championship competitions—by the CFA three times, which led to the formation of the Maine Coon Cat Club in 1973. The breed was finally accepted by the CFA under provisional status on 1 May 1975, and was approved for championship status on 1 May 1976. The next couple of decades saw a rise in popularity of the Maine Coon, with championship victories and an increase in national rankings. In 1985, the state of Maine announced that the breed would be named the official state cat. Today the Maine Coon is the third most popular cat breed, according to the number of kittens registered with the CFA.": null
    },
    {
        "The Maine Coon is the largest breed of domestic cat. On average, males weigh from 13 to 18 lb (5.9 to 8.2 kg) with females weighing from 8 to 12 lb (3.6 to 5.4 kg). The height of adults can vary between 10 and 16 in (25 and 41 cm) and they can reach a length of up to 48 in (120 cm), including the tail, which can reach a length of 14 in (36 cm) and is long, tapering, and heavily furred, almost resembling a raccoon's tail. The body is solid and muscular, which is necessary for supporting their own weight, and the chest is broad. Maine Coons possess a rectangular body shape and are slow to physically mature; their full potential size is normally not reached until they are three to five years old, while other cats take about one year.": null
    },
    {
        "In 2010, the ": null
    },
    {
        "Guinness World Records": "https://en.wikipedia.org/wiki/Guinness_World_Records"
    },
    {
        " accepted a male purebred Maine Coon named \"Stewie\" as the \"Longest Cat\" measuring 48.5 in (123 cm) from the tip of his ": null
    },
    {
        "nose": "https://en.wikipedia.org/wiki/Nose"
    },
    {
        " to the tip of his ": null
    },
    {
        "tail": "https://en.wikipedia.org/wiki/Tail"
    },
    {
        ". Stewie died 4 February 2013, from cancer at his home in ": null
    },
    {
        "Reno, Nevada": "https://en.wikipedia.org/wiki/Reno,_Nevada"
    },
    {
        ", at age 8. As of 2015 the living record-holder for \"Longest Cat\" is \"Ludo\", measuring 3 ft 10.59 in (118.33 cm). He lives in ": null
    },
    {
        "Wakefield": "https://en.wikipedia.org/wiki/Wakefield"
    },
    {
        ", ": null
    },
    {
        "UK": "https://en.wikipedia.org/wiki/United_Kingdom"
    },
    {
        ". Large Maine Coons can overlap in length with ": null
    },
    {
        "Eurasian lynxes": "https://en.wikipedia.org/wiki/Eurasian_lynx"
    },
    {
        ", although with a much lighter build and lower height.": null
    },
    {
        "The Maine Coon is a long or medium haired cat. The coat is soft and silky, although texture may vary with coat color. The length is shorter on the head and shoulders, and longer on the stomach and flanks with some cats having a lion-like ruff around their neck. Minimal grooming is required for the breed, compared to other long-haired breeds, as their coat is mostly self-maintaining owing to a light-density ": null
    },
    {
        "undercoat": "https://en.wikipedia.org/wiki/Down_hair"
    },
    {
        ". The coat is subject to seasonal variation, with the fur being thicker in the winter and thinner during the summer.": null
    },
    {
        "Maine Coons can have any ": null
    },
    {
        "colors": "https://en.wikipedia.org/wiki/Cat_coat_genetics"
    },
    {
        " that other cats have. Colors indicating ": null
    },
    {
        "crossbreeding": "https://en.wikipedia.org/wiki/Crossbreed"
    },
    {
        ", such as chocolate, lavender, the ": null
    },
    {
        "Siamese": "https://en.wikipedia.org/wiki/Siamese_(cat)"
    },
    {
        " pointed patterns or the \"": null
    },
    {
        "ticked": "https://en.wikipedia.org/wiki/Tabby_cat#Ticked_tabby"
    },
    {
        "\" patterns, are not accepted by some breed standards (the 'ticked' pattern, for example, is accepted by TICA). The most common pattern seen in the breed is brown tabby. All eye colors are accepted under breed standards, with the exception of the occurrence of blue-colored or ": null
    },
    {
        "odd-eyes": "https://en.wikipedia.org/wiki/Odd-eyed_cat"
    },
    {
        " (i.e. two eyes of different colors) in cats possessing coat colors other than white.": null
    },
    {
        "Maine Coons have several physical adaptations for survival in harsh winter climates. Their dense water-resistant fur is longer and shaggier on their underside and rear for extra protection when they are walking or sitting on top of wet surfaces of snow or ice. Their long and bushy raccoon-like tail is resistant to sinking in snow, and can be curled around their face and shoulders for warmth and protection from wind and blowing snow and it can even be curled around their backside like an insulated seat cushion when sitting down on a snow or ice surface. Large paws, and especially the extra-large paws of polydactyl Maine Coons, facilitate walking on snow and are often compared to snowshoes. Long tufts of fur growing between their toes help keep the toes warm and further aid walking on snow by giving the paws additional structure without significant extra weight. Heavily furred ears with extra long tufts of fur growing from inside help keep their ears warm.": null
    },
    {
        "Many of the original Maine Coon cats that inhabited the New England area possessed a trait known as ": null
    },
    {
        "polydactylism": "https://en.wikipedia.org/wiki/Polydactyl_cat"
    },
    {
        " (having one or more extra toes on the feet). While some sources claim that trait is thought to have occurred in approximately 40% of the Maine Coon population in Maine at one time, little evidence has been given to substantiate this claim. Polydactylism is rarely, if ever, seen in Maine Coons in the show ring since it is unacceptable by competition standards. The gene for polydactylism is a simple ": null
    },
    {
        "autosomal": "https://en.wikipedia.org/wiki/Autosome"
    },
    {
        " dominant gene, which has shown to pose no threat to the cat's health. The trait was almost eradicated from the breed due to the fact that it was an automatic disqualifier in show rings. Private organizations and breeders were created in order to keep polydactylism in Maine Coons from disappearing.": null
    },
    {
        "Maine Coons are known as the \"gentle giants\" and possess above-average intelligence, making them relatively easy to train. They are known for being loyal to their family and cautious—but not mean—around strangers, but are independent and not clingy. The Maine Coon is generally not known for being a \"lap cat\" but their gentle disposition makes the breed relaxed around dogs, other cats, and children. They are playful throughout their lives, with males tending to be more clownish and females generally possessing more dignity, yet both are equally affectionate. Many Maine Coons have a fascination with water and some theorize that this personality trait comes from their ancestors, who were aboard ships for much of their lives. Maine Coons are also well known for being very vocal cats. They are known for their frequent yowling or howling, trilling, chirping, and making other loud vocalizations.": null
    },
    {
        "Maine Coons require ample protein and nutrients in their diets. Since they are a large cat breed with high levels of energy, it is best to feed them quality food. Food that lists meat as the first ingredient is best for the Maine Coon.": null
    },
    {
        "Pet insurance data obtained from a study during years 2003–2006 in Sweden puts the median lifespan of the Maine Coon at >12.5 years. 74% lived to 10 years or more and 54% lived to 12.5 years or more. Maine Coons are generally a healthy and hardy breed and have adapted to survive the New England climate. The most severe threat is ": null
    },
    {
        "feline hypertrophic cardiomyopathy": "https://en.wikipedia.org/wiki/Hypertrophic_cardiomyopathy#Other_animals"
    },
    {
        " (HCM), the most common heart disease seen in cats, whether pure bred or not. In Maine Coons, it is thought to be inherited as an ": null
    },
    {
        "autosomal dominant": "https://en.wikipedia.org/wiki/Autosomal_dominant"
    },
    {
        " trait. Middle-aged to older cats as well as males are thought to be predisposed to the disease. HCM is a progressive disease and can result in heart failure, ": null
    },
    {
        "paralysis": "https://en.wikipedia.org/wiki/Paralysis"
    },
    {
        " of the hind legs due to clot embolization originating in the heart, and sudden death. A specific mutation that causes HCM is seen in Maine Coons for which testing services are offered. Of all the Maine Coons tested for the MyBPC mutation at the Veterinary Cardiac Genetics Lab at the College of Veterinary Medicine located at ": null
    },
    {
        "Washington State University": "https://en.wikipedia.org/wiki/Washington_State_University"
    },
    {
        ", approximately one-third tested positive.  Not all cats that tested positive will have clinical signs of the disease and some Maine Coon cats with clinical evidence of hypertrophic cardiomyopathy test negative for this mutation, strongly suggesting that a second mutation exists in the breed. The HCM prevalence was found to be 10.1% (95% CI 5.8 -14.3% ) in this study.": null
    },
    {
        "Another potential health problem is ": null
    },
    {
        "spinal muscular atrophy": "https://en.wikipedia.org/wiki/Spinal_muscular_atrophy"
    },
    {
        " (SMA), another genetically inherited disease which causes the loss of the spinal-cord neurons which activate the skeletal muscles of the trunk and limbs. Symptoms are normally seen within 3–4 months of age and result in ": null
    },
    {
        "muscle atrophy": "https://en.wikipedia.org/wiki/Muscle_atrophy"
    },
    {
        ", ": null
    },
    {
        "muscle weakness": "https://en.wikipedia.org/wiki/Muscle_weakness"
    },
    {
        ", and a shortened life span. A test is offered to detect the genes responsible for SMA.": null
    },
    {
        "Hip dysplasia": "https://en.wikipedia.org/wiki/Hip_dysplasia_(canine)"
    },
    {
        " is an abnormality of the hip joint which can cause crippling lameness and ": null
    },
    {
        "arthritis": "https://en.wikipedia.org/wiki/Arthritis"
    },
    {
        ". The cats most commonly affected with hip dysplasia tend to be males of the larger, big-boned breeds such as Persians and Maine Coons. The relatively smaller size and weight of cats frequently results in symptoms that are less pronounced. X-rays submitted to the ": null
    },
    {
        "Orthopedic Foundation for Animals": "https://en.wikipedia.org/wiki/Orthopedic_Foundation_for_Animals"
    },
    {
        " (OFA) between 1974 and 2011 indicates that 24.3% of Maine Coons in the database were dysplastic. The Maine Coon is the only cat breed listed in the database.": null
    },
    {
        "Polycystic kidney disease": "https://en.wikipedia.org/wiki/Polycystic_kidney_disease"
    },
    {
        " (PKD) is a slowly progressive disease affecting Persian and Persian-related breeds, in which fluid-filled cysts expand within the kidneys, destroying functional tissue. While renal cysts are observed with a low incidence in Maine Coons, PKD appears to be a misnomer in this particular breed. In a recent study spanning 8 years, renal cysts were documented by ultrasound in 7 of 187 healthy Maine Coons enrolled in a pre-breeding screening programme. The cysts were mostly single and unilateral (6/7, 85.7%) small (mean 3.6 mm in diameter) and located at corticomedullary junction (4/6, 66.7%), thus different in size, numbers and location from those observed in Persian-related breeds. In the same study, not only did all six Maine Coon cats with renal cysts test negative for the PKD1 mutation, proving the disease in these cats to be unrelated to the PKD observed in Persians and related breeds, but gene sequencing of these cats failed to demonstrate any common genetic sequences. The presence of renal cysts, in the absence of other changes, does not appear to negatively impact the patients' quality of life, as those for which follow-up was available were reported alive and well in adulthood. Although the exact nature and clinical relevance of renal cysts in Maine Coons is currently unknown, its screening is still recommended for pre-breeding assessment. Ultrasonography is currently the only valid diagnostic method for its detection in this breed.": null
    }
]