[
    {
        "Foxes are small-to-medium-sized, ": null
    },
    {
        "omnivorous": "https://en.wikipedia.org/wiki/Omnivorous"
    },
    {
        "mammals": "https://en.wikipedia.org/wiki/Mammal"
    },
    {
        " belonging to several ": null
    },
    {
        "genera": "https://en.wikipedia.org/wiki/Genera"
    },
    {
        " of the family ": null
    },
    {
        "Canidae": "https://en.wikipedia.org/wiki/Canidae"
    },
    {
        ". Foxes have a flattened skull, upright triangular ears, a pointed, slightly upturned ": null
    },
    {
        "snout": "https://en.wikipedia.org/wiki/Snout"
    },
    {
        ", and a long bushy ": null
    },
    {
        "tail": "https://en.wikipedia.org/wiki/Tail"
    },
    {
        " (or brush).": null
    },
    {
        "Twelve ": null
    },
    {
        "species": "https://en.wikipedia.org/wiki/Species"
    },
    {
        " belong to the ": null
    },
    {
        "monophyletic": "https://en.wikipedia.org/wiki/Monophyly"
    },
    {
        " \"true foxes\" group of genus ": null
    },
    {
        "Vulpes": "https://en.wikipedia.org/wiki/Vulpes"
    },
    {
        ". Approximately another 25 current or ": null
    },
    {
        "extinct": "https://en.wikipedia.org/wiki/Extinction"
    },
    {
        " species are always or sometimes called foxes; these foxes are either part of the ": null
    },
    {
        "paraphyletic": "https://en.wikipedia.org/wiki/Paraphyly"
    },
    {
        " group of the South American foxes, or of the outlying group, which consists of bat-eared fox, gray fox, and island fox. Foxes live on every continent except Antarctica. By far the most common and widespread species of fox is the ": null
    },
    {
        "red fox": "https://en.wikipedia.org/wiki/Red_fox"
    },
    {
        " (Vulpes vulpes) with about 47 recognized ": null
    },
    {
        "subspecies": "https://en.wikipedia.org/wiki/Subspecies"
    },
    {
        ". The global distribution of foxes, together with their widespread reputation for cunning, has contributed to their prominence in ": null
    },
    {
        "popular culture": "https://en.wikipedia.org/wiki/Popular_culture"
    },
    {
        " and ": null
    },
    {
        "folklore": "https://en.wikipedia.org/wiki/Folklore"
    },
    {
        " in many societies around the world.  The hunting of foxes with packs of hounds, long an established pursuit in Europe, especially in the ": null
    },
    {
        "British Isles": "https://en.wikipedia.org/wiki/British_Isles"
    },
    {
        ", was exported by European settlers to various parts of the ": null
    },
    {
        "New World": "https://en.wikipedia.org/wiki/New_World"
    },
    {
        ".": null
    },
    {
        "The word fox comes from ": null
    },
    {
        "Old English": "https://en.wikipedia.org/wiki/Old_English_language"
    },
    {
        ", which derived from ": null
    },
    {
        "Proto-Germanic": "https://en.wikipedia.org/wiki/Proto-Germanic"
    },
    {
        " *fuhsaz. This in turn derives from ": null
    },
    {
        "Proto-Indo-European": "https://en.wikipedia.org/wiki/Proto-Indo-European_language"
    },
    {
        " *puḱ-, meaning ’thick-haired; tail’. Male foxes are ": null
    },
    {
        "known as": "https://en.wikipedia.org/wiki/List_of_animal_names"
    },
    {
        " dogs, tods or ": null
    },
    {
        "reynards": "https://en.wikipedia.org/wiki/Reynard"
    },
    {
        ", females as vixens, and young as cubs, pups, or kits, though the latter name is not to be confused with a distinct species called ": null
    },
    {
        "kit foxes": "https://en.wikipedia.org/wiki/Kit_fox"
    },
    {
        ". Vixen is one of very few words in modern English that retains the ": null
    },
    {
        "Middle English": "https://en.wikipedia.org/wiki/Middle_English"
    },
    {
        " southern dialect \"v\" pronunciation instead of \"f\" (i.e. northern English \"fox\" versus southern English \"vox\"). A group of foxes is referred to as a skulk, leash, or earth.": null
    },
    {
        "Within the Canidae, the results of ": null
    },
    {
        "DNA": "https://en.wikipedia.org/wiki/DNA"
    },
    {
        " analysis shows  several ": null
    },
    {
        "phylogenetic": "https://en.wikipedia.org/wiki/Phylogenetics"
    },
    {
        " divisions:": null
    },
    {
        "Foxes are generally smaller than some other members of the family ": null
    },
    {
        "Canidae": "https://en.wikipedia.org/wiki/Canidae"
    },
    {
        " such as ": null
    },
    {
        "wolves": "https://en.wikipedia.org/wiki/Gray_wolf"
    },
    {
        " and ": null
    },
    {
        "jackals": "https://en.wikipedia.org/wiki/Jackal"
    },
    {
        ", while they may be larger than some within the family, such as ": null
    },
    {
        "Raccoon dogs": "https://en.wikipedia.org/wiki/Raccoon_dogs"
    },
    {
        ". In the largest species, the ": null
    },
    {
        "red fox": "https://en.wikipedia.org/wiki/Red_fox"
    },
    {
        ", males weigh on average between 4.1 and 8.7 kg (9.0 and 19.2 lb), while the smallest species, the ": null
    },
    {
        "fennec fox": "https://en.wikipedia.org/wiki/Fennec_fox"
    },
    {
        ", weighs just 0.7 to 1.6 kg (1.5 to 3.5 lb). Fox-like features typically include a triangular face, pointed ears, an elongated ": null
    },
    {
        "rostrum": "https://en.wikipedia.org/wiki/Rostrum_(anatomy)"
    },
    {
        ", and a bushy tail. Foxes are ": null
    },
    {
        "digitigrade": "https://en.wikipedia.org/wiki/Digitigrade"
    },
    {
        ", and thus, walk on their toes. Unlike most members of the family Canidae, foxes have partially retractable claws. Fox ": null
    },
    {
        "vibrissae": "https://en.wikipedia.org/wiki/Vibrissae"
    },
    {
        ", or whiskers, are black. The whiskers on the muzzle, mystaciae vibrissae, average 100–110 mm (3.9–4.3 in) long, while the whiskers everywhere else on the head average to be shorter in length. Whiskers (carpal vibrissae) are also on the forelimbs and average 40 mm (1.6 in) long, pointing downward and backward. Other physical characteristics vary according to habitat and adaptive significance.": null
    },
    {
        "Fox species differ in fur color, length, and density. Coat colors range from pearly white to black and white to black flecked with white or grey on the underside. ": null
    },
    {
        "Fennec foxes": "https://en.wikipedia.org/wiki/Fennec_fox"
    },
    {
        " (and other species of fox adapted to life in the desert, such as ": null
    },
    {
        "kit foxes": "https://en.wikipedia.org/wiki/Kit_fox"
    },
    {
        "), for example, have large ears and short fur to aid in keeping the body cool.": null
    },
    {
        "Arctic foxes": "https://en.wikipedia.org/wiki/Arctic_fox"
    },
    {
        ", on the other hand, have tiny ears and short limbs as well as thick, insulating fur, which aid in keeping the body warm.": null
    },
    {
        "Red foxes": "https://en.wikipedia.org/wiki/Red_fox"
    },
    {
        ", by contrast, have a typical ": null
    },
    {
        "auburn": "https://en.wikipedia.org/wiki/Auburn_hair"
    },
    {
        "pelt": "https://en.wikipedia.org/wiki/Fur"
    },
    {
        ", the tail normally ending with white ": null
    },
    {
        "marking": "https://en.wikipedia.org/wiki/Animal_markings"
    },
    {
        ". A fox's coat color and texture may vary due to the change in seasons; fox pelts are richer and denser in the colder months and lighter in the warmer months. To get rid of the dense winter coat, foxes ": null
    },
    {
        "moult": "https://en.wikipedia.org/wiki/Moult"
    },
    {
        " once a year around April; the process begins from the feet, up the legs, and then along the back. Coat color may also change as the individual ages.": null
    },
    {
        "A fox's ": null
    },
    {
        "dentition": "https://en.wikipedia.org/wiki/Dentition"
    },
    {
        ", like all other canids, is I 3/3, C 1/1, PM 4/4, M 3/2 = 42. (Bat-eared foxes have six extra molars, totaling in 48 teeth.) Foxes have pronounced ": null
    },
    {
        "carnassial": "https://en.wikipedia.org/wiki/Carnassial"
    },
    {
        " pairs, which is characteristic of a ": null
    },
    {
        "carnivore": "https://en.wikipedia.org/wiki/Carnivore"
    },
    {
        ". These pairs consist of the upper premolar and the lower first molar, and work together to shear tough material like flesh. Foxes' canines are pronounced, also characteristic of a carnivore, and are excellent in gripping prey.": null
    },
    {
        "In the wild, the typical lifespan of a fox is one to three years, although individuals may live up to ten years. Unlike many canids, foxes are not always pack animals. Typically, they live in small family groups, but some (": null
    },
    {
        "Arctic foxes": "https://en.wikipedia.org/wiki/Arctic_fox"
    },
    {
        ") are known to be solitary.": null
    },
    {
        "Foxes are omnivores. The diet of foxes is largely made up of ": null
    },
    {
        "invertebrates": "https://en.wikipedia.org/wiki/Invertebrate"
    },
    {
        " such as insects, and small ": null
    },
    {
        "vertebrates": "https://en.wikipedia.org/wiki/Vertebrate"
    },
    {
        " such as reptiles and birds, and can include eggs and plants. Many species are generalist predators, but some (such as the ": null
    },
    {
        "crab-eating fox": "https://en.wikipedia.org/wiki/Crab-eating_fox"
    },
    {
        ") have more specialized diets. Most species of fox consume around 1 kg (2.2 lb) of food every day. Foxes ": null
    },
    {
        "cache": "https://en.wikipedia.org/wiki/Cache_(biology)"
    },
    {
        " excess food, burying it for later consumption, usually under leaves, snow, or soil. Foxes tend to use a pouncing technique where they crouch down to ": null
    },
    {
        "camouflage": "https://en.wikipedia.org/wiki/Camouflage"
    },
    {
        " themselves in the terrain, then using their hind legs, leap up with great force to land on top of their targeted prey. Using their pronounced canine teeth, foxes grip on to their prey's neck and either shake until the prey is dead, or until the animal can be disemboweled.": null
    },
    {
        "The ": null
    },
    {
        "gray fox": "https://en.wikipedia.org/wiki/Gray_fox"
    },
    {
        " is one of only two canine species known to regularly climb trees; the other is the ": null
    },
    {
        "raccoon dog": "https://en.wikipedia.org/wiki/Raccoon_dog"
    },
    {
        ".": null
    },
    {
        "The male fox's ": null
    },
    {
        "scrotum": "https://en.wikipedia.org/wiki/Scrotum"
    },
    {
        " is held up close to the body with the ": null
    },
    {
        "testes": "https://en.wikipedia.org/wiki/Testes"
    },
    {
        " inside even after they descend. Like other canines, the male fox has a ": null
    },
    {
        "baculum": "https://en.wikipedia.org/wiki/Baculum"
    },
    {
        ", or penile bone. The testes of ": null
    },
    {
        "red foxes": "https://en.wikipedia.org/wiki/Red_fox"
    },
    {
        " are smaller than those of Arctic foxes.": null
    },
    {
        "Sperm formation": "https://en.wikipedia.org/wiki/Spermatogenesis"
    },
    {
        " in red foxes begins in August–September, with the testicles attaining their greatest weight in December–February.": null
    },
    {
        "Vixens are in heat for one to six days, making their reproductive cycle twelve months long. As with other canines, the ": null
    },
    {
        "ova": "https://en.wikipedia.org/wiki/Egg_cell"
    },
    {
        " are shed during ": null
    },
    {
        "estrus": "https://en.wikipedia.org/wiki/Estrus"
    },
    {
        " without the need for the stimulation of copulating. Once the egg is fertilized, the vixen enters a period of ": null
    },
    {
        "gestation": "https://en.wikipedia.org/wiki/Gestation"
    },
    {
        " that can last from 52 to 53 days. Foxes tend to have an average litter size of four to five with an 80 percent success rate in becoming pregnant. Litter sizes can vary greatly according to species and environment – the ": null
    },
    {
        "Arctic fox": "https://en.wikipedia.org/wiki/Arctic_fox"
    },
    {
        ", for example, can have up to eleven kits.": null
    },
    {
        "The vixen usually has six or eight ": null
    },
    {
        "mammae": "https://en.wikipedia.org/wiki/Mammae"
    },
    {
        ". Each teat has 8 to 20 ": null
    },
    {
        "lactiferous ducts": "https://en.wikipedia.org/wiki/Lactiferous_duct"
    },
    {
        ", which connect the mammary gland to the nipple, allowing for milk to be carried to the nipple.": null
    },
    {
        "The fox's vocal repertoire is vast:": null
    },
    {
        "In the case of domesticated foxes, the whining seems to remain in adult individuals as a sign of excitement and submission in the presence of their owners.": null
    },
    {
        "Canids commonly known as foxes include the following genera and species:": null
    },
    {
        "Several fox species are ": null
    },
    {
        "endangered": "https://en.wikipedia.org/wiki/Endangered_species"
    },
    {
        " in their native environments. Pressures placed on foxes include habitat loss and being hunted for pelts, other trade, or control. Due in part to their opportunistic hunting style and industriousness, foxes are commonly resented as nuisance animals. On the other hand, foxes, while often considered pests themselves, have been successfully employed to control pests on fruit farms while leaving the fruit intact.": null
    },
    {
        "The ": null
    },
    {
        "island fox": "https://en.wikipedia.org/wiki/Island_fox"
    },
    {
        ", though considered a ": null
    },
    {
        "near-threatened species": "https://en.wikipedia.org/wiki/Near-threatened_species"
    },
    {
        " throughout the world, is becoming increasingly endangered in its ": null
    },
    {
        "endemic": "https://en.wikipedia.org/wiki/Endemic"
    },
    {
        " environment of the ": null
    },
    {
        "California Channel Islands": "https://en.wikipedia.org/wiki/California_Channel_Islands"
    },
    {
        ". A population on an island is smaller than those on the mainland because of limited resources like space, food and shelter. Island populations, therefore, are highly susceptible to external threats ranging from introduced predatory species and humans to extreme weather. On the California Channel Islands, it was found that the population of the island fox was so low due to an outbreak of ": null
    },
    {
        "canine distemper virus": "https://en.wikipedia.org/wiki/Canine_distemper_virus"
    },
    {
        " from 1999 to 2000 as well as predation by non-native ": null
    },
    {
        "golden eagles": "https://en.wikipedia.org/wiki/Golden_eagles"
    },
    {
        ". Since 1993, the eagles have caused the population to decline by as much as 95%. Because of the low number of foxes, the population went through an ": null
    },
    {
        "Allee effect": "https://en.wikipedia.org/wiki/Allee_effect"
    },
    {
        "; this is where at low enough densities, an individual's ": null
    },
    {
        "fitness": "https://en.wikipedia.org/wiki/Fitness_(biology)"
    },
    {
        " decreases. Conservationists, therefore, had to take healthy breeding pairs out of the wild population to breed them in captivity until they had enough foxes to release back into the wild. Nonnative grazers were also removed so that native plants would be able to grow back to their natural height, thereby providing adequate cover and protection for the foxes against golden eagles.": null
    },
    {
        "Darwin's fox": "https://en.wikipedia.org/wiki/Darwin%27s_fox"
    },
    {
        " is considered ": null
    },
    {
        "critically endangered": "https://en.wikipedia.org/wiki/Critically_endangered"
    },
    {
        " because of their small known population of 250 mature individuals as well as their restricted distribution. On the ": null
    },
    {
        "Chilean": "https://en.wikipedia.org/wiki/Chile"
    },
    {
        " mainland, the population is limited to ": null
    },
    {
        "Nahuelbuta National Park": "https://en.wikipedia.org/wiki/Nahuelbuta_National_Park"
    },
    {
        " and the surrounding ": null
    },
    {
        "Valdivian rainforest": "https://en.wikipedia.org/wiki/Valdivian_temperate_rainforest"
    },
    {
        ". Similarly on ": null
    },
    {
        "Chiloé Island": "https://en.wikipedia.org/wiki/Chilo%C3%A9_Island"
    },
    {
        ", their population is limited to the forests that extend from the southernmost to the northwestern most part of the island. Though the Nahuelbuta National Park is protected, 90% of the species live on Chiloé Island. A major problem the species faces, therefore, is their dwindling, limited habitat due to the cutting and burning of the unprotected forests. Because of deforestation, the Darwin's fox habitat is shrinking, allowing for their competitor's (": null
    },
    {
        "chilla fox": "https://en.wikipedia.org/wiki/South_American_gray_fox"
    },
    {
        ") preferred habitat of open space, to increase; the Darwin's fox, subsequently, is being outcompeted. Another problem they face is their inability to fight off diseases transmitted by the increasing number of pet dogs. To conserve these animals, researchers suggest the need for the forests that link the Nahuelbuta National Park to the coast of Chile and in turn Chiloé Island and its forests, to be protected. They also suggest that other forests around Chile be examined to determine whether Darwin's foxes have previously existed there or can live there in the future, should the need to reintroduce the species to those areas arise. And finally, the researchers advise for the creation of a captive breeding program, in Chile, because of the limited number of mature individuals in the wild.": null
    },
    {
        "Foxes are often considered pests or nuisance creatures for their opportunistic attacks on poultry and other small livestock. Fox attacks on humans are not common.Many foxes adapt well to human environments, with several species classified as \"resident urban carnivores\" for their ability to sustain populations entirely within urban boundaries. Foxes in urban areas can live longer and can have smaller litter sizes than foxes in non-urban areas. Urban foxes are ubiquitous in Europe, where they show altered behaviors compared to non-urban foxes, including increased population density, smaller territory, and pack foraging. Foxes have been introduced in numerous locations, with varying effects on indigenous flora and fauna.": null
    },
    {
        "In some countries, foxes are major predators of rabbits and hens. Population oscillations of these two species were the first nonlinear oscillation studied, and led to the now-famous ": null
    },
    {
        "Lotka-Volterra equation": "https://en.wikipedia.org/wiki/Lotka-Volterra_equation"
    },
    {
        ".": null
    },
    {
        "Fox hunting originated in the ": null
    },
    {
        "United Kingdom": "https://en.wikipedia.org/wiki/United_Kingdom"
    },
    {
        " in the 16th century. Hunting with dogs is now banned in the United Kingdom, though hunting without dogs is still permitted. Red foxes were ": null
    },
    {
        "introduced into Australia": "https://en.wikipedia.org/wiki/Red_foxes_in_Australia"
    },
    {
        " in the early 19th century for sport, and have since become widespread through much of the country. They have caused population decline among many native species and prey on livestock, especially new lambs. Fox hunting is practiced as recreation in several other countries including Canada, France, Ireland, Italy, ": null
    },
    {
        "Russia": "https://en.wikipedia.org/wiki/Russia"
    },
    {
        " and the United States.": null
    },
    {
        "There are many records of ": null
    },
    {
        "domesticated red foxes": "https://en.wikipedia.org/wiki/Red_fox#Taming_and_domestication"
    },
    {
        " and others, but rarely of sustained domestication. A recent and notable exception is the ": null
    },
    {
        "Russian silver fox": "https://en.wikipedia.org/wiki/Domesticated_red_fox"
    },
    {
        ", which resulted in visible and behavioral changes, and is a case study of an animal population modeling according to human domestication needs. The current group of domesticated silver foxes are the result of nearly fifty years of experiments in the Soviet Union and Russia to domesticate the silver morph of the red fox. This selective breeding resulted in physical and behavioral traits appearing that are frequently seen in domestic cats, dogs, and other animals, such as pigmentation changes, floppy ears, and curly tails. Notably, the new foxes became more tame, allowing themselves to be petted, whimpering to get attention and sniffing and licking their caretakers.": null
    },
    {
        "In the ": null
    },
    {
        "United Kingdom": "https://en.wikipedia.org/wiki/United_Kingdom"
    },
    {
        ", a number of cases of non-fatal attacks on humans were reported. They often involved children, or if there were gaps in homes through which foxes could pass.": null
    },
    {
        "Foxes are among the comparatively few mammals which have been able to adapt themselves to a certain degree to living in urban (mostly suburban) human environments. Their omnivorous diet allows them to survive on discarded food waste, and their skittish and often nocturnal nature means that they are often able to avoid detection, despite their larger size.  Urban foxes, however, have been identified as threats to cats and small dogs, and for this reason there is often pressure to exclude them from these environments.": null
    },
    {
        "The ": null
    },
    {
        "San Joaquin kit fox": "https://en.wikipedia.org/wiki/San_Joaquin_kit_fox"
    },
    {
        " is a highly endangered species that has, ironically, become adapted to urban living in the ": null
    },
    {
        "San Joaquin Valley": "https://en.wikipedia.org/wiki/San_Joaquin_Valley"
    },
    {
        " and ": null
    },
    {
        "Salinas Valley": "https://en.wikipedia.org/wiki/Salinas_Valley"
    },
    {
        " of southern California. Its diet includes mice, ground squirrels, rabbits, hares, bird eggs, and insects, and it has claimed habitats in open areas, golf courses, drainage basins, and school grounds.": null
    },
    {
        "The fox appears in many cultures, usually in ": null
    },
    {
        "folklore": "https://en.wikipedia.org/wiki/Folklore"
    },
    {
        ". However, there are slight variations in their depictions in folklore. In Western folklore and also in Persian folklore, foxes are depicted as a symbol of cunning and ": null
    },
    {
        "trickery": "https://en.wikipedia.org/wiki/Trickery"
    },
    {
        " – a reputation derived especially from their reputed ability to evade hunters. This is usually represented as a character possessing these traits. These traits are used on a wide variety of characters, either making them a nuisance to the story, a misunderstood hero, or a devious villain.": null
    },
    {
        "In Asian folklore, foxes are depicted as a ": null
    },
    {
        "familiar spirit": "https://en.wikipedia.org/wiki/Familiar_spirit"
    },
    {
        " possessed of magic powers. Similar to Western folklore, foxes are depicted as mischievous, usually tricking other people, with the ability to ": null
    },
    {
        "disguise as an attractive female human": "https://en.wikipedia.org/wiki/Human_disguise"
    },
    {
        ". However, there are other depictions of foxes as a mystical, sacred creature, that can either bring wonder or ruin.": null
    },
    {
        "Nine-tailed foxes": "https://en.wikipedia.org/wiki/Fox_spirit"
    },
    {
        " appear in Chinese folklore, literature, and mythology, in which, depending on the tale can be a good or a bad omen. The motif was eventually introduced from Chinese to Japanese and Korean cultures.": null
    },
    {
        "The constellation ": null
    },
    {
        "Vulpecula": "https://en.wikipedia.org/wiki/Vulpecula"
    },
    {
        " represents a fox.": null
    }
]