[
    {
        "Diana (Classical Latin: ) is a ": null
    },
    {
        "Roman": "https://en.wikipedia.org/wiki/Ancient_Rome"
    },
    {
        "goddess": "https://en.wikipedia.org/wiki/Goddess"
    },
    {
        " of the ": null
    },
    {
        "hunt": "https://en.wikipedia.org/wiki/Hunting"
    },
    {
        ", the ": null
    },
    {
        "Moon": "https://en.wikipedia.org/wiki/Moon"
    },
    {
        ", and ": null
    },
    {
        "nature": "https://en.wikipedia.org/wiki/Nature"
    },
    {
        ", associated with wild animals and woodland. She is ": null
    },
    {
        "equated": "https://en.wikipedia.org/wiki/Syncretism"
    },
    {
        " with the ": null
    },
    {
        "Greek goddess": "https://en.wikipedia.org/wiki/Greek_mythology"
    },
    {
        "Artemis": "https://en.wikipedia.org/wiki/Artemis"
    },
    {
        ", and absorbed much of Artemis' mythology early in Roman history, including a birth on the island of ": null
    },
    {
        "Delos": "https://en.wikipedia.org/wiki/Delos"
    },
    {
        " to parents ": null
    },
    {
        "Jupiter": "https://en.wikipedia.org/wiki/Jupiter_(mythology)"
    },
    {
        " and ": null
    },
    {
        "Latona": "https://en.wikipedia.org/wiki/Latona"
    },
    {
        ", and a twin brother, ": null
    },
    {
        "Apollo": "https://en.wikipedia.org/wiki/Apollo"
    },
    {
        ", though she had ": null
    },
    {
        "an independent origin in Italy": "https://en.wikipedia.org/wiki/Diana_Nemorensis"
    },
    {
        ".": null
    },
    {
        "Diana was known as the virgin goddess of childbirth and women. She was one of the three maiden goddesses, along with ": null
    },
    {
        "Minerva": "https://en.wikipedia.org/wiki/Minerva_(mythology)"
    },
    {
        " and ": null
    },
    {
        "Vesta": "https://en.wikipedia.org/wiki/Vesta_(mythology)"
    },
    {
        ", who swore never to marry. ": null
    },
    {
        "Oak": "https://en.wikipedia.org/wiki/Oak"
    },
    {
        " groves and deer were especially sacred to her. Diana made up a triad with two other Roman deities; ": null
    },
    {
        "Egeria": "https://en.wikipedia.org/wiki/Egeria_(mythology)"
    },
    {
        " the water nymph, her servant and assistant midwife; and ": null
    },
    {
        "Virbius": "https://en.wikipedia.org/wiki/Virbius"
    },
    {
        ", the woodland god.": null
    },
    {
        "Diana is revered in modern ": null
    },
    {
        "Neopagan": "https://en.wikipedia.org/wiki/Neopagan"
    },
    {
        " religions including ": null
    },
    {
        "Roman Neopaganism": "https://en.wikipedia.org/wiki/Roman_polytheistic_reconstructionism"
    },
    {
        ", ": null
    },
    {
        "Stregheria": "https://en.wikipedia.org/wiki/Stregheria"
    },
    {
        ", and ": null
    },
    {
        "Wicca": "https://en.wikipedia.org/wiki/Wicca"
    },
    {
        ". From the medieval to the modern period, as folklore attached to her developed and was eventually adapted into neopagan religions, the mythology surrounding Diana grew to include a consort (": null
    },
    {
        "Lucifer": "https://en.wikipedia.org/wiki/Lucifer"
    },
    {
        ") and daughter (": null
    },
    {
        "Aradia": "https://en.wikipedia.org/wiki/Aradia"
    },
    {
        "), figures sometimes recognized by modern traditions. In the ancient, medieval, and modern periods, Diana has been considered a ": null
    },
    {
        "triple deity": "https://en.wikipedia.org/wiki/Triple_deity"
    },
    {
        ", merged with a goddess of the moon (": null
    },
    {
        "Luna": "https://en.wikipedia.org/wiki/Luna_(goddess)"
    },
    {
        "/": null
    },
    {
        "Selene": "https://en.wikipedia.org/wiki/Selene"
    },
    {
        ") and the underworld (usually ": null
    },
    {
        "Hecate": "https://en.wikipedia.org/wiki/Hecate"
    },
    {
        ").": null
    },
    {
        "Dīāna is an adjectival form developed from an ancient ": null
    },
    {
        "*": "https://en.wikipedia.org/wiki/Asterisk_(historical_linguistics)"
    },
    {
        "divios, corresponding to later dīvus, dius, as in ": null
    },
    {
        "Dius Fidius": "https://en.wikipedia.org/wiki/Dius_Fidius"
    },
    {
        ", ": null
    },
    {
        "Dea Dia": "https://en.wikipedia.org/wiki/Dea_Dia"
    },
    {
        ", and in the neuter form dium 'sky'.It is derived from ": null
    },
    {
        "Proto-Indo-European": "https://en.wikipedia.org/wiki/Proto-Indo-European_language"
    },
    {
        "*dyew- '(bright) sky'; the same word is also the root behind the name of the ": null
    },
    {
        "Vedic": "https://en.wikipedia.org/wiki/Vedic"
    },
    {
        " sky god ": null
    },
    {
        "Dyaus": "https://en.wikipedia.org/wiki/Dyaus"
    },
    {
        ", as well as the Latin words ": null
    },
    {
        "deus": "https://en.wikipedia.org/wiki/Deus"
    },
    {
        " 'god', diēs 'day, daylight', and diurnus 'daily'.": null
    },
    {
        "On the ": null
    },
    {
        "tablets of Pylos": "https://en.wikipedia.org/wiki/Linear_B"
    },
    {
        " a theonym di-wi-ja is supposed as referring to a deity precursor of Artemis. Modern scholars mostly accept the identification.": null
    },
    {
        "The ancient Latin writers ": null
    },
    {
        "Varro": "https://en.wikipedia.org/wiki/Varro"
    },
    {
        " and ": null
    },
    {
        "Cicero": "https://en.wikipedia.org/wiki/Cicero"
    },
    {
        " considered the etymology of Dīāna as allied to that of dies and connected to the shine of the Moon.": null
    },
    {
        "... people regard Diana and the moon as one and the same. ... the moon (luna) is so called from the verb to shine (lucere). Lucina is identified with it, which is why in our country they invoke Juno Lucina in childbirth, just as the Greeks call on Diana the Light-bearer. Diana also has the name Omnivaga (\"wandering everywhere\"), not because of her hunting but because she is numbered as one of the seven planets; her name Diana derives from the fact that she turns darkness into daylight (dies). She is invoked at childbirth because children are born occasionally after seven, or usually after nine, lunar revolutions ...": null
    },
    {
        "The persona of Diana is complex, and contains a number of archaic features. Diana was originally considered to be a goddess of the wilderness and of the hunt, a central sport in both Roman and Greek culture. Early Roman inscriptions to Diana celebrated her primarily as a huntress and patron of hunters. Later, in the Hellenistic period, Diana came to be equally or more revered as a goddess not of the wild woodland but of the \"tame\" countryside, or ": null
    },
    {
        "villa rustica": "https://en.wikipedia.org/wiki/Villa_rustica"
    },
    {
        ", the idealization of which was common in Greek thought and poetry. This dual role as goddess of both civilization and the wild, and therefore the civilized countryside, first applied to the Greek goddess ": null
    },
    {
        "Artemis": "https://en.wikipedia.org/wiki/Artemis"
    },
    {
        " (for example, in the 3rd century BCE poetry of ": null
    },
    {
        "Anacreon": "https://en.wikipedia.org/wiki/Anacreon"
    },
    {
        "). By the 3rd century CE, after Greek influence had a profound impact on Roman religion, Diana had been almost fully combined with Artemis and took on many of her attributes, both in her spiritual domains and in the description of her appearance. The Roman poet ": null
    },
    {
        "Nemesianus": "https://en.wikipedia.org/wiki/Nemesianus"
    },
    {
        " wrote a typical description of Diana: She carried a bow and a quiver full of golden arrows, wore a golden cloak, purple half-boots, and a belt with a jeweled buckle to hold her tunic together, and wore her hair gathered in a ribbon.": null
    },
    {
        "Diana was often considered an aspect of a ": null
    },
    {
        "triple goddess": "https://en.wikipedia.org/wiki/Triple_deity"
    },
    {
        ", known as Diana triformis: Diana, ": null
    },
    {
        "Luna": "https://en.wikipedia.org/wiki/Luna_(goddess)"
    },
    {
        ", and ": null
    },
    {
        "Hecate": "https://en.wikipedia.org/wiki/Hecate"
    },
    {
        ". According to historian C.M. Green, \"these were neither different goddesses nor an amalgamation of different goddesses. They were Diana...Diana as huntress, Diana as the moon, Diana of the underworld.\" At her ": null
    },
    {
        "sacred grove": "https://en.wikipedia.org/wiki/Sacred_grove"
    },
    {
        " on the shores of Lake Nemi, Diana was venerated as a triple goddess beginning in the late 6th century BCE.": null
    },
    {
        "Andreas Alföldi": "https://en.wikipedia.org/wiki/Andreas_Alf%C3%B6ldi"
    },
    {
        " interpreted an image on a late Republican coin as the Latin Diana \"conceived as a threefold unity of the divine huntress, the Moon goddess and the goddess of the nether world, ": null
    },
    {
        "Hekate": "https://en.wikipedia.org/wiki/Hekate"
    },
    {
        "\". This coin, minted by P. Accoleius Lariscolus in 43 BCE, has been acknowledged as representing an archaic statue of Diana Nemorensis. It represents Artemis with the bow at one extremity, Luna-Selene with flowers at the other and a central deity not immediately identifiable, all united by a horizontal bar. The iconographical analysis allows the dating of this image to the 6th century at which time there are Etruscan models. The coin shows that the triple goddess cult image still stood in the lucus of Nemi in 43 BCE. Lake Nemi was called Triviae lacus by Virgil (Aeneid 7.516), while ": null
    },
    {
        "Horace": "https://en.wikipedia.org/wiki/Horace"
    },
    {
        " called Diana montium custos nemoremque virgo (\"keeper of the mountains and virgin of Nemi\") and diva triformis (\"three-form goddess\").": null
    },
    {
        "Two heads found in the sanctuary and the Roman theatre at Nemi, which have a hollow on their back, lend support to this interpretation of an archaic triple Diana. ": null
    },
    {
        "The earliest epithet of Diana was Trivia, and she was addressed with that title by Virgil, Catullus, and many others. \"Trivia\" comes from the Latin trivium, \"triple way\", and refers to Diana's guardianship over roadways, particularly Y-junctions or three-way crossroads. This role carried a somewhat dark and dangerous connotation, as it metaphorically pointed the way to the underworld. In the 1st-century CE play ": null
    },
    {
        "Medea": "https://en.wikipedia.org/wiki/Medea_(Seneca)"
    },
    {
        ", ": null
    },
    {
        "Seneca's": "https://en.wikipedia.org/wiki/Seneca_the_Younger"
    },
    {
        " titular sorceress calls on Trivia to cast a magic spell. She evokes the triple goddess of Diana, Selene, and Hecate, and specifies that she requires the powers of the latter. The 1st century poet ": null
    },
    {
        "Horace": "https://en.wikipedia.org/wiki/Horace"
    },
    {
        " similarly wrote of a magic incantation invoking the power of both Diana and Proserpina. The symbol of the crossroads is relevant to several aspects of Diana's domain. It can symbolize the paths hunters may encounter in the forest, lit only by the full moon; this symbolizes making choices \"in the dark\" without the light of guidance.": null
    },
    {
        "Diana's role as a goddess of the underworld, or at least of ushering people between life and death, caused her early on to be conflated with ": null
    },
    {
        "Hecate": "https://en.wikipedia.org/wiki/Hecate"
    },
    {
        " (and occasionally also with ": null
    },
    {
        "Proserpina": "https://en.wikipedia.org/wiki/Proserpina"
    },
    {
        "). However, her role as an underworld goddess appears to pre-date strong Greek influence (though the early Greek colony of ": null
    },
    {
        "Cumae": "https://en.wikipedia.org/wiki/Cumae"
    },
    {
        " had a cult of Hekate and certainly had contacts with the Latins). A theater in her sanctuary at Lake Nemi included a pit and tunnel that would have allowed actors to easily descend on one side of the stage and ascend on the other, indicating a connection between the phases of the moon and a descent by the moon goddess into the underworld. It is likely that her underworld aspect in her original Latin worship did not have a distinct name, like Luna was for her moon aspect. This is due to a seeming reluctance or taboo by the early Latins to name underworld deities, and the fact that they believed the underworld to be silent, precluding naming. Hekate, a Greek goddess also associated with the boundary between the earth and the underworld, became attached to Diana as a name for her underworld aspect following Greek influence.": null
    },
    {
        "Diana was often considered to be a goddess associated with fertility and childbirth, and the protection of women during labor. This probably arose as an extension of her association with the moon, whose cycles were believed to parallel the menstrual cycle, and which was used to track the months during pregnancy. At her shrine in Aricia, worshipers left votive terracotta offerings for the goddess in the shapes of babies and wombs, and the temple there also offered care of pups and pregnant dogs. This care of infants also extended to the training of both young people and dogs, especially for hunting. In her role as a protector of childbirth, Diana was called Diana ": null
    },
    {
        "Lucina": "https://en.wikipedia.org/wiki/Lucina_(mythology)"
    },
    {
        " or even ": null
    },
    {
        "Juno Lucina": "https://en.wikipedia.org/wiki/Juno_Lucina"
    },
    {
        ", because her domain overlapped with that of the goddess Juno. The title of Juno may also have had an independent origin as it applied to Diana, with the literal meaning of \"helper\" - Diana as Juno Lucina would be the \"helper of childbirth\".": null
    },
    {
        "According to a theory proposed by ": null
    },
    {
        "Georges Dumézil": "https://en.wikipedia.org/wiki/Georges_Dum%C3%A9zil"
    },
    {
        ", Diana falls into a particular subset of celestial gods, referred to in histories of religion as frame gods. Such gods, while keeping the original features of celestial divinities (i.e. transcendent heavenly power and abstention from direct rule in worldly matters), did not share the fate of other celestial gods in Indoeuropean religions - that of becoming dei otiosi, or gods without practical purpose, since they did retain a particular sort of influence over the world and mankind. The celestial character of Diana is reflected in her connection with inaccessibility, virginity, light, and her preference for dwelling on high mountains and in sacred woods. Diana, therefore, reflects the heavenly world in its sovereignty, supremacy, impassibility, and indifference towards such secular matters as the fates of mortals and states. At the same time, however, she is seen as active in ensuring the succession of kings and in the preservation of humankind through the protection of childbirth. These functions are apparent in the traditional institutions and cults related to the goddess:": null
    },
    {
        "According to Dumezil, the forerunner of all frame gods is an Indian epic hero who was the image (": null
    },
    {
        "avatar": "https://en.wikipedia.org/wiki/Avatar"
    },
    {
        ") of the Vedic god Dyaus. Having renounced the world, in his roles of father and king, he attained the status of an immortal being while retaining the duty of ensuring that his dynasty is preserved and that there is always a new king for each generation. The Scandinavian god ": null
    },
    {
        "Heimdallr": "https://en.wikipedia.org/wiki/Heimdallr"
    },
    {
        " performs an analogous function: he is born first and will die last. He too gives origin to kingship and the first king, bestowing on him regal prerogatives.Diana, although a female deity, has exactly the same functions, preserving mankind through childbirth and royal succession.": null
    },
    {
        "F. H. Pairault, in her essay on Diana, qualified Dumézil's theory as \"impossible to verify\".": null
    },
    {
        "Unlike the ": null
    },
    {
        "Greek gods": "https://en.wikipedia.org/wiki/Greek_mythology"
    },
    {
        ", Roman gods were originally considered to be ": null
    },
    {
        "numina": "https://en.wikipedia.org/wiki/Numen"
    },
    {
        ": divine powers of presence and will that did not necessarily have physical form. At the time Rome was founded, Diana and the other major Roman gods probably did not have much mythology per se, or any depictions in human form. The idea of gods as having ": null
    },
    {
        "anthropomorphic": "https://en.wikipedia.org/wiki/Anthropomorphism"
    },
    {
        " qualities and human-like personalities and actions developed later, under the influence of Greek and Etruscan religion.": null
    },
    {
        "By the 3rd century BCE, Diana is found listed among the twelve major gods of the Roman pantheon by the poet ": null
    },
    {
        "Ennius": "https://en.wikipedia.org/wiki/Ennius"
    },
    {
        ". Though the ": null
    },
    {
        "Capitoline Triad": "https://en.wikipedia.org/wiki/Capitoline_Triad"
    },
    {
        " were the primary state gods of Rome, early Roman myth did not assign a strict hierarchy to the gods the way Greek mythology did, though the Greek hierarchy would eventually be adopted by Roman religion as well.": null
    },
    {
        "Once Greek influence had caused Diana to be considered identical to the Greek goddess ": null
    },
    {
        "Artemis": "https://en.wikipedia.org/wiki/Artemis"
    },
    {
        ", Diana acquired Artemis' physical description, attributes, and variants of her myths as well. Like Artemis, Diana is usually depicted in art wearing a short skirt, with a hunting bow and quiver, and often accompanied by hunting dogs. A 1st-century BCE Roman coin (see above) depicted her with a unique, short hairstyle, and in triple form, with one form holding a bow and another holding a ": null
    },
    {
        "poppy": "https://en.wikipedia.org/wiki/Poppy"
    },
    {
        ".": null
    },
    {
        "When worship of Apollo was first introduced to Rome, Diana became conflated with Apollo's sister Artemis as in the earlier Greek myths, and as such she became identified as the daughter of Apollo's parents Latona and Jupiter. Though Diana was usually considered to be a virgin goddess like Artemis, later authors sometimes attributed consorts and children to her. According to ": null
    },
    {
        "Cicero": "https://en.wikipedia.org/wiki/Cicero"
    },
    {
        " and ": null
    },
    {
        "Ennius": "https://en.wikipedia.org/wiki/Ennius"
    },
    {
        ", Trivia (an epithet of Diana) and ": null
    },
    {
        "Caelus": "https://en.wikipedia.org/wiki/Caelus"
    },
    {
        " were the parents of ": null
    },
    {
        "Janus": "https://en.wikipedia.org/wiki/Janus_(mythology)"
    },
    {
        ", as well as of ": null
    },
    {
        "Saturn": "https://en.wikipedia.org/wiki/Saturn_(mythology)"
    },
    {
        " and ": null
    },
    {
        "Ops": "https://en.wikipedia.org/wiki/Ops"
    },
    {
        ".": null
    },
    {
        "According to ": null
    },
    {
        "Macrobius": "https://en.wikipedia.org/wiki/Macrobius"
    },
    {
        " (who cited ": null
    },
    {
        "Nigidius Figulus": "https://en.wikipedia.org/wiki/Nigidius_Figulus"
    },
    {
        " and ": null
    },
    {
        "Cicero": "https://en.wikipedia.org/wiki/Cicero"
    },
    {
        "), ": null
    },
    {
        "Janus": "https://en.wikipedia.org/wiki/Janus"
    },
    {
        " and Jana (Diana) are a pair of divinities, worshiped as the ": null
    },
    {
        "sun": "https://en.wikipedia.org/wiki/Sol_(mythology)"
    },
    {
        " and ": null
    },
    {
        "moon": "https://en.wikipedia.org/wiki/Luna_(mythology)"
    },
    {
        ". Janus was said to receive sacrifices before all the others because, through him, the way of access to the desired deity is made apparent.": null
    },
    {
        "Diana's mythology incorporated stories which were variants of earlier stories about Artemis. Possibly the most well-known of these is the myth of ": null
    },
    {
        "Actaeon": "https://en.wikipedia.org/wiki/Actaeon"
    },
    {
        ". In ": null
    },
    {
        "Ovid": "https://en.wikipedia.org/wiki/Ovid"
    },
    {
        "'s version of this myth, part of his poem ": null
    },
    {
        "Metamorphoses": "https://en.wikipedia.org/wiki/Metamorphoses"
    },
    {
        ", he tells of a pool or grotto hidden in the wooded valley of Gargaphie. There, Diana, the goddess of the woods, would bathe and rest after a hunt. Actaeon, a young hunter, stumbled across the grotto and accidentally witnessed the goddess bathing without invitation. In retaliation, Diana splashed him with water from the pool, cursing him, and he transformed into a deer. His own hunting dogs caught his scent, and tore him apart.": null
    },
    {
        "Ovid's version of the myth of Actaeon differs from most earlier sources. Unlike earlier myths about Artemis, Actaeon is killed for an innocent mistake, glimpsing Diana bathing. An earlier variant of this myth, known as the Bath of ": null
    },
    {
        "Pallas": "https://en.wikipedia.org/wiki/Athena"
    },
    {
        ", had the hunter intentionally spy on the bathing goddess Pallas (Athena), and earlier versions of the myth involving Artemis did not involve the bath at all.": null
    },
    {
        "Diana was an ancient goddess common to all Latin tribes. Therefore, many sanctuaries were dedicated to her in the lands inhabited by Latins. Her primary sanctuary was a woodland grove overlooking ": null
    },
    {
        "Lake Nemi": "https://en.wikipedia.org/wiki/Lake_Nemi"
    },
    {
        ", a body of water also known as \"Diana's Mirror\", where she was worshiped as ": null
    },
    {
        "Diana Nemorensis": "https://en.wikipedia.org/wiki/Diana_Nemorensis"
    },
    {
        ", or \"Diana of the Wood\". In Rome, the cult of Diana may have been almost as old as the city itself. Varro mentions her in the list of deities to whom king ": null
    },
    {
        "Titus Tatius": "https://en.wikipedia.org/wiki/Titus_Tatius"
    },
    {
        " promised to build a shrine. His list included Luna and Diana Lucina as separate entities. Another testimony to the antiquity of her cult is to be found in the lex regia of King ": null
    },
    {
        "Tullus Hostilius": "https://en.wikipedia.org/wiki/Tullus_Hostilius"
    },
    {
        " that condemns those guilty of incest to the sacratio to Diana. She had a temple in Rome on the ": null
    },
    {
        "Aventine Hill": "https://en.wikipedia.org/wiki/Aventine_Hill"
    },
    {
        ", according to tradition dedicated by king ": null
    },
    {
        "Servius Tullius": "https://en.wikipedia.org/wiki/Servius_Tullius"
    },
    {
        ". Its location is remarkable as the Aventine is situated outside the ": null
    },
    {
        "pomerium": "https://en.wikipedia.org/wiki/Pomerium"
    },
    {
        ", i.e. original territory of the city, in order to comply with the tradition that Diana was a goddess common to all Latins and not exclusively of the Romans. Being placed on the Aventine, and thus outside the ": null
    },
    {
        "pomerium": "https://en.wikipedia.org/wiki/Pomerium"
    },
    {
        ", meant that Diana's cult essentially remained a foreign one, like that of ": null
    },
    {
        "Bacchus": "https://en.wikipedia.org/wiki/Dionysus"
    },
    {
        "; she was never officially transferred to Rome as ": null
    },
    {
        "Juno": "https://en.wikipedia.org/wiki/Juno_(mythology)"
    },
    {
        " was after the sack of ": null
    },
    {
        "Veii": "https://en.wikipedia.org/wiki/Veii"
    },
    {
        ".": null
    },
    {
        "Other known sanctuaries and temples to Diana include Colle di Corne near ": null
    },
    {
        "Tusculum": "https://en.wikipedia.org/wiki/Tusculum"
    },
    {
        ", where she is referred to with the archaic Latin name of deva Cornisca and where existed a ": null
    },
    {
        "collegium": "https://en.wikipedia.org/wiki/Collegium"
    },
    {
        " of worshippers; at Évora, Portugal; Mount Algidus, also near Tusculum; at ": null
    },
    {
        "Lavinium": "https://en.wikipedia.org/wiki/Lavinium"
    },
    {
        "; and at ": null
    },
    {
        "Tibur": "https://en.wikipedia.org/wiki/Tibur"
    },
    {
        " (Tivoli), where she is referred to as Diana Opifera Nemorensis. Diana was also worshiped at a sacred wood mentioned by Livy - ad compitum Anagninum (near ": null
    },
    {
        "Anagni": "https://en.wikipedia.org/wiki/Anagni"
    },
    {
        "), and on Mount ": null
    },
    {
        "Tifata": "https://en.wikipedia.org/wiki/Tifata"
    },
    {
        " in Campania.": null
    },
    {
        "According to ": null
    },
    {
        "Plutarch": "https://en.wikipedia.org/wiki/Plutarch"
    },
    {
        ", men and women alike were worshipers of Diana and were welcomed into all of her temples. The one exception seems to have been a temple on the ": null
    },
    {
        "Vicus Patricius": "https://en.wikipedia.org/wiki/Vicus_Patricius"
    },
    {
        ", which men either did not enter due to tradition, or were not allowed to enter. Plutarch related a legend that a man had attempted to assault a woman worshiping in this temple and was killed by a pack of dogs (echoing the myth of Diana and Actaeon), which resulted in a superstition against men entering the temple.": null
    },
    {
        "A feature common to nearly all of Diana's temples and shrines by the second century AD was the hanging up of stag antlers. Plutarch noted that the only exception to this was the temple on the Aventine Hill, in which bull horns had been hung up instead. Plutarch explains this by way of reference to a legend surrounding the sacrifice of an impressive ": null
    },
    {
        "Sabine": "https://en.wikipedia.org/wiki/Sabine"
    },
    {
        " bull by King Servius at the founding of the Aventine temple.": null
    },
    {
        "Diana's worship may have originated at an open-air sanctuary overlooking ": null
    },
    {
        "Lake Nemi": "https://en.wikipedia.org/wiki/Lake_Nemi"
    },
    {
        " in the ": null
    },
    {
        "Alban Hills": "https://en.wikipedia.org/wiki/Alban_Hills"
    },
    {
        " near ": null
    },
    {
        "Aricia": "https://en.wikipedia.org/wiki/Ariccia"
    },
    {
        ", where she was worshiped as ": null
    },
    {
        "Diana Nemorensis": "https://en.wikipedia.org/wiki/Diana_Nemorensis"
    },
    {
        ", or (\"Diana of the Sylvan Glade\"). According to legendary accounts, the sanctuary was founded by ": null
    },
    {
        "Orestes": "https://en.wikipedia.org/wiki/Orestes"
    },
    {
        " and ": null
    },
    {
        "Iphigenia": "https://en.wikipedia.org/wiki/Iphigenia"
    },
    {
        " after they fled from the ": null
    },
    {
        "Tauri": "https://en.wikipedia.org/wiki/Tauri"
    },
    {
        ". In this tradition, the Nemi sanctuary was supposedly built on the pattern of an earlier Temple of Artemis Tauropolos, and the first cult statue at Nemi was said to have been stolen from the Tauri and brought to Nemi by Orestes. Historical evidence suggests that worship of Diana at Nemi flourished from at least the 6th century BCE until the 2nd century CE. Her cult there was first attested in Latin literature by ": null
    },
    {
        "Cato the Elder": "https://en.wikipedia.org/wiki/Cato_the_Elder"
    },
    {
        ", in a surviving quote by the late grammarian ": null
    },
    {
        "Priscian": "https://en.wikipedia.org/wiki/Priscian"
    },
    {
        ". By the 4th century BCE, the simple shrine at Nemi had been joined by a temple complex. The sanctuary served an important political role as it was held in common by the ": null
    },
    {
        "Latin League": "https://en.wikipedia.org/wiki/Latin_League"
    },
    {
        ".": null
    },
    {
        "A festival to Diana, the ": null
    },
    {
        "Nemoralia": "https://en.wikipedia.org/wiki/Nemoralia"
    },
    {
        ", was held yearly at Nemi on the Ides of August (August 13-15). Worshipers traveled to Nemi carrying torches and garlands, and once at the lake, they left pieces of thread tied to fences and tablets inscribed with prayers. Diana's festival eventually became widely celebrated throughout Italy, which was unusual given the provincial nature of Diana's cult. The poet ": null
    },
    {
        "Statius": "https://en.wikipedia.org/wiki/Statius"
    },
    {
        " wrote of the festival:": null
    },
    {
        "Statius describes the triple nature of the goddess by invoking heavenly (the stars), earthly (the grove itself) and underworld (Hecate) imagery. He also suggests by the garlanding of the dogs and polishing of the spears that no hunting was allowed during the festival.": null
    },
    {
        "Legend has it that Diana's high priest at Nemi, known as the ": null
    },
    {
        "Rex Nemorensis": "https://en.wikipedia.org/wiki/Rex_Nemorensis"
    },
    {
        ", was always an escaped slave who could only obtain the position by defeating his predecessor in a fight to the death. Sir ": null
    },
    {
        "James George Frazer": "https://en.wikipedia.org/wiki/James_George_Frazer"
    },
    {
        " wrote of this sacred grove in ": null
    },
    {
        "The Golden Bough": "https://en.wikipedia.org/wiki/The_Golden_Bough"
    },
    {
        ", basing his interpretation on brief remarks in ": null
    },
    {
        "Strabo": "https://en.wikipedia.org/wiki/Strabo"
    },
    {
        " (5.3.12), ": null
    },
    {
        "Pausanias": "https://en.wikipedia.org/wiki/Pausanias_(geographer)"
    },
    {
        " (2,27.24) and ": null
    },
    {
        "Servius": "https://en.wikipedia.org/wiki/Servius"
    },
    {
        "' commentary on the ": null
    },
    {
        "Aeneid": "https://en.wikipedia.org/wiki/Aeneid"
    },
    {
        " (6.136). The legend tells of a tree that stood in the center of the grove and was heavily guarded. No one was allowed to break off its limbs, with the exception of a runaway slave, who was allowed, if he could, to break off one of the boughs. He was then in turn granted the privilege to engage the Rex Nemorensis, the current king and priest of Diana, in a fight to the death. If the slave prevailed, he became the next king for as long as he could defeat his challengers. However, ": null
    },
    {
        "Joseph Fontenrose": "https://en.wikipedia.org/wiki/Joseph_Fontenrose"
    },
    {
        " criticised Frazer's assumption that a rite of this sort actually occurred at the sanctuary, and no contemporary records exist that support the historical existence of the Rex Nemorensis.": null
    },
    {
        "Rome hoped to unify into and control the Latin tribes around Nemi, so Diana's worship was imported to Rome as a show of political solidarity. Diana soon afterwards became Hellenized, and combined with the ": null
    },
    {
        "Greek goddess": "https://en.wikipedia.org/wiki/Greek_mythology"
    },
    {
        "Artemis": "https://en.wikipedia.org/wiki/Artemis"
    },
    {
        ", \"a process which culminated with the appearance of Diana beside Apollo [the brother of Artemis] in the first ": null
    },
    {
        "lectisternium": "https://en.wikipedia.org/wiki/Lectisternium"
    },
    {
        " at Rome\" in 399 BCE. The process of identification between the two goddesses probably began when artists who were commissioned to create new cult statues for Diana's temples outside Nemi were struck by the similar attributes between Diana and the more familiar Artemis, and sculpted Diana in a manner inspired by previous depictions of Artemis. Sibyllene influence and trade with ": null
    },
    {
        "Massilia": "https://en.wikipedia.org/wiki/Massilia"
    },
    {
        ", where similar cult statues of Artemis existed, would have completed the process.": null
    },
    {
        "According to Françoise Hélène Pairault's study, historical and archaeological evidence point to the fact that the characteristics given to both Diana of the Aventine Hill and ": null
    },
    {
        "Diana Nemorensis": "https://en.wikipedia.org/wiki/Diana_Nemorensis"
    },
    {
        " were the product of the direct or indirect influence of the cult of Artemis, which was spread by the Phoceans among the Greek towns of Campania ": null
    },
    {
        "Cuma": "https://en.wikipedia.org/wiki/Cumae"
    },
    {
        " and ": null
    },
    {
        "Capua": "https://en.wikipedia.org/wiki/Capua"
    },
    {
        ", who in turn had passed it over to the Etruscans and the Latins by the 6th and 5th centuries BCE.": null
    },
    {
        "Evidence suggests that a confrontation occurred between two groups of Etruscans who fought for supremacy, those from ": null
    },
    {
        "Tarquinia": "https://en.wikipedia.org/wiki/Tarquinia"
    },
    {
        ", ": null
    },
    {
        "Vulci": "https://en.wikipedia.org/wiki/Vulci"
    },
    {
        " and ": null
    },
    {
        "Caere": "https://en.wikipedia.org/wiki/Caere"
    },
    {
        " (allied with the Greeks of Capua) and those of ": null
    },
    {
        "Clusium": "https://en.wikipedia.org/wiki/Clusium"
    },
    {
        ". This is reflected in the legend of the coming of Orestes to Nemi and of the inhumation of his bones in the Roman Forum near the temple of Saturn. The cult introduced by Orestes at Nemi is apparently that of the ": null
    },
    {
        "Artemis Tauropolos": "https://en.wikipedia.org/wiki/Artemis_Tauropolos"
    },
    {
        ". The literary amplification reveals a confused religious background: different versions of Artemis were conflated under the epithet. As far as Nemi's Diana is concerned there are two different versions, by ": null
    },
    {
        "Strabo": "https://en.wikipedia.org/wiki/Strabo"
    },
    {
        " and ": null
    },
    {
        "Servius Honoratus": "https://en.wikipedia.org/wiki/Servius_Honoratus"
    },
    {
        ". Strabo's version looks to be the most authoritative as he had access to first-hand primary sources on the sanctuaries of Artemis, i.e. the priest of Artemis Artemidoros of Ephesus. The meaning of Tauropolos denotes an Asiatic goddess with lunar attributes, lady of the herds. The only possible interpretatio graeca of high antiquity concerning Diana Nemorensis could have been the one based on this ancient aspect of a deity of light, master of wildlife. Tauropolos is an ancient epithet attached to Artemis, ": null
    },
    {
        "Hecate": "https://en.wikipedia.org/wiki/Hecate"
    },
    {
        ", and even ": null
    },
    {
        "Athena": "https://en.wikipedia.org/wiki/Athena"
    },
    {
        ". According to the legend Orestes founded Nemi together with Iphigenia. At Cuma the ": null
    },
    {
        "Sybil": "https://en.wikipedia.org/wiki/Sibyl"
    },
    {
        " is the priestess of both ": null
    },
    {
        "Phoibos": "https://en.wikipedia.org/wiki/Phoibos"
    },
    {
        " and Trivia.": null
    },
    {
        "Hesiod": "https://en.wikipedia.org/wiki/Hesiod"
    },
    {
        " and ": null
    },
    {
        "Stesichorus": "https://en.wikipedia.org/wiki/Stesichorus"
    },
    {
        " tell the story according to which after her death ": null
    },
    {
        "Iphigenia": "https://en.wikipedia.org/wiki/Iphigenia"
    },
    {
        " was divinised under the name of Hecate, a fact which would support the assumption that Artemis Tauropolos had a real ancient alliance with the heroine, who was her priestess in ": null
    },
    {
        "Taurid": "https://en.wikipedia.org/wiki/Taurid"
    },
    {
        " and her human paragon. This religious complex is in turn supported by the triple statue of Artemis-Hecate.": null
    },
    {
        "In Rome, Diana was regarded with great reverence and was a patroness of lower-class citizens, called ": null
    },
    {
        "plebeians": "https://en.wikipedia.org/wiki/Plebeians"
    },
    {
        ", as well as ": null
    },
    {
        "slaves": "https://en.wikipedia.org/wiki/Slavery"
    },
    {
        ", who could receive asylum in her temples. ": null
    },
    {
        "Georg Wissowa": "https://en.wikipedia.org/wiki/Georg_Wissowa"
    },
    {
        " proposed that this might be because the first slaves of the Romans were Latins of the neighboring tribes. However, the ": null
    },
    {
        "Temple of Artemis": "https://en.wikipedia.org/wiki/Temple_of_Artemis"
    },
    {
        " at Ephesus had the same custom of the asylum.": null
    },
    {
        "Worship of Diana probably spread into the city of Rome beginning around 550 BCE, during her Hellenization and combination with the Greek goddess Artemis. Diana was first worshiped along with her brother and mother, ": null
    },
    {
        "Apollo": "https://en.wikipedia.org/wiki/Apollo"
    },
    {
        " and ": null
    },
    {
        "Latona": "https://en.wikipedia.org/wiki/Latona"
    },
    {
        ", in their temple in the ": null
    },
    {
        "Campus Martius": "https://en.wikipedia.org/wiki/Campus_Martius"
    },
    {
        ", and later in the ": null
    },
    {
        "Temple of Apollo Palatinus": "https://en.wikipedia.org/wiki/Temple_of_Apollo_Palatinus"
    },
    {
        ".": null
    },
    {
        "The first major temple dedicated primarily to Diana in the vicinity of Rome was the ": null
    },
    {
        "Temple of Diana Aventina": "https://en.wikipedia.org/wiki/Temple_of_Diana_(Rome)"
    },
    {
        " (Diana of the ": null
    },
    {
        "Aventine Hill": "https://en.wikipedia.org/wiki/Aventine_Hill"
    },
    {
        "). According to the Roman historian ": null
    },
    {
        "Livy": "https://en.wikipedia.org/wiki/Livy"
    },
    {
        ", the construction of this temple began in the 6th century BCE and was inspired by stories of the massive ": null
    },
    {
        "Temple of Artemis": "https://en.wikipedia.org/wiki/Temple_of_Artemis"
    },
    {
        " at ": null
    },
    {
        "Ephesus": "https://en.wikipedia.org/wiki/Ephesus"
    },
    {
        ", which was said to have been built through the combined efforts of all the cities of ": null
    },
    {
        "Asia Minor": "https://en.wikipedia.org/wiki/Asia_Minor"
    },
    {
        ". Legend has it that ": null
    },
    {
        "Servius Tullius": "https://en.wikipedia.org/wiki/Servius_Tullius"
    },
    {
        " was impressed with this act of massive political and economic cooperation, and convinced the cities of the ": null
    },
    {
        "Latin League": "https://en.wikipedia.org/wiki/Latin_League"
    },
    {
        " to work with the Romans to build their own temple to the goddess. However, there is no compelling evidence for such an early construction of the temple, and it is more likely that it was built in the 3rd century BCE, following the influence of the temple at Nemi, and probably about the same time the first temples to ": null
    },
    {
        "Vertumnus": "https://en.wikipedia.org/wiki/Vertumnus"
    },
    {
        " (who was associated with Diana) were built in Rome (264 BCE). The misconception that the Aventine Temple was inspired by the Ephesian Temple might originate in the fact that the cult images and statues used at the former were based heavily on those found in the latter. Whatever its initial construction date, records show that the Avantine Temple was rebuilt by ": null
    },
    {
        "Lucius Cornificius": "https://en.wikipedia.org/wiki/Lucius_Cornificius"
    },
    {
        " in 32 BCE. If it was still in use by the 4th century CE, the Aventine temple would have been permanently closed during the ": null
    },
    {
        "persecution of pagans in the late Roman Empire": "https://en.wikipedia.org/wiki/Persecution_of_pagans_in_the_late_Roman_Empire"
    },
    {
        ". Today, a short street named the Via del Tempio di Diana and an associated plaza, Piazza del Tempio di Diana, commemorates the site of the temple. Part of its wall is located within one of the halls of the Apuleius restaurant.": null
    },
    {
        "Later temple dedications often were based on the model for ritual formulas and regulations of the Temple of Diana. Roman politicians built several minor temples to Diana elsewhere in Rome to secure public support. One of these was built in the ": null
    },
    {
        "Campus Martius": "https://en.wikipedia.org/wiki/Campus_Martius"
    },
    {
        " in 187 BCE; no Imperial period records of this temple have been found, and it is possible it was one of the temples demolished around 55 BCE in order to build a theater. Diana also had a public temple on the ": null
    },
    {
        "Quirinal Hill": "https://en.wikipedia.org/wiki/Quirinal_Hill"
    },
    {
        ", the sanctuary of Diana Planciana. It was dedicated by Plancius in 55 BCE, though it is unclear which Plancius.": null
    },
    {
        "In their worship of Artemis, Greeks filled their temples with sculptures of the goddess created by well-known sculptors, and many were adapted for use in the worship of Diana by the Romans, beginning around the 2nd century BCE (the beginning of a period of strong ": null
    },
    {
        "Hellenistic influence": "https://en.wikipedia.org/wiki/Hellenistic_period"
    },
    {
        " on Roman religion). The earliest depictions of the ": null
    },
    {
        "Artemis of Ephesus": "https://en.wikipedia.org/wiki/Artemis_of_Ephesus"
    },
    {
        " are found on Ephesian coins from this period. By the ": null
    },
    {
        "Imperial period": "https://en.wikipedia.org/wiki/Roman_imperial_period_(chronology)"
    },
    {
        ", small marble statues of the Ephesian Artemis were being produced in the Western region of the Mediterranean and were often bought by Roman patrons. The Romans obtained a large copy of an Ephesian Artemis statue for their temple on the Aventine Hill. Diana was usually depicted for educated Romans in her Greek guise. If she was shown accompanied by a deer, as in the ": null
    },
    {
        "Diana of Versailles": "https://en.wikipedia.org/wiki/Diana_of_Versailles"
    },
    {
        ", this is because Diana was the patroness of hunting. The deer may also offer a covert reference to the myth of ": null
    },
    {
        "Acteon": "https://en.wikipedia.org/wiki/Actaeon"
    },
    {
        " (or Actaeon), who saw her bathing naked. Diana transformed Acteon into a stag and set his own hunting dogs to kill him.": null
    },
    {
        "In ": null
    },
    {
        "Campania": "https://en.wikipedia.org/wiki/Campania"
    },
    {
        ", Diana had a major temple at Mount ": null
    },
    {
        "Tifata": "https://en.wikipedia.org/wiki/Tifata"
    },
    {
        ", near ": null
    },
    {
        "Capua": "https://en.wikipedia.org/wiki/Capua"
    },
    {
        ". She was worshiped there as Diana Tifatina. This was one of the oldest sanctuaries in Campania. As a rural sanctuary, it included lands and estates that would have been worked by slaves following the Roman conquest of Campania, and records show that expansion and renovation projects at her temple were funded in part by other conquests by Roman military campaigns. The modern Christian church of ": null
    },
    {
        "Sant'Angelo in Formis": "https://en.wikipedia.org/wiki/Sant%27Angelo_in_Formis"
    },
    {
        " was built on the ruins of the Tifata temple.": null
    },
    {
        "In the Roman provinces, Diana was widely worshiped alongside local deities. Over 100 inscriptions to Diana have been cataloged in the provinces, mainly from ": null
    },
    {
        "Gaul": "https://en.wikipedia.org/wiki/Gaul"
    },
    {
        ", ": null
    },
    {
        "Upper Germania": "https://en.wikipedia.org/wiki/Upper_Germania"
    },
    {
        ", and ": null
    },
    {
        "Britannia": "https://en.wikipedia.org/wiki/Britannia"
    },
    {
        ". Diana was commonly invoked alongside another forest god, ": null
    },
    {
        "Silvanus": "https://en.wikipedia.org/wiki/Silvanus_(mythology)"
    },
    {
        ", as well as other \"mountain gods\". In the provinces, she was occasionally conflated with local goddesses such as ": null
    },
    {
        "Abnoba": "https://en.wikipedia.org/wiki/Abnoba"
    },
    {
        ", and was given high status, with Augusta and regina (\"queen\") being common epithets.": null
    },
    {
        "Diana was not only regarded as a goddess of the wilderness and the hunt, but was often worshiped as a patroness of families. She served a similar function to the hearth goddess ": null
    },
    {
        "Vesta": "https://en.wikipedia.org/wiki/Vesta_(mythology)"
    },
    {
        ", and was sometimes considered to be a member of the ": null
    },
    {
        "Penates": "https://en.wikipedia.org/wiki/Di_Penates"
    },
    {
        ", the deities most often invoked in household rituals. In this role, she was often given a name reflecting the tribe of family who worshiped her and asked for her protection. For example, in what is now ": null
    },
    {
        "Wiesbaden": "https://en.wikipedia.org/wiki/Wiesbaden"
    },
    {
        ", Diana was worshiped as Diana Mattiaca by the ": null
    },
    {
        "Mattiaci": "https://en.wikipedia.org/wiki/Mattiaci"
    },
    {
        " tribe. Other family-derived named attested in the ancient literature include Diana Cariciana, Diana Valeriana, and Diana Plancia. As a house goddess, Diana often became reduced in stature compared to her official worship by the Roman state religion. In personal or family worship, Diana was brought to the level of other household spirits, and was believed to have a vested interest in the prosperity of the household and the continuation of the family. The Roman poet ": null
    },
    {
        "Horace": "https://en.wikipedia.org/wiki/Horace"
    },
    {
        " regarded Diana as a household goddess in his ": null
    },
    {
        "Odes": "https://en.wikipedia.org/wiki/Odes_(Horace)"
    },
    {
        ", and had an altar dedicated to her in his villa where household worship could be conducted. In his poetry, Horace deliberately contrasted the kinds of grand, elevated hymns to Diana on behalf of the entire Roman state, the kind of worship that would have been typical at her Aventine temple, with a more personal form of devotion.": null
    },
    {
        "Images of Diana and her associated myths have been found on ": null
    },
    {
        "sarcophagi": "https://en.wikipedia.org/wiki/Sarcophagus"
    },
    {
        " of wealthy Romans. They often included scenes depicting sacrifices to the goddess, and on at least one example, the deceased man is shown joining Diana's hunt.": null
    },
    {
        "Diana was initially a hunting goddess and goddess of the local woodland at Nemi, but as her worship spread, she acquired attributes of other similar goddesses. As she became conflated with Artemis, she became a ": null
    },
    {
        "moon goddess": "https://en.wikipedia.org/wiki/Moon_goddess"
    },
    {
        ", supplanting the earlier ": null
    },
    {
        "Titan": "https://en.wikipedia.org/wiki/Titan_(mythology)"
    },
    {
        " goddess ": null
    },
    {
        "Luna": "https://en.wikipedia.org/wiki/Luna_(goddess)"
    },
    {
        ". She also became the goddess of childbirth and ruled over the countryside. ": null
    },
    {
        "Catullus": "https://en.wikipedia.org/wiki/Catullus"
    },
    {
        " wrote a poem to Diana in which she has more than one alias: Latonia, ": null
    },
    {
        "Lucina": "https://en.wikipedia.org/wiki/Lucina_(mythology)"
    },
    {
        ", ": null
    },
    {
        "Juno": "https://en.wikipedia.org/wiki/Juno_(mythology)"
    },
    {
        ", Trivia, Luna.": null
    },
    {
        "Along with ": null
    },
    {
        "Mars": "https://en.wikipedia.org/wiki/Mars_(mythology)"
    },
    {
        ", Diana was often venerated at games held in Roman amphitheaters, and some inscriptions from the ": null
    },
    {
        "Danubian provinces": "https://en.wikipedia.org/wiki/Danubian_provinces"
    },
    {
        " show that she was conflated with ": null
    },
    {
        "Nemesis": "https://en.wikipedia.org/wiki/Nemesis"
    },
    {
        " in this role, as Diana Nemesis.": null
    },
    {
        "Outside of Italy, Diana had important centers of worship where she was syncretised with similar local deities in ": null
    },
    {
        "Gaul": "https://en.wikipedia.org/wiki/Gaul"
    },
    {
        ", ": null
    },
    {
        "Upper Germania": "https://en.wikipedia.org/wiki/Germania_Superior"
    },
    {
        ", and ": null
    },
    {
        "Britannia": "https://en.wikipedia.org/wiki/Britannia"
    },
    {
        ". Diana was particularly important in the region in and around the ": null
    },
    {
        "Black Forest": "https://en.wikipedia.org/wiki/Black_Forest"
    },
    {
        ", where she was conflated with the local goddess ": null
    },
    {
        "Abnoba": "https://en.wikipedia.org/wiki/Abnoba"
    },
    {
        " and worshiped as Diana Abnoba.": null
    },
    {
        "Some late antique sources went even further, syncretizing many local \"great goddesses\" into a single \"Queen of Heaven\". The ": null
    },
    {
        "Platonist": "https://en.wikipedia.org/wiki/Platonist"
    },
    {
        " philosopher ": null
    },
    {
        "Apuleius": "https://en.wikipedia.org/wiki/Apuleius"
    },
    {
        ", writing in the late ": null
    },
    {
        "2nd century": "https://en.wikipedia.org/wiki/2nd_century"
    },
    {
        ", depicted the goddess declaring:": null
    },
    {
        "\"I come, Lucius, moved by your entreaties: I, mother of the universe, mistress of all the elements, first-born of the ages, highest of the gods, queen of the shades, first of those who dwell in heaven, representing in one shape all gods and goddesses. My will controls the shining heights of heaven, the health-giving sea-winds, and the mournful silences of hell; the entire world worships my single godhead in a thousand shapes, with divers rites, and under many a different name. The Phrygians, first-born of mankind, call me the Pessinuntian Mother of the gods; the native Athenians the Cecropian Minerva; the island-dwelling Cypriots Paphian Venus; the archer Cretans Dictynnan Diana; the triple-tongued Sicilians Stygian Proserpine; the ancient Eleusinians Actaean Ceres; some call me Juno, some Bellona, others Hecate, others Rhamnusia; but both races of Ethiopians, those on whom the rising and those on whom the setting sun shines, and the Egyptians who excel in ancient learning, honour me with the worship which is truly mine and call me by my true name: Queen Isis.\"": null
    },
    {
        "Later poets and historians looked to Diana's identity as a triple goddess to merge her with triads heavenly, earthly, and underworld (cthonic) goddesses. ": null
    },
    {
        "Maurus Servius Honoratus": "https://en.wikipedia.org/wiki/Maurus_Servius_Honoratus"
    },
    {
        " said that the same goddess was called Luna in heaven, Diana on earth, and ": null
    },
    {
        "Proserpina": "https://en.wikipedia.org/wiki/Proserpina"
    },
    {
        " in hell.": null
    },
    {
        "Michael Drayton": "https://en.wikipedia.org/wiki/Michael_Drayton"
    },
    {
        " praises the Triple Diana in poem The Man in the Moone (1606): \"So these great three most powerful of the rest, ": null
    },
    {
        "Phoebe": "https://en.wikipedia.org/wiki/Phoebe_(mythology)"
    },
    {
        ", Diana, ": null
    },
    {
        "Hecate": "https://en.wikipedia.org/wiki/Hecate"
    },
    {
        ", do tell. Her sovereignty in Heaven, in Earth and Hell\".": null
    },
    {
        "Sermons and other religious documents have provided evidence for the worship of Diana during the Middle Ages. Though few details have been recorded, enough references to Diana worship during the early Christian period exist to give some indication that it may have been relatively widespread among remote and rural communities throughout Europe, and that such beliefs persisted into the ": null
    },
    {
        "Merovingian": "https://en.wikipedia.org/wiki/Merovingian_dynasty"
    },
    {
        " period. References to contemporary Diana worship exist from the 6th century on the Iberian peninsula and what is now southern France, though more detailed accounts of Dianic cults were given for the ": null
    },
    {
        "Low Countries": "https://en.wikipedia.org/wiki/Mythology_in_the_Low_Countries"
    },
    {
        ", and southern Belgium in particular. Many of these were probably local goddesses, and wood nymphs or ": null
    },
    {
        "dryads": "https://en.wikipedia.org/wiki/Dryad"
    },
    {
        ", which had been conflated with Diana by Christian writers Latinizing local names and traditions.": null
    },
    {
        "The 6th century bishop ": null
    },
    {
        "Gregory of Tours": "https://en.wikipedia.org/wiki/Gregory_of_Tours"
    },
    {
        " reported meeting with a deacon named Vulfilaic (also known as Saint Wulflaicus or Walfroy the ": null
    },
    {
        "Stylite": "https://en.wikipedia.org/wiki/Stylite"
    },
    {
        "), who founded a hermitage on a hill in what is now ": null
    },
    {
        "Margut": "https://en.wikipedia.org/wiki/Margut"
    },
    {
        ", France. On the same hill, he found \"an image of Diana which the unbelieving people worshiped as a god.\" According to Gregory's report, worshipers would also sing chants in Diana's honor as they drank and feasted. Vulfilaic destroyed a number of smaller pagan statues in the area, but the statue of Diana was too large. After converting some of the local population to Christianity, Vulfilaic and a group of local residents attempted to pull the large statue down the mountain in order to destroy it, but failed, as it was too large to be moved. In Vulfilaic's account, after praying for a miracle, he was then able to single-handedly pull down the statue, at which point he and his group smashed it to dust with their hammers. According to Vulfilaic, this incident was quickly followed by an outbreak of pimples or sores that covered his entire body, which he attributed to demonic activity and similarly cured via what he described as a miracle. Vulfilaic would later found a church on the site, which is today known as Mont Saint-Walfroy.": null
    },
    {
        "Additional evidence for surviving pagan practices in the Low Countries region comes from the Vita Eligii, or \"Life of ": null
    },
    {
        "Saint Eligius": "https://en.wikipedia.org/wiki/Saint_Eligius"
    },
    {
        "\", written by ": null
    },
    {
        "Audoin": "https://en.wikipedia.org/wiki/Audoin_(bishop)"
    },
    {
        " in the 7th century. Audoin drew together the familiar admonitions of Eligius to the people of ": null
    },
    {
        "Flanders": "https://en.wikipedia.org/wiki/Flanders"
    },
    {
        ". In his sermons, he denounced \"pagan customs\" that the people continued to follow. In particular, he denounced several Roman gods and goddesses alongside ": null
    },
    {
        "Druidic": "https://en.wikipedia.org/wiki/Druid"
    },
    {
        " mythological beliefs and objects:": null
    },
    {
        "\"I denounce and contest, that you shall observe no sacrilegious pagan customs. For no cause or infirmity should you consult magicians, diviners, sorcerers or incantators. ..Do not observe ": null
    },
    {
        "auguries": "https://en.wikipedia.org/wiki/Augur"
    },
    {
        " ... No influence attaches to the first work of the day or the [phase of the] moon. ... [Do not] make ": null
    },
    {
        "vetulas": "https://en.wiktionary.org/wiki/vetulas"
    },
    {
        ", little deer or ": null
    },
    {
        "iotticos": "https://en.wikipedia.org/w/index.php?title=Iotticos&action=edit&redlink=1"
    },
    {
        " or set tables at night or exchange New Year gifts or supply superfluous drinks... No Christian... performs solestitia or dancing or leaping or diabolical chants. No Christian should presume to invoke the name of a demon, not Neptune or Orcus or Diana or Minerva or ": null
    },
    {
        "Geniscus": "https://en.wikipedia.org/wiki/Geniscus"
    },
    {
        "... No one should observe Jove's day in idleness. ... No Christian should make or render any devotion to the gods of the trivium, where three roads meet, to the ": null
    },
    {
        "fanes": "https://en.wiktionary.org/wiki/fane"
    },
    {
        " or the rocks, or springs or groves or corners. None should presume to hang any ": null
    },
    {
        "phylacteries": "https://en.wiktionary.org/wiki/phylactery"
    },
    {
        " from the neck of man nor beast. ..None should presume to make lustrations or incantations with herbs, or to pass cattle through a hollow tree or ditch ... No woman should presume to hang amber from her neck or call upon Minerva or other ill-starred beings in their weaving or dyeing. .. None should call the sun or moon lord or swear by them. .. No one should tell ": null
    },
    {
        "fate": "https://en.wikipedia.org/wiki/Destiny"
    },
    {
        " or fortune or ": null
    },
    {
        "horoscopes": "https://en.wikipedia.org/wiki/Horoscope"
    },
    {
        " by them as those do who believe that a person must be what he was born to be.\"": null
    },
    {
        "Legends from medieval ": null
    },
    {
        "Belgium": "https://en.wikipedia.org/wiki/Belgium"
    },
    {
        " concern a natural spring which came to be known as the \"Fons Remacli\", a location which may have been home to late-surviving worship of Diana. ": null
    },
    {
        "Remacle": "https://en.wikipedia.org/wiki/Remaclus"
    },
    {
        " was a monk appointed by Eligius to head a monastery at ": null
    },
    {
        "Solignac": "https://en.wikipedia.org/wiki/Solignac"
    },
    {
        ", and he is reported to have encountered Diana worship in the area around the river ": null
    },
    {
        "Warche": "https://en.wikipedia.org/wiki/Warche"
    },
    {
        ". The population in this region was said to have been involved in the worship of \"Diana of the ": null
    },
    {
        "Ardennes": "https://en.wikipedia.org/wiki/Ardennes"
    },
    {
        "\" (a syncretism of Diana and the ": null
    },
    {
        "Celtic goddess": "https://en.wikipedia.org/wiki/Celtic_polytheism"
    },
    {
        "Arduinna": "https://en.wikipedia.org/wiki/Arduinna"
    },
    {
        "), with effigies and \"stones of Diana\" used as evidence of pagan practices. Remacle believed that demonic entities were present in the spring, and had caused it to run dry. He performed and exorcism of the water source, and installed a lead pipe, which allowed the water to flow again.": null
    },
    {
        "Diana is the only pagan goddess mentioned by name in the ": null
    },
    {
        "New Testament": "https://en.wikipedia.org/wiki/New_Testament"
    },
    {
        " (": null
    },
    {
        "Acts 19": "https://en.wikipedia.org/wiki/Acts_19"
    },
    {
        "). As a result, she became associated with many folk beliefs involving goddess-like supernatural figures that ": null
    },
    {
        "Catholic": "https://en.wikipedia.org/wiki/Catholic_Church"
    },
    {
        " clergy wished to demonize. In the ": null
    },
    {
        "Middle Ages": "https://en.wikipedia.org/wiki/Middle_Ages"
    },
    {
        ", legends of night-time processions of spirits led by a female figure are recorded in the church records of ": null
    },
    {
        "Northern Italy": "https://en.wikipedia.org/wiki/Northern_Italy"
    },
    {
        ", western Germany, and southern France. The spirits were said to enter houses and consume food which then miraculously re-appeared. They would sing and dance, and dispense advise regarding healing herbs and the whereabouts of lost objects. If the house was in good order, they would bring fertility and plenty. If not, they would bring curses to the family. Some women reported participating in these processions while their bodies still lay in bed. Historian ": null
    },
    {
        "Carlo Ginzburg": "https://en.wikipedia.org/wiki/Carlo_Ginzburg"
    },
    {
        " has referred to these legendary spirit gatherings as \"The Society of Diana\".": null
    },
    {
        "Local clergy complained that women believed they were following Diana or ": null
    },
    {
        "Herodias": "https://en.wikipedia.org/wiki/Herodias"
    },
    {
        ", riding out on appointed nights to join the processions or carry out instructions from the goddess. The earliest reports of these legends appear in the writings of ": null
    },
    {
        "Regino of Prüm": "https://en.wikipedia.org/wiki/Regino_of_Pr%C3%BCm"
    },
    {
        " in the year 899, followed by many additional reports and variants of the legend in documents by ": null
    },
    {
        "Ratherius": "https://en.wikipedia.org/wiki/Ratherius"
    },
    {
        " and others. By 1310, the names of the goddess figures attached to the legend were sometimes combined as Herodiana. It is likely that the clergy of this time used the identification of the procession's leader as Diana or Herodias in order to fit an older folk belief into a Biblical framework, as both are featured and demonized in the New Testament. Herodias was often conflated with her daughter ": null
    },
    {
        "Salome": "https://en.wikipedia.org/wiki/Salome"
    },
    {
        " in legend, which also holds that, upon being presented with the severed head of ": null
    },
    {
        "John the Baptist": "https://en.wikipedia.org/wiki/John_the_Baptist"
    },
    {
        ", she was blown into the air by wind from the saint's mouth, through which she continued to wander for eternity. Diana was often conflated with ": null
    },
    {
        "Hecate": "https://en.wikipedia.org/wiki/Hecate"
    },
    {
        ", a goddess associated with the spirits of the dead and with witchcraft. These associations, and the fact that both figures are attested to in the Bible, made them a natural fit for the leader of the ghostly procession. Clergy used this identification to assert that the spirits were evil, and that the women who followed them were inspired by demons. As was typical of this time period, though pagan beliefs and practices were near totally eliminated from Europe, the clergy and other authorities still treated paganism as a real threat, in part thanks to biblical influence; much of the Bible had been written when various forms of paganism were still active if not dominant, so medieval clergy applied the same kinds of warnings and admonitions for any non-standard folk beliefs and practices they encountered. Based on analysis of church documents and parishioner confessions, it is likely that the spirit identified by the Church as Diana or Herodias was called by names of pre-Christian figures like ": null
    },
    {
        "Holda": "https://en.wikipedia.org/wiki/Holda"
    },
    {
        " (a Germanic goddess of the winter solstice), or with names referencing her bringing of prosperity, like the Latin Abundia (meaning \"plenty\"), Satia (meaning \"full\" or \"plentiful\") and the Italian Richella (meaning \"rich\"). Some of the local titles for her, such as bonae res (meaning \"good things\"), are similar to late classical titles for Hecate, like bona dea. This might indicate a cultural mixture of medieval folk ideas with holdovers from earlier pagan belief systems. Whatever her true origin, by the 13th century, the leader of the legendary spirit procession had come to be firmly identified with Diana and Herodias through the influence of the Church.": null
    },
    {
        "In his wide-ranging, comparative study of mythology and religion, ": null
    },
    {
        "The Golden Bough": "https://en.wikipedia.org/wiki/The_Golden_Bough"
    },
    {
        ", anthropologist ": null
    },
    {
        "James George Frazer": "https://en.wikipedia.org/wiki/James_George_Frazer"
    },
    {
        " drew on various lines of evidence to re-interpret the legendary rituals associated with Diana at ": null
    },
    {
        "Nemi": "https://en.wikipedia.org/wiki/Nemi"
    },
    {
        ", particularly that of the rex Nemorensis. Frazer developed his ideas in relation to ": null
    },
    {
        "J. M. W. Turner": "https://en.wikipedia.org/wiki/J._M._W._Turner"
    },
    {
        "'s painting, also titled The Golden Bough, depicting a dream-like vision of the woodland lake of Nemi. According to Frazer, the rex Nemorensis or king at Nemi was the incarnation of a ": null
    },
    {
        "dying and reviving god": "https://en.wikipedia.org/wiki/Life-death-rebirth_deity"
    },
    {
        ", a ": null
    },
    {
        "solar deity": "https://en.wikipedia.org/wiki/Solar_deity"
    },
    {
        " who participated in a mystical marriage to a goddess. He died at the harvest and was reincarnated in the spring. Frazer claimed that this motif of death and rebirth is central to nearly all of the world's religions and mythologies. In Frazer's theory, Diana functioned as a goddess of fertility and childbirth, who, assisted by the sacred king, ritually returned life to the land in spring. The king in this scheme served not only as a high priest but as a god of the grove. Frazer identifies this figure with ": null
    },
    {
        "Virbius": "https://en.wikipedia.org/wiki/Virbius"
    },
    {
        ", of which little is known, but also with ": null
    },
    {
        "Jupiter": "https://en.wikipedia.org/wiki/Jupiter"
    },
    {
        " via an association with sacred oak trees. Frazer argued furthermore that Jupiter and Juno were simply duplicate names of Jana and ": null
    },
    {
        "Janus": "https://en.wikipedia.org/wiki/Janus"
    },
    {
        "; that is, Diana and ": null
    },
    {
        "Dianus": "https://en.wikipedia.org/wiki/Dianus"
    },
    {
        ", all of whom had identical functions and origins.": null
    },
    {
        "Frazer's speculatively reconstructed folklore of Diana's origins and the nature of her cult at Nemi were not well received even by his contemporaries. Godfrey Lienhardt noted that even during Frazer's lifetime, other anthropologists had \"for the most part distanced themselves from his theories and opinions\", and that the lasting influence of The Golden Bough and Frazer's wider body of work \"has been in the literary rather than the academic world.\" Robert Ackerman wrote that, for anthropologists, Frazer is \"an embarrassment\" for being \"the most famous of them all\" and that most distance themselves from his work. While The Golden Bough achieved wide \"popular appeal\" and exerted a \"disproportionate\" influence \"on so many [20th century] creative writers\", Frazer's ideas played \"a much smaller part\" in the history of academic social anthropology.": null
    },
    {
        "Folk legends like the Society of Diana, which linked the goddess to forbidden gatherings of women with spirits, may have influenced later works of folklore. One of these is ": null
    },
    {
        "Charles Godfrey Leland": "https://en.wikipedia.org/wiki/Charles_Godfrey_Leland"
    },
    {
        "'s ": null
    },
    {
        "Aradia, or the Gospel of the Witches": "https://en.wikipedia.org/wiki/Aradia,_or_the_Gospel_of_the_Witches"
    },
    {
        ", which prominently featured Diana at the center of an Italian witch-cult. In Leland's interpretation of supposed Italian folk witchcraft, Diana is considered Queen of the Witches. In this belief system, Diana is said to have created the world of her own being having in herself the seeds of all creation yet to come. It was said that out of herself she divided the darkness and the light, keeping for herself the darkness of creation and creating her brother ": null
    },
    {
        "Lucifer": "https://en.wikipedia.org/wiki/Lucifer"
    },
    {
        ". Diana was believed to have loved and ruled with her brother, and with him bore a daughter, ": null
    },
    {
        "Aradia": "https://en.wikipedia.org/wiki/Aradia"
    },
    {
        " (a name likely derived from Herodias), who leads and teaches the witches on earth.": null
    },
    {
        "Leland's claim that Aradia represented an authentic tradition from an underground witch-cult, which had secretly worshiped Diana since ancient times has been dismissed by most scholars of folklore, religion, and medieval history. After the 1921 publication of ": null
    },
    {
        "Margaret Murray": "https://en.wikipedia.org/wiki/Margaret_Murray"
    },
    {
        "'s The Witch-cult in Western Europe, which hypothesized that the European ": null
    },
    {
        "witch trials": "https://en.wikipedia.org/wiki/Witch-hunt"
    },
    {
        " were actually a persecution of a pagan religious survival, American sensationalist author Theda Kenyon's 1929 book Witches Still Live connected Murray's thesis with the witchcraft religion in Aradia. Arguments against Murray's thesis would eventually include arguments against Leland. Witchcraft scholar ": null
    },
    {
        "Jeffrey Russell": "https://en.wikipedia.org/wiki/Jeffrey_Burton_Russell"
    },
    {
        " devoted some of his 1980 book A History of Witchcraft: Sorcerers, Heretics and Pagans to arguing against the claims Leland presented in Aradia. Historian Elliot Rose's A Razor for a Goat dismissed Aradia as a collection of incantations unsuccessfully attempting to portray a religion. In his book Triumph of the Moon, historian ": null
    },
    {
        "Ronald Hutton": "https://en.wikipedia.org/wiki/Ronald_Hutton"
    },
    {
        " doubted not only of the existence of the religion that Aradia claimed to represent, and that the traditions Leland presented were unlike anything found in actual ": null
    },
    {
        "medieval literature": "https://en.wikipedia.org/wiki/Medieval_literature"
    },
    {
        ", but also of the existence of Leland's sources, arguing that it is more likely that Leland created the entire story than that Leland could be so easily \"duped\". Religious scholar Chas S. Clifton took exception to Hutton's position, writing that it amounted to an accusation of \"serious literary fraud\" made by an \"": null
    },
    {
        "argument from absence": "https://en.wikipedia.org/wiki/Argument_from_ignorance"
    },
    {
        "\".": null
    },
    {
        "Building on the work of Frazer, Murray, and others, some 20th and 21st century authors have attempted to identify links between Diana and more localized deities. R. Lowe Thompson, for example, in his 2013 book The History of the Devil,  speculated that Diana may have been linked as an occasional \"spouse\" to the Gaulish horned god ": null
    },
    {
        "Cernunnos": "https://en.wikipedia.org/wiki/Cernunnos"
    },
    {
        ". Thompson suggested that Diana in her role as wild goddess of the hunt would have made a fitting consort for Cernunnos in Western Europe, and further noted the link between Diana as Proserpina with Pluto, the Greek god associated with the riches of the earth who served a similar role to the Gaulish Cernunnos.": null
    },
    {
        "Because Leland's claims about an Italian witch-cult are questionable, the first verifiable worship of Diana in the modern age was probably begun by ": null
    },
    {
        "Wicca": "https://en.wikipedia.org/wiki/Wicca"
    },
    {
        ". The earliest known practitioners of Neopagan witchcraft were members of ": null
    },
    {
        "a tradition": "https://en.wikipedia.org/wiki/Gardnerian_Wicca"
    },
    {
        " begun by ": null
    },
    {
        "Gerald Gardner": "https://en.wikipedia.org/wiki/Gerald_Gardner_(Wiccan)"
    },
    {
        ". Published versions of the devotional materials used by Gardner's group, dated to 1949, are heavily focused on the worship of ": null
    },
    {
        "Aradia": "https://en.wikipedia.org/wiki/Aradia"
    },
    {
        ", the daughter of Diana in Leland's folklore. Diana herself was recognized as an aspect of a single \"great goddess\" in the tradition of ": null
    },
    {
        "Apuleius": "https://en.wikipedia.org/wiki/Apuleius"
    },
    {
        ", as described in the Wiccan ": null
    },
    {
        "Charge of the Goddess": "https://en.wikipedia.org/wiki/Charge_of_the_Goddess"
    },
    {
        " (itself adapted from Leland's text). Some later Wiccans, such as ": null
    },
    {
        "Scott Cunningham": "https://en.wikipedia.org/wiki/Scott_Cunningham"
    },
    {
        ", would replace Aradia with Diana as the central focus of worship.": null
    },
    {
        "In the early 1960s, ": null
    },
    {
        "Victor Henry Anderson": "https://en.wikipedia.org/wiki/Victor_Henry_Anderson"
    },
    {
        " founded the ": null
    },
    {
        "Feri Tradition": "https://en.wikipedia.org/wiki/Feri_Tradition"
    },
    {
        ", a form of Wicca that draws from both Charles Leland's folklore and the Gardnerian tradition. Anderson claimed that he had first been initiated into a witchcraft tradition as a child in 1926, and that he had been told the name of the goddess worshiped by witches was Tana. The name Tana originated in Leland's Aradia, where he claimed it was an old ": null
    },
    {
        "Etruscan": "https://en.wikipedia.org/wiki/Etruscan_religion"
    },
    {
        " name for Diana. The Feri Tradition founded by Anderson continues to recognize Tana/Diana as an aspect of the Star Goddess related to the element of fire, and representing \"the fiery womb that gives birth to and transforms all matter.\" (In Aradia, Diana is also credited as the creatrix of the material world and Queen of Faeries).": null
    },
    {
        "A few Wiccan traditions would elevate Diana to a more prominent position of worship, and there are two distinct modern ": null
    },
    {
        "branches of Wicca": "https://en.wikipedia.org/wiki/Dianic_tradition"
    },
    {
        " focused primarily on Diana. The first, founded during the early 1970s in the United States by Morgan McFarland and Mark Roberts, has a ": null
    },
    {
        "feminist": "https://en.wikipedia.org/wiki/Second-wave_feminism"
    },
    {
        " theology and only occasionally accepts male participants, and leadership is limited to female priestesses. McFarland Dianic Wiccans base their tradition primarily on the work of ": null
    },
    {
        "Robert Graves": "https://en.wikipedia.org/wiki/Robert_Graves"
    },
    {
        " and his book ": null
    },
    {
        "The White Goddess": "https://en.wikipedia.org/wiki/The_White_Goddess"
    },
    {
        ", and were inspired by references to the existence of medieval European \"Dianic cults\" in ": null
    },
    {
        "Margaret Murray": "https://en.wikipedia.org/wiki/Margaret_Murray"
    },
    {
        "'s book ": null
    },
    {
        "The Witch-Cult in Western Europe": "https://en.wikipedia.org/wiki/The_Witch-Cult_in_Western_Europe"
    },
    {
        ". The ": null
    },
    {
        "second Dianic tradition": "https://en.wikipedia.org/wiki/Dianic_Wicca"
    },
    {
        ", founded by ": null
    },
    {
        "Zsuzsanna Budapest": "https://en.wikipedia.org/wiki/Zsuzsanna_Budapest"
    },
    {
        " in the mid 1970s, is characterized by an exclusive focus on the feminine aspect of the divine, and as a result is exclusively female. This tradition combines elements from ": null
    },
    {
        "British Traditional Wicca": "https://en.wikipedia.org/wiki/British_Traditional_Wicca"
    },
    {
        ", Italian folk-magic based on the work of Charles Leland, feminist values, and healing practices drawn from a variety of different cultures.": null
    },
    {
        "A third ": null
    },
    {
        "Neopagan": "https://en.wikipedia.org/wiki/Neopagan"
    },
    {
        " tradition heavily inspired by the worship of Diana through the lens of Italian folklore is ": null
    },
    {
        "Stregheria": "https://en.wikipedia.org/wiki/Stregheria"
    },
    {
        ", founded in the 1980s. It centers around a pair of deities regarded as divine lovers, who are known by several variant names including Diana and ": null
    },
    {
        "Dianus": "https://en.wikipedia.org/wiki/Dianus"
    },
    {
        ", alternately given as Tana and Tanus or Jana and Janus (the later two deity names were mentioned by James Frazer in The Golden Bough as later corruptions of Diana and Dianus, which themselves were alternate and possibly older names for Juno and ": null
    },
    {
        "Jupiter": "https://en.wikipedia.org/wiki/Jupiter"
    },
    {
        "). The tradition was founded by author Raven Grimassi, and influenced by Italian folktales he was told by his mother. One such folktale describes the moon being impregnated by her lover the ": null
    },
    {
        "morning star": "https://en.wikipedia.org/wiki/Venus_in_culture"
    },
    {
        ", a parallel to Leland's mythology of Diana and her lover Lucifer.": null
    },
    {
        "Diana was also a subject of worship in certain ": null
    },
    {
        "Feraferian": "https://en.wikipedia.org/wiki/Feraferia"
    },
    {
        " rites, particularly those surrounding the autumnal equinox, beginning in 1967.": null
    },
    {
        "Both the ": null
    },
    {
        "Romanian": "https://en.wikipedia.org/wiki/Romanian_language"
    },
    {
        " words for \"": null
    },
    {
        "fairy": "https://en.wikipedia.org/wiki/Fairy"
    },
    {
        "\" Zână and ": null
    },
    {
        "Sânziană": "https://en.wikipedia.org/wiki/S%C3%A2nzian%C4%83"
    },
    {
        ", the ": null
    },
    {
        "Leonese": "https://en.wikipedia.org/wiki/Leonese_language"
    },
    {
        " and ": null
    },
    {
        "Portuguese": "https://en.wikipedia.org/wiki/Portuguese_language"
    },
    {
        " word for \"water nymph\" ": null
    },
    {
        "xana": "https://en.wikipedia.org/wiki/Xana"
    },
    {
        ", and the Spanish word for \"shooting target\" and \"morning call\" (diana) seem to come from the name of Diana.": null
    },
    {
        "Since the ": null
    },
    {
        "Renaissance": "https://en.wikipedia.org/wiki/Renaissance"
    },
    {
        ", Diana's myths have often been represented in the visual and dramatic arts, including the opera ": null
    },
    {
        "L'arbore di Diana": "https://en.wikipedia.org/wiki/L%27arbore_di_Diana"
    },
    {
        ". In the 16th century, Diana's image figured prominently at the châteaus of ": null
    },
    {
        "Fontainebleau": "https://en.wikipedia.org/wiki/Ch%C3%A2teau_de_Fontainebleau"
    },
    {
        ", ": null
    },
    {
        "Chenonceau": "https://en.wikipedia.org/wiki/Ch%C3%A2teau_de_Chenonceau"
    },
    {
        ", & at ": null
    },
    {
        "Anet": "https://en.wikipedia.org/wiki/Ch%C3%A2teau_d%27Anet"
    },
    {
        ", in deference to ": null
    },
    {
        "Diane de Poitiers": "https://en.wikipedia.org/wiki/Diane_de_Poitiers"
    },
    {
        ", mistress of ": null
    },
    {
        "Henri of France": "https://en.wikipedia.org/wiki/Henry_II_of_France"
    },
    {
        ". At ": null
    },
    {
        "Versailles": "https://en.wikipedia.org/wiki/Palace_of_Versailles"
    },
    {
        " she was incorporated into the Olympian iconography with which ": null
    },
    {
        "Louis XIV": "https://en.wikipedia.org/wiki/Louis_XIV_of_France"
    },
    {
        ", the Apollo-like \"Sun King\" liked to surround himself. Diana is also a character in the 1876 ": null
    },
    {
        "Léo Delibes": "https://en.wikipedia.org/wiki/L%C3%A9o_Delibes"
    },
    {
        " ballet ": null
    },
    {
        "Sylvia": "https://en.wikipedia.org/wiki/Sylvia_(ballet)"
    },
    {
        ". The plot deals with Sylvia, one of Diana's nymphs and sworn to chastity, and Diana's assault on Sylvia's affections for the shepherd Amyntas.": null
    },
    {
        "Diana has been one of the most popular themes in art. Painters like ": null
    },
    {
        "Titian": "https://en.wikipedia.org/wiki/Titian"
    },
    {
        ", ": null
    },
    {
        "Peter Paul Rubens": "https://en.wikipedia.org/wiki/Peter_Paul_Rubens"
    },
    {
        ", ": null
    },
    {
        "François Boucher": "https://en.wikipedia.org/wiki/Fran%C3%A7ois_Boucher"
    },
    {
        ", ": null
    },
    {
        "Nicholas Poussin": "https://en.wikipedia.org/wiki/Nicholas_Poussin"
    },
    {
        " and made use of her myth as a major theme. Most depictions of Diana in art featured the stories of Diana and ": null
    },
    {
        "Actaeon": "https://en.wikipedia.org/wiki/Actaeon"
    },
    {
        ", or ": null
    },
    {
        "Callisto": "https://en.wikipedia.org/wiki/Callisto_(mythology)"
    },
    {
        ", or depicted her resting after hunting. Some famous work of arts with a Diana theme are:": null
    }
]