[
    {
        "The Kattenstoet (lit. \"Festival of the Cats\") is a parade in ": null
    },
    {
        "Ypres": "https://en.wikipedia.org/wiki/Ypres"
    },
    {
        ", Belgium, devoted to the ": null
    },
    {
        "cat": "https://en.wikipedia.org/wiki/Cat"
    },
    {
        ". It has been held regularly on the second Sunday of May since 1955. Most recently, the 44th edition took place on May 10, 2015, with the 45th expecting to take place on May 13, 2018. The parade commemorates an Ypres tradition from the ": null
    },
    {
        "Middle Ages": "https://en.wikipedia.org/wiki/Middle_Ages"
    },
    {
        " in which cats were thrown from the ": null
    },
    {
        "belfry": "https://en.wikipedia.org/wiki/Bell_tower"
    },
    {
        " tower of the ": null
    },
    {
        "Cloth Hall": "https://en.wikipedia.org/wiki/Cloth_Hall,_Ypres"
    },
    {
        " to the town square below.": null
    },
    {
        "There are various legends about how the throwing of cats originated. One possibility is that cats were connected to ": null
    },
    {
        "witchcraft": "https://en.wikipedia.org/wiki/Witchcraft"
    },
    {
        ", and the throwing of the cats symbolised the killing of evil spirits. The last recorded event of this kind was in 1817. Another story suggests that the cats were brought into the ": null
    },
    {
        "Cloth Hall": "https://en.wikipedia.org/wiki/Cloth_Hall,_Ypres"
    },
    {
        " (Lakenhallen) to control vermin. Before modern heating and storage methods, when it got cold the wool was stored in the upper floors of the Cloth Hall. At the start of the spring warm-up, after the wool had been sold, the cats were tossed out of the ": null
    },
    {
        "bell tower": "https://en.wikipedia.org/wiki/Bell_tower"
    },
    {
        ".": null
    },
    {
        "Symbolically reviving this practice for the parade festivities, a jester tosses plush children's-toy cats from the Cloth Hall belfry down to the crowd, which awaits with outstretched arms to catch one. The throwing of the cats from the belfry is followed by a mock ": null
    },
    {
        "witch burning": "https://en.wikipedia.org/wiki/Witch_hunt"
    },
    {
        ". Participants in the festivities often dress as cats, witches, mice, or townspeople from ages past, and the festival also features brass bands and people riding on horseback. Around 2,000 people participated in the 2012 parade. The festival is a popular tourist event in Belgium and has helped strengthen the local tourist economy around Ypres. 8,000 people visited the event in 2000.": null
    }
]