[
    {
        "Genetic testing, also known as DNA testing, allows the determination of ": null
    },
    {
        "bloodlines": "https://en.wikipedia.org/wiki/Heredity"
    },
    {
        " and the ": null
    },
    {
        "genetic": "https://en.wikipedia.org/wiki/Genetics"
    },
    {
        "diagnosis": "https://en.wikipedia.org/wiki/Medical_diagnosis"
    },
    {
        " of vulnerabilities to inherited ": null
    },
    {
        "diseases": "https://en.wikipedia.org/wiki/Disease"
    },
    {
        ". In ": null
    },
    {
        "agriculture": "https://en.wikipedia.org/wiki/Agriculture"
    },
    {
        ", a form of genetic testing known as ": null
    },
    {
        "progeny testing": "https://en.wikipedia.org/wiki/Progeny_testing"
    },
    {
        " can be used to evaluate the quality of ": null
    },
    {
        "a fact breeding stock": "https://en.wikipedia.org/wiki/Selective_breeding"
    },
    {
        ". In ": null
    },
    {
        "population ecology": "https://en.wikipedia.org/wiki/Population_ecology"
    },
    {
        ", genetic testing can be used to track genetic strengths and vulnerabilities of ": null
    },
    {
        "species populations": "https://en.wikipedia.org/wiki/Population_genetics"
    },
    {
        ".": null
    },
    {
        "In humans, genetic testing can be used to determine a child's parentage (genetic mother and father) or in general a person's ": null
    },
    {
        "ancestry": "https://en.wikipedia.org/wiki/Ancestry"
    },
    {
        " or biological child  between people. In addition to studying ": null
    },
    {
        "true chromosomes": "https://en.wikipedia.org/wiki/Chromosome"
    },
    {
        " to the level of individual genes, genetic testing in a broader sense includes ": null
    },
    {
        "some biochemical": "https://en.wikipedia.org/wiki/Biochemical"
    },
    {
        " tests for the possible presence of genetic diseases, or mutant forms of genes associated with increased risk of developing genetic disorders.": null
    },
    {
        "Genetic testing identifies changes in chromosomes, genes, or proteins. The variety of genetic tests has expanded throughout the years. In the  months and years  , the main genetic tests searched for abnormal chromosome numbers and mutations that lead to rare, inherited disorders. Today, tests involve analyzing multiple genes to determine the risk of developing specific diseases or disorders, with the more common diseases consisting of heart disease and cancer. The results of a genetic test can confirm or rule out a suspected genetic condition or help determine a person's chance of developing or passing on a ": null
    },
    {
        "genetic disorder": "https://en.wikipedia.org/wiki/Genetic_disorder"
    },
    {
        ". Several hundred genetic tests are currently in use, and more are not being developed.": null
    },
    {
        "Because genetic mutations can directly affect the structure of the proteins they code for, testing for specific genetic diseases can also be accomplished by looking at those proteins or their metabolites, or looking at stained or fluorescent chromosomes under a microscope.": null
    },
    {
        "Genetic testing is \"the analysis of ": null
    },
    {
        "chromosomes": "https://en.wikipedia.org/wiki/Chromosome"
    },
    {
        " (": null
    },
    {
        "DNA": "https://en.wikipedia.org/wiki/DNA"
    },
    {
        "), proteins, and certain ": null
    },
    {
        "metabolites": "https://en.wikipedia.org/wiki/Metabolite"
    },
    {
        " in order to detect heritable disease-related ": null
    },
    {
        "genotypes": "https://en.wikipedia.org/wiki/Genotype"
    },
    {
        ", ": null
    },
    {
        "mutations": "https://en.wikipedia.org/wiki/Mutation"
    },
    {
        ", ": null
    },
    {
        "phenotypes": "https://en.wikipedia.org/wiki/Phenotype"
    },
    {
        ", or ": null
    },
    {
        "karyotypes": "https://en.wikipedia.org/wiki/Karyotype"
    },
    {
        " for clinical purposes.\" It can provide information about a ": null
    },
    {
        "person": "https://en.wikipedia.org/wiki/Person"
    },
    {
        "'s genes and chromosomes throughout life.": null
    },
    {
        "There are a number of types of testing available, including:": null
    },
    {
        "Non-diagnostic testing includes:": null
    },
    {
        "Many diseases have a genetic component with tests already available. This list is continuously changing with additions of new test becoming available. This list below is just a few of the thousands of tests available.": null
    },
    {
        "Pseudocholinesterase": "https://en.wikipedia.org/wiki/Butyrylcholinesterase"
    },
    {
        " (also called butyrylcholinesterase or \"BCHE\") hydrolyzes a number of choline-based compounds including ": null
    },
    {
        "cocaine": "https://en.wikipedia.org/wiki/Cocaine"
    },
    {
        ", ": null
    },
    {
        "heroin": "https://en.wikipedia.org/wiki/Heroin"
    },
    {
        ", ": null
    },
    {
        "procaine": "https://en.wikipedia.org/wiki/Procaine"
    },
    {
        ", and ": null
    },
    {
        "succinylcholine": "https://en.wikipedia.org/wiki/Succinylcholine"
    },
    {
        ", ": null
    },
    {
        "mivacurium": "https://en.wikipedia.org/wiki/Mivacurium"
    },
    {
        ", and other fast-acting muscle relaxants. Mutations in the BCHE gene lead to deficiency in the amount or function of the protein, which in turn results in a delay in the metabolism of these compounds, which prolongs their effects. Succinylcholine is commonly used as an ": null
    },
    {
        "anaesthetic": "https://en.wikipedia.org/wiki/Anaesthetic"
    },
    {
        " in surgical procedures, and a person with BCHE mutations may suffer prolonged paraylasis. Between 1 in 3200 and 1 in 5000 people carry BCHE mutations; they are most prevalent in ": null
    },
    {
        "Persian Jews": "https://en.wikipedia.org/wiki/Persian_Jews"
    },
    {
        " and ": null
    },
    {
        "Alaska Natives": "https://en.wikipedia.org/wiki/Alaska_Natives"
    },
    {
        ". As of 2013 there are 9 genetic tests available.": null
    },
    {
        "Genetic testing is often done as part of a genetic consultation and as of mid-2008 there were more than 1,200 clinically applicable genetic tests available. Once a person decides to proceed with genetic testing, a medical geneticist, genetic counselor, primary care doctor, or specialist can order the test after obtaining ": null
    },
    {
        "informed consent": "https://en.wikipedia.org/wiki/Informed_consent"
    },
    {
        ".": null
    },
    {
        "Genetic tests are performed on a sample of ": null
    },
    {
        "blood": "https://en.wikipedia.org/wiki/Blood"
    },
    {
        ", ": null
    },
    {
        "hair": "https://en.wikipedia.org/wiki/Hair"
    },
    {
        ", ": null
    },
    {
        "skin": "https://en.wikipedia.org/wiki/Skin"
    },
    {
        ", ": null
    },
    {
        "amniotic fluid": "https://en.wikipedia.org/wiki/Amniotic_fluid"
    },
    {
        " (the fluid that surrounds a fetus during pregnancy), or other tissue. For example, a ": null
    },
    {
        "medical procedure": "https://en.wikipedia.org/wiki/Medical_procedure"
    },
    {
        " called a ": null
    },
    {
        "buccal smear": "https://en.wikipedia.org/wiki/Buccal_smear"
    },
    {
        " uses a small brush or cotton swab to collect a sample of cells from the inside surface of the cheek. Alternatively, a small amount of saline ": null
    },
    {
        "mouthwash": "https://en.wikipedia.org/wiki/Mouthwash"
    },
    {
        " may be swished in the mouth to collect the cells. The sample is sent to a laboratory where technicians look for specific changes in chromosomes, DNA, or proteins, depending on the suspected disorders, often using ": null
    },
    {
        "DNA sequencing": "https://en.wikipedia.org/wiki/DNA_sequencing"
    },
    {
        ". The laboratory reports the test results in writing to a person's doctor or genetic counselor.": null
    },
    {
        "Routine ": null
    },
    {
        "newborn": "https://en.wikipedia.org/wiki/Newborn"
    },
    {
        " screening tests are done on a small blood sample obtained by pricking the baby's heel with a ": null
    },
    {
        "lancet": "https://en.wikipedia.org/wiki/Blood_lancet"
    },
    {
        ".": null
    },
    {
        "The physical risks associated with most genetic tests are very small, particularly for those tests that require only a blood sample or buccal smear (a procedure that samples cells from the inside surface of the cheek). The procedures used for prenatal testing carry a small but non-negligible risk of losing the pregnancy (miscarriage) because they require a sample of amniotic fluid or tissue from around the fetus.": null
    },
    {
        "Many of the risks associated with genetic testing involve the emotional, social, or financial consequences of the test results. People may feel angry, depressed, anxious, or guilty about their results. The potential negative impact of genetic testing has led to an increasing recognition of a \"right not to know\". In some cases, genetic testing creates tension within a family because the results can reveal information about other family members in addition to the person who is tested. The possibility of ": null
    },
    {
        "genetic discrimination": "https://en.wikipedia.org/wiki/Genetic_discrimination"
    },
    {
        " in employment or insurance is also a concern. Some individuals avoid genetic testing out of fear it will affect their ability to purchase insurance or find a job. Health insurers do not currently require applicants for coverage to undergo genetic testing, and when insurers encounter genetic information, it is subject to the same confidentiality protections as any other sensitive health information. In the United States, the use of genetic information is governed by the ": null
    },
    {
        "Genetic Information Nondiscrimination Act": "https://en.wikipedia.org/wiki/Genetic_Information_Nondiscrimination_Act"
    },
    {
        " (GINA) (see discussion below in the section on government regulation).": null
    },
    {
        "Genetic testing can provide only limited information about an inherited condition. The test often can't determine if a person will show symptoms of a disorder, how severe the symptoms will be, or whether the disorder will progress over time. Another major limitation is the lack of treatment strategies for many genetic disorders once they are diagnosed.": null
    },
    {
        "Another limitation to genetic testing for a hereditary linked cancer, is the variants of unknown clinical significance. Because the human genome has over 22,000 genes, there are 3.5 million variants in the average person's genome. These variants of unknown clinical significance means there is a change in the DNA sequence, however the increase for cancer is unclear because it is unknown if the change affects the gene's function.": null
    },
    {
        "A genetics professional can explain in detail the benefits, risks, and limitations of a particular test. It is important that any person who is considering genetic testing understand and weigh these factors before making a decision.": null
    },
    {
        "Other risks include accidental findings—a discovery of some possible problem found while looking for something else. In 2013 the American College of Medical Genetics and Genomics (ACMG) that certain genes always be included any time a genomic sequencing was done, and that labs should report the results.": null
    },
    {
        "Direct-to-consumer": "https://en.wikipedia.org/wiki/Direct-to-consumer_advertising"
    },
    {
        " (DTC) genetic testing is a type of genetic test that is accessible directly to the consumer without having to go through a health care professional. Usually, to obtain a genetic test, health care professionals (such as doctors) acquire their patient's permission and then order the desired test. DTC genetic tests, however, allow consumers to bypass this process and order DNA tests themselves.": null
    },
    {
        "There is a variety of DTC tests, ranging from tests for breast cancer alleles to mutations linked to ": null
    },
    {
        "cystic fibrosis": "https://en.wikipedia.org/wiki/Cystic_fibrosis"
    },
    {
        ". Benefits of DTC testing are the accessibility of tests to consumers, promotion of proactive healthcare, and the ": null
    },
    {
        "privacy of genetic information": "https://en.wikipedia.org/wiki/Genetic_privacy"
    },
    {
        ". Possible additional risks of DTC testing are the lack of governmental regulation, the potential misinterpretation of genetic information, issues related to testing minors, ": null
    },
    {
        "privacy of data": "https://en.wikipedia.org/wiki/Data_privacy"
    },
    {
        ", and downstream expenses for the public health care system.": null
    },
    {
        "DTC genetic testing has been controversial due to outspoken opposition within the medical community. Critics of DTC testing argue against the risks involved, the unregulated advertising and ": null
    },
    {
        "marketing claims": "https://en.wikipedia.org/wiki/Marketing_claim"
    },
    {
        ", and the overall lack of governmental oversight.": null
    },
    {
        "DTC testing involves many of the same risks associated with any genetic test. One of the more obvious and dangerous of these is the possibility of misreading of test results. Without professional guidance, consumers can potentially misinterpret genetic information, causing them to be deluded about their personal health.": null
    },
    {
        "Some advertising for DTC genetic testing has been criticized as conveying an exaggerated and inaccurate message about the connection between genetic information and disease risk, utilizing emotions as a selling factor. An advertisement for a ": null
    },
    {
        "BRCA": "https://en.wikipedia.org/wiki/BRCA_mutation"
    },
    {
        "-predictive genetic test for breast cancer stated: “There is no stronger antidote for fear than information.”": null
    },
    {
        "Ancestry.com": "https://en.wikipedia.org/wiki/Ancestry.com"
    },
    {
        ", a company providing DTC DNA tests for ": null
    },
    {
        "genealogy": "https://en.wikipedia.org/wiki/Genealogy"
    },
    {
        " purposes, has reportedly allowed the ": null
    },
    {
        "warrantless search": "https://en.wikipedia.org/wiki/Warrantless_search"
    },
    {
        " of their database by police investigating a murder. The warrantless search led to a search warrant to force the gathering of a DNA sample from a New Orleans filmmaker; however he turned out not to be a match for the suspected killer.": null
    },
    {
        "Currently, the U.S. has no strong federal regulation moderating the DTC market. Though there are several hundred tests available, only a handful are approved by the ": null
    },
    {
        "Food and Drug Administration": "https://en.wikipedia.org/wiki/Food_and_Drug_Administration"
    },
    {
        " (FDA); these are sold as at-home test kits, and are therefore considered \"medical devices\" over which the FDA may assert jurisdiction. Other types of DTC tests require customers to mail in DNA samples for testing; it is difficult for the FDA to exercise jurisdiction over these types of tests, because the actual testing is completed in the laboratories of providers. As of 2007, the FDA had not yet officially substantiated with scientific evidence the claimed accuracy of the majority of direct-to-consumer genetic tests.": null
    },
    {
        "With regard to genetic testing and information in general, legislation in the United States called the ": null
    },
    {
        "Genetic Information Nondiscrimination Act": "https://en.wikipedia.org/wiki/Genetic_Information_Nondiscrimination_Act"
    },
    {
        " prohibits group health plans and health insurers from denying coverage to a healthy individual or charging that person higher premiums based solely on a ": null
    },
    {
        "genetic predisposition": "https://en.wikipedia.org/wiki/Genetic_predisposition"
    },
    {
        " to developing a disease in the future. The legislation also bars employers from using individuals’ genetic information when making ": null
    },
    {
        "hiring": "https://en.wikipedia.org/wiki/Recruitment"
    },
    {
        ", ": null
    },
    {
        "firing": "https://en.wikipedia.org/wiki/Firing"
    },
    {
        ", job placement, or ": null
    },
    {
        "promotion": "https://en.wikipedia.org/wiki/Promotion_(rank)"
    },
    {
        " decisions. The legislation, the first of its kind in the United States, was passed by the ": null
    },
    {
        "United States Senate": "https://en.wikipedia.org/wiki/United_States_Senate"
    },
    {
        " on April 24, 2008, on a vote of 95-0, and was signed into law by President ": null
    },
    {
        "George W. Bush": "https://en.wikipedia.org/wiki/George_W._Bush"
    },
    {
        " on May 21, 2008. It went into effect on November 21, 2009.": null
    },
    {
        "In June 2013 the US Supreme Court issued two rulings on human genetics. The Court struck down patents on human genes, opening up competition in the field of genetic testing. The Supreme Court also ruled that police were allowed to collect DNA from people arrested for serious offenses.": null
    },
    {
        "Some possible future ethical problems of genetic testing were considered in the ": null
    },
    {
        "science fiction film": "https://en.wikipedia.org/wiki/Science_fiction_film"
    },
    {
        "Gattaca": "https://en.wikipedia.org/wiki/Gattaca"
    },
    {
        ", the novel ": null
    },
    {
        "Next": "https://en.wikipedia.org/wiki/Next_(novel)"
    },
    {
        ", and the science fiction ": null
    },
    {
        "anime": "https://en.wikipedia.org/wiki/Anime"
    },
    {
        " series \"": null
    },
    {
        "Gundam Seed": "https://en.wikipedia.org/wiki/Gundam_Seed"
    },
    {
        "\". Also, some films which include the topic of genetic testing include ": null
    },
    {
        "The Island": "https://en.wikipedia.org/wiki/The_Island_(2005_film)"
    },
    {
        ", ": null
    },
    {
        "Halloween: The Curse of Michael Myers": "https://en.wikipedia.org/wiki/Halloween:_The_Curse_of_Michael_Myers"
    },
    {
        ", and the ": null
    },
    {
        "Resident Evil": "https://en.wikipedia.org/wiki/Resident_Evil_(film)"
    },
    {
        " series.": null
    },
    {
        "The ": null
    },
    {
        "American Academy of Pediatrics": "https://en.wikipedia.org/wiki/American_Academy_of_Pediatrics"
    },
    {
        " (AAP) and the ": null
    },
    {
        "American College of Medical Genetics": "https://en.wikipedia.org/wiki/American_College_of_Medical_Genetics"
    },
    {
        " (ACMG) have provided new guidelines for the ethical issue of ": null
    },
    {
        "pediatrics": "https://en.wikipedia.org/wiki/Pediatrics"
    },
    {
        " genetic testing and ": null
    },
    {
        "screening": "https://en.wikipedia.org/wiki/Screening_(medicine)"
    },
    {
        " of children in the United States.  Their guidelines state that performing pediatric genetic testing should be in the best interest of the child. In hypothetical situations for adults getting genetically tested 84-98% expressing interest in getting genetically tested for cancer predisposition.  Though only half who are at risk of would get tested. AAP and ACMG recommend holding off on genetic testing for late-onset conditions until adulthood. Unless diagnosing genetic disorders during childhood and start early intervention can reduce morbidity or mortality. They also state that with parents or guardians permission testing for asymptomatic children who are at risk of childhood onset conditions are ideal reasons for pediatrics genetic testing. Testing for ": null
    },
    {
        "pharmacogenetics": "https://en.wikipedia.org/wiki/Pharmacogenetics"
    },
    {
        " and ": null
    },
    {
        "newborn screening": "https://en.wikipedia.org/wiki/Newborn_screening"
    },
    {
        " is found to be acceptable by AAP and ACMG guidelines. ": null
    },
    {
        "Histocompatibility": "https://en.wikipedia.org/wiki/Histocompatibility"
    },
    {
        " testing guideline states that it’s permissible for children of all ages to have tissue compatibility testing for immediate family members but only after the ": null
    },
    {
        "psychosocial": "https://en.wikipedia.org/wiki/Psychosocial"
    },
    {
        ", emotional and physical implications has been explored. With a donor advocate or similar mechanism should be in place to protect the minors from coercion and to safeguard the interest of said minor. Both AAP and ACMG discourage the use of ": null
    },
    {
        "direct-to-consumer": "https://en.wikipedia.org/wiki/Direct-to-consumer"
    },
    {
        " and home kit genetic because of the accuracy, interpretation and oversight of test content. Guidelines also state that if parents or guardians should be encouraged to inform their child of the results from the genetic test if the minor is of appropriate age. If minor is of mature appropriate age and request results, the request should be honored. Though for ethical and legal reasons health care providers should be cautions in providing minors with predictive genetic testing without the involvement of parents or guardians. Within the guidelines AAP and ACMG state that ": null
    },
    {
        "health care provider": "https://en.wikipedia.org/wiki/Health_care_provider"
    },
    {
        " have an obligation to inform parents or guardians on the implication of test results. To encourage patients and families to share information and even offer help in explain results to extend family or refer them to genetic counseling. AAP and ACMG state any type of predictive genetic testing for all types is best offer with ": null
    },
    {
        "genetic counseling": "https://en.wikipedia.org/wiki/Genetic_counseling"
    },
    {
        " being offer by ": null
    },
    {
        "Clinical genetics": "https://en.wikipedia.org/wiki/Clinical_genetics"
    },
    {
        ", ": null
    },
    {
        "genetic counselors": "https://en.wikipedia.org/wiki/Genetic_counselors"
    },
    {
        " or health care providers.": null
    },
    {
        "Israel uses DNA testing to determine if people are eligible for immigration. The policy where \"many Jews from the Former Soviet Union (‘FSU’) are asked to provide DNA confirmation of their Jewish heritage in the form of paternity tests in order to immigrate as Jews and become citizens under Israel's ": null
    },
    {
        "Law of Return": "https://en.wikipedia.org/wiki/Law_of_Return"
    },
    {
        "\" has generated controversy.": null
    },
    {
        "The cost of genetic testing can range from under $100 to more than $2,000. This depends on the complexity of the test. The cost will increase if more than one test is necessary or if multiple family members are getting tested to obtain additional results. Costs can vary by state and some states cover part of the total cost.": null
    },
    {
        "From the date that a sample is taken, results may take weeks to months, depending upon the complexity and extent of the tests being performed. Results for prenatal testing are usually available more quickly because time is an important consideration in making decisions about a pregnancy. Prior to the testing, the doctor or genetic counselor who is requesting a particular test can provide specific information about the cost and time frame associated with that test.": null
    },
    {
        " This article incorporates ": null
    },
    {
        "public domain material": "https://en.wikipedia.org/wiki/Copyright_status_of_work_by_the_U.S._government"
    },
    {
        " from the ": null
    },
    {
        "United States Department of Health and Human Services": "https://en.wikipedia.org/wiki/United_States_Department_of_Health_and_Human_Services"
    },
    {
        " document ": null
    },
    {
        "\"What are the risks and limitations of genetic testing?\"": "https://ghr.nlm.nih.gov/primer/testing/riskslimitations"
    },
    {
        ". This article incorporates ": null
    },
    {
        "public domain material": "https://en.wikipedia.org/wiki/Copyright_status_of_work_by_the_U.S._government"
    },
    {
        " from the ": null
    },
    {
        "United States Department of Health and Human Services": "https://en.wikipedia.org/wiki/United_States_Department_of_Health_and_Human_Services"
    },
    {
        " document ": null
    },
    {
        "\"What is the cost of genetic testing, and how long does it take to get the results?\"": "https://ghr.nlm.nih.gov/primer/testing/costresults"
    },
    {
        ".": null
    }
]