[
    {
        "Onomatopoeia (; from the ": null
    },
    {
        "Greek": "https://en.wikipedia.org/wiki/Greek_language"
    },
    {
        " ὀνοματοποιία; ὄνομα for \"name\" and ποιέω for \"I make\",": null
    },
    {
        "adjectival form": "https://en.wikipedia.org/wiki/Adjectival_form"
    },
    {
        ": \"onomatopoeic\" or \"onomatopoetic\", also onomatopœia is the process of creating a word that ": null
    },
    {
        "phonetically": "https://en.wikipedia.org/wiki/Phonetics"
    },
    {
        " imitates, resembles, or suggests the sound that it describes. As such words are ": null
    },
    {
        "uncountable nouns": "https://en.wikipedia.org/wiki/Uncountable_noun"
    },
    {
        ", onomatopoeia refers to the property of such words. Common occurrences of words of the onomatopoeia process include animal noises such as \"": null
    },
    {
        "oink": "https://en.wikipedia.org/wiki/Oink_(sound)"
    },
    {
        "\", \"meow\" (or \"miaow\"), \"roar\" and \"chirp\". Onomatopoeia can differ between languages: it conforms to some extent to the broader ": null
    },
    {
        "linguistic": "https://en.wikipedia.org/wiki/Natural_language"
    },
    {
        " system; hence the sound of a clock may be expressed as \"tick tock\" in ": null
    },
    {
        "English": "https://en.wikipedia.org/wiki/English_language"
    },
    {
        ", \"tic tac\" in ": null
    },
    {
        "Spanish": "https://en.wikipedia.org/wiki/Spanish_language"
    },
    {
        " and ": null
    },
    {
        "Italian": "https://en.wikipedia.org/wiki/Italian_language"
    },
    {
        ", \"dī dā\" in ": null
    },
    {
        "Mandarin": "https://en.wikipedia.org/wiki/Standard_Chinese"
    },
    {
        ", \"katchin katchin\" in ": null
    },
    {
        "Japanese": "https://en.wikipedia.org/wiki/Japanese_language"
    },
    {
        ", or \"tik-tik\" in ": null
    },
    {
        "Hindi": "https://en.wikipedia.org/wiki/Hindi_language"
    },
    {
        ".": null
    },
    {
        "Although in the English language the term onomatopoeia means 'the imitation of a sound', the compound word onomatopoeia (ὀνοματοποιία) in the Greek language means 'making or creating names'. For words that imitate sounds, the term ὴχομιμητικό (echomimetico) or ": null
    },
    {
        "echomimetic": "https://en.wikipedia.org/wiki/Echomimetic"
    },
    {
        ") is used. The word ὴχομιμητικό (echomimetico) derives from \"ὴχώ\", meaning 'echo' or 'sound', and \"μιμητικό\", meaning 'mimetic' or 'imitating'.": null
    },
    {
        "In the case of a ": null
    },
    {
        "frog": "https://en.wikipedia.org/wiki/Frog"
    },
    {
        " croaking, the spelling may vary because different frog species around the world make different sounds: ": null
    },
    {
        "Ancient Greek": "https://en.wikipedia.org/wiki/Ancient_Greek"
    },
    {
        "brekekekex koax koax (only in ": null
    },
    {
        "Aristophanes": "https://en.wikipedia.org/wiki/Aristophanes"
    },
    {
        "' comic play ": null
    },
    {
        "The Frogs": "https://en.wikipedia.org/wiki/The_Frogs"
    },
    {
        ") probably for ": null
    },
    {
        "marsh frogs": "https://en.wikipedia.org/wiki/Marsh_frog"
    },
    {
        "; English ": null
    },
    {
        "ribbit": "https://en.wiktionary.org/wiki/ribbit"
    },
    {
        " for species of frog found in North America; English verb ": null
    },
    {
        "croak": "https://en.wiktionary.org/wiki/croak"
    },
    {
        " for the ": null
    },
    {
        "common frog": "https://en.wikipedia.org/wiki/Common_frog"
    },
    {
        ".": null
    },
    {
        "Some other very common English-language examples are ": null
    },
    {
        "hiccup": "https://en.wikipedia.org/wiki/Hiccup"
    },
    {
        ", zoom, bang, ": null
    },
    {
        "beep": "https://en.wikipedia.org/wiki/Beep_(sound)"
    },
    {
        ", moo, and splash. ": null
    },
    {
        "Machines": "https://en.wikipedia.org/wiki/Machine"
    },
    {
        " and their sounds are also often described with onomatopoeia: honk or beep-beep for the horn of an automobile, and vroom or brum for the engine. In speaking of a mishap involving an audible ": null
    },
    {
        "arcing": "https://en.wikipedia.org/wiki/Electric_arc"
    },
    {
        " of electricity, the word \"zap\" is often used (and its use has been extended to describe non-auditory effects generally connoting the same sort of localized but thorough interference or destruction similar to that produced in short-circuit sparking).": null
    },
    {
        "Human sounds sometimes provide instances of onomatopoeia, as when ": null
    },
    {
        "mwah": "https://en.wikipedia.org/wiki/Mwah"
    },
    {
        " is used to represent a kiss.": null
    },
    {
        "For animal sounds, words like ": null
    },
    {
        "quack": "https://en.wikipedia.org/wiki/Quack_(sound)#Communication"
    },
    {
        " (": null
    },
    {
        "duck": "https://en.wikipedia.org/wiki/Duck"
    },
    {
        "), moo (": null
    },
    {
        "cow": "https://en.wikipedia.org/wiki/Cow"
    },
    {
        "), ": null
    },
    {
        "bark": "https://en.wikipedia.org/wiki/Bark_(utterance)"
    },
    {
        " or woof (": null
    },
    {
        "dog": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        "), ": null
    },
    {
        "roar": "https://en.wikipedia.org/wiki/Roar_(utterance)"
    },
    {
        " (": null
    },
    {
        "lion": "https://en.wikipedia.org/wiki/Lion"
    },
    {
        "), ": null
    },
    {
        "meow": "https://en.wikipedia.org/wiki/Meow"
    },
    {
        "/": null
    },
    {
        "miaow": "https://en.wikipedia.org/wiki/Miaow"
    },
    {
        " or ": null
    },
    {
        "purr": "https://en.wikipedia.org/wiki/Purr"
    },
    {
        " (cat), cluck (": null
    },
    {
        "chicken": "https://en.wikipedia.org/wiki/Chicken"
    },
    {
        ") and baa (sheep) are typically used in English (both as nouns and as verbs).": null
    },
    {
        "Some languages flexibly integrate onomatopoeic words into their structure. This may evolve into a new word, up to the point that the process is no longer recognized as onomatopoeia. One example is the English word  \"bleat\" for sheep noise: in ": null
    },
    {
        "medieval": "https://en.wikipedia.org/wiki/Medieval"
    },
    {
        " times it was pronounced approximately as \"blairt\" (but without an R-component), or \"blet\" with the vowel drawled, which more closely resembles a sheep noise than the modern pronunciation.": null
    },
    {
        "An example of the opposite case is \"": null
    },
    {
        "cuckoo": "https://en.wikipedia.org/wiki/Cuckoo"
    },
    {
        "\", which, due to continuous familiarity with the bird noise down the centuries, has kept approximately the same pronunciation as in ": null
    },
    {
        "Anglo-Saxon": "https://en.wikipedia.org/wiki/Old_English_language"
    },
    {
        " times and its vowels have not changed as they have in the word furrow.": null
    },
    {
        "Verba dicendi": "https://en.wikipedia.org/wiki/Verbum_dicendi"
    },
    {
        " (\"words of saying\") are a method of integrating onomatopoeic words and ": null
    },
    {
        "ideophones": "https://en.wikipedia.org/wiki/Ideophone"
    },
    {
        " into grammar.": null
    },
    {
        "Sometimes, things are named from the sounds they make. In English, for example, there is the universal fastener which is named for the sound it makes: the ": null
    },
    {
        "zip": "https://en.wikipedia.org/wiki/Zipper"
    },
    {
        " (in the UK) or ": null
    },
    {
        "zipper": "https://en.wikipedia.org/wiki/Zipper"
    },
    {
        " (in the U.S.) Many birds are named after their calls, such as the ": null
    },
    {
        "bobwhite quail": "https://en.wikipedia.org/wiki/Bobwhite_quail"
    },
    {
        ", the ": null
    },
    {
        "weero": "https://en.wikipedia.org/wiki/Weero"
    },
    {
        ", the ": null
    },
    {
        "morepork": "https://en.wikipedia.org/wiki/Morepork"
    },
    {
        ", the ": null
    },
    {
        "killdeer": "https://en.wikipedia.org/wiki/Killdeer"
    },
    {
        ", ": null
    },
    {
        "chickadees": "https://en.wikipedia.org/wiki/Chickadee"
    },
    {
        " and ": null
    },
    {
        "jays": "https://en.wikipedia.org/wiki/Jay"
    },
    {
        ", the ": null
    },
    {
        "cuckoo": "https://en.wikipedia.org/wiki/Common_cuckoo"
    },
    {
        ", the ": null
    },
    {
        "chiffchaff": "https://en.wikipedia.org/wiki/Common_chiffchaff"
    },
    {
        ", the ": null
    },
    {
        "whooping crane": "https://en.wikipedia.org/wiki/Whooping_crane"
    },
    {
        ", the ": null
    },
    {
        "whip-poor-will": "https://en.wikipedia.org/wiki/Whip-poor-will"
    },
    {
        ", and the ": null
    },
    {
        "kookaburra": "https://en.wikipedia.org/wiki/Kookaburra"
    },
    {
        ". In ": null
    },
    {
        "Tamil": "https://en.wikipedia.org/wiki/Tamil_language"
    },
    {
        " and ": null
    },
    {
        "Malayalam": "https://en.wikipedia.org/wiki/Malayalam"
    },
    {
        ", the word for ": null
    },
    {
        "crow": "https://en.wikipedia.org/wiki/Crow"
    },
    {
        " is kaakaa. This practice is especially common in certain languages such as ": null
    },
    {
        "Māori": "https://en.wikipedia.org/wiki/M%C4%81ori_language"
    },
    {
        ", and so in names of animals borrowed from these languages.": null
    },
    {
        "Although a particular sound is heard similarly by people of different cultures, it is often expressed through the use of different consonant strings in different languages. For example, the snip of a pair of scissors is cri-cri in Italian,riqui-riqui in Spanish,terre-terre or treque-treque in Portuguese, krits-krits in modern Greek,cëk-cëk in Albanian, and katr-katr in Hindi. Similarly, the \"honk\" of a car's horn is ba-ba (": null
    },
    {
        "Han": "https://en.wikipedia.org/wiki/Han_characters"
    },
    {
        ": ) in Mandarin, tut-tut in ": null
    },
    {
        "French": "https://en.wikipedia.org/wiki/French_language"
    },
    {
        ", pu-pu in Japanese, bbang-bbang in ": null
    },
    {
        "Korean": "https://en.wikipedia.org/wiki/Korean_language"
    },
    {
        ", bært-bært in ": null
    },
    {
        "Norwegian": "https://en.wikipedia.org/wiki/Norwegian_language"
    },
    {
        ", fom-fom in Portuguese and bim-bim in ": null
    },
    {
        "Vietnamese": "https://en.wikipedia.org/wiki/Vietnamese_language"
    },
    {
        ".": null
    },
    {
        "An onomatopoeic effect can also be produced in a phrase or word string with the help of ": null
    },
    {
        "alliteration": "https://en.wikipedia.org/wiki/Alliteration"
    },
    {
        " and ": null
    },
    {
        "consonance": "https://en.wikipedia.org/wiki/Literary_consonance"
    },
    {
        " alone, without using any onomatopoeic words. The most famous example is the phrase \"furrow followed free\" in ": null
    },
    {
        "Samuel Taylor Coleridge": "https://en.wikipedia.org/wiki/Samuel_Taylor_Coleridge"
    },
    {
        "'s ": null
    },
    {
        "The Rime of the Ancient Mariner": "https://en.wikipedia.org/wiki/The_Rime_of_the_Ancient_Mariner"
    },
    {
        ". The words \"followed\" and \"free\" are not onomatopoeic in themselves, but in conjunction with \"furrow\" they reproduce the sound of ripples following in the wake of a speeding ship. Similarly, alliteration has been used in the line \"as the surf surged up the sun swept shore...\", to recreate the sound of breaking waves, in the poem \"I, She and the Sea\".": null
    },
    {
        "Comic strips": "https://en.wikipedia.org/wiki/Comic_strip"
    },
    {
        " and ": null
    },
    {
        "comic books": "https://en.wikipedia.org/wiki/Comic_book"
    },
    {
        " make extensive use of onomatopoeia. Popular culture historian Tim DeForest noted the impact of writer-artist ": null
    },
    {
        "Roy Crane": "https://en.wikipedia.org/wiki/Roy_Crane"
    },
    {
        " (1901–1977), the creator of ": null
    },
    {
        "Captain Easy": "https://en.wikipedia.org/wiki/Captain_Easy"
    },
    {
        " and ": null
    },
    {
        "Buz Sawyer": "https://en.wikipedia.org/wiki/Buz_Sawyer"
    },
    {
        ":": null
    },
    {
        "In 2002, ": null
    },
    {
        "DC Comics": "https://en.wikipedia.org/wiki/DC_Comics"
    },
    {
        " introduced a villain named ": null
    },
    {
        "Onomatopoeia": "https://en.wikipedia.org/wiki/Onomatopoeia_(comics)"
    },
    {
        ", an athlete, martial artist, and weapons expert, who often speaks pure sounds.": null
    },
    {
        "Advertising": "https://en.wikipedia.org/wiki/Advertising"
    },
    {
        " uses onomatopoeia for ": null
    },
    {
        "mnemonic": "https://en.wikipedia.org/wiki/Mnemonic"
    },
    {
        " purposes, so that consumers will remember their products, as in ": null
    },
    {
        "Alka-Seltzer": "https://en.wikipedia.org/wiki/Alka-Seltzer"
    },
    {
        "'s \"Plop, plop, fizz, fizz. Oh, what a relief it is!\" jingle, recorded in two different versions (big band and rock) by ": null
    },
    {
        "Sammy Davis, Jr.": "https://en.wikipedia.org/wiki/Sammy_Davis,_Jr."
    },
    {
        "Rice Krispies": "https://en.wikipedia.org/wiki/Rice_Krispies"
    },
    {
        " (US and UK) and ": null
    },
    {
        "Rice Bubbles": "https://en.wikipedia.org/wiki/Rice_Bubbles"
    },
    {
        " (AU) make a \"snap, crackle,   pop\" when one pours on milk. During the 1930s, the illustrator ": null
    },
    {
        "Vernon Grant": "https://en.wikipedia.org/wiki/Vernon_Simeon_Plemion_Grant"
    },
    {
        " developed ": null
    },
    {
        "Snap, Crackle and Pop": "https://en.wikipedia.org/wiki/Snap,_Crackle_and_Pop"
    },
    {
        " as gnome-like mascots for the ": null
    },
    {
        "Kellogg Company": "https://en.wikipedia.org/wiki/Kellogg_Company"
    },
    {
        ".": null
    },
    {
        "Sounds appear in road safety advertisements: \"clunk click, every trip\" (click the seatbelt on after clunking the car door closed; UK campaign) or \"click, clack, front and back\" (click, clack of connecting the ": null
    },
    {
        "seat belts": "https://en.wikipedia.org/wiki/Seat_belt"
    },
    {
        "; AU campaign) or \"click it or ticket\" (click of the connecting seat belt, with the implied penalty of a traffic ticket for not using a seat belt; US DOT (Department of Transportation) campaign).": null
    },
    {
        "The sound of the container opening and closing gives ": null
    },
    {
        "Tic Tac": "https://en.wikipedia.org/wiki/Tic_Tac"
    },
    {
        " its name.": null
    },
    {
        "In many of the world's languages, onomatopoeic-like words are used to describe phenomena beyond the purely auditive. Japanese often uses such words to describe feelings or figurative expressions about objects or concepts. For instance, Japanese barabara is used to reflect an object's state of disarray or separation, and shiiin is the onomatopoetic form of absolute silence (used at the time an English speaker might expect to hear the sound of ": null
    },
    {
        "crickets": "https://en.wikipedia.org/wiki/Cricket_(insect)"
    },
    {
        " chirping or a pin dropping in a silent room, or someone coughing). In Albanian, tartarec is used to describe someone who is hasty. It is used in English as well with terms like ": null
    },
    {
        "bling": "https://en.wikipedia.org/wiki/Bling"
    },
    {
        ", which describes the glinting of light on things like gold, chrome or precious stones. In Japanese, kirakira is used for glittery things.": null
    },
    {
        "A key component of language is its arbitrariness and what a word can represent, as a word is a sound created by humans with attached meaning to said sound. No one can determine the meaning of a word purely by how it sounds. However, in onomatopoeic words, these sounds are much less arbitrary; they are connected in their imitation of other objects or sounds in nature. Vocal sounds in the imitation of natural sounds doesn't necessarily gain meaning, but can gain symbolic meaning. An example of this ": null
    },
    {
        "sound symbolism": "https://en.wikipedia.org/wiki/Sound_symbolism"
    },
    {
        " in the English language is the use of words starting with sn-. Some of these words symbolize concepts related to the nose (sneeze, snot, snore). This does not mean that all words with that sound relate to the nose, but at some level we recognize a sort of symbolism associated with the sound itself. Onomatopoeia, while a facet of language, is also in a sense outside of the confines of language.": null
    },
    {
        "In linguistics, onomatopoeia is described as the connection, or symbolism, of a sound that is interpreted and reproduced within the context of a language, usually out of mimicry of a sound. It is a figure of speech, in a sense. Considered a vague term on its own, there are a few varying defining factors in classifying onomatopoeia. In one manner, it is defined simply as the imitation of some kind of non-vocal sound using the vocal sounds of a language, like the hum of a bee being imitated with a “buzz” sound. In another sense, it is described as the phenomena of making a new word entirely.": null
    },
    {
        "Onomatopoeia works in the sense of symbolizing an idea in a phonological context, not necessarily constituting a direct meaningful word in the process. The symbolic properties of a sound in a word, or a ": null
    },
    {
        "phoneme": "https://en.wikipedia.org/wiki/Phoneme"
    },
    {
        ", is related to a sound in an environment, and are restricted in part by a language's own phonetic inventory, hence why many languages can have distinct onomatopoeia for the same natural sound. Depending on a language’s connection to a sound's meaning, that language’s onomatopoeia inventory can differ proportionally. For example, a language like English generally holds little symbolic representation when it comes to sounds, which is the reason English tends to have a smaller representation of sound mimicry then a language like Japanese that overall has a much higher amount of symbolism related to the sounds of the language.": null
    },
    {
        "In ancient Greek philosophy, onomatopoeia was used as evidence for how natural a language was: it was theorized that language itself was derived from natural sounds in the world around us. Symbolism in sounds was seen as deriving from this. Some linguists hold that onomatopoeia may have been the first form of human language.": null
    },
    {
        "In the development of a language, sounds that are associated with natural objects then go on to form words with related meanings. For example, gl- at the beginning of an English word can denote something that is shining or iridescent (e.g. glitter, glisten, gleam).": null
    },
    {
        "When first exposed to sound and communication, humans are biologically inclined to mimic the sounds they hear, whether they are actual pieces of language or other natural sounds. Early on in development, an infant will vary his/her utterances between sounds that are well established within the phonetic range of the language(s) most heavily spoken in their environment, which may be called \"tame\" onomatopoeia, and the full range of sounds that the vocal tract can produce, or \"wild\" onomatopoeia. As one begins to acquire one's first language, the proportion of \"wild\" onomatopoeia reduces in favor of sounds which are congruent with those of the language they are acquiring.": null
    },
    {
        "During the native language acquisition period, it has been documented that infants may react strongly to the more wild-speech features to which they are exposed, compared to more tame and familiar speech features. But the results of such tests are inconclusive.": null
    },
    {
        "In the context of language acquisition, sound symbolism has been shown to play an important role. The association of foreign words to subjects and how they relate to general objects, such as the association of the words ": null
    },
    {
        "takete and baluma": "https://en.wikipedia.org/wiki/Bouba/kiki_effect"
    },
    {
        " with either a round or angular shape, has been tested to see how languages symbolize sounds.": null
    },
    {
        "The Japanese language has a large inventory of ideophone words that are symbolic sounds. These are used in contexts ranging from day to day conversation to serious news. These words fall into four categories:": null
    },
    {
        "The two former correspond directly to the concept of onomatopoeia, while the two latter are similar to onomatopoeia in that they are intented to represent a concept mimetically and performatively rather than referentially, but different from onomatopoeia in that they aren't just imitative of sounds. For example, \"shiinto\" represents something being silent, just as how an anglophone might say \"clatter, crash, bang!\" to represent something being noisy. That \"representative\" or \"performative\" aspect is the similarity to onomatopoeia.": null
    },
    {
        "Sometimes Japanese onomatopoeia produces reduplicated words.": null
    },
    {
        "As in Japanese, onomatopoeia in Hebrew sometimes produces reduplicated verbs:": null
    },
    {
        "There is a documented correlation within the ": null
    },
    {
        "Malay language": "https://en.wikipedia.org/wiki/Malay_language"
    },
    {
        " of onomatopoeia that begin with the sound bu- and the implication of something that is rounded. As well as with the sound of -lok within a word conveying curvature in such words like lok, kelok and telok ('locomotive', 'cove', and 'curve' respectively).": null
    },
    {
        "The Qur'an, written in Arabic, documents instances of onomatopoeia. Of about 77,701 words, there are nine words that are onomatopoeic: three are animal sounds (e.g., \"mooing\"), two are sounds of nature (e.g.; \"thunder\"), and four that are human sounds (e.g., \"whisper\" or \"groan\").": null
    },
    {
        "There is wide array of objects and animals in the ": null
    },
    {
        "Albanian language": "https://en.wikipedia.org/wiki/Albanian_language"
    },
    {
        " that have been named after the sound they produce. Such onomatopoeic words are shkrepse (matches), named after the distinct sound of friction and ignition of the match head; take-tuke (ashtray) mimicking the sound it makes when placed on a table; shi (rain) resembling the continuous sound of pouring rain; kukumjaçkë (": null
    },
    {
        "Little owl": "https://en.wikipedia.org/wiki/Little_owl"
    },
    {
        ") after its \"cuckoo\" hoot; furçë (brush) for its rustling sound; shapka (slippers and flip-flops); pordhë (rumorous flatulence) and fëndë (silent flatulence).": null
    }
]