[
    {
        "Inborn errors of metabolism form a large class of ": null
    },
    {
        "genetic diseases": "https://en.wikipedia.org/wiki/Genetic_disease"
    },
    {
        " involving ": null
    },
    {
        "congenital": "https://en.wikipedia.org/wiki/Congenital"
    },
    {
        " disorders of ": null
    },
    {
        "metabolism": "https://en.wikipedia.org/wiki/Metabolism"
    },
    {
        ". The majority are due to defects of single ": null
    },
    {
        "genes": "https://en.wikipedia.org/wiki/Gene"
    },
    {
        " that code for ": null
    },
    {
        "enzymes": "https://en.wikipedia.org/wiki/Enzyme"
    },
    {
        " that facilitate conversion of various substances (": null
    },
    {
        "substrates": "https://en.wikipedia.org/wiki/Substrate_(biochemistry)"
    },
    {
        ") into others (": null
    },
    {
        "products": "https://en.wikipedia.org/wiki/Product_(chemistry)"
    },
    {
        "). In most of the disorders, problems arise due to accumulation of substances which are toxic or interfere with normal function, or to the effects of reduced ability to synthesize essential compounds. Inborn errors of metabolism are now often referred to as congenital metabolic diseases or inherited metabolic disorders.The term inborn errors of metabolism was coined by a British physician, ": null
    },
    {
        "Archibald Garrod": "https://en.wikipedia.org/wiki/Archibald_Garrod"
    },
    {
        " (1857–1936), in 1908. He is known for work that prefigured the ": null
    },
    {
        "\"one gene-one enzyme\" hypothesis": "https://en.wikipedia.org/wiki/%22one_gene-one_enzyme%22_hypothesis"
    },
    {
        ", based on his studies on the nature and inheritance of ": null
    },
    {
        "alkaptonuria": "https://en.wikipedia.org/wiki/Alkaptonuria"
    },
    {
        ". His seminal text, Inborn Errors of Metabolism was published in 1923.": null
    },
    {
        "Traditionally the inherited metabolic diseases were classified as disorders of ": null
    },
    {
        "carbohydrate": "https://en.wikipedia.org/wiki/Carbohydrate"
    },
    {
        " metabolism, ": null
    },
    {
        "amino acid": "https://en.wikipedia.org/wiki/Amino_acid"
    },
    {
        " metabolism, ": null
    },
    {
        "organic acid": "https://en.wikipedia.org/wiki/Organic_acid"
    },
    {
        " metabolism, or ": null
    },
    {
        "lysosomal storage diseases": "https://en.wikipedia.org/wiki/Lysosomal_storage_disease"
    },
    {
        ". In recent decades, hundreds of new inherited disorders of metabolism have been discovered and the categories have proliferated. Following are some of the major classes of congenital metabolic diseases, with prominent examples of each class. Many others do not fall into these categories.": null
    },
    {
        "Because of the enormous number of these diseases and wide range of systems affected, nearly every \"presenting complaint\" to a healthcare provider may have a congenital metabolic disease as a possible cause, especially in childhood. The following are examples of potential manifestations affecting each of the major organ systems.": null
    },
    {
        "Dozens of congenital metabolic diseases are now detectable by ": null
    },
    {
        "newborn screening": "https://en.wikipedia.org/wiki/Newborn_screening"
    },
    {
        " tests, especially the expanded testing using mass spectrometry. This is an increasingly common way for the diagnosis to be made and sometimes results in earlier treatment and a better outcome. There is a revolutionary ": null
    },
    {
        "Gas chromatography–mass spectrometry": "https://en.wikipedia.org/wiki/Gas_chromatography%E2%80%93mass_spectrometry"
    },
    {
        "-based technology with an integrated analytics system, which has now made it possible to test a newborn for over 100 mm genetic metabolic disorders.": null
    },
    {
        "Because of the multiplicity of conditions, many different ": null
    },
    {
        "diagnostic tests": "https://en.wikipedia.org/wiki/Diagnostic_test"
    },
    {
        " are used for screening. An abnormal result is often followed by a subsequent \"definitive test\" to confirm the suspected diagnosis.": null
    },
    {
        "Common screening tests used in the last sixty years:": null
    },
    {
        "Specific diagnostic tests (or focused screening for a small set of disorders):": null
    },
    {
        "A 2015 review reported that even with all these diagnostic tests, there are cases when \"biochemical testing, gene sequencing, and enzymatic testing can neither confirm nor rule out an IEM, resulting in the need to rely on the patient's clinical course.\"": null
    },
    {
        "In the middle of the 20th century the principal treatment for some of the ": null
    },
    {
        "amino acid disorders": "https://en.wikipedia.org/w/index.php?title=Amino_acid_disorder&action=edit&redlink=1"
    },
    {
        " was restriction of dietary protein and all other care was simply management of complications. In the past twenty years, enzyme replacement, gene therapy, and organ transplantation have become available and beneficial for many previously untreatable disorders. Some of the more common or promising therapies are listed:": null
    },
    {
        "In a study in ": null
    },
    {
        "British Columbia": "https://en.wikipedia.org/wiki/British_Columbia"
    },
    {
        ", the overall incidence of the inborn errors of metabolism were estimated to be 40 per 100,000 live births or 1 in 1,400 births, overall representing more than approximately 15% of ": null
    },
    {
        "single gene disorders": "https://en.wikipedia.org/wiki/Single_gene_disorders"
    },
    {
        " in the population. While a Mexican study established an overall incidence of 3.4: 1000 live newborns and a carrier detection of 6.8:1000 NBS ": null
    }
]