[
    {
        "Puberty is the process of physical changes through which a ": null
    },
    {
        "child": "https://en.wikipedia.org/wiki/Child"
    },
    {
        "'s ": null
    },
    {
        "body": "https://en.wikipedia.org/wiki/Human_body"
    },
    {
        " matures into an ": null
    },
    {
        "adult": "https://en.wikipedia.org/wiki/Adult"
    },
    {
        " body capable of ": null
    },
    {
        "sexual reproduction": "https://en.wikipedia.org/wiki/Sexual_reproduction"
    },
    {
        ". It is initiated by ": null
    },
    {
        "hormonal": "https://en.wikipedia.org/wiki/Hormone"
    },
    {
        " signals from the ": null
    },
    {
        "brain": "https://en.wikipedia.org/wiki/Brain"
    },
    {
        " to the ": null
    },
    {
        "gonads": "https://en.wikipedia.org/wiki/Gonad"
    },
    {
        ": the ": null
    },
    {
        "ovaries": "https://en.wikipedia.org/wiki/Ovary"
    },
    {
        " in a girl, the ": null
    },
    {
        "testes": "https://en.wikipedia.org/wiki/Testis"
    },
    {
        " in a boy. In response to the signals, the gonads produce hormones that stimulate ": null
    },
    {
        "libido": "https://en.wikipedia.org/wiki/Libido"
    },
    {
        " and the growth, function, and transformation of the brain, ": null
    },
    {
        "bones": "https://en.wikipedia.org/wiki/Bone"
    },
    {
        ", ": null
    },
    {
        "muscle": "https://en.wikipedia.org/wiki/Muscle"
    },
    {
        ", ": null
    },
    {
        "blood": "https://en.wikipedia.org/wiki/Blood"
    },
    {
        ", ": null
    },
    {
        "skin": "https://en.wikipedia.org/wiki/Skin"
    },
    {
        ", ": null
    },
    {
        "hair": "https://en.wikipedia.org/wiki/Human_hair_growth"
    },
    {
        ", ": null
    },
    {
        "breasts": "https://en.wikipedia.org/wiki/Breast"
    },
    {
        ", and ": null
    },
    {
        "sex organs": "https://en.wikipedia.org/wiki/Sex_organ"
    },
    {
        ". ": null
    },
    {
        "Physical growth": "https://en.wikipedia.org/wiki/Human_development_(biology)"
    },
    {
        "—height and weight—accelerates in the first half of puberty and is completed when an adult body has been developed. Until the maturation of their reproductive capabilities, the pre-pubertal physical differences between boys and girls are the external sex organs.": null
    },
    {
        "On average, girls begin puberty around ages 10–11 and end puberty around 15–17; boys begin around ages 11–12 and end around 16–17. The major landmark of puberty for females is ": null
    },
    {
        "menarche": "https://en.wikipedia.org/wiki/Menarche"
    },
    {
        ", the onset of menstruation, which occurs on average between ages 12 and 13. For males, first ": null
    },
    {
        "ejaculation": "https://en.wikipedia.org/wiki/Ejaculation"
    },
    {
        " occurs on average at age 13.  In the 21st century, the average age at which children, especially girls, reach puberty is lower compared to the 19th century, when it was 15 for girls and 16 for boys. This can be due to any number of factors, including improved nutrition resulting in rapid body growth, increased weight and fat deposition, or exposure to ": null
    },
    {
        "endocrine disruptors": "https://en.wikipedia.org/wiki/Endocrine_disruptor"
    },
    {
        " such as ": null
    },
    {
        "xenoestrogens": "https://en.wikipedia.org/wiki/Xenoestrogen"
    },
    {
        ", which can at times be due to food consumption or other environmental factors. Puberty which starts earlier than usual is known as ": null
    },
    {
        "precocious puberty": "https://en.wikipedia.org/wiki/Precocious_puberty"
    },
    {
        ", and puberty which starts later than usual is known as ": null
    },
    {
        "delayed puberty": "https://en.wikipedia.org/wiki/Delayed_puberty"
    },
    {
        ".": null
    },
    {
        "Notable among the ": null
    },
    {
        "morphologic": "https://en.wikipedia.org/wiki/Morphology_(biology)"
    },
    {
        " changes in size, shape, composition, and functioning of the pubertal body, is the development of ": null
    },
    {
        "secondary sex characteristics": "https://en.wikipedia.org/wiki/Secondary_sex_characteristic"
    },
    {
        ", the \"filling in\" of the child's body; from girl to woman, from boy to man. Derived from the ": null
    },
    {
        "Latin": "https://en.wikipedia.org/wiki/Latin"
    },
    {
        "puberatum (age of maturity), the word puberty describes the physical changes to sexual maturation, not the ": null
    },
    {
        "psychosocial": "https://en.wikipedia.org/wiki/Psychosocial"
    },
    {
        " and cultural maturation denoted by the term adolescent development in ": null
    },
    {
        "Western culture": "https://en.wikipedia.org/wiki/Western_culture"
    },
    {
        ", wherein ": null
    },
    {
        "adolescence": "https://en.wikipedia.org/wiki/Adolescence"
    },
    {
        " is the period of mental transition from childhood to ": null
    },
    {
        "adulthood": "https://en.wikipedia.org/wiki/Adult"
    },
    {
        ", which overlaps much of the body's period of puberty.": null
    },
    {
        "Comprehensive sexuality education": "https://en.wikipedia.org/wiki/Comprehensive_sex_education"
    },
    {
        " can contribute to teenagers' better understanding of this process.": null
    },
    {
        "Two of the most significant differences between puberty in girls and puberty in boys are the age at which it begins, and the major ": null
    },
    {
        "sex steroids": "https://en.wikipedia.org/wiki/Sex_steroid"
    },
    {
        " involved, the ": null
    },
    {
        "androgens": "https://en.wikipedia.org/wiki/Androgen"
    },
    {
        " and the ": null
    },
    {
        "estrogens": "https://en.wikipedia.org/wiki/Estrogen"
    },
    {
        ".": null
    },
    {
        "Although there is a wide range of normal ages, girls typically begin puberty around ages 10–11 and end puberty around 15–17; boys begin around ages 11–12 and end around 16–17. Girls attain reproductive maturity about four years after the first physical changes of puberty appear. In contrast, boys accelerate more slowly but continue to grow for about six years after the first visible pubertal changes. Any increase in height beyond the post-pubertal age is uncommon.": null
    },
    {
        "For boys, the ": null
    },
    {
        "androgen": "https://en.wikipedia.org/wiki/Androgen"
    },
    {
        "testosterone": "https://en.wikipedia.org/wiki/Testosterone"
    },
    {
        " is the principal ": null
    },
    {
        "sex hormone": "https://en.wikipedia.org/wiki/Sex_hormone"
    },
    {
        "; while testosterone is produced, all boys' changes  are characterized as ": null
    },
    {
        "virilization": "https://en.wikipedia.org/wiki/Virilization"
    },
    {
        ". A substantial product of testosterone metabolism in males is ": null
    },
    {
        "estradiol": "https://en.wikipedia.org/wiki/Estradiol"
    },
    {
        ". The conversion of testosterone to estradiol depends on the amount of body fat and estradiol levels in boys are typically much lower than in girls. The male \"growth spurt\" also begins later, accelerates more slowly, and lasts longer before the ": null
    },
    {
        "epiphyses": "https://en.wikipedia.org/wiki/Epiphyses"
    },
    {
        " fuse. Although boys are on average 2 centimetres (0.8 in) shorter than girls before puberty begins, adult men are on average about 13 centimetres (5.1 in) taller than women. Most of this sex difference in adult heights is attributable to a later onset of the growth spurt and a slower progression to completion, a direct result of the later rise and lower adult male levels of estradiol.": null
    },
    {
        "The hormone that dominates female development is an ": null
    },
    {
        "estrogen": "https://en.wikipedia.org/wiki/Estrogen"
    },
    {
        " called ": null
    },
    {
        "estradiol": "https://en.wikipedia.org/wiki/Estradiol"
    },
    {
        ". While estradiol promotes growth of the breasts and ": null
    },
    {
        "uterus": "https://en.wikipedia.org/wiki/Uterus"
    },
    {
        ", it is also the principal hormone driving the pubertal growth spurt and ": null
    },
    {
        "epiphyseal": "https://en.wikipedia.org/wiki/Epiphyses"
    },
    {
        " maturation and closure. Estradiol levels rise earlier and reach higher levels in women than in men.": null
    },
    {
        "The hormonal maturation of females is considerably more complicated than in boys. The main ": null
    },
    {
        "steroid hormones": "https://en.wikipedia.org/wiki/Steroid_hormone"
    },
    {
        ", testosterone, estradiol, and progesterone as well as ": null
    },
    {
        "prolactin": "https://en.wikipedia.org/wiki/Prolactin"
    },
    {
        " play important physiological functions in puberty.Gonadal steroidgenesis in girls starts with production of testosterone which is typically quickly converted to estradiol inside the ovaries. However the rate of conversion from testosterone to estradiol (driven by FSH/LH balance) during early puberty is highly individual, resulting in very diverse development patterns of ": null
    },
    {
        "secondary sexual characteristics": "https://en.wikipedia.org/wiki/Secondary_sexual_characteristics"
    },
    {
        ". Production of progesterone in the ovaries begins with the development of ovulatory cycles in girls (during the lutheal phase of the cycle), before puberty low levels of ": null
    },
    {
        "progesterone": "https://en.wikipedia.org/wiki/Progesterone"
    },
    {
        " are produced in the adrenal glands of both boys and girls.": null
    },
    {
        "Puberty is preceded by ": null
    },
    {
        "adrenarche": "https://en.wikipedia.org/wiki/Adrenarche"
    },
    {
        ", marking an increase of adrenal androgen production between ages 6–10. Adrenarche is  sometimes accompanied by the early appearance of axillary and pubic hair. The first androgenic hair resulting from adrenarche can be also transient and disappear before the onset of true puberty.": null
    },
    {
        "The onset of puberty is associated with high ": null
    },
    {
        "GnRH": "https://en.wikipedia.org/wiki/Gonadotropin-releasing_hormone"
    },
    {
        " pulsing, which precedes the rise in sex hormones, ": null
    },
    {
        "LH": "https://en.wikipedia.org/wiki/Luteinizing_Hormone"
    },
    {
        " and ": null
    },
    {
        "FSH": "https://en.wikipedia.org/wiki/Follicle_Stimulating_Hormone"
    },
    {
        ". Exogenous GnRH pulses cause the onset of puberty. Brain tumors which increase GnRH output may also lead to premature puberty.": null
    },
    {
        "The cause of the GnRH rise is unknown. ": null
    },
    {
        "Leptin": "https://en.wikipedia.org/wiki/Leptin"
    },
    {
        " might be the cause of the GnRH rise. Leptin has receptors in the hypothalamus which synthesizes GnRH. Individuals who are deficient in leptin fail to initiate puberty. The levels of leptin increase with the onset of puberty, and then decline to adult levels when puberty is completed. The rise in GnRH might also be caused by genetics. A study discovered that a mutation in genes encoding both ": null
    },
    {
        "Neurokinin B": "https://en.wikipedia.org/wiki/Neurokinin_B"
    },
    {
        " as well as the Neurokinin B receptor can alter the timing of puberty. The researchers hypothesized that Neurokinin B might play a role in regulating the secretion of ": null
    },
    {
        "Kisspeptin": "https://en.wikipedia.org/wiki/Kisspeptin"
    },
    {
        ", a compound responsible for triggering direct release of ": null
    },
    {
        "GnRH": "https://en.wikipedia.org/wiki/Gonadotropin-releasing_hormone"
    },
    {
        " as well as indirect release of ": null
    },
    {
        "LH": "https://en.wikipedia.org/wiki/Luteinizing_Hormone"
    },
    {
        " and ": null
    },
    {
        "FSH": "https://en.wikipedia.org/wiki/Follicle_Stimulating_Hormone"
    },
    {
        ".": null
    },
    {
        "Several studies about puberty have examined the effects of an early or a late onset of puberty in males and females. In general, girls who enter puberty late experience positive outcomes in adolescence and adulthood while girls who enter puberty early experience negative outcomes. Boys who have earlier pubertal timing generally have more positive outcomes in adulthood but more negative outcomes in adolescence, while the reverse is true for later pubertal timing.": null
    },
    {
        "Outcomes have generally indicated that early onset of puberty in girls can be psychologically damaging. The main reason for this detrimental effect is the issue of ": null
    },
    {
        "body image": "https://en.wikipedia.org/wiki/Body_image"
    },
    {
        ". As they physically develop, gaining weight in several areas of the body, early-maturing girls usually look larger than girls who have not yet entered puberty. A result of the social pressure to be thin, the early-maturing girls develop a negative view of their body image. In addition, people may tease the girls about their visible breasts, forcing the early-maturing girl to hide her breasts by dressing differently. Embarrassment about a more developed body may also result in the refusal to undress for gym. These experiences lead to lower self-esteem, more depression and poorer body image in these early-maturing girls.": null
    },
    {
        "Furthermore, as physical and emotional differences set them apart from people in their same age group, early-maturing girls develop relationships with older people. For instance, some early-maturing girls have older boyfriends, \"attracted to the girls' womanly physique and girlish innocence.\" While having an older boyfriend might improve popularity among peers, it also increases the risk of alcohol and drug use, increased sexual relations (often unprotected), eating disorders and bullying.": null
    },
    {
        "Generally, later onset of puberty in girls produces positive outcomes. They exhibit positive behaviors in adolescence that continue to adulthood.": null
    },
    {
        "In the past, early onset of puberty in boys has been associated with positive outcomes, such as leadership in high school and success in adulthood. However, recent studies have revealed that the risks and problems of early maturation in males might outweigh the benefits.": null
    },
    {
        "Early-maturing boys develop \"more aggressive, law-breaking, and alcohol abusing\" behaviors, which result in anger towards parents and trouble in school and with the police. Early puberty also correlates with increased sexual activity and a higher instance of teenage pregnancy, both of which can lead to depression and other psychosocial issues.  However, early puberty might also result in positive outcomes, such as popularity among peers, higher self-esteem and confidence, as a result of physical developments, such as taller height, developed muscles, muscular male breast and better athletic ability.": null
    },
    {
        "On the other hand, late-maturing boys develop lower self-esteem and confidence and generally have lower popularity among peers, due to their less-developed physiques. Also, they experience problems with anxiety and depression and are more likely to be afraid of sex than other boys.": null
    },
    {
        "In boys, testicular enlargement is the first physical manifestation of puberty (and is termed ": null
    },
    {
        "gonadarche": "https://en.wikipedia.org/wiki/Gonadarche"
    },
    {
        ").": null
    },
    {
        "Testes": "https://en.wikipedia.org/wiki/Testes"
    },
    {
        " in prepubertal boys change little in size from about 1 year of age to the onset of puberty, averaging about 2–3 cm in length and about 1.5–2 cm in width. The size of the testicles is among the parameters of the ": null
    },
    {
        "Tanner scale for male genitals": "https://en.wikipedia.org/wiki/Tanner_scale#Genitals_(male)"
    },
    {
        ", from stage I which represents a volume of less than 1.5 ml, to stage V which represents a testicular volume of greater than 20 ml. Testicular size reaches maximal adult size about 6 years after the onset of puberty.  While 18–20 cm is an average adult size, there is wide variation in testicular size in the normal population. After the boy's testicles have enlarged and developed for about one year, the length and then the breadth of the shaft of the ": null
    },
    {
        "penis": "https://en.wikipedia.org/wiki/Human_penis"
    },
    {
        " will increase and the ": null
    },
    {
        "glans penis": "https://en.wikipedia.org/wiki/Glans_penis"
    },
    {
        " and corpora cavernosa will also start to enlarge to adult proportions.": null
    },
    {
        "The testes have two primary functions: to produce ": null
    },
    {
        "hormones": "https://en.wikipedia.org/wiki/Hormone"
    },
    {
        " and to produce ": null
    },
    {
        "sperm": "https://en.wikipedia.org/wiki/Spermatozoon"
    },
    {
        ". The ": null
    },
    {
        "Leydig cells": "https://en.wikipedia.org/wiki/Leydig_cell"
    },
    {
        " produce ": null
    },
    {
        "testosterone": "https://en.wikipedia.org/wiki/Testosterone"
    },
    {
        ", which in turn produces most of the male pubertal changes. Most of the increasing bulk of testicular tissue is spermatogenic tissue (primarily ": null
    },
    {
        "Sertoli": "https://en.wikipedia.org/wiki/Sertoli_cell"
    },
    {
        " and ": null
    },
    {
        "Leydig cells": "https://en.wikipedia.org/wiki/Leydig_cell"
    },
    {
        ").": null
    },
    {
        "By the end of puberty, adult men have heavier ": null
    },
    {
        "bones": "https://en.wikipedia.org/wiki/Bone"
    },
    {
        " and nearly twice as much skeletal ": null
    },
    {
        "muscle": "https://en.wikipedia.org/wiki/Muscle"
    },
    {
        ". Some of the bone growth (e.g. shoulder width and jaw) is disproportionately greater, resulting in noticeably different male and female skeletal shapes. The average adult male has about 150% of the lean body mass of an average female, and about 50% of the body fat.": null
    },
    {
        "This muscle develops mainly during the later stages of puberty, and muscle growth can continue even after boys are biologically adult. The peak of the so-called \"strength spurt\", the rate of muscle growth, is attained about one year after a male experiences his peak growth rate.": null
    },
    {
        "Often, the fat pads of the male breast tissue and the male nipples will develop during puberty; sometimes, especially in one breast, this becomes more apparent and is termed ": null
    },
    {
        "gynecomastia": "https://en.wikipedia.org/wiki/Gynecomastia"
    },
    {
        ". It is usually not a permanent phenomenon.": null
    },
    {
        "Erections": "https://en.wikipedia.org/wiki/Erection"
    },
    {
        " during sleep or when waking up are medically known as ": null
    },
    {
        "nocturnal penile tumescence": "https://en.wikipedia.org/wiki/Nocturnal_penile_tumescence"
    },
    {
        " and colloquially referred to as morning wood. The penis can regularly get erect during sleep and men or boys often wake up with an erection. Once a ": null
    },
    {
        "boy": "https://en.wikipedia.org/wiki/Boy"
    },
    {
        " reaches his ": null
    },
    {
        "teenage": "https://en.wikipedia.org/wiki/Teenage"
    },
    {
        " years, erections occur much more frequently due to puberty. Erections can occur spontaneously at any time of day, and if clothed may cause a bulge or \"hump\". This can be disguised or hidden by wearing close-fitting underwear, a long shirt and baggier clothes. Erections are common for male children and infants, and can even occur before birth. Spontaneous erections are also known as involuntary or unwanted erections and are normal. Such erections can be ": null
    },
    {
        "embarrassing": "https://en.wikipedia.org/wiki/Embarrassment"
    },
    {
        " if they happen in public, such as a ": null
    },
    {
        "classroom": "https://en.wikipedia.org/wiki/Classroom"
    },
    {
        " or ": null
    },
    {
        "living room": "https://en.wikipedia.org/wiki/Living_room"
    },
    {
        ".": null
    },
    {
        "During puberty, if not before, the tip and opening of a boy's ": null
    },
    {
        "foreskin": "https://en.wikipedia.org/wiki/Foreskin"
    },
    {
        " becomes wider, progressively allowing for retraction down the shaft of the ": null
    },
    {
        "penis": "https://en.wikipedia.org/wiki/Human_penis"
    },
    {
        " and behind the ": null
    },
    {
        "glans": "https://en.wikipedia.org/wiki/Glans_penis"
    },
    {
        ", which ultimately should be possible without pain or difficulty. The membrane that bonds the inner surface of the foreskin with the glans disintegrates and releases the foreskin to separate from the glans. The foreskin then gradually becomes retractable.": null
    },
    {
        "Research by Øster (1968) found that with the onset and continuation of puberty, the proportion of boys able to pull back their foreskins increased. At ages 12–13, Øster found that only 60% of boys were able to retract their foreskins; this increased to 85% by ages 14–15, and 95% by 16–17. He also found that 1% of those unable to fully retract experienced ": null
    },
    {
        "phimosis": "https://en.wikipedia.org/wiki/Phimosis"
    },
    {
        " at ages 14–17, the remainder were partially able to. The findings were supported by further research by Kayaba et al (1996) on a sample of over 600 boys, and Ishikawa and Kawakita (2004) found that by age 15, 77% of their sample of boys could retract their foreskins.  Beaugé (1997) reports that boys may assist the development of retractile foreskin by manual stretching.": null
    },
    {
        "Once a boy is able to retract his foreskin, penile hygiene should become an important feature of his routine body care. Although the ": null
    },
    {
        "American Academy of Pediatrics": "https://en.wikipedia.org/wiki/American_Academy_of_Pediatrics"
    },
    {
        " states there is \"little evidence to affirm the association between circumcision status and optimal penile hygiene\", various studies suggest that boys be educated about the role of hygiene, including retracting the foreskin while urinating and rinsing under it and around the glans at each bathing opportunity. Regular washing under the foreskin was found by Krueger and Osborn (1986) to reduce the risk of numerous penile disorders, however Birley et al. (1993) report excessive washing with soap should be avoided because it dries the oils out of the tissues and can cause non-specific dermatitis.": null
    },
    {
        "Pubic hair": "https://en.wikipedia.org/wiki/Pubic_hair"
    },
    {
        " often appears on a boy shortly after the genitalia begin to grow.  The pubic hairs are usually first visible at the dorsal (abdominal) base of the penis. The first few hairs are described as stage 2. Stage 3 is usually reached within another 6–12 months, when the hairs are too many to count. By stage 4, the pubic hairs densely fill the \"pubic triangle.\" Stage 5 refers to the spread of pubic hair to the ": null
    },
    {
        "thighs": "https://en.wikipedia.org/wiki/Thigh"
    },
    {
        " and upward towards the ": null
    },
    {
        "navel": "https://en.wikipedia.org/wiki/Navel"
    },
    {
        " as part of the developing ": null
    },
    {
        "abdominal hair": "https://en.wikipedia.org/wiki/Abdominal_hair"
    },
    {
        ".": null
    },
    {
        "In the months and years following the appearance of pubic hair, other areas of skin that respond to androgens may develop ": null
    },
    {
        "androgenic hair": "https://en.wikipedia.org/wiki/Androgenic_hair"
    },
    {
        ". The usual sequence is: ": null
    },
    {
        "underarm": "https://en.wikipedia.org/wiki/Underarm"
    },
    {
        " (axillary) hair, ": null
    },
    {
        "perianal hair": "https://en.wikipedia.org/wiki/Perianal_hair"
    },
    {
        ", ": null
    },
    {
        "upper lip hair": "https://en.wikipedia.org/wiki/Moustache"
    },
    {
        ", ": null
    },
    {
        "sideburn": "https://en.wikipedia.org/wiki/Sideburn"
    },
    {
        " (preauricular) hair, periareolar hair, and the ": null
    },
    {
        "beard": "https://en.wikipedia.org/wiki/Beard"
    },
    {
        " area. As with most human biological processes, this specific order may vary among some individuals. Arm, leg, ": null
    },
    {
        "chest": "https://en.wikipedia.org/wiki/Chest_hair"
    },
    {
        ", ": null
    },
    {
        "abdominal": "https://en.wikipedia.org/wiki/Abdominal_hair"
    },
    {
        ", and back hair become heavier more gradually. There is a large range in amount of body hair among adult men, and significant differences in timing and quantity of hair growth among different racial groups. Facial hair is often present in late adolescence, but may not appear until significantly later. Facial hair will continue to get coarser, darker and thicker for another 2–4 years after puberty. Some men do not develop full facial hair for up to 10 years after the completion of puberty. Chest hair may appear during puberty or years after, though not all men develop it.": null
    },
    {
        "Under the influence of androgens, the voice box, or ": null
    },
    {
        "larynx": "https://en.wikipedia.org/wiki/Larynx"
    },
    {
        ", ": null
    },
    {
        "grows": "https://en.wikipedia.org/wiki/Laryngeal_prominence"
    },
    {
        " in both sexes. This growth is far more prominent in boys, causing the male voice to drop and deepen, sometimes abruptly but rarely \"overnight,\" about one ": null
    },
    {
        "octave": "https://en.wikipedia.org/wiki/Octave"
    },
    {
        ", because the longer and thicker ": null
    },
    {
        "vocal folds": "https://en.wikipedia.org/wiki/Vocal_folds"
    },
    {
        " have a lower ": null
    },
    {
        "fundamental frequency": "https://en.wikipedia.org/wiki/Fundamental_frequency"
    },
    {
        ". Before puberty, the larynx of boys and girls is about equally small. Occasionally, voice change is accompanied by unsteadiness of vocalization in the early stages of untrained voices. Most of the voice change happens during stage 3-4 of male puberty around the time of peak growth. Adult pitch is attained at an average age of 15 years, although the voice may not fully settle until early twenties. It usually precedes the development of significant facial hair by several months to years.": null
    },
    {
        "The first physical sign of puberty in girls is usually a firm, tender lump under the center of the ": null
    },
    {
        "areola": "https://en.wikipedia.org/wiki/Areola"
    },
    {
        " of one or both ": null
    },
    {
        "breasts": "https://en.wikipedia.org/wiki/Breast"
    },
    {
        ", occurring on average at about 10.5 years of age. This is referred to as ": null
    },
    {
        "thelarche": "https://en.wikipedia.org/wiki/Thelarche"
    },
    {
        ". By the widely used ": null
    },
    {
        "Tanner staging": "https://en.wikipedia.org/wiki/Tanner_stages"
    },
    {
        " of puberty, this is stage 2 of breast development (stage 1 is a flat, prepubertal breast). Within six to 12 months, the swelling has clearly begun in both sides, softened, and can be felt and seen extending beyond the edges of the areolae. This is stage 3 of breast development. By another 12 months (stage 4), the breasts are approaching mature size and shape, with areolae and ": null
    },
    {
        "nipples": "https://en.wikipedia.org/wiki/Nipple"
    },
    {
        " forming a secondary mound. In most young women, this mound disappears into the contour of the mature breast (stage 5), although there is so much variation in sizes and shapes of adult breasts that stages 4 and 5 are not always separately identifiable.": null
    },
    {
        "Pubic hair": "https://en.wikipedia.org/wiki/Pubic_hair"
    },
    {
        " is often the second noticeable change in puberty, usually within a few months of thelarche. It is referred to as ": null
    },
    {
        "pubarche": "https://en.wikipedia.org/wiki/Pubarche"
    },
    {
        ". The pubic hairs are usually visible first along the ": null
    },
    {
        "labia": "https://en.wikipedia.org/wiki/Labium_(genitalia)"
    },
    {
        ". The first few hairs are described as Tanner stage 2. Stage 3 is usually reached within another 6–12 months, when the hairs are too numerous to count and appear on the ": null
    },
    {
        "pubic mound": "https://en.wikipedia.org/wiki/Mons_pubis"
    },
    {
        " as well. By stage 4, the pubic hairs densely fill the \"pubic triangle.\" Stage 5 refers to spread of pubic hair to the ": null
    },
    {
        "thighs": "https://en.wikipedia.org/wiki/Thigh"
    },
    {
        " and sometimes as ": null
    },
    {
        "abdominal hair": "https://en.wikipedia.org/wiki/Abdominal_hair"
    },
    {
        " upward towards the ": null
    },
    {
        "navel": "https://en.wikipedia.org/wiki/Navel"
    },
    {
        ". In about 15% of girls, the earliest pubic hair appears before breast development begins.": null
    },
    {
        "Perineal": "https://en.wikipedia.org/wiki/Perineum"
    },
    {
        " skin ": null
    },
    {
        "keratinizes": "https://en.wikipedia.org/wiki/Keratin"
    },
    {
        " due to effect of estrogen increasing its resistance to infection. The ": null
    },
    {
        "mucosal": "https://en.wikipedia.org/wiki/Mucosal_membrane"
    },
    {
        "surface": "https://en.wikipedia.org/wiki/Vagina#Layers,_regions_and_histology"
    },
    {
        " of the vagina also changes in response to increasing levels of ": null
    },
    {
        "estrogen": "https://en.wikipedia.org/wiki/Estrogen"
    },
    {
        ", becoming thicker and duller pink in color (in contrast to the brighter red of the prepubertal vaginal mucosa). Mucosa changes into a multilayered structure with superficial layer of squamous cells. Estrogen increase glycogen content in ": null
    },
    {
        "vaginal epithelium": "https://en.wikipedia.org/wiki/Vaginal_epithelium"
    },
    {
        ", which in future plays important part in maintaining ": null
    },
    {
        "vaginal pH": "https://en.wikipedia.org/wiki/Vaginal_ph"
    },
    {
        ". Whitish secretions (physiologic ": null
    },
    {
        "leukorrhea": "https://en.wikipedia.org/wiki/Leukorrhea"
    },
    {
        ") are a normal effect of estrogen as well. In the two years following thelarche, the ": null
    },
    {
        "uterus": "https://en.wikipedia.org/wiki/Uterus"
    },
    {
        ", ": null
    },
    {
        "ovaries": "https://en.wikipedia.org/wiki/Ovary"
    },
    {
        ", and the ": null
    },
    {
        "follicles": "https://en.wikipedia.org/wiki/Ovarian_follicle"
    },
    {
        " in the ovaries increase in size. The ovaries usually contain small follicular ": null
    },
    {
        "cysts": "https://en.wikipedia.org/wiki/Cyst"
    },
    {
        " visible by ": null
    },
    {
        "ultrasound": "https://en.wikipedia.org/wiki/Medical_ultrasonography"
    },
    {
        ". Before puberty, uterine body to cervix ratio is 1:1; which increases to 2:1 or 3:1 after completion of pubertal period.": null
    },
    {
        "The first ": null
    },
    {
        "menstrual bleeding": "https://en.wikipedia.org/wiki/Menstrual_cycle"
    },
    {
        " is referred to as ": null
    },
    {
        "menarche": "https://en.wikipedia.org/wiki/Menarche"
    },
    {
        ", and typically occurs about two years after ": null
    },
    {
        "thelarche": "https://en.wikipedia.org/wiki/Thelarche"
    },
    {
        ". The average age of menarche is 12.5 in the ": null
    },
    {
        "United States": "https://en.wikipedia.org/wiki/United_States"
    },
    {
        ". Most American girls experience their first period at 11, 12 or 13, but some experience it earlier than their 11th birthday and others after their 14th birthday. In fact, anytime between 8 and 16 is normal. In ": null
    },
    {
        "Canada": "https://en.wikipedia.org/wiki/Canada"
    },
    {
        ", the average age of menarche is 12.72, and in the ": null
    },
    {
        "United Kingdom": "https://en.wikipedia.org/wiki/United_Kingdom"
    },
    {
        " it is 12.9. The time between menstrual periods (menses) is not always regular in the first two years after menarche.": null
    },
    {
        "Ovulation": "https://en.wikipedia.org/wiki/Ovulation"
    },
    {
        " is necessary for ": null
    },
    {
        "fertility": "https://en.wikipedia.org/wiki/Fertility"
    },
    {
        ", but may or may not accompany the earliest menses. In postmenarchal girls, about 80% of the cycles were anovulatory in the first year after menarche, 50% in the third year and 10% in the sixth year. Initiation of ovulation after menarche is not inevitable. A high proportion of girls with continued irregularity in the menstrual cycle several years from menarche will continue to have prolonged irregularity and anovulation, and are at higher risk for reduced fertility.": null
    },
    {
        "During this period, also in response to rising levels of estrogen, the lower half of the ": null
    },
    {
        "pelvis": "https://en.wikipedia.org/wiki/Pelvis"
    },
    {
        " and thus ": null
    },
    {
        "hips": "https://en.wikipedia.org/wiki/Hip_(anatomy)"
    },
    {
        " widen (providing a larger ": null
    },
    {
        "birth canal": "https://en.wikipedia.org/wiki/Birth_canal"
    },
    {
        "). Fat tissue increases to a greater percentage of the body composition than in males, especially in the typical female distribution of breasts, hips, buttocks, thighs, upper arms, and pubis. Progressive differences in fat distribution as well as sex differences in local skeletal growth contribute to the typical female body shape by the end of puberty. On average, at 10 years, girls have 6% more body fat than boys.": null
    },
    {
        "Rising levels of ": null
    },
    {
        "androgens": "https://en.wikipedia.org/wiki/Androgen"
    },
    {
        " can change the ": null
    },
    {
        "fatty acid": "https://en.wikipedia.org/wiki/Fatty_acid"
    },
    {
        " composition of ": null
    },
    {
        "perspiration": "https://en.wikipedia.org/wiki/Perspiration"
    },
    {
        ", resulting in a more \"adult\" ": null
    },
    {
        "body odor": "https://en.wikipedia.org/wiki/Body_odor"
    },
    {
        ". This often precedes thelarche and pubarche by one or more years. Another androgen effect is increased secretion of oil (": null
    },
    {
        "sebum": "https://en.wikipedia.org/wiki/Sebum"
    },
    {
        ") from the skin. This change increases the susceptibility to ": null
    },
    {
        "acne": "https://en.wikipedia.org/wiki/Acne_vulgaris"
    },
    {
        ", a skin condition that is characteristic of puberty. Acne varies greatly in its severity.": null
    },
    {
        "In girls, ": null
    },
    {
        "estradiol": "https://en.wikipedia.org/wiki/Estradiol"
    },
    {
        " (the primary female sex hormone) causes thickening of lips and ": null
    },
    {
        "oral mucosa": "https://en.wikipedia.org/wiki/Oral_mucosa"
    },
    {
        " as well as further development of the ": null
    },
    {
        "vulva": "https://en.wikipedia.org/wiki/Vulva"
    },
    {
        ". In the vulva and vagina, estradiol causes thickening (": null
    },
    {
        "stratification": "https://en.wikipedia.org/wiki/Stratified_squamous_epithelium"
    },
    {
        ") of the skin and the growth of both the ": null
    },
    {
        "myoepithelial layer": "https://en.wikipedia.org/wiki/Myoepithelial_cells"
    },
    {
        " and the ": null
    },
    {
        "smooth muscle": "https://en.wikipedia.org/wiki/Smooth_muscle"
    },
    {
        " of the vagina. Typically estradiol will also cause pronounced growth of the ": null
    },
    {
        "labia minora": "https://en.wikipedia.org/wiki/Labia_minora"
    },
    {
        " and to a lesser degree of the ": null
    },
    {
        "labia majora": "https://en.wikipedia.org/wiki/Labia_majora"
    },
    {
        ".": null
    },
    {
        "Estradiol is also responsible for the increased production of ": null
    },
    {
        "pheomelanin": "https://en.wikipedia.org/wiki/Pheomelanin"
    },
    {
        ", resulting in the characteristic red color of the lips, labia minora and sometimes labia majora. Estradiol together with other ovarian steroids also cause the darker coloration of the ": null
    },
    {
        "areola": "https://en.wikipedia.org/wiki/Areola"
    },
    {
        ".": null
    },
    {
        "Testosterone will cause an enlargement of the ": null
    },
    {
        "clitoris": "https://en.wikipedia.org/wiki/Clitoris"
    },
    {
        " and possibly has important effects on the growth and maturation of the ": null
    },
    {
        "vestibular bulbs": "https://en.wikipedia.org/wiki/Vestibular_bulbs"
    },
    {
        ", ": null
    },
    {
        "corpus cavernosum of the clitoris": "https://en.wikipedia.org/wiki/Corpus_cavernosum_of_clitoris"
    },
    {
        " and ": null
    },
    {
        "urethral sponge": "https://en.wikipedia.org/wiki/Urethral_sponge"
    },
    {
        ".": null
    },
    {
        "Changes of the vulva initiated by estradiol as well as its direct effects also appear to influence the functioning of the lower urinary tract.": null
    },
    {
        "In a general sense, the conclusion of puberty is reproductive maturity. Criteria for defining the conclusion may differ for different purposes: attainment of the ability to reproduce, achievement of maximal adult height, maximal gonadal size, or adult sex hormone levels. Maximal adult height is achieved at an average age of 15 years for an average girl and 18 years for an average boy. Potential fertility (sometimes termed nubility) usually precedes completion of growth by 1–2 years in girls and 3–4 years in boys. Stage 5 typically represents maximal gonadal growth and adult hormone levels.": null
    },
    {
        "The definition of the onset of puberty may depend on perspective (e.g., hormonal versus physical) and purpose (establishing population normal standards, clinical care of early or late pubescent individuals, etc.). A common definition for the onset of puberty is physical changes to a person's body. These physical changes are the first visible signs of neural, hormonal, and gonadal function changes.": null
    },
    {
        "The age at which puberty begins varies between individuals; usually, puberty begins between 10 and 13 years of age. The age at which puberty begins is affected by both genetic factors and by environmental factors such as nutritional state and social circumstances. An example of social circumstances is the ": null
    },
    {
        "Vandenbergh effect": "https://en.wikipedia.org/wiki/Vandenbergh_effect"
    },
    {
        "; a juvenile female who has significant interaction with adult males will enter puberty earlier than juvenile females who are not socially overexposed to adult males.": null
    },
    {
        "The average age at which puberty begins may be affected by race as well. For example, the average age of ": null
    },
    {
        "menarche": "https://en.wikipedia.org/wiki/Menarche"
    },
    {
        " in various populations surveyed has ranged from 12 to 18 years. The earliest average onset of puberty is for African-American girls and the latest average onset for high altitude subsistence populations in Asia. However, much of the higher age averages reflect nutritional limitations more than genetic differences and can change within a few generations with a substantial change in diet. The median age of menarche for a population may be an index of the proportion of undernourished girls in the population, and the width of the spread may reflect unevenness of wealth and food distribution in a population.": null
    },
    {
        "Researchers have identified an earlier age of the onset of puberty.  However, they have based their conclusions on a comparison of data from 1999 with data from 1969.  In the earlier example, the sample population was based on a small sample of white girls (200, from Britain).  The later study identified as puberty as occurring in 48% of African-American girls by age nine, and 12% of white girls by that age.": null
    },
    {
        "One possible cause of a delay in the onset of puberty past the age 14 in girls and 15 in boys is ": null
    },
    {
        "Kallmann syndrome": "https://en.wikipedia.org/wiki/Kallmann_syndrome"
    },
    {
        ", a form of ": null
    },
    {
        "hypogonadotropic hypogonadism": "https://en.wikipedia.org/wiki/Hypogonadotropic_hypogonadism"
    },
    {
        " (HH). Kallmann syndrome is also associated with a lack of sense of smell (": null
    },
    {
        "anosmia": "https://en.wikipedia.org/wiki/Anosmia"
    },
    {
        ").  Kallmann syndrome and other forms of HH affect both men and women. It is caused by a failure in ": null
    },
    {
        "HPG axis": "https://en.wikipedia.org/wiki/HPG_axis"
    },
    {
        " at puberty which results in low or zero ": null
    },
    {
        "gonadotropin": "https://en.wikipedia.org/wiki/Gonadotropin"
    },
    {
        " (": null
    },
    {
        "LH": "https://en.wikipedia.org/wiki/Luteinizing_hormone"
    },
    {
        " and ": null
    },
    {
        "FSH": "https://en.wikipedia.org/wiki/Follicle-stimulating_hormone"
    },
    {
        ") levels with the subsequent result of a failure to commence or complete puberty, secondary ": null
    },
    {
        "hypogonadism": "https://en.wikipedia.org/wiki/Hypogonadism"
    },
    {
        " and ": null
    },
    {
        "infertility": "https://en.wikipedia.org/wiki/Infertility"
    },
    {
        ".": null
    },
    {
        "The average age at which the onset of puberty occurs has dropped significantly since the 1840s. In every decade from 1840 to 1950 there was a drop of four months in the average age of menarche among Western European females. In ": null
    },
    {
        "Norway": "https://en.wikipedia.org/wiki/Norway"
    },
    {
        ", girls born in 1840 had their menarche at an average age of 17 years. In France, the average in 1840 was 15.3 years. In ": null
    },
    {
        "England": "https://en.wikipedia.org/wiki/England"
    },
    {
        ", the average in 1840 was 16.5 years. In ": null
    },
    {
        "Japan": "https://en.wikipedia.org/wiki/Japan"
    },
    {
        " the decline happened later and was then more rapid: from 1945 to 1975 in Japan there was a drop of 11 months per decade.": null
    },
    {
        "A 2006 study in Denmark found  that puberty, as evidenced by breast development, started at an average age of 9 years and 10 months, a year earlier than when a similar study  was done in 1991.  Scientists believe the phenomenon could be linked to obesity or exposure to chemicals in the food chain, and is putting girls at greater long-term risk of breast cancer.": null
    },
    {
        "Various studies have found direct genetic effects to account for at least 46% of the variation of timing of puberty in well-nourished populations. The genetic association of timing is strongest between mothers and daughters. The specific ": null
    },
    {
        "genes": "https://en.wikipedia.org/wiki/Gene"
    },
    {
        " affecting timing are not yet known. Among the candidates is an ": null
    },
    {
        "androgen receptor": "https://en.wikipedia.org/wiki/Androgen_receptor"
    },
    {
        " gene.": null
    },
    {
        "Researchers have hypothesized that early puberty onset may be caused by certain hair care products containing estrogen or placenta, and by certain chemicals, namely ": null
    },
    {
        "phthalates": "https://en.wikipedia.org/wiki/Phthalate"
    },
    {
        ", which are used in many cosmetics, toys, and plastic food containers.": null
    },
    {
        "If genetic factors account for half of the variation of pubertal timing, environment factors are clearly important as well. One of the first observed environmental effects is that puberty occurs later in children raised at higher altitudes. The most important of the environmental influences is clearly nutrition, but a number of others have been identified, all which affect timing of female puberty and menarche more clearly than male puberty.": null
    },
    {
        "There is theoretical concern, and animal evidence, that environmental hormones and ": null
    },
    {
        "chemicals": "https://en.wikipedia.org/wiki/Chemical"
    },
    {
        " may affect aspects of prenatal or postnatal sexual development in humans. Large amounts of incompletely metabolized estrogens and ": null
    },
    {
        "progestogens": "https://en.wikipedia.org/wiki/Progestogen"
    },
    {
        " from pharmaceutical products are excreted into the sewage systems of large cities, and are sometimes detectable in the environment. ": null
    },
    {
        "Sex steroids": "https://en.wikipedia.org/wiki/Sex_steroid"
    },
    {
        " are sometimes used in cattle farming but have been banned in chicken meat production for 40 years. Although agricultural laws regulate use to minimize accidental human consumption, the rules are largely self-enforced in the United States. Significant exposure of a child to hormones or other substances that activate estrogen or androgen ": null
    },
    {
        "receptors": "https://en.wikipedia.org/wiki/Receptor_(biochemistry)"
    },
    {
        " could produce some or all of the changes of puberty.": null
    },
    {
        "Harder to detect as an influence on puberty are the more diffusely distributed environmental chemicals like PCBs (": null
    },
    {
        "polychlorinated biphenyl": "https://en.wikipedia.org/wiki/Polychlorinated_biphenyl"
    },
    {
        "), which can bind and trigger estrogen receptors.": null
    },
    {
        "More obvious degrees of partial puberty from direct exposure of young children to small but significant amounts of pharmaceutical sex steroids from exposure at home may be detected during medical evaluation for ": null
    },
    {
        "precocious puberty": "https://en.wikipedia.org/wiki/Precocious_puberty"
    },
    {
        ", but mild effects and the other potential exposures outlined above would not.": null
    },
    {
        "Bisphenol A": "https://en.wikipedia.org/wiki/Bisphenol_A"
    },
    {
        " (BPA) is a chemical used to make plastics, and is frequently used to make baby bottles, water bottles, sports equipment, medical devices, and as a coating in food and beverage cans.  Scientists are concerned about BPA's behavioral effects on fetuses, infants, and children at current exposure levels because it can affect the prostate gland, mammary gland, and lead to early puberty in girls. BPA mimics and interferes with the action of estrogen—an important reproduction and development regulator. It ": null
    },
    {
        "leaches": "https://en.wikipedia.org/wiki/Leaching_(chemical_science)"
    },
    {
        " out of plastic into liquids and foods, and the ": null
    },
    {
        "Centers for Disease Control and Prevention": "https://en.wikipedia.org/wiki/Centers_for_Disease_Control_and_Prevention"
    },
    {
        " (CDC) found measurable amounts of BPA in the bodies of more than 90 percent of the U.S. population studied.  The highest estimated daily intakes of BPA occur in infants and children. Many plastic baby bottles contain BPA, and BPA is more likely to leach out of plastic when its temperature is increased, as when one warms a baby bottle or warms up food in the microwave.": null
    },
    {
        "Nutritional": "https://en.wikipedia.org/wiki/Nutrition"
    },
    {
        " factors are the strongest and most obvious environmental factors affecting timing of puberty. Girls are especially sensitive to nutritional regulation because they must contribute all of the nutritional support to a growing fetus. Surplus ": null
    },
    {
        "calories": "https://en.wikipedia.org/wiki/Calorie"
    },
    {
        " (beyond growth and activity requirements) are reflected in the amount of ": null
    },
    {
        "body fat": "https://en.wikipedia.org/wiki/Adipose"
    },
    {
        ", which signals to the brain the availability of resources for initiation of puberty and fertility.": null
    },
    {
        "Much evidence suggests that for most of the last few centuries, nutritional differences accounted for majority of variation of pubertal timing in different populations, and even among social classes in the same population. Recent worldwide increased consumption of animal protein, other changes in nutrition, and increases in ": null
    },
    {
        "childhood obesity": "https://en.wikipedia.org/wiki/Childhood_obesity"
    },
    {
        " have resulted in falling ages of puberty, mainly in those populations with the higher previous ages. In many populations the amount of variation attributable to nutrition is shrinking.": null
    },
    {
        "Although available dietary energy (simple calories) is the most important dietary influence on timing of puberty, quality of the diet plays a role as well. Lower ": null
    },
    {
        "protein": "https://en.wikipedia.org/wiki/Protein"
    },
    {
        " intakes and higher ": null
    },
    {
        "dietary fiber": "https://en.wikipedia.org/wiki/Dietary_fiber"
    },
    {
        " intakes, as occur with typical ": null
    },
    {
        "vegetarian diets": "https://en.wikipedia.org/wiki/Vegetarianism"
    },
    {
        ", are associated with later onset and slower progression of female puberty.": null
    },
    {
        "Scientific researchers have linked early ": null
    },
    {
        "obesity": "https://en.wikipedia.org/wiki/Obesity"
    },
    {
        " with an earlier onset of puberty in girls.  They have cited obesity as a cause of breast development before nine years and menarche before twelve years. Early puberty in girls can be a harbinger of later health problems.": null
    },
    {
        "The average level of daily physical activity has also been shown to affect timing of puberty, especially in females. A high level of exercise, whether for athletic or body image purposes, or for daily subsistence, reduces energy calories available for reproduction and slows puberty. The exercise effect is often amplified by a lower body fat mass and cholesterol.": null
    },
    {
        "Chronic diseases can delay puberty in both boys and girls. Those that involve chronic inflammation or interfere with nutrition have the strongest effect. In the western world, ": null
    },
    {
        "inflammatory bowel disease": "https://en.wikipedia.org/wiki/Inflammatory_bowel_disease"
    },
    {
        " and ": null
    },
    {
        "tuberculosis": "https://en.wikipedia.org/wiki/Tuberculosis"
    },
    {
        " have been notorious for such an effect in the last century, while in areas of the underdeveloped world, chronic ": null
    },
    {
        "parasite": "https://en.wikipedia.org/wiki/Parasite"
    },
    {
        "infections": "https://en.wikipedia.org/wiki/Infection"
    },
    {
        " are widespread.": null
    },
    {
        "Mental illnesses occur in puberty. The brain undergoes significant development by ": null
    },
    {
        "hormones": "https://en.wikipedia.org/wiki/Hormone"
    },
    {
        " which can contribute to mood disorders such as ": null
    },
    {
        "major depressive disorder": "https://en.wikipedia.org/wiki/Major_depressive_disorder"
    },
    {
        ", ": null
    },
    {
        "bipolar disorder": "https://en.wikipedia.org/wiki/Bipolar_disorder"
    },
    {
        ", ": null
    },
    {
        "dysthymia": "https://en.wikipedia.org/wiki/Dysthymia"
    },
    {
        " and ": null
    },
    {
        "schizophrenia": "https://en.wikipedia.org/wiki/Schizophrenia"
    },
    {
        ". Girls aged between 15 and 19 make up 40% of ": null
    },
    {
        "anorexia nervosa": "https://en.wikipedia.org/wiki/Anorexia_nervosa"
    },
    {
        " cases.": null
    },
    {
        "Some of the least understood environmental influences on timing of puberty are social and psychological. In comparison with the effects of genetics, nutrition, and general health, social influences are small, shifting timing by a few months rather than years. Mechanisms of these social effects are unknown, though a variety of physiological processes, including ": null
    },
    {
        "pheromones": "https://en.wikipedia.org/wiki/Pheromone"
    },
    {
        ", have been suggested based on animal research.": null
    },
    {
        "The most important part of a child's psychosocial environment is the family, and most of the social influence research has investigated features of family structure and function in relation to earlier or later female puberty. Most of the studies have reported that menarche may occur a few months earlier in girls in high-stress households, whose fathers are absent during their early childhood, who have a stepfather in the home, who are subjected to prolonged ": null
    },
    {
        "sexual abuse": "https://en.wikipedia.org/wiki/Sexual_abuse"
    },
    {
        " in childhood, or who are ": null
    },
    {
        "adopted": "https://en.wikipedia.org/wiki/International_adoption"
    },
    {
        " from a developing country at a young age. Conversely, menarche may be slightly later when a girl grows up in a large family with a biological father present.": null
    },
    {
        "More extreme degrees of environmental stress, such as wartime refugee status with threat to physical survival, have been found to be associated with delay of maturation, an effect that may be compounded by dietary inadequacy.": null
    },
    {
        "Most of these reported social effects are small and our understanding is incomplete. Most of these \"effects\" are statistical associations revealed by ": null
    },
    {
        "epidemiologic": "https://en.wikipedia.org/wiki/Epidemiology"
    },
    {
        " surveys. Statistical associations are not necessarily causal, and a variety of covariables and alternative explanations can be imagined. Effects of such small size can never be confirmed or refuted for any individual child. Furthermore, interpretations of the data are politically controversial because of the ease with which this type of research can be used for political advocacy. Accusations of bias based on political agenda sometimes accompany scientific criticism.": null
    },
    {
        "Another limitation of the social research is that nearly all of it has concerned girls, partly because female puberty requires greater physiologic resources and partly because it involves a unique event (menarche) that makes survey research into female puberty much simpler than male. More detail is provided in the ": null
    },
    {
        "menarche": "https://en.wikipedia.org/wiki/Menarche"
    },
    {
        " article.": null
    },
    {
        "The sequence of events of pubertal development can occasionally vary. For example, in about 15% of boys and girls, ": null
    },
    {
        "pubarche": "https://en.wikipedia.org/wiki/Pubarche"
    },
    {
        " (the first pubic hairs) can precede, respectively, ": null
    },
    {
        "gonadarche": "https://en.wikipedia.org/wiki/Gonadarche"
    },
    {
        " and ": null
    },
    {
        "thelarche": "https://en.wikipedia.org/wiki/Thelarche"
    },
    {
        " by a few months. Rarely, ": null
    },
    {
        "menarche": "https://en.wikipedia.org/wiki/Menarche"
    },
    {
        " can occur before other signs of puberty in a few girls. These variations deserve medical evaluation because they can occasionally signal a disease.": null
    },
    {
        "The endocrine ": null
    },
    {
        "reproductive": "https://en.wikipedia.org/wiki/Reproductive"
    },
    {
        " system consists of the ": null
    },
    {
        "hypothalamus": "https://en.wikipedia.org/wiki/Hypothalamus"
    },
    {
        ", the ": null
    },
    {
        "pituitary": "https://en.wikipedia.org/wiki/Pituitary_gland"
    },
    {
        ", the ": null
    },
    {
        "gonads": "https://en.wikipedia.org/wiki/Gonad"
    },
    {
        ", and the ": null
    },
    {
        "adrenal glands": "https://en.wikipedia.org/wiki/Adrenal_gland"
    },
    {
        ", with input and regulation from many other body systems. True puberty is often termed \"central puberty\" because it begins as a process of the ": null
    },
    {
        "central nervous system": "https://en.wikipedia.org/wiki/Central_nervous_system"
    },
    {
        ". A simple description of hormonal puberty is as follows:": null
    },
    {
        "The onset of this neurohormonal process may precede the first visible body changes by 1–2 years.": null
    },
    {
        "The ": null
    },
    {
        "arcuate nucleus": "https://en.wikipedia.org/wiki/Arcuate_nucleus"
    },
    {
        " of the ": null
    },
    {
        "hypothalamus": "https://en.wikipedia.org/wiki/Hypothalamus"
    },
    {
        " is the driver of the reproductive system. It has ": null
    },
    {
        "neurons": "https://en.wikipedia.org/wiki/Neuron"
    },
    {
        " which generate and release pulses of GnRH into the portal venous system of the ": null
    },
    {
        "pituitary gland": "https://en.wikipedia.org/wiki/Pituitary_gland"
    },
    {
        ". The arcuate nucleus is affected and controlled by neuronal input from other areas of the brain and hormonal input from the ": null
    },
    {
        "gonads": "https://en.wikipedia.org/wiki/Gonad"
    },
    {
        ", ": null
    },
    {
        "adipose": "https://en.wikipedia.org/wiki/Adipose"
    },
    {
        " tissue and a variety of other systems.": null
    },
    {
        "The ": null
    },
    {
        "pituitary gland": "https://en.wikipedia.org/wiki/Pituitary_gland"
    },
    {
        " responds to the pulsed GnRH signals by releasing LH and FSH into the blood of the general circulation, also in a pulsatile pattern.": null
    },
    {
        "The gonads (": null
    },
    {
        "testes": "https://en.wikipedia.org/wiki/Testes"
    },
    {
        " and ": null
    },
    {
        "ovaries": "https://en.wikipedia.org/wiki/Ovary"
    },
    {
        ") respond to rising levels of LH and FSH by producing the ": null
    },
    {
        "steroid": "https://en.wikipedia.org/wiki/Steroid"
    },
    {
        "sex hormones": "https://en.wikipedia.org/wiki/Sex_steroid"
    },
    {
        ", ": null
    },
    {
        "testosterone": "https://en.wikipedia.org/wiki/Testosterone"
    },
    {
        " and ": null
    },
    {
        "estrogen": "https://en.wikipedia.org/wiki/Estrogen"
    },
    {
        ".": null
    },
    {
        "The ": null
    },
    {
        "adrenal glands": "https://en.wikipedia.org/wiki/Adrenal_gland"
    },
    {
        " are a second source for steroid hormones. Adrenal maturation, termed ": null
    },
    {
        "adrenarche": "https://en.wikipedia.org/wiki/Adrenarche"
    },
    {
        ", typically precedes gonadarche in mid-childhood.": null
    },
    {
        "The ": null
    },
    {
        "endocrine reproductive system": "https://en.wikipedia.org/wiki/Endocrine_system"
    },
    {
        " becomes functional by the end of the first ": null
    },
    {
        "trimester": "https://en.wikipedia.org/wiki/Pregnancy"
    },
    {
        " of fetal life. The testes and ovaries become briefly inactive around the time of birth but resume hormonal activity until several months after birth, when incompletely understood mechanisms in the brain begin to suppress the activity of the arcuate nucleus. This has been referred to as maturation of the prepubertal \"gonadostat,\" which becomes sensitive to negative feedback by ": null
    },
    {
        "sex steroids": "https://en.wikipedia.org/wiki/Sex_steroid"
    },
    {
        ". The period of hormonal activity until several months after birth, followed by suppression of activity, may correspond to the period of infant sexuality, followed by a ": null
    },
    {
        "latency stage": "https://en.wikipedia.org/wiki/Latency_stage"
    },
    {
        ", which ": null
    },
    {
        "Sigmund Freud": "https://en.wikipedia.org/wiki/Sigmund_Freud"
    },
    {
        " described.": null
    },
    {
        "Gonadotropin": "https://en.wikipedia.org/wiki/Gonadotropin"
    },
    {
        " and sex steroid levels fall to low levels (nearly undetectable by current ": null
    },
    {
        "clinical assays": "https://en.wikipedia.org/wiki/Medical_test"
    },
    {
        ") for approximately another 8 to 10 years of childhood. Evidence is accumulating that the reproductive system is not totally inactive during the childhood years. Subtle increases in gonadotropin pulses occur, and ovarian follicles surrounding ": null
    },
    {
        "germ cells": "https://en.wikipedia.org/wiki/Germ_cell"
    },
    {
        " (future ": null
    },
    {
        "eggs": "https://en.wikipedia.org/wiki/Ovum"
    },
    {
        ") double in number.": null
    },
    {
        "Normal puberty is initiated in the hypothalamus, with de-inhibition of the pulse generator in the arcuate nucleus. This inhibition of the arcuate nucleus is an ongoing active suppression by other areas of the brain. The signal and mechanism releasing the arcuate nucleus from inhibition have been the subject of investigation for decades and remain incompletely understood. ": null
    },
    {
        "Leptin": "https://en.wikipedia.org/wiki/Leptin"
    },
    {
        " levels rise throughout childhood and play a part in allowing the arcuate nucleus to resume operation. If the childhood inhibition of the arcuate nucleus is interrupted prematurely by injury to the brain, it may resume pulsatile gonadotropin release and puberty will begin at an early age.": null
    },
    {
        "Neurons of the arcuate nucleus secrete ": null
    },
    {
        "gonadotropin releasing hormone": "https://en.wikipedia.org/wiki/Gonadotropin_releasing_hormone"
    },
    {
        " (GnRH) into the blood of the pituitary portal system. An American physiologist, Ernst Knobil, found that the GnRH signals from the hypothalamus induce pulsed secretion of LH (and to a lesser degree, FSH) at roughly 1-2 hour intervals. The LH pulses are the consequence of pulsatile GnRH secretion by the arcuate nucleus that, in turn, is the result of an ": null
    },
    {
        "oscillator": "https://en.wikipedia.org/wiki/Oscillator"
    },
    {
        " or signal generator in the central nervous system (\"GnRH pulse generator\"). In the years preceding physical puberty, ": null
    },
    {
        "Robert M. Boyar": "https://en.wikipedia.org/wiki/Robert_M._Boyar"
    },
    {
        " discovered that the gonadotropin pulses occur only during sleep, but as puberty progresses they can be detected during the day. By the end of puberty, there is little day-night difference in the amplitude and frequency of gonadotropin pulses.": null
    },
    {
        "Some investigators have attributed the onset of puberty to a ": null
    },
    {
        "resonance": "https://en.wikipedia.org/wiki/Resonance"
    },
    {
        " of oscillators in the brain. By this mechanism, the gonadotropin pulses that occur primarily at night just before puberty represent ": null
    },
    {
        "beats": "https://en.wikipedia.org/wiki/Beat_(acoustics)"
    },
    {
        ".": null
    },
    {
        "An array of \"autoamplification processes\" increases the production of all of the pubertal hormones of the hypothalamus, pituitary, and gonads.": null
    },
    {
        "Regulation of ": null
    },
    {
        "adrenarche": "https://en.wikipedia.org/wiki/Adrenarche"
    },
    {
        " and its relationship to maturation of the hypothalamic-gonadal axis is not fully understood, and some evidence suggests it is a parallel but largely independent process coincident with or even preceding central puberty. Rising levels of adrenal ": null
    },
    {
        "androgens": "https://en.wikipedia.org/wiki/Androgen"
    },
    {
        " (termed adrenarche) can usually be detected between 6 and 11 years of age, even before the increasing gonadotropin pulses of hypothalamic puberty. Adrenal androgens contribute to the development of pubic hair (": null
    },
    {
        "pubarche": "https://en.wikipedia.org/wiki/Pubarche"
    },
    {
        "), adult ": null
    },
    {
        "body odor": "https://en.wikipedia.org/wiki/Body_odor"
    },
    {
        ", and other androgenic changes in both sexes. The primary clinical significance of the distinction between adrenarche and gonadarche is that pubic hair and body odor changes by themselves do not prove that central puberty is underway for an individual child.": null
    },
    {
        "Early stages of male hypothalamic maturation seem to be very similar to the early stages of female puberty, though occurring about 1–2 years later.": null
    },
    {
        "LH stimulates the Leydig cells of the testes to make testosterone and blood levels begin to rise. For much of puberty, nighttime levels of testosterone are higher than daytime. Regularity of frequency and amplitude of gonadotropin pulses seems to be less necessary for progression of male than female puberty.": null
    },
    {
        "However, a significant portion of ": null
    },
    {
        "testosterone": "https://en.wikipedia.org/wiki/Testosterone"
    },
    {
        " in adolescent boys is converted to estradiol. Estradiol mediates the growth spurt, bone maturation, and epiphyseal closure in boys just as in girls. Estradiol also induces at least modest development of breast tissue (": null
    },
    {
        "gynecomastia": "https://en.wikipedia.org/wiki/Gynecomastia"
    },
    {
        ") in a large proportion of boys. Boys who develop mild ": null
    },
    {
        "gynecomastia": "https://en.wikipedia.org/wiki/Gynecomastia"
    },
    {
        " or even developing ": null
    },
    {
        "swellings": "https://en.wikipedia.org/wiki/Swelling_(medical)"
    },
    {
        " under ": null
    },
    {
        "nipples": "https://en.wikipedia.org/wiki/Nipple"
    },
    {
        " during puberty are told the effects are temporary in some male teenagers due to high levels of ": null
    },
    {
        "estradiol": "https://en.wikipedia.org/wiki/Estradiol"
    },
    {
        ".": null
    },
    {
        "Another hormonal change in males takes place during the teenage years for most young men. At this point in a male's life the testosterone levels slowly rise, and most of the effects are mediated through the androgen receptors by way of conversion ": null
    },
    {
        "dihydrotestosterone": "https://en.wikipedia.org/wiki/Dihydrotestosterone"
    },
    {
        " in target organs (especially that of the bowels).": null
    },
    {
        "As the amplitude of LH pulses increases, the theca cells of the ovaries begin to produce testosterone and smaller amounts of ": null
    },
    {
        "progesterone": "https://en.wikipedia.org/wiki/Progesterone"
    },
    {
        ". Much of the testosterone moves into nearby cells called ": null
    },
    {
        "granulosa cells": "https://en.wikipedia.org/wiki/Granulosa_cell"
    },
    {
        ". Smaller increases of FSH induce an increase in the ": null
    },
    {
        "aromatase": "https://en.wikipedia.org/wiki/Aromatase"
    },
    {
        " activity of these granulosa cells, which converts most of the testosterone to estradiol for secretion into the circulation. The remaining testosterone, together with adrenal androgens is responsible for the typical androgenic changes of female puberty: pubic hair, other androgenic hair as outlined above, body odor, acne. The bioactivity of testosterone is to a large degree limited by ": null
    },
    {
        "SHBG": "https://en.wikipedia.org/wiki/SHBG"
    },
    {
        " which in turn is mainly controlled by estradiol and ": null
    },
    {
        "prolactin": "https://en.wikipedia.org/wiki/Prolactin"
    },
    {
        " levels (estradiol stimulates, prolactin decreases SHBG synthesis).": null
    },
    {
        "Rising levels of estradiol produce the characteristic estrogenic body changes of female puberty: growth spurt, acceleration of bone maturation and closure, ": null
    },
    {
        "breast": "https://en.wikipedia.org/wiki/Breast"
    },
    {
        "growth": "https://en.wikipedia.org/wiki/Human_development_(biology)"
    },
    {
        ", increased fat composition, growth of the uterus, increased thickness of the ": null
    },
    {
        "endometrium": "https://en.wikipedia.org/wiki/Endometrium"
    },
    {
        " and the vaginal mucosa, and widening of the lower pelvis.": null
    },
    {
        "As the estradiol levels gradually rise and the other autoamplification processes occur, a point of maturation is reached when the feedback sensitivity of the hypothalamic \"gonadostat\" becomes positive. This attainment of positive feedback is the hallmark of female sexual maturity, as it allows the mid cycle LH surge necessary for ": null
    },
    {
        "ovulation": "https://en.wikipedia.org/wiki/Ovulation"
    },
    {
        ".": null
    },
    {
        "Growth hormone levels rise steadily throughout puberty. ": null
    },
    {
        "IGF1": "https://en.wikipedia.org/wiki/Insulin-like_growth_factor_1"
    },
    {
        " levels rise and then decline as puberty ends. Growth finishes and adult height is attained as the estradiol levels complete closure of the ": null
    },
    {
        "epiphyses": "https://en.wikipedia.org/wiki/Epiphyses"
    },
    {
        ".": null
    }
]