[
    {
        "Arachidonic acid (AA, sometimes ARA) is a ": null
    },
    {
        "polyunsaturated": "https://en.wikipedia.org/wiki/Polyunsaturated"
    },
    {
        "omega-6 fatty acid": "https://en.wikipedia.org/wiki/Omega-6_fatty_acid"
    },
    {
        " 20:4(ω-6), or 20:4(5,8,11,14).  It is structurally related to the saturated ": null
    },
    {
        "arachidic acid": "https://en.wikipedia.org/wiki/Arachidic_acid"
    },
    {
        " found in ": null
    },
    {
        "cupuaçu butter": "https://en.wikipedia.org/wiki/Cupua%C3%A7u"
    },
    {
        ".": null
    },
    {
        "": "https://en.wikipedia.org/wiki/File:AAnumbering.png"
    },
    {
        "In ": null
    },
    {
        "chemical structure": "https://en.wikipedia.org/wiki/Chemical_structure"
    },
    {
        ", arachidonic acid is a ": null
    },
    {
        "carboxylic acid": "https://en.wikipedia.org/wiki/Carboxylic_acid"
    },
    {
        " with a 20-carbon chain and four ": null
    },
    {
        "cis": "https://en.wikipedia.org/wiki/Cis%E2%80%93trans_isomerism"
    },
    {
        "-": null
    },
    {
        "double bonds": "https://en.wikipedia.org/wiki/Double_bond"
    },
    {
        "; the first double bond is located at the sixth carbon from the omega end.": null
    },
    {
        "Some chemistry sources define 'arachidonic acid' to designate any of the ": null
    },
    {
        "eicosatetraenoic acids": "https://en.wikipedia.org/wiki/Eicosatetraenoic_acid"
    },
    {
        ".  However, almost all writings in biology, medicine, and nutrition limit the term  to all cis-5,8,11,14-eicosatetraenoic acid.": null
    },
    {
        "Arachidonic acid is a polyunsaturated fatty acid present in the ": null
    },
    {
        "phospholipids": "https://en.wikipedia.org/wiki/Phospholipid"
    },
    {
        " (especially ": null
    },
    {
        "phosphatidylethanolamine": "https://en.wikipedia.org/wiki/Phosphatidylethanolamine"
    },
    {
        ", ": null
    },
    {
        "phosphatidylcholine": "https://en.wikipedia.org/wiki/Phosphatidylcholine"
    },
    {
        ", and ": null
    },
    {
        "phosphatidylinositides": "https://en.wikipedia.org/wiki/Phosphatidylinositide"
    },
    {
        ") of ": null
    },
    {
        "membranes": "https://en.wikipedia.org/wiki/Cell_membrane"
    },
    {
        " of the body's ": null
    },
    {
        "cells": "https://en.wikipedia.org/wiki/Cell_(biology)"
    },
    {
        ", and is abundant in the ": null
    },
    {
        "brain": "https://en.wikipedia.org/wiki/Brain"
    },
    {
        ", ": null
    },
    {
        "muscles": "https://en.wikipedia.org/wiki/Muscles"
    },
    {
        ", and ": null
    },
    {
        "liver": "https://en.wikipedia.org/wiki/Liver"
    },
    {
        ". Skeletal muscle is an especially active site of arachidonic acid retention, accounting for roughly 10-20% of the phospholipid fatty acid content typically.": null
    },
    {
        "In addition to being involved in ": null
    },
    {
        "cellular signaling": "https://en.wikipedia.org/wiki/Cellular_signaling"
    },
    {
        " as a lipid ": null
    },
    {
        "second messenger": "https://en.wikipedia.org/wiki/Second_messenger"
    },
    {
        " involved in the regulation of signaling enzymes, such as ": null
    },
    {
        "PLC": "https://en.wikipedia.org/wiki/Phospholipase_C"
    },
    {
        "-γ, PLC-δ, and ": null
    },
    {
        "PKC": "https://en.wikipedia.org/wiki/Protein_kinase_C"
    },
    {
        "-α, -β, and -γ isoforms, arachidonic acid is a key inflammatory intermediate and can also act as a ": null
    },
    {
        "vasodilator": "https://en.wikipedia.org/wiki/Vasodilator"
    },
    {
        ". (Note separate synthetic pathways, as described in section below.)": null
    },
    {
        "Arachidonic acid is not one of the ": null
    },
    {
        "essential fatty acids": "https://en.wikipedia.org/wiki/Essential_fatty_acid"
    },
    {
        ". However, it does become essential if a deficiency in ": null
    },
    {
        "linoleic acid": "https://en.wikipedia.org/wiki/Linoleic_acid"
    },
    {
        " exists or if an inability to convert linoleic acid to arachidonic acid occurs.  Some mammals lack the ability or have a very limited capacity to convert linoleic acid to arachidonic acid, making it an essential part of their diets. Since little or no arachidonic acid is found in common plants, such animals are obligate ": null
    },
    {
        "carnivores": "https://en.wikipedia.org/wiki/Carnivore"
    },
    {
        "; the cat is a common example having inability to desaturate essential fatty acids. A commercial source of arachidonic acid has been derived, however, from the fungus ": null
    },
    {
        "Mortierella alpina": "https://en.wikipedia.org/wiki/Mortierella"
    },
    {
        ".": null
    },
    {
        "Arachidonic acid is freed from a ": null
    },
    {
        "phospholipid": "https://en.wikipedia.org/wiki/Phospholipid"
    },
    {
        " molecule by the enzyme ": null
    },
    {
        "phospholipase A2": "https://en.wikipedia.org/wiki/Phospholipase_A2"
    },
    {
        " (PLA), which cleaves off the ": null
    },
    {
        "fatty acid": "https://en.wikipedia.org/wiki/Fatty_acid"
    },
    {
        ", but can also be generated from  ": null
    },
    {
        "DAG": "https://en.wikipedia.org/wiki/Diacylglycerol"
    },
    {
        " by ": null
    },
    {
        "diacylglycerol lipase": "https://en.wikipedia.org/wiki/Diacylglycerol_lipase"
    },
    {
        ".": null
    },
    {
        "Arachidonic acid generated for signaling purposes appears to be derived by the action of group IVA cytosolic ": null
    },
    {
        "phospholipase A2": "https://en.wikipedia.org/wiki/Phospholipase_A2"
    },
    {
        " (cPLA, 85 kDa), whereas inflammatory arachidonic acid is generated by the action of a low-molecular-weight secretory PLA (sPLA, 14-18 kDa).": null
    },
    {
        "Arachidonic acid is the precursor that is metabolized by various enzymes to a wide range of biologically and clinically important ": null
    },
    {
        "eicosanoids": "https://en.wikipedia.org/wiki/Eicosanoid"
    },
    {
        " and metabolites of these eicosanoids:": null
    },
    {
        "The production of these derivatives and their actions in the body are collectively known as the \"arachidonic acid cascade\"; see ": null
    },
    {
        "essential fatty acid interactions": "https://en.wikipedia.org/wiki/Essential_fatty_acid_interactions"
    },
    {
        " and the enzyme and metabolite linkages given in the previous paragraph for more details.": null
    },
    {
        "PLA, in turn, is activated by ligand binding to receptors, including:": null
    },
    {
        "Furthermore, any agent increasing intracellular ": null
    },
    {
        "calcium": "https://en.wikipedia.org/wiki/Calcium"
    },
    {
        " may cause activation of some forms of PLA.": null
    },
    {
        "Alternatively, arachidonic acid may be cleaved from phospholipids after ": null
    },
    {
        "phospholipase C": "https://en.wikipedia.org/wiki/Phospholipase_C"
    },
    {
        " (PLC) cleaves off the ": null
    },
    {
        "inositol trisphosphate": "https://en.wikipedia.org/wiki/Inositol_trisphosphate"
    },
    {
        " group, yielding ": null
    },
    {
        "diacylglycerol": "https://en.wikipedia.org/wiki/Diacylglycerol"
    },
    {
        " (DAG), which subsequently is cleaved by ": null
    },
    {
        "DAG lipase": "https://en.wikipedia.org/wiki/Diacylglycerol_lipase"
    },
    {
        " to yield arachidonic acid.": null
    },
    {
        "Receptors that activate this pathway include:": null
    },
    {
        "PLC may also be activated by ": null
    },
    {
        "MAP kinase": "https://en.wikipedia.org/wiki/MAP_kinase"
    },
    {
        ". Activators of this pathway include ": null
    },
    {
        "PDGF": "https://en.wikipedia.org/wiki/Platelet_derived_growth_factor"
    },
    {
        " and ": null
    },
    {
        "FGF": "https://en.wikipedia.org/wiki/Fibroblast_growth_factor"
    },
    {
        ".": null
    },
    {
        "Arachidonic acid promotes the repair and growth of skeletal muscle tissue via conversion to prostaglandin ": null
    },
    {
        "PGF2alpha": "https://en.wikipedia.org/wiki/PGF2alpha"
    },
    {
        " during and following ": null
    },
    {
        "physical exercise": "https://en.wikipedia.org/wiki/Physical_exercise"
    },
    {
        ". PGF2alpha promotes muscle protein synthesis by signaling through the ": null
    },
    {
        "Akt": "https://en.wikipedia.org/wiki/Akt"
    },
    {
        "/": null
    },
    {
        "mTOR": "https://en.wikipedia.org/wiki/MTOR"
    },
    {
        " pathway, similar to ": null
    },
    {
        "leucine": "https://en.wikipedia.org/wiki/Leucine"
    },
    {
        ", ": null
    },
    {
        "β-hydroxy β-methylbutyric acid": "https://en.wikipedia.org/wiki/%CE%92-hydroxy_%CE%B2-methylbutyric_acid"
    },
    {
        ", and ": null
    },
    {
        "phosphatidic acid": "https://en.wikipedia.org/wiki/Phosphatidic_acid"
    },
    {
        ".": null
    },
    {
        "Arachidonic acid is one of the most abundant fatty acids in the brain, and is present in similar quantities to ": null
    },
    {
        "docosahexaenoic acid": "https://en.wikipedia.org/wiki/Docosahexaenoic_acid"
    },
    {
        " (DHA). The two account for about 20% of its fatty-acid content. Like DHA, neurological health is reliant upon sufficient levels of arachidonic acid. Among other things, arachidonic acid helps to maintain ": null
    },
    {
        "hippocampal": "https://en.wikipedia.org/wiki/Hippocampus"
    },
    {
        " cell membrane fluidity. It also helps protect the brain from oxidative stress by activating ": null
    },
    {
        "peroxisome proliferator-activated receptor gamma": "https://en.wikipedia.org/wiki/Peroxisome_proliferator-activated_receptor_gamma"
    },
    {
        ". ARA also activates ": null
    },
    {
        "syntaxin": "https://en.wikipedia.org/wiki/Syntaxin"
    },
    {
        "-3 (STX-3), a protein involved in the growth and repair of neurons.": null
    },
    {
        "Arachidonic acid is also involved in early neurological development. In one study, infants (18 months) given supplemental arachidonic acid for 17 weeks demonstrated significant improvements in intelligence, as measured by the Mental Development Index. This effect is further enhanced by the simultaneous supplementation of ARA with DHA.": null
    },
    {
        "In adults, the disturbed metabolism of ARA may contribute to neuropsychiatric disorders such as ": null
    },
    {
        "Alzheimer's disease": "https://en.wikipedia.org/wiki/Alzheimer%27s_disease"
    },
    {
        " and ": null
    },
    {
        "bipolar disorder": "https://en.wikipedia.org/wiki/Bipolar_disorder"
    },
    {
        ". There is evidence of significant alterations in the conversion of arachidonic acid to other bioactive molecules (overexpression or disturbances in the ARA enzyme cascade) in these conditions.": null
    },
    {
        "Studies on arachidonic acid and the pathogenesis of Alzheimer's disease have shown mixed results, with one study of AA and its metabolites that suggests they are associated with the onset of Alzheimer's disease, whereas another study suggests that the supplementation of arachidonic acid during the early stages of this disease may be effective in reducing symptoms and slowing the disease progress. Additional studies on arachidonic acid supplementation for Alzheimer's patients are needed. Another study indicates that air pollution is the source of inflammation and arachidonic acid metabolites promote the inflammation to signal the immune system of the cell damage.": null
    },
    {
        "Arachidonic acid is marketed as an ": null
    },
    {
        "anabolic": "https://en.wikipedia.org/wiki/Anabolic"
    },
    {
        "bodybuilding supplement": "https://en.wikipedia.org/wiki/Bodybuilding_supplement"
    },
    {
        " in a variety of products. Supplementation of arachidonic acid (1,500 mg/day for 8 weeks) has been shown to increase lean body mass, strength, and anaerobic power in experienced resistance-trained men. This was demonstrated in a placebo-controlled study at the University of Tampa. Thirty men (aged 20.4 ± 2.1 years) took arachidonic acid or a placebo for 8 weeks, and participated in a controlled resistance-training program. After 8 weeks, lean body mass (LBM) had increased significantly, and to a greater extent, in the ARA group (1.62 kg) vs. placebo (0.09 kg) (p<0.05). The change in muscle thickness was also greater in the ARA group (.47 cm) than placebo (.25 cm) (p<0.05). Wingate anaerobic power increased to a greater extent in ARA group as well (723.01 to 800.66 W) vs. placebo (738.75 to 766.51 W). Lastly, the change in total strength was significantly greater in the ARA group (109.92 lbs.) compared to placebo (75.78 lbs.). These results suggest that ARA supplementation can positively augment adaptations in strength and skeletal muscle hypertrophy in resistance-trained men.": null
    },
    {
        "An earlier clinical study examining the effects of 1,000 mg/day of arachidonic acid for 50 days found supplementation to enhance anaerobic capacity and performance in exercising men. During this study, a significant group–time interaction effect was observed in Wingate relative peak power (AA: 1.2 ± 0.5; P: -0.2 ± 0.2 W•kg-1, p=0.015). Statistical trends were also seen in bench press 1RM (AA: 11.0 ± 6.2; P: 8.0 ± 8.0 kg, p=0.20), Wingate average power (AA:37.9 ± 10.0; P: 17.0 ± 24.0 W, p=0.16), and Wingate total work (AA: 1292 ± 1206; P: 510 ± 1249 J, p=0.087). AA supplementation during resistance training promoted significant increases in relative peak power with other performance-related variables approaching significance. These findings support the use of AA as an ergogenic.": null
    },
    {
        "Increased consumption of arachidonic acid will not cause inflammation during normal metabolic conditions unless ": null
    },
    {
        "lipid peroxidation": "https://en.wikipedia.org/wiki/Lipid_peroxidation"
    },
    {
        " products are mixed in. Arachidonic acid is metabolized to both proinflammatory and anti-inflammatory eicosanoids during and after the inflammatory response, respectively. Arachidonic acid is also metabolized to inflammatory and anti-inflammatory eicosanoids during and after physical activity to promote growth. However, chronic inflammation from exogenous toxins and ": null
    },
    {
        "excessive exercise": "https://en.wikipedia.org/wiki/Physical_exercise#Excessive_exercise"
    },
    {
        " should not be confused with acute inflammation from exercise and sufficient rest that is required by the inflammatory response to promote the repair and growth of the micro tears of tissues. However, the evidence is mixed. Some studies giving between 840 mg and 2,000 mg per day to healthy individuals for up to 50 days have shown no increases in inflammation or related metabolic activities. However, others show that increased arachidonic acid levels are actually associated with reduced pro-inflammatory IL-6 and IL-1 levels and increased anti-inflammatory ": null
    },
    {
        "tumor necrosis factor-beta": "https://en.wikipedia.org/wiki/Tumor_necrosis_factor-beta"
    },
    {
        ". This may result in a reduction in systemic inflammation.": null
    },
    {
        "Arachidonic acid does still play a central role in inflammation related to injury and many diseased states. How it is metabolized in the body dictates its inflammatory or anti-inflammatory activity. Individuals suffering from joint pains or active inflammatory disease may find that increased arachidonic acid consumption exacerbates symptoms, presumably because it is being more readily converted to inflammatory compounds. Likewise, high arachidonic acid consumption is not advised for individuals with a history of inflammatory disease, or who are in compromised health. Of note, while ARA supplementation does not appear to have proinflammatory effects in healthy individuals, it may counter the anti-inflammatory effects of ": null
    },
    {
        "omega-3 fatty acid": "https://en.wikipedia.org/wiki/Omega-3_fatty_acid"
    },
    {
        " supplementation.": null
    },
    {
        "Arachidonic acid supplementation in daily doses of 1,000–1,500 mg for 50 days has been well tolerated during several clinical studies, with no significant side effects reported. All common markers of health, including kidney and liver function, serum lipids, immunity, and platelet aggregation appear to be unaffected with this level and duration of use. Furthermore, higher concentrations of ARA in muscle tissue may be correlated with improved insulin sensitivity. Arachidonic acid supplementation of the diets of healthy adults appears to offer no toxicity or significant safety risk.": null
    },
    {
        "While studies looking at arachidonic acid supplementation in sedentary subjects have failed to find changes in resting inflammatory markers in doses up to 1,500 mg daily, strength-trained subjects may respond differently. One study  reported a significant reduction in resting inflammation (via marker IL-6) in young men supplementing 1,000 mg/day of arachidonic acid for 50 days in combination with resistance training. This suggests that rather being pro-inflammatory, supplementation of ARA while undergoing resistance training may actually improve the regulation of systemic inflammation.": null
    },
    {
        "A meta-analysis  looking for associations between heart disease risk and individual fatty acids reported a significantly reduced risk of heart disease with higher levels of EPA and DHA (omega-3 fats), as well as the omega-6 arachidonic acid. A scientific advisory from the American Heart Association has also favorably evaluated the health impact of dietary omega-6 fats, including arachidonic acid. The group does not recommend limiting this essential fatty acid. In fact, the paper recommends individuals follow a diet that consists of at least 5–10% of calories coming from omega-6 fats, including arachidonic acid. It suggests dietary ARA is not a risk factor for heart disease, and may play a role in maintaining optimal metabolism and reduced heart disease risk. Maintaining sufficient intake levels of both omega-3 and omega-6 fatty acids, therefore, is recommended for optimal health.": null
    },
    {
        "Arachidonic acid is not ": null
    },
    {
        "carcinogenic": "https://en.wikipedia.org/wiki/Carcinogen"
    },
    {
        ", and studies show dietary level is not associated (positively or negatively) with risk of cancers. ARA remains integral to the inflammatory and cell growth process, however, which is disturbed in many types of disease including cancer. Therefore, the safety of arachidonic acid supplementation in patients suffering from cancer, inflammatory, or other diseased states is unknown, and supplementation is not recommended.": null
    }
]