[
    {
        "A laser pointer or laser pen is a small handheld device with a power source (usually a battery) and a ": null
    },
    {
        "laser diode": "https://en.wikipedia.org/wiki/Laser_diode"
    },
    {
        " emitting a very narrow ": null
    },
    {
        "coherent": "https://en.wikipedia.org/wiki/Coherence_(physics)"
    },
    {
        " low-powered ": null
    },
    {
        "laser": "https://en.wikipedia.org/wiki/Laser"
    },
    {
        " beam of visible light, intended to be used to highlight something of interest by illuminating it with a small bright spot of colored light. Power is restricted in most jurisdictions not to exceed 5 mW.": null
    },
    {
        "The small width of the beam and low power of typical laser pointers make the beam itself invisible in a reasonably clean atmosphere, only showing a point of light when striking an opaque surface. Some higher-powered laser pointers project a visible beam via scattering from dust particles or water droplets along the beam path. Higher-power and higher-frequency green or blue lasers may produce a beam visible even in clean air because of ": null
    },
    {
        "Rayleigh scattering": "https://en.wikipedia.org/wiki/Rayleigh_scattering"
    },
    {
        " from air molecules, especially when viewed in moderately-to-dimly lit conditions. The intensity of such scattering increases when these beams are viewed from angles near the beam axis. Such pointers, particularly in the green-light output range, are used as astronomical-object pointers for teaching purposes.": null
    },
    {
        "The low-cost availability of ": null
    },
    {
        "infrared": "https://en.wikipedia.org/wiki/Infrared"
    },
    {
        " (IR) diode laser modules of up to 1000 mW (1 watt) output has created a generation of IR-pumped, ": null
    },
    {
        "frequency doubled": "https://en.wikipedia.org/wiki/Second-harmonic_generation"
    },
    {
        ", green, blue, and violet ": null
    },
    {
        "diode-pumped solid-state laser": "https://en.wikipedia.org/wiki/Diode-pumped_solid-state_laser"
    },
    {
        " pointers with visible power up to 300 mW. Because the invisible IR component in the beams of these visible lasers is difficult to filter out, and also because filtering it contributes extra heat which is difficult to dissipate in a small pocket \"laser pointer\" package, it is often left as a beam component in cheaper high-power pointers. This invisible IR component causes a degree of extra potential hazard in these devices when pointed at nearby objects and people.": null
    },
    {
        "Laser pointers make a potent signaling tool, even in daylight, and are able to produce a bright signal for potential search and rescue vehicles using an inexpensive, small and lightweight device of the type that could be routinely carried in an ": null
    },
    {
        "emergency kit": "https://en.wikipedia.org/wiki/Emergency_kit"
    },
    {
        ".": null
    },
    {
        "If aimed at a person's eyes, laser pointers can cause temporary visual disturbances or even severe damage to vision. There are reports in the medical literature documenting permanent injury to the macula and the subsequently permanent loss of vision after laser light from laser pointer being shone to human's eyes. Laser pointer shall therefore never be directed towards human or animals' eyes, as stated on its warning label. There may also be a major annoyance in some circumstances. In rare cases a dot of light from a red laser pointer may be thought to be due to a ": null
    },
    {
        "laser gunsight": "https://en.wikipedia.org/wiki/Laser_sight"
    },
    {
        ". When pointed at aircraft at night, laser pointers may dazzle and distract pilots, and increasingly strict laws have been passed to ban this.": null
    },
    {
        "Early laser pointers were ": null
    },
    {
        "helium–neon (HeNe) gas lasers": "https://en.wikipedia.org/wiki/Helium%E2%80%93neon_laser"
    },
    {
        " and generated laser radiation at 633 ": null
    },
    {
        "nanometers": "https://en.wikipedia.org/wiki/Nanometer"
    },
    {
        " (nm), usually designed to produce a laser beam with an output power under 1 milliwatt (mW). The least expensive laser pointers use a deep-red ": null
    },
    {
        "laser diode": "https://en.wikipedia.org/wiki/Laser_diode"
    },
    {
        " near the 650 nm ": null
    },
    {
        "wavelength": "https://en.wikipedia.org/wiki/Wavelength"
    },
    {
        ". Slightly more expensive ones use a red-orange 635 nm diode, more easily visible because of the ": null
    },
    {
        "greater sensitivity of the human eye": "https://en.wikipedia.org/wiki/Eye#Perception_of_colours"
    },
    {
        " at 635 nm. Other colors are possible too, with the 532 nm green laser being the most common alternative. Yellow-orange laser pointers, at 593.5 nm, later became available. In September 2005 handheld blue laser pointers at 473 nm became available. In early 2010 \"": null
    },
    {
        "Blu-ray": "https://en.wikipedia.org/wiki/Blu-ray"
    },
    {
        "\" (actually violet) laser pointers at 405 nm went on sale.": null
    },
    {
        "The apparent brightness of a spot from a laser beam depends on the optical power of the laser, the reflectivity of the surface, and the chromatic response of the ": null
    },
    {
        "human eye": "https://en.wikipedia.org/wiki/Human_eye"
    },
    {
        ". For the same optical power, green laser light will seem brighter than other colors because the human eye is most sensitive at low light levels in the green region of the spectrum (wavelength 520–570 nm). Sensitivity decreases for longer (redder) and shorter (bluer) wavelengths.": null
    },
    {
        "The output power of a laser pointer is usually stated in milliwatts (mW). In the U.S. lasers are classified by the ": null
    },
    {
        "American National Standards Institute": "https://en.wikipedia.org/wiki/American_National_Standards_Institute"
    },
    {
        " and ": null
    },
    {
        "Food and Drug Administration": "https://en.wikipedia.org/wiki/Food_and_Drug_Administration"
    },
    {
        " (FDA)—see ": null
    },
    {
        "Laser safety#Classification": "https://en.wikipedia.org/wiki/Laser_safety#Classification"
    },
    {
        " for details. Visible laser pointers (400–700 nm) operating at less than 1 mW power are Class 2 or II, and visible laser pointers operating with 1–5 mW power are Class 3A or IIIa. Class 3B or IIIb lasers generate between 5 and 500 mW; Class 4 or IV lasers generate more than 500 mW. The US FDA ": null
    },
    {
        "Code of Federal Regulations": "https://en.wikipedia.org/wiki/Code_of_Federal_Regulations"
    },
    {
        " stipulates that \"demonstration laser products\" such as pointers must comply with applicable requirements for Class I, IIa, II, or IIIa devices.": null
    },
    {
        "These are the simplest pointers, as laser diodes are available in these wavelengths. The pointer is nothing more than a battery-powered ": null
    },
    {
        "laser diode": "https://en.wikipedia.org/wiki/Laser_diode"
    },
    {
        ". The first red laser pointers released in the early 1980s were large, unwieldy devices that sold for hundreds of dollars. Today, they are much smaller and generally cost very little. In the 21st century, ": null
    },
    {
        "diode-pumped solid-state": "https://en.wikipedia.org/wiki/Diode-pumped_solid-state"
    },
    {
        " (DPSS) red laser pointers emitting at 671 nm became available. Although this wavelength can be obtained directly with an inexpensive laser diode, higher beam quality and narrower spectral bandwidth are achieved through DPSS versions.": null
    },
    {
        "Orange laser pointers emitting at 593.5 nm became available in the last few years. Although they are based on the DPSS process, in this case two lasing lines of the ND:YVO4, 1064 nm and 1342 nm, are summed together with a nonlinear crystal. The complexity of this process makes these laser pointers inherently unstable and inefficient, with their outputs ranging from 1 mW to about 10 mW, greatly varying with temperature and usually mode-hopping if they get too hot or too cold. That is because such a complex process may require temperature stabilizers and ": null
    },
    {
        "active cooling": "https://en.wikipedia.org/wiki/Active_cooling"
    },
    {
        ", which can't be mounted into a small-sized host. Also, most smaller 593.5 nm pointers work in pulsed mode, so they can use smaller and less powerful pumping diodes.": null
    },
    {
        "New 589 nm yellow laser pointers have been introduced using a more robust and  of harmonic generation from a DPSS laser system. This \"sodium\" wavelength, although only 4.5 nm away from the older 593.5 nm, appears more gold in colour compared to the more amber appearance of the 593.5 nm wavelength. Astronomical observatories use a specially tuned dye laser at 589.2 nm (yellow) to create a ": null
    },
    {
        "laser guide star": "https://en.wikipedia.org/wiki/Laser_guide_star"
    },
    {
        " for use with astronomical adaptive optics.": null
    },
    {
        "Green laser pointers appeared on the market around 2000 and are the most common type of DPSS lasers (also called diode-pumped solid-state frequency-doubled, DPSSFD). They are more complex than standard red laser pointers, because ": null
    },
    {
        "laser diodes": "https://en.wikipedia.org/wiki/Laser_diode"
    },
    {
        " are not commonly available in this wavelength range. The green light is generated through a multi-step process, usually beginning with a high-power (typically 100–300 mW) ": null
    },
    {
        "infrared": "https://en.wikipedia.org/wiki/Infrared"
    },
    {
        "aluminium gallium arsenide": "https://en.wikipedia.org/wiki/Aluminium_gallium_arsenide"
    },
    {
        " (AlGaAs) laser diode operating at 808 nm. The 808 nm light ": null
    },
    {
        "pumps": "https://en.wikipedia.org/wiki/Laser_pumping"
    },
    {
        " a neodymium doped crystal, usually ": null
    },
    {
        "neodymium-doped yttrium orthovanadate": "https://en.wikipedia.org/wiki/Nd:YVO4"
    },
    {
        " (Nd:YVO) or ": null
    },
    {
        "neodymium-doped yttrium aluminium garnet": "https://en.wikipedia.org/wiki/Yttrium_aluminium_garnet#Nd:YAG"
    },
    {
        " (Nd:YAG), or, less commonly, ": null
    },
    {
        "neodymium-doped yttrium lithium fluoride": "https://en.wikipedia.org/wiki/Neodymium-doped_yttrium_lithium_fluoride"
    },
    {
        " (Nd:YLF)), which lases deeper in the infrared at 1064 nm. This lasing action is due to an electronic transition in the fluorescent ": null
    },
    {
        "neodymium": "https://en.wikipedia.org/wiki/Neodymium"
    },
    {
        " ion, Nd(III), which is present in all of these crystals.": null
    },
    {
        "The Nd:YVO or other Nd-doped crystal is coated on the diode side with a ": null
    },
    {
        "dichroic": "https://en.wikipedia.org/wiki/Dichroism"
    },
    {
        "beam splitter": "https://en.wikipedia.org/wiki/Beam_splitter"
    },
    {
        ", that reflects at 1064 nm and transmits at 808 nm. The crystal is mounted on a ": null
    },
    {
        "copper": "https://en.wikipedia.org/wiki/Copper"
    },
    {
        " block, acting as a ": null
    },
    {
        "heat sink": "https://en.wikipedia.org/wiki/Heat_sink"
    },
    {
        "; its 1064 nm output is fed into a nonlinear crystal (often ": null
    },
    {
        "potassium titanyl phosphate": "https://en.wikipedia.org/wiki/Potassium_titanyl_phosphate"
    },
    {
        " (KTP)), mounted on a ": null
    },
    {
        "heat sink": "https://en.wikipedia.org/wiki/Heat_sink"
    },
    {
        " in the laser ": null
    },
    {
        "cavity resonator": "https://en.wikipedia.org/wiki/Optical_cavity"
    },
    {
        ". The orientation of the crystals must be matched, as they are both ": null
    },
    {
        "anisotropic": "https://en.wikipedia.org/wiki/Anisotropic"
    },
    {
        " and the Nd:YVO outputs ": null
    },
    {
        "polarized light": "https://en.wikipedia.org/wiki/Polarized_light"
    },
    {
        ". This unit acts as a frequency doubler and halves the wavelength to the desired 532 nm through ": null
    },
    {
        "second harmonic generation": "https://en.wikipedia.org/wiki/Second_harmonic_generation"
    },
    {
        ". The resonant cavity is terminated by another dichroic beam splitter, that reflects at 1064 nm and transmits at 532 nm and acts as an ": null
    },
    {
        "output coupler": "https://en.wikipedia.org/wiki/Output_coupler"
    },
    {
        ". Usually, an infrared filter behind the output coupler removes IR radiation from the output beam, though this is sometimes omitted, and the assembly ends in a ": null
    },
    {
        "collimator": "https://en.wikipedia.org/wiki/Collimator"
    },
    {
        " lens.": null
    },
    {
        "Nd:YVO is replacing other Nd-doped materials such as Nd:YAG and Nd:YLF in such systems because of lower dependency on the exact parameters of the pump diode (therefore allowing for higher tolerances), wider absorption band, lower ": null
    },
    {
        "lasing threshold": "https://en.wikipedia.org/wiki/Lasing_threshold"
    },
    {
        ", higher ": null
    },
    {
        "slope efficiency": "https://en.wikipedia.org/wiki/Slope_efficiency"
    },
    {
        ", ": null
    },
    {
        "linear polarization": "https://en.wikipedia.org/wiki/Linear_polarization"
    },
    {
        " of output light, and single-mode output. For frequency doubling of higher-power lasers, ": null
    },
    {
        "lithium triborate": "https://en.wikipedia.org/wiki/Lithium_triborate"
    },
    {
        " (LBO) is used instead of ": null
    },
    {
        "KTP": "https://en.wikipedia.org/wiki/Potassium_titanyl_phosphate"
    },
    {
        ". Newer lasers use a composite Nd:YVO/KTP crystal instead of two discrete ones.": null
    },
    {
        "Some green lasers operate in pulse or quasi-continuous wave (QCW) mode to reduce cooling problems and prolong battery life.": null
    },
    {
        "An announcement in 2009 of a direct green laser (which does not require doubling) promises much higher efficiencies and could foster the development of new color video projectors.": null
    },
    {
        "In 2012, ": null
    },
    {
        "Nichia": "https://en.wikipedia.org/wiki/Nichia"
    },
    {
        " and ": null
    },
    {
        "OSRAM": "https://en.wikipedia.org/wiki/OSRAM"
    },
    {
        " developed and manufactured merchant high-power green laser diodes (515/520 nm), which can emit green laser directly.": null
    },
    {
        "Because even a low-powered green laser is visible at night through ": null
    },
    {
        "Rayleigh scattering": "https://en.wikipedia.org/wiki/Rayleigh_scattering"
    },
    {
        " from air molecules, this type of pointer is used by astronomers to easily point out stars and constellations. Green laser pointers can come in a variety of different output powers. The 5 mW green laser pointers (classes II and IIIa) are the safest to use, and anything more powerful is usually not necessary for pointing purposes, since the beam is still visible in dark lighting conditions.": null
    },
    {
        "The ": null
    },
    {
        "United States Coast Guard": "https://en.wikipedia.org/wiki/United_States_Coast_Guard"
    },
    {
        " requires their aircrews to return to base if a green laser is pointed at them, and have their eyes examined for eye damage.  People have been given up to five years in jail for aiming a green laser at an aircraft.": null
    },
    {
        "Blue laser pointers in specific wavelengths such as 473 nm usually have the same basic construction as DPSS green lasers. In 2006 many factories began production of blue laser modules for mass-storage devices, and these were used in laser pointers too. These were DPSS-type frequency-doubled devices. They most commonly emit a beam at 473 nm, which is produced by frequency doubling of 946 nm laser radiation from a diode-pumped ": null
    },
    {
        "Nd:YAG": "https://en.wikipedia.org/wiki/Nd:YAG"
    },
    {
        " or ": null
    },
    {
        "Nd:YVO4": "https://en.wikipedia.org/wiki/Nd:YVO4"
    },
    {
        " crystal (Nd-doped crystals usually produce a principal wavelength of 1064 nm, but with the proper reflective coating mirrors can be also made to lase at other \"higher harmonic\" non-principal neodymium wavelengths). For high output power, ": null
    },
    {
        "BBO": "https://en.wikipedia.org/wiki/Beta_barium_borate"
    },
    {
        " crystals are used as frequency doublers; for lower powers, ": null
    },
    {
        "KTP": "https://en.wikipedia.org/wiki/Potassium_titanyl_phosphate"
    },
    {
        " is used. The Japanese company ": null
    },
    {
        "Nichia": "https://en.wikipedia.org/wiki/Nichia"
    },
    {
        " controlled 80% of the blue-laser-diode market in 2006.": null
    },
    {
        "Some vendors are now selling collimated diode blue laser pointers with measured powers exceeding 1,500 mW. However, since the claimed power of \"laser pointer\" products also includes the IR power (in DPSS technology only) still present in the beam (for reasons discussed below), comparisons on the basis of strictly visual-blue component from DPSS-type lasers remain problematic, and the information is often not available. Because of the higher neodymium harmonic used, and the lower efficiency of frequency-doubling conversion, the fraction of IR power converted to 473 nm blue laser light in optimally configured DPSS modules is typically 10–13%, about half that typical for green lasers (20–30%).": null
    },
    {
        "Blue lasers can also be fabricated directly with ": null
    },
    {
        "InGaN": "https://en.wikipedia.org/wiki/InGaN"
    },
    {
        " semiconductors, which produce blue light without frequency doubling. 450 nm (447 nm plus/minus 5 nm) blue laser diodes are currently available on the open market. Some blue diodes are capable of very high power; such as Nichia's NDB7K75 diode, which can continuously output over 5 watts of energy if overdriven. The devices are brighter for the same power than 405 nm violet laser diodes, since the longer wavelength is closer to the peak sensitivity of the human eye. Mass production of laser diodes for commercial devices like ": null
    },
    {
        "laser projectors": "https://en.wikipedia.org/wiki/Laser_video_projector"
    },
    {
        " have driven down prices. Recent popularity of the high-power version of these 447 nm pointers, which also have improved optics for better collimation and lower divergence, rivals the hazards associated with the use of these portable devices by persons of questionable intention and cost has diminished to be competitive with DPSS green lasers wavelengths.": null
    },
    {
        "Lasers emitting a violet light beam at 405 nm may be constructed with GaN (": null
    },
    {
        "gallium nitride": "https://en.wikipedia.org/wiki/Gallium_nitride"
    },
    {
        ") semiconductors. This is close to ultraviolet, bordering on the very extreme of human vision, and can cause bright blue ": null
    },
    {
        "fluorescence": "https://en.wikipedia.org/wiki/Fluorescence"
    },
    {
        ", and thus a blue rather than violet spot, on many white surfaces, including white clothing, white paper, and projection screens, due to the widespread use of ": null
    },
    {
        "optical brighteners": "https://en.wikipedia.org/wiki/Optical_brightener"
    },
    {
        " in the manufacture of products intended to appear brilliantly white. On ordinary non-fluorescent materials, and also on fog or dust, the color appears as a shade of deep violet that cannot be reproduced on monitors and print. A GaN laser emits 405 nm directly without a frequency doubler, eliminating the possibility of accidental . These laser diodes are mass-produced for the reading and writing of data in ": null
    },
    {
        "Blu-ray": "https://en.wikipedia.org/wiki/Blu-ray"
    },
    {
        " drives (although the light emitted by the diodes is not blue, but distinctly violet). In mid-to-late 2011, 405 nm blue-violet laser diode modules with an optical power of 250 mW, based on GaN violet laser diodes made for Blu-ray disc readers, had reached the market from Chinese sources for prices of about US$60 including delivery.": null
    },
    {
        "At the same time, a few higher-powered (120 mW) 404–405 nm \"violet\" laser pointers have become available that are not based on GaN, but use DPSS frequency-doubler technology from 1-watt 808 nm ": null
    },
    {
        "GaAlAs": "https://en.wikipedia.org/wiki/GaAlAs"
    },
    {
        " infrared diode lasers. As with infrared-driven green laser pointers above, such devices are able to pop balloons and light matches, but this is as a result of an unfiltered high-power infrared component in the beam.": null
    },
    {
        "Laser pointers are often used in educational and business ": null
    },
    {
        "presentations": "https://en.wikipedia.org/wiki/Presentation"
    },
    {
        " and visual demonstrations as an eye-catching pointing device. Laser pointers enhance verbal guidance given to students during surgery. The suggested mechanism of explanation is that the technology enables more precise guidance of location and identification of anatomic structures.": null
    },
    {
        "Red laser pointers can be used in almost any indoor or low-light situation where pointing out details by hand may be inconvenient, such as in ": null
    },
    {
        "construction": "https://en.wikipedia.org/wiki/Construction"
    },
    {
        " work or interior decorating. Green laser pointers can be used for similar purposes as well as outdoors in daylight or for longer distances.": null
    },
    {
        "Laser pointers are used in a wide range of applications. Green laser pointers can also be used for ": null
    },
    {
        "amateur astronomy": "https://en.wikipedia.org/wiki/Amateur_astronomy"
    },
    {
        ". Green laser is visible at night due to ": null
    },
    {
        "Rayleigh scattering": "https://en.wikipedia.org/wiki/Rayleigh_scattering"
    },
    {
        " and airborne dust, allowing someone to point out individual stars to others nearby. Also, these green laser pointers are commonly used by astronomers worldwide at ": null
    },
    {
        "star parties": "https://en.wikipedia.org/wiki/Star_party"
    },
    {
        " or for conducting lectures in astronomy. Astronomy laser pointers are also commonly mounted on telescopes in order to align the telescope to a specific star or location. Laser alignment is much easier than aligning through using the eyepiece.": null
    },
    {
        "Laser pointers are used in industry. For instance, construction companies may use high quality laser pointers to enhance the accuracy of showing specific distances, while working on large-scale projects. They proved to be useful in this type of business because of their accuracy, which made them significant time-savers. What is essentially a laser pointer may be built into an ": null
    },
    {
        "infrared thermometer": "https://en.wikipedia.org/wiki/Infrared_thermometer"
    },
    {
        " to identify where it is pointing, or be part of a ": null
    },
    {
        "laser level": "https://en.wikipedia.org/wiki/Laser_level"
    },
    {
        " or other apparatus.": null
    },
    {
        "They may also be helpful in ": null
    },
    {
        "scientific research": "https://en.wikipedia.org/wiki/Scientific_research"
    },
    {
        " in fields such as ": null
    },
    {
        "photonics": "https://en.wikipedia.org/wiki/Photonics"
    },
    {
        ", ": null
    },
    {
        "chemistry": "https://en.wikipedia.org/wiki/Chemistry"
    },
    {
        ", ": null
    },
    {
        "physics": "https://en.wikipedia.org/wiki/Physics"
    },
    {
        ", and ": null
    },
    {
        "medicine": "https://en.wikipedia.org/wiki/Medicine"
    },
    {
        ".": null
    },
    {
        "Laser pointers are used in ": null
    },
    {
        "robotics": "https://en.wikipedia.org/wiki/Robotics"
    },
    {
        ", for example, for ": null
    },
    {
        "laser guidance": "https://en.wikipedia.org/wiki/Laser_guidance"
    },
    {
        " to direct the robot to a goal position by means of a laser beam, i.e. showing goal positions to the robot optically instead of communicating them numerically. This intuitive interface simplifies directing the robot while visual ": null
    },
    {
        "feedback": "https://en.wikipedia.org/wiki/Feedback"
    },
    {
        " improves the positioning accuracy and allows for implicit localization.": null
    },
    {
        "Entertainment": "https://en.wikipedia.org/wiki/Entertainment"
    },
    {
        " is one of the other applications that has been found for lasers. The most common use of lasers in entertainment can be seen in special effects used in laser shows. Clubs, parties and outdoor concerts all use high-power lasers, with safety precautions, as a spectacle. Laser shows are often extravagant, using ": null
    },
    {
        "lenses": "https://en.wikipedia.org/wiki/Lens_(optics)"
    },
    {
        ", ": null
    },
    {
        "mirrors": "https://en.wikipedia.org/wiki/Mirror"
    },
    {
        " and ": null
    },
    {
        "smoke": "https://en.wikipedia.org/wiki/Smoke"
    },
    {
        ".": null
    },
    {
        "Lasers have also become a popular plaything for pets such as cats, ferrets and dogs, whose natural predatory instincts are triggered by the moving laser and will chase it and/or try to catch it as much as possible, but obviously never succeed. As a result, laser pointers have become a popular form of entertainment for many pet owners.": null
    },
    {
        "However, laser pointers have few applications beyond actual pointing in the wider entertainment industry, and many venues ban entry to those in possession of pointers as a potential hazard. Very occasionally laser gloves, which are sometimes mistaken for pointers, are seen being worn by professional dancers on stage at shows. Unlike pointers, these usually produce low-power highly divergent beams to ensure eye safety. Laser pointers have been used as props by magicians during magic shows.": null
    },
    {
        "As an example of the potential dangers of laser pointers brought in by audience members, at the ": null
    },
    {
        "Tomorrow Land Festival": "https://en.wikipedia.org/wiki/Tomorrow_Land_Festival"
    },
    {
        " in Belgium in 2009, laser pointers brought in by members of the audience of 200 mW or greater were found to be the cause of eye damage suffered by several other members of the audience according to reports about the incident filed on the ILDA (": null
    },
    {
        "International Laser Display Association": "https://en.wikipedia.org/wiki/International_Laser_Display_Association"
    },
    {
        "'s) Web site. The report says that the incident was investigated by several independent authorities, including the Belgium police, and that those authorities concluded that pointers brought in by the audience were the cause of the injuries.": null
    },
    {
        "Laser pointers can be used in ": null
    },
    {
        "hiking": "https://en.wikipedia.org/wiki/Hiking"
    },
    {
        " or ": null
    },
    {
        "outdoor activities": "https://en.wikipedia.org/wiki/Outdoor_activities"
    },
    {
        ". Higher-powered laser pointers are bright enough to scare away large ": null
    },
    {
        "wild animals": "https://en.wikipedia.org/wiki/Wildlife"
    },
    {
        " which makes them useful for hiking and camping. In these circumstances a laser pointer can also serve as a handy survival tool, as it can be used as a rescue signal in emergencies which is visible to aircraft and other parties, during both day and night conditions, at extreme distances. For example, during the night in August 2010 two men and a boy were rescued from marshland after their red laser pen was spotted by rescue teams.": null
    },
    {
        "Accurately aligned laser pointers are used as ": null
    },
    {
        "laser gunsights": "https://en.wikipedia.org/wiki/Laser_sight#Laser_sight"
    },
    {
        " to aim a ": null
    },
    {
        "firearm": "https://en.wikipedia.org/wiki/Firearm"
    },
    {
        ".": null
    },
    {
        "Some militaries use lasers to mark targets at night for aircraft. This is done to ensure that \"friendly\" and \"enemy\" targets are not mistaken. A friendly target may wear an IR emitting device that is only visible to those utilizing night vision (such as pilots.) To pinpoint the exact location of an enemy combatant, they would simply illuminate the target with a laser beam detectable by the attacking aircraft. This can be one of the most accurate ways of marking targets.": null
    },
    {
        "Laser pointers can cause eye injuries directly, and dangerous situations by distraction. As of 2011, in spite of the very large number of pointers, and many incidents of malicious or careless use, no very serious and permanent eye injuries have been reported from low-power pointers, nor have any aviation or other accidents actually been reported to be caused by them, although the risk is clearly real.": null
    },
    {
        "National Institute of Standards and Technology tests conducted on laser pointers labeled as Class IIIa or 3R in 2013 showed that about half of them emitted power at twice the Class limit, making their correct designation Class IIIb – more hazardous than Class IIIa.  The highest measured power output was 66.5 milliwatts; more than 10 times the limit.  Green laser light is generated from an infrared laser beam, which should be confinedwithin the laser housing; however, more than 75% of the devices tested were found to emit infrared light in excess of the limit.": null
    },
    {
        "Laser pointers, with their very long range, are often maliciously shone at people to distract or annoy them, or for fun. This is considered particularly hazardous in the case of aircraft pilots, who may be dazzled or distracted at critical times. According to an MSNBC report there were over 2,836 incidents logged in the US by the FAA in 2010. Illumination by handheld green lasers is particularly serious, as the wavelength (532 nm) is near peak sensitivity of the dark-adapted eye and may appear to be 35 times brighter than a red laser of identical power output.": null
    },
    {
        "Irresponsible use of laser pointers is often frowned upon by members of the laser projector community who fear that their misuse may result in legislation affecting lasers designed to be placed within projectors and used within the entertainment industry. Others involved in activities where dazzling or distraction are dangerous are also a concern.": null
    },
    {
        "Another distressing and potentially dangerous misuse of laser pointers is to use them when the dot may reasonably be mistaken for that of a laser gun sight. Armed ": null
    },
    {
        "police": "https://en.wikipedia.org/wiki/Police"
    },
    {
        " have drawn their weapons in such circumstances.": null
    },
    {
        "The output of laser pointers available to the general public is limited (and varies by country) in order to prevent accidental damage to the ": null
    },
    {
        "retina": "https://en.wikipedia.org/wiki/Retina"
    },
    {
        " of ": null
    },
    {
        "human eyes": "https://en.wikipedia.org/wiki/Human_eye"
    },
    {
        ". The U.K. ": null
    },
    {
        "Health Protection Agency": "https://en.wikipedia.org/wiki/Health_Protection_Agency"
    },
    {
        " recommended that \"laser pointers generally available to the public should be restricted to less than 1 milliwatt as no injuries [like the one reported below to have caused retinal damage] have been reported at this power\". In the U.S., regulatory authorities allow lasers up to 5 mW.": null
    },
    {
        "Studies have found that even low-power laser beams of not more than 5 mW can cause permanent retinal damage if gazed at for several seconds; however, the eye's blink reflex makes this highly unlikely. Such laser pointers have reportedly caused ": null
    },
    {
        "afterimages": "https://en.wikipedia.org/wiki/Afterimage"
    },
    {
        ", ": null
    },
    {
        "flash blindness": "https://en.wikipedia.org/wiki/Flash_blindness"
    },
    {
        " and ": null
    },
    {
        "glare": "https://en.wikipedia.org/wiki/Glare_(vision)"
    },
    {
        ", but not permanent damage, and are generally ": null
    },
    {
        "safe": "https://en.wikipedia.org/wiki/Laser_safety"
    },
    {
        " when used as intended.": null
    },
    {
        "A high-powered green laser pointer bought over the ": null
    },
    {
        "Internet": "https://en.wikipedia.org/wiki/Internet"
    },
    {
        " was reported in 2010 to have caused a decrease of ": null
    },
    {
        "visual acuity": "https://en.wikipedia.org/wiki/Visual_acuity"
    },
    {
        " from 6/6 to 6/12 (20/20 to 20/40); after two months acuity recovered to 6/6, but some retinal damage remained. The US FDA issued a warning after two ": null
    },
    {
        "anecdotal reports": "https://en.wikipedia.org/wiki/Anecdotal_report"
    },
    {
        " it received of eye injury from laser pointers.": null
    },
    {
        "Laser pointers available for purchase online can be capable of significantly higher power output than the pointers typically available in stores. Dubbed \"Burning Lasers\", these are designed to burn through light plastics and paper, and can have very similar external appearances to their low-power counterparts.": null
    },
    {
        "Studies in the early twenty-first century found that the risk to the human eye from accidental exposure to light from commercially available class IIIa laser pointers having powers up to 5 mW seemed rather small; however, prolonged viewing, such as deliberate staring into the beam for 10 or more seconds, can cause damage.": null
    },
    {
        "The UK Health Protection Agency warns against the higher-power typically green laser pointers available over the Internet, with power output of up to a few hundred milliwatts, as \"extremely dangerous and not suitable for sale to the public.\"": null
    },
    {
        "Lasers classified as pointers are intended to have outputs less than 5 mW total power (": null
    },
    {
        "Class 3R": "https://en.wikipedia.org/wiki/Laser_safety"
    },
    {
        "). At such power levels, an IR filter for a DPSS laser may not be required as the infrared (IR) output is relatively low and the brightness of the visible wavelength of the laser will cause the eye to react (blink reflex). However, higher-powered (> 5 mW) ": null
    },
    {
        "DPSS": "https://en.wikipedia.org/wiki/DPSS"
    },
    {
        "-type laser pointers have recently become available, usually through sources that do not follow laser safety ": null
    },
    {
        "regulations": "https://en.wikipedia.org/wiki/Laser_safety#Regulations"
    },
    {
        " for laser packaging and labeling. These higher-powered lasers are often packaged in the same pointer-style housings as regular laser pointers, and usually lack the IR filters found in professional high-powered DPSS lasers, because of costs and additional efforts needed to accommodate them.": null
    },
    {
        "Though the IR from a DPSS laser is less collimated, the typical ": null
    },
    {
        "neodymium-doped crystals": "https://en.wikipedia.org/wiki/Neodymium_laser"
    },
    {
        " in such lasers do produce a true IR laser beam. The eye will usually react to the higher-powered visible light; however, in higher power DPSS lasers the IR laser output can be significant. What poses a special hazard for this unfiltered IR output is its presence in conjunction with laser safety goggles designed to only block the visible wavelengths of the laser. Red goggles, for example, will block most green light from entering the eyes, but will pass IR light. The reduced light behind the goggles may also cause the pupils to dilate, increasing the hazard to the invisible IR light. Dual-frequency so-called YAG laser eyewear is significantly more expensive than single frequency laser eyewear, and is often not supplied with unfiltered DPSS pointer style lasers, which output 1064 nm IR laser light as well. These potentially hazardous lasers produce little or no visible beam when shone through the eyewear supplied with them, yet their IR-laser output can still be easily seen when viewed with an IR-sensitive video camera.": null
    },
    {
        "In addition to the safety hazards of unfiltered IR from DPSS lasers, the IR component may be inclusive of total output figures in some laser pointers.": null
    },
    {
        "Though green (532 nm) lasers are most common, IR filtering problems may also exist in other DPSS lasers, such as DPSS red (671 nm), yellow (589 nm) and blue (473 nm) lasers. These DPSS laser wavelengths are usually more exotic, more expensive, and generally manufactured with higher quality components, including filters, unless they are put into laser pointer style pocket-pen packages. Most red (635 nm, 660 nm), violet (405 nm) and darker blue (445 nm) lasers are generally built using dedicated laser diodes at the output frequency, not as DPSS lasers. These diode-based visible lasers do not produce IR light.": null
    },
    {
        "Since laser pointers became readily available, they have been misused, leading to the development of laws and regulations specifically addressing use of such lasers. Their very long range makes it difficult to find the source of a laser spot. In some circumstances they make people fear they are being targeted by weapons, as they are indistinguishable from dot type laser reticles. The very bright, small spot makes it possible to dazzle and distract drivers and aircraft pilots, and they can be dangerous to sight if aimed at the eyes.": null
    },
    {
        "In 1998, an audience member shone a laser at ": null
    },
    {
        "Kiss": "https://en.wikipedia.org/wiki/Kiss_(band)"
    },
    {
        " drummer ": null
    },
    {
        "Peter Criss": "https://en.wikipedia.org/wiki/Peter_Criss"
    },
    {
        "'s eyes while the band was performing \"": null
    },
    {
        "Beth": "https://en.wikipedia.org/wiki/Beth_(song)"
    },
    {
        "\". After performing the song, Criss nearly stormed off the stage, and lead singer ": null
    },
    {
        "Paul Stanley": "https://en.wikipedia.org/wiki/Paul_Stanley"
    },
    {
        " challenged whoever shone the laser to fight him on stage: ": null
    },
    {
        "In every crowd, there's one or two people who don't belong here, Now I know you want to bring it to school tomorrow when you go to sixth grade, but leave it at home when you go to the show.": null
    },
    {
        "In January 2005 a New Jersey man named David Banach was arrested for pointing a green laser pointer at a small jet flying overhead.": null
    },
    {
        "In ": null
    },
    {
        "football": "https://en.wikipedia.org/wiki/Association_football"
    },
    {
        " a laser pointer is a prohibited item at stadiums during ": null
    },
    {
        "FIFA": "https://en.wikipedia.org/wiki/FIFA"
    },
    {
        " tournaments and matches, according to FIFA Stadium Safety and Security Regulations, it is also prohibited in matches and competitions organised by ": null
    },
    {
        "UEFA": "https://en.wikipedia.org/wiki/UEFA"
    },
    {
        ". In 2008 laser pointers were aimed at players' eyes in a number of sport matches worldwide. ": null
    },
    {
        "Olympique Lyonnais": "https://en.wikipedia.org/wiki/Olympique_Lyonnais"
    },
    {
        " was fined by UEFA because of a laser pointer beam aimed by a Lyon fan at ": null
    },
    {
        "Cristiano Ronaldo": "https://en.wikipedia.org/wiki/Cristiano_Ronaldo"
    },
    {
        ". In a ": null
    },
    {
        "World Cup": "https://en.wikipedia.org/wiki/FIFA_World_Cup"
    },
    {
        " final qualifier match held in ": null
    },
    {
        "Riyadh": "https://en.wikipedia.org/wiki/Riyadh"
    },
    {
        ", ": null
    },
    {
        "Saudi Arabia": "https://en.wikipedia.org/wiki/Saudi_Arabia"
    },
    {
        " between the home team and the ": null
    },
    {
        "South Korean": "https://en.wikipedia.org/wiki/South_Korea"
    },
    {
        " team, South Korean goalkeeper ": null
    },
    {
        "Lee Woon-Jae": "https://en.wikipedia.org/wiki/Lee_Woon-Jae"
    },
    {
        " was hit in the eye with a green laser beam. At the ": null
    },
    {
        "2014 World Cup": "https://en.wikipedia.org/wiki/2014_World_Cup"
    },
    {
        " during the final ": null
    },
    {
        "group stage match": "https://en.wikipedia.org/wiki/2014_FIFA_World_Cup_Group_H#Algeria_vs_Russia"
    },
    {
        " between ": null
    },
    {
        "Algeria": "https://en.wikipedia.org/wiki/Algeria_national_football_team"
    },
    {
        " and ": null
    },
    {
        "Russia": "https://en.wikipedia.org/wiki/Russia_national_football_team"
    },
    {
        " a green laser beam was directed on the face of Russian goalkeeper ": null
    },
    {
        "Igor Akinfeev": "https://en.wikipedia.org/wiki/Igor_Akinfeev"
    },
    {
        ". After the match the ": null
    },
    {
        "Algerian Football Federation": "https://en.wikipedia.org/wiki/Algerian_Football_Federation"
    },
    {
        " was fined ": null
    },
    {
        "CHF": "https://en.wikipedia.org/wiki/Swiss_franc"
    },
    {
        "50,000 (approx. ": null
    },
    {
        "£": "https://en.wikipedia.org/wiki/Pound_sterling"
    },
    {
        "33,000/": null
    },
    {
        "€": "https://en.wikipedia.org/wiki/Euro"
    },
    {
        "41,100/": null
    },
    {
        "US$": "https://en.wikipedia.org/wiki/United_States_dollar"
    },
    {
        "56,200) by FIFA for the use of lasers and other violations of the rules by Algerian fans at the stadium.": null
    },
    {
        "In 2009 police in the ": null
    },
    {
        "United Kingdom": "https://en.wikipedia.org/wiki/United_Kingdom"
    },
    {
        " began tracking the sources of lasers being shone at helicopters at night, logging the source using ": null
    },
    {
        "GPS": "https://en.wikipedia.org/wiki/GPS"
    },
    {
        ", using ": null
    },
    {
        "thermal imaging": "https://en.wikipedia.org/wiki/Thermal_imaging"
    },
    {
        " cameras to see the suspect, and even the warm pointer if discarded, and calling in police dog teams. As of 2010 the penalty could be five years' imprisonment.": null
    },
    {
        "Despite legislation limiting the output of laser pointers in some countries, higher-power devices are currently produced in other regions (especially ": null
    },
    {
        "China": "https://en.wikipedia.org/wiki/China"
    },
    {
        " and ": null
    },
    {
        "Hong Kong": "https://en.wikipedia.org/wiki/Hong_Kong"
    },
    {
        "), and are frequently imported by customers who purchase them directly via Internet mail order. The legality of such transactions is not always clear; typically, the lasers are sold as research or ": null
    },
    {
        "OEM": "https://en.wikipedia.org/wiki/Original_equipment_manufacturer"
    },
    {
        " devices (which are not subject to the same power restrictions), with a disclaimer that they are not to be used as pointers. DIY videos are also often posted on Internet video sharing sites like ": null
    },
    {
        "YouTube": "https://en.wikipedia.org/wiki/YouTube"
    },
    {
        " which explain how to make a high-power laser pointer using the diode from an optical disc burner. As the popularity of these devices increased, manufacturers began manufacturing similar high-powered pointers. Warnings have been published on the dangers of such high-powered lasers. Despite the disclaimers, such lasers are frequently sold in packaging resembling that for laser pointers. Lasers of this type may not include ": null
    },
    {
        "safety features": "https://en.wikipedia.org/wiki/Laser_safety"
    },
    {
        " sometimes found on laser modules sold for research purposes.": null
    },
    {
        "There have been many incidents regarding, in particular, aircraft, and the authorities in many countries take them extremely serious. Many people have been convicted and sentenced, sometimes to several years' imprisonment.": null
    },
    {
        "In April 2008, citing a series of coordinated attacks on passenger jets in ": null
    },
    {
        "Sydney": "https://en.wikipedia.org/wiki/Sydney"
    },
    {
        ", the Australian government announced that it would restrict the sale and importation of certain laser items. The government had yet to determine which classes of laser pointers to ban. After some debate, the government voted to ban importation of lasers that emit a beam stronger than 1 mW, effective from 1 July 2008. Those whose professions require the use of a laser can apply for an exemption. In ": null
    },
    {
        "Victoria": "https://en.wikipedia.org/wiki/Victoria_(Australia)"
    },
    {
        " and the Australian Capital Territory a laser pointer with an accessible emission limit greater than 1 mW is classified as a prohibited weapon and any sale of such items must be recorded. In Western Australia, regulatory changes have classified laser pointers as controlled weapons and demonstration of a lawful reason for possession is required. The WA state government has also banned as of 2000 the manufacture, sale and possession of laser pointers higher than class 2. In New South Wales and the Australian Capital Territory the product safety standard for laser pointers prescribes that they must be a Class 1 or a Class 2 laser product. In February 2009 South African cricketer ": null
    },
    {
        "Wayne Parnell": "https://en.wikipedia.org/wiki/Wayne_Parnell"
    },
    {
        " had a laser pointer directed at his eyes when attempting to take a catch, which he dropped. He denied that it was a reason for dropping the ball, but despite this the MCG decided to keep an eye out for the laser pointers. The laser pointer ban only applies to hand-held battery-powered laser devices and not laser modules.": null
    },
    {
        "In November 2015  a 14-year-old Tasmanian boy damaged both his eyes after shining a laser pen \"... in his eyes for a very brief period of time\". He burned his ": null
    },
    {
        "retinas": "https://en.wikipedia.org/wiki/Retinas"
    },
    {
        " near the ": null
    },
    {
        "macula": "https://en.wikipedia.org/wiki/Macula"
    },
    {
        ", the area where most of a persons central vision is located. As a result, the boy has almost immediately lost 75% of his vision, with little hope of  recovery.": null
    },
    {
        "New regulations controlling the importation and sale of laser pointers (portable, battery-powered) have been established in Canada in 2011 and are governed by Health Canada using the Consumer Protection Act for the prohibition of sale of Class 3B (IEC) or higher power lasers to \"consumers\" as defined in the ": null
    },
    {
        "Consumer Protection Act": "https://web.archive.org/web/20120623195628/http://laws-lois.justice.gc.ca/eng/acts/C-1.68/index.html"
    },
    {
        " . Canadian federal regulation follows ": null
    },
    {
        "FDA (US Food & Drug Administration) CDRH": "http://www.fda.gov/Radiation-EmittingProducts/default.htm"
    },
    {
        ", and IEC (": null
    },
    {
        "International Electrotechnical Commission": "http://www.iec.ch/"
    },
    {
        ") hazard classification methods where manufacturers comply with the Radiation Emitting Devices Act. As of July 2011 three people had been charged under the federal ": null
    },
    {
        "Aeronautics Act": "https://en.wikipedia.org/wiki/Aeronautics_Act"
    },
    {
        ", which carries a maximum penalty of $100,000 and five years in prison, for attempting to dazzle a pilot with a laser. Other charges that could be laid include ": null
    },
    {
        "mischief": "https://en.wikipedia.org/wiki/Mischief"
    },
    {
        " and ": null
    },
    {
        "assault": "https://en.wikipedia.org/wiki/Assault"
    },
    {
        ".": null
    },
    {
        "During the multiple protests and riots against government in Hong Kong between June and August 2019, laser pointers were used by some frontline protestors as tools to prevent the Hong Kong Police from carrying out their duties. The protestors kept shining laser beams onto eyes of police during protests and riots. On 6th August 2019,  the president of the ": null
    },
    {
        "Baptist University": "https://en.wikipedia.org/wiki/Baptist_University"
    },
    {
        "'s Student Union, Keith Fong, was arrested on suspicion of possessing an offensive weapon, after police said he purchased 10 high power laser pointers in Sham Shui Po and his attempt to run away when being enquired by police for his purpose of possessing the laser pointers. On 7th Aug 2019, Hong Kong Police declared that any object that could potentially cause physical injury to human could be regarded as \"weapon\", depending on the intention of the owner/user. ": null
    },
    {
        "Before 1998 Class 3A lasers were allowed. In 1998 it became illegal to trade Class 2 laser pointers that are \"gadgets\" (e.g. ball pens, key chains, business gifts, devices that will end up in children's possession, parts of toys, etc.). It is still allowed to trade Class 2 (< 1 mW) laser pointers proper, but they have to meet requirements regarding warnings and instructions for safe use in the manual. Trading of Class 3 and higher laser pointers is not allowed.": null
    },
    {
        "The use of pointers with output power > 1 mW is regulated in public areas and school yards. From 1 January 2014 it is necessary to have a special permit in order to own a laser pointer with a classification of 3R, 3B or 4, i.e. over 1 mW.": null
    },
    {
        "UK and most of Europe are now harmonized on Class 2 (<1 mW) for General presentation use laser pointers or laser pens. Anything above 1 mW is illegal for sale in the UK (import is unrestricted). Health and Safety regulation insists on use of Class 2 anywhere the public can come in contact with indoor laser light, and the DTI have urged Trading Standards authorities to use their existing powers under the General Product Safety Regulations 2005 to remove lasers above class 2 from the general market.": null
    },
    {
        "Since 2010, it is an offence in the UK to shine a light at an aircraft in flight so as to dazzle the pilot, ": null
    },
    {
        "whether intentionally or not": "https://en.wikipedia.org/wiki/Strict_liability"
    },
    {
        ", with a maximum penalty of a ": null
    },
    {
        "level 4 fine": "https://en.wikipedia.org/wiki/Standard_scale#Scale"
    },
    {
        " (currently £2500). It is also an offence to ": null
    },
    {
        "negligently or recklessly": "https://en.wikipedia.org/wiki/Mens_rea#England_and_Wales"
    },
    {
        " endanger an aircraft, with a maximum penalty of five years imprisonment and/or an unlimited fine.": null
    },
    {
        "To assist with enforcement, police helicopters use ": null
    },
    {
        "GPS": "https://en.wikipedia.org/wiki/GPS"
    },
    {
        " and ": null
    },
    {
        "thermal imaging camera": "https://en.wikipedia.org/wiki/Thermal_imaging_camera"
    },
    {
        ", together with dog teams on the ground, to help locate the offender; the discarded warm laser pointer is often visible on the thermal camera, and its ": null
    },
    {
        "wavelength": "https://en.wikipedia.org/wiki/Wavelength"
    },
    {
        " can be matched to that recorded by an event recorder in the helicopter.": null
    },
    {
        "In 2014, a ": null
    },
    {
        "Flintshire": "https://en.wikipedia.org/wiki/Flintshire"
    },
    {
        " 22-year-old was convicted of ": null
    },
    {
        "recklessly endangering": "https://en.wikipedia.org/wiki/Reckless_endangerment"
    },
    {
        " the lives of a police search helicopter crew through the use of such a device, and awarded a five-month ": null
    },
    {
        "suspended sentence": "https://en.wikipedia.org/wiki/Suspended_sentence"
    },
    {
        ".": null
    },
    {
        "Laser pointers are Class II or Class IIIa devices, with output beam power less than 5 milliwatts (<5 mW). According to ": null
    },
    {
        "U.S. Food and Drug Administration": "https://en.wikipedia.org/wiki/Food_and_Drug_Administration_(United_States)"
    },
    {
        " (FDA) regulations, more powerful lasers may not be sold or promoted as laser pointers. Also, any laser with class higher than IIIa (more than 5 milliwatts) requires a key-switch interlock and other safety features.  Shining a laser pointer of any class at an aircraft is illegal and punishable by a fine of up to $11,000.": null
    },
    {
        "All laser products offered in commerce in the US must be registered with the FDA, regardless of output power.": null
    },
    {
        "In ": null
    },
    {
        "Arizona": "https://en.wikipedia.org/wiki/Arizona"
    },
    {
        " it is a Class 1 misdemeanor if a person \"aims a laser pointer at a police officer if the person intentionally or knowingly directs the beam of light from an operating laser pointer at another person and the person knows or reasonably should know that the other person is a police officer.\" (Arizona Revised Statutes §13-1213) ": null
    },
    {
        "On 30 April 2010, Clint Jason Brenner, 36, of ": null
    },
    {
        "Prescott, Arizona": "https://en.wikipedia.org/wiki/Prescott,_Arizona"
    },
    {
        ", was found guilty of two counts of endangerment, each a class 6 felony, and it was also found that each was a dangerous offense, for shining a handheld laser pointer at an Arizona Department of Public Safety helicopter in December 2009.  He was given a sentence of two years in prison for each count, to run concurrently.": null
    },
    {
        "On 2 November 2009, Dana Christian Welch of Southern California was sentenced to 2.5 years in a federal prison after being found guilty of shining a hand-held laser light into the eyes of two pilots landing Boeing jets at ": null
    },
    {
        "John Wayne Airport": "https://en.wikipedia.org/wiki/John_Wayne_Airport"
    },
    {
        ".": null
    },
    {
        "Public act 257 of 2003 makes it a felony for a person to \"manufacture, deliver, possess, transport, place, use, or release\" a \"harmful electronic or electromagnetic device\" for \"an unlawful purpose\"; also made into a felony is the act of causing \"an individual to falsely believe that the individual has been exposed to a... harmful electronic or electromagnetic device.\"": null
    },
    {
        "Public act 328 of 1931 makes it a felony for a person to \"sell, offer for sale, or possess\" a \"portable device or weapon from which an electric current, impulse, wave, or beam may be directed\" and is designed \"to incapacitate temporarily, injure, or kill\".": null
    },
    {
        "Public law 264, H.P. 868 - L.D. 1271 criminalizes the knowing, intentional, and/or reckless use of an electronic weapon on another person, defining an electronic weapon as a portable device or weapon emitting an electric current, impulse, beam, or wave with disabling effects on a human being.": null
    },
    {
        "Chapter 170 of the Acts of 2004, Section 140 of the General Laws, section 131J states: \"No person shall possess a portable device or weapon from which an electric current, impulse, wave or beam may be directed, which current, impulse, wave or beam is designed to incapacitate temporarily, injure or kill, except ... Whoever violates this section shall be punished by a fine of not less than $500 nor more than $1,000 or by imprisonment in the house of correction for not less than 6 months nor more than 2 1/2 years, or by both such fine and imprisonment.\"": null
    },
    {
        "In ": null
    },
    {
        "Utah": "https://en.wikipedia.org/wiki/Utah"
    },
    {
        " it is a class C ": null
    },
    {
        "misdemeanor": "https://en.wikipedia.org/wiki/Misdemeanor"
    },
    {
        " to point a laser pointer at a ": null
    },
    {
        "law enforcement officer": "https://en.wikipedia.org/wiki/Law_enforcement_officer"
    },
    {
        " and is an ": null
    },
    {
        "infraction": "https://en.wikipedia.org/wiki/Infraction"
    },
    {
        " to point a laser pointer at a moving vehicle.": null
    },
    {
        "The \"RESOLUCIÓN 57151 DE 2016\" prohibits the marketing and making available to consumers of laser pointers with output power equal to or greater than one milliwatt (>=1 mW). Colombia is the first country in South America to regulate the marketing of these products.": null
    }
]