[
    {
        "Walter George Chandoha (November 30, 1920 – January 11, 2019) was a prolific photographer, known especially for his photographs of animals and particularly of cats.  Additional subjects for which he is known are fruits, vegetables, flowers, and New York City street scenes. Over his long career, his archive grew to more than 225,000 photographs including approximately 90,000 photographs of cats.": null
    },
    {
        "He began taking photographs as a child using his family's Kodak camera and later joined a camera club in ": null
    },
    {
        "Bayonne": "https://en.wikipedia.org/wiki/Bayonne,_New_Jersey"
    },
    {
        " where he learned ": null
    },
    {
        "darkroom": "https://en.wikipedia.org/wiki/Darkroom"
    },
    {
        " skills. After high school, he worked as an assistant to illustrator Leon de Voss.": null
    },
    {
        "Chandoha was drafted into the army during World War II where he served as a press photographer and then as a combat photographer in the Pacific War theater. In 1949, he was graduated from ": null
    },
    {
        "N.Y.U. School of Commerce, Accounts, and Finance": "https://en.wikipedia.org/wiki/New_York_University_Stern_School_of_Business"
    },
    {
        " under the ": null
    },
    {
        "G.I. Bill": "https://en.wikipedia.org/wiki/G.I._Bill"
    },
    {
        ". That same year he married Maria Ratti and they moved into an apartment in ": null
    },
    {
        "Queens": "https://en.wikipedia.org/wiki/Queens"
    },
    {
        ", New York. On his way home from classes at NYU one night that winter, he found a kitten shivering in the snow. The kitten, Loco, became one of his favorite subjects. His enjoyment of photographing that cat prompted him to become a free-lance photographer and he eventually specialized in photographs of cats. They later moved to a farm in ": null
    },
    {
        "Annandale, New Jersey": "https://en.wikipedia.org/wiki/Annandale,_New_Jersey"
    },
    {
        ", where they raised their two children and where he died at the age of 98. ": null
    },
    {
        "His photographs were used on more than 300 magazine covers and in thousands of advertisements. He was the author of at least 34 books,including Walter Chandoha's Book of Kittens and Cats, Walter Chandoha's Book of Puppies and Dogs, How to Photograph Cats, Dogs, and Other Animals, How to Shoot and Sell Animal Photos, All Kinds of Cats, and Mind Your Manners!. He and his work were also the subject of many books and museum exhibitions. He was once quoted as saying, \"Cats are my favorite animal subject because of their unlimited range of attitude, posture, expression, and coloration.\"": null
    }
]