[
    {
        "The International Commission on Zoological Nomenclature (ICZN) is an organization dedicated to \"achieving stability and sense in the scientific naming of animals\". Founded in 1895, it currently comprises 27 members from 19 countries, mainly practicing zoological ": null
    },
    {
        "taxonomists": "https://en.wikipedia.org/wiki/Taxonomist"
    },
    {
        ".": null
    },
    {
        "The ICZN is governed by the \"Constitution of the ICZN\", which is usually published together with the ": null
    },
    {
        "ICZN Code": "https://en.wikipedia.org/wiki/ICZN_Code"
    },
    {
        ".": null
    },
    {
        "Members are elected by the Section of Zoological Nomenclature, established by the ": null
    },
    {
        "International Union of Biological Sciences": "https://en.wikipedia.org/wiki/International_Union_of_Biological_Sciences"
    },
    {
        " (IUBS).": null
    },
    {
        "The regular term of service of a member of the Commission is 6 years. Members can be re-elected up to a total of three full six-year terms in a row. After 18 continuous years of elected service, a break of at least 3 years is prescribed before the member can stand again for election.": null
    },
    {
        "Since 2014, the work of the Commission is supported by a small secretariat based at the ": null
    },
    {
        "National University of Singapore": "https://en.wikipedia.org/wiki/National_University_of_Singapore"
    },
    {
        ", in ": null
    },
    {
        "Singapore": "https://en.wikipedia.org/wiki/Singapore"
    },
    {
        ". Previously, the secretariat was based in London and funded by the International Trust for Zoological Nomenclature. The Commission assists the zoological community \"through generation and dissemination of information on the correct use of the scientific names of animals\".": null
    },
    {
        "The ICZN publishes the ": null
    },
    {
        "International Code of Zoological Nomenclature": "https://en.wikipedia.org/wiki/International_Code_of_Zoological_Nomenclature"
    },
    {
        " (usually referred to as  \"the Code\" or \"the ICZN Code\"), a widely accepted ": null
    },
    {
        "convention": "https://en.wikipedia.org/wiki/Convention_(norm)"
    },
    {
        " containing the rules for the formal ": null
    },
    {
        "scientific naming": "https://en.wikipedia.org/wiki/Scientific_name"
    },
    {
        " of all ": null
    },
    {
        "organisms": "https://en.wikipedia.org/wiki/Organism"
    },
    {
        " that are treated as ": null
    },
    {
        "animals": "https://en.wikipedia.org/wiki/Animal"
    },
    {
        ". New editions of the Code are elaborated by the Editorial Committee appointed by the Commission. The 4th edition of the Code (1999) was edited by seven people.": null
    },
    {
        "The Commission also provides rulings on individual problems brought to its attention, as arbitration may be necessary in contentious cases, where strict adherence to the Code would interfere with stability of usage (e.g., see ": null
    },
    {
        "conserved name": "https://en.wikipedia.org/wiki/Conserved_name"
    },
    {
        "). These rulings are published in the Bulletin of Zoological Nomenclature. Starting in 2017, volumes 65 (2008) onwards of the Bulletin will be available online to subscribers in the ": null
    },
    {
        "BioOne": "https://en.wikipedia.org/wiki/BioOne"
    },
    {
        " journal database.": null
    }
]