[
    {
        "Marcus Valerius Martialis (known in ": null
    },
    {
        "English": "https://en.wikipedia.org/wiki/English_language"
    },
    {
        " as Martial) (March, between 38 and 41 AD – between 102 and 104 AD) was a Roman poet from ": null
    },
    {
        "Hispania": "https://en.wikipedia.org/wiki/Hispania"
    },
    {
        " (modern ": null
    },
    {
        "Spain": "https://en.wikipedia.org/wiki/Spain"
    },
    {
        ") best known for his twelve books of ": null
    },
    {
        "Epigrams": "https://en.wikipedia.org/wiki/Epigram"
    },
    {
        ", published in ": null
    },
    {
        "Rome": "https://en.wikipedia.org/wiki/Ancient_Rome"
    },
    {
        " between AD 86 and 103, during the reigns of the ": null
    },
    {
        "emperors": "https://en.wikipedia.org/wiki/Roman_emperor"
    },
    {
        "Domitian": "https://en.wikipedia.org/wiki/Domitian"
    },
    {
        ", ": null
    },
    {
        "Nerva": "https://en.wikipedia.org/wiki/Nerva"
    },
    {
        " and ": null
    },
    {
        "Trajan": "https://en.wikipedia.org/wiki/Trajan"
    },
    {
        ". In these short, witty poems he cheerfully ": null
    },
    {
        "satirises": "https://en.wikipedia.org/wiki/Satire"
    },
    {
        " city life and the scandalous activities of his acquaintances, and romanticises his provincial upbringing. He wrote a total of 1,561 epigrams, of which 1,235 are in ": null
    },
    {
        "elegiac couplets": "https://en.wikipedia.org/wiki/Elegiac_couplet"
    },
    {
        ".": null
    },
    {
        "Martial has been called the greatest Latin epigrammatist, and is considered the creator of the modern ": null
    },
    {
        "epigram": "https://en.wikipedia.org/wiki/Epigram"
    },
    {
        ".": null
    },
    {
        "Knowledge of his origins and early life are derived almost entirely from his works, which can be more or less dated according to the well-known events to which they refer. In Book X of his Epigrams, composed between 95 and 98, he mentions celebrating his fifty-seventh birthday; hence he was born during March 38, 39, 40 or 41 AD (x. 24, 1),under ": null
    },
    {
        "Caligula": "https://en.wikipedia.org/wiki/Caligula"
    },
    {
        " or ": null
    },
    {
        "Claudius": "https://en.wikipedia.org/wiki/Claudius"
    },
    {
        ". His place of birth was ": null
    },
    {
        "Augusta Bilbilis": "https://en.wikipedia.org/wiki/Augusta_Bilbilis"
    },
    {
        " (now ": null
    },
    {
        "Calatayud": "https://en.wikipedia.org/wiki/Calatayud"
    },
    {
        ") in ": null
    },
    {
        "Hispania Tarraconensis": "https://en.wikipedia.org/wiki/Hispania_Tarraconensis"
    },
    {
        ". His parents, Fronto and Flaccilla, appear to have died in his youth.": null
    },
    {
        "His name seems to imply that he was born a Roman citizen, but he speaks of himself as \"sprung from the ": null
    },
    {
        "Celts": "https://en.wikipedia.org/wiki/Celts"
    },
    {
        " and ": null
    },
    {
        "Iberians": "https://en.wikipedia.org/wiki/Hispania"
    },
    {
        ", and a countryman of the ": null
    },
    {
        "Tagus": "https://en.wikipedia.org/wiki/Tagus"
    },
    {
        "\"; and, in contrasting his own masculine appearance with that of an effeminate Greek, he draws particular attention to \"his stiff ": null
    },
    {
        "Hispanian": "https://en.wikipedia.org/wiki/Hispania"
    },
    {
        " hair\" (x. 65, 7).": null
    },
    {
        "His home was evidently one of rude comfort and plenty, sufficiently in the country to afford him the amusements of ": null
    },
    {
        "hunting": "https://en.wikipedia.org/wiki/Hunting"
    },
    {
        " and ": null
    },
    {
        "fishing": "https://en.wikipedia.org/wiki/Fishing"
    },
    {
        ", which he often recalls with keen pleasure, and sufficiently near the town to afford him the companionship of many comrades, the few survivors of whom he looks forward to meeting again after his thirty-four years' absence (x. 104). The memories of this old home, and of other spots, the rough names and local associations which he delights to introduce into his verse, attest to the simple pleasures of his early life and were among the influences which kept his spirit alive in the stultifying routines of upper-crust social life in Rome.": null
    },
    {
        "He was educated in Hispania, a part of the Roman Empire which in the 1st century produced several notable Latin writers, including ": null
    },
    {
        "Seneca the Elder": "https://en.wikipedia.org/wiki/Seneca_the_Elder"
    },
    {
        " and ": null
    },
    {
        "Seneca the Younger": "https://en.wikipedia.org/wiki/Seneca_the_Younger"
    },
    {
        ", ": null
    },
    {
        "Lucan": "https://en.wikipedia.org/wiki/Lucan_(poet)"
    },
    {
        " and ": null
    },
    {
        "Quintilian": "https://en.wikipedia.org/wiki/Quintilian"
    },
    {
        ", and Martial's contemporaries ": null
    },
    {
        "Licinianus": "https://en.wikipedia.org/w/index.php?title=Licinianus_(poet)&action=edit&redlink=1"
    },
    {
        " of Bilbilis, ": null
    },
    {
        "Decianus": "https://en.wikipedia.org/wiki/Decianus"
    },
    {
        " of ": null
    },
    {
        "Emerita": "https://en.wikipedia.org/wiki/Emerita_Augusta"
    },
    {
        " and ": null
    },
    {
        "Canius": "https://en.wikipedia.org/wiki/Cania_(gens)"
    },
    {
        " of Gades. Martial professes to be of the school of ": null
    },
    {
        "Catullus": "https://en.wikipedia.org/wiki/Catullus"
    },
    {
        ", ": null
    },
    {
        "Pedo": "https://en.wikipedia.org/wiki/Albinovanus_Pedo"
    },
    {
        ", and ": null
    },
    {
        "Marsus": "https://en.wikipedia.org/wiki/Domitius_Marsus"
    },
    {
        ". The epigram bears to this day the form impressed upon it by his unrivalled skill in wordsmithing.": null
    },
    {
        "The success of his countrymen may have been what motivated Martial to move to ": null
    },
    {
        "Rome": "https://en.wikipedia.org/wiki/Rome"
    },
    {
        ", from Hispania, once he had completed his education. This move occurred in AD 64. ": null
    },
    {
        "Seneca the Younger": "https://en.wikipedia.org/wiki/Seneca_the_Younger"
    },
    {
        " and ": null
    },
    {
        "Lucan": "https://en.wikipedia.org/wiki/Lucan"
    },
    {
        " may have served as his first patrons, but this is not known for sure.": null
    },
    {
        "Not much is known of the details of his life for the first twenty years or so after he came to Rome. He published some juvenile poems of which he thought very little in his later years, and he chuckles at a foolish bookseller who would not allow them to die a natural death ": null
    },
    {
        "(I. 113)": "https://la.wikisource.org/wiki/Epigrammaton_liber_I#CXIII"
    },
    {
        ". His faculty ripened with experience and with the knowledge of that social life which was both his theme and his inspiration; many of his best epigrams are among those written in his last years. From many answers which he makes to the remonstrances of friends—among others to those of ": null
    },
    {
        "Quintilian": "https://en.wikipedia.org/wiki/Quintilian"
    },
    {
        "—it may be inferred that he was urged to practice at the bar, but that he preferred his own lazy, some would say ": null
    },
    {
        "Bohemian": "https://en.wikipedia.org/wiki/Bohemianism"
    },
    {
        " kind of life. He made many influential friends and patrons and secured the favor of both ": null
    },
    {
        "Titus": "https://en.wikipedia.org/wiki/Titus"
    },
    {
        " and ": null
    },
    {
        "Domitian": "https://en.wikipedia.org/wiki/Domitian"
    },
    {
        ". From them he obtained various privileges, among others the semestris tribunatus, which conferred on him ": null
    },
    {
        "equestrian": "https://en.wikipedia.org/wiki/Equestrian_(Roman)"
    },
    {
        " rank. Martial failed, however, in his application to Domitian for more substantial advantages, although he commemorates the glory of having been invited to dinner by him, and also the fact that he procured the privilege of citizenship for many persons on whose behalf he appealed to him.": null
    },
    {
        "The earliest of his extant works, known as Liber spectaculorum, was first published at the ": null
    },
    {
        "opening": "https://en.wikipedia.org/wiki/Inaugural_games_of_the_Flavian_Amphitheatre"
    },
    {
        " of the ": null
    },
    {
        "Colosseum": "https://en.wikipedia.org/wiki/Colosseum"
    },
    {
        " in the reign of Titus. It relates to the theatrical performances given by him, but the book as it now stands was published about the first year of Domitian, i.e. about the year 81. The favour of the emperor procured him the countenance of some of the worst creatures at the imperial court—among them of the notorious Crispinus, and probably of Paris, the supposed author of ": null
    },
    {
        "Juvenal": "https://en.wikipedia.org/wiki/Juvenal"
    },
    {
        "'s exile, for whose monument Martial afterwards wrote a eulogistic epitaph. The two books, numbered by editors XIII and XIV, known by the names of Xenia and Apophoreta—inscriptions in two lines each for presents—were published at the ": null
    },
    {
        "Saturnalia": "https://en.wikipedia.org/wiki/Saturnalia"
    },
    {
        " of 84. In 86 he produced the first two of the twelve books on which his reputation rests.": null
    },
    {
        "From that time till his return to Hispania in 98 he published a volume almost every year. The first nine books and the first edition of Book X appeared in the reign of Domitian; Book XI. appeared at the end of 96, shortly after the accession of ": null
    },
    {
        "Nerva": "https://en.wikipedia.org/wiki/Nerva"
    },
    {
        ". A revised edition of book X, that which we now possess, appeared in 98, about the time of ": null
    },
    {
        "Trajan": "https://en.wikipedia.org/wiki/Trajan"
    },
    {
        "'s entrance into Rome. The last book was written after three years' absence in Hispania, shortly before his death about the year 102 or 103.": null
    },
    {
        "These twelve books bring Martial's ordinary mode of life between the age of forty-five and sixty before us. His regular home for thirty-five years was the bustle of metropolitan Rome. He lived at first up three flights of stairs, and his \"garret\" overlooked the laurels in front of the portico of ": null
    },
    {
        "Agrippa": "https://en.wikipedia.org/wiki/Marcus_Vipsanius_Agrippa"
    },
    {
        ". He had a small villa and unproductive farm near ": null
    },
    {
        "Nomentum": "https://en.wikipedia.org/wiki/Nomentum"
    },
    {
        ", in the ": null
    },
    {
        "Sabine": "https://en.wikipedia.org/wiki/Sabine"
    },
    {
        " territory, to which he occasionally retired from the pestilence, boors and noises of the city (ii. 38, xii. 57). In his later years he had also a small house on the ": null
    },
    {
        "Quirinal": "https://en.wikipedia.org/wiki/Quirinal_Hill"
    },
    {
        ", near the temple of ": null
    },
    {
        "Quirinus": "https://en.wikipedia.org/wiki/Quirinus"
    },
    {
        ".": null
    },
    {
        "At the time when his third book was brought out he had retired for a short time to ": null
    },
    {
        "Cisalpine Gaul": "https://en.wikipedia.org/wiki/Cisalpine_Gaul"
    },
    {
        ", in weariness, as he tells us, of his unprofitable attendance to the bigwigs of Rome. For a time he seems to have felt the charm of the new scenes which he visited, and in a later book (iv. 25) he contemplates the prospect of retiring to the neighbourhood of ": null
    },
    {
        "Aquileia": "https://en.wikipedia.org/wiki/Aquileia"
    },
    {
        " and the ": null
    },
    {
        "Timavus": "https://en.wikipedia.org/wiki/Timavus"
    },
    {
        ". But the spell exercised over him by Rome and Roman society was too great; even the epigrams sent from Forum Corneli and the ": null
    },
    {
        "Aemilian Way": "https://en.wikipedia.org/wiki/Aemilian_Way"
    },
    {
        " ring much more of the Roman forum, and of the streets, baths, porticos, brothels, market stalls, public houses, and clubs of Rome, than of the places from which they are dated.": null
    },
    {
        "His final departure from Rome was motivated by a weariness of the burdens imposed on him by his social position, and apparently the difficulties of meeting the ordinary expenses of living in the metropolis (x. 96); and he looks forward to a return to the scenes familiar to his youth. The well-known epigram addressed to Juvenal (xii. I 8) shows that for a time his ideal was happily realized; but the evidence of the prose epistle prefixed to Book XII proves and that he could not live happily away from the literary and social pleasures of Rome for long. The one consolation of his exile was a lady, Marcella, of whom he writes rather platonically as if she were his patroness—and it seems to have been a necessity of his life to always have a patron or patroness—rather than his wife or mistress.": null
    },
    {
        "During his life at Rome, although he never rose to a position of real independence, he seems to have known many writers of the time. In addition to ": null
    },
    {
        "Lucan": "https://en.wikipedia.org/wiki/Lucan"
    },
    {
        " and ": null
    },
    {
        "Quintilian": "https://en.wikipedia.org/wiki/Quintilian"
    },
    {
        ", he numbered among his friends ": null
    },
    {
        "Silius Italicus": "https://en.wikipedia.org/wiki/Silius_Italicus"
    },
    {
        ", ": null
    },
    {
        "Juvenal": "https://en.wikipedia.org/wiki/Juvenal"
    },
    {
        " and ": null
    },
    {
        "Pliny the Younger": "https://en.wikipedia.org/wiki/Pliny_the_Younger"
    },
    {
        ". The silence which he and ": null
    },
    {
        "Statius": "https://en.wikipedia.org/wiki/Statius"
    },
    {
        ", although authors writing at the same time, having common friends, maintain in regard to one another may be explained by mutual dislike. Martial in many places shows an undisguised contempt for the artificial kind of epic on which Statius's reputation chiefly rests; and it is possible that the respectable author of the Thebaid and the Silvae felt little admiration for the life or the works of the bohemian epigrammatist.": null
    },
    {
        "Martial was dependent on his wealthy friends and patrons for gifts of money, for his dinner, and even for his dress, but the ": null
    },
    {
        "relation of client to patron": "https://en.wikipedia.org/wiki/Patronage_in_ancient_Rome"
    },
    {
        " had been recognized as an honourable one by the best Roman traditions. No blame had attached to ": null
    },
    {
        "Virgil": "https://en.wikipedia.org/wiki/Virgil"
    },
    {
        " or ": null
    },
    {
        "Horace": "https://en.wikipedia.org/wiki/Horace"
    },
    {
        " on account of the favours which they received from ": null
    },
    {
        "Augustus": "https://en.wikipedia.org/wiki/Augustus"
    },
    {
        " and ": null
    },
    {
        "Maecenas": "https://en.wikipedia.org/wiki/Maecenas"
    },
    {
        ", or of the return which they made for these favours in their verse. That old honourable relationship, however, greatly changed between Augustus and Domitian. Men of good birth and education, and sometimes even of high official position (Juv. i. 117), accepted the dole (sportula). Martial was merely following a general fashion in paying his court to \"a lord,\" and he made the best of the custom. In his earlier career he used to accompany his patrons to their villas at ": null
    },
    {
        "Baiae": "https://en.wikipedia.org/wiki/Baiae"
    },
    {
        " or ": null
    },
    {
        "Tibur": "https://en.wikipedia.org/wiki/Tivoli,_Italy"
    },
    {
        ", and to attend their morning levees. Later on, he went to his own small country house, near Nomentum, and sent a poem, or a small volume of his poems, as his representative at the early visit.": null
    },
    {
        "Pliny the Younger": "https://en.wikipedia.org/wiki/Pliny_the_Younger"
    },
    {
        ", in the short tribute which he pays to him on hearing of his death, wrote, \"He had as much good-nature as wit and pungency in his writings\". Martial professes to avoid personalities in his satire, and honour and sincerity (fides and simplicitas) seem to have been the qualities which he most admires in his friends. Some have found distasteful his apparent servile flattery to the worst of the many bad emperors of Rome in the 1st century. These were emperors Martial would later censure immediately after their death (xii. 6). However, he seems to have disliked ": null
    },
    {
        "hypocrisy": "https://en.wikipedia.org/wiki/Hypocrisy"
    },
    {
        " in its many forms, and seems to be free from ": null
    },
    {
        "cant": "https://en.wikipedia.org/wiki/Hypocrisy"
    },
    {
        ", ": null
    },
    {
        "pedantry": "https://en.wikipedia.org/wiki/Pedantry"
    },
    {
        ", or affectation of any kind.": null
    },
    {
        "Though many of his epigrams indicate a cynical disbelief in the character of women, yet others prove that he could respect and almost revere a refined and courteous lady. His own life in Rome afforded him no experience of domestic virtue; but his epigrams show that, even in the age which is known to modern readers chiefly from the Satires of ": null
    },
    {
        "Juvenal": "https://en.wikipedia.org/wiki/Juvenal"
    },
    {
        ", virtue was recognized as the purest source of happiness. The tenderest element in Martial's nature seems, however, to have been his affection for children and for his dependents.": null
    },
    {
        "Martial's keen curiosity and power of observation are manifested in his epigrams. The enduring literary interest of Martial's epigrams arises as much from their literary quality as from the colorful references to human life that they contain. Martial's epigrams bring to life the spectacle and brutality of daily life in imperial Rome, with which he was intimately connected.": null
    },
    {
        "From Martial, for example, we have a glimpse of living conditions in the city of Rome:": null
    },
    {
        "As Jo-Ann Shelton has written, \"fire was a constant threat in ancient cities because wood was a common building material and people often used open fires and ": null
    },
    {
        "oil lamps": "https://en.wikipedia.org/wiki/Oil_lamp"
    },
    {
        ". However, some people may have ": null
    },
    {
        "deliberately set fire to their property in order to collect insurance money": "https://en.wikipedia.org/wiki/Insurance_fraud"
    },
    {
        ".\" Martial makes this accusation in one of his epigrams:": null
    },
    {
        "Martial also pours scorn on the doctors of his day:": null
    },
    {
        "Martial's epigrams also refer to the extreme cruelty shown to slaves in Roman society. Below, he chides a man named Rufus for flogging his cook for a minor mistake:": null
    },
    {
        "Martial's epigrams are also characterized by their biting and often scathing sense of wit as well as for their lewdness; this has earned him a place in literary history as the original ": null
    },
    {
        "insult comic": "https://en.wikipedia.org/wiki/Insult_comic"
    },
    {
        ". Below is a sample of his more insulting work:": null
    },
    {
        "Or the following two examples (in translations by Mark Ynys-Mon):": null
    },
    {
        "The Epigrams and ": null
    },
    {
        "Roman graffiti": "https://en.wikipedia.org/wiki/Roman_graffiti"
    },
    {
        " are often the only early sources for ": null
    },
    {
        "Latin obscene words": "https://en.wikipedia.org/wiki/Latin_obscenity"
    },
    {
        ".": null
    },
    {
        "The works of Martial became highly valued on their discovery by the ": null
    },
    {
        "Renaissance": "https://en.wikipedia.org/wiki/Renaissance"
    },
    {
        ", whose writers often saw them as sharing an eye for the urban vices of their own times. The poet's influence is seen in ": null
    },
    {
        "Juvenal": "https://en.wikipedia.org/wiki/Juvenal"
    },
    {
        ", late classical literature, the ": null
    },
    {
        "Carolingian revival": "https://en.wikipedia.org/wiki/Carolingian_Renaissance"
    },
    {
        ", the Renaissance in France and Italy, the ": null
    },
    {
        "Siglo de Oro": "https://en.wikipedia.org/wiki/Spanish_Golden_Age"
    },
    {
        ", and early modern English and German poetry, until he became unfashionable with the growth of the ": null
    },
    {
        "Romantic movement": "https://en.wikipedia.org/wiki/Romanticism"
    },
    {
        ".": null
    },
    {
        "The 21st century has seen a resurgence of scholarly attention to Martial's work.": null
    }
]