[
    {
        "A feral cat is an un-owned domestic ": null
    },
    {
        "cat": "https://en.wikipedia.org/wiki/Cat"
    },
    {
        " (Felis catus) that lives outdoors and avoids human contact: it does not allow itself to be handled or touched, and usually remains hidden from humans. Feral cats may breed over dozens of generations and become an aggressive apex predator in urban, savannah and bushland environments. Some feral cats may become more comfortable with people who regularly feed them, but even with long-term attempts at ": null
    },
    {
        "socialization": "https://en.wikipedia.org/wiki/Socialization_of_animals"
    },
    {
        " they usually remain aloof and are most active after dusk.": null
    },
    {
        "Feral cats are devastating to wildlife, and conservation biologists consider them to be one of the worst invasive species on Earth. Attempts to control feral cat populations are widespread but generally of greatest impact within purpose-fenced reserves. In Australia each feral cat kills up to 1000 native animals a year, ranging from crickets to lizards and small mammals. Some feral \"catastrophic\" cats will develop a taste and skill for hunting larger prey: Indigenous rangers in the Anangu Pitjantjatjara Yangkuntjatjara lands caught a 6.8-kilogram cat with a 5 kilogram rock-wallaby (warru) in its gut.": null
    },
    {
        "To help protect native animals, feral cats are trapped where possible but are often also shot. Some animal-rights groups advocate ": null
    },
    {
        "trap-neuter-return programs": "https://en.wikipedia.org/wiki/Trap%E2%80%93neuter%E2%80%93return"
    },
    {
        " to prevent the cats from continuing to breed, as well as feeding the cats, socializing and adopting out young kittens, and providing healthcare. Others advocate ": null
    },
    {
        "euthanasia": "https://en.wikipedia.org/wiki/Euthanasia"
    },
    {
        ". Feral cats may live outdoors in colonies: these are regarded as managed colonies when they are provided with regular food and care by humans.": null
    },
    {
        "The authors of an article published in the ": null
    },
    {
        "Journal of Feline Medicine and Surgery": "https://en.wikipedia.org/wiki/Journal_of_Feline_Medicine_and_Surgery"
    },
    {
        " in 2013 found that rescuers and veterinarians in the ": null
    },
    {
        "United Kingdom": "https://en.wikipedia.org/wiki/United_Kingdom"
    },
    {
        " tended to distinguish feral cats from domesticated cats based on traits such as their levels of socialization, ownership, and confinement, and on the amount of fear of, interaction with, and dependence upon humans. They found that rescuers and veterinarians tended to agree that feral cats were cats that had not had much human contact (particularly before eight weeks of age), would try to avoid humans, and would prefer to escape rather than attack a human. However, veterinarians and rescuers disagreed on whether a feral cat would tend to hiss and spit at or attack a human during an encounter, and disagreed on whether adult ferals could potentially be ": null
    },
    {
        "tamed": "https://en.wikipedia.org/wiki/Tame_animal"
    },
    {
        ". The article provided a composite definition of a feral cat as a cat that would choose not to interact with humans, could survive with or without human assistance, and would hide or defend itself when trapped rather than allowing itself to be handled.": null
    },
    {
        "A survey of rescue and veterinarian facilities in the ": null
    },
    {
        "United States": "https://en.wikipedia.org/wiki/United_States"
    },
    {
        " revealed that no widely accepted definition of a feral cat exists. Many facilities used waiting periods to evaluate whether a cat was feral by observing whether the cat became less afraid and evasive over time. Other indicators included the cat's response to touch with an inanimate object, and observation of the cats' social behavior in varying environments such as response to human contact, with a human nearby, or when moved to a quieter environment. The ": null
    },
    {
        "American Society for the Prevention of Cruelty to Animals": "https://en.wikipedia.org/wiki/American_Society_for_the_Prevention_of_Cruelty_to_Animals"
    },
    {
        " defines community cats as either cats that were born and raised in the wild, or domestic cats that have been abandoned or lost and turned feral in order to survive.": null
    },
    {
        "The Australian government categorizes cats who have no interaction with or assistance from humans as feral, and unowned cats who rely on humans as ": null
    },
    {
        "semi-feral": "https://en.wikipedia.org/wiki/Semi-feral"
    },
    {
        " or stray.": null
    },
    {
        "The meaning of the term feral cat varies between professions and countries, and is sometimes used interchangeably with other terms such as free-roaming, street, alley, or community cat. Some of these terms are also used to refer to stray cats, although stray and feral cats are generally considered to be different by ": null
    },
    {
        "rescuers": "https://en.wikipedia.org/wiki/Animal_rescue_group"
    },
    {
        ", ": null
    },
    {
        "veterinarians": "https://en.wikipedia.org/wiki/Veterinary_physician"
    },
    {
        ", and researchers. Stray cats are socialized cats who no longer live in homes, but could potentially be successfully reintroduced to a home environment.": null
    },
    {
        "Farm cats": "https://en.wikipedia.org/wiki/Farm_cat"
    },
    {
        " (also called barn cats) are cats that live on agricultural properties in ": null
    },
    {
        "feral": "https://en.wikipedia.org/wiki/Feral"
    },
    {
        " or ": null
    },
    {
        "semi-feral": "https://en.wikipedia.org/wiki/Semi-feral"
    },
    {
        " condition. They primarily live outdoors, usually sheltering in outbuildings. They hunt ": null
    },
    {
        "vermin": "https://en.wikipedia.org/wiki/Vermin"
    },
    {
        " such as rodents and other small animals that live in or around outbuildings and farm fields.": null
    },
    {
        "The need to keep rodents from consuming or contaminating grain crops stored for later human consumption may be the original reason cats were domesticated. They are still commonly kept for the purpose of catching undesired vermin found on ": null
    },
    {
        "farms": "https://en.wikipedia.org/wiki/Farm"
    },
    {
        " and ": null
    },
    {
        "ranches": "https://en.wikipedia.org/wiki/Ranch"
    },
    {
        ", which would otherwise eat or contaminate ": null
    },
    {
        "crops": "https://en.wikipedia.org/wiki/Crops"
    },
    {
        ", especially ": null
    },
    {
        "grain": "https://en.wikipedia.org/wiki/Cereal"
    },
    {
        " or ": null
    },
    {
        "feed": "https://en.wikipedia.org/wiki/Fodder"
    },
    {
        " stocks.": null
    },
    {
        "Some animal rescue organizations maintain farm cat programs, where they place cats in barns whose owners agree to provide basic care for the animals. The cats in these programs are often feral cats who cannot safely be returned to their colonies, or cats who are semi-feral or otherwise difficult to adopt due to behavioral issues.": null
    },
    {
        "Domestic cats have been members of ship crews since the beginning of ": null
    },
    {
        "commercial": "https://en.wikipedia.org/wiki/Commerce"
    },
    {
        "navigation": "https://en.wikipedia.org/wiki/Navigation"
    },
    {
        ".": null
    },
    {
        "Phoenician": "https://en.wikipedia.org/wiki/Phoenicia"
    },
    {
        " and ": null
    },
    {
        "Etruscan": "https://en.wikipedia.org/wiki/Etrusca"
    },
    {
        " traders probably carried cats on board their trading vessels to Italy and the ": null
    },
    {
        "Mediterranean islands": "https://en.wikipedia.org/wiki/Mediterranean_islands"
    },
    {
        ".": null
    },
    {
        "Cats in ancient Egypt": "https://en.wikipedia.org/wiki/Cats_in_ancient_Egypt"
    },
    {
        " were venerated for killing ": null
    },
    {
        "rodents": "https://en.wikipedia.org/wiki/Rodent"
    },
    {
        " and ": null
    },
    {
        "venomous snakes": "https://en.wikipedia.org/wiki/Venomous_snake"
    },
    {
        ".The spread of cats throughout much of the world is thought to have originated in ": null
    },
    {
        "Egypt": "https://en.wikipedia.org/wiki/Egypt"
    },
    {
        ". Scientists do not agree on whether cats were domesticated in ": null
    },
    {
        "Ancient Egypt": "https://en.wikipedia.org/wiki/Ancient_Egypt"
    },
    {
        " or introduced there after domestication. ": null
    },
    {
        "Phoenician": "https://en.wikipedia.org/wiki/Phoenicia"
    },
    {
        " traders brought them to Europe for control of ": null
    },
    {
        "rat": "https://en.wikipedia.org/wiki/Rat"
    },
    {
        " populations, and ": null
    },
    {
        "monks": "https://en.wikipedia.org/wiki/Monk"
    },
    {
        " brought them further into Asia. ": null
    },
    {
        "Roman": "https://en.wikipedia.org/wiki/Roman_army"
    },
    {
        " armies also contributed spreading cats and eventually brought them to ": null
    },
    {
        "Britain": "https://en.wikipedia.org/wiki/Roman_Britain"
    },
    {
        ". Since then, cats continued to be introduced to new countries, often by ": null
    },
    {
        "sailors": "https://en.wikipedia.org/wiki/Sailor"
    },
    {
        " or ": null
    },
    {
        "settlers": "https://en.wikipedia.org/wiki/Settler"
    },
    {
        ". Cats are thought to have been introduced to Australia in either the 1600s by Dutch shipwrecks, or the late 1700s by English settlers. These domesticated cats began to form feral populations after their offspring began living away from human contact.": null
    },
    {
        "In the 19th and 20th centuries, several cat specimens were described as wildcat ": null
    },
    {
        "subspecies": "https://en.wikipedia.org/wiki/Subspecies"
    },
    {
        " that are considered feral cat populations today:": null
    },
    {
        "The feral cat is the most widely distributed ": null
    },
    {
        "terrestrial": "https://en.wikipedia.org/wiki/Terrestrial_animal"
    },
    {
        " carnivore. It occurs between 55° North and 54.3° South ": null
    },
    {
        "latitudes": "https://en.wikipedia.org/wiki/Latitude"
    },
    {
        " in a wide range of ": null
    },
    {
        "climatic zones": "https://en.wikipedia.org/wiki/Climatic_zone"
    },
    {
        " and ": null
    },
    {
        "islands": "https://en.wikipedia.org/wiki/Island"
    },
    {
        " in the ": null
    },
    {
        "Atlantic": "https://en.wikipedia.org/wiki/Atlantic_Ocean"
    },
    {
        ", ": null
    },
    {
        "Indian": "https://en.wikipedia.org/wiki/Indian_Ocean"
    },
    {
        " and ": null
    },
    {
        "Pacific Oceans": "https://en.wikipedia.org/wiki/Pacific_Ocean"
    },
    {
        ", and ": null
    },
    {
        "Mediterranean Sea": "https://en.wikipedia.org/wiki/Mediterranean_Sea"
    },
    {
        ", including ": null
    },
    {
        "Canary Islands": "https://en.wikipedia.org/wiki/Canary_Islands"
    },
    {
        ", ": null
    },
    {
        "Port-Cros": "https://en.wikipedia.org/wiki/Port-Cros"
    },
    {
        ", ": null
    },
    {
        "Dassen Island": "https://en.wikipedia.org/wiki/Dassen_Island"
    },
    {
        ", ": null
    },
    {
        "Marion Island": "https://en.wikipedia.org/wiki/Marion_Island"
    },
    {
        ", ": null
    },
    {
        "Juan de Nova Island": "https://en.wikipedia.org/wiki/Juan_de_Nova_Island"
    },
    {
        ", ": null
    },
    {
        "Réunion": "https://en.wikipedia.org/wiki/R%C3%A9union"
    },
    {
        ", ": null
    },
    {
        "Hahajima": "https://en.wikipedia.org/wiki/Hahajima"
    },
    {
        ", ": null
    },
    {
        "Okinawa Island": "https://en.wikipedia.org/wiki/Okinawa_Island"
    },
    {
        ", ": null
    },
    {
        "Raoul Island": "https://en.wikipedia.org/wiki/Raoul_Island"
    },
    {
        ", ": null
    },
    {
        "Herekopare Island": "https://en.wikipedia.org/wiki/Herekopare_Island"
    },
    {
        ", ": null
    },
    {
        "Stewart Island": "https://en.wikipedia.org/wiki/Stewart_Island"
    },
    {
        ", ": null
    },
    {
        "Macquarie Island": "https://en.wikipedia.org/wiki/Macquarie_Island"
    },
    {
        ", ": null
    },
    {
        "Galápagos Islands": "https://en.wikipedia.org/wiki/Gal%C3%A1pagos_Islands"
    },
    {
        ", ": null
    },
    {
        "San Clemente Island": "https://en.wikipedia.org/wiki/San_Clemente_Island"
    },
    {
        ", ": null
    },
    {
        "Isla Natividad": "https://en.wikipedia.org/wiki/Isla_Natividad"
    },
    {
        ", ": null
    },
    {
        "San José Island": "https://en.wikipedia.org/wiki/Isla_San_Jos%C3%A9_(Baja_California_Sur)"
    },
    {
        ", ": null
    },
    {
        "New Island": "https://en.wikipedia.org/wiki/New_Island"
    },
    {
        ".": null
    },
    {
        "The feral cat population on the ": null
    },
    {
        "Hawaiian Islands": "https://en.wikipedia.org/wiki/Hawaiian_Islands"
    },
    {
        " is mainly of European origin and probably arrived in the 19th century on ships.": null
    },
    {
        "Some locations have become known for their feral cat populations, such as the Japanese island of ": null
    },
    {
        "Aoshima": "https://en.wikipedia.org/wiki/Aoshima,_Ehime"
    },
    {
        ". The multiple, managed, feral colonies at the ": null
    },
    {
        "Colosseum": "https://en.wikipedia.org/wiki/Colosseum"
    },
    {
        " in Rome exceed 250 cats. Other notable colonies include the ": null
    },
    {
        "Canadian Parliamentary Cats": "https://en.wikipedia.org/wiki/Canadian_Parliamentary_Cats"
    },
    {
        ", and the cats of Jerusalem.": null
    },
    {
        "Most feral cats have small ": null
    },
    {
        "home ranges": "https://en.wikipedia.org/wiki/Home_range"
    },
    {
        ", although some are more transient and travel long distances. The home ranges of male feral cats, which are generally two or three times larger than those of female cats, are on average under 10 ": null
    },
    {
        "hectares": "https://en.wikipedia.org/wiki/Hectare"
    },
    {
        " (25 ": null
    },
    {
        "acres": "https://en.wikipedia.org/wiki/Acre"
    },
    {
        "), but can vary from almost 300 hectares (740 acres) to under 1 hectare (2.5 acres). This variance is often due to breeding season, access to females, whether the cat is neutered, age, time of day, and availability of prey.": null
    },
    {
        "Some behaviors are commonly observed among feral cats, although there is disagreement among veterinarians, rescuers, and researchers on the prevalence of some. In a free-roaming environment, feral cats avoid humans. They do not allow themselves to be handled or touched by humans, and back away or run when they are able to do so. If trapped, they may hiss, growl, bare their teeth, or strike out. They remain fairly hidden from humans and will not approach, although some feral cats gradually become more comfortable around humans who feed them regularly.": null
    },
    {
        "Feral cats often live in colonies, groups of feral cats that live together in one territory, often near food sources and shelter. Researchers disagree on the existence, extent, and structure of ": null
    },
    {
        "dominance hierarchies": "https://en.wikipedia.org/wiki/Dominance_hierarchy"
    },
    {
        " within feral colonies. Different types of hierarchies have been observed in feral colonies, including ": null
    },
    {
        "despotic": "https://en.wikipedia.org/wiki/Despotism"
    },
    {
        " and linear hierarchies. Some colonies are organized in more complex structures, such as relative hierarchies, where social status of individual cats can vary, depending on their location, the time of day, or the activity the cats are engaged in (particularly feeding and mating).": null
    },
    {
        "When a human decides to care for a feral colony, it is often called a managed colony. The care given can include regularly supplying food and water to the cats, providing shelters, helping with ": null
    },
    {
        "trap-neuter-return": "https://en.wikipedia.org/wiki/Trap-neuter-return"
    },
    {
        " programs, providing continued veterinary care, finding foster homes for cats that can be socialized for eventual adoption, and working to educate people who live in the neighborhood.": null
    },
    {
        "Feral kittens can be trapped and socialized, then adopted into a home. The age at which a kitten becomes difficult to socialize is not agreed upon, but suggestions generally range from seven weeks to four months of age. Although older cats can sometimes be socialized, it is a very long and difficult process, and the cat rarely becomes friendly and may remain fearful.": null
    },
    {
        "In a 2013 study with British participants, rescuers tended to be more willing than veterinarians to attempt to tame adult feral cats. Veterinarians tended to be more opposed to this practice, with some expressing concerns for the welfare of such a cat in a home environment. In a 2010 interview survey with veterinarians and rescuers in the United States, 66% of respondents had socialization programs for kittens, and 8% for adult cats.": null
    },
    {
        "Feral cats primarily subsist on food scavenged from ": null
    },
    {
        "municipal solid waste": "https://en.wikipedia.org/wiki/Municipal_solid_waste"
    },
    {
        " when it is available to them. They also eat animals they kill, and carcasses of animals already dead. Feral cats living in managed colonies are fed ": null
    },
    {
        "cat food": "https://en.wikipedia.org/wiki/Cat_food"
    },
    {
        " by their caretakers. They instinctively hunt and kill native fauna, regardless of how much food is otherwise available to them. A study on indoor/outdoor pet cats in Sweden showed that 15% to 90% of their diets consisted of caught prey, despite the cats being fed at home.": null
    },
    {
        "Domesticated and feral cats have been observed to prey on a wide variety of both ": null
    },
    {
        "vertebrates": "https://en.wikipedia.org/wiki/Vertebrate"
    },
    {
        " and ": null
    },
    {
        "invertebrates": "https://en.wikipedia.org/wiki/Invertebrate"
    },
    {
        ". Cats typically prefer smaller animals with body weights under 100 g (3.5 oz), particularly ": null
    },
    {
        "mammals": "https://en.wikipedia.org/wiki/Mammal"
    },
    {
        ", birds, and lizards. A ": null
    },
    {
        "meta-analysis": "https://en.wikipedia.org/wiki/Meta-analysis"
    },
    {
        " of studies on cat diet showed that cats preyed on over 1,000 species; the most commonly observed were ": null
    },
    {
        "house mouse": "https://en.wikipedia.org/wiki/House_mouse"
    },
    {
        ", ": null
    },
    {
        "European rabbit": "https://en.wikipedia.org/wiki/European_rabbit"
    },
    {
        ", ": null
    },
    {
        "black rat": "https://en.wikipedia.org/wiki/Black_rat"
    },
    {
        ", ": null
    },
    {
        "house sparrow": "https://en.wikipedia.org/wiki/House_sparrow"
    },
    {
        ", and ": null
    },
    {
        "common blackbird": "https://en.wikipedia.org/wiki/Common_blackbird"
    },
    {
        ". Although some people advocate for feral cats as a means to control pigeons and invasive rodent species like house mouse and ": null
    },
    {
        "Norway rat": "https://en.wikipedia.org/wiki/Norway_rat"
    },
    {
        ", these cosmopolitan species co-evolved with cats in human-disturbed environments, and so have an advantage over native rodents in evading cat predation. Studies in California showed that 67% of the mice killed by cats were native species, and that areas near feral cat colonies actually have larger populations of house mouse, with fewer birds and native rodents.": null
    },
    {
        "Feral cats in Australia prey on a variety of wildlife. In ": null
    },
    {
        "arid": "https://en.wikipedia.org/wiki/Arid"
    },
    {
        " and ": null
    },
    {
        "semi-arid": "https://en.wikipedia.org/wiki/Semi-arid_climate"
    },
    {
        " environments, they eat mostly ": null
    },
    {
        "introduced": "https://en.wikipedia.org/wiki/Introduced_species"
    },
    {
        " European rabbits and house mice. In arid environments where rabbits do not occur, native rodents are taken. In forests and urbanized areas, they eat mostly native rodents and  ": null
    },
    {
        "marsupials": "https://en.wikipedia.org/wiki/Marsupial"
    },
    {
        ", particularly the ": null
    },
    {
        "common ringtail possum": "https://en.wikipedia.org/wiki/Common_ringtail_possum"
    },
    {
        ".": null
    },
    {
        "Feral cats are either ": null
    },
    {
        "mesopredators": "https://en.wikipedia.org/wiki/Mesopredator"
    },
    {
        " or ": null
    },
    {
        "apex predators": "https://en.wikipedia.org/wiki/Apex_predator"
    },
    {
        " in local ecosystems. In others, they are prey of feral ": null
    },
    {
        "dogs": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        ", ": null
    },
    {
        "dingoes": "https://en.wikipedia.org/wiki/Dingo"
    },
    {
        ", ": null
    },
    {
        "coyotes": "https://en.wikipedia.org/wiki/Coyote"
    },
    {
        ", and ": null
    },
    {
        "birds of prey": "https://en.wikipedia.org/wiki/Bird_of_prey"
    },
    {
        ".": null
    },
    {
        "Without human assistance, feral kittens are expected to have a high death rate, with approximately 50% dying within the first year. Of cats who survive kittenhood, the average life span of a feral cat without human care is less than two years": null
    },
    {
        "However, adult feral cats without human assistance have been found in surprisingly good condition. In Florida, a study of feral cats admitted to a trap-neuter-return (TNR) program concluded that \"euthanasia for debilitated cats for humane reasons is rarely necessary\". A further study of over 100,000 community cats (feral and stray) admitted to TNR programs in diverse locations of the U.S. resulted in the same 0.4% rate of euthanasia for debilitating conditions. The body condition of feral cats entering a TNR program in Florida was described as \"generally lean but not emaciated\". However, many community cats had suffered from parasites such as ": null
    },
    {
        "fleas": "https://en.wikipedia.org/wiki/Flea"
    },
    {
        " and ": null
    },
    {
        "ear mites": "https://en.wikipedia.org/wiki/Ear_mite"
    },
    {
        " before entering TNR programs.": null
    },
    {
        "Feral cats in managed colonies can live long lives. A number of cats in managed colonies in the United Kingdom died of old age. In the U.S., the last cat in a managed colony in ": null
    },
    {
        "Washington, D.C.": "https://en.wikipedia.org/wiki/Washington,_D.C."
    },
    {
        ", died at age 17, and Zorro, the last cat of a colony at the ": null
    },
    {
        "Merrimack River": "https://en.wikipedia.org/wiki/Merrimack_River"
    },
    {
        " in ": null
    },
    {
        "Newburyport, Massachusetts": "https://en.wikipedia.org/wiki/Newburyport,_Massachusetts"
    },
    {
        ", died in 2009 at age 16.": null
    },
    {
        "A long-term study of a ": null
    },
    {
        "trap-neuter-return": "https://en.wikipedia.org/wiki/Trap-neuter-return"
    },
    {
        " (TNR) program on a university campus in Central Florida found that, despite widespread concern about the welfare of free-roaming cats, 83% of the cats studied had been present for more than six years, with almost half first observed as adults of unknown age. The authors compare this result to a 1984 study that found the ": null
    },
    {
        "mean": "https://en.wikipedia.org/wiki/Mean"
    },
    {
        " life span for domesticated cats was 7.1 years.": null
    },
    {
        "Feral cats, as with all cats, are susceptible to diseases and infections including ": null
    },
    {
        "rabies": "https://en.wikipedia.org/wiki/Rabies"
    },
    {
        ", ": null
    },
    {
        "bartonellosis": "https://en.wikipedia.org/wiki/Bartonellosis"
    },
    {
        ", ": null
    },
    {
        "toxoplasmosis": "https://en.wikipedia.org/wiki/Toxoplasmosis"
    },
    {
        ", ": null
    },
    {
        "feline panleukopenia virus": "https://en.wikipedia.org/wiki/Feline_panleukopenia"
    },
    {
        ", external and internal parasites, ": null
    },
    {
        "feline immunodeficiency virus": "https://en.wikipedia.org/wiki/Feline_immunodeficiency_virus"
    },
    {
        " (FIV), ": null
    },
    {
        "feline leukemia virus": "https://en.wikipedia.org/wiki/Feline_leukemia_virus"
    },
    {
        " (FeLV), ": null
    },
    {
        "rickettsial diseases": "https://en.wikipedia.org/wiki/Rickettsia"
    },
    {
        ", ": null
    },
    {
        "ringworm": "https://en.wikipedia.org/wiki/Dermatophytosis"
    },
    {
        ", and feline ": null
    },
    {
        "respiratory disease": "https://en.wikipedia.org/wiki/Respiratory_disease"
    },
    {
        " complex (a group of respiratory illnesses including ": null
    },
    {
        "feline herpesvirus type 1": "https://en.wikipedia.org/wiki/Feline_viral_rhinotracheitis"
    },
    {
        ", ": null
    },
    {
        "feline calicivirus": "https://en.wikipedia.org/wiki/Feline_calicivirus"
    },
    {
        ", ": null
    },
    {
        "Chlamydophila felis": "https://en.wikipedia.org/wiki/Chlamydophila_felis"
    },
    {
        ", and ": null
    },
    {
        "Mycoplasma haemofelis": "https://en.wikipedia.org/wiki/Mycoplasma_haemofelis"
    },
    {
        ").": null
    },
    {
        "Feline leukemia virus and feline immunodeficiency virus belong to the ": null
    },
    {
        "Retroviridae": "https://en.wikipedia.org/wiki/Retrovirus"
    },
    {
        " family, and both cause ": null
    },
    {
        "immunosuppression": "https://en.wikipedia.org/wiki/Immunosuppression"
    },
    {
        " in cats, which can increase their susceptibility to other infections. Research has shown that the prevalence of these viruses among feral cat populations is low and is similar to prevalence rates for owned cats in the United States.": null
    },
    {
        "Researchers studying 553 feral cats in Northern ": null
    },
    {
        "Florida": "https://en.wikipedia.org/wiki/Florida"
    },
    {
        " in the United States tested them for a number of infections that could be detrimental to feline or human health. The study found the most prevalent infection to be ": null
    },
    {
        "Bartonella henselae": "https://en.wikipedia.org/wiki/Bartonella_henselae"
    },
    {
        ", the cause of ": null
    },
    {
        "cat-scratch disease": "https://en.wikipedia.org/wiki/Cat-scratch_disease"
    },
    {
        " in humans, with 33.6% of the cats testing positive. ": null
    },
    {
        "Feline coronavirus": "https://en.wikipedia.org/wiki/Feline_coronavirus"
    },
    {
        " was the next most common infection, found in 18.3% of the cats, although they noted that the antibody levels were low in most of the cats who tested positive, and concluded that the cats they tested did not appear to be a greater risk for ": null
    },
    {
        "shedding": "https://en.wikipedia.org/wiki/Viral_shedding"
    },
    {
        " the virus than pet cats. Researchers studying 96 feral cats on ": null
    },
    {
        "Prince Edward Island": "https://en.wikipedia.org/wiki/Prince_Edward_Island"
    },
    {
        " in Canada found that ": null
    },
    {
        "feline roundworm": "https://en.wikipedia.org/wiki/Toxocara_cati"
    },
    {
        " was the most common infection in cats in that colony, afflicting 34% of cats. This was followed by ": null
    },
    {
        "Toxoplasma gondii": "https://en.wikipedia.org/wiki/Toxoplasma_gondii"
    },
    {
        ", which was detected in 29.8% of cats, although only one cat of the 78 for whom fecal samples were available was shedding T. gondii": null
    },
    {
        "oocysts": "https://en.wikipedia.org/wiki/Apicomplexan_life_cycle"
    },
    {
        ". They did note that most fecal samples collected indicated the presence of one ": null
    },
    {
        "intestinal parasite": "https://en.wikipedia.org/wiki/Intestinal_parasite"
    },
    {
        ", with some samples indicating the presence of multiple parasites.": null
    },
    {
        "The ": null
    },
    {
        "Center for Disease Control and Prevention": "https://en.wikipedia.org/wiki/Centers_for_Disease_Control_and_Prevention"
    },
    {
        " has warned about the rabies risk associated with feral cats. With 16% of people infected with rabies from exposure to rabid cats, cats have been the primary animals responsible for transmission of the virus to humans in the United States since the efforts to control rabies in dogs in the 1970s. In 2010, there were 303 rabid cats reported within the United States. Although some colony management programs involve administering ": null
    },
    {
        "rabies vaccines": "https://en.wikipedia.org/wiki/Rabies_vaccine"
    },
    {
        ", the need to revaccinate every few years makes this challenging to maintain. Furthermore, lack of documentation can mean that contact with vaccinated feral cats may still require ": null
    },
    {
        "post-exposure": "https://en.wikipedia.org/wiki/Post-exposure_prophylaxis"
    },
    {
        " treatment.": null
    },
    {
        "The study of feral cats on Prince Edward Island warned of \"considerable ": null
    },
    {
        "zoonotic": "https://en.wikipedia.org/wiki/Zoonosis"
    },
    {
        " risk\" for transmission of intestinal parasites. Although the authors noted that their study did not provide evidence for great risk associated with T. gondii in cats, they advised that the risk should still be considered, as the infection in humans can cause significant health problems, and cats who are not otherwise transmitting the infection can begin shedding the virus in times of stress.": null
    },
    {
        "Feral cats are controlled or managed by various agencies to manage disease, for the protection of native wildlife and to protect their welfare. Control of feral cats can be managed through trapping and euthanasia or other forms of lethal control, or through ": null
    },
    {
        "trap-neuter-return": "https://en.wikipedia.org/wiki/Trap-neuter-return"
    },
    {
        " (TNR).": null
    },
    {
        "Trap-neuter-return involves trapping feral cats, vaccinating, spaying or neutering them, and then returning them to the place where there were originally trapped. In addition to the vaccinations and spay/neuter, cats may receive other medical care, such as dental care and parasite treatment. TNR programs are prevalent in several countries, including England, Italy, Canada, and the United States, and are supported by many ": null
    },
    {
        "local and state governments": "https://en.wikipedia.org/wiki/List_of_governments_supporting_trap-neuter-return"
    },
    {
        ". Proponents of TNR argue that it is effective in stopping reproduction and ": null
    },
    {
        "reducing the population": "https://en.wikipedia.org/wiki/Population_control"
    },
    {
        " over time. TNR results in fewer complaints, as nuisance behaviors diminish following neutering, and the quality of life of the cats is improved. The practice is reported to save money and garner more public support and better morale than efforts that involve killing cats.": null
    },
    {
        "The International Companion Animal Management Coalition advocates for TNR as a humane method of controlling feral cat populations. In the U.S., the practice is endorsed by the ": null
    },
    {
        "Humane Society of the United States": "https://en.wikipedia.org/wiki/Humane_Society_of_the_United_States"
    },
    {
        " and the National Animal Control Association. While the ": null
    },
    {
        "United States Department of Defense": "https://en.wikipedia.org/wiki/United_States_Department_of_Defense"
    },
    {
        " does not formally advocate TNR, it provides information to military installations on how to implement TNR programs, with the main message that population control programs must be humane.": null
    },
    {
        "In 2011, an Australian study emphasised the need to monitor the effects of culling programs after ": null
    },
    {
        "infrared cameras": "https://en.wikipedia.org/wiki/Infrared_camera"
    },
    {
        " found that the culling of feral cats led to an increase in feral cat populations in the culled areas. It was thought that only dominant cats were being baited and trapped during such operations. After the removal of dominant cats, there was an influx of subordinate animals to the area which unlike the dominant cats, did not venture into the traps. Within a year cat numbers in culled areas stabilised to original numbers.": null
    },
    {
        "The effectiveness of both trap-and-euthanise and TNR programmes is largely dependent upon controlling immigration of cats into cleared or controlled areas; where immigration of new cats is controlled both techniques can be effective. However where immigration is not controlled culling is more effective. Comparisons of different techniques have also found that trap-and-euthanise programmes are half the cost of TNR ones. An analysis of both techniques in Hawaii suggested they are less effective when new cats were introduced by the abandonment of pets. The usefulness of TNR is disputed by some scientists and conservation specialists, who argue that TNR is primarily an animal welfare issue and ignores the ongoing damage done by neutered cats in the wild. Some conservation scientists question the effectiveness of TNR at controlling numbers of feral cats. Some studies that have supported TNR have also been criticised for using anecdotal data to evaluate their effectiveness.": null
    },
    {
        "Cats hunt small prey, such as rodents and birds. Free-ranging cats kill one to four billion birds and six to 22 billion mammals annually in the contiguous states of the United States. In Australia, feral cats are estimated to kill more than 800 million mammals (of which 56% are native species) every year.": null
    },
    {
        "Feral cats kill, on average, 1 million reptiles each day in Australia, according to a study published in June 2018 in the journal Wildlife Research.": null
    },
    {
        "Sometimes feral cats kill non-native pests. Feral cats have been intentionally introduced to some areas as a ": null
    },
    {
        "pest": "https://en.wikipedia.org/wiki/Pest_(organism)"
    },
    {
        " control strategy. In the 1800s, thousands of cats were introduced near settlements in Australia that had developed near ": null
    },
    {
        "gold dig": "https://en.wikipedia.org/wiki/Gold_mining"
    },
    {
        " sites and farms as an attempt to manage populations of mice, rabbits, and rats.": null
    },
    {
        "Feral cats have interbred with ": null
    },
    {
        "wildcats": "https://en.wikipedia.org/wiki/Wildcat"
    },
    {
        " to various extents throughout the world, the first reported case occurring more than 200 years ago. The significance of hybridisation is disputed. Modern genetic analysis revealed that the ": null
    },
    {
        "African wildcat": "https://en.wikipedia.org/wiki/African_wildcat"
    },
    {
        " is the origin of the domestic cat.": null
    },
    {
        "Pure ": null
    },
    {
        "Scottish wildcats": "https://en.wikipedia.org/wiki/Scottish_wildcat"
    },
    {
        " are unlikely to exist, but the current wildcat population is distinct enough from domestic cats to be worth protecting.High levels of hybridisation have led to difficulties in distinguishing pure wildcats from feral and domestic cats, which can complicate conservation efforts.": null
    },
    {
        "Trap-neuter-return": "https://en.wikipedia.org/wiki/Trap-neuter-return"
    },
    {
        " programs have been established to prevent hybridisation.": null
    },
    {
        "Notable gene ": null
    },
    {
        "introgression": "https://en.wikipedia.org/wiki/Introgression"
    },
    {
        " into ": null
    },
    {
        "European wildcat": "https://en.wikipedia.org/wiki/European_wildcat"
    },
    {
        " populations exists also in Italy, Hungary, Spain and Portugal.": null
    }
]