[
    {
        "A purr is a tonal fluttering sound made by some species of ": null
    },
    {
        "felids": "https://en.wikipedia.org/wiki/Felid"
    },
    {
        " and two species of ": null
    },
    {
        "genets": "https://en.wikipedia.org/wiki/Genet_(animal)"
    },
    {
        ".  It varies in loudness and tone among species and in the same animal.": null
    },
    {
        "Although true purring is exclusive to felids and ": null
    },
    {
        "viverrids": "https://en.wikipedia.org/wiki/Viverrids"
    },
    {
        ", other animals such as ": null
    },
    {
        "raccoons": "https://en.wikipedia.org/wiki/Raccoons"
    },
    {
        " produce purr-like vocalization. Animals that produce purr-like sounds include ": null
    },
    {
        "mongoose": "https://en.wikipedia.org/wiki/Mongoose"
    },
    {
        ", ": null
    },
    {
        "bears": "https://en.wikipedia.org/wiki/Bear"
    },
    {
        ", ": null
    },
    {
        "badgers": "https://en.wikipedia.org/wiki/Badger"
    },
    {
        ", ": null
    },
    {
        "foxes": "https://en.wikipedia.org/wiki/Fox"
    },
    {
        ", ": null
    },
    {
        "hyaenas": "https://en.wikipedia.org/wiki/Hyena"
    },
    {
        ", ": null
    },
    {
        "rabbits": "https://en.wikipedia.org/wiki/Rabbit"
    },
    {
        ", ": null
    },
    {
        "squirrels": "https://en.wikipedia.org/wiki/Squirrels"
    },
    {
        ", ": null
    },
    {
        "guinea pigs": "https://en.wikipedia.org/wiki/Guinea_pig"
    },
    {
        ", ": null
    },
    {
        "tapirs": "https://en.wikipedia.org/wiki/Tapirs"
    },
    {
        ", ring-tailed ": null
    },
    {
        "lemurs": "https://en.wikipedia.org/wiki/Lemurs"
    },
    {
        ", and ": null
    },
    {
        "gorillas": "https://en.wikipedia.org/wiki/Gorilla"
    },
    {
        " while eating.": null
    },
    {
        "The mechanism by which cats purr is an object of speculation. There is a unique “": null
    },
    {
        "neural oscillator": "https://en.wikipedia.org/wiki/Neural_oscillation"
    },
    {
        "” in the cat’s brain of uncertain significance.": null
    },
    {
        "One hypothesis, backed by ": null
    },
    {
        "electromyographic": "https://en.wikipedia.org/wiki/Electromyographic"
    },
    {
        " studies, is that cats produce the purring noise by using the ": null
    },
    {
        "vocal folds": "https://en.wikipedia.org/wiki/Vocal_folds"
    },
    {
        " or the muscles of the ": null
    },
    {
        "larynx": "https://en.wikipedia.org/wiki/Larynx"
    },
    {
        " to alternately dilate and constrict the ": null
    },
    {
        "glottis": "https://en.wikipedia.org/wiki/Glottis"
    },
    {
        " rapidly, causing air vibrations during inhalation and exhalation. Combined with the steady inhalation and exhalation of air as the cat breathes, a purring noise is produced with strong ": null
    },
    {
        "harmonics": "https://en.wikipedia.org/wiki/Harmonics"
    },
    {
        ".": null
    },
    {
        "No cat can both purr and roar. The subdivision of the Felidae into “purring cats” on one hand, and “roaring cats” on the other, goes back to Owen (1834/1835) and was definitively introduced by Pocock (1916), based on whether the ": null
    },
    {
        "hyoid bone": "https://en.wikipedia.org/wiki/Hyoid_bone"
    },
    {
        " of the ": null
    },
    {
        "larynx": "https://en.wikipedia.org/wiki/Larynx"
    },
    {
        " is incompletely (“roarers”) or completely (“purrers”) ": null
    },
    {
        "ossified": "https://en.wikipedia.org/wiki/Ossified"
    },
    {
        ". However, Weissengruber et al. (2002) argued that the ability of a cat species to purr is not affected by the anatomy of its hyoid.": null
    },
    {
        "The “roaring cats” (lion, Panthera leo; tiger, P. tigris; jaguar, P. onca; leopard, P. pardus) have an incompletely ossified hyoid, which according to this theory, enables them to roar but not to purr. However, the ": null
    },
    {
        "snow leopard": "https://en.wikipedia.org/wiki/Snow_leopard"
    },
    {
        " (Uncia uncia, or P. uncia), as the fifth felid species with an incompletely ossified hyoid, purrs (Hemmer, 1972).": null
    },
    {
        "All remaining species of the family Felidae (‘purring cats’) have a completely ossified hyoid, which enables them to purr but not to roar. Based on a technical acoustic definition of roaring, the presence of this vocalization type depends on specific characteristics of the vocal folds and an elongated vocal tract, which  is rendered possible by an incompletely ossified hyoid.": null
    },
    {
        "Purring may have developed as an evolutionary advantage as a signalling mechanism of reassurance between mother cats and ": null
    },
    {
        "nursing": "https://en.wikipedia.org/wiki/Breastfeeding"
    },
    {
        " kittens. Post-nursing cats often purr as a sign of contentment: when being petted, becoming relaxed, or eating. Some purring may be a signal to another animal that the purring cat does not pose a threat.": null
    },
    {
        "Purring sometimes seems to be a way for cats to signal their caretakers for food. This purring  has a high-frequency component not present in other purrs. This variety of purring seems to be found more frequently in cats in a one-to-one relationship with a caretaker.": null
    },
    {
        "Cats often purr when distressed or in pain, such as in labour.This purring may trigger a cat's brain to release a hormone which helps it in relaxing and acts as a ": null
    },
    {
        "painkiller": "https://en.wikipedia.org/wiki/Painkiller"
    },
    {
        ". Purring may also be a healing mechanism to offset long periods of rest and sleep that would otherwise contribute to a loss of bone density. The vibrations and contractions of a purr show a consistent pattern and frequency around 25 Hz; these frequencies have been shown to improve bone density and promote healing in animal models and humans.": null
    }
]