[
    {
        "Habituation is a form of non-associative learning in which an innate (non-reinforced) response to a ": null
    },
    {
        "stimulus": "https://en.wikipedia.org/wiki/Stimulation"
    },
    {
        " decreases after repeated or prolonged presentations of that stimulus. Responses that habituate include those that involve the intact organism (e.g., full-body startle response) or those that involve only components of the organism (e.g., habituation of neurotransmitter release from in vitro Aplysia sensory neurons). The broad ubiquity of habituation across all biologic phyla has resulted in it being called \"the simplest, most universal form of learning...as fundamental a characteristic of life as DNA.\"  Functionally-speaking, by diminishing the response to an inconsequential stimulus, habituation is thought to free-up cognitive resources to other stimuli that are associated with biologically important events (i.e., punishment/reward). For example, organisms may habituate to repeated sudden loud noises when they learn these have no consequences.  A progressive decline of a behavior in a habituation procedure may also reflect nonspecific effects such as ": null
    },
    {
        "fatigue": "https://en.wikipedia.org/wiki/Fatigue_(medical)"
    },
    {
        ", which must be ruled out when the interest is in habituation. Habituation may also be clinically relevant, as a number of neuropsychiatric conditions, including autism, ": null
    },
    {
        "schizophrenia": "https://en.wikipedia.org/wiki/Schizophrenia"
    },
    {
        ", ": null
    },
    {
        "migraine": "https://en.wikipedia.org/wiki/Migraine"
    },
    {
        ", and ": null
    },
    {
        "Tourette's": "https://en.wikipedia.org/wiki/Tourette_syndrome"
    },
    {
        ", show reductions in habituation to a variety of stimulus-types both simple (tone) and complex (faces).": null
    },
    {
        "There is an additional connotation to the term habituation which applies to psychological dependency on drugs, and is included in several online dictionaries. A team of specialist from the ": null
    },
    {
        "World Health Organization": "https://en.wikipedia.org/wiki/World_Health_Organization"
    },
    {
        " assembled in 1957 to address the problem of drug addiction and adopted  the term \"drug habituation\" to distinguish some drug-use behaviors from drug addiction. According to the WHO lexicon of alcohol and drug terms, habituation is defined as \"becoming accustomed to any behavior or condition, including psychoactive substance use\". By 1964 the America Surgeon's General report on smoking and health included four features that characterize drug habituation according to WHO: 1) \"a desire (but not a compulsion) to continue taking the drug for the sense of improved well-being which it engenders\"; 2) \"little or no tendency to increase the dose\"; 3) \"some degree of psychic dependence on the effect of the drug, but absence of physical dependence and hence of an abstinence syndrome\"; 4) \"detrimental effects, if any, primarily on the individual\". However, also in 1964, a committee from the World Health Organization once again convened and decided the definitions of drug habituation and drug addiction were insufficient, replacing the two terms with \"drug dependence\". ": null
    },
    {
        "Substance dependence": "https://en.wikipedia.org/wiki/Substance_dependence"
    },
    {
        " is the preferred term today when describing drug-related disorders, whereas the use of the term drug habituation has declined substantially. This is not to be confused with true habituation to drugs, wherein repeated doses have an increasingly diminished effect, as is often seen in addicts or persons taking painkillers frequently.": null
    },
    {
        "Habituation as a form of non-": null
    },
    {
        "associative learning": "https://en.wikipedia.org/wiki/Associative_learning"
    },
    {
        " can be distinguished from other behavioral changes (e.g., sensory/": null
    },
    {
        "neural adaptation": "https://en.wikipedia.org/wiki/Neural_adaptation"
    },
    {
        ", fatigue) by considering the characteristics of habituation that have been identified over several decades of research. The characteristics first described by ": null
    },
    {
        "Thompson": "https://en.wikipedia.org/wiki/Richard_F._Thompson"
    },
    {
        " and Spencer have recently been updated and include the following:": null
    },
    {
        "Repeated presentation of a stimulus will cause a decrease in reaction to the stimulus. Habituation is also proclaimed to be a form of implicit learning, which is commonly the case with continually repeated stimuli. This characteristic is consistent with the definition of habituation as a procedure, but to confirm habituation as a process, additional characteristics must be demonstrated. Also observed is spontaneous recovery. That is, a habituated response to a stimulus recovers (increases in magnitude) when a significant amount of time (hours, days, weeks) passes between stimulus presentations.": null
    },
    {
        "\"Potentiation of habituation\" is observed when tests of spontaneous recovery are given repeatedly. In this phenomenon, the decrease in responding that follows spontaneous recovery becomes more rapid with each test of spontaneous recovery. Also noted was that an increase in the frequency of stimulus presentation (i.e., shorter ": null
    },
    {
        "interstimulus interval": "https://en.wikipedia.org/wiki/Interstimulus_interval"
    },
    {
        ") will increase the rate of habituation. Furthermore, continued exposure to the stimulus after the habituated response has plateaued (i.e., show no further decrement) may have additional effects on subsequent tests of behavior such as delaying spontaneous recovery. The concepts of stimulus generalization and stimulus discrimination will be observed. Habituation to an original stimulus will also occur to other stimuli that are similar to the original stimulus (stimulus generalization). The more similar the new stimulus is to the original stimulus, the greater the habituation that will be observed. When a subject shows habituation to a new stimulus that is similar to the original stimulus but not to a stimulus that is different from the original stimulus, then the subject is showing stimulus discrimination. (For example, if one was habituated to the taste of lemon, their responding would increase significantly when presented with the taste of lime). Stimulus discrimination can be used to rule out sensory adaptation and fatigue as an alternative explanation of the habituation process.": null
    },
    {
        "Another observation mentioned is when a single introduction of a different stimulus late in the habituation procedure when responding to the eliciting stimulus has declined can cause an increase in the habituated response. This increase in responding is temporary and is called \"": null
    },
    {
        "dishabituation": "https://en.wikipedia.org/wiki/Dishabituation"
    },
    {
        "\" and always occurs to the original eliciting stimulus (not to the added stimulus). Researchers also use evidence of dishabituation to rule out sensory adaptation and fatigue as alternative explanations of the habituation process. Habituation of dishabituation can occur. The amount of dishabituation that occurs as a result of the introduction of a different stimulus can decrease after repeated presentation of the \"dishabituating\" stimulus.": null
    },
    {
        "Some habituation procedures appear to result in a habituation process that last days or weeks. This is considered long-term habituation. It persists over long durations of time (i.e., shows little or no spontaneous recovery). Long-term habituation can be distinguished from short-term habituation which is identified by the nine characteristics listed above.": null
    },
    {
        "Habituation can refer to a decrease in behavior, subjective experience, or synaptic transmission.  The changes in synaptic transmission that occur during habituation have been well-characterized in the ": null
    },
    {
        "Aplysia gill and siphon withdrawal reflex": "https://en.wikipedia.org/wiki/Aplysia_gill_and_siphon_withdrawal_reflex"
    },
    {
        ".": null
    },
    {
        "Habituation has been shown in essentially every species of animal and at least, in one species of plants (Mimosa pudica), in isolated neuronally-differentiated cell-lines, as well as in quantum perovskite.  The experimental investigation of simple organisms such as the large protozoan ": null
    },
    {
        "Stentor coeruleus": "https://en.wikipedia.org/wiki/Stentor_coeruleus"
    },
    {
        " provides an understanding of the cellular mechanisms that are involved in the habituation process.": null
    },
    {
        "Within psychology, habituation has been studied through different forms of neuroimaging like ": null
    },
    {
        "PET scan": "https://en.wikipedia.org/wiki/Positron_emission_tomography"
    },
    {
        " and ": null
    },
    {
        "fMRI": "https://en.wikipedia.org/wiki/FMRI"
    },
    {
        ". Habituation is observed after repeated presentations of stimuli. Within fMRI, the stimuli's effect is measured using blood oxygen level-dependent (BOLD) signals. Long-term decreases of the BOLD signal are interpreted as habituation, and long-term increases of the BOLD signal are interpreted as sensitization.": null
    },
    {
        "The ": null
    },
    {
        "amygdala": "https://en.wikipedia.org/wiki/Amygdala"
    },
    {
        " is one of the most-studied areas of the brain in relation to habituation. A common approach is to observe the visual processing of facial expressions. A study by Breiter and colleagues used fMRI scans to identify which areas of the brain habituate and at what rate. Their results showed that the human amygdala responds and rapidly habituates preferentially to fearful facial expressions over neutral ones. They also observed significant amygdala signal changes in response to happy faces over neutral faces.": null
    },
    {
        "Blackford, Allen, Cowan, and Avery (2012) compared the effect of an extremely inhibited temperament and an extremely uninhibited temperament on habituation. Their study found that over repeated presentations individuals with an uninhibited temperament demonstrated habituation in both the amygdala and ": null
    },
    {
        "hippocampus": "https://en.wikipedia.org/wiki/Hippocampus"
    },
    {
        ", whereas participants with an inhibited temperament demonstrated habituation in neither brain region. The researchers suggest that this failure to habituate reflects a social learning deficit in individuals with an extremely inhibited temperament, which is a possible mechanism for a higher risk of social anxiety.": null
    },
    {
        "Although habituation has been regarded as a learning process by some as early as 1887, its learning status remained controversial up until the 1920s - 1930s. While conceding that reflexes may \"relax\" or otherwise decrease with repeated stimulation, the \"invariance doctrine\" stipulated that reflexes should not remain constant and that variable reflexes were a pathological manifestation. Indeed, air pilots who showed habituation of post-rotational nystagmus reflex were sometimes ejected from or not recruited for service for World War I: on the grounds that that a variable reflex response indicated either a defective vestibular apparatus or a lack of vigilance. Eventually, however, more research from the medical and scientific communities concluded that stimulus-dependent variability reflexes is clinically normal. The opposition to the considering habituation a form of learning was also based on the assumption that learning processes must produce novel behavioral responses and must occur in the cerebral cortex. Non-associative forms of learning such as habituation (and sensitization) do not produce novel (conditioned) responses but rather diminish a pre-existing (innate) responses and often are shown to depend on peripheral (non-cerebral) synaptic changes in the sensory-motor pathway. Most modern learning theorists, however, consider any behavioral change that occurs as a result of experience to be learning, so long as it cannot be accounted for by motor fatigue, sensory adaption, developmental changes or damage.": null
    },
    {
        "Criteria for verifying a response-decline as learning": null
    },
    {
        "Importantly, systematic response-declines can be produced by non-learning factors such as sensory adaptation (obstruction of stimulus detection), motor fatigue, or damage. Three diagnostic criteria are used to distinguish response-declines produced by these non-learning factors and response-declines produced by habituation (learning) processes. These are:": null
    },
    {
        "Early studies relied on the demonstration of 1) Recovery by Dishabituation (the brief recovery of the response to the eliciting stimulus when another stimulus is added) to distinguish habituation from sensory adaptation and fatigue. More recently, 2) Sensitivity of Spontaneous Recovery to Rate-of-Stimulation and 3) Stimulus-specificity have been used as experimental evidence for the habituation process.  Spontaneous Recovery is sensitive to spontaneous recovery, showing recovery that is inversely correlated with the amount of response-decline. This is the opposite of what would be expected if sensory adaption or motor fatigue were the cause of the response-decline. Sensory adaptation (or ": null
    },
    {
        "neural adaptation": "https://en.wikipedia.org/wiki/Neural_adaptation"
    },
    {
        ") occurs when an organism can no longer detect the stimulus as efficiently as when first presented and motor fatigue occurs when an organism is able to detect the stimulus but can no longer respond efficiently. Stimulus-specificity stipulates that the response-decline is not general (due to motor fatigue) but occurs only to the original stimulus that was repeated. If a response-decline shows 1) dishabituation, 2) spontaneous recovery that is inversely correlated with the extent of decline, and/or 3) stimulus-specificity, then habituation learning is supported.  ": null
    },
    {
        "Despite the ubiquity of habituation and its modern acceptance as a genuine form of learning it has not enjoyed the same focus within research as other forms of learning. On this topic, the animal psychologist ": null
    },
    {
        "James McConnell": "https://en.wikipedia.org/wiki/James_V._McConnell"
    },
    {
        " said “...nobody cares…much about habituation”). It has been suggested that the apathy held towards habituation is due to 1) resistance from traditional learning theorists maintain memory requires reproduction of propositional/linguistic; 2) resistance from behaviorists who maintain that \"true\" learning requires the development of a novel response (whereas habituation is a decrease in a pre-existing response); 3) the behavioral measure of habituation (i.e., a response-decline) is very susceptible to confound by non-learning factors (e.g., fatigue) which, therefore, make it more difficult to study (reviewed in). ": null
    },
    {
        "Various models have been proposed to account for habituation including the Stimulus-Model Comparator theory formulated by Evgeny Sokolov, the Groves and Thompson dual-process theory, and the SOP (Standard Operating Procedures/Sometimes Opponent Process) model formulated by Allan Wagner. ": null
    },
    {
        "The stimulus-model comparator theory emerged from the research of Sokolov who used the ": null
    },
    {
        "orienting response": "https://en.wikipedia.org/wiki/Orienting_response"
    },
    {
        " as the cornerstone of his studies, and operationally defining the orienting response as ": null
    },
    {
        "EEG": "https://en.wikipedia.org/wiki/Eeg"
    },
    {
        " activity. Orienting responses are heightened sensitivity experienced by an organism when exposed to a new or changing stimulus. Orienting responses can result in overt, observable behaviors as well as psychophysiological responses such as  EEG activity and undergo habituation with repeated presentation of the eliciting stimulus. The Sokolov model assumes that when a stimulus is experienced several times, the nervous system creates a model of the expected stimulus (a stimulus model). With additional presentations of the stimulus, the experienced stimulus is compared with the stimulus model. If the experienced stimulus matches the stimulus model, responding is inhibited. At first the stimulus model is not a very good representation of the presented stimulus, and thus responding continues because of this mismatch. With additional presentations the stimulus model is improved, there is no longer a mismatch, and responding is inhibited causing habituation. However, if the stimulus is changed so that it no longer matches the stimulus model, the orienting response is no longer inhibited. Sokolov locates the stimulus model in the cerebral cortex.": null
    },
    {
        "The Groves and Thompson dual-process theory of habituation posits that two separate processes exist in the central nervous system that interacts to produce habituation. The two distinct processes  are a habituation process  and a sensitization process. The dual-process theory argues that  all noticeable stimuli will elicit both of these processes and that the behavioral output will reflect  a summation of both processes. The habituation process is decremental, whereas the sensitization process is incremental enhancing the tendency to respond. Thus when the habituation process exceeds the sensitization process behavior shows habituation, but if the sensitization process exceeds the habituation process, behavior shows sensitization. Groves and Thompson hypothesize  the existence of two neural pathways: an \"S-R pathway\" involved with the habituation process, and a \"state pathway\" involved with sensitization. The state system is seen as equivalent to a general state of arousal.": null
    },
    {
        "Habituation has been observed in an enormously wide range of species from motile single-celled organisms such as the amoeba and Stentor coeruleus to sea slugs to humans. Habituation processes are adaptive, allowing animals to adjust their innate behaviors to changes in their natural world. A natural animal instinct, for example,  is to protect themselves and their territory from any danger and potential predators. An animal needs to respond quickly to the sudden appearance of a predator. What may be less obvious is the importance of defensive responses to the sudden appearance of any new, unfamiliar stimulus, whether it is dangerous or not. An initial defensive response to a new stimulus is important because if an animal fails to respond to a potentially dangerous unknown stimulus, the results could be deadly. Despite this initial, innate defensive response to an unfamiliar stimulus, the response becomes habituated if the stimulus repeatedly occurs but causes no harm.  An example of this is the prairie dog habituating to humans. Prairie dogs give alarm calls when they detect a potentially dangerous stimulus.  This defensive call occurs when any mammal, snake, or large bird approaches them. However, they habituate to noises, such as human footsteps, that occur repeatedly but result in no harm to them. If prairie dogs never habituate to nonthreatening stimuli, they would be constantly sending out alarm calls and wasting their time and energy. However, the habituation process in prairie dogs  may depend on several factors including the particular defensive response. In one study that measured several different responses to the repeated presence of humans, the alarm calls of prairie dogs showed habituation whereas the behavior of escaping into their burrows showed sensitization.": null
    },
    {
        "Another example of the importance of habituation in the animal world is provided by a study with harbor seals. In one study researchers measured the responses of harbor seals to underwater calls of different types of killer whales. The seals showed a strong response when they heard the calls of mammal-eating killer whales. However, they did not respond strongly when hearing familiar calls of the local fish-eating population.  The seals, therefore, are capable of habituating to the calls of harmless predators, in this case harmless killer whales. While some researchers prefer to simply describe the adaptive value of observable habituated behavior, others find it useful to infer psychological processes from the observed behavior change. For example, habituation of aggressive responses in male bullfrogs has been explained as \"an attentional or learning process that allows animals to form enduring mental representations of the physical properties of a repeated stimulus and to shift their focus of attention away from sources of irrelevant or unimportant stimulation\".": null
    },
    {
        "Habituation of innate defensive behaviors is also adaptive in humans, such as habituation of a startle response to a sudden loud noise. But habituation is much more ubiquitous even in humans. An example of habituation that is an essential element of everyone's life is the changing response to food as it is repeatedly experienced during a meal. When people eat the same food during a meal, they begin to respond less to the food as they become habituated to the motivating properties of the food and decrease their consumption. Eating less during a meal is usually interpreted as reaching satiety or \"getting full\", but experiments suggest that habituation also plays an important role.  Many experiments with animals and humans have shown that providing variety in a meal increases the amount that is consumed in a meal, most likely because habituation is stimulus specific and because variety may introduce dishabituation effects.  Food variety also slows the rate of habituation in children and may be an important contributing factor to the recent increases in obesity.": null
    },
    {
        "We also find that habituation is found in our emotional responses, called the ": null
    },
    {
        "opponent-process theory": "https://en.wikipedia.org/wiki/Opponent-process_theory"
    },
    {
        ", proposed by researchers Richard Solomon and John Corbit (1974). It is known that responses by the subject tends to change by repetitively presenting certain stimuli. But concerning the opponent-process theory, some emotional reactions to the stimuli weaken (decrease) while others reactions are strengthened (increase). Take for example, that is the end of the semester at your university. You have been worried about your grade for the entire semester and you need to make  an A on the final in order to pass the course. You study efficiently for the test and after taking it, you feel that you will receive a very high grade. But once you check the gradebook, you see that you did not get an A on your exam. Instead you received a C+. Now you are distraught and know that there is no other way to pass the course for the semester. After a few minutes you begin to calm down and by the next hour you are back to your normal emotional state. This is an example of an emotional response explained by the opponent-process theory. It begins with an outside stimulus provoking an emotional reaction that increases rapidly until it is at its most intense (presumably after you learned that you did not receive a high letter grade). Gradually, your emotional state declines to a level lower than normal and eventually returns to neutral. This pattern coincides with two internal processes referred to as the a-process and b-process. The a-process, or \"affective\" response to a stimulus, is the initial emotional response one has and can be pleasant or unpleasant. The b-process is the after reaction and has a lower intensity than the a-process. The a-process is very fast-acting and ends as soon as the stimulus ends or is removed. Unlike the a-process, b-process is much slower in returning to baseline. Concerning the definition of the opponent process theory—repeated presentations present habituation—the a-process does not necessarily change. It is the b-process that is strengthened instead and rises more quickly to reach the highest intensity, and much slower in attempting to return to baseline after the stimulus is removed. To sum it all up, with the opponent-process theory, repeated presentations of the same stimulus will result in habituation, where subjects show little to no reaction. It is the after-reaction that is much larger and prolonged, than if an initial reaction to a stimulus occurred.": null
    },
    {
        "Habituation abnormalities have been repeatedly observed in a variety of neuropsychiatric conditions including ": null
    },
    {
        "autism spectrum disorder": "https://en.wikipedia.org/wiki/Autism-spectrum_disorder"
    },
    {
        " (ASD), ": null
    },
    {
        "fragile X syndrome": "https://en.wikipedia.org/wiki/Fragile_X_syndrome"
    },
    {
        ", schizophrenia, ": null
    },
    {
        "Parkinson's disease": "https://en.wikipedia.org/wiki/Parkinson%27s_disease"
    },
    {
        " (PD), ": null
    },
    {
        "Huntington's disease": "https://en.wikipedia.org/wiki/Huntington%27s_disease"
    },
    {
        " (HD), ": null
    },
    {
        "attention deficit hyperactivity disorder": "https://en.wikipedia.org/wiki/Attention_deficit_hyperactivity_disorder"
    },
    {
        " (ADHD), Tourette’s syndrome (TS), and migraine. In human clinical studies, habituation is most often studied using the acoustic startle reflex; acoustic tones are delivered to participants through headphones and the subsequent eye-blink response is recorded directly by observation or by ": null
    },
    {
        "electromyography": "https://en.wikipedia.org/wiki/Electromyography"
    },
    {
        " (EMG). Depending on the disorder, habituation phenomena have been implicated as a cause, symptom, or therapy. Reduced habituation is the most common habituation phenotype reported across neuropsychiatric disorders although enhanced habituation has been observed in HD and ADHD. It also appears that abnormal habituation is often predictive of symptom severity in several neuropsychiatric disorders, including ASD, PD, and HD. Moreover, there are instances where treatments that normalise the habituation-deficit also improve other associated symptoms. As a therapy, habituation processes have been hypothesized to underlie the efficacy of behavioural therapies (i.e. ": null
    },
    {
        "habit reversal training": "https://en.wikipedia.org/wiki/Habit_reversal_training"
    },
    {
        ", ": null
    },
    {
        "exposure therapy": "https://en.wikipedia.org/wiki/Exposure_therapy"
    },
    {
        ") for TS and ": null
    },
    {
        "PTSD": "https://en.wikipedia.org/wiki/Posttraumatic_stress_disorder"
    },
    {
        ", although extinction processes may be operating instead. ": null
    },
    {
        "Habituation procedures are used by researchers for many reasons. For example, in a study on aggression in female chimpanzees from a group known as the \"": null
    },
    {
        "Kasakela Chimpanzee Community": "https://en.wikipedia.org/wiki/Kasakela_Chimpanzee_Community"
    },
    {
        "\", researchers habituated the chimpanzees by repeatedly exposing them to the presence of human beings. Their efforts to habituate the chimpanzees before the field researchers studied the animal's behavior was necessary in order for them to eventually be able to note the natural behavior of the chimpanzees, instead of simply noting chimpanzee behavior as a response to the presence of the researchers. In another study, Mitumba chimpanzees in the Gombe National Park were habituated for at least four years before the introduction of systematic data collection.": null
    },
    {
        "Researchers also use habituation and dishabituation procedures in the laboratory to study the perceptual and cognitive capabilities of human infants. The presentation of a visual stimulus to an infant elicits  looking behavior that habituates with repeated presentations of the stimulus. When changes to the habituated stimulus are made (or a new stimulus is introduced), the looking behavior returns (dishabituates). A recent fMRI study revealed  that the presentation of a dishabituating stimulus  has an observable, physical effect upon the brain. In one study the mental spatial representations of infants were assessed using the phenomenon of dishabituation. Infants were presented repeatedly with an object in the same position on a table. Once the infants habituated to the object (i.e., spent less time looking at it) either the object was spatially moved while the infant remained at the same place near the table or the object was left in the same place but the infant was moved to the opposite side of the table. In both cases the spatial relationship between the object and the infant had changed, but only in the former case did the object itself move. Would the infants know the difference? Or would they treat both cases as if the object itself moved?  The results revealed a return of looking behavior (dishabituation) when the object's position was changed, but not when the infant's position was changed.   Dishabituation indicates that infants perceived a significant change in the stimulus. Therefore, the infants understood when the object itself moved  and when it did not. Only when the object itself moved were they interested in it again (dishabituation). When the object remained in the same position as before it was perceived as the same old boring thing (habituation). In general, habituation/dishabituation procedures help researchers determine the way infants perceive their environments.": null
    },
    {
        "Habitation is a useful primary tool for then assessing mental processes in the stages of infancy. The purpose for these tests, or paradigms records looking time, which is the baseline measurement. Habituation of looking time helps to assess certain child capabilities such as: memory, sensitivity, and helps the baby recognize certain abstract properties. Habituation is also found to be influenced by unchangeable factors such as infant age, gender, and complexity of the stimulus. (Caron & Caron, 1969; Cohen, DeLoache, & Rissman, 1975; Friedman, Nagy, & Carpenter, 1970; Miller, 1972; Wetherford & Cohen, 1973). ": null
    },
    {
        "Though there are various challenges that come with habituation. Some infants have preferences for some stimuli based on its' static or dynamic properties. Infant dishabituation also is not perceived at a direct measure for mental processes as well. In previous theories of habituation, a infant's dishabituation was though to represent their own realization of the remembered stimulus of stimuli. For example: if infants would be dishabitutated to a certain color item to a new item, we would know that they remembered the color and compared the two colors for differences. Also another challenge that comes with habituation is the dichotomy of novelty vs familiar stimuli. If an infant preferred a novel still, this meant the infant observed the new spatial relation of the object, but not the object itself. If an infant preferred familiarity, the infant would notice the pattern of the stimuli, instead of the actual new stimuli. ": null
    },
    {
        "The habituation/dishabituation procedure is also used to discover the resolution of perceptual systems. For instance, by habituating someone to one stimulus, and then observing responses to similar ones, one can detect the smallest degree of difference that is detectable.": null
    }
]