[
    {
        "Dogs": "https://en.wikipedia.org/wiki/Dog"
    },
    {
        " and ": null
    },
    {
        "cats": "https://en.wikipedia.org/wiki/Cat"
    },
    {
        " have a range of interactions. The natural instincts of each species lead towards antagonistic interactions, though individual animals can have non-aggressive relationships with each other, particularly under conditions where ": null
    },
    {
        "humans have socialized": "https://en.wikipedia.org/wiki/Animal_training"
    },
    {
        " non-aggressive behaviors. ": null
    },
    {
        "The generally aggressive interactions between the species have been noted in cultural expressions. In domestic homes where dog and cat are reared and trained properly, they tend to relate well with each other especially when their owner is taking good care of them.": null
    },
    {
        "The signals and behaviors that ": null
    },
    {
        "cats": "https://en.wikipedia.org/wiki/Cat_communication"
    },
    {
        " and ": null
    },
    {
        "dogs": "https://en.wikipedia.org/wiki/Dog_behavior"
    },
    {
        " use to communicate are different and can lead to signals of aggression, fear, dominance, friendship or territoriality being misinterpreted by the other species. Dogs have a natural instinct to chase smaller animals that flee, an instinct common among cats. Most cats flee from a dog, while others take actions such as hissing, arching their backs and swiping at the dog. After being scratched by a cat, some dogs can become fearful of cats.": null
    },
    {
        "If appropriately socialized, cats and dogs may have relationships that are not antagonistic, and dogs raised with cats may prefer the presence of cats to other dogs. Even cats and dogs that have got along together in the same household may revert to aggressive reactions due to external stimuli, illness, or play that escalates.": null
    },
    {
        "The phrase \"fight like cats and dogs\" reflects a natural tendency for the relationship between the two species to be antagonistic. Other phrases and ": null
    },
    {
        "proverbs": "https://en.wikipedia.org/wiki/Proverb"
    },
    {
        " include \"The cat is mighty dignified until the dog comes by\" and \"The cat and dog may kiss, but are none the better friends.\"": null
    },
    {
        "A Russian legend explains the antipathy between dogs and cats by stating that the devil has tricked the dog and cat each into thinking the other has its rightful fur.": null
    },
    {
        "Eugene Field": "https://en.wikipedia.org/wiki/Eugene_Field"
    },
    {
        "'s children's poem, \"The Duel,\" projects and amplifies the real-life antipathy between cats and dogs onto a stuffed gingham dog and a stuffed calico cat who had an all-night fight during which they \"ate each other up.\" In ": null
    },
    {
        "Fam Ekman": "https://en.wikipedia.org/wiki/Fam_Ekman"
    },
    {
        "'s children's book Kattens Skrekk (The Cat's Terror), a cat visits a museum to find that all of the artworks, like ": null
    },
    {
        "Mona Lisa": "https://en.wikipedia.org/wiki/Mona_Lisa"
    },
    {
        " and ": null
    },
    {
        "Venus de Milo": "https://en.wikipedia.org/wiki/Venus_de_Milo"
    },
    {
        ", have been replaced by parodies featuring dogs. The only piece not converted is ": null
    },
    {
        "The Scream": "https://en.wikipedia.org/wiki/The_Scream"
    },
    {
        " which \"symbolizes the cat's terror in the face of so many dogs.\" The American animated television series ": null
    },
    {
        "CatDog": "https://en.wikipedia.org/wiki/CatDog"
    },
    {
        " featured the adventures of the protagonist, CatDog, a genetically altered creature that had the head of a dog on one side of its body and the head of a cat on the other. The episodes frequently played on \"cats and dogs being what they are\" to incorporate \"a lot of running and chasing.\"": null
    },
    {
        "The comedy films ": null
    },
    {
        "Cats & Dogs": "https://en.wikipedia.org/wiki/Cats_%26_Dogs"
    },
    {
        ", released in 2001, and its sequel ": null
    },
    {
        "Cats & Dogs: The Revenge of Kitty Galore": "https://en.wikipedia.org/wiki/Cats_%26_Dogs:_The_Revenge_of_Kitty_Galore"
    },
    {
        ", released in 2010, both projected and amplified the above-mentioned antipathy between dogs and cats into an all-out war between the two species wherein cats are shown as being out-and-out enemies of humans, whereas dogs are shown as being more sympathetic to humans.": null
    },
    {
        "Adlai Stevenson": "https://en.wikipedia.org/wiki/Adlai_Stevenson_II"
    },
    {
        " invoked the dog-cat conflict in his explanation of a veto he delivered as governor of ": null
    },
    {
        "Illinois": "https://en.wikipedia.org/wiki/Illinois"
    },
    {
        ": \"If we attempt to resolve [this problem] by legislation, who knows but what we may be called upon to take sides as well in the age-old problems of dog versus cat, bird versus bird, even bird versus worm.\" (Bartleby's, 1989)": null
    }
]