[
    {
        "Arthritis is a term often used to mean any disorder that affects ": null
    },
    {
        "joints": "https://en.wikipedia.org/wiki/Joints"
    },
    {
        ".": null
    },
    {
        "Symptoms": "https://en.wikipedia.org/wiki/Symptoms"
    },
    {
        " generally include ": null
    },
    {
        "joint pain": "https://en.wikipedia.org/wiki/Joint_pain"
    },
    {
        " and stiffness. Other symptoms may include redness, warmth, ": null
    },
    {
        "swelling": "https://en.wikipedia.org/wiki/Joint_effusion"
    },
    {
        ", and decreased ": null
    },
    {
        "range of motion": "https://en.wikipedia.org/wiki/Range_of_motion"
    },
    {
        " of the affected joints. In some types of arthritis, other organs are also affected. Onset can be gradual or sudden.": null
    },
    {
        "There are over 100 types of arthritis. The most common forms are ": null
    },
    {
        "osteoarthritis": "https://en.wikipedia.org/wiki/Osteoarthritis"
    },
    {
        " (degenerative joint disease) and ": null
    },
    {
        "rheumatoid arthritis": "https://en.wikipedia.org/wiki/Rheumatoid_arthritis"
    },
    {
        ". Osteoarthritis usually occurs with age and affects the fingers, knees, and hips. Rheumatoid arthritis is an ": null
    },
    {
        "autoimmune disorder": "https://en.wikipedia.org/wiki/Autoimmune_disorder"
    },
    {
        " that often affects the hands and feet. Other types include ": null
    },
    {
        "gout": "https://en.wikipedia.org/wiki/Gout"
    },
    {
        ", ": null
    },
    {
        "lupus": "https://en.wikipedia.org/wiki/Lupus"
    },
    {
        ", ": null
    },
    {
        "fibromyalgia": "https://en.wikipedia.org/wiki/Fibromyalgia"
    },
    {
        ", and ": null
    },
    {
        "septic arthritis": "https://en.wikipedia.org/wiki/Septic_arthritis"
    },
    {
        ". They are all types of ": null
    },
    {
        "rheumatic disease": "https://en.wikipedia.org/wiki/Rheumatic_disease"
    },
    {
        ".": null
    },
    {
        "Treatment may include resting the joint and alternating between applying ice and heat. Weight loss and exercise may also be useful. Recommended medications may depend on the form of arthritis. These may include pain medications such as ": null
    },
    {
        "ibuprofen": "https://en.wikipedia.org/wiki/Ibuprofen"
    },
    {
        " and ": null
    },
    {
        "paracetamol": "https://en.wikipedia.org/wiki/Paracetamol"
    },
    {
        " (acetaminophen). In some circumstances, a ": null
    },
    {
        "joint replacement": "https://en.wikipedia.org/wiki/Joint_replacement"
    },
    {
        " may be useful.": null
    },
    {
        "Osteoarthritis affects more than 3.8% of people while rheumatoid arthritis affects about 0.24% of people. Gout affects about 1–2% of the ": null
    },
    {
        "Western": "https://en.wikipedia.org/wiki/Western_world"
    },
    {
        " population at some point in their lives. In Australia about 15% of people are affected, while in the United States more than 20% have a type of arthritis. Overall the disease becomes more common with age. Arthritis is a common reason that people miss work and can result in a decreased quality of life. The term is derived from ": null
    },
    {
        "arthr-": "https://en.wiktionary.org/wiki/arthr-"
    },
    {
        " (meaning joint) and ": null
    },
    {
        "-itis": "https://en.wiktionary.org/wiki/-itis#English"
    },
    {
        " (meaning inflammation).": null
    },
    {
        "There are several diseases where joint pain is primary, and is considered the main feature. Generally when a person has \"arthritis\" it means that they have one of these diseases, which include:": null
    },
    {
        "Joint pain can also be a symptom of other diseases. In this case, the arthritis is considered to be secondary to the main disease; these include:": null
    },
    {
        "An undifferentiated arthritis is an arthritis that does not fit into well-known clinical disease categories, possibly being an early stage of a definite ": null
    },
    {
        "rheumatic disease": "https://en.wikipedia.org/wiki/Rheumatic_disease"
    },
    {
        ".": null
    },
    {
        "Pain, which can vary in severity, is a common symptom in virtually all types of arthritis. Other symptoms include ": null
    },
    {
        "swelling": "https://en.wikipedia.org/wiki/Swelling_(medical)"
    },
    {
        ", ": null
    },
    {
        "joint stiffness": "https://en.wikipedia.org/wiki/Joint_stiffness"
    },
    {
        " and aching around the joint(s). Arthritic disorders like lupus and rheumatoid arthritis can affect other organs in the body, leading to a variety of symptoms. Symptoms may include:": null
    },
    {
        "It is common in advanced arthritis for significant secondary changes to occur. For example, arthritic symptoms might make it difficult for a person to move around and/or exercise, which can lead to secondary effects, such as:": null
    },
    {
        "These changes, in addition to the primary symptoms, can have a huge impact on quality of life.": null
    },
    {
        "Arthritis is the most common cause of ": null
    },
    {
        "disability": "https://en.wikipedia.org/wiki/Disability"
    },
    {
        " in the United States. More than 20 million individuals with arthritis have severe limitations in function on a daily basis.": null
    },
    {
        "Absenteeism": "https://en.wikipedia.org/wiki/Absenteeism"
    },
    {
        " and frequent visits to the ": null
    },
    {
        "physician": "https://en.wikipedia.org/wiki/Physician"
    },
    {
        " are common in individuals who have arthritis. Arthritis can make it very difficult for individuals to be physically active and some become home bound.": null
    },
    {
        "It is estimated that the total cost of arthritis cases is close to $100 billion of which almost 50% is from lost earnings. Each year, arthritis results in nearly 1 million hospitalizations and close to 45 million outpatient visits to ": null
    },
    {
        "health care": "https://en.wikipedia.org/wiki/Health_care"
    },
    {
        " centers.": null
    },
    {
        "Decreased mobility, in combination with the above symptoms, can make it difficult for an individual to remain physically active, contributing to an increased risk of obesity, high ": null
    },
    {
        "cholesterol": "https://en.wikipedia.org/wiki/Cholesterol"
    },
    {
        " or vulnerability to ": null
    },
    {
        "heart disease": "https://en.wikipedia.org/wiki/Heart_disease"
    },
    {
        ". People with arthritis are also at increased risk of ": null
    },
    {
        "depression": "https://en.wikipedia.org/wiki/Major_depressive_disorder"
    },
    {
        ", which may be a response to numerous factors, including fear of worsening symptoms.": null
    },
    {
        "Diagnosis is made by clinical examination from an appropriate health professional, and may be supported by other tests such as radiology and blood tests, depending on the type of suspected arthritis. All arthritides potentially feature ": null
    },
    {
        "pain": "https://en.wikipedia.org/wiki/Pain"
    },
    {
        ". Pain patterns may differ depending on the arthritides and the location. ": null
    },
    {
        "Rheumatoid arthritis": "https://en.wikipedia.org/wiki/Rheumatoid_arthritis"
    },
    {
        " is generally worse in the morning and associated with stiffness lasting over 30 minutes.  However, in the early stages, patients may have no symptoms after a warm shower. ": null
    },
    {
        "Osteoarthritis": "https://en.wikipedia.org/wiki/Osteoarthritis"
    },
    {
        ", on the other hand, tends to be associated with morning stiffness which eases relatively quickly with movement and exercise. In the aged and children, pain might not be the main presenting feature; the aged patient simply moves less, the infantile patient refuses to use the affected limb.": null
    },
    {
        "Elements of the history of the disorder guide diagnosis. Important features are speed and time of onset, pattern of joint involvement, symmetry of symptoms, early morning stiffness, tenderness, gelling or locking with inactivity, aggravating and relieving factors, and other systemic symptoms. Physical examination may confirm the diagnosis, or may indicate systemic disease. Radiographs are often used to follow progression or help assess severity.": null
    },
    {
        "Blood tests": "https://en.wikipedia.org/wiki/Blood_test"
    },
    {
        " and ": null
    },
    {
        "X-rays": "https://en.wikipedia.org/wiki/X-ray"
    },
    {
        " of the affected joints often are performed to make the diagnosis. Screening blood tests are indicated if certain arthritides are suspected. These might include: ": null
    },
    {
        "rheumatoid factor": "https://en.wikipedia.org/wiki/Rheumatoid_factor"
    },
    {
        ", ": null
    },
    {
        "antinuclear factor": "https://en.wikipedia.org/wiki/Antinuclear_factor"
    },
    {
        " (ANF), ": null
    },
    {
        "extractable nuclear antigen": "https://en.wikipedia.org/wiki/Extractable_nuclear_antigen"
    },
    {
        ", and specific antibodies.": null
    },
    {
        "Osteoarthritis": "https://en.wikipedia.org/wiki/Osteoarthritis"
    },
    {
        " is the most common form of arthritis. It can affect both the larger and the smaller joints of the body, including the hands, ": null
    },
    {
        "wrists": "https://en.wikipedia.org/wiki/Wrist_osteoarthritis"
    },
    {
        ", feet, back, hip, and knee. The disease is essentially one acquired from daily wear and tear of the joint; however, osteoarthritis can also occur as a result of injury. In recent years, some joint or limb deformities, such as knock-knee or acetabular overcoverage or dysplasia, have also been considered as a predisposing factor for knee or hip osteoarthritis. Osteoarthritis begins in the cartilage and eventually causes the two opposing bones to erode into each other. The condition starts with minor pain during physical activity, but soon the pain can be continuous and even occur while in a state of rest. The pain can be debilitating and prevent one from doing some activities. Osteoarthritis typically affects the weight-bearing joints, such as the back, knee and hip. Unlike rheumatoid arthritis, osteoarthritis is most commonly a disease of the elderly. The strongest predictor of osteoarthritis is increased age, likely due to the declining ability of chondrocytes to maintain the structural integrity of cartilage. More than 30 percent of women have some degree of osteoarthritis by age 65. Other risk factors for osteoarthritis include prior joint trauma, obesity, and a sedentary lifestyle.": null
    },
    {
        "Rheumatoid arthritis": "https://en.wikipedia.org/wiki/Rheumatoid_arthritis"
    },
    {
        " (RA) is a disorder in which the body's own immune system starts to attack body ": null
    },
    {
        "tissues": "https://en.wikipedia.org/wiki/Tissue_(biology)"
    },
    {
        ". The attack is not only directed at the joint but to many other parts of the body. In rheumatoid arthritis, most damage occurs to the joint lining and ": null
    },
    {
        "cartilage": "https://en.wikipedia.org/wiki/Cartilage"
    },
    {
        " which eventually results in erosion of two opposing bones. RA often affects joints in the fingers, wrists, knees and elbows, is symmetrical (appears on both sides of the body), and can lead to severe ": null
    },
    {
        "deformity": "https://en.wikipedia.org/wiki/Deformity"
    },
    {
        " in a few years if not treated. RA occurs mostly in people aged 20 and above. In children, the disorder can present with a skin ": null
    },
    {
        "rash": "https://en.wikipedia.org/wiki/Rash"
    },
    {
        ", ": null
    },
    {
        "fever": "https://en.wikipedia.org/wiki/Fever"
    },
    {
        ", ": null
    },
    {
        "pain": "https://en.wikipedia.org/wiki/Pain"
    },
    {
        ", disability, and limitations in daily activities. With earlier diagnosis and aggressive treatment, many individuals can lead a better quality of life than if going undiagnosed for long after RA's onset. The risk factors with the strongest association for developing rheumatoid arthritis are female sex, family history of rheumatoid arthritis, and exposure to tobacco smoke.": null
    },
    {
        "Bone erosion is a central feature of rheumatoid arthritis. Bone continuously undergoes remodeling by actions of bone resorbing ": null
    },
    {
        "osteoclasts": "https://en.wikipedia.org/wiki/Osteoclast"
    },
    {
        " and bone forming ": null
    },
    {
        "osteoblasts": "https://en.wikipedia.org/wiki/Osteoblast"
    },
    {
        ". One of the main triggers of bone erosion in the joints in rheumatoid arthritis is inflammation of the ": null
    },
    {
        "synovium": "https://en.wikipedia.org/wiki/Synovium"
    },
    {
        ", caused in part by the production of pro-inflammatory ": null
    },
    {
        "cytokines": "https://en.wikipedia.org/wiki/Cytokine"
    },
    {
        " and receptor activator of nuclear factor kappa B ligand (RANKL), a cell surface protein present in Th17 cells and osteoblasts. Osteoclast activity can be directly induced by osteoblasts through the RANK/RANKL mechanism.": null
    },
    {
        "Lupus": "https://en.wikipedia.org/wiki/Lupus_erythematosus"
    },
    {
        " is a common ": null
    },
    {
        "collagen": "https://en.wikipedia.org/wiki/Collagen"
    },
    {
        "vascular": "https://en.wikipedia.org/wiki/Vascular"
    },
    {
        " disorder that can be present with severe arthritis. Other features of lupus include a skin rash, extreme ": null
    },
    {
        "photosensitivity": "https://en.wikipedia.org/wiki/Photosensitivity"
    },
    {
        ", ": null
    },
    {
        "hair loss": "https://en.wikipedia.org/wiki/Baldness"
    },
    {
        ", ": null
    },
    {
        "kidney": "https://en.wikipedia.org/wiki/Kidney"
    },
    {
        " problems, lung fibrosis and constant joint pain.": null
    },
    {
        "Gout": "https://en.wikipedia.org/wiki/Gout"
    },
    {
        " is caused by deposition of ": null
    },
    {
        "uric acid": "https://en.wikipedia.org/wiki/Uric_acid"
    },
    {
        " crystals in the joint, causing inflammation. There is also an uncommon form of gouty arthritis caused by the formation of rhomboid crystals of calcium pyrophosphate known as ": null
    },
    {
        "pseudogout": "https://en.wikipedia.org/wiki/Calcium_pyrophosphate_deposition_disease"
    },
    {
        ". In the early stages, the gouty arthritis usually occurs in one joint, but with time, it can occur in many joints and be quite crippling. The joints in gout can often become swollen and lose function. Gouty arthritis can become particularly painful and potentially debilitating when gout cannot successfully be treated. When uric acid levels and gout symptoms cannot be controlled with standard gout medicines that decrease the production of uric acid (e.g., allopurinol, febuxostat) or increase uric acid elimination from the body through the kidneys (e.g., probenecid), this can be referred to as refractory chronic gout or RCG.": null
    },
    {
        "Infectious arthritis": "https://en.wikipedia.org/wiki/Infectious_arthritis"
    },
    {
        " is another severe form of arthritis. It presents with sudden onset of chills, fever and joint pain. The condition is caused by bacteria elsewhere in the body. Infectious arthritis must be rapidly diagnosed and treated promptly to prevent irreversible joint damage.": null
    },
    {
        "Psoriasis": "https://en.wikipedia.org/wiki/Psoriasis"
    },
    {
        " can develop into psoriatic arthritis. With psoriatic arthritis, most individuals develop the skin problem first and then the arthritis. The typical features are of continuous joint pains, stiffness and swelling. The disease does recur with periods of ": null
    },
    {
        "remission": "https://en.wikipedia.org/wiki/Remission_(medicine)"
    },
    {
        " but there is no cure for the disorder. A small percentage develop a severe painful and destructive form of arthritis which destroys the small joints in the hands and can lead to permanent disability and loss of hand function.": null
    },
    {
        "There is no known cure for either rheumatoid or osteoarthritis. Treatment options vary depending on the type of arthritis and include ": null
    },
    {
        "physical therapy": "https://en.wikipedia.org/wiki/Physical_therapy"
    },
    {
        ", lifestyle changes (including exercise and weight control), ": null
    },
    {
        "orthopedic bracing": "https://en.wikipedia.org/wiki/Brace_(orthopaedic)"
    },
    {
        ", and medications. ": null
    },
    {
        "Joint replacement surgery": "https://en.wikipedia.org/wiki/Joint_replacement_surgery"
    },
    {
        " may be required in eroding forms of arthritis. Medications can help reduce inflammation in the joint which decreases pain. Moreover, by decreasing inflammation, the joint damage may be slowed.": null
    },
    {
        "In general, studies have shown that physical exercise of the affected joint can noticeably improve long-term pain relief. Furthermore, exercise of the arthritic joint is encouraged to maintain the health of the particular joint and the overall body of the person.": null
    },
    {
        "Individuals with arthritis can benefit from both physical and ": null
    },
    {
        "occupational therapy": "https://en.wikipedia.org/wiki/Occupational_therapy"
    },
    {
        ". In arthritis the joints become stiff and the range of movement can be limited. Physical therapy has been shown to significantly improve function, decrease pain, and delay need for surgical intervention in advanced cases. Exercise prescribed by a physical therapist has been shown to be more effective than medications in treating osteoarthritis of the knee. Exercise often focuses on improving muscle strength, endurance and flexibility. In some cases, exercises may be designed to train balance. Occupational therapy can provide assistance with activities. Assistive technology is a tool used to aid a person's disability by reducing their physical barriers by improving the use of their damaged body part, typically after an amputation. Assistive technology devices can be customized to the patient or bought commercially.": null
    },
    {
        "There are several types of medications that are used for the treatment of arthritis. Treatment typically begins with medications that have the fewest side effects with further medications being added if insufficiently effective.": null
    },
    {
        "Depending on the type of arthritis, the medications that are given may be different. For example, the first-line treatment for ": null
    },
    {
        "osteoarthritis": "https://en.wikipedia.org/wiki/Osteoarthritis"
    },
    {
        " is ": null
    },
    {
        "acetaminophen": "https://en.wikipedia.org/wiki/Acetaminophen"
    },
    {
        " (paracetamol) while for ": null
    },
    {
        "inflammatory arthritis": "https://en.wikipedia.org/wiki/Inflammatory_arthritis"
    },
    {
        " it involves ": null
    },
    {
        "non-steroidal anti-inflammatory drugs": "https://en.wikipedia.org/wiki/Non-steroidal_anti-inflammatory_drug"
    },
    {
        " (NSAIDs) like ": null
    },
    {
        "ibuprofen": "https://en.wikipedia.org/wiki/Ibuprofen"
    },
    {
        ". ": null
    },
    {
        "Opioids": "https://en.wikipedia.org/wiki/Opioid"
    },
    {
        " and NSAIDs may be less well tolerated. However, topical NSAIDs may have better safety profiles than oral NSAIDs. For more severe cases of osteoarthritis, intra-articular corticosteroid injections may also be considered.": null
    },
    {
        "The drugs to treat ": null
    },
    {
        "rheumatoid arthritis": "https://en.wikipedia.org/wiki/Rheumatoid_arthritis"
    },
    {
        " (RA) range from ": null
    },
    {
        "corticosteroids": "https://en.wikipedia.org/wiki/Corticosteroid"
    },
    {
        " to ": null
    },
    {
        "monoclonal antibodies": "https://en.wikipedia.org/wiki/Monoclonal_antibodies"
    },
    {
        " given ": null
    },
    {
        "intravenously": "https://en.wikipedia.org/wiki/Intravenous_therapy"
    },
    {
        ". Due to the ": null
    },
    {
        "autoimmune": "https://en.wikipedia.org/wiki/Autoimmune"
    },
    {
        " nature of RA, treatments may include not only pain medications and anti-inflammatory drugs, but also another category of drugs called ": null
    },
    {
        "disease-modifying antirheumatic drugs": "https://en.wikipedia.org/wiki/Disease-modifying_antirheumatic_drug"
    },
    {
        " (DMARDs). Treatment with DMARDs is designed to slow down the progression of RA by initiating an ": null
    },
    {
        "adaptive immune response": "https://en.wikipedia.org/wiki/Adaptive_immune_system"
    },
    {
        ", in part by CD4+ T helper (Th) cells, specifically Th17 cells. Th17 cells are present in higher quantities at the site of bone destruction in joints and produce inflammatory cytokines associated with inflammation, such as interleukin-17 (IL-17).": null
    },
    {
        "A number of ": null
    },
    {
        "rheumasurgical": "https://en.wikipedia.org/wiki/Rheumasurgery"
    },
    {
        " interventions have been incorporated in the treatment of arthritis since the 1950s. ": null
    },
    {
        "Arthroscopic surgery": "https://en.wikipedia.org/wiki/Arthroscopic_surgery"
    },
    {
        " for osteoarthritis of the knee provides no additional benefit to optimized physical and medical therapy.": null
    },
    {
        "People with hand arthritis can have trouble with simple ": null
    },
    {
        "activities of daily living": "https://en.wikipedia.org/wiki/Activities_of_daily_living"
    },
    {
        " tasks (ADLs), such as turning a key in a lock or opening jars, as these activities can be cumbersome and painful. There are ": null
    },
    {
        "adaptive aids": "https://en.wikipedia.org/w/index.php?title=Adaptive_aids&action=edit&redlink=1"
    },
    {
        " or (": null
    },
    {
        "assistive devices": "https://en.wikipedia.org/wiki/Assistive_technology"
    },
    {
        " (ADs)) available to help with these tasks, but they are generally more costly than conventional products with the same function. It is now possible to ": null
    },
    {
        "3-D print": "https://en.wikipedia.org/wiki/3-D_print"
    },
    {
        " adaptive aids, which have been released as ": null
    },
    {
        "open source hardware": "https://en.wikipedia.org/wiki/Open_source_hardware"
    },
    {
        " to reduce patient costs. Adaptive aids can significantly help arthritis patients and the vast majority of those with arthritis need and use them.": null
    },
    {
        "Further research is required to determine if ": null
    },
    {
        "transcutaneous electrical nerve stimulation": "https://en.wikipedia.org/wiki/Transcutaneous_electrical_nerve_stimulation"
    },
    {
        " (TENS) for knee osteoarthritis is effective for controlling pain.": null
    },
    {
        "Low level laser therapy": "https://en.wikipedia.org/wiki/Low_level_laser_therapy"
    },
    {
        " may be considered for relief of pain and stiffness associated with arthritis. Evidence of benefit is tentative.": null
    },
    {
        "Pulsed electromagnetic field therapy": "https://en.wikipedia.org/wiki/Pulsed_electromagnetic_field_therapy"
    },
    {
        " has tentative evidence supporting improved functioning but no evidence of improved pain in osteoarthritis. The FDA has not approved PEMF for the treatment of arthritis. In Canada, PEMF devices are legally licensed by Health Canada for the treatment of pain associated with arthritic conditions.": null
    },
    {
        "Arthritis is predominantly a disease of the elderly, but children can also be affected by the disease. Arthritis is more common in women than men at all ages and affects all races, ": null
    },
    {
        "ethnic groups": "https://en.wikipedia.org/wiki/Ethnic_group"
    },
    {
        " and cultures. In the United States a CDC survey based on data from 2013–2015 showed 54.4 million (22.7%) adults had self-reported doctor-diagnosed arthritis, and 23.7 million (43.5% of those with arthritis) had arthritis-attributable activity limitation (AAAL). With an aging population, this number is expected to increase. Adults with co-morbid conditions, such as heart disease, diabetes, and obesity, were seen to have a higher than average prevalence of doctor-diagnosed arthritis (49.3%, 47.1%, and 30.6% respectively).": null
    },
    {
        "Disability due to ": null
    },
    {
        "musculoskeletal disorders": "https://en.wikipedia.org/wiki/Musculoskeletal_disorder"
    },
    {
        " increased by 45% from 1990 to 2010. Of these, osteoarthritis is the fastest increasing major health condition. Among the many reports on the increased prevalence of musculoskeletal conditions, data from Africa are lacking and underestimated. A ": null
    },
    {
        "systematic review": "https://en.wikipedia.org/wiki/Systematic_review"
    },
    {
        " assessed the prevalence of arthritis in Africa and included twenty population-based and seven hospital-based studies. The majority of studies, twelve, were from South Africa. Nine studies were well-conducted, eleven studies were of moderate quality, and seven studies were conducted poorly. The results of the systematic review were as follows:": null
    },
    {
        "Evidence of osteoarthritis and potentially inflammatory arthritis has been discovered in dinosaurs. The first known traces of human arthritis date back as far as ": null
    },
    {
        "4500 BC": "https://en.wikipedia.org/wiki/4500_BC"
    },
    {
        ". In early reports, arthritis was frequently referred to as the most common ailment of prehistoric peoples. It was noted in skeletal remains of ": null
    },
    {
        "Native Americans": "https://en.wikipedia.org/wiki/Native_Americans_in_the_United_States"
    },
    {
        " found in ": null
    },
    {
        "Tennessee": "https://en.wikipedia.org/wiki/Tennessee"
    },
    {
        " and parts of what is now ": null
    },
    {
        "Olathe, Kansas": "https://en.wikipedia.org/wiki/Olathe,_Kansas"
    },
    {
        ". Evidence of arthritis has been found throughout history, from ": null
    },
    {
        "Ötzi": "https://en.wikipedia.org/wiki/%C3%96tzi_the_Iceman"
    },
    {
        ", a ": null
    },
    {
        "mummy": "https://en.wikipedia.org/wiki/Mummy"
    },
    {
        " (circa 3000 BC) found along the border of modern ": null
    },
    {
        "Italy": "https://en.wikipedia.org/wiki/Italy"
    },
    {
        " and ": null
    },
    {
        "Austria": "https://en.wikipedia.org/wiki/Austria"
    },
    {
        ", to the Egyptian mummies circa 2590 BC.": null
    },
    {
        "In 1715, ": null
    },
    {
        "William Musgrave": "https://en.wikipedia.org/wiki/William_Musgrave"
    },
    {
        " published the second edition of his most important medical work, De arthritide symptomatica, which concerned arthritis and its effects. Augustin Jacob Landré-Beauvais, a 28-year-old resident physician at Saltpêtrière Asylum in France was the first person to describe the symptoms of rheumatoid arthritis. Though Landré-Beauvais' classification of rheumatoid arthritis as a relative of gout was inaccurate, his dissertation encouraged others to further study the disease.": null
    },
    {
        "The term is derived from ": null
    },
    {
        "arthr-": "https://en.wiktionary.org/wiki/arthr-"
    },
    {
        " (from ": null
    },
    {
        "Ancient Greek": "https://en.wikipedia.org/wiki/Ancient_Greek_language"
    },
    {
        ": , ": null
    },
    {
        "romanized": "https://en.wikipedia.org/wiki/Romanization_of_Ancient_Greek"
    },
    {
        ": árthron, ": null
    },
    {
        "lit.": "https://en.wikipedia.org/wiki/Literal_translation"
    },
    {
        "'joint, limb') and ": null
    },
    {
        "-itis": "https://en.wiktionary.org/wiki/-itis#English"
    },
    {
        " (from , -îtis, lit.), the latter ": null
    },
    {
        "suffix": "https://en.wikipedia.org/wiki/Suffix"
    },
    {
        " having come to be associated with ": null
    },
    {
        "inflammation": "https://en.wikipedia.org/wiki/Inflammation"
    },
    {
        ".": null
    },
    {
        "The word 'arthritides' denotes the collective group of arthritis-like conditions.": null
    }
]