[
    {
        "Actinidia polygama (also known as silver vine,cat powder and matatabi) is a species of ": null
    },
    {
        "kiwifruit": "https://en.wikipedia.org/wiki/Kiwifruit"
    },
    {
        " in the ": null
    },
    {
        "Actinidiaceae": "https://en.wikipedia.org/wiki/Actinidiaceae"
    },
    {
        " family. It grows in the mountainous areas of ": null
    },
    {
        "Japan": "https://en.wikipedia.org/wiki/Japan"
    },
    {
        " and ": null
    },
    {
        "China": "https://en.wikipedia.org/wiki/China"
    },
    {
        " at elevations between 500 and 1900 m.": null
    },
    {
        "Silver vine can reach up to 5–6 m high at maturity. It is a ": null
    },
    {
        "deciduous": "https://en.wikipedia.org/wiki/Deciduous"
    },
    {
        " climber and tolerates temperatures down to −30 °C (−22 °F). The petiole leaves are silver and white in color and 6–13 cm long and 4–9 cm wide. These colorful markings make the plant identifiable from afar, until the flowering season when the leaves turn completely green.": null
    },
    {
        "The flowering season lasts from late June to early July, in which the plant bears white flowers about 2.5 cm in diameter. The longevity of an individual flower is 2–3 d, when the plant also starts to develop small, yellow to yellow-red, egg-shaped, fleshy, and multiseeded fruits, which mature from September to October. The fruit is about 1.5 cm wide and 3.0–4.0 cm long. The inside of the fruit resembles the common ": null
    },
    {
        "kiwifruit": "https://en.wikipedia.org/wiki/Kiwifruit"
    },
    {
        ", but it is orange in color rather than green.": null
    },
    {
        "The silver vine plant requires moist, well-drained soil, and partial shade to full sun. This fast-growing vine makes for good cover on a fence or trellis. It is becoming increasingly popular as an edible fruit crop.": null
    },
    {
        "Silver vine has been used for its medicinal benefits for centuries, as a preventative health aid, is still commonly used as an alternative therapy for ": null
    },
    {
        "hypertension": "https://en.wikipedia.org/wiki/Hypertension"
    },
    {
        ", ": null
    },
    {
        "arthritic pain": "https://en.wikipedia.org/wiki/Arthritic_pain"
    },
    {
        ", and was investigated as treatment for ": null
    },
    {
        "cancer": "https://en.wikipedia.org/wiki/Cancer"
    },
    {
        ". In ": null
    },
    {
        "traditional Chinese": "https://en.wikipedia.org/wiki/Traditional_Chinese_Medicine"
    },
    {
        " and Japanese medicine, it has been used for a wide range of health problems, including:": null
    },
    {
        "In Korean ": null
    },
    {
        "Buddhism": "https://en.wikipedia.org/wiki/Buddhism"
    },
    {
        ", silver vine was soaked in traditional Korean sauces and used for ": null
    },
    {
        "diuresis": "https://en.wikipedia.org/wiki/Polyuria"
    },
    {
        ", alleviation of pain, ": null
    },
    {
        "hypertension": "https://en.wikipedia.org/wiki/Hypertension"
    },
    {
        ", genital troubles, and ": null
    },
    {
        "bronchitis": "https://en.wikipedia.org/wiki/Bronchitis"
    },
    {
        ".": null
    },
    {
        "It is said that:\"Old, weary travelers, (come) back to life to eat the fruit of [silver vine] and then continue their journey.\"": null
    },
    {
        "Silver vine leaves also have a high content of ": null
    },
    {
        "flavonoids": "https://en.wikipedia.org/wiki/Flavonoids"
    },
    {
        ", ": null
    },
    {
        "terpenoids": "https://en.wikipedia.org/wiki/Terpenoids"
    },
    {
        ", ": null
    },
    {
        "saponins": "https://en.wikipedia.org/wiki/Saponins"
    },
    {
        ",": null
    },
    {
        "beta-carotene": "https://en.wikipedia.org/wiki/Beta-carotene"
    },
    {
        ",": null
    },
    {
        "vitamin C": "https://en.wikipedia.org/wiki/Vitamin_C"
    },
    {
        " and ": null
    },
    {
        "vitamin E": "https://en.wikipedia.org/wiki/Vitamin_E"
    },
    {
        ".": null
    },
    {
        "The fruit in the \"acorn\" shape can be salted and eaten raw, fried in oil, added to rice, or mixed with sesame seeds and mayonnaise to top salads. The fruit may also be fermented to make Matatabi sake and ": null
    },
    {
        "miso": "https://en.wikipedia.org/wiki/Miso"
    },
    {
        "; fermented into a fruit wine; or extracted for  juice. The leaves, buds, and stems can also be ground into a powder or cut, steamed, and steeped to make tea.  Adding mint or sugar can give variations in the tea.": null
    },
    {
        "Grinding the leaves and stems into a coarser grind than needed for the tea makes Matatabi grass, which is used as ": null
    },
    {
        "bath salts": "https://en.wikipedia.org/wiki/Bath_salt"
    },
    {
        ".  The vine is used as material for folk crafts, and the sap is collected to make lotions.": null
    },
    {
        "Silver vine (also called matatabi) has long been known to elicit euphoric response in cats. It is the most popular cat treat in Asia, thus sometimes cited in manga as matatabi. The reaction to silver vine is similar to the ": null
    },
    {
        "catnip": "https://en.wikipedia.org/wiki/Catnip"
    },
    {
        " response, but appears to be more intense. Silver vine is a great alternative to catnip, and many cats which do not react to catnip will respond positively to silver vine powder made from dried fruit galls. Typical behaviors include rolling, chin and cheek rubbing, drooling, and licking. The effect usually lasts between five and 30 minutes, and cats will usually visit silver vine again after about 20–30 minutes.": null
    }
]