[
    {
        "         Abdul-Bahá , born Abbás , was the eldest son of ": null
    },
    {
        "Baháulláh": "Baháulláh"
    },
    {
        " and served as head of the ": null
    },
    {
        "Baháí Faith": "Baháí Faith"
    },
    {
        " from 1892 until 1921. Abdul-Bahá was later canonized as the last of three central figures of the religion, along with Baháulláh and the ": null
    },
    {
        "Báb": "Báb"
    },
    {
        ", and his writings and authenticated talks are regarded as a source of Baháí sacred literature.     He was born in ": null
    },
    {
        "Tehran": "Tehran"
    },
    {
        " to an aristocratic family. At the age of eight his father was imprisoned during a government crackdown on the ": null
    },
    {
        "Bábí Faith": "Bábism"
    },
    {
        " and the familys possessions were looted, leaving them in virtual poverty. His father was exiled from their native ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ", and the family went to live in ": null
    },
    {
        "Baghdad": "Baghdad"
    },
    {
        ", where they stayed for nine years. They were later called by the ": null
    },
    {
        "Ottoman": "Ottoman Empire"
    },
    {
        " state to ": null
    },
    {
        "Istanbul": "Istanbul"
    },
    {
        " before going into another period of confinement in ": null
    },
    {
        "Edirne": "Edirne"
    },
    {
        " and finally the prison-city of ": null
    },
    {
        "Akká": "Acre, Palestine"
    },
    {
        " . Abdul-Bahá remained a political prisoner there until the ": null
    },
    {
        "Young Turk Revolution": "Young Turk Revolution"
    },
    {
        " freed him in 1908 at the age of 64. He then made several ": null
    },
    {
        "journeys to the West": "Abdul-Bahás Journeys To The West"
    },
    {
        " to spread the Baháí message beyond its middle-eastern roots, but the onset of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " left him largely confined to ": null
    },
    {
        "Haifa": "Haifa"
    },
    {
        " from 1914–1918. The war replaced the openly hostile Ottoman authorities with the ": null
    },
    {
        "British Mandate": "Mandatory Palestine"
    },
    {
        ", who ": null
    },
    {
        "knighted": "Order Of The British Empire"
    },
    {
        " him for his help in averting famine following the war.     In 1892 Abdul-Bahá was appointed in his fathers ": null
    },
    {
        "will": "Tablets Of Baháulláhkitáb-I-Ahd"
    },
    {
        " to be his successor and head of the ": null
    },
    {
        "Baháí Faith": "Baháí Faith"
    },
    {
        ". He faced opposition from virtually all his family members, but held the loyalty of the great majority of Baháís around the world. His  Tablets of the Divine Plan  helped galvanize Baháís in North America into spreading the Baháí teachings to new territories, and his ": null
    },
    {
        "Will and Testament": "Will And Testament Of Abdul-Bahá"
    },
    {
        " laid the foundation for the current ": null
    },
    {
        "Baháí administrative order": "Baháí Administration"
    },
    {
        ". Many of his writings, prayers and letters are extant, and his discourses with the Western Baháís emphasize the growth of the faith by the late 1890s.     Abdul-Bahás ": null
    },
    {
        "given name": "Given Name"
    },
    {
        " was Abbás. Depending on context, he would have gone by either ": null
    },
    {
        "Mírzá": "Mirza"
    },
    {
        " Abbás or Abbás ": null
    },
    {
        "Effendi": "Effendi"
    },
    {
        " , both of which are equivalent to the English ": null
    },
    {
        "Sir": "Sir"
    },
    {
        " Abbás. He preferred the title of Abdul-Bahá . He is commonly referred to in Baháí texts as The Master .       Abdul-Bahá was born in ": null
    },
    {
        "Tehran": "Tehran"
    },
    {
        ", Iran on 23 May 1844 ,  the eldest son of ": null
    },
    {
        "Baháulláh": "Baháulláh"
    },
    {
        " and ": null
    },
    {
        "Navváb": "Ásíyih Khánum"
    },
    {
        ". He was born on the very same night on which the ": null
    },
    {
        "Báb": "Báb"
    },
    {
        " declared his mission. Born with the given name of Abbás, he was named after his grandfather ": null
    },
    {
        "Mírzá Abbás Núrí": "Mírzá Abbás Núrí"
    },
    {
        ", a prominent and powerful nobleman.  As a child, Abdul-Bahá was shaped by his fathers position as a prominent ": null
    },
    {
        "Bábí": "Bábí"
    },
    {
        ". He recalled how he met the Bábí ": null
    },
    {
        "Táhirih": "Táhirih"
    },
    {
        " and how she would take me on to her knee, caress me, and talk to me. I admired her most deeply .  Abdul-Bahá had a happy and carefree childhood. The familys Tehran home and country houses were comfortable and beautifully decorated. Abdul-Bahá enjoyed playing in the gardens with his younger sister with whom he was very close.  Along with his younger siblings – a sister, ": null
    },
    {
        "Bahíyyih": "Bahíyyih Khánum"
    },
    {
        ", and a brother, ": null
    },
    {
        "Mihdí": "Mírzá Mihdí"
    },
    {
        " – the three lived in an environment of privilege, happiness and comfort. With his father declining a position as minister of the royal court; during his young boyhood Abdul-Bahá witnessed his parents various charitable endeavours,  which included converting part of the home to a hospital ward for women and children.     Abdul-Bahá received a haphazard education during his childhood. It was customary not to send children of nobility to schools. Most noblemen were educated at home briefly in scripture, rhetoric, calligraphy and basic mathematics. Many were educated to prepare themselves for life in the royal court. Despite a brief spell at a traditional preparatory school at the age of seven for one year,  Abdul-Bahá received no formal education. As he grew he was educated by his mother, and uncle. Blomfield, p.68 Most of his education however, came from his father.  Years later in 1890 ": null
    },
    {
        "Edward Granville Browne": "Edward Granville Browne"
    },
    {
        " described how Abdul-Bahá was one more eloquent of speech, more ready of argument, more apt of illustration, more intimately acquainted with the sacred books of the Jews, the Christians, and the Muhammadans...scarcely be found even amongst the eloquent.      When Abdul-Bahá was seven, he contracted tuberculosis and was expected to die. Hogenson, p.81 Though the malady faded away, he would be plagued with bouts of illness for the rest of his life. Hogenson, p.82     One event that affected Abdul-Bahá greatly during his childhood was the imprisonment of his father when Abdul-Bahá was eight years old; the imprisonment led to his family being reduced to poverty and being attacked in the streets by other children. Abdul-Bahá accompanied his mother to visit ": null
    },
    {
        "Baháulláh": "Baháulláh"
    },
    {
        " who was then imprisoned in the infamous subterranean dungeon the ": null
    },
    {
        "Síyáh-Chál": "Síyáh-Chál"
    },
    {
        ". He described how I saw a dark, steep place. We entered a small, narrow doorway, and went down two steps, but beyond those one could see nothing. In the middle of the stairway, all of a sudden we heard His voice: Do not bring him in here, and so they took me back .       Baháulláh was eventually released from prison but ordered into exile, and Abdul-Bahá then eight joined his father on the journey to ": null
    },
    {
        "Baghdad": "Baghdad"
    },
    {
        " in the winter  compiled by Jonah Winters of 1853. During the journey Abdul-Bahá suffered from frost-bite. After a year of difficulties Baháulláh absented himself rather than continue to face the conflict with ": null
    },
    {
        "Mirza Yahya": "Mirza Yahya"
    },
    {
        " and secretly secluded himself in the mountains of ": null
    },
    {
        "Sulaymaniyah": "Sulaymaniyah"
    },
    {
        " in April 1854 a month before Abdul-Bahás tenth birthday. Mutual sorrow resulted in him, his ": null
    },
    {
        "mother": "Ásíyih Khánum"
    },
    {
        " and ": null
    },
    {
        "sister": "Bahiyyih Khánum"
    },
    {
        " becoming constant companions.  Abdul-Bahá was particularly close to both, and his mother took active participation in his education and upbringing.  During the two-year absence of his father Abdul-Bahá took up the duty of managing the affairs of the family, , page 391 before his ": null
    },
    {
        "age of maturity": "Age Of Majority"
    },
    {
        "  by ": null
    },
    {
        "Homa Hoodfar": "Homa Hoodfar"
    },
    {
        ", Shadi Sadr, page 9 and was known to be occupied with reading and, at a time of hand-copied scriptures being the primary means of publishing, was also engaged in copying the writings of the ": null
    },
    {
        "Báb": "Báb"
    },
    {
        ". Abdul-Bahá also took an interest in the art of horse riding and, as he grew, became a renowned rider.     In 1856, news of an ascetic carrying on discourses with local Súfí leaders that seemed to possibly be Baháulláh reached the family and friends. Immediately, family members and friends went to search for the elusive dervish – and in March brought Baháulláh back to Baghdad.  On seeing his father, Abdul-Bahá fell to his knees and wept loudly Why did you leave us? , and this followed with his mother and sister doing the same.  Abdul-Bahá soon became his fathers secretary and shield. During the sojourn in the city Abdul-Bahá grew from a boy into a young man. He was noted as a remarkably fine looking youth , and remembered for his charity and amiableness. Having passed the age of maturity Abdul-Bahá was regularly seen in the mosques of Baghdad discussing religious topics and the scripture as a young man. Whilst in Baghdad, Abdul-Bahá composed a commentary at the request of his father on the Muslim tradition of ": null
    },
    {
        "I was a Hidden Treasure": "I Was A Hidden Treasure"
    },
    {
        " for a Súfí leader named Alí Shawkat Páshá.  Abdul-Bahá was fifteen or sixteen at the time and Alí Shawkat Páshá regarded the more than 11000 word essay as a remarkable feat for somebody of his age. In 1863 in what became known as the ": null
    },
    {
        "Garden of Ridván": "Garden Of Ridván, Baghdad"
    },
    {
        " Baháulláh announced to a few that he was the ": null
    },
    {
        "manifestation of God": "Manifestation Of God"
    },
    {
        " and ": null
    },
    {
        "He whom God shall make manifest": "He Whom God Shall Make Manifest"
    },
    {
        " whose coming had been foretold by the ": null
    },
    {
        "Báb": "Báb"
    },
    {
        ". On day eight of the twelve days, it is believed Abdul-Baha was the first person Bahaullah revealed his claim to.   BBC          In 1863 Baháulláh was summoned to ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        " , and thus his whole family including Abdul-Bahá, then nineteen, accompanied him on his 110-day journey. The journey to Constantinople was another wearisome journey, and Abdul-Bahá helped feed the exiles. It was here that his position became more prominent amongst the Baháís. This was further solidified by ": null
    },
    {
        "Baháulláhs": "Baháulláh"
    },
    {
        " tablet of the Branch": "Tablet Of The Branch"
    },
    {
        " in which he constantly exalts his sons virtues and station.  The family were soon exiled to ": null
    },
    {
        "Adrianople": "Adrianople"
    },
    {
        " and Abdul-Bahá went with the family. Abdul-Bahá again suffered from frostbite.      In Adrianople Abdul-Bahá was regarded as the sole comforter of his family – in particular to his ": null
    },
    {
        "mother": "Ásíyih Khánum"
    },
    {
        ". At this point Abdul-Bahá was known by the Baháís as the Master , and by non-Baháís as Abbás Effendi . It was in Adrianople that Baháulláh referred to his son as the Mystery of God . The title of Mystery of God symbolises, according to Baháís, that Abdul-Bahá is not a ": null
    },
    {
        "manifestation of God": "Manifestation Of God"
    },
    {
        " but how a person of Abdul-Bahá the incompatible characteristics of a human nature and superhuman knowledge and perfection have been blended and are completely harmonized .   Abdul-Bahá was at this point noted for having black hair which flowed to his shoulders, large blue eyes, rose-through-alabaster coloured skin and a fine nose.  Baháulláh gave his son many other titles such as  Gh usn-i-Azam , the Branch of Holiness , the Center of the Covenant and the apple of his eye. Abdul-Bahá was devastated when hearing the news that he and his family were to be exiled separately from ": null
    },
    {
        "Baháulláh": "Baháulláh"
    },
    {
        ". It was, according to Baháís, through his intercession that the idea was reverted and the family were allowed to be exiled together.          At the age of 24, Abdul-Bahá was clearly chief-steward to his father and an outstanding member of the Baháí community. Baháulláh and his family were – in 1868 – exiled to the penal colony of ": null
    },
    {
        "Acre, Palestine": "Acre, Palestine"
    },
    {
        " where it was expected that the family would perish.  Arrival in Akká was distressing for the family and exiles. They were greeted in a hostile manner by the surrounding population and his sister and father fell dangerously ill. When told that the women were to sit on the shoulders of the men to reach the shore, Abdul-Bahá took a chair and carried the women to the bay of Akká. Abdul-Bahá was able to procure some anesthetic and nursed the sick. The Baháís were imprisoned under horrendous conditions in a cluster of cells covered in excrement and dirt. Abdul-Bahá himself fell dangerously ill with ": null
    },
    {
        "dysentery": "Dysentery"
    },
    {
        ", however a sympathetic soldier permitted a physician to help cure him. The population shunned them, the soldiers treated them the same, and the behaviour of Siyyid Muhammad-i-Isfahani  did not help matters.  Morale was further destroyed with the accidental death of Abdul-Bahás youngest brother ": null
    },
    {
        "Mírzá Mihdí": "Mírzá Mihdí"
    },
    {
        " at the age of 22. His death devastated the family – particularly his ": null
    },
    {
        "mother": "Ásíyih Khánum"
    },
    {
        " and father – and the grieving Abdul-Bahá kept a night-long vigil beside his brothers body.       Over time, he gradually took over responsibility for the relationships between the small ": null
    },
    {
        "Bahái": "Baháí Faith"
    },
    {
        " exile community and the outside world. It was through his interaction with the people of Akká that, according to the Baháís, they recognized the innocence of the Baháís, and thus the conditions of imprisonment were eased. Four months after the death of Mihdí the family moved from the prison to the ": null
    },
    {
        "House of Abbúd": "House Of Abbúd"
    },
    {
        ". The people of Akká started to respect the Baháís and in particular, Abdul-Bahá. Abdul-Bahá was able to arrange for ": null
    },
    {
        "houses to be rented": "House Of Abbúdakk.C3.A1 Area"
    },
    {
        " for the family, the family later moved to the ": null
    },
    {
        "Mansion of Bahjí": "Mansion Of Bahjí"
    },
    {
        " around 1879 when an epidemic caused the inhabitants to flee.     Abdul-Bahá soon became very popular in the penal colony and ": null
    },
    {
        "Myron Henry Phelps": "Myron Henry Phelps"
    },
    {
        " a wealthy New York lawyer described how a crowd of human beings...Syrians, Arabs, Ethiopians, and many others ,  all waited to talk and receive Abdul-Bahá.  He undertook a history of the Bábí religion through publication of ": null
    },
    {
        "A Travellers Narrative": "A Travellers Narrative"
    },
    {
        " in 1886,  later translated and published in translation in 1891 through Cambridge University by the agency of ": null
    },
    {
        "Edward Granville Browne": "Edward Granville Browne"
    },
    {
        " who described Abdul-Bahá as:           When Abdul-Bahá was a young man, speculation was rife amongst the Baháís to whom he would marry. Hogenson, p.87 Several young girls were seen as marriage prospects but Abdul-Bahá seemed disinclined to marriage. On 8 March 1873, at the urging of his father,  the twenty-eight-year-old Abdul-Bahá married ": null
    },
    {
        "Fátimih Nahrí of Isfahán": "Munírih Khánum"
    },
    {
        " a twenty-five-year-old from an upper-class family of the city.  Her father was Mírzá Muḥammad Alí Nahrí of ": null
    },
    {
        "Isfahan": "Isfahan"
    },
    {
        " an eminent Baháí with prominent connections. Fátimih was brought from ": null
    },
    {
        "Persia": "Persia"
    },
    {
        " to Akká after both ": null
    },
    {
        "Baháulláh": "Baháulláh"
    },
    {
        " and his wife ": null
    },
    {
        "Navváb": "Navváb"
    },
    {
        " expressed an interest in her to marry Abdul-Bahá.  After a wearisome journey from Isfahán to Akka she finally arrived accompanied by her brother in 1872. The young couple were betrothed for about five months before the marriage itself commenced. In the meantime, Fátimih lived in the home of Abdul-Bahás uncle ": null
    },
    {
        "Mírzá Músá": "Mírzá Músá"
    },
    {
        ". According to her later memoirs, Fátimih fell in love with Abdul-Bahá on seeing him. Abdul-Bahá himself had showed little inkling to marriage until meeting Fátimih; who was entitled Munírih by ": null
    },
    {
        "Baháulláh": "Baháulláh"
    },
    {
        ". Munírih is a title meaning Luminous .      The marriage resulted in nine children. The first born was a son Mihdí Effendi who died aged about 3. He was followed by Ḍiyáiyyih Kh ánum, Fuádíyyih Kh ánum , Rúhangíz Khánum , Túbá Khánum, Husayn Effendi , Túbá Kh ánum, Rúhá Kh ánum and Munnavar Kh ánum. The death of his children caused Abdul-Bahá immense grief – in particular the death of his son Husayn Effendi came at a difficult time following the death of his mother and uncle.  The surviving children were; Ḍiyáiyyih Kh ánum  Túbá Kh ánum Rúḥá Kh ánum and Munavvar Kh ánum . ": null
    },
    {
        "Baháulláh": "Baháulláh"
    },
    {
        " wished that the Baháís follow the example of Abdul-Bahá and gradually move away from polygamy.  The marriage of Abdul-Bahá to one woman and his choice to remain monogamous, from advice of his father and his own wish, legitimised the practice of monogamy to a people who hitherto had regarded polygamy as a righteous way of life.       After Baháulláh died on 29 May 1892, the ": null
    },
    {
        "Will and Testament": "Tablets Of Baháulláhkitáb-I-Ahd"
    },
    {
        " of Baháulláh named Abdul-Bahá as Centre of the Covenant, successor and interpreter of Baháulláhs writings.     Baháulláh designates his successor with the following verses:        This translation of the Kitáb-i-Ahd is based on a ": null
    },
    {
        "solecism": "Solecism"
    },
    {
        ", however, as the terms Akbar and Azam do not mean, respectively, Greater and Most Great. Not only do the two words derive from entirely separate ": null
    },
    {
        "triconsonantal roots": "Semitic Roottriconsonantal Roots"
    },
    {
        " , but the ": null
    },
    {
        "Arabic language": "Arabic Language"
    },
    {
        " possesses the ": null
    },
    {
        "elative": "Elative"
    },
    {
        ", a stage of gradation, with no clear distinction between the ": null
    },
    {
        "comparative": "Comparative"
    },
    {
        " and ": null
    },
    {
        "superlative": "Superlative"
    },
    {
        ".  In the Will and Testament Abdul-Bahás half-brother, ": null
    },
    {
        "Muhammad Alí": "Mírzá Muhammad Alí"
    },
    {
        ", was mentioned by name as being subordinate to Abdul-Bahá. Muhammad Alí became jealous of his half-brother and set out to establish authority for himself as an alternative leader with the support of his brothers Badiullah and Diyaullah. He began correspondence with Baháís in Iran, initially in secret, casting doubts in others minds about Abdul-Bahá. While most Baháís followed Abdul-Bahá, a handful followed Muhammad Alí including such leaders as Mirza Javad and ": null
    },
    {
        "Ibrahim George Kheiralla": "Ibrahim George Kheiralla"
    },
    {
        ", an early Baháí missionary to America.      Muhammad Alí and Mirza Javad began to openly accuse Abdul-Bahá of taking on too much authority, suggesting that he believed himself to be a ": null
    },
    {
        "Manifestation of God": "Manifestation Of God"
    },
    {
        ", equal in status to Baháulláh.  It was at this time that Abdul-Bahá, in order to provide proof of the falsity of the accusations leveled against him, in tablets to the West, stated that he was to be known as Abdul-Bahá an ": null
    },
    {
        "Arabic": "Arabic Language"
    },
    {
        " phrase meaning the Servant of Bahá to make it clear that he was not a Manifestation of God, and that his station was only servitude.  Abdul-Bahá left a ": null
    },
    {
        "Will and Testament": "Will And Testament Of Abdul-Bahá"
    },
    {
        " that set up the framework of administration. The two highest institutions were the Universal House of Justice, and the ": null
    },
    {
        "Guardianship": "Guardian"
    },
    {
        ", for which he appointed ": null
    },
    {
        "Shoghi Effendi": "Shoghi Effendi"
    },
    {
        " as the Guardian. With the exception of Abdul-Bahá and Shoghi Effendi, Muhammad Alí was supported by all of the remaining ": null
    },
    {
        "male relatives of Baháulláh": "Baháulláhs Family"
    },
    {
        ", including Shoghi Effendis father, Mírzá Hádí Shírází.  However Muhammad Alís and his families statements had very little effect on the Baháís in general - in the Akká area, the followers of Muhammad Alí represented six families at most, they had no common religious activities,  and were almost wholly assimilated into Muslim society.           By the end of 1898, Western pilgrims started coming to Akka on pilgrimage to visit Abdul-Bahá; this group of pilgrims, including ": null
    },
    {
        "Phoebe Hearst": "Phoebe Hearst"
    },
    {
        ", was the first time that Baháís raised up in the West had met Abdul-Bahá. The first group arrived in 1898 and throughout late 1898 to early 1899 Western Baháís sporadically visited Abdul-Bahá. The group was relatively young containing mainly women from high American society in their 20s. Hogenson, p.x The group of Westerners aroused suspicion for the authorities, and consequently Abdul-Bahás confinement was tightened. Hogenson, p.308 During the next decade Abdul-Bahá would be in constant communication with Baháís around the world, helping them to teach the religion; the group included ": null
    },
    {
        "May Ellis Bolles": "May Maxwell"
    },
    {
        " in Paris, Englishman ": null
    },
    {
        "Thomas Breakwell": "Thomas Breakwell"
    },
    {
        ", American Herbert Hopper, French , Susan Moody, Lua Getsinger, and American Laura Clifford Barney. It was Laura Clifford Barney who, by asking questions of Abdul-Bahá over many years and many visits to Haifa, compiled what later became the book ": null
    },
    {
        "Some Answered Questions": "Some Answered Questions"
    },
    {
        ".       During the final years of the 19th century, while Abdul-Bahá was still officially a prisoner and confined to Akka, he organized the transfer of the remains of the ": null
    },
    {
        "Báb": "Báb"
    },
    {
        " from Iran to Palestine. He then organized the purchase of land on ": null
    },
    {
        "Mount Carmel": "Mount Carmel"
    },
    {
        " that Baháulláh had instructed should be used to lay the remains of the Báb, and organized for the construction of the ": null
    },
    {
        "Shrine of the Báb": "Shrine Of The Báb"
    },
    {
        ". This process took another 10 years. With the increase of pilgrims visiting Abdul-Bahá, Muhammad Alí worked with the ": null
    },
    {
        "Ottoman authorities": "Ottoman Empire"
    },
    {
        " to re-introduce stricter terms on Abdul-Bahás imprisonment in August 1901. By 1902, however, due to the Governor of Akka being supportive of Abdul-Bahá, the situation was greatly eased; while pilgrims were able to once again visit Abdul-Bahá, he was confined to the city. In February 1903, two followers of Muhammad Alí, including Badiullah and Siyyid Aliy-i-Afnan, broke with Muhammad Ali and wrote books and letters giving details of Muhammad Alis plots and noting that what was circulating about Abdul-Bahá was fabrication.      From 1902 to 1904, in addition to the building of the ": null
    },
    {
        "Shrine of the Báb": "Shrine Of The Báb"
    },
    {
        " that Abdul-Bahá was directing, he started to put into execution two different projects; the restoration of the ": null
    },
    {
        "House of the Báb": "House Of The Báb"
    },
    {
        " in ": null
    },
    {
        "Shiraz, Iran": "Shiraz, Iran"
    },
    {
        " and the construction of the first ": null
    },
    {
        "Baháí House of Worship": "Baháí House Of Worship"
    },
    {
        " in ": null
    },
    {
        "Ashgabat": "Ashgabat"
    },
    {
        ", Turkmenistan. Abdul-Bahá asked Aqa Mirza Aqa to coordinate the work so that the house of the Báb would be restored to the state that it was at the time of the Bábs declaration to ": null
    },
    {
        "Mulla Husayn": "Mulla Husayn"
    },
    {
        " in 1844; he also entrusted the work on the House of Worship to ": null
    },
    {
        "Vakil-ud-Dawlih": "Vakil-Ud-Dawlih"
    },
    {
        ".     During this period, Abdul-Bahá communicated with a number ": null
    },
    {
        "Young Turk": "Young Turk"
    },
    {
        "s, opposed to the reign of ": null
    },
    {
        "Sultan Abdul Hamid II": "Abdul Hamid Ii"
    },
    {
        ", including ": null
    },
    {
        "Namık Kemal": "Namık Kemal"
    },
    {
        ", ": null
    },
    {
        "Ziya Pasha": "Ziya Pasha"
    },
    {
        " and ": null
    },
    {
        "Midhat Pasha": "Midhat Pasha"
    },
    {
        ", in an attempt to disseminate Baháí thought into their political ideology.  He emphasized Baháís seek freedom and love liberty, hope for equality, are well-wishers of humanity and ready to sacrifice their lives to unite humanity but on a more broad approach than the Young Turks. ": null
    },
    {
        "Abdullah Cevdet": "Abdullah Cevdet"
    },
    {
        ", one of the founders of the ": null
    },
    {
        "Committee of Union and Progress": "Committee Of Union And Progress"
    },
    {
        " who considered the Baháí Faith an intermediary step between Islam and the ultimate abandonment of religious belief, would go on trial for defense of Baháís in a periodical he founded.       ‛Abdul-Bahá also had contact with military leaders as well, including such individuals as ": null
    },
    {
        "Bursalı Mehmet Tahir Bey": "Bursalı Mehmet Tahir Bey"
    },
    {
        " and Hasan Bedreddin. The latter, who was involved in the overthrow of ": null
    },
    {
        "Sultan Abdülaziz": "Abdülaziz Of The Ottoman Empire"
    },
    {
        ", is commonly known as Bedri Paşa or Bedri Pasha and is referred to in Persian Baháí sources as Bedri Bey . He was a Baháí who translated ‛Abdul-Bahas works into French.      Abdul-Bahá also met ": null
    },
    {
        "Muhammad Abduh": "Muhammad Abduh"
    },
    {
        ", one of the key figures of ": null
    },
    {
        "Islamic Modernism": "Islamic Modernism"
    },
    {
        " and the ": null
    },
    {
        "Salafi movement": "Salafi Movement"
    },
    {
        ", in Beirut, at a time when the two men were both opposed to the Ottoman  ulama  and shared similar goals of religious reform.     ": null
    },
    {
        "Rashid Rida": "Rashid Rida"
    },
    {
        " asserts that during his visits to Beirut, Abdul-Bahá would attend Abduhs study sessions.  Regarding the meetings of Abdul-Bahá and Muhammad Abduh, Shoghi Effendi asserts that His several interviews with the well-known Shaykh Muhammad ‘Abdu served to enhance immensely the growing prestige of the community and spread abroad the fame of its most distinguished member.      Due to Abdul-Bahás political activities and alleged accusation against him by Muhammad Ali, a Commission of Inquiry interviewed Abdul-Bahá in 1905, with the result that he was almost exiled to ": null
    },
    {
        "Fezzan": "Fezzan"
    },
    {
        ".    In response, Abdul-Bahá wrote the sultan a letter protesting that his followers refrain from involvement in partisan politics and that his  tariqa  had guided many Americans to Islam.  The next few years in Akka were relatively free of pressures and pilgrims were able to come and visit Abdul-Bahá. By 1909 the mausoleum of the Shrine of the Báb was completed.                  The 1908 ": null
    },
    {
        "Young Turks": "Young Turks"
    },
    {
        " revolution freed all political prisoners in the Ottoman Empire, and Abdul-Bahá was freed from imprisonment. His first action after his freedom was to visit the ": null
    },
    {
        "Shrine of Baháulláh": "Shrine Of Baháulláh"
    },
    {
        " in ": null
    },
    {
        "Bahji": "Bahji"
    },
    {
        ". While Abdul-Bahá continued to live in Akka immediately following the revolution, he soon moved ": null
    },
    {
        "to live": "House Of Abdul-Bahá"
    },
    {
        " in ": null
    },
    {
        "Haifa": "Haifa"
    },
    {
        " near the Shrine of the Báb. In 1910, with the freedom to leave the country, he embarked on a three-year journey to ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", Europe, and North America, spreading the Baháí message.     From August to December 1911, Abdul-Bahá visited cities in Europe, including London, Bristol, and Paris. The purpose of these trips was to support the Baháí communities in the west and to further spread his fathers teachings.     In the following year, he undertook a much more extensive journey to the United States and Canada to once again spread his fathers teachings. He arrived in New York City on 11 April 1912, after declining an offer of passage on the ": null
    },
    {
        "RMS Titanic": "Rms Titanic"
    },
    {
        ", telling the Baháí believers, instead, to Donate this to charity.  He instead travelled on a slower craft, the ": null
    },
    {
        "RMS Cedric": "Rms Cedric"
    },
    {
        ", and cited preference of a longer sea journey as the reason. After hearing of the Titanics sinking on 16 April he was quoted as saying I was asked to sail upon the Titanic, but my heart did not prompt me to do so. While he spent most of his time in New York, he visited Chicago, ": null
    },
    {
        "Cleveland": "Cleveland, Ohio"
    },
    {
        ", ": null
    },
    {
        "Pittsburgh": "Pittsburgh, Pennsylvania"
    },
    {
        ", Washington, D.C., Boston and ": null
    },
    {
        "Philadelphia": "Philadelphia, Pennsylvania"
    },
    {
        ". In August of the same year he started a more extensive journey to places including ": null
    },
    {
        "New Hampshire": "New Hampshire"
    },
    {
        ", the ": null
    },
    {
        "Green Acre": "Green Acre"
    },
    {
        " school in ": null
    },
    {
        "Maine": "Maine"
    },
    {
        ", and ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        " . He then travelled west to ": null
    },
    {
        "Minneapolis": "Minneapolis"
    },
    {
        ", San Francisco, ": null
    },
    {
        "Stanford": "Stanford University"
    },
    {
        ", and Los Angeles before starting to return east at the end of October. On 5 December 1912 he set sail back to Europe.     During his visit to North America he visited many missions, churches, and groups, as well as having scores of meetings in Baháís homes, and offering innumerable personal meetings with hundreds of people.  During his talks he proclaimed Baháí principles such as the ": null
    },
    {
        "unity of God": "God In The Baháí Faith"
    },
    {
        ", ": null
    },
    {
        "unity of the religions": "Baháí Faith And The Unity Of Religion"
    },
    {
        ", ": null
    },
    {
        "oneness of humanity": "Baháí Faith And The Unity Of Humanity"
    },
    {
        ", ": null
    },
    {
        "equality of women and men": "Baháí Faith And Gender Equality"
    },
    {
        ", world peace and economic justice. He also insisted that all his meetings be open to all races.     His visit and talks were the subject of hundreds of newspaper articles. In Boston newspaper reporters asked Abdul-Bahá why he had come to America, and he stated that he had come to participate in conferences on peace and that just giving warning messages is not enough. Abdul-Bahás visit to Montreal provided notable newspaper coverage; on the night of his arrival the editor of the  Montreal Daily Star  met with him and that newspaper along with ": null
    },
    {
        "The Montreal Gazette": "The Montreal Gazette"
    },
    {
        ", Montreal Standard, ": null
    },
    {
        "Le Devoir": "Le Devoir"
    },
    {
        " and ": null
    },
    {
        "La Presse": "La Presse"
    },
    {
        " among others reported on Abdul-Bahás activities.   The headlines in those papers included Persian Teacher to Preach Peace , Racialism Wrong, Says Eastern Sage, Strife and War Caused by Religious and National Prejudices , and Apostle of Peace Meets Socialists, Abdul Bahas Novel Scheme for Distribution of Surplus Wealth.  The Montreal Standard, which was distributed across Canada, took so much interest that it republished the articles a week later; the Gazette published six articles and Montreals largest French language newspaper published two articles about him. His 1912 visit to Montreal also inspired humourist ": null
    },
    {
        "Stephen Leacock": "Stephen Leacock"
    },
    {
        " to parody him in his bestselling 1914 book  Arcadian Adventures with the Idle Rich . Wagner, Ralph D. . Accessed on: 19 May 2008 In Chicago one newspaper headline included His Holiness Visits Us, Not Pius X but A. Baha,  and Abdul-Bahás visit to California was reported in the Palo Altan.     Back in Europe, he visited London, Paris , ": null
    },
    {
        "Stuttgart": "Stuttgart"
    },
    {
        ", ": null
    },
    {
        "Budapest": "Budapest"
    },
    {
        ", and ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        ". Finally, on 12 June 1913, he returned to ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", where he stayed for six months before returning to ": null
    },
    {
        "Haifa": "Haifa"
    },
    {
        ".     On 23 February 1914, at the eve of World War I, Abdul-Bahá hosted Baron ": null
    },
    {
        "Edmond James de Rothschild": "Edmond James De Rothschild"
    },
    {
        ", a member of the ": null
    },
    {
        "Rothschild banking family": "Rothschild Family"
    },
    {
        " who was a leading advocate and financier of the Zionist movement, during one of his early trips to Palestine.           During ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " Abdul-Bahá stayed in Palestine and was unable to travel. He carried on a limited correspondence, which included the  Tablets of the Divine Plan , a collection of 14 letters addressed to the ": null
    },
    {
        "Baháís of North America": "Baháí Faith In North America"
    },
    {
        ", later described as one of three charters of the Baháí Faith. The letters assign a leadership role for the North American Baháís in spreading the religion around the planet.     Haifa was under real threat of ": null
    },
    {
        "Allied": "Allies Of World War I"
    },
    {
        " bombardment, enough that Abdul-Bahá and other Baháís temporarily retreated to the hills east of Akka.     Abdul-Bahá was also under threats from ": null
    },
    {
        "Cemal Paşa": "Djemal Pasha"
    },
    {
        ", the Ottoman military chief who at one point expressed his desire to crucify him and destroy Baháí properties in Palestine. The surprisingly swift ": null
    },
    {
        "Megiddo offensive": "Sinai And Palestine Campaignmegiddo Offensive"
    },
    {
        " of the British ": null
    },
    {
        "General Allenby": "Edmund Allenby, 1St Viscount Allenby"
    },
    {
        " swept away the Turkish forces in Palestine before harm was done to the Baháís, and the war was over less than two months later.          The conclusion of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " led to the openly hostile Ottoman authorities being replaced by the more friendly ": null
    },
    {
        "British Mandate": "Mandatory Palestine"
    },
    {
        ", allowing for a renewal of correspondence, pilgrims, and development of the ": null
    },
    {
        "Baháí World Centre": "Baháí World Centre"
    },
    {
        " properties. It was during this revival of activity that the Baháí Faith saw an expansion and consolidation in places like ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", the ": null
    },
    {
        "Caucasus": "Caucasus"
    },
    {
        ", ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ", ": null
    },
    {
        "Turkmenistan": "Turkmenistan"
    },
    {
        ", ": null
    },
    {
        "North America": "North America"
    },
    {
        " and ": null
    },
    {
        "South Asia": "South Asia"
    },
    {
        " under the leadership of Abdul-Bahá.     The end of the war brought about several political developments that Abdul-Bahá commented on. The ": null
    },
    {
        "League of Nations": "League Of Nations"
    },
    {
        " formed in January 1920, representing the first instance of ": null
    },
    {
        "collective security": "Collective Security"
    },
    {
        " through a worldwide organization. Abdul-Bahá had written in 1875 for the need to establish a Union of the nations of the world , and he praised the attempt through the League of Nations as an important step towards the goal. He also said that it was incapable of establishing Universal Peace because it did not represent all nations and had only trivial power over its member states. Around the same time, the British Mandate supported the ongoing ": null
    },
    {
        "immigration of Jews to Palestine": "Aliyah"
    },
    {
        ". Abdul-Bahá mentioned the immigration as a fulfillment of prophecy, and encouraged the ": null
    },
    {
        "Zionists": "Zionism"
    },
    {
        " to develop the land and elevate the country for all its inhabitants... They must not work to separate the Jews from the other Palestinians.           The war also left the region in famine. In 1901, Abdul-Bahá had purchased about 1704 acres of scrubland near the ": null
    },
    {
        "Jordan river": "Jordan River"
    },
    {
        " and by 1907 many Baháís from Iran had begun ": null
    },
    {
        "sharecropping": "Sharecropping"
    },
    {
        " on the land. Abdul-Bahá received between 20-33% of their harvest , which was shipped to ": null
    },
    {
        "Haifa": "Haifa"
    },
    {
        ". With the war still raging in 1917, Abdul-Bahá received a large amount of wheat from the crops, and also bought other available wheat and shipped it all back to Haifa. The wheat arrived just after the British seized control, and the wheat was widely distributed to allay the famine. For this service in averting a famine in Northern Palestine he received a ": null
    },
    {
        "knighthood": "Order Of The British Empire"
    },
    {
        " at a ceremony held in his honor at the home of the British Governor on 27 April 1920.  , by Mina Yazdani, PhD, Department of Near and Middle Eastern Civilizations, University of Toronto, 2011, pp. 190-191, 199–202. He was later visited by ": null
    },
    {
        "General Allenby": "Edmund Allenby, 1St Viscount Allenby"
    },
    {
        ", ": null
    },
    {
        "King Faisal": "Faisal I Of Iraq"
    },
    {
        " , ": null
    },
    {
        "Herbert Samuel": "Herbert Samuel, 1St Viscount Samuel"
    },
    {
        " , and ": null
    },
    {
        "Ronald Storrs": "Ronald Storrs"
    },
    {
        " .          Abdul-Bahá died on Monday, 28 November 1921, sometime after 1:15 a.m. .     Then Colonial Secretary ": null
    },
    {
        "Winston Churchill": "Winston Churchill"
    },
    {
        " telegraphed the High Commissioner for Palestine, convey to the Baháí Community, on behalf of His Majestys Government, their sympathy and condolescence. Similar messages came from ": null
    },
    {
        "Viscount Allenby": "Edmund Allenby, 1St Viscount Allenby"
    },
    {
        ", the ": null
    },
    {
        "Council of Ministers": "Council Of Ministers"
    },
    {
        " of Iraq, and others.     On his funeral, which was held the next day, Esslemont notes:        Among the talks delivered at the funeral, ": null
    },
    {
        "Shoghi Effendi": "Shoghi Effendi"
    },
    {
        " records ": null
    },
    {
        "Stewart Symes": "Stewart Symes"
    },
    {
        " giving the following tribute:        He was buried in the front room of the ": null
    },
    {
        "Shrine of the Báb": "Shrine Of The Báb"
    },
    {
        " on ": null
    },
    {
        "Mount Carmel": "Mount Carmel"
    },
    {
        ". His interment there is meant to be temporary, until his own mausoleum can be built in the vicinity of Riḍván Garden  Ridvan 2019         Abdul-Bahá left a  Will and Testament  that was originally written between 1901-1908 and addressed to Shoghi Effendi, who at that time was only 4-11 years old. The will appoints Shoghi Effendi as the first in a line of ": null
    },
    {
        "Guardians": "Guardian"
    },
    {
        " of the religion, a hereditary executive role that may provide authoritative interpretations of scripture. Abdul-Bahá directed all Baháís to turn to him and obey him, and assured him of divine protection and guidance. The will also provided a formal reiteration of his teachings, such as the instructions to teach, manifest spiritual qualities, associate with all people, and shun ": null
    },
    {
        "Covenant-breaker": "Covenant-Breaker"
    },
    {
        "s. Many obligations of the ": null
    },
    {
        "Universal House of Justice": "Universal House Of Justice"
    },
    {
        " and the ": null
    },
    {
        "Hands of the Cause": "Hands Of The Cause"
    },
    {
        " were also elaborated. Shoghi Effendi later described the document as one of three charters of the Baháí Faith.     The authenticity and provisions of the will were almost universally accepted by Baháís around the world, with the exception of ": null
    },
    {
        "Ruth White": "Ruth White"
    },
    {
        " and a few other Americans who tried to protest Shoghi Effendis leadership.     During his lifetime there was some ambiguity among Baháís as to his station relative to Baháulláh, and later to Shoghi Effendi. Some American newspapers reported him to be a Baháí prophet or the ": null
    },
    {
        "return of Christ": "Second Coming"
    },
    {
        ". Shoghi Effendi later formalized his legacy as the last of three Central Figures of the Baháí Faith and the Perfect exemplar of the teachings, also claiming that holding him on an equal status to Baháulláh or Jesus was heretical. Shoghi Effendi also wrote that during the anticipated Baháí dispensation of 1000 years there will be no equal to Abdul-Bahá.       The total estimated number of ": null
    },
    {
        "tablets": "Tablet"
    },
    {
        " that Abdul-Bahá wrote are over 27,000, of which only a fraction have been translated into English.  His works fall into two groups including first his direct writings and second his lectures and speeches as noted by others. The first group includes  The Secret of Divine Civilization  written before 1875, A Travellers Narrative written around 1886, the Resāla-ye sīāsīya or Sermon on the Art of Governance written in 1893, the Memorials of the Faithful, and a large number of ": null
    },
    {
        "tablets": "Tablets"
    },
    {
        " written to various people; including various Western intellectuals such as ": null
    },
    {
        "August Forel": "August Forel"
    },
    {
        " which has been translated and published as the ": null
    },
    {
        "Tablet to Auguste-Henri Forel": "Tablet To Dr. Forel"
    },
    {
        ". The Secret of Divine Civilization and the Sermon on the Art of Governance were widely circulated anonymously.     The second group includes ": null
    },
    {
        "Some Answered Questions": "Some Answered Questions"
    },
    {
        ", which is an English translation of a series of table talks with Laura Barney, and ": null
    },
    {
        "Paris Talks": "Paris Talks"
    },
    {
        ", Abdul-Baha in London and Promulgation of Universal Peace which are respectively addresses given by Abdul-Bahá in Paris, London and the United States.     The following is a list of some of Abdul-Bahás many books, tablets, and talks:   ": null
    },
    {
        "Foundations of World Unity": "Foundations Of World Unity"
    },
    {
        " Paris Talks": "Paris Talks"
    },
    {
        " Secret of Divine Civilization": "Secret Of Divine Civilization"
    },
    {
        " Some Answered Questions": "Some Answered Questions"
    },
    {
        " Tablets of the Divine Plan": "Tablets Of The Divine Plan"
    },
    {
        " Tablet to Auguste-Henri Forel": "Tablet To Dr. Forel"
    },
    {
        " Tablet to The Hague": "Tablet To The Hague"
    },
    {
        " Will and Testament of Abdul-Bahá": "Will And Testament Of Abdul-Bahá"
    },
    {
        " ": null
    }
]