[
    {
        "     A Funny Thing Happened on the Way to the Forum is a ": null
    },
    {
        "musical": "Musical Theatre"
    },
    {
        " with music and lyrics by ": null
    },
    {
        "Stephen Sondheim": "Stephen Sondheim"
    },
    {
        " and book by ": null
    },
    {
        "Burt Shevelove": "Burt Shevelove"
    },
    {
        " and ": null
    },
    {
        "Larry Gelbart": "Larry Gelbart"
    },
    {
        ".     Inspired by the ": null
    },
    {
        "farces": "Farce"
    },
    {
        " of the ": null
    },
    {
        "ancient Roman": "Ancient Rome"
    },
    {
        " playwright ": null
    },
    {
        "Plautus": "Plautus"
    },
    {
        " , specifically  Pseudolus ,  Miles Gloriosus , and  Mostellaria , the musical tells the bawdy story of a ": null
    },
    {
        "slave": "Slavery"
    },
    {
        " named Pseudolus and his attempts to win his freedom by helping his young master woo the girl next door. The plot displays many classic elements of ": null
    },
    {
        "farce": "Farce"
    },
    {
        ", including puns, the slamming of doors, cases of ": null
    },
    {
        "mistaken identity": "Mistaken Identity"
    },
    {
        " , and satirical comments on social class. The title derives from a line often used by ": null
    },
    {
        "vaudeville": "Vaudeville"
    },
    {
        " comedians to begin a story: A funny thing happened on the way to the theater .     The musicals original 1962 ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " run won several ": null
    },
    {
        "Tony Awards": "Tony Award"
    },
    {
        ", including Best Musical and Best Author . A Funny Thing has enjoyed several Broadway and ": null
    },
    {
        "West End": "West End Theatre"
    },
    {
        " revivals and was made into a successful ": null
    },
    {
        "film": "A Funny Thing Happened On The Way To The Forum"
    },
    {
        " starring the original lead of the stage musical, ": null
    },
    {
        "Zero Mostel": "Zero Mostel"
    },
    {
        ".           A Funny Thing Happened on the Way to the Forum opened on ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " on May 8, 1962, at the ": null
    },
    {
        "Alvin Theatre": "Neil Simon Theatre"
    },
    {
        ", and then transferred to the ": null
    },
    {
        "Mark Hellinger Theatre": "Mark Hellinger Theatre"
    },
    {
        " and the ": null
    },
    {
        "Majestic Theatre": "Majestic Theatre"
    },
    {
        ", where the show closed on August 29, 1964, after 964 performances and 8 previews.     The shows creators originally wanted ": null
    },
    {
        "Phil Silvers": "Phil Silvers"
    },
    {
        " in the lead role of ": null
    },
    {
        "Pseudolus": "Pseudolus"
    },
    {
        ", but he turned them down, allegedly because he would have to perform onstage without his glasses, and his vision was so poor that he feared tripping into the orchestra pit. He is also quoted as turning down the role for being ": null
    },
    {
        "Sgt. Bilko": "The Phil Silvers Show"
    },
    {
        " in a toga . ": null
    },
    {
        "Milton Berle": "Milton Berle"
    },
    {
        " also passed on the role. Eventually, Zero Mostel was cast. Green, Stanley and Green, Kay. Broadway Musicals, Show By Show , Hal Leonard Corporation, , p. 198     During the out of town pre-Broadway tryouts the show was attracting little business and not playing well. ": null
    },
    {
        "Jerome Robbins": "Jerome Robbins"
    },
    {
        " was called in to give advice and make changes. The biggest change Robbins made was a new opening number to replace Love Is in the Air and introduce the show as a bawdy, wild comedy. Stephen Sondheim wrote the song Comedy Tonight for this new opening. From that point on, the show was a success.     It was directed by ": null
    },
    {
        "George Abbott": "George Abbott"
    },
    {
        " and produced by ": null
    },
    {
        "Hal Prince": "Hal Prince"
    },
    {
        ", with choreography by ": null
    },
    {
        "Jack Cole": "Jack Cole"
    },
    {
        " and uncredited staging and choreography by Robbins. The scenic and costume design was by ": null
    },
    {
        "Tony Walton": "Tony Walton"
    },
    {
        ". This wardrobe is on display at the Costume World Broadway Collection in Pompano Beach, Florida. The lighting design was by ": null
    },
    {
        "Jean Rosenthal": "Jean Rosenthal"
    },
    {
        ". Along with Mostel, the musical featured a cast of seasoned performers, including ": null
    },
    {
        "Jack Gilford": "Jack Gilford"
    },
    {
        " , ": null
    },
    {
        "David Burns": "David Burns"
    },
    {
        ", ": null
    },
    {
        "John Carradine": "John Carradine"
    },
    {
        ", ": null
    },
    {
        "Ruth Kobart": "Ruth Kobart"
    },
    {
        ", and ": null
    },
    {
        "Raymond Walburn": "Raymond Walburn"
    },
    {
        ". The young lovers were played by Brian Davies and Preshy Marker. ": null
    },
    {
        "Karen Black": "Karen Black"
    },
    {
        ", originally cast as the ingenue, was replaced out of town.     The show won several ": null
    },
    {
        "Tony Awards": "Tony Award"
    },
    {
        ": Best Musical, Best Actor, Best Supporting Actor , Best Book, and Best Director. The score, however, was coolly received; it was Sondheims first musical on Broadway in which he wrote both the music and lyrics, and did not earn a nomination for Best Original Score.       The show was presented twice in Londons ": null
    },
    {
        "West End": "West End Theatre"
    },
    {
        ". The 1963 production and its 1986 revival were staged at the ": null
    },
    {
        "Strand Theatre": "Novello Theatre"
    },
    {
        " and the ": null
    },
    {
        "Piccadilly Theatre": "Piccadilly Theatre"
    },
    {
        " respectively,  Guidetomusicaltheatre.com, retrieved December 9, 2009  Thisistheatre.com, retrieved December 9, 2009 and starred ": null
    },
    {
        "Frankie Howerd": "Frankie Howerd"
    },
    {
        " as Pseudolus and ": null
    },
    {
        "Leon Greene": "Leon Greene"
    },
    {
        " as Miles Gloriosus in both. In the 1963 production, ": null
    },
    {
        "Kenneth Connor": "Kenneth Connor"
    },
    {
        " appeared as Hysterium, ": null
    },
    {
        "Monsewer Eddie Gray": "Monsewer Eddie Gray"
    },
    {
        " as ": null
    },
    {
        "Senex": "Senex"
    },
    {
        ", ": null
    },
    {
        "Jon Pertwee": "Jon Pertwee"
    },
    {
        " as Marcus Lycus, and ": null
    },
    {
        "Leon Greene": "Leon Greene"
    },
    {
        " as Miles Gloriosus. In the 1986 revival, ": null
    },
    {
        "Patrick Cargill": "Patrick Cargill"
    },
    {
        " was Senex with ": null
    },
    {
        "Ronnie Stevens": "Ronnie Stevens"
    },
    {
        " as Hysterium and ": null
    },
    {
        "Derek Royle": "Derek Royle"
    },
    {
        " as Erronius.     In 2004 there was a limited-run revival at the ": null
    },
    {
        "Royal National Theatre": "Royal National Theatre"
    },
    {
        ", starring ": null
    },
    {
        "Desmond Barrit": "Desmond Barrit"
    },
    {
        " as Pseudolus, ": null
    },
    {
        "Philip Quast": "Philip Quast"
    },
    {
        " as Miles Gloriosus, ": null
    },
    {
        "Hamish McColl": "Hamish Mccoll"
    },
    {
        " as Hysterium and ": null
    },
    {
        "Isla Blair": "Isla Blair"
    },
    {
        " as Domina . Inverne, James. . Playbill, June 7, 2004, accessed December 25, 2016 This production was nominated for the 2005 ": null
    },
    {
        "Olivier Award": "Olivier Award"
    },
    {
        ", Outstanding Musical Production.  olivierawards.com, accessed December 27, 2016          A Funny Thing Happened on the Way to the Forum was made into a ": null
    },
    {
        "musical film": "Musical Film"
    },
    {
        " in 1966, directed by ": null
    },
    {
        "Richard Lester": "Richard Lester"
    },
    {
        ", with Mostel and Gilford re-creating their Broadway stage roles, ": null
    },
    {
        "Leon Greene": "Leon Greene"
    },
    {
        " reprising his West End stage role, and Phil Silvers in an expanded role as Marcus Lycus . ": null
    },
    {
        "David Burns": "David Burns"
    },
    {
        " did not return for the film role of Senex, which was played in the film by ": null
    },
    {
        "Michael Hordern": "Michael Hordern"
    },
    {
        ". ": null
    },
    {
        "Buster Keaton": "Buster Keaton"
    },
    {
        " made his final film appearance in the role of Erronius. Jon Pertwee, who played Lycus in the London production, appears in a cameo role.       A ": null
    },
    {
        "revival": "Revival"
    },
    {
        " opened on Broadway at the ": null
    },
    {
        "Lunt-Fontanne Theatre": "Lunt-Fontanne Theatre"
    },
    {
        " on April 4, 1972 and closed on August 12, 1972 after 156 performances. Directed by co-author ": null
    },
    {
        "Burt Shevelove": "Burt Shevelove"
    },
    {
        " the cast starred Phil Silvers as Pseudolus , ": null
    },
    {
        "Lew Parker": "Lew Parker"
    },
    {
        " as Senex, ": null
    },
    {
        "Carl Ballantine": "Carl Ballantine"
    },
    {
        " as Lycus and ": null
    },
    {
        "Reginald Owen": "Reginald Owen"
    },
    {
        " as Erronius. ": null
    },
    {
        "Larry Blyden": "Larry Blyden"
    },
    {
        ", who played Hysterium, the role created by Jack Gilford, also co-produced.  sondheimguide.com, accessed December 25, 2016 Pretty Little Picture and Thatll Show Him were dropped from the show, and were replaced with Echo Song , and Farewell . Echo Song and Farewell had been added to a production staged in Los Angeles the previous year and were composed by Sondheim. They had to close soon after Phil Silvers suffered a stroke. The show won two Tony Awards, Best Leading Actor in a Musical for Silvers, and Best Featured Actor in a Musical for Blyden.     The musical was revived again with great success in 1996, opening at the ": null
    },
    {
        "St. James Theatre": "St. James Theatre"
    },
    {
        " on April 18, 1996 and closing on January 4, 1998 after 715 performances. The cast starred ": null
    },
    {
        "Nathan Lane": "Nathan Lane"
    },
    {
        " as Pseudolus , ": null
    },
    {
        "Mark Linn-Baker": "Mark Linn-Baker"
    },
    {
        " as Hysterium, ": null
    },
    {
        "Ernie Sabella": "Ernie Sabella"
    },
    {
        " as Lycus, ": null
    },
    {
        "Jim Stanek": "Jim Stanek"
    },
    {
        " as Hero, ": null
    },
    {
        "Lewis J. Stadlen": "Lewis J. Stadlen"
    },
    {
        " as Senex, and Cris Groenendaal as Miles Gloriosus. The production was directed by ": null
    },
    {
        "Jerry Zaks": "Jerry Zaks"
    },
    {
        ", with choreography by ": null
    },
    {
        "Rob Marshall": "Rob Marshall"
    },
    {
        ". Lane won the 1996 Tony Award for Best Leading Actor and the Drama Desk Award, Outstanding Actor in a Musical; the production was nominated for the 1996 Tony Award and Drama Desk Award, Revival of a Musical. . Playbill , accessed December 26, 2016     Every actor who has opened in the role of Pseudolus on Broadway has won a Best Leading Actor Tony Award for his performance. In addition, ": null
    },
    {
        "Jason Alexander": "Jason Alexander"
    },
    {
        ", who performed as Pseudolus in one scene in  Jerome Robbins Broadway , also won a Tony for Best Actor in a Musical.       The original Australian production with American actor ": null
    },
    {
        "Jack Collins": "Jack Collins"
    },
    {
        " as Pseudolus opened at the ": null
    },
    {
        "Theatre Royal": "Theatre Royal, Sydney"
    },
    {
        " in Sydney in July 1964, and toured other Australian cities through 1965.      In 1998, ": null
    },
    {
        "Jon English": "Jon English"
    },
    {
        " starred as Pseudolus in ": null
    },
    {
        "Essgee Entertainments": "Essgee Entertainment"
    },
    {
        " production that opened New Years Day at the State Theatre, Melbourne and toured Australia and New Zealand, closing September 1999.      The ": null
    },
    {
        "Stephen Sondheim Center for the Performing Arts": "Stephen Sondheim Center For The Performing Arts"
    },
    {
        " produced a limited-run revival of the musical from January 11 to 27, 2008. The production was directed by Randal K. West, with Justin Hill as musical director and Adam Cates as choreographer. The cast featured ": null
    },
    {
        "Richard Kind": "Richard Kind"
    },
    {
        " as Pseudolus, Joel Blum as Senex, ": null
    },
    {
        "Stephen DeRosa": "Stephen Derosa"
    },
    {
        " as Marcus Lycus, Sean McCall as Hysterium, and Steve Wilson as Miles Gloriosus. It also featured Diana Upton-Hill, Ryan Gaffney, Stephen Mark Crisp, Jack Kloppenborg, and Margret Clair.  gazettonline, January 14, 2008  Lipton, Brian Scott.  Theatermania.com, January 4, 2008 Gans, Andrew.  Playbill.com, January 11, 2008     The Chung Ying Theatre Company in Hong Kong staged a Cantonese version of the musical at ": null
    },
    {
        "Kwai Tsing Theatre": "Kwai Tsing Theatre"
    },
    {
        ", to celebrate the companys 30th anniversary. It was directed by ": null
    },
    {
        "Chung King Fai": "Chung King Fai"
    },
    {
        " and Ko Tin Lung and ran from 14 to 21 March 2009.  chungying.com      The ": null
    },
    {
        "Stratford Shakespeare Festival": "Stratford Shakespeare Festival"
    },
    {
        " in ": null
    },
    {
        "Stratford": "Stratford, Ontario"
    },
    {
        ", Ontario, Canada production ran from June 11 to November 7, 2009, with ": null
    },
    {
        "Des McAnuff": "Des Mcanuff"
    },
    {
        " directing and ": null
    },
    {
        "Wayne Cilento": "Wayne Cilento"
    },
    {
        " as choreographer. . Stratfordfestival.ca, accessed August 16, 2011 ": null
    },
    {
        "Bruce Dow": "Bruce Dow"
    },
    {
        " originally performed the role of Pseudolus, but was forced to withdraw from the entire 2009 season due to an injury, and the role was then performed by ": null
    },
    {
        "Seán Cullen": "Seán Cullen"
    },
    {
        " as of September 5, 2009. Bacalzo, Dan. Theatermania.com, August 17, 2009 ": null
    },
    {
        "Stephen Ouimette": "Stephen Ouimette"
    },
    {
        " played Hysterium. ": null
    },
    {
        "Mirvish Productions": "Mirvish Productions"
    },
    {
        " presented the earlier Stratford production at the Canon Theatre, ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        ", in December 2010 through January 2011. Bruce Dow and Sean Cullen were alternates in the lead role. Nestruck, J. Kelly. The Globe and Mail, December 20, 2010     In October 2012 the play opened at ": null
    },
    {
        "Her Majestys Theatre, Melbourne": "Her Majestys Theatre, Melbourne"
    },
    {
        ", Australia, with ": null
    },
    {
        "Geoffrey Rush": "Geoffrey Rush"
    },
    {
        " as Pseudolus, ": null
    },
    {
        "Magda Szubanski": "Magda Szubanski"
    },
    {
        " as Domina and ": null
    },
    {
        "Shane Bourne": "Shane Bourne"
    },
    {
        " as Senex.  , Australian website Stephen Sondheim came to Melbourne specifically to watch the show.     A Funny Thing Happened on the Way to the Forum was produced at Two River Theater in Red Bank, New Jersey from November 14, 2015 to December 13, 2015. The production was performed by an all-male cast . Kennedy, Marina.  broadwayworld.com, November 24, 2015          In ancient Rome, some neighbors live in three adjacent houses. In the center is the house of Senex, who lives there with wife Domina, son Hero, and several slaves, including head slave Hysterium and the musicals main character Pseudolus. A slave belonging to Hero, Pseudolus wishes to buy, win, or steal his freedom. One of the neighboring houses is owned by Marcus Lycus, who is a buyer and seller of beautiful women; the other belongs to the ancient Erronius, who is abroad searching for his long-lost children .     One day, Senex and Domina depart on a visit to Dominas mother and leave Pseudolus in charge of Hero. Hero confides in Pseudolus that he is in love with the lovely Philia, one of the courtesans in the House of Lycus . Pseudolus promises to help him win Philias love in exchange for his own freedom. Unfortunately , Philia has been sold to the renowned warrior ": null
    },
    {
        "Miles Gloriosus": "Miles Gloriosus"
    },
    {
        ", who is expected to claim her very soon. Pseudolus, an excellent liar, uses Philias cheery disposition to convince Lycus that she has picked up a ": null
    },
    {
        "plague": "Yersinia Pestis"
    },
    {
        " from ": null
    },
    {
        "Crete": "Crete"
    },
    {
        ", which causes its victims to smile endlessly in its terminal stages. By offering to isolate her in Senexs house, he is able to give Philia and Hero some time alone together, and the two fall in love. But Philia insists that, even though she is in love with Hero, she must honor her contract with the Captain, for that is the way of a courtesan. To appease her, he tells her to wait inside, and that he will have the captain knock three times when he arrives. Pseudolus comes up with a plan to slip Philia a sleeping potion that will render her unconscious. He will then tell Lycus that she has died of the Cretan plague, and will offer to remove the body. Hero will come along, and they will stow away on a ship headed for Greece. Satisfied with his plan, Pseudolus steals Hysteriums book of potions and has Hero read him the recipe for the sleeping potion; the only ingredient he lacks is mares sweat , and Pseudolus goes off in search of some.     Unexpectedly, Senex returns home early from his trip, and knocks three times on his own door. Philia comes out of the house, and, thinking that Senex is the Captain, offers herself up to him. Surprised but game, Senex instructs Philia to wait in the house for him, and she does. Hysterium arrives to this confusion, and tells Senex that Philia is the new maid that he has hired. Pseudolus returns, having procured the necessary mares sweat; seeing that Senex has returned unexpectedly and grasping the need to keep him out of the way, Pseudolus discreetly sprinkles some of the horse-sweat onto him, then suggests that the road trip has left Senex in dire need of a bath. Taking the bait, Senex instructs Hysterium to draw him a bath in the long-abandoned house of Erronius. But while this is happening, Erronius returns home, finally having given up the search for his long-lost children. Hysterium, desperate to keep him out of the house where his master is bathing, tells the old man that his house has become haunted – a story seemingly confirmed by the sound of Senex singing in his bath. Erronius immediately determines to have a soothsayer come and banish the spirit from his house, and Pseudolus obligingly poses as one, telling Erronius that, in order to banish the spirit, he must travel seven times around the seven hills of Rome .     When Miles Gloriosus arrives to claim his courtesan-bride, Pseudolus hides Philia on the roof of Senexs house; told that she has escaped, Lycus is terrified to face the Captains wrath. Pseudolus offers to impersonate Lycus and talk his way out of the mess but, his ingenuity flagging, he ends up merely telling the Captain that Philia has disappeared, and that he, Lycus , will search for her. Displeased and suspicious, Miles insists that his soldiers accompany Pseudolus, but the wily slave loses them in Romes winding streets.     Complicating matters further, Domina returns from her trip early, suspicious that her husband Senex is up to something low. She disguises herself in virginal white robes and a veil to try to catch Senex being unfaithful. Pseudolus convinces Hysterium to help him by dressing in ": null
    },
    {
        "drag": "Drag"
    },
    {
        " and pretending to be Philia, dead from the plague. Unfortunately, it turns out that Miles Gloriosus has just returned from Crete, where there is of course no actual plague. With the ruse thus revealed, the main characters run for their lives, resulting in a madcap chase across the stage with both Miles and Senex pursuing all three Philia s . Meanwhile, the courtesans from the house of Marcus Lycus   who had been recruited as mourners at Philia s ersatz funeral   have escaped, and Lycus sends his ": null
    },
    {
        "eunuchs": "Eunuch"
    },
    {
        " out to bring them all back, adding to the general pandemonium.     Finally, the Captains troops are able to round everyone up. His plot thoroughly unraveled, Pseudolus appears to be in deep trouble – but Erronius, completing his third circuit of the Roman hills, shows up fortuitously to discover that Miles Gloriosus and Philia are wearing matching rings which mark them as his long-lost children. Philias betrothal to the Captain is nullified by the unexpected revelation that hes her brother, and, as the daughter of a free-born citizen, shes freed from Marcus Lycus. Philia weds Hero; Pseudolus gets his freedom and the lovely courtesan Gymnasia; Gloriosus receives twin courtesans to replace Philia; and Erronius is reunited with his children. A happy ending prevails for all – except for poor Senex, stuck with his shrewish wife Domina.        Pseudolus Pseudolus means Faker . While originally written as a male role, it has been performed by female actors as well.   HeroPhiliaHysterium Senex ": null
    },
    {
        "Roman senator": "Senate Of The Roman Republic"
    },
    {
        " living in a less fashionable suburb of Rome.   DominaMarcus Lycus    Miles Gloriosus ErroniusGymnasiaTintinabulaVibrataGeminaePanaceaProteans             Act I    Act II      Notes:  Sondheim.com, accessed August 16, 2011 The song was later featured in the film  The Birdcage  and performed by ": null
    },
    {
        "Robin Williams": "Robin Williams"
    },
    {
        " and ": null
    },
    {
        "Christine Baranski": "Christine Baranski"
    },
    {
        ". Another draft of the opening number, Invocation and Instructions to the Audience, has been used in subsequent revues of Sondheim songs and was sung by Nathan Lane in the musical  The Frogs . Pretty Little Picture is frequently dropped from productions of the show, and one verse of Im Calm is also frequently trimmed. Other cut songs include Love Story and The Echo Song . . sondheim.com. Retrieved on December 25, 2016. The song Farewell was added to the 1972 Broadway revival.                           Mad Men , which takes place in 1962, several characters refer to the musical. For example, ": null
    },
    {
        "Don Draper": "Don Draper"
    },
    {
        " runs into his former mistress, Rachel Menken, at ": null
    },
    {
        "Sardis": "Sardis"
    },
    {
        ". Rachel and her new husband are on their way to see the show on Broadway.   The musical was referenced in an episode of  Glee ; ": null
    },
    {
        "Shannon Beiste": "Shannon Beiste"
    },
    {
        " claims she has musical experience and states that she played The Forum in a production.   In the  South Park  episode ": null
    },
    {
        "Cherokee Hair Tampons": "Cherokee Hair Tampons"
    }
]