[
    {
        "     A Scanner Darkly is a ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        " novel by American writer ": null
    },
    {
        "Philip K. Dick": "Philip K. Dick"
    },
    {
        ", published in 1977. The semi-": null
    },
    {
        "autobiographical": "Autobiography"
    },
    {
        " story is set in a ": null
    },
    {
        "dystopia": "Dystopia"
    },
    {
        "n ": null
    },
    {
        "Orange County, California": "Orange County, California"
    },
    {
        ", in the then-future of June 1994, and includes an extensive portrayal of ": null
    },
    {
        "drug culture": "Drug Culture"
    },
    {
        " and drug use . The novel is one of Dicks best-known works and served as the basis for a ": null
    },
    {
        "2006 film": "A Scanner Darkly"
    },
    {
        " of the same name, directed by ": null
    },
    {
        "Richard Linklater": "Richard Linklater"
    },
    {
        ".       The ": null
    },
    {
        "protagonist": "Protagonist"
    },
    {
        " is Bob Arctor, member of a household of drug users, who is also living a double life as an undercover police agent assigned to spy on Arctors household. Arctor shields his identity from those in the ": null
    },
    {
        "drug subculture": "Drug Subculture"
    },
    {
        " and from the police. While posing as a drug user, Arctor becomes addicted to Substance D , a powerful ": null
    },
    {
        "psychoactive drug": "Psychoactive Drug"
    },
    {
        ". A conflict is Arctors love for Donna, a drug dealer, through whom he intends to identify high-level dealers of Substance D.     When performing his work as an undercover agent, Arctor goes by the name Fred and wears a scramble suit that conceals his identity from other officers. Then he is able to sit in a police facility and observe his housemates through holo-scanners , audio-visual surveillance devices that are placed throughout the house. Arctors use of the drug causes the two hemispheres of his brain to function independently or compete . When Arctor sees himself in the videos saved by the scanners, he does not realize that it is him. Through a series of drug and psychological tests, Arctors superiors at work discover that his addiction has made him incapable of performing his job as a narcotics agent. They do not know his identity because he wears the scramble suit, but when his police supervisor suggests to him that he might be Bob Arctor, he is confused and thinks it cannot be possible.     Donna takes Arctor to New-Path , a ": null
    },
    {
        "rehabilitation clinic": "Substance-Abuse Rehabilitation"
    },
    {
        ", just as Arctor begins to experience the symptoms of Substance D withdrawal. It is revealed that Donna has been a narcotics agent all along, working as part of a police operation to infiltrate New-Path and determine its funding source. Without his knowledge, Arctor has been selected to penetrate the organization. As part of the rehab program, Arctor is renamed Bruce and forced to participate in cruel group-dynamic games, intended to break the will of the patients.     The story ends with Bruce working at a New-Path farming commune, where he is suffering from a serious ": null
    },
    {
        "neurocognitive": "Neurocognitive"
    },
    {
        " deficit, after withdrawing from Substance D. Although considered by his handlers to be nothing more than a walking shell of a man, Bruce manages to spot rows of blue flowers growing hidden among rows of corn and realizes that the blue flowers are Mors ontologica, the source of Substance D. The book ends with Bruce hiding a flower in his shoe to give to his friends —undercover police agents posing as recovering addicts at the Los Angeles New-Path facility—on Thanksgiving.       A Scanner Darkly is a ": null
    },
    {
        "fictionalized account of real events": "Roman À Clef"
    },
    {
        ", based on Dicks experiences in the 1970s drug culture. Dick said in an interview, Everything in A Scanner Darkly I actually saw.      Between mid-1970 and mid-1972, Dick lived semi-communally with a rotating group of mostly teenage drug users at his home in ": null
    },
    {
        "Marin County": "Marin County"
    },
    {
        ", described in a letter as being located at 707 Hacienda Way, ": null
    },
    {
        "Santa Venetia": "Santa Venetia"
    },
    {
        ".  Dick explained, wife Nancy left me in 1970 ... I got mixed up with a lot of street people, just to have somebody to fill the house. She left me with a four-bedroom, two-bathroom house and nobody living in it but me. So I just filled it with street people and I got mixed up with a lot of people who were into drugs.     During this period, the author ceased writing completely and became fully dependent upon ": null
    },
    {
        "amphetamines": "Amphetamines"
    },
    {
        ", which he had been using intermittently for many years. I did take amphetamines for years in order to be able to—I was able to produce 68 final pages of copy a day, Dick said.     The character of Donna was inspired by an older teenager who became associated with Dick sometime in 1970; though they never became lovers, the woman was his principal female companion until early 1972, when Dick left for Canada to deliver a speech to a Vancouver science fiction convention. This speech, The Android and the Human , served as the basis for many of the recurring themes and motifs in the ensuing novel. Another turning point in this timeframe for Dick is the alleged burglary of his home and theft of his papers.     After delivering The Android and the Human , Dick became a participant in X-Kalay , effortlessly convincing program caseworkers that he was nursing a heroin addiction to do so. Dicks recovery program participation was portrayed in the posthumously released book  The Dark Haired Girl  . It was at X-Kalay, while doing publicity for the facility, that he devised the notion of rehab centers being used to secretly harvest drugs .     In the afterword Dick dedicates the book to those of his friends—he includes himself—who suffered debilitation or death as a result of their drug use. Mirroring the epilogue are the involuntary goodbyes that occur throughout the story—the constant turnover and burn-out of young people that lived with Dick during those years.  In the afterword, he states that the novel is about some people who were punished entirely too much for what they did ,  and that drug misuse is not a disease, it is a decision, like the decision to move out in front of a moving car .       A Scanner Darkly was one of the few Dick novels to gestate over a long period of time. By February 1973, in an effort to prove that the effects of his amphetamine usage were merely psychosomatic, the newly clean-and-sober author had already prepared a full outline.  A first draft was in development by March.  This labor was soon supplanted by a new family and the completion of  Flow My Tears, The Policeman Said  , which was finally released in 1974 and received the prestigious John W. ": null
    },
    {
        "Campbell Award": "Campbell Award"
    },
    {
        ".  Additional preoccupations were the ": null
    },
    {
        "mystical experiences of early 1974": "Philip K. Dickparanormalexperiences"
    },
    {
        " that would eventually serve as a basis for  VALIS  and the  Exegesis  journal; a screenplay for an unproduced film adaptation of 1969s  Ubik ; occasional lectures; and the expedited completion of the deferred ": null
    },
    {
        "Roger Zelazny": "Roger Zelazny"
    },
    {
        " collaboration  Deus Irae  in 1975.     Because of its semi-autobiographical nature, some of A Scanner Darkly was torturous to write. Tessa Dick, Philips wife at the time, once stated that she often found her husband weeping as the sun rose after a night-long writing session. Tessa has given interviews stating that when he was with me, he wrote A Scanner Darkly under two weeks. But we spent three years rewriting it and that she was pretty involved in his writing process for A Scanner Darkly .  Tessa stated in a later interview that she participated in the writing of A Scanner Darkly and said that she consider elf the silent co-author . Philip wrote a contract giving Tessa half of all the rights to the novel, which stated that Tessa participated to a great extent in writing the outline and novel A Scanner Darkly with me, and I owe her one half of all income derived from it .      There was also the challenge of transmuting the events into science fiction , as Dick felt that he could not sell a mainstream or literary novel after several previous failures. Providing invaluable aid in this field was ": null
    },
    {
        "Judy-Lynn del Rey": "Judy-Lynn Del Rey"
    },
    {
        ", head of Ballantine Books SF division, which had optioned the book. Del Rey suggested the timeline change to 1994 and emphasized the more futuristic elements of the novel, such as the scramble suit employed by Fred . Yet much of the dialogue spoken by the characters used hippie slang, dating the events of the novel to their true time-frame of 1970–72.     Upon its publication in 1977, A Scanner Darkly was hailed by ": null
    },
    {
        "ALA": "American Library Association"
    },
    {
        " Booklist as his best yet! ": null
    },
    {
        "Brian Aldiss": "Brian Aldiss"
    },
    {
        " lauded it as the best book of the year , while ": null
    },
    {
        "Robert Silverberg": "Robert Silverberg"
    },
    {
        " praised the novel as a masterpiece of sorts, full of demonic intensity , but concluded that it happens also not to be a very successful novel... a failure, but a stunning failure . Books , Cosmos, September 1977, p. 39. ": null
    },
    {
        "Spider Robinson": "Spider Robinson"
    },
    {
        " panned the novel as sometimes fascinating, sometimes hilarious, usually deadly boring . Galaxy Bookshelf ,  Galaxy Science Fiction , August 1977, p. 141. Sales were typical for the SF genre in America, but hardcover editions were issued in Europe, where all of Dicks works were warmly received.   It was nominated for neither the Nebula nor the Hugo Award but was awarded the British version in 1978  and the French equivalent upon its publication there in 1979.  It also was nominated for the Campbell Award in 1978 and placed sixth in the annual ": null
    },
    {
        "Locus poll": "Locus Award"
    },
    {
        ".       The title of the novel refers to the Biblical phrase ": null
    },
    {
        "Through a glass, darkly": "1 Corinthians 13  Through A Glass, Darkly"
    },
    {
        " , from the ": null
    },
    {
        "King James Version": "King James Version"
    },
    {
        " of 1 Corinthians 13. Passages from ": null
    },
    {
        "Johann Wolfgang von Goethes": "Johann Wolfgang Von Goethe"
    },
    {
        "play  Faust  are also referred to throughout the novel. The ": null
    },
    {
        "same-titled film": "Through A Glass Darkly"
    },
    {
        " by ": null
    },
    {
        "Ingmar Bergman": "Ingmar Bergman"
    },
    {
        " has also been cited as a reference for the book,  the film depicting the similar descent into madness and schizophrenia of its lead character portrayed by ": null
    },
    {
        "Harriet Andersson": "Harriet Andersson"
    },
    {
        ".            The ": null
    },
    {
        "rotoscoped": "Rotoscoping"
    },
    {
        " film  A Scanner Darkly  was authorized by Dicks estate. It was released in July 2006 and stars ": null
    },
    {
        "Keanu Reeves": "Keanu Reeves"
    },
    {
        " as Fred/Bob Arctor and ": null
    },
    {
        "Winona Ryder": "Winona Ryder"
    },
    {
        " as Donna. ": null
    },
    {
        "Rory Cochrane": "Rory Cochrane"
    },
    {
        ", ": null
    },
    {
        "Robert Downey, Jr.": "Robert Downey, Jr."
    },
    {
        ", and ": null
    },
    {
        "Woody Harrelson": "Woody Harrelson"
    },
    {
        " co-star as Arctors drugged-out housemates and friends. The film was directed by ": null
    },
    {
        "Richard Linklater": "Richard Linklater"
    },
    {
        ".       An ": null
    },
    {
        "unabridged": "Abridgement"
    },
    {
        " audiobook": "Audiobook"
    },
    {
        " version, read by ": null
    },
    {
        "Paul Giamatti": "Paul Giamatti"
    },
    {
        ", was released in 2006 by ": null
    },
    {
        "Random House Audio": "Random House Audio"
    },
    {
        " to coincide with the release of the film adaptation. It runs approximately 9.5 hours over eight ": null
    },
    {
        "compact disc": "Compact Disc"
    },
    {
        "s. This version is a ": null
    },
    {
        "tie-in": "Tie-In"
    },
    {
        ", using the films poster as cover art.   ": null
    }
]