[
    {
        "     Abano Terme  is a town and  comune  in the ": null
    },
    {
        "province of Padua": "Province Of Padua"
    },
    {
        ", in the ": null
    },
    {
        "Veneto": "Veneto"
    },
    {
        " region, ": null
    },
    {
        "Italy": "Italy"
    },
    {
        ", on the eastern slope of the ": null
    },
    {
        "Colli Euganei": "Colli Euganei"
    },
    {
        "; it is  southwest by rail from ": null
    },
    {
        "Padua": "Padua"
    },
    {
        ". Abano Termes population is 19,062 .     The towns hot springs and mud baths are an important economic resource. The waters have a temperature of about .       The baths were known to the Romans as  Aponi fons or Aquae Patavinae. A description of them is given in a letter to ": null
    },
    {
        "Theodoric": "Theodoric The Great"
    },
    {
        ", the king of the ": null
    },
    {
        "Ostrogoths": "Ostrogoths"
    },
    {
        ", from ": null
    },
    {
        "Cassiodorus": "Cassiodorus"
    },
    {
        ". Some remains of the ancient baths have been discovered . An oracle of ": null
    },
    {
        "Geryon": "Geryon"
    },
    {
        " lay near, and the so-called sortes Praenestinae , small bronze cylinders inscribed, and used as oracles, were perhaps found here in the 16th century.      The baths were destroyed by the Lombards in the 6th century, but they were rebuilt and enlarged when Abano became an autonomous ": null
    },
    {
        "comune": "Medieval Commune"
    },
    {
        " in the 12th century and, again, in the late 14th century. The city was under the ": null
    },
    {
        "Republic of Venice": "Republic Of Venice"
    },
    {
        " from 1405 to 1797.       ": null
    },
    {
        "Abano Cathedral": "Abano Cathedral"
    },
    {
        ", or the cathedral  of St. Lawrence. The current edifice was erected in 1780 over a pre-existing church which was allegedly destroyed by ": null
    },
    {
        "Cangrande della Scala": "Cangrande Della Scala"
    },
    {
        ". The bell tower has parts from the 9th/10th and 14th centuries.   The Montirone Gallery, housing works of ": null
    },
    {
        "Il Moretto": "Il Moretto"
    },
    {
        ", ": null
    },
    {
        "Palma the Younger": "Palma The Younger"
    },
    {
        ", ": null
    },
    {
        "Guido Reni": "Guido Reni"
    },
    {
        ", ": null
    },
    {
        "Giandomenico Tiepolo": "Giandomenico Tiepolo"
    },
    {
        " and others.   The Sanctuary of the Madonna della Salute or of Monteortone . It lies on the site where the Madonna appeared to Pietro Falco, healing his wounds. The church is on the Latin cross plan, with a nave and two aisles with three apses decorated by a frieze. It has with a Baroque portal , a noteworthy bell tower, presbytery frescoes portraying the Histories of St. Peter and Virgin by ": null
    },
    {
        "Jacopo da Montagnana": "Jacopo Da Montagnana"
    },
    {
        " and ": null
    },
    {
        "Palma the Youngers": "Palma Il Giovane"
    },
    {
        " altarpiece depicting Christ Crucifixed Between St. Augustine and St. Jerome.     Just outside the city is San Daniele Abbey . 6  km from the city is also ": null
    },
    {
        "Praglia Abbey": "Praglia Abbey"
    },
    {
        ", founded in the 11th century by Benedictine monks and rebuilt in 1496–1550. The abbey church of the Assumption, with a marble portal from 1548, has a Renaissance style interior. Noteworthy is the four cloister complex.       ": null
    },
    {
        "Peter of Abano": "Peter Of Abano"
    },
    {
        " , physician and philosopher       ": null
    }
]