[
    {
        "                      Acid rain is a ": null
    },
    {
        "rain": "Rain"
    },
    {
        " or any other form of ": null
    },
    {
        "precipitation": "Precipitation"
    },
    {
        " that is unusually ": null
    },
    {
        "acid": "Acid"
    },
    {
        "ic, meaning that it has elevated levels of hydrogen ions . It can have harmful effects on plants, aquatic animals and infrastructure. Acid rain is caused by emissions of ": null
    },
    {
        "sulfur dioxide": "Sulfur Dioxide"
    },
    {
        " and ": null
    },
    {
        "nitrogen oxide": "Nitrogen Oxide"
    },
    {
        ", which react with the ": null
    },
    {
        "water molecules": "Properties Of Water"
    },
    {
        " in the ": null
    },
    {
        "atmosphere": "Atmosphere"
    },
    {
        " to produce acids. Some governments have made efforts since the 1970s to reduce the release of sulfur dioxide and nitrogen oxide into the atmosphere with positive results. Nitrogen oxides can also be produced naturally by ": null
    },
    {
        "lightning": "Lightning"
    },
    {
        " strikes, and sulfur dioxide is produced by ": null
    },
    {
        "volcanic eruptions": "Types Of Volcanic Eruptions"
    },
    {
        ". Acid rain has been shown to have adverse impacts on forests, freshwaters and soils, killing insect and aquatic life-forms, causing paint to peel, ": null
    },
    {
        "corrosion": "Corrosion"
    },
    {
        " of steel structures such as bridges, and ": null
    },
    {
        "weathering": "Weathering"
    },
    {
        " of stone buildings and statues as well as having impacts on human health.       Acid rain is a popular term referring to the deposition of a mixture from wet and dry acidic components. ": null
    },
    {
        "Distilled water": "Distilled Water"
    },
    {
        ", once ": null
    },
    {
        "carbon dioxide": "Carbon Dioxide"
    },
    {
        " is removed, has a neutral pH of 7. Liquids with a pH less than 7 are acidic, and those with a ": null
    },
    {
        "pH": "Ph"
    },
    {
        " greater than 7 are alkaline. Clean or unpolluted rain has an acidic pH, but usually no lower than 5.7, because carbon dioxide and water in the air react together to form ": null
    },
    {
        "carbonic acid": "Carbonic Acid"
    },
    {
        ", a weak acid according to the following reaction:     : +         Carbonic acid then can ionize in water forming low concentrations of ": null
    },
    {
        "carbonate": "Carbonate"
    },
    {
        " and ": null
    },
    {
        "hydronium": "Hydronium"
    },
    {
        " ions:     : +    − +  +     Unpolluted rain can also contain other chemicals which affect its pH . A common example is ": null
    },
    {
        "nitric acid": "Nitric Acid"
    },
    {
        " produced by ": null
    },
    {
        "electric discharge": "Electric Discharge"
    },
    {
        " in the atmosphere such as ": null
    },
    {
        "lightning": "Lightning"
    },
    {
        ".  Acid deposition as an ": null
    },
    {
        "environmental issue": "Environmental Issue"
    },
    {
        " would include additional acids other than .         The corrosive effect of polluted, acidic city air on limestone and marble was noted in the 17th century by ": null
    },
    {
        "John Evelyn": "John Evelyn"
    },
    {
        ", who remarked upon the poor condition of the ": null
    },
    {
        "Arundel marbles": "Arundel Marbles"
    },
    {
        ". E. S. de Beer, ed.  The Diary of John Evelyn , III, 1955 p. 495.   Since the ": null
    },
    {
        "Industrial Revolution": "Industrial Revolution"
    },
    {
        ", emissions of sulfur dioxide and nitrogen oxides into the atmosphere have increased.  Weathers, K. C. and Likens, G. E. . Acid rain , pp. 1549–1561 in: W. N. Rom and S. Markowitz . Environmental and Occupational Medicine. Lippincott-Raven Publ., Philadelphia. Fourth Edition, . In 1852, ": null
    },
    {
        "Robert Angus Smith": "Robert Angus Smith"
    },
    {
        " was the first to show the relationship between acid rain and atmospheric pollution in ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        ", England. Seinfeld, John H.; Pandis, Spyros N . Atmospheric Chemistry and Physics  — From Air Pollution to Climate Change. John Wiley and Sons, Inc.      In the late 1960s scientists began widely observing and studying the phenomenon.  The term acid rain was coined in 1872 by Robert Angus Smith.  . Epa.gov. Retrieved on February 9, 2013. Canadian Harold Harvey was among the first to research a dead lake. At first the main focus in research lay on local effects of acid rain. ": null
    },
    {
        "Waldemar Christofer Brøgger": "Waldemar Christofer Brøgger"
    },
    {
        " was the first to acknowledge long-distance transportation of pollutants crossing borders from the United Kingdom to Norway.  Public awareness of acid rain in the US increased in the 1970s after  The New York Times  published reports from the ": null
    },
    {
        "Hubbard Brook Experimental Forest": "Hubbard Brook Experimental Forest"
    },
    {
        " in ": null
    },
    {
        "New Hampshire": "New Hampshire"
    },
    {
        " of the harmful environmental effects that result from it.       Occasional pH readings in rain and fog water of well below 2.4 have been reported in industrialized areas. Industrial acid rain is a substantial problem in China and Russia   and areas downwind from them. These areas all burn sulfur-containing ": null
    },
    {
        "coal": "Coal"
    },
    {
        " to generate heat and electricity.      The problem of acid rain has not only increased with population and industrial growth, but has become more widespread. The use of tall smokestacks to reduce local ": null
    },
    {
        "pollution": "Pollution"
    },
    {
        " has contributed to the spread of acid rain by releasing gases into regional atmospheric circulation.   Often deposition occurs a considerable distance downwind of the emissions, with mountainous regions tending to receive the greatest deposition . An example of this effect is the low pH of rain which falls in ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        ".             The earliest report about acid rain in the United States was from the chemical evidence from ": null
    },
    {
        "Hubbard Brook": "Hubbard Brook Experimental Forest"
    },
    {
        " Valley. In 1972, a group of scientists including ": null
    },
    {
        "Gene Likens": "Gene Likens"
    },
    {
        " discovered the rain that was deposited at ": null
    },
    {
        "White Mountains": "White Mountains"
    },
    {
        " of New Hampshire was acidic. The pH of the sample was measured to be 4.03 at Hubbard Brook.  The Hubbard Brook Ecosystem Study followed up with a series of research that analyzed the environmental effects of acid rain. Acid rain that mixed with stream water at Hubbard Brook was neutralized by the alumina from soils.  The result of this research indicates the chemical reaction between acid rain and aluminum leads to increasing rate of soil weathering. Experimental research was done to examine the effects of increased acidity in stream on ecological species. In 1980, a group of scientists modified the acidity of Norris Brook, New Hampshire, and observed the change in species behaviors. There was a decrease in species diversity, an increase in community dominants, and a decrease in the ": null
    },
    {
        "food web": "Food Web"
    },
    {
        " complexity.      In 1980, the US Congress passed an ": null
    },
    {
        "Acid Deposition Act": "Acid Deposition Act"
    },
    {
        ".  This Act established an 18-year assessment and research program under the direction of the National Acidic Precipitation Assessment Program . NAPAP looked at the entire problem from a scientific perspective. It enlarged a network of monitoring sites to determine how acidic the precipitation actually was, and to determine long-term trends, and established a network for dry deposition. It looked at the effects of acid rain and funded research on the effects of acid precipitation on freshwater and terrestrial ecosystems, historical buildings, monuments, and building materials. It also funded extensive studies on atmospheric processes and potential control programs.     From the start, policy advocates from all sides attempted to influence NAPAP activities to support their particular policy advocacy efforts, or to disparage those of their opponents. For the US Governments scientific enterprise, a significant impact of NAPAP were lessons learned in the assessment process and in environmental research management to a relatively large group of scientists, program managers and the public.      In 1981, the ": null
    },
    {
        "National Academy of Sciences": "National Academy Of Sciences"
    },
    {
        " was looking into research about the controversial issues regarding acid rain.  President Ronald Reagan did not place a huge attention on the issues of acid rain  until his personal visit to Canada and confirmed that Canadian border suffered from the drifting pollution from smokestacks in Midwest of US. Reagan honored the agreement to ": null
    },
    {
        "Canadian Prime Minister": "Canadian Prime Minister"
    },
    {
        " Pierre Trudeau": "Pierre Trudeau"
    },
    {
        "’s enforcement of anti-pollution regulation.  In 1982, US President Ronald Reagan commissioned ": null
    },
    {
        "William Nierenberg": "William Nierenberg"
    },
    {
        " to serve on the ": null
    },
    {
        "National Science Board": "National Science Board"
    },
    {
        ".  Nierenberg selected scientists including ": null
    },
    {
        "Gene Likens": "Gene Likens"
    },
    {
        " to serve on a panel to draft a report on acid rain. In 1983, the panel of scientists came up with a draft report, which concluded that acid rain is a real problem and solutions should be sought.  White House ": null
    },
    {
        "Office of Science and Technology Policy": "Office Of Science And Technology Policy"
    },
    {
        " reviewed the draft report and sent ": null
    },
    {
        "Fred Singer": "Fred Singer"
    },
    {
        "’s suggestions of the report, which cast doubt on the cause of acid rain.  The panelists revealed rejections against Singers positions and submitted the report to Nierenberg in April. In May 1983, the House of Representatives voted against legislation that aimed to control sulfur emissions. There was a debate about whether Nierenberg delayed to release the report. Nierenberg himself denied the saying about his suppression of the report and explained that the withheld of the report after the Houses vote was due to the fact that the report was not ready to be published.      In 1991, the US ": null
    },
    {
        "National Acid Precipitation Assessment Program": "National Acid Precipitation Assessment Program"
    },
    {
        " provided its first assessment of acid rain in the United States. The US National Acid Precipitation Assessment Program : 1990 integrated assessment report. Washington, D.C. : National Acid Precipitation Assessment Program, Office of the Director, It reported that 5% of New England Lakes were acidic, with sulfates being the most common problem. They noted that 2% of the lakes could no longer support ": null
    },
    {
        "Brook Trout": "Brook Trout"
    },
    {
        ", and 6% of the lakes were unsuitable for the survival of many species of minnow. Subsequent Reports to Congress have documented chemical changes in soil and freshwater ecosystems, nitrogen saturation, decreases in amounts of nutrients in soil, episodic acidification, regional haze, and damage to historical monuments.     Meanwhile, in 1990, the US Congress passed a series of amendments to the ": null
    },
    {
        "Clean Air Act": "Clean Air Act"
    },
    {
        ".  Title IV of these amendments established the a ": null
    },
    {
        "cap and trade": "Cap And Trade"
    },
    {
        " system designed to control emissions of sulfur dioxide and nitrogen oxides. John Bachmann, David Calkins, Margo Oge.  EPA Alumni Association. September 2017. Pages 26-27. Title IV called for a total reduction of about 10 million tons of SO 2 emissions from power plants, close to a 50% reduction. It was implemented in two phases. Phase I began in 1995, and limited sulfur dioxide emissions from 110 of the largest power plants to a combined total of 8.7 million tons of sulfur dioxide. One power plant in New England was in Phase I. Four other plants were added under other provisions of the program. Phase II began in 2000, and affects most of the power plants in the country.     During the 1990s, research continued. On March 10, 2005, the ": null
    },
    {
        "EPA": "United States Environmental Protection Agency"
    },
    {
        " issued the Clean Air Interstate Rule . This rule provides states with a solution to the problem of power plant pollution that drifts from one state to another. CAIR will permanently cap emissions of SO 2 and NO x in the eastern United States. When fully implemented, CAIR will reduce SO 2 emissions in 28 eastern states and the District of Columbia by over 70% and NO x emissions by over 60% from 2003 levels.      Overall, the programs cap and trade program has been successful in achieving its goals. Since the 1990s, SO 2 emissions have dropped 40%, and according to the ": null
    },
    {
        "Pacific Research Institute": "Pacific Research Institute"
    },
    {
        ", acid rain levels have dropped 65% since 1976. , ": null
    },
    {
        "San Francisco Chronicle": "San Francisco Chronicle"
    },
    {
        ", December 3, 2007.  Conventional regulation was used in the European Union, which saw a decrease of over 70% in SO 2 emissions during the same time period. Gilberston, T. and Reyes, O. 2009. . ": null
    },
    {
        "Dag Hammarskjöld Foundation": "Dag Hammarskjöld Foundation"
    },
    {
        ", ": null
    },
    {
        "United States Environmental Protection Agency": "United States Environmental Protection Agency"
    },
    {
        ", January 2009.     In 2007 the EPA estimated that by 2010, the overall costs of complying with the program for businesses and consumers would be $1 billion to $2 billion a year, only one fourth of what was originally predicted. Forbes says: In 2010, by which time the cap and trade system had been augmented by the George W. Bush administrations Clean Air Interstate Rule, SO2 emissions had fallen to 5.1 million tons.      The term ": null
    },
    {
        "citizen science": "Citizen Science"
    },
    {
        " can be traced back as far as January 1989 and a campaign by the ": null
    },
    {
        "Audubon Society": "National Audubon Society"
    },
    {
        " to measure acid rain. Scientist Muki Haklay cites in a policy report for the ": null
    },
    {
        "Wilson Center": "Woodrow Wilson International Center For Scholars"
    },
    {
        " entitled Citizen Science and Policy: A European Perspective a first use of the term citizen science by R. Kerson in the magazine ": null
    },
    {
        "MIT Technology Review": "Mit Technology Review"
    },
    {
        " from January 1989.   Quoting from the Wilson Center report: The new form of engagement in science received the name citizen science . The first recorded example of the use of the term is from 1989, describing how 225 volunteers across the US collected rain samples to assist the Audubon Society in an acid-rain awareness raising campaign. The volunteers collected samples, checked for acidity, and reported back to the organization. The information was then used to demonstrate the full extent of the phenomenon.       The most important gas which leads to acidification is sulfur dioxide. Emissions of nitrogen oxides which are oxidized to form ": null
    },
    {
        "nitric acid": "Nitric Acid"
    },
    {
        " are of increasing importance due to stricter controls on emissions of sulfur compounds. 70 Tg per year in the form of SO 2 comes from ": null
    },
    {
        "fossil fuel": "Fossil Fuel"
    },
    {
        " combustion and industry, 2.8 Tg from ": null
    },
    {
        "wildfires": "Wildfires"
    },
    {
        " and 7–8 Tg per year from ": null
    },
    {
        "volcanoes": "Volcanoes"
    },
    {
        ". Berresheim, H.; Wine, P.H. and Davies D.D. . Sulfur in the Atmosphere . In Composition, Chemistry and Climate of the Atmosphere, ed. H.B. Singh. Van Nostrand Rheingold        The principal natural ": null
    },
    {
        "phenomena": "Phenomena"
    },
    {
        " that contribute acid-producing gases to the ": null
    },
    {
        "atmosphere": "Earths Atmosphere"
    },
    {
        " are emissions from volcanoes. Thus, for example, ": null
    },
    {
        "fumaroles": "Fumarole"
    },
    {
        " from the Laguna Caliente crater of ": null
    },
    {
        "Poás Volcano": "Poás Volcano"
    },
    {
        " create extremely high amounts of acid rain and fog, with acidity as high as a pH of 2, clearing an area of any vegetation and frequently causing irritation to the eyes and lungs of inhabitants in nearby settlements. Acid-producing gasses are also created by ": null
    },
    {
        "biological": "Biology"
    },
    {
        " processes that occur on the land, in ": null
    },
    {
        "wetlands": "Wetland"
    },
    {
        ", and in the ": null
    },
    {
        "oceans": "Ocean"
    },
    {
        ". The major biological source of sulfur compounds is ": null
    },
    {
        "dimethyl sulfide": "Dimethyl Sulfide"
    },
    {
        ".     Nitric acid in ": null
    },
    {
        "rain": "Rain"
    },
    {
        "water is an important source of fixed ": null
    },
    {
        "nitrogen": "Nitrogen"
    },
    {
        " for plant life, and is also produced by electrical activity in the atmosphere such as ": null
    },
    {
        "lightning": "Lightning"
    },
    {
        ".      Acidic deposits have been detected in ": null
    },
    {
        "glacial ice": "Glacier"
    },
    {
        " thousands of years old in remote parts of the globe.     Soils of ": null
    },
    {
        "coniferous forests": "Coniferous Forests"
    },
    {
        " are naturally very acidic due to the shedding of needles, and the results of this phenomenon should not be confused with acid rain.          The principal cause of acid rain is sulfur and nitrogen compounds from human sources, such as ": null
    },
    {
        "electricity generation": "Electricity Generation"
    },
    {
        ", ": null
    },
    {
        "animal agriculture": "Environmental Impact Of Meat Production"
    },
    {
        ", factories, and ": null
    },
    {
        "motor vehicles": "Motor Vehicle"
    },
    {
        ". Electrical power generation using coal is among the greatest contributors to gaseous pollution responsible for acidic rain. The gases can be carried hundreds of kilometers in the atmosphere before they are converted to acids and deposited. In the past, factories had short funnels to let out smoke but this caused many problems locally; thus, factories now have taller smoke funnels. However, dispersal from these taller stacks causes pollutants to be carried farther, causing widespread ecological damage.       Combustion of fuels produces sulfur dioxide and nitric oxides. They are converted into sulfuric acid and nitric acid. , ScienceDaily, September 28, 1998       In the ": null
    },
    {
        "gas phase": "Gas Phase"
    },
    {
        " sulfur dioxide is oxidized by reaction with the ": null
    },
    {
        "hydroxyl": "Hydroxyl"
    },
    {
        " radical via an ": null
    },
    {
        "intermolecular": "Intermolecular"
    },
    {
        " reaction:   :SO 2 + OH· → HOSO 2 ·   which is followed by:   :HOSO 2 · + O 2 → HO 2 · + SO 3   In the presence of water, ": null
    },
    {
        "sulfur trioxide": "Sulfur Trioxide"
    },
    {
        " is converted rapidly to ": null
    },
    {
        "sulfuric acid": "Sulfuric Acid"
    },
    {
        "Nitrogen dioxide": "Nitrogen Dioxide"
    },
    {
        " reacts with OH to form nitric acid:      :NO 2 + OH· → HNO 3       When clouds are present, the loss rate of SO 2 is faster than can be explained by gas phase chemistry alone. This is due to reactions in the liquid water droplets.     ;Hydrolysis     Sulfur dioxide dissolves in water and then, like carbon dioxide, ": null
    },
    {
        "hydrolyses": "Hydrolysis"
    },
    {
        " in a series of ": null
    },
    {
        "equilibrium": "Chemical Equilibrium"
    },
    {
        " reactions:     :SO 2 + H 2 O  SO 2 ·H 2 O   :SO 2 ·H 2 O  H + + HSO 3 −   :HSO 3 −  H + + SO 3 2−     ;Oxidation     There are a large number of aqueous reactions that ": null
    },
    {
        "oxidize": "Redox"
    },
    {
        " sulfur from S to S, leading to the formation of sulfuric acid. The most important oxidation reactions are with ": null
    },
    {
        "ozone": "Ozone"
    },
    {
        ", ": null
    },
    {
        "hydrogen peroxide": "Hydrogen Peroxide"
    },
    {
        " and ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        " .           Wet deposition of acids occurs when any form of precipitation removes acids from the atmosphere and delivers it to the Earths surface. This can result from the deposition of acids produced in the raindrops or by the precipitation removing the acids either in clouds or below clouds. Wet removal of both gases and aerosols are both of importance for wet deposition.       Acid deposition also occurs via dry deposition in the absence of precipitation. This can be responsible for as much as 20 to 60% of total acid deposition.  This occurs when particles and gases stick to the ground, plants or other surfaces.       Acid rain has been shown to have adverse impacts on forests, freshwaters and soils, killing insect and aquatic life-forms as well as causing damage to buildings and having impacts on human health.          Both the lower pH and higher aluminium concentrations in surface water that occur as a result of acid rain can cause damage to fish and other aquatic animals. At pH lower than 5 most fish eggs will not hatch and lower pH can kill adult fish. As lakes and rivers become more acidic biodiversity is reduced. Acid rain has eliminated insect life and some fish species, including the ": null
    },
    {
        "brook trout": "Brook Trout"
    },
    {
        " in some lakes, streams, and creeks in geographically sensitive areas, such as the Adirondack Mountains of the United States. US EPA:  However, the extent to which acid rain contributes directly or indirectly via runoff from the catchment to lake and river acidity is variable. The United States Environmental Protection Agencys website states: Of the lakes and streams surveyed, acid rain caused acidity in 75% of the acidic lakes and about 50% of the acidic streams . Lakes hosted by silicate basement rocks are more acidic than lakes within limestone or other basement rocks with a carbonate composition due to buffering effects by carbonate minerals, even with the same amount of acid rain.         ": null
    },
    {
        "Soil biology": "Soil Biology"
    },
    {
        " and chemistry can be seriously damaged by acid rain. Some microbes are unable to tolerate changes to low pH and are killed. Rodhe, H., et al. The global distribution of acidifying wet deposition. Environmental Science and TEchnology. vlo. 36, no. 20 p.  4382–8 The ": null
    },
    {
        "enzymes": "Enzyme"
    },
    {
        " of these microbes are ": null
    },
    {
        "denatured": "Denaturation"
    },
    {
        " by the acid. The hydronium ions of acid rain also mobilize ": null
    },
    {
        "toxins": "Toxin"
    },
    {
        ", such as aluminium, and leach away essential nutrients and minerals such as ": null
    },
    {
        "magnesium": "Magnesium"
    },
    {
        ". US EPA:       :2 H + + Mg 2+  2 H + + Mg 2+     Soil chemistry can be dramatically changed when base cations, such as calcium and magnesium, are leached by acid rain thereby affecting sensitive species, such as ": null
    },
    {
        "sugar maple": "Sugar Maple"
    },
    {
        " .            Adverse effects may be indirectly related to acid rain, like the acids effects on soil or high concentration of gaseous precursors to acid rain. High altitude forests are especially vulnerable as they are often surrounded by clouds and fog which are more acidic than rain.     Other plants can also be damaged by acid rain, but the effect on food crops is minimized by the application of lime and fertilizers to replace lost nutrients. In cultivated areas, limestone may also be added to increase the ability of the soil to keep the pH stable, but this tactic is largely unusable in the case of wilderness lands. When calcium is leached from the needles of red spruce, these trees become less cold tolerant and exhibit winter injury and even death. DeHayes, D.H., Schaberg, P.G. and G.R. Strimbeck. . Red Spruce Hardiness and Freezing Injury Susceptibility. In: F. Bigras, ed. Conifer Cold Hardiness. Kluwer Academic Publishers, the Netherlands .               Acid rain has a much less harmful effect on the oceans. Acid rain can cause the oceans pH to fall, making it more difficult for different coastal species to create their ": null
    },
    {
        "exoskeletons": "Exoskeleton"
    },
    {
        " that they need to survive. These coastal species link together as part of the oceans food chain and without them being a source for other marine life to feed off of more marine life will die.      Corals limestone skeletal is sensitive to pH drop, because the ": null
    },
    {
        "calcium carbonate": "Calcium Carbonate"
    },
    {
        ", core component of the limestone dissolves in acidic solutions.       Acid rain does not directly affect human health. The acid in the rainwater is too dilute to have direct adverse effects. The particulates responsible for acid rain do have an adverse effect. Increased amounts of fine particulate matter in the air contribute to heart and lung problems including ": null
    },
    {
        "asthma": "Asthma"
    },
    {
        " and ": null
    },
    {
        "bronchitis": "Bronchitis"
    },
    {
        ". . Epa.gov . Retrieved on 2013-02-09.             Acid rain can damage buildings, historic monuments, and statues, especially those made of rocks, such as ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        " and ": null
    },
    {
        "marble": "Marble"
    },
    {
        ", that contain large amounts of calcium carbonate. Acids in the rain react with the calcium compounds in the stones to create gypsum, which then flakes off.     :CaCO 3 + H 2 SO 4  CaSO 4 + CO 2 + H 2 O     The effects of this are commonly seen on old gravestones, where acid rain can cause the inscriptions to become completely illegible. Acid rain also increases the ": null
    },
    {
        "corrosion": "Corrosion"
    },
    {
        " rate of metals, in particular ": null
    },
    {
        "iron": "Iron"
    },
    {
        ", ": null
    },
    {
        "steel": "Steel"
    },
    {
        ", ": null
    },
    {
        "copper": "Copper"
    },
    {
        " and ": null
    },
    {
        "bronze": "Bronze"
    },
    {
        ".         Places significantly impacted by acid rain around the globe include most of eastern Europe from Poland northward into Scandinavia,  the eastern third of the United States,  and southeastern ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ". Other affected areas include the southeastern coast of China and ": null
    },
    {
        "Taiwan": "Taiwan"
    },
    {
        ".            Many coal-firing ": null
    },
    {
        "power stations": "Power Station"
    },
    {
        " use ": null
    },
    {
        "flue-gas desulfurization": "Flue-Gas Desulfurization"
    },
    {
        " to remove sulfur-containing gases from their stack gases. For a typical coal-fired power station, FGD will remove 95% or more of the SO 2 in the flue gases. An example of FGD is the wet scrubber which is commonly used. A wet scrubber is basically a reaction tower equipped with a fan that extracts hot smoke stack gases from a power plant into the tower. Lime or limestone in slurry form is also injected into the tower to mix with the stack gases and combine with the sulfur dioxide present. The calcium carbonate of the limestone produces pH-neutral ": null
    },
    {
        "calcium sulfate": "Calcium Sulfate"
    },
    {
        " that is physically removed from the scrubber. That is, the scrubber turns sulfur pollution into industrial sulfates.     In some areas the sulfates are sold to chemical companies as ": null
    },
    {
        "gypsum": "Gypsum"
    },
    {
        " when the purity of calcium sulfate is high. In others, they are placed in ": null
    },
    {
        "landfill": "Landfill"
    },
    {
        ". The effects of acid rain can last for generations, as the effects of pH level change can stimulate the continued leaching of undesirable chemicals into otherwise pristine water sources, killing off vulnerable insect and fish species and blocking efforts to ": null
    },
    {
        "restore": "Restoration Ecology"
    },
    {
        " native life.     ": null
    },
    {
        "Fluidized bed combustion": "Fluidized Bed Combustion"
    },
    {
        " also reduces the amount of sulfur emitted by power production.     ": null
    },
    {
        "Vehicle emissions control": "Vehicle Emissions Control"
    },
    {
        " reduces emissions of nitrogen oxides from motor vehicles.       International treaties on the long-range transport of atmospheric pollutants have been agreed for example, the ": null
    },
    {
        "1985 Helsinki Protocol on the Reduction of Sulphur Emissions": "1985 Helsinki Protocol On The Reduction Of Sulphur Emissions"
    },
    {
        " under the ": null
    },
    {
        "Convention on Long-Range Transboundary Air Pollution": "Convention On Long-Range Transboundary Air Pollution"
    },
    {
        ". Canada and the US signed the ": null
    },
    {
        "Air Quality Agreement": "Air Quality Agreement"
    },
    {
        " in 1991. Most European countries and Canada have signed the treaties.             In this regulatory scheme, every current polluting facility is given or may purchase on an open market an emissions allowance for each unit of a designated pollutant it emits. Operators can then install pollution control equipment, and sell portions of their emissions allowances they no longer need for their own operations, thereby recovering some of the capital cost of their investment in such equipment. The intention is to give operators economic incentives to install pollution controls.     The first emissions trading market was established in the United States by enactment of the ": null
    },
    {
        "Clean Air Act Amendments of 1990": "Clean Air Act"
    },
    {
        ". Former Deputy Administrator Hank Habicht talks about management at EPA. An Interview with Hank Habicht ,  . December 21, 2012. The overall goal of the Acid Rain Program established by the Act Clean Air Act Amendments of 1990, 42 U.S. Code": null
    }
]