[
    {
        "Affirming the consequent, sometimes called converse error, fallacy of the converse, or confusion of necessity and sufficiency, is a ": null
    },
    {
        "formal fallacy": "Formal Fallacy"
    },
    {
        " of taking a true ": null
    },
    {
        "conditional": "Indicative Conditional"
    },
    {
        " statement and invalidly inferring its converse even though the converse may not be true. This arises when a consequent has one or more other antecedents .     Converse errors are common in everyday thinking and communication and can result from, among other causes, communication issues, misconceptions about logic, and failure to consider other causes.     The opposite statement, ": null
    },
    {
        "denying the consequent": "Modus Tollens"
    },
    {
        ", is a valid form of argument.       Affirming the consequent is the action of taking a true statement P   Q and invalidly concluding its converse Q   P . The name affirming the consequent  derives from using the consequent, Q, of P   Q , to conclude the antecedent P. This illogic can be summarized formally as   P or, alternatively,   .     The root cause of such a logic error is sometimes failure to realize that just because P is a possible condition for Q, P may not be the only condition for Q, i.e. Q may follow from another condition as well.       Affirming the consequent can also result from overgeneralizing the experience of many statements having true converses. If P and Q are equivalent statements, i.e. P   Q , it is possible to infer P under the condition Q. For example, the statements It is August 13, so it is my birthday P   Q and It is my birthday, so it is August 13 Q   P are equivalent and both true consequences of the statement August 13 is my birthday . Using one statement to conclude the other is not an example of affirming the consequent, but some person misapply the approach.       Example 1     One way to demonstrate the invalidity of this argument form is with a counterexample with true premises but an obviously false conclusion. For example:     :If ": null
    },
    {
        "Bill Gates": "Bill Gates"
    },
    {
        " owns ": null
    },
    {
        "Fort Knox": "United States Bullion Depository"
    },
    {
        ", then Bill Gates is ": null
    },
    {
        "rich": "Wealth"
    },
    {
        ".   :Bill Gates is rich.   :Therefore, Bill Gates owns Fort Knox.     Owning Fort Knox is not the only way to be rich. Any number of other ways to be rich exist.     However, one can affirm with certainty that if someone is not rich , then this person does not own Fort Knox . This is the ": null
    },
    {
        "contrapositive": "Contrapositive"
    },
    {
        " of the first statement, and it must be true if and only if the original statement is true.     Example 2     Here is another useful, obviously-fallacious example, but one that does not require familiarity with who ": null
    },
    {
        "Bill Gates": "Bill Gates"
    },
    {
        " is and what ": null
    },
    {
        "Fort Knox": "United States Bullion Depository"
    },
    {
        " is:     :If an animal is a dog, then it has four legs.   :My cat has four legs.   :Therefore, my cat is a dog.     Here, it is immediately intuitive that any number of other antecedents  can give rise to the consequent , and that it is preposterous to suppose that having four legs must imply that the animal is a dog and nothing else. This is useful as a teaching example since most people can immediately recognize that the conclusion reached must be wrong , and that the method by which it was reached must therefore be fallacious.     Example 3     Arguments of the same form can sometimes seem superficially convincing, as in the following example:     :If Brian had been thrown off the top of the ": null
    },
    {
        "Eiffel Tower": "Eiffel Tower"
    },
    {
        ", then he would be dead.   :Brian is dead.   :Therefore, Brian was thrown off the top of the Eiffel Tower.     Being thrown off the top of the Eiffel Tower is not the only cause of death, since there exist numerous different causes of death.     Affirming the consequent is commonly used in ": null
    },
    {
        "rationalization": "Rationalization"
    },
    {
        ", and thus appears as a ": null
    },
    {
        "coping mechanism": "Coping Mechanism"
    },
    {
        " in some people.     Example 4     In  Catch-22 ,  the chaplain is interrogated for supposedly being Washington Irving / Irving Washington , who has been blocking out large portions of soldiers letters home. The colonel has found such a letter, but with the Chaplains name signed.     : You can read, though, cant you? the colonel persevered sarcastically. The author signed his name.   : Thats my name there.   : Then you wrote it. ": null
    },
    {
        "Q.E.D.": "Q.E.D."
    },
    {
        "     P in this case is The chaplain signs his own name, and Q The chaplains name is written. The chaplains name may be written, but he did not necessarily write it, as the colonel falsely concludes.": null
    }
]