[
    {
        "     The Afghan Hound is a ": null
    },
    {
        "hound": "Hound"
    },
    {
        " that is distinguished by its thick, fine, silky coat and its tail with a ring curl at the end. The breed is selectively bred for its unique features in the cold mountains of ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ". Its local name is Tāžī Spay  or Sag-e Tāzī . Other names for this breed areTāzī, Balkh Hound, Baluchi Hound,  Barakzai Hound, Shalgar Hound, Kabul Hound, Galanday Hound or sometimes incorrectly African Hound. They have the ability to run and turn well. They are also 64 to 69 centimeters tall and weigh 23 to 27 kilograms.                  The Afghan Hound has been identified as a ": null
    },
    {
        "basal breed": "Dog Breedbasal Breeds"
    },
    {
        " that predates the emergence of the modern breeds in the 19th century. It is most closely related to the ": null
    },
    {
        "Saluki": "Saluki"
    },
    {
        ".      Todays modern ": null
    },
    {
        "purebred": "Purebred"
    },
    {
        " Afghan Hound descends from dogs brought to Great Britain in the 1920s which ": null
    },
    {
        "King Amanullah": "King Amanullah"
    },
    {
        " of the ": null
    },
    {
        "Afghan Royal Family": "Afghan Royal Family"
    },
    {
        " gave away as gifts.  Some had been kept as hunting dogs, others as guardians. Afghan Hounds; Pisano, Beverly; TFH Publications; June 1988; p. 12;  and .     Verifiable written or visual records that tie todays Afghan Hound breed to specific Afghan owners or places are absent. There is much speculation about the breeds origin and possible connections with the ancient world among ": null
    },
    {
        "fanciers": "Animal Fancy"
    },
    {
        " and in non-scientific breed books and breed websites. Connections with other types and breeds from the same area may provide clues to the history. A name for a desert coursing Afghan hound, Tazi , suggests a shared ancestry with the very similar Tasy breed from the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        " area of ": null
    },
    {
        "Russia": "Russia"
    },
    {
        " and ": null
    },
    {
        "Turkmenistan": "Turkmenistan"
    },
    {
        ". Other types or breeds of similar appearance are the Taigan from the mountainous ": null
    },
    {
        "Tian Shan": "Tian Shan"
    },
    {
        " region on the Chinese border of Afghanistan, and the ": null
    },
    {
        "Barakzay": "Barakzay"
    },
    {
        ", or ": null
    },
    {
        "Kurram Valley": "Kurram Valley"
    },
    {
        " Hound.     There are at least 13 types known in Afghanistan,  and some are being developed into modern purebred breeds.  As the lives of the peoples with whom these dogs developed change in the modern world, often these ": null
    },
    {
        "landrace": "Landrace"
    },
    {
        " types of dogs lose their use and disappear; there may have been many more types of longhaired sighthound in the past.     Once out of ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ", the history of the Afghan Hound breed became entwined with that of the very earliest ": null
    },
    {
        "dog shows": "Conformation Show"
    },
    {
        " and ": null
    },
    {
        "the Kennel Club": "The Kennel Club"
    },
    {
        " . Various sighthounds were brought to England in the 1800s by army officers returning from ": null
    },
    {
        "British India": "British India"
    },
    {
        " , Afghanistan, and ": null
    },
    {
        "Persia": "Persia"
    },
    {
        ", and were exhibited at dog shows, which were then just becoming popular, under various names, such as Barukzy hounds. They were also called Persian Greyhounds by the English, in reference to their own indigenous sighthound.     One dog in particular, Zardin, was brought in 1907 from India by Captain Bariff,  and became the early ideal of ": null
    },
    {
        "breed type": "Breed Type"
    },
    {
        " for what was still called the Persian Greyhound. Zardin was the basis of the writing of the first breed standard in 1912, but breeding of the dogs was stopped by World War I.     Out of the longhaired sighthound types known in Afghanistan, two main strains make up the modern Afghan Hound breed. The first were a group of hounds brought to ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        " from ": null
    },
    {
        "Balochistan": "Balochistan"
    },
    {
        " by Major and Mrs. G. Bell-Murray and Miss Jean C. Manson in 1920, and are called the Bell-Murray strain.     These dogs were of the lowland or steppe type, also called kalagh, and are less heavily coated. The second strain was a group of dogs from a kennel in ": null
    },
    {
        "Kabul": "Kabul"
    },
    {
        " owned by Mrs. Mary Amps, which she shipped to England in 1925. She and her husband came to Kabul after the Afghan war in 1919, and the foundation sire of her kennel in Kabul was a dog that closely resembled Zardin. Her Ghazni strain were the more heavily coated mountain type. Most of the Afghans in the United States were developed from the Ghazni strain from England. The first Afghans in Australia were imported from the United States in 1934, also of the Ghazni strain.  The French breed club was formed in 1939 . The mountain and steppe strains became mixed into the modern Afghan Hound breed, and a new standard was written in 1948, which is still used today.     The Afghan Hound can also come with a much more patterned coat. This descends from the Bell-Murrays and the Ghazni lines, and is displayed in much lighter feathering of coat, deeper saddle and much shorter hair on the face and neck. It is believed that these particular afghan hounds were a product of much hotter parts of the country.      The spectacular beauty of Afghan Hound dogs caused them to become highly desirable show dogs and pets, and they are recognised by all of the major kennel clubs in the English-speaking world. One of the Amps Ghazni, Sirdar, won BIS at ": null
    },
    {
        "Crufts": "Crufts"
    },
    {
        " in 1928 and 1930. An Afghan hound was featured on the cover of ": null
    },
    {
        "Life Magazine": "Life Magazine"
    },
    {
        ", November 26, 1945. Afghan Hounds were the most popular in Australia in the 1970s…and won most of the major shows. An Afghan Hound won BIS at the 1996 ": null
    },
    {
        "World Dog Show": "World Dog Show"
    },
    {
        " in Budapest.  Afghan hounds were BIS at the ": null
    },
    {
        "Westminster Kennel Club Dog Show": "Westminster Kennel Club Dog Show"
    },
    {
        " in 1957 and again in 1983.  That win also marked the most recent win at Westminster for breeder-owner-handler, Chris Terrell.     The Afghan Hound breed is no longer used for hunting, although it can be seen in the sport of ": null
    },
    {
        "lure coursing": "Lure Coursing"
    },
    {
        ".           The Afghan Hound is tall, standing in height  and weighing . The coat may be any colour, but white markings, particularly on the head, are discouraged; many individuals have a ": null
    },
    {
        "black facial mask": "Melanistic Mask"
    },
    {
        ". A specimen may have facial hair that looks like a ": null
    },
    {
        "Fu Manchu mustache": "Fu Manchu Mustache"
    },
    {
        ". The mustache is called mandarins. Some Afghan Hounds are almost white, but parti-color hounds are penalized in the AKC standard, but not by the FCI. The long, fine-textured coat requires considerable care and grooming. The long topknot and the shorter-haired saddle on the back of the dog are distinctive features of the Afghan Hound coat. The high hipbones and unique small ring on the end of the tail are also characteristics of the breed.     The temperament of the typical Afghan Hound can be aloof and dignified, but happy and clownish when its playing. This breed, as is the case with many sighthounds, has a high prey drive and may not get along with small animals. The Afghan Hound can be a successful competitor in dog agility trials as well as an intuitive therapy dog and companion. Genomic studies have pointed to the Afghan Hound as one of the oldest of dog breeds.      The breed has a reputation among dog trainers of having a relatively slow obedience intelligence; ": null
    },
    {
        "Stanley Coren": "Stanley Coren"
    },
    {
        ", in his book  The Intelligence of Dogs , ranked the breed last among 138 breeds mentioned in ability to understand and obey commands, requiring more than 80 repetitions to understand a new command and obeying on the first command less than 25% of the time. Coren noted that Afghan Hounds were consistently ranked among the least obedient dog breeds among all of the trainers he consulted, with a majority ranking the Afghan Hound in the lowest ten breeds out of 133 listed.      Although seldom used today for hunting in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        " and ": null
    },
    {
        "America": "United States"
    },
    {
        " where they are popular, Afghan hounds are frequent participants in ": null
    },
    {
        "lure coursing": "Lure Coursing"
    },
    {
        " events and are also popular in the ": null
    },
    {
        "sport": "List Of Dog Sports"
    },
    {
        " of ": null
    },
    {
        "conformation show": "Conformation Show"
    },
    {
        "ing.          The Khalag Tazi is a variety of the Afghan. It was introduced to ": null
    },
    {
        "Europe": "Europe"
    },
    {
        " in 1920 when an ": null
    },
    {
        "Indian Army": "Indian Army"
    },
    {
        " officer, Major G Bell-Murray, brought some animals back from ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ". ; Afghan Hound Times  Tazi is a current and ancient name for ": null
    },
    {
        "hunting dogs": "Hunting Dog"
    },
    {
        " of the sighthound type in the ": null
    },
    {
        "Middle East": "Middle East"
    },
    {
        ". It has been used to denote the ": null
    },
    {
        "Saluki": "Saluki"
    },
    {
        ", Afghan, ": null
    },
    {
        "Taigan": "Taigan"
    },
    {
        ", ": null
    },
    {
        "Persian Greyhound": "Persian Greyhound"
    },
    {
        ", ": null
    },
    {
        "greyhound": "Greyhound"
    },
    {
        " types of ": null
    },
    {
        "hound": "Hound"
    },
    {
        ".          Bakhmull  is a long-haired variety of ": null
    },
    {
        "sighthound": "Sighthound"
    },
    {
        ", also classified loosely as a ": null
    },
    {
        "mountain dog": "Mountain Dog"
    },
    {
        " . It has been bred mostly in Russia and claimed to represent an Afghan Hound aboriginal to ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ". In ": null
    },
    {
        "Pashto": "Pashto Language"
    },
    {
        " the word  means velvet, applied in reference to the dogs silky coat, which is rather abundant and long on the whole body, except the saddle , front parts of all four legs, and the muzzle. Its color is always fawn, ivory, or white, with a darker saddle , thus it produces an impression of a dog whose coat color matches the khaki sandstone and limestone of the ": null
    },
    {
        "Hindu Kush": "Hindu Kush"
    },
    {
        " mountain landscape and deserts. The following colors are not permissible: red, red with white spots, black, and black with white spots. Since the 1980s, the centre of Bakhmull breeding is Russia, beginning in Moscow, then spreading to various other places in the ": null
    },
    {
        "CIS": "Commonwealth Of Independent States"
    },
    {
        ". The ": null
    },
    {
        "foundation stock": "Foundation Stock"
    },
    {
        " was brought to Russia in the 1970s by military men returning from Afghanistan. Natalia Gherasiova established the National Bakhmull Club,  affiliated with the ": null
    },
    {
        "Russian Federation for Hunting Dogs": "Russian Federation For Hunting Dogs"
    },
    {
        " and ": null
    },
    {
        "Russian Kynological Federation": "Russian Kynological Federation"
    },
    {
        " . A ": null
    },
    {
        "breed standard": "Breed Standard"
    },
    {
        " was first published in 1985, and a shared RFOS–RKF revision was produced in 1997.      The Bakhmull is expected to be graceful powerful, with a balanced and symmetrical appearance, and to exhibit predictable and comparatively intelligent behavior, including both calm and gregariousness around people , and aggressive hunting in the field.  Bakhmulls hunt solo and in couples. Although its coat is long, it does not require much grooming. Paws are well protected from injuries by feathering . Its long, velvety coat and its stamina makes more suitable than many breeds for harsh weather. The breed standard calls, rather subjectively, for aristocratic gait and a beautiful head with gazelle-like ... eyes . The eyes should be large, brown, slanting upwards, and of almond shape, with rims outlined black. Black coloration is a rigid must on the nose and lips for both white and fawn bakhmulls. Height: 68–73  cm , bitches 65–70  cm . The height at the ": null
    },
    {
        "withers": "Withers"
    },
    {
        " is 3–4  cm higher than at the ": null
    },
    {
        "croup": "Croup"
    },
    {
        ". A Bakhmulls gait should be easy and springy. Prescribed hunting behavior: Searching for prey, a Bakhmull walks or jog-trots. After seeing the game, it immediately starts galloping fast with a whole-body run . Bakhmull runs like a cheetah, but covering long distances, and showing jumping power, speed, and manoeuvring skill.       Bakhmull has an average lifespan of 13–18 years male, 14–19 female.       The ": null
    },
    {
        "Saluki": "Saluki"
    },
    {
        " is a breed of the Middle East with ancient origins  and is the most closely related to the Afghan Hound out of modern and internationally accepted breeds. The ": null
    },
    {
        "Sloughi": "Sloughi"
    },
    {
        ", with a name of the same derivation, is primarily of North African stock and is a separate breed.         Afghan Hounds in UK surveys had an average lifespan of about 12 years.  which is similar to other breeds of their size. In the 2004 UK Kennel Club survey, the most common causes of death were cancer , old age , cardiac , and urologic . Those that die of old age had a median lifespan of 12 years, with 12% living to at least 14.        Major health issues are ": null
    },
    {
        "allergies": "Allergy"
    },
    {
        ", ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ", and ": null
    },
    {
        "hip dysplasia": "Hip Dysplasia"
    },
    {
        " . Sensitivity to ": null
    },
    {
        "anesthesia": "Anesthesia"
    },
    {
        " is an issue the Afghan hound shares with the rest of the ": null
    },
    {
        "sighthound": "Sighthound"
    },
    {
        " group, as sighthounds have relatively low levels of body fat. Afghan hounds are also among the dog breeds most likely to develop ": null
    },
    {
        "chylothorax": "Chylothorax"
    },
    {
        ", a rare condition which causes the thoracic ducts to leak, allowing large quantities of ": null
    },
    {
        "chyle fluid": "Chyle"
    },
    {
        " to enter the dogs chest cavity.   This condition commonly results in a lung-lobe torsion , due to the breeds typically deep, barrel -shaped chest. If not corrected through surgery, chylothorax can ultimately cause fibrosing pleuritis, or a hardening of the organs, due to scar tissue forming around the organs to protect them from the chyle fluid. Chylothorax is not necessarily, but often, fatal.      Among other health problems are ": null
    },
    {
        "laryngeal paralysis": "Laryngeal Paralysis"
    },
    {
        ", ": null
    },
    {
        "dilated cardiomyopathy": "Dilated Cardiomyopathy"
    },
    {
        " , and dermatological issues such as testosterone-responsive ": null
    },
    {
        "dermatosis": "Dermatosis"
    },
    {
        " of male dogs , nasal depigmentation , and ": null
    },
    {
        "skin tumours": "Skin Tumours"
    },
    {
        ". Also, Afghans are prone to ": null
    },
    {
        "Central diabetes insipidus": "Central Diabetes Insipidus"
    },
    {
        " , ": null
    },
    {
        "hypothyroidism": "Hypothyroidism"
    },
    {
        " and ": null
    },
    {
        "tricholemmoma": "Trichilemmoma"
    },
    {
        ", a rare condition which mainly affects older dogs in the middle ages.  Ocular conditions that can occur include medial canthal pocket syndrome , ": null
    },
    {
        "corneal dystrophy": "Corneal Dystrophies In Dogs"
    },
    {
        ", ": null
    },
    {
        "cataract": "Cataract"
    },
    {
        " and generalized progressive retinal atrophy . Afghan ": null
    },
    {
        "myelopathy": "Myelopathy"
    },
    {
        " is sometimes reported.         Because of its distinctive appearance, the Afghan hound has been represented in animated feature films and TV shows, including Universal Pictures  Balto  and Disneys  Lady and the Tramp II: Scamps Adventure  , an Afghan hound also appeared on  101 Dalmatians  as well as in  102 Dalmatians  as one of the dogs in ": null
    },
    {
        "Cruella de Vils": "Cruella De Vil"
    },
    {
        " party and the television series ": null
    },
    {
        "What-a-Mess": "What-A-Mess"
    },
    {
        "  and, as Prissy in the 1961 ": null
    },
    {
        "Disney": "Disney"
    },
    {
        " animated film  One Hundred and One Dalmatians  and  101 Dalmatians II: Patchs London Adventure . Brainy Barker from  Krypto the Superdog  claims to be an Afghan Hound in the episode Meet the Dog Stars , although her design actually resembles that of a ": null
    },
    {
        "Saluki": "Saluki"
    },
    {
        " instead of an Afghan Hound. ": null
    },
    {
        "Mallory Archer": "Mallory Archer"
    },
    {
        " in the show ": null
    },
    {
        "Archer": "Archer"
    },
    {
        " had an Afghan hound named Duchess at some point during the childhood of her son, ": null
    },
    {
        "Sterling Archer": "Sterling Archer"
    },
    {
        ". The dog is a point of contention between the two, due to Mallorys apparent preference for it over her son.     Afghan hounds have also been featured in television advertisements and in fashion magazines.  The Afghan hound is represented in books as well, including being featured in a series of mystery novels by Nina Wright , and a talking Afghan Hound in David Rothmans The Solomon Scandals . In the novel  Between the Acts , ": null
    },
    {
        "Virginia Woolf": "Virginia Woolf"
    },
    {
        " uses an Afghan hound to represent aspects of one of the books human characters. The Philosophy of Virginia Woolf: A Philosophical Reading of the Mature Novels   By A. O. Frank   Published by Akademiai Kiado, 2001   , 978-963-05-7850-9   165 pages, pg. 151     On August 3, 2005, Korean scientist ": null
    },
    {
        "Hwang Woo-Suk": "Hwang Woo-Suk"
    },
    {
        " announced that his team of researchers had become the first team to successfully ": null
    },
    {
        "clone": "Cloning"
    },
    {
        " a dog, an Afghan Hound named ": null
    },
    {
        "Snuppy": "Snuppy"
    },
    {
        ". In 2006 Hwang Woo-Suk was dismissed from his university position for fabricating data in his research. Snuppy, nonetheless, was a genuine clone, and thus the first cloned dog in history.      The Afghan Hound features prominently in the ": null
    },
    {
        "avant-garde": "Avant-Garde"
    },
    {
        " music video": "Music Video"
    },
    {
        " of popular French band ": null
    },
    {
        "M83s": "M83"
    },
    {
        ", Set in Stone . ": null
    }
]