[
    {
        "   Agathocles  was a ": null
    },
    {
        "Greek": "Greeks"
    },
    {
        " tyrant": "Tyrant"
    },
    {
        " of ": null
    },
    {
        "Syracuse": "Syracuse, Sicily"
    },
    {
        " and self-styled king of ": null
    },
    {
        "Sicily": "Sicily"
    },
    {
        " .       Agathocles was born at Thermae ": null
    },
    {
        "Himera": "Himera"
    },
    {
        "eae  in Sicily. The son of a ": null
    },
    {
        "potter": "Pottery"
    },
    {
        " who had moved to Syracuse in about 343 BC, he learned his fathers trade, but afterwards entered the army along with his brother ": null
    },
    {
        "Antander": "Antander"
    },
    {
        ". In 333 BC he married the ": null
    },
    {
        "widow": "Widow"
    },
    {
        " of his patron Damas, a distinguished and wealthy citizen. He was twice ": null
    },
    {
        "banished": "Exile"
    },
    {
        " for attempting to overthrow the ": null
    },
    {
        "oligarchical": "Oligarchy"
    },
    {
        " party in Syracuse.     In 317 BC he returned with an army of ": null
    },
    {
        "mercenaries": "Mercenary"
    },
    {
        " under a solemn oath to observe the ": null
    },
    {
        "democratic": "Democracy"
    },
    {
        " constitution": "Constitution"
    },
    {
        " which was established after they took the city. Having massacred the oligarchs and the richest of the citizenry, he thus made himself master of Syracuse, and he created a strong army and fleet and subdued the greater part of Sicily.     War with ": null
    },
    {
        "Carthage": "Carthage"
    },
    {
        " followed. In 311 BC Agathocles was defeated in the ": null
    },
    {
        "Battle of the Himera River": "Battle Of The Himera River"
    },
    {
        " and ": null
    },
    {
        "besieged": "Siege"
    },
    {
        " in Syracuse. In 310 BC he made a desperate effort to break through the ": null
    },
    {
        "blockade": "Blockade"
    },
    {
        " and attack the enemy in ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ".     In 309/8 BC, Agathocles turned his attention towards ": null
    },
    {
        "Ophellas": "Ophellas"
    },
    {
        ", ruler of ": null
    },
    {
        "Cyrenaica": "Cyrenaica"
    },
    {
        " as likely to prove a useful ally in his war against the Carthaginians. In order to gain him over he promised to cede to him whatever conquests their combined forces might make in Africa, reserving to himself only the possession of Sicily. Diodorus xx. 40.1-4 Ophellas gathered a powerful army from the homeland of his wife Euthydike , ": null
    },
    {
        "Athens": "Athens"
    },
    {
        ", where many citizens felt disgruntled after having lost their voting rights. Notwithstanding all the natural obstacles which presented themselves on his route, succeeded in reaching the Carthaginian territories after a toilsome and perilous march of more than two months duration. Diodorus xx. 41-42 He was received by Agathocles with every demonstration of friendship, and the two armies encamped near each other: but not many days had elapsed when Agathocles betrayed his new ally, attacked the camp of the Cyrenaeans, and had Ophellas himself killed. Diodorus xx. 42.4-5; 43.3-4 The Cyrenean troops, left without a leader, went over to Agathocles.     Following several victories he was at last completely defeated and fled secretly to Sicily. After concluding peace with Carthage in 306 BC, Agathocles styled himself king of Sicily in 304 BC, and established his rule over the ": null
    },
    {
        "Greek": "Greece"
    },
    {
        " cities of the island more firmly than ever. A peace treaty with Carthage left him in control of Sicily east of the ": null
    },
    {
        "Halycus River": "Halycus"
    },
    {
        ". Even in his old age he displayed the same restless energy, and is said to have been contemplating a fresh attack on Carthage at the time of his death.     His last years were plagued by ill-health and the turbulence of his grandson ": null
    },
    {
        "Archagathus": "Archagathus"
    },
    {
        ", at whose instigation he is said to have been ": null
    },
    {
        "poison": "Poison"
    },
    {
        "ed; according to others, he died a natural death. He was a born leader of mercenaries, and, although he did not shrink from cruelty to gain his ends, he afterwards showed himself a mild and popular tyrant . Agathocles restored the Syracusan democracy on his death bed and did not want his sons to succeed him as king.     Agathocles was married three times. His first wife was the widow of his patron Damas by whom he had two sons: ": null
    },
    {
        "Archagathus": "Archagathus"
    },
    {
        " and his brother, who were both murdered in 307 BC. His second wife was Alcia and they had a daughter called ": null
    },
    {
        "Lanassa": "Lanassa"
    },
    {
        ", who married as the second wife of King ": null
    },
    {
        "Pyrrhus of Epirus": "Pyrrhus Of Epirus"
    },
    {
        ", and a son, Agathocles, who was murdered in a succession dispute shortly before his fathers death. His third wife was the ": null
    },
    {
        "Greek Ptolemaic Princess": "Ptolemaic Dynasty"
    },
    {
        " Theoxena": "Theoxena Of Syracuse"
    },
    {
        ", who was the second daughter of ": null
    },
    {
        "Berenice I": "Berenice I Of Egypt"
    },
    {
        " from her first husband ": null
    },
    {
        "Philip": "Philip"
    },
    {
        " and was a stepdaughter of ": null
    },
    {
        "Ptolemy I Soter": "Ptolemy I Soter"
    },
    {
        ". Theoxena bore Agathocles two children: ": null
    },
    {
        "Archagathus": "Archagathus Of Libya"
    },
    {
        " and ": null
    },
    {
        "Theoxena": "Theoxena Of Egypt"
    },
    {
        ". Theoxena survived Agathocles. He had further descendants from his second and third marriage.       Agathocles was cited as an example Of Those Who By Their Crimes Come to Be Princes in Chapter VIII of ": null
    },
    {
        "Niccolò Machiavellis": "Niccolò Machiavelli"
    },
    {
        "treatise on politics -  The Prince  .   He was described as behaving as a criminal at every stage of his career. Machiavelli claimed:      Machiavelli goes on to reason that Agathocles success, in contrast to other criminal tyrants, was due to his ability to commit his crimes quickly and ruthlessly, and states that cruelties are best used when they      However, he came to glory as much as he did brutality by repelling invading Carthaginians and winning the loyalty of the denizens of his land.                         ": null
    }
]