[
    {
        "         Dame Agatha Mary Clarissa Christie, Lady Mallowan,   was an English writer. She is known for her 66 detective novels and 14 short story collections, particularly those revolving around her fictional detectives ": null
    },
    {
        "Hercule Poirot": "Hercule Poirot"
    },
    {
        " and ": null
    },
    {
        "Miss Marple": "Miss Marple"
    },
    {
        ". Christie also wrote the worlds longest-running play, a murder mystery,  The Mousetrap ,  and, under the pen name Mary Westmacott, six ": null
    },
    {
        "romances": "Romance Novel"
    },
    {
        ". In 1971 she was appointed a ": null
    },
    {
        "Dame Commander of the Order of the British Empire": "Dame Commander Of The Order Of The British Empire"
    },
    {
        " for her contribution to literature.       Christie was born into a wealthy upper-middle-class family in ": null
    },
    {
        "Torquay": "Torquay"
    },
    {
        ", ": null
    },
    {
        "Devon": "Devon"
    },
    {
        ". Before marrying and starting a family in London, she had served in a Devon hospital during the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ", tending to troops coming back from the trenches. She was initially an unsuccessful writer with six consecutive rejections,  but this changed when  The Mysterious Affair at Styles , featuring Hercule Poirot, was published in 1920.  During the Second World War, she worked as a pharmacy assistant at University College Hospital, London, acquiring a good knowledge of poisons which feature in many of her novels.      Guinness World Records  lists Christie as the best-selling novelist of all time. Her novels have sold roughly 2 billion copies, and her ": null
    },
    {
        "estate": "Estate"
    },
    {
        " claims that her works come third in the rankings of the worlds most-widely published books, behind only ": null
    },
    {
        "Shakespeares": "William Shakespeare"
    },
    {
        " works and the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        ". According to ": null
    },
    {
        "Index Translationum": "Index Translationum"
    },
    {
        ", she remains the ": null
    },
    {
        "most-translated individual author": "List Of Most-Translated Individual Authors"
    },
    {
        ", having been translated into at least 103 languages.  And Then There Were None  is Christies best-selling novel, with 100 million sales to date, making it the worlds best-selling mystery ever, and one of the ": null
    },
    {
        "best-selling books": "List Of Best-Selling Books"
    },
    {
        " of all time. Christies stage play  The Mousetrap  holds the world record for longest initial run. It opened at the ": null
    },
    {
        "Ambassadors Theatre": "Ambassadors Theatre"
    },
    {
        " in the ": null
    },
    {
        "West End": "West End Theatre"
    },
    {
        " on 25 November 1952, and  is still running after more than 27,000 performances.  , the-mousetrap.co.uk; accessed 2 June 2015.      In 1955, Christie was the first recipient of the ": null
    },
    {
        "Mystery Writers of Americas": "Mystery Writers Of America"
    },
    {
        "highest honour, the ": null
    },
    {
        "Grand Master Award": "Mwa Grand Master Award"
    },
    {
        ". Later the same year,  Witness for the Prosecution  received an ": null
    },
    {
        "Edgar Award": "Edgar Award"
    },
    {
        " by the MWA for Best Play.    In 2013,  The Murder of Roger Ackroyd  was voted the best crime novel ever by 600 fellow writers of the ": null
    },
    {
        "Crime Writers Association": "Crime Writers Association"
    },
    {
        ".  On 15 September 2015, coinciding with her 125th birthday,  And Then There Were None  was named the Worlds Favourite Christie in a vote sponsored by the authors estate.  Most of her books and ": null
    },
    {
        "short stories": "Short Story"
    },
    {
        " have been adapted for television, radio, video games and comics, and more than thirty feature films have been based on her work.         Agatha Mary Clarissa Miller was born on 15 September 1890 into a wealthy ": null
    },
    {
        "upper-middle-class": "Upper-Middle-Class"
    },
    {
        " family in Torquay, Devon. She was the youngest of three children born to Frederick Alvah Miller, a ": null
    },
    {
        "gentleman": "Gentleman"
    },
    {
        " of substance , and his wife Clarissa Margaret Miller née Boehmer.   Marriage Register. St Peters Church, Bayswater Middlesex, 1878, No. 399, p. 200. Birth Certificate. General Register Office , 1890 September Quarter, NEWTON ABBOT, volume 5b, page 151. Baptism Register. Parish of Tormohun, Devon, 1890, No. 267,         Christies mother Clara was born in ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        " in 1854 1871 England Census. Class: RG10; Piece: 3685; Folio: 134; Page: 44   and his second wife Mary Ann Boehmer née West. Boehmer died aged 49 of bronchitis in ": null
    },
    {
        "Jersey": "Jersey"
    },
    {
        " in April 1863, leaving his widow to raise Clara and her three brothers alone on a meagre income.   Two weeks after Boehmers death, Marys sister Margaret West married widowed dry goods merchant Nathaniel Frary Miller, a ": null
    },
    {
        "U.S.": "United States"
    },
    {
        " citizen. https://www.familysearch.org/ark:/61903/3:1:S3HY-6LM7-W15?i299 Marriage Register. Parish of Westbourne, Sussex, 1863, No. 318, p. 159. To assist Mary financially, the newlyweds agreed to foster nine year old Clara. The family settled in ": null
    },
    {
        "Timperley": "Timperley"
    },
    {
        ", ": null
    },
    {
        "Cheshire": "Cheshire"
    },
    {
        ". ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " and travelled extensively after leaving his Swiss boarding school. He and Clara eventually formed a romantic attachment and were married in ": null
    },
    {
        "St Peters Church": "St Peters, Notting Hill"
    },
    {
        ", ": null
    },
    {
        "Notting Hill": "Notting Hill"
    },
    {
        ", in April 1878.      Fred and Claras first child, Margaret Frary , was born in Torquay in 1879, Birth Certificate. General Register Office , 1879 March Quarter, NEWTON ABBOT, volume 5b, page 162. where the couple were renting lodgings. Their second child, Louis Montant , was born in ": null
    },
    {
        "Morristown": "Morristown, New Jersey"
    },
    {
        ", ": null
    },
    {
        "New Jersey": "Morristown, New Jersey"
    },
    {
        ", in 1880  while they were making an extended visit to the ": null
    },
    {
        "United States": "United States"
    },
    {
        ". When Freds father died in 1869, Death Certificate. General Register Office , 1869 June Quarter, WESTBOURNE, volume 02B, page 230. he left Clara £2000; they used this money to purchase the leasehold of a villa in Torquay named ": null
    },
    {
        "Ashfield": "Ashfield, Torquay"
    },
    {
        " in which to raise their family. It was here that their third and final child, Agatha, was born in 1890.         Christie described her childhood as very happy .  She was surrounded by a series of strong and independent women from an early age.  She lived primarily in Devon, but made occasional visits to the homes of her step-grandmother/great-aunt Margaret Miller in ": null
    },
    {
        "Ealing": "Ealing"
    },
    {
        " and maternal grandmother Mary Boehmer in ": null
    },
    {
        "Bayswater": "Bayswater"
    },
    {
        ". One year of her childhood was spent abroad with her family, in the ": null
    },
    {
        "French Pyrenees": "Pyrenees"
    },
    {
        ", ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", ": null
    },
    {
        "Dinard": "Dinard"
    },
    {
        ", and ": null
    },
    {
        "Guernsey": "Guernsey"
    },
    {
        ".      Christie was raised in a household with various ": null
    },
    {
        "esoteric": "Esotericism"
    },
    {
        " beliefs and, like her siblings, believed that her mother Clara was a psychic with the ability of ": null
    },
    {
        "second sight": "Second Sight"
    },
    {
        ".  Christies sister Madge had been sent to ": null
    },
    {
        "Roedean School": "Roedean School"
    },
    {
        " in Sussex for her education, but their mother insisted that Christie receive a ": null
    },
    {
        "home education": "Home Education"
    },
    {
        ". As a result, her parents were responsible for teaching her to read and write and to master basic arithmetic, a subject she particularly enjoyed. They also taught her music, and she learned to play both the piano and the mandolin.  According to one biographer, Clara believed that Christie should not learn to read until she was eight. However, thanks to her own curiosity, Christie taught herself to read much earlier.  One of the earliest known photographs of Christie depicts her as a little girl with her first dog, named George Washington by her patriotic father but which she called Tony.      Christie was a voracious reader from an early age. Among her earliest memories were those of reading the childrens books written by ": null
    },
    {
        "Mrs Molesworth": "Mary Louisa Molesworth"
    },
    {
        ", including The Adventures of Herr Baby , Christmas Tree Land , and The Magic Nuts . She also read the work of ": null
    },
    {
        "Edith Nesbit": "Edith Nesbit"
    },
    {
        ", including  The Story of the Treasure Seekers  ,  The Phoenix and the Carpet  , and  The Railway Children  . When a little older, she moved on to reading the surreal verse of ": null
    },
    {
        "Edward Lear": "Edward Lear"
    },
    {
        " and ": null
    },
    {
        "Lewis Carroll": "Lewis Carroll"
    },
    {
        ".  In April 1901, at age 10, she wrote her first poem, The cowslip .      Although she devoted much time to her pets, Christie spent much of her childhood apart from other children. She eventually made friends with a group of other girls in Torquay, noting that one of the highlights of my existence was her appearance with them in a youth production of ": null
    },
    {
        "Gilbert and Sullivans": "Gilbert And Sullivan"
    },
    {
        "  The Yeomen of the Guard , in which she played the hero, Colonel Fairfax.  This was her last operatic role for, as she later wrote, an experience that you really enjoyed should never be repeated.       By 1901, Christies fathers health had deteriorated, due to what he believed were heart problems.  Fred died in November 1901 from pneumonia and chronic kidney disease. Death Certificate. General Register Office , 1901 December Quarter, BRENTFORD, volume 3A, page 71. The familys financial situation had by this time declined significantly. Christie and her mother Clara continued to live in their Torquay home. Christies sister Madge married the year after their fathers death and moved to ": null
    },
    {
        "Cheadle": "Cheadle, Greater Manchester"
    },
    {
        ",  Cheshire. Christies brother Monty was overseas, serving in a British regiment. Christie later claimed that her fathers death, occurring when she was 11 years old, marked the end of her childhood.      In 1902, Christie began attending Miss Guyers Girls School in Torquay but found it difficult to adjust to the disciplined atmosphere. In 1905, she was sent to Paris where she was educated in three  pensions   – Mademoiselle Cabernets, Les Marroniers, and then Miss Drydens  – the last of which served primarily as a ": null
    },
    {
        "finishing school": "Finishing School"
    },
    {
        ".        After completing her education, Christie returned to ": null
    },
    {
        "England": "England"
    },
    {
        " and found her mother ailing. They decided to spend time together in the warmer climate of ": null
    },
    {
        "Cairo": "Cairo"
    },
    {
        ", then a regular tourist destination for wealthy Britons. They stayed for three months at the ": null
    },
    {
        "Gezirah Palace Hotel": "Gezirah Palace"
    },
    {
        ". Christie attended many social functions and particularly enjoyed watching polo. She visited ancient Egyptian monuments such as the ": null
    },
    {
        "Great Pyramid of Giza": "Great Pyramid Of Giza"
    },
    {
        ", but did not exhibit the great interest in ": null
    },
    {
        "archaeology": "Archaeology"
    },
    {
        " and ": null
    },
    {
        "Egyptology": "Egyptology"
    },
    {
        " that became prominent in her later years.  Returning to ": null
    },
    {
        "Britain": "Britain"
    },
    {
        ", she continued her social activities, writing and performing in amateur theatricals. She also helped put on a play called The Blue Beard of Unhappiness with female friends. Her writing extended to both poetry and music. Some early works saw publication, but she decided against focusing on writing or music as future professions.      Christie wrote her first short story, The House of Beauty  while recovering in bed from an undisclosed illness. This was about 6,000 words on the topic of madness and dreams , a subject of fascination for her. One of her biographers has commented that, despite infelicities of style , the story was nevertheless compelling .  Other stories followed, most of them illustrating her interest in spiritualism and the paranormal. These included ": null
    },
    {
        "The Call of Wings": "The Hound Of Deaththe Call Of Wings"
    },
    {
        " and ": null
    },
    {
        "The Little Lonely God": "While The Light Lasts And Other Stories"
    },
    {
        " . Magazines rejected all her early submissions, made under pseudonyms , although some submissions were revised and published later, often with new titles.      Christie then set her first novel, Snow Upon the Desert, in ": null
    },
    {
        "Cairo": "Cairo"
    },
    {
        " and drew from her recent experiences in that city, writing under the pseudonym Monosyllaba. She was disappointed when the various publishers she contacted all declined.  Clara suggested that her daughter ask for advice from a family friend and neighbour, the writer ": null
    },
    {
        "Eden Philpotts": "Eden Philpotts"
    },
    {
        ", who obliged her enquiry, encouraged her writing, and sent her an introduction to his own literary agent, Hughes Massie, who rejected Snow Upon the Desert and suggested a second novel.  Meanwhile, her social activities expanded. She entered into short-lived relationships with four separate men and an engagement with another.  She then met ": null
    },
    {
        "Archibald Christie": "Archie Christie"
    },
    {
        " at a dance given by ": null
    },
    {
        "Lord and Lady Clifford": "Baron Clifford Of Chudleigh"
    },
    {
        " at ": null
    },
    {
        "Ugbrooke": "Ugbrooke"
    },
    {
        ", about  from Torquay. Archie was born in ": null
    },
    {
        "India": "British India"
    },
    {
        ", the son of a ": null
    },
    {
        "barrister": "Barrister"
    },
    {
        " in the ": null
    },
    {
        "Indian Civil Service": "Indian Civil Service"
    },
    {
        ". He was an army officer who was seconded to the ": null
    },
    {
        "Royal Flying Corps": "Royal Flying Corps"
    },
    {
        " in April 1913. The couple quickly fell in love. Upon learning that he would be stationed in ": null
    },
    {
        "Farnborough": "Farnborough Airfield"
    },
    {
        ", Archie proposed marriage, and Agatha accepted.      With the outbreak of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " in August 1914, Archie was sent to ": null
    },
    {
        "France": "France"
    },
    {
        " to fight the ": null
    },
    {
        "German forces": "German Army"
    },
    {
        ". They married on the afternoon of Christmas Eve 1914 at Emmanuel Church, ": null
    },
    {
        "Clifton, Bristol": "Clifton, Bristol"
    },
    {
        ", which was close to the home of his mother and stepfather, while Archie was on home leave.  Marriage Register. Parish of Emmanuel, Clifton, 1914, No. 305, p. 153. Rising through the ranks, he was eventually stationed back to Britain in September 1918 as a colonel in the ": null
    },
    {
        "Air Ministry": "Air Ministry"
    },
    {
        ". Christie involved herself in the war effort as a member of the ": null
    },
    {
        "Voluntary Aid Detachment": "Voluntary Aid Detachment"
    },
    {
        ". From October 1914 to May 1915, then from June 1916 to September 1918, she worked a total of 3400 hours in the Town Hall Red Cross Hospital, Torquay, first as a nurse then as a dispenser after qualifying as an apothecaries assistant.   Her war service ended when Archie was reassigned to London, and they rented a flat in ": null
    },
    {
        "St. Johns Wood": "St. Johns Wood"
    },
    {
        ".        Christie had long been a fan of detective novels, having enjoyed ": null
    },
    {
        "Wilkie Collinss": "Wilkie Collins"
    },
    {
        "  The Woman in White  and  The Moonstone , as well as ": null
    },
    {
        "Sir Arthur Conan Doyles": "Sir Arthur Conan Doyle"
    },
    {
        "early ": null
    },
    {
        "Sherlock Holmes": "Sherlock Holmes"
    },
    {
        " stories. She wrote her own detective novel,  The Mysterious Affair at Styles , featuring ": null
    },
    {
        "Hercule Poirot": "Hercule Poirot"
    },
    {
        ", a former ": null
    },
    {
        "Belgian": "Belgians"
    },
    {
        " police officer noted for his twirly large magnificent moustaches and egg-shaped head. Poirot had taken refuge in Britain after ": null
    },
    {
        "Germany": "Germany"
    },
    {
        " invaded ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        ". Christies inspiration for the character stemmed from real Belgian refugees who were living in Torquay and the Belgian soldiers whom she helped to treat as a volunteer nurse in Torquay during the First World War.  She began working on The Mysterious Affair at Styles in 1916, writing much of it on ": null
    },
    {
        "Dartmoor": "Dartmoor"
    },
    {
        ". Her original manuscript was rejected by such publishing companies as ": null
    },
    {
        "Hodder and Stoughton": "Hodder And Stoughton"
    },
    {
        " and ": null
    },
    {
        "Methuen": "Methuen Publishing"
    },
    {
        ". After keeping the submission for several months, ": null
    },
    {
        "John Lane": "John Lane"
    },
    {
        " at ": null
    },
    {
        "The Bodley Head": "The Bodley Head"
    },
    {
        " offered to accept it, provided that Christie change the ending. She did so, and signed a contract which she later felt was exploitative.  It was finally published in 1920.     Christie, meanwhile, settled into married life, giving birth to her only child, Rosalind Margaret Clarissa, in August 1919 at ": null
    },
    {
        "Ashfield": "Ashfield, Torquay"
    },
    {
        ".   ": null
    },
    {
        "Archie": "Archie Christie"
    },
    {
        " left the Air Force at the end of the war and started working in ": null
    },
    {
        "the City": "The City Of London"
    },
    {
        " financial sector at a relatively low salary, though they still employed a maid.  Her second novel,  The Secret Adversary  , featured a new detective couple ": null
    },
    {
        "Tommy and Tuppence": "Tommy And Tuppence"
    },
    {
        ", again published by The Bodley Head. It earned her £50. A third novel again featured Poirot,  Murder on the Links  , as did short stories commissioned by Bruce Ingram, editor of  The Sketch  magazine.      In 1922, the Christies joined an around-the-world promotional tour for the ": null
    },
    {
        "British Empire Exhibition": "British Empire Exhibition"
    },
    {
        ", led by Major ": null
    },
    {
        "Ernest Belcher": "Ernest Belcher"
    },
    {
        ". Leaving their daughter with Agathas mother and sister, in ten months they travelled to ": null
    },
    {
        "South Africa": "South Africa"
    },
    {
        ", ": null
    },
    {
        "Australia": "Australia"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "New Zealand"
    },
    {
        ", ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        ", and ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ".   They learned to surf prone in South Africa; then, in ": null
    },
    {
        "Waikiki": "Waikiki"
    },
    {
        ", they were among the first Britons to ": null
    },
    {
        "surf": "Surfing"
    },
    {
        " standing up.       Following their return to England, Archie resumed work in ": null
    },
    {
        "the City": "City Of London"
    },
    {
        ", while Christie continued to work hard at her writing. After a series of apartments in London, they moved to the country, eventually purchasing a house in ": null
    },
    {
        "Sunningdale": "Sunningdale"
    },
    {
        ", ": null
    },
    {
        "Berkshire": "Berkshire"
    },
    {
        ", which they renamed Styles after the mansion in Christies first detective novel.       Christies mother died in April 1926. They had been exceptionally close, and the loss sent Christie into a deep depression.           In August 1926, Archie asked Christie for a divorce. He had fallen in love with Nancy Neele, who had been a friend of Major Belcher. On 3 December 1926, the pair quarrelled after Archie announced his plan to spend the weekend with friends, unaccompanied by his wife. Late that evening, Christie disappeared from her home. Her car, a ": null
    },
    {
        "Morris Cowley": "Morris Cowley"
    },
    {
        ", was found at ": null
    },
    {
        "Newlands Corner": "Newlands Corner"
    },
    {
        ", perched above a chalk quarry, with an expired driving licence and clothes.        The disappearance caused a public outcry. The home secretary, ": null
    },
    {
        "William Joynson-Hicks": "William Joynson-Hicks"
    },
    {
        ", pressured police, and a newspaper offered a £100 reward. Over a thousand police officers, 15,000 volunteers, and several aeroplanes scoured the rural landscape. ": null
    },
    {
        "Sir Arthur Conan Doyle": "Sir Arthur Conan Doyle"
    },
    {
        " gave a ": null
    },
    {
        "spirit medium": "Mediumship"
    },
    {
        " one of Christies gloves to find her. Christies disappearance was featured on the front page of  The New York Times . Despite the extensive manhunt, she was not found for 10 days.    On 14 December 1926, she was found at the ": null
    },
    {
        "Swan Hydropathic Hotel": "Old Swan Hotel"
    },
    {
        "  in ": null
    },
    {
        "Harrogate": "Harrogate"
    },
    {
        ", Yorkshire, registered as Mrs Tressa Neele from Capetown S.A. . The next day, Christie left for her sisters residence, ": null
    },
    {
        "Abney Hall": "Abney Hall"
    },
    {
        ", Cheadle, where she was sequestered in guarded hall, gates locked, telephone cut off, and callers turned away.           Christies autobiography makes no reference to the disappearance. Two doctors diagnosed her as suffering from an unquestionable genuine loss of memory ,    yet opinion remains divided over the reason for her disappearance. Some, including authorised biographer Janet Morgan, believe that she disappeared during a ": null
    },
    {
        "fugue state": "Fugue State"
    },
    {
        ".   In contrast, Jared Cades research led him to conclude that Christie deliberately planned the event to embarrass her husband, but did not anticipate the public melodrama that resulted.   Laura Thompson provides the alternative view that Christie disappeared during a nervous breakdown, conscious of her actions but not in emotional control of herself.  Public reaction at the time was largely negative, supposing a publicity stunt or an attempt to frame her husband for murder.            In January 1927, Christie, looking very pale , sailed with her daughter and secretary to ": null
    },
    {
        "Las Palmas": "Las Palmas"
    },
    {
        ", ": null
    },
    {
        "Canary Islands": "Canary Islands"
    },
    {
        ", to complete her convalescence ,  returning three months later. . The National Archives, Kew. Board of Trade: Commercial and Statistical Department and successors, BT26/837/112.  Christie petitioned for divorce and was granted a ": null
    },
    {
        "decree nisi": "Decree Nisi"
    },
    {
        " against her husband in April 1928 which was made ": null
    },
    {
        "absolute": "Decree Nisi"
    },
    {
        " in October 1928. Archie married Nancy Neele a week later.  Christie retained custody of their daughter Rosalind and the Christie surname for her writing. During their marriage, she published six novels, a collection of short stories, and a number of short stories in magazines.      Some years later, reflecting on the whole period, Christie said, So, after illness, came sorrow, despair and heartbreak. There is no need to dwell on it.      In autumn 1928, Christie left England and took the ": null
    },
    {
        " Orient Express": "Orient Express"
    },
    {
        " to ": null
    },
    {
        "Istanbul": "Istanbul"
    },
    {
        "; she subsequently went on to ": null
    },
    {
        "Baghdad": "Baghdad"
    },
    {
        ". In ": null
    },
    {
        "Iraq": "Iraq"
    },
    {
        ", she became friends with archaeologist ": null
    },
    {
        "Leonard Wooley": "Leonard Woolley"
    },
    {
        " and his wife, who invited her to return to their dig in February 1930. On that second trip, she met a young archaeologist 13 years her junior,  ": null
    },
    {
        "Max Edgar Lucien Mallowan": "Max Mallowan"
    },
    {
        ". In a 1977 interview, Mallowan recounted his first meeting with Christie, when he took her and a group of tourists on a tour of his expedition site in Iraq.  Christie and Mallowan married in September 1930. Marriage Certificate. Scotland - Statutory Register of Marriages, 685/04 0938, 11 September 1930, District of St Giles, Edinburgh.   Their marriage was happy and lasted until Christies death in 1976.       Christie frequently used settings that were familiar to her for her stories. She often accompanied Mallowan on his archaeological expeditions, and her travels with him contributed background to several of her novels set in the Middle East. Other novels  were set in and around Torquay, where she was raised. Christies 1934 novel  Murder on the Orient Express  was written in the ": null
    },
    {
        "Pera Palace Hotel": "Pera Palace Hotel"
    },
    {
        " in Istanbul, Turkey, the southern terminus of the railway. The hotel maintains Christies room as a memorial to the author.      The ": null
    },
    {
        "Greenway Estate": "Greenway Estate"
    },
    {
        " in Devon, acquired by the couple as a summer residence in 1938, is now in the care of the ": null
    },
    {
        "National Trust": "National Trust For Places Of Historic Interest Or Natural Beauty"
    },
    {
        ". Christie often stayed at Abney Hall, Cheshire, owned by her brother-in-law, James Watts, basing at least two stories there: a short story ": null
    },
    {
        "The Adventure of the Christmas Pudding": "The Adventure Of The Christmas Pudding"
    },
    {
        " in the story collection of the same name, and the novel  After the Funeral . Abney became Agathas greatest inspiration for country-house life, with all its servants and grandeur being woven into her plots. The descriptions of the fictional Chimneys, Stoneygates, and other houses in her stories are mostly Abney Hall in various forms.  During the ": null
    },
    {
        "Second World War": "World War Ii"
    },
    {
        ", Christie worked in the pharmacy at ": null
    },
    {
        "University College Hospital": "University College Hospital"
    },
    {
        ", London, where she acquired a knowledge of poisons that she put to good use in her post-war crime novels. For example, the use of ": null
    },
    {
        "thallium": "Thallium"
    },
    {
        " as a poison was suggested to her by UCH Chief Pharmacist Harold Davis , and in  The Pale Horse , published in 1961, she employed it to dispatch a series of victims, the first clue to the murder method coming from the victims loss of hair. So accurate was her description of thallium poisoning that on at least one occasion it helped solve a case that was baffling doctors.  John Emsley, , The Independent, 20 July 1992.   Christie lived in ": null
    },
    {
        "Chelsea": "Chelsea, London"
    },
    {
        ", first in Cresswell Place and later in Sheffield Terrace. Both properties are now marked by ": null
    },
    {
        "blue plaque": "Blue Plaque"
    },
    {
        "s. In 1934, she and Max Mallowan purchased Winterbrook House in ": null
    },
    {
        "Winterbrook": "Winterbrook"
    },
    {
        ", a hamlet adjoining the small market town of ": null
    },
    {
        "Wallingford": "Wallingford, Oxfordshire"
    },
    {
        ", then within the bounds of ": null
    },
    {
        "Cholsey": "Cholsey"
    },
    {
        " and in ": null
    },
    {
        "Berkshire": "Berkshire"
    },
    {
        ". , oxfordshireblueplaques.org.uk; accessed 21 September 2015. This was their main residence for the rest of their lives and the place where Christie did much of her writing.  This house, too, bears a blue plaque. Christie led a quiet life despite being known in the town of Wallingford,  where she was for many years President of the local ": null
    },
    {
        "amateur dramatic society": "Amateur Dramatic Society"
    },
    {
        ".       Around 1941–42, the British intelligence agency ": null
    },
    {
        "MI5": "Mi5"
    },
    {
        " investigated Christie after a character called Major Bletchley appeared in her 1941 thriller  N or M? , which was about a hunt for a pair of deadly ": null
    },
    {
        "fifth column": "Fifth Column"
    },
    {
        "ists in wartime England.  ": null
    },
    {
        "MI5": "Mi5"
    },
    {
        " was afraid that Christie had a spy in Britains top-secret codebreaking centre, ": null
    },
    {
        "Bletchley Park": "Bletchley Park"
    },
    {
        ". The agencys fears were allayed when Christie told her friend, the codebreaker ": null
    },
    {
        "Dilly Knox": "Dilly Knox"
    },
    {
        ", I was stuck there on my way by train from Oxford to London and took revenge by giving the name to one of my least lovable characters. In honour of her many literary works, she was appointed ": null
    },
    {
        "Commander of the Order of the British Empire": "Commander Of The Order Of The British Empire"
    },
    {
        " in the ": null
    },
    {
        "1956 New Year Honours": "1956 New Year Honours"
    },
    {
        ".  The next year, she became the President of the ": null
    },
    {
        "Detection Club": "Detection Club"
    },
    {
        ".  In the ": null
    },
    {
        "1971 New Year Honours": "1971 New Year Honours"
    },
    {
        ", she was promoted to ": null
    },
    {
        "Dame Commander of the Order of the British Empire": "Dame Commander Of The Order Of The British Empire"
    },
    {
        " ,  three years after her husband had been ": null
    },
    {
        "knighted": "Knight Bachelor"
    },
    {
        " for his archaeological work in 1968.  They were one of the few married couples where both partners were honoured in their own right. From 1968, owing to her husbands knighthood, Christie could also be ": null
    },
    {
        "styled": "Style"
    },
    {
        " Lady Mallowan.     From 1971 to 1974, Christies health began to fail, although she continued to write. Recently, using experimental tools of textual analysis, Canadian researchers have suggested that Christie may have begun to suffer from Alzheimers disease or other dementia.           In 1946, Christie said of herself: My chief dislikes are crowds, loud noises, gramophones and cinemas. I dislike the taste of alcohol and do not like smoking. I DO like sun, sea, flowers, travelling, strange foods, sports, concerts, theatres, pianos, and doing embroidery.      The Agatha Christie Trust For Children commenced in 1969  and shortly after Christies death a charitable memorial fund was set up to help two causes that she favoured: old people and young children.      Christies obituary in  The Times  notes that she never cared much for the cinema, or for wireless and television . Further, Dame Agathas private pleasures were gardening – she won local prizes for horticulture – and buying furniture for her various houses. She was a shy person: she disliked public appearances: but she was friendly and sharp-witted to meet. By inclination as well as breeding she belonged to the English upper middle-class. She wrote about, and for, people like herself. That was an essential part of her charm.                 Christie died peacefully on 12 January 1976 at age 85 from natural causes at her home Winterbrook House which was located in ": null
    },
    {
        "Winterbrook": "Winterbrook"
    },
    {
        ", ": null
    },
    {
        "Wallingford": "Wallingford, Oxfordshire"
    },
    {
        ", ": null
    },
    {
        "Oxfordshire": "Oxfordshire"
    },
    {
        ".  At the time of her death Winterbrook was still a part of the parish of ": null
    },
    {
        "Cholsey": "Cholsey"
    },
    {
        ". She is buried in the nearby churchyard of St Marys, Cholsey, having chosen the plot for their final resting place with her husband Sir Max some ten years before she died. The simple funeral service was attended by about 20 newspaper and TV reporters, some having travelled from as far away as South America. Thirty wreaths adorned Christies grave, including one from the cast of her long-running play The Mousetrap and one sent on behalf of the multitude of grateful readers by the Ulverscroft Large Print Book Publishers. Marilyn Yurdan  – Oxfordshire Graves and Gravestones. The History Press 2010     She was survived by her second husband, Sir Max Mallowan; by her only child, Rosalind Hicks ;  and by her only grandchild, Mathew T. Prichard. Mallowan, who remarried in 1977, died in 1978 at age 74. He was interred next to Christie.       Christies estate and subsequent ownership of works to avoid future adverse tax implications she set up a ": null
    },
    {
        "private company": "Private Limited Company"
    },
    {
        ", Agatha Christie Limited, in 1955 to hold the rights to her works, and in about 1959 transferred her 278-acre home, ": null
    },
    {
        "Greenway Estate": "Greenway Estate"
    },
    {
        ", to her daughter Rosalind. , telegraph.co.uk, 13 November 2004; accessed 25 January 2015.  In 1968, when Christie was almost 80 years old, she sold a 51% stake in Agatha Christie Limited to Booker Books , a subsidiary of the ": null
    },
    {
        "British": ":Category:Companies Of The United Kingdom"
    },
    {
        " food and transport ": null
    },
    {
        "conglomerate": "Conglomerate"
    },
    {
        " Booker-McConnell , the founder of the ": null
    },
    {
        "Booker Prize": "Man Booker Prize"
    },
    {
        " for literature, which by 1977 had increased its stake to 64%.   Agatha Christie Limited remains the owner of the worldwide rights for over 80 of Christies novels and short stories, 19 plays, and nearly 40 TV films.     In the late 1950s, Christie had reputedly been earning around ₤100,000 per year but, as a result of her tax planning, her will left only ₤106,683 net which went mostly to her husband and daughter along with some smaller bequests.  Her remaining 36% share of Agatha Christie Limited was inherited by her daughter, Rosalind Hicks, who passionately preserved her mothers works, image, and legacy until her own death 28 years later. The familys share of the company allowed them to appoint 50% of the board and the ": null
    },
    {
        "chairman": "Chairman"
    },
    {
        ", and thereby to retain a ": null
    },
    {
        "veto": "Veto"
    },
    {
        " over new treatments, updated versions, and republications of her works. , TheFreeLibrary.com, 4 June 1998.     In 1993, Hicks founded the Agatha Christie Society and became its first president. In 2004 her ": null
    },
    {
        "obituary": "Obituary"
    },
    {
        " in  The Telegraph  commented that Hicks had been determined to remain true to her mothers vision and to protect the integrity of her creations and disapproved of ": null
    },
    {
        "merchandising": "Merchandising"
    },
    {
        " activities. Upon Hickss death on 28 October 2004, both the Society and the Greenway Estate passed to Christies grandson, Mathew Prichard. After his parents deaths, Prichard donated Greenway and its contents to the ": null
    },
    {
        "National Trust": "National Trust"
    },
    {
        ".  The Society is now chaired and managed by Christies great-grandson James Prichard. The Agatha Christie Society. Online. Access 2017-10-22. .     Christies family and ": null
    },
    {
        "family trusts": "Trust"
    },
    {
        ", including James Prichard, continue to own the remaining 36% stake in Agatha Christie Limited, , The Guardian, 29 December 2012. and remain associated with the company. James Prichard became the companys ": null
    },
    {
        "chairman": "Chairman"
    },
    {
        " in October 2015. James Prichard, LinkedIn   The development of Christies work continues apace.  Mathew Prichard in his own right holds the copyright to some of his grandmothers later literary works .      In 1998, Booker sold a number of its non-food assets to focus on its core business. As part of that, its shares in Agatha Christie Limited were sold for £10m to ": null
    },
    {
        "Chorion": "Chorion"
    },
    {
        ", a major international media company whose portfolio of well-known authors works also included the literary estates of ": null
    },
    {
        "Enid Blyton": "Enid Blyton"
    },
    {
        " and ": null
    },
    {
        "Dennis Wheatley": "Dennis Wheatley"
    },
    {
        ". In February 2012, some years after a ": null
    },
    {
        "management buyout": "Management Buyout"
    },
    {
        ", Chorion found itself in financial difficulties, and began to sell off its literary assets on the market. The process included the sale of Chorions 64% stake in Agatha Christie Limited to Acorn Media U.K.  In 2014, ": null
    },
    {
        "RLJ Entertainment Inc.": "Rlj Companies"
    },
    {
        " acquired Acorn Media U.K., renamed it ": null
    },
    {
        "Acorn Media Enterprises": "Acorn Dvd"
    },
    {
        ", and incorporated it as the RLJE UK development arm. RLJ Entertainment Inc. web site  RLJ Entertainment Inc. was founded by American entrepreneur ": null
    },
    {
        "Robert L. Johnson": "Robert L. Johnson"
    },
    {
        ".     In late February 2014, media reports stated that the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " had acquired exclusive TV rights to Christies works in the UK  and made plans with Acorns co-operation to air new productions for the 125th anniversary of Christies birth in 2015. , radiotimes.com, 28 February 2014; accessed 25 January 2015. As part of that deal, the BBC broadcast  Partners In Crime   and  And Then There Were None ,  both in 2015. Subsequent productions have included  The Witness for the Prosecution   but plans to televise  Ordeal by Innocence  at Christmas 2017 were delayed due to controversy surrounding one of the cast members.  The three-part adaptation aired in April 2018.  A three-part adaptation of  The A.B.C. Murders  starring ": null
    },
    {
        "John Malkovich": "John Malkovich"
    },
    {
        " and ": null
    },
    {
        "Rupert Grint": "Rupert Grint"
    },
    {
        " began filming in June 2018 for later broadcast.                    Christies first book,  The Mysterious Affair at Styles , was published in 1920 and introduced the detective ": null
    },
    {
        "Hercule Poirot": "Hercule Poirot"
    },
    {
        ", who became a long-running character in Christies works, appearing in 33 novels and 54 short stories.      ": null
    },
    {
        "Miss Jane Marple": "Miss Marple"
    },
    {
        " was introduced in the short-story collection  The Thirteen Problems  in 1927. Although Christie states that, Miss Marple was not in any way a picture of my grandmother; she was far more fussy and spinsterish than my grandmother ever was , her autobiography does establish a firm connection between the fictional character and Christies maternal great-aunt Margaret Miller  and her Ealing cronies .   Both Marple and Miller always expected the worst of everyone and everything, and were, with almost frightening accuracy, usually proved right.  Marple appeared in 12 novels and 20 stories.     During the Second World War, Christie wrote two novels,  Curtain  and  Sleeping Murder , intended as the last cases of these two great detectives, Hercule Poirot and Miss Marple. Both books were sealed in a ": null
    },
    {
        "bank vault": "Bank Vault"
    },
    {
        " for over thirty years and were released for publication by Christie only at the end of her life, when she realised that she could not write any more novels. These publications came on the heels of the success of the ": null
    },
    {
        "film version": "Murder On The Orient Express"
    },
    {
        " of Murder on the Orient Express in 1974.       Christie became increasingly tired of Poirot, much as Sir ": null
    },
    {
        "Arthur Conan Doyle": "Arthur Conan Doyle"
    },
    {
        " had grown weary of his character ": null
    },
    {
        "Sherlock Holmes": "Sherlock Holmes"
    },
    {
        ". By the end of the 1930s, Christie wrote in her diary that she was finding Poirot insufferable , and by the 1960s she felt that he was an egocentric creep .      However, unlike Conan Doyle, Christie resisted the temptation to kill her detective off while he was still popular. She saw herself as an entertainer whose job was to produce what the public liked, and the public liked Poirot.  She did marry off Poirots companion ": null
    },
    {
        "Captain Hastings": "Arthur Hastings"
    },
    {
        " in an attempt to trim her cast commitments.      In contrast, Christie was fond of Miss Marple. However, the Belgian detectives titles outnumber the Marple titles more than two to one. This is largely because Christie wrote numerous Poirot novels early in her career, while  The Murder at the Vicarage  remained the sole Marple novel until the 1940s. Christie never wrote a novel or short story featuring both Poirot and Miss Marple. In a recording discovered and released in 2008, Christie revealed the reason for this: Hercule Poirot, a complete egoist, would not like being taught his business or having suggestions made to him by an elderly spinster lady. Hercule Poirot – a professional sleuth – would not be at home at all in Miss Marples world. . However,  Three Act Tragedy  does feature both Hercule Poirot and the elderly bachelor Mr. Satterthwaite .      Poirot is the only fictional character to date to be given an obituary in The New York Times, following the publication of Curtain. It appeared on the front page of the paper on 6 August 1975.      Following the great success of Curtain, Christie gave permission for the release of Sleeping Murder sometime in 1976 but died in January 1976 before the book could be released. This may explain some of the inconsistencies compared to the rest of the Marple series—for example, Colonel Arthur Bantry, husband of Miss Marples friend Dolly, is still alive and well in Sleeping Murder although he is noted as having died in books published earlier. It may be that Christie simply did not have time to revise the manuscript before she died.      In 2013, the Christie family gave their full backing to the release of a new Poirot story,  The Monogram Murders , which was written by British author ": null
    },
    {
        "Sophie Hannah": "Sophie Hannah"
    },
    {
        ".  Hannah later released a second Poirot mystery,  Closed Casket , in 2016  and ": null
    },
    {
        "The Mystery of the Three Quarters": "Agatha Christiewritings"
    },
    {
        " in 2018.          Christies reputation as The Queen of Crime was built upon the large number of classic ": null
    },
    {
        "motifs": "Motif"
    },
    {
        " that she introduced, or for which she provided the most famous example. Christie built these tropes into what is now considered classic mystery structure: a murder is committed, there are multiple suspects who are all concealing secrets, and the detective gradually uncovers these secrets over the course of the story, discovering the most shocking twists towards the end. Culprits in Christies mysteries have included children, policemen, narrators, already deceased individuals, and sometimes comprise no known suspects  or all of the suspects .     At the end, in a Christie hallmark, the detective usually gathers the surviving suspects into one room, explains the course of their deductive reasoning, and reveals the guilty party, although there are exceptions in which it is left to the guilty party to explain all . Mezei, Kathy. , The Journal of Modern Literature 30.2 : 103–120 Beehler, Sharon A. , The English Journal 77.6 : 39–43     Christie allows some culprits to escape earthly justice for a variety of reasons, such as the passage of time , in which the most important characters have already died, or by active prescription. Such cases include  The Witness for the Prosecution ,  Murder on the Orient Express ,  The Man in the Brown Suit ,  Elephants Can Remember , and  The Unexpected Guest . There are instances in which a killer is not brought to justice in the legal sense but does die as a direct result of their plot, sometimes by their own hand at the direction or with the collusion of the detective . This occurs in  The Murder of Roger Ackroyd ,  Death on the Nile ,  Dumb Witness ,  Crooked House ,  The Hollow ,  The Mirror Crackd from Side to Side ,  Cat Among the Pigeons ,  Peril at End House ,  Nemesis ,  Appointment with Death ,  The Secret Adversary , and  Curtain . In the last of these , no fewer than three culprits die during the course of the story.     In  The A.B.C. Murders , the murderer has killed four innocent people and attempted to frame an unstable man for the crimes. Hercule Poirot, however, prevents this easy way out, ensuring a trial and hanging. In  And Then There Were None , the killers own death is intrinsic to the plot; the ": null
    },
    {
        "red herring": "Red Herring"
    },
    {
        " is when and how the killer actually died. However, stage, film, and television productions of some of these mysteries were traditionally sanitized with the culprits not evading some form of justice, for a variety of reasons  – e.g., censors, plot clarity, and Christies own changing tastes.  In  Death Comes as the End , set in ancient ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", the culprit is killed by one of the few surviving characters before he can claim another victim.     In some stories, the question remains unresolved of whether formal justice will ever be delivered, such as  Five Little Pigs  and  Endless Night . According to ": null
    },
    {
        "P. D. James": "P. D. James"
    },
    {
        ", Christie often, but not always, made the unlikeliest character the guilty party. Savvy readers could sometimes identify the culprit by simply identifying the least likely suspect.      On an edition of  Desert Island Discs  in 2007, ": null
    },
    {
        "Brian Aldiss": "Brian Aldiss"
    },
    {
        " claimed that Christie had told him that she wrote her books up to the last chapter, then decided who the most unlikely suspect was, after which she would go back and make the necessary changes to frame that person.  However, John Curran describes different working methods for every book in Christies bibliography, contradicting the claim by Aldiss.        Christies mature novels, from 1940 onwards, often have titles drawn from literature.     Four are from ": null
    },
    {
        "Shakespeare": "Shakespeare"
    },
    {
        " Sad Cypress  from a song in  Twelfth Night  By the Pricking of My Thumbs  from Act 4, Scene 1 of  Macbeth  : By the pricking of my thumbs / Something wicked this way comes .    There is a Tide...   from Brutus speech in  Julius Caesar  Absent in the Spring  from Sonnet 98: From you have I been absent in the spring  ...     Three are from the Bible:    Evil Under the Sun  from ": null
    },
    {
        "Ecclesiastes": "Ecclesiastes"
    },
    {
        " 5:13 : There is a sore evil which I have seen under the sun, namely, riches kept for the owners thereof to their hurt .    The Burden  from ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        " words: Take my yoke upon you, and learn of me  ... For my yoke is easy, and my burden is light. .    The Pale Horse  from the ": null
    },
    {
        "Revelation of St John": "Book Of Revelation"
    },
    {
        " : I looked, and there before me was a pale horse! Its rider was named Death  ... .     Another six are from other works of literature:    The Mirror Crackd from Side to Side  from ": null
    },
    {
        "Tennysons": "Tennyson"
    },
    {
        " The Lady of Shalott": "The Lady Of Shalott"
    },
    {
        " : Out flew the web, and floated wide/The mirror cracked from side to side/The curse is come upon me, cried/The Lady of Shalott    The Moving Finger  from verse 51 of ": null
    },
    {
        "Edward FitzGeralds": "Edward Fitzgerald"
    },
    {
        "translation of the  Rubáiyát of Omar Khayyám  The Rose and the Yew Tree  from Section V of ": null
    },
    {
        "Little Gidding": "Little Gidding"
    },
    {
        " from ": null
    },
    {
        "T. S. Eliots": "T. S. Eliot"
    },
    {
        "  Four Quartets  Postern of Fate  from the poem Gates of Damascus by ": null
    },
    {
        "James Elroy Flecker": "James Elroy Flecker"
    },
    {
        " Endless Night  from ": null
    },
    {
        "William Blakes": "William Blake"
    },
    {
        " Auguries of Innocence": "Auguries Of Innocence"
    },
    {
        " N or M?  from the ": null
    },
    {
        "Catechism": "Catechism"
    },
    {
        " in the ": null
    },
    {
        "Book of Common Prayer": "Book Of Common Prayer"
    },
    {
        " which asks, What is your Christian name? Answer N. or M.  The N. or M. stands for the Latin, nomen vel nomina , meaning name or names . It is an accident of typography that nomina came to be represented by m .     In such cases, the original context of the title is usually printed as an ": null
    },
    {
        "epigraph": "Epigraph"
    },
    {
        ". Hopkins, Lisa. 2016. Who Owns the Wood? Appropriating A Midsummer Nights Dream. In Shakespearean Allusion in Crime Fiction, ed. L. Hopkins, pp. 63–103. Cham, Switzerland: Springer.   Similarly, the title of Christies autobiographical travel book  Come, Tell Me How You Live  is a quote from verse three of the ": null
    },
    {
        "White Knights": "White Knight"
    },
    {
        "poem, ": null
    },
    {
        "Haddocks Eyes": "Haddocks Eyes"
    },
    {
        " from chapter eight of  Through the Looking-Glass  by ": null
    },
    {
        "Lewis Carroll": "Lewis Carroll"
    },
    {
        ",  and is a play on the word ": null
    },
    {
        "tell": "Tell"
    },
    {
        " , an archaeological mound.      The title of  The Mousetrap  is purportedly an allusion to ": null
    },
    {
        "Shakespeares": "Shakespeare"
    },
    {
        "play  Hamlet , in which The Mousetrap is Hamlets answer to Claudiuss inquiry about the name of the play whose prologue and first scene he and his court have just watched .      Seven stories are built around words from well known childrens ": null
    },
    {
        "nursery rhyme": "Nursery Rhyme"
    },
    {
        "s:  And Then There Were None  ,  One, Two, Buckle My Shoe  ,  Five Little Pigs  ,  Crooked House  ,  A Pocket Full of Rye  ,  Hickory Dickory Dock  , and  Three Blind Mice  . Similarly, the novel  Mrs McGintys Dead  is named after a childrens game that is explained in the course of the novel.       Christie occasionally inserted stereotyped descriptions of characters into her work, particularly before the end of the Second World War , and particularly in regard to Italians, Jews, non-Europeans, and sometimes Americans. For example, she described Hebraic men with hook-noses wearing rather flamboyant jewellery in the first editions of the collection  The Mysterious Mr Quin  , in the short story The Soul of the Croupier ; in later editions, the passage was edited to describe sallow men wearing same.     In  The Hollow , published as late as 1946, one of the more unsympathetic characters is a Whitechapel Jewess with dyed hair and a voice like a ": null
    },
    {
        "corncrake": "Corncrake"
    },
    {
        "  ... a small woman with a thick nose, henna red and a disagreeable voice . To contrast with the more stereotyped descriptions, Christie sometimes showed foreigners as victims or potential victims at the hands of English malefactors, such as, respectively, Olga Seminoff  and Katrina Reiger . Jewish characters are often seen as un-English , but they are rarely the culprits.      However, many American characters are positive characters living in the UK, and are frequently misunderstood by their British associates. The ": null
    },
    {
        "Fulbright scholar": "Fulbright Scholar"
    },
    {
        " Sally Finch  is intelligent, attractive and innocent, even though Mrs. Nicoletis automatically assumes she will object to sharing house with students of other races. Another student falsely labels Sally as being a fanatical anti-Communist simply because she is American .  Anthony Browne , whom the book depicts as probably American, is suspected of being a spy. However, he is actually in counter-intelligence, and deduces correctly who the murderer is.      In They Do it With Mirrors, Walter Hudd, though outwardly negative, appears so because he is unhappy with life on his in-laws’ estate and his wifes flirtations with other men. His wifes aunt, Mildred, assumes he committed the murder, with the phrase “He’s probably one of those dreadful American gangsters”.  She is probably judging him by what a British character would have read in newspapers about American crime. Christies father was American.      Often, she is affectionate or teasing with her prejudices. After four years of war-torn London, Christie hoped to return some day to Syria, which she described as gentle fertile country and its simple people, who know how to laugh and how to enjoy life; who are idle and gay, and who have dignity, good manners, and a great sense of humour, and to whom death is not terrible.       She had trouble with an incompetent Swiss French nursery helper for toddler Rosalind, and as a result she decided, Scottish preferred  ... good with the young. The French were hopeless disciplinarians  ... Germans good and methodical, but it was not German that I really wanted Rosalind to learn. The Irish were gay but made trouble in the house; the English were of all kinds.        Christie published relatively few non-fiction works:   Come, Tell Me How You Live, about working on an archaeological dig, drawn from her life with second husband Max Mallowan   The Grand Tour: Around the World with the Queen of Mystery, a collection of correspondence from her 1922 Grand Tour of the British empire, including South Africa, Australia, New Zealand, and Canada    Agatha Christie: An Autobiography , published posthumously in 1977       Often referred to as the Queen of Crime or Queen of Mystery , Christie is the worlds best-selling mystery writer and is considered a master of suspense, plotting, and characterisation.    Some critics, however, have regarded Christies plotting as superior to her skill with other literary elements. Novelist ": null
    },
    {
        "Raymond Chandler": "Raymond Chandler"
    },
    {
        " criticised her in his essay ": null
    },
    {
        "The Simple Art of Murder": "The Simple Art Of Murder"
    },
    {
        " , and American literary critic ": null
    },
    {
        "Edmund Wilson": "Edmund Wilson"
    },
    {
        " was dismissive of Christie and the detective fiction genre generally in his  New Yorker  essay, Who Cares Who Killed Roger Ackroyd?      In honour of the 125th anniversary of her birth, 25 contemporary mystery writers and one publisher revealed their views on Christies works. Many of the authors read Christies novels first, before other ": null
    },
    {
        "mystery writers": "Mystery Fiction"
    },
    {
        ", in English or in their native language, influencing their own writing, and nearly all still view her as the Queen of Crime , and creator of the ": null
    },
    {
        "plot twists": "Plot Twist"
    },
    {
        "used by mystery authors. Nearly all had one or more favourites among Christies mysteries, and find her books good to read now, nearly 100 years after her first novel was published. Several of the authors would be very pleased to have their own novels in print in 100 years. Just one of the 25 authors held with Edmund Wilsons views.  Harper Collins also published a souvenir magazine Shocking Real Murders: Behind Her Classic Mysteries.  by Agatha Christie, Harper Collins     The  Guinness Book of World Records  lists Christie as the best-selling novelist of all time. Her novels have sold roughly 2 ": null
    },
    {
        "billion": "1,000,000,000"
    },
    {
        " copies, and her ": null
    },
    {
        "estate": "Estate"
    },
    {
        " claims that her works come third in the rankings of the worlds most-widely published books,  behind only ": null
    },
    {
        "Shakespeares": "William Shakespeare"
    },
    {
        " works and the Bible. Half of the sales are of English language editions, and the other half in translation.  According to ": null
    },
    {
        "Index Translationum": "Index Translationum"
    },
    {
        ", she remains the most-translated individual author  – having been translated into at least 103 languages.   And Then There Were None  is Christies best-selling novel, with 100 million sales to date, making it the worlds best-selling mystery ever, and one of the ": null
    },
    {
        "best-selling books": "List Of Best-Selling Books"
    },
    {
        " of all time.      In 2012, Christie was among the ": null
    },
    {
        "British cultural icons": "Culture Of The United Kingdom"
    },
    {
        " selected by artist Sir ": null
    },
    {
        "Peter Blake": "Peter Blake"
    },
    {
        " to appear in a new version of his most famous artwork  – the Beatles  Sgt. Peppers Lonely Hearts Club Band  album cover  – to celebrate the British cultural figures of his life that he most admires.                  Christie had a lifelong interest in archaeology. She met her second husband, ": null
    },
    {
        "Sir Max Mallowan": "Max Mallowan"
    },
    {
        ", a distinguished archaeologist, on a trip to the excavation site at ": null
    },
    {
        "Ur": "Ur"
    },
    {
        " in 1930. But her fame as an author far surpassed his fame in archaeology. Prior to meeting Mallowan, Christie had not had any extensive brushes with archaeology, but once the two married, they made sure to only go to sites where they could work together. Christie accompanied Mallowan on countless archaeological trips, spending 3–4 months at a time in ": null
    },
    {
        "Syria": "Syria"
    },
    {
        " and ": null
    },
    {
        "Iraq": "Iraq"
    },
    {
        " at excavation sites at Ur, ": null
    },
    {
        "Nineveh": "Nineveh"
    },
    {
        ", ": null
    },
    {
        "Tell Arpachiyah": "Tell Arpachiyah"
    },
    {
        ", ": null
    },
    {
        "Chagar Bazar": "Chagar Bazar"
    },
    {
        ", ": null
    },
    {
        "Tell Brak": "Tell Brak"
    },
    {
        ", and ": null
    },
    {
        "Nimrud": "Nimrud"
    },
    {
        ". She wrote novels and short stories, but also contributed work to the archaeological sites, more specifically to the archaeological restoration and labelling of ancient exhibits, including tasks such as cleaning and conserving delicate ivory pieces, reconstructing pottery, developing photos from early excavations which later led to taking photographs of the site and its findings, and taking field notes.      Christie would always pay for her own board and lodging and her travel expenses so as to not influence the funding of the archaeological excavations, and she also supported excavations as an anonymous sponsor. During their time in the Middle East, there was also a large amount of time spent travelling to and from Mallowans sites. Their extensive travelling had a strong influence on her writing, as some type of transportation often plays a part in her murderers schemes. The large amount of travel was reused in novels such as  Murder on the Orient Express , as well as suggesting the idea of archaeology as an adventure itself.      After the Second World War, she chronicled her time in Syria with fondness in Come Tell Me How You Live. Anecdotes, memories, funny episodes are strung in a rough timeline, with more emphasis on eccentric characters and lovely scenery than on factual accuracy. From 8 November 2001 to 24 March 2002, ": null
    },
    {
        "The British Museum": "British Museum"
    },
    {
        " had an exhibit named Agatha Christie and Archaeology: Mystery in Mesopotamia, which presented the life of Christie and the influences of archaeology in her life and works.       Many of the settings for Christies books were directly inspired by the many archaeological field seasons spent in the Middle East on the sites managed by her husband Max. The extent of her time spent at the many locations featured in her books is apparent from the extreme detail in which she describes them. One such site featured in her work is the temple site of ": null
    },
    {
        "Abu Simbel": "Abu Simbel Temples"
    },
    {
        ", depicted in  Death on the Nile . Also there is the great detail in which she describes life at the dig site in  Murder in Mesopotamia . Among the characters in her books, Christie has often given prominence to the archaeologists and experts in Middle Eastern cultures and artefacts. Most notable are the characters of Dr. Eric Leidner in Murder in Mesopotamia and Signor Richetti in Death on the Nile, while many minor characters were archaeologists in They Came to Baghdad.     Some of Christies best known novels with heavy archaeological influences are:    Murder in Mesopotamia   – the most archaeologically influenced of all her novels, as it is set in the Middle East at an archaeological dig site and associated expedition house. The main characters include archaeologist Dr. Eric Leidner, his wife, many specialists and assistants, and the men working on the site. The novel is noted most for its careful description of the dig site and house, which showed that the author had spent much of her time in very similar situations. The characters in this book in particular are also based on archaeologists whom Christie knew from her personal experiences on excavation sites.    Death on the Nile   – takes place on a tour boat on the Nile. Many archaeological sites are visited along the way and one of the main characters, Signor Richetti, is an archaeologist.    Appointment with Death   – set in ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        " and its surrounding area. The death itself occurs at an old cave site in ": null
    },
    {
        "Petra": "Petra"
    },
    {
        " and offers some very descriptive details of sites which Christie herself could have visited in order to write the book.    They Came to Baghdad   – inspired by Christies own trips to ": null
    },
    {
        "Baghdad": "Baghdad"
    },
    {
        " with Mallowan, and involves an archaeologist as the heroines love interest.       Christie has been portrayed on a number of occasions in film and television. Several biographical programmes have been made, such as ": null
    },
    {
        "BBC televisions": "Bbc Television"
    },
    {
        "  Agatha Christie: A Life in Pictures  , and in Season 3, Episode 1 of  ITV Perspectives ": null
    },
    {
        "David Suchet": "David Suchet"
    },
    {
        ", who plays Hercule Poirot on television.      Christie has also been portrayed fictionally. Some of these portrayals have explored and offered accounts of Christies disappearance in 1926, including:     the film  Agatha  with ": null
    },
    {
        "Vanessa Redgrave": "Vanessa Redgrave"
    },
    {
        ", in which she sneaks away to plan revenge against her husband ;   the  Doctor Who  episode ": null
    },
    {
        "The Unicorn and the Wasp": "The Unicorn And The Wasp"
    },
    {
        " , with ": null
    },
    {
        "Fenella Woolgar": "Fenella Woolgar"
    },
    {
        ", in which her disappearance is the result of her suffering a temporary breakdown owing to a brief psychic link being formed between her and an alien wasp called the ": null
    },
    {
        "Vespiform": "Vespiform"
    },
    {
        "; and    Agatha and the Truth of Murder , in which she goes under cover to solve the murder of ": null
    },
    {
        "Florence Nightingales": "Florence Nightingale"
    },
    {
        " goddaughter": "Goddaughter"
    },
    {
        ", Florence Nightingale Shore.     A fictionalised account of Christies disappearance is also the central theme of a ": null
    },
    {
        "Korea": "Korea"
    },
    {
        "n musical, Agatha.      Other portrayals, such as Hungarian film, Kojak Budapesten create their own scenarios involving Christies criminal skill. In the TV play, Murder by the Book , Christie herself  murdered one of her fictional-turned-real characters, Poirot. The heroine of Liar-Softs ": null
    },
    {
        "visual novel": "Visual Novel"
    },
    {
        "  Shikkoku no Sharnoth: What a Beautiful Tomorrow  , Mary Clarissa Christie, is based on the real-life Christie. Christie features as a character in Gaylord Larsens Dorothy and Agatha and The London Blitz Murders by Max Allan Collins.   A young Agatha is depicted in the Spanish historical television series  Gran Hotel ": null
    }
]