[
    {
        "In the game of ": null
    },
    {
        "poker": "Poker"
    },
    {
        ", ": null
    },
    {
        "opens": "Betting Open"
    },
    {
        " and ": null
    },
    {
        "raises": "Betting Raise"
    },
    {
        " are considered aggressive plays, while ": null
    },
    {
        "calls": "Betting Call"
    },
    {
        " and ": null
    },
    {
        "checks": "Betting Check"
    },
    {
        " are considered passive . It is said that aggression has its own value , meaning that often aggressive plays can make money with weak hands because of ": null
    },
    {
        "bluff": "Bluff"
    },
    {
        " value. In general, opponents must respond to aggressive play by playing more loosely, which offers more opportunities to make mistakes.     While it is true that aggressive play is generally superior to passive play, using any play exclusively can lead to predictability. A player who is constantly aggressive and plays many inferior hands is called a maniac , and skilled players will take advantage of him by calling him more often, using ": null
    },
    {
        "isolation": "Isolation"
    },
    {
        " plays, and by other means.     If a player is not aggressive with his weaker hands, the opponents can safely fold whenever the player does bet or raise. The appropriate amount of aggression can be computed using ": null
    },
    {
        "game theory": "Game Theory"
    },
    {
        ", and depends on the game being played and the tendencies of the opponents.     Most theorists, like ": null
    },
    {
        "David Sklansky": "David Sklansky"
    },
    {
        " and ": null
    },
    {
        "Doyle Brunson": "Doyle Brunson"
    },
    {
        ", suggest aggression as an important tool. Aggressive play should not be confused with loose play. Loose players may play passively, resulting in a ": null
    },
    {
        "calling station": "Calling Station"
    },
    {
        ", while tight players may play aggressively, referred to as a ": null
    },
    {
        "TAG": "Glossary Of Poker Termst"
    }
]