[
    {
        "                        The American Revolution was a colonial revolt which occurred between 1765 and 1783. The American Patriots in the ": null
    },
    {
        "Thirteen Colonies": "Thirteen Colonies"
    },
    {
        " defeated the British in the ": null
    },
    {
        "American Revolutionary War": "American Revolutionary War"
    },
    {
        " with the assistance of France, winning independence from Great Britain and establishing the United States of America.     The ": null
    },
    {
        "American colonials": "Colonial History Of The United States"
    },
    {
        " proclaimed ": null
    },
    {
        "no taxation without representation": "No Taxation Without Representation"
    },
    {
        " starting with the ": null
    },
    {
        "Stamp Act Congress": "Stamp Act Congress"
    },
    {
        " in 1765. They rejected the authority of the British Parliament to tax them because they had no representatives in that governing body. Protests steadily escalated to the ": null
    },
    {
        "Boston Massacre": "Boston Massacre"
    },
    {
        " in 1770 and the ": null
    },
    {
        "burning of the Gaspee": "Gaspee Affair"
    },
    {
        " in ": null
    },
    {
        "Rhode Island": "Colony Of Rhode Island And Providence Plantations"
    },
    {
        " in 1772, followed by the ": null
    },
    {
        "Boston Tea Party": "Boston Tea Party"
    },
    {
        " in December 1773. The British responded by closing Boston Harbor and enacting a ": null
    },
    {
        "series of punitive laws": "Intolerable Acts"
    },
    {
        " which effectively rescinded ": null
    },
    {
        "Massachusetts Bay Colonys": "Massachusetts Bay Colony"
    },
    {
        "rights of self-government. The other colonies rallied behind Massachusetts, and a group of American Patriot leaders set up their own government in late 1774 at the ": null
    },
    {
        "Continental Congress": "First Continental Congress"
    },
    {
        " to coordinate their resistance of Britain; other colonists retained their allegiance to the Crown and were known as ": null
    },
    {
        "Loyalists": "Loyalist"
    },
    {
        " or Tories.     Tensions erupted into battle between Patriot militia and British regulars when ": null
    },
    {
        "King Georges": "George Iii Of The United Kingdom"
    },
    {
        "forces attempted to destroy Colonial military supplies at ": null
    },
    {
        "Lexington and Concord": "Battles Of Lexington And Concord"
    },
    {
        " on April 19, 1775. The conflict then developed into war, during which the Patriots fought the British and Loyalists in the Revolutionary War. Each of the thirteen colonies formed a ": null
    },
    {
        "Provincial Congress": "Provincial Congress"
    },
    {
        " which assumed power from the former colonial governments, suppressed Loyalism, and recruited a ": null
    },
    {
        "Continental Army": "Continental Army"
    },
    {
        " led by General ": null
    },
    {
        "George Washington": "George Washington"
    },
    {
        ". The Continental Congress declared King George a tyrant who trampled the colonists ": null
    },
    {
        "rights as Englishmen": "Rights Of Englishmen"
    },
    {
        ", and they declared the colonies ": null
    },
    {
        "free and independent states": "Lee Resolution"
    },
    {
        " on July 2, 1776. The Patriot leadership professed the political philosophies of ": null
    },
    {
        "liberalism": "Liberalism In The United States"
    },
    {
        " and ": null
    },
    {
        "republicanism": "Republicanism In The United States"
    },
    {
        " to reject monarchy and aristocracy, and they proclaimed that all men are created equal.     The Continental Army ": null
    },
    {
        "forced the British military out of Boston": "Siege Of Boston"
    },
    {
        " in March 1776, but that summer ": null
    },
    {
        "the British captured New York City": "New York And New Jersey Campaign"
    },
    {
        " and its strategic harbor, which they held for the duration of the war. The Royal Navy blockaded ports and captured other cities for brief periods, but they failed to destroy Washingtons forces. The Patriots ": null
    },
    {
        "attempted to invade Canada": "Invasion Of Quebec"
    },
    {
        " during the winter of 1775–76 without success, but they captured a British army at the ": null
    },
    {
        "Battle of Saratoga": "Battle Of Saratoga"
    },
    {
        " in October 1777. France then entered the war as an ally of the United States with a large army and navy. The war then moved to the Southern states, where ": null
    },
    {
        "Charles Cornwallis": "Charles Cornwallis, 1St Marquess Cornwallis"
    },
    {
        " captured an army at ": null
    },
    {
        "Charleston, South Carolina": "Charleston, South Carolina"
    },
    {
        " in early 1780, but he failed to enlist enough volunteers from Loyalist civilians to take effective control of the territory. Finally, a combined American and French force captured a second British army ": null
    },
    {
        "at Yorktown": "Siege Of Yorktown"
    },
    {
        " in the fall of 1781, effectively ending the war. The ": null
    },
    {
        "Treaty of Paris": "Treaty Of Paris"
    },
    {
        " was signed September 3, 1783, formally ending the conflict and confirming the new nations complete separation from the British Empire. The United States took possession of nearly all the territory east of the Mississippi River and south of the Great Lakes, with the British retaining control of Canada, and Spain taking Florida.     Among the significant results of the revolution was the creation of the ": null
    },
    {
        "United States Constitution": "United States Constitution"
    },
    {
        ", establishing a relatively strong federal national government which included an ": null
    },
    {
        "executive": "President Of The United States"
    },
    {
        ", a ": null
    },
    {
        "national judiciary": "United States Supreme Court"
    },
    {
        ", and a bicameral ": null
    },
    {
        "Congress": "Congress Of The United States"
    },
    {
        " representing states in the ": null
    },
    {
        "Senate": "United States Senate"
    },
    {
        " and the population in the ": null
    },
    {
        "House of Representatives": "United States House Of Representatives"
    },
    {
        ". Wood, The Radicalism of the American Revolution Greene and Pole chapter 70 The Revolution also resulted in the migration of around 60,000 Loyalists to other British territories, particularly to ": null
    },
    {
        "British North America": "British North America"
    },
    {
        " .                      As early as 1651, the English government had sought to regulate trade in the ": null
    },
    {
        "American colonies": "British America"
    },
    {
        ", and Parliament passed the ": null
    },
    {
        "Navigation Acts": "Navigation Actsnavigation Act 1651"
    },
    {
        " on October 9 to provide the plantation colonies of the south with a profitable export market. The Acts prohibited British producers from growing tobacco and also encouraged shipbuilding, particularly in the ": null
    },
    {
        "New England colonies": "New England Colonies"
    },
    {
        ". Some argue that the economic impact was minimal on the colonists,   but the political friction was more serious which the acts triggered, as the merchants most directly affected were most politically active.      ": null
    },
    {
        "King Philips War": "King Philips War"
    },
    {
        " ended in 1678 which the New England colonies fought without any military assistance from England, and this contributed to the development of a unique identity separate from that of the British people. Lepore , The Name of War pp. 5–7 But ": null
    },
    {
        "King Charles II": "Charles Ii Of England"
    },
    {
        " determined to bring the New England colonies under a more centralized administration in the 1680s in order to regulate trade more effectively. Curtis P. Nettels, The Roots of American Civilization: A History of American Colonial Life p. 297. The New England colonists fiercely opposed his efforts, so the Crown nullified their colonial charters. , pp. 148–56, 155–57, 169–70 Charles successor ": null
    },
    {
        "James II": "James Ii Of England"
    },
    {
        " finalized these efforts in 1686, establishing the ": null
    },
    {
        "Dominion of New England": "Dominion Of New England"
    },
    {
        ". Dominion rule triggered bitter resentment throughout New England; the enforcement of the unpopular Navigation Acts and the curtailing of local democracy angered the colonists. , pp. 169–70 New Englanders were encouraged, however, by a ": null
    },
    {
        "change of government in England": "Glorious Revolution"
    },
    {
        " which saw James II effectively abdicate, and a ": null
    },
    {
        "populist uprising": "1689 Boston Revolt"
    },
    {
        " overthrew Dominion rule on April 18, 1689. , pp. 190–91 , p. 201 Colonial governments reasserted their control in the wake of the revolt, and successive governments made no more attempts to restore the Dominion. , p. 596 , p. 430     Subsequent English governments continued in their efforts to tax certain goods, passing acts regulating the trade of ": null
    },
    {
        "wool": "Wool Act 1699"
    },
    {
        ",  ": null
    },
    {
        "hats": "Hat Act"
    },
    {
        ", Max Savelle, , p.93 and ": null
    },
    {
        "molasses": "Molasses Act"
    },
    {
        ". Draper pg. 100. The quote provided by Draper came from Leo Francis Stocks Proceedings and Debates of the British Parliaments respecting North America vol. 4. p. 182 The Molasses Act of 1733 was particularly egregious to the colonists, as a significant part of colonial trade relied on molasses. The taxes severely damaged the New England economy and resulted in a surge of smuggling, bribery, and intimidation of customs officials. , pp. 95–99 Colonial wars fought in America were also a source of considerable tension. The British captured the fortress of ": null
    },
    {
        "Louisbourg": "Louisbourg"
    },
    {
        " during ": null
    },
    {
        "King Georges War": "King Georges War"
    },
    {
        " but then ceded it back to France in 1748. New England colonists resented their losses of lives, as well as the effort and expenditure involved in subduing the fortress, only to have it returned to their erstwhile enemy. Guizot, M. A popular history of France, from the earliest times. Vol IV, University of Michigan, 2005, , p. 166.        Some writers begin their histories of the American Revolution with the British coalition victory in the ": null
    },
    {
        "Seven Years War": "Seven Years War"
    },
    {
        " in 1763, viewing the ": null
    },
    {
        "French and Indian War": "French And Indian War"
    },
    {
        " as though it were the American theater of the Seven Years War. ": null
    },
    {
        "Lawrence Henry Gipson": "Lawrence Henry Gipson"
    },
    {
        " writes:          The ": null
    },
    {
        "Royal Proclamation of 1763": "Royal Proclamation Of 1763"
    },
    {
        " redrew boundaries of the lands west of Quebec and west of a line running along the crest of the ": null
    },
    {
        "Allegheny Mountains": "Allegheny Mountains"
    },
    {
        ", making them Indian territory and barred to colonial settlement for two years. The colonists protested, and the boundary line was adjusted in a series of treaties with ": null
    },
    {
        "Indian tribes": "Native Americans In The United States"
    },
    {
        ". In 1768, the ": null
    },
    {
        "Iroquois": "Iroquois"
    },
    {
        " agreed to the ": null
    },
    {
        "Treaty of Fort Stanwix": "Treaty Of Fort Stanwix"
    },
    {
        ", and the ": null
    },
    {
        "Cherokee": "Cherokee"
    },
    {
        " agreed to the ": null
    },
    {
        "Treaty of Hard Labour": "Treaty Of Hard Labour"
    },
    {
        " followed in 1770 by the ": null
    },
    {
        "Treaty of Lochaber": "Treaty Of Lochaber"
    },
    {
        ". The treaties opened most of Kentucky and West Virginia to colonial settlement. The new map was drawn up at the Treaty of Fort Stanwix in 1768 which moved the line much farther to the west, from the green line to the red line on the map at right.                   Prime Minister ": null
    },
    {
        "George Grenville": "George Grenville"
    },
    {
        " asserted in 1762 that the whole revenue of the custom houses in America amounted to one or two thousand pounds a year, and that the English exchequer was paying between seven and eight thousand pounds a year to collect . Loyalists of Massachusetts, James F. Stark P.34 Adam Smith wrote in The Wealth of Nations that Parliament has never hitherto demanded of anything which even approached to a just proportion to what was paid by their fellow subjects at home.     As early as 1651, the English government had sought to regulate trade in the American colonies. On October 9, 1651, they passed the ": null
    },
    {
        "Navigation Acts": "Navigation Actsnavigation Act 1651"
    },
    {
        " to pursue a ": null
    },
    {
        "mercantilist": "Mercantilism"
    },
    {
        " policy intended to ensure that trade enriched Great Britain but prohibited trade with any other nations. Pestana, Carla Gardina . The English Atlantic in an Age of Revolution: 1640–1661. Cambridge, Massachusetts and London, England: Harvard University Press. p. 120.  Parliament also passed the ": null
    },
    {
        "Sugar Act": "Sugar Act"
    },
    {
        ", decreasing the existing customs duties on sugar and molasses but providing stricter measures of enforcement and collection. That same year, Grenville proposed direct taxes on the colonies to raise revenue, but he delayed action to see whether the colonies would propose some way to raise the revenue themselves.      Parliament finally passed the Stamp Act in March 1765 which imposed direct taxes on the colonies for the first time. All official documents, newspapers, almanacs, and pamphlets were required to have the stamps—even decks of playing cards. The colonists did not object that the taxes were high; they were actually low. Englishmen paid an average 25 shillings annually in taxes, whereas Americans paid only sixpence. Miller, Origins of the American Revolution p. 89 They objected to the fact that they had no representation in the Parliament, and thus no voice concerning legislation that affected them. ": null
    },
    {
        "Benjamin Franklin": "Benjamin Franklin"
    },
    {
        " testified in Parliament in 1766 that Americans already contributed heavily to the defense of the Empire. He said that local governments had raised, outfitted, and paid 25,000 soldiers to fight France—as many as Britain itself sent—and spent many millions from American treasuries doing so in the ": null
    },
    {
        "French and Indian War": "French And Indian War"
    },
    {
        " alone.   London had to deal with 1,500 politically well-connected British Army soldiers. The decision was to keep them on active duty with full pay, but they had to be stationed somewhere. Stationing a standing army in Great Britain during peacetime was politically unacceptable, so the decision was made to station them in America and have the Americans pay them. The soldiers had no military mission; they were not there to defend the colonies because there was no threat to the colonies. Shy, Toward Lexington pp. 73–78     The ": null
    },
    {
        "Sons of Liberty": "Sons Of Liberty"
    },
    {
        " formed that same year in 1765, and they used public demonstrations, boycott, and threats of violence to ensure that the British tax laws were unenforceable. In Boston, the Sons of Liberty burned the records of the vice admiralty court and looted the home of chief justice ": null
    },
    {
        "Thomas Hutchinson": "Thomas Hutchinson"
    },
    {
        ". Several legislatures called for united action, and nine colonies sent delegates to the ": null
    },
    {
        "Stamp Act Congress": "Stamp Act Congress"
    },
    {
        " in New York City in October. Moderates led by ": null
    },
    {
        "John Dickinson": "John Dickinson"
    },
    {
        " drew up a ": null
    },
    {
        "Declaration of Rights and Grievances": "Declaration Of Rights And Grievances"
    },
    {
        " stating that taxes passed without representation violated their ": null
    },
    {
        "rights as Englishmen": "Rights Of Englishmen"
    },
    {
        ", and colonists emphasized their determination by boycotting imports of British merchandise. T.H. Breen, American Insurgents, American Patriots: The Revolution of the People pp. 81–82     The Parliament at Westminster saw itself as the supreme lawmaking authority throughout all British possessions and thus entitled to levy any tax without colonial approval. Middlekauff p. 62 They argued that the colonies were legally British corporations that were completely subordinate to the British parliament, and they pointed to numerous instances where Parliament had made laws in the past that were binding on the colonies. Lecky, William Edward Hartpole,  pp. 297–98 Parliament insisted that the colonies effectively enjoyed a ": null
    },
    {
        "virtual representation": "Virtual Representation"
    },
    {
        " as most British people did, as only a small minority of the British population elected representatives to Parliament, Lecky, William Edward Hartpole,  p. 173 but Americans such as ": null
    },
    {
        "James Otis": "James Otis, Jr."
    },
    {
        " maintained that they were not in fact virtually represented at all.      The ": null
    },
    {
        "Rockingham": "Charles Watson-Wentworth, 2Nd Marquess Of Rockingham"
    },
    {
        " government came to power in July 1765, and Parliament debated whether to repeal the stamp tax or to send an army to enforce it. Benjamin Franklin made the case for repeal, explaining that the colonies had spent heavily in manpower, money, and blood in defense of the empire in a series of wars against the French and Indians, and that further taxes to pay for those wars were unjust and might bring about a rebellion. Parliament agreed and repealed the tax on February 21, 1766, but they insisted in the ": null
    },
    {
        "Declaratory Act": "Declaratory Act"
    },
    {
        " of March 1766 that they retained full power to make laws for the colonies in all cases whatsoever .    The repeal nonetheless caused widespread celebrations in the colonies.                  In 1767, the Parliament passed the ": null
    },
    {
        "Townshend Acts": "Townshend Acts"
    },
    {
        " which placed duties on a number of staple goods, including paper, glass, and tea, and established a Board of Customs in Boston to more rigorously execute trade regulations. The new taxes were enacted on the belief that Americans only objected to internal taxes and not to external taxes such as custom duties. The Americans, however, argued against the constitutionality of the act because its purpose was to raise revenue and not regulate trade. Melvin I. Urofsky and Paul Finkelman, A March of Liberty: A Constitutional History of the United States v. 1 p. 52. Colonists responded by organizing new boycotts of British goods. These boycotts were less effective, however, as the Townshend goods were widely used.     In February 1768, the Assembly of Massachusetts Bay ": null
    },
    {
        "issued a circular letter": "Massachusetts Circular Letter"
    },
    {
        " to the other colonies urging them to coordinate resistance. The governor dissolved the assembly when it refused to rescind the letter. Meanwhile, a riot broke out in Boston in June 1768 over the seizure of the sloop Liberty, owned by ": null
    },
    {
        "John Hancock": "John Hancock"
    },
    {
        ", for alleged smuggling. Customs officials were forced to flee, prompting the British to deploy troops to Boston. A Boston town meeting declared that no obedience was due to parliamentary laws and called for the convening of a convention. A convention assembled but only issued a mild protest before dissolving itself. In January 1769, Parliament responded to the unrest by reactivating the ": null
    },
    {
        "Treason Act 1543": "Treason Act 1543"
    },
    {
        " which called for subjects outside the realm to face trials for treason in England. The governor of Massachusetts was instructed to collect evidence of said treason, and the threat caused widespread outrage, though it was not carried out.     On March 5, 1770, a large crowd gathered around a group of British soldiers. The crowd grew threatening, throwing snowballs, rocks, and debris at them. One soldier was clubbed and fell. Hiller B. Zobel, The Boston Massacre There was no order to fire, but the soldiers fired into the crowd anyway. They hit 11 people; three civilians died at the scene of the shooting, and two died after the incident. The event quickly came to be called the ": null
    },
    {
        "Boston Massacre": "Boston Massacre"
    },
    {
        ". The soldiers were tried and acquitted , but the widespread descriptions soon began to turn colonial sentiment against the British. This, in turn, began a downward spiral in the relationship between Britain and the Province of Massachusetts.     A new ministry under ": null
    },
    {
        "Lord North": "Lord North"
    },
    {
        " came to power in 1770, and Parliament withdrew all taxes except the tax on tea, giving up its efforts to raise revenue while maintaining the right to tax. This temporarily resolved the crisis, and the boycott of British goods largely ceased, with only the more radical patriots such as ": null
    },
    {
        "Samuel Adams": "Samuel Adams"
    },
    {
        " continuing to agitate.          In June 1772, American ": null
    },
    {
        "patriots": "Patriot"
    },
    {
        ", including ": null
    },
    {
        "John Brown": "John Brown"
    },
    {
        ", burned a British warship that had been vigorously enforcing unpopular trade regulations in what became known as the ": null
    },
    {
        "Gaspee Affair": "Gaspee Affair"
    },
    {
        ". The affair was investigated for possible treason, but no action was taken.     In 1772, it became known that the Crown intended to pay fixed salaries to the governors and judges in Massachusetts, which had been paid by local authorities. This would reduce the influence of colonial representatives over their government. Samuel Adams in Boston set about creating new Committees of Correspondence, which linked Patriots in all 13 colonies and eventually provided the framework for a rebel government. Virginia, the largest colony, set up its Committee of Correspondence in early 1773, on which Patrick Henry and Thomas Jefferson served. Greene and Pole chapters 22–24     A total of about 7,000 to 8,000 Patriots served on Committees of Correspondence at the colonial and local levels, comprising most of the leadership in their communities. Loyalists were excluded. The committees became the ": null
    },
    {
        "leaders": "Leadership"
    },
    {
        " of the American resistance to British actions, and largely determined the war effort at the state and local level. When the First Continental Congress decided to boycott British products, the colonial and local Committees took charge, examining merchant records and publishing the names of merchants who attempted to defy the boycott by importing British goods. Mary Beth Norton et al., A People and a Nation vol 1 pp. 144–45       In 1773, ": null
    },
    {
        "private letters were published": "Hutchinson Letters Affair"
    },
    {
        " in which Massachusetts Governor Thomas Hutchinson claimed that the colonists could not enjoy all English liberties, and Lieutenant Governor ": null
    },
    {
        "Andrew Oliver": "Andrew Oliver"
    },
    {
        " called for the direct payment of colonial officials. The letters contents were used as evidence of a systematic plot against American rights, and discredited Hutchinson in the eyes of the people; the Assembly petitioned for his recall. ": null
    },
    {
        "Benjamin Franklin": "Benjamin Franklin"
    },
    {
        ", postmaster general for the colonies, acknowledged that he leaked the letters, which led to him being berated by British officials and fired from his job.     Meanwhile, Parliament passed the ": null
    },
    {
        "Tea Act": "Tea Act"
    },
    {
        " to lower the price of taxed tea exported to the colonies in order to help the ": null
    },
    {
        "East India Company": "East India Company"
    },
    {
        " undersell smuggled Dutch tea. Special consignees were appointed to sell the tea in order to bypass colonial merchants. The act was opposed by those who resisted the taxes and also by smugglers who stood to lose business. In most instances, the consignees were forced to resign and the tea was turned back, but Massachusetts governor Hutchinson refused to allow Boston merchants to give in to pressure. A town meeting in Boston determined that the tea would not be landed, and ignored a demand from the governor to disperse. On December 16, 1773, a group of men, led by Samuel Adams and dressed to evoke the appearance of American Indians, boarded the ships of the ": null
    },
    {
        "British East India Company": "East India Company"
    },
    {
        " and dumped £10,000 worth of tea from their holds into Boston Harbor. Decades later, this event became known as the ": null
    },
    {
        "Boston Tea Party": "Boston Tea Party"
    },
    {
        " and remains a significant part of American patriotic lore. Benjamin L. Carp, Defiance of the Patriots: The Boston Tea Party and the Making of America               The British government responded by passing several Acts which came to be known as the ": null
    },
    {
        "Intolerable Acts": "Intolerable Acts"
    },
    {
        ", which further darkened colonial opinion towards the British. They consisted of four laws enacted by the British parliament. Miller pp. 353–76   The first was the ": null
    },
    {
        "Massachusetts Government Act": "Massachusetts Government Act"
    },
    {
        " which altered the Massachusetts charter and restricted town meetings. The second act was the ": null
    },
    {
        "Administration of Justice Act": "Administration Of Justice Act 1774"
    },
    {
        " which ordered that all British soldiers to be tried were to be arraigned in Britain, not in the colonies. The third Act was the ": null
    },
    {
        "Boston Port Act": "Boston Port Act"
    },
    {
        ", which closed the port of Boston until the British had been compensated for the tea lost in the Boston Tea Party. The fourth Act was the ": null
    },
    {
        "Quartering Act of 1774": "Quartering Acts"
    },
    {
        ", which allowed royal governors to house British troops in the homes of citizens without requiring permission of the owner. Carp, Defiance of the Patriots: The Boston Tea Party and the Making of America ch 9     In response, Massachusetts patriots issued the ": null
    },
    {
        "Suffolk Resolves": "Suffolk Resolves"
    },
    {
        " and formed an alternative shadow government known as the Provincial Congress which began training militia outside British-occupied Boston.    In September 1774, the ": null
    },
    {
        "First Continental Congress": "First Continental Congress"
    },
    {
        " convened, consisting of representatives from each of the colonies, to serve as a vehicle for deliberation and collective action. During secret debates, conservative ": null
    },
    {
        "Joseph Galloway": "Joseph Galloway"
    },
    {
        " proposed the creation of a colonial Parliament that would be able to approve or disapprove of acts of the British Parliament, but his idea was not accepted. The Congress instead endorsed the proposal of John Adams that Americans would obey Parliament voluntarily but would resist all taxes in disguise. Congress called for a boycott beginning on 1 December 1774 of all British goods; it was enforced by new committees authorized by the Congress.                  Massachusetts was declared in a state of rebellion in February 1775 and the British garrison received orders to disarm the rebels and arrest their leaders, leading to the ": null
    },
    {
        "Battles of Lexington and Concord": "Battles Of Lexington And Concord"
    },
    {
        " on 19 April 1775. The Patriots laid siege to Boston, expelled royal officials from all the colonies, and took control through the establishment of ": null
    },
    {
        "Provincial Congress": "Provincial Congress"
    },
    {
        "es. The ": null
    },
    {
        "Battle of Bunker Hill": "Battle Of Bunker Hill"
    },
    {
        " followed on June 17, 1775. It was a British victory—but at a great cost: about 1,000 British casualties from a garrison of about 6,000, as compared to 500 American casualties from a much larger force. Harvey.  A few bloody noses  pp. 208–210 Urban p.74 The Second Continental Congress was divided on the best course of action, but eventually produced the ": null
    },
    {
        "Olive Branch Petition": "Olive Branch Petition"
    },
    {
        ", in which they attempted to come to an accord with ": null
    },
    {
        "King George": "George Iii Of The United Kingdom"
    },
    {
        ". The king, however, issued a ": null
    },
    {
        "Proclamation of Rebellion": "Proclamation Of Rebellion"
    },
    {
        " which stated that the states were in rebellion and the members of Congress were traitors.     The war that arose was in some ways a classic ": null
    },
    {
        "insurgency": "Insurgency"
    },
    {
        ". As ": null
    },
    {
        "Benjamin Franklin": "Benjamin Franklin"
    },
    {
        " wrote to ": null
    },
    {
        "Joseph Priestley": "Joseph Priestley"
    },
    {
        " in October 1775: Britain, at the expense of three millions, has killed 150 Yankees this campaign, which is £20,000 a head... During the same time, 60,000 children have been born in America. From these data his mathematical head will easily calculate the time and expense necessary to kill us all. .      In the winter of 1775, the Americans ": null
    },
    {
        "invaded Canada": "Invasion Of Canada"
    },
    {
        " under generals ": null
    },
    {
        "Benedict Arnold": "Benedict Arnold"
    },
    {
        " and ": null
    },
    {
        "Richard Montgomery": "Richard Montgomery"
    },
    {
        ". The attack was a failure; many Americans who werent killed were either captured or died of smallpox.     In March 1776, the Continental Army forced the British to ": null
    },
    {
        "evacuate Boston": "Evacuation Day"
    },
    {
        ", with George Washington as the commander of the new army. The revolutionaries were now in full control of all 13 colonies and were ready to declare independence. There still were many Loyalists, but they were no longer in control anywhere by July 1776, and all of the Royal officials had fled. Miller p. 87       Following the ": null
    },
    {
        "Battle of Bunker Hill": "Battle Of Bunker Hill"
    },
    {
        " in June 1775, the Patriots had control of Massachusetts outside the Boston city limits, and the Loyalists suddenly found themselves on the defensive with no protection from the British army. In all 13 colonies, Patriots had overthrown their existing governments, closing courts and driving away British officials. They had elected conventions and legislatures that existed outside any legal framework; new constitutions were drawn up in each state to supersede royal charters. They declared that they were states, not colonies. Nevins ; Greene and Pole chapter 29     On January 5, 1776, ": null
    },
    {
        "New Hampshire": "Province Of New Hampshire"
    },
    {
        " ratified the first state constitution. In May 1776, Congress voted to suppress all forms of crown authority, to be replaced by locally created authority. Virginia, ": null
    },
    {
        "South Carolina": "Province Of South Carolina"
    },
    {
        ", and New Jersey created their constitutions before July 4. ": null
    },
    {
        "Rhode Island": "Colony Of Rhode Island And Providence Plantations"
    },
    {
        " and ": null
    },
    {
        "Connecticut": "Connecticut Colony"
    },
    {
        " simply took their existing ": null
    },
    {
        "royal charters": "Royal Charter"
    },
    {
        "and deleted all references to the crown. Nevins The new states were all committed to republicanism, with no inherited offices. They decided what form of government to create, and also how to select those who would craft the constitutions and how the resulting document would be ratified. On 26 May 1776, ": null
    },
    {
        "John Adams": "John Adams"
    },
    {
        " wrote James Sullivan from Philadelphia:          The resulting constitutions in states such as ": null
    },
    {
        "Maryland": "Province Of Maryland"
    },
    {
        ", Virginia, ": null
    },
    {
        "Delaware": "Delaware Colony"
    },
    {
        ", New York, and ": null
    },
    {
        "Massachusetts": "Constitution Of Massachusetts"
    },
    {
        " Massachusetts constitution is still in force in the 21st century, continuously since its ratification on June 15, 1780 featured:     Property qualifications for voting and even more substantial requirements for elected positions   ": null
    },
    {
        "Bicameral legislature": "Bicameral Legislature"
    },
    {
        "s, with the upper house as a check on the lower   Strong ": null
    },
    {
        "governors": "Governor"
    },
    {
        "with veto power over the legislature and substantial appointment authority   Few or no restraints on individuals holding multiple positions in government   The continuation of ": null
    },
    {
        "state-established religion": "Established Church"
    },
    {
        "     In Pennsylvania, New Jersey, and New Hampshire, the resulting constitutions embodied:     universal manhood suffrage, or minimal property requirements for voting or holding office   strong, ": null
    },
    {
        "unicameral legislatures": "Unicameralism"
    },
    {
        "           In April 1776, the ": null
    },
    {
        "North Carolina Provincial Congress": "North Carolina Provincial Congress"
    },
    {
        " issued the ": null
    },
    {
        "Halifax Resolves": "Halifax Resolves"
    },
    {
        " explicitly authorizing its delegates to vote for independence. Jensen, The Founding of a Nation pp. 678–79 By June, nine Provincial Congresses were ready for independence; one by one, the last four fell into line: Pennsylvania, Delaware, Maryland, and New York. ": null
    },
    {
        "Richard Henry Lee": "Richard Henry Lee"
    },
    {
        " was instructed by the Virginia legislature to propose independence, and he did so on June 7, 1776. On June 11, a committee was created to draft a document explaining the justifications for separation from Britain. After securing enough votes for passage, independence was voted for on July 2.     The ": null
    },
    {
        "Declaration of Independence": "United States Declaration Of Independence"
    },
    {
        " was drafted largely by ": null
    },
    {
        "Thomas Jefferson": "Thomas Jefferson"
    },
    {
        " and presented by the committee; it was unanimously adopted by the entire Congress on July 4, Maier, American Scripture pp. 41–46 and each of the colonies became independent and autonomous. The next step was to form a union to facilitate international relations and alliances. Armitage, David. The Declaration of Independence: A Global History. Harvard University Press, London. 2007. The Articles of Confederation safeguarded it for each of the thirteen states in Article II , but confined its international expression to Congress alone. Tesesis, Alexander. Self-Government and the Declaration of Independence. Cornell Law Review, Volume 97   Issue 4. May 2012. .     The Second Continental Congress approved the Articles of Confederation for ratification by the states on November 15, 1777; the Congress immediately began operating under the Articles terms, providing a structure of shared sovereignty during prosecution of the war and facilitating international relations and alliances with France and Spain. The articles were ratified on March 1, 1781. At that point, the Continental Congress was dissolved and a new government of the ": null
    },
    {
        "United States in Congress Assembled": "Congress Of The Confederation"
    },
    {
        " took its place on the following day, with ": null
    },
    {
        "Samuel Huntington": "Samuel Huntington"
    },
    {
        " as presiding officer. Greene and Pole chapter 30 Klos, President Who? Forgotten Founders                    According to British historian ": null
    },
    {
        "Jeremy Black": "Jeremy Black"
    },
    {
        ", the British had significant advantages, including a highly trained army, the worlds largest navy, and an efficient system of public finance that could easily fund the war. However, they seriously misunderstood the depth of support for the American Patriot position and ignored the advice of General Gage, misinterpreting the situation as merely a large-scale riot. The British government believed that they could overawe the Americans by sending a large military and naval force, forcing them to be loyal again:          Washington forced the British out of Boston in the spring of 1776, and neither the British nor the Loyalists controlled any significant areas. The British, however, were massing forces at their naval base at ": null
    },
    {
        "Halifax, Nova Scotia": "Halifax Regional Municipality"
    },
    {
        ". They returned in force in July 1776, landing in New York and defeating Washingtons Continental Army in August at the ": null
    },
    {
        "Battle of Brooklyn": "Battle Of Long Island"
    },
    {
        ". Following that victory, they requested a meeting with representatives from Congress to negotiate an end to hostilities. Schecter, Barnet. The Battle for New York: The City at the Heart of the American Revolution. McCullough, 1776     A delegation including John Adams and Benjamin Franklin met British admiral ": null
    },
    {
        "Richard Howe": "Richard Howe, 1St Earl Howe"
    },
    {
        " on ": null
    },
    {
        "Staten Island": "Staten Island"
    },
    {
        " in New York Harbor on September 11 in what became known as the ": null
    },
    {
        "Staten Island Peace Conference": "Staten Island Peace Conference"
    },
    {
        ". Howe demanded that the Americans retract the Declaration of Independence, which they refused to do, and negotiations ended. The British then ": null
    },
    {
        "seized New York City": "Battle Of Kips Bay"
    },
    {
        " and nearly captured Washingtons army. They made New York their main political and military base of operations, holding it until ": null
    },
    {
        "November 1783": "Evacuation Day"
    },
    {
        ". The city became the destination for Loyalist refugees and a focal point of Washingtons ": null
    },
    {
        "intelligence network": "Intelligence In The American Revolutionary War"
    },
    {
        ".     The British also took New Jersey, pushing the Continental Army into Pennsylvania. Washington ": null
    },
    {
        "crossed the Delaware River": "Washingtons Crossing Of The Delaware"
    },
    {
        " back into New Jersey in a surprise attack in late December 1776 and defeated the ": null
    },
    {
        "Hessian": "Hessian"
    },
    {
        " and British armies at ": null
    },
    {
        "Trenton": "Battle Of Trenton"
    },
    {
        " and ": null
    },
    {
        "Princeton": "Battle Of Princeton"
    },
    {
        ", thereby regaining control of most of New Jersey. The victories gave an important boost to Patriots at a time when morale was flagging, and they have become iconic events of the war.     In 1777, the British sent Burgoynes invasion force from Canada south to New York to seal off New England. Their aim was to isolate New England, which the British perceived as the primary source of agitation. Rather than move north to support Burgoyne, the British army in New York City went to Philadelphia in a major case of mis-coordination, capturing it from Washington. The invasion army under ": null
    },
    {
        "Burgoyne": "John Burgoyne"
    },
    {
        " was much too slow and became trapped in northern New York state. It surrendered after the ": null
    },
    {
        "Battles of Saratoga": "Battles Of Saratoga"
    },
    {
        " in October 1777. From early October 1777 until November 15, a siege distracted British troops at ": null
    },
    {
        "Fort Mifflin": "Fort Mifflin"
    },
    {
        ", Philadelphia, Pennsylvania and allowed Washington time to preserve the Continental Army by safely leading his troops to harsh winter quarters at ": null
    },
    {
        "Valley Forge": "Valley Forge"
    },
    {
        ".          In August 1775, George III declared Americans to be traitors to the Crown if they took up arms against royal authority. There were thousands of British and Hessian soldiers in American hands following their surrender at the ": null
    },
    {
        "Battles of Saratoga": "Battles Of Saratoga"
    },
    {
        " in October 1777. Lord Germain took a hard line, but the British generals on American soil never held treason trials and treated captured American soldiers as prisoners of war. Alan Valentine, Lord George Germain pp.  309–10 The dilemma was that tens of thousands of Loyalists were under American control and American retaliation would have been easy. The British built much of their strategy around using these Loyalists. Larry G. Bowman, Captive Americans: Prisoners During the American Revolution The British maltreated the prisoners whom they held, resulting in more deaths to American prisoners of war than from combat operations. At the end of the war, both sides released their surviving prisoners. John C. Miller, Triumph of Freedom, 1775–1783 p. 166.            The capture of a British army at Saratoga encouraged the French to formally enter the war in support of Congress, and Benjamin Franklin negotiated a permanent military alliance in early 1778; France thus became the first foreign nation to officially recognize the Declaration of Independence. On February 6, 1778, the United States and France signed the ": null
    },
    {
        "Treaty of Amity and Commerce": "Treaty Of Amity And Commerce"
    },
    {
        " and the ": null
    },
    {
        "Treaty of Alliance": "Treaty Of Alliance"
    },
    {
        ". Hamilton, The Papers of Alexander Hamilton p. 28 ": null
    },
    {
        "William Pitt": "William Pitt, 1St Earl Of Chatham"
    },
    {
        " spoke out in Parliament urging Britain to make peace in America and to unite with America against France, while British politicians who had sympathized with colonial grievances now turned against the Americans for allying with Britains rival and enemy. Stanley Weintraub, Iron Tears: Americas Battle for Freedom, Britains Quagmire, 1775–1783 p. 151     The Spanish and the Dutch became allies of the French in 1779 and 1780 respectively, forcing the British to fight a global war without major allies and requiring it to slip through a combined blockade of the Atlantic. Britain began to view the American war for independence as merely one front in a wider war, Mackesy, The War for America p. 568 and the British chose to withdraw troops from America to reinforce the sugar-producing Caribbean colonies, which were more lucrative to British investors. British commander Sir ": null
    },
    {
        "Henry Clinton": "Henry Clinton"
    },
    {
        " evacuated Philadelphia and returned to New York City. General Washington intercepted him in the ": null
    },
    {
        "Battle of Monmouth Court House": "Battle Of Monmouth"
    },
    {
        ", the last major battle fought in the north. After an inconclusive engagement, the British retreated to New York City. The northern war subsequently became a stalemate, as the focus of attention shifted to the smaller southern theater. Higginbotham, The War of American Independence p. 83               The British strategy in America now concentrated on a campaign in the southern states. With fewer regular troops at their disposal, the British commanders saw the southern strategy as a more viable plan, as they perceived the south as strongly Loyalist with a large population of recent immigrants and large numbers of slaves who might be captured or run away to join the British. Crow and Tise, The Southern Experience in the American Revolution p.  157–9     Beginning in late December 1778, they captured ": null
    },
    {
        "Savannah": "Savannah, Georgia"
    },
    {
        " and controlled the ": null
    },
    {
        "Georgia": "Province Of Georgia"
    },
    {
        " coastline. In 1780, they launched a fresh invasion and ": null
    },
    {
        "took Charleston": "Siege Of Charleston"
    },
    {
        ", as well. A significant victory at the ": null
    },
    {
        "Battle of Camden": "Battle Of Camden"
    },
    {
        " meant that royal forces soon controlled most of Georgia and South Carolina. The British set up a network of forts inland, hoping that the Loyalists would rally to the flag. Henry Lumpkin, From Savannah to Yorktown: The American Revolution in the South Not enough Loyalists turned out, however, and the British had to fight their way north into North Carolina and Virginia with a severely weakened army. Behind them, much of the territory that they had already captured dissolved into a chaotic guerrilla war, fought predominantly between bands of Loyalists and American militia, which negated many of the gains that the British had previously made.                 The British army under Cornwallis marched to ": null
    },
    {
        "Yorktown, Virginia": "Yorktown, Virginia"
    },
    {
        " where they expected to be rescued by a British fleet. Brendan Morrissey, Yorktown 1781: The World Turned Upside Down The fleet did arrive, but so did a larger French fleet. The French were victorious in the ": null
    },
    {
        "Battle of the Chesapeake": "Battle Of The Chesapeake"
    },
    {
        ", and the British fleet returned to New York for reinforcements, leaving Cornwallis trapped. In October 1781, the British surrendered their second invading army of the war, under a siege by the combined French and Continental armies commanded by Washington. Harvey pp. 493–515       Historians continue to debate whether the odds were long or short for American victory. ": null
    },
    {
        "John E. Ferling": "John E. Ferling"
    },
    {
        " says that the odds were so long that the American victory was almost a miracle . John Ferling, Almost A Miracle: The American Victory in the War of Independence On the other hand, ": null
    },
    {
        "Joseph Ellis": "Joseph Ellis"
    },
    {
        " says that the odds favored the Americans, and asks whether there ever was any realistic chance for the British to win. He argues that this opportunity came only once, in the summer of 1776, and the British failed that test. Admiral Howe and his brother General Howe missed several opportunities to destroy the Continental Army…. Chance, luck, and even the vagaries of the weather played crucial roles. Elliss point is that the strategic and tactical decisions of the Howes were fatally flawed because they underestimated the challenges posed by the Patriots. Ellis concludes that, once the Howe brothers failed, the opportunity would never come again for a British victory.      Support for the conflict had never been strong in Britain, where many sympathized with the Americans, but now it reached a new low. Harvey p.528 King George personally wanted to fight on, but his supporters lost control of Parliament and they launched no further offensives in America. A final naval battle was fought on March 10, 1783 by Captain ": null
    },
    {
        "John Barry": "John Barry"
    },
    {
        " and the crew of the ": null
    },
    {
        "USS Alliance": "Uss Alliance"
    },
    {
        ", who defeated three British warships led by HMS Sybille. Martin I. J. Griffin, The Story of Commodore John Barry pp. 218–23 War erupted between America and Britain three decades later with the ": null
    },
    {
        "War of 1812": "War Of 1812"
    },
    {
        ", which firmly established the permanence of the United States and its complete autonomy.      Washington did not know whether the British might reopen hostilities after Yorktown. They still had 26,000 troops occupying New York City, Charleston, and Savannah, together with a powerful fleet. The French army and navy departed, so the Americans were on their own in 1782–83. Jonathan R. Dull, The French Navy and American Independence p. 248 The treasury was empty, and the unpaid soldiers were growing restive, almost to the point of mutiny or possible coup détat. Washington personally dispelled the unrest among officers of the ": null
    },
    {
        "Newburgh Conspiracy": "Newburgh Conspiracy"
    },
    {
        " in 1783, and Congress subsequently created the promise of a five years bonus for all officers. Richard H. Kohn, Eagle and Sword: The Federalists and the Creation of the Military Establishment in America, 1783–1802 pp. 17–39             During negotiations in Paris, the American delegation discovered that France supported American independence but no territorial gains, hoping to confine the new nation to the area east of the Appalachian Mountains. The Americans opened direct secret negotiations with London, cutting out the French. British Prime Minister ": null
    },
    {
        "Lord Shelburne": "William Petty, 2Nd Earl Of Shelburne"
    },
    {
        " was in full charge of the British negotiations, and he saw a chance to make the United States a valuable economic partner. Charles R. Ritcheson, The Earl of Shelbourne and Peace with America, 1782–1783: Vision and Reality. International History Review 53 : 322–45. The US obtained all the land east of the Mississippi River, south of Canada, and north of Florida. It gained fishing rights off Canadian coasts, and agreed to allow British merchants and Loyalists to recover their property. Prime Minister Shelburne foresaw highly profitable two-way trade between Britain and the rapidly growing United States, which did come to pass. The blockade was lifted and all British interference had been driven out, and American merchants were free to trade with any nation anywhere in the world.      The British largely abandoned their American Indian allies, who were not a party to this treaty and did not recognize it until they were defeated militarily by the United States. However, the British did sell them munitions and maintain forts in American territory until the ": null
    },
    {
        "Jay Treaty": "Jay Treaty"
    },
    {
        " of 1795.      Losing the war and the Thirteen Colonies was a shock to Britain. The war revealed the limitations of Britains ": null
    },
    {
        "fiscal-military state": "Fiscal-Military State"
    },
    {
        " when they discovered that they suddenly faced powerful enemies with no allies, and they were dependent on extended and vulnerable transatlantic lines of communication. The defeat heightened dissension and escalated political antagonism to the Kings ministers. Inside Parliament, the primary concern changed from fears of an over-mighty monarch to the issues of representation, parliamentary reform, and government retrenchment. Reformers sought to destroy what they saw as widespread institutional corruption, William Hague, William Pitt the Younger Jeremy Black, George III: Americas Last King and the result was a crisis from 1776 to 1783. The peace in 1783 left France financially prostrate, while the British economy boomed thanks to the return of American business. The crisis ended after 1784 thanks to the Kings shrewdness in outwitting ": null
    },
    {
        "Charles James Fox": "Charles James Fox"
    },
    {
        " , and renewed confidence in the system engendered by the leadership of Prime Minister ": null
    },
    {
        "William Pitt": "William Pitt The Younger"
    },
    {
        ". Some historians suggest that loss of the American colonies enabled Britain to deal with the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        " with more unity and better organization than would otherwise have been the case. Britain turned towards Asia, the Pacific, and later Africa with subsequent exploration leading to the rise of the ": null
    },
    {
        "Second British Empire": "Second British Empire"
    },
    {
        ". Canny, p.  92.       Britains war against the Americans, the French, and the Spanish cost about £100 million, and the Treasury borrowed 40-percent of the money that it needed. Paul Kennedy, The Rise and Fall of the Great Powers pp. 81, 119 Heavy spending brought France to the ": null
    },
    {
        "verge of bankruptcy and revolution": "Causes Of The French Revolutioneconomics And Finances"
    },
    {
        ", while the British had relatively little difficulty financing their war, keeping their suppliers and soldiers paid, and hiring tens of thousands of German soldiers. John Brewer, The sinews of power: war, money, and the English state, 1688–1783 p. 91 Britain had a sophisticated financial system based on the wealth of thousands of landowners who supported the government, together with banks and financiers in London. The British tax system collected about 12 percent of the GDP in taxes during the 1770s.        In sharp contrast, Congress and the American states had no end of difficulty financing the war. Curtis P. Nettels, The Emergence of a National Economy, 1775–1815 pp. 23–44 In 1775, there was at most 12 million dollars in gold in the colonies, not nearly enough to cover current transactions, let alone finance a major war. The British made the situation much worse by imposing a tight blockade on every American port, which cut off almost all imports and exports. One partial solution was to rely on volunteer support from militiamen and donations from patriotic citizens. Charles Rappleye, Robert Morris: Financier of the American Revolution pp. 225–52 Edwin J. Perkins, American public finance and financial services, 1700–1815 pp. 85–106.  Another was to delay actual payments, pay soldiers and suppliers in depreciated currency, and promise that it would be made good after the war. Indeed, the soldiers and officers were given land grants in 1783 to cover the wages that they had earned but had not been paid during the war. The national government did not have a strong leader in financial matters until 1781, when ": null
    },
    {
        "Robert Morris": "Robert Morris"
    },
    {
        " was named ": null
    },
    {
        "Superintendent of Finance of the United States": "Superintendent Of Finance Of The United States"
    },
    {
        ". Morris used a French loan in 1782 to set up the private ": null
    },
    {
        "Bank of North America": "Bank Of North America"
    },
    {
        " to finance the war. He reduced the civil list, saved money by using competitive bidding for contracts, tightened accounting procedures, and demanded the national governments full share of money and supplies from the individual states.     Congress used four main methods to cover the cost of the war, which cost about 66 million dollars in specie . Oliver Harry Chitwood, A History of Colonial America pp. 586–89 Congress made issues of paper money in 1775–1780 and in 1780–81. The first issue amounted to 242 million dollars. This paper money would supposedly be redeemed for state taxes, but the holders were eventually paid off in 1791 at the rate of one cent on the dollar. By 1780, the paper money was not worth a Continental , as people said.  The skyrocketing inflation was a hardship on the few people who had fixed incomes, but 90 percent of the people were farmers and were not directly affected by it. Debtors benefited by paying off their debts with depreciated paper. The greatest burden was borne by the soldiers of the Continental Army whose wages were usually in arrears and declined in value every month, weakening their morale and adding to the hardships of their families.      Beginning in 1777, Congress repeatedly asked the states to provide money, but the states had no system of taxation and were of little help. By 1780, Congress was making requisitions for specific supplies of corn, beef, pork, and other necessities, an inefficient system which barely kept the army alive. Erna Risch, Supplying Washingtons Army E. Wayne Carp, To Starve the Army at Pleasure: Continental Army Administration and American Political Culture, 1775–1783 Starting in 1776, the Congress sought to raise money by loans from wealthy individuals, promising to redeem the bonds after the war. The bonds were in fact redeemed in 1791 at face value, but the scheme raised little money because Americans had little specie, and many of the rich merchants were supporters of the Crown. The French secretly supplied the Americans with money, gunpowder, and munitions in order to weaken Great Britain; the subsidies continued when France entered the war in 1778, and the French government and Paris bankers lent large sums to the American war effort. These loans were repaid in full in the 1790s. E. James Ferguson, The power of the purse: A history of American public finance, 1776–1790                       The war ended in 1783 and was followed by a period of prosperity. The national government was still operating under the Articles of Confederation and was able to settle the issue of the western territories, which the states ceded to Congress. American settlers moved rapidly into those areas, with Vermont, Kentucky, and Tennessee becoming states in the 1790s. Greene and Pole, eds. Companion to the American Revolution, pp. 557–624     However, the national government had no money either to pay the war debts owed to European nations and the private banks, or to pay Americans who had been given millions of dollars of promissory notes for supplies during the war. Nationalists led by Washington, Alexander Hamilton, and other veterans feared that the new nation was too fragile to withstand an international war, or even internal revolts such as the ": null
    },
    {
        "Shays Rebellion": "Shays Rebellion"
    },
    {
        " of 1786 in Massachusetts. They convinced Congress to call the ": null
    },
    {
        "Philadelphia Convention": "Philadelphia Convention"
    },
    {
        " in 1787 and named their party the Federalist party. Richard B. Morris, The Forging of the Union: 1781–1789 pp. 245–66 The Convention adopted a new ": null
    },
    {
        "Constitution": "Constitution Of The United States"
    },
    {
        " which provided for a much stronger federal government, including an effective executive in a ": null
    },
    {
        "check-and-balance": "Separation Of Powers"
    },
    {
        " system with the judiciary and legislature. Morris, The Forging of the Union: 1781–1789 pp. 300–13 The Constitution was ratified in 1788, after a fierce debate in the states over the nature of the proposed new government. The new government under President George Washington took office in New York in March 1789. Morris, The Forging of the Union, 1781–1789 pp. 300–22 ": null
    },
    {
        "James Madison": "James Madison"
    },
    {
        " spearheaded Congressional amendments to the Constitution as assurances to those who were cautious about federal power, guaranteeing many of the ": null
    },
    {
        "inalienable rights": "Inalienable Rights"
    },
    {
        " that formed a foundation for the revolution, and Rhode Island was the final state to ratify the Constitution in 1791.               The national debt fell into three categories after the American Revolution. The first was the $12 million owed to foreigners, mostly money borrowed from France. There was general agreement to pay the foreign debts at full value. The national government owed $40 million and state governments owed $25 million to Americans who had sold food, horses, and supplies to the Patriot forces. There were also other debts which consisted of ": null
    },
    {
        "promissory notes": "Promissory Note"
    },
    {
        "issued during the war to soldiers, merchants, and farmers who accepted these payments on the premise that the new Constitution would create a government that would pay these debts eventually.     The war expenses of the individual states added up to $114 million, compared to $37 million by the central government. Jensen, The New Nation p. 379 In 1790, Congress combined the remaining state debts with the foreign and domestic debts into one national debt totaling $80 million at the recommendation of first Secretary of the Treasury ": null
    },
    {
        "Alexander Hamilton": "Alexander Hamilton"
    },
    {
        ". Everyone received face value for wartime certificates, so that the national honor would be sustained and the national credit established. Joseph J. Ellis, His Excellency: George Washington p. 204       The population of the Thirteen States was not homogeneous in political views and attitudes. Loyalties and allegiances varied widely within regions and communities and even within families, and sometimes shifted during the course of the Revolution.          The American Enlightenment was a critical precursor of the American Revolution. Chief among the ideas of the American Enlightenment were the concepts of Natural Law, Natural Rights, Consent of the Governed, Individualism, Property Rights, Self-Ownership, Self-Determination, liberalism, republicanism, and defense against corruption. A growing number of American colonists embraced these views and fostered an intellectual environment which led to a new sense of political and social identity. Robert A. Ferguson, The American Enlightenment, 1750–1820 .                     ": null
    },
    {
        "John Lockes": "John Locke"
    },
    {
        " ideas on liberty influenced the political thinking behind the revolution, especially through his indirect influence on English writers such as ": null
    },
    {
        "John Trenchard": "John Trenchard"
    },
    {
        ", ": null
    },
    {
        "Thomas Gordon": "Thomas Gordon"
    },
    {
        ", and ": null
    },
    {
        "Benjamin Hoadly": "Benjamin Hoadly"
    },
    {
        ", whose political ideas in turn had a strong influence on the American Patriots. Middlekauff , pp. 136–38 Locke is often referred to as the philosopher of the American Revolution due to his work in the Social Contract and Natural Rights theories that underpinned the Revolutions political ideology.  Lockes ": null
    },
    {
        "Two Treatises of Government": "Two Treatises Of Government"
    },
    {
        " published in 1689 was especially influential. He argued that all humans were created equally free, and governments therefore needed the consent of the governed . Waldron , p. 136 In late eighteenth-century America, belief was still widespread in equality by creation and rights by creation . Thomas S. Kidd : God of Liberty: A Religious History of the American Revolution, New York, pp. 6–7     The theory of the ": null
    },
    {
        "social contract": "Social Contract"
    },
    {
        " influenced the belief among many of the Founders that the ": null
    },
    {
        "right of the people to overthrow their leaders": "Right Of Revolution"
    },
    {
        " was one of the natural rights of man, should those leaders betray the historic ": null
    },
    {
        "rights of Englishmen": "Rights Of Englishmen"
    },
    {
        ". Charles W. Toth, Liberte, Egalite, Fraternite: The American Revolution and the European Response. p. 26. Philosophical Tales, by Martin Cohen, , p. 101 The Americans heavily used ": null
    },
    {
        "Montesquieus": "Charles De Secondat, Baron De Montesquieu"
    },
    {
        "analysis of the wisdom of the balanced British Constitution  in writing the state and national constitutions.             The American ideology called republicanism was inspired by the ": null
    },
    {
        "Whig party": "Whig"
    },
    {
        " in Great Britain which openly criticized the corruption within the British government. Stanley Weintraub, Iron Tears: Americas Battle for Freedom, Britains Quagmire, 1775–1783 chapter 1 Americans were increasingly embracing republican values, seeing Britain as corrupt and hostile to American interests. Bailyn,  The Ideological Origins of the American Revolution pp. 125–37 The colonists associated political corruption with luxury and inherited aristocracy, which they condemned. Wood, The Radicalism of the American Revolution pp. 35, 174–75     The Founding Fathers were strong advocates of republican values, particularly ": null
    },
    {
        "Samuel Adams": "Samuel Adams"
    },
    {
        ", ": null
    },
    {
        "Patrick Henry": "Patrick Henry"
    },
    {
        ", ": null
    },
    {
        "John Adams": "John Adams"
    },
    {
        ", ": null
    },
    {
        "Benjamin Franklin": "Benjamin Franklin"
    },
    {
        ", ": null
    },
    {
        "Thomas Jefferson": "Thomas Jefferson"
    },
    {
        ", ": null
    },
    {
        "Thomas Paine": "Thomas Paine"
    },
    {
        ", ": null
    },
    {
        "George Washington": "George Washington"
    },
    {
        ", ": null
    },
    {
        "James Madison": "James Madison"
    },
    {
        ", and ": null
    },
    {
        "Alexander Hamilton": "Alexander Hamilton"
    },
    {
        ", Shalhope, Toward a Republican Synthesis pp. 49–80 which required men to put civic duty ahead of their personal desires. Men had a civic duty to be prepared and willing to fight for the rights and liberties of their countrymen. John Adams wrote to ": null
    },
    {
        "Mercy Otis Warren": "Mercy Otis Warren"
    },
    {
        " in 1776, agreeing with some classical Greek and Roman thinkers: Public Virtue cannot exist without private, and public Virtue is the only Foundation of Republics. He continued:        ": null
    },
    {
        "Republican motherhood": "Republican Motherhood"
    },
    {
        " became the ideal for American women, exemplified by ": null
    },
    {
        "Abigail Adams": "Abigail Adams"
    },
    {
        " and ": null
    },
    {
        "Mercy Otis Warren": "Mercy Otis Warren"
    },
    {
        "; the first duty of the republican woman was to instill republican values in her children and to avoid luxury and ostentation. Linda K. Kerber, Women of the Republic: Intellect and Ideology in Revolutionary America .        Thomas Paine published his pamphlet  Common Sense  in January 1776, after the Revolution had started. It was widely distributed and often read aloud in taverns, contributing significantly to spreading the ideas of republicanism and liberalism together, bolstering enthusiasm for separation from Great Britain and encouraging recruitment for the Continental Army. Ferguson, The Commonalities of Common Sense pp. 465–504 Paine offered a solution for Americans who were alarmed by the threat of tyranny.             Protestant churches that had separated from the Church of England were the school of democracy , in the words of historian Patricia Bonomi. Bonomi, p. 186, Chapter 7 Religion and the American Revolution Before the Revolution, the ": null
    },
    {
        "Southern Colonies": "Southern Colonies"
    },
    {
        " and three of the ": null
    },
    {
        "New England Colonies": "New England Colonies"
    },
    {
        " had officially established churches: Congregational in ": null
    },
    {
        "Massachusetts Bay": "Province Of Massachusetts Bay"
    },
    {
        ", ": null
    },
    {
        "Connecticut": "Connecticut Colony"
    },
    {
        ", and ": null
    },
    {
        "New Hampshire": "Province Of New Hampshire"
    },
    {
        ", and Anglican in ": null
    },
    {
        "Maryland": "Province Of Maryland"
    },
    {
        ", ": null
    },
    {
        "Virginia": "Colony Of Virginia"
    },
    {
        ", ": null
    },
    {
        "North-Carolina": "Province Of North-Carolina"
    },
    {
        ", ": null
    },
    {
        "South Carolina": "Province Of South Carolina"
    },
    {
        ", and ": null
    },
    {
        "Georgia": "Province Of Georgia"
    },
    {
        ". ": null
    },
    {
        "New York": "Province Of New York"
    },
    {
        ", ": null
    },
    {
        "New Jersey": "Province Of New Jersey"
    },
    {
        ", ": null
    },
    {
        "Pennsylvania": "Province Of Pennsylvania"
    },
    {
        ", ": null
    },
    {
        "Delaware": "Delaware Colony"
    },
    {
        ", and the ": null
    },
    {
        "Colony of Rhode Island and Providence Plantations": "Colony Of Rhode Island And Providence Plantations"
    },
    {
        " had no officially established churches.  Church membership statistics from the period are unreliable and scarce,  but what little data exists indicates that Anglicans were not in the majority, not even in the colonies where the Church of England was the established church, and they probably did not comprise even 30 percent of the population .        President ": null
    },
    {
        "John Witherspoon": "John Witherspoon"
    },
    {
        " of the College of New Jersey  wrote widely circulated sermons linking the American Revolution to the teachings of the Bible. Throughout the colonies, dissenting Protestant ministers preached Revolutionary themes in their sermons, while most Church of England clergymen preached loyalty to the king, the titular head of the English state church. William H. Nelson, The American Tory p. 186 Religious motivation for fighting tyranny transcended socioeconomic lines to encompass rich and poor, men and women, frontiersmen and townsmen, farmers and merchants. The Declaration of Independence also referred to the Laws of Nature and of Natures God as justification for the Americans separation from the British monarchy. Most eighteenth-century Americans believed that the entire universe was Gods creation Middlekauff , pp.  3–6 and he was Natures God . Everything was part of the universal order of things which began with God and was directed by his providence. Middlekauff , pp.  3–4 Accordingly, the signers of the Declaration professed their firm reliance on the Protection of divine Providence , and they appealed to the Supreme Judge for the rectitude of our intentions . Kidd , p. 141 ": null
    },
    {
        "George Washington": "George Washington"
    },
    {
        " was firmly convinced that he was an instrument of providence, to the benefit of the American people and of all humanity. Middlekauff , p. 302     Historian ": null
    },
    {
        "Bernard Bailyn": "Bernard Bailyn"
    },
    {
        " argues that the evangelicalism of the era challenged traditional notions of natural hierarchy by preaching that the Bible teaches that all men are equal, so that the true value of a man lies in his moral behavior, not in his class. Bailyn,The Ideological Origins of the American Revolution p. 303 Kidd argues that religious ": null
    },
    {
        "disestablishment": "Disestablishmentarianism"
    },
    {
        ", belief in God as the source of human rights, and shared convictions about sin, virtue, and divine providence worked together to unite rationalists and evangelicals and thus encouraged a large proportion of Americans to fight for independence from the Empire. Bailyn, on the other hand, denies that religion played such a critical role. Thomas S. Kidd, God of Liberty: A Religious History of the American Revolution Alan Heimert argues that ": null
    },
    {
        "New Light": "New Light"
    },
    {
        " anti-authoritarianism was essential to furthering democracy in colonial American society, and set the stage for a confrontation with British monarchical and aristocratic rule. Alan Heimert, Religion and the American Mind: From the Great Awakening to the Revolution. Cambridge: Harvard University Press, 1967.       John Adams concluded in 1818:          In the mid-20th century, historian ": null
    },
    {
        "Leonard Woods Labaree": "Leonard Woods Labaree"
    },
    {
        " identified eight characteristics of the Loyalists that made them essentially conservative, opposite to the characteristics of the Patriots. Labaree, Conservatism in Early American History pp. 164–65 Loyalists tended to feel that resistance to the Crown was morally wrong, while the Patriots thought that morality was on their side. Hull et al., Choosing Sides pp. 344–66 Burrows and Wallace, The American Revolution pp. 167–305 Loyalists were alienated when the Patriots resorted to violence, such as burning houses and ": null
    },
    {
        "tarring and feathering": "Tarring And Feathering"
    },
    {
        ". Loyalists wanted to take a centrist position and resisted the Patriots demand to declare their opposition to the Crown. Many Loyalists had maintained strong and long-standing relations with Britain, especially merchants in port cities such as New York and Boston. Many Loyalists felt that independence was bound to come eventually, but they were fearful that revolution might lead to anarchy, tyranny, or mob rule. In contrast, the prevailing attitude among Patriots was a desire to seize the initiative. Labaree also wrote that Loyalists were pessimists who lacked the confidence in the future displayed by the Patriots.     Historians in the early 20th century such as ": null
    },
    {
        "J. Franklin Jameson": "J. Franklin Jameson"
    },
    {
        " examined the class composition of the Patriot cause, looking for evidence of a class war inside the revolution. J. Franklin Jameson, The American Revolution Considered as a Social Movement ; other historians pursuing the same line of thought included ": null
    },
    {
        "Charles A. Beard": "Charles A. Beard"
    },
    {
        ", ": null
    },
    {
        "Carl Becker": "Carl L. Becker"
    },
    {
        ", and ": null
    },
    {
        "Arthur Schlesinger, Sr.": "Arthur Schlesinger, Sr."
    },
    {
        ". More recent historians have largely abandoned that interpretation, emphasizing instead the high level of ideological unity. Wood, Rhetoric and Reality in the American Revolution pp. 3–32 Both Loyalists and Patriots were a mixed lot , Nash Resch but ideological demands always came first. The Patriots viewed independence as a means to gain freedom from British oppression and taxation and to reassert their basic rights. Most yeomen farmers, craftsmen, and small merchants joined the Patriot cause to demand more political equality. They were especially successful in Pennsylvania but less so in New England, where John Adams attacked Thomas Paines Common Sense for the absurd democratical notions that it proposed.          The war became a personal issue for ": null
    },
    {
        "the king": "George Iii Of The United Kingdom"
    },
    {
        ", fueled by his growing belief that British leniency would be taken as weakness by the Americans. He also sincerely believed that he was defending Britains constitution against usurpers, rather than opposing patriots fighting for their natural rights. Andrew Jackson OShaughnessy, If Others Will Not Be Active, I must Drive: George III and the American Revolution. Early American Studies 2004 2: pp. 1–46. P. D. G. Thomas, George III and the American Revolution. History 1985 70             Those who fought for independence were called Patriots , Whigs , Congress-men , or Americans during and after the war. They included a full range of social and economic classes but were unanimous regarding the need to defend the rights of Americans and uphold the principles of ": null
    },
    {
        "republicanism": "Republicanism In The United States"
    },
    {
        " in terms of rejecting monarchy and aristocracy, while emphasizing civic virtue on the part of the citizens. Newspapers were strongholds of patriotism and printed many pamphlets, announcements, patriotic letters, and pronouncements. Carol Sue Humphrey, The American Revolution and the Press: The Promise of Independence     According to historian Robert Calhoon, 40– to 45-percent of the white population in the Thirteen Colonies supported the Patriots cause, 15– to 20-percent supported the Loyalists, and the remainder were neutral or kept a low profile. Robert M. Calhoon, Loyalism and neutrality in  Mark Lender analyzes why ordinary people became insurgents against the British, even if they were unfamiliar with the ideological reasons behind the war. He concludes that such people held a sense of rights which the British were violating, rights that stressed local autonomy, fair dealing, and government by consent. They were highly sensitive to the issue of tyranny, which they saw manifested in the British response to the Boston Tea Party. The arrival in Boston of the British Army heightened their sense of violated rights, leading to rage and demands for revenge. They had faith that God was on their side. Mark Edward Lender, review of American Insurgents, American Patriots: The Revolution of the People by T. H. Breen, in The Journal of Military History 761 pp. 233–34 The signers of the Declaration of Independence were mostly well-educated, of British stock, and of the Protestant faith. ": null
    },
    {
        "Caroline Robbins": "Caroline Robbins"
    },
    {
        ", Decision in 76: Reflections on the 56 Signers. Proceedings of the Massachusetts Historical Society. Vol. 89 pp. 72–87, quote at p. 86. See also Richard D. Brown, The Founding Fathers of 1776 and 1787: A collective view. William and Mary Quarterly 333: 465–80.              The consensus of scholars is that about 15– to 20-percent of the white population remained loyal to the British Crown. Calhoon, Loyalism and neutrality in Greene and Pole, eds. A Companion to the American Revolution at  Those who actively supported the king were known at the time as Loyalists , Tories , or Kings men . The Loyalists never controlled territory unless the British Army occupied it. They were typically older, less willing to break with old loyalties, and often connected to the Church of England; they included many established merchants with strong business connections throughout the Empire, as well as royal officials such as Thomas Hutchinson of Boston. Calhoon, Loyalism and neutrality in Greene and Pole, eds. A Companion to the American Revolution pp. 235–47, There were 500 to 1,000 ": null
    },
    {
        "black loyalists": "Black Loyalist"
    },
    {
        ", slaves who escaped to British lines and joined the British army. Most died of disease, but Britain took the survivors to Canada as free men.     The revolution could divide families, such as ": null
    },
    {
        "William Franklin": "William Franklin"
    },
    {
        ", son of Benjamin Franklin and royal governor of the ": null
    },
    {
        "Province of New Jersey": "Province Of New Jersey"
    },
    {
        " who remained loyal to the Crown throughout the war. He and his father never spoke again. Sheila L. Skemp, Benjamin and William Franklin: Father and Son, Patriot and Loyalist Recent immigrants who had not been fully Americanized were also inclined to support the King, such as ": null
    },
    {
        "Flora MacDonald": "Flora Macdonald"
    },
    {
        " who was a Scottish settler in the back country.      After the war, the great majority of the approximately 500,000 Loyalists remained in America and resumed normal lives. Some became prominent American leaders, such as ": null
    },
    {
        "Samuel Seabury": "Samuel Seabury"
    },
    {
        ". Approximately 46,000 Loyalists relocated to Canada; others moved to Britain , Florida, or the West Indies . The exiles represented approximately two percent of the total population of the colonies. Greene and Pole chapters 20–22 Nearly all black loyalists left for Nova Scotia, Florida, or England, where they could remain free.  Loyalists who left the South in 1783 took thousands of their slaves with them to be slaves in the British West Indies.       A minority of uncertain size tried to stay neutral in the war. Most kept a low profile, but the Quakers were the most important group to speak out for neutrality, especially in Pennsylvania. The Quakers continued to do business with the British even after the war began, and they were accused of being supporters of British rule, contrivers and authors of seditious publications critical of the revolutionary cause. Gottlieb The majority of Quakers attempted to remain neutral, although ": null
    },
    {
        "a sizeable number": "Quakers In The American Revolution"
    },
    {
        " nevertheless participated to some degree.               Women contributed to the American Revolution in many ways and were involved on both sides. Formal politics did not include women, but ordinary domestic behaviors became charged with political significance as Patriot women confronted a war which permeated all aspects of political, civil, and domestic life. They participated by boycotting British goods, spying on the British, following armies as they marched, washing, cooking, and tending for soldiers, delivering secret messages, and even fighting disguised as men in a few cases, such as ": null
    },
    {
        "Deborah Samson": "Deborah Samson"
    },
    {
        ". ": null
    },
    {
        "Mercy Otis Warren": "Mercy Otis Warren"
    },
    {
        " held meetings in her house and cleverly attacked Loyalists with her creative plays and histories.  Above all, women continued the agricultural work at home to feed their families and the armies. They maintained their families during their husbands absences and sometimes after their deaths. Berkin, Revolutionary Mothers pp.  59–60     American women were integral to the success of the boycott of British goods, Greene and Pole chapter 41 as the boycotted items were largely household items such as tea and cloth. Women had to return to knitting goods, and to spinning and weaving their own cloth—skills that had fallen into disuse. In 1769, the women of Boston produced 40,000 skeins of yarn, and 180 women in ": null
    },
    {
        "Middletown, Massachusetts": "Middleton, Massachusetts"
    },
    {
        " wove  of cloth. A womans loyalty to her husband could become an open political act, especially for women in America committed to men who remained loyal to the King. Legal divorce, usually rare, was granted to Patriot women whose husbands supported the King. Kerber, Women of the Republic chapters 4 and 6 Mary Beth Norton, Libertys Daughters: The Revolutionary Experience of American Women                    In early 1776, France set up a major program of aid to the Americans, and the Spanish secretly added funds. Each country spent one million livres tournaises to buy munitions. A dummy corporation run by ": null
    },
    {
        "Pierre Beaumarchais": "Pierre Beaumarchais"
    },
    {
        " concealed their activities. American Patriots obtained some munitions through the Dutch Republic, as well as French and Spanish ports in the ": null
    },
    {
        "West Indies": "West Indies"
    },
    {
        ". Jonathan Dull, A Diplomatic History of the American Revolution pp. 57–65     Spain did not officially recognize the U.S. but it separately declared war on Britain on June 21, 1779. ": null
    },
    {
        "Bernardo de Gálvez y Madrid": "Bernardo De Gálvez Y Madrid"
    },
    {
        ", general of the Spanish forces in ": null
    },
    {
        "New Spain": "New Spain"
    },
    {
        ", also served as governor of Louisiana. He led an expedition of colonial troops to force the British out of Florida and to keep open a vital conduit for supplies. Thompson, Buchanan Parker, Spain: Forgotten Ally of the American Revolution North Quincy, Mass.: Christopher Publishing House, 1976.             Most American Indians rejected pleas that they remain neutral and instead supported the British Crown. The great majority of the 200,000 Indians east of the Mississippi distrusted the Colonists and supported the British cause, hoping to forestall continued colonial expansion into their territories. Greene and Pole chapters 19, 46 and 51; Colin G. Calloway, The American Revolution in Indian Country: Crisis and Diversity in Native American Communities Those tribes that were more closely involved in trade tended to side with the Patriots, although political factors were important, as well.     Most Indians did not participate directly in the war, except for warriors and bands associated with four of the ": null
    },
    {
        "Iroquois": "Iroquois"
    },
    {
        " tribes in New York and Pennsylvania which allied with the British. The British did have other allies, especially in the upper Midwest. They provided Indians with funding and weapons to attack American outposts. Some Indians tried to remain neutral, seeing little value in joining what they perceived to be a European conflict, and fearing reprisals from whichever side they opposed. The ": null
    },
    {
        "Oneida": "Oneida Tribe"
    },
    {
        " and ": null
    },
    {
        "Tuscarora": "Tuscarora People"
    },
    {
        " tribes among the Iroquois of central and western New York supported the American cause. Joseph T. Glatthaar and James Kirby Martin, Forgotten Allies: The Oneida Indians and the American Revolution The British provided arms to Indians who were led by Loyalists in war parties to raid frontier settlements from the ": null
    },
    {
        "Carolinas": "Province Of Carolina"
    },
    {
        " to New York. They killed many settlers on the frontier, especially in Pennsylvania and New Yorks Mohawk Valley. Karim M. Tiro, A Civil War? Rethinking Iroquois Participation in the American Revolution. Explorations in Early American Culture 4 : 148-165.     In 1776, ": null
    },
    {
        "Cherokee": "Cherokee"
    },
    {
        " war parties attacked American Colonists all along the southern frontier of the uplands throughout the ": null
    },
    {
        "Washington District, North Carolina": "Washington District, North Carolina"
    },
    {
        " and the Kentucky wilderness area. Tom Hatley, The Dividing Paths: Cherokees and South Carolinians through the Era of Revolution ; James H. ODonnell, III, Southern Indians in the American Revolution They would launch raids with roughly 200 warriors, as seen in the ": null
    },
    {
        "Cherokee–American wars": "Cherokee–American Wars"
    },
    {
        "; they could not mobilize enough forces to invade Colonial areas without the help of allies, most often the ": null
    },
    {
        "Creek": "Muscogee"
    },
    {
        ". The ": null
    },
    {
        "Chickamauga Cherokee": "Chickamauga Cherokee"
    },
    {
        " under ": null
    },
    {
        "Dragging Canoe": "Dragging Canoe"
    },
    {
        " allied themselves closely with the British, and fought on for an additional decade after the Treaty of Paris was signed. ": null
    },
    {
        "Joseph Brant": "Joseph Brant"
    },
    {
        " of the powerful ": null
    },
    {
        "Mohawk": "Mohawk Nation"
    },
    {
        " tribe in New York was the most prominent Indian leader against the Patriot forces. In 1778 and 1780, he led 300 Iroquois warriors and 100 white Loyalists in multiple attacks on small frontier settlements in New York and Pennsylvania, killing many settlers and destroying villages, crops, and stores.  The Seneca, Onondaga, and Cayuga of the Iroquois Confederacy also allied with the British against the Americans. Colin G. Calloway, The American Revolution in Indian Country: Crisis and Diversity in Native American Communities     In 1779, the Americans forced the hostile Indians out of upstate New York when Washington sent an army under ": null
    },
    {
        "John Sullivan": "John Sullivan"
    },
    {
        " which destroyed 40 empty Iroquois villages in central and western New York. The ": null
    },
    {
        "Battle of Newtown": "Battle Of Newtown"
    },
    {
        " proved decisive, as the Patriots had an advantage of three-to-one, and it ended significant resistance; there was little combat otherwise. Sullivan systematically burned the empty villages and destroyed about 160,000 bushels of corn that composed the winter food supply. Facing starvation and homeless for the winter, the Iroquois fled to Canada. The British resettled them in Ontario, providing land grants as compensation for some of their losses. Joseph R. Fischer, A Well-Executed Failure: The Sullivan Campaign against the Iroquois, July–September 1779 .     At the peace conference following the war, the British ceded lands which they did not really control, and they did not consult their Indian allies. They transferred control to the United States of all the land east of the Mississippi and north of Florida. Calloway concludes:          The British did not give up their forts until 1796 in the eastern Midwest, stretching from Ohio to Wisconsin; they kept alive the dream of forming a satellite Indian nation there, which they called a Neutral Indian Zone. That goal was one of the causes of the ": null
    },
    {
        "War of 1812": "War Of 1812"
    },
    {
        ".  Francis M. Carroll,  p. 23             Free blacks in the North and South fought on both sides of the Revolution, but most fought for the Patriots. Gary Nash reports that there were about 9,000 black Patriots, counting the Continental Army and Navy, state militia units, privateers, wagoneers in the Army, servants to officers, and spies. Gary B. Nash, The African Americans Revolution, in Oxford Handbook of the American Revolution edited by Edward G Gray and Jane Kamensky pp. 250–70, at p. 254 Ray Raphael notes that thousands did join the Loyalist cause, but a far larger number, free as well as slave, tried to further their interests by siding with the patriots. Ray Raphael, A Peoples History of the American Revolution p. 281 ": null
    },
    {
        "Crispus Attucks": "Crispus Attucks"
    },
    {
        " was shot dead by British soldiers in the ": null
    },
    {
        "Boston Massacre": "Boston Massacre"
    },
    {
        " in 1770 and is considered the first American casualty of the Revolutionary War.     Many black slaves sided with the Loyalists. Tens of thousands in the South used the turmoil of war to escape, and the southern plantation economies of South Carolina and Georgia were disrupted in particular. During the Revolution, the British tried to turn slavery against the Americans. , Library of Congress Historian ": null
    },
    {
        "David Brion Davis": "David Brion Davis"
    },
    {
        " explains the difficulties with a policy of wholesale arming of the slaves:          Davis underscores the British dilemma: Britain, when confronted by the rebellious American colonists, hoped to exploit their fear of slave revolts while also reassuring the large number of slave-holding Loyalists and wealthy Caribbean planters and merchants that their slave property would be secure . Davis p. 149 The Colonists, however, accused the British of encouraging slave revolts. Schama pp. 28–30, 78–90     American advocates of independence were commonly lampooned in Great Britain for what was termed their hypocritical calls for freedom, at the same time that many of their leaders were planters who held hundreds of slaves. ": null
    },
    {
        "Samuel Johnson": "Samuel Johnson"
    },
    {
        " snapped, how is it we hear the loudest yelps for liberty among the drivers of the Negroes? Stanley Weintraub, Iron Tears: Americas Battle for Freedom, Britains Quagmire, 1775–1783 p. 7 Benjamin Franklin countered by criticizing the British self-congratulation about the freeing of one Negro named ": null
    },
    {
        "Somersett": "Somersetts Case"
    },
    {
        " while they continued to permit the overall slave trade. Schama, p. 75 ": null
    },
    {
        "Phyllis Wheatley": "Phyllis Wheatley"
    },
    {
        " was a black poet who popularized the image of ": null
    },
    {
        "Columbia": "Columbia"
    },
    {
        " to represent America. She came to public attention when her Poems on Various Subjects, Religious and Moral appeared in 1773. Hochschild pp.  50–51     The effects of the war were more dramatic in the South. In Virginia, royal governor Lord ": null
    },
    {
        "Dunmore": "John Murray, 4Th Earl Of Dunmore"
    },
    {
        " recruited black men into the British forces with the promise of freedom, protection for their families, and land grants. Tens of thousands of slaves escaped to British lines throughout the South, causing dramatic losses to slaveholders and disrupting cultivation and harvesting of crops. For instance, ": null
    },
    {
        "South Carolina": "South Carolina"
    },
    {
        " was estimated to have lost about 25,000 slaves to flight, migration, or death—amounting to one third of its slave population. From 1770 to 1790, the black proportion of the population in South Carolina dropped from 60.5 percent to 43.8 percent, and from 45.2 percent to 36.1 percent in Georgia. Peter Kolchin, American Slavery: 1619–1877, New York: Hill and Wang, 1993, p. 73     British forces gave transportation to 10,000 slaves when they evacuated ": null
    },
    {
        "Savannah": "Savannah, Georgia"
    },
    {
        " and ": null
    },
    {
        "Charleston": "Charleston, South Carolina"
    },
    {
        ", carrying through on their promise. Kolchin, American Slavery, p. 73 They evacuated and resettled more than 3,000 ": null
    },
    {
        "Black Loyalists": "Black Loyalist"
    },
    {
        "from New York to Nova Scotia, Upper Canada, and Lower Canada. Others sailed with the British to England or were resettled as freedmen in the West Indies of the Caribbean. But slaves who were carried to the Caribbean under control of Loyalist masters generally remained slaves until British abolition in its colonies in 1834. More than 1,200 of the Black Loyalists of Nova Scotia later resettled in the British colony of Sierra Leone, where they became leaders of the ": null
    },
    {
        "Krio": "Sierra Leone Creole People"
    },
    {
        " ethnic group of Freetown and the later national government. Many of their descendants still live in Sierra Leone, as well as other African countries. Hill , see also            Tens of thousands of Loyalists left the United States; Maya Jasanoff estimates 70,000. Maya Jasanoff, Libertys Exiles: American Loyalists in the Revolutionary World . However Philip Ranlet estimates that only 20,000 adult white Loyalists went to Canada. How Many American Loyalists Left the United States?. Historian 76.2 : 278–307. Some migrated to Britain. The great majority received land and subsidies for resettlement in British colonies in North America, known as ": null
    },
    {
        "United Empire Loyalists": "United Empire Loyalists"
    },
    {
        ", especially ": null
    },
    {
        "Quebec": "Province Of Quebec"
    },
    {
        " , ": null
    },
    {
        "Prince Edward Island": "Prince Edward Island"
    },
    {
        ", and ": null
    },
    {
        "Nova Scotia": "Nova Scotia"
    },
    {
        ". W. Stewart Wallace, The United Empire Loyalists: A Chronicle of the Great Migration   Britain created the colonies of Upper Canada  and ": null
    },
    {
        "New Brunswick": "New Brunswick"
    },
    {
        " expressly for their benefit, and the Crown awarded land to Loyalists as compensation for losses in the United States. Britain wanted to develop the frontier of Upper Canada on a British colonial model. But about 85% of the Loyalists stayed in the United States and became full, loyal citizens; some of the exiles later returned to the U.S. Van Tine, American Loyalists p. 307       Interpretations vary concerning the effect of the Revolution. Historians such as ": null
    },
    {
        "Bernard Bailyn": "Bernard Bailyn"
    },
    {
        ", ": null
    },
    {
        "Gordon Wood": "Gordon S. Wood"
    },
    {
        ", and ": null
    },
    {
        "Edmund Morgan": "Edmund Morgan"
    },
    {
        " view it as a unique and radical event which produced deep changes and had a profound effect on world affairs, such as an increasing belief in the principles of the Enlightenment. These were demonstrated by a leadership and government that espoused protection of natural rights, and a system of laws chosen by the people. Wood, The American Revolution: A History John Murrin, by contrast, argues that the definition of the people at that time was mostly restricted to free men who were able to pass a property-qualification.   This view argues that any significant gain of the revolution was irrelevant in the short term to women, black Americans and slaves, poor white men, youth, and American Indians.  McCool, Daniel, Susan M. Olson, and Jennifer L. Robinson. Native Vote, Cambridge, England: Cambridge University Press, 2007.     Gordon Wood states:   :The American Revolution was integral to the changes occurring in American society, politics and culture…. These changes were radical, and they were extensive…. The Revolution not only radically changed the personal and social relationships of people, including the position of women, but also destroyed aristocracy as itd been understood in the Western world for at least two millennia. Gordon Wood, The Radicalism of the American Revolution pp 7-8.     Edmund Morgan has argued that, in terms of long-term impact on American society and values:   :The Revolution did revolutionize social relations. It did displace the deference, the patronage, the social divisions that had determined the way people viewed one another for centuries and still view one another in much of the world. It did give to ordinary people a pride and power, not to say an arrogance, that have continued to shock visitors from less favored lands. It may have left standing a host of inequalities that have troubled us ever since. But it generated the egalitarian view of human society that makes them troubling and makes our world so different from the one in which the revolutionists had grown up.           After the Revolution, genuinely democratic politics became possible in the former colonies. Gordon Wood, The Radicalism of the American Revolution pp. 278–79 The rights of the people were incorporated into state constitutions. Concepts of liberty, individual rights, equality among men and hostility toward corruption became incorporated as core values of liberal republicanism. The greatest challenge to the old order in Europe was the challenge to inherited political power and the democratic idea that government rests on the ": null
    },
    {
        "consent of the governed": "Consent Of The Governed"
    },
    {
        ". The example of the first successful revolution against a European empire, and the first successful establishment of a republican form of democratically elected government, provided a model for many other colonial peoples who realized that they too could break away and become self-governing nations with directly elected representative government. Palmer,        The Dutch Republic, also at war with Britain, was the next country to sign a treaty with the United States, on October 8, 1782. On April 3, 1783, Ambassador Extraordinary ": null
    },
    {
        "Gustaf Philip Creutz": "Gustaf Philip Creutz"
    },
    {
        ", representing King ": null
    },
    {
        "Gustav III of Sweden": "Gustav Iii Of Sweden"
    },
    {
        ", and Benjamin Franklin, signed a ": null
    },
    {
        "Treaty of Amity and Commerce": "Treaty Of Amity And Commerce"
    },
    {
        " with the U.S.     The American Revolution was the first wave of the ": null
    },
    {
        "Atlantic Revolutions": "Atlantic Revolutions"
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        ", the ": null
    },
    {
        "Haitian Revolution": "Haitian Revolution"
    },
    {
        ", and the ": null
    },
    {
        "Latin American wars of independence": "Latin American Wars Of Independence"
    },
    {
        ". Aftershocks reached Ireland in the ": null
    },
    {
        "Irish Rebellion of 1798": "Irish Rebellion Of 1798"
    },
    {
        ", in the ": null
    },
    {
        "Polish–Lithuanian Commonwealth": "Polish–Lithuanian Commonwealth"
    },
    {
        ", and in the Netherlands. Greene and Pole ch. 53–55 Wim Klooster, Revolutions in the Atlantic World: A Comparative History     The Revolution had a strong, immediate influence in Great Britain, Ireland, the Netherlands, and France. Many British and Irish ": null
    },
    {
        "Whigs": "British Whig Party"
    },
    {
        " spoke in favor of the American cause. In Ireland, there was a profound impact; the ": null
    },
    {
        "Protestants who controlled Ireland": "Protestant Ascendancy"
    },
    {
        " were demanding more and more self-rule. Under the leadership of ": null
    },
    {
        "Henry Grattan": "Henry Grattan"
    },
    {
        ", the so-called ": null
    },
    {
        "Patriots": "Irish Patriot Partygrattans Patriots"
    },
    {
        " forced the reversal of mercantilist prohibitions against trade with other British colonies. The King and his cabinet in London could not risk another rebellion on the American model, and made a series of concessions to the Patriot faction in Dublin. Armed Protestant volunteer units were set up to protect against an invasion from France. As in America, so too in Ireland the King no longer had a monopoly of lethal force. R. B. McDowell, Ireland in the Age of Imperialism and Revolution, 1760–1801     The Revolution, along with the ": null
    },
    {
        "Dutch Revolt": "Dutch Revolt"
    },
    {
        " and the 17th century ": null
    },
    {
        "English Civil War": "English Civil War"
    },
    {
        ", was among the examples of overthrowing an old regime for many Europeans who later were active during the era of the French Revolution, such as the ": null
    },
    {
        "Marquis de Lafayette": "Gilbert Du Motier, Marquis De Lafayette"
    },
    {
        ". The American Declaration of Independence influenced the French ": null
    },
    {
        "Declaration of the Rights of Man and the Citizen": "Declaration Of The Rights Of Man And The Citizen"
    },
    {
        " of 1789. Palmer, ; Greene and Pole chapters 49–52 Center for History and New Media, Liberty, equality, fraternity The spirit of the Declaration of Independence led to laws ending slavery in all the Northern states and the Northwest Territory, with New Jersey the last in 1804. States such as New Jersey and New York adopted gradual emancipation, which kept some people as slaves for more than two decades longer. Greene and Pole pp. 409, 453–54       The democratic ideals of the Revolution inspired changes in the roles of women.      The concept of ": null
    },
    {
        "republican motherhood": "Republican Motherhood"
    },
    {
        " was inspired by this period and reflects the importance of ": null
    },
    {
        "Republicanism as the dominant American ideology": "Revolutionary Republicanism"
    },
    {
        ". It assumed that a successful republic rested upon the virtue of its citizens. Women were considered to have the essential role of instilling their children with values conducive to a healthy republic. During this period, the wifes relationship with her husband also became more liberal, as love and affection instead of obedience and subservience began to characterize the ideal marital relationship. In addition, many women contributed to the war effort through fundraising and running family businesses in the absence of husbands.     The traditional constraints gave way to more liberal conditions for women. Patriarchy faded as an ideal; young people had more freedom to choose their spouses and more often used birth control to regulate the size of their families. Society emphasized the role of mothers in child rearing, especially the patriotic goal of raising republican children rather than those locked into aristocratic value systems. There was more permissiveness in child-rearing. Patriot women married to Loyalists who left the state could get a divorce and obtain control of the ex-husbands property. Mary Beth Norton, Libertys Daughters: The Revolutionary Experience of American Women, 1750–1800   Whatever gains they had made, however, women still found themselves subordinated, legally and socially, to their husbands, disfranchised and usually with only the role of mother open to them. But, some women earned livelihoods as midwives and in other roles in the community, which were not originally recognized as significant by men.     ": null
    },
    {
        "Abigail Adams": "Abigail Adams"
    },
    {
        " expressed to her husband, the president, the desire of women to have a place in the new republic: I desire you would remember the Ladies, and be more generous and favourable to them than your ancestors. Do not put such unlimited power into the hands of the Husbands.      The Revolution sparked a discussion on the rights of woman and an environment favorable to womens participation in politics. Briefly the possibilities for womens rights were highly favorable, but a backlash led to a greater rigidity that excluded women from politics. ": null
    },
    {
        "Rosemarie Zagarri": "Rosemarie Zagarri"
    },
    {
        ", Revolutionary Backlash: Women and Politics in the Early American Republic , p. 8     For more than thirty years, however, the 1776 ": null
    },
    {
        "New Jersey State Constitution": "New Jersey State Constitution"
    },
    {
        " gave the vote to all inhabitants who had a certain level of wealth, including unmarried women and blacks , until in 1807, when that state legislature passed a bill interpreting the constitution to mean universal white male ": null
    },
    {
        "suffrage": "Suffrage"
    },
    {
        ", excluding paupers. Klinghoffer and Elkis        In the first two decades after the American Revolution, state legislatures and individuals took actions to free numerous slaves, in part based on revolutionary ideals. Northern states passed new constitutions that contained language about equal rights or specifically abolished slavery; some states, such as New York and New Jersey, where slavery was more widespread, passed laws by the end of the 18th century to abolish slavery by a gradual method; in New York, the last slaves were freed in 1827.     While no southern state abolished slavery, for a period individual owners could free their slaves by personal decision, often providing for manumission in wills but sometimes filing deeds or court papers to free individuals. Numerous slaveholders who freed their slaves cited revolutionary ideals in their documents; others freed slaves as a reward for service. Records also suggest that some slaveholders were freeing their own ": null
    },
    {
        "mixed-race": "Mixed-Race"
    },
    {
        " children, born into slavery to slave mothers.             The American Revolution has a central place in the American memory Michael Kammen, A Season of Youth: The American Revolution and the Historical Imagination ; Kammen, Mystic Chords of Memory: The Transformation of Tradition in American Culture as the story of the nations founding. It is covered in the schools, memorialized by a ": null
    },
    {
        "national holiday": "Independence Day"
    },
    {
        ", and commemorated in innumerable monuments. George Washingtons estate at ": null
    },
    {
        "Mount Vernon": "Mount Vernon"
    },
    {
        " was one of the first national pilgrimages for tourists and attracted 10,000 visitors a year by the 1850s.      The Revolution became a matter of contention in the 1850s in the debates leading to the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        " , as spokesmen of both the ": null
    },
    {
        "Northern United States": "Northern United States"
    },
    {
        " and the ": null
    },
    {
        "Southern United States": "Southern United States"
    },
    {
        " claimed that their region was the true custodian of the legacy of 1776. Jonathan B. Crider, De Bows Revolution: The Memory of the American Revolution in the Politics of the Sectional Crisis, 1850–1861, American Nineteenth Century History 103 pp. 317–32 The ": null
    },
    {
        "United States Bicentennial": "United States Bicentennial"
    },
    {
        " in 1976 came a year after the American withdrawal from the ": null
    },
    {
        "Vietnam War": "Vietnam War"
    },
    {
        ", and speakers stressed the themes of renewal and rebirth based on a restoration of traditional values. David Ryan, Re-enacting Independence through Nostalgia – The 1976 US Bicentennial after the Vietnam War, Forum for Inter-American Research 53 pp. 26–48.     Today, more than 100 ": null
    },
    {
        "battlefields and historic sites of the American Revolution": ":Category:American Revolutionary War Sites"
    },
    {
        " are protected and maintained by the government. The ": null
    },
    {
        "National Park Service": "National Park Service"
    },
    {
        " alone owns and maintains more than 50 battlefield parks and sites related to the Revolution.  Accessed Jan. 4, 2018. The ": null
    },
    {
        "American Battlefield Trust": "American Battlefield Trust"
    },
    {
        " preserves almost 700 acres of battlefield land in six states.  ": null
    },
    {
        "American Battlefield Trust": "American Battlefield Trust"
    },
    {
        " Saved Land webpage. Accessed May 30, 2018.  Princeton, N.J. Town Topics, Nov. 12, 2014, Princeton Battlefield Focus of National Campaign. Accessed May 30, 2018.   ": null
    }
]