[
    {
        "   In ": null
    },
    {
        "Major League Baseball": "Major League Baseball"
    },
    {
        ", the American League Division Series  determines which two teams from the ": null
    },
    {
        "American League": "American League"
    },
    {
        " will advance to the ": null
    },
    {
        "American League Championship Series": "American League Championship Series"
    },
    {
        ". The Division Series consists of two best-of-five series, featuring the three division winners and the winner of the ": null
    },
    {
        "wild-card": "Wild Card"
    },
    {
        " play-off.          The Division Series was implemented in 1981 as a one-off tournament because of a ": null
    },
    {
        "midseason strike": "1981 Major League Baseball Strike"
    },
    {
        ", with the first place teams before the strike taking on the teams in first place after the strike. In 1994, it was returned permanently when ": null
    },
    {
        "Major League Baseball": "Major League Baseball"
    },
    {
        " restructured each league into three divisions, but with a different format than in 1981. In 1981, a split-season format forced the first ever divisional playoff series, in which the ": null
    },
    {
        "New York Yankees": "1981 New York Yankees Season"
    },
    {
        " won the Eastern Division series over the ": null
    },
    {
        "Milwaukee Brewers": "1981 Milwaukee Brewers Season"
    },
    {
        " in five games while in the Western Division, the ": null
    },
    {
        "Oakland Athletics": "1981 Oakland Athletics Season"
    },
    {
        " swept the ": null
    },
    {
        "Kansas City Royals": "1981 Kansas City Royals Season"
    },
    {
        " . Including the 2018 postseason, the Yankees have played in the most division series, with twenty appearances. In 2015, the ": null
    },
    {
        "Toronto Blue Jays": "Toronto Blue Jays"
    },
    {
        " and ": null
    },
    {
        "Houston Astros": "Houston Astros"
    },
    {
        " were the final American League teams to make their first appearances in the ALDS. The Astros had been in the National League through 2012, and had played in the ": null
    },
    {
        "National League Division Series": "National League Division Series"
    },
    {
        " seven times.       From 1998 to 2011, the ": null
    },
    {
        "wild card": "Major League Baseball Wild Card"
    },
    {
        " team was assigned to play the division winner with the best winning percentage in one series, and the other two division winners met in the other series. However, if the wild-card team and the division winner with the best record were from the same division, the wild-card team played the division winner with the second-best record, and the remaining two division leaders played each other.     Beginning with the 2012 season, the wild card team that advances to the Division Series was to face the number 1 seed, regardless of whether or not they are in the same division. The two series winners move on to the best-of-seven ALCS. Home field advantage goes to the team with the better regular season record , except for the wild card team, which never receives the home field advantage.     Beginning in 2003, MLB has implemented a new rule to give the team from the league that wins the All-Star Game with the best regular season record a slightly greater advantage. In order to spread out the Division Series games for broadcast purposes, the two ALDS series follow one of two off-day schedules. Starting in 2007, after consulting the ": null
    },
    {
        "MLBPA": "Mlbpa"
    },
    {
        ", MLB has decided to allow the team with the best record in the league that wins the All-Star Game to choose whether to use the seven-day schedule or the eight-day schedule . The team only gets to choose the schedule; the opponent is still determined by win-loss records.     Initially, the best-of-5 series played in a 2-3 format, with the first two games set at home for the lower seed team and the last three for the higher seed. , Baseball-Reference.com , Baseball-Reference.com Since 1998, the series has followed a 2-2-1 format,  where the higher seed team plays at home in Games 1 and 2, the lower seed plays at home in Game 3 and Game 4 , and if a Game 5 is needed, the teams return to the higher seeds field. When MLB added a second wild card team in 2012, the Division Series re-adopted the 2-3 format due to scheduling conflicts. It reverted to the 2-2-1 format in 2013.         Team names link to the season in which each team played                     Team is no longer in the American League       ": null
    }
]