[
    {
        "          The Amiga is a family of ": null
    },
    {
        "personal computers": "Personal Computer"
    },
    {
        "introduced by ": null
    },
    {
        "Commodore": "Commodore International"
    },
    {
        " in 1985. The original model was part of a wave of 16- and 32-bit computers that featured 256 KB or more of RAM, mouse-based GUIs, and significantly improved graphics and audio over 8-bit systems. This wave included the ": null
    },
    {
        "Atari ST": "Atari St"
    },
    {
        "  released the same year  Apples ": null
    },
    {
        "Macintosh": "Macintosh"
    },
    {
        ", and later the ": null
    },
    {
        "Apple IIGS": "Apple Iigs"
    },
    {
        ". Based on the ": null
    },
    {
        "Motorola 68000": "Motorola 68000 Series"
    },
    {
        " microprocessor": "Microprocessor"
    },
    {
        ", the Amiga differed from its contemporaries through the inclusion of custom hardware to accelerate graphics and sound, including ": null
    },
    {
        "sprites": "Sprite"
    },
    {
        " and a ": null
    },
    {
        "blitter": "Blitter"
    },
    {
        ", and a ": null
    },
    {
        "pre-emptive multitasking": "Pre-Emptive Multitasking"
    },
    {
        " operating system called ": null
    },
    {
        "AmigaOS": "Amigaos"
    },
    {
        ".     The ": null
    },
    {
        "Amiga 1000": "Amiga 1000"
    },
    {
        " was released in July 1985, but a series of production problems kept it from becoming widely available until early 1986. The best selling model, the ": null
    },
    {
        "Amiga 500": "Amiga 500"
    },
    {
        ", was introduced in 1987 and became one of the leading home computers of the late 1980s and early 1990s with four to six million sold. The ": null
    },
    {
        "A3000": "Amiga 3000"
    },
    {
        " was introduced in 1990, followed by the ": null
    },
    {
        "A500+": "Amiga 500 Plus"
    },
    {
        ", and the ": null
    },
    {
        "A600": "Amiga 600"
    },
    {
        " in March 1992. Finally, the ": null
    },
    {
        "A1200": "Amiga 1200"
    },
    {
        " and the ": null
    },
    {
        "A4000": "Amiga 4000"
    },
    {
        " were released in late 1992. The platform became particularly popular for gaming and ": null
    },
    {
        "programming demo": "Demo"
    },
    {
        "s. It also found a prominent role in the ": null
    },
    {
        "desktop video": "Desktop Video"
    },
    {
        ", ": null
    },
    {
        "video production": "Video Production"
    },
    {
        ", and ": null
    },
    {
        "show control": "Show Control"
    },
    {
        " business, leading to video editing systems such as the ": null
    },
    {
        "Video Toaster": "Video Toaster"
    },
    {
        ". The Amigas native ability to simultaneously play back multiple digital sound samples made it a popular platform for early ": null
    },
    {
        "tracker": "Music Tracker"
    },
    {
        " music software. The relatively powerful processor and ability to access several megabytes of memory enabled the development of 3D rendering packages, including ": null
    },
    {
        "LightWave 3D": "Lightwave 3D"
    },
    {
        ", ": null
    },
    {
        "Imagine": "Imagine"
    },
    {
        ", ": null
    },
    {
        "Aladdin4D": "Aladdin4D"
    },
    {
        ", ": null
    },
    {
        "TurboSilver": "Turbosilver"
    },
    {
        " and Traces, a predecessor to ": null
    },
    {
        "Blender": "Blender"
    },
    {
        ".     Although early Commodore advertisements attempt to cast the computer as an all-purpose business machine, especially when outfitted with the ": null
    },
    {
        "Amiga Sidecar": "Amiga Sidecar"
    },
    {
        " PC compatibility add-on, the Amiga was most commercially successful as a home computer, with a wide range of games and creative software. Poor marketing and the failure of the later models to repeat the technological advances of the first systems meant that the Amiga quickly lost its market share to competing platforms, such as the ": null
    },
    {
        "fourth generation game consoles": "Fourth Generation Of Video Game Consoles"
    },
    {
        ", Macintosh, and the rapidly dropping prices of ": null
    },
    {
        "IBM PC compatible": "Ibm Pc Compatible"
    },
    {
        "s, which gained 256-color VGA graphics in 1987. Commodore ultimately went bankrupt in April 1994 after a version of the Amiga packaged as a game console, the ": null
    },
    {
        "Amiga CD32": "Amiga Cd32"
    },
    {
        ", failed in the marketplace.     Since the demise of Commodore, various groups have marketed successors to the original Amiga line, including ": null
    },
    {
        "Genesi": "Genesi"
    },
    {
        ", ": null
    },
    {
        "Eyetech": "Eyetech"
    },
    {
        ", ": null
    },
    {
        "ACube Systems Srl": "Acube Systems Srl"
    },
    {
        " and A-EON Technology. Likewise, AmigaOS has influenced replacements, clones and compatible systems such as ": null
    },
    {
        "MorphOS": "Morphos"
    },
    {
        ", ": null
    },
    {
        "AmigaOS 4": "Amigaos 4"
    },
    {
        " and ": null
    },
    {
        "AROS": "Aros Research Operating System"
    },
    {
        ".                   ": null
    },
    {
        "Jay Miner": "Jay Miner"
    },
    {
        " joined ": null
    },
    {
        "Atari": "Atari"
    },
    {
        " in the 1970s to develop custom ": null
    },
    {
        "integrated circuit": "Integrated Circuit"
    },
    {
        "s, and led development of the ": null
    },
    {
        "Atari 2600s": "Atari 2600"
    },
    {
        " TIA": "Television Interface Adaptor"
    },
    {
        ".  Almost as soon as its development was complete, the team began developing a much more sophisticated set of chips, ": null
    },
    {
        "CTIA": "Ctia And Gtia"
    },
    {
        ", ": null
    },
    {
        "ANTIC": "Antic"
    },
    {
        " and ": null
    },
    {
        "POKEY": "Pokey"
    },
    {
        ", that formed the basis of the ": null
    },
    {
        "Atari 8-bit family": "Atari 8-Bit Family"
    },
    {
        ".      With the 8-bit lines launch in 1979, the team once again started looking at a next generation chipset. ": null
    },
    {
        "Nolan Bushnell": "Nolan Bushnell"
    },
    {
        " had sold the company to ": null
    },
    {
        "Warner Communications": "Warner Communications"
    },
    {
        " in 1978, and the new management was much more interested in the existing lines than development of new products that might cut into their sales. Miner wanted to start work with the new ": null
    },
    {
        "Motorola 68000": "Motorola 68000"
    },
    {
        ", but management was only interested in another ": null
    },
    {
        "6502": "Mos Technology 6502"
    },
    {
        " based system. Miner left the company, and, for a time, the industry.     In 1979, ": null
    },
    {
        "Larry Kaplan": "Larry Kaplan"
    },
    {
        " left Atari and founded ": null
    },
    {
        "Activision": "Activision"
    },
    {
        ". In 1982, Kaplan was approached by a number of investors who wanted to develop a new game platform. Kaplan hired Miner to run the hardware side of the newly formed company, Hi-Toro . The system was code-named Lorraine in keeping with Miners policy of giving systems female names, in this case the company presidents wife, Lorraine Morse. When Kaplan left the company late in 1982, Miner was promoted to head engineer and the company relaunched as Amiga Corporation. New York Times, 29 August 1984, p. D1     A breadboard prototype was largely completed by late 1983, and shown at the January 1984 ": null
    },
    {
        "Consumer Electronics Show": "Consumer Electronics Show"
    },
    {
        " . At the time, the operating system was not ready, so the machine was demonstrated with the ": null
    },
    {
        "Boing Ball demo": "Demo The Bouncing Ball"
    },
    {
        ". A further developed version of the system was demonstrated at the June 1984 CES and shown to many companies in hopes of garnering further funding, but found little interest in a market that was in the final stages of the ": null
    },
    {
        "North American video game crash of 1983": "North American Video Game Crash Of 1983"
    },
    {
        ".     In March, Atari expressed a tepid interest in Lorraine for its potential use in a games console or home computer tentatively known as the 1850XLD. But the talks were progressing slowly, New York Times, 29 August 1984, p. D16 and Amiga was running out of money. A temporary arrangement in June led to a $500,000 loan from Atari to Amiga to keep the company going. The terms required the loan to be repaid at the end of the month, otherwise Amiga would forfeit the Lorraine design to Atari.       During 1983, Atari lost over $1 million a week, due to the combined effects of the crash and the ongoing price war in the home computer market. By the end of the year, Warner was desperate to sell the company. In January 1984, ": null
    },
    {
        "Jack Tramiel": "Jack Tramiel"
    },
    {
        " resigned from Commodore due to internal battles over the future direction of the company. A number of Commodore employees followed him to his new company, Tramel Technology. This included a number of the senior technical staff, where they began development of a 68000-based machine of their own. In June, Tramiel arranged a no-cash deal to take over Atari, reforming it as Atari Corporation.     As many Commodore technical staff had moved to Atari, Commodore was left with no workable path to design their own next-generation computer. The company approached Amiga offering to fund development as a home computer system. They quickly arranged to repay the Atari loan, ending that threat. The two companies were initially arranging a $4 million license agreement before Commodore offered $24 million to purchase Amiga outright.      By late 1984 the prototype breadboard chipset had successfully been turned into integrated circuits, and the system hardware was being readied for production. At this time the ": null
    },
    {
        "operating system": "Operating System"
    },
    {
        " was not as ready, and led to a deal to port an OS known as ": null
    },
    {
        "TRIPOS": "Tripos"
    },
    {
        " to the platform. TRIPOS was a ": null
    },
    {
        "multitasking": "Computer Multitasking"
    },
    {
        " system that had been written in ": null
    },
    {
        "BCPL": "Bcpl"
    },
    {
        " during the 1970s for ": null
    },
    {
        "minicomputer": "Minicomputer"
    },
    {
        " systems like the ": null
    },
    {
        "PDP-11": "Pdp-11"
    },
    {
        ", but later experimentally ported to the 68000. This early version was known as AmigaDOS and the GUI as Workbench. The BCPL parts were later rewritten in the ": null
    },
    {
        "C": "C"
    },
    {
        " language, and the entire system became AmigaOS.     The system was enclosed in a ": null
    },
    {
        "pizza box form factor": "Pizza Box Form Factor"
    },
    {
        " case; a late change was the introduction of vertical supports on either side of the case to provide a garage under the main section of the system where the keyboard could be stored.      The first model was announced in 1985 as simply The Amiga from Commodore , later to be retroactively dubbed the ": null
    },
    {
        "Amiga 1000": "Amiga 1000"
    },
    {
        ". They were first offered for sale in August, but by October only 50 had been built, all of which were used by Commodore. Machines only began to arrive in quantity in mid-November, meaning they missed the Christmas buying rush.  By the end of the year, they had sold 35,000 machines, and severe cashflow problems made the company pull out of the January 1986 CES.  Bad or entirely missing marketing, forcing the development team to move to the east coast, notorious stability problems and other blunders limited sales in early 1986 to between 10,000 and 15,000 units a month.       In late 1985 ": null
    },
    {
        "Thomas Rattigan": "Thomas Rattigan"
    },
    {
        " was promoted to ": null
    },
    {
        "COO": "Chief Operating Officer"
    },
    {
        " of Commodore, and then to ": null
    },
    {
        "CEO": "Chief Executive Officer"
    },
    {
        " in February 1986. He immediately implemented an ambitious plan that covered almost all of the companys operations. Among these were the long overdue cancelation of the now outdated ": null
    },
    {
        "PET": "Commodore Pet"
    },
    {
        " and ": null
    },
    {
        "VIC-20": "Commodore Vic-20"
    },
    {
        " lines, as well as a variety of poorly selling ": null
    },
    {
        "Commodore 64": "Commodore 64"
    },
    {
        " offshoots and the ": null
    },
    {
        "Commodore 900": "Commodore 900"
    },
    {
        " workstation": "Workstation"
    },
    {
        " effort.     Another one of the changes was to split the Amiga into two products, a new high-end version of the Amiga aimed at the creative market, and a cost-reduced version that would take over for the Commodore 64 in the low-end market.  These new designs were released in 1987 as the ": null
    },
    {
        "Amiga 2000": "Amiga 2000"
    },
    {
        " and ": null
    },
    {
        "Amiga 500": "Amiga 500"
    },
    {
        ", the latter of which went on to widespread success and became their best selling model.     Similar high-end/low-end models would make up the Amiga line for the rest of its history; follow-on designs included the ": null
    },
    {
        "Amiga 3000": "Amiga 3000"
    },
    {
        "/": null
    },
    {
        "Amiga 500 Plus": "Amiga 500 Plus"
    },
    {
        "/": null
    },
    {
        "Amiga 600": "Amiga 600"
    },
    {
        ", and the ": null
    },
    {
        "Amiga 4000": "Amiga 4000"
    },
    {
        "/": null
    },
    {
        "Amiga 1200": "Amiga 1200"
    },
    {
        ". These models incorporated a series of technical upgrades known as the ": null
    },
    {
        "ECS": "Amiga Enhanced Chip Set"
    },
    {
        " and ": null
    },
    {
        "AGA": "Amiga Advanced Graphics Architecture"
    },
    {
        ", which added higher resolution displays among many other improvements and simplifications.     Ultimately the Amiga line would sell an estimated 4,850,000 machines over its lifetime. The machines were most popular in the UK and Germany, with about 1.5 million sold in each country, and sales in the high hundreds of thousands in other European nations. The machine was less popular in North America, where an estimated 700,000 were sold.  In particular, in the U.S. the Amiga did not achieve any success outside of Commodores traditional enthusiast market except in ": null
    },
    {
        "vertical markets": "Vertical Market"
    },
    {
        "for ": null
    },
    {
        "video processing": "Video Processing"
    },
    {
        " and editing.        In spite of his successes in making the company profitable and bringing the Amiga line to market, Rattigan was soon forced out in a power struggle with majority shareholder, ": null
    },
    {
        "Irving Gould": "Irving Gould"
    },
    {
        ". This is widely regarded as the turning point, as further improvements to the Amiga were eroded by rapid improvements in other platforms.      On April 29, 1994, Commodore filed for bankruptcy and its assets were purchased by ": null
    },
    {
        "Escom": "Escom"
    },
    {
        ", a German PC manufacturer, who created the subsidiary company Amiga Technologies. They re-released the A1200 and A4000T, and introduced a new ": null
    },
    {
        "68060": "Motorola 68060"
    },
    {
        " version of the A4000T. Escom, in turn, went bankrupt in 1997.     The Amiga brand was then sold to a U.S. ": null
    },
    {
        "Wintel": "Wintel"
    },
    {
        " PC manufacturer, ": null
    },
    {
        "Gateway 2000": "Gateway, Inc."
    },
    {
        ", which had announced grand plans for it. In 2000, however, Gateway sold the Amiga brand without having released any products. The current owner of the trademark, ": null
    },
    {
        "Amiga, Inc.": "Amiga, Inc."
    },
    {
        ", licensed the rights to sell hardware using either the Amiga or ": null
    },
    {
        "AmigaOne": "Amigaone"
    },
    {
        " brand to ": null
    },
    {
        "Eyetech Group": "Eyetech"
    },
    {
        ", ": null
    },
    {
        "Hyperion Entertainment": "Hyperion Entertainment"
    },
    {
        " and ": null
    },
    {
        "Commodore USA": "Commodore Usa"
    },
    {
        ".                      At its core, the Amiga has a custom chipset consisting of several ": null
    },
    {
        "coprocessor": "Coprocessor"
    },
    {
        "s, which handle audio, video and ": null
    },
    {
        "direct memory access": "Direct Memory Access"
    },
    {
        " independently of the ": null
    },
    {
        "Central Processing Unit": "Central Processing Unit"
    },
    {
        " . This architecture freed up the Amigas processor for other tasks and gave the Amiga a performance edge over its competitors, particularly in terms of video-intensive applications and games.     The general Amiga architecture uses two distinct ": null
    },
    {
        "bus": "Bus"
    },
    {
        " subsystems, namely, the chipset bus and the CPU bus. The chipset bus allows the custom coprocessors and CPU to address ": null
    },
    {
        " Chip RAM ": "Amiga Chip Ram"
    },
    {
        ". The CPU bus provides addressing to other subsystems, such as conventional RAM, ROM and the ": null
    },
    {
        "Zorro II": "Amiga Zorro Ii"
    },
    {
        " or ": null
    },
    {
        "Zorro III": "Amiga Zorro Iii"
    },
    {
        " expansion subsystems. This architecture enables independent operation of the subsystems; the CPU Fast bus can be much faster than the chipset bus. CPU expansion boards may provide additional custom buses. Additionally, busboards or bridgeboards may provide ": null
    },
    {
        "ISA": "Industry Standard Architecture"
    },
    {
        " or ": null
    },
    {
        "PCI": "Conventional Pci"
    },
    {
        " buses.       The ": null
    },
    {
        "Motorola": "Motorola"
    },
    {
        " 68000": "Motorola 68000 Family"
    },
    {
        " series of microprocessors was used in all Amiga models from Commodore. While all CPU in the 68000 family have a ": null
    },
    {
        "32-bit": "32-Bit"
    },
    {
        " ISA": "Instruction Set Architecture"
    },
    {
        " design , the MC68000 used in the most popular models is a ": null
    },
    {
        "16-bit": "16-Bit"
    },
    {
        " processor because its ": null
    },
    {
        "ALU": "Arithmetic Logic Unit"
    },
    {
        " operates in 16-bit . The MC68000 has a 16-bit external ": null
    },
    {
        "data bus": "Bus"
    },
    {
        " so 32-bits of data is transferred in two consecutive steps, a technique called ": null
    },
    {
        "multiplexing": "Multiplexing"
    },
    {
        ". This is transparent to the software, which was 32-bit from the beginning. The MC68000 can address 16  MB of physical memory. Later Amiga models featured higher-speed, full 32-bit CPUs with a larger address space and ": null
    },
    {
        "instruction pipeline": "Instruction Pipelining"
    },
    {
        " facilities.     CPU upgrades were offered by both Commodore and third-party manufacturers. Most Amiga models can be upgraded either by direct CPU replacement or through expansion boards. Such boards often featured faster and higher capacity memory interfaces and ": null
    },
    {
        "hard disk": "Hard Disk Drive"
    },
    {
        " controllers.     Towards the end of Commodores time in charge of Amiga development, there were suggestions that Commodore intended to move away from the 68000 series to higher performance ": null
    },
    {
        "RISC": "Reduced Instruction Set Computing"
    },
    {
        " processors, such as the ": null
    },
    {
        "PA-RISC": "Pa-Risc"
    },
    {
        ". Those ideas were never developed before Commodore filed for bankruptcy. Despite this, third-party manufacturers designed upgrades featuring a combination of 68000 series and PowerPC processors along with a PowerPC native ": null
    },
    {
        "microkernel": "Microkernel"
    },
    {
        " and software. Later Amiga clones featured ": null
    },
    {
        "PowerPC": "Powerpc"
    },
    {
        " processors only.       The custom chipset at the core of the Amiga design appeared in three distinct generations, with a large degree of backward-compatibility. The ": null
    },
    {
        "Original Chip Set": "Original Chip Set"
    },
    {
        " appeared with the launch of the A1000 in 1985. OCS was eventually followed by the modestly improved ": null
    },
    {
        "Enhanced Chip Set": "Amiga Enhanced Chip Set"
    },
    {
        " in 1990 and finally by the partly 32-bit ": null
    },
    {
        "Advanced Graphics Architecture": "Amiga Advanced Graphics Architecture"
    },
    {
        " in 1992. Each chipset consists of several coprocessors that handle ": null
    },
    {
        "graphics acceleration": "Blitter"
    },
    {
        ", digital audio, ": null
    },
    {
        "direct memory access": "Direct Memory Access"
    },
    {
        " and communication between various peripherals . In addition, some models featured auxiliary ": null
    },
    {
        "custom chips": "Amiga Custom Chips"
    },
    {
        "that performed tasks such as ": null
    },
    {
        "SCSI": "Scsi"
    },
    {
        " control and display de-interlacing.            All Amiga systems can display full-screen animated graphics with 2, 4, 8, 16, 32, 64 , or 4096 colors . Models with the AGA chipset also have non-EHB 64, 128, 256, and   color modes and a palette expanded from 4096 to ": null
    },
    {
        "16.8 million colors": "24-Bit Color"
    },
    {
        ".     The Amiga chipset can  genlock , which is the ability to adjust its own screen refresh timing to match an incoming NTSC or PAL video signal. When combined with setting transparency, this allows an Amiga to overlay an external video source with graphics. This ability made the Amiga popular for many applications, and provides the ability to do ": null
    },
    {
        "character generation": "Character Generator"
    },
    {
        " and ": null
    },
    {
        "CGI": "Computer-Generated Imagery"
    },
    {
        " effects far more cheaply than earlier systems. This ability has been frequently utilized by wedding videographers, TV stations and their weather forecasting divisions , advertising channels, music video production, and desktop videographers. The ": null
    },
    {
        "NewTek": "Newtek"
    },
    {
        " Video Toaster": "Video Toaster"
    },
    {
        " was made possible by the genlock ability of the Amiga.     In 1988, the release of the Amiga A2024 fixed-frequency ": null
    },
    {
        "monochrome": "Monochrome"
    },
    {
        " monitor with built-in ": null
    },
    {
        "framebuffer": "Framebuffer"
    },
    {
        " and flicker fixer hardware provided the Amiga with a choice of high-resolution graphic modes .            ReTargetable Graphics is an ": null
    },
    {
        "API": "Application Programming Interface"
    },
    {
        " for ": null
    },
    {
        "device drivers": "Device Driver"
    },
    {
        "mainly used by 3rd party graphics hardware to interface with AmigaOS via a set of ": null
    },
    {
        "libraries": "Library"
    },
    {
        ". The software libraries may include software tools to adjust ": null
    },
    {
        "resolution": "Display Resolution"
    },
    {
        ", screen colors, ": null
    },
    {
        "pointers": "Cursor Mouse Cursor"
    },
    {
        " and screenmodes. The standard ": null
    },
    {
        "Intuition interface": "Intuition"
    },
    {
        " is limited to ": null
    },
    {
        "display depths": "Color Depth"
    },
    {
        " of ": null
    },
    {
        "8-bit": "8-Bit"
    },
    {
        "s, while RTG makes it possible to handle higher depths like ": null
    },
    {
        "24-bit": "24-Bit"
    },
    {
        "s.       The sound chip, named Paula, supports four ": null
    },
    {
        "PCM": "Pulse-Code Modulation"
    },
    {
        "-sample-based sound channels with 8-bit resolution for each channel and a 6-bit volume control per channel. The analog output is connected to a low-pass filter, which filters out high-frequency aliases when the Amiga is using a lower sampling rate . The brightness of the Amigas power LED is used to indicate the status of the Amigas low-pass filter. The filter is active when the LED is at normal brightness, and deactivated when dimmed . On Amiga 1000 , the power LED had no relation to the filters status, and a wire needed to be manually soldered between pins on the sound chip to disable the filter. Paula can read directly from the systems ": null
    },
    {
        "RAM": "Random-Access Memory"
    },
    {
        ", using direct memory access , making sound playback without CPU intervention possible.     Although the hardware is limited to four separate sound channels, software such as  OctaMED  uses software mixing to allow eight or more virtual channels, and it was possible for software to mix two hardware channels to achieve a single 14-bit resolution channel by playing with the volumes of the channels in such a way that one of the source channels contributes the most significant bits and the other the least.     The quality of the Amigas sound output, and the fact that the hardware is ubiquitous and easily addressed by software, were standout features of Amiga hardware unavailable on PC platforms for years. Third-party sound cards exist that provide ": null
    },
    {
        "DSP": "Digital Signal Processor"
    },
    {
        " functions, multi-track ": null
    },
    {
        "direct-to-disk recording": "Direct-To-Disk Recording"
    },
    {
        ", multiple hardware sound channels and 16-bit and beyond resolutions. A retargetable sound API called ": null
    },
    {
        "AHI": "Ahi"
    },
    {
        " was developed allowing these cards to be used transparently by the ": null
    },
    {
        "OS": "Operating System"
    },
    {
        " and software.            Kickstart is the ": null
    },
    {
        "firmware": "Firmware"
    },
    {
        " upon which AmigaOS is ": null
    },
    {
        "bootstrap": "Booting"
    },
    {
        "ped. Its purpose is to initialize the Amiga hardware and core components of AmigaOS and then attempt to boot from a ": null
    },
    {
        "bootable": "Booting"
    },
    {
        " volume": "Volume"
    },
    {
        ", such as a floppy disk or hard disk drive. Most models come equipped with Kickstart on an embedded ": null
    },
    {
        "ROM-chip": "Read-Only Memory"
    },
    {
        ".            The keyboard on Amiga computers is similar to that found on a mid 80s IBM PC: Ten function keys, a numeric keypad, and four separate directional arrow keys. Caps Lock and Control share space to the left of A. Missing are the Home, End, Page Up, and Page Down keys: These are accomplished on Amigas by pressing shift and the appropriate arrow key. The Amiga keyboard adds a Help key, which a function key usually acts as on PCs . In addition to the Control and Alt modifier keys, the Amiga has 2 Amiga keys, rendered as Open Amiga and Closed Amiga similar to the Open/Closed Apple logo keys on Apple II keyboards. The left is used to manipulate the operating system and the right delivered commands to the application. The absence of Num lock frees space for more math symbols around the number pad. Contemporary Macintosh computers, for comparison, lack function keys completely.     The mouse has two buttons like Windows, but unlike Windows pressing and holding the right button replaces the system ": null
    },
    {
        "status line": "Status Bar"
    },
    {
        " at the top of the screen with a Maclike ": null
    },
    {
        "menu bar": "Menu Bar"
    },
    {
        ". As with Apples ": null
    },
    {
        "Mac OS": "Classic Mac Os"
    },
    {
        " prior to ": null
    },
    {
        "Mac OS 8": "Mac Os 8"
    },
    {
        ", menu options are selected by releasing the button over that option, not by left clicking. Menu items that have a boolean toggle state can be left clicked whilst the menu is kept open with the right button, which allows the user – for example – to set some selected text to bold, underline and italics all at once.     The mouse plugs into one of two ": null
    },
    {
        "Atari joystick ports": "Atari Joystick Port"
    },
    {
        "used for ": null
    },
    {
        "joystick": "Joystick"
    },
    {
        "s, ": null
    },
    {
        "game paddles": "Paddle"
    },
    {
        ", and ": null
    },
    {
        "graphics tablet": "Graphics Tablet"
    },
    {
        "s. Although compatible with ": null
    },
    {
        "analog joystick": "Analog Stick"
    },
    {
        "s, Atari-style digital joysticks became standard.             The Amiga was one of the first computers for which inexpensive sound sampling and video digitization accessories were available. As a result of this and the Amigas audio and video capabilities, the Amiga became a popular system for editing and producing both music and video.     Many expansion boards were produced for Amiga computers to improve the performance and capability of the hardware, such as memory expansions, ": null
    },
    {
        "SCSI": "Scsi"
    },
    {
        " controllers, CPU boards, and graphics boards. Other upgrades include ": null
    },
    {
        "genlock": "Genlock"
    },
    {
        "s, network cards for ": null
    },
    {
        "Ethernet": "Ethernet"
    },
    {
        ", ": null
    },
    {
        "modem": "Modem"
    },
    {
        "s, ": null
    },
    {
        "sound cards": "Sound Card"
    },
    {
        "and samplers, ": null
    },
    {
        "video digitizers": "Video Capture"
    },
    {
        ", extra ": null
    },
    {
        "serial port": "Serial Port"
    },
    {
        "s, and ": null
    },
    {
        "IDE": "Parallel Ata"
    },
    {
        " controllers. Additions after the demise of Commodore company are ": null
    },
    {
        "USB": "Usb"
    },
    {
        " cards. The most popular upgrades were memory, SCSI controllers and CPU accelerator cards. These were sometimes combined into the one device.     Early CPU accelerator cards feature full 32-bit CPUs of the 68000 family such as the ": null
    },
    {
        "Motorola 68020": "Motorola 68020"
    },
    {
        " and ": null
    },
    {
        "Motorola 68030": "Motorola 68030"
    },
    {
        ", almost always with 32-bit memory and usually with ": null
    },
    {
        "FPUs": "Floating-Point Unit"
    },
    {
        " and ": null
    },
    {
        "MMUs": "Memory Management Unit"
    },
    {
        " or the facility to add them. Later designs feature the ": null
    },
    {
        "Motorola 68040": "Motorola 68040"
    },
    {
        " or ": null
    },
    {
        "Motorola 68060": "Motorola 68060"
    },
    {
        ". Both CPUs feature integrated FPUs and MMUs. Many CPU accelerator cards also had integrated SCSI controllers.     Phase5 designed the ": null
    },
    {
        "PowerUP": "Powerup"
    },
    {
        " boards  featuring both a 68k and a PowerPC CPU, which are able to run the two CPUs at the same time and share the system memory. The PowerPC CPU on PowerUP boards is usually used as a coprocessor for heavy computations; a powerful CPU is needed to run ": null
    },
    {
        "MAME": "Mame"
    },
    {
        " for example, but even decoding ": null
    },
    {
        "JPEG": "Jpeg"
    },
    {
        " pictures and ": null
    },
    {
        "MP3": "Mp3"
    },
    {
        " audio was considered heavy computation at the time. It is also possible to ignore the 68k CPU and run ": null
    },
    {
        "Linux": "Linux"
    },
    {
        " on the PPC via project Linux APUS, but a PowerPC-native AmigaOS promised by Amiga Technologies GmbH was not available when the PowerUP boards first appeared.     24-bit graphics cards and video cards were also available. Graphics cards were designed primarily for 2D artwork production, workstation use, and later, gaming. Video cards are designed for inputting and outputting video signals, and processing and manipulating video.     In the North American market, the NewTek Video Toaster  was a video effects board that turned the Amiga into an affordable video processing computer that found its way into many professional video environments. One well-known use was to create the special effects in early series of  Babylon 5 .  Due to its ": null
    },
    {
        "NTSC": "Ntsc"
    },
    {
        "-only design, it did not find a market in countries that used the ": null
    },
    {
        "PAL": "Pal"
    },
    {
        " standard, such as in Europe. In those countries, the OpalVision card was popular, although less featured and supported than the Video Toaster. Low-cost ": null
    },
    {
        "time base correctors": "Time Base Correction"
    },
    {
        " specifically designed to work with the Toaster quickly came to market, most of which were designed as standard Amiga bus cards.     Various manufacturers started producing PCI busboards for the A1200, A3000 and A4000, allowing standard Amiga computers to use PCI cards such as graphics cards, ": null
    },
    {
        "Sound Blaster": "Sound Blaster"
    },
    {
        " sound cards, 10/100 Ethernet cards, USB cards, and television tuner cards. Other manufacturers produced hybrid boards that contained an Intel x86 series chip, allowing the Amiga to emulate a PC.     PowerPC upgrades with Wide SCSI controllers, PCI busboards with Ethernet, sound and 3D graphics cards, and tower cases allowed the A1200 and A4000 to survive well into the late nineties.     Expansion boards were made by ": null
    },
    {
        "Richmond Sound Design": "Richmond Sound Design"
    },
    {
        " that allow their ": null
    },
    {
        "show control": "Show Control"
    },
    {
        " and ": null
    },
    {
        "sound design": "Sound Design"
    },
    {
        " software to communicate with their custom hardware frames either by either ribbon cable or fiber optic cable for long distances, allowing the Amiga to control up to eight million digitally controlled external audio, lighting, automation, relay and voltage control channels spread around a large theme park, for example. See ": null
    },
    {
        "Amiga software": "Amiga Software"
    },
    {
        " for more information on these applications.     Other devices included the following:   ": null
    },
    {
        "Amiga 501": "Amiga 500Trap-Door Expansion 501"
    },
    {
        " with 512  KB RAM and ": null
    },
    {
        "real-time clock": "Real-Time Clock"
    },
    {
        " Zorro-II": "Amiga Zorro Ii"
    },
    {
        " SCSI interface   ": null
    },
    {
        "GVP A530 Turbo": "Great Valley Productsgvp A530 Turbo"
    },
    {
        ", accelerator, RAM expansion, PC emulator   A2091 / A590 SCSI hard disk controller + 2  MB RAM expansion   A3070 SCSI tape backup unit with a capacity of , ": null
    },
    {
        "OEM": "Original Equipment Manufacturer"
    },
    {
        " Archive Viper 1/4-inch   A2065 Ethernet Zorro-II interface – the first Ethernet interface for Amiga; uses the ": null
    },
    {
        "AMD Am7990": "Amd Lance Am7990"
    },
    {
        " chip The same interface chip is used in ": null
    },
    {
        "DECstation": "Decstation"
    },
    {
        " as well.   Ariadne Zorro-II Ethernet interface using the AMD Am7990   A4066 Zorro II Ethernet interface using the SMC 91C90QF    X-Surf from Individual Computers using the Realtek 8019AS   A2060 ": null
    },
    {
        "Arcnet": "Arcnet"
    },
    {
        "   A1010 ": null
    },
    {
        "floppy": "Floppy-Disk Controller"
    },
    {
        " disk drive consisting of a 3.5-inch ": null
    },
    {
        "double density": "Double Density"
    },
    {
        " , ,  drive unit connected via ": null
    },
    {
        "DB-23": "D-Subminiature"
    },
    {
        " connector; track-to-track delay is on the order of . The default capacity is  . Many clone drives were available, and products such as ": null
    },
    {
        "the Catweasel": "Individual Computers Catweasel"
    },
    {
        " and ": null
    },
    {
        "KryoFlux": "Kryoflux"
    },
    {
        " make it possible to read and write Amiga and other special disc formats on standard x86 PCs.   ": null
    },
    {
        "NE2000": "Ne2000"
    },
    {
        "-compatible ": null
    },
    {
        "PCMCIA": "Pc Card"
    },
    {
        " Ethernet cards for Amiga 600 and Amiga 1200       The Commodore A2232 board provides  ": null
    },
    {
        "serial ports": "Serial Port"
    },
    {
        "in addition to the Amigas built-in serial port. Each port can be driven independently at speeds of  There is, however, a driver available on ": null
    },
    {
        "Aminet": "Aminet"
    },
    {
        " that allows two of the serial ports to be driven at   The serial card used the ": null
    },
    {
        "65CE02": "Csg 65Ce02"
    },
    {
        " CPU  clocked at . This CPU was also part of the ": null
    },
    {
        "CSG 4510": "Csg 65Ce02"
    },
    {
        " CPU core that was used in the ": null
    },
    {
        "Commodore 65": "Commodore 65"
    },
    {
        " computer.       Amiga has three networking interface APIs:   AS225: the official Commodore TCP/IP stack ": null
    },
    {
        "API": "Application Programming Interface"
    },
    {
        " with hard-coded drivers in revision 1 for the ": null
    },
    {
        "A2065 Ethernet": "Amd Lance Am7990"
    },
    {
        " and the A2060 Arcnet interfaces. In revision 2, the SANA-II interface was used.   SANA-II: a standardized API for hardware of network interfaces. It uses an inefficient buffer handling scheme, and lacks proper support for ": null
    },
    {
        "promiscuous": "Promiscuous Mode"
    },
    {
        " and ": null
    },
    {
        "multicast": "Multicast"
    },
    {
        " modes.   Miami Network Interface : an API that doesnt have the problems that SANA-II suffers from. It requires AmigaOS v2.04 or higher.     Different network media were used:                 The original Amiga models were produced from 1985 to 1996. They are, in order of production: ": null
    },
    {
        "1000": "Amiga 1000"
    },
    {
        ", ": null
    },
    {
        "2000": "Amiga 2000"
    },
    {
        ", ": null
    },
    {
        "500": "Amiga 500"
    },
    {
        ", ": null
    },
    {
        "1500": "Amiga 1500"
    },
    {
        ", ": null
    },
    {
        "2500": "Amiga 2500"
    },
    {
        ", ": null
    },
    {
        "3000": "Amiga 3000"
    },
    {
        ", ": null
    },
    {
        "3000UX": "Amiga 3000Ux"
    },
    {
        ", ": null
    },
    {
        "3000T": "Amiga 3000T"
    },
    {
        ", ": null
    },
    {
        "CDTV": "Commodore Cdtv"
    },
    {
        ", ": null
    },
    {
        "500+": "Amiga 500+"
    },
    {
        ", ": null
    },
    {
        "600": "Amiga 600"
    },
    {
        ", ": null
    },
    {
        "4000": "Amiga 4000"
    },
    {
        ", ": null
    },
    {
        "1200": "Amiga 1200"
    },
    {
        ", ": null
    },
    {
        "CD32": "Amiga Cd32"
    },
    {
        ", and ": null
    },
    {
        "4000T": "Amiga 4000T"
    },
    {
        ". The PowerPC based ": null
    },
    {
        "AmigaOne": "Amigaone"
    },
    {
        " computers were later marketed since 2002. Several companies and private persons have also released Amiga ": null
    },
    {
        "clones": "Clone"
    },
    {
        " and still do so today.               The first Amiga model, the Amiga 1000, was launched in 1985. In 2006, ": null
    },
    {
        "PC World": "Pc World"
    },
    {
        " rated the Amiga 1000 as the seventh greatest PC of all time, stating Years ahead of its time, the Amiga was the worlds first multimedia, multitasking personal computer .     Commodore updated the desktop line of Amiga computers with the ": null
    },
    {
        "Amiga 2000": "Amiga 2000"
    },
    {
        " in 1987, the ": null
    },
    {
        "Amiga 3000": "Amiga 3000"
    },
    {
        " in 1990, and the ": null
    },
    {
        "Amiga 4000": "Amiga 4000"
    },
    {
        " in 1992, each offering improved capabilities and expansion options. The best selling models were the budget models, however, particularly the highly successful ": null
    },
    {
        "Amiga 500": "Amiga 500"
    },
    {
        " and the ": null
    },
    {
        "Amiga 1200": "Amiga 1200"
    },
    {
        " . The ": null
    },
    {
        "Amiga 500+": "Amiga 500+"
    },
    {
        " was the shortest lived model, replacing the Amiga 500 and lasting only six months until it was phased out and replaced with the ": null
    },
    {
        "Amiga 600": "Amiga 600"
    },
    {
        " , which in turn was also quickly replaced by the Amiga 1200.     The ": null
    },
    {
        "CDTV": "Commodore Cdtv"
    },
    {
        ", launched in 1991, was a ": null
    },
    {
        "CD-ROM": "Cd-Rom"
    },
    {
        " based all-in-one multimedia system. It was an early attempt at a multi-purpose multimedia appliance in an era before multimedia consoles and CD-ROM drives were common. Unfortunately for Commodore, the system never achieved any real commercial success. Like the ": null
    },
    {
        "Commodore 64GS": "Commodore 64 Games System"
    },
    {
        " that was a video game console based on a computer, the CDTV was designed as a video game console and multimedia platform. It had existed before the Sony ": null
    },
    {
        "PlayStation": "Playstation"
    },
    {
        " and ": null
    },
    {
        "Sega Saturn": "Sega Saturn"
    },
    {
        ", but had influenced them. It competed with the ": null
    },
    {
        "Turbo-Grafx CD": "Turbografx-16"
    },
    {
        " and ": null
    },
    {
        "Sega CD": "Sega Cd"
    },
    {
        " system add ons when it was being sold.     Commodores last Amiga offering before filing for bankruptcy was an attempt to capture a portion of the highly competitive 1990s console market with the ": null
    },
    {
        "Amiga CD32": "Amiga Cd32"
    },
    {
        " , a 32-bit CD-ROM games console. Although discontinued after Commodores demise it met with moderate commercial success in Europe. The CD32 was a next generation CDTV, and it was designed to save Commodore by entering the growing video game console market.     Following purchase of Commodores assets by Escom in 1995, the A1200 and A4000T continued to be sold in small quantities until 1996, though the ground lost since the initial launch and the prohibitive expense of these units meant that the Amiga line never regained any real popularity.     Several Amiga models contained references to songs by the ": null
    },
    {
        "rock": "Rock Music"
    },
    {
        " band ": null
    },
    {
        "The B-52s": "The B-52S"
    },
    {
        ". Early A500 units had the words B52/ROCK LOBSTER ": null
    },
    {
        "silk-screen printed": "Pcb Manufacturing"
    },
    {
        " onto their ": null
    },
    {
        "printed circuit board": "Printed Circuit Board"
    },
    {
        ", a reference to the song ": null
    },
    {
        "Rock Lobster": "Rock Lobster"
    },
    {
        " The ": null
    },
    {
        "Amiga 600": "Amiga 600"
    },
    {
        " referenced JUNE BUG and the ": null
    },
    {
        "Amiga 1200": "Amiga 1200"
    },
    {
        " had CHANNEL Z ., and the CD-32 had Spellbound.            ": null
    },
    {
        "AmigaOS 4": "Amigaos 4"
    },
    {
        " is designed for PowerPC Amiga systems. It is mainly based on AmigaOS 3.1 source code, with some parts of version 3.9. Currently runs on both Amigas equipped with CyberstormPPC or BlizzardPPC accelerator boards, on the Teron series based ": null
    },
    {
        "AmigaOne": "Amigaone"
    },
    {
        " computers built by ": null
    },
    {
        "Eyetech": "Eyetech"
    },
    {
        " under license by ": null
    },
    {
        "Amiga, Inc.": "Amiga, Inc."
    },
    {
        ", on the ": null
    },
    {
        "Pegasos II": "Pegasos"
    },
    {
        " from ": null
    },
    {
        "Genesi": "Genesi"
    },
    {
        "/": null
    },
    {
        "bPlan GmbH": "Genesi"
    },
    {
        ", on the ": null
    },
    {
        "ACube Systems Srl": "Acube Systems Srl"
    },
    {
        " Sam440ep": "Sam440Ep"
    },
    {
        " / ": null
    },
    {
        "Sam460ex": "Sam460Ex"
    },
    {
        " / AmigaOne 500 systems and on the A-EON ": null
    },
    {
        "AmigaOne X1000": "Amigaone X1000"
    },
    {
        ".     AmigaOS 4.0 had been available only in developer pre-releases for numerous years until it was officially released in December 2006. Due to the nature of some provisions of the contract between Amiga Inc. and ": null
    },
    {
        "Hyperion Entertainment": "Hyperion Entertainment"
    },
    {
        " , the commercial AmigaOS 4 had been available only to licensed buyers of AmigaOne motherboards.     AmigaOS 4.0 for Amigas equipped with PowerUP accelerator boards was released in November 2007. Version 4.1 was released in August 2008 for AmigaOne systems, and in May 2011 for Amigas equipped with PowerUP accelerator boards. The most recent release of AmigaOS for all supported platforms is 4.1 update 5. Starting with release 4.1 update 4 there is an Emulation drawer containing official AmigaOS 3.x ROMs and relative Workbench files.     ": null
    },
    {
        "Acube Systems": "Acube Systems"
    },
    {
        " entered an agreement with Hyperion under which it has ported AmigaOS 4 to its ": null
    },
    {
        "Sam440ep": "Sam440Ep"
    },
    {
        " and ": null
    },
    {
        "Sam460ex": "Sam460Ex"
    },
    {
        " line of PowerPC-based motherboards. In 2009 a version for ": null
    },
    {
        "Pegasos II": "Pegasos Ii"
    },
    {
        " was released in co-operation with Acube Systems. In 2012, A-EON Technology Ltd manufactured and released the ": null
    },
    {
        "AmigaOne X1000": "Amigaone X1000"
    },
    {
        " to consumers through their partner, Amiga Kit who provided end-user support, assembly and worldwide distribution of the new system.       Long-time Amiga developer MacroSystem entered the Amiga-clone market with their ": null
    },
    {
        "DraCo": "Draco"
    },
    {
        " non-linear video editing system. It appears in two versions, initially a tower model and later a cube. DraCo expanded upon and combined a number of earlier expansion cards developed for Amiga into a true Amiga-clone powered by the ": null
    },
    {
        "Motorola 68060": "Motorola 68060"
    },
    {
        " processor. The DraCo can run AmigaOS 3.1 up through AmigaOS 3.9. It is the only Amiga-based system to support ": null
    },
    {
        "FireWire": "Firewire"
    },
    {
        " for video ": null
    },
    {
        "I/O": "Input/Output"
    },
    {
        ". DraCo also offers an Amiga-compatible ": null
    },
    {
        "Zorro-II": "Amiga Zorro Iii"
    },
    {
        " expansion bus and introduced a faster custom DraCoBus, capable of  transfer rates . The technology was later used in the Casablanca system, a set-top-box also designed for non-linear video editing.     In 1998, Index Information released the Access, an Amiga-clone similar to the Amiga 1200, but on a motherboard that could fit into a standard ": null
    },
    {
        "5¼ drive bay": "Drive Bay5%"
    },
    {
        ". It features either a ": null
    },
    {
        "68020": "Motorola 68020"
    },
    {
        " or ": null
    },
    {
        "68030": "Motorola 68030"
    },
    {
        " CPU, with a redesigned ": null
    },
    {
        "AGA": "Amiga Advanced Graphics Architecture"
    },
    {
        " chipset, and runs AmigaOS 3.1.     In 1998, former Amiga employees  formed a new company called PIOS. Their hardware platform, PIOS One, was aimed at Amiga, Atari and Macintosh users. The company was renamed to Met@box in 1999 until it folded.     The NatAmi  hardware project began in 2005 with the aim of designing and building an Amiga clone motherboard that is enhanced with modern features. The NatAmi motherboard is a standard ": null
    },
    {
        "Mini-ITX": "Mini-Itx"
    },
    {
        "-compatible form factor computer motherboard, powered by a Motorola/Freescale ": null
    },
    {
        "68060": "68060"
    },
    {
        " and its chipset. It is compatible with the original Amiga chipset, which has been inscribed on a programmable FPGA ": null
    },
    {
        "Altera": "Altera"
    },
    {
        " chip on the board. The NatAmi is the second Amiga clone project after the ": null
    },
    {
        "Minimig": "Minimig"
    },
    {
        " motherboard, and its history is very similar to that of the ": null
    },
    {
        "C-One": "C-One"
    },
    {
        " mainboard developed by ": null
    },
    {
        "Jeri Ellsworth": "Jeri Ellsworth"
    },
    {
        " and Jens Schönfeld. From a commercial point of view, Natamis circuitry and design are currently ": null
    },
    {
        "closed source": "Proprietary Software"
    },
    {
        ". One goal of the NatAmi project is to design an Amiga-compatible motherboard that includes up-to-date features but that does not rely on emulation , modern PC ": null
    },
    {
        "Intel": "Intel"
    },
    {
        " components, or a modern ": null
    },
    {
        "PowerPC": "Powerpc"
    },
    {
        " mainboard. As such, NatAmi is not intended to become another evolutionary heir to classic Amigas, such as with ": null
    },
    {
        "AmigaOne": "Amigaone"
    },
    {
        " or ": null
    },
    {
        "Pegasos": "Pegasos"
    },
    {
        " computers. This purist philosophy essentially limits the resulting processor speed but puts the focus on bandwidth and low latencies. The developers also recreated the entire Amiga chipset, freeing it from legacy Amiga limitations such as two ": null
    },
    {
        "megabytes": "Megabyte"
    },
    {
        "of audio and video graphics RAM as in the ": null
    },
    {
        "AGA chipset": "Amiga Advanced Graphics Architecture"
    },
    {
        ", and rebuilt this new chipset by programming a modern ": null
    },
    {
        "FPGA": "Field-Programmable Gate Array"
    },
    {
        " Altera": "Altera"
    },
    {
        " Cyclone IV chip. Later, the developers decided to create from scratch a new software-form processor chip, codenamed N68050 that resides in the physical Altera FPGA programmable chip.     In 2006, two new Amiga clones were announced, both using ": null
    },
    {
        "FPGA": "Field-Programmable Gate Array"
    },
    {
        " based hardware synthesis to replace the Amiga ": null
    },
    {
        "OCS": "Original Chip Set"
    },
    {
        " custom chipset. The first, the ": null
    },
    {
        "Minimig": "Minimig"
    },
    {
        ", is a personal project of Dutch engineer Dennis van Weeren. Referred to as new Amiga hardware , the original model was built on a ": null
    },
    {
        "Xilinx": "Xilinx"
    },
    {
        " Spartan-3 development board, but soon a dedicated board was developed. The minimig uses the FPGA to reproduce the custom Denise, Agnus, Paula and ": null
    },
    {
        "Gary": "Amiga Custom Chipsgary"
    },
    {
        " chips as well as both 8520 ": null
    },
    {
        "CIAs": "Mos Technology Cia"
    },
    {
        " and implements a simple version of ": null
    },
    {
        "Amber": "Amiga Custom Chipsamber"
    },
    {
        ". The rest of the chips are an actual 68000 CPU, ram chips, and a PIC microcontroller for ": null
    },
    {
        "BIOS": "Bios"
    },
    {
        " control. The design for Minimig was released as ": null
    },
    {
        "open-source": "Open-Source Software"
    },
    {
        " on July 25, 2007. In February 2008, an Italian company ": null
    },
    {
        "Acube Systems": "Acube Systems"
    },
    {
        " began selling Minimig boards. A third party upgrade replaces the PIC microcontroller with a more powerful ARM processor, providing more functionality such as write access and support for hard disk images. The Minimig core has been ported to the FPGArcade Replay board. The Replay uses an FPGA with about  more capacity and that does support the AGA chipset and a ": null
    },
    {
        "68020": "Motorola 68020"
    },
    {
        " soft core": "Soft Core"
    },
    {
        " with ": null
    },
    {
        "68030": "Motorola 68030"
    },
    {
        " capabilities. The Replay board is designed to implement many older computers and classic arcade machines.     The second is the Clone-A system announced by ": null
    },
    {
        "Individual Computers": "Individual Computers"
    },
    {
        ". As of mid 2007 it has been shown in its development form, with FPGA-based boards replacing the Amiga chipset and mounted on an Amiga 500 motherboard.            Like many popular but discontinued platforms, the Amiga has been emulated so that software developed for the Amiga can be run on other computer platforms without the original hardware. Such emulators attempt to replicate the functionality of the Amiga architecture in software. As mentioned above, attempts have also been made to replicate the Amiga chipset in ": null
    },
    {
        "FPGA": "Field-Programmable Gate Array"
    },
    {
        " chips.     One of the most challenging aspects of emulation is the design of the Amiga chipset, which relies on cycle-critical timings. As a result, early emulators did not always achieve the intended results though later emulator versions can now accurately reproduce the behavior of Amiga systems.                        AmigaOS is a single-user multitasking ": null
    },
    {
        "operating system": "Operating System"
    },
    {
        ". It was developed first by Commodore International, and initially introduced in 1985 with the Amiga 1000. Original versions run on the Motorola 68000 series of microprocessors, while AmigaOS 4 runs only on PowerPC microprocessors. At the time of release AmigaOS put an operating system that was well ahead of its time into the hands of the average consumer. It was one of the first commercially available consumer operating systems for personal computers to implement ": null
    },
    {
        "preemptive": "Preemption"
    },
    {
        " multitasking.     Another notable feature was the combined use of both a ": null
    },
    {
        "command-line interface": "Command-Line Interface"
    },
    {
        " and ": null
    },
    {
        "graphical user interface": "Graphical User Interface"
    },
    {
        ". ": null
    },
    {
        "AmigaDOS": "Amigados"
    },
    {
        " was the disk operating system and command line portion of the OS and ": null
    },
    {
        "Workbench": "Workbench"
    },
    {
        " the native graphical windowing, ": null
    },
    {
        "icon": "Icon"
    },
    {
        "s, menu and pointer environment for file management and launching applications. Notably, AmigaDOS allowed long ": null
    },
    {
        "filenames": "Filename"
    },
    {
        " with ": null
    },
    {
        "whitespace": "Whitespace Character"
    },
    {
        " and did not require ": null
    },
    {
        "filename extension": "Filename Extension"
    },
    {
        "s. The ": null
    },
    {
        "windowing system": "Windowing System"
    },
    {
        " and user interface engine that handles all input events is called ": null
    },
    {
        "Intuition": "Intuition"
    },
    {
        ".     The multi-tasking kernel is called ": null
    },
    {
        "Exec": "Exec"
    },
    {
        ". It acts as a scheduler for tasks running on the system, providing pre-emptive multitasking with prioritised round-robin scheduling. It enabled true pre-emptive multitasking in as little as 256  KB of free memory.     AmigaOS does not implement ": null
    },
    {
        "memory protection": "Memory Protection"
    },
    {
        ", because the ": null
    },
    {
        "68000": "Motorola 68000"
    },
    {
        " CPU": "Central Processing Unit"
    },
    {
        " does not include a ": null
    },
    {
        "memory management unit": "Memory Management Unit"
    },
    {
        ". Although this speeds and eases ": null
    },
    {
        "inter-process communication": "Inter-Process Communication"
    },
    {
        " because programs can communicate by simply passing a ": null
    },
    {
        "pointer": "Pointer"
    },
    {
        " back and forth, the lack of memory protection made the AmigaOS more vulnerable to ": null
    },
    {
        "crashes": "Crash"
    },
    {
        " from badly behaving ": null
    },
    {
        "programs": "Computer Program"
    },
    {
        " than other multitasking systems that did implement memory protection,  and Amiga OS is fundamentally incapable of enforcing any form of security model since any program had full access to the system. A co-operational memory protection feature was implemented in AmigaOS 4 and could be retrofitted to old AmigaOS systems using Enforcer or CyberGuard tools.     The problem was somewhat exacerbated by Commodores initial decision to release documentation relating not only to the OSs underlying software routines, but also to the hardware itself, enabling intrepid programmers who had developed their skills on the ": null
    },
    {
        "Commodore 64": "Commodore 64"
    },
    {
        " to ": null
    },
    {
        "POKE": "Peek And Poke"
    },
    {
        " the hardware directly, as was done on the older platform. While the decision to release the documentation was a popular one and allowed the creation of fast, sophisticated sound and graphics routines in games and demos, it also contributed to system instability as some programmers lacked the expertise to program at this level. For this reason, when the new ": null
    },
    {
        "AGA": "Advanced Graphics Architecture"
    },
    {
        " chipset was released, ": null
    },
    {
        "Commodore": "Commodore International"
    },
    {
        " declined to release low-level documentation in an attempt to force developers into using the approved software routines.       AmigaOS directly or indirectly inspired the development of various operating systems. ": null
    },
    {
        "MorphOS": "Morphos"
    },
    {
        " and ": null
    },
    {
        "AROS": "Aros Research Operating System"
    },
    {
        " clearly inherit heavily from the structure of AmigaOS as explained directly in articles regarding these two operating systems. AmigaOS also influenced ": null
    },
    {
        "BeOS": "Beos"
    },
    {
        ", which featured a centralized system of ": null
    },
    {
        "Datatypes": "Amiga Support And Maintenance Softwaredatatypes"
    },
    {
        ", similar to that present in AmigaOS. Likewise, ": null
    },
    {
        "DragonFly BSD": "Dragonfly Bsd"
    },
    {
        " was also inspired by AmigaOS as stated by Dragonfly developer Matthew Dillon who is a former Amiga developer. ": null
    },
    {
        "WindowLab": "Windowlab"
    },
    {
        " and ": null
    },
    {
        "amiwm": "Amiwm"
    },
    {
        " are among several ": null
    },
    {
        "window managers": "Window Manager"
    },
    {
        "for the ": null
    },
    {
        "X Window System": "X Window System"
    },
    {
        " seek to mimic the Workbench interface. IBM licensed the Amiga GUI from Commodore in exchange for the REXX language license. This allowed OS/2 to have the WPS GUI shell for OS/2 2.0 a 32-bit operating system.          Commodore-Amiga produced ": null
    },
    {
        "Amiga Unix": "Amiga Unix"
    },
    {
        ", informally known as Amix, based on AT & T ": null
    },
    {
        "SVR4": "Unix System V"
    },
    {
        ". It supports the ": null
    },
    {
        "Amiga 2500": "Amiga 2500"
    },
    {
        " and Amiga 3000 and is included with the ": null
    },
    {
        "Amiga 3000UX": "Amiga 3000Ux"
    },
    {
        ". Among other unusual features of Amix is a hardware-accelerated windowing system that can scroll windows without copying data. Amix is not supported on the later Amiga systems based on ": null
    },
    {
        "68040": "Motorola 68040"
    },
    {
        " or ": null
    },
    {
        "68060": "Motorola 68060"
    },
    {
        " processors.     Other, still maintained, operating systems are available for the classic Amiga platform, including Linux and ": null
    },
    {
        "NetBSD": "Netbsd"
    },
    {
        ". Both require a CPU with ": null
    },
    {
        "MMU": "Memory Management Unit"
    },
    {
        " such as the ": null
    },
    {
        "68020": "Motorola 68020"
    },
    {
        " with ": null
    },
    {
        "68851": "Motorola 68851"
    },
    {
        " or full versions of the ": null
    },
    {
        "68030": "Motorola 68030"
    },
    {
        ", ": null
    },
    {
        "68040": "Motorola 68040"
    },
    {
        " or ": null
    },
    {
        "68060": "Motorola 68060"
    },
    {
        ". There is also a version of Linux for Amigas with PowerPC accelerator cards. ": null
    },
    {
        "Debian": "Debian"
    },
    {
        " and ": null
    },
    {
        "Yellow Dog Linux": "Yellow Dog Linux"
    },
    {
        " can run on the AmigaOne.     There is an official, older version of ": null
    },
    {
        "OpenBSD": "Openbsd"
    },
    {
        ". The last Amiga release is 3.2. ": null
    },
    {
        "MINIX": "Minix"
    },
    {
        " 1.5.10 also runs on Amiga.            The Amiga is able to emulate other computer platforms ranging from many 8-bit systems such as the ": null
    },
    {
        "ZX Spectrum": "Zx Spectrum"
    },
    {
        ", ": null
    },
    {
        "Commodore 64": "Commodore 64"
    },
    {
        ", Nintendo Game Boy, Nintendo Entertainment System, ": null
    },
    {
        "Apple II": "Apple Ii"
    },
    {
        " and the ": null
    },
    {
        "TRS-80": "Trs-80"
    },
    {
        ". The Commodore PC-Transformer software emulated an IBM 5150 at 1  MHz in Monochrome mode. Later PC-Bridgecards were a full hardware PC on a card with 8086/80286/80386 Intel chips running MS-DOS and Windows in an Amiga window. A-Max emulated an Apple Macintosh using a serial port dongle that had a Macintosh ROM on it. The Amiga had the same 68000 CPU as the Macintosh and, using a Macintosh emulator, could run Mac 68K operating systems and programs. The Amiga could not directly read Macintosh 3.5 floppies, however, due to their proprietary format. Further, it required a compatible Macintosh for a copy of its ROM. The Atari ST was also emulated. ": null
    },
    {
        "MAME": "Mame"
    },
    {
        " is also available for Amiga systems with PPC accelerator card upgrades.            In the late 1980s and early 1990s the platform became particularly popular for gaming, ": null
    },
    {
        "demoscene": "Demoscene"
    },
    {
        " activities and creative software uses. During this time commercial developers marketed a wide range of games and creative software, often developing titles simultaneously for the ": null
    },
    {
        "Atari ST": "Atari St"
    },
    {
        " due to the similar hardware architecture. Popular creative software included ": null
    },
    {
        "3D rendering": "3D Computer Graphics Software"
    },
    {
        " packages, ": null
    },
    {
        "bitmap graphics editors": "Raster Graphics Editor"
    },
    {
        ", ": null
    },
    {
        "desktop video": "Desktop Video"
    },
    {
        " software, software development packages and ": null
    },
    {
        "tracker": "Tracker"
    },
    {
        " music editors.     Until the late 1990s the Amiga remained a popular platform for non-commercial software, often developed by enthusiasts, and much of which was freely redistributable. An on-line archive, ": null
    },
    {
        "Aminet": "Aminet"
    },
    {
        ", was created in 1992 and until around 1996 was the largest public archive of software, art and documents for any platform.               The name Amiga was chosen by the developers from the ": null
    },
    {
        "Spanish": "Spanish Language"
    },
    {
        " word for a female friend, because they knew Spanish, and because it occurred before ": null
    },
    {
        "Apple": "Apple Inc."
    },
    {
        " and ": null
    },
    {
        "Atari": "Atari"
    },
    {
        " alphabetically. It also conveyed the message that the Amiga computer line was user friendly as a pun or play on words.     The first official Amiga logo was a rainbow-colored double ": null
    },
    {
        "check mark": "Check Mark"
    },
    {
        ". In later marketing material Commodore largely dropped the checkmark and used logos styled with various typefaces. Although it was never adopted as a ": null
    },
    {
        "trademark": "Trademark"
    },
    {
        " by Commodore, the Boing Ball has been synonymous with Amiga since its launch. It became an unofficial and enduring theme after a visually impressive animated demonstration at the 1984 Winter Consumer Electronics Show in January 1984 showing a checkered ball bouncing and rotating. Following Escoms purchase of Commodore in 1996, the Boing Ball theme was incorporated into a new logo.     Early Commodore advertisements attempted to cast the computer as an all-purpose business machine, though the Amiga was most commercially successful as a home computer. Throughout the 1980s and early 1990s Commodore primarily placed advertising in computer magazines and occasionally in national newspapers and on television.       Since the demise of Commodore, various groups have marketed successors to the original Amiga line:     ": null
    },
    {
        "Genesi": "Genesi"
    },
    {
        " sold PowerPC based hardware under the ": null
    },
    {
        "Pegasos": "Pegasos"
    },
    {
        " brand running AmigaOS and ": null
    },
    {
        "MorphOS": "Morphos"
    },
    {
        ";   ": null
    },
    {
        "Eyetech": "Eyetech"
    },
    {
        " sold PowerPC based hardware under the ": null
    },
    {
        "AmigaOne": "Amigaone"
    },
    {
        " brand from 2002 to 2005 running AmigaOS 4;   Amiga Kit distributes and sells PowerPC based hardware under the ": null
    },
    {
        "AmigaOne": "Amigaone"
    },
    {
        " brand from 2010 to present day running ": null
    },
    {
        "AmigaOS 4": "Amigaos 4"
    },
    {
        ";   ": null
    },
    {
        "ACube Systems": "Acube Systems"
    },
    {
        " sells the AmigaOS 3 compatible ": null
    },
    {
        "Minimig": "Minimig"
    },
    {
        " system with a Freescale MC68SEC000 CPU and AmigaOS 4 compatible ": null
    },
    {
        "Sam440": "Sam440Ep"
    },
    {
        " / ": null
    },
    {
        "Sam460": "Sam460Ex"
    },
    {
        " / AmigaOne 500 systems with PowerPC processors;   A-EON Technology Ltd sells the AmigaOS 4 compatible ": null
    },
    {
        "AmigaOne X1000": "Amigaone X1000"
    },
    {
        " system with P.A. Semi ": null
    },
    {
        "PWRficient": "Pwrficient"
    },
    {
        " PA6T-1682M processor.   Amiga Kit Amiga Store, Vesalia Computer and AMIGAstore.eu sell numerous items from aftermarket components to refurbished classic systems.     AmigaOS and MorphOS are commercial proprietary operating systems. AmigaOS 4, based on AmigaOS 3.1 source code with some parts of version 3.9, is developed by ": null
    },
    {
        "Hyperion Entertainment": "Hyperion Entertainment"
    },
    {
        " and runs on PowerPC based hardware. MorphOS, based on some parts of AROS source code, is developed by MorphOS Team and is continued on ": null
    },
    {
        "Apple": "Apple Inc."
    },
    {
        " and other PowerPC based hardware.     There is also ": null
    },
    {
        "AROS": "Aros Research Operating System"
    },
    {
        ", a free and open source operating system , for Amiga 68k, x86 and ARM hardware . In particular, AROS for Amiga 68k hardware aims to create an open source Kickstart ROM replacement for emulation purpose and/or for use on real classic hardware.       After Commodore went bankrupt in 1994, an active Amiga community continued to support the platform long after mainstream commercial vendors abandoned it. The most popular Amiga magazine,  Amiga Format , continued to publish editions until 2000, some six years after Commodore filed for bankruptcy. Another magazine,  Amiga Active , was launched in 1999 and was published until 2001. In spite of declining interest in the platform, there was a bi-weekly specialist column in the UK weekly magazine  Micro Mart .     Several notable magazines are in publication today: Amiga Future, which is available in both English and German; Bitplane.it, a bi-monthly magazine in Italian; and AmigaPower, a long-running French magazine.     Online Amiga magazines still exists like , a French publication available since 1997.            The Amiga series of computers found a place in early computer graphic design and television presentation. Below are some examples of notable uses and users:   Season 1 and part of season 2 of the television series  Babylon 5  were rendered in LightWave 3D on Amigas. Other television series using Amigas for special effects included  SeaQuest DSV  and  Max Headroom .     In addition, many other celebrities and notable individuals have made use of the Amiga:     ": null
    },
    {
        "Andy Warhol": "Andy Warhol"
    },
    {
        " was an early user of the Amiga and appeared at the launch, where he made a computer artwork of ": null
    },
    {
        "Debbie Harry": "Debbie Harry"
    },
    {
        ". Warhol used the Amiga to create a new style of art made with computers, and was the author of a multimedia opera called  You Are the One , which consists of an animated sequence featuring images of actress ": null
    },
    {
        "Marilyn Monroe": "Marilyn Monroe"
    },
    {
        " assembled in a short movie with a soundtrack. The video was discovered on two old Amiga floppies in a drawer in Warhols studio and repaired in 2006 by the Detroit ": null
    },
    {
        "Museum of New Art": "Museum Of New Art"
    },
    {
        ". The pop artist has been quoted as saying:  The thing I like most about doing this kind of work on the Amiga is that it looks like my work in other media .   Artist ": null
    },
    {
        "Jean Moebius Giraud": "Jean Giraud"
    },
    {
        " credits the Amiga he bought for his son as a bridge to learning about using paint box programs . He uploaded some of his early experiments to the file sharing forums on ": null
    },
    {
        "CompuServe": "Compuserve"
    },
    {
        ".   The ": null
    },
    {
        " Weird Al Yankovic": "Weird Al   Yankovic"
    },
    {
        " film  UHF  contains a computer animated music video parody of the ": null
    },
    {
        "Dire Straits": "Dire Straits"
    },
    {
        " song ": null
    },
    {
        "Money for Nothing": "Money For Nothing"
    },
    {
        " , titled ": null
    },
    {
        "Money for Nothing/Beverly Hillbillies": "Money For Nothing/Beverly Hillbillies"
    },
    {
        " . According to the DVD commentary track, this spoof was created on an Amiga home computer.   ": null
    },
    {
        "Rolf Harris": "Rolf Harris"
    },
    {
        " used an Amiga to digitize his hand-drawn art work for animation on his television series, Rolfs Cartoon Club.   ": null
    },
    {
        "Todd Rundgrens": "Todd Rundgren"
    },
    {
        "video Change Myself was produced with Toaster and Lightwave.   Scottish pop artist ": null
    },
    {
        "Calvin Harris": "Calvin Harris"
    },
    {
        " composed his 2007 debut album  I Created Disco  with an ": null
    },
    {
        "Amiga 1200": "Amiga 1200"
    },
    {
        ".   ": null
    },
    {
        "Susumu Hirasawa": "Susumu Hirasawa"
    },
    {
        ", a ": null
    },
    {
        "Japan": "Japan"
    },
    {
        "ese ": null
    },
    {
        "progressive": "Progressive Rock"
    },
    {
        "-": null
    },
    {
        "electronic": "Electronic Music"
    },
    {
        " artist": "Artist"
    },
    {
        " is known for using Amigas to compose and perform music, aid his live shows and make his promotional videos. He has also been inspired by the Amiga, and has referenced it in his lyrics. His December 13, 1994 Adios Jay Interactive Live Show was dedicated to Jay Miner. He also used the Amiga to create the virtual drummer TAINACO, who was a CG rendered figure whose performance was made with Elan Performer and was projected with DCTV. He also composed and performed Eastern-boot , the AmigaOS 4 boot jingle.   Electronic musician ": null
    },
    {
        "Max Tundra": "Max Tundra"
    },
    {
        " created his three albums with an Amiga 500.   ": null
    },
    {
        "Bob Casale": "Bob Casale"
    },
    {
        ", keyboardist and guitarist of the ": null
    },
    {
        "new wave": "New Wave Music"
    },
    {
        " band ": null
    },
    {
        "Devo": "Devo"
    },
    {
        " used Amiga computer graphics on the album cover to Devos album  Total Devo  ": null
    },
    {
        "Pokémon Gold and Silvers": "Pokémon Gold And Silver"
    },
    {
        "music was created on an Amiga computer, converted to MIDI, and then reconverted to the games music format.        The Amiga was also used in a number of special purpose applications:   Amigas were used in various ": null
    },
    {
        "NASA": "Nasa"
    },
    {
        " laboratories to keep track of low orbiting satellites, and were still used until 2004 . Amigas were used at Kennedy Space Center to run strip-chart recorders, to format and display data, and control stations of platforms for ": null
    },
    {
        "Delta rocket": "Delta"
    },
    {
        " launches.   ": null
    },
    {
        "Palomar Observatory": "Palomar Observatory"
    },
    {
        " used Amigas to calibrate and control the ": null
    },
    {
        "CCDs": "Charge-Coupled Device"
    },
    {
        " in their telescopes, as well as to display and store the digitized images they collected.    ": null
    },
    {
        "London Transport Museum": "London Transport Museum"
    },
    {
        " developed their own interactive multi-media software for the CD32. The software included a walkthrough of various exhibits and a virtual tour of the museum.   Amiga 500 motherboards were used, in conjunction with a ": null
    },
    {
        "LaserDisc": "Laserdisc"
    },
    {
        " player and ": null
    },
    {
        "genlock": "Genlock"
    },
    {
        " device, in arcade games manufactured by ": null
    },
    {
        "American Laser Games": "American Laser Games"
    },
    {
        ".   A custom ": null
    },
    {
        "Amiga 4000T": "Amiga 4000T"
    },
    {
        " motherboard was used in the HDI 1000 medical ultrasound system built by Advanced Technology Labs .   Four Amiga 2000s were used from 1988 to 1991 to develop the digital displays panels installed in the M1-A2 Abrams Main Battle Tank built by General Dynamics Land Systems. In the General Dynamics Simulation Laboratory, the Amigas interfaced with a central simulation environment computer and produced graphics for the display panels. During demonstrations at Fort Knox, the Amigas did not interact with each other, but instead operated in remote mode because the simulation environment computer was not portable.   , the Grand Rapids Public School district still uses a Commodore Amiga 2000 computer, complete with 1200 baud modem, to automate its air conditioning and heating systems for the 19 schools covered by the GRPS district. The system controls the start/stop of boilers, the start/stop of fans, pumps, monitors space temperatures, and so on. The system has been running day and night for decades.     Amiga models, generally 1000s and 2000s, were utilized by the ": null
    },
    {
        "Prevue Guide": "Pop"
    },
    {
        " , a specialized cable network designed to provide TV listings. Though its history stretched back to 1981, the Prevue Guide did not start using Amigas on a wide-scale basis until the late 1980s. Amigas were used to generate program listings locally at the headend office, while a C-band satellite feed provided promotional material for cable networks . Amigas were also used to power the ": null
    },
    {
        "pay-per-view": "Pay-Per-View"
    },
    {
        " centric sister service Sneak Prevue in conjunction with laserdiscs and a C-band feed. Eventually, Prevue was relaunched in 1999 as the TV Guide Channel and due to Commodores bankruptcy and the general outmodedness of the Amiga platform, the Amigas were phased out in favor of custom-built Windows NT computers instead. ": null
    },
    {
        "The Weather Network": "The Weather Network"
    },
    {
        " used Amigas to display the weather on TV. Sometimes when watching, one would witness a ": null
    },
    {
        "Guru Meditation": "Guru Meditation"
    },
    {
        ".": null
    }
]