[
    {
        "In ": null
    },
    {
        "electronics": "Electronics"
    },
    {
        ", the figures of merit of an ": null
    },
    {
        "amplifier": "Amplifier"
    },
    {
        " are numerical measures that characterize its properties and performance. ": null
    },
    {
        "Figures of merit": "Figures Of Merit"
    },
    {
        " can be given as a list of ": null
    },
    {
        "specifications": "Specification"
    },
    {
        " that include properties such as ": null
    },
    {
        "gain": "Gain"
    },
    {
        ", ": null
    },
    {
        "bandwidth": "Bandwidth"
    },
    {
        ", ": null
    },
    {
        "noise": "Noise"
    },
    {
        " and ": null
    },
    {
        "linearity": "Nonlinear System"
    },
    {
        ", among others listed in this article. Figures of merit are important for determining the suitability of a particular amplifier for an intended use.       The ": null
    },
    {
        "gain": "Gain"
    },
    {
        " of an amplifier is the ratio of output to input power or amplitude, and is usually measured in ": null
    },
    {
        "decibels": "Decibel"
    },
    {
        ". When measured in decibels it is ": null
    },
    {
        "logarithm": "Logarithm"
    },
    {
        "ically related to the power ratio: G10 log. ": null
    },
    {
        "RF": "Radio Frequency"
    },
    {
        " amplifiers are often specified in terms of the maximum power gain obtainable, while the ": null
    },
    {
        "voltage": "Voltage"
    },
    {
        " gain of audio amplifiers and ": null
    },
    {
        "instrumentation amplifiers": "Instrumentation Amplifier"
    },
    {
        " will be more often specified. For example, an audio amplifier with a gain given as 20  dB will have a voltage gain of ten.     The use of voltage gain figure is appropriate when the amplifiers ": null
    },
    {
        "input impedance": "Input Impedance"
    },
    {
        " is much higher than the source impedance, and the load impedance higher than the amplifiers output impedance.     If two equivalent amplifiers are being compared, the amplifier with higher gain settings would be more sensitive as it would take less input signal to produce a given amount of power.        The ": null
    },
    {
        "bandwidth": "Bandwidth"
    },
    {
        " of an amplifier is the range of frequencies for which the amplifier gives satisfactory performance . The definition of satisfactory performance may be different for different applications. However, a common and well-accepted metric is the ": null
    },
    {
        "half-power points": "Half-Power Point"
    },
    {
        " on the output vs. frequency curve. Therefore, bandwidth can be defined as the difference between the lower and upper half power points. This is therefore also known as the  bandwidth. Bandwidths for other response tolerances are sometimes quoted  or plus or minus 1dB .     The gain of a good quality full-range audio amplifier will be essentially flat between 20  Hz to about 20  kHz . In ultra-high-fidelity amplifier design, the amplifiers frequency response should extend considerably beyond this  and might have  points . Professional touring amplifiers often have input and/or output filtering to sharply limit frequency response beyond ; too much of the amplifiers potential output power would otherwise be wasted on ": null
    },
    {
        "infrasonic": "Infrasonic"
    },
    {
        " and ": null
    },
    {
        "ultrasonic": "Ultrasound"
    },
    {
        " frequencies, and the danger of AM ": null
    },
    {
        "radio interference": "Radio Interference"
    },
    {
        " would increase. Modern ": null
    },
    {
        "switching amplifiers": "Switching Amplifier"
    },
    {
        " need steep ": null
    },
    {
        "low pass filtering": "Low-Pass Filter"
    },
    {
        " at the output to get rid of high-frequency switching noise and ": null
    },
    {
        "harmonics": "Harmonic"
    },
    {
        ".     The range of frequency over which the gain is equal to or greater than 70.7% of its maximum gain is termed as bandwidth.        Efficiency is a measure of how much of the power source is usefully applied to the amplifiers output. ": null
    },
    {
        "Class A": "Electronic Amplifierpower Amplifier Classes"
    },
    {
        " amplifiers are very inefficient, in the range of 10–20% with a max efficiency of 25% for ": null
    },
    {
        "direct coupling": "Direct Coupling"
    },
    {
        " of the output. ": null
    },
    {
        "Inductive coupling": "Inductive Coupling"
    },
    {
        " of the output can raise their efficiency to a maximum of 50%.     Drain efficiency is the ratio of output RF power to input DC power when primary input DC power has been fed to the drain of a ": null
    },
    {
        "field-effect transistor": "Field-Effect Transistor"
    },
    {
        ". Based on this definition, the drain efficiency cannot exceed 25% for a class A amplifier that is supplied drain bias current through resistors . Manufacturers specify much higher drain efficiencies, and designers are able to obtain higher efficiencies by providing current to the drain of the transistor through an inductor or a transformer winding. In this case the RF zero level is near the DC rail and will swing both above and below the rail during operation. While the voltage level is above the DC rail current is supplied by the inductor.     Class B amplifiers have a very high efficiency but are impractical for audio work because of high levels of distortion . In practical design, the result of a tradeoff is the class AB design. Modern Class AB amplifiers commonly have peak efficiencies between 30–55% in audio systems and 50-70% in radio frequency systems with a theoretical maximum of 78.5%.     Commercially available Class D ": null
    },
    {
        "switching amplifiers": "Switching Amplifier"
    },
    {
        " have reported efficiencies as high as 90%. Amplifiers of Class C-F are usually known to be very high-efficiency amplifiers. RCA manufactured an AM broadcast transmitter employing a single class-C low-mu triode with an RF efficiency in the 90% range.     More efficient amplifiers run cooler, and often do not need any cooling fans even in multi-kilowatt designs. The reason for this is that the loss of efficiency produces heat as a by-product of the energy lost during the conversion of power. In more efficient amplifiers there is less loss of energy so in turn less heat.     In RF linear Power Amplifiers, such as cellular base stations and broadcast transmitters, special design techniques can be used to improve efficiency. Doherty designs, which use a second output stage as a peak amplifier, can lift efficiency from the typical 15% up to 30-35% in a narrow bandwidth. Envelope Tracking designs are able to achieve efficiencies of up to 60%, by modulating the supply voltage to the amplifier in line with the envelope of the signal.      ": null
    },
    {
        "distortion": "Distortion"
    },
    {
        ".     In most amplifiers a reduction in gain takes place before hard clipping occurs; the result is a compression effect, which sounds much less unpleasant to the ear. For these amplifiers, the 1  dB compression point is defined as the input power where the gain is 1  dB less than the small signal gain. Sometimes this non linearity is deliberately designed in to reduce the audible unpleasantness of hard clipping under overload.     Ill effects of non-linearity can be reduced with negative feedback.     ": null
    },
    {
        "Linearization": "Linearization"
    },
    {
        " is an emergent field, and there are many techniques, such as ": null
    },
    {
        "feed forward": "Feed Forward"
    },
    {
        ", ": null
    },
    {
        "predistortion": "Predistortion"
    },
    {
        ", postdistortion, in order to avoid the undesired effects of the non-linearities.       This is a measure of how much ": null
    },
    {
        "noise": "Noise"
    },
    {
        " is introduced in the amplification process. Noise is an undesirable but inevitable product of the electronic devices and components; also, much noise results from intentional economies of manufacture and design time. The metric for noise performance of a circuit is ": null
    },
    {
        "noise figure": "Noise Figure"
    },
    {
        " or noise factor. Noise figure is a comparison between the output signal to noise ratio and the thermal noise of the input signal.       Output ": null
    },
    {
        "dynamic range": "Dynamic Range"
    },
    {
        " is the range, usually given in dB, between the smallest and largest useful output levels. The lowest useful level is limited by output ": null
    },
    {
        "noise": "Noise"
    },
    {
        ", while the largest is limited most often by distortion. The ratio of these two is quoted as the amplifier dynamic range. More precisely, if S maximal allowed signal power and N noise power, the dynamic range DR is DR /N.          In many switched mode amplifiers, dynamic range is limited by the minimum output step size.       ": null
    },
    {
        "Slew rate": "Slew Rate"
    },
    {
        " is the maximum rate of change of the output, usually quoted in volts per second . Many amplifiers are ultimately ": null
    },
    {
        "slew rate": "Slew Rate"
    },
    {
        " limited , which sometimes limits the full ": null
    },
    {
        "power bandwidth": "Power Bandwidth"
    },
    {
        " to frequencies well below the amplifiers small-signal frequency response.       The ": null
    },
    {
        "rise time": "Rise Time"
    },
    {
        ", t r , of an amplifier is the time taken for the output to change from 10% to 90% of its final level when driven by a ": null
    },
    {
        "step input": "Step Response"
    },
    {
        ".   For a ": null
    },
    {
        "Gaussian": "Gaussian"
    },
    {
        " response system , the rise time is approximated by:     t r BW 0.35, where t r is rise time in ": null
    },
    {
        "seconds": "Second"
    },
    {
        " and BW is bandwidth in ": null
    },
    {
        "Hz": "Hertz"
    },
    {
        ".       The time taken for the output to settle to within a certain percentage of the final value is called the ": null
    },
    {
        "settling time": "Settling Time"
    },
    {
        ", and is usually specified for oscilloscope vertical amplifiers and high-accuracy measurement systems. ": null
    },
    {
        "Ringing": "Ringing"
    },
    {
        " refers to an output variation that cycles above and below an amplifiers final value and leads to a delay in reaching a stable output. Ringing is the result of overshoot caused by an DampingUnder-damping ": null
    }
]