[
    {
        "        Saint Angilbert , sometimes known as Angilberk or Engelbert, was a noble ": null
    },
    {
        "Frankish": "Franks"
    },
    {
        " poet who was educated under ": null
    },
    {
        "Alcuin": "Alcuin"
    },
    {
        " and served ": null
    },
    {
        "Charlemagne": "Charlemagne"
    },
    {
        " as a secretary, diplomat, and son-in-law. He was venerated as a ": null
    },
    {
        "pre-Congregation": "Pre-Congregation"
    },
    {
        " saint": "Saint"
    },
    {
        " and is still honored on the day of his death, 18 February.       Angilbert seems to have been brought up at the court of Charlemagne at the palace school in Aquae Grani . He was educated there as the pupil and then friend of the great English scholar Alcuin. When Charlemagne sent his young son ": null
    },
    {
        "Pepin": "Pepin Of Italy"
    },
    {
        " to Italy as King of the ": null
    },
    {
        "Lombards": "Lombards"
    },
    {
        " Angilbert went along as primicerius palatii, a high administrator of the satellite court. As the friend and adviser of Pepin, he assisted for a while in the government of Italy. Angilbert delivered the document on ": null
    },
    {
        "Iconoclasm": "Byzantine Iconoclasm"
    },
    {
        " from the Frankish Synod of Frankfurt to ": null
    },
    {
        "Pope Adrian I": "Pope Adrian I"
    },
    {
        ", and was later sent on three important embassies to the pope, in 792, 794, and 796. At one time, he served an officer of the maritime provinces. He accompanied Charlemagne to Rome in 800 and was one of the ": null
    },
    {
        "witnesses to his will in 811": "Testament Of Charlemagne"
    },
    {
        ".     There are various traditions concerning Angilberts relationship with ": null
    },
    {
        "Bertha, daughter of Charlemagne": "Bertha, Daughter Of Charlemagne"
    },
    {
        ". One holds that they were married, another that they were not. They had, however, at least two sons and one daughter, one of whom, ": null
    },
    {
        "Nithard": "Nithard"
    },
    {
        ", became a notable figure in the mid-9th century, and the daughter Bertha, went on to marry Helgaud II, count of Ponthieu. Control of marriage and the meanings of legitimacy were hotly contested in the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ". Bertha and Angilbert are an example of how resistance to the idea of a sacramental marriage could coincide with holding church offices. On the other hand, some historians have speculated that Charlemagne opposed formal marriages for his daughters out of concern for political rivalries from their potential husbands; none of Charlemagnes daughters were married, despite political offers of arranged marriages.     In 790, Angilbert retired to the abbey of Centulum, the Monastery of St Richarius  at present-day ": null
    },
    {
        "Saint-Riquier": "Saint-Riquier"
    },
    {
        " in ": null
    },
    {
        "Picardy": "Picardy"
    },
    {
        ". Elected ": null
    },
    {
        "abbot": "Abbot"
    },
    {
        " in 794, he rebuilt the monastery and endowed it with a library of 200 volumes. It was not uncommon for the ": null
    },
    {
        "Merovingian": "Merovingian"
    },
    {
        ", ": null
    },
    {
        "Carolingian": "Carolingian"
    },
    {
        ", or later kings to make laymen abbots of monasteries; the layman would often use the income of the monastery as his own and leave the monks a bare minimum for the necessary expenses of the foundation. Angilbert, in contrast, spent a great deal rebuilding Saint-Riquier; when he completed it, Charlemagne spent Easter of the year 800 there. In keeping with Carolingian policies, Angilbert established a school at Saint-Riquier to educate the local boys.     Angilberts Latin poems reveal the culture and tastes of a man of the world, enjoying the closest intimacy with the imperial family. Charlemagne and the other men at court were known by affectionate and jesting nicknames. Charlemagne was referred to as David , a reference to the Biblical king ": null
    },
    {
        "David": "David"
    },
    {
        ". Angilbert was nicknamed ": null
    },
    {
        "Homer": "Homer"
    },
    {
        " because he wrote poetry, and was the probable author of an ": null
    },
    {
        "epic": "Epic Poetry"
    },
    {
        ", of which the fragment which has been preserved describes the life at the palace and the meeting between Charlemagne and Leo III. It is a mosaic from ": null
    },
    {
        "Virgil": "Virgil"
    },
    {
        ", ": null
    },
    {
        "Ovid": "Ovid"
    },
    {
        ", ": null
    },
    {
        "Lucan": "Lucan"
    },
    {
        " and ": null
    },
    {
        "Venantius Fortunatus": "Venantius Fortunatus"
    },
    {
        ", composed in the manner of Einhards use of Suetonius. Of the shorter poems, besides the greeting to Pippin on his return from the campaign against the ": null
    },
    {
        "Avars": "Pannonian Avars"
    },
    {
        " , an epistle to David incidentally reveals a delightful picture of the poet living with his children in a house surrounded by pleasant gardens near the emperors palace. The reference to Bertha, however, is distant and respectful, her name occurring merely on the list of princesses to whom he sends his salutation.       Angilberts poems were published by ": null
    },
    {
        "Ernst Dümmler": "Ernst Dümmler"
    },
    {
        " in the  Monumenta Germaniae Historica . For criticisms of this edition, see ": null
    },
    {
        "Ludwig Traube": "Ludwig Traube"
    },
    {
        " in Max Roedigers Schriften für germanische Philologie .       ": null
    }
]