[
    {
        "          Baldassarre Cossa was ": null
    },
    {
        "Pisan": "Council Of Pisa"
    },
    {
        " antipope": "Antipope"
    },
    {
        " John XXIII during the ": null
    },
    {
        "Western Schism": "Western Schism"
    },
    {
        ". The Catholic Church regards him as an ": null
    },
    {
        "antipope": "Antipope"
    },
    {
        ", as he opposed ": null
    },
    {
        "Pope Gregory XII": "Pope Gregory Xii"
    },
    {
        " whom the Catholic Church now recognizes as the rightful successor of Saint Peter.     Cossa was born in the ": null
    },
    {
        "Kingdom of Naples": "Kingdom Of Naples"
    },
    {
        ". In 1403, he served as a ": null
    },
    {
        "papal legate": "Papal Legate"
    },
    {
        " in Romagna. He participated in the ": null
    },
    {
        "Council of Pisa": "Council Of Pisa"
    },
    {
        " in 1408, which sought to end the Western Schism with the election of a third alternate pope. In 1410, he succeeded ": null
    },
    {
        "Antipope Alexander V": "Antipope Alexander V"
    },
    {
        ", taking the name John XXIII. At the instigation of ": null
    },
    {
        "Sigismund, King of the Romans": "Sigismund, Holy Roman Emperor"
    },
    {
        ", Pope John called the ": null
    },
    {
        "Council of Constance": "Council Of Constance"
    },
    {
        " of 1413, deposed John XXIII and Benedict XIII, accepted Gregory XIIs resignation, and elected ": null
    },
    {
        "Pope Martin V": "Pope Martin V"
    },
    {
        " to replace them, thus ending the schism. John XXIII was tried for various crimes, though later accounts question the veracity of those accusations.       Baldassarre Cossa was born on the island of ": null
    },
    {
        "Procida": "Procida"
    },
    {
        " in the ": null
    },
    {
        "Kingdom of Naples": "Kingdom Of Naples"
    },
    {
        " to the family of Giovanni Cossa, lord of Procida. Initially he followed a military career, taking part in the ": null
    },
    {
        "Angevin-Neapolitan war": "Kingdom Of Naples"
    },
    {
        ". His two brothers were sentenced to death for ": null
    },
    {
        "piracy": "Piracy"
    },
    {
        " by ": null
    },
    {
        "Ladislaus of Naples": "Ladislaus Of Naples"
    },
    {
        ".      He studied law at the ": null
    },
    {
        "University of Bologna": "University Of Bologna"
    },
    {
        " and obtained doctorates in both civil and canon law. Probably at the prompting of his family, in 1392 he entered the service of ": null
    },
    {
        "Pope Boniface IX": "Pope Boniface Ix"
    },
    {
        ", first working in Bologna and then in Rome.  In 1386 he is listed as canon of the cathedral of Bologna. In 1396, he became archdeacon in Bologna. He became ": null
    },
    {
        "Cardinal deacon": "Cardinal Cardinal Deacon"
    },
    {
        " of Saint Eustachius in 1402 and ": null
    },
    {
        "Papal legate": "Papal Legate"
    },
    {
        " in ": null
    },
    {
        "Romagna": "Romagna"
    },
    {
        " in 1403. ": null
    },
    {
        "Johann Peter Kirsch": "Johann Peter Kirsch"
    },
    {
        " describes Cossa as utterly worldly-minded, ambitious, crafty, unscrupulous, and immoral, a good soldier but no churchman .  Vol. 8. New York: Robert Appleton Company, 1910. 2 January 2016 At this time Cossa also had some links with local robber bands, which were often used to intimidate his rivals and attack carriages. These connections added to his influence and power in the region.           Cardinal Cossa was one of the seven ": null
    },
    {
        "cardinals": "Cardinal"
    },
    {
        " who, in May 1408, withdrew their allegiance from ": null
    },
    {
        "Pope Gregory XII": "Pope Gregory Xii"
    },
    {
        ", stating that he had broken his solemn oath not to create new cardinals without consulting them in advance. In company with those cardinals who had been following ": null
    },
    {
        "Antipope Benedict XIII": "Antipope Benedict Xiii"
    },
    {
        " of Avignon, they convened the ": null
    },
    {
        "Council of Pisa": "Council Of Pisa"
    },
    {
        ", of which Cossa became a leading figure. The aim of the council was to end the schism; to this end they deposed both Gregory XII and Benedict XIII and elected a new pope ": null
    },
    {
        "Alexander V": "Antipope Alexander V"
    },
    {
        " in 1409. Gregory and Benedict ignored this decision, however, so that there were now three simultaneous claimants to the ": null
    },
    {
        "papacy": "Papacy"
    },
    {
        ".       Alexander V died soon after, and on 25 May 1410 Cossa was consecrated a bishop, taking the name John XXIII. He had become an ": null
    },
    {
        "ordained priest": "Priesthood"
    },
    {
        " only one day earlier. John XXIII was acknowledged as pope by ": null
    },
    {
        "France": "Kingdom Of France"
    },
    {
        ", ": null
    },
    {
        "England": "Kingdom Of England"
    },
    {
        ", ": null
    },
    {
        "Bohemia": "Kingdom Of Bohemia"
    },
    {
        ", ": null
    },
    {
        "Portugal": "Kingdom Of Portugal"
    },
    {
        ", parts of the ": null
    },
    {
        "Holy Roman Empire": "Holy Roman Empire"
    },
    {
        ", and numerous Northern Italian city states, including Florence and ": null
    },
    {
        "Venice": "Republic Of Venice"
    },
    {
        " and the ": null
    },
    {
        "Patriarchate of Aquileia": "Patriarchate Of Aquileia"
    },
    {
        "; however, the Avignon Pope Benedict XIII was regarded as pope by the ": null
    },
    {
        "Kingdoms of Aragon": "Kingdom Of Aragon"
    },
    {
        ", ": null
    },
    {
        "Castile": "Kingdom Of Castile"
    },
    {
        ", ": null
    },
    {
        "Sicily": "Kingdom Of Sicily"
    },
    {
        " and ": null
    },
    {
        "Scotland": "Kingdom Of Scotland"
    },
    {
        " and Gregory XII was still favored by ": null
    },
    {
        "Ladislaus of Naples": "Ladislaus Of Naples"
    },
    {
        ", ": null
    },
    {
        "Carlo I Malatesta": "Carlo I Malatesta"
    },
    {
        ", the ": null
    },
    {
        "princes of Bavaria": "List Of Rulers Of Bavaria"
    },
    {
        ", ": null
    },
    {
        "Louis III": "Louis Iii, Elector Palatine"
    },
    {
        ", ": null
    },
    {
        "Elector Palatine": "Electorate Of The Palatinate"
    },
    {
        ", and parts of Germany and ": null
    },
    {
        "Poland": "Kingdom Of Poland"
    },
    {
        ". Lightbown, R.W. Donatello & Michelozzo. London: Harvey Miller. pp. 4–5. John XXIII made the ": null
    },
    {
        "Medici Bank": "Medici Bank"
    },
    {
        " the bank of the papacy, contributing considerably to the familys wealth and prestige.      The main enemy of John was ": null
    },
    {
        "Ladislaus of Naples": "Ladislaus Of Naples"
    },
    {
        ", who protected Gregory XII in Rome. Following his election as pope, John spent a year in Bologna and then joined forces with ": null
    },
    {
        "Louis II of Anjou": "Louis Ii Of Anjou"
    },
    {
        " to march against Ladislaus. An initial victory proved short-lived and Ladislaus retook Rome in May 1413, forcing John to flee to Florence. In Florence he met ": null
    },
    {
        "Sigismund": "Sigismund, Holy Roman Emperor"
    },
    {
        ", King of the Romans. Sigismund wanted to end the schism and urged John to call a general council. John did so with hesitation, at first trying to have the council held in Italy . The ": null
    },
    {
        "Council of Constance": "Council Of Constance"
    },
    {
        " was convened on 30 October 1413. During the third session, rival ": null
    },
    {
        "Pope Gregory XII": "Pope Gregory Xii"
    },
    {
        " authorized the council as well. The council resolved that all three popes should abdicate and a new pope be elected.        In March, John escaped from Constance disguised as a postman. According to the Klingenberger Chronicle, written by a noble client of ": null
    },
    {
        "Frederick IV, Duke of Austria": "Frederick Iv, Duke Of Austria"
    },
    {
        ", John XXIII travelled down the Rhine to Schaffhausen in a boat, while Frederick accompanied him with a small band of men on horseback. There was a huge outcry in Constance when it was discovered that John had fled, and Sigismund was furious about this setback to his plans for ending the Schism. The King of the Romans issued orders to all the powers on the Upper Rhine and in Swabia stating that he had declared Frederick to be an outlaw and that his lands and possessions were forfeit. In due course this led to a great deal of political upheaval and many Austrian losses in the region, notably in ": null
    },
    {
        "Aargau": "Aargau"
    },
    {
        " to the ": null
    },
    {
        "Swiss Confederation": "Swiss Confederation"
    },
    {
        ".     In the meantime, Pope John XXIII and Frederick fled further downriver along the Rhine to the town of ": null
    },
    {
        "Freiburg im Breisgau": "Freiburg Im Breisgau"
    },
    {
        ", which recognised the duke of Austria as its lord. There Sigismunds lieutenant ": null
    },
    {
        "Ludwig III, Elector Palatine": "Ludwig Iii, Elector Palatine"
    },
    {
        " caught up with them. He convinced Frederick that he stood to lose too much by harbouring the fugitive pope, and the Austrian duke agreed to give himself and John up and return to Constance. Brandmüller, Walter. Das Konzil von Konstanz, 1414–1418        During his absence John was deposed by the council, and upon his return he was tried for heresy, simony, schism and immorality, and found guilty on all counts. ": null
    },
    {
        "Gibbon": "Edward Gibbon"
    },
    {
        " wrote, The more scandalous charges were suppressed; the vicar of Christ was accused only of piracy, rape, sodomy, murder and incest. Gibbon, Edward. The Decline and Fall of the Roman Empire, New York: The Heritage Press, 1946, vol. 3, p. 2417 John was given over to ": null
    },
    {
        "Ludwig III, Elector Palatine": "Ludwig Iii, Elector Palatine"
    },
    {
        ", who imprisoned him for several months in ": null
    },
    {
        "Heidelberg": "Heidelberg"
    },
    {
        " and ": null
    },
    {
        "Mannheim": "Mannheim"
    },
    {
        ".   The last remaining claimant in Avignon, ": null
    },
    {
        "Benedict XIII": "Antipope Benedict Xiii"
    },
    {
        ", refused to resign and was excommunicated. ": null
    },
    {
        "Martin V": "Pope Martin V"
    },
    {
        " was elected as new pope in 1417.            Cossa was again imprisoned in Germany. He was freed in 1418 after a heavy ransom was paid by the Medici. He went to Florence, where he submitted to Martin V, who made him ": null
    },
    {
        "Cardinal Bishop of Frascati": "Cardinal Bishop Of Frascati"
    },
    {
        ". Cossa died only a few months later.     The Medici oversaw the construction of ": null
    },
    {
        "his magnificent tomb": "Tomb Of Antipope John Xxiii"
    },
    {
        " by ": null
    },
    {
        "Donatello": "Donatello"
    },
    {
        " and ": null
    },
    {
        "Michelozzo": "Michelozzo"
    },
    {
        " in the ": null
    },
    {
        "Battistero di San Giovanni": "Battistero Di San Giovanni"
    },
    {
        " in Florence. Pope Martin V protested in vain against the inscription on the sarcophagus: John the former pope .     J.P. Kirsch remarks that Undeniably secular and ambitious, his moral life was not above reproach, and his unscrupulous methods in no wise accorded with the requirements of his high office  ... the heinous crimes of which his opponents in the council accused him were certainly gravely exaggerated. One historian concluded that John was a great man in temporal things, but a complete failure and worthless in spiritual things .       John is portrayed by ": null
    },
    {
        "Steven Waddington": "Steven Waddington"
    },
    {
        " in the 2016 television series  Medici: Masters of Florence .    John is also a main character in  A Trembling Upon Rome  by ": null
    },
    {
        "Richard Condon": "Richard Condon"
    },
    {
        ".     The 1932 thriller ‘Safe Custody’ by ": null
    },
    {
        "Dornford Yates": "Dornford Yates"
    },
    {
        ", references John. Listing the members of an objectionable family, a character in the story says:     “Then we come to his nephew—a promising lad of fifteen. He lies, steals, smells, assaults the servants and abuses any animal which he is satisfied will not retaliate. If Gibbon may be believed, Pope John the Twenty-third as a stripling must have resembled him.”          He should not be confused with ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        " of the twentieth century. When ": null
    },
    {
        "Angelo Roncalli": "Pope John Xxiii"
    },
    {
        " was elected pope in 1958, there was some confusion as to whether he would be John XXIII or John XXIV; he then declared that he was John XXIII to put this question to rest. There was no ": null
    },
    {
        "John XX": "Pope John Xx"
    }
]