[
    {
        "              The   is the ": null
    },
    {
        "Irish": "Ireland"
    },
    {
        " term for a ": null
    },
    {
        "supernatural": "Supernatural"
    },
    {
        " race in ": null
    },
    {
        "Irish mythology": "Irish Mythology"
    },
    {
        " and ": null
    },
    {
        "Scottish mythology": "Scottish Mythology"
    },
    {
        " , comparable to the ": null
    },
    {
        "fairies": "Fairy"
    },
    {
        " or ": null
    },
    {
        "elves": "Elf"
    },
    {
        ". They are said to live underground in fairy mounds, across the western sea, or in an invisible world that coexists with the world of humans. This world is described in the  Lebor Gabála Érenn  as a ": null
    },
    {
        "parallel universe": "Parallel Universe"
    },
    {
        " in which the aos sí walk amongst the living. In the ": null
    },
    {
        "Irish language": "Irish Language"
    },
    {
        ", aos sí means people of the mounds . In modern Irish the people of the mounds are also called daoine sídhe ; in Scottish mythology they are daoine sìth. James MacKillop, A Dictionary of Celtic Mythology , s.v. daoine sídhe. They are variously said to be the ancestors, the spirits of nature, or goddesses and gods. ": null
    },
    {
        "Evans Wentz, W. Y.": "Walter Evans-Wentz"
    },
    {
        " . Gerrards Cross, Colin Smythe Humanities Press      Some ": null
    },
    {
        "secondary": "Secondary Source"
    },
    {
        " and ": null
    },
    {
        "tertiary sources": "Tertiary Source"
    },
    {
        ", including well-known and influential authors such as ": null
    },
    {
        "W. B. Yeats": "W. B. Yeats"
    },
    {
        ", refer to aos sí simply as the sídhe .        In many ": null
    },
    {
        "Gael": "Gael"
    },
    {
        "ic tales, the aos sí are later, literary versions of the ": null
    },
    {
        "Tuatha Dé Danann": "Tuatha Dé Danann"
    },
    {
        " —the deities and deified ancestors of ": null
    },
    {
        "Irish mythology": "Irish Mythology"
    },
    {
        ". Some sources describe them as the survivors of the Tuatha Dé Danann who retreated into the ": null
    },
    {
        "Otherworld": "Otherworld"
    },
    {
        " when fleeing the mortal Sons of ": null
    },
    {
        "Míl Espáine": "Míl Espáine"
    },
    {
        " who, like many other early invaders of Ireland, came from Iberia. As part of the terms of their surrender to the ": null
    },
    {
        "Milesians": "Milesians"
    },
    {
        ", the ": null
    },
    {
        "Tuatha Dé Danann": "Tuatha Dé Danann"
    },
    {
        " agreed to retreat and dwell underground. ": null
    },
    {
        "Geoffrey Keating": "Geoffrey Keating"
    },
    {
        ", an Irish historian of the late 17th century, equates Iberia with the Land of the Dead, providing a possible connection to the aos sí.     In folk belief and practice, the aos sí are often appeased with offerings, and care is taken to avoid angering or insulting them. Often they are not named directly, but rather spoken of as The Good Neighbors , The Fair Folk , or simply The Folk . The most common names for them, aos sí, aes sídhe, daoine sídhe  and daoine sìth mean, literally, people of the mounds . The aos sí are generally described as stunningly beautiful, though they can also be terrible and hideous.     Aos sí are seen as fierce guardians of their abodes—whether a fairy hill, a ": null
    },
    {
        "fairy ring": "Fairy Ring"
    },
    {
        ", a special tree  or a particular ": null
    },
    {
        "loch": "Loch"
    },
    {
        " or wood. It is believed that infringing on these spaces will cause the aos sí to retaliate in an effort to remove the people or objects that invaded their homes. Many of these tales contribute to the ": null
    },
    {
        "changeling": "Changeling"
    },
    {
        " myth in ": null
    },
    {
        "west European": "Western Europe"
    },
    {
        " folklore": "Folklore"
    },
    {
        ", with the aos sí kidnapping trespassers or replacing their children with changelings as a punishment for transgressing. The aos sí are often connected to certain times of year and hours; as the ": null
    },
    {
        "Gaelic Otherworld": "Tír Na Nóg"
    },
    {
        " is believed to come closer to the mortal world at the times of dusk and dawn, the aos sí correspondingly become easier to encounter. Some festivals such as ": null
    },
    {
        "Samhain": "Samhain"
    },
    {
        ", ": null
    },
    {
        "Beltane": "Beltane"
    },
    {
        " and ": null
    },
    {
        "Midsummer": "Midsummer"
    },
    {
        " are also associated with the aos sí.     sídheídhe are the hills or ": null
    },
    {
        "tumuli": "Tumulusireland"
    },
    {
        " that dot the Irish landscape. In modern Irish the word is sí; in Scottish Gaelic, sìth; in Old Irish síde and the singular is síd. ": null
    },
    {
        "Dictionary of the Irish Language": "Dictionary Of The Irish Language"
    },
    {
        "http://www.dil.ie/37441 síd, síth In a number of later, English-language texts, the word sídhe is incorrectly used both for the mounds and the people of the mounds. However sidh in older texts refers specifically to the palaces, courts, halls or residences of the otherworldly beings that supposedly inhabit them. OCurry, E., Lectures on Manuscript Materials, Dublin 1861, p. 504, quoted by Evans-Wentz 1966, p. 291 The fact that many of these sídhe have been found to be ancient burial mounds has contributed to the theory that the aos sí were the pre-Celtic occupants of Ireland.     Others present these stories as ": null
    },
    {
        "mythology": "Mythology"
    },
    {
        " deriving from ": null
    },
    {
        "Greek": "Greece"
    },
    {
        " cultural influence, deriving arguments mainly from ": null
    },
    {
        "Hesiods": "Hesiod"
    },
    {
        "  Works and Days , which portrays the basic moral foundation and plantation techniques of the citizens of Greece and describes the races of men, created by the Greek deities. However, many of these views have been deemed unlikely, and the influence can be explained by the similar moral foundations stemming from the two cultures ": null
    },
    {
        "Indo-European": "Proto-Indo-Europeans"
    },
    {
        " background.       The ": null
    },
    {
        "banshee": "Banshee"
    },
    {
        " or bean sídhe , which means woman of the sídhe , ": null
    },
    {
        "Dictionary of the Irish Language": "Dictionary Of The Irish Language"
    },
    {
        "http://www.dil.ie/37441 síd, síth and http://www.dil.ie/5644 ben has come to indicate any supernatural woman of Ireland who announces a coming death by wailing and ": null
    },
    {
        "keening": "Keening"
    },
    {
        ". Her counterpart in ": null
    },
    {
        "Scottish mythology": "Scottish Mythology"
    },
    {
        " is the bean sìth . Other varieties of aos sí and daoine sìth include the Scottish  bean nighe ": null
    },
    {
        "armour": "Armour"
    },
    {
        " of the person who is doomed to die; the  leanan sídhe  cat sìth  Cù Sìth  sluagh sídhe — the fairy host —is sometimes depicted in Irish and Scottish lore as a crowd of airborne spirits, perhaps the cursed, evil or restless dead. The siabhra , may be a type of these lesser spirits, prone to evil and mischief. MacKillop, James http://www.encyclopedia.com/doc/1O70-sabair.html Dictionary of Celtic Mythology Joyce, P.W. , Vol. 1, p. 271 However, an ": null
    },
    {
        "Ulster": "Ulster"
    },
    {
        " folk song also uses sheevra simply to mean spirit or fairy .  published 1904 in The Songs of Uladh, lyrics by Seosamh MacCathmhaoil        ": null
    },
    {
        "Abarta": "Abarta"
    },
    {
        " Abhartach": "Abhartach"
    },
    {
        " Alp-luachra": "Alp-Luachra"
    },
    {
        " Bean nighe": "Bean Nighe"
    },
    {
        "/": null
    },
    {
        "Caoineag": "Caoineag"
    },
    {
        " Banshee": "Banshee"
    },
    {
        " Cat sìth": "Cat Sìth"
    },
    {
        " Cù Sìth": "Cù Sìth"
    },
    {
        " Changeling": "Changeling"
    },
    {
        " Clurichaun": "Clurichaun"
    },
    {
        " Dobhar-chú": "Dobhar-Chú"
    },
    {
        " Dullahan": "Dullahan"
    },
    {
        " Ellén Trechend": "Ellén Trechend"
    },
    {
        " Fachen": "Fachen"
    },
    {
        " Far darrig": "Far Darrig"
    },
    {
        " Fear gorta": "Fear Gorta"
    },
    {
        " Am Fear Liath Mòr": "Am Fear Liath Mòr"
    },
    {
        " Fetch": "Fetch"
    },
    {
        " Fuath": "Fuath"
    },
    {
        " Gancanagh": "Gancanagh"
    },
    {
        " Ghillie Dhu / Gille Dubh": "Ghillie Dhu"
    },
    {
        " Glaistig": "Glaistig"
    },
    {
        "/": null
    },
    {
        "Glashtyn": "Glashtyn"
    },
    {
        " Leanan Sídhe / Leannan Sìth": "Leanan Sídhe"
    },
    {
        " Leprechaun": "Leprechaun"
    },
    {
        " Merrow": "Merrow"
    },
    {
        " Oilliphéist": "Oilliphéist"
    },
    {
        " Púca": "Púca"
    },
    {
        " Selkie": "Selkie"
    },
    {
        " Sluagh": "Sluagh"
    },
    {
        "        Creideamh Sí    is ": null
    },
    {
        "Irish": "Irish Language"
    },
    {
        " for the Fairy Faith , a collection of beliefs and practices observed by those who wish to keep good relationships with the  and avoid angering them. The custom of offering milk and traditional foods—such as baked goods, apples or berries—to the  have survived through the Christian era into the present day in parts of Ireland, Scotland and the diaspora. Those who maintain some degree of belief in the  also are aware to leave their sacred places alone and protect them from damage through road or housing construction. ": null
    }
]