[
    {
        "     Apollo 1, initially designated AS-204, was the first crewed mission of the ": null
    },
    {
        "United States": "United States"
    },
    {
        " Apollo program": "Apollo Program"
    },
    {
        ", the undertaking to land the first men on the Moon. Planned as the first ": null
    },
    {
        "low Earth orbit": "Low Earth Orbit"
    },
    {
        "al test of the ": null
    },
    {
        "Apollo command and service module": "Apollo Command And Service Module"
    },
    {
        ", to launch on February 21, 1967, the mission never flew; a cabin fire during a launch rehearsal test at ": null
    },
    {
        "Cape Kennedy Air Force Station Launch Complex 34": "Cape Canaveral Air Force Station Launch Complex 34"
    },
    {
        " on January 27 killed all three crew members—Command Pilot ": null
    },
    {
        "Virgil I. Gus Grissom": "Gus Grissom"
    },
    {
        ", Senior Pilot ": null
    },
    {
        "Ed White": "Ed White"
    },
    {
        ", and Pilot ": null
    },
    {
        "Roger B. Chaffee": "Roger B. Chaffee"
    },
    {
        "—and destroyed the command module . The name Apollo1, chosen by the crew, was made official by ": null
    },
    {
        "NASA": "Nasa"
    },
    {
        " in their honor after the fire.     Immediately after the fire, NASA convened the Apollo 204 Accident Review Board to determine the cause of the fire, and both houses of the ": null
    },
    {
        "United States Congress": "United States Congress"
    },
    {
        " conducted their own ": null
    },
    {
        "committee inquiries": "United States Congressional Hearing"
    },
    {
        " to oversee NASAs investigation. The ignition source of the fire was determined to be electrical, and the fire spread rapidly due to combustible nylon material, and the high pressure, pure oxygen cabin atmosphere. Rescue was prevented by the ": null
    },
    {
        "plug door": "Plug Door"
    },
    {
        " hatch, which could not be opened against the internal pressure of the cabin. Because the rocket was unfueled, the test had not been considered hazardous, and emergency preparedness for it was poor.     During the Congressional investigation, Senator ": null
    },
    {
        "Walter Mondale": "Walter Mondale"
    },
    {
        " publicly revealed a NASA internal document citing problems with prime Apollo contractor ": null
    },
    {
        "North American Aviation": "North American Aviation"
    },
    {
        ", which became known as the ": null
    },
    {
        "Phillips Report": "Phillips Report"
    },
    {
        " . This disclosure embarrassed NASA Administrator ": null
    },
    {
        "James E. Webb": "James E. Webb"
    },
    {
        ", who was unaware of the documents existence, and attracted controversy to the Apollo program. Despite congressional displeasure at NASAs lack of openness, both congressional committees ruled that the issues raised in the report had no bearing on the accident.     Manned Apollo flights were suspended for 20 months while the command modules hazards were addressed. However, the development and uncrewed testing of the ": null
    },
    {
        "lunar module": "Lunar Module"
    },
    {
        " and ": null
    },
    {
        "SaturnV": "Saturn V"
    },
    {
        " rocket continued. The ": null
    },
    {
        "SaturnIB": "Saturn Ib"
    },
    {
        " launch vehicle for Apollo1, SA-204, was used for the first LM test flight, ": null
    },
    {
        "Apollo5": "Apollo 5"
    },
    {
        ". The first successful crewed Apollo mission was flown by Apollo1s backup crew on ": null
    },
    {
        "Apollo7": "Apollo 7"
    },
    {
        " in October 1968.                                 AS-204 was to be the first crewed test flight of the ": null
    },
    {
        "Apollo command and service module": "Apollo Command And Service Module"
    },
    {
        " to Earth orbit, launched on a Saturn IB rocket. AS-204 was to test launch operations, ground tracking and control facilities and the performance of the Apollo-Saturn launch assembly and would have lasted up to two weeks, depending on how the ": null
    },
    {
        "spacecraft": "Spacecraft"
    },
    {
        " performed.      The CSM for this flight, number 012 built by ": null
    },
    {
        "North American Aviation": "North American Aviation"
    },
    {
        " , was a ": null
    },
    {
        "Block I": "Apollo Command And Service Moduledevelopment History"
    },
    {
        " version designed before the ": null
    },
    {
        "lunar orbit rendezvous": "Lunar Orbit Rendezvous"
    },
    {
        " landing strategy was chosen; therefore it lacked capability of docking with the lunar module. This was incorporated into the Block II CSM design, along with lessons learned in Block I. Block II would be test-flown with the LM when the latter was ready, and would be used on the ": null
    },
    {
        "Moon landing": "Moon Landing"
    },
    {
        " flights.      Director of Flight Crew Operations ": null
    },
    {
        "Deke Slayton": "Deke Slayton"
    },
    {
        " selected the first Apollo crew in January 1966, with Grissom as Command Pilot, White as Senior Pilot, and rookie ": null
    },
    {
        "Donn F. Eisele": "Donn F. Eisele"
    },
    {
        " as Pilot. But Eisele dislocated his shoulder twice aboard the ": null
    },
    {
        "KC135 weightlessness training aircraft": "Reduced Gravity Aircraft"
    },
    {
        ", and had to undergo surgery on January 27. Slayton replaced him with Chaffee,  and NASA announced the crew selection on March 21, 1966. ": null
    },
    {
        "James McDivitt": "James Mcdivitt"
    },
    {
        ", ": null
    },
    {
        "David Scott": "David Scott"
    },
    {
        " and ": null
    },
    {
        "Russell Schweickart": "Rusty Schweickart"
    },
    {
        " were named as the backup crew.      On September 29, ": null
    },
    {
        "Walter Schirra": "Wally Schirra"
    },
    {
        ", Eisele, and ": null
    },
    {
        "Walter Cunningham": "Walter Cunningham"
    },
    {
        " were named as the prime crew for a second Block I CSM flight, AS-205.  NASA planned to follow this with an uncrewed test flight of the LM , then the third crewed mission would be a dual flight designated AS-278 , in which AS-207 would launch the first crewed Block II CSM, which would then rendezvous and dock with the LM launched uncrewed on AS-208.      In March, NASA was studying the possibility of flying the first Apollo mission as a joint ": null
    },
    {
        "space rendezvous": "Space Rendezvous"
    },
    {
        " with the final ": null
    },
    {
        "Project Gemini": "Project Gemini"
    },
    {
        " mission, ": null
    },
    {
        "Gemini 12": "Gemini 12"
    },
    {
        " in November 1966.  But by May, delays in making Apollo ready for flight just by itself, and the extra time needed to incorporate compatibility with the Gemini, made that impractical.  This became moot when slippage in readiness of the AS-204 spacecraft caused the last-quarter 1966 target date to be missed, and the mission was rescheduled for February 21, 1967.             In October 1966, NASA announced the flight would carry a small television camera to broadcast live from the command module. The camera would also be used to allow flight controllers to monitor the spacecrafts instrument panel in flight.  Television cameras were carried aboard all crewed Apollo missions.        Grissoms crew received approval in June 1966 to design a mission patch with the name Apollo1 . The designs center depicts a command and service module flying over the southeastern United States with Florida prominent. The ": null
    },
    {
        "Moon": "Moon"
    },
    {
        " is seen in the distance, symbolic of the eventual program goal. A yellow border carries the mission and astronaut names with another border set with stars and stripes, trimmed in gold. The insignia was designed by the crew, with the artwork done by North American Aviation employee Allen Stevens.   A version of this article was published concurrently in the ": null
    },
    {
        "British Interplanetary Societys": "British Interplanetary Society"
    },
    {
        "  Spaceflight  magazine. .               The Apollo command and service module was much bigger and far more complex than any previously implemented spacecraft design. In October 1963, ": null
    },
    {
        "Joseph F. Shea": "Joseph Francis Shea"
    },
    {
        " was named Apollo Spacecraft Program Office manager, responsible for managing the design and construction of both the CSM and the LM.   In a spacecraft review meeting held with Shea on August 19, 1966 , the crew expressed concern about the amount of flammable material  in the cabin, which both astronauts and technicians found convenient for holding tools and equipment in place. Although Shea gave the spacecraft a passing grade, after the meeting they gave him a crew portrait they had posed with heads bowed and hands clasped in prayer, with the inscription:      Shea gave his staff orders to tell North American to remove the flammables from the cabin, but did not supervise the issue personally.      North American shipped spacecraft CM-012 to Kennedy Space Center on August 26, 1966, under a conditional Certificate of Flight Worthiness: 113 significant incomplete planned engineering changes had to be completed at KSC. But that was not all; an additional 623 engineering change orders were made and completed after delivery.  Grissom became so frustrated with the inability of the training simulator engineers to keep up with the spacecraft changes, that he took a lemon from a tree by his house  and hung it on the simulator.     The command and service modules were mated in the KSC altitude chamber in September, and combined system testing was performed. Altitude testing was performed first uncrewed, then with both the prime and backup crews, from October 10 through December 30. During this testing, the environmental control unit in the command module was found to have a design flaw, and was sent back to the manufacturer for design changes and rework. The returned ECU then leaked water/glycol coolant, and had to be returned a second time. Also during this time, a propellant tank in service module 017 had ruptured during testing at NAA, prompting the separation of the modules and removal from the chamber so the service module could be tested for signs of the tank problem. These tests were negative.        In December, the second Block I flight AS-205 was canceled as unnecessary; and Schirra, Eisele and Cunningham were reassigned as the backup crew for Apollo1. McDivitts crew was now promoted to prime crew of the Block II / LM mission, re-designated AS-258 because the AS-205 launch vehicle would be used in place of AS-207. A third crewed mission was planned to launch the CSM and LM together on a SaturnV to an elliptical ": null
    },
    {
        "medium Earth orbit": "Medium Earth Orbit"
    },
    {
        " , to be crewed by ": null
    },
    {
        "Frank Borman": "Frank Borman"
    },
    {
        ", ": null
    },
    {
        "Michael Collins": "Michael Collins"
    },
    {
        " and ": null
    },
    {
        "William Anders": "William Anders"
    },
    {
        ". McDivitt, Scott and Schweickart had started their training for AS-258 in CM-101 at the NAA plant in Downey, California, when the Apollo1 accident occurred.      Once all outstanding CSM-012 hardware problems were fixed, the reassembled spacecraft finally completed a successful altitude chamber test with Schirras backup crew on December 30.   According to the final report of the accident investigation board, At the post-test debriefing the backup flight crew expressed their satisfaction with the condition and performance of the spacecraft.  This would appear to contradict the account given in  Lost Moon : The Perilous Voyage of Apollo13 by ": null
    },
    {
        "Jeffrey Kluger": "Jeffrey Kluger"
    },
    {
        " and astronaut ": null
    },
    {
        "James Lovell": "Jim Lovell"
    },
    {
        ", that When the trio climbed out of the ship,... Schirra made it clear that he was not pleased with what he had seen, and that he later warned Grissom and Shea that theres nothing wrong with this ship that I can point to, but it just makes me uncomfortable. Something about it just doesnt ring right, and that Grissom should get out at the first sign of trouble.      Following the successful altitude tests, the spacecraft was removed from the altitude chamber on January 3, 1967, and mated to its Saturn IB launch vehicle on ": null
    },
    {
        "pad 34": "Cape Canaveral Air Force Station Launch Complex 34"
    },
    {
        " on January 6.                     The launch simulation on January 27, 1967, on pad 34, was a plugs-out test to determine whether the spacecraft would operate nominally on internal power while detached from all cables and umbilicals. Passing this test was essential to making the February 21 launch date. The test was considered non-hazardous because neither the launch vehicle nor the spacecraft was loaded with fuel or ": null
    },
    {
        "cryogenics": "Cryogenics"
    },
    {
        ", and all ": null
    },
    {
        "pyrotechnic": "Pyrotechnic Fastener"
    },
    {
        " systems were disabled.     At 1:00  pm ": null
    },
    {
        "EST": "Eastern Time Zone"
    },
    {
        "  on January 27, first Grissom, then Chaffee, and White entered the command module fully pressure-suited, and were strapped into their seats and hooked up to the spacecrafts oxygen and communication systems. Grissom immediately noticed a strange odor in the air circulating through his suit which he compared to sour buttermilk , and the simulated countdown was put on hold at 1:20  pm, while air samples were taken. No cause of the odor could be found, and the countdown was resumed at 2:42  pm. The accident investigation found this odor not to be related to the fire.     Three minutes after the count was resumed, the hatch installation was started. The hatch consisted of three parts: a removable inner hatch, which stayed inside the cabin; a hinged outer hatch, which was part of the spacecrafts heat shield; and an outer hatch cover, which was part of the boost protective cover enveloping the entire command module to protect it from aerodynamic heating during launch, and from launch escape rocket exhaust in the event of a launch abort. The boost hatch cover was partially, but not fully, latched in place because the flexible boost protective cover was slightly distorted by some cabling run under it to provide the simulated internal power. After the hatches were sealed, the air in the cabin was replaced with pure oxygen at ,  higher than atmospheric pressure.           Movement by the astronauts was detected by the spacecrafts ": null
    },
    {
        "inertial measurement unit": "Inertial Measurement Unit"
    },
    {
        " and the astronauts biomedical sensors, and also indicated by increases in oxygen spacesuit flow, and sounds from Grissoms stuck-open microphone. There was no evidence to identify the movement, or whether it was related to the fire. The stuck microphone was part of a problem with the communications loop connecting the crew, the ": null
    },
    {
        "Operations and Checkout Building": "Operations And Checkout Building"
    },
    {
        ", and the Complex 34 blockhouse control room. The poor communications led Grissom to remark: How are we going to get to the Moon if we cant talk between two or three buildings? The simulated countdown was put on hold again at 5:40  pm while attempts were made to troubleshoot the communications problem. All countdown functions up to the simulated internal power transfer had been successfully completed by 6:20  pm, but at 6:30 the count remained on hold at T minus 10 minutes.            The crew members were using the time to run through their checklist again, when a momentary increase in AC Bus2 voltage occurred. Nine seconds later , one of the astronauts exclaimed Hey! , Fire! ,  or Flame! ;  this was followed by two seconds of scuffling sounds through Grissoms open microphone. This was immediately followed at 6:31:06.2 by someone saying, got a fire in the cockpit. After 6.8 seconds of silence a second, badly garbled transmission was heard by various listeners as:   Theyre fighting a bad fire—Lets get out... Open er up ,   Weve got a bad fire—Lets get out... Were burning up , or   Im reporting a bad fire... Im getting out...   The transmission lasted 5.0 seconds and ended with a cry of pain.      Some blockhouse witnesses said that they saw White on the television monitors, reaching for the inner hatch release handle as flames in the cabin spread from left to right.      The intensity of the fire fed by pure oxygen caused the pressure to rise to , which ruptured the command modules inner wall at 6:31:19 . Flames and gases then rushed outside the command module through open access panels to two levels of the pad service structure. Intense heat, dense smoke, and ineffective gas masks designed for toxic fumes rather than heavy smoke hampered the ground crews attempts to rescue the men. There were fears the command module had exploded, or soon would, and that the fire might ignite the solid fuel rocket in the launch escape tower above the command module, which would have likely killed nearby ground personnel, and possibly have destroyed the pad.     As the pressure was released by the cabin rupture, the convective rush of air caused the flames to spread across the cabin, beginning the second phase. The third phase began when most of the oxygen was consumed and was replaced with atmospheric air, essentially quenching the fire, but causing high concentrations of carbon monoxide and heavy smoke to fill the cabin, and large amounts of soot to be deposited on surfaces as they cooled.      It took five minutes for the pad workers to open all three hatch layers, and they could not drop the inner hatch to the cabin floor as intended, so they pushed it out of the way to one side. Although the cabin lights remained lit, they were at first unable to find the astronauts through the dense smoke. As the smoke cleared, they found the bodies, but were not able to remove them. The fire had partly melted Grissoms and Whites nylon space suits and the hoses connecting them to the life support system. Grissom had removed his restraints and was lying on the floor of the spacecraft. Whites restraints were burned through, and he was found lying sideways just below the hatch. It was determined that he had tried to open the hatch per the emergency procedure, but was not able to do so against the internal pressure. Chaffee was found strapped into his right-hand seat, as procedure called for him to maintain communication until White opened the hatch. Because of the large strands of melted nylon fusing the astronauts to the cabin interior, removing the bodies took nearly 90 minutes.     Deke Slayton was possibly the first NASA official to examine the spacecraft interior.  His testimony contradicted the official report concerning the position of Grissoms body. Slayton said of Grissom and Whites bodies, It is very difficult for me to determine the exact relationships of these two bodies. They were sort of jumbled together, and I couldnt really tell which head even belonged to which body at that point. I guess the only thing that was real obvious is that both bodies were at the lower edge of the hatch. They were not in the seats. They were almost completely clear of the seat areas.             As a result of the in-flight failure of the ": null
    },
    {
        "Gemini 8": "Gemini 8"
    },
    {
        " mission on March 17, 1966, NASA Deputy Administrator ": null
    },
    {
        "Robert Seamans": "Robert Seamans"
    },
    {
        " wrote and implemented Management Instruction 8621.1 on April 14, 1966, defining Mission Failure Investigation Policy And Procedures. This modified NASAs existing accident procedures, based on military aircraft accident investigation, by giving the Deputy Administrator the option of performing independent investigations of major failures, beyond those for which the various Program Office officials were normally responsible. It declared, It is NASA policy to investigate and document the causes of all major mission failures which occur in the conduct of its space and aeronautical activities and to take appropriate corrective actions as a result of the findings and recommendations.      Immediately after the Apollo1 fire, to avoid appearance of a conflict of interest, NASA Administrator ": null
    },
    {
        "James E. Webb": "James E. Webb"
    },
    {
        " asked ": null
    },
    {
        "President": "President Of The United States"
    },
    {
        " Lyndon B. Johnson": "Lyndon B. Johnson"
    },
    {
        " to allow NASA to handle the investigation according to its established procedure, promising to be truthful in assessing blame, and to keep the appropriate leaders of Congress informed.  Seamans then directed establishment of the Apollo 204 Review Board chaired by ": null
    },
    {
        "Langley Research Center": "Langley Research Center"
    },
    {
        " director Floyd L. Thompson, which included astronaut ": null
    },
    {
        "Frank Borman": "Frank Borman"
    },
    {
        ", spacecraft designer ": null
    },
    {
        "Maxime Faget": "Maxime Faget"
    },
    {
        ", and six others. On February 1, Cornell University professor Frank A. Long left the board,  and was replaced by Dr. Robert W. Van Dolah, of the ": null
    },
    {
        "U.S. Bureau of Mines": "United States Bureau Of Mines"
    },
    {
        ".  The next day, North Americans chief engineer for Apollo, George Jeffs, also left.      Seamans immediately ordered all Apollo1 hardware and software impounded, to be released only under control of the board. After thorough ": null
    },
    {
        "stereo photographic": "Stereoscopy"
    },
    {
        " documentation of the CM-012 interior, the board ordered its disassembly using procedures tested by disassembling the identical CM-014, and conducted a thorough investigation of every part. The board also reviewed the astronauts autopsy results and interviewed witnesses. Seamans sent Webb weekly status reports of the investigations progress, and the board issued its final report on April 5, 1967.       According to the Board, Grissom suffered severe ": null
    },
    {
        "third degree burns": "Burn"
    },
    {
        " on over one-third of his body and his spacesuit was mostly destroyed. White suffered third degree burns on almost half of his body and a quarter of his spacesuit had melted away. Chaffee suffered third degree burns over almost a quarter of his body and a small portion of his spacesuit was damaged. The autopsy report confirmed that the primary cause of death for all three astronauts was ": null
    },
    {
        "cardiac arrest": "Cardiac Arrest"
    },
    {
        " caused by high concentrations of ": null
    },
    {
        "carbon monoxide": "Carbon Monoxide"
    },
    {
        ". Burns suffered by the crew were not believed to be major factors, and it was concluded that most of them had occurred postmortem. ": null
    },
    {
        "Asphyxiation": "Asphyxiation"
    },
    {
        " occurred after the fire melted the astronauts suits and oxygen tubes, exposing them to the lethal atmosphere of the cabin.        The review board identified several major factors which combined to cause the fire and the astronauts deaths:   An ignition source most probably related to vulnerable wiring carrying spacecraft power and vulnerable plumbing carrying a combustible and corrosive coolant   A pure oxygen atmosphere at higher than atmospheric pressure   A cabin sealed with a hatch cover which could not be quickly removed at high pressure   An extensive distribution of combustible materials in the cabin   Inadequate emergency preparedness       The review board determined that the electrical power momentarily failed at 23:30:55 GMT, and found evidence of several ": null
    },
    {
        "electric arcs": "Electric Arc"
    },
    {
        " in the interior equipment. They were unable to conclusively identify a single ignition source. They determined that the fire most likely started near the floor in the lower left section of the cabin, close to the Environmental Control Unit.  It spread from the left wall of the cabin to the right, with the floor being affected only briefly.      The board noted that a silver-plated copper wire, running through an environmental control unit near the center couch, had become stripped of its ": null
    },
    {
        "Teflon": "Polytetrafluoroethylene"
    },
    {
        " insulation and abraded by repeated opening and closing of a small access door.     This weak point in the wiring also ran near a junction in an ": null
    },
    {
        "ethylene glycol": "Ethylene Glycol"
    },
    {
        "/water cooling line that had been prone to leaks. The ": null
    },
    {
        "electrolysis": "Electrolysis"
    },
    {
        " of ethylene glycol solution with the silver ": null
    },
    {
        "anode": "Anode"
    },
    {
        " was discovered at the ": null
    },
    {
        "Manned Spacecraft Center": "Manned Spacecraft Center"
    },
    {
        " on May 29, 1967, to be a hazard capable of causing a violent ": null
    },
    {
        "exothermic reaction": "Exothermic Reaction"
    },
    {
        ", igniting the ethylene glycol mixture in the Command Modules pure oxygen atmosphere. Experiments at the ": null
    },
    {
        "Illinois Institute of Technology": "Illinois Institute Of Technology"
    },
    {
        " confirmed the hazard existed for silver-plated wires, but not for copper-only or nickel-plated copper. In July, ASPO directed both North American and Grumman to ensure no silver or silver-coated electrical contacts existed in the vicinity of possible glycol spills in the Apollo spacecraft.             The plugs-out test had been run to simulate the launch procedure, with the cabin pressurized with pure oxygen at the nominal launch level of ,  above standard sea level atmospheric pressure. This is more than five times the  partial pressure of oxygen in the atmosphere, and provides an environment in which materials not normally considered flammable will be highly flammable and burst into flame. ": null
    },
    {
        "Benson 1978": "Moonport"
    },
    {
        "      The high-pressure oxygen atmosphere was similar to that which had been used successfully in the ": null
    },
    {
        "Mercury": "Project Mercury"
    },
    {
        " and Gemini programs. The pressure before launch was deliberately greater than ambient in order to drive out the nitrogen-containing air and replace it with pure oxygen, and also to seal the ": null
    },
    {
        "plug door": "Plug Door"
    },
    {
        " hatch cover. During launch, the pressure would have been gradually reduced to the in-flight level of , providing sufficient oxygen for the astronauts to breathe while reducing the fire risk. The Apollo1 crew had successfully tested this procedure with their spacecraft in the Operations and Checkout Building altitude chamber on October 18 and 19, 1966, and the backup crew of Schirra, Eisele and Cunningham had repeated it on December 30. ": null
    },
    {
        "Benson 1978": "Moonport"
    },
    {
        " The investigation board noted that, during these tests, the command module had been fully pressurized with pure oxygen four times, for a total of six hours and fifteen minutes, two and a half hours longer than it had been during the plugs-out test.        The review board cited many types and classes of combustible material close to ignition sources. The NASA crew systems department had installed  of ": null
    },
    {
        "Velcro": "Hook-And-Loop Fastener"
    },
    {
        " throughout the spacecraft, almost like carpeting. This Velcro was found to be flammable in a high-pressure 100% oxygen environment. Astronaut ": null
    },
    {
        "Buzz Aldrin": "Buzz Aldrin"
    },
    {
        " states in his book Men From Earth that the flammable material had been removed per the crews August 19 complaints and Joseph Sheas order, but was replaced before the August 26 delivery to Cape Kennedy.             The inner hatch cover used a ": null
    },
    {
        "plug door": "Plug Door"
    },
    {
        " design, sealed by higher pressure inside the cabin than outside. The normal pressure level used for launch  created sufficient force to prevent removing the cover until the excess pressure was vented. Emergency procedure called for Grissom to open the cabin vent valve first, allowing White to remove the cover, but Grissom was prevented from doing this because the valve was located to the left, behind the initial wall of flames. Also, while the system could easily vent the normal pressure, its flow capacity was utterly incapable of handling the rapid increase to  absolute caused by the intense heat of the fire.      North American had originally suggested the hatch open outward and use ": null
    },
    {
        "explosive bolts": "Explosive Bolt"
    },
    {
        " to blow the hatch in case of emergency, as had been done in ": null
    },
    {
        "Project Mercury": "Project Mercury"
    },
    {
        ". NASA did not agree, arguing the hatch could accidentally open, as it had on Grissoms  Liberty Bell 7  flight, so the ": null
    },
    {
        "Manned Spacecraft Center": "Lyndon B. Johnson Space Center"
    },
    {
        " designers rejected the explosive design in favor of a mechanically operated one for the Gemini and Apollo programs.  Before the fire, the Apollo astronauts had recommended changing the design to an outward-opening hatch, and this was already slated for inclusion in the Block II command module design. According to ": null
    },
    {
        "Donald K. Slaytons": "Deke Slayton"
    },
    {
        " testimony before the House investigation of the accident, this was based on ease of exit for spacewalks and at the end of flight, rather than for emergency exit. ": null
    },
    {
        "Benson 1978": "Moonport"
    },
    {
        "       The board noted that the test planners had failed to identify the test as hazardous; the emergency equipment were inadequate to handle this type of fire; that fire, rescue, and medical teams were not in attendance; and that the spacecraft work and access areas contained many hindrances to emergency response such as steps, sliding doors, and sharp turns.        When designing the Mercury spacecraft, NASA had considered using a nitrogen/oxygen mixture to reduce the fire risk near launch, but rejected it based on a number of considerations. First, a pure oxygen atmosphere is comfortably breathable by humans at five psi, greatly reducing the pressure load on the spacecraft in the vacuum of space. Second, nitrogen used with the in-flight pressure reduction carried the risk of ": null
    },
    {
        "decompression sickness": "Decompression Sickness"
    },
    {
        " . But the decision to eliminate the use of any gas but oxygen was crystalized when a serious accident occurred on April 21, 1960, in which ": null
    },
    {
        "McDonnell Aircraft": "Mcdonnell Aircraft"
    },
    {
        " test pilot G. B. North passed out and was seriously injured when testing a Mercury cabin / spacesuit atmosphere system in a vacuum chamber. The problem was found to be nitrogen-rich air leaking from the cabin into his spacesuit feed.  North American Aviation had suggested using an oxygen/nitrogen mixture for Apollo, but NASA overruled this. The pure oxygen design was judged to be safer, less complicated, and lighter in weight.      In his monograph Project Apollo: The Tough Decisions, Deputy Administrator Seamans wrote that NASAs worst mistake in engineering judgment was not to run a fire test on the command module before the plugs-out test.  In the first episode of the 2009 ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " documentary series NASA: Triumph and Tragedy, Jim McDivitt said that NASA had no idea how a 100% oxygen atmosphere would influence burning.  Similar remarks by other astronauts were expressed in the 2007 documentary film ": null
    },
    {
        "In the Shadow of the Moon": "In The Shadow Of The Moon"
    },
    {
        ".        Several fires in high-oxygen test environments had occurred before the Apollo fire. In 1962, ": null
    },
    {
        "USAF": "United States Air Force"
    },
    {
        " Colonel B. Dean Smith was conducting a test of the ": null
    },
    {
        "Gemini space suit": "Gemini Space Suit"
    },
    {
        " with a colleague in a pure oxygen chamber at ": null
    },
    {
        "Brooks Air Force Base": "Brooks Air Force Base"
    },
    {
        " in ": null
    },
    {
        "San Antonio": "San Antonio"
    },
    {
        ", Texas when a fire broke out, destroying the chamber. Smith and his partner narrowly escaped.  On February 16, 1965, United States Navy Divers Fred Jackson and John Youmans were killed in a ": null
    },
    {
        "decompression chamber": "Decompression Chamber"
    },
    {
        " fire at the ": null
    },
    {
        "Experimental Diving Unit": "United States Navy Experimental Diving Unit"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        ", shortly after additional oxygen was added to the chambers atmospheric mix.       Other oxygen fire occurrences are documented in reports archived in the ": null
    },
    {
        "National Air and Space Museum": "National Air And Space Museum"
    },
    {
        ",  such as:   Selection of Space Cabin Atmospheres. Part II: Fire and Blast Hazaards  in Space Cabins.   Fire Prevention in Manned Spacecraft and Test Chamber Oxygen Atmospheres .      Incidents had also occurred in the ": null
    },
    {
        "Soviet space program": "Soviet Space Program"
    },
    {
        ", but due to the governments policy of secrecy, these were not disclosed until well after the Apollo1 fire. ": null
    },
    {
        "Cosmonaut": "Cosmonaut"
    },
    {
        " Valentin Bondarenko": "Valentin Bondarenko"
    },
    {
        " died on March 23, 1961, from burns sustained in a fire while participating in a 15-day endurance experiment in a high-oxygen isolation chamber, less than three weeks before the first ": null
    },
    {
        "Vostok": "Vostok Programme"
    },
    {
        " crewed space flight; this was disclosed on January 28, 1986.        During the ": null
    },
    {
        "Voskhod 2": "Voskhod 2"
    },
    {
        " mission in March 1965, cosmonauts ": null
    },
    {
        "Pavel Belyayev": "Pavel Belyayev"
    },
    {
        " and ": null
    },
    {
        "Alexei Leonov": "Alexei Leonov"
    },
    {
        " could not completely seal the spacecraft hatch after Leonovs historic first ": null
    },
    {
        "walk in space": "Extravehicular Activity"
    },
    {
        ". The spacecrafts environmental control system responded to the leaking air by adding more oxygen to the cabin, causing the concentration level to rise as high as 45%. The crew and ground controllers worried about the possibility of fire, remembering Bondarenkos death four years earlier.      On January 31, 1967, four days after the Apollo1 fire, United States Air Force airmen William F. Bartley, Jr., and Richard G. Harmon were killed in a flash fire while tending laboratory rabbits in the Two Man Space Environment Simulator, a pure oxygen chamber at the School of Aerospace Medicine at Brooks Air Force Base.      Like the Apollo1 fire, the School fire was caused by an electrical spark in a pure oxygen environment. The widows of the Apollo1 crew sent condolence letters to Bartley and Harmons families.            Committees in both houses of the ": null
    },
    {
        "United States Congress": "United States Congress"
    },
    {
        " with oversight of the space program soon launched investigations, including the ": null
    },
    {
        "Senate Committee on Aeronautical and Space Sciences": "United States Senate Committee On Aeronautical And Space Sciences"
    },
    {
        ", chaired by Senator ": null
    },
    {
        "Clinton P. Anderson": "Clinton Presba Anderson"
    },
    {
        ". Seamans, Webb, Manned Space Flight Administrator Dr. ": null
    },
    {
        "George E. Mueller": "George Mueller"
    },
    {
        ", and Apollo Program Director ": null
    },
    {
        "Maj Gen": "Major General"
    },
    {
        " Samuel C. Phillips": "Samuel C. Phillips"
    },
    {
        " were called to testify before Andersons committee.     In the February 27 hearing, ": null
    },
    {
        "Senator": "United States Senate"
    },
    {
        " Walter F. Mondale": "Walter Mondale"
    },
    {
        " asked Webb if he knew of a report of extraordinary problems with the performance of North American Aviation on the Apollo contract. Webb replied he did not, and deferred to his subordinates on the witness panel. Mueller and Phillips responded they too were unaware of any such report .     However, in late 1965, just over a year before the accident, Phillips had headed a ": null
    },
    {
        "tiger team": "Tiger Team"
    },
    {
        " investigating the causes of inadequate quality, schedule delays, and cost overruns in both the Apollo CSM and the Saturn V second stage . He gave an oral presentation of his teams findings to Mueller and Seamans, and also presented them in a memo to North American president ": null
    },
    {
        "John L. Atwood": "John Leland Atwood"
    },
    {
        ", to which Mueller appended his own strongly worded memo to Atwood.      During Mondales 1967 questioning about what was to become known as the ": null
    },
    {
        "Phillips Report": "Phillips Report"
    },
    {
        " , Seamans was afraid Mondale might actually have seen a hard copy of Phillips presentation, and responded that contractors have occasionally been subjected to on-site progress reviews; perhaps this was what Mondales information referred to. Mondale continued to refer to the Report despite Phillips refusal to characterize it as such, and angered by what he perceived as Webbs deception and concealment of important program problems from Congress, he questioned NASAs selection of North American as prime contractor. Seamans later wrote that Webb roundly chastised him in the cab ride leaving the hearing, for volunteering information which led to the disclosure of Phillips memo.     On May 11, Webb issued a statement defending NASAs November 1961 selection of North American as the prime contractor for Apollo. This was followed on June9 by Seamans filing a seven-page memorandum documenting the selection process. Webb eventually provided a ": null
    },
    {
        "controlled copy": "Document Control"
    },
    {
        " of Phillips memo to Congress. The Senate committee noted in its final report NASAs testimony that the findings of the task force had no effect on the accident, did not lead to the accident, and were not related to the accident ,   but stated in its recommendations:        Freshman Senators ": null
    },
    {
        "Edward W. Brooke III": "Edward Brooke"
    },
    {
        " and ": null
    },
    {
        "Charles H. Percy": "Charles H. Percy"
    },
    {
        " jointly wrote an Additional Views section appended to the committee report, chastising NASA more strongly than Anderson for not having disclosed the Phillips review to Congress. Mondale wrote his own, even more strongly worded Additional View, accusing NASA of evasiveness,... lack of candor,... patronizing attitude toward Congress... refusal to respond fully and forthrightly to legitimate Congressional inquiries, and... solicitous concern for corporate sensitivities at a time of national tragedy .      The potential political threat to Apollo blew over, due in large part to the support of President Lyndon B. Johnson, who at the time still wielded a measure of influence with the Congress from his own Senatorial experience. He was a staunch supporter of NASA since its inception, had even recommended the Moon program to President ": null
    },
    {
        "John F. Kennedy": "John F. Kennedy"
    },
    {
        " in 1961, and was skilled at portraying it as part of Kennedys legacy.     Relations between NASA and North American deteriorated over assignment of blame. North American argued unsuccessfully it was not responsible for the fatal error in spacecraft atmosphere design. Finally, Webb contacted Atwood, and demanded either he or Chief Engineer ": null
    },
    {
        "Harrison A. Storms": "Harrison Storms"
    },
    {
        " resign. Atwood elected to fire Storms.  Harrison Storms interview with historian James Burke for BBC television. See  .     On the NASA side, Joseph Shea resorted to barbiturates and alcohol in order to help him cope.  NASA administrator James Webb became increasingly worried about Sheas mental state. Shea was asked to take an extended voluntary leave of absence, but Shea refused, threatening to resign rather than take leave. As a compromise, he agreed to meet with a psychiatrist and to abide by an independent assessment of his psychological fitness. This approach to remove Shea from his position was also unsuccessful.  Finally, six months after the fire, Sheas superiors reassigned him to NASA headquarters in Washington, D.C. Shea felt that his new post was a non-job, and left after only two months. Ertel and Newkirk, Apollo Spacecraft, Vol IV, p. 119.          ": null
    },
    {
        "Gene Kranz": "Gene Kranz"
    },
    {
        " called a meeting of his staff in Mission Control three days after the accident, delivering a speech which has subsequently become one of NASAs principles.  PDF of update available from NASA here . Speaking of the errors and overall attitude surrounding the ": null
    },
    {
        "Apollo program": "Apollo Program"
    },
    {
        " before the accident, he said: We were too ": null
    },
    {
        "gung-ho": "Gung-Ho"
    },
    {
        " about the schedule and we blocked out all of the problems we saw each day in our work. Every element of the program was in trouble and so were we.   He reminded the team of the perils and mercilessness of their endeavor, and stated the new requirement that every member of every team in mission control be tough and competent , requiring nothing less than perfection throughout NASAs programs.  In 2003, following the ": null
    },
    {
        "Space Shuttle Columbia disaster": "Space Shuttle Columbia Disaster"
    },
    {
        ", NASA administrator ": null
    },
    {
        "Sean OKeefe": "Sean Okeefe"
    },
    {
        " quoted Kranzs speech, applying it to the Columbia crew.       After the fire, the Apollo program was grounded for review and redesign. The command module was found to be extremely hazardous and, in some instances, carelessly assembled .      It was decided that remaining Block I spacecraft would be used only for uncrewed Saturn V test flights. All crewed missions would use the ": null
    },
    {
        "Block II spacecraft": "Apollo Command And Service Modulemajor Differences Between Block I And Block Ii"
    },
    {
        ", to which many command module design changes were made:   The cabin atmosphere at launch was adjusted to 60% oxygen and 40% nitrogen at sea-level pressure: . During ascent the cabin rapidly vented down to , releasing approximately 2/3 of the gas originally present at launch. The vent then closed and the environmental control system maintained a nominal cabin pressure of  as the spacecraft continued into vacuum. The cabin was then very slowly purged , so the nitrogen concentration fell asymptotically to zero over the next day. Although the new cabin launch atmosphere was significantly safer than 100% oxygen, it still contained almost three times the amount of oxygen present in ordinary sea level air . This was necessary to ensure a sufficient ": null
    },
    {
        "partial pressure": "Partial Pressure"
    },
    {
        " of oxygen when the astronauts removed their helmets after reaching orbit.    The environment within the astronauts pressure suits was not changed. Because of the rapid drop in cabin pressures during ascent, ": null
    },
    {
        "decompression sickness": "Decompression Sickness"
    },
    {
        " was likely unless the nitrogen had been purged from the astronauts tissues before launch. They would still breathe pure oxygen, starting several hours before launch, until they removed their helmets on orbit. Avoiding the bends was considered worth the residual risk of an oxygen-accelerated fire within a suit.   Nylon used in the ": null
    },
    {
        "Block I suits": "Gemini Space Suit"
    },
    {
        " was replaced in the ": null
    },
    {
        "Block II suits": "Apollo/Skylab A7L"
    },
    {
        " with ": null
    },
    {
        "Beta cloth": "Beta Cloth"
    },
    {
        ", a non-flammable, highly melt-resistant fabric woven from ": null
    },
    {
        "fiberglass": "Glass"
    },
    {
        " and coated with Teflon.    Block II had already been planned to use a completely redesigned hatch which opened outward, and could be opened in less than five seconds. Concerns of accidental opening were addressed by using a cartridge of pressurized nitrogen to drive the release mechanism in an emergency, instead of the ": null
    },
    {
        "explosive bolts": "Explosive Bolt"
    },
    {
        " used on Project Mercury.   Flammable materials in the cabin were replaced with self-extinguishing versions.   Plumbing and wiring were covered with protective ": null
    },
    {
        "insulation": "Thermal Insulation"
    },
    {
        ". Aluminum tubing was replaced with stainless steel tubing that used brazed joints when possible.     Thorough protocols were implemented for documenting spacecraft construction and maintenance.       The astronauts widows asked that Apollo 1 be reserved for the flight their husbands never made, and on April 24, 1967, Mueller, as Associate Administrator for Manned Space Flight, announced this change officially: AS-204 would be recorded as Apollo1, first crewed Apollo Saturn flight – failed on ground test .  Even though three uncrewed Apollo missions  had previously occurred, only AS-201 and AS-202 carried spacecraft. Therefore, the next mission, the first uncrewed Saturn V test flight would be designated ": null
    },
    {
        "Apollo4": "Apollo 4"
    },
    {
        ", with all subsequent flights numbered sequentially in the order flown. The first three flights would not be renumbered, and the names Apollo2 and Apollo3 would officially go unused.  Mueller considered AS-201 and AS-202, the first and second flights of the Apollo Block I CSM, as Apollo2 and3 respectively.      The crewed flight hiatus allowed work to catch up on the Saturn V and lunar module, which were encountering their own delays. Apollo4 flew in November 1967. Apollo1s Saturn IB rocket was taken down from Launch Complex 34, later reassembled at ": null
    },
    {
        "Launch complex 37B": "Cape Canaveral Air Force Station Space Launch Complex 37"
    },
    {
        " and used to launch ": null
    },
    {
        "Apollo5": "Apollo 5"
    },
    {
        ", an uncrewed Earth orbital test flight of the first lunar module, LM-1, in January 1968.  A second uncrewed Saturn V AS-502 flew as ": null
    },
    {
        "Apollo6": "Apollo 6"
    },
    {
        " in April 1968, and Grissoms backup crew of ": null
    },
    {
        "Wally Schirra": "Wally Schirra"
    },
    {
        ", ": null
    },
    {
        "Don Eisele": "Don Eisele"
    },
    {
        ", and ": null
    },
    {
        "Walter Cunningham": "Walter Cunningham"
    },
    {
        ", finally flew the orbital test mission as ": null
    },
    {
        "Apollo7": "Apollo 7"
    },
    {
        " , in a Block II CSM in October 1968.             Gus Grissom and Roger Chaffee were buried at ": null
    },
    {
        "Arlington National Cemetery": "Arlington National Cemetery"
    },
    {
        ". Ed White was buried at ": null
    },
    {
        "West Point Cemetery": "West Point Cemetery"
    },
    {
        " on the grounds of the ": null
    },
    {
        "United States Military Academy": "United States Military Academy"
    },
    {
        " in ": null
    },
    {
        "West Point, New York": "West Point, New York"
    },
    {
        ".  Their names are among those of several astronauts and cosmonauts who have died in the line of duty, listed on the ": null
    },
    {
        "Space Mirror Memorial": "Space Mirror Memorial"
    },
    {
        " at the ": null
    },
    {
        "Kennedy Space Center Visitor Complex": "Kennedy Space Center Visitor Complex"
    },
    {
        " in ": null
    },
    {
        "Merritt Island, Florida": "Merritt Island, Florida"
    },
    {
        ". President ": null
    },
    {
        "Jimmy Carter": "Jimmy Carter"
    },
    {
        " awarded the ": null
    },
    {
        "Congressional Space Medal of Honor": "Congressional Space Medal Of Honor"
    },
    {
        " posthumously to Grissom on October 1, 1978. President ": null
    },
    {
        "Bill Clinton": "Bill Clinton"
    },
    {
        " awarded it to White and Chaffee on December 17, 1997.         An Apollo 1 mission patch was left on the Moons surface after the first crewed lunar landing by ": null
    },
    {
        "Apollo11": "Apollo 11"
    },
    {
        " crew members ": null
    },
    {
        "Neil Armstrong": "Neil Armstrong"
    },
    {
        " and Buzz Aldrin.  The ": null
    },
    {
        "Apollo15": "Apollo 15"
    },
    {
        " mission left on the surface of the Moon a tiny memorial statue,  Fallen Astronaut , along with a plaque containing the names of the Apollo1 astronauts, among others including Soviet cosmonauts, who perished in the pursuit of human space flight.             After the Apollo 1 fire, ": null
    },
    {
        "Launch Complex 34": "Cape Canaveral Air Force Station Launch Complex 34"
    },
    {
        " was subsequently used only for the launch of Apollo7 and later dismantled down to the concrete launch pedestal, which remains at the site  along with a few other concrete and steel-reinforced structures. The pedestal bears two plaques commemorating the crew. Each year the families of the Apollo1 crew are invited to the site for a memorial, and the Kennedy Space Center Visitor Complex includes the site during the tour of the historic Cape Canaveral launch sites.      In January 2005, three granite benches, built by a college classmate of one of the astronauts, were installed at the site on the southern edge of the launch pad. Each bears the name of one of the astronauts and his military service insignia.    ": null
    },
    {
        "inertial navigation": "Inertial Navigation"
    },
    {
        " platforms and determined their positions relative to the Earth and Moon by sighting sets of stars with optical instruments. As a practical joke, the Apollo1 crew named three of the stars in the Apollo catalog after themselves and introduced them into NASA documentation. ": null
    },
    {
        "Gamma Cassiopeiae": "Gamma Cassiopeiae"
    },
    {
        " became Navi – Ivan spelled backwards. ": null
    },
    {
        "Iota Ursae Majoris": "Iota Ursae Majoris"
    },
    {
        " became Dnoces – Second spelled backwards, for Edward H. White II. And ": null
    },
    {
        "Gamma Velorum": "Gamma Velorum"
    },
    {
        " became Regor – Roger spelled backwards. These names quickly stuck after the Apollo1 accident and were regularly used by later Apollo crews.  Section 105:11:33.   ": null
    },
    {
        "Craters": "Lunar Craters Named For Space Explorers"
    },
    {
        " on the Moon and ": null
    },
    {
        "hills": "Apollo 1 Hills"
    },
    {
        " on ": null
    },
    {
        "Mars": "Mars"
    },
    {
        " are named after the three Apollo1 astronauts.       Three public schools in ": null
    },
    {
        "Huntsville, Alabama": "Huntsville, Alabama"
    },
    {
        " Virgil I. Grissom High School": "Virgil I. Grissom High School"
    },
    {
        ",  ": null
    },
    {
        "Ed White Middle School": "Ed White Middle School"
    },
    {
        ",  and the Chaffee Elementary School     e-STEM Magnet school in ": null
    },
    {
        "El Lago, Texas": "El Lago, Texas"
    },
    {
        ", near the ": null
    },
    {
        "Johnson Space Center": "Johnson Space Center"
    },
    {
        ".  White lived in El Lago, .   Virgil I. Grissom Middle Schools in ": null
    },
    {
        "Mishawaka, Indiana": "Mishawaka, Indiana"
    },
    {
        ", ": null
    },
    {
        "Sterling Heights, Michigan": "Sterling Heights, Michigan"
    },
    {
        ", and ": null
    },
    {
        "Tinley Park, Illinois": "Tinley Park, Illinois"
    },
    {
        ".   Virgil Grissom Elementary School in ": null
    },
    {
        "Princeton, Iowa": "Princeton, Iowa"
    },
    {
        ",  and the Edward White Elementary School in ": null
    },
    {
        "Eldridge, Iowa": "Eldridge, Iowa"
    },
    {
        ",  are both part of the ": null
    },
    {
        "North Scott Community School District": "North Scott Community School District"
    },
    {
        " also naming the other three elementary schools after astronauts Neil Armstrong, ": null
    },
    {
        "John Glenn": "John Glenn"
    },
    {
        ", and ": null
    },
    {
        "Alan Shepard": "Alan Shepard"
    },
    {
        "    School 7 in ": null
    },
    {
        "Rochester, New York": "Rochester, New York"
    },
    {
        ", is also known as the Virgil I. Grissom School. .   Three streets in ": null
    },
    {
        "Amherst, New York": "Amherst, New York"
    },
    {
        ", are named for Roger Chaffee, Edward White, and Gus Grissom Drive. A street was named for Virgil I. Grissom at the same time, but when no homes were built on it by 1991, the street sign was removed.   Three man-made oil drilling islands in the harbor off ": null
    },
    {
        "Long Beach, California": "Long Beach, California"
    },
    {
        ", are named Grissom, White and Chaffee. A fourth island is named for ": null
    },
    {
        "Theodore Freeman": "Theodore Freeman"
    },
    {
        ",    an astronaut chosen from the USAF in 1963, killed in a 1964 ": null
    },
    {
        "T-38": "Northrop T-38 Talon"
    },
    {
        " jet crash at ": null
    },
    {
        "Ellington Air Force Base": "Ellington Field Joint Reserve Base"
    },
    {
        ".   The Roger B. Chaffee Planetarium is located at the Grand Rapids Public Museum    Roger B. Chaffee Memorial Boulevard in ": null
    },
    {
        "Grand Rapids, Michigan": "Grand Rapids, Michigan"
    },
    {
        ", which is today an industrial park, but exists on the site of the former Grand Rapids Airport. A large portion of the north-south runway is used today as the roadway of the Roger B. Chaffee Memorial Boulevard.    Roger B. Chaffee Scholarship Fund in ": null
    },
    {
        "Grand Rapids, Michigan": "Grand Rapids, Michigan"
    },
    {
        ", each year in memory of Chaffee honors one student who intends to pursue a career in engineering or the sciences    Three adjacent parks in ": null
    },
    {
        "Fullerton, California": "Fullerton, California"
    },
    {
        ", are each named for Grissom, Chaffee and White. The parks are located near a former ": null
    },
    {
        "Hughes Aircraft": "Hughes Aircraft Company"
    },
    {
        " research and development facility. A Hughes subsidiary, ": null
    },
    {
        "Hughes Space and Communications Company": "Hughes Aircraft Companyhughes Space And Communications Company"
    },
    {
        ", built components for the Apollo program.    Two buildings on the campus of ": null
    },
    {
        "Purdue University": "Purdue University"
    },
    {
        " in ": null
    },
    {
        "West Lafayette, Indiana": "West Lafayette, Indiana"
    },
    {
        ", are named for Grissom and Chaffee . Grissom Hall houses the School of Industrial Engineering .  Chaffee Hall, constructed in 1965, is the administration complex of ": null
    },
    {
        "Maurice J. Zucrow": "Maurice J. Zucrow"
    },
    {
        " Laboratories where combustion, propulsion, gas dynamics, and related fields are studied. The Chaffee Hall contains a 72 seat auditorium, offices, and administrative staff.    A tree for each astronaut was planted in NASAs Astronaut Memorial Grove at the ": null
    },
    {
        "Johnson Space Center": "Johnson Space Center"
    },
    {
        " in ": null
    },
    {
        "Houston": "Houston"
    },
    {
        ", Texas, not far from the Saturn V building, along with trees for each astronaut from the Challenger and Columbia disasters.  Tours of the space center pause briefly near the grove for a moment of silence, and the trees can be seen from nearby ": null
    },
    {
        "NASA Road 1": "Texas State Highway Nasa Road 1"
    },
    {
        ".            The Apollo 1 command module has never been on public display. After the accident, the spacecraft was removed and taken to Kennedy Space Center to facilitate the review boards disassembly in order to investigate the cause of the fire. When the investigation was complete, it was moved to the NASA ": null
    },
    {
        "Langley Research Center": "Langley Research Center"
    },
    {
        " in Hampton, Virginia, and placed in a secured storage warehouse.    On February 17, 2007, the parts of CM-012 were moved approximately  to a newer, environmentally controlled warehouse.  Only a few weeks earlier, Gus Grissoms brother Lowell publicly suggested CM-012 be permanently entombed in the concrete remains of ": null
    },
    {
        "Launch Complex 34": "Launch Complex 34"
    },
    {
        ".      On January 27, 2017, the 50th anniversary of the fire, NASA put the hatch from Apollo1 on display at the Saturn V Rocket Center at Kennedy Space Center Visitors Center. KSCs Visitor Center also houses memorials that include parts of ": null
    },
    {
        "Challenger": "Space Shuttle Challenger"
    },
    {
        " and ": null
    },
    {
        "Columbia,": "Space Shuttle Columbia"
    },
    {
        " which is located in the Atlantis exhibit. This is way, way, way long overdue. But were excited about it, said Scott Grissom, ": null
    },
    {
        "Gus Grissoms": "Gus Grissom"
    },
    {
        " older son.        The accident and its aftermath are the subject of episode2 Apollo One , of the 1998 ": null
    },
    {
        "HBO": "Hbo"
    },
    {
        " miniseries  From the Earth to the Moon .    The mission and accident are covered in the 2015 ": null
    },
    {
        "ABC": "American Broadcasting Company"
    },
    {
        " television series,  The Astronaut Wives Club , episodes8 Rendezvous ,  and9 Abort .    The incident is the subject of the ": null
    },
    {
        "Public Service Broadcasting": "Public Service Broadcasting"
    },
    {
        " track Fire in the Cockpit from their 2015 album ": null
    },
    {
        "The Race for Space": "The Race For Space"
    },
    {
        ".    The incident is described in the song Apollo One by Paul Leary in his 1991 album The History of Dogs.   The incident is mentioned in the opening stanza of the song Rockin at the T-Dance by The Rainmakers in their 1990 album The Rainmakers.   The incident is also featured in the 2018 movie  First Man .   The incident is featured in the opening scene in the 1995 film  Apollo13 ": null
    }
]