[
    {
        "      Ardal OHanlon  is an Irish comedian and actor. He played ": null
    },
    {
        "Father Dougal McGuire": "Father Dougal Mcguire"
    },
    {
        " in  Father Ted , George Sunday/Thermoman in  My Hero , and DI Jack Mooney in  Death in Paradise .       OHanlon was born on 8 October 1965 in ": null
    },
    {
        "Carrickmacross": "Carrickmacross"
    },
    {
        ", ": null
    },
    {
        "County Monaghan": "County Monaghan"
    },
    {
        ", the son of politician and doctor ": null
    },
    {
        "Rory OHanlon": "Rory Ohanlon"
    },
    {
        " and Teresa Ward. He has five siblings. The episode of  Who Do You Think You Are?  which aired on 6 October 2008 revealed that OHanlons paternal grandfather, Michael OHanlon, was a medicine student at ": null
    },
    {
        "University College Dublin": "University College Dublin"
    },
    {
        " who had joined the ": null
    },
    {
        "Irish Republican Army": "Irish Republican Army"
    },
    {
        " during the ": null
    },
    {
        "Irish War of Independence": "Irish War Of Independence"
    },
    {
        " and was a member of ": null
    },
    {
        "Michael Collinss": "Michael Collins"
    },
    {
        " squad which assassinated British secret service agents on the morning of ": null
    },
    {
        "Bloody Sunday": "Bloody Sunday"
    },
    {
        ". Details of his grandfathers activities survive in UCD Archives, as well as ": null
    },
    {
        "Blackrock College": "Blackrock College"
    },
    {
        ". It also transpired that, on his mothers side, he is a close relative of ": null
    },
    {
        "Peter Fenelon Collier": "Peter Fenelon Collier"
    },
    {
        ".     OHanlon was schooled in ": null
    },
    {
        "Blackrock College": "Blackrock College"
    },
    {
        " in Dublin and graduated, in 1987, from the ": null
    },
    {
        "National Institute for Higher Education": "National Institute For Higher Education"
    },
    {
        ", ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        "  with a degree in Communications Studies.       Together with Kevin Gildea and Barry Murphy, OHanlon founded the International Comedy Cellar, upstairs in the International Bar on Dublins South Wicklow Street. Dublin had no comedy scene at the time. As a stand up, OHanlon won the ": null
    },
    {
        "Hackney Empire New Act of the Year": "Hackney Empire New Act Of The Year"
    },
    {
        " competition in 1994. For a time he was the presenter of The Stand Up Show.     He was spotted by ": null
    },
    {
        "Graham Linehan": "Graham Linehan"
    },
    {
        ", who was to cast him as Father Dougal McGuire in  Father Ted  . In 1995 he received the Top TV Comedy Newcomer at the British Comedy Awards for this role. In 1995, he appeared in a ": null
    },
    {
        "Channel 4": "Channel 4"
    },
    {
        " ident": "Television Ident"
    },
    {
        " , and during ": null
    },
    {
        "Comic Relief": "Comic Relief"
    },
    {
        " on BBC1. This was followed by the award-winning short comedy film  Flying Saucer RocknRoll .     OHanlon moved into straight acting alongside ": null
    },
    {
        "Emma Fielding": "Emma Fielding"
    },
    {
        " and ": null
    },
    {
        "Beth Goddard": "Beth Goddard"
    },
    {
        " in the ": null
    },
    {
        "ITV": "Itv"
    },
    {
        " comedy-drama Big Bad World, which aired for two series in summer 1999 and winter 2001. He also played a minor role in  The Butcher Boy  as Joes father, and appeared in an episode of the original  Whose Line is it Anyway? .     In 2000, OHanlon starred in the comedy series  My Hero , in which he played a very naive superhero from the planet Ultron. His character juggled world-saving heroics with life in suburbia. He stayed in the role until the first episode of series 6 in July 2006 where he was replaced by ": null
    },
    {
        "James Dreyfus": "James Dreyfus"
    },
    {
        " during the same episode.     He also provided the voice of the lead character in the three Christmas television cartoon specials of  Robbie the Reindeer . He appeared in the 2005 ": null
    },
    {
        "BBC One": "Bbc One"
    },
    {
        " sitcom  Blessed , written by ": null
    },
    {
        "Ben Elton": "Ben Elton"
    },
    {
        "; at the 2005 British Comedy Awards, it was publicly slated by ": null
    },
    {
        "Jonathan Ross": "Jonathan Ross"
    },
    {
        ", albeit in jest. Towards the end of 2005, he played an eccentric Scottish character, Coconut Tam, in the family-based film,  The Adventures of Greyfriars Bobby . Although more commonly on television, he has appeared on radio – on 18 July 2011, he appeared on  Quote... Unquote . Appropriately, one of his questions concerned a quotation from Father Ted. In 2015 he appeared as incompetent angel Smallbone in the sitcom The Best Laid Plans, also on ": null
    },
    {
        "BBC Radio 4": "Bbc Radio 4"
    },
    {
        ".     In 2006, OHanlon wrote and presented an ": null
    },
    {
        "RTÉ": "Raidió Teilifís Éireann"
    },
    {
        " television series called Leagues Apart, which saw him investigate the biggest and most passionate football rivalries in a number of European countries. Included were Roma vs Lazio in Italy, Barcelona vs Real Madrid in Spain, and Galatasaray vs Fenerbahce in ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        ". He followed this with another RTÉ show, So You Want To Be Taoiseach? in 2007. It was a political series where OHanlon gave tongue-in-cheek advice on how to go about becoming ": null
    },
    {
        "Taoiseach": "Taoiseach"
    },
    {
        " of Ireland.     He appeared in the  Doctor Who  episode ": null
    },
    {
        "Gridlock": "Gridlock"
    },
    {
        " , broadcast on 14 April 2007, in which he played a cat-like creature named Thomas Kincade Brannigan.  OHanlon appears in Series 3 of the TV show  Skins , playing Naomi Campbell s Politics teacher named Kieran, who attempted to kiss her. He then went on to form a relationship with Naomis mother . OHanlon plays the lead role in Irish comedy television programme  Val Falvey, TD  on ": null
    },
    {
        "RTÉ One": "Rté One"
    },
    {
        ". He has recently performed in the ": null
    },
    {
        "Edinburgh Fringe": "Edinburgh Fringe"
    },
    {
        ".     In February 2011, OHanlon returned to the ": null
    },
    {
        "Gate Theatre": "Gate Theatre"
    },
    {
        ", Dublin starring in the Irish premiere of Christopher Hamptons translation of Yasmina Rezas  God of Carnage , alongside ": null
    },
    {
        "Maura Tierney": "Maura Tierney"
    },
    {
        ".     In 2011, he appeared in the comedy panel show  Argumental .     OHanlon has written a novel,  The Talk of the Town  , which was published in 1998. The novel is about a teenage boy, Patrick Scully, and his friends.     In February 2015 he officially launched the 2015 Sky ": null
    },
    {
        "Cat Laughs": "Cat Laughs"
    },
    {
        " Comedy Festival which takes place in Kilkenny from 28 May–1 June.  In 2015 he played the role of Peter the Milkman in the ": null
    },
    {
        "Sky 1": "Sky 1"
    },
    {
        " sitcom  After Hours .     On 2 February 2017, it was announced he would play the lead role in the BBC crime drama  Death in Paradise  taking the role of DI Jack Mooney following ": null
    },
    {
        "Kris Marshalls": "Kris Marshall"
    },
    {
        " departure the same day.              OHanlon has been doing stand-up comedy for many years, appearing on many shows including ": null
    },
    {
        "Live at the Apollo": "Live At The Apollo"
    },
    {
        ", ": null
    },
    {
        "Michael McIntyres Comedy Roadshow": "Michael Mcintyres Comedy Roadshow"
    },
    {
        " and ": null
    },
    {
        "Daves One Night Stand": "Daves One Night Stand"
    },
    {
        ". In 1994 he won the ": null
    },
    {
        "Hackney Empire New Act of the Year": "Hackney Empire New Act Of The Year"
    },
    {
        ".                 OHanlon is married to Melanie, whom he met as a teenager; they have three children: Emily, Rebecca and Red.  He is a supporter of ": null
    },
    {
        "Leeds United": "Leeds United F.C."
    },
    {
        ". ": null
    }
]