[
    {
        "     The Armed Forces of the Republic of Tajikistan  is the national military of the ": null
    },
    {
        "Republic of Tajikistan": "Republic Of Tajikistan"
    },
    {
        ". It consists of ": null
    },
    {
        "National Army": "Tajik National Army"
    },
    {
        ", ": null
    },
    {
        "Mobile Forces": "Tajik Mobile Forces"
    },
    {
        ", ": null
    },
    {
        "Air Force": "Tajik Air Force"
    },
    {
        ", ": null
    },
    {
        "Presidential National Guard": "Presidential National Guard"
    },
    {
        ", ": null
    },
    {
        "border": "Tajik Border Troops"
    },
    {
        " and ": null
    },
    {
        "internal troops": "Tajik Internal Troops"
    },
    {
        ". There are also significant ": null
    },
    {
        "Russian forces": "Armed Forces Of The Russian Federation"
    },
    {
        " in the country, principally the ": null
    },
    {
        "201st Motor Rifle Division": "201St Motor Rifle Division"
    },
    {
        ".     Unlike the other former Soviet states of Central Asia, ": null
    },
    {
        "Tajikistan": "Tajikistan"
    },
    {
        " did not form armed forces based upon former Soviet units on its territory. Instead, the Russian ": null
    },
    {
        "Ministry of Defence": "Ministry Of Defence"
    },
    {
        " took control of the ": null
    },
    {
        "Dushanbe": "Dushanbe"
    },
    {
        "-based 201st Motor Rifle Division. Control simply shifted from the former district headquarters in ": null
    },
    {
        "Tashkent": "Tashkent"
    },
    {
        ", which was in now-independent ": null
    },
    {
        "Uzbekistan": "Uzbekistan"
    },
    {
        ", to Moscow. Also present in Tajikistan was a large contingent of Soviet border guards, which transitioned into a Russian-officered force with Tajik conscripts. For a long period a ": null
    },
    {
        "CIS": "Commonwealth Of Independent States"
    },
    {
        " peacekeeping force, built around the 201st MRD, were in place in the country.     Due to the presence of Russian forces in the country and the ": null
    },
    {
        "Civil war in Tajikistan": "Civil War In Tajikistan"
    },
    {
        ", Tajikistan only formally legalised the existence of its armed forces in April 1994. Janes World Armies 2004 During the 1990s, the armed forces were often suffered from a poor commanded structure and poor discipline while their equipment was under-maintained. Draft-dodging and desertion was commonplace. Reflecting the fragmented militia group origin of the armys units, in late 1995 the Mahmud and Faizali Brigades of the Army exchanged fire several times, and fighting again broke out between the Army Rapid Reaction Brigade and the Presidential Guard in June 1996. Colonel Khudoiberdiev, commander of the Rapid Reaction Brigade was relieved of his command as a result.     In September 2013, the ": null
    },
    {
        "Russian government": "Russian Federation"
    },
    {
        " has given the Tajik military $200 million worth of weapons and hardware, in return for letting them continue to use the 201st base. The ": null
    },
    {
        "National Drug Enforcement Agency": "National Drug Enforcement Agency"
    },
    {
        " of Tajikistan has received $5 million.              Tajikistan is the only former ": null
    },
    {
        "Soviet": "Soviet"
    },
    {
        " republic that did not form its armed forces from old ": null
    },
    {
        "Soviet Army": "Soviet Army"
    },
    {
        " units. Instead, the ": null
    },
    {
        "Russian Defense Ministry": "Ministry Of Defense"
    },
    {
        " took direct command of the Soviet units there, forcing the Tajik regime to build an army from virtually nothing. During the 1990s, the army was small and had little amounts of native Tajiks in it. The army failed to effectively defend the regime, which resulted in a civil war. The regime was dependent on other Central Asian countries and CIS states on security, to the point that if they decided to withdraw their forces, the regime would collapse.     During the Tajik civil war , the Russian government had around 22,000 to 25,000 troops stationed in Tajikistan to help the regime as part of a defense agreement, which is why the Tajik government was able to survive the war. The war was often thought to have been started by ": null
    },
    {
        "Islamic fundamentalists": "Islamic Fundamentalist"
    },
    {
        ", but more accurately, it was a war between the regional clans and ethnic groups.     The Tajik regime began assembling their own army in February 1993. The first units were drawn from the militias who fought in the civil war, allowing them to keep their ideologies and original commanders. That caused them to refuse to accept orders from higher authorities, and for skirmishes to break out between units. In early 1996, a rebellion occurred by the First Brigade of the Presidential Guard, after they fought and defeated the 11th Brigade. Though they were ultimately defeated in an attempt to take ": null
    },
    {
        "Dushanbe": "Dushanbe"
    },
    {
        ", the leader escaped to nearby ": null
    },
    {
        "Uzbekistan": "Uzbekistan"
    },
    {
        ".     By the mid 1990s, the National Army numbered to around 3,000. The majority of the officer corps were Russian, mostly veterans of the war in ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ". The Ministry of Defense of Russia continued providing material support for the National Army. It was especially difficult for the Army to create its own military force due to the fact that many Tajiks preferred to serve in the ": null
    },
    {
        "Russian Army": "Russian Army"
    },
    {
        ", due to the higher pay. Because of military opposition in the country, the regime had the largest military buildup in the Central Asian region. As of 1997, Tajikistan had two motorized rifle brigades , a special operations brigade and detachment , and a combined aviation squadron. Tajikistan further had a basic set of units and sub units that provide operational, technical and logistic support.     Russia provided much support toward the creation of the national army, and trained command and engineer personnel. An institute of higher military education was created in Tajikistan. Despite the large budget and the adequate training of personnel, the creation of the national army was proceeding very slowly. The army benefited from several United Tajik Opposition units that were experienced from fighting government forces during the civil war, but as of 2006, were poorly maintained and funded. At that time the army had 44 main battle tanks, 34 armored infantry fighting vehicles, 29 armored personnel carriers, 12 pieces of towed artillery, 10 multiple rocket launchers, 9 mortars, and 20 surface-to-air missiles.        The Tajikistan army in 2007 had two motorized rifle brigades, one mountain brigade, one artillery brigade, one airborne assault brigade, one airborne assault detachment, and one surface-to-air missile regiment. The airborne assault brigade is an elite ": null
    },
    {
        "special forces": "Special Forces"
    },
    {
        " unit which Tajikistan has made a separate branch from the national army, the ": null
    },
    {
        "Tajik Mobile Forces": "Tajik Mobile Forces"
    },
    {
        ". Some troops are trained by China, France, ": null
    },
    {
        "India": "India"
    },
    {
        ", Russia, and the United States. The Peacekeeping Operations, or PKO Battalion, became one of the best units of the National Army due to it being trained by the ": null
    },
    {
        "National Guard of the United States": "National Guard Of The United States"
    },
    {
        " in a partnership program. The US intended for the battalion to be sent as a peacekeeper unit along with other United Nations forces, perhaps in 2013.          The national army is being run in a Soviet-style. The American trainers are working on setting up a ": null
    },
    {
        "non-commissioned officer": "Non-Commissioned Officer"
    },
    {
        " corps within the army to train enlisted personnel, though it is a process that will take time, and for the time being the officers train enlisted personnel. The ": null
    },
    {
        "United States government": "United States Government"
    },
    {
        " has decided that after ": null
    },
    {
        "ISAF": "Isaf"
    },
    {
        " troops pull out of ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ", tens of millions of dollars worth of equipment will be given to the armies of Tajikistan and Uzbekistan, due to the fact that the ": null
    },
    {
        "Afghan National Army": "Afghan National Army"
    },
    {
        " has ties to the ": null
    },
    {
        "Taliban": "Taliban"
    },
    {
        " and is not stable.       ": null
    },
    {
        "T-72": "T-72"
    },
    {
        " – 123       ": null
    },
    {
        "T-62": "T-62"
    },
    {
        " - 35             Throughout the 1990s, the military did not have an air force and relied on the ": null
    },
    {
        "Russian Air Force": "Russian Air Force"
    },
    {
        " for air defense, however, the government planned on making one aviation squadron. In 2007, the Air Force had 800 troops and 12 helicopters. The organizational structure of the Air Force is unknown. Tajik airspace is patrolled by the Russian Air Force.     The Tajik Air Force remains small as Dushanbe doesnt expect an attack on Tajikistan from the air, and that Russian Air Force units at Gissar in Tajikistan and other such Russian contingents in Kazakhstan would detect any such assault. Tajikistan is also patrolled by Russian aircraft as part of the ": null
    },
    {
        "Joint CIS Air Defense System": "Joint Cis Air Defense System"
    },
    {
        ". The air force is mostly used for search and rescue missions, transportation, and the occasional attack on militant groups.     For funding, the government relied upon modest foreign funds. In February 2013, a ": null
    },
    {
        "20th anniversary parade": "Armed Forces Day"
    },
    {
        " occurred in Dushanbe, celebrating the creation of the armed forces. During the parade, 20 helicopters flew over the city. India made a deal in which the Tajik and Russian Air Forces share an air base. The base is commanded jointly by Indian, Tajik, and Russian personnel, who rotate units there periodically.      Because of the civil war, air force development was slow. The first equipment to arrive was 10 MI-8MTBs and 5 MI-24 in 1993 based at Dushanbe. The first transport aircraft were AN-24s and AN-26s were supplied in 1996. A plan from the 1990s to acquire SU-25s from Belarus to form an attack squadron did not occur. However, Moscow did help bolster the Tajiks helicopter contingents in 2006–07 by giving them six ": null
    },
    {
        "Mil Mi-8": "Mil Mi-8"
    },
    {
        " and ": null
    },
    {
        "Mil Mi-24 Hind": "Mil Mi-24 Hind"
    },
    {
        " attack helicopters. It also provided four ": null
    },
    {
        "L-39 Albatros": "L-39 Albatros"
    },
    {
        ".     An accident occurred on 6 October 2010 when a ": null
    },
    {
        "Mi-8": "Mil Mi-8"
    },
    {
        ", military helicopter from the Tajik National Guard crashed in the ": null
    },
    {
        "Rasht Valley": "Rasht Valley"
    },
    {
        "  close to ": null
    },
    {
        "Ezgand": "Ezgand"
    },
    {
        " and ": null
    },
    {
        "Tavildara": "Tavildara"
    },
    {
        ". The helicopter got caught in some power lines while attempting to land. The helicopter caught fire and crashed without survivors. This is the deadliest accident in Tajik aviation since 1997.                    The Tajik National Guard is a special task force under direct command of the President of Tajikistan. Formed on 4 December 1992, it was originally a ": null
    },
    {
        "special forces": "Special Forces"
    },
    {
        " unit known as the Brigade of Special Mission during the 16th session of the ": null
    },
    {
        "Supreme Council of Tajikistan": "Supreme Assembly"
    },
    {
        ", under the ": null
    },
    {
        "Tajik Interior Ministry": "Ministry Of Internal Affairs"
    },
    {
        ". During its first years, the Guard underwent serious testing, which earned the trust of the President and the people. It was the reason why the President changed it from the Special Mission to the Presidential National Guard.     Their primary task is ensuring public safety and security. Within two years, four additional units were formed in the towns of ": null
    },
    {
        "Chkalovsk": "Chkalovsk, Tajikistan"
    },
    {
        ", Kalinin, and ": null
    },
    {
        "Obigarm": "Obigarm"
    },
    {
        ". They had a similar structure to the rest of the military. Worthy of note is the honesty that the National Guard has exhibited. The Rapid Reaction Force, also called the First Brigade, under Colonel Mahmud Khudoiberdiyev, took part in the Tajik civil war, as part of the Guard and the regular Army. It became one of the most effective fighting units within the Army, but picked a fight with the 11th Brigade. They defeated the 11th, and attempted to take the capitol, but were defeated by another Guard unit and street thugs armed with AK-47s. The colonel and his men fled into ": null
    },
    {
        "Uzbekistan": "Uzbekistan"
    },
    {
        ".     On 26 January 2004, the Presidential Guard was transformed into the National Guard. During the inauguration of the President on 18 November 2006, the Guard received the honor of presenting the Tajik state symbols.                  The Border Troops of Tajikistan are responsible for border security and operate often with the ": null
    },
    {
        "Afghan Border Police": "Afghan Border Police"
    },
    {
        ". Development of the border guard is overseen by the ": null
    },
    {
        "Organization for Security and Co-operation in Europe": "Organization For Security And Co-Operation In Europe"
    },
    {
        ".  A ": null
    },
    {
        "Border Troops Academy": "Border Troops Academy"
    },
    {
        " is located in ": null
    },
    {
        "Dushanbe": "Dushanbe"
    },
    {
        ", while a ": null
    },
    {
        "Border Troops Training Centre": "Border Troops Training Centre"
    },
    {
        " is found to the south in the ": null
    },
    {
        "Rudaki District": "Rudaki District"
    },
    {
        ".  In 2011, the Border Troops, along with the National Army and Mobile Forces, took part in a joint war game with ": null
    },
    {
        "Kyrgyzstan": "Kyrgyzstan"
    },
    {
        " on the Kyrgyz-Tajik border. The operation involved eliminating two attacking groups of terrorists. ": null
    }
]