[
    {
        "            Arminianism is a branch of ": null
    },
    {
        "Protestantism": "Protestantism"
    },
    {
        " based on the ": null
    },
    {
        "theological": "Christian Theology"
    },
    {
        " ideas of the ": null
    },
    {
        "Dutch Reformed": "Dutch Reformed"
    },
    {
        " theologian ": null
    },
    {
        "Jacobus Arminius": "Jacobus Arminius"
    },
    {
        " and his historic supporters known as ": null
    },
    {
        "Remonstrants": "Remonstrants"
    },
    {
        ". His teachings held to the ": null
    },
    {
        "five solae": "Five Solae"
    },
    {
        " of the ": null
    },
    {
        "Reformation": "Reformation"
    },
    {
        ", but they were distinct from particular teachings of ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        ", ": null
    },
    {
        "Huldrych Zwingli": "Huldrych Zwingli"
    },
    {
        ", ": null
    },
    {
        "John Calvin": "John Calvin"
    },
    {
        ", and other ": null
    },
    {
        "Protestant Reformers": "Protestant Reformers"
    },
    {
        ". Jacobus Arminius was a student of ": null
    },
    {
        "Theodore Beza": "Theodore Beza"
    },
    {
        " at the Theological University of Geneva. Arminianism is known to some as a ": null
    },
    {
        "soteriological": "Soteriological"
    },
    {
        " diversification of ": null
    },
    {
        "Calvinism": "Calvinism"
    },
    {
        "; to others, Arminianism is a reclamation of early Church theological consensus.     Dutch Arminianism was originally articulated in the Remonstrance , a theological statement signed by 45 ministers and submitted to the ": null
    },
    {
        "States General of the Netherlands": "States General Of The Netherlands"
    },
    {
        ". The ": null
    },
    {
        "Synod of Dort": "Synod Of Dort"
    },
    {
        " was called by the States General to consider the ": null
    },
    {
        "Five Articles of Remonstrance": "Five Articles Of Remonstrance"
    },
    {
        ". These articles asserted that     Salvation was conditioned by the graciously-enabled faith of man;   The ": null
    },
    {
        "Atonement": "Atonement In Christianity"
    },
    {
        " is qualitatively adequate for all men, yet that no one actually enjoys this forgiveness of sins, except the believer ... and thus is limited to only those who trust in Christ;   That man has not saving grace of himself, nor of the energy of his free will, and unaided by the ": null
    },
    {
        "Holy Spirit": "Holy Spirit"
    },
    {
        ", no person is able to respond to Gods will;   The ": null
    },
    {
        " Grace": "Grace In Christianity"
    },
    {
        " of God is the beginning, continuance, and accomplishment of any good, yet man may resist the Holy Spirit; and   Believers are able to resist sin through Grace, and Christ will keep them from falling; but whether they are beyond the possibility of ultimately forsaking God or becoming devoid of grace ... must be more particularly determined from the Scriptures.     These points , note Keith D. Stanglin and Thomas H. McCall, are consistent with the views of Arminius; indeed, some come verbatim from his Declaration of Sentiments. Those who signed this remonstrance and others who supported its theology have since been known as ": null
    },
    {
        "Remonstrants": "Remonstrants"
    },
    {
        ".      Many Christian denominations have been influenced by Arminian views on the will of man being freed by Grace prior to regeneration, notably the ": null
    },
    {
        "Baptists": "Baptists"
    },
    {
        " in the 16th century, the ": null
    },
    {
        "Methodists": "Methodists"
    },
    {
        " in the 18th century and the ": null
    },
    {
        "Seventh-day Adventist Church": "Seventh-Day Adventist Church"
    },
    {
        " in the 19th century. Some falsely assert that ": null
    },
    {
        "Universalists": "Christian Universalism"
    },
    {
        " and ": null
    },
    {
        "Unitarians": "Unitarianism"
    },
    {
        " in the 18th and 19th centuries were theologically linked with Arminianism. Denominations such as the ": null
    },
    {
        "Anabaptists": "Anabaptists"
    },
    {
        " , ": null
    },
    {
        "Waldensians": "Waldensians"
    },
    {
        " , and other groups prior to the Reformation have also affirmed that each person may choose the contingent response of either resisting Gods grace or yielding to it.     The original beliefs of Jacobus Arminius himself are commonly defined as Arminianism, but more broadly, the term may embrace the teachings of ": null
    },
    {
        "Simon Episcopius": "Simon Episcopius"
    },
    {
        ", ": null
    },
    {
        "Hugo Grotius": "Hugo Grotius"
    },
    {
        ", ": null
    },
    {
        "John Wesley": "John Wesley"
    },
    {
        ", and others as well. ": null
    },
    {
        "Classical Arminianism": "Arminianismclassical Arminianism"
    },
    {
        ", to which Arminius is the main contributor, and ": null
    },
    {
        "Wesleyan Arminianism": "Arminianismwesleyan Arminianism"
    },
    {
        ", to which John Wesley is the main contributor, are the two main schools of thought. Wesleyan Arminianism is often identical with Methodism. Some schools of thought, notably ": null
    },
    {
        "semi-Pelagianism": "Semipelagianism"
    },
    {
        "—which teaches that the first step of Salvation is by human will—are confused as being Arminian in nature. But classical Arminianism holds that the first step of Salvation is solely the grace of God. Historically, the ": null
    },
    {
        "Council of Orange ": "Council Of Orange"
    },
    {
        " condemned semi-Pelagian thought , and is accepted by some as a document which can be understood as teaching a doctrine between ": null
    },
    {
        "Augustinian": "Augustinian"
    },
    {
        " thought and semi-Pelagian thought, relegating Arminianism to the orthodoxy of the early Church fathers.     The two systems of Calvinism and Arminianism share both history and many doctrines, and the ": null
    },
    {
        "history of Christian theology": "History Of Christianity"
    },
    {
        ". Arminianism is related to ": null
    },
    {
        "Calvinism": "Calvinism"
    },
    {
        " historically. However, because of their differences over the doctrines of divine ": null
    },
    {
        "predestination": "Predestination"
    },
    {
        " and election, many people view these schools of thought as opposed to each other. The distinction is whether God allows His desire to save all to be resisted by an individuals will or if Gods grace is irresistible and limited to only some . Put another way, is Gods sovereignty shown, in part, through His allowance of free decisions? Some Calvinists assert that the Arminian perspective presents a synergistic system of Salvation and therefore is not only by Grace, while Arminians firmly reject this conclusion. Many consider the theological differences to be crucial differences in doctrine, while others find them to be relatively minor.             Jacobus Arminius was a Dutch pastor and theologian in the late 16th and early 17th centuries. He was taught by ": null
    },
    {
        "Theodore Beza": "Theodore Beza"
    },
    {
        ", ": null
    },
    {
        "Calvins": "John Calvin"
    },
    {
        " hand-picked successor, but after examination of the scriptures, he rejected his teachers theology that it is God who unconditionally elects some for salvation. Instead Arminius proposed that the election of God was of believers, thereby making it ": null
    },
    {
        "conditional on faith": "Conditional Election"
    },
    {
        ". Arminiuss views were challenged by the Dutch Calvinists, especially ": null
    },
    {
        "Franciscus Gomarus": "Franciscus Gomarus"
    },
    {
        ", but Arminius died before a national synod could occur.     Arminiuss followers, not wanting to adopt their leaders name, called themselves the ": null
    },
    {
        "Remonstrants": "Remonstrants"
    },
    {
        ". Arminius died before he could satisfy Hollands State Generals request for a 14-page paper outlining his views. The Remonstrants replied in his stead crafting the ": null
    },
    {
        "Five articles of Remonstrance": "Five Articles Of Remonstrance"
    },
    {
        ", in which they express their points of divergence with the stricter ": null
    },
    {
        "Calvinism": "Calvinism"
    },
    {
        " of the  Belgic Confession . After some political maneuvering, the Dutch Calvinists were able to convince ": null
    },
    {
        "Prince Maurice of Nassau": "Maurice De Nassau"
    },
    {
        " to deal with the situation. Maurice systematically removed Arminian magistrates from office and called a national synod at Dordrecht. This ": null
    },
    {
        "Synod of Dort": "Synod Of Dort"
    },
    {
        " was open primarily to Dutch Calvinists , while the Arminians were excluded , with Calvinist representatives from other countries , and in 1618 published a condemnation of Arminius and his followers as heretics. Part of this publication was the famous ": null
    },
    {
        "Five points of Calvinism": "Five Points Of Calvinism"
    },
    {
        " in response to the five articles of Remonstrance.     Arminians across Holland were removed from office, imprisoned, banished, and sworn to silence. Twelve years later Holland officially granted Arminianism protection as a religion, although animosity between Arminians and Calvinists continued.       The debate between Calvins followers and Arminiuss followers is characteristic of post-Reformation church history. The emerging Baptist movement in 17th-century England, for example, was a microcosm of the historic debate between Calvinists and Arminians. The first Baptists—called ": null
    },
    {
        "General Baptists": "General Baptists"
    },
    {
        " because of their confession of a general or unlimited atonement—were Arminians. The Baptist movement originated with ": null
    },
    {
        "Thomas Helwys": "Thomas Helwys"
    },
    {
        ", who left his mentor John Smyth and returned to London to start the first English Baptist Church in 1611. Later General Baptists such as John Griffith, Samuel Loveday, and ": null
    },
    {
        "Thomas Grantham": "Thomas Grantham"
    },
    {
        " defended a Reformed Arminian theology that reflected more the Arminianism of Arminius than that of the later Remonstrants or the English Arminianism of Arminian ": null
    },
    {
        "Puritans": "Puritans"
    },
    {
        " like John Goodwin or Anglican Arminians such as ": null
    },
    {
        "Jeremy Taylor": "Jeremy Taylor"
    },
    {
        " and ": null
    },
    {
        "Henry Hammond": "Henry Hammond"
    },
    {
        ". The General Baptists encapsulated their Arminian views in numerous confessions, the most influential of which was the Standard Confession of 1660. In the 1640s the Particular Baptists were formed, diverging strongly from Arminian doctrine and embracing the strong Calvinism of the Presbyterians and Independents. Their robust Calvinism was publicized in such confessions as the London Baptist Confession of 1644 and the Second London Confession of 1689. The London Confession of 1689 was later used by Calvinistic Baptists in America , whereas the Standard Confession of 1660 was used by the American heirs of the English General Baptists, who soon came to be known as ": null
    },
    {
        "Free Will Baptists": "Free Will Baptists"
    },
    {
        ".       This same dynamic between Arminianism and ": null
    },
    {
        "Calvinism": "Calvinism"
    },
    {
        " can be seen in the heated discussions between friends and fellow ": null
    },
    {
        "Anglican": "Anglican"
    },
    {
        " ministers ": null
    },
    {
        "John Wesley": "John Wesley"
    },
    {
        " and ": null
    },
    {
        "George Whitefield": "George Whitefield"
    },
    {
        ". Wesley was a champion of Arminian teachings, defending his ": null
    },
    {
        "soteriology": "Soteriology"
    },
    {
        " in a periodical titled The Arminian and writing articles such as Predestination Calmly Considered. He defended Arminianism against charges of ": null
    },
    {
        "semi-Pelagianism": "Semi-Pelagianism"
    },
    {
        ", holding strongly to beliefs in ": null
    },
    {
        "original sin": "Original Sin"
    },
    {
        " and total depravity. At the same time, Wesley attacked the ": null
    },
    {
        "determinism": "Determinism"
    },
    {
        " that he claimed characterized unconditional election and maintained a belief in the ": null
    },
    {
        "ability to lose salvation": "Conditional Preservation Of The Saints"
    },
    {
        ". Wesley also clarified the doctrine of ": null
    },
    {
        "prevenient grace": "Prevenient Grace"
    },
    {
        " and preached the ability of Christians to attain to ": null
    },
    {
        "perfection": "Christian Perfection"
    },
    {
        " . While Wesley freely made use of the term Arminian, he did not self-consciously root his soteriology in the theology of Arminius but was highly influenced by 17th-century ": null
    },
    {
        "English Arminianism": "Arminianism In The Church Of England"
    },
    {
        " and thinkers such as ": null
    },
    {
        "John Goodwin": "John Goodwin"
    },
    {
        ", ": null
    },
    {
        "Jeremy Taylor": "Jeremy Taylor"
    },
    {
        " and ": null
    },
    {
        "Henry Hammond": "Henry Hammond"
    },
    {
        " of the Anglican Holy Living school, and the Remonstrant ": null
    },
    {
        "Hugo Grotius": "Hugo Grotius"
    },
    {
        ".            Advocates of both Arminianism and Calvinism find a home in many Protestant denominations, and sometimes both exist within the same denomination. Faiths leaning at least in part in the Arminian direction include ": null
    },
    {
        "Methodists": "Methodism"
    },
    {
        ", ": null
    },
    {
        "Free Will Baptist": "Free Will Baptist"
    },
    {
        "s, ": null
    },
    {
        "Christian Churches and Churches of Christ": "Christian Churches And Churches Of Christ"
    },
    {
        ", ": null
    },
    {
        "General Baptist": "General Baptist"
    },
    {
        "s, the ": null
    },
    {
        "Seventh-day Adventist Church": "Seventh-Day Adventist Church"
    },
    {
        ", ": null
    },
    {
        "Church of the Nazarene": "Church Of The Nazarene"
    },
    {
        ", ": null
    },
    {
        "The Wesleyan Church": "The Wesleyan Church"
    },
    {
        ", ": null
    },
    {
        "The Salvation Army": "The Salvation Army"
    },
    {
        ", ": null
    },
    {
        "Conservative Mennonites": "Conservative Mennonites"
    },
    {
        ", ": null
    },
    {
        "Old Order Mennonites": "Old Order Mennonites"
    },
    {
        ", ": null
    },
    {
        "Amish": "Amish"
    },
    {
        " and ": null
    },
    {
        "Charismatics": "Charismatic Christianity"
    },
    {
        ", including the ": null
    },
    {
        "Pentecostals": "Pentecostalism"
    },
    {
        ". Denominations leaning in the Calvinist direction are grouped as the ": null
    },
    {
        "Reformed churches": "Reformed Churches"
    },
    {
        " and include ": null
    },
    {
        "Particular Baptist": "Particular Baptist"
    },
    {
        "s, ": null
    },
    {
        "Reformed Baptist": "Reformed Baptist"
    },
    {
        "s, ": null
    },
    {
        "Presbyterian": "Presbyterian"
    },
    {
        "s, and ": null
    },
    {
        "Congregationalists": "Congregational Church"
    },
    {
        ". The majority of ": null
    },
    {
        "Southern Baptists": "Southern Baptists"
    },
    {
        ", including ": null
    },
    {
        "Billy Graham": "Billy Graham"
    },
    {
        ", accept Arminianism with an exception allowing for a doctrine of ": null
    },
    {
        "perseverance of the saints": "Perseverance Of The Saints"
    },
    {
        " . Many see Calvinism as growing in acceptance, and some prominent Reformed Baptists, such as ": null
    },
    {
        "Albert Mohler": "Albert Mohler"
    },
    {
        " and ": null
    },
    {
        "Mark Dever": "Mark Dever"
    },
    {
        ", have been pushing for the ": null
    },
    {
        "Southern Baptist Convention": "Southern Baptist Convention"
    },
    {
        " to adopt a more Calvinistic orientation . ": null
    },
    {
        "Lutherans": "Lutheranism"
    },
    {
        " espouse a view of salvation and election distinct from both the Calvinist and Arminian schools of ": null
    },
    {
        "soteriology": "Soteriology"
    },
    {
        ".     The current scholarly support for Arminianism is wide and varied. One particular thrust is a return to the teachings of Arminius. ": null
    },
    {
        "Roger E. Olson": "Roger E. Olson"
    },
    {
        ", F. Leroy Forlines, Robert Picirilli, and J. Matthew Pinson are four of the supporters of this type of arminianism. Forlines and Olson have referred to it as Classical Arminianism,  while Picirilli, Pinson, have termed it Reformation Arminianism  or Reformed Arminianism.  Through ": null
    },
    {
        "Methodism": "Methodism"
    },
    {
        ", Wesleys teachings also inspire a large scholarly following, with vocal proponents including ": null
    },
    {
        "J. Kenneth Grider": "J. Kenneth Grider"
    },
    {
        ", ": null
    },
    {
        "Stanley Hauerwas": "Stanley Hauerwas"
    },
    {
        ", ": null
    },
    {
        "Thomas Oden": "Thomas Oden"
    },
    {
        ", ": null
    },
    {
        "Thomas Jay Oord": "Thomas Jay Oord"
    },
    {
        ", and ": null
    },
    {
        "William Willimon": "William Willimon"
    },
    {
        ".          Arminian theology usually falls into one of two groups—Classical Arminianism, drawn from the teaching of Jacobus Arminius—and Wesleyan Arminian, drawing primarily from Wesley. Both groups overlap substantially.       Classical Arminianism is the theological system that was presented by ": null
    },
    {
        "Jacobus Arminius": "Jacobus Arminius"
    },
    {
        " and maintained by some of the ": null
    },
    {
        "Remonstrants": "Remonstrants"
    },
    {
        "; its influence serves as the foundation for all Arminian systems. A list of beliefs is given below:     Depravity is total : Arminius states In this state, the free will of man towards the true good is not only wounded, infirm, bent, and weakened; but it is also imprisoned, destroyed, and lost. And its powers are not only debilitated and useless unless they be assisted by grace, but it has no powers whatever except such as are excited by Divine grace.  Atonement is intended for all : Jesuss death was for all people, Jesus draws all people to himself, and all people have opportunity for salvation through faith. Jesuss death satisfies Gods justice: The penalty for the sins of the elect is paid in full through Jesuss work on the cross. Thus Christs atonement is intended for all, but requires faith to be effected. Arminius states that Justification, when used for the act of a Judge, is either purely the imputation of righteousness through mercy… or that man is justified before God… according to the rigor of justice without any forgiveness.  Stephen Ashby clarifies: Arminius allowed for only two possible ways in which the sinner might be justified: by our absolute and perfect adherence to the law, or purely by Gods imputation of Christs righteousness.  Grace is resistible: God takes initiative in the salvation process and his grace comes to all people. This grace  acts on all people to convince them of the Gospel, draw them strongly towards salvation, and enable the possibility of sincere faith. Picirilli states that indeed this grace is so close to regeneration that it inevitably leads to regeneration unless finally resisted.  The offer of salvation through grace does not act irresistibly in a purely cause-effect, deterministic method but rather in an influence-and-response fashion that can be both freely accepted and freely denied. Man has a freed will to respond or resist: Free will is granted and limited by Gods sovereignty, but Gods sovereignty allows all men the choice to accept the Gospel of Jesus through faith, simultaneously allowing all men to resist.   Election is conditional : Arminius defined election as the decree of God by which, of Himself, from eternity, He decreed to justify in Christ, believers, and to accept them unto eternal life.  God alone determines who will be saved and his determination is that all who believe Jesus through faith will be justified. According to Arminius, God regards no one in Christ unless they are engrafted in him by faith.  God predestines the elect to a glorious future: Predestination is not the predetermination of who will believe, but rather the predetermination of the believers future inheritance. The elect are therefore predestined to sonship through adoption, glorification, and eternal life. Christs righteousness is imputed to the believer: Justification is sola fide . When individuals repent and believe in Christ , they are regenerated and brought into union with Christ, whereby the death and righteousness of Christ are imputed to them for their justification before God. Eternal security is also conditional : All believers have full assurance of salvation with the condition that they remain in Christ. Salvation is conditioned on faith, therefore perseverance is also conditioned. Apostasy is only committed through a deliberate, willful rejection of Jesus and renunciation of saving faith. Such apostasy is irremediable.     On whether a believer could commit apostasy , Arminius declared that this matter required further study in the Scriptures. Nevertheless, Arminius believed the Scriptures taught that believers are graciously empowered by Christ and the Holy Spirit to fight against Satan, sin, the world and their own flesh, and to gain the victory over these enemies.  Furthermore, Christ and the Spirit are ever present to aid and assist believers through various temptations. But this security was not unconditional but conditional— provided they stand prepared for the battle, implore his help, and be not wanting to themselves, Christ preserves them from falling.  Arminius goes on to say, I never taught that a true believer can, either totally or finally fall away from the faith, and perish; yet I will not conceal, that there are passages of scripture which seem to me to wear this aspect; and those answers to them which I have been permitted to see, are not of such a kind as to approve themselves on all points to my understanding.      After the death of Arminius in 1609, the Remonstrants maintained their leaders view on conditional security and his uncertainty regarding the possibility of believers committing apostasy. This is evidenced in the fifth article drafted by its leaders in 1610. However, sometime between 1610, and the official proceeding of the Synod of Dort , the ": null
    },
    {
        "Remonstrants": "Remonstrants"
    },
    {
        " became fully persuaded in their minds that the Scriptures taught that a true believer was capable of falling away from faith and perishing eternally as an unbeliever. They formalized their views in The Opinion of the Remonstrants , and later in the  Remonstrant Confession  .     Picirilli remarks: Ever since that early period, then, when the issue was being examined again, Arminians have taught that those who are truly saved need to be warned against apostasy as a real and possible danger.      The core beliefs of Jacobus Arminius and the Remonstrants are summarized as such by theologian Stephen Ashby:     Prior to being drawn and enabled, one is unable to believe… able only to resist.   Having been drawn and enabled, but prior to regeneration, one is able to believe… able also to resist.   After one believes, God then regenerates; one is able to continue believing… able also to resist.   Upon resisting to the point of unbelief, one is unable again to believe… able only to resist.             John Wesley has historically been the most influential advocate for the teachings of Arminian soteriology. Wesley thoroughly agreed with the vast majority of what Arminius himself taught, maintaining strong doctrines of original sin, total depravity, conditional election, prevenient grace, unlimited atonement, and the possibility of apostasy.     Wesley departs from Classical Arminianism primarily on three issues:   ; Atonement   : Wesleys atonement is a hybrid of the ": null
    },
    {
        "penal substitution": "Penal Substitution"
    },
    {
        " theory and the ": null
    },
    {
        "governmental": "Atonement"
    },
    {
        " theory of ": null
    },
    {
        "Hugo Grotius": "Hugo Grotius"
    },
    {
        ", a lawyer and one of the Remonstrants. Steven Harper states, Wesley does not place the substitionary element primarily within a legal framework...Rather to bring into proper relationship the justice between Gods love for persons and Gods hatred of sin...it is not the satisfaction of a legal demand for justice so much as it is an act of mediated reconciliation.      ; Possibility of apostasy   : Wesley fully accepted the Arminian view that genuine Christians could apostatize and lose their salvation, as his famous sermon A Call to Backsliders clearly demonstrates. Harper summarizes as follows: the act of committing sin is not in itself ground for the loss of salvation...the loss of salvation is much more related to experiences that are profound and prolonged. Wesley sees two primary pathways that could result in a permanent fall from grace: unconfessed sin and the actual expression of apostasy.  Wesley disagrees with Arminius, however, in maintaining that such apostasy was not final. When talking about those who have made shipwreck of their faith , Wesley claims that not one, or a hundred only, but I am persuaded, several thousands...innumerable are the instances...of those who had fallen but now stand upright.      ; ": null
    },
    {
        "Christian perfection": "Christian Perfection"
    },
    {
        "   : According to Wesleys teaching, Christians could attain a state of practical perfection, meaning a lack of all voluntary sin by the empowerment of the Holy Spirit, in this life. Christian perfection , according to Wesley, is purity of intention, dedicating all the life to God and the mind which was in Christ, enabling us to walk as Christ walked. It is loving God with all our heart, and our neighbor as ourselves . It is a restoration not only to the favour, but likewise to the image of God, our being filled with the fullness of God . Wesley was clear that Christian perfection did not imply perfection of bodily health or an infallibility of judgment. It also does not mean we no longer violate the will of God, for involuntary transgressions remain. Perfected Christians remain subject to temptation, and have continued need to pray for forgiveness and holiness. It is not an absolute perfection but a perfection in love. Furthermore, Wesley did not teach a salvation by perfection, but rather says that, Even perfect holiness is acceptable to God only through Jesus Christ.        Since the time of Arminius his name has come to represent a very large variety of beliefs. Some of these beliefs, such as Pelagianism and semi-Pelagianism  are not considered to be within Arminian orthodoxy and are dealt with elsewhere. Some doctrines, however, do adhere to the Arminian foundation and, while minority views, are highlighted below.          The doctrine of open theism states that God is omnipresent, omnipotent, and omniscient, but differs on the nature of the future. Open theists claim that the future is not completely determined because people have not made their free decisions yet. God therefore knows the future partially in possibilities rather than solely certainties . As such, open theists resolve the issue of human ": null
    },
    {
        "free will": "Free Will"
    },
    {
        " and Gods sovereignty by claiming that God is sovereign because he does not ordain each human choice, but rather works in cooperation with his creation to bring about his will. This notion of sovereignty and freedom is foundational to their understanding of ": null
    },
    {
        "love": "Love"
    },
    {
        " since open theists believe that love is not genuine unless it is freely chosen. The power of choice under this definition has the potential for as much harm as it does good, and open theists see free will as the best answer to the ": null
    },
    {
        "problem of evil": "Problem Of Evil"
    },
    {
        ". Well-known proponents of this theology are ": null
    },
    {
        "Greg Boyd": "Gregory A. Boyd"
    },
    {
        ", ": null
    },
    {
        "Clark Pinnock": "Clark Pinnock"
    },
    {
        ", ": null
    },
    {
        "Thomas Jay Oord": "Thomas Jay Oord"
    },
    {
        ", ": null
    },
    {
        "William Hasker": "William Hasker"
    },
    {
        ", and ": null
    },
    {
        "John E. Sanders": "John E. Sanders"
    },
    {
        ".     Some Arminians, such as professor and theologian Robert Picirilli, reject the doctrine of open theism as a deformed Arminianism . Joseph Dongell stated that open theism actually moves beyond classical Arminianism towards ": null
    },
    {
        "process theology": "Process Theology"
    },
    {
        ".  There are also some Arminians, like Roger Olson, who believe Open theism to be an alternative view that a Christian can have. The majority Arminian view accepts ": null
    },
    {
        "classical theism": "Classical Theism"
    },
    {
        "—the belief that Gods power, knowledge, and presence have no external limitations, that is, outside of his divine nature. Most Arminians reconcile human free will with Gods sovereignty and foreknowledge by holding three points:   Human free will is limited by original sin, though Gods ": null
    },
    {
        "prevenient grace": "Prevenient Grace"
    },
    {
        " restores to humanity the ability to accept Gods call of salvation.           The majority Arminian view is that election is individual and based on Gods foreknowledge of faith, but a second perspective deserves mention. These Arminians reject the concept of individual election entirely, preferring to understand the doctrine in corporate terms. According to this corporate election, God never chose individuals to elect to salvation, but rather He chose to elect the believing church to salvation. Dutch Reformed theologian Herman Ridderbos says does not rest on the fact that the church belongs to a certain number , but that it belongs to Christ, from before the foundation of the world. Fixity does not lie in a hidden decree, therefore, but in corporate unity of the Church with Christ, whom it has come to know in the gospel and has learned to embrace in faith.      Corporate election draws support from a similar concept of corporate election found in the Old Testament and Jewish law. Indeed most biblical scholarship is in agreement that Judeo-Greco-Roman thought in the 1st century was opposite of the Western worlds individual first mantra—it was very collectivist or communitarian in nature. Identity stemmed from membership in a group more than individuality. According to Romans 9–11, supporters claim, Jewish election as the chosen people ceased with their national rejection of Jesus as Messiah. As a result of the new covenant, Gods chosen people are now the corporate body of Christ, the church . The pastor and theologian Brian Abasciano claims What Paul says about Jews, Gentiles, and Christians, whether of their place in God’s plan, or their election, or their salvation, or how they should think or behave, he says from a corporate perspective which views the group as primary and those he speaks about as embedded in the group. These individuals act as members of the group to which they belong, and what happens to them happens by virtue of their membership in the group.      These scholars also maintain that Jesus was the only human ever elected and that individuals must be in Christ through faith to be part of the elect. This was, in fact, Swiss Reformed theologian, ": null
    },
    {
        "Karl Barth": "Karl Barth"
    },
    {
        "s, understanding of the doctrine of election. Joseph Dongell, professor at Asbury Theological Seminary, states the most conspicuous feature of Ephesians 1:3–2:10 is the phrase in Christ, which occurs twelve times in Ephesians 1:3–14 alone...this means that Jesus Christ himself is the chosen one, the predestined one. Whenever one is incorporated into him by grace through faith, one comes to share in Jesus special status as chosen of God.  Markus Barth illustrates the inter-connectedness: Election in Christ must be understood as the election of Gods people. Only as members of that community do individuals share in the benefits of Gods gracious choice.        Understanding Arminianism is aided by understanding the theological alternatives: ": null
    },
    {
        "Pelagianism": "Pelagianism"
    },
    {
        ", ": null
    },
    {
        "semi-Pelagianism": "Semi-Pelagianism"
    },
    {
        ", ": null
    },
    {
        "Lutheranism": "Lutheranism"
    },
    {
        ", and ": null
    },
    {
        "Calvinism": "Calvinism"
    }
]