[
    {
        "        Art Deco, sometimes referred to as Deco, is a style of visual arts, architecture and design that first appeared in France just before ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ". Art Deco influenced the design of buildings, furniture, jewelry, fashion, cars, movie theatres, trains, ": null
    },
    {
        "ocean liners": "Ocean Liner"
    },
    {
        ", and everyday objects such as radios and vacuum cleaners. It took its name, short for Arts Décoratifs, from the ": null
    },
    {
        "Exposition internationale des arts décoratifs et industriels modernes": "International Exhibition Of Modern Decorative And Industrial Arts"
    },
    {
        " held in Paris in 1925. It combined modern styles with fine craftsmanship and rich materials. During its heyday, Art Deco represented luxury, glamour, exuberance, and faith in social and technological progress.     Art Deco was a pastiche of many different styles, sometimes contradictory, united by a desire to be modern. From its outset, Art Deco was influenced by the bold geometric forms of ": null
    },
    {
        "Cubism": "Cubism"
    },
    {
        " and the ": null
    },
    {
        "Vienna Secession": "Vienna Secession"
    },
    {
        "; the bright colors of ": null
    },
    {
        "Fauvism": "Fauvism"
    },
    {
        " and of the ": null
    },
    {
        "Ballets Russes": "Ballets Russes"
    },
    {
        "; the updated craftsmanship of the furniture of the eras of ": null
    },
    {
        "Louis Philippe I": "Louis Philippe I"
    },
    {
        " and ": null
    },
    {
        "Louis XVI": "Louis Xvi"
    },
    {
        "; and the exotic styles of ": null
    },
    {
        "China": "Chinese Art"
    },
    {
        " and ": null
    },
    {
        "Japan": "Japanese Art"
    },
    {
        ", ": null
    },
    {
        "India": "Indian Art"
    },
    {
        ", ": null
    },
    {
        "Persia": "Persian Art"
    },
    {
        ", ": null
    },
    {
        "ancient Egypt": "Art Of Ancient Egypt"
    },
    {
        " and ": null
    },
    {
        "Maya art": "Ancient Maya Art"
    },
    {
        ". It featured rare and expensive materials, such as ebony and ivory, and exquisite craftsmanship. The ": null
    },
    {
        "Chrysler Building": "Chrysler Building"
    },
    {
        " and ": null
    },
    {
        "other skyscrapers of New York built during the 1920s and 1930s": "Art Deco Architecture Of New York City"
    },
    {
        " are monuments of the Art Deco style.     In the 1930s, during the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        ", Art Deco became more subdued. New materials arrived, including ": null
    },
    {
        "chrome plating": "Chrome Plating"
    },
    {
        ", ": null
    },
    {
        "stainless steel": "Stainless Steel"
    },
    {
        ", and ": null
    },
    {
        "plastic": "Plastic"
    },
    {
        ". A sleeker form of the style, called ": null
    },
    {
        "Streamline Moderne": "Streamline Moderne"
    },
    {
        ", appeared in the 1930s; it featured curving forms and smooth, polished surfaces. Renaut, Christophe and Lazé, Christophe, Les Styles de larchitecture et du mobilier , Editions Jean-Paul Gisserot, pages 110–116 Art Deco is one of the first truly international styles, but its dominance ended with the beginning of World War II and the rise of the strictly functional and unadorned styles of ": null
    },
    {
        "modern architecture": "Modern Architecture"
    },
    {
        " and the ": null
    },
    {
        "International Style": "International Style"
    },
    {
        " of architecture that followed.       Art Deco took its name, short for arts décoratifs, from the ": null
    },
    {
        "Exposition Internationale des Arts Décoratifs et Industriels Modernes": "Exposition Internationale Des Arts Décoratifs Et Industriels Modernes"
    },
    {
        " held in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " in 1925, though the diverse styles that characterize Art Deco had already appeared in Paris and ": null
    },
    {
        "Brussels": "Brussels"
    },
    {
        " before ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ".     The term arts décoratifs was first used in France in 1858; published in the Bulletin de la Société française de photographie. , Bibliothèque nationale de France, département Sciences et techniques, 8-V-1012, Bibliothèque nationale de France In 1868,  Le Figaro  newspaper used the term objets dart décoratifs with respect to objects for stage scenery created for the ": null
    },
    {
        "Théâtre de lOpéra": "Salle Le Peletier"
    },
    {
        ". , Bibliothèque nationale de France , , Bibliothèque francophone multimédia de Limoges, 2013-220524, Bibliothèque nationale de France , Bibliothèque nationale de France, département Sciences et techniques, 4-V-1113 In 1875, furniture designers, textile, jewelry and glass designers, and other craftsmen were officially given the status of artists by the French government. In response to this, the École royale gratuite de dessin , founded in 1766 under King ": null
    },
    {
        "Louis XVI": "Louis Xvi Of France"
    },
    {
        " to train artists and artisans in crafts relating to the fine arts, was renamed the  École nationale des arts décoratifs . It took its present name of ENSAD  in 1927.     During the 1925 Exposition, architect ": null
    },
    {
        "Le Corbusier": "Le Corbusier"
    },
    {
        " wrote a series of articles about the exhibition for his magazine LEsprit Nouveau, under the title 1925 EXPO. ARTS. DÉCO. , which were combined into a book, Lart décoratif daujourdhui . The book was a spirited attack on the excesses of the colorful and lavish objects at the Exposition; and on the idea that practical objects such as furniture should not have any decoration at all; his conclusion was that Modern decoration has no decoration .     The actual phrase art déco did not appear in print until 1966, when it featured in the title of the first modern exhibition on the subject, held by the Museum of Decorative Arts in Paris, Les Années 25 : Art déco, Bauhaus, Stijl, Esprit nouveau, which covered the variety of major styles in the 1920s and 1930s.  The term art déco was then used in a 1966 newspaper article by Hillary Gelson in  The Times  , describing the different styles at the exhibit. ,  ,      Art Deco gained currency as a broadly applied stylistic label in 1968 when historian ": null
    },
    {
        "Bevis Hillier": "Bevis Hillier"
    },
    {
        " published the first major academic book on the style:  Art Deco of the 20s and 30s . Hillier noted that the term was already being used by art dealers and cites The Times and an essay named Les Arts Déco in  Elle  magazine as examples of prior usage. In 1971, Hillier organized an exhibition at the ": null
    },
    {
        "Minneapolis Institute of Arts": "Minneapolis Institute Of Arts"
    },
    {
        ", which he details in his book about it, The World of Art Deco.  Benton, Charlotte, Benton, Tim, Wood, Ghislaine, Art Déco dans le monde- 1910-39, 2010, Renaissance du Livre, , pages 16-17            The emergence of Art Deco was closely connected with the rise in status of decorative artists, who until late in the 19th century had been considered simply as artisans. The term arts décoratifs had been invented in 1875, giving the designers of furniture, textiles, and other decoration official status. The Société des artistes décorateurs , or SAD, was founded in 1901, and decorative artists were given the same rights of authorship as painters and sculptors. A similar movement developed in Italy. The first international exhibition devoted entirely to the decorative arts, the Esposizione international dArte decorative moderna, was held in ": null
    },
    {
        "Turin": "Turin"
    },
    {
        " in 1902. Several new magazines devoted to decorative arts were founded in Paris, including Arts et décoration and LArt décoratif moderne. Decorative arts sections were introduced into the annual salons of the Sociéte des artistes français, and later in the Salon dAutomne . French nationalism also played a part in the resurgence of decorative arts; French designers felt challenged by the increasing exports of less expensive German furnishings. In 1911, the SAD proposed the holding of a major new international exposition of decorative arts in 1912. No copies of old styles were to be permitted; only modern works. The exhibit was postponed until 1914, then, because of the war, postponed until 1925, when it gave its name to the whole family of styles known as Déco .     Parisian department stores and fashion designers also played an important part in the rise of Art Deco. Established firms including the luggage maker ": null
    },
    {
        "Louis Vuitton": "Louis Vuitton"
    },
    {
        ", silverware firm ": null
    },
    {
        "Christofle": "Christofle"
    },
    {
        ", glass designer ": null
    },
    {
        "René Lalique": "René Lalique"
    },
    {
        ", and the jewelers ": null
    },
    {
        "Louis Cartier": "Louis Cartier"
    },
    {
        " and ": null
    },
    {
        "Boucheron": "Boucheron"
    },
    {
        ", who all began designing products in more modern styles. Beginning in 1900, department stores had recruited decorative artists to work in their design studios. The decoration of the 1912 Salon dAutomne had been entrusted to the department store  Printemps .  During the same year Printemps created its own workshop called Primavera. By 1920 Primavera employed more than three hundred artists. The styles ranged from the updated versions of Louis XIV, Louis XVI, and especially Louis Philippe furniture made by ": null
    },
    {
        "Louis Süe": "Louis Süe"
    },
    {
        " and the Primavera workshop, to more modern forms from the workshop of the Au Louvre department store. Other designers, including ": null
    },
    {
        "Émile-Jacques Ruhlmann": "Émile-Jacques Ruhlmann"
    },
    {
        " and Paul Foliot refused to use mass production, and insisted that each piece be made individually by hand. The early Art Deco style featured luxurious and exotic materials such as ": null
    },
    {
        "ebony": "Ebony"
    },
    {
        ", ": null
    },
    {
        "ivory": "Ivory"
    },
    {
        " and ": null
    },
    {
        "silk": "Silk"
    },
    {
        ", very bright colors and stylized ": null
    },
    {
        "motifs": "Motif"
    },
    {
        ", particularly baskets and bouquets of flowers of all colors, giving a modernist look. Laurent, Stephane, Lartiste décorateur , in Art Deco, 1910–1939 by Charlotte Benton, Tim Benton and Ghislain Wood , Renaissance du Livre, pages 165–171       The architects of the ": null
    },
    {
        "Vienna Secession": "Vienna Secession"
    },
    {
        " , especially ": null
    },
    {
        "Josef Hoffmann": "Josef Hoffmann"
    },
    {
        ", had a notable influence on Art Deco. His ": null
    },
    {
        "Stoclet Palace": "Stoclet Palace"
    },
    {
        " in Brussels , was a prototype of the Art Deco style, featuring geometric volumes, symmetry, straight lines, concrete covered with marble plaques, finely-sculpted ornament, and lavish interiors, including mosaic friezes by ": null
    },
    {
        "Gustav Klimt": "Gustav Klimt"
    },
    {
        ". Hoffmann was also a founder of the ": null
    },
    {
        "Wiener Werkstätte": "Wiener Werkstätte"
    },
    {
        " , an association of craftsmen and interior designers working in the new style. This became the model for the Compagnie des arts français, created in 1919, which brought together ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        ", and ": null
    },
    {
        "Louis Süe": "Louis Süe"
    },
    {
        ", the first leading French Art Deco designers and decorators. Texier, Simon, Art Déco ": null
    },
    {
        "Stoclet Palace": "Stoclet Palace"
    },
    {
        ", Brussels, by ": null
    },
    {
        "Josef Hoffmann": "Josef Hoffmann"
    },
    {
        " Francois Coignet": "Francois Coignet"
    },
    {
        ". In 1877 ": null
    },
    {
        "Joseph Monier": "Joseph Monier"
    },
    {
        " introduced the idea of strengthening the concrete with a mesh of iron rods in a grill pattern. In 1893 ": null
    },
    {
        "August Perret": "August Perret"
    },
    {
        " built the first concrete garage in Paris, then an apartment building, house, then, in 1913, the ": null
    },
    {
        "Théâtre des Champs-Élysées": "Théâtre Des Champs-Élysées"
    },
    {
        ". The theater was denounced by one critic as the Zeppelin of Avenue Montaigne , an alleged Germanic influence, copied from the ": null
    },
    {
        "Vienna Secession": "Vienna Secession"
    },
    {
        ". Thereafter, the majority of Art Deco buildings were made of reinforced concrete, which gave greater freedom of form and less need for reinforcing pillars and columns. Perret was also a pioneer in covering the concrete with ceramic tiles, both for protection and decoration. The architect ": null
    },
    {
        "Le Corbusier": "Le Corbusier"
    },
    {
        " first learned the uses of reinforced concrete working as a draftsman in Perrets studio.     Other new technologies that were important to Art Deco were new methods in producing plate glass, which were less expensive and allowed much larger and stronger windows, and for mass-producing ": null
    },
    {
        "aluminum": "Aluminum"
    },
    {
        " Théâtre des Champs-Élysées": "Théâtre Des Champs-Élysées"
    },
    {
        ", by ": null
    },
    {
        "Auguste Perret": "Auguste Perret"
    },
    {
        " Antoine Bourdelle": "Antoine Bourdelle"
    },
    {
        ", La Danse ": null
    },
    {
        "bas-relief": "Bas-Relief"
    },
    {
        " Maurice Denis": "Maurice Denis"
    },
    {
        "        The ": null
    },
    {
        "Théâtre des Champs-Élysées": "Théâtre Des Champs-Élysées"
    },
    {
        " , by ": null
    },
    {
        "Auguste Perret": "Auguste Perret"
    },
    {
        ", was the first landmark Art Deco building completed in Paris. Previously, ": null
    },
    {
        "reinforced concrete": "Reinforced Concrete"
    },
    {
        " had been used only for industrial and apartment buildings, Perret had built the first modern reinforced concrete apartment building in Paris on rue Benjamin Franklin in 1903–04. ": null
    },
    {
        "Henri Sauvage": "Henri Sauvage"
    },
    {
        ", another important future Art Deco architect, built another in 1904 at 7, rue Trétaigne . From 1908 to 1910, the 21-year old Le Corbusier worked as a draftsman in Perrets office, learning the techniques of concrete construction. Perrets building had clean rectangular form, geometric decoration and straight lines, the future trademarks of Art Deco. The decor of the theater was also revolutionary; the facade was decorated with ": null
    },
    {
        "high reliefs": "Reliefhigh Relief"
    },
    {
        " by ": null
    },
    {
        "Antoine Bourdelle": "Antoine Bourdelle"
    },
    {
        ", a dome by ": null
    },
    {
        "Maurice Denis": "Maurice Denis"
    },
    {
        ", paintings by ": null
    },
    {
        "Édouard Vuillard": "Édouard Vuillard"
    },
    {
        ", and an Art Deco curtain by ": null
    },
    {
        "Ker-Xavier Roussel": "Ker-Xavier Roussel"
    },
    {
        ". The theater became famous as the venue for many of the first performances of the ": null
    },
    {
        "Ballets Russes": "Ballets Russes"
    },
    {
        ". Perret and Sauvage became the leading Art Deco architects in Paris in the 1920s. Peter Collins, Concrete: The Vision of a New Architecture, New York: Horizon Press, 1959   Sheherazade  by ": null
    },
    {
        "Leon Bakst": "Leon Bakst"
    },
    {
        " Maurice Dufrene": "Maurice Dufrene"
    },
    {
        " and carpet by ": null
    },
    {
        "Paul Follot": "Paul Follot"
    },
    {
        " at the 1912 ": null
    },
    {
        "Salon des artistes décorateurs": "Société Des Artistes Décorateurs"
    },
    {
        " Jacques Doucet": "Jacques Doucet"
    },
    {
        " Salon dAutomne": "Salon Dautomne"
    },
    {
        " from Art et décoration magazine       At its birth between 1910 and 1914, Art Deco was an explosion of colors, featuring bright and often clashing hues, frequently in floral designs, presented in furniture ": null
    },
    {
        "upholstery": "Upholstery"
    },
    {
        ", carpets, screens, wallpaper and fabrics. Many colorful works, including chairs and a table by ": null
    },
    {
        "Maurice Dufrene": "Maurice Dufrene"
    },
    {
        " and a bright Gobelin carpet by ": null
    },
    {
        "Paul Follot": "Paul Follot"
    },
    {
        " were presented at the 1912 ": null
    },
    {
        "Salon des artistes décorateurs": "Société Des Artistes Décorateurs"
    },
    {
        ". In 1912–1913 designer ": null
    },
    {
        "Adrien Karbowsky": "Adrien Karbowsky"
    },
    {
        " made a floral chair with a parrot design for the hunting lodge of art collector ": null
    },
    {
        "Jacques Doucet": "Jacques Doucet"
    },
    {
        ". Descriptive text in the decorative arts display at the ": null
    },
    {
        "Musée dOrsay": "Musée Dorsay"
    },
    {
        ", Paris The furniture designers Louis Süe and ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        " made their first appearance at the 1912 exhibit, under the name of the Atelier français, combining colorful fabrics with exotic and expensive materials, including ebony and ivory. After World War I, they became one of the most prominent French interior design firms, producing the furniture for the first-class salons and cabins of the French transatlantic ": null
    },
    {
        "ocean liners": "Ocean Liner"
    },
    {
        ".     The vivid colors of Art Deco came from many sources, including the exotic set designs by ": null
    },
    {
        "Leon Bakst": "Leon Bakst"
    },
    {
        " for the ": null
    },
    {
        "Ballets Russes": "Ballets Russes"
    },
    {
        ", which caused a sensation in Paris just before World War I. Some of the colors were inspired by the earlier ": null
    },
    {
        "Fauvism": "Fauvism"
    },
    {
        " movement led by ": null
    },
    {
        "Henri Matisse": "Henri Matisse"
    },
    {
        "; others by the ": null
    },
    {
        "Orphism": "Orphism"
    },
    {
        " of painters such as ": null
    },
    {
        "Sonia Delaunay": "Sonia Delaunay"
    },
    {
        "; others by the movement known as the Nabis, and in the work of symbolist painter Odilon Redon, who designed fireplace screens and other decorative objects. Bright colors were a feature of the work of fashion designer ": null
    },
    {
        "Paul Poiret": "Paul Poiret"
    },
    {
        ", whose work influenced both Art Deco fashion and interior design.  La Maison Cubiste   by ": null
    },
    {
        "Raymond Duchamp-Villon": "Raymond Duchamp-Villon"
    },
    {
        " Raymond Duchamp-Villon": "Raymond Duchamp-Villon"
    },
    {
        ", 1912, La Maison Cubiste  at the ": null
    },
    {
        "Salon dAutomne": "Salon Dautomne"
    },
    {
        " Le Salon Bourgeois, designed by ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        " inside La Maison Cubiste, in the decorative arts section of the Salon dAutomne, 1912, Paris. Metzingers  Femme à lÉventail  ": null
    },
    {
        "hôtel particulier": "Hôtel Particulier"
    },
    {
        " of fashion designer-art collector ": null
    },
    {
        "Jacques Doucet": "Jacques Doucet"
    },
    {
        " . Design by ": null
    },
    {
        "Joseph Csaky": "Joseph Csaky"
    },
    {
        ". The geometric forms of ": null
    },
    {
        "Cubism": "Cubism"
    },
    {
        "Jacques Doucets": "Jacques Doucet"
    },
    {
        " hôtel particulier, 1927. Picassos  Les Demoiselles dAvignon  can be seen hanging in the background          The art style known as ": null
    },
    {
        "Cubism": "Cubism"
    },
    {
        " appeared in France between 1907 and 1912, influencing the development of Art Deco. The Cubists, themselves under the influence of ": null
    },
    {
        "Paul Cézanne": "Paul Cézanne"
    },
    {
        ", were interested in the simplification of forms to their geometric essentials: the cylinder, the sphere, the cone. , Foreword by Richard Shiff, University of California Press, 30 April 2006     In 1912, the artists of the ": null
    },
    {
        "Section dOr": "Section Dor"
    },
    {
        " exhibited works considerably more accessible to the general public than the analytical Cubism of Picasso and Braque. The Cubist vocabulary was poised to attract fashion, furniture and interior designers. La Section dor, 1912-1920-1925, Cécile Debray, Françoise Lucbert, Musées de Châteauroux, Musée Fabre, exhibition catalogue, Éditions Cercle dart, Paris, 2000      In the 1912 writings of ": null
    },
    {
        "André Vera": "André Vera"
    },
    {
        ". Le Nouveau style, published in the journal LArt décoratif, he expressed the rejection of ": null
    },
    {
        "Art Nouveau": "Art Nouveau"
    },
    {
        " forms and called for simplicité volontaire, symétrie manifeste, lordre et lharmonie, themes that would eventually become common within Art Deco; though the Deco style was often extremely colorful and anything but simple. André Vera, Le Nouveau style, published in LArt décoratif, January 1912, pp. 21–32     In the Art Décoratif section of the 1912 Salon dAutomne, an architectural installation was exhibited known as the  La Maison Cubiste . Eve Blau, Nancy J. Troy, The Maison Cubiste and the meaning of modernism in pre-1914 France , in Architecture and Cubism, Montreal, Cambridge, MA, London: MIT Press−Centre Canadien dArchitecture, 1998, pp. 17–40,  Nancy J. Troy, Modernism and the Decorative Arts in France: Art Nouveau to Le Corbusier, New Haven CT, and London: Yale University Press, 1991, pp. 79–102,  The facade was designed by ": null
    },
    {
        "Raymond Duchamp-Villon": "Raymond Duchamp-Villon"
    },
    {
        ". The decor of the house was by ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        ". Portraits of Architects- André Mare site of the Cité de lArchitecture et du Patrimoine  La Maison Cubiste was a furnished installation with a facade, a staircase, wrought iron banisters, a bedroom, a living room—the Salon Bourgeois, where paintings by ": null
    },
    {
        "Albert Gleizes": "Albert Gleizes"
    },
    {
        ", ": null
    },
    {
        "Jean Metzinger": "Jean Metzinger"
    },
    {
        ", ": null
    },
    {
        "Marie Laurencin": "Marie Laurencin"
    },
    {
        ", ": null
    },
    {
        "Marcel Duchamp": "Marcel Duchamp"
    },
    {
        ", ": null
    },
    {
        "Fernand Léger": "Fernand Léger"
    },
    {
        " and ": null
    },
    {
        "Roger de La Fresnaye": "Roger De La Fresnaye"
    },
    {
        " were hung.    Thousands of spectators at the salon passed through the full-scale model.       The facade of the house, designed by Duchamp-Villon, was not very radical by modern standards; the lintels and pediments had prismatic shapes, but otherwise the facade resembled an ordinary house of the period. For the two rooms, Mare designed the wallpaper, which featured stylized roses and floral patterns, along with upholstery, furniture and carpets, all with flamboyant and colorful motifs. It was a distinct break from traditional decor. The critic Emile Sedeyn described Mares work in the magazine Art et Décoration The Cubist element was provided by the paintings. The installation was attacked by some critics as extremely radical, which helped make for its success. This architectural installation was subsequently exhibited at the 1913 ": null
    },
    {
        "Armory Show": "Armory Show"
    },
    {
        ", New York, Chicago and Boston.    ,  Thanks largely to the exhibition, the term Cubist began to be applied to anything modern, from womens haircuts to clothing to theater ": null
    },
    {
        "performances": "Performance"
    },
    {
        ".     The Cubist influence continued within Art Deco, even as Deco branched out in many other directions. In 1927, Cubists ": null
    },
    {
        "Joseph Csaky": "Joseph Csaky"
    },
    {
        ", ": null
    },
    {
        "Jacques Lipchitz": "Jacques Lipchitz"
    },
    {
        ", ": null
    },
    {
        "Louis Marcoussis": "Louis Marcoussis"
    },
    {
        ", ": null
    },
    {
        "Henri Laurens": "Henri Laurens"
    },
    {
        ", the sculptor ": null
    },
    {
        "Gustave Miklos": "Gustave Miklos"
    },
    {
        ", and others collaborated in the decoration of a Studio House, rue Saint-James, ": null
    },
    {
        "Neuilly-sur-Seine": "Neuilly-Sur-Seine"
    },
    {
        ", designed by the architect Paul Ruaud and owned by the French fashion designer Jacques Doucet, also a collector of ": null
    },
    {
        "Post-Impressionist": "Post-Impressionist"
    },
    {
        " art by Henri Matisse and ": null
    },
    {
        "Cubist": "Cubist"
    },
    {
        " paintings . Laurens designed the fountain, Csaky designed Doucets staircase,  Lipchitz made the fireplace mantel, and Marcoussis made a Cubist rug.        Besides the Cubist artists, Doucet brought in other Deco interior designers to help in decorating the house, including Pierre Legrain, who was in charge of organizing the decoration, and ": null
    },
    {
        "Paul Iribe": "Paul Iribe"
    },
    {
        ", Marcel Coard, ": null
    },
    {
        "André Groult": "André Groult"
    },
    {
        ", ": null
    },
    {
        "Eileen Gray": "Eileen Gray"
    },
    {
        " and Rose Adler to provide furniture. The decor included massive pieces made of macassar ebony, inspired by African art, and furniture covered with Morocco leather, crocodile skin and snakeskin, and patterns taken from African designs. ": null
    },
    {
        "Ballets Russes": "Ballets Russes"
    },
    {
        " had a strong influence on early Deco. A drawing of the dancer ": null
    },
    {
        "Vaslav Nijinsky": "Vaslav Nijinsky"
    },
    {
        " by Paris fashion artist ": null
    },
    {
        "Georges Barbier": "Georges Barbier"
    },
    {
        " Georges Barbier": "Georges Barbier"
    },
    {
        " of a gown by ": null
    },
    {
        "Paquin": "Jeanne Paquin"
    },
    {
        " 450 Sutter Street": "450 Sutter Street"
    },
    {
        " in San Francisco by Timothy ": null
    },
    {
        "Pflueger": "Pflueger"
    },
    {
        ", inspired by ": null
    },
    {
        "ancient Maya art": "Ancient Maya Art"
    },
    {
        "  Prometheus  at ": null
    },
    {
        "Rockefeller Center": "Rockefeller Center"
    },
    {
        " by ": null
    },
    {
        "Paul Manship": "Paul Manship"
    },
    {
        " Beaux-Arts": "Beaux-Arts Architecture"
    },
    {
        " and ": null
    },
    {
        "neoclassical": "Neoclassical Architecture"
    },
    {
        " that were predominant in European and American architecture. In 1905 ": null
    },
    {
        "Eugène Grasset": "Eugène Grasset"
    },
    {
        " wrote and published Méthode de Composition Ornementale, Éléments Rectilignes,  in which he systematically explored the decorative aspects of geometric elements, forms, motifs and their variations, in contrast with the undulating Art Nouveau style of ": null
    },
    {
        "Hector Guimard": "Hector Guimard"
    },
    {
        ", so popular in Paris a few years earlier. Grasset stressed the principle that various simple geometric shapes like triangles and squares are the basis of all compositional arrangements. The reinforced concrete buildings of Auguste Perret and Henri Sauvage, and particularly the ": null
    },
    {
        "Theatre des Champs-Elysees": "Theatre Des Champs-Elysees"
    },
    {
        ", offered a new form of construction and decoration which was copied worldwide.      In decoration, many different styles were borrowed and used by Art Deco. They included pre-modern art from around the world and observable at the ": null
    },
    {
        "Musée du Louvre": "Musée Du Louvre"
    },
    {
        ", ": null
    },
    {
        "Musée de lHomme": "Musée De Lhomme"
    },
    {
        " and the ": null
    },
    {
        "Musée national des Arts dAfrique et dOcéanie": "Musée National Des Arts Dafrique Et Docéanie"
    },
    {
        ". There was also popular interest in archeology due to excavations at ": null
    },
    {
        "Pompeii": "Pompeii"
    },
    {
        ", ": null
    },
    {
        "Troy": "Troy"
    },
    {
        ", and the tomb of the 18th dynasty Pharaoh ": null
    },
    {
        "Tutankhamun": "Tutankhamun"
    },
    {
        ". Artists and designers integrated motifs from ": null
    },
    {
        "ancient Egypt": "Ancient Egypt"
    },
    {
        ", ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    },
    {
        ", ": null
    },
    {
        "Greece": "Ancient Greece"
    },
    {
        ", ": null
    },
    {
        "Rome": "Ancient Rome"
    },
    {
        ", Asia, ": null
    },
    {
        "Mesoamerica": "Mesoamerica"
    },
    {
        " and ": null
    },
    {
        "Oceania": "Oceania"
    },
    {
        " with ": null
    },
    {
        "Machine Age": "Machine Age"
    },
    {
        " elements.           Other styles borrowed included Russian ": null
    },
    {
        "Constructivism": "Constructivism"
    },
    {
        " and Italian ": null
    },
    {
        "Futurism": "Futurism"
    },
    {
        ", as well as Orphism, ": null
    },
    {
        "Functionalism": "Functionalism"
    },
    {
        ", and ": null
    },
    {
        "Modernism": "Modernism"
    },
    {
        " in general.   Art Deco also used the clashing colors and designs of Fauvism, notably in the work of Henri Matisse and ": null
    },
    {
        "André Derain": "André Derain"
    },
    {
        ", inspired the designs of art deco textiles, wallpaper, and painted ceramics. It took ideas from the high fashion vocabulary of the period, which featured geometric designs, chevrons, zigzags, and stylized bouquets of flowers. It was influenced by discoveries in ": null
    },
    {
        "Egyptology": "Egyptology"
    },
    {
        ", and growing interest in the Orient and in African art. From 1925 onwards, it was often inspired by a passion for new machines, such as airships, automobiles and ocean liners, and by 1930 this influence resulted in the style called ": null
    },
    {
        "Streamline Moderne": "Streamline Moderne"
    },
    {
        ". ": null
    },
    {
        "Jeanne Lanvin": "Jeanne Lanvin"
    },
    {
        " Brooklyn Museum": "Brooklyn Museum"
    },
    {
        " Paul Ruaud": "Paul Ruaud"
    },
    {
        " with furniture by ": null
    },
    {
        "Eileen Gray": "Eileen Gray"
    },
    {
        ", for Madame Mathieu-Levy , 9, rue de Lota, Paris, 1922      Art Deco was associated with both luxury and modernity; it combined very expensive materials and exquisite craftsmanship put into modernistic forms. Nothing was cheap about Art Deco: pieces of furniture included ivory and silver inlays, and pieces of Art Deco jewelry combined diamonds with platinum, jade, and other precious materials. The style was used to decorate the first-class salons of ocean liners, deluxe trains, and skyscrapers. It was used around the world to decorate the great movie palaces of the late 1920s and 1930s. Later, after the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        ", the style changed and became more sober.     A good example of the luxury style of Art Deco is the boudoir of the fashion designer ": null
    },
    {
        "Jeanne Lanvin": "Jeanne Lanvin"
    },
    {
        ", designed by ": null
    },
    {
        "Armand-Albert Rateau": "Armand-Albert Rateau"
    },
    {
        " made between 1922–25. It was located in her house at 16 rue Barbet de Jouy, in Paris, which was demolished in 1965. The room was reconstructed in the Museum of Decorative Arts in Paris. The walls are covered with molded lambris below sculpted bas-reliefs in stucco. The alcove is framed with columns of marble on with bases and a plinth of sculpted wood. The floor is of white and black marble, and in the cabinets decorative objects are displayed against a background of blue silk. Her bathroom had a tub and washstand made of sienna marble, with a wall of carved stucco and bronze fittings.     By 1928 the style had become more comfortable, with deep leather club chairs. The study designed by the Paris firm of Alavoine for an American businessman in 1928–30, now in the ": null
    },
    {
        "Brooklyn Museum": "Brooklyn Museum"
    },
    {
        ".     By the 1930s, the style had been somewhat simplified, but it was still extravagant. In 1932 the decorator Paul Ruoud made the Glass Salon for Suzanne Talbot. It featured a serpentine armchair and two tubular armchairs by Eileen Gray, a floor of mat silvered glass slabs, a panel of abstract patterns in silver and black lacquer, and an assortment of animal skins. ": null
    },
    {
        "International Exhibition of Modern Decorative and Industrial Arts": "International Exhibition Of Modern Decorative And Industrial Arts"
    },
    {
        " Place de la Concorde": "Place De La Concorde"
    },
    {
        " by ": null
    },
    {
        "Pierre Patout": "Pierre Patout"
    },
    {
        " Galeries Lafayette": "Galeries Lafayette"
    },
    {
        " Émile-Jacques Ruhlmann": "Émile-Jacques Ruhlmann"
    },
    {
        ", designed by ": null
    },
    {
        "Pierre Patout": "Pierre Patout"
    },
    {
        ".   Salon of the Hotel du Collectionneur .jpg|Salon of the Hôtel du Collectionneur from the 1925 International Exposition of Decorative Arts, furnished by ": null
    },
    {
        "Émile-Jacques Ruhlmann": "Émile-Jacques Ruhlmann"
    },
    {
        ", painting by ": null
    },
    {
        "Jean Dupas": "Jean Dupas"
    },
    {
        ", design by ": null
    },
    {
        "Pierre Patout": "Pierre Patout"
    },
    {
        "        The event that marked the zenith of the style and gave it its name was the ": null
    },
    {
        "International Exhibition of Modern Decorative and Industrial Arts": "International Exhibition Of Modern Decorative And Industrial Arts"
    },
    {
        " which took place in Paris from April to October in 1925. This was officially sponsored by the French government, and covered a site in Paris of 55 acres, running from the ": null
    },
    {
        "Grand Palais": "Grand Palais"
    },
    {
        " on the right bank to ": null
    },
    {
        "Les Invalides": "Les Invalides"
    },
    {
        " on the left bank, and along the banks of the Seine. The Grand Palais, the largest hall in the city, was filled with exhibits of decorative arts from the participating countries. There were 15,000 exhibitors from twenty different countries, including England, Italy, Spain, Poland, Czechoslovakia, Belgium, Japan, and the new ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ", though Germany was not invited because of tensions after the war and the United States, misunderstanding the purpose of the exhibit, declined to participate. It was visited by sixteen million people during its seven-month run. The rules of the exhibition required that all work be modern; no historical styles were allowed. The main purpose of the Exhibit was to promote the French manufacturers of luxury furniture, porcelain, glass, metal work, textiles and other decorative products. To further promote the products, all the major Paris department stores and major designers had their own pavilions. The Exposition had a secondary purpose in promoting products from French colonies in Africa and Asia, including ivory and exotic woods.     The Hôtel du Collectionneur was a popular attraction at the Exposition; it displayed the new furniture designs of Emile-Jacques Ruhlmann, as well as Art Deco fabrics, carpets, and a painting by ": null
    },
    {
        "Jean Dupas": "Jean Dupas"
    },
    {
        ". The interior design followed the same principles of symmetry and geometric forms which set it apart from Art Nouveau, and bright colors, fine craftsmanship rare and expensive materials which set it apart from the strict functionality of the Modernist style. While most of the pavilions were lavishly decorated and filled with hand-made luxury furniture, two pavilions, those of the Soviet Union and Pavilion du Nouveau Esprit, built by the magazine of that name run by Le Corbusier, were built in an austere style with plain white walls and no decoration; they were among the earliest examples of ": null
    },
    {
        "modernist architecture": "Modernist Architecture"
    },
    {
        ". ": null
    },
    {
        "American Radiator Building": "American Radiator Building"
    },
    {
        " in New York City by ": null
    },
    {
        "Raymond Hood": "Raymond Hood"
    },
    {
        " Chrysler Building": "Chrysler Building"
    },
    {
        " in ": null
    },
    {
        "New York City": "New York City"
    },
    {
        ", by ": null
    },
    {
        "William Van Alen": "William Van Alen"
    },
    {
        " General Electric Building": "General Electric Building"
    },
    {
        " by ": null
    },
    {
        "Cross & Cross": "Cross  &  Cross"
    },
    {
        " Comcast Building": "Comcast Building"
    },
    {
        ", by ": null
    },
    {
        "Raymond Hood": "Raymond Hood"
    },
    {
        " Empire State Building": "Empire State Building"
    },
    {
        " in ": null
    },
    {
        "New York City": "New York City"
    },
    {
        ", by ": null
    },
    {
        "Shreve, Lamb and Harmon": "Shreve, Lamb And Harmon"
    },
    {
        "         American skyscrapers marked the summit of the Art Deco style; they became the tallest and most recognizable modern buildings in the world. They were designed to show the prestige of their builders through their height, their shape, their color, and their dramatic illumination at night. John Burchard and Albert Bush Brown, The Architecture of America , Atlantic, Little and Brown, page 277 The ": null
    },
    {
        "American Radiator Building": "American Radiator Building"
    },
    {
        " by ": null
    },
    {
        "Raymond Hood": "Raymond Hood"
    },
    {
        " combined Gothic and Deco modern elements in the design of the building. Black brick on the frontage of the building was selected to give an idea of solidity and to give the building a solid mass. Other parts of the facade were covered in gold bricks , and the entry was decorated with marble and black mirrors. Another early Art Deco skyscraper was Detroits ": null
    },
    {
        "Guardian Building": "Guardian Building"
    },
    {
        ", which opened in 1929. Designed by modernist ": null
    },
    {
        "Wirt C. Rowland": "Wirt C. Rowland"
    },
    {
        ", the building was the first to employ stainless steel as a decorative element, and the extensive use of colored designs in place of traditional ornaments.     The New York skyline was radically changed by the ": null
    },
    {
        "Chrysler Building": "Chrysler Building"
    },
    {
        " in Manhattan , designed by ": null
    },
    {
        "William Van Alen": "William Van Alen"
    },
    {
        ". It was a giant seventy-seven floor tall advertisement for Chrysler automobiles. The top was crowned by a stainless steel spire, and was ornamented by deco gargoyles in the form of stainless steel radiator cap decorations. The base of the tower, thirty-three stories above the street, was decorated with colorful art deco friezes, and the lobby was decorated with art deco symbols and images expressing modernity.     The Chrysler Building was followed by the ": null
    },
    {
        "Empire State Building": "Empire State Building"
    },
    {
        " by ": null
    },
    {
        "William F. Lamb": "William F. Lamb"
    },
    {
        " and the RCA Building  in ": null
    },
    {
        "Rockefeller Center": "Rockefeller Center"
    },
    {
        ", by Raymond Hood which together completely changed the skyline of New York. The tops of the buildings were decorated with Art Deco crowns and spires covered with stainless steel, and, in the case of the Chrysler building, with Art Deco gargoyles modeled after radiator ornaments, while the entrances and lobbies were lavishly decorated with Art Deco sculpture, ceramics, and design. Similar buildings, though not quite as tall, soon appeared in Chicago and other large American cities. The Chrysler Building was soon surpassed in height by the Empire State Building, in a slightly less lavish Deco style. Rockefeller Center added a new design element: several tall building grouped around an open plaza, with a fountain in the center. ": null
    },
    {
        "Lincoln Theater": "Lincoln Theatre"
    },
    {
        " in ": null
    },
    {
        "Miami Beach": "Miami Beach"
    },
    {
        ", Florida by ": null
    },
    {
        "Thomas W. Lamb": "Thomas W. Lamb"
    },
    {
        " Palais de Chaillot": "Palais De Chaillot"
    },
    {
        " by ": null
    },
    {
        "Louis-Hippolyte Boileau": "Louis-Hippolyte Boileau"
    },
    {
        ", ": null
    },
    {
        "Jacques Carlu": "Jacques Carlu"
    },
    {
        " and ": null
    },
    {
        "Léon Azéma": "Léon Azéma"
    },
    {
        " from the ": null
    },
    {
        "1937 Paris International Exposition": "Exposition Internationale Des Arts Et Techniques Dans La Vie Moderne"
    },
    {
        " Economic and Social Council": "French Economic, Social And Environmental Council"
    },
    {
        " in Paris, originally the Museum of Public Works, built for the ": null
    },
    {
        "1937 Paris International Exposition": "Exposition Internationale Des Arts Et Techniques Dans La Vie Moderne"
    },
    {
        " by ": null
    },
    {
        "Auguste Perret": "Auguste Perret"
    },
    {
        " King City, California": "King City, California"
    },
    {
        ", built by Robert Stanton for the ": null
    },
    {
        "Works Progress Administration": "Works Progress Administration"
    },
    {
        "       In 1925 two different competing schools coexisted within Art Deco: the traditionalists, who had founded the Society of Decorative Artists; included the furniture designer Emile-Jacques Ruhlmann, Jean Dunard, the sculptor Antoine Bourdelle, and designer Paul Poiret; they combined modern forms with traditional craftsmanship and expensive materials. On the other side were the modernists, who increasingly rejected the past and wanted a style based upon advances in new technologies, simplicity, a lack of decoration, inexpensive materials, and mass production. The modernists founded their own organization, ": null
    },
    {
        "The French Union of Modern Artists": "The French Union Of Modern Artists"
    },
    {
        ", in 1929. Its members included architects ": null
    },
    {
        "Pierre Chareau": "Pierre Chareau"
    },
    {
        ", ": null
    },
    {
        "Francis Jourdain": "Francis Jourdain"
    },
    {
        ", ": null
    },
    {
        "Robert Mallet-Stevens": "Robert Mallet-Stevens"
    },
    {
        ", Corbusier, and, in the Soviet Union, ": null
    },
    {
        "Konstantin Melnikov": "Konstantin Melnikov"
    },
    {
        "; the Irish designer Eileen Gray, and French designer Sonia Delaunay, the jewelers ": null
    },
    {
        "Jean Fouquet": "Jean Fouquet"
    },
    {
        " and ": null
    },
    {
        "Jean Puiforcat": "Jean Puiforcat"
    },
    {
        ". They fiercely attacked the traditional art deco style, which they said was created only for the wealthy, and insisted that well-constructed buildings should be available to everyone, and that form should follow function. The beauty of an object or building resided in whether it was perfectly fit to fulfill its function. Modern industrial methods meant that furniture and buildings could be mass-produced, not made by hand. Le Corbusier, Vers une architecture, Flammarion, republished in 1995, page xix Larousse Encyclopedia on-line edition     The Art Deco interior designer Paul Follot defended Art Deco in this way: We know that man is never content with the indispensable and that the superfluous is always needed...If not, we would have to get rid of music, flowers, and perfumes..!  However, Le Corbusier was a brilliant publicist for modernist architecture; he stated that a house was simply a machine to live in , and tirelessly promoted the idea that Art Deco was the past and modernism was the future. Le Corbusiers ideas were gradually adopted by architecture schools, and the aesthetics of Art Deco were abandoned. The same features that made Art Deco popular in the beginning, its craftsmanship, rich materials and ornament, led to its decline. The Great Depression that began in the United States in 1929, and reached Europe shortly afterwards, greatly reduced the number of wealthy clients who could pay for the furnishings and art objects. In the Depression economic climate, few companies were ready to build new skyscrapers. Even the Ruhlmann firm resorted to producing pieces of furniture in series, rather than individual hand-made items. The last buildings built in Paris in the new style were the Museum of Public Works by Auguste Perret  and the ": null
    },
    {
        "Palais de Chaillot": "Palais De Chaillot"
    },
    {
        " by ": null
    },
    {
        "Louis-Hippolyte Boileau": "Louis-Hippolyte Boileau"
    },
    {
        ", ": null
    },
    {
        "Jacques Carlu": "Jacques Carlu"
    },
    {
        " and ": null
    },
    {
        "Léon Azéma": "Léon Azéma"
    },
    {
        ", and the ": null
    },
    {
        "Palais de Tokyo": "Palais De Tokyo"
    },
    {
        " of the ": null
    },
    {
        "1937 Paris International Exposition": "Exposition Internationale Des Arts Et Techniques Dans La Vie Moderne"
    },
    {
        "; they looked out at the grandiose pavilion of Nazi Germany, designed by ": null
    },
    {
        "Albert Speer": "Albert Speer"
    },
    {
        ", which faced the equally grandiose socialist-realist pavilion of Stalins Soviet Union.     After World War II the dominant architectural style became the International Style pioneered by Le Corbusier, and ": null
    },
    {
        "Mies Van der Rohe": "Mies Van Der Rohe"
    },
    {
        ". A handful of Art Deco hotels were built in ": null
    },
    {
        "Miami Beach": "Miami Beach, Florida"
    },
    {
        " after World War II, but elsewhere the style largely vanished, except in industrial design, where it continued to be used in automobile styling and products such as jukeboxes. In the 1960s, it experienced a modest academic revival, thanks in part to the writings of architectural historians such as Bevis Hillier. In the 1970s efforts were made in the United States and Europe to preserve the best examples of Art Deco architecture, and many buildings were restored and repurposed. ": null
    },
    {
        "Postmodern architecture": "Postmodern Architecture"
    },
    {
        ", which first appeared in the 1980s, like Art Deco, often includes purely decorative features.   Deco continues to inspire designers, and is often used in contemporary fashion, jewelry, and toiletries.           Time, 1941, ceiling mural in lobby of ": null
    },
    {
        "Rockefeller Center": "Rockefeller Center"
    },
    {
        " by the Spanish painter ": null
    },
    {
        "Josep Maria Sert": "Josep Maria Sert"
    },
    {
        " Reginald Marsh": "Reginald Marsh"
    },
    {
        ", 1936, Workers sorting the mail ": null
    },
    {
        "Rockwell Kent": "Rockwell Kent"
    },
    {
        ", 1938, Art in the Tropics, mural in the ": null
    },
    {
        "William Jefferson Clinton Federal Building": "William Jefferson Clinton Federal Building"
    },
    {
        "     There was no section set aside for painting at the 1925 Exposition. Art deco painting was by definition decorative, designed to decorate a room or work of architecture, so few painters worked exclusively in the style, but two painters are closely associated with Art Deco. Jean Dupas painted Art Deco murals for the Bordeaux Pavilion at the 1925 Decorative Arts Exposition in Paris, and also painted the picture over the fireplace in the Maison de la Collectioneur exhibit at the 1925 Exposition, which featured furniture by Ruhlmann and other prominent Art Deco designers. His murals were also prominent in the decor of the French ocean liner ": null
    },
    {
        "SS Normandie": "Ss Normandie"
    },
    {
        ". His work was purely decorative, designed as a background or accompaniment to other elements of the decor. Louis René Vian, Les Arts décoratifs à bord des paquebots français, Éditions Fonmare, 1992     The other painter closely associated with the style is ": null
    },
    {
        "Tamara de Lempicka": "Tamara De Lempicka"
    },
    {
        ". Born in Poland, she emigrated to Paris after the ": null
    },
    {
        "Russian Revolution": "Russian Revolution"
    },
    {
        ". She studied under ": null
    },
    {
        "Maurice Denis": "Maurice Denis"
    },
    {
        " and ": null
    },
    {
        "André Lhote": "André Lhote"
    },
    {
        ", and borrowed many elements from their styles. She painted portraits in a realistic, dynamic and colorful Art Deco style. Blondel, Alain . Tamara de Lempicka: a Catalogue Raisonné 1921–1980. Lausanne: Editions Acatos.     In the 1930s a dramatic new form of Art Deco painting appeared in the United States. During the Great Depression, the ": null
    },
    {
        "Federal Art Project": "Federal Art Project"
    },
    {
        " of the ": null
    },
    {
        "Works Progress Administration": "Works Progress Administration"
    },
    {
        " was created to give work to unemployed artists. Many were given the task of decorating government buildings, hospitals and schools. There was no specific art deco style used in the murals; artists engaged to paint murals in government buildings came from many different schools, from American regionalism to ": null
    },
    {
        "social realism": "Social Realism"
    },
    {
        "; they included ": null
    },
    {
        "Reginald Marsh": "Reginald Marsh"
    },
    {
        ", ": null
    },
    {
        "Rockwell Kent": "Rockwell Kent"
    },
    {
        " and the Mexican painter ": null
    },
    {
        "Diego Rivera": "Diego Rivera"
    },
    {
        ". The murals were Art Deco because they were all decorative and related to the activities in the building or city where they were painted: Reginald Marsh and Rockwell Kent both decorated U.S. postal buildings, and showed postal employees at work while Diego Rivera depicted automobile factory workers for the ": null
    },
    {
        "Detroit Institute of Arts": "Detroit Institute Of Arts"
    },
    {
        ". Diego Riveras mural  Man at the Crossroads  for Rockefeller Center featured an unauthorized portrait of ": null
    },
    {
        "Lenin": "Lenin"
    },
    {
        ". Balfour, Alan . Rockefeller Center: Architecture as Theater. McGraw-Hill, Inc., p. 311,   When Rivera refused to remove Lenin, the painting was destroyed and a new mural was painted by the Spanish artist ": null
    },
    {
        "Josep Maria Sert": "Josep Maria Sert"
    },
    {
        ".  Atkins, Robert . ArtSpoke: A Guide to Modern Ideas, Movements, and Buzzwords, 1848–1944. ": null
    },
    {
        "Abbeville Press": "Abbeville Publishing Group"
    },
    {
        ". .          Sculpture was a very common and integral feature of Art Deco architecture. In France, allegorical bas-reliefs representing dance and music by ": null
    },
    {
        "Antoine Bourdelle": "Antoine Bourdelle"
    },
    {
        " decorated the earliest Art Deco landmark in Paris, the ": null
    },
    {
        "Théâtre des Champs-Élysées": "Théâtre Des Champs-Élysées"
    },
    {
        " in Paris, in 1912. The 1925 had major sculptural works placed around the site, pavilions were decorated with sculptural friezes, and several pavilions devoted to smaller studio sculpture. In the 1930s, a large group of prominent sculptors made works for the 1937 ": null
    },
    {
        "Exposition Internationale des Arts et Techniques dans la Vie Moderne": "Exposition Internationale Des Arts Et Techniques Dans La Vie Moderne"
    },
    {
        " at Chaillot. ": null
    },
    {
        "Alfred Janniot": "Alfred Janniot"
    },
    {
        " made the relief sculptures on the facade of the Palais de Tokyo. The ": null
    },
    {
        "Musée dArt Moderne de la Ville de Paris": "Musée Dart Moderne De La Ville De Paris"
    },
    {
        ", and the esplanade in front of the Palais de Chaillot, facing the Eiffel Tower, was crowded with new statuary by ": null
    },
    {
        "Charles Malfray": "Charles Malfray"
    },
    {
        ", Henry Arnold, and many others.     Public art deco sculpture was almost always representational, usually of heroic or allegorical figures related to the purpose of the building or room. The themes were usually selected by the patrons, not the artist. Abstract sculpture for decoration was extremely rare. , Exeter Books, 1985, p. 32,  Duncan, Alistair, Art Deco, p. 121-141     In the United States, the most prominent Art Deco sculptor for public art was ": null
    },
    {
        "Paul Manship": "Paul Manship"
    },
    {
        ", who updated classical and mythological subjects and themes in an Art Deco style. His most famous work was the statue of ": null
    },
    {
        "Prometheus": "Prometheus"
    },
    {
        " at ": null
    },
    {
        "Rockefeller Center": "Rockefeller Center"
    },
    {
        " in New York, a 20th-century adaptation of a classical subject. Other important works for Rockefeller Center were made by ": null
    },
    {
        "Lee Lawrie": "Lee Lawrie"
    },
    {
        ", including the sculptural facade and the ": null
    },
    {
        "Atlas statue": "Atlas"
    },
    {
        ".     During the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        " in the United States, many sculptors were commissioned to make works for the decoration of federal government buildings, with funds provided by the WPA, or ": null
    },
    {
        "Works Progress Administration": "Works Progress Administration"
    },
    {
        ". They included sculptor Sidney Biehler Waugh, who created stylized and idealized images of workers and their tasks for federal government office buildings. Duncan, Art Deco , pg. 140 In San Francisco, ": null
    },
    {
        "Ralph Stackpole": "Ralph Stackpole"
    },
    {
        " provided sculpture for the facade of the new ": null
    },
    {
        "San Francisco Stock Exchange": "San Francisco Stock Exchange"
    },
    {
        " building. In Washington DC, ": null
    },
    {
        "Michael Lantz": "Michael Lantz"
    },
    {
        " made works for the ": null
    },
    {
        "Federal Trade Commission": "Federal Trade Commission"
    },
    {
        " building.     In Britain, Deco public statuary was made by ": null
    },
    {
        "Eric Gill": "Eric Gill"
    },
    {
        " for the ": null
    },
    {
        "BBC Broadcasting House": "Bbc Broadcasting House"
    },
    {
        ", while Ronald Atkinson decorated the lobby of the former ": null
    },
    {
        "Daily Express Building": "Daily Express Building, London"
    },
    {
        " in London .     One of the best known and certainly the largest public Art Deco sculpture is the  Christ the Redeemer  by the French sculptor ": null
    },
    {
        "Paul Landowski": "Paul Landowski"
    },
    {
        ", completed between 1922 and 1931, located on a mountain top overlooking ": null
    },
    {
        "Rio de Janeiro": "Rio De Janeiro"
    },
    {
        " John Storrs": "John Storrs"
    },
    {
        " atop the ": null
    },
    {
        "Chicago Board of Trade": "Chicago Board Of Trade"
    },
    {
        "  Prometheus  at ": null
    },
    {
        "Rockefeller Center": "Rockefeller Center"
    },
    {
        " by ": null
    },
    {
        "Paul Manship": "Paul Manship"
    },
    {
        " , a stylized Art Deco update of classical sculpture     RocCt-LeeLawrie-Wisdom.jpg|Portal decoration Wisdom by ": null
    },
    {
        "Lee Lawrie": "Lee Lawrie"
    },
    {
        ", ": null
    },
    {
        "Rockefeller Center": "Rockefeller Center"
    },
    {
        " Lee Lawrie": "Lee Lawrie"
    },
    {
        ", 1936–37,  Atlas  Man Controlling Trade by ": null
    },
    {
        "Michael Lantz": "Michael Lantz"
    },
    {
        " at the ": null
    },
    {
        "Federal Trade Commission": "Federal Trade Commission"
    },
    {
        "  Mail Delivery East , by ": null
    },
    {
        "Edmond Amateis": "Edmond Amateis"
    },
    {
        ", one of four bas-relief sculptures on the ": null
    },
    {
        "Robert N. C. Nix, Sr., Federal Building": "Robert N. C. Nix, Sr., Federal Building"
    },
    {
        " in ": null
    },
    {
        "Philadelphia": "Philadelphia"
    },
    {
        ", 1937   Stackpole-155Sansome.jpg|": null
    },
    {
        "Ralph Stackpoles": "Ralph Stackpole"
    },
    {
        " sculpture group over the door of the ": null
    },
    {
        "San Francisco Stock Exchange": "San Francisco Stock Exchange"
    },
    {
        " Eric Gill": "Eric Gill"
    },
    {
        ", Facade of ": null
    },
    {
        "BBC Broadcasting House": "Bbc Broadcasting House"
    },
    {
        "  Christ the Redeemer  by ": null
    },
    {
        "Paul Landowski": "Paul Landowski"
    },
    {
        ", , ": null
    },
    {
        "soapstone": "Soapstone"
    },
    {
        ", ": null
    },
    {
        "Corcovado": "Corcovado"
    },
    {
        " Mountain, ": null
    },
    {
        "Rio de Janeiro": "Rio De Janeiro"
    },
    {
        "         Many early Art Deco sculptures were small, designed to decorate salons. One genre of this sculpture was called the ": null
    },
    {
        "Chryselephantine": "Chryselephantine"
    },
    {
        " statuette, named for a style of ancient Greek temple statues made of gold and ivory. They were sometimes made of bronze, or sometimes with much more lavish materials, such as ivory. ": null
    },
    {
        "onyx": "Onyx"
    },
    {
        " alabaster, and gold leaf.     One of the best-known Art Deco salon sculptors was the Romanian-born ": null
    },
    {
        "Demétre Chiparus": "Demétre Chiparus"
    },
    {
        ", who produced colorful small sculptures of dancers. Other notable salon sculptors included ": null
    },
    {
        "Ferdinand Preiss": "Ferdinand Preiss"
    },
    {
        ", ": null
    },
    {
        "Josef Lorenzl": "Josef Lorenzl"
    },
    {
        ", Alexander Kelety, Dorothea Charol and Gustav Schmidtcassel. Another important American sculptor in the studio format was ": null
    },
    {
        "Harriet Whitney Frishmuth": "Harriet Whitney Frishmuth"
    },
    {
        ", who had studied with ": null
    },
    {
        "Auguste Rodin": "Auguste Rodin"
    },
    {
        " in Paris.     Pierre Le Paguays was a prominent Art Deco studio sculptor, whose work was shown at the 1925 Exposition. He worked with bronze, marble, ivory, onyx, gold, ": null
    },
    {
        "alabaster": "Alabaster"
    },
    {
        " and other precious materials. Brian Catley, Deco and other Bronzes, pp. 203–209,  ": null
    },
    {
        "Joseph Csaky": "Joseph Csaky"
    },
    {
        ", Tête , limestone, ": null
    },
    {
        "Kröller-Müller Museum": "Kröller-Müller Museum"
    },
    {
        ", Otterlo  ": null
    },
    {
        "Josef Lorenzl": "Josef Lorenzl"
    },
    {
        " Speed, a design for a radiator ornament by the American sculptor ": null
    },
    {
        "Harriet Whitney Frishmuth": "Harriet Whitney Frishmuth"
    },
    {
        " The Flight of Europa by ": null
    },
    {
        "Paul Manship": "Paul Manship"
    },
    {
        " Demétre Chiparus": "Demétre Chiparus"
    },
    {
        ", Tanara, bronze, ivory and onyx  ": null
    },
    {
        "Demétre Chiparus": "Demétre Chiparus"
    },
    {
        ", Dancer, bronze, ivory        ": null
    },
    {
        "François Pompon": "François Pompon"
    },
    {
        " was a pioneer of modern stylized ": null
    },
    {
        "animalier": "Animalier"
    },
    {
        " sculpture. He was not fully recognized for his artistic accomplishments until the age of 67 at the Salon dAutomne of 1922 with the work Ours blanc, also known as The White Bear, now in the ": null
    },
    {
        "Musée dOrsay": "Musée Dorsay"
    },
    {
        " in Paris.      Parallel with these Art Deco sculptors, more avant-garde and abstract modernist sculptors were at work in Paris and New York. The most prominent were ": null
    },
    {
        "Constantin Brâncuși": "Constantin Brâncuși"
    },
    {
        ", ": null
    },
    {
        "Joseph Csaky": "Joseph Csaky"
    },
    {
        ", ": null
    },
    {
        "Alexander Archipenko": "Alexander Archipenko"
    },
    {
        ", ": null
    },
    {
        "Henri Laurens": "Henri Laurens"
    },
    {
        ", ": null
    },
    {
        "Jacques Lipchitz": "Jacques Lipchitz"
    },
    {
        ", ": null
    },
    {
        "Gustave Miklos": "Gustave Miklos"
    },
    {
        ", ": null
    },
    {
        "Jean Lambert-Rucki": "Jean Lambert-Rucki"
    },
    {
        ", ": null
    },
    {
        "Jan et Joël Martel": "Jan Et Joël Martel"
    },
    {
        ", ": null
    },
    {
        "Chana Orloff": "Chana Orloff"
    },
    {
        " and ": null
    },
    {
        "Pablo Gargallo": "Pablo Gargallo"
    },
    {
        ".  ": null
    },
    {
        "Ballets Russes": "Ballets Russes"
    },
    {
        " by ": null
    },
    {
        "Leon Bakst": "Leon Bakst"
    },
    {
        " Peter Behrens": "Peter Behrens"
    },
    {
        ", ": null
    },
    {
        "Deutscher Werkbund": "Deutscher Werkbund"
    },
    {
        "  Vanity Fair  Interpretation of Harlem Jazz I by ": null
    },
    {
        "Winold Reiss": "Winold Reiss"
    },
    {
        "  Harpers Bazaar  by ": null
    },
    {
        "Erté": "Erté"
    },
    {
        " London Underground": "London Underground"
    },
    {
        " Moulin Rouge": "Moulin Rouge"
    },
    {
        " Chicago Worlds Fair": "Century Of Progress"
    },
    {
        " by Weimer Pursell       The Art Deco style appeared early in the graphic arts, in the years just before World War I. It appeared in Paris in the posters and the costume designs of Leon Bakst for the Ballets Russes, and in the catalogs of the fashion designers Paul Poiret.  The illustrations of ": null
    },
    {
        "Georges Barbier": "Georges Barbier"
    },
    {
        ", and Georges Lepape and the images in the fashion magazine La Gazette du bon ton perfectly captured the elegance and sensuality of the style. In the 1920s, the look changed; the fashions stressed were more casual, sportive and daring, with the woman models usually smoking cigarettes. American fashion magazines such as  Vogue ,  Vanity Fair  and  Harpers Bazaar  quickly picked up the new style and popularized it in the United States. It also influenced the work of American book illustrators such as Rockwell Kent. In Germany, the most famous poster artist of the period was ": null
    },
    {
        "Ludwig Hohlwein": "Ludwig Hohlwein"
    },
    {
        ", who created colorful and dramatic posters for music festivals, beers, and, late in his career, for the Nazi Party.     During the Art Nouveau period, posters usually advertised theatrical products or cabarets. In the 1920s, travel posters, made for steamship lines and airlines, became extremely popular. The style changed notably in the 1920s, to focus attention on the product being advertised. The images became simpler, precise, more linear, more dynamic, and were often placed against a single color background. In France popular Art Deco designers included, Charles Loupot and ": null
    },
    {
        "Paul Colin": "Paul Colin"
    },
    {
        ", who became famous for his posters of American singer and dancer ": null
    },
    {
        "Josephine Baker": "Josephine Baker"
    },
    {
        ". Jean Carlu designed posters for Charlie Chaplin movies, soaps, and theaters; in the late 1930s he emigrated to the United States, where, during the World War, he designed posters to encourage war production. The designer Charles Gesmar became famous making posters for the singer ": null
    },
    {
        "Mistinguett": "Mistinguett"
    },
    {
        " and for ": null
    },
    {
        "Air France": "Air France"
    },
    {
        ". Among the best known French Art Deco poster designers was ": null
    },
    {
        "Cassandre": "Cassandre"
    },
    {
        ", who made the celebrated poster of the ocean liner SS Normandie in 1935.     In the 1930s a new genre of posters appeared in the United States during the Great Depression. The Federal Art Project hired American artists to create posters to promote tourism and cultural events.           ": null
    },
    {
        "La Samaritaine": "La Samaritaine"
    },
    {
        " department store, by ": null
    },
    {
        "Henri Sauvage": "Henri Sauvage"
    },
    {
        " Los Angeles City Hall": "Los Angeles City Hall"
    },
    {
        " by ": null
    },
    {
        "John Parkinson": "The Parkinsons"
    },
    {
        ", ": null
    },
    {
        "John C. Austin": "John C. Austin"
    },
    {
        ", and ": null
    },
    {
        "Albert C. Martin, Sr.": "Albert C. Martin, Sr."
    },
    {
        " Palacio de Bellas Artes": "Palacio De Bellas Artes"
    },
    {
        " in ": null
    },
    {
        "Mexico City": "Mexico City"
    },
    {
        " National Diet Building": "National Diet Building"
    },
    {
        " in ": null
    },
    {
        "Tokyo": "Tokyo"
    },
    {
        " Mayakovskaya Metro Station": "Mayakovskaya"
    },
    {
        " in Moscow       The architectural style of art deco made its debut in Paris in 1903–04, with the construction of two apartment buildings in Paris, one by Auguste Perret on rue Trétaigne and the other on rue Benjamin Franklin by Henri Sauvage. The two young architects used reinforced concrete for the first time in Paris residential buildings; the new buildings had clean lines, rectangular forms, and no decoration on the facades; they marked a clean break with the ": null
    },
    {
        "art nouveau": "Art Nouveau"
    },
    {
        " style. Between 1910 and 1913, Perret used his experience in concrete apartment buildings to construct the Théâtre des Champs-Élysées, 15 ": null
    },
    {
        "avenue Montaigne": "Avenue Montaigne"
    },
    {
        ". Between 1925 and 1928 he constructed the new art deco facade of the ": null
    },
    {
        "La Samaritaine": "La Samaritaine"
    },
    {
        " department store in Paris.     After the First World War, art deco buildings of steel and reinforced concrete began to appear in large cities across Europe and the United States. In the United States the style was most commonly used for office buildings, government buildings, movie theaters, and railroad stations. It sometimes was combined with other styles; ": null
    },
    {
        "Los Angeles City Hall": "Los Angeles City Hall"
    },
    {
        " combined Art Deco with a roof based on the ancient Greek ": null
    },
    {
        "Mausoleum at Halicarnassus": "Mausoleum At Halicarnassus"
    },
    {
        ", while the ": null
    },
    {
        "Los Angeles railroad station": "Los Angeles Railroad Station"
    },
    {
        " combined Deco with Spanish mission architecture. Art Deco elements also appeared in engineering projects, including the towers of the ": null
    },
    {
        "Golden Gate Bridge": "Golden Gate Bridge"
    },
    {
        " and the intake towers of ": null
    },
    {
        "Hoover Dam": "Hoover Dam"
    },
    {
        ". In the 1920s and 1930s it became a truly international style, with examples including the ": null
    },
    {
        "Palacio de Bellas Artes": "Palacio De Bellas Artes"
    },
    {
        " in ": null
    },
    {
        "Mexico City": "Mexico City"
    },
    {
        " by , the ": null
    },
    {
        "Mayakovskaya Metro Station": "Mayakovskaya"
    },
    {
        " in ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        " and the ": null
    },
    {
        "National Diet Building": "National Diet Building"
    },
    {
        " in Tokyo by Watanabe Fukuzo.     The Art Deco style was not limited to buildings on land; the ocean liner SS Normandie, whose first voyage was in 1935, featured Art Deco design, including a dining room whose ceiling and decoration were made of glass by ": null
    },
    {
        "Lalique": "Lalique"
    },
    {
        " Fisher Building": "Fisher Building"
    },
    {
        " in Detroit by ": null
    },
    {
        "Joseph Nathaniel French": "Joseph Nathaniel French"
    },
    {
        " Guardian Building": "Guardian Building"
    },
    {
        " in Detroit by ": null
    },
    {
        "Wirt Rowland": "Wirt Rowland"
    },
    {
        " 450 Sutter Street": "450 Sutter Street"
    },
    {
        " in San Francisco by ": null
    },
    {
        "Timothy Pflueger": "Timothy Pflueger"
    },
    {
        " Chrysler Building": "Chrysler Building"
    },
    {
        " by ": null
    },
    {
        "William Van Alen": "William Van Alen"
    },
    {
        " Chrysler Building": "Chrysler Building"
    },
    {
        "       The grand showcases of Art deco interior design were the lobbies of government buildings, theaters, and particularly office buildings. Interiors were extremely colorful and dynamic, combining sculpture, murals, and ornate geometric design in marble, glass, ceramics and stainless steel. An early example was the ": null
    },
    {
        "Fisher Building": "Fisher Building"
    },
    {
        " in Detroit, by ": null
    },
    {
        "Joseph Nathaniel French": "Joseph Nathaniel French"
    },
    {
        "; the lobby was highly decorated with sculpture and ceramics. The ": null
    },
    {
        "Guardian Building": "Guardian Building"
    },
    {
        " in Detroit, by ": null
    },
    {
        "Wirt Rowland": "Wirt Rowland"
    },
    {
        " , decorated with red and black marble and brightly colored ceramics, highlighted by highly polished steel elevator doors and counters. The sculptural decoration installed in the walls illustrated the virtues of industry and saving; the building was immediately termed the Cathedral of Commerce . The Medical and Dental Building called ": null
    },
    {
        "450 Sutter Street": "450 Sutter Street"
    },
    {
        " in San Francisco by ": null
    },
    {
        "Timothy Pflueger": "Timothy Pflueger"
    },
    {
        " was inspired by ": null
    },
    {
        "Mayan": "Maya Civilization"
    },
    {
        " architecture, in a highly stylized form; it used pyramid shapes, and the interior walls were covered highly stylized rows of hieroglyphs.     In France, the best example of an Art Deco interior during period was the ": null
    },
    {
        "Palais de la Porte Dorée": "Palais De La Porte Dorée"
    },
    {
        " by ": null
    },
    {
        "Albert Laprade": "Albert Laprade"
    },
    {
        ", ": null
    },
    {
        "Léon Jaussely": "Léon Jaussely"
    },
    {
        " and ": null
    },
    {
        "Léon Bazin": "Léon Bazin"
    },
    {
        ". The building was built for the ": null
    },
    {
        "Paris Colonial Exposition of 1931": "Paris Colonial Exposition Of 1931"
    },
    {
        ", to celebrate the people and products of French colonies. The exterior facade was entirely covered with sculpture, and the lobby created an Art Deco harmony with a wood parquet floor in a geometric pattern, a mural depicting the people of French colonies; and a harmonious composition of vertical doors and horizontal balconies. ": null
    },
    {
        "Graumans Egyptian Theater": "Graumans Egyptian Theater"
    },
    {
        " Radio City Music Hall": "Radio City Music Hall"
    },
    {
        " Gaumont State Cinema": "Gaumont State Cinema"
    },
    {
        " Paramount": "Paramount"
    },
    {
        " in ": null
    },
    {
        "Shanghai": "Shanghai"
    },
    {
        ", China     Many of the best surviving examples of Art Deco are movie theaters built in the 1920s and 1930s. The Art Deco period coincided with the conversion of silent films to sound, and movie companies built enormous theaters in major cities to capture the huge audience that came to see movies. Movie palaces in the 1920s often combined exotic themes with art deco style; ": null
    },
    {
        "Graumans Egyptian Theater": "Graumans Egyptian Theater"
    },
    {
        " in Hollywood was inspired by ancient Egyptian ": null
    },
    {
        "tombs": "Tomb"
    },
    {
        " and ": null
    },
    {
        "pyramids": "Pyramid"
    },
    {
        ", while the ": null
    },
    {
        "Fox Theater": "Fox Theater"
    },
    {
        " in Bakersfield, California attached a tower in California Mission style to an Art Deco hall. The largest of all is ": null
    },
    {
        "Radio City Music Hall": "Radio City Music Hall"
    },
    {
        " in New York City, which opened in 1932. Originally designed as a stage theater, it quickly transformed into a movie theater, which could seat 6,015 persons The interior design by ": null
    },
    {
        "Donald Deskey": "Donald Deskey"
    },
    {
        " used glass, aluminum, chrome, and leather to create a colorful escape from reality The ": null
    },
    {
        "Paramount Theater": "Paramount Theater"
    },
    {
        " in Oakland, California, by Timothy Pflueger, had a colorful ceramic facade a lobby four stories high, and separate Art Deco smoking rooms for gentlemen and ladies. Similar grand palaces appeared in Europe. The ": null
    },
    {
        "Grand Rex": "Grand Rex"
    },
    {
        " in Paris , with its imposing tower, was the largest movie theater in Europe. The ": null
    },
    {
        "Gaumont State Cinema": "Gaumont State Cinema"
    },
    {
        " in London had a tower modeled after the Empire State building, covered with cream-colored ceramic tiles and an interior in an Art Deco-Italian Renaissance style. The ": null
    },
    {
        "Paramount": "Paramount"
    },
    {
        " Theater in ": null
    },
    {
        "Shanghai": "Shanghai"
    },
    {
        ", China was originally built as a dance hall called The gate of 100 pleasures; it was converted to a movie theater after the Communist Revolution in 1949, and now is a ballroom and disco. In the 1930s Italian architects built a small movie palace, the Cinema Impero, in ": null
    },
    {
        "Asmara": "Asmara"
    },
    {
        " in what is now ": null
    },
    {
        "Eritrea": "Eritrea"
    },
    {
        ". Today, many of the movie theaters have been subdivided into multiplexes, but others have been restored and are used as cultural centers in their communities.        Paquebot or ocean liner style, 3 boulevard Victor , by ": null
    },
    {
        "Pierre Patout": "Pierre Patout"
    },
    {
        " Pan-Pacific Auditorium": "Pan-Pacific Auditorium"
    },
    {
        " Marine Air Terminal": "Marine Air Terminal"
    },
    {
        " at ": null
    },
    {
        "La Guardia Airport": "La Guardia Airport"
    },
    {
        " Hoover Building": "Hoover Building"
    },
    {
        " canteen in ": null
    },
    {
        "Perivale": "Perivale"
    },
    {
        " 1939 New York Worlds Fair": "1939 New York Worlds Fair"
    },
    {
        " BBC Broadcasting House": "Bbc Broadcasting House"
    },
    {
        " First Church of Deliverance": "First Church Of Deliverance"
    },
    {
        ", Chicago, IL , by ": null
    },
    {
        "Walter T. Bailey": "Walter T. Bailey"
    },
    {
        ". Towers added 1948.       In the late 1930s, a new variety of Art Deco architecture became common; it was called ": null
    },
    {
        "Streamline Moderne": "Streamline Moderne"
    },
    {
        " or simply Streamline, or, in France, the Style Paqueboat, or Ocean Liner style. Buildings in the style were had rounded corners, long horizontal lines; they were built of reinforced concrete, and were almost always white; and sometimes had nautical features, such as railings that resembled those on a ship. The rounded corner was not entirely new; it had appeared in Berlin in 1923 in the ": null
    },
    {
        "Mossehaus": "Mossehaus"
    },
    {
        " by ": null
    },
    {
        "Erich Mendelsohn": "Erich Mendelsohn"
    },
    {
        ", and later in the ": null
    },
    {
        "Hoover Building": "Hoover Building"
    },
    {
        ", an industrial complex in the London suburb of ": null
    },
    {
        "Perivale": "Perivale"
    },
    {
        ". In the United States, it became most closely associated with transport; Streamline moderne was rare in office buildings, but was often used for bus stations and airport terminals, such as terminal at La Guardia airport in New York City that handled the first transatlantic flights, via the PanAm clipper flying boats; and in roadside architecture, such as gas stations and diners. In the late 1930s a series of diners, modeled after streamlined railroad cars, were produced and installed in towns in New England; at least two examples still remain and are now registered historic buildings. ": null
    },
    {
        "Cleveland": "Cleveland, Ohio"
    },
    {
        " Chrysler Building": "Chrysler Building"
    },
    {
        ", by ": null
    },
    {
        "William Van Alen": "William Van Alen"
    },
    {
        " Wisconsin Gas Building": "Wisconsin Gas Building"
    },
    {
        " Paramount Theater ": "Paramount Theater"
    },
    {
        "     Decoration in the Art Deco period went through several distinct phases. Between 1910 and 1920, as Art Nouveau was exhausted, design styles saw a return to tradition, particularly in the work of Paul Iribe. In 1912 André Vera published an essay in the magazine LArt Décoratif calling for a return to the craftsmanship and materials of earlier centuries, and using a new repertoire of forms taken from nature, particularly baskets and garlands of fruit and flowers. A second tendency of Art Deco, also from 1910 to 1920, was inspired by the bright colors of the artistic movement known as the ": null
    },
    {
        "Fauves": "Fauvism"
    },
    {
        " and by the colorful costumes and sets of the Ballets Russes. This style was often expressed with exotic materials such as sharkskin, mother of pearl, ivory, tinted leather, lacquered and painted wood, and decorative inlays on furniture that emphasized its geometry. This period of the style reached its high point in the 1925 Paris Exposition of Decorative Arts. In the late 1920s and the 1930s, the decorative style changed, inspired by new materials and technologies. It became sleeker and less ornamental. Furniture, like architecture, began to have rounded edges and to take on a polished, streamlined look, taken from the streamline modern style. New materials, such as chrome-plated steel, aluminum and ": null
    },
    {
        "bakelite": "Bakelite"
    },
    {
        ", an early form of plastic, began to appear in furniture and decoration. Explanatory text on Art Deco in the Museum of Decorative Arts, Paris     Throughout the Art Deco period, and particularly in the 1930s, the motifs of the decor expressed the function of the building. Theaters were decorated with sculpture which illustrated music, dance, and excitement; power companies showed sunrises, the Chrysler building showed stylized hood ornaments; The friezes of Palais de la Porte Dorée at the 1931 Paris Colonial Exposition showed the faces of the different nationalities of French colonies. The Streamline style made it appear that the building itself was in motion. The WPA murals of the 1930s featured ordinary people; factory workers, postal workers, families and farmers, in place of classical heroes. ": null
    },
    {
        "Paul Follot": "Paul Follot"
    },
    {
        " Louis Süe": "Louis Süe"
    },
    {
        " and painted screen by ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        " Paul Follot": "Paul Follot"
    },
    {
        " Émile-Jacques Ruhlmann": "Émile-Jacques Ruhlmann"
    },
    {
        " Émile-Jacques Ruhlmann": "Émile-Jacques Ruhlmann"
    },
    {
        " Émile-Jacques Ruhlmann": "Émile-Jacques Ruhlmann"
    },
    {
        " shagreen": "Shagreen"
    },
    {
        " or sharkskin, by ": null
    },
    {
        "André Groult": "André Groult"
    },
    {
        " Gio Ponti": "Gio Ponti"
    },
    {
        " Michel Roux-Spitz": "Michel Roux-Spitz"
    },
    {
        " Jules Leleu": "Jules Leleu"
    },
    {
        " Waterfall style": "Waterfall Style"
    },
    {
        " buffet table       French furniture from 1910 until the early 1920s was largely an updating of French traditional furniture styles, and the art nouveau designs of ": null
    },
    {
        "Louis Majorelle": "Louis Majorelle"
    },
    {
        ", ": null
    },
    {
        "Charles Plumet": "Charles Plumet"
    },
    {
        " and other manufacturers. French furniture manufacturers felt threatened by the growing popularity of German manufacturers and styles, particularly the ": null
    },
    {
        "Biedermeier": "Biedermeier"
    },
    {
        " style, which was simple and clean-lined. The French designer Frantz Jourdain, the President of the Paris Salon dAutomne, invited designers from Munich to participate in the 1910 Salon. French designers saw the new German style, and decided to meet the German challenge. The French designers decided to present new French styles in the Salon of 1912. The rules of the Salon indicated that only modern styles would be permitted. All of the major French furniture designers took part in Salon: Paul Follot, Paul Iribe, Maurice Dufrene, André Groult, André Mare and Louis Suë took part, presenting new works that updated the traditional French styles of Louis XVI and ": null
    },
    {
        "Louis Philippe": "Louis Philippe"
    },
    {
        " with more angular corners inspired by Cubism and brighter colors inspired by Fauvism and the Nabis.     The painter ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        " and furniture designer ": null
    },
    {
        "Louis Süe": "Louis Süe"
    },
    {
        " both participated the 1912 Salon. After the war the two men joined together to form their own company, formally called the Compagnie des Arts Française, but usually known simply as Suë and Mare. Unlike the prominent art nouveau designers like Louis Majorelle, who personally designed every piece, they assembled a team of skilled craftsmen and produced complete interior designs, including furniture, glassware, carpets, ceramics, wallpaper and lighting. Their work featured bright colors and furniture and fine woods, such ebony encrusted with mother of pearl, abalone and silvered metal to create bouquets of flowers. They designed everything from the interiors of ocean liners to perfume bottles for the label of ": null
    },
    {
        "Jean Patou": "Jean Patou"
    },
    {
        ".The firm prospered in the early 1920s, but the two men were better craftsmen than businessmen. The firm was sold in 1928, and both men left.     The most prominent furniture designer at the 1925 Decorative Arts Exposition was ": null
    },
    {
        "Émile-Jacques Ruhlmann": "Émile-Jacques Ruhlmann"
    },
    {
        ", from Alsace. He first exhibited his works at the 1913 Autumn Salon, then had his own pavilion, the House of the Rich Collector , at the 1925 Exposition. He used only most rare and expensive materials, including ": null
    },
    {
        "ebony": "Ebony"
    },
    {
        ", ": null
    },
    {
        "mahogany": "Mahogany"
    },
    {
        ", ": null
    },
    {
        "rosewood": "Rosewood"
    },
    {
        ", ": null
    },
    {
        "ambon": "Ambon Island"
    },
    {
        " and other exotic woods, decorated with inlays of ivory, tortoise shell, mother of pearl, Little pompoms of silk decorated the handles of drawers of the cabinets. His furniture was based upon 18th-century models, but simplified and reshaped. In all of his work, the interior structure of the furniture was completely concealed. The framework usually of oak, was completely covered with an overlay of thin strips of wood, then covered by a second layer of strips of rare and expensive woods. This was then covered with a veneer and polished, so that the piece looked as if it had been cut out of a single block of wood. Contrast to the dark wood was provided by inlays of ivory, and ivory key plates and handles. According to Ruhlmann, armchairs had to be designed differently according to the functions of the rooms where they appeared; living room armchairs were designed to be welcoming, office chairs comfortable, and salon chairs voluptuous. Only a small number of pieces of each design of furniture was made, and the average price of one of his beds or cabinets was greater than the price of an average house.     ": null
    },
    {
        "Jules Leleu": "Jules Leleu"
    },
    {
        " was a traditional furniture designer who moved smoothly into Art Deco in the 1920s; he designed the furniture for the dining room of the ": null
    },
    {
        "Élysée Palace": "Élysée Palace"
    },
    {
        ", and for the first-class cabins of the steamship Normandie. his style was characterized by the use of ebony, Macassar wood, walnut, with decoration of plaques of ivory and mother of pearl. He introduced the style of lacquered art deco furniture at the end of in the late 1920s, and in the late 1930s introduced furniture made of metal with panels of smoked glass. In Italy, the designer ": null
    },
    {
        "Gio Ponti": "Gio Ponti"
    },
    {
        " was famous for his streamlined designs.     The costly and exotic furniture of Ruhlmann and other traditionalists infuriated modernists, including the architect Le Corbusier, causing him to write a famous series of articles denouncing the arts décoratif style. He attacked furniture made only for the rich, and called upon designers to create furniture made with inexpensive materials and modern style, which ordinary people could afford. He designed his own chairs, created to be inexpensive and mass-produced.      In the 1930s, furniture designs adapted to the form, with smoother surfaces and curved forms. The masters of the late style included Donald Deskey was one of the most influential designers; he created the interior of the Radio City Music Hall. He used a mixture of traditional and very modern materials, including aluminum, chrome, and bakelite, an early form of plastic. The ": null
    },
    {
        "Waterfall style": "Waterfall Style"
    },
    {
        " was popular the 1930s and 1940s, the most prevalent Art Deco form of furniture at the time. Pieces were typically of plywood finished with blond veneer and with rounded edges, resembling a waterfall.         ": null
    },
    {
        "Chrysler Airflow": "Chrysler Airflow"
    },
    {
        " SS Normandie": "Ss Normandie"
    },
    {
        " , by ": null
    },
    {
        "Pierre Patout": "Pierre Patout"
    },
    {
        "; bas-reliefs by ": null
    },
    {
        "Raymond Delamarre": "Raymond Delamarre"
    },
    {
        " Bugatti": "Bugatti"
    },
    {
        " Electrolux": "Electrolux"
    },
    {
        " 20th Century Limited": "20Th Century Limited"
    },
    {
        " Hudson 4-6-4 Streamlined Locomotive       Streamline was a variety of Art Deco which emerged during the mid-1930s. It was influenced by modern ": null
    },
    {
        "aerodynamic": "Aerodynamics"
    },
    {
        " principles developed for aviation and ": null
    },
    {
        "ballistics": "Ballistics"
    },
    {
        " to reduce aerodynamic drag at high velocities. The bullet shapes were applied by designers to cars, trains, ships, and even objects not intended to move, such as ": null
    },
    {
        "refrigerators": "Refrigerator"
    },
    {
        ", ": null
    },
    {
        "gas pumps": "Fuel Dispenser"
    },
    {
        ", and buildings. One of the first production vehicles in this style was the ": null
    },
    {
        "Chrysler Airflow": "Chrysler Airflow"
    },
    {
        " of 1933. It was unsuccessful commercially, but the beauty and functionality of its design set a precedent; meant modernity. It continued to be used in car design well after World War II.         New industrial materials began to influence design of cars and household objects. These included ": null
    },
    {
        "aluminum": "Aluminum"
    },
    {
        ", ": null
    },
    {
        "chrome": "Chrome Plating"
    },
    {
        ", and ": null
    },
    {
        "bakelite": "Bakelite"
    },
    {
        ", an early form of plastic. Bakelite could be easily molded into different forms, and soon was used in telephones, radios and other appliances.     Ocean liners also adopted a style of Art Deco, known in French as the Style Paquebot, or Ocean Liner Style . The most famous example was the SS Normandie, which made its first transatlantic trip in 1935. It was designed particularly to bring wealthy Americans to Paris to shop. The cabins and salons featured the latest Art Deco furnishings and decoration. The Grand Salon of the ship, which was the restaurant for first-class passengers, was bigger than the Hall of Mirrors of the ": null
    },
    {
        "Palace of Versailles": "Palace Of Versailles"
    },
    {
        " Abundance by ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        ", , ": null
    },
    {
        "Metropolitan Museum of Art": "Metropolitan Museum Of Art"
    },
    {
        " André Mare": "André Mare"
    },
    {
        " Paul Iribe": "Paul Iribe"
    },
    {
        "     Textiles were an important part of the Art Deco style, in the form of colorful wallpaper, upholstery and carpets, In the 1920s, designers were inspired by the stage sets of the ": null
    },
    {
        "Ballets Russes": "Ballets Russes"
    },
    {
        ", fabric designs and costumes from ": null
    },
    {
        "Léon Bakst": "Léon Bakst"
    },
    {
        " and creations by the ": null
    },
    {
        "Wiener Werkstätte": "Wiener Werkstätte"
    },
    {
        ". The early interior designs of ": null
    },
    {
        "André Mare": "André Mare"
    },
    {
        " featured brightly colored and highly stylized garlands of roses and flowers, which decorated the walls, floors, and furniture. Stylized Floral motifs also dominated the work of ": null
    },
    {
        "Raoul Dufy": "Raoul Dufy"
    },
    {
        " and ": null
    },
    {
        "Paul Poiret": "Paul Poiret"
    },
    {
        ", and in the furniture designs of J.E. Ruhlmann. The floral carpet was reinvented in Deco style by ": null
    },
    {
        "Paul Poiret": "Paul Poiret"
    },
    {
        ". De Morant, Henry, Histoire des arts décoratifs , pg. 448-453     The use of the style was greatly enhanced by the introduction of the pochoir stencil-based printing system, which allowed designers to achieve crispness of lines and very vivid colors. Art Deco forms appeared in the clothing of ": null
    },
    {
        "Paul Poiret": "Paul Poiret"
    },
    {
        ", ": null
    },
    {
        "Charles Worth": "Charles Worth"
    },
    {
        " and ": null
    },
    {
        "Jean Patou": "Jean Patou"
    },
    {
        ". After World War I, exports of clothing and fabrics became one of the most important currency earners of France. Beltra, Rubio, Exploring Art Deco in Textile and Fashion Design, Dec. 20, 2016, Site of ": null
    },
    {
        "Metropolitan Museum": "Metropolitan Museum"
    },
    {
        "     Late Art Deco wallpaper and textiles sometimes featured stylized industrial scenes, cityscapes, locomotives and other modern themes, as well as stylized female figures, metallic colors and geometric designs.     Fashion changed dramatically during the Art Deco period, thanks in particular to designers ": null
    },
    {
        "Paul Poiret": "Paul Poiret"
    },
    {
        " and later ": null
    },
    {
        "Coco Chanel": "Coco Chanel"
    },
    {
        ". Poiret introduced an important innovation to fashion design, the concept of ": null
    },
    {
        "draping": "Drapery"
    },
    {
        ", a departure from the tailoring and pattern-making of the past.  He designed clothing cut along straight lines and constructed of rectangular motifs. His styles offered structural simplicity The corseted look and formal styles of the previous period were abandoned, and fashion became more practical, and streamlined. with the use of new materials, brighter colors and printed designs. The designer ": null
    },
    {
        "Coco Chanel": "Coco Chanel"
    },
    {
        " continued the transition, popularizing the style of sporty, casual chic.  ": null
    },
    {
        "Paul Poiret": "Paul Poiret"
    },
    {
        ", c. 1912, silk and metal, ": null
    },
    {
        "Metropolitan Museum of Art": "Metropolitan Museum Of Art"
    },
    {
        " Annette Kellerman": "Annette Kellerman"
    },
    {
        " Cécile Sorel": "Cécile Sorel"
    },
    {
        ", at the ": null
    },
    {
        "Comédie-Française": "Comédie-Française"
    },
    {
        " Desiree Lubovska": "Desiree Lubovska"
    },
    {
        " in a dress by ": null
    },
    {
        "Jean Patou": "Jean Patou"
    },
    {
        " Natacha Rambova": "Natacha Rambova"
    },
    {
        " in a dress designed by ": null
    },
    {
        "Paul Poiret": "Paul Poiret"
    },
    {
        " Coco Chanel": "Coco Chanel"
    },
    {
        "  René Lalique": "René Lalique"
    },
    {
        " Boucheron": "Boucheron"
    },
    {
        " , a gold buckle set with diamonds and carved onyx, lapis lazuli, jade, and coral   Cartier 3526707735 f4583fda9a.jpg|": null
    },
    {
        "Cartier": "Cartier"
    },
    {
        ", , Mackay Emerald Necklace, emerald, diamond and platinum, ": null
    },
    {
        "Smithsonian National Museum of Natural History, USA": "Smithsonian National Museum Of Natural History"
    },
    {
        "       In the 1920s and 1930s, designers including René Lalique and Cartier tried to reduce the traditional dominance of ": null
    },
    {
        "diamonds": "Diamonds"
    },
    {
        " by introducing more colorful gemstones, such as small emeralds, rubies and sapphires. They also placed greater emphasis on very elaborate and elegant settings, featuring less-expensive materials such as enamel, glass, horn and ivory. Diamonds themselves were cut in less traditional forms; the 1925 Exposition saw a large number of diamonds cut in the form of tiny rods or matchsticks. The settings for diamonds also changed; More and more often jewelers used ": null
    },
    {
        "platinum": "Platinum"
    },
    {
        " instead of gold, since it was strong and flexible, and could set clusters of stones. Jewelers also began to use more dark materials, such as enamels and black ": null
    },
    {
        "onyx": "Onyx"
    },
    {
        ", which provided a higher contrast with diamonds.     Jewelry became much more colorful and varied in style. Cartier and the firm of Boucheron combined diamonds with colorful other gemstones cut into the form of leaves, fruit or flowers, to make brooches, rings, earrings, clips and pendants. Far Eastern themes also became popular; plaques of jade and coral were combined with platinum and diamonds, and vanity cases, cigarette cases and powder boxes were decorated with Japanese and Chinese landscapes made with mother of pearl, enamel and lacquer.     Rapidly changing fashions in clothing brought new styles of jewelry. Sleeveless dresses of the 1920s meant that arms needed decoration, and designers quickly created bracelets of gold, silver and platinum encrusted with lapis-lazuli, onyx, coral, and other colorful stones; Other bracelets were intended for the upper arms, and several bracelets were often worn at the same time. The short haircuts of women in the twenties called for elaborate deco earring designs. As women began to smoke in public, designers created very ornate cigarette cases and ivory cigarette holders. The invention of the wrist-watch before World War I inspired jewelers to create extraordinary decorated watches, encrusted with diamonds and plated with enamel, gold and silver. Pendant watches, hanging from a ribbon, also became fashionable.     The established jewelry houses of Paris in the period, Cartier, ": null
    },
    {
        "Chaumet": "Chaumet"
    },
    {
        ", Georges Fouquet, ": null
    },
    {
        "Mauboussin": "Mauboussin"
    },
    {
        ", and ": null
    },
    {
        "Van Cleef & Arpels": "Van Cleef  &  Arpels"
    },
    {
        " all created jewelry and objects in the new fashion. The firm of Chaumet made highly geometric cigarette boxes, cigarette lighters, pillboxes and notebooks, made of hard stones decorated with ": null
    },
    {
        "jade": "Jade"
    },
    {
        ", ": null
    },
    {
        "lapis lazuli": "Lapis Lazuli"
    },
    {
        ", diamonds and sapphires. They were joined by many young new designers, each with his own idea of deco. ": null
    },
    {
        "Raymond Templier": "Raymond Templier"
    },
    {
        " designed pieces with highly intricate geometric patterns, including silver earrings that looked like skyscrapers. ": null
    },
    {
        "Gerard Sandoz": "Gerard Sandoz"
    },
    {
        " was only 18 when he started to design jewelry in 1921; he designed many celebrated pieces based on the smooth and polished look of modern machinery. The glass designer René Lalique also entered the field, creating pendants of fruit, flowers, frogs, fairies or mermaids made of sculpted glass in bright colors, hanging on cords of silk with tassels. The jeweler ": null
    },
    {
        "Paul Brandt": "Paul Brandt"
    },
    {
        " contrasted rectangular and triangular patterns, and embedded pearls in lines on onyx plaques. ": null
    },
    {
        "Jean Despres": "Jean Despres"
    },
    {
        " made necklaces of contrasting colors by bringing together silver and black lacquer, or gold with lapis lazuli. Many of his designs looked like highly polished pieces of machines. ": null
    },
    {
        "Jean Dunand": "Jean Dunand"
    },
    {
        " was also inspired by modern machinery, combined with bright reds and blacks contrasting with polished metal. The Firebird Parrot Victoire by ": null
    },
    {
        "René Lalique": "René Lalique"
    },
    {
        " Daum": "Daum"
    },
    {
        " Daum": "Daum"
    },
    {
        " vase       Like the Art Nouveau period before it, Art Deco was an exceptional period for fine glass and other decorative objects, designed to fit their architectural surroundings. The most famous producer of glass objects was René Lalique, whose works, from vases to hood ornaments for automobiles, became symbols of the period. He had made ventures into glass before World War I, designing bottles for the perfumes of ": null
    },
    {
        "François Coty": "François Coty"
    },
    {
        ", but he did not begin serious production of art glass until after World War I. In 1918, at the age of 58, he bought a large glass works in Combs-la-Ville and began to manufacture both artistic and practical glass objects. He treated glass as a form of sculpture, and created statuettes, vases, bowls, lamps and ornaments. He used demi-crystal rather than lead crystal, which was softer and easier to form, though not as lustrous. He sometimes used colored glass, but more often used opalescent glass, where part or the whole of the outer surface was stained with a wash. Lalique provided the decorative glass panels, lights and illuminated glass ceilings for the ocean liners ": null
    },
    {
        "SS Ile de France": "Ss Ile De France"
    },
    {
        " in 1927 and the SS Normandie in 1935, and for some of the first-class sleeping cars of the French railroads. At the 1925 Exposition of Decorative Arts, he had his own pavilion, designed a dining room with a table settling and matching glass ceiling for the Sèvres Pavilion, and designed a glass fountain for the courtyard of the Cours des Métier, a slender glass column which spouted water from the sides and was illuminated at night.     Other notable Art Deco glass manufacturers included Marius-Ernest Sabino, who specialized in figurines, vases, bowls, and glass sculptures of fish, nudes, and animals. For these he often used an opalescent glass which could change from white to blue to amber, depending upon the light. His vases and bowls featured molded friezes of animals, nudes or busts of women with fruit or flowers. His work was less subtle but more colorful than that of Lalique.     Other notable Deco glass designers included Edmond Etling, who also used bright opalescent colors, often with geometric patterns and sculpted nudes; Albert Simonet, and Aristide Colotte and ": null
    },
    {
        "Maurice Marinot": "Maurice Marinot"
    },
    {
        ", who was known for his deeply etched sculptural bottles and vases. The firm of ": null
    },
    {
        "Daum": "Daum"
    },
    {
        " from the city of ": null
    },
    {
        "Nancy": "Nancy, France"
    },
    {
        ", which had been famous for its Art Nouveau glass, produced a line of Deco vases and glass sculpture, solid, geometric and chunky in form. More delicate multicolored works were made by ": null
    },
    {
        "Gabriel Argy-Rousseau": "Gabriel Argy-Rousseau"
    },
    {
        ", who produced delicately colored vases with sculpted butterflies and nymphs, and Francois Decorchemont, whose vases were streaked and marbled.     The Great Depression ruined a large part of the decorative glass industry, which depended upon wealthy clients. Some artists turned to designing stained glass windows for churches. In 1937, the ": null
    },
    {
        "Steuben": "Steuben Glass Works"
    },
    {
        " glass company began the practice of commissioning famous artists to produce glassware. ": null
    },
    {
        "Louis Majorelle": "Louis Majorelle"
    },
    {
        ", famous for his Art Nouveau furniture, designed a remarkable Art Deco stained glass window portraying steel workers for the offices of the ": null
    },
    {
        "Aciéries de Longwy": "Aciéries De Longwy"
    },
    {
        ", a steel mill in ": null
    },
    {
        "Longwy": "Longwy"
    },
    {
        " The Pheasants Oasis ": null
    },
    {
        "Norman Bel Geddes": "Norman Bel Geddes"
    },
    {
        "       Art Deco artists produced a wide variety of practical objects in the Art Deco style, made of industrial materials from traditional wrought iron to chrome-plated steel. The American artist ": null
    },
    {
        "Norman Bel Geddes": "Norman Bel Geddes"
    },
    {
        " designed a cocktail set resembling a skyscraper made of chrome-plated steel. Raymond Subes designed an elegant metal grille for the entrance of the Palais de la Porte Dorée, the centerpiece of the 1931 Paris Colonial Exposition. The French sculptor ": null
    },
    {
        "Jean Dunand": "Jean Dunand"
    },
    {
        " produced magnificent doors on the theme The Hunt , covered with gold leaf and paint on plaster .       Art Deco visuals and imagery was used in ": null
    },
    {
        "animated films": "Animated Film"
    },
    {
        " including  Batman ,  Night Hood ,  Alls Fair at the Fair ,  Merry Mannequins ,  Page Miss Glory ,  Fantasia  and  Sleeping Beauty .        Art Deco architecture began in Europe, but by 1939 there were examples in large cities on every continent and in almost every country. This is a selection of prominent buildings on each continent.         ": null
    },
    {
        "Fiat Tagliero Building": "Fiat Tagliero Building"
    },
    {
        " in ": null
    },
    {
        "Asmara": "Asmara"
    },
    {
        ", ": null
    },
    {
        "Eritrea": "Eritrea"
    },
    {
        " by ": null
    },
    {
        "Giuseppe Pettazzi": "Giuseppe Pettazzi"
    },
    {
        "  St. Peters Cathedral": "St. Peters Cathedral, Rabat"
    },
    {
        " in ": null
    },
    {
        "Rabat": "Rabat"
    },
    {
        ", ": null
    },
    {
        "Morocco": "Morocco"
    },
    {
        "       Most Art Deco buildings in Africa were built during European colonial rule, and often designed by Italian and French architects.        ": null
    },
    {
        "New India Assurance Building": "New India Assurance Building"
    },
    {
        " in ": null
    },
    {
        "Mumbai": "Mumbai"
    },
    {
        " Broadway Mansions": "Broadway Mansions"
    },
    {
        " in ": null
    },
    {
        "Shanghai": "Shanghai"
    },
    {
        " National Diet Building": "National Diet Building"
    },
    {
        " in ": null
    },
    {
        "Tokyo": "Tokyo"
    },
    {
        " Kologdam Building": "Kologdam Building"
    },
    {
        " in ": null
    },
    {
        "Bandung": "Bandung"
    },
    {
        " Ankara railway station": "Ankara Railway Station"
    },
    {
        " in ": null
    },
    {
        "Ankara": "Ankara"
    },
    {
        ", ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        " Dare House": "Dare House"
    },
    {
        " in ": null
    },
    {
        "Chennai": "Chennai"
    },
    {
        ", India       A large number of the Art Deco buildings in Asia were designed by European architects. But in the Philippines, local architects such as ": null
    },
    {
        "Juan Nakpil": "Juan Nakpil"
    },
    {
        ", ": null
    },
    {
        "Juan Arellano": "Juan Arellano"
    },
    {
        " and others were preeminent. Many Art Deco landmarks in Asia were demolished during the great economic expansion of Asia the late 20th century, but some notable enclaves of the architecture still remain, particularly in ": null
    },
    {
        "Shanghai": "Shanghai"
    },
    {
        " and ": null
    },
    {
        "Mumbai": "Mumbai"
    },
    {
        ".        ": null
    },
    {
        "Manchester Unity Building": "Manchester Unity Building"
    },
    {
        " in ": null
    },
    {
        "Melbourne": "Melbourne"
    },
    {
        " Napier, New Zealand": "Napier, New Zealand"
    },
    {
        " ANZAC War Memorial": "Anzac War Memorial"
    },
    {
        " in ": null
    },
    {
        "Sydney": "Sydney"
    },
    {
        "       Melbourne and Sydney Australia have several notable Art Deco buildings, including the ": null
    },
    {
        "Manchester Unity Building": "Manchester Unity Building"
    },
    {
        " and the former ": null
    },
    {
        "Russell Street Police Headquarters": "Russell Street Police Headquarters"
    },
    {
        " in Melbourne, the Castlemaine Art Museum in ": null
    },
    {
        "Castlemaine": "Castlemaine, Victoria"
    },
    {
        ", central Victoria and the ": null
    },
    {
        "Grace Building,": "Grace Building"
    },
    {
        " AWA Tower": "Awa Tower"
    },
    {
        " and ": null
    },
    {
        "ANZAC War Memorial": "Anzac War Memorial"
    },
    {
        " in Sydney.     Several towns in New Zealand, including ": null
    },
    {
        "Napier": "Napier, New Zealand"
    },
    {
        " and ": null
    },
    {
        "Hastings": "Hastings, New Zealand"
    },
    {
        " were rebuilt in Art Deco style after the ": null
    },
    {
        "1931 Hawkes Bay earthquake": "1931 Hawkes Bay Earthquake"
    },
    {
        ", and many of the buildings have been protected and restored. Napier has been nominated for UNESCO ": null
    },
    {
        "World Heritage Site": "World Heritage Site"
    },
    {
        " status, the first cultural site in New Zealand to be nominated.   ": null
    },
    {
        "Wellington": "Wellington"
    },
    {
        " has retained a sizeable number of Art Deco buildings.         ": null
    },
    {
        "Price Building": "Edifice Price"
    },
    {
        " in ": null
    },
    {
        "Quebec City": "Quebec City"
    },
    {
        " Vancouver City Hall": "Vancouver City Hall"
    },
    {
        " in ": null
    },
    {
        "Vancouver, British Columbia": "Vancouver"
    },
    {
        " Aguascalientes City": "Aguascalientes City"
    },
    {
        " Palacio de Bellas Artes": "Palacio De Bellas Artes"
    },
    {
        " in ": null
    },
    {
        "Mexico City": "Mexico City"
    },
    {
        ", Mexico   Barclay-Vesey Building 140 West Street.jpg|The ": null
    },
    {
        "Verizon Building": "Verizon Building"
    },
    {
        " in ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " Buffalo City Hall": "Buffalo City Hall"
    },
    {
        " in ": null
    },
    {
        "Buffalo": "Buffalo, New York"
    },
    {
        " Bullocks Wilshire": "Bullocks Wilshire"
    },
    {
        " in ": null
    },
    {
        "Los Angeles": "Los Angeles"
    },
    {
        " Louisiana State Capitol": "Louisiana State Capitol"
    },
    {
        " in ": null
    },
    {
        "Baton Rouge": "Baton Rouge, Louisiana"
    },
    {
        " Jefferson County Courthouse": "Jefferson County Courthouse"
    },
    {
        " in ": null
    },
    {
        "Beaumont": "Beaumont, Texas"
    },
    {
        ", US       In Canada, surviving Art Deco structures are mainly in the major cities; ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ", ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        ", ": null
    },
    {
        "Hamilton, Ontario": "Hamilton, Ontario"
    },
    {
        ", and ": null
    },
    {
        "Vancouver": "Vancouver"
    },
    {
        ". They range from public buildings like ": null
    },
    {
        "Vancouver City Hall": "Vancouver City Hall"
    },
    {
        " to commercial buildings  to public works .     In ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        ", the most imposing Art Deco example is interior of the ": null
    },
    {
        "Palacio de Bellas Artes": "Palacio De Bellas Artes"
    },
    {
        " , finished in 1934 with its elaborate decor and murals. Examples of Art Deco residential architecture can be found in the ": null
    },
    {
        "Condesa": "Condesa"
    },
    {
        " neighborhood, many designed by ": null
    },
    {
        "Francisco J. Serrano": "Francisco J. Serrano"
    },
    {
        ".     In the United States, Art Deco buildings are found from coast to coast, in all the major cities. It was most widely used for office buildings, train stations, airport terminals, and movie theaters; residential buildings are rare. In the 1930s, the more austere streamline style became popular. Many buildings were demolished between 1945 and the late 1960s, but then efforts began to protect the best examples. The City of Miami Beach established the ": null
    },
    {
        "Miami Beach Architectural District": "Miami Beach Architectural District"
    },
    {
        " to preserve the colorful collection of Art Deco buildings found there.        ": null
    },
    {
        "Bacardi Building": "Bacardi Building"
    },
    {
        " in ": null
    },
    {
        "Havana": "Havana"
    },
    {
        " Hotel Nacional de Cuba": "Hotel Nacional De Cuba"
    },
    {
        " in ": null
    },
    {
        "Havana": "Havana"
    },
    {
        " Plaza del Mercado de Ponce": "Plaza Del Mercado De Ponce"
    },
    {
        " in ": null
    },
    {
        "Ponce": "Ponce, Puerto Rico"
    },
    {
        ", Puerto Rico       Art Deco buildings can be found throughout Central America. A particularly rich   collection is found in ": null
    },
    {
        "Cuba": "Cuba"
    },
    {
        ", built largely for the large number of tourists who came to the island from the United States. One such building is the ": null
    },
    {
        "López Serrano": "López Serrano Building"
    },
    {
        " built between 1929 and 1932 in the ": null
    },
    {
        "Vedado": "Vedado"
    },
    {
        " section of ": null
    },
    {
        "Havana": "Havana"
    },
    {
        ".           ": null
    },
    {
        "Théâtre des Champs-Élysées": "Théâtre Des Champs-Élysées"
    },
    {
        " in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " Mossehaus": "Mossehaus"
    },
    {
        " with Art Deco elements by ": null
    },
    {
        "Erich Mendelsohn": "Erich Mendelsohn"
    },
    {
        " in ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        " Basilica of the Sacred Heart": "Basilica Of The Sacred Heart, Brussels"
    },
    {
        " in ": null
    },
    {
        "Brussels": "Brussels"
    },
    {
        " Lisbon": "Lisbon"
    },
    {
        " Palais de Tokyo": "Palais De Tokyo"
    },
    {
        ", ": null
    },
    {
        "Musée dArt Moderne de la Ville de Paris": "Musée Dart Moderne De La Ville De Paris"
    },
    {
        " Mayakovskaya Station": "Mayakovskaya"
    },
    {
        " in ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        " Rivoli Theater": "Rivoli Theatre"
    },
    {
        " in ": null
    },
    {
        "Porto": "Porto"
    },
    {
        " Daily Express Building": "Daily Express Building, Manchester"
    },
    {
        " in ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        ", UK       The architectural style first appeared in Paris with the Théâtre des Champs-Élysées by Auguste Perret but then spread rapidly around Europe, until examples could be found in nearly every large city, from London to Moscow. In Germany two variations of Art Deco flourished in the 1920s and 30s: The ": null
    },
    {
        "Neue Sachlichkeit": "New Objectivity"
    },
    {
        " style and ": null
    },
    {
        "Expressionist architecture": "Expressionist Architecture"
    },
    {
        ". Notable examples include Erich Mendelsohns Mossehaus and ": null
    },
    {
        "Schaubühne": "Schaubühne"
    },
    {
        " theater in ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        ", ": null
    },
    {
        "Fritz Högers": "Fritz Höger"
    },
    {
        " Chilehaus": "Chilehaus"
    },
    {
        " in ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        " and his ": null
    },
    {
        "Kirche am Hohenzollernplatz": "Kirche Am Hohenzollernplatz"
    },
    {
        " in Berlin, the Anzeiger Tower in ": null
    },
    {
        "Hannover": "Hannover"
    },
    {
        " and the Borsig Tower in Berlin.      One of the largest Art Deco buildings in Western Europe is the ": null
    },
    {
        "Basilica of the Sacred Heart": "Basilica Of The Sacred Heart, Brussels"
    },
    {
        " in Koekelberg, Brussels. In 1925, architect Albert van Huffel won the Grand Prize for Architecture with his scale model of the basilica at the Exposition Internationale des Arts Décoratifs et Industriels Modernes in Paris.      Spain and Portugal have some striking examples of Art Deco buildings, particularly movie theaters. Examples in Portugal are the Capitólio Theater and the Éden Cine-Theater in ": null
    },
    {
        "Lisbon": "Lisbon"
    },
    {
        ", the ": null
    },
    {
        "Rivoli Theater": "Rivoli Theatre"
    },
    {
        " and the ": null
    },
    {
        "Coliseu": "Coliseu Do Porto"
    },
    {
        " in ": null
    },
    {
        "Porto": "Porto"
    },
    {
        " and the Rosa Damasceno Theater in ": null
    },
    {
        "Santarém": "Santarém, Portugal"
    },
    {
        ". An example in Spain is the Cine Rialto in Valencia .     During the 1930s, Art Deco had a noticeable effect on house design in the United Kingdom, as well as the design of various public buildings. Straight, white-rendered house frontages rising to flat roofs, sharply geometric door surrounds and tall windows, as well as convex-curved metal corner windows, were all characteristic of that period.       The ": null
    },
    {
        "London Underground": "London Underground"
    },
    {
        " is famous for many examples of Art Deco architecture,  and there are a number of buildings in the style situated along the ": null
    },
    {
        "Golden Mile": "Golden Mile"
    },
    {
        " in Brentford. Also in West London is the Hoover Building, which was originally built for ": null
    },
    {
        "The Hoover Company": "The Hoover Company"
    },
    {
        " and was converted into a superstore in the early 1990s.          The Indian Institute of Architects, founded in Mumbai in 1929, played a prominent role in propagating the Art Deco movement. In November 1937, this institute organized the ‘Ideal Home Exhibition’ held in the Town Hall in Mumbai which spanned over 12 days and attracted about one hundred thousand visitors. As a result, it was declared a success by the Journal of the Indian Institute of Architects. The exhibits displayed the ‘ideal’, or better described as the most ‘modern’ arrangements for various parts of the house, paying close detail to avoid architectural blunders and present the most efficient and well-thought-out models. The exhibition focused on various elements of a home ranging from furniture, elements of interior decoration as well as radios and refrigerators using new and scientifically relevant materials and methods.    Guided by their desire to emulate the west, the Indian architects were fascinated by the industrial modernity that Art Deco offered. The western elites were the first to experiment with the technologically advanced facets of Art Deco, and architects began the process of transformation by the early 1930s.     Mumbais expanding port commerce in the 1930s resulted in the growth of educated middle class population. It also saw an increase of people migrating to Mumbai in search of job opportunities. This led to the pressing need for new developments through Land Reclamation Schemes and construction of new public and residential buildings.  Parallelly, the changing political climate in the country and the aspirational quality of the Art Deco aesthetics led to a whole-hearted acceptance of the building style in the citys development. Most of the buildings from this period can be seen spread throughout the city neighbourhoods in areas such as Churchgate, Colaba, Fort, Mohammed Ali Road, Cumbala Hill, Dadar, Matunga, Bandra and Chembur.          ": null
    },
    {
        "Salvador, Bahia": "Salvador, Bahia"
    },
    {
        " Altino Arantes Building": "Altino Arantes Building"
    },
    {
        ", in ": null
    },
    {
        "São Paulo": "São Paulo"
    },
    {
        " Viaduto do Chá": "Viaduto Do Chá"
    },
    {
        " Pacaembu Stadium": "Pacaembu Stadium"
    },
    {
        " Central do Brasil": "Central Do Brasil"
    },
    {
        " Station in ": null
    },
    {
        "Rio de Janeiro": "Rio De Janeiro"
    },
    {
        " Kavanagh building": "Kavanagh Building"
    },
    {
        " in ": null
    },
    {
        "Buenos Aires": "Buenos Aires"
    },
    {
        " Laprida, Buenos Aires": "Laprida, Buenos Aires"
    },
    {
        " Abasto Market": "Abasto De Buenos Aires"
    },
    {
        " in Buenos Aires, circa 1945     The Art Deco in South America is present especially at the countries that received a great wave of immigration on the first half of the 20th century, with notable works at their richest cities, like São Paulo and Rio de Janeiro in ": null
    },
    {
        "Brazil": "Brazil"
    },
    {
        " and Buenos Aires in ": null
    },
    {
        "Argentina": "Argentina"
    },
    {
        ".The ": null
    },
    {
        "Kavanagh building": "Kavanagh Building"
    },
    {
        " in ": null
    },
    {
        "Buenos Aires": "Buenos Aires"
    },
    {
        " Miami Beach Architectural District": "Miami Beach Architectural District"
    },
    {
        " U-Drop Inn": "U-Drop Inn"
    },
    {
        ", a roadside gas station and diner on U.S. ": null
    },
    {
        "Highway 66": "Highway 66"
    },
    {
        " in ": null
    },
    {
        "Shamrock, Texas": "Shamrock, Texas"
    },
    {
        " Havana": "Havana"
    },
    {
        ", ": null
    },
    {
        "Cuba": "Cuba"
    },
    {
        " Smith Center for the Performing Arts": "Smith Center For The Performing Arts"
    },
    {
        " in ": null
    },
    {
        "Las Vegas": "Las Vegas"
    },
    {
        ", ": null
    },
    {
        "Nevada": "Nevada"
    },
    {
        ", a Neo-Art Deco building or Neo-Art Deco1903-19431932": null
    },
    {
        "nsas Ci": "Nsas Ci"
    },
    {
        "kland, Californ": "Kland, Californ"
    },
    {
        " Rhythm Montreal": null
    },
    {
        "ntre": "Ntre"
    },
    {
        "ron": "Ron"
    },
    {
        "Syracuse, NY": null
    }
]