[
    {
        "        Azincourt  is a ": null
    },
    {
        "commune": "Commune Of France"
    },
    {
        " in the ": null
    },
    {
        "Pas-de-Calais": "Pas-De-Calais"
    },
    {
        " department": "Departments Of France"
    },
    {
        " in northern France.     The ": null
    },
    {
        "Battle of Agincourt": "Battle Of Agincourt"
    },
    {
        " took place nearby.       Situated  north-west of ": null
    },
    {
        "Saint-Pol-sur-Ternoise": "Saint-Pol-Sur-Ternoise"
    },
    {
        " on the D71 road between ": null
    },
    {
        "Hesdin": "Hesdin"
    },
    {
        " and ": null
    },
    {
        "Fruges": "Fruges"
    },
    {
        "       The toponym is attested as Aisincurt in 1175, derived from a Germanic masculine name Aizo, Aizino and the early Northern French word curt farm with a courtyard . It has no etymological connection in French with ": null
    },
    {
        "Agincourt, Meurthe-et-Moselle": "Agincourt, Meurthe-Et-Moselle"
    },
    {
        " , which is derived from another Germanic male name Ingin-. ": null
    },
    {
        "Albert Dauzat": "Albert Dauzat"
    },
    {
        " and ": null
    },
    {
        "Charles Rostaing": "Charles Rostaing"
    },
    {
        ", Dictionnaire étymologique des noms de lieux en France, éditions Larousse 1968. p. 4.   The battle was named after a nearby castle called Azincourt. The modern settlement has in turn been named after the battle in the 17th century.       Azincourt is famous as being near the site of the battle fought on 25 October 1415 in which the army led by King ": null
    },
    {
        "Henry V of England": "Henry V Of England"
    },
    {
        " defeated the forces led by ": null
    },
    {
        "Charles dAlbret": "Charles Dalbret"
    },
    {
        " on behalf of ": null
    },
    {
        "Charles VI of France": "Charles Vi Of France"
    },
    {
        ", which has gone down in history as the ": null
    },
    {
        "Battle of Agincourt": "Battle Of Agincourt"
    },
    {
        ". According to M. Forrest, the French knights were so encumbered by their armour that they were exhausted even before the start of the battle. The House of Commons: 1509 – 1558, Volume 4; Stanley T. Bindoff, John S. Roskell, Lewis Namier, Romney Sedgwick, David Hayton, Eveline Cruickshanks, R. G. Thorne, P. W. Hasler     Later on, when he became king in 1509, ": null
    },
    {
        "Henry VIII": "Henry Viii"
    },
    {
        " is supposed to have commissioned an English translation of a Life of Henry V Henry VIII; J. J. Scarisbrick, p. 23 so that he could emulate him, on the grounds that he thought that launching a campaign against France would help him to impose himself on the European stage. In 1513, Henry VIII crossed the English Channel, stopping by at Azincourt.          The battle, as was the tradition, was named after a nearby castle called Azincourt. The castle has since disappeared and the settlement now known as Azincourt adopted the name in the seventeenth century. John Cassells Illustrated History of England, vol. 1 , .     ": null
    },
    {
        "John Cassell": "John Cassell"
    },
    {
        " wrote in 1857 that the village of Azincourt itself is now a group of dirty farmhouses and wretched cottages, but where the hottest of the battle raged, between that village and the commune of ": null
    },
    {
        "Tramecourt": "Tramecourt"
    },
    {
        ", there still remains a wood precisely corresponding with the one in which Henry placed his ambush; and there are yet existing the foundations of the castle of Azincourt, from which the king named the field. John Cassells Illustrated History of England, vol. 1 , .                 The original battlefield museum in the village featured model knights made out of ": null
    },
    {
        "Action Man": "Action Man"
    },
    {
        " figures. This has now been replaced by the Centre historique médiéval dAzincourt a more professional museum, conference centre and exhibition space incorporating laser, video, slide shows, audio commentaries, and some interactive elements.  The museum building is shaped like a ": null
    },
    {
        "longbow": "Longbow"
    },
    {
        " similar to those used at the battle by ": null
    },
    {
        "archers": "Archery"
    },
    {
        "under King Henry.     Since 2004 a large medieval festival organised by the local community, the CHM, The Azincourt Alliance,  and various other UK societies commemorating the battle, local history and medieval life, arts and crafts has been held in the village.   Prior to this date the festival was held in October, but due to the inclement weather and local heavy clay soil making the festival difficult, it was moved to the last Sunday in July.                 Azincourt is ": null
    },
    {
        "twinned": "Twin Towns And Sister Cities"
    },
    {
        " with:      ": null
    },
    {
        "Middleham": "Middleham"
    },
    {
        ", United Kingdom ": null
    }
]