[
    {
        "In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", especially ": null
    },
    {
        "functional analysis": "Functional Analysis"
    },
    {
        ", a Banach algebra, named after ": null
    },
    {
        "Stefan Banach": "Stefan Banach"
    },
    {
        ", is an ": null
    },
    {
        "associative algebra": "Associative Algebra"
    },
    {
        " A over the ": null
    },
    {
        "real": "Real Number"
    },
    {
        " or ": null
    },
    {
        "complex": "Complex Number"
    },
    {
        " numbers  that at the same time is also a ": null
    },
    {
        "Banach space": "Banach Space"
    },
    {
        ", i.e. a ": null
    },
    {
        "normed space": "Normed Space"
    },
    {
        " and ": null
    },
    {
        "complete": "Complete Metric Space"
    },
    {
        " in the ": null
    },
    {
        "metric": "Metric"
    },
    {
        " induced by the norm. The norm is required to satisfy     :   x, y   A :     y              y      This ensures that the multiplication operation is ": null
    },
    {
        "continuous": "Continuous Function"
    },
    {
        ".     A Banach algebra is called unital if it has an ": null
    },
    {
        "identity element": "Identity Element"
    },
    {
        " for the multiplication whose norm is 1, and commutative if its multiplication is ": null
    },
    {
        "commutative": "Commutative"
    },
    {
        ".   Any Banach algebra A  can be embedded isometrically into a unital Banach algebra Ae so as to form a closed ideal of Ae . Often one assumes a priori that the algebra under consideration is unital: for one can develop much of the theory by considering Ae and then applying the outcome in the original algebra. However, this is not the case all the time. For example, one cannot define all the trigonometric functions in a Banach algebra without identity.     The theory of real Banach algebras can be very different from the theory of complex Banach algebras. For example, the ": null
    },
    {
        "spectrum": "Spectrum"
    },
    {
        " of an element of a nontrivial complex Banach algebra can never be empty, whereas in a real Banach algebra it could be empty for some elements.     Banach algebras can also be defined over fields of ": null
    },
    {
        "p-adic numbers": "P-Adic Number"
    },
    {
        ". This is part of ": null
    },
    {
        "p-adic analysis": "P-Adic Analysis"
    },
    {
        ".       The prototypical example of a Banach algebra is C0 , the space of continuous functions on a locally compact space that vanish at infinity. C0 is unital if and only if X is compact. The complex conjugation being an involution, C0 is in fact a ": null
    },
    {
        "C-algebra": "C-Algebra"
    },
    {
        ". More generally, every C-algebra is a Banach algebra.     The set of real numbers is a Banach algebra with norm given by the ": null
    },
    {
        "absolute value": "Absolute Value"
    },
    {
        ".   The set of all real or complex n-by-n ": null
    },
    {
        "matrices": "Matrix"
    },
    {
        " becomes a ": null
    },
    {
        "unital": "Unital Algebra"
    },
    {
        " Banach algebra if we equip it with a sub-multiplicative ": null
    },
    {
        "matrix norm": "Matrix Norm"
    },
    {
        ".   Take the Banach space R n  with norm ||x x i  .   The ": null
    },
    {
        "quaternions": "Quaternion"
    },
    {
        " form a 4-dimensional real Banach algebra, with the norm being given by the absolute value of quaternions.   The algebra of all bounded real- or complex-valued functions defined on some set  is a unital Banach algebra.   The algebra of all bounded ": null
    },
    {
        "continuous": "Continuous Function"
    },
    {
        " real- or complex-valued functions on some ": null
    },
    {
        "locally compact space": "Locally Compact Space"
    },
    {
        " is a Banach algebra.   The algebra of all ": null
    },
    {
        "continuous": "Continuous Function"
    },
    {
        " linear": "Linear Transformation"
    },
    {
        " operators on a Banach space E  is a unital Banach algebra. The set of all ": null
    },
    {
        "compact operators": "Compact Operator"
    },
    {
        " on E is a Banach algebra and closed ideal. It is without identity if .    If G is a ": null
    },
    {
        "locally compact": "Locally Compact"
    },
    {
        " Hausdorff": "Hausdorff Space"
    },
    {
        " topological group": "Topological Group"
    },
    {
        " and μ is its ": null
    },
    {
        "Haar measure": "Haar Measure"
    },
    {
        ", then the Banach space L 1  of all μ-integrable functions on G becomes a Banach algebra under the ": null
    },
    {
        "convolution": "Convolution"
    },
    {
        " xy ∫ x y dμ for x, y in L 1 .    ": null
    },
    {
        "Uniform algebra": "Uniform Algebra"
    },
    {
        "X .   ": null
    },
    {
        "Natural Banach function algebra": "Uniform Algebra"
    },
    {
        "X.   ": null
    },
    {
        "C-algebra": "C-Algebra"
    },
    {
        "Hilbert space": "Hilbert Space"
    },
    {
        ".   ": null
    },
    {
        "Measure algebra": "Measure Algebra"
    },
    {
        "Radon measures": "Radon Measure"
    },
    {
        " on some ": null
    },
    {
        "locally compact group": "Locally Compact Group"
    },
    {
        ", where the product of two measures is given by ": null
    },
    {
        "convolution of measures": "Convolutionmeasures"
    },
    {
        ".        The algebra of the ": null
    },
    {
        "quaternions": "Quaternion"
    },
    {
        "   is not a complex Banach algebra , for if   A is a complex Banach algebra that is also a ": null
    },
    {
        "division algebra": "Division Algebra"
    },
    {
        ", then   A     , since if       is a point in the non-empty  ": null
    },
    {
        "spectrum": "Spectrum"
    },
    {
        "       of a     A , a -   1 is not invertible, hence a -   1 0 since   A is a division algebra, whence a   1  .       Several ": null
    },
    {
        "elementary functions": "List Of Functions"
    },
    {
        " that are defined via ": null
    },
    {
        "power series": "Power Series"
    },
    {
        " may be defined in any unital Banach algebra; examples include the ": null
    },
    {
        "exponential function": "Exponential Function"
    },
    {
        " and the ": null
    },
    {
        "trigonometric functions": "Trigonometric Functions"
    },
    {
        ", and more generally any ": null
    },
    {
        "entire function": "Entire Function"
    },
    {
        ".  The formula for the ": null
    },
    {
        "geometric series": "Geometric Series"
    },
    {
        " remains valid in general unital Banach algebras. The ": null
    },
    {
        "binomial theorem": "Binomial Theorem"
    },
    {
        " also holds for two commuting elements of a Banach algebra.     The set of ": null
    },
    {
        "invertible elements": "Invertible Element"
    },
    {
        " in any unital Banach algebra is an ": null
    },
    {
        "open set": "Open Set"
    },
    {
        ", and the inversion operation on this set is continuous, so that it forms a ": null
    },
    {
        "topological group": "Topological Group"
    },
    {
        " under multiplication.      If a Banach algebra has unit 1, then 1 cannot be a ": null
    },
    {
        "commutator": "Commutator"
    },
    {
        "; i.e., xy - yx     & thinsp; for any x, y  ∈  A. This is because xy and yx have the same ": null
    },
    {
        "spectrum": "Spectrum"
    },
    {
        " except possibly 0.     The various algebras of functions given in the examples above have very different properties from standard examples of algebras such as the reals. For example:     Every real Banach algebra that is a ": null
    },
    {
        "division algebra": "Division Algebra"
    },
    {
        " is isomorphic to the reals, the complexes, or the quaternions. Hence, the only complex Banach algebra that is a division algebra is the complexes.    Every unital real Banach algebra with no ": null
    },
    {
        "zero divisors": "Zero Divisor"
    },
    {
        ", and in which every ": null
    },
    {
        "principal ideal": "Principal Ideal"
    },
    {
        " is ": null
    },
    {
        "closed": "Closed Set"
    },
    {
        ", is isomorphic to the reals, the complexes, or the quaternions.   Every commutative real unital ": null
    },
    {
        "Noetherian": "Noetherian Ring"
    },
    {
        " Banach algebra with no zero divisors is isomorphic to the real or complex numbers.   Every commutative real unital Noetherian Banach algebra is finite-dimensional.   Permanently singular elements in Banach algebras are ": null
    },
    {
        "topological divisors of zero": "Topological Divisor Of Zero"
    },
    {
        ", i.e., considering extensions B of Banach algebras A some elements that are singular in the given algebra A have a multiplicative inverse element in a Banach algebra extension B. Topological divisors of zero in A are permanently singular in any Banach extension B of  A.            Unital Banach algebras over the complex field provide a general setting to develop spectral theory. The spectrum of an element x  ∈  A, denoted by   , consists of all those complex ": null
    },
    {
        "scalars": "Scalar"
    },
    {
        " λ such that x   & minus;  λ1 is not invertible in A. The spectrum of any element x is a closed subset of the closed disc in C with radius ||x ": null
    },
    {
        "compact": "Compact Space"
    },
    {
        ". Moreover, the spectrum   of an element x is ": null
    },
    {
        "non-empty": "Non-Empty"
    },
    {
        " and satisfies the ": null
    },
    {
        "spectral radius": "Spectral Radius"
    },
    {
        " formula:     :             Given x   & isin;  A, the ": null
    },
    {
        "holomorphic functional calculus": "Holomorphic Functional Calculus"
    },
    {
        " allows to define ƒ  ∈ A for any function ƒ ": null
    },
    {
        "holomorphic": "Holomorphic Function"
    },
    {
        " in a neighborhood of   Furthermore, the spectral mapping theorem holds:     :   f.      When the Banach algebra A is the algebra L of bounded linear operators on a complex Banach space X & thinsp; , the notion of the spectrum in A coincides with the usual one in ": null
    },
    {
        "operator theory": "Operator Theory"
    },
    {
        ". For ƒ   & isin; C , one sees that:     :         The norm of a normal element x of a C-algebra coincides with its spectral radius. This generalizes an analogous fact for normal operators.     Let A & thinsp; be a complex unital Banach algebra in which every non-zero element x is invertible . For every a   & isin; A, there is λ   & isin; C such that   a   & minus;  λ1 is not invertible  hence a    λ1  : this algebra A is naturally isomorphic to C .       Let A & thinsp; be a unital commutative Banach algebra over C. Since A is then a commutative ring with unit, every non-invertible element of A belongs to some ": null
    },
    {
        "maximal ideal": "Maximal Ideal"
    },
    {
        " of A. Since a maximal ideal   m in A is closed, A /   m is a Banach algebra that is a field, and it follows from the Gelfand–Mazur theorem that there is a bijection between the set of all maximal ideals of A and the set Δ of all nonzero homomorphisms from A & thinsp; to C. The set Δ is called the ": null
    },
    {
        "structure space": "Structure Space"
    },
    {
        " or character space of A, and its members characters.     A character χ is a linear functional on A that is at the same time multiplicative, χ χ χ, and satisfies χ 1. Every character is automatically continuous from A & thinsp; to C, since the kernel of a character is a maximal ideal, which is closed. Moreover, the norm  of a character is one. Equipped with the topology of pointwise convergence on A , the character space, Δ, is a Hausdorff compact space.     For any x ∈ A,     :         where   x is the ": null
    },
    {
        "Gelfand representation": "Gelfand Representation"
    },
    {
        " of x defined as follows:   x is the continuous function from Δ to C given by   x   & thinsp; The spectrum of   x, in the formula above, is the spectrum as element of the algebra C of complex continuous functions on the compact space Δ. Explicitly,     :     .     As an algebra, a unital commutative Banach algebra is ": null
    },
    {
        "semisimple": "Semisimple Algebra"
    },
    {
        "  if and only if its Gelfand representation has trivial kernel. An important example of such an algebra is a commutative C-algebra. In fact, when A is a commutative unital C-algebra, the Gelfand representation is then an isometric -isomorphism between A and C . Proof: Since every element of a commutative C-algebra is normal, the Gelfand representation is isometric; in particular, it is injective and its image is closed. But the image of the Gelfand representation is dense by the ": null
    },
    {
        "Stone–Weierstrass theorem": "Stone–Weierstrass Theorem"
    }
]