[
    {
        "           The Baralong incidents were naval engagements of the ": null
    },
    {
        "First World War": "World War I"
    },
    {
        " in August and September 1915, involving the ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        " decoy vessel  and two German ": null
    },
    {
        "U-boats": "U-Boat"
    },
    {
        ".     Baralong sank , which had been preparing to sink a nearby merchant ship, the Nicosian. About a dozen of the crewmen managed to escape from the sinking submarine, and Lieutenant ": null
    },
    {
        "Godfrey Herbert": "Godfrey Herbert"
    },
    {
        ", commanding officer of Baralong, ordered the surviving sailors to be summarily executed after they boarded the Nicosian. All the survivors of U-27s sinking, including several who had reached the Nicosian, were shot by Baralongs crew. Later, Baralong sank  in an incident which has been described as a ": null
    },
    {
        "war crime": "War Crime"
    },
    {
        ". Coles 1986  Bridgland 1999, pp. 20–55.           After the sinking of  by a German submarine in May 1915, Lieutenant-Commander ": null
    },
    {
        "Godfrey Herbert": "Godfrey Herbert"
    },
    {
        ", commanding officer of Baralong, was visited by two officers of the ": null
    },
    {
        "Admiraltys": "Admiralty"
    },
    {
        " Secret Service branch at the naval base at ": null
    },
    {
        "Queenstown, Ireland": "Cobh"
    },
    {
        ". He was told, This Lusitania business is shocking. Unofficially, we are telling you... take no prisoners from U-boats. Bridgland 1999, p. 21.     Interviews with his subordinate officers have established Herberts undisciplined manner of commanding his ship. Herbert allowed his men to engage in drunken binges during shore leave. During one such incident, at ": null
    },
    {
        "Dartmouth": "Dartmouth, Devon"
    },
    {
        ", several members of Baralongs crew were arrested after destroying a local saloon. Herbert paid their bail, then left port with the indicted crewmen aboard. Beginning in April 1915, Herbert ordered his subordinates to cease calling him Sir , and to address him only by the ": null
    },
    {
        "pseudonym": "Pseudonym"
    },
    {
        " Captain William McBride . Messimer 2002, p. 23.     Throughout the summer of 1915, Baralong continued routine patrol duties in the ": null
    },
    {
        "Irish Sea": "Irish Sea"
    },
    {
        " without encountering the enemy.     On 19 August 1915,  sank the ": null
    },
    {
        "White Star Line": "White Star Line"
    },
    {
        "r  with the loss of 44 lives – this included three Americans and led to a diplomatic incident between Germany and the United States. HMS Baralong had been about  from the scene, and had received a distress call from the ship. Baralongs crew was infuriated by the attack and by their inability to locate survivors.     Meanwhile, about  south of Queenstown, , commanded by  Kapitänleutnant  Bernd Wegener, stopped the British steamer Nicosian in accordance with the rules laid down by the ": null
    },
    {
        "London Declaration": "London Declaration Concerning The Laws Of Naval War"
    },
    {
        ". A boarding party of six men from U-27 discovered that Nicosian was carrying munitions and 250 American mules earmarked for the ": null
    },
    {
        "British Army": "British Army"
    },
    {
        " in France. The Germans allowed the freighters crew and passengers to board lifeboats, and prepared to sink the freighter with the U-boats deck gun.     U-27 was lying off Nicosians port quarter and firing into it when Baralong appeared on the scene, flying the ensign of the United States as a ": null
    },
    {
        "false flag": "False Flag"
    },
    {
        ". When she was half a mile away, Baralong ran up a signal flag indicating that she was going to rescue Nicosians crew. Wegener acknowledged the signal, then ordered his men to cease firing, and took U-27 along the port side of Nicosian to intercept Baralong. As the submarine disappeared behind the steamship, Herbert steered Baralong on a parallel course along Nicosians starboard side. Messimer 2002, pp. 46–47.          Before U-27 came round Nicosians bow, Baralong hauled down the American flag, hoisted the Royal Navys ": null
    },
    {
        "White Ensign": "White Ensign"
    },
    {
        ", and unmasked her guns. As U-27 came into view from behind Nicosian, Baralong opened fire with her three ": null
    },
    {
        "12-pounder guns": "Qf 12 Pounder 12 Cwt Naval Gun"
    },
    {
        " at a range of , firing 34 rounds for only a single shot from the submarine. U-27 rolled over and began to sink. ONeill 2006, p. 9.     According to Tony Bridgland; Herbert screamed, Cease fire! But his mens blood was up. They were avenging the Arabic and the Lusitania. For them this was no time to cease firing, even as the survivors of the crew appeared on the outer casing, struggling out of their clothes to swim away from her. There was a mighty hiss of compressed air from her tanks and the U-27 vanished from sight in a vortex of giant rumbling bubbles, leaving a pall of smoke over the spot where she had been. It had taken only a few minutes to fire the thirty-four shells into her. Messimer 2002, pp. 29–30.     Meanwhile, Nicosians crew were cheering wildly from the lifeboats. Captain Manning was heard to yell, If any of those bastard ": null
    },
    {
        "Huns": "List Of Terms Used For Germanshun"
    },
    {
        " come up, lads, hit em with an oar! Messimer 2002, p. 30.     Twelve men survived the sinking of the submarine: the crews of her two deck guns and those who had been on the conning tower. They swam to Nicosian and attempted to join the six-man boarding party by climbing up her hanging lifeboat falls and pilot ladder. Herbert, worried that they might try to scuttle the steamer, ordered his men to open fire with small arms, killing all in the water. Gibson & Prendergast, p. 53. Grant 2002, p. 27. Halpern 1994, p. 301. Wegener is described by some accounts as being shot while trying to swim to the Baralong.     Herbert sent Baralongs 12 ": null
    },
    {
        "Royal Marines": "Royal Marines"
    },
    {
        ", under the command of a Corporal Collins, to find the surviving German sailors aboard Nicosian. As they departed, Herbert told Collins, Take no prisoners. Messimer 2002, p. 42. The Germans were discovered in the engine room and shot on sight. According to Sub-Lieutenant ": null
    },
    {
        "Gordon Charles Steele": "Gordon Charles Steele"
    },
    {
        "Lusitania, you bastard! An alternative account says that the Germans who boarded Nicosian were killed by the freighters engine room staff; this report apparently came from the officer in command of the muleteers. McGill & Norris 2007, pp. 320–321.       In Herberts report to the Admiralty, he stated he feared the survivors from the U-boats crew would board the freighter and scuttle her, so he ordered the Royal Marines on his ship to shoot the survivors. If they had scuttled the freighter, it could have been counted as negligence on the part of Herbert. Moments before Baralong began her attack, the submarine was firing on the freighter. It is not known if the escaping sailors actually intended to scuttle the freighter.     The Admiralty, upon receiving Herberts report, immediately ordered its suppression, but the strict censorship imposed on the event failed when Americans who had witnessed the incident from Nicosians lifeboats spoke to newspaper reporters after their return to the United States.       The German government delivered a memorandum on the incident via the American ambassador in Berlin, who received it on 6 December 1915. In it, they cited six US citizens as witnesses, stating they had made sworn depositions regarding the incident before ": null
    },
    {
        "notaries public": "Notary Public"
    },
    {
        " in the US.     The statements said that five survivors from U-27 managed to board Nicosian, while the rest were shot and killed on Herberts orders while clinging to the merchant vessels lifeboat falls. It was further stated that when Herbert ordered his Marines to board Nicosian, he gave the order take no prisoners . Four German sailors were found in Nicosians engine room and propeller shaft tunnel, and were killed. According to the witness statements, U-27s commander was shot while swimming towards Baralong.      The memorandum demanded that the captain and crew of Baralong be tried for the murder of unarmed German sailors, threatening to take the serious decision of retribution for an unpunished crime .  ": null
    },
    {
        "Sir Edward Grey": "Edward Grey, 1St Viscount Grey Of Fallodon"
    },
    {
        " replied through the American ambassador that the incident could be grouped together with the Germans sinking of SS Arabic, their attack on a stranded British submarine on the neutral Dutch coast, and their attack on the steamship Ruel, and suggested that they be placed before a tribunal composed of US Navy officers. Hesperides 2007, pp. 58–59.       A debate took place in the ": null
    },
    {
        "Reichstag": "Reichstag Building"
    },
    {
        " on 15 January 1916, where the incident was described as a cowardly murder and Greys note as being full of insolence and arrogance . It was announced that reprisals had been decided, but not what form they would take.     Meanwhile, the Military Bureau for the Investigation of Violations of the Laws of War  added Baralongs commander, whose name was known only as Captain William McBride , to the Prussian Ministry of Wars Black List of Englishmen who are Guilty of Violations of the Laws of War vis-à-vis Members of the German Armed Forces . Alfred M. de Zayas, The Wehrmacht War Crimes Bureau 1939–1945, p 8.     HMS Baralongs actions led the  Kaiserliche Marine  to cease adhering to the ": null
    },
    {
        "Prize Rules": "Prize Rules"
    },
    {
        " and to practise ": null
    },
    {
        "unrestricted submarine warfare": "Unrestricted Submarine Warfare"
    },
    {
        ". During the Second World War, it was cited as a reason for the  Kriegsmarine  to do the same. A German medal was issued commemorating the event.      As a precaution to protect the ships against any reprisals against their crews, HMS Wyandra was transferred to the Mediterranean, and took the name of sister ship Manica, while Baralongs name was deleted from ": null
    },
    {
        "Lloyds Register": "Lloyds Register"
    },
    {
        ". Nicosian was renamed Nevisian, and the crew was issued new Discharge Books, with the voyage omitted. ONeill 2006, p. 10.     Baralongs crew were later awarded ": null
    },
    {
        "£": "Pound Sterling"
    },
    {
        "185 prize bounty for sinking U-27. Chatterton 1980, p. 26.           On 24 September 1915, Baralong sank the U-boat , for which her commanding officer at the time, Lieutenant-Commander A. Wilmot-Smith, was later awarded £170 prize bounty.     U-41 was in the process of sinking SS Urbino with gunfire when Baralong arrived on the scene, flying an American flag. When U-41 surfaced near Baralong, the latter opened fire while continuing to fly the American flag, and sank the U-boat.       Unlike the neutral Americans in the first incident, the only witnesses to the second attack were the German and British sailors present.  Oberleutnant zur See  Iwan Crompton, after returning to Germany from a prisoner-of-war camp, reported that Baralong had run down the lifeboat he was in; he leapt clear and was shortly after taken aboard Baralong. The British crew denied that they had run down the lifeboat. Messimer 2002, pp. 61–62. Crompton later published an account of U-41s exploits in 1917, U-41: der zweite Baralong-Fall, which called the sinking of U-41 a second Baralong case . Hadley 1995, p. 36.     The event was also commemorated in a propaganda medal designed by the German engraver Karl Goetz. This was one of many medals that were popular in Germany from around 1910 to 1940. ": null
    }
]