[
    {
        "           The Basenji is a ": null
    },
    {
        "breed": "Dog Breed"
    },
    {
        " of ": null
    },
    {
        "hunting dog": "Hunting Dog"
    },
    {
        ". It was bred from stock that originated in central ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ". Most of the major ": null
    },
    {
        "kennel clubs": "Kennel Club"
    },
    {
        "in the ": null
    },
    {
        "English": "English Language"
    },
    {
        "-speaking world place the breed in the ": null
    },
    {
        "hound group": "Hound Group"
    },
    {
        "—more specifically, in the ": null
    },
    {
        "sighthound": "Sighthound"
    },
    {
        " type": "Dog Type"
    },
    {
        ". The ": null
    },
    {
        "Fédération Cynologique Internationale": "Fédération Cynologique Internationale"
    },
    {
        " places the breed in its group five , and the United Kennel Club places the breed in its ": null
    },
    {
        "Sighthound and pariah group": "Sighthound And Pariah Group"
    },
    {
        ".     The Basenji produces an unusual ": null
    },
    {
        "yodel": "Yodelling"
    },
    {
        "-like sound , due to its unusually shaped ": null
    },
    {
        "larynx": "Larynx"
    },
    {
        ". Adapted from the book Why Pandas Do Handstands, 2006, by Augustus Brown. This trait also gives the Basenji the nickname barkless dog .      Basenjis share many unique traits with ": null
    },
    {
        "pariah dog": "Pariah Dog"
    },
    {
        " types. Basenjis, like ": null
    },
    {
        "dingoes": "Dingoes"
    },
    {
        ", ": null
    },
    {
        "New Guinea singing dogs": "New Guinea Singing Dog"
    },
    {
        "and some other breeds of dog, come into ": null
    },
    {
        "estrus": "Estrus"
    },
    {
        " only once annually—as compared to other dog breeds, which may have two or more breeding seasons every year. Both dingoes and Basenji lack a distinctive odor,   and are prone to howls, yodels, and other vocalizations over the characteristic bark of modern dog breeds. One theory holds that the latter trait is the result of selecting against dogs that frequently bark—in the traditional Central African context—because barking could lead enemies to humans forest encampments. While dogs that resemble the Basenji in some respects are commonplace over much of Africa, the breeds original foundation stock came from the old growth forest regions of the ": null
    },
    {
        "Congo Basin": "Congo Basin"
    },
    {
        ", where its structure and type were fixed by adaptation to its habitat, as well as use .     The name comes from the ": null
    },
    {
        "Lingala": "Lingala"
    },
    {
        " language of the Congo,  which means villager dogs.       The Basenji has been identified as a ": null
    },
    {
        "basal breed": "Dog Breedbasal Breeds"
    },
    {
        " that predates the emergence of the modern breeds in the 19th century.  Recent DNA studies based on ": null
    },
    {
        "whole-genome sequences": "Whole Genome Sequencing"
    },
    {
        " indicate that the domestic dog is a ": null
    },
    {
        "genetically divergent": "Genetic Divergence"
    },
    {
        " subspecies of the gray wolf and was derived from a now-extinct ": null
    },
    {
        "ghost population": "Ghost Population"
    },
    {
        " of Late Pleistocene wolves, and the basenji and the dingo are both considered to be ": null
    },
    {
        "basal": "Basal"
    },
    {
        " members of the domestic dog clade.    The term basal refers to a lineage that diverges early in the history of the group...and lies on a branch that originates near the common ancestor of the group.        The ": null
    },
    {
        "Azande": "Azande"
    },
    {
        " and ": null
    },
    {
        "Mangbetu people": "Mangbetu People"
    },
    {
        " from the northeastern Congo region describe Basenjis, in the local ": null
    },
    {
        "Lingala": "Lingala"
    },
    {
        " language, as . Translated, this means dogs of the savages, or dogs of the villagers. In the Congo, the Basenji is also known as dog of the bush . The dogs are also known to the Azande of southern Sudan as .  The word  itself is the plural form of . In ": null
    },
    {
        "Swahili": "Swahili Language"
    },
    {
        ", another ": null
    },
    {
        "Bantu language": "Bantu Languages"
    },
    {
        ", from East Africa,  translates to wild dog. Another local name is m’bwa m’kube m’bwa wamwitu, or dog that jumps up and down,  a reference to their tendency to jump straight up to spot their quarry.            Originating on the continent of ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ", . Basenji Club Of America. Course 101 Owners Guide basenji-like dogs  are depicted in drawings and models dating back to the ": null
    },
    {
        "Twelfth Dynasty of Egypt": "Twelfth Dynasty Of Egypt"
    },
    {
        ". Dogs of this type were originally kept for hunting small game by tracking and driving the game into nets.      Europeans first described the type of dog the Basenji breed derives from in 1895—in the ": null
    },
    {
        "Congo": "Democratic Republic Of The Congo"
    },
    {
        ". These local dogs, which Europeans identified as a unique breed and called basenji, were prized by locals for their intelligence, courage, speed, and silence. An article published called The Intelligence of Dogs by Stanley Coren, Ph.D. questions this. It ranks the breed at 78 out of 79, which is the second to lowest rank in intelligence. Some consider this an unreliable list, as it focuses on only the ability to listen to a first command. Some consider independent dogs such as Basenjis and Afghan Hounds more intelligent than obedient breeds because of their ability to recognize which actions benefit them, and which simply please another. . Basenji Club Of America. Course 101 Owners Guide     Several attempts were made to bring the breed to ": null
    },
    {
        "England": "England"
    },
    {
        ", but the earliest imports succumbed to disease. In 1923, for example, Lady Helen Nutting brought six Basenjis with her from ": null
    },
    {
        "Sudan": "Sudan"
    },
    {
        ", but all six died from ": null
    },
    {
        "distemper": "Canine Distemper"
    },
    {
        " shots they received in ": null
    },
    {
        "quarantine": "Quarantine"
    },
    {
        ".  It was not until the 1930s that foundation stock was successfully established in England, and then to the ": null
    },
    {
        "United States": "United States"
    },
    {
        " by animal importer ": null
    },
    {
        "Henry Trefflich": "Henry Trefflich"
    },
    {
        ". It is likely that nearly all the Basenjis in the Western world are descended from these few original imports.  The breed was officially accepted into the AKC in 1943. In 1990, the AKC stud book was reopened to 14 new imports at the request of the Basenji Club of America.  The stud book was reopened again to selected imported dogs from 1 January 2009 to 31 December 2013.  An American-led expedition collected breeding stock in villages in the ": null
    },
    {
        "Basankusu": "Basankusu"
    },
    {
        " area of the ": null
    },
    {
        "Democratic Republic of Congo": "Democratic Republic Of Congo"
    },
    {
        ", in 2010.  Basenjis are also registered with the ": null
    },
    {
        "United Kennel Club": "United Kennel Club"
    },
    {
        ".     The popularity of the Basenji in the United States, according to the American Kennel Club, has declined over the past decade, with the breed ranked 71st in 1999, decreasing to 84th in 2006, and to 93rd in 2011.                                Basenjis are small, short-haired dogs with erect ears, tightly curled tails and graceful necks. A Basenjis forehead is wrinkled, even more so when they are young or extremely excited. A Basenjis eyes are typically almond-shaped. Basenjis typically weigh about   and stand   at the shoulder. They are a square breed, which means they are as long as they are tall with males usually larger than females. Basenjis are athletic dogs, and deceptively powerful for their size. They have a graceful, confident gait like a trotting horse, and skim the ground in a double suspension gallop, with their characteristic curled tail straightened out for greater balance when running at their top speed. Basenjis come in a few different colorations: red, black, tricolor, and brindle, and they all have white feet, chests and tail tips. They can also come in trindle, which is a tricolor with brindle points, a rare combination.         The Basenji is alert, energetic, curious and reserved with strangers. The Basenji tends to become emotionally attached to a single human. Basenjis may not get along with non-canine pets. Basenjis dislike wet weather, much like cats, and will often refuse to go outside in any sort of damp conditions. They like to climb, and can easily scale chain wire/link fences.     Basenjis often stand on their hind legs, somewhat like a ": null
    },
    {
        "meerkat": "Meerkat"
    },
    {
        ", by themselves or leaning on something; this behavior is often observed when the dog is curious about something. Basenjis have a strong prey drive. According to the book  The Intelligence of Dogs , they are the second least trainable dog, when required to do human commands. Their real intelligence manifests, when they are required to actually think .     Basenjis are highly prey driven and will go after cats and other small animals.       There is only one completed health survey of dog breeds, including the Basenji, that was conducted by the UK Kennel Club in 2004. The survey indicated the prevalence of diseases in Basenjis with dermatitis , incontinence and bladder infection , hypothyroidism , ": null
    },
    {
        "Pyometra": "Pyometra"
    },
    {
        " and infertility . Kennel Club/British Small Animal Veterinary Association Scientific Committee. 2004. . Retrieved 5 July 2007       Basenjis in the 2004 UK Kennel Club survey had a median lifespan of 13.6 years , which is 1–2 years longer than the median lifespan of other breeds of similar size.  The oldest dog in the survey was 17.5 years. The most common causes of death were old age , ": null
    },
    {
        "urologic": "Urologic"
    },
    {
        " , behavior , and cancer .         ": null
    },
    {
        "Fanconi syndrome": "Fanconi Syndrome"
    },
    {
        ", an inheritable disorder in which the renal tubes fail to reabsorb ": null
    },
    {
        "electrolytes": "Electrolyte"
    },
    {
        "and nutrients,  is unusually common in Basenjis.  Symptoms include excessive drinking, excessive urination, and glucose in the urine, which may lead to a misdiagnosis of diabetes. Fanconi syndrome usually presents between 4 and 8 years of age, but sometimes as early as 3 years or as late as 10 years. Fanconi syndrome is treatable and organ damage is reduced if treatment begins early. Basenji owners are advised to test their dogs urine for glucose once a month beginning at the age of 3 years. Glucose testing strips designed for human diabetics are inexpensive and available at most pharmacies. A Fanconi disease management protocol has been developed that can be used by veterinarians to treat Fanconi-afflicted dogs.           In 2007, the first ": null
    },
    {
        "linked marker": "Genetic Linkage"
    },
    {
        " DNA test was released for predicting Fanconi syndrome in Basenjis.  With this test, it is possible to more accurately determine the probability of a dogs carrying the gene for Fanconi syndrome.     Dogs tested using this linkage test return one of the following statuses:   :Probably clear/normal   ::Indicates the individual has most likely inherited normal DNA from both parents. It is unlikely that Basenjis that test this way will produce affected puppies, no matter which dog they breed with.   :Probably carrier   ::Indicates the individual has most likely inherited normal DNA from one parent and DNA with the Fanconi syndrome mutation from the other parent. This basenji is unlikely to develop Fanconi syndrome, but could produce puppies that do. To minimize the chances of this happening, it is recommended carriers be bred only to those that test as Probably clear/Normal for Fanconi syndrome.   :Probably equivocal/indeterminate   ::Indicates the individuals DNA contained features found in both normal and carrier Basenjis. At present it cannot be predicted whether these Basenjis are carriers or normal; however, it is unlikely that they will develop Fanconi syndrome. The safest strategy would be to treat them as “carriers” and bred to only those Basenjis that test as Probably Clear/Normal for Fanconi syndrome.   :Probably affected   ::Indicates the individual is likely to develop clinical Fanconi syndrome and is likely to produce puppies with Fanconi syndrome if bred to Basenjis other than those that test as Probably Clear/Normal for Fanconi syndrome.     This linkage test is being provided as a tool to assist breeders whilst research continues towards the development of the direct Fanconi test.         Basenjis sometimes carry a simple recessive gene that, when ": null
    },
    {
        "homozygous": "Homozygous"
    },
    {
        " for the defect, causes ": null
    },
    {
        "genetic hemolytic anemia": "Hemolysis"
    },
    {
        ".  Most 21st-century Basenjis are descended from ancestors that have tested clean. When lineage from a fully tested line cannot be completely verified, the dog should be tested before breeding. As this is a non-invasive DNA test, a Basenji can be tested for HA at any time.     Basenjis sometimes suffer from ": null
    },
    {
        "hip dysplasia": "Hip Dysplasia"
    },
    {
        ", resulting in loss of mobility and arthritis-like symptoms. All dogs should be tested by either ": null
    },
    {
        "OFA": "Orthopedic Foundation For Animals"
    },
    {
        " or ": null
    },
    {
        "PennHIP": "Pennhip"
    },
    {
        " prior to breeding.     ": null
    },
    {
        "Malabsorption": "Malabsorption"
    },
    {
        ", or immunoproliferative enteropathy, is an autoimmune intestinal disease that leads to ": null
    },
    {
        "anorexia": "Anorexia"
    },
    {
        ", chronic ": null
    },
    {
        "diarrhea": "Diarrhea"
    },
    {
        ", and even death. A special diet can improve the quality of life for afflicted dogs.     The breed can also fall victim to ": null
    },
    {
        "progressive retinal atrophy": "Progressive Retinal Atrophy"
    },
    {
        " and several less serious hereditary eye problems such as ": null
    },
    {
        "coloboma": "Coloboma"
    },
    {
        " , and ": null
    },
    {
        "persistent pupillary membrane": "Persistent Pupillary Membrane"
    },
    {
        "  Good-bye, My Lady , by ": null
    },
    {
        "James H. Street": "James H. Street"
    },
    {
        ", is a Basenji . The book was made into a ": null
    },
    {
        "film of the same name": "Good-Bye, My Lady"
    },
    {
        " in 1956, with a cast that included ": null
    },
    {
        "Brandon deWilde": "Brandon Dewilde"
    },
    {
        ", ": null
    },
    {
        "Walter Brennan": "Walter Brennan"
    },
    {
        ", and ": null
    },
    {
        "Sidney Poitier": "Sidney Poitier"
    },
    {
        ".  Several Basenjis were used in the lead role, the main star being My Lady Of The Congo a six month old Basenji bred by Veronica Tudor-Williams of Molesey, England. She was followed by four other young Basenjis to act as doubles including her sibling, “My Lord of the Congo,” and “Flageolet of the Congo,” . “My Lady” did most of the scenes.    The true story of a Basenji was featured in the episode The Cat Came Back on the radio program  This American Life .    According to the ": null
    },
    {
        "webcomic": "Webcomic"
    },
    {
        "  Achewood , if ": null
    },
    {
        "Jesus Christ": "Jesus Christ"
    },
    {
        " were a dog, he would be a Basenji.    Basenjis are featured in the fourth episode, Tyler Tucker, I Presume? , of the third season of the animated television series  The Wild Thornberrys . ": null
    },
    {
        "Nigel Thornberry": "List Of The Wild Thornberrys Characters"
    },
    {
        " encounters a group of tribesmen along with their ": null
    },
    {
        "Congolese": "Democratic Republic Of The Congo"
    },
    {
        " hunting dogs. The seriess director, ": null
    },
    {
        "Mark Risley": "Mark Risley"
    },
    {
        ", owns several Basenjis, and his dogs provided the recorded voices for their animated counterparts.   An episode of  Pound Puppies , The Pups Who Loved Me , revolves around a Basenji secret agent character by the name of Bondo. The dog is drawn with an appropriate likeness, but appears to bark, which is uncharacteristic of the breed.   Basenjis are featured in the first part of  The Apu Trilogy  .   A Basenji dog is one of the main protagonists of the novel August Magic by Veronica Anne Starbuck.   Anubis, the barkless dog, is a Basenji dog featured in a horror movie  Soulmate  and  Tales Of Halloween .   Yodels, Wails and Basenji Tails - the 1998 book that features a compilation of Basenji stories.   The Story Of Tongdaeng by His Majesty King Bhumibol Adulyadej of Thailand features one of his pets ": null
    },
    {
        "Tongdaeng": "Tongdaeng"
    },
    {
        ", the Basenji dog.     Ace Ventura: Pet Detective . New release of this film on video includes footage of a black and white Basenji, which was cut from the original release. This Basenji has also been featured on Australias video cover.    The African Queen  features a Basenji sitting on the lap of the native in the church scene at the beginning of the film.    Ring of Fire: An Indonesian Odyssey  features a Basenji.   Mystic Fire Video contains the Borneo Basenji.    The Magic of Lassie  - Basenji is seen during one of the scenes in the cab of an 18-wheeler in the parking lot.    The Constant Gardener  features a Basenji puppy in the village, held by a child on a rope leash.    So Quiet on the Canine Front  and Trader Hound, movie shorts of the  Dogville Comedies  series, contain trained dogs as actors, two of which are Basenjis.    Air Bud: World Pup  - two Basenjis of different colors are seen running with the pack of dogs and chasing two crooks at the end of the film.   A Basenji is carried on ": null
    },
    {
        "Matthew Barneys": "Matthew Barney"
    },
    {
        "head, in depiction of the Egyptian god of the dead Anubis, in his 2007 performance Guardian of the Veil. ": null
    }
]