[
    {
        "           Batman Forever is a 1995 American ": null
    },
    {
        "superhero film": "Superhero Film"
    },
    {
        " directed by ": null
    },
    {
        "Joel Schumacher": "Joel Schumacher"
    },
    {
        " and produced by ": null
    },
    {
        "Tim Burton": "Tim Burton"
    },
    {
        ", based on the ": null
    },
    {
        "DC Comics": "Dc Comics"
    },
    {
        " character ": null
    },
    {
        "Batman": "Batman"
    },
    {
        ". A sequel to the 1992 film  Batman Returns  and the third installment of ": null
    },
    {
        "Warner Bros.s": "Warner Bros."
    },
    {
        " initial Batman film series": "Batman"
    },
    {
        ", it stars ": null
    },
    {
        "Val Kilmer": "Val Kilmer"
    },
    {
        " replacing ": null
    },
    {
        "Michael Keaton": "Michael Keaton"
    },
    {
        " as Bruce Wayne and Batman, alongside ": null
    },
    {
        "Tommy Lee Jones": "Tommy Lee Jones"
    },
    {
        ", ": null
    },
    {
        "Jim Carrey": "Jim Carrey"
    },
    {
        ", ": null
    },
    {
        "Nicole Kidman": "Nicole Kidman"
    },
    {
        ", ": null
    },
    {
        "Chris ODonnell": "Chris Odonnell"
    },
    {
        ", ": null
    },
    {
        "Michael Gough": "Michael Gough"
    },
    {
        ", and ": null
    },
    {
        "Pat Hingle": "Pat Hingle"
    },
    {
        ". The plot focuses on Batman trying to stop ": null
    },
    {
        "Two-Face": "Two-Face"
    },
    {
        " and the ": null
    },
    {
        "Riddler": "Riddler"
    },
    {
        " in their villainous scheme to extract confidential information from all the minds in ": null
    },
    {
        "Gotham City": "Gotham City"
    },
    {
        " and use it to learn Batmans identity and bring the city under their control. In the process, he gains allegiance from a young, orphaned circus acrobat named ": null
    },
    {
        "Dick Grayson": "Dick Grayson"
    },
    {
        ", who becomes his sidekick ": null
    },
    {
        "Robin": "Robin"
    },
    {
        ", and meets and develops feelings for psychiatrist ": null
    },
    {
        "Dr. Chase Meridian": "List Of Batman Supporting Characters"
    },
    {
        ", which brings him to the point to decide if he will lead a normal life or if he is destined to fight crime as Batman forever.     Batman Forevers tone is significantly different from the previous installments, becoming more family-friendly since ": null
    },
    {
        "Warner Bros.": "Warner Bros."
    },
    {
        " believed that Batman Returns failed to outgross its predecessor due to parent complaints about the films violence and dark overtones. Schumacher eschewed the dark, dystopian atmosphere of Burtons films by drawing inspiration from the Batman comic books of the ": null
    },
    {
        "Dick Sprang": "Dick Sprang"
    },
    {
        " era, as well as the ": null
    },
    {
        "1960s television series": "Batman"
    },
    {
        ". After Keaton chose not to reprise his role, ": null
    },
    {
        "William Baldwin": "William Baldwin"
    },
    {
        " and ": null
    },
    {
        "Ethan Hawke": "Ethan Hawke"
    },
    {
        " were considered as a replacement before Val Kilmer joined the cast.     The film was released on June 16, 1995, receiving mixed reviews, but was a financial success. Batman Forever grossed over $336 million worldwide and became the sixth-highest-grossing film worldwide of 1995. The film was followed by  Batman & Robin  in 1997, with Schumacher returning as the director, Chris ODonnell returning as Robin, and ": null
    },
    {
        "George Clooney": "George Clooney"
    },
    {
        " replacing Kilmer as Batman.         In ": null
    },
    {
        "Gotham City": "Gotham City"
    },
    {
        ", the crime fighter ": null
    },
    {
        "Batman": "Batman"
    },
    {
        " defuses a hostage situation caused by a criminal known as ": null
    },
    {
        "Two-Face": "Two-Face"
    },
    {
        ", the alter ego of the former ": null
    },
    {
        "district attorney": "District Attorney"
    },
    {
        " Harvey Dent, but Two-Face escapes and remains at large. Edward Nygma, a researcher at ": null
    },
    {
        "Wayne Enterprises": "Wayne Enterprises"
    },
    {
        " who idolizes Bruce Wayne, has developed a device that can beam television into a persons brain. Bruce offers to let Nygma come up with schematics for the device and set up a meeting with his assistant. However, after Nygma demands an answer from him immediately, Bruce rejects the invention, believing it to be too close to mind manipulation. After killing his supervisor and staging it as a ": null
    },
    {
        "suicide": "Suicide"
    },
    {
        ", Nygma resigns and begins sending Bruce riddles, seeking retaliation against him.     Bruce meets Chase Meridian, a psychiatrist who is obsessed with Batman, and invites her to come with him to a circus event. After a performance from the circus performers, The Flying Graysons, Two-Face arrives and threatens to blow up the circus unless Batman comes forward and surrenders his life to him. The Flying Graysons attempt to stop Two-Face, but most of them get killed as a result. Only Dick Grayson, the youngest member, survives as he climbs to the roof and throws Two-Faces bomb into a river.     Bruce invites the orphaned Dick to stay at ": null
    },
    {
        "Wayne Manor": "Wayne Manor"
    },
    {
        ". Dick, still troubled by the murder of his family, intends to kill Two-Face and avenge his family. When he discovers that Bruce is Batman, he demands that Bruce help him find Two-Face so that he can kill him, but Bruce refuses. Meanwhile, Nygma, inspired and delighted by watching Two-Faces raid at the circus, turns himself into a criminal called the ": null
    },
    {
        "Riddler": "Riddler"
    },
    {
        " and forms an alliance with Two-Face. The two steal capital in order to mass-produce Nygmas brainwave device so that Riddler can use it to steal all of Gothams confidential information, promising Two-Face Batmans secret identity in return. Nygma founds his own company, Nygmatech.     At Nygmas business party, Nygma discovers Bruces alter ego using the brainwave device. Two-Face arrives and crashes the party. He nearly kills Batman, but Dick manages to save him. Meanwhile, Chase has fallen in love with Bruce, which surpasses her obsession with Batman. Bruce decides to stop being Batman in order to have a normal life with Chase, and to prevent Dick from murdering Two-Face. Dick runs away while Bruce and Chase have dinner together in the manor, where Bruce reveals his secret identity to her. The Riddler and Two-Face arrive and attack Wayne Manor; in the process, the Riddler blows up the ": null
    },
    {
        "Batcave": "Batcave"
    },
    {
        ". The criminals kidnap Chase after Two-Face shoots Bruce, and the Riddler leaves him another riddle.     Using the riddles, Bruce and his butler, ": null
    },
    {
        "Alfred": "Alfred Pennyworth"
    },
    {
        ", deduce the Riddlers secret identity. Chase is imprisoned by the Riddler and Two-Face in their hideout. Bruce puts on a new Batman costume. Dick returns and becomes Batmans sidekick, ": null
    },
    {
        "Robin": "Robin"
    },
    {
        ". Batman and Robin head to Riddler and Two-Faces lair, Claw Island, where they are separated. Robin encounters Two-Face and nearly kills him, but chooses to spare his life and is captured. The Riddler, revealing Chase and Robin bound and gagged with duct tape in containment tubes, gives Batman a chance to save only one hostage, but Batman destroys the Riddlers brainwave collecting device with a Batarang, causing the Riddler to suffer a mental breakdown and allowing Batman to rescue Robin and Chase. Two-Face corners the trio and determines their fate with the flip of a coin, but Batman throws a handful of identical coins in the air, causing Two-Face to stumble and fall to his death, as Robin watches.     The Riddler is taken to ": null
    },
    {
        "Arkham Asylum": "Arkham Asylum"
    },
    {
        " and imprisoned, but he claims he knows who Batman is. Chase is asked to consult on the case, but Nygma says that he himself is Batman, due to his damaged memories. Chase meets Bruce outside and tells him that his secret is safe before parting ways. Bruce resumes his crusade as Batman with Robin as his partner to protect Gotham from crime.       ": null
    },
    {
        "Val Kilmer": "Val Kilmer"
    },
    {
        " as ": null
    },
    {
        "Bruce Wayne / Batman": "Batman"
    },
    {
        "Tommy Lee Jones": "Tommy Lee Jones"
    },
    {
        " as ": null
    },
    {
        "Harvey Dent / Two-Face": "Two-Face"
    },
    {
        "district attorney": "District Attorney"
    },
    {
        " of ": null
    },
    {
        "Gotham City": "Gotham City"
    },
    {
        ". Half of Harveys face is scarred with acid during the conviction of a ": null
    },
    {
        "crime boss": "Sal Maroni"
    },
    {
        ". Driven insane, he becomes the criminal Two-Face.   ": null
    },
    {
        "Jim Carrey": "Jim Carrey"
    },
    {
        " as ": null
    },
    {
        "Edward Nygma / The Riddler": "Riddler"
    },
    {
        "Wayne Enterprises": "Wayne Enterprises"
    },
    {
        " employee, Edward resigns after his newest invention is personally rejected by Bruce Wayne. He becomes the villainous Riddler, leaving riddles and puzzles at scenes of crime.   ": null
    },
    {
        "Nicole Kidman": "Nicole Kidman"
    },
    {
        " as ": null
    },
    {
        "Dr. Chase Meridian": "Dr. Chase Meridian"
    },
    {
        "damsel in distress": "Damsel In Distress"
    },
    {
        " in the ": null
    },
    {
        "climax": "Climax"
    },
    {
        ".   ": null
    },
    {
        "Chris ODonnell": "Chris Odonnell"
    },
    {
        " as ": null
    },
    {
        "Dick Grayson / Robin": "Dick Grayson"
    },
    {
        "Batcave": "Batcave"
    },
    {
        " and learns Bruces secret identity. In his wake, he becomes the crime fighting partner, Robin.   ": null
    },
    {
        "Michael Gough": "Michael Gough"
    },
    {
        " as ": null
    },
    {
        "Alfred Pennyworth": "Alfred Pennyworth"
    },
    {
        "Pat Hingle": "Pat Hingle"
    },
    {
        " as ": null
    },
    {
        "James Gordon": "James Gordon"
    },
    {
        "Drew Barrymore": "Drew Barrymore"
    },
    {
        " as Sugar: Two-Faces good assistant.   ": null
    },
    {
        "Debi Mazar": "Debi Mazar"
    },
    {
        " as Spice: Two-Faces bad assistant.   ": null
    },
    {
        "Ed Begley Jr.": "Ed Begley Jr."
    },
    {
        " as Fred Stickley: Edward Nygmas ill-tempered supervisor at Wayne Enterprises. After Stickley discovers the true nature of Nygmas invention, Nygma kills him and makes it look like ": null
    },
    {
        "suicide": "Suicide"
    },
    {
        ". Begley was uncredited for this role.   ": null
    },
    {
        "Ofer Samra": "Ofer Samra"
    },
    {
        " as Harveys Thug   Elizabeth Sanders as Gossip Gerty: Gothams top gossip columnist.   ": null
    },
    {
        "René Auberjonois": "René Auberjonois"
    },
    {
        " as Dr. Burton: Head Doctor of ": null
    },
    {
        "Arkham Asylum": "Arkham Asylum"
    },
    {
        ".   ": null
    },
    {
        "Joe Grifasi": "Joe Grifasi"
    },
    {
        " as Hawkins: A bank guard and Two-Faces hostage during the opening scene.               Batman Returns  was released in 1992 with financial success and generally favorable reviews from critics, but Warner Bros. was disappointed with its box office run, having made $150 million less than the first film. For Batman Forever, ": null
    },
    {
        "Tim Burton": "Tim Burton"
    },
    {
        ", the director of the first two Batman films, was asked to restrict himself to the role of producer, with approval of ": null
    },
    {
        "Joel Schumacher": "Joel Schumacher"
    },
    {
        " as director  and the husband-and-wife screenwriting couple Lee and Janet Scott-Batchler, who agreed with him that the key element to Batman is his duality. And its not just that Batman is Bruce Wayne .  Their original script introduced a psychotic Riddler with a pet rat accompanying him. The story elements and much of the dialogue still remained in the finished film, though Schumacher felt it could be lighte down . ": null
    },
    {
        "Michael Keaton": "Michael Keaton"
    },
    {
        " initially approved the selection of Schumacher as director and planned on reprising his role as Batman from the first two films.  Schumacher claims he originally had in mind an adaptation of ": null
    },
    {
        "Frank Millers": "Frank Miller"
    },
    {
        "  Batman: Year One  and Keaton claimed that he was enthusiastic about the idea. Warner Bros. rejected the idea as they wanted a sequel, not a ": null
    },
    {
        "prequel": "Prequel"
    },
    {
        ", though Schumacher was able to include very brief events in Bruce Waynes childhood with some events of the comic  The Dark Knight Returns . ": null
    },
    {
        "Akiva Goldsman": "Akiva Goldsman"
    },
    {
        ", who worked with Schumacher on  The Client , was brought in to rewrite the script. Burton, who was more interested in directing  Ed Wood , later reflected he was taken aback by some of the ": null
    },
    {
        "focus group": "Focus Group"
    },
    {
        " meetings for Batman Forever, a title which he hated. Producer ": null
    },
    {
        "Peter MacGregor-Scott": "Peter Macgregor-Scott"
    },
    {
        " represented the studios aim in making a film for the MTV Generation with full merchandising appeal.     Production went on fast track with ": null
    },
    {
        "Rene Russo": "Rene Russo"
    },
    {
        " cast as ": null
    },
    {
        "Dr. Chase Meridian": "List Of Batman Supporting Characters"
    },
    {
        " but Keaton decided not to reprise Batman because he did not like the new direction the film series was heading in.  Keaton also wanted to pursue more interesting roles ,  turning down $15 million.  A decision was made to go with a younger actor for Bruce Wayne, and an offer was made to ": null
    },
    {
        "Ethan Hawke": "Ethan Hawke"
    },
    {
        ", who turned it down.  Schumacher had seen ": null
    },
    {
        "Val Kilmer": "Val Kilmer"
    },
    {
        " in  Tombstone , but was also interested in ": null
    },
    {
        "Daniel Day-Lewis": "Daniel Day-Lewis"
    },
    {
        ", ": null
    },
    {
        "Ralph Fiennes": "Ralph Fiennes"
    },
    {
        ", ": null
    },
    {
        "William Baldwin": "William Baldwin"
    },
    {
        ", and ": null
    },
    {
        "Johnny Depp": "Johnny Depp"
    },
    {
        ".  Kilmer signed on without reading the script or knowing who the new director was.      With Kilmers casting, Warner Bros. dropped Rene Russo as Chase Meridian. ": null
    },
    {
        "Robin Wright": "Robin Wright"
    },
    {
        ", ": null
    },
    {
        "Jeanne Tripplehorn": "Jeanne Tripplehorn"
    },
    {
        ", and ": null
    },
    {
        "Linda Hamilton": "Linda Hamilton"
    },
    {
        " were all considered for the role, which was eventually recast with ": null
    },
    {
        "Nicole Kidman": "Nicole Kidman"
    },
    {
        ". ": null
    },
    {
        "Billy Dee Williams": "Billy Dee Williams"
    },
    {
        " took on the role of Harvey Dent in  Batman  on the possibility of portraying Two-Face in a sequel, but Schumacher cast ": null
    },
    {
        "Tommy Lee Jones": "Tommy Lee Jones"
    },
    {
        " in the role,  after having worked with him on The Client. Jones was reluctant to accept the role,  but did so after his sons insistence.  ": null
    },
    {
        "Robin Williams": "Robin Williams"
    },
    {
        " was in discussions to be the Riddler at one point.   In a 2003 interview, Schumacher stated ": null
    },
    {
        "Michael Jackson": "Michael Jackson"
    },
    {
        " lobbied hard for the role, but was turned down before ": null
    },
    {
        "Jim Carrey": "Jim Carrey"
    },
    {
        " was cast.  ": null
    },
    {
        "Robin": "Robin"
    },
    {
        " appeared in the ": null
    },
    {
        "shooting script": "Shooting Script"
    },
    {
        " of Batman Returns but was deleted due to too many characters. ": null
    },
    {
        "Marlon Wayans": "Marlon Wayans"
    },
    {
        " had been cast in the role, and signed for a potential sequel, when Schumacher took over, he decided to open up casting to other actors.  ": null
    },
    {
        "Leonardo DiCaprio": "Leonardo Dicaprio"
    },
    {
        " was considered, but decided not to pursue the role after a meeting with Schumacher.  ": null
    },
    {
        "Chris ODonnell": "Chris Odonnell"
    },
    {
        " was cast and ": null
    },
    {
        "Mitchell Gaylord": "Mitch Gaylord"
    },
    {
        " served as his ": null
    },
    {
        "stunt double": "Stunt Double"
    },
    {
        ".  Schumacher attempted to create a cameo role for ": null
    },
    {
        "Bono": "Bono"
    },
    {
        " as his MacPhisto character, but both came to agree it was not suitable for the film.        Filming started in September 1994. Schumacher hired Barbara Ling for production design, claiming that the film needed a force and good design. Ling could advance on it . Schumacher wanted a design that was not to be in any way connected to the previous films, and instead was to be inspired by the images from the Batman comic books seen in the 1940s/early 1950s and taken from that of New York City architecture in the 1930s, with a combination of modern Tokyo. He also wanted a city with personality , with more statues, as well as various amounts of ": null
    },
    {
        "neon": "Neon"
    },
    {
        ".     Schumacher had problems filming with Kilmer, whom he described as childish and impossible , reporting that he fought with various crewmen, and refused to speak to Schumacher during two weeks after the director told him to stop behaving in a rude way.  Schumacher also mentioned Tommy Lee Jones as a source of trouble: Jim Carrey was a gentleman, and Tommy Lee was threatened by him. Im tired of defending overpaid, overprivileged actors. I pray I dont work with them again.  Carrey later acknowledged Jones was not friendly to him, telling him once off-set during the production, I hate you. I really dont like you ... I cannot sanction your buffoonery.          ": null
    },
    {
        "Rick Baker": "Rick Baker"
    },
    {
        " designed the ": null
    },
    {
        "prosthetic makeup": "Prosthetic Makeup"
    },
    {
        ". ": null
    },
    {
        "John Dykstra": "John Dykstra"
    },
    {
        ", ": null
    },
    {
        "Andrew Adamson": "Andrew Adamson"
    },
    {
        ", and ": null
    },
    {
        "Jim Rygiel": "Jim Rygiel"
    },
    {
        " served as ": null
    },
    {
        "visual effects supervisor": "Visual Effects Supervisor"
    },
    {
        "s, with ": null
    },
    {
        "Pacific Data Images": "Pacific Data Images"
    },
    {
        " also contributing to visual effects work. PDI provided a computer-generated Batman for complicated stunts.  For the costume design, producer Peter MacGregor-Scott claimed that 146 workers were at one point working together. Batmans costume was redesigned along the lines of a more MTV organic, and edgier feel to the suit.  Sound editing and mixing was supervised by ": null
    },
    {
        "Bruce Stambler": "Bruce Stambler"
    },
    {
        " and John Levesque, which included trips to caves to record bat sounds.  A new ": null
    },
    {
        "Batmobile": "Batmobile"
    },
    {
        " was designed for Batman Forever, with two cars being constructed, one for stunt purposes and one for close-ups.  Swiss surrealist painter ": null
    },
    {
        "H. R. Giger": "H. R. Giger"
    },
    {
        " provided his version for the Batmobile but it was considered too sinister for the film.           ": null
    },
    {
        "Elliot Goldenthal": "Elliot Goldenthal"
    },
    {
        " was hired by Schumacher to compose the film score before the screenplay was written. In discussions with Schumacher, the director wanted Goldenthal to avoid taking inspiration from ": null
    },
    {
        "Danny Elfman": "Danny Elfman"
    },
    {
        ", and requested an original composition.  The films promotional teaser trailer used the main title theme from Elfmans score of 1989s  Batman .  Retrieved January 27, 2014     The soundtrack was commercially successful, selling almost as many copies as ": null
    },
    {
        "Princes": "Prince"
    },
    {
        " soundtrack": "Batman"
    },
    {
        " to the 1989 Batman film. Only five of the songs on the soundtrack are actually featured in the movie. Hit singles from the soundtrack include ": null
    },
    {
        "Hold Me, Thrill Me, Kiss Me, Kill Me": "Hold Me, Thrill Me, Kiss Me, Kill Me"
    },
    {
        " by ": null
    },
    {
        "U2": "U2"
    },
    {
        " and ": null
    },
    {
        "Kiss from a Rose": "Kiss From A Rose"
    },
    {
        " by ": null
    },
    {
        "Seal": "Seal"
    },
    {
        ", both of which were nominated for MTV Movie Awards. Kiss from a Rose reached No. 1 in the U.S. charts as well. The soundtrack itself, featuring additional songs by ": null
    },
    {
        "The Flaming Lips": "The Flaming Lips"
    },
    {
        ", ": null
    },
    {
        "Brandy": "Brandy Norwood"
    },
    {
        " , ": null
    },
    {
        "Method Man": "Method Man"
    },
    {
        ", ": null
    },
    {
        "Nick Cave": "Nick Cave"
    },
    {
        ", ": null
    },
    {
        "Michael Hutchence": "Michael Hutchence"
    },
    {
        " , ": null
    },
    {
        "PJ Harvey": "Pj Harvey"
    },
    {
        ", and ": null
    },
    {
        "Massive Attack": "Massive Attack"
    },
    {
        ", was an attempt to make the film more pop .       Batman Forever went through a few major edits before its release. Originally darker than the final product, the movies original length was closer to 2 hours and 40 minutes, according to director Joel Schumacher. There was talk of an extended cut being released to DVD for the films 10th anniversary in 2005. While all four previous Batman films were given special-edition DVD releases on the same day as the  Batman Begins  DVD release, none of them were given extended cuts, although some of the following scenes were in a deleted scenes section in the special features.      There was an undercurrent theme involving Bruce having repressed memories of an aspect of his parents death that he hadnt faced which was finding his fathers diary on the night of his parents wake and reading that Bruce insisted his parents go to the theater so he could watch one of the shows, meaning the reason he became Batman was out of the guilt that he was responsible for their deaths.     Many scenes were filmed but deleted from the film; other scenes had footage removed. These included:     The escape of Two-Face from Arkham Asylum. ": null
    },
    {
        "René Auberjonois": "René Auberjonois"
    },
    {
        " had another scene filmed here in the role of Doctor Burton, but his role was reduced in the final film. He discovers Two-Faces escape, encountering his psychologist hanged in Two-Faces cell with The Bat Must Die written in blood on the wall. This was supposed to be the films opening scene, but producers decided this was far too dark for a family audience. This scene appears in the comic adaptation and the novelization. Segments of the scene also appears on the U2 music video of Hold Me, Thrill Me, Kiss Me, Kill Me.   When Two-Face addresses the crowd from the helicopter in the opening action scene, the speech was truncated and several lines that appeared in the Theatrical Trailer were removed, including the line If the Bat wants to play, well play!   In the bank heist in the beginning of the film, after Two-Faces men shoots the elevator, Batman appeared and asks the men and Two-Face, Going Down? His line was cut and only appeared in the films trailer.   There was a sequence that contained an extended fight scene between Two-Face and Batman, where they both struggle for control of the helicopter. In this scene, Two-Face accuses Batman of being a killer too . Two-face then manages to escape by the parachute, after Batman realizes he has locked the steering wheel into position. This sequence is included in rough form on the special-edition DVD.   A scene right before Edward Nygma arrived at Wayne Manor. It featured Bruce Wayne watching a local Gotham talk show with Chase Meridian as a guest, talking about Batman.   One scene right before Riddler and Two-face team up featured a little conversation with Dick and Bruce in the gym of the manor. This would explain why Dick suddenly has martial arts training. This scene appears in a rough edit on the special-edition DVD.   The scene where the Riddler fails to punch a security guard out. The guard is then brutally beaten by the Riddler using his cane.   One sequence came directly after the casino robbery, where Batman follows a robbery signal on a tracking device in the Batmobile. He shows up at the crime scene and finds he is at the wrong place , in which a room full of girls laugh at him. The Riddler had been throwing Batman off the track by messing with the Batmobiles tracking device. This would explain why in the theatrical version Batman seems to give Riddler and Two-Face moments of free rein over the city. This scene appears in a rough edit on the special-edition DVD.   The construction of NygmaTech was after Batman solves the third riddle and was more in-depth. There were scenes shot that appear in publicity stills of Edward Nygma with a hard hat helping with the construction of his headquarters on Claw Island.   Sugar and Spice, played by ": null
    },
    {
        "Drew Barrymore": "Drew Barrymore"
    },
    {
        " and ": null
    },
    {
        "Debi Mazar": "Debi Mazar"
    },
    {
        ", try out the Riddlers device during the montage when it goes on sale. They are seated with the Riddler and Two-Face on the couch where Chase is handcuffed later in the film. This scene appears in the comic adaptation but not in the final film.   There was originally a scene after the montage of Alfred and Bruce examining the NygmaTech Box .   An extended scene established Bruce in the Batcave shortly after having discussed with Dick then that this would have saved his life after the battle with Two-Face in the subway system under construction. In this scene he is appreciated as the GNN news attacking Batman and Two-Face after the battle in the Subway and after that Bruce talking to Alfred turns into the dilemma of continuing to be Batman and try a normal life with Chase. Like the deleted Helicopter fight sequence, this scene also makes reference to Batman himself being a killer , and in the original production screenplay, this scene was to contain footage from  Batman Returns , specifically taken from the rooftop fight scene with ": null
    },
    {
        "Catwoman": "Catwoman"
    },
    {
        ". This would explain why in the theatrical version Bruce turns off all the systems in the Batcave telling Dick he gives up being Batman. This scene appears in a rough form on the special-edition DVD.   Another scene in the Wayne Manor raid sequence was longer, featuring Bruce and Chase fighting Two-Face and his thugs.   The scene involving Chase Meridian on the couch originally included a longer ending where the Riddler injects her with a green sleeping agent so he can easily place her in the small tube with the trap door.   Another deleted scene involved Bruce waking up after being shot in the head by Two-Face, temporarily forgetting his origin and life as the Dark Knight. Alfred takes him to the Batcave, which has been destroyed by the Riddler. They stand on the platform where the ": null
    },
    {
        "Batmobile": "Batmobile"
    },
    {
        " was, and Alfred says, Funny they did not know about the cave beneath the cave. The platform then rotates downward to another level where the ": null
    },
    {
        "sonar": "Sonar"
    },
    {
        "-modification equipment is kept, from the special ": null
    },
    {
        "Batsuit": "Batsuit"
    },
    {
        " to the hi-tech weaponry. Bruce then discovers the cavern where he first saw the giant bat that inspired him to become Batman. Inside he finds his fathers red diary which he had dropped when he first fell into the Batcave after his parents death. He reads the entry about him insisting his parents take him to the theater to see a show the same night they were killed. He realizes he had misread it, and his father had written even though Bruce insists, we wanted to see Zorro so his show will have to wait until next week. Bruce realizes his parents death was not his fault after all. The giant bat then appears and Bruce raises his arms to match the wing anatomy of the bat and the shot shows that they are one. Bruce now remembers who he is and goes with Alfred to solve the riddles left throughout the film. Screenwriter ": null
    },
    {
        "Akiva Goldsman": "Akiva Goldsman"
    },
    {
        " admitted the scene was very theatrical on the special-edition DVD and felt it would have made a difference to the final cut. The bat was designed and created by ": null
    },
    {
        "Rick Baker": "Rick Baker"
    },
    {
        ", who was in charge of the make-up of Two-Face. This scene appears in a rough form on the special-edition DVD.   The fight scene between Two-Face and Robin on Claw Island was originally longer.   The original ending was similar in style to the previous Batman films, which had involved a scene with Alfred in the limousine, the camera tracking upward through the Gotham cityscape, followed by a rooftop shot involving a silhouetted hero  facing the Bat Signal. When Alfred drives Doctor Chase Meridian back to Gotham she asks him Does it ever end, Alfred? Alfred replies, No, Doctor Meridian, not in this lifetime... The ": null
    },
    {
        "Bat-Signal": "Bat-Signal"
    },
    {
        " shines on the night sky and Batman is standing on a pillar looking ahead. Robin then comes into shot and joins his new partner. They both leap off the pillar, towards the camera. A rough edit of the first half of the scene appears on the special-edition DVD, but not in its entirety.           Batman Forever opened in 2,842 theaters in the United States on June 16, 1995, making $52.8 million in its opening weekend,  breaking ": null
    },
    {
        "Jurassic Parks": "Jurassic Park"
    },
    {
        "record for highest opening-weekend gross of all time .  The film went on to gross $184 million in North America, and $152.5 million in other countries, totaling $336.53 million. The film earned more money than its predecessor  Batman Returns ,  and was the second-highest-grossing film  of 1995, in the U.S.          On ": null
    },
    {
        "Rotten Tomatoes": "Rotten Tomatoes"
    },
    {
        ", the film has an approval rating of 39% based on 64 reviews, with an average rating of 5.2/10. The sites critical consensus reads, Loud, excessively busy, and often boring, Batman Forever nonetheless has the charisma of Jim Carrey and Tommy Lee Jones to offer mild relief.  On ": null
    },
    {
        "Metacritic": "Metacritic"
    },
    {
        ", the film has a score of 51 out of 100, based on 23 critics, indicating mixed or average reviews .  Audiences polled by ": null
    },
    {
        "CinemaScore": "Cinemascore"
    },
    {
        " gave the film an average grade of A– on an A+ to F scale.      ": null
    },
    {
        "Peter Travers": "Peter Travers"
    },
    {
        " of Rolling Stone said Batman Forever still gets in its licks. Theres no fun machine this summer that packs more surprises. Travers criticized the films excessive commercialism and felt that the script misses the pain ": null
    },
    {
        "Tim Burton": "Tim Burton"
    },
    {
        " caught in a man tormented by the long-ago murder of his parents seeing the Bruce Wayne of Kilmer as inexpressive .  Brian Lowry of  Variety  believed One does have to question the logic behind adding nipples to the hard-rubber ": null
    },
    {
        "batsuit": "Batsuit"
    },
    {
        ". Whose idea was that supposed to be anyway, ": null
    },
    {
        "Alfred": "Alfred Pennyworth"
    },
    {
        "s? Some of the ": null
    },
    {
        "computer-generated": "Computer-Generated Imagery"
    },
    {
        " Gotham": "Gotham City"
    },
    {
        " cityscapes appear too obviously fake. ": null
    },
    {
        "Elliot Goldenthals": "Elliot Goldenthal"
    },
    {
        "score, while serviceable, also isnt as stirring as ": null
    },
    {
        "Danny Elfmans": "Danny Elfman"
    },
    {
        "work in the first two films.      ": null
    },
    {
        "James Berardinelli": "James Berardinelli"
    },
    {
        " of ReelViews enjoyed the film. Its lighter, brighter, funnier, faster-paced, and a whole lot more colorful than before.  ": null
    },
    {
        "Scott Beatty": "Scott Beatty"
    },
    {
        " felt Tommy Lee Jones played ": null
    },
    {
        "Harvey Dent": "Two-Face"
    },
    {
        " as a ": null
    },
    {
        "Joker": "Joker"
    },
    {
        " knock-off rather than a multi-layered rogue.  ": null
    },
    {
        "Gene Siskel": "Gene Siskel"
    },
    {
        " of the  Chicago Tribune  and ": null
    },
    {
        "Roger Ebert": "Roger Ebert"
    },
    {
        " of the  Chicago Sun-Times  both gave the film mixed reviews, but with the former giving it a ": null
    },
    {
        "thumbs up": "Thumb Signal"
    },
    {
        " and the latter a ": null
    },
    {
        "thumbs down": "Thumb Signal"
    },
    {
        ".  In his written review, Ebert wrote: Is the movie better entertainment? Well, its great bubblegum for the eyes. Younger children will be able to process it more easily; some kids were led bawling from Batman Returns where the ": null
    },
    {
        "PG-13 rating": "Motion Picture Association Of America Film Rating System"
    },
    {
        " was a joke.  ": null
    },
    {
        "Mick LaSalle": "Mick Lasalle"
    },
    {
        " of the  San Francisco Chronicle  had a mixed reaction, concluding a shot of Kilmers rubber buns at one point is guaranteed to bring squeals from the audience.        At the ": null
    },
    {
        "68th Academy Awards": "68Th Academy Awards"
    },
    {
        ", Batman Forever was nominated for ": null
    },
    {
        "Cinematography": "Academy Award For Best Cinematography"
    },
    {
        " , ": null
    },
    {
        "Sound Mixing": "Academy Award For Best Sound Mixing"
    },
    {
        "  and ": null
    },
    {
        "Sound Editing": "Academy Award For Best Sound Editing"
    },
    {
        "  .  ": null
    },
    {
        "Hold Me, Thrill Me, Kiss Me, Kill Me": "Hold Me, Thrill Me, Kiss Me, Kill Me"
    },
    {
        " by ": null
    },
    {
        "U2": "U2"
    },
    {
        " was nominated for the ": null
    },
    {
        "Golden Globe Award for Best Original Song": "Golden Globe Award For Best Original Song"
    },
    {
        " , but was also nominated for the Worst Original Song ": null
    },
    {
        "Golden Raspberry Award": "Golden Raspberry Award"
    },
    {
        " . At the ": null
    },
    {
        "Saturn Award": "Saturn Award"
    },
    {
        "s, the film was nominated for ": null
    },
    {
        "Best Fantasy Film": "Saturn Award For Best Fantasy Film"
    },
    {
        " , ": null
    },
    {
        "Make-up": "Saturn Award For Best Make-Up"
    },
    {
        " , ": null
    },
    {
        "Special Effects": "Saturn Award For Best Special Effects"
    },
    {
        "  and ": null
    },
    {
        "Costume Design": "Saturn Award For Best Costume Design"
    },
    {
        " . Composer ": null
    },
    {
        "Elliot Goldenthal": "Elliot Goldenthal"
    },
    {
        " was given a ": null
    },
    {
        "Grammy Award nomination": "Grammy Award For Best Score Soundtrack For Visual Media"
    },
    {
        ". Batman Forever received six nominations at the ": null
    },
    {
        "1996 MTV Movie Awards": "1996 Mtv Movie Awards"
    },
    {
        ", four of which were divided between two categories . However, it won in just one category—Best Song from a Movie for Seals Kiss from a Rose .       In addition to a large line of toys, video games and ": null
    },
    {
        "action figures": "Action Figure"
    },
    {
        "from ": null
    },
    {
        "Kenner": "Kenner"
    },
    {
        ", the ": null
    },
    {
        "McDonalds": "Mcdonalds"
    },
    {
        " food chain released several collectibles and mugs to coincide with the release of the film. ": null
    },
    {
        "Peter David": "Peter David"
    },
    {
        " and ": null
    },
    {
        "Alan Grant": "Alan Grant"
    },
    {
        " wrote separate ": null
    },
    {
        "novelizations": "Novelization"
    },
    {
        "of the film.   ": null
    },
    {
        "Dennis ONeil": "Dennis Oneil"
    },
    {
        " authored a comic book adaptation, with art by ": null
    },
    {
        "Michal Dutkiewicz": "Michal Dutkiewicz"
    },
    {
        ".      ": null
    },
    {
        "Six Flags Great Adventure": "Six Flags Great Adventure"
    },
    {
        " theme park re-themed their Axis Chemical arena, home of the Batman stunt show, to resemble Batman Forever , and the new show featured props from the film. ": null
    },
    {
        "Six Flags Over Texas": "Six Flags Over Texas"
    },
    {
        " featured a one-time fireworks show to promote the movie, and replica busts of Batman, Robin, Two-Face, and the Riddler can still be found in the Justice League store in the Looney Tunes U.S.A. section. ": null
    },
    {
        "Batman: The Ride": "Batman: The Ride"
    },
    {
        " opened at ": null
    },
    {
        "Six Flags St. Louis": "Six Flags St. Louis"
    },
    {
        " to promote the movie.       Batman Forever was released on ": null
    },
    {
        "DVD": "Dvd"
    },
    {
        " on February 10, 2009.;  on ": null
    },
    {
        "Blu-ray": "Blu-Ray"
    },
    {
        " on April 20, 2010., and on ": null
    },
    {
        "Ultra HD Blu-ray": "Ultra Hd Blu-Ray"
    },
    {
        " on June 4, 2019. ": null
    }
]