[
    {
        "                    The Battle of Poitiers was a major English victory in the ": null
    },
    {
        "Hundred Years War": "Hundred Years War"
    },
    {
        ". It was fought on 19 September 1356 in Nouaillé, near the city of ": null
    },
    {
        "Poitiers": "Poitiers"
    },
    {
        " in ": null
    },
    {
        "Aquitaine": "Aquitaine"
    },
    {
        ", western France. ": null
    },
    {
        "Edward, the Black Prince": "Edward, The Black Prince"
    },
    {
        ", led an army of ": null
    },
    {
        "English": "Kingdom Of England"
    },
    {
        ", ": null
    },
    {
        "Welsh": "Principality Of Wales"
    },
    {
        ", ": null
    },
    {
        "Breton": "Duchy Of Brittany"
    },
    {
        " and ": null
    },
    {
        "Gascon": "Duchy Of Gascony"
    },
    {
        " troops, many of them veterans of the ": null
    },
    {
        "Battle of Crécy": "Battle Of Crécy"
    },
    {
        ". They were attacked by a larger French force led by King ": null
    },
    {
        "John II of France": "John Ii Of France"
    },
    {
        ", which included allied ": null
    },
    {
        "Scottish": "Kingdom Of Scotland"
    },
    {
        " forces. The French were heavily defeated; an English counter-attack captured King John II along with ": null
    },
    {
        "his youngest son": "Philip The Bold"
    },
    {
        " and much of the French nobility.     The effect of the defeat on France was catastrophic, leaving ": null
    },
    {
        "Dauphin Charles": "Charles V Of France"
    },
    {
        " to rule the country. Charles faced ": null
    },
    {
        "populist revolts across the kingdom": "Jacquerie"
    },
    {
        " in the wake of the battle, which had destroyed the prestige of the French upper-class. The Edwardian phase of the war ended four years later in 1360, ": null
    },
    {
        "on favourable terms for England": "Treaty Of Brétigny"
    },
    {
        ".     Poitiers was the second major English victory of the ": null
    },
    {
        "Hundred Years War": "Hundred Years War"
    },
    {
        ". Poitiers was fought ten years after the ": null
    },
    {
        "Battle of Crécy": "Battle Of Crécy"
    },
    {
        " , and about half a century before the third, the ": null
    },
    {
        "Battle of Agincourt": "Battle Of Agincourt"
    },
    {
        " . The town and battle were often referred to as Poictiers in contemporaneous recordings, a name commemorated in ": null
    },
    {
        "several warships of the Royal Navy": "Hms Poictiers"
    },
    {
        ".        Following the death of ": null
    },
    {
        "Charles IV of France": "Charles Iv Of France"
    },
    {
        " in 1328, ": null
    },
    {
        "Philip": "Philip Vi Of France"
    },
    {
        ", Count of Valois, had been crowned as his successor, over his closest male relative and legal successor, ": null
    },
    {
        "Edward III of England": "Edward Iii Of England"
    },
    {
        ". Edward had been reluctant to pay homage to Philip in his role as ": null
    },
    {
        "Duke of Aquitaine": "Duke Of Aquitaine"
    },
    {
        ", resulting in Philips confiscating those lands in 1337 and precipitating war between the two nations. Three years later, Edward declared himself ": null
    },
    {
        "King of France": "King Of France"
    },
    {
        ". The war had begun well for the English. They had achieved naval domination early in the war at the ": null
    },
    {
        "Battle of Sluys": "Battle Of Sluys"
    },
    {
        " in 1340, Henri de Wailly. Introduction by Emmanuel Bourassin, Crecy 1346: Anatomy of a Battle p. 10 devastated the French in south west France with the ": null
    },
    {
        "Gascon campaigns of 1345": "Gascon Campaign Of 1345"
    },
    {
        " and ": null
    },
    {
        "1346": "Lancasters Chevauchée Of 1346"
    },
    {
        ", inflicted a severe defeat on the French army at ": null
    },
    {
        "Crécy": "Battle Of Crécy"
    },
    {
        " in 1346, and ": null
    },
    {
        "captured Calais in 1347": "Siege Of Calais"
    },
    {
        ".     In the late 1340s and early 1350s, the ": null
    },
    {
        "Black Death": "Black Death"
    },
    {
        " devastated the population of Western Europe, bringing all significant efforts in campaigning to a halt, while ": null
    },
    {
        "Philip VI of France": "Philip Vi Of France"
    },
    {
        " himself died as well. In 1355, Edward III laid out plans for a second major campaign. His eldest son, ": null
    },
    {
        "Edward, the Black Prince": "Edward, The Black Prince"
    },
    {
        ", now an experienced soldier following the Crécy campaign, landed at ": null
    },
    {
        "Bordeaux": "Bordeaux"
    },
    {
        " in Aquitaine, leading his army on a march through southern France to ": null
    },
    {
        "Carcassonne": "Carcassonne"
    },
    {
        ". Unable to take the heavily fortified settlement, Edward withdrew to Bordeaux. In early 1356, the ": null
    },
    {
        "Duke of Lancaster": "Henry Of Grosmont, 1St Duke Of Lancaster"
    },
    {
        " led an army through ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        ", while Edward led his army on a great ": null
    },
    {
        "chevauchée": "Chevauchée"
    },
    {
        " from Bordeaux on 8 August 1356. William W. Lace, The Hundred Years War , 1/1994     Edwards forces met little resistance, sacking numerous settlements, until they reached the ": null
    },
    {
        "Loire": "Loire"
    },
    {
        " river at ": null
    },
    {
        "Tours": "Tours"
    },
    {
        ". They were unable to take the castle or burn the town due to a heavy rainstorm. This delay allowed ": null
    },
    {
        "King John II": "John Ii Of France"
    },
    {
        " to attempt to pin down and destroy Edwards army. John, who had been besieging ": null
    },
    {
        "Breteuil": "Breteuil, Eure"
    },
    {
        " in ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        ", organised the bulk of his army at ": null
    },
    {
        "Chartres": "Chartres"
    },
    {
        " to the north of Tours. In order to increase the speed of his armys march, he dismissed between 15,000 and 20,000 of his lower quality infantry, just as Edward turned back to Bordeaux. Jonathan Sumption, The Hundred Years War: Vol. 2: Trial by Fire , pp. 223, 227–228 The French rode hard and cut in front of the English army, crossing the bridge over the Vienne at Chauvigny. Learning of this, the Black Prince quickly moved his army south. Historians disagree over whether the outnumbered English commander was seeking battle or trying to avoid it.  In any case, after preliminary manoeuvres and failed negotiations for a truce, the two armies faced-off, both ready for battle, near ": null
    },
    {
        "Poitiers": "Poitiers"
    },
    {
        " on Monday, 19 September 1356.              Edward arrayed his army in a defensive posture among the hedges and orchards of the area, in front of the forest of Nouaillé. He deployed his front line of longbowmen behind a particularly prominent thick hedge, through which the road ran at right angles. The Earl of Douglas, commanding the Scottish division in the French army, advised King John that the attack should be delivered on foot, with horses being particularly vulnerable to English arrows. John heeded this advice, his army leaving its baggage behind and forming up on foot in front of the English. The English gained vantage points on the natural high ground in order for their longbowmen to have an advantage over the heavily armoured French troops.       The English army was led by ": null
    },
    {
        "Edward, the Black Prince": "Edward, The Black Prince"
    },
    {
        ", and composed primarily of English and Welsh troops, though there was a large contingent of ": null
    },
    {
        "Gascon": "Duchy Of Gascony"
    },
    {
        " and ": null
    },
    {
        "Breton": "Duchy Of Brittany"
    },
    {
        " soldiers with the army. Edwards army consisted of approximately 2,000 ": null
    },
    {
        "longbow": "Longbow"
    },
    {
        "men, 3,000 ": null
    },
    {
        "men-at-arms": "Men-At-Arms"
    },
    {
        ", and a force of 1,000 Gascon infantry.     Like the earlier engagement at ": null
    },
    {
        "Crécy": "Battle Of Crécy"
    },
    {
        ", the power of the English army lay in the ": null
    },
    {
        "longbow": "Longbow"
    },
    {
        ", a tall, thick self-bow made of yew. Longbows had demonstrated their effectiveness against massed infantry and cavalry in several battles, such as ": null
    },
    {
        "Falkirk": "Battle Of Falkirk"
    },
    {
        " in 1298, ": null
    },
    {
        "Halidon Hill": "Battle Of Halidon Hill"
    },
    {
        " in 1333, and ": null
    },
    {
        "Crécy": "Battle Of Crécy"
    },
    {
        " in 1346. Poitiers was the second of three major English victories of the ": null
    },
    {
        "Hundred Years War": "Hundred Years War"
    },
    {
        " attributed to the longbow, though its effectiveness against armoured French knights and men-at-arms has been disputed.        ": null
    },
    {
        "Geoffrey the Baker": "Geoffrey The Baker"
    },
    {
        " wrote that the English archers under the Earl of Salisbury made their arrows prevail over the knights armour , Edward Maunde Thompson, Chronicle of Geoffrey le Baker, p. 147                     ": null
    }
]