[
    {
        "                 The Battle of Bouvines was fought on 27 July 1214 near the town of ": null
    },
    {
        "Bouvines": "Bouvines"
    },
    {
        " in the ": null
    },
    {
        "County of Flanders": "County Of Flanders"
    },
    {
        ". It was the concluding battle of the ": null
    },
    {
        "Anglo-French War of 1213–1214": "Anglo-French War"
    },
    {
        ". A French army of approximately 7,000 men commanded by King ": null
    },
    {
        "Philip Augustus": "Philip Ii Of France"
    },
    {
        " defeated an Allied army of approximately 9,000 commanded by ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        " Otto IV": "Otto Iv, Holy Roman Emperor"
    },
    {
        ".     In early 1214, a coalition was assembled against King Philip Augustus of France, consisting of Otto IV, ": null
    },
    {
        "King John of England": "King John Of England"
    },
    {
        ", Count ": null
    },
    {
        "Ferrand of Flanders": "Ferdinand, Prince Of Portugal"
    },
    {
        ", Duke ": null
    },
    {
        "Henry I of Brabant": "Henry I Of Brabant"
    },
    {
        ", Count ": null
    },
    {
        "William I of Holland": "William I Of Holland"
    },
    {
        ", Duke ": null
    },
    {
        "Theobald I of Lorraine": "Theobald I, Duke Of Lorraine"
    },
    {
        ", and Duke ": null
    },
    {
        "Henry III of Limburg": "Henry Iii Of Limburg"
    },
    {
        ". Its objective was to reverse the ": null
    },
    {
        "conquests": "Conquest"
    },
    {
        " made by Philip earlier in his reign.     After initial ": null
    },
    {
        "manoeuvring": "Maneuver Warfare"
    },
    {
        " in late July, battle was offered near Bouvines on 27 July. The long allied ": null
    },
    {
        "column": "Column"
    },
    {
        " deployed slowly into battle order, leaving the Allies at a disadvantage. The superior ": null
    },
    {
        "discipline": "Discipline"
    },
    {
        " and order of the French knights allowed them to carry out a series of devastating ": null
    },
    {
        "charges": "Charge"
    },
    {
        ", shattering the ": null
    },
    {
        "Flemish": "Flemish"
    },
    {
        " knights on the allied left wing. In the centre, the Allied knights and infantry under Otto enjoyed initial success, scattering the French urban infantry and nearly killing Philip. A ": null
    },
    {
        "counterattack": "Counterattack"
    },
    {
        " by French knights smashed the isolated Allied infantry and Ottos entire centre division fell back. Otto fled the battle and his knightly followers were defeated by the French knights, who went on to capture the Imperial ": null
    },
    {
        "eagle": "Reichsadler"
    },
    {
        " standard": "Heraldic Flag"
    },
    {
        ". With the Allied centre and left wing routed, only the soldiers of the right wing under ": null
    },
    {
        "Renaud of Boulogne": "Renaud De Dammartin"
    },
    {
        " and ": null
    },
    {
        "William de Longespee": "William De Longespee, 3Rd Earl Of Salisbury"
    },
    {
        " held on. They were killed, captured or driven from the field. A pursuit was not conducted as it was nearly dark.     The crushing French victory dashed English and Flemish hopes of regaining lost territories. ": null
    },
    {
        "Frederick II": "Frederick Ii, Holy Roman Emperor"
    },
    {
        " Hohenstaufen": "House Of Hohenstaufen"
    },
    {
        " deposed Otto as emperor after the battle. King John was forced to agree to the ": null
    },
    {
        "Magna Carta": "Magna Carta"
    },
    {
        " in 1215 by his discontented barons and hand over English-occupied Anjou to Philip in a peace settlement. Counts Ferrand, Renaud and Longespee were captured and imprisoned. The balance of power in Europe shifted, with the ": null
    },
    {
        "popes": "Pope"
    },
    {
        " of the 13th century increasingly seeking the support of a powerful France.       In 1214, ": null
    },
    {
        "Ferdinand, Infante of Portugal, and Count of Flanders": "Ferdinand, Count Of Flanders"
    },
    {
        " desired the return of the cities of ": null
    },
    {
        "Aire-sur-la-Lys": "Aire-Sur-La-Lys"
    },
    {
        " and ": null
    },
    {
        "Saint-Omer": "Saint-Omer"
    },
    {
        ", which he had recently lost to ": null
    },
    {
        "Philip II, King of France": "Philip Ii Of France"
    },
    {
        " in the ": null
    },
    {
        "Treaty of Pont-à-Vendin": "Treaty Of Pont-À-Vendin"
    },
    {
        ". He thus broke allegiance with Philip and assembled a broad coalition including ": null
    },
    {
        "Emperor Otto IV": "Otto Iv, Holy Roman Emperor"
    },
    {
        ", ": null
    },
    {
        "King John I of England": "John, King Of England"
    },
    {
        ", ": null
    },
    {
        "Duke Henry I of Brabant": "Henry I, Duke Of Brabant"
    },
    {
        ", ": null
    },
    {
        "Count William I of Holland": "William I, Count Of Holland"
    },
    {
        ", ": null
    },
    {
        "Duke Theobald I of Lorraine": "Theobald I, Duke Of Lorraine"
    },
    {
        ", and ": null
    },
    {
        "Duke Henry III of Limburg": "Henry Iii, Duke Of Limburg"
    },
    {
        ".     The campaign was planned by John, who was the fulcrum of the alliance; his plan was to draw the French away from Paris southward towards his forces and keep them occupied, while the main army, under Emperor Otto IV, marched on Paris from the north. Johns plan was followed initially, but the Allies in the north moved slowly. John, after two encounters with the French, retreated to ": null
    },
    {
        "Aquitaine": "Aquitaine"
    },
    {
        " on 3 July.     On 23 July, having summoned his ": null
    },
    {
        "vassals": "Vassal"
    },
    {
        ", Philip had an army consisting of 6,000 to 8,000 soldiers. The Emperor finally succeeded in concentrating his forces at ": null
    },
    {
        "Valenciennes": "Valenciennes"
    },
    {
        ", although this did not include John, and in the interval Philip had counter-marched northward and regrouped. Philip now took the offensive himself, and after manoeuvring to obtain good ground for his cavalry he offered battle on 27 July, on the plain east of Bouvines and the river Marque.     Otto was surprised by the speed of his enemy and was thought to have been caught unprepared by Philip, who probably deliberately lured Otto into his trap. Otto decided to launch an attack on what was then the French rearguard.     The Allied army drew up facing south-west towards Bouvines, the heavy cavalry on the wings, the infantry in one great mass in the centre, supported by a cavalry corps under Otto himself. The French army formed up opposite in a similar formation, cavalry on the wings, infantry, including the town militias, in the centre. Philip, with the cavalry reserve and the royal standard, the ": null
    },
    {
        "Oriflamme": "Oriflamme"
    },
    {
        ", positioned himself to the rear of the men on foot. It is said by ": null
    },
    {
        "William the Breton": "William The Breton"
    },
    {
        ", chaplain to Philip at the battle, that the soldiers stood in line in a space of 40,000 steps , which leaves very little clearance and predisposes to hand-to-hand fighting. William the Breton also says in his chronicle that the two lines of combatants were separated by a small space .            The French army contained 1,200–1,360 knights  and 300 mounted sergeants. Philip had launched an appeal to the municipalities in northern France, in order to obtain their support.   16 of the 39 municipalities of the royal demesne answered the call to arms. They provided 3,160 infantry, broken down as:   Amiens 250,   Arras 1000,   Beauvais 500,   Compiegne 200,   Corbie 200,   Bruyeres 120,   Cerny and Crepy-en-Laonnais 80,   Crandelain 40,   Hesdin 80,   Montreuil-sur-Mer 150,   Noyon 150,   Roye 100,   Soissoins 160, and   Vailly 50.   The balance of the infantry, possibly another 2,000 men, were composed of mercenaries. The other communes of the royal demesne were supposed to provide a further 1,980 infantry, but it is doubtful that they did.   In total, the royal army totalled approximately 6,000–7,000 men.     The royal army was divided into three parts, or ": null
    },
    {
        " battles ": "Battle"
    },
    {
        " Champagne": "Champagne, France"
    },
    {
        " and ": null
    },
    {
        "Burgundy": "Franche-Comté"
    },
    {
        ", was commanded by Eudes, Duke of Burgundy, and his lieutenants: ": null
    },
    {
        "Gaucher of Châtillon": "Walter Iii Of Châtillon"
    },
    {
        ", Count of Saint-Pol, Count Wilhelm I of Sancerre, Count of Beaumont, ": null
    },
    {
        "Mathieu of Montmorency": "Matthieu Ii Of Montmorency"
    },
    {
        " and Adam II Viscount of Melun. In the front of the right wing were men-at-arms and militia from Burgundy, Champagne, and ": null
    },
    {
        "Picardy": "Picardy"
    },
    {
        " led by 150 mounted sergeants from ": null
    },
    {
        "Soissons": "Soissons"
    },
    {
        ".   The central battle was led by ": null
    },
    {
        "Philip Augustus": "Philip Augustus"
    },
    {
        " and his chief knights – William des Barres, Bartholomew of Roye, Girard Scophe, William of Garland, ": null
    },
    {
        "Enguerrand of Coucy": "Enguerrand Iii De Coucy"
    },
    {
        " and ": null
    },
    {
        "Gautier of Nemours": "Duke Of Nemours"
    },
    {
        ". In front of the king and his 175 knights were 2,150 infantry from the towns of the ": null
    },
    {
        "Île de France": "Île De France"
    },
    {
        " and ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        ".   The left wing was led by ": null
    },
    {
        "Robert of Dreux": "Robert Iii, Count Of Dreux"
    },
    {
        ", supported by ": null
    },
    {
        "Count William of Ponthieu": "William Iv, Count Of Ponthieu"
    },
    {
        ". The main body of the left wing consisted of Bretons and militia from ": null
    },
    {
        "Dreux": "Dreux"
    },
    {
        ", ": null
    },
    {
        "Perche": "Perche"
    },
    {
        ", ": null
    },
    {
        "Ponthieu": "Ponthieu"
    },
    {
        ", and Vimeux.   The bridge of Bouvines, the only means of retreat across the marshes, was guarded by 150 sergeants-at-arms, who also formed the French reserve.       Ottos army contained some 1,300–1,500 knights: 600–650 Flemish, 425–500 Hainaulter and 275–350 from elsewhere. He also fielded approximately 7,500 infantry, to give a total force of just under 9,000 men. The imperial army was also formed up in three battles: ": null
    },
    {
        "Ferrand of Flanders": "Ferdinand, Prince Of Portugal"
    },
    {
        " with his Flemish knights – directed by Arnaud of Oudenaarde. The infantry were from ": null
    },
    {
        "Flanders": "Flanders"
    },
    {
        " and ": null
    },
    {
        "Hainaut": "County Of Hainaut"
    },
    {
        ".   The centre was under the command of Otto and of ": null
    },
    {
        "Theobald, Duke of Lorraine": "Theobald I, Duke Of Lorraine"
    },
    {
        ", ": null
    },
    {
        "Henry, Duke of Brabant": "Henry I, Duke Of Brabant"
    },
    {
        ", and ": null
    },
    {
        "Philip Courtenay, Marquis of Namur": "Philip Ii, Marquis Of Namur"
    },
    {
        ". It included many Saxons and infantry from ": null
    },
    {
        "Brabant": "Duchy Of Brabant"
    },
    {
        " and Germany. In the front of the battle stood German pike phalanxes. Saxon infantry formed the second line. Otto stood between these with 50 German knights.   The right flank, under the command of ": null
    },
    {
        "Renaud de Dammartin": "Renaud De Dammartin"
    },
    {
        ", included Brabant infantry and English knights, the latter under the command of the ": null
    },
    {
        "Earl of Salisbury, William Longespée": "William Longespée, 3Rd Earl Of Salisbury"
    },
    {
        ".   On the extreme right, English archers supported the flank of both the Brabant infantry and the nobles of the two Lorraines .            The battle opened with an attack by 150 light cavalrymen from the ": null
    },
    {
        "Abbey of Saint-Médard de Soissons": "Abbey Of Saint-Médard De Soissons"
    },
    {
        " against the Flemish knights on the allied left, aiming to throw it into confusion. The Flemish knights easily drove off the unarmoured horsemen. Some Flemish knights left their formations and chased the retreating light cavalry. 180 French knights from Champagne in turn attacked and killed or captured the over-aggressive Flemish knights. The Count of Flanders counter-attacked with his entire force of 600 knights and threw the French back.     Gaucher de Châtillon launched his 30 knights at the Flemish force, followed by a further 250 knights. They carried out a continuous series of charges, and halted the allied advance. Many knights on both sides fell from their horses in the first clash. The French were better ordered than the more loosely formed Flemish knights, and the Allied ranks grew thinner as they were assaulted by the compact French masses. Châtillon and Melun with their knights broke through the ranks of their Flemish counterparts, then wheeled and struck them from the rear, constantly switching targets. St. Pols knights and the Burgundians engaged in an exhausting struggle against the Flemings, taking no prisoners. The Duke of Burgundys horse was killed and the Duke thrown to the ground, but he was saved by his knights, who beat off the Flemish and found him a fresh horse.     The Flemings fought on for three hours despite their increasingly desperate situation, driven by ": null
    },
    {
        "knightly honour": "Chivalry"
    },
    {
        ". Finally, the wounded and unhorsed Count of Flanders was captured by two French knights, triggering the collapse of his knights morale.          The French urban militia infantry, 2,150 strong, were gathered under the Oriflamme in the centre, in front of Philips knights and the  fleur-de-lis  standard.Soon after deploying, they were attacked by Allied knights and infantry under Otto and thrown back. Otto and his knights had nearly reached the French king when they were halted by French knights. The allied infantrymen broke through to Philip and his handful of knightly companions, unhorsing him with their hooked pikes. The French kings armour deflected an enemy ": null
    },
    {
        "lance": "Lance"
    },
    {
        " and saved his life. Gales de Montigny used the royal standard to signal for help and another knight gave Philip a fresh horse.     The allied infantry used ": null
    },
    {
        "daggers": "Dagger"
    },
    {
        " to stab unhorsed French knights through the eye-slits in their ": null
    },
    {
        "enclosed helmets": "Enclosed Helmet"
    },
    {
        " or ": null
    },
    {
        "great helms": "Great Helm"
    },
    {
        " and other weak spots in their armour. The Norman knight ": null
    },
    {
        "Etienne de Longchamp": "Stephen Longchamp"
    },
    {
        " was killed in this way and the French suffered heavy losses. After repeated French counterattacks and a prolonged fight the Allies were thrown back.     The battle in the centre was now a melee between the two mounted reserves led by the King and the Emperor in person. The French knight Pierre Mauvoisin nearly captured Otto and his horse and Gérard la Truie stabbed the Emperor with a dagger, which bounced off his ": null
    },
    {
        "coat": "Hauberk"
    },
    {
        " of ": null
    },
    {
        "mail": "Mail"
    },
    {
        " and struck Ottos horse in the eye, killing it. Otto was saved by four German lords and their followers. As the French sent more knights to attack him personally he fled the field. The German knights fought to the bitter end to save their emperor, all being killed or captured. The Imperial Standard with the eagle and dragon was captured by the French knights, who brought it to their king. By this time, Allied resistance in the centre had ceased.       Meanwhile, on the French left Robert de Dreuxs troops were at first pressed by men led by William Longespée. William Longespée was unhorsed and taken prisoner by ": null
    },
    {
        "Philip of Dreux": "Philip Of Dreux"
    },
    {
        ", the ": null
    },
    {
        "Bishop of Beauvais": "Roman Catholic Diocese Of Beauvais"
    },
    {
        ", and the English soldiers fled. Mathieu de Montmorency captured twelve enemy banners.           The day was already decided in favour of the French when their wings began to close inwards to cut off the retreat of the imperial centre. The battle closed with the celebrated stand of ": null
    },
    {
        "Reginald of Boulogne": "Reginald Of Boulogne"
    },
    {
        " , a former vassal of King Philip, who formed a ring of 400–700 ": null
    },
    {
        "Brabant": "Brabant"
    },
    {
        " pikemen. They defied every attack by the French cavalry, while Reginald made repeated sorties with his small force of knights. Eventually, long after the Imperial army had retreated, the Brabant ": null
    },
    {
        "schiltrom": "Sheltron"
    },
    {
        " was overrun by a charge of 50 knights and 1,000–2,000 infantry under Thomas de St Valery. Reginald was taken prisoner in the melee. A pursuit was not conducted owing to the approaching nightfall and a fear that the prisoners might escape. The French formations were recalled using trumpets.       French knightly casualties are not recorded; the French infantry suffered heavily. The Allies had 169 knights killed and heavy but unquantified losses among the infantry; including between 400 and 700 Brabant infantry killed. As well as Reginald of Boulogne two other counts were captured by the French, Hainaut Ferrand and ": null
    },
    {
        "William Longespée": "William Longespée, 3Rd Earl Of Salisbury"
    },
    {
        ", as well as twenty-five barons and over a hundred knights.     The battle ended the threat from both Otto and John. According to ": null
    },
    {
        "Jean Favier": "Jean Favier"
    },
    {
        ", Bouvines is one of the most decisive and symbolic battles in the history of France . For Philippe Contamine the Battle of Bouvines had both important consequences and a great impact . ": null
    },
    {
        "Ferdinand Lot": "Ferdinand Lot"
    },
    {
        " called it a medieval ": null
    },
    {
        "Austerlitz": "Battle Of Austerlitz"
    },
    {
        " .     Philip returned to ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " triumphant, marching his captive prisoners behind him in a long procession, as his subjects lined the streets to greet the victorious king. In the aftermath of the battle, Otto retreated to his castle of ": null
    },
    {
        "Harzburg": "Harzburg"
    },
    {
        " and was soon overthrown as Holy Roman Emperor by Frederick II, who had already been recognised as emperor in the south a year and a half earlier. Count Ferdinand remained imprisoned following his defeat, while King John obtained a five-year truce, on very lenient terms given the circumstances.        Philips decisive victory was crucial to the political situation in England. The battle ended all hope of a restoration of the ": null
    },
    {
        "Angevin Empire": "Angevin Empire"
    },
    {
        ". So weakened was the defeated King ": null
    },
    {
        "John": "John Of England"
    },
    {
        " that he soon needed to submit to his barons demands and agree to the ": null
    },
    {
        "Magna Carta": "Magna Carta"
    },
    {
        ", limiting the power of the crown and establishing the basis for common law.       In thanksgiving for the victory, Philip Augustus founded the Abbey of Notre Dame de la Victoire, between Senlis and Mont lEvêque. In 1914, to mark the seventh centenary, ": null
    },
    {
        "Félix Dehau": "Félix Dehau"
    },
    {
        " had the parish church of Bouvines rebuilt with a number of stained-glass windows representing the history of the battle. In 2014, the eighth centenary was commemorated in Bouvines by an association called Bouvines 2014. A series of events, including an official ceremony and a show called Bouvines la Bataille attracted more than 6,000 viewers in Bouvines.   ": null
    }
]