[
    {
        "   The Behistun Inscription  is a multilingual inscription and large ": null
    },
    {
        "rock relief": "Rock Relief"
    },
    {
        " on a cliff at ": null
    },
    {
        "Mount Behistun": "Mount Behistun"
    },
    {
        " in the ": null
    },
    {
        "Kermanshah Province": "Kermanshah Province"
    },
    {
        " of ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ", near the city of ": null
    },
    {
        "Kermanshah": "Kermanshah"
    },
    {
        " in western ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ", established by ": null
    },
    {
        "Darius the Great": "Darius The Great"
    },
    {
        " . It was crucial to the decipherment of ": null
    },
    {
        "cuneiform script": "Cuneiform Script"
    },
    {
        " as the inscription includes three versions of the same text, written in three different ": null
    },
    {
        "cuneiform script": "Cuneiform Script"
    },
    {
        " languages: ": null
    },
    {
        "Old Persian": "Old Persian"
    },
    {
        ", ": null
    },
    {
        "Elamite": "Elamite Language"
    },
    {
        ", and ": null
    },
    {
        "Babylonian": "Babylonian Language"
    },
    {
        " . The inscription is to ": null
    },
    {
        "cuneiform": "Cuneiform Script"
    },
    {
        " what the ": null
    },
    {
        "Rosetta Stone": "Rosetta Stone"
    },
    {
        " is to ": null
    },
    {
        "Egyptian hieroglyphs": "Egyptian Hieroglyph"
    },
    {
        ": the document most crucial in the ": null
    },
    {
        "decipherment": "Decipherment"
    },
    {
        " of a previously lost ": null
    },
    {
        "script": "Writing System"
    },
    {
        ".     Authored by Darius the Great sometime between his coronation as king of the ": null
    },
    {
        "Persian Empire": "Achaemenid Empire"
    },
    {
        " in the summer of 522 BC and his death in autumn of 486 BC, the inscription begins with a brief autobiography of Darius, including his ancestry and lineage. Later in the inscription, Darius provides a lengthy sequence of events following the deaths of ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        " and ": null
    },
    {
        "Cambyses II": "Cambyses Ii"
    },
    {
        " in which he fought nineteen battles in a period of one year to put down multiple rebellions throughout the Persian Empire.   The inscription states in detail that the rebellions, which had resulted from the deaths of Cyrus the Great and his son Cambyses II, were orchestrated by several impostors and their co-conspirators in various cities throughout the empire, each of whom falsely proclaimed kinghood during the upheaval following Cyruss death.     Darius the Great proclaimed himself victorious in all battles during the period of upheaval, attributing his success to the grace of ": null
    },
    {
        "Ahura Mazda": "Ahura Mazda"
    },
    {
        " .     The inscription is approximately  high by  wide and  up a ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        " cliff from an ancient road connecting the capitals of ": null
    },
    {
        "Babylonia": "Babylonia"
    },
    {
        " and ": null
    },
    {
        "Media": "Medes"
    },
    {
        " . The ": null
    },
    {
        "Old Persian": "Old Persian"
    },
    {
        " text contains 414 lines in five columns; the Elamite text includes 593 lines in eight columns, and the Babylonian text is in 112 lines. The inscription was illustrated by a life-sized bas-relief of ": null
    },
    {
        "Darius I, the Great": "Darius The Great"
    },
    {
        ", holding a ": null
    },
    {
        "bow": "Bow"
    },
    {
        " as a sign of kingship, with his left foot on the chest of a figure lying on his back before him. The supine figure is reputed to be the pretender ": null
    },
    {
        "Gaumata": "Gaumata"
    },
    {
        ". Darius is attended to the left by two servants, and nine one-meter figures stand to the right, with hands tied and rope around their necks, representing conquered peoples. A ": null
    },
    {
        "Faravahar": "Faravahar"
    },
    {
        " floats above, giving its blessing to the king. One figure appears to have been added after the others were completed, as was Dariuss beard, which is a separate block of stone attached with ": null
    },
    {
        "iron": "Iron"
    },
    {
        " pins and ": null
    },
    {
        "lead": "Lead"
    },
    {
        ".            After the fall of the Persian Empires ": null
    },
    {
        "Achaemenid Dynasty": "Achaemenid Dynasty"
    },
    {
        " and its successors, and the lapse of Old Persian cuneiform writing into disuse, the nature of the inscription was forgotten, and fanciful explanations became the norm. For centuries, instead of being attributed to Darius the Great, it was believed to be from the reign of ": null
    },
    {
        "Khosrau II": "Khosrau Ii"
    },
    {
        " of ": null
    },
    {
        "Persia": "Persia"
    },
    {
        "—one of the last ": null
    },
    {
        "Sassanid": "Sassanid"
    },
    {
        " kings, who lived over 1000 years after the time of Darius the Great.     The inscription is mentioned by ": null
    },
    {
        "Ctesias of Cnidus": "Ctesias"
    },
    {
        ", who noted its existence some time around 400 BC and mentioned a well and a garden beneath the inscription. He incorrectly concluded that the inscription had been dedicated by Queen ": null
    },
    {
        "Semiramis of Babylon": "Semiramis Of Babylon"
    },
    {
        " to ": null
    },
    {
        "Zeus": "Zeus"
    },
    {
        " . ": null
    },
    {
        "Tacitus": "Gaius Cornelius Tacitus"
    },
    {
        " also mentions it and includes a description of some of the long-lost ancillary monuments at the base of the cliff, including an altar to ": null
    },
    {
        "Herakles": "Herakles"
    },
    {
        " . What has been recovered of them, including a statue dedicated in 148 BC, is consistent with Tacituss description. ": null
    },
    {
        "Diodorus": "Diodorus Siculus"
    },
    {
        " also writes of Bagistanon and claims it was inscribed by Semiramis.          A legend began around ": null
    },
    {
        "Mount Behistun": "Mount Behistun"
    },
    {
        " , as written about by the ": null
    },
    {
        "Persian poet and writer": "Persian Literature"
    },
    {
        " Ferdowsi": "Ferdowsi"
    },
    {
        " in his  Shahnameh   , about a man named ": null
    },
    {
        "Farhad": "Farhad"
    },
    {
        ", who was a lover of King Khosrows wife, ": null
    },
    {
        "Shirin": "Shirin"
    },
    {
        ". The legend states that, exiled for his transgression, Farhad was given the task of cutting away the mountain to find water; if he succeeded, he would be given permission to marry Shirin. After many years and the removal of half the mountain, he did find water, but was informed by Khosrow that Shirin had died. He went mad, threw his axe down the hill, kissed the ground and died. It is told in the book of ": null
    },
    {
        "Khosrow and Shirin": "Khosrow And Shirin"
    },
    {
        " that his axe was made out of a pomegranate tree, and, where he threw the axe, a pomegranate tree grew with fruit that would cure the ill. Shirin was not dead, according to the story, and mourned upon hearing the news.     In 1598, the ": null
    },
    {
        "Englishman": "England"
    },
    {
        " Robert Sherley": "Robert Sherley"
    },
    {
        " saw the inscription during a diplomatic mission to ": null
    },
    {
        "Persia": "Iran"
    },
    {
        " on behalf of ": null
    },
    {
        "Austria": "Austria"
    },
    {
        ", and brought it to the attention of Western European scholars. His party incorrectly came to the conclusion that it was Christian in origin. E. Denison Ross, The Broadway Travellers: Sir Anthony Sherley and his Persian Adventure, Routledge, 2004,  French General ": null
    },
    {
        "Gardanne": "Claude Matthieu, Count Gardane"
    },
    {
        " thought it showed Christ and his ": null
    },
    {
        "twelve apostles": "Twelve Apostles"
    },
    {
        " , and ": null
    },
    {
        "Sir Robert Ker Porter": "Robert Ker Porter"
    },
    {
        " thought it represented the ": null
    },
    {
        "Lost Tribes of Israel": "Lost Tribes Of Israel"
    },
    {
        " and ": null
    },
    {
        "Shalmaneser of Assyria": "Shalmaneser I"
    },
    {
        ".  Robert Ker Porter, Travels in Georgia, Persia, Armenia, ancient Babylonia, & c. & c. : during the years 1817, 1818, 1819, and 1820, volume 2, Longman, 1821 Italian explorer ": null
    },
    {
        "Pietro della Valle": "Pietro Della Valle"
    },
    {
        " visited the inscription in the course of a pilgrimage in around 1621.               German surveyor ": null
    },
    {
        "Carsten Niebuhr": "Carsten Niebuhr"
    },
    {
        " visited in around 1764 for ": null
    },
    {
        "Frederick V of Denmark": "Frederick V Of Denmark"
    },
    {
        ", publishing a copy of the inscription in the account of his journeys in 1778. Carsten Niebuhr, Reisebeschreibung von Arabien und anderen umliegenden Ländern, 2 volumes, 1774 and 1778 Niebuhrs transcriptions were used by ": null
    },
    {
        "Georg Friedrich Grotefend": "Georg Friedrich Grotefend"
    },
    {
        " and others in their efforts to decipher the ": null
    },
    {
        "Old Persian cuneiform": "Old Persian Cuneiform"
    },
    {
        " script. Grotefend had deciphered ten of the 37 symbols of Old Persian by 1802, after realizing that unlike the Semitic cuneiform scripts, Old Persian text is alphabetic and each word is separated by a vertical slanted symbol.      The Old Persian text was copied and deciphered before recovery and copying of the Elamite and Babylonian inscriptions had even been attempted, which proved to be a good deciphering strategy, since Old Persian script was easier to study due to its alphabetic nature and because the language it represents had naturally evolved via ": null
    },
    {
        "Middle Persian": "Middle Persian"
    },
    {
        " to the living modern ": null
    },
    {
        "Persian language": "Persian Language"
    },
    {
        " dialects, and was also related to the ": null
    },
    {
        "Avestan": "Avestan"
    },
    {
        " language, used in the ": null
    },
    {
        "Zoroastrian": "Zoroastrian"
    },
    {
        " book the  Avesta .     In 1835, ": null
    },
    {
        "Sir Henry Rawlinson": "Sir Henry Rawlinson, 1St Baronet"
    },
    {
        ", an officer of the ": null
    },
    {
        "British East India Company": "East India Company"
    },
    {
        " army assigned to the forces of the ": null
    },
    {
        "Shah": "Shah"
    },
    {
        " of Iran, began studying the inscription in earnest. As the town of Bisotuns name was anglicized as Behistun at this time, the monument became known as the Behistun Inscription . Despite its relative inaccessibility, Rawlinson was able to scale the cliff with the help of a local boy and copy the Old Persian inscription. The Elamite was across a chasm, and the Babylonian four meters above; both were beyond easy reach and were left for later.     With the Persian text, and with about a third of the ": null
    },
    {
        "syllabary": "Syllabary"
    },
    {
        " made available to him by the work of ": null
    },
    {
        "Georg Friedrich Grotefend": "Georg Friedrich Grotefend"
    },
    {
        ", Rawlinson set to work on deciphering the text. The first section of this text contained a list of the same Persian kings found in ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        " but in their original Persian forms as opposed to Herodotuss Greek ": null
    },
    {
        "transliterations": "Transliteration"
    },
    {
        "; for example Darius is given as the original Dâryavuš instead of the Hellenized Δαρειος. By matching the names and the characters, Rawlinson deciphered the type of cuneiform used for Old Persian by 1838 and presented his results to the ": null
    },
    {
        "Royal Asiatic Society": "Royal Asiatic Society"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        " and the ": null
    },
    {
        "Société Asiatique": "Société Asiatique"
    },
    {
        " in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ".     In the interim, Rawlinson spent a brief tour of duty in ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ", returning to the site in 1843. He first crossed a chasm between the Persian and Elamite scripts by bridging the gap with planks, subsequently copying the Elamite inscription. He found an enterprising local boy to climb up a crack in the cliff and suspend ropes across the Babylonian writing, so that ": null
    },
    {
        "papier-mâché": "Papier-Mâché"
    },
    {
        " casts of the inscriptions could be taken. Rawlinson, along with several other scholars, most notably ": null
    },
    {
        "Edward Hincks": "Edward Hincks"
    },
    {
        ", ": null
    },
    {
        "Julius Oppert": "Julius Oppert"
    },
    {
        ", ": null
    },
    {
        "William Henry Fox Talbot": "William Henry Fox Talbot"
    },
    {
        ", and ": null
    },
    {
        "Edwin Norris": "Edwin Norris"
    },
    {
        ", either working separately or in collaboration, eventually deciphered these inscriptions, leading eventually to the ability to read them completely.     The translation of the Old Persian sections of the Behistun Inscription paved the way to the subsequent ability to decipher the Elamite and Babylonian parts of the text, which greatly promoted the development of modern ": null
    },
    {
        "Assyriology": "Assyriology"
    },
    {
        ".            The site was visited by the American linguist ": null
    },
    {
        "A. V. Williams Jackson": "A. V. Williams Jackson"
    },
    {
        " in 1903. A. V. Williams Jackson, The Great Behistun Rock and Some Results of a Re-Examination of the Old Persian Inscriptions on It , Journal of the American Oriental Society, vol. 24, pp. 77–95, 1903 Later expeditions, in 1904 sponsored by the ": null
    },
    {
        "British Museum": "British Museum"
    },
    {
        " and led by ": null
    },
    {
        "Leonard William King": "Leonard William King"
    },
    {
        " and ": null
    },
    {
        "Reginald Campbell Thompson": "Reginald Campbell Thompson"
    },
    {
        " and in 1948 by George G. Cameron of the ": null
    },
    {
        "University of Michigan": "University Of Michigan"
    },
    {
        ", obtained photographs, casts and more accurate transcriptions of the texts, including passages that were not copied by Rawlinson.  W. King and R. C. Thompson, The sculptures and inscription of Darius the Great on the Rock of Behistûn in Persia: a new collation of the Persian, Susian and Babylonian texts, Longmans, 1907 George G. Cameron, The Old Persian Text of the Bisitun Inscription, Journal of Cuneiform Studies, vol. 5, no. 2, pp. 47–54, 1951 George G. Cameron, The Elamite Version of the Bisitun Inscriptions, Journal of Cuneiform Studies, vol. 14, no. 2, pp. 59–68, 1960 W. C. Benedict and Elizabeth von Voigtlander, Darius Bisitun Inscription, Babylonian Version, Lines 1–29, Journal of Cuneiform Studies, vol. 10, no. 1, pp. 1–10, 1956   It also became apparent that rainwater had dissolved some areas of the limestone in which the text was inscribed, while leaving new deposits of limestone over other areas, covering the text.     In 1938, the inscription became of interest to the ": null
    },
    {
        "Nazi German": "Nazi German"
    },
    {
        " think tank": "Think Tank"
    },
    {
        " Ahnenerbe": "Ahnenerbe"
    },
    {
        ", although research plans were cancelled due to the onset of World War II.     The monument later suffered some damage from ": null
    },
    {
        "Allied": "Allies Of World War Ii"
    },
    {
        " soldiers using it for target practice in ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", and during the ": null
    },
    {
        "Anglo-Soviet invasion of Iran": "Anglo-Soviet Invasion Of Iran"
    },
    {
        ".      In 1999, Iranian archeologists began the documentation and assessment of damages to the site incurred during the 20th century. Malieh Mehdiabadi, who was ": null
    },
    {
        "project manager": "Project Manager"
    },
    {
        " for the effort, described a ": null
    },
    {
        "photogrammetric": "Photogrammetry"
    },
    {
        " process by which two-dimensional photos were taken of the inscriptions using two cameras and later transmuted into 3-D images.      In recent years, Iranian archaeologists have been undertaking conservation works. The site became a ": null
    },
    {
        "UNESCO": "Unesco"
    },
    {
        " World Heritage Site": "World Heritage Site"
    },
    {
        " in 2006.      In 2012, the Bisotun Cultural Heritage Center organized an international effort to re-examine the inscription.  Intl. experts to reread Bisotun inscriptions, Tehran Times, May 27, 2012          :Main article: Full translation of the Behistun Inscription            In the first section of the inscription, Darius the Great declares his ancestry and lineage:               Darius also lists the territories under his rule:              Later in the inscription, Darius provides an eye-witness account of battles he successfully fought over a one year period to put down rebellions which had resulted from the deaths of Cyrus the Great, and his son Cambyses II:     Behistun Relief, Assina.jpg| Relief of ": null
    },
    {
        "Âššina": "Âššina"
    },
    {
        "  I am king of Elam .     Behistun Relief Nidintu-Bêl.jpg| Relief of ": null
    },
    {
        "Nidintu-Bêl": "Nidintu-Bêl"
    },
    {
        " I am Nebuchadnezzar, the son of Nabonidus . I am king of Babylon .    Behistun Relief, Tritantaechmes.jpg|Relief of ": null
    },
    {
        "Tritantaechmes": "Tritantaechmes"
    },
    {
        " I am king of Sagartia , from the family of Cyaxares .    Behistun relief Arakha.jpg|Relief of ": null
    },
    {
        "Arakha": "Arakha"
    },
    {
        " I am Nebuchadnezzar , the son of Nabonidus . I am king in Babylon.    Behistun relief Frada.jpg|Relief of Frâda: This is Frâda. He lied, saying  I am king of Margiana .    Behistun relief Skunkha.jpg|Behistun relief of ": null
    },
    {
        "Skunkha": "Skunkha"
    },
    {
        ". Label: This is Skunkha the ": null
    },
    {
        "Sacan": "Saka"
    },
    {
        ".           The site covers an area of 116 hectares. Archeological evidence indicates that this region became a human shelter 40,000 years ago. There are 18 historical monuments other than the inscription of Darius the Great in the Behistun complex that have been registered in the Iranian national list of historical sites. Some of them are:         ": null
    },
    {
        "Farhād Tarāsh": "Farhād Tarāsh"
    },
    {
        " Median": "Medes"
    },
    {
        " fortress   ": null
    },
    {
        "Parthia": "Parthia"
    },
    {
        "n town   ": null
    },
    {
        "Statue of Hercules in Behistun": "Statue Of Hercules In Behistun"
    },
    {
        " Parthia": "Parthia"
    },
    {
        "n site of worship    ": null
    },
    {
        "Behistun Palace": "Behistun Palace"
    },
    {
        "    Ilkhanid": "Ilkhanate"
    },
    {
        " caravanserai": "Caravanserai"
    },
    {
        " Mithridates II of Parthia": "Mithridates Ii Of Parthia"
    },
    {
        " Gotarzes II of Parthia": "Gotarzes Ii Of Parthia"
    },
    {
        "    Sheikh Ali khan Zangeneh": "Sheikh Ali Khan Zangeneh"
    },
    {
        " text endowment   ": null
    },
    {
        "Safavid": "Safavid"
    },
    {
        " caravanserai": "Caravanserai"
    },
    {
        " Vologasess relief": "Vologasess Relief"
    },
    {
        " Royal Road": "Royal Road"
    },
    {
        "    Mithridates II of Parthia": "Mithridates Ii Of Parthia"
    },
    {
        " Gotarzes II": "Gotarzes Ii"
    },
    {
        "                The ": null
    },
    {
        "Anubanini rock relief": "Anubanini Rock Relief"
    },
    {
        ", also called Sarpol-i Zohab, of the ": null
    },
    {
        "Lullubi": "Lullubi"
    },
    {
        " king ": null
    },
    {
        "Anubanini": "Anubanini"
    },
    {
        ", dated to , and which is located not far from the Behistun reliefs at ": null
    },
    {
        "Sarpol-e Zahab": "Sarpol-E Zahab"
    },
    {
        ", is very similar to the reliefs at Behistun. The attitude of the ruler, the trampling of an enemy, the lines of prisoners are all very similar, to such extent that it was said that the sculptors of the Behistun Inscription probably have seen the Anubanini relief beforehand and were inspired by it.  The ": null
    },
    {
        "Lullubian": "Lullubi"
    },
    {
        " reliefs were the model for the Behistun reliefs of ": null
    },
    {
        "Darius the Great": "Darius The Great"
    },
    {
        ".      The inscriptional tradition of the Achaemenids, starting especially with ": null
    },
    {
        "Darius I": "Darius I"
    },
    {
        ", is thought to have derived from the traditions of ": null
    },
    {
        "Elam": "Elam"
    },
    {
        ", ": null
    },
    {
        "Lullubi": "Lullubi"
    },
    {
        ", the ": null
    },
    {
        "Babylonians": "Babylonians"
    },
    {
        " and the ": null
    },
    {
        "Assyria": "Assyria"
    },
    {
        "ns. ": null
    }
]