[
    {
        "              A bestiary, or bestiarum vocabulum, is a ": null
    },
    {
        "compendium": "Compendium"
    },
    {
        " of beasts. Originating in the ": null
    },
    {
        "ancient world": "Ancient History"
    },
    {
        ", bestiaries were made popular in the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        " in illustrated volumes that described various animals and even rocks. The ": null
    },
    {
        "natural history": "Natural History"
    },
    {
        " and illustration of each beast was usually accompanied by a moral lesson. This reflected the belief that the world itself was the Word of God, and that every living thing had its own special meaning. For example, the ": null
    },
    {
        "pelican": "Pelican"
    },
    {
        ", which was believed to tear open its breast to bring its young to life with its own blood, was a living representation of ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        ". The bestiary, then, is also a reference to the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        "ic language of ": null
    },
    {
        "animals in Western Christian art": "Animals In Christian Art"
    },
    {
        " and literature.       The earliest bestiary in the form in which it was later popularized was an anonymous 2nd-century ": null
    },
    {
        "Greek": "Ancient Greek"
    },
    {
        " volume called the  Physiologus , which itself summarized ancient knowledge and wisdom about animals in the writings of ": null
    },
    {
        "classical": "Classical Antiquity"
    },
    {
        " authors such as ": null
    },
    {
        "Aristotles": "Aristotle"
    },
    {
        "  Historia Animalium  and various works by ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        ", ": null
    },
    {
        "Pliny the Elder": "Pliny The Elder"
    },
    {
        ", ": null
    },
    {
        "Solinus": "Solinus"
    },
    {
        ", ": null
    },
    {
        "Aelian": "Claudius Aelianus"
    },
    {
        " and other naturalists.     Following the Physiologus, Saint ": null
    },
    {
        "Isidore of Seville": "Isidore Of Seville"
    },
    {
        "  and ": null
    },
    {
        "Saint Ambrose": "Saint Ambrose"
    },
    {
        " expanded the religious message with reference to passages from the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        " and the ": null
    },
    {
        "Septuagint": "Septuagint"
    },
    {
        ". They and other authors freely expanded or modified pre-existing models, constantly refining the moral content without interest or access to much more detail regarding the factual content. Nevertheless, the often fanciful accounts of these beasts were widely read and generally believed to be true. A few observations found in bestiaries, such as the ": null
    },
    {
        "migration": "Bird Migration"
    },
    {
        " of birds, were discounted by the ": null
    },
    {
        "natural philosophers": "Natural Philosophy"
    },
    {
        " of later centuries, only to be rediscovered in the modern scientific era.     Medieval bestiaries are remarkably similar in sequence of the animals of which they treat. Bestiaries were particularly popular in ": null
    },
    {
        "England": "England"
    },
    {
        " and ": null
    },
    {
        "France": "France"
    },
    {
        " around the 12th century and were mainly compilations of earlier texts. The ": null
    },
    {
        "Aberdeen Bestiary": "Aberdeen Bestiary"
    },
    {
        " is one of the best known of over 50 manuscript bestiaries surviving today.     Bestiaries influenced early ": null
    },
    {
        "heraldry": "Heraldry"
    },
    {
        " in the Middle Ages, giving ideas for ": null
    },
    {
        "charges": "Charge"
    },
    {
        " and also for the artistic form. Bestiaries continue to give inspiration to coats of arms created in our time.      Two illuminated ": null
    },
    {
        "Psalters": "Psalter"
    },
    {
        ", the ": null
    },
    {
        "Queen Mary Psalter": "Queen Mary Psalter"
    },
    {
        "  and the ": null
    },
    {
        "Isabella Psalter": "Isabella Psalter"
    },
    {
        " , contain full Bestiary cycles. The bestiary in the Queen Mary Psalter is found in the marginal decorations that occupy about the bottom quarter of the page, and are unusually extensive and coherent in this work. In fact the bestiary has been expanded beyond the source in the Norman bestiary of Guillaume le Clerc to ninety animals. Some are placed in the text to make correspondences with the ": null
    },
    {
        "psalm": "Psalm"
    },
    {
        " they are illustrating. The Queen Mary psalter: a study of affect and audience By Anne Rudloff Stanton, p44ff, Diane Publishing     The Italian artist ": null
    },
    {
        "Leonardo da Vinci": "Leonardo Da Vinci"
    },
    {
        " also made his own bestiary.      A volucrary is a similar collection of the symbols of birds that is sometimes found in conjunction with bestiaries. The most widely known volucrary in the Renaissance was ": null
    },
    {
        "Johannes de Cubas": "Johannes De Cuba"
    },
    {
        " Gart der Gesundheit  which describes 122 birds and which was printed in 1485. Hortus sanitatis deutsch. Mainz 1485; Neudrucke München 1924 and 1966.       The contents of medieval bestiaries were often obtained and created from combining older textual sources and accounts of animals, such as the  Physiologus .      Medieval bestiaries contained detailed descriptions and illustrations of species native to Western Europe, exotic animals and what in modern times are considered to be imaginary animals. Descriptions of the animals included the physical characteristics associated with the creature, although these were often physiologically incorrect, along with the Christian morals that the animal represented. The description was then often accompanied by an artistic illustration of the animal as described in the bestiary.     Bestiaries were organized in different ways based upon the sources they drew upon.  The descriptions could be organized by animal groupings, such as terrestrial and marine creatures, or presented in an alphabetical manner. However, the texts gave no distinction between existing and imaginary animals. Descriptions of creatures such as ": null
    },
    {
        "dragons": "Dragon"
    },
    {
        ", ": null
    },
    {
        "unicorns": "Unicorn"
    },
    {
        ", ": null
    },
    {
        "basilisk": "Basilisk"
    },
    {
        ", ": null
    },
    {
        "griffin": "Griffin"
    },
    {
        " and ": null
    },
    {
        "caladrius": "Caladrius"
    },
    {
        " were common in such works and found intermingled amongst accounts of ": null
    },
    {
        "bears": "Bear"
    },
    {
        ", ": null
    },
    {
        "boars": "Wild Boar"
    },
    {
        ", ": null
    },
    {
        "deer": "Deer"
    },
    {
        ", ": null
    },
    {
        "lions": "Lion"
    },
    {
        ", and ": null
    },
    {
        "elephants": "Elephant"
    },
    {
        ".     This lack of separation has often been associated with the assumption that people during this time believed in what the modern period classifies as nonexistent or ": null
    },
    {
        "imaginary creatures": "Imaginary Creatures"
    },
    {
        " . However, this assumption is currently under debate, with various explanations being offered. Some scholars, such as ": null
    },
    {
        "Pamela Gravestock": "Pamela Gravestock"
    },
    {
        ", have written on the theory that medieval people did not actually think such creatures existed but instead focused on the belief in the importance of the Christian morals these creatures represented, and that the importance of the moral did not change regardless if the animal existed or not. The historian of science ": null
    },
    {
        "David C. Lindberg": "David C. Lindberg"
    },
    {
        " pointed out that medieval bestiaries were rich in symbolism and allegory, so as to teach moral lessons and entertain, rather than to convey knowledge of the natural world.        In modern times, artists such as ": null
    },
    {
        "Henri de Toulouse-Lautrec": "Henri De Toulouse-Lautrec"
    },
    {
        " and ": null
    },
    {
        "Saul Steinberg": "Saul Steinberg"
    },
    {
        " have produced their own bestiaries. ": null
    },
    {
        "Jorge Luis Borges": "Jorge Luis Borges"
    },
    {
        " wrote a contemporary bestiary of sorts, the  Book of Imaginary Beings , which collects imaginary beasts from bestiaries and fiction. Nicholas Christopher wrote a literary novel called The Bestiary that describes a lonely young mans efforts to track down the worlds most complete bestiary. ": null
    },
    {
        "John Henry Flemings": "John Henry Fleming"
    },
    {
        "  Fearsome Creatures of Florida   borrows from the medieval bestiary tradition to impart moral lessons about the environment. ": null
    },
    {
        "Caspar Hendersons": "Caspar Henderson"
    },
    {
        "  The Book of Barely Imagined Beings   , subtitled A 21st Century Bestiary , explores how humans imagine animals in a time of rapid environmental change. In July 2014, Jonathan Scott wrote The Blessed Book of Beasts,  Eastern Christian Publications, featuring 101 animals from the various translations of the Bible, in keeping with the tradition of the bestiary found in the writings of the Saints, including ": null
    },
    {
        "Saint John Chrysostom": "John Chrysostom"
    }
]