[
    {
        "   In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", a bijection, bijective function, or one-to-one correspondence is a ": null
    },
    {
        "function": "Function"
    },
    {
        " between the elements of two ": null
    },
    {
        "sets": "Set"
    },
    {
        ", where each element of one set is paired with exactly one element of the other set, and each element of the other set is paired with exactly one element of the first set. There are no unpaired elements. In mathematical terms, a bijective function  is a ": null
    },
    {
        "one-to-one ": "Injective Function"
    },
    {
        " and ": null
    },
    {
        "onto ": "Surjective Function"
    },
    {
        " mapping of a set X to a set Y. The term one-to-one correspondence must not be confused with one-to-one function  .        A bijection from the set X to the set Y has an ": null
    },
    {
        "inverse function": "Inverse Function"
    },
    {
        " from Y to X. If X and Y are ": null
    },
    {
        "finite set": "Finite Set"
    },
    {
        "s, then the existence of a bijection means they have the same number of elements. For ": null
    },
    {
        "infinite sets": "Infinite Set"
    },
    {
        "the picture is more complicated, leading to the concept of ": null
    },
    {
        "cardinal number": "Cardinal Number"
    },
    {
        ", a way to distinguish the various sizes of infinite sets.     A bijective function from a set to itself is also called a  permutation .     Bijective functions are essential to many areas of mathematics including the definitions of ": null
    },
    {
        "isomorphism": "Isomorphism"
    },
    {
        ", ": null
    },
    {
        "homeomorphism": "Homeomorphism"
    },
    {
        ", ": null
    },
    {
        "diffeomorphism": "Diffeomorphism"
    },
    {
        ", ": null
    },
    {
        "permutation group": "Permutation Group"
    },
    {
        ", and ": null
    },
    {
        "projective map": "Projective Map"
    },
    {
        ".          For a pairing between X and Y  to be a bijection, four properties must hold:   each element of X must be paired with at least one element of Y,   no element of X may be paired with more than one element of Y,   each element of Y must be paired with at least one element of X, and   no element of Y may be paired with more than one element of X.     Satisfying properties and means that a bijection is a ": null
    },
    {
        "function": "Function"
    },
    {
        " with ": null
    },
    {
        "domain": "Domain Of A Function"
    },
    {
        " X. It is more common to see properties and written as a single statement: Every element of X is paired with exactly one element of Y. Functions which satisfy property are said to be ": null
    },
    {
        "onto": "Onto"
    },
    {
        " Y and are called ": null
    },
    {
        "surjections": "Surjective Function"
    },
    {
        " . Functions which satisfy property are said to be ": null
    },
    {
        "one-to-one functions": "One-To-One Function"
    },
    {
        " and are called ": null
    },
    {
        "injections": "Injective Function"
    },
    {
        " . There are names associated to properties and as well. A relation which satisfies property is called a total relation and a relation satisfying is a single valued relation. With this terminology, a bijection is a function which is both a surjection and an injection, or using other words, a bijection is a function which is both one-to-one and onto .     Bijections are sometimes denoted by a two-headed rightwards arrow with tail , as in f : X ⤖ Y. This symbol is a combination of the two-headed rightwards arrow  sometimes used to denote surjections and the rightwards arrow with a barbed tail  sometimes used to denote injections.           Consider the ": null
    },
    {
        "batting line-up": "Batting Order"
    },
    {
        " of a ": null
    },
    {
        "baseball": "Baseball"
    },
    {
        " or ": null
    },
    {
        "cricket": "Cricket"
    },
    {
        " team . The set X will be the players on the team and the set Y will be the positions in the batting order The pairing is given by which player is in what position in this order. Property is satisfied since each player is somewhere in the list. Property is satisfied since no player bats in two positions in the order. Property says that for each position in the order, there is some player batting in that position and property states that two or more players are never batting in the same position in the list.       In a classroom there are a certain number of seats. A bunch of students enter the room and the instructor asks them all to be seated. After a quick look around the room, the instructor declares that there is a bijection between the set of students and the set of seats, where each student is paired with the seat they are sitting in. What the instructor observed in order to reach this conclusion was that:   Every student was in a seat ,   No student was in more than one seat,   Every seat had someone sitting there , and   No seat had more than one student in it.   The instructor was able to conclude that there were just as many seats as there were students, without having to count either set.       For any set X, the ": null
    },
    {
        "identity function": "Identity Function"
    },
    {
        " 1 X : X → X, 1 X  x, is bijective.   The function fR → R, f 2x + 1 is bijective, since for each y there is a unique x /2 such that f y. In more generality, any ": null
    },
    {
        "linear function": "Linear Function"
    },
    {
        " over the reals, fR → R, f ax + b  is a bijection. Each real number y is obtained from the real number x /a.   The function fR → , given by f arctan is bijective since each real number x is paired with exactly one angle y in the interval so that tan x . If the ": null
    },
    {
        "codomain": "Codomain"
    },
    {
        " was made larger to include an integer multiple of π/2 then this function would no longer be onto since there is no real number which could be paired with the multiple of π/2 by this arctan function.   The ": null
    },
    {
        "exponential function": "Exponential Function"
    },
    {
        ", gR → R, g e x , is not bijective: for instance, there is no x in R such that g −1, showing that g is not onto . However, if the codomain is restricted to the positive real numbers         , then g becomes bijective; its inverse is the ": null
    },
    {
        "natural logarithm": "Natural Logarithm"
    },
    {
        " function ln.   The function hR → R + , h x 2 is not bijective: for instance, h h 1, showing that h is not one-to-one . However, if the ": null
    },
    {
        "domain": "Domain Of A Function"
    },
    {
        " is restricted to       + indicated by fX → Y in ": null
    },
    {
        "functional notation": "Function Notation"
    },
    {
        "by turning the arrows around3412x": null
    },
    {
        "themati": "Themati"
    },
    {
        "g   f-1fg": null
    },
    {
        "ftrig": "Ftrig"
    },
    {
        "equinumerosity": "Equinumerosity"
    },
    {
        "∘": null
    },
    {
        "geb": "Geb"
    },
    {
        "XX ": null
    },
    {
        "factorial": "Factorial"
    },
    {
        "AB": null
    },
    {
        "themati": "Themati"
    },
    {
        "themati": "Themati"
    },
    {
        "themati": "Themati"
    },
    {
        "properwhich turns out to be a partial functionfunction ": null
    }
]