[
    {
        "                 Bioinformatics  is an ": null
    },
    {
        "interdisciplinary": "Interdisciplinary"
    },
    {
        " field that develops methods and ": null
    },
    {
        "software tools": "Software Tool"
    },
    {
        " for understanding ": null
    },
    {
        "biological": "Biology"
    },
    {
        " data. As an interdisciplinary field of science, bioinformatics combines ": null
    },
    {
        "biology": "Biology"
    },
    {
        ", ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        ", ": null
    },
    {
        "information engineering": "Information Engineering"
    },
    {
        ", ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " and ": null
    },
    {
        "statistics": "Statistics"
    },
    {
        " to analyze and interpret biological data. Bioinformatics has been used for  in silico  analyses of biological queries using mathematical and statistical techniques.     Bioinformatics includes biological studies that use ": null
    },
    {
        "computer programming": "Computer Programming"
    },
    {
        " as part of their methodology, as well as a specific analysis pipelines that are repeatedly used, particularly in the field of ": null
    },
    {
        "genomics": "Genomics"
    },
    {
        ". Common uses of bioinformatics include the identification of candidates ": null
    },
    {
        "genes": "Gene"
    },
    {
        " and single ": null
    },
    {
        "nucleotide": "Nucleotide"
    },
    {
        " polymorphisms . Often, such identification is made with the aim of better understanding the genetic basis of disease, unique adaptations, desirable properties , or differences between populations. In a less formal way, bioinformatics also tries to understand the organisational principles within ": null
    },
    {
        "nucleic acid": "Nucleic Acid"
    },
    {
        " and ": null
    },
    {
        "protein": "Protein"
    },
    {
        " sequences, called ": null
    },
    {
        "proteomics": "Proteomics"
    },
    {
        ".        Bioinformatics has become an important part of many areas of biology. In experimental ": null
    },
    {
        "molecular biology": "Molecular Biology"
    },
    {
        ", bioinformatics techniques such as ": null
    },
    {
        "image": "Image Processing"
    },
    {
        " and ": null
    },
    {
        "signal processing": "Signal Processing"
    },
    {
        " allow extraction of useful results from large amounts of raw data. In the field of genetics, it aids in sequencing and annotating genomes and their observed ": null
    },
    {
        "mutations": "Mutation"
    },
    {
        ". It plays a role in the ": null
    },
    {
        "text mining": "Text Mining"
    },
    {
        " of biological literature and the development of biological and gene ": null
    },
    {
        "ontologies": "Ontology"
    },
    {
        " to organize and query biological data. It also plays a role in the analysis of gene and protein expression and regulation. Bioinformatics tools aid in comparing, analyzing and interpreting of genetic and genomic data and more generally in the understanding of evolutionary aspects of molecular biology. At a more integrative level, it helps analyze and catalogue the biological pathways and networks that are an important part of ": null
    },
    {
        "systems biology": "Systems Biology"
    },
    {
        ". In ": null
    },
    {
        "structural biology": "Structural Biology"
    },
    {
        ", it aids in the simulation and modeling of DNA,  RNA,  proteins  as well as biomolecular interactions.           Historically, the term bioinformatics did not mean what it means today. ": null
    },
    {
        "Paulien Hogeweg": "Paulien Hogeweg"
    },
    {
        " and ": null
    },
    {
        "Ben Hesper": "Ben Hesper"
    },
    {
        " coined it in 1970 to refer to the study of information processes in biotic systems.    This definition placed bioinformatics as a field parallel to ": null
    },
    {
        "biochemistry": "Biochemistry"
    },
    {
        " .            Computers became essential in molecular biology when ": null
    },
    {
        "protein sequences": "Protein Sequences"
    },
    {
        " became available after ": null
    },
    {
        "Frederick Sanger": "Frederick Sanger"
    },
    {
        " determined the sequence of ": null
    },
    {
        "insulin": "Insulin"
    },
    {
        " in the early 1950s. Comparing multiple sequences manually turned out to be impractical. A pioneer in the field was ": null
    },
    {
        "Margaret Oakley Dayhoff": "Margaret Oakley Dayhoff"
    },
    {
        ".  She compiled one of the first protein sequence databases, initially published as books Dayhoff, M.O. Atlas of protein sequence and structure. National Biomedical Research Foundation, 215 pp. and pioneered methods of sequence alignment and molecular evolution.  Another early contributor to bioinformatics was ": null
    },
    {
        "Elvin A. Kabat": "Elvin A. Kabat"
    },
    {
        ", who pioneered biological sequence analysis in 1970 with his comprehensive volumes of antibody sequences released with Tai Te Wu between 1980 and 1991.        To study how normal cellular activities are altered in different disease states, the biological data must be combined to form a comprehensive picture of these activities. Therefore, the field of bioinformatics has evolved such that the most pressing task now involves the analysis and interpretation of various types of data. This includes nucleotide and ": null
    },
    {
        "amino acid sequences": "Amino Acid Sequence"
    },
    {
        ", ": null
    },
    {
        "protein domains": "Protein Domain"
    },
    {
        ", and ": null
    },
    {
        "protein structures": "Protein Structure"
    },
    {
        ".  The actual process of analyzing and interpreting data is referred to as ": null
    },
    {
        "computational biology": "Computational Biology"
    },
    {
        ". Important sub-disciplines within bioinformatics and computational biology include:     Development and implementation of computer programs that enable efficient access to, management and use of, various types of information   Development of new algorithms and statistical measures that assess relationships among members of large data sets. For example, there are methods to locate a ": null
    },
    {
        "gene": "Gene"
    },
    {
        " within a sequence, to predict protein structure and/or function, and to ": null
    },
    {
        "cluster": "Cluster Analysis"
    },
    {
        " protein sequences into families of related sequences.     The primary goal of bioinformatics is to increase the understanding of biological processes. What sets it apart from other approaches, however, is its focus on developing and applying computationally intensive techniques to achieve this goal. Examples include: ": null
    },
    {
        "pattern recognition": "Pattern Recognition"
    },
    {
        ", ": null
    },
    {
        "data mining": "Data Mining"
    },
    {
        ", ": null
    },
    {
        "machine learning": "Machine Learning"
    },
    {
        " algorithms, and ": null
    },
    {
        "visualization": "Biological Data Visualization"
    },
    {
        ". Major research efforts in the field include ": null
    },
    {
        "sequence alignment": "Sequence Alignment"
    },
    {
        ", ": null
    },
    {
        "gene finding": "Gene Finding"
    },
    {
        ", ": null
    },
    {
        "genome assembly": "Genome Assembly"
    },
    {
        ", ": null
    },
    {
        "drug design": "Drug Design"
    },
    {
        ", ": null
    },
    {
        "drug discovery": "Drug Discovery"
    },
    {
        ", ": null
    },
    {
        "protein structure alignment": "Protein Structural Alignment"
    },
    {
        ", ": null
    },
    {
        "protein structure prediction": "Protein Structure Prediction"
    },
    {
        ", prediction of ": null
    },
    {
        "gene expression": "Gene Expression"
    },
    {
        " and ": null
    },
    {
        "protein–protein interactions": "Protein–Protein Interactions"
    },
    {
        ", ": null
    },
    {
        "genome-wide association studies": "Genome-Wide Association Studies"
    },
    {
        ", the modeling of ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        " and ": null
    },
    {
        "cell division/mitosis.": "Cellular Model"
    },
    {
        "     Bioinformatics now entails the creation and advancement of databases, algorithms, computational and statistical techniques, and theory to solve formal and practical problems arising from the management and analysis of biological data.     Over the past few decades, rapid developments in genomic and other molecular research technologies and developments in ": null
    },
    {
        "information technologies": "Information Technologies"
    },
    {
        " have combined to produce a tremendous amount of information related to molecular biology. Bioinformatics is the name given to these mathematical and computing approaches used to glean understanding of biological processes.     Common activities in bioinformatics include mapping and analyzing ": null
    },
    {
        "DNA": "Dna"
    },
    {
        " and protein sequences, aligning DNA and protein sequences to compare them, and creating and viewing 3-D models of protein structures.       Bioinformatics is a science field that is similar to but distinct from ": null
    },
    {
        "biological computation": "Biological Computation"
    },
    {
        ", while it is often considered synonymous to ": null
    },
    {
        "computational biology": "Computational Biology"
    },
    {
        ". Biological computation uses ": null
    },
    {
        "bioengineering": "Bioengineering"
    },
    {
        " and ": null
    },
    {
        "biology": "Biology"
    },
    {
        " to build biological ": null
    },
    {
        "computers": "Computer"
    },
    {
        ", whereas bioinformatics uses computation to better understand biology. Bioinformatics and computational biology involve the analysis of biological data, particularly DNA, RNA, and protein sequences. The field of bioinformatics experienced explosive growth starting in the mid-1990s, driven largely by the ": null
    },
    {
        "Human Genome Project": "Human Genome Project"
    },
    {
        " and by rapid advances in DNA sequencing technology.     Analyzing biological data to produce meaningful information involves writing and running software programs that use ": null
    },
    {
        "algorithms": "Algorithm"
    },
    {
        " from ": null
    },
    {
        "graph theory": "Graph Theory"
    },
    {
        ", ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        ", ": null
    },
    {
        "soft computing": "Soft Computing"
    },
    {
        ", ": null
    },
    {
        "data mining": "Data Mining"
    },
    {
        ", ": null
    },
    {
        "image processing": "Image Processing"
    },
    {
        ", and ": null
    },
    {
        "computer simulation": "Computer Simulation"
    },
    {
        ". The algorithms in turn depend on theoretical foundations such as ": null
    },
    {
        "discrete mathematics": "Discrete Mathematics"
    },
    {
        ", ": null
    },
    {
        "control theory": "Control Theory"
    },
    {
        ", ": null
    },
    {
        "system theory": "System Theory"
    },
    {
        ", ": null
    },
    {
        "information theory": "Information Theory"
    },
    {
        ", and ": null
    },
    {
        "statistics": "Statistics"
    },
    {
        ".               Since the ": null
    },
    {
        "Phage Φ-X174": "Phi X 174"
    },
    {
        " was ": null
    },
    {
        "sequenced": "Sequencing"
    },
    {
        " in 1977,  the ": null
    },
    {
        "DNA sequences": "Dna Sequence"
    },
    {
        " of thousands of organisms have been decoded and stored in databases. This sequence information is analyzed to determine genes that encode ": null
    },
    {
        "proteins": "Protein"
    },
    {
        ", RNA genes, regulatory sequences, structural motifs, and repetitive sequences. A comparison of genes within a ": null
    },
    {
        "species": "Species"
    },
    {
        " or between different species can show similarities between protein functions, or relations between species . With the growing amount of data, it long ago became impractical to analyze DNA sequences manually. Today, ": null
    },
    {
        "computer programs": "Computer Program"
    },
    {
        " such as ": null
    },
    {
        "BLAST": "Blast"
    },
    {
        " are used daily to search sequences from more than 260 000 organisms, containing over 190 billion ": null
    },
    {
        "nucleotides": "Nucleotide"
    },
    {
        ".  These programs can compensate for mutations in the DNA sequence, to identify sequences that are related, but not identical. A variant of this ": null
    },
    {
        "sequence alignment": "Sequence Alignment"
    },
    {
        " is used in the sequencing process itself. For the special task of taxonomic classification of sequence snippets, modern ": null
    },
    {
        "k-mer": "K-Mer"
    },
    {
        " based software like Kraken achieves throughput unreachable by alignment methods.          Before sequences can be analyzed they have to be obtained from the data storage bank example the Genbank. ": null
    },
    {
        "DNA sequencing": "Dna Sequencing"
    },
    {
        " is still a non-trivial problem as the raw data may be noisy or afflicted by weak signals. ": null
    },
    {
        "Algorithms": "Algorithm"
    },
    {
        " have been developed for ": null
    },
    {
        "base calling": "Base Calling"
    },
    {
        " for the various experimental approaches to DNA sequencing.          Most DNA sequencing techniques produce short fragments of sequence that need to be assembled to obtain complete gene or genome sequences. The so-called ": null
    },
    {
        "shotgun sequencing": "Shotgun Sequencing"
    },
    {
        " technique   generates the sequences of many thousands of small DNA fragments . The ends of these fragments overlap and, when aligned properly by a genome assembly program, can be used to reconstruct the complete genome. Shotgun sequencing yields sequence data quickly, but the task of assembling the fragments can be quite complicated for larger genomes. For a genome as large as the ": null
    },
    {
        "human genome": "Human Genome"
    },
    {
        ", it may take many days of CPU time on large-memory, multiprocessor computers to assemble the fragments, and the resulting assembly usually contains numerous gaps that must be filled in later. Shotgun sequencing is the method of choice for virtually all genomes sequenced today, and genome assembly algorithms are a critical area of bioinformatics research.                 In the context of ": null
    },
    {
        "genomics": "Genomics"
    },
    {
        ", ": null
    },
    {
        "annotation": "Genome Projectgenome Annotation"
    },
    {
        " is the process of marking the genes and other biological features in a DNA sequence. This process needs to be automated because most genomes are too large to annotate by hand, not to mention the desire to annotate as many genomes as possible, as the rate of ": null
    },
    {
        "sequencing": "Dna Sequencing"
    },
    {
        " has ceased to pose a bottleneck. Annotation is made possible by the fact that genes have recognisable start and stop regions, although the exact sequence found in these regions can vary between genes.     The first description of a comprehensive genome annotation system was published in 1995 by the team at ": null
    },
    {
        "The Institute for Genomic Research": "The Institute For Genomic Research"
    },
    {
        " that performed the first complete sequencing and analysis of the genome of a free-living organism, the bacterium  Haemophilus influenzae . ": null
    },
    {
        "Owen White": "Owen White"
    },
    {
        " designed and built a software system to identify the genes encoding all proteins, transfer RNAs, ribosomal RNAs and to make initial functional assignments. Most current genome annotation systems work similarly, but the programs available for analysis of genomic DNA, such as the ": null
    },
    {
        "GeneMark": "Genemark"
    },
    {
        " program trained and used to find protein-coding genes in  Haemophilus influenzae , are constantly changing and improving.     Following the goals that the Human Genome Project left to achieve after its closure in 2003, a new project developed by the National Human Genome Research Institute in the U.S appeared. The so-called ": null
    },
    {
        "ENCODE": "Encode"
    },
    {
        " project is a collaborative data collection of the functional elements of the human genome that uses next-generation DNA-sequencing technologies and genomic tiling arrays, technologies able to automatically generate large amounts of data at a dramatically reduced per-base cost but with the same accuracy and fidelity .            ": null
    },
    {
        "Evolutionary biology": "Evolutionary Biology"
    },
    {
        " is the study of the origin and descent of ": null
    },
    {
        "species": "Species"
    },
    {
        ", as well as their change over time. ": null
    },
    {
        "Informatics": "Informatics"
    },
    {
        " has assisted evolutionary biologists by enabling researchers to:   trace the evolution of a large number of organisms by measuring changes in their ": null
    },
    {
        "DNA": "Dna"
    },
    {
        ", rather than through physical taxonomy or physiological observations alone,   compare entire ": null
    },
    {
        "genomes": "Genomes"
    },
    {
        ", which permits the study of more complex evolutionary events, such as ": null
    },
    {
        "gene duplication": "Gene Duplication"
    },
    {
        ", ": null
    },
    {
        "horizontal gene transfer": "Horizontal Gene Transfer"
    },
    {
        ", and the prediction of factors important in bacterial ": null
    },
    {
        "speciation": "Speciation"
    },
    {
        ",   build complex computational ": null
    },
    {
        "population genetics": "Population Genetics"
    },
    {
        " models to predict the outcome of the system over time    track and share information on an increasingly large number of species and organisms   Future work endeavours to reconstruct the now more complex ": null
    },
    {
        "tree of life": "Evolutionary Tree"
    },
    {
        ".     The area of research within ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        " that uses ": null
    },
    {
        "genetic algorithms": "Genetic Algorithm"
    },
    {
        " is sometimes confused with computational evolutionary biology, but the two areas are not necessarily related.            The core of comparative genome analysis is the establishment of the correspondence between ": null
    },
    {
        "genes": "Genes"
    },
    {
        "  or other genomic features in different organisms. It is these intergenomic maps that make it possible to trace the evolutionary processes responsible for the divergence of two genomes. A multitude of evolutionary events acting at various organizational levels shape genome evolution. At the lowest level, point mutations affect individual nucleotides. At a higher level, large chromosomal segments undergo duplication, lateral transfer, inversion, transposition, deletion and insertion.  Ultimately, whole genomes are involved in processes of hybridization, polyploidization and ": null
    },
    {
        "endosymbiosis": "Endosymbiosis"
    },
    {
        ", often leading to rapid speciation. The complexity of genome evolution poses many exciting challenges to developers of mathematical models and algorithms, who have recourse to a spectrum of algorithmic, statistical and mathematical techniques, ranging from exact, ": null
    },
    {
        "heuristics": "Heuristics"
    },
    {
        ", fixed parameter and ": null
    },
    {
        "approximation algorithms": "Approximation Algorithms"
    },
    {
        " for problems based on parsimony models to ": null
    },
    {
        "Markov chain Monte Carlo": "Markov Chain Monte Carlo"
    },
    {
        " algorithms for ": null
    },
    {
        "Bayesian analysis": "Bayesian Analysis"
    },
    {
        " of problems based on probabilistic models.     Many of these studies are based on the detection of ": null
    },
    {
        "sequence homology": "Sequence Homology"
    },
    {
        " to assign sequences to ": null
    },
    {
        "protein families": "Protein Family"
    },
    {
        ".             Pan genomics is a concept introduced in 2005 by Tettelin and Medini which eventually took root in bioinformatics. Pan genome is the complete gene repertoire of a particular taxonomic group: although initially applied to closely related strains of a species, it can be applied to a larger context like genus, phylum etc. It is divided in two parts- The Core genome: Set of genes common to all the genomes under study and The Dispensable/Flexible Genome: Set of genes not present in all but one or some genomes under study. A bioinformatics tool BPGA can be used to characterize the Pan Genome of bacterial species.             With the advent of next-generation sequencing we are obtaining enough sequence data to map the genes of complex diseases ": null
    },
    {
        "infertility": "Infertility"
    },
    {
        ",  ": null
    },
    {
        "breast cancer": "Breast Cancer"
    },
    {
        "  or ": null
    },
    {
        "Alzheimers disease": "Alzheimers Disease"
    },
    {
        ".  Genome-wide association studies are a useful approach to pinpoint the mutations responsible for such complex diseases.  Through these studies, thousands of DNA variants have been identified that are associated with similar diseases and traits.  Furthermore, the possibility for genes to be used at prognosis, diagnosis or treatment is one of the most essential applications. Many studies are discussing both the promising ways to choose the genes to be used and the problems and pitfalls of using genes to predict disease presence or prognosis.             In ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ", the genomes of affected cells are rearranged in complex or even unpredictable ways. Massive sequencing efforts are used to identify previously unknown ": null
    },
    {
        "point mutations": "Point Mutation"
    },
    {
        " in a variety of ": null
    },
    {
        "genes": "Gene"
    },
    {
        " in cancer. Bioinformaticians continue to produce specialized automated systems to manage the sheer volume of sequence data produced, and they create new algorithms and software to compare the sequencing results to the growing collection of ": null
    },
    {
        "human genome": "Human Genome"
    },
    {
        " sequences and ": null
    },
    {
        "germline": "Germline"
    },
    {
        " polymorphisms. New physical detection technologies are employed, such as ": null
    },
    {
        "oligonucleotide": "Oligonucleotide"
    },
    {
        " microarrays to identify chromosomal gains and losses , and ": null
    },
    {
        "single-nucleotide polymorphism": "Single-Nucleotide Polymorphism"
    },
    {
        " arrays to detect known point mutations. These detection methods simultaneously measure several hundred thousand sites throughout the genome, and when used in high-throughput to measure thousands of samples, generate ": null
    },
    {
        "terabytes": "Terabyte"
    },
    {
        " of data per experiment. Again the massive amounts and new types of data generate new opportunities for bioinformaticians. The data is often found to contain considerable variability, or ": null
    },
    {
        "noise": "Noise"
    },
    {
        ", and thus ": null
    },
    {
        "Hidden Markov model": "Hidden Markov Model"
    },
    {
        " and change-point analysis methods are being developed to infer real ": null
    },
    {
        "copy number": "Copy Number Variation"
    },
    {
        " changes.     Two important principles can be used in the analysis of cancer genomes bioinformatically pertaining to the identification of mutations in the ": null
    },
    {
        "exome": "Exome"
    },
    {
        ". First, cancer is a disease of accumulated somatic mutations in genes. Second cancer contains driver mutations which need to be distinguished from passengers.      With the breakthroughs that this next-generation sequencing technology is providing to the field of Bioinformatics, cancer genomics could drastically change. These new methods and software allow bioinformaticians to sequence many cancer genomes quickly and affordably. This could create a more flexible process for classifying types of cancer by analysis of cancer driven mutations in the genome. Furthermore, tracking of patients while the disease progresses may be possible in the future with the sequence of cancer samples.      Another type of data that requires novel informatics development is the analysis of ": null
    },
    {
        "lesions": "Lesion"
    },
    {
        " found to be recurrent among many tumors.           The ": null
    },
    {
        "expression": "Gene Expression"
    },
    {
        " of many genes can be determined by measuring ": null
    },
    {
        "mRNA": "Messenger Rna"
    },
    {
        " levels with multiple techniques including ": null
    },
    {
        "microarrays": "Dna Microarray"
    },
    {
        ", ": null
    },
    {
        "expressed cDNA sequence tag": "Expressed Sequence Tag"
    },
    {
        " sequencing, ": null
    },
    {
        "serial analysis of gene expression": "Serial Analysis Of Gene Expression"
    },
    {
        " tag sequencing, ": null
    },
    {
        "massively parallel signature sequencing": "Massively Parallel Signature Sequencing"
    },
    {
        " , ": null
    },
    {
        "RNA-Seq": "Rna-Seq"
    },
    {
        ", also known as Whole Transcriptome Shotgun Sequencing , or various applications of multiplexed in-situ hybridization. All of these techniques are extremely noise-prone and/or subject to bias in the biological measurement, and a major research area in computational biology involves developing statistical tools to separate ": null
    },
    {
        "signal": "Signal"
    },
    {
        " from ": null
    },
    {
        "noise": "Noise"
    },
    {
        " in high-throughput gene expression studies.  Such studies are often used to determine the genes implicated in a disorder: one might compare microarray data from cancerous ": null
    },
    {
        "epithelial": "Epithelial"
    },
    {
        " cells to data from non-cancerous cells to determine the transcripts that are up-regulated and down-regulated in a particular population of cancer cells.       ": null
    },
    {
        "Protein microarrays": "Protein Microarray"
    },
    {
        " and high throughput ": null
    },
    {
        "mass spectrometry": "Mass Spectrometry"
    },
    {
        " can provide a snapshot of the proteins present in a biological sample. Bioinformatics is very much involved in making sense of protein microarray and HT MS data; the former approach faces similar problems as with microarrays targeted at mRNA, the latter involves the problem of matching large amounts of mass data against predicted masses from protein sequence databases, and the complicated statistical analysis of samples where multiple, but incomplete peptides from each protein are detected. Cellular protein localization in a tissue context can be achieved through affinity ": null
    },
    {
        "proteomics": "Proteomics"
    },
    {
        " displayed as spatial data based on ": null
    },
    {
        "immunohistochemistry": "Immunohistochemistry"
    },
    {
        " and ": null
    },
    {
        "tissue microarrays": "Tissue Microarray"
    },
    {
        ".        ": null
    },
    {
        "Gene regulation": "Regulation Of Gene Expression"
    },
    {
        " is the complex orchestration of events by which a signal, potentially an extracellular signal such as a ": null
    },
    {
        "hormone": "Hormone"
    },
    {
        ", eventually leads to an increase or decrease in the activity of one or more ": null
    },
    {
        "proteins": "Protein"
    },
    {
        ". Bioinformatics techniques have been applied to explore various steps in this process.     For example, gene expression can be regulated by nearby elements in the genome. Promoter analysis involves the identification and study of ": null
    },
    {
        "sequence motifs": "Sequence Motif"
    },
    {
        " in the DNA surrounding the coding region of a gene. These motifs influence the extent to which that region is transcribed into mRNA. ": null
    },
    {
        "Enhancer": "Enhancer"
    },
    {
        " elements far away from the promoter can also regulate gene expression, through three-dimensional looping interactions. These interactions can be determined by bioinformatic analysis of ": null
    },
    {
        "chromosome conformation capture": "Chromosome Conformation Capture"
    },
    {
        " experiments.     Expression data can be used to infer gene regulation: one might compare ": null
    },
    {
        "microarray": "Microarray"
    },
    {
        " data from a wide variety of states of an organism to form hypotheses about the genes involved in each state. In a single-cell organism, one might compare stages of the ": null
    },
    {
        "cell cycle": "Cell Cycle"
    },
    {
        ", along with various stress conditions . One can then apply ": null
    },
    {
        "clustering algorithms": "Cluster Analysis"
    },
    {
        " to that expression data to determine which genes are co-expressed. For example, the upstream regions of co-expressed genes can be searched for over-represented ": null
    },
    {
        "regulatory elements": "Regulatory Elements"
    },
    {
        ". Examples of clustering algorithms applied in gene clustering are ": null
    },
    {
        "k-means clustering": "K-Means Clustering"
    },
    {
        ", ": null
    },
    {
        "self-organizing maps": "Self-Organizing Map"
    },
    {
        " , ": null
    },
    {
        "hierarchical clustering": "Hierarchical Clustering"
    },
    {
        ", and ": null
    },
    {
        "consensus clustering": "Consensus Clustering"
    },
    {
        " methods.       Several approaches have been developed to analyze the location of organelles, genes, proteins, and other components within cells. This is relevant as the location of these components affects the events within a cell and thus helps us to predict the behavior of biological systems. A ": null
    },
    {
        "gene ontology": "Gene Ontology"
    },
    {
        " category, cellular compartment, has been devised to capture subcellular localization in many ": null
    },
    {
        "biological databases": "Biological Database"
    },
    {
        ".       Microscopic pictures allow us to locate both ": null
    },
    {
        "organelles": "Organelle"
    },
    {
        " as well as molecules. It may also help us to distinguish between normal and abnormal cells, e.g. in ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ".       The localization of proteins helps us to evaluate the role of a protein. For instance, if a protein is found in the ": null
    },
    {
        "nucleus": "Cell Nucleus"
    },
    {
        " it may be involved in ": null
    },
    {
        "gene regulation": "Regulation Of Gene Expression"
    },
    {
        " or ": null
    },
    {
        "splicing": "Rna Splicing"
    },
    {
        ". By contrast, if a protein is found in ": null
    },
    {
        "mitochondria": "Mitochondrion"
    },
    {
        ", it may be involved in ": null
    },
    {
        "respiration": "Cellular Respiration"
    },
    {
        " or other ": null
    },
    {
        "metabolic processes": "Metabolism"
    },
    {
        ". Protein localization is thus an important component of ": null
    },
    {
        "protein function prediction": "Protein Function Prediction"
    },
    {
        ". There are well developed ": null
    },
    {
        "protein subcellular localization prediction": "Protein Subcellular Localization Prediction"
    },
    {
        " resources available, including protein subcellular location databases, and prediction tools.            Data from high-throughput ": null
    },
    {
        "chromosome conformation capture": "Chromosome Conformation Capture"
    },
    {
        " experiments, such as ": null
    },
    {
        "Hi-C ": "Hi-C"
    },
    {
        " and ": null
    },
    {
        "ChIA-PET": "Chia-Pet"
    },
    {
        ", can provide information on the spatial proximity of DNA loci. Analysis of these experiments can determine the three-dimensional structure and ": null
    },
    {
        "nuclear organization": "Nuclear Organization"
    },
    {
        " of chromatin. Bioinformatic challenges in this field include partitioning the genome into domains, such as ": null
    },
    {
        "Topologically Associating Domains": "Topologically Associating Domain"
    },
    {
        " , that are organised together in three-dimensional space.                   Protein structure prediction is another important application of bioinformatics. The ": null
    },
    {
        "amino acid": "Amino Acid"
    },
    {
        " sequence of a protein, the so-called ": null
    },
    {
        "primary structure": "Primary Structure"
    },
    {
        ", can be easily determined from the sequence on the gene that codes for it. In the vast majority of cases, this primary structure uniquely determines a structure in its native environment.  Knowledge of this structure is vital in understanding the function of the protein. Structural information is usually classified as one of  secondary ,  tertiary  and  quaternary  structure. A viable general solution to such predictions remains an open problem. Most efforts have so far been directed towards heuristics that work most of the time.     One of the key ideas in bioinformatics is the notion of ": null
    },
    {
        "homology": "Sequence Homology"
    },
    {
        ". In the genomic branch of bioinformatics, homology is used to predict the function of a gene: if the sequence of gene A, whose function is known, is homologous to the sequence of gene B, whose function is unknown, one could infer that B may share As function. In the structural branch of bioinformatics, homology is used to determine which parts of a protein are important in structure formation and interaction with other proteins. In a technique called ": null
    },
    {
        "homology modeling": "Homology Modeling"
    },
    {
        ", this information is used to predict the structure of a protein once the structure of a homologous protein is known. This currently remains the only way to predict protein structures reliably.     One example of this is hemoglobin in humans and the hemoglobin in legumes , which are distant relatives from the same ": null
    },
    {
        "protein superfamily": "Protein Superfamily"
    },
    {
        ". Both serve the same purpose of transporting oxygen in the organism. Although both of these proteins have completely different amino acid sequences, their protein structures are virtually identical, which reflects their near identical purposes and shared ancestor.      Other techniques for predicting protein structure include protein threading and de novo physics-based modeling.     Another aspect of structural bioinformatics include the use of protein structures for ": null
    },
    {
        "Virtual Screening": "Virtual Screening"
    },
    {
        " models such as ": null
    },
    {
        "Quantitative Structure-Activity Relationship": "Qsar"
    },
    {
        " models and proteochemometric models . Furthermore, a proteins crystal structure can be used in simulation of for example ligand-binding studies and in silico mutagenesis studies.            Network analysis seeks to understand the relationships within ": null
    },
    {
        "biological networks": "Biological Network"
    },
    {
        " such as ": null
    },
    {
        "metabolic": "Metabolic Network"
    },
    {
        " or ": null
    },
    {
        "protein–protein interaction networks": "Interactome"
    },
    {
        ". Although biological networks can be constructed from a single type of molecule or entity , network biology often attempts to integrate many different data types, such as proteins, small molecules, gene expression data, and others, which are all connected physically, functionally, or both.     Systems biology involves the use of ": null
    },
    {
        "computer simulations": "Computer Simulation"
    },
    {
        " of ": null
    },
    {
        "cellular": "Cell"
    },
    {
        " subsystems  to both analyze and visualize the complex connections of these cellular processes. ": null
    },
    {
        "Artificial life": "Artificial Life"
    },
    {
        " or virtual evolution attempts to understand evolutionary processes via the computer simulation of simple life forms.               Tens of thousands of three-dimensional protein structures have been determined by ": null
    },
    {
        "X-ray crystallography": "X-Ray Crystallography"
    },
    {
        " and ": null
    },
    {
        "protein nuclear magnetic resonance spectroscopy": "Protein Nuclear Magnetic Resonance Spectroscopy"
    },
    {
        " and a central question in structural bioinformatics is whether it is practical to predict possible protein–protein interactions only based on these 3D shapes, without performing ": null
    },
    {
        "protein–protein interaction": "Protein–Protein Interaction"
    },
    {
        " experiments. A variety of methods have been developed to tackle the ": null
    },
    {
        "protein–protein docking": "Protein–Protein Docking"
    },
    {
        " problem, though it seems that there is still much work to be done in this field.     Other interactions encountered in the field include Protein–ligand and ": null
    },
    {
        "protein–peptide": "Protein–Peptide"
    },
    {
        ". Molecular dynamic simulation of movement of atoms about rotatable bonds is the fundamental principle behind computational ": null
    },
    {
        "algorithms": "Algorithm"
    },
    {
        ", termed docking algorithms, for studying ": null
    },
    {
        "molecular interactions": "Interactome"
    },
    {
        ".                The growth in the number of published literature makes it virtually impossible to read every paper, resulting in disjointed sub-fields of research. Literature analysis aims to employ computational and statistical linguistics to mine this growing library of text resources. For example:   Abbreviation recognition – identify the long-form and abbreviation of biological terms   Named entity recognition – recognizing biological terms such as gene names   Protein–protein interaction – identify which ": null
    },
    {
        "proteins": "Protein"
    },
    {
        " interact with which proteins from text     The area of research draws from ": null
    },
    {
        "statistics": "Statistics"
    },
    {
        " and ": null
    },
    {
        "computational linguistics": "Computational Linguistics"
    },
    {
        ".       Computational technologies are used to accelerate or fully automate the processing, quantification and analysis of large amounts of high-information-content ": null
    },
    {
        "biomedical imagery": "Medical Imaging"
    },
    {
        ". Modern ": null
    },
    {
        "image analysis": "Image Analysis"
    },
    {
        " systems augment an observers ability to make measurements from a large or complex set of images, by improving ": null
    },
    {
        "accuracy": "Accuracy"
    },
    {
        ", ": null
    },
    {
        "objectivity": "Objectivity"
    },
    {
        ", or speed. A fully developed analysis system may completely replace the observer. Although these systems are not unique to biomedical imagery, biomedical imaging is becoming more important for both ": null
    },
    {
        "diagnostics": "Diagnostics"
    },
    {
        " and research. Some examples are:   high-throughput and high-fidelity quantification and sub-cellular localization    ": null
    },
    {
        "morphometrics": "Morphometrics"
    },
    {
        " DNA mapping": "Gene Mapping"
    },
    {
        ", e.g. the ": null
    },
    {
        "Sulston score": "Sulston Score"
    },
    {
        "          Computational techniques are used to analyse high-throughput, low-measurement single cell data, such as that obtained from ": null
    },
    {
        "flow cytometry": "Flow Cytometry"
    },
    {
        ". These methods typically involve finding populations of cells that are relevant to a particular disease state or experimental condition.          Biodiversity informatics deals with the collection and analysis of ": null
    },
    {
        "biodiversity": "Biodiversity"
    },
    {
        " data, such as ": null
    },
    {
        "taxonomic databases": "Taxonomic Database"
    },
    {
        ", or ": null
    },
    {
        "microbiome": "Microbiome"
    },
    {
        " data. Examples of such analyses include ": null
    },
    {
        "phylogenetics": "Phylogenetics"
    },
    {
        ", ": null
    },
    {
        "niche modelling": "Niche Modelling"
    },
    {
        ", ": null
    },
    {
        "species richness": "Species Richness"
    },
    {
        " mapping, ": null
    },
    {
        "DNA barcoding": "Dna Barcoding"
    },
    {
        ", or ": null
    },
    {
        "species": "Speciesism"
    },
    {
        " identification tools.       Biological ontologies are ": null
    },
    {
        "directed acyclic graphs": "Directed Acyclic Graph"
    },
    {
        " of ": null
    },
    {
        "controlled vocabularies": "Controlled Vocabulary"
    },
    {
        ". They are designed to capture biological concepts and descriptions in a way that can be easily categorised and analysed with computers. When categorised in this way, it is possible to gain added value from holistic and integrated analysis.     The ": null
    },
    {
        "OBO Foundry": "Obo Foundry"
    },
    {
        " was an effort to standardise certain ontologies. One of the most widespread is the ": null
    },
    {
        "Gene ontology": "Gene Ontology"
    },
    {
        " which describes gene function. There are also ontologies which describe phenotypes.          Databases are essential for bioinformatics research and applications. Many databases exist, covering various information types: for example, DNA and protein sequences, molecular structures, phenotypes and biodiversity. Databases may contain empirical data , predicted data , or, most commonly, both. They may be specific to a particular organism, pathway or molecule of interest. Alternatively, they can incorporate data compiled from multiple other databases. These databases vary in their format, access mechanism, and whether they are public or not.     Some of the most commonly used databases are listed below. For a more comprehensive list, please check the link at the beginning of the subsection.     Used in biological sequence analysis: ": null
    },
    {
        "Genbank": "Genbank"
    },
    {
        ", ": null
    },
    {
        "UniProt": "Uniprot"
    },
    {
        " Protein Data Bank": "Protein Data Bank"
    },
    {
        "   Used in finding Protein Families and ": null
    },
    {
        "Motif": "Sequence Motif"
    },
    {
        " Finding: ": null
    },
    {
        "InterPro": "Interpro"
    },
    {
        ", ": null
    },
    {
        "Pfam": "Pfam"
    },
    {
        " Sequence Read Archive": "Sequence Read Archive"
    },
    {
        " KEGG": "Kegg"
    },
    {
        ", ": null
    },
    {
        "BioCyc": "Biocyc Database Collection"
    },
    {
        "mputi": "Mputi"
    },
    {
        "ftwa": "Ftwa"
    },
    {
        "BOSCSequence Search ServicesMultiple Sequence AlignmentBiological Sequence Analysis": null
    },
    {
        "mputational biolo": "Mputational Biolo"
    },
    {
        "rkflow engi": "Rkflow Engi"
    },
    {
        "ucation platfo": "Ucation Platfo"
    },
    {
        "UC San Diego": "University Of California, San Diego"
    },
    {
        "Johns Hopkins": "Johns Hopkins University"
    },
    {
        "Harvard": "Harvard University"
    },
    {
        "ISMBECCB": null
    }
]