[
    {
        "     The Bluetooth Special Interest Group  is the ": null
    },
    {
        "standards organisation": "Standards Organisation"
    },
    {
        " that oversees the development of ": null
    },
    {
        "Bluetooth": "Bluetooth"
    },
    {
        " standards": "Standardization"
    },
    {
        " and the licensing of the Bluetooth technologies and ": null
    },
    {
        "trademarks": "Trademark"
    },
    {
        " to manufacturers. The SIG is a not-for-profit, non-stock corporation founded in September 1998. The SIG is headquartered in ": null
    },
    {
        "Kirkland": "Kirkland, Washington"
    },
    {
        ", ": null
    },
    {
        "Washington": "Washington"
    },
    {
        ". The SIG has local offices in Beijing, Seoul, Tokyo, and Malmö.     The SIG does not make, manufacture or sell Bluetooth enabled products.       Bluetooth technology provides a way to exchange information between ": null
    },
    {
        "wireless": "Wireless"
    },
    {
        " devices such as ": null
    },
    {
        "personal digital assistants": "Personal Digital Assistant"
    },
    {
        " , ": null
    },
    {
        "mobile phones": "Mobile Phone"
    },
    {
        ", ": null
    },
    {
        "laptops": "Laptop"
    },
    {
        ", ": null
    },
    {
        "computers": "Computer"
    },
    {
        ", ": null
    },
    {
        "printers": "Computer Printer"
    },
    {
        " and ": null
    },
    {
        "digital cameras": "Digital Camera"
    },
    {
        " via a secure, low-cost, globally available short-range ": null
    },
    {
        "radio": "Radio"
    },
    {
        " frequency": "Frequency"
    },
    {
        " band. Originally developed by ": null
    },
    {
        "Ericsson": "Ericsson"
    },
    {
        ", Bluetooth technology is now used in many different products by many different ": null
    },
    {
        "manufacturers": "Manufacturing"
    },
    {
        ". These manufacturers must be either Associate or Promoter members of the Bluetooth SIG before they are granted early access to the Bluetooth specifications, but published Bluetooth specifications are available online via the Bluetooth SIG Website bluetooth.com.     The SIG owns the Bluetooth word mark, figure mark and combination mark. These trademarks are licensed out for use to companies that are incorporating Bluetooth wireless technology into their products. To become a licensee, a company must become a member of the Bluetooth SIG. The SIG also manages the Bluetooth SIG Qualification program, a certification process required for any product using Bluetooth wireless technology and a pre-condition of the intellectual property license for Bluetooth technology. The main tasks for the SIG are to publish the Bluetooth specifications, protect the Bluetooth trademarks and evangelize Bluetooth wireless technology. In 2016, the SIG introduced a new visual and creative identity to support Bluetooth technology as the catalyst for the Internet of Things . This change included an updated logo, a new tagline and deprecation of the Bluetooth Smart and Bluetooth Smart Ready logos.      At its inception in 1998, the Bluetooth SIG was primarily run by a staff effectively seconded from its member companies. In 2001 Tom Siep served as the groups managing director, and from 2002 to 2004 Mike McCamon led the group as its executive director. In 2004 he was replaced by ": null
    },
    {
        "Michael W. Foley": "Michael W. Foley"
    },
    {
        " . In mid-2012, Mark Powell took the reins as the SIGs current executive director. Beginning in 2002 a professional staff was hired, composed of operations, ": null
    },
    {
        "engineering": "Engineering"
    },
    {
        " and ": null
    },
    {
        "marketing": "Marketing"
    },
    {
        " specialists. From 2002 to 2004 the Bluetooth SIG was based in ": null
    },
    {
        "Overland Park, Kansas": "Overland Park, Kansas"
    },
    {
        ", US, and is now based in ": null
    },
    {
        "Kirkland, Washington": "Kirkland, Washington"
    },
    {
        ". In addition to its professional staff, the SIG is supported by its more than 30,000 member companies bluetooth.com who participate in the various working groups that produce the standardization documents and oversee the qualification process for new products and help to evangelize the technology.       The ": null
    },
    {
        "SIG": "Special Interest Group"
    },
    {
        " members participate in study groups, expert groups, working groups along with committees.        The study groups carry out research into their various areas which informs the development of the Bluetooth specifications. They may eventually become working groups in their own right.       The expert groups deal with issues of technical importance to all aspects of Bluetooth development. As with the Study Groups their work informs the working groups as well as the corporate groups.   Participation in the Expert Groups is restricted to ": null
    },
    {
        "Promoter members": "Promoter Members"
    },
    {
        " and ": null
    },
    {
        "Associate members": "Associate Members"
    },
    {
        ".       The working groups develop new Bluetooth specifications and enhance adopted specifications. They are responsible for the vast majority of published standards and specifications. Participation in the working groups is restricted to ": null
    },
    {
        "Promoter members": "Promoter Members"
    },
    {
        " and ": null
    },
    {
        "Associate members": "Associate Members"
    },
    {
        ".       The committees of the SIG deal with the other aspects of licensing, marketing and review including developing and maintaining the Qualification Process, oversight of the Bluetooth specifications, and developing, improving and maintaining the test methodology and concepts as well as other strategic functions.       Any company incorporating Bluetooth wireless technology into products, using the technology to offer goods and services or simply re-branding a product with Bluetooth technology may become a member of the Bluetooth SIG  . There are three levels of corporate membership totaling more than 20,000 members, and individuals from member companies may also participate.       These members are the most active in the SIG and have considerable influence over both the strategic and technological directions of Bluetooth as a whole.     ": null
    },
    {
        "Ericsson Technology Licensing": "Ericsson"
    },
    {
        "   IBM": "Ibm"
    },
    {
        "   Intel": "Intel"
    },
    {
        "   Nokia": "Nokia"
    },
    {
        "   Toshiba": "Toshiba"
    },
    {
        "   Microsoft": "Microsoft"
    },
    {
        "   Lenovo": "Lenovo"
    },
    {
        "   Apple": "Apple Inc."
    },
    {
        "     Each Promoter member has one seat on the Board of Directors and the Qualification Review Board . They each may have multiple staff in the various working groups and committees that comprise the work of the SIG.     The SIGs website carries a .       The Bluetooth SIG Associate membership fees have stayed the same since 2006. Associate membership is renewed annually and the yearly fee depends on the individual companys revenue. Companies with annual revenue in excess of $100M US are considered Large Associates and pay annual membership fees of $35,000 US. Small Associates are categorized as those organizations with revenue less than $100M US and join the SIG with an annual membership fee of $7,500 US. Associate members of the SIG get early access to draft specifications at versions 0.5 and 0.7 and are eligible to participate and gain a voting seat in working groups and committees—a key opportunity to work with other Associate and Promoter members on enhancing existing specifications. They are also eligible for enhanced marketing support, receive discounts on product qualification listings and SIG events including Bluetooth World and UnPlugFest testing events.       Adopter membership in the SIG is free and entitles members to use published Bluetooth  wireless specifications and Bluetooth trademarks. Adopter members do not have early access to unpublished specifications and may not participate in working groups or committees to influence the development of the technology.       Membership is not currently open to individuals.       Universities are accepted for membership. The person registering the institution must have the power and authority to accept the Membership Agreements  on behalf of the school. Note that students may not register their school, but may create user accounts on the SIG membership portal, , that are associated with their schools existing SIG membership.       Next to the development of the technology itself, the qualification process is one of the most important aspects of Bluetooth technology, supporting interoperability, conformance to the Bluetooth specifications, and to strengthening the Bluetooth brand.     Members of the Bluetooth SIG must complete the qualification and declaration process for their Bluetooth enabled product to demonstrate and declare compliance to the .      The primary objective of the qualification process is for members to demonstrate their product compliance to the adopted specifications through testing and documentation. After qualification is completed, members need to complete the declaration process. Members declare their compliance to both the Bluetooth Patent/Copyright License Agreement and Bluetooth Trademark License Agreement .     An overview of both processes including steps of the processes, types and fees is available on the .     Bluetooth Qualification Experts  and Bluetooth Qualification Test Facilities  are available to support members through the processes. Members uncertain or unfamiliar with the qualification process are encouraged to consider using one or both of these service types. ": null
    }
]