[
    {
        "            Robert James Lee Hawke,  was an Australian politician who served as ": null
    },
    {
        "Prime Minister of Australia": "Prime Minister Of Australia"
    },
    {
        " and ": null
    },
    {
        "Leader of the Labor Party": "Australian Labor Party"
    },
    {
        " from 1983 to 1991. He was also ": null
    },
    {
        "Member of Parliament": "Parliament Of Australia"
    },
    {
        " for ": null
    },
    {
        "Wills": "Division Of Wills"
    },
    {
        " from 1980 to 1992.     Hawke was born in ": null
    },
    {
        "Bordertown": "Bordertown, South Australia"
    },
    {
        ", ": null
    },
    {
        "South Australia": "South Australia"
    },
    {
        ". He attended the ": null
    },
    {
        "University of Western Australia": "University Of Western Australia"
    },
    {
        " and went on to study at ": null
    },
    {
        "University College, Oxford": "University College, Oxford"
    },
    {
        " as a ": null
    },
    {
        "Rhodes Scholar": "Rhodes Scholarship"
    },
    {
        ". In 1956, Hawke joined the ": null
    },
    {
        "Australian Council of Trade Unions": "Australian Council Of Trade Unions"
    },
    {
        " as a research officer. Having risen to become responsible for wage arbitration, he was elected ACTU President in 1969, where he achieved a high public profile.     After a decade serving in that role, Hawke announced his intention to enter politics, and was subsequently elected to the ": null
    },
    {
        "House of Representatives": "Parliament Of Australia"
    },
    {
        " as the Labor MP for ": null
    },
    {
        "Wills": "Division Of Wills"
    },
    {
        " in ": null
    },
    {
        "Victoria": "Victoria"
    },
    {
        ". Three years later, he led Labor to a landslide victory at the ": null
    },
    {
        "1983 election": "1983 Australian Federal Election"
    },
    {
        " and was sworn in as Australias 23rd Prime Minister. He went on to lead Labor to victory three more times, in ": null
    },
    {
        "1984": "1984 Australian Federal Election"
    },
    {
        ", ": null
    },
    {
        "1987": "1987 Australian Federal Election"
    },
    {
        " and ": null
    },
    {
        "1990": "1990 Australian Federal Election"
    },
    {
        ", making him the most electorally successful Labor Leader in history.     The ": null
    },
    {
        "Hawke Government": "Hawke Government"
    },
    {
        " created ": null
    },
    {
        "Medicare": "Medicare"
    },
    {
        " and ": null
    },
    {
        "Landcare": "Landcare In Australia"
    },
    {
        ", brokered the ": null
    },
    {
        "Prices and Incomes Accord": "Prices And Incomes Accord"
    },
    {
        ", established ": null
    },
    {
        "APEC": "Asia-Pacific Economic Cooperation"
    },
    {
        ", floated the Australian dollar, deregulated the financial sector, introduced the ": null
    },
    {
        "Family Assistance Scheme": "Family Allowanceaustralia"
    },
    {
        ", announced ": null
    },
    {
        "Advance Australia Fair": "Advance Australia Fair"
    },
    {
        " as the official national anthem, initiated ": null
    },
    {
        "superannuation pension schemes": "Superannuation In Australia"
    },
    {
        " for all workers and oversaw passage of the ": null
    },
    {
        "Australia Act": "Australia Act 1986"
    },
    {
        " that removed all remaining jurisdiction by the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " from Australia.  During his time as Prime Minister, Hawke recorded the highest popularity rating ever measured by an Australian opinion poll, reaching 75% approval in 1984.      In June 1991, ": null
    },
    {
        "Treasurer": "Treasurer Of Australia"
    },
    {
        " Paul Keating": "Paul Keating"
    },
    {
        " unsuccessfully challenged": "June 1991 Australian Labor Party Leadership Spill"
    },
    {
        " for the leadership, believing that Hawke had reneged on the ": null
    },
    {
        "Kirribilli Agreement": "Kirribilli Agreement Of 1988"
    },
    {
        ". Keating mounted ": null
    },
    {
        "a second challenge": "December 1991 Australian Labor Party Leadership Spill"
    },
    {
        " six months later, this time narrowly succeeding. Hawke subsequently retired from Parliament, pursuing both a business career and a number of charitable causes, until his death in 2019, aged 89. Hawke remains Labors longest-serving and Australias ": null
    },
    {
        "third-longest-serving Prime Minister": "List Of Prime Ministers Of Australia By Time In Office"
    },
    {
        "; he is also the only Prime Minister to be born in South Australia and the only one raised in Western Australia.         Bob Hawke was born on 9 December 1929 in ": null
    },
    {
        "Bordertown, South Australia": "Bordertown, South Australia"
    },
    {
        ",  the second child of ": null
    },
    {
        "Arthur Hawke": "Clem Hawke"
    },
    {
        " , a ": null
    },
    {
        "Congregationalist": "Congregational Church"
    },
    {
        " minister, and his wife Edith Emily   , a schoolteacher.  His uncle, ": null
    },
    {
        "Albert": "Albert Hawke"
    },
    {
        ", was the Labor ": null
    },
    {
        "Premier of Western Australia": "Premier Of Western Australia"
    },
    {
        " between 1953 and 1959.      Hawkes brother Neil, who was seven years his senior, died at the age of seventeen after contracting ": null
    },
    {
        "meningitis": "Meningitis"
    },
    {
        ", for which there was no cure at the time. Ellie Hawke subsequently developed an almost messianic belief in her sons destiny, and this contributed to Hawkes supreme self-confidence throughout his career. Davidson, G., et al. , p. 302 At the age of fifteen, he presciently boasted to friends that he would one day become the ": null
    },
    {
        "Prime Minister of Australia": "Prime Minister Of Australia"
    },
    {
        ".      At the age of seventeen, the same age that his brother Neil had died, Hawke had a serious accident while riding his ": null
    },
    {
        "Panther motorcycle": "Phelon  &  Moorepanther Motorcycles"
    },
    {
        " that left him in a critical condition for several days. This near-death experience acted as his catalyst, driving him to make the most of his talents and not let his abilities go to waste. DAlpuget, Blanche . Robert .J. Hawke: A biography, p. 31. Schwartz, Melbourne. .  He joined the ": null
    },
    {
        "Labor Party": "Australian Labor Party"
    },
    {
        " in 1947 at the age of eighteen. Hurst, J., , p.18 Hawke, Bob , p.19         Hawke was educated at ": null
    },
    {
        "Perth Modern School": "Perth Modern School"
    },
    {
        " and the ": null
    },
    {
        "University of Western Australia": "University Of Western Australia"
    },
    {
        ", graduating in 1952 with a Bachelor of Arts and Bachelor of Laws. He was also president of the universitys guild during the same year.  The following year, Hawke won a ": null
    },
    {
        "Rhodes Scholarship": "Rhodes Scholarship"
    },
    {
        " to attend ": null
    },
    {
        "University College, Oxford": "University College, Oxford"
    },
    {
        ", where he undertook a Bachelor of Arts in ": null
    },
    {
        "philosophy, politics and economics": "Philosophy, Politics And Economics"
    },
    {
        " . Hawke, Bob , p.24 He soon found he was covering much the same ground as he did in his education at the University of Western Australia, and transferred to a ": null
    },
    {
        "Bachelor of Letters": "Bachelor Of Letters"
    },
    {
        ". He wrote his thesis on wage-fixing in Australia and successfully presented it in January 1956. Hawke, Bob , p. 28     His academic achievements were complemented by setting a new world record for beer drinking; he downed —equivalent to a ": null
    },
    {
        "yard of ale": "Yard Of Ale"
    },
    {
        "—from a ": null
    },
    {
        "sconce pot": "Sconcing"
    },
    {
        " in 11  seconds as part of a college penalty.   In his memoirs, Hawke suggested that this single feat may have contributed to his political success more than any other, by endearing him to an electorate with a strong beer culture.     In 1956, Hawke accepted a scholarship to undertake doctoral studies in the area of arbitration law in the law department at the ": null
    },
    {
        "Australian National University": "Australian National University"
    },
    {
        " in ": null
    },
    {
        "Canberra": "Canberra"
    },
    {
        ". Soon after his arrival at ANU, Hawke became the students representative on the University Council. A year later, Hawke was recommended to the ": null
    },
    {
        "President of the Australian Council of Trade Unions": "Australian Council Of Trade Unions"
    },
    {
        " to become a research officer, replacing Harold Souter who had become ACTU Secretary. The recommendation was made by Hawkes mentor at ANU, H.P. Brown, who for a number of years had assisted the ACTU in national wage cases. Hawke decided to abandon his doctoral studies and accept the offer, moving to ": null
    },
    {
        "Melbourne": "Melbourne"
    },
    {
        " with his wife ": null
    },
    {
        "Hazel": "Hazel Hawke"
    },
    {
        ". Hurst, J., , p. 26              Not long after Hawke began work at the ACTU, he became responsible for the presentation of its annual case for higher wages to the national wages tribunal, the ": null
    },
    {
        "Conciliation and Arbitration Commission": "Australian Industrial Relations Commission"
    },
    {
        ". He was first appointed as an ACTU advocate in 1959. The 1958 case, under previous advocate R.L. Eggleston, had yielded only a five-shilling increase. Hurst , p. 27 The 1959 case found for a fifteen-shilling increase, and was regarded as a personal triumph for Hawke. Hurst , p. 31 He went on to attain such success and prominence in his role as an ACTU advocate that, in 1969, he was encouraged to run for the position of ACTU President, despite the fact that he had never held elected office in a trade union.      He was elected ACTU President in 1969 on a modernising platform by the narrow margin of 399 to 350, with the support of the left of the union movement, including some associated with the ": null
    },
    {
        "Communist Party": "Communist Party Of Australia"
    },
    {
        ". Hurst, J., , p. 78 He later credited ": null
    },
    {
        "Ray Gietzelt": "Ray Gietzelt"
    },
    {
        ", General Secretary of the ": null
    },
    {
        "FMWU": "Federated Miscellaneous Workers Union Of Australia"
    },
    {
        ", as the single most significant union figure in helping him achieve this outcome.      Hawke declared publicly that socialist is not a word I would use to describe myself ,  and his approach to government was ": null
    },
    {
        "pragmatic": "Pragmatism"
    },
    {
        ". His commitment to the cause of Jewish ": null
    },
    {
        "Refuseniks": "Refuseniks"
    },
    {
        " which purportedly led to a planned assassination attempt on Hawke by the ": null
    },
    {
        "Popular Front for the Liberation of Palestine": "Popular Front For The Liberation Of Palestine"
    },
    {
        ", and its Australian operative ": null
    },
    {
        "Munif Mohammed Abou Rish": "Munif Mohammed Abou Rish"
    },
    {
        ".      In 1971, Hawke along with other members of the ACTU requested that South Africa send a non-racially biased team for the ": null
    },
    {
        "Rugby Union tour": "1971 South Africa Rugby Union Tour Of Australia"
    },
    {
        ", with the intention of unions agreeing not to serve the team in Australia. Prior to arrival, the Western Australian branch of the ": null
    },
    {
        "Transport Workers Union": "Transport Workers Union Of Australia"
    },
    {
        ", and the Barmaids and Barmens Union, announced that they would serve the team, which allowed the ": null
    },
    {
        "Springboks": "South Africa National Rugby Union Team"
    },
    {
        " to land in Perth. The tour commenced on 26 June and riots occurred as anti-apartheid protesters disrupted games. Hawke and his family started to receive malicious mail and phone calls from people who thought that sport and politics should not mix. Hawke remained committed to the ban on apartheid teams and later that year, the South African cricket team was successfully denied and no apartheid team was to ever come to Australia again. It was this ongoing dedication to racial equality in South Africa that would later earn Hawke the respect and friendship of ": null
    },
    {
        "Nelson Mandela": "Nelson Mandela"
    },
    {
        ". DAlpuget, Blanche . Robert .J. Hawke: A biography, p. 192. Schwartz, Melbourne; .       In industrial matters, Hawke continued to demonstrate a preference for, and considerable skill at, negotiation, and was generally liked and respected by employers as well as the unions he advocated for. As early as 1972, speculation began that he would seek to enter ": null
    },
    {
        "Parliament": "Parliament Of Australia"
    },
    {
        " and eventually run to become the ": null
    },
    {
        "Leader of the Labor Party": "Australian Labor Party"
    },
    {
        ". But while his professional career continued successfully, his heavy drinking and womanising placed considerable strains on his family life. Davidson, G., et al. , p. 303     In 1973, Hawke was elected as the ": null
    },
    {
        "Federal President of the Labor Party": "Australian Labor Party"
    },
    {
        ". Two years later, when the ": null
    },
    {
        "Whitlam Government": "Gough Whitlam"
    },
    {
        " was controversially ": null
    },
    {
        "dismissed by the Governor-General": "1975 Australian Constitutional Crisis"
    },
    {
        ", Hawke showed an initial keenness to enter Parliament at the ": null
    },
    {
        "ensuing election": "1975 Australian Federal Election"
    },
    {
        ". ": null
    },
    {
        "Harry Jenkins": "Harry Jenkins Sr."
    },
    {
        ", the MP for ": null
    },
    {
        "Scullin": "Division Of Scullin"
    },
    {
        ", came under pressure to step down to allow Hawke to stand in his place, but he strongly resisted this push. Obituary Labor stalwart who would not stand aside for Bob Hawke , The Age, 6 August 2004, p.9 Hawke eventually decided not to attempt to enter Parliament at that time, a decision he soon regretted. After Labor was defeated at the election, Whitlam initially offered the leadership to Hawke, although it was not within Whitlams power to decide who would succeed him. Hawke , p.70 Despite not taking on the offer, Hawke remained influential, playing a key role in averting national strike action. Hurst, J., , p. 198     The strain of this period, serving as both ACTU President and Labor Party President, took its toll on Hawke and in 1979 he suffered a physical collapse. This shock led Hawke to publicly announce his alcoholism in a television interview, and that he would make a concerted—and ultimately successful—effort to overcome it. He was helped through this period by the relationship that he had established with writer ": null
    },
    {
        "Blanche dAlpuget": "Blanche Dalpuget"
    },
    {
        ", who, in 1982, published a biography of Hawke. His popularity with the public was, if anything, enhanced by this period of rehabilitation, and opinion polling suggested that he was a far more popular public figure than either Labor leader ": null
    },
    {
        "Bill Hayden": "Bill Hayden"
    },
    {
        " or ": null
    },
    {
        "Liberal": "Liberal Party Of Australia"
    },
    {
        " prime minister ": null
    },
    {
        "Malcolm Fraser": "Malcolm Fraser"
    },
    {
        ".              Hawkes first attempt to enter Parliament came during the ": null
    },
    {
        "1963 federal election": "1963 Australian Federal Election"
    },
    {
        ". He stood in the seat of ": null
    },
    {
        "Corio": "Division Of Corio"
    },
    {
        " in ": null
    },
    {
        "Geelong": "Geelong"
    },
    {
        " and managed to achieve a 3.1% swing against the national trend, although he fell short of ousting longtime Liberal incumbent ": null
    },
    {
        "Hubert Opperman": "Hubert Opperman"
    },
    {
        ".       Hawke passed up several opportunities to enter Parliament throughout the 1970s, something he later wrote that he regretted . He eventually stood for election to the ": null
    },
    {
        "House of Representatives": "House Of Representatives"
    },
    {
        " at the ": null
    },
    {
        "1980 election": "1980 Australian Federal Election"
    },
    {
        " for the safe ": null
    },
    {
        "Melbourne": "Melbourne"
    },
    {
        " seat of ": null
    },
    {
        "Wills": "Division Of Wills"
    },
    {
        ", winning it comfortably. Immediately upon his election to Parliament, Hawke was appointed to the ": null
    },
    {
        "Shadow Cabinet": "Shadow Cabinet"
    },
    {
        " by Labor Leader ": null
    },
    {
        "Bill Hayden": "Bill Hayden"
    },
    {
        " as Shadow Minister for Industrial Relations. Hurst, J., , p. 262     Hayden, after having lost the 1980 election, was increasingly subject to criticism from ALP figures concerning his leadership. In order to quell speculation over his position, Hayden eventually called a leadership ballot for 16 July 1982, believing that if he won he would be able to lead Labor into the next election. Kelly, P., , p. 24 Hawke duly challenged Hayden, but Hayden was able to defeat him and remain in position, although his five-vote victory over the former ACTU President was not large enough to dispel doubts that he could lead the Labor Party to victory at an election. Hurst, J., , p. 269     Despite being defeated, Hawke continued to agitate behind the scenes for a change in leadership, with opinion polls continuing to show that Hawke was a far more popular figure than both Hayden and the prime minister, ": null
    },
    {
        "Malcolm Fraser": "Malcolm Fraser"
    },
    {
        ". Hayden was further weakened after the ALPs unexpectedly poor performance at a ": null
    },
    {
        "by-election": "1982 Flinders By-Election"
    },
    {
        " in December 1982 for the Victorian seat of ": null
    },
    {
        "Flinders": "Division Of Flinders"
    },
    {
        ", following the resignation of the former Liberal minister ": null
    },
    {
        "Phillip Lynch": "Phillip Lynch"
    },
    {
        ". Labor needed a swing of 5.5% to win the seat and had been predicted by the media to win, but could only achieve a swing of 3%. Hurst, J., , p. 270     Labor Party power-brokers, such as ": null
    },
    {
        "Graham Richardson": "Graham Richardson"
    },
    {
        " and ": null
    },
    {
        "Barrie Unsworth": "Barrie Unsworth"
    },
    {
        ", now openly switched their allegiance from Hayden to Hawke. More significantly, Haydens staunch friend and political ally, Labors ": null
    },
    {
        "Senate Leader": "Australian Senate"
    },
    {
        " John Button": "John Button"
    },
    {
        ", had become convinced that Hawkes chances of victory at an election were greater than Haydens. Initially Hayden believed that he could remain in his job, but Buttons defection proved to be the final straw in convincing Hayden that he would have to resign as Labor Leader. Hurst, J., , p. 273     Less than two months after the poor result at the Flinders by-election, Hayden announced his resignation as Leader of the Labor Party to the caucus on 3 February 1983. Hawke was subsequently named as leader—and hence became ": null
    },
    {
        "Leader of the Opposition": "List Of Australian Leaders Of The Opposition"
    },
    {
        "—pending a party-room ballot at which he was elected unopposed. Having learned about the impending change, on the same day Fraser called a ": null
    },
    {
        "snap election": "1983 Australian Federal Election"
    },
    {
        " for 5 March 1983, hoping to capitalise on Labors feuding before it could replace Hayden with Hawke. Hurst, J., , p. 275 However, he was unable to have the ": null
    },
    {
        "Governor-General": "Governor-General Of Australia"
    },
    {
        " confirm the election before Labor announced the change. In the election held a month later, Hawke led Labor to a landslide election victory, achieving a 24-seat swing—still the worst defeat that a sitting non-Labor Government has ever suffered—and ending seven years of Liberal Party rule.                       After Labors landslide victory, Hawke was sworn in as the ": null
    },
    {
        "23rd Prime Minister of Australia": "Prime Minister Of Australia"
    },
    {
        " by the ": null
    },
    {
        "governor-general": "Governor-General Of Australia"
    },
    {
        " on 11 March 1983. The inaugural days of the ": null
    },
    {
        "Hawke Government": "Hawke Government"
    },
    {
        " were distinctly different from those of the ": null
    },
    {
        "Whitlam Government": "Whitlam Government"
    },
    {
        ". Rather than immediately initiating extensive reform programs as Whitlam had, Hawke announced that ": null
    },
    {
        "Malcolm Frasers": "Malcolm Fraser"
    },
    {
        "pre-election concealment of the budget deficit meant that many of Labors election commitments would have to be deferred. Kelly, P., , p.57 As part of his internal reforms package, Hawke divided the government into two tiers, with only the most senior ministers sitting in the ": null
    },
    {
        "cabinet": "Cabinet Of Australia"
    },
    {
        ". The Labor caucus was still given the authority to determine who would make up the ministry, but gave Hawke unprecedented powers for a Labor prime minister to select which individual ministers would comprise the 13-strong Cabinet. Kelly, P., , p. 30     Hawke said that he did this in order to avoid what he viewed as the unwieldy nature of the Whitlam cabinet, which had 27 members. Caucus under Hawke also exhibited a much more formalised system of parliamentary ": null
    },
    {
        "factions": "Political Faction"
    },
    {
        ", which significantly altered the dynamics of caucus operations.     Unlike his predecessor, Hawkes authority within the Labor Party was absolute. This enabled him to persuade his MPs to support a substantial set of policy changes. Individual accounts from ministers indicate that while Hawke was not usually the driving force behind individual reforms, he took on the role of achieving consensus and providing political guidance on what was electorally feasible and how best to sell it to the public, tasks at which he proved highly successful. Hawke took on a very public role as prime minister, proving to be incredibly popular with the Australian electorate; to this date he still holds the highest ever AC Nielsen approval rating.               According to political commentator ": null
    },
    {
        "Paul Kelly": "Paul Kelly"
    },
    {
        ", the most influential economic decisions of the 1980s were the floating of the Australian dollar and the deregulation of the financial system . Kelly, P., , p.76 Although the ": null
    },
    {
        "Fraser Government": "Malcolm Fraser"
    },
    {
        " had played a part in the process of financial deregulation by commissioning the 1981 Campbell Report, opposition from Fraser himself had stalled the deregulation process. Kelly, P., , p.78 When the Hawke Government implemented a comprehensive program of financial deregulation and reform, it transformed economics and politics in Australia . The Australian economy became significantly more integrated with the global economy as a result, which completely transformed its relationship with Asia, Europe and the United States. Both Hawke and Keating would claim the credit for being the driving force behind the success of the Australian Dollar float. Edwards, J.,, pp. 216–17 That year the economy was seen to be in crisis with a 40% devaluation of the Australian dollar, a marked increase in the current account deficit and the loss of the Federal Governments triple A rating.      Among other reforms,  the Hawke Government dismantled the tariff system, privatised state sector industries, ended the subsidisation of loss-making industries, and sold off the state-owned ": null
    },
    {
        "Commonwealth Bank": "Commonwealth Bank"
    },
    {
        " of Australia, ": null
    },
    {
        "Aussat": "Aussat"
    },
    {
        ", ": null
    },
    {
        "Qantas": "Qantas"
    },
    {
        " and ": null
    },
    {
        "CSL Limited": "Csl Limited"
    },
    {
        ". Kelly, P., , p.665 Kelly, P., , p.672 The tax system was reformed, with the introduction of a fringe benefits tax and a capital gains tax, reforms strongly opposed by the Liberal Party at the time, but not ones that they reversed when they eventually returned to office. Kelly, P., , p. 175 Partially offsetting these imposts upon the business community—the main loser from the 1985 Tax Summit according to Paul Kelly—was the introduction of full ": null
    },
    {
        "dividend imputation": "Dividend Imputation"
    },
    {
        ", a reform insisted upon by Keating. Kelly, P., , p. 174 Funding for schools was also considerably increased, while financial assistance was provided for students to enable them to stay at school longer. Considerable progress was also made in directing assistance to the most disadvantaged recipients over the whole range of welfare benefits. ": null
    },
    {
        "Ross McMullin": "Ross Mcmullin"
    },
    {
        ", The Light on the Hill: The Australian Labor Party 1891–1991     The political partnership between Hawke and his ": null
    },
    {
        "Treasurer": "Treasurer Of Australia"
    },
    {
        ", Paul Keating, proved essential to Labors success in government. The two men proved a study in contrasts: Hawke was a Rhodes Scholar; Keating left high school early. Edwards, J.,, p.44 Hawkes enthusiasms were cigars, horse racing and all forms of sport; Keating preferred ": null
    },
    {
        "classical architecture": "Classical Architecture"
    },
    {
        ", ": null
    },
    {
        "Mahler": "Gustav Mahler"
    },
    {
        " symphonies and collecting ": null
    },
    {
        "British Regency": "British Regency"
    },
    {
        " and ": null
    },
    {
        "French Empire": "First French Empire"
    },
    {
        " antiques. Edwards, J.,, p.6, p.48       In spite of the criticisms levelled against the Hawke Government, it succeeded in enacting a wide range of social reforms during its time in office.    Deflecting arguments that the Hawke Government had failed as a reform government, ": null
    },
    {
        "Neville Wran": "Neville Wran"
    },
    {
        ", ": null
    },
    {
        "John Dawkins": "John Dawkins"
    },
    {
        ", ": null
    },
    {
        "Bill Hayden": "Bill Hayden"
    },
    {
        " and ": null
    },
    {
        "Paul Keating": "Paul Keating"
    },
    {
        " made a number of speeches throughout the 1980s arguing that the Hawke Government had been a recognisably reformist government, drawing attention to Hawkes achievements as prime minister during his first five years in office. As well as the reintroduction of ": null
    },
    {
        "Medibank": "Medibank"
    },
    {
        ", under the new name ": null
    },
    {
        "Medicare": "Medicare"
    },
    {
        ", these included the doubling of the number of childcare places, the introduction of occupational superannuation, a boost in school retention rates, a focus on young peoples job skills, a doubling of subsidised homecare services, the elimination of poverty traps in the welfare system, a 50% increase in public housing funds, an increase in the real value of the old-age pension, the development of a new youth support program, the reintroduction of six-monthly indexation of single-person unemployment benefits, and significant improvements in social security provisions. Whitlam, Wran and the Labor tradition: Labor history essays, volume two By Gough Whitlam, Australian Labor Party, New South Wales Branch      As pointed out by John Dawkins, the proportion of total government outlays allocated to families, the sick, single parents, widows, the handicapped, and veterans was significantly higher under the Hawke Government than under the Whitlam Government. In 1989, the ": null
    },
    {
        "Hawke Labor Government": "Hawke Government"
    },
    {
        " gradually re-introduced fees for university study. It set up the Higher Education Contributions Scheme ,  which was first proposed by Professor Murray Wells The Australian, 15 April 1987, page 15": null
    },
    {
        "stralian economi": "Stralian Economi"
    },
    {
        "see ": null
    },
    {
        "Dawkins Revolution": "Dawkins Revolution"
    },
    {
        "in which case it was called a HECS debt": null
    },
    {
        " 219": "219"
    },
    {
        "19921994199419941994": null
    },
    {
        "stral": "Stral"
    },
    {
        "stralian politici": "Stralian Politici"
    },
    {
        "19921992199419921996": null
    },
    {
        "li": "Li"
    },
    {
        "stral": "Stral"
    },
    {
        "19921996": null
    },
    {
        "uth Austral": "Uth Austral"
    },
    {
        "165228": "165228"
    },
    {
        "1983born 1957born 1959born 19601982": null
    },
    {
        "dn": "Dn"
    },
    {
        "was AC   film": null
    }
]