[
    {
        "   Boney M. is a ": null
    },
    {
        "Euro": "Europe"
    },
    {
        "-": null
    },
    {
        "Caribbean": "Caribbean"
    },
    {
        " vocal group": "List Of Vocal Groups"
    },
    {
        " created by ": null
    },
    {
        "German": "Germans"
    },
    {
        " record producer ": null
    },
    {
        "Frank Farian": "Frank Farian"
    },
    {
        ". Originally based in ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        ", the four original members of the groups official line-up were ": null
    },
    {
        "Liz Mitchell": "Liz Mitchell"
    },
    {
        " and ": null
    },
    {
        "Marcia Barrett": "Marcia Barrett"
    },
    {
        " from ": null
    },
    {
        "Jamaica": "Jamaica"
    },
    {
        ", ": null
    },
    {
        "Maizie Williams": "Maizie Williams"
    },
    {
        " from ": null
    },
    {
        "Montserrat": "Montserrat"
    },
    {
        " and ": null
    },
    {
        "Bobby Farrell": "Bobby Farrell"
    },
    {
        ", a performing-artist from ": null
    },
    {
        "Aruba": "Aruba"
    },
    {
        ". The group was formed in 1976 and achieved popularity during the ": null
    },
    {
        "disco": "Disco"
    },
    {
        " era of the late 1970s. Since the 1980s, various line-ups of the band have performed with different personnel.     The band has sold around 100 million records worldwide and is known for huge international hits such as ": null
    },
    {
        "Daddy Cool": "Daddy Cool"
    },
    {
        " , ": null
    },
    {
        "Ma Baker": "Ma Baker"
    },
    {
        " , ": null
    },
    {
        "Sunny": "Sunny Boney M. Version"
    },
    {
        " , ": null
    },
    {
        "Rasputin": "Rasputin"
    },
    {
        " , ": null
    },
    {
        "Marys Boy Child – Oh My Lord": "Marys Boy Child – Oh My Lord"
    },
    {
        " and ": null
    },
    {
        "Rivers of Babylon": "Rivers Of Babylon"
    },
    {
        " .          German singer-songwriter ": null
    },
    {
        "Frank Farian": "Frank Farian"
    },
    {
        "  recorded the dance track ": null
    },
    {
        "Baby Do You Wanna Bump": "Baby Do You Wanna Bump"
    },
    {
        " in December 1974. Farian sang the repeated line Do you do you wanna bump? in a deep voice as well as performing the high ": null
    },
    {
        "falsetto": "Falsetto"
    },
    {
        " chorus. When the record was released as a single, it was credited to Boney M. , a pseudonym Farian had created for himself after watching the Australian detective show  Boney . Boney M by John Shearlaw and David Brown, Hamlin Paperbacks, 1979 -page 35-6 He said:          After a slow start, the song became a hit in the Netherlands and Belgium. It was then that Farian decided to hire performers to front the group for TV performances. Farian found ": null
    },
    {
        "Maizie Williams": "Maizie Williams"
    },
    {
        " , who brought in ": null
    },
    {
        "Bobby Farrell": "Bobby Farrell"
    },
    {
        ", a male exotic dancer from ": null
    },
    {
        "Aruba": "Aruba"
    },
    {
        ". Singer ": null
    },
    {
        "Marcia Barrett": "Marcia Barrett"
    },
    {
        " joined the group, who brought in ": null
    },
    {
        "Liz Mitchell": "Liz Mitchell"
    },
    {
        ", former member of the ": null
    },
    {
        "Les Humphries Singers": "Les Humphries Singers"
    },
    {
        " and Boney M. was finalised.     Take the Heat off Me  Take the Heat off Me , was released in 1976. It contained tracks that Marcia Barrett had already recorded with Farian, including the title track and Lovin or Leavin , both of which were previously recorded in German by another Farian act, ": null
    },
    {
        "Gilla": "Gilla"
    },
    {
        ". As Maizie Williams voice was not considered suitable for recording purposes by Farian, and a try-out with Bobby Farrell performing ": null
    },
    {
        "No Woman No Cry": "No Woman No Cry"
    },
    {
        " did not work, Farian decided to use only Liz Mitchell and Marcia Barrett along with his own studio-enhanced voice to create the Boney M. sound.     The albums commercial performance was initially lukewarm. However, the group rigorously toured discos, clubs and even country fairs to earn a reputation for themselves. The groups big break came when, at the end of summer 1976, German television producer Michael Mike Leckebusch  requested the group for his show  Musikladen . Boney M. appeared on the live music show on 18 September 1976, after 10  pm and in their daring stage costumes, where they performed the song ": null
    },
    {
        "Daddy Cool": "Daddy Cool"
    },
    {
        " . The song quickly went to no.1 in Germany, with the album following the success of the single. Another single, ": null
    },
    {
        "Sunny": "Sunny"
    },
    {
        "  gave the group their second no.1 hit. The groups popularity had also grown throughout Europe, with Daddy Cool reaching no.1 in Switzerland, Sweden, Norway, and Austria. Both singles were also Top 10 hits in the UK, which would become one of their biggest markets.     Love for Sale  Love for Sale , which contained the hits ": null
    },
    {
        "Ma Baker": "Ma Baker"
    },
    {
        " and ": null
    },
    {
        "Belfast": "Belfast"
    },
    {
        " . The group embarked on their first major concert tours with a live band of musicians called The Black Beauty Circus .  Love for Sale  was certified Gold a year after its release in the UK.  Both singles from the album reached no.1 in Germany and the UK Top 10.     Nightflight to Venus ": null
    },
    {
        "Rivers of Babylon": "Rivers Of Babylon"
    },
    {
        "/": null
    },
    {
        "Brown Girl in the Ring": "Brown Girl In The Ring"
    },
    {
        " , which became a massive hit all over Europe, reaching No. 1 in several countries as well as becoming one of the biggest selling singles of all time in the UK. It also became their most successful single in the United States, peaking at No. 30 on the ": null
    },
    {
        "U.S. pop singles chart": "Billboard Hot 100"
    },
    {
        ". Following this came their biggest-selling album,  Nightflight to Venus , which spawned further hit singles with ": null
    },
    {
        "Rasputin": "Rasputin"
    },
    {
        " and ": null
    },
    {
        "Painter Man": "Painter Man"
    },
    {
        " . Continuing with their success, they released ": null
    },
    {
        "Marys Boy Child   Oh My Lord": "Marys Boy Child  & Ndash; Oh My Lord"
    },
    {
        " , which was the 1978 ": null
    },
    {
        "Christmas number one single": "List Of Christmas Number One Singles"
    },
    {
        " in the United Kingdom and became another of the biggest selling singles of all time there. Also during 1978, Boney M. made a much publicized promotional visit to the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ", one of the very few Western acts along with ": null
    },
    {
        "Elton John": "Elton John"
    },
    {
        " to do so, although tracks like Rasputin were not released in the Soviet Union due to their lyrics.     While it had never been a secret that Bobby Farrell never sang on the groups records , in 1978 it became public knowledge that Maizie Williams did not sing on the studio recordings either, since her voice wasnt suited for this kind of music as Farian stated in an interview with German teen magazine  Bravo . Since this had become common practice within the disco genre of the late 1970s, few people cared – unlike when Farian did the same thing with ": null
    },
    {
        "Milli Vanilli": "Milli Vanilli"
    },
    {
        " in the late 1980s. While only two of Boney M.s official members actually contributed to ": null
    },
    {
        "the bands records": "Boney M. Discography"
    },
    {
        ", all four members of the group, including Williams and Farrell, performed the vocals live at Boney M. concerts.  The bands live sound was also augmented by several ": null
    },
    {
        "backing vocalists": "Backing Vocalist"
    },
    {
        ", which served to mitigate any vocal deficiencies the group may have had compared with the studio productions.     Oceans of Fantasy ": null
    },
    {
        "Hooray! Hooray! Its a Holi-Holiday": "Hooray! Hooray! Its A Holi-Holiday"
    },
    {
        " , which became another Top 10 hit across Europe. Later in the year they released their fourth album,  Oceans of Fantasy , containing two hit singles – ": null
    },
    {
        " Gotta Go Home / El Lute ": "El Lute / Gotta Go Home"
    },
    {
        " and ": null
    },
    {
        " Im Born Again / Bahama Mama ": "Im Born Again / Bahama Mama"
    },
    {
        ". The album also included a Lead and Backing Vocals credit for the first time. Oceans of Fantasy reached no.1 in the UK and was certified Platinum, though their run of Top 10 singles had now ended with Gotta Go Home peaking at no.12 and Im Born Again peaking at 35.       In 1980, Boney M. released a greatest hits album,  The Magic of Boney M.   20 Golden Hits , which also contained two new songs, My Friend Jack and I See a Boat on the River . It made the No. 1 spot in the UK, reaching Gold status within six weeks of release, though it was their last big-selling album in the UK.     Boonoonoonoos  Boonoonoonoos  was finally released by the end of that year, Bobby Farrell was fired from the group due to his unreliability. While still a healthy seller in continental Europe, Boonoonoonoos failed to crack the UK Top 100 after three consecutive No. 1 albums, and Farrells departure left the group unable to promote it. Following this, the group released a Christmas Album.     Ten Thousand Lightyears ": null
    },
    {
        "Reggie Tsiboe": "Reggie Tsiboe"
    },
    {
        " was hired to replace Farrell as the new male member of Boney M. in 1982 but the singles The Carnival Is Over and Jambo fared poorly, and the groups seventh album  Ten Thousand Lightyears , issued in 1984, marked another commercial low point peaking at 23 in the German album charts. The group, however, returned to the German Top 20 in the autumn of 1984 with Kalimba de Luna and ": null
    },
    {
        "Happy Song": "Happy Song"
    },
    {
        " , the latter seeing Bobby Farrell return to the group. Both songs were carbon-copies of the original Italian hits by ": null
    },
    {
        "Tony Esposito": "Tony Esposito"
    },
    {
        " and ": null
    },
    {
        "Babys Gang": "Babys Gang"
    },
    {
        " respectively.     Eye Dance  Eye Dance  was widely regarded as uninspired and disappointing. After celebrating Boney M.s 10th anniversary in early 1986, the group officially disbanded after the release of the commercially unsuccessful single Young, Free and Single which peaked at No.48.        From this point, different versions of the group were formed by members, some with cooperation of Farian, others without . One version began touring in the first half of 1987 with Marilyn Scharbaai taking Liz Mitchells place. Mitchell returned for a second leg of the tour late 1987, and Marcia Barrett soon left the band. At the same time, Bobby Farrell had set up a deal for a new Boney M. album to be recorded without Farian in Belgium. When Farrell failed to show up for either recording or tour, and Maizie Williams had never sung on record, the album ended up being released as Liz Mitchells first solo album No One Will Force You. Mitchell and Williams completed a tour during 1987–88, adding singer Celena Duncan and Ron Gale as replacements for Barrett and Farrell. Carol Grey later replaced Celena Duncan and Curt De Daran later replaced Ron Gale.     In October 1988, the classic Boney M. line-up reunited without producer Frank Farian for the album  Greatest Hits of All Times   Remix 88  but tensions ran high between the members, and Liz Mitchell left in the spring of 1989 to be replaced by Madeleine Davis. While Mitchell promoted her solo album, the group recorded the single ": null
    },
    {
        "Everybody Wants to Dance Like Josephine Baker": "Everybody Wants To Dance Like Josephine Baker"
    },
    {
        " , without Farians knowledge or approval. Threatened with legal action by the producer over the use of the Boney M. name, the single was subsequently withdrawn and Farian issued Stories with his own new Boney M. line-up featuring Liz Mitchell, Reggie Tsiboe and two new members, Sharon Stevens and Patty Onoyewenjo, Stories peaked at 11 in the Swiss charts. A second remix album  Greatest Hits of All Times   Remix 89   Volume II  was released but fared poorly.       1992 saw a renewed interest in Boney M.s music with the Boney M. Megamix single returning the group to the UK Top 10 for the first time since 1980, and a subsequent Greatest Hits album reaching the UK Top 20 in 1993. While Marcia Barrett, now residing in Florida, was battling cancer and unable to perform, Boney M. toured the world with a line-up of Liz Mitchell, Carol Grey, Patricia Lorna Foster and Curt Dee Daran . They released the single ‘Papa Chico’ but failed to chart. Maizie Williams assembled her own Boney M. with an ever-changing line-up. Bobby Farrell also toured with varying trios of female performers.             Liz Mitchell was touring the world with her line-up of Boney M., which is the only line-up officially supported by Farian . Bobby Farrell and Liz Mitchell have released solo albums containing their own re-recordings of Boney M.s classic hits. Maizie Williams released her first solo album in 2006 and her own single version of Boney M.s Sunny . In 2007 her rendition of Daddy Cool with ": null
    },
    {
        "Melo-M": "Melo-M"
    },
    {
        " hit the number one spot in the Latvian Charts.  Marcia Barrett has released two solo albums with a third scheduled for release in 2010.      As recounted in his 1988 book  Touching the Void , the British climber ": null
    },
    {
        "Joe Simpson": "Joe Simpson"
    },
    {
        " was subsequently to find the catchy tune of Brown Girl in the Ring haunting him in the final hours of his struggle to survive the descent of ": null
    },
    {
        "Siula Grande": "Siula Grande"
    },
    {
        " in the ": null
    },
    {
        "Andes": "Andes"
    },
    {
        ", and the song was later used in the 2003 film of  Touching the Void  made by ": null
    },
    {
        "Kevin Macdonald": "Kevin Macdonald"
    },
    {
        ". Simpson recalls: I remember thinking, bloody hell, Im going to die to Boney M .     A musical based on the music of Boney M.,  Daddy Cool , opened in London in August 2006 to mixed reviews and sluggish ticket sales, causing it to close in February 2007. From April to July 2007, the show played in a mobile theatre in Berlin, which was specially designed for it.     In April 2007, Australian pop singer Peter Wilson released a song co-written by ": null
    },
    {
        "Frank Farian": "Frank Farian"
    },
    {
        " entitled ": null
    },
    {
        "Doin Fine": "Daddy Cool   Doin Fine"
    },
    {
        " . It is described as paying tribute to the sound of Boney M. and features the famous string arrangement from their first number 1 hit, ": null
    },
    {
        "Daddy Cool": "Daddy Cool"
    },
    {
        " .     Boney M. made a live appearance at the 37th ": null
    },
    {
        "International Film Festival of India": "International Film Festival Of India"
    },
    {
        " , which took place on 23 November 2006 in ": null
    },
    {
        "Panaji": "Panaji"
    },
    {
        ", the state capital of ": null
    },
    {
        "Goa": "Goa"
    },
    {
        ", India. The group is also popular in the Vietnamese diaspora,  and was featured in Thuy Nga music productions.     In the UK, a new album of their greatest hits, entitled  The Magic of Boney M.  was released via ": null
    },
    {
        "BMG": "Bertelsmann Music Group"
    },
    {
        " on 27 November 2006. Special additions to this release were a ": null
    },
    {
        "Mousse T.": "Mousse T."
    },
    {
        " remix of ": null
    },
    {
        "Sunny": "Sunny"
    },
    {
        " and a brand new song from 2006, featuring Liz Mitchell, entitled A Moment of Love .     On 10 April 2007, Boney M.s first four albums were reissued on compact disc with bonus tracks, this time also in the United States .     In September 2007, Boney M.s last four original albums,  Boonoonoonoos ,  Ten Thousand Lightyears , Kalimba de Luna - 16 Happy Songs  and  Eye Dance  were reissued on compact disc in Europe and the United States, all including bonus tracks. In November 2007, a new ": null
    },
    {
        "Christmas compilation": "Christmas With Boney M."
    },
    {
        " was scheduled for release as well as the DVD Fantastic Boney M. – On Stage and on the Road featuring a live performance recorded in Vienna on 1 November 1977 , and a film from the bands 1981 visit to ": null
    },
    {
        "Jamaica": "Jamaica"
    },
    {
        " .     Bobby Farrells Boney M. performed a concert at the Amphi in ": null
    },
    {
        "Raanana": "Raanana"
    },
    {
        ", ": null
    },
    {
        "Israel": "Israel"
    },
    {
        " in May 2007. On 28 June 2007 Boney M. featuring Matthew Felsenfeld and Liz Mitchell performed at the Oktiabrsky concert hall in St. Petersburg, Russia. In September 2007, Maizie Williams Boney M. line-up performed live at the Royal Albert Hall, UK, to raise awareness of HIV/AIDS in Africa, performing her own renditions of Brown Girl in the Ring and Hooray! Hooray! Its a Holi-Holiday .     The legal rights to the name Boney M. have been a matter of controversy, and even court cases, between the former members of the band and producer Frank Farian ever since the late 1980s. Farian, the man who in effect created the group, has continued to work with Liz Mitchell and her line-up all through the 1990s and 2000s. In January 2007, Zanillya Farrell and Yasmina Ayad-Saban renewed the trademark to the name Boney M. in Germany for a 10-year period.     In January 2009, ": null
    },
    {
        "Frank Farian": "Frank Farian"
    },
    {
        " released a brand new single called Felicidad America  under the name-check Boney M. feat. Sherita O. & Yulee B. featuring two new vocalists. The song is a remake of the 1980 Boney M. classic ": null
    },
    {
        "Felicidad ": "Felicidad"
    },
    {
        " with new vocals and re-written lyrics now referring to the new US president ": null
    },
    {
        "Barack Obama": "Barack Obama"
    },
    {
        ".       In July 2010, Maizie Williams headlined a Boney M. performance at Ramallahs Cultural Palace, in the West Bank, as part of the Palestine International Festival. The band played Daddy Cool , Ma Baker and Brown Girl in the Ring , but refrained from playing Rivers of Babylon , rumored to be at the event organizers request because of its description of the Jewish yearning for Zion.        Bobby Farrell died at the age of 61 from heart failure on 30 December 2010. His agent said Farrell was complaining of breathing problems after performing with his band the evening before.   Farrell lived in Amsterdam until his death. The singer was found dead in a hotel room in ": null
    },
    {
        "Saint Petersburg": "Saint Petersburg"
    },
    {
        ", Russia, where he had been performing.      It was announced in February 2014 that Maizie Williams line-up of Boney M. would be touring Australia in June.  They sang at Guilfest, Guildford, UK on 20 July, and Watchet Live music festival UK, on 24 August.     In March 2015, Farian released Diamonds, a 3CD box celebrating the 40th anniversary of Boney M. It contained remastered versions of the original hit singles or of previously unreleased versions, a remix disc and the new digital single Song of Joy featuring Liz Mitchell. A major DVD set was also released.     In February 2017, they performed at the closing ceremony of ": null
    },
    {
        "Patras Carnival": "Patras Carnival"
    },
    {
        " in ": null
    },
    {
        "Patras": "Patras"
    },
    {
        ", ": null
    },
    {
        "Greece": "Greece"
    },
    {
        ".        In 1978, ": null
    },
    {
        "Rivers of Babylon": "Rivers Of Babylon"
    },
    {
        " , a cover of a track by ": null
    },
    {
        "The Melodians": "The Melodians"
    },
    {
        " with lyrics partly based on ": null
    },
    {
        "Psalm 137": "Psalm 137"
    },
    {
        " and partly on Psalm 19, ": null
    },
    {
        "Psalm 137": "Wikisource:Bible /Psalmspsalm 137"
    },
    {
        " in the Bible became the second highest-selling single of all time in the UK. After remaining at No.1 for five weeks, Rivers of Babylon began dropping down the chart, at which point the ": null
    },
    {
        "B-side": "B-Side"
    },
    {
        " Brown Girl in the Ring was given extensive radio airplay, and the single ascended to No. 2. The single spent six months in the UK Top 40, including 19 weeks in the Top 10. It eventually sold over two million copies, the second single to do so, and is still one of only seven to achieve this feat.      The group achieved a second UK million-seller with their version of the ": null
    },
    {
        "calypso": "Calypso Music"
    },
    {
        " classic ": null
    },
    {
        "Marys Boy Child": "Marys Boy Child"
    },
    {
        " , released as a medley ": null
    },
    {
        "Marys Boy Child – Oh My Lord": "Marys Boy Child – Oh My Lord"
    },
    {
        " , which was previously a million-seller for ": null
    },
    {
        "Harry Belafonte": "Harry Belafonte"
    },
    {
        ". The single sold over 1.8 million copies, 1.6 million of which were in the four weeks the song was at No.1 in December 1978.     Boney M. are the only artists to appear twice in the top 11 ": null
    },
    {
        "best selling singles of all time in the UK": "List Of Best-Selling Singles In The United Kingdom"
    },
    {
        ", with Rivers of Babylon in seventh place and Marys Boy Child/Oh My Lord at number 11.  They are also one of six artists to sell a million copies with two singles in the same year.       Compared to other best-selling artists of the 1970s like ": null
    },
    {
        "ABBA": "Abba"
    },
    {
        ", ": null
    },
    {
        "Donna Summer": "Donna Summer"
    },
    {
        ", and the ": null
    },
    {
        "Bee Gees": "Bee Gees"
    },
    {
        ", the Boney M. discography is quite unusual – while the greater part of the bands back catalogue has been remixed, remade, remodeled and reissued all through the 1980s, 1990s and 2000s by producer Frank Farian and record company ": null
    },
    {
        "BMG-Ariola": "Bmg-Ariola"
    },
    {
        " , most of the original 7 and 12 versions issued on vinyl in the 1970s and early 1980s remained unavailable on CD until 2008 and the release of the box set  The Collection  and the single CD compilation  Rivers of Babylon .       During the ": null
    },
    {
        "2002 presidential election": "2002 South Korean Presidential Election"
    },
    {
        " campaign of South Korea, then-candidate ": null
    },
    {
        "Roh Moo-hyun": "Roh Moo-Hyun"
    },
    {
        ", who eventually won the presidency at that event, took Bahama Mama to promote his aim of positive political reform. , from the official media outlet of Roh Moo-hyun      The 2005 Chinese film  Shanghai Dreams  features a scene depicting a rural Chinese disco in 1983, with teenagers dancing to Rivers of Babylon and Gotta Go Home .     In the 2008 Kazakh film  Tulpan , the tractor driver Boni continually plays a cassette of Rivers of Babylon, an example of his fascination for all things Western.     In the 2008 Chinese film  Cheung Gong 7 hou  , ": null
    },
    {
        " Sunny ": "Sunny"
    },
    {
        " is a vital part of the soundtrack.      Boney M. was hugely popular in the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " in the 1970s, although the song ": null
    },
    {
        "Rasputin": "Rasputin"
    },
    {
        " was banned by the Soviet authorities during the groups concert in Moscow in December 1978. Boney M – Russkaya Narodnaya Gruppa Boney M – Russian Folk Group : documentary film // ": null
    },
    {
        "RTR": "Rossiya 1"
    },
    {
        ". Moscow: Biz-Group, 2005. In the Soviet film  Repentance  , Sunny is played at a party of high-ranked communist officials. Sunny is played during a few parts of the successful Korean film of the same name,  Sunny .     It is the theme song of the 2011 Taiwanese drama starring Rainie Yang and Wu Chun,  Sunshine Angel .         ": null
    },
    {
        "Liz Mitchell": "Liz Mitchell"
    },
    {
        " – lead and backing vocals   ": null
    },
    {
        "Marcia Barrett": "Marcia Barrett"
    },
    {
        " – lead and backing vocals   ": null
    },
    {
        "Maizie Williams": "Maizie Williams"
    },
    {
        " – dancer, live vocals   ": null
    },
    {
        "Bobby Farrell": "Bobby Farrell"
    },
    {
        " – dancer, rap, live vocals   ": null
    },
    {
        "Reggie Tsiboe": "Reggie Tsiboe"
    },
    {
        " – lead and backing vocals   ": null
    },
    {
        "Madeleine Davis": "Madeleine Davis"
    },
    {
        " – lead and backing vocals         Take the Heat off Me     Love for Sale     Nightflight to Venus     Oceans of Fantasy     Boonoonoonoos     Christmas Album     Ten Thousand Lightyears     Eye Dance            ": null
    }
]