[
    {
        "     The Book of Isaiah  is the first of the ": null
    },
    {
        "Latter Prophets": "Neviimlatter Prophets"
    },
    {
        " in the ": null
    },
    {
        "Hebrew Bible": "Hebrew Bible"
    },
    {
        " and the first of the ": null
    },
    {
        "Major Prophets": "Major Prophet"
    },
    {
        "in the Christian ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        ". It is identified by a ": null
    },
    {
        "superscription": "Wiktionary:Superscription"
    },
    {
        " as the words of the 8th-century BCE prophet ": null
    },
    {
        "Isaiah": "Isaiah"
    },
    {
        " ben Amoz, but there is extensive evidence that much of it was composed during the ": null
    },
    {
        "Babylonian captivity": "Babylonian Captivity"
    },
    {
        " and later. ": null
    },
    {
        "Bernhard Duhm": "Bernhard Duhm"
    },
    {
        " originated the view, held as a consensus through most of the 20th century, that the book comprises three separate collections of oracles: Proto-Isaiah , containing the words of Isaiah; Deutero-Isaiah , the work of an anonymous 6th-century BCE author writing during the Exile; and Trito-Isaiah , composed after the return from Exile. While virtually no scholars today attribute the entire book, or even most of it, to one person, the books essential unity has become a focus in more recent research. Isaiah 1–33 promises judgment and restoration for Judah, Jerusalem and the nations, and chapters 34–66 presume that judgment has been pronounced and restoration follows soon. It can thus be read as an extended meditation on the destiny of Jerusalem into and after the Exile.     The Deutero-Isaian part of the book describes how God will make Jerusalem the centre of his worldwide rule through a royal saviour  who will destroy her oppressor ; this messiah is the Persian king ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        ", who is merely the agent who brings about Yahwehs kingship. Isaiah speaks out against corrupt leaders and for the disadvantaged, and roots righteousness in Gods holiness rather than in Israels covenant. Isaiah 44:6 contains the first clear statement of ": null
    },
    {
        "monotheism": "Monotheism"
    },
    {
        " This model of monotheism became the defining characteristic of post-Exilic ": null
    },
    {
        "Judaism": "Judaism"
    },
    {
        ", and the basis for ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        " and ": null
    },
    {
        "Islam": "Islam"
    },
    {
        ".     Isaiah was one of the most popular works among Jews in the ": null
    },
    {
        "Second Temple period": "Second Temple Period"
    },
    {
        " . In Christian circles, it was held in such high regard as to be called the Fifth Gospel , and its influence extends beyond Christianity to English literature and to Western culture in general, from the libretto of ": null
    },
    {
        "Handels Messiah": "Handels Messiah"
    },
    {
        " to a host of such everyday phrases as ": null
    },
    {
        "swords into ploughshares": "Swords To Ploughshares"
    },
    {
        " and ": null
    },
    {
        "voice in the wilderness": "Voice In The Wilderness"
    },
    {
        " .          The scholarly consensus which held sway through most of the 20th century saw three separate collections of oracles in the book of Isaiah. A typical outline based on this understanding of the book sees its underlying structure in terms of the identification of historical figures who might have been their authors: ": null
    },
    {
        "Isaiah": "Isaiah"
    },
    {
        ";   40–55: Deutero-Isaiah, the work of an anonymous Exilic author;   56–66: Trito-Isaiah, an anthology of about twelve passages.     While one part of the consensus still holds – virtually no contemporary scholar maintains that the entire book, or even most of it, was written by one person – this perception of Isaiah as made up of three rather distinct sections underwent a radical challenge in the last quarter of the 20th century. The newer approach looks at the book in terms of its literary and formal characteristics, rather than authors, and sees in it a two-part structure divided between chapters 33 and 34:       Seeing Isaiah as a two-part book with an overarching theme leads to a summary of its contents like the following: ": null
    },
    {
        "Day of Yahweh": "Day Of Yahweh"
    },
    {
        " , when Jerusalem will become the centre of his worldwide rule. On that day all the nations of the world will come to Zion for instruction, but first the city must be punished and cleansed of evil. Israel is invited to join in this plan. Chapters 5–12 explain the significance of the Assyrian judgment against Israel: righteous rule by the Davidic king will follow after the arrogant Assyrian monarch is brought down. Chapters 13–27 announce the preparation of the nations for Yahwehs world rule; chapters 28–33 announce that a royal saviour  will emerge in the aftermath of Jerusalems punishment and the destruction of her oppressor.   The oppressor is about to fall. Chapters 34–35 tell how Yahweh will return the redeemed exiles to Jerusalem. Chapters 36–39 tell of the faithfulness of king Hezekiah to Yahweh during the Assyrian siege as a model for the restored community. Chapters 40–54 state that the restoration of Zion is taking place because Yahweh, the creator of the universe, has designated the Persian king ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        " as the promised messiah and temple-builder. Chapters 55–66 are an exhortation to Israel to keep the covenant. Gods eternal promise to David is now made to the people of Israel/Judah at large. The book ends by enjoining righteousness as the final stages of Gods plan come to pass, including the pilgrimage of the nations to Zion and the realisation of Yahwehs kingship.     The older understanding of this book as three fairly discrete sections attributable to identifiable authors leads to a more atomised picture of its contents, as in this example:   Proto-Isaiah/First Isaiah :  ": null
    },
    {
        "Servant Songs": "Servant Songs"
    },
    {
        " personalising the message of the prophet;   Several longer poems on topics such as Gods power and invitations to Israel to trust in him;   Trito-Isaiah/Third Isaiah :   A collection of oracles by unknown prophets in the years immediately after the return from Babylon.              While it is widely accepted that the book of Isaiah is rooted in a historic prophet called Isaiah, who lived in the ": null
    },
    {
        "Kingdom of Judah": "Kingdom Of Judah"
    },
    {
        " during the 8th century BCE, it is also widely accepted that this prophet did not write the entire book of Isaiah. The observations which have led to this are as follows:   Historical situation: Chapters 40–55 presuppose that Jerusalem has already been destroyed and the Babylonian exile is already in effect – they speak from a present in which the Exile is about to end. Chapters 56–66 assume an even later situation, in which the people are already returned to Jerusalem and the rebuilding of the Temple is already under way.       The composition history of Isaiah reflects a major difference in the way authorship was regarded in ancient Israel and in modern societies; the ancients did not regard it as inappropriate to supplement an existing work while remaining anonymous. While the authors are anonymous, it is plausible that all of them were priests, and the book may thus reflect ": null
    },
    {
        "Priestly": "Priestly Source"
    },
    {
        " concerns, in opposition to the increasingly successful reform movement of the ": null
    },
    {
        "Deuteronomist": "Deuteronomist"
    },
    {
        "s.       The historic Isaiah ben Amoz lived in the ": null
    },
    {
        "Kingdom of Judah": "Kingdom Of Judah"
    },
    {
        " during the reigns of four kings from the mid to late 8th-century BCE. During this period, ": null
    },
    {
        "Assyria": "Assyria"
    },
    {
        " was expanding westward from its origins in modern-day northern Iraq towards the Mediterranean, destroying first ": null
    },
    {
        "Aram": "Aram-Damascus"
    },
    {
        " in 734–732 BCE, then the ": null
    },
    {
        "Kingdom of Israel": "Kingdom Of Israel"
    },
    {
        " in 722–721, and finally subjugating Judah in 701. Proto-Isaiah is divided between verse and prose passages, and a currently popular theory is that the verse passages represent the prophecies of the original 8th-century Isaiah, while the prose sections are sermons on his texts composed at the court of ": null
    },
    {
        "Josiah": "Josiah"
    },
    {
        " a hundred years later, at the end of the 7th century.     The conquest of Jerusalem by ": null
    },
    {
        "Babylon": "Neo-Babylonian Empire"
    },
    {
        " and the exile of its elite in 586 BCE ushered in the next stage in the formation of the book. Deutero-Isaiah addresses himself to the Jews in exile, offering them the hope of return. This was the period of the meteoric rise of Persia under its king ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        " – in 559 BCE he succeeded his father as ruler of a small vassal kingdom in modern eastern Iran, by 540 he ruled an empire stretching from the Mediterranean to Central Asia, and in 539 he conquered Babylon. Deutero-Isaiahs predictions of the imminent fall of Babylon and his glorification of Cyrus as the deliverer of Israel date his prophecies to 550–539 BCE, and probably towards the end of this period.     The Persians ended the Jewish exile, and by 515 BCE the exiles, or at least some of them, had returned to Jerusalem and rebuilt the Temple. The return, however, was not without problems: the returnees found themselves in conflict with those who had remained in the country and who now owned the land, and there were further conflicts over the form of government that should be set up. This background forms the context of Trito-Isaiah.              Isaiah is focused on the main role of Jerusalem in Gods plan for the world, seeing centuries of history as though they were all the single vision of the 8th-century prophet Isaiah. Proto-Isaiah speaks of Israels desertion of God and what will follow: Israel will be destroyed by foreign enemies, but after the people, the country and Jerusalem are punished and purified, a holy remnant will live in Gods place in Zion, governed by Gods chosen king , under the presence and protection of God; Deutero-Isaiah has as its subject the liberation of Israel from captivity in Babylon in another ": null
    },
    {
        "Exodus": "The Exodus"
    },
    {
        ", which the God of Israel will arrange using Cyrus, the Persian conqueror, as his agent; Trito-Isaiah concerns Jerusalem, the Temple, the Sabbath, and Israels salvation. . ": null
    },
    {
        "Walter Brueggemann": "Walter Brueggemann"
    },
    {
        " has described this overarching narrative as a continued meditation upon the destiny of Jerusalem .       Gods plan for the world is based on his choice of Jerusalem as the place where he will manifest himself, and of the line of ": null
    },
    {
        "David": "David"
    },
    {
        " as his earthly representative – a theme that may possibly have been created through Jerusalems reprieve from Assyrian attack in 701 BCE.  God is the holy one of Israel ; justice and righteousness are the qualities that mark the essence of God, and Israel has offended God through unrighteousness. Isaiah speaks out for the poor and the oppressed and against corrupt princes and judges, but unlike the prophets ": null
    },
    {
        "Amos": "Book Of Amos"
    },
    {
        " and ": null
    },
    {
        "Micah": "Book Of Micah"
    },
    {
        " he roots righteousness not in Israels covenant with God but in Gods holiness.       Isaiah 44:6 contains the first clear statement of ": null
    },
    {
        "monotheism": "Monotheism"
    },
    {
        "Judaism": "Judaism"
    },
    {
        " and became the basis for Christianity and Islam.       A central theme in Second Isaiah is that of a new Exodus – the return of the exiled people Israel from Babylon to Jerusalem. The author imagines a ritualistic return to Zion led by Yahweh. The importance of this theme is indicated by its placement at the beginning and end of Second Isaiah . This new Exodus is repeatedly linked with Israels ": null
    },
    {
        "Exodus": "The Exodus"
    },
    {
        " from Egypt to Canaan under divine guidance, but with new elements. These links include the following:   The original Exodus participants left in great haste , whereas the participants in this new Exodus will not go out in great haste .   The land between Egypt and Canaan of the first Exodus was a great and terrible wilderness, an arid wasteland , but in this new Exodus, the land between Babylon and the Promised Land will be transformed into a paradise, where the mountains will be lowered and the valleys raised to create level road .   In the first Exodus, water was provided by God, but scarcely. In the new Exodus, God will make the wilderness a pool of water, and the dry land springs of water .              Isaiah was one of the most popular works in the period between the foundation of the Second Temple c. 515 BCE and its destruction by the Romans in 70 CE. Isaiahs shoot will come up from the stump of Jesse is alluded to or cited in the ": null
    },
    {
        "Psalms of Solomon": "Psalms Of Solomon"
    },
    {
        " and various apocalyptic works including the ": null
    },
    {
        "Similitudes of Enoch": "Similitudes Of Enoch"
    },
    {
        ", ": null
    },
    {
        "2 Baruch": "2 Baruch"
    },
    {
        ", ": null
    },
    {
        "4 Ezra": "2 Esdras"
    },
    {
        ", and the third of the ": null
    },
    {
        "Sibylline oracles": "Sibylline Oracles"
    },
    {
        ", all of which understood it to refer to a/the messiah and the messianic age. Isaiah 6, in which Isaiah describes his vision of God enthroned in the Temple, influenced the visions of God in works such as the Book of the Watchers section of the ": null
    },
    {
        "Book of Enoch": "Book Of Enoch"
    },
    {
        ", the ": null
    },
    {
        "Book of Daniel": "Book Of Daniel"
    },
    {
        " and others, often combined with the similar vision from the ": null
    },
    {
        "Book of Ezekiel": "Book Of Ezekiel"
    },
    {
        ". A very influential portion of Isaiah was the four so-called ": null
    },
    {
        "Songs of the Suffering Servant": "Songs Of The Suffering Servant"
    },
    {
        " from Isaiah 42, 49, 50 and 52, in which God calls upon his servant to lead the nations . Some ": null
    },
    {
        "Second Temple": "Second Temple Judaism"
    },
    {
        " texts, including the ": null
    },
    {
        "Wisdom of Solomon": "Wisdom Of Solomon"
    },
    {
        " and the ": null
    },
    {
        "Book of Daniel": "Book Of Daniel"
    },
    {
        " identified the Servant as a group – the wise who will lead many to righteousness – but others, notably the ": null
    },
    {
        "Similitudes of Enoch": "Similitudes Of Enoch"
    },
    {
        ", understood it in messianic terms. The earliest Christians, building on this second tradition, interpreted Isaiah 52:13–53:12, the fourth of the songs, as a prophecy of the death and exaltation of Jesus, a role which Jesus himself accepted according to Luke 4:17–21.          The Book of Isaiah has been immensely influential in the formation of Christianity, from the devotion to the ": null
    },
    {
        "Virgin Mary": "Mary"
    },
    {
        " to anti-Jewish polemic, medieval passion iconography, and modern ": null
    },
    {
        "Christian feminism": "Christian Feminism"
    },
    {
        " and ": null
    },
    {
        "liberation theology": "Liberation Theology"
    },
    {
        ". The regard in which Isaiah was held was so high that the book was frequently called the Fifth Gospel , the prophet who spoke more clearly of Christ and the Church than any others. Its influence extends beyond the Church and Christianity to English literature and to Western culture in general, from the libretto of ": null
    },
    {
        "Handels Messiah": "Handels Messiah"
    },
    {
        " to a host of such everyday phrases as swords into ploughshares and voice in the wilderness .     The ": null
    },
    {
        "Gospel of John": "Gospel Of John"
    },
    {
        " quotes  and states that Isaiah said this because he saw Jesus’ glory and spoke about him.  Isaiah makes up 27 of the 37 quotations from the prophets in the ": null
    },
    {
        "Pauline epistles": "Pauline Epistles"
    },
    {
        ", and takes pride of place in the Gospels and in ": null
    },
    {
        "Acts of the Apostles": "Acts Of The Apostles"
    },
    {
        ". ": null
    },
    {
        "Isaiah 7:14": "Isaiah 7:14"
    },
    {
        ", where the prophet is assuring king ": null
    },
    {
        "Ahaz": "Ahaz"
    },
    {
        " that God will save Judah from the invading armies of Israel and Syria, forms the basis for ": null
    },
    {
        "Matthew 1:23s": "Matthew 1:23"
    },
    {
        "doctrine of the virgin birth, while Isaiah 40:3–5s image of the exiled Israel led by God and proceeding home to Jerusalem on a newly constructed road through the wilderness was taken up by all four Gospels and applied to ": null
    },
    {
        "John the Baptist": "John The Baptist"
    },
    {
        " and Jesus.     Isaiah seems always to have had a prominent place in Jewish Bible use, and it is probable that Jesus himself was deeply influenced by Isaiah. Thus many of the Isaiah passages that are familiar to Christians gained their popularity not directly from Isaiah but from the use of them by Jesus and the early Christian authors – this is especially true of the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ", which depends heavily on Isaiah for its language and imagery.": null
    }
]