[
    {
        "Malachi  is the last book of the ": null
    },
    {
        "Neviim": "Neviim"
    },
    {
        " contained in the ": null
    },
    {
        "Tanakh": "Tanakh"
    },
    {
        ", canonically the last of the ": null
    },
    {
        "Twelve Minor Prophets": "Twelve Minor Prophets"
    },
    {
        ". In the Christian ordering, the grouping of the Prophetic Books is the last section of the ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        ", making Malachi the last book before ": null
    },
    {
        "The New Testament": "The New Testament"
    },
    {
        ".     The book is commonly attributed to a prophet by the name of ": null
    },
    {
        "Malachi": "Malachi"
    },
    {
        ", as its title has frequently been understood as a proper name, although its ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " meaning is simply My Messenger  and may not be the authors name at all. The name occurs in the superscription at 1:1 and in 3:1, although it is highly unlikely that the word refers to the same character in both of these references. Thus, there is substantial debate regarding the identity of the books author. One of the ": null
    },
    {
        "Targums": "Targum"
    },
    {
        " identifies ": null
    },
    {
        "Ezra": "Ezra"
    },
    {
        " as the author of Malachi. Priest and Historian ": null
    },
    {
        "Jerome": "Jerome"
    },
    {
        " suggests that this may be because Ezra is seen as an intermediary between the prophets and the great synagogue. There is, however, no historical evidence yet to support this claim.     Some scholars note affinities between ": null
    },
    {
        "Zechariah": "Book Of Zechariah"
    },
    {
        " 9–14 and the Book of Malachi. Zechariah 9, Zechariah 12, and Malachi 1 are all introduced as The word of Elohim. Some scholars argue that this collection originally consisted of three independent and anonymous prophecies, two of which were subsequently appended to the Book of Zechariah as what they refer to as Deutero-Zechariah, with the third becoming the Book of Malachi. As a result, most scholars consider the Book of Malachi to be the work of a single author who may or may not have been identified by the title Malachi. The present division of the oracles results in a total of 12 books of minor prophets, a number parallelling the sons of ": null
    },
    {
        "Jacob": "Jacob"
    },
    {
        " who became the heads of the 12 ": null
    },
    {
        "Israelite": "Israelite"
    },
    {
        " tribes. The  Catholic Encyclopedia  asserts, We are no doubt in presence of an abbreviation of the name Málakhîyah, that is Messenger of Elohim.         Little is known of the biography of the author of the Book of Malachi, although it has been suggested that he may have been Levitical. The books of Zechariah and Haggai were written during the lifetime of Ezra ; perhaps this may explain the similarities in style.     According to the editors of the 1897 ": null
    },
    {
        "Eastons Bible Dictionary": "Eastons Bible Dictionary"
    },
    {
        ", some scholars believe the name Malachi is not a ": null
    },
    {
        "proper noun": "Proper Noun"
    },
    {
        " but rather an abbreviation of messenger of ": null
    },
    {
        "YHWH": "Yhwh"
    },
    {
        " . http://www.ccel.org/ccel/easton/ebd2.html?termMalachi Malachi at the ": null
    },
    {
        "Eastons Bible Dictionary": "Eastons Bible Dictionary"
    },
    {
        " This reading could be based on Malachi 3:1,  , if my messenger is taken literally as the name Malachi. Several scholars consider the book to be anonymous, with verse 1:1 being a later addition. Carl Heinrich Cornill states that Zechariah 9–14 and Malachi are anonymous and were therefore placed at the end of the ": null
    },
    {
        "Book of the Twelve": "Book Of The Twelve"
    },
    {
        ". ": null
    },
    {
        "Wellhausen": "Julius Wellhausen"
    },
    {
        ", ": null
    },
    {
        "Abraham Kuenen": "Abraham Kuenen"
    },
    {
        ", and Wilhelm Gustav Hermann Nowack argue that Malachi 1:1 is a late addition, pointing to ": null
    },
    {
        "Zechariah": "Book Of Zechariah"
    },
    {
        " 9:1 and 12:1. However, other scholars, including the editors of the Catholic Encyclopedia, argue that the grammatical evidence leads us to conclude that Malachi is in fact a name.     Another interpretation of the authorship comes from the ": null
    },
    {
        "Septuagint": "Septuagint"
    },
    {
        " superscription, ὲν χειρὶ ἀγγήλου αὐτοῦ, which can be read as either by the hand of his messenger or as by the hand of his angel . The angel reading found an echo among the ancient ": null
    },
    {
        "Church Fathers": "Church Fathers"
    },
    {
        " and ecclesiastical writers, and even gave rise to the strangest fancies , especially among the disciples of ": null
    },
    {
        "Origen of Alexandria": "Origen Of Alexandria"
    },
    {
        ". A. VAN HOONACKER,  , The Original Catholic Encyclopedia, retrieved 12 February 2011. http://www.ccel.org/ccel/schaff/npnf206.vii.iv.xii.htmlvii.iv.xii-p32 Prefaces to the Commentaries on the Minor Prophets., ": null
    },
    {
        "Jerome": "Jerome"
    },
    {
        ", 406:  Origen and his followers believe that he was an angel. But we reject this view altogether, lest we be compelled to accept the doctrine of the fall of souls from heaven.         There are very few historical details in the Book of Malachi. The greatest clue as to its dating may lie in the fact that the Persian-era term for governor is used in 1:8. This points to a post-exilic date of composition both because of the use of the Persian period term and because ": null
    },
    {
        "Judah": "Kingdom Of Judah"
    },
    {
        " had a king before the exile. Since, in the same verse, the temple has been rebuilt, the book must also be later than 515  BC.  Malachi was apparently known to the author of ": null
    },
    {
        "Ecclesiasticus": "Sirach"
    },
    {
        " early in the 2nd century BC. Because of the development of themes in the book of Malachi, most scholars assign it to a position after ": null
    },
    {
        "Haggai": "Book Of Haggai"
    },
    {
        " and ": null
    },
    {
        "Zechariah": "Book Of Zechariah"
    },
    {
        ",   close to the time of Ezra and when ": null
    },
    {
        "Nehemiah": "Nehemiah"
    },
    {
        " came to ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        " in 445  BC.          The Book of Malachi was written to correct the lax religious and social behaviour of the ": null
    },
    {
        "Israelites": "Israelite"
    },
    {
        " – particularly the priests – in post-exilic ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        ". Although the prophets urged the people of ": null
    },
    {
        "Judah": "Kingdom Of Judah"
    },
    {
        " and ": null
    },
    {
        "Israel": "Israel"
    },
    {
        " to see their exile as punishment for failing to uphold their covenant with God, it was not long after they had been restored to the land and to ": null
    },
    {
        "Temple": "Temple In Jerusalem"
    },
    {
        " worship that the peoples commitment to their God began, once again, to wane. It was in this context that the prophet commonly referred to as Malachi delivered his prophecy.     In 1:2, Malachi has the people of Israel question Gods love for them. This introduction to the book illustrates the severity of the situation which Malachi addresses. The graveness of the situation is also indicated by the dialectical style with which Malachi confronts his audience. Malachi proceeds to accuse his audience of failing to respect God as God deserves. One way in which this disrespect is made manifest is through the substandard sacrifices which Malachi claims are being offered by the priests. While God demands animals that are without blemish , the priests, who were to determine whether the animal was acceptable , were offering blind, lame and sick animals for sacrifice because they thought nobody would notice.     In 2:1, Malachi states Yahweh Sabaoth is sending a curse on the priests who have not honored him with appropriate animal sacrifices: Now, watch how I am going to paralyze your arm and throw dung in your face--the dung from your very solemnities--and sweep you away with it. Then you shall learn that it is I who have given you this warning of my intention to abolish my covenant with Levi, says Yahweh Sabaoth.     In 2:10, Malachi addresses the issue of divorce. On this topic, Malachi deals with divorce both as a social problem and as a religious problem . In contrast to the ": null
    },
    {
        "book of Ezra": "Book Of Ezra"
    },
    {
        ", Malachi urges each to remain steadfast to the wife of his youth.     Malachi also criticizes his audience for questioning Gods justice. He reminds them that God is just, exhorting them to be faithful as they await that justice. Malachi quickly goes on to point out that the people have not been faithful. In fact, the people are not giving God all that God deserves. Just as the priests have been offering unacceptable sacrifices, so the people have been neglecting to offer their full ": null
    },
    {
        "tithe": "Tithe"
    },
    {
        " to God. The result of these shortcomings is that the people come to believe that no good comes out of serving God.     Malachi assures the faithful among his audience that in the ": null
    },
    {
        "eschaton": "Eschatology"
    },
    {
        ", the differences between those who served God faithfully and those who did not will become clear. The book concludes by calling upon the teachings of ": null
    },
    {
        "Moses": "Moses"
    },
    {
        " and by promising that ": null
    },
    {
        "Elijah": "Elijah"
    },
    {
        " will return prior to the ": null
    },
    {
        "Day of Yahweh": "Last Judgement"
    },
    {
        ".         The book of Malachi is divided into three chapters in the ": null
    },
    {
        "Hebrew Bible": "Hebrew Bible"
    },
    {
        " and the ": null
    },
    {
        "Greek Septuagint": "Septuagint"
    },
    {
        " and four chapters in the ": null
    },
    {
        "Latin Vulgate": "Latin Vulgate"
    },
    {
        ". The fourth chapter in the Vulgate consists of the remainder of the third chapter starting at verse 3:19.       The ": null
    },
    {
        "New Revised Standard Version": "New Revised Standard Version"
    },
    {
        " of the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        " supplies headings for the book as follows:          The majority of scholars consider the book to be made up of six distinct oracles. According to this scheme, the book of Malachi consists of a series of disputes between ": null
    },
    {
        "Yahweh": "Tetragrammaton"
    },
    {
        " and the various groups within the ": null
    },
    {
        "Israelite": "Israelite"
    },
    {
        " community. In the course of the books three or four chapters, ": null
    },
    {
        "Yahweh": "Tetragrammaton"
    },
    {
        " is vindicated while those who do not adhere to the law of ": null
    },
    {
        "Moses": "Moses"
    },
    {
        " are condemned. Some scholars have suggested that the book, as a whole, is structured along the lines of a judicial trial, a suzerain treaty or a covenant—one of the major themes throughout the ": null
    },
    {
        "Hebrew Scriptures": "Hebrew Bible"
    },
    {
        ". Implicit in the prophets condemnation of Israels religious practices is a call to keep ": null
    },
    {
        "Yahwehs": "Tetragrammaton"
    },
    {
        " statutes.     The Book of Malachi draws upon various themes found in other books of the Bible. Malachi appeals to the rivalry between ": null
    },
    {
        "Jacob and Esau": "Jacob And Esau"
    },
    {
        " and of ": null
    },
    {
        "Yahwehs": "Tetragrammaton"
    },
    {
        " preference for Jacob contained in ": null
    },
    {
        "Book of Genesis": "Book Of Genesis"
    },
    {
        " 25–28. Malachi reminds his audience that, as descendants of Jacob , they have been and continue to be favoured by God as Gods chosen people. In the second dispute, Malachi draws upon the Levitical Code  in condemning the priest for offering unacceptable sacrifices.     In the third dispute , the author of the Book of Malachi likely intends his argument to be understood on two levels. Malachi appears to be attacking either the practice of divorcing Jewish wives in favour of foreign ones  or, alternatively, Malachi could be condemning the practice of divorcing foreign wives in favour of ": null
    },
    {
        "Jew": "Jew"
    },
    {
        "ish wives . Malachi appears adamant that nationality is not a valid reason to terminate a marriage, For I hate divorce, says the Lord . . . .     In many places throughout the ": null
    },
    {
        "Hebrew Scriptures": "Hebrew Bible"
    },
    {
        " – particularly the ": null
    },
    {
        "Book of Hosea": "Book Of Hosea"
    },
    {
        " – ": null
    },
    {
        "Israel": "Israel"
    },
    {
        " is figured as ": null
    },
    {
        "Yahwehs": "Tetragrammaton"
    },
    {
        " wife or bride. Malachis discussion of divorce may also be understood to conform to this metaphor. Malachi could very well be urging his audience not to break faith with ": null
    },
    {
        "Yahweh": "Tetragrammaton"
    },
    {
        "  by adopting new gods or idols. It is quite likely that, since the people of ": null
    },
    {
        "Judah": "Kingdom Of Judah"
    },
    {
        " were questioning ": null
    },
    {
        "Yahwehs": "Tetragrammaton"
    },
    {
        " love and justice , they might be tempted to adopt foreign gods. William LaSor suggests that, because the restoration to the land of ": null
    },
    {
        "Judah": "Kingdom Of Judah"
    },
    {
        " had not resulted in anything like the prophesied splendor of the ": null
    },
    {
        "messianic age": "Messiah"
    },
    {
        " which had been prophesied, the people were becoming quite disillusioned with their religion.          Indeed, the fourth dispute asserts that judgment is coming in the form of a messenger who is like refiners fire and like fullers soap . . . . Following this, the prophet provides another example of wrongdoing in the fifth dispute – that is, failing to offer full tithes. In this discussion, Malachi has ": null
    },
    {
        "Yahweh": "Tetragrammaton"
    },
    {
        " request the people to Bring the full tithe . . . see if I will not open the windows of heaven for you and pour down on you an overflowing blessing . This request offers the opportunity for the people to amend their ways. It also stresses that keeping the Lords statutes will not only allow the people to avoid Gods wrath, but will also lead to Gods blessing. In the sixth dispute, the people of ": null
    },
    {
        "Israel": "Israel"
    },
    {
        " illustrate the extent of their disillusionment. Malachi has them say It is vain to serve God . . . Now we count the arrogant happy; evildoers not only prosper, but when they put God to the test they escape . Once again, Malachi has ": null
    },
    {
        "Yahweh": "Tetragrammaton"
    },
    {
        " assure the people that the wicked will be punished and the faithful will be rewarded.     In the light of what Malachi understands to be an imminent judgment, he exhorts his audience to Remember the teaching of my servant ": null
    },
    {
        "Moses": "Moses"
    },
    {
        ", that statutes and ordinances that I commanded him at ": null
    },
    {
        "Horeb": "Mount Horeb"
    },
    {
        " for all ": null
    },
    {
        "Israel": "Israel"
    },
    {
        " . Before the ": null
    },
    {
        "Day of the Lord": "Last Judgment"
    },
    {
        ", Malachi declares that ": null
    },
    {
        "Elijah": "Elijah"
    },
    {
        "  will return to earth in order that people might follow in Gods ways.     Primarily because of its ": null
    },
    {
        "messianic": "Messiah"
    },
    {
        " promise, the Book of Malachi is frequently referred to in the ": null
    },
    {
        "Christian": "Christianity"
    },
    {
        " New Testament": "New Testament"
    },
    {
        ". What follows is a brief comparison between the Book of Malachi and the ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        " texts which refer to it .          Although many Christians believe that the ": null
    },
    {
        "messianic": "Messiah"
    },
    {
        " prophecies of the Book of Malachi have been fulfilled in the life, ministry, ": null
    },
    {
        "transfiguration": "Transfiguration Of Jesus"
    },
    {
        ", death and resurrection of ": null
    },
    {
        "Jesus of Nazareth": "Jesus"
    },
    {
        ", most Jews continue to await the coming of the prophet ": null
    },
    {
        "Elijah": "Elijah"
    }
]