[
    {
        "                  Book of Common Prayer  is the short title of a number of related ": null
    },
    {
        "prayer books": "Prayer Book"
    },
    {
        "used in the ": null
    },
    {
        "Anglican Communion": "Anglican Communion"
    },
    {
        ", as well as by other ": null
    },
    {
        "Christian": "Christianity"
    },
    {
        " churches historically related to Anglicanism. The original book, published in 1549 in the reign of ": null
    },
    {
        "Edward VI": "Edward Vi Of England"
    },
    {
        ", was a product of the ": null
    },
    {
        "English Reformation": "English Reformation"
    },
    {
        " following the break with ": null
    },
    {
        "Rome": "Catholic Church"
    },
    {
        ". The work of 1549 was the first prayer book to include the complete forms of service for daily and Sunday worship in English. It contained ": null
    },
    {
        "Morning Prayer": "Morning Prayer"
    },
    {
        ", ": null
    },
    {
        "Evening Prayer": "Evening Prayer"
    },
    {
        ", the ": null
    },
    {
        "Litany": "Litany"
    },
    {
        ", and ": null
    },
    {
        "Holy Communion": "Holy Communion"
    },
    {
        " and also the occasional services in full: the orders for ": null
    },
    {
        "Baptism": "Baptism"
    },
    {
        ", ": null
    },
    {
        "Confirmation": "Confirmation"
    },
    {
        ", ": null
    },
    {
        "Marriage": "Marriage"
    },
    {
        ", ": null
    },
    {
        "prayers to be said with the sick": "Anointing Of The Sick"
    },
    {
        " , and a ": null
    },
    {
        "funeral": "Funeral"
    },
    {
        " service. It also set out in full the ": null
    },
    {
        "propers": "Propers"
    },
    {
        " : the ": null
    },
    {
        "introit": "Introit"
    },
    {
        "s, ": null
    },
    {
        "collect": "Collect"
    },
    {
        "s, and ": null
    },
    {
        "epistle": "Epistle"
    },
    {
        " and ": null
    },
    {
        "gospel": "Gospel"
    },
    {
        " readings for the Sunday service of Holy Communion. ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        " and ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        " readings for daily prayer were specified in tabular format as were the ": null
    },
    {
        "Psalms": "Psalms"
    },
    {
        "; and ": null
    },
    {
        "canticles": "Canticles"
    },
    {
        ", mostly biblical, that were provided to be said or sung between the readings.      The 1549 book was soon succeeded by a more reformed revision in 1552 under the same editorial hand, that of ": null
    },
    {
        "Thomas Cranmer": "Thomas Cranmer"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        ". It was used only for a few months, as after Edward VIs death in 1553, his half-sister ": null
    },
    {
        "Mary I": "Mary I Of England"
    },
    {
        " restored Roman Catholic worship. Mary died in 1558 and, in 1559, ": null
    },
    {
        "Elizabeth I": "Elizabeth I Of England"
    },
    {
        " reintroduced the 1552 book with modifications to make it acceptable to more traditionally minded worshippers and clergy.     In 1604, ": null
    },
    {
        "James I": "James I Of England"
    },
    {
        " ordered some further changes, the most significant being the addition to the Catechism of a section on the Sacraments. Following the tumultuous events surrounding the ": null
    },
    {
        "English Civil War": "English Civil War"
    },
    {
        ", when the Book was again abolished, another modest revision was published in 1662 . That edition remains the official prayer book of the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ", although through the later twentieth century alternative forms which were technically supplements largely displaced the Book of Common Prayer for the main Sunday worship of most English ": null
    },
    {
        "parish": "Parish"
    },
    {
        " churches.     A Book of Common Prayer with local variations is used in churches around, or deriving from, the ": null
    },
    {
        "Anglican Communion": "Anglican Communion"
    },
    {
        " in over 50 different countries and in over 150 different languages.  In some parts of the world, the 1662 Book remains technically authoritative but other books or patterns have replaced it in regular worship.     Traditional English ": null
    },
    {
        "Lutheran": "Lutheran"
    },
    {
        ", ": null
    },
    {
        "Methodist": "Methodist"
    },
    {
        " and ": null
    },
    {
        "Presbyterian": "Presbyterian"
    },
    {
        " prayer books have borrowed from the Book of Common Prayer and the marriage and burial rites have found their way into those of other denominations and into the English language. Like the ": null
    },
    {
        "King James Version": "King James Version"
    },
    {
        " of the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        " and the works of ": null
    },
    {
        "Shakespeare": "Shakespeare"
    },
    {
        ", many words and phrases from the Book of Common Prayer have entered common parlance.         The full name of the 1662 Book of Common Prayer is The Book of Common Prayer and Administration of the Sacraments and other Rites and Ceremonies of the Church, according to the use of the Church of England, Together with the Psalter or Psalms of David, pointed as they are to be Sung or said in churches: And the Form and Manner of Making, ordaining, and Consecrating of Bishops, Priests, and Deacons.               The forms of ": null
    },
    {
        "parish": "Parish"
    },
    {
        " worship in the late medieval church in England, which followed the Latin ": null
    },
    {
        "Roman Rite": "Roman Rite"
    },
    {
        ", varied according to local practice. By far the most common form, or use , found in Southern England was that of ": null
    },
    {
        "Sarum": "Use Of Sarum"
    },
    {
        " . There was no single book; the services that would be provided by the Book of Common Prayer were to be found in the ": null
    },
    {
        "Missal": "Missal"
    },
    {
        " , the ": null
    },
    {
        "Breviary": "Roman Breviary"
    },
    {
        " , Manual , and ": null
    },
    {
        "Pontifical": "Pontifical"
    },
    {
        " . The chant  for worship was contained in the ": null
    },
    {
        "Roman Gradual": "Roman Gradual"
    },
    {
        " for the ": null
    },
    {
        "Mass": "Mass In The Catholic Church"
    },
    {
        ", the ": null
    },
    {
        "Antiphoner": "Antiphoner"
    },
    {
        " for the offices, and the Processionale for the ": null
    },
    {
        "litanies": "Litanies"
    },
    {
        ". The Book of Common Prayer has never contained prescribed music or chant; however, ": null
    },
    {
        "John Merbecke": "John Merbecke"
    },
    {
        " produced his Booke of Common Praier noted in 1550 which set what would have been the proper of the Mass  in the new BCP to simple plainchant inspired by Sarum Use.     The work of producing a ": null
    },
    {
        "liturgy": "Liturgy"
    },
    {
        " in the English language was largely done by ": null
    },
    {
        "Thomas Cranmer": "Thomas Cranmer"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        ", starting cautiously in the reign of ": null
    },
    {
        "Henry VIII": "Henry Viii Of England"
    },
    {
        " and then more radically under his son ": null
    },
    {
        "Edward VI": "Edward Vi Of England"
    },
    {
        ". In his early days Cranmer was a conservative ": null
    },
    {
        "humanist": "Christian Humanism"
    },
    {
        ": he was an admirer ": null
    },
    {
        "Erasmus": "Erasmus"
    },
    {
        ". After 1531, Cranmers contacts with reformers from continental Europe helped to change his outlook. The ": null
    },
    {
        "Exhortation and Litany": "Exhortation And Litany"
    },
    {
        ", the earliest English-language service of the Church of England, was the first overt manifestation of his changing views. It was no mere translation from the Latin: its ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        " character is made clear by the drastic reduction of the place of ": null
    },
    {
        "saint": "Saint"
    },
    {
        "s, compressing what had been the major part into three petitions. Published in 1544, it borrowed greatly from ": null
    },
    {
        "Martin Luthers": "Martin Luther"
    },
    {
        "Litany and ": null
    },
    {
        "Myles Coverdales New Testament": "Coverdale Bible"
    },
    {
        " and was the only service that might be considered to be Protestant to be finished within the lifetime of King Henry VIII.              Only after the death of Henry VIII and the accession of Edward VI in 1547 could revision proceed faster. In 1548, Cranmer finished his work on the Order of the Communion , which was an English ": null
    },
    {
        "Communion": "Eucharist"
    },
    {
        " rite placed within the Latin Mass after the priests own communion. It included an exhortation, a penitential section that included confession and absolution as spiritual preparation, and the administration of the bread and wine. ": null
    },
    {
        "Communion under both kinds": "Communion Under Both Kinds"
    },
    {
        " for the laity was a return to the ancient practice of the church but a departure from the Catholic Churchs practice since the 13th century of giving the laity the bread only. The order also included what would become known as the Comfortable Words and the ": null
    },
    {
        "Prayer of Humble Access": "Prayer Of Humble Access"
    },
    {
        ". The Communion order was incorporated into the new prayer book of 1549 largely unchanged.     While the English people were becoming accustomed to the new communion service, Cranmer and his colleagues were working on a complete English prayer book. Cranmer is credited the overall job of editorship and the overarching structure of the book ; though, he borrowed and adapted material from other sources. He relied heavily on the Sarum rite and the traditional English service books as well as from the English primers used by the laity. Other Christian liturgical traditions also influenced Cranmer, including ": null
    },
    {
        "Greek Orthodox": "Greek Orthodox"
    },
    {
        " and ": null
    },
    {
        "Mozarabic": "Mozarabic"
    },
    {
        " texts. These latter rites had the advantage of being ": null
    },
    {
        "catholic": "Catholic"
    },
    {
        " but not Roman Catholic. ": null
    },
    {
        "Cardinal Quiñones": "Francisco De Quiñones"
    },
    {
        " revision of the daily office was also a resource. He borrowed much from German sources, particularly from work commissioned by ": null
    },
    {
        "Hermann von Wied": "Hermann Of Wied"
    },
    {
        ", Archbishop of Cologne; and also from ": null
    },
    {
        "Andreas Osiander": "Andreas Osiander"
    },
    {
        " . The Church Order of Brandenberg and Nuremberg was partly the work of the latter. Many phrases are characteristic of the German reformer ": null
    },
    {
        "Martin Bucer": "Martin Bucer"
    },
    {
        ", the Italian ": null
    },
    {
        "Peter Martyr": "Pietro Martire Vermigli"
    },
    {
        " or of his chaplain, ": null
    },
    {
        "Thomas Becon": "Thomas Becon"
    },
    {
        ".     Early in the draft process, bishops and theologians filled out questionnaires on liturgical theology. In September 1548, bishops and senior clergy met at ": null
    },
    {
        "Chertsey Abbey": "Chertsey Abbey"
    },
    {
        " and then later at Windsor and agreed that the service of the church ought to be in the mother tongue.  These meetings were likely the final steps in a longer process of composition and revision. There is no evidence that the book was ever approved by the ": null
    },
    {
        "Convocations of Canterbury and York": "Convocations Of Canterbury And York"
    },
    {
        ". In December 1548, the traditionalist and Protestant bishops debated the prayer books eucharistic theology in the House of Lords. Despite conservative opposition, Parliament passed the ": null
    },
    {
        "Act of Uniformity": "Act Of Uniformity 1549"
    },
    {
        " on 21 January 1549, and the newly authorised Book of Common Prayer was required to be in use by ": null
    },
    {
        "Whitsunday": "Whitsunday"
    },
    {
        ", 9 June.       The BCP replaced the several service books then in use and was less complicated than the older system. The prayer book had provisions for the daily offices, scripture readings for Sundays and holy days, and services for communion, public baptism, confirmation, ": null
    },
    {
        "matrimony": "Matrimony"
    },
    {
        ", ": null
    },
    {
        "visitation of the sick": "Anointing Of The Sick"
    },
    {
        ", burial, ": null
    },
    {
        "purification of women": "Churching Of Women"
    },
    {
        " and ": null
    },
    {
        "Ash Wednesday": "Ash Wednesday"
    },
    {
        ". An ": null
    },
    {
        "ordinal": "Wikt:Ordinalnoun"
    },
    {
        " for ordination services was added in 1550. There was also a calendar and ": null
    },
    {
        "lectionary": "Lectionary"
    },
    {
        ", which meant a Bible and a ": null
    },
    {
        "Psalter": "Psalter"
    },
    {
        " were the only other books required by a priest. Compared to the liturgies produced by the ": null
    },
    {
        "continental Reformed church": "Continental Reformed Church"
    },
    {
        "es in the same period, the BCP seems relatively conservative. For England, however, it represented a major theological shift toward Protestantism. The preface to the 1549 edition, which contained Cranmers explanation as to why a new prayer book was necessary, began: There was never any thing by the wit of man so well devised, or so sure established, which in continuance of time hath not been corrupted.  In the late 1530s, Cranmer had adopted ": null
    },
    {
        "Lutheran": "Lutheran"
    },
    {
        " views, but by the time the prayer book was published his beliefs had shifted toward the ": null
    },
    {
        "Reformed churches": "Reformed Churches"
    },
    {
        " and theologians such as Martin Bucer and ": null
    },
    {
        "Heinrich Bullinger": "Heinrich Bullinger"
    },
    {
        ". Cranmers doctrinal concerns can be seen in the systematic amendment of source material to remove any idea that human merit contributed to an individuals salvation.     The doctrines of ": null
    },
    {
        "justification": "Sola Fide"
    },
    {
        " and ": null
    },
    {
        "predestination": "Predestination"
    },
    {
        " are central to Cranmers theology. In justification, God grants the individual ": null
    },
    {
        "faith": "Faith In Christianity"
    },
    {
        " by which the ": null
    },
    {
        "righteousness of Christ is claimed": "Imputed Righteousness"
    },
    {
        " and the ": null
    },
    {
        "sinner": "Christian Views On Sin"
    },
    {
        " is forgiven. This doctrine is implicit throughout the prayer book, and it had important implications for his understanding of the ": null
    },
    {
        "sacrament": "Sacrament"
    },
    {
        "s. For Cranmer, a sacrament is a sign of an holy thing that signifies what it represents but is not identical to it. With this understanding, Cranmer believed that someone who is not one of Gods ": null
    },
    {
        "elect": "Unconditional Election"
    },
    {
        " receives only the outward form of the sacrament but does not receive actual ": null
    },
    {
        "grace": "Grace In Christianity"
    },
    {
        ". Only the elect receive the sacramental sign and the grace. This is because faith—which is a gift only the elect are given—unites the outward sign and the inward grace and makes the sacrament effective. This position was in agreement with the Reformed churches but was opposed to the Roman Catholic and Lutheran views.            When it came to the Eucharist, a priority for Protestants was to replace the Roman Catholic teaching that the Mass was a sacrifice to God with the Protestant teaching that it was a service of thanksgiving and spiritual communion with Christ. As a compromise with conservatives, the word Mass was kept, with the service titled The Supper of the Lord and the Holy Communion, commonly called the Mass.  It also preserved much of the medieval structure of the Mass—": null
    },
    {
        "stone altars": "Altar In The Catholic Church"
    },
    {
        " remained, the clergy wore traditional ": null
    },
    {
        "vestment": "Vestment"
    },
    {
        "s, much of the service was sung, and the priest was instructed to put the communion wafer into a communicants mouth instead of in their hand. Nevertheless, the first BCP was a radical departure from traditional worship in that it eliminated almost everything that had, till then, been central to lay Eucharistic piety . Cranmers intention was to suppress notions of sacrifice and ": null
    },
    {
        "transubstantiation": "Transubstantiation"
    },
    {
        " in the Mass.     In the new liturgy, the priest ": null
    },
    {
        "faced the congregation": "Versus Populum"
    },
    {
        " instead of ": null
    },
    {
        "turning his back to them": "Ad Orientem"
    },
    {
        ". The ": null
    },
    {
        "offertory": "Offertory"
    },
    {
        " departed from the medieval pattern, which focused on offering the bread and wine which were to be consecrated as the body and blood of Christ. The new offertory was simply a collection for the poor and referred only to an offering of praise and thanksgiving for Christs one sacrifice. The ": null
    },
    {
        "prayer of consecration": "Anaphora"
    },
    {
        " was based on the Sarum version of the ": null
    },
    {
        "Canon of the Mass": "Canon Of The Mass"
    },
    {
        ". Before the ": null
    },
    {
        "words of institution": "Words Of Institution"
    },
    {
        ", the priest asks ": null
    },
    {
        "God the Father": "God The Father"
    },
    {
        " with thy holy spirit and word, vouchsafe to bless and sanctify these thy gifts and creatures of bread and wine, that they may be unto us the body and blood of thy most dearly beloved son Jesus Christ . This ": null
    },
    {
        "epiclesis": "Epiclesis"
    },
    {
        " or invocation of the ": null
    },
    {
        "Holy Spirit": "Holy Spirit In Christianity"
    },
    {
        " was not meant to imply that a transformation occurred in the elements. Cranmer made clear elsewhere that to bless something meant only to set it apart for a holy purpose. In praying that they may be unto us the body and blood , Cranmer meant that the bread and wine would represent the body and blood, which can only be received spiritually. While the medieval Canon explicitly identified the priests action at the altar with the sacrifice of Christ , the prayer book broke this connection by stating the churchs offering of thanksgiving in the Eucharist was not the same as ": null
    },
    {
        "Christs sacrifice on the cross": "Crucifixion Of Jesus"
    },
    {
        ". Christs sacrifice on the cross was his one oblation of himself once offered ... a full, perfect and sufficient sacrifice, oblation and satisfaction, for the sins of the whole world . The 1549 rite defined the churchs ": null
    },
    {
        "oblation": "Oblation"
    },
    {
        " not as the offering of Christ to God but rather as a self-offering of the whole church, oure selfe, our soules, and bodies . Bard Thompson, Liturgies of the Western Church, 1962, p. 235-236  To further stress this, there was no ": null
    },
    {
        "elevation of the consecrated bread and wine": "Elevation"
    },
    {
        ", and ": null
    },
    {
        "eucharistic adoration": "Eucharistic Adoration"
    },
    {
        " was prohibited. The elevation had been the central moment of the medieval Mass, attached as it was to the idea of ": null
    },
    {
        "real presence": "Real Presence"
    },
    {
        ".     For centuries it was held that Cranmers theology of Christs presence in the Eucharist was ": null
    },
    {
        "Zwinglian": "Zwinglian"
    },
    {
        ". It was actually closer to the Calvinist ": null
    },
    {
        "spiritual presence view": "Lords Supper In Reformed Theology"
    },
    {
        " and can be described as ": null
    },
    {
        "Receptionism": "Receptionism"
    },
    {
        " and Virtualism: i.e. Christ is really present but by the power of the Holy Spirit. The Study of Liturgy, Editors: Cheslyn Jones, Geoffrey Wainwright, Edward Yarnold SJ and Paul Bradshaw, 1992, p. 36   The words of administration in the 1549 rite were deliberately ambiguous: The body of our Lord Jesus Christ which was given for thee, preserve thy body and soul unto everlasting life . This could be understood as identifying the bread with the body of Christ or as a prayer that the communicant might spiritually receive the body of Christ by faith.     Cranmer hoped to establish the practice of weekly congregational communion, and included exhortations to encourage this; and instructions that communion should never be received by the priest alone. This represented a radical change from late medieval practice—whereby the primary focus of congregational worship was taken to be attendance at the consecration, and adoration of the elevated consecrated host. In late medieval England, lay people regularly received communion only at ": null
    },
    {
        "Easter": "Easter"
    },
    {
        ". In the 1549 rite, those not receiving communion were supposed to leave after the offertory. If there were no communicants, the service was to end without Communion–known as Ante-Communion–and this was how it frequently did end.       In the Middle Ages, baptism was believed to be necessary for salvation and would be performed soon after birth on any day of the week. For Cranmer, salvation depended on Gods prior election, so being unbaptised would not affect an infants salvation. The Prayer Book restricted baptism to Sundays, feast days, or Morning and Evening Prayer when a congregation could observe and be reminded of their own baptisms. In case of emergency, baptism could be performed at home. Cranmer based his baptism service on ": null
    },
    {
        "Martin Luthers": "Martin Luther"
    },
    {
        "service, which was a simplification of the long and complex medieval rite. Like communion, the baptism service maintained a traditional form. A few symbolic actions and repetitive prayers were kept, including one prayer of ": null
    },
    {
        "minor exorcism": "Minor Exorcism In Christianity"
    },
    {
        ". The child was signed with the cross prior to baptism and afterward dressed in traditional white ": null
    },
    {
        "baptismal clothing": "Baptismal Clothing"
    },
    {
        " and ": null
    },
    {
        "anointed": "Chrism"
    },
    {
        ". It also included a ": null
    },
    {
        "blessing of the water": "Holy Water"
    },
    {
        " in the ": null
    },
    {
        "baptismal font": "Baptismal Font"
    },
    {
        ".     Cranmers work of simplification and revision was also applied to the Daily Offices, which were reduced to ": null
    },
    {
        "Morning": "Morning Prayer"
    },
    {
        " and ": null
    },
    {
        "Evening Prayer": "Evening Prayer"
    },
    {
        ". Cranmer hoped these would also serve as a daily form of prayer to be used by the laity, thus replacing both the late medieval lay observation of the Latin ": null
    },
    {
        "Hours of the Virgin": "Book Of Hours"
    },
    {
        " and its English equivalent, the Primer. This simplification was anticipated by the work of Cardinal Quiñones, a Spanish ": null
    },
    {
        "Franciscan": "Franciscan"
    },
    {
        ", in his abortive revision of the Roman Breviary published in 1537. Cranmer took up Quiñoness principle that everything should be sacrificed to secure continuity in singing the Psalter and reading the Bible. His first draft, produced during Henrys reign, retained the traditional seven distinct ": null
    },
    {
        "canonical hours": "Canonical Hours"
    },
    {
        " of Office prayer; but in his second draft, while he retained the Latin, he consolidated these into two. The 1549 book established a rigorously biblical cycle of readings for Morning and Evening Prayer and a Psalter to be read consecutively throughout each month. A chapter from the ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        " and the ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        " were read at each service. Both offices had a ": null
    },
    {
        "canticle": "Canticle"
    },
    {
        " after each reading. For Morning Prayer, the  Te Deum  or  Benedicite  followed the Old Testament reading and the  Benedictus  followed the New Testament reading. At Evening Prayer, the  Magnificat  and  Nunc dimittis  were sung.       The BCP was said to have pleased neither reformers nor their opponents, indeed the ": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        " Bishop ": null
    },
    {
        "Gardiner": "Stephen Gardiner"
    },
    {
        " could say of it was that it was patient of a catholic interpretation . It was clearly unpopular in the parishes of Devon and Cornwall where, along with severe social problems, its introduction was one of the causes of the commotions , or rebellions in the summer of that year, partly because many Cornish people lacked sufficient English to understand it. It appears that it was far less significant in the other commotions in the Home Counties and the Eastern Rebellion .  , The banning of processions and the sending out of commissioners to enforce the new requirements was particularly unpopular. Although this is difficult to verify it seems that there was widespread opposition to the introduction of regular congregational Communion, partly because the extra costs of bread and wine that would fall on the parish; but mainly out of an intense resistance to undertaking in regular worship, a religious   practice previously associated with marriage or illness.          The 1549 book was, from the outset, intended only as a temporary expedient, as Bucer was assured having met Cranmer for the first time in April 1549: concessions...made both as a respect for antiquity and to the infirmity of the present age as he wrote. . Both Bucer and Peter Martyr wrote detailed proposals for modification; Bucers Censura ran to 28 chapters which influenced Cranmer significantly though he did not follow them slavishly and the new book was duly produced in 1552, making fully perfect what was already implicit.   The policy of incremental reform was now unveiled: more Roman Catholic practices were now excised, as doctrines had in 1549 been subtly changed. Thus, in the ": null
    },
    {
        "Eucharist": "Eucharist"
    },
    {
        ", gone were the words ": null
    },
    {
        "Mass": "Mass"
    },
    {
        " and ": null
    },
    {
        "altar": "Altar"
    },
    {
        "; the ": null
    },
    {
        "Lord have mercy": "Kyrie"
    },
    {
        " was interleaved into a recitation of the ": null
    },
    {
        "Ten Commandments": "Ten Commandments"
    },
    {
        " and the ": null
    },
    {
        "Gloria": "Gloria In Excelsis Deo"
    },
    {
        " was removed to the end of the service. The Eucharistic prayer was split in two so that Eucharistic bread and wine were shared immediately after the words of institution ; while its final element, the Prayer of Oblation, , was transferred, much changed, to a position after the priest and congregation had received Communion, and was made optional to an alternative prayer of thanksgiving. The Elevation of the Host had been forbidden in 1549; all manual acts were now omitted. The words at the administration of Communion which, in the prayer book of 1549 described the Eucharistic species as The body of our Lorde Jesus Christe..., The blood of our Lorde Jesus Christe... were replaced with the words Take, eat, in remembrance that Christ died for thee.. etc. The Peace, at which in the early Church the congregation had exchanged a greeting, was removed altogether. Vestments such as the ": null
    },
    {
        "stole": "Stole"
    },
    {
        ", ": null
    },
    {
        "chasuble": "Chasuble"
    },
    {
        " and ": null
    },
    {
        "cope": "Cope"
    },
    {
        " were no longer to be worn, but only a ": null
    },
    {
        "surplice": "Surplice"
    },
    {
        ", removing all elements of sacrificial offering from the Latin Mass; so that it should cease to be seen as a ritual at which the priest, on behalf of the flock gave Christ to God and such as wanted partook of Christ; and might rather be seen as a ritual whereby Christ shared his body and blood, according to a different sacramental theology, with the faithful.     Cranmer recognized that the 1549 rite of Communion was capable of conservative misinterpretation and misuse in that the consecration rite might still be undertaken even when no congregational Communion followed. Consequently, in 1552 he thoroughly integrated Consecration and Communion into a single rite, with congregational preparation preceding the words of institution—such that it would not be possible to mimic the Mass with the priest communicating alone. He appears nevertheless, to have been resigned to being unable for the present to establish in parishes the weekly practice of receiving Communion; so he restructured the service so as to allow ante-Communion as a distinct rite of worship—following the Communion rite through the readings and offertory, as far as the intercessory Prayer for the Church Militant .     Cranmer made sure in the Second Prayer Book Rite that no possible ambiguity or association with sacrifice would be made: the Prayer of Consecration ended with the Words of Institution. The rest of the prayer that had followed was completely eliminated. There is an oblation of sorts but it is not the same as in the Roman Rite in which the priest offers the sacrifice of Christ to God and by association the congregation during the consecration. The truncated 1549 Rite had referred to making and celebrating the memorial with the holy gifts without an oblation of them to God thus reducing the sacrifice to a memorial, prayers, praises and sentiments. In the 1552 Book the sacrifice of praise and thanksgiving is found in the optional post-communion Prayer of Oblation whereby the communicants ask that this our sacrifice of praise and thanksgiving be accepted followed by the self-oblation of the communicants as holy and living sacrifices. However such an arrangement raises the question what is the connection between the worshippers and the prayer of consecration other than to effect the Presence of Christ so they can make their communion and self-offering possible? Presumably the recipients can do so as a result of having made their communion rather than by offering themselves in union with Christ during the consecration? The intention was to eliminate the faithful as co-offerors with Christ and reduce them to worthy recipients. In making his changes he overthrew 1400 years of eucharistic liturgical doctrine and practice.     He omitted the Epiclesis.     Diarmaid MacCulloch suggests that Cranmers own Eucharistic theology in these years approximated most closely to that of ": null
    },
    {
        "Heinrich Bullinger": "Heinrich Bullinger"
    },
    {
        "; but that he intended the Prayer Book to be acceptable to the widest range of Reformed Eucharistic belief, including the high sacramental theology of ": null
    },
    {
        "Bucer": "Bucer"
    },
    {
        " and ": null
    },
    {
        "John Calvin": "John Calvin"
    },
    {
        ".  Indeed, he seems to have aligned his views with the latter by 1546. At the same time, however, Cranmer intended that constituent parts of the rites gathered into the Prayer Book should still, so far as possible, be recognizably derived from traditional forms and elements.     In the baptism service, the signing with the cross was moved until after the baptism and the exorcism, the anointing, the putting-on of the chrysom robe and the triple immersion were omitted. Most drastic of all was the removal of the Burial service from church: it was to take place at the graveside.  In 1549, there had been provision for a Requiem and prayers of commendation and committal, the first addressed to the deceased. All that remained was a single reference to the deceased, giving thanks for their delivery from the myseryes of this sinneful world. This new Order for the Burial of the Dead was a drastically stripped-down memorial service designed to undermine definitively the whole complex of traditional beliefs about Purgatory and intercessory prayer.     In other respects, however, both the Baptism and Burial services imply a theology of salvation that accords notably less with ": null
    },
    {
        "Reformed": "Reformed"
    },
    {
        " teachings than do the counterpart passages in the ": null
    },
    {
        "Thirty-Nine Articles of Religion": "Thirty-Nine Articles"
    },
    {
        ". In the Burial service, the possibility that a deceased person who has died in the faith may nevertheless not be counted amongst Gods ": null
    },
    {
        "elect": "Predestination"
    },
    {
        ", is not entertained. In the Baptism service the priest explicitly pronounces the baptised infant as being now  regenerate . In both cases, conformity with strict Reformed Protestant principles would have resulted in a conditional formulation. The continued inconsistency between the Articles of Religion and the Prayer Book remained a point of contention for Puritans; and would in the 19th century come close to tearing the Church of England apart, through the course of the ": null
    },
    {
        "Gorham judgement": "Gorham Judgement"
    },
    {
        ".     The Orders of Morning and Evening Prayer were extended by the inclusion of a penitential section at the beginning including a corporate confession of sin and a general absolution, although the text was printed only in Morning Prayer with rubrical directions to use it in the evening as well. The general pattern of Bible reading in 1549 was retained except that distinct Old and New Testament readings were now specified for Morning and Evening Prayer on certain feast days. Following the publication of the 1552 Prayer Book, a revised English Primer was published in 1553; adapting the Offices and Morning and Evening Prayer, and other prayers, for lay domestic piety.        The 1552 book, however, was used only for a short period, as Edward VI had died in the summer of 1553 and, as soon as she could do so, ": null
    },
    {
        "Mary I": "Mary I Of England"
    },
    {
        ", restored union with Rome. The Latin Mass was re-established, altars, roods and statues were reinstated; an attempt was made to restore the English Church to its Roman affiliation. Cranmer was punished for his work in the ": null
    },
    {
        "English Reformation": "English Reformation"
    },
    {
        " by being burned at the stake on 21 March 1556. Nevertheless, the 1552 book was to survive. After Marys death in 1558, it became the primary source for the Elizabethan Book of Common Prayer, with subtle if significant changes only.     Hundreds of Protestants fled into exile—establishing an English church in ": null
    },
    {
        "Frankfurt am Main": "Frankfurt Am Main"
    },
    {
        ". A bitter and very public dispute ensued between those, such as ": null
    },
    {
        "Edmund Grindal": "Edmund Grindal"
    },
    {
        " and ": null
    },
    {
        "Richard Cox": "Richard Cox"
    },
    {
        ", who wished to preserve in exile the exact form of worship of the 1552 Prayer Book; and those, such as ": null
    },
    {
        "John Knox": "John Knox"
    },
    {
        " the minister of the congregation, who regarded that book as still partially tainted with compromise. Eventually, in 1555, the civil authorities expelled Knox and his supporters to ": null
    },
    {
        "Geneva": "Geneva"
    },
    {
        ", where they adopted a new prayer book, The Form of Prayers, which derived principally from Calvins French La Forme des Prières.  Consequently, when the accession of ": null
    },
    {
        "Elizabeth I": "Elizabeth I"
    },
    {
        " re-asserted the dominance of the reformed Church of England, there remained a significant body of more Protestant believers who were nevertheless hostile to the Book of Common Prayer. John Knox took The Form of Prayers with him to Scotland, where it formed the basis of the Scottish  Book of Common Order .          Under ": null
    },
    {
        "Elizabeth I": "Elizabeth I Of England"
    },
    {
        ", a more permanent enforcement of the reformed Church of England was undertaken and the 1552 book was republished, scarcely altered, in 1559.  The Prayer Book of 1552 ...was a masterpiece of theological engineering,  were prepared in Japanese  ": null
    }
]