[
    {
        "             The borzoi , also called the Russian wolfhound , is a ": null
    },
    {
        "breed": "Dog Breed"
    },
    {
        " of ": null
    },
    {
        "domestic dog": "Domestic Dog"
    },
    {
        ". Descended from dogs brought to Russia from central Asian countries, it is similar in shape to a ": null
    },
    {
        "greyhound": "Greyhound"
    },
    {
        ", and is also a member of the ": null
    },
    {
        "sighthound": "Sighthound"
    },
    {
        " family.     The system by which Russians over the ages named their sighthounds was a series of descriptive terms, not actual names.  is the masculine singular form of an archaic Russian adjective that means fast .  is the basic term used by Russians, though  is usually dropped. The name  derived from the word , which means wavy, silky coat , just as   means shorthaired. In modern Russian, the breed commonly called the borzoi is officially known as . Other Russian sighthound breeds are  , called ; and  , called .     The most commonly used plural form is the regular formation borzois, which is the only plural cited in most dictionaries.   However, the Borzoi Club of America and the Borzoi Club UK  both prefer borzoi as the form for both singular and plural forms.                Borzois are large Russian ": null
    },
    {
        "sighthounds": "Sighthound"
    },
    {
        " that resemble some central Asian breeds such as the ": null
    },
    {
        "Afghan hound": "Afghan Hound"
    },
    {
        ", ": null
    },
    {
        "Saluki": "Saluki"
    },
    {
        ", and the ": null
    },
    {
        "Kyrgyz Taigan": "Taigan"
    },
    {
        ". Borzois can generally be described as long-haired ": null
    },
    {
        "greyhounds": "Greyhound"
    },
    {
        " . Borzois come in virtually any colour.  The borzoi coat is silky and flat, often wavy or slightly curly. The long top-coat is quite flat, with varying degrees of waviness or curling. The soft undercoat thickens during winter or in cold climates, but is shed in hot weather to prevent overheating. In its texture and distribution over the body, the borzoi coat is unique. There should be a frill on its neck, as well as feathering on its hindquarters and tail.      Borzoi males frequently weigh more than . Males stand at least  at the shoulder, while the height of females is around . Despite their size, the overall impression is of streamlining and grace, with a curvy shapeliness and compact strength.               The borzoi is an athletic and independent breed of dog. Most borzois are fairly quiet, barking on rare occasions. They do not have strong territorial drives and cannot be relied on to raise the alarm upon sighting a human intruder. The borzoi requires patient, experienced handling.  They are gentle and highly sensitive dogs with a natural respect for humans, and as adults they are decorative couch potatoes with remarkably gracious house manners. Borzois do not generally display dominance or aggression towards people, but can turn aggressive if handled roughly. Typically, they are rather reserved with strangers but affectionate with people they know well. Their sensitivity to invasion of their personal space can make them nervous around children unless they are brought up with them. Borzois adapt well to ": null
    },
    {
        "suburb": "Suburb"
    },
    {
        "an life, provided they have a spacious yard and regular opportunities for free exercise.     A common misunderstanding about the intelligence of breeds in the ": null
    },
    {
        "Hound": "Hound"
    },
    {
        " group stems from their independent nature, which conflicts with the frequent confusion between the concepts of intelligence and obedience in discussions of canine brainpower. ": null
    },
    {
        "Stanley Corens": "Stanley Coren"
    },
    {
        " survey of canine obedience trainers published in  The Intelligence of Dogs  reported that borzois obeyed the first command less than 25% of the time. Corens test, however, was by his own admission heavily weighted towards the obedience interpretation of intelligence and based on a better understanding of working breeds than hounds. Unfortunately, the publicity given to this report has led to unfair denigration of breeds which are under-represented in obedience clubs and poorly understood by the average obedience trainer. At a Conformation Judges training session not long after Corens book was released, I was greeted by the coordinator with the question, I read something that said Borzois arent very smart, is that true? This to the owner of several borzois, one of which knows how to open the refrigerator, and all of which respond instantly to commands given in that special owner-dog private language that wouldnt even be noticed by an outsider. Work for hound breeds is done out of hearing and often out of sight of the human companion; it is an activity for which the dogs are released , rather than an activity which is commanded .     In terms of obedience, borzois are selective learners who quickly become bored with repetitive, apparently pointless, activity, and they can be very stubborn when they are not properly motivated. For example, food rewards, or baiting , may work well for some individuals, but not at all for others. Nevertheless, borzois are definitely capable of enjoying and performing well in ": null
    },
    {
        "competitive obedience": "Obedience Trial"
    },
    {
        " and ": null
    },
    {
        "agility trials": "Dog Agility"
    },
    {
        " with the right kind of ": null
    },
    {
        "training": "Obedience Training"
    },
    {
        ".    Like other sighthounds, they are very sensitive and do not cope well with harsh treatment or training based on punishment, and will be extremely unhappy if raised voices and threats are a part of their daily life. However, like any intelligent dog, borzois respond extremely well to the guidance, support, and clear communication of a benevolent human leadership.     Borzois were bred to pursue or course game and have a powerful instinct to chase things that run from them, including cats and small dogs.  Built for speed and endurance, they can cover long distances in a very short time. A fully fenced yard is a necessity for maintaining any ": null
    },
    {
        "sighthound": "Sighthound"
    },
    {
        ". They are highly independent and will range far and wide without containment, with little regard for road traffic. For off-leash exercise, a borzoi needs a very large field or park, either fully fenced or well away from any roads, to ensure its safety.      Borzois are born with specialized coursing skills, but these are quite different from the dog-fighting instincts seen in some breeds. It is quite common for borzois at play to course another dog, seize it by the neck and hold it immobile. Young pups do this with their littermates, trading off as to who is the prey. It is a specific hunting behavior, not a fighting or territorial domination behavior.     Borzois can be raised very successfully to live with ": null
    },
    {
        "cats": "Cat"
    },
    {
        " and other small animals provided they are introduced to them when they are puppies. Some, however, will possess the hunting instinct to such a degree that they find it impossible not to chase a cat that is moving quickly. The hunting instinct is triggered by movement and much depends on how the cat behaves.            Stated life expectancy is 10 to 12 years.   Median lifespan based on a UK Kennel Club survey is 9 years 1 month. 1 in 5 died of old age, at an average of 10 to 11.5 years. The longest lived dog lived to 14 years 3 months.  Dogs that are physically fit and vigorous in their youth through middle age are more vigorous and healthy as elderly dogs, all other factors being equal. In the UK, ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        " and cardiac problems seem to be the most frequent causes of premature death.       Like its native relative the ": null
    },
    {
        "Hortaya Borzaya": "Hortaya Borzaya"
    },
    {
        ", the borzoi is relatively sound breed. ": null
    },
    {
        "OCD": "Osteochondritis Dissecans"
    },
    {
        ", ": null
    },
    {
        "hip": "Hip Dysplasia"
    },
    {
        " and ": null
    },
    {
        "elbow dysplasia": "Elbow Dysplasia"
    },
    {
        " have remained almost unknown, as were congenital eye and heart diseases before the 1970s. However, in some countries modern breeding practices have introduced a few problems.     As with other very deep-chested breeds, ": null
    },
    {
        "gastric dilatation volvulus": "Gastric Dilatation Volvulus"
    },
    {
        " is the most common serious health problem in the borzoi. This life-threatening condition is believed to be anatomical rather than strictly genetic in origin. One common recommendation in the past has been to raise the food bowl of the dog when it eats. However, studies have shown that this may actually increase the risk of bloat.      Less common are cardiac problems including ": null
    },
    {
        "cardiomyopathy": "Cardiomyopathy"
    },
    {
        " and ": null
    },
    {
        "cardiac arrhythmia": "Cardiac Arrhythmia"
    },
    {
        " disorders. A controversy exists as to the presence of ": null
    },
    {
        "progressive retinal atrophy": "Progressive Retinal Atrophy"
    },
    {
        " in the breed. A condition identified as borzoi retinopathy is seen in some individuals, usually active dogs, which differs from progressive retinal atrophy in several ways. First, it is unilateral, and rarely seen in animals less than three years of age; second, a clear-cut pattern of inheritance has not been demonstrated; and finally, most affected individuals do not go blind.        Correct nutrition during puppyhood is also debatable for borzois. These dogs naturally experience enormous growth surges in the first year or two of their lives. It is now widely accepted that forcing even faster growth by feeding a highly concentrated, high-energy diet is dangerous for skeletal development, causing unsoundness and increased tendency to joint problems and injury. Being built primarily for speed, borzois do not carry large amounts of body fat or muscle, and therefore have a rather different physiology to other dogs of similar size . Laboratory-formulated diets designed for a generic large or giant breed are unlikely to take the needs of the big sighthounds into account.     The issues involved in ": null
    },
    {
        "raw feeding": "Raw Feeding"
    },
    {
        " may be particularly relevant to tall, streamlined breeds such as the borzoi. The ": null
    },
    {
        "Hortaya Borzaya": "Hortaya Borzaya"
    },
    {
        ", a very close relative, is traditionally raised on a meager diet of oats and table scraps. The Hortaya is also said to be intolerant of highly concentrated kibble feeds. A lean body weight in itself is nothing to be concerned about, and force-feeding of healthy young borzoi is definitely not recommended.                  The Borzoi originated in 17 th Century Russia by crossing Arabian greyhounds with a thick-coated breed.      The more modern Psovaya Borzaya was founded on Stepnaya, Hortaya and the Ukrainian-Polish version of the old Hort. There were also imports of Western sighthound breeds to add to the height and weight. It was crossed as well with the Russian Laika specifically and singularly to add resistance against Northern cold and a longer and thicker coat than the Southern sighthounds were equipped with.      All of these foundation types—Tazi, Hortaya, Stepnaya, Krimskaya, and Hort—already possessed the instincts and agility necessary for hunting and bringing down wolves.     The Psovoi was popular with the ": null
    },
    {
        "Tsars": "Tsar"
    },
    {
        " before the ": null
    },
    {
        "1917 revolution": "Russian Revolution Of 1917"
    },
    {
        ". For centuries, Psovoi could not be purchased but only given as gifts from the Tsar. ": null
    },
    {
        "Grand Duke Nicholas Nicolaievich of Russia": "Grand Duke Nicholas Nikolaevich Of Russia"
    },
    {
        " bred countless Psovoi at ": null
    },
    {
        "Perchino": "Perchino"
    },
    {
        ", his private estate.      The Russian concept of hunting trials was instituted during the era of the Tsars. As well as providing exciting sport, the tests were used for selecting borzoi breeding stock; only the quickest and most intelligent hunting dogs went on to produce progeny. For the aristocracy these trials were a well-organized ceremony, sometimes going on for days, with the borzois accompanied by mounted hunters and ": null
    },
    {
        "Foxhounds": "Foxhound"
    },
    {
        " on the Russian ": null
    },
    {
        "steppe": "Steppe"
    },
    {
        ". Hares and other small game were by far the most numerous kills, but the hunters especially loved to test their dogs on wolf. If a wolf was sighted, the hunter would release a team of two or three borzois. The dogs would pursue the wolf, attack its neck from both sides, and hold it until the hunter arrived. The classic kill was by the human hunter with a knife. Wolf trials are still a regular part of the hunting diploma for all Russian sightdog breeds of the relevant type, either singly or in pairs or trios, in their native country.     After the ": null
    },
    {
        "1917 Revolution": "1917 Revolution"
    },
    {
        ", wolf hunting with sighthounds has soon gone out of fashion as an aristocratic and a means- and -time-taking way of hunting.   A necessity in a wolf-catching sighthound didnt exist, in addition to the old proved technique of battue with the use of baits, flags and other appeared new, way more effective—from airplanes, from propeller sleighs, with electronic lure whistles. For decades the generations of few remaining sighthounds were regarded as hunting-suited, when showing enough attacking initiative for fox hunting. The rumours about persecution of sighthounds in post-revolutionary Russia is a legend of modern times, possibly based on similar incidents in ": null
    },
    {
        "Maoist China": "Maoist China"
    },
    {
        ".     In the late 1940s, a Soviet soldier named ": null
    },
    {
        "Constantin Esmont": "Constantin Esmont"
    },
    {
        " made detailed records of the various types of borzoi he found in Cossack villages. Esmonts illustrations were recently published and can be viewed by clicking on the link below.     Esmont was concerned that the distinct types of borzaya were in danger of degenerating without a controlled system of breeding. He convinced the Soviet government that borzois were a valuable asset to the hunters who supported the fur industry and henceforth, their breeding was officially regulated. To this day short-haired ": null
    },
    {
        "Hortaya Borzaya": "Hortaya Borzaya"
    },
    {
        " are highly valued hunting dogs on the steppes, while the long-haired Psovaya Borzaya, is going through a hard period of restoration of its working qualities after decades of shadow, mainly show existence.     Exports of borzois to other countries were extremely rare during the Soviet era. However, enough had been taken to England, Scandinavia, Western Europe, and America in the late 19th century for the breed to establish itself outside its native country.        ": null
    },
    {
        "Alfred A. Knopf": "Alfred A. Knopf"
    },
    {
        " publishing house.   Tasha, a female borzoi belonging to the noted vet ": null
    },
    {
        "Buster Lloyd-Jones": "Buster Lloyd-Jones"
    },
    {
        " , was born in the UK during the Second World War and is the pedigree ancestor of most British borzoi bloodlines.    Ben was the white male borzoi, beloved of ": null
    },
    {
        "Edward J. Smith": "Edward Smith"
    },
    {
        ", Captain of the ": null
    },
    {
        "Titanic": "Rms Titanic"
    },
    {
        ". There exists a photo of the Captain and his dog outside his cabin on the ship. The dog was not, however, on the maiden voyage.   Kolchak has been the mascot of the ": null
    },
    {
        "27th Infantry Regiment": "27Th Infantry Regiment"
    },
    {
        " since the Regiment participated in the ": null
    },
    {
        "Siberian Intervention": "Siberian Intervention"
    },
    {
        ". The 27th Infantry had been nicknamed The Wolfhounds in recognition of their endurance during battles in Siberia.           ": null
    },
    {
        "Leo Tolstoys": "Leo Tolstoy"
    },
    {
        " 1869 novel  War and Peace  contains an extensive ": null
    },
    {
        "wolf hunting": "Wolf Hunting"
    },
    {
        " scene with borzois in book 7, chapters 3 to 6.    ": null
    },
    {
        "F. Scott Fitzgeralds": "F. Scott Fitzgerald"
    },
    {
        " second novel,  The Beautiful and Damned  , contains a scene in which Gloria compares Anthony to a Russian wolfhound. Anthony decides to take this as a compliment: Anthony remembered that they were white and always looked unnaturally hungry. But then they were usually photographed with dukes and princesses, so he was properly flattered.    ": null
    },
    {
        "George Bernard Shaw": "George Bernard Shaw"
    },
    {
        " in his Everybody’s Political What’s What? wrote The future of mankind belongs to its mongrels and not to its handsome but brainless Borzois.   Ivan, one of the protagonists of the historical novel by the Cuban writer ": null
    },
    {
        "Leonardo Padura Fuentes": "Leonardo Padura Fuentes"
    },
    {
        ", El hombre que amaba a los perros , is the editor of a university journal of ": null
    },
    {
        "veterinary medicine": "Veterinary Medicine"
    },
    {
        ", who manages to make a living during the ": null
    },
    {
        "Special Period": "Special Period"
    },
    {
        " in Cuba by helping people take care of their dogs. The novel alludes to Ivans own dogs as well as to borzoi dogs owned by ": null
    },
    {
        "Leon Trotsky": "Leon Trotsky"
    },
    {
        " and his assassin, ": null
    },
    {
        "Ramón Mercader": "Ramón Mercader"
    },
    {
        ".   A borzoi features prominently in a ": null
    },
    {
        "Music Hall": "Music Hall"
    },
    {
        " revue": "Revue"
    },
    {
        " in the short story Cousin Theresa by ": null
    },
    {
        "Saki": "Saki"
    },
    {
        " .   In the book The Romanov Prophecy by ": null
    },
    {
        "Steve Berry": "Steve Berry"
    },
    {
        "  Kuroshitsuji  , Ciel Phantomhive as a child had a black borzoi named Sebastian. He named the demon with which he made a ": null
    },
    {
        "Faustian": "Faustian"
    },
    {
        " contract after this dog.   The 1968 film version  War and Peace  contains a hunting scene with borzois from the kennel of Ekhaga, Sweden.   Uncle Zeke starred as Digger in the 2000 Disney film,  102 Dalmatians   Ginga Densetsu Weed  ": null
    },
    {
        "Walt Disneys": "Walt Disney"
    },
    {
        " 1955 film  Lady and the Tramp   Hello Dolly!  ": null
    },
    {
        "Katniss Everdeen": "Katniss Everdeen"
    },
    {
        " and ": null
    },
    {
        "Peeta Mellark": "Peeta Mellark"
    },
    {
        " arrive at the Capitol in the 2012 film  The Hunger Games , a pair of pink borzois are shown on screen—an illustration of the Capitol residents gaudy lifestyle.    Borzois can also been seen in cameo roles in the films  Love at First Bite ,  Legends of the Fall  ,   Excalibur ,  All Dogs Go to Heaven  ,  Bride of Frankenstein ,  Easter Parade ,  Wolfen ,  Ziegfeld Follies ,  Onegin  , Gangs of New York , Chaplin, The Avengers , JAG, Maverick , Sleepy Hollow, Last Action Hero, and A Knights Tale .   Mademoiselle Nobs from ": null
    },
    {
        "Pink Floyd: Live at Pompeii": "Seamus"
    },
    {
        " who sings a ": null
    },
    {
        "song": "Seamus"
    },
    {
        " with the band.     Lyndell Ackermans Nessie CH Windyglens Finesse in the TV show  Wings .   In an ": null
    },
    {
        "SCTV": "Second City Television"
    },
    {
        " parody commercial for fictional Poochare dog food, a borzoi dog is seen being taken for a walk by ": null
    },
    {
        "Eugene Levy": "Eugene Levy"
    },
    {
        ".   In episode 2 of the first season of the anime ": null
    },
    {
        "Medaka Box": "Medaka Box"
    },
    {
        ", one of the requests for the student council is to find a missing puppy, which turns out to be a borzoi. It has grown quite large since it was lost. This also happens in the manga version.   A borzoi is one of the dogs to appear in the film  Cats & Dogs . It is seen during the council session scene.   The breed is featured in ": null
    },
    {
        "Amor Towles": "Amor Towles"
    },
    {
        "’ novel  A Gentleman in Moscow , notably in a scene where two borzois create havoc in their unsuccessful attempt to corral the hotel cat in the lobby of a luxury hotel in Moscow. ": null
    }
]