[
    {
        "     Thomas H. Boston Corbett  was a ": null
    },
    {
        "Union Army": "Union"
    },
    {
        " soldier who shot and killed President ": null
    },
    {
        "Abraham Lincolns": "Abraham Lincoln"
    },
    {
        " assassin": "Assassination Of Abraham Lincoln"
    },
    {
        ", ": null
    },
    {
        "John Wilkes Booth": "John Wilkes Booth"
    },
    {
        ". Corbett was initially arrested for disobeying orders, but was later released on the orders of Secretary of War ": null
    },
    {
        "Edwin Stanton": "Edwin Stanton"
    },
    {
        ", who referred to Corbett as the patriot upon dismissing him. He was largely considered a hero by the media and the public.     Known for his devout religious beliefs and eccentric behavior, Corbett drifted around the United States before disappearing around 1888. Circumstantial evidence suggests that he died in the ": null
    },
    {
        "Great Hinckley Fire": "Great Hinckley Fire"
    },
    {
        " in September 1894, but that remains impossible to substantiate.       Corbett was born in ": null
    },
    {
        "London": "London"
    },
    {
        " and immigrated with his family to ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " in 1840. The Corbetts moved frequently before eventually settling in ": null
    },
    {
        "Troy, New York": "Troy, New York"
    },
    {
        ". As a young man, Corbett began apprenticing as a ": null
    },
    {
        "milliner": "Milliner"
    },
    {
        " , a profession that he would hold intermittently throughout his life. As a milliner, Corbett was regularly exposed to the fumes of ": null
    },
    {
        "mercury nitrate": "Mercury Nitrate"
    },
    {
        ", then used in the treatment of ": null
    },
    {
        "fur": "Fur"
    },
    {
        " to produce ": null
    },
    {
        "felt": "Felt"
    },
    {
        " used on hats. Excessive exposure to the compound can lead to ": null
    },
    {
        "hallucinations": "Hallucination"
    },
    {
        ", ": null
    },
    {
        "psychosis": "Psychosis"
    },
    {
        " and twitching .  Historians have theorized that the mental issues Corbett exhibited before and after the ": null
    },
    {
        "Civil War": "American Civil War"
    },
    {
        " were caused by this exposure.        After working as a milliner in Troy, Corbett returned to New York City.  He later married, but his wife and child died in childbirth. Following their deaths, he moved to ": null
    },
    {
        "Boston": "Boston"
    },
    {
        ". Corbett became despondent over the loss of his wife and began drinking heavily. He was unable to hold a job and eventually became homeless.  After a night of heavy drinking, he was confronted by a street preacher whose message persuaded him to join the ": null
    },
    {
        "Methodist Episcopal Church": "Methodist Episcopal Church"
    },
    {
        ". Corbett immediately stopped drinking and became devoutly religious. After being ": null
    },
    {
        "baptized": "Baptized"
    },
    {
        ", he subsequently changed his name to Boston, the name of the city where he was converted. Harpers Weekly, May  13, 1865 He regularly attended meetings at the Fulton and Bromfield Street churches where his enthusiastic behavior earned him the nickname The Glory to God man . In an attempt to imitate ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        ", Corbett began to wear his hair very long .       In 1857, Corbett began working at a hat manufacturers shop on ": null
    },
    {
        "Washington Street": "Washington Street"
    },
    {
        " in downtown Boston. He was reported to be a proficient milliner, but was known to proselytize frequently and stop work to pray and sing for co-workers who used profanity in his presence. He also began working as a ": null
    },
    {
        "street preacher": "Street Preacher"
    },
    {
        " and would sermonize and distribute religious literature in ": null
    },
    {
        "North Square": "North Square"
    },
    {
        ".  Corbett soon earned a reputation around Boston for being a local eccentric and religious fanatic. On July  16, 1858, Corbett was propositioned by two ": null
    },
    {
        "prostitutes": "Prostitution"
    },
    {
        " while walking home from a church meeting. He was deeply disturbed by the encounter. Upon returning to his room at a boardinghouse, Corbett began reading ": null
    },
    {
        "chapters 18 and 19": "S:Bible /Matthew19:12"
    },
    {
        " in the ": null
    },
    {
        "Gospel of Matthew": "Gospel Of Matthew"
    },
    {
        " . In order to avoid sexual temptation and remain holy, he ": null
    },
    {
        "castrated": "Castration"
    },
    {
        " himself": "Self-Surgery"
    },
    {
        " with a pair of scissors. He then ate a meal and went to a prayer meeting before seeking medical treatment.               In April 1861, early in the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        ", Corbett enlisted as a private in Company I of the 12th Regiment ": null
    },
    {
        "New York Militia": "New York Militia"
    },
    {
        ". Corbetts eccentric behavior quickly got him into trouble. He carried a Bible with him at all times and read passages aloud from it regularly, held unauthorized prayer meetings and argued with his superior officers.  Corbett also condemned officers and superiors for what he perceived as violations of ": null
    },
    {
        "Gods word": "Religious Texts"
    },
    {
        ". In one instance, he verbally reprimanded ": null
    },
    {
        "Colonel Daniel Butterfield": "Daniel Butterfield"
    },
    {
        " for using profanity and taking the Lords name in vain. He was sent to the ": null
    },
    {
        "guardhouse": "Guardhouse"
    },
    {
        " for several days but refused to apologize for his insubordination.  Due to his continued disruptive behavior and refusal to take orders, Corbett was ": null
    },
    {
        "court-martial": "Court-Martial"
    },
    {
        "ed and sentenced to be shot. His sentence was eventually reduced and he was discharged in August 1863.      Corbett re-enlisted later that month as a private in Company L, ": null
    },
    {
        "16th New York Cavalry Regiment": "16Th Regiment New York Volunteer Cavalry"
    },
    {
        ". On June  24, 1864, he was captured by ": null
    },
    {
        "Confederate": "Confederate States Army"
    },
    {
        " Colonel ": null
    },
    {
        "John S. Mosbys": "John S. Mosby"
    },
    {
        " men in ": null
    },
    {
        "Culpeper, Virginia": "Culpeper, Virginia"
    },
    {
        " and held prisoner at ": null
    },
    {
        "Andersonville prison": "Andersonville Prison"
    },
    {
        " for five months. He was released in an ": null
    },
    {
        "exchange": "Prisoner Exchange"
    },
    {
        " in November 1864 and was admitted to the Army hospital in ": null
    },
    {
        "Annapolis, Maryland": "Annapolis, Maryland"
    },
    {
        " where he was treated for ": null
    },
    {
        "scurvy": "Scurvy"
    },
    {
        ", ": null
    },
    {
        "malnutrition": "Malnutrition"
    },
    {
        " and exposure. On his return to his company, he was promoted to ": null
    },
    {
        "Sergeant": "Sergeant"
    },
    {
        ". Corbett later testified for the prosecution in the trial of the commandant of Andersonville, Captain ": null
    },
    {
        "Henry Wirz": "Henry Wirz"
    },
    {
        ".              On April 24, 1865, ": null
    },
    {
        "Corbetts regiment": "16Th Regiment New York Volunteer Cavalry"
    },
    {
        " was sent to apprehend ": null
    },
    {
        "John Wilkes Booth": "John Wilkes Booth"
    },
    {
        ", the assassin of President ": null
    },
    {
        "Abraham Lincoln": "Abraham Lincoln"
    },
    {
        ", whom Booth ": null
    },
    {
        "fatally shot": "Assassination Of Abraham Lincoln"
    },
    {
        " on April 14, 1865. On April 26, the regiment surrounded Booth and one of his accomplices, ": null
    },
    {
        "David Herold": "David Herold"
    },
    {
        ", in a tobacco barn on the ": null
    },
    {
        "Virginia": "Virginia"
    },
    {
        " farm of Richard Garrett. Herold surrendered, but Booth refused. The barn was set on fire in an attempt to force him out into the open, but Booth remained inside.  Corbett was positioned near a large crack in the barn wall. In an 1878 interview, Corbett claimed that he saw Booth aim his ": null
    },
    {
        "carbine": "Carbine"
    },
    {
        ", prompting him to shoot Booth with his ": null
    },
    {
        "Colt revolver": "Colt Revolver"
    },
    {
        " despite ": null
    },
    {
        "Secretary of War": "Secretary Of War"
    },
    {
        "Edwin M. Stantons": "Edwin M. Stanton"
    },
    {
        " orders that Booth should be captured alive. Lieutenant ": null
    },
    {
        "Edward P. Doherty": "Edward P. Doherty"
    },
    {
        ", the officer in charge of the soldiers who captured Booth and Herold, stated that the bullet struck Booth in the back of the head, about an inch below the spot where his shot had entered the head of Mr. Lincoln. Booths ": null
    },
    {
        "spinal cord": "Spinal Cord"
    },
    {
        " was severed, and he died two hours later.         ": null
    },
    {
        "Lt. Colonel": "Lieutenant Colonel"
    },
    {
        " Everton Conger": "Everton Conger"
    },
    {
        " initially thought Booth had shot himself. After realizing Booth had been shot by someone else, Conger and Lt. Doherty asked which officer had shot Booth. Corbett stepped forward and admitted he was the shooter.  When asked why he had violated orders, Corbett replied, ": null
    },
    {
        "Providence": "Divine Providence"
    },
    {
        " directed me .  He was immediately arrested and was accompanied by Lt. Doherty to the ": null
    },
    {
        "War Department": "United States Department Of War"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        " to be court martialed. When questioned by Edwin Stanton about Booths capture and shooting, both Doherty and Corbett agreed that Corbett had in fact disobeyed orders not to shoot. However, Corbett maintained that he believed Booth had intended to shoot his way out of the barn and that he acted in self-defense. He stated, ...Booth would have killed me if I had not shot first. I think I did right.  Stanton paused and then stated, The rebel is dead. The patriot lives; he has spared the country expense, continued excitement and trouble. Discharge the patriot. Upon leaving the War Department, Corbett was greeted by a cheering crowd. As he made his way to ": null
    },
    {
        "Mathew Bradys": "Mathew Brady"
    },
    {
        " studio to have his official portrait taken, the crowd followed him asking for autographs and requesting that he tell them about shooting Booth. Corbett told the crowd:          Eyewitnesses to Booths shooting contradicted Corbetts version of events and expressed doubts that Corbett was responsible for shooting Booth. Officers who were near Corbett at the time claimed that they never saw him fire his gun . They claimed that Corbett came forward only after Lt. Colonel Conger asked who had shot Booth. Richard Garrett, the owner of the farm on which Booth was captured, and his 12-year-old son Robert also contradicted Corbetts testimony that he acted in self-defense. Both maintained that Booth had never reached for his gun.      While there was some criticism of Corbetts actions, he was largely considered a hero by the public and press. One newspaper editor declared that Corbett would, live as one of the Worlds great avengers.  For his part in Booths capture, Corbett received a portion of the $100,000 reward money, amounting to $1,653.84 .   His annual salary as a U.S. sergeant was $204 . Corbett received offers to purchase the gun he used to shoot Booth. He refused stating, That is not mine-it belongs to the Government, and I would not sell it for any price.  Corbett also declined an offer for one of Booths pistols as he did not want a reminder of shooting Booth.       After his discharge from the army in August 1865, Corbett went back to work as a hatter in Boston and frequently attended the Bromfield Street Church. When the hatting business in Boston slowed, Corbett moved to ": null
    },
    {
        "Danbury, Connecticut": "Danbury, Connecticut"
    },
    {
        ", to continue his work and also preached in the country round about. By 1870, he had relocated once again to ": null
    },
    {
        "Camden, New Jersey": "Camden, New Jersey"
    },
    {
        ", where he was known as a Methodist lay preacher . Corbetts inability to hold a job was attributed to his fanatical behavior; he was routinely fired after continuing his habit of stopping work to pray for his co-workers.  In an effort to earn money, Corbett capitalized on his role as Lincolns Avenger . He gave lectures about the shooting of Booth accompanied by illustrated ": null
    },
    {
        "lantern slides": "Lantern Slide"
    },
    {
        " at Sunday schools, womens groups and tent meetings. Corbett was never asked back due to his increasingly erratic behavior and incoherent speeches.     R.B. Hoover, a man who later befriended Corbett, recalled that Corbett believed men who were high in authority at Washington at the time of the assassination were hounding him. Corbett said the men were angry because he had deprived them of prosecuting and executing John Wilkes Booth themselves. He also believed the same men had gotten him fired from various jobs.  Corbetts paranoia was furthered by ": null
    },
    {
        "hate mail": "Hate Mail"
    },
    {
        " he received for killing Booth. He became fearful that Booths Avengers or organizations like the Secret Order were planning to seek revenge upon him and took to carrying a pistol with him at all times. As his paranoia increased, Corbett began brandishing his pistol at friends or strangers he deemed suspicious.     While attending the Soldiers Reunion of the Blue and Gray in ": null
    },
    {
        "Caldwell, Ohio": "Caldwell, Ohio"
    },
    {
        ", in 1875, Corbett got into an argument with several men over the death of John Wilkes Booth. The men questioned if Booth had really been killed at all which enraged Corbett. He then drew his pistol on the men but was removed from the reunion before he could fire it. In 1878, Corbett moved to ": null
    },
    {
        "Concordia, Kansas": "Concordia, Kansas"
    },
    {
        ", where he acquired a plot of land through ": null
    },
    {
        "homesteading": "Homestead Principle"
    },
    {
        " upon which he constructed a ": null
    },
    {
        "dugout": "Dugout"
    },
    {
        " home. He continued working as a preacher and attended ": null
    },
    {
        "revival meetings": "Revival Meeting"
    },
    {
        " frequently.        Due to his fame as Lincolns Avenger , Corbett was appointed assistant doorkeeper of the ": null
    },
    {
        "Kansas House of Representatives": "Kansas House Of Representatives"
    },
    {
        " in ": null
    },
    {
        "Topeka": "Topeka"
    },
    {
        " in January 1887. On February 15, he became convinced that   officers of the House were discriminating against him. He jumped to his feet, brandished a revolver and began chasing the officers out of the building. No one was hurt and Corbett was arrested. The following day, a judge declared Corbett insane and sent him to the ": null
    },
    {
        "Topeka Asylum for the Insane": "Topeka State Hospital"
    },
    {
        ". On May 26, 1888, he escaped from the asylum on horseback.  He then rode to ": null
    },
    {
        "Neodesha, Kansas": "Neodesha, Kansas"
    },
    {
        ", where he briefly stayed with Richard Thatcher, a man he had met while they were ": null
    },
    {
        "prisoners of war": "Prisoners Of War"
    },
    {
        ". When Corbett left, he told Thatcher he was going to Mexico.     Rather than going to Mexico, Corbett is believed to have settled in a cabin he built in the forests near ": null
    },
    {
        "Hinckley": "Hinckley, Minnesota"
    },
    {
        ", in ": null
    },
    {
        "Pine County": "Pine County, Minnesota"
    },
    {
        " in eastern ": null
    },
    {
        "Minnesota": "Minnesota"
    },
    {
        ". He is believed to have died in the ": null
    },
    {
        "Great Hinckley Fire": "Great Hinckley Fire"
    },
    {
        " on September  1, 1894. Although there is no proof, the name Thomas Corbett appears on the list of dead and missing. Lincoln Herald, Volume 86, Lincoln Memorial University Press., 1984, pp. 152–155 Kubicek, Earl C, The Case of the Mad Hatter , Lincoln Herald, Volume 83, Lincoln Memorial University Press, 1981, pp. 708–719         In the years following Corbetts presumed death, several men came forward claiming to be Lincolns Avenger . A few years after Corbett was last seen in Neodesha, Kansas, a ": null
    },
    {
        "patent medicine": "Patent Medicine"
    },
    {
        " salesman in ": null
    },
    {
        "Enid, Oklahoma": "Enid, Oklahoma"
    },
    {
        " filed an application using Corbetts name to receive pension benefits. After an investigation proved that the man was not Boston Corbett, he was sent to prison. In September 1905, a man arrested in ": null
    },
    {
        "Dallas": "Dallas"
    },
    {
        " also claimed to be Corbett. He too was proven to be an imposter and was sent to prison for perjury, and then to the ": null
    },
    {
        "Government Hospital for the Insane": "St. Elizabeths Hospital"
    },
    {
        ".        In 1958, Boy Scout Troop 31, of ": null
    },
    {
        "Concordia, Kansas": "Concordia, Kansas"
    },
    {
        ", built a roadside monument to Corbett located on Key Road. A small sign was also placed to mark the dug hole where Corbett had lived for a time. ": null
    }
]