[
    {
        "                Braille  is a tactile ": null
    },
    {
        "writing system": "Writing System"
    },
    {
        " used by people who are ": null
    },
    {
        "visually impaired": "Visually Impaired"
    },
    {
        ". It is traditionally written with embossed paper. Braille users can read computer screens and other electronic supports using ": null
    },
    {
        "refreshable braille displays": "Refreshable Braille Display"
    },
    {
        ". They can write braille with the original ": null
    },
    {
        "slate and stylus": "Slate And Stylus"
    },
    {
        " or type it on a ": null
    },
    {
        "braille writer": "Braille Writer"
    },
    {
        ", such as a portable ": null
    },
    {
        "braille notetaker": "Braille Notetaker"
    },
    {
        " or computer that prints with a ": null
    },
    {
        "braille embosser": "Braille Embosser"
    },
    {
        ".     Braille is named after its creator, ": null
    },
    {
        "Louis Braille": "Louis Braille"
    },
    {
        ", a Frenchman who lost his sight as a result of a childhood accident. In 1824, at the age of fifteen, he developed a code for the ": null
    },
    {
        "French alphabet": "French Alphabet"
    },
    {
        " as an improvement on ": null
    },
    {
        "night writing": "Night Writing"
    },
    {
        ". He published his system, which subsequently included ": null
    },
    {
        "musical notation": "Musical Notation"
    },
    {
        ", in 1829. ": null
    },
    {
        "Braille, Louis": "Louis Braille"
    },
    {
        " . Method of Writing Words, Music, and Plain Songs by Means of Dots, for Use by the Blind and Arranged for Them. The second revision, published in 1837, was the first ": null
    },
    {
        "small binary": "Binary Numeral System"
    },
    {
        " form of writing developed in the modern era.     These characters have rectangular blocks called cells that have tiny bumps called raised dots. The number and arrangement of these dots distinguish one character from another. Since the various braille alphabets originated as ": null
    },
    {
        "transcription": "Transcription"
    },
    {
        " codes for printed writing, the mappings vary from language to language, and even within one; in ": null
    },
    {
        "English Braille": "English Braille"
    },
    {
        " there are three levels of encoding: Grade 1 – a letter-by-letter transcription used for basic literacy; Grade 2 – an addition of abbreviations and contractions; and Grade 3 – various non-standardized personal stenography.     Braille cells are not the only thing to appear in braille text. There may be embossed illustrations and graphs, with the lines either solid or made of series of dots, arrows, bullets that are larger than braille dots, etc. A full braille cell includes six raised dots arranged in two columns, each column having three dots.  The dot positions are identified by numbers from one to six. There are 64 possible combinations, including no dots at all for a ": null
    },
    {
        "word space": "Word Space"
    },
    {
        ".  A cell can be used to represent a letter, digit, punctuation mark, or even a word.     Braille literacy is a social-justice issue. Early braille education is crucial to literacy, education and employment among the blind. However, in the face of changes in education policy and ": null
    },
    {
        "screen reader": "Screen Reader"
    },
    {
        " software, braille usage has declined in recent decades, despite the fact that technologies such as ": null
    },
    {
        "braille displays": "Braille Display"
    },
    {
        " have also made braille more accessible and practical.          Braille was based on a tactile military ": null
    },
    {
        "code": "Code"
    },
    {
        " called ": null
    },
    {
        "night writing": "Night Writing"
    },
    {
        ", developed by ": null
    },
    {
        "Charles Barbier": "Charles Barbier"
    },
    {
        " in response to ": null
    },
    {
        "Napoleons": "Napoleon"
    },
    {
        " demand for a means for soldiers to communicate silently at night and without a light source.  In Barbiers system, sets of 12 embossed dots encoded 36 different sounds. It proved to be too difficult for soldiers to recognize by touch and was rejected by the military. In 1821 Barbier visited the Royal Institute for the Blind in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", where he met Louis Braille. Braille identified two major defects of the code: first, by representing only sounds, the code was unable to render the orthography of the words; second, the human finger could not encompass the whole 12-dot symbol without moving, and so could not move rapidly from one symbol to another. Brailles solution was to use 6-dot cells and to assign a specific pattern to each letter of the alphabet.    At first, Braille was a one-to-one transliteration of French orthography, but soon various abbreviations, contractions, and even ": null
    },
    {
        "logograms": "Logogram"
    },
    {
        " were developed, creating a system much more like shorthand. The expanded English system, called ": null
    },
    {
        "Grade-2 Braille": "Grade-2 Braille"
    },
    {
        ", was completed by 1905. For blind readers, Braille is an independent writing system, rather than a code of printed orthography.       Braille is derived from the Latin alphabet, albeit indirectly. In Brailles original system, the dot patterns were assigned to letters according to their position within the ": null
    },
    {
        "alphabetic order": "Collating Sequence"
    },
    {
        " of the French alphabet, with ": null
    },
    {
        "accented": "Diacritic"
    },
    {
        " letters and w sorted at the end. Madeleine Loomis . The Braille Reference Book      The first ten letters of the alphabet, a–j, use the upper four dot positions:  . These stand for the ten digits 1–9 and 0 in a system parallel to Hebrew ": null
    },
    {
        "gematria": "Gematria"
    },
    {
        " and Greek ": null
    },
    {
        "isopsephy": "Isopsephy"
    },
    {
        ".      The next ten letters, k–t, are identical to a–j, respectively, apart from the addition of a dot at position 3 :      The next ten letters  are the same again, but with dots also at both position 3 and position 6 . Here w was left out as not being a part of the official French alphabet at the time of Brailles life; the French braille order is u v x y z ç é à è ù .     The next ten letters, ending in w, are the same again, except that for this series position 6 is used without a dot at position 3. In French braille these are the letters â ê î ô û ë ï ü ö w . W had been tacked onto the end of 39 letters of the French alphabet to accommodate English.     The a–j series shifted down by one dot space  is used for punctuation. Letters a  and c , which only use dots in the top row, were shifted two places for the apostrophe and hyphen: .     In addition, there are ten patterns that are based on the first two letters  with their dots shifted to the right; these were assigned to non-French letters , or serve non-letter functions:  ,  ,  ,  ,  ,  .     :     Originally there had been nine decades. The fifth through ninth used dashes as well as dots, but proved to be impractical and were soon abandoned. These could be replaced with what we now know as the number sign , though that only caught on for the digits . The dash occupying the top row of the original sixth decade was simply dropped, producing the modern fifth decade.        Historically, there have been three principles in assigning the values of a ": null
    },
    {
        "linear script": "Linear Writing"
    },
    {
        " to Braille: Using Louis Brailles original French letter values; reassigning the braille letters according to the ": null
    },
    {
        "sort order": "Sort Order"
    },
    {
        " of the print alphabet being transcribed; and reassigning the letters to improve the efficiency of writing in braille.     Under international consensus, most braille alphabets follow the French sorting order for the 26 letters of the ": null
    },
    {
        "basic Latin alphabet": "Iso Basic Latin Alphabet"
    },
    {
        ", and there have been attempts at unifying the letters beyond these 26 , though differences remain, for example in ": null
    },
    {
        "German Braille": "German Braille"
    },
    {
        " and the contractions of ": null
    },
    {
        "English Braille": "English Braille"
    },
    {
        ". This unification avoids the chaos of each nation reordering the braille code to match the sorting order of its print alphabet, as happened in ": null
    },
    {
        "Algerian Braille": "Algerian Braille"
    },
    {
        ", where braille codes were numerically reassigned to match the order of the Arabic alphabet and bear little relation to the values used in other countries , and as happened in an early American version of English Braille, where the letters w, x, y, z were reassigned to match English alphabetical order. A convention sometimes seen for letters beyond the basic 26 is to exploit the physical symmetry of braille patterns iconically, for example, by assigning a reversed n to ñ or an inverted s to sh.      A third principle was to assign braille codes according to frequency, with the simplest patterns assigned to the most frequent letters of the alphabet. Such frequency-based alphabets were used in Germany and the United States in the 19th century , but with the invention of the braille typewriter their advantage disappeared, and none are attested in modern use – they had the disadvantage that the resulting small number of dots in a text interfered with following the alignment of the letters, and consequently made texts more difficult to read than Brailles more arbitrary letter-assignment. Finally, there are braille scripts which dont order the codes numerically at all, such as ": null
    },
    {
        "Japanese Braille": "Japanese Braille"
    },
    {
        " and ": null
    },
    {
        "Korean Braille": "Korean Braille"
    },
    {
        ", which are based on more abstract principles of syllable composition.     Academic texts are sometimes written in a script of eight dots per cell rather than six, enabling them to encode a greater number of symbols.  ": null
    },
    {
        "Luxembourgish Braille": "Luxembourgish Braille"
    },
    {
        " has adopted eight-dot cells for general use; for example, it adds a dot below each letter to derive its capital variant.          Braille was the first writing system with ": null
    },
    {
        "binary": "Binary Numeral System"
    },
    {
        " encoding": "Character Encoding"
    },
    {
        ". Daniels, Peter . Analog and Digital Writing , in The Worlds Writing Systems, p.  886 The system as devised by Braille consists of two parts: Daniels & Bright, 1996, The Worlds Writing Systems, pp.  817–818   ": null
    },
    {
        "Character encoding": "Character Encoding"
    },
    {
        " that mapped characters of the ": null
    },
    {
        "French alphabet": "French Alphabet"
    },
    {
        " to ": null
    },
    {
        "tuples": "Tuple"
    },
    {
        " of six ": null
    },
    {
        "bits": "Bit"
    },
    {
        " ,   The physical representation of those six-bit characters with raised dots in a braille cell.     Within an individual cell, the dot positions are arranged in two columns of three positions. A raised dot can appear in any of the six positions, producing sixty-four possible patterns, including one in which there are no raised dots. For reference purposes, a pattern is commonly described by listing the positions where dots are raised, the positions being universally numbered, from top to bottom, as 1 to 3 on the left and 4 to 6 on the right. For example, dot pattern 1-3-4 describes a cell with three dots raised, at the top and bottom in the left column and at the top of the right column: that is, the letter  m. The lines of horizontal Braille text are separated by a space, much like visible printed text, so that the dots of one line can be differentiated from the braille text above and below. Different assignments of braille codes  are used to map the character sets of different printed scripts to the six-bit cells. Braille assignments have also been created for mathematical and musical notation. However, because the six-dot braille cell allows only 64 patterns, including space, the characters of a braille script commonly have multiple values, depending on their context. That is, character mapping between print and braille is not one-to-one. For example, the character  corresponds in print to both the letter d and the digit 4.     In addition to simple encoding, many braille alphabets use contractions to reduce the size of braille texts and to increase reading speed.           Braille may be produced by hand using a ": null
    },
    {
        "slate and stylus": "Slate And Stylus"
    },
    {
        " in which each dot is created from the back of the page, writing in mirror image, or it may be produced on a ": null
    },
    {
        "braille typewriter": "Braille Typewriter"
    },
    {
        " or ": null
    },
    {
        "Perkins Brailler": "Perkins Brailler"
    },
    {
        ", or an electronic Brailler or eBrailler. Because braille letters cannot be effectively erased and written over if an error is made, an error is overwritten with all six dots . Interpoint refers to braille printing that is offset, so that the paper can be embossed on both sides, with the dots on one side appearing between the divots that form the dots on the other .   Using a computer or other electronic device, Braille may be produced with a ": null
    },
    {
        "braille embosser": "Braille Embosser"
    },
    {
        " or a ": null
    },
    {
        "refreshable braille display": "Refreshable Braille Display"
    },
    {
        " .     Braille has been extended to an 8-dot code, particularly for use with braille embossers and refreshable braille displays. In 8-dot braille the additional dots are added at the bottom of the cell, giving a matrix 4 dots high by 2 dots wide. The additional dots are given the numbers 7 and 8 . Eight-dot braille has the advantages that the case of an individual letter is directly coded in the cell containing the letter and that all the printable ": null
    },
    {
        "ASCII": "Ascii"
    },
    {
        " characters can be represented in a single cell. All 256 possible combinations of 8 dots are encoded by the ": null
    },
    {
        "Unicode": "Unicode"
    },
    {
        " standard. Braille with six dots is frequently stored as ": null
    },
    {
        "Braille ASCII": "Braille Ascii"
    },
    {
        ".       The first 25 braille letters, up through the first half of the 3rd decade, transcribe a–z . In English Braille, the rest of that decade is rounded out with the ligatures and, for, of, the, and with. Omitting dot 3 from these forms the 4th decade, the ligatures ch, gh, sh, th, wh, ed, er, ou, ow and the letter w.               Various formatting marks affect the values of the letters that follow them. They have no direct equivalent in print. The most important in English Braille are:        That is,  is read as capital A, and  as the digit 1.       Basic punctuation marks in English Braille include:           is both the question mark and the opening quotation mark. Its reading depends on whether it occurs before a word or after.      is used for both opening and closing parentheses. Its placement relative to spaces and other characters determines its interpretation.     Punctuation varies from language to language. For example, ": null
    },
    {
        "French Braille": "French Braille"
    },
    {
        " uses  for its question mark and swaps the quotation marks and parentheses ; it uses the period  for the decimal point, as in print, and the decimal point  to mark capitalization.            Braille contractions are words and affixes that are shortened so that they take up fewer cells. In English Braille, for example, the word afternoon is written with just three letters,  , much like ": null
    },
    {
        "stenoscript": "Stenoscript"
    },
    {
        ". There are also several abbreviation marks that create what are effectively ": null
    },
    {
        "logograms": "Logogram"
    },
    {
        ". The most common of these is dot 5, which combines with the first letter of words. With the letter  m, the resulting word is  mother. There are also ": null
    },
    {
        "ligatures": "Ligature"
    },
    {
        " , which are single letters in braille but correspond to more than one letter in print. The letter  and, for example, is used to write words with the sequence a-n-d in them, such as  hand.            Most ": null
    },
    {
        "braille embossers": "Braille Embosser"
    },
    {
        " support between 34 and 40 cells per line, and 25 lines per page.     A manually operated Perkins braille typewriter supports a maximum of 42 cells per line , and typical paper allows 25 lines per page.     A large interlining Stainsby has 36 cells per line and 18 lines per page.     An A4-sized Marburg braille frame, which allows interpoint braille has 30 cells per line and 27 lines per page.             A Braille writing machine is a typewriter with six keys that allow to write in Braille alphabet on a regular white page.     The first Braille typewriter to gain general acceptance was invented by ": null
    },
    {
        "Frank Haven Hall": "Frank Haven Hall"
    },
    {
        " , and was presented to the public in ": null
    },
    {
        "1892": "1892"
    },
    {
        ". History of the Perkins Brailler www.perkins.org/assets/downloads/research/history-of-brailler-11-17-09.pdf      The Stainsby Brailler, developed by Henry Stainsby in 1903, is a mechanical writer with a sliding carriage that moves over an aluminium plate as it embosses Braille characters. An improved version was introduced around 1933.       In 1951 David Abraham, a woodworking teacher at the ": null
    },
    {
        "Perkins School for the Blind": "Perkins School For The Blind"
    },
    {
        " produced a more advanced Braille typewriter, the ": null
    },
    {
        "Perkins Brailler": "Perkins Brailler"
    },
    {
        ".     ": null
    },
    {
        "Braille printers or embosser": "Braille Embosser"
    },
    {
        " were produced in 1950s.   In 1960 Robert Mann, a teacher in MIT, wrote DOTSYS, a software that allowed automatic ": null
    },
    {
        "braille translation": "Braille Translator"
    },
    {
        ", and another group created an ": null
    },
    {
        "embossing": "Braille Translator"
    },
    {
        " device called M.I.T. Braillemboss. . The Mitre Corporation team of Robert Gildea, Jonathan Millen, Reid Gerhart and Joseph Sullivan developed ": null
    },
    {
        "DOTSYS III": "Dotsys Iii"
    },
    {
        ", the first braille translator written in a portable programming language. DOTSYS III was developed for the ": null
    },
    {
        "Atlanta Public Schools": "Atlanta Public Schools"
    },
    {
        " as a ": null
    },
    {
        "public domain program": "Public Domain"
    },
    {
        ".  retrieved 3/30/2016  retrieved 3/30/2016 , retrieved 3/29/2012     In 1991 Ernest Bate developed the ": null
    },
    {
        "Mountbatten Brailler": "Mountbatten Brailler"
    },
    {
        ", an electronic machine used to type braille on braille paper, giving it a number of additional features such as word processing, audio feedback and embossing. This version was improved in 2008 with a quiet writer that had an erase key.     In 2011 David S. Morgan produced the first SMART Brailler machine, with added ": null
    },
    {
        "text to speech": "Text To Speech"
    },
    {
        " function and allowed digital capture of data entered.         Braille is usually read in printed forms such as paper books written in braille, braille public signals and also on ": null
    },
    {
        "Braille e-books": "Braille E-Book"
    },
    {
        ". Currently more than 1% of all printed books have been translated into braille.     Although the finger can read only one braille character at a time, the brain chunks braille at a higher level, processing words a digraph, root or suffix at a time. The processing largely takes place in the ": null
    },
    {
        "visual cortex": "Visual Cortex"
    },
    {
        ".  National Public Radio, 05 May 2018            Children who are blind not only have the educational disadvantage of not being able to see – they also miss out on fundamental parts of early and advanced education if not provided with the necessary tools. Children who are blind or visually impaired can begin learning pre-braille skills from a very young age to become fluent braille readers as they get older.         In 1960, 50% of ": null
    },
    {
        "legally blind": "Legally Blind"
    },
    {
        ", school-age children were able to read braille in the U.S.   According to the 2015 Annual Report from the ": null
    },
    {
        "American Printing House for the Blind": "American Printing House For The Blind"
    },
    {
        ", there were 61,739 legally blind students registered in the U.S. Of these, 8.6% were registered as braille readers, 31% as visual readers, 9.4% as auditory readers, 17% as pre-readers, and 34% as non-readers.      There are numerous causes for the decline in braille usage, including school budget constraints, technology advancements such as screen-reader software, and different philosophical views over how blind children should be educated.       A key turning point for braille literacy was the passage of the ": null
    },
    {
        "Rehabilitation Act of 1973": "Rehabilitation Act Of 1973"
    },
    {
        ", an ": null
    },
    {
        "act of Congress": "Act Of Congress"
    },
    {
        " that moved thousands of children from specialized schools for the blind into ": null
    },
    {
        "mainstream": "Mainstreaming"
    },
    {
        " public schools. Because only a small percentage of public schools could afford to train and hire braille-qualified teachers, braille literacy has declined since the law took effect. Braille literacy rates have improved slightly since the bill was passed, in part because of pressure from consumers and advocacy groups that has led 27 states to pass legislation mandating that children who are legally blind be given the opportunity to learn braille.     In 1998 there were 57,425 legally blind students registered in the United States, but only 10% of them used braille as their primary reading medium.       Early Braille education is crucial to literacy for a blind or low-vision child. A study conducted in the state of Washington found that people who learned braille at an early age did just as well, if not better than their sighted peers in several areas, including vocabulary and comprehension. In the preliminary adult study, while evaluating the correlation between adult literacy skills and employment, it was found that 44% of the participants who had learned to read in braille were unemployed, compared to the 77% unemployment rate of those who had learned to read using print.  Currently, among the estimated 85,000 blind adults in the United States, 90% of those who are braille-literate are employed. Among adults who do not know braille, only 33% are employed. Statistically, history has proven that braille reading proficiency provides an essential skill set that allows blind or low-vision children to compete with their sighted peers in a school environment and later in life as they enter the workforce.         Though braille is thought to be the main way blind people read and write, in Britain out of the reported two million blind and low vision population, it is estimated that only around 15,000–20,000 people use braille.  Younger people are turning to electronic text on computers with ": null
    },
    {
        "screen reader": "Screen Reader"
    },
    {
        " software instead, a more portable communication method that they can use with their friends. A debate has started on how to make braille more attractive and for more teachers to be available to teach it.                  Although it is possible to transcribe print by simply substituting the equivalent braille character for its printed equivalent, in English such a character-by-character transcription  is only used by beginners.     Braille characters are much larger than their printed equivalents, and the standard 11 by 11.5 page has room for only 25 lines of 43 characters. To reduce space and increase reading speed, most braille alphabets and orthographies use ligatures, abbreviations, and contractions. Virtually all English Braille books are transcribed in this contracted braille, which adds an additional layer of complexity to English orthography: The Library of Congresss Instruction Manual for Braille Transcribing Risjord, Constance . , Library of Congress, 5th ed.  runs to over 300 pages and braille transcribers must pass certification tests.     Fully contracted braille is known as Grade 2 Braille. There is an intermediate form, called Grade 1 Braille, that is between Computer Braille and Grade 2 Braille. In Grade 1 Braille, the capital sign and number sign are used, and most punctuation marks are shown using their Grade 2 values.     The system of ": null
    },
    {
        "contractions": "Contraction"
    },
    {
        " in English Braille begins with a set of 23 words which are contracted to single characters. Thus the word but is contracted to the single letter b, can to c, do to d, and so on. Even this simple rule creates issues requiring special cases; for example, d is, specifically, an abbreviation of the verb do; the noun do representing the note of the musical scale is a different word, and must be spelled out.     Portions of words may be contracted, and many rules govern this process. For example, the character with dots 2-3-5 stands for ff when used in the middle of a word. At the beginning of a word, this same character stands for the word to ; the character is written in braille with no space following it.  At the end of a word, the same character represents an exclamation point.     Some contractions are more similar than their print equivalents. For example, the contraction , meaning letter, differs from , meaning little, only by one dot in the second letter:  little,  letter. This causes greater confusion between the braille spellings of these words and can hinder the learning process of contracted braille. Hampshire, Barry. Working with Braille. Paris: Unesco, 1981.     The contraction rules take into account the linguistic structure of the word; thus, contractions are generally not to be used when their use would alter the usual braille form of a base word to which a prefix or suffix has been added. Some portions of the transcription rules are not fully codified and rely on the judgment of the transcriber. Thus, when the contraction rules permit the same word in more than one way, preference is given to the contraction that more nearly approximates correct pronunciation.     Grade 3 Braille . geocities.com . Retrieved on 2012-12-21. is a variety of non-standardized systems that include many additional shorthand-like contractions. They are not used for publication, but by individuals for their personal convenience.       When people produce braille, this is called braille transcription. When computer software produces braille, this is called braille   translation. Braille translation software exists to handle most of the common languages of the world, and many technical areas,   such as ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " , for example ": null
    },
    {
        "WIMATS": "Wimats"
    },
    {
        ", ": null
    },
    {
        "music": "Music"
    },
    {
        " , and tactile graphics.       Since Braille is one of the few writing systems where tactile perception is used, as opposed to visual perception, a braille reader must develop new skills. One skill important for Braille readers is the ability to create smooth and even pressures when running ones fingers along the words. There are many different styles and techniques used for the understanding and development of braille, even though a study by B. F. Holland Holland, B. F. . Speed and Pressure Factors in Braille Reading , Teachers Forum, Vol. 7. pp.  13–17 suggests that there is no specific technique that is superior to any other.     Another study by Lowenfield & Abel Lowenfield, B.; Abel, and G. L. . Methods of Teaching Braille Reading Efficiency of Children in Lower Senior Classes. Birmingham, Research Centre for the Education of the Visually Handicapped shows that braille can be read the fastest and best... by students who read using the index fingers of both hands . Another important reading skill emphasized in this study is to finish reading the end of a line with the right hand and to find the beginning of the next line with the left hand simultaneously. One final conclusion drawn by both Lowenfield and Abel is that children have difficulty using both hands independently where the right hand is the dominant hand. But this hand preference does not correlate to other activities.                  When Braille was first adapted to languages other than French, many schemes were adopted, including mapping the native alphabet to the alphabetical order of French – e.g. in English W, which was not in the French alphabet at the time, is mapped to braille X, X to Y, Y to Z, and Z to the first French-accented letter – or completely rearranging the alphabet such that common letters are represented by the simplest braille patterns. Consequently, mutual intelligibility was greatly hindered by this state of affairs. In 1878, the International Congress on Work for the Blind, held in Paris, proposed an international braille standard, where braille codes for different languages and scripts would be based, not on the order of a particular alphabet, but on phonetic correspondence and transliteration to Latin.      This unified braille has been applied to the languages of India and Africa, Arabic, Vietnamese, Hebrew, Russian, and Armenian, as well as nearly all Latin-script languages. Greek, for example, gamma is written as Latin g, despite the fact that it has the alphabetic position of c; Hebrew bet, the second letter of the alphabet and ": null
    },
    {
        "cognate": "Cognate"
    },
    {
        " with the Latin letter b, is sometimes pronounced /b/ and sometimes /v/, and is written b or v accordingly; Russian ts is written as c, which is the usual letter for /ts/ in those Slavic languages that use the Latin alphabet; and Arabic f is written as f, despite being historically p, and occurring in that part of the Arabic alphabet .         Other systems for assigning values to braille patterns are also followed beside the simple mapping of the alphabetical order onto the original French order. Some braille alphabets start with ": null
    },
    {
        "unified braille": "Unified Braille"
    },
    {
        ", and then diverge significantly based on the phonology of the target languages, while others diverge even further.     In the various Chinese systems, traditional braille values are used for initial consonants and the simple vowels. In both ": null
    },
    {
        "Mandarin": "Mainland Chinese Braille"
    },
    {
        " and ": null
    },
    {
        "Cantonese Braille": "Cantonese Braille"
    },
    {
        ", however, characters have different readings depending on whether they are placed in syllable-initial or syllable-final position. For instance, the cell for Latin k, , represents Cantonese k  when initial, but aak when final, while Latin j, , represents Cantonese initial j but final oei.     Novel systems of braille mapping include Korean, which adopts separate syllable-initial and syllable-final forms for its consonants, explicitly grouping braille cells into syllabic groups in the same way as ": null
    },
    {
        "hangul": "Hangul"
    },
    {
        ". Japanese, meanwhile, combines independent vowel dot patterns and modifier consonant dot patterns into a single braille cell – an ": null
    },
    {
        "abugida": "Abugida"
    },
    {
        " representation of each Japanese ": null
    },
    {
        "mora": "Mora Japanese"
    },
    {
        ".             The current series of ": null
    },
    {
        "Canadian banknotes": "Banknotes Of The Canadian Dollar"
    },
    {
        " has a ": null
    },
    {
        "tactile feature": "Canadian Currency Tactile Feature"
    },
    {
        " consisting of raised dots that indicate the denomination, allowing bills to be easily identified by blind or low vision people. It does not use standard braille; rather, the feature uses a system developed in consultation with blind and low vision Canadians after research indicated that braille was not sufficiently robust and that not all potential users read braille. ": null
    },
    {
        "Mexican bank notes": "Mexican Pesoseries D"
    },
    {
        ", ": null
    },
    {
        "Australian bank notes": "Australian Dollar"
    },
    {
        ", ": null
    },
    {
        "Indian rupee": "Indian Rupee"
    },
    {
        " notes, ": null
    },
    {
        "Israeli new shekel": "Israeli New Shekel"
    },
    {
        " notes . boi.org.il. Retrieved on 2013-01-11. and ": null
    },
    {
        "Russian ruble": "Russian Ruble"
    },
    {
        " notes also have special raised symbols to make them identifiable by persons who are blind or low vision.      In ": null
    },
    {
        "India": "India"
    },
    {
        " there are instances where the parliament acts have been published in braille, such as The Right to Information Act. . The Hindu . Retrieved on 2012-12-21.     In the United States, the ": null
    },
    {
        "Americans with Disabilities Act of 1990": "Americans With Disabilities Act Of 1990"
    },
    {
        " . Retrieved on 2012-12-21. requires various building signage to be in braille.     In the United Kingdom, it is required that medicines have the name of the medicine in Braille on the labeling. . gov.uk. Retrieved on 2015-05-05.     Australia also recently introduced the tactile feature onto their five-dollar banknote      U.K. September 2017 – On the front of the £10 polymer note , there are two clusters of raised dots in the top left hand corner. This tactile feature helps blind and partially sighted people identify the value of the note.             Braille was added to the ": null
    },
    {
        "Unicode": "Unicode"
    },
    {
        " Standard in September 1999 with the release of version 3.0.     Most ": null
    },
    {
        "braille embossers": "Braille Embosser"
    },
    {
        " and ": null
    },
    {
        "refreshable braille displays": "Refreshable Braille Display"
    },
    {
        " do not support Unicode, using instead 6-dot ": null
    },
    {
        "braille ASCII": "Braille Ascii"
    },
    {
        ". Some embossers have proprietary control codes for 8-dot braille or for full graphics mode, where dots may be placed anywhere on the page without leaving any space between braille cells so that continuous lines can be drawn in diagrams, but these are rarely used and are not standard.     The Unicode standard encodes 8-dot braille glyphs according to their binary appearance, rather than following their assigned numeric order. Dot 1 corresponds to the ": null
    },
    {
        "least significant bit": "Least Significant Bit"
    },
    {
        " of the low byte of the Unicode scalar value, and dot 8 to the high bit of that byte.     The Unicode block for braille is U+2800 ... U+28FF:            Every year on 4 January, World Braille Day is observed internationally to commemorate the birth of ": null
    },
    {
        "Louis Braille": "Louis Braille"
    },
    {
        " and to recognize his efforts, but the event is not considered a public holiday. ": null
    }
]