[
    {
        "In ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ", bra–ket notation is a common notation for ": null
    },
    {
        "quantum states": "Quantum State"
    },
    {
        "i.e. vectors in a complex ": null
    },
    {
        "Hilbert space": "Hilbert Space"
    },
    {
        " on which an algebra of observables act. More generally the notation uses the ": null
    },
    {
        "angle brackets": "Angle Bracket"
    },
    {
        " and a ": null
    },
    {
        "vertical bar": "Vertical Bar"
    },
    {
        " , for a ket  like |v   to denote a ": null
    },
    {
        "vector": "Vector Space"
    },
    {
        " in an abstract ": null
    },
    {
        "vector space": "Vector Space"
    },
    {
        " V and a bra,  like   f| to denote a ": null
    },
    {
        "linear functional": "Linear Functional"
    },
    {
        " on V , i.e. a co-vector, an element of the ": null
    },
    {
        "dual vector space": "Dual Vector Space"
    },
    {
        " V  . The natural pairing   f of a linear functional f   f| with a vector v |v  is then written as   f| v  . On Hilbert spaces, the ": null
    },
    {
        "scalar product": "Scalar Product"
    },
    {
        " gives an identification of a vector ket   |  with a linear functional bra   . Using this notation, the scalar product   .   For the vector space   , kets can be identified with column vectors, and bras with row vectors. Combinations of bras, kets, and operators are interpreted using ": null
    },
    {
        "matrix multiplication": "Matrix Multiplication"
    },
    {
        ". If   has the standard hermitian inner product v  w , under this identification, the identification of kets and bras and vice versa provided by the inner product is taking the hermitian conjugate   .     It is common to suppress the vector or functional from the bra–ket notation and only use a label inside the typography for the bra or ket. For example the spin operator   on a two dimensional space   of ": null
    },
    {
        "spinors": "Spinors"
    },
    {
        ", has eigenvalues     with eigen spinors       . In bra-ket notation one typically denotes this as   |+  , and     |-  . Just as above, kets and bras with the same label are interpreted as kets and bras corresponding to each other using the inner product. In particular when also identified with row and column vectors, kets and bras with the same label are identified with ": null
    },
    {
        "Hermitian conjugate": "Hermitian Conjugate"
    },
    {
        " column and row vectors.     Bra-ket notation was introduced in 1939 by ": null
    },
    {
        "Paul Dirac": "Paul Dirac"
    },
    {
        "   and is also known as the Dirac notation. However the bra-ket notation has a precursor in ": null
    },
    {
        "Hermann Grassmanns": "Hermann Grassmann"
    },
    {
        "use of the notation for his inner products nearly 100 years earlier.  , Leonard Susskind on complex numbers, complex conjugate, bra, ket. 2006-10-02.       Bra–ket notation is a notation for ": null
    },
    {
        "linear algebra": "Linear Algebra"
    },
    {
        " and ": null
    },
    {
        "linear operators": "Linear Operator"
    },
    {
        " on ": null
    },
    {
        "complex vector spaces": "Complex Vector Space"
    },
    {
        "together with their ": null
    },
    {
        "dual space": "Dual Space"
    },
    {
        " both in the finite-dimensional and infinite-dimensional case. It is specifically designed to ease the types of calculations that frequently come up in ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ". Its use in quantum mechanics is quite widespread. Many phenomena that are explained using quantum mechanics are explained using bra–ket notation.             In mathematics, the term vector is used for an element of any vector space. In physics, however, the term vector is much more specific: vector refers almost exclusively to quantities like ": null
    },
    {
        "displacement": "Displacement"
    },
    {
        " or ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        ", which have components that relate directly to the three dimensions of space, or relativistically, to the four of space time. Such vectors are typically denoted with over arrows , boldface or indices .     In quantum mechanics, a ": null
    },
    {
        "quantum state": "Quantum State"
    },
    {
        " is typically represented as an element of a complex Hilbert space, for example, the infinite-dimensional vector space of all possible ": null
    },
    {
        "wavefunctions": "Wavefunction"
    },
    {
        " or some more abstract Hilbert space constructed more algebraically. Since the term vector is already used for something else , and physicists tend to prefer conventional notation to stating what space something is an element of, it is common and useful to denote an element   of an abstract complex vector spaces as a ket |  using vertical bars and angular brackets and refer to them as kets rather than as vectors and pronounced ket-   or ket-A for . Symbols, letters, numbers, or even words—whatever serves as a convenient label—can be used as the label inside a ket, with the |    making clear that the label indicates a vector in vector space. In other words, the symbol  has a specific and universal mathematical meaning, while just the  by itself does not. For example,  might or might not be equal to . Nevertheless, for convenience, there is usually some logical scheme behind the labels inside kets, such as the common practice of labeling ": null
    },
    {
        "energy eigenkets": "Stationary State"
    },
    {
        " in quantum mechanics through a listing of their ": null
    },
    {
        "quantum number": "Quantum Number"
    },
    {
        "s.     Ket notation was invented by Dirac          Since kets are just vectors in a vector space they can be manipulated using the usual rules of linear algebra, for example:     :     |A   & |B  + |C      |C   & |D       |D   &   e |x                Note how the last line above involves infinitely many different kets, one for each real number .     If the ket is an element of a vector space, a bra   A| is an element of its ": null
    },
    {
        "dual space": "Dual Space"
    },
    {
        ", i.e a bra is a linear functional which is a linear map from the vector space to the complex numbers. Thus, it is useful to think of kets and bras as being elements of different vector spaces with both being different useful concepts     A bra   and a ket |  , can be combined to an operator |  of rank one with ": null
    },
    {
        "outer product": "Outer Product"
    },
    {
        "     : |  : |    |             The bra-ket notation is particularly useful in Hilbert spaces which have an ": null
    },
    {
        "inner product": "Inner Product"
    },
    {
        " , Leonard Susskind on inner product, 2006-10-02. that allows ": null
    },
    {
        "Hermitian conjugation": "Hermitian Conjugation"
    },
    {
        " and identifying a vector with a linear functional, i.e. a ket with a bra, and vice versa . The ": null
    },
    {
        "inner product": "Inner Product"
    },
    {
        " on Hilbert space is fully equivalent to an identification between the space of kets and that of bras in the bra ket notation: for a vector ket   |  define a functional f    by     : : f                      In the simple case where we consider the vector space   , a ket can be identified with a ": null
    },
    {
        "column vector": "Column Vector"
    },
    {
        ", and a bra as a ": null
    },
    {
        "row vector": "Row Vector"
    },
    {
        ". If moreover we use the standard hermitian innerproduct on   , the bra corresponding to a ket, in particular a bra  and a ket  with the same label are ": null
    },
    {
        "conjugate transpose": "Conjugate Transpose"
    },
    {
        ". Moreover, conventions are set up in such a way that writing bras, kets, and linear operators next to each other simply imply ": null
    },
    {
        "matrix multiplication": "Matrix Multiplication"
    },
    {
        ".  In particular the outer product |  of a column and a row vector ket and bra can be identified with matrix multiplication .       For a finite-dimensional vector space, using a fixed ": null
    },
    {
        "orthonormal basis": "Orthonormal Basis"
    },
    {
        ", the inner product can be written as a ": null
    },
    {
        "matrix multiplication": "Matrix Multiplication"
    },
    {
        " of a row vector with a column vector:   :   A | B     A1 B1 + A2 B2 +   + AN BN     A1 & A2 &   & AN       B1   B2       BN     Based on this, the bras and kets can be defined as:   :     A | &     A1 & A2 &   & AN       | B   &     B1   B2       BN       and then it is understood that a bra next to a ket implies ": null
    },
    {
        "matrix multiplication": "Matrix Multiplication"
    },
    {
        ".     The ": null
    },
    {
        "conjugate transpose": "Conjugate Transpose"
    },
    {
        "  of a bra is the corresponding ket and vice versa:   :   A |  |A     |A     A |   because if one starts with the bra   :   A1 & A2 &   & AN       then performs a ": null
    },
    {
        "complex conjugation": "Complex Conjugation"
    },
    {
        ", and then a ": null
    },
    {
        "matrix transpose": "Matrix Transpose"
    },
    {
        ", one ends up with the ket   :   A1   A2       AN       Writing elements of a finite dimensional vector space as a column vector of numbers requires picking a ": null
    },
    {
        "basis": "Basis"
    },
    {
        ". Picking a basis is not always helpful because quantum mechanics calculations involve frequently switching between different bases , and one can write something like  without committing to any particular basis. In situations involving two different important basis vectors, the basis vectors can be taken in the notation explicitly and here will be referred simply as  and  .         Bra–ket notation can be used even if the vector space is not a ": null
    },
    {
        "Hilbert space": "Hilbert Space"
    },
    {
        ".     In quantum mechanics, it is common practice to write down kets which have infinite ": null
    },
    {
        "norm": "Norm"
    },
    {
        ", i.e. non-": null
    },
    {
        "normalizable wavefunction": "Normalizable Wavefunction"
    },
    {
        "s. Examples include states whose ": null
    },
    {
        "wavefunctions": "Wavefunction"
    },
    {
        "are ": null
    },
    {
        "Dirac delta functions": "Dirac Delta Function"
    },
    {
        "or infinite ": null
    },
    {
        "plane wave": "Plane Wave"
    },
    {
        "s. These do not, technically, belong to the ": null
    },
    {
        "Hilbert space": "Hilbert Space"
    },
    {
        " itself. However, the definition of Hilbert space can be broadened to accommodate these states . The bra–ket notation continues to work in an analogous way in this broader context.     ": null
    },
    {
        "Banach spaces": "Banach Space"
    },
    {
        "are a different generalization of Hilbert spaces. In a Banach space , the vectors may be notated by kets and the continuous ": null
    },
    {
        "linear functionals": "Linear Functional"
    },
    {
        "by bras. Over any vector space without ": null
    },
    {
        "topology": "Topology"
    },
    {
        ", we may also notate the vectors by kets and the linear functionals by bras. In these more general contexts, the bracket does not have the meaning of an inner product, because the Riesz representation theorem does not apply.         The mathematical structure of ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " is based in large part on ": null
    },
    {
        "linear algebra": "Linear Algebra"
    },
    {
        "Wave functions": "Wave Function"
    },
    {
        "and other ": null
    },
    {
        "quantum states": "Quantum State"
    },
    {
        "can be represented as vectors in a complex ": null
    },
    {
        "Hilbert space": "Hilbert Space"
    },
    {
        ". In bra–ket notation, for example, an electron might be in the state .    ": null
    },
    {
        "Quantum superpositions": "Quantum Superposition"
    },
    {
        "can be described as vector sums of the constituent states. For example, an electron in the state  is in a quantum superposition of the states  and .   ": null
    },
    {
        "Measurements": "Measurement In Quantum Mechanics"
    },
    {
        " are associated with ": null
    },
    {
        "linear operators": "Linear Operator"
    },
    {
        "  on the Hilbert space of quantum states.   Dynamics are also described by linear operators on the Hilbert space. For example, in the ": null
    },
    {
        "Schrödinger picture": "Schrödinger Picture"
    },
    {
        ", there is a linear ": null
    },
    {
        "time evolution": "Time Evolution"
    },
    {
        " operator  with the property that if an electron is in state  right now, at a later time it will be in the state , the same  for every possible .   ": null
    },
    {
        "Wave function normalization": "Normalizable Wave Function"
    },
    {
        " is scaling a wave function so that its ": null
    },
    {
        "norm": "Norm"
    },
    {
        " is 1.     Since virtually every calculation in quantum mechanics involves vectors and linear operators, it can involve, and often does involve, bra–ket notation. A few examples follow:            The Hilbert space of a ": null
    },
    {
        "spin": "Spin"
    },
    {
        "-0 point particle is spanned by a position ": null
    },
    {
        "basis": "Basis"
    },
    {
        " , where the label  extends over the set of all points in ": null
    },
    {
        "position space": "Position Space"
    },
    {
        ". This label is the eigenvalue of the position operator acting on such a basis state,     . Since there are an ": null
    },
    {
        "uncountably infinite": "Uncountably Infinite"
    },
    {
        " number of vector components in the basis, this is an uncountably infinite-dimensional Hilbert space. The dimensions of the Hilbert space and position space are not to be conflated.     Starting from any ket  in this Hilbert space, one may define a complex scalar function of , known as a ": null
    },
    {
        "wavefunction": "Wavefunction"
    },
    {
        ",   :                 On the left-hand side,  is a function mapping any point in space to a complex number; on the right-hand side,  is a ket consisting of a superposition of kets with relative coefficients specified by that function.     It is then customary to define linear operators acting on wavefunctions in terms of linear operators acting on kets, by   :   A           A|        For instance, the ": null
    },
    {
        "momentum": "Momentum"
    },
    {
        " operator     has the following form,   :           |    - i             One occasionally encounters an expression such as   :   |      though this is something of an ": null
    },
    {
        "abuse of notation": "Abuse Of Notation"
    },
    {
        ". The differential operator must be understood to be an abstract operator, acting on kets, that has the effect of differentiating wavefunctions once the expression is projected onto the position basis,         even though, in the momentum basis, this operator amounts to a mere multiplication operator . That is, to say,   :     |    - i         ~,   or   :       d3   ~|       ~.       In quantum mechanics the expression  is typically interpreted as the ": null
    },
    {
        "probability amplitude": "Probability Amplitude"
    },
    {
        " for the state  to ": null
    },
    {
        "collapse": "Wavefunction Collapse"
    },
    {
        " into the state . Mathematically, this means the coefficient for the projection of  onto . It is also described as the projection of state  onto state .      particle": null
    },
    {
        "spin-": "Spin-½"
    },
    {
        " particle has a two-dimensional Hilbert space. One ": null
    },
    {
        "orthonormal basis": "Orthonormal Basis"
    },
    {
        " is:   : |z       |z     where  is the state with a definite value of the ": null
    },
    {
        "spin operator ": "Angular Momentum Operator"
    },
    {
        " equal to + and  is the state with a definite value of the ": null
    },
    {
        "spin operator ": "Angular Momentum Operator"
    },
    {
        " equal to −.     Since these are a ": null
    },
    {
        "basis": "Basis"
    },
    {
        ", any ": null
    },
    {
        "quantum state": "Quantum State"
    },
    {
        " of the particle can be expressed as a ": null
    },
    {
        "linear combination": "Linear Combination"
    },
    {
        "  of these two states:   : |    a |z   + b |z     where  and  are complex numbers.     A different basis for the same Hilbert space is:   : |x       |x     defined in terms of  rather than .     Again, any state of the particle can be expressed as a linear combination of these two:   : |    c |x   + d |x       In vector form, you might write   : |      a    b          |      c    d      depending on which basis you are using. In other words, the coordinates of a vector depend on the basis used.     There is a mathematical relationship between , ,  and ; see ": null
    },
    {
        "change of basis": "Change Of Basis"
    },
    {
        ".            There are a few conventions and abuses of notation that are generally accepted by the physics community, but which might confuse the non-initiated.     It is common to use the same symbol for labels and constants in the same equation. For example, , where the symbol  is used simultaneously as the name of the operator , its eigenvector  and the associated eigenvalue .     Something similar occurs in component notation of vectors. While  is traditionally associated with wavefunctions,  may be used to denote a label, a wave function or complex constant in the same context, usually differentiated only by a subscript.     The main abuses are including operations inside the vector labels. This is done for a fast notation of scaling vectors. E.g. if the vector  is scaled by , it might be denoted by , which makes no sense since  is a label, not a function or a number, so you cant perform operations on it.     This is especially common when denoting vectors as tensor products, where part of the labels are moved outside the designed slot, e.g. . Here part of the labeling that should state that all three vectors are different was moved outside the kets, as subscripts 1 and 2. And a further abuse occurs, since  is meant to refer to the norm of the first vector—which is a label denoting a value.                A ": null
    },
    {
        "linear operator": "Linear Operator"
    },
    {
        " is a map that inputs a ket and outputs a ket.  In other words, if  is a linear operator and  is a ket, then  is another ket.     In an -dimensional Hilbert space,  can be written as an  ": null
    },
    {
        "column vector": "Column Vector"
    },
    {
        ", and then  is an  matrix with complex entries. The ket  can be computed by normal ": null
    },
    {
        "matrix multiplication": "Matrix Multiplication"
    },
    {
        ".     Linear operators are ubiquitous in the theory of quantum mechanics. For example, observable physical quantities are represented by ": null
    },
    {
        "self-adjoint operator": "Self-Adjoint Operator"
    },
    {
        "s, such as ": null
    },
    {
        "energy": "Energy"
    },
    {
        " or ": null
    },
    {
        "momentum": "Momentum"
    },
    {
        ", whereas transformative processes are represented by ": null
    },
    {
        "unitary": "Unitary Operator"
    },
    {
        " linear operators such as rotation or the progression of time.         Operators can also be viewed as acting on bras from the right hand side. Specifically, if  is a linear operator and  is a bra, then  is another bra defined by the rule     :   |            . This expression is commonly written as      :         In an -dimensional Hilbert space,  can be written as a  ": null
    },
    {
        "row vector": "Row Vector"
    },
    {
        ", and  is an  matrix. Then the bra  can be computed by normal ": null
    },
    {
        "matrix multiplication": "Matrix Multiplication"
    },
    {
        ".     If the same state vector appears on both bra and ket side,   :       then this expression gives the ": null
    },
    {
        "expectation value": "Expectation Value"
    },
    {
        ", or mean or average value, of the observable represented by operator  for the physical system in the state .         A convenient way to define linear operators on a Hilbert space  is given by the ": null
    },
    {
        "outer product": "Outer Product"
    },
    {
        " is a bra and  is a ket, the outer product   : |          denotes the ": null
    },
    {
        "rank-one operator": "Finite-Rank Operator"
    },
    {
        " with the rule   :       | x   |    .     For a finite-dimensional vector space, the outer product can be understood as simple matrix multiplication:   : |          |                             &   &   &               &     &   &             &     &   &           &   &   &           &     &   &           The outer product is an  matrix, as expected for a linear operator.     One of the uses of the outer product is to construct ": null
    },
    {
        "projection operator": "Projection Operator"
    },
    {
        "s. Given a ket  of norm 1, the orthogonal projection onto the ": null
    },
    {
        "subspace": "Linear Subspace"
    },
    {
        " spanned by  is   : |                 Just as kets and bras can be transformed into each other , the element from the dual space corresponding to  is , where  denotes the ": null
    },
    {
        "Hermitian conjugate": "Hermitian Conjugate"
    },
    {
        " of the operator . In other words,   : |  A |              | A        If  is expressed as an  matrix, then  is its ": null
    },
    {
        "conjugate transpose": "Conjugate Transpose"
    },
    {
        ".     ": null
    },
    {
        "Self-adjoint": "Self-Adjoint"
    },
    {
        " operators, where , play an important role in quantum mechanics; for example, an ": null
    },
    {
        "observable": "Observable"
    },
    {
        " is always described by a self-adjoint operator. If  is a self-adjoint operator, then  is always a real number . This implies that ": null
    },
    {
        "expectation values": "Expectation Value"
    },
    {
        " of observables are real.       Bra–ket notation was designed to facilitate the formal manipulation of linear-algebraic expressions. Some of the properties that allow this manipulation are listed herein. In what follows,  and  denote arbitrary ": null
    },
    {
        "complex number": "Complex Number"
    },
    {
        "s,  denotes the ": null
    },
    {
        "complex conjugate": "Complex Conjugate"
    },
    {
        " of ,  and  denote arbitrary linear operators, and these properties are to hold for any choice of bras and kets.       Since bras are linear functionals,     ::     c1  + c2        By the definition of addition and scalar multiplication of linear functionals in the ": null
    },
    {
        "dual space": "Dual Space"
    },
    {
        ", , eqns 12 and 13     ::   |  c1   + c2           Given any expression involving complex numbers, bras, kets, inner products, outer products, and/or linear operators , written in bra–ket notation, the parenthetical groupings do not matter . For example:   :               &         | A |             A    &     A |         |       and so forth. The expressions on the right are allowed to be written unambiguously because of the equalities on the left. Note that the associative property does not hold for expressions that include nonlinear operators, such as the ": null
    },
    {
        "antilinear": "Antilinear"
    },
    {
        " time reversal operator": "T-Symmetry"
    },
    {
        " in physics.       Bra–ket notation makes it particularly easy to compute the Hermitian conjugate  of expressions. The formal rules are:   The Hermitian conjugate of a bra is the corresponding ket, and vice versa.   The Hermitian conjugate of a complex number is its complex conjugate.   The Hermitian conjugate of the Hermitian conjugate of anything is itself—i.e.,   ::       Given any combination of complex numbers, bras, kets, inner products, outer products, and/or linear operators, written in bra–ket notation, its Hermitian conjugate can be computed by reversing the order of the components, and taking the Hermitian conjugate of each.     These rules are sufficient to formally write the Hermitian conjugate of any such expression; some examples are as follows:   Kets:   ::     c1   + c2         Inner products:   ::     |               :Note that  is a scalar, so the Hermitian conjugate is just the complex conjugate, i.e.   ::       |       Matrix elements:   ::         A |     &       A              A  B        &     | BA |            Outer products:   ::     +           Two Hilbert spaces  and  may form a third space  by a ": null
    },
    {
        "tensor product": "Tensor Product"
    },
    {
        ". In quantum mechanics, this is used for describing composite systems. If a system is composed of two subsystems described in  and  respectively, then the Hilbert space of the entire system is the tensor product of the two spaces.      If  is a ket in  and  is a ket in , the direct product of the two kets is a ket in . This is written in various notations:   : |    |    |    ,      See ": null
    },
    {
        "quantum entanglement": "Quantum Entanglementquantum Mechanical Framework"
    },
    {
        " and the ": null
    },
    {
        "EPR paradox": "Epr Paradoxmathematical Formulation"
    },
    {
        " for applications of this product.       Consider a complete ": null
    },
    {
        "orthonormal": "Orthonormal"
    },
    {
        " system ,   :       for a Hilbert space , with respect to the norm from an inner product .     From basic ": null
    },
    {
        "functional analysis": "Functional Analysis"
    },
    {
        ", it is known that any ket  can also be written as   : |      ei |     | ei     with  the inner product on the Hilbert space.     From the commutativity of kets with scalars, it follows that   :   | ei     ei |     must be the identity operator, which sends each vector to itself.     This, then, can be inserted in any expression without affecting its value; for example   :       v | w   &   v |   | w       &   v |     w       &   v | ei     ei | ej     ej | w           where, in the last identity, the ": null
    },
    {
        "Einstein summation convention": "Einstein Summation Convention"
    },
    {
        " has been used.     In ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ", it often occurs that little or no information about the inner product  of two arbitrary kets is present, while it is still possible to say something about the expansion coefficients  and  of those vectors with respect to a specific basis. In this case, it is particularly useful to insert the unit operator into the bracket one time or more.     For more information, see ": null
    },
    {
        "Resolution of the identity": "Resolution Of The Identity"
    },
    {
        ",       , where .     Since , plane waves follow, . In his book , Ch. III.20, Dirac defines the standard ket which, up to a normalization, is the translationally invariant momentum eigenstate |  |p  in the momentum representation, i.e.,   . Consequently, the corresponding wavefunction is a constant,   x|    , and |x    |    .     Typically, when all matrix elements of an operator such as   :   x| A |y    are available,   this resolution serves to reconstitute the full operator,   :   dx dy ~~ |x    x| A |y    y | A ~.         The object physicists are considering when using bra–ket notation is a ": null
    },
    {
        "Hilbert space": "Hilbert Space"
    },
    {
        " .     Let  be a Hilbert space and  a vector in . What physicists would denote by  is the vector itself. That is,     : |h    .     Let  be the ": null
    },
    {
        "dual space": "Dual Space"
    },
    {
        " of . This is the space of linear functionals on . The isomorphism  is defined by , where for every  we define   :       h,g     h|g   ,   where , ,  and  are just different notations for expressing an inner product between two elements in a Hilbert space . Notational confusion arises when identifying  and  with  and  respectively. This is because of literal symbolic substitutions. Let  and let . This gives     :   H H  h|   h|        One ignores the parentheses and removes the double bars. Some properties of this notation are convenient since we are dealing with linear operators and composition acts like a ": null
    },
    {
        "ring": "Ring"
    },
    {
        " multiplication.     Moreover, mathematicians usually write the dual entity not at the first place, as the physicists do, but at the second one, and they usually use not an ": null
    },
    {
        "asterisk": "Asterisk"
    },
    {
        " but an overline  to denote ": null
    },
    {
        "complex conjugate": "Complex Conjugate"
    }
]