[
    {
        "   Bretwalda  is an ": null
    },
    {
        "Old English": "Old English"
    },
    {
        " word. The first record comes from the late 9th-century  Anglo-Saxon Chronicle . It is given to some of the rulers of ": null
    },
    {
        "Anglo-Saxon kingdoms": "History Of Anglo-Saxon England"
    },
    {
        " from the 5th century onwards who had achieved overlordship of some or all of the other Anglo-Saxon kingdoms. It is unclear whether the word dates back to the 5th century and was used by the kings themselves or whether it is a later, 9th-century, invention. The term bretwalda also appears in a 10th-century charter of ": null
    },
    {
        "Æthelstan": "Athelstan Of England"
    },
    {
        ". The literal meaning of the word is disputed and may translate to either wide-ruler or Britain-ruler.     The rulers of ": null
    },
    {
        "Mercia": "Mercia"
    },
    {
        " were generally the most powerful of the Anglo-Saxon kings from the mid 7th century to the early 9th century but are not accorded the title of bretwalda by the Chronicle, which had an anti-Mercian bias. The  Annals of Wales  continued to recognise the ": null
    },
    {
        "kings of Northumbria": "List Of Monarchs Of Northumbria"
    },
    {
        " as Kings of the Saxons until the death of ": null
    },
    {
        "Osred I of Northumbria": "Osred I Of Northumbria"
    },
    {
        " in 716.            Anglo-Saxon Chronicle ": null
    },
    {
        "Ælle of Sussex": "Ælle Of Sussex"
    },
    {
        "    Ceawlin of Wessex": "Ceawlin Of Wessex"
    },
    {
        "   Æthelberht of Kent": "Æthelberht Of Kent"
    },
    {
        "   Rædwald of East Anglia": "Rædwald Of East Anglia"
    },
    {
        "   Edwin of Deira": "Edwin Of Northumbria"
    },
    {
        "   Oswald of Northumbria": "Oswald Of Northumbria"
    },
    {
        "   Oswiu of Northumbria": "Oswiu Of Northumbria"
    },
    {
        "       Penda of Mercia": "Penda Of Mercia"
    },
    {
        "   Wulfhere of Mercia": "Wulfhere Of Mercia"
    },
    {
        "   Æthelred of Mercia": "Æthelred Of Mercia"
    },
    {
        "   Æthelbald of Mercia": "Æthelbald Of Mercia"
    },
    {
        "   Offa of Mercia": "Offa Of Mercia"
    },
    {
        "   Cœnwulf of Mercia": "Coenwulf Of Mercia"
    },
    {
        "     Anglo-Saxon Chronicle": null
    },
    {
        "Egbert of Wessex": "Egbert Of Wessex"
    },
    {
        "   Alfred of Wessex": "Alfred Of Wessex"
    },
    {
        "       Æthelstan of Wessex": "Æthelstan"
    },
    {
        "       The first syllable of the term bretwalda may be related to ": null
    },
    {
        "Briton": "Britons"
    },
    {
        " or Britain. The second element is taken to mean ruler or ": null
    },
    {
        "sovereign": "Sovereign"
    },
    {
        ", though is more literally wielder. Thus, this interpretation would mean sovereign of Britain or wielder of Britain. . . The word may be a ": null
    },
    {
        "compound": "Compound"
    },
    {
        " containing the ": null
    },
    {
        "Old English": "Old English"
    },
    {
        " adjective brytten , . an element also found in the terms bryten rice , bryten-grund and bryten cyning . Though the origin is ambiguous, the draughtsman of the charter issued by ": null
    },
    {
        "Æthelstan": "Æthelstan"
    },
    {
        " used the term in a way that can only mean wide-ruler.      The latter etymology was first suggested by ": null
    },
    {
        "John Mitchell Kemble": "John Mitchell Kemble"
    },
    {
        " who alluded that of six manuscripts in which this passage occurs, one only reads Bretwalda: of the remaining five, four have Bryten-walda or -wealda, and one Breten-anweald, which is precisely synonymous with Brytenwealda ; that Æthelstan was called brytenwealda ealles ðyses ealondes,  which Kemble translates as ruler of all these islands; and that bryten- is a common prefix to words meaning wide or general dispersion and that the similarity to the word bretwealh is merely accidental .       The first recorded use of the term Bretwalda comes from a ": null
    },
    {
        "West Saxon": "Wessex"
    },
    {
        " chronicle of the late 9th century that applied the term to ": null
    },
    {
        "Ecgberht": "Egbert Of Wessex"
    },
    {
        ", who ruled Wessex from 802 to 839. Anglo-Saxon Chronicle MS A, 827 for 829. The chronicler also wrote down the names of seven kings that ": null
    },
    {
        "Bede": "Bede"
    },
    {
        " listed in his  Historia ecclesiastica gentis Anglorum  in 731. From Bede,  Historia ecclesiastica gentis Anglorum  2.5. All subsequent manuscripts of the Chronicle use the term Brytenwalda, which may have represented the original term or derived from a common error.     There is no evidence that the term was a title that had any practical use, with implications of formal rights, powers and office, or even that it had any existence before the 9th-century. Bede wrote in ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " and never used the term and his list of kings holding imperium should be treated with caution, not least in that he overlooks kings such as ": null
    },
    {
        "Penda of Mercia": "Penda Of Mercia"
    },
    {
        ", who clearly held some kind of dominance during his reign. Similarly, in his list of bretwaldas, the West Saxon chronicler ignored such ": null
    },
    {
        "Mercian kings": "List Of Monarchs Of Mercia"
    },
    {
        " as ": null
    },
    {
        "Offa": "Offa Of Mercia"
    },
    {
        ".     The use of the term Bretwalda was the attempt by a West Saxon chronicler to make some claim of ": null
    },
    {
        "West Saxon kings": "List Of Monarchs Of Wessex"
    },
    {
        " to the whole of Great Britain. The concept of the overlordship of the whole of Britain was at least recognised in the period, whatever was meant by the term. Quite possibly it was a survival of a Roman concept of Britain : it is significant that, while the hyperbolic inscriptions on coins and titles in ": null
    },
    {
        "charters": "Charters"
    },
    {
        " often included the title rex Britanniae, when England was unified the title used was rex Angulsaxonum,       For some time, the existence of the word bretwalda in the Anglo-Saxon Chronicle, which was based in part on the list given by ": null
    },
    {
        "Bede": "Bede"
    },
    {
        " in his Historia Ecclesiastica, led historians to think that there was perhaps a title held by Anglo-Saxon overlords. This was particularly attractive as it would lay the foundations for the establishment of an English monarchy. The 20th-century historian ": null
    },
    {
        "Frank Stenton": "Frank Stenton"
    },
    {
        " said of the Anglo-Saxon chronicler that his inaccuracy is more than compensated by his preservation of the English title applied to these outstanding kings . . He argued that the term bretwalda falls into line with the other evidence which points to the Germanic origin of the earliest English institutions .     Over the later 20th century, this assumption was increasingly challenged. ": null
    },
    {
        "Patrick Wormald": "Patrick Wormald"
    },
    {
        " interpreted it as less an objectively realized office than a subjectively perceived status and emphasised the partiality of its usage in favour of ": null
    },
    {
        "Southumbrian": "Southumbrian"
    },
    {
        " rulers. . In 1991, Steven Fanning argued that it is unlikely that the term ever existed as a title or was in common usage in Anglo-Saxon England . .  The fact that Bede never mentioned a special title for the kings in his list implies that he was unaware of one.  In 1995, ": null
    },
    {
        "Simon Keynes": "Simon Keynes"
    },
    {
        " observed that if Bedes concept of the Southumbrian overlord, and the chroniclers concept of the Bretwalda, are to be regarded as artificial constructs, which have no validity outside the context of the literary works in which they appear, we are released from the assumptions about political development which they seem to involve... we might ask whether kings in the eighth and ninth centuries were quite so obsessed with the establishment of a pan-Southumbrian state . .     Modern interpretations view the concept of bretwalda overlordship as complex and an important indicator of how a 9th-century chronicler interpreted history and attempted to insert the increasingly powerful Saxon kings into that history.       A complex array of dominance and subservience existed during the Anglo-Saxon period. A king who used ": null
    },
    {
        "charters": "Anglo-Saxon Charters"
    },
    {
        " to grant land in another kingdom indicated such a relationship. If a king held sway over a large kingdom, such as when the Mercians dominated the ": null
    },
    {
        "East Anglians": "Kingdom Of East Anglia"
    },
    {
        ", the relationship would have been more equal than in the case of the Mercian dominance of the ": null
    },
    {
        "Hwicce": "Hwicce"
    },
    {
        ", which was a comparatively small kingdom. Mercia was arguably the most powerful Anglo-Saxon kingdom for much of the late 7th though 8th centuries, though Mercian kings are missing from the two main lists . For Bede, Mercia was a traditional enemy of his native Northumbria and he regarded powerful kings such as the pagan Penda as standing in the way of the Christian conversion of the Anglo-Saxons. Bede omits them from his list, even though it is evident that Penda held a considerable degree of power. Similarly powerful Mercia kings such as Offa are missed out of the West Saxon Anglo-Saxon Chronicle, which sought to demonstrate the legitimacy of their kings to rule over other Anglo-Saxon peoples.       ": null
    }
]