[
    {
        "         Bromine is a ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " with symbol Br and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " 35. It is the third-lightest ": null
    },
    {
        "halogen": "Halogen"
    },
    {
        ", and is a fuming red-brown ": null
    },
    {
        "liquid": "Liquid"
    },
    {
        " at room temperature that evaporates readily to form a similarly coloured gas. Its properties are thus intermediate between those of ": null
    },
    {
        "chlorine": "Chlorine"
    },
    {
        " and ": null
    },
    {
        "iodine": "Iodine"
    },
    {
        ". Isolated independently by two chemists, ": null
    },
    {
        "Carl Jacob Löwig": "Carl Jacob Löwig"
    },
    {
        " and ": null
    },
    {
        "Antoine Jérôme Balard": "Antoine Jerome Balard"
    },
    {
        " , its name was derived from the ": null
    },
    {
        "Ancient Greek": "Ancient Greek"
    },
    {
        " βρῶμος , referencing its sharp and disagreeable smell.     Elemental bromine is very reactive and thus does not occur ": null
    },
    {
        "free": "Free Element"
    },
    {
        " in nature, but in colourless soluble crystalline mineral halide ": null
    },
    {
        "salts": "Ionic Salt"
    },
    {
        ", analogous to ": null
    },
    {
        "table salt": "Table Salt"
    },
    {
        ". While it is rather rare in the Earths crust, the high solubility of the bromide ion has caused its accumulation in the oceans. Commercially the element is easily extracted from ": null
    },
    {
        "brine pools": "Brine Pool"
    },
    {
        ", mostly in the United States, Israel and China. The mass of bromine in the oceans is about one three-hundredth that of chlorine.     At high temperatures, ": null
    },
    {
        "organobromine compounds": "Organobromine Compound"
    },
    {
        " readily dissociate to yield free bromine atoms, a process that stops ": null
    },
    {
        "free radical": "Free Radical"
    },
    {
        " chemical ": null
    },
    {
        "chain reactions": "Chain Reaction"
    },
    {
        ". This effect makes organobromine compounds useful as ": null
    },
    {
        "fire retardants": "Fire Retardant"
    },
    {
        ", and more than half the bromine produced worldwide each year is put to this purpose. The same property causes ultraviolet ": null
    },
    {
        "sunlight": "Sunlight"
    },
    {
        " to dissociate volatile organobromine compounds in the ": null
    },
    {
        "atmosphere": "Atmosphere"
    },
    {
        " to yield free bromine atoms, causing ": null
    },
    {
        "ozone depletion": "Ozone Depletion"
    },
    {
        ". As a result, many organobromide compounds—such as the ": null
    },
    {
        "pesticide": "Pesticide"
    },
    {
        " methyl bromide": "Bromomethane"
    },
    {
        "—are no longer used. Bromine compounds are still used in ": null
    },
    {
        "well drilling fluids": "Well Drilling Fluids"
    },
    {
        ", in ": null
    },
    {
        "photographic film": "Photographic Film"
    },
    {
        ", and as an intermediate in the manufacture of ": null
    },
    {
        "organic": "Organic Compound"
    },
    {
        " chemicals.     Large amounts of bromide salts are toxic from the action of soluble bromide ion, causing ": null
    },
    {
        "bromism": "Bromism"
    },
    {
        ". However, a clear biological role for bromide ion and hypobromous acid has recently been elucidated, and it now appears that bromine is an essential trace element in humans. The role of biological organobromine compounds in sea life such as algae has been known for much longer. As a ": null
    },
    {
        "pharmaceutical": "Pharmaceutical"
    },
    {
        ", the simple bromide ion has inhibitory effects on the central nervous system, and bromide ": null
    },
    {
        "salts": "Salt"
    },
    {
        " were once a major medical sedative, before replacement by shorter-acting drugs. They retain niche uses as ": null
    },
    {
        "antiepileptics": "Antiepileptic"
    },
    {
        ".          Bromine was discovered independently by two chemists, ": null
    },
    {
        "Carl Jacob Löwig": "Carl Jacob Löwig"
    },
    {
        " and ": null
    },
    {
        "Antoine Balard": "Antoine Jérôme Balard"
    },
    {
        ", in 1825 and 1826, respectively.      Löwig isolated bromine from a mineral water spring from his hometown ": null
    },
    {
        "Bad Kreuznach": "Bad Kreuznach"
    },
    {
        " in 1825. Löwig used a solution of the mineral salt saturated with chlorine and extracted the bromine with ": null
    },
    {
        "diethyl ether": "Diethyl Ether"
    },
    {
        ". After evaporation of the ether a brown liquid remained. With this liquid as a sample of his work he applied for a position in the laboratory of ": null
    },
    {
        "Leopold Gmelin": "Leopold Gmelin"
    },
    {
        " in ": null
    },
    {
        "Heidelberg": "Heidelberg"
    },
    {
        ". The publication of the results was delayed and Balard published his results first.     Balard found bromine chemicals in the ash of ": null
    },
    {
        "seaweed": "Seaweed"
    },
    {
        " from the ": null
    },
    {
        "salt marsh": "Salt Marsh"
    },
    {
        "es of ": null
    },
    {
        "Montpellier": "Montpellier"
    },
    {
        ". The seaweed was used to produce iodine, but also contained bromine. Balard distilled the bromine from a solution of seaweed ash saturated with chlorine. The properties of the resulting substance were intermediate between those of chlorine and iodine; thus he tried to prove that the substance was ": null
    },
    {
        "iodine monochloride": "Iodine Monochloride"
    },
    {
        " , but after failing to do so he was sure that he had found a new element, and named it muride, derived from the ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " word muria for brine.     After the French chemists ": null
    },
    {
        "Louis Nicolas Vauquelin": "Louis Nicolas Vauquelin"
    },
    {
        ", ": null
    },
    {
        "Louis Jacques Thénard": "Louis Jacques Thénard"
    },
    {
        ", and ": null
    },
    {
        "Joseph-Louis Gay-Lussac": "Joseph-Louis Gay-Lussac"
    },
    {
        " approved the experiments of the young pharmacist Balard, the results were presented at a lecture of the ": null
    },
    {
        "Académie des Sciences": "Académie Des Sciences"
    },
    {
        " and published in Annales de Chimie et Physique. In his publication, Balard states that he changed the name from muride to brôme on the proposal of M. Anglada. Brôme derives from the Greek βρωμος . Other sources claim that the French chemist and physicist ": null
    },
    {
        "Joseph-Louis Gay-Lussac": "Joseph-Louis Gay-Lussac"
    },
    {
        " suggested the name brôme for the characteristic smell of the vapors. Bromine was not produced in large quantities until 1858, when the discovery of salt deposits in ": null
    },
    {
        "Stassfurt": "Stassfurt"
    },
    {
        " enabled its production as a by-product of potash. Greenwood and Earnshaw, p. 790        Apart from some minor medical applications, the first commercial use was the ": null
    },
    {
        "daguerreotype": "Daguerreotype"
    },
    {
        ". In 1840, bromine was discovered to have some advantages over the previously used iodine vapor to create the light sensitive ": null
    },
    {
        "silver halide": "Silver Halide"
    },
    {
        " layer in daguerreotypy.      ": null
    },
    {
        "Potassium bromide": "Potassium Bromide"
    },
    {
        " and ": null
    },
    {
        "sodium bromide": "Sodium Bromide"
    },
    {
        " were used as ": null
    },
    {
        "anticonvulsants": "Anticonvulsant"
    },
    {
        " and ": null
    },
    {
        "sedatives": "Sedative"
    },
    {
        " in the late 19th and early 20th centuries, but were gradually superseded by ": null
    },
    {
        "chloral hydrate": "Chloral Hydrate"
    },
    {
        " and then by the ": null
    },
    {
        "barbiturates": "Barbiturate"
    },
    {
        ".  In the early years of the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ", bromine compounds such as ": null
    },
    {
        "xylyl bromide": "Xylyl Bromide"
    },
    {
        " were used as ": null
    },
    {
        "poison gas": "Poison Gas"
    },
    {
        ".           Bromine is the third ": null
    },
    {
        "halogen": "Halogen"
    },
    {
        ", being a ": null
    },
    {
        "nonmetal": "Nonmetal"
    },
    {
        " in group 17 of the periodic table. Its properties are thus similar to those of ": null
    },
    {
        "fluorine": "Fluorine"
    },
    {
        ", ": null
    },
    {
        "chlorine": "Chlorine"
    },
    {
        ", and ": null
    },
    {
        "iodine": "Iodine"
    },
    {
        ", and tend to be intermediate between those of the two neighbouring halogens, chlorine and iodine. Bromine has the electron configuration d 10 4s 2 4p 5 , with the seven electrons in the fourth and outermost shell acting as its ": null
    },
    {
        "valence electrons": "Valence Electron"
    },
    {
        ". Like all halogens, it is thus one electron short of a full octet, and is hence a strong oxidising agent, reacting with many elements in order to complete its outer shell. Greenwood and Earnshaw, pp. 800–4 Corresponding to ": null
    },
    {
        "periodic trends": "Periodic Trend"
    },
    {
        ", it is intermediate in ": null
    },
    {
        "electronegativity": "Electronegativity"
    },
    {
        " between chlorine and iodine , and is less reactive than chlorine and more reactive than iodine. It is also a weaker oxidising agent than chlorine, but a stronger one than iodine. Conversely, the ": null
    },
    {
        "bromide": "Bromide"
    },
    {
        " ion is a weaker reducing agent than iodide, but a stronger one than chloride. These similarities led to chlorine, bromine, and iodine together being classified as one of the original triads of ": null
    },
    {
        "Johann Wolfgang Döbereiner": "Johann Wolfgang Döbereiner"
    },
    {
        ", whose work foreshadowed the ": null
    },
    {
        "periodic law": "Periodic Law"
    },
    {
        " for chemical elements.   It is intermediate in ": null
    },
    {
        "atomic radius": "Atomic Radius"
    },
    {
        " between chlorine and iodine, and this leads to many of its atomic properties being similarly intermediate in value between chlorine and iodine, such as first ": null
    },
    {
        "ionisation energy": "Ionisation Energy"
    },
    {
        ", ": null
    },
    {
        "electron affinity": "Electron Affinity"
    },
    {
        ", enthalpy of dissociation of the X 2 molecule , ionic radius, and X–X bond length. The volatility of bromine accentuates its very penetrating, choking, and unpleasant odour. Greenwood and Earnshaw, p. 793–4     All four stable halogens experience intermolecular ": null
    },
    {
        "van der Waals forces": "Van Der Waals Force"
    },
    {
        " of attraction, and their strength increases together with number of electrons among all homonuclear diatomic halogen molecules. Thus, the melting and boiling points of bromine are intermediate between those of chlorine and iodine. As a result of the increasing molecular weight of the halogens down the group, the density and heats of fusion and vaporisation of bromine are again intermediate between those of chlorine and iodine, although all their heats of vaporisation are fairly low thanks to their diatomic molecular structure. The halogens darken in colour as the group is descended: fluorine is a very pale yellow gas, chlorine is greenish-yellow, and bromine is a reddish-brown volatile liquid that melts at −7.2  °C and boils at 58.8  °C. This trend occurs because the wavelengths of visible light absorbed by the halogens increase down the group. Specifically, the colour of a halogen, such as bromine, results from the ": null
    },
    {
        "electron transition": "Atomic Electron Transition"
    },
    {
        " between the ": null
    },
    {
        "highest occupied": "Homo/Lumo"
    },
    {
        " antibonding π g  molecular orbital and the lowest vacant antibonding σ u  molecular orbital. Greenwood and Earnshaw, pp. 804–9 The colour fades at low temperatures, so that solid bromine at −195  °C is pale yellow.     Like solid chlorine and iodine, solid bromine crystallises in the ": null
    },
    {
        "orthorhombic crystal system": "Orthorhombic Crystal System"
    },
    {
        ", in a layered lattice of Br 2 molecules. The Br–Br distance is 227  pm and the Br···Br distance between molecules is 331  pm within a layer and 399  pm between layers . This structure means that bromine is a very poor conductor of electricity, with a conductivity of around 5  ×  10 −13  Ω −1  cm −1 just below the melting point, although this is better than the essentially undetectable conductivity of chlorine.     At a pressure of 55  ": null
    },
    {
        "GPa": "Gpa"
    },
    {
        " bromine undergoes an insulator-to-metal transition. At 75  GPa it changes to a face-centered orthorhombic structure. At 100  GPa it changes to a body centered orthorhombic monatomic form.           Bromine has two stable ": null
    },
    {
        "isotopes": "Isotope"
    },
    {
        ", 79 Br and 81 Br. These are its only two natural isotopes, with 79 Br making up 51% of natural bromine and 81 Br making up the remaining 49%. Both have nuclear spin 3/2− and thus may be used for ": null
    },
    {
        "nuclear magnetic resonance": "Nuclear Magnetic Resonance"
    },
    {
        ", although 81 Br is more favourable. The relatively 1:1 distribution of the two isotopes in nature is helpful in identification of bromine containing compounds using mass spectroscopy. Other bromine isotopes are all radioactive, with ": null
    },
    {
        "half-lives": "Half-Life"
    },
    {
        " too short to occur in nature. Of these, the most important are 80 Br , 80m Br , and 82 Br , which may be produced from the ": null
    },
    {
        "neutron activation": "Neutron Activation"
    },
    {
        " of natural bromine. The most stable bromine radioisotope is 77 Br . The primary decay mode of isotopes lighter than 79 Br is ": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        " to isotopes of ": null
    },
    {
        "Selenium": "Selenium"
    },
    {
        "; that of isotopes heavier than 81 Br is ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        " to isotopes of ": null
    },
    {
        "krypton": "Krypton"
    },
    {
        "; and 80 Br may decay by either mode to stable 80 Se or 80 Kr.           Bromine is intermediate in reactivity between chlorine and iodine, and is one of the most reactive elements. Bond energies to bromine tend to be lower than those to chlorine but higher than those to iodine, and bromine is a weaker oxidising agent than chlorine but a stronger one than iodine. This can be seen from the ": null
    },
    {
        "standard electrode potentials": "Standard Electrode Potential"
    },
    {
        " of the X 2 /X − couples . Bromination often leads to higher oxidation states than iodination but lower or equal oxidation states to chlorination. Bromine tends to react with compounds including M–M, M–H, or M–C bonds to form M–Br bonds.       The simplest compound of bromine is ": null
    },
    {
        "hydrogen bromide": "Hydrogen Bromide"
    },
    {
        ", HBr. It is mainly used in the production of inorganic ": null
    },
    {
        "bromides": "Bromide"
    },
    {
        " and ": null
    },
    {
        "alkyl bromides": "Alkyl Bromide"
    },
    {
        ", and as a catalyst for many reactions in organic chemistry. Industrially, it is mainly produced by the reaction of ": null
    },
    {
        "hydrogen": "Hydrogen"
    },
    {
        " gas with bromine gas at 200–400  °C with a ": null
    },
    {
        "platinum": "Platinum"
    },
    {
        " catalyst. However, reduction of bromine with ": null
    },
    {
        "red phosphorus": "Red Phosphorus"
    },
    {
        " is a more practical way to produce hydrogen bromide in the laboratory: Greenwood and Earnshaw, pp. 809–12   : 2 P + 6 H 2 O + 3 Br 2 → 6 HBr + 2 H 3 PO 3   : H 3 PO 3 + H 2 O + Br 2 → 2 HBr + H 3 PO 4     At room temperature, hydrogen bromide is a colourless gas, like all the hydrogen halides apart from ": null
    },
    {
        "hydrogen fluoride": "Hydrogen Fluoride"
    },
    {
        ", since hydrogen cannot form strong ": null
    },
    {
        "hydrogen bonds": "Hydrogen Bond"
    },
    {
        " to the large and only mildly electronegative bromine atom; however, weak hydrogen bonding is present in solid crystalline hydrogen bromide at low temperatures, similar to the hydrogen fluoride structure, before disorder begins to prevail as the temperature is raised. Aqueous hydrogen bromide is known as ": null
    },
    {
        "hydrobromic acid": "Hydrobromic Acid"
    },
    {
        ", which is a strong acid  because the hydrogen bonds to bromine are too weak to inhibit dissociation. The HBr/H 2 O system also involves many hydrates HBr·nH 2 O for n 1, 2, 3, 4, and 6, which are essentially salts of bromine ": null
    },
    {
        "anions": "Anion"
    },
    {
        " and ": null
    },
    {
        "hydronium": "Hydronium"
    },
    {
        "cations": "Cation"
    },
    {
        ". Hydrobromic acid forms an ": null
    },
    {
        "azeotrope": "Azeotrope"
    },
    {
        " with boiling point 124.3  °C at 47.63  g HBr per 100  g solution; thus hydrobromic acid cannot be concentrated beyond this point by distillation. Greenwood and Earnshaw, pp. 812–6     Unlike hydrogen fluoride, anhydrous liquid hydrogen bromide is difficult to work with as a solvent, because its boiling point is low, it has a small liquid range, its ": null
    },
    {
        "dielectric constant": "Dielectric Constant"
    },
    {
        " is low and it does not dissociate appreciably into H 2 Br + and  ions – the latter, in any case, are much less stable than the ": null
    },
    {
        "bifluoride": "Bifluoride"
    },
    {
        " ions  due to the very weak hydrogen bonding between hydrogen and bromine, though its salts with very large and weakly polarising cations such as ": null
    },
    {
        "Cs + ": "Caesium"
    },
    {
        " and   may still be isolated. Anhydrous hydrogen bromide is a poor solvent, only able to dissolve small molecular compounds such as ": null
    },
    {
        "nitrosyl chloride": "Nitrosyl Chloride"
    },
    {
        " and ": null
    },
    {
        "phenol": "Phenol"
    },
    {
        ", or salts with very low ": null
    },
    {
        "lattice energies": "Lattice Energy"
    },
    {
        " such as tetraalkylammonium halides.          Nearly all elements in the periodic table form binary bromides. The exceptions are decidedly in the minority and stem in each case from one of three causes: extreme inertness and reluctance to participate in chemical reactions ; extreme nuclear instability hampering chemical investigation before decay and transmutation ; and having an electronegativity higher than bromines , so that the resultant binary compounds are formally not bromides but rather oxides, nitrides, fluorides, or chlorides of bromine.  Greenwood and Earnshaw, pp. 821–4     Bromination of metals with Br 2 tends to yield lower oxidation states than chlorination with Cl 2 when a variety of oxidation states is available. Bromides can be made by reaction of an element or its oxide, hydroxide, or carbonate with hydrobromic acid, and then dehydrated by mildly high temperatures combined with either low pressure or anhydrous hydrogen bromide gas. These methods work best when the bromide product is stable to hydrolysis; otherwise, the possibilities include high-temperature oxidative bromination of the element with bromine or hydrogen bromide, high-temperature bromination of a metal oxide or other halide by bromine, a volatile metal bromide, ": null
    },
    {
        "carbon tetrabromide": "Carbon Tetrabromide"
    },
    {
        ", or an organic bromide. For example, ": null
    },
    {
        "niobium oxide": "Niobium Oxide"
    },
    {
        " reacts with carbon tetrabromide at 370  °C to form ": null
    },
    {
        "niobium bromide": "Niobium Bromide"
    },
    {
        ". Another method is halogen exchange in the presence of excess halogenating reagent , for example:   :FeCl 3 + BBr 3 → FeBr 3 + BCl 3   When a lower bromide is wanted, either a higher halide may be reduced using hydrogen or a metal as a reducing agent, or thermal decomposition or ": null
    },
    {
        "disproportionation": "Disproportionation"
    },
    {
        " may be used, as follows:   : 3 WBr 5 + Al  3 WBr 4 + AlBr 3   : EuBr 3 +  H 2 → EuBr 2 + HBr   : 2 TaBr 4  TaBr 3 + TaBr 5     Most of the bromides of the pre-transition metals  are mostly ionic, while nonmetals tend to form covalent molecular bromides, as do metals in high oxidation states from +3 and above. ": null
    },
    {
        "Silver bromide": "Silver Bromide"
    },
    {
        " is very insoluble in water and is thus often used as a qualitative test for bromine.       The halogens form many binary, ": null
    },
    {
        "diamagnetic": "Diamagnetic"
    },
    {
        " interhalogen": "Interhalogen"
    },
    {
        " compounds with stoichiometries XY, XY 3 , XY 5 , and XY 7 , and bromine is no exception. Bromine forms a monofluoride and monochloride, as well as a trifluoride and pentafluoride. Some cationic and anionic derivatives are also characterised, such as , , , , and . Apart from these, some ": null
    },
    {
        "pseudohalides": "Pseudohalogen"
    },
    {
        " are also known, such as ": null
    },
    {
        "cyanogen bromide": "Cyanogen Bromide"
    },
    {
        " , bromine ": null
    },
    {
        "thiocyanate": "Thiocyanate"
    },
    {
        " , and bromine ": null
    },
    {
        "azide": "Azide"
    },
    {
        " . Greenwood and Earnshaw, pp. 824–8     The pale-brown ": null
    },
    {
        "bromine monofluoride": "Bromine Monofluoride"
    },
    {
        " is unstable at room temperature, disproportionating quickly and irreversibly into bromine, bromine trifluoride, and bromine pentafluoride. It thus cannot be obtained pure. It may be synthesised by the direct reaction of the elements, or by the comproportionation of bromine and bromine trifluoride at high temperatures. ": null
    },
    {
        "Bromine monochloride": "Bromine Monochloride"
    },
    {
        " , a red-brown gas, quite readily dissociates reversibly into bromine and chlorine at room temperature and thus also cannot be obtained pure, though it can be made by the reversible direct reaction of its elements in the gas phase or in ": null
    },
    {
        "carbon tetrachloride": "Carbon Tetrachloride"
    },
    {
        ". Bromine monofluoride in ": null
    },
    {
        "ethanol": "Ethanol"
    },
    {
        " readily leads to the monobromination of the ": null
    },
    {
        "aromatic": "Aromaticity"
    },
    {
        " compounds PhX ; this is due to heterolytic fission of the Br–F bond, leading to rapid electrophilic bromination by Br + .     At room temperature, ": null
    },
    {
        "bromine trifluoride": "Bromine Trifluoride"
    },
    {
        " is a straw-coloured liquid. It may be formed by directly fluorinating bromine at room temperature and is purified through distillation. It reacts explosively with water and hydrocarbons, but is a less violent fluorinating reagent than ": null
    },
    {
        "chlorine trifluoride": "Chlorine Trifluoride"
    },
    {
        ". It reacts vigorously with ": null
    },
    {
        "boron": "Boron"
    },
    {
        ", ": null
    },
    {
        "carbon": "Carbon"
    },
    {
        ", ": null
    },
    {
        "silicon": "Silicon"
    },
    {
        ", ": null
    },
    {
        "arsenic": "Arsenic"
    },
    {
        ", ": null
    },
    {
        "antimony": "Antimony"
    },
    {
        ", iodine, and ": null
    },
    {
        "sulfur": "Sulfur"
    },
    {
        " to give fluorides, and also reacts with most metals and their oxides: as such, it is used to oxidise ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        " to ": null
    },
    {
        "uranium hexafluoride": "Uranium Hexafluoride"
    },
    {
        " in the nuclear industry. Refractory oxides tend to be only partially fluorinated, but here the derivatives KBrF 4 and BrF 2 SbF 6 remain reactive. Bromine trifluoride is a useful nonaqueous ionising solvent, since it readily dissociates to form  and  and thus conducts electricity. Greenwood and Earnshaw, pp. 828–31     ": null
    },
    {
        "Bromine pentafluoride": "Bromine Pentafluoride"
    },
    {
        " was first synthesised in 1930. It is produced on a large scale by direct reaction of bromine with excess fluorine at temperatures higher than 150  °C, and on a small scale by the fluorination of ": null
    },
    {
        "potassium bromide": "Potassium Bromide"
    },
    {
        " at 25  °C. It is a very vigorous fluorinating agent, although chlorine trifluoride is still more violent. Bromine pentafluoride explodes on reaction with water and fluorinates silicates at 450  °C. Greenwood and Earnshaw, pp. 832–5       Although dibromine is a strong oxidising agent with a high first ionisation energy, very strong oxidisers such as ": null
    },
    {
        "peroxydisulfuryl fluoride": "Peroxydisulfuryl Fluoride"
    },
    {
        " can oxidise it to form the cherry-red  cation. A few other bromine cations are known, namely the brown  and dark brown . Greenwood and Earnshaw, pp. 842–4 The tribromide anion, , has also been characterised; it is analogous to ": null
    },
    {
        "triiodide": "Triiodide"
    },
    {
        ".          ": null
    },
    {
        "Bromine oxides": "Bromine Oxide"
    },
    {
        " are not as well-characterised as ": null
    },
    {
        "chlorine oxides": "Chlorine Oxide"
    },
    {
        " or ": null
    },
    {
        "iodine oxides": "Iodine Oxide"
    },
    {
        ", as they are all fairly unstable: it was once thought that they could not exist at all. ": null
    },
    {
        "Dibromine monoxide": "Dibromine Monoxide"
    },
    {
        " is a dark-brown solid which, while reasonably stable at −60  °C, decomposes at its melting point of −17.5  °C; it is useful in ": null
    },
    {
        "bromination": "Bromination"
    },
    {
        " reactions    and may be made from the low-temperature decomposition of ": null
    },
    {
        "bromine dioxide": "Bromine Dioxide"
    },
    {
        " in a vacuum. It oxidises iodine to ": null
    },
    {
        "iodine pentoxide": "Iodine Pentoxide"
    },
    {
        " and ": null
    },
    {
        "benzene": "Benzene"
    },
    {
        " to ": null
    },
    {
        "1,4-benzoquinone": "1,4-Benzoquinone"
    },
    {
        "; in alkaline solutions, it gives the ": null
    },
    {
        "hypobromite": "Hypobromite"
    },
    {
        " anion. Greenwood and Earnshaw, pp. 850–1     So-called ": null
    },
    {
        "bromine dioxide": "Bromine Dioxide"
    },
    {
        " , a pale yellow crystalline solid, may be better formulated as bromine ": null
    },
    {
        "perbromate": "Perbromate"
    },
    {
        ", BrOBrO 3 . It is thermally unstable above −40  °C, violently decomposing to its elements at 0  °C. ": null
    },
    {
        "Dibromine trioxide": "Dibromine Trioxide"
    },
    {
        ", syn-BrOBrO 2 , is also known; it is the anhydride of ": null
    },
    {
        "hypobromous acid": "Hypobromous Acid"
    },
    {
        " and ": null
    },
    {
        "bromic acid": "Bromic Acid"
    },
    {
        ". It is an orange crystalline solid which decomposes above −40  °C; if heated too rapidly, it explodes around 0  °C. A few other unstable radical oxides are also known, as are some poorly characterised oxides, such as ": null
    },
    {
        "dibromine pentoxide": "Dibromine Pentoxide"
    },
    {
        ", tribromine octoxide, and bromine trioxide.     The four ": null
    },
    {
        "oxoacids": "Oxoacid"
    },
    {
        ", ": null
    },
    {
        "hypobromous acid": "Hypobromous Acid"
    },
    {
        " , ": null
    },
    {
        "bromous acid": "Bromous Acid"
    },
    {
        " , ": null
    },
    {
        "bromic acid": "Bromic Acid"
    },
    {
        " , and ": null
    },
    {
        "perbromic acid": "Perbromic Acid"
    },
    {
        " , are better studied due to their greater stability, though they are only so in aqueous solution. When bromine dissolves in aqueous solution, the following reactions occur: Greenwood and Earnshaw, pp. 853–9   :     Hypobromous acid is unstable to disproportionation. The ": null
    },
    {
        "hypobromite": "Hypobromite"
    },
    {
        " ions thus formed disproportionate readily to give bromide and bromate:   :     Bromous acids and ": null
    },
    {
        "bromites": "Bromite"
    },
    {
        " are very unstable, although the ": null
    },
    {
        "strontium": "Strontium"
    },
    {
        " and ": null
    },
    {
        "barium": "Barium"
    },
    {
        " bromites are known. Greenwood and Earnshaw, pp. 862–5 More important are the ": null
    },
    {
        "bromates": "Bromate"
    },
    {
        ", which are prepared on a small scale by oxidation of bromide by aqueous ": null
    },
    {
        "hypochlorite": "Hypochlorite"
    },
    {
        ", and are strong oxidising agents. Unlike chlorates, which very slowly disproportionate to chloride and perchlorate, the bromate anion is stable to disproportionation in both acidic and aqueous solutions. Bromic acid is a strong acid. Bromides and bromates may comproportionate to bromine as follows:   : + 5 Br − + 6 H + → 3 Br 2 + 3 H 2 O     There were many failed attempts to obtain perbromates and perbromic acid, leading to some rationalisations as to why they should not exist, until 1968 when the anion was first synthesised from the radioactive ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        " of unstable . Today, perbromates are produced by the oxidation of alkaline bromate solutions by fluorine gas. Excess bromate and fluoride are precipitated as ": null
    },
    {
        "silver bromate": "Silver Bromate"
    },
    {
        " and ": null
    },
    {
        "calcium fluoride": "Calcium Fluoride"
    },
    {
        ", and the perbromic acid solution may be purified. The perbromate ion is fairly inert at room temperature but is thermodynamically extremely oxidising, with extremely strong oxidising agents needed to produce it, such as fluorine or ": null
    },
    {
        "xenon difluoride": "Xenon Difluoride"
    },
    {
        ". The Br–O bond in  is fairly weak, which corresponds to the general reluctance of the 4p elements ": null
    },
    {
        "arsenic": "Arsenic"
    },
    {
        ", ": null
    },
    {
        "selenium": "Selenium"
    },
    {
        ", and bromine to attain their group oxidation state, as they come after the ": null
    },
    {
        "scandide contraction": "Scandide Contraction"
    },
    {
        " characterised by the poor shielding afforded by the radial-nodeless 3d orbitals. Greenwood and Earnshaw, pp. 871–2             Like the other carbon–halogen bonds, the C–Br bond is a common functional group that forms part of core ": null
    },
    {
        "organic chemistry": "Organic Chemistry"
    },
    {
        ". Formally, compounds with this functional group may be considered organic derivatives of the bromide anion. Due to the difference of electronegativity between bromine and carbon , the carbon in a C–Br bond is electron-deficient and thus ": null
    },
    {
        "electrophilic": "Electrophilic"
    },
    {
        ". The reactivity of organobromine compounds resembles but is intermediate between the reactivity of ": null
    },
    {
        "organochlorine": "Organochlorine Compound"
    },
    {
        " and ": null
    },
    {
        "organoiodine compounds": "Organoiodine Compound"
    },
    {
        ". For many applications, organobromides represent a compromise of reactivity and cost.     Organobromides are typically produced by additive or substitutive bromination of other organic precursors. Bromine itself can be used, but due to its toxicity and volatility safer brominating reagents are normally used, such as ": null
    },
    {
        "N-bromosuccinimide": "N-Bromosuccinimide"
    },
    {
        ". The principal reactions for organobromides include ": null
    },
    {
        "dehydrobromination": "Dehydrohalogenation"
    },
    {
        ", ": null
    },
    {
        "Grignard reactions": "Grignard Reaction"
    },
    {
        ", ": null
    },
    {
        "reductive coupling": "Wurtz Reaction"
    },
    {
        ", and ": null
    },
    {
        "nucleophilic substitution": "Nucleophilic Substitution"
    },
    {
        ". Ioffe, David and Kampf, Arieh Bromine, Organic Compounds in Kirk-Othmer Encyclopedia of Chemical Technology. John Wiley & Sons. .     Organobromides are the most common organohalides in nature, even though the concentration of bromide is only 0.3% of that for chloride in sea water, because of the easy oxidation of bromide to the equivalent of Br + , a potent electrophile. The enzyme ": null
    },
    {
        "bromoperoxidase": "Bromoperoxidase"
    },
    {
        " catalyzes this reaction.  The oceans are estimated to release 1–2 million tons of ": null
    },
    {
        "bromoform": "Bromoform"
    },
    {
        " and 56,000 tons of ": null
    },
    {
        "bromomethane": "Bromomethane"
    },
    {
        " annually.        An old qualitative test for the presence of the ": null
    },
    {
        "alkene": "Alkene"
    },
    {
        " functional group is that alkenes turn brown aqueous bromine solutions colourless, forming a ": null
    },
    {
        "bromohydrin": "Halohydrin"
    },
    {
        " with some of the dibromoalkane also produced. The reaction passes through a short-lived strongly electrophilic ": null
    },
    {
        "bromonium": "Halonium Ion"
    },
    {
        " intermediate. This is an example of a ": null
    },
    {
        "halogen addition reaction": "Halogen Addition Reaction"
    },
    {
        ".           Bromine is significantly less abundant in the crust than fluorine or chlorine, comprising only 2.5  ": null
    },
    {
        "parts per million": "Parts Per Million"
    },
    {
        " of the Earths crustal rocks, and then only as bromide salts. It is the forty-sixth most abundant element in Earths crust. It is significantly more abundant in the oceans, resulting from long-term ": null
    },
    {
        "leaching": "Leaching"
    },
    {
        ". There, it makes up 65  parts per million, corresponding to a ratio of about one bromine atom for every 660 chlorine atoms. Salt lakes and brine wells may have higher bromine concentrations: for example, the ": null
    },
    {
        "Dead Sea": "Dead Sea"
    },
    {
        " contains 0.4% bromide ions. Greenwood and Earnshaw, pp. 795–6 It is from these sources that bromine extraction is mostly economically feasible.        The main sources of bromine are in the ": null
    },
    {
        "United States": "United States"
    },
    {
        " and ": null
    },
    {
        "Israel": "Israel"
    },
    {
        ". The element is liberated by halogen exchange, using chlorine gas to oxidise Br − to Br 2 . This is then removed with a blast of steam or air, and is then condensed and purified. Today, bromine is transported in large-capacity metal drums or lead-lined tanks that can hold hundreds of kilograms or even tonnes of bromine. The bromine industry is about one-hundredth the size of the chlorine industry. Laboratory production is unnecessary because bromine is commercially available and has a long shelf life. Greenwood and Earnshaw, pp. 798–9       A wide variety of organobromine compounds are used in ": null
    },
    {
        "industry": "Industry"
    },
    {
        ". Some are prepared from bromine and others are prepared from ": null
    },
    {
        "hydrogen bromide": "Hydrogen Bromide"
    },
    {
        ", which is obtained by burning ": null
    },
    {
        "hydrogen": "Hydrogen"
    },
    {
        " in bromine.             ": null
    },
    {
        "Brominated flame retardants": "Brominated Flame Retardant"
    },
    {
        " represent a commodity of growing importance, and make up the largest commercial use of bromine. When the brominated material burns, the flame retardant produces ": null
    },
    {
        "hydrobromic acid": "Hydrobromic Acid"
    },
    {
        " which interferes in the radical ": null
    },
    {
        "chain reaction": "Chain Reaction"
    },
    {
        " of the ": null
    },
    {
        "oxidation": "Oxidation"
    },
    {
        " reaction of the fire. The mechanism is that the highly reactive hydrogen radicals, oxygen radicals, and hydroxy radicals react with hydrobromic acid to form less reactive bromine radicals . Bromine atoms may also react directly with other radicals to help terminate the free radical chain-reactions that characterise combustion.       To make brominated polymers and plastics, bromine-containing compounds can be incorporated into the polymer during ": null
    },
    {
        "polymerisation": "Polymerisation"
    },
    {
        ". One method is to include a relatively small amount of brominated monomer during the polymerisation process. For example, ": null
    },
    {
        "vinyl bromide": "Vinyl Bromide"
    },
    {
        " can be used in the production of ": null
    },
    {
        "polyethylene": "Polyethylene"
    },
    {
        ", ": null
    },
    {
        "polyvinyl chloride": "Polyvinyl Chloride"
    },
    {
        " or ": null
    },
    {
        "polypropylene": "Polypropylene"
    },
    {
        ". Specific highly brominated molecules can also be added that participate in the polymerisation process For example, ": null
    },
    {
        "tetrabromobisphenol A": "Tetrabromobisphenol A"
    },
    {
        " can be added to ": null
    },
    {
        "polyesters": "Polyester"
    },
    {
        " or epoxy resins, where it becomes part of the polymer. Epoxies used in ": null
    },
    {
        "printed circuit boards": "Printed Circuit Board"
    },
    {
        " are normally made from such flame retardant ": null
    },
    {
        "resins": "Resin"
    },
    {
        ", indicated by the FR in the abbreviation of the products . In some cases the bromine containing compound may be added after polymerisation. For example, ": null
    },
    {
        "decabromodiphenyl ether": "Decabromodiphenyl Ether"
    },
    {
        " can be added to the final polymers.      A number of gaseous or highly volatile brominated ": null
    },
    {
        "halomethane": "Halomethane"
    },
    {
        " compounds are non-toxic and make superior fire suppressant agents by this same mechanism, and are particular effective in enclosed spaces such as submarines, airplanes, and spacecraft. However, they are expensive and their production and use has been greatly curtailed due to their effect as ozone-depleting agents. They are no longer used in routine fire extinguishers, but retain niche uses in aerospace and military automatic fire-suppression applications. They include ": null
    },
    {
        "bromochloromethane": "Bromochloromethane"
    },
    {
        " , ": null
    },
    {
        "bromochlorodifluoromethane": "Bromochlorodifluoromethane"
    },
    {
        " , and ": null
    },
    {
        "bromotrifluoromethane": "Bromotrifluoromethane"
    },
    {
        " . Günter Siegemund, Werner Schwertfeger, Andrew Feiring, Bruce Smart, Fred Behr, Herward Vogel, Blaine McKusick Fluorine Compounds, Organic Ullmanns Encyclopedia of Industrial Chemistry, Wiley-VCH, Weinheim, 2002.           ": null
    },
    {
        "Silver bromide": "Silver Bromide"
    },
    {
        " is used, either alone or in combination with ": null
    },
    {
        "silver chloride": "Silver Chloride"
    },
    {
        " and ": null
    },
    {
        "silver iodide": "Silver Iodide"
    },
    {
        ", as the light sensitive constituent of photographic emulsions.     ": null
    },
    {
        "Ethylene bromide": "1,2-Dibromoethane"
    },
    {
        " was an ": null
    },
    {
        "additive in gasolines": "Gasoline Additive"
    },
    {
        " containing lead anti-": null
    },
    {
        "engine knocking": "Engine Knocking"
    },
    {
        " agents. It scavenges lead by forming volatile lead bromide, which is exhausted from the engine. This application accounted for 77% of the bromine use in 1966 in the US. This application has declined since the 1970s due to environmental regulations .      Poisonous ": null
    },
    {
        "bromomethane": "Bromomethane"
    },
    {
        " was widely used as ": null
    },
    {
        "pesticide": "Pesticide"
    },
    {
        " to ": null
    },
    {
        "fumigate": "Fumigation"
    },
    {
        " soil and to fumigate housing, by the tenting method. Ethylene bromide was similarly used. These volatile organobromine compounds are all now regulated as ": null
    },
    {
        "ozone depletion": "Ozone Depletion"
    },
    {
        " agents. The ": null
    },
    {
        "Montreal Protocol on Substances that Deplete the Ozone Layer": "Montreal Protocol"
    },
    {
        " scheduled the phase out for the ": null
    },
    {
        "ozone depleting": "Ozone Depleting"
    },
    {
        " chemical by 2005, and organobromide pesticides are no longer used . Before the Montreal protocol in 1991 an estimated 35,000 tonnes of the chemical were used to control ": null
    },
    {
        "nematodes": "Nematode"
    },
    {
        ", ": null
    },
    {
        "fungi": "Fungi"
    },
    {
        ", ": null
    },
    {
        "weeds": "Weed"
    },
    {
        " and other soil-borne diseases.       In pharmacology, inorganic ": null
    },
    {
        "bromide": "Bromide"
    },
    {
        " compounds, especially ": null
    },
    {
        "potassium bromide": "Potassium Bromide"
    },
    {
        ", were frequently used as general sedatives in the 19th and early 20th century. Bromides in the form of simple salts are still used as anticonvulsants in both veterinary and human medicine, although the latter use varies from country to country. For example, the U.S. ": null
    },
    {
        "Food and Drug Administration": "Food And Drug Administration"
    },
    {
        " does not approve bromide for the treatment of any disease, and it was removed from over-the-counter sedative products like ": null
    },
    {
        "Bromo-Seltzer": "Bromo-Seltzer"
    },
    {
        ", in 1975.  Commercially available organobromine pharmaceuticals include the vasodilator ": null
    },
    {
        "nicergoline": "Nicergoline"
    },
    {
        ", the sedative ": null
    },
    {
        "brotizolam": "Brotizolam"
    },
    {
        ", the anticancer agent ": null
    },
    {
        "pipobroman": "Pipobroman"
    },
    {
        ", and the antiseptic ": null
    },
    {
        "merbromin": "Merbromin"
    },
    {
        ". Otherwise, organobromine compounds are rarely pharmaceutically useful, in contrast to the situation for ": null
    },
    {
        "organofluorine compounds": "Organofluorine Chemistry"
    },
    {
        ". Several drugs are produced as the bromide salts, but in such cases bromide serves as an innocuous counterion of no biological significance.     Other uses of organobromine compounds include high-density drilling fluids, dyes , and pharmaceuticals. Bromine itself, as well as some of its compounds, are used in water treatment, and is the precursor of a variety of inorganic compounds with an enormous number of applications . ": null
    },
    {
        "Zinc–bromine batteries": "Zinc–Bromine Battery"
    },
    {
        " are hybrid ": null
    },
    {
        "flow batteries": "Flow Battery"
    },
    {
        " used for stationary electrical power backup and storage; from household scale to industrial scale.                A 2014 study suggests that bromine is a necessary cofactor in the biosynthesis of ": null
    },
    {
        "collagen IV": "Collagen Iv"
    },
    {
        ", making the element ": null
    },
    {
        "essential": "Essential Element"
    },
    {
        " to ": null
    },
    {
        "basement membrane": "Basement Membrane"
    },
    {
        " architecture and tissue development in animals.  Nevertheless, no clear deprivation symptoms or syndromes have been documented.  In other biological functions, bromine may be non-essential but still beneficial when it takes the place of chlorine. For example, in the presence of hydrogen peroxide, ": null
    },
    {
        "H 2 O 2 ": "H2O2"
    },
    {
        ", formed by the ": null
    },
    {
        "eosinophil": "Eosinophil"
    },
    {
        ", and either chloride or bromide ions, eosinophil peroxidase provides a potent mechanism by which eosinophils kill multicellular ": null
    },
    {
        "parasites": "Parasitism"
    },
    {
        "  and some ": null
    },
    {
        "bacteria": "Bacteria"
    },
    {
        " . Eosinophil peroxidase is a ": null
    },
    {
        "haloperoxidase": "Haloperoxidase"
    },
    {
        " that preferentially uses bromide over chloride for this purpose, generating ": null
    },
    {
        "hypobromite": "Hypobromite"
    },
    {
        " , although the use of chloride is possible.      Although α-haloesters are generally thought of as highly reactive, and therefore, toxic intermediates in organic synthesis, mammals, including humans, cats, and rats, appear to biosynthesize traces of an α-bromoester, 2-octyl 4-bromo-3-oxobutanoate, which is found in their ": null
    },
    {
        "cerebrospinal fluid": "Cerebrospinal Fluid"
    },
    {
        " and appears to play a yet unclarified role in inducing REM sleep. Neutrophil myeloperoxidase can use H 2 O 2 and Br - to brominate deoxycytidine, which could result in DNA mutations.  Marine organisms are the main source of organobromine compounds, and it is in these organisms that the essentiality of bromine is on much firmer ground. More than 1600 such organobromine compounds were identified by 1999. The most abundant is ": null
    },
    {
        "methyl bromide": "Methyl Bromide"
    },
    {
        " , of which an estimated 56,000 tonnes is produced by marine algae each year.  The essential oil of the Hawaiian alga  Asparagopsis taxiformis  consists of 80% ": null
    },
    {
        "bromoform": "Bromoform"
    },
    {
        ".  Most of such organobromine compounds in the sea are made by the action of a unique algal enzyme, ": null
    },
    {
        "vanadium bromoperoxidase": "Vanadium Bromoperoxidase"
    },
    {
        ".      The bromide anion is not very toxic: a normal daily intake is 2 to 8  milligrams. However, high levels of bromide chronically impair the membrane of neurons, which progressively impairs neuronal transmission, leading to toxicity, known as ": null
    },
    {
        "bromism": "Bromism"
    },
    {
        ". Bromide has an ": null
    },
    {
        "elimination half-life": "Elimination Half-Life"
    },
    {
        " of 9 to 12 days, which can lead to excessive accumulation. Doses of 0.5 to 1  gram per day of bromide can lead to bromism. Historically, the therapeutic dose of bromide is about 3 to 5  grams of bromide, thus explaining why chronic toxicity was once so common. While significant and sometimes serious disturbances occur to neurologic, psychiatric, dermatological, and gastrointestinal functions, death from bromism is rare.  Bromism is caused by a neurotoxic effect on the brain which results in ": null
    },
    {
        "somnolence": "Somnolence"
    },
    {
        ", ": null
    },
    {
        "psychosis": "Psychosis"
    },
    {
        ", ": null
    },
    {
        "seizures": "Seizures"
    },
    {
        " and ": null
    },
    {
        "delirium": "Delirium"
    },
    {
        ".      Elemental bromine is toxic and causes ": null
    },
    {
        "chemical burns": "Chemical Burns"
    },
    {
        " on human flesh. Inhaling bromine gas results in similar irritation of the respiratory tract, causing coughing, choking, and shortness of breath, and death if inhaled in large enough amounts. Chronic exposure may lead to frequent bronchial infections and a general deterioration of health. As a strong oxidising agent, bromine is incompatible with most organic and inorganic compounds.  Caution is required when transporting bromine; it is commonly carried in steel tanks lined with lead, supported by strong metal frames. The ": null
    },
    {
        "Occupational Safety and Health Administration": "Occupational Safety And Health Administration"
    },
    {
        " of the ": null
    },
    {
        "United States": "United States"
    },
    {
        " has set a ": null
    },
    {
        "permissible exposure limit": "Permissible Exposure Limit"
    },
    {
        " for bromine at a time-weighted average of 0.1  ppm. The ": null
    },
    {
        "National Institute for Occupational Safety and Health": "National Institute For Occupational Safety And Health"
    },
    {
        " has set a ": null
    },
    {
        "recommended exposure limit": "Recommended Exposure Limit"
    },
    {
        " of TWA 0.1  ppm and a short-term limit of 0.3  ppm. The exposure to bromine ": null
    },
    {
        "immediately dangerous to life and health": "Immediately Dangerous To Life And Health"
    },
    {
        " is 3  ppm.  Bromine is classified as an ": null
    },
    {
        "extremely hazardous substance": "List Of Extremely Hazardous Substances"
    },
    {
        " in the United States as defined in Section 302 of the U.S. ": null
    },
    {
        "Emergency Planning and Community Right-to-Know Act": "Emergency Planning And Community Right-To-Know Act"
    },
    {
        " , and is subject to strict reporting requirements by facilities which produce, store, or use it in significant quantities. ": null
    }
]