[
    {
        "        Burton Stephen Lancaster was an American actor and producer. Initially known for playing tough guys with a tender streak, he went on to achieve success with more complex and challenging roles over a 45-year career in film and, later, television. He was an ": null
    },
    {
        "Oscar": "Academy Awards"
    },
    {
        " winner and four-time nominee for the ": null
    },
    {
        "Academy Award for Best Actor": "Academy Award For Best Actor"
    },
    {
        ", also winning two ": null
    },
    {
        "BAFTA": "Bafta"
    },
    {
        " Awards and one ": null
    },
    {
        "Golden Globe Award": "Golden Globe Award"
    },
    {
        " for Best Lead Actor.     Lancaster performed as a circus acrobat in the 1930s. After serving in ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", the 32-year-old Lancaster landed a role in a Broadway play and drew the attention of a Hollywood agent. His breakthrough role was the film noir  The Killers  alongside ": null
    },
    {
        "Ava Gardner": "Ava Gardner"
    },
    {
        ". A critical success, it launched both of their careers.     In 1953 Lancaster played the illicit lover of ": null
    },
    {
        "Deborah Kerr": "Deborah Kerr"
    },
    {
        " in the military drama  From Here to Eternity  . A box office smash, it won eight Academy Awards, including Best Picture, and landed a Best Actor nomination for Lancaster. Soon after, he starred in  The Rainmaker  , with ": null
    },
    {
        "Katharine Hepburn": "Katharine Hepburn"
    },
    {
        ", earning a Best Actor Golden Globe nomination, and in  Gunfight at the O.K. Corral  , with frequent co-star Kirk Douglas. During the 1950s his production company ": null
    },
    {
        "Hecht-Hill-Lancaster": "Hecht-Hill-Lancaster"
    },
    {
        " was highly successful, Lancaster acted in films such as:  Trapeze  , a box office smash in which he used his acrobatic skills;  Sweet Smell of Success  , a dark drama today considered a classic;  Run Silent, Run Deep  , a WWII submarine drama with ": null
    },
    {
        "Clark Gable": "Clark Gable"
    },
    {
        "; and  Separate Tables  , a hotel-set drama which received seven Oscar nominations.     In the early 1960s Lancaster starred in a string of critically successful films, each in very disparate roles. Playing a charismatic biblical con-man in  Elmer Gantry  , won him the Academy Award and the Golden Globe for Best Actor. In the all-star, war-crime-trial film,  Judgment at Nuremberg  he played a Nazi war criminal. Playing a bird expert prisoner in the  Birdman of Alcatraz  he earned the BAFTA Award for Best Foreign Actor and his third Oscar nomination. In 1963 Lancaster traveled to Italy to star as an Italian prince in the epic period drama  The Leopard . He then played a US Air Force General who, opposed by a Colonel played by Kirk Douglas, tries to overthrow the President in  Seven Days in May  . Then in 1966 he played an explosives expert in the western  The Professionals .     In 1970, Lancaster starred in the box-office hit, air-disaster drama  Airport . He experienced a career resurgence with the crime-romance  Atlantic City  , winning the BAFTA for Best Actor and landing his fourth Oscar nomination. Starting in the late 1970s he also appeared in television mini-series, including the award-winning ": null
    },
    {
        "Separate but Equal": "Separate But Equal"
    },
    {
        " with ": null
    },
    {
        "Sidney Poitier": "Sidney Poitier"
    },
    {
        ". He continued acting into his late 70s until a stroke in 1990 forced him to retire; four years later he died from a heart attack. His final film role was as ": null
    },
    {
        "Dr. Moonlight Graham": "Moonlight Graham"
    },
    {
        " in the Oscar-nominated  Field of Dreams .     The ": null
    },
    {
        "American Film Institute": "American Film Institute"
    },
    {
        " ranks Lancaster as 19 of the ": null
    },
    {
        "greatest male stars": "Afis 100 Years...100 Stars"
    },
    {
        " of classic Hollywood cinema.    American Film Institute . Retrieved: December 7, 2016.       Burton Stephen Lancaster was born on November 2, 1913, in ": null
    },
    {
        "Manhattan": "Manhattan"
    },
    {
        ", ": null
    },
    {
        "New York": "New York"
    },
    {
        ", at his parents home at 209 East 106th Street, the son of Elizabeth  and mailman James Lancaster. Buford 2008, p. 12. Both of his parents were ": null
    },
    {
        "Protestants": "Protestants"
    },
    {
        " of working-class origin. All four of his grandparents were Scots-Irish immigrants to the United States, from the province of ": null
    },
    {
        "Ulster": "Ulster"
    },
    {
        "; his maternal grandparents were from ": null
    },
    {
        "Belfast": "Belfast"
    },
    {
        " and were descendants of ": null
    },
    {
        "English": "English People"
    },
    {
        " immigrants to Ireland.     Lancaster grew up in ": null
    },
    {
        "East Harlem": "East Harlem"
    },
    {
        " and spent much of his time on the streets. He developed a great interest and skill in gymnastics while attending ": null
    },
    {
        "DeWitt Clinton High School": "Dewitt Clinton High School"
    },
    {
        ", where he was a ": null
    },
    {
        "basketball": "Basketball"
    },
    {
        " star. Before he graduated from DeWitt Clinton, his mother died of a ": null
    },
    {
        "cerebral hemorrhage": "Cerebral Hemorrhage"
    },
    {
        ". Lancaster was accepted by ": null
    },
    {
        "New York University": "New York University"
    },
    {
        " with an athletic scholarship, but subsequently dropped out. Buford 2008, p. 28.          At the age of 9, Lancaster met ": null
    },
    {
        "Nick Cravat": "Nick Cravat"
    },
    {
        " with whom he developed a lifelong partnership. Andreychuk 2005, p. 3. Together they learned to act in local theatre productions and circus arts at ": null
    },
    {
        "Union Settlement": "Union Settlement Association"
    },
    {
        ", one of the citys oldest settlement houses. They formed the acrobat duo Lang and Cravat in the 1930s and soon joined the Kay Brothers circus. However, in 1939, an injury forced Lancaster to give up the profession, with great regret. He then found temporary work, first as a salesman for ": null
    },
    {
        "Marshall Fields": "Marshall Fields"
    },
    {
        " and then as a singing waiter in various restaurants. Andreychuk 2005, p. 6.       With the United States having then entered ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", Lancaster joined the ": null
    },
    {
        "United States Army": "United States Army"
    },
    {
        " in 1942 and performed with the Armys 21st ": null
    },
    {
        "Special Services": "Special Services"
    },
    {
        " Division, one of the military groups organized to follow the troops on the ground and provide ": null
    },
    {
        "USO": "Uso"
    },
    {
        " entertainment to keep up morale. He served with General ": null
    },
    {
        "Mark Clarks": "Mark W. Clark"
    },
    {
        " Fifth Army": "United States Army North"
    },
    {
        " in Italy from 1943 to 1945. Andreychuk 2005, p. 7.            Lancaster returned to New York after his Army service. Although initially unenthusiastic about acting, Lancaster was encouraged to audition for a Broadway play by a producer who saw him in an elevator while he was visiting his then-girlfriend at work.  The audition was successful and Lancaster was cast in ": null
    },
    {
        "Harry Browns": "Harry Brown"
    },
    {
        "  A Sound of Hunting  . The show only ran three weeks, but his performance attracted the interest of a Hollywood agent, ": null
    },
    {
        "Harold Hecht": "Harold Hecht"
    },
    {
        ". Lancaster had other offers but Hecht promised him the opportunity to produce their own movies within five years of hitting Hollywood.     Through Hecht, Lancaster was brought to the attention of producer ": null
    },
    {
        "Hal B. Wallis": "Hal B. Wallis"
    },
    {
        ", who signed him to a non-exclusive eight-movie contract.       Lancasters first filmed movie was  Desert Fury  for Wallis, where Lancaster was billed after ": null
    },
    {
        "John Hodiak": "John Hodiak"
    },
    {
        " and ": null
    },
    {
        "Lizabeth Scott": "Lizabeth Scott"
    },
    {
        ". It was directed by ": null
    },
    {
        "Lewis Allen": "Lewis Allen"
    },
    {
        ".       Then producer ": null
    },
    {
        "Mark Hellinger": "Mark Hellinger"
    },
    {
        " approached him to star in  The Killers  , which was completed and released prior to Desert Fury. Directed by ": null
    },
    {
        "Robert Siodmak": "Robert Siodmak"
    },
    {
        " it was a great commercial and critical success    and launched Lancaster and his co-star ": null
    },
    {
        "Ava Gardner": "Ava Gardner"
    },
    {
        " to stardom. It has since come to be regarded as a classic.       Hellinger used Lancaster again on  Brute Force  , a prison drama written by ": null
    },
    {
        "Richard Brooks": "Richard Brooks"
    },
    {
        " and directed by ": null
    },
    {
        "Jules Dassin": "Jules Dassin"
    },
    {
        ". It was also well received. Wallis released his films through Paramount, and so Lancaster and other Wallis contractees made cameos in  Variety Girl  .     Lancasters next film was for Wallis,  I Walk Alone  , a thriller co-starring Scott and a young ": null
    },
    {
        "Kirk Douglas": "Kirk Douglas"
    },
    {
        ", who was also under contract to Wallis.  Variety  listed it as one of the top grossers of the year, taking in more than 2 million dollars.      Lancaster had a change of pace with the film adaptation of ": null
    },
    {
        "Arthur Millers": "Arthur Miller"
    },
    {
        "  All My Sons  , made at Universal with ": null
    },
    {
        "Edward G. Robinson": "Edward G. Robinson"
    },
    {
        ". His third film for Wallis was an adaptation of  Sorry, Wrong Number  with ": null
    },
    {
        "Barbara Stanwyck": "Barbara Stanwyck"
    },
    {
        ".       Hecht kept to his promise to Lancaster to turn producer. The two of them formed a company, Norma Productions, and did a deal with Universal to make a thriller in England,  Kiss the Blood Off My Hands  with ": null
    },
    {
        "Joan Fontaine": "Joan Fontaine"
    },
    {
        " and directed by Norman Foster. It made a profit of only $50,000, but was critically acclaimed.     Back in Hollywood, Lancaster did another film noir with Siodmak,  Criss Cross  . It was originally going to be produced by Hellinger and when Hellinger died another took over. ": null
    },
    {
        "Tony Curtis": "Tony Curtis"
    },
    {
        " made an early appearance.     Lancaster did a fourth for Wallis,  Rope of Sand  .     Norma Productions signed a three-picture deal with Warner Bros. The first was  The Flame and the Arrow  , a swashbuckler movie, in which Lancaster drew on his circus skills. Nick Cravat had a support role and the film was a huge commercial success, making of $6 million. It was Warners most popular film of the year and established an entirely new image for Lancaster. Warner Bros financial information in The William Shaefer Ledger. See Appendix 1, Historical Journal of Film, Radio and Television, 15:sup1, 1-31 p 30      Lancaster was borrowed by ": null
    },
    {
        "20th Century Fox": "20Th Century Fox"
    },
    {
        " for  Mister 880  , a comedy with ": null
    },
    {
        "Edmund Gwenn": "Edmund Gwenn"
    },
    {
        ". MGM put him in a popular Western,  Vengeance Valley  ,  then he went to Warners to play the title role in the biopic  Jim Thorpe – All-American  .       Norma signed a deal with Columbia to make two films through a Norma subsidiary, Halburt. The first film was  Ten Tall Men  where Lancaster was a member of the ": null
    },
    {
        "French Foreign Legion": "French Foreign Legion"
    },
    {
        ". ": null
    },
    {
        "Robert Aldrich": "Robert Aldrich"
    },
    {
        " worked on the movie as a production manager.     The second was a comedy  The First Time  , a comedy which was the directorial debut of ": null
    },
    {
        "Frank Tashlin": "Frank Tashlin"
    },
    {
        ". It was meant to star Lancaster but he wound up not appearing in the film—the first of their productions in which he did not act. FILM ACTORS UNION EXTENDS CONTRACT: Screen Guild Eases Pressure on Producers by Negotiating 6-Month Addition to Pact   By THOMAS F. BRADY Special to THE NEW YORK TIMES 14 Dec 1950: 51.       In 1951 the actor/producer duo changed the companys name to Hecht-Lancaster Productions. The first film under the new name was another swashbuckler:  The Crimson Pirate  , directed by Siodmak. Co-starring Cravat, it was extremely popular.     Lancaster changed pace once more by doing a straight dramatic part in  Come Back, Little Sheba  , based on a Broadway hit, with ": null
    },
    {
        "Shirley Booth": "Shirley Booth"
    },
    {
        ", produced by Wallis and directed by ": null
    },
    {
        "Daniel Mann": "Daniel Mann"
    },
    {
        ".     Alternating with adventure films, he went into  South Sea Woman  at Warners. Part of the Norma-Warners contract was that Lancaster had to appear in some non-Norma films, of which this was one. Burt Breaks Mold When Typed: Burt Balks at Typed Film Roles – Scheuer, Philip K. Los Angeles Times December 14, 1952: D1.     For his own company, Lancaster produced and starred in  His Majesty OKeefe  , a South Sea island tale shot in Fiji. It was co-written by James Hill who would soon become a part of the Hecht-Lancaster partnership. LANCASTER TO STAR IN SHIPWRECK TALE: Norma Productions Buys His Majesty OKeefe for the Actors First 52 Role By THOMAS F. BRADY The New York Times January 1, 1951: 14.       Hecht and Lancaster left Warners for ": null
    },
    {
        "United Artists": "United Artists"
    },
    {
        " for what began as a two-picture deal, the first of which was to be  Apache  , starring Lancaster as a Native American. BURT LANCASTER MAKES U. A. DEAL: Movie Star and His Partner, Harold Hecht, Find a New Outlet for Productions By THOMAS M. PRYOR New York Times June 24, 1953: 30. Looking at Hollywood: Lancaster Gets Indian Role in Bronco Apache Hopper, Hedda. Chicago Daily Tribune2 Dec 1952: a5.     They followed it with another Western,  Vera Cruz  co-starring ": null
    },
    {
        "Gary Cooper": "Gary Cooper"
    },
    {
        " and produced by Hill. Both films were directed by ": null
    },
    {
        "Robert Aldrich": "Robert Aldrich"
    },
    {
        " and were hugely popular.     United Artists signed Hecht-Lancaster to a multi-picture contract, to make seven films over two years. HOLLYWOOD SURPRISE by THOMAS M. PRYOR. The New York Times February 14, 1954: X5. These included films which Lancaster did not act in. Their first was  Marty  , based on ": null
    },
    {
        "Paddy Chayefskys": "Paddy Chayefsky"
    },
    {
        " TV play starring ": null
    },
    {
        "Ernest Borgnine": "Ernest Borgnine"
    },
    {
        " and directed by ": null
    },
    {
        "Delbert Mann": "Delbert Mann"
    },
    {
        ". It won both the ": null
    },
    {
        "Academy Award for Best Picture": "Academy Award For Best Picture"
    },
    {
        " and the ": null
    },
    {
        "Palme dOr": "Palme Dor"
    },
    {
        " award at the ": null
    },
    {
        "Cannes Film Festival": "Cannes Film Festival"
    },
    {
        ". It also earned $2 million on a budget of $350,000. HOLLYWOOD DOSSIER: MARTY HITS JACKPOT – TEAM – ON THE SET By OSCAR GODBOUT HOLLYWOOD.. The New York Times September 11, 1955: X7. Vera Cruz had been a huge success but Marty secured Hecht-Lancaster as one of the most successful independent production companies in Hollywood at the time. Tino Balio, United Artists: The Company That Changed the Film Industry, University of Wisconsin Press, 1987 p. 82 Marty star ": null
    },
    {
        "Ernest Borgnine": "Ernest Borgnine"
    },
    {
        " was under contract to Hecht-Lancaster and was unhappy about his lack of upcoming roles especially after only receiving some seven lines in Sweet Smell of Success and half of his pay for Marty.  He eventually sued for breach of contract to gain back some of this money in 1957.      Without Hill, Hecht and Lancaster produced  The Kentuckian  was directed by Lancaster in his ": null
    },
    {
        "directorial debut": "Directorial Debut"
    },
    {
        ". He also played a lead role. Lancaster disliked directing and only did it once more, in the 1970s. The Top Box-Office Hits of 1955, Variety Weekly, January 25, 1956     Lancaster still had commitments with Wallis, and made  The Rose Tattoo  for him, starring with ": null
    },
    {
        "Anna Magnani": "Anna Magnani"
    },
    {
        " and directed by Daniel Mann. It was very popular at the box office and critically acclaimed, winning Magnani an Oscar. The Top Box-Office Hits of 1956, Variety Weekly, January 2, 1957       In 1955 Hill was made an equal partner in the company and the name was upgraded to ": null
    },
    {
        "Hecht-Hill-Lancaster": "Hecht-Hill-Lancaster"
    },
    {
        ", releasing their first film in 1956,  Trapeze , in which Lancaster performed many of his own stunts. Trapeze, co-starring Tony Curtis and ": null
    },
    {
        "Gina Lollobrigida": "Gina Lollobrigida"
    },
    {
        ", went on to become the production companys top box office success. United Artists expanded its deal with HHL. Pryor, Thomas M. . Hecht-Lancaster Plans New Films: Producing Unit Signs Deal with United Artists—5 Features Are Listed Lancaster to Act . The New York Times, April 13, 1956. p. 20.     In 1956 Lancaster and Hecht entered the music industry with the companies ": null
    },
    {
        "Hecht-Lancaster & Buzzell Music": "Hecht-Lancaster  &  Buzzell Music"
    },
    {
        " and ": null
    },
    {
        "Calyork Music": "Calyork Music"
    },
    {
        ".      The H-H-L team impressed Hollywood with its success; as Life wrote in 1957, ter the independent production of a bakers ": null
    },
    {
        "dozen": "Dozen"
    },
    {
        " of pictures, it has yet to have its first flop ... . Hodgins, Eric.  Life, June 10, 1957, p. 146. Retrieved: April 22, 2012. In late 1957 they announced they would make ten films worth $14 million in 1958. Hecht-Hill-Lancaster Planning Record Year: Group Will Produce $14,000,000 Worth of Motion Pictures in 1958 . Los Angeles Times, December 16, 1957. p. B9.     Lancaster did two films for Wallis, to complete his eight film commitment for that produce:  The Rainmaker  with ": null
    },
    {
        "Katharine Hepburn": "Katharine Hepburn"
    },
    {
        ", which earned Lancaster a Golden Globe nomination for Best Actor; and  Gunfight at the O.K. Corral  with Kirk Douglas, directed by ": null
    },
    {
        "John Sturges": "John Sturges"
    },
    {
        ", which was a huge commercial hit.     Lancaster worked with ": null
    },
    {
        "Tony Curtis": "Tony Curtis"
    },
    {
        " again on  Sweet Smell of Success  , a co-production between Hecht-Hill-Lancaster and Curtis own company Curtleigh Productions . The movie, directed by ": null
    },
    {
        "Alexander Mackendrick": "Alexander Mackendrick"
    },
    {
        ", was a critical success but a commercial disappointment. Over the years it has come to be regarded as one of Lancasters greatest films. Kate Buford, Burt Lancaster: An American Life, Da Capo 2000 p 183     Hecht-Hill-Lancaster produced seven additional films in the late 1950s. Four starred Lancaster:  Run Silent, Run Deep  , a war film with ": null
    },
    {
        "Clark Gable": "Clark Gable"
    },
    {
        ", directed by ": null
    },
    {
        "Robert Wise": "Robert Wise"
    },
    {
        ", which was mildly popular;  Separate Tables  , a hotel-set drama with Kerr and ": null
    },
    {
        "Rita Hayworth": "Rita Hayworth"
    },
    {
        " , based on a play by ": null
    },
    {
        "Terence Rattigan": "Terence Rattigan"
    },
    {
        " which received an Oscar nomination for Best Picture and Oscar awards for lead actor for ": null
    },
    {
        "David Niven": "David Niven"
    },
    {
        " and supporting actress ": null
    },
    {
        "Wendy Hiller": "Wendy Hiller"
    },
    {
        ", and was both a critical and commercial success;  The Devils Disciple  , with Douglas and ": null
    },
    {
        "Laurence Olivier": "Laurence Olivier"
    },
    {
        ", which lost money ; 1959: Probable Domestic Take , Variety, January 6, 1960 p 34 and the western  The Unforgiven  , with ": null
    },
    {
        "Audrey Hepburn": "Audrey Hepburn"
    },
    {
        ", which was a critical and commercial disappointment. pp. 151–152 Larkins, Bob & Magers, Boyd The Films of Audie Murphy McFarland, August 19, 2009     Three were made without Lancaster, all of which lost money:  The Bachelor Party  , from another TV play by Chayefsky, and directed by Delbert Mann;  Take a Giant Step  , about a black student; and  Summer of the Seventeenth Doll  , from an Australian play, shot in Australia and Britain.     Additionally, Hecht-Hill-Lancaster served as the production company for the 1960–61 TV series  Whiplash .     The Hecht-Hill-Lancaster Productions company dissolved in 1960 after Hill ruptured his relationship with both Hecht and Lancaster. Hill went on to produce a single additional film,  The Happy Thieves , in a new production company, Hillworth Productions, co-owned with his wife ": null
    },
    {
        "Rita Hayworth": "Rita Hayworth"
    },
    {
        ".          Lancaster played the title role in  Elmer Gantry  , written and directed by Richard Brooks for United Artists. The film received five Academy Award nominations, including Best Picture and Best Actor. Lancaster won the ": null
    },
    {
        "1960 Academy Award": "33Rd Academy Awards"
    },
    {
        " for Best Actor, a Golden Globe Award, and the ": null
    },
    {
        "New York Film Critics Award": "New York Film Critics Award"
    },
    {
        " for his performance.     Hecht and Lancaster worked together on  The Young Savages  , directed by ": null
    },
    {
        "John Frankenheimer": "John Frankenheimer"
    },
    {
        " and produced by Hecht. ": null
    },
    {
        "Sydney Pollack": "Sydney Pollack"
    },
    {
        " worked as a dialogue coach.     Lancaster starred in  Judgment at Nuremberg  for ": null
    },
    {
        "Stanley Kramer": "Stanley Kramer"
    },
    {
        ", alongside ": null
    },
    {
        "Spencer Tracy": "Spencer Tracy"
    },
    {
        ", ": null
    },
    {
        "Richard Widmark": "Richard Widmark"
    },
    {
        " and a number of other iconic stars. The film was both a commercial and critical success, receiving 11 Oscar nominations, including Best Picture.     He then did another film with Hecht and Frankenheimer ,  Birdman of Alcatraz  , a largely fictionalized biography. In it he plays ": null
    },
    {
        "Robert Stroud": "Robert Stroud"
    },
    {
        ", a federal prisoner incarcerated for life for two murders, who begins to collect birds and over time becomes an expert in bird diseases even publishing a book. The film shows Stroud transferred to the maximum security Alcatraz prison where he is not allowed to keep birds and as he ages he gets married, markets bird remedies, helps stop a prison rebellion, and writes a book on the history of the U.S. penal system, but never gets paroled. The sympathetic performance earned Lancaster a Best Actor Oscar nomination, a BAFTA Award for Best Actor, and a Golden Globe nomination for Best Actor in a Dramatic Role. Hecht went on to produce five films without Lancasters assistance, through his company Harold Hecht Films Productions between 1961 and 1967, including another Academy Award winner,  Cat Ballou , starring ": null
    },
    {
        "Lee Marvin": "Lee Marvin"
    },
    {
        " and ": null
    },
    {
        "Jane Fonda": "Jane Fonda"
    },
    {
        ".       Lancaster made  A Child Is Waiting  with ": null
    },
    {
        "Judy Garland": "Judy Garland"
    },
    {
        ". It was produced by Kramer and directed by ": null
    },
    {
        "John Cassavetes": "John Cassavetes"
    },
    {
        ".      He went to Italy to star in  The Leopard  for ": null
    },
    {
        "Luchino Visconti": "Luchino Visconti"
    },
    {
        ", co-starring ": null
    },
    {
        "Alain Delon": "Alain Delon"
    },
    {
        " and ": null
    },
    {
        "Claudia Cardinale": "Claudia Cardinale"
    },
    {
        ". It was one of Lancasters favourite films and was a big hit in France but failed in the US      He had a small role in  The List of Adrian Messenger  for producer/star Kirk Douglas, and then did two for Frankenheimer:  Seven Days in May  , a political thriller with Douglas, and  The Train  , a World War Two action film .     Lancaster starred in  The Hallelujah Trail  , a comic Western produced and directed by ": null
    },
    {
        "John Sturges": "John Sturges"
    },
    {
        " which failed to recoup its large cost. Glenn Lovell, Escape Artist: The Life and Films of John Sturges, University of Wisconsin Press, 2008 p250     He had a big hit with  The Professionals  , a Western directed by Brooks and co-starring ": null
    },
    {
        "Lee Marvin": "Lee Marvin"
    },
    {
        ".     In 1966 at the age of 52, Lancaster appeared nude in director ": null
    },
    {
        "Frank Perrys": "Frank Perry"
    },
    {
        " film  The Swimmer  , in what the critic ": null
    },
    {
        "Roger Ebert": "Roger Ebert"
    },
    {
        " called his finest performance .  Prior to working on The Swimmer, Lancaster was terrified of the water because he did not know how to swim. In preparation for the film, he took swimming lessons from ": null
    },
    {
        "UCLA": "Ucla"
    },
    {
        " swim coach Bob Horn.  Filming was difficult and clashes between Lancaster and Perry led to ": null
    },
    {
        "Sydney Pollack": "Sydney Pollack"
    },
    {
        " coming in to do some filming. Stafford, Jeff  on ": null
    },
    {
        "TCM.com": "Tcm.Com"
    },
    {
        " The film was not released until 1968, when it proved to be a commercial failure, though Lancaster remained proud of the movie and his performance.          In 1967, Lancaster formed a new partnership with ": null
    },
    {
        "Roland Kibbee": "Roland Kibbee"
    },
    {
        ", who had already worked as a writer on five Lancaster projects; Ten Tall Men, The Crimson Pirate,  Three Sailors and a Girl  , Vera Cruz and The Devils Disciple. Through Norlan Productions, Lancaster and Kibbee produced  The Scalphunters  , directed by Sydney Pollack.     Lancaster followed it with another film from Pollack,  Castle Keep  , which was a big flop. So was  The Gypsy Moths  for Frankenheimer. Big Rental Films of 1969 , Variety, January 7, 1970 p 15       Lancaster had one of the biggest successes of his career with  Airport  , starring alongside ": null
    },
    {
        "Dean Martin": "Dean Martin"
    },
    {
        ", ": null
    },
    {
        "Jean Seberg": "Jean Seberg"
    },
    {
        " and ": null
    },
    {
        "Jacqueline Bisset": "Jacqueline Bisset"
    },
    {
        ". The film received nine Academy Award nominations, including one for Best Picture. It became one of the biggest box-office hits of 1970 and, at that time, reportedly the highest-grossing film in the history of ": null
    },
    {
        "Universal Pictures": "Universal Pictures"
    },
    {
        ".     He went into a series of Westerns:  Lawman  directed by ": null
    },
    {
        "Michael Winner": "Michael Winner"
    },
    {
        ";  Valdez Is Coming  , for Norlan; and  Ulzanas Raid  , directed by Aldrich and produced by himself and Hecht. None were particularly popular but Ulzanas Raid has become a cult film. I CANT GET JIMMY CARTER TO SEE MY MOVIE!   Aldrich, Robert. Film Comment; New York Vol. 13, Iss. 2, : 46-52.     Lancaster did two thrillers:  Scorpio  with Winner and  Executive Action  .     Lancaster returned to directing with  The Midnight Man  , which he also wrote and produced with Kibee.     He made a second film with Visconti,  Conversation Piece  and played the title role in the TV series  Moses the Lawgiver  .     Lancaster was one of many names in  1900  , directed by ": null
    },
    {
        "Bernardo Bertolucci": "Bernardo Bertolucci"
    },
    {
        ", and he had a cameo in  Buffalo Bill and the Indians, or Sitting Bulls History Lesson  for ": null
    },
    {
        "Robert Altman": "Robert Altman"
    },
    {
        ".     He played ": null
    },
    {
        "Shimon Peres": "Shimon Peres"
    },
    {
        " in the TV movie  Victory at Entebbe  and had a support role in  The Cassandra Crossing  . He made a fourth a final film with Aldrich,  Twilights Last Gleaming  and had the title role in  The Island of Dr. Moreau  . A Bittersweet Burt Lancaster, Looking Back-and Forward--at 62: A Bittersweet Burt Lancaster By Kenneth Turan. The Washington Post May 23, 1976: 165.     Lancaster was top-billed in  Go Tell the Spartans  , a ": null
    },
    {
        "Vietnam War": "Vietnam War"
    },
    {
        " film; Lancaster admired the script so much he took a reduced fee and donated money to help the movie be completed. He was in  Zulu Dawn  . Kate Buford, Burt Lancaster        Lancaster began the 1980s with a highly acclaimed performance in  Atlantic City  , directed by ": null
    },
    {
        "Louis Malle": "Louis Malle"
    },
    {
        ". The film received 5 Oscar nominations, including Best Picture and a Best Actor nomination for Lancaster.     He had key roles in  Cattle Annie and Little Britches  ,  The Skin  with Cardinale,  Marco Polo  and  Local Hero  .     By now Lancaster was mostly a character actor in features, as in  The Osterman Weekend  , but he was the lead in the TV movie  Scandal Sheet  .     He was in  Little Treasure  , directed by ": null
    },
    {
        "Alan Sharp": "Alan Sharp"
    },
    {
        " who had written Ulzanas Raid;  On Wings of Eagles  for TV, as ": null
    },
    {
        "Bull Simons": "Bull Simons"
    },
    {
        ";  Barnum  for TV, in the title role;  Tough Guys  with Douglas,  Fathers and Sons: A German Tragedy  for German TV,  Control  in Italy,  Rocket Gibraltar  , and  The Jewellers Shop  .     His first big hit in a while was  Field of Dreams  in which he played a support role as ": null
    },
    {
        "Moonlight Graham": "Moonlight Graham"
    },
    {
        ". He was in the miniseries  The Betrothed  .       Lancasters final performances included TV mini series  The Phantom of the Opera  ;  Voyage of Terror: The Achille Lauro Affair  as ": null
    },
    {
        "Leon Klinghoffer": "Leon Klinghoffer"
    },
    {
        "; and  Separate But Equal  with ": null
    },
    {
        "Sidney Poitier": "Sidney Poitier"
    },
    {
        ".          Lancaster appeared in a total of 17 films produced by his agent ": null
    },
    {
        "Harold Hecht": "Harold Hecht"
    },
    {
        ". Eight of these were co-produced by ": null
    },
    {
        "James Hill": "James Hill"
    },
    {
        ". He also appeared in eight films produced by ": null
    },
    {
        "Hal B. Wallis": "Hal B. Wallis"
    },
    {
        " and two with producer ": null
    },
    {
        "Mark Hellinger": "Mark Hellinger"
    },
    {
        ". Although Lancasters work alongside Kirk Douglas was mostly known as a successful pair of actors, Douglas, in fact, produced four films for the pair, through his production companies Bryna Productions and Joel Productions. Roland Kibbee also produced three Lancaster films. Lancaster was also cast in two ": null
    },
    {
        "Stanley Kramer": "Stanley Kramer"
    },
    {
        " productions.     ": null
    },
    {
        "John Frankenheimer": "John Frankenheimer"
    },
    {
        " directed five films with Lancaster:  The Young Savages  , Birdman of Alcatraz ,  Seven Days in May  ,  The Train  , and  The Gypsy Moths  . He was directed four times by ": null
    },
    {
        "Robert Aldrich": "Robert Aldrich"
    },
    {
        ", three times by ": null
    },
    {
        "Robert Siodmak": "Robert Siodmak"
    },
    {
        " and ": null
    },
    {
        "Sydney Pollack": "Sydney Pollack"
    },
    {
        ", and twice by ": null
    },
    {
        "Byron Haskin": "Byron Haskin"
    },
    {
        ", ": null
    },
    {
        "Daniel Mann": "Daniel Mann"
    },
    {
        ", ": null
    },
    {
        "John Sturges": "John Sturges"
    },
    {
        ", ": null
    },
    {
        "John Huston": "John Huston"
    },
    {
        ", ": null
    },
    {
        "Richard Brooks": "Richard Brooks"
    },
    {
        ", ": null
    },
    {
        "Alexander Mackendrick": "Alexander Mackendrick"
    },
    {
        ", ": null
    },
    {
        "Luchino Visconti": "Luchino Visconti"
    },
    {
        ", and ": null
    },
    {
        "Michael Winner": "Michael Winner"
    },
    {
        ".     ": null
    },
    {
        "Roland Kibbee": "Roland Kibbee"
    },
    {
        " wrote for seven Lancaster films. Lancaster used makeup veteran Robert Schiffer in 20 credited films, hiring Schiffer on nearly all the films he produced.       Lancaster was a vocal supporter of progressive and ": null
    },
    {
        "liberal": "Liberalism"
    },
    {
        " political causes and an opponent of ": null
    },
    {
        "right-wing": "Right-Wing"
    },
    {
        " political movements such as ": null
    },
    {
        "McCarthyism": "Mccarthyism"
    },
    {
        ".  He frequently spoke out in support of racial and other minorities. As a result, he was often a target of FBI investigations.  He was named in ": null
    },
    {
        "Nixons": "Richard Nixon"
    },
    {
        " 1973 Enemies List .      A vocal opponent of the ": null
    },
    {
        "Vietnam War": "Vietnam War"
    },
    {
        ", he helped pay for the successful defense of a soldier accused of ": null
    },
    {
        "fragging": "Fragging"
    },
    {
        " another soldier during that war. Buford 2008, p. 266. In 1968, Lancaster actively supported the presidential candidacy of ": null
    },
    {
        "anti-war": "Anti-War"
    },
    {
        " Senator ": null
    },
    {
        "Eugene McCarthy": "Eugene Mccarthy"
    },
    {
        " of ": null
    },
    {
        "Minnesota": "Minnesota"
    },
    {
        ", and frequently spoke on his behalf during the ": null
    },
    {
        "Democratic": "Democratic Party"
    },
    {
        " primaries.      He campaigned heavily for ": null
    },
    {
        "George McGovern": "George Mcgovern"
    },
    {
        " in the ": null
    },
    {
        "1972 presidential election": "1972 United States Presidential Election"
    },
    {
        ".      In 1985, Lancaster joined the fight against ": null
    },
    {
        "AIDS": "Aids"
    },
    {
        " after fellow movie star, ": null
    },
    {
        "Rock Hudson": "Rock Hudson"
    },
    {
        ", contracted the disease.  Lancaster delivered the bed-ridden ": null
    },
    {
        "Hudsons": "Rock Hudson"
    },
    {
        " last words at the Commitment to Life fundraiser at a time when the stigma surrounding AIDS was at its height. He was the only major male star who attended.      Of his political opinions, frequent co-star ": null
    },
    {
        "Tony Curtis": "Tony Curtis"
    },
    {
        " said: Heres this great big aggressive guy that looks like a ding-dong athlete playing these big tough guys and he has the soul of—who were those first philosophers of equality?—": null
    },
    {
        "Socrates": "Socrates"
    },
    {
        ", ": null
    },
    {
        "Plato": "Plato"
    },
    {
        ". He was a Greek philosopher with a sense that everybody was equal.     Actor and ": null
    },
    {
        "SAG": "Screen Actors Guild"
    },
    {
        "-president ": null
    },
    {
        "Ed Asner": "Ed Asner"
    },
    {
        " said he showed everybody in Hollywood how to be a liberal with balls .       Early in his career, Lancaster reportedly signed a statement release by the ": null
    },
    {
        "National Council of the Arts, Sciences and Professions": "National Council Of The Arts, Sciences And Professions"
    },
    {
        " asking Congress to abolish the ": null
    },
    {
        "House Un-American Activities Committee": "House Un-American Activities Committee"
    },
    {
        " . He was also a member of the short-lived ": null
    },
    {
        "Committee for the First Amendment": "Committee For The First Amendment"
    },
    {
        " formed in support of the ": null
    },
    {
        "Hollywood Ten": "Hollywood Ten"
    },
    {
        ". He was one of 26 movie stars who flew to Washington in October 1947 to protest against the HUAC hearings. The committees Hollywood Fights Back broadcasts on ": null
    },
    {
        "ABC Radio Network": "Abc Radio Network"
    },
    {
        " were two 30-minute programs that took place October 27 and November 2, 1947, during which committee members voiced their opposition to the HUAC hearings.   Many members faced black-listing and backlash due to their involvement in the committee. Lancaster was listed in anti-communist literature as a ": null
    },
    {
        "fellow traveler": "Fellow Traveler"
    },
    {
        ".        He and his second wife, Norma hosted a fundraiser for ": null
    },
    {
        "Martin Luther King Jr.": "Martin Luther King Jr."
    },
    {
        " and the ": null
    },
    {
        "SDLC": "Student Diversity Leadership Conference"
    },
    {
        " ahead of the historic ": null
    },
    {
        "March on Washington": "March On Washington For Jobs And Freedom"
    },
    {
        " in 1963. He attended the ": null
    },
    {
        "March": "March On Washington For Jobs And Freedom"
    },
    {
        " where he was one of the speakers.   He flew in from France for the event where he was shooting ": null
    },
    {
        "The Train": "The Train"
    },
    {
        " and flew back again the next day despite a reported ": null
    },
    {
        "fear of flying": "Fear Of Flying"
    },
    {
        ".         In 1968, Lancaster was elected to serve as chairman of the ": null
    },
    {
        "Roger Baldwin Foundation": "Roger Baldwin Foundation"
    },
    {
        ", a newly formed fund-raising arm of the ": null
    },
    {
        "American Civil Liberties Union of Southern California": "American Civil Liberties Union Of Southern California"
    },
    {
        " His co-chairs were ": null
    },
    {
        "Frank Sinatra": "Frank Sinatra"
    },
    {
        " and ": null
    },
    {
        "Irving L. Lichtenstein": "Irving L. Lichtenstein"
    },
    {
        ". In October 1968, he hosted a party at his home to raise money for the ": null
    },
    {
        "ACLU": "Aclu"
    },
    {
        " to use for the defense of the more than four hundred people at the ": null
    },
    {
        "1968 Democratic National Convention": "1968 Democratic National Convention"
    },
    {
        ". Throughout the years he remained an ardent supporter and a fundraiser for the organization.     While serving as a member of the five-person ACLU Foundation executive committee, he cast the key vote to retain ": null
    },
    {
        "Ramona Ripston": "Ramona Ripston"
    },
    {
        " as executive director of the Southern California affiliate, a position she would build into a powerful advocacy force in Los Angeles politics. Ripston later recalled: There was a feeling that a woman couldnt run the ACLU foundation, nor have access to the books. The vote finally came down to two yes and two no. Who had the deciding vote? Burt. He had a scotch or two and finally he said, I think she should be executive director. I always loved him for that.     When President ": null
    },
    {
        "George H. W. Bush": "George H. W. Bush"
    },
    {
        " derided Democratic candidate ": null
    },
    {
        "Michael Dukakis": "Michael Dukakis"
    },
    {
        " as a “card-carrying member of the ACLU”, Lancaster was one of the supporters featured in the organizations first television advertising campaign stating: Im a card-carrying member of the ACLU and No one agrees with every single thing theyve done. But no one can disagree with the guiding principle—with liberty and justice for all.  He also campaigned for ": null
    },
    {
        "Michael Dukakis": "Michael Dukakis"
    },
    {
        " in the ": null
    },
    {
        "1988 presidential election": "1988 United States Presidential Election"
    },
    {
        ".              Lancaster guarded his private life and attempted to keep it private despite his stardom. He was married three times and had 5 children.       His first marriage was to June Ernst, a trapeze acrobat. Ernst was the daughter of a renowned female aerialist and an accomplished acrobat herself. After they were married he performed with her and her family until their separation in the late 1930s. It is not clear when they divorced. Contemporary reports listed 1940 but subsequent biographers have suggested dates as late as 1946 thus delayed his marriage to his second wife. Buford 2008.       He met Norma Anderson when she substituted for an ill actress in a USO production for the troops in Italy. She had been working as a stenographer. Reportedly, on seeing Lancaster in the crowd on her way to town from the airport, she turned to an officer and asked, Who is that good-looking officer and is he married? The officer set up a blind date between the two for that evening.     Norma Lancaster was active in political causes. An entire room in their Bel Air home was devoted to her major interest, the League of Woman Voters, crammed with printing presses and all the necessary supplies for mass mailings. She was a life-long member of the ": null
    },
    {
        "NAACP": "Naacp"
    },
    {
        ". The couple held a fundraiser for ": null
    },
    {
        "Martin Luther King Jr.": "Martin Luther King Jr."
    },
    {
        " and the ": null
    },
    {
        "SDLC": "Southern Christian Leadership Conference"
    },
    {
        " ahead of the 1963 ": null
    },
    {
        "March on Washington": "March On Washington For Jobs And Freedom"
    },
    {
        ".      All five of his children were with Anderson: ": null
    },
    {
        "Bill": "Bill Lancaster"
    },
    {
        " , James, Susan, Joanna , and Sighle . However, it was a troubled marriage. The pair separated in 1966 and finally divorced in 1969.       In 1966, Lancaster began what would be a long-term relationship with the recent widowed Jackie Bone who was the hairdresser for ": null
    },
    {
        "The Professionals": "The Professionals"
    },
    {
        ". It was a tumultuous relationship with Bone once smashing a wine bottle over his head at a dinner with ": null
    },
    {
        "Sidney Pollack": "Sidney Pollack"
    },
    {
        " and ": null
    },
    {
        "Peter Falk": "Peter Falk"
    },
    {
        ". Reportedly they eventually split up after her religious conversion, which Lancaster felt he couldnt share with her.       His third marriage, to Susan Martin, lasted from September 1990 until his death in 1994.       Friends say he claimed he was romantically involved with ": null
    },
    {
        "Deborah Kerr": "Deborah Kerr"
    },
    {
        " during the filming of From Here to Eternity in 1953. Buford 2008, pp. 127–30. However, Kerr stated that while there was a spark of attraction, nothing ever happened. The pair were in two other films together: ": null
    },
    {
        "Separate Tables": "Separate Tables"
    },
    {
        " and  The Gypsy Moths .     He reportedly had an affair with ": null
    },
    {
        "Joan Blondell": "Joan Blondell"
    },
    {
        ".      In her 1980 autobiography, ": null
    },
    {
        "Shelley Winters": "Shelley Winters"
    },
    {
        " claimed to have had a 2-year affair with him during which he was considering separation from his wife. In his Hollywood memoirs, friend ": null
    },
    {
        "Farley Granger": "Farley Granger"
    },
    {
        " recalled an incident when he and Lancaster had to come to Winters rescue one evening when she had inadvertently overdosed on too much alcohol and sleeping pills.  She broke up with him for cheating on her with his wife after she heard reports of his wifes third or fourth pregnancy. Winters 1980, p. 259. Lancaster and Winters performed together in the 1949 radio play adaptation of ": null
    },
    {
        "The Killers": "The Killers"
    },
    {
        ". They appeared in 2 films together:  The Young Savages , where she played his characters former lover and  The Scalphunters .     Recent biographers and others suggest that Lancaster was ": null
    },
    {
        "bisexual": "Bisexual"
    },
    {
        ", and that he had intimate relationships with men as well as women.  According to testimony in Kate Bufords Burt Lancaster: An American Life, Lancaster was devotedly loyal to his friends and family. Old friends from his childhood remained his friends for life.        The ": null
    },
    {
        "centennial": "Centennial"
    },
    {
        " of Lancasters birth was honored at New York Citys ": null
    },
    {
        "Film Society of Lincoln Center": "Film Society Of Lincoln Center"
    },
    {
        " in May 2013 with the screening of 12 of the actors best-known films, from The Killers to Atlantic City.      Lancaster has a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "Hollywood Walk Of Fame"
    },
    {
        " at 6801 Hollywood Boulevard.       Despite his ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        " background and upbringing, Lancaster identified as an ": null
    },
    {
        "atheist": "Atheist"
    },
    {
        " later in life.        As Lancaster grew older he became increasingly wracked with ": null
    },
    {
        "atherosclerosis": "Atherosclerosis"
    },
    {
        ", and barely survived a routine ": null
    },
    {
        "gall bladder": "Gall Bladder"
    },
    {
        " operation in January 1980. Following two minor ": null
    },
    {
        "heart attacks": "Heart Attacks"
    },
    {
        ", he had to undergo an emergency quadruple ": null
    },
    {
        "coronary bypass": "Coronary Bypass"
    },
    {
        " in 1983, after which he was extremely weak. However, he still managed to continue acting. In 1988, Lancaster was well enough to attend a Congressional hearing in Washington, D.C. with old colleagues such as ": null
    },
    {
        "James Stewart": "James Stewart"
    },
    {
        " and ": null
    },
    {
        "Ginger Rogers": "Ginger Rogers"
    },
    {
        " to protest against media magnate ": null
    },
    {
        "Ted Turners": "Ted Turner"
    },
    {
        " plan to ": null
    },
    {
        "colorize": "Colorize"
    },
    {
        " various black-and-white films from the 1930s and 1940s. Lancasters acting career ended after he suffered a ": null
    },
    {
        "stroke": "Stroke"
    },
    {
        " on November 30, 1990, which left him partially ": null
    },
    {
        "paralyzed": "Paralyzed"
    },
    {
        " and largely unable to speak.          Lancaster died at his apartment in ": null
    },
    {
        "Century City, California": "Century City, Los Angeles"
    },
    {
        ", after suffering a third heart attack at 4:50 am on October 20, 1994, at the age of 80.  His body was cremated, and his ashes were scattered under a large oak tree in ": null
    },
    {
        "Westwood Memorial Park": "Westwood Memorial Park"
    },
    {
        " which is located in ": null
    },
    {
        "Westwood Village": "Westwood Village"
    },
    {
        ", California. A small, square ground plaque amidst several others, only inscribed with BURT LANCASTER 1913–1994 , marks the location. Upon his death, as he had previously requested, no memorial or funeral service was held for him.                       For a number of years exhibitors voted Lancaster as among the most popular stars:   1950 – 16th   1951 – 25th   1952 – 24th   1953 – 17th   1954 – 13th , 7th   1955 – 16th   1956 – 4th , 3rd   1957 – 15th , 3rd   1958 – 20th   1960 – 19th   1961 – 11th   1962 – 10th       Spanish music group ": null
    },
    {
        "Hombres G": "Hombres G"
    },
    {
        " released an album named  La cagaste, Burt Lancaster   in 1986.     ": null
    },
    {
        "Thomas Hart Benton": "Thomas Hart Benton"
    },
    {
        " painted a scene from The Kentuckian as part of the films marketing. Lancaster posed for the painting, also known as  The Kentuckian . ": null
    }
]