[
    {
        "                    Béla Viktor János Bartók  was a ": null
    },
    {
        "Hungarian": "Hungarians"
    },
    {
        " composer, pianist, and ": null
    },
    {
        "ethnomusicologist": "Ethnomusicologist"
    },
    {
        ". He is considered one of the most important composers of the 20th century; he and ": null
    },
    {
        "Franz Liszt": "Franz Liszt"
    },
    {
        " are regarded as Hungarys greatest composers . Through his collection and analytical study of ": null
    },
    {
        "folk music": "Folk Music"
    },
    {
        ", he was one of the founders of comparative musicology, which later became ethnomusicology.            Bartók was born in the ": null
    },
    {
        "Banat": "Banat"
    },
    {
        "ian town of Nagyszentmiklós in the ": null
    },
    {
        "Kingdom of Hungary": "Kingdom Of Hungary"
    },
    {
        "  on 25 March 1881.     Bartók had a diverse ancestry. On his fathers side, the Bartók family was a Hungarian lower noble family, originating from ": null
    },
    {
        "Borsodszirák": "Borsodszirák"
    },
    {
        ", ": null
    },
    {
        "Borsod": "Borsod County"
    },
    {
        " . His paternal grandmother was a ": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        " of ": null
    },
    {
        "Bunjevci": "Bunjevci"
    },
    {
        " origin, but considered herself Hungarian . Bartóks father was also named Béla; his mother, Paula , had ethnic German roots, and spoke ": null
    },
    {
        "Hungarian": "Hungarian Language"
    },
    {
        " fluently . She was a native of Turócszentmárton . Paula also had Hungarian and Slavic ancestors.     Béla displayed notable musical talent very early in life: according to his mother, he could distinguish between different dance ": null
    },
    {
        "rhythms": "Rhythm"
    },
    {
        "that she played on the ": null
    },
    {
        "piano": "Piano"
    },
    {
        " before he learned to speak in complete sentences . By the age of four he was able to play 40 pieces on the piano and his mother began formally teaching him the next year.     Béla was a sickly child and suffered from severe ": null
    },
    {
        "eczema": "Eczema"
    },
    {
        " until the age of five , as a result of an inoculation with a faulty ": null
    },
    {
        "smallpox vaccine": "Smallpox Vaccine"
    },
    {
        ", with his facial disfigurement causing him to avoid people . In 1888, when he was seven, his father died suddenly. His mother then took him and his sister, Erzsébet, to live in Nagyszőlős  and then to Pozsony .     He gave his first public recital aged 11 in Nagyszőlős, to a warm critical reception . Among the pieces he played was his own first composition, written two years previously: a short piece called The Course of the Danube . Shortly thereafter László Erkel accepted him as a pupil .            From 1899 to 1903, Bartók studied piano under ": null
    },
    {
        "István Thomán": "István Thomán"
    },
    {
        ", a former student of ": null
    },
    {
        "Franz Liszt": "Franz Liszt"
    },
    {
        ", and composition under ": null
    },
    {
        "János Koessler": "János Koessler"
    },
    {
        " at the ": null
    },
    {
        "Royal Academy of Music in Budapest": "Royal Academy Of Music In Budapest"
    },
    {
        " . There he met ": null
    },
    {
        "Zoltán Kodály": "Zoltán Kodály"
    },
    {
        ", who made a strong impression on him and became a lifelong friend and colleague . In 1903, Bartók wrote his first major orchestral work, Kossuth, a ": null
    },
    {
        "symphonic poem": "Symphonic Poem"
    },
    {
        " which honored ": null
    },
    {
        "Lajos Kossuth": "Lajos Kossuth"
    },
    {
        ", hero of the ": null
    },
    {
        "Hungarian Revolution of 1848": "Hungarian Revolution Of 1848"
    },
    {
        " .     The music of ": null
    },
    {
        "Richard Strauss": "Richard Strauss"
    },
    {
        ", whom he met in 1902 at the ": null
    },
    {
        "Budapest": "Budapest"
    },
    {
        " premiere of  Also sprach Zarathustra , strongly influenced his early work . When visiting a holiday resort in the summer of 1904, Bartók overheard a young nanny, Lidi Dósa from ": null
    },
    {
        "Kibéd": "Kibéd"
    },
    {
        " in Transylvania, sing folk songs to the children in her care. This sparked his lifelong dedication to folk music .     From 1907, he also began to be influenced by the French composer ": null
    },
    {
        "Claude Debussy": "Claude Debussy"
    },
    {
        ", whose compositions Kodály had brought back from ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ". Bartóks large-scale orchestral works were still in the style of ": null
    },
    {
        "Johannes Brahms": "Johannes Brahms"
    },
    {
        " and Richard Strauss, but he wrote a number of small piano pieces which showed his growing interest in ": null
    },
    {
        "folk music": "Folk Music"
    },
    {
        ". The first piece to show clear signs of this new interest is the ": null
    },
    {
        "String Quartet No. 1": "String Quartet No. 1"
    },
    {
        " in A minor , which contains folk-like elements .     In 1907, Bartók began teaching as a piano professor at the ": null
    },
    {
        "Royal Academy": "Royal Academy"
    },
    {
        " . This position freed him from touring Europe as a pianist and enabled him to work in Hungary. Among his notable students were ": null
    },
    {
        "Fritz Reiner": "Fritz Reiner"
    },
    {
        ", ": null
    },
    {
        "Sir Georg Solti": "Sir Georg Solti"
    },
    {
        ", ": null
    },
    {
        "György Sándor": "György Sándor"
    },
    {
        ", ": null
    },
    {
        "Ernő Balogh": "Ernő Balogh"
    },
    {
        ", and ": null
    },
    {
        "Lili Kraus": "Lili Kraus"
    },
    {
        ". After Bartók moved to the United States, he taught ": null
    },
    {
        "Jack Beeson": "Jack Beeson"
    },
    {
        " and ": null
    },
    {
        "Violet Archer": "Violet Archer"
    },
    {
        ".     In 1908, he and Kodály traveled into the countryside to collect and research old ": null
    },
    {
        "Magyar": "Hungarian People"
    },
    {
        " folk melodies. Their growing interest in folk music coincided with a contemporary social interest in traditional national culture. They made some surprising discoveries. Magyar folk music had previously been categorised as ": null
    },
    {
        "Gypsy": "Romani People"
    },
    {
        " music. The classic example is Franz Liszts famous  Hungarian Rhapsodies  for piano, which he based on popular art songs performed by ": null
    },
    {
        "Romani": "Romani People"
    },
    {
        " bands of the time. In contrast, Bartók and Kodály discovered that the old Magyar folk melodies were based on ": null
    },
    {
        "pentatonic scale": "Pentatonic Scale"
    },
    {
        "s, similar to those in ": null
    },
    {
        "Asian folk traditions": "Asian Music"
    },
    {
        ", such as those of Central Asia, Anatolia and Siberia.     Bartók and Kodály quickly set about incorporating elements of such Magyar peasant music into their compositions. They both frequently quoted folk song melodies verbatim and wrote pieces derived entirely from authentic songs. An example is his two volumes entitled For Children for solo piano, containing 80 folk tunes to which he wrote accompaniment. Bartóks style in his art music compositions was a synthesis of folk music, classicism, and modernism. His melodic and harmonic sense was profoundly influenced by the folk music of Hungary, Romania, and other nations. He was especially fond of the asymmetrical dance rhythms and pungent harmonies found in ": null
    },
    {
        "Bulgarian music": "Bulgarian Music"
    },
    {
        ". Most of his early compositions offer a blend of nationalist and late Romanticism elements.           In 1909, at the age of 28, Bartók married Márta Ziegler , aged 16. Their son, Béla Bartók III, was born the next year. After nearly 15 years together, Bartók divorced Márta in June 1923. Two months after his divorce, he married ": null
    },
    {
        "Ditta Pásztory": "Ditta Pásztory-Bartók"
    },
    {
        " , a piano student, ten days after proposing to her. She was aged 19, he 42. Their son, Péter, was born in 1924 .       In 1911, Bartók wrote what was to be his only opera,  Bluebeards Castle , dedicated to Márta. He entered it for a prize by the Hungarian Fine Arts Commission, but they rejected his work as not fit for the stage . In 1917 Bartók revised the score for the 1918 première, and rewrote the ending. Following the ": null
    },
    {
        "1919 revolution": "Hungarian Soviet Republic"
    },
    {
        " in which he actively participated, he was pressured by the ": null
    },
    {
        "Horthy regime": "Horthys Hungary"
    },
    {
        " to remove the name of the librettist ": null
    },
    {
        "Béla Balázs": "Béla Balázs"
    },
    {
        " from the opera  , as he was blacklisted and had left the country for Vienna. Bluebeards Castle received only one revival, in 1936, before Bartók emigrated. For the remainder of his life, although he was passionately devoted to Hungary, its people and its culture, he never felt much loyalty to the government or its official establishments.            After his disappointment over the Fine Arts Commission competition, Bartók wrote little for two or three years, preferring to concentrate on collecting and arranging folk music. He collected first in the ": null
    },
    {
        "Carpathian Basin": "Carpathian Basin"
    },
    {
        " , where he notated ": null
    },
    {
        "Hungarian": "Hungarian Folk Music"
    },
    {
        ", ": null
    },
    {
        "Slovak": "Music Of Slovakia"
    },
    {
        ", ": null
    },
    {
        "Romanian": "Music Of Romania"
    },
    {
        ", and ": null
    },
    {
        "Bulgarian": "Music Of Bulgaria"
    },
    {
        " folk music. He also collected in ": null
    },
    {
        "Moldavia": "Moldavia"
    },
    {
        ", ": null
    },
    {
        "Wallachia": "Wallachia"
    },
    {
        ", and ": null
    },
    {
        "Algeria": "Algeria"
    },
    {
        ". The outbreak of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " forced him to stop the expeditions, but he returned to composing with a ": null
    },
    {
        "ballet": "Ballet"
    },
    {
        " called  The Wooden Prince  and the ": null
    },
    {
        "String Quartet No. 2": "String Quartet No. 2"
    },
    {
        " in , both influenced by ": null
    },
    {
        "Debussy": "Debussy"
    },
    {
        ".     Raised as a ": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        ", by his early adulthood Bartók had become an ": null
    },
    {
        "atheist": "Atheist"
    },
    {
        ". He later became attracted to ": null
    },
    {
        "Unitarianism": "Unitarianism"
    },
    {
        " and publicly converted to the ": null
    },
    {
        "Unitarian": "Unitarianism"
    },
    {
        " faith in 1916. Although Bartók was not conventionally religious, according to his son Béla Bartók III, he was a nature lover: he always mentioned the miraculous order of nature with great reverence. As an adult, Béla III later became lay president of the Hungarian Unitarian Church .     Bartóks  libretto  for  The Miraculous Mandarin , another ballet, was influenced by ": null
    },
    {
        "Igor Stravinsky": "Igor Stravinsky"
    },
    {
        ", ": null
    },
    {
        "Arnold Schoenberg": "Arnold Schoenberg"
    },
    {
        " and Richard Strauss. Though started in 1918 the story of prostitution, robbery, and murder was not performed on the stage until 1926 because of its sexual content. He next wrote his two ": null
    },
    {
        "violin sonatas": "Violin Sonata"
    },
    {
        ", which are harmonically and structurally some of his most complex pieces.     In 1927–28, Bartók wrote his ": null
    },
    {
        "Third": "String Quartet No. 3"
    },
    {
        " and ": null
    },
    {
        "Fourth String Quartets": "String Quartet No. 4"
    },
    {
        ", after which his compositions demonstrated his mature style. Notable examples of this period are  Music for Strings, Percussion and Celesta  and ": null
    },
    {
        "Divertimento for String Orchestra": "Divertimento For String Orchestra"
    },
    {
        " . The ": null
    },
    {
        "Fifth String Quartet": "String Quartet No. 5"
    },
    {
        " was composed in 1934, and the ": null
    },
    {
        "Sixth String Quartet": "String Quartet No. 6"
    },
    {
        " in 1939.     In 1936 he travelled to ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        " to collect and study ": null
    },
    {
        "Turkish folk music": "Turkish Folk Music"
    },
    {
        ". He worked in collaboration with Turkish composer ": null
    },
    {
        "Ahmet Adnan Saygun": "Ahmet Adnan Saygun"
    },
    {
        " mostly around ": null
    },
    {
        "Adana": "Adana"
    },
    {
        " .       In 1940, as the European political situation worsened after the outbreak of ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", Bartók was increasingly tempted to flee Hungary. He strongly opposed the ": null
    },
    {
        "Nazis": "Nazis"
    },
    {
        " and Hungarys alliance with Germany and the ": null
    },
    {
        "Axis powers": "Axis Powers"
    },
    {
        " under the ": null
    },
    {
        "Tripartite Pact": "Tripartite Pact"
    },
    {
        ". After the Nazis came to power in the early 1930s, Bartók refused to give concerts in Germany and broke away from his publisher there. His anti-fascist political views caused him a great deal of trouble with the establishment in Hungary. Having first sent his manuscripts out of the country, Bartók reluctantly emigrated to the U.S. with his wife ": null
    },
    {
        "Ditta": "Ditta Pásztory-Bartók"
    },
    {
        " in October that year. They settled in New York City after arriving on the night of 29–30 October 1940 via a steamer from Lisbon. After joining them in 1942, their younger son, Péter Bartók, enlisted in the ": null
    },
    {
        "United States Navy": "United States Navy"
    },
    {
        " where he served in the Pacific during the remainder of the war and later settled in Florida where he became a recording and sound engineer. His elder son, by his first marriage, Béla Bartók III, remained in Hungary and later worked as a railroad official until his retirement in the early 1980s.     Although he became an American citizen in 1945, shortly before his death , Bartók never felt fully at home in the USA. He initially found it difficult to compose. Although he was well known in America as a pianist, ethnomusicologist and teacher, he was not well known as a composer. There was little American interest in his music during his final years. He and his wife Ditta gave some concerts, although demand for them was low. Bartók, who had made some recordings in Hungary, also recorded for ": null
    },
    {
        "Columbia Records": "Columbia Records"
    },
    {
        " after he came to the US; many of these recordings were later issued on LP and CD .     Supported by a research fellowship from ": null
    },
    {
        "Columbia University": "Columbia University"
    },
    {
        ", for several years, Bartók and Ditta worked on a large collection of ": null
    },
    {
        "Serbian": "Serbian Language"
    },
    {
        " and ": null
    },
    {
        "Croatian": "Croatian Language"
    },
    {
        " folk songs in Columbias libraries. Bartóks economic difficulties during his first years in America were mitigated by publication royalties, teaching and performance tours. While his finances were always precarious, he did not live and die in poverty as was the common myth. He had enough friends and supporters to ensure that there was sufficient money and work available for him to live on. Bartók was a proud man and did not easily accept charity. Despite being short on cash at times, he often refused money that his friends offered him out of their own pockets. Although he was not a member of the ": null
    },
    {
        "ASCAP": "Ascap"
    },
    {
        ", the society paid for any medical care he needed during his last two years. Bartók reluctantly accepted this .     The first symptoms of his health problems began late in 1940, when his right shoulder began to show signs of stiffening. In 1942, symptoms increased and he started having bouts of fever, but no underlying disease was diagnosed, in spite of medical examinations. Finally, in April 1944, ": null
    },
    {
        "leukemia": "Leukemia"
    },
    {
        " was diagnosed, but by this time, little could be done .     As his body slowly failed, Bartók found more creative energy, and he produced a final set of masterpieces, partly thanks to the violinist ": null
    },
    {
        "Joseph Szigeti": "Joseph Szigeti"
    },
    {
        " and the conductor ": null
    },
    {
        "Fritz Reiner": "Fritz Reiner"
    },
    {
        " . Bartóks last work might well have been the String Quartet No. 6 but for ": null
    },
    {
        "Serge Koussevitzkys": "Serge Koussevitzky"
    },
    {
        " commission": "Commission"
    },
    {
        " for the ": null
    },
    {
        "Concerto for Orchestra": "Concerto For Orchestra"
    },
    {
        ". Koussevitskys ": null
    },
    {
        "Boston Symphony Orchestra": "Boston Symphony Orchestra"
    },
    {
        " premièred the work in December 1944 to highly positive reviews. The Concerto for Orchestra quickly became Bartóks most popular work, although he did not live to see its full impact. In 1944, he was also commissioned by ": null
    },
    {
        "Yehudi Menuhin": "Yehudi Menuhin"
    },
    {
        " to write a ": null
    },
    {
        "Sonata for Solo Violin": "Sonata For Solo Violin"
    },
    {
        ". In 1945, Bartók composed his ": null
    },
    {
        "Piano Concerto No. 3": "Piano Concerto No. 3"
    },
    {
        ", a graceful and almost neo-classical work, as a surprise 42nd birthday present for Ditta, but he died just over a month before her birthday, with the scoring not quite finished. He had also sketched his ": null
    },
    {
        "Viola Concerto": "Viola Concerto"
    },
    {
        ", but had barely started the scoring at his death, leaving completed only the viola part and sketches of the orchestral part.        Béla Bartók died at age 64 in a hospital in New York City from complications of ": null
    },
    {
        "leukemia": "Leukemia"
    },
    {
        "  on 26 September 1945. His funeral was attended by only ten people. Among them were his wife Ditta, their son Péter, and his pianist friend ": null
    },
    {
        "György Sándor": "György Sándor"
    },
    {
        " .     Bartóks body was initially interred in ": null
    },
    {
        "Ferncliff Cemetery": "Ferncliff Cemetery"
    },
    {
        " in Hartsdale, New York. During the final year of communist Hungary in the late 1980s, the Hungarian government, along with his two sons, Béla III and Péter, requested that his remains be exhumed and transferred back to ": null
    },
    {
        "Budapest": "Budapest"
    },
    {
        " for burial, where Hungary arranged a ": null
    },
    {
        "state funeral": "State Funeral"
    },
    {
        " for him on 7 July 1988. He was reinterred at Budapests ": null
    },
    {
        "Farkasréti Cemetery": "Farkasréti Cemetery"
    },
    {
        ", next to the remains of Ditta, who died in 1982, the year after his centenary .     The two unfinished works were later completed by his pupil ": null
    },
    {
        "Tibor Serly": "Tibor Serly"
    },
    {
        ". György Sándor was the soloist in the first performance of the Third Piano Concerto on February  8, 1946. Ditta Pásztory-Bartók later played and recorded it. The Viola Concerto was revised and published in the 1990s by Bartóks son, Peter ; this version may be closer to what Bartók intended .     Concurrently, Peter Bartók, in association with Argentinian musician ": null
    },
    {
        "Nelson Dellamaggiore": "Nelson Dellamaggiore"
    },
    {
        ", worked to reprint and revise past editions of the Third Piano Concerto .        ": null
    },
    {
        "central train station": "Brussels Central Station"
    },
    {
        " in a public square, Spanjeplein-Place dEspagne    A statue stands outside Malvern Court, London, south of the ": null
    },
    {
        "South Kensington tube station": "South Kensington Tube Station"
    },
    {
        ", and just north of 7 Sydney Place, where he stayed when performing in London. An ": null
    },
    {
        "English Heritage": "English Heritage"
    },
    {
        " blue plaque": "Blue Plaque"
    },
    {
        ", unveiled in 1997, now commemorates Bartók at 7 Sydney Place .   A statue of him was installed in front of the house in which Bartók spent his last eight years in Hungary, at Csalán út 29, in the hills above Budapest. It is now operated as the Béla Bartók Memorial House .   A bust and plaque located at his last residence, in New York City at 309 W. ": null
    },
    {
        "57th Street": "57Th Street"
    },
    {
        ", inscribed: The Great Hungarian Composer / Béla Bartók / / Made His Home In This House / During the Last Year of His Life  ": null
    },
    {
        "Ankara State Conservatory": "Ankara State Conservatory"
    },
    {
        ", Ankara, Turkey, right next to the bust of ": null
    },
    {
        "Ahmet Adnan Saygun": "Ahmet Adnan Saygun"
    },
    {
        ". ": null
    },
    {
        "Seine": "Seine"
    },
    {
        " in the public park at , 26 place de Brazzaville, in Paris, France .   Also to be noted, in the same park, a sculptural transcription of the composers research on tonal harmony, the fountain/sculpture Cristaux designed by ": null
    },
    {
        "Jean-Yves Lechevallier": "Jean-Yves Lechevallier"
    },
    {
        " in 1980.   An expressionist sculpture by Hungarian sculptor ": null
    },
    {
        "András Beck": "András Beck"
    },
    {
        " in , Paris ": null
    },
    {
        "16th arrondissement": "16Th Arrondissement Of Paris"
    },
    {
        ".   A statue of him also stands in the city centre of ": null
    },
    {
        "Târgu Mureș": "Târgu Mureș"
    },
    {
        ", Romania.            Bartóks music reflects two trends that dramatically changed the sound of music in the 20th century: the breakdown of the ": null
    },
    {
        "diatonic": "Diatonic"
    },
    {
        " system of harmony that had served composers for the previous two hundred years ; and the revival of nationalism as a source for musical inspiration, a trend that began with ": null
    },
    {
        "Mikhail Glinka": "Mikhail Glinka"
    },
    {
        " and ": null
    },
    {
        "Antonín Dvořák": "Antonín Dvořák"
    },
    {
        " in the last half of the 19th century . In his search for new forms of tonality, Bartók turned to Hungarian folk music, as well as to other folk music of the ": null
    },
    {
        "Carpathian Basin": "Carpathian Basin"
    },
    {
        " and even of Algeria and Turkey; in so doing he became influential in that stream of modernism which exploited indigenous music and techniques .     One characteristic style of music is his ": null
    },
    {
        "Night music": "Night Music"
    },
    {
        ", which he used mostly in slow movements of multi-movement ensemble or orchestral compositions in his mature period. It is characterised by eerie dissonances providing a backdrop to sounds of nature and lonely melodies . An example is the third movement of his Music for Strings, Percussion and Celesta.     His music can be grouped roughly in accordance with the different periods in his life.       The works of Bartóks youth were written in a classical and early romantic style touched with influences of popular and Gypsy music . Between 1890 and 1894 he wrote 31 piano pieces with corresponding opus numbers. Although most of these were simple dance pieces, in these early works Bartók began to tackle some more advanced forms, as in his ten-part programmatic A Duna folyása , which he played in his first public recital in 1892 .     In Catholic grammar school Bartók took to studying the scores of composers from ": null
    },
    {
        "Bach": "Bach"
    },
    {
        " to ": null
    },
    {
        "Wagner": "Wagner"
    },
    {
        " , his compositions then advancing in style and taking on similarities to ": null
    },
    {
        "Schumann": "Schumann"
    },
    {
        " and ": null
    },
    {
        "Brahms": "Brahms"
    },
    {
        " . Following his matriculation into the Budapest Academy in 1890 he composed very little, though he began to work on exercises in orchestration and familiarized himself thoroughly with the operas of Wagner . In 1902 his creative energies were revitalized by the discovery of the music of Richard Strauss, whose tone poem Also sprach Zarathustra, according to Bartók, stimulated the greatest enthusiasm in me; at last I saw the way that lay before me. Bartók also owned the score to ": null
    },
    {
        "A Heros Life": "Ein Heldenleben"
    },
    {
        ", which he transcribed for the piano and committed to memory .       Under the influence of Strauss, Bartók composed in 1903 Kossuth, a symphonic poem in ten tableaux on the subject of the 1848 Hungarian war of independence, reflecting the composers growing interest in musical nationalism . A year later he renewed his opus numbers with the ": null
    },
    {
        "Rhapsody for Piano and Orchestra": "Rhapsody, Op. 1"
    },
    {
        " serving as Opus 1. Driven by nationalistic fervor and a desire to transcend the influence of prior composers, Bartók began a lifelong devotion to folk music which was sparked by his overhearing nanny Lidi Dósas singing of Transylvanian folk songs at a Hungarian resort in 1904 . Bartók began to collect Magyar peasant melodies, later extending to the folk music of other peoples of the Carpathian Basin . His compositional output would gradually prune away romantic elements in favour of an idiom that embodied folk music as intrinsic and essential to its style. Later in life he would have this to say on the incorporation of folk and art music:     The question is, what are the ways in which peasant music is taken over and becomes transmuted into modern music? We may, for instance, take over a peasant melody unchanged or only slightly varied, write an accompaniment to it and possibly some opening and concluding phrases. This kind of work would show a certain analogy with Bachs treatment of chorales. ... Another method ... is the following: the composer does not make use of a real peasant melody but invents his own imitation of such melodies. There is no true difference between this method and the one described above. ... There is yet a third way ... Neither peasant melodies nor imitations of peasant melodies can be found in his music, but it is pervaded by the atmosphere of peasant music. In this case we may say, he has completely absorbed the idiom of peasant music which has become his musical mother tongue.      Bartók became first acquainted with Debussys music in 1907 and regarded his music highly. In an interview in 1939 Bartók said     Debussys great service to music was to reawaken among all musicians an awareness of harmony and its possibilities. In that, he was just as important as Beethoven, who revealed to us the possibilities of progressive form, or as Bach, who showed us the transcendent significance of counterpoint. Now, what I am always asking myself is this: is it possible to make a synthesis of these three great masters, a living synthesis that will be valid for our time?  Debussys influence is present in the Fourteen Bagatelles . These made ": null
    },
    {
        "Ferruccio Busoni": "Ferruccio Busoni"
    },
    {
        " exclaim At last something truly new! . Until 1911, Bartók composed widely differing works which ranged from adherence to romantic-style, to folk song arrangements and to his modernist opera Bluebeards Castle. The negative reception of his work led him to focus on folk music research after 1911 and abandon composition with the exception of folk music arrangements .       His pessimistic attitude towards composing was lifted by the stormy and inspiring contact with Klára Gombossy in the summer of 1915 . This interesting episode in Bartóks life remained hidden until it was researched by Denijs Dille between 1979 and 1989 . Bartók started composing again, including the Suite for piano opus 14 , and The Miraculous Mandarin and he completed The Wooden Prince .     Bartók felt the result of World War I as a personal tragedy . Many regions he loved were severed from ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        ": ": null
    },
    {
        "Transylvania": "Transylvania"
    },
    {
        ", the ": null
    },
    {
        "Banat": "Banat"
    },
    {
        " where he was born, and ": null
    },
    {
        "Pozsony": "Pozsony"
    },
    {
        " where his mother lived. Additionally, the political relations between Hungary and the other successor states to the ": null
    },
    {
        "Austro-Hungarian empire": "Austro-Hungarian Empire"
    },
    {
        " prohibited his folk music research outside of Hungary . Bartók also wrote the noteworthy  Eight Improvisations on Hungarian Peasant Songs  in 1920, and the sunny  Dance Suite  in 1923, the year of his second marriage.       In 1926, Bartók needed a significant piece for piano and orchestra with which he could tour in Europe and America. In the preparation for writing his ": null
    },
    {
        "First Piano Concerto": "Piano Concerto No. 1"
    },
    {
        ", he wrote his Sonata,  Out of Doors , and Nine Little Pieces, all for solo piano . He increasingly found his own voice in his maturity. The style of his last period—named Synthesis of East and West —is hard to define let alone to put under one term. In his mature period, Bartók wrote relatively few works but most of them are large-scale compositions for large settings. Only his voice works have programmatic titles and his late works often adhere to classical forms.     Among his most important works are all the six ": null
    },
    {
        "string quartets": "List Of String Quartets By Béla Bartók"
    },
    {
        " , the  Cantata Profana        ": null
    }
]