[
    {
        "   Cecil Louis Troughton Smith , known by his pen name Cecil Scott C. S. Forester, was an English novelist known for writing tales of naval warfare, such as the 12-book ": null
    },
    {
        "Horatio Hornblower": "Horatio Hornblower"
    },
    {
        " series depicting a Royal Navy officer during the ": null
    },
    {
        "Napoleonic wars": "Napoleonic Wars"
    },
    {
        ". The Hornblower novels  A Ship of the Line  and  Flying Colours  were jointly awarded the ": null
    },
    {
        "James Tait Black Memorial Prize": "James Tait Black Memorial Prize"
    },
    {
        " for fiction in 1938. His other works include  The African Queen  .          Forester was born in ": null
    },
    {
        "Cairo": "Cairo"
    },
    {
        " and, after a family breakup at an early age, moved with his mother to London where he was educated at ": null
    },
    {
        "Alleyns School": "Alleyns School"
    },
    {
        " and ": null
    },
    {
        "Dulwich College": "Dulwich College"
    },
    {
        ". He began to study medicine at ": null
    },
    {
        "Guys Hospital": "Guys Hospital"
    },
    {
        " but left without completing his degree. Forester wore glasses and was of slender physique; he failed his Army physical and was told that there was no chance that he would be accepted, even though he was of good height and somewhat athletic. He began writing seriously around 1921 using his pen name.       Forester moved to the United States during the Second World War, where he worked for the ": null
    },
    {
        "British Ministry of Information": "Ministry Of Information"
    },
    {
        " and wrote propaganda to encourage the US to join the ": null
    },
    {
        "Allies": "Allies Of World War Ii"
    },
    {
        ". He eventually settled in ": null
    },
    {
        "Berkeley, California": "Berkeley, California"
    },
    {
        ". He met ": null
    },
    {
        "Roald Dahl": "Roald Dahl"
    },
    {
        " in 1942 while living in ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        ", and Forester encouraged him to write about his experiences in the ": null
    },
    {
        "RAF": "Royal Air Force"
    },
    {
        ". Sturrock, Donald . Storyteller: The Life of Roald Dahl. p. 168. Harper Collins. Retrieved 28 October 2012 According to Dahls autobiography Lucky Break, Forester asked him about his experiences as a fighter pilot, and this prompted Dahl to write his first story A Piece of Cake .               Forester wrote many novels, but he is best known for the 12-book ": null
    },
    {
        "Horatio Hornblower": "Horatio Hornblower"
    },
    {
        " series depicting a Royal Navy officer during the ": null
    },
    {
        "Napoleonic Wars": "Napoleonic Wars"
    },
    {
        ". He began the series with Hornblower fairly high in rank in the first novel that he wrote, which was published in 1937. But high demand for more stories led him to fill in Hornblowers life story, and he wrote novels detailing his rise from the rank of midshipman. The last completed novel was published in 1962. Hornblowers fictional feats were based on real events, but Forester wrote the body of the works carefully to avoid entanglements with real world history, so that Hornblower is always off on another mission when a great naval battle occurs during the Napoleonic Wars.     Foresters other novels include  The African Queen  and  The General  ; ": null
    },
    {
        "Peninsular War": "Peninsular War"
    },
    {
        " novels in  Death to the French   and  The Gun  ; and seafaring stories that did not involve Hornblower, such as  Brown on Resolution  ,  The Captain from Connecticut  ,  The Ship  , and  Hunting the Bismarck  , which was used as the basis of the screenplay for the film  Sink the Bismarck!  . Several of his works were filmed, including  The African Queen  , directed by ": null
    },
    {
        "John Huston": "John Huston"
    },
    {
        ". Forester is also credited as story writer for several movies not based on his published fiction, including  Commandos Strike at Dawn  .     He wrote several volumes of short stories set during the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        ". Those in The Nightmare were based on events in ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        ", ending at the ": null
    },
    {
        "Nuremberg trials": "Nuremberg Trials"
    },
    {
        ". Stories in The Man in the Yellow Raft followed the career of the destroyer USS Boon, while many of those in Gold from Crete followed the destroyer HMS Apache. The last of the stories in Gold from Crete was If Hitler had invaded England , which offers an imagined sequence of events starting with ": null
    },
    {
        "Hitlers": "Adolf Hitler"
    },
    {
        "attempt to implement ": null
    },
    {
        "Operation Sea Lion": "Operation Sea Lion"
    },
    {
        ", and culminating in the early military defeat of Nazi Germany in the summer of 1941. His non-fiction seafaring works include The Age of Fighting Sail , an account of the sea battles between Great Britain and the United States in the ": null
    },
    {
        "War of 1812": "War Of 1812"
    },
    {
        ".     Forester also published the crime novels  Payment Deferred  and Plain Murder , as well as two childrens books. Poo-Poo and the Dragons was created as a series of stories told to his son George to encourage him to finish his meals. George had mild food allergies which kept him feeling unwell, and he needed encouragement to eat. Poo-Poo and the DragonsThe Barbary Pirates is a childrens history of early 19th-century pirates.     Forester appeared as a contestant on the television quiz program  You Bet Your Life  hosted by ": null
    },
    {
        "Groucho Marx": "Groucho Marx"
    },
    {
        ", in an episode broadcast on 1 November 1956.  A previously unknown novel of Foresters entitled The Pursued was discovered in 2003 and published by ": null
    },
    {
        "Penguin Classics": "Penguin Classics"
    },
    {
        " on 3 November 2011.         He married Kathleen Belcher in 1926 and they had two sons, John and George Forester. The couple divorced in 1945. In 1947, he married Dorothy Foster.   ": null
    },
    {
        "John Forester": "John Forester"
    },
    {
        " wrote a two-volume biography of his father, including many elements of Foresters life which only became clear to his son after his death.  .        ": null
    },
    {
        "Horatio Hornblower": "Horatio Hornblower"
    },
    {
        " Mr. Midshipman Hornblower . Michael Joseph.   1941 The Hand of Destiny . ": null
    },
    {
        "Colliers": "Colliers"
    },
    {
        "   1950 ": null
    },
    {
        "Hornblower and the Widow McCool": "Hornblower And The Widow Mccool"
    },
    {
        " . ": null
    },
    {
        "The Saturday Evening Post": "The Saturday Evening Post"
    },
    {
        "   1952  Lieutenant Hornblower . Michael Joseph.   1962  Hornblower and the Hotspur . Michael Joseph.   1967  Hornblower and the Crisis , an unfinished novel. Michael Joseph. Published in the US as Hornblower During the Crisis   1953  Hornblower and the Atropos . Michael Joseph.   1937  The Happy Return . Michael Joseph. Published in the US as Beat to Quarters   1938  A Ship of the Line . Michael Joseph.   1941  Hornblowers Charitable Offering . ": null
    },
    {
        "Argosy ": "Argosy"
    },
    {
        "   1938  Flying Colours . Michael Joseph.   1941 Hornblower and His Majesty . ": null
    },
    {
        "Colliers": "Colliers"
    },
    {
        "   1945  The Commodore . Michael Joseph. Published in the US as Commodore Hornblower   1946  Lord Hornblower . Michael Joseph.   1958  Hornblower in the West Indies . Michael Joseph. Published in the US as Admiral Hornblower in the West Indies   1967 ": null
    },
    {
        "The Last Encounter": "The Last Encounter"
    },
    {
        " . ": null
    },
    {
        "Argosy ": "Argosy"
    },
    {
        "   1964 The Hornblower Companion. Michael Joseph.       1964 The Young Hornblower. . Michael Joseph.   1965 Captain Hornblower . Michael Joseph.   1968 Admiral Hornblower . Michael Joseph.   2011 Hornblower Addendum – Five Short Stories       1924 A Pawn among Kings. Methuen.   1924 The Paid Piper. ": null
    },
    {
        "Methuen": "Methuen Publishing"
    },
    {
        ".   1926  Payment Deferred . Methuen.   1927 Love Lies Dreaming. ": null
    },
    {
        "John Lane": "John Lane"
    },
    {
        ".   1927 The Wonderful Week. John Lane.   1928 The Daughter of the Hawk. John Lane.   1929  Brown on Resolution . John Lane.   1930 Plain Murder. John Lane.   1931 Two-and-Twenty. John Lane.   1932  Death to the French . John Lane. Published in the US as Rifleman Dodd. ": null
    },
    {
        "Little Brown": "Little Brown"
    },
    {
        ".   1933  The Gun . John Lane.   1934 The Peacemaker. ": null
    },
    {
        "Heinemann": "Heinemann"
    },
    {
        ".   1935  The African Queen . Heinemann.   1935 The Pursued , unpublished until 2011, published posthumously by ": null
    },
    {
        "Penguin Classics": "Penguin Classics"
    },
    {
        " A note on the text , endnote by Lawrence Brewer, p. 220   1936  The General . ": null
    },
    {
        "Michael Joseph": "Michael Joseph"
    },
    {
        ".   1940 The Earthly Paradise. Michael Joseph. Published in the US as To the Indies.   1941  The Captain from Connecticut . Michael Joseph.   1942 Poo-Poo and the Dragons. Michael Joseph.   1943  The Ship . Michael Joseph.   1948 The Sky and the Forest. Michael Joseph.   1950 Randall and the River of Time. Michael Joseph.   1955  The Good Shepherd . Michael Joseph.       1967 Long before Forty . Michael Joseph.   1971 Gold from Crete . Michael Joseph.       1944 The Bedchamber Mystery; to which is added the story of The Eleven Deckchairs and Modernity and Maternity. S. J. Reginald Saunders. Published in the US as Three Matronly Mysteries. eNet Press   1954 The Nightmare. Michael Joseph   1969 The Man in the Yellow Raft. Michael Joseph       1931 U 97 Nurse Cavell.        1922 Victor Emmanuel II. Methuen   1927 Victor Emmanuel II and the Union of Italy. Methuen.   1924 Napoleon and his Court. Methuen.   1925 Josephine, Napoleon’s Empress. Methuen.   1928 Louis XIV, King of France and Navarre. Methuen.   1929 Lord Nelson. John Lane.   1929 The Voyage of the Annie Marble. John Lane.   1930 The Annie Marble in Germany. John Lane.   1936 Marionettes at Home. Michael Joseph Ltd.   1953 The Adventures of John Wetherell. ": null
    },
    {
        "Doubleday & Company": "Doubleday  &  Company"
    },
    {
        ", Inc.   1953 The Barbary Pirates. Landmark Books, Random House   1957 The Naval War of 1812. Michael Joseph. Published in the US as The Age of Fighting Sail Hunting the Bismarck. Michael Joseph. Published in the US as The Last Nine Days of the Bismark and Sink the Bismarck": null
    }
]