[
    {
        "        Cajun cuisine  is a style of cooking named for the French-speaking ": null
    },
    {
        "Acadian": "Acadian"
    },
    {
        " people deported by the ": null
    },
    {
        "British": "British Empire"
    },
    {
        " from ": null
    },
    {
        "Acadia": "Acadia"
    },
    {
        " in ": null
    },
    {
        "Canada": "Canada"
    },
    {
        " to what is now called the Acadiana region of ": null
    },
    {
        "Louisiana": "Louisiana"
    },
    {
        ". Cajun cuisine is sometimes referred to as a rustic cuisine, meaning that it is based on ": null
    },
    {
        "locally available ingredients": "Local Food"
    },
    {
        " and preparation is relatively simple.     An authentic Cajun meal is usually a three-pot affair, with one pot dedicated to the main dish, one dedicated to steamed ": null
    },
    {
        "rice": "Rice"
    },
    {
        ", special made sausages, or some seafood dish, and the third containing whatever vegetable is plentiful or available. ": null
    },
    {
        "Crawfish": "Crawfish"
    },
    {
        ", ": null
    },
    {
        "shrimp": "Shrimp"
    },
    {
        ", and ": null
    },
    {
        "andouille": "Andouille"
    },
    {
        " sausage are staple meats used in a variety of dishes.     The aromatic vegetables ": null
    },
    {
        "green bell pepper": "Green Bell Pepper"
    },
    {
        " , ": null
    },
    {
        "onion": "Onion"
    },
    {
        ", and ": null
    },
    {
        "celery": "Celery"
    },
    {
        " are called the holy trinity by Cajun chefs in Cajun and ": null
    },
    {
        "Louisiana Creole cuisine": "Louisiana Creole Cuisine"
    },
    {
        "s. Roughly diced and combined in cooking, the method is similar to the use of the  mirepoix  in traditional ": null
    },
    {
        "French cuisine": "French Cuisine"
    },
    {
        " which blends roughly diced ": null
    },
    {
        "carrot": "Carrot"
    },
    {
        ", onion, and celery. Characteristic aromatics for the ": null
    },
    {
        "Creole": "Creole Peoples"
    },
    {
        " version may also include ": null
    },
    {
        "parsley": "Parsley"
    },
    {
        ", ": null
    },
    {
        "bay leaf": "Bay Leaf"
    },
    {
        ", ": null
    },
    {
        "green onions": "Scallion"
    },
    {
        ", dried ": null
    },
    {
        "cayenne pepper": "Cayenne Pepper"
    },
    {
        ", and dried ": null
    },
    {
        "black pepper": "Black Pepper"
    },
    {
        ".         Around 1755, Acadians were forcibly deported by the British in 1755 in what was called ": null
    },
    {
        "le Grand Dérangement": "Expulsion Of The Acadians"
    },
    {
        ", eventually settling in Southern Louisiana.  Retrieved 2014-04.  Due to the extreme change in climate, Acadians were unable to cook their original dishes.  Retrieved 2014-04.  Soon, their former culinary traditions were lost, and so, these other meals developed to become what is now considered classic Cajun cuisine traditions  .  Up through the 20th century, the meals were not elaborate but instead, rather basic. The publics false perception of Cajun cuisine was based on Prudhommes style of Cajun cooking, which was spicy, flavorful, and not true to the classic form of the cuisine. Cajun and Creole label have been mistaken to be the same, but the origins of Creole cooking began in New Orleans, and Cajun cooking came 40 years after the establishment of New Orleans.    Today, most restaurants serve dishes that consist of Cajun styles, which ": null
    },
    {
        "Paul Prudhomme": "Paul Prudhomme"
    },
    {
        " dubbed Louisiana cooking .  Retrieved 2014-04. In home-cooking, these individual styles are still kept separate. However, there are fewer and fewer people cooking the classic Cajun dishes that would have been eaten by the original settlers. ": null
    },
    {
        "Barbecuing": "Barbecuing"
    },
    {
        " - similar to slow and low Southern barbecue traditions, but with Creole / Cajun seasoning.   ": null
    },
    {
        "Baking": "Baking"
    },
    {
        " - direct and indirect dry heat in a furnace or oven, faster than ": null
    },
    {
        "smoking": "Smoking"
    },
    {
        " but slower than grilling.   ": null
    },
    {
        "Grilling": "Grilling"
    },
    {
        " - direct heat on a shallow surface, fastest of all variants; sub-variants include:   ": null
    },
    {
        "Charbroiling": "Charbroiling"
    },
    {
        " - direct dry heat on a solid surface with wide raised ridges.   ": null
    },
    {
        "Gridironing": "Gridiron"
    },
    {
        " - direct dry heat on a solid or hollow surface with narrow raised ridges.   ": null
    },
    {
        "Griddling": "Griddle"
    },
    {
        " - direct dry or moist heat along with the use of oils and butter on a flat surface.   ": null
    },
    {
        "Braising": "Braising"
    },
    {
        " - combining a direct dry heat charbroil-grill or gridiron-grill with a pot filled with broth for direct moist heat, faster than smoking but slower than regular grilling and baking; time starts fast, slows down, then speeds up again to finish.   ": null
    },
    {
        "Boiling": "Boiling"
    },
    {
        " - as in boiling of crabs, crawfish, or shrimp, in seasoned liquid.   ": null
    },
    {
        "Deep frying": "Deep Frying"
    },
    {
        " Smothering": "Smothering"
    },
    {
        " - cooking a vegetable or meat with low heat and small amounts of water or stock, similar to ": null
    },
    {
        "braising": "Braising"
    },
    {
        ". ": null
    },
    {
        "Étouffée": "Étouffée"
    },
    {
        " is a popular variant done with ": null
    },
    {
        "crawfish": "Crayfish"
    },
    {
        " or shrimp.   Pan-": null
    },
    {
        "broiling": "Broiling"
    },
    {
        " or ": null
    },
    {
        "pan-frying": "Pan-Frying"
    },
    {
        ".   Injecting - using a large ": null
    },
    {
        "syringe": "Syringe"
    },
    {
        "-type setup to place seasoning deep inside large cuts of meat. This technique is much newer than the others on this list, but very common in Cajun Country   ": null
    },
    {
        "Stewing": "Stewing"
    },
    {
        ", also known as .     ": null
    },
    {
        "Deep-frying": "Deep-Frying"
    },
    {
        " of ": null
    },
    {
        "turkeys": "Turkey"
    },
    {
        "or oven-roasted ": null
    },
    {
        "turduckens": "Turducken"
    },
    {
        "entered southern Louisiana cuisine more recently. Also, ": null
    },
    {
        "blackening": "Blackening"
    },
    {
        " of fish or chicken and barbecuing of shrimp in the shell are excluded because they were not prepared in traditional Cajun cuisine. Blackening was actually an invention by chef ": null
    },
    {
        "Paul Prudhomme": "Paul Prudhomme"
    },
    {
        " in the 1970s, becoming associated with Cajun cooking, and presented as such by him, but is not a true historical or traditional Cajun cooking process.  . Astray.com. Retrieved 2014-09-21       The following is a partial list of ingredients used in Cajun cuisine and some of the ": null
    },
    {
        "staple ingredients": "Staple Food"
    },
    {
        " of the Acadian food culture.       ": null
    },
    {
        "Corn": "Maize"
    },
    {
        " Rice": "Rice"
    },
    {
        " — long, medium, or short grain white; also popcorn rice   :Rice proved to be a valuable commodity in early Cajun Country. With an abundance of water and a hot, humid climate, rice could be grown practically anywhere in the region and grew wild in some areas. Rice became the predominant starch in the diet, easy to grow, store and prepare. The oldest rice mill in operation in the United States, the ": null
    },
    {
        "Conrad Rice Mill": "Conrad Rice Mill"
    },
    {
        ", is located in ": null
    },
    {
        "New Iberia": "New Iberia, Louisiana"
    },
    {
        ".   ": null
    },
    {
        "Wheat": "Wheat"
    },
    {
        " — for baking bread              Cajun folkways include many ways of preserving meat, some of which are waning due to the availability of refrigeration and ": null
    },
    {
        "mass-produced": "Mass Production"
    },
    {
        " meat at the grocer. Smoking of meats remains a fairly common practice, but once-common preparations such as turkey or ": null
    },
    {
        "duck confit": "Duck Confit"
    },
    {
        " are now seen even by Acadians as quaint rarities.     Game  are still uniformly popular in Acadiana.     The recent increase of ": null
    },
    {
        "catfish": "Catfish"
    },
    {
        " farming": "Aquaculture Of Catfish"
    },
    {
        " in the ": null
    },
    {
        "Mississippi Delta": "Mississippi Delta"
    },
    {
        " has brought about an increase in its usage in Cajun cuisine in the place of the more traditional wild-caught trout and ": null
    },
    {
        "red fish": "Red Fish"
    },
    {
        ".     Seafood ": null
    },
    {
        "Bass": "Large Mouth Bass"
    },
    {
        " Catfish": "Catfish"
    },
    {
        " Sac-au-Lait": "White Perch"
    },
    {
        "   Yellow perch": "Yellow Perch"
    },
    {
        " Trout": "Cynoscion Nebulosus"
    },
    {
        " Redfish": "Red Drum"
    },
    {
        " Pompano": "Pompano"
    },
    {
        " Drumfish": "Sciaenidae"
    },
    {
        " Flounder": "Flounder"
    },
    {
        " Grouper": "Grouper"
    },
    {
        " Perch": "Perch"
    },
    {
        " - many varieties   ": null
    },
    {
        "Snapper": "Lutjanidae"
    },
    {
        " - many varieties   Shellfish   ": null
    },
    {
        "Crawfish": "Crawfish"
    },
    {
        " - either wild swamp or farm-raised   ": null
    },
    {
        "Shrimp": "Shrimp"
    },
    {
        ", or Crevette   ": null
    },
    {
        "Oysters": "Oyster"
    },
    {
        "  Blue Crab": "Callinectes Sapidus"
    },
    {
        "   Also included in the seafood mix are some so-called ": null
    },
    {
        "trash fish": "Trash Fish"
    },
    {
        " that would not sell at market because of their high bone to meat ratio or required complicated cooking methods. These were brought home by fishermen to feed the family. Examples are garfish, black drum also called gaspergou or just goo , croaker, and bream.     Poultry ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        "   Chicken": "Chicken"
    },
    {
        "   Game birds   ": null
    },
    {
        "Dove": "Dove"
    },
    {
        " Goose": "Goose"
    },
    {
        " Quail": "Quails In Cookery"
    },
    {
        " Duck": "Duck"
    },
    {
        "     Pork ": null
    },
    {
        "Andouille": "Andouille"
    },
    {
        " - a spicy smoked sausage, characterized by a coarse-ground texture   ": null
    },
    {
        "Boudin": "Boudin"
    },
    {
        " - a fresh sausage made with green onions, pork, and rice. Pigs blood is sometimes added to produce boudin rouge . Other versions can contain seafood, such as crawfish.   Chaurice, similar to the Spanish ": null
    },
    {
        "chorizo": "Chorizo"
    },
    {
        " Chaudin": "Chaudin"
    },
    {
        " or ponce - a pigs stomach, stuffed with spiced pork & smoked.   ": null
    },
    {
        "Ham hocks": "Ham Hock"
    },
    {
        "  Wild boar": "Wild Boar"
    },
    {
        " or Feral Hog   ": null
    },
    {
        "Head cheese": "Head Cheese"
    },
    {
        " chicharrones": "Chicharrón"
    },
    {
        ".   ": null
    },
    {
        "Hot link": "Hot Link"
    },
    {
        " sausage   Pork sausage - not smoked or cured, but highly seasoned. Mostly used in gumbos. The sausage itself does not include rice, separating it from boudin.   Salt Pork   ": null
    },
    {
        "Tasso": "Tasso Ham"
    },
    {
        " - a highly seasoned, smoked pork shoulder of the Choctaw     Beef and dairy   Though parts of Acadiana are well suited to cattle or ": null
    },
    {
        "dairy farming": "Dairy Farming"
    },
    {
        ", beef is not often used in a pre-processed or uniquely Cajun form. It is usually prepared fairly simply as chops, stews, or steaks, taking a cue from Texas to the west. Ground beef is used as is traditional throughout the US, although seasoned differently.     Dairy farming is not as prevalent as in the past, but there are still some farms in the business. There are no unique dairy items prepared in Cajun cuisine. Traditional Cajun and New Orleans Creole-influenced desserts are common.     Other game meats ": null
    },
    {
        "Alligator": "Alligator"
    },
    {
        " Alligator gar": "Alligator Gar"
    },
    {
        ", or Gator gar   ": null
    },
    {
        "Frog": "Frog"
    },
    {
        ", usually Bullfrogs   ": null
    },
    {
        "Gros bec": "Gros Bec"
    },
    {
        ", commonly called night heron   ": null
    },
    {
        "Nutria": "Coypu"
    },
    {
        " Squirrel": "Squirrel"
    },
    {
        " Rabbit": "Rabbit"
    },
    {
        " Skunk": "Skunk"
    },
    {
        ", or mouffette   ": null
    },
    {
        "Turtle": "Turtle"
    },
    {
        " Snake": "Snake"
    },
    {
        " Virginia opossum": "Virginia Opossum"
    },
    {
        ", or sarigue   ": null
    },
    {
        "Venison": "Venison"
    },
    {
        "                Bay leaf": "Bay Leaf"
    },
    {
        " Oregano": "Oregano"
    },
    {
        "Bell peppers": "Bell Pepper"
    },
    {
        "   Black pepper": "Black Pepper"
    },
    {
        " Cayenne pepper": "Cayenne Pepper"
    },
    {
        " Chili pepper": "Chili Pepper"
    },
    {
        " Celery": "Celery"
    },
    {
        " Garlic": "Garlic"
    },
    {
        " Onion": "Onion"
    },
    {
        "   Parsley": "Parsley"
    },
    {
        ", flat leaf   ": null
    },
    {
        "Sassafras": "Sassafras"
    },
    {
        " leaves   ": null
    },
    {
        "Dried shrimp": "Dried Shrimp"
    },
    {
        " Sugarcane": "Sugarcane"
    },
    {
        ", also cane syrup, ": null
    },
    {
        "brown sugar": "Brown Sugar"
    },
    {
        " and molasses   ": null
    },
    {
        "Thyme": "Thyme"
    },
    {
        " Chervil": "Chervil"
    },
    {
        " Parsnip": "Parsnip"
    },
    {
        "Cloves": "Clove"
    },
    {
        "  Scotch barley": "Barley"
    },
    {
        " Celery seed": "Celeryuses"
    },
    {
        ", leaf, and stalk. Please note the ": null
    },
    {
        "allergy warning": "Celeryallergies"
    },
    {
        " Leek": "Leekcuisine"
    },
    {
        " Basil": "Basil"
    },
    {
        " Summer savory": "Summer Savory"
    },
    {
        " Sage": "Salvia Officinalis"
    },
    {
        " Marjoram": "Marjoram"
    },
    {
        " Green mint": "Spearmint"
    },
    {
        " Curry": "Curry"
    },
    {
        " Mushroom catsup": "Mushroom Catsup"
    },
    {
        " Walnut catsup": "Ketchup"
    },
    {
        " Chives": "Chives"
    },
    {
        "        Thyme, sage, mint, marjoram, savory, and basil are considered sweet herbs. In Colonial times a ": null
    },
    {
        "herbes de Provence": "Herbes De Provence"
    },
    {
        " would be several sweet herbs tied up in a ": null
    },
    {
        "muslin": "Muslin"
    },
    {
        ". - Retrieved 2014-09-25       Creole / Cajun spice blends such as ": null
    },
    {
        "Tony Chacheres": "Tony Chacheres"
    },
    {
        " are sometimes used in Cajun kitchens, but do not suit every cooks style because Creole / Cajun-style seasoning is often achieved from scratch, even by taste. Cajun seasonings consist of a blend of salt with a variety of spices, most common being cayenne pepper and garlic. The spicy heat comes from the cayenne pepper, while other flavors come from bell pepper, paprika, green onions, parsley and more.    ": null
    },
    {
        "Hot sauce": "Hot Sauce"
    },
    {
        " that includes ": null
    },
    {
        "Tabasco sauce": "Tabasco Sauce"
    },
    {
        " that by 1885 was well known in Louisiana and abroad.   ": null
    },
    {
        "Seafood boil": "Seafood Boil"
    },
    {
        " mix   ": null
    },
    {
        "Vinegar": "Vinegar"
    },
    {
        " seasoned with small, pickled, hot green peppers is a common condiment with many Cajun meals.   ": null
    },
    {
        "Persillade": "Persillade"
    },
    {
        "Marinades": "Marinade"
    },
    {
        "made with ": null
    },
    {
        "olive oil": "Olive Oil"
    },
    {
        ", ": null
    },
    {
        "brown sugar": "Brown Sugar"
    },
    {
        ", and ": null
    },
    {
        "citrus": "Citrus"
    },
    {
        " juices   Various barbecue rubs similar to those in other states.   ": null
    },
    {
        "Worcestershire sauce": "Worcestershire Sauce"
    },
    {
        " roux": "Roux"
    },
    {
        "bacon": "Bacon"
    },
    {
        " fat and more lately with ": null
    },
    {
        "olive oil": "Olive Oil"
    },
    {
        ", and not normally with butter. It is used as a thickening agent, especially in gumbo and étouffée. Preparation of a dark roux is probably the most involved or complicated procedure in Cajun cuisine,  involving heating fat and flour very carefully, constantly stirring for about 15–45 minutes , until the mixture has darkened in color and developed a nutty flavor. The temperature should not be too high, as a burnt roux renders a dish unpalatable.   Light roux: The secret to making a good gumbo is pairing the roux with the protein. A dark roux, with its strong nutty flavor will completely overpower a simple seafood gumbo, but is the perfect complement to a gumbo using chicken, sausage, crawfish or alligator.  A light roux, on the other hand, is better suited for strictly seafood dishes and unsuitable for meat gumbos for the reason that it does not support the heavier meat flavor as well. Pairing roux with protein follows the same orthodox philosophy as pairing wine with protein.   ": null
    },
    {
        "Stocks": "Stock"
    },
    {
        "Court-bouillon": "Court-Bouillon"
    },
    {
        "        Boudin  is a type of ": null
    },
    {
        "sausage": "Sausage"
    },
    {
        " made from pork, pork liver, rice, garlic, ": null
    },
    {
        "green onions": "Scallion"
    },
    {
        " and other spices. It is widely available by the link or pound from butcher shops. Boudin is typically stuffed in a ": null
    },
    {
        "natural casing": "Casing"
    },
    {
        " and has a softer consistency than other, better-known sausage varieties. It is usually served with side dishes such as rice dressing, ": null
    },
    {
        "maque choux": "Maque Choux"
    },
    {
        " or bread. Boudin balls are commonly served in southern Louisiana restaurants and are made by taking the boudin out of the case and frying it in spherical form.     Gumbo - High on the list of favorites of Cajun cooking are the soups called ": null
    },
    {
        "gumbo": "Gumbo"
    },
    {
        "s. Contrary to non-Cajun or Continental beliefs, gumbo does not mean simply everything in the pot . Gumbo exemplifies the influence of French, Spanish, African and ": null
    },
    {
        "Native American food": "Native American Cuisine"
    },
    {
        " cultures on Cajun cuisine. The name originally meant  okra , a word brought to the region from western ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ". Okra which can be one of the principal ingredients in gumbo recipes is used as a thickening agent and for its distinct vegetable flavor. Many claim that Gumbo is a Cajun dish, but Gumbo was established long before the Acadian arrival. Its early existence came via the early French Creole culture In New Orleans, Louisiana, where French, Spanish and Africans frequented and also influenced by later waves of Italian, German and Irish settlers.     A filé gumbo is thickened with dried ": null
    },
    {
        "sassafras": "Sassafras"
    },
    {
        " leaves after the stew has finished cooking, a practice borrowed from the ": null
    },
    {
        "Choctaw": "Choctaw"
    },
    {
        " Indians. The backbone of a gumbo is roux of which there are two variations: Cajun, a golden brown roux, and Creole, a dark roux, which is made of flour, toasted until well-browned, and ": null
    },
    {
        "fat": "Fat"
    },
    {
        " or ": null
    },
    {
        "oil": "Cooking Oil"
    },
    {
        ". The classic gumbo is made with ": null
    },
    {
        "chicken": "Chicken"
    },
    {
        " and the Cajun sausage called ": null
    },
    {
        "andouille": "Andouille"
    },
    {
        ", pronounced , but the ingredients vary according to what is available.     Jambalaya - Another classic Cajun dish is ": null
    },
    {
        "jambalaya": "Jambalaya"
    },
    {
        ". The only certain thing that can be said about a jambalaya is that it contains ": null
    },
    {
        "rice": "Rice"
    },
    {
        ", some sort of meat , seafood or almost anything else. Usually, however, one will find green peppers, onions, celery, tomatoes and hot chili peppers. Anything else is optional. This is also a great pre-Acadian dish, established by the Spanish in Louisiana.     Rice and gravy - ": null
    },
    {
        "Rice and gravy": "Rice And Gravy"
    },
    {
        " dishes are a ": null
    },
    {
        "staple": "Staple Food"
    },
    {
        " of Cajun cuisine  and is usually a ": null
    },
    {
        "brown gravy": "Brown Gravy"
    },
    {
        " based on pan drippings, which are ": null
    },
    {
        "deglazed": "Deglazing"
    },
    {
        " and simmered with extra seasonings and served over steamed or boiled rice. The dish is traditionally made from cheaper cuts of meat and cooked in a ": null
    },
    {
        "cast iron pot": "Cast Iron Cookware"
    },
    {
        ", typically for an extended time period in order to let the tough cuts of meat become tender.  Beef,  pork, chicken or any of a large variety of game meats are used for its preparation.  Popular local varieties include ": null
    },
    {
        "hamburger steak": "Hamburger Steak"
    },
    {
        ", smothered ": null
    },
    {
        "rabbit": "Rabbit"
    },
    {
        ",  turkey necks,  and ": null
    },
    {
        "chicken fricassee": "Fricassee"
    },
    {
        ".               The ": null
    },
    {
        "crawfish boil": "Seafood Boil"
    },
    {
        " is a celebratory event where Cajuns boil crawfish, potatoes, onions and corn in large pots over propane cookers. Lemons and small muslin bags containing a mixture of bay leaves, mustard seeds, cayenne pepper, and other spices, commonly known as crab boil or crawfish boil are added to the water for seasoning. The results are then dumped onto large, newspaper-draped tables and in some areas covered in Creole/Cajun spice blends, such as REX, ": null
    },
    {
        "Zatarains": "Zatarains"
    },
    {
        ", Louisiana Fish Fry, or Tony Chacheres. Also, ": null
    },
    {
        "cocktail sauce": "Cocktail Sauce"
    },
    {
        ", mayonnaise, and ": null
    },
    {
        "hot sauce": "Hot Sauce"
    },
    {
        " are sometimes used. The seafood is scooped onto large trays or plates and eaten by hand. During times when crawfish are not abundant, shrimp and crabs are prepared and served in the same manner.      Attendees are encouraged to suck the head of a crawfish by separating the head from the abdomen of the ": null
    },
    {
        "crustacean": "Crustacean"
    },
    {
        " and sucking out the fat and juices from the head.      Often, newcomers to the crawfish boil or those unfamiliar with the traditions are jokingly warned not to eat the dead ones. This comes from the common belief that when live crawfish are boiled, their tails curl beneath themselves, but when dead crawfish are boiled, their tails are straight and limp.   Seafood boils with crabs and shrimp are also popular.         The traditional Cajun outdoor food event hosted by a farmer in the rural areas of the Acadiana. Family and friends of the farmer gather to socialize, play games, dance, drink, and have a copious meal consisting of hog and other dishes. Men have the task of slaughtering a hog, cutting it into usable parts, and cooking the main pork dishes while women have the task of making ": null
    },
    {
        "boudin": "Boudin"
    },
    {
        ".     , the  is a food event that revolves around pork but does not need to be hosted by a farmer. Traditionally, a ": null
    },
    {
        "suckling pig": "Suckling Pig"
    },
    {
        " was purchased for the event, but in modern , adult pigs are used. Unlike the family , a hog is not butchered by the hosts and there are generally not as many guests or activities. The host and male guests have the task of roasting the pig  while female guests bring side dishes.       The traditional Cajun Mardi Gras  is a Mardi Gras celebration in rural Cajun Parishes. The tradition originated in the 18th century with the Cajuns of Louisiana, but it was abandoned in the early 20th century because of unwelcome violence associated with the event. In the early 1950s the tradition was revived in ": null
    },
    {
        "Mamou": "Mamou, Louisiana"
    },
    {
        " in ": null
    },
    {
        "Evangeline Parish": "Evangeline Parish"
    },
    {
        ".     The event revolves around male maskers on horseback who ride into the countryside to collect food ingredients for the party later on. They entertain householders with Cajun music, dancing, and festive antics in return for the ingredients. The preferred ingredient is a live chicken in which the householder throws the chicken to allow the maskers to chase it down , but other ingredients include rice, sausage, vegetables, or frozen chicken. Unlike other Cajun events, men take no part in cooking the main course for the party, and women prepare the chicken and ingredients for the gumbo. Once the festivities begin, the Cajun community members eat and dance to Cajun music until midnight after which is the beginning of ": null
    },
    {
        "Lent": "Lent"
    },
    {
        ".        ": null
    },
    {
        "Alligator meat": "Alligator Meat"
    },
    {
        " Andouille sausage": "Andouille"
    },
    {
        " Boiled crawfish": "Seafood Boillouisiana"
    },
    {
        " Boudin balls": "Boudintypes"
    },
    {
        " - Boudin-sausage filling that is rolled into a ball, battered and deep fried, instead of being stuffed into pork casings.    ": null
    },
    {
        "Brochette": "Brochette"
    },
    {
        " Creole rice": "Creole Rice"
    },
    {
        " Catfish": "Catfish"
    },
    {
        "  court-bouillon": "Court-Bouillon"
    },
    {
        " Cochon de lait": "Suckling Pig"
    },
    {
        " Couche couche": "Couche Couche"
    },
    {
        "    Crawfish": "Crayfish As Food"
    },
    {
        " bisque": "Bisque"
    },
    {
        " étouffée": "Étouffée"
    },
    {
        " Crawfish pie": "Crawfish Pie"
    },
    {
        " Dirty rice": "Dirty Rice"
    },
    {
        " Étouffée": "Étouffée"
    },
    {
        " frog legs": "Frog Legs"
    },
    {
        " Gumbo zherbes": "Gumbogumbo Zherbes"
    },
    {
        "  Hogs head cheese": "Head Cheese"
    },
    {
        " Maque choux": "Maque Choux"
    },
    {
        " Pecan": "Pecan"
    },
    {
        "pralines": "Praline"
    },
    {
        "  Pepper jelly": "Pepper Jelly"
    },
    {
        " Potato salad": "Potato Salad"
    },
    {
        ", generally made with egg, potato, celery, onions, mayonnaise, mustard and sometimes bell pepper   ": null
    },
    {
        "Sauce piquante": "Sauce Piquante"
    },
    {
        "   Seafood-stuffed ": null
    },
    {
        "Mirliton": "Chayote"
    },
    {
        " Tarte à la bouillie": "Tarte À La Bouillie"
    },
    {
        "   Tasso ham": "Tasso Ham"
    },
    {
        " John Besh": "John Besh"
    },
    {
        " Frank Joseph Davis": "Frank Joseph Davis"
    },
    {
        " Chef KD , Kevin Diez": "Chef   Kd  , Kevin Diez"
    },
    {
        " John Folse": "John Folse"
    },
    {
        " Emeril Lagasse": "Emeril Lagasse"
    },
    {
        " Paul Prudhomme": "Paul Prudhomme"
    },
    {
        " Justin Wilson": "Justin Wilson"
    },
    {
        "         Three popular local dishes in Acadiana are noted in the ": null
    },
    {
        "Hank Williams": "Hank Williams"
    },
    {
        " song  Jambalaya ": null
    }
]