[
    {
        "                        Canals are waterways ": null
    },
    {
        "channels": "Channel"
    },
    {
        ", or artificial waterways, for water conveyance, or to service ": null
    },
    {
        "water transport": "Water Transport"
    },
    {
        "vehicles": "Vehicle"
    },
    {
        ". They may also help with irrigation. It can be thought of as an artificial version of a ": null
    },
    {
        "river": "River"
    },
    {
        ".     In most cases, the engineered works will have a series of ": null
    },
    {
        "dams": "Dam"
    },
    {
        " and ": null
    },
    {
        "locks": "Lock"
    },
    {
        " that create ": null
    },
    {
        "reservoirs": "Reservoir"
    },
    {
        " of low speed current flow. These reservoirs are referred to as slack water levels, often just called levels.     A canal is also known as a navigation when it parallels a river and shares part of its waters and drainage basin, and leverages its resources by building dams and locks to increase and lengthen its stretches of slack water levels while staying in its ": null
    },
    {
        "valley": "Valley"
    },
    {
        ".     In contrast, a canal cuts across a ": null
    },
    {
        "drainage divide": "Drainage Divide"
    },
    {
        " atop a ": null
    },
    {
        "ridge": "Ridge"
    },
    {
        ", generally requiring an external water source above the highest ": null
    },
    {
        "elevation": "Elevation"
    },
    {
        ".     Many canals have been built at elevations towering over valleys and other water ways crossing far below.     Canals with sources of water at a higher level can deliver water to a destination such as a city where water is needed. The ": null
    },
    {
        "Roman Empires": "Roman Empire"
    },
    {
        "aqueducts": "Aqueduct"
    },
    {
        " were such ": null
    },
    {
        "water supply": "Water Supply"
    },
    {
        " canals.       A navigation is a series of channels that run roughly parallel to the valley and ": null
    },
    {
        "stream bed": "Stream Bed"
    },
    {
        " of an unimproved river. A navigation always shares the ": null
    },
    {
        "drainage basin": "Drainage Basin"
    },
    {
        " of the river. A vessel uses the calm parts of the river itself as well as improvements, traversing the same changes in height.     A true canal is a channel that cuts across a ": null
    },
    {
        "drainage divide": "Drainage Divide"
    },
    {
        ", making a navigable channel connecting two different ": null
    },
    {
        "drainage basins": "Drainage Basin"
    },
    {
        ".     Most commercially important canals of the first half of the 19th century were a little of each, using rivers in long stretches, and divide crossing canals in others. This is true for many canals still in use.       Both navigations and canals use ": null
    },
    {
        "engineered": "Civil Engineering"
    },
    {
        " structures to improve navigation:   ": null
    },
    {
        "weirs": "Weir"
    },
    {
        " and ": null
    },
    {
        "dams": "Dam"
    },
    {
        " to raise river water levels to usable depths;   looping descents to create a longer and gentler channel around a stretch of rapids or falls;   ": null
    },
    {
        "locks": "Lock"
    },
    {
        " to allow ships and barges to ascend/descend.     Since they cut across drainage divides, canals are more difficult to construct and often need additional improvements, like ": null
    },
    {
        "viaducts": "Viaduct"
    },
    {
        " and ": null
    },
    {
        "aqueducts": "Aqueduct"
    },
    {
        " to bridge waters over streams and roads, and ways to keep water in the channel.       There are two broad types of canal:   ": null
    },
    {
        "Waterways": "Waterway"
    },
    {
        ": canals and navigations used for carrying vessels transporting goods and people. These can be subdivided into two kinds:   : Those connecting existing ": null
    },
    {
        "lakes": "Lake"
    },
    {
        ", ": null
    },
    {
        "rivers": "River"
    },
    {
        ", other canals or seas and ": null
    },
    {
        "oceans": "Ocean"
    },
    {
        ".   : Those connected in a city network: such as the  Canal Grande  and others of ": null
    },
    {
        "Venice": "Venice"
    },
    {
        " Italy": "Italy"
    },
    {
        "; the  gracht en of ": null
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        " or ": null
    },
    {
        "Utrecht": "Utrecht"
    },
    {
        ", and the waterways of ": null
    },
    {
        "Bangkok": "Bangkok"
    },
    {
        ".   ": null
    },
    {
        "Aqueducts": "Aqueduct"
    },
    {
        "water supply": "Water Supply"
    },
    {
        " canals that are used for the conveyance and delivery of ": null
    },
    {
        "potable": "Potable"
    },
    {
        " water for human consumption, ": null
    },
    {
        "municipal": "Municipal"
    },
    {
        " uses, ": null
    },
    {
        "hydro power canals": "Power Canal"
    },
    {
        " and ": null
    },
    {
        "agriculture": "Agriculture"
    },
    {
        " irrigation": "Irrigation"
    },
    {
        ".                      Historically canals were of immense importance to commerce and the development, growth and vitality of a civilization. In 1855 the ": null
    },
    {
        "Lehigh Canal": "Lehigh Canal"
    },
    {
        " carried over 1.2 million tons of anthracite coal; by the 1930s the company which built and operated it over a century pulled the plug. The few canals still in operation in our modern age are a fraction of the numbers that once fueled and enabled economic growth, indeed were practically a prerequisite to further urbanization and industrialization. For the movement of bulk raw materials such as coal and ores are difficult and marginally affordable without water transport. Such raw materials fueled the industrial developments and new ": null
    },
    {
        "metallurgy": "Metallurgy"
    },
    {
        " resulting of the spiral of increasing mechanization during 17th–20th century, leading to new research disciplines, new industries and economies of scale, raising the standard of living for any industrialized society.     The surviving canals   including most ": null
    },
    {
        "ship canals": "Ship Canal"
    },
    {
        ", today primarily service mostly ": null
    },
    {
        "bulk cargo": "Bulk Material Handling"
    },
    {
        " and large ": null
    },
    {
        "ship transport": "Ship Transport"
    },
    {
        "ation industries, whereas the once critical smaller inland waterways conceived and engineered as boat and barge canals have largely been supplanted and filled in, abandoned and left to deteriorate, or kept in service and staffed by state employees, where dams and locks are maintained for flood control or pleasure boating. Their replacement was gradual, beginning first in the United States in the mid-1850s where canal shipping was first augmented by, then began being replaced by using much faster, less geographically constrained & limited, and generally cheaper to maintain ": null
    },
    {
        "railways": "Railway"
    },
    {
        ".     By the early 1880s, canals which had little ability to economically compete with rail transport, were off the map. In the next couple of decades, coal was increasingly diminished as the heating fuel of choice by oil, and growth of coal shipments leveled off. Later, after ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " when motor-trucks came into their own, the last small U.S. barge canals saw a steady decline in cargo ton-miles alongside many railways, the flexibility and steep slope climbing capability of lorries taking over cargo hauling increasingly as road networks were improved, and which also had the freedom to make deliveries well away from rail lined road beds or ditches in the dirt which couldnt operate in the winter.       Canals are built in one of three ways, or a combination of the three, depending on available water and available path:   ;Human made streams   A canal can be created where no stream presently exists. Either the body of the canal is dug or the sides of the canal are created by making ": null
    },
    {
        "dykes or levees": "Levee"
    },
    {
        " by piling dirt, stone, concrete or other building materials. The finished shape of the canal as seen in cross section is known as the canal prism.  The water for the canal must be provided from an external source, like streams or reservoirs. Where the new waterway must change elevation engineering works like locks, lifts or elevators are constructed to raise and lower vessels. Examples include canals that connect valleys over a higher body of land, like ": null
    },
    {
        "Canal du Midi": "Canal Du Midi"
    },
    {
        ", ": null
    },
    {
        "Canal de Briare": "Canal De Briare"
    },
    {
        " and the ": null
    },
    {
        "Panama Canal": "Panama Canal"
    },
    {
        ".   A canal can be constructed by dredging a channel in the bottom of an existing lake. When the channel is complete, the lake is drained and the channel becomes a new canal, serving both drainage of the surrounding ": null
    },
    {
        "polder": "Polder"
    },
    {
        " and providing transport there. Examples include the . One can also build two parallel dikes in an existing lake, forming the new canal in between, and then drain the remaining parts of the lake. The eastern and central parts of the ": null
    },
    {
        "North Sea Canal": "North Sea Canal"
    },
    {
        " were constructed in this way. In both cases pumping stations are required to keep the land surrounding the canal dry, either pumping water from the canal into surrounding waters, or pumping it from the land into the canal.   ;Canalization and navigations     canalized  to make its navigable path more predictable and easier to maneuver. Canalization modifies the stream to carry traffic more safely by controlling the flow of the stream by dredging, damming and modifying its path. This frequently includes the incorporation of locks and spillways, that make the river a navigation. Examples include the ": null
    },
    {
        "Lehigh Canal": "Lehigh Canal"
    },
    {
        " in ": null
    },
    {
        "Northeastern Pennsylvanias": "Lehigh Valley"
    },
    {
        " coal Region": "Coal Region"
    },
    {
        ", ": null
    },
    {
        "Basse Saône": "Basse Saône"
    },
    {
        ", ": null
    },
    {
        "Canal de Mines de Fer de la Moselle": "Canal De Mines De Fer De La Moselle"
    },
    {
        ", and ": null
    },
    {
        "Aisne River": "Aisne Canalized Portion"
    },
    {
        ". ": null
    },
    {
        "Riparian zone restoration": "Riparian Zone Restoration"
    },
    {
        " may be required.      ;Lateral canals   When a stream is too difficult to modify with canalization, a second stream can be created next to or at least near the existing stream. This is called a  lateral canal , and may meander in a large horseshoe bend or series of curves some distance from the source waters stream bed lengthening the effective length in order to lower the ratio of rise over run . The existing stream usually acts as the water source and the landscape around its banks provide a path for the new body. Examples include the ": null
    },
    {
        "Chesapeake and Ohio Canal": "Chesapeake And Ohio Canal"
    },
    {
        ", ": null
    },
    {
        "Canal latéral à la Loire": "Canal Latéral À La Loire"
    },
    {
        ", ": null
    },
    {
        "Garonne Lateral Canal": "Garonne Lateral Canal"
    },
    {
        " and ": null
    },
    {
        "Juliana Canal": "Juliana Canal"
    },
    {
        ".     Smaller transportation canals can carry ": null
    },
    {
        "barges": "Barge"
    },
    {
        " or ": null
    },
    {
        "narrowboats": "Narrowboat"
    },
    {
        ", while ": null
    },
    {
        "ship canals": "Ship Canal"
    },
    {
        " allow seagoing ships to travel to an inland port , or from one sea or ocean to another .               At their simplest, canals consist of a trench filled with water. Depending on the ": null
    },
    {
        "stratum": "Stratum"
    },
    {
        " the canal passes through, it may be necessary to ": null
    },
    {
        "line": "Canal Lining"
    },
    {
        " the cut with some form of watertight material such as clay or concrete. When this is done with clay, it is known as ": null
    },
    {
        "puddling": "Puddling"
    },
    {
        ".        Canals need to be level, and while small irregularities in the lie of the land can be dealt with through cuttings and embankments, for larger deviations other approaches have been adopted. The most common is the ": null
    },
    {
        "pound lock": "Pound Lock"
    },
    {
        ", which consists of a chamber within which the water level can be raised or lowered connecting either two pieces of canal at a different level or the canal with a river or the sea. When there is a hill to be climbed, flights of many locks in short succession may be used.     Prior to the development of the pound lock in 984  AD in China by Chhaio Wei-Yo  and later in Europe in the 15th century, either ": null
    },
    {
        "flash locks": "Canal Lockflash Locks"
    },
    {
        " consisting of a single gate were used or ramps, sometimes equipped with rollers, were used to change the level. Flash locks were only practical where there was plenty of water available.     Locks use a lot of water, so builders have adopted other approaches for situations where little water is available. These include ": null
    },
    {
        "boat lifts": "Boat Lift"
    },
    {
        ", such as the ": null
    },
    {
        "Falkirk Wheel": "Falkirk Wheel"
    },
    {
        ", which use a ": null
    },
    {
        "caisson": "Caisson"
    },
    {
        " of water in which boats float while being moved between two levels; and ": null
    },
    {
        "inclined planes": "Canal Inclined Plane"
    },
    {
        " where a caisson is hauled up a steep railway.     To cross a stream, road or valley the valley can be spanned by a ": null
    },
    {
        "navigable aqueduct": "Navigable Aqueduct"
    },
    {
        " – a famous example in Wales is the ": null
    },
    {
        "Pontcysyllte Aqueduct": "Pontcysyllte Aqueduct"
    },
    {
        "  across the valley of the ": null
    },
    {
        "River Dee": "River Dee"
    },
    {
        ".     Another option for dealing with hills is to tunnel through them. An example of this approach is the ": null
    },
    {
        "Harecastle Tunnel": "Harecastle Tunnel"
    },
    {
        " on the ": null
    },
    {
        "Trent and Mersey Canal": "Trent And Mersey Canal"
    },
    {
        ". Tunnels are only practical for smaller canals.     Some canals attempted to keep changes in level down to a minimum. These canals known as ": null
    },
    {
        "contour canals": "Contour Canal"
    },
    {
        " would take longer, winding routes, along which the land was a uniform altitude. Other, generally later, canals took more direct routes requiring the use of various methods to deal with the change in level.     Canals have various features to tackle the problem of water supply. In cases, like the Suez Canal, the canal is simply open to the sea. Where the canal is not at sea level, a number of approaches have been adopted. Taking water from existing rivers or springs was an option in some cases, sometimes supplemented by other methods to deal with seasonal variations in flow. Where such sources were unavailable, ": null
    },
    {
        "reservoirs": "Reservoirs"
    },
    {
        "  – either separate from the canal or built into its course  – and ": null
    },
    {
        "back pumping": "Back Pumping"
    },
    {
        " were used to provide the required water. In other cases, water pumped from mines was used to feed the canal. In certain cases, extensive feeder canals were built to bring water from sources located far from the canal.     Where large amounts of goods are loaded or unloaded such as at the end of a canal, a ": null
    },
    {
        "canal basin": "Canal Basin"
    },
    {
        " may be built. This would normally be a section of water wider than the general canal. In some cases, the canal basins contain ": null
    },
    {
        "wharfs": "Wharf"
    },
    {
        " and cranes to assist with movement of goods.     When a section of the canal needs to be sealed off so it can be drained for maintenance ": null
    },
    {
        "stop planks": "Stop Planks"
    },
    {
        " are frequently used. These consist of planks of wood placed across the canal to form a dam. They are generally placed in pre-existing grooves in the canal bank. On more modern canals, guard locks or gates were sometimes placed to allow a section of the canal to be quickly closed off, either for maintenance, or to prevent a major loss of water due to a canal breach.               The transport capacity of ": null
    },
    {
        "pack animals": "Pack Animal"
    },
    {
        " and ": null
    },
    {
        "carts": "Cart"
    },
    {
        " is limited. A mule can carry an eighth-ton  maximum load over a journey measured in days and weeks, though much more for shorter distances and periods with appropriate rest. Besides, carts need roads. Transport over water is much more efficient and cost-effective for large cargoes.          The oldest known canals were ": null
    },
    {
        "irrigation": "Irrigation"
    },
    {
        " canals, built in ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    },
    {
        " circa 4000 BC, in what is now ": null
    },
    {
        "Iraq": "Iraq"
    },
    {
        " and ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ". The ": null
    },
    {
        "Indus Valley Civilization": "Indus Valley Civilization"
    },
    {
        ", ": null
    },
    {
        "Ancient India": "Ancient India"
    },
    {
        ", had sophisticated irrigation and storage systems developed, including the ": null
    },
    {
        "reservoirs": "Reservoir"
    },
    {
        " built at ": null
    },
    {
        "Girnar": "Girnar"
    },
    {
        " in 3000 BC.  In ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", canals date back at least to the time of ": null
    },
    {
        "Pepi I Meryre": "Pepi I Meryre"
    },
    {
        " , who ordered a canal built to bypass the ": null
    },
    {
        "cataract": "Cataracts Of The Nile"
    },
    {
        " on the Nile near ": null
    },
    {
        "Aswan": "Aswan"
    },
    {
        ".       In ": null
    },
    {
        "ancient China": "History Of Chinaancient China"
    },
    {
        ", large canals for river transport were established as far back as the ": null
    },
    {
        "Spring and Autumn Period": "Spring And Autumn Period"
    },
    {
        " , the longest one of that period being the Hong Gou , which according to the ancient historian ": null
    },
    {
        "Sima Qian": "Sima Qian"
    },
    {
        " connected the old states of Song, Zhang, Chen, Cai, Cao, and Wei.  The ": null
    },
    {
        "Caoyun System": "Caoyun System"
    },
    {
        " of canals was essential for imperial taxation, which was largely assessed in kind and involved enormous shipments of rice and other grains. By far the longest canal was the ": null
    },
    {
        "Grand Canal of China": "Grand Canal Of China"
    },
    {
        ", still the longest canal in the world today and the oldest extant one.  It is  long and was built to carry the ": null
    },
    {
        "Emperor Yang Guang": "Emperor Yang Of Sui"
    },
    {
        " between Zhuodu  and Yuhang . The project began in 605 and was completed in 609, although much of the work combined older canals, the oldest section of the canal existing since at least 486 BC. Even in its narrowest urban sections it is rarely less than  wide.     ": null
    },
    {
        "Greek engineers": "Greek Engineering"
    },
    {
        " were also among the first to use ": null
    },
    {
        "canal locks": "Lock"
    },
    {
        ", by which they regulated the water flow in the ": null
    },
    {
        "Ancient Suez Canal": "Ancient Suez Canal"
    },
    {
        " as early as the 3rd  century  BC. Moore, Frank Gardner : Three Canal Projects, Roman and Byzantine ,  American Journal of Archaeology , Vol. 54, No. 2, pp. 97–111 Froriep, Siegfried : Ein Wasserweg in Bithynien. Bemühungen der Römer, Byzantiner und Osmanen , Antike Welt, 2nd Special Edition, pp. 39–50 Schörner, Hadwiga : Künstliche Schiffahrtskanäle in der Antike. Der sogenannte antike Suez-Kanal , Skyllis, Vol. 3, No. 1, pp. 28–43               In the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", water transport was several times cheaper and faster than transport overland. Overland transport by ": null
    },
    {
        "animal drawn": "Animal Power"
    },
    {
        " conveyances was used around settled areas, but unimproved roads required pack animal trains, usually of ": null
    },
    {
        "mules": "Mule"
    },
    {
        " to carry any degree of mass, and while a mule could carry an eighth ton, it also needed teamsters to tend it and one man could only tend perhaps five mules, meaning overland ": null
    },
    {
        "bulk transport": "Bulk Transport"
    },
    {
        " was also expensive, as men expect compensation in the form of wages, room and board. This was because long-haul roads were unpaved, more often than not too narrow for carts, much less wagons, and in poor condition, wending their way through forests, marshy or muddy quagmires as often as unimproved but dry footing. In that era, as today, greater cargoes, especially bulk goods and ": null
    },
    {
        "raw materials": "Raw Material"
    },
    {
        ", could be transported by ship far more economically than by land; in the pre-railroad days of the industrial revolution, water transport was the gold standard of fast transportation. The first artificial canal in Western Europe was the ": null
    },
    {
        "Fossa Carolina": "Fossa Carolina"
    },
    {
        " built at the end of the 8th century under personal supervision of ": null
    },
    {
        "Charlemagne": "Charlemagne"
    },
    {
        ".     In Britain, the  Glastonbury Canal   is believed to be the first post-Roman canal and was built in the middle of the 10th century to link the ": null
    },
    {
        "River Brue": "River Brue"
    },
    {
        " at Northover specifically from , Start point at River Brue with ": null
    },
    {
        "Glastonbury Abbey": "Glastonbury Abbey"
    },
    {
        ", a distance of about . Details text and data with cites from ": null
    },
    {
        "Glastonbury Canal ": "Glastonbury Canal"
    },
    {
        ". Its initial purpose is believed to be the transport of building stone for the abbey, but later it was used for delivering produce, including grain, wine and fish, from the abbeys outlying properties. It remained in use until at least the 14th century, but possibly as late as the mid-16th century.  More lasting and of more economic impact were canals like the ": null
    },
    {
        "Naviglio Grande": "Naviglio Grande"
    },
    {
        " built between 1127 and 1257 to connect ": null
    },
    {
        "Milan": "Milan"
    },
    {
        " with the ": null
    },
    {
        "Ticino River": "Ticino River"
    },
    {
        ". The Naviglio Grande is the most important of the ": null
    },
    {
        "lombard": "Lombardy"
    },
    {
        " navigli": "Navigli"
    },
    {
        "  and the oldest functioning canal in Europe. Later, canals were built in the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        " and ": null
    },
    {
        "Flanders": "Flanders"
    },
    {
        " to drain the ": null
    },
    {
        "polders": "Polder"
    },
    {
        " and assist transportation of goods and people.     Canal building was revived in this age because of commercial expansion from the 12th century. River navigations were improved progressively by the use of single, or ": null
    },
    {
        "flash locks": "Flash Lock"
    },
    {
        ". Taking boats through these used large amounts of water leading to conflicts with ": null
    },
    {
        "watermill": "Watermill"
    },
    {
        " owners and to correct this, the ": null
    },
    {
        "pound": "Pound Lock"
    },
    {
        " or chamber lock first appeared, in the 10th century in China and in Europe in 1373 in ": null
    },
    {
        "Vreeswijk": "Vreeswijk"
    },
    {
        ", Netherlands.  Another important development was the ": null
    },
    {
        "mitre gate": "Mitre Gate"
    },
    {
        ", which was, it is presumed, introduced in Italy by Bertola da Novate in the 16th century. This allowed wider gates and also removed the height restriction of ": null
    },
    {
        "guillotine locks": "Guillotine Lock"
    },
    {
        ".     To break out of the limitations caused by river valleys, the first ": null
    },
    {
        "summit level canals": "Summit Level Canal"
    },
    {
        " were developed with the ": null
    },
    {
        "Grand Canal of China": "Grand Canal"
    },
    {
        " in 581–617 AD whilst in Europe the first, also using single locks, was the ": null
    },
    {
        "Stecknitz Canal": "Stecknitz Canal"
    },
    {
        " in Germany in 1398.          Around 1500–1800 the first summit level canal to use pound locks in Europe was the ": null
    },
    {
        "Briare Canal": "Briare Canal"
    },
    {
        " connecting the ": null
    },
    {
        "Loire": "Loire"
    },
    {
        " and ": null
    },
    {
        "Seine": "Seine"
    },
    {
        " , followed by the more ambitious ": null
    },
    {
        "Canal du Midi": "Canal Du Midi"
    },
    {
        " connecting the Atlantic to the Mediterranean. This included a staircase of 8 locks at ": null
    },
    {
        "Béziers": "Béziers"
    },
    {
        ", a  tunnel, and three major aqueducts.     Canal building progressed steadily in Germany in the 17th and 18th centuries with three great rivers, the ": null
    },
    {
        "Elbe": "Elbe"
    },
    {
        ", ": null
    },
    {
        "Oder": "Oder"
    },
    {
        " and ": null
    },
    {
        "Weser": "Weser"
    },
    {
        " being linked by canals. In post-Roman Britain, the first ": null
    },
    {
        "early modern period": "Early Modern Period"
    },
    {
        " canal built appears to have been the ": null
    },
    {
        "Exeter Canal": "Exeter Canal"
    },
    {
        ", which was surveyed in 1563, and open in 1566.  Exeter history by www.exeter.gov.uk, .pdf file  , accessdate13 September 2013     The oldest canal in North America, technically a ": null
    },
    {
        "mill race": "Mill Race"
    },
    {
        " built for industrial purposes, is ": null
    },
    {
        "Mother Brook": "Mother Brook"
    },
    {
        " between the ": null
    },
    {
        "Boston, Massachusetts": "Boston"
    },
    {
        " neighbourhoods of ": null
    },
    {
        "Dedham": "Dedham, Massachusetts"
    },
    {
        " and ": null
    },
    {
        "Hyde Park": "Hyde Park, Boston"
    },
    {
        " connecting the higher waters of the ": null
    },
    {
        "Charles River": "Charles River"
    },
    {
        " and the mouth of the ": null
    },
    {
        "Neponset River": "Neponset River"
    },
    {
        " and the sea. It was constructed in 1639 to provide water power for mills.     In Russia, the ": null
    },
    {
        "Volga–Baltic Waterway": "Volga–Baltic Waterway"
    },
    {
        ", a nationwide canal system connecting the ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        " and ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        " via the ": null
    },
    {
        "Neva": "Neva"
    },
    {
        " and ": null
    },
    {
        "Volga": "Volga"
    },
    {
        " rivers, was opened in 1718.        ": null
    },
    {
        "History of the British canal system": "History Of The British Canal System"
    },
    {
        " History of turnpikes and canals in the United States": "History Of Turnpikes And Canals In The United States"
    },
    {
        "     The modern canal system was mainly a product of the 18th century and early 19th century. It came into being because the ": null
    },
    {
        "Industrial Revolution": "Industrial Revolution"
    },
    {
        " demanded an economic and reliable way to transport goods and commodities in large quantities.     By the early 18th century, river navigations such as the ": null
    },
    {
        "Aire and Calder Navigation": "Aire And Calder Navigation"
    },
    {
        " were becoming quite sophisticated, with ": null
    },
    {
        "pound locks": "Pound Lock"
    },
    {
        " and longer and longer cuts to avoid circuitous or difficult stretches of river. Eventually, the experience of building long multi-level cuts with their own locks gave rise to the idea of building a pure canal, a waterway designed on the basis of where goods needed to go, not where a river happened to be.     The claim for the first pure canal in ": null
    },
    {
        "Great Britain": "Great Britain"
    },
    {
        " is debated between Sankey and Bridgewater supporters. Burton, . Chapter 3: Building the Canals The first true canal in what is now the United Kingdom was the ": null
    },
    {
        "Newry Canal": "Newry Canal"
    },
    {
        " in ": null
    },
    {
        "Northern Ireland": "Northern Ireland"
    },
    {
        " constructed by ": null
    },
    {
        "Thomas Steers": "Thomas Steers"
    },
    {
        " in 1741.     The ": null
    },
    {
        "Sankey Brook Navigation": "Sankey Canal"
    },
    {
        ", which connected ": null
    },
    {
        "St Helens": "St Helens, Merseyside"
    },
    {
        " with the ": null
    },
    {
        "River Mersey": "River Mersey"
    },
    {
        ", is often claimed as the first modern purely artificial canal because although originally a scheme to make the Sankey Brook navigable, it included an entirely new artificial channel that was effectively a canal along the Sankey Brook valley. Rolt, Inland Waterways However, Bridgewater supporters point out that the last quarter-mile of the navigation is indeed a canalized stretch of the Brook, and that it was the Bridgewater Canal that captured the popular imagination and inspired further canals.        In the mid-eighteenth century the ": null
    },
    {
        "3rd Duke of Bridgewater": "Francis Egerton, 3Rd Duke Of Bridgewater"
    },
    {
        ", who owned a number of ": null
    },
    {
        "coal mines": "Coal Mine"
    },
    {
        " in northern England, wanted a reliable way to transport his coal to the rapidly industrializing city of ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        ". He commissioned the engineer ": null
    },
    {
        "James Brindley": "James Brindley"
    },
    {
        " to build a canal for that purpose. Brindleys design included an aqueduct carrying the canal over the ": null
    },
    {
        "River Irwell": "River Irwell"
    },
    {
        ". This was an engineering wonder which immediately attracted tourists. The construction of this canal was funded entirely by the Duke and was called the ": null
    },
    {
        "Bridgewater Canal": "Bridgewater Canal"
    },
    {
        ". It opened in 1761 and was the first major British canal.      The new canals proved highly successful. The boats on the canal were horse-drawn with a ": null
    },
    {
        "towpath": "Towpath"
    },
    {
        " alongside the canal for the horse to walk along. This horse-drawn system proved to be highly economical and became standard across the British canal network. Commercial horse-drawn canal boats could be seen on the UKs canals until as late as the 1950s, although by then diesel-powered boats, often towing a second unpowered boat, had become standard.     The canal boats could carry thirty tons at a time with only one horse pulling – more than ten times the amount of cargo per horse that was possible with a cart. Because of this huge increase in supply, the Bridgewater canal reduced the price of coal in Manchester by nearly two-thirds within just a year of its opening. The Bridgewater was also a huge financial success, with it earning what had been spent on its construction within just a few years.     This success proved the viability of canal transport, and soon industrialists in many other parts of the country wanted canals. After the Bridgewater canal, early canals were built by groups of private individuals with an interest in improving communications. In Staffordshire the famous potter ": null
    },
    {
        "Josiah Wedgwood": "Josiah Wedgwood"
    },
    {
        " saw an opportunity to bring bulky cargoes of clay to his factory doors and to transport his fragile finished goods to market in Manchester, ": null
    },
    {
        "Birmingham": "History Of Birminghamtransport And The Growth Of The Town"
    },
    {
        " or further away, by water, minimizing breakages. Within just a few years of the Bridgewaters opening, an embryonic national canal network came into being, with the construction of canals such as the ": null
    },
    {
        "Oxford Canal": "Oxford Canal"
    },
    {
        " and the ": null
    },
    {
        "Trent & Mersey Canal": "Trent  &  Mersey Canal"
    },
    {
        ".       The new canal system was both cause and effect of the rapid industrialization of ": null
    },
    {
        "The Midlands": "The Midlands"
    },
    {
        " and the north. The period between the 1770s and the 1830s is often referred to as the Golden Age of British canals.     For each canal, an Act of Parliament was necessary to authorize construction, and as people saw the high incomes achieved from canal tolls, canal proposals came to be put forward by investors interested in profiting from dividends, at least as much as by people whose businesses would profit from cheaper transport of raw materials and finished goods.     In a further development, there was often out-and-out speculation, where people would try to buy shares in a newly floated company simply to sell them on for an immediate profit, regardless of whether the canal was ever profitable, or even built. During this period of ": null
    },
    {
        "canal mania": "Canal Mania"
    },
    {
        " , huge sums were invested in canal building, and although many schemes came to nothing, the canal system rapidly expanded to nearly 4,000 miles in length.     Many rival canal companies were formed and competition was rampant. Perhaps the best example was ": null
    },
    {
        "Worcester Bar": "Gas Street Basin"
    },
    {
        " in Birmingham, a point where the ": null
    },
    {
        "Worcester and Birmingham Canal": "Worcester And Birmingham Canal"
    },
    {
        " and the ": null
    },
    {
        "Birmingham Canal Navigations Main Line": "Bcn Main Line"
    },
    {
        " were only seven feet apart. For many years, a dispute about tolls meant that goods travelling through Birmingham had to be portaged from boats in one canal to boats in the other.           Canal companies were initially chartered by individual states in the United States. These early canals were constructed, owned, and operated by private joint-stock companies. Three were completed when the ": null
    },
    {
        "War of 1812": "War Of 1812"
    },
    {
        " broke out; these were the ": null
    },
    {
        "Santee Canal": "Santee Canal"
    },
    {
        " in ": null
    },
    {
        "South Carolina": "South Carolina"
    },
    {
        ", the ": null
    },
    {
        "Middlesex Canal": "Middlesex Canal"
    },
    {
        " in ": null
    },
    {
        "Massachusetts": "Massachusetts"
    },
    {
        " and the ": null
    },
    {
        "Dismal Swamp Canal": "Dismal Swamp Canal"
    },
    {
        " in ": null
    },
    {
        "Virginia": "Virginia"
    },
    {
        ". The ": null
    },
    {
        "Erie Canal": "Erie Canal"
    },
    {
        " was chartered and owned by the state of ": null
    },
    {
        "New York": "New York"
    },
    {
        " and financed by ": null
    },
    {
        "bonds": "Bond"
    },
    {
        " bought by private investors. The Erie canal runs about  from ": null
    },
    {
        "Albany, New York": "Albany, New York"
    },
    {
        ", on the ": null
    },
    {
        "Hudson River": "Hudson River"
    },
    {
        " to ": null
    },
    {
        "Buffalo, New York": "Buffalo, New York"
    },
    {
        ", at ": null
    },
    {
        "Lake Erie": "Lake Erie"
    },
    {
        ". The Hudson River connects Albany to the Atlantic port of ": null
    },
    {
        "New York City": "History Of New York City"
    },
    {
        " and the Erie Canal completed a navigable water route from the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " to the ": null
    },
    {
        "Great Lakes": "Great Lakes"
    },
    {
        ". The canal contains 36 locks and encompasses a total elevation differential of around 565  ft. . The Erie Canal with its easy connections to most of the U.S. mid-west and New York City soon quickly paid back all its invested capital and started turning a profit. By cutting transportation costs in half or more it became a large profit center for Albany and New York City as it allowed the cheap transportation of many of the agricultural products grown in the mid west of the United States to the rest of the world. From New York City these agricultural products could easily be shipped to other U.S. states or overseas. Assured of a market for their farm products the settlement of the U.S. mid-west was greatly accelerated by the Erie Canal. The profits generated by the Erie Canal project started a canal building boom in the United States that lasted until about 1850 when ": null
    },
    {
        "railroads": "Railroad"
    },
    {
        " started becoming seriously competitive in price and convenience. The ": null
    },
    {
        "Blackstone Canal": "Blackstone Canal"
    },
    {
        " in Massachusetts and ": null
    },
    {
        "Rhode Island": "Rhode Island"
    },
    {
        " fulfilled a similar role in the early industrial revolution between 1828 and 1848. The ": null
    },
    {
        "Blackstone Valley": "Blackstone Valley"
    },
    {
        " was a major contributor of the American Industrial Revolution where ": null
    },
    {
        "Samuel Slater": "Samuel Slater"
    },
    {
        " built his first textile mill.        ": null
    },
    {
        "Power canal": "Power Canal"
    },
    {
        "   A power canal refers to a canal used for ": null
    },
    {
        "hydraulic power": "Hydropower"
    },
    {
        " generation, rather than for transport. Nowadays power canals are built almost exclusively as parts of ": null
    },
    {
        "hydroelectric power stations": "Hydroelectric Power Station"
    },
    {
        ". Parts of the United States, particularly in the ": null
    },
    {
        "Northeast": "Northeastern United States"
    },
    {
        ", had enough fast-flowing rivers that ": null
    },
    {
        "water power": "Water Power"
    },
    {
        " was the primary means of powering factories until after the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        ". For example, ": null
    },
    {
        "Lowell, Massachusetts": "Lowell, Massachusetts"
    },
    {
        ", considered to be The Cradle of the American Industrial Revolution, has  of canals, built from around 1790 to 1850, that provided water power and a means of transportation for the city. The output of the system is estimated at 10,000 ": null
    },
    {
        "horsepower": "Horsepower"
    },
    {
        ".  Other cities with extensive power canal systems include ": null
    },
    {
        "Lawrence, Massachusetts": "Lawrence, Massachusetts"
    },
    {
        ", ": null
    },
    {
        "Holyoke, Massachusetts": "Holyoke, Massachusetts"
    },
    {
        ", ": null
    },
    {
        "Manchester, New Hampshire": "Manchester, New Hampshire"
    },
    {
        ", and ": null
    },
    {
        "Augusta, Georgia": "Augusta Canal"
    },
    {
        ". The most notable power canal was built in 1862 for the ": null
    },
    {
        "Niagara Falls Hydraulic Power and Manufacturing Company": "Niagara Falls Hydraulic Power And Manufacturing Company"
    },
    {
        ".             Competition, from railways from the 1830s and roads in the 20th century, made the smaller canals obsolete for most commercial transport, and many of the British canals fell into decay. Only the ": null
    },
    {
        "Manchester Ship Canal": "Manchester Ship Canal"
    },
    {
        " and the ": null
    },
    {
        "Aire and Calder Canal": "Aire And Calder Canal"
    },
    {
        " bucked this trend. Yet in other countries canals grew in size as construction techniques improved. During the 19th century in the US, the length of canals grew from  to over 4,000, with a complex network making the Great Lakes navigable, in conjunction with Canada, although some canals were later drained and used as railroad ": null
    },
    {
        "rights-of-way": "Right-Of-Way"
    },
    {
        ".     In the United States, navigable canals reached into isolated areas and brought them in touch with the world beyond. By 1825 the Erie Canal,  long with 36 locks, opened up a connection from the populated Northeast to the Great Lakes. Settlers flooded into regions serviced by such canals, since access to markets was available. The Erie Canal was instrumental in lowering the differences in commodity prices between these various markets across America. The canals caused price convergence between different regions because of their reduction in transportation costs, which allowed Americans to ship and buy goods from farther distances much cheaper. Ohio built many miles of canal, Indiana had working canals for a few decades, and the ": null
    },
    {
        "Illinois and Michigan Canal": "Illinois And Michigan Canal"
    },
    {
        " connected the Great Lakes to the ": null
    },
    {
        "Mississippi River": "Mississippi River"
    },
    {
        " system until replaced by a channelized river waterway.        Three major canals with very different purposes were built in what is now Canada. The first ": null
    },
    {
        "Welland Canal": "Welland Canal"
    },
    {
        ", which opened in 1829 between ": null
    },
    {
        "Lake Ontario": "Lake Ontario"
    },
    {
        " and Lake Erie, bypassing ": null
    },
    {
        "Niagara Falls": "Niagara Falls"
    },
    {
        " and the ": null
    },
    {
        "Lachine Canal": "Lachine Canal"
    },
    {
        " , which allowed ships to skirt the nearly impassable rapids on the ": null
    },
    {
        "St. Lawrence River": "St. Lawrence River"
    },
    {
        " at ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ", were built for commerce. The ": null
    },
    {
        "Rideau Canal": "Rideau Canal"
    },
    {
        ", completed in 1832, connects ": null
    },
    {
        "Ottawa": "Ottawa"
    },
    {
        " on the ": null
    },
    {
        "Ottawa River": "Ottawa River"
    },
    {
        " to ": null
    },
    {
        "Kingston, Ontario": "Kingston, Ontario"
    },
    {
        " on Lake Ontario. The Rideau Canal was built as a result of the War of 1812 to provide military transportation between the British colonies of ": null
    },
    {
        "Upper Canada": "Upper Canada"
    },
    {
        " and ": null
    },
    {
        "Lower Canada": "Lower Canada"
    },
    {
        " as an alternative to part of the St. Lawrence River, which was susceptible to blockade by the United States.        In France, a steady linking of all the river systems – ": null
    },
    {
        "Rhine": "Rhine"
    },
    {
        ", ": null
    },
    {
        "Rhône": "Rhône"
    },
    {
        ", ": null
    },
    {
        "Saône": "Saône"
    },
    {
        " and Seine – and the North Sea was boosted in 1879 by the establishment of the ": null
    },
    {
        "Freycinet gauge": "Freycinet Gauge"
    },
    {
        ", which specified the minimum size of locks. Canal traffic doubled in the first decades of the 20th century.      Many notable sea canals were completed in this period, starting with the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        " – which carries tonnage many times that of most other canals – and the ": null
    },
    {
        "Kiel Canal": "Kiel Canal"
    },
    {
        " , though the Panama Canal was not opened until 1914.     In the 19th century, a number of canals were built in Japan including the ": null
    },
    {
        "Biwako canal": "Biwako Canal"
    },
    {
        " and the ": null
    },
    {
        "Tone canal": "Tone Canal"
    },
    {
        ". These canals were partially built with the help of engineers from the Netherlands and other countries.      A major question was how to connect the Atlantic and the Pacific with a canal through narrow ": null
    },
    {
        "Central America": "Central America"
    },
    {
        ".  The original proposal was for a ": null
    },
    {
        "sea-level canal through what is today Nicaragua": "Nicaragua Canal"
    },
    {
        ", taking advantage of the relatively large ": null
    },
    {
        "Lake Nicaragua": "Lake Nicaragua"
    },
    {
        ". ": null
    },
    {
        "This canal has never been built in part because of political instability": "History Of The Nicaragua Canal"
    },
    {
        ", which scared off potential investors. It remains an active project , and in the 2010s Chinese involvement was developing.        The second choice for a Central American canal was a ": null
    },
    {
        "Panama canal": "Panama Canal"
    },
    {
        ". The ": null
    },
    {
        "De Lessups": "Suez Canal Company"
    },
    {
        " company, which ran the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        ", first attempted to build a Panama Canal in the 1880s. The difficulty of the terrain and weather encountered caused the company to go bankrupt. High worker mortality from disease also discouraged further investment in the project. DeLessups abandoned ": null
    },
    {
        "excavating equipment": "Excavator"
    },
    {
        " sits, isolated decaying machines, today tourist attractions.     Central Americans will inform you, should the topic come up, that Panama is not part of Central America. It is part of South America, because it was part of Columbia when the concept of Central America emerged, somewhere between 1600 and 1800. South America had a peninsula tip, that connected with Central America.     Twenty years later, an expansionist United States, that just acquired colonies after defeating Spain in the 1898 ": null
    },
    {
        "Spanish–American War": "Spanish–American War"
    },
    {
        ", and whose Navy became more important, decided to reactivate the project. The United States and Colombia did not reach agreement on the terms of a canal treaty . Panama, which did not have a land connection with the rest of Colombia, was already thinking of independence. In 1903 the United States, with support from Panamanians who expected the canal to provide substantial wages, revenues, and markets for local goods and services. transform the country, ": null
    },
    {
        "took Panama province away from Colombia": "Separation Of Panama From Colombia"
    },
    {
        ", and set up a ": null
    },
    {
        "puppet republic": "Puppet State"
    },
    {
        " . Its currency, the ": null
    },
    {
        "Balboa": "Panamanian Balboa"
    },
    {
        " — a name that suggests the country began as a way to get fom one hemisphere to the other — was a replica of the ": null
    },
    {
        "US dollar": "Us Dollar"
    },
    {
        ". The US dollar was and remains ": null
    },
    {
        "legal tender": "Legal Tender"
    },
    {
        " . A U.S. military zone, the ": null
    },
    {
        "Canal Zone": "Canal Zone"
    },
    {
        ",  wide, with U.S. military stationed there , split Panama in half. The Canal — a major engineering project — was built. The U.S. did not feel that conditions were stable enough to withdraw until 1979. The withdrawal fron Panama contributed to President ": null
    },
    {
        "Jimmy Carters": "Jimmy Carter"
    },
    {
        " defeat in 1980.          Large-scale ship canals such as the Panama Canal and Suez Canal continue to operate for cargo transportation, as do European barge canals. Due to ": null
    },
    {
        "globalization": "Globalization"
    },
    {
        ", they are becoming increasingly important, resulting in expansion projects such as the ": null
    },
    {
        "Panama Canal expansion project": "Panama Canal Expansion Project"
    },
    {
        ". The expanded canal began commercial operation on 26 June 2016. The new set of locks allow transit of larger, ": null
    },
    {
        "Post-Panamax": "Post-Panamax"
    },
    {
        " and ": null
    },
    {
        "New Panamax": "New Panamax"
    },
    {
        " ships.      The narrow early industrial canals, however, have ceased to carry significant amounts of trade and many have been abandoned to navigation, but may still be used as a system for transportation of untreated water. In some cases railways have been built along the canal route, an example being the ": null
    },
    {
        "Croydon Canal": "Croydon Canal"
    },
    {
        ".     A movement that began in Britain and France to use the early industrial canals for pleasure boats, such as ": null
    },
    {
        "hotel barges": "Hotel Barge"
    },
    {
        ", has spurred rehabilitation of stretches of historic canals. In some cases, abandoned canals such as the ": null
    },
    {
        "Kennet and Avon Canal": "Kennet And Avon Canal"
    },
    {
        " have been restored and are now used by pleasure boaters. In Britain, canalside housing has also proven popular in recent years.     The ": null
    },
    {
        "Seine–Nord Europe Canal": "Seine–Nord Europe Canal"
    },
    {
        " is being developed into a major transportation waterway, linking ": null
    },
    {
        "France": "France"
    },
    {
        " with ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        ", ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", and the Netherlands.     Canals have found another use in the 21st century, as ": null
    },
    {
        "easements": "Easement"
    },
    {
        " for the installation of ": null
    },
    {
        "fibre optic": "Fibre Optic"
    },
    {
        " telecommunications": "Telecommunications"
    },
    {
        " network cabling, avoiding having them buried in roadways while facilitating access and reducing the hazard of being damaged from digging equipment.     Canals are still used to provide water for agriculture. An extensive canal system exists within the ": null
    },
    {
        "Imperial Valley": "Imperial Valley"
    },
    {
        " in the Southern California desert to provide irrigation to agriculture within the area.                   Canals are so deeply identified with ": null
    },
    {
        "Venice": "Venice"
    },
    {
        " that many canal cities have been nicknamed  the Venice of… . The city is built on marshy islands, with wooden piles supporting the buildings, so that the land is man-made rather than the waterways. The islands have a long history of settlement; by the 12th century, Venice was a powerful ": null
    },
    {
        "city state": "City State"
    },
    {
        ".     ": null
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        " was built in a similar way, with buildings on wooden piles. It became a city around 1300. Many Amsterdam canals were built as part of fortifications. They became  gracht en when the city was enlarged and houses were built alongside the water.          Other cities with extensive canal networks include: ": null
    },
    {
        "Alkmaar": "Alkmaar"
    },
    {
        ", ": null
    },
    {
        "Amersfoort": "Amersfoort"
    },
    {
        ", ": null
    },
    {
        "Bolsward": "Bolsward"
    },
    {
        ", ": null
    },
    {
        "Brielle": "Brielle"
    },
    {
        ", ": null
    },
    {
        "Delft": "Delft"
    },
    {
        ", ": null
    },
    {
        "Den Bosch": "Den Bosch"
    },
    {
        ", ": null
    },
    {
        "Dokkum": "Dokkum"
    },
    {
        ", ": null
    },
    {
        "Dordrecht": "Dordrecht"
    },
    {
        ", ": null
    },
    {
        "Enkhuizen": "Enkhuizen"
    },
    {
        ", ": null
    },
    {
        "Franeker": "Franeker"
    },
    {
        ", ": null
    },
    {
        "Gouda": "Gouda, South Holland"
    },
    {
        ", ": null
    },
    {
        "Haarlem": "Haarlem"
    },
    {
        ", ": null
    },
    {
        "Harlingen": "Harlingen, Netherlands"
    },
    {
        ", ": null
    },
    {
        "Leeuwarden": "Leeuwarden"
    },
    {
        ", ": null
    },
    {
        "Leiden": "Leiden"
    },
    {
        ", ": null
    },
    {
        "Sneek": "Sneek"
    },
    {
        " and ": null
    },
    {
        "Utrecht": "Utrecht"
    },
    {
        " in the Netherlands; ": null
    },
    {
        "Brugge": "Bruges"
    },
    {
        " and ": null
    },
    {
        "Gent": "Ghent"
    },
    {
        " in Flanders, Belgium; ": null
    },
    {
        "Birmingham": "Birmingham"
    },
    {
        " in England; ": null
    },
    {
        "Saint Petersburg": "Saint Petersburg"
    },
    {
        " in Russia; ": null
    },
    {
        "Aveiro": "Aveiro, Portugal"
    },
    {
        " in Portugal; ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        " and ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        " in Germany; ": null
    },
    {
        "Fort Lauderdale": "Fort Lauderdale, Florida"
    },
    {
        " and ": null
    },
    {
        "Cape Coral": "Cape Coral, Florida"
    },
    {
        " in ": null
    },
    {
        "Florida": "Florida"
    },
    {
        ", United States and ": null
    },
    {
        "Lahore": "Lahore"
    },
    {
        " in Pakistan.     ": null
    },
    {
        "Liverpool Maritime Mercantile City": "Liverpool Maritime Mercantile City"
    },
    {
        " is a ": null
    },
    {
        "UNESCO World Heritage Site": "World Heritage Site"
    },
    {
        " near the centre of ": null
    },
    {
        "Liverpool": "Liverpool"
    },
    {
        ", England, where a system of intertwining waterways and docks is now being developed for mainly residential and leisure use.     Canal Estates are a form of ": null
    },
    {
        "subdivision": "Subdivision"
    },
    {
        " popular in cities like ": null
    },
    {
        "Miami, Florida": "Miami, Florida"
    },
    {
        ", ": null
    },
    {
        "Texas City, Texas": "Texas City, Texas"
    },
    {
        " and the ": null
    },
    {
        "Gold Coast, Queensland": "Gold Coast, Queensland"
    },
    {
        "; the Gold Coast has over 700  km of residential canals. ": null
    },
    {
        "Wetlands": "Wetlands"
    },
    {
        " are difficult areas upon which to build housing estates, so ": null
    },
    {
        "dredging": "Dredging"
    },
    {
        " part of the wetland down to a ": null
    },
    {
        "navigable": "Navigability"
    },
    {
        " channel provides fill to build up another part of the wetland above the flood level for houses. Land is built up in a finger pattern that provides a suburban street layout of waterfront housing blocks.          Inland canals have often had boats specifically built for them. An example of this is the British ": null
    },
    {
        "narrowboat": "Narrowboat"
    },
    {
        ", which is up to  long and  wide and was primarily built for British Midland canals. In this case the limiting factor was the size of the locks. This is also the limiting factor on the Panama canal where ": null
    },
    {
        "Panamax": "Panamax"
    },
    {
        " ships were limited to a length of  and a beam of  until 26 June 2016 when the opening of larger locks allowed for the passage of larger New Panamax ships. For the lockless Suez Canal the limiting factor for ": null
    },
    {
        "Suezmax": "Suezmax"
    },
    {
        " ships is generally draft, which is limited to . At the other end of the scale, tub-boat canals such as the ": null
    },
    {
        "Bude Canal": "Bude Canal"
    },
    {
        " were limited to boats of under 10 tons for much of their length due to the capacity of their inclined planes or boat lifts. Most canals have a limit on height imposed either by bridges or by tunnels.        Europe ": null
    },
    {
        "Canals of France": "List Of Canals In France"
    },
    {
        " Canals of Amsterdam": "Canals Of Amsterdam"
    },
    {
        " Canals of Germany": "List Of Canals In Germany"
    },
    {
        " Canals of Ireland": "Canals Of Ireland"
    },
    {
        " Canals of Russia": "List Of Canals In Russia"
    },
    {
        " Canals of the United Kingdom": "Canals Of The United Kingdom"
    },
    {
        " Great Bačka Canal": "Great Bačka Canal"
    },
    {
        "    North America ": null
    },
    {
        "Canals of Canada": "Canals Of Canada"
    },
    {
        " Canals of the United States": "List Of Canals In The United States"
    }
]