[
    {
        "                 A cardinal  is a leading ": null
    },
    {
        "bishop": "Bishop"
    },
    {
        " and ": null
    },
    {
        "prince": "Prince Of The Church"
    },
    {
        " of the ": null
    },
    {
        "College of Cardinals": "College Of Cardinals"
    },
    {
        " in the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        ". Their duties include participating in ": null
    },
    {
        "Papal consistories": "Papal Consistory"
    },
    {
        ", and ": null
    },
    {
        "Papal conclaves": "Papal Conclaves"
    },
    {
        " , when the ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        " is vacant. Most have additional missions, such as leading a ": null
    },
    {
        "diocese": "Diocese"
    },
    {
        " or a ": null
    },
    {
        "dicastery": "Dicastery"
    },
    {
        " of the ": null
    },
    {
        "Roman Curia": "Roman Curia"
    },
    {
        ", the equivalent of a government of the ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        ". During the  sede vacante  , the day-to-day governance of the Holy See is in the hands of the College of Cardinals. The right to enter the Papal conclave of cardinals where the pope is elected is limited to those who have not reached the age of 80 years by the day the vacancy occurs.     In 1059, the right of electing the pope was reserved to the principal clergy of Rome and the bishops of the seven ": null
    },
    {
        "suburbicarian sees": "Suburbicarian Diocese"
    },
    {
        ". In the 12th century the practice of appointing ecclesiastics from outside Rome as cardinals began, with each of them assigned a church in Rome as his ": null
    },
    {
        "titular church": "Titular Church"
    },
    {
        " or linked with one of the suburbicarian dioceses, while still being incardinated in a diocese other than that of Rome.     The term cardinal at one time applied to any priest permanently assigned or ": null
    },
    {
        "incardinated": "Incardinated"
    },
    {
        " to a church,  or specifically to the senior priest of an important church, based on the Latin cardo , meaning pivotal as in principal or chief . The term was applied in this sense as early as the 9th century to the priests of the tituli of the ": null
    },
    {
        "diocese of Rome": "Diocese Of Rome"
    },
    {
        ".               There is disagreement about the origin of the term, but the consensus that cardinalis from the word cardo was first used in late antiquity to designate a bishop or priest who was incorporated into a church for which he had not originally been ordained. In ": null
    },
    {
        "Rome": "Rome"
    },
    {
        " the first persons to be called cardinals were the deacons of the seven regions of the city at the beginning of the 6th century, when the word began to mean principal , eminent , or superior . The name was also given to the senior priest in each of the title churches of Rome and to the bishops of the seven sees surrounding the city. By the 8th century the Roman cardinals constituted a privileged class among the Roman clergy. They took part in the administration of the church of Rome and in the papal liturgy. By decree of ": null
    },
    {
        "a synod of 769": "Lateran Council"
    },
    {
        ", only a cardinal was eligible to become Bishop of Rome. Cardinals were granted the privilege of wearing the red hat by Pope ": null
    },
    {
        "Innocent IV": "Innocent Iv"
    },
    {
        " in 1244. Encyclopædia Britannica     In cities other than Rome, the name cardinal began to be applied to certain church men as a mark of honour. The earliest example of this occurs in a letter sent by ": null
    },
    {
        "Pope Zacharias": "Pope Zacharias"
    },
    {
        " in 747 to ": null
    },
    {
        "Pippin III": "Pippin Iii"
    },
    {
        " , ruler of the ": null
    },
    {
        "Franks": "Franks"
    },
    {
        ", in which Zacharias applied the title to the priests of ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " to distinguish them from country clergy. This meaning of the word spread rapidly, and from the 9th century various episcopal cities had a special class among the clergy known as cardinals. The use of the title was reserved for the cardinals of Rome in 1567 by ": null
    },
    {
        "Pius V": "Pius V"
    },
    {
        ".     In the year 1563 the Ecumenical Council of Trent, headed by Pope ": null
    },
    {
        "Pius IV": "Pius Iv"
    },
    {
        ", wrote about the importance of selecting good cardinals: nothing is more necessary to the Church of God than that the holy Roman pontiff apply that solicitude which by the duty of his office he owes the universal Church in a very special way by associating with himself as cardinals the most select persons only, and appoint to each church most eminently upright and competent shepherds; and this the more so, because our Lord ": null
    },
    {
        "Jesus Christ": "Jesus"
    },
    {
        " will require at his hands the blood of the sheep of Christ that perish through the evil government of shepherds who are negligent and forgetful of their office.      The earlier influence of temporal rulers, notably the French kings, reasserted itself through the influence of cardinals of certain nationalities or politically significant movements. Traditions even developed entitling certain monarchs, including those of Austria, Spain, and France, to nominate one of their trusted clerical subjects to be created cardinal, a so-called ": null
    },
    {
        "crown-cardinal": "Crown-Cardinal"
    },
    {
        " .      In ": null
    },
    {
        "early modern": "Early Modern Period"
    },
    {
        " times, cardinals often had important roles in secular affairs. In some cases, they took on powerful positions in government. In ": null
    },
    {
        "Henry VIIIs": "Henry Viii Of England"
    },
    {
        " England, his chief minister was for some time ": null
    },
    {
        "Cardinal Wolsey": "Thomas Wolsey"
    },
    {
        ". ": null
    },
    {
        "Cardinal Richelieus": "Cardinal Richelieu"
    },
    {
        " power was so great that he was for many years effectively the ruler of France. Henry Kitchell Webster, ": null
    },
    {
        "Hutton Webster": "Hutton Webster"
    },
    {
        ", Early European History, p. 604. Retrieved from . Richelieus successor was also a cardinal, ": null
    },
    {
        "Jules Mazarin": "Cardinal Mazarin"
    },
    {
        ". ": null
    },
    {
        "Guillaume Dubois": "Guillaume Dubois"
    },
    {
        " and ": null
    },
    {
        "André-Hercule de Fleury": "André-Hercule De Fleury"
    },
    {
        " complete the list of the four great cardinals to have ruled France. In Portugal, due to a succession crisis, one cardinal, ": null
    },
    {
        "Henry, King of Portugal": "Henry, King Of Portugal"
    },
    {
        ", was crowned king, the only example of a cardinal-king.     While the incumbents of some sees are regularly made cardinals, and some countries are entitled to at least one cardinal by ": null
    },
    {
        "concordate": "Concordate"
    },
    {
        " , no see carries an actual right to the cardinalate, not even if its bishop is a ": null
    },
    {
        "Patriarch": "Patriarchcatholicchurch"
    },
    {
        ".       In 1059, ": null
    },
    {
        "Pope Nicholas II": "Pope Nicholas Ii"
    },
    {
        " gave cardinals the right to elect the Bishop of Rome in the ": null
    },
    {
        "papal bull": "Papal Bull"
    },
    {
        "  In nomine Domini . For a time this power was assigned exclusively to the cardinal bishops, but in 1179 the ": null
    },
    {
        "Third Lateran Council": "Third Lateran Council"
    },
    {
        " restored the right to the whole body of cardinals.        In 1586 ": null
    },
    {
        "Pope Sixtus V": "Pope Sixtus V"
    },
    {
        " limited the number of cardinals to 70:  six cardinal bishops, 50 cardinal priests, and 14 cardinal deacons. ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        " exceeded that limit citing the need to staff Church offices.  In November 1970 in  Ingravescentem aetatem , ": null
    },
    {
        "Pope Paul VI": "Pope Paul Vi"
    },
    {
        " established that electors would be under the age of eighty years. When it took effect on 1 January 1971, it deprived twenty-five cardinals of the right to participate in a conclave.  In October 1975 in  Romano Pontifici eligendo , he set the maximum number of electors at 120, while establishing no limit on the overall size of the College.      Popes can ": null
    },
    {
        "set aside": "Dispensation"
    },
    {
        " church laws    and they have regularly brought the number of cardinals under the age of 80 to more than 120, twice reaching as high as 135 with ": null
    },
    {
        "Pope John Paul IIs consistories": "Cardinalscreatedbyjohnpaulii21February2001"
    },
    {
        " of February 2001  and October 2003. No more than 120 electors have ever participated in a ": null
    },
    {
        "conclave": "Papal Conclave"
    },
    {
        ", but most canon lawyers believe that if their number exceeded 120 they would all participate.       Pope Paul VI also increased the number of cardinal bishops by assigning that rank, in 1965, to patriarchs of the ": null
    },
    {
        "Eastern Catholic Churches": "Eastern Catholic Churches"
    },
    {
        " when named cardinals.   . In 2018, Pope Francis expanded the cardinal bishops of Roman title, because this had not been done despite recent decades expansion in the two lower orders of cardinals, besides having all 6 such cardinals being over the age limit for a conclave.          Each cardinal takes on a titular church, either a church in the city of Rome or one of the ": null
    },
    {
        "suburbicarian sees": "Suburbicarian Diocese"
    },
    {
        ". The only exception is for patriarchs of the Eastern Catholic Churches. Pope Paul VI., Motuproprio Ad Purpuratorum Patrum Collegium , par. II Nevertheless, cardinals possess no power of governance nor are they to intervene in any way in matters which pertain to the administration of goods, discipline, or the service of their titular churches. Code of Canon law: 357-1 They are allowed to celebrate Mass and hear confessions and lead visits and pilgrimages to their titular churches, in coordination with the staff of the church. They often support their churches monetarily, and many cardinals do keep in contact with the pastoral staffs of their titular churches. The term cardinal is from the latin word cardo meaning a hinge. Here it means a door , an example of synecdoche, a figure of speech whereby the part refers to the whole. The door is the address of the titular church from which the cardinal derives his membership of the Roman clergy, who elect the Pope.     The ": null
    },
    {
        "Dean of the College of Cardinals": "Dean Of The College Of Cardinals"
    },
    {
        " in addition to such a titular church also receives the ": null
    },
    {
        "titular bishopric of Ostia": "Bishop Of Ostia"
    },
    {
        ", the primary suburbicarian see. Cardinals governing a ": null
    },
    {
        "particular church": "Particular Church"
    },
    {
        " retain that church. Code of Canon law: 350       In 1630, ": null
    },
    {
        "Pope Urban VIII": "Pope Urban Viii"
    },
    {
        " decreed their title to be  Eminence   and decreed that their secular rank would equate to Prince, making them secondary only to the Pope and crowned monarchs.     In accordance with tradition, they sign by placing the title Cardinal  after their personal name and before their surname as, for instance, John Card Doe or, in ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ", Ioannes Card Doe . Some writers, such as James-Charles Noonan, Noonan, The Church Visible, p. 205 hold that, in the case of cardinals, the form used for signatures should be used also when referring to them in English. However, official sources, such as the ": null
    },
    {
        "Catholic News Service": "Catholic News Service"
    },
    {
        "  say that the correct form for referring to a cardinal in English is normally as Cardinal . This is the rule given also in stylebooks not associated with the church.    At first reference Cardinal John Doe. At subsequent references the cardinal or Doe  This style is also generally followed on the websites of the Holy See and ": null
    },
    {
        "episcopal conferences": "Episcopal Conference"
    },
    {
        ". The websites of  , and of the Episcopal Conferences in ,  ,   and the   agree with the stylebooks. The   uses both styles side by side. On diocesan sites, the John Cardinal Doe style is found on, for example, those of , , ,  , ,  ,  , ,  , , , and the Cardinal John Doe on, for example, those of , ,  ,  , , . Oriental Patriarchs who are created Cardinals customarily use Sanctae Ecclesiae Cardinalis as their full title, cfr. Klaus Ganzer, Kardinäle als Kirchenfürsten? in Stimmen der Zeit 2011, issue 5, pp. 313–323 probably because they do not belong to the Roman clergy.     The Cardinal order is used in the ": null
    },
    {
        "Latin": "Latin Language"
    },
    {
        " proclamation": "Habemus Papam"
    },
    {
        " of the election of a new pope by the cardinal protodeacon, if the new pope is a cardinal, as he has been since 1378.                 Cardinal bishops are the senior order of cardinals. Though in modern times the vast majority of cardinals are also ": null
    },
    {
        "bishops": "Bishop"
    },
    {
        " or ": null
    },
    {
        "archbishops": "Archbishops"
    },
    {
        ", few are cardinal bishops . For most of the second millennium there were six cardinal bishops, each presiding over one of the seven ": null
    },
    {
        "suburbicarian sees": "Suburbicarian Diocese"
    },
    {
        " around Rome: ": null
    },
    {
        "Ostia": "Bishop Of Ostia"
    },
    {
        ", ": null
    },
    {
        "Albano": "Roman Catholic Suburbicarian Diocese Of Albano"
    },
    {
        ", ": null
    },
    {
        "Porto and Santa Rufina": "Roman Catholic Suburbicarian Diocese Of Porto-Santa Rufina"
    },
    {
        ", ": null
    },
    {
        "Palestrina": "Roman Catholic Suburbicarian Diocese Of Palestrina"
    },
    {
        ", ": null
    },
    {
        "Sabina and Mentana": "Roman Catholic Suburbicarian Diocese Of Sabina-Poggio Mirteto"
    },
    {
        ", ": null
    },
    {
        "Frascati": "Roman Catholic Suburbicarian Diocese Of Frascati"
    },
    {
        ", and ": null
    },
    {
        "Velletri": "Roman Catholic Suburbicarian Diocese Of Velletri-Segni"
    },
    {
        ".  , p. 468 Velletri was united with Ostia from 1150 until 1914, when ": null
    },
    {
        "Pope Pius X": "Pope Pius X"
    },
    {
        " separated them again, but decreed that whichever cardinal bishop became ": null
    },
    {
        "Dean of the College of Cardinals": "Dean Of The College Of Cardinals"
    },
    {
        " would keep the suburbicarian see he already held, adding to it that of Ostia, with the result that there continued to be only six cardinal bishops. ;  ;  Since 1962, the cardinal bishops have only a ": null
    },
    {
        "titular": "Titular Church"
    },
    {
        " relationship with the suburbicarian sees, each of which is governed by a separate ": null
    },
    {
        "ordinary": "Ordinary"
    },
    {
        ".  In 1965, ": null
    },
    {
        "Pope Paul VI": "Pope Paul Vi"
    },
    {
        " decreed in his  motu proprio  Ad purpuratorum Patrum Collegium that ": null
    },
    {
        "patriarchs": "Patriarch"
    },
    {
        " of the ": null
    },
    {
        "Eastern Catholic Churches": "Eastern Catholic Churches"
    },
    {
        " who were named cardinals would also be cardinal bishops, ranking after the six cardinal bishops of the suburbicarian sees.   At the June 2018 consistory, it was announced that, corresponding to the expansion in cardinal priests and cardinal deacons in recent decades, there would be an expansion in cardinal bishops. Four cardinals were elevated to this rank by having their ": null
    },
    {
        "titular": "Titular Church"
    },
    {
        " churches and deaconries granted suburbicarian rank  pro hac vice  .   At the time of the announcement, all six cardinal bishops of suburbicarian see titles, as well as two of the three cardinal patriarchs, were non-electors because of having reached age 80.     The ": null
    },
    {
        "Dean of the College of Cardinals": "Dean Of The College Of Cardinals"
    },
    {
        ", the highest ranking cardinal, was formerly the longest serving cardinal bishop, but since 1965 is elected by the Latin Church cardinal bishops from among their number, subject to papal approval. Likewise the Vice-Dean, formerly the second longest serving, is also elected. Seniority of the remaining cardinal bishops is still by date of appointment to the rank. For a period ending in the mid-20th century, long-serving cardinal priests were entitled to fill vacancies that arose among the cardinal bishops, just as ": null
    },
    {
        "cardinal deacons": "Cardinal Deacon"
    },
    {
        " of ten years standing are still entitled to become cardinal priests.       Cardinal priests are the most numerous of the three orders of cardinals in the Catholic Church, ranking above the cardinal deacons and below the cardinal bishops.  Those who are named cardinal priests today are generally ": null
    },
    {
        "bishops": "Bishop"
    },
    {
        " of important ": null
    },
    {
        "dioceses": "Diocese"
    },
    {
        " throughout the world, though some hold ": null
    },
    {
        "Curial": "Roman Curia"
    },
    {
        " positions.     In modern times, the name cardinal priest is interpreted as meaning a cardinal who is of the order of priests. Originally, however, this referred to certain key priests of important churches of the Diocese of Rome, who were recognized as the cardinal priests, the important priests chosen by the pope to advise him in his duties as ": null
    },
    {
        "Bishop": "Bishop"
    },
    {
        " of ": null
    },
    {
        "Rome": "Diocese Of Rome"
    },
    {
        " . Certain clerics in many dioceses at the time, not just that of Rome, were said to be the key personnel—the term gradually became exclusive to Rome to indicate those entrusted with electing the bishop of Rome, the pope.        While the cardinalate has long been expanded beyond the Roman pastoral clergy and ": null
    },
    {
        "Roman Curia": "Roman Curia"
    },
    {
        ", every cardinal priest has a ": null
    },
    {
        "titular church": "Titular Church"
    },
    {
        " in Rome, though they may be bishops or archbishops elsewhere, just as cardinal bishops were given one of the ": null
    },
    {
        "suburbicarian dioceses": "Suburbicarian Diocese"
    },
    {
        " around Rome. ": null
    },
    {
        "Pope Paul VI": "Pope Paul Vi"
    },
    {
        " abolished all administrative rights cardinals had with regard to their titular churches, though the cardinals name and coat of arms are still posted in the church, and they are expected to celebrate mass and preach there if convenient when they are in Rome.     While the number of cardinals was small from the times of the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        " to the ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        ", and frequently smaller than the number of recognized churches entitled to a cardinal priest, in the 16th century the College expanded markedly. In 1587, ": null
    },
    {
        "Pope Sixtus V": "Pope Sixtus V"
    },
    {
        " sought to arrest this growth by fixing the maximum ": null
    },
    {
        "size of the College": "Size Of The College Of Cardinals"
    },
    {
        " at 70, including 50 cardinal priests, about twice the historical number. This limit was respected until 1958, and the list of titular churches modified only on rare occasions, generally when a building fell into disrepair. When ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        " abolished the limit, he began to add new churches to the list, which Popes ": null
    },
    {
        "Paul VI": "Pope Paul Vi"
    },
    {
        " and ": null
    },
    {
        "John Paul II": "Pope John Paul Ii"
    },
    {
        " continued to do. Today there are close to 150 titular churches, out of over 300 churches in Rome.     The cardinal who is the longest-serving member of the order of cardinal priests is titled cardinal protopriest . He had certain ceremonial duties in the conclave that have effectively ceased because he would generally have already reached age 80, at which cardinals are barred from the conclave. The current cardinal protopriest is ": null
    },
    {
        "Michael Michai Kitbunchu": "Michael Michai Kitbunchu"
    },
    {
        " of ": null
    },
    {
        "Thailand": "Thailand"
    },
    {
        ".       The cardinal deacons are the lowest-ranking cardinals. Cardinals elevated to the diaconal order are either officials of the ": null
    },
    {
        "Roman Curia": "Roman Curia"
    },
    {
        " or priests elevated after their 80th birthday. Bishops with diocesan responsibilities, however, are created cardinal priests.     Cardinal deacons derive originally from the seven deacons in the ": null
    },
    {
        "Papal Household": "Papal Household"
    },
    {
        " and the seven deacons who supervised the Churchs works in the districts of ": null
    },
    {
        "Rome": "Rome"
    },
    {
        " during the early Middle Ages, when church administration was effectively the government of Rome and provided all social services. Cardinal deacons are given title to one of these deaconries.     Cardinals elevated to the diaconal order are mainly officials of the ": null
    },
    {
        "Roman Curia": "Roman Curia"
    },
    {
        " holding various posts in the church administration. Their number and influence has varied through the years. While historically predominantly Italian the group has become much more internationally diverse in later years. While in 1939 about half were Italian by 1994 the number was reduced to one third. Their influence in the election of the Pope has been considered important, they are better informed and connected than the dislocated cardinals but their level of unity has been varied. Thomas J. Reese,  Inside the Vatican: The Politics and Organization of the Catholic Church, Harvard University Press, 1996 p. 92-93 Under the 1587 decree of ": null
    },
    {
        "Pope Sixtus V": "Pope Sixtus V"
    },
    {
        ", which fixed the maximum ": null
    },
    {
        "size of the College of Cardinals": "Size Of The College Of Cardinals"
    },
    {
        ", there were 14 cardinal deacons. Later the number increased. As late as 1939 almost half of the cardinals were members of the curia. Pius XII reduced this percentage to 24 percent. John XXIII brought it back up to 37 percent but Paul VI brought it down to 27 percent where John Paul II maintained this ratio.     As of 2005, there were over 50 churches recognized as cardinalatial deaconries, though there were only 30 cardinals of the order of deacons. Cardinal deacons have long enjoyed the right to opt for the order of cardinal priests  after they have been cardinal deacons for 10 years. They may on such elevation take a vacant ": null
    },
    {
        "title": "Titular Church"
    },
    {
        " or their diaconal church may be temporarily elevated to a cardinal priests title for that occasion. When elevated to cardinal priests, they take their precedence according to the day they were first made cardinal deacons .     When not celebrating Mass but still serving a liturgical function, such as the semiannual  Urbi et Orbi  ": null
    },
    {
        "papal blessing": "Papal Blessing"
    },
    {
        ", some Papal Masses and some events at Ecumenical Councils, cardinal deacons can be recognized by the ": null
    },
    {
        "dalmatics": "Dalmatic"
    },
    {
        " they would don with the simple white mitre .       The cardinal protodeacon is the senior cardinal deacon in order of appointment to the College of Cardinals. If he is a cardinal elector and participates in a conclave, he ": null
    },
    {
        "announces a new popes election": "Habemus Papam"
    },
    {
        " and name from the central balcony of ": null
    },
    {
        "St. Peters Basilica": "St. Peters Basilica"
    },
    {
        " in ": null
    },
    {
        "Vatican City": "Vatican City"
    },
    {
        ". The proto-deacon also bestows the pallium on the new pope and crowns him with the ": null
    },
    {
        "papal tiara": "Papal Tiara"
    },
    {
        ", though coronations have been discontinued since Pope John Paul I opted for a simpler papal inauguration ceremony in 1978. Acting in the place of the Roman Pontiff, he also confers the pallium upon ": null
    },
    {
        "metropolitan bishops": "Metropolitan Bishoproman Catholic"
    },
    {
        " or gives the pallium to their proxies.  The current cardinal protodeacon is ": null
    },
    {
        "Renato Raffaele Martino": "Renato Raffaele Martino"
    },
    {
        ".         ": null
    },
    {
        "Francesco Salesio Della Volpe": "Francesco Salesio Della Volpe"
    },
    {
        " ; announced election of ": null
    },
    {
        "Pope Benedict XV": "Pope Benedict Xv"
    },
    {
        "    Gaetano Bisleti": "Gaetano Bisleti"
    },
    {
        " ; announced election of ": null
    },
    {
        "Pope Pius XI": "Pope Pius Xi"
    },
    {
        "    Camillo Laurenti": "Camillo Laurenti"
    },
    {
        "   Camillo Caccia-Dominioni": "Camillo Caccia-Dominioni"
    },
    {
        " ; announced election of ": null
    },
    {
        "Pope Pius XII": "Pope Pius Xii"
    },
    {
        "    Nicola Canali": "Nicola Canali"
    },
    {
        " ; announced election of ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        "    Alfredo Ottaviani": "Alfredo Ottaviani"
    },
    {
        " ; announced election of ": null
    },
    {
        "Pope Paul VI": "Pope Paul Vi"
    },
    {
        "    Arcadio Larraona Saralegui": "Arcadio Larraona Saralegui"
    },
    {
        ", ": null
    },
    {
        "CMF": "Claretians"
    },
    {
        "   William Theodore Heard": "William Theodore Heard"
    },
    {
        "   Antonio Bacci": "Antonio Bacci"
    },
    {
        "   Michael Browne": "Michael Browne"
    },
    {
        ", ": null
    },
    {
        "OP": "Dominican Order"
    },
    {
        "   Federico Callori di Vignale": "Federico Callori Di Vignale"
    },
    {
        "   Charles Journet": "Charles Journet"
    },
    {
        "   Pericle Felici": "Pericle Felici"
    },
    {
        " ; announced elections of ": null
    },
    {
        "Pope John Paul I": "Pope John Paul I"
    },
    {
        "  and ": null
    },
    {
        "Pope John Paul II": "Pope John Paul Ii"
    },
    {
        "    Sergio Pignedoli": "Sergio Pignedoli"
    },
    {
        "   Umberto Mozzoni": "Umberto Mozzoni"
    },
    {
        "   Opilio Rossi": "Opilio Rossi"
    },
    {
        "   Giuseppe Caprio": "Giuseppe Caprio"
    },
    {
        "   Aurelio Sabattani": "Aurelio Sabattani"
    },
    {
        "   Duraisamy Simon Lourdusamy": "Duraisamy Simon Lourdusamy"
    },
    {
        "   Eduardo Martínez Somalo": "Eduardo Martínez Somalo"
    },
    {
        "   Pio Laghi": "Pio Laghi"
    },
    {
        "   Luigi Poggi": "Luigi Poggi"
    },
    {
        "   Jorge Medina Estévez": "Jorge Medina Estévez"
    },
    {
        " ; announced election of ": null
    },
    {
        "Pope Benedict XVI": "Pope Benedict Xvi"
    },
    {
        "    Darío Castrillón Hoyos": "Darío Castrillón Hoyos"
    },
    {
        "   Agostino Cacciavillan": "Agostino Cacciavillan"
    },
    {
        "   Jean-Louis Tauran": "Jean-Louis Tauran"
    },
    {
        " ; announced election of ": null
    },
    {
        "Pope Francis": "Pope Francis"
    },
    {
        "    Renato Raffaele Martino": "Renato Raffaele Martino"
    },
    {
        "      Ceased to be protodeacon upon being raised to the order of cardinal-priest   †Was protodeacon at time of death           The Cardinal ": null
    },
    {
        "Camerlengo of the Holy Roman Church": "Camerlengo Of The Holy Roman Church"
    },
    {
        ", assisted by the Vice-Camerlengo and the other prelates of the office known as the Apostolic Camera, has functions that in essence are limited to a period of  sede vacante  of the papacy. He is to collate information about the financial situation of all administrations dependent on the Holy See and present the results to the College of Cardinals, as they gather for the ": null
    },
    {
        "papal conclave": "Papal Conclave"
    },
    {
        ".           Until 1917, it was possible for someone who was not a priest, but only in ": null
    },
    {
        "minor orders": "Minor Orders"
    },
    {
        ", to become a cardinal , but they were enrolled only in the order of cardinal deacons. For example, in the 16th century, ": null
    },
    {
        "Reginald Pole": "Reginald Pole"
    },
    {
        " was a cardinal for 18 years before he was ordained a priest. In 1917 it was established that all cardinals, even cardinal deacons, had to be priests, Canon 232 §1 of the 1917 Code of Canon Law and, in 1962, ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        " set the norm that all cardinals be ordained as ": null
    },
    {
        "bishops": "Bishop"
    },
    {
        ", even if they are only priests at the time of appointment.   As a consequence of these two changes, canon 351 of the 1983 Code of Canon Law requires that a cardinal be at least in the order of ": null
    },
    {
        "priesthood": "Priesthood"
    },
    {
        " at his appointment, and that those who are not already bishops must receive episcopal consecration. Several cardinals aged over 80 or close to it when appointed have obtained ": null
    },
    {
        "dispensation": "Dispensation"
    },
    {
        " from the rule of having to be a bishop. These were all appointed cardinal-deacons, but ": null
    },
    {
        "Roberto Tucci": "Roberto Tucci"
    },
    {
        " and ": null
    },
    {
        "Albert Vanhoye": "Albert Vanhoye"
    },
    {
        " lived long enough to exercise the right of option and be promoted to the rank of cardinal-priest.     A cardinal who is not a bishop is still entitled to wear and use the episcopal vestments and other ": null
    },
    {
        "pontificalia": "Pontificalia"
    },
    {
        " . Even if not a bishop, any cardinal has both actual and honorary precedence over non-cardinal patriarchs, as well as the archbishops and bishops who are not cardinals, but he cannot perform the functions reserved solely to bishops, such as ": null
    },
    {
        "ordination": "Holy Orders"
    },
    {
        ". The prominent priests who since 1962 were not ordained bishops on their elevation to the cardinalate were over the age of 80 or near to it, and so no cardinal who was not a bishop has participated in recent ": null
    },
    {
        "papal conclaves": "Papal Conclave"
    },
    {
        ".          At various times, there have been cardinals who had only received ": null
    },
    {
        "first tonsure": "Tonsurewestern Christianity"
    },
    {
        " and ": null
    },
    {
        "minor orders": "Minor Orders"
    },
    {
        " but not yet been ": null
    },
    {
        "ordained": "Holy Orders"
    },
    {
        " as ": null
    },
    {
        "deacons": "Deacon"
    },
    {
        " or priests. Though ": null
    },
    {
        "clerics": "Clergy"
    },
    {
        ", they were inaccurately called ": null
    },
    {
        "lay cardinals": "Lay Cardinal"
    },
    {
        " . ": null
    },
    {
        "Teodolfo Mertel": "Teodolfo Mertel"
    },
    {
        " was among the last of the lay cardinals. When he died in 1899 he was the last surviving cardinal who was not at least ordained a priest. With the revision of the ": null
    },
    {
        "Code of Canon Law": "Code Of Canon Law"
    },
    {
        " promulgated in 1917 by ": null
    },
    {
        "Pope Benedict XV": "Pope Benedict Xv"
    },
    {
        ", only those who are already priests or bishops may be appointed cardinals.  of the 1917 Code of Canon Law Since the time of ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        " a priest who is appointed a cardinal must be consecrated a bishop, unless he obtains a dispensation. Cf.  of the 1983 Code of Canon Law     in pectore or secret cardinals   In addition to the named cardinals, the pope may name secret cardinals or cardinals  in pectore  . During the ": null
    },
    {
        "Western Schism": "Western Schism"
    },
    {
        ", many cardinals were created by the contending popes. Beginning with the reign of ": null
    },
    {
        "Pope Martin V": "Pope Martin V"
    },
    {
        ", cardinals were created without publishing their names until later, a practice termed creati et reservati in pectore.  A cardinal named in pectore is known only to the pope. In the modern era popes have named cardinals in pectore to protect them or their congregations from political reprisals. If conditions change, the pope makes the appointment public. The cardinal in question then ranks in precedence with those made cardinals at the time of his in pectore appointment. If a pope dies before revealing the identity of an in pectore cardinal, the persons status as cardinal expires. The last pope known to have named a cardinal in pectore is ": null
    },
    {
        "Pope John Paul II": "Pope John Paul Ii"
    },
    {
        ", who named four, including one whose identity was never revealed.        ": null
    },
    {
        "Cardinal Sarr": "Théodore-Adrien Sarr"
    },
    {
        " with a ": null
    },
    {
        "ferraiolo": "Ferraiolo"
    },
    {
        " Walter Kasper": "Walter Kasper"
    },
    {
        " and ": null
    },
    {
        "Godfried Danneels": "Godfried Danneels"
    },
    {
        " wearing their ": null
    },
    {
        "choir dress": "Choir Dress"
    },
    {
        "cassock": "Cassock"
    },
    {
        ", white ": null
    },
    {
        "rochet": "Rochet"
    },
    {
        " trimmed with ": null
    },
    {
        "lace": "Lace"
    },
    {
        ", scarlet ": null
    },
    {
        "mozetta": "Mozetta"
    },
    {
        ", scarlet ": null
    },
    {
        "biretta": "Biretta"
    },
    {
        " , and ": null
    },
    {
        "pectoral cross": "Pectoral Cross"
    },
    {
        " Cardinal Lacroix": "Gérald Lacroix"
    },
    {
        " wearing the ordinary dress of a cardinal: black cassock with scarlet ": null
    },
    {
        "piping": "Piping"
    },
    {
        " and buttons, scarlet ": null
    },
    {
        "fascia": "Fascia"
    },
    {
        " Cardinal Bertone": "Tarcisio Bertone"
    },
    {
        " in dress for hot tropical countries .       When in ": null
    },
    {
        "choir dress": "Choir Dress"
    },
    {
        ", a ": null
    },
    {
        "Latin Church": "Latin Church"
    },
    {
        " cardinal wears ": null
    },
    {
        "scarlet": "Scarlet"
    },
    {
        " garments—the blood-like red symbolizes a cardinals willingness to die for his faith.    Belfast Telegraph. Retrieved 1 June 2008. Quote: In a ceremony televised across the world cardinal-elect Sean Brady knelt before Pope Benedict XVI and pledged his allegiance to the Church before receiving his special red birretta—a symbol of a cardinals dignity and willingness to shed blood for the increase of the Christian faith. Excluding the ": null
    },
    {
        "rochet": "Rochet"
    },
    {
        "—which is always white—the scarlet garments include the ": null
    },
    {
        "cassock": "Cassock"
    },
    {
        ", ": null
    },
    {
        "mozzetta": "Mozzetta"
    },
    {
        ", and ": null
    },
    {
        "biretta": "Biretta"
    },
    {
        " . The biretta of a cardinal is distinctive not merely for its scarlet color, but also for the fact that it does not have a pompon or tassel on the top as do the birettas of other prelates. Until the 1460s, it was customary for cardinals to wear a ": null
    },
    {
        "violet": "Violet"
    },
    {
        " or ": null
    },
    {
        "blue": "Blue"
    },
    {
        " cape unless granted the privilege of wearing red when acting on papal business. His normal-wear cassock is black but has scarlet ": null
    },
    {
        "piping": "Piping"
    },
    {
        " and a scarlet ": null
    },
    {
        "fascia": "Fascia"
    },
    {
        " . Occasionally, a cardinal wears a scarlet  ferraiolo  which is a cape worn over the shoulders, tied at the neck in a bow by narrow strips of cloth in the front, without any trim or piping on it.  It is because of the scarlet color of cardinals vesture that the ": null
    },
    {
        "bird of the same name": "Cardinal"
    },
    {
        " has become known as such.     ": null
    },
    {
        "Eastern Catholic": "Eastern Catholic Churches"
    },
    {
        " cardinals continue to wear the normal dress appropriate to their liturgical tradition, though some may line their cassocks with scarlet and wear scarlet fascias, or in some cases, wear Eastern-style cassocks entirely of scarlet. Photograph of ": null
    },
    {
        "Josyf Slipyj": "Josyf Slipyj"
    },
    {
        ", ": null
    },
    {
        "Major Archbishop": "Major Archbishop"
    },
    {
        " of the ": null
    },
    {
        "Ukrainian Catholic Church": "Ukrainian Greek Catholic Church"
    },
    {
        " and Cardinal, wearing a galero on top of his red ": null
    },
    {
        "klobuk": "Klobuk"
    },
    {
        ". Retrieved from .     In previous times, at the ": null
    },
    {
        "consistory": "Papal Consistory"
    },
    {
        " at which the pope named a new cardinal, he would bestow upon him a distinctive wide-brimmed hat called a ": null
    },
    {
        "galero": "Galero"
    },
    {
        ". This custom was discontinued in 1969 and the investiture now takes place with the scarlet biretta. In ": null
    },
    {
        "ecclesiastical heraldry": "Ecclesiastical Heraldry"
    },
    {
        ", however, the scarlet galero is still displayed on the cardinals ": null
    },
    {
        "coat of arms": "Coat Of Arms"
    },
    {
        ". Cardinals had the right to display the galero in their cathedral, and when a cardinal died, it would be suspended from the ceiling above his tomb. Some cardinals will still have a galero made, even though it is not officially part of their apparel.     To symbolize their bond with the ": null
    },
    {
        "papacy": "Papacy"
    },
    {
        ", the pope gives each newly appointed cardinal a gold ring,  which is traditionally kissed by Catholics when greeting a cardinal . Before the new uniformity imposed by John Paul II, each cardinal was given a ring, the central piece of which was a gem, usually a sapphire, with the popes stemma engraved on the inside. . The new cardinal had to pay for the ring, in exchange for which he received the right to make his own Last Will and Testament. There is now no gemstone, and the pope chooses the image on the outside: under ": null
    },
    {
        "Pope Benedict XVI": "Pope Benedict Xvi"
    },
    {
        " it was a modern depiction of the crucifixion of Jesus, with ": null
    },
    {
        "Mary": "Virgin Mary"
    },
    {
        " and ": null
    },
    {
        "John": "John The Evangelist"
    },
    {
        " to each side. The ring includes the popes coat of arms on the inside.      Cardinals have in ": null
    },
    {
        "canon law": "Canon Law"
    },
    {
        " a privilege of forum : only the pope is competent to judge them in matters subject to ecclesiastical jurisdiction . The pope either decides the case himself or delegates the decision to a tribunal, usually one of the tribunals or congregations of the Roman Curia. Without such delegation, no ": null
    },
    {
        "ecclesiastical court": "Ecclesiastical Court"
    },
    {
        ", even the ": null
    },
    {
        "Roman Rota": "Roman Rota"
    },
    {
        ", is competent to judge a canon law case against a cardinal.  ": null
    }
]