[
    {
        "A castrato  is a ": null
    },
    {
        "type": "Voice Type"
    },
    {
        " of ": null
    },
    {
        "classical": "Classical Music"
    },
    {
        " male ": null
    },
    {
        "singing": "Singing"
    },
    {
        " voice": "Human Voice"
    },
    {
        " equivalent to that of a ": null
    },
    {
        "soprano": "Soprano"
    },
    {
        ", ": null
    },
    {
        "mezzo-soprano": "Mezzo-Soprano"
    },
    {
        ", or ": null
    },
    {
        "contralto": "Contralto"
    },
    {
        ". The voice is produced by ": null
    },
    {
        "castration": "Castration"
    },
    {
        " of the singer before ": null
    },
    {
        "puberty": "Puberty"
    },
    {
        ", or it occurs in one who, due to an ": null
    },
    {
        "endocrinological": "Endocrinology"
    },
    {
        " condition, never reaches ": null
    },
    {
        "sexual maturity": "Sexual Maturity"
    },
    {
        ".     Castration before puberty prevents a boys ": null
    },
    {
        "larynx": "Larynx"
    },
    {
        " from being transformed by the ": null
    },
    {
        "normal physiological events": "Voice Change"
    },
    {
        " of puberty. As a result, the ": null
    },
    {
        "vocal range": "Vocal Range"
    },
    {
        " of prepubescence is largely retained, and the voice develops into adulthood in a unique way. Prepubescent castration for this purpose diminished greatly in the late 18th century and was made illegal in the ": null
    },
    {
        "Papal states": "Papal States"
    },
    {
        ", the last to prohibit them, in 1870.     As the castratos body grew, his lack of testosterone meant that his ": null
    },
    {
        "epiphyses": "Epiphyses"
    },
    {
        " did not harden in the normal manner. Thus the limbs of the castrati often grew unusually long, as did the bones of their ": null
    },
    {
        "rib": "Rib"
    },
    {
        "s. This, combined with intensive training, gave them unrivalled ": null
    },
    {
        "lung-power": "Lung Capacity"
    },
    {
        " and breath capacity.   1998; 351: pp. 1877–80. Operating through small, child-sized ": null
    },
    {
        "vocal cords": "Vocal Cords"
    },
    {
        ", their voices were also extraordinarily flexible, and quite different from the equivalent adult female voice. Their vocal range was higher than that of the uncastrated adult male. Listening to the only surviving recordings of a castrato , one can hear that the lower part of the voice sounds like a super-high tenor, with a more ": null
    },
    {
        "falsetto": "Falsetto"
    },
    {
        "-like upper register above that.     Castrati were rarely referred to as such: in the 18th century, the ": null
    },
    {
        "euphemism": "Euphemism"
    },
    {
        "  musico   was much more generally used, although it usually carried derogatory implications; ": null
    },
    {
        "New Grove Dictionary of Opera": "New Grove Dictionary Of Opera"
    },
    {
        ", vol 3, p. 529, sv musico another synonym was evirato, literally meaning ": null
    },
    {
        "emasculated": "Emasculated"
    },
    {
        " . ": null
    },
    {
        "Eunuch": "Eunuch"
    },
    {
        " is a more general term since, historically, many eunuchs were castrated after puberty and thus the castration had no impact on their voices.               Castration as a means of subjugation, enslavement or other punishment has a very long history, dating back to ancient ": null
    },
    {
        "Sumer": "Sumer"
    },
    {
        ". In a Western context, eunuch singers are known to have existed from the early ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        ". In ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        " around 400 AD, the empress ": null
    },
    {
        "Aelia Eudoxia": "Aelia Eudoxia"
    },
    {
        " had a eunuch choir-master, Brison, who may have established the use of castrati in Byzantine choirs, though whether Brison himself was a singer and whether he had colleagues who were eunuch singers is not certain. By the 9th century, eunuch singers were well-known  and remained so until the sack of Constantinople by the Western forces of the ": null
    },
    {
        "Fourth Crusade": "Fourth Crusade"
    },
    {
        " in 1204. Their fate from then until their reappearance in Italy more than three hundred years later is not clear. It seems likely that the Spanish tradition of soprano falsettists may have hidden castrati. Much of Spain was under ": null
    },
    {
        "Muslim": "Muslim"
    },
    {
        " rulers during the Middle Ages, and castration had a history going back to the ancient Near East. Stereotypically, ": null
    },
    {
        "eunuchs": "Eunuch"
    },
    {
        " served as harem guards, but they were also valued as high-level political appointees since they could not start a dynasty which would threaten the ruler.       Castrati first appeared in Italy in the mid-16th century, though at first the terms describing them were not always clear. The phrase soprano maschio , which could also mean falsettist, occurs in the Due Dialoghi della Musica of Luigi Dentice, an Oratorian priest, published in Rome in 1553. On 9 November 1555 Cardinal ": null
    },
    {
        "Ippolito II dEste": "Ippolito Ii Deste"
    },
    {
        " , wrote to ": null
    },
    {
        "Guglielmo Gonzaga, Duke of Mantua": "Guglielmo I Gonzaga"
    },
    {
        " , that he has heard that the Duke was interested in his cantoretti and offered to send him two, so that he could choose one for his own service. This is a rare term but probably does equate to castrato. Sherr The Cardinals nephew, ": null
    },
    {
        "Alfonso II dEste, Duke of Ferrara": "Alfonso Ii, Duke Of Ferrara"
    },
    {
        ", was another early enthusiast, enquiring about castrati in 1556. There were certainly castrati in the ": null
    },
    {
        "Sistine Chapel": "Sistine Chapel"
    },
    {
        " choir in 1558, although not described as such: on 27 April of that year, Hernando Bustamante, a Spaniard from ": null
    },
    {
        "Palencia": "Palencia"
    },
    {
        ", was admitted . Surprisingly, considering the later French distaste for castrati they certainly existed in France at this time also, being known of in Paris, ": null
    },
    {
        "Orléans": "Orléans"
    },
    {
        ", Picardy and ": null
    },
    {
        "Normandy": "Normandy"
    },
    {
        ", though they were not abundant: the King of France himself had difficulty in obtaining them. By 1574, there were castrati in the Ducal court chapel at ": null
    },
    {
        "Munich": "Munich"
    },
    {
        ", where the ": null
    },
    {
        "Kapellmeister": "Kapellmeister"
    },
    {
        " was the famous ": null
    },
    {
        "Orlando di Lasso": "Orlando Di Lasso"
    },
    {
        ". In 1589, by the bull Cum pro nostro pastorali munere, ": null
    },
    {
        "Pope Sixtus V": "Pope Sixtus V"
    },
    {
        " re-organised the choir of ": null
    },
    {
        "St Peters, Rome": "St Peters, Rome"
    },
    {
        " specifically to include castrati. Milner, Anthony. . The Sacred Capons . Musical Times 114: 250–52 Thus the castrati came to supplant both boys and falsettists from the top line in such choirs. Women were banned by the Pauline dictum mulieres in ecclesiis taceant .          Although the castrato predates opera, there is some evidence that castrati had parts in the earliest operas. In the first performance of ": null
    },
    {
        "Monteverdis": "Monteverdi"
    },
    {
        "  Orfeo  , for example, they played subsidiary roles, including Speranza and that of Euridice. Although female roles were performed by castrati in some of the papal states, this was increasingly rare; by 1680, they had supplanted normal male voices in lead roles, and retained their position as primo uomo for about a hundred years; see Heriot, A: The Castrati in Opera , pp. 31 ff an Italian opera not featuring at least one renowned castrato in a lead part would be doomed to fail. Because of the popularity of Italian opera throughout 18th-century Europe , singers such as Ferri, ": null
    },
    {
        "Farinelli": "Farinelli"
    },
    {
        ", ": null
    },
    {
        "Senesino": "Senesino"
    },
    {
        " and ": null
    },
    {
        "Pacchierotti": "Gasparo Pacchierotti"
    },
    {
        " became the first operatic superstars, earning enormous fees and hysterical public adulation. Heriot chs. 1–3 passim The strictly hierarchical organisation of  opera seria  favoured their high voices as symbols of heroic virtue, though they were frequently mocked for their strange appearance and bad acting. In his 1755 Reflections upon theatrical expression in tragedy, Roger Pickering wrote:   Farinelli drew every Body to the Haymarket. What a Pipe! What Modulation! What Extasy to the Ear! But, Heavens! What Clumsiness! What Stupidity! What Offence to the Eye! Reader, if of the City, thou mayest probably have seen in the Fields of Islington or Mile-End or, If thou art in the environs of St James, thou must have observed in the Park with what Ease and Agility a cow, heavy with calf, has rose up at the command of the Milk-womans foot: thus from the mossy bank sprang the DIVINE FARINELLI. Pickering, R:  , p. 63   The means by which future singers were prepared could lead to premature death. To prevent the child from experiencing the intense pain of castration, many were inadvertently administered lethal doses of opium or some other narcotic, or were killed by overlong compression of the carotid artery in the neck . such procedures are described in DAncillon, as translated into English by Samber, R.: Eunuchism Displayd ... , pp. 15–16     During the 18th century itself, the music historian ": null
    },
    {
        "Charles Burney": "Charles Burney"
    },
    {
        " was sent from pillar to post in search of places where the operation was carried out:   I enquired throughout Italy at what place boys were chiefly qualified for singing by castration, but could get no certain intelligence. I was told at Milan that it was at Venice; at Venice that it was at Bologna; but at Bologna the fact was denied, and I was referred to Florence; from Florence to Rome, and from Rome I was sent to Naples  ... it is said that there are shops in Naples with this inscription: QUI SI CASTRANO RAGAZZI ; but I was utterly unable to see or hear of any such shops during my residence in that city. Scholes, P : Dr Burneys Musical Tours in Europe , vol. 1, p. 247     The training of the boys was rigorous. The regimen of one singing school in Rome consisted of one hour of singing difficult and awkward pieces, one hour practising trills, one hour practising ornamented passaggi, one hour of singing exercises in their teachers presence and in front of a mirror so as to avoid unnecessary movement of the body or facial grimaces, and one hour of literary study; all this, moreover, before lunch. After, half an hour would be devoted to musical theory, another to writing counterpoint, an hour copying down the same from dictation, and another hour of literary study. During the remainder of the day, the young castrati had to find time to practice their harpsichord playing, and to compose vocal music, either sacred or secular depending on their inclination. see Bontempi, G: Historia Musica , p. 170 This demanding schedule meant that, if sufficiently talented, they were able to make a debut in their mid-teens with a perfect technique and a voice of a flexibility and power no woman or ordinary male singer could match.        In the 1720s and 1730s, at the height of the craze for these voices, it has been estimated that upwards of 4,000 boys were castrated annually in the service of art. a claim first made in Pleasants, H., The Castrati , Stereo Review, July 1966, p. 38this was the case with ": null
    },
    {
        "Senesino": "Senesino"
    },
    {
        "e.g. ": null
    },
    {
        "Caffarelli": "Caffarelli"
    },
    {
        ", who was from a wealthy family: his grandmother gave him the income from two vineyards to pay for his studies Faustini-Fassini, E.: Gli astri maggiori del bel canto napoletano in Note darchivio 15, , p. 12 noble or otherwisetr. A. Machen, with additional tr. by A. Symons vol. 4c, ch. 10; available online at www.gutenberg.net Only a small percentage of boys castrated to preserve their voices had successful careers on the operatic stage; the better also-rans sang in cathedral or church choirs, but because of their marked appearance and the ban on their marrying, there was little room for them in society outside a musical context. for a general discussion of castrati in society, see Barbier, ch. 7     The castrati came in for a great amount of scurrilous and unkind abuse, and as their fame increased, so did the hatred of them. They were often castigated as malign creatures who lured men into homosexuality. There were homosexual castrati, as ": null
    },
    {
        "Casanovas": "Casanova"
    },
    {
        "accounts of 18th-century ": null
    },
    {
        "Italy": "Italy"
    },
    {
        " bear witness. He mentions meeting an abbé whom he took for a girl in disguise, only later discovering that she was a famous castrato. In Rome in 1762 he attended a performance at which the ": null
    },
    {
        "prima donna": "Prima Donna"
    },
    {
        " was a castrato, the favourite ": null
    },
    {
        "pathic": "Wikt:Pathic"
    },
    {
        " of ": null
    },
    {
        "Cardinal Borghese": "Scipione Borghese"
    },
    {
        ", who dined every evening with his protector. From his behaviour on stage it was obvious that he hoped to inspire the love of those who liked him as a man, and probably would not have done so as a woman . Angus Heriot, The Castrati in Opera, London, 1956; Ed Wayne Dynes, Encyclopedia of Homosexuality, New York, 1990          By the late 18th century, changes in operatic taste and social attitudes spelled the end for castrati. They lingered on past the end of the  ancien régime  , and two of their number, ": null
    },
    {
        "Pacchierotti": "Gaspare Pacchierotti"
    },
    {
        " and ": null
    },
    {
        "Crescentini": "Girolamo Crescentini"
    },
    {
        ", even entranced the iconoclastic Napoleon. The last great operatic castrato was ": null
    },
    {
        "Giovanni Battista Velluti": "Giovanni Velluti"
    },
    {
        " , who performed the last operatic castrato role ever written: Armando in  Il crociato in Egitto  by ": null
    },
    {
        "Meyerbeer": "Giacomo Meyerbeer"
    },
    {
        " . Soon after this they were replaced definitively as the first men of the operatic stage by a new breed of heroic tenor, as first incarnated by the Frenchman ": null
    },
    {
        "Gilbert-Louis Duprez": "Gilbert-Louis Duprez"
    },
    {
        ", the earliest so-called king of the high Cs . His successors have included such singers as ": null
    },
    {
        "Enrico Tamberlik": "Enrico Tamberlik"
    },
    {
        ", ": null
    },
    {
        "Jean de Reszke": "Jean De Reszke"
    },
    {
        ", ": null
    },
    {
        "Francesco Tamagno": "Francesco Tamagno"
    },
    {
        ", ": null
    },
    {
        "Enrico Caruso": "Enrico Caruso"
    },
    {
        ", ": null
    },
    {
        "Giovanni Martinelli": "Giovanni Martinelli"
    },
    {
        ", ": null
    },
    {
        "Beniamino Gigli": "Beniamino Gigli"
    },
    {
        ", ": null
    },
    {
        "Jussi Björling": "Jussi Björling"
    },
    {
        ", ": null
    },
    {
        "Franco Corelli": "Franco Corelli"
    },
    {
        " and ": null
    },
    {
        "Luciano Pavarotti": "Luciano Pavarotti"
    },
    {
        ", among others.     After the unification of Italy in 1861, castration for musical purposes was officially made illegal . In 1878, ": null
    },
    {
        "Pope Leo XIII": "Pope Leo Xiii"
    },
    {
        " prohibited the hiring of new castrati by the church: only in the Sistine Chapel and in other papal basilicas in Rome did a few castrati linger. A group photo of the Sistine Choir taken in 1898 shows that by then only six remained , and in 1902 a ruling was extracted from Pope Leo that no further castrati should be admitted. The official end to the castrati came on St. Cecilias Day, 22 November 1903, when the new pope, Pius X, issued his motu proprio, Tra le Sollecitudini , which contained this instruction: Whenever  ... it is desirable to employ the high voices of sopranos and contraltos, these parts must be taken by boys, according to the most ancient usage of the Church.     The last Sistine castrato to survive was ": null
    },
    {
        "Alessandro Moreschi": "Alessandro Moreschi"
    },
    {
        ", the only castrato to have made solo recordings. While an interesting historical record, these discs of his give us only a glimpse of the castrato voice – although he had been renowned as The Angel of Rome at the beginning of his career, some would say he was past his prime when the recordings were made in 1902 and 1904 and he never attempted to sing opera. Clapton, N.: Alessandro Moreschi and the World of the Castrato , pp. 197–216 The recording technology of the day was not of modern high quality. He retired officially in March 1913, and died in 1922.     The Catholic Churchs involvement in the castrato phenomenon has long been controversial, and there have recently been calls for it to issue an official apology for its role. As early as 1748, ": null
    },
    {
        "Pope Benedict XIV": "Pope Benedict Xiv"
    },
    {
        " tried to ban castrati from churches,  but such was their popularity at the time that he realised that doing so might result in a drastic decline in church attendance.       The rumours of another castrato sequestered in the Vatican for the personal delectation of the Pontiff until as recently as 1959 have been proven false. The singer in question was a pupil of Moreschis, Domenico Mancini, such a successful imitator of his teachers voice that even ": null
    },
    {
        "Lorenzo Perosi": "Lorenzo Perosi"
    },
    {
        ", Direttore Perpetuo of the Sistine Choir from 1898 to 1956 and a strenuous opponent of the practice of castrato singers, thought he was a castrato. Mancini was in fact a moderately skilful falsettist and professional ": null
    },
    {
        "double bass": "Double Bass"
    },
    {
        " player. Clapton, N.: Alessandro Moreschi and the World of the Castrato , pp. 180–81, 200       So-called natural or endocrinological castrati are born with ": null
    },
    {
        "hormonal": "Hormone"
    },
    {
        " anomalies, such as ": null
    },
    {
        "Klinefelters syndrome": "Klinefelters Syndrome"
    },
    {
        " and ": null
    },
    {
        "Kallmanns syndrome": "Kallmanns Syndrome"
    },
    {
        ", or have undergone unusual physical or medical events during their early lives that reproduce the vocal effects of castration without being castrated. Basically, a male can retain his child voice if it never changes during puberty. The retained voice can be the ": null
    },
    {
        "treble voice": "Treble Voice"
    },
    {
        " shared by both sexes in childhood and is the same as boy soprano voice. But as evidence shows, many castratos, such as Senesino and Caffarelli, were actually ": null
    },
    {
        "altos": "Alto"
    },
    {
        " – not sopranos.     ": null
    },
    {
        "Jimmy Scott": "Jimmy Scott"
    },
    {
        ", ": null
    },
    {
        "Robert Crowe": "Robert Crowe"
    },
    {
        " and ": null
    },
    {
        "Radu Marian": "Radu Marian"
    },
    {
        " are examples of this type of high male voice.  ": null
    },
    {
        "Michael Maniaci": "Michael Maniaci"
    },
    {
        " is somewhat different, in that he has no hormonal or other anomalies, but for some unknown reason, his voice did not break in the usual manner, leaving him still able to sing in the soprano register.  Other uncastrated male adults sing soprano, generally using some form of ": null
    },
    {
        "falsetto": "Falsetto"
    },
    {
        " but in a much higher range than most ": null
    },
    {
        "countertenor": "Countertenor"
    },
    {
        "s. Examples are ": null
    },
    {
        "Aris Christofellis": "Aris Christofellis"
    },
    {
        ",   Jörg Waschinski,  and Ghio Nannini.       However, it is believed the castrati possessed more of a tenorial chest register . F. Haböck, Die Gesangkunst der Kastraten, , pp. 10–15 Similar low-voiced singing can be heard from the ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " vocalist Jimmy Scott, whose range matches approximately that used by female ": null
    },
    {
        "blues": "Blues"
    },
    {
        " singers,.   High-pitched singer ": null
    },
    {
        "Jordan Smith": "Jordan Smith"
    },
    {
        " has demonstrated having more of a tenorial chest register.      Actor ": null
    },
    {
        "Chris Colfer": "Chris Colfer"
    },
    {
        " has ": null
    },
    {
        "soprano": "Soprano"
    },
    {
        " voice. Colfer has stated in interviews that when his voice began to change at puberty he sang in a high voice constantly in an effort to retain his range.  Actor and singer ": null
    },
    {
        "Alex Newell": "Alex Newell"
    },
    {
        " has soprano range. Voice actor ": null
    },
    {
        "Walter Tetley": "Walter Tetley"
    },
    {
        " may or may not have been a castrato; ": null
    },
    {
        "Bill Scott": "Bill Scott"
    },
    {
        ", a co-worker of Tetleys during their later work in television, once half-jokingly quipped that Tetleys mother had him fixed to protect the child stars voice-acting career. Tetley never personally divulged the exact reason for his condition, which left him with the voice of a preteen boy for his entire adult life.      Turkish popular singer ": null
    },
    {
        "Cem Adrian": "Cem Adrian"
    },
    {
        " has the ability to sing from bass to soprano, his vocal folds having been reported to be three times the average length.           ": null
    },
    {
        "Giovanni Bacchini": "Giovanni Bacchini"
    },
    {
        "   Loreto Vittori": "Loreto Vittori"
    },
    {
        "   Baldassare Ferri": "Baldassare Ferri"
    },
    {
        "   Atto Melani": "Atto Melani"
    },
    {
        "   Giuseppe Panici": "Giuseppe Panici"
    },
    {
        " Frosch, W.A. . The sopranos: post-op virtuosi . The FASEB Journal 20 : 475–79   ": null
    },
    {
        "Giovanni Grossi": "Giovanni Francesco Grossi"
    },
    {
        "   Pier Francesco Tosi": "Pier Francesco Tosi"
    },
    {
        "   Francesco Pistocchi   ": null
    },
    {
        "Matteo Sassano": "Matteo Sassano"
    },
    {
        "   Nicolo Grimaldi": "Nicolo Grimaldi"
    },
    {
        "   Antonio Bernacchi": "Antonio Bernacchi"
    },
    {
        "   Francesco Bernardi    ": null
    },
    {
        "Valentino Urbani": "Valentino Urbani"
    },
    {
        "   Giacinto Fontana": "Giacinto Fontana"
    },
    {
        "   Giovanni Carestini": "Giovanni Carestini"
    },
    {
        "   Carlo Broschi    ": null
    },
    {
        "Domenico Annibali": "Domenico Annibali"
    },
    {
        "   Gaetano Majorano    ": null
    },
    {
        "Felice Salimbeni": "Felice Salimbeni"
    },
    {
        "   Giaocchino Conti    ": null
    },
    {
        "Mariano Nicolini": "Mariano Nicolini"
    },
    {
        "   Giovanni Manzuoli": "Giovanni Manzuoli"
    },
    {
        "   Gaetano Guadagni": "Gaetano Guadagni"
    },
    {
        "   Antonio Albanese": "Antonio Albanese"
    },
    {
        "   Silvio Giorgetti": "Silvio Giorgetti"
    },
    {
        "   Giusto Fernando Tenducci": "Giusto Fernando Tenducci"
    },
    {
        "   Giuseppe Millico": "Giuseppe Millico"
    },
    {
        "   Gasparo Pacchierotti": "Gasparo Pacchierotti"
    },
    {
        "   Venanzio Rauzzini": "Venanzio Rauzzini"
    },
    {
        "   Luigi Marchesi": "Luigi Marchesi"
    },
    {
        "   Vincenzo dal Prato": "Vincenzo Dal Prato"
    },
    {
        "   Girolamo Crescentini": "Girolamo Crescentini"
    },
    {
        "   Giovanni Battista Giambattista Velluti": "Giovanni Velluti"
    },
    {
        "   Domenico Mustafà": "Domenico Mustafà"
    },
    {
        "   Domenico Salvatori": "Domenico Salvatori"
    },
    {
        "   Alessandro Moreschi": "Alessandro Moreschi"
    }
]