[
    {
        "                       In ": null
    },
    {
        "physics": "Physics"
    },
    {
        " and ": null
    },
    {
        "geometry": "Geometry"
    },
    {
        ", a catenary  is the ": null
    },
    {
        "curve": "Curve"
    },
    {
        " that an idealized hanging ": null
    },
    {
        "chain": "Chain"
    },
    {
        " or ": null
    },
    {
        "cable": "Wire Rope"
    },
    {
        " assumes under its own ": null
    },
    {
        "weight": "Weight"
    },
    {
        " when supported only at its ends.     The catenary curve has a U-like shape, superficially similar in appearance to a ": null
    },
    {
        "parabolic arch": "Parabolic Arch"
    },
    {
        ", but it is not a ": null
    },
    {
        "parabola": "Parabola"
    },
    {
        ".     The curve appears in the design of certain types of ": null
    },
    {
        "arch": "Catenary Arch"
    },
    {
        "es and as a cross section of the ": null
    },
    {
        "catenoid": "Catenoid"
    },
    {
        "—the shape assumed by a soap film bounded by two parallel circular rings.     The catenary is also called the alysoid, chainette, ": null
    },
    {
        "MathWorld": "Mathworld"
    },
    {
        " or, particularly in the materials sciences, funicular. e.g.     Mathematically, the catenary curve is the ": null
    },
    {
        "graph": "Graph Of A Function"
    },
    {
        " of the ": null
    },
    {
        "hyperbolic cosine": "Hyperbolic Cosine"
    },
    {
        " function. The ": null
    },
    {
        "surface of revolution": "Surface Of Revolution"
    },
    {
        " of the catenary curve, the ": null
    },
    {
        "catenoid": "Catenoid"
    },
    {
        ", is a ": null
    },
    {
        "minimal surface": "Minimal Surface"
    },
    {
        ", specifically a ": null
    },
    {
        "minimal surface of revolution": "Minimal Surface Of Revolution"
    },
    {
        ". A hanging chain will assume a shape of least potential energy which is a catenary.  The mathematical properties of the catenary curve were first studied by ": null
    },
    {
        "Robert Hooke": "Robert Hooke"
    },
    {
        " in the 1670s, and its equation was derived by ": null
    },
    {
        "Leibniz": "Leibniz"
    },
    {
        ", ": null
    },
    {
        "Huygens": "Christiaan Huygens"
    },
    {
        " and ": null
    },
    {
        "Johann Bernoulli": "Johann Bernoulli"
    },
    {
        " in 1691.     Catenaries and related curves are used in architecture and engineering, in the design of bridges and ": null
    },
    {
        "arches": "Catenary Arch"
    },
    {
        ", so that forces do not result in bending moments. In the offshore oil and gas industry, catenary refers to a ": null
    },
    {
        "steel catenary riser": "Steel Catenary Riser"
    },
    {
        ", a pipeline suspended between a production platform and the seabed that adopts an approximate catenary shape. In the rail industry it refers to the overhead wiring which transfers power to trains due to the curve of the supporting cable.     In optics and electromagnetics, the hyperbolic cosine and sine functions are basic solutions to Maxwells equations.  The symmetric modes consisting of two ": null
    },
    {
        "evanescent waves": "Evanescent Waves"
    },
    {
        " would form a catenary shape.               The word catenary is derived from the Latin word catēna, which means ": null
    },
    {
        "chain": "Chain"
    },
    {
        " . The English word catenary is usually attributed to ": null
    },
    {
        "Thomas Jefferson": "Thomas Jefferson"
    },
    {
        ",     who wrote in a letter to ": null
    },
    {
        "Thomas Paine": "Thomas Paine"
    },
    {
        " on the construction of an arch for a bridge:          It is often said that ": null
    },
    {
        "Galileo": "Galileo Galilei"
    },
    {
        " thought the curve of a hanging chain was parabolic. In his  Two New Sciences  , Galileo says that a hanging cord is an approximate parabola, and he correctly observes that this approximation improves as the curvature gets smaller and is almost exact when the elevation is less than 45°.  That the curve followed by a chain is not a parabola was proven by ": null
    },
    {
        "Joachim Jungius": "Joachim Jungius"
    },
    {
        " ; this result was published posthumously in 1669. ": null
    },
    {
        "Lockwood": "Lockwood"
    },
    {
        " p. 124     The application of the catenary to the construction of arches is attributed to ": null
    },
    {
        "Robert Hooke": "Robert Hooke"
    },
    {
        ", whose true mathematical and mechanical form in the context of the rebuilding of ": null
    },
    {
        "St Pauls Cathedral": "St Pauls Cathedral"
    },
    {
        " alluded to a catenary.  Some much older arches approximate catenaries, an example of which is the Arch of ": null
    },
    {
        "Taq-i Kisra": "Taq-I Kisra"
    },
    {
        " in ": null
    },
    {
        "Ctesiphon": "Ctesiphon"
    },
    {
        ".      In 1671, Hooke announced to the ": null
    },
    {
        "Royal Society": "Royal Society"
    },
    {
        " that he had solved the problem of the optimal shape of an arch, and in 1675 published an encrypted solution as a Latin ": null
    },
    {
        "anagram": "Anagram"
    },
    {
        " cf.": "Cf."
    },
    {
        " the anagram for ": null
    },
    {
        "Hookes law": "Hookes Law"
    },
    {
        ", which appeared in the next paragraph. in an appendix to his Description of Helioscopes,  where he wrote that he had found a true mathematical and mechanical form of all manner of Arches for Building. He did not publish the solution to this anagram The original anagram was abcccddeeeeefggiiiiiiiillmmmmnnnnnooprrsssttttttuuuuuuuuxut pendet continuum flexile, sic stabit contiguum rigidum inversum, meaning As hangs a flexible cable so, inverted, stand the touching pieces of an arch.     In 1691, ": null
    },
    {
        "Gottfried Leibniz": "Gottfried Leibniz"
    },
    {
        ", ": null
    },
    {
        "Christiaan Huygens": "Christiaan Huygens"
    },
    {
        ", and ": null
    },
    {
        "Johann Bernoulli": "Johann Bernoulli"
    },
    {
        " derived the ": null
    },
    {
        "equation": "Equation"
    },
    {
        " in response to a challenge by ": null
    },
    {
        "Jakob Bernoulli": "Jakob Bernoulli"
    },
    {
        "; their solutions were published in the  Acta Eruditorum  for June 1691.   ": null
    },
    {
        "David Gregory": "David Gregory"
    },
    {
        " wrote a treatise on the catenary in 1697  in which he provided an incorrect derivation of the correct differential equation.     ": null
    },
    {
        "Euler": "Euler"
    },
    {
        " proved in 1744 that the catenary is the curve which, when rotated about the -axis, gives the surface of minimum ": null
    },
    {
        "surface area": "Surface Area"
    },
    {
        "  for the given bounding circles. ": null
    },
    {
        "Nicolas Fuss": "Nicolas Fuss"
    },
    {
        " gave equations describing the equilibrium of a chain under any ": null
    },
    {
        "force": "Force"
    },
    {
        " in 1796. ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " Art. 455, footnote          ": null
    },
    {
        "Catenary arches": "Catenary Arches"
    },
    {
        " are often used in the construction of ": null
    },
    {
        "kilns": "Kiln"
    },
    {
        ". To create the desired curve, the shape of a hanging chain of the desired dimensions is transferred to a form which is then used as a guide for the placement of bricks or other building material.         The ": null
    },
    {
        "Gateway Arch": "Gateway Arch"
    },
    {
        " in ": null
    },
    {
        "St. Louis, Missouri": "St. Louis, Missouri"
    },
    {
        ", United States is sometimes said to be an catenary, but this is incorrect.  It is close to a more general curve called a flattened catenary, with equation , which is a catenary if . While a catenary is the ideal shape for a freestanding arch of constant thickness, the Gateway Arch is narrower near the top. According to the U.S. ": null
    },
    {
        "National Historic Landmark": "National Historic Landmark"
    },
    {
        " nomination for the arch, it is a ": null
    },
    {
        "weighted catenary": "Weighted Catenary"
    },
    {
        " instead. Its shape corresponds to the shape that a weighted chain, having lighter links in the middle, would form.   and     arches under the roof of ": null
    },
    {
        "Gaudís": "Gaudí"
    },
    {
        "  Casa Milà , ": null
    },
    {
        "Barcelona": "Barcelona"
    },
    {
        " Sheffield Winter Garden": "Sheffield Winter Garden"
    },
    {
        " is enclosed by a series of ": null
    },
    {
        "catenary arches": "Catenary Arches"
    },
    {
        ".  ": null
    },
    {
        "Gateway Arch": "Gateway Arch"
    },
    {
        " Keleti Railway Station": "Budapest Keleti Railway Station"
    },
    {
        "                In free-hanging chains, the force exerted is uniform with respect to length of the chain, and so the chain follows the catenary curve.  The same is true of a ": null
    },
    {
        "simple suspension bridge": "Simple Suspension Bridge"
    },
    {
        " or catenary bridge, where the roadway follows the cable.       A ": null
    },
    {
        "stressed ribbon bridge": "Stressed Ribbon Bridge"
    },
    {
        " is a more sophisticated structure with the same catenary shape.       However, in a ": null
    },
    {
        "suspension bridge": "Suspension Bridge"
    },
    {
        " with a suspended roadway, the chains or cables support the weight of the bridge, and so do not hang freely. In most cases the roadway is flat, so when the weight of the cable is negligible compared with the weight being supported, the force exerted is uniform with respect to horizontal distance, and the result is a ": null
    },
    {
        "parabola": "Parabolic Arch"
    },
    {
        ", as discussed below . If the cable is heavy then the resulting curve is between a catenary and a parabola. ": null
    },
    {
        "Lockwood": "Lockwood"
    },
    {
        " p. 122                The catenary produced by gravity provides an advantage to heavy ": null
    },
    {
        "anchor rodes": "Wikt:Rodenoun"
    },
    {
        ". An anchor rode usually consists of chain or cable or both. Anchor rodes are used by ships, oil rigs, docks, ": null
    },
    {
        "floating wind turbines": "Floating Wind Turbine"
    },
    {
        ", and other marine equipment which must be anchored to the seabed.     When the rode is slack, the catenary curve presents a lower angle of pull on the ": null
    },
    {
        "anchor": "Anchor"
    },
    {
        " or mooring device than would be the case if it were nearly straight. This enhances the performance of the anchor and raises the level of force it will resist before dragging. To maintain the catenary shape in the presence of wind, a heavy chain is needed, so that only larger ships in deeper water can rely on this effect. Smaller boats also rely on catenary to maintain maximum holding power.                    The equation of a catenary in ": null
    },
    {
        "Cartesian coordinates": "Cartesian Coordinate System"
    },
    {
        " has the form     : y a           where  is the ": null
    },
    {
        "hyperbolic cosine function": "Hyperbolic Function"
    },
    {
        ", and where  is measured from the lowest point.  All catenary curves are ": null
    },
    {
        "similar": "Similarity"
    },
    {
        " to each other; changing the ": null
    },
    {
        "parameter": "Parameter"
    },
    {
        "  is equivalent to a uniform ": null
    },
    {
        "scaling": "Scaling"
    },
    {
        " of the curve.      The ": null
    },
    {
        "Whewell equation": "Whewell Equation"
    },
    {
        " for the catenary is     :           Differentiating gives     :         and eliminating  gives the ": null
    },
    {
        "Cesàro equation": "Cesàro Equation"
    },
    {
        " MathWorld": "Mathworld"
    },
    {
        ", eq. 7     :       The ": null
    },
    {
        "radius of curvature": "Osculating Circle"
    },
    {
        " is then     :   a         which is the length of the ": null
    },
    {
        "line normal to the curve": "Tangentnormal Line To A Curve"
    },
    {
        " between it and the -axis. ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " Art. 444       When a ": null
    },
    {
        "parabola": "Parabola"
    },
    {
        " is rolled along a straight line, the ": null
    },
    {
        "roulette": "Roulette"
    },
    {
        " curve traced by its ": null
    },
    {
        "focus": "Conic Sectioneccentricity, Focus And Directrix"
    },
    {
        " is a catenary. The ": null
    },
    {
        "envelope": "Envelope"
    },
    {
        " of the ": null
    },
    {
        "directrix": "Conic Sectioneccentricity, Focus And Directrix"
    },
    {
        " of the parabola is also a catenary. Yates p. 80 The ": null
    },
    {
        "involute": "Involute"
    },
    {
        " from the vertex, that is the roulette formed traced by a point starting at the vertex when a line is rolled on a catenary, is the ": null
    },
    {
        "tractrix": "Tractrix"
    },
    {
        ".     Another roulette, formed by rolling a line on a catenary, is another line. This implies that ": null
    },
    {
        "square wheels": "Square Wheel"
    },
    {
        " can roll perfectly smoothly on a road made of a series of bumps in the shape of an inverted catenary curve. The wheels can be any ": null
    },
    {
        "regular polygon": "Regular Polygon"
    },
    {
        " except a triangle, but the catenary must have parameters corresponding to the shape and dimensions of the wheels.          Over any horizontal interval, the ratio of the area under the catenary to its length equals , independent of the interval selected. The catenary is the only plane curve other than a horizontal line with this property. Also, the geometric centroid of the area under a stretch of catenary is the midpoint of the perpendicular segment connecting the centroid of the curve itself and the -axis.        A moving ": null
    },
    {
        "charge": "Electric Charge"
    },
    {
        " in a uniform ": null
    },
    {
        "electric field": "Electric Field"
    },
    {
        " travels along a catenary .      The ": null
    },
    {
        "surface of revolution": "Surface Of Revolution"
    },
    {
        " with fixed radii at either end that has minimum surface area is a catenary revolved about the -axis.            In the ": null
    },
    {
        "mathematical model": "Mathematical Model"
    },
    {
        " the chain is idealized by assuming that it is so thin that it can be regarded as a ": null
    },
    {
        "curve": "Curve"
    },
    {
        " and that it is so flexible any force of ": null
    },
    {
        "tension": "Tension"
    },
    {
        " exerted by the chain is parallel to the chain. ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " Art. 442, p. 316 The analysis of the curve for an optimal arch is similar except that the forces of tension become forces of ": null
    },
    {
        "compression": "Compression"
    },
    {
        " and everything is inverted.    An underlying principle is that the chain may be considered a rigid body once it has attained equilibrium. ": null
    },
    {
        "Whewell": "Whewell"
    },
    {
        " p. 65 Equations which define the shape of the curve and the tension of the chain at each point may be derived by a careful inspection of the various forces acting on a segment using the fact that these forces must be in balance if the chain is in ": null
    },
    {
        "static equilibrium": "Static Equilibrium"
    },
    {
        ".     Let the path followed by the chain be given ": null
    },
    {
        "parametrically": "Parametric Equations"
    },
    {
        " by  where  represents ": null
    },
    {
        "arc length": "Arc Length"
    },
    {
        " and  is the ": null
    },
    {
        "position vector": "Position Vector"
    },
    {
        ". This is the ": null
    },
    {
        "natural parameterization": "Unit Speed Parametrization"
    },
    {
        " and has the property that     :       where  is a ": null
    },
    {
        "unit tangent vector": "Unit Tangent Vector"
    },
    {
        ".        A ": null
    },
    {
        "differential equation": "Differential Equation"
    },
    {
        " for the curve may be derived as follows. Following ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " Art. 443 p. 316 Let  be the lowest point on the chain, called the vertex of the catenary. ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " Art. 443 p. 317 The slope  of the curve is zero at C since it is a minimum point. Assume  is to the right of  since the other case is implied by symmetry. The forces acting on the section of the chain from c to r are the tension of the chain at , the tension of the chain at r, and the weight of the chain. The tension at  is tangent to the curve at  and is therefore horizontal without any vertical component and it pulls the section to the left so it may be written  where  is the magnitude of the force. The tension at  is parallel to the curve at  and pulls the section to the right. The tension at  can be split into two components so it may be written , where  is the magnitude of the force and  is the angle between the curve at  and the -axis . Finally, the weight of the chain is represented by  where  is the mass per unit length,  is the acceleration of gravity and  is the length of the segment of chain between  and .     The chain is in equilibrium so the sum of three forces is , therefore     : T     T0   and   : T       gs      and dividing these gives     :           It is convenient to write     : a       which is the length of chain whose weight on Earth is equal in magnitude to the tension at . ": null
    },
    {
        "Whewell": "Whewell"
    },
    {
        " p. 67 Then     :       is an equation defining the curve.     The horizontal component of the tension,  is constant and the vertical component of the tension,  is proportional to the length of chain between the  and the vertex.       The differential equation given above can be solved to produce equations for the curve. Following ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " Art. 443 p/ 317     From     :         the formula for ": null
    },
    {
        "arc length": "Arc Lengthfinding Arc Lengths By Integrating"
    },
    {
        " gives   :           Then     :           and     :           The second of these equations can be integrated to give     : y   +       and by shifting the position of the -axis,  can be taken to be 0. Then     : y   y2a2+s2      The -axis thus chosen is called the directrix of the catenary.     It follows that the magnitude of the tension at a point  is , which is proportional to the distance between the point and the directrix. ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " Art. 443 p. 318     The integral of the expression for  can be found using ": null
    },
    {
        "standard techniques": "List Of Integrals Of Irrational Functions"
    },
    {
        ", giving Use of hyperbolic functions follows Maurer p. 107     : x a  +       and, again, by shifting the position of the -axis,  can be taken to be 0. Then     : x a  sa       The -axis thus chosen passes through the vertex and is called the axis of the catenary.     These results can be used to eliminate  giving     : y a         The differential equation can be solved using a different approach. Following Lamb p. 342 From     : s a         it follows that     :         a     a       and   :         a     a             Integrating gives,     : x a   +     and   : y a     +       As before, the  and -axes can be shifted so  and  can be taken to be 0. Then     :     +     e    and taking the reciprocal of both sides   :     -     e      Adding and subtracting the last two equations then gives the solution   : y a     a     and   : s a     a         In general the parameter  is the position of the axis. The equation can be determined in this case as follows: Following Todhunter Art. 186   Relabel if necessary so that  is to the left of  and let  be the horizontal and  be the vertical distance from  to . ": null
    },
    {
        "Translate": "Translation"
    },
    {
        " the axes so that the vertex of the catenary lies on the -axis and its height  is adjusted so the catenary satisfies the standard equation of the curve     : y a       and let the coordinates of  and  be  and  respectively. The curve passes through these points, so the difference of height is     : v a   - a       and the length of the curve from  to  is     : s a   - a       When  is expanded using these expressions the result is     : s2-v22a2    so   :       This is a transcendental equation in  and must be solved ": null
    },
    {
        "numerically": "Numerical Analysis"
    },
    {
        ". It can be shown with the methods of calculus See ": null
    },
    {
        "Routh": "Routh"
    },
    {
        " art. 447 that there is at most one solution with  ref  /ref  math /math  math /math math /math math /math math /math  math /math  ref  /ref  math /math math /math ref  /ref  ref  /ref math /math math /math math /math math /math  math /math  math /math  ref  /ref  math /math  ref  /ref  ref  /ref math /math ref  /ref math /math math /math math /math  math /math math /math math /math math /math math /math math /math math /math math /math  math /math math /math  ref  /ref  math /math  math /math  math /math ": null
    }
]