[
    {
        "In the field of ": null
    },
    {
        "complex analysis": "Complex Analysis"
    },
    {
        " in ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", the Cauchy–Riemann equations, named after ": null
    },
    {
        "Augustin Cauchy": "Augustin Louis Cauchy"
    },
    {
        " and ": null
    },
    {
        "Bernhard Riemann": "Bernhard Riemann"
    },
    {
        ", consist of a system of two ": null
    },
    {
        "partial differential equations": "Partial Differential Equation"
    },
    {
        " which, together with certain continuity and differentiability criteria, form a necessary and sufficient condition for a ": null
    },
    {
        "complex function": "Complex Function"
    },
    {
        " to be ": null
    },
    {
        "complex differentiable": "Complex Differentiable"
    },
    {
        ", that is, ": null
    },
    {
        "holomorphic": "Holomorphic Function"
    },
    {
        ". This system of equations first appeared in the work of ": null
    },
    {
        "Jean le Rond dAlembert": "Jean Le Rond Dalembert"
    },
    {
        " . Later, ": null
    },
    {
        "Leonhard Euler": "Leonhard Euler"
    },
    {
        " connected this system to the ": null
    },
    {
        "analytic functions": "Analytic Functions"
    },
    {
        " .  then used these equations to construct his theory of functions. Riemanns dissertation  on the theory of functions appeared in 1851.     The Cauchy–Riemann equations on a pair of real-valued functions of two real variables u and v are the two equations:     :         &           &   -            Typically u and v are taken to be the ": null
    },
    {
        "real": "Real Part"
    },
    {
        " and ": null
    },
    {
        "imaginary parts": "Imaginary Part"
    },
    {
        " respectively of a ": null
    },
    {
        "complex": "Complex Number"
    },
    {
        "-valued function of a single complex variable , . Suppose that u and v are real-": null
    },
    {
        "differentiable": "Differentiable Function"
    },
    {
        " at a point in an ": null
    },
    {
        "open subset": "Open Subset"
    },
    {
        " of ℂ, which can be considered as functions from ℝ 2 to ℝ. This implies that the partial derivatives of u and v exist and we can approximate small variations of f linearly. Then  is complex-": null
    },
    {
        "differentiable": "Differentiable Function"
    },
    {
        " at that point if and only if the partial derivatives of u and v satisfy the Cauchy–Riemann equations and at that point. The sole existence of partial derivatives satisfying the Cauchy–Riemann equations is not enough to ensure complex differentiability at that point. It is necessary that u and v be real differentiable, which is a stronger condition than the existence of the partial derivatives, but in general, weaker than continuous differentiability.     ": null
    },
    {
        "Holomorphy": "Holomorphic Function"
    },
    {
        " is the property of a complex function of being differentiable at every point of an open and connected subset of ℂ . Consequently, we can assert that a complex function f, whose real and imaginary parts u and v are real-differentiable functions, is ": null
    },
    {
        "holomorphic": "Holomorphic Function"
    },
    {
        " if and only if, equations and are satisfied throughout the ": null
    },
    {
        "domain": "Domain"
    },
    {
        " we are dealing with. ": null
    },
    {
        "Holomorphic functions are analytic": "Holomorphic Functions Are Analytic"
    },
    {
        " and vice versa. This means that, in complex analysis, a function that is complex-differentiable in a whole domain is the same as an analytic function. This is not true for real differentiable functions.       Suppose that z x + iy. The complex-valued function f z 2 is differentiable at any point z in the complex plane.   : f x - y + 2ixy   The real part u and the imaginary part v of f are   : u x - y   : v2xy   respectively. The partial derivatives of these are   :   2x   :   -2y   :   2y   :   2x .   These partial derivatives have the following relationships:   :       :   -  .   Thus this complex-valued function f satisfies the Cauchy–Riemann equations and .         The equations are one way of looking at the condition on a function to be differentiable in the sense of ": null
    },
    {
        "complex analysis": "Complex Analysis"
    },
    {
        "function of a complex variable": "Function Of A Complex Variable"
    },
    {
        " by means of conventional ": null
    },
    {
        "differential calculus": "Differential Calculus"
    },
    {
        ". In the theory there are several other major ways of looking at this notion, and the translation of the condition into other language is often needed.       First, the Cauchy–Riemann equations may be written in complex form     :   .     In this form, the equations correspond structurally to the condition that the ": null
    },
    {
        "Jacobian matrix": "Jacobian Matrix"
    },
    {
        " is of the form   :       a & -b     b &   a           where a  u/  x  v/  y and b  v/  x-  u/  y . A matrix of this form is the ": null
    },
    {
        "matrix representation of a complex number": "Complex Numbermatrix Representation Of Complex Numbers"
    },
    {
        ". Geometrically, such a matrix is always the ": null
    },
    {
        "composition": "Function Composition"
    },
    {
        " of a ": null
    },
    {
        "rotation": "Rotation"
    },
    {
        " with a ": null
    },
    {
        "scaling": "Homothetic Transformation"
    },
    {
        ", and in particular preserves ": null
    },
    {
        "angles": "Angle"
    },
    {
        ". The Jacobian of a function f takes infinitesimal line segments at the intersection of two curves in z and rotates them to the corresponding segments in f. Consequently, a function satisfying the Cauchy–Riemann equations, with a nonzero derivative, preserves the angle between curves in the plane. That is, the Cauchy–Riemann equations are the conditions for a function to be ": null
    },
    {
        "conformal": "Conformal Map"
    },
    {
        ".     Moreover, because the composition of a conformal transformation with another conformal transformation is also conformal, the composition of a solution of the Cauchy–Riemann equations with a conformal map must itself solve the Cauchy–Riemann equations. Thus the Cauchy–Riemann equations are conformally invariant.       Suppose that     : f u + i   v     is a function of a complex number z. Then the complex derivative of f at a point z 0 is defined by     :     f     provided this limit exists.     If this limit exists, then it may be computed by taking the limit as h  → 0 along the real axis or imaginary axis; in either case it should give the same result. Approaching along the real axis, one finds     :           On the other hand, approaching along the imaginary axis,     :           The equality of the derivative of f taken along the two axis is     : i      which are the Cauchy–Riemann equations at the point  z 0 .     Conversely, if f  : ℂ  →  ℂ is a function which is differentiable when regarded as a function on ℝ 2 , then f is complex differentiable if and only if the Cauchy–Riemann equations hold. In other words, if u and v are real-differentiable functions of two real variables, obviously u + iv is a real-differentiable function, but u + iv is complex-differentiable if and only if the Cauchy–Riemann equations hold.     Indeed, following , suppose f is a complex function defined in an open set Ω  ⊂ ℂ. Then, writing  for every z  ∈ Ω, one can also regard Ω as an open subset of ℝ 2 , and f as a function of two real variables x and y, which maps Ω  ⊂ ℝ 2 to ℂ. We consider the Cauchy–Riemann equations at z   z 0 . So assume f is differentiable at z 0 , as a function of two real variables from Ω to ℂ. This is equivalent to the existence of the following linear approximation     : f - f fx   x + fy   y +     z       where z x + iy and η → 0 as Δz → 0. Since   z +     2     x and   z -         y , the above can be re-written as     :   f       z +         +       z      Defining the two ": null
    },
    {
        "Wirtinger derivatives": "Wirtinger Derivatives"
    },
    {
        " as     :                   in the limit   z   0,      0 the above equality can be written as     :     | +   |     +         Now consider the potential values of d  when the limit is taken at the origin. For z along the real line,   z so that d  1 . Similarly for purely imaginary z we have d  -1 so that the value of d  is not well defined at the origin. Its easy to verify that d  is not well defined at any complex z, hence f is complex differentiable at z 0 if and only if 0 at zz0 . But this is exactly the Cauchy–Riemann equations, thus f is differentiable at z 0 if and only if the Cauchy–Riemann equations hold at  z 0 .         The above proof suggests another interpretation of the Cauchy–Riemann equations. The ": null
    },
    {
        "complex conjugate": "Complex Conjugate"
    },
    {
        " of z, denoted   , is defined by     :   : x - iy     for real x and y. The Cauchy–Riemann equations can then be written as a single equation     :   0     by using the ": null
    },
    {
        "Wirtinger derivative with respect to the conjugate variable": "Wirtinger Derivatives"
    },
    {
        ". In this form, the Cauchy–Riemann equations can be interpreted as the statement that f is independent of the variable   . As such, we can view analytic functions as true functions of one complex variable as opposed to complex functions of two real variables.          A standard physical interpretation of the Cauchy–Riemann equations going back to Riemanns work on function theory  is that u represents a ": null
    },
    {
        "velocity potential": "Velocity Potential"
    },
    {
        " of an incompressible ": null
    },
    {
        "steady fluid flow": "Potential Flow"
    },
    {
        " in the plane, and v is its ": null
    },
    {
        "stream function": "Stream Function"
    },
    {
        ". Suppose that the pair of functions u,v satisfies the Cauchy–Riemann equations. We will take u to be a velocity potential, meaning that we imagine a flow of fluid in the plane such that the ": null
    },
    {
        "velocity vector": "Velocity Vector"
    },
    {
        " of the fluid at each point of the plane is equal to the ": null
    },
    {
        "gradient": "Gradient"
    },
    {
        " of u, defined by   :   u   i +   j     By differentiating the Cauchy–Riemann equations a second time, one shows that u solves ": null
    },
    {
        "Laplaces equation": "Laplaces Equation"
    },
    {
        "u is a ": null
    },
    {
        "harmonic function": "Harmonic Function"
    },
    {
        ". This means that the ": null
    },
    {
        "divergence": "Divergence"
    },
    {
        " of the gradient is zero, and so the fluid is incompressible.     The function v also satisfies the Laplace equation, by a similar analysis. Also, the Cauchy–Riemann equations imply that the ": null
    },
    {
        "dot product": "Dot Product"
    },
    {
        "   u  v 0 . This implies that the gradient of u must point along the v  curves; so these are the ": null
    },
    {
        "streamlines": "Streamlines, Streaklines, And Pathlines"
    },
    {
        " of the flow. The u  curves are the ": null
    },
    {
        "equipotential curves": "Equipotential Curve"
    },
    {
        " of the flow.     A holomorphic function can therefore be visualized by plotting the two families of ": null
    },
    {
        "level curves": "Level Curve"
    },
    {
        " u  and v  . Near points where the gradient of u  is not zero, these families form an ": null
    },
    {
        "orthogonal": "Orthogonal"
    },
    {
        " family of curves. At the points where   u0 , the stationary points of the flow, the equipotential curves of u  intersect. The streamlines also intersect at the same point, bisecting the angles formed by the equipotential curves.       Another interpretation of the Cauchy–Riemann equations can be found in . Suppose that u and v satisfy the Cauchy–Riemann equations in an open subset of ℝ 2 , and consider the ": null
    },
    {
        "vector field": "Vector Field"
    },
    {
        "     :     -v      regarded as a two-component vector. Then the second Cauchy–Riemann equation asserts that   is ": null
    },
    {
        "irrotational": "Irrotational Vector Field"
    },
    {
        " solenoidal": "Solenoidal Vector Field"
    },
    {
        " Greens theorem": "Greens Theorem"
    },
    {
        " and the ": null
    },
    {
        "divergence theorem": "Divergence Theorem"
    },
    {
        ", such a field is necessarily a ": null
    },
    {
        "conservative": "Conservative Vector Field"
    },
    {
        " one, and it is free from sources or sinks, having net flux equal to zero through any open domain without holes.  In ": null
    },
    {
        "fluid dynamics": "Fluid Dynamics"
    },
    {
        ", such a vector field is a ": null
    },
    {
        "potential flow": "Potential Flow"
    },
    {
        " . In ": null
    },
    {
        "magnetostatics": "Magnetostatics"
    },
    {
        ", such vector fields model static ": null
    },
    {
        "magnetic fields": "Magnetic Field"
    },
    {
        " on a region of the plane containing no current. In ": null
    },
    {
        "electrostatics": "Electrostatics"
    },
    {
        ", they model static electric fields in a region of the plane containing no electric charge.     This interpretation can equivalently be restated in the language of ": null
    },
    {
        "differential forms": "Differential Form"
    },
    {
        ". The pair u,v satisfy the Cauchy–Riemann equations if and only if the ": null
    },
    {
        "one-form": "One-Form"
    },
    {
        " v  + u  dy is both ": null
    },
    {
        "closed": "Closed And Exact Differential Forms"
    },
    {
        " and ": null
    },
    {
        "coclosed": "Codifferential"
    },
    {
        " .       Another formulation of the Cauchy–Riemann equations involves the ": null
    },
    {
        "complex structure": "Linear Complex Structure"
    },
    {
        " in the plane, given by   : J  & -1  & 0    This is a complex structure in the sense that the square of J is the negative of the 2 & times;2 identity matrix: J2-I . As above, if u,v are two functions in the plane, put     : f       The ": null
    },
    {
        "Jacobian matrix": "Jacobian Matrix"
    },
    {
        " of f is the matrix of partial derivatives     : Df   &       &       Then the pair of functions u, v satisfies the Cauchy–Riemann equations if and only if the 2 & times;2 matrix Df commutes with J      This interpretation is useful in ": null
    },
    {
        "symplectic geometry": "Symplectic Geometry"
    },
    {
        ", where it is the starting point for the study of ": null
    },
    {
        "pseudoholomorphic curves": "Pseudoholomorphic Curve"
    },
    {
        ".       Other representations of the Cauchy–Riemann equations occasionally arise in other ": null
    },
    {
        "coordinate systems": "Coordinate System"
    },
    {
        ". If and hold for a differentiable pair of functions u and v, then so do     :       -      for any coordinate system  such that the pair  is ": null
    },
    {
        "orthonormal": "Orthonormal"
    },
    {
        " and ": null
    },
    {
        "positively oriented": "Orientation"
    },
    {
        ". As a consequence, in particular, in the system of coordinates given by the polar representation , the equations then take the form     : ,  -.     Combining these into one equation for f gives     : .       The inhomogeneous Cauchy–Riemann equations consist of the two equations for a pair of unknown functions u and v of two real variables     :       &         &               for some given functions α and β defined in an open subset of ℝ 2 . These equations are usually combined into a single equation     :         where f u + iv and φ /2.     If φ is ": null
    },
    {
        "C k ": "Continuously Differentiable"
    },
    {
        ", then the inhomogeneous equation is explicitly solvable in any bounded domain D, provided φ is continuous on the ": null
    },
    {
        "closure": "Closure"
    },
    {
        " of D. Indeed, by the ": null
    },
    {
        "Cauchy integral formula": "Cauchy Integral Formula"
    },
    {
        ",     : f               for all ζ ∈ D.                Suppose that  is a complex-valued function which is ": null
    },
    {
        "differentiable": "Fréchet Derivative"
    },
    {
        " as a function . Then  Goursat s theorem asserts that f is analytic in an open complex domain Ω if and only if it satisfies the Cauchy–Riemann equation in the domain . In particular, continuous differentiability of f need not be assumed .     The hypotheses of Goursats theorem can be weakened significantly. If  is continuous in an open set Ω and the ": null
    },
    {
        "partial derivatives": "Partial Derivative"
    },
    {
        " of f with respect to x and y exist in Ω, and satisfy the Cauchy–Riemann equations throughout Ω, then f is holomorphic . This result is the ": null
    },
    {
        "Looman–Menchoff theorem": "Looman–Menchoff Theorem"
    },
    {
        ".     The hypothesis that f obey the Cauchy–Riemann equations throughout the domain Ω is essential. It is possible to construct a continuous function satisfying the Cauchy–Riemann equations at a point, but which is not analytic at the point . Similarly, some additional assumption is needed besides the Cauchy–Riemann equations , as the following example illustrates      : f       &     0 &           which satisfies the Cauchy–Riemann equations everywhere, but fails to be continuous at z    0.     Nevertheless, if a function satisfies the Cauchy–Riemann equations in an open set in a ": null
    },
    {
        "weak sense": "Weak Derivative"
    },
    {
        ", then the function is analytic. More precisely f is locally integrable in an open domain Ω  ⊂  ℂ, and satisfies the Cauchy–Riemann equations weakly, then f agrees ": null
    },
    {
        "almost everywhere": "Almost Everywhere"
    },
    {
        " with an analytic function in Ω.   This is in fact a special case of a more general result on the regularity of solutions of ": null
    },
    {
        "hypoelliptic": "Hypoelliptic Operator"
    },
    {
        " partial differential equations.       There are Cauchy–Riemann equations, appropriately generalized, in the theory of ": null
    },
    {
        "several complex variables": "Several Complex Variables"
    },
    {
        ". They form a significant ": null
    },
    {
        "overdetermined system": "Overdetermined System"
    },
    {
        " of PDEs. This is done using a straightforward generalization of the ": null
    },
    {
        "Wirtinger derivative": "Wirtinger Derivative"
    },
    {
        ", where the function in question is required to have the Wirtinger derivative with respect to each complex variable vanish.       As often formulated, the  d-bar operator      :       annihilates holomorphic functions. This generalizes most directly the formulation     : 0,     where     :         Viewed as ": null
    },
    {
        "conjugate harmonic functions": "Conjugate Harmonic Functions"
    },
    {
        ", the Cauchy–Riemann equations are a simple example of a ": null
    },
    {
        "Bäcklund transform": "Bäcklund Transform"
    },
    {
        ". More complicated, generally non-linear Bäcklund transforms, such as in the ": null
    },
    {
        "sine-Gordon equation": "Sine-Gordon Equation"
    },
    {
        ", are of great interest in the theory of ": null
    },
    {
        "solitons": "Soliton"
    },
    {
        " and ": null
    },
    {
        "integrable systems": "Integrable System"
    },
    {
        ".         In ": null
    },
    {
        "Clifford algebra": "Clifford Algebra"
    },
    {
        " the complex number z x+iy is represented as z   x + I y where I       . The fundamental derivative operator in Clifford algebra of ": null
    },
    {
        "Complex numbers": "Complex Numbers"
    },
    {
        " is defined as         +   . The function fu + I v is considered analytic if and only if   f 0 , which can be calculated in following way:     :       0 &   f     &     u +     v +     u +     v 0           Grouping by   and   :     :   f   +   0         u -   v 0      v +   u 0         Henceforth in traditional notation:     :             -            Let & Omega; be an open set in the Euclidean space ℝ n . The equation for an orientation-preserving mapping f:  to be a ": null
    },
    {
        "conformal mapping": "Conformal Mapping"
    },
    {
        " is that   : DfTDf I   where Df is the Jacobian matrix, with transpose DfT , and I denotes the identity matrix . For , this system is equivalent to the standard Cauchy–Riemann equations of complex variables, and the solutions are holomorphic functions. In dimension ": null
    }
]