[
    {
        "        Cecil Blount DeMille  was an American filmmaker. Between 1914 and 1958, he made a total of 70 features, both ": null
    },
    {
        "silent": "Silent Film"
    },
    {
        " and ": null
    },
    {
        "sound film": "Sound Film"
    },
    {
        "s. He is acknowledged as a founding father of the ": null
    },
    {
        "American cinema": "Cinema Of The United States"
    },
    {
        " and the most commercially successful producer-director in film history. His films were distinguished by their epic scale and by his cinematic showmanship. His silent films were more diverse in genre, among which included social dramas, comedies, Westerns, farces, morality plays, and historical pageants.     DeMille began his career as a stage actor in 1900. He later moved to writing and directing stage productions, some with ": null
    },
    {
        "Jesse Lasky": "Jesse Lasky"
    },
    {
        ", who was then a ": null
    },
    {
        "vaudeville": "Vaudeville"
    },
    {
        " producer. DeMilles first film,  The Squaw Man  , was also the first feature film shot in Hollywood. Its interracial love story made it commercially successful and it first publicized ": null
    },
    {
        "Hollywood": "Hollywood, Los Angeles"
    },
    {
        " as the home of the U.S. film industry. The continued success of his productions led to the founding of ": null
    },
    {
        "Paramount Pictures": "Paramount Pictures"
    },
    {
        " with Lasky and ": null
    },
    {
        "Adolph Zukor": "Adolph Zukor"
    },
    {
        ". His first biblical epic,  The Ten Commandments  , was both a critical and commercial success; it held the Paramount revenue record for twenty-five years.     DeMille directed  The King of Kings  , a biography of Jesus of Nazareth, which gained approval for its sensitivity and reached more than 800 million viewers.  The Sign of the Cross  is said to be the first sound film to integrate all aspects of cinematic technique.  Cleopatra  was his first film to be nominated for the ": null
    },
    {
        "Academy Award for Best Picture": "Academy Award For Best Picture"
    },
    {
        ". After more than thirty years in film production, DeMille reached a pinnacle in his career with  Samson and Delilah  , a biblical epic which became the highest-grossing film of 1950. Along with biblical and historical narratives, he also directed films oriented toward neo-naturalism , which tried to portray the laws of man fighting the forces of nature.     He received his first nomination for the ": null
    },
    {
        "Academy Award for Best Director": "Academy Award For Best Director"
    },
    {
        " for his circus drama  The Greatest Show on Earth  , which won both the ": null
    },
    {
        "Academy Award for Best Picture": "25Th Academy Awards"
    },
    {
        " and the ": null
    },
    {
        "Golden Globe Award for Best Motion Picture – Drama": "Golden Globe Award For Best Motion Picture – Drama"
    },
    {
        ". His last and best known film,  The Ten Commandments  , also a Best Picture Academy Award nominee, is currently the ": null
    },
    {
        "eighth-highest-grossing film of all time, adjusted for inflation": "List Of Highest-Grossing Films Adjusted For Inflation"
    },
    {
        ". In addition to his Best Picture Awards, he received an ": null
    },
    {
        "Academy Honorary Award": "Academy Honorary Award"
    },
    {
        " for his film contributions, the ": null
    },
    {
        "Palme dOr": "Palme Dor"
    },
    {
        " for  Union Pacific  , a ": null
    },
    {
        "DGA Award": "Directors Guild Of America Award"
    },
    {
        " for Lifetime Achievement, and the ": null
    },
    {
        "Irving G. Thalberg Memorial Award": "Irving G. Thalberg Memorial Award"
    },
    {
        ". He was the first recipient of the ": null
    },
    {
        "Golden Globe Cecil B. DeMille Award": "Golden Globe Cecil B. Demille Award"
    },
    {
        ", which was named in his honor. DeMilles reputation as a filmmaker has been recognized over time and his work has influenced many other films and directors.            Cecil Blount DeMille was born on August 12, 1881 in a ": null
    },
    {
        "boarding house": "Boarding House"
    },
    {
        " on Main Street in ": null
    },
    {
        "Ashfield, Massachusetts": "Ashfield, Massachusetts"
    },
    {
        ", where his parents had been vacationing for the summer. On September 1, 1881, the family returned with newborn DeMille to their flat in New York. DeMille was named after his grandmothers Cecelia Wolff and Margarete Blount. He was the second of three children of ": null
    },
    {
        "Henry Churchill de Mille": "Henry Churchill De Mille"
    },
    {
        " and his wife ": null
    },
    {
        "Matilda Beatrice deMille": "Matilda Beatrice Demille"
    },
    {
        " , known as Beatrice. ;  His brother, ": null
    },
    {
        "William C. DeMille": "William C. Demille"
    },
    {
        ", was born on July 25, 1878. Henry deMille, whose ancestors were of Dutch-Belgian descent, was a ": null
    },
    {
        "North Carolina": "North Carolina"
    },
    {
        "-born dramatist, actor, and lay reader in the ": null
    },
    {
        "Episcopal Church": "Episcopal Church In The United States Of America"
    },
    {
        ". DeMilles father was also an English teacher at ": null
    },
    {
        "Columbia College": "Columbia University"
    },
    {
        " . He worked as a ": null
    },
    {
        "playwright": "Playwright"
    },
    {
        ", administrator, and faculty member during the early years of The ": null
    },
    {
        "American Academy of Dramatic Arts": "American Academy Of Dramatic Arts"
    },
    {
        ", established in New York City in 1884.     Henry deMille frequently collaborated with ": null
    },
    {
        "David Belasco": "David Belasco"
    },
    {
        " when playwriting. Their most well known collaborations include The Wife, Lord Chumley, The Charity Ball, and Men and Women. DeMilles mother Beatice, a literary agent and scriptwriter, whose parents were both of ": null
    },
    {
        "German-Jewish": "German-Jewish"
    },
    {
        " heritage, married Henry deMille July 1, 1876 despite her parents dissent due to their differing religions. ;;  She emigrated from England with her parents in 1871 when she was 18, and they settled in ": null
    },
    {
        "Brooklyn": "Brooklyn, New York"
    },
    {
        ". Beatrice grew up in a middle-class English household. Easton, Carol . No Intermissions: The Life of Agnes de Mille. New York: Da Capo Press. p. 6-8 . DeMilles parents met as members of a music and literary society in New York. Henry was a tall, red-headed student. Beatrice was intelligent, educated, forthright, and strong-willed. ;  When they married, Beatrice converted to episcopalianism.     DeMille was a brave and confident child. He gained his love of theater while watching his father and Belasco rehearse their plays and a lasting memory for DeMille was a lunch with his father and actor ": null
    },
    {
        "Edwin Booth": "Edwin Booth"
    },
    {
        ". As a child, DeMille created an alter-ego called Champion Driver , a Robin Hood-like character, evidence of his creativity and imagination. The family lived in Washington, North Carolina  until Henry built a three-story ": null
    },
    {
        "Victorian": "Victorian Architecture"
    },
    {
        "-style house for his family in ": null
    },
    {
        "Pompton Lakes, New Jersey": "Pompton Lakes, New Jersey"
    },
    {
        "; they named this estate Pamlico . ;  ": null
    },
    {
        "John Philip Sousa": "John Philip Sousa"
    },
    {
        " was a friend of the family and DeMille recalled throwing mud balls in the air so neighbor ": null
    },
    {
        "Annie Oakley": "Annie Oakley"
    },
    {
        " could practice her shooting. DeMilles sister Agnes was born on April 23, 1891; his mother nearly did not survive the birth. Agnes would die on February 11, 1894 at the age of three from spinal meningitis. ; ;   DeMilles parents operated a private school in town and attended Christ Episcopal Church. DeMille recalled that this church was the place where he visualized the story of his 1923 version of The Ten Commandments.       On January 8, 1893, at the age of forty, Henry de Mille died suddenly from ": null
    },
    {
        "typhoid fever": "Typhoid Fever"
    },
    {
        ", leaving Beatrice with three children. To provide for her family, she opened the Henry C. DeMille School for girls in her home in February 1893. ;  The aim of the school was to teach young women to properly understand and fulfill the womens duty to herself, her home, and her country. Before Henry deMilles death, Beatrice had enthusiastically supported her husbands theatrical aspirations. She later became the second female play broker on ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        ". On Henry DeMilles deathbed, he told his wife that he did not want his sons to become playwrights due to its uncertainty and disappointment as a career. In order to cultivate her DeMilles educations and life skills, DeMilles mother sent him to ": null
    },
    {
        "Pennsylvania Military College": "Widener University"
    },
    {
        " in ": null
    },
    {
        "Chester, Pennsylvania": "Chester, Pennsylvania"
    },
    {
        " at the age of fifteen. ;  He fled school to join the ": null
    },
    {
        "Spanish–American War": "Spanish–American War"
    },
    {
        ", but failed to meet the age requirement. DeMille was a neat, intelligent, athletic, and determined adolescent. At the military college, even though his grades were average, he reportedly excelled in personal conduct. DeMille attended and graduated from the American Academy of Dramatic Arts, where he attended for free due to his fathers service to the Academy. His graduation performance was the play The Arcady Trail. In the audience was ": null
    },
    {
        "Charles Frohman": "Charles Frohman"
    },
    {
        " who would cast DeMille in his play Hearts are Trumps, DeMilles Broadway debut.         Cecil B. DeMille began his career as an actor on the stage in the theatrical company of ": null
    },
    {
        "Charles Frohman": "Charles Frohman"
    },
    {
        " in 1900. He debuted as an actor on February 21, 1900, in the play Hearts are Trumps at New Yorks ": null
    },
    {
        "Garden Theater": "Garden Theater"
    },
    {
        ". ;  In 1901, DeMille starred in productions of A Repentance, To Have and to Hold, and Are you a Mason?. At the age of twenty-one, Cecil B. DeMille married ": null
    },
    {
        "Constance Adams": "Constance Adams Demille"
    },
    {
        " on August 16, 1902 at Adamss fathers home in East Orange, New Jersey. The wedding party was small and Beatrice deMilles family was not in attendance. It was suggested by ": null
    },
    {
        "Simon Louvish": "Simon Louvish"
    },
    {
        " that this was to conceal DeMilles Jewish heritage. Adams was 29 years old at the time of their marriage, eight years older than DeMille. They had met in a theater in Washington D.C. while they were both acting in Hearts Are Trumps.     Their age difference led to their sexual incompatibility; according to DeMille, Adams was too pure to feel such violent and evil passions . DeMille had more violent sexual preferences and fetishes than his wife and Adams allowed DeMille to have several long term mistresses during their marriage as an outlet for his particular sexual kinks, while maintaining an outward appearance of a faithful marriage. Adams did not want to have sexual relations with DeMille, but did not mind his affairs because she felt that sex and love were unrelated; she knew that she was the sole Mrs. DeMille. One of DeMilles affairs was with his screenwriter Jeanie MacPherson. Despite his reputation for extramarital affairs, DeMille did not like to have affairs with his stars, as he believed it would cause him to lose control as a director. He related a story that he maintained his self-control when ": null
    },
    {
        "Gloria Swanson": "Gloria Swanson"
    },
    {
        " sat on his lap, refusing to touch her.     In 1902, he played a small part in Hamlet. Publicists wrote that he became an actor in order to learn how direct and produce, but DeMille admitted that he became an actor in order to pay the bills. From 1904 to 1905, DeMille attempted to make a living as a stock theatre actor with his wife Constance. DeMille made a 1905 reprise in Hamlet as Osric. His brother William was establishing himself as a playwright and sometimes invited him to collaborate. DeMille and William collaborated on The Genius, The Royal Mounted, and After Five. However, none of these were very successful; William deMille was most successful when he worked alone. DeMille and his brother at times worked with the legendary impresario ": null
    },
    {
        "David Belasco": "David Belasco"
    },
    {
        ", who had been a friend and collaborator of their father. DeMille would later adapt Belascos  The Girl of the Golden West  and Rose of the Rancho, and  The Warrens of Virginia  into films. DeMille was credited with creating the premise of Belascos The Return of Peter Grimm. The Return of Peter Grimm sparked controversy; however, because Belasco had taken DeMilles unnamed screenplay, changed the characters and named it The Return of Peter Grimm, producing and presenting it as his own work. DeMille was credited in small print as based on an idea by Cecil DeMille . The play was successful and DeMille was distraught that his childhood idol had plagiarized his work.       DeMille performed on stage with actors whom he would later direct in films: ": null
    },
    {
        "Charlotte Walker": "Charlotte Walker"
    },
    {
        ", ": null
    },
    {
        "Mary Pickford": "Mary Pickford"
    },
    {
        ", and ": null
    },
    {
        "Pedro de Cordoba": "Pedro De Cordoba"
    },
    {
        ". DeMille also produced and directed plays. . Internet Broadway Database. Retrieved: December 8, 2011. His 1905 performance in The Prince Chap as the Earl of Huntington was well received by audiences. DeMille wrote a few of his own plays in-between stage performances, but his playwriting was not as successful. His first play was The Pretender-A Play in a Prologue and 4 Acts set in the seventeenth century Russia. Another unperformed play he wrote was Son of the Winds, a mythological Native American story. Life was difficult for DeMille and his wife as traveling actors; however, traveling allowed him to experience part of the United States he had not yet seen. DeMille sometimes worked with the director ": null
    },
    {
        "E.H. Sothern": "E.H. Sothern"
    },
    {
        ", who influenced DeMilles later perfectionism in his work. In 1907, due to a scandal with one of Beatrices students, ": null
    },
    {
        "Evelyn Nesbit": "Evelyn Nesbit"
    },
    {
        ", the Henry deMille School lost students. The school closed and Beatrice filed for bankruptcy. DeMille wrote another play originally called Sergeant Devil May Care which was renamed The Royal Mounted. He also toured with the Standard Opera Company, but there are few records to indicate DeMilles singing ability. DeMille had a daughter, Cecilia, on November 5, 1908, who would be his only biological child. In the 1910s, DeMille began directing and producing other writers plays.     DeMille was poor and struggled to find work. Consequently, his mother hired him for her agency The DeMille Play Company and taught him how to be an agent and a playwright. Eventually, he became manager of the agency and later, a junior partner with his mother. ;  In 1911, DeMille became acquainted with vaudeville producer Jesse Lasky when Lasky was searching for a writer for his new musical. He initially sought out William deMille. William had been a successful playwright, but DeMille was suffering from the failure of his plays The Royal Mounted and The Genius. However, Beatrice introduced Lasky to DeMille instead. ; The collaboration of DeMille and Lasky produced a successful musical called California which opened in New York in January 1912. ;  Another DeMille-Lasky production that opened on January 1912 was The Antique Girl. DeMille found success in the spring of 1913 producing Reckless Age by Lee Wilson, a play about a high society girl wrongly accused of manslaughter starring ": null
    },
    {
        "Frederick Burton": "Frederick Burton"
    },
    {
        " and ": null
    },
    {
        "Sydney Shields": "Sydney Shields"
    },
    {
        ". . New York Dramatic Mirror, May 14, 1913. Birchard, Robert S. . Cecil B. DeMilles Hollywood. Lexington, Kentucky: University Press of Kentucky. p. 2. . However, changes in the theater rendered DeMilles ": null
    },
    {
        "melodramas": "Melodrama"
    },
    {
        "obsolete before they were produced, and true theatrical success eluded him. He produced many flops. Having become disinterested in working in theatre, DeMilles passion for film was ignited when he watched the 1912 French film  Les Amours de la reine Élisabeth .          Desiring a change of scene, Cecil B. DeMille, Jesse Lasky, Sam Goldfish , and a group of East Coast businessmen created the ": null
    },
    {
        "Jesse L. Lasky Feature Play Company": "Jesse L. Lasky Feature Play Company"
    },
    {
        " in 1913 over which DeMille became director-general. ; ;  Lasky and DeMille were said to have sketched out the organization of the company on the back of a restaurant menu. As director-general, DeMilles job was to make the films. In addition to directing, DeMille was the supervisor and consultant for the first year of films made by the Lasky Feature Play Company. Sometimes, he directed scenes for other directors at the Feature Play Company in order to release films on time. Moreover, when he was busy directing other films, he would co-author other Lasky Company scripts as well as create screen adaptations that others directed.     The Lasky Play Company sought out William DeMille to join the company, but he rejected the offer because he did not believe there was any promise in a film career. When William found out that DeMille had begun working in the motion picture industry, he wrote DeMille a letter, disappointed that he was willing to throw away future when he was born and raised in the finest traditions of the theater . The Lasky Company wanted to attract high-class audiences to their films so they began producing films from literary works. The Lasky Company bought the rights to the play  The Squaw Man  by ": null
    },
    {
        "Edwin Milton Royle": "Edwin Milton Royle"
    },
    {
        " and cast ": null
    },
    {
        "Dustin Farnum": "Dustin Farnum"
    },
    {
        " in the lead role. They offered Farnum a choice to have a quarter stock in the company or $250 per week as salary. Farnum chose $250 per week. Already $15,000 in debt to Royle for the screenplay of  The Squaw Man , Laskys relatives bought the $5,000 stock to save the Lasky Company from bankruptcy. With no knowledge of filmmaking, DeMille was introduced to observe the process at film studios. He was eventually introduced to ": null
    },
    {
        "Oscar Apfel": "Oscar Apfel"
    },
    {
        ", a stage director turned movie director.     On December 12, 1913, DeMille, his cast, and crew boarded a Southern Pacific train bound for ": null
    },
    {
        "Flagstaff": "Flagstaff, Arizona"
    },
    {
        " via ": null
    },
    {
        "New Orleans": "New Orleans"
    },
    {
        ". His tentative plan was to shoot a film in ": null
    },
    {
        "Arizona": "Arizona"
    },
    {
        ", but he felt that Arizona did not typify the Western look they were searching for. They also learned that other filmmakers were successfully shooting in Los Angeles, even in winter. ; He continued to Los Angeles. Once there, he chose not to shoot in ": null
    },
    {
        "Edendale": "Edendale, Los Angeles"
    },
    {
        ", where many studios were, but in Hollywood. DeMille rented a barn to function as their film studio. Filming began on December 29, 1913, and lasted three weeks. Apfel filmed most of The Squaw Man due to DeMilles inexperience; however, DeMille learned quickly and was particularly adept at impromptu screenwriting as necessary. He made his first film run sixty minutes, as long as a short play. The Squaw Man , co-directed by Oscar Apfel, was a sensation and it established the Lasky Company. This was the first feature-length film made in Hollywood. There were problems; however, with the perforation of the film stock and it was discovered the DeMille had brought a cheap British film projector. DeMille would later need to be sure to punch in sixty-five holes per foot instead of the industry-standard sixty-four. This was also the first American feature film; however, only by release date, as ": null
    },
    {
        "D. W. Griffiths": "D. W. Griffith"
    },
    {
        "  Judith of Bethulia  was filmed earlier than The Squaw Man, but released later. Additionally, this was the only film in which DeMille shared directors credit with Oscar C. Apfel.     The Squaw Man was a success, which led to the eventual founding of Paramount Pictures and Hollywood becoming the film capital of the world .   The film grossed over ten times its budget after its New York premiere in February 1914. DeMilles next project was to aid Oscar Apfel and directing  Brewsters Millions , which was wildly successful. In December 1914, Constance Adams brought home John DeMille, a fifteen-month-old, whom the couple legally adopted three years later. Biographer Scott Eyman suggested that this may have been a result of Adamss recent miscarriage.            Cecil B. DeMilles second film credited exclusively to him was  The Virginian . This is earliest of DeMilles films available in a quality, color-tinted video format. However, this version is actually a 1918 re-release. The first few years of the Lasky Company were spent in making films nonstop, literally writing the language of film. DeMille himself directed twenty films by 1915. The most successful films during the beginning of the Lasky Company were Brewsters Millions ,  Rose of the Rancho , and  The Ghost Breaker . DeMille adapted Belascos dramatic lighting techniques to film technology, mimicking moonlight with U.S. cinemas first attempts at motivated lighting in  The Warrens of Virginia . This was the first of few film collaborations with his brother William. They struggled to adapt the play from the stage to the set. After the film was shown, viewers complained that the shadows and lighting prevented the audience from seeing the actors full faces, complaining that they would only pay half price. However, Sam Goldwyn realized that if they called it Rembrandt lighting, the audience would pay double the price. Additionally, because of DeMilles cordiality after the Peter Grimm incident, DeMille was able to rekindle his partnership with Belasco. He adapted several of Belascos screenplays into film.     DeMilles most successful film was  The Cheat ; DeMilles direction in the film was acclaimed. In 1916, exhausted from three years of nonstop filmmaking, DeMille purchased land in the ": null
    },
    {
        "Angeles National Forest": "Angeles National Forest"
    },
    {
        " for a ranch which would become his getaway. He called this place, Paradise , declaring it a wildlife sanctuary; no shooting of animals was allowed besides snakes. His wife did not like Paradise, so DeMille often brought his mistresses there with him including actress ": null
    },
    {
        "Julia Faye": "Julia Faye"
    },
    {
        ".   In addition to his Paradise, DeMille purchased a yacht in 1921 which he called The Seaward.     While filming  The Captive  in 1915, an extra, Bob Fleming, died on set when another extra failed to heed to DeMilles orders to unload all guns for rehearsal. DeMille instructed the guilty man to leave town and would never reveal his name. Lasky and DeMille maintained the widow Fleming on the payroll; however, according to leading actor ": null
    },
    {
        "House Peters Sr.": "House Peters Sr."
    },
    {
        " DeMille refused to stop production for the funeral of Fleming. Peters claimed that he encouraged the cast to attend the funeral with him anyway since DeMille would not be able to shoot the film without him. On July 19, 1916, the Jesse Lasky Feature Play Company merged with Adolph Zukors ": null
    },
    {
        "Famous Players Film Company": "Famous Players Film Company"
    },
    {
        ", becoming ": null
    },
    {
        "Famous Players-Lasky": "Famous Players-Lasky"
    },
    {
        ". Zukor became president with Lasky as the vice president. DeMille was maintained as director-general and Goldwyn became chairman of the board. Goldwyn was later fired from Famous Players-Lasky due to frequent clashes with Lasky, DeMille, and finally Zukor. While on a European vacation in 1921, DeMille contracted rheumatic fever in Paris. He was confined to bed and unable to eat. His poor physical condition upon his return home affected the production of his 1922 film  Manslaughter . According to Richard Birchard, DeMilles weakened state during production may have led to the film being received as uncharacteristically substandard.     During World War I, the Famous Players-Lasky organized a military company underneath the National Guard called the Home Guard made up of film studio employees with DeMille as captain. Eventually, the Guard was promoted to a battalion and recruited soldiers from other film studios. They took time off weekly from film production to practice military drills. Additionally, during the war, DeMille volunteered for the Justice Departments Intelligence Office, investigating friends, neighbors, and others he came in contact with in connection with the Famous Players-Lasky. He volunteered for the Intelligence Office during World War II as well. Although DeMille considered enlisting in World War I, he stayed in the United States and made films. However, he did take a few months to set up a movie theater for the French front. Famous Players-Lasky donated the films. DeMille and Adams adopted ": null
    },
    {
        "Katherine Lester": "Katherine Demille"
    },
    {
        " in 1920 whom Adams had found in the orphanage over which she was the director.  In 1922, the couple adopted Richard deMille.       Film started becoming more sophisticated and the subsequent films of the Lasky company were criticized for primitive and unrealistic set design. Consequently, Beatrice deMille introduced the Famous Players-Lasky to ": null
    },
    {
        "Wilfred Buckland": "Wilfred Buckland"
    },
    {
        ", who DeMille had known from his time at the American Academy of Dramatic Arts, and he became DeMilles art director. William deMille reluctantly became a story editor. William deMille would later convert from theater to Hollywood and would spend the rest of his career as a film director. Throughout his career, DeMille would frequently remake his own films. In his first instance, in 1917, he remade  The Squaw Man  , only waiting four years from the 1914 original. Despite its quick turnaround, the film was fairly successful. However, DeMilles second remake at ": null
    },
    {
        "MGM": "Metro-Goldwyn-Mayer"
    },
    {
        " in 1931 would be a failure.     After five years and thirty hit films, DeMille became the American film industrys most successful director. In the silent era, he was renowned for  Male and Female  , Manslaughter ,  The Volga Boatman  , and  The Godless Girl  . DeMilles trademark scenes included bathtubs, lion attacks, and Roman orgies. A number of his films featured scenes in two-color ": null
    },
    {
        "Technicolor": "Technicolor"
    },
    {
        ". In 1923, DeMille released a modern melodrama The Ten Commandments which was a significant change from his previous stint of irreligious films. The film was produced on a large budget of $600,000, the most expensive production at Paramount. This concerned the executives at Paramount; however, the film turned out to be the studios highest-grossing film. It held the Paramount record for twenty-five years until DeMille broke the record again himself.  In the early 1920s, scandal surrounded Paramount. Several Paramount contractees were accused of rape, murder, and drug addiction. Outcry intensified from religious groups and the media were appalled by immorality in the film industry on and off screen. A censorship board called the ": null
    },
    {
        "Hays Code": "Hays Code"
    },
    {
        " was established. DeMilles depiction of on screen immorality came under fire, likely due to the scandalous film  The Affairs of Anatol . Furthermore, DeMille argued with Zukor over his extravagant and over-budget production costs. Consequently, DeMille left Paramount in 1924 despite having helped establish it. Instead, he joined the ": null
    },
    {
        "Producers Distributing Corporation": "Producers Distributing Corporation"
    },
    {
        ". ;    His first film from his new production company, DeMille Pictures Corporation, was  The Road to Yesterday  in 1925. He directed and produced four films on his own, working with Producers Distributing Corporation because he found front office supervision too restricting. Aside from The King of Kings , none of DeMilles films away from Paramount were successful. The Kings of Kings established DeMille as master of the grandiose and of biblical sagas . The most successful Christian film of the silent era. DeMille calculated that the film had been viewed over 800 million times around the world.  After the release of DeMilles The Godless Girl, silent films in America became obsolete and DeMille was forced to shoot a shoddy final reel with the new sound production technique. Although this final reel looked so different from the previous eleven reels that it appeared to be from another movie, according to Simon Louvish, the film is one of DeMilles strangest and most DeMillean film.     The immense popularity of DeMilles silent films enabled him to branch out into other areas. The ": null
    },
    {
        "Roaring Twenties": "Roaring Twenties"
    },
    {
        " were the boom years and DeMille took full advantage, opening the Mercury Aviation Company, one of Americas first commercial airlines.  He was also a real estate speculator, an underwriter of political campaigns, and vice president of ": null
    },
    {
        "Bank of America": "Bank Of America"
    },
    {
        ".  He was additionally vice president of the Commercial National Trust and Savings Bank in Los Angeles where he approved loans for other filmmakers.  In 1916, DeMille purchased a mansion in Hollywood. ": null
    },
    {
        "Charlie Chaplin": "Charlie Chaplin"
    },
    {
        " lived next door for a time, and after he moved, DeMille purchased the other house and combined the estates.          When talking pictures were invented in 1928, Cecil B. DeMille made a successful transition, offering his own innovations to the painful process; he devised a microphone boom and a soundproof camera blimp. He also popularized the camera crane. His first three sound films were produced at Metro-Goldwyn-Mayer. These three films,  Dynamite ,  Madame Satan , and his 1931 remake of  The Squaw Man  were both critically and financially unsuccessful. He had completely adapted to the production of sound film besides despite the films poor dialogue. After his contract ended at MGM, he left, but no production studios would hire him. He attempted to create a guild of a half a dozen directors with the same creative desires called the Directors Guild. However, the idea failed due to lack of funding and commitment. Moreover, DeMille was audited by the ": null
    },
    {
        "Internal Revenue Service": "Internal Revenue Service"
    },
    {
        " due to issues with his production company. This was, according to DeMille, the lowest point of his career. DeMille traveled abroad to find employment until he was offered a deal at Paramount.     In 1932, DeMille returned to Paramount at the request of Lasky, bringing with him his own production unit. ;  His first film back at Paramount, The Sign of the Cross, was also his first success since leaving Paramount besides The King of Kings. DeMilles return was approved by Zukor under the condition that DeMille not exceed his production budget of $650,000 for The Sign of the Cross. Produced in eight weeks without exceeding budget, the film was financially successful. The Sign of the Cross was the first film to integrate all cinematic techniques. The film was considered a masterpiece and surpassed the quality of other sound films of the time. DeMille followed this epic uncharacteristically with two dramas released in 1933 and 1934.  This Day and Age  and  Four Frightened People  were box office disappointments, though Four Frightened People received good reviews. DeMille would stick to his large-budget spectaculars for the rest of his career.          Cecil B. DeMille was a conservative ": null
    },
    {
        "Republican": "Republican Party"
    },
    {
        " activist. He became more conservative as he aged, until he became a pillar of Californias political right-wing . ;  However, he lived two different lives. On the one hand, DeMille lived a life of strong Christian ethics, as exemplified through his wife and children. On the other hand, DeMilles private life, which included mistresses and adultery, conflicted with the Episcopalian integrity he portrayed. Additionally, he frequently contradicted his staunchly conservative viewpoints. His film The Volga Boatman gave a sympathetic portrayal of the Russian Revolution and he was fascinated by a trip to the Soviet Union in the 1930s. More in line with his conservative views, he was known as anti-union and worked to prevent unionizing of film production studios. However, according to DeMille himself, he was not anti-union and belonged to a few unions himself. He claimed he was rather against union leaders such as ": null
    },
    {
        "Walter Reuther": "Walter Reuther"
    },
    {
        " and ": null
    },
    {
        "Harry Bridges": "Harry Bridges"
    },
    {
        " whom he compared to dictators. He supported ": null
    },
    {
        "Herbert Hoover": "Herbert Hoover"
    },
    {
        " and in 1928 made his largest campaign donation to Hoover. However, in a contradiction, DeMille liked Franklin D. Roosevelt, finding him charismatic, tenacious, and intelligent. He agreed with Roosevelts abhorrence of Prohibition. DeMille lent Roosevelt a car for his campaign for the ": null
    },
    {
        "1932 United States presidential election": "1932 United States Presidential Election"
    },
    {
        " and voted for him. However, he would never again vote for a Democratic candidate in a presidential election.     From June 1, 1936, until January 22, 1945, Cecil B. DeMille hosted and directed  Lux Radio Theater , a weekly digest of current feature films. Broadcast on the ": null
    },
    {
        "Columbia Broadcasting System": "Columbia Broadcasting System"
    },
    {
        " from 1935 to 1954,  the Lux Radio show was one of the most popular weekly shows in the history of radio. While DeMille was host, the show had forty million weekly listeners, gaining DeMille an annual salary of $100,000. From 1936 to 1945, he produced, hosted, and directed all shows with the occasional exception of a guest director. He resigned from the Lux Radio Show because he refused to pay a dollar to the American Federation of Radio Artists because he did not believe that any organization had the right to levy a compulsory assessment upon any member.  Consequently, he had to resign from the radio show.     DeMille sued the union for reinstatement but lost. He then appealed to the California Supreme Court and lost again. When the AFRA expanded to television, DeMille was banned from television appearances. Consequently, he formed the DeMille Foundation for Political Freedom in order to campaign for the right to work. He began presenting speeches across the United States for the next few years. DeMilles primary criticism was of ": null
    },
    {
        "closed shop": "Closed Shop"
    },
    {
        "s, but later included criticism of communism and unions in general. The United States Supreme Court declined to review his case. Despite his loss, DeMille continued to lobby for the ": null
    },
    {
        "Taft-Hartley Act": "Taft-Hartley Act"
    },
    {
        ", which passed. This prohibited denying anyone the right to work if they refuse to pay a political assessment, however, the law did not apply retroactively. Consequently, DeMilles television and radio appearance ban lasted for the remainder of his life, though he was permitted to appear on radio or television to publicize a movie. ": null
    },
    {
        "William Keighley": "William Keighley"
    },
    {
        " was his replacement. DeMille would never again work on radio.        In 1939, DeMilles  Union Pacific  was successful through DeMilles collaboration with the ": null
    },
    {
        "Union Pacific Railroad": "Union Pacific Railroad"
    },
    {
        ". The Union Pacific gave DeMille access to historical data, early period trains, and expert crews, adding to the authenticity of the film. During pre-production of Union Pacific, DeMille was dealing with his first serious health issue. In March 1938, DeMille underwent a major emergency ": null
    },
    {
        "prostatectomy": "Prostatectomy"
    },
    {
        ". He suffered from a post-surgery infection from which he nearly did not recover, citing ": null
    },
    {
        "streptomycin": "Streptomycin"
    },
    {
        " as his saving grace. The surgery caused him to suffer from sexual dysfunction for the rest of his life, according to some family members. Following his surgery and the success of Union Pacific, in 1940, DeMille first used three-strip Technicolor in  North West Mounted Police . DeMille wanted to film in ": null
    },
    {
        "Canada": "Canada"
    },
    {
        "; however, due to budget constraints, the film was instead shot in ": null
    },
    {
        "Oregon": "Oregon"
    },
    {
        " and Hollywood. Critics were impressed with the visuals but found the scripts dull, calling it DeMilles poorest Western . Despite the criticism, it was Paramounts highest-grossing film of the year. Audiences liked its highly saturated color, so DeMille made no further black-and-white features. DeMille was anti-communist and abandoned a project in 1940 to film Ernest Hemingways  For Whom the Bell Tolls  due to its communist themes despite the fact he had already paid $100,000 for the rights to the novel. He was so eager to produce the film, that he hadnt yet read the novel. He claimed he abandoned the project in order to complete a different project, but in reality, it was to preserve his reputation and avoid appearing reactionary. While concurrently filmmaking, he served in World War II at the age of sixty as his neighborhood air-raid warden.     In 1942, DeMille worked with ": null
    },
    {
        "Jeanie MacPherson": "Jeanie Macpherson"
    },
    {
        " and brother William deMille in order to produce a film called Queen of Queens which was intended to be about ": null
    },
    {
        "Mary, mother of Jesus": "Mary, Mother Of Jesus"
    },
    {
        ". After reading the screenplay, ": null
    },
    {
        "Daniel A. Lord": "Daniel A. Lord"
    },
    {
        " warned DeMille that Catholics would find the film too irreverent, while non-Catholics would have considered the film Catholic propaganda. Consequently, the film was never made. Jeanie MacPherson would work as a scriptwriter for many of DeMilles films.  In 1938, DeMille supervised the compilation of film  Land of Liberty  to represent the contribution of the American film industry to the ": null
    },
    {
        "1939 New York Worlds Fair": "1939 New York Worlds Fair"
    },
    {
        ". DeMille used clips from his own films in Land of Liberty. Though the film wasnt high-grossing, it was well-received and DeMille was asked to shorten its running time to allow for more showings per day. MGM distributed the film in 1941 and donated profits to World War II relief charities.      In 1942, DeMille released Paramounts most successful film,  Reap the Wild Wind . It was produced with a large budget and contained many special effects including an electronically operated ": null
    },
    {
        "giant squid": "Giant Squid"
    },
    {
        ". After working on Reap the Wild Wind, in ": null
    },
    {
        "1944": "U.S. Presidential Election, 1944"
    },
    {
        ", he was the ": null
    },
    {
        "master of ceremonies": "Master Of Ceremonies"
    },
    {
        " at the massive rally organized by ": null
    },
    {
        "David O. Selznick": "David O. Selznick"
    },
    {
        " in the ": null
    },
    {
        "Los Angeles Coliseum": "Los Angeles Coliseum"
    },
    {
        " in support of the ": null
    },
    {
        "Dewey": "Thomas E. Dewey"
    },
    {
        "-": null
    },
    {
        "Bricker": "John W. Bricker"
    },
    {
        " ticket as well as ": null
    },
    {
        "Governor": "Governor Of California"
    },
    {
        " Earl Warren": "Earl Warren"
    },
    {
        " of California.  DeMilles subsequent film  Unconquered  had the longest running time , longest filming schedule and largest budget of $5  million. The sets and effects were so realistic that 30 extras needed to be hospitalized due to a scene with fireballs and flaming arrows. It was very commercially successful.     DeMilles next film, Samson and Delilah in 1949, became Paramounts highest-grossing film up to that time. A Biblical epic with sex, it was a characteristically DeMille film. Again, 1952s The Greatest Show on Earth became Paramounts highest-grossing film to that point. Furthermore, DeMilles film won the Academy Award for Best Picture and the ": null
    },
    {
        "Academy Award for Best Story": "Academy Award For Best Story"
    },
    {
        ". The film began production in 1949, Ringling Brothers-Barnum and Bailey were paid $250,000 for use of the title and facilities. DeMille toured with the circus while helping write the script. Noisy and bright, it wasnt well-liked among critics, but was a favorite among audiences.   DeMille signed a contract with Prentice Hall publishers in August 1953 to publish an autobiography. DeMille would reminisce into a voice recorder, the recording would be transcribed, and the information would be organized in the biography based on the topic. Art Arthur also interviewed people for the autobiography. DeMille did not like the first draft of the biography, citing that he thought the person portrayed in the biography was an SOB ; he claimed it made him sound too egotistical. Besides filmmaking and finishing his autobiography, DeMille was involved in other projects. In the early 1950s, DeMille was recruited by ": null
    },
    {
        "Allen Dulles": "Allen Dulles"
    },
    {
        " and ": null
    },
    {
        "Frank Wisner": "Frank Wisner"
    },
    {
        " to serve on the board of the ": null
    },
    {
        "anti-communist": "Anti-Communist"
    },
    {
        " National Committee for a Free Europe": "National Committee For A Free Europe"
    },
    {
        ", the public face of the organization that oversaw the ": null
    },
    {
        "Radio Free Europe": "Radio Free Europe"
    },
    {
        " service. Weiner, Tim . Legacy of Ashes: The History of the CIA. New York: Doubleday. p. 36.  In 1954, Secretary of the Air Force ": null
    },
    {
        "Harold E. Talbott": "Harold E. Talbott"
    },
    {
        " asked DeMille for help in designing the cadet uniforms at the newly established ": null
    },
    {
        "United States Air Force Academy": "United States Air Force Academy"
    },
    {
        ". DeMilles designs, most notably his design of the distinctive cadet parade uniform, won praise from Air Force and Academy leadership, were ultimately adopted, and are still worn by cadets. Radford, Bill. A Digger, A Director and A Practical Joker . Colorado Springs Gazette, USAF Academy 50th Anniversary Edition, Spring 2004.       In 1952, DeMille sought approval for a lavish remake of his 1923 silent film The Ten Commandments. He went before the Paramount board of directors, which was mostly Jewish-American. The members rejected his proposal, even though his last two films, Samson and Delilah and The Greatest Show on Earth, had been record-breaking hits. ;  Adolph Zukor convinced the board to change their minds on the grounds of morality. DeMille did not have an exact budget proposal for the project, and it promised to be the most costly in U.S. film history. Still, the members unanimously approved it. The Ten Commandments, released in 1956, was DeMilles final film. It was the longest and most expensive film in Paramount history. Production of The Ten Commandments began in October 1954. The Exodus scene was filmed on-site in Egypt with the use of four Technicolor-VistaVision camera filming 12,000 people. They continued filming in 1955 in Paris and Hollywood on 30 different sound stages. They were even required to expand to RKO sound studios for filming. Post-production lasted a year and the film premiered in ": null
    },
    {
        "Salt Lake City": "Salt Lake City"
    },
    {
        ". Nominated for an Academy Award for Best Picture, it grossed over $80  million, which surpassed the gross of The Greatest Show on Earth and every other film in history, except for  Gone with the Wind . A unique practice at the time, DeMille offered ten percent of his profit to the crew.     On November 7, 1954, while in Egypt filming the ": null
    },
    {
        "Exodus": "The Exodus"
    },
    {
        " sequence for The Ten Commandments, DeMille climbed a  ladder to the top of the massive Per Rameses set and suffered a serious heart attack. Despite the urging of his associate producer, DeMille wanted to return to the set right away. DeMille developed a plan with his doctor to allow him to continue directing while reducing his physical stress. ;  Although DeMille completed the film, his health was diminished by several more heart attacks. His daughter Cecilia took over as director as DeMille sat behind the camera with ": null
    },
    {
        "Loyal Griggs": "Loyal Griggs"
    },
    {
        " as the cinematographer. This film would be his last.       Due to his frequent heart attacks, Cecil B. DeMille asked his son-in-law, actor ": null
    },
    {
        "Anthony Quinn": "Anthony Quinn"
    },
    {
        ", to direct a remake of his 1938 film  The Buccaneer . DeMille served as executive producer, overseeing producer ": null
    },
    {
        "Henry Wilcoxon": "Henry Wilcoxon"
    },
    {
        ". Despite a cast led by ": null
    },
    {
        "Charlton Heston": "Charlton Heston"
    },
    {
        " and ": null
    },
    {
        "Yul Brynner": "Yul Brynner"
    },
    {
        ", the 1958 film  The Buccaneer  was a disappointment. DeMille attended the Santa Barbara premiere of The Buccaneer in December 1958. DeMille was unable to attend the Los Angeles premiere of The Buccaneer. In the months before his death, DeMille was researching a film biography of ": null
    },
    {
        "Robert Baden-Powell": "Robert Baden-Powell, 1St Baron Baden-Powell"
    },
    {
        ", the founder of the ": null
    },
    {
        "Scout Movement": "Scouting"
    },
    {
        ". DeMille asked ": null
    },
    {
        "David Niven": "David Niven"
    },
    {
        " to star in the film, but it was never made. DeMille also was planning a film about the space race as well as another biblical epic about the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ". ;  DeMilles autobiography was mostly completed by the time DeMille died and was published in November 1959.        Cecil B. DeMille suffered a series of heart attacks from June 1958 to January 1959. On January 21, 1959, DeMille died of a ": null
    },
    {
        "heart attack": "Heart Attack"
    },
    {
        ". DeMilles funeral was held on January 23 at St. Stephens Episcopal Church. He was entombed at the ": null
    },
    {
        "Hollywood Memorial Cemetery": "Hollywood Forever Cemetery"
    },
    {
        " . Donnelley, Paul . Fade to Black: A Book of Movie Obituaries . Omnibus Press. p. 318. . After his death, notable news outlets such as The New York Times, Los Angeles Times, and The Guardian honored DeMille as pioneer of movies , the greatest creator and showman of our industry , and the founder of Hollywood . DeMille left his multi-million dollar estate in ": null
    },
    {
        "Los Feliz, Los Angeles": "Los Feliz, Los Angeles"
    },
    {
        " in Laughlin Park to his daughter Cecilia because his wife had dementia and was unable to care for an estate. She would die one year later.  His personal will drew a line between Cecilia and his three adopted children, with Cecilia receiving a majority of DeMilles inheritance and estate. The other three children were surprised by this, as DeMille did not treat the children differently in life. Cecilia lived in the house for many years but auctioned the house in the late 1980s.           DeMille believed his first influences to be his parents, Henry and Beatrice deMille. His playwright father introduced him to the theater at a young age. Henry was heavily influenced by the work of ": null
    },
    {
        "Charles Kingsley": "Charles Kingsley"
    },
    {
        " whose ideas trickled down to DeMille. DeMille noted that his mother had a high sense of the dramatic and was determined to continue the artistic legacy of her husband after he died. Beatrice became a play broker and authors agent, influencing DeMilles early life and career. DeMilles father worked with David Belasco theatrical producer, impresario, and playwright. Belasco was known for adding realistic elements in his plays such as real flowers, food, and aromas that could transport his audiences into the scenes. While working in theatre, DeMille used real fruit trees in his play California as influenced by Belasco. Similar to Belasco, DeMilles theatre was revolved around entertainment, rather than artistry. Generally, Belascos influence of DeMilles career can be seen in DeMilles showmanship and narration. E.H. Sotherns early influence on DeMilles work can be seen in DeMilles perfectionism.  DeMille recalled that one of the most influential plays he saw was Hamlet, directed by Sothern.       DeMilles filmmaking process always began with extensive research. Next, he would work with writers to develop the story that he was envisioning. Then, he would help writers construct a script. Finally, he would leave the script with artists and allow them to create artistic depictions and renderings of each scene. Plot and dialogue was not a strong point of DeMilles films. Consequently, he focused his efforts on his films visuals. He worked with visual technicians, editors, art directors, costume designers, cinematographers, and set carpenters in order to perfect the visual aspects of his films. With his editor, ": null
    },
    {
        "Anne Bauchens": "Anne Bauchens"
    },
    {
        ", DeMille used editing techniques to allow the visual images to bring the plot to climax rather than dialogue. DeMille had large and frequent office conferences to discuss and examine all aspects of the working film including story-boards, props, and special effects.     DeMille rarely gave direction to actors; he preferred to office-direct where he would work with actors in his office, going over characters and reading through scripts. Any problems on the set were often fixed by writers in the office rather than on the set. DeMille did not believe a large movie set was the place to discuss minor character or line issues. DeMille was particularly adept at directing and managing large crowds in his films. ": null
    },
    {
        "Martin Scorsese": "Martin Scorsese"
    },
    {
        " recalled that DeMille had the skill to maintain control of not only the lead actors in a frame but the many extras in the frame as well. DeMille was adept at directing thousands of extras , and many of his pictures include spectacular set pieces: the toppling of the ": null
    },
    {
        "pagan": "Paganism"
    },
    {
        " temple in Samson and Delilah;  train wrecks in The Road to Yesterday, Union Pacific  and The Greatest Show on Earth;  the destruction of an airship in Madam Satan; and the parting of the ": null
    },
    {
        "Red Sea": "Red Sea"
    },
    {
        " in both versions of The Ten Commandments.       DeMille experimented in his early films with photographic light and shade which created dramatic shadows instead of glare. His specific use of lighting, influenced by his mentor David Belasco, was for the purpose of creating striking images and heightening dramatic situations . DeMille was unique in using this technique. In addition to his use of volatile and abrupt film editing, his lighting and composition were innovative for the time period as filmmakers were primarily concerned with a clear, realistic image. Another important aspect of DeMilles editing technique was to put the film away for a week or two after an initial edit in order to re-edit the picture with a fresh mind. This allowed for the rapid production of his films in the early years of the Lasky Company. The cuts were sometimes rough, but the movies were always interesting.     DeMille often edited in a manner that favored psychological space rather than physical space through his cuts. In this way, the characters thoughts and desires are the visual focus rather than the circumstances regarding the physical scene. As DeMilles career progressed, he increasingly relied on artist Dan Sayre Groesbecks concept, costume, and storyboard art. Groesbecks art was circulated on set to give actors and crew members a better understanding of DeMilles vision. His art was even shown at Paramount meetings when pitching new films. DeMille adored the art of Groesbeck, even hanging it above his fireplace, but film staff found it difficult to convert his art into three-dimensional sets. As DeMille continued to rely on Groesbeck, the nervous energy of his early films transformed into more steady compositions of his later films. While visually appealing, this made the films appear more old-fashioned.     Composer ": null
    },
    {
        "Elmer Bernstein": "Elmer Bernstein"
    },
    {
        " described DeMille as, sparing no effort , when filmmaking. Bernstein recalled that DeMille would scream, yell, or flatter, whatever it took to achieve the perfection he required in his films. DeMille was painstakingly attentive to details on set and was as critical of himself as he was of his crew. Costume designer Dorothy Jenkins, who worked with DeMille on The Ten Commandments , described that DeMille was skilled in humiliating people. Jenkins admitted that she received quality training from DeMille, but that it was necessary to become a perfectionist on a DeMille set to avoid being fired.  DeMille had an authoritarian persona on set; he required absolute attention from the cast and crew. He had a band of assistants who catered to his needs. He would speak to the entire set, sometimes enormous with countless numbers of crew members and extras, via a microphone to maintain control of the set. He was disliked by many inside and outside of the film industry due to his cold and controlling reputation.     DeMille was known for autocratic behavior on the set, singling out and berating extras who were not paying attention. A number of these displays were thought to be staged, however, as an exercise in discipline. He despised actors who were unwilling to take physical risks, especially when he had first demonstrated that the required stunt would not harm them. This occurred with ": null
    },
    {
        "Victor Mature": "Victor Mature"
    },
    {
        " in Samson and Delilah. Mature refused to wrestle Jackie the Lion, even though DeMille had just tussled with the lion, proving that he was tame. DeMille told the actor that he was one hundred percent yellow . ": null
    },
    {
        "Paulette Goddards": "Paulette Goddard"
    },
    {
        "refusal to risk personal injury in a scene involving fire in Unconquered cost her DeMilles favor and a role in The Greatest Show on Earth. DeMille did receive help in his films, notably from ": null
    },
    {
        "Alvin Wyckoff": "Alvin Wyckoff"
    },
    {
        " who shot forty-three of DeMilles films; brother William deMille who would occasionally serve as his screenwriter; and Jeanie Macpherson, who served as DeMilles exclusive screenwriter for fifteen years;  and Eddie Salven, DeMiles favorite assistant director.     DeMille made stars of unknown actors: Gloria Swanson, ": null
    },
    {
        "Bebe Daniels": "Bebe Daniels"
    },
    {
        ", ": null
    },
    {
        "Rod La Rocque": "Rod La Rocque"
    },
    {
        ", ": null
    },
    {
        "William Boyd": "William Boyd"
    },
    {
        ", ": null
    },
    {
        "Claudette Colbert": "Claudette Colbert"
    },
    {
        ", and Charlton Heston.    He also cast established stars such as Gary Cooper, ": null
    },
    {
        "Robert Preston": "Robert Preston"
    },
    {
        ", Paulette Goddard and ": null
    },
    {
        "Fredric March": "Fredric March"
    },
    {
        " in multiple pictures.   DeMille displayed a loyalty to his performers, casting them repeatedly including: Henry Wilcoxon,  ": null
    },
    {
        "Julia Faye": "Julia Faye"
    },
    {
        ", ": null
    },
    {
        "Joseph Schildkraut": "Joseph Schildkraut"
    },
    {
        ",  ": null
    },
    {
        "Ian Keith": "Ian Keith"
    },
    {
        ", ": null
    },
    {
        "Charles Bickford": "Charles Bickford"
    },
    {
        ", ": null
    },
    {
        "Theodore Roberts": "Theodore Roberts"
    },
    {
        ", ": null
    },
    {
        "Akim Tamiroff": "Akim Tamiroff"
    },
    {
        "  and William Boyd.   DeMille was credited by actor ": null
    },
    {
        "Edward G. Robinson": "Edward G. Robinson"
    },
    {
        " with saving his career following his eclipse in the ": null
    },
    {
        "Hollywood blacklist": "Hollywood Blacklist"
    },
    {
        ".       Cecil B. DeMilles film production career evolved from critically significant silent films to financially significant sounds films. He began his career with reserved yet brilliant melodramas. From there, DeMilles style developed into marital comedies with outrageously melodramatic plots. In order to attract a high-class audience, DeMille based many of his early films on stage melodramas, novels, and short stories. He began the production of epics earlier in his career until they began to solidify his career in the 1920s. By 1930, DeMille had perfected his film style of mass-interest spectacle films with Western, Roman, or Biblical themes. DeMille was often criticized for making his spectacles too colorful and for being too occupied with entertaining the audience rather than accessing the artistic and auteur possibilities that film could provide. However, others interpreted DeMilles work as visually impressive, thrilling, and nostalgic. Along the same lines, critics of DeMille often qualify him by his later spectacles and fail to consider several decades of ingenuity and energy that defined him during his generation. Throughout his career, he did not alter his films to better adhere to contemporary or popular styles. Actor Charlton Heston admitted DeMille was, terribly unfashionable and ": null
    },
    {
        "Sidney Lumet": "Sidney Lumet"
    },
    {
        " called Demille, the cheap version of ": null
    },
    {
        "D.W. Griffith": "D.W. Griffith"
    },
    {
        ", adding that DeMille, ..an original thought in his head, though Heston added that DeMille was much more than that.      According to Scott Eyman, DeMilles films were at the same time masculine and feminine due to his thematic adventurousness and his eye for the extravagant. DeMilles distinctive style can be seen through camera and lighting effects as early as The Squaw Man with the use of daydream images; moonlight and sunset on a mountain; and side-lighting through a tent flap. In the early age of cinema, DeMille differentiated the Lasky Company from other production companies due to the use of dramatic, low-key lighting they called Lasky lighting and marketed as ": null
    },
    {
        "Rembrandt lighting": "Rembrandt Lighting"
    },
    {
        " to appeal to the public. DeMille achieved international recognition for his unique use of lighting and color tint in his film The Cheat. ;  DeMilles 1956 version of The Ten Commandments, according to director Martin Scorsese, is renowned for its level of production and the care and detail that went into creating the film. He stated that The Ten Commandments was the final culmination of DeMilles style.     DeMille was interested in art and his favorite artist was ": null
    },
    {
        "Gustave Doré": "Gustave Doré"
    },
    {
        "; DeMille based some of his most well-known scenes on the work of Doré. DeMille was the first director to connect art to filmmaking; he created the title of art director on the film set. DeMille was also known for his use of special effects without the use of digital technology. Notably, DeMille created the parting of the red seas scene in his 1956 The Ten Commandments without the use of digital effects. This is exemplified by the sea of extras in the scene which are real people, not digitally created. One of the most expensive special effects in film history, and called by ": null
    },
    {
        "Steven Spielberg": "Steven Spielberg"
    },
    {
        ", the greatest special effect in movie history, the actual parting of the sea was created by pouring 300,000 gallons of water into a tank and playing the clip backward.      Aside from his Biblical and historical epics which are concerned with how man relates to God, some of DeMilles films contained themes of neo-naturalism which portray the conflict between the laws of man and the laws of nature.  Although he is known for his later spectacular films, his early films are held in high regard by critics and film historians. DeMille discovered the possibilities of the bathroom or boudoir in film without being vulgar or cheap . DeMilles films Male and Female,  Why Change Your Wife? , and The Affairs of Anatol can be retrospectively described as ": null
    },
    {
        "high camp": "Camp"
    },
    {
        " and are categorized as early DeMille films due to their particular style of production and costume and set design. However, his earlier films The Captive,  Kindling ,  Carmen , and  The Whispering Chorus  are more serious films. It is difficult to typify DeMilles films into one specific genre. His first three films were Westerns, and he filmed many Westerns throughout his career. However, throughout his career, he filmed comedies, periodic and contemporary romances, dramas, fantasies, propaganda, Biblical spectacles, musical comedies, suspense, and war films. At least one DeMille film can represent each film genre. DeMille produced the majority of his films before the 1930s, and by the time sound films were invented, film critics saw DeMille as antiquated, with his best filmmaking years behind him.     DeMilles film contained a number of similar themes throughout his career. However, the films of his silent era were often thematically different than the films of his sound era. His silent era films often included the battle of the sexes theme due to the era of womens suffrage and the enlarging role of women in society. Moreover, before his religious-themed films, many of his silent era films revolved around husband-and-wife-divorce-and-remarry satires , considerably more adult-themed. According to Simon Louvish, these films reflected DeMilles inner thoughts and opinions about marriage and human sexuality. Religion was a theme that DeMille returned to throughout his career. Of his seventy films, five revolved around stories of the Bible and the New Testament; however many others, while not direct retellings of Biblical stories, had themes of faith and religious fanaticism in films such as The Crusades and The Road to Yesterday. Western and frontier American were also themes that DeMille returned to throughout his career. His first several films were westerns and he produced a chain of westerns during the sound era. Instead of portraying the danger and anarchy of the West, he portrayed the opportunity and redemption found in Western America. Another common theme in DeMilles films is the reversal of fortune and the portrayal of the rich and the poor, including the war of the classes and man versus society conflicts such as in The Golden Chance and The Cheat. In relation to his own interests and sexual preferences, ": null
    },
    {
        "sadomasochism": "Sadomasochism"
    },
    {
        " was a minor theme present in some of his films. Another minor characteristic of DeMilles films include train crashes which can be found in several of his films.       Known as the father of the Hollywood motion picture industry, Cecil B. DeMille made seventy films including several box-office hits. DeMille is one of the most commercially successful film directors in history ;  with his films prior to the release of The Ten Commandments estimated to have grossed $650  million worldwide.  Adjusted for inflation, DeMilles remake of The Ten Commandments is the eighth highest-grossing film in the world.  According to Sam Goldwyn, critics did not like DeMilles films, but the audiences did and they have the final word . Similarly, scholar David Blanke, argued that DeMille had lost the respect of his colleagues and film critics by his late film career. However, his final films maintained that DeMille was still respected by his audiences. Five of DeMilles film were the highest-grossing films at the year of their release, with only Spielberg topping him with six of his films as the highest-grossing films of the year. DeMilles highest-grossing films include: The Sign of the Cross , Unconquered , Samson and Delilah , The Greatest Show on Earth , and The Ten Commandments .  Director ": null
    },
    {
        "Ridley Scott": "Ridley Scott"
    },
    {
        " has been called the Cecil B. DeMille of the digital era due to his classical and medieval epics.      Despite his box office success, awards, and artistic achievements, DeMille has been dismissed and ignored by critics both during his life and posthumously. He was consistently criticized for producing shallow films without talent or artistic care. Compared to other directors, few film scholars have taken the time to academically analyze his films and style. During the ": null
    },
    {
        "French New Wave": "French New Wave"
    },
    {
        ", critics began to categorize certain filmmakers as ": null
    },
    {
        "auteurs": "Auteur"
    },
    {
        "such as ": null
    },
    {
        "Howard Hawks": "Howard Hawks"
    },
    {
        ", ": null
    },
    {
        "John Ford": "John Ford"
    },
    {
        ", and ": null
    },
    {
        "Raoul Walsh": "Raoul Walsh"
    },
    {
        ". DeMille was left off the list, determined to be too unsophisticated and antiquated to be considered an auteur. However, ": null
    },
    {
        "Simon Louvish": "Simon Louvish"
    },
    {
        " wrote, he was the complete master and auteur of his films  and Anton Kozlovic called him the unsung American auteur . ": null
    },
    {
        "Andrew Sarris": "Andrew Sarris"
    },
    {
        ", a leading proponent of the auteur theory, ranked DeMille highly as an auteur in the Far Side of Paradise , just below the Pantheon . Sarris added that despite the influence of styles of contemporary directors throughout his career, DeMilles style remained unchanged. ": null
    },
    {
        "Robert Birchard": "Robert Birchard"
    },
    {
        " wrote one could argue auteurship of DeMille on the basis that DeMilles thematic and visual style remained consistent throughout his career. However, Birchard acknowledged that Sarriss point was more likely that DeMilles style was behind the development of film as an art form. Meanwhile, Sumiko Higashi sees DeMille as not only a figure who was shaped and influenced by the forces of his era but as a filmmaker who left his own signature on the ": null
    },
    {
        "culture industry": "Culture Industry"
    },
    {
        ".  The critic ": null
    },
    {
        "Camille Paglia": "Camille Paglia"
    },
    {
        " has called The Ten Commandments one of the ten greatest films of all time.       DeMille was one of the first directors to become a celebrity in his own right.  He cultivated the image of the omnipotent director,  complete with ": null
    },
    {
        "megaphone": "Megaphone"
    },
    {
        ", ": null
    },
    {
        "riding crop": "Riding Crop"
    },
    {
        ", and ": null
    },
    {
        "jodhpurs": "Jodhpurs"
    },
    {
        ".   He was known for his unique, working wardrobe which included riding boots, riding pants, and soft, open necked shirts. ": null
    },
    {
        "Joseph Henabery": "Joseph Henabery"
    },
    {
        " recalled that DeMille looked like a king on a throne surrounded by his court while directing films on a camera platform.     DeMille was respected by his peers, yet his individual films were sometimes criticized. Directorially, I think his pictures were the most horrible things Ive ever seen in my life , said director ": null
    },
    {
        "William Wellman": "William Wellman"
    },
    {
        ". But he put on pictures that made a fortune. In that respect, he was better than any of us, Wellman added. Brownlow, K. . The Parades Gone by... Berkeley, California: University of California Press. p. 185. . Producer David O. Selznick wrote: There has appeared only one Cecil B. DeMille. He is one of the most extraordinarily able showmen of modern times. However much I may dislike some of his pictures, it would be very silly of me, as a producer of commercial motion pictures, to demean for an instant his unparalleled skill as a maker of mass entertainment. Presley, Cecil B. DeMille, p. 357. ": null
    },
    {
        "Salvador Dalí": "Salvador Dalí"
    },
    {
        " wrote that DeMille, ": null
    },
    {
        "Walt Disney": "Walt Disney"
    },
    {
        " and the ": null
    },
    {
        "Marx Brothers": "Marx Brothers"
    },
    {
        " were the three great American ": null
    },
    {
        "Surrealists": "Surrealism"
    },
    {
        " . DeMille appeared as himself in numerous films, including the MGM comedy  Free and Easy . He often appeared in his coming-attraction trailers and narrated many of his later films, even stepping on screen to introduce The Ten Commandments.  DeMille was immortalized in ": null
    },
    {
        "Billy Wilders": "Billy Wilder"
    },
    {
        "  Sunset Boulevard  when Gloria Swanson spoke the line: All right, Mr. DeMille. Im ready for my close-up. DeMille plays himself in the film. DeMilles reputation had a renaissance in the 2010s.      As a filmmaker, DeMille was the aesthetic inspiration of many directors and films due to his early influence during the crucial development of the film industry. DeMilles early silent comedies influenced the comedies of ": null
    },
    {
        "Ernst Lubitsch": "Ernst Lubitsch"
    },
    {
        " and Charlie Chaplins  A Woman of Paris . Additionally, DeMilles epics such as The Crusades influenced ": null
    },
    {
        "Sergei Eisensteins": "Sergei Eisenstein"
    },
    {
        "  Alexander Navsky . Moreover, DeMilles epics inspired directors such as Howard Hawks, ": null
    },
    {
        "Nicholas Ray": "Nicholas Ray"
    },
    {
        ", ": null
    },
    {
        "Joseph L. Mankiewicz": "Joseph L. Mankiewicz"
    },
    {
        ", and ": null
    },
    {
        "George Stevens": "George Stevens"
    },
    {
        " to try producing epics. Cecil B. DeMille has influenced the work of several well-known directors. ": null
    },
    {
        "Alfred Hitchcock": "Alfred Hitchcock"
    },
    {
        " cited DeMilles 1921 film  Forbidden Fruit  as an influence of his work and one of his top ten favorite films.  DeMille has influenced the careers of many modern directors. Martin Scorsese cited Unconquered, Samson and Delilah, and The Greatest Show on Earth as DeMille films that have imparted lasting memories on him. Scorsese admitted to having viewed The Ten Commandments forty or fifty times.  Famed director Steven Spielberg stated that DeMilles The Greatest Show on Earth was one of the films that influenced him to become a filmmaker. Furthermore, DeMille influenced about half of Spielbergs films, including  War of the Worlds . The Ten Commandments inspired ": null
    },
    {
        "DreamWorks Animations": "Dreamworks Animation"
    },
    {
        "later film about Moses,  The Prince of Egypt .  As one of the establishing members of the Paramount Pictures and co-founder of Hollywood, DeMille had a role in the development of the film industry.  Consequently, the name DeMille has become synonymous with filmmaking.     Publicly Episcopalian, DeMille drew on his ": null
    },
    {
        "Christian": "Christians"
    },
    {
        " and ": null
    },
    {
        "Jewish": "Jews"
    },
    {
        " heritage to convey a message of tolerance.   DeMille received more than a dozen awards from Jewish religious and cultural groups, including ": null
    },
    {
        "Bnai Brith": "Bnai Brith"
    },
    {
        ". However, not everyone received DeMilles religious films favorably. DeMille was accused of antisemitism after the release of The King of Kings, and director ": null
    },
    {
        "John Ford": "John Ford"
    },
    {
        " despised DeMille for what he saw as hollow biblical epics meant to promote DeMilles reputation during the politically turbulent 1950s.  In response to the claims, DeMille donated some of the profits from The King of Kings to charity.  In the 2012  Sight & Sound  poll, both DeMilles Samson and Delilah and 1923 version of The Ten Commandments received votes, but did not make the top 100 films.  Although many of DeMilles films are available on ": null
    },
    {
        "DVD": "Dvd"
    },
    {
        " and ": null
    },
    {
        "Blu-Ray": "Blu-Ray"
    },
    {
        " release, only twenty of his silent films are commercially available on DVD           The original ": null
    },
    {
        "Lasky-DeMille Barn": "Lasky-Demille Barn"
    },
    {
        " in which The Squaw Man was filmed was converted into a museum named the ": null
    },
    {
        "Hollywood Heritage Museum": "Hollywood Heritage Museum"
    },
    {
        " . It opened on December 13, 1985 and features some of DeMilles personal artifacts.   The Lasky-DeMille Barn was dedicated as a California historical landmark in a ceremony on December 27, 1956; DeMille was the keynote speaker. and was listed on the ": null
    },
    {
        "National Register of Historic Places": "National Register Of Historic Places"
    },
    {
        " in 2014.  The Dunes Center in ": null
    },
    {
        "Guadalupe, California": "Guadalupe, California"
    },
    {
        " contains an exhibition of artifacts uncovered in the desert near Guadalupe from DeMilles set of his 1923 version of The Ten Commandments, known as the Lost City of Cecil B. DeMille .   Donated by the Cecil B. DeMille Foundation in 2004, the moving image collection of Cecil B. DeMille is held at the ": null
    },
    {
        "Academy Film Archive": "Academy Film Archive"
    },
    {
        " and includes home movies, outtakes, and never-before-seen test footage.      In summer 2019, The Friends of the Pompton Lakes Library hosted a Cecil B DeMille film festival to celebrate DeMilles achievements and connection to Pompton Lakes. They screened four of his films at Christ Church, where DeMille and his family attended church when they lived there.  Two schools have been named after him: Cecil B. DeMille Middle School, in ": null
    },
    {
        "Long Beach, California": "Long Beach, California"
    },
    {
        ", which was closed and demolished in 2010 to make way for a new high school;  and Cecil B. DeMille Elementary School in ": null
    },
    {
        "Midway City, California": "Midway City, California"
    },
    {
        ".   The former film building at ": null
    },
    {
        "Chapman University": "Chapman University"
    },
    {
        " in ": null
    },
    {
        "Orange, California": "Orange, California"
    },
    {
        " is named in honor of DeMille.  During the Apollo 11 mission, Buzz Aldrin refers to himself in one instance as Cecil B. DeAldrin , as a humorous nod to DeMille.  The title of the 2000 ": null
    },
    {
        "John Waters": "John Waters"
    },
    {
        " film  Cecil B. Demented  alludes to DeMille.       DeMilles legacy is maintained by his granddaughter Cecilia DeMille Presley who serves as the president of the Cecil B. DeMille Foundation, which strives to support higher education, child welfare, and film in Southern California.  In 1963, the Cecil B. DeMille Foundation donated the Paradise ranch to the Hathaway Foundation, which cares for emotionally disturbed and abused children. A large collection of DeMilles materials including scripts, storyboards, and films resides at ": null
    },
    {
        "Brigham Young University": "Brigham Young University"
    },
    {
        " in ": null
    },
    {
        "L. Tom Perry Special Collections": "L. Tom Perry Special Collections"
    },
    {
        ".            Cecil B. DeMille received many awards and honors, especially later in his career. The American Academy of Dramatic Arts honored DeMille with an Alumni Achievement Award in 1958. ;  In 1957, DeMille gave the commencement address for the graduation ceremony of Brigham Young University wherein he received an honorary Doctorate of Letter degree.  Additionally, in 1958, he received an honorary Doctorate of Law degree from ": null
    },
    {
        "Temple University": "Temple University"
    },
    {
        ". From the film industry, DeMille received the Irving G. Thalberg Memorial Award at the Academy Awards in 1953, and a Lifetime Achievement Award from the Directors Guild of America Award the same year.  In the same ceremony, DeMille received a nomination from Directors Guild of America Award for Outstanding Directorial Achievement in Motion Pictures for The Greatest Show on Earth.  In 1952, DeMille was awarded the first Cecil B. DeMille Award at the ": null
    },
    {
        "Golden Globe": "Golden Globe"
    },
    {
        "s. An annual award, the Golden Globes Cecil B. DeMille Award recognizes lifetime achievement in the film industry.    For his contribution to the motion picture and radio industry, DeMille has two stars on the ": null
    },
    {
        "Hollywood Walk of Fame": "Hollywood Walk Of Fame"
    },
    {
        ". The first, for radio contributions, is located at 6240 Hollywood Blvd. The second star is located at 1725 Vine Street.      DeMille received two ": null
    },
    {
        "Academy Awards": "Academy Awards"
    },
    {
        " and a Best Picture award in 1953 for The Greatest Show on Earth. DeMille received a Golden Globe Award for Best Director  and was additionally nominated for the ": null
    },
    {
        "Best Director": "Academy Award For Best Director"
    },
    {
        " category at the 1953 Academy Awards for the same film.  He was further nominated in the Best Picture category for The Ten Commandments at the 1957 Academy Awards.  DeMilles Union Pacific received a ": null
    },
    {
        "Palme dOr": "Palme Dor"
    },
    {
        " in retrospect at the 2002 Cannes Film Festival.      Two of DeMilles films have been selected for preservation in the ": null
    },
    {
        "National Film Registry": "National Film Registry"
    },
    {
        " by the United States ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        "The Cheat and The Ten Commandments .        Cecil B. DeMille made seventy features. Fifty-two of his features are silent films. The first twenty-four of his silent films were made in the first three years of his career . Eight of his films were epics with five of those classified as Biblical . Seven of DeMilles films including The Arab, The Wild Goose Chase, Chimmie Fadden, The Dream Girl, The Devil-Stone, We Cant Have Everything, and The Squaw Man were destroyed due to nitrate decomposition and are considered lost. The Ten Commandments, is broadcast every Saturday at Passover in the United States on the ": null
    },
    {
        "ABC Television Network": "Abc Television Network"
    },
    {
        ".        Filmography obtained from Fifty Hollywood Directors.       Silent films      Sound films          These films represent those which DeMille produced or assisted in directing, credited or uncredited.    Brewsters Millions      The Master Mind     The Only Son      The Man on the Box     The Ghost Breaker    After Five    Nan of Music Mountain    Chicago      When Worlds Collide      The War of the Worlds      The Buccaneer         DeMille frequently made cameos as himself in other Paramount films. Additionally, he often starred in prologues and special trailers that he created for his films, having an opportunity to personally address the audience.   ": null
    }
]