[
    {
        "In an ": null
    },
    {
        "archipelago": "Archipelago"
    },
    {
        " like the ": null
    },
    {
        "Hawaiian Islands": "Hawaiian Islands"
    },
    {
        " the water between ": null
    },
    {
        "islands": "Island"
    },
    {
        " is typically called a  channel  or passage. Described here are the channels between the islands of ": null
    },
    {
        "Hawaiʻi": "Hawaii"
    },
    {
        ", arranged from southeast to northwest.         The ʻAlenuihāhā separates the island of ": null
    },
    {
        "Hawaiʻi": "Hawaii"
    },
    {
        " and the island of ": null
    },
    {
        "Maui": "Maui"
    },
    {
        ". The maximum depth of this channel is , and the channel is 30 miles wide. There is a significant wind funnel effect in the channel, which is subject to scientific investigations. ʻAlenuihāhā means great billows smashing.        The ʻAlalākeiki Channel separates the islands of ": null
    },
    {
        "Kahoʻolawe": "Kahoolawe"
    },
    {
        " and ": null
    },
    {
        "Maui": "Maui"
    },
    {
        ", at a distance of 7 miles. ʻAlalākeiki means crying baby.         The Kealaikahiki Channel is the channel between ": null
    },
    {
        "Lānaʻi": "Lanai"
    },
    {
        " and ": null
    },
    {
        "Kahoʻolawe": "Kahoolawe"
    },
    {
        ". It literally means the road to ": null
    },
    {
        "Tahiti": "Tahiti"
    },
    {
        " ; if one takes a bearing off of Kealaikahiki Point on Kahoʻolawe while in the channel and heads directly straight, one arrives, more or less, in Tahiti. In practice, however, ": null
    },
    {
        "Polynesian navigators": "Polynesian Navigation"
    },
    {
        " probably did not quite ply a straight route to Tahiti. The channel is 17 miles wide.         The ʻAuʻau Channel is one of the most protected areas of ocean in the Hawaiian Islands, lying between ": null
    },
    {
        "Lānaʻi": "Lanai"
    },
    {
        " and Maui. The channel is also protected by ": null
    },
    {
        "Molokaʻi": "Molokai"
    },
    {
        " to the north, and Kahoʻolawe to the south. The depth of the channel reaches , and its width is . ʻAuʻau channel is a whale-watching center in the Hawaiian Islands. ": null
    },
    {
        "Humpback whales": "Humpback Whale"
    },
    {
        " migrate approximately 3,500 miles from ": null
    },
    {
        "Alaskan waters": "Alaska"
    },
    {
        " each autumn and spend the northern hemisphere winter months in the protected waters of the channel.     ʻAuʻau translates to to take a bath referring to its calm bath-like conditions.       The middle of the ʻAuʻau channel off Lahaina is known as the  Lahaina Roads . Once filled with whalers when Lahaina was a capital for that industry, Lahaina Roads were later adopted as an alternate anchorage for the main U.S. Pacific Fleet based at Pearl Harbor. In the planning for the attack on Pearl Harbor, the Japanese had hoped that the Pacific Fleet still utilized Lahaina as an anchorage as ships sunk in the deep water there would have been unrecoverable. However, Lahaina was not utilized, and the bulk of the fleet remained moored in Pearl Harbor. The Roads are still a common moorage for oceangoing cruise ships and naval vessels of many flags, including the U.S., whose crews enjoy liberty on the island.         The Pailolo Channel separates the islands of Molokaʻi and Maui. Although the channel is only about  at its shortest point, it is one of the windiest and roughest in the Hawaiian Islands.         The Kalohi Channel is the stretch of water separating ": null
    },
    {
        "Lānaʻi": "Lanai"
    },
    {
        " and ": null
    },
    {
        "Molokaʻi": "Molokai"
    },
    {
        ". Depth of water in this channel is about  and width is . This is one of the less treacherous channels between islands in the archipelago, although strong winds and choppy sea conditions are frequent. Kalolohia beach on the Lānaʻi coast is also known as Shipwreck Beach because of a wreck on the ": null
    },
    {
        "reef": "Reef"
    },
    {
        " there. Kalohi means the slowness.          The Kaiwi Channel separates the islands of ": null
    },
    {
        "Oʻahu": "Oahu"
    },
    {
        " and Molokaʻi, and is  wide. Maximum depth is . Ka Iwi means the bone . There are annual ": null
    },
    {
        "paddleboarding": "Paddleboarding"
    },
    {
        " and ": null
    },
    {
        "outrigger canoe paddling": "Outrigger Canoeing"
    },
    {
        " contests which traverse this channel.     Swimming the channel is one of the 7 challenges in the ": null
    },
    {
        "Oceans Seven": "Oceans Seven"
    },
    {
        " open water swimming series.         The Kaʻieʻie Waho Channel separates the islands of ": null
    },
    {
        "Kauaʻi": "Kauai"
    },
    {
        " and ": null
    },
    {
        "Oʻahu": "Oahu"
    },
    {
        ", at a distance of . Kaʻieʻie Waho means Outer Kaʻieʻie, named after the ʻieʻie vine . The maximum depth of the channel is over 11000 feet.         The Kaulakahi Channel separates the islands of ": null
    },
    {
        "Niʻihau": "Niihau"
    },
    {
        " and ": null
    },
    {
        "Kauaʻi": "Kauai"
    },
    {
        ". It is  wide. Kaulakahi translates to the single flame .        The Kumukahi Channel separates the islands of ": null
    },
    {
        "Niʻihau": "NiʻIhau"
    },
    {
        " and ": null
    },
    {
        "Lehua": "Lehua"
    },
    {
        ". Kumukahi means first beginning.        The Hoʻomoʻa Channel separates the islands of ": null
    },
    {
        "Lehua": "Lehua"
    },
    {
        " and ": null
    },
    {
        "Nihoa": "Nihoa"
    },
    {
        ". Hoʻomoʻa means to cook.        The Hawaiʻiloa Channel to the northwest of the islands of ": null
    },
    {
        "Nihoa": "Nihoa"
    },
    {
        ". Named after ": null
    },
    {
        "Hawaiʻiloa": "Hawaiiloa"
    },
    {
        ", hero of an ancient Hawaiian legend about the settling of the Hawaiian Islands.": null
    }
]