[
    {
        "     Chemical vapor deposition  is a ": null
    },
    {
        "vacuum deposition": "Vacuum Deposition"
    },
    {
        " method used to produce high quality, high-performance, solid materials. The process is often used in the ": null
    },
    {
        "semiconductor industry": "Semiconductor Industry"
    },
    {
        " to produce ": null
    },
    {
        "thin film": "Thin Film"
    },
    {
        "s.     In typical CVD, the ": null
    },
    {
        "wafer": "Wafer"
    },
    {
        " is exposed to one or more ": null
    },
    {
        "volatile": "Volatility"
    },
    {
        " precursors": "Wikt:Precursor"
    },
    {
        ", which ": null
    },
    {
        "react": "Chemical Reaction"
    },
    {
        " and/or ": null
    },
    {
        "decompose": "Chemical Decomposition"
    },
    {
        " on the substrate surface to produce the desired deposit. Frequently, volatile ": null
    },
    {
        "by-products": "By-Product"
    },
    {
        "are also produced, which are removed by gas flow through the reaction chamber.     ": null
    },
    {
        "Microfabrication": "Microfabrication"
    },
    {
        " processes widely use CVD to deposit materials in various forms, including: ": null
    },
    {
        "monocrystalline": "Single Crystal"
    },
    {
        ", ": null
    },
    {
        "polycrystalline": "Polycrystalline"
    },
    {
        ", ": null
    },
    {
        "amorphous": "Amorphous"
    },
    {
        ", and ": null
    },
    {
        "epitaxial": "Epitaxy"
    },
    {
        ". These materials include: ": null
    },
    {
        "silicon": "Silicon"
    },
    {
        " , carbon , ": null
    },
    {
        "fluorocarbon": "Fluorocarbon"
    },
    {
        "s, ": null
    },
    {
        "filaments": "Electrical Filament"
    },
    {
        ", ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        ", ": null
    },
    {
        "titanium nitride": "Titanium Nitride"
    },
    {
        " and various ": null
    },
    {
        "high-k dielectric": "High-K Dielectric"
    },
    {
        "s.               CVD is practiced in a variety of formats. These processes generally differ in the means by which chemical reactions are initiated.   Classified by operating conditions:   Atmospheric pressure CVD – CVD at atmospheric pressure.   Low-pressure CVD – CVD at sub-atmospheric pressures.  Reduced pressures tend to reduce unwanted gas-phase reactions and improve film uniformity across the wafer.   Ultrahigh vacuum CVD – CVD at very low pressure, typically below 10 −6 ": null
    },
    {
        "Pa": "Pascal"
    },
    {
        " . Note that in other fields, a lower division between high and ": null
    },
    {
        "ultra-high vacuum": "Ultra-High Vacuum"
    },
    {
        " is common, often 10 −7 Pa.     Most modern CVD is either LPCVD or UHVCVD.   Classified by physical characteristics of vapor:   Aerosol assisted CVD – CVD in which the precursors are transported to the substrate by means of a liquid/gas aerosol, which can be generated ultrasonically. This technique is suitable for use with non-volatile precursors.   Direct liquid injection CVD – CVD in which the precursors are in liquid form . Liquid solutions are injected in a vaporization chamber towards injectors . The precursor vapors are then transported to the substrate as in classical CVD. This technique is suitable for use on liquid or solid precursors. High growth rates can be reached using this technique.   Classified by type of substrate heating:   Hot wall CVD – CVD in which the chamber is heated by an external power source and the substrate is heated by radiation from the heated chamber walls.   Cold wall CVD – CVD in which only the substrate is directly heated either by induction or by passing current through the substrate itself or a heater in contact with the substrate. The chamber walls are at room temperature.   Plasma methods Microwave plasma-assisted CVD    Plasma-Enhanced CVD  – CVD that utilizes ": null
    },
    {
        "plasma": "Plasma"
    },
    {
        " to enhance chemical reaction rates of the precursors.  PECVD processing allows deposition at lower temperatures, which is often critical in the manufacture of semiconductors. The lower temperatures also allow for the deposition of organic coatings, such as plasma polymers, that have been used for nanoparticle surface functionalization.    Remote plasma-enhanced CVD – Similar to PECVD except that the wafer substrate is not directly in the plasma discharge region. Removing the wafer from the plasma region allows processing temperatures down to room temperature.    Low-Energy Plasma-Enhanced chemical vapor deposition  - CVD employing a high density, low energy plasma to obtain epitaxial deposition of semiconductor materials at high rates and low temperatures.   Atomic-layer CVD  – Deposits successive layers of different substances to produce layered, ": null
    },
    {
        "crystal": "Crystal"
    },
    {
        "line films. See ": null
    },
    {
        "Atomic layer epitaxy": "Atomic Layer Epitaxy"
    },
    {
        ".    Combustion Chemical Vapor Deposition  – Combustion Chemical Vapor Deposition or flame pyrolysis is an open-atmosphere, flame-based technique for depositing high-quality thin films and nanomaterials.   Hot filament CVD – also known as catalytic CVD or more commonly, initiated CVD , this process uses a hot filament to chemically decompose the source gases.  The filament temperature and substrate temperature thus are independently controlled, allowing colder temperatures for better absorption rates at the substrate and higher temperatures necessary for decomposition of precursors to free radicals at the filament.     Hybrid Physical-Chemical Vapor Deposition  – This process involves both chemical decomposition of precursor gas and ": null
    },
    {
        "vaporization": "Vaporization"
    },
    {
        " of a solid source.    Metalorganic chemical vapor deposition  – This CVD process is based on ": null
    },
    {
        "metalorganic": "Metalorganic"
    },
    {
        " precursors.   Rapid thermal CVD – This CVD process uses heating lamps or other methods to rapidly heat the wafer substrate. Heating only the substrate rather than the gas or chamber walls helps reduce unwanted gas-phase reactions that can lead to ": null
    },
    {
        "particle": "Particle"
    },
    {
        " formation.   Vapor-phase epitaxy   Photo-initiated CVD – This process uses UV light to stimulate chemical reactions. It is similar to plasma processing, given that plasmas are strong emitters of UV radiation. Under certain conditions, PICVD can be operated at or near atmospheric pressure.     Laser Chemical vapor deposition  - This CVD process uses lasers to heat spots or lines on a substrate in semiconductor applications. In MEMS and in fiber production the lasers are used rapidly to break down the precursor gas—process temperature can exceed 2000  °C—to build up a solid structure in much the same way as laser sintering based 3-D printers build up solids from powders.       CVD is commonly used to deposit conformal films and augment substrate surfaces in ways that more traditional surface modification techniques are not capable of. CVD is extremely useful in the process of ": null
    },
    {
        "atomic layer deposition": "Atomic Layer Deposition"
    },
    {
        " at depositing extremely thin layers of material. A variety of applications for such films exist. ": null
    },
    {
        "Gallium arsenide": "Gallium Arsenide"
    },
    {
        " is used in some ": null
    },
    {
        "integrated circuits": "Integrated Circuit"
    },
    {
        " and photovoltaic devices. Amorphous polysilicon is used in photovoltaic devices. Certain ": null
    },
    {
        "carbides": "Carbide"
    },
    {
        "and ": null
    },
    {
        "nitrides": "Nitride"
    },
    {
        "confer wear-resistance. Wahl, Georg et al. Thin Films in Ullmanns Encyclopedia of Industrial Chemistry, Wiley-VCH, Weinheim.  Polymerization by CVD, perhaps the most versatile of all applications, allows for super-thin coatings which possess some very desirable qualities, such as lubricity, hydrophobicity and weather-resistance to name a few.  CVD of ": null
    },
    {
        "metal-organic framework": "Metal-Organic Framework"
    },
    {
        "s, a class of crystalline nanoporous materials, has recently been demonstrated.  Applications for these films are anticipated in gas sensing and ": null
    },
    {
        "low-k dielectrics": "Low-K Dielectric"
    },
    {
        "  CVD techniques are adventageous for membrane coatings as well, such as those in desalination or water treatment, as these coatings can be sufficiently uniform and thin that they do not clog membrane pores.            ": null
    },
    {
        "Polycrystalline silicon": "Polycrystalline Silicon"
    },
    {
        " is deposited from ": null
    },
    {
        "trichlorosilane": "Trichlorosilane"
    },
    {
        " or ": null
    },
    {
        "silane": "Silane"
    },
    {
        " , using the following reactions:    :SiHCl 3 → Si + Cl 2 + HCl   :SiH 4 → Si + 2 H 2     This reaction is usually performed in LPCVD systems, with either pure silane feedstock, or a solution of silane with 70–80% ": null
    },
    {
        "nitrogen": "Nitrogen"
    },
    {
        ". Temperatures between 600 and 650  °C and pressures between 25 and 150 Pa yield a growth rate between 10 and 20 ": null
    },
    {
        "nm": "Nanometre"
    },
    {
        " per minute. An alternative process uses a ": null
    },
    {
        "hydrogen": "Hydrogen"
    },
    {
        "-based solution. The hydrogen reduces the growth rate, but the temperature is raised to 850 or even 1050  °C to compensate. Polysilicon may be grown directly with doping, if gases such as ": null
    },
    {
        "phosphine": "Phosphine"
    },
    {
        ", ": null
    },
    {
        "arsine": "Arsine"
    },
    {
        " or ": null
    },
    {
        "diborane": "Diborane"
    },
    {
        " are added to the CVD chamber. Diborane increases the growth rate, but arsine and phosphine decrease it.       Silicon dioxide may be deposited by several different processes. Common source gases include ": null
    },
    {
        "silane": "Silane"
    },
    {
        " and ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        ", ": null
    },
    {
        "dichlorosilane": "Dichlorosilane"
    },
    {
        " and ": null
    },
    {
        "nitrous oxide": "Nitrous Oxide"
    },
    {
        " Proceedings of the Third World Congress of Chemical Engineering, Tokyo, p. 290 , or ": null
    },
    {
        "tetraethylorthosilicate": "Tetraethylorthosilicate"
    },
    {
        " . The reactions are as follows:      :SiH 4 + O 2 → SiO 2 + 2 H 2     :SiCl 2 H 2 + 2 N 2 O → SiO 2 + 2 N 2 + 2 HCl     :Si 4 → SiO 2 + byproducts     The choice of source gas depends on the thermal stability of the substrate; for instance, ": null
    },
    {
        "aluminium": "Aluminium"
    },
    {
        " is sensitive to high temperature. Silane deposits between 300 and 500  °C, dichlorosilane at around 900  °C, and TEOS between 650 and 750  °C, resulting in a layer of low- temperature oxide . However, silane produces a lower-quality oxide than the other methods , and it deposits non": null
    },
    {
        "conformally": "Conformal Film"
    },
    {
        ". Any of these reactions may be used in LPCVD, but the silane reaction is also done in APCVD. CVD oxide invariably has lower quality than ": null
    },
    {
        "thermal oxide": "Thermal Oxidation"
    },
    {
        ", but thermal oxidation can only be used in the earliest stages of IC manufacturing.     Oxide may also be grown with impurities . This may have two purposes. During further process steps that occur at high temperature, the impurities may ": null
    },
    {
        "diffuse": "Atomic Diffusion"
    },
    {
        " from the oxide into adjacent layers and dope them. Oxides containing 5–15% impurities by mass are often used for this purpose. In addition, silicon dioxide alloyed with ": null
    },
    {
        "phosphorus pentoxide": "Phosphorus Pentoxide"
    },
    {
        " can be used to smooth out uneven surfaces. P-glass softens and reflows at temperatures above 1000  °C. This process requires a phosphorus concentration of at least 6%, but concentrations above 8% can corrode aluminium. Phosphorus is deposited from phosphine gas and oxygen:     :4 PH 3 + 5 O 2 → 2 P 2 O 5 + 6 H 2     ": null
    },
    {
        "Glass": "Glass"
    },
    {
        "es containing both boron and phosphorus undergo viscous flow at lower temperatures; around 850  °C is achievable with glasses containing around 5 weight % of both constituents, but stability in air can be difficult to achieve. Phosphorus oxide in high concentrations interacts with ambient moisture to produce phosphoric acid. Crystals of BPO 4 can also precipitate from the flowing glass on cooling; these crystals are not readily etched in the standard reactive plasmas used to pattern oxides, and will result in circuit defects in integrated circuit manufacturing.     Besides these intentional impurities, CVD oxide may contain byproducts of the deposition. TEOS produces a relatively pure oxide, whereas silane introduces hydrogen impurities, and dichlorosilane introduces ": null
    },
    {
        "chlorine": "Chlorine"
    },
    {
        ".     Lower temperature deposition of silicon dioxide and doped glasses from TEOS using ozone rather than oxygen has also been explored . Ozone glasses have excellent conformality but tend to be hygroscopic – that is, they absorb water from the air due to the incorporation of silanol in the glass. Infrared spectroscopy and mechanical strain as a function of temperature are valuable diagnostic tools for diagnosing such problems.       Silicon nitride is often used as an insulator and chemical barrier in manufacturing ICs. The following two reactions deposit silicon nitride from the gas phase:     :3 SiH 4 + 4 NH 3 → Si 3 N 4 + 12 H 2     :3 SiCl 2 H 2 + 4 NH 3 → Si 3 N 4 + 6 HCl + 6 H 2     Silicon nitride deposited by LPCVD contains up to 8% hydrogen. It also experiences strong tensile ": null
    },
    {
        "stress": "Stress"
    },
    {
        ", which may crack films thicker than 200  nm. However, it has higher ": null
    },
    {
        "resistivity": "Resistivity"
    },
    {
        " and dielectric strength than most insulators commonly available in microfabrication .     Another two reactions may be used in plasma to deposit SiNH:     :2 SiH 4 + N 2 → 2 SiNH + 3 H 2     :SiH 4 + NH 3 → SiNH + 3 H 2     These films have much less tensile stress, but worse electrical properties .        CVD for ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        " is achieved from ": null
    },
    {
        "tungsten hexafluoride": "Tungsten Hexafluoride"
    },
    {
        " , which may be deposited in two ways:     :WF 6 → W + 3 F 2   :WF 6 + 3 H 2 → W + 6 HF     Other metals, notably aluminium and ": null
    },
    {
        "copper": "Copper"
    },
    {
        ", can be deposited by CVD. , commercially cost-effective CVD for copper did not exist, although volatile sources exist, such as Cu 2 . Copper is typically deposited by ": null
    },
    {
        "electroplating": "Electroplating"
    },
    {
        ". Aluminum can be deposited from ": null
    },
    {
        "triisobutylaluminium": "Triisobutylaluminium"
    },
    {
        " and related ": null
    },
    {
        "organoaluminium compound": "Organoaluminium Compound"
    },
    {
        "s.     CVD for ": null
    },
    {
        "molybdenum": "Molybdenum"
    },
    {
        ", ": null
    },
    {
        "tantalum": "Tantalum"
    },
    {
        ", ": null
    },
    {
        "titanium": "Titanium"
    },
    {
        ", nickel is widely used. These metals can form useful ": null
    },
    {
        "silicides": "Silicide"
    },
    {
        "when deposited onto silicon. Mo, Ta and Ti are deposited by LPCVD, from their pentachlorides. Nickel, molybdenum, and tungsten can be deposited at low temperatures from their carbonyl precursors. In general, for an arbitrary metal M, the chloride deposition reaction is as follows:     :2 MCl 5 + 5 H 2 → 2 M + 10 HCl     whereas the carbonyl decomposition reaction can happen spontaneously under thermal treatment or acoustic cavitation and is as follows:     :M n → M + n CO     the decomposition of metal carbonyls is often violently precipitated by moisture or air, where oxygen reacts with the metal precursor to form metal or metal oxide along with carbon dioxide.     ": null
    },
    {
        "Niobium oxide": "Niobium Oxide"
    },
    {
        " layers can be produced by the thermal decomposition of ": null
    },
    {
        "niobium ethoxide": "Niobium Ethoxide"
    },
    {
        " with the loss of ": null
    },
    {
        "diethyl ether": "Diethyl Ether"
    },
    {
        "   according to the equation:     :2 Nb 5 → Nb 2 O 5 + 5 C 2 H 5 OC 2 H 5       Many variations of CVD can be utilized to synthesize graphene. Although many advancements have been made, the processes listed below are not commercially viable yet.   Carbon source     The most popular carbon source that is used to produce graphene is methane gas. One of the less popular choices is petroleum asphalt, notable for being inexpensive but more difficult to work with.      Although methane is the most popular carbon source, hydrogen is required during the preparation process to promote carbon deposition on the substrate. If the flow ratio of methane and hydrogen are not appropriate, it will cause undesirable results. During the growth of graphene, the role of methane is to provide a carbon source, the role of hydrogen is to provide H atoms to corrode amorphous C,  and improve the quality of graphene. But excessive H atoms can also corrode graphene.  As a result, the integrity of the crystal lattice is destroyed, and the quality of graphene is deteriorated.  Therefore, by optimizing the flow rate of methane and hydrogen gases in the growth process, the quality of graphene can be improved.     Use of catalyst   The use of catalyst is viable in changing the physical process of graphene production. Notable examples include iron nanoparticles, nickel foam, and gallium vapor. These catalysts can either be used in situ during graphene buildup,  or situated at some distance away at the deposition area.  Some catalysts require another step to remove them from the sample material.     The direct growth of high-quality, large single-crystalline domains of graphene on a dielectric substrate is of vital importance for applications in electronics and optoelectronics. Combining the advantages of both catalytic CVD and the ultra-flat dielectric substrate, gaseous catalyst-assisted CVD  paves the way for synthesizing high-quality graphene for device applications while avoiding the transfer process.   Physical conditions   Physical conditions such as surrounding pressure, temperature, carrier gas, and chamber material play a big role in production of graphene.     Most systems use LPCVD with pressures ranging from 1 to 1500 Pa.   However, some still use APCVD. Low pressures are used more commonly as they help prevent unwanted reactions and produce more uniform thickness of deposition on the substrate.     On the other hand, temperatures used range from 800–1050  °C. High temperatures translate to an increase of the rate of reaction. Caution has to be exercised as high temperatures do pose higher danger levels in addition to greater energy costs.   Carrier gas   Hydrogen gas and inert gases such as argon are flowed into the system. These gases act as a carrier, enhancing surface reaction and improving reaction rate, thereby increasing deposition of graphene onto the substrate.   Chamber material   Standard quartz tubing and chambers are used in CVD of graphene. Quartz is chosen because it has a very high melting point and is chemically inert. In other words, quartz does not interfere with any physical or chemical reactions regardless of the conditions.   Methods of analysis of results   Raman spectroscopy, X-ray spectroscopy, transmission electron microscopy , and scanning electron microscopy are used to examine and characterize the graphene samples.     Raman spectroscopy is used to characterize and identify the graphene particles; X-ray spectroscopy is used to characterize chemical states; TEM is used to provide fine details regarding the internal composition of graphene; SEM is used to examine the surface and topography.     Sometimes, atomic force microscopy is used to measure local properties such as friction and magnetism.     Cold wall CVD technique can be used to study the underlying surface science involved in graphene nucleation and growth as it allows unprecedented control of process parameters like gas flow rates, temperature and pressure as demonstrated in a recent study. The study was carried out in a home-built vertical cold wall system utilizing resistive heating by passing direct current through the substrate. It provided conclusive insight into a typical surface-mediated nucleation and growth mechanism involved in two-dimensional materials grown using catalytic CVD under conditions sought out in the semiconductor industry.         In spite of graphenes exciting electronic and thermal properties, it is unsuitable as a transistor for future digital devices, due to the absence of a bandgap between the conduction and valence bands. This makes it impossible to switch between on and off states with respect to electron flow. Scaling things down, graphene nanoribbons of less than 10  nm in width do exhibit electronic bandgaps and are therefore potential candidates for digital devices. Precise control over their dimensions, and hence electronic properties, however, represents a challenging goal, and the ribbons typically possess rough edges that are detrimental to their performance.                CVD can be used to produce a ": null
    },
    {
        "synthetic diamond": "Synthetic Diamond"
    },
    {
        " by creating the circumstances necessary for carbon atoms in a gas to settle on a substrate in crystalline form. CVD of diamonds has received much attention in the materials sciences because it allows many new applications that had previously been considered too expensive. CVD diamond growth typically occurs under low pressure  and involves feeding varying amounts of gases into a chamber, energizing them and providing conditions for diamond growth on the substrate. The gases always include a carbon source, and typically include hydrogen as well, though the amounts used vary greatly depending on the type of diamond being grown. Energy sources include ": null
    },
    {
        "hot filament": "Hot Filament"
    },
    {
        ", ": null
    },
    {
        "microwave": "Microwave"
    },
    {
        " power, and ": null
    },
    {
        "arc discharges": "Electric Arc"
    },
    {
        ", among others. The energy source is intended to generate a plasma in which the gases are broken down and more complex chemistries occur. The actual chemical process for diamond growth is still under study and is complicated by the very wide variety of diamond growth processes used.     Using CVD, films of diamond can be grown over large areas of substrate with control over the properties of the diamond produced. In the past, when high pressure high temperature techniques were used to produce a diamond, the result was typically very small free standing diamonds of varying sizes. With CVD diamond growth areas of greater than fifteen centimeters diameter have been achieved and much larger areas are likely to be successfully coated with diamond in the future. Improving this process is key to enabling several important applications.     The growth of diamond directly on a substrate allows the addition of many of diamonds important qualities to other materials. Since diamond has the highest ": null
    },
    {
        "thermal conductivity": "Thermal Conductivity"
    },
    {
        " of any bulk material, layering diamond onto high heat producing electronics allows the diamond to be used as a heat sink.   Diamond films are being grown on valve rings, cutting tools, and other objects that benefit from diamonds hardness and exceedingly low wear rate. In each case the diamond growth must be carefully done to achieve the necessary adhesion onto the substrate. Diamonds very high scratch resistance and thermal conductivity, combined with a lower ": null
    },
    {
        "coefficient of thermal expansion": "Coefficient Of Thermal Expansion"
    },
    {
        " than ": null
    },
    {
        "Pyrex": "Pyrex"
    },
    {
        " glass, a ": null
    },
    {
        "coefficient of friction": "Coefficient Of Friction"
    },
    {
        " close to that of Teflon  and strong ": null
    },
    {
        "lipophilicity": "Lipophilicity"
    },
    {
        " would make it a nearly ideal non-stick coating for cookware if large substrate areas could be coated economically.     CVD growth allows one to control the properties of the diamond produced. In the area of diamond growth, the word diamond is used as a description of any material primarily made up of ": null
    },
    {
        "sp3-bonded": "Orbital Hybridisationsp3"
    },
    {
        " carbon, and there are many different types of diamond included in this. By regulating the processing parameters—especially the gases introduced, but also including the pressure the system is operated under, the temperature of the diamond, and the method of generating plasma—many different materials that can be considered diamond can be made. Single crystal diamond can be made containing various ": null
    },
    {
        "dopant": "Dopant"
    },
    {
        "s.  ": null
    },
    {
        "Polycrystalline diamond": "Synthetic Diamondcrystallinity"
    },
    {
        " consisting of grain sizes from several ": null
    },
    {
        "nanometers": "Nanometer"
    },
    {
        "to several ": null
    },
    {
        "micrometers": "Micrometre"
    },
    {
        " can be grown.  Some polycrystalline diamond grains are surrounded by thin, non-diamond carbon, while others are not. These different factors affect the diamonds hardness, smoothness, conductivity, optical properties and more.       Commercially, ": null
    },
    {
        "mercury cadmium telluride": "Mercury Cadmium Telluride"
    },
    {
        " is of continuing interest for detection of infrared radiation. Consisting of an ": null
    },
    {
        "alloy": "Alloy"
    }
]