[
    {
        "      A Chianti wine  is any ": null
    },
    {
        "wine": "Wine"
    },
    {
        " produced in the ": null
    },
    {
        "Chianti region": "Chianti"
    },
    {
        " of central ": null
    },
    {
        "Tuscany": "Tuscan Wine"
    },
    {
        ". It was historically associated with a squat bottle enclosed in a straw basket, called a  fiasco  . However, the fiasco is only used by a few makers of the wine as most Chianti is now bottled in more standard shaped wine bottles. Baron ": null
    },
    {
        "Bettino Ricasoli": "Bettino Ricasoli"
    },
    {
        "  created the Chianti recipe of 70% ": null
    },
    {
        "Sangiovese": "Sangiovese"
    },
    {
        ", 15% ": null
    },
    {
        "Canaiolo": "Canaiolo"
    },
    {
        " and 15% ": null
    },
    {
        "Malvasia bianca": "Malvasia"
    },
    {
        " in the middle of the 19th century. J. Robinson The Oxford Companion to Wine Third Edition pg 162–163 Oxford University Press 2006      The first definition of a wine-area called Chianti was made in 1716. It described the area near the villages of ": null
    },
    {
        "Gaiole": "Gaiole"
    },
    {
        ", ": null
    },
    {
        "Castellina": "Castellina"
    },
    {
        " and ": null
    },
    {
        "Radda": "Radda"
    },
    {
        "; the so-called Lega del Chianti and later Provincia del Chianti . In 1932 the Chianti area was completely re-drawn and divided in seven sub-areas: Classico, Colli Aretini, Colli Fiorentini, Colline Pisane, Colli Senesi, Montalbano and Rùfina. Most of the villages that in 1932 were suddenly included in the new Chianti Classico area added in Chianti to their name-such as ": null
    },
    {
        "Greve in Chianti": "Greve In Chianti"
    },
    {
        " which amended its name in 1972. Wines labelled Chianti Classico come from the biggest sub-area of Chianti, that includes the original Chianti heartland. Only Chianti from this sub-zone may boast the black rooster seal  on the neck of the bottle, which indicates that the producer of the wine is a member of the Chianti Classico Consortium, the local association of producers. Consorzio del Marchio Storico Consorzio del vino Chianti Classico Other variants, with the exception of Rufina from the north-east side of ": null
    },
    {
        "Florence": "Florence"
    },
    {
        " and Montalbano in the south of ": null
    },
    {
        "Pistoia": "Pistoia"
    },
    {
        ", originate in the respective named provinces: ": null
    },
    {
        "Siena": "Province Of Siena"
    },
    {
        " for the Colli Senesi, ": null
    },
    {
        "Florence": "Province Of Florence"
    },
    {
        " for the Colli Fiorentini, ": null
    },
    {
        "Arezzo": "Province Of Arezzo"
    },
    {
        " for the Colli Aretini and ": null
    },
    {
        "Pisa": "Province Of Pisa"
    },
    {
        " for the Colline Pisane. In 1996 part of the Colli Fiorentini sub-area was renamed Montespertoli.     During the 1970s producers started to reduce the quantity of white grapes in Chianti. In 1995 it became legal to produce a Chianti with 100% Sangiovese. For a wine to retain the name of Chianti, it must be produced with at least 80% Sangiovese grapes. M. Ewing-Mulligan & E. McCarthy Italian Wines for Dummies pg 147–159 Hungry Minds 2001  Aged Chianti may be labelled as Riserva. Chianti that meets more stringent requirements may be labelled as ": null
    },
    {
        "Chianti Superiore": "Chianti Superiore"
    },
    {
        ", although Chianti from the Classico sub-area is not allowed in any event to be labelled as Superiore .                 The earliest documentation of a Chianti wine dates back to the 13th century when viticulture was known to flourish in the  Chianti Mountains  around Florence. The merchants in the nearby townships of Castellina, Gaiole and Radda formed the Lega del Chianti to produce and promote the local wine. In 1398, records note that the earliest incarnation of Chianti was as a white wine. In 1716 ": null
    },
    {
        "Cosimo III de Medici": "Cosimo Iii De Medici"
    },
    {
        ", Grand Duke of Tuscany issued an edict legislating that the three villages of the Lega del Chianti  as well as the village of ": null
    },
    {
        "Greve": "Greve"
    },
    {
        " and a  of hillside north of Greve near ": null
    },
    {
        "Spedaluzzo": ":It:Spedaluzzo"
    },
    {
        " as the only officially recognised producers of Chianti. This delineation existed until July 1932, when the Italian government expanded the Chianti zone to include the outlying areas of ": null
    },
    {
        "Barberino Val dElsa": "Barberino Val Delsa"
    },
    {
        ", ": null
    },
    {
        "Chiocchio": "Chiocchio"
    },
    {
        ", ": null
    },
    {
        "Robbiano": ":It:Robbiano"
    },
    {
        ", ": null
    },
    {
        "San Casciano in Val di Pesa": "San Casciano In Val Di Pesa"
    },
    {
        " and ": null
    },
    {
        "Strada": ":It:Strada In Chianti"
    },
    {
        ". Subsequent expansions in 1967 would eventually bring the Chianti zone to cover a very large area all over central Tuscany.          By the 18th century, Chianti was widely recognised as a red wine, but the exact composition and grape varieties used to make Chianti at this point is unknown. ": null
    },
    {
        "Ampelographers": "Ampelographer"
    },
    {
        " find clues about which grape varieties were popular at the time in the writings of Italian writer ": null
    },
    {
        "Cosimo Villifranchi": "Cosimo Villifranchi"
    },
    {
        " who noted that ": null
    },
    {
        "Canaiolo": "Canaiolo"
    },
    {
        " was widely planted variety in the area along with Sangiovese, ": null
    },
    {
        "Mammolo": "Mammolo"
    },
    {
        " and ": null
    },
    {
        "Marzemino": "Marzemino"
    },
    {
        ". It was not until the work of the Italian statesman ": null
    },
    {
        "Bettino Ricasoli": "Bettino Ricasoli"
    },
    {
        " that the modern Chianti recipe as a Sangiovese-based wine would take shape. H. Johnson Vintage: The Story of Wine pg 414-420 Simon and Schuster 1989  Prior to Ricasoli, Canaiolo was emerging as the dominant variety in the Chianti blend with Sangiovese and ": null
    },
    {
        "Malvasia": "Malvasia"
    },
    {
        " playing supporting roles. In the mid-19th century, Ricasoli developed a recipe for Chianti that was based primarily on Sangiovese. His recipe called for 70% Sangiovese, 15% Canaiolo, 10% Malvasia  and 5% other local red varieties. In 1967, the Denominazione di origine controllata regulation set by the Italian government firmly established the Ricasoli formula of a Sangiovese-based blend with 10–30% Malvasia and Trebbiano.     The late 19th century saw a period of economic and political upheaval. First came ": null
    },
    {
        "oidium": "Uncinula Necator"
    },
    {
        " and then the ": null
    },
    {
        "phylloxera epidemic": "Phylloxera Epidemic"
    },
    {
        " would take its toll on the vineyards of Chianti just as they had ravaged vineyards across the rest of Europe. The chaos and poverty following the  Risorgimento  heralded the beginning of the ": null
    },
    {
        "Italian diaspora": "Italian Diaspora"
    },
    {
        " that would take Italian vineyard workers and winemakers abroad as immigrants to new lands. Those that stayed behind and replanted choose high-yielding varieties like ": null
    },
    {
        "Trebbiano": "Trebbiano"
    },
    {
        " and Sangiovese clones such as the Sangiovese di Romagna from the nearby ": null
    },
    {
        "Romagna": "Romagna"
    },
    {
        " region. Following the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        ", the general trend in the world wine market for cheap, easy-drinking wine saw a brief boom for the region. With over-cropping and an emphasis on quantity over quality, the reputation of Chianti among consumers eventually plummeted. By the 1950s, Trebbiano made up to 30% of many mass-market Chiantis. K. MacNeil The Wine Bible pg 376-379 Workman Publishing 2001  By the late 20th century, Chianti was often associated with basic Chianti sold in a squat bottle enclosed in a straw basket, called a fiasco. However, during the same period, a group of ambitious producers began working outside the boundaries of DOC regulations to make what they believed would be a higher quality wine. These wines eventually became known as the ": null
    },
    {
        "Super Tuscans": "Super Tuscans"
    },
    {
        " .      Many of the producers behind the Super Tuscan movement were originally Chianti producers who were rebelling against what they felt were antiquated DOC regulations. Some of these producers wanted to make Chiantis that were 100% ": null
    },
    {
        "varietal": "Varietal"
    },
    {
        " Sangiovese. Others wanted the flexibility to experiment with blending ": null
    },
    {
        "French": "French"
    },
    {
        " grape varieties such as ": null
    },
    {
        "Cabernet Sauvignon": "Cabernet Sauvignon"
    },
    {
        " and ": null
    },
    {
        "Merlot": "Merlot"
    },
    {
        " or to not be required to blend in any white grape varieties. The late 20th century saw a flurry of creativity and innovation in the Chianti zones as producers experimented with new grape varieties and introduced modern wine-making techniques such as the use of new ": null
    },
    {
        "oak barrels": "Oak Barrels"
    },
    {
        ". The prices and ": null
    },
    {
        "wine ratings": "Wine Ratings"
    },
    {
        " of some Super Tuscans would regularly eclipse those of DOC sanctioned Chiantis. The success of the Super Tuscans encouraged government officials to reconsider the DOC regulations in order to bring some of these wines back into the fold labelled as Chianti.            The Chianti region covers a vast area of Tuscany and includes within its boundaries several overlapping  Denominazione di origine controllata  and  Denominazione di Origine Controllata e Garantita  regions. Other well known Sangiovese-based ": null
    },
    {
        "Tuscan wines": "Tuscan Wines"
    },
    {
        " such as ": null
    },
    {
        "Brunello di Montalcino": "Brunello Di Montalcino"
    },
    {
        " and ": null
    },
    {
        "Vino Nobile di Montepulciano": "Vino Nobile Di Montepulciano"
    },
    {
        " could be bottled and labelled under the most basic designation of Chianti if their producers chose to do so. T. Stevenson  The Sothebys Wine Encyclopedia  pg 282-286 Dorling Kindersley 2005  Within the collective Chianti region more than 8 million cases of wines classified as DOC level or above are produced each year. Today, most Chianti falls under two major designations of Chianti DOCG, which includes basic level Chianti, as well as that from seven designated sub-zones, and Chianti Classico DOCG. Together, these two Chianti zones produce the largest volume of DOC/G wines in Italy.     The Chianti DOCG covers all the Chianti wine and includes a large stretch of land encompassing the western reaches of the ": null
    },
    {
        "province of Pisa": "Province Of Pisa"
    },
    {
        " near the coast of the ": null
    },
    {
        "Tyrrhenian Sea": "Tyrrhenian Sea"
    },
    {
        ", the Florentine hills in the province of Florence to the north, to the ": null
    },
    {
        "province of Arezzo": "Province Of Arezzo"
    },
    {
        " in the east and the Siena hills to the south. Within this regions are vineyards that overlap the DOCG regions of Brunello di Montalcino, Vino Nobile di Montepulciano and ": null
    },
    {
        "Vernaccia di San Gimignano": "Vernaccia Di San Gimignano"
    },
    {
        ". Any Sangiovese-based wine made according to the Chianti guidelines from these vineyards can be labelled and marked under the basic Chianti DOCG should the producer wish to use the designation.     Within the Chianti DOCG there are eight defined sub-zones that are permitted to affix their name to the ": null
    },
    {
        "wine label": "Wine Label"
    },
    {
        ". Wines that are labelled as simply Chianti are made either from a blend from these sub-zones or include grapes from peripheral areas not within the boundaries of a sub-zone. The sub-zones are : the Colli Fiorentini which is located south of the city of Florence; Chianti Rufina in the northeastern part of the zone located around the commune of ": null
    },
    {
        "Rufina": "Rufina"
    },
    {
        "; Classico in the centre of Chianti, across the provinces of Florence and Siena; Colli Aretini in the Arezzo province to the east; Colli Senesi south of Chianti Classico in the Siena hills, which is the largest of the sub-zones and includes the Brunello di Montalcino and Vino Nobile di Montepulciano areas; Colline Pisane, the westernmost sub-zone in the province of Pisa; Montespertoli located within the Colli Fiorentini around the commune of ": null
    },
    {
        "Montespertoli": "Montespertoli"
    },
    {
        "; Montalbano in the north-west part of the zone which includes the ": null
    },
    {
        "Carmignano": "Carmignano"
    },
    {
        " DOCG. , there were  under production in Montalbano,  in the Colli Fiorentini,  in Montespertoli,  in Rufina,  in the Colli Senesi,  in Colline Pisane,  in the Colli Aretini, and an additional  in the peripheral areas that do not fall within one of the sub-zone classifications. Wines produced from these vineyards are labelled simply Chianti .                    The original area dictated by the edict of ": null
    },
    {
        "Cosimo III de Medici": "Cosimo Iii De Medici"
    },
    {
        " would eventually be considered the heart of the modern Chianti Classico subregion. A. Domine Wine, pp. 402-411, Ullmann Publishing, 2008  , there were  of vineyards in the Chianti Classico subregion. The Chianti Classico subregion covers an area of approximate  between the city of ": null
    },
    {
        "Florence": "Florence"
    },
    {
        " to the north and ": null
    },
    {
        "Siena": "Siena"
    },
    {
        " to the south. The four communes of Castellina in Chianti, Gaiole in Chianti, Greve in Chianti and Radda in Chianti are located entirely within the boundaries of the Classico area with parts of Barberino Val dElsa, San Casciano in Val di Pesa and ": null
    },
    {
        "Tavarnelle Val di Pesa": "Tavarnelle Val Di Pesa"
    },
    {
        " in the ": null
    },
    {
        "province of Florence": "Province Of Florence"
    },
    {
        " as well as ": null
    },
    {
        "Castelnuovo Berardenga": "Castelnuovo Berardenga"
    },
    {
        " and ": null
    },
    {
        "Poggibonsi": "Poggibonsi"
    },
    {
        " in the ": null
    },
    {
        "province of Siena": "Province Of Siena"
    },
    {
        " included within the permitted boundaries of Chianti Classico. The soil and geography of this subregion can be quite varied, with altitudes ranging from , and rolling hills producing differing ": null
    },
    {
        "macroclimates": "Macroclimate"
    },
    {
        ". There are two main soil types in the area: a weathered sandstone known as  alberese  and a bluish-gray ": null
    },
    {
        "chalk": "Chalk"
    },
    {
        "y ": null
    },
    {
        "marlstone": "Marlstone"
    },
    {
        " known as  galestro . The soil in the north is richer and more fertile with more galestro, with the soil gradually becoming harder and stonier with more albarese in the south. In the north, the ": null
    },
    {
        "Arno River": "Arno River"
    },
    {
        " can have an influence on the climate, keeping the temperatures slightly cooler, an influence that diminishes further south in the warmer Classico territory towards Castelnuovo Berardenga.     Chianti Classico are premium Chianti wines that tend to be medium-bodied with firm ": null
    },
    {
        "tannins": "Tannins"
    },
    {
        " and medium-high to high ": null
    },
    {
        "acidity": "Acidity"
    },
    {
        ". Floral, cherry and light nutty notes are characteristic ": null
    },
    {
        "aromas": "Aromas"
    },
    {
        " with the wines expressing more notes on the mid-": null
    },
    {
        "palate": "Palate"
    },
    {
        " and ": null
    },
    {
        "finish": "Finish"
    },
    {
        " than at the front of the mouth. As with ": null
    },
    {
        "Bordeaux": "Bordeaux"
    },
    {
        ", the different zones of Chianti Classico have unique characteristics that can be exemplified and perceived in some wines from those areas. According to ": null
    },
    {
        "Master of Wine": "Master Of Wine"
    },
    {
        " Mary Ewing-Mulligan": "Mary Ewing-Mulligan"
    },
    {
        ", Chianti Classico wines from the Castellina area tend to have a very delicate aroma and flavour, Castelnuovo Berardegna wines tend to be the ": null
    },
    {
        "most ripe": "Most Ripe"
    },
    {
        " and richest tasting, wines from Gaiole tend to have been characterised by their structure and firm tannins while wines from the Greve area tend to have very concentrated flavours.     The production of Chianti Classico is realised under the supervision of ": null
    },
    {
        "Consorzio del Vino Chianti Classico": ":It:Consorzio Del Vino Chianti Classico"
    },
    {
        ", a union of producers in the Chianti Classico subregion. The Consorzio was founded with the aim of promoting the wines of the subregion, improving quality and preventing ": null
    },
    {
        "wine fraud": "Wine Fraud"
    },
    {
        ". Since the 1980s, the foundation has sponsored extensive research into the viticultural and winemaking practice of the Chianti Classico area, particularly in the area of clonal research. In the last three decades, more than 50% of the vineyards in the Chianti Classico subregion have been replanted with improved Sangiovese clones and modern vineyard techniques as part of the Consorzio Chianti Classicos project Chianti 2000 .     In 2014 a new category of Chianti Classico was introduced: Chianti Classico Gran Selezione.  Gran Selezione is made exclusively from a winery’s own grapes grown according to stricter regulations compared to regular Chianti Classico. Gran Selezione is granted to a Chianti Classico after it passes a suitability test conducted   by authorised laboratories and after it is approved by a special tasting committee. The creation of the Chianti Classico Gran Selezione DOCG has been criticized, with some describing it as being Needless; an extra layer of confusion created by marketing people hoping to help Chianti Classico out of a sales crisis.                Outside of the Chianti Classico area, the wines of the Chianti sub-zone of Rufina are among the most widely recognised and exported from the Chianti region. Located in the ": null
    },
    {
        "Arno": "Arno"
    },
    {
        " valley near the town of ": null
    },
    {
        "Pontassieve": "Pontassieve"
    },
    {
        ", the Rufina region includes much area in the ": null
    },
    {
        "Pomino": "Pomino"
    },
    {
        " region, an area that has a long history of wine production. The area is noted for the cool climate of its elevated vineyards located up to . The ": null
    },
    {
        "vineyard soils": "Vineyard Soil"
    },
    {
        " of the area are predominantly ": null
    },
    {
        "marl": "Marl"
    },
    {
        " and ": null
    },
    {
        "chalk": "Chalk"
    },
    {
        ". The Florentine merchant families of the ": null
    },
    {
        "Antinori": "Antinori"
    },
    {
        " and ": null
    },
    {
        "Frescobaldi": "Frescobaldi"
    },
    {
        " own the majority of the vineyards in Rufina. Chianti from the Rufina area is characterised by its multi-layered ": null
    },
    {
        "complexity": "Complexity"
    },
    {
        " and elegance.     The Colli Fiorentini subregion has seen an influx of activity and new vineyard development in recent years as wealthy Florentine business people move to the country to plant vineyards and open wineries. Many foreign ": null
    },
    {
        "flying winemakers": "Flying Winemaker"
    },
    {
        " have had a hand in this development, bringing global ": null
    },
    {
        "viticulture": "Viticulture"
    },
    {
        " and wine-making techniques to the Colli Fiorentini. Located in the hills between the Chianti Classico area and Arno valley, the wines of the Colli Fiorentini vary widely depending on producer, but tend to have a simple structure with strong character and fruit notes. The Montespertoli sub-zone was part of the Colli Fiorentini sub-zone until 2002 when it became its own tiny enclave.     The Montalbano subregion is located in the shadow of the Carmignano DOCG, with much of the best Sangiovese going to that wine. A similar situation exists in the Colli Senesi which includes the well known DOCG region of Vino Nobile di Montepulciano. Both regions rarely appear on wine labels that are exported out of Tuscany. The Colli Pisane area produces typical Chiantis with the lightest body and color. The Colli Aretini is a relatively new and emerging area that has seen an influx of investment and new winemaking in recent years.       Since 1996 the blend for Chianti and Chianti Classico has been 75–100% Sangiovese, up to 10% Canaiolo and up to 20% of any other approved red grape variety such as Cabernet Sauvignon, Merlot or Syrah. Since 2006, the use of white grape varieties such as Malvasia and Trebbiano have been prohibited in Chianti Classico. Jancis Robinson   5 July 2008 Chianti Classico must have a minimum ": null
    },
    {
        "alcohol level": "Alcohol Level"
    },
    {
        " of at least 12% with a minimum of 7 months aging in oak, while Chianti Classicos labeled  riserva  must be aged at least 24 months at the winery, with a minimum alcohol level of at least 12.5%. The harvest ": null
    },
    {
        "yields": "Yields"
    },
    {
        " for Chianti Classico are restricted to no more than . For basic Chianti, the minimum alcohol level is 11.5% with yields restricted to .      The aging for basic Chianti DOCG is much less stringent with most varieties allowed to be released to the market on 1 March following the vintage year. The sub-zones of Colli Fiorentini, Montespertoli and Rufina must be aged for a further three months and not released until 1 June. All Chianti Classicos must be held back until 1 October in the year following the vintage.             ": null
    },
    {
        "Jancis Robinson": "Jancis Robinson"
    },
    {
        " notes that Chianti is sometimes called the ": null
    },
    {
        "Bordeaux": "Bordeaux Wine"
    },
    {
        " of ": null
    },
    {
        "Italy": "Italy"
    },
    {
        " but the structure of the wines is very different from any French wine. The flexibility in the blending recipe for Chianti accounts for some of the variability in styles among Chiantis. Lighter ": null
    },
    {
        "bodied": "Body"
    },
    {
        " styles will generally have a higher proportion of white grape varieties blended in, while Chiantis that have only red grape varieties will be fuller and richer. While only 15% of Cabernet Sauvignon is permitted in the blend, the nature of the grape variety can have a dominant personality in the Chianti blend and be a strong influence in the wine.     Chianti Classico wines are characterised in their youth by their predominantly floral and cinnamon spicy bouquet. As the wine ages, aromas of tobacco and leather can emerge. Chiantis tend to have medium-high ": null
    },
    {
        "acidity": "Acidity"
    },
    {
        " and medium ": null
    },
    {
        "tannins": "Tannins"
    },
    {
        ". Basic level Chianti is often characterised by its juicy fruit notes of cherry, plum and raspberry and can range from simple quaffing wines to those approaching the level of Chianti Classico. Wine expert ": null
    },
    {
        "Tom Stevenson": "Tom Stevenson"
    },
    {
        " notes that these basic everyday-drinking Chiantis are at their peak drinking qualities often between three and five years after vintage, with premium examples having the potential to age for four to eight years. Well-made examples of Chianti Classico often have the potential to age and improve in the bottle for six to twenty years.       Chianti Superiore is an Italian DOCG wine produced in the provinces of Arezzo, Florence, Pisa, Pistoia, Prato and Siena, in Tuscany. Superiore is a specification for wines produced with a stricter rule of production than other Chianti wines. Chianti Superiore has been authorised since 1996. D.M. 5.08.1996 Chianti Superiore wines can be produced only from grapes cultivated in the Chianti wine areas except from those vineyards that are registered in the Chianti Classico sub-zone. Vineyards registered in Chianti sub-zones other than Classico can produce Chianti Superiore wines but must omit the sub-zone name on the label. Aging is calculated from 1 January after the picking. Chianti Superiore cannot be sold to the consumer before nine months of aging, of which three must be in the bottle. Therefore, it cannot be bottled before the June after picking or sold to consumers before the next September.            Chianti Classico was promoted as the “Official wine of the ": null
    },
    {
        "2013 UCI Road World Championships": "2013 Uci Road World Championships"
    },
    {
        "” and sold bottles dedicated to the Championships with special labels.        In the 1991 film  The Silence of the Lambs  Hannibal Lecter delivers his most quotable line A census taker once tried to test me. I ate his liver with some ": null
    },
    {
        "fava beans": "Vicia Faba"
    },
    {
        " and a nice Chianti. In the ": null
    },
    {
        "original book": "The Silence Of The Lambs"
    },
    {
        ", however, Lecter stated that he ate the meal with a big ": null
    },
    {
        "Amarone": "Amarone"
    },
    {
        " . Chianti was chosen for the movie because of its recognition.     ": null
    }
]