[
    {
        "   Cuisine of Chinese Muslims  is the cuisine of the ": null
    },
    {
        "Hui": "Hui People"
    },
    {
        " and other Muslims living in China such as ": null
    },
    {
        "Dongxiang": "Dongxiangs"
    },
    {
        ", ": null
    },
    {
        "Salar": "Salar People"
    },
    {
        ", Uyghurs, and ": null
    },
    {
        "Bonan": "Bonans"
    },
    {
        " as well as ": null
    },
    {
        "Dungans": "Dungan People"
    },
    {
        " of ": null
    },
    {
        "Central Asia": "Central Asia"
    },
    {
        ".            Due to the large ": null
    },
    {
        "Muslim": "Muslim"
    },
    {
        " population in western China, many Chinese restaurants cater to, or are run by, Muslims. Northern Chinese Islamic cuisine originated in ": null
    },
    {
        "China proper": "China Proper"
    },
    {
        ". It is heavily influenced by ": null
    },
    {
        "Beijing cuisine": "Beijing Cuisine"
    },
    {
        ", with nearly all cooking methods identical, and differs only in material due to religious restrictions. As a result, northern Islamic cuisine is often included in home Beijing cuisine though seldom in east coast restaurants.     During the ": null
    },
    {
        "Yuan dynasty": "Yuan Dynasty"
    },
    {
        ", ": null
    },
    {
        "halal": "Halal"
    },
    {
        " methods of slaughtering animals and preparing food was banned and forbidden by the Mongol emperors, starting with ": null
    },
    {
        "Genghis Khan": "Genghis Khan"
    },
    {
        " who banned Muslims and Jews from slaughtering their animals their own way and made them follow the Mongol method.         Among all the alien peoples only the Hui-hui say “we do not eat Mongol food”. “By the aid of heaven we have pacified you; you are our slaves. Yet you do not eat our food or drink. How can this be right?” He thereupon made them eat. “If you slaughter sheep, you will be considered guilty of a crime.” He issued a regulation to that effect ... In 1279/1280 under ": null
    },
    {
        "Qubilai": "Kublai Khan"
    },
    {
        " all the Muslims say: “if someone else slaughters we do not eat”. Because the poor people are upset by this, from now on, Musuluman Huihui and Zhuhu Huihui, no matter who kills will eat and must cease slaughtering sheep themselves, and cease the rite of circumcision. .       Traditionally, there is a distinction between northern and southern Chinese Islamic cuisine despite both using ": null
    },
    {
        "mutton": "Mutton"
    },
    {
        " and lamb. Northern Chinese Islamic cuisine relies heavily on beef, but rarely ducks, geese, shrimp or seafood, while southern Islamic cuisine is the reverse. The reason for this difference is due to availability of the ingredients. Oxen have been long used for farming and Chinese governments have frequently strictly prohibited the slaughter of oxen for food. However, due to the geographic proximity of the northern part of China to minority-dominated regions that were not subjected to such restrictions, beef could be easily purchased and transported to northern China. At the same time, ducks, geese, and shrimp are rare in comparison to southern China due to the arid climate of northern China.             A Chinese Islamic restaurant  can be similar to a ": null
    },
    {
        "Mandarin restaurant": "Mandarin Cuisine"
    },
    {
        " with the exception that there is no ": null
    },
    {
        "pork": "Pork"
    },
    {
        " on the menu and is primarily noodle/soup based.     In most major eastern cities in China, there are very limited Islamic/Halal restaurants, which are typically run by migrants from Western China . They primarily offer inexpensive noodle soups only. These restaurants are typically decorated with Islamic motifs such as pictures of Islamic ": null
    },
    {
        "rugs": "Carpet"
    },
    {
        " and Arabic writing.     Another difference is that ": null
    },
    {
        "lamb": "Domestic Sheep"
    },
    {
        " and ": null
    },
    {
        "mutton": "Lamb"
    },
    {
        " dishes are more commonly available than in other Chinese restaurants, due to the greater prevalence of these meats in the cuisine of western Chinese regions.      Other Muslim ethnic minorities like the ": null
    },
    {
        "Salar": "Salar People"
    },
    {
        ", ": null
    },
    {
        "Dongxiang": "Dongxiang People"
    },
    {
        ", ": null
    },
    {
        "Bonan": "Bonan People"
    },
    {
        ", and ": null
    },
    {
        "Tibetan Muslims": "Tibetan Muslims"
    },
    {
        " have their own cuisines as well. Dongxiang people operate their own restaurants serving their cuisine.     Many cafeterias at Chinese universities have separate sections or dining areas for Muslim students , typically labeled qingzhen. Student ID cards sometimes indicate whether a student is Muslim and will allow access to these dining areas or will allow access on special occasions such as the ": null
    },
    {
        "Eid": "Eid Ul-Fitr"
    },
    {
        " feast following ": null
    },
    {
        "Ramadan": "Ramadan"
    },
    {
        ".     Several Hui restaurants serving Chinese Islamic cuisine exist in ": null
    },
    {
        "Los Angeles": "Los Angeles"
    },
    {
        ".   ": null
    },
    {
        "San Francisco": "San Francisco"
    },
    {
        ", despite its huge number of Chinese restaurants, appears to have only one whose cuisine would qualify as halal.     Many Chinese Hui Muslims who moved from ": null
    },
    {
        "Yunnan": "Yunnan"
    },
    {
        " to ": null
    },
    {
        "Burma": "Burma"
    },
    {
        " are known as ": null
    },
    {
        "Panthays": "Panthays"
    },
    {
        " operate restaurants and stalls serving Chinese Islamic cuisine such as noodles. Chinese Hui Muslims from Yunnan who moved to ": null
    },
    {
        "Thailand": "Thailand"
    },
    {
        " are known as ": null
    },
    {
        "Chin Haw": "Chin Haw"
    },
    {
        ", and they also own restaurants and stalls serving Chinese Islamic food.        In ": null
    },
    {
        "Central Asia": "Central Asia"
    },
    {
        ", ": null
    },
    {
        "Dungan people": "Dungan People"
    },
    {
        ", descendants of Hui, operate restaurants serving Chinese Islamic cuisine which is respectively referred to as Dungan cuisine there. They cater to Chinese businessmen.  Chopsticks are used by Dungans.  The cuisine of the Dungan resembles northwestern Chinese cuisine.       Most Chinese regard Hui halal food as cleaner than food made by non Muslims so their restaurants are popular in China.  Hui who migrated to ": null
    },
    {
        "Northeast China": "Northeast China"
    },
    {
        "  after the ": null
    },
    {
        "Chuang Guandong": "Chuang Guandong"
    },
    {
        " opened many new inns and restaurants to cater to travelers, which were regarded as clean.     The ": null
    },
    {
        "Hui who migrated to Taiwan": "Islam In Taiwan"
    },
    {
        " operate Qingzhen restaurants and stalls serving Chinese Islamic cuisine in ": null
    },
    {
        "Taipei": "Taipei"
    },
    {
        " and other big cities.       The ": null
    },
    {
        "Thai": "Thailand"
    },
    {
        " Department of Export Promotion claims that Chinas halal food producers are small-scale entrepreneurs whose products have little value added and lack branding and technology to push their goods to international standards to encourage Thai private sector halal producers to market their products in China.      A 1903 started franchise which serves Muslim food is Dong Lai Shun in ": null
    },
    {
        "Hankou": "Hankou"
    },
    {
        ".      400 meters have to be kept as a distance from each restaurant serving beef noodles to another of its type if they belong to Hui Muslims, since Hui have a pact between each other in Ningxia, ": null
    },
    {
        "Gansu": "Gansu"
    },
    {
        ", and ": null
    },
    {
        "Shaanxi": "Shaanxi"
    },
    {
        ".       Halal restaurants are checked up upon by clerics from mosques.      Halal food manufacture has been sanctioned by the government of the ": null
    },
    {
        "Ningxia": "Ningxia"
    },
    {
        " Autonomous region.                     Lamian    is a Chinese dish of hand-made noodles, usually served in a beef or mutton-flavored soup , but sometimes stir-fried and served with a tomato-based sauce. Literally, 拉 ла means to pull or stretch, while 麪 мян means noodle. The hand-making process involves taking a lump of dough and repeatedly stretching it to produce a single very long noodle.     Words that begin with L are not native to Turkic — läghmän is a loanword as stated by Uyghur linguist Abdlikim: It is of Chinese derivation and not originally Uyghur.                  Beef noodle soup  is a ": null
    },
    {
        "noodle soup": "Noodle Soup"
    },
    {
        " dish composed of stewed ": null
    },
    {
        "beef": "Beef"
    },
    {
        ", beef broth, ": null
    },
    {
        "vegetables": "Vegetable"
    },
    {
        " and ": null
    },
    {
        "wheat noodles": "Wheat Noodle"
    },
    {
        ". It exists in various forms throughout ": null
    },
    {
        "East Asia": "East Asia"
    },
    {
        " and ": null
    },
    {
        "Southeast Asia": "Southeast Asia"
    },
    {
        ". The most common ": null
    },
    {
        "Vietnam": "Vietnam"
    },
    {
        "ese version is called ": null
    },
    {
        "Bo kho": "Kho"
    },
    {
        " but uses ": null
    },
    {
        "rice noodles": "Rice Noodle"
    },
    {
        ". It was created by the Hui people during the ": null
    },
    {
        "Tang Dynasty": "Tang Dynasty"
    },
    {
        " of ": null
    },
    {
        "China": "China"
    },
    {
        ".     In the west, this food may be served in a small portion as a soup. In China, a large bowl of it is often taken as a whole meal with or without any side dish.          Chuanr , originating in the ": null
    },
    {
        "Xinjiang": "Xinjiang"
    },
    {
        " province of China and in recent years has been disseminated throughout the rest of that country, most notably in ": null
    },
    {
        "Beijing": "Beijing"
    },
    {
        ". It is a product of the Chinese Islamic cuisine of the ": null
    },
    {
        "Uyghur": "Uyghur People"
    },
    {
        " people and other ": null
    },
    {
        "Chinese Muslims": "Islam In China"
    },
    {
        ". Yang rou chuan, or lamb kebabs, is particularly popular.          Suan cai is a traditional fermented vegetable dish, similar to Korean ": null
    },
    {
        "kimchi": "Kimchi"
    },
    {
        " and German ": null
    },
    {
        "sauerkraut": "Sauerkraut"
    },
    {
        ", used in a variety of ways. It consists of pickled Chinese cabbage. Suan cai is a unique form of pao cai due to the material used and the method of production. Although suan cai is not exclusive to Chinese Islamic cuisine, it is used in Chinese Islamic cuisine to top off noodle soups, especially ": null
    },
    {
        "beef noodle soup": "Beef Noodle Soup"
    },
    {
        ".       Nang , is a type of round unleavened bread, topped with sesame. It is similar to South and Central Asia ": null
    },
    {
        "naan": "Naan"
    },
    {
        " Peking Duck": "Peking Duck"
    },
    {
        " Niang pi , a popular noodle cold dish in ": null
    },
    {
        "Linxia": "Linxia City"
    }
]