[
    {
        "                  The Territory of Christmas Island  is an ": null
    },
    {
        "Australian external territory": "States And Territories Of Australia"
    },
    {
        " comprising the island of the same name. Christmas Island is located in the ": null
    },
    {
        "Indian Ocean": "Indian Ocean"
    },
    {
        ", around  south of ": null
    },
    {
        "Java": "Java"
    },
    {
        " and ": null
    },
    {
        "Sumatra": "Sumatra"
    },
    {
        " and around  north-west of the closest point on the Australian mainland. It has an area of .     Christmas Island had a population of 1,843 residents , the majority of whom live in settlements on the northern tip of the island. The main settlement is ": null
    },
    {
        "Flying Fish Cove": "Flying Fish Cove"
    },
    {
        ". Around two-thirds of the islands population is estimated to have ": null
    },
    {
        "Malaysian Chinese": "Malaysian Chinese"
    },
    {
        " or ": null
    },
    {
        "Singaporean Chinese": "Chinese Singaporeans"
    },
    {
        " origin , with significant numbers of ": null
    },
    {
        "Malays": "Malays"
    },
    {
        " and ": null
    },
    {
        "European Australians": "European Australian"
    },
    {
        "as well as smaller numbers of ": null
    },
    {
        "Malaysian Indians": "Malaysian Indian"
    },
    {
        "and ": null
    },
    {
        "Eurasians": "Eurasian"
    },
    {
        ". Several languages are in use, including ": null
    },
    {
        "English": "English Language"
    },
    {
        ", ": null
    },
    {
        "Malay": "Malay Language"
    },
    {
        ", and various Chinese dialects. ": null
    },
    {
        "Islam": "Islam"
    },
    {
        " and ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        " are major religions on the island, though a vast majority of the population does not declare a formal religious affiliation and may be involved in ethnic ": null
    },
    {
        "Chinese religion": "Chinese Folk Religion"
    },
    {
        ".     The first European to sight the island was Richard Rowe of the Thomas in 1615. The island was later named on Christmas Day 1643 by Captain ": null
    },
    {
        "William Mynors": "William Mynors"
    },
    {
        " but only settled in the late 19th century.  Its geographic isolation and history of minimal human disturbance has led to a high level of ": null
    },
    {
        "endemism": "Endemism"
    },
    {
        " among its flora and fauna, which is of interest to scientists and naturalists.  The majority of the island is included in the ": null
    },
    {
        "Christmas Island National Park": "Christmas Island National Park"
    },
    {
        ", which features several areas of primary ": null
    },
    {
        "monsoon": "Monsoon"
    },
    {
        "al forest. ": null
    },
    {
        "Phosphate": "Phosphate"
    },
    {
        ", deposited originally as ": null
    },
    {
        "guano": "Guano"
    },
    {
        ", has been mined on the island since 1899.         The first European to sight the island was Richard Rowe of the Thomas in 1615.  Captain ": null
    },
    {
        "William Mynors": "William Mynors"
    },
    {
        " of the Royal Mary, an ": null
    },
    {
        "English East India Company": "English East India Company"
    },
    {
        " vessel, named the island when he sailed past it on Christmas Day, in 1643.  The island was included on English and Dutch navigation charts as early as the beginning of the 17th century, but it was not until 1666 that a map published by Dutch cartographer ": null
    },
    {
        "Pieter Goos": "Pieter Goos"
    },
    {
        " included the island. Goos labelled the island Mony or Moni ,  the meaning of which is unclear.      English navigator ": null
    },
    {
        "William Dampier": "William Dampier"
    },
    {
        ", aboard the English ship Cygnet, made the earliest recorded visit to the sea around the island in March 1688. He found it uninhabited.  Dampier gave an account of the visit which can be found in his Voyages.  Dampier was trying to reach ": null
    },
    {
        "Cocos": "Cocos  Islands"
    },
    {
        " from ": null
    },
    {
        "New Holland": "New Holland"
    },
    {
        ". His ship was blown off course in an easterly direction, arriving at Christmas Island twenty-eight days later. Dampier landed at the ": null
    },
    {
        "Dales": "The Dales"
    },
    {
        " . Two of his crewmen became the first Europeans to set foot on Christmas Island.      Captain Daniel Beeckman of the Eagle passed the island on 5 April 1714, chronicled in his 1718 book, A Voyage to and from the Island of Borneo, in the East-Indies.              The first attempt at exploring the island was in 1857 by the crew of the Amethyst. They tried to reach the summit of the island but found the cliffs impassable.     During the ": null
    },
    {
        "1872–76 Challenger expedition": "Challenger Expedition"
    },
    {
        " to Indonesia, naturalist ": null
    },
    {
        "John Murray": "John Murray"
    },
    {
        " carried out extensive surveys.      In 1886, Captain ": null
    },
    {
        "John Maclear": "John Maclear"
    },
    {
        " of , having discovered an anchorage in a bay that he named Flying Fish Cove , landed a party and made a small collection of the ": null
    },
    {
        "flora": "Flora"
    },
    {
        " and ": null
    },
    {
        "fauna": "Fauna"
    },
    {
        ". In the next year, ": null
    },
    {
        "Pelham Aldrich": "Pelham Aldrich"
    },
    {
        ", on board ": null
    },
    {
        "HMS Egeria": "Hms Egeria"
    },
    {
        ", visited the island for ten days, accompanied by ": null
    },
    {
        "J.  J.  Lister": "Joseph Jackson Lister"
    },
    {
        ", who gathered a larger biological and mineralogical collection.     Among the rocks then obtained and submitted to Murray for examination were many of nearly pure ": null
    },
    {
        "phosphate of lime": "Phosphate Of Lime"
    },
    {
        ". This discovery led to ": null
    },
    {
        "annexation": "Annexation"
    },
    {
        " of the island by the British Crown on 6 June 1888.       Soon afterwards, a small settlement was established in Flying Fish Cove by ": null
    },
    {
        "G. Clunies Ross": "Clunies-Ross Family"
    },
    {
        ", the owner of the Cocos Islands some  to the southwest, to collect ": null
    },
    {
        "timber": "Timber"
    },
    {
        " and supplies for the growing industry on Cocos.        In 1897 the island was visited by ": null
    },
    {
        "Charles W. Andrews": "Charles William Andrews"
    },
    {
        ", who did extensive research on the natural history of the island, on behalf of the ": null
    },
    {
        "British Museum": "British Museum"
    },
    {
        ". Andrews, Charles W. A Monograph of Christmas Island . in Bulletin of the British Museum.  1900.     Phosphate mining began in 1899 using ": null
    },
    {
        "indentured": "Indentured Servant"
    },
    {
        " workers from ": null
    },
    {
        "Singapore": "Singapore"
    },
    {
        ", ": null
    },
    {
        "Malaya": "British Malaya"
    },
    {
        " and ": null
    },
    {
        "China": "China"
    },
    {
        ". John Davis Murray, a mechanical engineer and recent graduate of ": null
    },
    {
        "Purdue University": "Purdue University"
    },
    {
        ", was sent to supervise the operation on behalf of the Phosphate Mining and Shipping Company. Murray was known as the King of Christmas Island until 1910, when he married and settled in ": null
    },
    {
        "London": "London"
    },
    {
        ".       The island was administered jointly by the British Phosphate commissioners and district officers from the United Kingdom ": null
    },
    {
        "Colonial Office": "Colonial Office"
    },
    {
        " through the ": null
    },
    {
        "Straits Settlements": "Straits Settlements"
    },
    {
        ", and later the ": null
    },
    {
        "Crown Colony of Singapore": "Colony Of Singapore"
    },
    {
        ". Hunt provides a detailed history of Chinese indentured labor on the island during those years. In 1922, scientists attempted unsuccessfully to view a ": null
    },
    {
        "solar eclipse": "Solar Eclipse"
    },
    {
        " from the island to test ": null
    },
    {
        "Einsteins": "Einstein"
    },
    {
        " Theory of Relativity": "Theory Of Relativity"
    },
    {
        ". John Hunt. Eclipse on Christmas Island. newspaper article in ": null
    },
    {
        "The Canberra Times": "The Canberra Times"
    },
    {
        ", 5 September 2012.          From the outbreak of the South-East Asian theatre of ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " in December 1941, Christmas Island was a target for Japanese occupation because of its rich ": null
    },
    {
        "phosphate": "Phosphate"
    },
    {
        " deposits. A naval gun was installed under a British officer and four NCOs and 27 Indian soldiers.  The first attack was carried out on 20 January 1942, by , which torpedoed a Norwegian freighter, the Eidsvold.  The vessel drifted and eventually sank off West White Beach. Most of the European and Asian staff and their families were evacuated to Perth.     In late February and early March 1942, there were two aerial bombing raids. Shelling from a Japanese naval group on 7 March led the district officer to hoist the white flag. But after the Japanese naval group sailed away, the British officer raised the ": null
    },
    {
        "Union Flag": "Union Flag"
    },
    {
        " once more. During the night of 10–11 March, a mutiny of the Indian troops, abetted by ": null
    },
    {
        "Sikh": "Sikh"
    },
    {
        " policemen, led to the killing of the five British soldiers and the imprisonment of the remaining 21 Europeans.     At dawn on 31 March 1942, a dozen Japanese bombers launched the attack, destroying the radio station. The same day, a Japanese fleet of nine vessels arrived, and the island was surrendered. About 850 men of the Japanese 21st and 24th Special Base Forces and 102nd Construction Unit came ashore at ": null
    },
    {
        "Flying Fish Cove": "Flying Fish Cove"
    },
    {
        " and occupied the island. They rounded up the workforce, most of whom had fled to the jungle. Sabotaged equipment was repaired and preparations were made to resume the mining and export of phosphate. Only twenty men from the 21st Special Base Force were left as a garrison.     Isolated acts of sabotage and the torpedoing of the  Nissei Maru  at the wharf on 17 November 1942  meant that only small amounts of phosphate were exported to Japan during the occupation. In November 1943, over 60% of the islands population was evacuated to ": null
    },
    {
        "Surabaya": "Surabaya"
    },
    {
        "n prison camps, leaving a total population of just under 500 Chinese and Malays and 15 Japanese to survive as best they could. In October 1945,  re-occupied Christmas Island. Public Record Office, England War Office and Colonial Office Correspondence/Straits Settlements.  Interviews conducted by J G Hunt with Island residents, 1973–77. Correspondence J G Hunt with former Island residents, 1973–79.     After the war, seven mutineers were traced and prosecuted by the Military Court in Singapore. In 1947, five of them were ": null
    },
    {
        "sentenced to death": "Capital Punishment"
    },
    {
        ". However, following representations made by the newly independent government of India, their sentences were reduced to ": null
    },
    {
        "penal servitude": "Penal Labor"
    },
    {
        " for ": null
    },
    {
        "life": "Life Imprisonment"
    },
    {
        ".         At Australias request, the United Kingdom transferred sovereignty to Australia, with a $20  million payment from the Australian government to ": null
    },
    {
        "Singapore": "Colony Of Singapore"
    },
    {
        " as compensation for the loss of earnings from the phosphate revenue. Department of External Affairs in Australia. : Report from the Australian High Commission in Singapore to the Department of External Affairs in Australia. Singapore: National Archives of Singapore. The United Kingdoms Christmas Island Act was given royal assent on 14 May 1958, enabling Britain to transfer authority over Christmas Island from Singapore to Australia by an order-in-council.  Australias Christmas Island Act was passed in September 1958 and the island was officially placed under the authority of the Commonwealth of Australia on 1 October 1958.      Under Commonwealth Cabinet Decision 1573 of 9 September 1958, ": null
    },
    {
        "D.  E.  Nickels": "D. & Nbsp;E. & Nbsp;Nickels"
    },
    {
        " was appointed the first official representative of the new territory.  In a media statement on 5 August 1960, the ": null
    },
    {
        "minister for territories": "Australian Federal Minister For Territories"
    },
    {
        ", ": null
    },
    {
        "Paul Hasluck": "Paul Hasluck"
    },
    {
        ", said, among other things, that, His extensive knowledge of the Malay language and the customs of the Asian people... has proved invaluable in the inauguration of Australian administration... During his two years on the island he had faced unavoidable difficulties... and constantly sought to advance the islands interests.     ": null
    },
    {
        "John William Stokes": "John William Stokes"
    },
    {
        " succeeded him and served from 1 October 1960, to 12 June 1966. On his departure, he was lauded by all sectors of the island community. In 1968, the official secretary was retitled an administrator and, since 1997, Christmas Island and the ": null
    },
    {
        "Cocos Islands": "Cocos  Islands"
    },
    {
        " together are called the ": null
    },
    {
        "Australian Indian Ocean Territories": "Australian Indian Ocean Territories"
    },
    {
        " and share a single administrator resident on Christmas Island. Recollections of the islands history and lifestyle, and lists and timetables of the islands leaders and events since its settlement are at the World Statesmen site  and in Neale , Bosman , Hunt and Stokes .     The settlement of Silver City was built in the 1970s, with aluminium-clad houses that were supposed to be ": null
    },
    {
        "cyclone": "Cyclone"
    },
    {
        "-proof.  The ": null
    },
    {
        "2004 Indian Ocean earthquake and tsunami": "2004 Indian Ocean Earthquake And Tsunami"
    },
    {
        " centred off the western shore of ": null
    },
    {
        "Sumatra": "Sumatra"
    },
    {
        " in Indonesia, resulted in no reported casualties, but some swimmers were swept some  out to sea for a time before being swept back in. Main article: ": null
    },
    {
        "Countries affected by the 2004 Indian Ocean earthquake": "Countries Affected By The 2004 Indian Ocean Earthquake"
    },
    {
        "          From the late 1980s and early 1990s, boats carrying ": null
    },
    {
        "asylum seekers": "Asylum Seekers"
    },
    {
        ", mainly departing from Indonesia, began landing on the island. In 2001, Christmas Island was the site of the ": null
    },
    {
        "Tampa controversy": "Tampa Affair"
    },
    {
        ", in which the Australian government stopped a Norwegian ship, ": null
    },
    {
        "MV Tampa": "Mv Tampa"
    },
    {
        ", from disembarking 438 rescued asylum-seekers. The ensuing standoff and the associated political reactions in Australia were a major issue in the ": null
    },
    {
        "2001 Australian federal election": "2001 Australian Federal Election"
    },
    {
        ".      The ": null
    },
    {
        "Howard government": "Howard Government"
    },
    {
        " operated the ": null
    },
    {
        "Pacific Solution": "Pacific Solution"
    },
    {
        " from 2001 to 2007, excising Christmas Island from ": null
    },
    {
        "Australias migration zone": "Australian Migration Zone"
    },
    {
        " so that asylum seekers on the island could not apply for ": null
    },
    {
        "refugee status": "Refugee Status"
    },
    {
        ". Asylum seekers were relocated from Christmas Island to ": null
    },
    {
        "Manus Island": "Manus Island"
    },
    {
        " and ": null
    },
    {
        "Nauru": "Nauru"
    },
    {
        ". In 2006, an ": null
    },
    {
        "immigration detention centre": "Christmas Island Immigration Reception And Processing Centre"
    },
    {
        ", containing approximately 800 beds, was constructed on the island for the ": null
    },
    {
        "Department of Immigration and Multicultural Affairs": "Department Of Immigration And Multicultural Affairs"
    },
    {
        ". Originally estimated to cost   million,  the final cost was over $400  million.      In 2007, the ": null
    },
    {
        "Rudd government": "First Rudd Government"
    },
    {
        " decommissioned ": null
    },
    {
        "Manus Regional Processing Centre": "Manus Regional Processing Centre"
    },
    {
        " and ": null
    },
    {
        "Nauru detention centre": "Nauru Detention Centre"
    },
    {
        "; processing would then occur on Christmas Island itself.      In December 2010, 48 asylum-seekers died just off the coast of the island in what became known as the ": null
    },
    {
        "Christmas Island boat disaster": "2010 Christmas Island Boat Disaster"
    },
    {
        " when their boat hit the rocks near Flying Fish Cove, and then smashed against nearby cliffs.       In the case ": null
    },
    {
        "Plaintiff M61/2010E v Commonwealth of Australia": "Plaintiff M61/2010E V Commonwealth"
    },
    {
        ", the ": null
    },
    {
        "High Court of Australia": "High Court Of Australia"
    },
    {
        " ruled, in a 7–0 joint judgment, that asylum seekers detained on Christmas Island were entitled to the protections of the ": null
    },
    {
        "Migration Act.": "Migration Act 1958"
    },
    {
        " Accordingly, the Commonwealth was obliged to afford asylum seekers a minimum of procedural fairness when assessing their claims.      , after the interception of four boats in six days, carrying 350 people, the Immigration Department stated that there were 2,960 irregular maritime arrivals being held in the islands five detention facilities, which exceeded not only the regular operating capacity of 1,094 people, but also the contingency capacity of 2,724.      The Christmas Island Immigration Reception and Processing Centre closed on 30 September 2018.  On 13 February 2019 the Morrison government announced it would re-open the centre, after Australias parliament passed legislation giving sick asylum seekers easier access to mainland hospitals.               The island is about  in greatest length and  in breadth. The total land area is , with  of coastline. The island is the flat summit of an underwater mountain more than  high,  which rises from about  below the sea and only about  above it.      The mountain was originally a ": null
    },
    {
        "volcano": "Volcano"
    },
    {
        ", and some ": null
    },
    {
        "basalt": "Basalt"
    },
    {
        " is exposed in places such as ": null
    },
    {
        "The Dales": "The Dales"
    },
    {
        " and Dolly Beach, but most of the surface rock is ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        " accumulated from ": null
    },
    {
        "coral": "Coral"
    },
    {
        " growth. The ": null
    },
    {
        "karst": "Karst"
    },
    {
        " terrain supports numerous ": null
    },
    {
        "anchialine cave": "Anchialine Cave"
    },
    {
        "s.  The summit of this mountain peak is formed by a succession of ": null
    },
    {
        "Tertiary": "Tertiary"
    },
    {
        "limestones": "Limestone"
    },
    {
        "ranging in age from the ": null
    },
    {
        "Eocene": "Eocene"
    },
    {
        " or ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        " up to recent reef deposits, with intercalations of volcanic rock in the older beds.   By C. W. Andrews. With descriptions of the fauna and flora by numerous contributors. 8vo; pp. xiii, 337, 22 plates, 1 map, text illustrated.     Steep cliffs along much of the coast rise abruptly to a central plateau. Elevation ranges from sea level to  at ": null
    },
    {
        "Murray Hill": "Murray Hill, Christmas Island"
    },
    {
        ". The island is mainly ": null
    },
    {
        "tropical rainforest": "Tropical Rainforest"
    },
    {
        ", 63% of which is national parkland. The narrow fringing ": null
    },
    {
        "reef": "Reef"
    },
    {
        " surrounding the island poses a maritime hazard.     Christmas Island lies  northwest of ": null
    },
    {
        "Perth": "Perth"
    },
    {
        ", Western Australia,  south of Indonesia,  ENE of the ": null
    },
    {
        "Cocos Islands": "Cocos  Islands"
    },
    {
        ", and  west of ": null
    },
    {
        "Darwin": "Darwin, Northern Territory"
    },
    {
        ", Northern Territory. Its closest point to the Australian mainland is  from the town of ": null
    },
    {
        "Exmouth, Western Australia": "Exmouth, Western Australia"
    },
    {
        ".        Christmas Island has  of shoreline but only small parts of the shoreline are easily accessible. The islands perimeter is embodied by sharp cliff faces, making many of the islands beaches difficult to get to. Some of the easily accessible beaches include Flying Fish Cove , Lily Beach, Ethel Beach, and Isabel Beach, while the more difficult beaches to access include Greta Beach, Dolly Beach, Winifred Beach, Merrial Beach, and West White Beach, which all require a vehicle with four wheel drive and a difficult walk through dense rainforest.        Christmas Island is located towards the southern edge of the equatorial region. Climate is ": null
    },
    {
        "tropical": "Tropical Climate"
    },
    {
        " and temperatures vary little throughout the year. The highest temperature is usually around  in March and April, while the lowest temperature is  and occurs in August. There is a dry season from July to October with only occasional showers. The wet season is between November and June, and includes ": null
    },
    {
        "monsoons": "Monsoons"
    },
    {
        ", with downpours of rain at random times of the day. ": null
    },
    {
        "Tropical cyclones": "Tropical Cyclones"
    },
    {
        " also occur in the wet season, bringing very strong winds, rain and enormous seas.               As of the 2016 ": null
    },
    {
        "Australian census": "Census In Australia"
    },
    {
        ", the population of Christmas Island is 1,843.  21.2% of the population had Chinese ancestry , 12.7% had generic Australian ancestry , 12% had Malay ancestry , 10% had English ancestry , and 2.3% of the population was of Irish origin . 48.1% of the population has undetermined ancestry. , most of them are people born in Christmas Island and many are of Chinese and Malay origin. 38.5% of people were born in Australia. The next most common country of birth was Malaysia at 20.1%. 27.8% of the population spoke English as their family language, while 17.2% spoke Mandarin Chinese, 17.2% spoke Malay, 3.7% Cantonese, 1.5% ": null
    },
    {
        "Southern Min": "Southern Min"
    },
    {
        ", and 1% ": null
    },
    {
        "Tagalog": "Tagalog Language"
    },
    {
        ". Additionally, there are small local populations of ": null
    },
    {
        "Malaysian Indians": "Malaysian Indians"
    },
    {
        " and ": null
    },
    {
        "Eurasians": "Eurasian"
    },
    {
        ".            Christmas Island is a non-self-governing ": null
    },
    {
        "external territory": "States And Territories Of Australia"
    },
    {
        " of Australia,  administered by the ": null
    },
    {
        "Department of Infrastructure, Regional Development and Cities": "Department Of Infrastructure, Regional Development And Cities"
    },
    {
        " .      The legal system is under the authority of the ": null
    },
    {
        "Governor-General of Australia": "Governor-General Of Australia"
    },
    {
        " and Australian law. An ": null
    },
    {
        "administrator": "Administrator"
    },
    {
        " appointed by the Governor-General represents the ": null
    },
    {
        "monarch": "Monarchy Of Australia"
    },
    {
        " and Australia and lives on the island. The territory falls under no formal state jurisdiction, but the ": null
    },
    {
        "Western Australia": "Western Australia"
    },
    {
        "n Government provides many services through agreements with Canberra.     The Australian government provides services through the Christmas Island Administration and the Department of Infrastructure and Regional Development. Under the federal governments ": null
    },
    {
        "Christmas Island Act 1958": "Christmas Island Act 1958"
    },
    {
        ", Western Australian laws are applied to Christmas Island; non-application or partial application of such laws is at the discretion of the federal government.  The act also gives Western Australian courts judicial power over Christmas Island. Christmas Island remains constitutionally distinct from Western Australia, however; the power of the state to legislate for the territory is delegated by the federal government. The kind of services typically provided by a state government elsewhere in Australia are provided by departments of the Western Australian government, and by contractors, with the costs met by the federal government. A  unicameral ": null
    },
    {
        "Shire of Christmas Island": "Shire Of Christmas Island"
    },
    {
        " with nine seats provides local government services and is elected by popular vote to serve four-year terms. Elections are held every two years, with four or five of the members standing for election.               Christmas Island residents who are Australian citizens also vote in ": null
    },
    {
        "federal elections": "Elections In Australia"
    },
    {
        ". Christmas Island residents are represented in the House of Representatives by the ": null
    },
    {
        "Division of Lingiari": "Division Of Lingiari"
    },
    {
        " in the ": null
    },
    {
        "Northern Territory": "Northern Territory"
    },
    {
        " and in the Senate by Northern Territory senators.  At the ": null
    },
    {
        "2019 federal election": "2019 Australian Federal Election"
    },
    {
        ", the ": null
    },
    {
        "Labor Party": "Australian Labor Party"
    },
    {
        " received absolute majorities from Christmas Island electors in both the House of Representatives and the Senate.   Senate polling places on Christmas Island:     House of Representatives polling places on Christmas Island:           Residents find the system of administration frustrating, with the island run by bureaucrats in the federal government, but subject to the laws of Western Australia and enforced by federal police. There is a feeling of resignation that any progress on local issues is prolongated by the confusing governance system. A number of islanders support self-governance, including shire president Gordon Thompson, who also believes that a lack of news media to cover local affairs had contributed to political apathy among residents.           In early 1986, the Christmas Island Assembly held a design competition for an island flag; the winning design was adopted as the informal flag of the territory for over a decade, and in 2002 it was made the official ": null
    },
    {
        "flag of Christmas Island": "Flag Of Christmas Island"
    },
    {
        ".          Phosphate mining had been the only significant economic activity, but in December 1987 the Australian government closed the mine. In 1991, the mine was reopened by a consortium which included many of the former mine workers as shareholders. With the support of the government, the $34  million ": null
    },
    {
        "Christmas Island Casino and Resort": "Christmas Island Resort"
    },
    {
        " opened in 1993 but was closed in 1998. , the resort has re-opened without the casino.     The Australian government in 2001 agreed to support the creation of a commercial ": null
    },
    {
        "spaceport": "Spaceport"
    },
    {
        " on the island, however, this has not yet been constructed and appears that it will not proceed. The Howard government built a temporary immigration detention centre on the island in 2001 and planned to replace it with a larger, modern facility at North West Point until Howards defeat in the ": null
    },
    {
        "2007 elections": "2007 Australian Federal Election"
    },
    {
        ".          The culture of Christmas Island is unique, for people of many different ethnicities inhabit the area. Historically, the majority of Christmas Islanders were those of Chinese, Malay and Indian origins, the initial permanent settlers, and as a result, they have significantly influenced the local culture.  Today, the majority of residents are ": null
    },
    {
        "Chinese": "Malaysian Chinese"
    },
    {
        ", with significant numbers of European Australians and ": null
    },
    {
        "Malays": "Malaysian Malay"
    },
    {
        " as well as smaller ": null
    },
    {
        "Indian": "Malaysian Indian"
    },
    {
        " and ": null
    },
    {
        "Eurasian": "Eurasian"
    },
    {
        " communities too. The main languages of Christmas Island are English and ": null
    },
    {
        "Chinese": "Chinese Language"
    },
    {
        ". Dress is usually modest, and tourists should keep a wrap, such as a ": null
    },
    {
        "sarong": "Sarong"
    },
    {
        " or ": null
    },
    {
        "pareo": "Pareo"
    },
    {
        ", on hand to cover shorts, bathing suits, and tank tops. It is common to remove shoes when entering a house and to also avoid touching anyones head.            Religious beliefs are diverse, but people are very tolerant of each others religions. The religions practised include ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        ", ": null
    },
    {
        "Taoism": "Taoism"
    },
    {
        ", ": null
    },
    {
        "Confucianism": "Confucianism"
    },
    {
        ", ": null
    },
    {
        "Islam": "Islam"
    },
    {
        ", and ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ". There is a Mosque in Flying Fish Cove. With all of these religions, there are many religious festivals, such as ": null
    },
    {
        "Spring Festival": "Spring Cultural Events"
    },
    {
        ", ": null
    },
    {
        "Hari Raya": "Hari Raya"
    },
    {
        ", ": null
    },
    {
        "Christmas": "Christmas"
    },
    {
        " and ": null
    },
    {
        "Easter": "Easter"
    },
    {
        ".  Additionally, there is a ": null
    },
    {
        "Baháí": "Baháí"
    },
    {
        " centre on the island.  . Christmas.net.au. Retrieved on 2014-05-25.          Christmas Island is well known for its biological diversity. There are many rare species of animals and plants on the island, making nature-walking a popular activity. Along with the diversity of species, many different types of caves exist, such as plateau caves, coastal caves, raised coastal caves and alcoves, sea caves, fissure caves, collapse caves, and basalt caves; most of these are near the sea and have been formed by the action of water. Altogether, there are approximately 30 caves on the island,  with Lost Lake Cave, Daniel Roux Cave, and Full Frontal Cave being the most well-known. The many freshwater springs include Hosnies Spring Ramsar, which also has a mangrove stand.     The Dales is a ": null
    },
    {
        "rainforest": "Rainforest"
    },
    {
        " in the western part of the island and consists of seven deep valleys, all of which were formed by spring streams. Hughs Dale waterfall is part of this area and is a popular attraction. The annual breeding migration of the ": null
    },
    {
        "Christmas Island red crabs": "Christmas Island Red Crab"
    },
    {
        "is a popular event.     Fishing is another common activity. There are many distinct species of fish in the oceans surrounding Christmas Island. Snorkeling and swimming in the ocean are two other activities that are extremely popular. Walking trails are also very popular, for there are many beautiful trails surrounded by extravagant ": null
    },
    {
        "flora": "Flora"
    },
    {
        " and ": null
    },
    {
        "fauna": "Fauna"
    },
    {
        ". 63% of the island is ": null
    },
    {
        "national park": "Christmas Island National Park"
    },
    {
        " making it one of the main attractions to experience when visiting.                           Christmas Island was uninhabited until the late 19th century, allowing many species to evolve without human interference. Two-thirds of the island has been declared a ": null
    },
    {
        "National Park": "National Park"
    },
    {
        ", which is managed by the Australian Department of Environment and Heritage through Parks Australia. Christmas Island contains unique species, both of flora and fauna, some of which are threatened with, or have become, ": null
    },
    {
        "extinct": "Extinct Species"
    },
    {
        ".       The dense ": null
    },
    {
        "rainforest": "Rainforest"
    },
    {
        " has grown in the deep soils of the ": null
    },
    {
        "plateau": "Plateau"
    },
    {
        " and on the terraces. The forests are dominated by 25 tree species. ": null
    },
    {
        "Fern": "Fern"
    },
    {
        "s, ": null
    },
    {
        "orchids": "Orchid"
    },
    {
        "and ": null
    },
    {
        "vines": "Vine"
    },
    {
        "grow on the branches in the humid atmosphere beneath the ": null
    },
    {
        "canopy": "Canopy"
    },
    {
        ". The 135 plant species include at least 18 that are found nowhere else. The rainforest is in great condition despite the mining activities over the last 100 years. Areas that have been damaged by ": null
    },
    {
        "mining": "Mining"
    },
    {
        " are now a part of an ongoing rehabilitation project. The island is small and covers 135 square kilometres of land which 63% of that land has been declared ": null
    },
    {
        "National park": "National Park"
    },
    {
        ".      Christmas Islands ": null
    },
    {
        "endemic": "Endemism"
    },
    {
        " plants include the trees  Arenga listeri ,  Pandanus elatus  and  Dendrocnide peltata  var. murrayana; the ": null
    },
    {
        "shrubs": "Shrub"
    },
    {
        "  Abutilon listeri ,  Colubrina pedunculata ,  Grewia insularis  and  Pandanus christmatensis ; the vines  Hoya aldrichii  and  Zehneria alba ; the ": null
    },
    {
        "herbs": "Herbaceous Plant"
    },
    {
        "  Asystasia alba ,  Dicliptera maclearii  and  Peperomia rossii ; the grass  Ischaemum nativitatis ; the fern  Asplenium listeri ; and the orchids  Brachypeza archytas ,  Flickingeria nativitatis ,  Phreatia listeri  and  Zeuxine exilis . Christmas Island National Park: Flora.       Two species of native rats, the ": null
    },
    {
        "Maclears": "Maclears Rat"
    },
    {
        " and ": null
    },
    {
        "bulldog rat": "Bulldog Rat"
    },
    {
        "s, have become extinct since the island was settled, while the ": null
    },
    {
        "Javan rusa": "Javan Rusa"
    },
    {
        " has been introduced. The ": null
    },
    {
        "endemic": "Endemic"
    },
    {
        " Christmas Island shrew": "Christmas Island Shrew"
    },
    {
        " has not been seen since the mid-1980s and may be already extinct, while the ": null
    },
    {
        "Christmas Island pipistrelle": "Christmas Island Pipistrelle"
    },
    {
        " is presumed to be extinct.      The fruit bat species  Pteropus natalis  is only found on Christmas Island, its epithet natalis is a reference to that name. The species is probably the last native mammal, and an important pollinator and rainforest seed-disperser; the population is also in decline and under increasing pressure from land clearing and introduced pest species. The flying foxs low rate of reproduction and high infant mortality rate makes it especially vulnerable and the conservation status is as ": null
    },
    {
        "critically endangered": "Critically Endangered"
    },
    {
        ".  Flying foxes are an umbrella species helping forests regenerate and other species survive in stressed environments.     The land crabs and seabirds are the most noticeable fauna on the island. Christmas Island has been identified by ": null
    },
    {
        "BirdLife International": "Birdlife International"
    },
    {
        " as both an ": null
    },
    {
        "Endemic Bird Area": "Endemic Bird Area"
    },
    {
        " and an ": null
    },
    {
        "Important Bird Area": "Important Bird Area"
    },
    {
        " because it supports five endemic species and five subspecies as well as over one percent of the world populations of five other seabirds. BirdLife International. . Important Bird Areas factsheet: Christmas Island. Downloaded from  on 23 December 2011.     Twenty terrestrial and intertidal species of crab have been described here, of which thirteen are regarded as true land crabs, being dependent on the ocean only for larval development. Robber crabs, known elsewhere as ": null
    },
    {
        "coconut crab": "Coconut Crab"
    },
    {
        "s, also exist in large numbers on the island. The annual ": null
    },
    {
        "red crab": "Christmas Island Red Crab"
    },
    {
        " mass migration to the sea to spawn has been called one of the wonders of the natural world.  This takes place each year around November – after the start of the ": null
    },
    {
        "wet season": "Wet Season"
    },
    {
        " and in synchronisation with the cycle of the ": null
    },
    {
        "moon": "Moon"
    },
    {
        ". Once at the ocean, the mothers release the embryos where they can survive and grow until they are able to live on land.     The island is a focal point for seabirds of various species. Eight species or ": null
    },
    {
        "subspecies": "Subspecies"
    },
    {
        " of seabirds nest on it. The most numerous is the ": null
    },
    {
        "red-footed booby": "Red-Footed Booby"
    },
    {
        ", which nests in colonies, using trees on many parts of the shore terrace. The widespread ": null
    },
    {
        "brown booby": "Brown Booby"
    },
    {
        " nests on the ground near the edge of the seacliff and inland cliffs. ": null
    },
    {
        "Abbotts booby": "Abbotts Booby"
    },
    {
        "  nests on tall emergent trees of the western, northern and southern plateau rainforest, the only remaining nesting habitat for this bird in the world.     Another endangered and endemic bird, the ": null
    },
    {
        "Christmas frigatebird": "Christmas Frigatebird"
    },
    {
        ", has nesting areas on the northeastern shore terraces. The more widespread ": null
    },
    {
        "great frigatebirds": "Great Frigatebird"
    },
    {
        "nest in semi-": null
    },
    {
        "deciduous": "Deciduous"
    },
    {
        " trees on the shore terrace, with the greatest concentrations being in the North West and South Point areas. The ": null
    },
    {
        "common noddy": "Common Noddy"
    },
    {
        " and two species of bosun or ": null
    },
    {
        "tropicbird": "Tropicbird"
    },
    {
        "s, with their brilliant gold or silver plumage and distinctive streamer tail feathers, also nest on the island.     Of the ten native land birds and shorebirds, seven are endemic species or subspecies. This includes the ": null
    },
    {
        "Christmas thrush": "Christmas Thrush"
    },
    {
        " and the ": null
    },
    {
        "Christmas imperial pigeon": "Christmas Imperial Pigeon"
    },
    {
        ". Some 86 migrant bird species have been recorded as visitors to the island.     Six species of ": null
    },
    {
        "butterfly": "Butterfly"
    },
    {
        " are known to occur on Christmas Island. These are the Christmas swallowtail , striped albatross , Christmas emperor , king cerulean , lesser grass-blue , and Papuan grass-yellow .      Insect species include the ": null
    },
    {
        "yellow crazy ant": "Yellow Crazy Ant"
    },
    {
        " , introduced to the island and since subjected to attempts to destroy the ": null
    },
    {
        "supercolonies": "Supercolony"
    },
    {
        " that emerged with aerial spraying of the insecticide ": null
    },
    {
        "Fipronil": "Fipronil"
    },
    {
        ".        Christmas Island has access to a range of modern communication services.     Radio broadcasts from Australia include ": null
    },
    {
        "ABC Radio National": "Radio National"
    },
    {
        ", ": null
    },
    {
        "ABC Kimberley": "Abc Kimberley"
    },
    {
        ", ": null
    },
    {
        "Triple J": "Triple J"
    },
    {
        " and ": null
    },
    {
        "Red  FM": "Red Fm"
    },
    {
        ". All services are provided by satellite links from the mainland. ": null
    },
    {
        "Broadband internet": "Broadband Internet"
    },
    {
        " became available to subscribers in urban areas in mid-2005 through the local internet service provider, ": null
    },
    {
        "CIIA": "Christmas Island Internet Administration"
    },
    {
        " .     Christmas Island, due to its close proximity to Australias northern neighbors, falls within many of the satellite footprints throughout the region. This results in ideal conditions for receiving various Asian broadcasts, which locals sometimes refer to those emanating from Western Australia. Additionally, ionospheric conditions are conducive to terrestrial radio transmissions, from ": null
    },
    {
        "HF": "High Frequency"
    },
    {
        " through ": null
    },
    {
        "VHF": "Very High Frequency"
    },
    {
        " and sometimes into ": null
    },
    {
        "UHF": "Ultra High Frequency"
    },
    {
        ". The island plays home to a small array of radio equipment that spans a good chunk of the usable spectrum. A variety of government-owned and operated antenna systems are employed on the island to take advantage of this.       Free-to-air digital television stations from Australia are broadcast in the same time zone as Perth, and are broadcast from three separate locations:       Cable television from Australia, Malaysia, Singapore and the United States commenced in January 2013.       Telephone services are provided by ": null
    },
    {
        "Telstra": "Telstra"
    },
    {
        " and are a part of the Australian network with the same prefix as Western Australia, South Australia and the Northern Territory  . A ": null
    },
    {
        "GSM": "Gsm"
    },
    {
        " mobile telephone system on the 900  MHz band  replaced the old analogue network in February 2005.               A postal agency was opened on the island in 1901 and sold ": null
    },
    {
        "stamps of the Strait Settlements": "Postage Stamps And Postal History Of The Straits Settlements"
    },
    {
        ". Richard Breckon, Christmas Islands Stamps and Postal History: 50 Years of Australian Administration , Gibbons Stamp Monthly, October 2008, pp. 81–85.     After the Japanese occupation , postage stamps of the ": null
    },
    {
        "British Military Administration": "British Military Administration"
    },
    {
        " in ": null
    },
    {
        "Malaya": "British Malaya"
    },
    {
        " were in use, then stamps of Singapore. Commonwealth Stamp Catalogue Australia, Stanley Gibbons, 4th edition, 2007, pp. 104–112.     In 1958, the island received its own postage stamps after being put under Australian custody. It had a large philatelic and postal independence, managed first by the Phosphate Commission and then by the islands administration . This ended on 2 March 1993 when ": null
    },
    {
        "Australia Post": "Australia Post"
    },
    {
        " became the islands postal operator; Christmas Island stamps may be used in Australia and Australian stamps may be used on the island.       A container port exists at Flying Fish Cove with an uncompleted alternative container-unloading point to the east of the island at Norris Point, intended for use during the December-to-March swell season of rough seas.     The ": null
    },
    {
        "standard gauge": "Standard Gauge"
    },
    {
        "  Christmas Island Phosphate Co.s Railway": "Christmas Island Phosphate Co.S Railway"
    },
    {
        " from Flying Fish Cove to the phosphate mine was constructed in 1914. It was closed in December 1987, when the Australian government closed the mine, and since has been recovered as scrap, leaving only earthworks in places.     ": null
    },
    {
        "Virgin Australia Regional Airlines": "Virgin Australia Regional Airlines"
    },
    {
        " provides two weekly flights to ": null
    },
    {
        "Christmas Island Airport": "Christmas Island Airport"
    },
    {
        " from Perth, Western Australia, ": null
    },
    {
        "Garuda Indonesia": "Garuda Indonesia"
    },
    {
        " conduct weekly open-charter flights from/to Jakarta with bookings done through Christmas Island Travel Exchange and ": null
    },
    {
        "Malindo Air": "Malindo Air"
    },
    {
        " operate fortnightly open-charter flights from/to Kuala Lumpur with bookings done through Evercrown Air Services.     Hire cars are available from the airport however no franchised companies are represented. CI Taxi Service also operates most days.   Due to the lack of 3G or 4G, the islands sole taxi operator couldnt meet the requirement issued by WA Department of Transport to install electronic meters, and the operator was forced to close at the end of June, 2019.      The road network covers most of the island and is of generally good quality, although four-wheel drive vehicles are needed to reach some of the more distant parts of the rainforest or the more isolated beaches on the rough dirt roads.       The island-operated ": null
    },
    {
        "crèche": "Day Care"
    },
    {
        " is in the Recreation Centre.  ": null
    },
    {
        "Christmas Island District High School": "Christmas Island District High School"
    },
    {
        ", catering to students in grades ": null
    },
    {
        "P-12": "K-12P–12"
    },
    {
        ", is run by the ": null
    },
    {
        "Western Australian Education Department": "Western Australian Education Department"
    },
    {
        ". There are no universities on Christmas Island.     The island has one public library.        ": null
    },
    {
        "Rugby league": "Rugby League"
    },
    {
        " is growing in the island: the first game was played in 2016, and a local committee, with the support of ": null
    },
    {
        "NRL": "National Rugby League"
    },
    {
        " Western Australia, is willing to organize matches with nearby ": null
    },
    {
        "Cocos Islands": "Cocos  Islands"
    },
    {
        " and to create a Rugby League Competition in the Indian Ocean area. ": null
    }
]