[
    {
        "   Christopher Báthory  was ": null
    },
    {
        "voivode of Transylvania": "Voivode Of Transylvania"
    },
    {
        " from 1576 to 1581. He was a younger son of ": null
    },
    {
        "Stephen Báthory of Somlyó": "Stephen Viii Báthory"
    },
    {
        ". Christophers career began during the reign of Queen ": null
    },
    {
        "Isabella Jagiellon": "Isabella Jagiellon"
    },
    {
        ", who administered the ": null
    },
    {
        "eastern territories of the Kingdom of Hungary": "Eastern Hungarian Kingdom"
    },
    {
        " on behalf of her son, ": null
    },
    {
        "John Sigismund Zápolya": "John Sigismund Zápolya"
    },
    {
        ", from 1556 to 1559. He was one of the commanders of John Sigismunds army in the early 1560s.     Christophers brother, ": null
    },
    {
        "Stephen Báthory": "Stephen Báthory"
    },
    {
        ", who succeeded John Sigismund in 1571, made Christopher captain of Várad . After being elected ": null
    },
    {
        "King of Poland": "King Of Poland"
    },
    {
        ", Stephen Báthory adopted the title of ": null
    },
    {
        "Prince of Transylvania": "Prince Of Transylvania"
    },
    {
        " and made Christopher voivode in 1576. Christopher cooperated with ": null
    },
    {
        "Márton Berzeviczy": "Márton Berzeviczy"
    },
    {
        ", whom his brother appointed to supervise the administration of the ": null
    },
    {
        "Principality of Transylvania": "Principality Of Transylvania"
    },
    {
        " as the head of the Transylvanian chancellery at ": null
    },
    {
        "Kraków": "Kraków"
    },
    {
        ". Christopher ordered the imprisonment of ": null
    },
    {
        "Ferenc Dávid": "Ferenc Dávid"
    },
    {
        ", a leading theologian of the ": null
    },
    {
        "Unitarian Church of Transylvania": "Unitarian Church Of Transylvania"
    },
    {
        ", who started to condemn the adoration of Jesus. He supported his brothers efforts to settle the ": null
    },
    {
        "Jesuits": "Jesuits"
    },
    {
        " in Transylvania.       Christopher was the third of the four sons of Stephen Báthory of Somlyó and ": null
    },
    {
        "Catherine Telegdi": "Catherine Telegdi"
    },
    {
        ". His father was a supporter of ": null
    },
    {
        "John Zápolya": "John Zápolya"
    },
    {
        ", ": null
    },
    {
        "King of Hungary": "King Of Hungary"
    },
    {
        ", who made him voivode of Transylvania in February 1530. Christopher was born in ": null
    },
    {
        "Báthorys castle": "Șimleu Silvaniei Fort"
    },
    {
        " at Szilágysomlyó  in the same year. His father died in 1534.     His brother, Andrew, and their kinsman, ": null
    },
    {
        "Tamás Nádasdy": "Tamás Nádasdy"
    },
    {
        ", took charge of Christophers education. Christopher visited England, France, Italy, Spain, and the ": null
    },
    {
        "Holy Roman Empire": "Holy Roman Empire"
    },
    {
        " in his youth. He also served as a page in ": null
    },
    {
        "Emperor Charles Vs": "Charles V, Holy Roman Emperor"
    },
    {
        "court.       Christopher entered the service of John Zápolyas widow, Isabella Jagiellon, in the late 1550s. At the time, Isabella administered the eastern territories of the Kingdom of Hungary on behalf of her son, John Sigismund Zápolya. She wanted to persuade ": null
    },
    {
        "Henry II of France": "Henry Ii Of France"
    },
    {
        " to withdraw his troops from three fortresses that the Ottomans had captured in ": null
    },
    {
        "Banat": "Banat"
    },
    {
        ", so she sent Christopher to France to start negotiations in 1557.     John Sigismund took charge of the administration of his realm after his mother died on 15 November 1559. He retained his mothers advisors, including Christopher who became one of his most influential officials. After the rebellion of ": null
    },
    {
        "Melchior Balassa": "Melchior Balassa"
    },
    {
        ", Christopher persuaded John Sigismund to fight for his realm instead of fleeing to Poland in 1562. Christopher was one of the commanders of John Sigismunds troops during the ensuing war against the Habsburg rulers of the western territories of the Kingdom of Hungary, ": null
    },
    {
        "Ferdinand": "Ferdinand I, Holy Roman Emperor"
    },
    {
        " and ": null
    },
    {
        "Maximilian": "Maximilian Ii, Holy Roman Emperor"
    },
    {
        ", who tried to reunite the kingdom under their rule. Christopher defeated Maximilians commander, ": null
    },
    {
        "Lazarus von Schwendi": "Lazarus Von Schwendi"
    },
    {
        ", forcing him to lift the siege of Huszt  in 1565.     After the death of John Sigismund, the ": null
    },
    {
        "Diet of Transylvania": "Diet Of Transylvania"
    },
    {
        " elected Christophers younger brother, Stephen Báthory, voivode on 25 May 1571. Stephen made Christopher captain of Várad . The following year, the ": null
    },
    {
        "Ottoman Sultan": "Ottoman Sultan"
    },
    {
        ", ": null
    },
    {
        "Selim II": "Selim Ii"
    },
    {
        " , acknowledged the hereditary right of the ": null
    },
    {
        "Báthory family": "Báthory Family"
    },
    {
        " to rule the province.            Stephen Báthory was elected King of Poland on 15 December 1575. He adopted the title of Prince of Transylvania and made Christopher voivode on 14 January 1576. An Ottoman delegation confirmed Christophers appointment at the Diet in Gyulafehérvár  in July. The sultans charter  sent to Christopher emphasized that he should keep the peace along the frontiers. Stephen set up a separate chancellery in Kraków to keep an eye on the administration of Transylvania. The head of the new chancellery, Márton Berzeviczy, and Christopher cooperated closely.     ": null
    },
    {
        "Anti-Trinitarian": "Nontrinitarianism"
    },
    {
        " preachers began to condemn the worshiping of Jesus in ": null
    },
    {
        "Partium": "Partium"
    },
    {
        " and ": null
    },
    {
        "Székely Land": "Székely Land"
    },
    {
        " in 1576, although the Diet had already forbade all doctrinal innovations. Ferenc Dávid, the most influential leader of the Unitarian Church of Transylvania, openly joined the dissenters in the autumn of 1578. Christopher invited ": null
    },
    {
        "Fausto Sozzini": "Fausto Sozzini"
    },
    {
        ", a leading Anti-Trinitarian theologian, to Transylvania to convince Dávid that the new teaching was erroneous. Since Dávid refused to obey, Christopher held a Diet and the ": null
    },
    {
        "Three Nations": "Unio Trium Nationum"
    },
    {
        " ordered Dávids imprisonment. Christopher also supported his brothers attempts to strengthen the position of the Roman Catholic Church in Transylvania. He granted estates to the Jesuits to promote the establishment of a college in Kolozsvár  on 5 May 1579.     Christopher fell seriously ill after his second wife, Elisabeth Bocskai, died in early 1581. After a false rumor about Christophers dead reached Istanbul, ": null
    },
    {
        "Koca Sinan Pasha": "Koca Sinan Pasha"
    },
    {
        " proposed Transylvania to ": null
    },
    {
        "Pál Márkházy": "Pál Márkházy"
    },
    {
        " whom Christopher had been forced into exile. Although Christophers only surviving son ": null
    },
    {
        "Sigismund": "Sigismund Báthory"
    },
    {
        " was still a minor, the Diet elected him as voivode before Christophers death, because they wanted to prevent the appointment of Márkházy. Christopher died in Gyulafehérvár on 27 May 1581. He was buried in the Jesuits church in Gyulafehérvár, almost two years later, on 14 March 1583.            Christophers first wife, Catherina Danicska, was a Polish noblewoman, but only the Hungarian form of her name is known. Their eldest son, Balthasar Báthory, moved to Kraków shortly after Stephen Báthory was crowned King of Poland; he drowned in the ": null
    },
    {
        "Vistula River": "Vistula River"
    },
    {
        " in May 1577 at the age of 22. Christophers and Catherinas second son, Nicholas, was born in 1567 and died in 1576.     Christophers second wife, Elisabeth Bocskai, was a ": null
    },
    {
        "Calvinist": "Reformed Church In Hungary"
    },
    {
        " noblewoman. Their first child, ": null
    },
    {
        "Cristina ": "Griselda Báthory"
    },
    {
        ", was born in 1569. She was given in marriage to ": null
    },
    {
        "Jan Zamoyski": "Jan Zamoyski"
    },
    {
        ", ": null
    },
    {
        "Chancellor of Poland": "Chancellor"
    },
    {
        ", in 1583. Christophers youngest son, Sigismund, was born in 1573.": null
    }
]