[
    {
        "        A circle is a ": null
    },
    {
        "shape": "Shape"
    },
    {
        " consisting of all ": null
    },
    {
        "points": "Point"
    },
    {
        " in a ": null
    },
    {
        "plane": "Plane"
    },
    {
        " that are a given distance from a given point, the ": null
    },
    {
        "centre": "Centre"
    },
    {
        "; equivalently it is the curve traced out by a point that moves in a plane so that its distance from a given point is ": null
    },
    {
        "constant": "Constant"
    },
    {
        ". The distance between any point of the circle and the centre is called the ": null
    },
    {
        "radius": "Radius"
    },
    {
        ". This article is about circles in ": null
    },
    {
        "Euclidean geometry": "Euclidean Geometry"
    },
    {
        ", and, in particular, the Euclidean plane, except where otherwise noted.     Specifically, a circle is a ": null
    },
    {
        "simple": "Simple Polygon"
    },
    {
        " closed ": null
    },
    {
        "curve": "Curve"
    },
    {
        " that divides the plane into two regions: an ": null
    },
    {
        "interior": "Interior"
    },
    {
        " and an exterior. In everyday use, the term circle may be used interchangeably to refer to either the boundary of the figure, or to the whole figure including its interior; in strict technical usage, the circle is only the boundary and the whole figure is called a ": null
    },
    {
        "disc": "Disk"
    },
    {
        ".     A circle may also be defined as a special kind of ": null
    },
    {
        "ellipse": "Ellipse"
    },
    {
        " in which the two ": null
    },
    {
        "foci": "Focus"
    },
    {
        " are coincident and the ": null
    },
    {
        "eccentricity": "Eccentricity"
    },
    {
        " is 0, or the two-dimensional shape enclosing the most area per unit perimeter squared, using ": null
    },
    {
        "calculus of variations": "Calculus Of Variations"
    },
    {
        ".           ": null
    },
    {
        "Annulus": "Annulus"
    },
    {
        "concentric": "Concentric"
    },
    {
        " circles.   ": null
    },
    {
        "Arc": "Arc"
    },
    {
        "connected": "Connected Space"
    },
    {
        " part of a circle. Specifying two end points of an arc and a center allows for two arcs that together make up a full circle.   ": null
    },
    {
        "Centre": "Centre"
    },
    {
        "Chord": "Chord"
    },
    {
        "Circumference": "Circumference"
    },
    {
        "Diameter": "Diameter"
    },
    {
        "Disc": "Disk"
    },
    {
        "Lens": "Lens"
    },
    {
        "coplanar": "Coplanar"
    },
    {
        " straight line that has no point in common with the circle.   ": null
    },
    {
        "Radius": "Radius"
    },
    {
        "Sector": "Circular Sector"
    },
    {
        "Segment": "Circular Segment"
    },
    {
        "segment is used only for regions not containing the center of the circle to which their arc belongs to.   ": null
    },
    {
        "Secant": "Secant Line"
    },
    {
        "Semicircle": "Semicircle"
    },
    {
        "disc": "Disk"
    },
    {
        ". A half-disc is a special case of a ": null
    },
    {
        "segment": "Circular Segment"
    },
    {
        ", namely the largest one.   ": null
    },
    {
        "Tangent": "Tangent"
    },
    {
        "open, that is, not containing their boundaries, or as closed, including their respective boundaries.                   The word circle derives from the ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " κίρκος/κύκλος , itself a ": null
    },
    {
        "metathesis": "Metathesis"
    },
    {
        " of the ": null
    },
    {
        "Homeric Greek": "Homeric Greek"
    },
    {
        " κρίκος , meaning hoop or ring .  , Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus The origins of the words  circus  and  circuit  are closely related.       The circle has been known since before the beginning of recorded history. Natural circles would have been observed, such as the Moon, Sun, and a short plant stalk blowing in the wind on sand, which forms a circle shape in the sand. The circle is the basis for the ": null
    },
    {
        "wheel": "Wheel"
    },
    {
        ", which, with related inventions such as ": null
    },
    {
        "gear": "Gear"
    },
    {
        "s, makes much of modern machinery possible. In mathematics, the study of the circle has helped inspire the development of geometry, ": null
    },
    {
        "astronomy": "Astronomy"
    },
    {
        " and calculus.     Early ": null
    },
    {
        "science": "Science"
    },
    {
        ", particularly ": null
    },
    {
        "geometry": "Geometry"
    },
    {
        " and ": null
    },
    {
        "astrology and astronomy": "Astrology And Astronomy"
    },
    {
        ", was connected to the divine for most ": null
    },
    {
        "medieval scholars": "History Of Science In The Middle Ages"
    },
    {
        ", and many believed that there was something intrinsically divine or perfect that could be found in circles. ": null
    },
    {
        "Arthur Koestler": "Arthur Koestler"
    },
    {
        ",  The Sleepwalkers : A History of Mans Changing Vision of the Universe ": null
    },
    {
        "Proclus": "Proclus"
    },
    {
        ",   Tr. Thomas Taylor Vol. 2, Ch. 2, Of Plato     Some highlights in the history of the circle are:   1700 BCE – The ": null
    },
    {
        "Rhind papyrus": "Rhind Papyrus"
    },
    {
        " gives a method to find the area of a circular field. The result corresponds to  as an approximate value of .  . History.mcs.st-andrews.ac.uk. Retrieved on 2012-05-03.    ": null
    },
    {
        "Euclids Elements": "Euclids Elements"
    },
    {
        " deals with the properties of circles.   In ": null
    },
    {
        "Platos": "Plato"
    },
    {
        " Seventh Letter": "Seventh Letter"
    },
    {
        " there is a detailed definition and explanation of the circle. Plato explains the perfect circle, and how it is different from any drawing, words, definition or explanation.   1880 CE – ": null
    },
    {
        "Lindemann": "Ferdinand Von Lindemann"
    },
    {
        " proves that  is ": null
    },
    {
        "transcendental": "Transcendental Number"
    },
    {
        ", effectively settling the millennia-old problem of ": null
    },
    {
        "squaring the circle": "Squaring The Circle"
    },
    {
        ".  . History.mcs.st-andrews.ac.uk. Retrieved on 2012-05-03.               The ratio of a circles ": null
    },
    {
        "circumference": "Circumference"
    },
    {
        " to its ": null
    },
    {
        "diameter": "Diameter"
    },
    {
        " is  , an ": null
    },
    {
        "irrational": "Irrational Number"
    },
    {
        " constant": "Mathematical Constant"
    },
    {
        " approximately equal to 3.141592654. Thus the length of the circumference C is related to the radius r and diameter d by:   : C 2  r   d.              As proved by ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        ", in his ": null
    },
    {
        "Measurement of a Circle": "Measurement Of A Circle"
    },
    {
        ", the ": null
    },
    {
        "area enclosed by a circle": "Area Of A Disk"
    },
    {
        " is equal to that of a triangle whose base has the length of the circles circumference and whose height equals the circles radius,  which comes to  multiplied by the radius squared:   :     r2.      Equivalently, denoting diameter by d,   :       07854d2,     that is, approximately 79% of the ": null
    },
    {
        "circumscribing": "Circumscribe"
    },
    {
        " square .     The circle is the plane curve enclosing the maximum area for a given arc length. This relates the circle to a problem in the ": null
    },
    {
        "calculus of variations": "Calculus Of Variations"
    },
    {
        ", namely the ": null
    },
    {
        "isoperimetric inequality": "Isoperimetric Inequality"
    },
    {
        ".              Equation of a circle   In an x–y ": null
    },
    {
        "Cartesian coordinate system": "Cartesian Coordinate System"
    },
    {
        ", the circle with centre ": null
    },
    {
        "coordinates": "Coordinate System"
    },
    {
        "  and radius r is the set of all points  such that   :   +       This ": null
    },
    {
        "equation": "Equation"
    },
    {
        ", known as the Equation of the Circle, follows from the ": null
    },
    {
        "Pythagorean theorem": "Pythagorean Theorem"
    },
    {
        " applied to any point on the circle: as shown in the adjacent diagram, the radius is the hypotenuse of a right-angled triangle whose other sides are of length |x − a y − b Parametric form    The equation can be written in ": null
    },
    {
        "parametric form": "Parametric Equation"
    },
    {
        " using the ": null
    },
    {
        "trigonometric functions": "Trigonometric Function"
    },
    {
        "sine and cosine as   : x a+r  t,    : y b+r  t    where t is a ": null
    },
    {
        "parametric variable": "Parametric Variable"
    },
    {
        " in the range 0 to 2, interpreted geometrically as the ": null
    },
    {
        "angle": "Angle"
    },
    {
        " that the ray from  to  makes with the positive x-axis.     An alternative parametrisation of the circle is:   : x a + r     : y b + r       In this parameterisation, the ratio of t to r can be interpreted geometrically as the ": null
    },
    {
        "stereographic projection": "Stereographic Projection"
    },
    {
        " of the line passing through the centre parallel to the x-axis . However, this parameterisation works only if t is made to range not only through all reals but also to a point at infinity; otherwise, the bottom-most point of the circle would be omitted.     3-point-form    The equation of the circle determined by three points , , not on a line is obtained by a conversion of the ": null
    },
    {
        "3-point-form of a circles equation": "Ellipsecircles"
    },
    {
        "   ::           .     Homogeneous form   In ": null
    },
    {
        "homogeneous coordinates": "Homogeneous Coordinates"
    },
    {
        ", each ": null
    },
    {
        "conic section": "Conic Section"
    },
    {
        " with the equation of a circle has the form   : x2+y2-2axz-2byz+cz2 0.      It can be proven that a conic section is a circle exactly when it contains  the points I and J. These points are called the ": null
    },
    {
        "circular points at infinity": "Circular Points At Infinity"
    },
    {
        ".       In ": null
    },
    {
        "polar coordinates": "Polar Coordinates"
    },
    {
        ", the equation of a circle is:   : r2 - 2 r r0   + r02 a2      where a is the radius of the circle, is the polar coordinate of a generic point on the circle, and is the polar coordinate of the centre of the circle . For a circle centred on the origin, i.e. r 0 0, this reduces to simply . When , or when the origin lies on the circle, the equation becomes   : r 2 a      In the general case, the equation can be solved for r, giving   : r r0         Note that without the ± sign, the equation would in some cases describe only half a circle.       In the ": null
    },
    {
        "complex plane": "Complex Plane"
    },
    {
        ", a circle with a centre at c and radius r has the equation:     : |z-c| r  .     In ": null
    },
    {
        "parametric form": "Parametric Equation"
    },
    {
        ", this can be written:     : z re+c .     The slightly generalised equation   : pz  + gz +   q     for real p, q and complex g is sometimes called a ": null
    },
    {
        "generalised circle": "Generalised Circle"
    },
    {
        ". This becomes the above equation for a circle with p 1,  g-  qr2-|c|2 , since |z-c|2 z  . Not all generalised circles are actually circles: a generalised circle is either a circle or a ": null
    },
    {
        "line": "Line"
    },
    {
        ".          The ": null
    },
    {
        "tangent line": "Tangent Line"
    },
    {
        " through a point P on the circle is perpendicular to the diameter passing through P. If  and the circle has centre  and radius r, then the tangent line is perpendicular to the line from  to , so it has the form . Evaluating at  determines the value of c and the result is that the equation of the tangent is   : x+y x1+y1    or   : + r2.      If  then the slope of this line is   :   -      This can also be found using ": null
    },
    {
        "implicit differentiation": "Implicit Differentiation"
    },
    {
        ".     When the centre of the circle is at the origin then the equation of the tangent line becomes   : x1x+y1y r2,    and its slope is   :   -        The circle is the shape with the largest area for a given length of perimeter.    The circle is a highly symmetric shape: every line through the centre forms a line of ": null
    },
    {
        "reflection symmetry": "Reflection Symmetry"
    },
    {
        " and it has ": null
    },
    {
        "rotational symmetry": "Rotational Symmetry"
    },
    {
        " around the centre for every angle. Its ": null
    },
    {
        "symmetry group": "Symmetry Group"
    },
    {
        " is the ": null
    },
    {
        "orthogonal group": "Orthogonal Group"
    },
    {
        " O. The group of rotations alone is the ": null
    },
    {
        "circle group": "Circle Group"
    },
    {
        " T.   All circles are ": null
    },
    {
        "similar": "Similarity"
    },
    {
        ".   A circles circumference and radius are ": null
    },
    {
        "proportional": "Proportionality"
    },
    {
        ".   The ": null
    },
    {
        "area": "Area"
    },
    {
        " enclosed and the square of its radius are ": null
    },
    {
        "proportional": "Proportionality"
    },
    {
        ".   The ": null
    },
    {
        "constants": "Mathematical Constant"
    },
    {
        " of proportionality are 2 and , respectively.   The circle that is centred at the origin with radius 1 is called the ": null
    },
    {
        "unit circle": "Unit Circle"
    },
    {
        ".   Thought of as a ": null
    },
    {
        "great circle": "Great Circle"
    },
    {
        " of the ": null
    },
    {
        "unit sphere": "Unit Sphere"
    },
    {
        ", it becomes the ": null
    },
    {
        "Riemannian circle": "Riemannian Circle"
    },
    {
        ".   Through any three points, not all on the same line, there lies a unique circle. In ": null
    },
    {
        "Cartesian coordinates": "Cartesian Coordinates"
    },
    {
        ", it is possible to give explicit formulae for the coordinates of the centre of the circle and the radius in terms of the coordinates of the three given points. See ": null
    },
    {
        "circumcircle": "Circumcircle"
    },
    {
        ".       Chords are equidistant from the centre of a circle if and only if they are equal in length.   The ": null
    },
    {
        "perpendicular bisector": "Perpendicular Bisector"
    },
    {
        " of a chord passes through the centre of a circle; equivalent statements stemming from the uniqueness of the perpendicular bisector are:   A perpendicular line from the centre of a circle bisects the chord.   The ": null
    },
    {
        "line segment": "Line Segment"
    },
    {
        " through the centre bisecting a chord is ": null
    },
    {
        "perpendicular": "Perpendicular"
    },
    {
        " to the chord.   If a central angle and an ": null
    },
    {
        "inscribed angle": "Inscribed Angle"
    },
    {
        " of a circle are subtended by the same chord and on the same side of the chord, then the central angle is twice the inscribed angle.   If two angles are inscribed on the same chord and on the same side of the chord, then they are equal.   If two angles are inscribed on the same chord and on opposite sides of the chord, then they are ": null
    },
    {
        "supplementary": "Supplementary Angles"
    },
    {
        ".   For a ": null
    },
    {
        "cyclic quadrilateral": "Cyclic Quadrilateral"
    },
    {
        ", the ": null
    },
    {
        "exterior angle": "Exterior Angle"
    },
    {
        " is equal to the interior opposite angle.   An inscribed angle subtended by a diameter is a right angle .   The diameter is the longest chord of the circle.   Among all the circles with a chord AB in common, the circle with minimal radius is the one with diameter AB.   If the ": null
    },
    {
        "intersection of any two chords": "Intersecting Chords Theorem"
    },
    {
        " divides one chord into lengths a and b and divides the other chord into lengths c and d, then .   If the intersection of any two perpendicular chords divides one chord into lengths a and b and divides the other chord into lengths c and d, then  equals the square of the diameter. Posamentier and Salkind, Challenging Problems in Geometry, Dover, 2nd edition, 1996: pp. 104–105, 4–23.   The sum of the squared lengths of any two chords intersecting at right angles at a given point is the same as that of any other two perpendicular chords intersecting at the same point, and is given by 8r 2 – 4p 2 .  College Mathematics Journal  29, September 1998, p. 331, problem 635.   The distance from a point on the circle to a given chord times the diameter of the circle equals the product of the distances from the point to the ends of the chord. Johnson, Roger A., Advanced Euclidean Geometry, Dover Publ., 2007.  A and a tangent at B intersect at the exterior point P, then denoting the centre as O, the angles ∠BOA and ∠BPA are ": null
    },
    {
        "supplementary": "Supplementary Angles"
    },
    {
        ".   If AD is tangent to the circle at A and if AQ is a chord of the circle, then .           CD and EB, intersect at A, then .   If two secants, AE and AD, also cut the circle at B and C respectively, then .   A tangent can be considered a limiting case of a secant whose ends are coincident. If a ": null
    },
    {
        "tangent": "Tangent"
    },
    {
        " from an external point A meets the circle at F and a ": null
    },
    {
        "secant": "Secant Line"
    },
    {
        " from the external point A meets the circle at C and D respectively, then .   The angle between a chord and the tangent at one of its endpoints is equal to one half the angle subtended at the centre of the circle, on the opposite side of the chord .   If the angle subtended by the chord at the centre is 90 ": null
    },
    {
        "degrees": "Degree"
    },
    {
        " then , where ℓ is the length of the chord and r is the radius of the circle.   If two secants are inscribed in the circle as shown at right, then the measurement of angle A is equal to one half the difference of the measurements of the enclosed arcs . That is, 2    -   where O is the centre of the circle. This is the secant-secant theorem.             An ": null
    },
    {
        "inscribed angle": "Inscribed Angle"
    },
    {
        " is exactly half the corresponding ": null
    },
    {
        "central angle": "Central Angle"
    },
    {
        " . Hence, all inscribed angles that subtend the same arc are equal. Angles inscribed on the arc are supplementary. In particular, every inscribed angle that subtends a ": null
    },
    {
        "diameter": "Diameter"
    },
    {
        " is a ": null
    },
    {
        "right angle": "Right Angle"
    },
    {
        " .             ": null
    },
    {
        "sagitta": "Sagitta"
    },
    {
        "  is a line segment drawn perpendicular to a chord, between the midpoint of that chord and the arc of the circle.   Given the length y of a chord, and the length x of the sagitta, the ": null
    },
    {
        "Pythagorean theorem": "Pythagorean Theorem"
    },
    {
        " can be used to calculate the radius of the unique circle that will fit around the two lines:   :: r        Another proof of this result, which relies only on two chord properties given above, is as follows. Given a chord of length y and with sagitta of length x, since the sagitta intersects the midpoint of the chord, we know it is part of a diameter of the circle. Since the diameter is twice the radius, the missing part of the diameter is  in length. Using the fact that one part of one chord times the other part is equal to the same product taken along a chord intersecting the first chord, we find that . Solving for r, we find the required result.         There are many ": null
    },
    {
        "compass-and-straightedge constructions": "Compass-And-Straightedge Construction"
    },
    {
        "resulting in circles.     The simplest and most basic is the construction given the centre of the circle and a point on the circle. Place the fixed leg of the ": null
    },
    {
        "compass": "Compass"
    },
    {
        " on the centre point, the movable leg on the point on the circle and rotate the compass.       Construct the ": null
    },
    {
        "midpoint": "Midpoint"
    },
    {
        "  of the diameter.   Construct the circle with centre  passing through one of the endpoints of the diameter .      ,  and ,   Construct the ": null
    },
    {
        "perpendicular bisector": "Bisectionline Segment Bisector"
    },
    {
        " of the segment .   Construct the ": null
    },
    {
        "perpendicular bisector": "Bisectionline Segment Bisector"
    },
    {
        " of the segment .   Label the point of intersection of these two perpendicular bisectors . .   Construct the circle with centre  passing through one of the points ,  or  .                  ": null
    },
    {
        "Apollonius of Perga": "Apollonius Of Perga"
    },
    {
        " showed that a circle may also be defined as the set of points in a plane having a constant ratio of distances to two fixed foci, A and B.  ": null
    },
    {
        "Ogilvy, C. Stanley": "C. Stanley Ogilvy"
    },
    {
        ", Excursions in Geometry, Dover, 1969, 14–17.  That circle is sometimes said to be drawn about two points.     The proof is in two parts. First, one must prove that, given two foci A and B and a ratio of distances, any point P satisfying the ratio of distances must fall on a particular circle. Let C be another point, also satisfying the ratio and lying on segment AB. By the ": null
    },
    {
        "angle bisector theorem": "Angle Bisector Theorem"
    },
    {
        " the line segment PC will bisect the ": null
    },
    {
        "interior angle": "Interior Angle"
    },
    {
        " APB, since the segments are similar:   :         Analogously, a line segment PD through some point D on AB extended bisects the corresponding ": null
    },
    {
        "exterior angle": "Exterior Angle"
    },
    {
        " BPQ where Q is on AP extended. Since the interior and exterior angles sum to 180 degrees, the angle CPD is exactly 90 degrees, i.e., a ": null
    },
    {
        "right angle": "Right Angle"
    },
    {
        ". The set of points P such that angle CPD is a right angle forms a circle, of which CD is a diameter.     Second, see Altshiller-Court, Nathan, College Geometry, Dover, 2007 .  for a proof that every point on the indicated circle satisfies the given ratio.       A closely related property of circles involves the geometry of the ": null
    },
    {
        "cross-ratio": "Cross-Ratio"
    },
    {
        " of points in the ": null
    },
    {
        "complex plane": "Complex Plane"
    },
    {
        ". If A, B, and C are as above, then the circle of Apollonius for these three points is the collection of points P for which the absolute value of the cross-ratio is equal to one:   : | 1.      Stated another way, P is a point on the circle of Apollonius if and only if the cross-ratio A,B;C,P is on the ": null
    },
    {
        "unit circle": "Unit Circle"
    },
    {
        " in the complex plane.      Generalised circles   If C is the ": null
    },
    {
        "midpoint": "Midpoint"
    },
    {
        " of the segment AB, then the collection of points P satisfying the Apollonius condition   :          is not a circle, but rather a line.     Thus, if A, B, and C are given distinct points in the plane, then the locus of points P satisfying the above equation is called a generalised circle. It may either be a true circle or a line. In this sense a ": null
    },
    {
        "line": "Line"
    },
    {
        " is a generalised circle of infinite radius.       In every ": null
    },
    {
        "triangle": "Triangle"
    },
    {
        " a unique circle, called the ": null
    },
    {
        "incircle": "Incircle And Excircles Of A Triangle"
    },
    {
        ", can be inscribed such that it is ": null
    },
    {
        "tangent": "Tangent"
    },
    {
        " to each of the three sides of the triangle.  . Mathworld.wolfram.com . Retrieved on 2012-05-03.     About every triangle a unique circle, called the ": null
    },
    {
        "circumcircle": "Circumcircle"
    },
    {
        ", can be circumscribed such that it goes through each of the triangles three ": null
    },
    {
        "vertices": "Vertex"
    },
    {
        ".  . Mathworld.wolfram.com . Retrieved on 2012-05-03.     A ": null
    },
    {
        "tangential polygon": "Tangential Polygon"
    },
    {
        ", such as a ": null
    },
    {
        "tangential quadrilateral": "Tangential Quadrilateral"
    },
    {
        ", is any ": null
    },
    {
        "convex polygon": "Convex Polygon"
    },
    {
        " within which a ": null
    },
    {
        "circle can be inscribed": "Inscribed Circle"
    },
    {
        " that is tangent to each side of the polygon.  . Mathworld.wolfram.com . Retrieved on 2012-05-03. Every ": null
    },
    {
        "regular polygon": "Regular Polygon"
    },
    {
        " and every triangle is a tangential polygon.     A ": null
    },
    {
        "cyclic polygon": "Cyclic Polygon"
    },
    {
        " is any convex polygon about which a ": null
    },
    {
        "circle can be circumscribed": "Circumcircle"
    },
    {
        ", passing through each vertex. A well-studied example is the ": null
    },
    {
        "cyclic quadrilateral": "Cyclic Quadrilateral"
    },
    {
        ". Every regular polygon and every triangle is a cyclic polygon. A polygon that is both cyclic and tangential is called a ": null
    },
    {
        "bicentric polygon": "Bicentric Polygon"
    },
    {
        ".     A ": null
    },
    {
        "hypocycloid": "Hypocycloid"
    },
    {
        " is a curve that is inscribed in a given circle by tracing a fixed point on a smaller circle that rolls within and tangent to the given circle.       The circle can be viewed as a ": null
    },
    {
        "limiting case": "Limiting Case"
    },
    {
        " of each of various other figures:   A ": null
    },
    {
        "Cartesian oval": "Cartesian Oval"
    },
    {
        " is a set of points such that a ": null
    },
    {
        "weighted sum": "Weighted Sum"
    },
    {
        " of the distances from any of its points to two fixed points  is a constant. An ": null
    },
    {
        "ellipse": "Ellipse"
    },
    {
        " is the case in which the weights are equal. A circle is an ellipse with an ": null
    },
    {
        "eccentricity": "Eccentricity"
    },
    {
        " of zero, meaning that the two foci coincide with each other as the centre of the circle. A circle is also a different special case of a Cartesian oval in which one of the weights is zero.   A ": null
    },
    {
        "superellipse": "Superellipse"
    },
    {
        " has an equation of the form   +   1 for positive a, b, and n. A supercircle has . A circle is the special case of a supercircle in which .   A ": null
    },
    {
        "Cassini oval": "Cassini Oval"
    },
    {
        " is a set of points such that the product of the distances from any of its points to two fixed points is a constant. When the two fixed points coincide, a circle results.   A ": null
    },
    {
        "curve of constant width": "Curve Of Constant Width"
    },
    {
        " is a figure whose width, defined as the perpendicular distance between two distinct parallel lines each intersecting its boundary in a single point, is the same regardless of the direction of those two parallel lines. The circle is the simplest example of this type of figure.     p-norms   Defining a circle as the set of points with a fixed distance from a point, different shapes can be considered circles under different definitions of distance. In ": null
    },
    {
        "p-norm": "P-Norm"
    },
    {
        ", distance is determined by   :   x   p   .   In Euclidean geometry, p 2, giving the familiar   :   x   2   .     In ": null
    },
    {
        "taxicab geometry": "Taxicab Geometry"
    },
    {
        ", p 1. Taxicab circles are ": null
    },
    {
        "squares": "Square"
    },
    {
        " with sides oriented at a 45° angle to the coordinate axes. While each side would have length   using a ": null
    },
    {
        "Euclidean metric": "Euclidean Metric"
    },
    {
        ", where r is the circles radius, its length in taxicab geometry is 2r. Thus, a circles circumference is 8r. Thus, the value of a geometric analog to ": null
    },
    {
        "    is 4 in this geometry. The formula for the unit circle in taxicab geometry is |x| + |y| 1 in ": null
    },
    {
        "Cartesian coordinates": "Cartesian Coordinates"
    },
    {
        " and     : r       in ": null
    },
    {
        "polar coordinates": "Polar Coordinates"
    },
    {
        ".     A circle of radius 1 is the ": null
    },
    {
        "von Neumann neighborhood": "Von Neumann Neighborhood"
    },
    {
        " of its center.     A circle of radius r for the ": null
    },
    {
        "Chebyshev distance": "Chebyshev Distance"
    },
    {
        "  on a plane is also a square with side length 2r parallel to the coordinate axes, so planar Chebyshev distance can be viewed as equivalent by rotation and scaling to planar taxicab distance. However, this equivalence between L 1 and L ∞ metrics does not generalize to higher dimensions.            ": null
    },
    {
        "Squaring the circle": "Squaring The Circle"
    },
    {
        " is the problem, proposed by ": null
    },
    {
        "ancient": "Classical Antiquity"
    },
    {
        " geometers": "Geometers"
    },
    {
        ", of constructing a square with the same area as a given circle by using only a finite number of steps with ": null
    },
    {
        "compass and straightedge": "Compass And Straightedge"
    },
    {
        ".     In 1882, the task was proven to be impossible, as a consequence of the ": null
    },
    {
        "Lindemann–Weierstrass theorem": "Lindemann–Weierstrass Theorem"
    },
    {
        ", which proves that ": null
    },
    {
        "pi": "Pi"
    },
    {
        "  is a ": null
    },
    {
        "transcendental number": "Transcendental Number"
    },
    {
        ", rather than an ": null
    },
    {
        "algebraic irrational number": "Algebraic Number"
    },
    {
        "; that is, it is not the ": null
    },
    {
        "root": "Root Of A Function"
    },
    {
        " of any ": null
    },
    {
        "polynomial": "Polynomial"
    },
    {
        " with ": null
    },
    {
        "rational": "Rational Number"
    }
]