[
    {
        "      Clark Joseph Kent is a fictional character appearing in ": null
    },
    {
        "American comic books": "American Comic Book"
    },
    {
        " published by ": null
    },
    {
        "DC Comics": "Dc Comics"
    },
    {
        ". Created by ": null
    },
    {
        "Jerry Siegel": "Jerry Siegel"
    },
    {
        " and ": null
    },
    {
        "Joe Shuster": "Joe Shuster"
    },
    {
        ", he debuted in ": null
    },
    {
        "Action Comics 1": "Action Comics 1"
    },
    {
        " and serves as the ": null
    },
    {
        "civilian": "Civilian"
    },
    {
        " and ": null
    },
    {
        "secret identity": "Secret Identity"
    },
    {
        " of the ": null
    },
    {
        "superhero": "Superhero"
    },
    {
        " Superman": "Superman"
    },
    {
        ".     Over the decades there has been considerable debate as to which personality the character identifies with most. From his first introduction in 1938 to the mid-1980s, Clark Kent was seen mostly as a disguise for Superman, enabling him to mix with ordinary people. This was the view in most comics and other media such as movie serials and TV  and radio. In 1986, during ": null
    },
    {
        "John Byrnes": "John Byrne"
    },
    {
        " revamping of the character, Clark Kent became more emphasized. Different takes persist in the present, with the character typically depicted as being clumsy and mild-mannered.       As Supermans ": null
    },
    {
        "alter ego": "Alter Ego"
    },
    {
        ", the personality, concept, and name of Clark Kent have become ingrained in popular culture as well, becoming synonymous with ": null
    },
    {
        "secret identities": "Secret Identity"
    },
    {
        " and innocuous fronts for ulterior motives and activities. In 1992, Superman co-creator Joe Shuster told the Toronto Star that the name derived from 1930s cinematic leading men ": null
    },
    {
        "Clark Gable": "Clark Gable"
    },
    {
        " and ": null
    },
    {
        "Kent Taylor": "Kent Taylor"
    },
    {
        ", but the persona from bespectacled silent film comic ": null
    },
    {
        "Harold Lloyd": "Harold Lloyd"
    },
    {
        " and himself.  Another, perhaps more likely possibility, is that Jerry Siegel pulled from his own love of pulp heroes ": null
    },
    {
        "Doc Clark Savage": "Doc Savage"
    },
    {
        " and ": null
    },
    {
        "The Shadow": "The Shadow"
    },
    {
        " alias Kent Allard. This idea was notably stated in the book Men of Tomorrow: Geeks, Gangsters, and the Rise of the American Comic Book.     Clarks middle name is given variously as either Joseph, Jerome, or Jonathan, all being allusions to creators Jerry Siegel and Joe Shuster.       In the earliest Superman comics, Clark Kents primary purpose was to fulfill the perceived dramatic requirement that a costumed superhero cannot remain on full duty all the time. Clark thus acted as little more than a front for Supermans activities. Although his name and history were taken from his early life with his adoptive Earth parents, everything about Clark was staged for the benefit of his alternate identity: as a reporter for the  Daily Planet , he receives late-breaking news before the general public, has a plausible reason to be present at crime scenes, and need not strictly account for his whereabouts as long as he makes his story deadlines. He sees his job as a journalist as an extension of his Superman responsibilities—bringing truth to the forefront and fighting for the little guy. He believes that everybody has the right to know what is going on in the world, regardless of who is involved.      To deflect suspicion that he is Superman, Clark Kent adopted a largely passive and introverted personality with conservative mannerisms, a higher-pitched voice, and a slight slouch. This personality is typically described as mild-mannered , perhaps most famously by the opening narration of ": null
    },
    {
        "Max Fleischers": "Max Fleischer"
    },
    {
        " Superman animated theatrical shorts": "Superman"
    },
    {
        ". These traits extended into Clarks wardrobe, which typically consists of a bland-colored business suit, a red necktie, black-rimmed glasses, combed-back hair, and occasionally a ": null
    },
    {
        "fedora": "Fedora"
    },
    {
        ".     Fellow reporter ": null
    },
    {
        "Lois Lane": "Lois Lane"
    },
    {
        " became the object of Clarks/Supermans romantic affection. Lois affection for Superman and her rejection of Clarks clumsy advances have been a recurring theme in Superman comics, as well as in movies and on television.       Clark wears his Superman costume underneath his street clothes, allowing easy changes between the two ": null
    },
    {
        "personae": "Persona"
    },
    {
        " and the dramatic gesture of ripping open his shirt to reveal the familiar S emblem when called into action. Superman usually stores his Clark Kent clothing compressed in a secret pouch within his cape,  though some stories have shown him leaving his clothes in some covert location  for later retrieval.     In the Pre-Crisis ": null
    },
    {
        "Superman comic book": "Superman"
    },
    {
        ", Clark appears in occasional back-up stories called The Private Life of Clark Kent , wherein he solves problems subtly as Clark without changing into Superman. The feature was later shown in the  Superman Family  title.       Adopted by ": null
    },
    {
        "Jonathan and Martha Kent": "Jonathan And Martha Kent"
    },
    {
        " from the ": null
    },
    {
        "Kansas": "Kansas"
    },
    {
        " town of ": null
    },
    {
        "Smallville": "Smallville"
    },
    {
        ", Clark was raised with the values of a typical rural American town, including attending the local ": null
    },
    {
        "Methodist Church": "Methodist Church"
    },
    {
        " .      Most continuities state that the Kents never had biological children of their own and were usually depicted as middle-aged or elderly when they found Clark. In the Golden and Silver Age versions of his origin, after the Kents retrieved Clark from his rocket, they brought him to the Smallville ": null
    },
    {
        "Orphanage": "Orphanage"
    },
    {
        " and returned a few days later to formally adopt the orphan, giving him as a first name Marthas maiden name, Clark .   In ": null
    },
    {
        "John Byrnes": "John Byrne"
    },
    {
        " 1986 origin version  The Man of Steel , instead of adopting him through an orphanage, the Kents passed Clark off as their own child after their farm was isolated for months by a series of snowstorms that took place shortly after they found his rocket, using their past medical history of various ": null
    },
    {
        "miscarriages": "Miscarriage"
    },
    {
        " to account for their reasons for keeping Marthas pregnancy secret.       In the ": null
    },
    {
        "Silver Age": "Silver Age Of Comic Books"
    },
    {
        " comics continuity, Clarks superpowers manifested upon his landing on Earth and he gradually learned to master them, adopting the superhero identity of ": null
    },
    {
        "Superboy": "Superboy"
    },
    {
        " at the age of eight. He subsequently developed Clarks timid demeanor as a means of ensuring that no one would suspect any connection between the two alter-egos.        In the wake of ": null
    },
    {
        "John Byrnes": "John Byrne"
    },
    {
        " reboot of Superman continuity in  The Man of Steel , many traditional aspects of Clark Kent were dropped in favor of giving him a more aggressive and extroverted personality , including such aspects as making Clark a top ": null
    },
    {
        "football": "American Football"
    },
    {
        " player in high school along with being a successful author and ": null
    },
    {
        "Pulitzer Prize": "Pulitzer Prize"
    },
    {
        "-winning writer, which includes at least two original novels, The Janus Contract, and Under a Yellow Sun.  Furthermore, Clarks motivations for his professional writing were deepened as both a love for the art that he considers at least as a much a contribution to social good as his Superman activities and as a matter of personal fulfillment in an intellectual field in which his abilities give no unfair competition to his colleagues beyond typing extraordinarily fast. Following  One Year Later , Clark adopts some tricks to account for his absences, such as feigning illness or offering to call the police. These, as well as his slouching posture, are references to his earlier mild-mannered Pre-Crisis versions, but he still maintains a sense of authority and his assertive self. Feeling that Clark is the real person and that Clark is not afraid to be himself in his civilian identity, John Byrne has stated in interviews that he took inspiration for this portrayal from the ": null
    },
    {
        "George Reeves": "George Reeves"
    },
    {
        " version of Superman.     Clarks favorite movie is  To Kill a Mockingbird  . According to the DC Comics Official Guide to Superman, Clark enjoys peanut butter and jelly sandwiches, football games, and the smell of Kansas in the springtime.   His favorite baseball team is the Metropolis Monarchs and his favorite football team is the Metropolis Sharks. As of  One Year Later , Clark is in his mid-thirties, stands at , and weighs about . Unlike in the Silver Age, his powers developed over several years, only coming to their peak when he was an adult.       Supermans secret identity as Clark Kent is one of the ": null
    },
    {
        "DC Universes": "Dc Universe"
    },
    {
        " greatest secrets. Only a few trusted people are aware of it, such as ": null
    },
    {
        "Batman": "Batman"
    },
    {
        " and other members of the ": null
    },
    {
        "Justice League": "Justice League"
    },
    {
        ", Supermans cousin ": null
    },
    {
        "Supergirl": "Supergirl"
    },
    {
        ", and Clarks childhood friend ": null
    },
    {
        "Lana Lang": "Lana Lang"
    },
    {
        ".  Lex Luthor, other supervillains, and various civilians have learned the secret identity several times, though their knowledge is usually removed through various means .     Traditionally, Lois Lane would often suspect Superman of truly being Clark Kent; this was particularly prominent in Silver Age stories, including those in the series Supermans Girl Friend Lois Lane. More recent stories often feature the general public assuming that Superman has no secret identity owing to the fact that he, unlike most heroes, does not wear a mask. In The Secret Revealed , a supercomputer constructed by ": null
    },
    {
        "Lex Luthor": "Lex Luthor"
    },
    {
        " calculated Supermans true identity from information that had been assembled by his staff, but Lex dismissed the idea because he could not believe that someone so powerful would want another, weaker identity. In post- Crisis  continuity, Lois Lane, feeling that someone like Clark could not be Superman, never suspected the dual identity beyond one isolated incident before Clark finally revealed it to her. In Visitor , Lois finds Superman at the Kent ": null
    },
    {
        "farm": "Farm"
    },
    {
        " with ": null
    },
    {
        "Lana Lang": "Lana Lang"
    },
    {
        " and asks him point-blank if he is Clark Kent. Before he can answer, the Kents tell her that they raised Superman alongside Clark like a brother.  In the 2009 ": null
    },
    {
        "retcon": "Retcon"
    },
    {
        " of the mythos, Lois Lane is fully aware from the beginning, along with ": null
    },
    {
        "Perry White": "Perry White"
    },
    {
        ", that the meek, pudgy, and bumbling Clark Kent deliberately holds himself back: however, still far from associating him with Superman, they simply believe hes hiding his qualities as a good reporter.     In the continuity established by DCs ": null
    },
    {
        "New 52": "The New 52"
    },
    {
        " relaunch in 2011, Lois Lane remains unaware that Clark is Superman until she discovers his identity as part of an elaborate plan by new villain Hordr-Root—later revealed to be a son of ": null
    },
    {
        "Vandal Savage": "Vandal Savage"
    },
    {
        "—to blackmail Superman at the same time as he is experiencing a strange power shortage, with his abilities gradually draining each time he uses them. Shortly before this trouble began, Superman also revealed his identity to ": null
    },
    {
        "Jimmy Olsen": "Jimmy Olsen"
    },
    {
        ".  In an attempt to protect Superman from Hordr-Roots blackmail efforts, Lois reveals his identity herself, forcing Clark to go off-grid to find the source of his power shortage after his Daily Planet colleagues abandon him in disgust at his lies. This storyline concludes with the New 52 Superman being forced to subject himself to a form of kryptonite chemotherapy to restore his powers and defeat Savages latest plot, only to subsequently die of kryptonite poisoning.        Following the death of the New-52 Superman, he is replaced as Superman by his counterpart from the pre- Flashpoint  timeline—who operates in secret in a farmhouse with his wife and son after the events of  Convergence  saw them trapped in this new universe—but all are left puzzled when a completely human Clark Kent appears. Supermans tests confirming that this new man genuinely believes that he is Clark Kent, adopted by the Kents after his biological parents died in a gas explosion when he was three months old, who went into hiding while investigating the mysterious Geneticorp and allowed Superman to claim to be him to divert attention from his own actions.  However, when Lois—replacing her apparently dead New 52 counterpart—accepts a date with this Clark to find out more about him, she is unnerved when he goes all out on their date, hiring a limo and booking an expensive restaurant to propose to her. When Lois leaves, she is followed by Clark back to the house she lives in with her family, with Clark being so outraged at the sight of Lois with someone else that he triggers an attack that somehow erases the Kents entire house and their son Jon, subsequently revealing that he is really ": null
    },
    {
        "Mister Mxyzptlk": "Mister Mxyzptlk"
    },
    {
        ", having subjected himself to an intense spell that made him literally believe he was Clark Kent for a time. This confrontation with Mxyzptlk concludes with the essence of pre-Flashpoint Clark and Lois merging with the essences of their New 52 counterparts, allowing them to exist in the new universe with a mixture of their pre-Flashpoint and New 52 histories, although Mxyzptlks actions have allowed Superman to resume his identity as Clark.     In the 2016 miniseries American Alien, written by Max Landis. Clarks powers and the fact he is Supermans alter ego is an open secret in Smallville. This is due primarily to power flare ups that happened in his childhood, such as spontaneously beginning to float in front of his friends at a drive-in movie. The Smallville Police Department even approach a young Clark to ask for his help solving a local murder.      In the future of the ": null
    },
    {
        "Legion of Super-Heroes": "Legion Of Super-Heroes"
    },
    {
        ", his secret identity is historical fact, with exhibits at a Superman Museum depicting the hero and his friends and familys adventures.       Various explanations over the decades have been offered for why people have never suspected Superman and Clark Kent of being one and the same:   The explanation most commonly offered is simply that, despite their physical resemblance, Superman and Clark are perceived as being too different in mannerisms and personality to be the same individual. Some comics note, in the words of ": null
    },
    {
        "Barry Allen": "Flash"
    },
    {
        ", that Clark slouches, wears clothes two sizes too big and raises his voice an octave , making him appear shorter and overweight instead of muscular.   The 2004 limited series  Superman: Birthright  has a young Clark Kent study the ": null
    },
    {
        "Meisner technique": "Meisner Technique"
    },
    {
        " to move seamlessly between his Clark and Superman personae . Live-action actors adopting this approach while playing Clark Kent/Superman include:   George Reeves in the 1950s live-action television series  Adventures of Superman , who brought a naturalistic approach to the dual role. Reeves played Clark as moderately assertive, often taking charge in dangerous or risky situations and unafraid to take reasonable risks. This fact was one of the main inspirations for the 1980s reboot of the Clark Kent half of the Superman character, according to writer and artist ": null
    },
    {
        "John Byrne": "John Byrne"
    },
    {
        " in the article Super-Discussions published by ": null
    },
    {
        "Attic Books": "Attic Books"
    },
    {
        " in Comics Values Monthly Special 2 .   ": null
    },
    {
        "Christopher Reeve": "Christopher Reeve"
    },
    {
        " in the ": null
    },
    {
        "Superman film series": "Superman Film Series"
    },
    {
        ", who was praised for making the disguises effectiveness credible to audiences, portrayed Clark Kent as clumsy and mild mannered. In his book  Still Me , Reeve says he based his interpretation of Clark Kent on ": null
    },
    {
        "Cary Grants": "Cary Grant"
    },
    {
        " nerdy character in  Bringing Up Baby . ": null
    },
    {
        "Tom Mankiewicz": "Tom Mankiewicz"
    },
    {
        " described his performance on the commentary track for  Superman II: The Richard Donner Cut  as always playing Superman but, when he was Clark, playing Superman playing Clark Kent.   ": null
    },
    {
        "Dean Cain": "Dean Cain"
    },
    {
        " in the 1990s series  Lois & Clark: The New Adventures of Superman  showed Clark as a normal and shy Everyman demonstrating occasional touches of clumsiness , but still a highly skilled journalist, much like the current post-Crisis portrayal. His Superman, by contrast, was very much the model of the classic hero who stood up straight and spoke in a more formal and authoritative voice. In the episode Tempus Fugitive , the time-traveler ": null
    },
    {
        "Tempus": "Tempus"
    },
    {
        " mocks Lois, saying that future historians laugh at her for being fooled by a pair of glasses. On the other hand, ": null
    },
    {
        "H.G. Wells": "H.G. Wells"
    },
    {
        " tells Lois that in truth the people of the future simply considered Lois to be blinded by love, and that this has made her story a compelling one throughout the intervening years.    In the 1970s, one suggestion was that the lenses of Clark Kents glasses  constantly amplified a low-level super-": null
    },
    {
        "hypnosis": "Hypnosis"
    },
    {
        " power, thereby creating the illusion of others viewing Clark Kent as a weak and frailer being.  However, this reason was abandoned almost as quickly as it was introduced, since it had various flaws . has a secret identity, considering he does not wear a ": null
    },
    {
        "mask": "Mask"
    },
    {
        ", which implies to most that he has nothing to hide. As an added precaution, Superman would vibrate his face slightly , so that photographs would only show his features as a blur, thus preventing the danger of photographs of both identities being reliably compared.  However, more subsequent stories showing Superman being photographed have tended to ignore this factor. The 2004 series  Superman: Birthright  also explained that Supermans eyes are an inhumanly vivid shade of blue, which Clarks glasses diffuse to make his eyes appear more human. A subsequent explanation is the fact that most people only know of Clark as a name in a byline and only see Superman from a distance, if they see him at all. As most people do not spend much time with both Clark Kent and Superman, the similar appearances are not considered.   A variation of this idea was seen when Lex Luthor had a massive investigation carried out to determine the connection between Clark Kent and Superman; while the resulting data gathered allowed a computer to deduce that Clark Kent was Superman, Luthor dismissed that theory as he is psychologically incapable of understanding why Superman would want to be someone like Clark, believing that Superman would constantly revel in his power just because that is what Luthor would do.   The idea of Supermans identity being secret as the idea never occurs to others has been further explored in other continuities. In the ": null
    },
    {
        "Elseworlds": "Elseworlds"
    },
    {
        " story  JLA: Another Nail —a sequel to  JLA: The Nail , where Kal-El was discovered by and raised in an Amish community when the Kents truck had a nail in the tyre on the day they would have gone out and seen his ship crash— while trying to establish a civilian identity to give new hero Superman a chance to feel human, the Kents initially heavily disguised him with a thick fake beard and large dark glasses. Arriving as they put this disguise together, Lois Lane suggests the alternative of regular glasses and casual hair, on the grounds that the original look gave the impression that he had something to hide, while nobody would particularly pay attention to Kal-El when he looked like this.   Various stories over the decades often show Superman relying upon an imitator on occasions when Clark and Superman are required to appear together. The most prominent such means include:    Superman robot s, androids that physically resemble Superman in powers and appearance.  Superman robots were primarily used during the Silver Age, but were largely disposed of after the early 1970s.  Clark Kent robots were also maintained by Superman for similar purposes.    Batman disguising himself as either Clark or Superman. This was most often seen in Silver Age stories.    Shapeshifters have also aided Clark in protecting his secret identity. For example, after the Return of Superman storyline in the 1990s, Clark  was photographed besides Superman after Superman had returned from the dead, Matrix using her shape-shifting abilities to create the impression that Clark Kent had been trapped in an underground bunker during Doomsdays rampage to account for Clark and Supermans mutual absences. In other occasions, Clarks comrade in the ": null
    },
    {
        "Justice League": "Justice League"
    },
    {
        ", the ": null
    },
    {
        "Martian Manhunter": "Martian Manhunter"
    },
    {
        ", has provided similar assistance.          When crises arise, Clark quickly changes into Superman. Originally during his appearances in  Action Comics  and later in his own magazine, the Man of Steel would strip to his costume and stand revealed as Superman, often with the transformation having already been completed. But within a short time, Joe Shuster and his ghost artists began depicting Clark Kent ripping open his shirt to reveal the S insignia on his chest—an image that became so iconic that other superheroes, during the Golden Age and later periods, would copy the same type of change during transformations.     In the Fleischer theatrical cartoons released by Paramount, the mild-mannered reporter often ducked into a telephone booth or stockroom to make the transformation. Since the shorts were produced during the rise of ": null
    },
    {
        "film noir": "Film Noir"
    },
    {
        " in cinema, the change was usually represented as a stylized sequence: Clark Kents silhouette is clearly seen behind a closed doors pebble glass window as he strips to his Superman costume. Then, the superhero emerges having transformed from his meek disguise to his true self. In the comic books and in the George Reeves television series, he favors the Daily Planets storeroom for his changes of identities .     The ": null
    },
    {
        "CBS": "Cbs"
    },
    {
        " Saturday morning series  The New Adventures of Superman  produced by Filmation Studios—as well as  The Adventures of Superboy  from the same animation house—featured the iconic shirt rip to reveal the S or Clark Kent removing his unbuttoned white dress shirt in a secluded spot, usually thanks to stock animation which was reused over dozens of episodes, to reveal his costume underneath while uttering his famed line This is a job for Superman!     As a dramatic plot device, Clark often has to quickly improvise in order to find a way to change unnoticed. For example, in Superman , Clark, unable to use a newer, open-kiosk pay phone , runs down the street and rips open his shirt to reveal his costume underneath. He quickly enters a revolving door, spinning through it at incredible speed while changing clothes. Thus made invisible, he appears to have entered the building as Clark Kent and exited seconds later as Superman. Later in the film, when the need to change is more urgent , he simply jumps out a window of the Daily Planet offices, changing at super-speed as he falls and flies off. Further films in the series continued this tradition, with Clark blurring into Superman, changing at super-speed while he runs.     In Lois & Clark, Clarks usual method of changing was to either suddenly remember something urgent that required his immediate attention or leave the room/area under the pretense of contacting a source, summoning the police, heading to a breaking storys location, etc. The change would then frequently occur off-screen, although the shirt-rip reveal was a prominently used move well-associated with the show. Clark also developed a method of rapidly spinning into his costume at super speed which became a trademark change, especially during the third and fourth seasons of the series, and extremely popular with the shows fans. An alternate universe Clark was shown to enter an empty room and emerge as Superman a moment later, although he did adopt the spinning move eventually at Lois advice.     In one scene of  Batman: The Dark Knight Returns , Clark becomes aware of an emergency while talking with ": null
    },
    {
        "Bruce Wayne": "Bruce Wayne"
    },
    {
        " and, in the next ": null
    },
    {
        "panel": "Panel"
    },
    {
        ", he has flown out of his Kent clothing and glasses so quickly that they have had no time to fall.     In Season 8 of Smallville, Clark begins to show a bit more of his double identity. He starts slowing down his superspeed enough for surveillance cameras to see his iconic red and blue streak. This reveals to the citizens of ": null
    },
    {
        "Metropolis": "Metropolis"
    },
    {
        " that a superhero is among them and the name The Red-Blue Blur is coined. When Jimmy Olsen becomes suspicious, Clark decides to reserve his usual red-and-blue for saving people. He carries a backpack with him to work every day, containing his change of clothes. He begins to practice his speed change at home and at the Daily Planet. He changes in a superspeed spin in the Daily Planets phone booth and once even in his office chair. The last minute of the last episode of Smallville had Clark responding to an emergency, rushing to the top of the Daily Planet building, and then using the familiar shirt-rip while the camera zoomed in on the familiar S-logo to the original John Williams fanfare.          There is debate as to which of the two identities is the real person and which is the façade. Fans and Superman scholars follow one of three interpretations:   Superman is real, Clark Kent the mask: Pre-Crisis interpretations of Superman assumed that Clark Kent was the mask and Kal-El the person . In one 1960s comic, when Kent finds himself at a loose end when staff at the  Daily Planet  go on strike, he seriously considers it a chance to try out a new identity in case he has to abandon Clark Kent role permanently . His options include becoming a full-time policeman or even a mere tramp whom no one would ever suspect of being the Man of Steel . Illustration included in the Penguin Book of Comics by George Perry and Alan Aldridge, published in 1967. In the Smallville episode Masquerade , Clark tells Lois that Clark Kent is just a name, just two words, and that the Blur is who he really is. This argument, made in ": null
    },
    {
        "Jules Feiffers": "Jules Feiffer"
    },
    {
        " series of articles published in The Great Comic Book Heroes, is famously cited in a climactic scene of  Kill Bill: Volume 2 , with the character of Bill noting that Superman was not born into his alter ego , using the blanket he was wrapped in as his costume, and Clark Kent is a collage of mankinds less impressive traits meant to blend in with other humans , using this analogy to demonstrate how the character of the Bride could never abandon the killer she is even if she pretended to be something else, though as Bill is the villain of the movie, whether or not audiences are meant to empathize with anything he says is debatable. ": null
    },
    {
        "Richard Donner": "Richard Donner"
    },
    {
        ", the director of the first Reeve movie, stated that he believes Clark Kent to be the disguise .   Clark Kent is real, Superman the mask: With John Byrnes more assertive revamp of Clark Kent as well as Supermans greater grounding in Earth culture and humanity , Superman is considered the mask and Clark the person. This is made explicit by Clark himself in Superman 53, when following his revelation to Lois of his role as Superman , he states: Im Clark, the man you love. Superman is the creation  – you named me, Lois. In pre-Crisis continuity, Kal-El was already a toddler before leaving Krypton, and retained memories of that childhood that later resurfaced, while, in Post-Crisis continuity, he was sent to Earth pre-natally in a birthing matrix  and raised entirely by the Kents. As a result of their rearing, Kal-El grows up to think of himself as Clark Kent, completely unaware of his alien heritage until he was well into adulthood . Although the morals instilled in him by the Kents have motivated Kal-El to use his abilities to help others, he developed the Superman persona to protect his Clark Kent identity. In the  Superman: The Animated Series  episode The Late Mr. Kent , wherein Clark Kent is presumed dead, Superman expresses frustration at the idea of not being Clark and having to be someone else instead . In a previous episode, the third part of the Last Son of Krypton arc, Jonathan Pa Kent assures his adoptive son that he will always be Clark Kent and that Superman just helps out every now and then. In the Tempus Fugitive episode of Lois & Clark, Clark attempts to persuade Lois that Superman does not define him: Superman is what I can do. Clark is who I am.   Neither Clark Kent nor Superman is the real person: Some versions of Superman explain that the Clark Kent and Superman identities are different facets of the same person. It has been implied, especially in the alternate future story  Kingdom Come , that the Clark Kent persona represents the values taught to him by his Midwestern parents. These values are what he holds most dear, giving him an instinctive knowledge of right and wrong that allows him to adopt his Superman persona without being consumed by the moral implications of his actions. Superman is the means through which he can bring this example to the world at large. At the storys climax, when Superman stands poised to destroy the United Nations, Norman McCay makes him realise that, when he abandoned Clark Kent fifteen years prior and retreated into his Superman self, he lost his instinctive morality, and thus the ability to be a heroic Superman. With this knowledge and a pair of glasses given to him as a gift by Wonder Woman, Clark regains his humanity and sets out to become a hero again by re-fertilizing the formerly-irradiated fields of Kansas. Director Bryan Singer stated at the 2006 ": null
    },
    {
        "Comic-Con": "San Diego Comic-Con International"
    },
    {
        " that he favored the three-persona concept, stating that there was Clark Kent on the farm, the bumbling Metropolis Clark, and Superman, the Last Son of Krypton. Brandon Routh himself stated, in an  HBO First Look  interview that he was playing three characters: Clark Kent, the reporter/farm boy; Superman, the protagonist and savior of Metropolis; and Kal-El, the Last Son of ": null
    },
    {
        "Krypton": "Krypton"
    },
    {
        ".     Clark Kent has also been depicted without the Superman alter ego. In the ": null
    },
    {
        "Elseworlds": "Elseworlds"
    },
    {
        " stories starting with  Superman: Last Son of Earth , he is the son of Jonathan Kent, who saves his son from the destruction of the Earth. Clark ends up on Krypton, where he is adopted by Jor-El and becomes the planets ": null
    },
    {
        "Green Lantern": "Green Lantern"
    },
    {
        ".         The Adventures of Superman radio series  Adventures of Superman  radio episodes, Kal-El landed on Earth as an adult. He saved a man and his son and they gave him the idea of living as a normal person. They gave him the name of Clark Kent, and he later got a job as a newspaper reporter under that name. In that role he adopted a higher voice and a more introverted personality  – clearly establishing that Kent is the secret identity and Superman is the true person.     Later episodes shifted to the usual origin story, in which Kal-El landed on Earth as a baby and was raised by the Kent family.     ": null
    },
    {
        "Clayton Bud Collyer": "Bud Collyer"
    },
    {
        " voiced both Clark Kent and Superman, until ": null
    },
    {
        "Michael Fitzmaurice": "Michael Fitzmaurice"
    },
    {
        " replaced him in the final episodes.       In the film serials  Superman  and  Atom Man vs. Superman  , ": null
    },
    {
        "Kirk Alyn": "Kirk Alyn"
    },
    {
        " portrays Clark as a mild-mannered reporter who comes to Metropolis and secures a job at the  Daily Planet , following the death of his foster parents. While he quickly gains the respect of Planet editor Perry White, he is forced to contend with rival reporter Lois Lane, who often uses trickery to prevent Clark from pursuing a lead . Nevertheless, his journalistic skills are useful as he pursues stories on the crime boss known as the Spider Lady, and the criminal scientist ": null
    },
    {
        "Luthor": "Lex Luthor"
    },
    {
        " .     Adventures of Superman TV series ": null
    },
    {
        "George Reeves": "George Reeves"
    },
    {
        " series, Clark Kent is portrayed as a cerebral character who is the crime reporter for the  Daily Planet  and who as Kent uses his intelligence and powers of deduction to solve crimes  before catching the villain as Superman. Examples include the episodes Mystery of the Broken Statues, A Ghost for Scotland Yard, The Man in the Lead Mask, and The Golden Vulture. George Reeves Kent/Superman is also established as a champion of justice for the oppressed in episodes like The Unknown People and The Birthday Letter. Although Kent is described in the show introduction as mild-mannered , he can be very assertive, often giving orders to people and taking authoritative command of situations, though, as in the Pre-Crisis Superman stories at that time, Clark is still considered the secret identity. He gets people to trust his judgment very easily and has a good, often wisecracking, sense of humor. Reeves, who first appeared as the character in the 1951 film  Superman and the Mole Men , was older than subsequent Superman actors.     Superman films and Superman Returns --  ref /ref  ref  /ref ref  /ref  ref /ref ref /ref ref /ref ref /ref ref /ref ref /ref ref /ref ref /ref  ref /ref ref /ref ref  /ref ref  /ref ref  /ref ref  /ref  ref  /ref ref ": null
    }
]