[
    {
        "   A clipper was a type of mid-19th-century ": null
    },
    {
        "merchant": "Merchant Ship"
    },
    {
        " sailing ship": "Sailing Ship"
    },
    {
        ", designed for speed. Developed from a type of ": null
    },
    {
        "schooner": "Schooner"
    },
    {
        " known as ": null
    },
    {
        "Baltimore clipper": "Baltimore Clipper"
    },
    {
        "s, clipper ships had three ": null
    },
    {
        "masts": "Mast"
    },
    {
        " and a ": null
    },
    {
        "square rig": "Square Rig"
    },
    {
        ". They were generally narrow for their length, small by later 19th century standards, could carry limited bulk freight, and had a large total ": null
    },
    {
        "sail": "Sail"
    },
    {
        " area. Clipper ships were mostly constructed in British and American ": null
    },
    {
        "shipyard": "Shipyard"
    },
    {
        "s, though France, Brazil, the Netherlands and other nations also produced some. Clippers sailed all over the world, primarily on the trade routes between the United Kingdom and China, in ": null
    },
    {
        "transatlantic": "Transatlantic Crossing"
    },
    {
        " trade, and on the New York-to-San Francisco route around ": null
    },
    {
        "Cape Horn": "Cape Horn"
    },
    {
        " during the ": null
    },
    {
        "California Gold Rush": "California Gold Rush"
    },
    {
        ". Dutch clippers were built beginning in the 1850s for the tea trade and passenger service to ": null
    },
    {
        "Java": "Java"
    },
    {
        ".     The boom years of the clipper ship era began in 1843 as a result of a growing demand for a more rapid delivery of tea from China. It continued under the stimulating influence of the discovery of gold in California and Australia in 1848 and 1851, and ended with the opening of the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        " in 1869. While ": null
    },
    {
        "composite": "Composite Ship"
    },
    {
        " clippers continued to be built into the 1870s, the next generation of sailing ships were ": null
    },
    {
        "iron-hulled": "Iron-Hulled Sailing Ship"
    },
    {
        ". The last full-rigged composite passenger clipper  was launched in 1875, while iron hulled clippers in the Australian wool trade continued to be built into the 1890s.            The term clipper most likely derives from the verb clip , which in former times meant, among other things, to run or fly swiftly. ": null
    },
    {
        "Dryden": "John Dryden"
    },
    {
        ", the English poet, used the word clip to describe the swift flight of a falcon in the 17th century when he said And, with her eagerness the quarry missed, Straight flies at check, and clips it down the wind. The ships appeared to clip along the ocean water. The term clip became synonymous with speed and was also applied to fast horses and sailing ships. To clip it, and going at a good clip, remained familiar expressions in the early 20th century.        While the first application of the term clipper in a nautical sense is by no means certain, it seems to have had an American origin when applied to the Baltimore clippers of the late 18th century. When these vessels of a new model were built, which were intended to clip over the waves rather than plough through them, the improved type of craft became known as clippers because of their speed.      In England the nautical term clipper appeared a little later. The  Oxford English Dictionary  says its earliest quotation for clipper is from 1830. Carl C. Cutler reports the first newspaper appearance was in 1835. There is discussion of the superior speed of a clipper compared to other ships by captains called before court in A report of the trial of Pedro Gibert et al before the United States Circuit Court of 1934;  Edward H. FauconSamuel Austin Turner     There is no single definition of the characteristics of a clipper ship, but mariner and author ": null
    },
    {
        "Alan Villiers": "Alan Villiers"
    },
    {
        " describes them as follows: To sailors, three things made a ship a clipper. She must be sharp-lined, built for speed. She must be tall-sparred and carry the utmost spread of canvas. And she must use that sail, day and night, fair weather and foul. Villiers , p. 216 Optimized for speed, they were too fine-lined to carry much cargo. Clippers typically carried extra sails such as ": null
    },
    {
        "skysails": "Skysails"
    },
    {
        " and ": null
    },
    {
        "moonrakers": "Moonraker"
    },
    {
        "on the masts, and ": null
    },
    {
        "studding sails": "Studding Sail"
    },
    {
        "on booms extending out from the hull or yards, Villiers , frontispiece and p.220 which required extra sailors to handle them. Villiers , p. 216, 220 In conditions where other ships would shorten sail, clippers drove on, ": null
    },
    {
        "heeling": "Heeling"
    },
    {
        " so much that their ": null
    },
    {
        "lee": "Lee Side"
    },
    {
        " rails": "Gunwale"
    },
    {
        " were in the water. Villiers , pp. 217, 218               The first ships to which the term clipper seems to have been applied were the Baltimore clippers. Baltimore clippers were ": null
    },
    {
        "topsail schooners": "Topsail Schooner"
    },
    {
        "developed in the ": null
    },
    {
        "Chesapeake Bay": "Chesapeake Bay"
    },
    {
        " before the ": null
    },
    {
        "American Revolution": "American Revolution"
    },
    {
        ", and which reached their zenith between 1795 and 1815. They were small, rarely exceeding 200 ": null
    },
    {
        "tons OM": "Builders Old Measurement"
    },
    {
        ", and modelled after French ": null
    },
    {
        "lugger": "Lugger"
    },
    {
        "s.    Some were lightly armed in the ": null
    },
    {
        "War of 1812": "War Of 1812"
    },
    {
        ", sailing under ": null
    },
    {
        "Letters of Marque and Reprisal": "Letter Of Marque"
    },
    {
        ", when the type—exemplified by Chasseur, launched at ": null
    },
    {
        "Fells Point, Baltimore": "Fells Point, Baltimore"
    },
    {
        " in 1814—became known for her incredible speed; the deep ": null
    },
    {
        "draft": "Draft"
    },
    {
        " enabled the Baltimore clipper to sail ": null
    },
    {
        "close to the wind": "Close Hauled"
    },
    {
        ". Villiers 1973. Clippers, running the British blockade of Baltimore, came to be recognized for speed rather than cargo space.     Speed was also required for the Chinese opium trade between India and China. Small, sharp-bowed British vessels were the result. These were called opium clippers.      Meanwhile, Baltimore Clippers still continued to be built, and were built specifically for the China opium trade running opium between India and China, a trade that only became unprofitable for American shipowners in 1849.       Ann McKim , built in Baltimore in 1833 by the Kennard & Williamson shipyard, Dear, I.C.B., & Kemp, Peter, eds. Oxford Companion to Ships and the Sea . Website  Accessed 30 March 2009. is considered to be the original clipper ship.  She measured 494 ": null
    },
    {
        "tons OM": "Builders Old Measurement"
    },
    {
        ", and was built on the enlarged lines of a Baltimore clipper, with sharply raked ": null
    },
    {
        "stem": "Stem"
    },
    {
        ", ": null
    },
    {
        "counter stern": "Transom"
    },
    {
        " and square rig. Although Ann McKim was the first large clipper ship ever constructed, it cannot be said that she founded the clipper ship era, or even that she directly influenced shipbuilders, since no other ship was built like her; but she may have suggested the clipper design in vessels of ship rig. She did, however, influence the building of  Rainbow  in 1845, the first ": null
    },
    {
        "extreme clipper": "Extreme Clipper"
    },
    {
        " ship.     In ": null
    },
    {
        "Aberdeen": "Aberdeen"
    },
    {
        ", Scotland, the shipbuilders ": null
    },
    {
        "Alexander Hall and Sons": "Alexander Hall And Sons"
    },
    {
        " developed the Aberdeen clipper bow in the late 1830s: the first was Scottish Maid launched in 1839.  Scottish Maid, 150 tons OM, was the first British clipper ship. Scottish Maid was intended for the Aberdeen-London trade, where speed was crucial to compete with steamships. The Hall brothers tested various hulls in a water tank and found the clipper design most effective. The design was influenced by tonnage regulations. Tonnage measured a ships cargo capacity and was used to calculate tax and harbour dues. The new 1836 regulations measured depth and breadth with length measured at half midship depth. Extra length above this level was tax-free and became a feature of clippers. Scottish Maid proved swift and reliable and the design was widely copied.  The earliest British clipper ships were built for trade amongst the British Isles. Then followed the vast clipper trade of tea, opium, spices and other goods from the Far East to Europe, and the ships became known as tea clippers .     From 1839, larger American clipper ships started to be built beginning with Akbar, 650 tons OM, in 1839, and including the 1844-built ": null
    },
    {
        "Houqua": "Houqua"
    },
    {
        ", 581 tons OM. These larger vessels were built predominantly for use in the China tea trade and known as tea clippers . Smaller clipper vessels also continued to be built predominantly for the China opium trade and known as opium clippers such as the 1842-built Ariel, 100 tons ": null
    },
    {
        "OM": "Builders Old Measurement"
    },
    {
        ".     Then in 1845  Rainbow , 757 tons OM, the first ": null
    },
    {
        "extreme clipper": "Extreme Clipper"
    },
    {
        " was launched in New York. These American clippers were larger vessels designed to sacrifice cargo capacity for speed. They had a bow lengthened above the water, a drawing out and sharpening of the forward body, and the greatest breadth further aft. Extreme clippers were built in the period 1845 to 1855.     In 1851, shipbuilders in Medford, Massachusetts built the Antelope. Often called the  Antelope of Boston  to distinguish it from other ships of the same name, this vessel is sometimes called one of the first medium clipper ships. A ship-design journalist noted that the design of her model was to combine large stowage capacity with good sailing qualities. Boston Daily Atlas, November 29, 1851 The Antelope was relatively flat-floored and had only an 8-inch dead rise at half floor.     The medium clipper, though still very fast, had comparatively more allowance for cargo. After 1854 extreme clippers were replaced in American shipbuilding yards by medium clippers.     The  Flying Cloud  was a clipper ship that set the worlds sailing record for the fastest passage between New York and San Francisco, 89 days 8 hours. She held this record for over 100 years, from 1854 to 1989. Flying Cloud was the most famous of the clippers built by ": null
    },
    {
        "Donald McKay": "Donald Mckay"
    },
    {
        ". She was known for her extremely close race with the Hornet in 1853; for having a woman navigator, ": null
    },
    {
        "Eleanor Creesy": "Eleanor Creesy"
    },
    {
        ", wife of Josiah Perkins Creesy, who skippered the Flying Cloud on two record-setting voyages from New York to San Francisco; and for sailing in the Australia and timber trades.     Clipper ships largely ceased being built in American shipyards in 1859 when, unlike the earlier boom years, only 4 clipper ships were built. That is except for a small number built in the 1860s. The last American clipper ship was the Pilgrim launched in 1873 from the shipyards of Medford, Massachusetts, built by Joshua T. Foster. Among ship owners of the day, “Medford-built” came to mean the best.  Accessed 19 October 2017      During the time from 1859 British clipper ships continued to be built. Earlier British clipper ships had become known as extreme clippers, and were considered to be as sharp as the American built ships. From 1859 a new design was developed for British clipper ships that was nothing like the American clippers. These ships built from 1859 continued to be called extreme clippers. The new design had a sleek graceful appearance, less sheer, less freeboard, lower bulwarks, and smaller breadth. They were built for the China tea trade and began with Falcon in 1859, and finished with the last ships built in 1870. It is estimated that 25 to 30 of these ships were built, and no more than 4–5 per year. The earlier ships were made from wood, though some were made from iron, just as some British clippers had been made from iron prior to 1859. In 1863 the first tea clippers of composite construction were brought out, combining the best of both worlds. Composite clippers had the strength of iron spars with wooden hulls, and ": null
    },
    {
        "copper sheathing": "Copper Sheathing"
    },
    {
        " could be added to prevent the fouling that occurred on iron hulls.     After 1869 with the opening of the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        " that greatly advantaged steam vessels , the tea trade then collapsed for clippers. From the late 1860s-early 1870s the clipper trade increasingly focused on trade and the carrying of immigrants between England and Australia and New Zealand, a trade that had begun earlier with the Australian Gold Rush in the 1850s. British-built clipper ships were used for this trade, as were many American-built ships which were sold to British owners. Even in the 1880s, sailing ships were still the main carriers of cargoes to and from Australia and New Zealand. This trade eventually became unprofitable, and the aging clipper fleet became unseaworthy.            Among the most notable clippers were the China clippers, also called tea clippers or opium clippers, designed to ply the trade routes between Europe and the ": null
    },
    {
        "East Indies": "East Indies"
    },
    {
        ".  The last example of these still in reasonable condition was  Cutty Sark , preserved in ": null
    },
    {
        "dry dock": "Dry Dock"
    },
    {
        " at ": null
    },
    {
        "Greenwich": "Greenwich"
    },
    {
        ", United Kingdom. ": null
    },
    {
        "Damaged by fire": "Cutty Sarkconservation And Fire"
    },
    {
        " on 21 May 2007 while undergoing conservation, the ship was permanently elevated three metres above the dry dock floor in 2010 as part of a plan for long-term preservation.     Before the early 18th century, the East India Company paid for its tea mainly in silver. When the Chinese Emperor chose to embargo European manufactured commodities and demand payment for all Chinese goods in silver, the price rose, restricting trade. The ": null
    },
    {
        "East India Company": "East India Company"
    },
    {
        " began to manufacture a product that was desired by the Chinese as much as tea was by the British: opium. This had a significant influence on both India and China. Opium was also imported into Britain and was not prohibited because it was thought to be medically beneficial. ": null
    },
    {
        "Laudanum": "Laudanum"
    },
    {
        ", which was made from opium was also used as a pain killer, to induce sleep and to suppress anxiety. The famous literary opium addicts ": null
    },
    {
        "Thomas De Quincey": "Thomas De Quincey"
    },
    {
        ", ": null
    },
    {
        "Samuel Taylor Coleridge": "Samuel Taylor Coleridge"
    },
    {
        " and ": null
    },
    {
        "Wilkie Collins": "Wilkie Collins"
    },
    {
        " also took it for its pleasurable effects. The ": null
    },
    {
        "Limehouse": "Limehouse"
    },
    {
        " area in London was notorious for its opium dens, many of which catered for Chinese sailors as well as English addicts.      Clippers were built for seasonal trades such as tea, where an early cargo was more valuable, or for passenger routes. One passenger ship survives, the ": null
    },
    {
        "City of Adelaide": "City Of Adelaide"
    },
    {
        " designed by ": null
    },
    {
        "William Pile": "William Pile"
    },
    {
        " of ": null
    },
    {
        "Sunderland": "City Of Sunderland"
    },
    {
        ". The fast ships were ideally suited to low-volume, high-profit goods, such as tea, ": null
    },
    {
        "opium": "Opium"
    },
    {
        ", spices, people, and mail. The return could be spectacular. The  Challenger  returned from Shanghai with  the most valuable cargo of tea and silk ever to be laden in one bottom .  Competition among the clippers was public and fierce, with their times recorded in the newspapers. The ships had short expected lifetimes and rarely outlasted two decades of use before they were broken up for salvage. Given their speed and maneuverability, clippers frequently mounted ": null
    },
    {
        "cannon": "Cannon"
    },
    {
        " or ": null
    },
    {
        "carronades": "Carronade"
    },
    {
        "and were used for ": null
    },
    {
        "piracy": "Pirate"
    },
    {
        ", ": null
    },
    {
        "privateer": "Privateer"
    },
    {
        "ing, ": null
    },
    {
        "smuggling": "Smuggling"
    },
    {
        ", or interdiction service.      The last China clippers were acknowledged as the fastest sail vessels. When fully rigged and riding a tradewind, they had peak average speeds over . ": null
    },
    {
        "The Great Tea Race of 1866": "The Great Tea Race Of 1866"
    },
    {
        " showcased their speed. China clippers are also the fastest commercial sailing vessels ever made. Their speeds have been exceeded many times by modern ": null
    },
    {
        "yacht": "Yacht"
    },
    {
        "s, but never by a commercial sail vessel. Only the fastest ": null
    },
    {
        "windjammers": "Windjammer"
    },
    {
        "could attain similar speeds.        The 24h record of the Champion of the Seas wasnt broken until 1984 , or 2001 .          Decline in the use of clippers started with the economic slump following the ": null
    },
    {
        "Panic of 1857": "Panic Of 1857"
    },
    {
        " and continued with the gradual introduction of the ": null
    },
    {
        "steamship": "Steamship"
    },
    {
        ". Although clippers could be much faster than early steamships, they depended on the vagaries of the wind, while steamers could keep to a schedule. The steam clipper was developed around this time, and had auxiliary steam engines which could be used in the absence of wind. An example was  Royal Charter , built in 1857 and wrecked on the coast of ": null
    },
    {
        "Anglesey": "Anglesey"
    },
    {
        " in 1859. The final blow was the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        ", opened in 1869, which provided a great shortcut for steamships between Europe and Asia, but was difficult for sailing ships to use. With the absence of the tea trade, some clippers began operating in the wool trade, between Britain and Australia.          Out of the many clipper ships that were built during the mid-19th century, only two are known to have survived up to present. The only intact survivor is  Cutty Sark , which was preserved as a ": null
    },
    {
        "museum ship": "Museum Ship"
    },
    {
        " in 1954 at ": null
    },
    {
        "Greenwich": "Greenwich"
    },
    {
        " for public display. The other known survivor is  City of Adelaide , unlike Cutty Sark she was reduced to a ": null
    },
    {
        "hulk": "Hulk"
    },
    {
        " over the years. She eventually sank at her moorings in 1991, but was raised the following year and remained on dry land for years. Adelaide  is the older of the two survivors, and was transported to Australia for conservation.              Departures of clipper ships, mostly from New York and Boston to San Francisco, were advertised by clipper ship sailing cards. These cards, slightly larger than today’s postcards, were produced by letterpress and wood engraving on coated card stock. Most clipper cards were printed in the 1850s and 1860s, and represented the first pronounced use of color in American advertising art.     Relatively few cards survive today. With their stunning appearance, rarity, and importance as artifacts of nautical, Western, and printing history, clipper cards are highly prized by both private collectors and institutions. ": null
    }
]