[
    {
        "        Cloning is the process of producing ": null
    },
    {
        "genetically": "Genetics"
    },
    {
        " identical individuals of an ": null
    },
    {
        "organism": "Organism"
    },
    {
        " either naturally or artificially. In nature, many organisms produce clones through ": null
    },
    {
        "asexual reproduction": "Asexual Reproduction"
    },
    {
        ". Cloning in ": null
    },
    {
        "biotechnology": "Biotechnology"
    },
    {
        " refers to the process of creating clones of organisms or copies of ": null
    },
    {
        "cells": "Cell"
    },
    {
        "or ": null
    },
    {
        "DNA": "Dna"
    },
    {
        " fragments . Beyond ": null
    },
    {
        "biology": "Biology"
    },
    {
        ", the term refers to the production of multiple copies of ": null
    },
    {
        "digital media": "Digital Media"
    },
    {
        " or ": null
    },
    {
        "software": "Software"
    },
    {
        ".     The term clone, coined by ": null
    },
    {
        "Herbert J. Webber": "Herbert J. Webber"
    },
    {
        ", is derived from the ": null
    },
    {
        "Ancient Greek": "Ancient Greek"
    },
    {
        " word ": null
    },
    {
        "κλών": "Wikt:Κλώνancient Greek"
    },
    {
        " klōn, twig , referring to the process whereby a new plant can be created from a twig. In botany, the term lusus was traditionally used.  In ": null
    },
    {
        "horticulture": "Horticulture"
    },
    {
        ", the spelling clon was used until the twentieth century; the final e came into use to indicate the vowel is a long o instead of a short o .   Since the term entered the popular lexicon in a more general context, the spelling clone has been used exclusively.       Cloning is a natural form of reproduction that has allowed life forms to spread for hundreds of millions of years. It is the reproduction method used by ": null
    },
    {
        "plant": "Plant"
    },
    {
        "s, ": null
    },
    {
        "fungi": "Fungi"
    },
    {
        ", and ": null
    },
    {
        "bacteria": "Bacteria"
    },
    {
        ", and is also the way that ": null
    },
    {
        "clonal colonies": "Clonal Colony"
    },
    {
        " reproduce themselves.   Examples of these organisms include ": null
    },
    {
        "blueberry plants": "Vaccinium Corymbosum"
    },
    {
        ", ": null
    },
    {
        "hazel trees": "Hazel"
    },
    {
        ", ": null
    },
    {
        "the Pando trees": "Pando"
    },
    {
        ",   the ": null
    },
    {
        "Kentucky coffeetree": "Kentucky Coffeetree"
    },
    {
        ",  Myrica , and the ": null
    },
    {
        "American sweetgum.": "Liquidambar Styraciflua"
    },
    {
        "          Molecular cloning refers to the process of making multiple molecules. Cloning is commonly used to amplify ": null
    },
    {
        "DNA": "Dna"
    },
    {
        " fragments containing whole ": null
    },
    {
        "genes": "Genes"
    },
    {
        ", but it can also be used to amplify any DNA sequence such as ": null
    },
    {
        "promoters": "Promoter"
    },
    {
        ", non-coding sequences and randomly fragmented DNA. It is used in a wide array of biological experiments and practical applications ranging from ": null
    },
    {
        "genetic fingerprinting": "Genetic Fingerprinting"
    },
    {
        " to large scale protein production. Occasionally, the term cloning is misleadingly used to refer to the identification of the ": null
    },
    {
        "chromosomal": "Chromosome"
    },
    {
        " location of a gene associated with a particular phenotype of interest, such as in ": null
    },
    {
        "positional cloning": "Positional Cloning"
    },
    {
        ". In practice, localization of the gene to a chromosome or genomic region does not necessarily enable one to isolate or amplify the relevant genomic sequence. To amplify any DNA sequence in a living organism, that sequence must be linked to an ": null
    },
    {
        "origin of replication": "Origin Of Replication"
    },
    {
        ", which is a sequence of DNA capable of directing the propagation of itself and any linked sequence. However, a number of other features are needed, and a variety of specialised ": null
    },
    {
        "cloning vectors": "Cloning Vector"
    },
    {
        " exist that allow ": null
    },
    {
        "protein production": "Protein Production"
    },
    {
        ", ": null
    },
    {
        "affinity tag": "Affinity Tag"
    },
    {
        "ging, single stranded ": null
    },
    {
        "RNA": "Rna"
    },
    {
        " or DNA production and a host of other molecular biology tools.     Cloning of any DNA fragment essentially involves four steps    fragmentation - breaking apart a strand of DNA   ": null
    },
    {
        "ligation": "Dna Ligase"
    },
    {
        " - gluing together pieces of DNA in a desired sequence   ": null
    },
    {
        "transfection": "Transfection"
    },
    {
        " – inserting the newly formed pieces of DNA into cells   screening/selection – selecting out the cells that were successfully transfected with the new DNA     Although these steps are invariable among cloning procedures a number of alternative routes can be selected; these are summarized as a cloning strategy.     Initially, the DNA of interest needs to be isolated to provide a DNA segment of suitable size. Subsequently, a ligation procedure is used where the amplified fragment is inserted into a ": null
    },
    {
        "vector": "Vector"
    },
    {
        " . The vector is linearised using ": null
    },
    {
        "restriction enzyme": "Restriction Enzyme"
    },
    {
        "s, and incubated with the fragment of interest under appropriate conditions with an enzyme called ": null
    },
    {
        "DNA ligase": "Dna Ligase"
    },
    {
        ". Following ligation the vector with the insert of interest is transfected into cells. A number of alternative techniques are available, such as chemical sensitivation of cells, ": null
    },
    {
        "electroporation": "Electroporation"
    },
    {
        ", ": null
    },
    {
        "optical injection": "Optical Injection"
    },
    {
        " and ": null
    },
    {
        "biolistics": "Biolistics"
    },
    {
        ". Finally, the transfected cells are cultured. As the aforementioned procedures are of particularly low efficiency, there is a need to identify the cells that have been successfully transfected with the vector construct containing the desired insertion sequence in the required orientation. Modern cloning vectors include selectable ": null
    },
    {
        "antibiotic": "Antibiotic"
    },
    {
        " resistance markers, which allow only cells in which the vector has been transfected, to grow. Additionally, the cloning vectors may contain colour selection markers, which provide blue/white screening on ": null
    },
    {
        "X-gal": "X-Gal"
    },
    {
        " medium. Nevertheless, these selection steps do not absolutely guarantee that the DNA insert is present in the cells obtained. Further investigation of the resulting colonies must be required to confirm that cloning was successful. This may be accomplished by means of ": null
    },
    {
        "PCR": "Pcr"
    },
    {
        ", restriction fragment analysis and/or ": null
    },
    {
        "DNA sequencing": "Dna Sequencing"
    },
    {
        ".              Cloning a cell means to derive a population of cells from a single cell. In the case of unicellular organisms such as bacteria and yeast, this process is remarkably simple and essentially only requires the ": null
    },
    {
        "inoculation": "Inoculation"
    },
    {
        " of the appropriate medium. However, in the case of cell cultures from multi-cellular organisms, cell cloning is an arduous task as these cells will not readily grow in standard media.     A useful tissue culture technique used to clone distinct lineages of cell lines involves the use of cloning rings .  In this technique a single-cell suspension of cells that have been exposed to a ": null
    },
    {
        "mutagenic agent": "Mutagen"
    },
    {
        " or drug used to drive ": null
    },
    {
        "selection": "Selection"
    },
    {
        " is plated at high dilution to create isolated colonies, each arising from a single and potentially clonal distinct cell. At an early growth stage when colonies consist of only a few cells, sterile ": null
    },
    {
        "polystyrene": "Polystyrene"
    },
    {
        " rings , which have been dipped in grease, are placed over an individual colony and a small amount of ": null
    },
    {
        "trypsin": "Trypsin"
    },
    {
        " is added. Cloned cells are collected from inside the ring and transferred to a new vessel for further growth.          ": null
    },
    {
        "Somatic-cell nuclear transfer": "Somatic-Cell Nuclear Transfer"
    },
    {
        ", known as SCNT, can also be used to create embryos for research or therapeutic purposes. The most likely purpose for this is to produce embryos for use in ": null
    },
    {
        "stem cell research": "Stem Cell Research"
    },
    {
        ". This process is also called research cloning or therapeutic cloning . The goal is not to create cloned human beings , but rather to harvest stem cells that can be used to study human development and to potentially treat disease. While a clonal human blastocyst has been created, stem cell lines are yet to be isolated from a clonal source.      Therapeutic cloning is achieved by creating embryonic stem cells in the hopes of treating diseases such as diabetes and Alzheimers. The process begins by removing the nucleus from an egg cell and inserting a nucleus from the adult cell to be cloned.  In the case of someone with Alzheimers disease, the nucleus from a skin cell of that patient is placed into an empty egg. The reprogrammed cell begins to develop into an embryo because the egg reacts with the transferred nucleus. The embryo will become genetically identical to the patient. The embryo will then form a blastocyst which has the potential to form/become any cell in the body.      The reason why SCNT is used for cloning is because somatic cells can be easily acquired and cultured in the lab. This process can either add or delete specific genomes of farm animals. A key point to remember is that cloning is achieved when the oocyte maintains its normal functions and instead of using sperm and egg genomes to replicate, the oocyte is inserted into the donors somatic cell nucleus.  The oocyte will react on the somatic cell nucleus, the same way it would on sperm cells.     The process of cloning a particular farm animal using SCNT is relatively the same for all animals. The first step is to collect the somatic cells from the animal that will be cloned. The somatic cells could be used immediately or stored in the laboratory for later use. The hardest part of SCNT is removing maternal DNA from an oocyte at metaphase II. Once this has been done, the somatic nucleus can be inserted into an egg cytoplasm. This creates a one-cell embryo. The grouped somatic cell and egg cytoplasm are then introduced to an electrical current. This energy will hopefully allow the cloned embryo to begin development. The successfully developed embryos are then placed in surrogate recipients, such as a cow or sheep in the case of farm animals.     SCNT is seen as a good method for producing agriculture animals for food consumption. It successfully cloned sheep, cattle, goats, and pigs. Another benefit is SCNT is seen as a solution to clone endangered species that are on the verge of going extinct. However, stresses placed on both the egg cell and the introduced nucleus can be enormous, which led to a high loss in resulting cells in early research. For example, ": null
    },
    {
        "the cloned sheep Dolly": "Dolly"
    },
    {
        " was born after 277 eggs were used for SCNT, which created 29 viable embryos. Only three of these embryos survived until birth, and only one survived to adulthood.  As the procedure could not be automated, and had to be performed manually under a ": null
    },
    {
        "microscope": "Microscope"
    },
    {
        ", SCNT was very resource intensive. The biochemistry involved in reprogramming the ": null
    },
    {
        "differentiated": "Cellular Differentiation"
    },
    {
        " somatic cell nucleus and activating the recipient egg was also far from being well understood. However, by 2014 researchers were reporting cloning success rates of seven to eight out of ten Shukman, David  BBC News Science and Environment, Retrieved 10 April 2014 and in 2016, a Korean Company Sooam Biotech was reported to be producing 500 cloned embryos per day.      In SCNT, not all of the donor cells genetic information is transferred, as the donor cells ": null
    },
    {
        "mitochondria": "Mitochondria"
    },
    {
        " that contain their own ": null
    },
    {
        "mitochondrial DNA": "Mitochondrial Dna"
    },
    {
        " are left behind. The resulting hybrid cells retain those mitochondrial structures which originally belonged to the egg. As a consequence, clones such as Dolly that are born from SCNT are not perfect copies of the donor of the nucleus.          Organism cloning refers to the procedure of creating a new multicellular organism, genetically identical to another. In essence this form of cloning is an asexual method of reproduction, where fertilization or inter-gamete contact does not take place. Asexual reproduction is a naturally occurring phenomenon in many species, including most plants and some insects. Scientists have made some major achievements with cloning, including the asexual reproduction of sheep and cows. There is a lot of ethical debate over whether or not cloning should be used. However, cloning, or asexual propagation,  has been common practice in the horticultural world for hundreds of years.             The term clone is used in horticulture to refer to descendants of a single plant which were produced by ": null
    },
    {
        "vegetative reproduction": "Vegetative Reproduction"
    },
    {
        " or ": null
    },
    {
        "apomixis": "Apomixis"
    },
    {
        ". Many horticultural plant ": null
    },
    {
        "cultivars": "Cultivar"
    },
    {
        "are clones, having been derived from a single individual, multiplied by some process other than sexual reproduction. Sagers, Larry A.   Utah Stae University, Deseret News Retrieved 21 February 2014 As an example, some European cultivars of ": null
    },
    {
        "grapes": "Grape"
    },
    {
        "represent clones that have been propagated for over two millennia. Other examples are ": null
    },
    {
        "potato": "Potato"
    },
    {
        " and ": null
    },
    {
        "banana": "Banana"
    },
    {
        ".  ": null
    },
    {
        "Grafting": "Grafting"
    },
    {
        " can be regarded as cloning, since all the shoots and branches coming from the graft are genetically a clone of a single individual, but this particular kind of cloning has not come under ": null
    },
    {
        "ethical": "Ethics"
    },
    {
        " scrutiny and is generally treated as an entirely different kind of operation.     Many ": null
    },
    {
        "tree": "Tree"
    },
    {
        "s, ": null
    },
    {
        "shrub": "Shrub"
    },
    {
        "s, ": null
    },
    {
        "vine": "Vine"
    },
    {
        "s, ": null
    },
    {
        "ferns": "Fern"
    },
    {
        "and other ": null
    },
    {
        "herbaceous perennials": "Perennials"
    },
    {
        "form ": null
    },
    {
        "clonal colonies": "Clonal Colony"
    },
    {
        " naturally. Parts of an individual plant may become detached by ": null
    },
    {
        "fragmentation": "Fragmentation"
    },
    {
        " and grow on to become separate clonal individuals. A common example is in the vegetative reproduction of moss and liverwort gametophyte clones by means of ": null
    },
    {
        "gemmae": "Gemma"
    },
    {
        ". Some vascular plants e.g. ": null
    },
    {
        "dandelion": "Dandelion"
    },
    {
        " and certain ": null
    },
    {
        "viviparous": "Viviparity"
    },
    {
        " grasses also form ": null
    },
    {
        "seeds": "Seed"
    },
    {
        "asexually, termed ": null
    },
    {
        "apomixis": "Apomixis"
    },
    {
        ", resulting in clonal populations of genetically identical individuals.       Clonal derivation exists in nature in some animal species and is referred to as ": null
    },
    {
        "parthenogenesis": "Parthenogenesis"
    },
    {
        " . This is an asexual form of reproduction that is only found in females of some insects, crustaceans, nematodes, Castagnone-Sereno P, et al.  Annu Rev Phytopathol. 2013;51:203-20 fish , and lizards including the ": null
    },
    {
        "Komodo dragon": "Komodo Dragon"
    },
    {
        " and several ": null
    },
    {
        "whiptails": "Teiidae"
    },
    {
        ". The growth and development occurs without fertilization by a male. In plants, parthenogenesis means the development of an embryo from an unfertilized egg cell, and is a component process of apomixis. In species that use the ": null
    },
    {
        "XY sex-determination system": "Xy Sex-Determination System"
    },
    {
        ", the offspring will always be female. An example is the little fire ant , which is native to ": null
    },
    {
        "Central": "Central America"
    },
    {
        " and ": null
    },
    {
        "South America": "South America"
    },
    {
        " but has spread throughout many tropical environments.       Artificial cloning of organisms may also be called reproductive cloning.       ": null
    },
    {
        "Hans Spemann": "Hans Spemann"
    },
    {
        ", a ": null
    },
    {
        "German": "Germans"
    },
    {
        " embryologist": "Embryologist"
    },
    {
        " was awarded a ": null
    },
    {
        "Nobel Prize in Physiology or Medicine": "Nobel Prize In Physiology Or Medicine"
    },
    {
        " in 1935 for his discovery of the effect now known as embryonic induction, exercised by various parts of the embryo, that directs the development of groups of cells into particular tissues and organs. In 1928 he and his student, ": null
    },
    {
        "Hilde Mangold": "Hilde Mangold"
    },
    {
        ", were the first to perform ": null
    },
    {
        "somatic-cell nuclear transfer": "Somatic-Cell Nuclear Transfer"
    },
    {
        " using ": null
    },
    {
        "amphibian": "Amphibian"
    },
    {
        " embryos – one of the first steps towards cloning. . See        Reproductive cloning generally uses ": null
    },
    {
        "somatic cell nuclear transfer": "Somatic Cell Nuclear Transfer"
    },
    {
        " to create animals that are genetically identical. This process entails the transfer of a nucleus from a donor adult cell to an egg from which the nucleus has been removed, or to a cell from a ": null
    },
    {
        "blastocyst": "Blastocyst"
    },
    {
        " from which the nucleus has been removed.  If the egg begins to divide normally it is transferred into the uterus of the surrogate mother. Such clones are not strictly identical since the somatic cells may contain mutations in their nuclear DNA. Additionally, the ": null
    },
    {
        "mitochondria": "Mitochondrion"
    },
    {
        " in the ": null
    },
    {
        "cytoplasm": "Cytoplasm"
    },
    {
        " also contains DNA and during SCNT this mitochondrial DNA is wholly from the cytoplasmic donors egg, thus the ": null
    },
    {
        "mitochondrial": "Mitochondrion"
    },
    {
        " genome is not the same as that of the nucleus donor cell from which it was produced. This may have important implications for cross-species nuclear transfer in which nuclear-mitochondrial incompatibilities may lead to death.     Artificial embryo splitting or embryo twinning, a technique that creates monozygotic twins from a single embryo, is not considered in the same fashion as other methods of cloning. During that procedure, a donor ": null
    },
    {
        "embryo": "Embryo"
    },
    {
        " is split in two distinct embryos, that can then be transferred via ": null
    },
    {
        "embryo transfer": "Embryo Transfer"
    },
    {
        ". It is optimally performed at the 6- to 8-cell stage, where it can be used as an expansion of ": null
    },
    {
        "IVF": "Ivf"
    },
    {
        " to increase the number of available embryos.  If both embryos are successful, it gives rise to ": null
    },
    {
        "monozygotic twins": "Monozygotic Twins"
    },
    {
        ".                  ": null
    },
    {
        "Dolly": "Dolly"
    },
    {
        ", a ": null
    },
    {
        "Finn-Dorset": "Finn-Dorset"
    },
    {
        " ewe": "Domestic Sheep"
    },
    {
        ", was the first mammal to have been successfully cloned from an adult somatic cell. Dolly was formed by taking a cell from the udder of her 6-year old biological mother.  Dollys embryo was created by taking the cell and inserting it into a sheep ovum. It took 434 attempts before an embryo was successful.  The embryo was then placed inside a female sheep that went through a normal pregnancy.  She was cloned at the ": null
    },
    {
        "Roslin Institute": "Roslin Institute"
    },
    {
        " in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        " by British scientists Sir ": null
    },
    {
        "Ian Wilmut": "Ian Wilmut"
    },
    {
        " and ": null
    },
    {
        "Keith Campbell": "Keith Campbell"
    },
    {
        " and lived there from her birth in 1996 until her death in 2003 when she was six. She was born on 5 July 1996 but not announced to the world until 22 February 1997.  Her ": null
    },
    {
        "stuffed remains": "Taxidermy"
    },
    {
        " were placed at Edinburghs ": null
    },
    {
        "Royal Museum": "Royal Museum"
    },
    {
        ", part of the ": null
    },
    {
        "National Museums of Scotland": "National Museums Of Scotland"
    },
    {
        ". TV documentary Visions Of The Future part 2 shows this process, explores the social implicatins of cloning and contains footage of monoculture in livestock     Dolly was publicly significant because the effort showed that genetic material from a specific adult cell, designed to express only a distinct subset of its genes, can be redesigned to grow an entirely new organism. Before this demonstration, it had been shown by John Gurdon that nuclei from differentiated cells could give rise to an entire organism after transplantation into an enucleated egg.  However, this concept was not yet demonstrated in a mammalian system.     The first mammalian cloning had a success rate of 29 embryos per 277 fertilized eggs, which produced three lambs at birth, one of which lived. In a bovine experiment involving 70 cloned calves, one-third of the calves died quite young. The first successfully cloned horse, ": null
    },
    {
        "Prometea": "Prometea"
    },
    {
        ", took 814 attempts. Notably, although the first clones were frogs, no adult cloned frog has yet been produced from a somatic adult nucleus donor cell.     There were early claims that ": null
    },
    {
        "Dolly the sheep": "Dolly The Sheep"
    },
    {
        " had pathologies resembling accelerated aging. Scientists speculated that Dollys death in 2003 was related to the shortening of ": null
    },
    {
        "telomere": "Telomere"
    },
    {
        "s, DNA-protein complexes that protect the end of linear ": null
    },
    {
        "chromosome": "Chromosome"
    },
    {
        "s. However, other researchers, including ": null
    },
    {
        "Ian Wilmut": "Ian Wilmut"
    },
    {
        " who led the team that successfully cloned Dolly, argue that Dollys early death due to respiratory infection was unrelated to problems with the cloning process. This idea that the nuclei have not irreversibly aged was shown in 2013 to be true for mice.     Dolly was named after performer ": null
    },
    {
        "Dolly Parton": "Dolly Parton"
    },
    {
        " because the cells cloned to make her were from a ": null
    },
    {
        "mammary gland": "Mammary Gland"
    },
    {
        " cell, and Parton is known for her ample cleavage. BBC. 22 February 2008.           The modern cloning techniques involving ": null
    },
    {
        "nuclear transfer": "Nuclear Transfer"
    },
    {
        " have been successfully performed on several species. Notable experiments include:   ": null
    },
    {
        "Tadpole": "Tadpole"
    },
    {
        "Robert Briggs": "Robert Briggs"
    },
    {
        " and ": null
    },
    {
        "Thomas J. King": "Thomas Joseph King"
    },
    {
        " had ": null
    },
    {
        "successfully cloned northern leopard frogs": "List Of Animals That Have Been Clonedfrog"
    },
    {
        "    Carp": "Carp"
    },
    {
        "China": "China"
    },
    {
        ", ": null
    },
    {
        "embryologist": "Embryologist"
    },
    {
        " Tong Dizhou": "Tong Dizhou"
    },
    {
        " produced the worlds ": null
    },
    {
        "first cloned fish": "List Of Animals That Have Been Clonedcarp"
    },
    {
        " by inserting the DNA from a cell of a male carp into an egg from a female carp. He published the findings in a Chinese science journal.    ": null
    },
    {
        "Mice": "Mice"
    },
    {
        "Soviet": "Soviet Union"
    },
    {
        " scientists Chaylakhyan, Veprencev, Sviridova, and Nikitin had the mouse Masha cloned. Research was published in the magazine Biofizika volume ХХХII, issue 5 of 1987.     ": null
    },
    {
        "Sheep": "Domestic Sheep"
    },
    {
        "Steen Willadsen": "Steen Willadsen"
    },
    {
        ". ": null
    },
    {
        "Megan and Morag": "Megan And Morag"
    },
    {
        "  cloned from differentiated embryonic cells in June 1995 and ": null
    },
    {
        "Dolly the sheep": "Dolly The Sheep"
    },
    {
        " from a somatic cell in 1996.    ": null
    },
    {
        "Rhesus monkey": "Rhesus Monkey"
    },
    {
        "Tetra": "Tetra"
    },
    {
        " from embryo splitting and not nuclear transfer. More akin to artificial formation of twins. ": null
    },
    {
        "CNN": "Cnn"
    },
    {
        ".  2000-01-13. Retrieved 2008-08-05.    ": null
    },
    {
        "Pig": "Pig"
    },
    {
        " By 2014, ": null
    },
    {
        "BGI": "Beijing Genomics Institute"
    },
    {
        " in China was producing 500 cloned pigs a year to test new medicines. Shukman, David  BBC News Science and Environment, Retrieved 14 January 2014   ": null
    },
    {
        "Gaur": "Gaur"
    },
    {
        "   Cattle": "Cattle"
    },
    {
        "Alpha and Beta": "List Of Animals That Have Been Clonedcattle"
    },
    {
        " and Brazil Camacho, Keite.  . ": null
    },
    {
        "Agência Brasil": "Agência Brasil"
    },
    {
        ". 2005-05-20. Retrieved 2008-08-05    ": null
    },
    {
        "Cat": "Cat"
    },
    {
        "CopyCat": "Cc"
    },
    {
        " CC , ": null
    },
    {
        "Little Nicky": "Little Nicky"
    },
    {
        ", 2004, was the first cat cloned for commercial reasons    ": null
    },
    {
        "Rat": "Rat"
    },
    {
        "Ralph": "Ralph"
    },
    {
        ", the first cloned rat    ": null
    },
    {
        "Mule": "Mule"
    },
    {
        "Idaho Gem": "Idaho Gem"
    },
    {
        ", a john mule born 4 May 2003, was the first horse-family clone.    ": null
    },
    {
        "Horse": "Horse"
    },
    {
        "Prometea": "Prometea"
    },
    {
        ", a Haflinger female born 28 May 2003, was the first horse clone.    ": null
    },
    {
        "Dog": "Dog"
    },
    {
        "Snuppy": "Snuppy"
    },
    {
        ", a male ": null
    },
    {
        "Afghan hound": "Afghan Hound"
    },
    {
        " was the first cloned dog .    ": null
    },
    {
        "Wolf": "Wolf"
    },
    {
        "Snuwolf and Snuwolffy": "List Of Animals That Have Been Clonedwolf"
    },
    {
        ", the first two cloned female wolves .  Phys.Org, Retrieved 9 April 2015   ": null
    },
    {
        "Water buffalo": "Water Buffalo"
    },
    {
        "Samrupa": "Samrupa"
    },
    {
        " was the first cloned water buffalo. It was born on 6 February 2009, at ": null
    },
    {
        "Indias": "India"
    },
    {
        "Karnal National Diary Research Institute but died five days later due to lung infection.    ": null
    },
    {
        "Pyrenean ibex": "Pyrenean Ibex"
    },
    {
        " was the first extinct animal to be cloned back to life; the clone lived for seven minutes before dying of lung defects. Note: The Pyrenean ibex is an extinct sub-species; the broader species, the ": null
    },
    {
        "Spanish ibex": "Spanish Ibex"
    },
    {
        ", is thriving. Peter Maas.   at The Sixth Extinction. Last updated 15 April 2012. , The Daily Telegraph, 31 January 2009   ": null
    },
    {
        "Camel": "Camel"
    },
    {
        "Injaz": "Injaz"
    },
    {
        ", is the first cloned camel.    ": null
    },
    {
        "Pashmina goat": "Pashmina Goat"
    },
    {
        "Noori": "List Of Animals That Have Been Clonedgoat"
    },
    {
        ", is the first cloned pashmina goat. Scientists at the faculty of veterinary sciences and animal husbandry of ": null
    },
    {
        "Sher-e-Kashmir University of Agricultural Sciences and Technology of Kashmir": "Sher-E-Kashmir University Of Agricultural Sciences And Technology Of Kashmir"
    },
    {
        " successfully cloned the first Pashmina goat using the advanced reproductive techniques under the leadership of Riaz Ahmad Shah.    ": null
    },
    {
        "Goat": "Goat"
    },
    {
        "Northwest A & F University": "Northwest A & F University"
    },
    {
        " successfully cloned the first goat which use the adult female cell.    ": null
    },
    {
        "Gastric brooding frog": "Gastric Brooding Frog"
    },
    {
        "Rheobatrachus silus, thought to have been extinct since 1983 was cloned in Australia, although the embryos died after a few days.    ": null
    },
    {
        "Macaque": "Macaque"
    },
    {
        " monkey: First successful cloning of a ": null
    },
    {
        "primate species": "Primate"
    },
    {
        " using ": null
    },
    {
        "nuclear transfer": "Nuclear Transfer"
    },
    {
        ", with the birth of two live clones, named ": null
    },
    {
        "Zhong Zhong and Hua Hua": "Zhong Zhong And Hua Hua"
    },
    {
        ". Conducted in China in 2017, and reported in January 2018.     In January 2019, scientists in China reported the creation of five identical ": null
    },
    {
        "cloned": "Clone"
    },
    {
        " gene-edited": "Genome Editing"
    },
    {
        " monkeys, using the same cloning technique that was used with ": null
    },
    {
        "Zhong Zhong and Hua Hua": "Zhong Zhong And Hua Hua"
    },
    {
        " – the first ever cloned monkeys - and ": null
    },
    {
        "Dolly the sheep": "Dolly"
    },
    {
        ", and the same gene-editing ": null
    },
    {
        "Crispr": "Crispr"
    },
    {
        "-": null
    },
    {
        "Cas9": "Cas9"
    },
    {
        " technique allegedly used by ": null
    },
    {
        "He Jiankui": "He Jiankui"
    },
    {
        " in creating the first ever gene-modified human babies ": null
    },
    {
        "Lulu and Nana": "Lulu And Nana"
    },
    {
        ". The monkey clones were made in order to study several medical diseases.            Human cloning is the creation of a genetically identical copy of a human. The term is generally used to refer to artificial human cloning, which is the reproduction of human cells and tissues. It does not refer to the natural conception and delivery of ": null
    },
    {
        "identical": "Monozygotic"
    },
    {
        " twins": "Multiple Birth"
    },
    {
        ". The possibility of human cloning has raised ": null
    },
    {
        "controversies": "Ethics Of Cloning"
    },
    {
        ". These ethical concerns have prompted several nations to pass ": null
    },
    {
        "legislation": "Legislation"
    },
    {
        " regarding human cloning and its legality. As of right now, scientists have no intention of trying to clone people and they believe their results should spark a wider discussion about the laws and regulations the world needs to regulate cloning.      Two commonly discussed types of theoretical human cloning are therapeutic cloning and reproductive cloning. Therapeutic cloning would involve cloning cells from a human for use in medicine and transplants, and is an active area of research, but is not in medical practice anywhere in the world, . Two common methods of therapeutic cloning that are being researched are ": null
    },
    {
        "somatic-cell nuclear transfer": "Somatic-Cell Nuclear Transfer"
    },
    {
        " and, more recently, ": null
    },
    {
        "pluripotent stem cell induction": "Induced Pluripotent Stem Cell"
    },
    {
        ". Reproductive cloning would involve making an entire cloned human, instead of just specific cells or tissues.             There are a variety of ": null
    },
    {
        "ethical": "Bioethics"
    },
    {
        " positions regarding the possibilities of cloning, especially ": null
    },
    {
        "human cloning": "Human Cloning"
    },
    {
        ". While many of these views are ": null
    },
    {
        "religious": "Religious"
    },
    {
        " in origin, the questions raised by cloning are faced by ": null
    },
    {
        "secular": "Secular"
    },
    {
        " perspectives as well. Perspectives on human cloning are theoretical, as human therapeutic and reproductive cloning are not commercially used; animals are currently cloned in laboratories and in livestock production.     Advocates support development of therapeutic cloning in order to generate tissues and whole organs to treat patients who otherwise cannot obtain transplants,  to avoid the need for ": null
    },
    {
        "immunosuppressive drugs": "Immunosuppressive Drugs"
    },
    {
        ", and to stave off the effects of aging. de Grey, Aubrey; Rae, Michael . Ending Aging: The Rejuvenation Breakthroughs that Could Reverse Human Aging in Our Lifetime. New York, NY: St. Martins Press, 416 pp. . Advocates for reproductive cloning believe that parents who cannot otherwise procreate should have access to the technology. Staff, Times Higher Education. 10 August 2001      Opponents of cloning have concerns that technology is not yet developed enough to be safe  and that it could be prone to abuse ,   as well as concerns about how cloned individuals could integrate with families and with society at large. McGee, Glenn . The Perfect Baby: Parenthood in the New World of Cloning and Genetics. Lanham: Rowman & Littlefield.      Religious groups are divided, with some opposing the technology as usurping Gods place and, to the extent embryos are used, destroying a human life; others support therapeutic clonings potential life-saving benefits. Bob Sullivan, Technology correspondent for NBC News. November 262003  William Sims Bainbridge, Ph.D.    Journal of Evolution and Technology – Vol. 13 – October 2003     Cloning of animals is opposed by animal-groups due to the number of cloned animals that suffer from malformations before they die, and while food from cloned animals has been approved by the US FDA,   its use is opposed by groups concerned about food safety.          Cloning, or more precisely, the reconstruction of functional DNA from ": null
    },
    {
        "extinct": "Extinct"
    },
    {
        " species has, for decades, been a dream. Possible implications of this were dramatized in the 1984 novel  Carnosaur  and the 1990 novel  Jurassic Park .  The best current cloning techniques have an average success rate of 9.4 percent  when working with familiar species such as mice, while cloning wild animals is usually less than 1 percent successful. Ferris Jabr for Scientific American. 11 March 2013.  Several tissue banks have come into existence, including the ": null
    },
    {
        "Frozen Zoo": "Frozen Zoo"
    },
    {
        " at the ": null
    },
    {
        "San Diego Zoo": "San Diego Zoo"
    },
    {
        ", to store frozen tissue from the worlds rarest and most endangered species. Holt, W. V., Pickard, A. R., & Prather, R. S. . Reproduction, 126.       In 2001, a cow named Bessie gave birth to a cloned Asian ": null
    },
    {
        "gaur": "Gaur"
    },
    {
        ", an endangered species, but the calf died after two days. In 2003, a ": null
    },
    {
        "banteng": "Banteng"
    },
    {
        " was successfully cloned, followed by three African wildcats from a thawed frozen embryo. These successes provided hope that similar techniques might be used to clone extinct species. Anticipating this possibility, tissue samples from the last bucardo  were frozen in ": null
    },
    {
        "liquid nitrogen": "Liquid Nitrogen"
    },
    {
        " immediately after it died in 2000. Researchers are also considering cloning endangered species such as the giant panda and cheetah.     In 2002, geneticists at the ": null
    },
    {
        "Australian Museum": "Australian Museum"
    },
    {
        " announced that they had replicated DNA of the ": null
    },
    {
        "thylacine": "Thylacine"
    },
    {
        " , at the time extinct for about 65 years, using ": null
    },
    {
        "polymerase chain reaction": "Polymerase Chain Reaction"
    },
    {
        ".  However, on 15 February 2005 the museum announced that it was stopping the project after tests showed the specimens DNA had been too badly degraded by the  preservative. On 15 May 2005 it was announced that the thylacine project would be revived, with new participation from researchers in ": null
    },
    {
        "New South Wales": "New South Wales"
    },
    {
        " and ": null
    },
    {
        "Victoria": "Victoria"
    },
    {
        ".      In 2003, for the first time, an extinct animal, the Pyrenean ibex mentioned above was cloned, at the Centre of Food Technology and Research of Aragon, using the preserved frozen cell nucleus of the skin samples from 2001 and domestic goat egg-cells. The ibex died shortly after birth due to physical defects in its lungs.      One of the most anticipated targets for cloning was once the ": null
    },
    {
        "woolly mammoth": "Woolly Mammoth"
    },
    {
        ", but attempts to extract DNA from frozen mammoths have been unsuccessful, though a joint Russo-Japanese team is currently working toward this goal. In January 2011, it was reported by Yomiuri Shimbun that a team of scientists headed by Akira Iritani of Kyoto University had built upon research by Dr. Wakayama, saying that they will extract DNA from a mammoth carcass that had been preserved in a Russian laboratory and insert it into the egg cells of an African elephant in hopes of producing a mammoth embryo. The researchers said they hoped to produce a baby mammoth within six years.   It was noted, however that the result, if possible, would be an elephant-mammoth hybrid rather than a true mammoth.  , 5 February 2015 Another problem is the survival of the reconstructed mammoth: ": null
    },
    {
        "ruminants": "Ruminant"
    },
    {
        "rely on a ": null
    },
    {
        "symbiosis": "Symbiosis"
    },
    {
        " with specific ": null
    },
    {
        "microbiota": "Microbiota"
    },
    {
        " in their stomachs for digestion.     Scientists at the ": null
    },
    {
        "University of Newcastle": "University Of Newcastle"
    },
    {
        " and ": null
    },
    {
        "University of New South Wales": "University Of New South Wales"
    },
    {
        " announced in March 2013 that the very recently extinct ": null
    },
    {
        "gastric-brooding frog": "Gastric-Brooding Frog"
    },
    {
        " would be the subject of a cloning attempt to resurrect the species.      Many such De-extinction projects are described in the ": null
    },
    {
        "Long Now Foundations": "Long Now Foundation"
    },
    {
        "Revive and Restore Project.        After an eight-year project involving the use of a pioneering cloning technique, Japanese researchers created 25 generations of healthy cloned mice with normal lifespans, demonstrating that clones are not intrinsically shorter-lived than naturally born animals.   Other sources have noted that the offspring of clones tend to be healthier than the original clones and indistinguishable from animals produced naturally.      Dolly the sheep was cloned from a six year old cell sample from a mammary gland. Because of this, some posited she may have aged more quickly than other naturally born animals, as she died relatively early for a sheep at the age of six. Ultimately, her death was attributed to a respiratory illness, and the advanced aging theory is disputed.      A detailed study released in 2016 and less detailed studies by others suggest that once cloned animals get past the first month or two of life they are generally healthy. However, early pregnancy loss and neonatal losses are still greater with cloning than natural conception or assisted reproduction . Current research is attempting to overcome these problems.                Discussion of cloning in the popular media often presents the subject negatively. In an article in the 8 November 1993 article of  Time , cloning was portrayed in a negative way, modifying Michelangelos  Creation of Adam  to depict Adam with five identical hands.   Newsweek  10 March 1997 issue also critiqued the ethics of human cloning, and included a graphic depicting identical babies in beakers.      The concept of cloning, particularly human cloning, has featured a wide variety of ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        " works. An early fictional depiction of cloning is ": null
    },
    {
        "Bokanovskys Process": "Bokanovskys Process"
    },
    {
        " which features in ": null
    },
    {
        "Aldous Huxleys": "Aldous Huxley"
    },
    {
        "1931 dystopian novel  Brave New World . The process is applied to fertilized human ": null
    },
    {
        "eggs": "Egg"
    },
    {
        "  in vitro , causing them to split into identical genetic copies of the original. Huxley, Aldous; Brave New World and Brave New World Revisited ; p. 19; HarperPerennial, 2005.  Following renewed interest in cloning in the 1950s, the subject was explored further in works such as ": null
    },
    {
        "Poul Andersons": "Poul Anderson"
    },
    {
        "1953 story UN-Man, which describes a technology called exogenesis , and ": null
    },
    {
        "Gordon Rattray Taylors": "Gordon Rattray Taylor"
    },
    {
        "book  The Biological Time Bomb , which popularised the term cloning in 1963.      Cloning is a recurring theme in a number of contemporary science fiction films, ranging from action films such as  Jurassic Park  ,  Alien Resurrection  ,  The 6th Day  ,  Resident Evil  ,  Star Wars: Episode II  and  The Island  , to comedies such as ": null
    },
    {
        "Woody Allens": "Woody Allen"
    },
    {
        "1973 film  Sleeper .      The process of cloning is represented variously in fiction. Many works depict the artificial creation of humans by a method of growing cells from a tissue or DNA sample; the replication may be instantaneous, or take place through slow growth of human embryos in ": null
    },
    {
        "artificial womb": "Artificial Womb"
    },
    {
        "s. In the long-running British television series  Doctor Who , the ": null
    },
    {
        "Fourth Doctor": "Fourth Doctor"
    },
    {
        " and his companion ": null
    },
    {
        "Leela": "Leela"
    },
    {
        " were cloned in a matter of seconds from DNA samples  and then — in an apparent ": null
    },
    {
        "homage": "Homage"
    },
    {
        " to the 1966 film  Fantastic Voyage  — shrunk to microscopic size in order to enter the Doctors body to combat an alien virus. The clones in this story are short-lived, and can only survive a matter of minutes before they expire.  Science fiction films such as  The Matrix  and Star Wars: Episode II – Attack of the Clones have featured scenes of human ": null
    },
    {
        "foetus": "Foetus"
    },
    {
        "es being cultured on an industrial scale in mechanical tanks.      Cloning humans from body parts is also a common theme in science fiction. Cloning features strongly among the science fiction conventions parodied in Woody Allens Sleeper, the plot of which centres around an attempt to clone an assassinated dictator from his disembodied nose.  In the 2008 Doctor Who story ": null
    },
    {
        "Journeys End": "Journeys End"
    },
    {
        " , a duplicate version of the ": null
    },
    {
        "Tenth Doctor": "Tenth Doctor"
    },
    {
        " spontaneously grows from his severed hand, which had been cut off in a sword fight during an earlier episode.      After the death of her beloved 14-year old Coton de Tulear named Samantha in late 2017, ": null
    },
    {
        "Barbra Streisand": "Barbra Streisand"
    },
    {
        " announced that she had cloned the dog, and was now waiting for to get older so can see if they have brown eyes and her seriousness .  The operation cost $50,000 through the pet cloning company ViaGen.       Science fiction has used cloning, most commonly and specifically ": null
    },
    {
        "human cloning": "Human Cloning"
    },
    {
        ", to raise the controversial questions of identity.    A Number  is a 2002 play by ": null
    },
    {
        "English": "English People"
    },
    {
        " playwright": "Playwright"
    },
    {
        " Caryl Churchill": "Caryl Churchill"
    },
    {
        " which addresses the subject of human cloning and identity, especially ": null
    },
    {
        "nature and nurture": "Nature And Nurture"
    },
    {
        ". The story, set in the near future, is structured around the conflict between a father and his sons – two of whom are clones of the first one. A Number was adapted by Caryl Churchill for television, in a co-production between the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " and ": null
    },
    {
        "HBO Films": "Hbo Films"
    },
    {
        ".      In 2012, a Japanese television series named Bunshin was created. The storys main character, Mariko, is a woman studying child welfare in Hokkaido. She grew up always doubtful about the love from her mother, who looked nothing like her and who died nine years before. One day, she finds some of her mothers belongings at a relatives house, and heads to Tokyo to seek out the truth behind her birth. She later discovered that she was a clone.      In the 2013 television series  Orphan Black , cloning is used as a scientific study on the behavioral adaptation of the clones.  In a similar vein, the book  The Double  by Nobel Prize winner ": null
    },
    {
        "José Saramago": "José Saramago"
    },
    {
        " explores the emotional experience of a man who discovers that he is a clone.        Cloning has been used in fiction as a way of recreating historical figures. In the 1976 ": null
    },
    {
        "Ira Levin": "Ira Levin"
    },
    {
        " novel  The Boys from Brazil  and its ": null
    },
    {
        "1978 film adaptation": "The Boys From Brazil"
    },
    {
        ", ": null
    },
    {
        "Josef Mengele": "Josef Mengele"
    },
    {
        " uses cloning to create copies of ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        ".      In ": null
    },
    {
        "Michael Crichtons": "Michael Crichton"
    },
    {
        "1990 novel  Jurassic Park , which spawned a ": null
    },
    {
        "series of Jurassic Park feature films": "Jurassic Park"
    },
    {
        ", a bioengineering company develops a technique to resurrect extinct species of ": null
    },
    {
        "dinosaurs": "Dinosaur"
    },
    {
        "by creating cloned creatures using DNA extracted from ": null
    },
    {
        "fossil": "Fossil"
    },
    {
        "s. The cloned dinosaurs are used to populate the Jurassic Park ": null
    },
    {
        "wildlife park": "Animal Theme Park"
    },
    {
        " for the entertainment of visitors. The scheme goes disastrously wrong when the dinosaurs escape their enclosures. Despite being selectively cloned as females to prevent them from breeding, the dinosaurs develop the ability to reproduce through ": null
    },
    {
        "parthenogenesis": "Parthenogenesis"
    },
    {
        ".        The use of cloning for military purposes has also been explored in several fictional works. In Doctor Who, an alien race of armour-clad, warlike beings called ": null
    },
    {
        "Sontarans": "Sontaran"
    },
    {
        "was introduced in the 1973 serial ": null
    },
    {
        "The Time Warrior": "The Time Warrior"
    },
    {
        " . Sontarans are depicted as squat, bald creatures who have been genetically engineered for combat. Their weak spot is a probic vent , a small socket at the back of their neck which is associated with the cloning process.  The concept of cloned soldiers being bred for combat was revisited in ": null
    },
    {
        "The Doctors Daughter": "The Doctors Daughter"
    },
    {
        " , when the Doctors DNA is used to create a female warrior called ": null
    },
    {
        "Jenny": "Jenny"
    },
    {
        ".      The 1977 film  Star Wars  was set against the backdrop of a historical conflict called the ": null
    },
    {
        "Clone Wars": "Clone Wars"
    },
    {
        ". The events of this war were not fully explored until the prequel films  Attack of the Clones  and  Revenge of the Sith  , which depict a ": null
    },
    {
        "space war": "Space Warfare In Fiction"
    },
    {
        " waged by a massive army of heavily armoured ": null
    },
    {
        "clone troopers": "Clone Trooper"
    },
    {
        "that leads to the foundation of the ": null
    },
    {
        "Galactic Empire": "Galactic Empire"
    },
    {
        ". Cloned soldiers are manufactured on an industrial scale, genetically conditioned for obedience and combat effectiveness. It is also revealed that the popular character ": null
    },
    {
        "Boba Fett": "Boba Fett"
    },
    {
        " originated as a clone of ": null
    },
    {
        "Jango Fett": "Jango Fett"
    },
    {
        ", a mercenary who served as the genetic template for the clone troopers.         A recurring sub-theme of cloning fiction is the use of clones as a supply of ": null
    },
    {
        "organs": "Organ"
    },
    {
        " for ": null
    },
    {
        "transplantation": "Organ Transplant"
    },
    {
        ". The 2005 ": null
    },
    {
        "Kazuo Ishiguro": "Kazuo Ishiguro"
    },
    {
        " novel  Never Let Me Go  and the ": null
    },
    {
        "2010 film adaption": "Never Let Me Go"
    },
    {
        "  are set in an ": null
    },
    {
        "alternate history": "Alternate History"
    },
    {
        " in which cloned humans are created for the sole purpose of providing organ donations to naturally born humans, despite the fact that they are fully sentient and self-aware. The 2005 film  The Island   revolves around a similar plot, with the exception that the clones are unaware of the reason for their existence.     The exploitation of human clones for dangerous and undesirable work was examined in the 2009 British science fiction film  Moon .  In the futuristic novel  Cloud Atlas  and subsequent ": null
    },
    {
        "film": "Cloud Atlas"
    },
    {
        ", one of the story lines focuses on a genetically-engineered fabricant clone named Sonmi~451, one of millions raised in an artificial wombtank, destined to serve from birth. She is one of thousands created for manual and ": null
    },
    {
        "emotional labor": "Emotional Labor"
    },
    {
        "; Sonmi herself works as a server in a restaurant. She later discovers that the sole source of food for clones, called Soap, is manufactured from the clones themselves.      In the film ": null
    },
    {
        "Us": "Us"
    },
    {
        ", at some point prior to the 1980s, the US Government creates clones of every citizen of the United States with the intention of using them to control their original counterparts, akin to ": null
    },
    {
        "voodoo doll": "Voodoo Doll"
    },
    {
        "s. This fails, as they were able to copy bodies, but unable to copy the souls of those they cloned. The project is abandoned and the clones are trapped exactly mirroring their above-ground counterparts actions for generations. In the present day, the clones launch a surprise attack and manage to complete a mass-genocide of their unaware counterparts.  ": null
    }
]