[
    {
        "         A coin is a small, flat, round piece of ": null
    },
    {
        "metal": "Metal"
    },
    {
        " or ": null
    },
    {
        "plastic": "Plastic"
    },
    {
        " used primarily as a medium of exchange or ": null
    },
    {
        "legal tender": "Legal Tender"
    },
    {
        ". They are standardized in weight, and produced in large quantities at a ": null
    },
    {
        "mint": "Mint"
    },
    {
        " in order to facilitate trade. They are most often issued by a ": null
    },
    {
        "government": "Government"
    },
    {
        ". Coins often have images, numerals, or text on them.     Coins are usually metal or an ": null
    },
    {
        "alloy": "Alloy"
    },
    {
        ", or sometimes made of manmade materials. They are usually ": null
    },
    {
        "disc": "Disk"
    },
    {
        " shaped. Coins made of valuable metal are stored in large quantities as ": null
    },
    {
        "bullion coin": "Bullion Coin"
    },
    {
        "s. Other coins are used as ": null
    },
    {
        "money": "Money"
    },
    {
        " in everyday transactions, circulating alongside ": null
    },
    {
        "banknote": "Banknote"
    },
    {
        "s. Usually the highest value coin in circulation is worth less than the lowest-value note. In the last hundred years, the face value of circulation coins has occasionally been lower than the value of the metal they contain, for example due to ": null
    },
    {
        "inflation": "Inflation"
    },
    {
        ". If the difference becomes significant, the issuing authority may decide to withdraw these coins from circulation, possibly issuing new equivalents with a different composition, or the public may decide to melt the coins down or ": null
    },
    {
        "hoard": "Hoard"
    },
    {
        " them .     Exceptions to the rule of face value being higher than content value also occur for some bullion coins made of copper, ": null
    },
    {
        "silver": "Silver"
    },
    {
        ", or ": null
    },
    {
        "gold": "Gold"
    },
    {
        " , intended for collectors or investors in precious metals. Examples of modern gold collector/investor coins include the ": null
    },
    {
        "British sovereign": "Sovereign"
    },
    {
        " minted by the United Kingdom, the ": null
    },
    {
        "American Gold Eagle": "American Gold Eagle"
    },
    {
        " minted by the United States, the ": null
    },
    {
        "Canadian Gold Maple Leaf": "Canadian Gold Maple Leaf"
    },
    {
        " minted by Canada, and the ": null
    },
    {
        "Krugerrand": "Krugerrand"
    },
    {
        ", minted by South Africa. While the Eagle, Maple Leaf, and Sovereign coins have nominal face values, the Krugerrand does not.     Historically, a great quantity of ": null
    },
    {
        "coinage metals": "Coinage Metals"
    },
    {
        " and other materials  have been used to produce coins for circulation, collection, and metal investment: bullion coins often serve as more convenient stores of assured metal quantity and purity than other bullion.             Metal ingots, silver bullion or unmarked bars were probably in use for exchange among many of the civilizations that mastered metallurgy. The weight and purity of bullion would be the key determinant of value. In the ": null
    },
    {
        "Achaemenid Empire": "Achaemenid Empire"
    },
    {
        " in the early 6th century BC, coinage was yet unknown, and ": null
    },
    {
        "barter": "Barter"
    },
    {
        " and to some extent silver ": null
    },
    {
        "bullion": "Bullion"
    },
    {
        " was used instead for trade.  The practice of using silver bars for currency also seems to have been current in ": null
    },
    {
        "Central Asia": "Central Asia"
    },
    {
        " from the 6th century BC. Discovery of a hoard of currency with silver bars near ": null
    },
    {
        "Malayer": "Malayer"
    },
    {
        ", dated circa 600 BCE, with photographs in      Coins were an evolution of currency systems of the ": null
    },
    {
        "Late Bronze Age": "Late Bronze Age"
    },
    {
        ", where standard-sized ": null
    },
    {
        "ingot": "Ingot"
    },
    {
        "s, and tokens such as ": null
    },
    {
        "knife money": "Knife Money"
    },
    {
        ", were used to store and transfer value. In the late ": null
    },
    {
        "Chinese Bronze Age": "Chinese Bronze Age"
    },
    {
        ", standardized cast tokens were made, such as those discovered in a tomb near ": null
    },
    {
        "Anyang": "Anyang"
    },
    {
        ".   These were replicas in bronze of earlier Chinese currency, ": null
    },
    {
        "cowrie": "Cowrie"
    },
    {
        " shells, so they were named ": null
    },
    {
        "Bronze Shell": "Tong Bei"
    },
    {
        ".              The earliest coins are mostly associated with ": null
    },
    {
        "Iron Age Anatolia": "Iron Age Anatolia"
    },
    {
        " of the late 7th century BC, and especially with the kingdom of ": null
    },
    {
        "Lydia": "Lydia"
    },
    {
        ". M. Kroll, review of G. Le Riders La naissance de la monnaie, Schweizerische Numismatische Rundschau 80 , p. 526. D. Sear, Greek Coins and Their Values Vol. 2, Seaby, London, 1979, p. 317. Early ": null
    },
    {
        "electrum": "Electrum"
    },
    {
        " coins were not standardized in weight, and in their earliest stage may have been ritual objects, such as badges or medals, issued by priests. The Types of Greek Coins An Archaeological Essay by Percy Gardner 1883 p.42  Considering these and other facts it may be held to be probable, if not absolutely proved, that priests first issued stamped coin, and that the first mints were in Greek temples.    The unpredictability of the composition of naturally occurring electrum implied that it had a variable value, which greatly hampered its development.      Most of the early Lydian coins include no writing , only an image of a symbolic animal. Therefore, the dating of these coins relies primarily on archaeological evidence, with the most commonly cited evidence coming from excavations at the ": null
    },
    {
        "Temple of Artemis at Ephesus": "Temple Of Artemis At Ephesus"
    },
    {
        ", also called the Ephesian Artemision , site of the earliest known deposit of electrum coins. Because the oldest lion head coins were discovered in that temple, and they do not appear to have been used in commerce , these objects may not have been coins but badges or medals issued by the priests of that temple. Anatolian Artemis was the ": null
    },
    {
        "Πὀτνια Θηρῶν": "Potnia Theron"
    },
    {
        " , whose symbol was the ": null
    },
    {
        "stag": "Stag"
    },
    {
        ". It took some time before ancient coins were used for commerce and trade. Even the smallest-denomination electrum coins, perhaps worth about a days subsistence, would have been too valuable for buying a loaf of bread. Hoards, Small Change, and the Origin of Coinage, Journal of the Hellenistic Studies 84 , p. 89 Maybe the first coins to be used for retailing on a large-scale basis were likely small silver fractions, Hemiobol, ": null
    },
    {
        "Ancient Greek coinage": "Ancient Greek Coinage"
    },
    {
        " minted by the ": null
    },
    {
        "Ionian Greeks": "Ionians"
    },
    {
        " in the late sixth century BC. M. Mitchiner, Ancient Trade and Early Coinage, Hawkins Publications, London, 2004, p. 214   In contrast ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        " mentioned the innovation made by the Lydians:          Many early Lydian and Greek coins were minted under the authority of private individuals and are thus more akin to tokens or badges than to modern coins, G. Hanfmann, pp. 73, 77. R. Seaford, p. 128, points out, The nearly total lack of … coins in the excavated commercial-industrial areas of Sardis suggests that they were concentrated in the hands of the king and possibly wealthy merchants. though due to their numbers it is evident that some were official state issues. The earliest inscribed coins are those of ": null
    },
    {
        "Phanes": "Phanes"
    },
    {
        ", dated to 625–600 BC from ": null
    },
    {
        "Ephesus": "Ephesus"
    },
    {
        " in ": null
    },
    {
        "Ionia": "Ionia"
    },
    {
        ", with the legend ΦΑΝΕΟΣ ΕΜΙ ΣΗΜΑ , or just bearing the name ΦΑΝΕΟΣ .     The first electrum coins issued by a monarch are those minted by king ": null
    },
    {
        "Alyattes of Lydia": "Alyattes Of Lydia"
    },
    {
        " , for which reason this king is sometimes mentioned as the originator of coinage. A. Ramage, Golden Sardis , King Croesus Gold: Excavations at Sardis and the History of Gold Refining, edited by A. Ramage and P. Craddock, Harvard University Press, Cambridge, 2000, p. 18.          The successor of Alyattes, king ": null
    },
    {
        "Croesus": "Croesus"
    },
    {
        " , became associated with great wealth in Greek historiography. He is credited with issuing the  Croeseid , the first true ": null
    },
    {
        "gold coins": "Gold Coin"
    },
    {
        "with a standardized purity for general circulation.  and the worlds first ": null
    },
    {
        "bimetallic monetary system": "Bimetallism"
    },
    {
        " circa 550 BCE.      ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        " mentioned the innovation made by the Lydians:          Coins spread rapidly in the 6th and 5th centuries BC, leading to the development of ": null
    },
    {
        "Ancient Greek coinage": "Ancient Greek Coinage"
    },
    {
        " and ": null
    },
    {
        "Achaemenid coinage": "Achaemenid Coinage"
    },
    {
        ", and further to ": null
    },
    {
        "Illyrian coinage": "Illyrian Coinage"
    },
    {
        ".      Standardized ": null
    },
    {
        "Roman currency": "Roman Currency"
    },
    {
        " was used throughout the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        ". Important Roman ": null
    },
    {
        "gold": "Gold Coin"
    },
    {
        " and ": null
    },
    {
        "silver": "Silver Coin"
    },
    {
        " coins were continued into the Middle Ages . Ancient and early medieval coins in theory had the value of their metal content, although there have been many instances throughout history of governments inflating their currencies by debasing the metal content of their coinage, so that the inferior coins were worth less in metal than their face value. ": null
    },
    {
        "Fiat money": "Fiat Money"
    },
    {
        " first arose in medieval China, with the ": null
    },
    {
        "jiaozi": "Jiaozi"
    },
    {
        " paper money. Early paper money was introduced in Europe in the later Middle Ages, but some coins continued to have the value of the gold or silver they contained throughout the ": null
    },
    {
        "Early Modern period": "Early Modern Period"
    },
    {
        ". The ": null
    },
    {
        "penny": "Penny"
    },
    {
        " was ": null
    },
    {
        "minted": "Mint"
    },
    {
        " as a silver coin until the 17th century.             When ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        " came to power, coinage was unfamiliar in his realm. Barter and to some extent silver ": null
    },
    {
        "bullion": "Bullion"
    },
    {
        " was used instead for trade. The practice of using silver bars for currency also seems to have been current in ": null
    },
    {
        "Central Asia": "Central Asia"
    },
    {
        " from the 6th century. Discovery of a hoard of currency with silver bars near ": null
    },
    {
        "Malayer": "Malayer"
    },
    {
        ", dated circa 600 BCE, with photographs in      Cyrus the Great introduced coins to the Persian Empire after 546 BC, following his conquest of ": null
    },
    {
        "Lydia": "Lydia"
    },
    {
        " and the defeat of its king ": null
    },
    {
        "Croesus": "Croesus"
    },
    {
        ", who had put in place the first coinage in history. With his conquest of Lydia, Cyrus acquired a region in which coinage was invented, developed through advanced metallurgy, and had already been in circulation for about 50 years, making the Lydian Kingdom one of the leading trade powers of the time. It seems Cyrus initially adopted the Lydian coinage as such, and continued to strike Lydias lion-and-bull coinage.     Original coins of the ": null
    },
    {
        "Achaemenid Empire": "Achaemenid Empire"
    },
    {
        " were issued from 520 BCE – 450 BCE to 330 BCE. The Persian ": null
    },
    {
        "Daric": "Daric"
    },
    {
        " was the first truly Achaemenid ": null
    },
    {
        "gold coin": "Gold Coin"
    },
    {
        " which, along with a similar silver coin, the ": null
    },
    {
        "Siglos": "Siglos"
    },
    {
        ", represented the bimetallic ": null
    },
    {
        "monetary standard": "Monetary Standard"
    },
    {
        " of the ": null
    },
    {
        "Achaemenid Persian Empire": "Achaemenid Empire"
    },
    {
        ". Michael Alram, ,  Encyclopaedia Iranica , December 15, 1994, last updated November 17, 2011             The Achaemenid Empire already reached the doors of ": null
    },
    {
        "India": "India"
    },
    {
        " during the original expansion of ": null
    },
    {
        "Cyrus the Great": "Cyrus The Great"
    },
    {
        ", and the ": null
    },
    {
        "Achaemenid conquest of the Indus Valley": "Achaemenid Conquest Of The Indus Valley"
    },
    {
        " is dated to circa 515 BC under ": null
    },
    {
        "Darius I": "Darius I"
    },
    {
        ". An Achaemenid administration was established in the area. The ": null
    },
    {
        "Kabul hoard": "Kabul Hoard"
    },
    {
        ", also called the Chaman Hazouri hoard,  is a coin hoard discovered in the vicinity of ": null
    },
    {
        "Kabul": "Kabul"
    },
    {
        ", ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ", containing numerous ": null
    },
    {
        "Achaemenid": "Achaemenid"
    },
    {
        " coins as well as many ": null
    },
    {
        "Greek": "Ancient Greece"
    },
    {
        " coins from the 5th and 4th centuries BCE. : The most important and informative of these hoards is the Chaman Hazouri hoard from Kabul discovered in 1933, which contained royal Achaemenid sigloi from the western part of the Achaemenid Empire, together with a large number of Greek coins dating from the fifth and early fourth century BC, including a local imitation of an Athenian tetradrachm, all apparently taken from circulation in the region. The deposit of the hoard is dated to the Achaemenid period, in approximately 380 BCE.  The hoard also contained many locally produced silver coins, minted by local authorities under Achaemenid rule.  Several of these issues follow the western designs of the facing bull heads, a stag, or Persian column capitals on the obverse, and incuse punch on the reverse.      According to numismatist ": null
    },
    {
        "Joe Cribb": "Joe Cribb"
    },
    {
        ", these finds suggest that the idea of coinage and the use of punch-marked techniques was introduced to India from the Achaemenid Empire during the 4th century BCE.  More Achaemenid coins were also found in ": null
    },
    {
        "Pushkalavati": "Pushkalavati"
    },
    {
        " and in ": null
    },
    {
        "Bhir Mound": "Bhir Mound"
    },
    {
        "  Gandhara": "Gandhara"
    },
    {
        "n bent-bar punch-marked coin minted under Achaemenid administration, of the type found in large quantities in the Chaman Hazouri and the ": null
    },
    {
        "Bhir Mound": "Bhir Mound"
    },
    {
        " punch-marked coins": "Punch-Marked Coins"
    },
    {
        " of Gandhara, ": null
    },
    {
        "Taxila": "Taxila"
    },
    {
        "-": null
    },
    {
        "Gandhara": "Gandhara"
    },
    {
        " region.                  The ": null
    },
    {
        "Karshapana": "Karshapana"
    },
    {
        " is the earliest ": null
    },
    {
        "punch-marked coin": "Punch-Marked Coin"
    },
    {
        " found in India, produced from at least the mid-4th century BC, and possibly as early as 575 BC,  influenced by similar coins produced in ": null
    },
    {
        "Gandhara": "Gandhara"
    },
    {
        " under the Achaemenid empire, such as those of the ": null
    },
    {
        "Kabul hoard": "Kabul Hoard"
    },
    {
        ",  or other examples found at ": null
    },
    {
        "Pushkalavati": "Pushkalavati"
    },
    {
        " and in ": null
    },
    {
        "Bhir Mound": "Bhir Mound"
    },
    {
        ". , CNG Coins.   : Silver bent-bar punch-marked coin of Kabul region under the Achaemenid Empire, c.350 BC: Coins of this type found in quantity in Chaman Hazouri and Bhir Mound hoards.                 According to ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        " and ": null
    },
    {
        "Pollux": "Julius Pollux"
    },
    {
        " , the first issuer of Greek coinage was ": null
    },
    {
        "Hermodike of Kyme": "Hermodike Ii"
    },
    {
        ".      A small percentage of early Lydian/Greek coins have a legend.  A famous early electrum coin, the most ancient inscribed coin at present known, is from nearby ": null
    },
    {
        "Caria": "Caria"
    },
    {
        ". This coin has a Greek legend reading phaenos emi sema  interpreted variously as I am the badge of Phanes , or I am the sign of light , Newton Num. Chron., 1870, p. 238 or I am the tomb of light , or I am the tomb of Phanes . The coins of ": null
    },
    {
        "Phanes": "Phanes"
    },
    {
        " are known to be among the earliest of Greek coins, a ": null
    },
    {
        "hemihekte": "Hemihekte"
    },
    {
        " of the issue was found in the foundation deposit of the temple of Artemis at Ephesos . One assumption is that Phanes was a wealthy merchant, another that this coin is associated with Apollo-": null
    },
    {
        "Phanes": "Phanes"
    },
    {
        " and, due to the ": null
    },
    {
        "Deer": "Deer"
    },
    {
        ", with ": null
    },
    {
        "Artemis": "Artemis"
    },
    {
        " . Although only seven Phanes type coins were discovered, it is also notable that 20% of all early ": null
    },
    {
        "electrum": "Electrum"
    },
    {
        " coins also have the lion of Artemis and the sun burst of Apollo-Phaneos.     Alternatively, Phanes may have been the ": null
    },
    {
        "Halicarnassian": "Halicarnassus"
    },
    {
        " mercenary of ": null
    },
    {
        "Amasis": "Amasis Ii"
    },
    {
        " mentioned by ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        ", who escaped to the court of ": null
    },
    {
        "Cambyses": "Cambyses"
    },
    {
        ", and became his guide in the invasion of Egypt in 527 or 525 BC. According to Herodotus, this Phanes was buried alive by a sandstorm, together with 50,000 Persian soldiers, while trying to conquer the temple of ": null
    },
    {
        "Amun": "Amun"
    },
    {
        "–": null
    },
    {
        "Zeus": "Zeus"
    },
    {
        " in Egypt. . Herodotus third book . The fact that the Greek word Phanes also means light , and the word sema also means tomb makes this coin a famous and controversial one.      Another candidate for the site of the earliest coins is ": null
    },
    {
        "Aegina": "Aegina"
    },
    {
        ", where ": null
    },
    {
        "Chelone": "Chelone"
    },
    {
        " coins were first minted circa 700 BC. British Museum Catalogue 11 – , 700 - 550 BCE, plate  . Coins from ": null
    },
    {
        "Athens": "Classical Athens"
    },
    {
        " and ": null
    },
    {
        "Corinth": "Ancient Corinth"
    },
    {
        " Phaselis": "Phaselis"
    },
    {
        "  Lesbos": "Lesbos"
    },
    {
        ", ": null
    },
    {
        "Ionia": "Ionia"
    },
    {
        ". Circa 510–80 BC.               The ": null
    },
    {
        "Classical period": "Classical Greece"
    },
    {
        " saw Greek coinage reach a high level of technical and aesthetic quality. Larger cities now produced a range of fine silver and gold coins, most bearing a portrait of their patron god or goddess or a legendary hero on one side, and a symbol of the city on the other. Some coins employed a visual pun: some coins from ": null
    },
    {
        "Rhodes": "Rhodes"
    },
    {
        " featured a ": null
    },
    {
        "rose": "Rose"
    },
    {
        ", since the Greek word for rose is rhodon. The use of inscriptions on coins also began, usually the name of the issuing city.     The wealthy cities of Sicily produced some especially fine coins. The large silver decadrachm coin from ": null
    },
    {
        "Syracuse": "Syracuse, Sicily"
    },
    {
        " is regarded by many collectors as the finest coin produced in the ancient world, perhaps ever. Syracusan issues were rather standard in their imprints, one side bearing the head of the nymph ": null
    },
    {
        "Arethusa": "Arethusa"
    },
    {
        " and the other usually a victorious ": null
    },
    {
        "quadriga": "Quadriga"
    },
    {
        ". The ": null
    },
    {
        "tyrants of Syracuse": "List Of Tyrants Of Syracuse"
    },
    {
        " were fabulously rich, and part of their ": null
    },
    {
        "public relations": "Public Relations"
    },
    {
        " policy was to fund ": null
    },
    {
        "quadrigas": "Quadriga"
    },
    {
        "for the ": null
    },
    {
        "Olympic chariot race": "Ancient Olympic Games"
    },
    {
        ", a very expensive undertaking. As they were often able to finance more than one quadriga at a time, they were frequent victors in this highly prestigious event. Syracuse was one of the epicenters of numismatic art during the classical period. Led by the engravers Kimon and Euainetos, Syracuse produced some of the finest coin designs of antiquity.     Amongst the first centers to produce coins during the Greek colonization of mainland Southern Italy  were ": null
    },
    {
        "Paestum": "Paestum"
    },
    {
        ", ": null
    },
    {
        "Crotone": "Crotone"
    },
    {
        ", ": null
    },
    {
        "Sybaris": "Sybaris"
    },
    {
        ", ": null
    },
    {
        "Caulonia": "Caulonia"
    },
    {
        ", ": null
    },
    {
        "Metapontum": "Metapontum"
    },
    {
        ", and ": null
    },
    {
        "Taranto": "Taranto"
    },
    {
        ". These ancient cities started producing coins from 550BC to 510BC.       Amisano, in a general publication, including the Etruscan coinage, attributing it the beginning to about 560 BC in ": null
    },
    {
        "Populonia": "Populonia"
    },
    {
        ", a chronology that would leave out the contribution of the Greeks of Magna Graecia and attribute to the Etruscans the burden of introducing the coin in Italy. In this work, constant reference is made to classical sources, and credit is given to the origin of the Etruscan Lydia, a source supported by Herodotus, and also to the invention of coin in Lydia. Giuseppe Amisano, Cronologia e politica monetaria alla luce dei segni di valore delle monete etrusche e romane , in: Panorama numismatico, 49 , pp. 15-20       ISLANDS off ATTICA. Aegina. Circa 456-45-431 BC.jpg|": null
    },
    {
        "Aegina": "Aegina"
    },
    {
        " coin type, incuse skew pattern. Circa 456/45–431 BC.   MACEDON, Akanthos. Circa 470-430 BC.jpg|Coin of ": null
    },
    {
        "Akanthos": "Akanthos"
    },
    {
        ", ": null
    },
    {
        "Macedon": "Macedon"
    },
    {
        " Aspendos": "Aspendos"
    },
    {
        ", ": null
    },
    {
        "Pamphylia": "Pamphylia"
    },
    {
        " Korkyra": "Korkyra"
    },
    {
        " Cyprus": "Cyprus"
    },
    {
        ", circa 450 BCE.            Although many of the first coins illustrated the images of various gods, the first portraiture of actual rulers appears with the coinage of ": null
    },
    {
        "Lycia": "Lycia"
    },
    {
        " in the 5th century BC. The earliest attempts at portraiture appear to have taken place in Lycia. The heads of various dynasts appear on coins of the fifth century  ruled 410–390 BCruled 390–380 BCruled 380-360 BC": null
    },
    {
        ", 30mm, 6.94 g[City of] Yi Four H": ", 30Mm, 6.94 G[City Of] Yi Four H"
    },
    {
        "inese co": "Inese Co"
    },
    {
        "化reigned 171–145 BCreigned c. 95–90 BCRoger Ling, Greece and the Hellenistic World 312–281 BC281–261 BC105–95 BCincluding Egyptthe ": null
    },
    {
        "Etruscans": "Etruscans"
    },
    {
        " were famous metal workers in bronze and iron": null
    },
    {
        "talworki": "Talworki"
    },
    {
        "Mithridates I": "Mithridates I Of Parthia"
    },
    {
        "the “piece of eight” of pirate fame": null
    },
    {
        "Weimar Republic]], 19": "Weimar Republic]], 19"
    },
    {
        " lawsee belownominally containing slightly less than a tenth, quarter, half, and full ounce of silver, respectively": null
    },
    {
        "ited States co": "Ited States Co"
    },
    {
        "ited States co": "Ited States Co"
    },
    {
        "CFRand with some comparable coins in other currenciesboften ": null
    },
    {
        "copper": "Copper"
    },
    {
        " or ": null
    },
    {
        "nickel": "Nickel"
    },
    {
        "thereby debasing the moneyexcept for the images and symbols on the coins, which have changed a number of timesthough its composition was changed in 1982 to remove virtually all copper from the coin": null
    },
    {
        "ited States co": "Ited States Co"
    },
    {
        "fiatthose dated prior to 1982 and some 1982-dated coinsThe half dollar and dollar coins are still produced, but mostly for vending machines and collectors.known then as half dimes ": null
    },
    {
        "286": "286"
    },
    {
        "ited States co": "Ited States Co"
    },
    {
        "see List of people on coins colloquially, headscolloquially, tails": null
    },
    {
        "itish decimal co": "Itish Decimal Co"
    },
    {
        "ited States co": "Ited States Co"
    },
    {
        "itish co": "Itish Co"
    },
    {
        "itish co": "Itish Co"
    },
    {
        "strali": "Strali"
    },
    {
        "itish decimal co": "Itish Decimal Co"
    },
    {
        "itish co": "Itish Co"
    },
    {
        "produced to commemorate the 2007/2008 ": null
    },
    {
        "Tutankhamun": "Tutankhamun"
    },
    {
        " exhibition at ": null
    },
    {
        "The O2 Arena": "The O2 Arena"
    },
    {
        "sometimes incorrectly called plastic coinsin the parlance of Bernoulli trials, a success formally, the ": null
    },
    {
        "precession": "Precession"
    },
    {
        " rate of the symmetry axis of the coin, i.e., the axis passing from one face of the coin to the otherair resistance is minordivergence of the precession rate": null
    },
    {
        " 10th to 16th centu": "10Th To 16Th Centu"
    }
]