[
    {
        "      Communications in Indonesia has a complex history due to the need to reach an extended archipelago of over 17,500 islands. The once important non-electronic communication methods of the past have given away to a considerable telecommunications infrastructure in contemporary ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        ".       Indonesia has long been using traditional forms of slayed communications between various islands and villages. It was not until the sixteenth century when the ": null
    },
    {
        "Dutch": "Dutch Empire"
    },
    {
        " colonised Indonesia, constructing a more elaborate communication system, both within Indonesia and to other countries. The first connection to ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " was an undersea ": null
    },
    {
        "telegraph": "Telegraph"
    },
    {
        " cable that was completed on 18 November 1871, connecting ": null
    },
    {
        "Java": "Java"
    },
    {
        " to ": null
    },
    {
        "Darwin": "Darwin, Northern Territory"
    },
    {
        ", and eventually to the ": null
    },
    {
        "Australian Overland Telegraph Line": "Australian Overland Telegraph Line"
    },
    {
        " across Australia.     After gaining Independence, Indonesia started to develop its own communication systems, generally following the rest of the world. The construction of communication towers and launch of the Palapa series of communication satellites was done during the ": null
    },
    {
        "New Order": "New Order"
    },
    {
        " period.       A number of lines connect Indonesia to international communication routes. For example, the ": null
    },
    {
        "SEA-ME-WE 3": "Sea-Me-We 3"
    },
    {
        " optical": "Optical Fiber"
    },
    {
        " submarine telecommunications cable": "Submarine Telecommunications Cable"
    },
    {
        " lands at both ": null
    },
    {
        "Medan": "Medan"
    },
    {
        " and ": null
    },
    {
        "Jakarta": "Jakarta"
    },
    {
        " connecting Europe with South eastern Asia  and Australia .     Domestically, Indonesia has good coverage for media across most major islands, although smaller and less populated Islands do not always receive attention from media companies, and rely on satellite communication.                Indonesia has a long list of print media, in the form of ": null
    },
    {
        "newspapers": "Newspapers"
    },
    {
        " and ": null
    },
    {
        "magazines": "Magazines"
    },
    {
        ". Some, such as ": null
    },
    {
        "Kompas": "Kompas"
    },
    {
        " and ": null
    },
    {
        "Koran Tempo": "Koran Tempo"
    },
    {
        " are circulated daily and are relatively simple to obtain. Others are island- or city-specific, and are usually not distributed to other regions.           ": null
    },
    {
        "Telephones": "Telephone"
    },
    {
        " - main lines in use: 9.99 million   Telephones - mobile cellular: At the end of 2010, the mobile cellular penetration rate was 67 percent . , Josh Franken, Jakarta Post, 16 May 2011 ": null
    },
    {
        "CDMA": "Cdma"
    },
    {
        " use is declining in favour of ": null
    },
    {
        "GSM": "Gsm"
    },
    {
        ".    Telephone system: domestic service fair, international service good   domestic: interisland ": null
    },
    {
        "microwave": "Microwave"
    },
    {
        " system and HF radio police net; domestic satellite communications system   international: satellite earth stations - 2 ": null
    },
    {
        "Intelsat": "Intelsat"
    },
    {
        "            Radio": "Radio"
    },
    {
        " broadcast stations: AM 678, FM 43, shortwave 82   Radios: 31.5 million           ": null
    },
    {
        "Television": "Television"
    },
    {
        " broadcast stations: 11 national TV, 60 local TV :   Televisions: 13.75 million        ": null
    },
    {
        "Internet Service Providers": "Internet Service Provider"
    },
    {
        " : 24   ": null
    },
    {
        "Country code": "Country Codes"
    },
    {
        " : ": null
    },
    {
        ".id": ".Id"
    },
    {
        "     By June 2011, all sub-districts in Indonesia will be connected to the Internet. , Antara News, 22 May 2011         The media in Indonesia is regulated by the Ministry of Communications and Informatics.     ": null
    },
    {
        "LIRNEasias": "Lirneasia"
    },
    {
        " Telecommunications Regulatory Environment index, which summarises stakeholders’ perception on certain TRE dimensions, provides insight into how conducive the environment is for further development and progress. The most recent survey was conducted in July 2008 in eight Asian countries, including Bangladesh, India, Indonesia, Sri Lanka, Maldives, Pakistan, Thailand, and the Philippines. The tool measured seven dimensions: i": null
    }
]