[
    {
        "Computational chemistry is a branch of ": null
    },
    {
        "chemistry": "Chemistry"
    },
    {
        " that uses ": null
    },
    {
        "computer simulation": "Computer Simulation"
    },
    {
        " to assist in solving chemical problems. It uses methods of ": null
    },
    {
        "theoretical chemistry": "Theoretical Chemistry"
    },
    {
        ", incorporated into efficient ": null
    },
    {
        "computer program": "Computer Program"
    },
    {
        "s, to calculate the structures and properties of ": null
    },
    {
        "molecules": "Molecule"
    },
    {
        "and solids. It is necessary because, apart from relatively recent results concerning the hydrogen molecular ion , the quantum ": null
    },
    {
        "many-body problem": "Many-Body Problem"
    },
    {
        " cannot be solved analytically, much less in closed form. While computational results normally complement the information obtained by chemical ": null
    },
    {
        "experiment": "Experiment"
    },
    {
        "s, it can in some cases predict hitherto unobserved chemical ": null
    },
    {
        "phenomena": "Phenomena"
    },
    {
        ". It is widely used in the design of new drugs and materials.     Examples of such properties are structure , absolute and ": null
    },
    {
        "relative": "Interaction Energy"
    },
    {
        " energies": "Energy"
    },
    {
        ", ": null
    },
    {
        "electron": "Electron"
    },
    {
        "ic ": null
    },
    {
        "charge density": "Charge Density"
    },
    {
        " distributions, ": null
    },
    {
        "dipoles": "Dipole"
    },
    {
        "and higher ": null
    },
    {
        "multipole moment": "Multipole Moment"
    },
    {
        "s, ": null
    },
    {
        "vibrational frequencies": "Vibrational Spectroscopy"
    },
    {
        ", ": null
    },
    {
        "reactivity": "Reactivity"
    },
    {
        ", or other ": null
    },
    {
        "spectroscopic": "Spectroscopy"
    },
    {
        " quantities, and ": null
    },
    {
        "cross sections": "Cross Section"
    },
    {
        " for ": null
    },
    {
        "collision": "Scattering Theory"
    },
    {
        " with other particles.     The methods used cover both static and dynamic situations. In all cases, the computer time and other resources increase rapidly with the size of the system being studied. That system can be one molecule, a group of molecules, or a solid. Computational chemistry methods range from very approximate to highly accurate; the latter are usually feasible for small systems only. ": null
    },
    {
        "Ab initio methods": "Ab Initio Quantum Chemistry Methods"
    },
    {
        " are based entirely on ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " and basic ": null
    },
    {
        "physical constant": "Physical Constant"
    },
    {
        "s. Other methods are called empirical or ": null
    },
    {
        "semi-empirical": "Semi-Empirical Quantum Chemistry Method"
    },
    {
        " because they use additional empirical parameters.     Both  ab initio  and semi-empirical approaches involve approximations. These range from simplified forms of the first-principles equations that are easier or faster to solve, to approximations limiting the size of the system , to fundamental approximations to the underlying equations that are required to achieve any solution to them at all. For example, most ab initio calculations make the ": null
    },
    {
        "Born–Oppenheimer approximation": "Born–Oppenheimer Approximation"
    },
    {
        ", which greatly simplifies the underlying ": null
    },
    {
        "Schrödinger equation": "Schrödinger Equation"
    },
    {
        " by assuming that the nuclei remain in place during the calculation. In principle, ": null
    },
    {
        "ab initio methods": "Ab Initio Quantum Chemistry Methods"
    },
    {
        " eventually converge to the exact solution of the underlying equations as the number of approximations is reduced. In practice, however, it is impossible to eliminate all approximations, and residual error inevitably remains. The goal of computational chemistry is to minimize this residual error while keeping the calculations tractable.     In some cases, the details of electronic structure are less important than the long-time ": null
    },
    {
        "phase space": "Phase Space"
    },
    {
        " behavior of molecules. This is the case in conformational studies of proteins and protein-ligand binding thermodynamics. Classical approximations to the ": null
    },
    {
        "potential energy surface": "Potential Energy Surface"
    },
    {
        " are used, as they are computationally less intensive than electronic calculations, to enable longer simulations of ": null
    },
    {
        "molecular dynamics": "Molecular Dynamics"
    },
    {
        ". Furthermore, ": null
    },
    {
        "cheminformatics": "Cheminformatics"
    },
    {
        " uses even more empirical methods like ": null
    },
    {
        "machine learning": "Machine Learning"
    },
    {
        " based on physicochemical properties. One typical problem in cheminformatics is to predict the binding affinity of drug molecules to a given target.       Building on the founding discoveries and theories in the ": null
    },
    {
        "history of quantum mechanics": "History Of Quantum Mechanics"
    },
    {
        ", the first theoretical calculations in chemistry were those of ": null
    },
    {
        "Walter Heitler": "Walter Heitler"
    },
    {
        " and ": null
    },
    {
        "Fritz London": "Fritz London"
    },
    {
        " in 1927. The books that were influential in the early development of computational quantum chemistry include ": null
    },
    {
        "Linus Pauling": "Linus Pauling"
    },
    {
        " and ": null
    },
    {
        "E. Bright Wilsons": "Edgar Bright Wilson"
    },
    {
        "1935 Introduction to Quantum Mechanics – with Applications to Chemistry, ": null
    },
    {
        "Eyring": "Henry Eyring"
    },
    {
        ", Walter and Kimballs 1944 Quantum Chemistry, Heitlers 1945 Elementary Wave Mechanics – with Applications to Quantum Chemistry, and later ": null
    },
    {
        "Coulsons": "Charles Coulson"
    },
    {
        "1952 textbook Valence, each of which served as primary references for chemists in the decades to follow.     With the development of efficient ": null
    },
    {
        "computer": "Computer"
    },
    {
        " technology in the 1940s, the solutions of elaborate ": null
    },
    {
        "wave equations": "Wave Equation"
    },
    {
        "for complex ": null
    },
    {
        "atom": "Atom"
    },
    {
        "ic systems began to be a realizable objective. In the early 1950s, the first semi-empirical atomic orbital calculations were performed. Theoretical chemists became extensive users of the early digital computers. One major advance came with the 1951 paper in Reviews of Modern Physics by Clemens C. J. Roothaan in 1951, largely on the LCAO MO approach , for many years the second-most cited paper in that journal. A very detailed account of such use in the United Kingdom is given by Smith and Sutcliffe.  The first ab initio ": null
    },
    {
        "Hartree–Fock method": "Hartree–Fock Method"
    },
    {
        " calculations on diatomic molecules were performed in 1956 at MIT, using a ": null
    },
    {
        "basis set": "Basis Set"
    },
    {
        " of ": null
    },
    {
        "Slater orbital": "Slater Orbital"
    },
    {
        "s. For diatomic molecules, a systematic study using a minimum basis set and the first calculation with a larger basis set were published by Ransil and Nesbet respectively in 1960.  The first polyatomic calculations using ": null
    },
    {
        "Gaussian orbitals": "Gaussian Orbital"
    },
    {
        "were performed in the late 1950s. The first ": null
    },
    {
        "configuration interaction": "Configuration Interaction"
    },
    {
        " calculations were performed in Cambridge on the ": null
    },
    {
        "EDSAC": "Edsac"
    },
    {
        " computer in the 1950s using Gaussian orbitals by ": null
    },
    {
        "Boys": "Francis Boys"
    },
    {
        " and coworkers.  By 1971, when a bibliography of ab initio calculations was published,  the largest molecules included were ": null
    },
    {
        "naphthalene": "Naphthalene"
    },
    {
        " and ": null
    },
    {
        "azulene": "Azulene"
    },
    {
        ".   Abstracts of many earlier developments in ab initio theory have been published by Schaefer.      In 1964, ": null
    },
    {
        "Hückel method": "Hückel Method"
    },
    {
        " calculations  of molecules, ranging in complexity from ": null
    },
    {
        "butadiene": "Butadiene"
    },
    {
        " and ": null
    },
    {
        "benzene": "Benzene"
    },
    {
        " to ": null
    },
    {
        "ovalene": "Ovalene"
    },
    {
        ", were generated on computers at Berkeley and Oxford.  These empirical methods were replaced in the 1960s by ": null
    },
    {
        "semi-empirical methods": "Semi-Empirical Quantum Chemistry Method"
    },
    {
        " such as ": null
    },
    {
        "CNDO": "Cndo/2"
    },
    {
        ".      In the early 1970s, efficient ab initio computer programs such as ATMOL, ": null
    },
    {
        "Gaussian": "Gaussian"
    },
    {
        ", IBMOL, and POLYAYTOM, began to be used to speed ab initio calculations of molecular orbitals. Of these four programs, only Gaussian, now vastly expanded, is still in use, but many other programs are now in use. At the same time, the methods of ": null
    },
    {
        "molecular mechanics": "Molecular Mechanics"
    },
    {
        ", such as MM2 ": null
    },
    {
        "force field": "Force Field"
    },
    {
        ", were developed, primarily by ": null
    },
    {
        "Norman Allinger": "Norman Allinger"
    },
    {
        ".      One of the first mentions of the term computational chemistry can be found in the 1970 book Computers and Their Role in the Physical Sciences by Sidney Fernbach and Abraham Haskell Taub, where they state It seems, therefore, that computational chemistry can finally be more and more of a reality.  During the 1970s, widely different methods began to be seen as part of a new emerging discipline of computational chemistry.  The  Journal of Computational Chemistry  was first published in 1980.     Computational chemistry has featured in several Nobel Prize awards, most notably in 1998 and 2013. ": null
    },
    {
        "Walter Kohn": "Walter Kohn"
    },
    {
        ", for his development of the density-functional theory , and ": null
    },
    {
        "John Pople": "John Pople"
    },
    {
        ", for his development of computational methods in quantum chemistry , received the 1998 ": null
    },
    {
        "Nobel Prize": "Nobel Prize"
    },
    {
        " in Chemistry.  ": null
    },
    {
        "Martin Karplus": "Martin Karplus"
    },
    {
        ", ": null
    },
    {
        "Michael Levitt": "Michael Levitt"
    },
    {
        " and ": null
    },
    {
        "Arieh Warshel": "Arieh Warshel"
    },
    {
        " received the 2013 ": null
    },
    {
        "Nobel Prize": "Nobel Prize"
    },
    {
        " in Chemistry for the development of multiscale models for complex chemical systems .          The term theoretical chemistry may be defined as a mathematical description of chemistry, whereas computational chemistry is usually used when a mathematical method is sufficiently well developed that it can be automated for implementation on a computer. In theoretical chemistry, chemists, physicists, and mathematicians develop ": null
    },
    {
        "algorithms": "Algorithm"
    },
    {
        "and computer programs to predict atomic and molecular properties and reaction paths for ": null
    },
    {
        "chemical reaction": "Chemical Reaction"
    },
    {
        "s. Computational chemists, in contrast, may simply apply existing computer programs and methodologies to specific chemical questions.     Computational chemistry has two different aspects:   Computational studies, used to find a starting point for a laboratory synthesis, or to assist in understanding experimental data, such as the position and source of spectroscopic peaks.   Computational studies, used to predict the possibility of so far entirely unknown molecules or to explore reaction mechanisms not readily studied via experiments.     Thus, computational chemistry can assist the experimental chemist or it can challenge the experimental chemist to find entirely new chemical objects.     Several major areas may be distinguished within computational chemistry:   The prediction of the molecular structure of molecules by the use of the simulation of forces, or more accurate quantum chemical methods, to find stationary points on the energy surface as the position of the nuclei is varied.   Storing and searching for data on chemical entities .   Identifying ": null
    },
    {
        "correlations": "Correlation"
    },
    {
        "between ": null
    },
    {
        "chemical structures": "Chemical Structure"
    },
    {
        "and properties .   Computational approaches to help in the efficient synthesis of compounds.   Computational approaches to design molecules that interact in specific ways with other molecules .       The words exact and perfect do not apply here, as very few aspects of chemistry can be computed exactly. However, almost every aspect of chemistry can be described in a qualitative or approximate quantitative computational scheme.     Molecules consist of nuclei and electrons, so the methods of ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " apply. Computational chemists often attempt to solve the non-relativistic ": null
    },
    {
        "Schrödinger equation": "Schrödinger Equation"
    },
    {
        ", with relativistic corrections added, although some progress has been made in solving the fully relativistic ": null
    },
    {
        "Dirac equation": "Dirac Equation"
    },
    {
        ". In principle, it is possible to solve the Schrödinger equation in either its time-dependent or time-independent form, as appropriate for the problem in hand; in practice, this is not possible except for very small systems. Therefore, a great number of approximate methods strive to achieve the best trade-off between accuracy and computational cost.     Accuracy can always be improved with greater computational cost. Significant errors can present themselves in ": null
    },
    {
        "ab initio": "Ab Initio"
    },
    {
        " models comprising many electrons, due to the computational cost of full relativistic-inclusive methods. This complicates the study of molecules interacting with high atomic mass unit atoms, such as transitional metals and their catalytic properties. Present algorithms in computational chemistry can routinely calculate the properties of small molecules that contain up to about 40 electrons with errors for energies less than a few kJ/mol. For geometries, bond lengths can be predicted within a few picometres and bond angles within 0.5 degrees. The treatment of larger molecules that contain a few dozen atoms is computationally tractable by more approximate methods such as ": null
    },
    {
        "density functional theory": "Density Functional Theory"
    },
    {
        " .     There is some dispute within the field whether or not the latter methods are sufficient to describe complex chemical reactions, such as those in biochemistry. Large molecules can be studied by semi-empirical approximate methods. Even larger molecules are treated by ": null
    },
    {
        "classical mechanics": "Classical Mechanics"
    },
    {
        " methods that use what are called ": null
    },
    {
        "molecular mechanics": "Molecular Mechanics"
    },
    {
        " . In QM-MM methods, small parts of large complexes are treated quantum mechanically , and the remainder is treated approximately .       One molecular formula can represent more than one molecular isomer: a set of isomers. Each isomer is a local minimum on the energy surface  created from the total energy as a function of the coordinates of all the nuclei. A stationary point is a geometry such that the derivative of the energy with respect to all displacements of the nuclei is zero. A local minimum is a stationary point where all such displacements lead to an increase in energy. The local minimum that is lowest is called the global minimum and corresponds to the most stable isomer. If there is one particular coordinate change that leads to a decrease in the total energy in both directions, the stationary point is a ": null
    },
    {
        "transition structure": "Transition State"
    },
    {
        " and the coordinate is the ": null
    },
    {
        "reaction coordinate": "Reaction Coordinate"
    },
    {
        ". This process of determining stationary points is called ": null
    },
    {
        "geometry optimization": "Geometry Optimization"
    },
    {
        ".     The determination of molecular structure by ": null
    },
    {
        "geometry optimization": "Geometry Optimization"
    },
    {
        " became routine only after efficient methods for calculating the first derivatives of the energy with respect to all atomic coordinates became available. Evaluation of the related second derivatives allows the prediction of vibrational frequencies if harmonic motion is estimated. More importantly, it allows for the characterization of stationary points. The frequencies are related to the eigenvalues of the ": null
    },
    {
        "Hessian matrix": "Hessian Matrix"
    },
    {
        ", which contains second derivatives. If the eigenvalues are all positive, then the frequencies are all real and the stationary point is a local minimum. If one eigenvalue is negative , then the stationary point is a transition structure. If more than one eigenvalue is negative, then the stationary point is a more complex one, and is usually of little interest. When one of these is found, it is necessary to move the search away from it if the experimenter is looking solely for local minima and transition structures.     The total energy is determined by approximate solutions of the time-dependent Schrödinger equation, usually with no relativistic terms included, and by making use of the ": null
    },
    {
        "Born–Oppenheimer approximation": "Born–Oppenheimer Approximation"
    },
    {
        ", which allows for the separation of electronic and nuclear motions, thereby simplifying the Schrödinger equation. This leads to the evaluation of the total energy as a sum of the electronic energy at fixed nuclei positions and the repulsion energy of the nuclei. A notable exception are certain approaches called ": null
    },
    {
        "direct quantum chemistry": "Direct Quantum Chemistry"
    },
    {
        ", which treat electrons and nuclei on a common footing. Density functional methods and semi-empirical methods are variants on the major theme. For very large systems, the relative total energies can be compared using molecular mechanics. The ways of determining the total energy to predict molecular structures are:     Ab initio methods      The programs used in computational chemistry are based on many different ": null
    },
    {
        "quantum-chemical": "Quantum Chemistry"
    },
    {
        " methods that solve the molecular ": null
    },
    {
        "Schrödinger equation": "Schrödinger Equation"
    },
    {
        " associated with the ": null
    },
    {
        "molecular Hamiltonian": "Molecular Hamiltonian"
    },
    {
        ". Methods that do not include any empirical or semi-empirical parameters in their equations  – being derived directly from theoretical principles, with no inclusion of experimental data  – are called  ab initio methods . This does not imply that the solution is an exact one; they are all approximate quantum mechanical calculations. It means that a particular approximation is rigorously defined on first principles and then solved within an error margin that is qualitatively known beforehand. If numerical iterative methods must be used, the aim is to iterate until full machine accuracy is obtained .          The simplest type of ab initio electronic structure calculation is the ": null
    },
    {
        "Hartree–Fock method": "Hartree–Fock Method"
    },
    {
        " , an extension of ": null
    },
    {
        "molecular orbital theory": "Molecular Orbital Theory"
    },
    {
        ", in which the correlated electron-electron repulsion is not specifically taken into account; only its average effect is included in the calculation. As the basis set size is increased, the energy and wave function tend towards a limit called the Hartree–Fock limit. Many types of calculations  begin with a Hartree–Fock calculation and subsequently correct for electron-electron repulsion, referred to also as ": null
    },
    {
        "electronic correlation": "Electronic Correlation"
    },
    {
        ". As these methods are pushed to the limit, they approach the exact solution of the non-relativistic Schrödinger equation. To obtain exact agreement with experiment, it is necessary to include relativistic and ": null
    },
    {
        "spin orbit": "Angular Momentum Couplingspin-Orbit Coupling"
    },
    {
        " terms, both of which are far more important for heavy atoms. In all of these approaches, along with choice of method, it is necessary to choose a ": null
    },
    {
        "basis set": "Basis Set"
    },
    {
        ". This is a set of functions, usually centered on the different atoms in the molecule, which are used to expand the molecular orbitals with the ": null
    },
    {
        "linear combination of atomic orbitals": "Linear Combination Of Atomic Orbitals"
    },
    {
        " molecular orbital method ": null
    },
    {
        "ansatz": "Ansatz"
    },
    {
        ". Ab initio methods need to define a level of theory and a basis set.     The Hartree–Fock wave function is a single configuration or determinant. In some cases, particularly for bond breaking processes, this is inadequate, and several ": null
    },
    {
        "configurations": "Multi-Configurational Self-Consistent Field"
    },
    {
        " must be used. Here, the coefficients of the configurations, and of the basis functions, are optimized together.     The total molecular energy can be evaluated as a function of the ": null
    },
    {
        "molecular geometry": "Molecular Geometry"
    },
    {
        "; in other words, the ": null
    },
    {
        "potential energy surface": "Potential Energy Surface"
    },
    {
        ". Such a surface can be used for reaction dynamics. The stationary points of the surface lead to predictions of different ": null
    },
    {
        "isomers": "Isomer"
    },
    {
        "and the ": null
    },
    {
        "transition structures": "Transition State Theory"
    },
    {
        " for conversion between isomers, but these can be determined without a full knowledge of the complete surface.     A particularly important objective, called computational ": null
    },
    {
        "thermochemistry": "Thermochemistry"
    },
    {
        ", is to calculate thermochemical quantities such as the ": null
    },
    {
        "enthalpy of formation": "Standard Enthalpy Change Of Formation"
    },
    {
        " to chemical accuracy. Chemical accuracy is the accuracy required to make realistic chemical predictions and is generally considered to be 1  kcal/mol or 4  kJ/mol. To reach that accuracy in an economic way it is necessary to use a series of post-Hartree–Fock methods and combine the results. These methods are called ": null
    },
    {
        "quantum chemistry composite methods": "Quantum Chemistry Composite Methods"
    },
    {
        ".            Density functional theory methods are often considered to be  ab initio methods  for determining the molecular electronic structure, even though many of the most common ": null
    },
    {
        "functionals": "Functional"
    },
    {
        " use parameters derived from empirical data, or from more complex calculations. In DFT, the total energy is expressed in terms of the total one-": null
    },
    {
        "electron density": "Electronic Density"
    },
    {
        " rather than the wave function. In this type of calculation, there is an approximate ": null
    },
    {
        "Hamiltonian": "Hamiltonian"
    },
    {
        " and an approximate expression for the total electron density. DFT methods can be very accurate for little computational cost. Some methods combine the density functional exchange functional with the Hartree–Fock exchange term and are termed ": null
    },
    {
        "hybrid functional": "Hybrid Functional"
    },
    {
        " methods.            Semi-empirical ": null
    },
    {
        "quantum chemistry": "Quantum Chemistry"
    },
    {
        " methods are based on the ": null
    },
    {
        "Hartree–Fock method": "Hartree–Fock Method"
    },
    {
        " formalism, but make many approximations and obtain some parameters from empirical data. They were very important in computational chemistry from the 60s to the 90s, especially for treating large molecules where the full Hartree–Fock method without the approximations were too costly. The use of empirical parameters appears to allow some inclusion of correlation effects into the methods.     Primitive semi-empirical methods were designed even before, where the two-electron part of the ": null
    },
    {
        "Hamiltonian": "Hamiltonian"
    },
    {
        " is not explicitly included. For π-electron systems, this was the ": null
    },
    {
        "Hückel method": "Hückel Method"
    },
    {
        " proposed by ": null
    },
    {
        "Erich Hückel": "Erich Hückel"
    },
    {
        ", and for all valence electron systems, the ": null
    },
    {
        "extended Hückel method": "Extended Hückel Method"
    },
    {
        " proposed by ": null
    },
    {
        "Roald Hoffmann": "Roald Hoffmann"
    },
    {
        ". Sometimes, Hückel methods are referred to as completely emprirical because they do not derive from a Hamiltonian.  Yet, the term empirical methods , or empirical force fields is usually used to describe Molecular Mechanics.             In many cases, large molecular systems can be modeled successfully while avoiding quantum mechanical calculations entirely. ": null
    },
    {
        "Molecular mechanics": "Molecular Mechanics"
    },
    {
        " simulations, for example, use one classical expression for the energy of a compound, for instance the ": null
    },
    {
        "harmonic oscillator": "Harmonic Oscillator"
    },
    {
        ". All constants appearing in the equations must be obtained beforehand from experimental data or ab initio calculations.     The database of compounds used for parameterization, i.e., the resulting set of parameters and functions is called the ": null
    },
    {
        "force field": "Force Field"
    },
    {
        ", is crucial to the success of molecular mechanics calculations. A force field parameterized against a specific class of molecules, for instance proteins, would be expected to only have any relevance when describing other molecules of the same class.     These methods can be applied to proteins and other large biological molecules, and allow studies of the approach and interaction of potential drug molecules.              Computational chemical methods can be applied to ": null
    },
    {
        "solid state physics": "Solid State Physics"
    },
    {
        " problems. The electronic structure of a crystal is in general described by a ": null
    },
    {
        "band structure": "Band Structure"
    },
    {
        ", which defines the energies of electron orbitals for each point in the ": null
    },
    {
        "Brillouin zone": "Brillouin Zone"
    },
    {
        ". Ab initio and semi-empirical calculations yield orbital energies; therefore, they can be applied to band structure calculations. Since it is time-consuming to calculate the energy for a molecule, it is even more time-consuming to calculate them for the entire list of points in the Brillouin zone.       Once the electronic and ": null
    },
    {
        "nuclear": "Molecular Geometry"
    },
    {
        " variables are ": null
    },
    {
        "separated": "Separation Of Variables"
    },
    {
        " , in the time-dependent approach, the ": null
    },
    {
        "wave packet": "Wave Packet"
    },
    {
        " corresponding to the nuclear ": null
    },
    {
        "degrees of freedom": "Degrees Of Freedom"
    },
    {
        " is propagated via the ": null
    },
    {
        "time evolution": "Time Evolution"
    },
    {
        " operator ": "Operator"
    },
    {
        " associated to the time-dependent ": null
    },
    {
        "Schrödinger equation": "Schrödinger Equation"
    },
    {
        " . In the ": null
    },
    {
        "complementary": "Complementarity"
    },
    {
        " energy-dependent approach, the time-independent Schrödinger equation is solved using the ": null
    },
    {
        "scattering theory": "Scattering Theory"
    },
    {
        " formalism. The potential representing the interatomic interaction is given by the ": null
    },
    {
        "potential energy surface": "Potential Energy Surface"
    },
    {
        "s. In general, the ": null
    },
    {
        "potential energy surfaces": "Potential Energy Surface"
    },
    {
        "are coupled via the ": null
    },
    {
        "vibronic coupling": "Vibronic Coupling"
    },
    {
        " terms.     The most popular methods for propagating the ": null
    },
    {
        "wave packet": "Wave Packet"
    },
    {
        " associated to the ": null
    },
    {
        "molecular geometry": "Molecular Geometry"
    },
    {
        " are:   the ": null
    },
    {
        "split operator technique": "Split Operator Technique"
    },
    {
        ",   the ": null
    },
    {
        "Chebyshev polynomial": "Chebyshev Polynomials"
    },
    {
        ",   the ": null
    },
    {
        "multi-configuration time-dependent Hartree": "Multi-Configuration Time-Dependent Hartree"
    },
    {
        " method ,   the semiclassical method.            Molecular dynamics use either ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ", ": null
    },
    {
        "molecular mechanics": "Molecular Mechanics"
    },
    {
        " or a ": null
    },
    {
        "mixture of both": "Qm/Mm"
    },
    {
        " to calculate forces which are then used to solve ": null
    },
    {
        "Newtons laws of motion": "Newtons Laws Of Motion"
    },
    {
        " to examine the time-dependent behaviour of systems. The result of a molecular dynamics simulation is a trajectory that describes how the position and velocity of particles varies with time.          QM/MM is a hybrid method that attempts to combine the accuracy of quantum mechanics with the speed of molecular mechanics. It is useful for simulating very large molecules such as ": null
    },
    {
        "enzyme": "Enzyme"
    },
    {
        "s.         The ": null
    },
    {
        "atoms in molecules": "Atoms In Molecules"
    },
    {
        " model of ": null
    },
    {
        "Richard Bader": "Richard Bader"
    },
    {
        " was developed to effectively link the quantum mechanical model of a molecule, as an electronic wavefunction, to chemically useful concepts such as atoms in molecules, functional groups, bonding, the theory of ": null
    },
    {
        "Lewis pair": "Lewis Pair"
    },
    {
        "s, and the ": null
    },
    {
        "valence bond model": "Valence Bond Theory"
    },
    {
        ". Bader has demonstrated that these empirically useful chemistry concepts can be related to the ": null
    },
    {
        "topology": "Topology"
    },
    {
        " of the observable charge density distribution, whether measured or calculated from a quantum mechanical wavefunction. QTAIM analysis of molecular wavefunctions is implemented, for example, in the ": null
    },
    {
        "AIMAll": "Aimall"
    },
    {
        " software package.       Many self-sufficient ": null
    },
    {
        "computational chemistry software packages": ":Category:Computational Chemistry Software"
    },
    {
        " exist. Some include many methods covering a wide range, while others concentrate on a very specific range or even on one method. Details of most of them can be found in:   ": null
    },
    {
        "Biomolecular": "Biomolecular"
    },
    {
        " modelling programs: ": null
    },
    {
        "proteins": "List Of Protein Structure Prediction Software"
    },
    {
        ", ": null
    },
    {
        "nucleic acid": "Comparison Of Nucleic Acid Simulation Software"
    },
    {
        ".   ": null
    },
    {
        "Molecular mechanics": "Comparison Of Software For Molecular Mechanics Modeling"
    },
    {
        " programs.   ": null
    },
    {
        "Quantum chemistry and solid state physics software": "List Of Quantum Chemistry And Solid State Physics Software"
    },
    {
        " supporting several methods.   ": null
    },
    {
        "Molecular design software": "Molecular Design Software"
    },
    {
        " Semi-empirical": "Semi-Empirical Quantum Chemistry Methods"
    },
    {
        " programs.   ": null
    },
    {
        "Valence bond programs": "Valence Bond Programs"
    }
]