[
    {
        "     A computer monitor is an output device that displays information in pictorial form. A monitor usually comprises the ": null
    },
    {
        "display device": "Display Device"
    },
    {
        ", ": null
    },
    {
        "circuitry": "Electronic Circuit"
    },
    {
        ", casing, and ": null
    },
    {
        "power supply": "Power Supply"
    },
    {
        ". The display device in modern monitors is typically a ": null
    },
    {
        "thin film transistor liquid crystal display": "Thin Film Transistor Liquid Crystal Display"
    },
    {
        " with ": null
    },
    {
        "LED backlighting": "Led-Backlit Lcd"
    },
    {
        " having replaced ": null
    },
    {
        "cold-cathode fluorescent lamp": "Cold-Cathode Fluorescent Lamp"
    },
    {
        " backlighting. Older monitors used a ": null
    },
    {
        "cathode ray tube": "Cathode Ray Tube"
    },
    {
        " . Monitors are connected to the computer via ": null
    },
    {
        "VGA": "Vga Connector"
    },
    {
        ", ": null
    },
    {
        "Digital Visual Interface": "Digital Visual Interface"
    },
    {
        " , ": null
    },
    {
        "HDMI": "Hdmi"
    },
    {
        ", ": null
    },
    {
        "DisplayPort": "Displayport"
    },
    {
        ", ": null
    },
    {
        "Thunderbolt": "Thunderbolt"
    },
    {
        ", ": null
    },
    {
        "low-voltage differential signaling": "Low-Voltage Differential Signaling"
    },
    {
        " or other proprietary connectors and signals.     Originally, computer monitors were used for ": null
    },
    {
        "data processing": "Data Processing"
    },
    {
        " while ": null
    },
    {
        "television sets": "Television Set"
    },
    {
        "were used for entertainment. From the 1980s onwards, computers have been used for both data processing and entertainment, while ": null
    },
    {
        "televisions": "Television Set"
    },
    {
        " have implemented some computer functionality. The common ": null
    },
    {
        "aspect ratio": "Display Aspect Ratio"
    },
    {
        " of televisions, and computer monitors, has changed from 4:3 to 16:10, to 16:9.     Modern computer monitors are easily interchangeable with conventional television sets. However, as computer monitors do not necessarily include integrated ": null
    },
    {
        "speakers": "Computer Speakers"
    },
    {
        ", it may not be possible to use a computer monitor without external components.        Early ": null
    },
    {
        "electronic computers": "Electronic Computer"
    },
    {
        "were fitted with a panel of ": null
    },
    {
        "light bulbs": "Light Bulb"
    },
    {
        "where the state of each particular bulb would indicate the on/off state of a particular ": null
    },
    {
        "register bit": "Register Bit"
    },
    {
        " inside the computer. This allowed the engineers operating the computer to monitor the internal state of the machine, so this panel of lights came to be known as the monitor. As early monitors were only capable of displaying a very limited amount of information and were very transient, they were rarely considered for program output. Instead, a line printer was the primary output device, while the monitor was limited to keeping track of the programs operation.     As technology developed engineers realized that the output of a CRT display was more flexible than a panel of light bulbs and eventually, by giving control of what was displayed in the program itself, the monitor itself became a powerful output device in its own right.     Computer monitors were formerly known as visual display units , but this term had mostly fallen out of use by the 1990s.          Multiple technologies have been used for computer monitors. Until the 21st century most used cathode ray tubes but they have largely been superseded by ": null
    },
    {
        "LCD monitors": "Lcd Monitors"
    },
    {
        ".          The first computer monitors used ": null
    },
    {
        "cathode ray tubes": "Cathode Ray Tube"
    },
    {
        ". Prior to the advent of ": null
    },
    {
        "home computers": "Home Computer"
    },
    {
        "in the late 1970s, it was common for a ": null
    },
    {
        "video display terminal": "Video Display Terminal"
    },
    {
        " using a CRT to be physically integrated with a keyboard and other components of the system in a single large ": null
    },
    {
        "chassis": "Chassis"
    },
    {
        ". The display was ": null
    },
    {
        "monochrome": "Monochrome"
    },
    {
        " and far less sharp and detailed than on a modern flat-panel monitor, necessitating the use of relatively large text and severely limiting the amount of information that could be displayed at one time. High-resolution CRT displays were developed for the specialized military, industrial and scientific applications but they were far too costly for general use.     Some of the earliest home computers  were limited to monochrome CRT displays, but color display capability was already a standard feature of the pioneering ": null
    },
    {
        "Apple II": "Apple Ii"
    },
    {
        ", introduced in 1977, and the specialty of the more graphically sophisticated ": null
    },
    {
        "Atari 800": "Atari 8-Bit Family"
    },
    {
        ", introduced in 1979. Either computer could be connected to the antenna terminals of an ordinary color TV set or used with a purpose-made CRT color monitor for optimum resolution and color quality. Lagging several years behind, in 1981 IBM introduced the ": null
    },
    {
        "Color Graphics Adapter": "Color Graphics Adapter"
    },
    {
        ", which could display four colors with a resolution of 320 x 200 pixels, or it could produce 640 x 200 pixels with two colors. In 1984 IBM introduced the ": null
    },
    {
        "Enhanced Graphics Adapter": "Enhanced Graphics Adapter"
    },
    {
        " which was capable of producing 16 colors and had a resolution of 640 x 350.      By the end of the 1980s color CRT monitors that could clearly display 1024 x 768 pixels were widely available and increasingly affordable. During the following decade, maximum display resolutions gradually increased and prices continued to fall. CRT technology remained dominant in the PC monitor market into the new millennium partly because it was cheaper to produce and offered to view angles close to 180 degrees.  CRTs still offer some image quality advantages over LCDs but improvements to the latter have made them much less obvious. The dynamic range of early LCD panels was very poor, and although text and other motionless graphics were sharper than on a CRT, an LCD characteristic known as pixel lag caused moving graphics to appear noticeably smeared and blurry.        There are multiple technologies that have been used to implement liquid crystal displays . Throughout the 1990s, the primary use of LCD technology as computer monitors was in laptops where the lower power consumption, lighter weight, and smaller physical size of LCDs justified the higher price versus a CRT. Commonly, the same laptop would be offered with an assortment of display options at increasing price points: monochrome, passive color, or active matrix color . As volume and manufacturing capability have improved, the monochrome and passive color technologies were dropped from most product lines.     ": null
    },
    {
        "TFT-LCD": "Tft-Lcd"
    },
    {
        " is a variant of LCD which is now the dominant technology used for computer monitors.      The first standalone LCDs appeared in the mid-1990s selling for high prices. As prices declined over a period of years they became more popular, and by 1997 were competing with CRT monitors. Among the first desktop LCD computer monitors was the Eizo L66 in the mid-1990s, the Apple Studio Display in 1998, and the Apple Cinema Display in 1999. In 2003, TFT-LCDs outsold CRTs for the first time, becoming the primary technology used for computer monitors. The main advantages of LCDs over CRT displays are that LCDs consume less power, take up much less space, and are considerably lighter. The now common active matrix TFT-LCD technology also has less flickering than CRTs, which reduces eye strain.  On the other hand, CRT monitors have superior contrast, have a superior response time, are able to use multiple screen resolutions natively, and there is no discernible flicker if the refresh rate  is set to a sufficiently high value. LCD monitors have now very high temporal accuracy and can be used for vision research. Wang, P. and D. Nikolić An LCD monitor with sufficiently precise timing for research in vision. Frontiers in Human Neuroscience, 5:85.      ": null
    },
    {
        "High dynamic range": "High Dynamic Range"
    },
    {
        " has been implemented into high-end LCD monitors to improve color accuracy. Since around the late 2000s, widescreen LCD monitors have become popular, in part due to ": null
    },
    {
        "television series": "Television Series"
    },
    {
        ", ": null
    },
    {
        "motion pictures": "Films"
    },
    {
        " and ": null
    },
    {
        "video games": "Video Game"
    },
    {
        "transitioning to high-definition , which makes standard-width monitors unable to display them correctly as they either stretch or crop HD content. These types of monitors may also display it in the proper width, however they usually fill the extra space at the top and bottom of the image with black bars. Other advantages of widescreen monitors over standard-width monitors is that they make work more productive by displaying more of a users documents and images, and allow displaying toolbars with documents. They also have a larger viewing area, with a typical widescreen monitor having a 16:9 aspect ratio, compared to the 4:3 aspect ratio of a typical standard-width monitor.            ": null
    },
    {
        "Organic light-emitting diode": "Organic Light-Emitting Diode"
    },
    {
        " monitors provide higher contrast and better viewing angles than LCDs but they require more power when displaying documents with white or bright backgrounds and have a severe problem known as ": null
    },
    {
        "burn-i": "Screen Burn-In"
    },
    {
        "n.       The performance of a monitor is measured by the following parameters:   ": null
    },
    {
        "Luminance": "Luminance"
    },
    {
        " is measured in candelas per square meter .   ": null
    },
    {
        "Color depth": "Color Depth"
    },
    {
        " is measured in bits per primary color or bits for all colors.   ": null
    },
    {
        "Gamut": "Gamut"
    },
    {
        " is measured as coordinates in the ": null
    },
    {
        "CIE 1931 color space": "Cie 1931 Color Space"
    },
    {
        ". The names ": null
    },
    {
        "sRGB": "Srgb"
    },
    {
        " or ": null
    },
    {
        "AdobeRGB": "Adobe Rgb Color Space"
    },
    {
        " are shorthand notations.   ": null
    },
    {
        "Aspect ratio": "Display Aspect Ratio"
    },
    {
        " is the ratio of the horizontal length to the vertical length. Monitors usually have the aspect ratio ": null
    },
    {
        "4:3": "4:3"
    },
    {
        ", ": null
    },
    {
        "5:4": "5:4"
    },
    {
        ", ": null
    },
    {
        "16:10": "16:10"
    },
    {
        " or ": null
    },
    {
        "16:9": "16:9"
    },
    {
        ".   ": null
    },
    {
        "Viewable image size": "Viewable Image Size"
    },
    {
        " is usually measured diagonally, but the actual widths and heights are more informative since they are not affected by the aspect ratio in the same way. For CRTs, the viewable size is typically  smaller than the tube itself.   ": null
    },
    {
        "Display resolution": "Display Resolution"
    },
    {
        " is the number of distinct pixels in each dimension that can be displayed. For a given display size, maximum resolution is limited by dot pitch.   ": null
    },
    {
        "Dot pitch": "Dot Pitch"
    },
    {
        " is the distance between sub-pixels of the same color in millimeters. In general, the smaller the dot pitch, the sharper the picture will appear.   ": null
    },
    {
        "Refresh rate": "Refresh Rate"
    },
    {
        " is the number of times in a second that a display is illuminated. Maximum refresh rate is limited by response time.   ": null
    },
    {
        "Response time": "Response Time"
    },
    {
        " is the time a pixel in a monitor takes to go from active to inactive and back to active again, measured in milliseconds. Lower numbers mean faster transitions and therefore fewer visible image artifacts.   ": null
    },
    {
        "Contrast ratio": "Contrast Ratio"
    },
    {
        " is the ratio of the luminosity of the brightest color to that of the darkest color that the monitor is capable of producing.   ": null
    },
    {
        "Power consumption": "Power Consumption"
    },
    {
        " is measured in watts.   ": null
    },
    {
        "Delta-E": "Color Difference"
    },
    {
        "Viewing angle": "Viewing Angle"
    },
    {
        " is the maximum angle at which images on the monitor can be viewed, without excessive degradation to the image. It is measured in degrees horizontally and vertically.             On ": null
    },
    {
        "two-dimensional display devices": "Two-Dimensional Display Device"
    },
    {
        "such as computer monitors the display size or view able image size is the actual amount of screen space that is available to display a ": null
    },
    {
        "picture": "Picture"
    },
    {
        ", ": null
    },
    {
        "video": "Video"
    },
    {
        " or working space, without obstruction from the case or other aspects of the units ": null
    },
    {
        "design": "Design"
    },
    {
        ". The main measurements for display devices are: width, height, total area and the diagonal.     The size of a display is usually by monitor manufacturers given by the diagonal, i.e. the distance between two opposite screen corners. This method of measurement is inherited from the method used for the first generation of CRT television, when picture tubes with circular faces were in common use. Being circular, it was the external diameter of the glass envelope that described their size. Since these circular tubes were used to display rectangular images, the diagonal measurement of the rectangular image was smaller than the diameter of the tubes face . This method continued even when cathode ray tubes were manufactured as rounded rectangles; it had the advantage of being a single number specifying the size, and was not confusing when the aspect ratio was universally 4:3.     With the introduction of flat panel technology, the diagonal measurement became the actual diagonal of the visible display. This meant that an eighteen-inch LCD had a larger visible area than an eighteen-inch cathode ray tube.     The estimation of the monitor size by the distance between opposite corners does not take into account the ": null
    },
    {
        "display aspect ratio": "Display Aspect Ratio"
    },
    {
        ", so that for example a 16:9  ": null
    },
    {
        "widescreen": "Widescreen"
    },
    {
        " display has less ": null
    },
    {
        "area": "Area"
    },
    {
        ", than a  4:3 screen. The 4:3 screen has dimensions of  and area , while the widescreen is , .          Until about 2003, most computer monitors had a ": null
    },
    {
        "4:3": "4:3"
    },
    {
        " aspect ratio": "Display Aspect Ratio"
    },
    {
        " and some had ": null
    },
    {
        "5:4": "5:4"
    },
    {
        ". Between 2003 and 2006, monitors with ": null
    },
    {
        "16:9": "16:9"
    },
    {
        " and mostly ": null
    },
    {
        "16:10": "16:10"
    },
    {
        " aspect ratios became commonly available, first in ": null
    },
    {
        "laptops": "Laptop"
    },
    {
        "and later also in standalone monitors. Reasons for this transition was productive uses for such monitors, i.e. besides ": null
    },
    {
        "widescreen computer game play": "Field Of View In Video Games"
    },
    {
        " and movie viewing, are the word processor display of two standard letter pages side by side, as well as CAD displays of large-size drawings and CAD application menus at the same time. NEMATech Computer Display Standards   In 2008 16:10 became the most common sold aspect ratio for ": null
    },
    {
        "LCD monitors": "Lcd Monitor"
    },
    {
        "and the same year 16:10 was the mainstream standard for ": null
    },
    {
        "laptops": "Laptop"
    },
    {
        "and ": null
    },
    {
        "notebook computers": "Notebook Computers"
    },
    {
        ".      In 2010 the computer industry started to move over from ": null
    },
    {
        "16:10": "16:10"
    },
    {
        " to ": null
    },
    {
        "16:9": "16:9"
    },
    {
        " because 16:9 was chosen to be the standard ": null
    },
    {
        "high-definition television": "High-Definition Television"
    },
    {
        " display size, and because they were cheaper to manufacture.     In 2011 non-widescreen displays with 4:3 aspect ratios were only being manufactured in small quantities. According to Samsung this was because the Demand for the old Square monitors has decreased rapidly over the last couple of years, and I predict that by the end of 2011, production on all 4:3 or similar panels will be halted due to a lack of demand.   Mybroadband.co.za . Retrieved on 2011-12-24.          The resolution for computer monitors has increased over time. From 320x200 during the early 1980s, to 1024x768 during the late 1990s. Since 2009, the most commonly sold resolution for computer monitors is 1920x1080.  . Skinflint.co.uk. Retrieved on 2011-12-24. Before 2013 top-end consumer LCD monitors were limited to 2560x1600 at , excluding Apple products and CRT monitors. Apple introduced 2880x1800 with Retina MacBook Pro at  on June 12, 2012, and introduced a 5120x2880 Retina iMac at  on October 16, 2014. By 2015 most major display manufacturers had released 3840x2160 resolution displays.          Every RGB monitor has its own ": null
    },
    {
        "color gamut": "Color Gamut"
    },
    {
        ", bounded in ": null
    },
    {
        "chromaticity": "Chromaticity"
    },
    {
        " by a ": null
    },
    {
        "color triangle": "Color Triangle"
    },
    {
        ". Some of these triangles are smaller than the ": null
    },
    {
        "sRGB": "Srgb"
    },
    {
        " triangle, some are larger. Colors are typically encoded by 8 bits per primary color. The RGB value represents red, but slightly different colors in different color spaces such as ": null
    },
    {
        "AdobeRGB": "Adobe Rgb Color Space"
    },
    {
        " and sRGB. Displaying sRGB-encoded data on wide-gamut devices can give an unrealistic result.  The gamut is a property of the monitor; the image color space can be forwarded as ": null
    },
    {
        "Exif": "Exif"
    },
    {
        " metadata in the picture. As long as the monitor gamut is wider than the color space gamut, correct display is possible, if the monitor is calibrated. A picture that uses colors that are outside the sRGB color space will display on an sRGB color space monitor with limitations.  Still today, many monitors that can display the sRGB color space are not factory adjusted to display it correctly. ": null
    },
    {
        "Color management": "Color Management"
    },
    {
        " is needed both in ": null
    },
    {
        "electronic publishing": "Electronic Publishing"
    },
    {
        " and in ": null
    },
    {
        "desktop publishing": "Desktop Publishing"
    },
    {
        " targeted to print.           Most modern monitors will switch to a power-saving mode if no video-input signal is received. This allows modern operating systems to turn off a monitor after a specified period of inactivity. This also extends the monitors service life. Some monitors will also switch themselves off after a time period on standby.     Most modern laptops provide a method of screen dimming after periods of inactivity or when the battery is in use. This extends battery life and reduces wear.       Many monitors have other accessories integrated. This places ": null
    },
    {
        "standard ports": "Computer Port"
    },
    {
        " within easy reach and eliminates the need for another separate ": null
    },
    {
        "hub": "Usb Hub"
    },
    {
        ", ": null
    },
    {
        "camera": "Webcam"
    },
    {
        ", ": null
    },
    {
        "microphone": "Microphone"
    },
    {
        ", or set of ": null
    },
    {
        "speakers": "Computer Speaker"
    },
    {
        ". These monitors have advanced microprocessors which contain codec information, Windows Interface drivers and other small software which help in proper functioning of these functions.          Some displays, especially newer LCD monitors, replace the traditional anti-glare matte finish with a glossy one. This increases ": null
    },
    {
        "color saturation": "Color Saturation"
    },
    {
        " and sharpness but reflections from lights and windows are very visible. Anti-reflective coatings are sometimes applied to help reduce reflections, although this only mitigates the effect.       In about 2009, ": null
    },
    {
        "NEC": "Nec"
    },
    {
        "/": null
    },
    {
        "Alienware": "Alienware"
    },
    {
        " together with Ostendo Technologies were offering a curved  monitor that allows better viewing angles near the edges, covering 75% of ": null
    },
    {
        "peripheral vision": "Peripheral Vision"
    },
    {
        " in the horizontal direction. This monitor had 2880x900 resolution, LED backlight and was marketed as suitable both for gaming and office work, while for $6499 it was rather expensive.  . NEC/Alienware Curved Display Now Available While this particular monitor is no longer in production, most PC manufacturers now offer some sort of curved desktop display.       Narrow viewing angle screens are used in some security conscious applications.             Newer monitors are able to ": null
    },
    {
        "display a different image for each eye": "Stereoscopy"
    },
    {
        ", often with the help of special glasses, giving the perception of depth. An autostereoscopic screen can generate 3D images without headgear.          These monitors use touching of the screen as an input method. Items can be selected or moved with a finger, and finger gestures may be used to convey commands. The screen will need frequent cleaning due to image degradation from fingerprints.          A combination of a monitor with a ": null
    },
    {
        "graphics tablet": "Graphics Tablet"
    },
    {
        ". Such devices are typically unresponsive to touch without the use of one or more special tools pressure. Newer models however are now able to detect touch from any pressure and often have the ability to detect tilt and rotation as well.     Touch and tablet screens are used on LCDs as a substitute for the light pen, which can only work on CRTs.          Monitors that feature an aspect ratio of 21:9 as opposed to the more common 16:9.       Computer monitors are provided with a variety of methods for mounting them depending on the application and environment.       A desktop monitor is typically provided with a stand from the manufacturer which lifts the monitor up to a more ergonomic viewing height. The stand may be attached to the monitor using a proprietary method or may use, or be adaptable to, a ": null
    },
    {
        "Video Electronics Standards Association": "Video Electronics Standards Association"
    },
    {
        ", VESA, standard mount. Using a VESA standard mount allows the monitor to be used with an after-market stand once the original stand is removed. Stands may be fixed or offer a variety of features such as height adjustment, horizontal swivel, and landscape or portrait screen orientation.       The ": null
    },
    {
        "Flat Display Mounting Interface": "Flat Display Mounting Interface"
    },
    {
        " , also known as VESA Mounting Interface Standard or colloquially as a VESA mount, is a family of standards defined by the Video Electronics Standards Association for mounting ": null
    },
    {
        "flat panel": "Flat Panel"
    },
    {
        " monitor": "Computer Display"
    },
    {
        "s, ": null
    },
    {
        "TV": "Tv"
    },
    {
        "s, and other displays to stands or wall mounts.  It is implemented on most modern flat-panel monitors and TVs.     For Computer Monitors, the VESA Mount typically consists of four threaded holes on the rear of the display that will mate with an adapter bracket.       ": null
    },
    {
        "Rack mount": "19-Inch Rack"
    },
    {
        " computer monitors are available in two styles and are intended to be mounted into a 19-inch rack:        ;Fixed   A fixed rack mount monitor is mounted directly to the rack with the LCD visible at all times. The height of the unit is measured in rack units and 8U or 9U are most common to fit 17-inch or 19-inch LCDs. The front sides of the unit are provided with flanges to mount to the rack, providing appropriately spaced holes or slots for the rack mounting screws. A 19-inch diagonal LCD is the largest size that will fit within the rails of a 19-inch rack. Larger LCDs may be accommodated but are mount-on-rack and extend forward of the rack. There are smaller display units, typically used in broadcast environments, which fit multiple smaller LCDs side by side into one rack mount.        ;Stowable   A stowable rack mount monitor is ": null
    },
    {
        "1U, 2U or 3U": "Rack Unit"
    },
    {
        " high and is mounted on ": null
    },
    {
        "rack slides": "Linear-Motion Bearing"
    },
    {
        " allowing the display to be folded down and the unit slid into the rack for storage. The display is visible only when the display is pulled out of the rack and deployed. These units may include only a display or may be equipped with a keyboard creating a ": null
    },
    {
        "KVM": "Rackmount Kvm"
    },
    {
        " . Most common are systems with a single LCD but there are systems providing two or three displays in a single rack mount system.            A panel mount computer monitor is intended for mounting into a flat surface with the front of the display unit protruding just slightly. They may also be mounted to the rear of the panel. A flange is provided around the LCD, sides, top and bottom, to allow mounting. This contrasts with a rack mount display where the flanges are only on the sides. The flanges will be provided with holes for thru-bolts or may have studs welded to the rear surface to secure the unit in the hole in the panel. Often a gasket is provided to provide a water-tight seal to the panel and the front of the LCD will be sealed to the back of the front panel to prevent water and dirt contamination.       An open frame monitor provides the LCD monitor and enough supporting structure to hold associated electronics and to minimally support the LCD. Provision will be made for attaching the unit to some external structure for support and protection. Open frame LCDs are intended to be built into some other piece of equipment. An arcade video game would be a good example with the display mounted inside the cabinet. There is usually an open frame display inside all end-use displays with the end-use display simply providing an attractive protective enclosure. Some rack mount LCD manufacturers will purchase desktop displays, take them apart, and discard the outer plastic parts, keeping the inner open-frame LCD for inclusion into their product.       According to an NSA document leaked to ": null
    },
    {
        "Der Spiegel": "Der Spiegel"
    },
    {
        ", the NSA sometimes swaps the monitor cables on targeted computers with a bugged monitor cable in order to allow the NSA to remotely see what is being displayed on the targeted computer monitor.       ": null
    },
    {
        "Van Eck phreaking": "Van Eck Phreaking"
    },
    {
        " is the process of remotely displaying the contents of a CRT or LCD by detecting its electromagnetic emissions. It is named after Dutch computer researcher Wim van Eck, who in 1985 published the first paper on it, including proof of concept. Phreaking is the process of exploiting telephone networks, used here because of its connection to eavesdropping.": null
    }
]