[
    {
        "   Constantine Kanaris or Canaris  was a ": null
    },
    {
        "Greek": "Greece"
    },
    {
        " Prime Minister": "Prime Minister"
    },
    {
        ", ": null
    },
    {
        "admiral": "Admiral"
    },
    {
        " and ": null
    },
    {
        "politician": "Politician"
    },
    {
        " who in his youth was a ": null
    },
    {
        "freedom fighter": "Freedom Fighter"
    },
    {
        " in the ": null
    },
    {
        "Greek War of Independence": "Greek War Of Independence"
    },
    {
        ". Woodhouse, p. 129.            He was born and grew up on the island of ": null
    },
    {
        "Psara": "Psara"
    },
    {
        ", close to the island of ": null
    },
    {
        "Chios": "Chios"
    },
    {
        ", in the ": null
    },
    {
        "Aegean": "Aegean Sea"
    },
    {
        ". His exact year of birth is unknown. The official records of the ": null
    },
    {
        "Hellenic Navy": "Hellenic Navy"
    },
    {
        " indicate 1795 but modern Greek historians believe that 1793 is more probable.     Constantine was left an orphan at a young age. Having to support himself, he chose to become a seaman like most members of his family since the beginning of the 18th century. He was hired as a boy on the brig of his uncle Dimitris Bourekas.       Constantine gained his fame during the ": null
    },
    {
        "Greek War of Independence": "Greek War Of Independence"
    },
    {
        " . Unlike most other prominent figures of the War, he had never been initiated into the ": null
    },
    {
        "Filiki Eteria": "Filiki Eteria"
    },
    {
        " , which played a significant role in the revolution against the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        ", primarily by secret recruitment of supporters against the Empire.     By early 1821, it had gained enough support to declare a revolution. This declaration seems to have surprised Constantine, who was absent at Odessa. He returned to ": null
    },
    {
        "Psara": "Psara"
    },
    {
        " in haste and was there when the island joined the Revolution on 10 April 1821.     The island formed its own fleet of ships and the famed seamen of Psara, already known for their successful naval combats against ": null
    },
    {
        "pirates": "Pirate"
    },
    {
        "and their well-equipped ships, proved to be effective at full naval war. Constantine soon distinguished himself as a ": null
    },
    {
        "fire ship": "Fire Ship"
    },
    {
        " captain. Woodhouse, p. 138.          At ": null
    },
    {
        "Chios": "Chios"
    },
    {
        ", on the moonless night of 6-7 June 1822 forces under his command destroyed the flagship of the Turkish admiral ": null
    },
    {
        "Nasuhzade Ali Pasha": "Nasuhzade Ali Pasha"
    },
    {
        " in revenge for the ": null
    },
    {
        "Chios Massacre": "Chios Massacre"
    },
    {
        ". The admiral was holding a celebration , so Kanaris and his men managed to place a fire ship next to it without being noticed. When the flagships powder store caught fire, all men aboard were instantly killed. The Ottoman casualties comprised 2000 men, both naval officers and common sailors, as well as Kara-Ali himself.     Later in the year he led another successful attacks against the Turkish fleet at ": null
    },
    {
        "Tenedos": "Tenedos"
    },
    {
        " in November 1822.           The Turkish fleet ": null
    },
    {
        "captured Psara": "Destruction Of Psara"
    },
    {
        " on 21 June 1824. A part of the population, including Kanaris, managed to flee the island, but those who didnt were either sold into ": null
    },
    {
        "slave": "Slave"
    },
    {
        "ry or slaughtered.     After the destruction of his home island, Kanaris continued to lead his men into attacks against the Turks. He took part to sea fights in the Dodecanese in August 1824.     In August 1825, Kanaris led the ": null
    },
    {
        "raid on Alexandria": "Greek Raid On Alexandria"
    },
    {
        ", a daring attempt to destroy the Egyptian fleet via fire ships that might have been successful if the wind had not failed just after the Greek ships entered Alexandria harbor. Brewer, David The Greek War of Independence, London: Overlook Duckworth, 2011 page 244.     Following the end of the war and the independence of Greece, Constantine became an officer of the new Greek Navy, reaching the rank of admiral, and later became a prominent politician.            Constantine Kanaris was one of the few with the personal confidence of ": null
    },
    {
        "Ioannis Kapodistrias": "Ioannis Kapodistrias"
    },
    {
        " the first Head of State of independent Greece. Woodhouse, p. 152. Kanaris served as Minister in various governments and then as ": null
    },
    {
        "Prime Minister": "Prime Minister Of Greece"
    },
    {
        ", in the provisional government, from 11 March to 11 April 1844. He served a second term , and as Navy Minister in Mavrokordatos 1854 cabinet.     In 1862, he was one of the few War of Independence veterans that helped in the bloodless revolution that deposed King ": null
    },
    {
        "Otto of Greece": "Otto Of Greece"
    },
    {
        " and put Prince William of Denmark on the Greek throne as King ": null
    },
    {
        "George I of Greece": "George I Of Greece"
    },
    {
        ". Under George I, he served as a prime minister for a third term , fourth term  and fifth and last term .     Kanaris died on 2 September 1877 whilst still serving in office as Prime Minister. Following his death his government remained in power until 14 September 1877 without agreeing on a replacement at its head. He was buried in the ": null
    },
    {
        "First Cemetery of Athens": "First Cemetery Of Athens"
    },
    {
        ", where most Greek prime ministers and celebrated figures are also buried. After his death he was honored as a national hero.     To honour Kanaris, three ships of the ": null
    },
    {
        "Hellenic Navy": "Hellenic Navy"
    },
    {
        " have been named after him;   ; a ": null
    },
    {
        "Hunt-class Type III": "Hunt Class Destroyer"
    },
    {
        " destroyer, formerly HMS Hatherleigh, transferred from the Royal Navy on 18 December 1941.   ; a , formerly USS Stickell , transferred from the U.S. Navy on 1 July 1972.   ; an , formerly the HNLMS Jan van Brakel , bought from The Netherlands on 29 November 2002.          In 1817, he married Despina Maniatis, from a historical family of ": null
    },
    {
        "Psara": "Psara"
    },
    {
        ". They had seven children:   Nikolaos Kanaris, - a member of a military expeditionary force to Beirut, killed there in 1848.   Themistoklis Kanaris, - a member of a military expeditionary force to Egypt, killed there in 1851.   Thrasyvoulos Kanaris, - Admiral.   ": null
    },
    {
        "Miltiadis Kanaris": "Miltiadis Kanaris"
    },
    {
        ", - Admiral, member of the Greek Parliament for many years, Naval Minister three times in 1864, 1871, and 1878.   Lykourgos Kanaris, - Lawyer   Maria Kanari, - married A. Balambano.   ": null
    },
    {
        "Aristeidis Kanaris": "Aristeidis Kanaris"
    },
    {
        ", - officer killed in the uprising of 1863.     ": null
    },
    {
        "Wilhelm Canaris": "Wilhelm Canaris"
    },
    {
        ", a German Admiral, speculated that he might be a descendant of Constantine Kanaris. An official genealogical family history that was researched in 1938 showed that he was unrelated and that his family was from Italy. ": null
    }
]