[
    {
        "   In fiction, continuity is consistency of the characteristics of people, plot, objects, and places seen by the reader or viewer over some period of time. It is relevant to several media.     Continuity is particularly a concern in the production of film and television due to the difficulty of rectifying an error in continuity after shooting has wrapped up. It also applies to other art forms, including novels, comics, and ": null
    },
    {
        "video games": "Video Games"
    },
    {
        ", though usually on a smaller scale. It also applies to fiction used by persons, corporations, and governments in the public eye.     Most productions have a ": null
    },
    {
        "script supervisor": "Script Supervisor"
    },
    {
        " on hand whose job is to pay attention to and attempt to maintain continuity across the chaotic and typically non-linear production shoot. This takes the form of a large amount of paperwork, photographs, and attention to and memory of large quantities of detail, some of which is sometimes assembled into the ": null
    },
    {
        "story bible": "Bible"
    },
    {
        " for the production. It usually regards factors both within the scene and often even technical details including meticulous records of camera positioning and equipment settings. The use of a ": null
    },
    {
        "Polaroid camera": "Polaroid Camera"
    },
    {
        " was standard but has since been replaced by ": null
    },
    {
        "digital cameras": "Digital Camera"
    },
    {
        ". All of this is done so that, ideally, all related shots can match, despite perhaps parts being shot thousands of miles and several months apart. It is an inconspicuous job because if done perfectly, no one will ever notice.     In comic books, continuity has also come to mean a ": null
    },
    {
        "set of contiguous events": "Canon"
    },
    {
        ", sometimes said to be set in the same ": null
    },
    {
        "universe": "Fictional Universe"
    },
    {
        ".        Most continuity errors are subtle and minor, such as changes in the level of drink in a characters glass or the length of a cigarette, and can be permitted with relative indifference even to the final cut. Others can be more noticeable, such as sudden drastic changes in appearance of a character. Such errors in continuity can ruin the illusion of realism and affect ": null
    },
    {
        "suspension of disbelief": "Suspension Of Disbelief"
    },
    {
        ".     In cinema, special attention must be paid to continuity because films are rarely shot in the order in which they are presented. The shooting schedule is often dictated by location permit issues. For example, a character may return to ": null
    },
    {
        "Times Square": "Times Square"
    },
    {
        " in New York City several times throughout a movie, but as it is extraordinarily expensive to close off Times Square, those scenes will likely be filmed all at once to reduce permit costs. Weather, the ambience of natural light, cast and crew availability, or any number of other circumstances can also influence a shooting schedule.      Measures against continuity errors in film ": null
    },
    {
        "Polaroid": "Polaroid Corporation"
    },
    {
        " cameras, now done with digital cameras and cell phones as wellas the shooting is indoors1963filmed from slightly above and to the frontfilmed from behind Jackiefilmed in 1976Mickey RooneySean MarshallHelen Reddyusually a ": null
    },
    {
        "breakout character": "Breakout Character"
    },
    {
        ", as in the case of ": null
    },
    {
        "Frasier Crane": "Frasier Crane"
    },
    {
        "sometimes heard as Even Homer nods": null
    },
    {
        "n of Amynt": "N Of Amynt"
    },
    {
        "ammatical numb": "Ammatical Numb"
    },
    {
        " the two of them came forward usually a child or teenagerTV seriesTV Series1933 film": null
    },
    {
        "lmmaki": "Lmmaki"
    },
    {
        "a ": null
    },
    {
        "Napoleon": "Napoleon"
    },
    {
        "ic hat, a ": null
    },
    {
        "Prussia": "Prussia"
    },
    {
        "n hat, etc.": null
    },
    {
        "cti": "Cti"
    },
    {
        "a term originally coined by the author ": null
    },
    {
        "Craig Hinton": "Craig Hinton"
    },
    {
        " to describe excessive use of continuitysuch as the death of a favorite character": null
    },
    {
        "cti": "Cti"
    },
    {
        "cti": "Cti"
    },
    {
        "continualityTV series": null
    }
]