[
    {
        "                 Courtney Michelle Love  is an American singer, songwriter and actress. A figure in the ": null
    },
    {
        "punk": "Punk Rock"
    },
    {
        " and ": null
    },
    {
        "grunge": "Grunge"
    },
    {
        " scenes of the 1990s, Loves career has spanned four decades. She rose to prominence as the ": null
    },
    {
        "lead vocalist": "Lead Vocalist"
    },
    {
        " of the ": null
    },
    {
        "alternative rock": "Alternative Rock"
    },
    {
        " band ": null
    },
    {
        "Hole": "Hole"
    },
    {
        ", which she formed in 1989. Love has drawn public attention for her uninhibited live performances and confrontational lyrics, as well as her highly publicized personal life following her marriage to ": null
    },
    {
        "Nirvana": "Nirvana"
    },
    {
        " frontman ": null
    },
    {
        "Kurt Cobain": "Kurt Cobain"
    },
    {
        ".     Born to ": null
    },
    {
        "countercultural": "Counterculture"
    },
    {
        " parents in ": null
    },
    {
        "San Francisco": "San Francisco"
    },
    {
        ", Love had an itinerant childhood, but was primarily raised in ": null
    },
    {
        "Portland, Oregon": "Portland, Oregon"
    },
    {
        ", where she played in a series of short-lived bands and was active in the local punk scene. After briefly being in a juvenile hall, she spent a year living in ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        " and ": null
    },
    {
        "Liverpool": "Liverpool"
    },
    {
        " before returning to the United States and was cast in the ": null
    },
    {
        "Alex Cox": "Alex Cox"
    },
    {
        " films  Sid and Nancy  and  Straight to Hell  . She formed Hole in Los Angeles, receiving attention from underground rock press for the groups ": null
    },
    {
        "1991 debut album": "Pretty On The Inside"
    },
    {
        ", produced by ": null
    },
    {
        "Kim Gordon": "Kim Gordon"
    },
    {
        ". Holes second release,  Live Through This  , was met with critical accolades and ": null
    },
    {
        "multi-platinum": "Riaa Certification"
    },
    {
        " sales. In 1995, Love returned to acting, earning a ": null
    },
    {
        "Golden Globe Award": "Golden Globe Award For Best Actress In A Motion Picture – Drama"
    },
    {
        " nomination for her performance as ": null
    },
    {
        "Althea Leasure": "Althea Flynt"
    },
    {
        " in ": null
    },
    {
        "Miloš Formans": "Miloš Forman"
    },
    {
        "  The People vs. Larry Flynt  , which established her as a mainstream actress. The following year, Holes third album,  Celebrity Skin  , was nominated for three ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        "s.     Love continued to work as an actress into the early 2000s, appearing in big-budget pictures such as  Man on the Moon  and  Trapped  , before releasing her first solo album,  Americas Sweetheart , in 2004. The next years were marked by publicity surrounding Loves legal troubles and ": null
    },
    {
        "drug addiction": "Drug Addiction"
    },
    {
        ", which resulted in a mandatory lockdown ": null
    },
    {
        "rehabilitation": "Drug Rehabilitation"
    },
    {
        " sentence in 2005 while she was writing a second solo album. That project became  Nobodys Daughter , released in 2010 as a Hole album but without the former Hole lineup. Between 2014 and 2015, Love released two solo ": null
    },
    {
        "singles": "Single"
    },
    {
        " and returned to acting in the network series  Sons of Anarchy  and  Empire .     Love has also been active as a writer; she co-created and co-wrote three volumes of a ": null
    },
    {
        "manga": "Manga"
    },
    {
        ",  Princess Ai , between 2004 and 2006, and wrote a memoir,  Dirty Blonde: The Diaries of Courtney Love  .         Courtney Michelle Harrison was born on July 9, 1964, at ": null
    },
    {
        "Saint Francis Memorial Hospital": "Saint Francis Memorial Hospital"
    },
    {
        " in ": null
    },
    {
        "San Francisco": "San Francisco"
    },
    {
        ", California, the first child of psychotherapist ": null
    },
    {
        "Linda Carroll": "Linda Carroll"
    },
    {
        " and Hank Harrison, a publisher and road manager for the ": null
    },
    {
        "Grateful Dead": "Grateful Dead"
    },
    {
        ". Loves ": null
    },
    {
        "godfather": "Godparent"
    },
    {
        " is the founding Grateful Dead bassist ": null
    },
    {
        "Phil Lesh": "Phil Lesh"
    },
    {
        ". Her mother, who was adopted at birth and raised by a prominent ": null
    },
    {
        "Italian": "Italians"
    },
    {
        "-": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        " family in San Francisco, was later revealed to be the biological daughter of novelist ": null
    },
    {
        "Paula Fox": "Paula Fox"
    },
    {
        ";   Loves maternal great-grandmother was screenwriter ": null
    },
    {
        "Elsie Fox": "Elsie Fox"
    },
    {
        ".  According to Love, she was named after Courtney Farrell, the protagonist of ": null
    },
    {
        "Pamela Moores": "Pamela Moore"
    },
    {
        "1956 novel  Chocolates for Breakfast .  She is of ": null
    },
    {
        "Cuban": "Cubans"
    },
    {
        ", ": null
    },
    {
        "English": "English People"
    },
    {
        ", ": null
    },
    {
        "German": "Germans"
    },
    {
        ", ": null
    },
    {
        "Irish": "Irish People"
    },
    {
        ", and ": null
    },
    {
        "Welsh": "Welsh People"
    },
    {
        " descent.         Love spent her early years in the ": null
    },
    {
        "Haight-Ashbury": "Haight-Ashbury"
    },
    {
        " district of San Francisco until her parents 1969 divorce, spurred by her mothers allegations that her father had fed Courtney ": null
    },
    {
        "LSD": "Lsd"
    },
    {
        " when she was a toddler. Though he denied the claim, full custody of Love was awarded to her mother.  In 1970, Carroll relocated with Love to the rural community of ": null
    },
    {
        "Marcola, Oregon": "Marcola, Oregon"
    },
    {
        " where they lived along the ": null
    },
    {
        "Mohawk River": "Mohawk River"
    },
    {
        " while she completed her psychology degree at the ": null
    },
    {
        "University of Oregon": "University Of Oregon"
    },
    {
        ". There, Love was adopted by her then-stepfather, Frank Rodriguez. He and her mother had two daughters and a son who died in infancy of a ": null
    },
    {
        "heart defect": "Heart Defect"
    },
    {
        " when Love was ten; they also adopted a boy. Love attended a ": null
    },
    {
        "Montessori school": "Montessori Education"
    },
    {
        " in ": null
    },
    {
        "Eugene": "Eugene, Oregon"
    },
    {
        ", where she struggled academically and had trouble making friends.  At age nine, a psychologist noted that she exhibited signs of ": null
    },
    {
        "autism": "Autism"
    },
    {
        ".     In 1972, Loves mother divorced Rodriguez, remarried, and moved the family to ": null
    },
    {
        "Nelson": "Nelson, New Zealand"
    },
    {
        ", New Zealand. There, she enrolled Love at ": null
    },
    {
        "Nelson College for Girls": "Nelson College For Girls"
    },
    {
        ",  from which she was soon expelled. In 1973, she was sent back to live in the United States, where she was raised in ": null
    },
    {
        "Portland, Oregon": "Portland, Oregon"
    },
    {
        " by her former stepfather and other family friends.  During this time, her mother gave birth to two of Loves other half-brothers. At age fourteen, she was arrested for shoplifting a T-shirt from a ": null
    },
    {
        "Woolworths": "F. W. Woolworth Company"
    },
    {
        ",  and was sent to ": null
    },
    {
        "Hillcrest Correctional Facility": "Hillcrest Youth Correctional Facility"
    },
    {
        ", a juvenile hall in ": null
    },
    {
        "Salem": "Salem, Oregon"
    },
    {
        ", Oregon.  She was subsequently placed in ": null
    },
    {
        "foster care": "Foster Care In The United States"
    },
    {
        " until she became legally emancipated at age 16. She supported herself by working illegally as a topless dancer  at ": null
    },
    {
        "Marys Club": "Marys Club"
    },
    {
        " in downtown Portland adopting the last name Love to conceal her identity; she later adopted Love as her surname.  She also worked various odd jobs, including picking berries at a farm in ": null
    },
    {
        "Troutdale, Oregon": "Troutdale, Oregon"
    },
    {
        ",   and as a disc jockey at a gay disco. During this time, she enrolled at ": null
    },
    {
        "Portland State University": "Portland State University"
    },
    {
        ", studying English and philosophy.  Love has said that she didnt have a lot of social skills,  and that she learned them while frequenting gay clubs and spending time with ": null
    },
    {
        "drag queen": "Drag Queen"
    },
    {
        "s.     In 1981, she was granted a small ": null
    },
    {
        "trust fund": "United States Trust Law"
    },
    {
        " that had been left by her adoptive grandparents, which she used to travel to ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        ", Ireland, where her biological father was living. While there, she enrolled in courses at ": null
    },
    {
        "Trinity College": "Trinity College, Dublin"
    },
    {
        ", studying theology for two semesters.  She would later receive ": null
    },
    {
        "honorary patronage": "Honorary Degree"
    },
    {
        " from Trinitys ": null
    },
    {
        "University Philosophical Society": "University Philosophical Society"
    },
    {
        " in 2010.  After leaving Trinity, Love relocated to ": null
    },
    {
        "Liverpool": "Liverpool"
    },
    {
        ", where she became acquainted with musician ": null
    },
    {
        "Julian Cope": "Julian Cope"
    },
    {
        " and his band, ": null
    },
    {
        "The Teardrop Explodes": "The Teardrop Explodes"
    },
    {
        ", and briefly lived in his house. They kind of took me in , she recalled. I was sort of a mascot; I would get them coffee or tea during rehearsal.  In Copes autobiography Head-On, Love is referred to as the adolescent.  After spending a year abroad, Love returned to Portland: I thought that was my peak life experience, she said in 2011. —that nothing else happen to me again.  In 1983, she took short-lived jobs working as an erotic dancer in Japan and later Taiwan, but was ": null
    },
    {
        "deported": "Deportation"
    },
    {
        " after the club was shut down by the government.       Love began several music projects in the 1980s, first forming Sugar Babylon  in Portland with her friends Ursula Wehr and Robin Barbur. In 1982, Love attended a ": null
    },
    {
        "Faith No More": "Faith No More"
    },
    {
        " concert in San Francisco and convinced the members to let her join as a singer.  The group recorded material with Love as a vocalist, but she was subsequently kicked out of the band. According to the Faith No More keyboardist ": null
    },
    {
        "Roddy Bottum": "Roddy Bottum"
    },
    {
        ", who remained Loves friend in the years after, the band wanted a male energy.         She later formed the ": null
    },
    {
        "Pagan Babies": "Pagan Babies"
    },
    {
        " with friend ": null
    },
    {
        "Kat Bjelland": "Kat Bjelland"
    },
    {
        ", whom she met at the ": null
    },
    {
        "Satyricon": "Satyricon"
    },
    {
        " club in Portland in 1984. As Love later reflected, The best thing that ever happened to me in a way, was Kat.  Love asked Bjelland to start a band with her as a guitarist, and the two moved to San Francisco in June 1985, where they recruited bassist ": null
    },
    {
        "Jennifer Finch": "Jennifer Finch"
    },
    {
        " and drummer ": null
    },
    {
        "Janis Tanaka": "Janis Tanaka"
    },
    {
        ".  According to Bjelland, didnt play an instrument at the time aside from keyboards, so Bjelland would transcribe Loves musical ideas on guitar for her. The group played several house shows and recorded one 4-track ": null
    },
    {
        "demo": "Demo"
    },
    {
        " before disbanding in late 1985.  After Pagan Babies, Love moved to Minneapolis, where Bjelland had formed the group ": null
    },
    {
        "Babes in Toyland": "Babes In Toyland"
    },
    {
        ", and briefly worked as a concert promoter before returning to California. Drummer Lori Barbero and bassist Maureen Herman recalled Courtneys departure She lived in my house for a little while. And then we did a concert at the Orpheum. It was in 1988. It was called O-88 with Butthole Surfers, Cows & Bastards, Run Westy Run, and Babes in Toyland. And I guess Maureen took Courtney to the airport after she stole all the money. She stayed and stayed, and then the next day she wanted me to take her to the airport. And so I drove her to the airport. She had just had some weird fight with the guy at the desk, and then she left. She said, “Im going to go to L.A. and Im going to get my face done and Im going to be famous. - And then she did      Deciding to shift her focus to acting, Love enrolled at the ": null
    },
    {
        "San Francisco Art Institute": "San Francisco Art Institute"
    },
    {
        "  and studied film under experimental director ": null
    },
    {
        "George Kuchar": "George Kuchar"
    },
    {
        ".   Love was featured in one of his short films, titled Club Vatican.    In 1985 she submitted an audition tape for the role of ": null
    },
    {
        "Nancy Spungen": "Nancy Spungen"
    },
    {
        " in the ": null
    },
    {
        "Sid Vicious": "Sid Vicious"
    },
    {
        " biopic  Sid and Nancy  , and was given a minor supporting role by director ": null
    },
    {
        "Alex Cox": "Alex Cox"
    },
    {
        ".   After filming Sid and Nancy in New York City, she worked at a ": null
    },
    {
        "peep show": "Peep Show"
    },
    {
        " in ": null
    },
    {
        "Times Square": "Times Square"
    },
    {
        " and ": null
    },
    {
        "squatted": "Squatting"
    },
    {
        " at the ": null
    },
    {
        "ABC No Rio": "Abc No Rio"
    },
    {
        " social center and ": null
    },
    {
        "Pyramid Club": "Pyramid Club"
    },
    {
        " in the ": null
    },
    {
        "East Village": "East Village, Manhattan"
    },
    {
        ".   The same year, Cox cast her in a leading role in his film  Straight to Hell  , a ": null
    },
    {
        "spaghetti western": "Spaghetti Western"
    },
    {
        " starring ": null
    },
    {
        "Joe Strummer": "Joe Strummer"
    },
    {
        " and ": null
    },
    {
        "Grace Jones": "Grace Jones"
    },
    {
        " filmed in Spain in 1986. The film caught the attention of ": null
    },
    {
        "Andy Warhol": "Andy Warhol"
    },
    {
        ", who featured Love in an episode of  Andy Warhols Fifteen Minutes .  She also had a part in the 1988 ": null
    },
    {
        "Ramones": "Ramones"
    },
    {
        " music video for ": null
    },
    {
        "I Wanna Be Sedated": "I Wanna Be Sedated"
    },
    {
        ", appearing as a bride among dozens of party guests.        In 1988, Love aborted her acting career and left New York, returning to the West Coast, citing the ": null
    },
    {
        "celebutante": "Celebutante"
    },
    {
        " fame shed attained as the central reason. She returned to stripping in the small town of ": null
    },
    {
        "McMinnville, Oregon": "Mcminnville, Oregon"
    },
    {
        ", where she was recognized by customers at the bar. This prompted Love to go into isolation, so she relocated to ": null
    },
    {
        "Anchorage, Alaska": "Anchorage, Alaska"
    },
    {
        ", where she lived for three months to gather her thoughts, supporting herself by working at a strip club frequented by local fishermen. I decided to move to Alaska because I needed to get my shit together and learn how to work , she said in retrospect. So I went on this sort of ": null
    },
    {
        "vision quest": "Vision Quest"
    },
    {
        ". I got rid of all my earthly possessions. I had my bad little strip clothes and some big sweaters, and I moved into a trailer with a bunch of other strippers.                   At the end of 1988, Love taught herself to play guitar and relocated to Los Angeles, where she placed an ad in a local music zine: I want to start a band. My influences are ": null
    },
    {
        "Big Black": "Big Black"
    },
    {
        ", ": null
    },
    {
        "Sonic Youth": "Sonic Youth"
    },
    {
        ", and ": null
    },
    {
        "Fleetwood Mac": "Fleetwood Mac"
    },
    {
        ".  Love recruited lead guitarist ": null
    },
    {
        "Eric Erlandson": "Eric Erlandson"
    },
    {
        "; Lisa Roberts, her neighbor, as bassist; and drummer Caroline Rue, whom she met at a ": null
    },
    {
        "Gwar": "Gwar"
    },
    {
        " concert. Love named the band ": null
    },
    {
        "Hole": "Hole"
    },
    {
        " after a line from ": null
    },
    {
        "Euripides": "Euripides"
    },
    {
        "  Medea    as well as a conversation she had had with her mother, in which she told her that she couldnt live her life with a hole running through her.  Loves marriage to James Moreland  was brief, ending in an ": null
    },
    {
        "annulment": "Annulment"
    },
    {
        ".  After forming Hole, she and bandmate Eric Erlandson had a romantic relationship that lasted over a year.     In the bands formative stages, Love continued to work at strip clubs in Hollywood ,saving money to purchase ": null
    },
    {
        "backline": "Backline"
    },
    {
        " equipment and a touring van,  while rehearsing at a studio in Hollywood that was loaned to her by the ": null
    },
    {
        "Red Hot Chili Peppers": "Red Hot Chili Peppers"
    },
    {
        ". Hole played their first show in November 1989 at ": null
    },
    {
        "Rajis": "Rajis"
    },
    {
        ", a rock club in central Hollywood. The bands debut single, ": null
    },
    {
        "Retard Girl": "Retard Girl"
    },
    {
        " , was issued in April 1990 through the Long Beach indie label ": null
    },
    {
        "Sympathy for the Record Industry": "Sympathy For The Record Industry"
    },
    {
        ", and was given airtime by ": null
    },
    {
        "Rodney Bingenheimers": "Rodney Bingenheimer"
    },
    {
        "show on local rock station ": null
    },
    {
        "KROQ": "Kroq-Fm"
    },
    {
        ". That fall, the band appeared on the cover of  Flipside , a Los Angeles-based punk ": null
    },
    {
        "fanzine": "Fanzine"
    },
    {
        ". In early 1991, the band released their second single, ": null
    },
    {
        "Dicknail": "Dicknail"
    },
    {
        " , through ": null
    },
    {
        "Sub Pop Records": "Sub Pop Records"
    },
    {
        ".         With ": null
    },
    {
        "no wave": "No Wave"
    },
    {
        ", ": null
    },
    {
        "noise rock": "Noise Rock"
    },
    {
        " and ": null
    },
    {
        "grindcore": "Grindcore"
    },
    {
        " bands being major influences on Love, Holes first studio album,  Pretty on the Inside , captured a particularly abrasive sound and contained disturbing, graphic lyrics,     described by  Q  magazine as confrontational genuinely uninhibited.  The record was released in September 1991 on ": null
    },
    {
        "Caroline Records": "Caroline Records"
    },
    {
        ", produced by ": null
    },
    {
        "Kim Gordon": "Kim Gordon"
    },
    {
        " of Sonic Youth with assistant production from ": null
    },
    {
        "Gumballs": "Gumball"
    },
    {
        "Don Fleming; Love and Gordon had initially met when Hole opened for Sonic Youth during their promotional tour for  Goo  at the ": null
    },
    {
        "Whisky a Go Go": "Whisky A Go Go"
    },
    {
        " in November 1990.  In early 1991, Love sent Gordon a personal letter asking her to produce the record for the band, to which she agreed.      Though Love would later say Pretty on the Inside was unlistenable and elodic,  the album received generally positive critical reception from indie and punk rock critics and was labeled one of the twenty best albums of the year by  Spin  magazine.   It also gained a following in the United Kingdom, charting at 59 on the ": null
    },
    {
        "UK Albums Chart": "Uk Albums Chart"
    },
    {
        ",  and its lead single, ": null
    },
    {
        "Teenage Whore": "Teenage Whore"
    },
    {
        " , entered the countrys indie chart at number one.  The underlying feminist slant of some of the albums songs led many to mistakenly tag the band as being part of the ": null
    },
    {
        "riot grrrl": "Riot Grrrl"
    },
    {
        " movement, a movement with which Love did not associate.    The band toured in support of the record, headlining with ": null
    },
    {
        "Mudhoney": "Mudhoney"
    },
    {
        " in Europe; in the United States, they opened for ": null
    },
    {
        "the Smashing Pumpkins": "The Smashing Pumpkins"
    },
    {
        ", and performed at ": null
    },
    {
        "CBGB": "Cbgb"
    },
    {
        " in New York City.      During this tour, Love briefly dated ": null
    },
    {
        "Billy Corgan": "Billy Corgan"
    },
    {
        " of the rock band the Smashing Pumpkins before formally dating ": null
    },
    {
        "Nirvana": "Nirvana"
    },
    {
        " frontman ": null
    },
    {
        "Kurt Cobain": "Kurt Cobain"
    },
    {
        ".  It is uncertain when they first met, and there are ": null
    },
    {
        "varying accounts": "Cobain"
    },
    {
        " of how they came to know one another. Journalist ": null
    },
    {
        "Michael Azerrad": "Michael Azerrad"
    },
    {
        " states that the two met in 1989 at the ": null
    },
    {
        "Satyricon": "Satyricon"
    },
    {
        " nightclub in Portland, Oregon, though Cobain biographer ": null
    },
    {
        "Charles Cross": "Charles R. Cross"
    },
    {
        " has claimed the date was actually February 12, 1990, and that Cobain playfully wrestled Love to the floor after she commented to him in passing that he looked like ": null
    },
    {
        "Dave Pirner": "Dave Pirner"
    },
    {
        " of ": null
    },
    {
        "Soul Asylum": "Soul Asylum"
    },
    {
        ". According to Love, she first met him at a ": null
    },
    {
        "Dharma Bums": "Dharma Bums"
    },
    {
        " show in Portland, while Loves bandmate Eric Erlandson stated that both he and Love were formally introduced to Cobain in a parking lot after a ": null
    },
    {
        "Butthole Surfers": "Butthole Surfers"
    },
    {
        "/": null
    },
    {
        "L7": "L7"
    },
    {
        " concert at the ": null
    },
    {
        "Hollywood Palladium": "Hollywood Palladium"
    },
    {
        " on May 17, 1991. Sometime in late 1991, Love and Cobain became re-acquainted through ": null
    },
    {
        "Jennifer Finch": "Jennifer Finch"
    },
    {
        ", one of Loves longtime friends and former bandmates. and were officially a couple by the close of 1991.       Live Through This and breakthrough     Shortly after completing the tour for Pretty on the Inside, Love married Cobain on ": null
    },
    {
        "Waikiki Beach": "Waikiki Beach"
    },
    {
        " in ": null
    },
    {
        "Honolulu": "Honolulu"
    },
    {
        ", Hawaii on February 24, 1992. She wore a satin and lace dress once owned by actress ": null
    },
    {
        "Frances Farmer": "Frances Farmer"
    },
    {
        ", and Cobain wore plaid pajamas. During Loves pregnancy, Hole recorded a cover of Over the Edge for a ": null
    },
    {
        "Wipers": "Wipers"
    },
    {
        " tribute album,  and recorded their fourth single, ": null
    },
    {
        "Beautiful Son": "Beautiful Son"
    },
    {
        " , which was released in April 1993. On August 18 of that year, the couples only child, a daughter, ": null
    },
    {
        "Frances Bean Cobain": "Frances Bean Cobain"
    },
    {
        ", was born in Los Angeles.  The couple subsequently relocated to ": null
    },
    {
        "Carnation, Washington": "Carnation, Washington"
    },
    {
        " and then to ": null
    },
    {
        "Seattle": "Seattle"
    },
    {
        ".       Loves first major media exposure came in a September 1992 profile of herself and Cobain for  Vanity Fair  by journalist Lynn Hirschberg, entitled Strange Love.  After being asked to participate in a cover story for the magazine, Love was urged by her manager to accept the request. In the year prior, Love and Cobain had developed a ": null
    },
    {
        "heroin": "Heroin"
    },
    {
        " addiction, and the profile painted the couple in an unflattering light and suggested that Love had been addicted to heroin during her pregnancy. The article ultimately resulted in the Los Angeles ": null
    },
    {
        "Department of Children and Family Services": "Department Of Children And Family Services"
    },
    {
        " investigating, and custody of Love and Cobains newborn daughter, Frances, was temporarily awarded to Loves sister, Jaimee. Love claimed she was misquoted by Hirschberg, and asserted that she had immediately quit using heroin during her ": null
    },
    {
        "first trimester": "First Trimester"
    },
    {
        " after she discovered she was pregnant.   Love would later claim that the publication of the article had serious implications for her marriage as well as Cobains mental state, suggesting it was a factor in his suicide.         On September 8, 1993, Love and Cobain made their only public performance together at the Rock Against Rape benefit in Hollywood, performing two ": null
    },
    {
        "acoustic": "Acoustic Music"
    },
    {
        " duets of ": null
    },
    {
        "Pennyroyal Tea": "Pennyroyal Tea"
    },
    {
        " and ": null
    },
    {
        "Where Did You Sleep Last Night": "Where Did You Sleep Last Night"
    },
    {
        ".   Love also performed electric versions of two new Hole songs, ": null
    },
    {
        "Doll Parts": "Doll Parts"
    },
    {
        " and ": null
    },
    {
        "Miss World": "Miss World"
    },
    {
        ", both written for the bands upcoming second album. In October 1993, Hole recorded their second album,  Live Through This , in Atlanta. The album featured a new lineup with bassist ": null
    },
    {
        "Kristen Pfaff": "Kristen Pfaff"
    },
    {
        " and drummer ": null
    },
    {
        "Patty Schemel": "Patty Schemel"
    },
    {
        ". Live Through This was released on ": null
    },
    {
        "Geffens": "Geffen Records"
    },
    {
        "subsidiary label ": null
    },
    {
        "DGC": "Dgc Records"
    },
    {
        " in April 1994, four days after ": null
    },
    {
        "Cobain died": "Death Of Kurt Cobain"
    },
    {
        " of a self-inflicted gunshot wound in their Seattle home while Love was in rehab in Los Angeles. In the following months, Love was rarely seen in public, holing up in her Seattle home with friends and family members. After the ": null
    },
    {
        "cremation": "Cremation"
    },
    {
        " of Cobains remains, Love divided portions of his ashes, keeping some in a teddy bear and some in an urn.  In June 1994, she traveled to the ": null
    },
    {
        "Namgyal Buddhist Monastery": "Namgyal Monastery Institute Of Buddhist Studies"
    },
    {
        " in ": null
    },
    {
        "Ithaca, New York": "Ithaca, New York"
    },
    {
        ", where she had his ashes ceremonially blessed by ": null
    },
    {
        "Buddhist": "Buddhism"
    },
    {
        " monks, and a portion were mixed into clay which was made into memorial sculptures. On June 16, 1994, Holes bassist Kristen Pfaff died of a heroin overdose in Seattle.  For the bands impending tour, Love recruited Canadian bassist ": null
    },
    {
        "Melissa Auf der Maur": "Melissa Auf Der Maur"
    },
    {
        ".     Live Through This was a commercial and critical success,   hitting ": null
    },
    {
        "platinum RIAA certification": "Music Recording Sales Certification"
    },
    {
        " in April 1995 and receiving numerous critical accolades. The success of the record combined with Cobains suicide resulted in a high level of publicity for Love, and she was featured on ": null
    },
    {
        "Barbara Walters": "Barbara Walters"
    },
    {
        "  10 Most Fascinating People  in 1995. Simultaneously, her erratic onstage behavior and various legal troubles during Holes 1994–1995 world tour compounded the media coverage of her.      Holes performance on August 26, 1994 at the ": null
    },
    {
        "Reading Festival": "Reading Festival"
    },
    {
        "— Loves first public performance following Cobains death   —was described by ": null
    },
    {
        "MTV": "Mtv"
    },
    {
        " as by turns macabre, frightening and inspirational.  ": null
    },
    {
        "John Peel": "John Peel"
    },
    {
        " wrote in  The Guardian  that Loves disheveled appearance would have drawn whistles of astonishment in ": null
    },
    {
        "Bedlam": "Bethlem Royal Hospital"
    },
    {
        " , and that her performance verged on the heroic  ... Love steered her band through a set which dared you to pity either her recent history or that of the band  ... the band teetered on the edge of chaos, generating a tension which I cannot remember having felt before from any stage.  The band performed a series of riotous concerts over the following year, with Love frequently appearing hysterical onstage, ": null
    },
    {
        "flashing": "Exhibitionism"
    },
    {
        " crowds, ": null
    },
    {
        "stage diving": "Stage Diving"
    },
    {
        ", and getting into fights with audience members.  One journalist reported that at the bands show in Boston in December 1994, Love interrupted the music and talked about her deceased husband Kurt Cobain, and also broke out into ": null
    },
    {
        "Tourette syndrome": "Tourette Syndrome"
    },
    {
        "-like rants. The music was great, but the raving was vulgar and offensive, and prompted some of the audience to shout back at her.      The tour was also marked by a series of legal troubles for Love: In January 1995, she was arrested in ": null
    },
    {
        "Melbourne": "Melbourne"
    },
    {
        " for disrupting a ": null
    },
    {
        "Qantas": "Qantas"
    },
    {
        " Airways flight after getting into an argument with a stewardess.  On July 4, 1995, at the ": null
    },
    {
        "Lollapalooza Festival": "Lollapalooza Festival"
    },
    {
        " in ": null
    },
    {
        "George, Washington": "George, Washington"
    },
    {
        ", Love threw a lit cigarette at musician ": null
    },
    {
        "Kathleen Hanna": "Kathleen Hanna"
    },
    {
        " before punching her in the face, alleging that Hanna had made a joke about her daughter.  She pleaded guilty to an ": null
    },
    {
        "assault": "Assault"
    },
    {
        " charge and was sentenced to ": null
    },
    {
        "anger management": "Anger Management"
    },
    {
        " classes.   In November 1995, two male teenagers attempted to sue Love for allegedly punching them during a Hole concert they attended in ": null
    },
    {
        "Orlando, Florida": "Orlando, Florida"
    },
    {
        " in March 1995. The judge ultimately dismissed the case on grounds that the teens werent exposed to any greater amount of violence than could reasonably be expected at an alternative rock concert.  Love would later say that she retained little memory of 1994–1995, blaming the fact that she had been using large quantities of heroin and ": null
    },
    {
        "Rohypnol": "Flunitrazepam"
    },
    {
        " at the time.       Celebrity Skin     After Holes world tour concluded in 1996, Love made a return to acting, first in small roles in the ": null
    },
    {
        "Jean-Michel Basquiat": "Jean-Michel Basquiat"
    },
    {
        " biopic  Basquiat  and the drama  Feeling Minnesota  , before landing the co-starring role of ": null
    },
    {
        "Larry Flynts": "Larry Flynt"
    },
    {
        "wife ": null
    },
    {
        "Althea": "Althea Flynt"
    },
    {
        " in ": null
    },
    {
        "Miloš Formans": "Miloš Forman"
    },
    {
        "critically acclaimed 1996 film  The People vs. Larry Flynt . In order to appear in the film, Love went through rehabilitation and quit using heroin at the insistence of Forman; she was ordered to take multiple urine tests under the supervision of ": null
    },
    {
        "Columbia Pictures": "Columbia Pictures"
    },
    {
        " while filming the movie, and passed all of them.  Despite Columbia Pictures initial reluctance to hire Love due to her troubled past,  she received critical acclaim for her performance in the film after its release in December 1996, earning a ": null
    },
    {
        "Golden Globe": "Golden Globe Award"
    },
    {
        " nomination for ": null
    },
    {
        "Best Actress": "Golden Globe Award For Best Actress In A Motion Picture – Drama"
    },
    {
        ", and a ": null
    },
    {
        "New York Film Critics Circle Award for Best Supporting Actress": "New York Film Critics Circle Award For Best Supporting Actress"
    },
    {
        ".  Critic ": null
    },
    {
        "Roger Ebert": "Roger Ebert"
    },
    {
        " called her work in the film quite a performance; Love proves she is not a rock star pretending to act, but a true actress.  She won several other awards from various film critic associations for the film.   During this time, Love maintained what the media noted as a more decorous public image,  and she appeared in ad campaigns for ": null
    },
    {
        "Versace": "Versace"
    },
    {
        "    and in a  Vogue Italia  spread.  Following the release of The People vs. Larry Flynt, she dated her co-star ": null
    },
    {
        "Edward Norton": "Edward Norton"
    },
    {
        ", with whom she remained until 1999.       In late 1997, Hole released a ": null
    },
    {
        "compilation album": "My Body, The Hand Grenade"
    },
    {
        " and ": null
    },
    {
        "extended play": "The First Session"
    },
    {
        ", both of which featured previously-recorded material. Love subsequently attracted media attention in May 1998 after punching journalist Belissa Cohen in the face at a party; the suit was settled out of court for an undisclosed sum.  In September 1998, Hole released their third studio album,  Celebrity Skin , which featured a stark ": null
    },
    {
        "power pop": "Power Pop"
    },
    {
        " sound that contrasted with the groups earlier punk influences. Love divulged her ambition of making an album where art meets commerce  ... there are no compromises made, it has commercial appeal, and it sticks to original vision. She said she was influenced by ": null
    },
    {
        "Neil Young": "Neil Young"
    },
    {
        ", Fleetwood Mac, and ": null
    },
    {
        "My Bloody Valentine": "My Bloody Valentine"
    },
    {
        " when writing the album.   Smashing Pumpkins frontman ": null
    },
    {
        "Billy Corgan": "Billy Corgan"
    },
    {
        " co-wrote several songs on the album. Celebrity Skin was well received by critics;  Rolling Stone  called it accessible, fiery and intimate—often at the same time  ... a basic guitar record thats anything but basic .  Celebrity Skin went multi-platinum, and topped Best of Year lists at Spin and  The Village Voice . The album garnered the band their only No.  1 hit single on the ": null
    },
    {
        "Modern Rock Tracks": "Modern Rock Tracks"
    },
    {
        " chart with the title track ": null
    },
    {
        "Celebrity Skin": "Celebrity Skin"
    },
    {
        " .  The band promoted the album through MTV performances and at the 1998 ": null
    },
    {
        "Billboard Music Awards": "Billboard Music Awards"
    },
    {
        ",   and were subsequently nominated for three ": null
    },
    {
        "Grammy Awards": "Grammy Award"
    },
    {
        "at the ": null
    },
    {
        "41st Grammy Awards": "41St Annual Grammy Awards"
    },
    {
        " ceremony.     Hole toured with ": null
    },
    {
        "Marilyn Manson": "Marilyn Manson"
    },
    {
        " on the ": null
    },
    {
        "Beautiful Monsters Tour": "Beautiful Monsters Tour"
    },
    {
        " in 1999, but dropped out of the tour nine dates in after a dispute over production costs between Love and Manson, in addition to the fact that Hole was forced to open for Manson under an agreement with ": null
    },
    {
        "Interscope Records": "Interscope Records"
    },
    {
        ".  Hole resumed touring with ": null
    },
    {
        "Imperial Teen": "Imperial Teen"
    },
    {
        ".   Love would later make claims that an additional reason the band left the tour was due to Manson and ": null
    },
    {
        "Korns": "Korn"
    },
    {
        " sexualized treatment of teenage female audience members.  Love told interviewers at ": null
    },
    {
        "99X.FM": "Wwwq-Hd2"
    },
    {
        " in Atlanta: What I really dont like—there are certain girls that like us, or like me, who are really messed up... and they do not need to be—theyre very young—and they do not need to be taken and raped, or filmed having enema contests... going out into the audience and picking up fourteen and fifteen-year-old girls who obviously ": null
    },
    {
        "cut themselves": "Self-Harm"
    },
    {
        ", and then having to see them in the morning... its just uncool.     Before the release and promotion of Celebrity Skin, Love and ": null
    },
    {
        "Fender": "Fender Musical Instruments Corporation"
    },
    {
        " designed a low-priced ": null
    },
    {
        "Squier": "Squier"
    },
    {
        " brand guitar, called ": null
    },
    {
        "Vista Venus": "Squier Venus"
    },
    {
        ". The instrument featured a shape inspired by Mercury, a little-known independent guitar manufacturer, ": null
    },
    {
        "Stratocaster": "Fender Stratocaster"
    },
    {
        ", and ": null
    },
    {
        "Rickenbackers": "Rickenbacker"
    },
    {
        " solid body": "Solid Body"
    },
    {
        " guitars and had a single-coil and a ": null
    },
    {
        "humbucker": "Humbucker"
    },
    {
        " pickup, and was available in 6-string and 12-string versions. In an early 1999 interview, Love said about the Venus: I wanted a guitar that sounded really warm and pop, but which required just one box to go dirty  ... And something that could also be your first band guitar. I didnt want it all teched out. I wanted it real simple, with just one ": null
    },
    {
        "pickup switch": "Pickup"
    },
    {
        ".  In 1999, Love was awarded an ": null
    },
    {
        "Orville H. Gibson": "Orville H. Gibson"
    },
    {
        " award for Best Female Rock Guitarist.  During this time, she also starred opposite ": null
    },
    {
        "Jim Carrey": "Jim Carrey"
    },
    {
        " as his longtime partner Lynne Margulies in the ": null
    },
    {
        "Andy Kaufman": "Andy Kaufman"
    },
    {
        " biopic  Man on the Moon  , which was followed with a role as ": null
    },
    {
        "William S. Burroughss": "William S. Burroughs"
    },
    {
        "wife ": null
    },
    {
        "Joan Vollmer": "Joan Vollmer"
    },
    {
        " in  Beat  alongside ": null
    },
    {
        "Kiefer Sutherland": "Kiefer Sutherland"
    },
    {
        ". Love was cast as the lead in ": null
    },
    {
        "John Carpenters": "John Carpenter"
    },
    {
        "sci-fi horror film  Ghosts of Mars , but backed out of the role after injuring her foot.  She subsequently sued the ex-wife of her then-boyfriend, James Barber, whom Love alleged ran over her foot with her ": null
    },
    {
        "Volvo": "Volvo"
    },
    {
        " in a parking lot, causing the injury.  The following year, she returned to film opposite ": null
    },
    {
        "Lili Taylor": "Lili Taylor"
    },
    {
        " in  Julie Johnson  , a drama in which she played a woman who has a lesbian relationship; Love won an Outstanding Actress award at L.A.s ": null
    },
    {
        "Outfest": "Outfest"
    },
    {
        ".  She was then cast in the thriller  Trapped  , alongside ": null
    },
    {
        "Kevin Bacon": "Kevin Bacon"
    },
    {
        " and ": null
    },
    {
        "Charlize Theron": "Charlize Theron"
    },
    {
        ".  The film was a box office flop, earning $13 million against a $30 million budget.      In the interim, Hole had become dormant,   and in March 2001, Love began a punk rock femme ": null
    },
    {
        "supergroup": "Supergroup"
    },
    {
        " called Bastard, enlisting Schemel, ": null
    },
    {
        "Veruca Salt": "Veruca Salt"
    },
    {
        " co-frontwoman ": null
    },
    {
        "Louise Post": "Louise Post"
    },
    {
        ", and bassist Gina Crosley.  Post recalled of the group: was like, Listen, you guys: Ive been in my Malibu, manicure, movie star world for two years, alright? I wanna make a record. And lets leave all that ": null
    },
    {
        "grunge": "Grunge"
    },
    {
        " shit behind us, eh? We were being so improvisational, and singing together, and with a trust developing between us. It was the shit.  The group recorded a demo tape, but by September 2001, Post and Crosley had left the band, with Post citing unhealthy and unprofessional working conditions.   In May 2002, Hole formally announced their breakup amid continuing litigation with ": null
    },
    {
        "Universal Music Group": "Universal Music Group"
    },
    {
        " over their record contract.         After the breakup of Hole, Love began composing material with songwriter ": null
    },
    {
        "Linda Perry": "Linda Perry"
    },
    {
        ", and in July 2003 signed a contract with ": null
    },
    {
        "Virgin Records": "Virgin Records"
    },
    {
        ".  She began recording her new album, titled  Americas Sweetheart , in France shortly after. A total of 32 songs were recorded during these sessions. A series of legal issues simultaneously occurred during this period: In February 2003, Love had been banned from ": null
    },
    {
        "Virgin Airlines": "Virgin Atlantic"
    },
    {
        " after being arrested at ": null
    },
    {
        "Heathrow Airport": "Heathrow Airport"
    },
    {
        " for disrupting a flight.  In October of that year, she was arrested in Los Angeles after breaking several windows of her producer and then-boyfriend James Barbers home, and was charged with being under the influence of a controlled substance;  the ordeal resulted in her temporarily losing custody of her daughter.      Virgin Records released Americas Sweetheart in February 2004, upon which it received mixed reviews.  Charles Aaron of Spin called it a jaw-dropping act of artistic will and a fiery, proper follow-up to 1994s Live Through This and awarded it eight out of ten stars,  while Amy Phillips of The Village Voice wrote: willing to act out the dream of every teenage brat who ever wanted to have a glamorous, high-profile hissyfit, and she turns those egocentric nervous breakdowns into art. Sure, the art becomes less compelling when youve been pulling the same stunts for a decade. But, honestly, is there anybody out there who fucks up better?  The album sold less than 100,000 copies. Love has publicly expressed her regret over the record,  reasoning that her drug issues at the time were to blame.  Shortly after the record was released, she told ": null
    },
    {
        "Kurt Loder": "Kurt Loder"
    },
    {
        " on  TRL : I cannot exist as a solo artist. Its a joke.      On March 17, 2004, Love appeared on the  Late Show with David Letterman  to promote the recently released Americas Sweetheart. Her appearance drew media coverage when, during the interview segment, she lifted her shirt multiple times,  ": null
    },
    {
        "flashed": "Exhibitionism"
    },
    {
        " Letterman, and stood on his desk.  A New York Times article noted: The episode was not altogether surprising for Ms. Love, 39, whose most public moments have veered from extreme pathos—like the time she read the suicide note of her famous husband, Kurt Cobain, on MTV—to angry feminism to catfights to incoherent ranting.  Hours later, in the early morning of March 18, Love was arrested in Manhattan for allegedly striking a 23-year-old male fan with a microphone stand during a small concert she performed at an East Village venue. She was released within hours of the incident, enabling her to perform a concert scheduled for the following evening at the ": null
    },
    {
        "Bowery Ballroom": "Bowery Ballroom"
    },
    {
        ". Four days later, on March 22, she called in multiple times to  The Howard Stern Show , claiming in broadcast conversations with Stern that the incident had not occurred, and that actress ": null
    },
    {
        "Natasha Lyonne": "Natasha Lyonne"
    },
    {
        ", who was at the concert, was told by the alleged victim that he had been paid $10,000 to file a false claim leading to Loves arrest.       On July 9, 2004, Loves 40th birthday, she was arrested for failing to make a court appearance for the March 2004 charges, and taken to ": null
    },
    {
        "Bellevue Hospital": "Bellevue Hospital"
    },
    {
        ", allegedly incoherent, where she was placed on a 72-hour watch.  According to police, she was believed to be a potential danger to herself, but was deemed mentally sound and released to a rehab facility two days later.   Amidst public criticism and press coverage, comedian ": null
    },
    {
        "Margaret Cho": "Margaret Cho"
    },
    {
        " published an opinion piece on her official website in defense of Love, titled Courtney Deserves Better from Feminists, arguing that negative associations of Love with her drug and personal problems overshadowed discussion of her music and, more importantly, her personal well-being.  Love would ultimately plead guilty in October 2004 to ": null
    },
    {
        "disorderly conduct": "Disorderly Conduct"
    },
    {
        " over the alleged striking of the audience member.         Her appearance as a ": null
    },
    {
        "roaster": "Roast"
    },
    {
        " on the  Comedy Central Roast  of ": null
    },
    {
        "Pamela Anderson": "Pamela Anderson"
    },
    {
        " in August 2005 attracted Love further media attention due to her appearing visibly intoxicated and disheveled.  One review of the program noted that Love acted as if she belonged in a institution. Six days after the shows airing, she was sentenced to a 28-day lockdown rehab program for allegedly being under the influence of a controlled substance, violating her ": null
    },
    {
        "probation": "Probation"
    },
    {
        ".  To avoid jail time, she accepted an additional 180-day rehab sentence in September 2005.  In November 2005, after successfully completing the program, Love was discharged from the rehab center under the provision that she complete further ": null
    },
    {
        "outpatient": "Ambulatory Care"
    },
    {
        " rehab.  In subsequent interviews in the following years, she would admit to having been dealing with various addictions during this time to prescription drugs, ": null
    },
    {
        "cocaine": "Cocaine"
    },
    {
        ", and ": null
    },
    {
        "crack cocaine": "Crack Cocaine"
    },
    {
        ".   She has stated she has been sober since completing rehabilitation in 2007, and cited her ": null
    },
    {
        "Nichiren Buddhist": "Nichiren Buddhism"
    },
    {
        " practice   as integral to her sobriety.       In the midst of her legal troubles, Love had endeavors in writing and publishing: She collaborated on a semi-autobiographical ": null
    },
    {
        "manga": "Manga"
    },
    {
        " titled  Princess Ai  , which she co-wrote with Stu Levy. The manga was illustrated by Misaho Kujiradou and ": null
    },
    {
        "Ai Yazawa": "Ai Yazawa"
    },
    {
        ", and was released in three volumes in both the United States and Japan between 2004 and 2006.   Also in 2006, she published a memoir,  Dirty Blonde , and began recording what would become her second solo album, How Dirty Girls Get Clean, collaborating again with Perry and Smashing Pumpkins vocalist/guitarist Billy Corgan. Love had written several songs, including an anti-cocaine song titled Loser Dust , during her time in rehab in 2005.  She told  Billboard : My hand-eye coordination was so bad I didnt even know chords anymore. It was like my fingers were frozen. And I wasnt allowed to make noise  ... I never thought I would work again.  Tracks and demos for the album were leaked on the internet in 2006, and a documentary entitled  The Return of Courtney Love , detailing the making of the album, aired on the British television network ": null
    },
    {
        "More4": "More4"
    },
    {
        " in the fall of that year. A rough acoustic version of Never Go Hungry Again , recorded during an interview for  The Times  in November, was also released. Incomplete audio clips of the song ": null
    },
    {
        "Samantha": "Samantha"
    },
    {
        " , originating from an interview with ": null
    },
    {
        "NPR": "Npr"
    },
    {
        ", were distributed on the internet in 2007.           In March 2009, fashion designer Dawn Simorangkir brought a ": null
    },
    {
        "libel": "Libel"
    },
    {
        " suit against Love concerning a defamatory post Love made on her ": null
    },
    {
        "Twitter": "Twitter"
    },
    {
        " account,  which was eventually settled for $450,000.  Several months later, in June 2009,  NME  published an article detailing Loves plan to reunite Hole and release a new album,  Nobodys Daughter .  In response, former Hole guitarist Eric Erlandson stated in Spin magazine that contractually no reunion could take place without his involvement; therefore Nobodys Daughter would remain Loves solo record, as opposed to a Hole record.  Love responded to Erlandsons comments in a ": null
    },
    {
        "Twitter": "Twitter"
    },
    {
        " post, claiming hes out of his mind, Hole is my band, my name, and my Trademark .  Nobodys Daughter was released worldwide as a Hole album on April 27, 2010. For the new line-up, Love recruited guitarist ": null
    },
    {
        "Micko Larkin": "Micko Larkin"
    },
    {
        ", Shawn Dailey , and Stu Fisher . Nobodys Daughter featured material written and recorded for Loves unfinished solo album, How Dirty Girls Get Clean, including Pacific Coast Highway , Letter to God , Samantha , and Never Go Hungry , although they were re-produced in the studio with Larkin and engineer ": null
    },
    {
        "Michael Beinhorn": "Michael Beinhorn"
    },
    {
        ".  The albums subject matter was largely centered on Loves tumultuous life between 2003 and 2007, and featured a polished ": null
    },
    {
        "folk rock": "Folk Rock"
    },
    {
        " sound, and more acoustic guitar work than previous Hole albums.         The first single from Nobodys Daughter was ": null
    },
    {
        "Skinny Little Bitch": "Skinny Little Bitch"
    },
    {
        " , released to promote the album in March 2010.  The album received mixed reviews.  Robert Sheffield of Rolling Stone gave the album three out of five, saying Love worked hard on these songs, instead of just babbling a bunch of druggy bullshit and assuming people would buy it, the way she did on her 2004 flop, Americas Sweetheart .  Sal Cinquemani of  Slant Magazine  also gave the album three out of five: Its ": null
    },
    {
        "Marianne Faithfulls": "Marianne Faithfull"
    },
    {
        "substance-ravaged voice that comes to mind most often while listening to songs like Honey and For Once in Your Life. The latter track is, in fact, one of Loves most raw and vulnerable vocal performances to date  ... the song offers a rare glimpse into the mind of a woman who, for the last 15 years, has been as famous for being a rock star as shes been for being a victim.  Love and the band toured internationally from 2010 into late 2012 promoting the record, with their pre-release shows in London and at ": null
    },
    {
        "South by Southwest": "South By Southwest"
    },
    {
        " receiving critical acclaim. In 2011, Love participated in  Hit So Hard , a documentary chronicling bandmate Schemels time in Hole.     In May 2012, Love debuted an art collection at Fred Torres Collaborations in New York titled And Shes Not Even Pretty ,  which contained over forty drawings and paintings by Love composed in ink, colored pencil, pastels, and watercolors.   Later in the year, she collaborated with ": null
    },
    {
        "Michael Stipe": "Michael Stipe"
    },
    {
        " on the track Rio Grande for ": null
    },
    {
        "Johnny Depps": "Johnny Depp"
    },
    {
        "sea shanty album  Son of Rogues Gallery ,  and in 2013, co-wrote and contributed vocals on Rat A Tat from ": null
    },
    {
        "Fall Out Boys": "Fall Out Boy"
    },
    {
        "album  Save Rock and Roll , also appearing in the songs music video.        After dropping the Hole name and performing as a solo artist  in late 2012,  Love appeared in spring 2013 advertisements for ": null
    },
    {
        "Yves Saint Laurent": "Yves Saint Laurent"
    },
    {
        " alongside ": null
    },
    {
        "Kim Gordon": "Kim Gordon"
    },
    {
        " and ": null
    },
    {
        "Ariel Pink": "Ariel Pink"
    },
    {
        ".  Love completed a solo tour of North America in mid-2013,   which was purported to be in promotion of an upcoming solo album; however, it was ultimately dubbed a greatest hits tour, and featured songs from Loves and Holes back catalogue.  Love told Billboard at the time that she had recorded eight songs in the studio.      Love was subject of a second landmark ": null
    },
    {
        "libel": "Libel"
    },
    {
        " lawsuit brought against her in January 2014 by her former attorney Rhonda Holmes, who accused Love of online defamation, seeking $8 million in damages.  It was the first case of alleged Twitter-based libel in U.S. history to make it to trial.  The jury, however, found in Loves favor. A subsequent defamation lawsuit filed by fashion Simorangkir in February 2014, however, resulted in Love being ordered to pay a further $350,000 in recompense.     On April 22, 2014, Love debuted the song ": null
    },
    {
        "You Know My Name": "You Know My Name"
    },
    {
        " on ": null
    },
    {
        "BBC Radio 6": "Bbc Radio 6"
    },
    {
        " to promote her tour of the United Kingdom.  It was released as a double A-side single with the song ": null
    },
    {
        "Wedding Day": "Wedding Day"
    },
    {
        " on May 4, 2014, on her own label Cherry Forever Records via ": null
    },
    {
        "Kobalt Label Services": "Kobalt Label Services"
    },
    {
        ".  The tracks were produced by Michael Beinhorn, and feature ": null
    },
    {
        "Tommy Lee": "Tommy Lee"
    },
    {
        " on drums.  In an interview with the ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        ", Love revealed that she and former Hole guitarist Eric Erlandson had reconciled, and had been rehearsing new material together, along with former bassist Melissa Auf der Maur and drummer Patty Schemel, though she did not confirm a reunion of the band.  On May 1, 2014, in an interview with  Pitchfork , Love commented further on the possibility of Hole reuniting, saying:   Im not going to commit to it happening, because we want an element of surprise. Theres a lot of is to be dotted and ts to be crossed.          Love was cast in several television series in supporting parts throughout 2014 including the ": null
    },
    {
        "FX": "Fx Network"
    },
    {
        " series  Sons of Anarchy ,   Revenge ,  and ": null
    },
    {
        "Lee Daniels": "Lee Daniels"
    },
    {
        " network series  Empire  in a recurring guest role as ": null
    },
    {
        "Elle Dallas": "Empire Cast And Characters"
    },
    {
        ".  The track Walk Out on Me featuring Love was included on the  Empire: Original Soundtrack from Season 1  album, which debuted at number 1 on the ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        ".  ": null
    },
    {
        "Alexis Petridis": "Alexis Petridis"
    },
    {
        " of  The Guardian  praised the track, saying: The idea of Courtney Love singing a ballad with a group of gospel singers seems faintly terrifying  ... the reality is brilliant. Loves voice fits the careworn lyrics, effortlessly summoning the kind of ravaged darkness that Lana Del Rey nearly ruptures herself trying to conjure up.      In January 2015, Love starred in a New York City stage production titled Kansas City Choir Boy, a pop opera conceived by and co-starring Todd Almond.  Charles Isherwood of The New York Times praised her performance, noting a soft-edged and bewitching stage presence, adding: Her voice, never the most supple or rangy of instruments, retains the singular sound that made her an electrifying front woman for the band Hole: a single sustained noted can seem to simultaneously contain a plea, a wound and a threat.  The show toured later in the year, with performances in Boston and Los Angeles.  Love saw further legal troubles in April 2015 when journalist ": null
    },
    {
        "Anthony Bozza": "Anthony Bozza"
    },
    {
        " sued her over an alleged contractual violation regarding his co-writing of her memoir.  Love subsequently joined ": null
    },
    {
        "Lana Del Rey": "Lana Del Rey"
    },
    {
        " on her ": null
    },
    {
        "Endless Summer Tour": "The Endless Summer Tour"
    },
    {
        ", performing as an opener on the tours eight West Coast shows in May–June 2015.  During her tenure on Del Reys tour, Love debuted a new single, ": null
    },
    {
        "Miss Narcissist": "Miss Narcissist"
    },
    {
        " , released on ": null
    },
    {
        "Wavves": "Wavves"
    },
    {
        " independent label Ghost Ramp.  She also was cast in a supporting role in ": null
    },
    {
        "James Francos": "James Franco"
    },
    {
        "film  The Long Home , based on ": null
    },
    {
        "William Gays": "William Gay"
    },
    {
        "novel of the same name, marking her first film role in over ten years.           In January 2016, Love released a clothing line in collaboration with ": null
    },
    {
        "Sophia Amoruso": "Sophia Amoruso"
    },
    {
        " titled Love, Courtney , featuring eighteen pieces reflecting her personal style.  In November 2016, she began filming the ": null
    },
    {
        "pilot": "Television Pilot"
    },
    {
        " for A Midsummers Nightmare, a Shakespeare anthology series adapted for ": null
    },
    {
        "Lifetime": "Lifetime"
    },
    {
        ".  She then starred as Kitty Menendez in  Menendez: Blood Brothers , a biopic television film based on the lives of ": null
    },
    {
        "Lyle and Erik Menendez": "Lyle And Erik Menendez"
    },
    {
        ", which premiered on Lifetime in June 2017.  The same year, she was cast in ": null
    },
    {
        "Justin Kellys": "Justin Kelly"
    },
    {
        "biopic  JT LeRoy , opposite ": null
    },
    {
        "Laura Dern": "Laura Dern"
    },
    {
        ", ": null
    },
    {
        "Kristen Stewart": "Kristen Stewart"
    },
    {
        ", ": null
    },
    {
        "Diane Kruger": "Diane Kruger"
    },
    {
        ", and ": null
    },
    {
        "Kelvin Harrison Jr.": "Kelvin Harrison Jr."
    },
    {
        ".  In March 2018, Love appeared in the music video for Marilyn Mansons ": null
    },
    {
        "Tattooed in Reverse": "Tattooed In Reverse"
    },
    {
        ",  which she followed with an April 5 guest-judge appearance on  RuPauls Drag Race .      In December 2018, Love filed and was awarded a ": null
    },
    {
        "restraining order": "Restraining Order"
    },
    {
        " against ": null
    },
    {
        "Sam Lutfi": "Sam Lutfi"
    },
    {
        ", who had acted as her manager for the previous six years, alleging verbal abuse and harassment. Her daughter, Frances, and sister, Jaimee, were also awarded restraining orders against Lutfi.  In January 2019, a Los Angeles County judge extended the three-year duration of the order to a total of five years, citing Lutfis apparent tendency to prey upon people.      On August 18, 2019, Love performed a solo set at the Yola Día festival in Los Angeles, which also featured performances by ": null
    },
    {
        "Cat Power": "Cat Power"
    },
    {
        " and ": null
    },
    {
        "Lykke Li": "Lykke Li"
    },
    {
        ".  On September 9, Love garnered press attention when she publicly criticized Joss Sackler, an heiress to the ": null
    },
    {
        "Sackler family": "Sackler Family"
    },
    {
        " OxyContin": "Oxycodone"
    },
    {
        " fortune, after she allegedly offered Love $100,000 to attend her fashion show during New York Fashion Week. In a statement condemning Sackler, Love commented: I am one of the most famous reformed junkies on the planet – my husband died on heroin – What is it about me that says to Joss Sackler, ’I will sell out to you?’ Well I wont. I never would take their money — Joss is delusional, talking about her fashion line and private members club, their ‘philanthropical arm’. What about instead giving money to rehab facilities, paying for ": null
    },
    {
        "Narcan": "Narcan"
    },
    {
        ", or creating a non-addictive painkiller?  In the same statement, Love indicated that she had ": null
    },
    {
        "relapse": "Relapse"
    },
    {
        "d into opioid addiction in 2018, stating that she had recently celebrated a year of sobriety.         Love has been candid about her diverse musical influences, the earliest being ": null
    },
    {
        "Patti Smith": "Patti Smith"
    },
    {
        ", ": null
    },
    {
        "The Runaways": "The Runaways"
    },
    {
        ", and ": null
    },
    {
        "The Pretenders": "The Pretenders"
    },
    {
        ", artists she discovered while in juvenile hall at age fifteen. As a child, her first exposure to music was records that her parents retrieved each month through ": null
    },
    {
        "Columbia Record Club": "Columbia House"
    },
    {
        ".  The first record Love owned was ": null
    },
    {
        "Leonard Cohens": "Leonard Cohen"
    },
    {
        "  Songs of Leonard Cohen  , which she obtained from her mother: He was so lyric-conscious and morbid, and I was a pretty morbid kid, she recalled. As a teenager, she named ": null
    },
    {
        "Flipper": "Flipper"
    },
    {
        ", ": null
    },
    {
        "Kate Bush": "Kate Bush"
    },
    {
        ", ": null
    },
    {
        "Soft Cell": "Soft Cell"
    },
    {
        ", ": null
    },
    {
        "Joni Mitchell": "Joni Mitchell"
    },
    {
        ", ": null
    },
    {
        "Laura Nyro": "Laura Nyro"
    },
    {
        ", ": null
    },
    {
        "Lou Reed": "Lou Reed"
    },
    {
        ", and ": null
    },
    {
        "Dead Kennedys": "Dead Kennedys"
    },
    {
        " among her favorite artists. She has also spoken of her appreciation for ": null
    },
    {
        "new wave": "New Wave Music"
    },
    {
        " and post-punk bands she became acquainted with while living as a teenager in the United Kingdom, such as ": null
    },
    {
        "Echo and the Bunnymen": "Echo And The Bunnymen"
    },
    {
        ", ": null
    },
    {
        "The Smiths": "The Smiths"
    },
    {
        ",  ": null
    },
    {
        "Siouxsie and the Banshees": "Siouxsie And The Banshees"
    },
    {
        ", ": null
    },
    {
        "Television": "Television"
    },
    {
        ", ": null
    },
    {
        "Bauhaus": "Bauhaus"
    },
    {
        ", and ": null
    },
    {
        "Joy Division": "Joy Division"
    },
    {
        ".     While in Dublin at age fifteen, Love attended a ": null
    },
    {
        "Virgin Prunes": "Virgin Prunes"
    },
    {
        " concert, an event she credited as being a pivotal influence: I had never seen so much sex, snarl, poetry, evil, restraint, grace, filth, raw power and the very essence of rock and roll, she recalled. ": null
    },
    {
        "U2": "U2"
    },
    {
        " gave me lashes of love and inspiration, and a few nights later the Virgin Prunes fuckedmeup.  Decades later, in 2009, Love introduced the bands frontman ": null
    },
    {
        "Gavin Friday": "Gavin Friday"
    },
    {
        " at a ": null
    },
    {
        "Carnegie Hall": "Carnegie Hall"
    },
    {
        " event, and performed a song with him.     Loves diverse genre interests were illustrated in a 1991 interview with Flipside, in which she stated: Theres a part of me that wants to have a ": null
    },
    {
        "grindcore": "Grindcore"
    },
    {
        " band and another that wants to have a ": null
    },
    {
        "Raspberries": "Raspberries"
    },
    {
        "-type pop band.  Discussing the abrasive sound of Holes debut album, she said she felt she had to catch up with all my hip peers whod gone all indie on me, and who made fun of me for liking ": null
    },
    {
        "R.E.M.": "R.E.M."
    },
    {
        " and The Smiths.  She has also embraced the influence of experimental artists and punk rock groups, including ": null
    },
    {
        "Sonic Youth": "Sonic Youth"
    },
    {
        ", ": null
    },
    {
        "Swans": "Swans"
    },
    {
        ",  ": null
    },
    {
        "Big Black": "Big Black"
    },
    {
        ", ": null
    },
    {
        "Diamanda Galás": "Diamanda Galás"
    },
    {
        ",  the ": null
    },
    {
        "Germs": "Germs"
    },
    {
        ", and ": null
    },
    {
        "The Stooges": "The Stooges"
    },
    {
        ".  While writing Celebrity Skin, she drew influence from ": null
    },
    {
        "Neil Young": "Neil Young"
    },
    {
        " and ": null
    },
    {
        "My Bloody Valentine": "My Bloody Valentine"
    },
    {
        ". She has also cited her contemporary ": null
    },
    {
        "PJ Harvey": "Pj Harvey"
    },
    {
        " as an influence, saying: The one rock star that makes me know Im shit is Polly Harvey. Im nothing next to the purity that she experiences.  In 2014, she named ": null
    },
    {
        "Bitter Sweet Symphony": "Bitter Sweet Symphony"
    },
    {
        " by ": null
    },
    {
        "The Verve": "The Verve"
    },
    {
        " as one of her favorite songs.     Literature and poetry have often been a major influence on her songwriting; Love said she had always wanted to be a poet, but there was no money in it.  She has named the works of ": null
    },
    {
        "T.S. Eliot": "T.S. Eliot"
    },
    {
        " and ": null
    },
    {
        "Charles Baudelaire": "Charles Baudelaire"
    },
    {
        " as influential,  and referenced works by ": null
    },
    {
        "Dante Rossetti": "Dante Gabriel Rossetti"
    },
    {
        ", ": null
    },
    {
        "William Shakespeare": "William Shakespeare"
    },
    {
        ",   ": null
    },
    {
        "Rudyard Kipling": "Rudyard Kipling"
    },
    {
        ", and ": null
    },
    {
        "Anne Sexton": "Anne Sexton"
    },
    {
        " in her lyrics.         Musically, Loves work with Hole and her solo efforts have been characterized as ": null
    },
    {
        "alternative rock": "Alternative Rock"
    },
    {
        "; Holes early material, however, was described by critics as being stylistically closer to grindcore and aggressive ": null
    },
    {
        "punk rock": "Punk Rock"
    },
    {
        ". Spins October 1991 review of Holes first album noted Loves layering of harsh and abrasive riffs buried more sophisticated musical arrangements.   In 1998, she stated that Hole had always been a pop band. We always had a subtext of pop. I always talked about it, if you go back  ... whatll sound like some weird Sonic Youth tuning back then to you was sounding like the Raspberries to me, in my demented pop framework.     Loves lyrical content is composed from a females point of view,  and her lyrics have been described as literate and mordant  and noted by scholars for articulating a ": null
    },
    {
        "third-wave feminist": "Third-Wave Feminism"
    },
    {
        " consciousness.   ": null
    },
    {
        "Simon Reynolds": "Simon Reynolds"
    },
    {
        ", in reviewing Holes debut album, noted: Ms. Loves songs explore the full spectrum of female emotions, from vulnerability to rage. The songs are fueled by adolescent traumas, feelings of disgust about the body, passionate friendships with women and the desire to escape domesticity. Her lyrical style could be described as emotional nudism. Journalist and critic ": null
    },
    {
        "Kim France": "Kim France"
    },
    {
        ", in critiquing Loves lyrics, referred to her as a dark genius and likened her work to that of Anne Sexton.      Love has remarked that lyrics have always been the most important component of songwriting for her: The important thing for me...   is it has to look good on the page. I mean, you can love ": null
    },
    {
        "Led Zeppelin": "Led Zeppelin"
    },
    {
        " and not love their lyrics...   but I made a big effort in my career to have whats on the page mean something.  A great deal of her songwriting has been ": null
    },
    {
        "diaristic": "Diary"
    },
    {
        " in nature.  Common themes present in Loves songs during her early career included body image, rape, suicide, conformity, elitism, pregnancy, prostitution, and death. In a 1991 interview with ": null
    },
    {
        "Everett True": "Everett True"
    },
    {
        ", she said: I try to place next to fucked up imagery, because thats how I view things  ... I sometimes feel that no ones taken the time to write about certain things in rock, that theres a certain female point of view thats never been given space.  .     Critics have noted that Loves later musical work is more lyrically introspective.  Celebrity Skin and Americas Sweetheart are lyrically centered on celebrity life, Hollywood, and drug addiction, while continuing Loves interest in vanity and body image. Nobodys Daughter was lyrically reflective of Loves past relationships and her struggle for sobriety, with the majority of its lyrics written while she was in rehab in 2006.           Love possesses a ": null
    },
    {
        "contralto": "Contralto"
    },
    {
        " vocal range.  According to Love, she never wanted to be a singer, but rather aspired to be a skilled guitarist: Im such a lazy bastard though that I never did that, she said. I was always the only person with the nerve to sing, and so I got stuck with it. She has been regularly noted by critics for her husky vocals as well as her ": null
    },
    {
        "banshee": "Banshee"
    },
    {
        " screaming": "Screaming"
    },
    {
        " abilities.   Her vocals have been compared to those of ": null
    },
    {
        "Johnny Rotten": "Johnny Rotten"
    },
    {
        ",   and David Fricke of Rolling Stone described them as lung-busting and a corrosive, lunatic wail. Upon the release of Holes 2010 album, Nobodys Daughter, ": null
    },
    {
        "Amanda Petrusich": "Amanda Petrusich"
    },
    {
        " of Pitchfork compared Loves raspy, unpolished vocals to those of ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        ".      She has played a variety of ": null
    },
    {
        "Fender": "Fender Musical Instruments Corporation"
    },
    {
        " guitars throughout her career, including a ": null
    },
    {
        "Jaguar": "Fender Jaguar"
    },
    {
        " and a vintage 1965 ": null
    },
    {
        "Jazzmaster": "Fender Jazzmaster"
    },
    {
        "; the latter was purchased by the ": null
    },
    {
        "Hard Rock Cafe": "Hard Rock Cafe"
    },
    {
        " and is on display in New York City.  Between 1989 and 1991, Love primarily played a ": null
    },
    {
        "Rickenbacker": "Rickenbacker"
    },
    {
        " 425 because she preferred the 3/4 neck, but she destroyed the guitar onstage at a 1991 concert opening for The Smashing Pumpkins.   In the mid-1990s, she often played a guitar made by Mercury, an obscure company that manufactured custom guitars, as well as a ": null
    },
    {
        "Univox Hi-Flier": "Univox Hi-Flier"
    },
    {
        ".  Fenders ": null
    },
    {
        "Vista Venus": "Vista Venus"
    },
    {
        ", designed by Love in 1998, was partially inspired by Rickenbacker guitars as well as her Mercury. During tours after the release of Nobodys Daughter , Love has played a ": null
    },
    {
        "Rickenbacker 360": "Rickenbacker 360"
    },
    {
        " onstage.  Her setup has included Fender tube gear, ": null
    },
    {
        "Matchless": "Matchless Amplifiers"
    },
    {
        ", ": null
    },
    {
        "Ampeg": "Ampeg"
    },
    {
        ", Silvertone and a solid-state 1976 Randall Commander.     Love has referred to herself as a shit guitar player, further commenting in a 2014 interview: I can still write a song, but sounds like shit  ... I used to be a good ": null
    },
    {
        "rhythm": "Rhythm Guitar"
    },
    {
        " player but I am no longer dependable.  Throughout her career, she has also garnered a reputation for unpredictable live shows. In the 1990s, her performances with Hole were characterized by confrontational behavior, with Love stage diving, smashing guitars or throwing them into the audience, wandering into the crowd at the end of sets, and engaging in sometimes incoherent rants. Critics and journalists have noted Love for her comical, often stream-of-consciousness-like stage banter.   In a review of a live performance published in 2010, it was noted that Loves onstage one-liners worthy of the ": null
    },
    {
        "Comedy Store": "The Comedy Store"
    },
    {
        ".       In 1993, Love and husband Kurt Cobain performed an acoustic set together at the Rock Against Rape benefit in Los Angeles, which raised awareness and provided resources for victims of sexual abuse. In 2000, Love publicly advocated for reform of the record industry in a personal letter published by  Salon .  In the letter, Love said: Its not ": null
    },
    {
        "piracy": "Music Piracy"
    },
    {
        " when kids swap music over the Internet using ": null
    },
    {
        "Napster": "Napster"
    },
    {
        " or ": null
    },
    {
        "Gnutella": "Gnutella"
    },
    {
        " or ": null
    },
    {
        "Freenet": "Freenet"
    },
    {
        " or ": null
    },
    {
        "iMesh": "Imesh"
    },
    {
        " or beaming their CDs into a ": null
    },
    {
        "My.MP3.com": "Mp3.Com"
    },
    {
        " or MyPlay.com music locker. Its piracy when those guys that run those companies make side deals with the cartel lawyers and label heads so that they can be the labels friend, and not the artists. In a subsequent interview with ": null
    },
    {
        "Carrie Fisher": "Carrie Fisher"
    },
    {
        ", she said that she was interested in starting a ": null
    },
    {
        "union": "Trade Union"
    },
    {
        " for recording artists, and also discussed ": null
    },
    {
        "race relations": "Race Relations"
    },
    {
        " in the music industry, advocating for record companies to put money back into the black community white people have been stealing from for years.      Love has been a long-standing supporter of ": null
    },
    {
        "LGBT": "Lgbt"
    },
    {
        " causes.   She has frequently collaborated with ": null
    },
    {
        "Los Angeles Gay and Lesbian Center": "Los Angeles Gay And Lesbian Center"
    },
    {
        ", taking part in the centers An Evening with Women events.  The proceeds of the event help provide food and shelter for homeless youth; services for seniors; legal assistance; domestic violence services; health and mental health services, and cultural arts programs. Love participated with Linda Perry for the event in 2012, and performed alongside ": null
    },
    {
        "Aimee Mann": "Aimee Mann"
    },
    {
        " and comedian ": null
    },
    {
        "Wanda Sykes": "Wanda Sykes"
    },
    {
        ". Speaking on her collaboration on the event, Love said: Seven thousand kids in Los Angeles a year go out on the street, and forty percent of those kids are ": null
    },
    {
        "gay": "Gay"
    },
    {
        ", ": null
    },
    {
        "lesbian": "Lesbian"
    },
    {
        ", or ": null
    },
    {
        "transgender": "Transgender"
    },
    {
        "ed. They ": null
    },
    {
        "come out": "Coming Out Of The Closet"
    },
    {
        " to their parents, and become homeless... for whatever reason, I dont really know why, but gay men have a lot of foundations—Ive played many of them—but the lesbian side of it doesnt have as much money and/or donors, so were excited that this has grown to cover women and womens affairs.      She has also contributed to ": null
    },
    {
        "AIDS": "Hiv/Aids"
    },
    {
        " organizations, partaking in benefits for ": null
    },
    {
        "amfAR": "Amfar, The Foundation For Aids Research"
    },
    {
        "  and the ": null
    },
    {
        "RED Campaign": "Product Red"
    },
    {
        ".  In May 2011, she donated six of her husband Cobains personal vinyl records for auction at ": null
    },
    {
        "Mariska Hargitays": "Mariska Hargitay"
    },
    {
        "Joyful Heart Foundation event for victims of child abuse, rape, and domestic violence.  She has also supported the ": null
    },
    {
        "Sophie Lancaster Foundation": "Murder Of Sophie Lancaster"
    },
    {
        ".           Love has had an impact on female-fronted alternative acts and performers. She has been cited as influential on young female instrumentalists in particular, having once infamously proclaimed: I want every girl in the world to pick up a guitar and start screaming... I strap on that motherfucking guitar and you cannot fuck with me. Thats my feeling.  In The Electric Guitar: A History of an American Icon, it is noted:         With over 3 million records sold in the United States alone, Hole became one of the most successful rock bands of all time fronted by a woman.  ": null
    },
    {
        "VH1": "Vh1"
    },
    {
        " ranked Love  69 in their list of The 100 Greatest Women in Music History in 2012.  In 2015, the  Phoenix New Times  declared Love the number one greatest female rock star of all time, writing: To build a perfect rock star, there are several crucial ingredients: musical talent, physical attractiveness, tumultuous relationships, substance abuse, and public meltdowns, just to name a few. These days, Love seems to have rebounded from her epic tailspin and has leveled out in a slightly more normal manner, but theres no doubt that her life to date is the type of story people wouldnt believe in a novel or a movie.      Among the alternative musicians who have cited Love as an influence are ": null
    },
    {
        "Scout Niblett": "Scout Niblett"
    },
    {
        ";  ": null
    },
    {
        "Brody Dalle": "Brody Dalle"
    },
    {
        " of ": null
    },
    {
        "The Distillers": "The Distillers"
    },
    {
        "; Dee Dee Penny of ": null
    },
    {
        "Dum Dum Girls": "Dum Dum Girls"
    },
    {
        ";  and ": null
    },
    {
        "Nine Black Alps": "Nine Black Alps"
    },
    {
        ".  Contemporary female pop artists ": null
    },
    {
        "Lana Del Rey": "Lana Del Rey"
    },
    {
        ",  ": null
    },
    {
        "Avril Lavigne": "Avril Lavigne"
    },
    {
        ",  ": null
    },
    {
        "Tove Lo": "Tove Lo"
    },
    {
        ",  and ": null
    },
    {
        "Sky Ferreira": "Sky Ferreira"
    },
    {
        "  have also cited Love as an influence. Love has frequently been recognized as the most high-profile contributor of ": null
    },
    {
        "feminist music": "Feminismmusic"
    },
    {
        " during the 1990s, and for subverting mainstream expectations of how a woman should look, act, and sound.  According to music journalist ": null
    },
    {
        "Maria Raha": "Maria Raha"
    },
    {
        ", Hole was the highest-profile female-fronted band of the 90s to openly and directly sing about feminism.  ": null
    },
    {
        "Patti Smith": "Patti Smith"
    },
    {
        ", a major influence of Loves, also praised her, saying: I hate genderizing things  ... when I heard Hole, I was amazed to hear a girl sing like that. ": null
    },
    {
        "Janis Joplin": "Janis Joplin"
    },
    {
        " was her own thing; she was into ": null
    },
    {
        "Big Mama Thornton": "Big Mama Thornton"
    },
    {
        " and ": null
    },
    {
        "Bessie Smith": "Bessie Smith"
    },
    {
        ". But what Courtney Love does, Id never heard a girl do that.      She has also been a ": null
    },
    {
        "gay icon": "Gay Icon"
    },
    {
        " since the mid-1990s,   and has jokingly referred to her fanbase as consisting of females, gay guys, and a few advanced, evolved heterosexual men.  Loves aesthetic image, particularly in the early 1990s, also became influential, and was dubbed ": null
    },
    {
        "kinderwhore": "Kinderwhore"
    },
    {
        " by critics and media. The subversive fashion mainly consisted of vintage ": null
    },
    {
        "babydoll": "Babydoll"
    },
    {
        " dresses accompanied by smeared makeup and red lipstick.  ": null
    },
    {
        "MTV": "Mtv"
    },
    {
        " reporter ": null
    },
    {
        "Kurt Loder": "Kurt Loder"
    },
    {
        " described Love as looking like a debauched rag doll onstage.   Love later said she had been influenced by the fashion of ": null
    },
    {
        "Chrissy Amphlett": "Chrissy Amphlett"
    },
    {
        " of the ": null
    },
    {
        "Divinyls": "Divinyls"
    },
    {
        ".  Interviewed in 1994, Love commented I would like to think–in my heart of hearts–that Im changing some psychosexual aspects of rock music. Not that Im so desirable. I didnt do the kinder-whore thing because I thought I was so hot. When I see the look used to make one more appealing, it pisses me off. When I started, it was a  What Ever Happened to Baby Jane?  thing. My angle was irony.             Hole discography     Pretty on the Inside     Live Through This     Celebrity Skin     Nobodys Daughter      Solo discography  Americas Sweetheart      Filmography        Bibliography             ": null
    }
]