[
    {
        "Literature, visual arts, music, and scholarship have complex relationships with ideological forces.       In the 19th century ": null
    },
    {
        "nationalism": "Nationalism"
    },
    {
        " was an especially potent influence on all of these fields. To summarize, every established national group used cultural productions to assert and strengthen a sense of national unity and destiny; less politically consolidated groups, especially those pursuing the goal of nationhood, used them in the same ways, though often with a note of determination that makes them easier to see from our contemporary point of reference.     Natural admiration for excellence and justifiable pride in a predecessors achievements is sometimes difficult to sort out from other intentions. ": null
    },
    {
        "Dante": "Dante Alighieri"
    },
    {
        " was a great poet, the Societa Dantesca Italiana did great work in editing and publishing a usable and affordable text, but the Divine Comedy was certainly used by the newly unified Italian government  to encourage a more homogeneous, Tuscan-influenced dialect for the whole peninsula .       :the ": null
    },
    {
        "Kalevala": "Kalevala"
    },
    {
        "   :": null
    },
    {
        "Ossian": "Ossian"
    },
    {
        "   :": null
    },
    {
        "Dante": "Dante Alighieri"
    },
    {
        "   :folklore collections   :the ": null
    },
    {
        "Brothers Grimm": "Brothers Grimm"
    },
    {
        "       :the ": null
    },
    {
        "Nazarene movement": "Nazarene Movement"
    },
    {
        "   :": null
    },
    {
        "Gothic revival": "Gothic Revival"
    },
    {
        "   :art history and nationalism       :": null
    },
    {
        "Richard Wagner": "Richard Wagner"
    },
    {
        "       This relationship between ideology and serious work is particularly ambiguous in the academic fields of historical importance. Much as 19th century science is often treated as the inventor of conceptions of evolution and ": null
    },
    {
        "race": "Race"
    },
    {
        " which had serious negative political and social consequences, many 19th century historians pursued what they intended as reasonably objective research projects in the history of their own and other regions either to end by themselves using the results to support nationalistic goals or to see their work used that way by others.     More politically consolidated nations sponsored historical research projects which produced results of permanent value - such as the  Monumenta Germaniae Historica  project. The MGH is a vast series of edited primary source material essential for scholarly work on late Antiquity and the Middle Ages. However, the term German in the title was interpreted in the broadest possible sense, and its initial royal patronage made the connection clear between a perceived unity": null
    }
]