[
    {
        "         Denton True Cy Young was an American ": null
    },
    {
        "Major League Baseball": "Major League Baseball"
    },
    {
        " pitcher": "Pitcher"
    },
    {
        ". Born in ": null
    },
    {
        "Gilmore, Ohio": "Gilmore, Ohio"
    },
    {
        ", he worked on his familys farm as a youth before starting his professional baseball career. Young entered the major leagues in 1890 with the ": null
    },
    {
        "National Leagues": "National League"
    },
    {
        " Cleveland Spiders": "Cleveland Spiders"
    },
    {
        " and pitched for them until 1898. He was then transferred to the ": null
    },
    {
        "St. Louis Cardinals": "St. Louis Cardinals"
    },
    {
        " franchise. In 1901, Young jumped to the ": null
    },
    {
        "American League": "American League"
    },
    {
        " and played for the ": null
    },
    {
        "Boston Red Sox": "Boston Red Sox"
    },
    {
        " franchise until 1908, helping them win the ": null
    },
    {
        "1903 World Series": "1903 World Series"
    },
    {
        ". He finished his career with the ": null
    },
    {
        "Cleveland Naps": "Cleveland Indians"
    },
    {
        " and ": null
    },
    {
        "Boston Rustlers": "Boston Rustlers"
    },
    {
        ", retiring in 1911.     Young was one of the hardest-throwing pitchers in the game early in his career. After his speed diminished, he relied more on his control and remained effective into his forties. By the time Young retired, he had established numerous pitching records, some of which have stood for over a century. He holds MLB records for the most career wins, with 511, along with most career ": null
    },
    {
        "innings pitched": "Innings Pitched"
    },
    {
        ", ": null
    },
    {
        "games started": "Games Started"
    },
    {
        ", and ": null
    },
    {
        "complete game": "Complete Game"
    },
    {
        "s. He led his league in wins during five seasons and pitched three ": null
    },
    {
        "no-hitter": "No-Hitter"
    },
    {
        "s, including a ": null
    },
    {
        "perfect game": "Perfect Game"
    },
    {
        ".     Young was elected to the ": null
    },
    {
        "National Baseball Hall of Fame": "National Baseball Hall Of Fame"
    },
    {
        " in 1937. In 1956, one year after his death, the ": null
    },
    {
        "Cy Young Award": "Cy Young Award"
    },
    {
        " was created to honor the best pitcher in each league for each season.       Cy Young was the oldest child born to McKinzie Young, Jr. a ": null
    },
    {
        "German American": "German American"
    },
    {
        " and Nancy Mottmiller. He was christened Denton True Young. The couple had four more children: Jesse Carlton, Alonzo, Ella, and Anthony. When the couple married, McKinzies father gave him the  of farm land he owned.  Young was born in Gilmore, a tiny farming community located in ": null
    },
    {
        "Washington Township, Tuscarawas County, Ohio": "Washington Township, Tuscarawas County, Ohio"
    },
    {
        ".     He was raised on one of the local farms and went by the name Dent Young in his early years.  Young was also known as Farmer Young and Farmboy Young . Young stopped his formal education after he completed the ": null
    },
    {
        "sixth grade": "Sixth Grade"
    },
    {
        "  so he could help out on the familys farm. In 1885, Young moved with his father to ": null
    },
    {
        "Nebraska": "Nebraska"
    },
    {
        ", and in the summer of 1887, they returned to Gilmore.     Young played for many amateur baseball leagues during his youth, including a semi-professional ": null
    },
    {
        "Carrollton": "Carrollton, Ohio"
    },
    {
        " team in 1888. Young pitched and played second base. The first box score known containing the name Young came from that season. In that game, Young played first base and had three hits in three at-bats. After the season, Young received an offer to play for the minor league ": null
    },
    {
        "Canton": "Canton, Ohio"
    },
    {
        " team, which started Youngs professional career.           Young began his professional career in 1889 with the ": null
    },
    {
        "Canton, Ohio": "Canton, Ohio"
    },
    {
        ", team of the ": null
    },
    {
        "Tri-State League": "Tri-State League"
    },
    {
        ", a professional minor league. During his tryout, Young impressed the scouts, recalling years later, I almost tore the boards off the grandstand with my fast ball.  Cy Youngs nickname came from the fences that he had destroyed using his fastball. The fences looked like a ": null
    },
    {
        "cyclone": "Cyclone"
    },
    {
        " had hit them. Reporters later shortened the name to Cy , which became the nickname Young used for the rest of his life.  During Youngs one year with the Canton team, he won 15 games and lost 15.     Franchises in the ": null
    },
    {
        "National League": "National League"
    },
    {
        ", the major professional baseball league at the time, wanted the best players available to them. Therefore, in 1890, Young signed with the ": null
    },
    {
        "Cleveland Spiders": "Cleveland Spiders"
    },
    {
        ", a team which had moved from the ": null
    },
    {
        "American Association": "American Association"
    },
    {
        " to the National League the previous year.       On August 6, 1890, Youngs major league debut, he pitched a three-hit 8–1 victory over the ": null
    },
    {
        "Chicago Colts": "Chicago Colts"
    },
    {
        ".  While Young was on the Spiders, ": null
    },
    {
        "Chief Zimmer": "Chief Zimmer"
    },
    {
        " was his catcher more often than any other player. ": null
    },
    {
        "Bill James": "Bill James"
    },
    {
        ", a baseball ": null
    },
    {
        "statistician": "Statistician"
    },
    {
        ", estimated that Zimmer caught Young in more games than any other ": null
    },
    {
        "battery": "Battery"
    },
    {
        " in baseball history. James, Bill. The New Bill James Historical Abstract , pp. 410–411     Early on, Young established himself as one of the harder-throwing pitchers in the game. Bill James wrote that Zimmer often put a piece of beefsteak inside his ": null
    },
    {
        "baseball glove": "Baseball Glove"
    },
    {
        " to protect his catching hand from Youngs fastball. In the absence of ": null
    },
    {
        "radar gun": "Radar Gun"
    },
    {
        "s, however, it is impossible to say just how hard Young actually threw. Young continued to perform at a high level during the 1890 season. On the last day of the season, Young won both games of a doubleheader. In the first weeks of Youngs career, ": null
    },
    {
        "Cap Anson": "Cap Anson"
    },
    {
        ", the player-manager of the Chicago Colts spotted Youngs ability. Anson told Spiders manager ": null
    },
    {
        "Gus Schmelz": "Gus Schmelz"
    },
    {
        ", Hes too green to do your club much good, but I believe if I taught him what I know, I might make a pitcher out of him in a couple of years. Hes not worth it now, but Im willing to give you $1,000  for him. Schmelz replied, Cap, you can keep your thousand and well keep the rube.         Two years after Youngs debut, the National League moved the ": null
    },
    {
        "pitchers position": "Pitchers Mound"
    },
    {
        " back by . Since 1881, pitchers had pitched within a box whose front line was  from home base, and since 1887 they had been compelled to toe the back line of the box when delivering the ball. The back line was  away from home. In 1893,  was added to the back line, yielding the modern pitching distance of . In the book  The Neyer/James Guide to Pitchers , sports journalist ": null
    },
    {
        "Rob Neyer": "Rob Neyer"
    },
    {
        " wrote that the speed with which pitchers like Cy Young, ": null
    },
    {
        "Amos Rusie": "Amos Rusie"
    },
    {
        ", and ": null
    },
    {
        "Jouett Meekin": "Jouett Meekin"
    },
    {
        " threw was the impetus that caused the move.      The 1892 regular season was a success for Young, who led the National League in wins , ERA , and shutouts . Just as many contemporary Minor League Baseball leagues operate today, the National League was using a ": null
    },
    {
        "split season": "Split Season"
    },
    {
        " format during the 1892 season.  The ": null
    },
    {
        "Boston Beaneaters": "Atlanta Bravesboston"
    },
    {
        " won the first-half title, and the Spiders won the second-half title, with a best-of-nine series determining the league champion. Despite the Spiders second half run, the Beaneaters swept the series, five games to none. Young pitched three complete games in the series, but lost two decisions. He also threw a complete game shutout, but the game ended in a 0  0 tie.     The Spiders faced the ": null
    },
    {
        "Baltimore Orioles": "Baltimore Orioles"
    },
    {
        " in the ": null
    },
    {
        "Temple Cup": "Temple Cup"
    },
    {
        ", a precursor to the ": null
    },
    {
        "World Series": "World Series"
    },
    {
        ", in 1895. Young won three games in the series and Cleveland won the Cup, four games to one. It was around this time that Young added what he called a slow ball to his pitching repertoire to reduce stress on his arm. The pitch today is called a ": null
    },
    {
        "changeup": "Changeup"
    },
    {
        ".     In 1896, Young lost a no-hitter with two outs in the ninth inning when ": null
    },
    {
        "Ed Delahanty": "Ed Delahanty"
    },
    {
        " of the ": null
    },
    {
        "Philadelphia Phillies": "Philadelphia Phillies"
    },
    {
        " hit a single.  On September 18, 1897, Young pitched the first ": null
    },
    {
        "no-hitter": "No-Hitter"
    },
    {
        " of his career in a game against the ": null
    },
    {
        "Cincinnati Reds": "Cincinnati Reds"
    },
    {
        ". Although Young did not walk a batter, the Spiders committed four ": null
    },
    {
        "errors": "Error"
    },
    {
        " while on defense. One of the errors had originally been ruled a ": null
    },
    {
        "hit": "Hit"
    },
    {
        ", but the Cleveland ": null
    },
    {
        "third baseman": "Third Baseman"
    },
    {
        " sent a note to the press box after the eighth inning, saying he had made an error, and the ruling was changed. Young later said, that, despite his teammates gesture, he considered the game to be a one-hitter.        Prior to the 1899 season, Frank Robison, the Spiders owner, bought the ": null
    },
    {
        "St. Louis Browns": "St. Louis Browns"
    },
    {
        ", thus owning two clubs simultaneously. The Browns were renamed the Perfectos , and restocked with Cleveland talent. Just weeks before the season opener, most of the better Spiders players were transferred to St. Louis, including three future Hall of Famers: Young, ": null
    },
    {
        "Jesse Burkett": "Jesse Burkett"
    },
    {
        ", and ": null
    },
    {
        "Bobby Wallace": "Bobby Wallace"
    },
    {
        ".  The roster maneuvers failed to create a powerhouse Perfectos team, as St. Louis finished fifth in both 1899 and 1900. Meanwhile, the depleted Spiders lost 134 games, the most in MLB history, before folding. Young spent two years with St. Louis, which is where he found his favorite catcher, ": null
    },
    {
        "Lou Criger": "Lou Criger"
    },
    {
        ". The two men were teammates for a decade.           In 1901, the rival ": null
    },
    {
        "American League": "American League"
    },
    {
        " declared major league status and set about raiding National League rosters. Young left St. Louis and joined the American Leagues ": null
    },
    {
        "Boston Americans": "History Of The Boston Red Sox"
    },
    {
        " for a $3,500 contract . Young would remain with the Boston team until 1909. In his first year in the American League, Young was dominant. Pitching to Criger, who had also jumped to Boston, Young led the league in wins, strikeouts, and ERA, thus earning the colloquial ": null
    },
    {
        "AL Triple Crown": "Major League Baseball Triple Crown"
    },
    {
        " for pitchers.  Young won almost 42% of his teams games in 1901, accounting for 33 of his teams 79 wins.  In February 1902, before the start of the baseball season, Young served as a pitching coach at ": null
    },
    {
        "Harvard University": "Harvard University"
    },
    {
        ". The sixth-grade graduate instructing Harvard students delighted Boston newspapers. The following year, Young coached at ": null
    },
    {
        "Mercer University": "Mercer University"
    },
    {
        " during the spring. The team went on to win the Georgia state championship in 1903, 1904, and 1905. Spright Dowell,   . Spright Dowell, A History of Mercer University, 1833–1953     The Boston Americans played the ": null
    },
    {
        "Pittsburgh Pirates": "Pittsburgh Pirates"
    },
    {
        " in the first modern ": null
    },
    {
        "World Series": "World Series"
    },
    {
        " in 1903. Young, who started ": null
    },
    {
        "Game One": "1903 World Seriesgame 1"
    },
    {
        " against the visiting Pirates, thus threw the first pitch in modern World Series history. The Pirates scored four runs in that first inning, and Young lost the game. Young performed better in subsequent games, winning his next two starts. He also drove in three runs in ": null
    },
    {
        "Game Five": "1903 World Seriesgame 5"
    },
    {
        ". Young finished the series with a 2  1 record and a 1.85 ERA in four appearances, and Boston defeated Pittsburgh, five games to three games.        After one-hitting Boston on May 2, 1904, ": null
    },
    {
        "Philadelphia Athletics": "Philadelphia Athletics"
    },
    {
        " pitcher ": null
    },
    {
        "Rube Waddell": "Rube Waddell"
    },
    {
        " taunted Young to face him so that he could repeat his performance against Bostons ace. Three days later, Young pitched a ": null
    },
    {
        "perfect game": "Perfect Game"
    },
    {
        " against Waddell and the Athletics. It was the first perfect game in American League history.   Waddell was the 27th and last batter, and when he flied out, Young shouted, How do you like that, you hayseed?     Waddell had picked an inauspicious time to issue his challenge. Youngs perfect game was the centerpiece of a pitching streak. Young set major league records for the most consecutive scoreless innings pitched and the most consecutive innings without allowing a hit; the latter record still stands at 25.1 innings, or 76 hitless batters.   Even after allowing a hit, Youngs scoreless streak reached a then-record 45 shutout innings. Before Young, only two pitchers had thrown perfect games. This occurred in 1880, when ": null
    },
    {
        "Lee Richmond": "Lee Richmond"
    },
    {
        " and ": null
    },
    {
        "John Montgomery Ward": "John Montgomery Ward"
    },
    {
        " pitched perfect games within five days of each other, although under somewhat different rules: the front edge of the pitchers box was only  from home base ; walks required eight ": null
    },
    {
        "balls": "Strike Zone"
    },
    {
        "; and pitchers were obliged to throw side-armed. Youngs perfect game was the first under the modern rules established in 1893. One year later, on July 4, 1905, Rube Waddell beat Young and the Americans, 4  2, in a 20-inning matchup. Young pitched 13 consecutive scoreless innings before he gave up a pair of unearned runs in the final inning. Young did not walk a batter and was later quoted: For my part, I think it was the greatest game of ball I ever took part in.  In 1907, Young and Waddell faced off in a scoreless 13-inning tie.     In 1908, Young pitched the third no-hitter of his career. Three months past his 41st birthday, Cy Young was the oldest pitcher to record a no-hitter, a record which would stand 82 years until 43-year-old ": null
    },
    {
        "Nolan Ryan": "Nolan Ryan"
    },
    {
        " surpassed the feat. Only a walk kept Young from his second perfect game. After that runner was caught stealing, no other batter reached base. At this time, Young was the second-oldest player in either league. In another game one month before his no-hitter, he allowed just one single while facing 28 batters. On August 13, 1908, the league celebrated Cy Young Day. No American League games were played on that day, and a group of All-Stars from the leagues other teams gathered in Boston to play against Young and the Red Sox.  When the season ended, he posted a 1.26 ERA, which gave him not only the lowest in his career, but also gave him a major league record of being the oldest pitcher with 150+ innings pitched to post a season ERA under 1.50.       Young was traded back to Cleveland, the place where he played over half his career, before the 1909 season, to the ": null
    },
    {
        "Cleveland Naps": "Cleveland Naps"
    },
    {
        " of the American League. The following season, 1910, he won his 500th career game on July 19 against Washington.  NY Times He split 1911, his final year, between the Naps and the ": null
    },
    {
        "Boston Rustlers": "Boston Rustlers"
    },
    {
        ". On September 22, 1911, Young shut out the Pittsburgh Pirates, 1  0, for his last career victory.  In his final start two weeks later, the last eight batters of Youngs career combined to hit a ": null
    },
    {
        "triple": "Triple"
    },
    {
        ", four ": null
    },
    {
        "singles": "Single"
    },
    {
        ", and three ": null
    },
    {
        "doubles": "Double"
    },
    {
        ".  By the time of his retirement, Youngs control had faltered. He had also gained weight. In two of his last three years, he was the oldest player in the league.       Young established numerous pitching records, some of which have stood for over a century. Young compiled 511 ": null
    },
    {
        "wins": "Win"
    },
    {
        ", which is the ": null
    },
    {
        "most in major league history": "List Of Major League Baseball Career Wins Leaders"
    },
    {
        " and 94 ahead of ": null
    },
    {
        "Walter Johnson": "Walter Johnson"
    },
    {
        ", second on the list.  At the time of Youngs retirement, ": null
    },
    {
        "Pud Galvin": "Pud Galvin"
    },
    {
        " had the second most career wins with 364. In addition to wins, Young still holds the major league records for most career ": null
    },
    {
        "innings pitched": "Innings Pitched"
    },
    {
        " , most career games started , and most ": null
    },
    {
        "complete games": "Complete Game"
    },
    {
        ".    He also retired with 316 ": null
    },
    {
        "losses": "Loss"
    },
    {
        ", the most in MLB history.  Youngs career record for strikeouts was broken by Johnson in 1921. SABR, p.210,  Retrieved on August 3, 2008 Youngs 76 career shutouts are fourth all-time.         Young led his league in wins five times , finishing second twice. His career high was 36 in 1892. He won at least thirty games in a season five times. He had fifteen seasons with twenty or more wins, two more than the runners-up, ": null
    },
    {
        "Christy Mathewson": "Christy Mathewson"
    },
    {
        " and ": null
    },
    {
        "Warren Spahn": "Warren Spahn"
    },
    {
        ". Young won two ": null
    },
    {
        "ERA": "Earned Run Average"
    },
    {
        " titles during his career, in 1892 and in 1901 , and was three times the runner-up. Youngs earned run average was below 2.00 six times, but this was not uncommon during the ": null
    },
    {
        "dead-ball era": "Dead-Ball Era"
    },
    {
        ". Although Young threw over 400 innings in each of his first four full seasons, he did not lead his league until 1902. He had 40 or more complete games nine times. Young also led his league in strikeouts twice , and in shutouts seven times. Young led his league in fewest walks per nine innings fourteen times and finished second one season. Only twice in his 22-year career did Young finish lower than 5th in the category. Although the ": null
    },
    {
        "WHIP": "Walks Plus Hits Per Inning Pitched"
    },
    {
        " ratio was not calculated until well after Youngs death, Young was the retroactive league leader in this category seven times and was second or third another seven times. Young is tied with ": null
    },
    {
        "Roger Clemens": "Roger Clemens"
    },
    {
        " for the most career wins by a Boston Red Sox pitcher. They each won 192 games while with the franchise.  In addition, Young pitched three ": null
    },
    {
        "no-hitter": "No-Hitter"
    },
    {
        "s, including the third ": null
    },
    {
        "perfect game": "Perfect Game"
    },
    {
        " in baseball history, first in baseballs modern era .       Particularly after his fastball slowed, Young relied upon his control. Young was once quoted as saying, Some may have thought it was essential to know how to curve a ball before anything else. Experience, to my mind, teaches to the contrary. Any young player who has good control will become a successful curve pitcher long before the pitcher who is endeavoring to master both curves and control at the same time. The curve is merely an accessory to control. In addition to his exceptional control, Young was also a workhorse who avoided injury. For nineteen consecutive years, from 1891 through 1909, Young was in his leagues top ten for innings pitched; in fourteen of the seasons, he was in the top five. Not until 1900, a decade into his career, did Young pitch two consecutive incomplete games. By habit, Young restricted his practice throws in ": null
    },
    {
        "spring training": "Spring Training"
    },
    {
        ". I figured the old arm had just so many throws in it , said Young, and there wasnt any use wasting them. Young once described his approach before a game:   I never warmed up ten, fifteen minutes before a game like most pitchers do. Id loosen up, three, four minutes. Five at the outside. And I never went to the bullpen. Oh, Id relieve all right, plenty of times, but I went right from the bench to the box, and Id take a few warm-up pitches and be ready. Then I had good control. I aimed to make the batter hit the ball, and I threw as few pitches as possible. Thats why I was able to work every other day.       Beginning in 1912, Young lived and worked on his farm. In 1913, he served as manager of the Cleveland Green Sox of the ": null
    },
    {
        "Federal League": "Federal League"
    },
    {
        ", which was at the time an outlaw league. However, he never worked in baseball after that.     Youngs wife, Roba, ": null
    },
    {
        ":File:Cy Young, Roba Miller Young Tombstone.JPG": ":File:Cy Young, Roba Miller Young Tombstone.Jpg"
    },
    {
        " whom he had known since childhood, died in 1933. After she died, Young tried several jobs, and eventually moved in with friends John and Ruth Benedum and did odd jobs for them. Young took part in many baseball events after his retirement. In 1937, 26 years after he retired from baseball, Young was inducted into the Baseball Hall of Fame. He was among the first to donate mementos to the Hall.     By 1940, Youngs only source of income was stock dividends of $300 per year .  On November 4, 1955, Young died on the Benedums farm at the age of 88. He was buried in ": null
    },
    {
        "Peoli, Ohio": "Peoli, Ohio"
    },
    {
        ".           Youngs career is seen as a bridge from baseballs earliest days to its modern era; he pitched against stars such as ": null
    },
    {
        "Cap Anson": "Cap Anson"
    },
    {
        ", already an established player when the ": null
    },
    {
        "National League": "National League"
    },
    {
        " was first formed in 1876, as well as against ": null
    },
    {
        "Eddie Collins": "Eddie Collins"
    },
    {
        ", who played until 1930. When Youngs career began, pitchers delivered the baseball underhand and fouls were not counted as strikes. The pitchers mound was not moved back to its present position of  until Youngs fourth season; he did not wear a glove until his sixth season.     Young was elected to the ": null
    },
    {
        "National Baseball Hall of Fame": "National Baseball Hall Of Fame"
    },
    {
        " in 1937. In 1956, about one year after Youngs death, the Cy Young Award was created to honor the best pitcher in Major League Baseball for each season. The first award was given to Brooklyns ": null
    },
    {
        "Don Newcombe": "Don Newcombe"
    },
    {
        ". Originally, it was a single award covering the whole of baseball. The honor was divided into two Cy Young Awards in 1967, one for the National League and one for the American League.     On September 23, 1993, a statue dedicated to him was unveiled by ": null
    },
    {
        "Northeastern University": "Northeastern University"
    },
    {
        " on the site of the Red Soxs original stadium, the ": null
    },
    {
        "Huntington Avenue Grounds": "Huntington Avenue Grounds"
    },
    {
        ". It was there that Young had pitched the first game of the 1903 World Series, as well as the first perfect game in the modern era of baseball. A home plate-shaped plaque next to the statue reads:     On October 1, 1903 the first modern World Series between the American League champion Boston Pilgrims and the National League champion Pittsburgh Pirates was played on this site. General admission tickets were fifty cents. The Pilgrims, led by twenty-eight game winner Cy Young, trailed the series three games to one but then swept four consecutive victories to win the championship five games to three.        In 1999, 88 years after his final major league appearance and 44 years after his death, editors at  The Sporting News  ranked Young 14th on their list of Baseballs 100 Greatest Players .  That same year, baseball fans named him to the ": null
    },
    {
        "Major League Baseball All-Century Team": "Major League Baseball All-Century Team"
    }
]