[
    {
        "                           The Dakar Rally  is an annual ": null
    },
    {
        "rally raid": "Rally Raid"
    },
    {
        " organised by the ": null
    },
    {
        "Amaury Sport Organisation": "Amaury Sport Organisation"
    },
    {
        ". Most events since the inception in 1978 were from ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", ": null
    },
    {
        "France": "France"
    },
    {
        ", to ": null
    },
    {
        "Dakar": "Dakar"
    },
    {
        ", ": null
    },
    {
        "Senegal": "Senegal"
    },
    {
        ", but due to security threats in ": null
    },
    {
        "Mauritania": "Mauritania"
    },
    {
        ", which led to the cancellation of the ": null
    },
    {
        "2008 rally": "2008 Dakar Rally"
    },
    {
        ", races since 2009 have been held in ": null
    },
    {
        "South America": "South America"
    },
    {
        ".    The race is open to amateur and professional entries, amateurs typically making up about eighty percent of the participants.     The race is an off-road endurance event. The terrain that the competitors traverse is much tougher than that used in conventional ": null
    },
    {
        "rallying": "Rallying"
    },
    {
        ", and the vehicles used are true ": null
    },
    {
        "off-road vehicles": "Off-Road Vehicles"
    },
    {
        " rather than modified on-road vehicles. Most of the competitive special sections are off-road, crossing dunes, mud, ": null
    },
    {
        "camel grass": "Cymbopogon Schoenanthus"
    },
    {
        ", rocks, and ": null
    },
    {
        "erg": "Erg"
    },
    {
        " among others. The distances of each stage covered vary from short distances up to  per day.         The race originated in December 1977, a year after ": null
    },
    {
        "Thierry Sabine": "Thierry Sabine"
    },
    {
        " got lost in the ": null
    },
    {
        "Ténéré desert": "Ténéré Desert"
    },
    {
        " whilst competing in the Abidjan-Nice rally and decided that the desert would be a good location for a regular rally.  182 vehicles took the start of the ": null
    },
    {
        "inaugural rally": "1979 Dakar Rally"
    },
    {
        " in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", with 74 surviving the  trip to the ": null
    },
    {
        "Senegal": "Senegal"
    },
    {
        "ese capital of ": null
    },
    {
        "Dakar": "Dakar"
    },
    {
        ". ": null
    },
    {
        "Cyril Neveu": "Cyril Neveu"
    },
    {
        " holds the distinction of being the events first winner, riding a ": null
    },
    {
        "Yamaha": "Yamaha Motor Company"
    },
    {
        " motorcycle. The event rapidly grew in popularity, with 216 vehicles taking the start in ": null
    },
    {
        "1980": "1980 Dakar Rally"
    },
    {
        " and 291 in ": null
    },
    {
        "1981": "1981 Dakar Rally"
    },
    {
        ".  Neveu won the event for a second time in 1980, ": null
    },
    {
        "Hubert Auriol": "Hubert Auriol"
    },
    {
        " taking honours in 1981 for ": null
    },
    {
        "BMW": "Bmw Motorrad"
    },
    {
        ". By this stage, the rally had already begun to attract the participation of famous names from elsewhere in motorsport, such as ": null
    },
    {
        "Henri Pescarolo": "Henri Pescarolo"
    },
    {
        " and ": null
    },
    {
        "Jacky Ickx": "Jacky Ickx"
    },
    {
        ".     Now boasting 382 competitors, more than double the amount that took the start in 1979, Neveu won the event for a third time in ": null
    },
    {
        "1982": "1982 Dakar Rally"
    },
    {
        ", this time riding a ": null
    },
    {
        "Honda": "Honda"
    },
    {
        " motorcycle, while victory in the car class went to the Marreau brothers, driving a privately entered ": null
    },
    {
        "Renault 20": "Renault 20"
    },
    {
        ", whose buccaneering exploits seemed to perfectly capture the spirit of the early years of the rally. Auriol captured his second bikes class victory in 1983, the first year that Japanese manufacturer ": null
    },
    {
        "Mitsubishi": "Mitsubishi Motors"
    },
    {
        " competed in the rally, beginning an association that would last all the way until 2009.     At the behest of 1983 car class winner Jacky Ickx, ": null
    },
    {
        "Porsche": "Porsche"
    },
    {
        " entered the Dakar in ": null
    },
    {
        "1984": "1984 Dakar Rally"
    },
    {
        ", with the total number of entries now at 427. The German marque won the event at their first attempt courtesy of ": null
    },
    {
        "René Metge": "René Metge"
    },
    {
        ", who had previously won in the car category in 1981, whilst Ickx finished sixth. ": null
    },
    {
        "Gaston Rahier": "Gaston Rahier"
    },
    {
        " meanwhile continued BMWs success in the motorcycle category with back-to-back wins in 1984 and ": null
    },
    {
        "1985": "1985 Dakar Rally"
    },
    {
        ", the year of Mitsubishis first victory of 12 in the car category, ": null
    },
    {
        "Patrick Zaniroli": "Patrick Zaniroli"
    },
    {
        " taking the spoils. The ": null
    },
    {
        "1986 event": "1986 Dakar Rally"
    },
    {
        ", won by Metge and Neveu, was marred by the death of event founder Sabine in a helicopter crash, his father Gilbert taking over organisation of the rally.         The ": null
    },
    {
        "1987 rally": "1987 Dakar Rally"
    },
    {
        " marked the start of an era of increased official factory participation in the car category, as French manufacturer ": null
    },
    {
        "Peugeot": "Peugeot"
    },
    {
        " arrived and won the event with former ": null
    },
    {
        "World Rally": "World Rally Championship"
    },
    {
        " champion ": null
    },
    {
        "Ari Vatanen": "Ari Vatanen"
    },
    {
        ". The 1987 event was also notable for a ferocious head-to-head duel between Neveu and Auriol in the motorcycle category, the former taking his fifth victory after Auriol was forced to drop out of the rally after breaking both ankles in a fall. The ": null
    },
    {
        "1988 event": "1988 Dakar Rally"
    },
    {
        " reached its zenith in terms of entry numbers, with 603 starters. Vatanens title defence was derailed when his Peugeot was stolen from the service area at ": null
    },
    {
        "Bamako": "Bamako"
    },
    {
        ". Though it was later found, Vatanen was subsequently disqualified from the event, victory instead going to compatriot and teammate ": null
    },
    {
        "Juha Kankkunen": "Juha Kankkunen"
    },
    {
        ".     Peugeot and Vatanen returned to winning ways in ": null
    },
    {
        "1989": "1989 Dakar Rally"
    },
    {
        " and ": null
    },
    {
        "1990": "1990 Dakar Rally"
    },
    {
        ", the latter marking Peugeots final year of rally competition before switching to the ": null
    },
    {
        "World Sportscar Championship": "World Sportscar Championship"
    },
    {
        ". Sister brand ": null
    },
    {
        "Citroën": "Citroën"
    },
    {
        " took Peugeots place, Vatanen taking a third consecutive victory in ": null
    },
    {
        "1991": "1991 Dakar Rally"
    },
    {
        ". The 1991 event also saw ": null
    },
    {
        "Stéphane Peterhansel": "Stéphane Peterhansel"
    },
    {
        " take his first title in the motorcycle category with Yamaha, marking the beginning of an era of domination by the Frenchman.     For the ": null
    },
    {
        "1992 event": "1992 Dakar Rally"
    },
    {
        ", the finish line moved to ": null
    },
    {
        "Cape Town": "Cape Town"
    },
    {
        ", ": null
    },
    {
        "South Africa": "South Africa"
    },
    {
        " in a bid to combat a declining number of competitors, where ": null
    },
    {
        "GPS": "Global Positioning System"
    },
    {
        " technology was used for the first time. Auriol became the first person to win in multiple classes after taking Mitsubishis second victory in the car class, while Peterhansel successfully defended his motorcycle category title. The ": null
    },
    {
        "1993 rally": "1993 Dakar Rally"
    },
    {
        " entry list slumped to 153 competitors, around half of the preceding years figure and around a quarter of that of 1988. The event was the last to be organised by Gilbert Sabine and the ": null
    },
    {
        "Amaury Sport Organisation": "Amaury Sport Organisation"
    },
    {
        " took over the following year. With the finish line now back in its traditional location of Dakar, ": null
    },
    {
        "Bruno Saby": "Bruno Saby"
    },
    {
        " won a third title for Mitsubishi and Peterhansel took a third straight success in the motorcycle category.     The ": null
    },
    {
        "1994 event": "1994 Dakar Rally"
    },
    {
        " returned to Paris after reaching Dakar, resulting in a particularly grueling event. ": null
    },
    {
        "Pierre Lartigue": "Pierre Lartigue"
    },
    {
        " took Citroëns second win in acrimonious circumstances, as Mitsubishis leading drivers were forced to withdraw from exhaustion after traversing some particularly demanding sand dunes in the Mauritanian desert that the Citroen crews had opted to skip.  Peterhansels did not compete due to a disagreement between Yamaha and the race organizers over the regulations. ": null
    },
    {
        "Edi Orioli": "Edi Orioli"
    },
    {
        " claimed a third title in the bikes category. The ": null
    },
    {
        "1995": "1995 Dakar Rally"
    },
    {
        " and ": null
    },
    {
        "1996": "1996 Dakar Rally"
    },
    {
        " events begin in the Spanish city of ": null
    },
    {
        "Granada": "Granada"
    },
    {
        ", with Lartigue racking up wins for Citroen in both years. Peterhansel returned to take a fourth bikes category win in 1995, but lost to Orioli in 1996 because of refuelling problems.         The ": null
    },
    {
        "1997 rally": "1997 Dakar Rally"
    },
    {
        " ran exclusively in Africa for the first time, with the route running from Dakar to ": null
    },
    {
        "Agadez": "Agadez"
    },
    {
        ", ": null
    },
    {
        "Niger": "Niger"
    },
    {
        " and back to Dakar. Citroens withdrawal due to a rule change paved the way for Mitsubishi to take a fourth victory. Japans ": null
    },
    {
        "Kenjiro Shinozuka": "Kenjiro Shinozuka"
    },
    {
        " became the first non-European to win the event. Peterhansel equalled Neveus record of five motorcycle category wins in 1997, before going one better in ": null
    },
    {
        "1998": "1998 Dakar Rally"
    },
    {
        ", when the event returned to its traditional Paris-Dakar route. 1998, Dakar veteran ": null
    },
    {
        "Jean-Pierre Fontenay": "Jean-Pierre Fontenay"
    },
    {
        " posted another win for Mitsubishi in the car class.     ": null
    },
    {
        "1999": "1999 Dakar Rally"
    },
    {
        " started in Granada and a maiden success for erstwhile ": null
    },
    {
        "Formula One": "Formula One"
    },
    {
        " and sports car driver ": null
    },
    {
        "Jean-Louis Schlesser": "Jean-Louis Schlesser"
    },
    {
        ", who had been constructing his own buggies since 1992. With the help of ": null
    },
    {
        "Renault": "Renault"
    },
    {
        " backing, Schlesser overcame the works Mitsubishi and ": null
    },
    {
        "Nissan": "Nissan Motor Company"
    },
    {
        " crews to win, whilst Peterhansels decision to switch to the car category allowed ": null
    },
    {
        "Richard Sainct": "Richard Sainct"
    },
    {
        " to take BMWs first title in the bikes category since 1985. Schlesser and Sainct both successfully defended their titles in ": null
    },
    {
        "2000": "2000 Dakar Rally"
    },
    {
        ", traversing the route from Dakar to the ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        "ian capital of ": null
    },
    {
        "Cairo": "Cairo"
    },
    {
        ".     ": null
    },
    {
        "2001": "2001 Dakar Rally"
    },
    {
        " was the final time that the rally used the familiar Paris-Dakar route, and was notable for Mitsubishis ": null
    },
    {
        "Jutta Kleinschmidt": "Jutta Kleinschmidt"
    },
    {
        ", as she was the first woman to win the rally - albeit only after Schlesser was penalised one hour for unsportsmanlike conduct.  ": null
    },
    {
        "Fabrizio Meoni": "Fabrizio Meoni"
    },
    {
        " took the first Dakar win for Austrian manufacturer ": null
    },
    {
        "KTM": "Ktm"
    },
    {
        ", beginning a winning streak that has lasted until the present day. The ": null
    },
    {
        "2002": "2002 Dakar Rally"
    },
    {
        " began in the French town of ": null
    },
    {
        "Arras": "Arras"
    },
    {
        " and long-time Dakar participant ": null
    },
    {
        "Hiroshi Masuoka": "Hiroshi Masuoka"
    },
    {
        " won the event for Mitsubishi The ": null
    },
    {
        "2003 rally": "2003 Dakar Rally"
    },
    {
        " featured an unorthodox route from ": null
    },
    {
        "Marseille": "Marseille"
    },
    {
        " to ": null
    },
    {
        "Sharm El Sheikh": "Sharm El Sheikh"
    },
    {
        ". Masuoka defend his title after teammate and long-time leader Peterhansel was plagued by mechanical problems in the penultimate stage.  Sainct meanwhile took honours in the motorcycle category, the third title for both him and KTM.       The mid-2000s saw the Dakar Rally reach the height of its popularity. The entry list by ": null
    },
    {
        "2004": "2004 Dakar Rally"
    },
    {
        " increased to 595, up from 358 in 2001, with a record 688 competitors starting in ": null
    },
    {
        "2005": "2005 Dakar Rally"
    },
    {
        ". Alongside Mitsubishi and Nissan, ": null
    },
    {
        "Volkswagen": "Volkswagen"
    },
    {
        " now boasted a full factory effort, while Schlessers ": null
    },
    {
        "Ford": "Ford Motor Company"
    },
    {
        "-powered buggies and ": null
    },
    {
        "BMWs": "Bmw"
    },
    {
        " of the German ": null
    },
    {
        "X-raid": "X-Raid"
    },
    {
        " team proved thorns in the side of the big budget works teams. The 2004 route was from ": null
    },
    {
        "Clermont-Ferrand": "Clermont-Ferrand"
    },
    {
        " to Dakar, and was the year Peterhansel emulated Hubert Auriols feat of winning the rally on both two wheels and four. The Frenchman defended his title in 2005, when the rally began for the first time in ": null
    },
    {
        "Barcelona": "Barcelona"
    },
    {
        ". In the bikes category, KTM continued their success with ": null
    },
    {
        "Nani Roma": "Nani Roma"
    },
    {
        " in 2004, who switched to the car category the following year, and ": null
    },
    {
        "Cyril Despres": "Cyril Despres"
    },
    {
        " in 2005.     The ": null
    },
    {
        "2006": "2006 Dakar Rally"
    },
    {
        " event moved to ": null
    },
    {
        "Lisbon": "Lisbon"
    },
    {
        ". Nissan pulled out having failed to provide effective opposition to Mitsubishi, who took a sixth consecutive victory, this time with former skiing champion ": null
    },
    {
        "Luc Alphand": "Luc Alphand"
    },
    {
        " after Peterhansel committed a series of errors late in the rally.  Peterhansel made amends in ": null
    },
    {
        "2007": "2007 Dakar Rally"
    },
    {
        ", however, taking his third title in the car category for Mitsubishi after a close contest with Alphand after the increasingly competitive Volkswagens retired with mechanical problems. In what would be the final African event of the Dakar, Despres took his second title in the bikes category, having conceded victory in 2006 to ": null
    },
    {
        "Marc Coma": "Marc Coma"
    },
    {
        " after suffering an injury.     The ": null
    },
    {
        "2008 event": "2008 Dakar Rally"
    },
    {
        ", due to depart Lisbon as per the previous two years, was cancelled on 4 January 2008 amid ": null
    },
    {
        "fears of terrorist attacks in Mauritania": "2007 Killing Of French Tourists In Mauritania"
    },
    {
        ", causing serious doubts over the future of the rally. Chile and Argentina offered to host subsequent events,   an offer later accepted by the ASO.    The ASO also decided to establish the ": null
    },
    {
        "Dakar Series": "Dakar Series"
    },
    {
        " competition, whose first event was the 2008 ": null
    },
    {
        "Central Europe Rally": "Central Europe Rally"
    },
    {
        ", located in ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        " and ": null
    },
    {
        "Romania": "Romania"
    },
    {
        ", which acted as a replacement for the cancelled 2008 edition of the Dakar.         The ": null
    },
    {
        "2009 event": "2009 Dakar Rally"
    },
    {
        ", the first held in South America with a respectable entry of 501, saw Volkswagen finally take its first win in the Dakar as a works entrant courtesy of ": null
    },
    {
        "Giniel de Villiers": "Giniel De Villiers"
    },
    {
        ". Teammate and former WRC champion ": null
    },
    {
        "Carlos Sainz": "Carlos Sainz"
    },
    {
        " had been leading comfortably until crashing out,  but seized the opportunity to win the event in ": null
    },
    {
        "2010": "2010 Dakar Rally"
    },
    {
        ". After a poor showing in 2009, Mitsubishi withdrew from the competition and left Volkswagen as the sole works entrant. The German marque duly won the race for a third time in ": null
    },
    {
        "2011": "2011 Dakar Rally"
    },
    {
        ", this time with ": null
    },
    {
        "Nasser Al-Attiyah": "Nasser Al-Attiyah"
    },
    {
        ", before they withdrew to focus on their upcoming WRC entry and leaving the Dakar with no factory participants in the car class. In the bikes, Despres and Coma stretched KTMs incredible unbroken run of success. Both tied on three victories apiece after Comas third win in 2011.     In the ": null
    },
    {
        "2012 rally": "2012 Dakar Rally"
    },
    {
        ", the ": null
    },
    {
        "X-raid": "X-Raid"
    },
    {
        " team came to the fore, now using ": null
    },
    {
        "Minis": "Mini"
    },
    {
        " in lieu of BMWs. Peterhansel had joined the team in 2010 after Mitsubishis departure, but had been unable to challenge the Volkswagen drivers. Following Volkswagens withdrawal, Peterhansel was able to secure his fourth win in the car category and his tenth in total, his main opposition coming from within his own team. Peterhansel successfully defended his title in ": null
    },
    {
        "2013": "2013 Dakar Rally"
    },
    {
        " as the Damen Jefferies buggies of Sainz and Al-Attiyah failed to last the distance. Despres also racked up a further two wins for KTM in the bikes class in 2012 and 2013, bringing his tally to five, aided by Comas absence due to injury in the latter year. Coma struck back on his return to the Dakar in ": null
    },
    {
        "2014": "2014 Dakar Rally"
    },
    {
        ", taking a comfortable fourth title and a 13th in succession for KTM, whilst ": null
    },
    {
        "Nani Roma": "Nani Roma"
    },
    {
        " emulated Auriol and Peterhansel by taking his maiden title in the cars class a decade on from his victory on two wheels - albeit only after team orders by ": null
    },
    {
        "X-raid": "X-Raid"
    },
    {
        " slowed down Peterhansel.  autosport.com. Retrieved January 18, 2014.     Peugeot returned for the 2015 event with an all-new, diesel-powered, two-wheel drive contender, but failed to make an impact as ": null
    },
    {
        "X-raids": "X-Raid"
    },
    {
        " Minis once more dominated. Al-Attiyah won the event in his second year for the team, while Coma racked up a fifth title in the bikes after the defection of long-time rival Despres to the car class and Peugeot. Peugeot did however see success in ": null
    },
    {
        "2016": "2016 Dakar Rally"
    },
    {
        " with Peterhansel behind the wheel, racking up his 6th win in the car category, and again in 2017 and 2018 until Peugeot decide to officially leave the competition. In ": null
    },
    {
        "2019": "2019 Dakar Rally"
    },
    {
        " Toyota": "Toyota"
    },
    {
        " won for the first time with ": null
    },
    {
        "Nasser Al-Attiyah": "Nasser Al-Attiyah"
    },
    {
        " . The bike category saw the KTM works team rider, Australian Toby Price, take his first Dakar victory, winning his second title in 2019. ": null
    },
    {
        "Sam Sunderland": "Sam Sunderland"
    },
    {
        " and ": null
    },
    {
        "Matthias Walkner": "Matthias Walkner"
    },
    {
        " won the 2017 and 2018 edition also for the team from Mattighofen .       The five competitive groups in the Dakar are the ": null
    },
    {
        "motorcycles": "Motorcycle"
    },
    {
        ", ": null
    },
    {
        "quads": "Quad Bike"
    },
    {
        ", the ": null
    },
    {
        "cars": "Automobile"
    },
    {
        " class , UTVs, and the ": null
    },
    {
        "trucks": "Truck"
    },
    {
        " class. Many vehicle manufacturers use the rallys harsh environment as both a testing ground and an opportunity to show off their vehicles durability—though, in fact, most vehicles are heavily modified or purpose-built.         As of 2011, the engine capacity limit for all motorbikes competing in the Dakar Rally is 450cc. Engines may be either single or twin cylinder. Riders are divided into two groups, Elite and Non-Elite , with the latter subdivided into two further groups - the Super Production and Marathon classes. Marathon competitors are not permitted to change such key components as the engine , the frame, the forks or swinging arm, whereas those in the Super Production and Elite classes may replace these components.      ": null
    },
    {
        "KTM": "Ktm"
    },
    {
        " has dominated the motorcycle class in recent years, although ": null
    },
    {
        "Honda": "Honda"
    },
    {
        ", ": null
    },
    {
        "Yamaha": "Yamaha Motor Company"
    },
    {
        ", ": null
    },
    {
        "Sherco": "Sherco"
    },
    {
        ", ": null
    },
    {
        "Husqvarna": "Husqvarna Motorcycles"
    },
    {
        ", and ": null
    },
    {
        "Gas Gas": "Gas Gas"
    },
    {
        " also compete currently. ": null
    },
    {
        "BMW": "Bmw Motorrad"
    },
    {
        " and ": null
    },
    {
        "Cagiva": "Cagiva"
    },
    {
        " have also enjoyed success in the past.         Prior to 2009, Quads were a subdivision of the motorbike category, but they were granted their own separate classification in 2009 and are designated Group 3 in the current regulations. They are divided into two subgroups - Group 3.1, which features two-wheel drive quads with a single cylinder engine with a maximum capacity of 750cc, and Group 3.2, which permits four-wheel drive quads with a maximum engine capacity of 900cc, in either single or twin cylinder layout.     Yamaha are unbeaten in the Quad category since 2009, with their main current opposition coming courtesy of Honda and ": null
    },
    {
        "Can-Am": "Can-Am Off-Road"
    },
    {
        ".     For the 2017 rally the SSV category was added which is defined as four-wheel ": null
    },
    {
        "side-by-side vehicles": "Side By Side"
    },
    {
        " with 1000 cc maximum displacement. , retrieved January 7, 2017       The car class is made up of vehicles weighing less than , which are subdivided into several categories. The T1 Group is made up of Improved Cross-Country Vehicles , subdivided according to engine type and drive type . The T2 Group is made up of Cross-Country Series Production Vehicles , which are subdivided into petrol and diesel categories, while the T3 Group is for Light Vehicles . There is also an Open category catering for vehicles conforming to ": null
    },
    {
        "SCORE": "Score International"
    },
    {
        " regulations.      ": null
    },
    {
        "Mini": "Mini"
    },
    {
        " have been the most successful marque in the car category in recent years, thanks to the efforts of the non-factory ": null
    },
    {
        "X-raid": "X-Raid"
    },
    {
        " team, with limited involvement currently coming from ": null
    },
    {
        "Toyota": "Toyota"
    },
    {
        ", ": null
    },
    {
        "Ford": "Ford Motor Company"
    },
    {
        " and ": null
    },
    {
        "Haval": "Great Wall Motors"
    },
    {
        ". Several constructors also produce bespoke buggies for the event, most notably SMG and Damen Jefferies.     ": null
    },
    {
        "Mitsubishi": "Mitsubishi Motors"
    },
    {
        " is historically the most successful manufacturer in the car class, with ": null
    },
    {
        "Volkswagen": "Volkswagen"
    },
    {
        ", ": null
    },
    {
        "Citroen": "Citroen"
    },
    {
        ", ": null
    },
    {
        "Peugeot": "Peugeot"
    },
    {
        " and ": null
    },
    {
        "Porsche": "Porsche"
    },
    {
        " having all tasted success in the past with factory teams. ": null
    },
    {
        "Jean-Louis Schlesser": "Jean-Louis Schlesser"
    },
    {
        " has also won the event twice with his ": null
    },
    {
        "Renault": "Renault"
    },
    {
        "-supported buggies. Factory teams from ": null
    },
    {
        "Nissan": "Nissan Motor Company"
    },
    {
        " and ": null
    },
    {
        "SEAT": "Seat"
    },
    {
        " have also won stages, as has ": null
    },
    {
        "BMW": "Bmw"
    },
    {
        ", courtesy of the ": null
    },
    {
        "X-raid": "X-Raid"
    },
    {
        " team.       The Truck class , first run as a separate category in 1980, is made up of vehicles weighing more than . Trucks participating in the competition are subdivided into Series Production trucks and Modified trucks , whilst Group T4.3 trucks are ": null
    },
    {
        "rally support trucks": "Rally Support Truck"
    },
    {
        " - meaning they travel from bivouac to bivouac to support the competition vehicles. These were introduced to the rally in 1998. The truck event was not run in 1989 after it was decided the vehicles, by this stage with twin engines generating in excess of 1000 horsepower, were too dangerous following the death of a ": null
    },
    {
        "DAF": "Daf Trucks"
    },
    {
        " crew member in an accident during the 1988 rally.     ": null
    },
    {
        "Kamaz": "Kamaz"
    },
    {
        " has dominated the truck category since the turn of the century, although it has come under increasing pressure from rivals such as ": null
    },
    {
        "Iveco": "Iveco"
    },
    {
        ", ": null
    },
    {
        "MAN": "Man Se"
    },
    {
        ", ": null
    },
    {
        "Renault": "Renault Trucks"
    },
    {
        ", and ": null
    },
    {
        "Tatra": "Tatra"
    },
    {
        ", which enjoyed much success in the 1990s. ": null
    },
    {
        "Hino": "Hino Motors"
    },
    {
        ", ": null
    },
    {
        "DAF": "Daf Trucks"
    },
    {
        ", ": null
    },
    {
        "Perlini": "Perlini"
    },
    {
        ", and ": null
    },
    {
        "Mercedes-Benz": "Mercedes-Benz"
    },
    {
        " have also been among the winners in the past. In the 21st century Kamaz almost always won the truck class, winning fourteen out of eighteen times.       The UTVs class was introduced in 2017. Previously run under the car category as the T3 class, ": null
    },
    {
        "Side by Side ": "Side By Side"
    },
    {
        " vehicles are now run under their own class in Dakar competition.                     Source:                                                    Over 190 different countries take the international feed of the event with a roundup of every day being made into a 26-minute programme. This has been commentated on by ": null
    },
    {
        "Toby Moody": "Toby Moody"
    },
    {
        " for ten years, and most recently Ben Constanduros.     The organisers provide 20 edit stations for various countries to produce their own programmes. There are four TV helicopters, six stage cameras, and three bivouac crews to make over 1,000 hours of TV over the two-week period. In the United States, coverage can be seen on ": null
    },
    {
        "NBC Sports Network": "Nbc Sports Network"
    },
    {
        ".     A 2006 television documentary  Race to Dakar  described the experiences of a team, including the English actor ": null
    },
    {
        "Charley Boorman": "Charley Boorman"
    },
    {
        ", in preparation for and entry into the 2006 Dakar Rally.                 In 1982, ": null
    },
    {
        "Mark Thatcher": "Mark Thatcher"
    },
    {
        ", son of the then ": null
    },
    {
        "British Prime Minister": "Prime Minister Of The United Kingdom"
    },
    {
        " Margaret Thatcher": "Margaret Thatcher"
    },
    {
        ", along with his French co-driver ": null
    },
    {
        "Anne-Charlotte Verney": "Anne-Charlotte Verney"
    },
    {
        " and their mechanic, disappeared for six days. On 9 January the trio became separated from a convoy of vehicles after they stopped to make repairs to a faulty ": null
    },
    {
        "steering arm": "Steering"
    },
    {
        ". They were declared missing on 12 January; after a large-scale search, a ": null
    },
    {
        "Lockheed L100": "C-130 Hercules"
    },
    {
        " search plane from the ": null
    },
    {
        "Algerian military": "Military Of Algeria"
    },
    {
        " spotted their white ": null
    },
    {
        "Peugeot 504": "Peugeot 504"
    },
    {
        " some  off course. Thatcher, Verney, and the mechanic were all unharmed.     The organiser of the rally, ": null
    },
    {
        "Thierry Sabine": "Thierry Sabine"
    },
    {
        ", was killed when his ": null
    },
    {
        "Ecureuil": "Ecureuil"
    },
    {
        " helicopter crashed at 7:30  p.m. on Tuesday 14 January 1986, into a dune at Mali during a sudden sand-storm. Also killed onboard was the singer-songwriter ": null
    },
    {
        "Daniel Balavoine": "Daniel Balavoine"
    },
    {
        ", helicopter pilot François-Xavier Bagnoud, journalist Nathalie Odent, and Jean-Paul Lefur who was a radiophonic engineer for ": null
    },
    {
        "RTL": "Rtl"
    },
    {
        ".      Six people were killed during the 1988 race, three participants and three local residents. In one incident, Baye Sibi, a 10-year-old Malian girl, was killed by a racer while she crossed a road. A film crews vehicle killed a mother and daughter in ": null
    },
    {
        "Mauritania": "Mauritania"
    },
    {
        " on the last day of the race. The race participants killed, in three separate crashes, were a Dutch navigator on the ": null
    },
    {
        "DAF Trucks": "Daf Trucks"
    },
    {
        " team, a French ": null
    },
    {
        "privateer": "Privateer"
    },
    {
        ", and a French ": null
    },
    {
        "rider": "Motorcycle"
    },
    {
        ". Racers were also blamed for starting a ": null
    },
    {
        "wildfire": "Wildfire"
    },
    {
        " that caused a panic on a train running between Dakar and ": null
    },
    {
        "Bamako": "Bamako"
    },
    {
        ", where three more people were killed.      In 2003, French driver Daniel Nebot both rolled and crashed his Toyota heavily at high speed killing his co-driver Bruno Cauvy.     In 2005, Spanish motorcyclist ": null
    },
    {
        "José Manuel Pérez": "José Manuel Pérez"
    },
    {
        " died in a Spanish hospital on Monday 10 January after crashing the week before on the 7th stage. Italian motorcyclist ": null
    },
    {
        "Fabrizio Meoni": "Fabrizio Meoni"
    },
    {
        ", a two-time winner of the event, became the second Dakar Rally rider to die in two days, following Pérez on 11 January on stage 11. Meoni was the 11th motorcyclist and the 45th person overall to die in the history of the race. On 13 January a five-year-old ": null
    },
    {
        "Senegal": "Senegal"
    },
    {
        "ese girl was hit and killed by a ": null
    },
    {
        "service lorry": "Service Lorry"
    },
    {
        " after wandering onto a main road, bringing the total deaths to five.     In 2006, 41-year-old Australian ": null
    },
    {
        "KTM": "Ktm"
    },
    {
        " motorcyclist ": null
    },
    {
        "Andy Caldecott": "Andy Caldecott"
    },
    {
        ", in his third time in the Dakar, died on 9 January as a result of neck injuries sustained in a crash approximately  into stage 9, between ": null
    },
    {
        "Nouakchott": "Nouakchott"
    },
    {
        " and ": null
    },
    {
        "Kiffa": "Kiffa"
    },
    {
        ", only a few kilometers from the location where Meoni had his fatal wreck the year before. He won the third stage of the 2006 event between ": null
    },
    {
        "Nador": "Nador"
    },
    {
        " and ": null
    },
    {
        "Er Rachidia": "Er Rachidia"
    },
    {
        " only a few days before his death. The death occurred despite efforts by the event organisers to improve competitor safety, including limiting speed, mandatory rest at fuel stops, and reduced fuel capacity requirements for the bike classes. On 13 January a 10-year-old boy died while crossing the course after being hit by a car driven by Latvian ": null
    },
    {
        "Māris Saukāns": "Māris Saukāns"
    },
    {
        ", while on 14 January a 12-year-old boy was killed after being hit by a support lorry.      In 2007, 29-year-old South African motor racer ": null
    },
    {
        "Elmer Symons": "Elmer Symons"
    },
    {
        " died of injuries sustained in a crash during the fourth stage of the Rally. Symons crashed with his bike in the desert between ": null
    },
    {
        "Er Rachidia": "Er Rachidia"
    },
    {
        " and ": null
    },
    {
        "Ouarzazate": "Ouarzazate"
    },
    {
        ", Morocco.  Another death occurred on 20 January, the night before the races finish, when 42-year-old motorcyclist Eric Aubijoux died suddenly. The cause of death was initially believed to be a heart attack,  however it was later suggested that Aubijoux had died of internal injuries sustained in a crash earlier that day while competing in the 14th stage of the race.        The ": null
    },
    {
        "2008 Dakar Rally": "2008 Dakar Rally"
    },
    {
        " was cancelled due to security concerns after ": null
    },
    {
        "al-Qaedas": "Al-Qaeda"
    },
    {
        " murder of four French tourists on Christmas Eve in December 2007 in Mauritania , various accusations against the rally calling it neo-colonialist , and al-Qaedas accusations against Mauritania calling it a supporter of crusaders, apostates and infidels . The French-based ": null
    },
    {
        "Amaury Sport Organisation": "Amaury Sport Organisation"
    },
    {
        " in charge of the  rally said in a statement that they had been advised by the French government to cancel the race, which had been due to begin on 5 January 2008 from Lisbon. They said direct threats had also been made against the event by al-Qaeda related organisations.        ": null
    },
    {
        "Omar Osama bin Laden": "Omar Osama Bin Laden"
    },
    {
        ", the son of ": null
    },
    {
        "Osama bin Laden": "Osama Bin Laden"
    },
    {
        ", attracted news coverage in 2008 by promoting himself as an ambassador of peace and proposing a  horse race across North Africa as a replacement to the Dakar Rally, with sponsors money going to support child victims of war, saying  I heard the rally was stopped because of al-Qaida. I dont think they are going to stop me.       On 7 January 2009, the body of 49-year-old motorcyclist ": null
    },
    {
        "Pascal Terry": "Pascal Terry"
    },
    {
        " from France was found. He had been missing for three days and his body lay on a remote part of the second stage between Santa Rosa de la Pampa and Puerto Madryn.     On 4 January 2010, a woman watching the Dakar Rally was killed when a vehicle taking part in the race veered off the course and hit her during the opening stage.     On 1 January 2012, motorcyclist Jorge Martinez Boero of Argentina died after suffering a cardiac arrest after a fall. He was treated by medical staff within five minutes of the accident, but died on the way to hospital.     On 7 January 2015, motorcycle rider Michal Hernik died from unknown circumstances during Stage 3 of the 2015 rally.      Overall 70 people, including 28 competitors, have died in the Dakar Rally.       When the race was held in Africa, it was subject to criticism from several sources, generally focusing on the races impact on the inhabitants of the African countries through which it passed.     Some African residents along the races course in previous years have said they saw limited benefits from the race; that race participants spent little money on the goods and services local residents can offer. The racers produced substantial amounts of dust along the course, and were blamed for hitting and killing livestock, in addition to occasionally injuring or killing people.      After the 1988 race, when three Africans were killed in collisions with vehicles involved in the race, ": null
    },
    {
        "PANA": "Panafrican News Agency"
    },
    {
        ", a Dakar-based ": null
    },
    {
        "news agency": "News Agency"
    },
    {
        ", wrote that the deaths were insignificant for the organisers . The ": null
    },
    {
        "Vatican City": "Vatican City"
    },
    {
        " newspaper  LOsservatore Romano  called the race a vulgar display of power and wealth in places where men continue to die from hunger and thirst.  During a 2002 protest at the races start in ": null
    },
    {
        "Arras": "Arras, France"
    },
    {
        ", France, a ": null
    },
    {
        "Green Party": "The Greens"
    },
    {
        " of France statement described the race as ": null
    },
    {
        "colonialism": "Colonialism"
    },
    {
        " that needs to be eradicated .      The environmental impact of the race has been another area of criticism. This criticism of the race is notably the topic of the song 500 connards sur la ligne de départ , on the ": null
    },
    {
        "1991": "1991 In Music"
    },
    {
        " album  Marchand de cailloux  by ": null
    },
    {
        "French": "France"
    },
    {
        " singer ": null
    },
    {
        "Renaud": "Renaud"
    },
    {
        ".     In 2014, the Dakar rally was criticized for damage done to archaeological sites in Chile.        ": null
    }
]