[
    {
        "         Danny Kaye  was an American actor, singer, dancer, comedian, musician, and philanthropist. His performances featured ": null
    },
    {
        "physical comedy": "Physical Comedy"
    },
    {
        ", idiosyncratic ": null
    },
    {
        "pantomime": "Pantomime"
    },
    {
        "s, and rapid-fire ": null
    },
    {
        "novelty song": "Novelty Song"
    },
    {
        "s.     Kaye starred in 17 movies, notably  Wonder Man  ,  The Kid from Brooklyn  ,  The Secret Life of Walter Mitty  ,  The Inspector General  ,  Hans Christian Andersen  ,  White Christmas  , and  The Court Jester  .     His films were popular, especially for his performances of ": null
    },
    {
        "patter songs": "Patter Song"
    },
    {
        "and favorites such as ": null
    },
    {
        "Inchworm": "Inchworm"
    },
    {
        " and The Ugly Duckling. He was the first ambassador-at-large of ": null
    },
    {
        "UNICEF": "Unicef"
    },
    {
        " in 1954 and received the French ": null
    },
    {
        "Legion of Honour": "Legion Of Honour"
    },
    {
        " in 1986 for his years of work with the organization.        David Daniel Kaminsky was born in ": null
    },
    {
        "Brooklyn": "Brooklyn"
    },
    {
        ", New York, on January 18, 1911 ,  ": null
    },
    {
        "FBI": "Fbi"
    },
    {
        " records and ": null
    },
    {
        "SSDI": "Ssdi"
    },
    {
        " show 1911.  to Ukrainian Jewish immigrants Jacob and Clara  Kaminsky. He was the youngest of three sons. Jacob and Clara and their older sons Larry and Mac left ": null
    },
    {
        "Dnipropetrovsk": "Dnipropetrovsk"
    },
    {
        " two years before Dannys birth; he was their only son born in the United States.      He attended Public School 149 in ": null
    },
    {
        "East New York, Brooklyn": "East New York, Brooklyn"
    },
    {
        "; the school eventually was renamed to honor him  —where he began entertaining his classmates with songs and jokes.  He attended ": null
    },
    {
        "Thomas Jefferson High School": "Thomas Jefferson High School"
    },
    {
        " in Brooklyn, but he did not graduate.     His mother died when he was in his early teens. Not long after his mothers death, Kaye and his friend Louis ran away to Florida. Kaye sang while Louis played the guitar and the pair eked out a living for a while. When Kaye returned to New York, his father did not pressure him to return to school or work, giving his son the chance to mature and discover his own abilities. Kaye said that as a young boy, he had wanted to be a surgeon, but the family could not afford a medical education.      He held a succession of jobs after leaving school, as a ": null
    },
    {
        "soda jerk": "Soda Jerk"
    },
    {
        ", auto insurance investigator, and office clerk. Most ended with his being fired. He lost the insurance job when he made an error that cost the insurance company $40,000  . A dentist who hired him to look after his office over lunch and run errands also fired him when he found Kaye using his dental ": null
    },
    {
        "drill": "Dental Drill"
    },
    {
        " on the office woodwork. In 1939, Kaye met the dentists daughter, ": null
    },
    {
        "Sylvia": "Sylvia Fine"
    },
    {
        " Fine at an audition and in 1940 they eloped.   He learned his trade in his teenaged years in the ": null
    },
    {
        "Catskills": "Catskill Mountains"
    },
    {
        " as a ": null
    },
    {
        "tummler": "Tummler"
    },
    {
        " in the ": null
    },
    {
        "Borscht Belt": "Borscht Belt"
    },
    {
        ".     Kayes first break came in 1933 when he joined the Three ": null
    },
    {
        "Terpsichoreans": "Wikt:Terpsichorean"
    },
    {
        ", a vaudeville dance act. They opened in ": null
    },
    {
        "Utica, New York": "Utica, New York"
    },
    {
        ", where he used the name Danny Kaye for the first time. The act toured the United States, then performed in Asia with the show La Vie Paree.     The troupe left for a six-month tour of the Far East on February 8, 1934. While they were in Osaka, Japan, a ": null
    },
    {
        "typhoon": "Typhoon"
    },
    {
        " hit the city. The hotel where Kaye and his colleagues stayed suffered heavy damage. The strong wind hurled a piece of the hotels ": null
    },
    {
        "cornice": "Cornice"
    },
    {
        " into Kayes room; had he been hit, he might well have been killed. By performance time that evening, the city was in the grip of the storm. With no power, the audience became restless and nervous. To calm them, Kaye went on stage holding a flashlight to illuminate his face and sang every song he could recall as loudly as he was able.     The experience of trying to entertain audiences who did not speak English inspired him to the pantomime, gestures, songs, and facial expressions that eventually made his reputation. Sometimes, he found pantomime necessary when ordering a meal. Kayes daughter, Dena, tells a story her father related about being in a restaurant in China and trying to order chicken. Kaye flapped his arms and clucked, giving the waiter an imitation of a chicken. The waiter nodded in understanding, bringing Kaye two eggs. His interest in cooking began on the tour.      Jobs were in short supply when Kaye returned to the United States, and he struggled for bookings. One job was working in a burlesque revue with ": null
    },
    {
        "fan dance": "Fan Dance"
    },
    {
        "r ": null
    },
    {
        "Sally Rand": "Sally Rand"
    },
    {
        ". After the dancer dropped a fan while trying to chase away a fly, Kaye was hired to watch the fans so they were always held in front of her.       Danny Kaye made his film debut in a 1935 comedy short Moon Over Manhattan. In 1937, he signed with New York–based ": null
    },
    {
        "Educational Pictures": "Educational Pictures"
    },
    {
        " for a series of two-reel comedies. He usually played a manic, dark-haired, fast-talking Russian in these low-budget shorts, opposite young hopefuls ": null
    },
    {
        "June Allyson": "June Allyson"
    },
    {
        " and ": null
    },
    {
        "Imogene Coca": "Imogene Coca"
    },
    {
        ". The Kaye series ended abruptly when the studio shut down in 1938. He was working in the Catskills in 1937 under the name Danny Kolbin.       His next venture was a short-lived Broadway show with Sylvia Fine as the pianist, lyricist, and composer. The Straw Hat Revue opened on September 29, 1939, and closed after 10 weeks, but critics took notice of Kayes work.  The reviews brought an offer for both Kaye and his bride Sylvia to work at ": null
    },
    {
        "La Martinique": "La Martinique"
    },
    {
        ", a New York City nightclub. Kaye performed with Sylvia as his accompanist. At La Martinique, playwright ": null
    },
    {
        "Moss Hart": "Moss Hart"
    },
    {
        " saw Danny perform, and that led to Harts casting him in his hit Broadway comedy  Lady in the Dark .     Kaye scored a triumph at age 30 in 1941 playing Russell Paxton in Lady in the Dark, starring ": null
    },
    {
        "Gertrude Lawrence": "Gertrude Lawrence"
    },
    {
        ". His show-stopping number was ": null
    },
    {
        "Tchaikovsky": "Tchaikovsky"
    },
    {
        " by ": null
    },
    {
        "Kurt Weill": "Kurt Weill"
    },
    {
        " and ": null
    },
    {
        "Ira Gershwin": "Ira Gershwin"
    },
    {
        " in which he sang the names of a string of Russian composers at breakneck speed, seemingly without taking a breath.  In the next Broadway season, he was the star of a show about a young man who is drafted called  Lets Face It! .      His feature-film debut was in producer ": null
    },
    {
        "Samuel Goldwyns": "Samuel Goldwyn"
    },
    {
        " Technicolor": "Technicolor"
    },
    {
        " 1944 comedy Up in Arms, a remake of Goldwyns ": null
    },
    {
        "Eddie Cantor": "Eddie Cantor"
    },
    {
        " comedy  Whoopee!  .  Rival producer ": null
    },
    {
        "Robert M. Savini": "Robert M. Savini"
    },
    {
        " cashed in by compiling three of Kayes Educational Pictures shorts into a patchwork feature entitled The Birth of a Star . Studio mogul Goldwyn wanted Kayes prominent nose fixed to look less Jewish,  Kaye refused, but he did allow his red hair to be dyed blond, apparently because it looked better in Technicolor.         Kaye starred in a radio program,  The Danny Kaye Show , on CBS in 1945–46.  The programs popularity rose quickly. Before a year, he tied with ": null
    },
    {
        "Jimmy Durante": "Jimmy Durante"
    },
    {
        " for fifth place in the Radio Daily popularity poll. Kaye was asked to participate in a ": null
    },
    {
        "USO": "Uso"
    },
    {
        " tour following the end of World War II. It meant that he would be absent from his radio show for nearly two months at the beginning of the season. Kayes friends filled in, with a different guest host each week.  Kaye was the first American actor to visit postwar Tokyo. He had toured there some 10 years before with the vaudeville troupe.   When Kaye asked to be released from his radio contract in mid-1946, he agreed not to accept a regular radio show for one year and only limited guest appearances on other radio programs.  Many of the shows episodes survive today, notable for Kayes opening signature patter .     Kaye starred in several movies with actress ": null
    },
    {
        "Virginia Mayo": "Virginia Mayo"
    },
    {
        " in the 1940s and is known for films such as  The Secret Life of Walter Mitty  ,  The Inspector General  ,  On the Riviera  co-starring ": null
    },
    {
        "Gene Tierney": "Gene Tierney"
    },
    {
        ",  Knock on Wood  ,  White Christmas  ,  The Court Jester  , and  Merry Andrew  . Kaye starred in two pictures based on biographies,  Hans Christian Andersen  the Danish storyteller and  The Five Pennies  about jazz pioneer ": null
    },
    {
        "Red Nichols": "Red Nichols"
    },
    {
        ". His wife, writer/lyricist Sylvia Fine, wrote many tongue-twisting songs for which Kaye became famous. She was also an associate film producer.  Some of Kayes films included the theme of doubles, two people who look identical being mistaken for each other to comic effect  . While his wife wrote most of Kayes material, he created much of it himself, often while performing. Kaye had one character he never shared with the public; Kaplan, the owner of an ": null
    },
    {
        "Akron, Ohio": "Akron, Ohio"
    },
    {
        ", rubber company, came to life only for family and friends. His wife, Sylvia, described the Kaplan character:  He doesnt have any first name. Even his wife calls him just Kaplan. Hes an illiterate, pompous character who advertises his philanthropies. Jack Benny or Dore Schary might say, Kaplan, why do you hate unions so? If Danny feels like doing Kaplan that night, he might be off on Kaplan for two hours.     When he appeared at the ": null
    },
    {
        "London Palladium": "London Palladium"
    },
    {
        " in 1948, he roused the Royal family to laughter and was the first of many performers who have turned British variety into an American preserve.  Life  magazine described his reception as worshipful hysteria and noted that the royal family, for the first time, left the ": null
    },
    {
        "royal box": "Royal Box"
    },
    {
        " to watch from the front row of the orchestra.    He related that he had no idea of the familial connections when the ": null
    },
    {
        "Marquess of Milford Haven": "David Mountbatten, 3Rd Marquess Of Milford Haven"
    },
    {
        " introduced himself after a show and said he would like his cousins to see Kaye perform. Kaye stated he never returned to the venue because there was no way to recreate the magic of that time.   Kaye had an invitation to return to London for a  Royal Variety Performance  in November of the same year.      When the invitation arrived, Kaye was busy with The Inspector General . ": null
    },
    {
        "Warner Bros.": "Warner Bros."
    },
    {
        " stopped the film to allow their star to attend.  When his Decca co-workers ": null
    },
    {
        "the Andrews Sisters": "The Andrews Sisters"
    },
    {
        " began their engagement at the London Palladium on the heels of Kayes successful 1948 appearance there, the trio was well received and ": null
    },
    {
        "David Lewin": "David Lewin"
    },
    {
        " of the Daily Express declared: The audience gave the Andrews Sisters the Danny Kaye roar!     He hosted the ": null
    },
    {
        "24th Academy Awards": "24Th Academy Awards"
    },
    {
        " in 1952. The program was broadcast on radio. Telecasts of the Oscar ceremony came later. During the 1950s, Kaye visited Australia, where he played ": null
    },
    {
        "Buttons": "Buttons"
    },
    {
        " in a production of  Cinderella  in Sydney. In 1953, Kaye started a production company, Dena Pictures, named for his daughter. Knock on Wood was the first film produced by his firm. The firm expanded into television in 1960 under the name Belmont Television.       Kaye entered television in 1956, on the CBS show  See It Now  with ": null
    },
    {
        "Edward R. Murrow": "Edward R. Murrow"
    },
    {
        ".  The Secret Life of Danny Kaye combined his 50,000-mile, ten-country tour as UNICEF ambassador with music and humor.   His first solo effort was in 1960 with a onehour special produced by Sylvia and sponsored by ": null
    },
    {
        "General Motors": "General Motors"
    },
    {
        ", with similar specials in 1961 and 1962.        He hosted a  The Danny Kaye Show  from 1963 to 1967; it won four ": null
    },
    {
        "Emmy awards": "Emmy Awards"
    },
    {
        " and a ": null
    },
    {
        "Peabody award": "Peabody Award"
    },
    {
        ".   His last cinematic starring role came in 1963s  The Man from the Diners Club .     Beginning in 1964, he acted as television host to the CBS telecasts of ": null
    },
    {
        "MGMs": "Metro-Goldwyn-Mayer"
    },
    {
        "  The Wizard of Oz . Kaye did a stint as a  Whats My Line?  mystery guest on the Sunday-night CBS-TV quiz program. Kaye was later a guest panelist on that show. He also appeared on the interview program  Heres Hollywood . In the 1970s, Kaye tore a ligament in his leg during the run of the ": null
    },
    {
        "Richard Rodgers": "Richard Rodgers"
    },
    {
        " musical  Two by Two , but went on with the show, appearing with his leg in a cast and cavorting on stage in a wheelchair.  He had done much the same on his television show in 1964, when his right leg and foot were burned from a cooking accident. Camera shots were planned so television viewers did not see Kaye in his wheelchair.      In 1976, he played ": null
    },
    {
        "Mister Geppetto": "Mister Geppetto"
    },
    {
        " in a television musical adaptation of  Pinocchio  with ": null
    },
    {
        "Sandy Duncan": "Sandy Duncan"
    },
    {
        " in the title role. Kaye portrayed Captain Hook opposite Mia Farrow in a ": null
    },
    {
        "musical version of Peter Pan": "Peter Pan"
    },
    {
        " featuring songs by ": null
    },
    {
        "Anthony Newley": "Anthony Newley"
    },
    {
        " and ": null
    },
    {
        "Leslie Bricusse": "Leslie Bricusse"
    },
    {
        ". He later guest-starred in episodes of  The Muppet Show  and  The Cosby Show , and in the 1980s revival  New Twilight Zone .     In many films, as well as on stage, Kaye proved to be an able actor, singer, dancer, and comedian. He showed his serious side as ambassador for ": null
    },
    {
        "UNICEF": "Unicef"
    },
    {
        " and in his dramatic role in the memorable TV film  Skokie , when he played a ": null
    },
    {
        "Holocaust": "Holocaust"
    },
    {
        " survivor. Before his death in 1987, Kaye conducted an orchestra during a comical series of concerts organized for UNICEF fundraising. Kaye received two ": null
    },
    {
        "Academy Awards": "Academy Awards"
    },
    {
        "Academy Honorary Award": "Academy Honorary Award"
    },
    {
        " in 1955 and ": null
    },
    {
        "the Jean Hersholt Humanitarian Award": "The Jean Hersholt Humanitarian Award"
    },
    {
        " in 1982. That year he received the ": null
    },
    {
        "Screen Actors Guild": "Screen Actors Guild"
    },
    {
        " Annual Award.     In 1980, Kaye hosted and sang in the 25th anniversary of ": null
    },
    {
        "Disneyland": "Disneyland Park"
    },
    {
        " celebration and hosted the opening celebration for ": null
    },
    {
        "Epcot": "Epcot"
    },
    {
        " in 1982 . Both were aired on primetime television in the U.S.         Kaye was enamored of music. While he claimed an inability to read music, he was said to have ": null
    },
    {
        "perfect pitch": "Perfect Pitch"
    },
    {
        ". A flamboyant performer with his own distinctive style, easily adapting from outrageous novelty songs to tender ballads , in 1945, Kaye began hosting his own CBS radio program, launching a number of hit songs including Dinah and ": null
    },
    {
        "Minnie the Moocher": "Minnie The Moocher"
    },
    {
        ".      In 1947, Kaye teamed with the popular Andrews Sisters on Decca Records, producing the number-three Billboard hit Civilization . The success of the pairing prompted both acts to record through 1950, producing rhythmically comical fare as ": null
    },
    {
        "The Woody Woodpecker Song": "Woody Woodpecker  The Woody Woodpecker Song"
    },
    {
        " , Put em in a Box, Tie em with a Ribbon , The Big Brass Band from Brazil , Its a Quiet Town , Amelia Cordelia McHugh , Ching-a-ra-sa-sa , and a duet by Danny and Patty Andrews of ": null
    },
    {
        "Orange Colored Sky": "Orange Colored Sky"
    },
    {
        " . The acts teamed for two yuletide favorites: a frantic, harmonic rendition of A Merry Christmas at Grandmothers House and a duet by Danny and Patty, ": null
    },
    {
        "All I Want for Christmas Is My Two Front Teeth": "All I Want For Christmas Is My Two Front Teeth"
    },
    {
        " . Sforza, John: Swing It! The Andrews Sisters Story. University Press of Kentucky, 2000.     Kayes debut album, Columbia Presents Danny Kaye, had been released in 1942 by Columbia Records with songs performed to the accompaniment of ": null
    },
    {
        "Maurice Abravanel": "Maurice Abravanel"
    },
    {
        " and ": null
    },
    {
        "Johnny Green": "Johnny Green"
    },
    {
        ". The album was reissued as a Columbia LP in 1949 and is described by the critic Bruce Eder as a bit tamer than some of the stuff that Kaye hit with later in the 40s and in the 50s and, for reasons best understood by the public, doesnt attract nearly the interest of his kids records and overt comedy routines.      In 1950, a Decca single, Ive Got a Lovely Bunch of Coconuts , was released, his sole big U.S. chart hit. His second Columbia LP album Danny Kaye Entertains included six songs recorded in 1941 from his Broadway musical Lady in the Dark, most notably ": null
    },
    {
        "Tchaikovsky": "Tchaikovsky"
    },
    {
        ".      Following the success of the film Hans Christian Andersen , two of its songs written by ": null
    },
    {
        "Frank Loesser": "Frank Loesser"
    },
    {
        " and sung by Kaye, The Ugly Duckling and Wonderful Copenhagen , reached the top five on the UK pop charts. In 1953, Decca released Danny at the Palace, a live recording made at the New York Palace Theater,  followed by Knock On Wood a set of songs from the movie of the same name sung by Kaye, accompanied by ": null
    },
    {
        "Victor Young": "Victor Young"
    },
    {
        " and His Singing Strings.       In 1956, Kaye signed a three-year recording contract with ": null
    },
    {
        "Capitol Records": "Capitol Records"
    },
    {
        ", which released his single Love Me Do in December of that year. . Record details @ 45cat The B-side, Ciu Ciu Bella , with lyrics written by Sylvia Fine, was inspired by an episode in Rome when Kaye, on a mission for UNICEF, befriended a 7-year-old ": null
    },
    {
        "polio": "Polio"
    },
    {
        " victim in a childrens hospital, who sang this song for him in Italian. , Billboard Magazine, December 15, 1956, p. 30     In 1958, ": null
    },
    {
        "Saul Chaplin": "Saul Chaplin"
    },
    {
        " and ": null
    },
    {
        "Johnny Mercer": "Johnny Mercer"
    },
    {
        " wrote songs for Merry Andrew, a film starring Kaye as a British teacher attracted to the circus. The score added up to six numbers, all sung by Kaye; conductor Billy Mays 1950 composition Bozos Circus Band was deposited on the second side of the Merry Andrew soundtrack, released in 1958.  A year later, another soundtrack came out, The Five Pennies , featuring ": null
    },
    {
        "Louis Armstrong": "Louis Armstrong"
    },
    {
        ".      In the 1960s and 70s, Kaye regularly conducted world-famous orchestras, although he had to learn the scores by ear.  Kayes style, even if accompanied by unpredictable antics was praised by the likes of ": null
    },
    {
        "Zubin Mehta": "Zubin Mehta"
    },
    {
        ", who once stated that Kaye has a very efficient conducting style. His ability with an orchestra was mentioned by ": null
    },
    {
        "Dimitri Mitropoulos": "Dimitri Mitropoulos"
    },
    {
        ", then conductor of the ": null
    },
    {
        "New York Philharmonic Orchestra": "New York Philharmonic Orchestra"
    },
    {
        ". After Kayes appearance Mitropoulos remarked, Here is a man who is not musically trained, who cannot even read music and he gets more out of my orchestra than I have.  Kaye was invited to conduct symphonies as charity fundraisers and was the conductor of the all-city marching band at the season opener of the Los Angeles Dodgers in 1984. Over his career, he raised over US$5 million in support of musician pension funds.        Kaye was sufficiently popular to inspire imitations:   The 1946 ": null
    },
    {
        "Warner Bros.": "Warner Bros."
    },
    {
        " cartoon  Book Revue  had a sequence with ": null
    },
    {
        "Daffy Duck": "Daffy Duck"
    },
    {
        " wearing a blond wig and impersonating Kaye.    Satirical songwriter ": null
    },
    {
        "Tom Lehrers": "Tom Lehrer"
    },
    {
        "1953 song ": null
    },
    {
        "Lobachevsky": "Lobachevsky"
    },
    {
        " was based on a number that Kaye had done, about the Russian director ": null
    },
    {
        "Constantin Stanislavski": "Constantin Stanislavski"
    },
    {
        ", with the affected Russian accent. Lehrer mentioned Kaye in an opening monologue, citing him as an idol since childbirth.    ": null
    },
    {
        "Superman": "Superman"
    },
    {
        " creators ": null
    },
    {
        "Jerry Siegel": "Jerry Siegel"
    },
    {
        " and ": null
    },
    {
        "Joe Shuster": "Joe Shuster"
    },
    {
        " fashioned a short-lived superhero title,  Funnyman , taking inspiration from Kayes persona.           In his later years, Kaye entertained at home as chef. He specialized in Chinese and Italian cooking.  He had a custom-made Chinese restaurant installed at the rear of his house by its alley, then had a kitchen and dining area built around it. The stove that Kaye used for his Chinese dishes was fitted with metal rings for the burners to allow the heat to be highly concentrated, and a trough with circulating ice water cooled the area to keep the intense heat tolerable for those who were cooking.  He learned at Johnny Kans restaurant in San Francisco and with Cecilia Chang at her Mandarin restaurants in San Francisco and Los Angeles. He taught Chinese cooking classes at a San Francisco Chinese restaurant in the 1970s.  The theater and demonstration kitchen under the library at the ": null
    },
    {
        "Hyde Park, New York campus": "Hyde Park Campus Of The Culinary Institute Of America"
    },
    {
        " of the ": null
    },
    {
        "Culinary Institute of America": "Culinary Institute Of America"
    },
    {
        " is named for him.      Kaye referred to his kitchen as Yings Thing. While filming The Madwoman of Chaillot in France, he phoned home to ask his family if they would like to eat at Yings Thing that evening; Kaye flew home for dinner. Not all of his efforts in the kitchen went well. After flying to San Francisco for a recipe for sourdough bread, he came home and spent hours preparing loaves. When his daughter asked about the bread, Kaye hit the bread on the kitchen table; his bread was hard enough to chip it. Kaye approached kitchen work with enthusiasm, making sausages and other foods needed for his cuisine. His work as a chef earned him the ": null
    },
    {
        "Les Meilleurs Ouvriers de France": "Meilleur Ouvrier De France"
    },
    {
        " culinary award. Kaye is the only nonprofessional chef to have received this honor.       Kaye was an aviation enthusiast and pilot. His interest was sparked by his longtime friend, choreographer Michael Kidd, who had recently earned his private pilots license. Kaye began studying for his own pilots license in 1959. An enthusiastic and accomplished golfer, he gave up golf in favor of flying.  The first plane Kaye owned was a ": null
    },
    {
        "Piper Aztec": "Piper Pa-23"
    },
    {
        ".   Kaye received his first license as a private pilot of multi-engine aircraft, not being certified for operating a single-engine plane until six years later. He was an accomplished pilot, rated for airplanes ranging from single-engine light aircraft to multi-engine jets. Kaye held a commercial pilots license and had flown every type of aircraft except military planes.      Kaye received a ": null
    },
    {
        "type rating": "Type Rating"
    },
    {
        " in a ": null
    },
    {
        "Learjet": "Learjet"
    },
    {
        ", and he was named vice president of the Learjet company by ": null
    },
    {
        "Bill Lear": "Bill Lear"
    },
    {
        " as an honorary title .  He supported many flying projects. In 1968 he was honorary chairman of the Las Vegas International Exposition of Flight, a show that utilized many facets of the citys entertainment industry while presenting an air show. The operational show chairman was well-known aviation figure ": null
    },
    {
        "Lynn Garrison": "Lynn Garrison"
    },
    {
        ". Kaye flew a Learjet to 65 cities in five days on a mission to help UNICEF.       In 1958 Kaye and partner Lester Smith formed Kaye–Smith Enterprises. The company owned a chain of radio stations, mostly in the ": null
    },
    {
        "Pacific Northwest": "Pacific Northwest"
    },
    {
        ". Other Kaye–Smith divisions included a concert promotion company, a video production company, and a recording studio. Kaye sold his share of the company to the Smith family in 1985.        A lifelong fan of the Brooklyn/Los Angeles Dodgers, Kaye recorded a song called The D-O-D-G-E-R-S Song , describing a fictitious encounter with the San Francisco Giants, a hit during the real-life pennant chase of 1962. That song is included on  Baseballs Greatest Hits  compact discs. A good friend of ": null
    },
    {
        "Leo Durocher": "Leo Durocher"
    },
    {
        ", he often traveled with the team. He also possessed an encyclopedic knowledge of the game.      Kaye and his business partner Lester Smith also led an investment group which was awarded the American Leagues thirteenth franchise, which became the ": null
    },
    {
        "Seattle Mariners": "Seattle Mariners"
    },
    {
        " for US$6.2 million on February 7, 1976.   Retrieved December 10, 2017 The ownership percentages of Kaye, Smith and two other remaining original investors were reduced to 5 percent each when ": null
    },
    {
        "George Argyros": "George Argyros"
    },
    {
        " purchased 80 percent of the Mariners for $10.4 million on January 30, 1981.  Retrieved December 10, 2017 Kaye sold all of his business interests to Smiths family in 1985.  Retrieved December 10, 2017       Kaye was an honorary member of the ": null
    },
    {
        "American College of Surgeons": "American College Of Surgeons"
    },
    {
        " and the ": null
    },
    {
        "American Academy of Pediatrics": "American Academy Of Pediatrics"
    },
    {
        ".          Working alongside UNICEFs Halloween fundraiser founder, Ward Simon Kimball Jr., the actor educated the public on impoverished children in deplorable living conditions overseas and assisted in the distribution of donated goods and funds. His involvement with UNICEF came about in an unusual way. Kaye was flying home from London in 1949 when one of the planes four engines lost its propeller and caught fire. The problem was initially thought serious enough that it might make an ocean landing; life jackets and life rafts were made ready.     The plane was able to head back over 500 miles to land at ": null
    },
    {
        "Shannon Airport": "Shannon Airport"
    },
    {
        ", Ireland. On the way back to Shannon, the head of the Childrens Fund, ": null
    },
    {
        "Maurice Pate": "Maurice Pate"
    },
    {
        ", had the seat next to Danny Kaye and spoke at length about the need for recognition for the fund. Their discussion continued on the flight from Shannon to New York; it was the beginning of the actors long association with UNICEF.        For all of his success as a performer . . . his greatest legacy remains his tireless humanitarian work—so close were his ties to the United Nations International Childrens Emergency Fund that when the organization received the Nobel Peace Prize, Kaye was tapped to accept it, according to music critic Jason Ankeny.       Kaye died of heart failure on March 3, 1987, aged 76, brought on by internal bleeding and complications of ": null
    },
    {
        "hepatitis C": "Hepatitis C"
    },
    {
        ".  Kaye had quadruple bypass heart surgery in February 1983; he contracted hepatitis C from a blood transfusion.        His ashes are interred in ": null
    },
    {
        "Kensico Cemetery": "Kensico Cemetery"
    },
    {
        " in ": null
    },
    {
        "Valhalla": "Valhalla, New York"
    },
    {
        ", New York. Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 . McFarland & Company, Inc., Publishers. Kindle Edition. His grave is adorned with a bench that contains ": null
    },
    {
        "friezes": "Frieze"
    },
    {
        "of a baseball and bat, an aircraft, a piano, a flower pot, musical notes, and a chefs ": null
    },
    {
        "toque": "Toque"
    },
    {
        ". His name and birth and death dates are inscribed on the toque. The United Nations held a memorial tribute to him at their New York headquarters on the evening of October 21, 1987.       The Sylvia and Danny Kaye Playhouse at ": null
    },
    {
        "Hunter College": "Hunter College"
    },
    {
        " in New York was opened in 1988, with a $1 million gift from Sylvia Kaye.           Kaye and ": null
    },
    {
        "Sylvia Fine": "Sylvia Fine"
    },
    {
        " grew up in Brooklyn, living a few blocks apart, but they did not meet until they were working on an off-Broadway show in 1939.  Sylvia was an audition pianist.       Sylvia discovered that Danny had worked for her father Samuel Fine, a dentist. Kaye, working in Florida, proposed on the telephone; the couple were married in ": null
    },
    {
        "Fort Lauderdale": "Fort Lauderdale"
    },
    {
        "  on January 3, 1940.    The couple were married for life except for a separation in 1947 and 1948, when Kaye was involved with ": null
    },
    {
        "Eve Arden": "Eve Arden"
    },
    {
        ".      The couples only child, daughter Dena, was born on December 17, 1946.  When she was very young, Dena did not like seeing her father perform because she did not understand that people were supposed to laugh at what he did.  Kaye said in a 1954 interview, Whatever she wants to be she will be without interference from her mother nor from me.   Dena grew up to become a journalist.      On 18 January 2013, during a 24-hour salute to Kaye on ": null
    },
    {
        "Turner Classic Movies": "Turner Classic Movies"
    },
    {
        " in celebration of what TCM thought was his 100th birthday, Kayes daughter, Dena, revealed to TCM host ": null
    },
    {
        "Ben Mankiewicz": "Ben Mankiewicz"
    },
    {
        " that Kayes stated birth year of 1913 was incorrect, and that he was actually born in 1911.         A Democrat, he supported ": null
    },
    {
        "Adlai Stevensons": "Adlai Stevenson Ii"
    },
    {
        "campaign during the ": null
    },
    {
        "1952 presidential election": "1952 United States Presidential Election"
    },
    {
        ". Motion Picture and Television Magazine, November 1952, page 33, Ideal Publishers                 ": null
    },
    {
        "Margrethe II of Denmark": "Margrethe Ii Of Denmark"
    },
    {
        " on November 10, 1983. He was awarded the cross of the ": null
    },
    {
        "Knight of the Dannebrog": "Knight Of The Dannebrog"
    },
    {
        ", 1st Class, for his work with UNICEF and longstanding ties with Denmark. Kaye portrayed ": null
    },
    {
        "Hans Christian Andersen": "Hans Christian Andersen"
    },
    {
        " in the 1952 film of the same name.    Chevalier of the French ": null
    },
    {
        "Legion of Honor": "Legion Of Honor"
    },
    {
        " on February 24, 1986, for his work for UNICEF.   On June 23, 1987, Kaye was posthumously presented with the ": null
    },
    {
        "Presidential Medal of Freedom": "Presidential Medal Of Freedom"
    },
    {
        " by President ": null
    },
    {
        "Ronald Reagan": "Ronald Reagan"
    },
    {
        ". The award was received by his daughter Dena.     In 1988, Kaye was posthumously inducted into the ": null
    },
    {
        "American Theater Hall of Fame": "American Theater Hall Of Fame"
    },
    {
        ".    UNICEF created the Danny Kaye International Childrens Award in his honor, a childrens European singing competition shown every year between 1988 and 1992 hosted by ": null
    },
    {
        "Audrey Hepburn": "Audrey Hepburn"
    },
    {
        " and ": null
    },
    {
        "Roger Moore": "Roger Moore"
    },
    {
        ". ": null
    },
    {
        "Golden Globe Award": "Golden Globe Award"
    },
    {
        " for ": null
    },
    {
        "Best Actor – Motion Picture Musical or Comedy": "Golden Globe Award For Best Actor – Motion Picture Musical Or Comedy1950S"
    },
    {
        " in 1951, for  On the Riviera  ": null
    },
    {
        "Best Actor – Motion Picture Musical or Comedy": "16Th Golden Globe Awardsbest Actor – Musical Or Comedy"
    },
    {
        " in 1958, for  Me and the Colonel  ": null
    },
    {
        "Lions Clubs International": "Lions Clubs International"
    },
    {
        " The first recipient of the Lions Clubs International Foundations Humanitarian Award.    ": null
    },
    {
        "Jean Hersholt Humanitarian Award": "Jean Hersholt Humanitarian Award"
    },
    {
        "   Asteroid ": null
    },
    {
        "6546 Kaye": "6546 Kaye"
    },
    {
        " Hollywood Walk of Fame": "Hollywood Walk Of Fame"
    },
    {
        "; for his work in music, radio, and films    ": null
    },
    {
        "Kennedy Center Honor": "Kennedy Center Honor"
    },
    {
        "   Grand Marshal": "Grand Marshals Of The Tournament Of Roses Parade1980S"
    },
    {
        " of the ": null
    },
    {
        "Tournament of Roses Parade": "Tournament Of Roses Parade"
    },
    {
        "   The song I Wish I Was Danny Kaye on ": null
    },
    {
        "Miracle Legions": "Miracle Legion"
    },
    {
        "1996 album  Portrait of a Damaged Family     In December 1996, the PBS series  American Masters  aired a special on Kayes life.    A street in the San Antonio, Texas, neighborhood Oak Hills Terrace is named after Danny Kaye.  The neighborhood was established in the late 1960s.    The careers of Kaye and Fine are immortalized in The Danny Kaye and Sylvia Fine Collection at the ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        ". The materials preserved in the collection include manuscripts, scores, scripts, photographs, sound recordings, and video clips.    On June 9, 1986, Danny Kaye was crowned King of Brooklyn at the Back to Brooklyn Day Festival. Danny Kaye was there to accept his crown.                 Autumn Laughter   The Secret Life of Danny Kaye    An Hour With Danny Kaye   The Danny Kaye Show with Lucille Ball   ": null
    },
    {
        "The Danny Kaye Show": "The Danny Kaye Show"
    },
    {
        "   The Lucy Show": "The Lucy Show"
    },
    {
        "Here Comes Peter Cottontail": "Here Comes Peter Cottontail"
    },
    {
        "   The Dick Cavett Show": "The Dick Cavett Show"
    },
    {
        "   The Enchanted World of Danny Kaye: The Emperors New Clothes   An Evening with John Denver   ": null
    },
    {
        "Pinocchio": "Pinocchio"
    },
    {
        " ; live action television musical adaptation starring Kaye as Gepetto and Sandy Duncan in the title role   ": null
    },
    {
        "Peter Pan": "Peter Pan"
    },
    {
        " ; live action television musical adaptation starring Mia Farrow in the title role, and Kaye as Captain Hook   ": null
    },
    {
        "The Muppet Show": "The Muppet Show"
    },
    {
        "   Disneylands 25th Anniversary   An Evening with Danny Kaye   ": null
    },
    {
        "Skokie": "Skokie"
    },
    {
        "   The Wonderful World of Disney Official Opening of Epcot Center television special   ": null
    },
    {
        "The Twilight Zone": "The Twilight Zone"
    },
    {
        "The Cosby Show": "The Cosby Show"
    },
    {
        "The Straw Hat Revue   ": null
    },
    {
        "Lady in the Dark": "Lady In The Dark"
    },
    {
        "   Lets Face It!": "Lets Face It!"
    },
    {
        "   Two by Two": "Two By Two"
    },
    {
        "         Danny Kaye   Gilbert And Sullivan And Danny Kaye   Danny Kaye Entertains   Mommy, Gimme a Drinka Water   The Five Pennies       Hans Christian Andersen   Knock on Wood   Court Jester   Merry Andrew       Danny Kaye for Children   Danny Kaye Tells 6 Stories from Faraway Places       ": null
    },
    {
        "Selections from Irving Berlins White Christmas": "Selections From Irving Berlins White Christmas"
    },
    {
        "   Two by Two": null
    }
]