[
    {
        "   A debit card  is a ": null
    },
    {
        "plastic": "Iso/Iec 7812"
    },
    {
        " payment card": "Payment Card"
    },
    {
        " that can be used instead of ": null
    },
    {
        "cash": "Cash"
    },
    {
        " when making purchases. It is similar to a ": null
    },
    {
        "credit card": "Credit Card"
    },
    {
        ", but unlike a credit card, the money is immediately transferred directly from the cardholders ": null
    },
    {
        "bank account": "Bank Account"
    },
    {
        " when performing any transaction.     Some cards might carry a ": null
    },
    {
        "stored value": "Stored-Value Card"
    },
    {
        " with which a payment is made, while most relay a message to the cardholders bank to withdraw funds from a payers designated bank account. In some cases, the ": null
    },
    {
        "primary account number": "Primary Account Number"
    },
    {
        " is assigned exclusively for use on the Internet and there is no physical card.     In many countries, such as most of Western Europe, the use of debit cards has become so widespread that their volume has overtaken or entirely replaced ": null
    },
    {
        "cheques": "Cheque"
    },
    {
        " and, in some instances, cash transactions. The development of debit cards, unlike credit cards and ": null
    },
    {
        "charge cards": "Charge Card"
    },
    {
        ", has generally been country specific resulting in a number of different systems around the world, which were often incompatible. Since the mid-2000s, a number of initiatives have allowed debit cards issued in one country to be used in other countries and allowed their use for internet and phone purchases.     Debit cards usually also allow instant withdrawal of cash, acting as an ": null
    },
    {
        "ATM card": "Atm Card"
    },
    {
        " for this purpose. Merchants may also offer ": null
    },
    {
        "cashback": "Debit Card Cashback"
    },
    {
        " facilities to customers, so that a customer can withdraw cash along with their purchase.               There are currently three ways that debit card transactions are processed:  EFTPOS  , offline debit , and the Electronic Purse Card System.  One physical card can include the functions of all three types, so that it can be used in a number of different circumstances.     Although the four largest bank card issuers  all offer debit cards, there are many other types of debit card, each accepted only within a particular country or region, for example ": null
    },
    {
        "Switch": "Switch"
    },
    {
        " and ": null
    },
    {
        "Solo": "Solo"
    },
    {
        " in the United Kingdom, ": null
    },
    {
        "Interac": "Interac"
    },
    {
        " in Canada, ": null
    },
    {
        "Carte Bleue": "Carte Bleue"
    },
    {
        " in France, ": null
    },
    {
        "EC electronic cash": "Electronic Cash"
    },
    {
        "  in Germany, ": null
    },
    {
        "UnionPay": "Unionpay"
    },
    {
        " in China, ": null
    },
    {
        "RuPay": "Rupay"
    },
    {
        " in India and EFTPOS cards in Australia and New Zealand. The need for ": null
    },
    {
        "cross-border compatibility": "Single Euro Payments Area"
    },
    {
        " and the advent of the ": null
    },
    {
        "euro": "Euro"
    },
    {
        " recently led to many of these card networks  being re-branded with the internationally recognized ": null
    },
    {
        "Maestro": "Maestro"
    },
    {
        " logo, which is part of the MasterCard brand. Some debit cards are dual branded with the logo of the national card as well as ": null
    },
    {
        "Maestro": "Maestro"
    },
    {
        " . The use of a debit card system allows operators to package their product more effectively while monitoring customer spending.       Online debit cards require electronic authorization of every transaction and the debits are reflected in the users account immediately. The transaction may be additionally secured with the ": null
    },
    {
        "personal identification number": "Personal Identification Number"
    },
    {
        " authentication": "Authentication"
    },
    {
        " system; some online cards require such authentication for every transaction, essentially becoming enhanced ": null
    },
    {
        "automatic teller machine": "Automatic Teller Machine"
    },
    {
        "  cards": "Atm Card"
    },
    {
        ".     One difficulty with using online debit cards is the necessity of an electronic authorization device at the ": null
    },
    {
        "point of sale": "Point Of Sale"
    },
    {
        " and sometimes also a separate ": null
    },
    {
        "PINpad": "Pinpad"
    },
    {
        " to enter the PIN, although this is becoming commonplace for all card transactions in many countries.     Overall, the online debit card is generally viewed as superior to the offline debit card because of its more secure authentication system and live status, which alleviates problems with processing ": null
    },
    {
        "lag": "Lag"
    },
    {
        " on transactions that may only issue online debit cards. Some on-line debit systems are using the normal authentication processes of Internet banking to provide real-time online debit transactions.       Offline debit cards have the ": null
    },
    {
        "logos": "Logo"
    },
    {
        " of major credit cards  or major debit cards  and are used at the ": null
    },
    {
        "point of sale": "Point Of Sale"
    },
    {
        " like a credit card . This type of debit card may be subject to a daily limit, and/or a maximum limit equal to the current/checking account balance from which it draws funds. Transactions conducted with offline debit cards require 2–3 days to be reflected on users’ account balances.     In some countries and with some banks and merchant service organizations, a credit or offline debit transaction is without cost to the purchaser beyond the face value of the transaction, while a fee may be charged for a debit or online debit transaction . Other differences are that online debit purchasers may opt to withdraw cash in addition to the amount of the debit purchase ; also, from the merchants standpoint, the merchant pays lower fees on online debit transaction as compared to credit .       ": null
    },
    {
        "Smart-card": "Smart Card"
    },
    {
        "-based electronic purse systems are in use throughout Europe since the mid-1990s, most notably in Germany , Austria , the Netherlands , Belgium , Switzerland and France . In Austria and Germany, almost all current bank cards now include electronic purses, whereas the electronic purse has been recently phased out in the Netherlands.           Prepaid debit cards are reloadable and can be also called reloadable debit cards.         The primary market for prepaid debit cards has traditionally been ": null
    },
    {
        "unbanked": "Unbanked"
    },
    {
        " people;  that is, people who do not use banks or credit unions for their financial transactions.  But prepaid cards also appeal to other users attracted by their advantages.         Advantages of prepaid debit cards include being safer than carrying cash, worldwide functionality due to Visa and MasterCard merchant acceptance, not having to worry about paying a credit card bill or going into debt, the opportunity for anyone over the age of 18 to apply and be accepted without regard to credit quality, and the option to directly deposit paychecks and government benefits onto the card for free.        If the card provider offers an insecure website for letting you check the cards balance, this could give an attacker access to the card information. OneVanilla.com in your browser address bar might not show up as secure.   If you lose the card, and have not somehow registered it, the user likely loses the money. If a provider has technical issues, the money might not be accessible when a user needs it. Some companies payment systems do not appear to accept prepaid debit cards. An Amtrak onboard ticket purchase several years ago was one case where a prepaid card was not accepted. There is also a risk that prolific use of prepaid debit cards could lead data provider companies to miscategorize a user in unfortunate ways.       Prepaid cards vary by the issuer company: key and niche financial players, , purpose of usage , and regions.       Some of the first companies to enter this market were: MiCash, RushCard, Netspend, and Green Dot who gained market share as a result of being first to market. However, since 1999, there have been several new providers, such as TransCash, 247card, iKobo, Ripae Card, Argent Card, EuroPYM, AsiaPYM, & DrawPay Card. These prepaid card companies offer a number of benefits, such as money ": null
    },
    {
        "remittance": "Remittance"
    },
    {
        " services, card-to-card transfers, and the ability to apply without a social security number.     In 2009 a company called  launched a corporate expense card service aimed at business users.     As of 2019, many other companies also offer the cards.       As of 2013, several city governments  are now offering prepaid debit cards, either as part of a municipal ID card  in the case of Oakland, or in conjunction with a prepaid transit pass . These cards have been heavily criticized   for their higher-than-average fees, including some that similar products offered by Green Dot and American Express do not have.     The U.S. federal government uses prepaid debit cards to make benefits payments to people who do not have bank accounts. In 2008, the ": null
    },
    {
        "U.S. Treasury Department": "U.S. Treasury Department"
    },
    {
        " paired with ": null
    },
    {
        "Comerica Bank": "Comerica Bank"
    },
    {
        " to offer the Direct Express Debit MasterCard prepaid debit card.  , BankCreditNews, 15 Apr 2013, Accessed 2013-04-22.     In July 2013, the ": null
    },
    {
        "Association of Government Accountants": "Association Of Government Accountants"
    },
    {
        " released a report on government use of prepaid cards, concluding that such programs offer a number of advantages to governments and those who receive payments on a prepaid card rather than by check. The prepaid card programs benefit payments largely for cost savings they offer and provide easier access to cash for recipients, as well as increased security. The report also advises that governments should consider replacing any remaining ": null
    },
    {
        "cheque": "Cheque"
    },
    {
        "-based payments with prepaid card programs in order to realize substantial savings for taxpayers, as well as benefits for payees.        In January 2016, the UK government introduced fee-free basic bank accounts for all, having a significant impact on the prepaid industry, including the departure of a number of firms.        Consumer protections vary, depending on the network used. Visa and MasterCard, for instance, prohibit minimum and maximum purchase sizes, surcharges, and arbitrary security procedures on the part of merchants. Merchants are usually charged higher transaction fees for credit transactions, since debit network transactions are less likely to be fraudulent. This may lead them to steer customers to debit transactions. Consumers disputing charges may find it easier to do so with a credit card, since the money will not immediately leave their control. Fraudulent charges on a debit card can also cause problems with a ": null
    },
    {
        "checking account": "Checking Account"
    },
    {
        " because the money is withdrawn immediately and may thus result in an overdraft or ": null
    },
    {
        "bounced checks": "Bounced Check"
    },
    {
        ". In some cases debit card-issuing banks will promptly refund any disputed charges until the matter can be settled, and in some jurisdictions the consumer liability for unauthorized charges is the same for both debit and credit cards.     In some countries, like India and Sweden, the consumer protection is the same regardless of the network used. Some banks set minimum and maximum purchase sizes, mostly for online-only cards. However, this has nothing to do with the card networks, but rather with the banks judgement of the persons age and credit records. Any fees that the customers have to pay to the bank are the same regardless of whether the transaction is conducted as a credit or as a debit transaction, so there is no advantage for the customers to choose one transaction mode over another. Shops may add surcharges to the price of the goods or services in accordance with laws allowing them to do so. Banks consider the purchases as having been made at the moment when the card was swiped, regardless of when the purchase settlement was made. Regardless of which transaction type was used, the purchase may result in an overdraft because the money is considered to have left the account at the moment of the card swiping.       Debit cards and ": null
    },
    {
        "secured credit cards": "Secured Credit Card"
    },
    {
        " are popular among college students who have not yet established a credit history. Debit cards may also be used by ": null
    },
    {
        "expatriate": "Expatriate"
    },
    {
        "d workers to send money home to their families holding an affiliated debit card.       The consumer perceives a debit transaction as occurring in real time: the money is withdrawn from their account immediately after the authorization request from the merchant, which in many countries, is the case when making an online debit purchase. However, when a purchase is made using the credit option, the transaction merely places an ": null
    },
    {
        "authorization hold": "Authorization Hold"
    },
    {
        " on the customers account; funds are not actually withdrawn until the transaction is reconciled and hard-posted to the customers account, usually a few days later. However, the previoce applies to all kinds of transaction types, at least when using a card issued by a European bank. This is in contrast to a typical credit card transaction, in which, after a few days delay before the transaction is posted to the account, there is a further period of maybe a month before the consumer makes repayment.     Because of this, in the case of an intentional or unintentional error by the merchant or bank, a debit transaction may cause more serious problems than a credit card transaction . This is especially true in the United States, where ": null
    },
    {
        "check fraud": "Check Fraud"
    },
    {
        " is a crime in every state, but exceeding your credit limit is not.       Debit cards may also be used on the Internet either with or without using a PIN. Internet transactions may be conducted in either online or offline mode, although shops accepting online-only cards are rare in some countries , while they are common in other countries . For a comparison, ": null
    },
    {
        "PayPal": "Paypal"
    },
    {
        " offers the customer to use an online-only Maestro card if the customer enters a Dutch address of residence, but not if the same customer enters a Swedish address of residence.     Internet purchases can be authenticated by the consumer entering their PIN if the merchant has enabled a secure online PIN pad, in which case the transaction is conducted in debit mode. Otherwise, transactions may be conducted in either credit or debit mode , and this has nothing to do with whether the transaction was conducted in online or offline mode, since both credit and debit transactions may be conducted in both modes.          In some countries, banks tend to levy a small fee for each debit card transaction. In some countries the merchants bear all the costs and customers are not charged. There are many people who routinely use debit cards for all transactions, no matter how small. Some retailers refuse to accept debit cards for small transactions, where paying the transaction fee would absorb the ": null
    },
    {
        "profit margin": "Profit Margin"
    },
    {
        " on the sale, making the transaction uneconomic for the retailer.          The banks in Angola issue by official regulation only one brand of debit cards: ": null
    },
    {
        "Multicaixa": "Multicaixa"
    },
    {
        ", which is also the brand name of the one and only network of ATMs and POS terminals.       ArCa - a national system of debit and credit cards popular in Armenia. Established in 2000 by 17 largest Armenian banks.          Debit cards in ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " are called different names depending on the issuing bank: ": null
    },
    {
        "Commonwealth Bank of Australia": "Commonwealth Bank"
    },
    {
        "Westpac Banking Corporation": "Westpac"
    },
    {
        "National Australia Bank": "National Australia Bank"
    },
    {
        "ANZ Bank": "Anz Bank"
    },
    {
        "Bendigo Bank": "Bendigo Bank"
    },
    {
        "credit cards": "Credit Card"
    },
    {
        ", regardless of the bank that issued the card, including ": null
    },
    {
        "Maestro": "Maestro"
    },
    {
        " cards issued by foreign banks, with most businesses accepting them, with 450,000 point of sale terminals.      EFTPOS cards can also be used to deposit and withdraw cash over the counter at ": null
    },
    {
        "Australia Post": "Australia Post"
    },
    {
        " outlets participating in Giro Post and withdrawals without purchase from certain major retailers, just as if the transaction was conducted at a bank branch, even if the bank branch is closed. Electronic transactions in Australia are generally processed via the ": null
    },
    {
        "Telstra Argent": "Telstra Argent"
    },
    {
        " and ": null
    },
    {
        "Optus Transact Plus": "Optus Transact Plus"
    },
    {
        " network - which has recently superseded the old ": null
    },
    {
        "Transcend": "Telstra Transcend"
    },
    {
        " network in the last few years. Most early keycards were only usable for EFTPOS and at ATM or bank branches, whilst the new debit card system works in the same way as a credit card, except it will only use funds in the specified bank account. This means that, among other advantages, the new system is suitable for electronic purchases without a delay of two to four days for bank-to-bank money transfers.     Australia operates both electronic credit card transaction authorization and traditional EFTPOS debit card authorization systems, the difference between the two being that EFTPOS transactions are authorized by a personal identification number while credit card transactions can additionally be authorized using a ": null
    },
    {
        "contactless payment": "Contactless Payment"
    },
    {
        " mechanism . If the user fails to enter the correct pin three times, the consequences range from the card being locked out for a minimum 24-hour period, a phone call or trip to the branch to reactivate with a new PIN, the card being cut up by the merchant, or in the case of an ATM, being kept inside the machine, both of which require a new card to be ordered.     Generally credit card transaction costs are borne by the merchant with no fee applied to the end user while EFTPOS transactions cost the consumer an applicable withdrawal fee charged by their bank.     The introduction of Visa and MasterCard debit cards along with regulation in the settlement fees charged by the operators of both EFTPOS and credit cards by the Reserve Bank has seen a continuation in the increasing ubiquity of credit card use among Australians and a general decline in the profile of EFTPOS. However, the regulation of settlement fees also removed the ability of banks, who typically provide merchant services to retailers on behalf of Visa or MasterCard, from stopping those retailers charging extra fees to take payment by credit card instead of cash or EFTPOS.       In Bahrain debit cards are under ": null
    },
    {
        "Benefit": "The Benefit Company"
    },
    {
        ", the interbanking network for Bahrain. Benefit is also accepted in other countries though, mainly GCC, similar to the ": null
    },
    {
        "Saudi Payments Network": "Saudi Payments Network"
    },
    {
        " and the Kuwaiti ": null
    },
    {
        "KNET": "Knet"
    },
    {
        ".       In Belgium debit cards are widely accepted in most of the stores and shops, as well as in most of the hotels and restaurants. Smaller restaurants or small shops often accept only Debit Cards or cash but no ": null
    },
    {
        "credit cards": "Credit Card"
    },
    {
        ". All Belgian banks provide debit cards when you open a bank account. Usually, it is free to use debit cards on national and EU ATMs even if they arent owned by the issuing bank. Since 2019 a few banks charge a 0,50€ cost when using ATMs who are not owned by the issuing bank. The debit cards in Belgium are branded with the logo of the national Bancontact system and also with an international debit system, Maestro , the Maestro system is used mostly for payments in other countries but a few national card payment services use the Maestro system. Some banks also offer Visa and MasterCard debit cards but these are mostly online banks.       In Brazil debit cards are called cartão de débito and got popular from 2008 and on. In 2013, the 100 millionth Brazilian debit card was issued.  Debit cards replaced ": null
    },
    {
        "cheques": "Cheque"
    },
    {
        ", common until the first decade of the 2000s.     Today, the majority of the financial transactions are made using debit cards . Nowadays, the majority of debit payments are processed using a card + pin combination, and almost every card comes with a chip to make transactions.     The major debit card vendors in Brazil are Visa and MasterCard , as well as local brand Elo.                In Bulgaria, debit cards are accepted in almost all stores and shops, as well as in most of the hotels and restaurants in the bigger cities. Smaller restaurants or small shops often accept cash only. All Bulgarian banks can provide debit cards when you open a bank account, for maintenance costs. The most common cards in Bulgaria are contactless with the brands of Debit Mastercard and Visa Debit .  All POS terminals and ATMs accept Visa, Visa Electron, Visa Debit, VPay, Mastercard, Debit Mastercard, Maestro and Bcard.  Also some POS terminals and ATMs accept Discover, American Express, Diners Club, JCB and UnionPay.  Almost all POS terminals in Bulgaria support contactless payments. Credit cards are also common in Bulgaria. Paying with smartphones/smartwatches at POS terminals is also getting common.                    ": null
    },
    {
        "Canada": "Canada"
    },
    {
        " has a nationwide EFTPOS system, called ": null
    },
    {
        "Interac Direct Payment": "Interac"
    },
    {
        " . Since being introduced in 1994, IDP has become the most popular payment method in the country. Previously, debit cards have been in use for ": null
    },
    {
        "ABM": "Automated Bank Machine"
    },
    {
        " usage since the late 1970s, with ": null
    },
    {
        "credit unions": "Credit Union"
    },
    {
        " in Saskatchewan and Alberta introducing the first card-based, networked ATMs beginning in June 1977. Debit cards, which could be used anywhere a credit card was accepted, were first introduced in Canada by Saskatchewan Credit Unions in 1982.  In the early 1990s, pilot projects were conducted among Canadas six largest banks to gauge security, accuracy and feasibility of the Interac system. Slowly in the later half of the 1990s, it was estimated that approximately 50% of retailers offered Interac as a source of payment. Retailers, many small transaction retailers like coffee shops, resisted offering IDP to promote faster service. In 2009, 99% of retailers offer IDP as an alternative payment form.     In Canada, the debit card is sometimes referred to as a bank card . It is a client card issued by a bank that provides access to funds and other bank account transactions, such as transferring funds, checking balances, paying bills, etc., as well as point of purchase transactions connected on the ": null
    },
    {
        "Interac": "Interac"
    },
    {
        " network. Since its national launch in 1994, Interac Direct Payment has become so widespread that, as of 2001, more transactions in Canada were completed using debit cards than cash.  This popularity may be partially attributable to two main factors: the convenience of not having to carry cash, and the availability of automated bank machines and direct payment merchants on the network.     Debit cards may be considered similar to ": null
    },
    {
        "stored-value cards": "Stored-Value Card"
    },
    {
        " in that they represent a finite amount of money owed by the card issuer to the holder. They are different in that stored-value cards are generally anonymous and are only usable at the issuer, while debit cards are generally associated with an individuals bank account and can be used anywhere on the ": null
    },
    {
        "Interac": "Interac"
    },
    {
        " network.     In Canada, the bank cards can be used at POS and ABMs. Interac Online has also been introduced in recent years allowing clients of most major Canadian banks to use their debit cards for online payment with certain merchants as well. Certain financial institutions also allow their clients to use their debit cards in the United States on the NYCE network.        Consumers in Canada are protected under a voluntary code entered into by all providers of debit card services, The Canadian Code of Practice for Consumer Debit Card Services  . Adherence to the Code is overseen by the ": null
    },
    {
        "Financial Consumer Agency of Canada": "Financial Consumer Agency Of Canada"
    },
    {
        " , which investigates consumer complaints.     According to the FCAC website, revisions to the code that came into effect in 2005 put the onus on the financial institution to prove that a consumer was responsible for a disputed transaction, and also place a limit on the number of days that an account can be frozen during the financial institutions investigation of a transaction.       ": null
    },
    {
        "Chile": "Chile"
    },
    {
        " has an EFTPOS system called Redcompra which is currently used in at least 23,000 establishments throughout the country. Goods may be purchased using this system at most supermarkets, retail stores, pubs and restaurants in major urban centers. Chilean banks issue Maestro, Visa Electron and Visa Debit cards.       ": null
    },
    {
        "Colombia": "Colombia"
    },
    {
        " has a system called Redeban-Multicolor and Credibanco Visa which are currently used in at least 23,000 establishments throughout the country. Goods may be purchased using this system at most supermarkets, retail stores, pubs and restaurants in major urban centers. Colombian debit cards are Maestro , Visa Electron , Visa Debit and MasterCard-Debit .                The Danish debit card ": null
    },
    {
        "Dankort": "Dankort"
    },
    {
        " is ubiquitous in ": null
    },
    {
        "Denmark": "Denmark"
    },
    {
        ". It was introduced on 1 September 1983, and despite the initial transactions being paper-based, the Dankort quickly won widespread acceptance. By 1985 the first ": null
    },
    {
        "EFTPOS terminals": "Eftpos Terminal"
    },
    {
        " were introduced, and 1985 was also the year when the number of Dankort transactions first exceeded 1  million.  Today Dankort is primarily issued as a Multicard combining the national Dankort with the more internationally recognized Visa . In September 2008, 4 million cards have been issued, of which three million cards were Visa/Dankort cards. It is also possible to get a Visa Electron debit card and MasterCard. ": null
    },
    {
        "PBS": ":Da:Pbs"
    },
    {
        " , the Danish operator of the Dankort system, processed a total of 737  million Dankort transactions.  Of these, 4.5  million were processed on just a single day, 21 December. This remains the current record. , there were 3.9  million Dankort cards in existence.   , more than 80,000 Danish shops had a Dankort terminal, and another 11,000 internet shops also accepted the Dankort.       Most daily customer transactions are carried out with debit cards or online giro/electronic bill payment, although credit cards and cash are accepted. Checks are no longer used. Prior to European standardization, Finland had a national standard . Physically, a pankkikortti was the same as an international credit card, and the same card imprinters and slips were used for pankkikortti and credit cards, but the cards were not accepted abroad. This has now been replaced by the Visa and MasterCard debit card systems, and Finnish cards can be used elsewhere in the European Union and the world.     An electronic purse system, with a chipped card, was introduced, but did not gain much traction.     Signing a payment offline entails incurring debt, thus offline payment is not available to minors. However, online transactions are permitted, and since almost all stores have electronic terminals, today also minors can use debit cards. Previously, only cash withdrawal from ATMs was available to minors .       Carte Bancaire , the national payment scheme, in 2008, had 57.5  million cards carrying its logo and 7.76  billion transactions were processed through the e-rsb network . Most CB cards are debit cards, either debit or deferred debit. Less than 10% of CB cards were credit cards.     Banks in France usually charge annual fees for debit cards , yet they do not charge personal customers for checkbooks or processing checks . This imbalance dates from the unilateral introduction in France of ": null
    },
    {
        "Chip and PIN": "Chip And Pin"
    },
    {
        " debit cards in the early 1990s, when the cost of this technology was much higher than it is now. Credit cards of the type found in the United Kingdom and United States are unusual in France and the closest equivalent is the deferred debit card, which operates like a normal debit card, except that all purchase transactions are postponed until the end of the month, thereby giving the customer between 1 and 31 days of interest-free There is no interest applied per se but the extra cost for a deferred debit card is around 10€ a year. credit.     The annual fee for a deferred debit card is around €10 more than for one with immediate debit. Most France debit cards are branded with the ": null
    },
    {
        "Carte Bleue": "Carte Bleue"
    },
    {
        " logo, which assures acceptance throughout France. Most card holders choose to pay around €5 more in their annual fee to additionally have a Visa or a ": null
    },
    {
        "MasterCard": "Mastercard"
    },
    {
        " logo on their Carte Bleue, so that the card is accepted internationally. A Carte Bleue without a Visa or a MasterCard logo is often known as a Carte Bleue Nationale and a Carte Bleue with a Visa or a MasterCard logo is known as a Carte Bleue Internationale , or more frequently, simply called a Visa or MasterCard .     Many smaller merchants in France refuse to accept debit cards for transactions under a certain amount because of the minimum fee charged by merchants banks per transaction . But more and more merchants accept debit cards for small amounts, due to the massive daily use of debit card nowadays. Merchants in France do not differentiate between debit and credit cards, and so both have equal acceptance. It is legal in France to set a minimum amount to transactions, but the merchants must display it clearly.     In January 2016, 57.2% of all the debits cards in France also had a ": null
    },
    {
        "contactless payment": "Contactless Payment"
    },
    {
        " chip .  The maximum amount per transaction is set to €20 and the maximum amount of all contactless payments per day is between 50 and €100 depending on the bank. The per-transaction limit increased to €30 in October 2017.        According to French law,  in French. banks are liable for any transaction made with a copy of the original card and for any transaction made without a card , so banks have to pay back any fraudulent transaction to the card holder if the previous criteria are met. Fighting card fraud is therefore more interesting for banks. As a consequence, French banks websites usually propose an e-card service , where a new ": null
    },
    {
        "virtual card": "Virtual Card"
    },
    {
        " is created and linked to a physical card. Such virtual card can be used only once and for the maximum amount given by the card holder. If the virtual card number is intercepted or used to try to get a higher amount than expected, the transaction is blocked.       Debit cards have enjoyed wide acceptance in ": null
    },
    {
        "Germany": "Germany"
    },
    {
        " for years. Facilities already existed before EFTPOS became popular with the ": null
    },
    {
        "Eurocheque": "Eurocheque"
    },
    {
        " card, an authorization system initially developed for paper ": null
    },
    {
        "checks": "Cheque"
    },
    {
        " where, in addition to signing the actual check, customers also needed to show the card alongside the check as a security measure. Those cards could also be used at ATMs and for card-based ": null
    },
    {
        "electronic funds transfer": "Electronic Funds Transfer"
    },
    {
        "  with PIN entry. These are now the only functions of such cards: the Eurocheque system was abandoned in 2002 during the transition from the ": null
    },
    {
        "Deutsche Mark": "Deutsche Mark"
    },
    {
        " to the ": null
    },
    {
        "euro": "Euro"
    },
    {
        ". As of 2005, most stores and petrol outlets have EFTPOS facilities. Processing fees are paid by the businesses, which leads to some business owners refusing debit card payments for sales totalling less than a certain amount, usually 5 or 10 euro.     To avoid the processing fees, many businesses resorted to using ": null
    },
    {
        "direct debit": "Direct Debit"
    },
    {
        ", which is then called electronic direct debit . The point-of-sale terminal reads the bank sort code and account number from the card but instead of handling the transaction through the Girocard network it simply prints a form, which the customer signs to authorise the debit note. However, this method also avoids any verification or payment guarantee provided by the network. Further, customers can return debit notes by notifying their bank without giving a reason. This means that the beneficiary bears the risk of fraud and illiquidity. Some business mitigate the risk by consulting a proprietary ": null
    },
    {
        "blacklist": "Blacklist"
    },
    {
        " or by switching to Girocard for higher transaction amounts.     Around 2000, an Electronic Purse Card was introduced, dubbed ": null
    },
    {
        "Geldkarte": "Geldkarte"
    },
    {
        " . It makes use of the ": null
    },
    {
        "smart card": "Smart Card"
    },
    {
        " chip on the front of the standard issue debit card. This chip can be charged with up to 200 euro, and is advertised as a means of making medium to very small payments, even down to several euros or cent payments. The key factor here is that no processing fees are deducted by banks. It did not gain the popularity its inventors had hoped for. However, this could change as this chip is now used as means of age verification at cigarette vending machines, which has been mandatory since January 2007. Furthermore, some payment discounts are being offered  when paying with Geldkarte . The Geldkarte payment lacks all security measures, since it does not require the user to enter a PIN or sign a sales slip: the loss of a Geldkarte is similar to the loss of a wallet or purse - anyone who finds it can then use their find to pay for their own purchases.      Guinée Bissau      Please, see below on UEMOA         Debit card usage surged in Greece after the introduction of ": null
    },
    {
        "Capital Controls": "Capital Controls In Greece"
    },
    {
        " in 2015.         Most bank cards in Hong Kong for saving / current accounts are equipped with ": null
    },
    {
        "EPS": "Electronic Payment Services"
    },
    {
        " and ": null
    },
    {
        "UnionPay": "Unionpay"
    },
    {
        ", which function as a debit card and can be used at merchants for purchases, where funds are withdrawn from the associated account immediately.     ": null
    },
    {
        "EPS": "Electronic Payment Services"
    },
    {
        " is a Hong Kong only system and is widely accepted in merchants and government departments. However, as ": null
    },
    {
        "UnionPay": "Unionpay"
    },
    {
        " cards are accepted more widely overseas, consumers can use the ": null
    },
    {
        "UnionPay": "Unionpay"
    },
    {
        " functionality of the bank card to make purchases directly from the bank account.     Visa debit cards are uncommon in Hong Kong. The British banking firm ": null
    },
    {
        "HSBCs": "Hsbc"
    },
    {
        " subsidiary ": null
    },
    {
        "Hang Seng Banks": "Hang Seng Bank"
    },
    {
        " Enjoy card and American firm ": null
    },
    {
        "Citibanks": "Citibank"
    },
    {
        " ATM Visa are two of the Visa debit cards available in Hong Kong.     Debit cards usage in Hong Kong is relatively low, as the ": null
    },
    {
        "credit card": "Credit Card"
    },
    {
        " penetration rate is high in Hong Kong. In Q1 2017, there are near 20 million credit cards in circulation, about 3 times the adult population. There are 145800 thousand transaction made by credit cards but only 34001 thousand transactions made by debit cards.        In ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        " debit cards are far more common and popular than credit cards. Many Hungarians even refer to their debit card mistakenly using the word for credit card .        After the demonetization by current government there has been a surge in cashless transactions, so nowadays you could find card acceptance in most places. The debit card was mostly used for ": null
    },
    {
        "ATM": "Automated Teller Machine"
    },
    {
        " transactions. RBI has announced that fees are not justified so transactions have no processing fees.  Almost half of Indian debit and credit card users use Rupay card. Some Indian banks issue Visa debit cards, though some banks  also issue ": null
    },
    {
        "Maestro": "Maestro"
    },
    {
        " cards. The debit card transactions are routed through Rupay ,Visa or MasterCard networks in India and overseas rather than directly via the issuing bank.     The ": null
    },
    {
        "National Payments Corporation of India": "National Payments Corporation Of India"
    },
    {
        " has launched a new card called ": null
    },
    {
        "RuPay": "Rupay"
    },
    {
        ".  It is similar to Singapores ": null
    },
    {
        "NETS": "Network For Electronic Transfers"
    },
    {
        " and ": null
    },
    {
        "Mainland Chinas": "Prc"
    },
    {
        " UnionPay": "Unionpay"
    },
    {
        ".           Foreign-owned brands issuing Indonesian debit cards include Visa, Maestro, MasterCard, and ": null
    },
    {
        "MEPS": "Malaysian Electronic Payment System"
    },
    {
        ". Domestically-owned debit card networks operating in Indonesia include ": null
    },
    {
        "Debit BCA": "Bank Central Asia"
    },
    {
        "  and ": null
    },
    {
        "Mandiri Debit": "Bank Mandiri"
    },
    {
        ".       Iraqs two biggest state-owned banks, ": null
    },
    {
        "Rafidain Bank": "Rafidain Bank"
    },
    {
        " and ": null
    },
    {
        "Rasheed Bank": "Rasheed Bank"
    },
    {
        ", together with the Iraqi Electronic Payment System  have established a company called International Smart Card, which has developed a national credit card called ": null
    },
    {
        "Qi Card": "Qi Card"
    },
    {
        ", which they have issued since 2008. According to the companys website: after less than two years of the initial launch of the Qi card solution, we have hit 1.6  million cardholder with the potential to issue 2  million cards by the end of 2010, issuing about 100,000 card monthly is a testament to the huge success of the Qi card solution. Parallel to this will be the expansion into retail stores through a network of points of sales of about 30,000 units by 2015.         Today, Irish debit cards are exclusively Chip and PIN and almost entirely Visa Debit. These can be used anywhere the Visa logo is seen and in much the same way as a credit card. MasterCard debit is also used by a small minority of institutions and operates in a very similar manner.     Irish debit cards are normally multi-functional and combine ATM card facilities. The cards are also sometimes used for authenticating transactions together with a card reader for 2-factor authentication on online banking.     The majority of Irish Visa Debit cards are also enabled for contactless payment for small, frequent transactions . Three consecutive contactless transactions are allowed, after which, the card software will refuse contactless transactions until a standard Chip and PIN transaction has been completed and the counter resets. This measure was put in place to minimize issuers exposure to fraudulent charges.     The cards are usually processed online, but some cards can also be processed offline depending on the rules applied by the card issuer.     A number of card issuers also provide prepaid debit card accounts primarily for use as gift cards / vouchers or for added security and anonymity online. These may be disposable or reloadable and are usually either Visa or MasterCard branded.     Previous system :     ": null
    },
    {
        "Laser": "Laser"
    },
    {
        " was launched by the Irish banks in 1996 as an extension of the existing ATM and ": null
    },
    {
        "Cheque guarantee card": "Cheque Guarantee Card"
    },
    {
        " systems that had existed for many years. When the service was added, it became possible to make payments with a multifunctional card that combined ATM, cheque and debit card and international ATM facilities through MasterCard Cirrus or Visa Plus and sometimes the British Link ATM system. Their functionality was similar to the British ": null
    },
    {
        "Switch": "Switch"
    },
    {
        " card.     The system first launched as a swipe & sign card and could be used in Ireland in much the same way as a credit card and were compatible standard card terminals . They could also be used in cardholder-not-present transactions over the phone, by mail or on the internet or for processing recurring payments. Laser also offered cash back facilities where customers could ask retailers for an amount of cash along with their transaction. This service allowed retailers to reduce volumes of cash in tills and allowed consumers to avoid having to use ATMs. Laser adopted EMV Chip and PIN security in 2002 in common with other credit and debit cards right across Europe. In 2005, some banks issued customers with Lasers cards that were co-branded with Maestro. This allowed them to be used in POS terminals overseas, internet transactions were usually restricted to sites that specifically accepted Laser.     Since 2006, Irish banks have progressively replaced Laser with international schemes, primarily Visa Debit and by 28 February 2014 the Laser Card system had been withdrawn entirely and is no longer accepted by retailers.       The Israel bank card system is somewhat confusing to newcomers, comprising a blend of features taken from different types of cards. What may be referred to as a credit card, is most likely to be a deferred debit card on an associated bank current account, the most common type of card in Israel, somewhat like the situation in France, though the term debit card is not in common usage. Cards are nearly universally called cartis ashrai , literally, credit card , a term which may bely the cards characteristics. Its main feature may be a direct link to a connected bank account , with the total value of the transactions made on the card being debited from the bank account in full on a regular date once a month, without the option to carry the balance over; indeed certain types of transactions may be debited directly from the connected bank account at the time of the transaction. Any such limited credit enjoyed is a result of the customers assets and credibility with the bank, and not granted by the credit card company.  The card usually enables immediate ATM cash withdrawals & balance inquiries , instalment & deferred charge interest free transactions offered by merchants , interest bearing instalment plans/deferred charge/revolving credit which is transaction specific at the point of sale , and a variety of automated/upon request types of credit schemes including loans, some of which revolve or resemble the extended payment options sometimes offered by charge cards.     Thus the true debit card is not so common in Israel, though it has existed since 1994. It is offered by two credit companies in Israel: One is ICC, short for Israeli Credit Cards , which issues it in the form of a Visa Electron card valid only in Israel. It is offered mainly through the Israel Post bank  or through ": null
    },
    {
        "Israel Discount Bank": "Israel Discount Bank"
    },
    {
        ", its main owner . This branded Israel Discount Bank branded debit card also offered as valid worldwide card, either as Visa Electron or MasterCard Debit cards.  The second & more common debit card is offered by the ": null
    },
    {
        "Isracard": "Isracard"
    },
    {
        " consortium to its affiliate banks and is branded Direct . It is valid only in Israel, under its local & unique - though immensely popular - private label brand, as Isracard Direct . Since 2006, Isracard has also offered an international version, branded MasterCard Direct , which is less common. These two debit card brands operate offline in Israel . In 2014 the Isracard Direct card was relaunched as Isracash,  though the former subbrand still being marketed - & replaced ICC Visa Electron as Israel Post bank debit card.      Overall, banks routinely offer deferred debit cards to their new customers, with true debit cards usually offered only to those who cannot obtain credit. These latter cards are not attractive to the average customer since they attract both a monthly fee from the credit company and a bank account fee for each days debits. Isracard Direct is by far more common than the ICC Visa Electron debit card. Banks who issue mainly Visa cards will rather offer electronic use, mandate authorized transaction only, unembossed version of Visa Electron deferred debit cards to its customers - sometimes even in the form of revolving credit card.     Credit/debit card transactions in Israel are not PIN based and it is only in recent years that ": null
    },
    {
        "EMV": "Emv"
    },
    {
        " chip smart cards have begun to be issued, with the Bank of Israel ordering the banks and credit card companies - in 2013 - to switch customers to credit cards with the EMV security standard within 3.5 years.        Debit cards are quite popular in Italy. There are both classic and prepaid cards. The main classic debit card in Italy is ": null
    },
    {
        "Bancomat/PagoBancomat": "Bancomat"
    },
    {
        ". The main international debit circuit used by Italian banks is Mastercards Maestro: for this reason almost every debit card issued in Italy has both PagoBancomat and Maestro logos, with Bancomat/PagoBancomat being used in Italy and the Maestro circuit when abroad. Sometimes, instead of using the Maestro circuit, the Bancomat/PagoBancomat debit card is issued along with V-Pay or Visa Electron logos, or sometimes with credit card functions . In this last case, only the credit-card mode is allowed for abroad/Internet transactions, while the debit card mode is used only in Italy. The most popular prepaid debit card is Postepay . It is issued by ": null
    },
    {
        "Poste italiane S.p.A.": "Poste Italiane"
    },
    {
        ", and usually runs on the Visa Electron circuit, but there are some versions that run on MasterCard. It can be used on Poste Italianes ATMs and on Visas Electron-compatible bank ATMs all over the world. It has no fees when used on the Internet and in POS-based transactions. Other cards are issued by other companies, such as Vodafone CashCard, Banca Popolare di Milanos Carta Jeans and Carta Moneta Online.          In ": null
    },
    {
        "Japan": "Japan"
    },
    {
        " people usually use their , originally intended only for use with cash machines, as debit cards. The debit functionality of these cards is usually referred to as , and only cash cards from certain banks can be used. A cash card has the same size as a Visa/MasterCard. As identification, the user will have to enter their four-digit PIN when paying. J-Debit was started in Japan on March 6, 2000. However, J-Debit has not been that popular since then.     ": null
    },
    {
        "Suruga Bank": "Suruga Bank"
    },
    {
        " began service of Japans first ": null
    },
    {
        "Visa Debit": "Visa Debit"
    },
    {
        " in 2006. Rakuten Bank, formally known as Ebank, offers a Visa debit card.      Resona Bank and ": null
    },
    {
        "The Bank of Tokyo-Mitsubishi UFJ": "The Bank Of Tokyo-Mitsubishi Ufj"
    },
    {
        " bank also offer a Visa branded debit card.         In Kuwait, all banks provide a debit card to their account holders. This card is branded as KNET, which is the central switch in Kuwait. KNET card transactions are free for both customer and the merchant and therefore KNET debit cards are used for low valued transactions as well. KNET cards are mostly co-branded as Maestro or Visa Electron which makes it possible to use the same card outside Kuwait on any terminal supporting these payment schemes.       In Malaysia, the local debit card network is operated by the Malaysian Electronic Clearing Corporation , which had taken over the scheme from MEPS in 2008. The new name for the local debit card in Malaysia is MyDebit, which was previously known as either bankcard or e-debit. Debit cards in Malaysia are now issued on a combo basis where the card has both the local debit card payment application as well as having that of an International scheme . All newly issued MyDebit combo cards with Visa or MasterCard have the contactless payment feature. The same card also acts as the ATM card for cash withdrawals.      Mali      Please, see below on UEMOA       In Mexico, many companies use a type of debit card called a payroll card , in which they deposit their employees payrolls, instead of paying them in cash or through checks. This method is preferred in many places because it is a much safer and secure alternative compared to the more traditional forms of payment.       In the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        " using ": null
    },
    {
        "EFTPOS": "Eftpos"
    },
    {
        " is known as pinnen , a term derived from the use of a ": null
    },
    {
        "personal identification number": "Personal Identification Number"
    },
    {
        " . PINs are also used for ": null
    },
    {
        "ATM": "Automated Teller Machine"
    },
    {
        " transactions, and the term is used interchangeably by many people, although it was introduced as a marketing brand for EFTPOS. The system was launched in 1987, and in 2010 there were 258,585 terminals throughout the country, including mobile terminals used by delivery services and on markets. All banks offer a debit card suitable for EFTPOS with current accounts.     PIN transactions are usually free to the customer, but the retailer is charged per-transaction and monthly fees. ": null
    },
    {
        "Equens": "Equens"
    },
    {
        ", an association with all major banks as its members, runs the system, and until August 2005 also charged for it. Responding to allegations of monopoly abuse, it has handed over contractual responsibilities to its member banks through who now offer competing contracts. The system is organised through a special banking association ": null
    },
    {
        "Currence": "Currence"
    },
    {
        " set up specifically to coordinate access to payment systems in the Netherlands. Interpay, a legal predecessor of Equens, was fined €47  million in 2004, but the fine was later dropped, and a related fine for banks was lowered from €17  million to €14  million. Per-transaction fees are between 5-10 eurocents, depending on volume.     Credit card use in the Netherlands is very low, and most credit cards cannot be used with EFTPOS, or charge very high fees to the customer. Debit cards can often, though not always, be used in the entire EU for EFTPOS. Most debit cards are Mastercard ": null
    },
    {
        "Maestro": "Maestro"
    },
    {
        " cards. Visas ": null
    },
    {
        "V Pay": "V Pay"
    },
    {
        " cards are also accepted at most locations.   In 2011 spending money using debit cards rose to 83  billion euro whilst cash spending dropped to 51  billion euro and creditcard spending grew to 5  billion.      Electronic Purse Cards  were introduced in 1996, but have never become very popular. The system was abolished at the end of 2014.       EFTPOS  in New Zealand is highly popular. In 2006, 70 percent of all retail transactions were made by Eftpos, with an average of 306 Eftpos transaction being made per person. At the same time, there were 125,000 Eftpos terminals in operation , and 5.1  million Eftpos cards in circulation .      The system involves the merchant swiping the customers card and entering the purchase amount. Point of sale systems with integrated EFTPOS often sent the purchase total to the terminal and the customer swipes their own card. The customer then selects the account they wish to use: Current/Cheque , Savings , or Credit Card , before entering in their PIN. After a short processing time in which the terminal contacts the EFTPOS network and the bank, the transaction is approved and a receipt is printed. The EFTPOS system is used for credit cards as well, with a customer selecting Credit Card and entering their PIN, or for older credit cards without loaded PIN, pressing OK and signing their receipt with identification through matching signatures. Fixed EFTPOS terminals today use ": null
    },
    {
        "internet protocol": "Internet Protocol"
    },
    {
        " connections to contact the EFTPOS network, but some businesses use the public switched telephone network, either via dedicated phone lines or sharing the merchants voice line .     Virtually all retail outlets have EFTPOS facilities, so much that retailers without EFTPOS have to advertise so. In addition, an increasing number of mobile operator, such as taxis, stall holders and pizza deliverers have mobile EFTPOS systems. The system is made up of two primary networks: EFTPOS NZ, which is owned by ": null
    },
    {
        "VeriFone": "Verifone"
    },
    {
        "  and Paymark Limited , which is owned by ANZ Bank New Zealand, ": null
    },
    {
        "ASB Bank": "Asb Bank"
    },
    {
        ", ": null
    },
    {
        "Westpac": "Westpac"
    },
    {
        " and the ": null
    },
    {
        "Bank of New Zealand": "Bank Of New Zealand"
    },
    {
        ".  The two networks are intertwined and highly sophisticated and secure, able to handle huge volumes of transactions during busy periods such as the lead-up to Christmas: on 24 December 2012, the Paymark network alone recorded an average of 132 transactions per second between 12:00 and 13:00.  Network failures are rare, but when they occur they cause massive disruption, resulting in major delays and loss of income for businesses.     Depending on the users bank, a fee may be charged for use of EFTPOS. Most youth accounts and an increasing number of electronic transaction accounts do not attract fees for electronic transactions, meaning the use of Eftpos by younger generations has become ubiquitous and subsequently cash use has become rare. Typically merchants dont pay fees for transactions, most only having to pay for the equipment rental.     One of the disadvantages of New Zealands well-established EFTPOS system is that it is incompatible with overseas systems and non-face-to-face purchases. In response to this, many banks since 2005 have introduced international debit cards such as ": null
    },
    {
        "Maestro": "Maestro"
    },
    {
        " and Visa Debit which work online and overseas as well as on the New Zealand EFTPOS system.       Many Nigerians regard Debit cards as ATM cards because of its features to withdraw money directly from the ATM.      According to the ": null
    },
    {
        "Central Bank of Nigeria": "Central Bank Of Nigeria"
    },
    {
        ", Debit Cards can be issued to customers having Savings /Current Accounts. There are three major types of Debit card in Nigeria: MasterCard, Verve, and Visa card. These Debit cards companies have other packages they offer in Nigeria like Naira MasterCard platinum, Visa Debit , GTCrea8 Card, SKS Teen Card, etc. All the packages depend on your Bank.       In the ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        ", all three national ATM network consortia offer proprietary PIN debit. This was first offered by ": null
    },
    {
        "Express Payment System": "Express Payment System"
    },
    {
        " in 1987, followed by ": null
    },
    {
        "Megalink": "Megalink"
    },
    {
        " with Paylink in 1993 then ": null
    },
    {
        "BancNet": "Bancnet"
    },
    {
        " with the ": null
    },
    {
        "Point-of-Sale": "Point-Of-Sale"
    },
    {
        " in 1994.     ": null
    },
    {
        "Express Payment System": "Express Payment System"
    },
    {
        " or EPS was the pioneer provider, having launched the service in 1987 on behalf of the ": null
    },
    {
        "Bank of the Philippine Islands": "Bank Of The Philippine Islands"
    },
    {
        ". The EPS service has subsequently been extended in late 2005 to include the other Expressnet members: ": null
    },
    {
        "Banco de Oro": "Banco De Oro"
    },
    {
        " and ": null
    },
    {
        "Land Bank of the Philippines": "Land Bank Of The Philippines"
    },
    {
        ". They currently operate 10,000 terminals for their cardholders.     Megalink launched Paylink EFTPOS system in 1993. Terminal services are provided by Equitable Card Network on behalf of the consortium. Service is available in 2,000 terminals, mostly in ": null
    },
    {
        "Metro Manila": "Metro Manila"
    },
    {
        ".     ": null
    },
    {
        "BancNet": "Bancnet"
    },
    {
        " introduced their point of sale system in 1994 as the first consortium-operated EFTPOS service in the country. The service is available in over 1,400 locations throughout the Philippines, including second and third-class municipalities. In 2005, BancNet signed a Memorandum of Agreement to serve as the local gateway for ": null
    },
    {
        "China UnionPay": "China Unionpay"
    },
    {
        ", the sole ATM switch in the ": null
    },
    {
        "Peoples Republic of China": "Peoples Republic Of China"
    },
    {
        ". This will allow the estimated 1.0  billion Chinese ATM cardholders to use the BancNet ATMs and the EFTPOS in all participating merchants.     Visa debit cards are issued by ": null
    },
    {
        "Union Bank of the Philippines": "Union Bank Of The Philippines"
    },
    {
        " , ": null
    },
    {
        "Chinatrust": "Chinatrust"
    },
    {
        ", ": null
    },
    {
        "Equicom Savings Bank": "Equicom Savings Bank"
    },
    {
        " , ": null
    },
    {
        "Banco De Oro": "Banco De Oro"
    },
    {
        ", ": null
    },
    {
        "HSBC": "Hsbc"
    },
    {
        ", ": null
    },
    {
        "HSBC Savings Bank": "Hsbc Savings Bank"
    },
    {
        ", Sterling Bank of Asia & ": null
    },
    {
        "EastWest Bank": "Eastwest Bank"
    },
    {
        ". Union Bank of the Philippines cards, EastWest Visa Debit Card, Equicom Savings Bank & Sterling Bank of Asia EMV cards which can also be used for internet purchases. ": null
    },
    {
        "Sterling Bank of Asia": "Sterling Bank Of Asia"
    },
    {
        " has released its first line of prepaid and debit Visa cards with ": null
    },
    {
        "EMV": "Emv"
    },
    {
        " chip.     MasterCard debit cards are issued by Banco de Oro, ": null
    },
    {
        "Security Bank": "Security Bank"
    },
    {
        " & ": null
    },
    {
        "Smart Communications": "Smart Communications"
    },
    {
        " tied up with Banco De Oro. MasterCard Electronic cards are issued by BPI and Security Bank .     Originally, all Visa and MasterCard based debit cards in the Philippines are non-embossed and are marked either for Electronic Use Only or Valid only where MasterCard Electronic is Accepted . However, ": null
    },
    {
        "EastWest Bank": "Eastwest Bank"
    },
    {
        " started to offer embossed Visa Debit Cards without the for Electronic Use Only mark. Paypass Debit MasterCard from other banks also have embossed labels without the for Electronic Use Only mark. Unlike credit cards issued by some banks, these Visa and MasterCard-branded debit cards do not feature EMV chips, hence they can only be read by the machines through swiping.     By March 21, 2016, ": null
    },
    {
        "BDO": "Bdo Unibank"
    },
    {
        " has started issuing sets of ": null
    },
    {
        "Debit MasterCards": "Debit Mastercards"
    },
    {
        " having the EMV chip and is the first Philippine bank to have it.  This is a response to the ": null
    },
    {
        "BSPs": "Bangko Sentral Ng Pilipinas"
    },
    {
        " monitor of the EMV shift progress in the country.  By 2017, all Debit Cards in the country should have an EMV chip on it.        In ": null
    },
    {
        "Poland": "Poland"
    },
    {
        ", the first system of electronic payments was operated by ": null
    },
    {
        "Orbis": "Orbis Technology"
    },
    {
        ", which later was changed to PolCard in 1991 and then that system was bought by ": null
    },
    {
        "First Data": "First Data"
    },
    {
        " Poland Holding SA. In the mid-1990s international brands such as Visa, MasterCard, and the unembossed Visa Electron or Maestro were introduced.     Visa Electron and Maestro work as a standard debit cards: the transactions are debited instantly, although it may happen on some occasions that a transaction is processed with some delay . These cards do not possess the options that credit cards have.     In the late 2000s contactless cards started to be introduced. The first technology to be used was MasterCard PayPass, later joined by Visas payWave. This payment method is now universal and accepted almost everywhere. In an everyday use this payment method is always called Paypass.   Almost all business and stores in Poland accept debit and credit cards.     In the mid-2010s Polish banks started to replace unembossed cards with embossed electronic cards such as Debit MasterCard and Visa Debit, allowing the customers to own a card that has all qualities of a credit card .     There are also some banks that do not possess an identification system to allow customers to order debit cards online.       In ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        ", debit cards are accepted almost everywhere: ATMs, stores, and so on. The most commonly accepted are Visa and MasterCard, or the unembossed Visa Electron or Maestro. Regarding Internet payments debit cards cannot be used for transfers, due to its unsafeness, so banks recommend the use of MBnet, a pre-registered safe system that creates a virtual card with a pre-selected credit limit. All the card system is regulated by SIBS, the institution created by Portuguese banks to manage all the regulations and communication processes proply. SIBS shareholders are all the 27 banks operating in Portugal.       In addition to Visa, MasterCard and American Express, there are some local payment systems based in general on ": null
    },
    {
        "smart card": "Smart Card"
    },
    {
        " technology.     ": null
    },
    {
        "Sbercard": "Sbercard"
    },
    {
        ". This payment system was created by ": null
    },
    {
        "Sberbank": "Sberbank"
    },
    {
        " around 1995–1996. It uses ": null
    },
    {
        "BGS Smartcard Systems AG": "Bgs Smartcard Systems Ag"
    },
    {
        " smart card technology that is, DUET. Sberbank was a single retail bank in the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " before 1990. De facto this is a payment system of the SberBank.   ": null
    },
    {
        "Zolotaya Korona": "Zolotaya Korona"
    },
    {
        ". This card brand was created in 1994. Zolotaya Korona is based on ": null
    },
    {
        "CFT": "Center Of Financial Technologies"
    },
    {
        " technology.   ": null
    },
    {
        "STB Card": "Stb Card"
    },
    {
        ". This card uses the classic ": null
    },
    {
        "magnetic stripe": "Magnetic Stripe Reader"
    },
    {
        " technology. It almost fully collapsed after 1998 with STB bank failure.   ": null
    },
    {
        "Union Card": "Union Card"
    },
    {
        ". The card also uses the classic ": null
    },
    {
        "magnetic stripe": "Magnetic Stripe Reader"
    },
    {
        " technology. This card brand is on the decline. These accounts are being reissued as Visa or MasterCard accounts.     Nearly every transaction, regardless of brand or system, is processed as an immediate debit transaction. Non-debit transactions within these systems have spending limits that are strictly limited when compared with typical Visa or MasterCard accounts.       In ": null
    },
    {
        "Saudi Arabia": "Saudi Arabia"
    },
    {
        ", all debit card transactions are routed through ": null
    },
    {
        "Saudi Payments Network": "Saudi Payments Network"
    },
    {
        " , the only electronic payment system in the Kingdom and all banks are required by the ": null
    },
    {
        "Saudi Arabian Monetary Agency": "Saudi Arabian Monetary Agency"
    },
    {
        " to issue cards fully compatible with the network. It connects all point of sale terminals throughout the country to a central payment switch which in turn re-routes the financial transactions to the card issuer, local bank, Visa, Amex or MasterCard.     As well as its use for debit cards, the network is also used for ATM and credit card transactions.                All Serbian banks issue debit cards. Since August 2018, all owners of transactional accounts in ": null
    },
    {
        "Serbian dinars": "Serbian Dinar"
    },
    {
        " are automatically issued a debit card of the national brand DinaCard.  Other brands are more popular, better accepted and more secure, but must be requested specifically as ": null
    },
    {
        "additional cards": "Additional Card"
    },
    {
        ". Debit cards are used for cash withdrawal at ATMs as well as store transactions.       Singapores debit service is managed by the ": null
    },
    {
        "Network for Electronic Transfers": "Network For Electronic Transfers"
    },
    {
        " , founded by Singapores leading banks and shareholders namely DBS, Keppel Bank, OCBC and its associates, OUB, IBS, POSB, Tat Lee Bank and UOB in 1985 as a result of a need for a centralised e-Payment operator.     However, due to the banking restructuring and mergers, the local banks remaining were UOB, OCBC, DBS-POSB as the shareholders of NETS with Standard Chartered Bank to offer NETS to their customers. However, DBS and POSB customers can use their network ATMs on their own and not be shared with UOB, OCBC or SCB . The mega failure of 5 July 2010 of POSB-DBS ATM Networks made the government to rethink the shared ATM system again as it affected the NETS system too.     In 2010, in line with the mandatory EMV system, Local Singapore Banks started to reissue their Debit Visa/MasterCard branded debit cards with EMV Chip compliant ones to replace the magnetic stripe system. Banks involved included NETS Members of POSB-DBS, UOB-OCBC-SCB along with the SharedATM alliance of HSBC, Citibank, State Bank of India, and Maybank. Standard Chartered Bank is also a SharedATM alliance member. Non branded cards of POSB and Maybank local ATM Cards are kept without a chip but have a Plus or Maestro sign which can be used to withdraw cash locally or overseas.     Maybank Debit MasterCards can be used in Malaysia just like a normal ATM or Debit MEPS card.     Singapore also uses the e-purse systems of NETS CASHCARD and the CEPAS wave system by ": null
    },
    {
        "EZ-Link": "Ez-Link"
    },
    {
        " and NETS.       Debit cards are accepted in a relatively larger number of stores, both large and small in Spain. Banks often offer debit cards for small fees in connection with a chequing account. These cards are used more often than credit cards at ATMs because it is a cheaper alternative.       Most banks issue major-brand debit cards that can be used internationally such as ": null
    },
    {
        "Visa": "Visa Debit"
    },
    {
        ", ": null
    },
    {
        "MasterCard": "Mastercard"
    },
    {
        " and ": null
    },
    {
        "JCB": "Jcb Co., Ltd."
    },
    {
        ", often with contactless functionality. Payments at brick-and-mortar stores generally require a signature except for contactless payments.     A separate, local debit system, known as Smart Pay, can be used by the majority of debit and ATM cards, even major-brand cards. This system is available only in Taiwan and a few locations in Japan as of 2016. Non-contactless payments require a PIN instead of a signature. Cards from a few banks support contactless payment with Smart Pay.                Debit cards are widely accepted from different debit card issuers including the ": null
    },
    {
        "Network International": "Network International"
    },
    {
        " local subsidiary of ": null
    },
    {
        "Emirates Bank": "Emirates Bank"
    },
    {
        ".       In the ": null
    },
    {
        "UK": "United Kingdom"
    },
    {
        " debit cards are an established part of the retail market and are widely accepted both by ": null
    },
    {
        "bricks and mortar": "Bricks And Mortar"
    },
    {
        " stores and by internet stores. The term EFTPOS is not widely used by the public; debit card is the generic term used. Debit cards issued are predominantly ": null
    },
    {
        "Visa Debit": "Visa Debit"
    },
    {
        ", with ": null
    },
    {
        "Debit MasterCard": "Debit Mastercard"
    },
    {
        " becoming increasingly common. ": null
    },
    {
        "Maestro": "Maestro"
    },
    {
        ", ": null
    },
    {
        "Visa Electron": "Visa Electron"
    },
    {
        " and ": null
    },
    {
        "UnionPay": "Unionpay"
    },
    {
        " are also in circulation. Banks do not charge customers for EFTPOS transactions in the UK, but some retailers used to make small charges, particularly where the transaction amount in question was small. However, the UK Government introduced legislation on January 13, 2018 banning all surcharges for card payments, including those made online and through services such as ": null
    },
    {
        "PayPal": "Paypal"
    },
    {
        ".  The UK has converted all debit cards in circulation to ": null
    },
    {
        "Chip and PIN": "Chip And Pin"
    },
    {
        " , based on the ": null
    },
    {
        "EMV": "Emv"
    },
    {
        " standard, to increase transaction security; however, PINs are not required for Internet transactions , nor for most contactless transactions.     In the United Kingdom, banks started to issue debit cards in the mid-1980s in a bid to reduce the number of cheques being used at the point of sale, which are costly for the banks to process; the first bank to do so was ": null
    },
    {
        "Barclays": "Barclays Bank"
    },
    {
        " with the Barclays Connect card. As in most countries, fees paid by merchants in the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " to accept credit cards are a percentage of the transaction amount,  which funds card holders interest-free credit periods as well as incentive schemes such as points or cashback. For consumer credit cards issued within the EEA, the interchange fee is capped at 0.3%, with a cap of 0.2% for debit cards, although the merchant acquirers may charge the merchant a higher fee. Most debit cards in the UK lack the advantages offered to holders of UK-issued credit cards, such as free incentives , interest-free credit and protection against defaulting merchants under . Almost all establishments in the United Kingdom that accept credit cards also accept debit cards. Some merchants, for cost reasons, accept debit cards and not credit cards, and some smaller retailers only accept card payments for purchases above a certain value, typically £5 or £10.            It is the West Africa Economic and Monetary Union federating eight countries: ": null
    },
    {
        "Benin": "Benin"
    },
    {
        ", ": null
    },
    {
        "Burkina Faso": "Burkina Faso"
    },
    {
        ", ": null
    },
    {
        "Côte dIvoire": "Ivory Coast"
    },
    {
        ", ": null
    },
    {
        "Guinée Bissau": "Guinea-Bissau"
    },
    {
        ", ": null
    },
    {
        "Mali": "Mali"
    },
    {
        ", ": null
    },
    {
        "Niger": "Niger"
    },
    {
        ", ": null
    },
    {
        "Senegal": "Senegal"
    },
    {
        " and ": null
    },
    {
        "Togo": "Togo"
    },
    {
        ".     GIM-UEMOA is the regional switch féderating more than 120 members . All interbank cards transactions between banks in the same country or between banks in two different countries UEMOA zone are routed and cleared by GIM-UEMOA. The settlement is done on Central Bank RTGS.     GIM-UEMOA also provides some processing products and services to more than 50 banks in UEMOA zone and out of UEMOA zone.          In the U.S., EFTPOS is universally referred to simply as debit. The largest pre-paid debit card company is ": null
    },
    {
        "Green Dot Corporation": "Green Dot Corporation"
    },
    {
        ", by ": null
    },
    {
        "market capitalization": "Market Capitalization"
    },
    {
        ". The same ": null
    },
    {
        "interbank networks": "Interbank Network"
    },
    {
        " that operate the ": null
    },
    {
        "ATM": "Automated Teller Machine"
    },
    {
        " network also operate the POS network. Most ": null
    },
    {
        "interbank networks": "Interbank Network"
    },
    {
        ", such as ": null
    },
    {
        "Pulse": "Pulse"
    },
    {
        ", ": null
    },
    {
        "NYCE": "Nyce"
    },
    {
        ", ": null
    },
    {
        "MAC": "Money Access Center"
    },
    {
        ", ": null
    },
    {
        "Tyme": "Tyme"
    },
    {
        ", ": null
    },
    {
        "SHAZAM": "Shazam"
    },
    {
        ", ": null
    },
    {
        "STAR": "Star"
    },
    {
        ", and so on, are regional and do not overlap, however, most ATM/POS networks have agreements to accept each others cards. This means that cards issued by one network will typically work anywhere they accept ATM/POS cards for payment. For example, a NYCE card will work at a Pulse POS terminal or ATM, and vice versa. Debit cards in the United States are usually issued with a Visa, MasterCard, ": null
    },
    {
        "Discover": "Discover Card"
    },
    {
        "  or ": null
    },
    {
        "American Express": "American Express"
    },
    {
        "  logo allowing use of their signature-based networks.     U.S. Federal law caps the liability of a U.S. debit card user in case of loss or theft at US$50 if the loss or theft is reported to the issuing bank in two business days after the customer notices the loss.  Most banks will, however, set this limit to $0 for debit cards issued to their customers which are linked to their ": null
    },
    {
        "checking": "Checking Account"
    },
    {
        " or ": null
    },
    {
        "savings account": "Savings Account"
    },
    {
        ".     The fees charged to merchants for offline debit purchases vs. the lack of fees charged to merchants for processing online debit purchases and paper checks have prompted some major merchants in the U.S. to file ": null
    },
    {
        "lawsuits": "Lawsuit"
    },
    {
        " against debit-card transaction processors, such as Visa and MasterCard. In 2003, Visa and MasterCard agreed to ": null
    },
    {
        "settle": "Settlement"
    },
    {
        " the largest of these lawsuits for $2 billion and $1 billion, respectively.      Some consumers prefer credit transactions because of the lack of a fee charged to the consumer/purchaser. A few debit cards in the U.S. offer rewards for using credit . However, since credit transactions cost more for merchants, many terminals at PIN-accepting merchant locations now make the credit function more difficult to access. For example, if you swipe a debit card at ": null
    },
    {
        "Wal-Mart": "Walmart"
    },
    {
        " or ": null
    },
    {
        "Ross": "Ross Stores"
    },
    {
        " in the U.S., you are immediately presented with the PIN screen for online debit. To use offline debit you must press cancel to exit the PIN screen, and then press credit on the next screen.     As a result of the ": null
    },
    {
        "Dodd–Frank Wall Street Reform and Consumer Protection Act": "Dodd–Frank Wall Street Reform And Consumer Protection Act"
    },
    {
        ", U.S. merchants can now set a minimum purchase amount for credit card transactions, as long as it does not exceed $10.         In the United States, an ": null
    },
    {
        "FSA debit card": "Fsa Debit Card"
    },
    {
        " only allow medical expenses. It is used by some banks for withdrawals from their FSAs, ": null
    },
    {
        "medical savings accounts": "Medical Savings Account"
    },
    {
        " , and ": null
    },
    {
        "health savings accounts": "Health Savings Account"
    },
    {
        " as well. They have ": null
    },
    {
        "Visa": "Visa"
    },
    {
        " or MasterCard logos, but cannot be used as debit cards , only as credit cards . Furthermore, they are not accepted by all merchants that accept debit and credit cards, but only by those that specifically accept FSA debit cards. Merchant codes and product codes are used at the point of sale to restrict sales if they do not qualify. Because of the extra checking and documenting that goes on, later, the statement can be used to ": null
    },
    {
        "substantiate": "Balance Sheet Substantiation"
    },
    {
        " these purchases for tax deductions. In the occasional instance that a qualifying purchase is rejected, another form of payment must be used . In the more likely case that non-qualifying items are accepted, the consumer is technically still responsible, and the discrepancy could be revealed during an audit. A small but growing segment of the debit card business in the U.S. involves access to tax-favored spending accounts such as FSAs, HRAs, and HSAs. Most of these debit cards are for medical expenses, though a few are also issued for dependent care and transportation expenses.     Traditionally, FSAs were accessed only through claims for reimbursement after incurring, and often paying, an out-of-pocket expense; this often happens after the funds have already been deducted from the employees paycheck. The only method permitted by the ": null
    },
    {
        "Internal Revenue Service": "Internal Revenue Service"
    },
    {
        " to avoid this double-dipping for medical FSAs and HRAs is through accurate and auditable reporting on the tax return. Statements on the debit card that say for medical uses only are invalid for several reasons: The merchant and issuing banks have no way of quickly determining whether the entire purchase qualifies for the customers type of tax benefit; the customer also has no quick way of knowing; often has mixed purchases by necessity or convenience; and can easily make mistakes; extra contractual clauses between the customer and issuing bank would cross-over into the payment processing standards, creating additional confusion . Therefore, using the card exclusively for qualifying purchases may be convenient for the customer, but it has nothing to do with how the card can actually be used. If the bank rejects a transaction, for instance, because it is not at a recognized drug store, then it would be causing harm and confusion to the cardholder. In the United States, not all medical service or supply stores are capable of providing the correct information so an FSA debit card issuer can honor every transaction-if rejected or documentation is not deemed enough to satisfy regulations, cardholders may have to send in forms manually.       Debit cards are accepted in a relatively large number of stores, both large and small in Uruguay; but their use has so far remained low as compared to credit cards at ATMs. Since August 2014, with the ": null
    },
    {
        "Financial Inclusion Law": "Taxation In Uruguay"
    },
    {
        " coming into force, end consumers obtain a 4% VAT deduction for using debit cards in their purchases.        There has been a lack of cash due to the ": null
    },
    {
        "Venezuelan economical crisis": "Crisis In Venezuela"
    },
    {
        " and thus the demand and use of debit cards has increased greatly during the last years. One of the reasons why a noticeable percentage of businesses has been closed is due to a lack of ": null
    },
    {
        "payment terminal": "Payment Terminal"
    }
]