[
    {
        "     This article is about the ": null
    },
    {
        "demographic": "Demographics"
    },
    {
        " features of the ": null
    },
    {
        "population": "Population"
    },
    {
        " of ": null
    },
    {
        "Macau": "Macau"
    },
    {
        ", including ": null
    },
    {
        "population density": "Population Density"
    },
    {
        ", ": null
    },
    {
        "ethnicity": "Ethnic Group"
    },
    {
        ", education level, health of the populace, economic status, religious affiliations and other aspects of the population.     ": null
    },
    {
        "Macaus": "Macau"
    },
    {
        " population is 95% ": null
    },
    {
        "Chinese": "China"
    },
    {
        ", primarily Cantonese and some ": null
    },
    {
        "Hakka": "Hakka People"
    },
    {
        ", both from nearby ": null
    },
    {
        "Guangdong": "Guangdong"
    },
    {
        " Province. The majority of the remainder are of ": null
    },
    {
        "Portuguese": "Portuguese People"
    },
    {
        " or mixed Chinese-Portuguese ancestry. Some ": null
    },
    {
        "Japan": "Japan"
    },
    {
        "ese, including descendants of Japanese Catholics who were expelled by shōguns, also live in Macau.     The official languages are ": null
    },
    {
        "Portuguese": "Macanese Portuguese"
    },
    {
        " and ": null
    },
    {
        "Cantonese Chinese": "Cantonese Chinese"
    },
    {
        ". The residents commonly speak Cantonese, Mandarin is spoken by 3.2% at home, about 40% are able to communicate in standard Mandarin. English and Portuguese are spoken as a first language by 1.5% and 0.6% respectively, while English is widely thought as a second language. The other popular topolect is ": null
    },
    {
        "Hokkien ": "Min Nan"
    },
    {
        ", spoken by a small percentage of the population. The ": null
    },
    {
        "creole": "Creole Language"
    },
    {
        " Macanese language": "Macanese Language"
    },
    {
        "  is almost extinct.                       Macao is the territory with the worlds second highest life expectancy behind ": null
    },
    {
        "Hong Kong": "Hong Kong"
    },
    {
        ".      Source: UN World Population Prospects        35,578 people in Macau were originally from Fujian province in Mainland China, making up about 25% of the Mainland China-born people. The number of Fujianese in Macau increased after the 1999 handover.        Analysed by nationality, 509,788 were of Chinese nationality, down by 2.9 percentage points from the 2001 Census; meanwhile, only 0.9% was of Portuguese nationality, a decrease of 1.1 percentage points. These figures can be misleading, because more than a 100,000 people in Macau are holders of a Portuguese passport, making them in effect Portuguese citizens. Over the last ten years, diversity of the various components of the population is enhanced as economic development has drawn people to invest, work or study in Macau; consequently, 37,695 were of other nationalities, up by 4.0 percentage points, with 2.7% being Filipinos.   Macau is a Chinese community and those of Chinese ethnicity totalled 510,383, an increase of 94,030 over the past ten years; however, its proportion to the total population decreased by 3.3 percentage points to 92.4%. Those of wholly or partly Portuguese ethnicity totalled 8,106, up slightly by 333 compared with 2001; its proportion to the total decreased by 0.3 percentage point to 1.5%.                 The following demographic statistics are from the ": null
    },
    {
        "CIA World Factbook": "Cia World Factbook"
    },
    {
        ", unless otherwise indicated.       : Chinese 92.4%, other 7.6%       : 624,000        : Male: 307,200   : Female: 316,800       : below age 15: 76,305 15.63%   : age 20-29: 82,547 16.91%   : age 30-39: 70,965 14.54%   : age 40-49: 91,438 18.73%   : age 49 or above: 40,349 8.27%       : 4.35 deaths/1,000 live births       : 0.91 children born/woman The lowest fertility rate in the world after Taiwan.       : noun: Macau   : adjective: Macanese            : 30% ": null
    },
    {
        "Shenism": "Shenism"
    },
    {
        ", 10% ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        " or ": null
    },
    {
        "Taoism": "Taoism"
    },
    {
        ", 5% ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", 50% not declaring religious affiliation, 10% others . Zhidong Hao, 2011. pp. 121-122. Another survey conducted between 2005, 2007 and 2009 has found that 30% of the population follows folk faiths, 10% are adherents of Buddhism or Taoism, 5% are Christians, and the remaining part do not declare religious adherence. Zheng, VWT; Wan, PS. Religious beliefs and life experiences of Macaos residents 澳門居民的宗教信仰與生活經驗. On: Modern China Studies by Center for Modern China, 2010, v. 17 n. 4, p. 91-126. . «Drawing on empirical data obtained from three consecutive territory-wide household surveys conducted in 2005, 2007, and 2009 respectively, this paper attempts to shed light on the current religious profile of Macao residents.»          : Portuguese and Chinese are official languages. The Chinese standard is not specified in the law. Very few speak Portuguese.       : definition: age 15 and over can read and write   : total population: 94.5%   : male: 97.2%   : female: 92%       : Persons authorized to reside in Macau: total: 50,159   : Non-resident workers authorized to enter Macau: total: 39,411   : Legal immigrants from Mainland China: 1,133 947   : No. of criminal cases: 2,634 2,708       : No. of residents per doctor : 473   : No. of residents per nurse: 430   : No. of residents per hospital bed: 496       : Diseases of the circulatory system: 518 cases, 32.1%   : Neoplasm: 455 cases, 28.2%   : Diseases of the respiratory system:": null
    }
]