[
    {
        "       is a 1968 Japanese ": null
    },
    {
        "kaiju film": "Kaiju"
    },
    {
        " directed by ": null
    },
    {
        "Ishirō Honda": "Ishirō Honda"
    },
    {
        " and written by Honda and ": null
    },
    {
        "Takeshi Kimura": "Takeshi Kimura"
    },
    {
        " . The film, which was produced and distributed by ": null
    },
    {
        "Toho Studios": "Toho"
    },
    {
        ", is the ninth film in the ": null
    },
    {
        "Godzilla franchise": "Godzilla"
    },
    {
        ", and features up to eleven monster characters, including ": null
    },
    {
        "Godzilla": "Godzilla"
    },
    {
        ", ": null
    },
    {
        "Mothra": "Mothra"
    },
    {
        ", ": null
    },
    {
        "Rodan": "Rodan"
    },
    {
        ", ": null
    },
    {
        "King Ghidorah": "King Ghidorah"
    },
    {
        ", ": null
    },
    {
        "Anguirus": "Anguirus"
    },
    {
        ", and ": null
    },
    {
        "Minilla": "Minilla"
    },
    {
        ". The film stars ": null
    },
    {
        "Akira Kubo": "Akira Kubo"
    },
    {
        ", ": null
    },
    {
        "Jun Tazaki": "Jun Tazaki"
    },
    {
        ", Yukiko Kobayashi and ": null
    },
    {
        "Yoshio Tsuchiya": "Yoshio Tsuchiya"
    },
    {
        ", with special effects directed by Sadamasa Arikawa, which were provided under the supervision by ": null
    },
    {
        "Eiji Tsuburaya": "Eiji Tsuburaya"
    },
    {
        ".     In the film, humans have achieved world peace by the year 1999, and various giant monsters are confined to an area known as ": null
    },
    {
        "Monsterland": "Monsterland And Monster Island"
    },
    {
        ". The monsters are freed from the area and are ": null
    },
    {
        "mind-controlled": "Mind Control"
    },
    {
        " by aliens known as Kilaaks, who send them to attack major cities. When the monsters are freed from the Kilaaks influence, the aliens send King Ghidorah to challenge the other monsters.     Destroy All Monsters was released theatrically in Japan on August 1, 1968. The film was released by ": null
    },
    {
        "American International Pictures": "American International Pictures"
    },
    {
        " with an English-language dub in the United States on May 23, 1969. Contemporary American reviews were generally negative, with praise mainly held for the climactic monster battle. The film has since been considered a favorite among Godzilla fans for its audacious and simple story , innovative action sequences , and a memorably booming score by ": null
    },
    {
        "Akira Ifukube": "Akira Ifukube"
    },
    {
        ".       At the close of the 20th century, all of the Earths ": null
    },
    {
        "kaiju": "Kaiju"
    },
    {
        " have been collected by the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " Science Committee and confined in an area known as ": null
    },
    {
        "Monsterland": "Monsterland And Monster Island"
    },
    {
        ", located in the ": null
    },
    {
        "Ogasawara island chain": "Ogasawara Islands"
    },
    {
        ". A special control center is constructed underneath the island to ensure that the monsters stay secure and to serve as a research facility to study them.     When communications with Monsterland are suddenly and mysteriously severed, and all of the monsters begin attacking world capitals, Dr. Yoshida of the UNSC orders Captain Yamabe and the crew of his spaceship, Moonlight SY-3, to investigate Ogasawara. There, they discover that the scientists, led by Dr. Otani, have become mind-controlled slaves of a feminine alien race identifying themselves as the ": null
    },
    {
        "Kilaaks": "List Of Toho Alien Raceskilaakians"
    },
    {
        ", who reveal that they are in control of the monsters. Their leader demands that the human race surrender, or face total annihilation.     ": null
    },
    {
        "Godzilla": "Godzilla"
    },
    {
        " attacks ": null
    },
    {
        "New York City": "New York City"
    },
    {
        ", ": null
    },
    {
        "Rodan": "Rodan"
    },
    {
        " invades ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        ", ": null
    },
    {
        "Mothra": "Mothra"
    },
    {
        " lays waste to ": null
    },
    {
        "Beijing": "Beijing"
    },
    {
        ", ": null
    },
    {
        "Gorosaurus": "Gorosaurus"
    },
    {
        " destroys ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", , and ": null
    },
    {
        "Manda": "Manda"
    },
    {
        " attacks ": null
    },
    {
        "London": "London"
    },
    {
        ". These attacks were set in to motion to draw attention away from Japan, so that the aliens can establish an underground stronghold near ": null
    },
    {
        "Mt. Fuji": "Mt. Fuji"
    },
    {
        " in Japan. The Kilaaks then turn their next major attack onto Tokyo and, without serious opposition, become arrogant in their aims until the UNSC discover, after recovering the Kilaaks monster mind-control devices from around the world, that they have switched to broadcasting the control signals from their base under the Moons surface. In a desperate battle, the crew of the SY-3 destroys the Kilaaks lunar outpost and returns the alien control system to Earth.     With all of the monsters under the control of the UNSC, the Kilaaks unleash their hidden weapon, ": null
    },
    {
        "King Ghidorah": "King Ghidorah"
    },
    {
        ". The three-headed space monster is dispatched to protect the alien stronghold at Mt. Fuji, and battles ": null
    },
    {
        "Godzilla": "Godzilla"
    },
    {
        ", ": null
    },
    {
        "Minilla": "Minilla"
    },
    {
        ", ": null
    },
    {
        "Mothra": "Mothra"
    },
    {
        ", ": null
    },
    {
        "Rodan": "Rodan"
    },
    {
        ", ": null
    },
    {
        "Gorosaurus": "Gorosaurus"
    },
    {
        ", ": null
    },
    {
        "Anguirus": "Anguirus"
    },
    {
        ", and ": null
    },
    {
        "Kumonga": "Kumonga"
    },
    {
        ". While seemingly invincible, King Ghidorah is eventually overpowered by the combined strength of the Earth monsters and is killed. Refusing to admit defeat, the Kilaaks produce their trump card, a burning monster they call the Fire Dragon, which begins to torch Tokyo and destroys the control center on Ogasawara. Suddenly, Godzilla attacks and destroys the Kilaaks underground base, revealing that the Earths monsters instinctively know who their enemies are. Captain Yamabe then pursues the Fire Dragon in the SY-3 and narrowly achieves victory for the human race. The Fire Dragon is revealed to be a flaming Kilaak saucer and is destroyed. With the Kilaaks defeated, Godzilla and the other monsters eventually return to Monsterland to live in peace.                 Per the waning popularity of the Godzilla series, special effects director Sadamasa Arikawa noted that Toho were going to potentially end the Godzilla series as Producer Tanaka figured that all the ideas had just run out.      The film was written by ": null
    },
    {
        "Takeshi Kimura": "Takeshi Kimura"
    },
    {
        " and ": null
    },
    {
        "Ishirō Honda": "Ishirō Honda"
    },
    {
        ", making it the first Godzilla film since  Godzilla Raids Again  not written by ": null
    },
    {
        "Shinichi Sekizawa": "Shinichi Sekizawa"
    },
    {
        ". Takeshi Kimura is credited to the pen name Kaoru Mabuchi in the films credits. Kimura and Hondas script developed the concept of ": null
    },
    {
        "Monsterland": "Monsterland And Monster Island"
    },
    {
        " . As the films has several monsters who continuously return in the films, the location was developed to be a faraway island where the monsters are pacified. This tied other films not related to the Godzilla series within its universe, as creatures such as ": null
    },
    {
        "Manda": "Manda"
    },
    {
        "  and ": null
    },
    {
        "Varan": "Varan"
    },
    {
        "  exist. The film features footage from  Ghidorah, the Three-Headed Monster  , specifically ": null
    },
    {
        "King Ghidorahs": "King Ghidorah"
    },
    {
        " fiery birth scene.     New monster suits for Godzilla and ": null
    },
    {
        "Anguirus": "Anguirus"
    },
    {
        " were constructed for the film, while ": null
    },
    {
        "Rodan": "Rodan"
    },
    {
        " and King Ghidorah suits were modified from previous films, with King Ghidorah having less detail than he had in previous films.          Destroy All Monsters was released in Japan on 1 August 1968 where it was distributed by ": null
    },
    {
        "Toho": "Toho"
    },
    {
        ". It was released on a double bill with a reissue of the film  Atragon . The film was reissued theatrically in Japan in 1972 where it was re-edited by Honda to a 74-minute running time and released with the title Gojira: Dengeki Taisakusen . Destroy All Monsters continued the decline in ticket sales in Japan for the Godzilla series, earning 2.6 million in ticket sales. In comparison,  Invasion of Astro-Monster  brought in 3.8 million and  Son of Godzilla  collected 2.5 million.     The film was released in the United States by ": null
    },
    {
        "American International Pictures": "American International Pictures"
    },
    {
        " with an English-language dub on 23 May 1969. The film premiered in the United States in ": null
    },
    {
        "Cincinnati": "Cincinnati"
    },
    {
        ". American International Pictures hired ": null
    },
    {
        "Titra Studios": "Titra Studios"
    },
    {
        " to dub the film into English. The American version of the film remains relatively close to the Japanese original. Among the more notable removed elements include Akira Ifukubes title theme and a brief shot of ": null
    },
    {
        "Minilla": "Minilla"
    },
    {
        " shielding his eyes and ducking when King Ghidorah drops Anguirus from the sky. Destroy All Monsters was shown on American television until the early 1980s. It resurfaced on cable broadcast on the ": null
    },
    {
        "Sci-Fi Channel": "Syfy"
    },
    {
        " in 1996.       Destroy All Monsters was released on ": null
    },
    {
        "VHS": "Vhs"
    },
    {
        " by ": null
    },
    {
        "ADV Films": "Adv Films"
    },
    {
        " in 1998 which featured English-dubbed dialogue from Tohos own International version of the film. In 2011, ": null
    },
    {
        "Tokyo Shock": "Media Blasters"
    },
    {
        " released the film on DVD and ": null
    },
    {
        "Blu-ray": "Blu-Ray"
    },
    {
        " and in 2014 the company re-released it on DVD and Blu-ray.  In 2019, the Japanese version and export English version was included in a Blu-ray box set released by the Criterion Collection, which included all 15 films from the franchises ": null
    },
    {
        "Shōwa era": "Godzilla Shōwa Era"
    },
    {
        ".        From contemporary reviews, both  Variety  and  Monthly Film Bulletin  noted the films best scenes involved the monsters together, while criticising the filmmaking. Variety reviewed the English-dubbed version of the film stating that it may appeal to Sci-fi addicts and monster fans while stating that the plot is on comic strip level, special effects depend on obvious miniatures and acting is from school of  Flash Gordon  and that the films strength relied on its monster rally . The  Monthly Film Bulletin  opined that the model work is poor, and as usual the script is junior comic-strip .  Both reviews mentioned the monsters final scene with Variety commenting that it was clever and the Monthly Film Bulletin stating that apart from statutory devastation of world capitals the monsters have disappointingly little to do until they get together in the last reel for a splendid battle  The Monthly Film Bulletin commented that the film was almost worth sitting through the banalities for the final confrontation on Mount Fuji noting the son of Godzilla endearingly applauding from a safe distance and the victorious monsters performing a celebratory jig .     From retrospective reviews, Steve Biodrowski of  Cinefantastique  commented that the film is too slim in its storyline, too thin in its characterizations, to be considered a truly great film But for the ten-year-old living inside us all, it is entertainment of the most awesome sort.  Matt Paprocki of  Blogcritics  said the film is far from perfect and can be downright boring at times but felt that the destruction scenes make up for everything else and the final battle is an epic that simply cant be matched .      The film is considered a cult favorite among fans of the Godzilla franchise.   In Steve Ryfle and Ed Godziszewskis 2017 book covering Ishiro Hondas filmography, they expressed that Destroy All Monsters is now seen as the last truly spirited entry in Tohos initial series of kaiju films, due to its audacious and simple story, a bounty of monsters and destruction, and a memorably booming soundtrack from Akira Ifukube .      Godzilla  director ": null
    },
    {
        "Gareth Edwards": "Gareth Edwards"
    },
    {
        " previously expressed interest in making a sequel to his 2014 movie inspired by Destroy All Monsters. ": null
    }
]