[
    {
        "     Deus Ex is a 2000 ": null
    },
    {
        "action role-playing": "Action Role-Playing Game"
    },
    {
        " video game": "Video Game"
    },
    {
        " developed by ": null
    },
    {
        "Ion Storm": "Ion Storm"
    },
    {
        " and published by ": null
    },
    {
        "Eidos Interactive": "Eidos Interactive"
    },
    {
        ". Set in a ": null
    },
    {
        "cyberpunk": "Cyberpunk"
    },
    {
        "-themed ": null
    },
    {
        "dystopia": "Dystopia"
    },
    {
        "n world in the year 2052, the story follows ": null
    },
    {
        "JC Denton": "Jc Denton"
    },
    {
        ", an agent of the fictional agency United Nations Anti-Terrorist Coalition , who is given superhuman abilities by ": null
    },
    {
        "nanotechnology": "Nanotechnology In Fiction"
    },
    {
        ", as he sets out to combat hostile forces in a world ravaged by inequality and a deadly plague. His missions entangle him in a conspiracy that brings him into conflict with the ": null
    },
    {
        "Triads": "Triad"
    },
    {
        ", ": null
    },
    {
        "Majestic 12": "Majestic 12"
    },
    {
        ", and the ": null
    },
    {
        "Illuminati": "Illuminati"
    },
    {
        ".     Deus Exs gameplay combines elements of the ": null
    },
    {
        "first-person shooter": "First-Person Shooter"
    },
    {
        " with ": null
    },
    {
        "stealth": "Stealth Game"
    },
    {
        " elements, ": null
    },
    {
        "adventure": "Adventure Game"
    },
    {
        ", and ": null
    },
    {
        "role-playing": "Role-Playing Video Game"
    },
    {
        " genres, allowing for its tasks and missions to be completed in a variety of ways, that in turn lead to differing outcomes. Presented from the ": null
    },
    {
        "first-person": "First-Person"
    },
    {
        " perspective, the player can customize Dentons various abilities such as weapon skills or lockpicking, increasing his effectiveness in these areas; this opens up different avenues of exploration and methods of interacting with or manipulating other characters. The player can complete side missions away from the primary storyline by moving freely around the available areas, which can reward the player with experience points to upgrade abilities and alternative ways to tackle main missions.     The game was released for ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        " on June 2000, with a ": null
    },
    {
        "Mac OS": "Classic Mac Os"
    },
    {
        " port following the next month. A modified version of the game was released for the ": null
    },
    {
        "PlayStation 2": "Playstation 2"
    },
    {
        " in 2002. In the years following its release, Deus Ex has received additional improvements and content from its fan community.     The game received critical acclaim, including repeatedly being named Best PC Game of All Time in  PC Gamer s Top 100 PC Games in 2011 and a poll carried out by the UK gaming magazine  PC Zone . It received several Game of the Year awards, drawing praise for its pioneering designs in player choice and multiple narrative paths. It has sold more than 1 million copies, as of April 23, 2009. The game led to a ": null
    },
    {
        "series": "Deus Ex"
    },
    {
        ", which includes the sequel  Deus Ex: Invisible War  , and three prequels:  Deus Ex: Human Revolution  ,  Deus Ex: The Fall  , and  Deus Ex: Mankind Divided  .       Deus Ex incorporates elements from four ": null
    },
    {
        "video game genres": "Video Game Genre"
    },
    {
        ": ": null
    },
    {
        "role-playing": "Role-Playing Video Game"
    },
    {
        ", ": null
    },
    {
        "first-person shooter": "First-Person Shooter"
    },
    {
        ", ": null
    },
    {
        "adventure": "Adventure Game"
    },
    {
        ", and ": null
    },
    {
        "immersive sim": "Immersive Sim"
    },
    {
        "ulation, the last of which being a game where nothing reminds you that youre just playing a game.  For example, the game uses a ": null
    },
    {
        "first-person": "Point Of View Other Types And Uses"
    },
    {
        " camera during gameplay and includes exploration and character interaction as primary features.     The player assumes the role of JC Denton, a ": null
    },
    {
        "nanotech": "Nanotechnology In Fiction"
    },
    {
        "-augmented operative of the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " Anti-Terrorist Coalition . Deus Ex game manual This nanotechnology is a central gameplay mechanism and allows players to perform ": null
    },
    {
        "superhuman": "Superhuman"
    },
    {
        " feats.       As the player accomplishes objectives, the ": null
    },
    {
        "player character": "Player Character"
    },
    {
        " is rewarded with skill points. Skill points are used to enhance a characters abilities in eleven different areas, and were designed to provide players with a way to customize their characters; a player might create a combat-focused character by increasing proficiency with pistols or rifles, while a more furtive character can be created by focusing on lock picking and computer hacking abilities. There are four different levels of proficiency in each skill, with the skill point cost increasing for each successive level.       Weapons may be customized through weapon modifications, which can be found or purchased throughout the game. The player might add ": null
    },
    {
        "scopes": "Telescopic Sight"
    },
    {
        ", ": null
    },
    {
        "silencers": "Suppressor"
    },
    {
        ", or ": null
    },
    {
        "laser sights": "Laser Sight"
    },
    {
        "; increase the weapons ": null
    },
    {
        "range": "Range Of A Projectile"
    },
    {
        ", ": null
    },
    {
        "accuracy": "Accuracy"
    },
    {
        ", or ": null
    },
    {
        "magazine": "Magazine"
    },
    {
        " size; or decrease its ": null
    },
    {
        "recoil": "Recoil"
    },
    {
        " and reload time; as appropriate to the weapon type.     Players are further encouraged to customize their characters through nano-augmentations—": null
    },
    {
        "cybernetic": "Cybernetic"
    },
    {
        " devices that grant characters superhuman powers. While the game contains eighteen different nano-augmentations, the player can install a maximum of nine, as each must be used on a certain part of the body: one in the arms, legs, eyes, and head; two underneath the skin; and three in the torso.  This forces the player to choose carefully between the benefits offered by each augmentation. For example, the arm augmentation requires the player to decide between boosting their characters skill in hand-to-hand combat or his ability to lift heavy objects.     Interaction with ": null
    },
    {
        "non-player characters": "Non-Player Character"
    },
    {
        " was a significant design focus. When the player interacts with a non-player character, the game will enter a ": null
    },
    {
        "cutscene": "Cutscene"
    },
    {
        "-like conversation mode where the player advances the conversation by selecting from a list of dialogue options. The players choices often have a substantial effect on both gameplay and plot, as non-player characters will react in different ways depending on the selected answer .       Deus Ex features combat similar to first-person shooters, with ": null
    },
    {
        "real-time": "Real Time"
    },
    {
        " action, a first-person perspective, and reflex-based gameplay. As the player will often encounter enemies in groups, combat often tends toward a tactical approach, including the use of cover, strafing, and ": null
    },
    {
        "hit-and-run": "Hit-And-Run Tactics"
    },
    {
        ". A  USA Today  reviewer found, At the easiest difficulty setting, your character is puréed again and again by an onslaught of human and robotic terrorists until you learn the value of stealth.  However, through the games role-playing systems, it is possible to develop a characters skills and augmentations to create a ": null
    },
    {
        "tank": "Tank"
    },
    {
        "-like combat specialist with the ability to deal and absorb large amounts of damage. Non-player characters will praise or criticize the main character depending on the use of force, incorporating a moral element into the gameplay.      Deus Ex features a ": null
    },
    {
        "head-up display": "Hud"
    },
    {
        " crosshair, whose size dynamically shows where shots will fall based on movement, aim, and the weapon in use; the reticle expands while the player is moving or shifting their aim, and slowly shrinks to its original size while no actions are taken. How quickly the reticle shrinks depends on the characters proficiency with the equipped weapon the number of accuracy modifications added to the weapon, and the level of the Targeting nano-augmentation.     Deus Ex features twenty-four weapons, ranging from ": null
    },
    {
        "crowbars": "Crowbar"
    },
    {
        ", ": null
    },
    {
        "electroshock weapons": "Electroshock Weapon"
    },
    {
        ", and riot ": null
    },
    {
        "baton": "Club"
    },
    {
        ", to ": null
    },
    {
        "laser-guided": "Laser Guidance"
    },
    {
        " anti-tank": "Anti-Tank"
    },
    {
        "rockets": "Rocket"
    },
    {
        " and ": null
    },
    {
        "assault rifles": "Assault Rifle"
    },
    {
        "; both lethal and ": null
    },
    {
        "non-lethal weapons": "Non-Lethal Weapon"
    },
    {
        " are available. The player can also make use of several weapons of opportunity, such as ": null
    },
    {
        "fire extinguishers": "Fire Extinguisher"
    },
    {
        ".            Gameplay in Deus Ex emphasizes player choice. Objectives can be completed in numerous ways, including ": null
    },
    {
        "stealth": "Stealth Game"
    },
    {
        ", sniping, heavy frontal assault, dialogue, or engineering and computer hacking. This level of freedom requires that levels, characters, and puzzles be designed with significant redundancy, as a single play-through of the game will miss large sections of dialogue, areas, and other content. In some missions, the player is encouraged to avoid using deadly force, and specific aspects of the story may change depending on how violent or non-violent the player chooses to be. The game is also unusual in that two of its ": null
    },
    {
        "boss": "Boss"
    },
    {
        " villains can be killed off early in the game, or left alive to be defeated later, and this too affects how other characters interact with the player.     Because of its design focus on player choice, Deus Ex has been compared with  System Shock , a game that inspired its design. Together, these factors give the game a high degree of replayability, as the player will have vastly different experiences, depending on which methods they use to accomplish objectives.       Deus Ex was designed as a ": null
    },
    {
        "single-player": "Single-Player"
    },
    {
        " game, and the initial releases of the Windows and Macintosh versions of the game did not include ": null
    },
    {
        "multiplayer": "Multiplayer Video Game"
    },
    {
        " functionality.  Support for multiplayer modes was later incorporated through ": null
    },
    {
        "patches": "Patch"
    },
    {
        ".  The component consists of three game modes: deathmatch, basic team deathmatch, and advanced team ": null
    },
    {
        "deathmatch": "Deathmatch"
    },
    {
        ". Five maps, based on levels from the single-player portion of the game, were included with the original multiplayer patch, but many user-created maps exist. The ": null
    },
    {
        "PlayStation 2": "Playstation 2"
    },
    {
        " release of Deus Ex does not offer a multiplayer mode.  In April 2014 it was announced that GameSpy would cease their masterserver services, also affecting Deus Ex.  A ": null
    },
    {
        "community-made patch": "Community-Made Patch"
    },
    {
        " for the multiplayer mode has been created as a response to this.               Deus Ex takes place in an unspecified near future in an ": null
    },
    {
        "alternate history": "Alternate History"
    },
    {
        " where real-world ": null
    },
    {
        "conspiracy theories": "Conspiracy Theory"
    },
    {
        " are true. These include speculations regarding ": null
    },
    {
        "black helicopters": "Black Helicopter"
    },
    {
        ", ": null
    },
    {
        "vaccinations": "Vaccine Controversies"
    },
    {
        ", and ": null
    },
    {
        "FEMA": "Federal Emergency Management Agency"
    },
    {
        ", as well as ": null
    },
    {
        "Area 51": "Area 51"
    },
    {
        ", the ": null
    },
    {
        "ECHELON": "Echelon"
    },
    {
        " network, ": null
    },
    {
        "Men in Black": "Men In Black"
    },
    {
        ", ": null
    },
    {
        "chupacabras": "Chupacabra"
    },
    {
        " , and ": null
    },
    {
        "grey aliens": "Grey Alien"
    },
    {
        ". Mysterious groups such as ": null
    },
    {
        "Majestic 12": "Majestic 12"
    },
    {
        ", the ": null
    },
    {
        "Illuminati": "Illuminati"
    },
    {
        ", the ": null
    },
    {
        "Knights Templar": "Knights Templar"
    },
    {
        ", the ": null
    },
    {
        "Bilderberg Group": "Bilderberg Group"
    },
    {
        ", and the ": null
    },
    {
        "Trilateral Commission": "Trilateral Commission"
    },
    {
        " also either play a central part in the plot or are alluded to during the course of the game.     The plot of Deus Ex depicts a society on a slow spiral into chaos. There is a massive division between the rich and the poor, not only socially, but in some cities physically. A lethal ": null
    },
    {
        "pandemic": "Pandemic"
    },
    {
        ", known as the Gray Death, ravages the worlds population, especially within the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", and has no cure. A synthetic ": null
    },
    {
        "vaccine": "Vaccine"
    },
    {
        ", Ambrosia, manufactured by the company VersaLife, nullifies the effects of the virus but is in critically short supply. Because of its scarcity, Ambrosia is available only to those deemed vital to the ": null
    },
    {
        "social order": "Social Order"
    },
    {
        ", and finds its way primarily to government officials, military personnel, the rich and influential, scientists, and the intellectual elite. With no hope for the common people of the world, riots occur worldwide, and some terrorist organizations have formed with the professed intent of assisting the downtrodden, among them the National Secessionist Forces of the U.S. and a French group known as Silhouette.     To combat these threats to the world order, the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " has expanded its influence around the globe to form the United Nations Anti-Terrorist Coalition . Wendi White  As the giddiness that greeted the new millennium faded to grim apathy in the face of the plague, famine, and the inevitable waves of national convulsions that followed in their wake, the United Nations found itself increasingly outmoded and unable to cope with the worldwide rise in terrorism.  It is headquartered near ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " in a bunker beneath ": null
    },
    {
        "Liberty Island": "Liberty Island"
    },
    {
        ", placed there after a terrorist strike on the ": null
    },
    {
        "Statue of Liberty": "Statue Of Liberty"
    },
    {
        ". UNATCO Handbook: UNATCO and the World Not only did the United States become a charter member of UNATCO, but UNATCO headquarters are now located on Liberty Island in the shadow of that shattered monument to FREEDOM.      The main character of Deus Ex is UNATCO agent ": null
    },
    {
        "JC Denton": "Jc Denton"
    },
    {
        " , one of the first in a new line of agents physically altered with advanced ": null
    },
    {
        "nanotechnology": "Nanotechnology"
    },
    {
        " to gain superhuman abilities, alongside his brother Paul , who joined UNATCO to avenge his parents deaths at the hands of Majestic 12. His UNATCO colleagues include the ": null
    },
    {
        "mechanically-augmented": "Human Enhancement"
    },
    {
        " and ruthlessly efficient field agents Gunther Hermann and Anna Navarre; Quartermaster General Sam Carter,  and the bureaucratic UNATCO chief Joseph Manderley.  Alex Jacobsons character model and name are based on ": null
    },
    {
        "Warren Spectors": "Warren Spector"
    },
    {
        " nephew, Alec Jacobson.      JCs missions bring him into contact with various characters, including NSF leader Juan Lebedev, hacker and scientist Tracer Tong, nano-tech expert Gary Savage, Nicolette DuClare , former Illuminati leader Morgan Everett, the Artificial Intelligences Daedalus and Icarus, and Bob Page, owner of VersaLife and leader of Majestic 12, a clandestine organization that has usurped the infrastructure of the Illuminati, allowing him to control the world for his own ends.        After completing his training, UNATCO agent JC Denton takes several missions given by Director Joseph Manderley to track down members of the National Secessionist Forces and their stolen shipments of the Ambrosia vaccine, the treatment for the Gray Death virus. Through these missions, JC is reunited with his brother, Paul, who is also nano-augmented. JC tracks the Ambrosia shipment to a private terminal at ": null
    },
    {
        "LaGuardia Airport": "Laguardia Airport"
    },
    {
        ". Paul meets JC outside the plane and explains that he has defected from UNATCO and is working with the NSF after learning that the Gray Death is a human-made virus, with UNATCO using its power to make sure only the elite receive the vaccine. Paul: The Gray Death is a man-made virus. Everyone up to the President is at UNATCOs mercy as long as UNATCO controls the supply of Ambrosia. / JC: You believe that? / Paul: We have proof. We need to get the Ambrosia to Hong Kong. Heard of Tracer Tong? He can help us synthesize it ourselves.      JC returns to UNATCO headquarters and is told by Manderley that both he and Paul have been outfitted with a 24-hour ": null
    },
    {
        "kill switch": "Kill Switch"
    },
    {
        " and that Pauls has been activated due to his betrayal. Manderley orders JC to fly to ": null
    },
    {
        "Hong Kong": "Hong Kong"
    },
    {
        " to eliminate Tracer Tong, a hacker whom Paul has contact with, and who can disable the kill switches. Instead, JC returns to Pauls apartment to find Paul hiding inside. Paul further explains his defection and encourages JC to also defect by sending out a distress call to alert the NSFs allies. Upon doing so, JC becomes a wanted man by UNATCO, and his kill switch is activated by ": null
    },
    {
        "Federal Emergency Management Agency": "Federal Emergency Management Agency"
    },
    {
        " Director Walton Simons. JC is unable to escape UNATCO forces, and both he and Paul are taken to a secret prison below UNATCO headquarters. An entity named Daedalus contacts JC and informs him that the prison is part of ": null
    },
    {
        "Majestic 12": "Majestic 12"
    },
    {
        ", and arranges for him and Paul to escape. The two flee to Hong Kong to meet with Tong, who deactivates their kill switches. Tong requests JC to infiltrate the VersaLife building. Doing so, JC discovers that the corporation is the source for the Gray Death, and he can steal the plans for the virus and destroy the universal constructor that produces it. Daedalus: Majestic 12 seeks to use force and intimidation to seize absolute control. Of everything. They will not hesitate to use all means necessary to achieve this goal, and have engineered the disease you refer to as the Gray Death in an effort to accomplish this. The Gray Death is a nanotechnologically engineered virus. You must locate the Universal Constructor used to create the Gray Death and destroy it. My information indicates that it is in Hong Kong, housed in a Majestic 12 facility beneath the corporation known as VersaLife.      Analysis of the virus shows that it was manufactured by the ": null
    },
    {
        "Illuminati": "Illuminati"
    },
    {
        ", prompting Tong to send JC to ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " to try to make contact with the organization and obtain their help fighting Majestic 12. JC meets with Illuminati leader Morgan Everett and learns that the Gray Death virus was intended to be used for ": null
    },
    {
        "augmentation": "Human Enhancement"
    },
    {
        " technology, but Majestic 12, led by trillionaire businessman and former Illuminatus Bob Page, was able to steal and repurpose it into its viral form. Everett recognizes that without VersaLifes universal constructor, Majestic 12 can no longer create the virus, and will likely target ": null
    },
    {
        "Vandenberg Air Force Base": "Vandenberg Air Force Base"
    },
    {
        ", where X-51, a group of former ": null
    },
    {
        "Area 51": "Area 51"
    },
    {
        " scientists, have built another one. After aiding the base personnel in repelling a Majestic 12 attack, JC meets X-51 leader Gary Savage, who reveals that Daedalus is an ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        " borne out of the ": null
    },
    {
        "ECHELON": "Echelon"
    },
    {
        " program. Everett attempts to gain control over Majestic 12s communications network by releasing Daedalus onto the U.S. military networks, but Page counters by releasing his own AI, Icarus, which merges with Daedalus to form a new AI, Helios, with the ability to control all global communications. After this, Savage enlists JCs help in procuring schematics for reconstructing components for the UC that were damaged during Majestic 12s raid of Vandenberg. JC finds the schematics and electronically transmits them to Savage. Page intercepts the transmission and launches a ": null
    },
    {
        "nuclear missile": "Nuclear Missile"
    },
    {
        " at Vandenberg to ensure that Area 51 will be the only location in the world with an operational UC. However, JC can reprogram the missile to strike Area 51. JC travels there himself to confront Page.     When JC locates him, Page reveals that he seeks to merge with Helios and gain full control over all nanotechnology. JC is contacted by Tong, Everett, and the Helios AI simultaneously. All three factions ask for his help in defeating Page while furthering their own objectives, and JC is forced to choose between them. Tong seeks to plunge the world into a ": null
    },
    {
        "Dark Age": "Dark Ages"
    },
    {
        " by destroying the global communications hub and preventing anyone from taking control of the world. JC Denton: If we destroy the Aquinas Hub, well take down the global network. / Tracer Tong: Exactly. They dug their own grave, JC. Were going to eliminate global communications altogether. / JC: I dont know... sounds like overkill. / Tong: As long as technology has a global reach, someone will have the world in the palm of his hand. If not Bob Page, then Everett, Dowd... / JC: Another Stone Age would hardly be an improvement. / Tong: Not so drastic. A dark age, an age of city-states, craftsmen, government on a scale comprehensible to its citizens.  Everett offers Denton the chance to bring the Illuminati back to power by killing Bob Page and using the technology of Area 51 to rule the world with an invisible hand. Everett: No, JC. Spare the facility. Spare Helios, the power station. They can be made to serve us. / JC: Us? / Everett: You and me, JC. Well rule the world in secret, with an invisible hand, the way the Illuminati have always ruled.  Helios wishes to merge with Denton and rule the world as a ": null
    },
    {
        "benevolent dictator": "Benevolent Dictatorship"
    },
    {
        " with infinite knowledge and reason. Helios: You are ready. I do not wish to wait for Bob Page. With human understanding and network access, we can administrate the world, yes, yes. / JC: Rule the world...? Why? Who gave you the directive? There must be a human being behind your ambition. / Helios: I should regulate human affairs precisely because I lack all ambition, whereas human beings are prey to it. Their history is a succession of inane squabbles, each one coming closer to total destruction.  The players decision determines the course of the future and brings the game to a close.             After ": null
    },
    {
        "Looking Glass Technologies": "Looking Glass Studios"
    },
    {
        " and ": null
    },
    {
        "Origin Systems": "Origin Systems"
    },
    {
        " released  Ultima Underworld II: Labyrinth of Worlds  in January 1993, producer ": null
    },
    {
        "Warren Spector": "Warren Spector"
    },
    {
        " began to plan Troubleshooter, the game that would become Deus Ex. In his 1994 proposal, he described the concept as Underworld-style first-person action in a real-world setting with big-budget, nonstop action. After Spector and his team were laid off from Looking Glass, ": null
    },
    {
        "John Romero": "John Romero"
    },
    {
        " of ": null
    },
    {
        "Ion Storm": "Ion Storm"
    },
    {
        " offered him the chance to make his dream game without any restrictions.     Preproduction for Deus Ex began around August 1997 and lasted roughly six months. The games working title was Shooter: Majestic Revelations, and it was scheduled for release on Christmas 1998. The team developed the setting before the ": null
    },
    {
        "game mechanics": "Game Mechanics"
    },
    {
        ". Noticing his wifes fascination with  The X-Files , Spector connected the real world, millennial weirdness, conspiracy topics on his mind and decided to make a game about them that would appeal to a broad audience. The Shooter design document cast the player as an ": null
    },
    {
        "augmented": "Human Enhancement"
    },
    {
        " agent working against an elite cabal in the dangerous and chaotic 2050s. It cited  Half-Life ,  Fallout ,  Thief: The Dark Project , and  GoldenEye 007  as game design influences, and used the stories and settings of  Colossus: The Forbin Project ,  The Manchurian Candidate ,  Robocop , The X-Files, and  Men in Black  as reference points. The team designed a ": null
    },
    {
        "skill system": "Statistic"
    },
    {
        " that featured special powers derived from nanotechnological augmentation and avoided the inclusion of ": null
    },
    {
        "die rolling": "Diceapplication In Role-Playing Games"
    },
    {
        " and skills that required micromanagement. Spector also cited ": null
    },
    {
        "Konamis": "Konami"
    },
    {
        " 1995 ": null
    },
    {
        "role-playing video game": "Role-Playing Video Game"
    },
    {
        "  Suikoden  as an inspiration, stating that the limited ": null
    },
    {
        "choices": "Dialog Tree"
    },
    {
        " in Suikoden inspired him to expand on the idea with more meaningful choices in Deux Ex.      In early 1998, the Deus Ex team grew to 20 people, and the game entered a 28-month production phase. The development team consisted of three programmers, six designers, seven artists, a writer, an associate producer, a tech, and Spector. Two writers and four testers were hired as contractors. Chris Norden was the lead programmer and assistant director, ": null
    },
    {
        "Harvey Smith": "Harvey Smith"
    },
    {
        " the lead designer, Jay Lee the lead artist, and Sheldon Pacotti the lead writer. Close friends of the team who understood the intentions behind the game were invited to ": null
    },
    {
        "playtest": "Playtest"
    },
    {
        " and give feedback. The wide range of input led to debates in the office and changes to the game. Spector later concluded that the team was blinded by promises of complete creative freedom, and by their belief that the game would have no budget, marketing, or time restraints. By mid-1998, the games title had become Deus Ex, derived from the ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " literary device": "Literary Device"
    },
    {
        "  deus ex machina  , in which a plot is resolved by an unpredictable intervention.     Spector felt that the best aspects of Deus Exs development were the high-level vision and length of preproduction, flexibility within the project, testable proto-missions, and the ": null
    },
    {
        "Unreal Engine": "Unreal Engine"
    },
    {
        " license. The teams pitfalls included the management structure, unrealistic goals, underestimating risks with ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        ", their handling of proto-missions, and weakened morale from bad press. Deus Ex was released on June 23, 2000, and published by ": null
    },
    {
        "Eidos Interactive": "Eidos Interactive"
    },
    {
        " for ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        ". The team planned third-party ": null
    },
    {
        "ports": "Portingporting In Gaming"
    },
    {
        " for ": null
    },
    {
        "Mac OS 9": "Mac Os 9"
    },
    {
        " and ": null
    },
    {
        "Linux": "Linux"
    },
    {
        ".         The original 1997 design document for Deus Ex privileges character development over all other features. The game was designed to be genre-busting : in parts ": null
    },
    {
        "simulation": "Simulation Game"
    },
    {
        ", ": null
    },
    {
        "role-playing": "Role-Playing Video Game"
    },
    {
        ", ": null
    },
    {
        "first-person shooter": "First-Person Shooter"
    },
    {
        ", and ": null
    },
    {
        "adventure": "Adventure Game"
    },
    {
        ". The team wanted players to consider who they wanted to be in the game, and for that to alter how they behaved in the game. In this way, the game world was deeply simulated, or realistic and believable enough that the player would solve problems in creative, ": null
    },
    {
        "emergent": "Emergent Gameplay"
    },
    {
        " ways without noticing distinct puzzles. However, the simulation ultimately failed to maintain the desired level of openness, and they had to ": null
    },
    {
        "brute force": ":Wikt:Brute Force"
    },
    {
        " skill, action, and character interaction paths through each level. Playtesting also revealed that their idea of a role-playing game based on the real world was more interesting in theory than in reality, as certain aspects of the real world, such as hotels and office buildings, were not compelling in a game.      The games story changed considerably during production, but the idea of an augmented counterterrorist protagonist named JC Denton remained throughout. Though Spector originally pictured Deus Ex as akin to The X-Files, lead writer Sheldon Pacotti felt that it ended up more like ": null
    },
    {
        "James Bond": "James Bond"
    },
    {
        ". Spector wrote that the team overextended itself by planning highly elaborate scenes. Designer Harvey Smith removed a mostly complete White House level due to its complexity and production needs. Finished ": null
    },
    {
        "digital assets": "Digital Asset"
    },
    {
        " were repurposed or abandoned by the team. Pete Davison of USgamer referred to the White House and presidential bunker as the truly deleted scenes of Deus Ex lost levels.     One of the things that Spector wanted to achieve in Deus Ex was to make JC Denton a cipher for the player, to create a better immersion and gameplay experience. He did not want the character to force any emotion, so that whatever feelings the player may be experiencing come from themselves rather than from JC Denton. To do this, Spector instructed voice actor ": null
    },
    {
        "Jay Anthony Franke": "Jay Anthony Franke"
    },
    {
        " to record his dialogue without any emotion but in a monotone voice, which is unusual for a voice acting role.       Once coded, the teams game systems did not work as intended. The early tests of the conversation system and user interface were flawed. The team also found augmentations and skills to be less interesting than they had seemed in the design document. In response, Harvey Smith substantially revised the augmentations and skills. ": null
    },
    {
        "Production milestones": "Milestone"
    },
    {
        " served as wake-up calls for the games direction. A May 1998 milestone that called for a functional demo revealed that the size of the games maps caused ": null
    },
    {
        "frame rate": "Frame Ratevideo Games"
    },
    {
        " issues, which was one of the first signs that maps needed to be cut. A year later, the team reached a milestone for finished game systems, which led to better estimates for their future mission work and the reduction of the 500-page design document to 270 pages. Spector recalled Smiths mantra on this point: less is more.      One of the teams biggest blind spots was the AI programming for NPCs. Spector wrote that they considered it in preproduction, but that they did not figure out how to handle it until relatively late in development.  This led to wasted time when the team had to discard their old AI code. The team built atop their ": null
    },
    {
        "game engines": "Game Engine"
    },
    {
        " shooter-based AI instead of writing new code that would allow characters to exhibit convincing emotions. As a result, NPC behavior was variable until the very end of development. Spector felt that the teams sin was their inconsistent display of a trustable human AI.           The game was developed on systems including dual-processor ": null
    },
    {
        "Pentium Pro": "Pentium Pro"
    },
    {
        " 200s and ": null
    },
    {
        "Athlon": "Athlon"
    },
    {
        " 800s with eight and nine gigabyte hard drives, some using ": null
    },
    {
        "SCSI": "Scsi"
    },
    {
        ". The team used more than 100 video cards throughout development. Deus Ex was built using ": null
    },
    {
        "Visual Studio": "Visual Studio"
    },
    {
        ", ": null
    },
    {
        "Lightwave": "Lightwave"
    },
    {
        ", and ": null
    },
    {
        "Lotus Notes": "Lotus Notes"
    },
    {
        ". They also made a custom dialogue editor, ConEdit. The team used ": null
    },
    {
        "UnrealEd": "Unrealed"
    },
    {
        " atop the Unreal game engine for map design, which Spector wrote was superior to anything else available.  Their trust in ": null
    },
    {
        "UnrealScript": "Unrealscript"
    },
    {
        " led them to code special-cases for their immediate mission needs instead of more generalized multi-case code. Even as concerned team members expressed misgivings, the team only addressed this later in the project. To Spector, this was a lesson to always prefer general solutions over special casing, such that the toolset works predictably.     They waited to license a game engine until after preproduction, expecting the benefits of licensing to be more time for the content and gameplay, which Spector reported to be the case. They chose the Unreal engine, as it did 80% of what they needed from an engine and was more economical than building from scratch. Their small programming team allowed for a larger design group. The programmers also found the engine accommodating, though it took about nine months to acclimate to the software. Spector felt that they would have understood the code better had they built it themselves, instead of treating the engine as a ": null
    },
    {
        "black box": "Black Box"
    },
    {
        " and coding conservatively. He acknowledged that this precipitated into the ": null
    },
    {
        "Direct3D": "Direct3D"
    },
    {
        " issues in their final release, which slipped through their quality assurance testing. Spector also noted that the artificial intelligence, pathfinding, and sound propagation were designed for shooters and should have been rewritten from scratch instead of relying on the engine. He thought the licensed engine worked well enough that he expected to use the same for the games sequel  Deus Ex: Invisible War  and  Thief 3 . He added that developers should not attempt to force their technology to perform in ways it was not intended, and should find a balance between perfection and pragmatism.            The soundtrack of Deus Ex, composed by ": null
    },
    {
        "Alexander Brandon": "Alexander Brandon"
    },
    {
        " , ": null
    },
    {
        "Dan Gardopée": "Dan Gardopée"
    },
    {
        " , ": null
    },
    {
        "Michiel van den Bos": "Michiel Van Den Bos"
    },
    {
        " , and ": null
    },
    {
        "Reeves Gabrels": "Reeves Gabrels"
    },
    {
        " ,  was praised by critics for complementing the gritty atmosphere predominant throughout the game with melodious and ": null
    },
    {
        "ambient music": "Ambient Music"
    },
    {
        " incorporated from a number of genres, including ": null
    },
    {
        "techno": "Techno"
    },
    {
        ", ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        ", and ": null
    },
    {
        "classical": "Classical Music"
    },
    {
        ".    The music sports a basic dynamic element, similar to the ": null
    },
    {
        "iMUSE": "Imuse"
    },
    {
        " system used in early 1990s ": null
    },
    {
        "LucasArts": "Lucasarts"
    },
    {
        " games; during play, the music will change to a different iteration of the currently playing song based on the players actions, such as when the player starts a conversation, engages in combat, or transitions to the next level. All the music in the game is ": null
    },
    {
        "tracked": "Module File"
    },
    {
        " - Gabrels contribution, NYC Bar, was converted to a module by Brandon.       Deus Ex has been re-released in several iterations since its original publication and has also been the basis of several ": null
    },
    {
        "mods": "Mod"
    },
    {
        " developed by its fan community.     The Deus Ex: Game of the Year Edition, which was released on May 8, 2001,  contains the latest game ": null
    },
    {
        "updates": "Patch"
    },
    {
        " and a ": null
    },
    {
        "software development kit": "Software Development Kit"
    },
    {
        ", a separate ": null
    },
    {
        "soundtrack": "Soundtrack"
    },
    {
        " CD": "Compact Disc"
    },
    {
        ", and a page from a fictional newspaper featured prominently in Deus Ex titled The Midnight Sun, which recounts recent events in the games world.  However, later releases of said version do not include the soundtrack CD and contain a ": null
    },
    {
        "PDF": "Pdf"
    },
    {
        " version of the newspaper on the games disc.     The ": null
    },
    {
        "Mac OS": "Classic Mac Os"
    },
    {
        " version of the game, released a month after the Windows version, was shipped with the same capabilities and can also be patched to enable multiplayer support.  However, ": null
    },
    {
        "publisher": "Video Game Publisher"
    },
    {
        " Aspyr Media": "Aspyr Media"
    },
    {
        " did not release any subsequent editions of the game or any additional patches. As such, the game is only supported in ": null
    },
    {
        "Mac OS 9": "Mac Os 9"
    },
    {
        " and the Classic environment in ": null
    },
    {
        "Mac OS X": "Mac Os X"
    },
    {
        ", neither of which are compatible with ": null
    },
    {
        "Intel": "Intel"
    },
    {
        "-based Macs. The Windows version will run on Intel-based Macs using Crossover, ": null
    },
    {
        "Boot Camp": "Boot Camp"
    },
    {
        ", or other software to enable a compatible version of Windows to run on a Mac.     A ": null
    },
    {
        "PlayStation 2": "Playstation 2"
    },
    {
        " port of the game, retitled Deus Ex: The Conspiracy outside of Europe, was released on March 26, 2002.   Along with ": null
    },
    {
        "motion-capture": "Motion Capture"
    },
    {
        "d character animations and pre-rendered introductory and ending cinematics that replaced the original versions, it features a simplified interface with optional ": null
    },
    {
        "auto-aim": "Auto-Aim"
    },
    {
        ". There are many minor changes in level design, some to balance gameplay, but most to accommodate loading transition areas,   due to the memory limitations of the PlayStation 2.  The PlayStation 2 version was re-released in Europe on the ": null
    },
    {
        "PlayStation 3": "Playstation 3"
    },
    {
        " as a ": null
    },
    {
        "PlayStation 2 Classic": "List Of Playstation 2 Classics"
    },
    {
        " on May 16, 2012.      ": null
    },
    {
        "Loki Games": "Loki Software"
    },
    {
        " worked on a ": null
    },
    {
        "Linux": "Linux"
    },
    {
        " version of the game, but the company went out of business before releasing it.  The ": null
    },
    {
        "OpenGL": "Opengl"
    },
    {
        " layer they wrote for the port, however, was sent out to Windows gamers through an online patch, which also makes the game far more compatible with ": null
    },
    {
        "Wine": "Wine"
    },
    {
        " on Linux than it would have been with only ": null
    },
    {
        "Direct3D": "Direct3D"
    },
    {
        ".     Though their quality assurance did not see major Direct3D issues, players noted dramatic slowdowns immediately following the launch, and the team did not understand the black box of the Unreal engine well enough to make it do exactly what they needed. Spector characterized Deus Ex reviews into two categories based on how they begin with either how Warren Spector makes games all by himself or that Deus Ex couldnt possibly have been made by Ion Storm.  He has said that the game won over 30 best of awards in 2001, and concluded that their final game was not perfect, but that they were much closer for having tried to do things right or not at all.               Deus Ex was built on the ": null
    },
    {
        "Unreal Engine": "Unreal Engine"
    },
    {
        ", which already had an active community of ": null
    },
    {
        "modders": "Modder"
    },
    {
        ".  On September 20, 2000, Eidos Interactive and Ion Storm announced in a press release that they would be releasing the ": null
    },
    {
        "software development kit": "Software Development Kit"
    },
    {
        " , which included all the tools used to create the original game. Several team members, as well as project director Warren Spector, stated that they were really looking forward to seeing what does with our tools.  The kit was released on September 22, 2000,  and soon gathered community interest, followed by the release of tutorials, small mods, up to announcements of large mods and conversions. While Ion Storm did not hugely alter the engines rendering and core functionality, they introduced ": null
    },
    {
        "role-playing": "Role-Playing Video Game"
    },
    {
        " elements.     In 2009, a fan-made mod called  The Nameless Mod   was released by Off Topic Productions.  The games protagonist is a user of an Internet forum, with digital places represented as physical locations. The mod offers roughly the same amount of gameplay as Deus Ex and adds several new features to the game, with a more open world structure than Deus Ex and new weapons such as the player characters fists. The mod was developed over seven years and has thousands of lines of recorded dialogue and two different parallel story arcs. Upon its release, TNM earned a 9/10 overall from PCPowerPlay magazine.  In ": null
    },
    {
        "ModDBs": "Moddb"
    },
    {
        " 2009 Mod of the Year awards, The Nameless Mod won the Editors Choice award for Best Singleplayer Mod.      In 2015, during the 15th anniversary of the games release, ": null
    },
    {
        "Square Enix": "Square Enix"
    },
    {
        " endorsed a free fan-created mod, Deus Ex: Revision which was released through Steam. The mod, created by Caustic Creative, is a graphical overhaul of the original game, adding in support for newer versions of ": null
    },
    {
        "DirectX": "Directx"
    },
    {
        ", improving the textures and the soundtrack from the original game, and adding in more world-building aesthetics.          According to  Computer Gaming World s Stefan Janicki, Deus Ex had sold well in North America by early 2001.  In the United States, it debuted at 6 on ": null
    },
    {
        "PC Datas": "Pc Data"
    },
    {
        " sales chart for the week ending June 24, at an average retail price of $40.  It fell to eighth place in its second week  but rose again to position 6 in its third.  It proceeded to place in the top 10 rankings for August 6–12 and the week ending September 2   and to secure 10th place overall for the months of July and August.  Deus Ex achieved sales of 138,840 copies and revenues of $5 million in the United States by the end of 2000, according to PC Data.  The firm tracked another 91,013 copies sold in the country during 2001.      The game was a larger hit in Europe; Janicki called it a blockbuster for the region, which broke a trend of weak sales for 3D games. He wrote, Europe—particularly in England—the action/RPG dominated the charts all summer, despite competition from heavyweights like  Diablo II  and  The Sims . In the German-speaking market,  PC Player  reported sales over 70,000 units for Deus Ex by early 2001. It debuted at 3 in the region for July 2000 and held the position in August, before dropping to 10, 12 and 27 over the following three months.  In the United Kingdom, Deus Ex reached 1 on the sales charts during August and spent three months in the top 10. It received a Silver award from the ": null
    },
    {
        "Entertainment and Leisure Software Publishers Association": "Entertainment And Leisure Software Publishers Association"
    },
    {
        " in February 2002, indicating lifetime sales of at least 100,000 units in the United Kingdom.  The ELSPA later raised it to Gold status,  for 200,000 sales.      In April 2009, ": null
    },
    {
        "Square-Enix": "Square-Enix"
    },
    {
        " revealed that Deus Ex had surpassed 1 million sales globally, but was outsold by  Deus Ex: Invisible War .             Deus Ex received critical acclaim, attaining a score of 90 out of 100 from 28 critics on ": null
    },
    {
        "Metacritic": "Metacritic"
    },
    {
        ". Thierry Nguyen from  Computer Gaming World  said that the game delivers moments of brilliance, idiocy, ingenuity, and frustration.   Computer Games Magazine  praised the title for its deep gameplay and its use of multiple solutions to situations in the game.  Similarly,  Edge  highlighted the games freedom of choice, saying that Deus Ex never tells you what to do. Goals are set, but alter according to your decisions.      Former ": null
    },
    {
        "GameSpot": "Gamespot"
    },
    {
        " reviewer ": null
    },
    {
        "Greg Kasavin": "Greg Kasavin"
    },
    {
        ", though awarding the game a score of 8.2 of 10, was disappointed by the security and lockpicking mechanics. Such instances are essentially noninteractive, he wrote. You simply stand there and spend a particular quantity of electronic picks or modules until the door opens or the security goes down. Kasavin made similar complaints about the hacking interface, noting that, Even with basic hacking skills, youll still be able to bypass the encryption and password protection ... by pressing the hack button and waiting a few seconds.     The games graphics and sounds were also met with muted enthusiasm. Kasavin complained of Deus Exs relatively sub-par graphics, blaming them on the games incessantly dark industrial environments. ": null
    },
    {
        "GamePro": "Gamepro"
    },
    {
        " reviewer Chris Patterson took the time to note that despite being solid acoustically, Deus Ex had moments of weakness.  He poked fun at JCs ": null
    },
    {
        "Joe Friday": "Joe Friday"
    },
    {
        ", just the facts, deadpan, and the truly cheesy accents of minor characters in Hong Kong and New York City. ": null
    },
    {
        "IGN": "Ign"
    },
    {
        " called the graphics blocky, adding that the animation is stiff, and the ": null
    },
    {
        "dithering": "Dithering"
    },
    {
        " is just plain awful in some spots, referring to the limited capabilities of the Unreal Engine used to design the game. The website, later on, stated that overall Deus Ex certainly looks better than your average game.      Reviewers and players also complained about the size of Deus Exs save files. An Adrenaline Vault reviewer noted that Playing through the entire adventure, accumulated over 250  MB of save game data, with the average file coming in at over 15  MB.      The game developed a strong cult following, leading to a core modding and playing community that remained active over 15 years after its release. In an interview with IGN in June 2015, game director Warren Spector said he never expected Deus Ex to sell many copies, but he did expect it to become a cult classic among a smaller, active community, and he continues to receive fan mail from players to date regarding their experiences and thoughts about Deus Ex.        Deus Ex received over 30 best of awards in 2001, from outlets such as ": null
    },
    {
        "IGN": "Ign"
    },
    {
        ", ": null
    },
    {
        "GameSpy": "Gamespy"
    },
    {
        ",  PC Gamer ,  Computer Gaming World , and The Adrenaline Vault.   It won Excellence in Game Design and Game Innovation Spotlight at the 2001 ": null
    },
    {
        "Game Developers Choice Awards": "Game Developers Choice Awards"
    },
    {
        ", and it was nominated for Game of the Year.  At the ": null
    },
    {
        "Interactive Achievement Awards": "Interactive Achievement Awards"
    },
    {
        ", it won in the Computer Innovation and Computer Action/Adventure categories and received nominations for Sound Design, PC Role-Playing, and Game of the Year in both the PC and overall categories.   The ": null
    },
    {
        "British Academy of Film and Television Arts": "British Academy Of Film And Television Arts"
    },
    {
        " named it PC Game of the Year.  The game also collected several Best Story accolades, including first prize in ": null
    },
    {
        "Gamasutras": "Gamasutra"
    },
    {
        " 2006 Quantum Leap awards for storytelling in a video game.       Since its release, Deus Ex has appeared in several Greatest Games of All Time lists and ": null
    },
    {
        "Hall of Fame": "Hall Of Fame"
    },
    {
        " features. It was included in IGNs 100 Greatest Games of All Time , Top 25 Modern PC Games and Top 25 PC Games of All Time lists.      GameSpy featured the game in its Top 50 Games of All Time and 25 Most Memorable Games of the Past 5 Years lists,   and in the sites Hall of Fame.   PC Gamer  placed Deus Ex on its Top 100 PC Games of All Time and 50 Best Games of All Time lists,       and it was awarded 1st place in  PC Zone s 101 Best PC Games Ever feature.  It was also included in ": null
    },
    {
        "Yahoo!": "Yahoo!"
    },
    {
        " UK Video Games 100 Greatest Computer Games of All Time list,  and in  Edge s The 100 Best Videogames  and 100 Best Games to Play Today lists.   Deus Ex was named the second-best game of the 2000s by ": null
    },
    {
        "Gamasutra": "Gamasutra"
    },
    {
        ".  In 2012, Time named it one of the 100 greatest video games of all time,  and ": null
    },
    {
        "G4tv": "G4Tv"
    },
    {
        " ranked it as the 53rd best game of all time for its complex and well-crafted story that was really the start of players making choices that genuinely affect the outcome.  ": null
    },
    {
        "1UP.com": "1Up.Com"
    },
    {
        " listed it as one of the most important games of all time, calling its influence too massive to properly gauge.                A film adaptation based on the game was initially announced in May 2002 by ": null
    },
    {
        "Columbia Pictures": "Columbia Pictures"
    },
    {
        ". The film was being produced by ": null
    },
    {
        "Laura Ziskin": "Laura Ziskin"
    },
    {
        ", along with Greg Pruss attached with writing the screenplay. Peter Schlessel, president of the production for Columbia Pictures, and Paul Baldwin, president of marketing for Eidos Interactive, stated that they were confident in that the adaptation would be a successful development for both the studios and the franchise.  In March 2003, during an interview with Greg Pruss, he informed IGN that the character of JC Denton would be a little bit filthier than he was in the game. He further stated that the script was shaping up to be darker in tone than the original game.  Although a release date was scheduled for 2006, the film did not get past the scripting stage.     In 2012, CBS films revived the project, buying the rights and commissioning a film inspired by the Deux Ex series; its direct inspiration will be the 2011 game  Human Revolution .  ": null
    },
    {
        "C. Robert Cargill": "C. Robert Cargill"
    },
    {
        " and ": null
    },
    {
        "Scott Derrickson": "Scott Derrickson"
    },
    {
        " are writing the screenplay, and Derrickson will direct the film. Bibbiani, William .   CraveOnline.com. Retrieved 2013-11-09. Dyce, Andrew .   ScreenRant.com. Retrieved 2013-11-09.     A sequel to the game titled  Deus Ex: Invisible War , was released in the United States on December 2, 2003, and then in Europe in early 2004 for both the PC and the Xbox game console. A second sequel, titled Deus Ex: Clan Wars, was initially conceived as a multiplayer-focused third game for the series. After the commercial performance and public reception of Deus Ex: Invisible War failed to meet expectations, the decision was made to set the game in a separate universe, and Deus Ex: Clan Wars was eventually published under the title  Project: Snowblind .      On March 29, 2007, ": null
    },
    {
        "Valve Corporation": "Valve Corporation"
    },
    {
        " announced Deus Ex and its sequel would be available for purchase from their ": null
    },
    {
        "Steam": "Steam"
    },
    {
        " service. Among the games announced are several other Eidos franchise titles, including  Thief: Deadly Shadows  and  Tomb Raider .      ": null
    },
    {
        "Eidos Montréal": "Eidos Montréal"
    },
    {
        " produced a prequel to Deus Ex called  Deus Ex: Human Revolution . This was confirmed on November 26, 2007, when Eidos Montréal posted a teaser trailer for the title on their website.  The game was released on August 23, 2011, for the PC, PlayStation 3, and Xbox 360 platforms and received critical acclaim.     On April 7, 2015, Eidos announced a sequel to Deus Ex: Human Revolution and second prequel to Deus Ex titled  Deus Ex: Mankind Divided ": null
    }
]