[
    {
        "      Dice  are small, throwable objects with uniquely marked sides that can rest in multiple positions. They are used for generating ": null
    },
    {
        "random numbers": "Statistical Randomness"
    },
    {
        " and are commonly used in ": null
    },
    {
        "tabletop games": "Tabletop Game"
    },
    {
        ". Such games include ": null
    },
    {
        "dice games": "List Of Dice Games"
    },
    {
        ", ": null
    },
    {
        "board games": "Board Game"
    },
    {
        ", ": null
    },
    {
        "role-playing games": "Role-Playing Game"
    },
    {
        ", and ": null
    },
    {
        "games of chance": "Games Of Chance"
    },
    {
        " .        A traditional die is a ": null
    },
    {
        "cube": "Cube"
    },
    {
        " with each of its six faces marked with a different number of dots  from one to six. When thrown or rolled, the die comes to rest showing on its upper surface a random ": null
    },
    {
        "integer": "Integer"
    },
    {
        " from one to six, each value being equally likely. Dice may also have ": null
    },
    {
        "polyhedral": "Polyhedron"
    },
    {
        " or irregular shapes and may have faces marked with numerals or symbols instead of pips. Loaded dice are designed to favor some results over others for ": null
    },
    {
        "cheating": "Cheating"
    },
    {
        " or entertainment.                     Dice have been used since before recorded history, and it is uncertain where they originated. It is theorized that dice developed from the practice of fortune-telling with the ": null
    },
    {
        "talus": "Talus Bone"
    },
    {
        " of hoofed animals, colloquially known as knucklebones .  The ": null
    },
    {
        "Egyptian": "Ancient Egypt"
    },
    {
        " game of ": null
    },
    {
        "senet": "Senet"
    },
    {
        " was played with flat two-sided throwsticks which indicated the number of squares a player could move, and thus functioned as a form of dice. Senet was played before 3000  BC and up to the 2nd century AD.  Perhaps the oldest known dice were excavated as part of a ": null
    },
    {
        "backgammon": "Backgammon"
    },
    {
        "-like game set at the ": null
    },
    {
        "Burnt City": "Burnt City"
    },
    {
        ", an archeological site in south-eastern ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ", estimated to be from between 2800–2500  BC.  Excavations from ancient tombs in the ": null
    },
    {
        "Indus Valley civilization": "Indus Valley Civilization"
    },
    {
        " indicate a possible ": null
    },
    {
        "South Asia": "South Asia"
    },
    {
        "n origin. Possehl, Gregory. Meluhha . In: J. Reade The Indian Ocean in Antiquity. London: Kegan Paul Intl. 1996a, 133–208     Games involving dice are mentioned in the ": null
    },
    {
        "ancient Indian": "Outline Of Ancient India"
    },
    {
        "  Rigveda ,  Atharvaveda , and ": null
    },
    {
        "Buddhist games list": "List Of Games That Buddha Would Not Play"
    },
    {
        ". 2.3, 4.38, 6.118, 7.52, 7.109 There are several ": null
    },
    {
        "biblical": "Bible"
    },
    {
        " references to casting lots , as in ": null
    },
    {
        "Psalm": "Psalms"
    },
    {
        " 22, indicating that dicing was commonplace when the psalm was composed. ": null
    },
    {
        "Knucklebones": "Knucklebones"
    },
    {
        " was a ": null
    },
    {
        "game of skill": "Game Of Skill"
    },
    {
        " played in ": null
    },
    {
        "ancient Greece": "Ancient Greece"
    },
    {
        "; a derivative form had the four sides of bones receive different values like modern dice.         Although gambling was illegal, many ": null
    },
    {
        "Romans": "Culture Of Ancient Rome"
    },
    {
        " were passionate gamblers who enjoyed dicing, which was known as aleam ludere . There were two sizes of Roman dice. Tali were large dice inscribed with one, three, four, and six on four sides. Tesserae were smaller dice with sides numbered from one to six.  Twenty-sided dice date back to the 2nd  century AD  and from Ptolemaic Egypt as early as the 2nd century  BC.      ": null
    },
    {
        "Dominoes": "Dominoes"
    },
    {
        " and ": null
    },
    {
        "playing cards": "Playing Card"
    },
    {
        " originated in China as developments from dice. The transition from dice to playing cards occurred in China around the ": null
    },
    {
        "Tang dynasty": "Tang Dynasty"
    },
    {
        ", and coincides with the technological transition from rolls of manuscripts to ": null
    },
    {
        "block printed": "Woodblock Printing"
    },
    {
        " books.  In Japan, dice were used to play a popular game called ": null
    },
    {
        "sugoroku": "Sugoroku"
    },
    {
        ". There are two types of sugoroku. Ban-sugoroku is similar to ": null
    },
    {
        "backgammon": "Backgammon"
    },
    {
        " and dates to the ": null
    },
    {
        "Heian period": "Heian Period"
    },
    {
        ", while e-sugoroku is a racing game.        Dice are thrown onto a surface either from the hand or from a container designed for this . The face of the die that is uppermost when it comes to rest provides the value of the throw.     The result of a die roll is determined by the way it is thrown, according to the laws of ": null
    },
    {
        "classical mechanics": "Classical Mechanics"
    },
    {
        ". A die roll is made ": null
    },
    {
        "random": "Randomness"
    },
    {
        " by uncertainty in minor factors such as tiny movements in the throwers hand; they are thus a crude form of ": null
    },
    {
        "hardware random number generator": "Hardware Random Number Generator"
    },
    {
        ".     One typical contemporary ": null
    },
    {
        "dice game": "List Of Dice Games"
    },
    {
        " is ": null
    },
    {
        "craps": "Craps"
    },
    {
        ", where two dice are thrown simultaneously and wagers are made on the total value of the two dice. Dice are frequently used to introduce randomness into ": null
    },
    {
        "board games": "Board Game"
    },
    {
        ", where they are often used to decide the distance through which a piece will move along the board .            Common dice are small ": null
    },
    {
        "cubes": "Cube"
    },
    {
        ", most often  across,  whose faces are numbered from one to six, usually by patterns of round dots called pips.      Opposite sides of a modern die traditionally add up to seven, requiring the 1, 2, and 3 faces to share a vertex. Cf.  Book 14, §8: The Opposite Pairs of Numbers on a Die. The numbers on a die run so: six one, five two, three four. The faces of a die may be placed ": null
    },
    {
        "clockwise or counterclockwise": "Clockwise And Counterclockwise"
    },
    {
        " about this vertex. If the 1, 2, and 3 faces run counterclockwise, the die is called right-handed . If those faces run clockwise, the die is called left-handed . Western dice are normally right-handed, and Chinese dice are normally left-handed.           The pips on dice are arranged in specific patterns as shown. Asian style dice bear similar patterns to Western ones, but the pips are closer to the center of the face; in addition, the pips are differently sized on Asian style dice, and the pips are colored red on the 1 and 4 sides. Red fours may be of Indian origin.  In some older sets, the one pip is a colorless depression.          Non-precision dice are manufactured via the plastic ": null
    },
    {
        "injection molding": "Injection Molding"
    },
    {
        " process. The pips or numbers on the die are a part of the mold. Different pigments can be added to the dice to make them opaque or transparent, or multiple pigments may be added to make the dice speckled or marbled.      The coloring for numbering is achieved by submerging the die entirely in paint, which is allowed to dry. The die is then polished via a ": null
    },
    {
        "tumble finishing": "Tumble Finishing"
    },
    {
        " process similar to ": null
    },
    {
        "rock polishing": "Rock Polishing"
    },
    {
        ". The ": null
    },
    {
        "abrasive agent": "Abrasion"
    },
    {
        " scrapes off all of the paint except for the indents of the numbering. A finer abrasive is then used to polish the die. This process also creates the smoother, rounded edges on the dice.  from Awesome Dice     Precision casino dice may have a polished or sand finish, making them transparent or translucent respectively. Casino dice have their pips drilled, then filled flush with a paint of the same ": null
    },
    {
        "density": "Density"
    },
    {
        " as the material used for the dice, such that the center of gravity of the dice is as close to the geometric center as possible. This mitigates concerns that the pips will cause a small bias.  All such dice are stamped with a ": null
    },
    {
        "serial number": "Serial Number"
    },
    {
        " to prevent potential cheaters from substituting a die. Precision backgammon dice are made the same way; they tend to be slightly smaller and have rounded corners and edges, to allow better movement inside the dice cup and stop forceful rolls from damaging the playing surface.       ;The word dice comes from ": null
    },
    {
        "Old French": "Old French"
    },
    {
        " déh; from ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " datum something which is given or played      While the terms  ace , deuce, trey, cater, cinque and sice are generally obsolete, with the names of the numbers preferred, they are still used by some professional gamblers to designate different sides of the dice. Ace is from the Latin as, meaning a unit ;  the others are 2 to 6 in ": null
    },
    {
        "Old French": "Old French"
    },
    {
        ".    The term ": null
    },
    {
        "snake eyes": "Snake Eyes"
    },
    {
        " is the outcome of rolling the dice and getting only one ": null
    },
    {
        "pip": "Pip"
    },
    {
        " on each die. The dictionary of ": null
    },
    {
        "etymology": "Etymology"
    },
    {
        " traces use of the term as far back as 1919.    The term ": null
    },
    {
        "boxcars": "Boxcars"
    },
    {
        " , also known as midnight , is the outcome of rolling the dice and getting a six on each die. The pair of six pips resembles a pair of boxcars on a freight train.       Using Unicode characters, the faces ⚀ ⚁ ⚂ ⚃ ⚄ ⚅ , can be shown in text using the range U+2680 to U+2685 or using decimal & amp;9856; to & amp;9861; .        A loaded, weighted, or crooked die is one that has been tampered with so that it will land with a specific side facing upwards more or less often than a fair die would. There are several methods for creating loaded dice, including rounded faces, off-square faces, and weights. Casinos and gambling halls frequently use transparent ": null
    },
    {
        "cellulose acetate": "Cellulose Acetate"
    },
    {
        " dice as tampering is easier to detect than with opaque dice.               Around the end of the 1960s, non-cubical dice became popular among players of ": null
    },
    {
        "wargames": "Wargaming"
    },
    {
        ",  and since have been employed extensively in ": null
    },
    {
        "role-playing games": "Role-Playing Game"
    },
    {
        " and ": null
    },
    {
        "trading card games": "Collectible Card Game"
    },
    {
        ". The numerals 6 and 9, which are reciprocally symmetric through rotation, are distinguished with a dot or underline.          Dice are often sold in sets, matching in color, of six different shapes. Five of the dice are shaped like the ": null
    },
    {
        "Platonic solids": "Platonic Solid"
    },
    {
        ", whose faces are ": null
    },
    {
        "regular polygons": "Regular Polygon"
    },
    {
        ". Aside from the cube, the other four Platonic solids have 4, 8, 12, and 20 faces, allowing for those number ranges to be generated. The only other common non-cubical die is the 10-sided die, a pentagonal ": null
    },
    {
        "trapezohedron": "Trapezohedron"
    },
    {
        " die, whose faces are ten ": null
    },
    {
        "kites": "Kite"
    },
    {
        ", each with two different edge lengths, three different angles, and two different kinds of vertices. Such sets frequently include a second 10-sided die either of contrasting color or numbered by tens, allowing the pair of 10-sided dice to be combined to generate numbers between 1 and 100.     Using these dice in various ways, games can closely approximate a variety of probability distributions. For instance, 10-sided dice can be rolled in pairs to produce a ": null
    },
    {
        "uniform distribution": "Discrete Uniform Distribution"
    },
    {
        " of random percentages, and summing the values of multiple dice will produce approximations to ": null
    },
    {
        "normal distributions": "Normal Distribution"
    },
    {
        ".      Unlike other common dice, a ": null
    },
    {
        "four-sided die": "Four-Sided Die"
    },
    {
        " does not have a side that faces upward when it is at rest on a surface, so it must be read in a different way. On some four-sided dice, each face features multiple numbers, with same number printed near each vertex on all sides. In this case, the number around the vertex pointing up is used. Alternatively, the numbers on a tetrahedral die can be placed at the middles of the edges, in which case the numbers around the base are used.     Normally, the faces on a die will be placed so opposite faces will add up to one more than the number of faces. Some dice, such as those with 10 sides, are usually numbered sequentially beginning with 0, in which case the opposite faces will add to one less than the number of faces.            Uniform fair dice are dice where all faces have equal probability of outcome due to the symmetry of the die as it is ": null
    },
    {
        "face-transitive": "Isohedral Figure"
    },
    {
        ". Theoretically, these include:     ": null
    },
    {
        "Platonic solids": "Platonic Solid"
    },
    {
        ", the five regular polyhedra: 4, 6, 8, 12, 20 sides   ": null
    },
    {
        "Catalan solids": "Catalan Solid"
    },
    {
        ", the ": null
    },
    {
        "duals": "Dual Polyhedron"
    },
    {
        " of the 13 ": null
    },
    {
        "Archimedean solids": "Archimedean Solid"
    },
    {
        ": 12, 24, 30, 48, 60, 120 sides   ": null
    },
    {
        "Bipyramids": "Bipyramid"
    },
    {
        ", the duals of the infinite set of ": null
    },
    {
        "prisms": "Prism"
    },
    {
        ", with triangle faces: any multiple of 4 above 8   ": null
    },
    {
        "Trapezohedra": "Trapezohedron"
    },
    {
        ", the duals of the infinite set of ": null
    },
    {
        "antiprisms": "Antiprism"
    },
    {
        ", with kite faces: any even number not divisible by 4 above 6   ": null
    },
    {
        "Disphenoids": "Disphenoid"
    },
    {
        ", an infinite set of tetrahedra made from congruent non-regular triangles: 4 sides. This is a less symmetric tetrahedron than the Platonic tetrahedron, but still sufficiently symmetrical to be face-transitive. Similarly, ": null
    },
    {
        "pyritohedra": "Pyritohedron"
    },
    {
        " and ": null
    },
    {
        "tetartoids": "Tetartoid"
    },
    {
        " are less symmetrical but still face-transitive dodecahedra: 12 sides.     ": null
    },
    {
        "Long dice": "Long Dice"
    },
    {
        " and ": null
    },
    {
        "teetotums": "Teetotum"
    },
    {
        " can in principle be made with any number of faces, including odd numbers.  Long dice are based on the infinite set of ": null
    },
    {
        "prisms": "Prism"
    },
    {
        ". All the rectangular faces are mutually face-transitive, so they are equally probable. The two ends of the prism may be rounded or capped with a pyramid, designed so that the die cannot rest on those faces. 4-sided long dice are easier to roll than tetrahedra, and are used in the traditional board games ": null
    },
    {
        "dayakattai": "Dayakattai"
    },
    {
        " and ": null
    },
    {
        "daldøs": "Daldøs"
    },
    {
        ".               The faces of most dice are labelled using sequences of whole numbers, usually starting at one, expressed with either pips or digits. However, there are some applications that require results other than numbers. Examples include letters for ": null
    },
    {
        "Boggle": "Boggle"
    },
    {
        ", directions for  Warhammer Fantasy Battle , ": null
    },
    {
        "Fudge dice": "Fudge Fudge Dice"
    },
    {
        ", playing card symbols for ": null
    },
    {
        "poker dice": "Poker Dice"
    },
    {
        ", and instructions for sexual acts using ": null
    },
    {
        "sex dice": "Sex Dice"
    },
    {
        ".       Dice may have numbers that do not form a counting sequence starting at one. One variation on the standard die is known as the average die.   These are six-sided dice with sides numbered 2, 3, 3, 4, 4, 5 , which have the same ": null
    },
    {
        "arithmetic mean": "Arithmetic Mean"
    },
    {
        " as a standard die , but have a narrower range of possible values . They are used in some table-top ": null
    },
    {
        "wargames": "Wargaming"
    },
    {
        ", where a narrower range of numbers is required. Other numbered variations include ": null
    },
    {
        "Sicherman dice": "Sicherman Dice"
    },
    {
        " and ": null
    },
    {
        "nontransitive dice": "Nontransitive Dice"
    },
    {
        ".          A die can be constructed in the shape of a sphere, with the addition of an internal cavity in the shape of the ": null
    },
    {
        "dual polyhedron": "Dual Polyhedron"
    },
    {
        " of the desired die shape and an internal weight. The weight will settle in one of the points of the internal cavity, causing it to settle with one of the numbers uppermost. For instance, a sphere with an octahedral cavity and a small internal weight will settle with one of the 6 points of the cavity held downwards by the weight.          Polyhedral dice are commonly used in role-playing games. The fantasy role-playing game  Dungeons & Dragons  is largely credited with popularizing dice in such games. Some games use only one type, like  Exalted  which uses only ten-sided dice. Others use numerous types for different game purposes, such as D & D, which makes use of all common polyhedral dice. Dice are usually used to determine the outcome of events. Games typically determine results either as a total on one or more dice above or below a fixed number, or a certain number of rolls above a certain number on one or more dice. Due to circumstances or character skill, the initial roll may have a number added to or subtracted from the final result, or have the player roll extra or fewer dice. To keep track of rolls easily, ": null
    },
    {
        "dice notation": "Dice Notation"
    },
    {
        " is frequently used.     Many board games use dice to randomize how far pieces move or to settle conflicts. Typically, this has meant that rolling higher numbers is better. Some games, such as  Axis & Allies , have inverted this system by making the lower values more potent. In the modern age, a few games and game designers have approached dice in a different way by making each side of the die similarly valuable. In  Castles of Burgundy , players spend their dice to take actions based on the dies value. In this game, a six is not better than a one, or vice versa. In  Quarriors  , different sides of the dice can offer completely different abilities. Several sides often give resources while others grant the player useful actions.      Dice can be used for ": null
    },
    {
        "divination": "Divination"
    },
    {
        " and using dice for such a purpose is called ": null
    },
    {
        "cleromancy": "Cleromancy"
    },
    {
        ". A pair of common dice is usual, though other forms of polyhedra can be used. Tibetan Buddhists sometimes use this ": null
    },
    {
        "method of divination": "Mo"
    },
    {
        ". It is highly likely that the ": null
    },
    {
        "Pythagoreans": "Pythagoreans"
    },
    {
        " used the ": null
    },
    {
        "Platonic solids": "Platonic Solids"
    },
    {
        " as dice. They referred to such dice as the dice of the gods and they sought to understand the universe through an understanding of geometry in polyhedra.      Astrological dice are a specialized set of three 12-sided dice for divination; the first die represents planets, the Sun, the Moon, and the ": null
    },
    {
        "nodes": "Orbital Node"
    },
    {
        " of the Moon, the second die represents the 12 zodiac signs, and the third represents the 12 houses. A specialized icosahedron die provides the answers of the ": null
    },
    {
        "Magic 8-Ball": "Magic 8-Ball"
    },
    {
        ", conventionally used to provide answers to yes-or-no questions.     Dice can be used to generate random numbers for use in ": null
    },
    {
        "passwords": "Password"
    },
    {
        " and ": null
    },
    {
        "cryptography": "Cryptography"
    },
    {
        " applications. The ": null
    },
    {
        "Electronic Frontier Foundation": "Electronic Frontier Foundation"
    },
    {
        " describes a method by which dice can be used to generate ": null
    },
    {
        "passphrases": "Passphrase"
    },
    {
        ".  ": null
    },
    {
        "Diceware": "Diceware"
    },
    {
        " is a method recommended for generating secure but memorable passphrases, by repeatedly rolling five dice and picking the corresponding word from a pre-generated list.        ": null
    }
]