[
    {
        "     In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", a diffeomorphism is an ": null
    },
    {
        "isomorphism": "Isomorphism"
    },
    {
        " of ": null
    },
    {
        "smooth manifolds": "Smooth Manifold"
    },
    {
        ". It is an ": null
    },
    {
        "invertible function": "Invertible Function"
    },
    {
        " that ": null
    },
    {
        "maps": "Map"
    },
    {
        " one ": null
    },
    {
        "differentiable manifold": "Differentiable Manifold"
    },
    {
        " to another such that both the function and its inverse are ": null
    },
    {
        "smooth": "Smooth Function"
    },
    {
        ".              Given two ": null
    },
    {
        "manifolds": "Manifolds"
    },
    {
        " M and N, a ": null
    },
    {
        "differentiable": "Differentiable Manifolddifferentiable Functions"
    },
    {
        " map f  : M  → N is called a diffeomorphism if it is a ": null
    },
    {
        "bijection": "Bijection"
    },
    {
        " and its inverse f −1  : N  → M is differentiable as well. If these functions are r times continuously differentiable, f is called a C r -diffeomorphism.     Two manifolds M and N are diffeomorphic if there is a diffeomorphism f from M to N. They are C r diffeomorphic if there is an r times continuously differentiable bijective map between them whose inverse is also r times continuously differentiable.         Given a subset X of a manifold M and a subset Y of a manifold N, a function f  : X  → Y is said to be smooth if for all p in X there is a neighborhood U  ⊂ M of p and a smooth function g  : U  → N such that the restrictions agree g f . f is said to be a diffeomorphism if it is bijective, smooth and its inverse is smooth.            ; Model example   If U, V are connected open subsets of R n such that V is ": null
    },
    {
        "simply connected": "Simply Connected"
    },
    {
        ", a ": null
    },
    {
        "differentiable": "Derivative"
    },
    {
        " map f  : U  → V is a diffeomorphism if it is ": null
    },
    {
        "proper": "Proper Map"
    },
    {
        " and if the ": null
    },
    {
        "differential": "Pushforward"
    },
    {
        " Df x   : R n  → R n is ": null
    },
    {
        "bijective": "Bijection"
    },
    {
        " at each point x in U.       ; First remark   It is essential for V to be ": null
    },
    {
        "simply connected": "Simply Connected"
    },
    {
        " for the function f to be globally invertible . For example, consider the realification of the complex square function   :     f :                           Then f is surjective and it satisfies   :   Dfx4    Thus, though Df x  is bijective at each point, f is not invertible because it fails to be injective ": null
    }
]