[
    {
        "     A difference engine, first created by ": null
    },
    {
        "Charles Babbage": "Charles Babbage"
    },
    {
        ", is an automatic ": null
    },
    {
        "mechanical calculator": "Mechanical Calculator"
    },
    {
        " designed to tabulate ": null
    },
    {
        "polynomial functions": "Polynomial"
    },
    {
        ". Its name is derived from the method of ": null
    },
    {
        "divided differences": "Divided Differences"
    },
    {
        ", a way to interpolate or tabulate functions by using a small set of ": null
    },
    {
        "polynomial": "Polynomial"
    },
    {
        " coefficients. Most ": null
    },
    {
        "mathematical functions": "Mathematical Function"
    },
    {
        " commonly used by engineers, scientists and navigators, including ": null
    },
    {
        "logarithm": "Logarithm"
    },
    {
        "ic and ": null
    },
    {
        "trigonometric functions": "Trigonometric Functions"
    },
    {
        ", can be ": null
    },
    {
        "approximated": "Taylor Series"
    },
    {
        " by polynomials, so a difference engine can compute many useful ": null
    },
    {
        "tables of numbers": "Mathematical Table"
    },
    {
        ".     The historical difficulty in producing error-free tables by teams of mathematicians and ": null
    },
    {
        "human computers ": "Human Computer"
    },
    {
        " spurred ": null
    },
    {
        "Charles Babbages": "Charles Babbage"
    },
    {
        " desire to build a mechanism to automate the process.                The notion of a ": null
    },
    {
        "mechanical calculator": "Mechanical Calculator"
    },
    {
        " for mathematical functions can be traced back to the ": null
    },
    {
        "Antikythera mechanism": "Antikythera Mechanism"
    },
    {
        " of the 2nd century BC, while early modern examples are attributed to ": null
    },
    {
        "Pascal": "Blaise Pascal"
    },
    {
        " and ": null
    },
    {
        "Leibniz": "Gottfried Leibniz"
    },
    {
        " in the 17th century.   In 1784 ": null
    },
    {
        "J. H. Müller": "J. H. Müller"
    },
    {
        ", an engineer in the ": null
    },
    {
        "Hessian": "Hessian"
    },
    {
        " army, devised and built an ": null
    },
    {
        "adding machine": "Adding Machine"
    },
    {
        " and described the basic principles of a difference machine in a book published in 1786 , but he was unable to obtain funding to progress with the idea. Johann Helfrich von Müller, Beschreibung seiner neu erfundenen Rechenmachine, nach ihrer Gestalt, ihrem Gebrauch und Nutzen ; pages 48–50. The following Web site contains detailed photos of Müllers calculator as well as a transcription of Müllers booklet, Beschreibung …   . An animated simulation of Müllers machine in operation is available on this Web site :    . Michael Lindgren , Glory and Failure: The Difference Engines of Johann Müller, Charles Babbage, and Georg and Edvard Scheutz , .        ": null
    },
    {
        "Charles Babbage": "Charles Babbage"
    },
    {
        " began to construct a small difference engine in c. 1819  and had completed it by 1822 .  He announced his invention on 14 June 1822, in a paper to the ": null
    },
    {
        "Royal Astronomical Society": "Royal Astronomical Society"
    },
    {
        ", entitled Note on the application of machinery to the computation of astronomical and mathematical tables .  This machine used the decimal number system and was powered by cranking a handle. The ": null
    },
    {
        "British government": "British Government"
    },
    {
        " was interested, since producing tables was time-consuming and expensive and they hoped the difference engine would make the task more economical.      In 1823, the British government gave Babbage £1700 to start work on the project. Although Babbages design was feasible, the metalworking techniques of the era could not economically make parts in the precision and quantity required. Thus the implementation proved to be much more expensive and doubtful of success than the governments initial estimate. In 1832, Babbage and ": null
    },
    {
        "Joseph Clement": "Joseph Clement"
    },
    {
        " produced a small working model which operated on 6-digit numbers and second-order differences.   ": null
    },
    {
        "Lady Byron": "Lady Byron"
    },
    {
        " described seeing the working prototype in 1833: We both went to see the thinking machine last Monday. It raised several Nos. to the 2nd and 3rd powers, and extracted the root of a Quadratic equation.  Work on the larger engine was suspended in 1833.     By the time the government abandoned the project in 1842,  Babbage had received and spent over £17,000 on development, which still fell short of achieving a working engine. The government valued only the machines output , not the development of the machine itself. Babbage did not, or was unwilling to, recognize that predicament. Meanwhile, Babbages attention had moved on to developing an ": null
    },
    {
        "analytical engine": "Analytical Engine"
    },
    {
        ", further undermining the governments confidence in the eventual success of the difference engine. By improving the concept as an analytical engine, Babbage had made the difference engine concept obsolete, and the project to implement it an utter failure in the view of the government.     The incomplete Difference Engine No. 1 was put on display to the public at the ": null
    },
    {
        "1862 International Exhibition": "1862 International Exhibition"
    },
    {
        " in ": null
    },
    {
        "South Kensington": "South Kensington"
    },
    {
        ", London.       Babbage went on to design his much more general ": null
    },
    {
        "analytical engine": "Analytical Engine"
    },
    {
        ", but later produced an improved Difference Engine No. 2 design , between 1846 and 1849. Babbage was able to take advantage of ideas developed for the analytical engine to make the new difference engine calculate more quickly while using fewer parts.         Inspired by Babbages difference engine in 1834, ": null
    },
    {
        "Per Georg Scheutz": "Per Georg Scheutz"
    },
    {
        " built several experimental models. In 1837 his son Edward proposed to construct a working model in metal, and in 1840 finished the calculating part, capable of calculating series with 5-digit numbers and first-order differences, which was later extended to third-order . In 1843, after adding the printing part, the model was completed.     In 1851, funded by the government, construction of the larger and improved machine began, and finished in 1853. The machine was demonstrated at the ": null
    },
    {
        "Worlds Fair in Paris, 1855": "Exposition Universelle"
    },
    {
        " and then sold in 1856 to the ": null
    },
    {
        "Dudley Observatory": "Dudley Observatory"
    },
    {
        " in ": null
    },
    {
        "Albany, New York": "Albany, New York"
    },
    {
        ". Delivered in 1857, it was the first printing calculator sold.   . In 1857 the British government ordered the next ": null
    },
    {
        "Scheutzs": "Per Georg Scheutz"
    },
    {
        " difference machine, which was built in 1859.   It had the same basic construction as the previous one, weighing about .        ": null
    },
    {
        "Martin Wiberg": "Martin Wiberg"
    },
    {
        " improved Scheutzs construction but used his device only for producing and publishing printed tables . Raymond Clare Archibald: Martin Wiberg, his Table and Difference Engine, Mathematical Tables and Other Aids to Computation, 1947 371–374.  .     Alfred Deacon of London in c. 1862 produced a small difference engine .      American ": null
    },
    {
        "George B. Grant": "George B. Grant"
    },
    {
        " started working on his calculating machine in 1869, unaware of the works of Babbage and Scheutz . One year later he learned about difference engines and proceed to design one himself, describing his construction in 1871. In 1874 the Boston Thursday Club raised a subscription for the construction of a large-scale model, which was built in 1876. It could be expanded to enhance precision and weighed about .       ": null
    },
    {
        "Christel Hamann": "Christel Hamann"
    },
    {
        " built one machine in 1909 for the Tables of ": null
    },
    {
        "Bauschinger": "Julius Bauschinger"
    },
    {
        " and Peters , which was first published in Leipzig in 1910. It weighed about .        ": null
    },
    {
        "Burroughs Corporation": "Burroughs Corporation"
    },
    {
        " in about 1912 built a machine for the ": null
    },
    {
        "Nautical Almanac Office": "Hm Nautical Almanac Office"
    },
    {
        " which was used as a difference engine of second-order.    It was later replaced in 1929 by a Burroughs Class 11 .      ": null
    },
    {
        "Alexander John Thompson": "Alexander John Thompson"
    },
    {
        " about 1927 built integrating and differencing machine for his table of logarithms Logarithmetica britannica . This machine was composed of four modified Triumphator calculators.        ": null
    },
    {
        "Leslie Comrie": "Leslie Comrie"
    },
    {
        " in 1928 described how to use the ": null
    },
    {
        "Brunsviga": "Odhner Arithmometer"
    },
    {
        "-Dupla calculating machine as a difference engine of second-order . He also noted in 1931 that National Accounting Machine Class 3000 could be used as a difference engine of sixth-order.        During the 1980s, ": null
    },
    {
        "Allan G. Bromley": "Allan G. Bromley"
    },
    {
        ", an associate professor at the ": null
    },
    {
        "University of Sydney": "University Of Sydney"
    },
    {
        ", ": null
    },
    {
        "Australia": "Australia"
    },
    {
        ", studied Babbages original drawings for the Difference and Analytical Engines at the ": null
    },
    {
        "Science Museum": "Science Museum"
    },
    {
        " library in London. . This work led the Science Museum to construct a working calculating section of difference engine No. 2 from 1985 to 1991, under ": null
    },
    {
        "Doron Swade": "Doron Swade"
    },
    {
        ", the then Curator of Computing. This was to celebrate the 200th anniversary of Babbages birth in 1999. In 2002, the ": null
    },
    {
        "printer": "Printer"
    },
    {
        " which Babbage originally designed for the difference engine was also completed.  The conversion of the original design drawings into drawings suitable for engineering manufacturers use revealed some minor errors in Babbages design ,  Accessed May 17, 2012 which had to be corrected. Once completed, both the engine and its printer worked flawlessly, and still do. The difference engine and printer were constructed to tolerances achievable with 19th-century technology, resolving a long-standing debate as to whether Babbages design would actually have worked.     The printers primary purpose is to produce ": null
    },
    {
        "stereotype": "Stereotype"
    },
    {
        " plates for use in printing presses, which it does by pressing type into soft plaster to create a ": null
    },
    {
        "flong": "Flong"
    },
    {
        ". Babbage intended that the Engines results be conveyed directly to mass printing, having recognized that many errors in previous tables were not the result of human calculating mistakes but from error in the manual ": null
    },
    {
        "typesetting": "Typesetting"
    },
    {
        " process. The printers paper output is mainly a means of checking the Engines performance.     In addition to funding the construction of the output mechanism for the Science Museums Difference Engine, ": null
    },
    {
        "Nathan Myhrvold": "Nathan Myhrvold"
    },
    {
        " commissioned the construction of a second complete Difference Engine No. 2, which was on exhibit at the ": null
    },
    {
        "Computer History Museum": "Computer History Museum"
    },
    {
        " in ": null
    },
    {
        "Mountain View, California": "Mountain View, California"
    },
    {
        " from 10 May 2008 until 31 January 2016.   Press Releases  Computer History     , Mark Moack, Mountain View Voice, January 29, 2016   It has since been transferred to ": null
    },
    {
        "Intellectual Ventures": "Intellectual Ventures"
    },
    {
        " in ": null
    },
    {
        "Seattle": "Seattle"
    },
    {
        " where it is on display just outside the main lobby.               The difference engine consists of a number of columns, numbered from 1 to N. The machine is able to store one decimal number in each column. The machine can only add the value of a column n  +  1 to column n to produce the new value of n. Column N can only store a ": null
    },
    {
        "constant": "Wiktionary:Constant"
    },
    {
        ", column 1 displays  the value of the calculation on the current ": null
    },
    {
        "iteration": "Iteration"
    },
    {
        ".     The engine is programmed by setting initial values to the columns. Column 1 is set to the value of the polynomial at the start of computation. Column 2 is set to a value derived from the first and higher ": null
    },
    {
        "derivatives": "Derivative"
    },
    {
        " of the polynomial at the same value of X. Each of the columns from 3 to N is set to a value derived from the first and higher derivatives of the polynomial.       In the Babbage design, one iteration  happens for each rotation of the main shaft. Odd and even columns alternately perform an addition in one cycle. The sequence of operations for column n is thus:     Count up, receiving the value from column n+1   Perform ": null
    },
    {
        "carry propagation": "Carry Propagation"
    },
    {
        " on the counted up value   Count down to zero, adding to column n-1   Reset the counted-down value to its original value     Steps 1,2,3,4 occur for every odd column, while steps 3,4,1,2 occur for every even column.     While Babbages original design placed the crank directly on the main shaft, it was later realized that the force required to crank the machine would have been too great for a human to handle comfortably. Therefore, the two models that were built incorporate a 4:1 reduction gear at the crank, and four revolutions of the crank are required to perform one full cycle.       Each iteration creates a new result, and is accomplished in four steps corresponding to four complete turns of the handle shown at the far right in the picture below. The four steps are:     Step 1. All even numbered columns are added to all odd numbered columns simultaneously. An interior sweep arm turns each even column to cause whatever number is on each wheel to count down to zero. As a wheel turns to zero, it transfers its value to a sector gear located between the odd/even columns. These values are transferred to the odd column causing them to count up. Any odd column value that passes from 9 to 0 activates a ": null
    },
    {
        "carry": "Carry"
    },
    {
        " lever.   Step 2. ": null
    },
    {
        "Carry propagation": "Carry Propagation"
    },
    {
        " is accomplished by a set of spiral arms in the back that poll the carry levers in a helical manner so that a carry at any level can increment the wheel above by one. That can create a carry, which is why the arms move in a spiral. At the same time, the sector gears are returned to their original position, which causes them to increment the even column wheels back to their original values. The sector gears are double-high on one side so they can be lifted to disengage from the odd column wheels while they still remain in contact with the even column wheels.   Step 3. This is like Step 1, except it is odd columns added to even columns , and column one has its values transferred by a sector gear to the print mechanism on the left end of the engine. Any even column value that passes from 9 to 0 activates a carry lever. The column 1 value, the result for the polynomial, is sent to the attached printer mechanism.   Step 4. This is like Step 2, but for doing carries on even columns, and returning odd columns to their original values.       The engine represents negative numbers as ": null
    },
    {
        "tens complements": "Method Of Complements"
    },
    {
        ". Subtraction amounts to addition of a negative number. This works in the same manner that modern computers perform subtraction, known as ": null
    },
    {
        "twos complement": "Twos Complement"
    },
    {
        ".          The principle of a difference engine is ": null
    },
    {
        "Newtons method": "Newton Polynomial"
    },
    {
        " of ": null
    },
    {
        "divided differences": "Divided Differences"
    },
    {
        ". If the initial value of a polynomial  is calculated by some means for some value of X, the difference engine can calculate any number of nearby values, using the method generally known as the method of finite differences. For example, consider the quadratic ": null
    },
    {
        "polynomial": "Polynomial"
    },
    {
        "     : p 2x2 - 3x + 2       with the goal of tabulating the values p, p, p, p, p, and so forth. The table below is constructed as follows: the second column contains the values of the polynomial, the third column contains the differences of the two left neighbors in the second column, and the fourth column contains the differences of the two neighbors in the third column:          The numbers in the third values-column are constant. In fact, by starting with any polynomial of degree n, the column number n  +  1 will always be constant. This is the crucial fact behind the success of the method.     This table was built from left to right, but it is possible to continue building it from right to left down a diagonal in order to compute more values. To calculate p use the values from the lowest diagonal. Start with the fourth column constant value of 4 and copy it down the column. Then continue the third column by adding 4 to 11 to get 15. Next continue the second column by taking its previous value, 22 and adding the 15 from the third column. Thus p is 22  +  15    37. In order to compute p, we iterate the same algorithm on the p values: take 4 from the fourth column, add that to the third columns value 15 to get 19, then add that to the second columns value 37 to get 56, which is p. This process may be continued ": null
    },
    {
        "ad infinitum": "Ad Infinitum"
    },
    {
        ". The values of the polynomial are produced without ever having to multiply. A difference engine only needs to be able to add. From one loop to the next, it needs to store 2 numbers—in this example . To tabulate polynomials of degree n, one needs sufficient storage to hold n numbers.     Babbages difference engine No. 2, finally built in 1991, could hold 8 numbers of 31 decimal digits each and could thus tabulate 7th degree polynomials to that precision. The best machines from Scheutz could store 4 numbers with 15 digits each.        The initial values of columns can be calculated by first manually calculating N consecutive values of the function and by ": null
    },
    {
        "backtracking": "Backtracking"
    },
    {
        ", i.e. calculating the required differences.     Col 10 gets the value of the function at the start of computation f . Col 20 is the difference between f and f ...      If the function to be calculated is a ": null
    },
    {
        "polynomial function": "Polynomial Function"
    },
    {
        ", expressed as   : f an xn + a x +   + a2 x2 + a1 x + a0     the initial values can be calculated directly from the constant coefficients a 0 , a 1 ,a 2 , ..., a n  without calculating any data points. The initial values are thus:     Col 10 a 0   Col 20 a 1 + a 2 + a 3 + a 4 + ... + a n  a 2 + 6a 3 + 14a 4 + 30a 5 + ...   Col 40 6a 3 + 36a 4 + 150a 5 + ...   Col 50 24a 4 + 240a 5 + ...   Col 60 120a 5 + ...   ...       Many commonly used functions are ": null
    },
    {
        "analytic functions": "Analytic Function"
    },
    {
        ", which can be expressed as ": null
    },
    {
        "power series": "Power Series"
    },
    {
        ", for example as a ": null
    },
    {
        "Taylor series": "Taylor Series"
    },
    {
        ". The initial values can be calculated to any degree of accuracy; if done correctly the engine will give exact results for first N steps. After that, the engine will only give an ": null
    },
    {
        "approximation": "Approximation"
    },
    {
        " of the function.     The Taylor series expresses the function as a sum obtained from its ": null
    },
    {
        "derivatives": "Derivative"
    },
    {
        " at one point. For many functions the higher derivatives are trivial to obtain; for instance, the ": null
    },
    {
        "sine": "Sine"
    },
    {
        " function at 0 has values of 0 or   for all derivatives. Setting 0 as the start of computation we get the simplified ": null
    },
    {
        "Maclaurin series": "Maclaurin Series"
    },
    {
        "   :       x       The same method of calculating the initial values from the coefficients can be used as for polynomial functions. The polynomial constant coefficients will now have the value   :   an             The problem with the methods described above is that errors will accumulate and the series will tend to diverge from the true function. A solution which guarantees a constant maximum error is to use ": null
    },
    {
        "curve fitting": "Curve Fitting"
    },
    {
        ". A minimum of N values are calculated evenly spaced along the range of the desired calculations. Using a curve fitting technique like ": null
    },
    {
        "Gaussian reduction": "Gaussian Reduction"
    },
    {
        " an N−1th degree ": null
    },
    {
        "polynomial interpolation": "Polynomial Interpolation"
    },
    {
        " of the function is found. With the optimized polynomial, the initial values can be calculated as above.       William Gibson and Bruce Sterlings  The Difference Engine  is an alternate history  novel that looks how society would have progressed had the difference engine worked the way Babbage envisioned it.     The story takes place in Victorian England where technological advancement is on the rise. This is due to the effect of the success of Babbages analytical machine. The convention of ": null
    },
    {
        "steampunk": "Steampunk"
    }
]