[
    {
        "Dionysius Thrax  was a ": null
    },
    {
        "Hellenistic": "Hellenization"
    },
    {
        " grammarian": "Philologist"
    },
    {
        " and a pupil of ": null
    },
    {
        "Aristarchus of Samothrace": "Aristarchus Of Samothrace"
    },
    {
        ". He was long considered to be the author of the earliest grammatical text on the Greek language, one that was used as a standard manual for perhaps some 1,500 years, and which was until recently regarded as the groundwork of the entire Western grammatical tradition.       His place of origin was not ": null
    },
    {
        "Thrace": "Thrace"
    },
    {
        " as the epithet Thrax denotes, but probably ": null
    },
    {
        "Alexandria": "Alexandria"
    },
    {
        ". His Thracian background was inferred from the name, considered to be Thracian, of his father Tērēs . One of his co-students during his studies in Alexandria under Aristarchus was ": null
    },
    {
        "Apollodorus of Athens": "Apollodorus Of Athens"
    },
    {
        ", who also became a distinguished grammarian. ": null
    },
    {
        "Rudolf Pfeiffer": "Rudolf Pfeiffer"
    },
    {
        " dates his shift to the isle of ": null
    },
    {
        "Rhodes": "Rhodes"
    },
    {
        " to around 144/3  BCE, when political upheavals associated with the policies of ": null
    },
    {
        "Ptolemy VIII Euergetes II": "Ptolemy Viii Physcon"
    },
    {
        " are thought to have led to his exile. According to a report in ": null
    },
    {
        "Athenaeus": "Athenaeus"
    },
    {
        " Deipnosophistae": "Deipnosophistae"
    },
    {
        " , his Rhodian pupils, grateful for his learning, gathered enough silver to enable him to fashion a cup whose shape aspired to recreate ": null
    },
    {
        "that": "Nestors Cup"
    },
    {
        " of ": null
    },
    {
        "Nestor": "Nestor"
    },
    {
        " mentioned in the ": null
    },
    {
        "Iliad": "Iliad"
    },
    {
        " .     Dionysius was primarily an ": null
    },
    {
        "Homeric scholar": "Homeric Scholarship"
    },
    {
        ", which was integral to his training under Aristarchus in Alexandria. His work shows some influence of earlier ": null
    },
    {
        "Stoic grammatical theory": "Stoic Logic"
    },
    {
        ", particular on word classes. He is also reported by ": null
    },
    {
        "Varro": "Varro"
    },
    {
        " to have been an erudite analyst of Greek lyric poetry, perhaps referring to his linguistic and ": null
    },
    {
        "prosodic": "Prosody"
    },
    {
        " use of that material. He wrote prolifically in three genres: philological questions ; running commentaries and treatises . Of the last genre, he wrote a polemical monograph criticizing the Homeric interpretations of ": null
    },
    {
        "Krates": "Crates Of Mallus"
    },
    {
        ". Another work he is said to have written was the Περὶ ποσοτήτων . From the ": null
    },
    {
        "scholia": "Scholia"
    },
    {
        " preserved from the critical works of ": null
    },
    {
        "Aristonicus": "Aristonicus Of Alexandria"
    },
    {
        " and ": null
    },
    {
        "Didymus": "Didymus Chalcenterus"
    },
    {
        " who excerpted Dionysius work it is clear that he was decidedly independent in his textual judgements on the Homeric corpus, since he frequently contradicts his masters known readings. His teaching may have exercised a formative impact on the rise of Roman grammatical studies, if as an entry in the ": null
    },
    {
        "Suda": "Suda"
    },
    {
        " suggests, the elder ": null
    },
    {
        "Tyrannion": "Tyrannion Of Amisus"
    },
    {
        " was one of his pupils. The founder of classical scholarship in Rome, ": null
    },
    {
        "L. Aelius Stilo": "Lucius Aelius Stilo Praeconinus"
    },
    {
        " may have profited from Dionysius instruction, since he accompanied to Rhodes ": null
    },
    {
        "Q. Metellus Numidicus": "Quintus Caecilius Metellus Numidicus"
    },
    {
        " when the latter went into voluntary exile, and while Dionysius was still teaching there.       Dionysius Thrax was credited traditionally as the author of the first extant grammar of ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        ",  Art of Grammar  . The Greek text, in ": null
    },
    {
        "August Immanuel Bekkers": "August Immanuel Bekker"
    },
    {
        " edition, runs to fifty pages. Its importance in Byzantine scholarship is attested by the fact that commentaries on it by Byzantine scholiasts run to some 600 pages. The text itself was thought to be the unique extant example of a work by ": null
    },
    {
        "Hellenistic scholars": "Hellenistic Period"
    },
    {
        ". This general consensus began to break down when examinations of grammatical texts datable to a later period emerged among the finds of the ": null
    },
    {
        "Oxyrhynchus Papyri": "Oxyrhynchus Papyri"
    },
    {
        " which, until relatively late, showed no awareness of key elements in the text attributed to Dionysius Thrax. It concerns itself primarily with a ": null
    },
    {
        "morphological": "Morphology"
    },
    {
        " description of Greek, lacking any treatment of ": null
    },
    {
        "syntax": "Syntax"
    },
    {
        ". The work was translated into ": null
    },
    {
        "Armenian": "Armenian Language"
    },
    {
        " sometime around the 5th to 6th centuries CE, and into ": null
    },
    {
        "Syriac": "Syriac Language"
    },
    {
        " around that same period.     Thrax defines grammar at the beginning of the Tékhnē as the empirical knowledge of what is for the most part being said by poets and prose writers.  He states that grammatikē, what we might nowadays call literary criticism , comprises six parts:     Grammatikḗ ἀνάγνωσις ἐξήγησις ": null
    },
    {
        "tropes/τρόποι": "Trope"
    },
    {
        ", the figurative language of texts.   γλῶσσαι ἐτυμολογία ἀνάλογίας ἐκλογισμός κρίσις ποιημάτων      Paragraph 6 outlines the στοιχεῖα  or letters of the alphabet, together with the divisions into vowels, diphthongs and consonants.     Paragraphs 7-10 deal with syllables, long , short and ": null
    },
    {
        "anceps": "Anceps"
    },
    {
        " .     Paragraph 11 treats the ": null
    },
    {
        "eight word classes": "Part Of Speech"
    },
    {
        ", though strong doubts exist as to whether or not this division goes back to Dionysius Thrax, since ancient testimonies assert that he conflated proper nouns and appellatives, and classified ": null
    },
    {
        "the article": "Article"
    },
    {
        " together with ": null
    },
    {
        "pronouns": "Pronoun"
    },
    {
        ". In the text attributed to Dionysius, the eight classes. which Di Benedetto and others argue was probably developed by ": null
    },
    {
        "Tryphon": "Tryphon"
    },
    {
        " several decades after Dionysius, are as follows:     the proper noun  and its three genders: masculine , feminine  and neutral  are distinguished, together with the five case endings. He also notes however that two other terms are also in use: κοινόν designating those words whose gender varies depending on the sex of the creature, such as ἳππος epicenekhelídōn/swallow ": null
    },
    {
        "εἶδος": "Theory Of Forms"
    },
    {
        "                         ": null
    }
]