[
    {
        "              The dodo  is an ": null
    },
    {
        "extinct": "Extinction"
    },
    {
        " flightless bird": "Flightless Bird"
    },
    {
        " that was ": null
    },
    {
        "endemic": "Endemism"
    },
    {
        " to the island of ": null
    },
    {
        "Mauritius": "Mauritius"
    },
    {
        ", east of ": null
    },
    {
        "Madagascar": "Madagascar"
    },
    {
        " in the ": null
    },
    {
        "Indian Ocean": "Indian Ocean"
    },
    {
        ". The dodos closest ": null
    },
    {
        "genetic relative": "Genetic Distance"
    },
    {
        " was the also-extinct ": null
    },
    {
        "Rodrigues solitaire": "Rodrigues Solitaire"
    },
    {
        ", the two forming the ": null
    },
    {
        "subfamily": "Taxonomic Rank"
    },
    {
        " Raphinae": "Raphinae"
    },
    {
        " of the ": null
    },
    {
        "family": "Family"
    },
    {
        " of ": null
    },
    {
        "pigeons and doves": "Columbidae"
    },
    {
        ". The closest ": null
    },
    {
        "living": "Extant Taxon"
    },
    {
        " relative of the dodo is the ": null
    },
    {
        "Nicobar pigeon": "Nicobar Pigeon"
    },
    {
        ". A white dodo was once thought to have existed on the nearby island of ": null
    },
    {
        "Réunion": "Réunion"
    },
    {
        ", but this is now thought to have been confusion based on the ": null
    },
    {
        "Réunion ibis": "Réunion Ibis"
    },
    {
        " and paintings of white dodos.     ": null
    },
    {
        "Subfossil": "Subfossil"
    },
    {
        " remains show the dodo was about  tall and may have weighed  in the wild. The dodos appearance in life is evidenced only by drawings, paintings, and written accounts from the 17th century. As these vary considerably, and only some of the illustrations are known to have been drawn from live specimens, its exact appearance in life remains unresolved, and little is known about its behaviour. Though the dodo has historically been considered fat and clumsy, it is now thought to have been well-adapted for its ecosystem. It has been depicted with brownish-grey ": null
    },
    {
        "plumage": "Plumage"
    },
    {
        ", yellow feet, a tuft of tail feathers, a grey, naked head, and a black, yellow, and green beak. It used ": null
    },
    {
        "gizzard stones": "Gizzard Stone"
    },
    {
        "to help ": null
    },
    {
        "digest": "Digestion"
    },
    {
        " its food, which is thought to have included fruits, and its main ": null
    },
    {
        "habitat": "Habitat"
    },
    {
        " is believed to have been the woods in the drier coastal areas of Mauritius. One account states its ": null
    },
    {
        "clutch": "Clutch"
    },
    {
        " consisted of a single egg. It is presumed that the dodo became flightless because of the ready availability of abundant food sources and a relative absence of predators on Mauritius.     The first recorded mention of the dodo was by Dutch sailors in 1598. In the following years, the bird was hunted by sailors and ": null
    },
    {
        "invasive species": "Invasive Species"
    },
    {
        ", while its habitat was being destroyed. The last widely accepted sighting of a dodo was in 1662. Its extinction was not immediately noticed, and some considered it to be a mythical creature. In the 19th century, research was conducted on a small quantity of remains of four specimens that had been brought to Europe in the early 17th century. Among these is a dried head, the only soft tissue of the dodo that remains today. Since then, a large amount of subfossil material has been collected on Mauritius, mostly from the ": null
    },
    {
        "Mare aux Songes": "Mare Aux Songes"
    },
    {
        " swamp. The extinction of the dodo within less than a century of its discovery called attention to the previously unrecognised problem of human involvement in the disappearance of entire ": null
    },
    {
        "species": "Species"
    },
    {
        ". The dodo achieved widespread recognition from its role in the story of  Alices Adventures in Wonderland , and it has since become a fixture in popular culture, often as a ": null
    },
    {
        "symbol of extinction": "Bird Extinction"
    },
    {
        " and ": null
    },
    {
        "obsolescence": "Obsolescence"
    },
    {
        ".          The dodo was variously declared a small ": null
    },
    {
        "ostrich": "Ostrich"
    },
    {
        ", a ": null
    },
    {
        "rail": "Rallidae"
    },
    {
        ", an ": null
    },
    {
        "albatross": "Albatross"
    },
    {
        ", or a ": null
    },
    {
        "vulture": "Vulture"
    },
    {
        ", by early scientists. In 1842, Danish zoologist ": null
    },
    {
        "Johannes Theodor Reinhardt": "Johannes Theodor Reinhardt"
    },
    {
        " proposed that dodos were ground ": null
    },
    {
        "pigeons": "Columbidae"
    },
    {
        ", based on studies of a dodo skull he had discovered in the collection of the ": null
    },
    {
        "Natural History Museum of Denmark": "Natural History Museum Of Denmark"
    },
    {
        ". This view was met with ridicule, but was later supported by English naturalists ": null
    },
    {
        "Hugh Edwin Strickland": "Hugh Edwin Strickland"
    },
    {
        " and ": null
    },
    {
        "Alexander Gordon Melville": "Alexander Gordon Melville"
    },
    {
        " in their 1848 ": null
    },
    {
        "monograph": "Monograph"
    },
    {
        " The Dodo and Its Kindred, which attempted to separate myth from reality. After ": null
    },
    {
        "dissecting": "Dissection"
    },
    {
        " the ": null
    },
    {
        "preserved": "Embalming"
    },
    {
        " head and foot of the specimen at the ": null
    },
    {
        "Oxford University Museum": "Oxford University Museum"
    },
    {
        " and comparing it with the few remains then available of the extinct ": null
    },
    {
        "Rodrigues solitaire": "Rodrigues Solitaire"
    },
    {
        "  they concluded that the two were closely related. Strickland stated that although not identical, these birds shared many distinguishing features of the leg bones, otherwise known only in pigeons.      Strickland and Melville established that the dodo was ": null
    },
    {
        "anatomically": "Anatomy"
    },
    {
        " similar to pigeons in many features. They pointed to the very short ": null
    },
    {
        "keratinous": "Keratinous"
    },
    {
        " portion of the ": null
    },
    {
        "beak": "Beak"
    },
    {
        ", with its long, slender, naked basal part. Other pigeons also have bare skin around their eyes, almost reaching their beak, as in dodos. The forehead was high in relation to the beak, and the ": null
    },
    {
        "nostril": "Beaknares"
    },
    {
        " was located low on the middle of the beak and surrounded by skin, a combination of features shared only with pigeons. The legs of the dodo were generally more similar to those of ": null
    },
    {
        "terrestrial": "Terrestrial Animal"
    },
    {
        " pigeons than of other birds, both in their ": null
    },
    {
        "scales": "Bird Anatomyscales"
    },
    {
        " and in their skeletal features. Depictions of the large ": null
    },
    {
        "crop": "Crop"
    },
    {
        " hinted at a relationship with pigeons, in which this feature is more developed than in other birds. Pigeons generally have very small ": null
    },
    {
        "clutches": "Clutch"
    },
    {
        ", and the dodo is said to have laid a single egg. Like pigeons, the dodo lacked the ": null
    },
    {
        "vomer": "Vomer"
    },
    {
        " and ": null
    },
    {
        "septum": "Septum"
    },
    {
        " of the nostrils, and it shared details in the ": null
    },
    {
        "mandible": "Mandible"
    },
    {
        ", the ": null
    },
    {
        "zygomatic bone": "Zygomatic Bone"
    },
    {
        ", the ": null
    },
    {
        "palate": "Palate"
    },
    {
        ", and the ": null
    },
    {
        "hallux": "Hallux"
    },
    {
        ". The dodo differed from other pigeons mainly in the small size of the wings and the large size of the beak in proportion to the rest of the ": null
    },
    {
        "cranium": "Cranium"
    },
    {
        ".     Throughout the 19th century, several species were classified as ": null
    },
    {
        "congeneric": "Conspecificity"
    },
    {
        " with the dodo, including the Rodrigues solitaire and the ": null
    },
    {
        "Réunion solitaire": "Réunion Solitaire"
    },
    {
        ", as Didus solitarius and Raphus solitarius, respectively . An atypical 17th-century description of a dodo and bones found on Rodrigues, now known to have belonged to the Rodrigues solitaire, led ": null
    },
    {
        "Abraham Dee Bartlett": "Abraham Dee Bartlett"
    },
    {
        " to name a new species, Didus nazarenus, in 1852. Based on solitaire remains, it is now a synonym of that species. Crude drawings of the ": null
    },
    {
        "red rail": "Red Rail"
    },
    {
        " of ": null
    },
    {
        "Mauritius": "Mauritius"
    },
    {
        " were also misinterpreted as dodo species; Didus broeckii and Didus herberti.     For many years the dodo and the Rodrigues solitaire were placed in a ": null
    },
    {
        "family": "Family"
    },
    {
        " of their own, the Raphidae , because their exact relationships with other pigeons were unresolved. Each was also placed in its own ": null
    },
    {
        "monotypic": "Monotypic Taxon"
    },
    {
        " family , as it was thought that they had ": null
    },
    {
        "evolved their similarities independently": "Convergent Evolution"
    },
    {
        ". ": null
    },
    {
        "Osteological": "Osteological"
    },
    {
        " and ": null
    },
    {
        "DNA analysis": "Dna Analysis"
    },
    {
        " has since led to the dissolution of the family Raphidae, and the dodo and solitaire are now placed in their own subfamily, Raphinae, within the family Columbidae.          In 2002, American geneticist ": null
    },
    {
        "Beth Shapiro": "Beth Shapiro"
    },
    {
        " and colleagues analysed the DNA of the dodo for the first time. Comparison of ": null
    },
    {
        "mitochondria": "Mitochondria"
    },
    {
        "l ": null
    },
    {
        "cytochrome b": "Cytochrome B"
    },
    {
        " and 12S ": null
    },
    {
        "rRNA": "Ribosomal Rna"
    },
    {
        " sequences": "Dna Sequence"
    },
    {
        " isolated from a ": null
    },
    {
        "tarsal": "Tarsus"
    },
    {
        " of the Oxford specimen and a ": null
    },
    {
        "femur": "Femur"
    },
    {
        " of a Rodrigues solitaire confirmed their close relationship and their placement within the Columbidae. The genetic evidence was interpreted as showing the Southeast Asian ": null
    },
    {
        "Nicobar pigeon": "Nicobar Pigeon"
    },
    {
        "  to be their closest living relative, followed by the ": null
    },
    {
        "crowned pigeons": "Crowned Pigeon"
    },
    {
        "  of ": null
    },
    {
        "New Guinea": "New Guinea"
    },
    {
        ", and the superficially dodo-like ": null
    },
    {
        "tooth-billed pigeon": "Tooth-Billed Pigeon"
    },
    {
        "  from ": null
    },
    {
        "Samoa": "Samoa"
    },
    {
        " . This ": null
    },
    {
        "clade": "Clade"
    },
    {
        " consists of generally ground-dwelling island endemic pigeons. The following ": null
    },
    {
        "cladogram": "Cladogram"
    },
    {
        " shows the dodos closest relationships within the Columbidae, based on Shapiro et al., 2002:      A similar cladogram was published in 2007, inverting the placement of Goura and Dicunculus and including the ": null
    },
    {
        "pheasant pigeon": "Pheasant Pigeon"
    },
    {
        "  and the ": null
    },
    {
        "thick-billed ground pigeon": "Thick-Billed Ground Pigeon"
    },
    {
        "  at the base of the clade. The DNA used in these studies was obtained from the Oxford specimen, and since this material is degraded, and no usable DNA has been extracted from subfossil remains, these findings still need to be independently verified. Based on behavioural and morphological evidence, Jolyon C. Parish proposed that the dodo and Rodrigues solitaire should be placed in the subfamily ": null
    },
    {
        "Gourinae": "Gourinae"
    },
    {
        " along with the Goura pigeons and others, in agreement with the genetic evidence.  In 2014, DNA of the only known specimen of the recently extinct ": null
    },
    {
        "spotted green pigeon": "Spotted Green Pigeon"
    },
    {
        "  was analysed, and it was found to be a close relative of the Nicobar pigeon, and thus also the dodo and Rodrigues solitaire.       The 2002 study indicated that the ancestors of the dodo and the solitaire diverged around the ": null
    },
    {
        "Paleogene": "Paleogene"
    },
    {
        "-": null
    },
    {
        "Neogene": "Neogene"
    },
    {
        " boundary. The ": null
    },
    {
        "Mascarene Islands": "Mascarene Islands"
    },
    {
        " , are of ": null
    },
    {
        "volcanic": "Volcano"
    },
    {
        " origin and are less than 10 million years old. Therefore, the ancestors of both birds probably remained capable of flight for a considerable time after the separation of their ": null
    },
    {
        "lineage": "Lineage"
    },
    {
        ". The Nicobar and spotted green pigeon were placed at the base of a lineage leading to the Raphinae, which indicates the ": null
    },
    {
        "flightless": "Flightless"
    },
    {
        " raphines had ancestors that were able to fly, were semi-terrestrial, and inhabited islands. This in turn supports the hypothesis that the ancestors of those birds reached the Mascarene islands by ": null
    },
    {
        "island hopping": "Island Hopping"
    },
    {
        " from South Asia. The lack of ": null
    },
    {
        "mammal": "Mammal"
    },
    {
        "ian ": null
    },
    {
        "herbivores": "Herbivore"
    },
    {
        "competing for resources on these islands allowed the solitaire and the dodo to attain ": null
    },
    {
        "very large sizes": "Island Gigantism"
    },
    {
        " and flightlessness. Despite its divergent skull morphology and adaptations for larger size, many features of its skeleton remained similar to those of smaller, flying pigeons. Another large, flightless pigeon, the ": null
    },
    {
        "Viti Levu giant pigeon": "Viti Levu Giant Pigeon"
    },
    {
        " , was described in 2001 from ": null
    },
    {
        "subfossil": "Subfossil"
    },
    {
        " material from ": null
    },
    {
        "Fiji": "Fiji"
    },
    {
        ". It was only slightly smaller than the dodo and the solitaire, and it too is thought to have been related to the crowned pigeons.          One of the original names for the dodo was the Dutch Walghvoghel , first used in the journal of Dutch ": null
    },
    {
        "Vice Admiral": "Vice Admiral"
    },
    {
        " Wybrand van Warwijck, who visited Mauritius during the Second Dutch Expedition to Indonesia in 1598. Walghe means tasteless , insipid , or sickly , and voghel means bird . The name was translated by Jakob Friedlib into German as Walchstök or Walchvögel. The original Dutch report titled Waarachtige Beschryving was lost, but the English translation survived:         Another account from that voyage, perhaps the first to mention the dodo, states that the Portuguese referred to them as penguins. The meaning may not have been derived from  penguin  , but from  pinion , a reference to the small wings. The crew of the Dutch ship Gelderland referred to the bird as Dronte in 1602, a name that is still used in some languages. This crew also called them griff-eendt and kermisgans , in reference to ": null
    },
    {
        "fowl": "Fowl"
    },
    {
        " fattened for the ": null
    },
    {
        "Kermesse festival": "Kermesse Festival"
    },
    {
        " in ": null
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        ", which was held the day after they anchored on Mauritius.     The ": null
    },
    {
        "etymology": "Etymology"
    },
    {
        " of the word dodo is unclear. Some ascribe it to the Dutch word dodoor for sluggard , but it is more probably related to Dodaars, which means either fat-arse or knot-arse , referring to the knot of feathers on the hind end. The first record of the word Dodaars is in Captain Willem Van West-Zanens journal in 1602. The English writer ": null
    },
    {
        "Sir Thomas Herbert": "Sir Thomas Herbert"
    },
    {
        " was the first to use the word dodo in print in his 1634 ": null
    },
    {
        "travelogue": "Travel Journal"
    },
    {
        " claiming it was referred to as such by the Portuguese, who had visited Mauritius in 1507. Another Englishman, Emmanuel Altham, had used the word in a 1628 letter in which he also claimed its origin was Portuguese. The name dodar was introduced into English at the same time as dodo, but was only used until the 18th century. As far as is known, the Portuguese never mentioned the bird. Nevertheless, some sources still state that the word dodo derives from the ": null
    },
    {
        "Portuguese": "Portuguese Language"
    },
    {
        " word doudo , meaning fool or crazy . It has also been suggested that dodo was an ": null
    },
    {
        "onomatopoeic": "Onomatopoeia"
    },
    {
        " approximation of the birds call, a two-note pigeon-like sound resembling doo-doo .     The Latin name cucullatus was first used by ": null
    },
    {
        "Juan Eusebio Nieremberg": "Juan Eusebio Nieremberg"
    },
    {
        " in 1635 as  Cygnus cucullatus, in reference to ": null
    },
    {
        "Carolus Clusiuss": "Carolus Clusius"
    },
    {
        "1605 depiction of a dodo. In his 18th-century classic work  Systema Naturae , ": null
    },
    {
        "Carl Linnaeus": "Carl Linnaeus"
    },
    {
        " used cucullatus as the specific name, but combined it with the genus name Struthio . ": null
    },
    {
        "Mathurin Jacques Brisson": "Mathurin Jacques Brisson"
    },
    {
        " coined the genus name Raphus  in 1760, resulting in the current name Raphus cucullatus. In 1766, Linnaeus coined the new binomial Didus ineptus . This has become a ": null
    },
    {
        "synonym": "Synonym"
    },
    {
        " of the earlier name because of ": null
    },
    {
        "nomenclatural priority": "Nomenclatural Priority"
    },
    {
        ".          As no complete dodo specimens exist, its external appearance, such as plumage and colouration, is hard to determine. Illustrations and written accounts of encounters with the dodo between its discovery and its extinction are the primary evidence for its external appearance. According to most representations, the dodo had greyish or brownish ": null
    },
    {
        "plumage": "Plumage"
    },
    {
        ", with lighter ": null
    },
    {
        "primary feathers": "Primary Feathers"
    },
    {
        " and a tuft of curly light feathers high on its rear end. The head was grey and naked, the beak green, black and yellow, and the legs were stout and yellowish, with black claws. A study of the few remaining feathers on the Oxford specimen head showed that they were ": null
    },
    {
        "pennaceous": "Pennaceous"
    },
    {
        " rather than ": null
    },
    {
        "plumaceous": "Plumaceous"
    },
    {
        " and most similar to those of other pigeons.      Subfossil remains and remnants of the birds that were brought to Europe in the 17th century show that dodos were very large birds, up to  tall.   The bird was ": null
    },
    {
        "sexually dimorphic": "Sexually Dimorphic"
    },
    {
        "; males were larger and had proportionally longer beaks. Weight estimates have varied from study to study. In 1993, ": null
    },
    {
        "Bradley C. Livezey": "Bradley C. Livezey"
    },
    {
        " proposed that males would have weighed  and females . Also in 1993, Andrew C. Kitchener attributed a high contemporary weight estimate and the roundness of dodos depicted in Europe to these birds having been overfed in captivity; weights in the wild were estimated to have been in the range of , and fattened birds could have weighed . A 2011 estimate by Angst and colleagues gave an average weight as low as . This has also been questioned, and there is still controversy over weight estimates. A 2016 study estimated the weight at , based on ": null
    },
    {
        "CT scans": "Ct Scans"
    },
    {
        " of composite skeletons.  It has also been suggested that the weight depended on the season, and that individuals were fat during cool seasons, but less so during hot.     The skull of the dodo differed much from those of other pigeons, especially in being more robust, the bill having a hooked tip, and in having a short cranium compared to the jaws. The upper bill was nearly twice as long as the cranium, which was short compared to those of its closest pigeon relatives. The openings of the bony nostrils were elongated along the length of the beak, and they contained no bony septum. The cranium was wider than it was long, and the ": null
    },
    {
        "frontal bone": "Frontal Bone"
    },
    {
        " formed a dome-shape, with the highest point above the hind part of the eye sockets. The skull sloped downwards at the back. The eye sockets occupied much of the hind part of the skull. The ": null
    },
    {
        "sclerotic rings": "Sclerotic Rings"
    },
    {
        " inside the eye were formed by eleven ossicles , similar to the amount in other pigeons. The mandible was slightly curved, and each half had a single ": null
    },
    {
        "fenestra": "Fenestra"
    },
    {
        " , as in other pigeons.      The dodo had about nineteen presynsacral vertebrae , sixteen ": null
    },
    {
        "synsacral": "Synsacral"
    },
    {
        " vertebrae , six free tail vertebrae, and a ": null
    },
    {
        "pygostyle": "Pygostyle"
    },
    {
        ". The neck had well-developed areas for muscle and ligament attachment, probably to support the heavy skull and beak. On each side, it had six ribs, four of which articulated with the ": null
    },
    {
        "sternum": "Sternum"
    },
    {
        " through sternal ribs. The sternum was large, but small in relation to the body compared to those of much smaller pigeons that are able to fly. The sternum was highly ": null
    },
    {
        "pneumatic": "Pneumatic"
    },
    {
        ", broad, and relatively thick in cross-section. The bones of the ": null
    },
    {
        "pectoral girdle": "Pectoral Girdle"
    },
    {
        ", shoulder blades, and wing bones were reduced in size compared to those of flighted pigeon, and were more gracile compared to those of the Rodrigues solitaire, but none of the individual skeletal components had disappeared. The ": null
    },
    {
        "carpometacarpus": "Carpometacarpus"
    },
    {
        " of the dodo was more robust than that of the solitaire, however. The pelvis was wider than that of the solitaire and other relatives, yet was comparable to the proportions in some smaller, flighted pigeons. Most of the leg bones were more robust than those of extant pigeons and the solitaire, but the length proportions were little different.     Many of the skeletal features that distinguish the dodo and the Rodrigues solitaire, its closest relative, from pigeons have been attributed to their flightlessness. The pelvic elements were thicker than those of flighted pigeons to support the higher weight, and the ": null
    },
    {
        "pectoral": "Pectoralis Major Muscle"
    },
    {
        " region and the small wings were ": null
    },
    {
        "paedomorphic": "Neoteny"
    },
    {
        ", meaning that they were underdeveloped and retained juvenile features. The skull, trunk and ": null
    },
    {
        "pelvic": "Pelvic"
    },
    {
        " limbs were ": null
    },
    {
        "peramorphic": "Peramorphic"
    },
    {
        ", meaning that they changed considerably with age. The dodo shared several other traits with the Rodrigues solitaire, such as features of the skull, pelvis, and sternum, as well as their large size. It differed in other aspects, such as being more robust and shorter than the solitaire, having a larger skull and beak, a rounded ": null
    },
    {
        "skull roof": "Skull Roof"
    },
    {
        ", and smaller ": null
    },
    {
        "orbits": "Orbits"
    },
    {
        ". The dodos neck and legs were proportionally shorter, and it did not possess an equivalent to the knob present on the solitaires wrists.          Most contemporary descriptions of the dodo are found in ": null
    },
    {
        "ships logs": "Ships Logs"
    },
    {
        " and journals of the Dutch East India Company vessels that docked in Mauritius when the ": null
    },
    {
        "Dutch Empire": "Dutch Empire"
    },
    {
        " ruled the island. These records were used as guides for future voyages. Few contemporary accounts are reliable, as many seem to be based on earlier accounts, and none were written by scientists. One of the earliest accounts, from van Warwijcks 1598 journal, describes the bird as follows:      One of the most detailed descriptions is by Herbert in A Relation of Some Yeares Travaille into Afrique and the Greater Asia from 1634:             The travel journal of the Dutch ship Gelderland , rediscovered in the 1860s, contains the only known sketches of living or recently killed specimens drawn on Mauritius. They have been attributed to the professional artist Joris Joostensz Laerle, who also drew other now-extinct Mauritian birds, and to a second, less refined artist. Apart from these sketches, it is unknown how many of the twenty or so 17th-century illustrations of the dodos were drawn from life or from stuffed specimens, which affects their reliability.     The traditional image of the dodo is of a very fat and clumsy bird, but this view may be exaggerated. The general opinion of scientists today is that many old European depictions were based on overfed captive birds or crudely stuffed specimens. It has also been suggested that the images might show dodos with puffed feathers, as part of display behaviour. The Dutch painter ": null
    },
    {
        "Roelant Savery": "Roelant Savery"
    },
    {
        " was the most prolific and influential illustrator of the dodo, having made at least twelve depictions, often showing it in the lower corners. A famous painting of his from 1626, now called Edwardss Dodo as it was once owned by the ornithologist ": null
    },
    {
        "George Edwards": "George Edwards"
    },
    {
        ", has since become the standard image of a dodo. It is housed in the ": null
    },
    {
        "Natural History Museum": "Natural History Museum, London"
    },
    {
        ", London. The image shows a particularly fat bird and is the source for many other dodo illustrations.       An Indian ": null
    },
    {
        "Mughal painting": "Mughal Painting"
    },
    {
        " rediscovered in ": null
    },
    {
        "St. Petersburg": "St. Petersburg"
    },
    {
        " in the 1950s shows a dodo along with native Indian birds. It depicts a slimmer, brownish bird, and its discoverer A. Iwanow and British palaeontologist ": null
    },
    {
        "Julian Hume": "Julian Hume"
    },
    {
        " regarded it as one of the most accurate depictions of the living dodo; the surrounding birds are clearly identifiable and depicted with appropriate colouring. It is believed to be from the 17th century and has been attributed to the ": null
    },
    {
        "Mughal painter": "Mughal Painter"
    },
    {
        " Ustad Mansur": "Ustad Mansur"
    },
    {
        ". The bird depicted probably lived in the ": null
    },
    {
        "menagerie": "Menagerie"
    },
    {
        " of the ": null
    },
    {
        "Mughal Emperor": "Mughal Emperor"
    },
    {
        " Jahangir": "Jahangir"
    },
    {
        ", located in ": null
    },
    {
        "Surat": "Surat"
    },
    {
        ", where the English traveller ": null
    },
    {
        "Peter Mundy": "Peter Mundy"
    },
    {
        " also claimed to have seen two dodos sometime between 1628 and 1633.   In 2014, another Indian illustration of a dodo was reported, but it was found to be derivative of an 1836 German illustration.      All post-1638 depictions appear to be based on earlier images, around the time reports mentioning dodos became rarer. Differences in the depictions led ornithologists such as ": null
    },
    {
        "Anthonie Cornelis Oudemans": "Anthonie Cornelis Oudemans"
    },
    {
        " and ": null
    },
    {
        "Masauji Hachisuka": "Masauji Hachisuka"
    },
    {
        " to speculate about sexual dimorphism, ": null
    },
    {
        "ontogenic": "Ontogenic"
    },
    {
        " traits, seasonal variation, and even the existence of different species, but these theories are not accepted today. Because details such as markings of the beak, the form of the tail feathers, and colouration vary from account to account, it is impossible to determine the exact morphology of these features, whether they signal age or sex, or if they even reflect reality. Hume argued that the nostrils of the living dodo would have been slits, as seen in the Gelderland, ": null
    },
    {
        "Cornelis Saftleven": "Cornelis Saftleven"
    },
    {
        ", Saverys ": null
    },
    {
        "Crocker Art Gallery": "Crocker Art Gallery"
    },
    {
        ", and Ustad Mansur images. According to this claim, the gaping nostrils often seen in paintings indicate that ": null
    },
    {
        "taxidermy": "Taxidermy"
    },
    {
        " specimens were used as models. Most depictions show that the wings were held in an extended position, unlike flighted pigeons, but similar to ": null
    },
    {
        "ratites": "Ratites"
    },
    {
        " such as the ostrich and ": null
    },
    {
        "kiwi": "Kiwi"
    },
    {
        ".          Little is known of the behaviour of the dodo, as most contemporary descriptions are very brief. Based on weight estimates, it has been suggested the male could reach the age of 21, and the female 17. Studies of the ": null
    },
    {
        "cantilever": "Cantilever"
    },
    {
        " strength of its leg bones indicate that it could run quite fast. The legs were robust and strong to support the bulk of the bird, and also made it agile and manoeuvrable in the dense, pre-human landscape. Though the wings were small, well-developed muscle scars on the bones show that they were not completely ": null
    },
    {
        "vestigial": "Vestigial"
    },
    {
        ", and may have been used for ": null
    },
    {
        "display behaviour": "Display Behaviour"
    },
    {
        " and balance; extant pigeons also use their wings for such purposes.  Unlike the Rodrigues solitaire, there is no evidence that the dodo used its wings in intraspecific combat. Though some dodo bones have been found with healed fractures, it had weak pectoral muscles and more reduced wings in comparison. The dodo may instead have used its large, hooked beak in territorial disputes. Since Mauritius receives more rainfall and has less seasonal variation than Rodrigues, which would have affected the availability of resources on the island, the dodo would have less reason to evolve aggressive territorial behaviour. The Rodrigues solitaire was therefore probably the more aggressive of the two.      The preferred habitat of the dodo is unknown, but old descriptions suggest that it inhabited the woods on the drier coastal areas of south and west Mauritius. This view is supported by the fact that the ": null
    },
    {
        "Mare aux Songes": "Mare Aux Songes"
    },
    {
        " swamp, where most dodo remains have been excavated, is close to the sea in south-eastern Mauritius. Such a limited distribution across the island could well have contributed to its extinction. A 1601 map from the Gelderland journal shows a small island off the coast of Mauritius where dodos were caught. Julian Hume has suggested this island was ": null
    },
    {
        "lîle aux Benitiers": "Lîle Aux Benitiers"
    },
    {
        " in ": null
    },
    {
        "Tamarin Bay": "Tamarin Bay"
    },
    {
        ", on the west coast of Mauritius. Subfossil bones have also been found inside caves in highland areas, indicating that it once occurred on mountains. Work at the Mare aux Songes swamp has shown that its habitat was dominated by ": null
    },
    {
        "tambalacoque": "Tambalacoque"
    },
    {
        " and  Pandanus  trees and endemic palms. The near-coastal placement and wetness of the Mare aux Songes led to a high diversity of plant species, whereas the surrounding areas were drier.     Many endemic species of Mauritius became extinct after the arrival of humans, so the ": null
    },
    {
        "ecosystem": "Ecosystem"
    },
    {
        " of the island is badly damaged and hard to reconstruct. Before humans arrived, Mauritius was entirely covered in forests, but very little remains of them today, because of ": null
    },
    {
        "deforestation": "Deforestation"
    },
    {
        ". The surviving endemic ": null
    },
    {
        "fauna": "Fauna"
    },
    {
        " is still seriously threatened. The dodo lived alongside other recently extinct Mauritian birds such as the flightless red rail, the ": null
    },
    {
        "broad-billed parrot": "Broad-Billed Parrot"
    },
    {
        ", the ": null
    },
    {
        "Mascarene grey parakeet": "Mascarene Grey Parakeet"
    },
    {
        ", the ": null
    },
    {
        "Mauritius blue pigeon": "Mauritius Blue Pigeon"
    },
    {
        ", the ": null
    },
    {
        "Mauritius owl": "Mauritius Owl"
    },
    {
        ", the ": null
    },
    {
        "Mascarene coot": "Mascarene Coot"
    },
    {
        ", the ": null
    },
    {
        "Mauritian shelduck": "Mauritian Shelduck"
    },
    {
        ", the ": null
    },
    {
        "Mauritian duck": "Mauritian Duck"
    },
    {
        ", and the ": null
    },
    {
        "Mauritius night heron": "Mauritius Night Heron"
    },
    {
        ". Extinct Mauritian reptiles include the ": null
    },
    {
        "saddle-backed Mauritius giant tortoise": "Saddle-Backed Mauritius Giant Tortoise"
    },
    {
        ", the ": null
    },
    {
        "domed Mauritius giant tortoise": "Domed Mauritius Giant Tortoise"
    },
    {
        ", the ": null
    },
    {
        "Mauritian giant skink": "Mauritian Giant Skink"
    },
    {
        ", and the ": null
    },
    {
        "Round Island burrowing boa": "Round Island Burrowing Boa"
    },
    {
        ". The ": null
    },
    {
        "small Mauritian flying fox": "Small Mauritian Flying Fox"
    },
    {
        " and the snail  Tropidophora carinata  lived on Mauritius and Réunion, but vanished from both islands. Some plants, such as  Casearia tinifolia  and the ": null
    },
    {
        "palm orchid": "Palm Orchid"
    },
    {
        ", have also become extinct.       A 1631 Dutch letter is the only account of the dodos diet, and also mentions that it used its beak for defence. The document uses ": null
    },
    {
        "word-play": "Word-Play"
    },
    {
        " to refer to the animals described, with dodos presumably being an ": null
    },
    {
        "allegory": "Allegory"
    },
    {
        " for wealthy mayors:          In addition to fallen fruits, the dodo probably subsisted on nuts, seeds, bulbs, and roots. It has also been suggested that the dodo might have eaten ": null
    },
    {
        "crabs": "Crabs"
    },
    {
        " and ": null
    },
    {
        "shellfish": "Shellfish"
    },
    {
        ", like their relatives the crowned pigeons. Its feeding habits must have been versatile, since captive specimens were probably given a wide range of food on the long sea journeys. Oudemans suggested that as Mauritius has marked dry and wet seasons, the dodo probably fattened itself on ripe fruits at the end of the wet season to survive the dry season, when food was scarce; contemporary reports describe the birds greedy appetite. ": null
    },
    {
        "France Staub": "France Staub"
    },
    {
        " suggested that they mainly fed on ": null
    },
    {
        "palm": "Palm"
    },
    {
        " fruits, and he attempted to correlate the fat-cycle of the dodo with the fruiting regime of the palms.     Skeletal elements of the upper jaw appear to have been ": null
    },
    {
        "rhynchokinetic": "Rhynchokinetic"
    },
    {
        " , which must have affected its feeding behaviour. In extant birds, such as ": null
    },
    {
        "frugivorous": "Frugivorous"
    },
    {
        " pigeons, kinetic ": null
    },
    {
        "premaxillae": "Premaxillae"
    },
    {
        " help with consuming large food items. The beak also appears to have been able to withstand high force loads, which indicates a diet of hard food. In 2016, the first 3D ": null
    },
    {
        "endocast": "Endocast"
    },
    {
        " was made from the brain of the dodo; examination found that though the brain was similar to that of other pigeons in most respects, the dodo had a comparatively large ": null
    },
    {
        "olfactory bulb": "Olfactory Bulb"
    },
    {
        ". This gave the dodo a good sense of smell, which may have aided in locating fruit and small prey.       Several contemporary sources state that the dodo used ": null
    },
    {
        "Gastroliths": "Gastrolith"
    },
    {
        " to aid digestion. The English writer Sir ": null
    },
    {
        "Hamon LEstrange": "Hamon Lestrange"
    },
    {
        " witnessed a live bird in London and described it as follows:      It is not known how the young were fed, but related pigeons provide ": null
    },
    {
        "crop milk": "Crop Milk"
    },
    {
        ". Contemporary depictions show a large crop, which was probably used to add space for food storage and to produce crop milk. It has been suggested that the maximum size attained by the dodo and the solitaire was limited by the amount of crop milk they could produce for their young during early growth.      In 1973, the tambalacoque, also known as the dodo tree, was thought to be dying out on Mauritius, to which it is ": null
    },
    {
        "endemic": "Endemic"
    },
    {
        ". There were supposedly only 13 specimens left, all estimated to be about 300 years old. ": null
    },
    {
        "Stanley Temple": "Stanley Temple"
    },
    {
        " hypothesised that it depended on the dodo for its propagation, and that its seeds would germinate only after passing through the birds digestive tract. He claimed that the tambalacoque was now nearly ": null
    },
    {
        "coextinct": "Coextinct"
    },
    {
        " because of the disappearance of the dodo. Temple overlooked reports from the 1940s that found that tambalacoque seeds germinated, albeit very rarely, without being ": null
    },
    {
        "abraded": "Abrasion"
    },
    {
        " during digestion. Others have contested his hypothesis and suggested that the decline of the tree was exaggerated, or seeds were also distributed by other extinct animals such as  Cylindraspis  ": null
    },
    {
        "tortoise": "Tortoise"
    },
    {
        "s, ": null
    },
    {
        "fruit bats": "Fruit Bat"
    },
    {
        "or the broad-billed parrot. According to Wendy Strahm and Anthony Cheke, two experts in the ": null
    },
    {
        "ecology": "Ecology"
    },
    {
        " of the Mascarene Islands, the tree, while rare, has germinated since the demise of the dodo and numbers several hundred, not 13 as claimed by Temple, hence discrediting Temples view as to the dodo and the trees sole survival relationship.     The Brazilian ornithologist Carlos Yamashita suggested in 1997 that the broad-billed parrot may have depended on dodos and Cylindraspis tortoises to eat palm fruits and excrete their seeds, which became food for the parrots.  Anodorhynchus  macaws depended on now-extinct ": null
    },
    {
        "South America": "South America"
    },
    {
        "n ": null
    },
    {
        "megafauna": "Megafauna"
    },
    {
        " in the same way, but now rely on domesticated cattle for this service.       As it was flightless and terrestrial and there were no ": null
    },
    {
        "mammalian": "Mammalian"
    },
    {
        " predators or other kinds of natural enemy on Mauritius, the dodo probably nested on the ground. The account by François Cauche from 1651 is the only description of the egg and the ": null
    },
    {
        "call": "Bird Call"
    },
    {
        "      Cauches account is problematic, since it also mentions that the bird he was describing had three toes and no tongue, unlike dodos. This led some to believe that Cauche was describing a new species of dodo . The description was most probably mingled with that of a ": null
    },
    {
        "cassowary": "Cassowary"
    },
    {
        ", and Cauches writings have other inconsistencies. A mention of a young ostrich taken on board a ship in 1617 is the only other reference to a possible juvenile dodo. An egg claimed to be that of a dodo is stored in the museum of ": null
    },
    {
        "East London, South Africa": "East London, South Africa"
    },
    {
        ". It was donated by ": null
    },
    {
        "Marjorie Courtenay-Latimer": "Marjorie Courtenay-Latimer"
    },
    {
        ", whose great aunt had received it from a captain who claimed to have found it in a swamp on Mauritius. In 2010, the curator of the museum proposed using genetic studies to determine its authenticity. It may instead be an aberrant ostrich egg.      Because of the possible single-egg clutch and the birds large size, it has been proposed that the dodo was ": null
    },
    {
        "K-selected": "K-Selected"
    },
    {
        ", meaning that it produced a low number of ": null
    },
    {
        "altricial": "Altricial"
    },
    {
        " offspring, which required parental care until they matured. Some evidence, including the large size and the fact that tropical and frugivorous birds have slower growth rates, indicates that the bird may have had a protracted development period. The fact that no juvenile dodos have been found in the Mare aux Songes swamp may indicate that they produced little offspring, that they matured rapidly, that the breeding grounds were far away from the swamp, or that the risk of miring was seasonal.     A 2017 study examined the ": null
    },
    {
        "histology": "Histology"
    },
    {
        " of ": null
    },
    {
        "thin-sectioned": "Thin-Sectioned"
    },
    {
        " dodo bones, modern Mauritian birds, local ecology, and contemporary accounts, to recover information about the life history of the dodo. The study suggested that dodos bred around August, after having potentially fattened themselves, corresponding with the fat and thin cycles of many vertebrates of Mauritius. The chicks grew rapidly, reaching robust, almost adult, sizes, and sexual maturity before Austral summer or the cyclone season. Adult dodos which had just bred ": null
    },
    {
        "moulted": "Moulted"
    },
    {
        " after Austral summer, around March. The feathers of the wings and tail were replaced first, and the moulting would have completed at the end of July, in time for the next breeding season. Different stages of moulting may also account for inconsistencies in contemporary descriptions of dodo plumage.           Mauritius had previously been visited by ": null
    },
    {
        "Arab": "Arab"
    },
    {
        " vessels in the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        " and Portuguese ships between 1507 and 1513, but was settled by neither. No records of dodos by these are known, although the Portuguese name for Mauritius, Cerne Island , may have been a reference to dodos. The Dutch Empire acquired Mauritius in 1598, renaming it after ": null
    },
    {
        "Maurice of Nassau": "Maurice Of Nassau"
    },
    {
        ", and it was used for the provisioning of trade vessels of the ": null
    },
    {
        "Dutch East India Company": "Dutch East India Company"
    },
    {
        " henceforward. The earliest known accounts of the dodo were provided by Dutch travelers during the ": null
    },
    {
        "Second Dutch Expedition to Indonesia": "Second Dutch Expedition To Indonesia"
    },
    {
        ", led by ": null
    },
    {
        "admiral": "Admiral"
    },
    {
        " Jacob van Neck": "Jacob Van Neck"
    },
    {
        " in 1598. They appear in reports published in 1601, which also contain the first published illustration of the bird. Since the first sailors to visit Mauritius had been at sea for a long time, their interest in these large birds was mainly culinary. The 1602 journal by Willem Van West-Zanen of the ship Bruin-Vis mentions that 24–25 dodos were hunted for food, which were so large that two could scarcely be consumed at mealtime, their remains being preserved by ": null
    },
    {
        "salting": "Salting"
    },
    {
        ". An illustration made for the 1648 published version of this journal, showing the killing of dodos, a ": null
    },
    {
        "dugong": "Dugong"
    },
    {
        ", and possibly Mascarene grey parakeets, was captioned with a Dutch poem,  here in Hugh Stricklands 1848 translation:         Some early travellers found dodo meat unsavoury, and preferred to eat parrots and pigeons; others described it as tough but good. Some hunted dodos only for their gizzards, as this was considered the most delicious part of the bird. Dodos were easy to catch, but hunters had to be careful not to be bitten by their powerful beaks.     The appearance of the dodo and the red rail led Peter Mundy to speculate, 230 years before ": null
    },
    {
        "Charles Darwins": "Charles Darwin"
    },
    {
        "theory of ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        "          The dodo was found interesting enough that living specimens were sent to Europe and the East. The number of transported dodos that reached their destinations alive is uncertain, and it is unknown how they relate to contemporary depictions and the few non-fossil remains in European museums. Based on a combination of contemporary accounts, paintings, and specimens, Julian Hume has inferred that at least eleven transported dodos reached their destinations alive.     Hamon LEstranges description of a dodo that he saw in London in 1638 is the only account that specifically mentions a live specimen in Europe. In 1626 ": null
    },
    {
        "Adriaen van de Venne": "Adriaen Van De Venne"
    },
    {
        " drew a dodo that he claimed to have seen in Amsterdam, but he did not mention if it were alive, and his depiction is reminiscent of Saverys Edwardss Dodo. Two live specimens were seen by Peter Mundy in Surat, India, between 1628 and 1634, one of which may have been the individual painted by Ustad Mansur around 1625. In 1628, Emmanuel Altham visited Mauritius and sent a letter to his brother in England:           Whether the dodo survived the journey is unknown, and the letter was destroyed by fire in the 19th century.   The earliest known picture of a dodo specimen in Europe is from a  collection of paintings depicting animals in the royal menagerie of ": null
    },
    {
        "Emperor Rudolph II": "Emperor Rudolph Ii"
    },
    {
        " in Prague. This collection includes paintings of other Mauritian animals as well, including a red rail. The dodo, which may be a juvenile, seems to have been dried or embalmed, and had probably lived in the emperors zoo for a while together with the other animals. That whole stuffed dodos were present in Europe indicates they had been brought alive and died there; it is unlikely that taxidermists were on board the visiting ships, and spirits were not yet used to preserve biological specimens. Most ": null
    },
    {
        "tropical": "Tropical"
    },
    {
        " specimens were preserved as dried heads and feet.     One dodo was reportedly sent as far as ": null
    },
    {
        "Nagasaki": "Nagasaki"
    },
    {
        ", Japan in 1647, but it was long unknown whether it arrived. Contemporary documents first published in 2014 proved the story, and showed that it had arrived alive. It was meant as a gift, and, despite its rarity, was considered of equal value to a white deer and a ": null
    },
    {
        "bezoar": "Bezoar"
    },
    {
        " stone. It is the last recorded live dodo in captivity.           Like many animals that evolved in isolation from significant predators, the dodo was entirely ": null
    },
    {
        "fearless": "Island Tameness"
    },
    {
        " of humans. This fearlessness and its inability to fly made the dodo easy prey for sailors. Although some scattered reports describe mass killings of dodos for ships provisions, archaeological investigations have found scant evidence of human predation. Bones of at least two dodos were found in caves at Baie du Cap that sheltered ": null
    },
    {
        "fugitive slaves": "Maroon"
    },
    {
        " and convicts in the 17th century, which would not have been easily accessible to dodos because of the high, broken terrain. The human population on Mauritius  never exceeded 50 people in the 17th century, but they introduced other animals, including dogs, pigs, cats, rats, and ": null
    },
    {
        "crab-eating macaque": "Crab-Eating Macaque"
    },
    {
        "s, which plundered dodo nests and competed for the limited food resources. At the same time, humans destroyed the forest ": null
    },
    {
        "habitat": "Habitat"
    },
    {
        " of the dodos. The impact of the introduced animals on the dodo population, especially the pigs and macaques, is today considered more severe than that of hunting. Rats were perhaps not much of a threat to the nests, since dodos would have been used to dealing with local ": null
    },
    {
        "land crabs": "Land Crabs"
    },
    {
        ".     It has been suggested that the dodo may already have been rare or localised before the arrival of humans on Mauritius, since it would have been unlikely to become extinct so rapidly if it had occupied all the remote areas of the island. A 2005 expedition found subfossil remains of dodos and other animals killed by a ": null
    },
    {
        "flash flood": "Flash Flood"
    },
    {
        ". Such mass mortalities would have further jeopardised a species already in danger of becoming extinct. Yet the fact that the dodo survived hundreds of years of volcanic activity and climactic changes shows the bird was resilient within its ecosystem.       Some controversy surrounds the date of their extinction. The last widely accepted record of a dodo sighting is the 1662 report by shipwrecked mariner Volkert Evertsz of the Dutch ship  Arnhem , who described birds caught on a small islet off Mauritius, now suggested to be ": null
    },
    {
        "Amber Island": "Islets Of Mauritiusîle Dambre"
    },
    {
        "      The dodos on this islet may not necessarily have been the last members of the species.  The last claimed sighting of a dodo was reported in the hunting records of ": null
    },
    {
        "Isaac Johannes Lamotius": "Isaac Johannes Lamotius"
    },
    {
        " in 1688. Statistical analysis of these records by Roberts and Solow gives a new estimated extinction date of 1693, with a 95% ": null
    },
    {
        "confidence interval": "Confidence Interval"
    },
    {
        " of 1688–1715. The authors also pointed out that because the last sighting before 1662 was in 1638, the dodo was probably already quite rare by the 1660s, and thus a disputed report from 1674 by an escaped slave cannot be dismissed out of hand.     Cheke pointed out that some descriptions after 1662 use the names Dodo and Dodaers when referring to the red rail, indicating that they had been transferred to it after the disappearance of the dodo itself.  Cheke therefore points to the 1662 description as the last credible observation. A 1668 account by English traveller John Marshall, who used the names Dodo and Red Hen interchangeably for the red rail, mentioned that the meat was hard , which echoes the description of the meat in the 1681 account. Even the 1662 account has been questioned by the writer ": null
    },
    {
        "Errol Fuller": "Errol Fuller"
    },
    {
        ", as the reaction to distress cries matches what was described for the red rail. Until this explanation was proposed, a description of dodos from 1681 was thought to be the last account, and that date still has proponents.  Recently accessible Dutch manuscripts indicate that no dodos were seen by settlers in 1664–1674.  It is unlikely the issue will ever be resolved, unless late reports mentioning the name alongside a physical description are rediscovered. The ": null
    },
    {
        "IUCN Red List": "Iucn Red List"
    },
    {
        " accepts Chekes rationale for choosing the 1662 date, taking all subsequent reports to refer to red rails. In any case, the dodo was probably extinct by 1700, about a century after its discovery in 1598. The Dutch left Mauritius in 1710, but by then the dodo and most of the large terrestrial vertebrates there had become extinct.     Even though the rareness of the dodo was reported already in the 17th century, its extinction was not recognised until the 19th century. This was partly because, for religious reasons, extinction was not believed possible until later proved so by ": null
    },
    {
        "Georges Cuvier": "Georges Cuvier"
    },
    {
        ", and partly because many scientists doubted that the dodo had ever existed. It seemed altogether too strange a creature, and many believed it a myth. The bird was first used as an example of human-induced extinction in Penny Magazine in 1833, and has since been referred to as an icon of extinction.              The only extant remains of dodos taken to Europe in the 17th century are a dried head and foot in the ": null
    },
    {
        "Oxford University Museum of Natural History": "Oxford University Museum Of Natural History"
    },
    {
        ", a foot once housed in the British Museum but now lost, a skull in the ": null
    },
    {
        "University of Copenhagen Zoological Museum": "University Of Copenhagen Zoological Museum"
    },
    {
        ", and an upper jaw in the ": null
    },
    {
        "National Museum, Prague": "National Museum, Prague"
    },
    {
        ". The last two were rediscovered and identified as dodo remains in the mid-19th century. Several stuffed dodos were also mentioned in old museum inventories, but none are known to have survived. Apart from these remains, a dried foot, which belonged to the Dutch professor Pieter Pauw, was mentioned by Carolus Clusius in 1605. Its provenance is unknown, and it is now lost, but it may have been collected during the Van Neck voyage.     The only known soft tissue remains, the Oxford head and foot, belonged to the last known stuffed dodo, which was first mentioned as part of the ": null
    },
    {
        "Tradescant collection": "Tradescant Collection"
    },
    {
        " in 1656 and was moved to the ": null
    },
    {
        "Ashmolean Museum": "Ashmolean Museum"
    },
    {
        " in 1659. It has been suggested that this might be the remains of the bird that Hamon LEstrange saw in London, the bird sent by Emanuel Altham, or a donation by Thomas Herbert. Since the remains do not show signs of having been mounted, the specimen might instead have been preserved as a ": null
    },
    {
        "study skin": "Study Skin"
    },
    {
        ".  In 2018, it was reported that scans of the Oxford dodos head showed that its skin and bone contained ": null
    },
    {
        "lead shot": "Lead Shot"
    },
    {
        ", pellets which were used to hunt birds in the 17th century. This indicates that the Oxford dodo was shot either before being transported to Britain, or some time after arriving. The circumstances of its killing are unknown, and the pellets are to be examined to identify where the lead was mined from.       Many sources state that the Ashmolean Museum burned the stuffed dodo around 1755 because of severe decay, saving only the head and leg. Statute 8 of the museum states That as any particular grows old and perishing the keeper may remove it into one of the closets or other repository; and some other to be substituted.  The deliberate destruction of the specimen is now believed to be a myth; it was removed from exhibition to preserve what remained of it. This remaining soft tissue has since degraded further; the head was dissected by Strickland and Melville, separating the skin from the skull in two halves. The foot is in a skeletal state, with only scraps of skin and ": null
    },
    {
        "tendon": "Tendon"
    },
    {
        "s. Very few feathers remain on the head. It is probably a female, as the foot is 11% smaller and more gracile than the London foot, yet appears to be fully grown. The specimen was exhibited at the Oxford museum from at least the 1860s and until 1998, where-after it was mainly kept in storage to prevent damage.  Casts of the head can today be found in many museums worldwide.      The dried London foot, first mentioned in 1665, and transferred to the British Museum in the 18th century, was displayed next to Saverys Edwardss Dodo painting until the 1840s, and it too was dissected by Strickland and Melville. It was not posed in a standing posture, which suggests that it was severed from a fresh specimen, not a mounted one. By 1896 it was mentioned as being without its ": null
    },
    {
        "integument": "Integument"
    },
    {
        "s, and only the bones are believed to remain today, though its present whereabouts are unknown.     The Copenhagen skull is known to have been part of the collection of Bernardus Paludanus in ": null
    },
    {
        "Enkhuizen": "Enkhuizen"
    },
    {
        " until 1651, when it was moved to the museum in ": null
    },
    {
        "Gottorf Castle": "Gottorf Castle"
    },
    {
        ", ": null
    },
    {
        "Schleswig": "Schleswig"
    },
    {
        ". After the castle was occupied by Danish forces in 1702, the museum collection was assimilated into the Royal Danish collection. The skull was rediscovered by J. T. Reinhardt in 1840. Based on its history, it may be the oldest known surviving remains of a dodo brought to Europe in the 17th century. It is  shorter than the Oxford skull, and may have belonged to a female. It was ": null
    },
    {
        "mummified": "Mummified"
    },
    {
        ", but the skin has perished.     The front part of a skull in the National Museum of Prague was found in 1850 among the remains of the Böhmisches Museum. Other elements supposedly belonging to this specimen have been listed in the literature, but it appears only the partial skull was ever present .   It may be what remains of one of the stuffed dodos known to have been at the menagerie of Emperor Rudolph II, possibly the specimen painted by Hoefnagel or Savery there.          Until 1860, the only known dodo remains were the four incomplete 17th-century specimens. ": null
    },
    {
        "Philip Burnard Ayres": "Philip Burnard Ayres"
    },
    {
        " found the first subfossil bones in 1860, which were sent to Richard Owen at the British Museum, who did not publish the findings. In 1863, Owen requested the Mauritian ": null
    },
    {
        "Bishop": "Bishop"
    },
    {
        " Vincent Ryan": "Vincent Ryan"
    },
    {
        " to spread word that he should be informed if any dodo bones were found. In 1865, George Clark, the government ": null
    },
    {
        "schoolmaster": "Schoolmaster"
    },
    {
        " at ": null
    },
    {
        "Mahébourg": "Mahébourg"
    },
    {
        ", finally found an abundance of subfossil dodo bones in the swamp of Mare aux Songes in Southern Mauritius, after a 30-year search inspired by Strickland and Melvilles monograph. In 1866, Clark explained his procedure to  The Ibis , an ornithology journal: he had sent his ": null
    },
    {
        "coolies": "Coolies"
    },
    {
        " to wade through the centre of the swamp, feeling for bones with their feet. At first they found few bones, until they cut away herbage that covered the deepest part of the swamp, where they found many fossils. The swamp yielded the remains of over 300 dodos, but very few skull and wing bones, possibly because the upper bodies were washed away or scavenged while the lower body was trapped. The situation is similar to many finds of ": null
    },
    {
        "moa": "Moa"
    },
    {
        " remains in ": null
    },
    {
        "New Zealand": "New Zealand"
    },
    {
        " marshes. Most dodo remains from the Mare aux Songes have a medium to dark brown colouration.     Clarks reports about the finds rekindled interest in the bird. Sir Richard Owen and ": null
    },
    {
        "Alfred Newton": "Alfred Newton"
    },
    {
        " both wanted to be first to describe the ": null
    },
    {
        "post-cranial": "Post-Cranial"
    },
    {
        " anatomy of the dodo, and Owen bought a shipment of dodo bones originally meant for Newton, which led to rivalry between the two. Owen described the bones in Memoir on the Dodo in October 1866, but erroneously based his reconstruction on the Edwardss Dodo painting by Savery, making it too squat and obese. In 1869 he received more bones and corrected its stance, making it more upright. Newton moved his focus to the Réunion solitaire instead. The remaining bones not sold to Owen or Newton were auctioned off or donated to museums. In 1889, Théodor Sauzier was commissioned to explore the historical souvenirs of Mauritius and find more dodo remains in the Mare aux Songes. He was successful, and also found remains of other extinct species.      In 2005, after a hundred years of neglect, a part of the Mare aux Songes swamp was excavated by an international team of researchers . To prevent ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        ", the British had covered the swamp with ": null
    },
    {
        "hard core": "Stone Foundation"
    },
    {
        " during their rule over Mauritius, which had to be removed. Many remains were found, including bones of at least 17 dodos in various stages of maturity , and several bones obviously from the skeleton of one individual bird, which have been preserved in their natural position. These findings were made public in December 2005 in the ": null
    },
    {
        "Naturalis": "Naturalis"
    },
    {
        " museum in ": null
    },
    {
        "Leiden": "Leiden"
    },
    {
        ". 63% of the fossils found in the swamp belonged to turtles of the extinct genus Cylindraspis, and 7.1% belonged to dodos, which had been deposited within several centuries, 4,000 years ago. Subsequent excavations suggested that dodos and other animals became mired in the Mare aux Songes while trying to reach water during a long period of severe drought about 4,200 years ago. Furthermore, ": null
    },
    {
        "cyanobacteria": "Cyanobacteria"
    },
    {
        " thrived in the conditions created by the excrements of animals gathered around the swamp, which died of intoxication, dehydration, trampling, and miring.  Though many small skeletal elements were found during the recent excavations of the swamp, few were found during the 19th century, probably owing to the employment of less refined methods when collecting.     Louis Etienne Thirioux, an amateur naturalist at Port Louis, also found many dodo remains around 1900 from several locations. They included the first articulated specimen, which is the first subfossil dodo skeleton found outside the Mare aux Songes, and the only remains of a juvenile specimen, a now lost ": null
    },
    {
        "tarsometatarsus": "Tarsometatarsus"
    },
    {
        ". The former specimen was found in 1904 in a cave near ": null
    },
    {
        "Le Pouce": "Le Pouce"
    },
    {
        " mountain, and is the only known complete skeleton of an individual dodo. Thirioux donated the specimen to the Museum Desjardins . Thriouxs heirs sold a second mounted composite skeleton to the ": null
    },
    {
        "Durban Museum of Natural Science": "Durban Museum Of Natural Science"
    },
    {
        " in South Africa in 1918. Together, these two skeletons represent the most completely known dodo remains, including bone elements previously unrecorded . Though some contemporary writers noted the importance of Thriouxs specimens, they were not scientifically studied, and were largely forgotten until 2011, when sought out by a group of researchers. The mounted skeletons were ": null
    },
    {
        "laser scanned": "Laser Scanned"
    },
    {
        ", from which ": null
    },
    {
        "3-D": "3-D Computer Graphics"
    },
    {
        " models were reconstructed, which became the basis of a 2016 monograph about the ": null
    },
    {
        "osteology": "Osteology"
    },
    {
        " of the dodo.   In 2006, explorers discovered a complete skeleton of a dodo in a lava cave in Mauritius. This was only the second associated skeleton of an individual specimen ever found, and the only one in recent times.       Worldwide, 26 museums have significant holdings of dodo material, almost all found in the Mare aux Songes. The Natural History Museum, ": null
    },
    {
        "American Museum of Natural History": "American Museum Of Natural History"
    },
    {
        ", ": null
    },
    {
        "Cambridge University Museum of Zoology": "Cambridge University Museum Of Zoology"
    },
    {
        ", the ": null
    },
    {
        "Senckenberg Museum": "Senckenberg Museum"
    },
    {
        ", and others have almost complete skeletons, assembled from the dissociated subfossil remains of several individuals. In 2011, a wooden box containing dodo bones from the ": null
    },
    {
        "Edwardian era": "Edwardian Era"
    },
    {
        " was rediscovered at the ": null
    },
    {
        "Grant Museum": "Grant Museum"
    },
    {
        " at ": null
    },
    {
        "University College London": "University College London"
    },
    {
        " during preparations for a move. They had been stored with crocodile bones until then.             The supposed white dodo of Réunion is now considered an erroneous conjecture based on contemporary reports of the ": null
    },
    {
        "Réunion ibis": "Réunion Ibis"
    },
    {
        " and 17th-century paintings of white, dodo-like birds by ": null
    },
    {
        "Pieter Withoos": "Pieter Withoos"
    },
    {
        " and ": null
    },
    {
        "Pieter Holsteyn": "Pieter Holsteyn Ii"
    },
    {
        " that surfaced in the 19th century. The confusion began when ": null
    },
    {
        "Willem Ysbrandtszoon Bontekoe": "Willem Ysbrandtsz. Bontekoe"
    },
    {
        ", who visited Réunion around 1619, mentioned fat, flightless birds that he referred to as Dod-eersen in his journal, though without mentioning their colouration. When the journal was published in 1646, it was accompanied by an engraving of a dodo from Saverys Crocker Art Gallery sketch . A white, stocky, and flightless bird was first mentioned as part of the Réunion fauna by Chief Officer J. Tatton in 1625. Sporadic mentions were subsequently made by ": null
    },
    {
        "Sieur Dubois": "Sieur Dubois"
    },
    {
        " and other contemporary writers.     Baron ": null
    },
    {
        "Edmond de Sélys Longchamps": "Edmond De Sélys Longchamps"
    },
    {
        " coined the name Raphus solitarius for these birds in 1848, as he believed the accounts referred to a species of dodo. When 17th-century paintings of white dodos were discovered by 19th-century naturalists, it was assumed they depicted these birds. Oudemans suggested that the discrepancy between the paintings and the old descriptions was that the paintings showed females, and that the species was therefore sexually dimorphic. Some authors also believed the birds described were of a species similar to the Rodrigues solitaire, as it was referred to by the same name, or even that there were white species of both dodo and solitaire on the island.      The Pieter Withoos painting, which was discovered first, appears to be based on an earlier painting by Pieter Holsteyn, three versions of which are known to have existed. According to Hume, Cheke, and Valledor de Lozoya, it appears that all depictions of white dodos were based on Roelant Saverys painting Landscape with Orpheus and the animals, or on copies of it. The painting has generally been dated to 1611, though a post-1614, or even post-1626, date has also been proposed. The painting shows a whitish specimen and was apparently based on a stuffed specimen then in Prague; a walghvogel described as having a dirty off-white colouring was mentioned in an inventory of specimens in the Prague collection of the ": null
    },
    {
        "Holy Roman Emperor Rudolf II": "Rudolf Ii, Holy Roman Emperor"
    },
    {
        ", to whom Savery was contracted at the time . Saverys several later images all show greyish birds, possibly because he had by then seen another specimen. Cheke and Hume believe the painted specimen was white, owing to ": null
    },
    {
        "albinism": "Albinism"
    },
    {
        ". Valledor de Lozoya has instead suggested that the light plumage was a juvenile trait, a result of bleaching of old taxidermy specimens, or simply artistic license.     In 1987, scientists described fossils of a recently extinct species of ": null
    },
    {
        "ibis": "Ibis"
    },
    {
        " from Réunion with a relatively short beak, Borbonibis latipes, before a connection to the solitaire reports had been made. Cheke suggested to one of the authors, Francois Moutou, that the fossils may have been of the Réunion solitaire, and this suggestion was published in 1995. The ibis was reassigned to the genus  Threskiornis , now combined with the ": null
    },
    {
        "specific epithet": "Specific Name"
    },
    {
        "  from the ": null
    },
    {
        "binomial": "Binomial Nomenclature"
    },
    {
        " R. solitarius. Birds of this genus are also white and black with slender beaks, fitting the old descriptions of the Réunion solitaire. No fossil remains of dodo-like birds have ever been found on the island.          The dodos significance as one of the best-known extinct animals and its singular appearance led to its use in literature and popular culture as a symbol of an outdated concept or object, as in the expression ": null
    },
    {
        "dead as a dodo": "Wikt:Dead As A Dodo"
    },
    {
        ", which has come to mean unquestionably dead or obsolete. Similarly, the phrase ": null
    },
    {
        "to go the way of the dodo": "Wikt:Go The Way Of The Dodo"
    },
    {
        " means to become extinct or obsolete, to fall out of common usage or practice, or to become a thing of the past. Dodo is also a slang term for a stupid, dull-witted person, as it was supposedly stupid and easily caught.       The dodo appears frequently in works of popular fiction, and even before its extinction, it was featured in European literature, as symbol for exotic lands, and of gluttony, due to its apparent fatness.  In 1865, the same year that George Clark started to publish reports about excavated dodo fossils, the newly vindicated bird was ": null
    },
    {
        "featured as a character": "Dodo"
    },
    {
        " in ": null
    },
    {
        "Lewis Carrolls": "Lewis Carroll"
    },
    {
        "  Alices Adventures in Wonderland . It is thought that he included the dodo because he identified with it and had adopted the name as a nickname for himself because of his stammer, which made him accidentally introduce himself as Do-do-dodgson , his legal surname. Carroll and the girl who served as inspiration for Alice, ": null
    },
    {
        "Alice Liddell": "Alice Liddell"
    },
    {
        ", had enjoyed visiting the Oxford museum to see the dodo remains there. The books popularity made the dodo a well-known icon of extinction.        The dodo is used as a ": null
    },
    {
        "mascot": "Mascot"
    },
    {
        " for many kinds of products, especially in Mauritius. It appears as a ": null
    },
    {
        "supporter": "Supporter"
    },
    {
        " on the ": null
    },
    {
        "coat of arms of Mauritius": "Coat Of Arms Of Mauritius"
    },
    {
        ", on Mauritius coins, is used as a ": null
    },
    {
        "watermark": "Watermark"
    },
    {
        " on all ": null
    },
    {
        "Mauritian rupee": "Mauritian Rupee"
    },
    {
        " banknotes, and features as the background of the Mauritian immigration form.   A smiling dodo is the symbol of the ": null
    },
    {
        "Brasseries de Bourbon": "Brasseries De Bourbon"
    },
    {
        ", a popular brewer on Réunion, whose emblem displays the white species once thought to have lived there.     The dodo is used to promote the protection of ": null
    },
    {
        "endangered species": "Endangered Species"
    },
    {
        " by environmental organisations, such as the ": null
    },
    {
        "Durrell Wildlife Conservation Trust": "Durrell Wildlife Conservation Trust"
    },
    {
        " and the ": null
    },
    {
        "Durrell Wildlife Park": "Durrell Wildlife Park"
    },
    {
        ". The ": null
    },
    {
        "Center for Biological Diversity": "Center For Biological Diversity"
    },
    {
        " gives an annual Rubber Dodo Award, to those who have done the most to destroy wild places, species and biological diversity .  In 2011, the ": null
    },
    {
        "nephiline": "Nephilinae"
    },
    {
        " spider  Nephilengys dodo , which inhabits the same woods as the dodo once did, was named after the bird to raise awareness of the urgent need for protection of the Mauritius ": null
    },
    {
        "biota": "Biota"
    },
    {
        ". Two species of ": null
    },
    {
        "ant": "Ant"
    },
    {
        " from Mauritius have been named after the dodo:  Pseudolasius dodo  in 1946 and  Pheidole dodo  in 2013.   A species of ": null
    },
    {
        "isopod": "Isopod"
    },
    {
        " from a ": null
    },
    {
        "coral reef": "Coral Reef"
    },
    {
        " off Réunion was named  Hansenium dodo  in 1991.  The name dodo has been used by scientists naming genetic elements, honoring the dodos flightless nature. A fruitfly gene within a region of a chromosome required for flying ability was named dodo . In addition, a defective ": null
    },
    {
        "transposable element": "Transposable Element"
    },
    {
        " family from  Phytophthora infestans  was named DodoPi as it contained mutations that eliminated the elements ability to jump to new locations in a chromosome.      In 2009, a previously unpublished 17th-century Dutch illustration of a dodo went for sale at ": null
    },
    {
        "Christies": "Christies"
    },
    {
        " and was expected to sell for £6,000. It is unknown whether the illustration was based on a specimen or on a previous image. It sold for £44,450.     The poet ": null
    },
    {
        "Hilaire Belloc": "Hilaire Belloc"
    },
    {
        " included the following poem about the dodo in his  Bad Childs Book of Beasts  from 1896:     ": null
    }
]