[
    {
        "   Dorothy Parker  was an American poet, writer, critic, and ": null
    },
    {
        "satirist": "Satire"
    },
    {
        " based in New York; she was best known for her ": null
    },
    {
        "wit": "Wit"
    },
    {
        ", wisecracks, and eye for 20th-century urban foibles.     From a conflicted and unhappy childhood, Parker rose to acclaim, both for her literary works published in such magazines as  The New Yorker  and as a founding member of the ": null
    },
    {
        "Algonquin Round Table": "Algonquin Round Table"
    },
    {
        ". Following the breakup of the circle, Parker traveled to Hollywood to pursue ": null
    },
    {
        "screenwriting": "Screenwriting"
    },
    {
        ". Her successes there, including two ": null
    },
    {
        "Academy Award": "Academy Awards"
    },
    {
        " nominations, were curtailed when her involvement in ": null
    },
    {
        "left-wing politics": "Left-Wing Politics"
    },
    {
        " resulted in her being placed on the ": null
    },
    {
        "Hollywood blacklist": "Hollywood Blacklist"
    },
    {
        ".     Dismissive of her own talents, she deplored her reputation as a wisecracker . Nevertheless, both her literary output and reputation for sharp wit have endured.       Also known as Dot or Dottie,  Parker was born Dorothy Rothschild in 1893 to Jacob Henry Rothschild and his wife Eliza Annie Meade 6  at 732 Ocean Avenue in ": null
    },
    {
        "Long Branch": "Long Branch, New Jersey"
    },
    {
        ", ": null
    },
    {
        "New Jersey": "New Jersey"
    },
    {
        ".  Her parents had a summer beach cottage there. Parkers mother was of Scottish descent, and her father was of German Jewish descent, son of Sampson Jacob Rothschild , a merchant who immigrated to the USA around 1846 settling in Monroe, AL, and Mary Greissman , both Prussian-born Jewish immigrants. Her father was one of five known siblings: Simon , Samuel , Hannah , and the youngest, Martin Rothschild, born in Manhattan, New York on December 12, 1865, who perished in the sinking of the ": null
    },
    {
        "Titanic": "Titanic"
    },
    {
        ".  Parker wrote in her essay My Hometown that her parents returned to their ": null
    },
    {
        "Manhattan": "Manhattan"
    },
    {
        " apartment shortly after Labor Day so that she could be called a true New Yorker. Her mother died in West End in July 1898, a month before Parkers fifth birthday. Meade 12     Her father remarried in 1900 to Eleanor Frances Lewis . Meade 13 Parker hated her father, whom she accused of physical abuse; and despised her stepmother, whom she refused to call mother , stepmother , or Eleanor , instead referring to her as the housekeeper  – though her biographer ": null
    },
    {
        "Marion Meade": "Marion Meade"
    },
    {
        " refers to this account as largely false , stating that the atmosphere in which Parker was growing up was indulgent, affectionate, supportive and generous Meade, M. . Dorothy Parker: what fresh hell is this? New York: Villard Books. . Parker grew up on the ": null
    },
    {
        "Upper West Side": "Upper West Side"
    },
    {
        " and attended a ": null
    },
    {
        "Roman Catholic": "Roman Catholic"
    },
    {
        " elementary school at the Convent of the Blessed Sacrament on West ": null
    },
    {
        "79th Street": "79Th Street"
    },
    {
        " with her sister, Helen, although their father was ": null
    },
    {
        "Jewish": "Jewish"
    },
    {
        " and her stepmother was ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        ". Meade 14  Parker once joked that she was asked to leave following her characterization of the ": null
    },
    {
        "Immaculate Conception": "Immaculate Conception"
    },
    {
        " as ": null
    },
    {
        "spontaneous combustion": "Spontaneous Combustion"
    },
    {
        " .  Her stepmother died in 1903, when Parker was nine. Meade 16 Parker later attended ": null
    },
    {
        "Miss Danas School": "Miss Danas School For Young Ladies"
    },
    {
        ", a ": null
    },
    {
        "finishing school": "Finishing School"
    },
    {
        " in ": null
    },
    {
        "Morristown, New Jersey": "Morristown, New Jersey"
    },
    {
        ". Meade 27 She graduated from Miss Danas School in 1911, at the age of 18, according to Authur,  though other authors  state she never graduated from either school. Following her fathers death in 1913, she played piano at a dancing school to earn a living  while she worked on her poetry.     She sold her first poem to  Vanity Fair  magazine in 1914 and some months later was hired as an editorial assistant for  Vogue , another ": null
    },
    {
        "Condé Nast": "Condé Nast Publications"
    },
    {
        " magazine. She moved to Vanity Fair as a staff writer after two years at Vogue. Silverstein 13     In 1917, she met and married a ": null
    },
    {
        "Wall Street": "Wall Street"
    },
    {
        " stockbroker": "Stockbroker"
    },
    {
        ", Edwin Pond Parker II Herrmann 78    and they married before he left to serve in ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " with the ": null
    },
    {
        "U.S. Army": "U.S. Army"
    },
    {
        "4th Division. Dorothy Parker filed for divorce in 1928. He later remarried, to Anne E. O’Brien, formerly probation officer of the Juvenile Court and died at 39, from an overdose of a sleeping powder for pain following a dental procedure.  Courant, Hartford, Connecticut, January 8, 1933, Sun. Page 6 Dorothy Parker retained her married name, though she remarried the screenwriter and former actor ": null
    },
    {
        "Alan Campbell": "Alan Campbell"
    },
    {
        ", and moved to Hollywood.             Parkers career took off in 1918 while she was writing theater criticism for Vanity Fair, filling in for the vacationing ": null
    },
    {
        "P. G. Wodehouse": "P. G. Wodehouse"
    },
    {
        ". Silverstein 18 At the magazine, she met ": null
    },
    {
        "Robert Benchley": "Robert Benchley"
    },
    {
        ", who became a close friend, and ": null
    },
    {
        "Robert E. Sherwood": "Robert E. Sherwood"
    },
    {
        ".  The trio began lunching at the ": null
    },
    {
        "Algonquin Hotel": "Algonquin Hotel"
    },
    {
        " on a near-daily basis and became founding members of what became known as the ": null
    },
    {
        "Algonquin Round Table": "Algonquin Round Table"
    },
    {
        ". The Round Table numbered among its members the newspaper columnists ": null
    },
    {
        "Franklin Pierce Adams": "Franklin Pierce Adams"
    },
    {
        " and ": null
    },
    {
        "Alexander Woollcott": "Alexander Woollcott"
    },
    {
        ". Through their publication of Parkers lunchtime remarks and short verses, particularly in Adams column The Conning Tower , Dorothy began developing a national reputation as a wit. When the group was informed that famously taciturn former president ": null
    },
    {
        "Calvin Coolidge": "Calvin Coolidge"
    },
    {
        " had died, Parker remarked, How could they tell?      Parkers caustic wit as a critic initially proved popular, but she was eventually dismissed by Vanity Fair in 1920 after her criticisms too often offended powerful producers. In solidarity, both Benchley and Sherwood resigned in protest. Altman 156–8 She soon started working for  Ainslees Magazine , which had a higher circulation. She also published pieces in Vanity Fair, which was happier to publish her than employ her, The Smart Set, and The American Mercury, but also in the popular Ladies’ Home Journal, Saturday Evening Post, and Life.      When ": null
    },
    {
        "Harold Ross": "Harold Ross"
    },
    {
        " founded  The New Yorker  in 1925, Parker and Benchley were part of a board of editors established by Ross to allay concerns of his investors. Parkers first piece for the magazine was published in its second issue. Silverstein 32 Parker became famous for her short, viciously humorous poems, many highlighting ludicrous aspects of her many romantic affairs and others wistfully considering the appeal of suicide.     The next 15 years were Parkers greatest period of productivity and success. In the 1920s alone she published some 300 poems and free verses in Vanity Fair, Vogue, The Conning Tower and The New Yorker as well as  Life ,  McCalls  and  The New Republic . Silverstein 62–3      Parker published her first volume of poetry, Enough Rope, in 1926. The collection sold 47,000 copies Silverstein 35 and garnered impressive reviews.  The Nation  described her verse as caked with a salty humor, rough with splinters of disillusion, and tarred with a bright black authenticity . Meade 177 Although some critics, notably  The New York Times  reviewer, dismissed her work as ": null
    },
    {
        "flapper": "Flapper"
    },
    {
        " verse , Meade 178 the volume helped affirm Parkers reputation for sparkling wit. Parker released two more volumes of verse, Sunset Gun and Death and Taxes , along with the short story collections Laments for the Living and After Such Pleasures . Not So Deep as a Well collected much of the material previously published in Rope, Gun, and Death and she re-released her fiction with a few new pieces in 1939 under the title Here Lies.     She collaborated with playwright ": null
    },
    {
        "Elmer Rice": "Elmer Rice"
    },
    {
        " to create Close Harmony, which ran on Broadway in December 1924. The play was well received in out-of-town previews and was favorably reviewed in New York but it closed after a run of just 24 performances. It did become a successful touring production under the title The Lady Next Door. Meade 138     Some of Parkers most popular work was published in The New Yorker in the form of acerbic book reviews under the byline Constant Reader . Her response to the whimsy of ": null
    },
    {
        "A. A. Milnes": "A. A. Milne"
    },
    {
        "  The House at Pooh Corner  was Tonstant Weader fwowed up .  Her reviews appeared semi-regularly from 1927 to 1933, Silverstein 38 were widely read, and were later published in a collection under the name Constant Reader in 1970.     Her best-known short story, Big Blonde , published in  The Bookman  magazine, was awarded the ": null
    },
    {
        "O. Henry Award": "O. Henry Award"
    },
    {
        " as the best short story of 1929. Herrmann 74 Her short stories, though often witty, were also spare and incisive, and more bittersweet than comic; her style is often described as sardonic.      Parker eventually separated from her husband, divorcing in 1928. She had a number of affairs, her lovers including reporter-turned-playwright ": null
    },
    {
        "Charles MacArthur": "Charles Macarthur"
    },
    {
        " and the publisher ": null
    },
    {
        "Seward Collins": "Seward Collins"
    },
    {
        ". Her relationship with MacArthur resulted in a pregnancy. Parker is alleged to have said, how like me, to put all my eggs into one bastard . Meade 105 She had an abortion, and fell into a depression that culminated in her first attempt at suicide. Silverstein 29     Toward the end of this period, Parker began to become more politically aware and active. What would become a lifelong commitment to activism began in 1927 when she became concerned about the pending executions of ": null
    },
    {
        "Sacco and Vanzetti": "Sacco And Vanzetti"
    },
    {
        ". Parker traveled to ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " to protest the proceedings. She and fellow Round Tabler ": null
    },
    {
        "Ruth Hale": "Ruth Hale"
    },
    {
        " were arrested, and Parker eventually pleaded guilty to a charge of loitering and sauntering , paying a $5 fine. Silverstein 44       In 1932 Parker met ": null
    },
    {
        "Alan Campbell": "Alan Campbell"
    },
    {
        ", Meade 238 an actor with aspirations to become a screenwriter. They married two years later in Raton, New Mexico. Campbells mixed parentage was the reverse of Parkers: he had a German-Jewish mother and a Scottish father. She learned that he was ": null
    },
    {
        "bisexual": "Bisexual"
    },
    {
        " and later proclaimed in public that he was ": null
    },
    {
        "queer": "Queer"
    },
    {
        " as a billy goat .  The pair moved to Hollywood and signed ten-week contracts with ": null
    },
    {
        "Paramount Pictures": "Paramount Pictures"
    },
    {
        ", with Campbell earning $250 per week and Parker earning $1,000 per week. They would eventually earn $2,000 and in some instances upwards of $5,000 per week as freelancers for various studios. Silverstein 40 She and Campbell worked on more than 15 films.      In 1936, Parker contributed lyrics for the song ": null
    },
    {
        "I Wished on the Moon": "I Wished On The Moon"
    },
    {
        " , with music by ": null
    },
    {
        "Ralph Rainger": "Ralph Rainger"
    },
    {
        ". The song was introduced in  The Big Broadcast of 1936  by ": null
    },
    {
        "Bing Crosby": "Bing Crosby"
    },
    {
        ".      With Campbell and ": null
    },
    {
        "Robert Carson": "Robert Carson"
    },
    {
        ", she wrote the script for the 1937 film  A Star Is Born , for which they were nominated for an ": null
    },
    {
        "Academy Award": "Academy Awards"
    },
    {
        " for Best Writing—Screenplay. She wrote additional dialogue for  The Little Foxes  in 1941. Together with Frank Cavett, she received a nomination for an Oscar for the screenplay of  Smash-Up, the Story of a Woman  , starring ": null
    },
    {
        "Susan Hayward": "Susan Hayward"
    },
    {
        ".     After the United States entered the Second World War, Parker and ": null
    },
    {
        "Alexander Woollcott": "Alexander Woollcott"
    },
    {
        " collaborated to produce an anthology of her work as part of a series published by ": null
    },
    {
        "Viking Press": "Viking Press"
    },
    {
        " for servicemen stationed overseas. With an introduction by ": null
    },
    {
        "W. Somerset Maugham": "W. Somerset Maugham"
    },
    {
        ", Meade 318 the volume compiled over two dozen of Parkers short stories, along with selected poems from Enough Rope, Sunset Gun, and Death and Taxes. It was published in the United States in 1944 under the title The Portable Dorothy Parker. Hers is one of three Portable series, including volumes devoted to ": null
    },
    {
        "William Shakespeare": "William Shakespeare"
    },
    {
        " and The Bible, that have remained in continuous print.      During the 1930s and 1940s, Parker became an increasingly vocal advocate of civil liberties and civil rights, and a frequent critic of authority figures. During the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        ", she was among numerous American intellectuals and artists who became involved in related social movements. She reported in 1937 on the ": null
    },
    {
        "Loyalist cause in Spain": "Republican Faction"
    },
    {
        " for the Communist magazine,  The New Masses . Meade 285 At the behest of ": null
    },
    {
        "Otto Katz": "Otto Katz"
    },
    {
        ", a covert Soviet Comintern agent and operative of German Communist Party agent ": null
    },
    {
        "Willi Münzenberg": "Willi Münzenberg"
    },
    {
        ", Parker helped to found the ": null
    },
    {
        "Hollywood Anti-Nazi League": "Hollywood Anti-Nazi League"
    },
    {
        " in 1936, which the FBI suspected of being a Communist Party front. Koch, Stephen, Double Lives: Stalin, Willi Munzenberg and the Seduction of the Intellectuals, New York: Enigma Books , Revised Edition,  The Hollywood Anti-Nazi Leagues membership eventually grew to some 4,000 strong. According to ": null
    },
    {
        "David Caute": "David Caute"
    },
    {
        ", its often wealthy members were able to contribute as much to Party funds as the whole American working class , although they may not have been intending to support the Party cause. Caute, David, The Fellow Travellers: Intellectual Friends of Communism, New Haven: Yale University Press ,       Parker also served as chair of the ": null
    },
    {
        "Joint Anti-Fascist Refugee Committees": "Joint Anti-Fascist Refugee Committee"
    },
    {
        " fundraising arm, Spanish Refugee Appeal . She organized Project Rescue Ship to transport Loyalist veterans to Mexico, headed Spanish Childrens Relief, and lent her name to many other left-wing causes and organizations.  Her former Round Table friends saw less and less of her, and her relationship with Robert Benchley became particularly strained . Altman 314 Parker met ": null
    },
    {
        "S. J. Perelman": "S. J. Perelman"
    },
    {
        " at a party in 1932 and, despite a rocky start , Perelman 171 they remained friends for the next 35 years. They became neighbors when the Perelmans helped Parker and Campbell buy a run-down farm in ": null
    },
    {
        "Bucks County, Pennsylvania": "Bucks County, Pennsylvania"
    },
    {
        ", near ": null
    },
    {
        "New Hope": "New Hope, Pennsylvania"
    },
    {
        ", a popular summer destination among many writers and artists from New York.     Parker was listed as a ": null
    },
    {
        "Communist": "Communist"
    },
    {
        " by the publication  Red Channels  in 1950.  The ": null
    },
    {
        "FBI": "Fbi"
    },
    {
        " compiled a 1,000-page dossier on her because of her suspected involvement in Communism during the era when Senator ": null
    },
    {
        "Joseph McCarthy": "Joseph Mccarthy"
    },
    {
        " was raising alarms about communists in government and Hollywood.  As a result, movie studio bosses placed her on the ": null
    },
    {
        "Hollywood blacklist": "Hollywood Blacklist"
    },
    {
        ". Her final screenplay was  The Fan , a 1949 adaptation of ": null
    },
    {
        "Oscar Wildes": "Oscar Wilde"
    },
    {
        "  Lady Windermeres Fan , directed by ": null
    },
    {
        "Otto Preminger": "Otto Preminger"
    },
    {
        ".     Her marriage to Campbell was tempestuous, with tensions exacerbated by Parkers increasing alcohol consumption and Campbells long-term affair with a married woman in Europe during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ". Meade 327 They divorced in 1947, Meade 329 remarried in 1950, Meade 339 then separated in 1952 when Parker moved back to New York.  From 1957 to 1962, she lived at the Volney Residential Hotel on Manhattans Upper East Side and wrote book reviews for  Esquire magazine .  Her writing became increasingly erratic due to her continued abuse of alcohol. She returned to Hollywood in 1961, reconciled with Campbell, and collaborated with him on a number of unproduced projects until Campbell died from a drug overdose in 1963. Meade 392–3       Following Campbells death, Parker returned to New York City and the Volney Residential hotel. In her later years, she denigrated the Algonquin Round Table, although it had brought her such early notoriety:        Parker occasionally participated in radio programs, including  Information Please  and Author, Author . She wrote for the  Columbia Workshop , and both ": null
    },
    {
        "Ilka Chase": "Ilka Chase"
    },
    {
        " and ": null
    },
    {
        "Tallulah Bankhead": "Tallulah Bankhead"
    },
    {
        " used her material for radio monologues.      Parker died on June 7, 1967, of a ": null
    },
    {
        "heart attack": "Myocardial Infarction"
    },
    {
        " at the age of 73. In her will, she bequeathed her estate to ": null
    },
    {
        "Martin Luther King Jr.": "Martin Luther King Jr."
    },
    {
        " Following Kings death, her estate was bequeathed by his family to the ": null
    },
    {
        "NAACP": "Naacp"
    },
    {
        ". Silverstein 59. Her ": null
    },
    {
        "executor": "Executor"
    },
    {
        ", ": null
    },
    {
        "Lillian Hellman": "Lillian Hellman"
    },
    {
        ", bitterly but unsuccessfully contested this disposition. Meade 413. Her ashes remained unclaimed in various places, including her attorney ": null
    },
    {
        "Paul ODwyers": "Paul Odwyer"
    },
    {
        " filing cabinet, for approximately 17 years. Meade 412.       In 1988, the NAACP claimed Parkers remains and designed a memorial garden for them outside its Baltimore headquarters. Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 . McFarland & Company, Inc., Publishers. Kindle Edition. The plaque reads,           On August 22, 1992, the 99th anniversary of Parkers birth, the ": null
    },
    {
        "United States Postal Service": "United States Postal Service"
    },
    {
        " issued a 29¢ U.S. commemorative ": null
    },
    {
        "postage stamp": "Postage Stamp"
    },
    {
        " in the Literary Arts series. The Algonquin Round Table, as well as the number of other literary and theatrical greats who lodged at the hotel, contributed to the Algonquin Hotel being designated in 1987 as a New York City Historic Landmark.  In 1996, the hotel was designated as a National Literary Landmark by the ": null
    },
    {
        "Friends of Libraries": "Friends Of Libraries"
    },
    {
        " USA, based on the contributions of Parker and other members of the Round Table. The organizations bronze plaque is attached to the front of the hotel.  Parkers birthplace at the Jersey Shore was also designated a National Literary Landmark by Friends of Libraries USA in 2005  and a bronze plaque marks the former site of her family house.      In 2014, Parker was elected to the ": null
    },
    {
        "New Jersey Hall of Fame": "New Jersey Hall Of Fame"
    },
    {
        ".       Parker inspired a number of fictional characters in several plays of her day. These included Lily Malone in ": null
    },
    {
        "Philip Barrys": "Philip Barry"
    },
    {
        " Hotel Universe , Mary Hilliard  in George Oppenheimers Here Today , Paula Wharton in Gordons 1944 play  Over Twenty-one  , and Julia Glenn in the Kaufman-": null
    },
    {
        "Moss Hart": "Moss Hart"
    },
    {
        " collaboration  Merrily We Roll Along  . Kaufmans representation of her in Merrily We Roll Along led Parker, once his Round Table compatriot, to despise him. Meade 241 She also was portrayed as Daisy Lester in ": null
    },
    {
        "Charles Bracketts": "Charles Brackett"
    },
    {
        " 1934 novel Entirely Surrounded. Silverstein 10–11 She is mentioned in the original introductory lyrics in ": null
    },
    {
        "Cole Porters": "Cole Porter"
    },
    {
        " song ": null
    },
    {
        "Just One of Those Things": "Just One Of Those Things"
    },
    {
        " from the 1935 ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        " musical ": null
    },
    {
        "Jubilee": "Jubilee"
    },
    {
        ", which have been retained in the standard interpretation of the song as part of the ": null
    },
    {
        "Great American Songbook": "Great American Songbook"
    },
    {
        ".     Parker is featured as a character in the novel The Dorothy Parker Murder Case by ": null
    },
    {
        "George Baxt": "George Baxt"
    },
    {
        " , in a series of Algonquin Round Table Mysteries by J.J. Murphy , and in Ellen Meisters novel Farewell, Dorothy Parker . Meister, Ellen Farewell, Dorothy Parker. Putnam Adult.  She is the main character in Love For Miss Dottie , a short story by Larry N Mayer, which was selected by writer ": null
    },
    {
        "Mary Gaitskill": "Mary Gaitskill"
    },
    {
        " for the collection Best New American Voices 2009 .     She has been portrayed on film and television by ": null
    },
    {
        "Dolores Sutton": "Dolores Sutton"
    },
    {
        " in F. Scott Fitzgerald in Hollywood , ": null
    },
    {
        "Rosemary Murphy": "Rosemary Murphy"
    },
    {
        " in  Julia  ,  ": null
    },
    {
        "Bebe Neuwirth": "Bebe Neuwirth"
    },
    {
        " in  Dash and Lilly  , and ": null
    },
    {
        "Jennifer Jason Leigh": "Jennifer Jason Leigh"
    },
    {
        " in  Mrs. Parker and the Vicious Circle  . Neuwirth was nominated for an ": null
    },
    {
        "Emmy Award": "Emmy Award"
    },
    {
        " for her performance, and Leigh received a number of awards and nominations, including a ": null
    },
    {
        "Golden Globe": "Golden Globe"
    },
    {
        " nomination.       Television creator ": null
    },
    {
        "Amy Sherman-Palladino": "Amy Sherman-Palladino"
    },
    {
        " named her production company ": null
    },
    {
        "Dorothy Parker Drank Here Productions": "Dorothy Parker Drank Here Productions"
    },
    {
        " in tribute to Parker.      Tucson actress Lesley Abrams wrote and performed the one-woman show Dorothy Parkers Last Call in 2009 in Tucson, Arizona at the Winding Road Theater Ensemble.  Retrieved July 12, 2014. She reprised the role at the Live Theatre Workshop in Tucson in 2014.  Retrieved July 12, 2014. The play was selected to be part of the Capital Fringe Festival in DC in 2010.  Retrieved July 12, 2014.     In 2014, lyrics taken from her book of poetry Not So Deep as a Well were, with the authorization of the ": null
    },
    {
        "NAACP": "Naacp"
    },
    {
        ",  Retrieved May 21, 2015. used by Canadian singer ": null
    },
    {
        "Myriam Gendron": "Myriam Gendron"
    },
    {
        " to create a ": null
    },
    {
        "folk": "Contemporary Folk Music"
    },
    {
        " album of the same name.  Retrieved May 21, 2015. Also in 2014, ": null
    },
    {
        "Chicago": "Chicago"
    },
    {
        " jazz": "Jazz"
    },
    {
        " bassist/singer/composer ": null
    },
    {
        "Katie Ernst": "Katie Ernst"
    },
    {
        " issued her album Little Words, consisting of her authorized settings of seven of Parkers poems.       In 2018, American drag queen ": null
    },
    {
        "Miz Cracker": "Miz Cracker"
    },
    {
        " played Parker in the celebrity-impersonation game show episode of the ": null
    },
    {
        "Season 10": "Rupauls Drag Race"
    },
    {
        " of  Rupauls Drag Race .              1970 Constant Reader         1930: Laments for the Living       1933: After Such Pleasures       1939: Here Lies: The Collected Stories of Dorothy Parker       1942: Collected Stories     1944: The Portable Dorothy Parker            1926: Enough Rope     1928: Sunset Gun     1931: Death and Taxes     1936: Collected Poems: Not So Deep as a Well     1944: Collected Poetry     1996: The Lost Poems of Dorothy Parker           1929: Close Harmony     1953: Ladies of the Corridor       1949: ": null
    },
    {
        "The Fan": "The Fan"
    },
    {
        "     1942: ": null
    },
    {
        "Saboteur": "Saboteur"
    },
    {
        "     1937: ": null
    },
    {
        "A Star is Born": "A Star Is Born"
    },
    {
        "     1936: ": null
    },
    {
        "Suzy": "Suzy"
    },
    {
        "     1938: ": null
    },
    {
        "Sweethearts": "Sweethearts"
    },
    {
        "     1938: ": null
    },
    {
        "Trade Winds": "Trade Winds"
    },
    {
        "     1941: ": null
    },
    {
        "Week-End for Three": "Week-End For Three"
    },
    {
        "     1947: ": null
    },
    {
        "Smash-Up, the Story of a Woman": "Smash-Up, The Story Of A Woman"
    }
]