[
    {
        "   The Dumnonii or Dumnones were a ": null
    },
    {
        "British": "Britons"
    },
    {
        " tribe": "List Of Ancient Celtic Peoples And Tribes"
    },
    {
        " who inhabited ": null
    },
    {
        "Dumnonia": "Dumnonia"
    },
    {
        ", the area now known as ": null
    },
    {
        "Devon": "Devon"
    },
    {
        " and ": null
    },
    {
        "Cornwall": "Cornwall"
    },
    {
        "  in the further parts of the ": null
    },
    {
        "South West": "West Country"
    },
    {
        " peninsula of Britain, from at least the ": null
    },
    {
        "Iron Age": "British Iron Age"
    },
    {
        " up to the early ": null
    },
    {
        "Saxon": "Saxons"
    },
    {
        " period. They were bordered to the east by the ": null
    },
    {
        "Durotriges": "Durotriges"
    },
    {
        " tribe.       ": null
    },
    {
        "William Camden": "William Camden"
    },
    {
        ", in his 1607 edition of Britannia, describes ": null
    },
    {
        "Cornwall": "Cornwall"
    },
    {
        " and ": null
    },
    {
        "Devon": "Devon"
    },
    {
        " as being two parts of the same country which:        Camden had learnt some ": null
    },
    {
        "Welsh": "Welsh Language"
    },
    {
        " during the course of his studies and it would appear that he is the origin of the interpretation of Dumnonii as deep valley dwellers from his understanding of the Welsh of his time. ": null
    },
    {
        "John Rhys": "John Rhys"
    },
    {
        " later theorized that the tribal name was derived from the name of a goddess, Domnu, probably meaning the goddess of the deep . Rhys, John Lectures on the origin and growth of religion as illustrated by Celtic heathendom. London: Williams and Norgate; p. 597 The ": null
    },
    {
        "proto-Celtic": "Proto-Celtic Language"
    },
    {
        " root dubno- or dumno- meaning the deep or the earth  appears in personal names such as ": null
    },
    {
        "Dumnorix": "Dumnorix"
    },
    {
        " and ": null
    },
    {
        "Dubnovellaunus": "Dubnovellaunus"
    },
    {
        ". Another group with a similar name but with no known links were the ": null
    },
    {
        "Fir Domnann": "Fir Domnann"
    },
    {
        " of ": null
    },
    {
        "Connacht": "Connacht"
    },
    {
        ".     The Roman name of the town of ": null
    },
    {
        "Exeter": "Exeter"
    },
    {
        ",  Isca Dumnoniorum  , contains the root iska- water for Water of the Dumnonii . The Latin name suggests that the city was already an  oppidum , or walled town, on the banks on the ": null
    },
    {
        "River Exe": "River Exe"
    },
    {
        " before the foundation of the Roman city, in about AD 50. The Dumnonii gave their name to the English county of ": null
    },
    {
        "Devon": "Devon"
    },
    {
        ", and their name is represented in Britains two extant ": null
    },
    {
        "Brythonic languages": "Brythonic Languages"
    },
    {
        " as Dewnans in ": null
    },
    {
        "Cornish": "Cornish Language"
    },
    {
        " and Dyfnaint in ": null
    },
    {
        "Welsh": "Welsh Language"
    },
    {
        ". ": null
    },
    {
        "Amédée Thierry": "Amedée Simon Dominique Thierry"
    },
    {
        " , one of the inventors of the historic race of Gauls, could confidently equate them with the ": null
    },
    {
        "Cornish": "Cornish People"
    },
    {
        " .     Victorian historians often referred to the tribe as the ": null
    },
    {
        "Damnonii": "Damnonii"
    },
    {
        ", which is also the name of another people from lowland Scotland, although there are no known links between the two populations.       The people of Dumnonia spoke a ": null
    },
    {
        "Southwestern Brythonic": "Southwestern Brythonic"
    },
    {
        " dialect similar to the forerunner of more recent ": null
    },
    {
        "Cornish": "Cornish Language"
    },
    {
        " and ": null
    },
    {
        "Breton": "Breton Language"
    },
    {
        ". ": null
    },
    {
        "Irish": "Irish People"
    },
    {
        " immigrants, the ": null
    },
    {
        "Déisi": "Déisi"
    },
    {
        ", ": null
    },
    {
        "Thomas, Charles": "Charles Thomas"
    },
    {
        "  And Shall These Mute Stones Speak? : post-Roman inscriptions in western Britain. Cardiff: University of Wales Press. are evidenced by the ": null
    },
    {
        "Ogham": "Ogham"
    },
    {
        "-inscribed stones they have left behind, confirmed and supplemented by toponymical studies.  The stones are sometimes inscribed in ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ", sometimes in both scripts. ": null
    },
    {
        "Tristram Risdon": "Tristram Risdon"
    },
    {
        " suggested the continuance of a Brythonic dialect in the ": null
    },
    {
        "South Hams": "South Hams"
    },
    {
        ", Devon, as late as the 14th century, in addition to its use in Cornwall.             ": null
    },
    {
        "Ptolemys": "Ptolemy"
    },
    {
        " 2nd century Geography places the Dumnonii to the west of the ": null
    },
    {
        "Durotriges": "Durotriges"
    },
    {
        ". The name purocoronavium that appears in the ": null
    },
    {
        "Ravenna Cosmography": "Ravenna Cosmography"
    },
    {
        " implies the existence of a sub-tribe called the Cornavii or Cornovii, perhaps the ancestors of the ": null
    },
    {
        "Cornish people": "Cornish People"
    },
    {
        ".     In the ": null
    },
    {
        "sub-Roman": "Sub-Roman Britain"
    },
    {
        " period a Brythonic kingdom called ": null
    },
    {
        "Dumnonia": "Dumnonia"
    },
    {
        " emerged, covering the entire peninsula, although it is believed by some to have effectively been a collection of sub-kingdoms.     A kingdom of ": null
    },
    {
        "Domnonée": "Domnonée"
    },
    {
        "  was established in the province of ": null
    },
    {
        "Armorica": "Armorica"
    },
    {
        " directly across the ": null
    },
    {
        "English Channel": "English Channel"
    },
    {
        ", and has apparent links with the British population, suggesting an ancient connection of peoples along the western Atlantic seaboard.              The ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " name for Exeter is Isca Dumnoniorum . This ": null
    },
    {
        "oppidum": "Oppidum"
    },
    {
        "  on the banks of I ": null
    },
    {
        "River Exe": "River Exe"
    },
    {
        " certainly existed prior to the foundation of the ": null
    },
    {
        "Roman city": "Roman Britain"
    },
    {
        " in about AD 50. Isca is derived from the ": null
    },
    {
        "Brythonic": "Brittonic Languages"
    },
    {
        " word for flowing water, which was given to the River Exe. This is reflected in the Welsh name for Exeter: Caerwysg meaning fortified settlement on the river Uisc .     Isca Dumnoniorum originated with a settlement that developed around the ": null
    },
    {
        "Roman": "Roman Empire"
    },
    {
        " fortress of the ": null
    },
    {
        "Legio II Augusta": "Legio Ii Augusta"
    },
    {
        " and is one of the four  poleis  attributed to the tribe by ": null
    },
    {
        "Ptolemy": "Ptolemy"
    },
    {
        ".  It is also listed in two routes of the late 2nd century ": null
    },
    {
        "Antonine Itinerary": "Antonine Itinerary"
    },
    {
        ".     A legionary bath-house was built inside the fortress sometime between 55 and 60 and underwent renovation shortly afterwards but by c. 68 the legion had transferred to a newer fortress at ": null
    },
    {
        "Gloucester": "Gloucester"
    },
    {
        ". This saw the dismantling of the Isca fortress, and the site was then abandoned. Around AD 75, work on the civitas forum and basilica had commenced on the site of the former principia and by the late 2nd century the civitas walls had been completed. They were 3 metres thick and 6 metres high and enclosed exactly the same area as the earlier fortress. However, by the late 4th century the civitas was in decline.             As well as Isca Dumnoniorum, ": null
    },
    {
        "Ptolemys": "Ptolemy"
    },
    {
        " 2nd century Geography names three other towns:   Voliba, which remains unidentified,   Uxella, possibly on the ": null
    },
    {
        "River Axe": "River Axe"
    },
    {
        ", or at ": null
    },
    {
        "Launceston": "Launceston, Cornwall"
    },
    {
        ", and   Tamara, generally considered to be somewhere on the ": null
    },
    {
        "River Tamar": "River Tamar"
    },
    {
        ".     The ": null
    },
    {
        "Ravenna Cosmography": "Ravenna Cosmography"
    },
    {
        " includes the last two names , and adds several more names which may be settlements in the territory. These include:   Nemetostatio, a name relating to  nemeton , signifying sanctuary or ": null
    },
    {
        "sacred grove": "Sacred Grove"
    },
    {
        " . Probably to be identified with ": null
    },
    {
        "North Tawton": "North Tawton"
    },
    {
        " in Devon where there is a Roman earthwork that may be military, or possibly a tax collection station.   Purocoronavis, which may refer to an important native hill fort, such as ": null
    },
    {
        "Carn Brea": "Carn Brea, Redruth"
    },
    {
        " or ": null
    },
    {
        "Tintagel": "Tintagel"
    },
    {
        ". The name has led to speculation about the Cornish ": null
    },
    {
        "Cornovii": "Cornovii"
    },
    {
        ".     Other ": null
    },
    {
        "Romano-British": "Romano-British"
    },
    {
        " sites in Dumnonia include:   ": null
    },
    {
        "Topsham, Devon": "Topsham, Devon"
    },
    {
        " - a settlement and harbour that served Isca Dumnoniorum to which it was connected by road and river.   ": null
    },
    {
        "Nanstallon": "Nanstallon"
    },
    {
        " - a square military enclosure, seemingly associated with ": null
    },
    {
        "tin": "Tin"
    },
    {
        " workings at nearby ": null
    },
    {
        "Boscarne": "Boscarne"
    },
    {
        ".   ": null
    },
    {
        "Mount Batten": "Mount Batten"
    },
    {
        " - an ": null
    },
    {
        "Iron Age": "Iron Age"
    },
    {
        " tin port that continued into Roman times.   ": null
    },
    {
        "Plymouth": "Plymouth"
    },
    {
        " - evidence of a Roman settlement has been found on the north side of the harbour.   ": null
    },
    {
        "Ictis": "Ictis"
    },
    {
        " - an ancient port trading in tin.     New settlements continued to be built throughout the Roman period, including sites at ": null
    },
    {
        "Chysauster": "Chysauster"
    },
    {
        " and ": null
    },
    {
        "Trevelgue Head": "Trevelgue Head"
    },
    {
        ". The style is native in form with no Romanised features. Near ": null
    },
    {
        "Padstow": "Padstow"
    },
    {
        ", a site of some importance that was inhabited from the late Bronze/early Iron Age to the mid 6th century now lies buried under the sands on the opposite side of the Camel estuary near St. Enodocs Church, and may have been a western coastal equivalent of a ": null
    },
    {
        "Saxon Shore Fort": "Saxon Shore Fort"
    },
    {
        ". Byzantine and African pottery has been discovered at the site. At Magor Farm in ": null
    },
    {
        "Illogan": "Illogan"
    },
    {
        ", near ": null
    },
    {
        "Camborne": "Camborne"
    },
    {
        ", an archaeological site has been identified as being a ": null
    },
    {
        "villa": "Villa"
    },
    {
        ".       The Dumnonii are thought to have occupied relatively isolated territory in Cornwall, Devon, Somerset and possibly part of ": null
    },
    {
        "Dorset": "Dorset"
    },
    {
        ". Their cultural connections, as expressed in their ceramics, were with the peninsula of ": null
    },
    {
        "Armorica": "Armorica"
    },
    {
        " across the Channel, rather than with the southeast of Britain. Cunliffe, Barry Iron Age Communities in Britain: an Account of England, Scotland and Wales from the Seventh Century BC Until the Roman Conquest, 4th ed. pp. 201-206. They do not seem to have been politically centralised: coins are relatively rare, none of them locally minted, and the structure, distribution and construction of Bronze Age and Iron Age hill forts, rounds and defensible farmsteads in the south west point to a number of smaller tribal groups living alongside each other.     Dumnonia is noteworthy for its many settlements that have survived from the ": null
    },
    {
        "Romano-British": "Romano-British"
    },
    {
        " period, but also for its lack of a ": null
    },
    {
        "villa system": "Roman Villa"
    },
    {
        ". Local archaeology has revealed instead the isolated enclosed farmsteads known locally as rounds. These seem to have survived the ": null
    },
    {
        "Roman": "Roman Empire"
    },
    {
        " abandonment of Britain, but were subsequently replaced, in the 6th and 7th centuries, by the unenclosed farms taking the ": null
    },
    {
        "Brythonic": "Brythonic Languages"
    },
    {
        " toponym": "Toponym"
    },
    {
        "ic tre-. Pearce, Susan M. The Kingdom of Dumnonia. Padstow: Lodenek Press Kain, Roger; Ravenhill, William Historical Atlas of South-West England. Exeter / provides detailed information     As in most other Brythonic areas, ": null
    },
    {
        "Iron Age": "Iron Age"
    },
    {
        " hill forts": "Hillfort"
    },
    {
        ", such as ": null
    },
    {
        "Hembury Castle": "Hembury"
    },
    {
        ", were refortified for the use of chieftains or kings. Other high-status settlements such as ": null
    },
    {
        "Tintagel": "Tintagel Castle"
    },
    {
        " seem to have been reconstructed during this period. Post-Roman imported pottery has been excavated from many sites across the region, and the apparent surge in late 5th century ": null
    },
    {
        "Mediterranean": "Mediterranean"
    },
    {
        " and/or ": null
    },
    {
        "Byzantine": "Byzantine"
    },
    {
        " imports is yet to be explained satisfactorily. Thomas, Charles reviewing Pearce in Britannia 12; p. 417       Apart from fishing and agriculture, the main economic resource of the Dumnonii was tin mining. The area of Dumnonia had been mined since ancient times, and the tin was exported from the ancient trading port of ": null
    },
    {
        "Ictis": "Ictis"
    },
    {
        " . Tin extraction had existed here from the early ": null
    },
    {
        "Bronze Age": "Bronze Age"
    },
    {
        " around the 22nd century BC. West Cornwall, around ": null
    },
    {
        "Mounts Bay": "Mounts Bay"
    },
    {
        ", was traditionally thought to have been visited by metal traders from the eastern ": null
    },
    {
        "Mediterranean": "Mediterranean"
    },
    {
        " Hawkins, Christopher Observations on the Tin Trade of the Ancients in Cornwall. London: J. J. Stockdale     During the first millennium BC trade became more organised, first with the ": null
    },
    {
        "Phoenicians": "Phoenicians"
    },
    {
        ", who settled Gades  around 1100 BC, and later with the ": null
    },
    {
        "Greeks": "Greeks"
    },
    {
        ", who had settled Massilia  and Narbo  around 600 BC. Smelted Cornish tin was collected at ": null
    },
    {
        "Ictis": "Ictis"
    },
    {
        " whence it was conveyed across the Bay of Biscay to the mouth of the ": null
    },
    {
        "Loire": "Loire"
    },
    {
        " and then to Gades via the ": null
    },
    {
        "Loire": "Loire"
    },
    {
        " and ": null
    },
    {
        "Rhone": "Rhone"
    },
    {
        " valleys. It went then through the Mediterranean Sea in ships to Gades.     During the period c. 500-450 BC, the tin deposits seem to have become more important, and fortified settlements appear such as at ": null
    },
    {
        "Chun Castle": "Chun Castle"
    },
    {
        " and ": null
    },
    {
        "Kenidjack Castle": "Kenidjack Castle"
    },
    {
        ", to protect both the tin smelters and mines.   ": null
    },
    {
        "Trevithick Society": "Trevithick Society"
    },
    {
        ".     The earliest account of Cornish tin mining was written by ": null
    },
    {
        "Pytheas": "Pytheas"
    },
    {
        " of Massilia late in the 4th century BC after his circumnavigation of the British Isles. Underground mining was described in this account, although it cannot be determined when it had started. ": null
    },
    {
        "Pytheass": "Pytheas"
    },
    {
        " account was noted later by other writers including ": null
    },
    {
        "Pliny the Elder": "Pliny The Elder"
    },
    {
        " and ": null
    },
    {
        "Diodorus Siculus": "Diodorus Siculus"
    },
    {
        ".     It is likely that tin trade with the ": null
    },
    {
        "Mediterranean": "Mediterranean"
    },
    {
        " was later on under the control of the ": null
    },
    {
        "Veneti": "Veneti"
    },
    {
        ". Champion, Timothy The Appropriation of the Phoenicians in British Imperial Ideology in: Nations and Nationalism, Volume 7, Issue 4, pp. 451-65, October 2001 ": null
    },
    {
        "Britain": "Prehistoric Britain"
    },
    {
        " was one of the places proposed for the  Cassiterides , that is Tin Islands. Tin working continued throughout ": null
    },
    {
        "Roman": "Roman Empire"
    },
    {
        " occupation although it appears that output declined because of new supplies brought in from the deposits discovered in ": null
    },
    {
        "Iberia": "Iberian Peninsula"
    },
    {
        " . However, when these supplies diminished, production in ": null
    },
    {
        "Dumnonia": "Dumnonia"
    },
    {
        " increased and appears to have reached a peak during the 3rd century AD.          The ": null
    },
    {
        "Sub-Roman or Post-Roman": "Sub-Roman Britain"
    },
    {
        " history of Dumnonia comes from a variety of sources and is considered exceedingly difficult to interpret Webster, Graham The Cornovii . London: Duckworth given that historical fact, legend and confused pseudo-history are compounded by a variety of sources in ": null
    },
    {
        "Middle Welsh": "Middle Welsh"
    },
    {
        " and ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ". The main sources available for discussion of this period include ": null
    },
    {
        "Gildass": "Gildas"
    },
    {
        "  De Excidio Britanniae  and ": null
    },
    {
        "Nenniuss": "Nennius"
    },
    {
        "  Historia Brittonum , the  Annales Cambriae ,  Anglo-Saxon Chronicle , ": null
    },
    {
        "William of Malmesburys": "William Of Malmesbury"
    },
    {
        "  Gesta Regum Anglorum  and De Antiquitate Glastoniensis Ecclesiae, along with texts from the  Black Book of Carmarthen  and the  Red Book of Hergest , and ": null
    },
    {
        "Bedes": "Bede"
    },
    {
        "  Historia ecclesiastica gentis Anglorum  as well as The Descent of the Men of the North  and the  Book of Baglan ": null
    }
]