[
    {
        "          Dunstan  was an English ": null
    },
    {
        "bishop": "Bishop"
    },
    {
        ". He was successively ": null
    },
    {
        "Abbot of Glastonbury Abbey": "Abbot Of Glastonbury"
    },
    {
        ", ": null
    },
    {
        "Bishop of Worcester": "Bishop Of Worcester"
    },
    {
        ", ": null
    },
    {
        "Bishop of London": "Bishop Of London"
    },
    {
        ", and ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        ", later ": null
    },
    {
        "canonised": "Canonised"
    },
    {
        " as a ": null
    },
    {
        "saint": "Saint"
    },
    {
        ". His work restored monastic life in England and reformed the English Church. His 11th-century biographer, ": null
    },
    {
        "Osbern": "Osbern Of Canterbury"
    },
    {
        ", himself an artist and scribe, states that Dunstan was skilled in making a picture and forming letters , as were other clergy of his age who reached senior rank.   Dunstan served as an important minister of state to several English kings. He was the most popular saint in England for nearly two centuries, having gained fame for the many stories of his greatness, not least among which were those concerning his famed cunning in defeating the ": null
    },
    {
        "devil": "Devil In Christianity"
    },
    {
        ".           Dunstan was born in ": null
    },
    {
        "Baltonsborough": "Baltonsborough"
    },
    {
        ", ": null
    },
    {
        "Somerset": "Somerset"
    },
    {
        ", at the time part of the kingdom of ": null
    },
    {
        "Wessex": "Wessex"
    },
    {
        ". He was the son of Heorstan, a noble of ": null
    },
    {
        "Wessex": "Wessex"
    },
    {
        ". Heorstan was the brother of ": null
    },
    {
        "Athelm": "Athelm"
    },
    {
        ", the bishop of ": null
    },
    {
        "Wells": "Bishop Of Bath And Wells"
    },
    {
        " and ": null
    },
    {
        "Winchester": "Bishop Of Winchester"
    },
    {
        ". It is recorded that his mother, Cynethryth, was a pious woman. Osberns Life of Dunstan relates that a messenger miraculously told her of the saintly child she would give birth to:          The anonymous author of the earliest Life places Dunstans birth during the reign of ": null
    },
    {
        "Athelstan": "Athelstan Of England"
    },
    {
        ", while Osbern fixed it at the first year of the reign of King Æthelstan , 924 or 925. This date, however, cannot be reconciled with other known dates of Dunstans life and creates many obvious ": null
    },
    {
        "anachronisms": "Anachronism"
    },
    {
        ". Historians therefore assume that Dunstan was born around 910 or earlier.       As a young boy, Dunstan studied under the ": null
    },
    {
        "Irish monks": "Hiberno-Scottish Mission"
    },
    {
        " who then occupied the ruins of ": null
    },
    {
        "Glastonbury Abbey": "Glastonbury Abbey"
    },
    {
        ". Accounts tell of his youthful optimism and of his vision of the abbey being restored. While still a boy, Dunstan was stricken with a near-fatal illness and effected a seemingly miraculous recovery. Even as a child, he was noted for his devotion to learning and for his mastery of many kinds of artistic craftsmanship. With his parents consent he was ": null
    },
    {
        "tonsure": "Tonsure"
    },
    {
        "d, received ": null
    },
    {
        "minor orders": "Minor Orders"
    },
    {
        " and served in the ancient church of St Mary. He became so well known for his devotion to learning that he is said to have been summoned by his uncle Athelm, the ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        ", to enter his service. He was later appointed to the court of King ": null
    },
    {
        "Athelstan": "Athelstan"
    },
    {
        ".        Dunstan soon became a ": null
    },
    {
        "favourite": "Favourite"
    },
    {
        " of the king and was the envy of other members of the court. A plot was hatched to disgrace him and Dunstan was accused of being involved with ": null
    },
    {
        "witchcraft": "Witchcraft"
    },
    {
        " and ": null
    },
    {
        "black magic": "Black Magic"
    },
    {
        ". The king ordered him to leave the court and as Dunstan was leaving the palace his enemies physically attacked him, beat him severely, bound him, and threw him into a ": null
    },
    {
        "cesspool": "Cesspit"
    },
    {
        ". He managed to crawl out and make his way to the house of a friend. From there, he journeyed to Winchester and entered the service of his uncle, ": null
    },
    {
        "Ælfheah": "Alphege The Bald"
    },
    {
        ", Bishop of Winchester.     The bishop tried to persuade him to become a ": null
    },
    {
        "monk": "Monk"
    },
    {
        ", but Dunstan was doubtful whether he had a vocation to a ": null
    },
    {
        "celibate": "Clerical Celibacy"
    },
    {
        " life. The answer came in the form of an attack of swelling tumours all over Dunstans body. This ailment was so severe that it was thought to be ": null
    },
    {
        "leprosy": "Leprosy"
    },
    {
        ". It was more probably some form of ": null
    },
    {
        "blood poisoning": "Bacteremia"
    },
    {
        " caused by being beaten and thrown in the cesspool. Whatever the cause, it changed Dunstans mind. He took ": null
    },
    {
        "Holy Orders": "Holy Orders"
    },
    {
        " in 943, in the presence of Ælfheah, and returned to live the life of a hermit at Glastonbury. Against the old church of St Mary he built a small cell five feet long and two and a half feet deep. It was there that Dunstan studied, worked at his handicrafts, and played on his harp. It is at this time, according to a late 11th-century legend, that the ": null
    },
    {
        "Devil": "Devil In Christianity"
    },
    {
        " is said to have tempted Dunstan and to have been held by the face with Dunstans tongs.                 Dunstan worked as a ": null
    },
    {
        "silversmith": "Silversmith"
    },
    {
        " and in the ": null
    },
    {
        "scriptorium": "Scriptorium"
    },
    {
        " while he was living at Glastonbury. It is thought likely that he was the artist who drew the well-known image of Christ with a small kneeling monk beside him in the Glastonbury Classbook, one of the first of a series of outline drawings which were to become a special feature of Anglo-Saxon art of this period.  Dunstan became famous as a musician, illuminator, and metalworker. Lady Æthelflaed, King Æthelstans niece, made Dunstan a trusted adviser and on her death she left a considerable fortune to him. He used this money later in life to foster and encourage a monastic revival in England. About the same time, his father Heorstan died and Dunstan inherited his fortune as well. He became a person of great influence, and on the death of King Æthelstan in 940, the new King, ": null
    },
    {
        "Edmund": "Edmund I Of England"
    },
    {
        ", summoned him to his court at ": null
    },
    {
        "Cheddar": "Cheddar, Somerset"
    },
    {
        " and made him a minister.     Again, royal favour fostered jealousy among other courtiers and again Dunstans enemies succeeded in their plots. The king was prepared to send Dunstan away. There were then at Cheddar certain envoys from the Eastern Kingdom , which probably meant ": null
    },
    {
        "East Anglia": "East Anglia"
    },
    {
        ". Dunstan implored the envoys to take him with them when they returned to their homes. They agreed to do so, but it never happened. The story is recorded:            Dunstan, now Abbot of Glastonbury, went to work at once on the task of reform. He had to re-create monastic life and to rebuild the abbey. He began by establishing ": null
    },
    {
        "Benedictine": "Benedictine"
    },
    {
        " monasticism at Glastonbury. The Rule of St. Benedict was the basis of his restoration according to the author of Edgars Establishment of the Monasteries and according to Dunstans first biographer, who had been a member of the community at Glastonbury. Their statements are also in accordance with the nature of his first measures as abbot, with the significance of his first buildings, and with the Benedictine leanings of his most prominent disciples.     Nevertheless, not all the members of Dunstans community at Glastonbury were monks who followed the ": null
    },
    {
        "Benedictine Rule": "Benedictine Rule"
    },
    {
        ". In fact, Dunstans first biographer, B., was a cleric who eventually joined a community of ": null
    },
    {
        "canons": "Canon"
    },
    {
        " at ": null
    },
    {
        "Liège": "Liège"
    },
    {
        " after leaving Glastonbury.        Dunstans first care was to rebuild the Church of St. Peter, rebuild the cloister, and re-establish the monastic enclosure. The secular affairs of the house were committed to his brother, Wulfric, so that neither himself nor any of the professed monks might break enclosure.  A school for the local youth was founded and soon became the most famous of its time in England. A substantial extension of the irrigation system on the surrounding ": null
    },
    {
        "Somerset Levels": "Somerset Levels"
    },
    {
        " was also completed.     Within two years of Dunstans appointment, in 946, King Edmund was assassinated. His successor was ": null
    },
    {
        "Eadred": "Eadred Of England"
    },
    {
        ". The policy of the new government was supported by the ": null
    },
    {
        "Queen mother": "Queen Mother"
    },
    {
        ", ": null
    },
    {
        "Eadgifu of Kent": "Eadgifu Of Kent"
    },
    {
        ", by the Archbishop of Canterbury, ": null
    },
    {
        "Oda": "Oda The Severe"
    },
    {
        ", and by the East Anglian nobles, at whose head was the powerful ": null
    },
    {
        "ealdorman": "Ealdorman"
    },
    {
        " Æthelstan the Half-king ": "Æthelstan Half-King"
    },
    {
        ". It was a policy of unification and conciliation with the Danish half of the kingdom. The goal was a firm establishment of royal authority. In ecclesiastical matters it favoured the spread of ": null
    },
    {
        "Catholic": "Catholicism"
    },
    {
        " observance, the rebuilding of churches, the moral reform of the clergy and laity, and the end of the ": null
    },
    {
        "religion of the Danes": "Norse Mythology"
    },
    {
        " in England.   Against all these reforms were the nobles of Wessex, who included most of Dunstans own relatives, and who had an interest in maintaining established customs. For nine years Dunstans influence was dominant, during which time he twice refused the office of bishop , affirming that he would not leave the kings side so long as the king lived and needed him.          In 955, Eadred died, and the situation was at once changed. ": null
    },
    {
        "Eadwig": "Eadwig Of England"
    },
    {
        ", the elder son of Edmund, who then came to the throne, was a headstrong youth wholly devoted to the reactionary nobles. According to one legend, the feud with Dunstan began on the day of Eadwigs coronation, when he failed to attend a meeting of nobles. When Dunstan eventually found the young monarch, he was cavorting with a noblewoman named Ælfgifu and her mother, and refused to return with the bishop. Infuriated by this, Dunstan dragged Eadwig back and forced him to renounce the girl as a strumpet . Later realising that he had provoked the king, Dunstan fled to the apparent sanctuary of his cloister, but Eadwig, incited by Ælfgifu, whom he married, followed him and plundered the monastery.     Although Dunstan managed to escape, he saw that his life was in danger. He fled England and crossed the channel to Flanders, where he found himself ignorant of the language and of the customs of the locals. The ": null
    },
    {
        "count of Flanders": "Counts Of Flanders"
    },
    {
        ", ": null
    },
    {
        "Arnulf I": "Arnulf I, Count Of Flanders"
    },
    {
        ", received him with honour and lodged him in the Abbey of ": null
    },
    {
        "Mont Blandin": "Blandijnberg"
    },
    {
        ", near ": null
    },
    {
        "Ghent": "Ghent"
    },
    {
        ". This was one of the centres of the Benedictine revival in that country, and Dunstan was able for the first time to observe the strict observance that had seen its rebirth at ": null
    },
    {
        "Cluny": "Cluny Abbey"
    },
    {
        " at the beginning of the century. His exile was not of long duration. Before the end of 957, the ": null
    },
    {
        "Mercia": "Mercia"
    },
    {
        "ns and ": null
    },
    {
        "Northumbria": "Northumbria"
    },
    {
        "ns revolted and drove out Eadwig, choosing his brother ": null
    },
    {
        "Edgar": "Edgar Of England"
    },
    {
        " as king of the country north of the Thames. The south remained faithful to Eadwig. At once Edgars advisers recalled Dunstan.             On Dunstans return, Archbishop ": null
    },
    {
        "Oda": "Oda The Severe"
    },
    {
        " consecrated him a bishop and, on the death of ": null
    },
    {
        "Coenwald": "Coenwald"
    },
    {
        " of ": null
    },
    {
        "Worcester": "Anglican Diocese Of Worcester"
    },
    {
        " at the end of 957, Oda appointed Dunstan to the see.     In the following year the see of ": null
    },
    {
        "London": "Diocese Of London"
    },
    {
        " became vacant and was conferred on Dunstan, who held it simultaneously with Worcester. In October 959, Eadwig died and his brother Edgar was readily accepted as ruler of Wessex. One of Eadwigs final acts had been to appoint a successor to Archbishop Oda, who died on 2 June 958. The chosen candidate was ": null
    },
    {
        "Ælfsige": "Ælfsige"
    },
    {
        " of Winchester, but he died of cold in the Alps as he journeyed to ": null
    },
    {
        "Rome": "Holy See"
    },
    {
        " for the ": null
    },
    {
        "pallium": "Pallium"
    },
    {
        ". In his place Eadwig then nominated the Bishop of Wells, ": null
    },
    {
        "Byrhthelm": "Byrhthelm"
    },
    {
        ". As soon as ": null
    },
    {
        "Edgar": "Edgar The Peaceful"
    },
    {
        " became king, he reversed this second choice on the ground that Byrhthelm had not been able to govern even his first diocese properly. The archbishopric was then conferred on Dunstan.            Dunstan went to Rome in 960, and received the pallium from ": null
    },
    {
        "Pope John XII": "Pope John Xii"
    },
    {
        ". On his journey there, Dunstans acts of charity were so lavish as to leave nothing for himself and his attendants. His steward complained, but Dunstan seems to have suggested that they trust in ": null
    },
    {
        "Jesus Christ": "Christ"
    },
    {
        ".     On his return from Rome, Dunstan at once regained his position as virtual prime minister of the kingdom. By his advice ": null
    },
    {
        "Ælfstan": "Ælfstan"
    },
    {
        " was appointed to the Bishopric of London, and ": null
    },
    {
        "Oswald": "Oswald Of Worcester"
    },
    {
        " to that of Worcester. In 963, ": null
    },
    {
        "Æthelwold": "Æthelwold Of Winchester"
    },
    {
        ", the Abbot of ": null
    },
    {
        "Abingdon": "Abingdon Abbey"
    },
    {
        ", was appointed to the See of Winchester. With their aid and with the ready support of King Edgar, Dunstan pushed forward his reforms in the English Church. The monks in his communities were taught to live in a spirit of self-sacrifice, and Dunstan actively enforced the law of celibacy whenever possible. He forbade the practices of ": null
    },
    {
        "simony": "Simony"
    },
    {
        " and ended the custom of ": null
    },
    {
        "clerics": "Cleric"
    },
    {
        " appointing relatives to offices under their jurisdiction. Monasteries were built, and in some of the great cathedrals, monks took the place of the secular canons; in the rest the canons were obliged to live according to rule. The parish priests were compelled to be qualified for their office; they were urged to teach parishioners not only the truths of the Christian faith, but also trades to improve their position. The state saw reforms as well. Good order was maintained throughout the realm and there was respect for the law. Trained bands policed the north, and a navy guarded the shores from Viking raids. There was a level of peace in the kingdom unknown in living memory.     In 973, Dunstans statesmanship reached its zenith when he officiated at the coronation of King Edgar. Edgar was crowned at Bath in an imperial ceremony planned not as the initiation, but as the culmination of his reign . This service, devised by Dunstan himself and celebrated with a poem in the  Anglo-Saxon Chronicle  forms the basis of the present-day ": null
    },
    {
        "British coronation ceremony": "Coronation Of The British Monarch"
    },
    {
        ". There was a second symbolic coronation held later. This was an important step, as other kings of Britain came and gave their allegiance to Edgar at ": null
    },
    {
        "Chester": "Chester"
    },
    {
        ". Six kings in Britain, including the kings of Scotland and of ": null
    },
    {
        "Strathclyde": "Strathclyde"
    },
    {
        ", pledged their faith that they would be the kings liege-men on sea and land.     Edgar ruled as a strong and popular king for 16 years. In 975 he was succeeded by his eldest son ": null
    },
    {
        "Edward the Martyr ": "Edward The Martyr"
    },
    {
        ". His accession was disputed by his stepmother, ": null
    },
    {
        "Ælfthryth": "Ælfthryth, Queen Of England"
    },
    {
        ", who wished her own son ": null
    },
    {
        "Æthelred": "Æthelred The Unready"
    },
    {
        " to reign. Through the influence of Dunstan, Edward was chosen and crowned at Winchester. Edgars death had encouraged the reactionary nobles, and at once there was a determined attack upon the monks, the protagonists of reform. Throughout Mercia they were persecuted and deprived of their possessions. Their cause, however, was supported by ": null
    },
    {
        "Æthelwine": "Æthelstan Half-Kingfamily"
    },
    {
        ", the ealdorman of East Anglia, and the realm was in serious danger of civil war. Three meetings of the ": null
    },
    {
        "Witan": "Witenagemot"
    },
    {
        " were held to settle these disputes, at ": null
    },
    {
        "Kyrtlington": "Oxfordshire"
    },
    {
        ", at ": null
    },
    {
        "Calne": "Calne"
    },
    {
        ", and at ": null
    },
    {
        "Amesbury": "Amesbury"
    },
    {
        ". At the second of them the floor of the hall where the Witan was sitting gave way, and all except Dunstan, who clung to a beam, fell into the room below; several men were killed.       In March 978, King Edward was assassinated at ": null
    },
    {
        "Corfe Castle": "Corfe Castle"
    },
    {
        ", possibly at the instigation of his stepmother, and Æthelred the Unready became king. His coronation on ": null
    },
    {
        "Low Sunday": "Low Sunday"
    },
    {
        " 31 March 978, was the last state event in which Dunstan took part. When the young king took the usual oath to govern well, Dunstan addressed him in solemn warning. He criticised the violent act whereby he became king and prophesied the misfortunes that were shortly to fall on the kingdom, but Dunstans influence at court was ended. Dunstan retired to Canterbury, to teach at the ": null
    },
    {
        "cathedral school": "Cathedral School"
    },
    {
        ".     Only three more public acts are known. In 980, Dunstan joined ": null
    },
    {
        "Ælfhere of Mercia": "Ælfhere, Ealdorman Of Mercia"
    },
    {
        " in the solemn ": null
    },
    {
        "translation of the relics": "Translation"
    },
    {
        " of King Edward, soon to be regarded as a saint, from their grave at ": null
    },
    {
        "Wareham": "Wareham, Dorset"
    },
    {
        " to a shrine at ": null
    },
    {
        "Shaftesbury Abbey": "Shaftesbury Abbey"
    },
    {
        ". In 984, in obedience to a vision of ": null
    },
    {
        "St Andrew": "Saint Andrew"
    },
    {
        ", he persuaded King Æthelred to appoint ": null
    },
    {
        "Ælfheah": "Alphege"
    },
    {
        " as Bishop of Winchester in succession to Æthelwold. In 986, Dunstan induced the king, by a donation of 100 pounds of silver, to stop his persecution of the See of ": null
    },
    {
        "Rochester": "Diocese Of Rochester"
    },
    {
        ".     Dunstans retirement at Canterbury consisted of long hours, both day and night, spent in private prayer, as well as his regular attendance at Mass and the ": null
    },
    {
        "daily office": "Canonical Hours"
    },
    {
        ". He visited the shrines of ": null
    },
    {
        "St Augustine": "Augustine Of Canterbury"
    },
    {
        " and ": null
    },
    {
        "St Æthelberht": "Æthelberht Of Kent"
    },
    {
        ", and there are reports of a vision of angels who sang to him heavenly canticles. He worked to improve the spiritual and temporal well-being of his people, to build and restore churches, to establish schools, to judge suits, to defend widows and orphans, to promote peace, and to enforce respect for purity. He practised his crafts, made bells and organs and corrected the books in the cathedral library. He encouraged and protected European scholars who came to England, and was active as a teacher of boys in the cathedral school. On the vigil of ": null
    },
    {
        "Ascension": "Ascension Of Jesus Christ"
    },
    {
        " Day 988, it is recorded that a vision of angels warned he would die in three days. On the feast day itself, Dunstan said Mass and preached three times to the people: at the ": null
    },
    {
        "Gospel": "Mass Liturgy Of The Word"
    },
    {
        ", at the ": null
    },
    {
        "benediction": "Benedictionchristianity"
    },
    {
        ", and after the ": null
    },
    {
        "Agnus Dei": "Agnus Dei"
    },
    {
        ". In this last address, he announced his impending death and wished his congregation well. That afternoon he chose the spot for his tomb, then went to his bed. His strength failed rapidly, and on Saturday morning, 19 May, he caused the clergy to assemble. Mass was celebrated in his presence, then he received ": null
    },
    {
        "Extreme Unction": "Extreme Unction"
    },
    {
        " and the ": null
    },
    {
        "Viaticum": "Viaticum"
    },
    {
        ", and died. Dunstans final words are reported to have been, He hath made a remembrance of his wonderful works, being a merciful and gracious Lord: He hath given food to them that fear Him.      The English people accepted him as a ": null
    },
    {
        "saint": "Saint"
    },
    {
        " shortly thereafter. He was formally ": null
    },
    {
        "canonised": "Canonised"
    },
    {
        " in 1029. That year at the Synod of Winchester, St Dunstans feast was ordered to be kept solemnly throughout England.         Until ": null
    },
    {
        "Thomas Beckets": "Thomas Becket"
    },
    {
        " fame overshadowed Dunstans, he was the favourite saint of the English people. Dunstan had been buried in his ": null
    },
    {
        "cathedral": "Canterbury Cathedrallater Saxon And Viking"
    },
    {
        "; and when that building was destroyed by a fire in 1074, his relics were translated by Archbishop ": null
    },
    {
        "Lanfranc": "Lanfranc"
    },
    {
        " to a tomb on the south side of the high altar in the rebuilt ": null
    },
    {
        "Canterbury Cathedral": "Canterbury Cathedral"
    },
    {
        ".     Part of the decoration to the side of his tomb is still visible, and consists of some painted ": null
    },
    {
        "diaperwork": "Diapering"
    },
    {
        ", which can be viewed by visitors to the Cathedral.     The monks of Glastonbury used to claim that during the sack of Canterbury by the ": null
    },
    {
        "Danes": "Viking"
    },
    {
        " in 1012, Dunstans body had been carried for safety to their abbey. This story was disproved by Archbishop ": null
    },
    {
        "William Warham": "William Warham"
    },
    {
        ", who opened the tomb at Canterbury in 1508. They found Dunstans relics still to be there. Within a century, however, his shrine was destroyed during the ": null
    },
    {
        "English Reformation": "English Reformation"
    },
    {
        ".       Dunstan became ": null
    },
    {
        "patron saint": "Patron Saint"
    },
    {
        " of English ": null
    },
    {
        "goldsmiths": "Goldsmith"
    },
    {
        " and silversmiths because he worked as a silversmith making church plate. The ": null
    },
    {
        "Eastern Orthodox Church": "Eastern Orthodox Church"
    },
    {
        ", the ": null
    },
    {
        "Roman Catholic Church": "Roman Catholic Church"
    },
    {
        ", and the ": null
    },
    {
        "Anglican Communion": "Anglican Communion"
    },
    {
        " mark his ": null
    },
    {
        "feast day": "Calendar Of Saints"
    },
    {
        " on 19 May., which is why, before the Restoration the date year on London Assay Office ": null
    },
    {
        "hallmarks": "Hallmark"
    },
    {
        " ran from 19 May one year to 18 May the next, not the calendar year. This was changed at the restoration of Charles II in 1660 so that the hallmarking year began on the Kings birthday, 29 May.       ": null
    },
    {
        "English literature": "English Literature"
    },
    {
        " contains many references to him, for example in  A Christmas Carol  by ": null
    },
    {
        "Charles Dickens": "Charles Dickens"
    },
    {
        ", and in this folk rhyme:   St Dunstan, as the story goes,   Once pulld the devil by the nose   With red-hot tongs, which made him roar,   That he was heard three miles or more.     This folk story is already shown in an initial in the Life of Dunstan in the Canterbury Passionale, from the second quarter of the 12th century , and the tongs have become a symbol of St Dunstan.        Daniel Anlezark has tentatively suggested that Dunstan may be the medieval author of ": null
    },
    {
        "Solomon and Saturn": "Solomon And Saturn"
    },
    {
        " citing the style, word choice, and ": null
    },
    {
        "Hiberno-Latin": "Hiberno-Latin"
    },
    {
        " used in the texts. However, Clive Tolley examines this claim from a linguistic point-of-view and disagrees with Anlezarks claim.     Another story relates how Dunstan nailed a horseshoe to the Devils foot when he was asked to re-shoe the Devils cloven hoof. This caused the Devil great pain, and Dunstan only agreed to remove the shoe and release the Devil after he promised never to enter a place where a horseshoe is over the door. This is claimed as the origin of the lucky horseshoe.   At various passages in ": null
    },
    {
        "The Deptford Trilogy": "The Deptford Trilogy"
    },
    {
        " by the Canadian writer ": null
    },
    {
        "Robertson Davies": "Robertson Davies"
    },
    {
        ", the character ": null
    },
    {
        "Dunstan Ramsay": "The Deptford Trilogydunstan Ramsay"
    },
    {
        " is compared with the saint of the same name, and in particular some stormy events in the characters love-life are rather humorously compared to Saint Dunstans famous struggle with Satan.     A fictionalised account of his life is told in the 2017 historical novel Dunstan by ": null
    },
    {
        "Conn Iggulden": "Conn Iggulden"
    },
    {
        ".       Dunstan’s tongs are included in the coat of arms of the ": null
    },
    {
        "London Borough of Tower Hamlets": "London Borough Of Tower Hamlets"
    },
    {
        ", to reflect the saint’s strong association with the ": null
    },
    {
        "East End of London": "East End Of London"
    },
    {
        ".     As Bishop of London, Dunstan was also Lord of the ": null
    },
    {
        "Manor of Stepney": "Stepneymanor And Ancient Parish"
    },
    {
        ", and may, like subsequent bishops, have lived there. Dunstan is recorded as having founded ": null
    },
    {
        "Stepney’s church": "St Dunstans, Stepney"
    },
    {
        ", in 952 AD. This church was dedicated to All Saints, but was rededicated to Dunstan after his canonisation in 1029.     It was initially the only church for the whole manor, a manor which covered most of what would later become the East End. Population growth and other factors led to ": null
    },
    {
        "Stepney parish": "Stepneymanor And Ancient Parish"
    },
    {
        " being subdivided into a large number of daughter parishes. To this day ": null
    },
    {
        "St Dunstan’s church": "St Dunstans, Stepney"
    },
    {
        " in Stepney is known as the Mother Church of the East End.       There are churches dedicated to Dunstan all over the world. ": null
    },
    {
        "St Dunstans, Mayfield": "Church Of St. Dunstan, Mayfield"
    },
    {
        ", ": null
    },
    {
        "St Dunstans, Stepney": "St Dunstans, Stepney"
    },
    {
        ", ": null
    },
    {
        "St Dunstan-in-the-East, London": "St Dunstan-In-The-East"
    },
    {
        ", and ": null
    },
    {
        "St Dunstan-in-the-West, London": "St Dunstan-In-The-West"
    },
    {
        " are four of the more well known in Britain. The ": null
    },
    {
        "church at the junction of London Road and Whitstable Road": "St. Dunstans, Canterbury"
    },
    {
        " gives its name to the neighbourhood of Canterbury on the north bank of the ": null
    },
    {
        "River Stour": "River Stour, Kent"
    },
    {
        ".       ": null
    },
    {
        "St Dunstans": "Blind Veterans Uk"
    },
    {
        "—the charity that provides support, rehabilitation, and respite care to blind ex-service personnel of the ": null
    },
    {
        "British Armed Forces": "British Armed Forces"
    }
]