[
    {
        "              Dynamite is an ": null
    },
    {
        "explosive": "Explosive Material"
    },
    {
        " made of ": null
    },
    {
        "nitroglycerin": "Nitroglycerin"
    },
    {
        ", ": null
    },
    {
        "sorbents": "Sorbent"
    },
    {
        " and stabilizers. It was invented by the ": null
    },
    {
        "Swedish": "Swedish People"
    },
    {
        " chemist and engineer ": null
    },
    {
        "Alfred Nobel": "Alfred Nobel"
    },
    {
        " in ": null
    },
    {
        "Geesthacht": "Geesthacht"
    },
    {
        " and ": null
    },
    {
        "patented": "Patented"
    },
    {
        " in 1867. It rapidly gained wide-scale use as a more powerful alternative to ": null
    },
    {
        "black powder": "Gun Powder"
    },
    {
        ".     Today, dynamite is mainly used in the ": null
    },
    {
        "mining": "Mining"
    },
    {
        ", ": null
    },
    {
        "quarrying": "Quarrying"
    },
    {
        ", ": null
    },
    {
        "construction": "Construction"
    },
    {
        ", and ": null
    },
    {
        "demolition": "Demolition"
    },
    {
        " industries. Dynamite is still the product of choice for trenching applications, and as a cost-effective alternative to ": null
    },
    {
        "cast booster": "Cast Booster"
    },
    {
        "s. Dynamite is occasionally used as an initiator or booster for ": null
    },
    {
        "AN and ANFO explosive charges": "Anfo"
    },
    {
        ".            Dynamite was invented by Swedish chemist ": null
    },
    {
        "Alfred Nobel": "Alfred Nobel"
    },
    {
        " in the 1860s and was the first safely manageable explosive stronger than ": null
    },
    {
        "black powder": "Black Powder"
    },
    {
        ", which had been invented in China in the 9th century.     Alfred Nobels father, ": null
    },
    {
        "Immanuel Nobel": "Immanuel Nobel"
    },
    {
        ", was an industrialist, engineer, and inventor. He built bridges and buildings in Stockholm and founded Swedens first rubber factory. His construction work inspired him to research new methods of blasting rock that were more effective than black powder. After some bad business deals in Sweden, in 1838 Immanuel moved ": null
    },
    {
        "his family": "Nobel Family"
    },
    {
        " to ": null
    },
    {
        "Saint Petersburg": "Saint Petersburg"
    },
    {
        ", where Alfred and his brothers were educated privately under Swedish and Russian tutors. At age 17, Alfred was ": null
    },
    {
        "sent abroad for two years": "Grand Tour"
    },
    {
        "; in the United States he met Swedish engineer ": null
    },
    {
        "John Ericsson": "John Ericsson"
    },
    {
        " and in France studied under famed chemist ": null
    },
    {
        "Théophile-Jules Pelouze": "Théophile-Jules Pelouze"
    },
    {
        " and his pupil ": null
    },
    {
        "Ascanio Sobrero": "Ascanio Sobrero"
    },
    {
        " who had first synthesized ": null
    },
    {
        "nitroglycerin": "Nitroglycerin"
    },
    {
        " in 1847. It was in France that Nobel first encountered nitroglycerin, which Pelouze cautioned against using as a commercial explosive because of its great sensitivity to shock.      In 1857, Nobel filed the first of several hundred patents, mostly concerning air pressure, gas and fluid gauges, but remained fascinated with nitroglycerins potential as an explosive. Nobel, along with his father and brother ": null
    },
    {
        "Emil": "Emil Oskar Nobel"
    },
    {
        ", experimented with various combinations of nitroglycerin and black powder. Nobel came up with a solution of how to safely detonate nitroglycerin by inventing the ": null
    },
    {
        "detonator": "Detonator"
    },
    {
        ", or blasting cap, that allowed a controlled explosion set off from a distance using a ": null
    },
    {
        "fuse": "Fuse"
    },
    {
        ". In the summer of 1863, Nobel performed his first successful detonation of pure nitroglycerin, using a blasting cap made of a copper ": null
    },
    {
        "percussion cap": "Percussion Cap"
    },
    {
        " and ": null
    },
    {
        "mercury fulminate": "Mercury Fulminate"
    },
    {
        ". In 1864, Alfred Nobel filed patents for both the blasting cap and his method of synthesizing nitroglycerin, using sulfuric acid, nitric acid and glycerin. On 3 September 1864, while experimenting with nitroglycerin, Emil and several others were killed in an explosion at the factory at Immanuel Nobels estate at ": null
    },
    {
        "Heleneborg": "Heleneborg"
    },
    {
        ". After this, Alfred founded the company Nitroglycerin Aktiebolaget AB in ": null
    },
    {
        "Vinterviken": "Vinterviken"
    },
    {
        " to continue work in a more isolated area and the following year moved to Germany, where he founded another company, ": null
    },
    {
        "Dynamit Nobel": "Dynamit Nobel"
    },
    {
        ".     Despite the invention of the blasting cap, the volatility of nitroglycerin rendered it useless as a commercial explosive. To solve this problem, Nobel sought to combine it with another substance that would make it safe for transport and handling but yet would not reduce its effectiveness as an explosive. He tried combinations of cement, coal, and sawdust, but was unsuccessful. Finally, he tried ": null
    },
    {
        "diatomaceous earth": "Diatomaceous Earth"
    },
    {
        ", fossilized algae, that he brought from the ": null
    },
    {
        "Elbe River": "Elbe River"
    },
    {
        " near his factory in ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        ", which successfully stabilized the nitroglycerin into a portable explosive.     Nobel obtained ": null
    },
    {
        "patents": "Patent"
    },
    {
        "for his inventions in England on 7 May 1867 and in Sweden on 19 October 1867. Schück & Sohlman , p. 101. After its introduction, dynamite rapidly gained wide-scale use as a safe alternative to ": null
    },
    {
        "black powder": "Black Powder"
    },
    {
        " and ": null
    },
    {
        "nitroglycerin": "Nitroglycerin"
    },
    {
        ". Nobel tightly controlled the patents, and unlicensed duplicating companies were quickly shut down. However, a few American businessmen got around the patent by using a slightly different formula. US Patent 234489 issued to Morse 16 November 1880     Nobel originally sold dynamite as Nobels Blasting Powder but decided to change the name to dynamite, from the ": null
    },
    {
        "Ancient Greek": "Ancient Greek"
    },
    {
        " word dýnamis , meaning power . dynamite. The American Heritage® Dictionary of the English Language, Fourth Edition. 2003. Houghton Mifflin Company 19 March 2013  dynamite. Collins English Dictionary – Complete and Unabridged. 1991, 1994, 1998, 2000, 2003. HarperCollins Publishers 19 March 2013            Dynamite is usually sold in the form of cardboard cylinders about  long and about  in diameter, with a weight of about .  A stick of dynamite thus produced contains roughly 1  MJ  of energy.  Other sizes also exist, rated by either portion or by weight.     Dynamite is usually rated by weight strength , usually from 20% to 60%. For example, 40% dynamite is composed of 40% nitroglycerin and 60% dope .       The maximum ": null
    },
    {
        "shelf life": "Shelf Life"
    },
    {
        " of nitroglycerin-based dynamite is recommended as one year from the date of manufacture under good storage conditions.     Over time, regardless of the sorbent used, sticks of dynamite will weep or sweat nitroglycerin, which can then pool in the bottom of the box or storage area. For that reason, explosive manuals recommend the repeated turning over of boxes of dynamite in storage. Crystals will form on the outside of the sticks, causing them to be even more sensitive to shock, friction, and temperature. Therefore, while the risk of an explosion without the use of a ": null
    },
    {
        "blasting cap": "Blasting Cap"
    },
    {
        " is minimal for fresh dynamite, old dynamite is dangerous. Modern packaging helps eliminate this by placing the dynamite into sealed plastic bags, and using wax-coated cardboard.     Dynamite is moderately sensitive to shock. Shock resistance tests are usually carried out with a drop-hammer: about 100  mg of explosive is placed on an anvil, upon which a weight of between  is dropped from different heights until detonation is achieved. Carlos López Jimeno, Emilio López Jimeno, Francisco Javier Ayala-Carcedo, Drilling and Blasting of Rocks, translated by Yvonne Visser de Ramiro from Manual de perforación y voladura de rocas , Geomining Technological Institute of Spain , Taylor & Francis, London and New York, 1995,  With a hammer of 2  kg, ": null
    },
    {
        "mercury fulminate": "Mercury Fulminate"
    },
    {
        " detonates with a drop distance of 1 to 2  cm, nitroglycerin with 4 to 5  cm, dynamite with 15 to 30  cm, and ammoniacal explosives with 40 to 50  cm.              For several decades beginning in the 1940s, the largest producer of dynamite in the world was the ": null
    },
    {
        "Union of South Africa": "Union Of South Africa"
    },
    {
        ". There the ": null
    },
    {
        "De Beers": "De Beers"
    },
    {
        " company established a factory in 1902 at ": null
    },
    {
        "Somerset West": "Somerset West"
    },
    {
        ". The explosives factory was later operated by ": null
    },
    {
        "AECI": "Aeci"
    },
    {
        " . The demand for the product came mainly from the countrys vast gold mines, centered on the ": null
    },
    {
        "Witwatersrand": "Witwatersrand"
    },
    {
        ". The factory at Somerset West was in operation in 1903 and by 1907 it was already producing 340,000 cases,  each, annually. A rival factory at Modderfontein was producing another 200,000 cases per year.      There were two large explosions at the Somerset West plant during the 1960s. Some workers died, but the loss of life was limited by the modular design of the factory and its earth works, and the planting of trees that directed the blasts upward. There were several other explosions at the Modderfontein factory. After 1985, pressure from trade unions forced AECI to phase out the production of dynamite. The factory then went on to produce ammonium nitrate emulsion-based explosives that are safer to manufacture and handle.        Dynamite was first manufactured in the U.S. by the ": null
    },
    {
        "Giant Powder Company": "Giant Powder Company"
    },
    {
        " of ": null
    },
    {
        "San Francisco, California": "San Francisco, California"
    },
    {
        ", whose founder had obtained the exclusive rights from Nobel in 1867. Giant was eventually acquired by ": null
    },
    {
        "DuPont": "Dupont"
    },
    {
        ", which produced dynamite under the Giant name until Giant was dissolved by Du Pont in 1905.    Thereafter, DuPont produced dynamite under its own name until 1911–12 when its explosives monopoly was broken up by the U.S. Circuit Court in the Powder Case .   Two new companies were formed upon the breakup, the ": null
    },
    {
        "Hercules Powder Company": "Hercules Powder Company"
    },
    {
        " and the Atlas Powder Company, which took up the manufacture of dynamite thereafter.     Currently only ": null
    },
    {
        "Dyno Nobel": "Dyno Nobel"
    },
    {
        " manufactures dynamite in the US. The only facility producing it is located in ": null
    },
    {
        "Carthage, Missouri": "Carthage, Missouri"
    },
    {
        ", but the material is purchased from Dyno Nobel by other manufacturers, who put their labels on the dynamite and boxes.       Other explosives are often referred to or confused with dynamite:       ": null
    },
    {
        "TNT": "Tnt"
    },
    {
        " is most commonly assumed to be the same as dynamite, largely due to the ubiquity of both explosives during the 20th century and the civilian practice of preparing dynamite charges in 8x1 sticks wrapped in red waxed paper and shaped to fit the cylindrical ": null
    },
    {
        "boreholes": "Borehole"
    },
    {
        "drilled in the rock face. This incorrect connection between TNT and dynamite was enhanced by ": null
    },
    {
        "Bugs Bunny": "Bugs Bunny"
    },
    {
        " cartoons where animators started labeling any kind of cartoon bomb  as TNT because the acronym was shorter, more memorable and didnt require ": null
    },
    {
        "literacy": "Literacy"
    },
    {
        " to recognize TNT meant bomb . This eventually led to the general perception that TNT and dynamite were one and the same.     In actuality, aside from both being high explosives, TNT and dynamite have very little in common: TNT is a 2nd generation ": null
    },
    {
        "castable explosive": "Useformsofexplosivescastings"
    },
    {
        " adopted by the military. The German armed forces adopted it as a filling for artillery shells in 1902, some 40 years after the invention of dynamite, which is a 1st generation ": null
    },
    {
        "phlegmatized explosive": "Phlegmatized Explosive"
    },
    {
        " primarily intended for civilian earthmoving. TNT has never been popular or widespread in civilian earthmoving, as it is considerably more expensive and less powerful by weight than dynamite, J. Köhler, R. Meyer, A. Homburg: Explosivstoffe. Zehnte, vollständig überarbeitete Auflage. Wiley-VCH Verlag GmbH & Co. KGaA, Weinheim 2008, . as well as being slower to mix and pack into cylindrical boreholes; for its part, dynamite has never been popular in warfare because it degenerates quickly under severe conditions and can be detonated by either fire or a wayward bullet. TNTs primary asset is its remarkable insensitivity and stability: it is waterproof and incapable of detonating without the extreme shock and heat provided by a ": null
    },
    {
        "blasting cap": "Blasting Cap"
    },
    {
        " ; this conveniently also allows it to be melted at , poured into ": null
    },
    {
        "high explosive shells": "Shell"
    },
    {
        " and allowed to re-solidify with no extra danger or change in the TNTs characteristics. Gibbs, T.R. & Popolato, A. LASL Explosive Property Data. ": null
    },
    {
        "Los Alamos National Laboratory": "Los Alamos National Laboratory"
    },
    {
        ", New Mexico. ": null
    },
    {
        "USDOE": "Usdoe"
    },
    {
        ", 1980. As such, more than 90% of the TNT produced in America was always for the military market, with most filling shells, ": null
    },
    {
        "hand grenades": "Hand Grenades"
    },
    {
        " and ": null
    },
    {
        "aerial bombs": "Aerial Bombs"
    },
    {
        " and the remainder being packaged in brown bricks for use as ": null
    },
    {
        "demolition charges": "Satchel Charge"
    },
    {
        " by ": null
    },
    {
        "combat engineers": "Combat Engineers"
    },
    {
        ".       In the United States, in 1885, the chemist Russell S. Penniman invented ammonium dynamite , a form of explosive that used ": null
    },
    {
        "ammonium nitrate": "Ammonium Nitrate"
    },
    {
        " as a substitute for the more costly nitroglycerin. Ammonium nitrate has only 85% of the ": null
    },
    {
        "chemical energy": "Chemical Energy"
    },
    {
        " of nitroglycerin.     It is rated by either weight strength or cartridge strength . For example, high-explosive 65% Extra Dynamite has a weight strength of 65% ammonium nitrate and 35% dope . Its cartridge strength would be its weight in pounds times its strength in relation to an equal amount of ": null
    },
    {
        "ANFO": "Anfo"
    },
    {
        " or ": null
    },
    {
        "TNT": "Tnt"
    },
    {
        " . For example, 65% ammonium dynamite with a 20% cartridge strength would mean the stick was equal to an equivalent weight strength of 20% ANFO.       Military dynamite is a dynamite substitute, formulated without nitroglycerin. It contains 75% ": null
    },
    {
        "RDX": "Rdx"
    },
    {
        ", 15% TNT, 5% SAE 10 motor oil, and 5% cornstarch, but is much safer to store and handle for long periods than Nobels dynamite.  Military dynamite substitutes much more stable chemicals for nitroglycerin.        ": null
    }
]