[
    {
        "         Edward Elmer Smith , better known by his ": null
    },
    {
        "pen name": "Pen Name"
    },
    {
        " E. E. Doc Smith, was an American ": null
    },
    {
        "food engineer": "Food Engineering"
    },
    {
        "  and ": null
    },
    {
        "science-fiction author": "Science Fiction Author"
    },
    {
        ", best known for the  Lensman  and  Skylark  series. He is sometimes called the father of ": null
    },
    {
        "space opera": "Space Opera"
    },
    {
        ".           Edward Elmer Smith was born in ": null
    },
    {
        "Sheboygan, Wisconsin": "Sheboygan, Wisconsin"
    },
    {
        " on May 2, 1890, to Fred Jay Smith and Caroline Mills Smith, both staunch ": null
    },
    {
        "Presbyterians": "Presbyterianism"
    },
    {
        " of British ancestry. Moskowitz p. 11. For this and all following dates, see also the timelines in Lucchetti pp. 31–35 and 113–47 and, to a lesser extent, Sanders pp. 1–2. His mother was a teacher born in Michigan in February 1855; his father was a sailor, born in ": null
    },
    {
        "Maine": "Maine"
    },
    {
        " in January 1855 to an English father. 1900 Census, House 1515, Residence 438, Family 371, 3rd Ward of Spokane County, Washington, recorded June 13, 1900, accessed via online census images at heritagequest.com They moved to ": null
    },
    {
        "Spokane, Washington": "Spokane, Washington"
    },
    {
        ", the winter after Edward Elmer was born, Sanders p. 1 & 7. Trestrail p. 2 instead says that the family moved that year to Idaho, but Moskowitz p. 11–12 and Eshbach p. 85 both seem to agree with Sanders. where Mr. Smith was working as a contractor in 1900. In 1902, the family moved to Seneaquoteen, Sanders p. 1. near the ": null
    },
    {
        "Pend Oreille River": "Pend Oreille River"
    },
    {
        ", in ": null
    },
    {
        "Kootenai County": "Kootenai County"
    },
    {
        ", Idaho. Moskowitz p. 11–12. He had four siblings, Rachel M. born September 1882, Daniel M. born January 1884, Mary Elizabeth born February 1886 , and Walter E. born July 1891 in ": null
    },
    {
        "Washington": "Washington"
    },
    {
        ". In 1910, Fred and Caroline Smith and their son Walter were living in the Markham Precinct of ": null
    },
    {
        "Bonner County, Idaho": "Bonner County, Idaho"
    },
    {
        "; Fred is listed in census records as a farmer. 1910 Census, Residence 37, Family 37, Markham Precinct, Bonner County, Idaho, recorded April 25, 1910, accessed via heritagequest.com.     Smith worked primarily as a manual laborer until he injured his wrist, at the age of 19, while escaping from a fire. He attended the ": null
    },
    {
        "University of Idaho": "University Of Idaho"
    },
    {
        ". He entered its ": null
    },
    {
        "prep school": "College-Preparatory School"
    },
    {
        " in 1907, and graduated with two degrees in ": null
    },
    {
        "chemical engineering": "Chemical Engineering"
    },
    {
        " in 1914. He was president of the Chemistry Club, the Chess Club, and the Mandolin and Guitar Club, and captain of the Drill and Rifle Team; he also sang the bass lead in ": null
    },
    {
        "Gilbert and Sullivan": "Gilbert And Sullivan"
    },
    {
        " operettas. Sanders p. 8 His undergraduate thesis was Some Clays of Idaho, co-written with classmate Chester Fowler Smith, who died in California of ": null
    },
    {
        "tuberculosis": "Tuberculosis"
    },
    {
        " the following year, after taking a teaching fellowship at Berkeley. ": null
    },
    {
        "Latah County, Idaho": "Latah County, Idaho"
    },
    {
        " . Whether the two were related is not known.     On October 5, 1915, in ": null
    },
    {
        "Boise, Idaho": "Boise, Idaho"
    },
    {
        " , accessed April 5, 2007 he married Jeanne Craig MacDougall, the sister of his college roommate, Allen Scott MacDougall. Trestrail pp. 3 & 4, Sanders p. 8, Moskowitz p. 13. Trestrail spells the name Allen.  Jeanne MacDougall was born in ": null
    },
    {
        "Glasgow": "Glasgow"
    },
    {
        ", Scotland; her parents were Donald Scott MacDougall, a violinist, and Jessica Craig MacLean. Her father had moved to Boise when the children were young, and later sent for his family; he died while they were en route in 1905. Jeannes mother, who remarried businessman and retired politician John F. Kessler in 1914 Hawley, James F. A History of Idaho: Gem of the Mountains , page 868. S. J. Clarke Publishing Company, 1920. Full text available at Google Books, https://books.google.com/books?id-t8UAAAAYAAJ & ieISO-8859-1 & outputhtml worked at, and later owned, a boarding house on Ridenbaugh Street.     The Smiths had three children:   Roderick N., born June 3, 1918, in the District of Columbia , was employed as a design engineer at Lockheed Aircraft.   Verna Jean , born August 25, 1920, in Michigan, was his literary executor until her death in 1994. Robert A. Heinlein in part dedicated his 1982 novel ": null
    },
    {
        "Friday": "Friday"
    },
    {
        " to Verna.   Clarissa M. , was born December 13, 1921, in Michigan. Lucchetti p. 32, Warner, Moskowitz p. 22.     Skylark": null
    },
    {
        "The Skylark of Space": "The Skylark Of Space"
    },
    {
        " was completed by the end of 1916, when Smith and Garby gradually abandoned work on it.     Smith earned his masters degree in chemistry from the George Washington University in 1917, studying under Dr. Charles E. Munroe . Doughnut Specialist Smith says that his M.S. degree was from Harvard University and Johns Hopkins University , which is not consistent with other sources. Smith completed his PhD in chemical engineering in 1918, Sanders, p. 1; Lucchetti, p. 32; Barrett, p. 4, following Sanders. with a food engineering focus; his dissertation, , was published in 1919. See bibliography, below.      thu cover story   thu   thu   thu , was novelized by Gordon Eklund nearly 25 years later.   thu   thu died in 1958, Smith completed his unfinished novel, Masters of Space. The novel was serialized in If .     SkylarkThe Skylark of Space, finishing it in the spring of 1920. Sanders, p. 1; Moskowitz, p. 14. Warner says 1921. Doughnut Specialist Smith says It wasnt until 1919 that work really began  ... Five years passed before acceptance by the first science-fiction magazine on the American market, and two more years elapsed before it was published. This is not consistent with other sources. He submitted it to many book publishers and magazines, spending more in postage than he would eventually receive for its publication. Bob Davis, editor of ": null
    },
    {
        "Argosy": "Argosy"
    },
    {
        ", sent an encouraging rejection letter in 1922, saying that he liked the novel personally, but that it was too far out for his readers. Sanders, p. 9; Moskowitz, p. 15.  Finally, upon seeing the April 1927 issue of ": null
    },
    {
        "Amazing Stories": "Amazing Stories"
    },
    {
        ", he submitted it to that magazine; it was accepted, initially for $75, later raised to $125. Sanders, pp. 1, 9; Moskowitz, p. 15. Both sources say that T. OConor Sloane was the editor who accepted it, but Sloanes Wikipedia biography says he was managing editor until 1929, when he became editor, replacing Hugo Gernsback . It was published as a three-part serial in the August to October 1928 issues and it was such a success that managing editor Sloane requested a sequel before the second installment had been published. Moskowitz, p. 15.     Mrs. Garby was not interested in further collaboration, so Smith began work on Skylark Three alone. Moskowitz, p. 15. As noted above, Warner says that Smith had already begun work. It was published as another three-part serial, in the August to October 1930 issues of Amazing, introduced as the cover story for August. 1930 Census of Ward 3, Household 288, Family 314, Hillsdale, Michigan, recorded by Mark C. Hanselman on April 11, 1930. Copy courtesy www.ancestry.com. This was as far as he had planned to take the Skylark series; it was praised in Amazings letter column, For example, from John W. Campbell on pages 567–68 of the September issue ends by stating that Skylark of Space had been the best story of scientifiction ever printed —although most of the letter was devastating criticism of the science in the story. and he was paid ¾¢ per word, surpassing Amazings previous record of half a cent. Moskowitz p. 16     Skylark and Lensman": null
    },
    {
        "Spacehounds of IPC": "Spacehounds Of Ipc"
    },
    {
        ", Moskowitz p. 16, Sanders p. 65. which he finished in the autumn of 1930. In this novel, he took pains to avoid the scientific impossibilities which had bothered some readers of the Skylark novels. Sanders p. 65. The book does, however, have significant scientific implausibilities, for example the breathable atmosphere on Saturn and some of Jupiter and its satellites. Even in 1938, after he had written Galactic Patrol, Smith considered it his finest work; he later said of it, This was really scientific fiction; not, like the Skylarks, pseudo-science ; Sheridan p. 3 and even at the end of his career, he considered it his only work of true science fiction. Rogers p. 26. It was published in the July through September 1931 issues of Amazing, with Sloane making unauthorized changes. Moskowitz p. 16, Rogers p. 14. Fan letters in the magazine complained about the novels containment within the solar system, and Sloane sided with the readers. So when Harry Bates , editor of ": null
    },
    {
        "Astounding Stories": "Astounding Stories"
    },
    {
        ", offered Smith 2¢/word—payable on publication—for his next story, he agreed; this meant that it could not be a sequel to Spacehounds.     This book would be ": null
    },
    {
        "Triplanetary": "Triplanetary"
    },
    {
        ", in which scientific detail would not be bothered about, and in which his imagination would run riot. Warner. Indeed, characters within the story point out its psychological Lyman Clevelands comment on the easy availability of solid asteroids of iron , Amazing March 1934, p. 16, first edition p.196, as proving the pointlessness of the Nevians attack. and scientific Clevelands expectation, correct according to special relativity , that inertialess travel would not be faster than light in the home reference frame , p. 223. implausibilities, and sometimes even seem to suggest self-parody. Nerados comment, Destruction, always destruction ... they are a useless race , February p. 81, p. 160. At other times, they are conspicuously silent about obvious implausibilities. Costigan & Bradleys lack of comment when they discover that the ship they are on has passed the speed of light, February p. 84, p. 168. This is the first mention in the story of faster-than-light travel. Costigan & Bradleys failure to object, when told of the Nevians impending second raid on Tellus , that they could easily obtain iron without further destruction, February p. 88, p. 175. The January 1933 issue of Astounding announced that Triplanetary would appear in the March issue, and that issues cover illustrated a scene from the story, but Astoundings financial difficulties prevented the story from appearing. Moskowitz p. 17, Rogers p. 14. Smith then submitted the manuscript to ": null
    },
    {
        "Wonder Stories": "Wonder Stories"
    },
    {
        ", whose new editor, 17-year-old Charles D. Hornig , rejected it, later boasting about the rejection in a fanzine . Moskowitz p. 17, citing Stories We Reject in  December 1934. He finally submitted it to Amazing, which published it beginning in January 1934, but for only half a cent a word. Shortly after it was accepted, F. Orlin Tremaine , the new editor of the revived Astounding, offered one cent a word for Triplanetary; when he learned that he was too late, he suggested a third Skylark novel instead. Moskowitz p. 17     In the winter of 1933–34, Smith worked on The Skylark of Valeron, but he felt that the story was getting out of control; he sent his first draft to Tremaine, with a distraught note asking for suggestions. Tremaine accepted the rough draft for $850, and announced it in the June 1934 issue, with a full-page editorial and a three-quarter-page advertisement. The novel was published in the August 1934 through February 1935 issues. Astounding s circulation rose by 10,000 for the first issue, and its two main competitors, ": null
    },
    {
        "Amazing": "Amazing Stories"
    },
    {
        " and ": null
    },
    {
        "Wonder Stories": "Wonder Stories"
    },
    {
        ", fell into financial difficulties, both skipping issues within a year. Moskowitz p. 17–8, Rogers pp. 24–30. Rogers agrees with Moskowitz that Astounding became the leading science-fiction magazine during this period, but does not attribute this solely to Smith.     Lensman seriesAmazing Stories Quarterly, Fall 1931. Tremaine responded extremely positively to a brief description of the idea.     Once Dawn Doughnuts became profitable in late 1936, Smith wrote an 85-page outline for what became the four core ": null
    },
    {
        "Lensman": "Lensman"
    },
    {
        " novels; in early 1937, Tremaine committed to buying them. Gharlane Moskowitz p. 19, The Epic of Space p. 85. Note that Smiths account in The Epic of Space does not mention Tremaines commitment. Moskowitz says that the outline was 80 pages; Smith only mentions that the section on ": null
    },
    {
        "Galactic Patrol": "Galactic Patrol"
    },
    {
        " was only a few pages long. Segmenting the story into four novels required considerable effort to avoid dangling loose ends; Smith cites Edgar Rice Burroughs as a negative example. The Epic of Space p. 85. After the outline was complete, he wrote a more detailed outline of ": null
    },
    {
        "Galactic Patrol": "Galactic Patrol"
    },
    {
        ", plus a detailed graph of its structure, with peaks of emotional intensity and the valleys of characterization and background material. He notes, however, that he was never able to follow any of his outlines at all closely, as the characters get away from me and do exactly as they damn please. The Epic of Space p. 86. After completing the rough draft of Galactic Patrol, he wrote the concluding chapter of the last book in the series, ": null
    },
    {
        "Children of the Lens": "Children Of The Lens"
    },
    {
        ". Galactic Patrol was published in the September 1937 through February 1938 issues of Astounding; unlike the revised book edition, it was not set in the same universe as Triplanetary. The Commandants account of the Patrols early history at the beginning of the magazine version of Galactic Patrol does not describe what happened in the magazine version of Triplanetary; the reference to Virgil Samms and the Triplanetary Patrol is a later interpolation.  The reference to the days of the semi-inert drive and the Third Galactic Survey on page 34 of the same issue is not consistent with the history of partial inertialessness in either version of Triplanetary, and is omitted from page 42 of the Fantasy Press edition.  See also Gharlanes Lens FAQ Question 1. The Arisians near-omniscience about the future is also interpolated, e.g., Astounding January 1938 p. 127 vs. first edition p. 205.     ": null
    },
    {
        "Gray Lensman": "Gray Lensman"
    },
    {
        ", the fourth book in the series, appeared in Astoundings October 1939 through January 1940 issues.  Gray Lensman was extremely well received. Campbell s editorial in the December issue suggested that the October issue was the best issue of Astounding ever, and Gray Lensman was first place in the Analytical Laboratory statistics by a lightyear , with three runners-up in a distant tie for second place. Astounding December 1939 pp. 6, 91. The cover was also praised by readers in Brass Tacks, and Campbell noted, We got a letter from E. E. Smith saying he and Hubert Rogers agreed on how Kinnison looked. Astounding December 1939 pp. 104.     Smith was the guest of honor at Chicon I , the second World Science Fiction Convention , held in Chicago over Labor Day weekend 1940, Sanders p. 10, Moskowitz p. 12. giving a speech on the importance of science fiction fandom entitled What Does This Convention Mean? Resnick & Siclari. He attended the conventions masquerade as C. L. Moore s Northwest Smith , and met fans living near him in Michigan, who would later form the Galactic Roamers, which previewed and advised him on his future work. Sanders p. 10, afterword to ": null
    },
    {
        "Second Stage Lensmen": "Second Stage Lensmen"
    },
    {
        ".     Smith worked for the US Army between 1941 and 1945. An extended segment in the novel version of Triplanetary, set during World War II, suggests intimate familiarity with explosives and munitions manufacturing. Some biographers cite as fact that, just as Smiths protagonist in this segment lost his job over failure to approve substandard munitions, Smith did, as well. Smith began work for the J. W. Allen Company in 1946 and worked for them until his professional retirement in 1957.         After Smith retired, his wife and he lived in ": null
    },
    {
        "Clearwater, Florida": "Clearwater, Florida"
    },
    {
        ", in the fall and winter, driving the smaller of their two trailers to ": null
    },
    {
        "Seaside, Oregon": "Seaside, Oregon"
    },
    {
        ", each April, often stopping at ": null
    },
    {
        "science fiction conventions": "Science Fiction Convention"
    },
    {
        " on the way. In 1963, he was presented the inaugural ": null
    },
    {
        "First Fandom Hall of Fame award": "First Fandom Hall Of Fame Award"
    },
    {
        " at the ": null
    },
    {
        "21st World Science Fiction Convention": "21St World Science Fiction Convention"
    },
    {
        " in Washington, D.C. Some of his biography is captured in an essay by ": null
    },
    {
        "Robert A. Heinlein": "Robert A. Heinlein"
    },
    {
        ", which was reprinted in the collection Expanded Universe in 1980. A more detailed, although allegedly ": null
    },
    {
        "Gharlane of Eddore": "Gharlane Of Eddore"
    },
    {
        ", ": null
    }
]