[
    {
        "     Ecclesiastes   is one of 24 books of the  Tanakh  , where it is classified as one of the  Ketuvim  . Originally written c. 450–200 BCE, it is also among the canonical ": null
    },
    {
        "Wisdom literature": "Wisdom Literature"
    },
    {
        " of the ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        " in most ": null
    },
    {
        "denominations of Christianity": "Denominations Of Christianity"
    },
    {
        ". The title Ecclesiastes is a Latin ": null
    },
    {
        "transliteration": "Transliteration"
    },
    {
        " of the Greek translation of the Hebrew Kohelet , the ": null
    },
    {
        "pseudonym": "Pseudonym"
    },
    {
        " used by the author of the book.     In traditional Jewish texts and throughout church history , ": null
    },
    {
        "King Solomon": "King Solomon"
    },
    {
        " is named as the author, but modern scholars reject this. Textually, the book is the musings of a King of Jerusalem as he relates his experiences and draws lessons from them, often self-critical. The author, who is not named anywhere in the book, or in the whole of the Bible, introduces a Kohelet whom he identifies as the son of David . The author does not use his own voice throughout the book again until the final verses , where he gives his own thoughts and summarises what the Kohelet has spoken. It emphatically proclaims all the actions of man to be inherently hevel as the lives of both wise and foolish men end in death. While Qoheleth clearly endorses wisdom as a means for a well-lived earthly life, he realizes that nothing in the world will last forever and so he deems everything to be hevel .  In light of this perceived senselessness, he suggests that one should enjoy the simple pleasures of daily life such as eating, drinking, and taking enjoyment in ones work, which are gifts from the hand of God. The book concludes with the injunction: Fear God, and keep his commandments; for that is the whole duty of everyone .     Ecclesiastes has had a deep influence on Western literature. It contains several phrases that have resonated in British and American culture, and was quoted by ": null
    },
    {
        "Abraham Lincoln": "Abraham Lincoln"
    },
    {
        " addressing Congress in 1862. American novelist ": null
    },
    {
        "Thomas Wolfe": "Thomas Wolfe"
    },
    {
        " wrote:          Ecclesiastes is presented as biography of Kohelet . Kohelets story is framed by voice of the narrator, who refers to Kohelet in the third person, praises his wisdom, but reminds the reader that wisdom has its limitations and is not mans main concern. Kohelet reports what he planned, did, experienced and thought. His journey to knowledge is, in the end, incomplete. The reader is not only to hear Kohelets wisdom, but to observe his journey towards understanding and acceptance of lifes frustrations and uncertainties: the journey itself is important.     Few of the many attempts to uncover an underlying structure to Ecclesiastes have met with widespread acceptance; among them, the following is one of the more influential:      Most, though not all, modern commentators regard the epilogue as an addition by a later scribe. Some have identified certain other statements as further additions intended to make the book more religiously orthodox .       The ten-verse introduction in verses 1:2–11 are the words of the frame narrator; they set the mood for what is to follow: Kohelets message is that all is meaningless.     After the introduction come the words of Kohelet. As king he has experienced everything and done everything, but nothing is ultimately reliable. Death levels all. The only good is to partake of life in the present, for enjoyment is from the hand of God. Everything is ordered in time and people are subject to time in contrast to Gods eternal character. The world is filled with injustice, which only God will adjudicate. God and humans do not belong in the same realm and it is therefore necessary to have a right attitude before God. People should enjoy, but should not be greedy; no-one knows what is good for humanity; righteousness and wisdom escape us. Kohelet reflects on the limits of human power: all people face death, and death is better than life, but we should enjoy life when we can. The world is full of risk: he gives advice on living with risk, both political and economic. Mortals should take pleasure when they can, for a time may come when no one can. Kohelets words finish with imagery of nature languishing and humanity marching to the grave.     The frame narrator returns with an epilogue: the words of the wise are hard, but they are applied as the shepherd applies goads and pricks to his flock. The ending of the book sums up its message: Fear God and keep his commandments for God will bring every deed to judgement.  Apparently, 12:13-14 were an addition by a more orthodox author than the original writer.            The book takes its name from the Greek ekklesiastes, a translation of the title by which the central figure refers to himself: Kohelet, meaning something like one who convenes or addresses an assembly . According to rabbinic tradition, Ecclesiastes was written by ": null
    },
    {
        "Solomon": "Solomon"
    },
    {
        " in his old age , but critical scholars have long rejected the idea of a pre-exilic origin. The presence of ": null
    },
    {
        "Persian": "Old Persian"
    },
    {
        " loan-words and ": null
    },
    {
        "Aramaisms": "Imperial Aramaic"
    },
    {
        " points to a date no earlier than about 450 BCE, while the latest possible date for its composition is 180 BCE, when the Jewish writer ": null
    },
    {
        "Ben Sira": "Ben Sira"
    },
    {
        " quotes from it. The dispute as to whether Ecclesiastes belongs to the ": null
    },
    {
        "Persian": "Achaemenid Empire"
    },
    {
        " or the ": null
    },
    {
        "Hellenistic": "Hellenistic Period"
    },
    {
        " periods revolves around the degree of ": null
    },
    {
        "Hellenization": "Hellenization"
    },
    {
        " present in the book. Scholars arguing for a Persian date hold that there is a complete lack of Greek influence; those who argue for a Hellenistic date argue that it shows internal evidence of Greek thought and social setting.     Also unresolved is whether the author and narrator of Kohelet are one and the same person. Ecclesiastes regularly switches between third-person quotations of Kohelet and first-person reflections on Kohelets words, which would indicate the book was written as a commentary on Kohelets parables rather than a personally-authored repository of his sayings. Some scholars have argued that the third-person narrative structure is an artificial literary device along the lines of ": null
    },
    {
        "Uncle Remus": "Uncle Remus"
    },
    {
        ", although the description of the Kohelet in 12:8–14 seems to favour a historical person whose thoughts are presented by the narrator. The question, however, has no theological importance, and one scholar has commented that Kohelet himself would have regarded the time and ingenuity put into interpreting his book as one more example of the ": null
    },
    {
        "futility of human effort": "Fatalism"
    },
    {
        " .       Ecclesiastes has taken its literary form from the Middle Eastern tradition of the fictional autobiography, in which a character, often a king, relates his experiences and draws lessons from them, often self-critical: Kohelet likewise identifies himself as a king, speaks of his search for wisdom, relates his conclusions, and recognises his limitations. It belongs to the category of ": null
    },
    {
        "wisdom literature": "Wisdom Literature"
    },
    {
        ", the body of biblical writings which give advice on life, together with reflections on its problems and meanings—other examples include the ": null
    },
    {
        "Book of Job": "Book Of Job"
    },
    {
        ", ": null
    },
    {
        "Proverbs": "Book Of Proverbs"
    },
    {
        ", and some of the ": null
    },
    {
        "Psalms": "Book Of Psalms"
    },
    {
        ". Ecclesiastes differs from the other biblical Wisdom books in being deeply skeptical of the usefulness of Wisdom itself. Ecclesiastes in turn influenced the ": null
    },
    {
        "deuterocanonical": "Deuterocanonical"
    },
    {
        " works, ": null
    },
    {
        "Wisdom of Solomon": "Wisdom Of Solomon"
    },
    {
        " and ": null
    },
    {
        "Sirach": "Sirach"
    },
    {
        ", both of which contain vocal rejections of the Ecclesiastical philosophy of futility.     Wisdom was a popular genre in the ancient world, where it was cultivated in scribal circles and directed towards young men who would take up careers in high officialdom and royal courts; there is strong evidence that some of these books, or at least sayings and teachings, were translated into Hebrew and influenced the Book of Proverbs, and the author of Ecclesiastes was probably familiar with examples from Egypt and Mesopotamia. He may also have been influenced by Greek philosophy, specifically the schools of ": null
    },
    {
        "Stoicism": "Stoicism"
    },
    {
        ", which held that all things are fated, and ": null
    },
    {
        "Epicureanism": "Epicureanism"
    },
    {
        ", which held that happiness was best pursued through the quiet cultivation of lifes simpler pleasures.       The presence of Ecclesiastes in the Bible is something of a puzzle, as the common themes of the Hebrew canon—a God who reveals and redeems, who elects and cares for a chosen people—are absent from it, which suggests that Kohelet had lost his faith in his old age. Understanding the book was a topic of the earliest recorded discussions . One argument advanced then was that the name of Solomon carried enough authority to ensure its inclusion, but other works which appeared with Solomons name were excluded despite being more orthodox than Ecclesiastes.  Another was that the words of the epilogue, in which the reader is told to fear God and keep his commands, made it orthodox; but all later attempts to find anything in the rest of the book that would reflect this orthodoxy have failed. A modern suggestion treats the book as a dialogue in which different statements belong to different voices, with Kohelet himself answering and refuting unorthodox opinions, but there are no explicit markers for this in the book, as there are, for example in the ": null
    },
    {
        "Book of Job": "Book Of Job"
    },
    {
        ". Yet another suggestion is that Ecclesiastes is simply the most extreme example of a tradition of skepticism, but none of the proposed examples match Ecclesiastes for a sustained denial of faith and doubt in the goodness of God. In short, we do not know why or how this book found its way into such esteemed company, summarizes Martin A. Shields in his 2006 book The End of Wisdom: A Reappraisal of the Historical and Canonical Function of Ecclesiastes.       Scholars disagree about the themes of Ecclesiastes: whether it is positive and life-affirming, or deeply pessimistic; whether it is coherent or incoherent, insightful or confused, orthodox or heterodox; whether the ultimate message of the book is to copy Kohelet, the wise man, or to avoid his errors. At times Kohelet raises deep questions; he doubted every aspect of religion, from the very ideal of righteousness, to the by now traditional idea of divine justice for individuals.  Some passages of Ecclesiastes seem to contradict other portions of the Old Testament, and even itself. One suggestion for resolving the contradictions is to read the book as the record of Kohelets quest for knowledge: opposing judgments are therefore provisional, and it is only at the conclusion that the verdict is delivered . On this reading, Kohelets sayings are goads, designed to provoke dialogue and reflection in his readers, rather than to reach premature and self-assured conclusions.     The subjects of Ecclesiastes are the pain and frustration engendered by observing and meditating on the distortions and inequities pervading the world, the uselessness of human deeds, and the limitations of wisdom and righteousness. The phrase under the sun appears thirty times in connection with these observations; all this coexists with a firm belief in God, whose power, justice and unpredictability are sovereign. History and nature move in cycles, so that all events are predetermined and unchangeable, and life has no meaning or purpose: the wise man and the man who does not study wisdom will both die and be forgotten: man should be reverent , but in this life it is best to simply enjoy Gods gifts.       In Judaism, Ecclesiastes is read either on ": null
    },
    {
        "Shemini Atzeret": "Shemini Atzeret"
    },
    {
        "  or on the ": null
    },
    {
        "Shabbat": "Shabbat"
    },
    {
        " of the Intermediate Days of ": null
    },
    {
        "Sukkot": "Sukkot"
    },
    {
        " . If there is no Intermediate Sabbath of ": null
    },
    {
        "Sukkot": "Sukkot"
    },
    {
        ", even the Ashkenazim read it on ": null
    },
    {
        "Shemini Atzeret": "Shemini Atzeret"
    },
    {
        " . It is read on Sukkot as a reminder to not get too caught up in the festivities of the holiday, as well as to carry over the happiness of Sukkot to the rest of the year by telling the listeners that, without God, life is meaningless. When the listeners take this to heart, then true happiness can be achieved throughout the year.     The final poem of Kohelet  has been interpreted in the ": null
    },
    {
        "Targum": "Targum"
    },
    {
        ", Talmud and ": null
    },
    {
        "Midrash": "Midrash"
    },
    {
        ", and by the rabbis ": null
    },
    {
        "Rashi": "Rashi"
    },
    {
        ", ": null
    },
    {
        "Rashbam": "Rashbam"
    },
    {
        " and ": null
    },
    {
        "ibn Ezra": "Abraham Ibn Ezra"
    },
    {
        ", as an allegory of old age.       Ecclesiastes has been cited in the writings of past and current ": null
    },
    {
        "Catholic Church": "Roman Catholic"
    },
    {
        " leaders. For example, ": null
    },
    {
        "doctors of the Church": "Doctors Of The Church"
    },
    {
        " have cited Ecclesiastes. ": null
    },
    {
        "St. Augustine of Hippo": "Augustine Of Hippo"
    },
    {
        " cited Ecclesiastes in Book XX of  City of God . Augustine, . Accessed 2015-06-28. ": null
    },
    {
        "Saint Jerome": "Saint Jerome"
    },
    {
        " wrote a commentary on Ecclesiastes. Jerome, . Accessed 2015-09-09. ": null
    },
    {
        "St. Thomas Aquinas": "St. Thomas Aquinas"
    },
    {
        " cited Ecclesiastes in his  Summa Theologica . Thomas Aquinas, . Accessed 2015-09-09.     The twentieth-century Catholic theologian and cardinal-elect ": null
    },
    {
        "Hans Urs von Balthasar": "Hans Urs Von Balthasar"
    },
    {
        " discusses Ecclesiastes in his work on theological aesthetics, The Glory of the Lord. He describes Qoheleth as a ": null
    },
    {
        "critical transcendentalist": "Transcendental Idealism"
    },
    {
        " avant la lettre , whose God is distant from the world, and whose  kairos  is a form of time which is itself empty of meaning . For Balthasar, the role of Ecclesiastes in the Biblical canon is to represent the final dance on the part of wisdom, conclusion of the ways of man , a logical end-point to the unfolding of human wisdom in the Old Testament that paves the way for the advent of the New.      The book continues to be cited by recent ": null
    },
    {
        "popes": "Pope"
    },
    {
        ", including ": null
    },
    {
        "Pope John Paul II": "Pope John Paul Ii"
    },
    {
        " and ": null
    },
    {
        "Pope Francis": "Pope Francis"
    },
    {
        ". Pope John Paul II, in his general audience of October 20, 2004, called the author of Ecclesiastes an ancient biblical sage whose description of death makes frantic clinging to earthly things completely pointless.  Pope Francis cited Ecclesiastes on his address on September 9, 2014. Speaking of vain people, he said, How many Christians live for appearances? Their life seems like a ": null
    },
    {
        "soap bubble": "Soap Bubble"
    },
    {
        ". Pope Francis, . Accessed 2015-09-09.       Ecclesiastes has had a deep influence on Western literature. It contains several phrases that have resonated in British and American culture, such as eat, drink and be merry, nothing new under the sun, a time to be born and a time to die, and vanity of vanities; all is ": null
    },
    {
        "vanity": "Vanity"
    },
    {
        ".  American novelist ": null
    },
    {
        "Thomas Wolfe": "Thomas Wolfe"
    },
    {
        " wrote: all I have ever seen or learned, that book seems to me the noblest, the wisest, and the most powerful expression of mans life upon this earth—and also the highest flower of poetry, eloquence, and truth. I am not given to dogmatic judgments in the matter of literary creation, but if I had to make one I could say that Ecclesiastes is the greatest single piece of writing I have ever known, and the wisdom expressed in it the most lasting and profound.  ": null
    },
    {
        "Abraham Lincoln": "Abraham Lincoln"
    },
    {
        " quoted Ecclesiastes 1:4 in his address to the reconvening Congress on December 1, 1862, during the darkest hours of the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        "   The opening of ": null
    },
    {
        "William Shakespeares": "William Shakespeare"
    },
    {
        " Sonnet 59": "Sonnet 59"
    },
    {
        " references Ecclesiastes 1:9–10.   ": null
    },
    {
        "Leo Tolstoys": "Leo Tolstoy"
    },
    {
        "  Confession  describes how the reading of Ecclesiastes affected his life.   ": null
    },
    {
        "Robert Burns": "Robert Burns"
    },
    {
        " Address to the Unco Guid begins with a verse appeal to Ecclesiastes 7:16.   The title of ": null
    },
    {
        "Ernest Hemingways": "Ernest Hemingway"
    },
    {
        " first novel  The Sun Also Rises  was taken from Ecclesiastes 1:5.   The title of ": null
    },
    {
        "Edith Wharton": "Edith Wharton"
    },
    {
        "’s novel  House of Mirth  was taken from Ecclesiastes 7:4 .   The title of ": null
    },
    {
        "Laura Lippmans": "Laura Lippman"
    },
    {
        " novel,  Every Secret Thing , and of ": null
    },
    {
        "its film adaptation": "Every Secret Thing"
    },
    {
        ", come from Ecclesiastes 12:14,    The main character in ": null
    },
    {
        "George Bernard Shaws": "George Bernard Shaw"
    },
    {
        " short story  The Adventures of the Black Girl in Her Search for God   meets Koheleth known to many as Ecclesiastes .   The title and theme of George R. Stewarts post-apocalyptic novel  Earth Abides  is from Ecclesiastes 1:4.   In the dystopian novel  Fahrenheit 451  ": null
    },
    {
        "Ray Bradburys": "Ray Bradbury"
    },
    {
        " main character, ": null
    },
    {
        "Montag": "Guy Montag"
    },
    {
        ", memorizes much of Ecclesiastes and Revelation in a world where books are forbidden and burned.   ": null
    },
    {
        "Pete Seegers": "Pete Seeger"
    },
    {
        " song ": null
    },
    {
        "Turn! Turn! Turn!": "Turn! Turn! Turn!"
    },
    {
        " takes all but one of its lines from the ": null
    },
    {
        "Book of Ecclesiastes chapter 3": "Ecclesiastes 3"
    }
]