[
    {
        "                 An episcopal polity is a ": null
    },
    {
        "hierarchical": "Hierarchy"
    },
    {
        " form of ": null
    },
    {
        "church governance ": "Ecclesiastical Polity"
    },
    {
        " in which the chief local authorities are called ": null
    },
    {
        "bishop": "Bishop"
    },
    {
        "s.  It is the structure used by many of the major ": null
    },
    {
        "Christian Church": "Christian Church"
    },
    {
        "es and ": null
    },
    {
        "denomination": "Christian Denomination"
    },
    {
        "s, such as the ": null
    },
    {
        "Catholic": "Catholic"
    },
    {
        ", ": null
    },
    {
        "Eastern Orthodox": "Eastern Orthodox Church"
    },
    {
        ", ": null
    },
    {
        "Oriental Orthodox": "Oriental Orthodoxy"
    },
    {
        ", ": null
    },
    {
        "Church of the East": "Church Of The East"
    },
    {
        ", ": null
    },
    {
        "Anglican": "Anglicanism"
    },
    {
        ", and ": null
    },
    {
        "Lutheran": "Lutheranism"
    },
    {
        " churches or denominations, and other churches founded independently from these lineages.     Churches with an episcopal ": null
    },
    {
        "polity": "Polity"
    },
    {
        " are governed by bishops, practicing their authorities in the ": null
    },
    {
        "dioceses": "Diocese"
    },
    {
        "and ": null
    },
    {
        "conferences": "Episcopal Conference"
    },
    {
        "or ": null
    },
    {
        "synod": "Synod"
    },
    {
        "s. Their leadership is both ": null
    },
    {
        "sacrament": "Sacrament"
    },
    {
        "al and constitutional; as well as performing ": null
    },
    {
        "ordination": "Ordination"
    },
    {
        "s, ": null
    },
    {
        "confirmation": "Confirmation"
    },
    {
        "s, and ": null
    },
    {
        "consecration": "Consecration"
    },
    {
        "s, the bishop supervises the ": null
    },
    {
        "clergy": "Clergy"
    },
    {
        " within a local jurisdiction and is the representative both to secular structures and within the hierarchy of the church. Bishops are considered to derive their authority from an unbroken, personal ": null
    },
    {
        "apostolic succession": "Apostolic Succession"
    },
    {
        " from the ": null
    },
    {
        "Twelve Apostles": "Twelve Apostles"
    },
    {
        " of ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        ". Bishops with such authority are said to represent the ": null
    },
    {
        "historical episcopate": "Historical Episcopate"
    },
    {
        " or historic episcopate. Churches with this type of government usually believe that the Church requires episcopal government as described in the New Testament . In some systems, bishops may be subject to bishops holding a higher office . They also meet in councils or ": null
    },
    {
        "synods": "Synods"
    },
    {
        ". These gatherings, subject to presidency by higher ranking bishops, usually make important decisions, though the ": null
    },
    {
        "synod": "Synod"
    },
    {
        " or council may also be purely advisory.     For much of the ": null
    },
    {
        "written history": "Recorded History"
    },
    {
        " of institutional Christianity, episcopal government was the only known form of church organization. This changed at the ": null
    },
    {
        "Reformation": "Protestant Reformation"
    },
    {
        ". Many ": null
    },
    {
        "Protestant": "Protestantism"
    },
    {
        " churches are now organized by either ": null
    },
    {
        "congregational": "Congregationalist Polity"
    },
    {
        " or ": null
    },
    {
        "presbyterian": "Presbyterian Polity"
    },
    {
        " church polities, both descended from the writings of ": null
    },
    {
        "John Calvin": "John Calvin"
    },
    {
        ", a Protestant reformer working and writing independently following the break with the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        " precipitated by ": null
    },
    {
        "The Ninety-Five Theses": "The Ninety-Five Theses"
    },
    {
        " of ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        ".          The definition of the word episcopal has variation among Christian traditions. There are subtle differences in governmental principles among episcopal churches at the present time. To some extent the separation of episcopal churches can be traced to these differences in ": null
    },
    {
        "ecclesiology": "Ecclesiology"
    },
    {
        ", that is, their theological understanding of church and church governance. For some, episcopal churches are churches that use a hierarchy of bishops that regard themselves as being in an unbroken, personal ": null
    },
    {
        "apostolic succession": "Apostolic Succession"
    },
    {
        ".     Episcopal is also commonly used to distinguish between the various organizational structures of ": null
    },
    {
        "denominations": "Christian Denomination"
    },
    {
        ". For instance, Presbyterian  is used to describe a church governed by a hierarchy of assemblies of elected ": null
    },
    {
        "elders": "Elder"
    },
    {
        ", referred to as ": null
    },
    {
        "Presbyterian polity": "Presbyterian Polity"
    },
    {
        ". Similarly, episcopal is used to describe a church governed by bishops. Self-governed local congregations, governed neither by elders nor bishops, are usually described as ": null
    },
    {
        "congregational": "Congregational Polity"
    },
    {
        " .     More specifically, the capitalized appellation Episcopal is applied to several churches historically based within ": null
    },
    {
        "Anglicanism": "Anglicanism"
    },
    {
        " , including those still in communion with the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ".     Using these definitions, examples of specific episcopal churches include:   The ": null
    },
    {
        "Catholic Church": "Roman Catholic Church"
    },
    {
        " Eastern Orthodox Church": "Eastern Orthodox Church"
    },
    {
        " Oriental Orthodox": "Oriental Orthodox"
    },
    {
        " churches   The ": null
    },
    {
        "Assyrian Church of the East": "Assyrian Church Of The East"
    },
    {
        " Anglican Communion": "Anglican Communion"
    },
    {
        " Old Catholic": "Old Catholic"
    },
    {
        " churches   Numerous smaller ": null
    },
    {
        " catholic churches": "Catholic Church"
    },
    {
        " Lutheran": "Lutheran"
    },
    {
        " confession   The ": null
    },
    {
        "African Methodist Episcopal Church": "African Methodist Episcopal Church"
    },
    {
        " United Methodist Church": "United Methodist Church"
    },
    {
        "     Some ": null
    },
    {
        "Lutheran": "Lutheran"
    },
    {
        " churches practice congregational polity or a form of presbyterian polity. Encyclopedia of Religion and Society, William H. Swatos, Jr. Editor  Hartford Institute for Religion Research, Hartford Seminary. Retrieved on September 4, 2006. Others, including the ": null
    },
    {
        "Church of Sweden": "Church Of Sweden"
    },
    {
        ", practice episcopal polity; the Church of Sweden also counts its bishops among the ": null
    },
    {
        "historic episcopate": "Historical Episcopate"
    },
    {
        " as do some American Lutheran churches like the ": null
    },
    {
        "Anglo-Lutheran Catholic Church": "Anglo-Lutheran Catholic Church"
    },
    {
        ", ": null
    },
    {
        "Lutheran Orthodox Church": "Lutheran Orthodox Church"
    },
    {
        ", ": null
    },
    {
        "Lutheran Church - International": "Lutheran Church - International"
    },
    {
        ", and the ": null
    },
    {
        "Lutheran Episcopal Communion": "Lutheran Episcopal Communion"
    },
    {
        ".     Many ": null
    },
    {
        "Methodist": "Methodist"
    },
    {
        " churches  retain the form and function of episcopal polity, although in a modified form, called ": null
    },
    {
        "connexionalism": "Connexionalism"
    },
    {
        ". Since all trace their ordinations to an Anglican priest, ": null
    },
    {
        "John Wesley": "John Wesley"
    },
    {
        ", it is generally considered that their bishops do not share in apostolic succession, though United Methodists still affirm that their bishops share in the historic episcopate.             All orthodox Christians were in churches with an episcopal government, that is, one Church under local bishops and regional ": null
    },
    {
        "Patriarch": "Patriarch"
    },
    {
        "s. Writing between ca. 85 and 110, St. ": null
    },
    {
        "Ignatius of Antioch": "Ignatius Of Antioch"
    },
    {
        ", Patriarch of Antioch, was the earliest of the Church fathers to define the importance of episcopal government. Assuming Ignatius view was the Apostolic teaching and practice, the line of succession was unbroken and passed through the four ancient Patriarchal sees , Rome, Jerusalem, Antioch and Alexandria. Rome was the leading Patriarchate of the ancient four by virtue of its founding by Saints ": null
    },
    {
        "Peter": "Saint Peter"
    },
    {
        " and ": null
    },
    {
        "Paul": "Paul The Apostle"
    },
    {
        " and their martyrdom there, not to mention being the political center of the Roman empire at the time. Some organizations , though aloof from the political wranglings of imperial Christianity, nevertheless also practiced episcopal polity.     Shortly after the Roman Emperor ": null
    },
    {
        "Constantine I": "Constantine I"
    },
    {
        " legalized Christianity in 321, he also constructed an elaborate second capital of the Roman Empire located at ": null
    },
    {
        "Byzantium": "Byzantium"
    },
    {
        " and renamed it ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        ", in 324. The single Roman Empire was divided between these two autonomous administrative centers, Roman and Constantinopolitan, West and East, Latin speaking and Greek speaking. This remained the status quo through the fourth century. A deep chasm developed between the East and West, becoming critical around 350, known as the Arian, or Nicene controversy. The Eastern Christian Churches were thought by Constantine to believe against the Trinity; that Christ was lesser than God. Hilary, Bishop of Poitiers, France, believed that the Eastern Church should be given the opportunity to, at least, be educated on the subject. Constantine, in his wisdom, and upset by disagreement, banished Hilary to the East. Hilary perfected his Greek language skills while in exile, and determined the great divide between Rome and the East was actually not a disagreement at all, and was merely a linguistic ignorance on the part of his Latin speaking contemporaries. This truth became known in the West, though some differences lingered. ": null
    },
    {
        "Hilary of Poitiers": "Hilary Of Poitiers"
    },
    {
        " later became St. Hilary, Doctor of the Church, for exposing the true Christian beliefs of the Eastern Church. Many of Hilarys writings were lost to time.     In the fifth century, Pope Dioscorus, the ": null
    },
    {
        "Patriarch of Alexandria": "Patriarch Of Alexandria"
    },
    {
        ", rejected certain Christological dogmas promulgated by the ": null
    },
    {
        "Council of Chalcedon": "Council Of Chalcedon"
    },
    {
        ", and as a result, the Oriental Orthodox churches split from the rest; however they continued the episcopal tradition, and today in fact there is dialog between the various orthodox churches over whether the schism was due to real differences or simply translation failures.     Also during the fifth century, the Western Roman Empire declined and was overrun by German and Frankish peoples. Although the city of Rome was in ruins, distant from the seat of secular power, and constantly harassed by invaders, the Roman Patriarchate remained the center of the Western or Latin Church. Claiming the ancient ": null
    },
    {
        "primacy of Peter": "Primacy Of Peter"
    },
    {
        " and the title of ": null
    },
    {
        "Apostolic See": "Apostolic See"
    },
    {
        " , it remained the last ": null
    },
    {
        "court of episcopal appeal": "Ecclesiastical Court"
    },
    {
        " in serious matters for the whole Church, East and West. However, the center of the civilized Roman world had shifted definitively to Constantinople, or ": null
    },
    {
        "New Rome": "New Rome"
    },
    {
        ", the capital of the Greek speaking Empire. Along with this shift, the effective administration of the Church in the Eastern Roman Empire also shifted. This practical eminence of Constantinople in the East is evident, first at the ": null
    },
    {
        "First Council of Constantinople": "First Council Of Constantinople"
    },
    {
        " 381, and then ecumenically at the ": null
    },
    {
        "Council of Chalcedon": "Council Of Chalcedon"
    },
    {
        " in 451.     Beginning with ": null
    },
    {
        "John the Faster": "John The Faster"
    },
    {
        " , the Bishop of Constantinople adopted as a formal title for himself the by then customary honorific ": null
    },
    {
        "Ecumenical Patriarch": "Ecumenical Patriarch"
    },
    {
        " over the strong objections of Rome, a title based on the political prestige of Constantinople and its economic and cultural centrality in the Empire. In the following years, Romes appeals to the East were based on the unique authority of the ": null
    },
    {
        "Apostolic See": "Apostolic See"
    },
    {
        " and the ": null
    },
    {
        "primacy of Peter": "Primacy Of Peter"
    },
    {
        ", over the powers of councils as defended by the East .     The sometimes subtle differences between Eastern and Western conceptions of authority and its exercise produced a gradually widening rift between the Churches which continued with some occasional relief throughout the following centuries until the final rupture of the ": null
    },
    {
        "Great Schism": "East–West Schism"
    },
    {
        " .               The ": null
    },
    {
        "Catholic Church": "Roman Catholic Church"
    },
    {
        " has an episcopate, with the ": null
    },
    {
        "Pope": "Pope"
    },
    {
        ", who is the ": null
    },
    {
        "Bishop": "Bishop"
    },
    {
        " of ": null
    },
    {
        "Rome": "Diocese Of Rome"
    },
    {
        ", at the top. The Catholic Church considers that juridical oversight over the Church is not a power that derives from human beings, but strictly from the authority of Christ, which was given to his twelve ": null
    },
    {
        "apostle": "Apostle"
    },
    {
        "s. The ": null
    },
    {
        "See of Rome": "See Of Rome"
    },
    {
        ", as the unbroken line of apostolic authority descending from St. Peter , is a visible sign and instrument of communion among the college of bishops and therefore also of the local churches around the world. In communion with the worldwide ": null
    },
    {
        "college of bishops": "College Of Bishops"
    },
    {
        ", the Pope has all legitimate juridical and teaching authority over the whole Church. This authority given by Christ to St. Peter and the apostles is transmitted from one generation to the next by the power of the ": null
    },
    {
        "Holy Spirit": "Holy Spirit"
    },
    {
        ", through the ": null
    },
    {
        "laying on of hands": "Laying On Of Hands"
    },
    {
        " from the Apostles to the bishops, in unbroken succession.       The conciliar idea of episcopal government continues in the ": null
    },
    {
        "Eastern Orthodox Church": "Eastern Orthodox Church"
    },
    {
        ". In Eastern Orthodoxy, all ": null
    },
    {
        "autocephalous": "Autocephaly"
    },
    {
        " primates": "Primate"
    },
    {
        " are seen as collectively gathering around Christ, with other archbishops and bishops gathering around them, and so forth, in a model called conciliar hierarchy . This is based in part on the vision in the ": null
    },
    {
        "book of Revelation": "Book Of Revelation"
    },
    {
        " of the 24 elders gathered around the throne of Christ, who are believed to represent the 12 patriarchs of Israel and the 12 apostles of Jesus Christ. There is no single Patriarch with exclusive authority comparable to the Pope in Rome. However, the Patriarch of Constantinople is seen as the  primus inter pares , the first among equals of the autocephalous churches of Eastern Orthodoxy.       The ": null
    },
    {
        "Oriental Orthodox Churches": "Oriental Orthodoxy"
    },
    {
        " affirm the ideas of apostolic succession and episcopal government. Within each national Church, the bishops form a holy ": null
    },
    {
        "synod": "Synod"
    },
    {
        " to which even the Patriarch is subject. The ": null
    },
    {
        "Syriac Orthodox Church": "Syriac Orthodox Church"
    },
    {
        " traces its ": null
    },
    {
        "apostolic succession": "Apostolic Succession"
    },
    {
        " to St. Peter and recognises Antioch as the original ": null
    },
    {
        "See of St. Peter": "See Of St. Peter"
    },
    {
        ". The ": null
    },
    {
        "Armenian Apostolic Church": "Armenian Apostolic Church"
    },
    {
        " traces its lineage to the Apostle Bartholomew. The ": null
    },
    {
        "Indian Orthodox Church": "Indian Orthodox Church"
    },
    {
        " traces its lineage to the Apostle Thomas. The ": null
    },
    {
        "Ethiopian Orthodox Church": "Ethiopian Orthodox Church"
    },
    {
        " received its lines of succession through the ": null
    },
    {
        "Coptic Orthodox Church": "Coptic Orthodox Church"
    },
    {
        " in the fifth century.     Both the ": null
    },
    {
        "Greek": "Greek Orthodox Church Of Alexandria"
    },
    {
        " and Coptic Orthodox Churches each recognise their own Pope of Alexandria , both of whom trace their apostolic succession back to the ": null
    },
    {
        "Mark the Evangelist": "Mark The Evangelist"
    },
    {
        ". ": null
    },
    {
        "Eusebius of Caesarea": "Eusebius Of Caesarea"
    },
    {
        ", the author of an  Ecclesiastical History  in the 4th century, states that St. Mark came to Egypt in the first or third year of the reign of Emperor Claudius, i.e. 41 or 43 AD. Two Thousand Years of Coptic Christianity , Otto F.A. Meinardus, p. 28. There are official ongoing efforts in recent times to heal this ancient breach. Already, the two recognize each others ": null
    },
    {
        "baptism": "Baptism"
    },
    {
        "s, ": null
    },
    {
        "chrismation": "Chrismation"
    },
    {
        "s, and ": null
    },
    {
        "marriage": "Marriage"
    },
    {
        "s, making intermarriage much easier.       Historically, the ": null
    },
    {
        "Church of the East": "Church Of The East"
    },
    {
        " has traced its episcopal succession to St. Thomas the Apostle. Currently the bishops of the ": null
    },
    {
        "Assyrian Church of the East": "Assyrian Church Of The East"
    },
    {
        " continue to maintain its apostolic succession.          ": null
    },
    {
        "Anglicanism": "Anglicanism"
    },
    {
        " is the most prominent of the ": null
    },
    {
        "Reformation": "English Reformation"
    },
    {
        " traditions to lay claim to the historic episcopate through ": null
    },
    {
        "apostolic succession": "Apostolic Succession"
    },
    {
        " in terms comparable to the various Roman Catholic and Orthodox Communions. Anglicans assert unbroken episcopal succession in and through the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        " back to ": null
    },
    {
        "St. Augustine of Canterbury": "Augustine Of Canterbury"
    },
    {
        " and to the first century ": null
    },
    {
        "Roman province": "Roman Province"
    },
    {
        " of ": null
    },
    {
        "Britannia": "Roman Province Of Britannia"
    },
    {
        ". While some Celtic Christian practices were changed at the ": null
    },
    {
        "Synod of Whitby": "Synod Of Whitby"
    },
    {
        ", the church in the British Isles was under papal authority from earliest times. Marcus Holden and Andrew Pinsent, The Catholic Gift to Civilisation , p.13ff     The legislation of ": null
    },
    {
        "Henry VIII": "Henry Viii Of England"
    },
    {
        " effectively establishing the independence from Rome of the Church of England, did not alter its constitutional or pastoral structures. ": null
    },
    {
        "Royal supremacy": "Royal Supremacy"
    },
    {
        " was exercised through the extant legal structures of the church, whose leaders were bishops. Episcopacy was thus seen as a given of the Reformed Ecclesia Anglicana, and a foundation in the institutions appeal to ancient and apostolic legitimacy. What did change was that bishops were now seen to be ministers of the Crown for the spiritual government of its subjects. The influence of ": null
    },
    {
        "Richard Hooker": "Richard Hooker"
    },
    {
        " was crucial to an evolution in this understanding in which bishops came to be seen in their more traditional role as ones who delegate to the ": null
    },
    {
        "presbyterate": "Presbyterate"
    },
    {
        " inherited powers, act as pastors to presbyters, and holding a particular teaching office with respect to the wider church.        Anglican opinion has differed as to the way in which episcopal government is de jure divino . On the one hand, the seventeenth century divine, ": null
    },
    {
        "John Cosin": "John Cosin"
    },
    {
        ", held that episcopal authority is jure divino, but that it stemmed from apostolic practice and the customs of the Church... absolute precept that either Christ or His Apostles gave about it . Cosin, Works, Vol. IV , p. 402 In contrast, ": null
    },
    {
        "Lancelot Andrewes": "Lancelot Andrewes"
    },
    {
        " and others held that episcopal government is derived from Christ via the apostles. Regardless, both parties viewed the episcopacy as bearing the apostolic function of oversight, which both includes, and derives from the power of ordination, and is normative for the governance of the church. The practice of apostolic succession both ensures the legitimacy of the churchs mission and establishes the unity, communion, and continuity of the local church with the universal church. This formulation, in turn, laid the groundwork for an independent view of the church as a sacred society distinct from civil society, which was so crucial for the development of local churches as non-established entities outside England, and gave direct rise to the ": null
    },
    {
        "Catholic Revival": "Catholic Revival"
    },
    {
        " and ": null
    },
    {
        "disestablishmentarianism": "Disestablishmentarianism"
    },
    {
        " within England.     Functionally, Anglican episcopal authority is expressed ": null
    },
    {
        "synod": "Synod"
    },
    {
        "ically, although individual provinces may accord their ": null
    },
    {
        "primate": "Primate"
    },
    {
        " with more or less authority to act independently. Called variously synods, councils, or conventions, they meet under episcopal chairmanship. In many jurisdictions, conciliar resolutions that have been passed require episcopal assent or consent to take force. Seen in this way, Anglicans often speak of the bishop-in-synod as the force and authority of episcopal governance. Such conciliar authority extends to the standard areas of doctrine, ": null
    },
    {
        "discipline": "Church Discipline"
    },
    {
        ", and worship, but in these regards is limited by Anglicanisms tradition of the limits of authority. Those limits are expressed in Article XXI of the ": null
    },
    {
        "Thirty-Nine Articles": "Thirty-Nine Articles"
    },
    {
        " of Religion, ratified in 1571 , which held that General Councils...may err, and sometimes have erred...wherefore things ordained by them as necessary to salvation have neither strength nor authority, unless it may be declared that they be taken out of holy Scripture. Hence, Anglican jurisdictions have traditionally been conservative in their approach to either innovative doctrinal development or in encompassing actions of the church as doctrinal .     Anglican synodical government, though varied in expression, is characteristically representative. Provinces of the ": null
    },
    {
        "Anglican Communion": "Anglican Communion"
    },
    {
        ", their ": null
    },
    {
        "ecclesiastical provinces": "Ecclesiastical Province"
    },
    {
        "and ": null
    },
    {
        "dioceses": "Diocese"
    },
    {
        "are governed by councils consisting not only of bishops, but also representatives of the ": null
    },
    {
        "presbyterate": "Presbyterate"
    },
    {
        " and ": null
    },
    {
        "laity": "Laity"
    },
    {
        ".     There is no international juridical authority in Anglicanism, although the traditions common experience of episcopacy, symbolised by the historical link with the ": null
    },
    {
        "See": "Episcopal See"
    },
    {
        " of ": null
    },
    {
        "Canterbury": "Province Of Canterbury"
    },
    {
        ", along with a common and complex liturgical tradition, has provided a measure of unity. This has been reinforced by the ": null
    },
    {
        "Lambeth Conferences": "Lambeth Conference"
    },
    {
        "of Anglican Communion bishops, which first met in 1867. These conferences, though they propose and pass resolutions, are strictly consultative, and the intent of the resolutions are to provide guideposts for Anglican jurisdictions—not direction. The Conferences also express the function of the episcopate to demonstrate the ecumenical and Catholic nature of the church.     The ": null
    },
    {
        "Scottish Episcopal Church": "Scottish Episcopal Church"
    },
    {
        " traces ": null
    },
    {
        "its history": "History Of The Scottish Episcopal Church"
    },
    {
        " back to the origins of Christianity in Scotland. Following the 1560 ": null
    },
    {
        "Scottish Reformation": "Scottish Reformation"
    },
    {
        " the ": null
    },
    {
        "Church of Scotland": "Church Of Scotland"
    },
    {
        " was initially run by Superintendents, episcopal governance was restored in 1572, but episcopalianism alternated with periods when the Kirk was under ": null
    },
    {
        "presbyterian": "Presbyterian"
    },
    {
        " control until the ": null
    },
    {
        "1711 Act": "Scottish Episcopalians Act 1711"
    },
    {
        " allowed formation of the independent non-established Scottish Episcopal Church. The ": null
    },
    {
        "Nonjuring schism": "Nonjuring Schism"
    },
    {
        " led to the British Government imposing penal laws against the church. In 1784 the Scottish church appointed ": null
    },
    {
        "Samuel Seabury": "Samuel Seabury"
    },
    {
        " as first bishop of the ": null
    },
    {
        "American Episcopal Church": "Episcopal Church"
    },
    {
        ", beginning the worldwide Anglican Communion of churches, and in 1792 the penal laws were abolished. The church accepted the articles of the Church of England in 1804. ,    The spread of increasingly ": null
    },
    {
        "democratic": "Democracy"
    },
    {
        " forms of representative governance has its origin in the formation of the first General Conventions of the American Episcopal Church in the 1780s, which established a House of Bishops and a House of Deputies . In many jurisdictions, there is also a third, clerical House. Resolutions may be voted on jointly or by each House, in the latter case requiring passage in all Houses to be adopted by the particular council.     Churches that are members of the Anglican Communion are episcopal churches in polity, and some are named Episcopal . However, some churches that self-identify as Anglican do not belong to the Anglican Communion, and not all episcopally-governed churches are Anglican. The ": null
    },
    {
        "Roman Catholic Church": "Roman Catholic Church"
    },
    {
        ", the ": null
    },
    {
        "Old Catholic Church": "Old Catholic Church"
    },
    {
        "es , and the ": null
    },
    {
        "Eastern Orthodox churches": "Eastern Orthodoxy"
    },
    {
        " are recognized, and also their bishops, by ": null
    },
    {
        "Anglicans": "Anglicanism"
    },
    {
        ".          As an offshoot of ": null
    },
    {
        "Anglicanism": "Anglicanism"
    },
    {
        ", ": null
    },
    {
        "Methodist churches": "Methodism"
    },
    {
        " often use episcopal polity for historical as well as practical reasons, albeit to limited use. Methodists often use the term  connexionalism  or connexional polity in addition to episcopal . Nevertheless, the powers of the Methodist episcopacy can be relatively strong and wide-reaching compared to traditional conceptions of episcopal polity. For example, in the ": null
    },
    {
        "United Methodist Church": "United Methodist Church"
    },
    {
        ", bishops are elected for life, can serve up to two terms in a specific conference , are responsible for ordaining and appointing clergy to pastor churches, perform many administrative duties, preside at the annual sessions of the regional Conferences and at the quadrennial meeting of the worldwide General Conference, have authority for teaching and leading the church on matters of social and doctrinal import, and serve to represent the denomination in ecumenical gatherings. United Methodist bishops in the United States serve in their appointed conferences, being moved to a new Episcopal Area after 8 years, until their mandated retirement at the end of the quadrenium following their sixty-sixth birthday. . UMC.org. Retrieved on 2013-07-23.   British Methodism holds that all ordained ministers are equal in terms of spirituality. However, for practical management lines are drawn into President of Conference, Chair of District, Superintendent Minister, Minister. However, all are ministers.         The ": null
    },
    {
        "Reformed Church of Hungary": "Reformed Church Of Hungary"
    },
    {
        ", and the ": null
    },
    {
        "Lutheran church": "Lutheran Church"
    },
    {
        "es in ": null
    },
    {
        "continental Europe": "Continental Europe"
    },
    {
        " may sometimes be called episcopal . In these latter cases, the form of government is not radically different from the ": null
    },
    {
        "presbyterian": "Presbyterian"
    },
    {
        " form, except that their councils of bishops have hierarchical ": null
    },
    {
        "jurisdiction": "Jurisdiction"
    },
    {
        " over the local ruling bodies to a greater extent than in most ": null
    },
    {
        "Presbyterian": "Presbyterian"
    },
    {
        " and other ": null
    },
    {
        "Reformed churches": "Reformed Churches"
    },
    {
        ". As mentioned, the Lutheran Church in Sweden and Finland are exceptions, claiming apostolic succession in a pattern somewhat like the Anglican churches. Otherwise, forms of polity are not mandated in the Lutheran churches, as it is not regarded as having doctrinal significance. ": null
    },
    {
        "Old World": "Old World"
    },
    {
        " Lutheranism, for historical reasons, has tended to adopt ": null
    },
    {
        "Erastian": "Erastian"
    },
    {
        " theories of episcopal authority . In the United States, the Lutheran churches tend to adopt a form of government more comparable to ": null
    },
    {
        "congregationalism": "Congregationalist Polity"
    },
    {
        ". A small minority of ": null
    },
    {
        "Episcopal Baptists": "Episcopal Baptists"
    },
    {
        " exists.     Most ": null
    },
    {
        "Anabaptist": "Anabaptism"
    },
    {
        " churches of the ": null
    },
    {
        "plain dress": "Plain Dress"
    },
    {
        " tradition follow an episcopal system, at least in name. Congregational governance is strongly emphasized, and each congregation elects its pastor. Bishops enforce inter-congregational unity and may discipline pastors for breaking from traditional norms.     Although it never uses the term, ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "The Church Of Jesus Christ Of Latter-Day Saints"
    },
    {
        " is episcopal, rather than presbyterian or congregational, in the sense that it has a strict hierarchy of leadership from the local bishop/branch president up to a single prophet/president, believed to be personally authorized and guided by Jesus Christ. Local congregations have de jure boundaries by which members are allocated, and membership records are centralized. This system developed gradually from a more presbyterian polity  for pragmatic and doctrinal reasons, reaching a full episcopacy during the ": null
    },
    {
        "Nauvoo": "Nauvoo, Illinois"
    }
]