[
    {
        "   Erbium is a ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        " Er and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " 68. A silvery-white solid metal when artificially isolated, natural erbium is always found in chemical combination with other elements. It is a ": null
    },
    {
        "lanthanide": "Lanthanide"
    },
    {
        ", a ": null
    },
    {
        "rare earth element": "Rare Earth Element"
    },
    {
        ", originally found in the ": null
    },
    {
        "gadolinite": "Gadolinite"
    },
    {
        " mine in ": null
    },
    {
        "Ytterby": "Ytterby"
    },
    {
        " in ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ", from which it got its name.     Erbiums principal uses involve its pink-colored Er 3+ ions, which have optical fluorescent properties particularly useful in certain laser applications. Erbium-doped glasses or crystals can be used as optical amplification media, where Er 3+ ions are optically pumped at around 980 or  and then radiate light at  in stimulated emission. This process results in an unusually mechanically simple ": null
    },
    {
        "laser": "Laser"
    },
    {
        " optical amplifier": "Optical Amplifier"
    },
    {
        " for signals transmitted by fiber optics. The  wavelength is especially important for ": null
    },
    {
        "optical communications": "Optical Communications"
    },
    {
        " because standard single mode ": null
    },
    {
        "optical fibers": "Optical Fibers"
    },
    {
        " have minimal loss at this particular wavelength.     In addition to optical fiber amplifier-lasers, a large variety of medical applications rely on the erbium ions  emission  when lit at another wavelength, which is highly absorbed in water in tissues, making its effect very superficial. Such shallow tissue deposition of laser energy is helpful in ": null
    },
    {
        "laser surgery": "Laser Surgery"
    },
    {
        ", and for the efficient production of steam which produces enamel ablation by common types of ": null
    },
    {
        "dental laser": "Dental Laser"
    },
    {
        ".              A ": null
    },
    {
        "trivalent": "Valence"
    },
    {
        " element, pure erbium ": null
    },
    {
        "metal": "Metal"
    },
    {
        " is malleable , soft yet stable in air, and does not ": null
    },
    {
        "oxidize": "Oxidation"
    },
    {
        " as quickly as some other ": null
    },
    {
        "rare-earth metals": "Rare-Earth Metals"
    },
    {
        ". Its ": null
    },
    {
        "salts": "Salt"
    },
    {
        " are rose-colored, and the element has characteristic sharp ": null
    },
    {
        "absorption spectra": "Absorption Spectra"
    },
    {
        " bands in ": null
    },
    {
        "visible light": "Visible Light"
    },
    {
        ", ": null
    },
    {
        "ultraviolet": "Ultraviolet"
    },
    {
        ", and near ": null
    },
    {
        "infrared": "Infrared"
    },
    {
        ". Otherwise it looks much like the other rare earths. Its ": null
    },
    {
        "sesquioxide": "Sesquioxide"
    },
    {
        " is called ": null
    },
    {
        "erbia": "Erbia"
    },
    {
        ". Erbiums properties are to a degree dictated by the kind and amount of impurities present. Erbium does not play any known biological role, but is thought to be able to stimulate ": null
    },
    {
        "metabolism": "Metabolism"
    },
    {
        ".      Erbium is ": null
    },
    {
        "ferromagnetic": "Ferromagnetic"
    },
    {
        " below 19  K, ": null
    },
    {
        "antiferromagnetic": "Antiferromagnetic"
    },
    {
        " between 19 and 80 K and ": null
    },
    {
        "paramagnetic": "Paramagnetic"
    },
    {
        " above 80  K.      Erbium can form propeller-shaped atomic clusters Er 3 N, where the distance between the erbium atoms is 0.35  nm. Those clusters can be isolated by encapsulating them into ": null
    },
    {
        "fullerene": "Fullerene"
    },
    {
        " molecules, as confirmed by ": null
    },
    {
        "transmission electron microscopy": "Transmission Electron Microscopy"
    },
    {
        ".        Erbium metal tarnishes slowly in air and burns readily to form ": null
    },
    {
        "erbium oxide": "Erbium Oxide"
    },
    {
        "sulfuric acid": "Sulfuric Acid"
    },
    {
        " to form solutions containing hydrated Er ions, which exist as rose red 3+ hydration complexes:      :2 Er + 3 H 2 SO 4 → 2 Er 3+ + 3  + 3 H 2          Naturally occurring erbium is composed of 6 stable ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        "s, , , , , , and , with  being the most abundant . 29 ": null
    },
    {
        "radioisotopes": "Radioisotope"
    },
    {
        "have been characterized, with the most stable being  with a ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of ,  with a half-life of ,  with a half-life of ,  with a half-life of , and  with a half-life of . All of the remaining ": null
    },
    {
        "radioactive": "Radioactive"
    },
    {
        " isotopes have half-lives that are less than , and the majority of these have half-lives that are less than 4 minutes. This element also has 13 ": null
    },
    {
        "meta state": "Meta State"
    },
    {
        "s, with the most stable being  with a half-life of .      The isotopes of erbium range in ": null
    },
    {
        "atomic weight": "Atomic Weight"
    },
    {
        " from   to  . The primary ": null
    },
    {
        "decay mode": "Decay Mode"
    },
    {
        " before the most abundant stable isotope, , is ": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        ", and the primary mode after is ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        ". The primary ": null
    },
    {
        "decay products": "Decay Product"
    },
    {
        "before  are element 67  isotopes, and the primary products after are element 69  isotopes.       Erbium  was ": null
    },
    {
        "discovered": "Discovery Of The Chemical Elements"
    },
    {
        " by ": null
    },
    {
        "Carl Gustaf Mosander": "Carl Gustaf Mosander"
    },
    {
        " in 1843.  Note: The first part of this article, which does NOT concern erbium, is a translation of: C. G. Mosander   Förhandlingar vid de Skandinaviske naturforskarnes tredje möte  vol. 3, pp. 387–398. Mosander was working with a sample of what was thought to be the single metal oxide ": null
    },
    {
        "yttria": "Yttria"
    },
    {
        ", derived from the mineral ": null
    },
    {
        "gadolinite": "Gadolinite"
    },
    {
        ". He discovered that the sample contained at least two metal oxides in addition to pure yttria, which he named ": null
    },
    {
        "erbia": "Erbia"
    },
    {
        " and ": null
    },
    {
        "terbia": "Terbia"
    },
    {
        " after the village of Ytterby where the gadolinite had been found. Mosander was not certain of the purity of the oxides and later tests confirmed his uncertainty. Not only did the yttria contain yttrium, erbium, and terbium; in the ensuing years, chemists, geologists and spectroscopists discovered five additional elements: ": null
    },
    {
        "ytterbium": "Ytterbium"
    },
    {
        ", ": null
    },
    {
        "scandium": "Scandium"
    },
    {
        ", ": null
    },
    {
        "thulium": "Thulium"
    },
    {
        ", ": null
    },
    {
        "holmium": "Holmium"
    },
    {
        ", and ": null
    },
    {
        "gadolinium": "Gadolinium"
    },
    {
        ".      Erbia and terbia, however, were confused at this time. A spectroscopist mistakenly switched the names of the two elements during spectroscopy. After 1860, terbia was renamed erbia and after 1877 what had been known as erbia was renamed terbia. Fairly pure Er 2 ": null
    },
    {
        "O": "Oxygen"
    },
    {
        " 3 was independently isolated in 1905 by ": null
    },
    {
        "Georges Urbain": "Georges Urbain"
    },
    {
        " and ": null
    },
    {
        "Charles James": "Charles James"
    },
    {
        ". Reasonably pure erbium metal was not produced until 1934 when ": null
    },
    {
        "Wilhelm Klemm": "Wilhelm Klemm"
    },
    {
        " and ": null
    },
    {
        "Heinrich Bommer": "Heinrich Bommer"
    },
    {
        " reduced the ": null
    },
    {
        "anhydrous": "Anhydrous"
    },
    {
        " chloride": "Chloride"
    },
    {
        " with ": null
    },
    {
        "potassium": "Potassium"
    },
    {
        " vapor.  It was only in the 1990s that the price for Chinese-derived erbium oxide became low enough for erbium to be considered for use as a colorant in art glass.            The concentration of erbium in the Earth crust is about 2.8  mg/kg and in the sea water 0.9  ng/L.  This concentration is enough to make erbium about 45th in ": null
    },
    {
        "elemental abundance in the Earths crust": "Abundance Of Elements In Earths Crust"
    },
    {
        ".     Like other rare earths, this element is never found as a free element in nature but is found bound in ": null
    },
    {
        "monazite": "Monazite"
    },
    {
        " sand ores. It has historically been very difficult and expensive to separate rare earths from each other in their ores but ": null
    },
    {
        "ion-exchange": "Ion-Exchange"
    },
    {
        " chromatography methods Early paper on the use of displacement ion-exchange chromatography to separate rare earths:  developed in the late 20th century have greatly brought down the cost of production of all rare-earth metals and their ": null
    },
    {
        "chemical compound": "Chemical Compound"
    },
    {
        "s.     The principal commercial sources of erbium are from the minerals ": null
    },
    {
        "xenotime": "Xenotime"
    },
    {
        " and ": null
    },
    {
        "euxenite": "Euxenite"
    },
    {
        ", and most recently, the ion adsorption clays of southern China; in consequence, China has now become the principal global supplier of this element. In the high-yttrium versions of these ore concentrates, yttrium is about two-thirds of the total by weight, and erbia is about 4–5%. When the concentrate is dissolved in acid, the erbia liberates enough erbium ion to impart a distinct and characteristic pink color to the solution. This color behavior is similar to what Mosander and the other early workers in the lanthanides would have seen in their extracts from the gadolinite minerals of Ytterby.       Crushed minerals are attacked by hydrochloric or ": null
    },
    {
        "sulfuric acid": "Sulfuric Acid"
    },
    {
        " that transforms insoluble rare-earth oxides into soluble chlorides or sulfates. The acidic filtrates are partially neutralized with caustic soda to pH 3–4. ": null
    },
    {
        "Thorium": "Thorium"
    },
    {
        " precipitates out of solution as hydroxide and is removed. After that the solution is treated with ": null
    },
    {
        "ammonium oxalate": "Ammonium Oxalate"
    },
    {
        " to convert rare earths into their insoluble ": null
    },
    {
        "oxalate": "Oxalate"
    },
    {
        "s. The oxalates are converted to oxides by annealing. The oxides are dissolved in ": null
    },
    {
        "nitric acid": "Nitric Acid"
    },
    {
        " that excludes one of the main components, ": null
    },
    {
        "cerium": "Cerium"
    },
    {
        ", whose oxide is insoluble in HNO 3 . The solution is treated with ": null
    },
    {
        "magnesium nitrate": "Magnesium Nitrate"
    },
    {
        " to produce a crystallized mixture of ": null
    },
    {
        "double salts": "Double Salt"
    },
    {
        "of rare-earth metals. The salts are separated by ": null
    },
    {
        "ion exchange": "Ion Exchange"
    },
    {
        ". In this process, rare-earth ions are sorbed onto suitable ion-exchange resin by exchange with hydrogen, ammonium or cupric ions present in the resin. The rare earth ions are then selectively washed out by suitable complexing agent. Erbium metal is obtained from its oxide or salts by heating with ": null
    },
    {
        "calcium": "Calcium"
    },
    {
        " at  under argon atmosphere.          Erbiums everyday uses are varied. It is commonly used as a ": null
    },
    {
        "photographic filter": "Filter"
    },
    {
        ", and because of its resilience it is useful as a metallurgical additive.       A large variety of medical applications utilize erbium ions  emission , which is highly absorbed in water . Such shallow tissue deposition of laser energy is necessary for laser surgery, and the efficient production of steam for laser enamel ablation in dentistry.     Erbium-doped ": null
    },
    {
        "optical silica-glass fibers": "Optical Fibers"
    },
    {
        " are the active element in ": null
    },
    {
        "erbium-doped fiber amplifiers": "Erbium-Doped Fiber Amplifier"
    },
    {
        ", which are widely used in ": null
    },
    {
        "optical communications": "Optical Communications"
    },
    {
        ".  The same fibers can be used to create fiber ": null
    },
    {
        "lasers": "Lasers"
    },
    {
        ". In order to work efficiently, erbium-doped fiber is usually co-doped with glass modifiers/homogenizers, often aluminum or phosphorus. These dopants help prevent clustering of Er ions and transfer the energy more efficiently between excitation light and the signal. Co-doping of optical fiber with Er and Yb is used in ": null
    },
    {
        "high-power Er/Yb fiber lasers": "Erbium-Ytterbium Laser"
    },
    {
        ". Erbium can also be used in ": null
    },
    {
        "erbium-doped waveguide amplifier": "Erbium-Doped Waveguide Amplifier"
    },
    {
        "s.       When added to ": null
    },
    {
        "vanadium": "Vanadium"
    },
    {
        " as an ": null
    },
    {
        "alloy": "Alloy"
    },
    {
        ", erbium lowers hardness and improves workability.  An erbium-": null
    },
    {
        "nickel": "Nickel"
    },
    {
        " alloy Er 3 Ni has an unusually high specific heat capacity at liquid-helium temperatures and is used in ": null
    },
    {
        "cryocoolers": "Cryocoolers"
    },
    {
        "; a mixture of 65% Er 3 ": null
    },
    {
        "Co": "Cobalt"
    },
    {
        " and 35% Er 0.9 ": null
    },
    {
        "Yb": "Ytterbium"
    },
    {
        " 0.1 Ni by volume improves the specific heat capacity even more.         ": null
    },
    {
        "Erbium oxide": "Erbium Oxide"
    },
    {
        " has a pink color, and is sometimes used as a colorant for ": null
    },
    {
        "glass": "Glass"
    },
    {
        ", ": null
    },
    {
        "cubic zirconia": "Cubic Zirconia"
    },
    {
        " and ": null
    },
    {
        "porcelain": "Porcelain"
    },
    {
        ". The glass is then often used in ": null
    },
    {
        "sunglasses": "Sunglasses"
    },
    {
        " and cheap ": null
    },
    {
        "jewelry": "Jewelry"
    },
    {
        ". Stwertka, Albert. A Guide to the Elements, Oxford University Press, 1996, p. 162.        Erbium is used in ": null
    },
    {
        "nuclear": "Nuclear Power"
    },
    {
        " technology in neutron-absorbing ": null
    },
    {
        "control rod": "Control Rod"
    },
    {
        "s.        Erbium does not have a biological role, but erbium salts can stimulate ": null
    },
    {
        "metabolism": "Metabolism"
    },
    {
        ". Humans consume 1 milligram of erbium a year on average. The highest concentration of erbium in humans is in the ": null
    },
    {
        "bone": "Bone"
    },
    {
        "s, but there is also erbium in the human ": null
    },
    {
        "kidneys": "Kidneys"
    },
    {
        " and ": null
    },
    {
        "liver": "Liver"
    },
    {
        ".       Erbium is slightly toxic if ingested, but erbium compounds are not toxic. Metallic erbium in dust form presents a fire and explosion hazard.   ": null
    }
]