[
    {
        "        Ernst Kaltenbrunner  was an ": null
    },
    {
        "Austria": "Austria"
    },
    {
        "n senior official of ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        " during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ". An  Obergruppenführer  in the  Schutzstaffel  , he held the office of Chief of the ": null
    },
    {
        "Reich Main Security Office": "Reich Main Security Office"
    },
    {
        "  between January 1943 and May 1945.     Kaltenbrunner joined the ": null
    },
    {
        "Nazi Party": "Nazi Party"
    },
    {
        " in 1930 and the SS in 1931, and by 1935 he was considered a leader of the ": null
    },
    {
        "Austrian SS": "Austrian Ss"
    },
    {
        ". In 1938, Kaltenbrunner assisted in the  Anschluss  and was given command of the SS and police force in Austria. In January 1943, Kaltenbrunner was appointed a chief of the RSHA, succeeding ": null
    },
    {
        "Reinhard Heydrich": "Reinhard Heydrich"
    },
    {
        ", who was assassinated in June 1942. A committed anti-Semite and fanatical Hitler loyalist, Kaltenbrunner oversaw a period in which persecution of Jews intensified. He is considered a major perpetrator of ": null
    },
    {
        "the Holocaust": "The Holocaust"
    },
    {
        " during the final years of the war.     Kaltenbrunner was the highest-ranking member of the SS to face trial at the first ": null
    },
    {
        "Nuremberg trials": "Nuremberg Trials"
    },
    {
        ", where he was found guilty of ": null
    },
    {
        "war crimes": "War Crime"
    },
    {
        " and ": null
    },
    {
        "crimes against humanity": "Crimes Against Humanity"
    },
    {
        ". He was sentenced to death and executed by ": null
    },
    {
        "hanging": "Hanging"
    },
    {
        " in October 1946.       Born in ": null
    },
    {
        "Ried im Innkreis": "Ried Im Innkreis"
    },
    {
        ", Austria, Kaltenbrunner was the son of a ": null
    },
    {
        "lawyer": "Lawyer"
    },
    {
        ", and was educated at the Realgymnasium in ": null
    },
    {
        "Linz": "Linz"
    },
    {
        ". Raised in a nationalist family, Kaltenbrunner was childhood friends with ": null
    },
    {
        "Adolf Eichmann": "Adolf Eichmann"
    },
    {
        ", the infamous SS officer who played a key role in implementing the Nazis ": null
    },
    {
        "Final Solution": "Final Solution"
    },
    {
        " against Europes Jews. After Gymnasium, Kaltenbrunner went on to obtain his doctorate degree in law at ": null
    },
    {
        "Graz University": "Graz University"
    },
    {
        " in 1926. He worked at a law firm in ": null
    },
    {
        "Salzburg": "Salzburg"
    },
    {
        " for a year before opening his own law office in Linz. He had deep scars on his face from ": null
    },
    {
        "dueling": "Academic Fencing"
    },
    {
        " in his student days, although some sources attribute them to an automobile accident.     On 14 January 1934, Kaltenbrunner married Elisabeth Eder who was from Linz and a ": null
    },
    {
        "Nazi Party": "Nazi Party"
    },
    {
        " member. They had three children. In addition to the children from his marriage, Kaltenbrunner had twins, Ursula and Wolfgang, with his long-time mistress Gisela Gräfin von Westarp . All the children survived the war.       On 18 October 1930, Kaltenbrunner joined the Nazi Party with NSDAP member number 300,179. In 1931, he was the Bezirksredner for the Nazi Party in ": null
    },
    {
        "Oberösterreich": "Upper Austria"
    },
    {
        ". Kaltenbrunner went on to join the ": null
    },
    {
        "SS": "Ss"
    },
    {
        " on 31 August 1931, his SS number was 13,039. He first became a Rechtsberater for the party in 1929 and later held this same position for ": null
    },
    {
        "SS Abschnitt VIII": "Allgemeine-Ss Order Of Battle"
    },
    {
        " beginning in 1932. That same year, he began working at his fathers law practice and by 1933 was head of the National-Socialist Lawyers League in Linz.     In January 1934, Kaltenbrunner was briefly jailed at the Kaisersteinbruch detention camp with other National Socialists for conspiracy by the ": null
    },
    {
        "Engelbert Dollfuss": "Engelbert Dollfuss"
    },
    {
        " government. While there he led a hunger strike which forced the government to release 490 of the party members. In 1935, he was jailed again on suspicion of ": null
    },
    {
        "high treason": "High Treason"
    },
    {
        ". This charge was dropped, but he was sentenced to six months imprisonment for ": null
    },
    {
        "conspiracy": "Conspiracy"
    },
    {
        " and he lost his license to practice law.     From mid-1935 Kaltenbrunner was head of the illegal SS Abschnitt VIII in Linz and was considered a leader of the ": null
    },
    {
        "Austrian SS": "Austrian Ss"
    },
    {
        ". To provide ": null
    },
    {
        "Heinrich Himmler": "Heinrich Himmler"
    },
    {
        ", ": null
    },
    {
        "Reinhard Heydrich": "Reinhard Heydrich"
    },
    {
        " and ": null
    },
    {
        "Heinz Jost": "Heinz Jost"
    },
    {
        " with new information, Kaltenbrunner repeatedly made trips to ": null
    },
    {
        "Bavaria": "Bavaria"
    },
    {
        ". Hiding on a train and on a ship that traveled to ": null
    },
    {
        "Passau": "Passau"
    },
    {
        ", he would return with money and orders for Austrian comrades. Kaltenbrunner was arrested again in 1937, by Austrian authorities on charges of being head of the illegal Nazi Party organization in Oberösterreich. He was released in September.        Acting on orders from ": null
    },
    {
        "Hermann Göring": "Hermann Göring"
    },
    {
        ", Kaltenbrunner assisted in the  Anschluss  with Germany in March 1938, and was awarded the role as the state secretary for public security in the Seyss-Inquart cabinet. Controlled from behind the scenes by Himmler, Kaltenbrunner still led, albeit clandestinely, the Austrian SS as part of his duty to ": null
    },
    {
        "coordinate": "Gleichschaltung"
    },
    {
        " and manage the Austrian population. Then on 21 March 1938, he was promoted to SS- Brigadeführer . He was a member of the  Reichstag  from 10 April 1938 until 8 May 1945. Amid this activity, he helped establish the ": null
    },
    {
        "Mauthausen-Gusen concentration camp": "Mauthausen-Gusen Concentration Camp"
    },
    {
        " near Linz. Mauthausen was the first ": null
    },
    {
        "Nazi concentration camp": "Nazi Concentration Camp"
    },
    {
        " opened in Austria following the Anschluss. On 11 September 1938, Kaltenbrunner was promoted to the rank of SS- Gruppenführer , equivalent to a ": null
    },
    {
        "lieutenant general": "Lieutenant General"
    },
    {
        " in the army while holding the position of Führer of SS-Oberabschnitt Österreich . Also in 1938, he was appointed ": null
    },
    {
        "High SS and police leader": "High Ss And Police Leader"
    },
    {
        "  for Donau, which was the primary SS command in Austria .       In June 1940, Kaltenbrunner was appointed Police President of Vienna and held that additional post for a year. In July 1940, he was commissioned as a SS- Untersturmführer  in the ": null
    },
    {
        "Waffen-SS": "Waffen-Ss"
    },
    {
        " Reserve. Throughout his many duties, Kaltenbrunner also developed an impressive intelligence network across Austria moving southeastwards, which eventually brought him to Himmlers attention for the assignment as chief of the ": null
    },
    {
        "RSHA": "Rsha"
    },
    {
        " in January 1943. The RSHA was composed of the SiPo  along with the SD . He replaced Heydrich, who was ": null
    },
    {
        "assassinated": "Operation Anthropoid"
    },
    {
        " in June 1942. Kaltenbrunner held this position until the end of the war. Hardly anyone knew Kaltenbrunner and upon his appointment, Himmler transferred responsibility for both SS personnel and economics from the RSHA to the ": null
    },
    {
        "SS Main Economic and Administrative Office": "Ss Main Economic And Administrative Office"
    },
    {
        ". Nonetheless, he was promoted to SS- Obergruppenführer und General der Polizei on 21 June 1943. He also replaced Heydrich as President of the International Criminal Police Commission , the organization today known as ": null
    },
    {
        "Interpol": "Interpol"
    },
    {
        ".     Fear of a collapsing home-front due to the Allied bombing campaigns and that another stab-in-the-back at home could arise, as a result, caused Kaltenbrunner to immediately tighten the Nazi grip within Germany. From what historian Anthony Read relates, Kaltenbrunners appointment as RSHA chief came as a surprise given the other possible candidates like head of the Gestapo, ": null
    },
    {
        "Heinrich Müller": "Heinrich Müller"
    },
    {
        ", or even SD foreign intelligence chief, ": null
    },
    {
        "Walter Schellenberg": "Walter Schellenberg"
    },
    {
        ". Historian Richard Grunberger also added the name of Dr. ": null
    },
    {
        "Wilhelm Stuckart": "Wilhelm Stuckart"
    },
    {
        ", the future minister of the German Interior as another potential candidate for head of the RSHA; however, he suggests that Kaltenbrunner was most likely selected since he was a comparative newcomer who would be more pliable in Himmlers hands.     Like many of the ideological fanatics in the regime, Kaltenbrunner was a committed anti-Semite. According to former SS-Sturmbannführer Hans Georg Mayer, Kaltenbrunner was present at a December 1940 meeting among Hitler, Goebbels, Himmler, and Heydrich where it was decided to gas all Jews incapable of heavy physical work. Under Kaltenbrunners command, the persecution of Jews picked up pace as the process of extermination was to be expedited and the concentration of the Jews in the Reich itself and the occupied countries were to be liquidated as soon as possible.  Kaltenbrunner stayed constantly informed over the status of concentration camp activities, receiving periodic reports at his office in the RSHA.     To combat homosexuality across the greater Reich, Kaltenbrunner pushed the Ministry of Justice in July 1943 for an edict mandating compulsory castration for anyone found guilty of this offense. While this was rejected, he still took steps to get the army to review some 6,000 cases to prosecute homosexuals.        During the summer of 1943, Kaltenbrunner conducted his second inspection of the ": null
    },
    {
        "Mauthausen-Gusen concentration camp": "Mauthausen-Gusen Concentration Camp"
    },
    {
        ". While he was there, 15 prisoners were selected to demonstrate for Kaltenbrunner three methods of killing; by a gunshot to the neck, hanging, and gassing. After the killings were performed, Kaltenbrunner inspected the crematorium and later the quarry. In October 1943, he told ": null
    },
    {
        "Herbert Kappler": "Herbert Kappler"
    },
    {
        ", the head of German police and security services in Rome, that the eradication of the Jews in Italy was of special interest for general security.  Four days later, Kapplers SS and police units began rounding up and deporting Jews by train to ": null
    },
    {
        "Auschwitz concentration camp": "Auschwitz Concentration Camp"
    },
    {
        ".     In 1944 when Hitler was in the process of strong-arming Admiral Horthy into submitting Hungary to the Nazis during an arranged meeting in Klessheim Castle in Salzburg, Kaltenbrunner was present for the negotiations and escorted him out once they were over. Accompanying Horthy and Kaltenbrunner on the journey back to Hungary was ": null
    },
    {
        "Adolf Eichmann": "Adolf Eichmann"
    },
    {
        ", who brought with him a special Einsatzkommando unit to begin the process of rounding up and deporting Hungarys 750,000 Jews.      It was said that even Himmler feared him, as Kaltenbrunner was an intimidating figure with his  height, facial scars, and volatile temper. Kaltenbrunner was also a longtime friend of ": null
    },
    {
        "Otto Skorzeny": "Otto Skorzeny"
    },
    {
        " and recommended him for many secret missions, allowing Skorzeny to become one of Hitlers favorite agents. Kaltenbrunner was also responsible for heading ": null
    },
    {
        "Operation Long Jump": "Operation Long Jump"
    },
    {
        ", a plan to assassinate ": null
    },
    {
        "Stalin": "Joseph Stalin"
    },
    {
        ", ": null
    },
    {
        "Churchill": "Winston Churchill"
    },
    {
        ", and ": null
    },
    {
        "Roosevelt": "Franklin D. Roosevelt"
    },
    {
        " in ": null
    },
    {
        "Tehran": "Tehran"
    },
    {
        ".     Immediately in the wake of the ": null
    },
    {
        "20 July Plot": "Operation Valkyrie"
    },
    {
        " on Hitlers life in 1944, Kaltenbrunner was summoned to Hitlers wartime headquarters at the Wolfsschanze  in ": null
    },
    {
        "East Prussia": "East Prussia"
    },
    {
        " to begin the investigation into who was responsible for the assassination attempt. Once it was revealed that an attempted military coup against Hitler had been launched, Himmler and Kaltenbrunner had to tread carefully, as the military was not under the jurisdiction of the Gestapo or the SD. Since the attempt failed, the conspirators were soon identified. An estimated 5,000 people were eventually executed, with many more sent to concentration camps.        Historian ": null
    },
    {
        "Heinz Höhne": "Heinz Höhne"
    },
    {
        " counted Kaltenbrunner among fanatical Hitler loyalists and described him as being committed to the bitter end.  Field reports from the SD in October 1944 about deteriorating morale in the military prompted Kaltenbrunner to urge the involvement of the RSHA in military court-martial proceedings, but this was rejected by Himmler who thought it unwise to interfere in  Wehrmacht  affairs. In December 1944, Kaltenbrunner was granted the additional rank of ": null
    },
    {
        "General of the Waffen-SS": "Ranks And Insignia Of The Schutzstaffelwaffen-Ss Generals"
    },
    {
        ". On 15 November 1944 he was awarded the ": null
    },
    {
        "Knights Cross of the War Merit Cross with Swords": "War Merit Cross"
    },
    {
        ". In addition, he was awarded the NSDAP ": null
    },
    {
        "Golden Party Badge": "Golden Party Badge"
    },
    {
        " and the  Blutorden  . Using his authority as Chief of the RSHA, Kaltenbrunner issued a decree on 6 February 1945 that allowed policemen to shoot disloyal people at their discretion, without judicial review.     On 12 March 1945, a meeting took place in the ": null
    },
    {
        "Vorarlberg": "Vorarlberg"
    },
    {
        " between Kaltenbrunner and ": null
    },
    {
        "Carl Jacob Burckhardt": "Carl Jacob Burckhardt"
    },
    {
        ", president of the ": null
    },
    {
        "International Committee of the Red Cross": "International Committee Of The Red Cross"
    },
    {
        " . Just over a month later, Himmler was informed that SS-Obergruppenführer ": null
    },
    {
        "Karl Wolff": "Karl Wolff"
    },
    {
        " had been negotiating with the Allies for the capitulation of Italy. When questioned by Himmler, Wolff explained that he was operating under Hitlers orders and attempting to play the Allies against one another. Himmler believed him, but Kaltenbrunner did not and told Himmler that an informant claimed Wolff also negotiated with Cardinal ": null
    },
    {
        "Schuster": "Alfredo Ildefonso Schuster"
    },
    {
        " of Milan and was about to surrender occupied Italy to the Allies. Himmler angrily repeated the allegations and Wolff, feigning offense, challenged Himmler to present these statements to Hitler. Unnerved by Wolffs demands, Himmler backed down, and Hitler sent Wolff back to Italy to continue his purported disruption of the Allies.     In mid-April 1945, three weeks before the war ended, Himmler named Kaltenbrunner commander-in-chief of the remaining German forces in Southern Europe. Kaltenbrunner attempted to organize cells for post-war sabotage in the region and Germany but accomplished little. Hitler made one of his last appearances on 20 April 1945 outside the subterranean  Führerbunker  in Berlin, where he pinned medals on boys from the ": null
    },
    {
        "Hitler Youth": "Hitler Youth"
    },
    {
        " for their bravery. Kaltenbrunner was among those present, but realizing the end was near, he then fled from Berlin.       On 12 May 1945 Kaltenbrunner was apprehended along with his adjutant, Arthur Scheidler, and two SS guards in a remote cabin at the top of the ": null
    },
    {
        "Totes Gebirge": "Totes Gebirge"
    },
    {
        " mountains near ": null
    },
    {
        "Altaussee": "Altaussee"
    },
    {
        ", ": null
    },
    {
        "Austria": "Austria"
    },
    {
        ", by a search party initiated by the ": null
    },
    {
        "80th Infantry Division, Third U.S. Army": "80Th Division"
    },
    {
        ". Information had been gained from Johann Brandauer, the assistant ": null
    },
    {
        "burgermeister": "Burgermeister"
    },
    {
        " of Altaussee, that the party was hiding out with false papers in the cabin. This was supported by an eyewitness sighting by the Altaussee mountain ranger five days earlier. Special Agent Robert E. Matteson from the ": null
    },
    {
        "C.I.C.": "Counterintelligence Corps"
    },
    {
        " Detachment organized and led a patrol consisting of Brandauer, four ex-Wehrmacht soldiers, and a squad of US soldiers to effect the arrest. The party climbed over mountainous and glacial terrain for six hours in darkness before arriving at the cabin. After a short standoff, all four men exited the cabin and surrendered without a shot fired. Kaltenbrunner claimed to be a doctor and offered a false name. However, upon their arrival back to town his mistress, Countess Gisela von Westarp, and the wife of his adjutant Arthur Scheidler chanced to spot the men being led away, the ladies called out to both men and embraced them. This action resulted in their identification and arrest by US troops.     In 2001, Ernst Kaltenbrunners personal Nazi security seal was found in an Alpine lake in ": null
    },
    {
        "Styria": "Styria"
    },
    {
        ", Austria, 56 years after he had thrown it away to hide his identity. The seal was recovered by a Dutch citizen on holiday. The seal has the words  Chef der Sicherheitspolizei und des SD  engraved on it. Experts have examined the seal and believe it was discarded in the final days of the war in May 1945.          At the ": null
    },
    {
        "Nuremberg trials": "Nuremberg Trials"
    },
    {
        ", Kaltenbrunner was charged with conspiracy to commit ": null
    },
    {
        "crimes against peace": "Crimes Against Peace"
    },
    {
        ", ": null
    },
    {
        "war crimes": "War Crime"
    },
    {
        " and ": null
    },
    {
        "crimes against humanity": "Crimes Against Humanity"
    },
    {
        ". Due to the areas over which he exercised responsibility as an SS general and as chief of the RSHA, he was acquitted of crimes against peace, but held responsible for war crimes and crimes against humanity.        During the initial stages of the Nuremberg trials, Kaltenbrunner was absent because of two episodes of ": null
    },
    {
        "subarachnoid hemorrhage": "Subarachnoid Hemorrhage"
    },
    {
        ", which required several weeks of recovery time. After his health improved, the tribunal denied his request for pardon. When he was released from a military hospital he pleaded not guilty to the charges of the indictment against him. Kaltenbrunner said all decrees and legal documents that bore his signature were ": null
    },
    {
        "rubber-stamped": "Rubber Stamp"
    },
    {
        " and filed by his adjutant. He also said Gestapo Chief ": null
    },
    {
        "Heinrich Müller": "Heinrich Müller"
    },
    {
        " had illegally affixed his signature to numerous documents in question.     Kaltenbrunner argued in his defense that his position as RSHA chief existed only theoretically and said he was only active in matters of espionage and intelligence. He maintained that Himmler, as his superior, was the person culpable for the atrocities committed during his tenure as chief of the RSHA. Kaltenbrunner also asserted that he had no knowledge of the ": null
    },
    {
        "Final Solution": "Final Solution"
    },
    {
        " before 1943 and went on to claim that he protested against the ill-treatment of the Jews to Himmler and Hitler. Further denials from Kaltenbrunner included statements that he knew nothing of the ": null
    },
    {
        "Commissar Order": "Commissar Order"
    },
    {
        " and that he never visited ": null
    },
    {
        "Mauthausen concentration camp": "Mauthausen-Gusen Concentration Camp"
    },
    {
        ", despite documentation of his visit. At one point, Kaltenbrunner went so far as to avow that he was responsible for bringing the Final Solution to an end.          On 30 September 1946, the ": null
    },
    {
        "International Military Tribunal": "International Military Tribunal"
    },
    {
        " found Kaltenbrunner not guilty of crimes against peace, but guilty of war crimes and crimes against humanity . On 1 October 1946, the IMT sentenced him to death by hanging.      Kaltenbrunner was ": null
    },
    {
        "executed": "Nuremberg Executions"
    },
    {
        " on 16 October 1946, around 1:15  a.m., in Nuremberg. His body, like those of the other nine executed men and that of ": null
    },
    {
        "Hermann Göring": "Hermann Göring"
    },
    {
        " , was cremated at the ": null
    },
    {
        "Eastern Cemetery": "Ostfriedhof"
    },
    {
        " in ": null
    },
    {
        "Munich": "Munich"
    },
    {
        " and the ashes were scattered in a tributary of the River ": null
    },
    {
        "Isar": "Isar"
    },
    {
        ".          ": null
    },
    {
        "SS-Mann": "Mann"
    },
    {
        " – 31 August 1931  Truppführer  – 1931  Sturmhauptführer  – 25 September 1932  Standartenführer  – 20 April 1936  Oberführer  – 20 April 1937  Brigadeführer  – 21 March 1938  Gruppenführer  – 11 September 1938  Untersturmführer der Rerserve der Waffen-SS – 1 July 1940  Generalleutnant der Polizei – 1 April 1941  Obergruppenführer und General der Polizei – 21 June 1943  General der Waffen-SS und Polizei – 1 December 1944     ;Awards and decorations   ": null
    },
    {
        "Honour Chevron for the Old Guard": "Honour Chevron For The Old Guard"
    },
    {
        "  SS Honour Ring": "Ss Honour Ring"
    },
    {
        "  Sword of honour of the Reichsführer-SS": "Sword Of Honour Of The Reichsführer-Ss"
    },
    {
        "  Anschluss Medal": "Anschluss Medal"
    },
    {
        "  Sudetenland Medal": "Sudetenland Medal"
    },
    {
        " with Prague Castle Bar  ": null
    },
    {
        "Golden Party Badge": "Golden Party Badge"
    },
    {
        "  SS Long Service Award": "Ss Long Service Award"
    },
    {
        " For 4, 8, and 12 Years Service ": null
    },
    {
        "Nazi Party Long Service Award": "Nazi Party Long Service Award"
    },
    {
        " in Bronze and Silver ": null
    },
    {
        "Blood Order": "Blood Order"
    },
    {
        "  German Cross": "German Cross"
    },
    {
        " in Silver  ": null
    },
    {
        "Knights Cross of the War Merit Cross": "Knights Cross Of The War Merit Cross"
    },
    {
        " with Swords ": null
    }
]