[
    {
        "     Euclidean space is the fundamental space of ": null
    },
    {
        "classical geometry": "Classical Geometry"
    },
    {
        ". Originally it was the ": null
    },
    {
        "three-dimensional space": "Three-Dimensional Space"
    },
    {
        " of ": null
    },
    {
        "Euclidean geometry": "Euclidean Geometry"
    },
    {
        ", but in modern ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " there are Euclidean spaces of any nonnegative integer dimension, including the three-dimensional space and the Euclidean plane . It was introduced by the ": null
    },
    {
        "Ancient Greek": "Greek Mathematics"
    },
    {
        " mathematician ": null
    },
    {
        "Euclid of Alexandria": "Euclid"
    },
    {
        ", and the qualifier Euclidean is used to distinguish it from other spaces that were later discovered in ": null
    },
    {
        "physics": "Physics"
    },
    {
        " and modern mathematics.     Ancient ": null
    },
    {
        "Greek geometers": "History Of Geometrygreek Geometry"
    },
    {
        " introduced Euclidean space for modeling the ": null
    },
    {
        "physical universe": "Physical Universe"
    },
    {
        ". Their great innovation was to  prove  all properties of the space as ": null
    },
    {
        "theorems": "Theorem"
    },
    {
        " by starting from a few fundamental properties, called  postulate s, which either were considered as evident , or seemed impossible to prove .     After the introduction at the end of 19th century of ": null
    },
    {
        "non-Euclidean geometries": "Non-Euclidean Geometries"
    },
    {
        ", the old postulates were re-formalized to define Euclidean spaces through ": null
    },
    {
        "axiomatic theory": "Axiomatic Theory"
    },
    {
        ". Another definition of Euclidean spaces by mean of ": null
    },
    {
        "vector spaces": "Vector Space"
    },
    {
        " and ": null
    },
    {
        "linear algebra": "Linear Algebra"
    },
    {
        " has been shown to be equivalent to the axiomatic definition. It is this definition that is more commonly used in modern mathematics, and detailed in this article.     In all definitions, Euclidean spaces consist of points, which are defined only by the properties that they must have for forming a Euclidean space.     There is essentially only one Euclidean space of each dimension; that is, all Euclidean spaces of a given dimension are ": null
    },
    {
        "isomorphic": "Isomorphism"
    },
    {
        ". Therefore, in many cases, it is possible to work with a specific Euclidean space, which is generally the ": null
    },
    {
        "real -space": "Real N-Space"
    },
    {
        "   Rn, equipped with the ": null
    },
    {
        "dot product": "Dot Product"
    },
    {
        ". An isomorphism from a Euclidean space to   Rn associates with each point an ": null
    },
    {
        "-tuple": "Tuple"
    },
    {
        " of ": null
    },
    {
        "real numbers": "Real Number"
    },
    {
        ", which locate them in the Euclidean space and are called  Cartesian coordinates .         Euclidean space was introduced by ": null
    },
    {
        "ancient Greeks": "Greek Mathematics"
    },
    {
        " as an abstraction of our physical space. Their great innovation, appearing in ": null
    },
    {
        "Euclids Elements": "Euclids Elements"
    },
    {
        " was to build and  prove  all geometry by starting from a few very basic properties, which are abstracted from the physical world, and cannot be mathematically proved because of the lack of more basic tools. These properties are called ": null
    },
    {
        "postulates": "Postulate"
    },
    {
        ", or ": null
    },
    {
        "axioms": "Axiom"
    },
    {
        " in modern language. This way of defining Euclidean space is still in use under the name of ": null
    },
    {
        "synthetic geometry": "Synthetic Geometry"
    },
    {
        ".     In 1637, ": null
    },
    {
        "René Descartes": "René Descartes"
    },
    {
        " introduced ": null
    },
    {
        "Cartesian coordinates": "Cartesian Coordinates"
    },
    {
        " and showed that this allows reducing geometric problems to algebraic computations with numbers. This reduction of geometry to ": null
    },
    {
        "algebra": "Algebra"
    },
    {
        " was a major change of point of view, as, until then, the ": null
    },
    {
        "real numbers": "Real Number"
    },
    {
        "—that is, ": null
    },
    {
        "rational numbers": "Rational Number"
    },
    {
        " and non-rational numbers together–were defined in terms of geometry, as lengths and distance.     Euclidean geometry was not applied in spaces of more than three dimensions until the 19th century. ": null
    },
    {
        "Ludwig Schläfli": "Ludwig Schläfli"
    },
    {
        " generalized Euclidean geometry to spaces of n dimensions using both synthetic and algebraic methods, and discovered all of the regular ": null
    },
    {
        "polytopes": "Polytope"
    },
    {
        "  that exist in Euclidean spaces of any number of dimensions.     Despite the wide use of Descartes approach, which was called ": null
    },
    {
        "analytic geometry": "Analytic Geometry"
    },
    {
        ", the definition of Euclidean space remained unchanged until the end of 19th century. The introduction of abstract ": null
    },
    {
        "vector spaces": "Vector Space"
    },
    {
        " allowed their use in defining Euclidean spaces with a purely algebraic definition. This new definition has been shown to be equivalent to the classical definition in terms of geometric axioms. It is this algebraic definition that is now most often used for introducing Euclidean spaces.       One way to think of the Euclidean plane is as a ": null
    },
    {
        "set": "Set"
    },
    {
        " of ": null
    },
    {
        "points": "Point"
    },
    {
        " satisfying certain relationships, expressible in terms of distance and angles. For example, there are two fundamental operations  on the plane. One is ": null
    },
    {
        "translation": "Translation"
    },
    {
        ", which means a shifting of the plane so that every point is shifted in the same direction and by the same distance. The other is ": null
    },
    {
        "rotation": "Rotation"
    },
    {
        " around a fixed point in the plane, in which all points in the plane turn around that fixed point through the same angle. One of the basic tenets of Euclidean geometry is that two figures  of the plane should be considered equivalent  if one can be transformed into the other by some sequence of translations, rotations and ": null
    },
    {
        "reflections": "Reflection"
    },
    {
        " .     In order to make all of this mathematically precise, the theory must clearly define what is a Euclidean space, and the related notions of distance, angle, translation, and rotation. Even when used in ": null
    },
    {
        "physical": "Physics"
    },
    {
        " theories, Euclidean space is an ": null
    },
    {
        "abstraction": "Abstraction"
    },
    {
        " detached from actual physical locations, specific ": null
    },
    {
        "reference frames": "Frame Of Reference"
    },
    {
        ", measurement instruments, and so on. A purely mathematical definition of Euclidean space also ignores questions of ": null
    },
    {
        "units of length": "Unit Of Length"
    },
    {
        " and other ": null
    },
    {
        "physical dimensions": "Dimensional Analysis"
    },
    {
        "number": "Number"
    },
    {
        ", not something expressed in inches or metres.     The standard way to mathematically define a Euclidean space, as carried out in the remainder of this article, is to define a Euclidean space as a set of points on which ": null
    },
    {
        "acts": "Group Action"
    },
    {
        " a ": null
    },
    {
        "real vector space": "Real Vector Space"
    },
    {
        ", the space of translations which is equipped with an ": null
    },
    {
        "inner product": "Inner Product Space"
    },
    {
        ". The action of translations makes the space an ": null
    },
    {
        "affine space": "Affine Space"
    },
    {
        ", and this allow defining lines, planes, subspaces, dimension, and ": null
    },
    {
        "parallelism": "Parallelism"
    },
    {
        ". The inner product allows defining distance and angles.     The set   Rn of -tuples of real numbers equipped with the ": null
    },
    {
        "dot product": "Dot Product"
    },
    {
        " is a Euclidean space of dimension . Conversely, the choice of a point called the origin and an ": null
    },
    {
        "orthonormal basis": "Orthonormal Basis"
    },
    {
        " of the space of translations is equivalent with defining an ": null
    },
    {
        "isomorphism": "Isomorphism"
    },
    {
        " between a Euclidean space of dimension  and   Rn viewed as a Euclidean space.     It follows that everything that can be said about a Euclidean space can also be said about   Rn. Therefore, many authors, specially at elementary level, call   Rn the standard Euclidean space of dimension , or simply the Euclidean space of dimension .     A reason for introducing such an abstract definition of Euclidean spaces, and for working with it instead of   Rn is that it is often preferable to work in a coordinate-free and origin-free manner . Another reason is that there is no origin nor any basis in the physical world.       A Euclidean vector space is a finite-dimensional ": null
    },
    {
        "inner product space": "Inner Product Space"
    },
    {
        " over the ": null
    },
    {
        "real numbers": "Real Number"
    },
    {
        ".     A Euclidean space is an ": null
    },
    {
        "affine space": "Affine Space"
    },
    {
        " over the ": null
    },
    {
        "reals": "Real Number"
    },
    {
        " such that the associated vector space is a Euclidean vector space. Euclidean spaces are sometimes called Euclidean spaces for distinguishing them from Euclidean vector spaces.     The dimension of a Euclidean space is the ": null
    },
    {
        "dimension": "Dimension"
    },
    {
        " of its associated vector space.     If  is a Euclidean space, its associated vector space is also called its space of ": null
    },
    {
        "translations": "Translation"
    },
    {
        ", and often denoted   E.     The elements of  are called points and are commonly denoted by capital letters. The elements of   E are called translations,  Euclidean vector s or  free vector s.     The action of a translation  on a point  provides a point that is denoted . This action satisfies   : P+ +w.        The fact that the action is free and transitive means that for every pair of points  there is exactly one vector  such that . This vector  is denoted  or   .     As previously explained, some of the basic properties of Euclidean spaces result of the structure of affine space. They are described in  and its subsections. The properties resulting from the inner product are explained in  and its subsections.       For any vector space, the addition acts freely and transitively on the vector space itself. Thus a Euclidean vector space can be viewed as a Euclidean space that has itself as associated vector space.     A typical case of Euclidean vector space is   Rn viewed as a vector space equipped with the ": null
    },
    {
        "dot product": "Dot Product"
    },
    {
        " as an ": null
    },
    {
        "inner product": "Inner Product"
    },
    {
        ". The importance of this particular example of Euclidean space lies is the fact that every Euclidean space is ": null
    },
    {
        "isomorphic": "Isomorphism"
    },
    {
        " to it. More precisely, given a Euclidean space  of dimension , the choice of a point, called a origin and an ": null
    },
    {
        "orthonormal basis": "Orthonormal Basis"
    },
    {
        " of   E defines an isomorphism of Euclidean spaces from  to   Rn.     As every Euclidean space of dimension  is isomorphic to it, the Euclidean space   Rn is sometimes called the standard Euclidean space of dimension .             Some basic properties of Euclidean spaces depend only of the fact that a Euclidean space is an ": null
    },
    {
        "affine space": "Affine Space"
    },
    {
        ". they are called ": null
    },
    {
        "affine properties": "Affine Property"
    },
    {
        " and include the concepts of lines, subspaces, and parallelism. which are detailed in next subsections.          Let  a Euclidean space, and   E its associated vector space.     A flat, Euclidean subspace or affine subspace of  is a subset  of  such that   :   F     is a ": null
    },
    {
        "linear subspace": "Linear Subspace"
    },
    {
        " of   E. A Euclidean subspace  is a Euclidean space, with   F as associated vector space. This linear subspace   F is called the direction of .     If  is a point of  then   : F    Conversely, if  is a point of , and  is a ": null
    },
    {
        "linear subspace": "Linear Subspace"
    },
    {
        " of   E, then   : P+V    is a Euclidean subspace of direction .     A Euclidean vector space has two sorts of subspaces, its Euclidean subspaces and its linear subspaces. Linear subspaces are Euclidean subspaces, and a Euclidean subspace is a linear subspace if and only if it contains the zero vector.       In a Euclidean space, a line is a Euclidean subspace of dimension one. Since a vector space of dimension one is spanned by any nonzero vector a line is a set of the form   :     where  and  are two distinct points.     It follows that there is exactly one line that passes through two distinct points. This implies that two distinct lines intersect in at most one point.     A more symmetric representation of the line passing through  and  is   :     where  is an arbitrary point .     In a Euclidean vector space, the zero vector is usually chosen for ; this allows simplifying the preceding formula into   :     A standard convention allows using this formula in every Euclidean space, see .     The  line segment , or simply segment, joining the points  and  is the subset of the points such that  in the preceding formulas. It is denoted  or ; that is   : PQ QP         Two subspaces  and  of the same dimension in a Euclidean space are parallel if they have the same direction. Equivalently, they are parallel, if there is a translation  vector that maps one to the other:   : T S+v.     Given a point  and a subspace , there exists exactly one subspace that contains  and is parallel to , which is P +   S. In the case where  is a line , this property is ": null
    },
    {
        "Playfairs axiom": "Playfairs Axiom"
    },
    {
        ".     It follows that in a Euclidean plane, two lines either meet in one point or are parallel.     The concept of parallel subspaces has been extended to subspaces of different dimensions: two subspaces are parallel if the direction of one of them is contained in the direction to the other.       The vector space   E associated to a Euclidean space  is an ": null
    },
    {
        "inner product space": "Inner Product Space"
    },
    {
        ". This implies a ": null
    },
    {
        "symmetric bilinear form": "Symmetric Bilinear Form"
    },
    {
        "   :       E     E &     R    &     x,y         that is ": null
    },
    {
        "positive definite": "Positive Definite"
    },
    {
        " .     The inner product of a Euclidean space is often called dot product and denoted . This is specially the case when a ": null
    },
    {
        "Cartesian coordinate system": "Cartesian Coordinate System"
    },
    {
        " has been chosen, as, in this case, the inner product of two vectors is the ": null
    },
    {
        "dot product": "Dot Product"
    },
    {
        " of their ": null
    },
    {
        "coordinate vectors": "Coordinate Vector"
    },
    {
        ". For this reason, and for historical reasons, the dot notation is more commonly used than the bracket notation for the inner product of Euclidean spaces. This article will follow this usage; that is   x,y   will be denoted  in the remainder of this article.     The Euclidean norm of a vector  is   :     .     The inner product and the norm allows expressing and proving all ": null
    },
    {
        "metric": "Metric Space"
    },
    {
        " and ": null
    },
    {
        "topological": "Topology"
    },
    {
        " properties of ": null
    },
    {
        "Euclidean geometry": "Euclidean Geometry"
    },
    {
        ". The next subsection describe the most fundamental ones. In these subsections,  denotes an arbitrary Euclidean space, and   E denotes its vector space of translations.          The distance  between two points of a Euclidean space is the norm of the translation vector that maps one point to the other; that is   : d      The length of a segment  is the distance  between its endpoints. It is often denoted .     The distance is a ": null
    },
    {
        "metric": "Metric"
    },
    {
        ", as it satisfies the ": null
    },
    {
        "triangular inequality": "Triangular Inequality"
    },
    {
        "   : d  d + d.   Moreover, the equality is true if and only if  belongs to the segment .   This inequality means that the length of any edge of a ": null
    },
    {
        "triangle": "Triangle"
    },
    {
        " is smaller than the sum of the lengths of the other edges. This is the origin of the term triangular inequality.     With the Euclidean distance, every Euclidean space is a ": null
    },
    {
        "complete metric space": "Complete Metric Space"
    },
    {
        ".          Two nonzero vectors  and  of   E are perpendicular or orthogonal if their inner product is zero:   : u  v 0     Two linear subspaces of   E are orthogonal if every nonzero vector of the first one is perpendicular to every nonzero vector of the second one. This implies that the intersection of the linear subspace is reduced to the zero vector.     Two lines, and more generally two Euclidean subspaces are orthogonal if their direction are orthogonal. Two orthogonal lines that intersect are said perpendicular.     Two segments  and  that share a common endpoint are perpendicular or form a right angle  if the vectors   and   are orthogonal.     If  and  form a right angle, one has   : |BC|2 |AB|2 + |AC|2.   This is the ": null
    },
    {
        "Pythagorean theorem": "Pythagorean Theorem"
    },
    {
        ". Its proof is easy in this context, as, expressing this in terms of the inner product, one has, using bilinearity and symmetry of the inner product:   :     |BC|2 &           &         &       +       -2           &       +         & |AB|2 + |AC|2.                 The angle  between two nonzero vectors  and  in   E is   :       where  is the ": null
    },
    {
        "principal value": "Principal Value"
    },
    {
        " of the ": null
    },
    {
        "arccosine": "Arccosine"
    },
    {
        " function. By ": null
    },
    {
        "Cauchy–Schwarz inequality": "Cauchy–Schwarz Inequality"
    },
    {
        ", the argument of the arcsine is in the interval . Therefore  is real, and   if angles are measured in degrees": null
    },
    {
        "ctor spa": "Ctor Spa"
    }
]