[
    {
        "Faith and rationality are two ": null
    },
    {
        "ideologies": "Ideologies"
    },
    {
        " that exist in varying degrees of conflict or compatibility. ": null
    },
    {
        "Rationality": "Rationality"
    },
    {
        " is based on ": null
    },
    {
        "reason": "Reason"
    },
    {
        " or ": null
    },
    {
        "facts": "Facts"
    },
    {
        ". ": null
    },
    {
        "Faith": "Faith"
    },
    {
        " is belief in ": null
    },
    {
        "inspiration": "Biblical Inspiration"
    },
    {
        ", ": null
    },
    {
        "revelation": "Revelation"
    },
    {
        ", or ": null
    },
    {
        "authority": "Authority"
    },
    {
        ". The word faith sometimes refers to a belief that is held with lack of reason or evidence, a belief that is held in spite of or against ": null
    },
    {
        "reason": "Reason"
    },
    {
        " or ": null
    },
    {
        "evidence": "Evidence"
    },
    {
        ", or it can refer to belief based upon a degree of evidential warrant.     Although the words faith and belief are sometimes erroneously conflated and used as synonyms, faith properly refers to a particular type of belief, as defined above.     Broadly speaking, there are two categories of views regarding the relationship between faith and rationality:   ": null
    },
    {
        "Rationalism": "Rationalism"
    },
    {
        " holds that ": null
    },
    {
        "truth": "Truth"
    },
    {
        " should be determined by ": null
    },
    {
        "reason": "Reason"
    },
    {
        " and factual analysis, rather than faith, ": null
    },
    {
        "dogma": "Dogma"
    },
    {
        ", tradition or religious teaching.   ": null
    },
    {
        "Fideism": "Fideism"
    },
    {
        " holds that faith is necessary, and that beliefs may be held without any evidence or reason and even in conflict with evidence and reason.     The ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        " also has taught that true ": null
    },
    {
        "faith": "Faith"
    },
    {
        " and correct ": null
    },
    {
        "reason": "Reason"
    },
    {
        " can and must work together, and, viewed properly, can never be in conflict with one another, as both have their origin in God, as stated in the ": null
    },
    {
        "Papal encyclical": "Papal Encyclical"
    },
    {
        " letter issued by ": null
    },
    {
        "Pope John Paul II": "Pope John Paul Ii"
    },
    {
        ",  Fides et ratio  .       From at least the days of the Greek philosophers, the relationship between faith and reason has been hotly debated. ": null
    },
    {
        "Plato": "Plato"
    },
    {
        " argued that knowledge is simply memory of the eternal. ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        " set down rules by which knowledge could be discovered by reason.     Rationalists point out that many people hold irrational beliefs, for many reasons. There may be evolutionary causes for irrational beliefs — irrational beliefs may increase our ability to survive and reproduce. Or, according to ": null
    },
    {
        "Pascals Wager": "Pascals Wager"
    },
    {
        ", it may be to our advantage to have faith, because faith may promise infinite rewards, while the rewards of reason are seen by many as finite. One more reason for irrational beliefs can perhaps be explained by operant conditioning. For example, in one study by ": null
    },
    {
        "B. F. Skinner": "B. F. Skinner"
    },
    {
        " in 1948, pigeons were awarded grain at regular time intervals regardless of their behaviour. The result was that each of the pigeons developed their own idiosyncratic response which had become associated with the consequence of receiving grain.      Believers in faith — for example those who believe salvation is possible through faith alone — frequently suggest that everyone holds beliefs arrived at by faith, not reason.  The belief that the universe is a sensible place and that our minds allow us to arrive at correct conclusions about it, is a belief we hold through faith. Rationalists contend that this is arrived at because they have observed the world being consistent and sensible, not because they have faith that it is.     Beliefs held by faith may be seen existing in a number of relationships to rationality:   Faith as underlying rationality": null
    },
    {
        "knowledge": "Knowledge"
    },
    {
        " and reason is seen as dependent on ": null
    },
    {
        "faith": "Faith"
    },
    {
        "reason": "Reason"
    },
    {
        ", faith in our ": null
    },
    {
        "memories": "Memory"
    },
    {
        ", and faith in the accounts of events we receive from others. Accordingly, faith is seen as essential to and inseparable from rationality. According to ": null
    },
    {
        "René Descartes": "René Descartes"
    },
    {
        ", rationality is built first upon the realization of the absolute truth ": null
    },
    {
        "I think therefore I am": "Cogito Ergo Sum"
    },
    {
        " , which requires no faith. All other rationalizations are built outward from this realization, and are subject to ": null
    },
    {
        "falsification": "Falsifiability"
    },
    {
        " at any time with the arrival of new evidence.   Faith as addressing issues beyond the scope of rationalityFaith as contradicting rationalityFaith and reason as essential together": null
    },
    {
        "superstition": "Superstition"
    },
    {
        ", while ": null
    },
    {
        "reason": "Reason"
    },
    {
        " without ": null
    },
    {
        "faith": "Faith"
    },
    {
        " leads to ": null
    },
    {
        "nihilism": "Nihilism"
    },
    {
        " and ": null
    },
    {
        "relativism": "Relativism"
    },
    {
        ".   Faith as based on warrant       ": null
    },
    {
        "St. Thomas Aquinas": "Thomas Aquinas"
    },
    {
        ", the most important ": null
    },
    {
        "doctor of the Catholic Church": "Doctor Of The Churchcatholicism"
    },
    {
        ", was the first to write a full treatment of the relationship, differences, and similarities between faith—an intellectual assent  from the  Catholic Encyclopedia  —and reason,  from the  Catholic Encyclopedia  predominately in his  Summa Theologica ,  De Veritate , and  Summa contra Gentiles . For an overview—with copious quotes from ": null
    },
    {
        "St. Thomas Aquinass": "Thomas Aquinas"
    },
    {
        " works, some of which are quoted here—of his exposition of the topic of faith and reason, consult .     The ": null
    },
    {
        "Council of Trents": "Council Of Trent"
    },
    {
        " catechism": "Catechism"
    },
    {
        "—the  Roman Catechism , written during the Catholic Churchs ": null
    },
    {
        "Counter-Reformation": "Counter-Reformation"
    },
    {
        " to combat ": null
    },
    {
        "Protestantism": "Protestantism"
    },
    {
        " and ": null
    },
    {
        "Martin Luthers": "Martin Luther"
    },
    {
        " antimetaphysical tendencies.  On the differences between ": null
    },
    {
        "Thomas Aquinass": "Thomas Aquinas"
    },
    {
        " conception of faith and reason and that of ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        ".      Dei Filius  was a ": null
    },
    {
        "dogmatic constitution": "Dogmatic Constitution"
    },
    {
        " of the ": null
    },
    {
        "First Vatican Council": "First Vatican Council"
    },
    {
        " on the ": null
    },
    {
        "Roman Catholic": "Roman Catholic"
    },
    {
        " faith. It was adopted unanimously on 24 April 1870 and was influenced by the philosophical conceptions of ": null
    },
    {
        "Johann Baptist Franzelin": "Johann Baptist Franzelin"
    },
    {
        ", who had written a great deal on the topic of faith and rationality.      Because the Roman Catholic Church does not disparage reason, but rather affirms its veracity and utility, there have been many ": null
    },
    {
        "Catholic scientists": "List Of Roman Catholic Cleric–Scientists"
    },
    {
        " over the ages.     Twentieth-century ": null
    },
    {
        "Thomist": "Thomism"
    },
    {
        " philosopher ": null
    },
    {
        "Étienne Gilson": "Étienne Gilson"
    },
    {
        " wrote about faith and reason  in his 1922 book Le Thomisme.  His contemporary ": null
    },
    {
        "Jacques Maritain": "Jacques Maritain"
    },
    {
        " wrote about it in his The Degrees of Knowledge.       Fides et Ratio  is an encyclical promulgated by Pope John Paul II on 14 September 1998. It deals with the relationship between faith and reason.     ": null
    },
    {
        "Pope Benedict XVIs": "Pope Benedict Xvi"
    },
    {
        " 12 September 2006 ": null
    },
    {
        "Regensburg Lecture": "Regensburg Lecture"
    },
    {
        " was about faith and reason.          Martin Luthers ": null
    },
    {
        "Theology of the Cross": "Theology Of The Cross"
    },
    {
        " was a critique of the use of reason in theology as used by some in the Catholic Church. Some have asserted that ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        " taught that faith and reason were antithetical in the sense that questions of faith could not be illuminated by reason. Contemporary Lutheran scholarship however has found a different reality in Luther. Luther rather seeks to separate faith and reason in order to honor the separate spheres of knowledge that each understand. Bernhard Lohse for example has demonstrated in his classic work Fides Und Ratio that Luther ultimately sought to put the two together. More recently ": null
    },
    {
        "Hans-Peter Großhans": "Hans-Peter Großhans"
    },
    {
        " has demonstrated that Luthers work on Biblical Criticism stresses the need for external coherence in right exegetical method. This means that for Luther it is more important that the Bible be reasonable according to the reality outside of the scriptures than that the Bible make sense to itself, that it has internal coherence. The right tool for understanding the world outside of the Bible for Luther is none other than Reason which for Luther denoted science, philosophy, history and empirical observation. Here a differing picture is presented of a Luther who deeply valued both faith and reason, and held them in dialectical partnership. Luthers concern thus in separating them is honoring their different epistemological spheres.            The view that faith underlies all rationality holds that rationality is dependent on faith for its coherence. Under this view, there is no way to comprehensively prove that we are actually seeing what we appear to be seeing, that what we remember actually happened, or that the laws of logic and mathematics are actually real. Instead, all beliefs depend for their coherence on faith in our senses, memory, and reason, because the foundations of rationalism cannot be proven by evidence or reason. Rationally, you can not prove anything you see is real, but you can prove that you yourself are real, and rationalist belief would be that you can believe that the world is consistent until something demonstrates inconsistency. This differs from faith based belief, where you believe that your world view is consistent no matter what inconsistencies the world has with your beliefs.       In this view, there are many beliefs that are held by faith alone, that rational thought would force the mind to reject. As an example, many people believe in the Biblical story of Noahs flood: that the entire Earth was covered by water for forty days. But objected that most plants cannot survive being covered by water for that length of time, a boat of that magnitude could not have been built by wood, and there would be no way for two of every animal to survive on that ship and migrate back to their place of origin. , Although Christian apologists offer answers to these and such issues,    under the premise that such responses are insufficient, then one must choose between accepting the story on faith and rejecting reason, or rejecting the story by reason and thus rejecting faith.     Within the rationalist point of view, there remains the possibility of multiple rational explanations. For example, considering the biblical story of Noahs flood, one making rational determinations about the probability of the events does so via interpretation of modern evidence. Two observers of the story may provide different plausible explanations for the life of plants, construction of the boat, species living at the time, and migration following the flood. Some see this as meaning that a person is not strictly bound to choose between faith and reason.       American biblical scholar ": null
    },
    {
        "Archibald Thomas Robertson": "Archibald Thomas Robertson"
    },
    {
        " stated that the Greek word pistis used for faith in the New Testament , and rendered assurance in Acts 17:31 , is an old verb to furnish, used regularly by Demosthenes for bringing forward evidence.  Likewise Tom Price affirms that when the New Testament talks about faith positively it only uses words derived from the Greek root which means to be persuaded.      In contrast to faith meaning blind trust, in the absence of evidence, even in the teeth of evidence, ": null
    },
    {
        "Alister McGrath": "Alister Mcgrath"
    },
    {
        " quotes Oxford Anglican theologian W. H. Griffith-Thomas, , who states faith is not blind, but intelligent and commences with the conviction of the mind based on adequate evidence... , which McGrath sees as a good and reliable definition, synthesizing the core elements of the characteristic Christian understanding of faith.      ": null
    },
    {
        "Alvin Plantinga": "Alvin Plantinga"
    },
    {
        " upholds that faith may be the result of evidence testifying to the reliability of the source of truth claims, but although it may involve this, he sees faith as being the result of hearing the truth of the gospel with the internal persuasion by the Holy Spirit moving and enabling him to believe. Christian belief is produced in the believer by the internal instigation of the Holy Spirit, endorsing the teachings of Scripture, which is itself divinely inspired by the Holy Spirit. The result of the work of the Holy Spirit is faith.        The 14th Century Jewish philosopher ": null
    },
    {
        "Levi ben Gerson": "Levi Ben Gerson"
    },
    {
        " tried to reconcile faith and reason. He wrote, The Torah cannot prevent us from considering to be true that which our reason urges us to believe. Jewish Encyclopedia, volume VIII, page 29 His contemporary ": null
    },
    {
        "Hasdai ben Abraham Crescas": "Hasdai Ben Abraham Crescas"
    }
]