[
    {
        "                A fallout shelter is an enclosed space specially designed to protect occupants from radioactive debris or ": null
    },
    {
        "fallout": "Nuclear Fallout"
    },
    {
        " resulting from a ": null
    },
    {
        "nuclear explosion": "Nuclear Explosion"
    },
    {
        ". Many such shelters were constructed as ": null
    },
    {
        "civil defense": "Civil Defense"
    },
    {
        " measures during the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ".     During a nuclear explosion, matter vaporized in the resulting fireball is exposed to neutrons from the explosion, absorbs them, and becomes ": null
    },
    {
        "radioactive": "Radioactivity"
    },
    {
        ". When this material condenses in the rain, it forms dust and light sandy materials that resemble ground ": null
    },
    {
        "pumice": "Pumice"
    },
    {
        ". The fallout emits ": null
    },
    {
        "alpha": "Alpha Particle"
    },
    {
        " and ": null
    },
    {
        "beta particles": "Beta Particle"
    },
    {
        ", as well as ": null
    },
    {
        "gamma rays": "Gamma Ray"
    },
    {
        ".     Much of this highly radioactive material falls to earth, subjecting anything within the line of sight to radiation, becoming a significant ": null
    },
    {
        "hazard": "Radioactive Contamination"
    },
    {
        ". A fallout shelter is designed to allow its occupants to minimize exposure to harmful fallout until radioactivity has ": null
    },
    {
        "decayed": "Radioactive Decay"
    },
    {
        " to a safer level.              During the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ", many countries built fallout shelters for high-ranking government officials and crucial military facilities, such as ": null
    },
    {
        "Project Greek Island": "Project Greek Island"
    },
    {
        " and the ": null
    },
    {
        "Cheyenne Mountain nuclear bunker": "Cheyenne Mountain Nuclear Bunker"
    },
    {
        " in the United States and Canadas ": null
    },
    {
        "Emergency Government Headquarters": "Emergency Government Headquarters"
    },
    {
        ". Plans were made, however, to use existing buildings with sturdy below-ground-level basements as makeshift fallout shelters. These buildings were ": null
    },
    {
        "placard": "Placard"
    },
    {
        "ed with the orange-yellow and black ": null
    },
    {
        "trefoil": "Trefoil"
    },
    {
        " sign designed by ": null
    },
    {
        "United States Army Corps of Engineers": "United States Army Corps Of Engineers"
    },
    {
        " director of administrative logistics support function ": null
    },
    {
        "Robert W. Blakeley": "Robert Blakeley"
    },
    {
        " in 1961.      The ": null
    },
    {
        "National Emergency Alarm Repeater": "National Emergency Alarm Repeater"
    },
    {
        " program was developed in the United States in 1956 during the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        " to supplement the existing siren ": null
    },
    {
        "warning systems": "Warning Systems"
    },
    {
        " and radio broadcasts in the event of a ": null
    },
    {
        "nuclear attack": "Nuclear Attack"
    },
    {
        ". The NEAR civilian alarm device was engineered and tested but the program was not viable and was terminated in 1967.      In the U.S. in September 1961, under the direction of ": null
    },
    {
        "Steuart L. Pittman": "Assistant Secretary Of Defense For Homeland Defense And Americas Security Affairsprecedent"
    },
    {
        ", the federal government started the Community Fallout Shelter Program.   A letter from ": null
    },
    {
        "President Kennedy": "John F. Kennedy"
    },
    {
        " advising the use of fallout shelters appeared in the September 1961 issue of  Life  magazine.  Over the period 1961-1963, there was a growth in home fallout shelter sales, but eventually there was a public backlash against the fallout shelter as a consumer product.      In November 1961, in  Fortune  magazine, an article by Gilbert Burck appeared that outlined the plans of ": null
    },
    {
        "Nelson Rockefeller": "Nelson Rockefeller"
    },
    {
        ", ": null
    },
    {
        "Edward Teller": "Edward Teller"
    },
    {
        ", ": null
    },
    {
        "Herman Kahn": "Herman Kahn"
    },
    {
        ", and ": null
    },
    {
        "Chet Holifield": "Chet Holifield"
    },
    {
        " for an enormous network of concrete lined underground fallout shelters throughout the United States sufficient to shelter millions of people to serve as a refuge in case of ": null
    },
    {
        "nuclear war": "Nuclear War"
    },
    {
        ". ": null
    },
    {
        "Fortune": "Fortune"
    },
    {
        " magazine November 1961 Pages 112–115 et al     The United States ended federal funding for the shelters in the 1970s.  In 2017, New York City began removing the yellow signs since members of the public are unlikely to find viable food and medicine inside those rooms.        Similar projects have been undertaken in ": null
    },
    {
        "Finland": "Finland"
    },
    {
        ", which requires all buildings with area over 600  m² to have an NBC shelter, and ": null
    },
    {
        "Norway": "Norway"
    },
    {
        ", which requires all buildings with an area over 1000  m² to have a shelter.      The former ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " and other Eastern Bloc countries often designed their underground mass-transit and subway tunnels to serve as bomb and fallout shelters in the event of an attack.     Germany has protected shelters for 3% of its population, Austria for 30%, Finland for 70%, Sweden for 81%, and Switzerland for 114%.            ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        " built an extensive network of fallout shelters, not only through extra hardening of government buildings such as schools, but also through a building regulation requiring nuclear shelters in residential buildings since the 1960s .  Catherine Frammery, ,  Le temps , Monday 15 August 2016 . Later, the law ensured that all residential buildings built after 1978 contained a nuclear shelter able to withstand a blast from a 12 megaton explosion at a distance of 700 metres.  The Federal Law on the Protection of the Population and Civil Protection still requires that every inhabitant should have a place in a shelter close to where they live.  Daniele Mariani, , ": null
    },
    {
        "Swissinfo": "Swissinfo"
    },
    {
        ", 23 October 2009 .     The Swiss authorities maintained large communal shelters  stocked with over four months of food and fuel. The reference  Nuclear War Survival Skills  declared that, as of 1986, Switzerland has the best civil defense system, one that already includes blast shelters for over 85% of all its citizens.  As of 2006, there were about 300,000 shelters built in private homes, institutions and hospitals, as well as 5,100 public shelters for a total of 8.6 million places, a level of coverage equal to 114% of the population.     In Switzerland, most residential shelters are no longer stocked with the food and water required for prolonged habitation and a large number have been converted by the owners to other uses . But the owner still has the obligation to ensure the maintenance of the shelter.                 A basic fallout shelter consists of shields that reduce gamma ray exposure by a factor of 1000. The required shielding can be accomplished with 10 times the ": null
    },
    {
        "thickness": "Radiation Protectionshielding Design"
    },
    {
        " of any quantity of material capable of cutting gamma ray exposure in half. Shields that reduce gamma ray intensity by 50% include 1  cm of lead, 6  cm of concrete, 9  cm of packed earth or 150  m of air. When multiple thicknesses are built, the shielding multiplies. Thus, a practical fallout shield is ten halving-thicknesses of packed earth, reducing gamma rays by approximately 1024 times .      Usually, an expedient purpose-built fallout shelter is a trench; with a strong roof buried by 1  m of earth. The two ends of the trench have ramps or entrances at right angles to the trench, so that gamma rays cannot enter . To make the overburden waterproof , a plastic sheet may be buried a few inches below the surface and held down with rocks or bricks.      Blast doors are designed to absorb the shock wave of a nuclear blast, bending and then returning to their original shape.        Dry earth is a reasonably good thermal insulator, and over several weeks of habitation, a shelter will become dangerously hot. The simplest form of effective fan to cool a shelter is a wide, heavy frame with flaps that swing in the shelters doorway and can be swung from hinges on the ceiling. The flaps open in one direction and close in the other, pumping air.      Unfiltered air is safe, since the most dangerous fallout has the consistency of sand or finely ground pumice. Such large particles are not easily ingested into the soft tissues of the body, so extensive filters are not required. Any exposure to fine dust is far less hazardous than exposure to the fallout outside the shelter. Dust fine enough to pass the entrance will probably pass through the shelter.  Some shelters, however, incorporate ": null
    },
    {
        "NBC": "Chemical, Biological, Radiological, And Nuclear"
    },
    {
        "-filters for additional protection.       Effective public shelters can be the middle floors of some tall buildings or parking structures, or below ground level in most buildings with more than 10 floors. The thickness of the upper floors must form an effective shield, and the windows of the sheltered area must not view fallout-covered ground that is closer than 1.5  km . One of Switzerlands solutions is to use road tunnels passing through the mountains, with some of ": null
    },
    {
        "these shelters": "Sonnenberg Tunnel"
    },
    {
        " being able to protect tens of thousands.      Fallout shelters are not always underground. Above ground buildings with walls and roofs dense enough to afford a meaningful ": null
    },
    {
        "protection factor": "Radiation Protectionshielding Design"
    },
    {
        " can be used as a fallout shelter. Monteyne, David. Fallout Shelter: Designing for Civil Defense in the Cold War. Minneapolis: University of Minnesota, 2011. Print.       A battery-powered radio may be helpful to get reports of fallout patterns and clearance. However, radio and other electronic equipment may be disabled by ": null
    },
    {
        "electromagnetic pulse": "Electromagnetic Pulse"
    },
    {
        ". For example, even at the height of the cold war, ": null
    },
    {
        "EMP protection": "Electromagnetic Pulsepractical Considerations For Nuclear Emp"
    },
    {
        " had been completed for only 125 of the approximately 2,771 radio stations in the United States ": null
    },
    {
        "Emergency Broadcast System": "Emergency Broadcast System"
    },
    {
        ". Also, only 110 of 3,000 existing Emergency Operating Centers had been protected against EMP effects.  The Emergency Broadcast System has since been supplanted in the United States by the ": null
    },
    {
        "Emergency Alert System": "Emergency Alert System"
    },
    {
        ".     The reference  Nuclear War Survival Skills  includes the following supplies in a list of Minimum Pre-Crisis Preparations : one or more shovels, a pick, a bow-saw with an extra blade, a hammer, and 4-mil polyethylene film ; a homemade shelter-ventilating pump ; large containers for water; a plastic bottle of sodium hypochlorite bleach; one or two ": null
    },
    {
        "KFMs": "Kearny Fallout Meter"
    },
    {
        " and the knowledge to operate them; at least a 2-week supply of compact, nonperishable food; an efficient portable stove; wooden matches in a waterproof container; essential containers and utensils for storing, transporting, and cooking food; a hose-vented 5-gallon can, with heavy plastic bags for liners, for use as a toilet; tampons; insect screen and fly bait; any special medications needed by family members; pure ": null
    },
    {
        "potassium iodide": "Potassium Iodide"
    },
    {
        ", a 2-oz bottle, and a medicine dropper; a first-aid kit and a tube of antibiotic ointment; long-burning candles sufficient for at least 14 nights; an ": null
    },
    {
        "oil lamp": "Nuclear War Survival Skillslight"
    },
    {
        "; a flashlight and extra batteries; and a transistor radio with extra batteries and a metal box to protect it from electromagnetic pulse.      Inhabitants should have water on hand, 1-2 gallons per person per day. Water stored in bulk containers requires less space than water stored in smaller bottles.        Commercially made ": null
    },
    {
        "Geiger counters": "Geiger Counter"
    },
    {
        " are expensive and require frequent calibration. It is possible to construct an ": null
    },
    {
        "electrometer": "Electroscopegold-Leaf Electroscope"
    },
    {
        "-type radiation meter called the ": null
    },
    {
        "Kearny fallout meter": "Kearny Fallout Meter"
    },
    {
        ", which does not require batteries or professional calibration, from properly-scaled plans with just a coffee can or pail, gypsum board, ": null
    },
    {
        "monofilament fishing line": "Monofilament Fishing Line"
    },
    {
        ", and aluminum foil.  Plans are freely available in the public domain in the reference  Nuclear War Survival Skills  by ": null
    },
    {
        "Cresson Kearny": "Cresson Kearny"
    },
    {
        ".        Inhabitants should plan to remain sheltered for at least two weeks , then work outside for gradually increasing amounts of time, to four hours a day at three weeks. The normal work is to sweep or wash fallout into shallow trenches to decontaminate the area. They should sleep in a shelter for several months. Evacuation at three weeks is recommended by official authorities.     If available, inhabitants may take ": null
    },
    {
        "potassium iodide": "Potassium Iodide"
    },
    {
        " at the rate of 130  mg/day per adult as an additional measure to protect the thyroid gland from the uptake of dangerous radioactive iodine, a component of most fallout and reactor waste.                 In the vast majority of accidents, and in all ": null
    },
    {
        "atomic bomb": "Atomic Bomb"
    },
    {
        " blasts, the threat due to beta and gamma emitters is greater than that posed by the alpha emitters in the fallout. Alpha particles are identical to a helium-4 nucleus , and travel at speeds in excess of 5% of the speed of light. ": null
    },
    {
        "Alpha particles": "Alpha Particle"
    },
    {
        " have little penetrating power; most cannot penetrate through human skin. Avoiding direct exposure with fallout particles will prevent injury from alpha radiation.        ": null
    },
    {
        "Beta radiation": "Beta Particle"
    },
    {
        " consists of particles given off by some fallout. Most beta particles cannot penetrate more than about 10 feet of air or about  inch of water, wood, or human body tissue; or a sheet of aluminum foil. Avoiding direct exposure with fallout particles will prevent most injuries from beta radiation.     The primary dangers associated with beta radiation are internal exposure from ingested fallout particles and beta burns from fallout particles no more than a few days old. ": null
    },
    {
        "Beta burns": "Beta Burn"
    },
    {
        " can result from contact with highly radioactive particles on bare skin; ordinary clothing separating fresh fallout particles from the skin can provide significant shielding.        ": null
    },
    {
        "Gamma radiation": "Gamma Ray"
    },
    {
        " penetrates further through matter than alpha or beta radiation. Most of the design of a typical fallout shelter is intended to protect against gamma ": null
    },
    {
        "rays": "Electromagnetic Radiation"
    },
    {
        ". Gamma rays are better absorbed by materials with high atomic numbers and high density, although neither effect is important compared to the total mass per area in the path of the gamma ray. Thus, lead is only modestly better as a gamma shield than an equal mass of another shielding material such as aluminum, concrete, water or soil.     Some gamma radiation from fallout will penetrate into even the best shelters. However, the radiation dose received while inside a shelter can be significantly reduced with proper shielding. Ten ": null
    },
    {
        "halving thicknesses": "Radiation Protectionshielding Design"
    },
    {
        " of a given material can reduce gamma exposure to less than  of unshielded exposure.        The bulk of the ": null
    },
    {
        "radioactivity": "Radioactivity"
    },
    {
        " in nuclear accident fallout is more long-lived than that in ": null
    },
    {
        "weapons fallout": "Fallout"
    },
    {
        ". A good table of the ": null
    },
    {
        "nuclides": "Nuclide"
    },
    {
        ", such as that provided by the ": null
    },
    {
        "Korean Atomic Energy Research Institute": "Korean Atomic Energy Research Institute"
    },
    {
        ", includes the ": null
    },
    {
        "fission": "Nuclear Fission"
    },
    {
        " yields of the different nuclides. From this data it is possible to calculate the isotopic mixture in the fallout .       While a persons home may not be a purpose-made shelter, it could be thought of as one if measures are taken to improve the degree of ": null
    },
    {
        "fallout protection": "Radiation Protection"
    },
    {
        ".       The main threat of ": null
    },
    {
        "beta radiation": "Radiationbeta"
    },
    {
        " exposure comes from  hot particle s in contact with or close to the skin of a person. Also, swallowed or inhaled hot particles could cause ": null
    },
    {
        "beta burns": "Beta Burn"
    },
    {
        ". As it is important to avoid bringing hot particles into the shelter, one option is to remove ones outer clothing, or follow other ": null
    },
    {
        "decontamination procedures": "Human Decontamination"
    },
    {
        ", on entry. Fallout particles will cease to be radioactive enough to cause beta burns within a few days following a nuclear explosion. The danger of gamma radiation will persist for far longer than the threat of beta burns in areas with heavy fallout exposure.        The gamma dose rate due to the contamination brought into the shelter on the clothing of a person is likely to be small compared to ": null
    },
    {
        "gamma radiation": "Radiationgamma"
    },
    {
        " that penetrates through the walls of the shelter. The following measures can be taken to reduce the amount of gamma radiation entering the shelter:   Roofs and gutters can be cleaned to lower the dose rate in the house.   The top inch of soil in the area near the house can be either removed or dug up and mixed with the ": null
    },
    {
        "subsoil": "Subsoil"
    },
    {
        ". This reduces the dose rate as the gamma rays have to pass through the topsoil before they can irradiate anything above.   Nearby roads can be rinsed and washed down to remove dust and debris; the ": null
    },
    {
        "fallout": "Fallout"
    },
    {
        " would collect in the sewers and gutters for easier disposal. In ": null
    },
    {
        "Kiev": "Kiev"
    },
    {
        " after the ": null
    },
    {
        "Chernobyl accident": "Chernobyl Accident"
    },
    {
        " a program of road washing was used to control the spread of radioactivity.   Windows can be bricked up, or the sill raised to reduce the hole in the shielding formed by the wall.   Gaps in the shielding can be blocked using containers of water. While water has a much lower density than that of lead, it is still able to shield some gamma rays.   Earth can be heaped up against the exposed walls of the building; this forces the gamma rays to pass through a thicker layer of shielding before entering the house.   Nearby trees can be removed to reduce the dose due to fallout which is on the branches and leaves. It has been suggested by the US government that a fallout shelter should not be dug close to trees for this reason.                Fallout shelters feature prominently in the ": null
    },
    {
        "Robert A. Heinlein": "Robert A. Heinlein"
    },
    {
        " novel  Farnhams Freehold  ,   Pulling Through by ": null
    },
    {
        "Dean Ing": "Dean Ing"
    },
    {
        ",  A Canticle for Leibowitz  by ": null
    },
    {
        "Walter M. Miller": "Walter M. Miller"
    },
    {
        " and  Earth  by ": null
    },
    {
        "David Brin": "David Brin"
    },
    {
        ".     The 1961  Twilight Zone  episode ": null
    },
    {
        "The Shelter": "The Shelter"
    },
    {
        " , from a ": null
    },
    {
        "Rod Serling": "Rod Serling"
    },
    {
        " script, deals with the consequences of actually using a shelter. Another episode of the series called ": null
    },
    {
        "One More Pallbearer": "One More Pallbearer"
    },
    {
        " featured a fallout shelter owned by millionaire. The ": null
    },
    {
        "1985 adaption of the series": "The Twilight Zone"
    },
    {
        " had the episode ": null
    },
    {
        "Shelter Skelter": "Shelter Skelter"
    },
    {
        " that featured a fallout shelter.     In the  Only Fools and Horses  episode ": null
    },
    {
        "The Russians are Coming": "The Russians Are Coming"
    },
    {
        " , Derek Trotter buys a lead fallout shelter, then decides to construct it in fear of an impending nuclear war caused by the Soviet Union .     In 1999 the film  Blast from the Past  was released. It is a ": null
    },
    {
        "romantic comedy": "Romantic Comedy"
    },
    {
        " film about a ": null
    },
    {
        "nuclear physicist": "Nuclear Physics"
    },
    {
        ", his wife, and son that enter a well-equipped, spacious fallout shelter during the 1962 ": null
    },
    {
        "Cuban Missile Crisis": "Cuban Missile Crisis"
    },
    {
        ". They do not emerge until 35 years later, in 1997. The film shows their reaction to contemporary society.     The ": null
    },
    {
        "Fallout series": "Fallout Series"
    },
    {
        " of computer games depicts the remains of human civilization after an immensely destructive global nuclear war; the United States of America had built underground vaults that were advertised to protect the population against a nuclear attack, but almost all of them were in fact meant to lure ": null
    },
    {
        "subjects": "Human Subject Research"
    },
    {
        " for long-term ": null
    },
    {
        "human experimentation": "Unethical Human Experimentation"
    },
    {
        ".      Paranoia , a role-playing game, takes place in a form of fallout shelter, which has become ruled by an insane computer.     The  Metro 2033  book series by Russian author ": null
    },
    {
        "Dmitry Glukhovsky": "Dmitry Glukhovsky"
    },
    {
        " depicts survivors life in the subway systems below Moscow and Saint-Petersburg after a nuclear exchange between the Russian Federation and the United States of America.     Fallout shelters are often featured on the reality television show  Doomsday Preppers .      The ": null
    },
    {
        "Silo series": "Silo"
    },
    {
        " of novellas by ": null
    },
    {
        "Hugh Howey": "Hugh Howey"
    }
]