[
    {
        "                 Fat Man was the codename for the nuclear bomb that was ": null
    },
    {
        "detonated over the Japanese city of Nagasaki": "Atomic Bombings Of Hiroshima And Nagasakibombing Of Nagasaki"
    },
    {
        " by the United States on 9 August 1945. It was the second of the only two nuclear weapons ever used in warfare, the first being ": null
    },
    {
        "Little Boy": "Little Boy"
    },
    {
        ", and its detonation marked the third nuclear explosion in history. It was built by scientists and engineers at ": null
    },
    {
        "Los Alamos Laboratory": "Los Alamos Laboratory"
    },
    {
        " using ": null
    },
    {
        "plutonium": "Plutonium"
    },
    {
        " from the ": null
    },
    {
        "Hanford Site": "Hanford Site"
    },
    {
        ", and it was dropped from the ": null
    },
    {
        "Boeing B-29 Superfortress": "Boeing B-29 Superfortress"
    },
    {
        "  Bockscar  piloted by Major ": null
    },
    {
        "Charles Sweeney": "Charles Sweeney"
    },
    {
        ".     The name Fat Man refers to the early design of the bomb because it had a wide, round shape; it was also known as the Mark III. Fat Man was an ": null
    },
    {
        "implosion-type nuclear weapon": "Implosion-Type Nuclear Weapon"
    },
    {
        " with a solid plutonium core. The first of that type to be detonated was the Gadget in the ": null
    },
    {
        "Trinity nuclear test": "Trinity"
    },
    {
        " less than a month earlier on 16 July at the ": null
    },
    {
        "Alamogordo Bombing and Gunnery Range": "Holloman Air Force Base"
    },
    {
        " in New Mexico. Two more were detonated during the ": null
    },
    {
        "Operation Crossroads": "Operation Crossroads"
    },
    {
        " nuclear tests at ": null
    },
    {
        "Bikini Atoll": "Bikini Atoll"
    },
    {
        " in 1946, and some 120 were produced between 1947 and 1949, when it was superseded by the ": null
    },
    {
        "Mark 4 nuclear bomb": "Mark 4 Nuclear Bomb"
    },
    {
        ". The Fat Man was retired in 1950.         ": null
    },
    {
        "Robert Oppenheimer": "Robert Oppenheimer"
    },
    {
        " held conferences in Chicago in June 1942, prior to the Army taking over wartime atomic research, and in Berkeley, California, in July, at which various engineers and physicists discussed nuclear bomb design issues. They chose a ": null
    },
    {
        "gun-type": "Gun-Type Fission Weapon"
    },
    {
        " design in which two sub-critical masses would be brought together by firing a bullet into a target . ": null
    },
    {
        "Richard C. Tolman": "Richard C. Tolman"
    },
    {
        " suggested an ": null
    },
    {
        "implosion-type nuclear weapon": "Implosion-Type Nuclear Weapon"
    },
    {
        ", but the proposal attracted little interest.     The feasibility of a plutonium bomb was questioned in 1942. ": null
    },
    {
        "Wallace Akers": "Wallace Akers"
    },
    {
        ", the director of the British ": null
    },
    {
        "Tube Alloys": "Tube Alloys"
    },
    {
        " project, told ": null
    },
    {
        "James Bryant Conant": "James Bryant Conant"
    },
    {
        " on 14 November that ": null
    },
    {
        "James Chadwick": "James Chadwick"
    },
    {
        " had concluded that plutonium might not be a practical fissionable material for weapons because of impurities.  Conant consulted ": null
    },
    {
        "Ernest Lawrence": "Ernest Lawrence"
    },
    {
        " and ": null
    },
    {
        "Arthur Compton": "Arthur Compton"
    },
    {
        ", who acknowledged that their scientists at Berkeley and Chicago respectively knew about the problem, but they could offer no ready solution. Conant informed ": null
    },
    {
        "Manhattan Project": "Manhattan Project"
    },
    {
        " director Brigadier General ": null
    },
    {
        "Leslie R. Groves Jr.": "Leslie R. Groves Jr."
    },
    {
        ", who in turn assembled a special committee consisting of Lawrence, Compton, Oppenheimer, and McMillan to examine the issue. The committee concluded that any problems could be overcome simply by requiring higher purity.     Oppenheimer reviewed his options in early 1943 and gave priority to the gun-type weapon, but he created the E-5 Group at the ": null
    },
    {
        "Los Alamos Laboratory": "Los Alamos Laboratory"
    },
    {
        " under ": null
    },
    {
        "Seth Neddermeyer": "Seth Neddermeyer"
    },
    {
        " to investigate implosion as a hedge against the threat of pre-detonation. Implosion-type bombs were determined to be significantly more efficient in terms of explosive yield per unit mass of fissile material in the bomb, because compressed fissile materials react more rapidly and therefore more completely. Nonetheless, it was decided that the plutonium gun would receive the bulk of the research effort, since it was the project with the least amount of uncertainty involved. It was assumed that the uranium gun-type bomb could be easily adapted from it.       The gun-type and implosion-type designs were codenamed ": null
    },
    {
        "Thin Man": "Thin Man"
    },
    {
        " and Fat Man respectively. These code names were created by ": null
    },
    {
        "Robert Serber": "Robert Serber"
    },
    {
        ", a former student of Oppenheimers who worked on the Manhattan Project. He chose them based on their design shapes; the Thin Man was a very long device, and the name came from the ": null
    },
    {
        "Dashiell Hammett": "Dashiell Hammett"
    },
    {
        " detective novel  The Thin Man  and ": null
    },
    {
        "series of movies": "The Thin Man"
    },
    {
        ". The Fat Man was round and fat and was named after ": null
    },
    {
        "Sydney Greenstreets": "Sydney Greenstreet"
    },
    {
        " character in  The Maltese Falcon . ": null
    },
    {
        "Little Boy": "Little Boy"
    },
    {
        " came last as a variation of Thin Man.       Neddermeyer discarded Serber and Tolmans initial concept of implosion as assembling a series of pieces in favor of one in which a hollow sphere was imploded by an explosive shell. He was assisted in this work by ": null
    },
    {
        "Hugh Bradner": "Hugh Bradner"
    },
    {
        ", ": null
    },
    {
        "Charles Critchfield": "Charles Critchfield"
    },
    {
        ", and John Streib. ": null
    },
    {
        "L. T. E. Thompson": "L.T.E. Thompson"
    },
    {
        " was brought in as a consultant, and discussed the problem with Neddermeyer in June 1943. Thompson was skeptical that an implosion could be made sufficiently symmetric. Oppenheimer arranged for Neddermeyer and ": null
    },
    {
        "Edwin McMillan": "Edwin Mcmillan"
    },
    {
        " to visit the ": null
    },
    {
        "National Defense Research Committees": "National Defense Research Committee"
    },
    {
        " Explosives Research Laboratory near the ": null
    },
    {
        "laboratories": "Experimental Mine, U.S. Bureau Of Mines"
    },
    {
        " of the ": null
    },
    {
        "Bureau of Mines": "United States Bureau Of Mines"
    },
    {
        " in ": null
    },
    {
        "Bruceton, Pennsylvania": "Bruceton, Pennsylvania"
    },
    {
        " , where they spoke to ": null
    },
    {
        "George Kistiakowsky": "George Kistiakowsky"
    },
    {
        " and his team. But Neddermeyers efforts in July and August at imploding tubes to produce cylinders tended to produce objects that resembled rocks. Neddermeyer was the only person who believed that implosion was practical, and only his enthusiasm kept the project alive.        Oppenheimer brought ": null
    },
    {
        "John von Neumann": "John Von Neumann"
    },
    {
        " to Los Alamos in September 1943 to take a fresh look at implosion. After reviewing Neddermeyers studies, and discussing the matter with ": null
    },
    {
        "Edward Teller": "Edward Teller"
    },
    {
        ", von Neumann suggested the use of high explosives in ": null
    },
    {
        "shaped charges": "Shaped Charge"
    },
    {
        " to implode a sphere, which he showed could not only result in a faster assembly of ": null
    },
    {
        "fissile": "Fissile"
    },
    {
        " material than was possible with the gun method, but which could greatly reduce the amount of material required, because of the resulting higher density. The idea that, under such pressures, the plutonium metal itself would be compressed came from Teller, whose knowledge of how dense metals behaved under heavy pressure was influenced by his pre-war theoretical studies of the ": null
    },
    {
        "Earths core": "Earths Core"
    },
    {
        " with ": null
    },
    {
        "George Gamow": "George Gamow"
    },
    {
        ". The prospect of more-efficient nuclear weapons impressed Oppenheimer, Teller, and ": null
    },
    {
        "Hans Bethe": "Hans Bethe"
    },
    {
        ", but they decided that an expert on explosives would be required. Kistiakowskys name was immediately suggested, and Kistiakowsky was brought into the project as a consultant in October 1943.     The implosion project remained a backup until April 1944, when experiments by ": null
    },
    {
        "Emilio G. Segrè": "Emilio G. Segrè"
    },
    {
        " and his P-5 Group at Los Alamos on the newly reactor-produced ": null
    },
    {
        "plutonium": "Plutonium"
    },
    {
        " from the ": null
    },
    {
        "X-10 Graphite Reactor": "X-10 Graphite Reactor"
    },
    {
        " at ": null
    },
    {
        "Oak Ridge": "Clinton Engineer Works"
    },
    {
        " and the ": null
    },
    {
        "B Reactor": "B Reactor"
    },
    {
        " at the ": null
    },
    {
        "Hanford site": "Hanford Site"
    },
    {
        " showed that it contained impurities in the form of the ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        " plutonium-240": "Plutonium-240"
    },
    {
        ". This has a far higher spontaneous fission rate and radioactivity than ": null
    },
    {
        "plutonium-239": "Plutonium-239"
    },
    {
        ". The ": null
    },
    {
        "cyclotron": "Cyclotron"
    },
    {
        "-produced isotopes, on which the original measurements had been made, held much lower traces of plutonium-240. Its inclusion in reactor-bred plutonium appeared unavoidable. This meant that the spontaneous fission rate of the reactor plutonium was so high that it would be highly likely that it would ": null
    },
    {
        "predetonate": "Predetonation"
    },
    {
        " and blow itself apart during the initial formation of a critical mass. The distance required to accelerate the plutonium to speeds where predetonation would be less likely would need a gun barrel too long for any existing or planned bomber. The only way to use plutonium in a workable bomb was therefore implosion.          The impracticability of a gun-type bomb using plutonium was agreed at a meeting in Los Alamos on 17 July 1944. All gun-type work in the ": null
    },
    {
        "Manhattan Project": "Manhattan Project"
    },
    {
        " was directed at the Little Boy, enriched-uranium gun design, and the Los Alamos Laboratory was reorganized, with almost all of the research focused on the problems of implosion for the Fat Man bomb. The idea of using shaped charges as three-dimensional ": null
    },
    {
        "explosive lens": "Explosive Lens"
    },
    {
        "es came from ": null
    },
    {
        "James L. Tuck": "James L. Tuck"
    },
    {
        ", and was developed by von Neumann. To overcome the difficulty of synchronizing multiple detonations, ": null
    },
    {
        "Luis Alvarez": "Luis Walter Alvarez"
    },
    {
        " and ": null
    },
    {
        "Lawrence Johnston": "Lawrence H. Johnston"
    },
    {
        " invented ": null
    },
    {
        "exploding-bridgewire detonators": "Exploding-Bridgewire Detonator"
    },
    {
        " to replace the less precise ": null
    },
    {
        "primacord": "Primacord"
    },
    {
        " detonation system. ": null
    },
    {
        "Robert Christy": "Robert Christy"
    },
    {
        " is credited with doing the calculations that showed how a solid subcritical sphere of plutonium could be compressed to a critical state, greatly simplifying the task, since earlier efforts had attempted the more-difficult compression of a hollow spherical shell. After Christys report, the solid-plutonium core weapon was referred to as the ": null
    },
    {
        "Christy Gadget": "Pit Christy Pits"
    },
    {
        " .     The task of the ": null
    },
    {
        "metallurgists": "Metallurgist"
    },
    {
        " was to determine how to cast plutonium into a sphere. The difficulties became apparent when attempts to measure the density of plutonium gave inconsistent results. At first contamination was believed to be the cause, but it was soon determined that there were multiple ": null
    },
    {
        "allotropes of plutonium": "Allotropes Of Plutonium"
    },
    {
        ". The brittle α phase that exists at room temperature changes to the plastic β phase at higher temperatures. Attention then shifted to the even more malleable δ phase that normally exists in the  range. It was found that this was stable at room temperature when alloyed with aluminum, but aluminum emits neutrons when bombarded with ": null
    },
    {
        "alpha particles": "Alpha Particles"
    },
    {
        ", which would exacerbate the pre-ignition problem. The metallurgists then hit upon a ": null
    },
    {
        "plutonium–gallium alloy": "Plutonium–Gallium Alloy"
    },
    {
        ", which stabilized the δ phase and could be ": null
    },
    {
        "hot pressed": "Hot Pressing"
    },
    {
        " into the desired spherical shape. As plutonium was found to corrode readily, the sphere was coated with nickel.        The size of the bomb was constrained by the available aircraft. The only Allied aircraft considered capable of carrying the Fat Man without major modification were the British ": null
    },
    {
        "Avro Lancaster": "Avro Lancaster"
    },
    {
        " and the American ": null
    },
    {
        "Boeing B-29 Superfortress": "Boeing B-29 Superfortress"
    },
    {
        ". At the time, the B-29 represented the epitome of bomber technology with significant advantages in ": null
    },
    {
        "MTOW": "Mtow"
    },
    {
        ", range, speed, flight ceiling, and survivability. Without the availability of the B-29, dropping the bomb would likely have been impossible. However, this still constrained the bomb to a maximum length of , width of  and weight of . Removing the bomb rails allowed a maximum width of .     Drop tests began in March 1944, and resulted in modifications to the ": null
    },
    {
        "Silverplate": "Silverplate"
    },
    {
        " aircraft due to the weight of the bomb. High-speed photographs revealed that the tail fins folded under the pressure, resulting in an erratic descent. Various combinations of stabilizer boxes and fins were tested on the Fat Man shape to eliminate its persistent wobble until an arrangement dubbed a California Parachute , a cubical open-rear tail box outer surface with eight radial fins inside of it, four angled at 45° and four perpendicular to the line of fall holding the outer square-fin box to the bombs rear end, was approved. In drop tests in early weeks, the Fat Man missed its target by an average of , but this was halved by June as the bombardiers became more proficient with it.     The early Y-1222 model Fat Man was assembled with some 1,500 bolts. This was superseded by the Y-1291 design in December 1944. This redesign work was substantial, and only the Y-1222 tail design was retained. Later versions included the Y-1560, which had 72 detonators; the Y-1561, which had 32; and the Y-1562, which had 132. There were also the Y-1563 and Y-1564, which were practice bombs with no detonators at all. The final wartime Y-1561 design was assembled with just 90 bolts.   On 16 July 1945, a Y-1561 model Fat Man, known as the Gadget, was detonated in a ": null
    },
    {
        "test explosion": "Nuclear Weapons Testing"
    },
    {
        " at a remote site in ": null
    },
    {
        "New Mexico": "New Mexico"
    },
    {
        ", known as the ": null
    },
    {
        "Trinity": "Trinity Test"
    },
    {
        " test. It gave a yield of about . Some minor changes were made to the design as a result of the Trinity test. ": null
    },
    {
        "Philip Morrison": "Philip Morrison"
    },
    {
        " recalled that There were some changes of importance... The fundamental thing was, of course, very much the same.           The bomb was  long and  in diameter. It weighed .                               The ": null
    },
    {
        "plutonium pit": "Plutonium Pit"
    },
    {
        " was  in diameter and contained an Urchin ": null
    },
    {
        "modulated neutron initiator": "Modulated Neutron Initiator"
    },
    {
        " that was  in diameter. The ": null
    },
    {
        "depleted uranium": "Depleted Uranium"
    },
    {
        " tamper": "Neutron Reflector"
    },
    {
        " was a  diameter sphere, surrounded by a  thick shell of boron-impregnated plastic. The plastic shell had a  diameter cylindrical hole running through it, like the hole in a cored apple, in order to allow insertion of the pit as late as possible. The missing tamper cylinder containing the pit could be slipped in through a hole in the surrounding  diameter aluminum pusher. The pit was warm to touch, emitting 2.4 W/kg-Pu, about 15 W for the  core.     The explosion symmetrically compressed the plutonium to twice its normal density before the Urchin added ": null
    },
    {
        "free neutrons": "Free Neutron"
    },
    {
        " to initiate a ": null
    },
    {
        "fission": "Nuclear Fission"
    },
    {
        " chain reaction": "Nuclear Chain Reaction"
    },
    {
        ".               The result was the fission of about  of the  of plutonium in the pit, i.e. of about 16% of the ": null
    },
    {
        "fissile material": "Fissile Material"
    },
    {
        " present.  of ": null
    },
    {
        "matter": "Matter"
    },
    {
        " in the bomb  is ": null
    },
    {
        "converted into the active energy": "Mass–Energy Equivalence"
    },
    {
        " of heat and radiation, releasing the energy equivalent to the detonation of .             The first ": null
    },
    {
        "plutonium core": "Plutonium Core"
    },
    {
        " was transported with its polonium-beryllium ": null
    },
    {
        "modulated neutron initiator": "Modulated Neutron Initiator"
    },
    {
        " in the custody of ": null
    },
    {
        "Project Alberta": "Project Alberta"
    },
    {
        " courier ": null
    },
    {
        "Raemer Schreiber": "Raemer Schreiber"
    },
    {
        " in a magnesium field carrying case designed for the purpose by Philip Morrison. Magnesium was chosen because it does not act as a tamper. It left ": null
    },
    {
        "Kirtland Army Air Field": "Kirtland Air Force Base"
    },
    {
        " on a ": null
    },
    {
        "C-54": "C-54"
    },
    {
        " transport aircraft of the ": null
    },
    {
        "509th Composite Groups": "509Th Composite Group"
    },
    {
        " 320th Troop Carrier Squadron on 26 July and arrived at ": null
    },
    {
        "North Field": "North Field"
    },
    {
        " on ": null
    },
    {
        "Tinian": "Tinian"
    },
    {
        " on 28 July. Three Fat Man high-explosive pre-assemblies were picked up at Kirtland on 28 July by three B-29s:  Luke the Spook  and  Laggin Dragon  from the 509th Composite Groups ": null
    },
    {
        "393d Bombardment Squadron": "393D Bombardment Squadron"
    },
    {
        ", and another from the 216th AAF Base Unit. The cores were transported to North Field, arriving on 2 August, when F31 was partly disassembled in order to check all its components. F33 was expended near Tinian during a final rehearsal on 8 August, and F31 was the bomb dropped on ": null
    },
    {
        "Nagasaki": "Nagasaki"
    },
    {
        ". F32 presumably would have been used for a third attack or its rehearsal.     In August 1945, the Fat Man was assembled on Tinian by Project Alberta personnel, and the physics package was fully assembled and wired. It was placed inside its ellipsoidal aerodynamic bombshell and wheeled out, where it was signed by nearly 60 people, including Rear Admiral ": null
    },
    {
        "William R. Purnell": "William R. Purnell"
    },
    {
        ", Brigadier General ": null
    },
    {
        "Thomas F. Farrell": "Thomas F. Farrell"
    },
    {
        ", and Captain ": null
    },
    {
        "William S. Parsons": "William S. Parsons"
    },
    {
        ". It was then wheeled to the bomb bay of the ": null
    },
    {
        "B-29 Superfortress": "B-29 Superfortress"
    },
    {
        " named  Bockscar   after the planes command pilot Captain ": null
    },
    {
        "Frederick C. Bock": "Frederick C. Bock"
    },
    {
        ",  who flew  The Great Artiste  with his crew on the mission. Bockscar was flown by Major ": null
    },
    {
        "Charles W. Sweeney": "Charles W. Sweeney"
    },
    {
        " and his crew, with Commander ": null
    },
    {
        "Frederick L. Ashworth": "Frederick L. Ashworth"
    },
    {
        " from Project Alberta as the weaponeer in charge of the bomb.     Bockscar lifted off at 03:47 on the morning of 9 August 1945, with Kokura as the primary target and Nagasaki the secondary target. The weapon was already armed, but with the green electrical safety plugs still engaged. Ashworth changed them to red after ten minutes so that Sweeney could climb to  in order to get above storm clouds. During pre-flight inspection of Bockscar, the flight engineer notified Sweeney that an inoperative fuel transfer pump made it impossible to use  of fuel carried in a reserve tank. This fuel would still have to be carried all the way to Japan and back, consuming still more fuel. Replacing the pump would take hours; moving the Fat Man to another aircraft might take just as long and was dangerous as well, as the bomb was live. Colonel ": null
    },
    {
        "Paul Tibbets": "Paul Tibbets"
    },
    {
        " and Sweeney therefore elected to have Bockscar continue the mission.          The original target for the bomb was the city of ": null
    },
    {
        "Kokura": "Kokura"
    },
    {
        ", but it was found to be obscured by clouds and drifting smoke from fires started by a major firebombing raid by 224 B-29s on nearby ": null
    },
    {
        "Yahata": "Yahata, Fukuoka"
    },
    {
        " the previous day. This covered 70% of the area over Kokura, obscuring the aiming point. Three bomb runs were made over the next 50 minutes, burning fuel and repeatedly exposing the aircraft to the heavy defenses of Yahata, but the bombardier was unable to drop visually. By the time of the third bomb run, Japanese anti-aircraft fire was getting close; Second Lieutenant ": null
    },
    {
        "Jacob Beser": "Jacob Beser"
    },
    {
        " was monitoring Japanese communications, and he reported activity on the Japanese fighter direction radio bands.     Sweeney then proceeded to the alternative target of Nagasaki. It was obscured by cloud, as well, and Ashworth ordered Sweeney to make a radar approach. At the last minute, however, bombardier Captain ": null
    },
    {
        "Kermit K. Beahan": "Kermit K. Beahan"
    },
    {
        " found a hole in the clouds. The Fat Man was dropped and exploded at 11:02 local time, following a 43-second free-fall, at an altitude of about . There was poor visibility due to cloud cover and the bomb missed its intended detonation point by almost two miles, so damage was somewhat less extensive than that in ": null
    },
    {
        "Hiroshima": "Hiroshima"
    },
    {
        ".     An estimated 35,000–40,000 people were killed outright by the bombing at Nagasaki. A total of 60,000–80,000 fatalities resulted, including from long-term health effects, the strongest of which was leukemia with an attributable risk of 46% for bomb victims.  , updated 7/3/2014 Others died later from related blast and burn injuries, and hundreds more from radiation illnesses from exposure to the bombs initial radiation. Most of the direct deaths and injuries were among munitions or industrial workers.      Mitsubishis industrial production in the city was also severed by the attack; the dockyard would have produced at 80 percent of its full capacity within three to four months, the steel works would have required a year to get back to substantial production, the electric works would have resumed some production within two months and been back at capacity within six months, and the arms plant would have required 15 months to return to 60 to 70 percent of former capacity. The Mitsubishi-Urakami Ordnance Works was the factory that manufactured the ": null
    },
    {
        "type 91 torpedo": "Type 91 Torpedo"
    },
    {
        "es released in the ": null
    },
    {
        "attack on Pearl Harbor": "Attack On Pearl Harbor"
    },
    {
        "; it was destroyed in the blast.           After the war, two Y-1561 Fat Man bombs were used in the Operation Crossroads nuclear tests at Bikini Atoll in the Pacific. The first was known as Gilda after ": null
    },
    {
        "Rita Hayworths": "Rita Hayworth"
    },
    {
        " character in the 1946 movie ": null
    },
    {
        "Gilda": "Gilda"
    },
    {
        ", and it was dropped by the B-29  Daves Dream ; it missed its aim point by . The second bomb was nicknamed Helen of Bikini and was placed without its tail fin assembly in a steel caisson made from a submarines conning tower; it was detonated  beneath the landing craft  USS LSM-60 . The two weapons yielded about  each.     The Los Alamos Laboratory and the Army Air Forces had already commenced work on improving the design. The ": null
    },
    {
        "North American B-45 Tornado": "North American B-45 Tornado"
    },
    {
        ", ": null
    },
    {
        "Convair XB-46": "Convair Xb-46"
    },
    {
        ", ": null
    },
    {
        "Martin XB-48": "Martin Xb-48"
    },
    {
        ", and ": null
    },
    {
        "Boeing B-47 Stratojet": "Boeing B-47 Stratojet"
    },
    {
        " bombers had bomb bays sized to carry the ": null
    },
    {
        "Grand Slam": "Grand Slam"
    },
    {
        ", which was much longer but not as wide as the Fat Man. The only American bombers that could carry the Fat Man were the B-29 and the ": null
    },
    {
        "Convair B-36": "Convair B-36"
    },
    {
        ". In November 1945, the Army Air Forces asked Los Alamos for 200 Fat Man bombs, but there were only two sets of plutonium cores and high-explosive assemblies at the time. The Army Air Forces wanted improvements to the design to make it easier to manufacture, assemble, handle, transport, and stockpile. The wartime ": null
    },
    {
        "Project W-47": "Project W-47"
    },
    {
        " was continued, and drop tests resumed in January 1946.     The Mark III Mod 0 Fat Man was ordered into production in mid-1946. High explosives were manufactured by the ": null
    },
    {
        "Salt Wells Pilot Plant": "Salt Wells Pilot Plant"
    },
    {
        ", which had been established by the Manhattan Project as part of ": null
    },
    {
        "Project Camel": "Project Camel"
    },
    {
        ", and a new plant was established at the ": null
    },
    {
        "Iowa Army Ammunition Plant": "Iowa Army Ammunition Plant"
    },
    {
        ". Mechanical components were made or procured by the ": null
    },
    {
        "Rock Island Arsenal": "Rock Island Arsenal"
    },
    {
        "; electrical and mechanical components for about 50 bombs were stockpiled at Kirtland Army Air Field by August 1946, but only nine plutonium cores were available. Production of the Mod 0 ended in December 1948, by which time there were still only 53 cores available. It was replaced by improved versions known as Mods 1 and 2 which contained a number of minor changes, the most important of which was that they did not charge the X-Unit firing systems capacitors until released from the aircraft. The Mod 0s were withdrawn from service between March and July 1949, and by October they had all been rebuilt as Mods 1 and 2. Some 120 Mark III Fat Man units were added to the stockpile between 1947 and 1949 when it was superseded by the ": null
    },
    {
        "Mark 4 nuclear bomb": "Mark 4 Nuclear Bomb"
    },
    {
        ". The Mark III Fat Man was retired in 1950.     A nuclear strike would have been a formidable undertaking in the post-war 1940s due to the limitations of the Mark III Fat Man. The lead-acid batteries which powered the fuzing system remained charged for only 36 hours, after which they needed to be recharged. To do this meant disassembling the bomb, and recharging took 72 hours. The batteries had to be removed in any case after nine days or they corroded. The plutonium core could not be left in for much longer, because its heat damaged the high explosives. Replacing the core also required the bomb to be completely disassembled and reassembled. This required about 40 to 50 men and took between 56 and 72 hours, depending on the skill of the bomb assembly team, and the ": null
    },
    {
        "Armed Forces Special Weapons Project": "Armed Forces Special Weapons Project"
    },
    {
        " had only three teams in June 1948. The only aircraft capable of carrying the bomb were Silverplate B-29s, and the only group equipped with them was the 509th Bombardment Group at ": null
    },
    {
        "Walker Air Force Base": "Walker Air Force Base"
    },
    {
        " in ": null
    },
    {
        "Roswell, New Mexico": "Roswell, New Mexico"
    },
    {
        ". They would first have to fly to ": null
    },
    {
        "Sandia Base": "Sandia Base"
    },
    {
        " to collect the bombs, and then to an overseas base from which a strike could be mounted.     The Soviet Unions first nuclear weapon was based closely on Fat Mans design thanks to spies ": null
    },
    {
        "Klaus Fuchs": "Klaus Fuchs"
    },
    {
        ", ": null
    },
    {
        "Theodore Hall": "Theodore Hall"
    },
    {
        ", and ": null
    },
    {
        "David Greenglass": "David Greenglass"
    },
    {
        ", who provided them with secret information concerning the Manhattan Project and Fat Man. It was detonated on 29 August 1949 as part of ": null
    },
    {
        "Operation First Lightning ": "Rds-1"
    },
    {
        ".          ": null
    }
]