[
    {
        "           Father Ted is a British-made ": null
    },
    {
        "sitcom": "Sitcom"
    },
    {
        " that was produced by ": null
    },
    {
        "Hat Trick Productions": "Hat Trick Productions"
    },
    {
        " for ": null
    },
    {
        "Channel 4": "Channel 4"
    },
    {
        ". Written by ": null
    },
    {
        "Irish": "Irish People"
    },
    {
        " writers ": null
    },
    {
        "Arthur Mathews": "Arthur Mathews"
    },
    {
        " and ": null
    },
    {
        "Graham Linehan": "Graham Linehan"
    },
    {
        ", and starring a predominantly Irish cast, it originally aired over three series from 21 April 1995 until 1 May 1998, including a Christmas special, for a total of ": null
    },
    {
        "25 episodes": "List Of Father Ted Episodes"
    },
    {
        ". The show aired on ": null
    },
    {
        "RTÉ Two": "Rté Two"
    },
    {
        " in Ireland, and in Australia on ": null
    },
    {
        "Nine Network": "Nine Network"
    },
    {
        " and ": null
    },
    {
        "ABC Television": "Abc Television"
    },
    {
        " .     Set on the fictional ": null
    },
    {
        "Craggy Island": "Craggy Island"
    },
    {
        ", a remote location off Irelands west coast, the show starred ": null
    },
    {
        "Dermot Morgan": "Dermot Morgan"
    },
    {
        " as the eponymous ": null
    },
    {
        "Father Ted Crilly": "Father Ted Crilly"
    },
    {
        ", alongside fellow priests ": null
    },
    {
        "Father Dougal McGuire": "Father Dougal Mcguire"
    },
    {
        "  and ": null
    },
    {
        "Father Jack Hackett": "Father Jack Hackett"
    },
    {
        " . Exiled on the island for various past incidents, the priests live together in the ": null
    },
    {
        "parochial house": "Parochial House"
    },
    {
        " with their housekeeper ": null
    },
    {
        "Mrs Doyle": "Mrs Doyle"
    },
    {
        " . The show was critically acclaimed, receiving several ": null
    },
    {
        "BAFTA": "Bafta"
    },
    {
        " awards, and remains a popular sitcom in the UK and Ireland. In a 2001 poll by ": null
    },
    {
        "Channel 4": "Channel 4"
    },
    {
        ", Dougal was ranked fifth on their list of the ": null
    },
    {
        "100 Greatest TV Characters": "100 Greatest"
    },
    {
        ".  In 2019, Father Ted was ranked second to  Fawlty Towers  in a list of the greatest British sitcoms compiled by a panel of comedy experts for the  Radio Times . . ITV. Retrieved 24 May 2019          The show follows the misadventures of three Irish ": null
    },
    {
        "Roman Catholic": "Roman Catholic"
    },
    {
        " priests who live in a parish on the fictional ": null
    },
    {
        "Craggy Island": "Craggy Island"
    },
    {
        ", located off the west coast of ": null
    },
    {
        "Ireland": "Ireland"
    },
    {
        ". ": null
    },
    {
        "Father Ted Crilly": "Father Ted Crilly"
    },
    {
        ", ": null
    },
    {
        "Father Dougal McGuire": "Father Dougal Mcguire"
    },
    {
        " and ": null
    },
    {
        "Father Jack Hackett": "Father Jack Hackett"
    },
    {
        " live chaotically together in Craggy Islands parochial house, along with their housekeeper ": null
    },
    {
        "Mrs Doyle": "Mrs Doyle"
    },
    {
        ", who always wants to serve them tea.     The three priests answer to Bishop ": null
    },
    {
        "Len Brennan": "List Of Father Ted Charactersbishop Brennan"
    },
    {
        ", who has banished them to Craggy Island as punishment for different incidents in their past: Ted for alleged financial impropriety , Dougal for something only referred to as the Blackrock Incident , and Jack for his ": null
    },
    {
        "alcoholism": "Alcoholism"
    },
    {
        " and ": null
    },
    {
        "womanising": "Lothario"
    },
    {
        ", particularly for an incident at a wedding in ": null
    },
    {
        "Athlone": "Athlone"
    },
    {
        ".     The show revolves around the priests lives on Craggy Island, sometimes dealing with matters of the church but more often dealing with Father Teds schemes to either resolve a situation with the parish or other Craggy Island residents, or to win games of one-upmanship against his enemy, Father Dick Byrne of the nearby Rugged Island parish.          Father Ted ran for three series from 1995 to 1998, including a Christmas special. A total of 25 episodes were produced.                   Linehan and Mathews first met while working at  Hot Press .  In the late 1980s, Mathews, ": null
    },
    {
        "Paul Woodfull": "Paul Woodfull"
    },
    {
        " and Kieran Woodfull formed The Joshua Trio, a ": null
    },
    {
        "U2": "U2"
    },
    {
        " tribute band. The trio began writing comedy sketches to accompany their act. Mathews created the Father Ted character for his short-lived stand-up routine. Before The Joshua Trio played at gigs, Mathews would occasionally come on-stage as Father Ted and tell jokes involving his great friend, Father Dougal McGuire.      In 1991, Mathews left his job at Hot Press and moved into Linehans London home. Over the next three to four years, they worked on rough ideas for shows while at the same time writing for sketch shows such as  The All New Alexei Sayle Show  and  The Fast Show . One of these ideas was for a comedy mockumentary series called Irish Lives, with six episodes, each focusing on a different character living somewhere in Ireland. They scripted an episode centring on a priest named Father Ted Crilly, who visits his friends in the seminary in ": null
    },
    {
        "Maynooth College": "St Patricks College, Maynooth"
    },
    {
        ". Producer ": null
    },
    {
        "Geoffrey Perkins": "Geoffrey Perkins"
    },
    {
        " suggested that the episodes concept be dramatised and rewritten as a sitcom.       In the January 1994 issue of In Dublin , Mathews and Linehan told Damian Corless, who had initially introduced the pair to each other, of their work in progress, describing Ted as basically a nice man , Dougal as nice but really stupid and Jack as a hideous creature . Linehan revealed: Theyve all been sent to this isolated place called Craggy Island because theyre crap priests. Mathews elaborated: Theyve each a terrible secret which is why theyve been banished to this place, and the terrible thing is that they cant get away from each other. Obviously its not entirely reality based. Mathews was originally intended to play Ted, but decided he lacked the acting ability the role required. ": null
    },
    {
        "Maurice ODonoghue": "Maurice Odonoghue"
    },
    {
        ", who plays Father Dick in the series, was their second choice for the role of Ted, being the right age and having a similar look and lightness. Mathews always preferred ": null
    },
    {
        "Dermot Morgan": "Dermot Morgan"
    },
    {
        "; Linehan was initially reluctant, fearing he would play Ted the same as Father Trendy , a character he played on the ": null
    },
    {
        "RTÉ": "Raidió Teilifís Éireann"
    },
    {
        " television show  The Live Mike , but Morgan lobbied hard for the role and was cast.     The show was pitched directly to the UKs ": null
    },
    {
        "Hat Trick Productions": "Hat Trick Productions"
    },
    {
        " and Channel 4 by the duo, contrary to rumours that ": null
    },
    {
        "RTÉ": "Raidió Teilifís Éireann"
    },
    {
        " were originally offered the series but rejected it.         Three series and one Christmas special were aired. Declan Lowney directed the first two series and the Christmas special, while the third series was directed by Linehan and ": null
    },
    {
        "Andy De Emmony": "Andy De Emmony"
    },
    {
        " . In addition, Morgan and OHanlon hosted an hour of ": null
    },
    {
        "Comic Relief": "Comic Relief"
    },
    {
        " in character, during which Kelly and McLynn also made brief guest appearances. One day after the shooting of series three wrapped, Dermot Morgan died of a ": null
    },
    {
        "heart attack": "Myocardial Infarction"
    },
    {
        ", aged 45. As a mark of respect, the third series was first broadcast a week later than originally planned.     The show was already scheduled to conclude with the third season prior to Morgans death, as Morgan said that he did not want to continue playing the role of Father Ted for fear of being ": null
    },
    {
        "typecast": "Typecasting"
    },
    {
        "Clive Dunn": "Clive Dunn"
    },
    {
        " and end up playing the same character for years.      Following Morgans death, the production company received calls from numerous agents and casting directors suggesting either new actors for the role of Ted or spin-offs without the character; Linehan and Mathews declined all offers.        In 1994, the writers asked alternative rock band ": null
    },
    {
        "Pulp": "Pulp"
    },
    {
        " to compose the theme music for Father Ted, requesting a parody of a typical sitcom theme. When Pulp declined involvement, they contacted ": null
    },
    {
        "Neil Hannon": "Neil Hannon"
    },
    {
        ", frontman of Northern Irish ": null
    },
    {
        "chamber pop": "Chamber Pop"
    },
    {
        " band ": null
    },
    {
        "The Divine Comedy": "The Divine Comedy"
    },
    {
        ". Hannons first effort, a jaunty composition, was rejected on Geoffrey Perkinss advice. Hannon composed a second theme, which the team found acceptable. This theme was recorded by Hannon and co-producer ": null
    },
    {
        "Darren Allison": "Darren Allison"
    },
    {
        " at ": null
    },
    {
        "The Jesus and Mary Chains": "The Jesus And Mary Chain"
    },
    {
        " private studio. One of ": null
    },
    {
        "William Reids": "William Reid"
    },
    {
        " guitars was selected by Allison and Hannon to carry the main tune, which was played by Hannon. Both themes were also reworked, with new lyrics, for inclusion on The Divine Comedys 1996 album  Casanova Father Ted theme became Songs of Love , while Hannons rejected theme became A Woman of the World .  As stated by Neil Hannon in the documentary Half Minute Melodies, ": null
    },
    {
        "BBC Radio 4": "Bbc Radio 4"
    },
    {
        ", 3 February 2000. Hannon offered a choice of tunes to the producers; his personal preference was for Woman of the World .     In 2010, Linehan discussed the dramatic effect this choice had on the tone of the series: Woman of the World was kind of like a jaunty, plinky-plonky song, and we wanted that song. He gave us two choices: he gave us that, and Songs of Love, and we wanted the plinky-plonky song because our idea was we were making fun of sitcoms. We were saying, you know, we dont like sitcoms. This is a parody of sitcoms. This is a kind of satire on sitcoms. And I remember Geoffrey looking really glum and sad about this, you know? And then he said, Why do you want to make fun of your characters? He said, People will love these characters. And that was just a real revelation for me, and after that, whatever he said went, as far as I was concerned.      The Divine Comedy also contributed most of the shows original music, including the songs Big Men in Frocks , ": null
    },
    {
        "My Lovely Horse": "My Lovely Horse"
    },
    {
        " and The Miracle is Mine , and My Lovely Mayo Mammy .  Neil Hannon also provided Ted and Dougals vocals in the dream sequence version of My Lovely Horse , which was produced by Allison and Hannon, and later appeared as a ": null
    },
    {
        "B-side": "A-Side And B-Side"
    },
    {
        " on the bands single ": null
    },
    {
        "Gin Soaked Boy": "Gin Soaked Boy"
    },
    {
        " .          Location work for Father Ted was done mostly in ": null
    },
    {
        "County Clare": "County Clare"
    },
    {
        ", including locations at ": null
    },
    {
        "Corofin": "Corofin, County Clare"
    },
    {
        ", ": null
    },
    {
        "Ennis": "Ennis"
    },
    {
        ", ": null
    },
    {
        "Kilfenora": "Kilfenora"
    },
    {
        ", ": null
    },
    {
        "Ennistymon": "Ennistymon"
    },
    {
        ", and ": null
    },
    {
        "Kilnaboy": "Kilnaboy"
    },
    {
        ". The Parochial House is McCormacks at Glenquin, on the Boston road from Kilnaboy. McCormacks at Glenquin used for external shots of the parochial house in the Father Ted TV series   The cinema featured in ": null
    },
    {
        "The Passion of St Tibulus": "The Passion Of St Tibulus"
    },
    {
        " was the Ormonde Cinema, ": null
    },
    {
        "Greystones": "Greystones"
    },
    {
        ", ": null
    },
    {
        "County Wicklow": "County Wicklow"
    },
    {
        "  and The Field , the location for Funland in ": null
    },
    {
        "Good Luck, Father Ted": "Good Luck, Father Ted"
    },
    {
        " , is in ": null
    },
    {
        "Portrane": "Portrane"
    },
    {
        ", North ": null
    },
    {
        "County Dublin": "County Dublin"
    },
    {
        ". The Very Dark Caves featured in ": null
    },
    {
        "The Mainland": "The Mainland"
    },
    {
        " were the ": null
    },
    {
        "Aillwee caves": "Aillwee Caves"
    },
    {
        " in ": null
    },
    {
        "the Burren": "The Burren"
    },
    {
        ", County Clare.     Some exterior shots for the episode ": null
    },
    {
        "And God Created Woman": "And God Created Woman"
    },
    {
        " were filmed in ": null
    },
    {
        "Dún Laoghaire": "Dún Laoghaire"
    },
    {
        ", South County Dublin. The opening sequence  were filmed over ": null
    },
    {
        "Inisheer": "Inisheer"
    },
    {
        " — the smallest of the ": null
    },
    {
        "Aran Islands": "Aran Islands"
    },
    {
        ". The interior scenes were recorded at ": null
    },
    {
        "the London Studios": "The London Studios"
    },
    {
        " in front of a live studio audience.       The series is set in a ": null
    },
    {
        "humorously surreal": "Surreal Humour"
    },
    {
        " world in which Ted is the only fully rounded normal character among caricatures , according to Graham Linehan: exaggerated-over-friendly, over-quiet, over-stupid, over-dull they really only got one thing, theyve got one job.  Spirit of Genovia, c1997     Embarrassment plays a role in many storylines, in a similar fashion to  Fawlty Towers . Linehan says, if Ted is in a situation that is slightly embarrassing we get him out of it by having him lying or cheating, basically digging a massive hole for himself . Arthur Mathews has described  Seinfeld  as a major influence on the comedy of Father Ted, with himself and Linehan being big fans of the show. , ": null
    },
    {
        "Irish Times": "Irish Times"
    },
    {
        ", 31 December 2010 Father Ted also contains references to pop culture, and some film ": null
    },
    {
        "parodies": "Parody"
    },
    {
        ", such as the episode ": null
    },
    {
        "Speed 3": "Speed 3"
    },
    {
        " .     Regarding the seriess religious content, Linehan says Ted doesnt have an anti-religious view of life, but a non-religious view. Its a job to him. He doesnt care about religion. While writing, he says the shows creators imagined Ted and Dougal as just two people who happen to be .       Father Ted was met with critical acclaim and is one of the most popular sitcoms in Irish TV history. Bex, T, Burke, M. & Stockwell, P. Contextualized Stylistics: In Honour of Peter Verdonk. ": null
    },
    {
        "Rodopi Publishers": "Rodopi Publishers"
    },
    {
        ".     In 1996 and 1999, the show won the ": null
    },
    {
        "BAFTA": "Bafta"
    },
    {
        " award for Best Comedy, while Morgan also won Best Comedy Performance. ;  In 1995 the show won Best New TV Comedy at the ": null
    },
    {
        "British Comedy Awards": "British Comedy Awards"
    },
    {
        ", with OHanlon receiving Top TV Comedy Newcomer Award. At the 1996 British Comedy Awards the show won Top Channel 4 Sitcom Award, McLynn took the Top TV Comedy Actress award.  In 1997 the show was given the Best Channel 4 Sitcom Award. It was also ranked at number 50 in the ": null
    },
    {
        "BFIs": "British Film Institute"
    },
    {
        " 2000 list of the ": null
    },
    {
        "100 greatest British television programmes": "Bfi Tv 100"
    },
    {
        " of the 20th century, the highest ranking Channel 4 production on the list. In 2004, it came 11th in the poll for ": null
    },
    {
        "Britains Best Sitcom": "Britains Best Sitcom"
    },
    {
        ".     In August 2012, ": null
    },
    {
        "Channel 4": "Channel 4"
    },
    {
        " viewers voted the series as the No 1 in C4s 30 Greatest Comedy Shows.      Notable fans of the show include director ": null
    },
    {
        "Steven Spielberg": "Steven Spielberg"
    },
    {
        ", musicians ": null
    },
    {
        "Liam Gallagher": "Liam Gallagher"
    },
    {
        ", ": null
    },
    {
        "Madonna": "Madonna"
    },
    {
        ", ": null
    },
    {
        "Cher": "Cher"
    },
    {
        " and ": null
    },
    {
        "Moby": "Moby"
    },
    {
        ", actors ": null
    },
    {
        "Jim Carrey": "Jim Carrey"
    },
    {
        " and ": null
    },
    {
        "Steve Martin": "Steve Martin"
    },
    {
        ", comedian ": null
    },
    {
        "Ricky Gervais": "Ricky Gervais"
    },
    {
        ", and wrestler ": null
    },
    {
        "Sheamus": "Sheamus"
    },
    {
        ".     ": null
    },
    {
        "Maurice Gibb": "Maurice Gibb"
    },
    {
        " of the ": null
    },
    {
        "Bee Gees": "Bee Gees"
    },
    {
        " was buried with a copy of the DVD box set.  Singer-songwriter ": null
    },
    {
        "Sinéad OConnor": "Sinéad Oconnor"
    },
    {
        " is a fan, and attended the recording of the ": null
    },
    {
        "Christmas special": "A Christmassy Ted"
    },
    {
        ".  Irish musician ": null
    },
    {
        "Bono": "Bono"
    },
    {
        " also requested to appear in the series.       The Irish media frequently uses the series as a point of comparison in political stories. . RTÉ. 28 June 2010         In January 2007, a dispute arose between ": null
    },
    {
        "Inisheer": "Inisheer"
    },
    {
        " and ": null
    },
    {
        "Inishmore": "Inishmore"
    },
    {
        " over which island can claim to be ": null
    },
    {
        "Craggy Island": "Craggy Island"
    },
    {
        ", and thereby host a three-day ": null
    },
    {
        "Friends of Ted Festival": "Ted Fest"
    },
    {
        ".  The dispute was settled by a five-a-side football match that February.  Inishmore won 2–0  allowing them to use the title of Craggy Island until February 2008, while Inisheer was given the title of Rugged Island. The Friends of Ted Festival, better known as Ted Fest, has been held annually as a Father Ted fan convention since 2007.     On 1 January 2011, Channel 4 dedicated a night of programming to celebrate the shows 15th anniversary year.   This included Father Ted: Unintelligent Design , a documentary on the shows influences, and Small, Far Away: The World of Father Ted , a documentary revisiting the shows history with the writers and many of the surviving cast .         In 2001, Pauline McLynn reprised her role as Mrs Doyle in a run of advertisements for the UKs ": null
    },
    {
        "Inland Revenue": "Inland Revenue"
    },
    {
        ", reminding people to get their taxes in on time with her catchphrase from the programme . It was voted in an Adwatch poll of 1,000 people as the years worst advertisement.      Later in 2001, Ardal OHanlon returned to the role of Father Dougal for a series of ": null
    },
    {
        "PBS": "Pbs"
    },
    {
        " advertisements to coincide with Father Teds American broadcast; these segments were included on later DVD releases as Fundraising with Father Dougal .       In 2012, Frank Kelly made a brief appearance as Father Jack on an episode of  The One Show  with Graham Norton.      In 2014, guest star ": null
    },
    {
        "Ben Keaton": "Ben Keaton"
    },
    {
        " returned to the role of Father Austin Purcell, performing a stand-up routine and hosting the pub quiz Arse Biscuits in-character.   Keaton also set up a Twitter page for the character, and a website where fans can purchase customised Father Purcell video greetings.  In 2015, he launched the spin-off web series Cook Like a Priest.      In February 2016, Over The Top Wrestling marked the anniversary of Morgans death with Ah Ted , an event held in Dublins ": null
    },
    {
        "Tivoli Variety Theatre": "Tivoli Variety Theatre"
    },
    {
        ". During the main-event tag-team match between The Lads From the Flats and The Kings of the North, ": null
    },
    {
        "Patrick McDonnell": "Patrick Mcdonnell"
    },
    {
        ", ": null
    },
    {
        "Joe Rooney": "Joe Rooney"
    },
    {
        " and ": null
    },
    {
        "Michael Redmond": "Michael Redmond"
    },
    {
        " reprised their roles as Eoin McLove, Father Damo Lennon and Father Paul Stone respectively. McLove entered the ring first, withstanding one wrestlers attack on his crotch because he has no willy , but was soon attacked by Father Damo, who brought the whistle he stole from Benson. Father Stone served as a special guest referee, performing a three-count so slow that one wrestler kicked out after two.  In 2017, Rooney appeared as Father Damo in the video for Brave Giants The Time I Met the Devil , which follows him on the way to give Mass after a night of alcohol and sex.        Since the end of the series, several attempts to remake Father Ted have been reported, but none has yet materialised.     In July 2003, it was announced that the show would be remade for the American market. The remake would be scripted by ": null
    },
    {
        "Spike Feresten": "Spike Feresten"
    },
    {
        ", who previously wrote for US sitcoms  Seinfeld  and  The Simpsons . Ferensten stated: I was raised Catholic and this show just felt right to me. The essence of the show is about men who are also priests and, as men, they have many foibles. Hat Trick founders ": null
    },
    {
        "Denise ODonoghue": "Denise Odonoghue"
    },
    {
        " and ": null
    },
    {
        "Jimmy Mulville": "Jimmy Mulville"
    },
    {
        " were set to produce. The US production company was Pariah Productions, which previously adapted  The Kumars at No. 42  for an American audience.      In March 2004, Supanet Limited reported that an American remake was in development. This version would be set on a fictional island off the coast of New York. ": null
    },
    {
        "Steve Martin": "Steve Martin"
    },
    {
        " and ": null
    },
    {
        "Graham Norton": "Graham Norton"
    },
    {
        " would reportedly play Ted and Dougal. Martin had not been expected to take the role because of his stature, but agreed because he was a fan of the original series, and would reportedly be paid £500,000 per episode. Norton was cast based on his popularity with American audiences, and in reference to his appearance as Father Noel Furlong in the original series.      In November 2007, a separate American remake was announced. Rather than Craggy Island, this version would be set in an unfortunate fishing village in ": null
    },
    {
        "New England": "New England"
    },
    {
        ". American actor ": null
    },
    {
        "John Michael Higgins": "John Michael Higgins"
    },
    {
        " was cast as Ted, but expressed concerns about the shows religious themes: The English have a very robust history of being unkind about religion. We dont have that in our country, were frightened of it. Its basically that you guys are doing an Irish joke also, we dont have that. So Ill be Father Ted, well see how it goes. Filming was scheduled to begin in January 2008.      In January 2015, Linehan said that there had been a few attempts by US broadcasters to remake the show, including one which would have been set in ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " – an idea Linehan considered ridiculous .        In an interview with  Radio Times  in January 2015, Linehan revealed that he wanted to revive Father Ted as a musical stage production. He stated that he would never revive the television series itself, because of the risk you poison peoples memories of the original , but that the completely new format would make the project worthwhile. Linehan mentioned the possibility of a dance number with spinning cardinals . He said that the musical would have to reference the ": null
    },
    {
        "Catholic child abuse scandals": "Roman Catholic Church Sexual Abuse Scandal In Ireland"
    },
    {
        ", stating, The jokes would have to have a little bit more edge, because you just cant ignore this stuff. Mathews was not as convinced of the musical idea, though Linehan still insisted it could work.      In December, Mathews said that he and Paul Woodfull were developing a Joshua Trio musical and a show focusing on a ": null
    },
    {
        "Father Michael Cleary": "Michael Cleary"
    },
    {
        "-type character , and that the Father Ted musical may follow. He expressed concerns that it would dilute the product or be seen as a cash-in , but said that he believed there was an audience for the project.      In April 2017, Linehan said that the musical would draw inspiration from  The Book of Mormon , and would go for the jugular ... you get all the things people loved about it, all the innocence and all the sweetness, but introduce a harder edge . Linehan also said that, being a special event, the musical would need to focus on a world-shaking story, possibly with Ted becoming Pope due to some weird succession thing .  In June, Linehan said that he hoped ": null
    },
    {
        "The Divine Comedy": "The Divine Comedy"
    },
    {
        " frontman ": null
    },
    {
        "Neil Hannon": "Neil Hannon"
    },
    {
        ", who wrote the shows music, would return to compose the songs.      In June 2018, Linehan announced that Pope Ted: The Father Ted Musical was nearing completion, with a script by Linehan and Mathews and music by Hannon.  Linehan said, Its the real final episode of Father Ted. This is true and not one of my stupid jokes, I promise. Didnt want to do something until the right idea came along. This was the right idea. Arthur and I have been laughing our arses off while writing it. Just like the old days .                        ": null
    }
]