[
    {
        "      Felix Hausdorff was a ": null
    },
    {
        "German": "German People"
    },
    {
        " mathematician": "Mathematician"
    },
    {
        " who is considered to be one of the founders of modern ": null
    },
    {
        "topology": "Topology"
    },
    {
        " and who contributed significantly to ": null
    },
    {
        "set theory": "Set Theory"
    },
    {
        ", ": null
    },
    {
        "descriptive set theory": "Descriptive Set Theory"
    },
    {
        ", ": null
    },
    {
        "measure theory": "Measure Theory"
    },
    {
        ", ": null
    },
    {
        "function theory": "Complex Analysis"
    },
    {
        ", and ": null
    },
    {
        "functional analysis": "Functional Analysis"
    },
    {
        ".     Life became difficult for Hausdorff and his family after ": null
    },
    {
        "Kristallnacht": "Kristallnacht"
    },
    {
        " in 1938. The next year he initiated efforts to emigrate to the United States, but was unable to make arrangements to receive a research fellowship. On 26 January 1942, Felix Hausdorff, along with his wife and his sister-in-law, committed suicide by taking an overdose of ": null
    },
    {
        "veronal": "Veronal"
    },
    {
        ", rather than comply with German orders to move to the Endenich camp, and there suffer the likely implications, about which he held no illusions.           Hausdorffs father, the ": null
    },
    {
        "Jewish": "Jewish"
    },
    {
        " merchant Louis Hausdorff , moved in the autumn of 1870 with his young family to ": null
    },
    {
        "Leipzig": "Leipzig"
    },
    {
        " and worked over time at various companies, including a linen-and cotton goods factory. He was an educated man and had become a ": null
    },
    {
        "Morenu": "Morenu"
    },
    {
        " at the age of 14. There are several treatises from his pen, including a long work on the Aramaic translations of the Bible from the perspective of ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        "ic law.     Hausdorffs mother, Hedwig , who is also referred to in various documents as Johanna, came from the Jewish Tietz family. From another branch of this family came ": null
    },
    {
        "Hermann Tietz": "Hermann Tietz"
    },
    {
        ", founder of the first department store, and later co-owner of the department store chain called Hermann Tietz . During the period of Nazi dictatorship the name was Aryanised to ": null
    },
    {
        "Hertie": "Hertie"
    },
    {
        ".     From 1878 to 1887 Felix Hausdorff attended the Nicolai School in Leipzig, a facility that had a reputation as a hotbed of humanistic education. He was an excellent student, class leader for many years and often recited self-written Latin or German poems at school celebrations. In his graduation in 1887 , he was the only one who reached the highest grade.     The choice of subject was not easy for Hausdorff. Magda Dierkesmann, who was often a guest in the home of Hausdorff as a student in Bonn in the years 1926–1932, reported in 1967 that:          The decision was made to study the sciences in high school.         From summer term 1887 to summer semester 1891 Hausdorff studied ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " and ": null
    },
    {
        "astronom": "Astronom"
    },
    {
        "y, mainly in his native city of Leipzig, interrupted by one semester in ": null
    },
    {
        "Freiburg": "Freiburg"
    },
    {
        " and Berlin . The surviving testimony of other students show him as extremely versatile interested young man, who, in addition to the mathematical and astronomical lectures, attended lectures in physics, chemistry and geography, and also lectures on philosophy and history of philosophy as well as on issues of language, literature and social sciences. In Leipzig he heard lectures on the history of music from musicologist Paul. His early love of music lasted a lifetime; in Hausdorffs house there were impressive musical evenings with the landlord at the piano, according to witness statements made by various participants. Even as a student in Leipzig, he was an admirer and connoisseur of the music of Richard Wagner.     In later semesters of his studies, Hausdorff was close to ": null
    },
    {
        "Heinrich Bruns": "Heinrich Bruns"
    },
    {
        " .   Bruns was professor of astronomy and director of the observatory at the University of Leipzig. Under him, Hausdorff graduated in 1891 with a work on the theory of astronomical refraction of light in the atmosphere. Two publications on the same subject followed, and in 1895 his habilitation also followed with a thesis on the absorbance of light in the atmosphere. These early astronomical works of Hausdorff have—despite their excellent mathematical working through—not gained importance.   Firstly, the underlying idea of Bruns has not proved viable . On the other hand, the progress in the direct measurement of atmospheric data  has since made the painstaking accuracy of this data from refraction observations unnecessary. In the time between PhD and habilitation Hausdorff completed the yearlong-volunteer military requirement and worked for two years as a ": null
    },
    {
        "human computer": "Human Computer"
    },
    {
        " at the ": null
    },
    {
        "observatory": "Observatory"
    },
    {
        " in Leipzig.       With his habilitation, Hausdorff became a lecturer at the University of Leipzig and began an extensive teaching in a variety of mathematical areas. In addition to teaching and research in mathematics, he went with his literary and philosophical inclinations. A man of varied interests, educated, highly sensitive and sophisticated in thinking, feeling and experiencing, he frequented in his Leipzig period with a number of famous writers, artists and publishers such as ": null
    },
    {
        "Hermann Conradi": "Hermann Conradi"
    },
    {
        ", ": null
    },
    {
        "Richard Dehmel": "Richard Dehmel"
    },
    {
        ", ": null
    },
    {
        "Otto Erich Hartleben": "Otto Erich Hartleben"
    },
    {
        ", ": null
    },
    {
        "Gustav Kirstein": "Gustav Kirstein"
    },
    {
        ", ": null
    },
    {
        "Max Klinger": "Max Klinger"
    },
    {
        ", ": null
    },
    {
        "Max Reger": "Max Reger"
    },
    {
        " and ": null
    },
    {
        "Frank Wedekind": "Frank Wedekind"
    },
    {
        ". The years 1897 to about 1904 mark the high point of his literary and philosophical creativity, during which time 18 of his 22 pseudonymous works were published, including a book of poetry, a play, an epistemological book and a volume of aphorisms.     Hausdorff married Charlotte Goldschmidt in 1899, daughter of Jewish doctor Siegismund Goldschmidt. Her stepmother was the famous suffragist and preschool teacher Henriette Goldschmidt. Hausdorffs only child, daughter Lenore , was born in 1900; she survived the era of National Socialism and enjoyed a long life, dying in Bonn in 1991.       In December 1901 Hausdorff was appointed as adjunct associate professor at the University of Leipzig. The often repeated assertion that Hausdorff got a call from ": null
    },
    {
        "Göttingen": "Göttingen"
    },
    {
        " and rejected it cannot be verified and is probably wrong. When applying in Leipzig, Dean Kirchner had been led to very positive vote of his colleagues, written by Heinrich Bruns, still accompanied by the following words:          This quote emphasizes the undisguised ": null
    },
    {
        "anti-Semitism": "Anti-Semitism"
    },
    {
        " present, which especially took a sharp upturn after the ": null
    },
    {
        "Gründerkrach": "Gründerkrach"
    },
    {
        " in 1873 throughout the German Reich. Leipzig was a center of anti-Semitic movement, especially among the student body. This may well be the reason that Hausdorff did not feel at ease at Leipzig. Another reason was perhaps the stresses due to the hierarchical posturing of the Leipzig professors.     After his habilitation, Hausdorff wrote another work on optics, on non-Euclidean geometry, and on hypercomplex number systems, as well as two papers on probability theory. However, his main area of work soon became set theory, especially the theory of ordered sets. It was initially a philosophical interest, which led him around 1897 to study ": null
    },
    {
        "Georg Cantors": "Georg Cantor"
    },
    {
        "work. Already, in the summer semester of 1901, Hausdorff gave a lecture on set theory. This was one of the first lectures on set theory at all; ": null
    },
    {
        "Ernst Zermelos": "Ernst Zermelo"
    },
    {
        "lectures in Göttingen College during the winter semester of 1900/1901 was a little earlier. That year, he published his first paper on order types in which he examined a generalization of well-orderings called ": null
    },
    {
        "graded order types": "Graded Order Types"
    },
    {
        ", where a ": null
    },
    {
        "linear order": "Linear Order"
    },
    {
        " is graded if no two of its segments share the same ": null
    },
    {
        "order type": "Order Type"
    },
    {
        ". He generalized the ": null
    },
    {
        "Cantor–Bernstein theorem": "Cantor–Bernstein Theorem"
    },
    {
        " which said the collection of countable order types has the cardinality of the continuum and showed that the collection of all graded types of an ": null
    },
    {
        "idempotent": "Idempotence"
    },
    {
        " cardinality  has a cardinality of 2  .      For the summer semester 1910 Hausdorff was appointed as professor to the University of Bonn. In Bonn, he began a lecture on set theory, which he repeated in the summer semester 1912, substantially revised and expanded.     In the summer of 1912 he also began work on his magnum opus, the book Basics of set theory. It was completed in Greifswald, where Hausdorff had been appointed for the summer semester as full professor in 1913, and was released in April 1914.     The ": null
    },
    {
        "University of Greifswald": "University Of Greifswald"
    },
    {
        " was the smallest of the Prussian universities. Also, the mathematical institute was small; in the summer semester 1916 and winter semester 1916/17 Hausdorff was the only mathematician in Greifswald. This brought with it that he was almost fully occupied in teaching the basic courses. It was a substantial improvement of his academic situation when Hausdorff was appointed in 1921 to Bonn. Here he could develop a thematically wide-spanned teaching and always lecture on the latest research. He gave a particularly noteworthy lecture on probability theory in the summer semester 1923, in which he grounded this theory in measure-theoretic axiomatic theory, and this occurred ten years before ": null
    },
    {
        "A. N. Kolmogorovs": "Andrey Kolmogorov"
    },
    {
        " Basic concepts of probability theory . In Bonn, Hausdorff had ": null
    },
    {
        "Eduard Study": "Eduard Study"
    },
    {
        ", and later with ": null
    },
    {
        "Otto Toeplitz": "Otto Toeplitz"
    },
    {
        ", outstanding mathematicians as well as colleagues and friends.       The ": null
    },
    {
        "National Socialist": "National Socialist"
    },
    {
        " partys state doctrine established ": null
    },
    {
        "anti-Semitism": "Anti-Semitism"
    },
    {
        " and the seizure of power. Hausdorff was not initially concerned by the ": null
    },
    {
        "Law for the Restoration of the Professional Civil Service": "Law For The Restoration Of The Professional Civil Service"
    },
    {
        " , adopted in 1933, because he had been a German official since before 1914. However, he was not completely spared, as one of his lectures was interrupted by Nazi students. He stopped his 1934/1935 winter semester Calculus III course from 20 November on. During that time, there was a working session of the National Socialist German Student Union at the University of Bonn, which chose Race and Ethnicity as their theme for the semester. The assumption is that this event is related to the cancellation of Hausdorffs class, because otherwise he never, in his long career as a university teacher, stopped a class.     In March 31, 1935, after some going back and forth, Hausdorff was finally given emeritus status. No words of thanks were given for 40 years of successful work in the German higher education system. He worked tirelessly and published, in addition to the expanded edition of his work on set theory, seven works on topology and descriptive set theory, all published in Polish magazines: one in  Studia Mathematica , the others in  Fundamenta Mathematicae .     His ": null
    },
    {
        "Nachlass": "Nachlass"
    },
    {
        " shows that Hausdorff was still working mathematically at these increasingly difficult times and following current developments of interest. He was selflessly supported at this time by ": null
    },
    {
        "Erich Bessel-Hagen": "Erich Bessel-Hagen"
    },
    {
        ", a loyal friend to the Hausdorff family who obtained books and magazines from the Library of the Institute, which Hausdorff was no longer allowed to enter as a Jew.     About the humiliations to which Hausdorff and his family especially were exposed to after ": null
    },
    {
        "Kristallnacht": "Kristallnacht"
    },
    {
        " in 1938, much is known and from many different sources, such as from the letters of Bessel-Hagen. Neuenschwander, E.: Felix Hausdorffs letzte Lebensjahre nach Dokumenten aus dem Bessel-Hagen-Nachlaß. In: Brieskorn 1996, S.  253–270.     In vain, Hausdorff asked the mathematician ": null
    },
    {
        "Richard Courant": "Richard Courant"
    },
    {
        " in 1939 for a research fellowship to be able to emigrate into the USA.          In mid-1941, the Bonn Jews began to be deported to the Monastery To Perpetual Adoration in ": null
    },
    {
        "Endenich": "Endenich"
    },
    {
        ", from which the nuns had been expelled. The transports to the death camps in the east occurred later. After Felix Hausdorff, his wife and his wifes sister, Edith Pappenheim were ordered in January 1942 to move to the Endenich camp, they committed suicide on 26 January 1942 by taking an overdose of ": null
    },
    {
        "veronal": "Veronal"
    },
    {
        ". Their final resting place is located on the ": null
    },
    {
        "Poppelsdorfer cemetery": "Poppelsdorfer Cemetery"
    },
    {
        " in Bonn. Between their placement in temporary camps and his suicide, he gave his handwritten  Nachlass  to the Egyptologist and presbyter ": null
    },
    {
        "Hans Bonnet": "Hans Bonnet"
    },
    {
        ", who saved as much of them as possible, despite the destruction of his house by a bomb.     Some of his fellow Jews may have had illusions about the camp Endenich, but not Hausdorff. E. Neuenschwander discovered in the estate of Bessel-Hagen the farewell letter that Hausdorff wrote to his Jewish lawyer Hans Wollstein. Nachlass Bessel-Hagen, Universitätsarchiv Bonn. Abgedruckt in Brieskorn 1996, S.  263–264 und im Faksimile S.  265–267  Here is the beginning and end of the letter:               After thanking friends and, in great composure, expressing his last wishes regarding his funeral and his will, Hausdorff writes:          Unfortunately, this desire was not fulfilled. Hausdorffs lawyer Wollstein was murdered in ": null
    },
    {
        "Auschwitz": "Auschwitz"
    },
    {
        ".          Hausdorffs library was sold by his son-in-law and sole heir, Arthur König. The handwritten  Nachlass  was adopted by a family friend, the Bonn Egyptologist Hans Bonnet, for storage. It is now in the University and State Library of Bonn. The Nachlass is catalogued. Siehe Findbuch Nachlass Hausdorff           Hausdorffs volume of aphorisms, published in 1897, was his first work published under the pseudonym Paul Mongré. It is entitled Sant Ilario. Thoughts from the landscape of Zarathustra. The subtitle of Sant Ilario, Thoughts from the landscape of Zarathustra, plays first on the fact that Hausdorff had completed his book during a recovery stay on the Ligurian coast by Genoa and that in this same area, Friedrich Nietzsche wrote the first two parts of Thus Spoke Zarathustra; he also alludes to his spiritual closeness to Nietzsche. In an article on Sant Ilario in the weekly paper ": null
    },
    {
        "Die Zukunft": "Die Zukunft"
    },
    {
        ", Hausdorff acknowledged in ": null
    },
    {
        "expressis verbis": "Wiktionary:Expressis Verbis"
    },
    {
        " his debt to Nietzsche.     Hausdorff was not trying to copy or even exceed Nietzsche. Of Nietzsche imitation no trace , says a contemporary review. He follows Nietzsche in an attempt to liberate individual thinking, to take the liberty of questioning outdated standards. Hausdorff maintained critical distance to the late works of Nietzsche. In his essay on the book ": null
    },
    {
        "The Will to Power": "The Will To Power"
    },
    {
        " compiled from notes left in the Nietzsche Archive he says:          His critical standard he took from Nietzsche himself,          In 1898 appeared—also under the pseudonym Paul Mongré—Hausdorffs epistemological experiment Chaos in cosmic selection. The critique of metaphysics put forward in this book had its starting point in Hausdorffs confrontation with Nietzsches idea of eternal recurrence. It ultimately gets to destroying any kind of metaphysics. Of the world itself, from the transcendent world core—as Hausdorff expressed—we know nothing and we know nothing. We must assume the world itself as undetermined and undeterminable, as a mere chaos. The world of our experience, our cosmos is the result of the selection, the selection that we have always instinctively made according to our possibilities of understanding and make more. From that chaos would also be seen other orders, other Kosmoi, conceivably. At any rate, from the world of our cosmos you can not conclude the existence of a transcendent world.     In 1904, in the magazine The New Rundschau, Hausdorffs play appeared, the one-act play The doctor in his honor. It is a crude satire on the duel and on the traditional concepts of honor and nobility of the Prussian officer corps, which in the developing bourgeois society were increasingly anachronistic. The doctor in his honor was Hausdorffs greatest literary success. In 1914–1918 there were numerous performances in more than thirty cities. Hausdorff later wrote an epilogue to the play, but it was not performed at that time. Only in 2006 did this epilogue have its premier at the annual meeting of the German Mathematical Society in Bonn.     Besides the works above mentioned Hausdorff wrote numerous essays that appeared in some of the leading literary magazines of the time, as well as a book of poems, Ecstasy . Some of his poems were set to music by Austrian composer ": null
    },
    {
        "Joseph Marx": "Joseph Marx"
    },
    {
        ".       Hausdorffs entry into a thorough study of ordered sets was prompted in part by Cantors continuum problem: which place does the ": null
    },
    {
        "cardinal number": "Cardinal Number"
    },
    {
        "   2 take in the series   . In a letter to Hilbert on 29 September 1904, he speaks of this problem, it has plagued almost like a monomania . Niedersächsische Staats- und Universitätsbibliothek zu Göttingen, Handschriftenabteilung, NL Hilbert, Nr. 136. He saw in the set     a new strategy to attack the problem. Cantor had suspected     , but had only shown       .   is the number of possible ": null
    },
    {
        "well-orderings": "Well-Ordering"
    },
    {
        "of a ": null
    },
    {
        "countable set": "Countable Set"
    },
    {
        " ;   had now emerged as the number of all possible orders of such an amount. It was natural, therefore, to study systems that are more special than general orders, but more general than well-orderings. Hausdorff did just that in his first volume of 1901 with the publication of theoretical studies of graded sets . We know from the results of ": null
    },
    {
        "Kurt Gödel": "Kurt Gödel"
    },
    {
        " and ": null
    },
    {
        "Paul Cohen": "Paul Cohen"
    },
    {
        ", that this strategy to solve the continuum problem is just as ineffectual as Cantors strategy, which was aimed at generalizing the ": null
    },
    {
        "Cantor-Bendixson principle": "Cantor & Ndash;Bendixson Theorem"
    },
    {
        " for closed sets to general uncountable sets.     In 1904 Hausdorff published the recursion named after him:     For each non-limit ordinal   we have             This formula was, together with the later notion of cofinality introduced by Hausdorff, the basis for all further results for ": null
    },
    {
        "Aleph exponentiation": "Aleph Exponentiation"
    },
    {
        ". Hausdorff excellent knowledge of the problems of this type of sequence was also empowered by his efforts to uncover the error in ": null
    },
    {
        "Julius Königs": "Julius König"
    },
    {
        "lecture at the International Congress of Mathematicians in 1904 in Heidelberg. There König had argued that the continuum can not be well-ordered, so its cardinality is no Aleph, and thus caused a great stir. The assertion that it was Hausdorff who clarified the mistake has a special weight because a false image was drawn in the historical literature for more than 50 years of the events in Heidelberg. Detaillierte Angaben findet man in den gesammelten Werken, Band  II, S.  9–12.     In the years 1906–1909 Hausdorff did his fundamental work on ordered sets. Only a few points can be touched briefly. Of fundamental importance to the whole theory is the concept of ": null
    },
    {
        "cofinal": "Cofinal"
    },
    {
        "ity that Hausdorff introduced. An ordinal is called regular if it is cofinal with any smaller ordinal; otherwise it is singular. Hausdorffs question whether there are regular numbers with index a limit ordinal, was the starting point for the theory of inaccessible cardinals. Hausdorff had already noticed that such numbers, if they exist, must be of exorbitant size . H.: Gesammelte Werke. Band  II: Grundzüge der Mengenlehre. Springer-Verlag, Berlin, Heidelberg etc. 2002. Kommentare von U.  Felgner, S.  598–601.     Of fundamental importance is the following theorem of Hausdorff: for each unbounded ordered dense set A there are two uniquely determined regular initial numbers     so that A is cofinal with   and coinitial with   . This theorem provides, for example, a technique to characterize elements and gaps in ordered sets. Thus Hausdorff utilized the gap characters and element characters introduced by him.     If W is a predetermined set of characters , the question arises whether there are ordered sets whose character set is exactly W . One can easily find a necessary condition for W . Hausdorff was able to show that this condition is also sufficient. For this one needs a rich reservoir of ordered sets; Hausdorff had created this with his theory of general products and powers. H.: Gesammelte Werke. Band  II: Grundzüge der Mengenlehre. Springer-Verlag, Berlin, Heidelberg etc. 2002. S.  604–605. In this reservoir such interesting structures are found as the Hausdorff   normal-types, in connection with which Hausdorff first formulated the ": null
    },
    {
        "generalized continuum hypothesis": "Generalized Continuum Hypothesis"
    },
    {
        ". Hausdorffs   -sets formed the starting point for the study of the important model theory of ": null
    },
    {
        "saturated structure": "Saturated Structure"
    },
    {
        ". Siehe dazu den Essay von U. Felgner: Die Hausdorffsche Theorie der   -Mengen und ihre Wirkungsgeschichte in H.: Gesammelte Werke. Band  II: Grundzüge der Mengenlehre. Springer-Verlag, Berlin, Heidelberg etc. 2002. S.  645–674.     Hausdorffs general products and powers of cardinalities had led him to the concept of partially ordered set. The question of whether any ordered subset of a partially ordered set is contained in a maximal ordered subset was answered in the positive by Hausdorff using the well-ordering theorem. This is the ": null
    },
    {
        "Hausdorff maximal principle": "Hausdorff Maximal Principle"
    },
    {
        ". It follows not only from the well-ordering theorem , but it is, as it turned out, even to the axiom of choice are equivalent. Siehe dazu und zu ähnlichen Sätzen von ": null
    },
    {
        "Kuratowski": "Kazimierz Kuratowski"
    },
    {
        " und ": null
    },
    {
        "Zorn": "Max August Zorn"
    },
    {
        " den Kommentar von U.  Felgner in den gesammelten Werken, Band  II, S.  602–604.     Already, in 1908, ": null
    },
    {
        "Arthur Moritz Schoenflies": "Arthur Moritz Schoenflies"
    },
    {
        " found in the second part of his report on set theory, that the newer theory of ordered sets was almost exclusively due to Hausdorff. Schoenflies, A.: Die Entwickelung der Lehre von den Punktmannigfaltigkeiten. Teil  II. Jahresbericht der DMV, 2.  Ergänzungsband, Teubner, Leipzig 1908., S.  40.       According to former notions, set theory included not only the general set theory and the theory of sets of points, but also dimension and measure theory. Hausdorffs work was the first textbook which presented all of set theory in this broad sense, systematically and with full proofs. Hausdorff was aware of how easily the human mind can err while also seeking for rigor and truth. So he proposed in the preface of the work:          This book went far beyond its masterful portrayal of the known. It also contained a series of important original contributions of the author that can only be hinted at in the following.     The first six chapters deal with the basic concepts of the general set theory. At the beginning Hausdorff sets forth a detailed set algebra with some pioneering new concepts . These introductory paragraphs on sets and their connections included, for example, the modern set-theoretic notion of functions. Next followed in Chapters 3 to 5 the classical theory of cardinal numbers, order types and ordinals. In the sixth chapter Relations between ordered and well-ordered sets Hausdorff presents, among other things, the most important results of his own research on ordered sets.     In the chapters on point sets —the topological chapters—Hausdorff developed for the first time, based on the known neighborhood axioms, a systematic theory of topological spaces, where in addition he added the separation axiom later named after him. This theory emerges from a comprehensive synthesis of earlier approaches of other mathematicians and Hausdorffs own reflections on the problem of space. The concepts and theorems of classical point set theory   are—as far as possible—transferred to the general case, and thus become part of the newly created general or set-theoretic topology. But Hausdorff not only performed this translation work , but he developed also basic construction method of topology as nucleation and shell formation , and he works the fundamental importance of the concept of open set and of the compactness introduced by Fréchet. He also founded and developed the theory of the connected set, particularly through the introduction of the terms component and quasi-component .     By the first and eventually the second Hausdorff countability axioms the considered spaces were gradually further specialized. A large class of spaces satisfying the countable first axiom are ": null
    },
    {
        "metric spaces": "Metric Spaces"
    },
    {
        ". They were introduced in 1906 by Fréchet under the name classes . The term metric space comes from Hausdorff. In Principles, he developed the theory of metric spaces and systematically enriched it through a series of new concepts: ": null
    },
    {
        "Hausdorff metric": "Hausdorff Metric"
    },
    {
        ", ": null
    },
    {
        "complete": "Complete Metric Space"
    },
    {
        ", ": null
    },
    {
        "total boundedness": "Total Boundedness"
    },
    {
        ",   -connectivity, reducible sets. Fréchets work had been little noticed; only through Hausdorffs Principles did metric spaces become the common property of the mathematician.     The chapter on illustrations and the final chapter of Principles on measure and integration theory are enriched by the generality of the material and the originality of presentation. Hausdorffs mention of the importance of measure theory for ": null
    },
    {
        "probability": "Probability"
    },
    {
        " had great historical effect, despite its laconic brevity. One finds in this chapter the first correct proof of the ": null
    },
    {
        "strong law of large numbers": "Strong Law Of Large Numbers"
    },
    {
        " of ": null
    },
    {
        "Émile Borel": "Émile Borel"
    },
    {
        ". Finally, the appendix contains the single most spectacular result of the whole book, namely Hausdorffs theorem that one cannot define a volume for all bounded subsets of   for n   3 . The proof is based on Hausdorffs paradoxical ball decomposition, whose production requires the axiom of choice. Zur Wirkungsgeschichte des Hausdorffschen Kugelparadoxons siehe Gesammelte Werke Band  IV, S.  11–18; ferner den Aufsatz von P.  Schreiber in Brieskorn 1996, S.  135–148, und die Monographie Wagon 1993.     During the 20th century, it became the standard to build mathematical theories on axiomatic set theory. The creation of axiomatically founded generalized theories, such as the general topology, served among other things to single out the common structural core for various specific cases or regions and then set up an abstract theory, which contained all these parts as special cases. This brought a great success in the form of simplification and harmonization and ultimately brought on economy of thought with itself. Hausdorff himself highlighted this aspect in the Principles. The topological chapter the basic concepts are methodologically a pioneering effort, and they showed the way for the development of modern mathematics.     Principles of set theory appeared in an already tense time on the eve of the First World War. In August 1914, the war, which also dramatically affected the scientific life in Europe. Under these circumstances, could hardly be effective Hausdorffs book in the first five to six years after its appearance. After the war, a new generation of young researchers set forth to expand on the suggestions that were included in this work in such abundance, and with no doubt, the topology was the focus of attention. The journal ": null
    },
    {
        "Fundamenta Mathematicae": "Fundamenta Mathematicae"
    },
    {
        " played a special role in the reception of Hausdorff ideas, founded in Poland in 1920. It was one of the first mathematical journals with special emphasis on set theory, topology, theory of real functions, measure and integration theory, functional analysis, logic and foundations of mathematics. In this spectrum, a special focus was the general topology. Hausdorffs Principles were present in Fundamenta Mathematicae from the first volume in a remarkable frequency. Of the 558 works , which appeared in the first twenty volumes from 1920 to 1933, 88 cite Principles. One even has to take into account that as Hausdorffs conceptions increasingly became commonplace, so they were also used in a number of works that did not mention them explicitly.     The Russian topological school, founded by ": null
    },
    {
        "Paul Alexandroff": "Paul Alexandroff"
    },
    {
        " and ": null
    },
    {
        "Urysohn Paul": "Urysohn Paul"
    },
    {
        ", was based heavily on Hausdorffs Principles. This is shown by the surviving correspondence in Hausdorffs ": null
    },
    {
        "Nachlass": "Nachlass"
    },
    {
        " with Urysohn, and especially Alexandroff and Urysohns Mémoire sur les multiplicités Cantoriennes, Urysohn, P.:   Fundamenta Mathematicae 7 , S.  30–137; 8 , S.  225–351. a work the size of a book, in which Urysohn developed dimension theory and Principles is cited no fewer than 60 times.     Long after the Second World War there was a strong demand for Hausdorffs book, and there were three reprints at Chelsea from 1949, 1965 and 1978.       In 1916, Alexandroff and Hausdorff independently solved P. Alexandroff: Sur la puissance des ensembles mesurables B. Comptes rendus Acad. Sci. Paris 162 , S.  323–325. the continuum problem for Borel sets: Every Borel set in a complete separable metric space is either countable or has the cardinality of the continuum. This result generalizes the ": null
    },
    {
        "Cantor-Bendixson theorem": "Cantor-Bendixson Theorem"
    },
    {
        " that such a statement holds for the closed sets of   . For linear G sets ": null
    },
    {
        "William Henry Young": "William Henry Young"
    },
    {
        " had proved the result in 1903, W. H. Young: Zur Lehre der nicht abgeschlossenen Punktmengen. Berichte über die Verhandlungen der Königl. Sächs. Ges. der Wiss. zu Leipzig, Math.-Phys. Klasse  55 , S.  287–293. for G sets Hausdorff obtained a corresponding result in 1914 in the Principles. The theorem of Alexandroff and Hausdorff was a strong impetus for further development of descriptive set theory. Alexandorff, Hopf 1935, S.  20. For details see Gesammelte Werke Band  II, S.  773–787.     Among the publications of Hausdorff in his time at Greifswald time the work Dimension and outer measure from 1919 is particularly outstanding. It has remained highly topical and in later years has been probably the most cited mathematical original work from the decade from 1910 to 1920. In this work, the concepts were introduced which are now known as ": null
    },
    {
        "Hausdorff measure": "Hausdorff Measure"
    },
    {
        " and the ": null
    },
    {
        "Hausdorff dimension": "Hausdorff Dimension"
    },
    {
        ".     The concept of Hausdorff dimension is useful for the characterization and comparison of highly rugged quantities . The concepts of Dimension and outer measure have experienced applications and further developments in many areas such as in the theory of dynamical systems, geometric measure theory, the theory of self-similar sets and fractals, the theory of stochastic processes, harmonic analysis, potential theory and number theory. For the history of the reception of Dimension und äußeres Maß, see the article by Bandt/Haase and Bothe/Schmeling in Brieskorn 1996, S.  149–183 and S.  229–252 and the commentary of S.  D.  Chatterji in Gesammelten Werken, Band  IV, S.  44–54 and the literature given there.     Significant analytical work of Hausdorff occurred in his second time at Bonn. In Summation methods and moment sequences I in 1921, he developed a whole class of summation methods for divergent series, which today are called ": null
    },
    {
        "Hausdorff method": "Hausdorff Method"
    },
    {
        "s. In ": null
    },
    {
        "Hardys": "Godfrey Harold Hardy"
    },
    {
        "classic Divergent Series, an entire chapter is devoted to the Hausdorff method. The classical methods of ": null
    },
    {
        "Hölder": "Otto Hölder"
    },
    {
        " and ": null
    },
    {
        "Cesàro": "Ernesto Cesàro"
    },
    {
        " proved to be special Hausdorff method. Every Hausdorff method is given by a moment sequence; in this context Hausdorff gave an elegant solution of the moment problem for a finite interval, bypassing the theory of continued fractions. In Moment problems for a finite interval of 1923 he treated more special moment problems, such as those with certain restrictions for generating density   , for instance     Lp . Criteria for solvability and determination of moment problems occupied Hausdorff for many years as hundreds of pages of studies in his ": null
    },
    {
        "Nachlass": "Nachlass"
    },
    {
        " attest. Gesammelte Werke Band  IV, S.  105–171, 191–235, 255–267 and 339–373.     A significant contribution to the emerging functional analysis in the twenties was Hausdorffs extension of the Riesz-Fischer theorem to Lp spaces in his 1923 work An extension of Parsevals theorem on Fourier series. He proved the inequalities now named after him and ": null
    },
    {
        "W.H. Young": "W.H. Young"
    },
    {
        ". The Hausdorff-Young inequalities became the starting point of major new developments. See commentary by S.  D.  Chatterji in Gesammelten Werken Band  IV, S.  182–190.     Hausdorffs book Set Theory appeared in 1927. This was declared as a second Edition of Principles, but it was actually a completely new book. Since the scale was significantly reduced due to its appearance in Goschens teaching library, large parts of the theory of ordered sets and measures and integration theory were removed. More than these deletions, the reader will perhaps regret , that I, to further save space in point set theory, have abandoned the topological point of view through which the first edition has apparently acquired many friends have limited myself to the easier theory of metric spaces .     In fact, this was an explicit regret of some reviewers of the work. As a kind of compensation Hausdorff showed for the first time the then current state of descriptive set theory. This fact assured the book almost as intense a reception as Principles, especially in Fundamenta Mathematicae. As a textbook it was very popular. In 1935 there was an expanded edition published, and this was reprinted by Dover in 1944. An English translation appeared in 1957 with reprints in 1962 and 1967.     There was also a Russian edition , which although it was only partially a faithful translation, and partly a reworking by Alexandroff and ": null
    },
    {
        "Kolmogorov": "Kolmogorov"
    },
    {
        ". In this translation the topological point of view again moved to the forefront. In 1928 a review of Set Theory appeared from the pen of Hans Hahn. Perhaps Hahn had the danger of German anti-Semitism in his mind as he closed this discussion with the following sentence:            In his last work Erweiterung einer stetigen Abbildung, Hausdorff showed in 1938 that a ": null
    },
    {
        "continuous function": "Continuous Function"
    },
    {
        " from a closed subset F of a metric space E can be extended to all of E . As a special case, every ": null
    },
    {
        "homeomorphism": "Homeomorphism"
    },
    {
        " from F can be extended to a homeomorphism from E . This work set forth results from earlier years. In 1919, in Über halbstetige Funktionen und deren Verallgemeinerung, Hausdorff had, among other things, given another proof of the ": null
    },
    {
        "Tietze extension theorem": "Tietze Extension Theorem"
    },
    {
        ". In 1930, in Erweiterung einer Homöomorphie , he showed the following: Let E be a metric space, F   E a closed subset. If F is given a new metric without changing the topology, this metric can be extended to the entire space without changing the topology. The work Gestufte Räume appeared in 1935. Here Hausdorff discussed spaces which fulfilled the Kuratowski closure axioms up to just the axiom of idempotence. He named them graded spaces and used them in the study of the relationships between the ": null
    },
    {
        "Fréchet": "Maurice René Fréchet"
    },
    {
        " limit spaces and ": null
    },
    {
        "topological spaces": "Topological Spaces"
    },
    {
        ".       The name Hausdorff is found throughout mathematics. Among others, these concepts were named after him:   ": null
    },
    {
        "Hausdorff space": "Hausdorff Space"
    },
    {
        " Hausdorff measure": "Hausdorff Measure"
    },
    {
        " Hausdorff dimension": "Hausdorff Dimension"
    },
    {
        " Hausdorff completion": "Hausdorff Completion"
    },
    {
        " Hausdorff convergence": "Hausdorff Convergence"
    },
    {
        " Hausdorff metric": "Hausdorff Metric"
    },
    {
        " Hausdorff maximal principle": "Hausdorff Maximal Principle"
    },
    {
        " Hausdorff-Young inequality": "Hausdorff-Young Inequality"
    },
    {
        " Baker-Campbell-Hausdorff formula": "Baker-Campbell-Hausdorff Formula"
    },
    {
        " Hausdorff paradox": "Hausdorff Paradox"
    },
    {
        "     In the universities of Bonn and Greifswald, these things were named in his honor:   the ": null
    },
    {
        "Hausdorff Center for Mathematics": "Hausdorff Center For Mathematics"
    },
    {
        " in Bonn,   the Hausdorff Research Institute for Mathematics in Bonn, and   the Felix Hausdorff Internationale Begegnungszentrum in Greifswald.     Besides these, in Bonn there is the Hausdorffstraße , where he first lived. . In Greifswald there is a Felix-Hausdorff-Straße, where the Institutes for Biochemistry and Physics are located, among others. Since 2011, there is a Hausdorffweg in the middle of Leipziger Ortsteil ": null
    },
    {
        "Gohlis": "Gohlis"
    },
    {
        ". Ratsversammlung vom 18.  Mai 2011 , amtliche Bekanntmachung: Leipziger Amtsblatt Nr.  11 vom 4.  Juni 2011, bestandskräftig seit dem 5.  Juli 2011 bzw. 5.  August 2011. Vgl. Leipziger Amtsblatt Nr.  16 vom 10.  September 2011.     The Asteroid ": null
    },
    {
        "24947 Hausdorff": "24947 Hausdorff"
    },
    {
        " was named after him.           Only a selection of the essays that appeared in text are shown here.   SantIlario. Gedanken aus der Landschaft Zarathustras. Verlag C. G. Naumann, Leipzig 1897.   Das Chaos in kosmischer Auslese — Ein erkenntniskritischer Versuch. Verlag C. G. Naumann, Leipzig 1898; Reprinted with foreword by Max Bense: Baden-Baden: Agis-Verlag 1976,  Massenglück und Einzelglück. Neue Deutsche Rundschau 9 , , S.  64–75.   Das unreinliche Jahrhundert. Neue Deutsche Rundschau 9 , , S.  443–452.   Ekstasen. Volume of poetry. Verlag H. Seemann Nachf., Leipzig 1900.   Der Wille zur Macht. In: Neue Deutsche Rundschau 13 , S.  1334–1338.   Max Klingers Beethoven. Zeitschrift für bildende Kunst, Neue Folge 13 , S.  183–189.   Sprachkritik Neue Deutsche Rundschau 14 , , S.  1233–1258.   Der Arzt seiner Ehre, Groteske. In: Die neue Rundschau 15 , , S.  989-1013. New edition as: Der Arzt seiner Ehre. Komödie in einem Akt mit einem Epilog. With 7 portraits and woodcuts by Hans Alexander Müller after drawings by Walter Tiemann, 10  Bl., 71  S. Fifth printing by Leipziger Bibliophilen-Abends, Leipzig 1910. New edition: S.  Fischer, Berlin 1912, 88  S.       Beiträge zur Wahrscheinlichkeitsrechnung. Proceedings of the Royal Saxon Society for the Sciences at Leipzig. Math.-phys. Classe 53 , S.  152–178.   Über eine gewisse Art geordneter Mengen. Proceedings of the Royal Saxon Society for the Sciences at Leipzig. Math.-phys. Classe 53 , S.  460–475.   Das Raumproblem . Ostwalds Annals of Natural Philosophy 3 , S.  1–23.   https://web.archive.org/web/20151209212858/http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC244988 Der Potenzbegriff in der Mengenlehre.  , S.  569–571.   Untersuchungen über Ordnungstypen I, II, III. Proceedings of the Royal Saxon Society for the Sciences at Leipzig. Math.-phys.  Klasse 58 , S.  106–169.   Untersuchungen über Ordnungstypen IV, V. Proceedings of the Royal Saxon Society for the Sciences at Leipzig. Math.-phys. Klasse 59 , S.  84–159.   http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC244522 Über dichte Ordnungstypen.  , S.  541–546.   http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC38223 Grundzüge einer Theorie der geordneten Mengen.  , S.  435–505.   Die Graduierung nach dem Endverlauf. Proceedings of the Royal Saxon Society for the Sciences at Leipzig. Math.-phys. Klasse 31 , S.  295–334.    Grundzüge der Mengenlehre . Verlag Veit & Co, Leipzig. 476 S. mit 53 Figuren. Further printings: Chelsea Pub. Co. 1949, 1965, 1978.   http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC37502 Die Mächtigkeit der Borelschen Mengen.  , S.  430–437.   https://web.archive.org/web/20160128134426/http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC29028 Dimension und äußeres Maß.  , S.  157–179.   http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC16799 Über halbstetige Funktionen und deren Verallgemeinerung.  , S.  292–309.    http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC16919 II.  , I: S.  74-109, II: S.  280–299.   https://web.archive.org/web/20160108100131/http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC9350 Eine Ausdehnung des Parsevalschen Satzes über Fourierreihen.  , S.  163–169.   https://web.archive.org/web/20160107102208/http://gdz.sub.uni-goettingen.de/dms/load/img/?IDDOC9355 Momentprobleme für ein endliches Intervall.  , S.  220–248.   Mengenlehre, second reworked edition. Verlag Walter de Gruyter & Co., Berlin. 285  S. with 12  figures.   http://matwbn.icm.edu.pl/ksiazki/fm/fm16/fm16123.pdf Erweiterung einer Homöomorphie Fundamenta Mathematicae 16 , S.  353–360.   Mengenlehre, third edition. With an additional chapter and several appendices. Verlag Walter de Gruyter & Co., Berlin. 307  S. mit 12  Figuren. Nachdruck: Dover Pub. New York, 1944. Englisch edition: Set theory. Translated from the German by J.  R.  Aumann et al. Chelsea Pub. Co., New York 1957, 1962, 1967.     Fundamenta Mathematicae 25 , S.  486–502.   http://matwbn.icm.edu.pl/ksiazki/fm/fm30/fm3016.pdf Erweiterung einer stetigen Abbildung Fundamenta Mathematicae 30 , S.  40–47.   Nachgelassene Schriften. 2 volumes. Ed.: G. Bergmann, Teubner, Stuttgart 1969. From the Nachlass, Volume I includes ": null
    },
    {
        "fascicles": "Heft"
    },
    {
        " 510–543, 545–559, 561–577, Volume II fascicles 578–584, 598–658 .     Hausdorff on Ordered Sets. Trans. and Ed.: Jacob M. Plotkin, American Mathematical Society 2005.       The Hausdorff-Edition , edited by E. Brieskorn, F. Hirzebruch, W. Purkert , R. Remmert and E. Scholz with the collaboration of over twenty mathematicians, historians, philosophers and scholars, is an ongoing project of the ": null
    },
    {
        "North Rhine-Westphalian Academy of Sciences, Humanities and the Arts": "North Rhine-Westphalian Academy Of Sciences, Humanities And The Arts"
    },
    {
        " to present the works of Hausdorff, with commentary and much additional material. The planned nine volumes are being published by ": null
    },
    {
        "Springer-Verlag": "Springer Science+Business Media"
    },
    {
        ", Heidelberg. As of 2008, five had appeared. See the Home page of the Hausdorff Project  for its current status and further information. The projected volumes are:   Band I: Hausdorff als akademischer Lehrer; Arbeiten zur Mengenlehre.   Band II: Grundzüge der Mengenlehre . 2002,     Band III: Mengenlehre ; Deskriptive Mengenlehre und Topologie. 2008,  Analysis, Algebra und Zahlentheorie. 2001,    Band V: Astronomie, Optik und Wahrscheinlichkeitstheorie. 2006,    Band VI: Geometrie, Raum und Zeit.   Band VII: Philosophisches Werk. 2004,    Band VIII: Literarisches Werk. 2010,  Korrespondenz": null
    }
]