[
    {
        "             The First Punic War was the first of ": null
    },
    {
        "three wars": "Punic Wars"
    },
    {
        " fought between ": null
    },
    {
        "Ancient Carthage": "Ancient Carthage"
    },
    {
        " and the ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        ", the two ": null
    },
    {
        "great powers": "Great Power"
    },
    {
        "of the Western Mediterranean. For 23 years, in the longest continuous conflict and greatest naval war of antiquity, the two powers struggled for supremacy, primarily on the ": null
    },
    {
        "Mediterranean": "Mediterranean"
    },
    {
        " island": "Island"
    },
    {
        " of ": null
    },
    {
        "Sicily": "Sicily"
    },
    {
        " and its surrounding waters, and also in ": null
    },
    {
        "North Africa": "North Africa"
    },
    {
        ".     The war began in 264 BC with the Roman ": null
    },
    {
        "conquest": "Battle Of Messana"
    },
    {
        " of the Carthaginian-controlled ": null
    },
    {
        "city": "City"
    },
    {
        " of ": null
    },
    {
        "Messina": "Messina"
    },
    {
        " in Sicily, granting Rome a military foothold on the island. The Romans built up a ": null
    },
    {
        "navy": "Navy"
    },
    {
        " to challenge Carthage, the greatest ": null
    },
    {
        "naval power": "Naval Power"
    },
    {
        " in the Mediterranean, for control over the waters around Sicily. In naval battles and ": null
    },
    {
        "storm": "Storm"
    },
    {
        "s, 700 Roman and 500 Carthaginian ": null
    },
    {
        "quinqueremes": "Quinquereme"
    },
    {
        "were lost, along with hundreds of thousands of lives. ": null
    },
    {
        "Command of the sea": "Command Of The Sea"
    },
    {
        " was won and lost by both sides repeatedly. A Roman invasion of Carthaginian ": null
    },
    {
        "Africa": "Africa"
    },
    {
        " was destroyed ": null
    },
    {
        "in battle at the Bagradas": "Battle Of The Bagradas River"
    },
    {
        " and the ": null
    },
    {
        "Roman consul": "Roman Consul"
    },
    {
        " Marcus Atilius Regulus": "Marcus Atilius Regulus"
    },
    {
        " was ": null
    },
    {
        "captured": "Prisoner Of War"
    },
    {
        " by the Carthaginians in 255. In 23 years, the Romans slowly conquered Sicily and drove the Carthaginians to the west end of the island.     After both sides had been brought to a state of near exhaustion, the Romans mobilized their citizenrys private wealth and created a new fleet under consul ": null
    },
    {
        "Gaius Lutatius Catulus": "Gaius Lutatius Catulus"
    },
    {
        ". The Carthaginian fleet was destroyed at the ": null
    },
    {
        "Aegates Islands": "Battle Of The Aegates Islands"
    },
    {
        " in 241, forcing the cut-off Carthaginian troops on Sicily to give up. A peace ": null
    },
    {
        "treaty": "Treaty Of Lutatius"
    },
    {
        " was signed in which Carthage was made to pay a heavy ": null
    },
    {
        "indemnity": "Indemnity"
    },
    {
        " and Rome ejected Carthage from Sicily, ": null
    },
    {
        "annexing": "Sicilia"
    },
    {
        " the island as a ": null
    },
    {
        "Roman province": "Roman Province"
    },
    {
        ".     The war was followed by a failed ": null
    },
    {
        "revolt": "Mercenary War"
    },
    {
        " against the ": null
    },
    {
        "Carthaginian Empire": "Carthaginian Empire"
    },
    {
        ". The Romans exploited Carthages weakness to seize the Carthaginian possessions of ": null
    },
    {
        "Sardinia": "Sardinia"
    },
    {
        " and ": null
    },
    {
        "Corsica": "Corsica"
    },
    {
        " in violation of the peace treaty. The unresolved strategic competition between Rome and Carthage would lead to the eruption of the ": null
    },
    {
        "Second Punic War": "Second Punic War"
    },
    {
        " in 218 BC.       The series of wars between Rome and Carthage took the name Punic from the ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " adjective for Carthaginian, Punicus. This is derived from Poeni and refers to the Carthaginian heritage as ": null
    },
    {
        "Phoenicia": "Phoenicia"
    },
    {
        "n colonists. . A Carthaginian name for the conflicts does not survive in any records.         Rome had recently emerged as the leading ": null
    },
    {
        "city-state": "City-State"
    },
    {
        " in the Italian Peninsula, a wealthy, powerful, ": null
    },
    {
        "expansionist": "Expansionism"
    },
    {
        " republic": "Republic"
    },
    {
        " with a successful citizen army.  Over the past one hundred years, Rome had come into conflict, and defeated rivals on the Italian peninsula, then incorporated them into the Roman political world. First, the ": null
    },
    {
        "Latin League": "Latin League"
    },
    {
        " was forcibly dissolved during the ": null
    },
    {
        "Latin War": "Latin War"
    },
    {
        ", . then the power of the ": null
    },
    {
        "Samnites": "Samnites"
    },
    {
        " was broken during the three prolonged ": null
    },
    {
        "Samnite wars": "Samnite Wars"
    },
    {
        ", . and then the Greek cities of ": null
    },
    {
        "Magna Graecia": "Magna Graecia"
    },
    {
        " submitted to Roman power at the conclusion of the ": null
    },
    {
        "Pyrrhic War": "Pyrrhic War"
    },
    {
        ". By the beginning of the First Punic War, the Romans had secured the whole of the ": null
    },
    {
        "Italian peninsula": "Italian Peninsula"
    },
    {
        ", except ": null
    },
    {
        "Gallia Cisalpina": "Gallia Cisalpina"
    },
    {
        " in the ": null
    },
    {
        "Po Valley": "Po Valley"
    },
    {
        ".       ": null
    },
    {
        "Carthage": "Ancient Carthage"
    },
    {
        " was a republic that dominated the political, military and economic affairs of the western Mediterranean Sea, especially on the North African coasts and islands, and above all, due to its navy.  It originated as a ": null
    },
    {
        "Phoenicia": "Phoenicia"
    },
    {
        "n colony in Africa, near modern ": null
    },
    {
        "Tunis": "Tunis"
    },
    {
        ".  Carthage had become a wealthy centre for trade networks extending from Gadir  along the coasts of southern ": null
    },
    {
        "Iberia": "Iberia"
    },
    {
        " and ": null
    },
    {
        "North Africa": "North Africa"
    },
    {
        ", across the ": null
    },
    {
        "Balearic Islands": "Balearic Islands"
    },
    {
        ", ": null
    },
    {
        "Corsica": "Corsica"
    },
    {
        ", ": null
    },
    {
        "Sardinia": "Sardinia"
    },
    {
        ", and the western half of ": null
    },
    {
        "Sicily": "Sicily"
    },
    {
        ", to the ports of the eastern Mediterranean, including ": null
    },
    {
        "Tyre": "Tyre, Lebanon"
    },
    {
        ", its mother city, on the shores of the ": null
    },
    {
        "Levant": "Levant"
    },
    {
        ". . At the height of power, just before the First Punic War, Carthage was hostile to foreign ships in the western Mediterranean.        North African peoples, such as the ": null
    },
    {
        "Berbers": "Berbers"
    },
    {
        ", in the area around Carthage were loosely associated with Carthage.  In the midst of the First Punic War, some tribes rebelled against Carthage, opening a second front while the Carthaginians battled the Romans in Sicily.       Greek colonists were also a major presence in the western Mediterranean, following centuries of ": null
    },
    {
        "colonial settlement": "Greek Coloniescolonies In Antiquity"
    },
    {
        ", ": null
    },
    {
        "trade": "Economy Of Ancient Greece"
    },
    {
        " and conflicts with Rome over ": null
    },
    {
        "Magna Graecia": "Magna Graecia"
    },
    {
        " and with Carthage over places such as Sicily.   The rich, strategically influential, and well-fortified Greek colony of ": null
    },
    {
        "Syracuse": "Syracuse, Sicily"
    },
    {
        " was politically independent of Rome and Carthage. Hostilities of the First Punic War began with developments involving the Romans, Carthaginians, and Greek colonists in Sicily and southern Italy.          In 288 BC, the ": null
    },
    {
        "Mamertines": "Mamertines"
    },
    {
        ", a group of Italian  mercenaries originally hired by ": null
    },
    {
        "Agathocles": "Agathocles"
    },
    {
        " of Syracuse, occupied the city of Messana  in the north-eastern tip of Sicily, killing all the men and taking the women as their wives. . At the same time, a group of Roman troops made up of Campanian citizens without the vote revolted and seized control of ": null
    },
    {
        "Rhegium": "Rhegium"
    },
    {
        ", lying across the ": null
    },
    {
        "Straits of Messina": "Straits Of Messina"
    },
    {
        " on the mainland of Italy. In 270 BC, the Romans regained control of Rhegium and severely punished the survivors of the revolt. In Sicily, the Mamertines ravaged the countryside and collided with the expanding regional empire of the independent city of ": null
    },
    {
        "Syracuse": "Syracuse, Italy"
    },
    {
        ". ": null
    },
    {
        "Hiero II": "Hiero Ii Of Syracuse"
    },
    {
        ", ": null
    },
    {
        "tyrant": "Tyrant"
    },
    {
        " of Syracuse, defeated the Mamertines near ": null
    },
    {
        "Mylae": "Mylae"
    },
    {
        " on the ": null
    },
    {
        "Longanus River": "Longanus River"
    },
    {
        ". Polybius. The Histories, . Following their defeat, the Mamertines appealed to both Rome and Carthage for assistance. The Carthaginians acted first, approached Hiero to take no further action and convinced the Mamertines to accept a Carthaginian garrison in Messana. Either unhappy with the prospect of a Carthaginian garrison or convinced that the recent alliance between Rome and Carthage against ": null
    },
    {
        "Pyrrhus": "Pyrrhus Of Epirus"
    },
    {
        " reflected cordial relations between the two, the Mamertines, hoping for more reliable protection, petitioned Rome for an alliance. However, the rivalry between Rome and Carthage had grown since the war with Pyrrhus and that alliance was simply no longer feasible. .     According to the historian ": null
    },
    {
        "Polybius": "Polybius"
    },
    {
        ", considerable debate took place in Rome on the question as to whether to accept the Mamertines appeal for help and thus likely enter into a war with Carthage. The Romans did not wish to come to the aid of soldiers who had unjustly stolen a city from its rightful possessors, and they were still recovering from the insurrection of ": null
    },
    {
        "Campanian": "Campanian"
    },
    {
        " troops at the Battle of Rhegium in 271 BC. However, many were also unwilling to see Carthaginian power in Sicily expand even further. Leaving them at Messana would give the Carthaginians a free hand to deal with Syracuse. After the Syracusans had been defeated, the Carthaginian takeover of Sicily would essentially be complete. Polybius. The Histories, . A deadlocked senate put the matter before the popular assembly, where it was decided to accept the Mamertines request and ": null
    },
    {
        "Appius Claudius Caudex": "Appius Claudius Caudex"
    },
    {
        " was appointed commander of a military expedition with orders to cross to Messana. ; . Polybius. The Histories, .            Sicily is a hilly volcanic island, with geographical obstacles and rough terrain making lines of communication difficult to maintain. For this reason, land warfare played a secondary role in the First Punic War. Land operations were confined to small scale raids and skirmishes, with few ": null
    },
    {
        "pitched battle": "Pitched Battle"
    },
    {
        "s. ": null
    },
    {
        "Sieges": "Siege"
    },
    {
        "and land ": null
    },
    {
        "blockades": "Blockade"
    },
    {
        "were the most common large-scale operations for the regular army. The main blockade targets were the important ports since neither Carthage nor Rome were based in Sicily, and both needed continuous reinforcements and communication with their mainlands. .     The land war in Sicily began with the Roman landing at Messana in 264 BC. According to Polybius, despite the Carthaginian pre-war naval advantage, the Roman landing was virtually unopposed. Two legions commanded by ": null
    },
    {
        "Appius Claudius Caudex": "Appius Claudius Caudex"
    },
    {
        " disembarked at Messana, where the ": null
    },
    {
        "Mamertines": "Mamertines"
    },
    {
        " had expelled the Carthaginian garrison commanded by ": null
    },
    {
        "Hanno": "Hanno, Messana Garrison Commander"
    },
    {
        " . Polybius. The Histories, . After defeating the Syracusan and Carthaginian forces besieging ": null
    },
    {
        "Messana": "Battle Of Messana"
    },
    {
        ", the Romans marched south and in turn besieged Syracuse. Polybius. The Histories, . After a brief siege, with no Carthaginian help in sight, Syracuse made peace with the Romans. .     According to the terms of the treaty, Syracuse would become a Roman ally, pay a somewhat light indemnity of 100 ": null
    },
    {
        "talents": "Talent"
    },
    {
        " of silver to Rome and, perhaps most importantly, agree to help supply the Roman army in Sicily. That solved the Roman problem of having to keep an overseas army provisioned while facing an enemy with a superior navy. Polybius. The Histories, . Following the defection of Syracuse from Carthage, several other smaller Carthaginian dependencies in Sicily also switched to the Roman side.       Meanwhile, Carthage had begun to build a ": null
    },
    {
        "mercenary": "Mercenary"
    },
    {
        " army in Africa, which was to be shipped to Sicily to meet the Romans. According to the historian ": null
    },
    {
        "Philinus": "Philinus Of Agrigentum"
    },
    {
        ", this army was composed of 50,000 infantry, 6,000 cavalry, and 60 elephants and partly composed of ": null
    },
    {
        "Ligurians": "Ligures"
    },
    {
        ", ": null
    },
    {
        "Celts": "Celts"
    },
    {
        " and ": null
    },
    {
        "Iberians": "Iberians"
    },
    {
        ". . Polybius. The Histories, .     In past wars on the island of Sicily, Carthage had won by relying on certain fortified strong-points throughout the island, and their plan was to conduct the land war in the same fashion. The mercenary army would operate in the open against the Romans, while the strongly fortified cities would provide a defensive base from which to operate.          In 262 BC, Rome besieged Agrigentum, an operation that involved both consular armies—a total of four ": null
    },
    {
        "Roman legion": "Roman Legion"
    },
    {
        "s—and took several months to resolve. The garrison of Agrigentum managed to call for reinforcements and the Carthaginian relief force, commanded by ": null
    },
    {
        "Hanno": "Hanno, Son Of Hannibal"
    },
    {
        ", destroyed the Roman supply base at Erbessus. Polybius. The Histories, . With supplies from Syracuse cut, the Romans were now besieged and constructed a line of ": null
    },
    {
        "contravallation": "Contravallation"
    },
    {
        ". After a few skirmishes, disease struck the Roman army while supplies in Agrigentum were running low, and both sides saw an open battle as preferable to the current situation. Although the Romans won a clear victory over the Carthaginian relief force at the ": null
    },
    {
        "Battle of Agrigentum": "Battle Of Agrigentum"
    },
    {
        ", the Carthaginian army defending the city managed to escape. Agrigentum, now lacking any real defences, fell easily to the Romans, who then sacked the city and enslaved the populace. .       At the beginning of the First Punic War, Rome had virtually no experience in ": null
    },
    {
        "naval warfare": "Naval Warfare"
    },
    {
        ", whereas the strong and powerful Carthage had a great deal of experience on the seas thanks to its centuries of sea-based trade. Nevertheless, the growing Roman Republic soon understood the importance of Mediterranean control in the outcome of the conflict. .       The first major Roman fleet was constructed after the victory of Agrigentum in 261 BC. Some historians have speculated that, since Rome lacked advanced naval technology, the design of the warships was probably copied from captured Carthaginian ": null
    },
    {
        "triremes": "Trireme"
    },
    {
        "and ": null
    },
    {
        "quinqueremes": "Quinquereme"
    },
    {
        "or from ships that had beached on Roman shores due to storms. . According to ": null
    },
    {
        "Polybius": "Polybius"
    },
    {
        ", the Romans seized a shipwrecked Carthaginian quinquereme, and used it as a blueprint for their own ships. Polybius, http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Polybius/home.html The Histories, I.20–21 Other historians have pointed out that Rome did have experience with naval technology, as she patrolled her coasts against ": null
    },
    {
        "piracy": "Piracy"
    },
    {
        ". . Another possibility is that Rome received technical assistance from its seafaring Sicilian ally, Syracuse. Regardless of the state of their naval technology at the start of the war, Rome quickly adapted. .             In order to compensate for the lack of experience, and to make use of standard land military tactics at sea, . the Romans equipped their new ships with a special ": null
    },
    {
        "boarding": "Naval Boarding"
    },
    {
        " device, the  corvus . . The Roman military was a land-based army, while Carthage was primarily a naval power. This boarding-bridge allowed the Roman navy to circumvent some of Carthages naval skills by using their marines to board Carthaginian ships and fight in ": null
    },
    {
        "hand-to-hand combat": "Hand-To-Hand Combat"
    },
    {
        ". Instead of manoeuvring to ": null
    },
    {
        "ram": "Ramming"
    },
    {
        ", which was the standard naval tactic at the time, corvus equipped ships would manoeuver alongside the enemy vessel, deploy the bridge which would attach to the enemy ship through spikes on the end of the bridge, and send legionaries across as boarding parties. Polybius. The Histories, .     The new weapon would prove its worth in the ": null
    },
    {
        "Battle of Mylae": "Battle Of Mylae"
    },
    {
        ", the first Roman naval victory, and would continue to do so in the following years, especially in the huge ": null
    },
    {
        "Battle of Cape Ecnomus": "Battle Of Cape Ecnomus"
    },
    {
        ". The addition of the corvus forced Carthage to review its military tactics, and since the city had difficulty in doing so, Rome had the naval advantage. .               The Roman fleet, under the command of ": null
    },
    {
        "Gaius Duilius": "Gaius Duilius"
    },
    {
        ", engaged the Carthaginians, under general ": null
    },
    {
        "Hannibal Gisco": "Hannibal Gisco"
    },
    {
        ", off northern Mylae in 260 BC. Polybius states that the Carthaginians had 130 ships, but does not give an exact figure for the Romans. Polybius. The Histories, . The loss of 17 ships at the ": null
    },
    {
        "Lipari Islands": "Lipari Islands"
    },
    {
        " from a starting total of 120 ships suggests that Rome had 103 remaining. However, it is possible that this number was greater, thanks to captured ships and the assistance of Roman allies. . The Carthaginians anticipated victory, due to their superior experience at sea.     The corvi were very successful, and helped the Romans seize the first 30 Carthaginian ships that were close enough. In order to avoid the corvi, the Carthaginians were forced to navigate around them and approach the Romans from behind, or from the side. The corvus was usually still able to pivot and grapple most oncoming ships. Polybius. The General History of Polybius, Book I . After a further 20 Carthaginian ships had been hooked and lost to the Romans, Hannibal Gisco retreated with his surviving ships, leaving Duilius with a clear victory.     Instead of pursuing the remaining Carthaginians, Duilius sailed to Sicily to relieve the city of ": null
    },
    {
        "Segesta": "Segesta"
    },
    {
        ", which had been under siege from the Carthaginian infantry commander ": null
    },
    {
        "Hamilcar": "Hamilcar"
    },
    {
        ". . Modern historians have wondered at Duilius’ decision not to immediately follow up with another naval attack, but Hannibal Gisco’s remaining 80 ships were probably still too strong for Rome to conquer. .            The Roman advance now continued westward from Agrigentum to relieve the besieged city of ": null
    },
    {
        "Macella": "Macella"
    },
    {
        " in 260 BC, Polybius. The Histories, . which had sided with Rome and was attacked by the Carthaginians for doing so. In the north, the Romans, with their northern sea flank secured by their naval victory at the ": null
    },
    {
        "Battle of Mylae": "Battle Of Mylae"
    },
    {
        ", advanced toward ": null
    },
    {
        "Thermae": "Termini Imerese"
    },
    {
        ". They were ": null
    },
    {
        "defeated": "Battle Of Thermae"
    },
    {
        " there by the Carthaginians under Hamilcar  in 260 BC. Polybius. The Histories, . The Carthaginians took advantage of this victory by ": null
    },
    {
        "counter-attacking": "Counterattack"
    },
    {
        ", in 259 BC, and seizing ": null
    },
    {
        "Enna": "Enna"
    },
    {
        ". Hamilcar continued south to ": null
    },
    {
        "Camarina": "Kamarina, Sicily"
    },
    {
        ", in Syracusan territory, presumably with the intent to convince the Syracusans to rejoin the Carthaginian side. .       In 259 BC, consul Lucius Cornelius Scipio occupied Aleria in Corsica and probably Olbia in Sardinia. Hanno died while fighting at Olbia. The Romans withdrew because of the arrival of a Carthaginian fleet. Cornelius Scipio celebrated his victories over the Carthaginians and Sardinians with a triumph the following year Lucio Cornelio Scipione . During the same year, a naval battle occurred near Sulci. The Carthaginian fleet was defeated and the commander Hannibal Gisco, who abandoned his men and fled to Sulci, was later captured by his soldiers and crucified.            The next year, 258 BC, the Romans were able to regain the initiative by retaking Enna and Camarina. In central Sicily, they took the town of ": null
    },
    {
        "Mytistraton": "Mytistraton"
    },
    {
        ", which they had attacked twice previously. The Romans also moved in the north by marching across the northern coast toward ": null
    },
    {
        "Panormus": "Palermo"
    },
    {
        ", but were not able to take the city. Polybius. The Histories, .       After their conquests in the Agrigentum campaign, and following several naval battles, Rome attempted the second large scale land operation of the war. Seeking a swifter end to the war than the long ": null
    },
    {
        "sieges": "Siege"
    },
    {
        "in Sicily would have provided, Rome decided to invade the Carthaginian colonies of Africa and usurp Carthages supremacy in the Mediterranean Sea, consequently forcing Carthage to accept its terms. . .          In order to initiate its invasion of Africa, the Roman Republic constructed a major fleet, comprising transports for the army and its equipment, and warships for protection. Carthage attempted to intervene with a fleet of 350 ships , Polybius. The Histories, . but was defeated in the Battle of Cape Ecnomus. .               As a result of the battle, the Roman army, commanded by ": null
    },
    {
        "Marcus Atilius Regulus": "Marcus Atilius Regulus"
    },
    {
        ", landed in Africa and began ravaging the Carthaginian countryside. . The ": null
    },
    {
        "Siege of Aspis": "Siege Of Aspis"
    },
    {
        " was the first fighting on African land during the war. Regulus was next victorious at the ": null
    },
    {
        "Battle of Adys": "Battle Of Adys"
    },
    {
        ", forcing Carthage to sue for peace. . According to Polybius, the terms suggested were so heavy that Carthage decided they would be better off not under Roman rule. The negotiations failed but fortunately, for the Carthaginians, ": null
    },
    {
        "Xanthippus": "Xanthippus Of Carthage"
    },
    {
        ", a ": null
    },
    {
        "Sparta": "Sparta"
    },
    {
        "n ": null
    },
    {
        "mercenary": "Mercenary"
    },
    {
        ", returned to ": null
    },
    {
        "Carthage": "Carthage"
    },
    {
        " to reorganise its army. . Xanthippus defeated the Roman army and captured Regulus at the ": null
    },
    {
        "Battle of Tunis": "Battle Of Tunis"
    },
    {
        ", Polybius. The Histories, . . and then managed to cut off what remained of the Roman army from its base by re-establishing Carthaginian naval supremacy. Polybius. The Histories, . .            The Romans, meanwhile, had sent a new fleet to pick up the survivors of its African expedition. Although the Romans defeated the Carthaginian fleet and were successful in rescuing their army in Africa, a storm destroyed nearly the entire Roman fleet on the return trip; the number of casualties in the disaster may have exceeded 90,000 men. The Carthaginians took advantage of this to attack Agrigentum. They did not believe that they could hold the city, so they burned it and left. .       The Romans were able to rally, however, and quickly resumed the offensive. With a new fleet of 140 ships, Rome returned to the strategy of taking the Carthaginian cities in Sicily one by one. .       Attacks began with naval assaults on ": null
    },
    {
        "Lilybaeum": "Lilybaeum"
    },
    {
        ", the centre of Carthaginian power on Sicily, and a raid on Africa. Both efforts ended in failure. . The Romans retreated from Lilybaeum, and the Roman African force was caught in another storm and destroyed.       The Romans, however, made great progress in the north. The city of Thermae was captured in 252 BC, enabling another advance on the port city of Panormus. The Romans attacked this city after taking Kephalodon in 251 BC. After fierce fighting, the Carthaginians were defeated and the city fell. With Panormus captured, much of western inland Sicily fell with it. The cities of ": null
    },
    {
        "Ietas": "Ietas"
    },
    {
        ", ": null
    },
    {
        "Solous": "Solous"
    },
    {
        ", Petra, and ": null
    },
    {
        "Tyndaris": "Tyndaris"
    },
    {
        " agreed to peace with the Romans that same year. .            The next year, the Romans shifted their attention to the north-west. They sent a naval expedition toward ": null
    },
    {
        "Lilybaeum": "Lilybaeum"
    },
    {
        ". En route, the Romans seized and burned the Carthaginian hold-out cities of ": null
    },
    {
        "Selinous": "Selinunte"
    },
    {
        " and ": null
    },
    {
        "Heraclea Minoa": "Heraclea Minoa"
    },
    {
        ". This expedition to Lilybaeum was not successful, but attacking the Carthaginian headquarters demonstrated Roman resolve to take all of Sicily. . The Roman fleet was defeated by the Carthaginians at ": null
    },
    {
        "Drepana": "Battle Of Drepana"
    },
    {
        ", forcing the Romans to continue their attacks from land. Roman forces at Lilybaeum were relieved, and ": null
    },
    {
        "Eryx": "Eryx"
    },
    {
        ", near Drepana, was seized thus menacing that important city as well. .     Following the conclusive naval victory off ": null
    },
    {
        "Drepana": "Battle Of Drepana"
    },
    {
        " in 249 BC, Carthage ruled the seas as Rome was unwilling to finance the construction of yet another expensive fleet. Nevertheless, the Carthaginian faction that opposed the conflict, led by the land-owning ": null
    },
    {
        "aristocrat": "Aristocracy"
    },
    {
        " Hanno the Great": "Hanno The Great"
    },
    {
        ", gained power and in 244 BC, considering the war to be over, started the ": null
    },
    {
        "demobilisation": "Demobilization"
    },
    {
        " of the fleet, giving the Romans a chance to again attain naval superiority. .                      At this point , Carthage sent general ": null
    },
    {
        "Hamilcar Barca": "Hamilcar Barca"
    },
    {
        "  to Sicily. His landing at Heirkte drew the Romans away to defend that port city and resupply point and gave Drepana some breathing room. Subsequent guerrilla warfare kept the Roman legions pinned down and preserved Carthages toehold in Sicily, although Roman forces which bypassed Hamilcar forced him to relocate to Eryx, to better defend Drepana.          Perhaps in response to Hamilcars raids, Rome built another fleet . It was this fleet that rendered the Carthaginian success in Sicily futile, as the stalemate Hamilcar produced in Sicily became irrelevant following the Roman naval victory at the ": null
    },
    {
        "Battle of the Aegates Islands": "Battle Of The Aegates Islands"
    },
    {
        " in 241 BC, where the new Roman fleet under consul ": null
    },
    {
        "Gaius Lutatius Catulus": "Gaius Lutatius Catulus"
    },
    {
        " was victorious over an undermanned and hastily built Carthaginian fleet. Carthage lost most of its fleet and was economically incapable of funding another, or of finding manpower for the crews. .     Without naval support, ": null
    },
    {
        "Hamilcar Barca": "Hamilcar Barca"
    },
    {
        " was cut off from Carthage and forced to negotiate peace and agree to evacuate Sicily. . Hamilcar Barca had a subordinate named Gesco conduct the negotiations with Lutatius, in order to create the impression that he had not really been defeated. .                 Due to the difficulty of operating in Sicily, most of the First Punic War was fought at sea, including the most decisive battles. But one reason the war bogged down into stalemate on the landward side was because ancient navies were ineffective at maintaining seaward blockades of enemy ports. Consequently, Carthage was able to reinforce and re-supply its besieged strongholds, especially Lilybaeum, on the western end of Sicily. Both sides of the conflict had publicly funded fleets. This fact compromised Carthage and Romes finances and eventually decided the course of the war. .     Despite the Roman victories at sea, the Roman Republic lost countless ships and crews during the war, due to both storms and battles. On at least two occasions , whole fleets were destroyed in bad weather; the disaster off Camarina in 255 BC counted 270 ships and 119,280 men lost, the greatest single loss in history. . One theory is that the weight of the corvus on the prows of the ships made the ships unstable and caused them to sink in bad weather. Later, as Roman experience in naval warfare grew, the corvus device was made attachable and detachable due to its impact on the navigability of the war vessels. .       Rome won the First Punic War after 23 years of conflict and in the end became the dominant naval power of the Mediterranean. In the aftermath of the war, both states were financially and demographically exhausted. Corsica, Sardinia and Africa remained Carthaginian, but they had to pay a high war indemnity. Romes victory was greatly influenced by its persistence. Moreover, the Roman Republics ability to attract private investments in the war effort to fund ships and crews was one of the deciding factors of the war, particularly when contrasted with the Carthaginian nobilitys apparent unwillingness to risk their fortunes for the common war effort.       The exact number of casualties on each side is difficult to determine, due to bias in the historical sources.     According to sources : Polybius. The Histories, .   Rome lost 700 ships with an unknown number of crew deaths.   Carthage lost 500 ships with an unknown number of crew deaths.     Although uncertain, the casualties were heavy for both sides. ": null
    },
    {
        "Polybius": "Polybius"
    },
    {
        " commented that the war was, at the time, the most destructive in terms of casualties in the history of warfare, including the battles of ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        ". Analysing the data from the Roman ": null
    },
    {
        "census": "Census"
    },
    {
        " of the 3rd century BC, ": null
    },
    {
        "Adrian Goldsworthy": "Adrian Goldsworthy"
    },
    {
        " noted that, during the conflict, Rome lost about 50,000 male citizens. This excludes auxiliary troops and every other man in the army without citizen status, who would be outside the head count. . .       The terms of the ": null
    },
    {
        "Treaty of Lutatius": "Treaty Of Lutatius"
    },
    {
        " designed by the Romans were particularly heavy for Carthage, which had lost bargaining power following its defeat at the ": null
    },
    {
        "Aegates islands": "Aegates Islands"
    },
    {
        ". Accordingly, Carthage agreed to:   evacuate Sicily and the small islands west of it .   return its prisoners of war without ransom, while paying a heavy ransom of their own.   refrain from attacking ": null
    },
    {
        "Syracuse": "Syracuse, Italy"
    },
    {
        " and her allies.   transfer a group of small islands north of Sicily  to Rome.   evacuate all of the small islands between Sicily and Africa .   pay a 2,200 ": null
    },
    {
        "talent": "Talent"
    },
    {
        "  of silver indemnity in ten annual instalments, plus an additional indemnity of 1,000 talents immediately. Polybius. The Histories, .     Further clauses determined that the allies of each side would not be attacked by the other, no attacks were to be made by either side upon the others allies and both sides were prohibited from recruiting soldiers within the territory of the other. This denied the Carthaginians access to any mercenary manpower from Italy and most of Sicily, although this later clause was temporarily abolished during the ": null
    },
    {
        "Mercenary War": "Mercenary War"
    },
    {
        ".          In the aftermath of the war, Carthage had insufficient state funds. Hanno the Great tried to induce the disbanded armies to accept diminished payment, but kindled a movement that led to an internal conflict, the ": null
    },
    {
        "Mercenary War": "Mercenary War"
    },
    {
        ". After a hard struggle from the combined efforts of ": null
    },
    {
        "Hamilcar Barca": "Hamilcar Barca"
    },
    {
        ", ": null
    },
    {
        "Hanno the Great": "Hanno The Great"
    },
    {
        " and others, the Punic forces were finally able to annihilate the mercenaries and the insurgents. However, during this conflict, Rome took advantage of the opportunity to strip Carthage of ": null
    },
    {
        "Corsica": "Corsica"
    },
    {
        " and ": null
    },
    {
        "Sardinia": "Sardinia"
    },
    {
        " as well.     Perhaps the most immediate political result of the First Punic War was the downfall of Carthages naval power. Conditions signed in the peace treaty were intended to compromise Carthages economic situation and prevent the citys recovery. The indemnity demanded by the Romans strained the citys finances and forced Carthage to look to other areas of influence for the money to pay Rome. .     Carthage, seeking to make up for the recent territorial losses and a plentiful source of silver to pay the large indemnity owed to Rome, turned its attention to ": null
    },
    {
        "Iberia": "Iberia"
    },
    {
        "; and in 237 BC, the Carthaginians, led by ": null
    },
    {
        "Hamilcar Barca": "Hamilcar Barca"
    },
    {
        ", began a series of campaigns to expand their control over the ": null
    },
    {
        "peninsula": "Peninsula"
    },
    {
        ". Though Hamilcar was killed in 229 BC, the offensive continued with the Carthaginians extending their power towards the ": null
    },
    {
        "Ebro valley": "Ebro Valley"
    },
    {
        " and founding ": null
    },
    {
        "New Carthage": "Cartagena, Spain"
    },
    {
        " in 228 BC. When Carthage besieged the Roman protected town of ": null
    },
    {
        "Saguntum": "Saguntum"
    },
    {
        " in 218 BC, it ignited the ": null
    },
    {
        "Second Punic War": "Second Punic War"
    },
    {
        " with Rome. .     As for Rome, the end of the First Punic War marked the start of Romes expansion beyond the Italian Peninsula. Sicily became the first ": null
    },
    {
        "Roman province": "Roman Province"
    },
    {
        "  governed by a former ": null
    },
    {
        "praetor": "Praetor"
    },
    {
        ", instead of an ally. Sicily would become very important to Rome as ": null
    },
    {
        "a source of grain": "Grain Supply To The City Of Rome"
    },
    {
        ". Importantly, ": null
    },
    {
        "Syracuse": "Syracuse, Italy"
    },
    {
        " was granted nominal independent ally status for the lifetime of ": null
    },
    {
        "Hiero II": "Hiero Ii Of Syracuse"
    },
    {
        ", and was not incorporated into the Roman province of Sicily until after it was ": null
    },
    {
        "sacked": "Siege Of Syracuse"
    },
    {
        " by ": null
    },
    {
        "Marcus Claudius Marcellus": "Marcus Claudius Marcellus"
    },
    {
        " during the Second Punic War. .       ": null
    },
    {
        "Adherbal": "Adherbal"
    },
    {
        ", Carthaginian leading admiral   ": null
    },
    {
        "Appius Claudius Caudex": "Appius Claudius Caudex"
    },
    {
        ", Roman consul   ": null
    },
    {
        "Aulus Atilius Calatinus": "Aulus Atilius Calatinus"
    },
    {
        ", Roman dictator   ": null
    },
    {
        "Gaius Duilius": "Gaius Duilius"
    },
    {
        ", Roman consul   ": null
    },
    {
        "Gaius Lutatius Catulus": "Gaius Lutatius Catulus"
    },
    {
        ", Roman consul   ": null
    },
    {
        "Gnaeus Cornelius Scipio Asina": "Gnaeus Cornelius Scipio Asina"
    },
    {
        ", Roman consul   ": null
    },
    {
        "Hamilcar Barca": "Hamilcar Barca"
    },
    {
        ", Carthaginian leading general   ": null
    },
    {
        "Hannibal Gisco": "Hannibal Gisco"
    },
    {
        ", Carthaginian general   ": null
    },
    {
        "Hanno the Great": "Hanno The Great"
    },
    {
        ", Carthaginian leading politician   ": null
    },
    {
        "Hasdrubal the Fair": "Hasdrubal The Fair"
    },
    {
        ", Carthaginian general   ": null
    },
    {
        "Hiero II, tyrant of Syracuse": "Hiero Ii Of Syracuse"
    },
    {
        " Lucius Caecilius Metellus": "Lucius Caecilius Metellus"
    },
    {
        ", Roman consul   ": null
    },
    {
        "Marcus Atilius Regulus": "Marcus Atilius Regulus"
    },
    {
        ", Roman consul   ": null
    },
    {
        "Publius Claudius Pulcher": "Publius Claudius Pulcher"
    },
    {
        ", Roman consul   ": null
    },
    {
        "Xanthippus": "Xanthippus Of Carthage"
    },
    {
        ", Spartan mercenary in the service of Carthage   ": null
    },
    {
        "Hannibal the Rhodian": "Hannibal The Rhodian"
    },
    {
        ", Carthaginian privateer       264 BC263 BC": null
    },
    {
        "Manius Valerius Messalla": "Manius Valerius Messalla"
    },
    {
        " and is forced to change allegiance to Rome, which recognises his position as King of Syracuse and the surrounding territory.   262 BC": null
    },
    {
        "Agrigentum": "Agrigentum"
    },
    {
        ", occupied by Carthage, is besieged.   261 BC": null
    },
    {
        "Battle of Agrigentum": "Battle Of Agrigentum"
    },
    {
        ", which results in a Roman victory and capture of the city. Rome decides to build a fleet to threaten Carthaginian domination at sea.   260 BC is a disaster for Rome, but soon afterwards, ": null
    },
    {
        "Gaius Duilius": "Gaius Duilius"
    },
    {
        " wins the ": null
    },
    {
        "battle of Mylae": "Battle Of Mylae"
    },
    {
        " with the help of the  corvus  engine.   259 BC": null
    },
    {
        "Sardinia": "Sardinia"
    },
    {
        " and ": null
    },
    {
        "Corsica": "Corsica"
    },
    {
        ".   258 BC": null
    },
    {
        "Battle of Sulci": "Battle Of Sulci"
    },
    {
        "257 BC": null
    },
    {
        "Battle of Tyndaris": "Battle Of Tyndaris"
    },
    {
        "256 BC": null
    },
    {
        "Battle of Cape Ecnomus": "Battle Of Cape Ecnomus"
    },
    {
        " is a major victory for Rome, which lands in Africa and advances on Carthage. The ": null
    },
    {
        "Battle of Adys": "Battle Of Adys"
    },
    {
        " is the first Roman success on African soil and Carthage sues for peace. Negotiations fail to reach agreement and the war continues.   255 BC": null
    },
    {
        "Sparta": "Sparta"
    },
    {
        "n general, ": null
    },
    {
        "Xanthippus": "Xanthippus Of Carthage"
    },
    {
        ", to organise their defences and defeat the Romans at the ": null
    },
    {
        "Battle of Tunis": "Battle Of Tunis"
    },
    {
        ". The Roman survivors are evacuated by a fleet to be destroyed soon afterwards, on their way back to Sicily.   254 BC": null
    },
    {
        "Panormus": "Battle Of Panormus"
    },
    {
        ", in Sicily, but fail to make any further progress in the war. Five Greek cities in Sicily defect from Carthage to Rome.   253 BC251 BC": null
    },
    {
        "Panormus": "Palermo"
    },
    {
        " over the Carthaginians, led by Hasdrubal. As a result of the recent losses, Carthage endeavours to strengthen its garrisons in Sicily and recapture Agrigentum. Romans begin siege of ": null
    },
    {
        "Lilybaeum": "Lilybaeum"
    },
    {
        ".   249 BC": null
    },
    {
        "Battle of Drepana": "Battle Of Drepana"
    },
    {
        ". In the same year ": null
    },
    {
        "Hamilcar Barca": "Hamilcar Barca"
    },
    {
        " accomplishes successful raids in Sicily and yet another storm destroys the remainder of the Roman ships. ": null
    },
    {
        "Aulus Atilius Calatinus": "Aulus Atilius Calatinus"
    },
    {
        " is appointed dictator and sent to Sicily.   248 BC244 BC": null
    },
    {
        "Hanno the Great": "Hanno The Great"
    },
    {
        " of Carthage advocates the demobilisation of large parts of the Carthaginian navy to save money. Carthage does so.   242 BC241 BC": null
    },
    {
        "Battle of the Aegates Islands": "Battle Of The Aegates Islands"
    }
]