[
    {
        "     The First Vatican Council  was convoked by ": null
    },
    {
        "Pope Pius IX": "Pope Pius Ix"
    },
    {
        " on 29 June 1868, after a period of planning and preparation that began on 6 December 1864. This, the twentieth ": null
    },
    {
        "ecumenical council": "Ecumenical Council"
    },
    {
        " of the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        ", held three centuries after the ": null
    },
    {
        "Council of Trent": "Council Of Trent"
    },
    {
        ", opened on 8 December 1869 and adjourned on 20 October 1870. Unlike the five earlier general councils held in ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ", which met in the ": null
    },
    {
        "Lateran Basilica": "Archbasilica Of St. John Lateran"
    },
    {
        " and are known as ": null
    },
    {
        "Lateran councils": "Lateran Council"
    },
    {
        ", it met in the ": null
    },
    {
        "Vatican Basilica": "Saint Peters Basilica"
    },
    {
        ", hence its name. Its best-known decision is its definition of ": null
    },
    {
        "papal infallibility": "Papal Infallibility"
    },
    {
        ".     The council was convoked to deal with the contemporary problems of the rising influence of ": null
    },
    {
        "rationalism": "Rationalism"
    },
    {
        ", ": null
    },
    {
        "liberalism": "Liberalism"
    },
    {
        ", and ": null
    },
    {
        "materialism": "Materialism"
    },
    {
        ". Its purpose was, besides this, to define the ": null
    },
    {
        "Catholic doctrine": "Catholic Doctrine"
    },
    {
        " concerning the Church of Christ. There was discussion and approval of only two constitutions: the Dogmatic Constitution on the Catholic Faith  and the First Dogmatic Constitution on the Church of Christ , the latter dealing with the ": null
    },
    {
        "primacy": "Papal Primacy"
    },
    {
        " and ": null
    },
    {
        "infallibility": "Papal Infallibility"
    },
    {
        " of the ": null
    },
    {
        "Bishop of Rome": "Bishop Of Rome"
    },
    {
        ". The first matter brought up for debate was the dogmatic draft of Catholic doctrine against the manifold errors due to rationalism. The Council condemned rationalism, liberalism, naturalism, materialism and pantheism. The Catholic Church was on the defensive against the main ideology of the 19th century.       This council was summoned by ": null
    },
    {
        "Pope Pius IX": "Pope Pius Ix"
    },
    {
        " by a ": null
    },
    {
        "bull": "Papal Bull"
    },
    {
        " on 29 June 1868. The first session was held in ": null
    },
    {
        "St. Peters Basilica": "St. Peters Basilica"
    },
    {
        " on 8 December 1869. Preliminary sessions dealt with general administrative matters and committee assignments. ": null
    },
    {
        "Bishop": "Bishop In The Catholic Church"
    },
    {
        " Bernard John McQuaid": "Bernard John Mcquaid"
    },
    {
        " complained of rainy weather, inadequate heating facilities, and boredom.  Bishop ": null
    },
    {
        "James Roosevelt Bayley": "James Roosevelt Bayley"
    },
    {
        " of Newark, New Jersey, noted the high prices in Rome. When ": null
    },
    {
        "Lord Houghton": "Richard Monckton Milnes, 1St Baron Houghton"
    },
    {
        " asked ": null
    },
    {
        "Cardinal Manning": "Henry Edward Manning"
    },
    {
        " what had been going on, he answered: “Well, we meet, and we look at one another, and then we talk a little, but when we want to know what we have been doing, we read ": null
    },
    {
        "the Times": "The Times"
    },
    {
        "”.             The doctrine of ": null
    },
    {
        "papal infallibility": "Papal Infallibility"
    },
    {
        " was not new and had been used by Pope Pius in defining as dogma, in 1854, the ": null
    },
    {
        "Immaculate Conception": "Immaculate Conception"
    },
    {
        " of ": null
    },
    {
        "Mary, the mother of Jesus": "Mary, Mother Of Jesus"
    },
    {
        ". However, the proposal to define papal infallibility itself as dogma met with resistance, not because of doubts about the substance of the proposed definition, but because some considered it inopportune to take that step at that time. ": null
    },
    {
        "Richard McBrien": "Richard Mcbrien"
    },
    {
        " divides the bishops attending Vatican I into three groups. The first group, which McBrien calls the active infallibilists , was led by ": null
    },
    {
        "Henry Edward Manning": "Henry Edward Manning"
    },
    {
        " and ": null
    },
    {
        "Ignatius von Senestréy": "Ignatius Von Senestréy"
    },
    {
        ". According to McBrien, the majority of the bishops were not so much interested in a formal definition of papal infallibility as they were in strengthening papal authority and, because of this, were willing to accept the agenda of the infallibilists. A minority, some 10 per cent of the bishops, McBrien says, opposed the proposed definition of papal infallibility on both ecclesiastical and pragmatic grounds, because, in their opinion, it departed from the ecclesiastical structure of the ": null
    },
    {
        "early Christian": "Early Christianity"
    },
    {
        " church. From a pragmatic perspective, they feared that defining papal infallibility would alienate some Catholics, create new difficulties for union with non-Catholics, and provoke interference by governments in ecclesiastical affairs. Those who held this view included most of the German and Austro-Hungarian bishops, nearly half of the Americans, one third of the French, most of the ": null
    },
    {
        "Chaldaeans": "Chaldean Catholic Church"
    },
    {
        " and ": null
    },
    {
        "Melkites": "Melkite Greek Catholic Church"
    },
    {
        ", and a few ": null
    },
    {
        "Armenians": "Armenian Catholic Church"
    },
    {
        ". Only a few bishops appear to have had doubts about the dogma itself.         On 24 April 1870, the dogmatic constitution on the Catholic faith  was adopted unanimously. The draft presented to the council on 8 March drew no serious criticism, but a group of 35 English-speaking bishops, who feared that the opening phrase of the first chapter,  , might be construed as favouring the ": null
    },
    {
        "Anglican": "Anglicanism"
    },
    {
        " branch theory": "Branch Theory"
    },
    {
        ", later succeeded in having an additional adjective inserted, so that the final text read:  . The constitution thus set forth the teaching of the Holy Catholic Apostolic Roman Church on God, revelation and faith.                There was stronger opposition to the draft constitution on the nature of the church, which at first did not include the question of papal infallibility, but the majority party in the council, whose position on this matter was much stronger, brought it forward. It was decided to postpone discussion of everything in the draft except infallibility. The decree did not go forward without controversy; Cardinal , Archbishop of Bologna, proposed adding that the pope is assisted by the counsel of the bishops manifesting the tradition of the churches . Pius IX rejected Guidis view of the bishops as witnesses to the tradition, maintaining: I am the tradition.      On 13 July 1870, a preliminary vote on the section on infallibility was held in a general congregation: 451 voted simply in favour , 88 against , and 62 in favour but on condition of some amendment . This made evident what the final outcome would be, and some 60 members of the opposition left Rome so as not to be associated with approval of the document. The final vote, with a choice only between  and , was taken on 18 July 1870, with 433 votes in favour and only 2 against defining as a dogma the infallibility of the pope when speaking . The two votes in opposition were cast by Bishops ": null
    },
    {
        "Aloisio Riccio": "Aloisio Riccio"
    },
    {
        " and ": null
    },
    {
        "Edward Fitzgerald": "Edward Fitzgerald"
    },
    {
        ".     The dogmatic constitution states, in chapter 4:9, that the Pope has full and supreme power of jurisdiction over the whole Church ; and that, when he:        None of the bishops who had argued that proclaiming the definition was inopportune refused to accept it. Some Catholics, mainly of German language and largely inspired by the historian ": null
    },
    {
        "Ignaz von Döllinger": "Ignaz Von Döllinger"
    },
    {
        ", formed the separate ": null
    },
    {
        "Old Catholic Church": "Old Catholic Church"
    },
    {
        " in protest; von Döllinger did not formally join the new group himself.            Discussion of the rest of the document on the nature of the church was to continue when the bishops returned after a summer break. However, in the meanwhile the ": null
    },
    {
        "Franco-Prussian War": "Franco-Prussian War"
    },
    {
        " broke out. With the swift German advance and the capture of ": null
    },
    {
        "Emperor Napoleon III": "Napoleon Iii"
    },
    {
        ", French troops protecting papal rule in Rome withdrew from the city.     Consequently, on 20 September 1870, one month after the Kingdom of Italy ": null
    },
    {
        "had occupied Rome": "Capture Of Rome"
    },
    {
        ", Pope Pius IX, who then considered himself a prisoner in the Vatican, issued the bull , adjourning the council indefinitely. While some proposed to continue the council in the Belgian city of ": null
    },
    {
        "Mechlin": "Mechlin"
    },
    {
        ", it was never reconvened. The council was formally closed in 1960, prior to the formation of the ": null
    },
    {
        "Second Vatican Council": "Second Vatican Council"
    },
    {
        ". ": null
    }
]