[
    {
        "              The five precepts  or five rules of training  is the most important system of morality for ": null
    },
    {
        "Buddhist lay people": "Upāsaka And Upāsikā"
    },
    {
        ". They constitute the basic code of ": null
    },
    {
        "ethics": "Buddhist Ethics"
    },
    {
        " to be undertaken by lay followers of Buddhism. The precepts are commitments to abstain from killing ": null
    },
    {
        "living beings": "Sentient Being"
    },
    {
        ", stealing, sexual misconduct, lying and intoxication. Within the Buddhist doctrine, they are meant to develop mind and character to make progress on the path to ": null
    },
    {
        "enlightenment": "Enlightenment"
    },
    {
        ". They are sometimes referred to as the  śrāvakayāna precepts in the ": null
    },
    {
        "Mahāyāna": "Mahāyāna"
    },
    {
        " tradition, contrasting them with the ": null
    },
    {
        "bodhisattva precepts": "Bodhisattva Precepts"
    },
    {
        ". The five precepts form the basis of several parts of Buddhist doctrine, both lay and monastic. With regard to their fundamental role in Buddhist ethics, they have been compared with the ": null
    },
    {
        "ten commandments": "Ten Commandments"
    },
    {
        " in ": null
    },
    {
        "Abrahamic religions": "Abrahamic Religions"
    },
    {
        " or the ": null
    },
    {
        "ethical codes": "Li"
    },
    {
        " of ": null
    },
    {
        "Confucianism": "Confucianism"
    },
    {
        ". The precepts have been connected with ": null
    },
    {
        "utilitarianist": "Utilitarianist"
    },
    {
        ", ": null
    },
    {
        "deontological": "Deontological"
    },
    {
        " and ": null
    },
    {
        "virtue": "Virtue Ethics"
    },
    {
        " approaches to ethics, though by 2017, such categorization by western terminology had mostly been abandoned by scholars. The precepts have been compared with human rights because of their universal nature, and some scholars argue they can complement the concept of human rights.     The five precepts were common to the religious milieu of 6th-century BCE India, but the Buddhas focus on ": null
    },
    {
        "awareness": "Appamada"
    },
    {
        " through the fifth precept was unique. As shown in ": null
    },
    {
        "Early Buddhist Texts": "Early Buddhist Texts"
    },
    {
        ", the precepts grew to be more important, and finally became a condition for membership of the Buddhist religion. When Buddhism spread to different places and people, the role of the precepts began to vary. In countries where Buddhism had to compete with other religions, such as China, the ritual of undertaking the five precepts developed into an initiation ceremony to become a Buddhist lay person. On the other hand, in countries with little competition from other religions, such as Thailand, the ceremony has had little relation to the rite of becoming Buddhist, as many people are presumed Buddhist from birth.     Undertaking and upholding the five precepts is based on the principle of ": null
    },
    {
        "non-harming": "Ahimsa"
    },
    {
        " . The ": null
    },
    {
        "Pali Canon": "Pali Canon"
    },
    {
        " recommends one to compare oneself with others, and on the basis of that, not to hurt others. Compassion and a belief in ": null
    },
    {
        "karmic retribution": "Karma"
    },
    {
        " form the foundation of the precepts. Undertaking the five precepts is part of regular lay devotional practice, both at home and at the local temple. However, the extent to which people keep them differs per region and time. People keep them with an intention to develop themselves, but also out of fear of a ": null
    },
    {
        "bad rebirth": "Buddhist Cosmology"
    },
    {
        ".     The first precept consists of a prohibition of killing, both humans and all animals. Scholars have interpreted Buddhist texts about the precepts as an opposition to and prohibition of capital punishment, suicide, abortion and euthanasia. In practice, however, many Buddhist countries still use the death penalty. With regard to abortion, Buddhist countries take the middle ground, by condemning though not prohibiting it. The Buddhist attitude to violence is generally interpreted as opposing all warfare, but some scholars have raised exceptions. The second precept prohibits theft. The third precept refers to adultery in all its forms, and has been defined by modern teachers with terms such as sexual responsibility and long-term commitment. The fourth precept involves falsehood spoken or committed to by action, as well as malicious speech, harsh speech and gossip. The fifth precept prohibits intoxication through alcohol, drugs or other means. Early Buddhist Texts nearly always condemn alcohol, and so do Chinese Buddhist post-canonical texts. Buddhist attitudes toward smoking differ per time and region, but are generally permissive. In modern times, traditional Buddhist countries have seen revival movements to promote the five precepts. As for the West, the precepts play a major role in Buddhist organizations. They have also been integrated in ": null
    },
    {
        "mindfulness": "Mindfulness"
    },
    {
        " training programs, though many mindfulness specialists do not support this because of the precepts religious import. Lastly, many conflict prevention programs make use of the precepts.          Buddhist scriptures explain the five precepts as the minimal standard of Buddhist morality. It is the most important system of morality in Buddhism, together with the ": null
    },
    {
        "monastic rules": "Patimokkha"
    },
    {
        ".   Śīla   is used to refer to Buddhist precepts, including the five. But the word also refers to the virtue and morality which lies at the foundation of the spiritual path to ": null
    },
    {
        "enlightenment": "Enlightenment"
    },
    {
        ", which is the first of the ": null
    },
    {
        "three forms of training": "Three Trainings"
    },
    {
        " on the path. Thus, the precepts are rules or guidelines to develop mind and character to make progress on the path to ": null
    },
    {
        "enlightenment": "Enlightenment"
    },
    {
        ". The five precepts are part of the right speech, action and livelihood aspects of the ": null
    },
    {
        "Noble Eightfold Path": "Noble Eightfold Path"
    },
    {
        ", the core teaching of Buddhism. Moreover, the practice of the five precepts and other parts of śīla are described as forms of ": null
    },
    {
        "merit-making": "Merit-Making"
    },
    {
        ", means to create good ": null
    },
    {
        "karma": "Karma"
    },
    {
        ". The five precepts have been described as ": null
    },
    {
        "social values": "Value"
    },
    {
        " that bring harmony to society, and breaches of the precepts described as antithetical to a harmonious society. On a similar note, in Buddhist texts, the ideal, righteous society is one in which people keep the five precepts.     Comparing different parts of Buddhist doctrine, the five precepts form the basis of the ": null
    },
    {
        "eight precepts": "Eight Precepts"
    },
    {
        ", which are lay precepts stricter than the five precepts, similar to monastic precepts. Secondly, the five precepts form the first half of the ": null
    },
    {
        "ten or eleven precepts": "Bodhisattva Precepts"
    },
    {
        " for a ": null
    },
    {
        "person aiming to become a Buddha": "Bodhisattva"
    },
    {
        " , as mentioned in the  Brahmajala Sūtra  of the Mahāyāna tradition. Contrasting these precepts with the five precepts, the latter were commonly referred to by Mahāyānists as the  śrāvakayāna  precepts, or the precepts of those aiming to become ": null
    },
    {
        "enlightened disciples": "Arhat"
    },
    {
        "  of a Buddha, but not ": null
    },
    {
        "Buddhas": "Buddha"
    },
    {
        " themselves. The teneleven bodhisattva precepts presuppose the five precepts, and are partly based on them. The five precepts are also partly found in the teaching called the ten good courses of action, referred to in ": null
    },
    {
        "Theravāda": "Theravāda"
    },
    {
        "  and ": null
    },
    {
        "Tibetan Buddhism": "Tibetan Buddhism"
    },
    {
        " .  Finally, the first four of the five precepts are very similar to the ": null
    },
    {
        "most fundamental rules of monastic discipline": "Parajika"
    },
    {
        " , and may have influenced their development.     In conclusion, the five precepts lie at the foundation of all Buddhist practice, and in that respect, can be compared with the ": null
    },
    {
        "ten commandments": "Ten Commandments"
    },
    {
        " in Christianity and Judaism or the ": null
    },
    {
        "ethical codes": "Li"
    },
    {
        " of ": null
    },
    {
        "Confucianism": "Confucianism"
    },
    {
        ".       The five precepts were part of ": null
    },
    {
        "early Buddhism": "Early Buddhism"
    },
    {
        " and are common to nearly all schools of Buddhism. In early Buddhism, the five precepts were regarded as an ethic of restraint, to restrain unwholesome tendencies and thereby purify ones being to attain enlightenment. The five precepts were based on the pañcaśīla, prohibitions for pre-Buddhist ": null
    },
    {
        "Brahmanic": "Brahmanic"
    },
    {
        " priests, which were adopted in many Indic religions around 6th century BCE. The first four Buddhist precepts were nearly identical to these pañcaśīla, but the fifth precept, the prohibition on intoxication, was new in Buddhism: the Buddhas emphasis on ": null
    },
    {
        "awareness": "Appamada"
    },
    {
        "  was unique.     In some schools of ancient Indic Buddhism, Buddhist devotees could choose to adhere to only a number of precepts, instead of the complete five. The schools that would survive in later periods, however, that is Theravāda and Mahāyāna Buddhism, were both ambiguous about this practice. Some early Mahāyāna texts allow it, but some do not; ": null
    },
    {
        "Theravāda texts": "Pāli Canon"
    },
    {
        " do not discuss this practice at all.     The prohibition on killing had motivated ": null
    },
    {
        "early Buddhists": "Early Buddhism"
    },
    {
        " to form a stance against animal sacrifice, a common ritual practice in ancient India.  According to the Pāli Canon, however, early Buddhists did not adopt a vegetarian lifestyle.     In ": null
    },
    {
        "Early Buddhist Texts": "Early Buddhist Texts"
    },
    {
        ", the role of the five precepts gradually develops. First of all, the precepts are combined with a declaration of faith in the triple gem . Next, the precepts develop to become the foundation of lay practice.  The precepts are seen as a preliminary condition for the higher development of the mind. At a third stage in the texts, the precepts are actually mentioned together with the triple gem, as though they are part of it. Lastly, the precepts, together with the triple gem, become a required condition for the practice of Buddhism, as lay people have to undergo a formal initiation to become a member of the Buddhist religion. When Buddhism spread to different places and people, the role of the precepts began to vary. In countries in which Buddhism was adopted as the main religion without much competition from other religious disciplines, such as Thailand, the relation between the initiation of a lay person and the five precepts has been virtually non-existent. In such countries, the taking of the precepts has become a sort of ritual cleansing ceremony. People are presumed Buddhist from birth without much of an initiation. The precepts are often committed to by new followers as part of their installment, yet this is not very pronounced. However, in some countries like China, where Buddhism was not the only religion, the precepts became an ordination ceremony to initiate lay people into the Buddhist religion.      In China, the five precepts were introduced in the first centuries CE, both in their śrāvakayāna and bodhisattva formats.  During this time, it was particularly Buddhist teachers who promoted abstinence from alcohol , since ": null
    },
    {
        "Daoism": "Daoism"
    },
    {
        " and other thought systems emphasized moderation rather than full abstinence. Chinese Buddhists interpreted the fifth precept strictly, even more so than in Indic Buddhism. For example, the monk ": null
    },
    {
        "Daoshi": "Daoshi"
    },
    {
        "  dedicated large sections of ": null
    },
    {
        "his encyclopedic writings": "Fayuan Zhulin"
    },
    {
        " to abstinence from alcohol. However, in some parts of China, such as ": null
    },
    {
        "Dunhuang": "Dunhuang"
    },
    {
        ", considerable evidence has been found of alcohol consumption among both lay people and monastics. Later, from the 8th century onward, strict attitudes of abstinence led to a development of a distinct ": null
    },
    {
        "tea culture": "Chinese Tea Culture"
    },
    {
        " among Chinese monastics and lay intellectuals, in which tea gatherings replaced gatherings with alcoholic beverages, and were advocated as such.  These strict attitudes were formed partly because of the religious writings, but may also have been affected by the bloody ": null
    },
    {
        "An Lushan Rebellion": "An Lushan Rebellion"
    },
    {
        " of 775, which had a sobering effect on ": null
    },
    {
        "8th-century Chinese society": "Tang Dynasty"
    },
    {
        ". When the five precepts were integrated in Chinese society, they were associated and connected with karma, ": null
    },
    {
        "Chinese cosmology": "Wu Xing"
    },
    {
        " and ": null
    },
    {
        "medicine": "Chinese Medicine"
    },
    {
        ", a Daoist worldview, and ": null
    },
    {
        "Confucian virtue ethics": "Confucianismsocial Morality And Ethics"
    },
    {
        ".             In the Theravāda tradition, the precepts are recited in a standardized fashion, using ": null
    },
    {
        "Pāli language": "Pāli Language"
    },
    {
        ". In Thailand, a leading lay person will normally request the monk to administer the precepts by reciting the following three times:          After this, the monk administering the precepts will recite a reverential line of text to introduce the ceremony, after which he guides the lay people in declaring that they take their refuge in the three refuges or triple gem.     He then continues with reciting the five precepts:   I undertake the training-precept to abstain from onslaught on breathing beings.    I undertake the training-precept to abstain from taking what is not given.    I undertake the training-precept to abstain from misconduct concerning sense-pleasures.    I undertake the training-precept to abstain from false speech.    I undertake the training-precept to abstain from alcoholic drink or drugs that are an opportunity for heedlessness.      After the lay people have repeated the five precepts after the monk, the monk will close the ceremony reciting:                  The format of the ceremony for taking the precepts occurs several times in the ": null
    },
    {
        "Chinese Buddhist Canon": "Chinese Buddhist Canon"
    },
    {
        ", in slightly different forms.      One formula of the precepts can be found in the Treatise on Taking Refuge and the Precepts      Similarly, in the ": null
    },
    {
        "Mūla-Sarvāstivāda": "Mulasarvastivada"
    },
    {
        " texts used in Tibetan Buddhism, the precepts are formulated such that one takes the precepts upon oneself for ones entire lifespan, following the examples of the enlightened disciples of the Buddha .             The five precepts can be found in many places in the Early Buddhist Texts. The precepts are regarded as means to building good character, or as an expression of such character. The Pāli Canon describes them as means to avoid harm to oneself and others. It further describes them as gifts toward oneself and others. Moreover, the texts say that people who uphold them will be confident in any gathering of people,  will have wealth and a good reputation, and will die a peaceful death, reborn in heaven or as a ": null
    },
    {
        "human being": "Human Beings In Buddhism"
    },
    {
        ". On the other hand, living a life in violation of the precepts is believed to lead to rebirth in an ": null
    },
    {
        "unhappy destination": "Naraka"
    },
    {
        ". They are understood as principles that define a person as human in body and mind.     The precepts are normative rules, but are formulated and understood as undertakings  rather than commandments enforced by a moral authority, according to the voluntary and ": null
    },
    {
        "gradualist": "Gradualismbuddhism And Other Oriental Philosophies"
    },
    {
        " standards of Buddhist ethics. They are forms of restraint formulated in negative terms, but are also accompanied by virtues and positive behaviors, which are cultivated through the practice of the precepts. The most important of these virtues is ": null
    },
    {
        "non-harming": "Ahimsa"
    },
    {
        " ,   which underlies all of the five precepts. Precisely, the texts say that one should keep the precepts, adhering to the principle of comparing oneself with others:        In other words, all living beings are alike in that they want to be happy and not suffer. Comparing oneself with others, one should therefore not hurt others as one would not want to be hurt. Ethicist Pinit Ratanakul argues that the compassion which motivates upholding the precepts comes from an understanding that all living beings are equal and of a nature that they are ": null
    },
    {
        "not-self": "Anatman"
    },
    {
        " . Another aspect that is fundamental to this is the belief in karmic retribution.      In the upholding or violation of the precepts, ": null
    },
    {
        "intention": "Cetana"
    },
    {
        " is crucial. In the Pāli scriptures, an example is mentioned of a person stealing an animal only to ": null
    },
    {
        "set it free": "Life Release"
    },
    {
        ", which was not seen as an ": null
    },
    {
        "offense of theft": "Parajika"
    },
    {
        ". In the Pāli ": null
    },
    {
        "commentaries": "Atthakatha"
    },
    {
        ", a precept is understood to be violated when the person violating it finds the object of the transgression , is aware of the violation, has the intention to violate it, does actually act on that intention, and does so successfully.     Upholding the precepts is sometimes distinguished in three levels: to uphold them without having formally undertaken them; to uphold them formally, willing to sacrifice ones own life for it; and finally, to spontaneously uphold them. The latter refers to the arahant, who is understood to be morally incapable of violating the first four precepts. A layperson who upholds the precepts is described in the texts as a jewel among laymen . On the other hand, the most serious violations of the precepts are the ": null
    },
    {
        "five actions of immediate retribution": "Anantarika-Karma"
    },
    {
        ", which are believed to lead the perpetrator to an unavoidable rebirth in ": null
    },
    {
        "hell": "Hell"
    },
    {
        ". These consist of injuring a Buddha, killing an arahant, killing ones father or mother, and causing the monastic community to have a schism.       Lay followers often undertake these training rules in the same ceremony as they ": null
    },
    {
        "take the refuges": "Taking Refuge"
    },
    {
        ".  Monks administer the precepts to the laypeople, which creates an additional psychological effect. Buddhist lay people may recite the precepts regularly at home, and before an important ceremony at the temple to prepare the mind for the ceremony.      The five precepts are at the core of Buddhist morality. In field studies in some countries like Sri Lanka, villagers describe them as the core of the religion. Anthropologist  found in his fieldwork that most Thai villagers knew the precepts by heart, and many, especially the elderly, could explain the implications of the precepts following traditional interpretations.     Nevertheless, Buddhists do not all follow them with the same strictness. Devotees who have just started keeping the precepts will typically have to exercise considerable restraint. When they become used to the precepts, they start to embody them more naturally. Researchers doing field studies in traditional Buddhist societies have found that the five precepts are generally considered demanding and challenging. For example, anthropologist ": null
    },
    {
        "Stanley Tambiah": "Stanley Tambiah"
    },
    {
        " found in his field studies that strict observance of the precepts had little positive interest for the villager ... not because he devalues them but because they are not normally open to him . Observing precepts was seen to be mostly the role of a monk or an elderly lay person. More recently, in a 1997 survey in Thailand, only 13.8% of the respondents indicated they adhered to the five precepts in their daily lives, with the fourth and fifth precept least likely to be adhered to. Yet, people do consider the precepts worth striving for, and do uphold them out of fear of bad karma and being reborn in ": null
    },
    {
        "hell": "Hell"
    },
    {
        ", or because they believe in that the Buddha issued these rules, and that they therefore should be maintained. Anthropologist ": null
    },
    {
        "Melford Spiro": "Melford Spiro"
    },
    {
        " found that Burmese Buddhists mostly upheld the precepts to avoid bad karma, as opposed to expecting to gain good karma. Scholar of religion Winston King observed from his field studies that the moral principles of Burmese Buddhists were based on personal self-developmental motives rather than other-regarding motives. Scholar of religion Richard Jones concludes that the moral motives of Buddhists in adhering to the precepts are based on the idea that renouncing self-service, ironically, serves oneself.     In East Asian Buddhism, the precepts are intrinsically connected with the initiation as a Buddhist lay person. Early Chinese translations such as the Upāsaka-śila Sūtra hold that the precepts should only be ritually transmitted by a monastic. The texts describe that in the ritual the power of the Buddhas and bodhisattvas is transmitted, and helps the initiate to keep the precepts. This lay ordination ritual usually occurs after a stay in a temple, and often after a ": null
    },
    {
        "monastic ordination": "Upasampada"
    },
    {
        " ; has taken place. The ordained lay person is then given a ": null
    },
    {
        "religious name": "Dharma Name"
    },
    {
        ". The restrictions that apply are similar to a monastic ordination, such as permission from parents.     In the Theravāda tradition, the precepts are usually taken each separately , to indicate that if one precept should be broken, the other precepts are still intact. In very solemn occasions, or for very pious devotees, the precepts may be taken as a group rather than each separately. This does not mean, however, that only some of the precepts can be undertaken; they are always committed to as a complete set. In East Asian Buddhism, however, the vow of taking the precepts is considered a solemn matter, and it is not uncommon for lay people to undertake only the precepts that they are confident they can keep. The act of taking a vow to keep the precepts is what makes it karmically effective: Spiro found that someone who did not violate the precepts, but did not have any intention to keep them either, was not believed to accrue any religious merit. On the other hand, when people took a vow to keep the precepts, and then broke them afterwards, the negative karma was considered larger than in the case no vow was taken to keep the precepts.     Several modern teachers such as ": null
    },
    {
        "Thich Nhat Hanh": "Thich Nhat Hanh"
    },
    {
        " and ": null
    },
    {
        "Sulak Sivaraksa": "Sulak Sivaraksa"
    },
    {
        " have written about the five precepts in a wider scope, with regard to social and institutional relations. In these perspectives, mass production of weapons or spreading untruth through media and education also violates the precepts.  On a similar note, human rights organizations in Southeast Asia have attempted to advocate respect for human rights by referring to the five precepts as guiding principles.            The first precept prohibits the taking of life of a ": null
    },
    {
        "sentient being": "Sentient Being"
    },
    {
        ". It is violated when someone intentionally and successfully kills such a sentient being, having understood it to be sentient and using effort in the process.  Causing injury goes against the spirit of the precept, but does, technically speaking, not violate it. The first precept includes taking the lives of animals, even small insects. However, it has also been pointed out that the seriousness of taking life depends on the size, intelligence, benefits done and the spiritual attainments of that living being. Killing a large animal is worse than killing a small animal ; killing a spiritually accomplished master is regarded as more severe than the killing of another more average human being; and killing a human being is more severe than the killing an animal. But all killing is condemned.  Virtues that accompany this precept are respect for dignity of life, ": null
    },
    {
        "kindness": "Metta"
    },
    {
        " and ": null
    },
    {
        "compassion": "Karuṇā"
    },
    {
        ", the latter expressed as trembling for the welfare of others . A positive behavior that goes together with this precept is protecting living beings. Positive virtues like sympathy and respect for other living beings in this regard are based on a belief in the ": null
    },
    {
        "cycle of rebirth": "Samsara"
    },
    {
        "that all living beings must be born and reborn. The concept of the fundamental ": null
    },
    {
        "Buddha nature": "Buddha Nature"
    },
    {
        " of all human beings also underlies the first precept.     The description of the first precept can be interpreted as a prohibition of capital punishment. Suicide is also seen as part of the prohibition. Moreover, abortion goes against the precept, since in an act of abortion, the criteria for violation are all met.  In Buddhism, human life is understood to start at conception. A prohibition of abortion is mentioned explicitly in the monastic precepts, and several Buddhist tales warn of the harmful ": null
    },
    {
        "karmic": "Karma"
    },
    {
        " consequences of abortion.  Bioethicist ": null
    },
    {
        "Damien Keown": "Damien Keown"
    },
    {
        " argues that Early Buddhist Texts do not allow for exceptions with regard to abortion, as they consist of a consistent pro-life position . Keown further proposes that a middle way approach to the five precepts is logically hard to defend. Asian studies scholar Giulo Agostini argues, however, that Buddhist commentators in India from the 4th century onward thought abortion did not break the precepts under certain circumstances.          Ordering another person to kill is also included in this precept, therefore requesting or administering euthanasia can be considered a violation of the precept, as well as advising another person to commit abortion. With regard to ": null
    },
    {
        "euthanasia": "Euthanasia"
    },
    {
        " and ": null
    },
    {
        "assisted suicide": "Assisted Suicide"
    },
    {
        ", Keown quotes the Pāli  Dīgha Nikāya  that says a person upholding the first precept does not kill a living being, does not cause a living being to be killed, does not approve of the killing of a living being . Keown argues that in Buddhist ethics, regardless of motives, death can never be the aim of ones actions.     Interpretations of how Buddhist texts regard warfare are varied, but in general Buddhist doctrine is considered to oppose all warfare. In many Jātaka tales, such as that of ": null
    },
    {
        "Prince Temiya": "Adhiṭṭhānatemiya The Wise"
    },
    {
        ", as well as some historical documents, the virtue of non-violence is taken as an opposition to all war, both offensive and defensive. At the same time, though, the Buddha is often shown not to explicitly oppose war in his conversations with political figures. Buddhologist ": null
    },
    {
        "André Bareau": "André Bareau"
    },
    {
        " points out that the Buddha was reserved in his involvement of the details of administrative policy, and concentrated on the moral and spiritual development of his disciples instead. He may have believed such involvement to be futile, or detrimental to Buddhism. Nevertheless, at least one disciple of the Buddha is mentioned in the texts who refrained from retaliating his enemies because of the Buddha, that is King ": null
    },
    {
        "Pasenadi": "Pasenadi"
    },
    {
        " . The texts are ambiguous in explaining his motives though.  In some later Mahāyāna texts, such as in the writings of ": null
    },
    {
        "Asaṅga": "Asaṅga"
    },
    {
        ", examples are mentioned of people who kill those who persecute Buddhists. In these examples, killing is justified by the authors because protecting Buddhism was seen as more important than keeping the precepts. Another example that is often cited is that of King ": null
    },
    {
        "Duṭṭhagāmaṇī": "Dutthagamani"
    },
    {
        ", who is mentioned in the post-canonical Pāli ": null
    },
    {
        "Mahāvaṃsa": "Mahavamsa"
    },
    {
        " chronicle. In the chronicle, the king is saddened with the loss of life after a war, but comforted by a Buddhist monk, who states that nearly everyone who was killed did not uphold the precepts anyway.  Buddhist studies scholar ": null
    },
    {
        "Lambert Schmithausen": "Lambert Schmithausen"
    },
    {
        " argues that in many of these cases Buddhist teachings like that of ": null
    },
    {
        "emptiness": "Emptiness"
    },
    {
        " were misused to further an agenda of war or other violence.             Field studies in Cambodia and Burma have shown that many Buddhists considered the first precept the most important, or the most blamable. In some traditional communities, such as in ": null
    },
    {
        "Kandal Province": "Kandal Province"
    },
    {
        " in pre-war Cambodia, as well as Burma in the 1980s, it was uncommon for Buddhists to slaughter animals, to the extent that meat had to be bought from not-Buddhists. In his field studies in Thailand in the 1960s, Terwiel found that villagers did tend to kill insects, but were reluctant and self-conflicted with regard to killing larger animals. In Spiros field studies, however, Burmese villagers were highly reluctant even to kill insects.     Early Buddhists did not adopt a ": null
    },
    {
        "vegetarian lifestyle": "Vegetarianism In Buddhism"
    },
    {
        ". Indeed, in several Pāli ": null
    },
    {
        "texts": "Sutra"
    },
    {
        " vegetarianism is described as irrelevant in the spiritual purification of the mind. There are prohibitions on certain types of meat, however, especially those which are condemned by society. The idea of abstaining from killing animal life has also led to a prohibition on professions that involve trade in flesh or living beings, but not to a full prohibition of all agriculture that involves cattle.  In modern times, referring to the ": null
    },
    {
        "law of supply and demand": "Law Of Supply And Demand"
    },
    {
        " or other principles, some Theravādin Buddhists have attempted to promote vegetarianism as part of the five precepts. For example, the Thai ": null
    },
    {
        "Santi Asoke": "Santi Asoke"
    },
    {
        " movement practices vegetarianism.     Furthermore, among some schools of Buddhism, there has been some debate with regard to a principle in the monastic discipline. This principle states that a Buddhist monk cannot accept meat if it comes from animals especially slaughtered for him. Some teachers have interpreted this to mean that when the recipient has no knowledge on whether the animal has been killed for him, he cannot accept the food either. Similarly, there has been debate as to whether laypeople should be vegetarian when adhering to the five precepts. Though vegetarianism among Theravādins is generally uncommon, it has been practiced much in East Asian countries, as some Mahāyāna texts, such as the  Mahāparanirvana Sūtra  and the  Laṅkāvatāra Sūtra , condemn the eating of meat. Nevertheless, even among Mahāyāna Buddhistsand East Asian Buddhiststhere is disagreement on whether vegetarianism should be practiced. In the Laṅkāvatāra Sūtra, biological, social and hygienic reasons are given for a vegetarian diet; however, historically, a major factor in the development of a vegetarian lifestyle among Mahāyāna communities may have been that Mahāyāna monastics cultivated their own crops for food, rather than living from ": null
    },
    {
        "alms": "Almsbuddhism"
    },
    {
        ". Already from the 4th century CE, Chinese writer ": null
    },
    {
        "Xi Chao": "Xi Chao"
    },
    {
        " understood the five precepts to include vegetarianism.        Apart from trade in flesh or living beings, there are also other professions considered undesirable. Vietnamese teacher Thich Nhat Hanh gives a list of examples, such as working in the arms industry, the military, police, producing or selling poison or drugs such as alcohol and tobacco.     In general, the first precept has been interpreted by Buddhists as a call for non-violence and pacifism. But there have been some exceptions of people who did not interpret the first precept as an opposition to war. For example, in the twentieth century, some Japanese Zen teachers wrote in support of violence in war, and some of them argued this should be seen as a means to uphold the first precept.  There is some debate and controversy surrounding the problem whether a person can commit suicide, such as ": null
    },
    {
        "self-immolation": "Self-Immolation"
    },
    {
        ", to reduce other peoples suffering in the long run, such as in protest to improve a political situation in a country. Teachers like the ": null
    },
    {
        "Dalai Lama": "Dalai Lama"
    },
    {
        " and ": null
    },
    {
        "Shengyan": "Lu Sheng-Yen"
    },
    {
        " have rejected forms of protest like self-immolation, as well as other acts of self-harming or fasting as forms of protest.     Although capital punishment goes against the first precept, as of 2001, many countries in Asia still maintained the death penalty, including Sri Lanka, Thailand, China and Taiwan. In some Buddhist countries, such as Sri Lanka and Thailand, capital punishment was applied during some periods, while during other periods no capital punishment was used at all. In other countries with Buddhism, like China and Taiwan, Buddhism, or any religion for that matter, has had no influence in policy decisions of the government. Countries with Buddhism that have abolished capital punishment include Cambodia and Hong Kong.      In general, Buddhist traditions oppose abortion. In many countries with Buddhist traditions such as Thailand, Taiwan, Korea and Japan, however, abortion is a widespread practice, whether legal or not. Many people in these countries consider abortion immoral, but also think it should be less prohibited. Ethicist Roy W. Perrett, following Ratanakul, argues that this field research data does not so much indicate hypocrisy, but rather points at a middle way in applying Buddhist doctrine to solve a ": null
    },
    {
        "moral dilemma": "Moral Dilemma"
    },
    {
        ". Buddhists tend to take both sides on the pro-lifepro-choice debate, being against the taking of life of a fetus in principle, but also believing in compassion toward mothers. Similar attitudes may explain the Japanese  mizuko kuyō  ceremony, a Buddhist memorial service for aborted children, which has led to a debate in Japanese society concerning abortion, and finally brought the Japanese to a consensus that abortion should not be taken lightly, though it should be legalized. This position, held by Japanese Buddhists, takes the middle ground between the Japanese ": null
    },
    {
        "neo-Shinto": "Shintopost-War"
    },
    {
        " pro-life position, and the ": null
    },
    {
        "liberationist": "Sex-Positive Feminism"
    },
    {
        ", pro-choice arguments. Keown points out, however, that this compromise does not mean a Buddhist ": null
    },
    {
        "middle way": "Middle Way"
    },
    {
        " between two extremes, but rather incorporates two opposite perspectives. In Thailand, women who wish to have abortion usually do so in the early stages of pregnancy, because they believe the karmic consequences are less then. Having had abortion, Thai women usually make merits to compensate for the negative karma.            The second precept prohibits theft, and involves the intention to steal what one perceives as not belonging to oneself and acting successfully upon that intention. The severity of the act of theft is judged by the worth of the owner and the worth of that which is stolen. Underhand dealings, fraud, cheating and forgery are also included in this precept. Accompanying virtues are ": null
    },
    {
        "generosity": "Dana"
    },
    {
        ", ": null
    },
    {
        "renunciation": "Nekkhamma"
    },
    {
        ", and ": null
    },
    {
        "right livelihood": "Right Livelihood"
    },
    {
        ", and a positive behavior is the protection of other peoples property.       The second precept includes different ways of stealing and fraud. Borrowing without permission is sometimes included, as well as gambling. Psychologist Vanchai Ariyabuddhiphongs did studies in the 2000s and 2010s in Thailand and discovered that people who did not adhere to the five precepts more often tended to believe that money was the most important goal in life, and would more often pay bribes than people who did adhere to the precepts. On the other hand, people who observed the five precepts regarded themselves as wealthier and happier than people who did not observe the precepts.     Professions that are seen to violate the second precept include working in the gambling industry or marketing products that are not actually required for the customer.         The third precept condemns sexual misconduct. This has been interpreted in classical texts to include adultery with a married or engaged person, rape, incest, sex with a minor , and sex with a prostitute. In later texts, details such as intercourse at an inappropriate time or inappropriate place are also counted as breaches of the third precept. Masturbation goes against the spirit of the precept, though in the early texts it is not prohibited for laypeople.     The third precept is explained as leading to greed in oneself and harm to others. The transgression is regarded as more severe if the other person is a good person. Virtues that go hand-in-hand with the third precept are contentment, especially with ones partner, and recognition and respect for faithfulness in a marriage.          The third precept is interpreted as avoiding harm to another by using sensuality in the wrong way. This means not engaging with inappropriate partners, but also respecting ones personal commitment to a relationship. In some traditions, the precept also condemns adultery with a person whose spouse agrees with the act, since the nature of the act itself is condemned. Furthermore, flirting with a married person may also be regarded as a violation.  Though prostitution is discouraged in the third precept, it is usually not actively prohibited by Buddhist teachers. With regard to applications of the principles of the third precept, the precept, or any Buddhist principle for that matter, is usually not connected with a stance against contraception.   In traditional Buddhist societies such as Sri Lanka, pre-marital sex is considered to violate the precept, though this is not always adhered to by people who already intend to marry.     In the interpretation of modern teachers, the precept includes any person in a sexual relationship with another person, as they define the precept by terms such as sexual responsibility and long-term commitment. Some modern teachers include masturbation as a violation of the precept, others include certain professions, such as those that involve sexual exploitation, prostitution or pornography, and professions that promote unhealthy sexual behavior, such as in the entertainment industry.              The fourth precept involves falsehood spoken or committed to by action. Avoiding other forms of wrong speech are also considered part of this precept, consisting of malicious speech, harsh speech and gossip. A breach of the precept is considered more serious if the falsehood is motivated by an ulterior motive . The accompanying virtue is ": null
    },
    {
        "being honest": "Saccatruth As An Ethical Practice"
    },
    {
        " and dependable, and involves honesty in work, truthfulness to others, loyalty to superiors and gratitude to benefactors. In Buddhist texts, this precept is considered second in importance to the first precept, because a lying person is regarded to have no shame, and therefore capable of many wrongs. Untruthfulness is not only to be avoided because it harms others, but also because it goes against the Buddhist ideal of finding the ": null
    },
    {
        "truth": "Truth In Buddhism"
    },
    {
        ".       The fourth precept includes avoidance of lying and harmful speech. Some modern teachers such as Thich Nhat Hanh interpret this to include avoiding spreading false news and uncertain information. Work that involves data manipulation, false advertising or online scams can also be regarded as violations. Terwiel reports that among Thai Buddhists, the fourth precept is also seen to be broken when people insinuate, exaggerate or speak abusively or deceitfully.            The fifth precept prohibits intoxication through alcohol, drugs or other means, and its virtues are ": null
    },
    {
        "mindfulness": "Mindfulness"
    },
    {
        " and responsibility, applied to ": null
    },
    {
        "food": "Temperance"
    },
    {
        ", work, behavior, and with regard to the ": null
    },
    {
        "nature of life": "Reality In Buddhism"
    },
    {
        ". Awareness, meditation and ": null
    },
    {
        "heedfulness": "Appamada"
    },
    {
        " can also be included here. Medieval Pāli commentator ": null
    },
    {
        "Buddhaghosa": "Buddhaghosa"
    },
    {
        " writes that whereas violating the first four precepts may be more or less blamable depending on the person or animal affected, the fifth precept is always greatly blamable , as it hinders one from understanding the Buddhas teaching and may lead one to madness . In ancient China, Daoshi described alcohol as the doorway to laxity and idleness and as a cause of suffering. Nevertheless, he did describe certain cases when drinking was considered less of a problem, such as in the case of a queen distracting the king by alcohol to prevent him from murder. However, Daoshi was generally strict in his interpretations: for example, he allowed medicinal use of alcohol only in extreme cases.  Early Chinese translations of the ": null
    },
    {
        "Tripitaka": "Tripitaka"
    },
    {
        " describe negative consequences for people breaking the fifth precept, for themselves and their families. The Chinese translation of the Upāsikaśila Sūtra, as well as the Pāli version of the ": null
    },
    {
        "Sigālovāda Sutta": "Sigalovada Sutta"
    },
    {
        ", speak of ill consequences such as loss of wealth, ill health, a bad reputation and stupidity , concluding in a rebirth in hell. The  Dīrghāgama  adds to that that alcohol leads to quarreling, negative states of mind and damage to ones intelligence. The Mahāyāna  Brahmajāla Sūtra  describes the dangers of alcohol in very strong terms, including the selling of alcohol.  Similar arguments against alcohol can be found in ": null
    },
    {
        "Nāgārjunas": "Nāgārjuna"
    },
    {
        " writings. The strict interpretation of prohibition of alcohol consumption can be supported by the Upāli Sūtra s statement that a disciple of the Buddha should not drink any alcohol, even a drop on the point of a blade of grass . However, in the writing of some ": null
    },
    {
        "Abhidharma": "Abhidharma"
    },
    {
        " commentators, consumption was condemned or condoned, depending on the intention with which alcohol was consumed.        As for the fifth precept, this is regarded as important, because drinking alcohol is condemned for the sluggishness and lack of self-control it leads to, which might lead to breaking the other precepts. In Spiros field studies, violating the fifth precept was seen as the worst of all the five precepts by half of the monks interviewed, citing the harmful consequences. Nevertheless, in practice it is often disregarded by lay people. In Thailand, drinking alcohol is fairly common, even drunkenness. Among Tibetans, drinking beer is common, though this is only slightly alcoholic. Medicinal use of alcohol is generally not frowned upon, and in some countries like Thailand and Laos, smoking is usually not regarded as a violation of the precept. Thai and Laotian monks have been known to smoke, though monks who have received more training are less likely to smoke. On a similar note, as of 2000, no Buddhist country prohibited the sale or consumption of alcohol, though in Sri Lanka Buddhist revivalists attempted unsuccessfully to get a full prohibition passed in 1956. Moreover, pre-Communist Tibet used to prohibit smoking in some areas of the capital. Monks were prohibited from smoking, and the import of tobacco was banned.     Thich Nhat Hanh also includes the aspect of mindful consumption in this precept, which consists of unhealthy food, unhealthy entertainment and unhealthy conversations, among others.          In modern times, adherence to the precepts among Buddhists is less strict than it traditionally was. This is especially true for the third precept. For example, in Cambodia in the 1990s and 2000s, standards with regard to sexual restraint were greatly relaxed. Some Buddhist movements and communities have tried to go against the modern trend of less strict adherence to the precepts. In Cambodia, a ": null
    },
    {
        "millenarian movement": "Faith In Buddhismmillenarianism"
    },
    {
        " led by ": null
    },
    {
        "Chan Yipon": "Chan Yipon"
    },
    {
        " promoted the revival of the five precepts. And in the 2010s, the ": null
    },
    {
        "Supreme Sangha Council": "Supreme Sangha Council"
    },
    {
        " in Thailand ran a nationwide program called ": null
    },
    {
        "The Villages Practicing the Five Precepts": "Wat Paknam Bhasicharoenteachings"
    },
    {
        " , aiming to encourage keeping the precepts, with an extensive classification and reward system.       In many Western Buddhist organizations, the five precepts play a major role in developing ethical guidelines. Furthermore, Buddhist teachers such as ": null
    },
    {
        "Philip Kapleau": "Philip Kapleau"
    },
    {
        ", Thich Nhat Hanh and ": null
    },
    {
        "Robert Aitken": "Robert Baker Aitken"
    },
    {
        " have promoted mindful consumption in the West, based on the five precepts. In another development in the West, some scholars working in the field of ": null
    },
    {
        "mindfulness": "Mindfulness"
    },
    {
        " training have proposed that the five precepts be introduced as a component in such trainings. Specifically, to prevent organizations from using mindfulness training to further an economical agenda with harmful results to its employees, the economy or the environment, the precepts could be used as a standardized ethical framework. As of 2015, several training programs made explicit use of the five precepts as secular, ethical guidelines. However, many mindfulness training specialists consider it problematic to teach the five precepts as part of training programs in secular contexts because of their religious origins and import.      ": null
    },
    {
        "Peace studies": "Peace And Conflict Studies"
    },
    {
        " scholar Theresa Der-lan Yeh notes that the five precepts address physical, economical, familial and verbal aspects of interaction, and remarks that many conflict prevention programs in schools and communities have integrated the five precepts in their curriculum. On a similar note, peace studies founder ": null
    },
    {
        "Johan Galtung": "Johan Galtung"
    },
    {
        " describes the five precepts as the basic contribution of Buddhism in the creation of peace .          Studying lay and monastic ethical practice in traditional Buddhist societies, Spiro argued ethical guidelines such as the five precepts are adhered to as a means to a higher end, that is, a better rebirth or enlightenment. He therefore concluded that Buddhist ethical principles like the five precepts are similar to Western ": null
    },
    {
        "utilitarianism": "Utilitarianism"
    },
    {
        ". Keown, however, has argued that the five precepts are regarded as rules that cannot be violated, and therefore may indicate a ": null
    },
    {
        "deontological": "Deontological"
    },
    {
        " perspective in Buddhist ethics. On the other hand, Keown has also suggested that Aristoteles ": null
    },
    {
        "virtue ethics": "Virtue Ethics"
    },
    {
        " could apply to Buddhist ethics, since the precepts are considered good in themselves, and mutually dependent on other aspects of the Buddhist path of practice. Philosopher Christopher Gowans disagrees that Buddhist ethics are deontological, arguing that virtue and consequences are also important in Buddhist ethics. Gowans argues that there is no moral theory in Buddhist ethics that covers all conceivable situations such as when two precepts may be in conflict, but is rather characterized by a commitment to and nontheoretical grasp of the basic Buddhist moral values .  As of 2017, many scholars of Buddhism no longer think it is useful to try to fit Buddhist ethics into a Western philosophical category.       Keown has argued that the five precepts are very similar to human rights, with regard to subject matter and with regard to their universal nature. Other scholars, as well as Buddhist writers and human rights advocates, have drawn similar comparisons. For example, the following comparisons are drawn:   Keown compares the first precept with the ": null
    },
    {
        "right to life": "Right To Life"
    },
    {
        ". The Buddhism-informed Cambodian Institute for Human Rights draws the same comparison.   The second precept is compared by Keown and the CIHR with the right of property.   The third precept is compared by Keown to the right to fidelity in marriage ; the CIHR construes this broadly as right of individuals and the rights of society .   The fourth precept is compared by Keown with the right not to be lied to ; the CIHR writes the right of human dignity .   Finally, the fifth precept is compared by the CIHR with the right of individual security and a safe society.     Keown describes the relationship between Buddhist precepts and human rights as look both ways along the juridical relationship, both to what one is due to do, and to what is due to one . On a similar note, Cambodian human rights advocates have argued that for human rights to be fully implemented in society, the strengthening of individual morality must also be addressed. Buddhist monk and scholar ": null
    },
    {
        "Phra Payutto": "P.A. Payutto"
    },
    {
        " sees the ": null
    },
    {
        "Human Rights Declaration": "Universal Declaration Of Human Rights"
    },
    {
        " as an unfolding and detailing of the principles that are found in the five precepts, in which a sense of ownership is given to the individual, to make legitimate claims on ones rights. He believes that human rights should be seen as a part of human development, in which one develops from ": null
    },
    {
        "moral discipline": "Śīla"
    },
    {
        " , to ": null
    },
    {
        "concentration": "Samadhi"
    },
    {
        "  and finally ": null
    },
    {
        "wisdom": "Paññā"
    },
    {
        " . He does not believe, however, that human rights are ": null
    },
    {
        "natural rights": "Natural Rights"
    },
    {
        ", but rather human conventions. Buddhism scholar Somparn Promta disagrees with him. He argues that human beings do have natural rights from a Buddhist perspective, and refers to the attūpanāyika-dhamma, a teaching in which the Buddha prescribes a kind of ": null
    },
    {
        "golden rule": "Golden Rule"
    },
    {
        " of comparing oneself with others.  From this discourse, Promta concludes that the Buddha has laid down the five precepts in order to protect individual rights such as right of life and property: human rights are implicit within the five precepts. Academic Buntham Phunsap argues, however, that though human rights are useful in culturally pluralistic societies, they are in fact not required when society is based on the five precepts. Phunsap therefore does not see human rights as part of Buddhist doctrine. ": null
    }
]