[
    {
        "                The Food and Agriculture Organization of the United Nations  is a ": null
    },
    {
        "specialized agency": "Specialized Agency"
    },
    {
        " of the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " that leads international efforts to defeat hunger. Serving both ": null
    },
    {
        "developed": "Developed Country"
    },
    {
        " and ": null
    },
    {
        "developing countries": "Developing Country"
    },
    {
        ", FAO acts as a neutral forum where all nations meet as equals to negotiate arguments and debate policy.     FAO is also a source of knowledge and information, and helps developing countries in transition, modernize and improve ": null
    },
    {
        "agriculture": "Agriculture"
    },
    {
        ", ": null
    },
    {
        "forestry": "Forestry"
    },
    {
        " and ": null
    },
    {
        "fisheries": "Fishery"
    },
    {
        " practices, ensuring good ": null
    },
    {
        "nutrition": "Nutrition"
    },
    {
        " and ": null
    },
    {
        "food security": "Food Security"
    },
    {
        " for all. Its ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " motto, , is translated as let there be bread . , The FAO has 197 member states, including the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " , ": null
    },
    {
        "Niue": "Niue"
    },
    {
        " and ": null
    },
    {
        "The Cook Islands": "Cook Islands"
    },
    {
        " , and the ": null
    },
    {
        "Faroe Islands": "Faroe Islands"
    },
    {
        " and ": null
    },
    {
        "Tokelau": "Tokelau"
    },
    {
        ", which are associate members.           The idea of an international organization for food and agriculture emerged in the late 19th and early 20th century advanced primarily by the US agriculturalist and activist ": null
    },
    {
        "David Lubin": "David Lubin"
    },
    {
        ". In May–June 1905, an international conference was held in ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ", Italy, which led to the creation of the ": null
    },
    {
        "International Institute of Agriculture": "International Institute Of Agriculture"
    },
    {
        " by the ": null
    },
    {
        "King of Italy": "King Of Italy"
    },
    {
        " Victor Emmanuel III": "Victor Emmanuel Iii"
    },
    {
        ".      Later in 1943, the United States President Franklin D. Roosevelt called a United Nations Conference on Food and Agriculture. Representatives from forty-four governments gathered at ": null
    },
    {
        "The Homestead Resort in Hot Springs, Virginia": "The Omni Homestead Resort"
    },
    {
        ", US, from 18 May to 3 June. They committed themselves to founding a permanent organization for food and agriculture, which happened in ": null
    },
    {
        "Quebec City": "Quebec City"
    },
    {
        ", Canada, on 16 October 1945 with the conclusion of the Constitution of the Food and Agriculture Organization.  The First Session of the FAO Conference was held in the ": null
    },
    {
        "Château Frontenac": "Château Frontenac"
    },
    {
        " in Quebec City from 16 October to 1 November 1945.     ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " effectively ended the International Agricultural Institute, though it was only officially dissolved by resolution of its Permanent Committee on 27 February 1948. Its functions were then transferred to the recently established FAO.      From the late 1940s on, FAO attempted to make its mark within the emerging UN system, focusing mostly on supporting agricultural and nutrition research and providing technical assistance to member countries to boost production in agriculture, fishery, and forestry.      During the 1950s and 1960s, FAO partnered with many different international organizations in development projects.               In 1951, FAOs headquarters were moved from ": null
    },
    {
        "Washington, DC": "Washington, Dc"
    },
    {
        ", United States, to ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ", Italy. The agency is directed by the Conference of Member Nations, which meets every two years to review the work carried out by the organization and to Work and Budget for the next two-year period. The Conference elects a council of 49 member states that acts as an interim governing body, and the Director-General, that heads the agency.     FAO is composed of eight departments: Agriculture and Consumer Protection, Climate, Biodiversity, Land and Water Department, Economic and Social Development, Fisheries and Aquaculture, Forestry, Corporate Services and Technical Cooperation and Programme Management.      Beginning in 1994, FAO underwent the most significant restructuring since its founding, to decentralize operations, streamline procedures and reduce costs. As a result, savings of about US$50 million, €35 million a year were realized.        FAOs Regular Programme budget is funded by its members, through contributions set at the FAO Conference. This budget covers core technical work, cooperation and partnerships including the Technical Cooperation Programme, knowledge exchange, policy and advocacy, direction and administration, governance and security.     The total FAO Budget planned for 2018–2019 is US$1,005.6 million.  The voluntary contributions provided by members and other partners support mechanical and emergency assistance to governments for clearly defined purposes linked to the results framework, as well as direct support to FAOs core work. The voluntary contributions are expected to reach approximately US$1.6 billion in 2016–2017.     This overall budget covers core technical work, cooperation and partnerships, leading to Food and Agriculture Outcomes at 71 percent; Core Functions at 11 percent; the Country Office Network – 5 percent; Capital and Security Expenditure – 2 percent; Administration – 6 percent; and Technical and Cooperation Program – 5 percent.         ": null
    },
    {
        "John Boyd Orr": "John Boyd Orr"
    },
    {
        ", October 1945 – April 1948   ": null
    },
    {
        "Norris E. Dodd": "Norris E. Dodd"
    },
    {
        ", April 1948 – December 1953   ": null
    },
    {
        "Philip V. Cardon": "Philip V. Cardon"
    },
    {
        ", January 1954 – April 1956   ": null
    },
    {
        "Herbert Broadley": "Herbert Broadley"
    },
    {
        ", April 1956 – November 1956   ": null
    },
    {
        "Binay Ranjan Sen": "Binay Ranjan Sen"
    },
    {
        ", November 1956 – December 1967   Addeke Hendrik Boerma, January 1968 – December 1975   ": null
    },
    {
        "Edouard Saouma": "Edouard Saouma"
    },
    {
        ", January 1976 – December 1993   ": null
    },
    {
        "Jacques Diouf": "Jacques Diouf"
    },
    {
        ", January 1994 – December 2011   ": null
    },
    {
        "José Graziano da Silva": "José Graziano Da Silva"
    },
    {
        ", January 2012 – July 2019   ": null
    },
    {
        "Qu Dongyu": "Qu Dongyu"
    },
    {
        ", August 2019 - 31 July 2023           : ": null
    },
    {
        "William Nobel Clark": "William Nobel Clark"
    },
    {
        " : 1948   : ": null
    },
    {
        "Sir Herbert Broadley": "Herbert Broadley"
    },
    {
        " : 1948–1958   : ": null
    },
    {
        "Friedrich Traugott Wahlen": "Friedrich Traugott Wahlen"
    },
    {
        " : 1958–1959   : ": null
    },
    {
        "Norman C. Wright": "Norman C. Wright"
    },
    {
        " : 1959–1963   : ": null
    },
    {
        "Oris V. Wells": "Oris V. Wells"
    },
    {
        " : 1963–1971   : ": null
    },
    {
        "Roy I. Jackson": "Roy I. Jackson"
    },
    {
        " : 1971–1978   : ": null
    },
    {
        "Ralph W. Phillips": "Ralph W. Phillips"
    },
    {
        " : 1978–1981   : ": null
    },
    {
        "Edward M. West": "Edward M. West"
    },
    {
        " : 1981–1985   : ": null
    },
    {
        "Declan J. Walton": "Declan J. Walton"
    },
    {
        " : 1986–1987   : ": null
    },
    {
        "Howard Hjort": "Howard Hjort"
    },
    {
        " : 1992–1997   : ": null
    },
    {
        "Vikram J. Shah": "Vikram J. Shah"
    },
    {
        " : 1992–1995   : ": null
    },
    {
        "David A. Harcharik": "David A. Harcharik"
    },
    {
        " : 1998–2007   : ": null
    },
    {
        "James G. Butler": "James G. Butler"
    },
    {
        " : 2008–2010   : ": null
    },
    {
        "Changchui He": "Changchui He"
    },
    {
        " : 2009–2011   : ": null
    },
    {
        "Ann Tutwiler": "Ann Tutwiler"
    },
    {
        " : 2011–2012   : ": null
    },
    {
        "Manoj Juneja": "Manoj Juneja"
    },
    {
        " : 2011–2012   : ": null
    },
    {
        "Dan Gustafson": "Dan Gustafson"
    },
    {
        " : 2012–present   : ": null
    },
    {
        "Maria Helena Semedo": "Maria Helena Semedo"
    },
    {
        " : 2013–present   : ": null
    },
    {
        "Laurent Thomas": "Laurent Thomas"
    },
    {
        " : 2017-present                    The world headquarters are located in Rome, in the former seat of the Department of ": null
    },
    {
        "Italian East Africa": "Italian East Africa"
    },
    {
        ". One of the most notable features of the building was the ": null
    },
    {
        "Axum Obelisk": "Obelisk Of Axum"
    },
    {
        " which stood in front of the agency seat, although just outside the territory allocated to FAO by the Italian Government. It was taken from ": null
    },
    {
        "Ethiopia": "Ethiopia"
    },
    {
        " by ": null
    },
    {
        "Benito Mussolinis": "Benito Mussolini"
    },
    {
        "troops in 1937 as a war chest, and returned on 18 April 2005.       Regional Office for ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ", in ": null
    },
    {
        "Accra": "Accra"
    },
    {
        ", ": null
    },
    {
        "Ghana": "Ghana"
    },
    {
        " Asia and the Pacific": "Asia And The Pacific"
    },
    {
        ", in ": null
    },
    {
        "Bangkok": "Bangkok"
    },
    {
        ", ": null
    },
    {
        "Thailand": "Thailand"
    },
    {
        " Europe": "Europe"
    },
    {
        " and ": null
    },
    {
        "Central Asia": "Central Asia"
    },
    {
        ", in ": null
    },
    {
        "Budapest": "Budapest"
    },
    {
        ", ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        " Latin America": "Latin America"
    },
    {
        " and the ": null
    },
    {
        "Caribbean": "Caribbean"
    },
    {
        ", in ": null
    },
    {
        "Santiago": "Santiago"
    },
    {
        ", ": null
    },
    {
        "Chile": "Chile"
    },
    {
        " Near East": "Near East"
    },
    {
        ", in ": null
    },
    {
        "Cairo": "Cairo"
    },
    {
        ", ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        "        Central Africa": "Central Africa"
    },
    {
        " , in ": null
    },
    {
        "Libreville": "Libreville"
    },
    {
        ", ": null
    },
    {
        "Gabon": "Gabon"
    },
    {
        " Central Asia": "Central Asia"
    },
    {
        ", in ": null
    },
    {
        "Ankara": "Ankara"
    },
    {
        ", ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        " Eastern Africa": "Eastern Africa"
    },
    {
        " , in ": null
    },
    {
        "Addis Ababa": "Addis Ababa"
    },
    {
        ", ": null
    },
    {
        "Ethiopia": "Ethiopia"
    },
    {
        " Mesoamerica": "Mesoamerica"
    },
    {
        " , in ": null
    },
    {
        "Panama City": "Panama City"
    },
    {
        ", ": null
    },
    {
        "Panama": "Panama"
    },
    {
        " North Africa": "North Africa"
    },
    {
        ", in ": null
    },
    {
        "Tunis": "Tunis"
    },
    {
        ", ": null
    },
    {
        "Tunisia": "Tunisia"
    },
    {
        " Southern Africa": "Southern Africa"
    },
    {
        " and ": null
    },
    {
        "East Africa": "East Africa"
    },
    {
        ", in ": null
    },
    {
        "Harare": "Harare"
    },
    {
        ", ": null
    },
    {
        "Zimbabwe": "Zimbabwe"
    },
    {
        " Caribbean": "Caribbean"
    },
    {
        ", in ": null
    },
    {
        "Bridgetown": "Bridgetown"
    },
    {
        ", ": null
    },
    {
        "Barbados": "Barbados"
    },
    {
        " Gulf Cooperation Council States": "Gulf Cooperation Council States"
    },
    {
        " and ": null
    },
    {
        "Yemen": "Yemen"
    },
    {
        ", in ": null
    },
    {
        "Abu Dhabi": "Abu Dhabi"
    },
    {
        ", ": null
    },
    {
        "United Arab Emirates": "United Arab Emirates"
    },
    {
        " Pacific Islands": "Pacific Islands"
    },
    {
        ", in ": null
    },
    {
        "Apia": "Apia"
    },
    {
        ", ": null
    },
    {
        "Samoa": "Samoa"
    },
    {
        " North America": "North America"
    },
    {
        ", in ": null
    },
    {
        "Washington, DC": "Washington, Dc"
    },
    {
        " Japan": "Japan"
    },
    {
        ", in ": null
    },
    {
        "Yokohama": "Yokohama"
    },
    {
        " European Union": "European Union"
    },
    {
        " and ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        ", in ": null
    },
    {
        "Brussels": "Brussels"
    },
    {
        " Russian Federation": "Russian Federation"
    },
    {
        ", in ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        " Geneva": "Geneva"
    },
    {
        " New York": "New York City"
    },
    {
        "       FAO has outlined the following priorities in its fight against hunger.    Help eliminate hunger, food insecurity and malnutrition – contribute to the eradication of hunger by facilitating policies and political commitments to support food security and by making sure that up-to-date information about hunger and nutrition challenges and solutions is available and accessible.   Make agriculture, forestry and fisheries more productive and sustainable – promote evidence-based policies and practices to support highly productive agricultural sectors , while ensuring that the natural resource base does not suffer in the process.   Reduce rural poverty – help the rural poor gain access to the resources and services they need – including rural employment and social protection – to forge a path out of poverty.   Enable inclusive and efficient agricultural and food systems – help to build safe and efficient food systems that support smallholder agriculture and reduce poverty and hunger in rural areas.   Increase the resilience of livelihoods to threats and crises – help countries to prepare for natural and human-caused disasters by reducing their risk and enhancing the resilience of their food and agricultural systems.   Two fundamental areas of work – gender and governance - are fully integrated in the above strategic objective action plans.             Codex Alimentarius ": null
    },
    {
        "Codex Alimentarius Commission": "Codex Alimentarius Commission"
    },
    {
        " in 1961 to develop food standards, guidelines and texts such as codes of practice under the Joint FAO/ WHO Food Standards Programme. The main aims of the programme are protecting consumer health, ensuring fair trade and promoting co-ordination of all food standards work undertaken by intergovernmental and non-governmental organization.            In 1996, FAO organized the ": null
    },
    {
        "World Food Summit": "World Food Summit"
    },
    {
        ", attended by 112 Heads or Deputy Heads of State and Government. The Summit concluded with the signing of the ": null
    },
    {
        "Rome Declaration": "Rome Declaration On World Food Security"
    },
    {
        ", which established the goal of halving the number of people who suffer from hunger by the year 2015.  At the same time, 1,200 civil society organizations from 80 countries participated in an ": null
    },
    {
        "NGO": "Ngo"
    },
    {
        " forum. The forum was critical of the growing industrialization of agriculture and called upon governments – and FAO – to do more to protect the Right to Food of the poor.        In 1997, FAO launched TeleFood, a campaign of concerts, sporting events and other activities to harness the power of media, celebrities and concerned citizens to help fight hunger. Since its start, the campaign has generated close to US$28 million, €15 million in donations. Money raised through TeleFood pays for small, sustainable projects that help small-scale farmers produce more food for their families and communities.      The projects provide tangible resources, such as fishing equipment, seeds and agricultural implements. They vary enormously, from helping families raise pigs in Venezuela, through creating school gardens in Cape Verde and Mauritania or providing school lunches in Uganda and teaching children to grow food, to raising fish in a leper community in India.       The ": null
    },
    {
        "FAO Goodwill Ambassadors": "Fao Goodwill Ambassador"
    },
    {
        "Programme was initiated in 1999. The main purpose of the programme is to attract public and media attention to the unacceptable situation that some 1 billion people continue to suffer from chronic hunger and malnutrition in a time of unprecedented plenty. These people lead a life of misery and are denied the most basic of human rights: the right to food.     Governments alone cannot end hunger and undernourishment. Mobilization of the public and private sectors, the involvement of civil society and the pooling of collective and individual resources are all needed if people are to break out of the vicious circle of chronic hunger and undernourishment.     Each of FAOs Goodwill Ambassadors – celebrities from the arts, entertainment, sport and academia such as Nobel Prize winner ": null
    },
    {
        "Rita Levi Montalcini": "Rita Levi Montalcini"
    },
    {
        ", actress ": null
    },
    {
        "Gong Li": "Gong Li"
    },
    {
        ", the late singer ": null
    },
    {
        "Miriam Makeba": "Miriam Makeba"
    },
    {
        ", International Singers ": null
    },
    {
        "Ronan Keating": "Ronan Keating"
    },
    {
        ",  and ": null
    },
    {
        "Anggun": "Anggun"
    },
    {
        ".  and soccer players ": null
    },
    {
        "Roberto Baggio": "Roberto Baggio"
    },
    {
        " and ": null
    },
    {
        "Raúl": "Raúl González"
    },
    {
        ", to name a few – have made a personal and professional commitment to FAOs vision: a food-secure world for present and future generations. Using their talents and influence, the Goodwill Ambassadors draw the old and the young, the rich and the poor into the campaign against world hunger. They aim to make Food for All a reality in the 21st century and beyond.       In 2004 the ": null
    },
    {
        "Right to Food Guidelines": "Right To Food Guidelines"
    },
    {
        " were adopted, offering guidance to states on how to implement their obligations on the ": null
    },
    {
        "right to food": "Right To Food"
    },
    {
        ". Olivier de Schutter Countries tackling hunger with a right to food approach. Significant progress in implementing the right to food at national scale in Africa, Latin America and South Asia United Nations Special Rapporteur on the Right to Food, Briefing Note 01, 14 May 2010.  Downloaded 3 May 2012       In December 2007, FAO launched its Initiative on Soaring Food Prices to help small producers raise their output and earn more. Under the initiative, FAO contributed to the work of the UN High-Level Task Force on the Global Food Crisis, which produced the Comprehensive Framework for Action. FAO has carried out projects in over 25 countries and inter-agency missions in nearly 60, scaled up its monitoring through the Global Information and Early Warning System on Food and Agriculture, provided policy advice to governments while supporting their efforts to increase food production, and advocated for more investment in agriculture. s also worked hand-in-hand with the European Union. One example of its work is a US$10.2 million, €7.5 billion scheme to distribute and multiply quality seeds in Haiti,  which has significantly increased food production, thereby providing cheaper food and boosting       In May 2009, FAO and the European Union signed an initial aid package worth €125 million to support small farmers in countries hit hard by rising food prices. The aid package falls under the EUs €1 billion Food Facility, set up with the UN Secretary-Generals High-Level Task Force on the Global Food Crisis and FAO to focus on programmes that will have a quick but lasting impact on food security.  FAO is receiving a total of around €200 million for work in 25 countries, of which €15.4 million goes to Zimbabwe.        The Special Programme for Food Security is FAOs flagship initiative for reaching the goal of halving the number of hungry in the world by 2015 , as part of its commitment to the ": null
    },
    {
        "Millennium Development Goals": "Millennium Development Goals"
    },
    {
        ". Through projects in over 100 countries worldwide, the programme promotes effective, tangible solutions to the elimination of hunger, undernourishment and poverty. Currently 102 countries are engaged in the programme and of these approximately 30 have begun shifting from pilot to national programmes. To maximize the impact of its work, FAO strongly promotes national ownership and local empowerment in the countries in which it operates.        The 1billionhungry project became the EndingHunger campaign in April 2011. Spearheaded by FAO in partnership with other UN agencies and private nonprofit groups, the EndingHunger movement pushes the boundaries of conventional public advocacy. It builds on the success in 2010 of The 1billonhungry project and the subsequent chain of public events that led to the collection of over three million signatures on a global petition to end hunger . The petition was originally presented to representatives of world governments at a ceremony in Rome on 30 November 2010.      The web and partnerships are two pivotal and dynamic aspects of EndingHunger. The campaign relies on the assistance of organizations and institutions that can facilitate the projects diffusion, by placing banners on their own websites or organizing events aimed to raise awareness of the project. In its 2011 season, the campaign expanded its multimedia content, pursued mutual visibility arrangements with partner organizations, and sharpened its focus on 14- to 25-year-olds, who were encouraged to understand their potential as a social movement to push for the end of hunger.     Moreover, the EndingHunger project is a viral communication campaign, renewing and expanding its efforts to build the movement through Facebook, Twitter and other social networks. Those who sign the petition can spread the link of the EndingHunger website to their friends, via social media or mail, in order to gain awareness and signatures for the petition. The next interim objective is to grow the EndingHunger movements Facebook community to 1 million members. As with the petition, the more people who get involved, the more powerful the message to governments: We are no longer willing to accept the fact that hundreds of millions live in chronic hunger.  Groups and individuals can also decide on their own to organize an event about the project, simply by gathering friends, whistles, T-shirts and banners and thereby alert people about chronic hunger by using the yellow whistle.     The original 1billionhungry campaign borrowed as its slogan the line Im as mad as hell, and Im not going to take this anymore! , used by ": null
    },
    {
        "Peter Finch": "Peter Finch"
    },
    {
        " in the 1976 film,  Network .  Meanwhile, the yellow whistle has been the campaign symbol from the start, from 1billionhungry to Ending Hunger. It symbolizes the fact that we are blowing the whistle on the silent disaster of hunger. It is both a symbol and – at many live events taking place around the world – a physical means of expressing frustration and making some noise about the hunger situation.      Both The 1billionhungry and the EndingHunger campaigns have continued to attract UN Goodwill Ambassadors from the worlds of music and cinema, literature, sport, activism and government. Some of the well known individuals who have become involved include former Brazilian President Luiz Inácio Lula da Silva, former presidents of Chile Ricardo Lagos and Michelle Bachelet, actress Susan Sarandon, actors Jeremy Irons and Raul Bova, singers ": null
    },
    {
        "Céline Dion": "Céline Dion"
    },
    {
        " and ": null
    },
    {
        "Anggun": "Anggun"
    },
    {
        ", authors Isabelle Allende and Andrea Camilleri, musician Chucho Valdés and Olympic track-and-field legend Carl Lewis.            FAO created the ": null
    },
    {
        "International Plant Protection Convention": "International Plant Protection Convention"
    },
    {
        " or IPPC in 1952. This international treaty organization works to prevent the international spread of pests and plant diseases in both cultivated and wild plants. Among its functions are the maintenance of lists of plant pests, tracking of pest outbreaks, and coordination of technical assistance between member nations. As of July 2018, 183 contracting parties have ratified the treaty.          The Alliance Against Hunger and Malnutrition  aims to address how countries and organizations can be more effective in advocating and carrying out actions to address hunger and malnutrition. As a global partnership, AAHM creates global connections between local, regional, national and international institutions that share the goals of fighting hunger and malnutrition. The organization works to address food security by enhancing resources and knowledge sharing and strengthening hunger activities within countries and across state lines at the regional and international levels.     Following the World Food Summit, the Alliance was initially created in 2002 as the International Alliance Against Hunger to strengthen and coordinate national efforts in the fight against hunger and malnutrition. The mission of the Alliance originates from the first and eight UN Millennium Development Goals; reducing the number of people that suffer from hunger in half by 2015 and developing a global partnership for development. The Alliance was founded by the Rome-based food agencies – the Food and Agriculture Organization of the United Nations ,  UN World Food Programme ,  International Fund for Agricultural Development ,  – and Bioversity International.      AAHM connects top-down and bottom-up anti-hunger development initiatives, linking governments, UN organizations, and NGOs together in order to increase effectiveness through unity.        During the 1990s, FAO took a leading role in the promotion of ": null
    },
    {
        "integrated pest management": "Integrated Pest Management"
    },
    {
        " for rice production in Asia. Hundreds of thousands of farmers were trained using an approach known as the ": null
    },
    {
        "Farmer Field School ": "Farmer Field School"
    },
    {
        ".  Like many of the programmes managed by FAO, the funds for Farmer Field Schools came from bilateral Trust Funds, with Australia, Netherlands, Norway and Switzerland acting as the leading donors. FAOs efforts in this area have drawn praise from NGOs that have otherwise criticized much of the work of the organization.       FAO established an Emergency Prevention System for Transboundary Animal and Plant Pests and Diseases in 1994, focusing on the control of diseases like ": null
    },
    {
        "rinderpest": "Rinderpest"
    },
    {
        ", ": null
    },
    {
        "foot-and-mouth disease": "Foot-And-Mouth Disease"
    },
    {
        " and ": null
    },
    {
        "avian flu": "Avian Flu"
    },
    {
        " by helping governments coordinate their responses. One key element is the Global Rinderpest Eradication Programme, which has advanced to a stage where large tracts of Asia and Africa have now been free of the cattle disease rinderpest for an extended period of time. Meanwhile, Locust Watch monitors the worldwide locust situation and keeps affected countries and donors informed of expected developments.  Updated Feb 4, 2019. Retrieved Feb 10, 2019.            The Global Partnership Initiative for Plant Breeding Capacity Building is a global partnership dedicated to increasing plant breeding capacity building.  The mission of GIPB is to enhance the capacity of developing countries to improve crops for food security and sustainable development through better plant breeding and delivery systems.  The ultimate goal is to ensure that a critical mass of plant breeders, leaders, managers and technicians, donors and partners are linked together through an effective global network.     Increasing capacity building for plant breeding in developing countries is critical for the achievement of meaningful results in poverty and hunger reduction and to reverse the current worrisome trends. Plant breeding is a well recognized science capable of widening the genetic and adaptability base of cropping systems, by combining conventional selection techniques and modern technologies. It is essential to face and prevent the recurrence of crises such as that   of the soaring food prices and to respond to the increasing demands for crop based sources of energy.       FAOs technical cooperation department hosts an Investment Centre that promotes greater investment in agriculture and rural development by helping developing countries identify and formulate sustainable agricultural policies, programmes and projects. It mobilizes funding from multilateral institutions such as the World Bank, regional development banks and international funds as well as FAO resources.          The Globally Important Agricultural Heritage Systems Partnership Initiative was conceptualized and presented by Parviz Koohafkan the Task Manager of Chapter 10 of Agenda 21 in Food and Agricultural Organization of United Nations, FAO in 2002 during World Summit on Sustainable Development in Johannesburg, South Africa. This UN Partnership Initiative aims to identify, support and safeguard Globally Important Agricultural Heritage Systems and their livelihoods, agricultural and associated biodiversity, landscapes, knowledge systems and cultures around the world. The GIAHS Partnership recognizes the crucial importance of the well-being of family farming communities in an integrated approach while directing activities towards sustainable agriculture and rural development.       FAO has a unit focused on ": null
    },
    {
        "Animal Genetic Resources": "Animal Genetic Resources For Food And Agriculture"
    },
    {
        ", which are defined as “those animal species that are used, or may be used, for the production of food and agriculture, and the populations within each of them. These populations within each species can be classified as wild and feral populations, landraces and primary populations, standardised breeds, selected lines, varieties, strains and any conserved genetic material; all of which are currently categorized as Breeds.  FAO assists countries in implementation of the ": null
    },
    {
        "Global Plan of Action for Animal Genetic Resources": "Global Plan Of Action For Animal Genetic Resources"
    },
    {
        ". FAO supports a variety of  ex situ  and  in situ  conservation strategies including ": null
    },
    {
        "cryoconservation of animal genetic resources": "Cryoconservation Of Animal Genetic Resources"
    },
    {
        ".            One of FAOs strategic goals is the sustainable management of the worlds forests. The Forestry Department  works to balance social and environmental considerations with the economic needs of rural populations living in forest areas. FAO serves as a neutral forum for policy dialogue, as a reliable source of information on forests and trees and as a provider of expert technical assistance and advice to help countries develop and implement effective national forest programmes.     FAO is both a global clearinghouse for information on ": null
    },
    {
        "forests": "Forest"
    },
    {
        "and forest resources and a facilitator that helps build countries local capacity to provide their own national forest data. In collaboration with member countries, FAO carries out periodic global assessments of forest resources, which are made available through reports, publications and the FAOs Web site.  The  Global Forest Resources Assessment   provides comprehensive reporting on forests worldwide every five years. FRA 2015 is the most recent global assessment. The results, data and analyses are available online in different formats, including the FAO synthesis report Global Forest Resources Assessment 2015: How are forests changing?,  the Global Forest Resources Assessment 2015 Desk Reference  containing summary tables, 234 country reports  and the FRA 2015 Infographics.  Moreover, in 2015, the journal Forest Ecology and Management published a special issue, Changes in Global Forest Resources from 1990 to 2015   reporting forest change over the period 1990–2015.     Every two years, FAO publishes the State of the Worlds Forests,   a major report covering current and emerging issues facing the forestry sector.     Since 1947, FAO has published the FAO Yearbook of Forest Products,  a compilation of statistical data on basic forest products from over 100 countries and territories of the world. It contains data on the volume of production; and the volume, value and direction of trade in forest products.      Unasylva ,  FAOs peer-reviewed journal on forestry, has been published in English, French and Spanish on a regular basis since 1947, the longest-running multilingual forestry journal in the world.     The FAO is an official sponsor of ": null
    },
    {
        "International Day of Forests": "International Day Of Forests"
    },
    {
        ", on 21 March each year, as proclaimed by the ": null
    },
    {
        "United Nations General Assembly": "United Nations General Assembly"
    },
    {
        " on 28 November 2012.  United Nations General Assembly, 28 November 2012.     Every 6 years since 1926, FAO and a host member state hold the ": null
    },
    {
        "World Forestry Congress": "World Forestry Congress"
    },
    {
        ". It is a forum for the sharing of knowledge and experience regarding the conservation, management and use of the worlds forests, and covers such issues as international dialogue, socio-economic and institutional aspects, and forest policies.     The Forestry Department is also organized geographically in several groups covering the whole worlds forest ecosystems. One of them is the Silva mediterranea workgroup, covering the pan-mediterranean region.          The FAO Fisheries and Aquaculture Department is defined through its vision and mission statements:   Vision: A world in which responsible and sustainable use of fisheries and aquaculture resources makes an appreciable contribution to human well-being, food security and poverty alleviation.   Mission: To strengthen global governance and the managerial and technical capacities of members and to lead consensus-building towards improved conservation and utilization of aquatic resources.     The work of the Fisheries and Aquaculture Department centers on the Sustainable management and use of fisheries and aquaculture resource, embracing normative as well as operational activities, whether implemented from headquarters or from the field.       ESSG is an ": null
    },
    {
        "acronym": "Acronym"
    },
    {
        " for the Global Statistics Service, the major section of the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " Food and Agriculture Organization - ": null
    },
    {
        "Statistics": "Statistics"
    },
    {
        " Division. It is responsible for updating and disseminating the .   This offers free and easy access to data for 245 countries and 35 regional areas from 1961 through the most recent year available. Enhanced features include browsing and analysis of data, an advanced interactive data download, and enhanced data exchange through web services.     The Land and Water Division maintains a database of global water statistics, Aquastat.        Every year, FAO publishes a number of major  reports related to food, agriculture, forestry, fisheries and natural resources.                                          There are a total of 197 members comprising 194 member nations, 1 member organization and 2 associate members.      ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        "   Albania": "Albania"
    },
    {
        "   Algeria": "Algeria"
    },
    {
        "   Andorra": "Andorra"
    },
    {
        "   Angola": "Angola"
    },
    {
        "   Antigua and Barbuda": "Antigua And Barbuda"
    },
    {
        "   Argentina": "Argentina"
    },
    {
        "   Armenia": "Armenia"
    },
    {
        "   Australia": "Australia"
    },
    {
        "   Austria": "Austria"
    },
    {
        "   Azerbaijan": "Azerbaijan"
    },
    {
        "   The Bahamas": "The Bahamas"
    },
    {
        "   Bahrain": "Bahrain"
    },
    {
        "   Bangladesh": "Bangladesh"
    },
    {
        "   Barbados": "Barbados"
    },
    {
        "   Belarus": "Belarus"
    },
    {
        "   Belgium": "Belgium"
    },
    {
        "   Belize": "Belize"
    },
    {
        "   Benin": "Benin"
    },
    {
        "   Bhutan": "Bhutan"
    },
    {
        "   Bolivia": "Bolivia"
    },
    {
        "   Bosnia and Herzegovina": "Bosnia And Herzegovina"
    },
    {
        "   Botswana": "Botswana"
    },
    {
        "   Brazil": "Brazil"
    },
    {
        "   Brunei": "Brunei"
    },
    {
        "   Bulgaria": "Bulgaria"
    },
    {
        "   Burkina Faso": "Burkina Faso"
    },
    {
        "   Burma": "Burma"
    },
    {
        "   Burundi": "Burundi"
    },
    {
        "   Cambodia": "Cambodia"
    },
    {
        "   Cameroon": "Cameroon"
    },
    {
        "   Canada": "Canada"
    },
    {
        "   Cape Verde": "Cape Verde"
    },
    {
        "   Central African Republic": "Central African Republic"
    },
    {
        "   Chad": "Chad"
    },
    {
        "   Chile": "Chile"
    },
    {
        "   China": "China"
    },
    {
        "   Colombia": "Colombia"
    },
    {
        "   Comoros": "Comoros"
    },
    {
        "   Democratic Republic of the Congo": "Democratic Republic Of The Congo"
    },
    {
        "   Republic of the Congo": "Republic Of The Congo"
    },
    {
        "   Cook Islands": "Cook Islands"
    },
    {
        "   Costa Rica": "Costa Rica"
    },
    {
        "   Côte dIvoire": "Côte Divoire"
    },
    {
        "   Croatia": "Croatia"
    },
    {
        "   Cuba": "Cuba"
    },
    {
        "   Cyprus": "Cyprus"
    },
    {
        "   Czech Republic": "Czech Republic"
    },
    {
        "   Denmark": "Denmark"
    },
    {
        "   Djibouti": "Djibouti"
    },
    {
        "   Dominica": "Dominica"
    },
    {
        "   Dominican Republic": "Dominican Republic"
    },
    {
        "   Ecuador": "Ecuador"
    },
    {
        "   Egypt": "Egypt"
    },
    {
        "   El Salvador": "El Salvador"
    },
    {
        "   Equatorial Guinea": "Equatorial Guinea"
    },
    {
        "   Eritrea": "Eritrea"
    },
    {
        "   Estonia": "Estonia"
    },
    {
        "   Eswatini": "Eswatini"
    },
    {
        "   Ethiopia": "Ethiopia"
    },
    {
        "   European Union": "European Union"
    },
    {
        "   Faroe Islands": "Faroe Islands"
    },
    {
        "   Fiji": "Fiji"
    },
    {
        "   Finland": "Finland"
    },
    {
        "   France": "France"
    },
    {
        "   Gabon": "Gabon"
    },
    {
        "   The Gambia": "The Gambia"
    },
    {
        "   Georgia": "Georgia"
    },
    {
        "   Germany": "Germany"
    },
    {
        "   Ghana": "Ghana"
    },
    {
        "   Greece": "Greece"
    },
    {
        "   Grenada": "Grenada"
    },
    {
        "   Guatemala": "Guatemala"
    },
    {
        "   Guinea": "Guinea"
    },
    {
        "   Guinea-Bissau": "Guinea-Bissau"
    },
    {
        "   Guyana": "Guyana"
    },
    {
        "   Haiti": "Haiti"
    },
    {
        "   Honduras": "Honduras"
    },
    {
        "   Hungary": "Hungary"
    },
    {
        "   Iceland": "Iceland"
    },
    {
        "   India": "India"
    },
    {
        "   Indonesia": "Indonesia"
    },
    {
        "   Iran": "Iran"
    },
    {
        "   Iraq": "Iraq"
    },
    {
        "   Ireland": "Republic Of Ireland"
    },
    {
        "   Israel": "Israel"
    },
    {
        "   Italy": "Italy"
    },
    {
        "   Jamaica": "Jamaica"
    },
    {
        "   Japan": "Japan"
    },
    {
        "   Jordan": "Jordan"
    },
    {
        "   Kazakhstan": "Kazakhstan"
    },
    {
        "   Kenya": "Kenya"
    },
    {
        "   Kiribati": "Kiribati"
    },
    {
        "   North Korea": "North Korea"
    },
    {
        "   South Korea": "South Korea"
    },
    {
        "   Kuwait": "Kuwait"
    },
    {
        "   Kyrgyzstan": "Kyrgyzstan"
    },
    {
        "   Laos": "Laos"
    },
    {
        "   Latvia": "Latvia"
    },
    {
        "   Lebanon": "Lebanon"
    },
    {
        "   Lesotho": "Lesotho"
    },
    {
        "   Liberia": "Liberia"
    },
    {
        "   Libya": "Libya"
    },
    {
        "   Lithuania": "Lithuania"
    },
    {
        "   Luxembourg": "Luxembourg"
    },
    {
        "   Madagascar": "Madagascar"
    },
    {
        "   Malawi": "Malawi"
    },
    {
        "   Malaysia": "Malaysia"
    },
    {
        "   Maldives": "Maldives"
    },
    {
        "   Mali": "Mali"
    },
    {
        "   Malta": "Malta"
    },
    {
        "   Marshall Islands": "Marshall Islands"
    },
    {
        "   Mauritania": "Mauritania"
    },
    {
        "   Mauritius": "Mauritius"
    },
    {
        "   Mexico": "Mexico"
    },
    {
        "   Federated States of Micronesia": "Federated States Of Micronesia"
    },
    {
        "   Moldova": "Moldova"
    },
    {
        "   Monaco": "Monaco"
    },
    {
        "   Mongolia": "Mongolia"
    },
    {
        "   Montenegro": "Montenegro"
    },
    {
        "   Morocco": "Morocco"
    },
    {
        "   Mozambique": "Mozambique"
    },
    {
        "   Namibia": "Namibia"
    },
    {
        "   Nauru": "Nauru"
    },
    {
        "   Nepal": "Nepal"
    },
    {
        "   Netherlands": "Netherlands"
    },
    {
        "   New Zealand": "New Zealand"
    },
    {
        "   Nicaragua": "Nicaragua"
    },
    {
        "   Niger": "Niger"
    },
    {
        "   Nigeria": "Nigeria"
    },
    {
        "   Niue": "Niue"
    },
    {
        "   North Macedonia": "North Macedonia"
    },
    {
        "   Norway": "Norway"
    },
    {
        "   Oman": "Oman"
    },
    {
        "   Pakistan": "Pakistan"
    },
    {
        "   Palau": "Palau"
    },
    {
        "   Panama": "Panama"
    },
    {
        "   Papua New Guinea": "Papua New Guinea"
    },
    {
        "   Paraguay": "Paraguay"
    },
    {
        "   Peru": "Peru"
    },
    {
        "   Philippines": "Philippines"
    },
    {
        "   Poland": "Poland"
    },
    {
        "   Portugal": "Portugal"
    },
    {
        "   Qatar": "Qatar"
    },
    {
        "   Romania": "Romania"
    },
    {
        "   Russian Federation": "Russian Federation"
    },
    {
        "   Rwanda": "Rwanda"
    },
    {
        "   Saint Kitts and Nevis": "Saint Kitts And Nevis"
    },
    {
        "   Saint Lucia": "Saint Lucia"
    },
    {
        "   Saint Vincent and the Grenadines": "Saint Vincent And The Grenadines"
    },
    {
        "   Samoa": "Samoa"
    },
    {
        "   San Marino": "San Marino"
    },
    {
        "   São Tomé and Príncipe": "São Tomé And Príncipe"
    },
    {
        "   Saudi Arabia": "Saudi Arabia"
    },
    {
        "   Senegal": "Senegal"
    },
    {
        "   Serbia": "Serbia"
    },
    {
        "   Seychelles": "Seychelles"
    },
    {
        "   Sierra Leone": "Sierra Leone"
    },
    {
        "   Singapore": "Singapore"
    },
    {
        "   Slovakia": "Slovakia"
    },
    {
        "   Slovenia": "Slovenia"
    },
    {
        "   Solomon Islands": "Solomon Islands"
    },
    {
        "   Somalia": "Somalia"
    },
    {
        "   South Africa": "South Africa"
    },
    {
        "   South Sudan": "South Sudan"
    },
    {
        "   Spain": "Spain"
    },
    {
        "   Sri Lanka": "Sri Lanka"
    },
    {
        "   Sudan": "Sudan"
    },
    {
        "   Suriname": "Suriname"
    },
    {
        "   Sweden": "Sweden"
    },
    {
        "   Switzerland": "Switzerland"
    },
    {
        "   Syria": "Syria"
    },
    {
        "   Tajikistan": "Tajikistan"
    },
    {
        "   Tanzania": "Tanzania"
    },
    {
        "   Thailand": "Thailand"
    },
    {
        "   Timor-Leste": "Timor-Leste"
    },
    {
        "   Togo": "Togo"
    },
    {
        "   Tokelau": "Tokelau"
    },
    {
        "   Tonga": "Tonga"
    },
    {
        "   Trinidad and Tobago": "Trinidad And Tobago"
    },
    {
        "   Tunisia": "Tunisia"
    },
    {
        "   Turkey": "Turkey"
    },
    {
        "   Turkmenistan": "Turkmenistan"
    },
    {
        "   Tuvalu": "Tuvalu"
    },
    {
        "   Uganda": "Uganda"
    },
    {
        "   Ukraine": "Ukraine"
    },
    {
        "   United Arab Emirates": "United Arab Emirates"
    },
    {
        "   United Kingdom": "United Kingdom"
    },
    {
        "   United States": "United States"
    },
    {
        "   Uruguay": "Uruguay"
    },
    {
        "   Uzbekistan": "Uzbekistan"
    },
    {
        "   Vanuatu": "Vanuatu"
    },
    {
        "   Venezuela": "Venezuela"
    },
    {
        "   Vietnam": "Vietnam"
    },
    {
        "   Yemen": "Yemen"
    },
    {
        "   Zambia": "Zambia"
    },
    {
        "   Zimbabwe": "Zimbabwe"
    },
    {
        "            The UN member state that is a non-member of the FAO is ": null
    },
    {
        "Liechtenstein": "Liechtenstein"
    },
    {
        ".       Some countries may denote specific representatives to the FAO, for instance the ": null
    },
    {
        "United States Ambassador to the Food and Agriculture Organization of the United Nations": "United States Ambassador To The Food And Agriculture Organization Of The United Nations"
    },
    {
        ", who has ambassador rank and is also part of the ": null
    },
    {
        "United States Mission to the UN Agencies in Rome": "United States Mission To The Un Agencies In Rome"
    },
    {
        ".           There has been public criticism of FAO for at least 30 years. Dissatisfaction with the organizations performance was among the reasons for the creation of two new organizations after the World Food Conference in 1974, namely the ": null
    },
    {
        "World Food Council": "World Food Council"
    },
    {
        " and the ": null
    },
    {
        "International Fund for Agricultural Development": "International Fund For Agricultural Development"
    },
    {
        "; by the early eighties there was intense rivalry among these organizations.  At the same time, the ": null
    },
    {
        "World Food Programme": "World Food Programme"
    },
    {
        ", which started as an experimental three-year programme under FAO, was growing in size and independence, with the Directors of FAO and WFP struggling for power.      Early in 1989, the organization came under attack from ": null
    },
    {
        "The Heritage Foundation": "The Heritage Foundation"
    },
    {
        ", a conservative think tank based in Washington, DC. The Foundation wrote that The sad fact is that the FAO has become essentially irrelevant in combating hunger. A bloated bureaucracy known for the mediocrity of its work and the inefficiency of its staff the FAO in recent years has become increasingly politicised .  In September of the same year, the journal  Society  published a series of articles about FAO  that included a contribution from the Heritage Foundation and a response by FAO staff member, Richard Lydiker, who was later described by the Danish Minister for Agriculture as FAOs chief spokesman for non-transparency .      ": null
    },
    {
        "Edouard Saouma": "Edouard Saouma"
    },
    {
        ", the Director-General of FAO, was also criticized in ": null
    },
    {
        "Graham Hancocks": "Graham Hancock"
    },
    {
        "book Lords of Poverty, published in 1989.   Mention is made of Saoumas fat pay packet , his autocratic management style, and his control over the flow of public information . Hancock concluded that One gets the sense from all of this of an institution that has lost its way, departed from its purely humanitarian and developmental mandate, become confused about its place in the world – about exactly what it is doing, and why. Despite the criticism, Edouard Saouma served as DG for three consecutive terms from 1976 to 1993.     In 1990, the US State Department expressed the view that The Food and Agriculture Organization has lagged behind other UN organizations in responding to US desires for improvements in program and budget processes to enhance value for money spent .      A year later, in 1991,  The Ecologist  magazine produced a special issue under the heading The UN Food and Agriculture Organization: Promoting World Hunger .  The magazine included articles that questioned FAOs policies and practices in forestry, ": null
    },
    {
        "fisheries": "Fisheries"
    },
    {
        ", ": null
    },
    {
        "aquaculture": "Aquaculture"
    },
    {
        ", and ": null
    },
    {
        "pest control": "Pest Control"
    },
    {
        ". The articles were written by experts such as ": null
    },
    {
        "Helena Norberg-Hodge": "Helena Norberg-Hodge"
    },
    {
        ", ": null
    },
    {
        "Vandana Shiva": "Vandana Shiva"
    },
    {
        ", ": null
    },
    {
        "Edward Goldsmith": "Edward Goldsmith"
    },
    {
        ", ": null
    },
    {
        "Miguel A. Altieri": "Miguel Altieri"
    },
    {
        " and ": null
    },
    {
        "Barbara Dinham": "Barbara Dinham"
    },
    {
        ".       The 2002 Food Summit organized by FAO was considered to be a waste of time by many of the official participants.  Social movements, farmers, fisherfolk, pastoralists, indigenous peoples, environmentalists, womens organizations, trade unions and NGOs expressed their collective disappointment in, and rejection of the official Declaration of the  ... Summit .      In 2004, FAO produced a controversial report called Agricultural Biotechnology: meeting the needs of the poor?. The report claimed that agricultural ": null
    },
    {
        "biotechnology": "Biotechnology"
    },
    {
        " has real potential as a new tool in the war on hunger .  In response to the report, more than 650 organizations from around the world signed an open letter in which they said FAO has broken its commitment to civil society and peasants organisations . The letter complained that organizations representing the interests of farmers had not been consulted, that FAO was siding with the biotechnology industry and, consequently, that the report raises serious questions about the independence and intellectual integrity of an important United Nations agency .  The Director General of FAO responded immediately, stating that decisions on biotechnology must be taken at the international level by competent bodies . He acknowledged, however, that biotechnology research is essentially driven by the worlds top ten ": null
    },
    {
        "transnational corporations": "Multinational Corporations"
    },
    {
        " and the private sector protects its results with ": null
    },
    {
        "patents": "Patents"
    },
    {
        " in order to earn from its investment and it concentrates on products that have no relevance to food in developing countries .      In May 2006, a British newspaper published the resignation letter of ": null
    },
    {
        "Louise Fresco": "Louise Fresco"
    },
    {
        ", one of eight Assistant Directors-General of FAO. In her letter, Fresco stated that the Organization has been unable to adapt to a new era , that our contribution and reputation have declined steadily and its leadership has not proposed bold options to overcome this crisis .      The 32nd Session of FAOs Committee on World Food Security in 2006, attended by 120 countries, was widely criticized by non-governmental organizations, but largely ignored by the mainstream media. ": null
    },
    {
        "Oxfam": "Oxfam"
    },
    {
        " called for an end to the talk-fests  while ": null
    },
    {
        "Via Campesina": "Via Campesina"
    },
    {
        " issued a statement that criticised FAOs policy of Food Security.      On 18 October 2007, the final report of an Independent External Evaluation of FAO was published. More than 400 pages in length, the evaluation was the first of its kind in the history of the Organization. It had been commissioned by decision of the 33rd Session of the FAO Conference in November 2005. The report concluded that The Organization is today in a financial and programme crisis but the problems affecting the Organization today can all be solved .  Among the problems noted by the IEE were: The Organization has been conservative and slow to adapt ; FAO currently has a heavy and costly bureaucracy , and The capacity of the Organization is declining and many of its core competencies are now imperilled . Among the solutions offered were: A new Strategic Framework , institutional culture change and reform of administrative and management systems . In conclusion the IEE stated that, If FAO did not exist it would need to be invented .     The official response from FAO came on 29 October 2007. It indicated that management supported the principal conclusion in the report of the IEE on the need for reform with growth so as to have an FAO fit for this century .  Meanwhile, hundreds of FAO staff signed a petition in support of the IEE recommendations, calling for a radical shift in management culture and spirit, depoliticization of appointments, restoration of trust between staff and management, setting strategic priorities of the organization . For a Renewal of FAO, on-line petition, November 2007     In November 2008, a Special Conference of FAO member countries agreed a US$42.6 million , three-year Immediate Plan of Action for reform with growth , as recommended by the IEE. Under the plan US$21.8 million would be spent on overhauling the financial procedures, hierarchies and human resources management.      In 2015 FAO was criticized by  The Economist  for giving a diploma to Venezuela for being one of 72 countries that had “reached the UN Millennium Development Goal of halving the percentage of their populations suffering from hunger”. It argued that the positive conclusion reached by FAO about the performance of a country experiencing major economic difficulties was based on false statistics and that the percentage of the Venezuelan population suffering from hunger had actually increased. It quoted FAO as saying that it had no reason to doubt the Venezuelan statistics.     In 2016/17 FAO was heavily criticized for recruiting ": null
    },
    {
        "Nadine Heredia Alarcón de Humala": "Nadine Heredia"
    },
    {
        ", wife of the former president of Peru, ": null
    },
    {
        "Ollanta Humala": "Ollanta Humala"
    },
    {
        ", to a senior position, at a time when she was being investigated by Peru following corruption allegations.   Critics included ": null
    },
    {
        "Transparency International": "Transparency International"
    },
    {
        ".      At the end of April 2017, FAO staff unions addressed the organizations Governing Council to complain about the practice of issuing short-term contracts that exploit employees without providing job security, social security and paid leave . Other complaints included the increasing centralization of management processes, despite claims that FAO was being decentralized, and the failure to follow ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " recommendations regarding increasing the retirement age. The staff representative also complained about the high percentage of unfilled positions, increasing the workload for others who were under pressure to deliver more with less. She also noted that contacts between Management and the staff bodies were becoming less and less frequent.      From 2013, an English-language newspaper based in Rome, The Italian Insider, made several allegations of nepotism and corruption within FAO and reported on poor management-staff relations. In June 2018, FAO and four of its officials took the paper and its editor, John Philips, to court alleging defamation, using a law dating back to the ": null
    },
    {
        "fascist era": "Italian Fascism"
    },
    {
        " in Italy.  ": null
    },
    {
        "Reporters Without Borders": "Reporters Without Borders"
    },
    {
        " condemned “the disproportionate nature of the defamation proceedings”, for which the newspaper was liable for a fine of up to Euros 100,000 and the editor at least three years in prison.  The case was adjourned until January 2019, when it was further adjourned until May 2019. The January hearing was considered by the British satirical magazine  Private Eye  to have been “one of the more surreal courtroom scenes in modern times”, involving dispute as to the meaning of an English slang word used by the Insider.        In May 2008, while talking about the ongoing ": null
    },
    {
        "world food crisis": "2007–2008 World Food Price Crisis"
    },
    {
        ", President ": null
    },
    {
        "Abdoulaye Wade": "Abdoulaye Wade"
    },
    {
        " of ": null
    },
    {
        "Senegal": "Senegal"
    },
    {
        " expressed the opinion that FAO was a waste of money and that we must scrap it . Wade said that FAO was itself largely to blame for the price rises, and that the organizations work was duplicated by other bodies that operated more efficiently, like the UNs ": null
    },
    {
        "International Fund for Agricultural Development": "International Fund For Agricultural Development"
    },
    {
        ".  However, this criticism may have had more to do with personal animosity between the President and the Director-General, himself a Senegalese, particularly in light of the significant differences in the work carried out by the two organizations.     In 2008, the FAO sponsored the ": null
    },
    {
        "High-Level Conference on World Food Security": "High-Level Conference On World Food Security"
    },
    {
        ". The summit was notable for the lack of agreement over the issue of ": null
    },
    {
        "biofuels": "Biofuels"
    },
    {
        ".      The response to the summit among ": null
    },
    {
        "non-governmental organizations": "Non-Governmental Organization"
    },
    {
        "was mixed, with ": null
    },
    {
        "Oxfam": "Oxfam"
    },
    {
        " stating that the summit in Rome was an important first step in tackling the food crisis but greater action is now needed ,  while Maryam Rahmanian of Irans Centre for Sustainable Development said We are dismayed and disgusted to see the food crisis used to further the policies that have led us to the food crisis in the first place .  As with previous food summits, civil society organizations held a parallel meeting and issued their own declaration to reject the corporate industrial and energy-intensive model of production and consumption that is the basis of continuing crises.        The FAO Conference in November 2007 unanimously welcomed the IEE report and established a Conference Committee for the Follow-up to the Independent External Evaluation of FAO to be chaired by the Independent Chairperson of Council, and open to full participation by all Members. The CoC-IEE was charged to review the IEE report and its recommendations and develop an Immediate Plan of Action for their implementation.      A comprehensive programme of organizational reform and culture change began in 2008 after the release of an Independent External Evaluation. Headquarters restructuring and delegation of decision making created a flatter more responsive structure and reduced costs. Modernizing and streamlining of administrative and operational processes took place. Improved internal teamwork and closer external partnerships coupled with upgrading of IT infrastructure and greater autonomy of FAOs decentralized offices now allows the Organization to respond quickly where needs are greatest. As FAO is primarily a knowledge based organization, investing in human resources is a top priority. Capacity building including a leadership programme, employee rotation and a new junior professional programme were established. Individual performance management, an ethics and ombudsman officer and an independent office of evaluation were designed to improve performance through learning and strengthened oversight.     In January 2012, the Director-General ": null
    },
    {
        "José Graziano da Silva": "José Graziano Da Silva"
    },
    {
        " acted upon the commitment made during his campaign to bring the FAO reform to a successful and anticipated completion. In addition, the new Director-General shifted the focus of the reform process to realization of its benefits and mainstreaming the reform into the work of the Organization. ": null
    }
]