[
    {
        "   A football team is a group of players selected to play together in the various ": null
    },
    {
        "team sports": "Team Sport"
    },
    {
        "known as ": null
    },
    {
        "football": "Football"
    },
    {
        ". Such teams could be selected to play in a match against an opposing team, to represent a football club, group, state or nation, an ": null
    },
    {
        "all-star team": "All-Star Game"
    },
    {
        " or even selected as a hypothetical team  and never play an actual match.       There are several varieties of football, notably ": null
    },
    {
        "association football": "Association Football"
    },
    {
        ", ": null
    },
    {
        "gridiron football": "Gridiron Football"
    },
    {
        ", ": null
    },
    {
        "Australian rules football": "Australian Rules Football"
    },
    {
        ", ": null
    },
    {
        "Gaelic football": "Gaelic Football"
    },
    {
        ", ": null
    },
    {
        "rugby league": "Rugby League"
    },
    {
        " and ": null
    },
    {
        "rugby union": "Rugby Union"
    },
    {
        ". The number of players selected for each team within these varieties and their associated codes can vary substantially. Sometimes, the word team is limited to those who play on the field in a match and does not always include other players who may take part as replacements or emergency players. Football squad may be used to be inclusive of these support and reserve players.     The term football club is the most commonly used for a ": null
    },
    {
        "sports club": "Sports Club"
    },
    {
        " which is an organised or incorporated body with a president, committee and a set of rules responsible for ensuring the continued playing existence of one or more teams which are selected for regular competition play . The ": null
    },
    {
        "oldest football clubs": "Oldest Football Clubs"
    },
    {
        " date back to the early 19th century. The words team and club are sometimes used interchangeably by supporters, although they typically refer to the team within the club playing in the highest division or competition.          The number of players that take part in the sport simultaneously, thus forming the team are:     Association football: 11    Indoor soccer: 6   Futsal, beach soccer, five-a-side football: 5   American football: 11   Arena football: 8   Canadian football: 12   Rugby league: 13   Rugby union: 15   Rugby sevens: 7   Gaelic football: 15   Australian rules football: 18       ": null
    },
    {
        "List of mens association football clubs": "List Of Mens Association Football Clubs"
    },
    {
        " List of mens national association football teams": "List Of Mens National Association Football Teams"
    },
    {
        " List of womens association football clubs": "List Of Womens Association Football Clubs"
    },
    {
        " List of womens national association football teams": "List Of Womens National Association Football Teams"
    },
    {
        " List of Australian rules football clubs": "List Of Australian Rules Football Clubs"
    }
]