[
    {
        "                In ": null
    },
    {
        "physics": "Physics"
    },
    {
        ", a force is any interaction that, when unopposed, will change the ": null
    },
    {
        "motion": "Motion"
    },
    {
        " of an ": null
    },
    {
        "object": "Physical Body"
    },
    {
        ". A force can cause an object with ": null
    },
    {
        "mass": "Mass"
    },
    {
        " to change its ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " , i.e., to ": null
    },
    {
        "accelerate": "Accelerate"
    },
    {
        ". Force can also be described intuitively as a push or a pull. A force has both ": null
    },
    {
        "magnitude": "Euclidean Vectorlength"
    },
    {
        " and ": null
    },
    {
        "direction": "Direction"
    },
    {
        ", making it a ": null
    },
    {
        "vector": "Vector"
    },
    {
        " quantity. It is measured in the ": null
    },
    {
        "SI unit": "Si Unit"
    },
    {
        " of ": null
    },
    {
        "newtons": "Newton"
    },
    {
        " and represented by the symbol F.     The original form of ": null
    },
    {
        "Newtons second law": "Newtons Second Law"
    },
    {
        " states that the net force acting upon an object is equal to the ": null
    },
    {
        "rate": "Time Derivative"
    },
    {
        " at which its ": null
    },
    {
        "momentum": "Momentum"
    },
    {
        " changes with time. If the mass of the object is constant, this law implies that the ": null
    },
    {
        "acceleration": "Acceleration"
    },
    {
        " of an object is directly proportional to the net force acting on the object, is in the direction of the net force, and is inversely proportional to the ": null
    },
    {
        "mass": "Mass"
    },
    {
        " of the object.     Concepts related to force include: ": null
    },
    {
        "thrust": "Thrust"
    },
    {
        ", which increases the velocity of an object; ": null
    },
    {
        "drag": "Drag"
    },
    {
        ", which decreases the velocity of an object; and ": null
    },
    {
        "torque": "Torque"
    },
    {
        ", which produces ": null
    },
    {
        "changes in rotational speed": "Angular Acceleration"
    },
    {
        " of an object. In an extended body, each part usually applies forces on the adjacent parts; the distribution of such forces through the body is the internal ": null
    },
    {
        "mechanical stress": "Stress"
    },
    {
        ". Such internal mechanical stresses cause no acceleration of that body as the forces balance one another. ": null
    },
    {
        "Pressure": "Pressure"
    },
    {
        ", the distribution of many small forces applied over an area of a body, is a simple type of stress that if unbalanced can cause the body to accelerate. Stress usually causes ": null
    },
    {
        "deformation": "Deformation"
    },
    {
        " of solid materials, or flow in ": null
    },
    {
        "fluids": "Fluid"
    },
    {
        ".       Philosophers in ": null
    },
    {
        "antiquity": "Classical Antiquity"
    },
    {
        " used the concept of force in the study of ": null
    },
    {
        "stationary": "Statics"
    },
    {
        " and ": null
    },
    {
        "moving": "Dynamics"
    },
    {
        " objects and ": null
    },
    {
        "simple machines": "Simple Machine"
    },
    {
        ", but thinkers such as ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        " and ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        " retained fundamental errors in understanding force. In part this was due to an incomplete understanding of the sometimes non-obvious force of ": null
    },
    {
        "friction": "Friction"
    },
    {
        ", and a consequently inadequate view of the nature of natural motion.  A fundamental error was the belief that a force is required to maintain motion, even at a constant velocity. Most of the previous misunderstandings about motion and force were eventually corrected by ": null
    },
    {
        "Galileo Galilei": "Galileo Galilei"
    },
    {
        " and ": null
    },
    {
        "Sir Isaac Newton": "Sir Isaac Newton"
    },
    {
        ". With his mathematical insight, ": null
    },
    {
        "Sir Isaac Newton": "Sir Isaac Newton"
    },
    {
        " formulated ": null
    },
    {
        "laws of motion": "Newtons Laws Of Motion"
    },
    {
        " that were not improved for nearly three hundred years. By the early 20th century, ": null
    },
    {
        "Einstein": "Albert Einstein"
    },
    {
        " developed a ": null
    },
    {
        "theory of relativity": "Theory Of Relativity"
    },
    {
        " that correctly predicted the action of forces on objects with increasing momenta near the speed of light, and also provided insight into the forces produced by gravitation and ": null
    },
    {
        "inertia": "Inertia"
    },
    {
        ".     With modern insights into ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " and technology that can accelerate particles close to the speed of light, ": null
    },
    {
        "particle physics": "Particle Physics"
    },
    {
        " has devised a ": null
    },
    {
        "Standard Model": "Standard Model"
    },
    {
        " to describe forces between particles smaller than atoms. The ": null
    },
    {
        "Standard Model": "Standard Model"
    },
    {
        " predicts that exchanged particles called ": null
    },
    {
        "gauge bosons": "Gauge Boson"
    },
    {
        " are the fundamental means by which forces are emitted and absorbed. Only four main interactions are known: in order of decreasing strength, they are: ": null
    },
    {
        "strong": "Strong Force"
    },
    {
        ", ": null
    },
    {
        "electromagnetic": "Electromagnetic Force"
    },
    {
        ", ": null
    },
    {
        "weak": "Weak Force"
    },
    {
        ", and ": null
    },
    {
        "gravitational": "Gravitational Force"
    },
    {
        ".    ": null
    },
    {
        "High-energy particle physics": "High Energy Physics"
    },
    {
        "observations": "Observation"
    },
    {
        " made during the 1970s and 1980s confirmed that the weak and electromagnetic forces are expressions of a more fundamental ": null
    },
    {
        "electroweak": "Electroweak"
    },
    {
        " interaction.             Since antiquity the concept of force has been recognized as integral to the functioning of each of the ": null
    },
    {
        "simple machines": "Simple Machine"
    },
    {
        ". The ": null
    },
    {
        "mechanical advantage": "Mechanical Advantage"
    },
    {
        " given by a simple machine allowed for less force to be used in exchange for that force acting over a greater distance for the same amount of ": null
    },
    {
        "work": "Work"
    },
    {
        ". Analysis of the characteristics of forces ultimately culminated in the work of ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        " who was especially famous for formulating a treatment of ": null
    },
    {
        "buoyant forces": "Buoyant Force"
    },
    {
        " inherent in ": null
    },
    {
        "fluids": "Fluid"
    },
    {
        ".     ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        " provided a ": null
    },
    {
        "philosophical": "Philosophical"
    },
    {
        " discussion of the concept of a force as an integral part of ": null
    },
    {
        "Aristotelian cosmology": "Physics"
    },
    {
        ". In Aristotles view, the terrestrial sphere contained four ": null
    },
    {
        "elements": "Classical Element"
    },
    {
        " that come to rest at different natural places therein. Aristotle believed that motionless objects on Earth, those composed mostly of the elements earth and water, to be in their natural place on the ground and that they will stay that way if left alone. He distinguished between the innate tendency of objects to find their natural place , which led to natural motion , and unnatural or forced motion, which required continued application of a force.  This theory, based on the everyday experience of how objects move, such as the constant application of a force needed to keep a cart moving, had conceptual trouble accounting for the behavior of ": null
    },
    {
        "projectiles": "Projectile"
    },
    {
        ", such as the flight of arrows. The place where the archer moves the projectile was at the start of the flight, and while the projectile sailed through the air, no discernible efficient cause acts on it. Aristotle was aware of this problem and proposed that the air displaced through the projectiles path carries the projectile to its target. This explanation demands a continuum like air for change of place in general.      ": null
    },
    {
        "Aristotelian physics": "Aristotelian Physics"
    },
    {
        " began facing criticism in ": null
    },
    {
        "medieval science": "Science In The Middle Ages"
    },
    {
        ", first by ": null
    },
    {
        "John Philoponus": "John Philoponus"
    },
    {
        " in the 6th century.     The shortcomings of Aristotelian physics would not be fully corrected until the 17th century work of ": null
    },
    {
        "Galileo Galilei": "Galileo Galilei"
    },
    {
        ", who was influenced by the late medieval idea that objects in forced motion carried an innate force of ": null
    },
    {
        "impetus": "Impetus Theory"
    },
    {
        ". Galileo constructed an experiment in which stones and cannonballs were both rolled down an incline to disprove the ": null
    },
    {
        "Aristotelian theory of motion": "Aristotelian Theory Of Gravity"
    },
    {
        ". He showed that the bodies were accelerated by gravity to an extent that was independent of their mass and argued that objects retain their ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " unless acted on by a force, for example ": null
    },
    {
        "friction": "Friction"
    },
    {
        ". Drake, Stillman . Galileo At Work. Chicago: University of Chicago Press.           Sir Isaac Newton described the motion of all objects using the concepts of ": null
    },
    {
        "inertia": "Inertia"
    },
    {
        " and force, and in doing so he found they obey certain ": null
    },
    {
        "conservation laws": "Conservation Laws"
    },
    {
        ". In 1687, Newton published his thesis  Philosophiæ Naturalis Principia Mathematica .  This is a recent translation into English by I. Bernard Cohen and Anne Whitman, with help from Julia Budenz. In this work Newton set out three laws of motion that to this day are the way forces are described in physics.          Newtons First Law of Motion states that objects continue to move in a state of constant velocity unless acted upon by an external ": null
    },
    {
        "net force": "Net Force"
    },
    {
        " . This law is an extension of Galileos insight that constant velocity was associated with a lack of net force . Newton proposed that every object with mass has an innate ": null
    },
    {
        "inertia": "Inertia"
    },
    {
        " that functions as the fundamental equilibrium natural state in place of the Aristotelian idea of the natural state of rest . That is, Newtons empirical First Law contradicts the intuitive Aristotelian belief that a net force is required to keep an object moving with constant velocity. By making rest physically indistinguishable from non-zero constant velocity, Newtons First Law directly connects inertia with the concept of ": null
    },
    {
        "relative velocities": "Galilean Relativity"
    },
    {
        ". Specifically, in systems where objects are moving with different velocities, it is impossible to determine which object is in motion and which object is at rest . The laws of physics are the same in every ": null
    },
    {
        "inertial frame of reference": "Inertial Frame Of Reference"
    },
    {
        ", that is, in all frames related by a ": null
    },
    {
        "Galilean transformation": "Galilean Transformation"
    },
    {
        ".     For instance, while traveling in a moving vehicle at a ": null
    },
    {
        "constant": "Wikt:Constant"
    },
    {
        " velocity": "Velocity"
    },
    {
        ", the laws of physics do not change as a result of its motion. If a person riding within the vehicle throws a ball straight up, that person will observe it rise vertically and fall vertically and not have to apply a force in the direction the vehicle is moving. Another person, observing the moving vehicle pass by, would observe the ball follow a curving ": null
    },
    {
        "parabolic path": "Parabola"
    },
    {
        " in the same direction as the motion of the vehicle. It is the inertia of the ball associated with its constant velocity in the direction of the vehicles motion that ensures the ball continues to move forward even as it is thrown up and falls back down. From the perspective of the person in the car, the vehicle and everything inside of it is at rest: It is the outside world that is moving with a constant speed in the opposite direction of the vehicle. Since there is no experiment that can distinguish whether it is the vehicle that is at rest or the outside world that is at rest, the two situations are considered to be ": null
    },
    {
        "physically indistinguishable": "Galilean Equivalence"
    },
    {
        ". Inertia therefore applies equally well to constant velocity motion as it does to rest.               A modern statement of Newtons Second Law is a vector equation: Newtons Principia Mathematica actually used a finite difference version of this equation based upon impulse. See  Impulse .   :       where   is the ": null
    },
    {
        "momentum": "Momentum"
    },
    {
        " of the system, and   is the net  force. If a body is in equilibrium, there is zero net force by definition . In contrast, the second law states that if there is an unbalanced force acting on an object it will result in the objects momentum changing over time.     By the definition of ": null
    },
    {
        "momentum": "Momentumlinear Momentum Of A Particle"
    },
    {
        ",   :         where m is the ": null
    },
    {
        "mass": "Mass"
    },
    {
        " and   is the ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        ".      If Newtons second law is applied to a system of ": null
    },
    {
        "constant mass": "Newtons Laws Of Motionopen Systems"
    },
    {
        ", It is important to note that we cannot derive a general expression for Newtons second law for variable mass systems by treating the mass in F dP/dt d as a variable. We can use F dP/dt to analyze variable mass systems only if we apply it to an entire system of constant mass having parts among which there is an interchange of mass.  m may be moved outside the derivative operator. The equation then becomes   :   m    By substituting the definition of ": null
    },
    {
        "acceleration": "Acceleration"
    },
    {
        ", the algebraic version of ": null
    },
    {
        "Newtons Second Law": "Newtons Second Law"
    },
    {
        " is derived:   :   m    Newton never explicitly stated the formula in the reduced form above.      Newtons Second Law asserts the direct proportionality of acceleration to force and the inverse proportionality of acceleration to mass. Accelerations can be defined through ": null
    },
    {
        "kinematic": "Kinematic"
    },
    {
        " measurements. However, while kinematics are well-described through ": null
    },
    {
        "reference frame": "Frame Of Reference"
    },
    {
        " analysis in advanced physics, there are still deep questions that remain as to what is the proper definition of mass. ": null
    },
    {
        "General relativity": "General Relativity"
    },
    {
        " offers an equivalence between ": null
    },
    {
        "space-time": "Space-Time"
    },
    {
        " and mass, but lacking a coherent theory of ": null
    },
    {
        "quantum gravity": "Quantum Gravity"
    },
    {
        ", it is unclear as to how or whether this connection is relevant on microscales. With some justification, Newtons second law can be taken as a quantitative definition of mass by writing the law as an equality; the relative units of force and mass then are fixed.     The use of Newtons Second Law as a definition of force has been disparaged in some of the more rigorous textbooks,   One exception to this rule is:    Translated by: J.B. Sykes, A.D. Petford, and C.L. Petford. . In section 7, pp. 12–14, this book defines force as dp/dt. because it is essentially a mathematical ": null
    },
    {
        "truism": "Truism"
    },
    {
        ". Notable physicists, philosophers and mathematicians who have sought a more explicit definition of the concept of force include ": null
    },
    {
        "Ernst Mach": "Ernst Mach"
    },
    {
        " and ": null
    },
    {
        "Walter Noll": "Walter Noll"
    },
    {
        ".       Newtons Second Law can be used to measure the strength of forces. For instance, knowledge of the masses of ": null
    },
    {
        "planets": "Planet"
    },
    {
        " along with the accelerations of their ": null
    },
    {
        "orbits": "Orbit"
    },
    {
        " allows scientists to calculate the gravitational forces on planets.          Whenever one body exerts a force on another, the latter simultaneously exerts an equal and opposite force on the first. In vector form, if   is the force of body 1 on body 2 and   that of body 2 on body 1, then   :     This law is sometimes referred to as the action-reaction law, with     called the action and   -  the  reaction .     Newtons Third Law is a result of applying ": null
    },
    {
        "symmetry": "Symmetry"
    },
    {
        " to situations where forces can be attributed to the presence of different objects. The third law means that all forces are interactions between different bodies,  Any single force is only one aspect of a mutual interaction between two bodies.  and thus that there is no such thing as a unidirectional force or a force that acts on only one body.     In a system composed of object 1 and object 2, the net force on the system due to their mutual interactions is zero:   :     More generally, in a ": null
    },
    {
        "closed system": "Closed System"
    },
    {
        " of particles, all internal forces are balanced. The particles may accelerate with respect to each other but the ": null
    },
    {
        "center of mass": "Center Of Mass"
    },
    {
        " of the system will not accelerate. If an external force acts on the system, it will make the center of mass accelerate in proportion to the magnitude of the external force divided by the mass of the system.      Combining Newtons Second and Third Laws, it is possible to show that the ": null
    },
    {
        "linear momentum of a system is conserved": "Conservation Of Momentum"
    },
    {
        ".  In a system of two particles, if     is the momentum of object 1 and     the momentum of object 2, then   :   +     +   0.   Using similar arguments, this can be generalized to a system with an arbitrary number of particles. In general, as long as all forces are due to the interaction of objects with mass, it is possible to define a system such that net momentum is never lost nor gained.       In the ": null
    },
    {
        "special theory of relativity": "Special Theory Of Relativity"
    },
    {
        ", mass and ": null
    },
    {
        "energy": "Energy"
    },
    {
        " are equivalent . When an objects velocity increases, so does its energy and hence its mass equivalent . It thus requires more force to accelerate it the same amount than it did at a lower velocity. Newtons Second Law   :       remains valid because it is a mathematical definition.   But for relativistic momentum to be conserved, it must be redefined as:   :       where m0 is the ": null
    },
    {
        "rest mass": "Rest Mass"
    },
    {
        " and c the ": null
    },
    {
        "speed of light": "Speed Of Light"
    },
    {
        ".     The relativistic expression relating force and acceleration for a particle with constant non-zero ": null
    },
    {
        "rest mass": "Rest Mass"
    },
    {
        " m moving in the x direction is:   :       where   :       is called the ": null
    },
    {
        "Lorentz factor": "Lorentz Factor"
    },
    {
        ".      In the early history of relativity, the expressions   m and   m were called ": null
    },
    {
        "longitudinal and transverse mass": "Mass In Special Relativitytransverse And Longitudinal Mass"
    },
    {
        ". Relativistic force does not produce a constant acceleration, but an ever-decreasing acceleration as the object approaches the speed of light. Note that   approaches asymptotically an infinite value and is ": null
    },
    {
        "undefined": "Division By Zero"
    },
    {
        " for an object with a non-zero ": null
    },
    {
        "rest mass": "Invariant Mass"
    },
    {
        " as it approaches the speed of light, and the theory yields no prediction at that speed.     If v is very small compared to c , then   is very close to 1 and   : F m a   is a close approximation. Even for use in relativity, however, one can restore the form of   : F  mA        through the use of ": null
    },
    {
        "four-vectors": "Four-Vectors"
    },
    {
        ". This relation is correct in relativity when F  is the ": null
    },
    {
        "four-force": "Four-Force"
    },
    {
        ", m is the ": null
    },
    {
        "invariant mass": "Invariant Mass"
    },
    {
        ", and A  is the ": null
    },
    {
        "four-acceleration": "Four-Acceleration"
    },
    {
        ".           Since forces are perceived as pushes or pulls, this can provide an intuitive understanding for describing forces. As with other physical concepts , the intuitive understanding of forces is quantified using precise ": null
    },
    {
        "operational definitions": "Operational Definition"
    },
    {
        " that are consistent with direct ": null
    },
    {
        "observations": "Sensory Perception"
    },
    {
        " and ": null
    },
    {
        "compared to a standard measurement scale": "Measurement"
    },
    {
        ". Through experimentation, it is determined that laboratory measurements of forces are fully consistent with the ": null
    },
    {
        "conceptual definition": "Conceptual Definition"
    },
    {
        " of force offered by ": null
    },
    {
        "Newtonian mechanics": "Newtonian Mechanics"
    },
    {
        ".     Forces act in a particular ": null
    },
    {
        "direction": "Direction"
    },
    {
        " and have ": null
    },
    {
        "sizes": "Magnitude"
    },
    {
        " dependent upon how strong the push or pull is. Because of these characteristics, forces are classified as ": null
    },
    {
        "vector quantities": "Euclidean Vector"
    },
    {
        " . This means that forces follow a different set of mathematical rules than physical quantities that do not have direction . For example, when determining what happens when two forces act on the same object, it is necessary to know both the magnitude and the direction of both forces to calculate the ": null
    },
    {
        "result": "Resultant"
    },
    {
        ". If both of these pieces of information are not known for each force, the situation is ambiguous. For example, if you know that two people are pulling on the same rope with known magnitudes of force but you do not know which direction either person is pulling, it is impossible to determine what the acceleration of the rope will be. The two people could be pulling against each other as in ": null
    },
    {
        "tug of war": "Tug Of War"
    },
    {
        " or the two people could be pulling in the same direction. In this simple ": null
    },
    {
        "one-dimensional": "One-Dimensional"
    },
    {
        " example, without knowing the direction of the forces it is impossible to decide whether the net force is the result of adding the two force magnitudes or subtracting one from the other. Associating forces with vectors avoids such problems.     Historically, forces were first quantitatively investigated in conditions of ": null
    },
    {
        "static equilibrium": "Static Equilibrium"
    },
    {
        " where several forces canceled each other out. Such experiments demonstrate the crucial properties that forces are additive ": null
    },
    {
        "vector quantities": "Vector"
    },
    {
        "magnitude": "Magnitude"
    },
    {
        " and direction. When two forces act on a ": null
    },
    {
        "point particle": "Point Particle"
    },
    {
        ", the resulting force, the resultant , can be determined by following the ": null
    },
    {
        "parallelogram rule": "Parallelogram Rule"
    },
    {
        " of ": null
    },
    {
        "vector addition": "Vector Addition"
    },
    {
        "Free-body diagrams": "Free-Body Diagram"
    },
    {
        " can be used as a convenient way to keep track of forces acting on a system. Ideally, these diagrams are drawn with the angles and relative magnitudes of the force vectors preserved so that ": null
    },
    {
        "graphical vector addition": "Vector"
    },
    {
        " can be done to determine the net force.      As well as being added, forces can also be resolved into independent components at ": null
    },
    {
        "right angles": "Right Angle"
    },
    {
        " to each other. A horizontal force pointing northeast can therefore be split into two forces, one pointing north, and one pointing east. Summing these component forces using vector addition yields the original force. Resolving force vectors into components of a set of ": null
    },
    {
        "basis vectors": "Basis Vector"
    },
    {
        " is often a more mathematically clean way to describe forces than using magnitudes and directions.  This is because, for ": null
    },
    {
        "orthogonal": "Orthogonal"
    },
    {
        " components, the components of the vector sum are uniquely determined by the scalar addition of the components of the individual vectors. Orthogonal components are independent of each other because forces acting at ninety degrees to each other have no effect on the magnitude or direction of the other. Choosing a set of orthogonal basis vectors is often done by considering what set of basis vectors will make the mathematics most convenient. Choosing a basis vector that is in the same direction as one of the forces is desirable, since that force would then have only one non-zero component. Orthogonal force vectors can be three-dimensional with the third component being at right-angles to the other two.       ": null
    },
    {
        "Equilibrium": "Mechanical Equilibrium"
    },
    {
        " occurs when the resultant force acting on a point particle is zero . When dealing with an extended body, it is also necessary that the net torque be zero.     There are two kinds of equilibrium: ": null
    },
    {
        "static equilibrium": "Static Equilibrium"
    },
    {
        " and ": null
    },
    {
        "dynamic equilibrium": "Dynamic Equilibrium"
    },
    {
        ".     Static   Static equilibrium was understood well before the invention of classical mechanics. Objects that are at rest have zero net force acting on them.      The simplest case of static equilibrium occurs when two forces are equal in magnitude but opposite in direction. For example, an object on a level surface is pulled downward toward the center of the Earth by the force of gravity. At the same time, a force is applied by the surface that resists the downward force with equal upward force . The situation produces zero net force and hence no acceleration.     Pushing against an object that rests on a frictional surface can result in a situation where the object does not move because the applied force is opposed by ": null
    },
    {
        "static friction": "Static Friction"
    },
    {
        ", generated between the object and the table surface. For a situation with no movement, the static friction force exactly balances the applied force resulting in no acceleration. The static friction increases or decreases in response to the applied force up to an upper limit determined by the characteristics of the contact between the surface and the object.     A static equilibrium between two forces is the most usual way of measuring forces, using simple devices such as ": null
    },
    {
        "weighing scales": "Weighing Scale"
    },
    {
        " and ": null
    },
    {
        "spring balances": "Spring Balance"
    },
    {
        ". For example, an object suspended on a vertical ": null
    },
    {
        "spring scale": "Spring Scale"
    },
    {
        " experiences the force of gravity acting on the object balanced by a force applied by the spring reaction force , which equals the objects weight. Using such tools, some quantitative force laws were discovered: that the force of gravity is proportional to volume for objects of constant ": null
    },
    {
        "density": "Density"
    },
    {
        " ; ": null
    },
    {
        "Archimedes principle": "Archimedes Principle"
    },
    {
        " for buoyancy; Archimedes analysis of the ": null
    },
    {
        "lever": "Lever"
    },
    {
        "; ": null
    },
    {
        "Boyles law": "Boyles Law"
    },
    {
        " for gas pressure; and ": null
    },
    {
        "Hookes law": "Hookes Law"
    },
    {
        " for springs. These were all formulated and experimentally verified before Isaac Newton expounded his ": null
    },
    {
        "Three Laws of Motion": "Newtons Laws Of Motion"
    },
    {
        ".     Dynamic      Dynamic equilibrium was first described by ": null
    },
    {
        "Galileo": "Galileo"
    },
    {
        " who noticed that certain assumptions of Aristotelian physics were contradicted by observations and ": null
    },
    {
        "logic": "Logic"
    },
    {
        ". Galileo realized that ": null
    },
    {
        "simple velocity addition": "Galilean Relativity"
    },
    {
        " demands that the concept of an absolute ": null
    },
    {
        "rest frame": "Rest Frame"
    },
    {
        " did not exist. Galileo concluded that motion in a constant ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " was completely equivalent to rest. This was contrary to Aristotles notion of a natural state of rest that objects with mass naturally approached. Simple experiments showed that Galileos understanding of the equivalence of constant velocity and rest were correct. For example, if a mariner dropped a cannonball from the crows nest of a ship moving at a constant velocity, Aristotelian physics would have the cannonball fall straight down while the ship moved beneath it. Thus, in an Aristotelian universe, the falling cannonball would land behind the foot of the mast of a moving ship. However, when this experiment is actually conducted, the cannonball always falls at the foot of the mast, as if the cannonball knows to travel with the ship despite being separated from it. Since there is no forward horizontal force being applied on the cannonball as it falls, the only conclusion left is that the cannonball continues to move with the same velocity as the boat as it falls. Thus, no force is required to keep the cannonball moving at the constant forward velocity.     Moreover, any object traveling at a constant velocity must be subject to zero net force . This is the definition of dynamic equilibrium: when all the forces on an object balance but it still moves at a constant velocity.     A simple case of dynamic equilibrium occurs in constant velocity motion across a surface with ": null
    },
    {
        "kinetic friction": "Kinetic Friction"
    },
    {
        ". In such a situation, a force is applied in the direction of motion while the kinetic friction force exactly opposes the applied force. This results in zero net force, but since the object started with a non-zero velocity, it continues to move with a non-zero velocity. Aristotle misinterpreted this motion as being caused by the applied force. However, when kinetic friction is taken into consideration it is clear that there is no net force causing constant velocity motion.          The notion force keeps its meaning in ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ", though one is now dealing with operators instead of classical variables and though the physics is now described by the ": null
    },
    {
        "Schrödinger equation": "Schrödinger Equation"
    },
    {
        " instead of ": null
    },
    {
        "Newtonian equations": "Newtonian Mechanics"
    },
    {
        ". This has the consequence that the results of a measurement are now sometimes quantized , i.e. they appear in discrete portions. This is, of course, difficult to imagine in the context of forces . However, the ": null
    },
    {
        "potentials": "Potential"
    },
    {
        " V or ": null
    },
    {
        "fields": "Field"
    },
    {
        ", from which the forces generally can be derived, are treated similarly to classical position variables, i.e., V  .     This becomes different only in the framework of ": null
    },
    {
        "quantum field theory": "Quantum Field Theory"
    },
    {
        ", where these fields are also quantized.     However, already in quantum mechanics there is one caveat , namely the particles acting onto each other do not only possess the spatial variable, but also a discrete intrinsic ": null
    },
    {
        "angular momentum-like": "Angular Momentum"
    },
    {
        " variable called the ": null
    },
    {
        "spin": "Spin"
    },
    {
        " , and there is the ": null
    },
    {
        "Pauli exclusion principle": "Pauli Exclusion Principle"
    },
    {
        " relating the space and the spin variables. Depending on the value of the spin, identical particles split into two different classes, ": null
    },
    {
        "fermions": "Fermion"
    },
    {
        " and ": null
    },
    {
        "bosons": "Boson"
    },
    {
        ". If two identical fermions have a symmetric spin function the spatial variables must be antisymmetric , and vice versa, i.e. for antiparallel spins the position variables must be symmetric . Thus in the case of two fermions there is a strictly negative correlation between spatial and spin variables, whereas for two bosons the correlation is strictly positive.     Thus the notion force loses already part of its meaning.             In modern ": null
    },
    {
        "particle physics": "Particle Physics"
    },
    {
        ", forces and the acceleration of particles are explained as a mathematical by-product of exchange of momentum-carrying ": null
    },
    {
        "gauge bosons": "Gauge Boson"
    },
    {
        ". With the development of ": null
    },
    {
        "quantum field theory": "Quantum Field Theory"
    },
    {
        " and ": null
    },
    {
        "general relativity": "General Relativity"
    },
    {
        ", it was realized that force is a redundant concept arising from ": null
    },
    {
        "conservation of momentum": "Conservation Of Momentum"
    },
    {
        " . The conservation of momentum can be directly derived from the homogeneity or ": null
    },
    {
        "symmetry": "Symmetry In Physics"
    },
    {
        " of ": null
    },
    {
        "space": "Space"
    },
    {
        " and so is usually considered more fundamental than the concept of a force. Thus the currently known ": null
    },
    {
        "fundamental forces": "Fundamental Forces"
    },
    {
        " are considered more accurately to be ": null
    },
    {
        "fundamental interactions": "Fundamental Interactions"
    },
    {
        " .   When particle A emits or absorbs virtual particle B, a momentum conservation results in recoil of particle A making impression of repulsion or attraction between particles A A exchanging by B. This description applies to all forces arising from fundamental interactions. While sophisticated mathematical descriptions are needed to predict, in full detail, the accurate result of such interactions, there is a conceptually simple way to describe such interactions through the use of Feynman diagrams. In a Feynman diagram, each matter particle is represented as a straight line  traveling through time, which normally increases up or to the right in the diagram. Matter and anti-matter particles are identical except for their direction of propagation through the Feynman diagram. World lines of particles intersect at interaction vertices, and the Feynman diagram represents any force arising from an interaction as occurring at the vertex with an associated instantaneous change in the direction of the particle world lines. Gauge bosons are emitted away from the vertex as wavy lines and, in the case of virtual particle exchange, are absorbed at an adjacent vertex.      The utility of Feynman diagrams is that other types of physical phenomena that are part of the general picture of ": null
    },
    {
        "fundamental interactions": "Fundamental Interaction"
    },
    {
        " but are conceptually separate from forces can also be described using the same rules. For example, a Feynman diagram can describe in succinct detail how a ": null
    },
    {
        "neutron": "Neutron"
    },
    {
        " decays": "Beta Decay"
    },
    {
        " into an ": null
    },
    {
        "electron": "Electron"
    },
    {
        ", ": null
    },
    {
        "proton": "Proton"
    },
    {
        ", and ": null
    },
    {
        "neutrino": "Neutrino"
    },
    {
        ", an interaction mediated by the same gauge boson that is responsible for the ": null
    },
    {
        "weak nuclear force": "Weak Nuclear Force"
    },
    {
        ".            All of the known forces of the universe are classified into four ": null
    },
    {
        "fundamental interactions": "Fundamental Interaction"
    },
    {
        ". The ": null
    },
    {
        "strong": "Strong Force"
    },
    {
        " and the ": null
    },
    {
        "weak": "Weak Force"
    },
    {
        " forces are ": null
    },
    {
        "nuclear forces": "Nuclear Force"
    },
    {
        " that act only at very short distances, and are responsible for the interactions between ": null
    },
    {
        "subatomic particles": "Subatomic Particle"
    },
    {
        ", including ": null
    },
    {
        "nucleons": "Nucleon"
    },
    {
        " and compound ": null
    },
    {
        "nuclei": "Atomic Nucleus"
    },
    {
        ". The ": null
    },
    {
        "electromagnetic force": "Electromagnetic Force"
    },
    {
        " acts between ": null
    },
    {
        "electric charges": "Electric Charge"
    },
    {
        ", and the ": null
    },
    {
        "gravitational force": "Gravitational Force"
    },
    {
        " acts between ": null
    },
    {
        "mass": "Mass"
    },
    {
        "es. All other forces in nature derive from these four fundamental interactions. For example, ": null
    },
    {
        "friction": "Friction"
    },
    {
        " is a manifestation of the electromagnetic force acting between ": null
    },
    {
        "atoms": "Atoms"
    },
    {
        " of two surfaces, and the ": null
    },
    {
        "Pauli exclusion principle": "Pauli Exclusion Principle"
    },
    {
        ",  which does not permit atoms to pass through each other. Similarly, the forces in ": null
    },
    {
        "springs": "Spring"
    },
    {
        ", modeled by ": null
    },
    {
        "Hookes law": "Hookes Law"
    },
    {
        ", are the result of electromagnetic forces and the Pauli exclusion principle acting together to return an object to its ": null
    },
    {
        "equilibrium": "Mechanical Equilibrium"
    },
    {
        " position. ": null
    },
    {
        "Centrifugal forces": "Centrifugal Force"
    },
    {
        " are ": null
    },
    {
        "acceleration": "Acceleration"
    },
    {
        " forces that arise simply from the acceleration of ": null
    },
    {
        "rotating": "Rotation"
    },
    {
        " frames of reference": "Frames Of Reference"
    },
    {
        ".       The fundamental theories for forces developed from the ": null
    },
    {
        "unification": "Unified Field Theory"
    },
    {
        " of different ideas. For example, Sir. ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        " unified, with his universal theory of ": null
    },
    {
        "gravitation": "Gravitation"
    },
    {
        ", the force responsible for objects falling near the surface of the ": null
    },
    {
        "Earth": "Earth"
    },
    {
        " with the force responsible for the falling of celestial bodies about the Earth  and around the Sun . ": null
    },
    {
        "Michael Faraday": "Michael Faraday"
    },
    {
        " and ": null
    },
    {
        "James Clerk Maxwell": "James Clerk Maxwell"
    },
    {
        " demonstrated that electric and magnetic forces were unified through a theory of electromagnetism. In the 20th century, the development of ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " led to a modern understanding that the first three fundamental forces are manifestations of matter  interacting by exchanging ": null
    },
    {
        "virtual particles": "Virtual Particle"
    },
    {
        " called ": null
    },
    {
        "gauge bosons": "Gauge Boson"
    },
    {
        ".  This ": null
    },
    {
        "standard model": "Standard Model"
    },
    {
        " of particle physics assumes a similarity between the forces and led scientists to predict the unification of the weak and electromagnetic forces in ": null
    },
    {
        "electroweak": "Electroweak"
    },
    {
        " theory, which was subsequently confirmed by observation. The complete formulation of the standard model predicts an as yet unobserved ": null
    },
    {
        "Higgs mechanism": "Higgs Mechanism"
    },
    {
        ", but observations such as ": null
    },
    {
        "neutrino oscillations": "Neutrino Oscillation"
    },
    {
        " suggest that the standard model is incomplete. A ": null
    },
    {
        "Grand Unified Theory": "Grand Unified Theory"
    },
    {
        " that allows for the combination of the electroweak interaction with the strong force is held out as a possibility with candidate theories such as ": null
    },
    {
        "supersymmetry": "Supersymmetry"
    },
    {
        " proposed to accommodate some of the outstanding ": null
    },
    {
        "unsolved problems in physics": "Unsolved Problems In Physics"
    },
    {
        ". Physicists are still attempting to develop self-consistent unification models that would combine all four fundamental interactions into a ": null
    },
    {
        "theory of everything": "Theory Of Everything"
    },
    {
        ". Einstein tried and failed at this endeavor, but currently the most popular approach to answering this question is ": null
    },
    {
        "string theory": "String Theory"
    },
    {
        ".                   What we now call gravity was not identified as a universal force until the work of Isaac Newton. Before Newton, the tendency for objects to fall towards the Earth was not understood to be related to the motions of celestial objects. Galileo was instrumental in describing the characteristics of falling objects by determining that the ": null
    },
    {
        "acceleration": "Acceleration"
    },
    {
        " of every object in ": null
    },
    {
        "free-fall": "Free-Fall"
    },
    {
        " was constant and independent of the mass of the object. Today, this ": null
    },
    {
        "acceleration due to gravity": "Gravitational Acceleration"
    },
    {
        " towards the surface of the Earth is usually designated as     and has a magnitude of about 9.81 ": null
    },
    {
        "meters": "Meter"
    },
    {
        " per second squared , and points toward the center of the Earth.  This observation means that the force of gravity on an object at the Earths surface is directly proportional to the objects mass. Thus an object that has a mass of m will experience a force:   :   m      For an object in free-fall, this force is unopposed and the net force on the object is its weight. For objects not in free-fall, the force of gravity is opposed by the reaction forces applied by their supports. For example, a person standing on the ground experiences zero net force, since a ": null
    },
    {
        "normal force": "Normal Force"
    },
    {
        " is exerted by the ground upward on the person that counterbalances his weight that is directed downward.     Newtons contribution to gravitational theory was to unify the motions of heavenly bodies, which Aristotle had assumed were in a natural state of constant motion, with falling motion observed on the Earth. He proposed a ": null
    },
    {
        "law of gravity": "Newtons Law Of Gravity"
    },
    {
        " that could account for the celestial motions that had been described earlier using ": null
    },
    {
        "Keplers laws of planetary motion": "Keplers Laws Of Planetary Motion"
    },
    {
        ".     Newton came to realize that the effects of gravity might be observed in different ways at larger distances. In particular, Newton determined that the acceleration of the Moon around the Earth could be ascribed to the same force of gravity if the acceleration due to gravity decreased as an ": null
    },
    {
        "inverse square law": "Inverse Square Law"
    },
    {
        ". Further, Newton realized that the acceleration of a body due to gravity is proportional to the mass of the other attracting body. Combining these ideas gives a formula that relates the mass and the radius of the Earth to the gravitational acceleration:   :         where the vector direction is given by   , is the ": null
    },
    {
        "unit vector": "Unit Vector"
    },
    {
        " directed outward from the center of the Earth.     In this equation, a dimensional constant G is used to describe the relative strength of gravity. This constant has come to be known as ": null
    },
    {
        "Newtons Universal Gravitation Constant": "Newtons Universal Gravitation Constant"
    },
    {
        ",  though its value was unknown in Newtons lifetime. Not until 1798 was ": null
    },
    {
        "Henry Cavendish": "Henry Cavendish"
    },
    {
        " able to make the first measurement of G using a ": null
    },
    {
        "torsion balance": "Torsion Balance"
    },
    {
        "; this was widely reported in the press as a measurement of the mass of the Earth since knowing G could allow one to solve for the Earths mass given the above equation. Newton, however, realized that since all celestial bodies followed the same ": null
    },
    {
        "laws of motion": "Keplers Laws"
    },
    {
        ", his law of gravity had to be universal. Succinctly stated, ": null
    },
    {
        "Newtons Law of Gravitation": "Newtons Law Of Gravitation"
    },
    {
        " states that the force on a spherical object of mass m1 due to the gravitational pull of mass m2 is   :         where r is the distance between the two objects centers of mass and     is the unit vector pointed in the direction away from the center of the first object toward the center of the second object.     This formula was powerful enough to stand as the basis for all subsequent descriptions of motion within the solar system until the 20th century. During that time, sophisticated methods of ": null
    },
    {
        "perturbation analysis": "Perturbation Analysis"
    },
    {
        "  were invented to calculate the deviations of ": null
    },
    {
        "orbits": "Orbit"
    },
    {
        " due to the influence of multiple bodies on a ": null
    },
    {
        "planet": "Planet"
    },
    {
        ", ": null
    },
    {
        "moon": "Moon"
    },
    {
        ", ": null
    },
    {
        "comet": "Comet"
    },
    {
        ", or ": null
    },
    {
        "asteroid": "Asteroid"
    },
    {
        ". The formalism was exact enough to allow mathematicians to predict the existence of the planet ": null
    },
    {
        "Neptune": "Neptune"
    },
    {
        " before it was observed.       ": null
    },
    {
        "Mercurys": "Mercury"
    },
    {
        " orbit, however, did not match that predicted by Newtons Law of Gravitation. Some astrophysicists predicted the existence of another planet  that would explain the discrepancies; however no such planet could be found. When ": null
    },
    {
        "Albert Einstein": "Albert Einstein"
    },
    {
        " formulated his theory of ": null
    },
    {
        "general relativity": "General Relativity"
    },
    {
        " he turned his attention to the problem of Mercurys orbit and found that his theory added ": null
    },
    {
        "a correction, which could account for the discrepancy": "Perihelion Precession Of Mercury"
    },
    {
        ". This was the first time that Newtons Theory of Gravity had been shown to be inexact.      Since then, general relativity has been acknowledged as the theory that best explains gravity. In GR, gravitation is not viewed as a force, but rather, objects moving freely in gravitational fields travel under their own inertia in ": null
    },
    {
        "straight lines": "Geodesic"
    },
    {
        " through ": null
    },
    {
        "curved space-time": "Curved Space-Time"
    },
    {
        " – defined as the shortest space-time path between two space-time events. From the perspective of the object, all motion occurs as if there were no gravitation whatsoever. It is only when observing the motion in a global sense that the curvature of space-time can be observed and the force is inferred from the objects curved path. Thus, the straight line path in space-time is seen as a curved line in space, and it is called the  ballistic trajectory  of the object. For example, a ": null
    },
    {
        "basketball": "Basketball"
    },
    {
        " thrown from the ground moves in a ": null
    },
    {
        "parabola": "Parabola"
    },
    {
        ", as it is in a uniform gravitational field. Its space-time trajectory is almost a straight line, slightly curved . The time derivative of the changing momentum of the object is what we label as gravitational force .          The ": null
    },
    {
        "electrostatic force": "Electrostatic Force"
    },
    {
        " was first described in 1784 by Coulomb as a force that existed intrinsically between two ": null
    },
    {
        "charges": "Electric Charge"
    },
    {
        ".  The properties of the electrostatic force were that it varied as an ": null
    },
    {
        "inverse square law": "Inverse Square Law"
    },
    {
        " directed in the ": null
    },
    {
        "radial direction": "Polar Coordinates"
    },
    {
        ", was both attractive and repulsive , was independent of the mass of the charged objects, and followed the ": null
    },
    {
        "superposition principle": "Superposition Principle"
    },
    {
        ". ": null
    },
    {
        "Coulombs law": "Coulombs Law"
    },
    {
        " unifies all these observations into one succinct statement.      Subsequent mathematicians and physicists found the construct of the  electric field  to be useful for determining the electrostatic force on an electric charge at any point in space. The electric field was based on using a hypothetical ": null
    },
    {
        "test charge": "Test Charge"
    },
    {
        " anywhere in space and then using Coulombs Law to determine the electrostatic force.  Thus the electric field anywhere in space is defined as   :       where q is the magnitude of the hypothetical test charge.     Meanwhile, the ": null
    },
    {
        "Lorentz force": "Lorentz Force"
    },
    {
        " of ": null
    },
    {
        "magnetism": "Magnetism"
    },
    {
        " was discovered to exist between two ": null
    },
    {
        "electric currents": "Electric Current"
    },
    {
        ". It has the same mathematical character as Coulombs Law with the proviso that like currents attract and unlike currents repel. Similar to the electric field, the ": null
    },
    {
        "magnetic field": "Magnetic Field"
    },
    {
        " can be used to determine the magnetic force on an electric current at any point in space. In this case, the magnitude of the magnetic field was determined to be   : B     where I is the magnitude of the hypothetical test current and     is the length of hypothetical wire through which the test current flows. The magnetic field exerts a force on all ": null
    },
    {
        "magnets": "Magnet"
    },
    {
        " including, for example, those used in ": null
    },
    {
        "compass": "Compass"
    },
    {
        "es. The fact that the ": null
    },
    {
        "Earths magnetic field": "Geomagnetism"
    },
    {
        " is aligned closely with the orientation of the Earths ": null
    },
    {
        "axis": "Rotation"
    },
    {
        " causes compass magnets to become oriented because of the magnetic force pulling on the needle.     Through combining the definition of electric current as the time rate of change of electric charge, a rule of ": null
    },
    {
        "vector multiplication": "Cross Product"
    },
    {
        " called ": null
    },
    {
        "Lorentzs Law": "Lorentz Force"
    },
    {
        " describes the force on a charge moving in a magnetic field. The connection between electricity and magnetism allows for the description of a unified electromagnetic force that acts on a charge. This force can be written as a sum of the electrostatic force and the magnetic force . Fully stated, this is the law:   :   q     where     is the electromagnetic force, q is the magnitude of the charge of the particle,     is the electric field,     is the ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " of the particle that is ": null
    },
    {
        "crossed": "Cross Product"
    },
    {
        " with the magnetic field .     The origin of electric and magnetic fields would not be fully explained until 1864 when ": null
    },
    {
        "James Clerk Maxwell": "James Clerk Maxwell"
    },
    {
        " unified a number of earlier theories into a set of 20 scalar equations, which were later reformulated into 4 vector equations by ": null
    },
    {
        "Oliver Heaviside": "Oliver Heaviside"
    },
    {
        " and ": null
    },
    {
        "Josiah Willard Gibbs": "Josiah Willard Gibbs"
    },
    {
        ". ,  These ": null
    },
    {
        "Maxwell Equations": "Maxwell Equations"
    },
    {
        " fully described the sources of the fields as being stationary and moving charges, and the interactions of the fields themselves. This led Maxwell to discover that electric and magnetic fields could be self-generating through a ": null
    },
    {
        "wave": "Wave"
    },
    {
        " that traveled at a speed that he calculated to be the ": null
    },
    {
        "speed of light": "Speed Of Light"
    },
    {
        ". This insight united the nascent fields of electromagnetic theory with ": null
    },
    {
        "optics": "Optics"
    },
    {
        " and led directly to a complete description of the ": null
    },
    {
        "electromagnetic spectrum": "Electromagnetic Spectrum"
    },
    {
        ".        However, attempting to reconcile electromagnetic theory with two observations, the ": null
    },
    {
        "photoelectric effect": "Photoelectric Effect"
    },
    {
        ", and the nonexistence of the ": null
    },
    {
        "ultraviolet catastrophe": "Ultraviolet Catastrophe"
    },
    {
        ", proved troublesome. Through the work of leading theoretical physicists, a new theory of electromagnetism was developed using quantum mechanics. This final modification to electromagnetic theory ultimately led to ": null
    },
    {
        "quantum electrodynamics": "Quantum Electrodynamics"
    },
    {
        " , which fully describes all electromagnetic phenomena as being mediated by wave–particles known as ": null
    },
    {
        "photons": "Photon"
    },
    {
        ". In QED, photons are the fundamental exchange particle, which described all interactions relating to electromagnetism including the electromagnetic force. For a complete library on quantum mechanics see ": null
    }
]