[
    {
        "   While alliances dating back to the ": null
    },
    {
        "Mozambican War of Independence": "Mozambican War Of Independence"
    },
    {
        " remain relevant,  Mozambique s foreign policy has become increasingly pragmatic. The twin pillars of the policy are maintenance of good relations with its neighbors and maintenance and expansion of ties to development partners.     During the 1970s and early 1980s, Mozambiques foreign policy was inextricably linked to the struggles for majority rule in ": null
    },
    {
        "Rhodesia": "Rhodesia"
    },
    {
        " and ": null
    },
    {
        "South Africa": "South Africa"
    },
    {
        " as well as superpower competition and the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ". Mozambiques decision to enforce ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " sanctions against Rhodesia and support Rhodesian guerrillas led ": null
    },
    {
        "Ian Smiths": "Ian Smith"
    },
    {
        " regime to undertake overt and covert actions to destabilize the country. Although the change of government in Zimbabwe in 1980 removed this threat, the apartheid regime in South Africa continued to finance the destabilization of Mozambique.     The 1984 ": null
    },
    {
        "Nkomati Accord": "Nkomati Accord"
    },
    {
        ", while failing in its goal of ending South African support to ": null
    },
    {
        "RENAMO": "Renamo"
    },
    {
        ", opened initial diplomatic contacts between the Mozambican and South African governments. This process gained momentum with South Africas elimination of ": null
    },
    {
        "apartheid": "Apartheid"
    },
    {
        ", which culminated in the establishment of full diplomatic relations in October 1993. While relations with neighboring ": null
    },
    {
        "Zimbabwe": "Zimbabwe"
    },
    {
        ", ": null
    },
    {
        "Malawi": "Malawi"
    },
    {
        ", ": null
    },
    {
        "Zambia": "Zambia"
    },
    {
        ", and ": null
    },
    {
        "Tanzania": "Tanzania"
    },
    {
        " show occasional strains, Mozambiques ties to these countries remain strong.      In the years immediately following its independence, Mozambique benefited from considerable assistance from some western countries, notably the ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        "ns. The ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " and its allies, however, became Mozambiques primary economic, military, and political supporters and its foreign policy reflected this linkage. This began to change in 1983; in 1984 Mozambique joined the ": null
    },
    {
        "World Bank": "World Bank"
    },
    {
        " and ": null
    },
    {
        "International Monetary Fund": "International Monetary Fund"
    },
    {
        ". Western aid quickly replaced Soviet support, with the Scandinavians, Finland, the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        ", and the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " becoming increasingly important sources of development assistance. Italy also maintains a profile in Mozambique as a result of its key role during the peace process. Relations with ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        ", the former colonial power, are complex and of some importance as Portuguese investors play a visible role in Mozambiques economy.     Mozambique is a member of the Non-Aligned Movement and ranks among the moderate members of the African Bloc in the United Nations and other international organizations. Mozambique also belongs to the ": null
    },
    {
        "Organisation of African Unity": "Organisation Of African Unity"
    },
    {
        "/African Union and the ": null
    },
    {
        "Southern African Development Community": "Southern African Development Community"
    },
    {
        ". In 1994, the Government became a full member of the Organisation of the Islamic Conference , in part to broaden its base of international support but also to please the countrys sizeable ": null
    },
    {
        "Muslim": "Muslim"
    },
    {
        " population. Similarly, in early 1996 Mozambique joined its Anglophone neighbors in the ": null
    },
    {
        "Commonwealth": "Commonwealth Of Nations"
    },
    {
        ". In the same year, Mozambique became a founding member and the first President of the ": null
    },
    {
        "Community of Portuguese Language Countries": "Community Of Portuguese Language Countries"
    },
    {
        " , and maintains close ties with other Lusophone states. The country is also a member of the ": null
    },
    {
        "Port Management Association of Eastern and Southern Africa": "Port Management Association Of Eastern And Southern Africa"
    },
    {
        " .     Illicit drugs:   Southern African transit point for South Asian ": null
    },
    {
        "hashish": "Hashish"
    },
    {
        ", South Asian ": null
    },
    {
        "heroin": "Heroin"
    },
    {
        ", and South American ": null
    },
    {
        "cocaine": "Cocaine"
    },
    {
        " probably destined for the European and South African markets; producer of ": null
    },
    {
        "cannabis": "Cannabis"
    },
    {
        " and ": null
    },
    {
        "methaqualone": "Methaqualone"
    },
    {
        " ; corruption and poor regulatory capability makes the banking system vulnerable to money laundering, but the lack of a well-developed financial infrastructure limits the countrys utility as a money-laundering center.       ": null
    }
]