[
    {
        "Cameroons": "Cameroon"
    },
    {
        " noncontentious, low-profile approach to foreign relations puts it squarely in the middle of other ": null
    },
    {
        "Africa": "Africa"
    },
    {
        "n and developing country states on major issues. It supports the principles of ": null
    },
    {
        "non-interference": "National Sovereignty"
    },
    {
        " in the affairs of third world countries and increased assistance to underdeveloped countries. Cameroon is an active participant in the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        ", where its voting record demonstrates its commitment to causes that include international ": null
    },
    {
        "peacekeeping": "Peacekeeping"
    },
    {
        ", the ": null
    },
    {
        "rule of law": "Rule Of Law"
    },
    {
        ", ": null
    },
    {
        "environmental protection": "Environmentalism"
    },
    {
        ", and ": null
    },
    {
        "Third World": "Third World"
    },
    {
        " economic development. In the UN and other ": null
    },
    {
        "human rights": "Human Rights"
    },
    {
        " fora, Cameroons non-confrontational approach has generally led it to avoid criticizing other countries.     Cameroon enjoys good ": null
    },
    {
        "relations with the United States": "Cameroon-United States Relations"
    },
    {
        " and other developed countries. Cameroon enjoys generally good relations with its African neighbors. It supports UN peacekeeping activities in ": null
    },
    {
        "Central Africa": "Central Africa"
    },
    {
        ".       Delimitation of international boundaries in the vicinity of ": null
    },
    {
        "Lake Chad": "Lake Chad"
    },
    {
        ", the lack of which led to border incidents in the past, is complete and awaits ratification by Cameroon, ": null
    },
    {
        "Chad": "Chad"
    },
    {
        ", ": null
    },
    {
        "Niger": "Niger"
    },
    {
        ", and Nigeria; dispute with Nigeria over land and ": null
    },
    {
        "maritime boundaries": "Maritime Boundary"
    },
    {
        " around the ": null
    },
    {
        "Bakasi Peninsula": "Bakasi Peninsula"
    },
    {
        " and Lake Chad is currently before the ": null
    },
    {
        "International Court of Justice": "International Court Of Justice"
    },
    {
        " , as is a dispute with ": null
    },
    {
        "Equatorial Guinea": "Equatorial Guinea"
    },
    {
        " over the exclusive maritime economic zone. As of 10 October 2012, it has been resolved that Cameroon own Bakassi.     Cameroon also faces a complaint filed with the ": null
    },
    {
        "African Commission on Human Rights": "African Commission On Human And Peoples Rights"
    },
    {
        " by the ": null
    },
    {
        "Southern Cameroons National Council ": "Southern Cameroons National Council"
    },
    {
        " and the ": null
    },
    {
        "Southern Cameroons Peoples Organisation ": "Southern Cameroons"
    },
    {
        " against the Government of the Republic of Cameroon, in which the complainants allege that the Republic of Cameroon is illegally occupying the territory of ": null
    },
    {
        "Southern Cameroons": "Southern Cameroons"
    },
    {
        ". The SCNC and SCAPO ultimately seek the independence of the territory of Southern Cameroons.  As of 2008, both parties have submitted briefs and responded to the Human Rights Commissions inquiries. A ruling by the African Commission on Human Rights is awaited.       ": null
    }
]