[
    {
        "As one of the oldest Euro-Atlantic member states in the region of Southeast Europe, ": null
    },
    {
        "Greece": "Greece"
    },
    {
        " enjoys a prominent geopolitical role as a ": null
    },
    {
        "middle power": "Middle Power"
    },
    {
        ", due to its political and geographical proximity to Europe, Asia, the Middle East, and Africa. Its main allies are the ": null
    },
    {
        "United States": "Greece–United States Relations"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "Greece–United Kingdom Relations"
    },
    {
        ", ": null
    },
    {
        "France": "France–Greece Relations"
    },
    {
        ", ": null
    },
    {
        "Italy": "Greece–Italy Relations"
    },
    {
        ", the other ": null
    },
    {
        "NATO": "Nato"
    },
    {
        " countries, and the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ".     Greece also maintains strong diplomatic relations with ": null
    },
    {
        "Cyprus": "Cyprus–Greece Relations"
    },
    {
        ", ": null
    },
    {
        "Serbia": "Greece–Serbia Relations"
    },
    {
        ", ": null
    },
    {
        "Armenia": "Armenia–Greece Relations"
    },
    {
        ", ": null
    },
    {
        "Bulgaria": "Bulgaria"
    },
    {
        ", ": null
    },
    {
        "Albania": "Albania–Greece Relations"
    },
    {
        ", ": null
    },
    {
        "Egypt": "Egypt–Greece Relations"
    },
    {
        ", ": null
    },
    {
        "Russia": "Greece–Russia Relations"
    },
    {
        " and ": null
    },
    {
        "Israel": "Greece–Israel Relations"
    },
    {
        ", while at the same time focuses at improving further the good relations with the ": null
    },
    {
        "Arab World": "Arab World"
    },
    {
        ", ": null
    },
    {
        "Caucasus": "Caucasus"
    },
    {
        ", ": null
    },
    {
        "China": "China–Greece Relations"
    },
    {
        " and ": null
    },
    {
        "Japan": "Greece-Japan Relations"
    },
    {
        ". As member of both the EU and the ": null
    },
    {
        "Union for the Mediterranean": "Union For The Mediterranean"
    },
    {
        ", Greece is a key player in the eastern Mediterranean region and has encouraged the collaboration between neighbors, as well as promoting the ": null
    },
    {
        "Energy Triangle": "Energy Triangle"
    },
    {
        ", for gas exports to Europe. Greece also has the largest economy in the ": null
    },
    {
        "Balkans": "Balkans"
    },
    {
        ", where it is an important regional investor.     Prominent issues in Hellenic foreign policy include the ": null
    },
    {
        "claims in the Aegean Sea": "Aegean Dispute"
    },
    {
        " and Eastern Mediterranean by ": null
    },
    {
        "Turkey": "Greece–Turkey Relations"
    },
    {
        " and the ": null
    },
    {
        "Turkish occupation of Cyprus": "Turkish Invasion Of Cyprus"
    },
    {
        ".       Greece has diplomatic relations with almost all the countries in the world, as shown in the map below.        Representation through:   embassy –  Greek embassy in another country  general consulate –  no representation –  Greece                       As the island of Cyprus was heading towards independence from the United Kingdom the Greek and Turkish communities became embroiled in bitter inter-communal fighting, partly sponsored by the two motherlands . ": null
    },
    {
        "EOKA-B": "Eoka-B"
    },
    {
        " and the ": null
    },
    {
        "Turkish Resistance Organization": "Turkish Resistance Organization"
    },
    {
        " were responsible for many atrocities which resulted in cementing tensions and led to total isolation of the communities with Turkish Cypriots withdrawn into ": null
    },
    {
        "enclaves": "Turkish Cypriot Enclaves"
    },
    {
        ".     In 1974 the US-backed Greek junta – in power since 1967 – partly in a move to draw attention away from internal turmoil and partly unsatisfied with Makarios policy in Cyprus, on 15 July attempted a coup to replace him with Nikos Sampson and declare union with Greece. Seven days later, Turkey launched an invasion of Cyprus allegedly to reinstate the constitution but which resulted in blooded conflict, partition of the island and mass ethnic cleansing. The overwhelming Turkish land, naval and air superiority against islands weak defenses led to the bringing of 37% of the land under Turkish control.     170,000 Greek Cypriots were evicted from their homes in the north with 50,000 Turks following the opposite path concluding the de facto division of Cyprus. In 1983 Turkish Cypriots proclaimed independence unilaterally with only Turkey recognizing them. As of today the north is under an embargo as a measure against the illegal partition of the island.     Ever since both countries along with the two communities of the island are engages into a ": null
    },
    {
        "vicious cycle": "Vicious Cycle"
    },
    {
        " of negotiations which led to little. In 2004 the ": null
    },
    {
        "Annan Plan for Cyprus": "Annan Plan For Cyprus"
    },
    {
        " was put to vote but whilst it was accepted by the north, it was rejected by the Greek-Cypriots as it meant in their eyes, endorsing a confederal state with a weak central government and considerable local autonomy. The Republic of Cyprus is a constitutional democracy which has reached great levels of prosperity, with a booming economy and good infrastructures, part of the United Nations, ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " and several others organizations by whom it is recognized as the sole legitimate government of the whole island.     Greece calls for the removal of Turkish troops from Cyprus and the restoration of a unified state. The Republic of Cyprus is receiving strong support from Greece in international forums with the latter maintaining a military contingent on the island, and Greek officers filling key positions in the ": null
    },
    {
        "Cypriot National Guard": "Cypriot National Guard"
    },
    {
        ".            Other issues dividing Greece and Turkey involve the delimitation of the ": null
    },
    {
        "continental shelf": "Continental Shelf"
    },
    {
        " in the Aegean Sea, territorial waters and airspace. In March 1987 a dispute concerning ": null
    },
    {
        "oil drilling": "Oil Drilling"
    },
    {
        " rights, almost led to war between the countries with Greece advocating the dispute to be decided by the ": null
    },
    {
        "International Court of Justice": "International Court Of Justice"
    },
    {
        ". In early 1988, the Turkish and Greek Prime Ministers met at ": null
    },
    {
        "Davos, Switzerland": "Davos, Switzerland"
    },
    {
        ", and later in ": null
    },
    {
        "Brussels": "Brussels"
    },
    {
        ". They agreed on various measures to reduce bilateral tensions and to encourage cooperation.     Tensions over the Aegean Sea surfaced again in November 1994, when Greece claimed under the ": null
    },
    {
        "Law of the Sea Treaty": "Law Of The Sea Treaty"
    },
    {
        ", which Turkey has not signed, that it reserved the right to declare an expansion of its ": null
    },
    {
        "continental shelf": "Continental Shelf"
    },
    {
        " from  around its Aegean islands. Turkey which has itself expanded its continental shelf in the ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        " shore, stated that it would consider any such action a cause for war. New technical-level bilateral discussions began in 1994 but soon fizzled-out.     In January 1996, Greece and Turkey came close to an armed confrontation over the question of which country had sovereignty over an ": null
    },
    {
        "islet in the Aegean": "Imia-Kardak Crisis"
    },
    {
        ". In July 1997, on the sidelines of the North Atlantic Treaty Organization  summit in Madrid, Greek and Turkish leaders reached agreement on six principles to govern their bilateral relations. Within a few months, however, the two countries were again at odds over Aegean airspace and sovereignty issues. Tensions remained high for months, although various confidence-building measures were discussed to reduce the risk of military accidents or conflict in the Aegean, under the auspices of the NATO Secretary General.             Greece has come out in support of Turkeys bid for ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " membership,  and supports its full integration to the union when conditions for its acceptance are met. On 6 May 2004, Turkeys Prime Minister ": null
    },
    {
        "Recep Tayyip Erdoğan": "Recep Tayyip Erdoğan"
    },
    {
        " became the first Turkish leader to visit Greece in fifty years.  On 24 January 2008, Greeces premier ": null
    },
    {
        "Costas Karamanlis": "Costas Karamanlis"
    },
    {
        " visited Turkey a full 48 years after the last Greek premier and uncle of his ": null
    },
    {
        "Constantine Karamanlis": "Constantine Karamanlis"
    },
    {
        " had visited the neighboring country.         On Monday 23 December 2011, in an interview on Turkish newspaper BirGün discussing secret budgets, former Turkish Prime Minister ": null
    },
    {
        "Mesut Yılmaz": "Mesut Yılmaz"
    },
    {
        " admitted that Turkish secret agents intentionally started forest fires in Greece between 1995 and 1997 during the Prime Ministership of ": null
    },
    {
        "Tansu Çiller": "Tansu Çiller"
    },
    {
        " as part of state-sponsored sabotage, resulting in huge damage caused by major forest fires on the ": null
    },
    {
        "islands": "Greek Islands"
    },
    {
        " of the eastern ": null
    },
    {
        "Aegean": "Aegean Sea"
    },
    {
        " and in ": null
    },
    {
        "Macedonia": "Macedonia"
    },
    {
        ". Mesut Yılmazs admission sparked political outrage in Greece on Monday, causing Greeces Foreign Ministry spokesman Grigoris Delavekouras to say that the claims were serious and must be investigated, adding that Athens was awaiting a briefing from Ankara. Conservative ": null
    },
    {
        "New Democracys": "New Democracy"
    },
    {
        " shadow foreign minister Panos Panayiotopoulos said the revelations cast heavy shadows over Greek-Turkish relations and called on Turkey recompense Greece for losses incurred.  , BirGün, Monday 23 December 2011 , ": null
    },
    {
        "Kathimerini": "Kathimerini"
    },
    {
        ", Tuesday 27 December 2011     Following an official complaint from Greece on 24 December seeking clarification over comments by former Prime Minister Mesut Yılmaz relating to forest fires in Greece in the mid-1990s, the Greek and Turkish foreign ministers, ": null
    },
    {
        "Stavros Dimas": "Stavros Dimas"
    },
    {
        " and ": null
    },
    {
        "Ahmet Davutoğlu": "Ahmet Davutoğlu"
    },
    {
        ", spoke on Wednesday 28 December. Dimas stressed how important it was that Ankara investigate the claims that in the past Turkeys intelligence services paid arsonists to set fire to forests in Greece. In addition to Greek Foreign Ministry meetings with Turkish officials, Greeces Supreme Court prosecutor Yiannis Tentes launched an emergency inquiry on 27 December, ordering the investigations into the mid-1990s wildfires blamed on arson to be reopened with regard to the initial claims reportedly made by Yılmaz.  ,  Zaman , Wednesday 28 December 2011     Former head of ": null
    },
    {
        "Greek intelligence service": "National Intelligence Service"
    },
    {
        " Leonidas Vasilikopoulos": "Leonidas Vasilikopoulos"
    },
    {
        " said they had received information from their agents in Turkey that Turkish agents or others were involved in the forest fires on Greek islands.  ,  Journal of Turkish Weekly , Friday 30 December 2011 After making the comments in Turkish daily newspaper BirGün, Yilmaz said that his words had been distorted and that he was referring to Greek agents causing fires in Turkey. ,  Kathimerini , Saturday 31 December 2011 However, on Thursday 29, Turkish daily Milliyet published an article referring to a secret report that seemed to support claims made in the interview by Mesut Yılmaz that secret agents had caused forest fires in Greece in the 1990s. According to Milliyet, an associate of Yılmazs, Kutlu Savas, compiled a 12-page report that detailed the actions of Turkish agents in Greece. It described how the ": null
    },
    {
        "National Intelligence Organization of Turkey": "National Intelligence Organization"
    },
    {
        " had formed two teams: one which carried out bombings at tourist sites on ": null
    },
    {
        "Crete": "Crete"
    },
    {
        " and other parts of Greece and another which was responsible for starting the wildfires. An attack on an army camp in ": null
    },
    {
        "Lamia": "Lamia"
    },
    {
        ", central Greece, is also mentioned. , ": null
    },
    {
        "Kathimerini": "Kathimerini"
    },
    {
        ", Saturday 31 December 2011           Greece enjoys close historic relations with many members of the ": null
    },
    {
        "African Union": "African Union"
    },
    {
        ", such as South Africa, Sudan, and Ethiopia.                       Greece has a special interest in Middle East and North Africa because of its geographic position and its economic and historic ties to the area. The country cooperated with allied forces during the 1990–1991 ": null
    },
    {
        "Gulf War": "Gulf War"
    },
    {
        ". Since 1994, Greece has signed defense cooperation agreements with Israel and Egypt and in recent years, Greek leaders have made numerous trips to the region in order to strengthen bilateral ties and encourage the Middle East Peace Process. In July 1997, December 1997, and July 1998 Greece hosted meetings of Israeli and Palestinian politicians to contribute to the peace process. Greece also maintains diplomatic relations with the ": null
    },
    {
        "General Palestinian Delegation": "State Of Palestine"
    },
    {
        " while enjoying cordial relations with Syria.                                     Greece rejected the use of the term ": null
    },
    {
        "Macedonia": "Macedonia"
    },
    {
        " or Republic of Macedonia to refer to its northern neighbour after its independence from the former Yugoslavia in 1991.  The Greek government opposed the use of the name without any qualification such as Republic of Northern Macedonia to the post-1991 constitutional name of its northern neighbour, citing historical and territorial concerns resulting from the ambiguity between the terms Republic of Macedonia, the ": null
    },
    {
        "Greek region of Macedonia": "Macedonia"
    },
    {
        " and the ancient kingdom of ": null
    },
    {
        "Macedon": "Macedon"
    },
    {
        ", which falls within Greek Macedonia.     Greece also objected to the use of the terms Macedonian to denote ": null
    },
    {
        "ethnic Macedonians": "Ethnic Macedonians"
    },
    {
        " and the ": null
    },
    {
        "Macedonian language": "Macedonian Language"
    },
    {
        ", as these terms have a different meaning in Greece . The dispute has escalated to the highest level of international mediation, involving numerous attempts to achieve a resolution, notably by the United Nations.     The provisional reference the former Yugoslav Republic of Macedonia  was used in relations involving states which do not recognise the constitutional name, Republic of Macedonia. Nevertheless, all the United Nations member-states have agreed to accept any final agreement resulting from negotiations between the two countries. The dispute has not prevented the two countries from enjoying close trade links and investment levels , but it has generated a great deal of political and academic debate on both sides.     On 13 September 1995 the two countries signed the Interim Accord, whereby Greece recognized the Republic of Macedonia under its provisional reference. As of August 2011 negotiations aimed at resolving the dispute are ongoing. Under Greek pressure, the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " and ": null
    },
    {
        "NATO": "Nato"
    },
    {
        " agreed that in order for the Republic of Macedonia to receive an invitation to join these institutions the name dispute must be resolved first.    This resulted in a case at the ": null
    },
    {
        "International Court of Justice": "International Court Of Justice"
    },
    {
        " against Greece for violation of the Interim Accord.  The Court deemed Greece was wrong to block its neighbours bid to join ": null
    },
    {
        "NATO": "Nato"
    },
    {
        ".  No penalties were imposed  but the result made it politically more difficult for Greece to object to any of its neighbours future applications to either NATO or the EU.     On 12 June 2018 the ": null
    },
    {
        "Prespes agreement": "Prespes Agreement"
    },
    {
        " was signed between the two countries which changed the constitutional name of Macedonia to ": null
    },
    {
        "Republic of North Macedonia": "Republic Of North Macedonia"
    },
    {
        ". Opposition arose in both countries but in the end the agreement was mutually ratified. The Prespes agreement went into force 12 February 2019. Greece officially endorsed North Macedonias accession to NATO on 15 February 2019, being the first country in the defense alliance to do so.  BBC News Online. 25 January 2019. Retrieved 25 January 2019.               Northern Epirus is the name used generally by Greeks to refer to the southern part of Albania, home to a Greek minority Country Studies US:  which after 1989 keeps reducing due to immigration to Greece. The Greek minority was subject to oppression and harassment during ": null
    },
    {
        "Enver Hoxhas": "Enver Hoxha"
    },
    {
        " communist rule and along with the rest of Albanians was hit hardly by the isolation that the regime imposed and from the economic hardship that followed the ": null
    },
    {
        "fall of communism": "Fall Of Communism"
    },
    {
        " as well. The treatment of the minority by the Albanian government is strongly linked with the status of Greco-Albanian relations.     The Greek minority is organized under the ": null
    },
    {
        "Unity for Human Rights Party": "Unity For Human Rights Party"
    },
    {
        " which is the continuation of the former banned party called Omonoia and has since 1997 joined the ": null
    },
    {
        "Socialist coalition": "Socialist Party Of Albania"
    },
    {
        ". At the last elections the Greek minority party received 4.1% of the vote and two seats in parliament. The party leader is Vangjel Dule, while party member Vasilis Bolanos is the current mayor of the town of Himara. The party is represented in the ELDR group in the Council of Europe. Strong Greek presence exists in ": null
    },
    {
        "Gjirokastër": "Gjirokastër"
    },
    {
        " , ": null
    },
    {
        "Korçë": "Korçë"
    },
    {
        " , ": null
    },
    {
        "Sarandë": "Sarandë"
    },
    {
        " , ": null
    },
    {
        "Himara": "Himara"
    },
    {
        " and the nearby areas. The former CIA director ": null
    },
    {
        "George J. Tenet": "George J. Tenet"
    },
    {
        ", ": null
    },
    {
        "Pyrros Dimas": "Pyrros Dimas"
    },
    {
        ", ": null
    },
    {
        "Sotiris Ninis": "Sotiris Ninis"
    },
    {
        " and former Greek president ": null
    },
    {
        "Kostis Stefanopoulos": "Kostis Stefanopoulos"
    },
    {
        " have ancestral links to the Greek minority.               The Ecumenical Patriarchate of Constantinople, protected under the ": null
    },
    {
        "treaty of Lausanne": "Treaty Of Lausanne"
    },
    {
        " is a point of controversy between Greece and Turkey as the latter refuses to recognize the Ecumenical character of the Patriarchate thus requiring the Patriarch himself to be a Turkish citizen. Moreover, the biggest part of the Patriarchates property – known as Vakoufia – had been confiscated by Turkish authorities and the ": null
    },
    {
        "Theological school of Halki": "Halki Seminary"
    },
    {
        " which is the traditional school out of which the ": null
    },
    {
        "Eastern Orthodox Church": "Eastern Orthodox Church"
    },
    {
        ", draws its clergy is closed since 1971. To no avail numerous Greek, European Union and USA officials have criticized Turkeys attitude and even president ": null
    },
    {
        "Bill Clinton": "Bill Clinton"
    },
    {
        " during his visit in Greece asked for the theological school to open. During Greek prime-ministers ": null
    },
    {
        "Kostas Karamanlis": "Kostas Karamanlis"
    },
    {
        " historic visit to Turkey in 2007, ": null
    },
    {
        "Recep Tayyip Erdoğan": "Recep Tayyip Erdoğan"
    },
    {
        " promised to reconsider his countrys stance on the matter.       The ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        " is a region heavily colonized by Greeks throughout history. It used to have a ": null
    },
    {
        "significant presence of Greeks": "Pontic Greeks"
    },
    {
        " up until the ": null
    },
    {
        "population exchange between Greece and Turkey": "Population Exchange Between Greece And Turkey"
    },
    {
        " in 1923. Nowadays there remains Greek presence on the shores of Black Sea mainly in ": null
    },
    {
        "Mariupol": "Mariupol"
    },
    {
        " , ": null
    },
    {
        "Crimea": "Crimea"
    },
    {
        ", Russia and Georgia despite emigration to Greece during and after the dissolution of ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ". Today Greeks in the region are estimated to be around 215,000 according to official ": null
    },
    {
        "Greek diaspora": "Greek Diaspora"
    },
    {
        " figures. Greece is a founding member of the ": null
    },
    {
        "Organization of the Black Sea Economic Cooperation": "Organization Of The Black Sea Economic Cooperation"
    },
    {
        ".       Greece is a major participant in most large-scale international bodies, with the geographic significance of the region proving advantageous for diplomatic, trade and political crossroads.     ": null
    },
    {
        "BIS": "Bank For International Settlements"
    },
    {
        ", ": null
    },
    {
        "BSEC": "Organization Of The Black Sea Economic Cooperation"
    },
    {
        ", ": null
    },
    {
        "CCC": "Customs Cooperation Council"
    },
    {
        ", ": null
    },
    {
        "CE": "Council Of Europe"
    },
    {
        ", ": null
    },
    {
        "EAPC": "Euro-Atlantic Partnership Council"
    },
    {
        ", ": null
    },
    {
        "EBRD": "Ebrd"
    },
    {
        ", ": null
    },
    {
        "ECA": "United Nations Economic Commission For Africa"
    },
    {
        " , ": null
    },
    {
        "ECE": "United Nations Economic Commission For Europe"
    },
    {
        ", ": null
    },
    {
        "ECLAC": "Eclac"
    },
    {
        ", ": null
    },
    {
        "EIB": "European Investment Bank"
    },
    {
        ", ": null
    },
    {
        "EMU": "Economic And Monetary Union Of The European Union"
    },
    {
        ", EU, ": null
    },
    {
        "FAO": "Food And Agriculture Organization"
    },
    {
        ", ": null
    },
    {
        "IAEA": "Iaea"
    },
    {
        ", ": null
    },
    {
        "IBRD": "Ibrd"
    },
    {
        ", ": null
    },
    {
        "ICAO": "Icao"
    },
    {
        ", ": null
    },
    {
        "IDA": "International Development Association"
    },
    {
        ", ": null
    },
    {
        "IEA": "International Energy Agency"
    },
    {
        ", ": null
    },
    {
        "IFAD": "Ifad"
    },
    {
        ", ": null
    },
    {
        "IFC": "International Finance Corporation"
    },
    {
        ", ": null
    },
    {
        "ILO": "International Labour Organization"
    },
    {
        ", ": null
    },
    {
        "IMF": "International Monetary Fund"
    },
    {
        ", ": null
    },
    {
        "International Maritime Organization": "International Maritime Organization"
    },
    {
        ", ": null
    },
    {
        "Interpol": "Interpol"
    },
    {
        ", ": null
    },
    {
        "IOC": "Ioc"
    },
    {
        ", ": null
    },
    {
        "IOM": "International Organization For Migration"
    },
    {
        ", ": null
    },
    {
        "ISO": "International Organization For Standardization"
    },
    {
        ", ": null
    },
    {
        "NATO": "Nato"
    },
    {
        ", ": null
    },
    {
        "OECD": "Oecd"
    },
    {
        ", ": null
    },
    {
        "OSCE": "Organization For Security And Co-Operation In Europe"
    },
    {
        ", UN, ": null
    },
    {
        "UN Security Council": "United Nations Security Council"
    },
    {
        ", ": null
    },
    {
        "UNCTAD": "Unctad"
    },
    {
        ", ": null
    },
    {
        "UNESCO": "Unesco"
    },
    {
        ", ": null
    },
    {
        "UNHCR": "Unhcr"
    },
    {
        ", ": null
    },
    {
        "WEU": "Weu"
    },
    {
        ", ": null
    },
    {
        "WHO": "World Health Organization"
    },
    {
        ", ": null
    },
    {
        "WIPO": "Wipo"
    },
    {
        ", ": null
    },
    {
        "WMO": "Wmo"
    },
    {
        ".     Greece was elected by the ": null
    },
    {
        "United Nations General Assembly": "United Nations General Assembly"
    },
    {
        " to the ": null
    },
    {
        "United Nations Security Council": "United Nations Security Council"
    }
]