[
    {
        "     Four Feather Falls was the third puppet TV show produced by ": null
    },
    {
        "Gerry Anderson": "Gerry Anderson"
    },
    {
        " for ": null
    },
    {
        "Granada Television": "Itv Granada"
    },
    {
        ". It was based on an idea by ": null
    },
    {
        "Barry Gray": "Barry Gray"
    },
    {
        ", who also wrote the shows music. The series was the first to use an early version of Andersons ": null
    },
    {
        "Supermarionation": "Supermarionation"
    },
    {
        " puppetry. Thirty-nine 13-minute episodes were produced, broadcast by Granada from February until November 1960. The setting is the late 19th-century fictional Kansas town of Four Feather Falls, where the hero of the series, Tex Tucker, is a ": null
    },
    {
        "sheriff": "Sheriffs In The United States"
    },
    {
        ". The four feathers of the title refers to four magical feathers given to Tex by the ": null
    },
    {
        "Indian": "Native Americans In The United States"
    },
    {
        " chief": "Tribal Chief"
    },
    {
        " Kalamakooya as a reward for saving his grandson: two of the feathers allowed Texs guns to swivel and fire without being touched whenever he was in danger, whilst the other two conferred the power of speech on Texs horse and dog.     Texs speaking voice was provided by ": null
    },
    {
        "Nicholas Parsons": "Nicholas Parsons"
    },
    {
        ", and his singing voice by ": null
    },
    {
        "Michael Holliday": "Michael Holliday"
    },
    {
        ". The series has never been repeated on British television, but it was released on DVD in 2005.       American ": null
    },
    {
        "Western": "Western"
    },
    {
        " television shows such as  Wagon Train  and  Gunsmoke  were popular with British audiences, therefore ": null
    },
    {
        "Gerry Anderson": "Gerry Anderson"
    },
    {
        " and his business partner ": null
    },
    {
        "Arthur Provis": "Arthur Provis"
    },
    {
        " decided to make a ": null
    },
    {
        "cowboy": "Cowboy"
    },
    {
        " series, based on an idea offered to them by ": null
    },
    {
        "Barry Gray": "Barry Gray"
    },
    {
        ". Anderson considered the puppets with static heads, made by ": null
    },
    {
        "Christine Glanville": "Christine Glanville"
    },
    {
        " for his earlier productions, to be unacceptable because the viewer could not tell which character was talking unless its puppet moved up or down. Andersons aim was to make the puppets look as realistic as possible, the beginning of the ": null
    },
    {
        "Supermarionation": "Supermarionation"
    },
    {
        " puppetry process, although that term was not coined until his next series,  Supercar .     The puppets ": null
    },
    {
        "papier-mâché": "Papier-Mâché"
    },
    {
        " heads were replaced by interchangeable hollow ": null
    },
    {
        "fibre glass": "Fiberglass"
    },
    {
        " heads with internal rods that could move the eyes from side to side. The heads also contained sound-activated ": null
    },
    {
        "solenoid": "Solenoid"
    },
    {
        "s, which allowed the puppets lips to move automatically in synchronisation with the dialogue. The electronics of the day required more space than would be available in a human-scale head, therefore all the puppets in Four Feather Falls had oversized heads.     Except for the pilot episode, which was made in ": null
    },
    {
        "AP Films": "Ap Films"
    },
    {
        " studios at ": null
    },
    {
        "Islet Park": "Islet Park"
    },
    {
        ", the series was produced in a converted warehouse in the ": null
    },
    {
        "Slough Trading Estate": "Slough Trading Estate"
    },
    {
        ". The cast assembled to record each script without seeing the puppets, much like recording a radio series; synchronisation of each characters speech with the movement of its puppets mouth was performed later. The show was filmed in black and white.  Its tight budget precluded the use of sophisticated ": null
    },
    {
        "special effects": "Special Effects"
    },
    {
        ", and less-costly alternatives were used. For example, to achieve the effect of ": null
    },
    {
        "muzzle flash": "Muzzle Flash"
    },
    {
        "es, small specks of black paint were carefully applied to the ": null
    },
    {
        "35 mm": "35Mm Movie Film"
    },
    {
        "negatives": "Film Negative"
    },
    {
        "so they would appear as white flashes on the finished prints. The wires used to control the puppets were eight feet long and made of ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        ", an improvement on the curtain wire used in the two earlier series, and were only 1/200 of an inch thick. Being shiny, the wires had to be blackened. The puppets were made one-third life size with the ": null
    },
    {
        "puppeteers": "Puppeteer"
    },
    {
        "on a bridge eight feet above the set. The horses moved by being pulled along on a trolley, which meant the viewer never saw their feet when they were moving.     ": null
    },
    {
        "Continuity": "Continuity"
    },
    {
        " for the series was provided by ": null
    },
    {
        "Sylvia Thamm": "Sylvia Anderson"
    },
    {
        " who married Gerry Anderson.       The series is set in the fictitious late 19th-century ": null
    },
    {
        "Western": "Western"
    },
    {
        " town of Four Feather Falls, Kansas, and features the adventures of its ": null
    },
    {
        "sheriff": "Sheriffs In The United States"
    },
    {
        ", Tex Tucker. In the first episode, Grandpa Twink relates the story of how it all began to grandson, Little Jake. Tex is riding up from the valley and comes across a lost and hungry ": null
    },
    {
        "Indian": "Indigenous Peoples Of The Americas"
    },
    {
        " boy, Makooya and saves him. Tex is given four ": null
    },
    {
        "magic": "Magic"
    },
    {
        " feathers by the boys grandfather, Chief Kalamakooya, as a reward for saving his grandson. Two of the feathers allow his guns to swivel and fire automatically , and the other two allow his horse, Rocky, and his dog, Dusty, to speak. As Tex, his horse, and dog are very thirsty, Kalamakooya also makes a waterfall where there had been no water before, and so when the town was built it was named after Texs feathers and the waterfall.     The characters of the town are Grandpa Twink, who does little but rest in a chair; his grandson Little Jake, the only child in town; Ma Jones, who runs the town store; Doc Haggerty; Slim Jim, the bartender of the Denison ": null
    },
    {
        "saloon": "Western Saloon"
    },
    {
        "; Marvin Jackson, the bank manager; and Dan Morse, the ": null
    },
    {
        "telegraph": "Telegraph"
    },
    {
        "ist. Other characters appeared from time to time for only one episode, often just visiting town. The villains included Pedro, who was introduced in the first show and Fernando, who first appeared in the second episode as a ": null
    },
    {
        "sidekick": "Sidekick"
    },
    {
        " and someone Pedro could blame when things went wrong, as they always did. Big Ben was another villain who appeared from time to time, as did Red Scalp, a renegade Indian. Other villains only appeared in single episodes.              The series has not been repeated or ": null
    },
    {
        "rerun": "Rerun"
    },
    {
        " in Britain since its original broadcast. In December 2004 it was announced that the rights had been acquired by ": null
    },
    {
        "Network Distributing": "Network Distributing"
    },
    {
        ", and it was released on three ": null
    },
    {
        "Region 2": "Dvd Region Code2"
    },
    {
        " DVDs in May 2005. It is the only Supermarionation series not yet released to DVD in North America as of January 2006. Sylvia Anderson wrote two British childrens annuals based on the show, published by Collins in 1960 and 1961. The first book featured a short text story based on the pilot episode of the TV series.       The shows music and song lyrics were composed by ": null
    },
    {
        "Barry Gray": "Barry Gray"
    },
    {
        ". ": null
    },
    {
        "Michael Holliday": "Michael Holliday"
    },
    {
        " provided Texs singing voice, and ": null
    },
    {
        "Tommy Reilly": "Tommy Reilly"
    },
    {
        " performed the harmonica pieces. The best known song to come out of the series was Four Feather Falls , sung in some episodes by Michael Holliday in the style of ": null
    },
    {
        "Bing Crosby": "Bing Crosby"
    },
    {
        " and sometimes incorrectly described as the theme song to the series. The closing theme song was Two Gun Tex of Texas. Holliday was paid £2000 for his singing work on the pilot episode, equivalent to about £38,000 as of 2010, a significant part of the shows £6000 budget. In all, Holliday recorded six songs for the series: Four Feather Falls , The Phantom Rider , The Rick-Rick-A-Rackety Train , Happy Hearts and Friendly Faces , My Home Town , and Two Gun Tex of Texas . ": null
    },
    {
        "Nicholas Parsons": "Nicholas Parsons"
    },
    {
        " – Sheriff Tex Tucker  / Telegraph Operator Dan Morse / Various   ": null
    },
    {
        "Michael Holliday": "Michael Holliday"
    },
    {
        " – Sheriff Tex Tucker  / Various   ": null
    },
    {
        "Kenneth Connor": "Kenneth Connor"
    },
    {
        " – Dusty the Dog / Rocky the Horse / Pedro the Bandit / Big Chief Kalamakooya / Bank Manager Marvin Jackson / Doc Haggerty / Saloon Owner Slim Jim Denison / Various   ": null
    },
    {
        "David Graham": "David Graham"
    },
    {
        "  – Grandpa Ebenezer Twink / Fernando the Bandit / Big Ben the Horse Rustler Bandit / Red Scalp the Renegade Indian / Various   ": null
    },
    {
        "Denise Bryer": "Denise Bryer"
    },
    {
        " – Martha Ma Jones / Little Jake / Makooya the Little Indian Boy / Various     ": null
    },
    {
        "Denise Bryer": "Denise Bryer"
    },
    {
        " had worked with Anderson on The Adventures of Twizzle, and he wanted her to play some of the voices in Four Feather Falls. Anderson visited Bryer at her home with some scripts and asked her husband, ": null
    },
    {
        "Nicholas Parsons": "Nicholas Parsons"
    },
    {
        ", to help by reading some of the other parts, including the sheriff Tex Tucker. Anderson liked Parsons interpretation and offered him the job of providing Texs speaking voice.": null
    }
]