[
    {
        "         The Fox Film Corporation was an American company that produced ": null
    },
    {
        "motion pictures": "Film"
    },
    {
        ", formed by ": null
    },
    {
        "William Fox": "William Fox"
    },
    {
        " on February 1, 1915. It was the corporate successor to his earlier Greater New York Film Rental Company and Box Office Attractions Film Company.     The companys first film studios were set up in ": null
    },
    {
        "Fort Lee, New Jersey": "Fort Lee, New Jersey"
    },
    {
        ", but in 1917, William Fox sent ": null
    },
    {
        "Sol M. Wurtzel": "Sol M. Wurtzel"
    },
    {
        " to ": null
    },
    {
        "Hollywood, California": "Hollywood, California"
    },
    {
        " to oversee the studios new ": null
    },
    {
        "West Coast": "West Coast Of The United States"
    },
    {
        " production facilities, where the climate was more hospitable for filmmaking. On July 23, 1926, the company bought the ": null
    },
    {
        "patents": "Patent"
    },
    {
        " of the ": null
    },
    {
        "Movietone sound system": "Movietone Sound System"
    },
    {
        " for recording sound onto ": null
    },
    {
        "film": "Film"
    },
    {
        ".     After the ": null
    },
    {
        "Crash of 1929": "Wall Street Crash 1929"
    },
    {
        ", William Fox lost control of the company in 1930, during a hostile takeover. Under new president Sidney Kent, the new owners merged the company with ": null
    },
    {
        "Twentieth Century Pictures": "Twentieth Century Pictures"
    },
    {
        " to form ": null
    },
    {
        "20th Century Fox": "20Th Century Fox"
    },
    {
        " in 1935.           ": null
    },
    {
        "William Fox": "William Fox"
    },
    {
        " entered the film industry in 1904 when he purchased a one-third share of a ": null
    },
    {
        "Brooklyn": "Brooklyn"
    },
    {
        " nickelodeon": "Nickelodeon"
    },
    {
        " for $1,667. He reinvested his profits from that initial location, expanding to fifteen similar venues in the city, and purchasing ": null
    },
    {
        "prints": "Film Print"
    },
    {
        " from the major studios of the time: ": null
    },
    {
        "Biograph": "Biograph Studios"
    },
    {
        ", ": null
    },
    {
        "Essanay": "Essanay"
    },
    {
        ", ": null
    },
    {
        "Kalem": "Kalem"
    },
    {
        ", ": null
    },
    {
        "Lubin": "Lubin Manufacturing Company"
    },
    {
        ", ": null
    },
    {
        "Pathé": "Pathé"
    },
    {
        ", ": null
    },
    {
        "Selig": "Selig Polyscope Company"
    },
    {
        ", and ": null
    },
    {
        "Vitagraph": "Vitagraph"
    },
    {
        ". After experiencing further success presenting live ": null
    },
    {
        "vaudeville": "Vaudeville"
    },
    {
        " routines along with motion pictures, he expanded into larger venues beginning with his purchase of the disused Gaiety theater, and continuing with acquisitions throughout New York City and New Jersey, including the ": null
    },
    {
        "Academy of Music": "Academy Of Music"
    },
    {
        ".     Fox invested further in the film industry by founding the Greater New York Film Rental Company as a ": null
    },
    {
        "film distributor": "Film Distributor"
    },
    {
        ". However, the major film studios formed the ": null
    },
    {
        "Motion Picture Patents Company": "Motion Picture Patents Company"
    },
    {
        " in 1908 and the ": null
    },
    {
        "General Film Company": "General Film Company"
    },
    {
        " in 1910, in an effort to create a ": null
    },
    {
        "monopoly": "Monopoly"
    },
    {
        " on the creation and distribution of motion pictures. Fox refused to sell out to the monopoly, and sued under the ": null
    },
    {
        "Sherman Antitrust Act": "Sherman Antitrust Act"
    },
    {
        ", eventually receiving a $370,000 settlement, and ending restrictions on the length of films and the prices that could be paid for screenplays.     In 1914, reflecting the broader scope of his business, he renamed it the Box Office Attraction Film Rental Company. He entered into a contract with the ": null
    },
    {
        "Balboa Amusement Producing Company": "Balboa Amusement Producing Company"
    },
    {
        " film studio, purchasing all of their films for showing in his New York area theaters and renting the prints to other exhibitors nationwide. He also continued to distribute material from other sources, such as ": null
    },
    {
        "Winsor McCays": "Winsor Mccay"
    },
    {
        " early animated film  Gertie the Dinosaur . Later that year, Fox concluded that depending on other companies for the products he depended on was insufficient. He purchased the ": null
    },
    {
        "Éclair": "Éclair"
    },
    {
        " studio facilities in ": null
    },
    {
        "Fort Lee, New Jersey": "Fort Lee, New Jersey"
    },
    {
        ", along with property in ": null
    },
    {
        "Staten Island": "Staten Island"
    },
    {
        ", and arranged for actors and crew. The company became a film studio, with its name shortened to the Box Office Attractions Company; its first release was  Lifes Shop Window .             Always more of an entrepreneur than a showman, Fox concentrated on acquiring and building theaters; pictures were secondary. The companys first film studios were set up in ": null
    },
    {
        "Fort Lee, New Jersey": "Fort Lee, New Jersey"
    },
    {
        " where it and many other early ": null
    },
    {
        "film studios": "Film Studio"
    },
    {
        " in ": null
    },
    {
        "Americas first motion picture industry": "Americas First Motion Picture Industry"
    },
    {
        " were based at the beginning of the 20th century.     In 1914, Fox Film began making motion pictures in California, and in 1915 decided to build its own permanent studio. The company leased the ": null
    },
    {
        "Edendale": "Edendale, Los Angeles, California"
    },
    {
        " studio of the ": null
    },
    {
        "Selig Polyscope Company": "Selig Polyscope Company"
    },
    {
        " until its own studio, located at Western Avenue and Sunset Boulevard, was completed in 1916.  In 1917, William Fox sent ": null
    },
    {
        "Sol M. Wurtzel": "Sol M. Wurtzel"
    },
    {
        " to Hollywood to oversee the studios ": null
    },
    {
        "West Coast": "West Coast Of The United States"
    },
    {
        " production facilities where a more hospitable and cost-effective climate existed for filmmaking.     With the introduction of sound technology, Fox moved to acquire the rights to a ": null
    },
    {
        "sound-on-film": "Sound-On-Film"
    },
    {
        " process. In the years 1925–26, Fox purchased the rights to the work of ": null
    },
    {
        "Freeman Harrison Owens": "Freeman Harrison Owens"
    },
    {
        ", the U.S. rights to the ": null
    },
    {
        "Tri-Ergon": "Tri-Ergon"
    },
    {
        " system invented by three German inventors, and the work of ": null
    },
    {
        "Theodore Case": "Theodore Case"
    },
    {
        ". This resulted in the ": null
    },
    {
        "Movietone sound system": "Movietone Sound System"
    },
    {
        " later known as Fox Movietone developed at the ": null
    },
    {
        "Movietone Studio": "Movietone Studio"
    },
    {
        ". Later that year, the company began offering films with a music-and-effects track, and the following year Fox began the weekly  Fox Movietone News  feature, that ran until 1963. The growing company needed space, and in 1926 Fox acquired 300  acres   in the open country west of Beverly Hills and built Movietone City , the best-equipped studio of its time.       When rival ": null
    },
    {
        "Marcus Loew": "Marcus Loew"
    },
    {
        " died in 1927, Fox offered to buy the Loew familys holdings. Loews Inc. controlled more than 200 theaters, as well as the ": null
    },
    {
        "MGM": "Metro-Goldwyn-Mayer"
    },
    {
        " studio. When the family agreed to the sale, the merger of Fox and Loews Inc. was announced in 1929. But MGM studio boss ": null
    },
    {
        "Louis B. Mayer": "Louis B. Mayer"
    },
    {
        " was not included in the deal and fought back. Using political connections, Mayer called on the ": null
    },
    {
        "Justice Departments": "United States Department Of Justice"
    },
    {
        " antitrust": "Antitrust"
    },
    {
        " unit to delay giving final approval to the merger. Fox was badly injured in a car crash in the summer of 1929, and by the time he recovered he had lost most of his fortune in the ": null
    },
    {
        "fall 1929 stock market crash": "Wall Street Crash 1929"
    },
    {
        ", ending any chance of the merger going through even without the Justice Departments objections.     Overextended and close to bankruptcy, Fox was stripped of his empire in 1930  and ended up in jail for later ": null
    },
    {
        "bribery": "Bribery"
    },
    {
        " charges. Fox Film, with more than 500 theatres, was placed in receivership. A bank-mandated reorganization propped the company up for a time, but it soon became apparent that despite its size, Fox could not stand on its own. William Fox resented the way he was forced out of the company and portrayed it as an active conspiracy against him in the 1933 book  Upton Sinclair Presents William Fox .          Under new president Sidney Kent, the new owners began negotiating with the upstart, but powerful independent Twentieth Century Pictures in the early spring of 1935. The two companies merged that spring as ": null
    },
    {
        "20th Century-Fox": "20Th Century Fox"
    },
    {
        " . For many years, 20th Century Fox claimed to have been founded in 1915. For instance, it marked 1945 as its 30th anniversary. However, in recent years it has claimed the 1935 merger as its founding, even though most film historians agree it was founded in 1915. . ": null
    },
    {
        "New York Post": "New York Post"
    },
    {
        ", 2010-02-10.                A ": null
    },
    {
        "1937 fire": "1937 Fox Vault Fire"
    },
    {
        " in a Fox film storage facility destroyed over 40,000 reels of ": null
    },
    {
        "negatives": "Negative"
    },
    {
        " and prints, including the best-quality copies of every Fox feature produced prior to 1932; although copies located elsewhere allowed many to survive in some form, over 75% of Foxs feature films from before 1930 are completely ": null
    },
    {
        "lost": "Lost Film"
    },
    {
        ".          In 1919, Fox began a series of silent ": null
    },
    {
        "newsreels": "Newsreel"
    },
    {
        ", competing with existing series such as  Hearst Metrotone News ,  International Newsreel , and  Pathé News .  Fox News  premiered on October 11, 1919, with subsequent issues released on the Wednesday and Sunday of each week. Fox News gained an advantage over its more established competitors when President ": null
    },
    {
        "Woodrow Wilson": "Woodrow Wilson"
    },
    {
        " endorsed the newsreel in a letter, in what may have been the first time an American president commented on a film. In subsequent years, Fox News remained one of the major names in the newsreel industry by providing often-exclusive coverage of major international events, including reporting on ": null
    },
    {
        "Pancho Villa": "Pancho Villa"
    },
    {
        ", the airship  Roma , the ": null
    },
    {
        "Ku Klux Klan": "Ku Klux Klan"
    },
    {
        ", and a 1922 eruption of ": null
    },
    {
        "Mount Vesuvius": "Mount Vesuvius"
    },
    {
        ". The silent newsreel series continued until 1930.     In 1926, a subsidiary, Fox Movietone Corporation, was created, tasked with producing newsreels using Foxs recently acquired sound-on-film technology. The first of these newsreels debuted on January 21, 1927. Four months later, the May 25 release of a sound recording of ": null
    },
    {
        "Charles Lindberghs": "Charles Lindbergh"
    },
    {
        " departure on his ": null
    },
    {
        "transatlantic flight": "Transatlantic Flight"
    },
    {
        " was described by film historian Raymond Fielding as the first sound news film of consequence .  Movietone News  was launched as a regular newsreel feature December 3 of that year. Production of the series continued after the merger with Twentieth Century Pictures, until 1963, and continued to serve 20th Century Fox after that, as a source for film industry stock footage.     Unlike Foxs early feature films, the Fox News and Fox Movietone News libraries have largely survived. The earlier series and some parts of its sound successor are now held by the ": null
    },
    {
        "University of South Carolina": "University Of South Carolina"
    },
    {
        ", with the remaining Fox Movietone News still held by the company.       Fox Film briefly experimented with ": null
    },
    {
        "serial films": "Serial Film"
    },
    {
        ", releasing the 15-episode  Bride 13  and the 20-episode  Fantômas  in 1920. William Fox was unwilling to compromise on production quality in order to make serials profitable, however, and none were subsequently produced.       Hundreds of one- and two-reel ": null
    },
    {
        "short films": "Short Films"
    },
    {
        " of various types were also produced by Fox. Beginning in 1916, the ": null
    },
    {
        "Sunshine Comedy": "Sunshine Comedy"
    },
    {
        " division created two-reel ": null
    },
    {
        "comedy": "Comedy Film"
    },
    {
        " shorts. Many of these, beginning with 1917s  Roaring Lions and Wedding Bliss , starring ": null
    },
    {
        "Lloyd Hamilton": "Lloyd Hamilton"
    },
    {
        ", were ": null
    },
    {
        "slapstick": "Slapstick"
    },
    {
        ", intended to compete with ": null
    },
    {
        "Mack Sennetts": "Mack Sennett"
    },
    {
        " popular offerings. Sunshine releases continued until the introduction of sound. Other short film series included Imperial Comedies, Van Bibber Comedies , OHenry, Married Life of Helen and Warren, and Fox Varieties. Foxs expansion into Spanish-language films in the early 1930s also included shorts.       ": null
    }
]