[
    {
        "        Frank Lloyd Wright was an American ": null
    },
    {
        "architect": "Architect"
    },
    {
        ", interior designer, writer, and educator, who designed more than 1,000 structures, 532 of which were completed. Wright believed in designing structures that were in harmony with humanity and its environment, a philosophy he called ": null
    },
    {
        "organic architecture": "Organic Architecture"
    },
    {
        ". This philosophy was best exemplified by ": null
    },
    {
        "Fallingwater": "Fallingwater"
    },
    {
        " , which has been called the best all-time work of American architecture. His creative period spanned more than 70 years.     Wright was the pioneer of what came to be called the ": null
    },
    {
        "Prairie School": "Prairie School"
    },
    {
        " movement of architecture, and he also developed the concept of the ": null
    },
    {
        "Usonia": "Usonia"
    },
    {
        "n home in ": null
    },
    {
        "Broadacre City": "Broadacre City"
    },
    {
        ", his unique vision for urban planning in the United States. In addition to his houses, Wright designed original and innovative offices, churches, schools, skyscrapers, hotels, museums, and other structures. He often designed interior elements for these buildings, as well, including furniture and ": null
    },
    {
        "stained glass": "Stained Glass"
    },
    {
        ". Wright wrote 20 books and many articles and was a popular lecturer in the United States and Europe. Wright was recognized in 1991 by the ": null
    },
    {
        "American Institute of Architects": "American Institute Of Architects"
    },
    {
        " as the greatest American architect of all time. In 2019, a selection of his work became a listed ": null
    },
    {
        "World Heritage Site": "World Heritage Site"
    },
    {
        " as  The 20th-Century Architecture of Frank Lloyd Wright .     Raised in rural Wisconsin, Wright studied civil engineering at the ": null
    },
    {
        "University of Wisconsin": "University Of Wisconsin"
    },
    {
        " and then apprenticed in Chicago with noted architects ": null
    },
    {
        "Joseph Lyman Silsbee": "Joseph Lyman Silsbee"
    },
    {
        " and ": null
    },
    {
        "Louis Sullivan": "Louis Sullivan"
    },
    {
        ". He opened his own successful Chicago practice in 1893, and developed an influential home and studio in ": null
    },
    {
        "Oak Park, Illinois": "Oak Park, Illinois"
    },
    {
        ". His colorful personal life made headlines: leaving his first wife, Catherine Lee Kitty Tobin, and their children for ": null
    },
    {
        "Mamah Borthwick Cheney": "Mamah Borthwick"
    },
    {
        ", the murders by an employee at his ": null
    },
    {
        "Taliesin estate": "Taliesin"
    },
    {
        " in 1914, his tempestuous marriage with second wife Miriam Noel, and his relationship with ": null
    },
    {
        "Olga Lazovich Hinzenburg": "Olgivanna Lloyd Wright"
    },
    {
        ", who became his third wife in 1928.         Frank Lloyd Wright was born Frank Lincoln Wright in the farming town of ": null
    },
    {
        "Richland Center, Wisconsin": "Richland Center, Wisconsin"
    },
    {
        ", United States, in 1867. His father, William Cary Wright , Huxtable, Ada Louise, Frank Lloyd Wright: A Life, London: Penguin, 2004. was an orator, music teacher, occasional lawyer, and itinerant minister. Wrights mother, Anna Lloyd Jones , met William Cary Wright while working as a county school teacher when William was the superintendent of schools for ": null
    },
    {
        "Richland County": "Richland County, Wisconsin"
    },
    {
        ".     Originally from ": null
    },
    {
        "Massachusetts": "Massachusetts"
    },
    {
        ", William Wright had been a ": null
    },
    {
        "Baptist": "Baptist"
    },
    {
        " minister, but he later joined his wifes family in the ": null
    },
    {
        "Unitarian": "Unitarianism"
    },
    {
        " faith. Anna was a member of the well-known Lloyd Jones clan who had emigrated from ": null
    },
    {
        "Wales": "Wales"
    },
    {
        " to ": null
    },
    {
        "Spring Green, Wisconsin": "Spring Green, Wisconsin"
    },
    {
        ". One of Annas brothers was ": null
    },
    {
        "Jenkin Lloyd Jones": "Jenkin Lloyd Jones"
    },
    {
        ", an important figure in the spread of the Unitarian faith in the ": null
    },
    {
        "Midwest": "Midwestern United States"
    },
    {
        ". Both of Wrights parents were strong-willed individuals with artistic interests that they passed on to him.       According to Wrights autobiography, his mother declared when she was expecting that her first child would grow up to build beautiful buildings. She decorated his nursery with engravings of English cathedrals torn from a periodical to encourage the infants ambition.  In 1870, the family moved to ": null
    },
    {
        "Weymouth, Massachusetts": "Weymouth, Massachusetts"
    },
    {
        ", where William ministered to a small congregation.     In 1876, Anna visited the ": null
    },
    {
        "Centennial Exhibition": "Centennial Exhibition"
    },
    {
        " in ": null
    },
    {
        "Philadelphia": "Philadelphia"
    },
    {
        ", where she saw an exhibit of educational blocks created by ": null
    },
    {
        "Friedrich Wilhelm August Fröbel": "Friedrich Fröbel"
    },
    {
        ". The blocks, known as ": null
    },
    {
        "Froebel Gifts": "Froebel Gifts"
    },
    {
        ", were the foundation of his innovative ": null
    },
    {
        "kindergarten": "Kindergarten"
    },
    {
        " curriculum. Anna, a trained teacher, was excited by the program and bought a set with which young Wright spent much time playing. The blocks in the set were geometrically shaped and could be assembled in various combinations to form three-dimensional compositions. In his autobiography, Wright described the influence of these exercises on his approach to design: For several years, I sat at the little kindergarten table-top… and played… with the cube, the sphere and the triangle—these smooth wooden maple blocks… All are in my fingers to this day… Alofsin, Anthony . Frank Lloyd Wright--the Lost Years, 1910–1922: A Study of Influence. University of Chicago Press. p. 359. ; Hersey, George . Architecture and Geometry in the Age of the Baroque. University of Chicago Press. p. 205. . Many of Wrights buildings are notable for their geometrical clarity.     The Wright family struggled financially in Weymouth and returned to Spring Green, where the supportive Lloyd Jones family could help William find employment. They settled in ": null
    },
    {
        "Madison": "Madison, Wisconsin"
    },
    {
        ", where William taught music lessons and served as the secretary to the newly formed Unitarian society. Although William was a distant parent, he shared his love of music, especially the works of ": null
    },
    {
        "Johann Sebastian Bach": "Johann Sebastian Bach"
    },
    {
        ", with his children.     Soon after Wright turned 14, his parents separated. Anna had been unhappy for some time with Williams inability to provide for his family and asked him to leave. The divorce was finalized in 1885 after William sued Anna for lack of physical affection. William left Wisconsin after the divorce, and Wright claimed he never saw his father again. An Autobiography, by Frank Lloyd Wright, Duell, Sloan and Pearce, New York City, 1943, p. 51 At this time he changed his middle name from Lincoln to Lloyd in honor of his mothers family, the Lloyd Joneses.       Wright attended Madison High School; he graduated in 1885. Secrest, p.72 In 1886, he was admitted to the ": null
    },
    {
        "University of Wisconsin–Madison": "University Of Wisconsin–Madison"
    },
    {
        " as a special student. While there, Wright joined ": null
    },
    {
        "Phi Delta Theta": "Phi Delta Theta"
    },
    {
        " fraternity": "Fraternities And Sororities"
    },
    {
        ",  took classes part-time for two semesters, and worked with Allan D. Conover, a professor of civil engineering. Secrest, p. 82 Wright left the school without taking a degree, although he was granted an honorary doctorate of fine arts from the university in 1955. . University of Wisconsin-Madison.         In 1887, Wright arrived in Chicago in search of employment. As a result of the devastating ": null
    },
    {
        "Great Chicago Fire of 1871": "Great Chicago Fire Of 1871"
    },
    {
        " and a population boom, new development was plentiful. Wright later recalled that while his first impressions of Chicago were that of grimy neighborhoods, crowded streets, and disappointing architecture, he was determined to find work. Within days, and after interviews with several prominent firms, he was hired as a ": null
    },
    {
        "draftsman": "Drafter"
    },
    {
        " with the architectural firm of Joseph Lyman Silsbee. Wright previously collaborated with Silsbee—accredited as the draftsman and the construction supervisor—on the 1886 ": null
    },
    {
        "Unity Chapel": "Unity Chapel"
    },
    {
        " for Wrights family in Spring Green. While with the firm, he also worked on two other family projects: All Souls Church in Chicago for his uncle, Jenkin Lloyd Jones, and the ": null
    },
    {
        "Hillside Home School I": "Hillside Home School I"
    },
    {
        " in Spring Green for two of his aunts. Other draftsmen who worked for Silsbee in 1887 included future architects Cecil Corwin, ": null
    },
    {
        "George W. Maher": "George W. Maher"
    },
    {
        ", and ": null
    },
    {
        "George G. Elmslie": "George Grant Elmslie"
    },
    {
        ". Wright soon befriended Corwin, with whom he lived until he found a permanent home.     Feeling that he was underpaid for the quality of his work for Silsbee , the young draftsman quit and found work as a ": null
    },
    {
        "designer": "Architectural Designer"
    },
    {
        " at the firm of Beers, Clay, and Dutton. However, Wright soon realized that he was not ready to handle building design by himself; he left his new job to return to Joseph Silsbee—this time with a raise in salary.  Although Silsbee adhered mainly to ": null
    },
    {
        "Victorian": "Victorian Architecture"
    },
    {
        " and ": null
    },
    {
        "Revivalist": "Revivalism"
    },
    {
        " architecture, Wright found his work to be more gracefully picturesque than the other brutalities of the period.  Wright aspired for more progressive work.         Wright learned that the Chicago firm of ": null
    },
    {
        "Adler & Sullivan": "Adler  &  Sullivan"
    },
    {
        " was looking for someone to make the finished drawings for the interior of the ": null
    },
    {
        "Auditorium Building": "Auditorium Building, Chicago"
    },
    {
        " .  Wright demonstrated that he was a competent impressionist of Louis Sullivans ornamental designs and two short interviews later, was an official ": null
    },
    {
        "apprentice": "Apprenticeship"
    },
    {
        " in the firm.  Wright did not get along well with Sullivans other draftsmen; he wrote that several violent altercations occurred between them during the first years of his apprenticeship. For that matter, Sullivan showed very little respect for his employees, as well.  In spite of this, Sullivan took under his wing and gave him great design responsibility. As an act of respect, Wright would later refer to Sullivan as Lieber Meister . He also formed a bond with office foreman Paul Mueller. Wright later engaged Mueller in the constrution of several of his public and commercial buildings between 1903 and 1923.          On June 1, 1889, Wright married his first wife, Catherine Lee Kitty Tobin . The two had met around a year earlier during activities at All Souls Church. Sullivan did his part to facilitate the financial success of the young couple by granting Wright a five-year employment contract. Wright made one more request: Mr. Sullivan, if you want me to work for you as long as five years, couldnt you lend me enough money to build a little house?  With Sullivans $5,000 loan, Wright purchased a lot at the corner of Chicago and Forest Avenues in the suburb of ": null
    },
    {
        "Oak Park": "Oak Park, Illinois"
    },
    {
        ". The existing ": null
    },
    {
        "Gothic Revival": "Gothic Revival"
    },
    {
        " house was given to his mother, while a compact ": null
    },
    {
        "shingle style": "Shingle Style"
    },
    {
        " house was built alongside for Wright and Catherine.     By 1890, Wright had an office next to Sullivans that he shared with friend and draftsman ": null
    },
    {
        "George Elmslie": "George Elmslie"
    },
    {
        ", who had been hired by Sullivan at Wrights request. Wright had risen to head draftsman and handled all residential design work in the office. As a general rule, the firm of Adler & Sullivan did not design or build houses, but would oblige when asked by the clients of their important commercial projects. Wright was occupied by the firms major commissions during office hours, so house designs were relegated to evening and weekend overtime hours at his home studio. He later claimed total responsibility for the design of these houses, but a careful inspection of their architectural style suggests that Sullivan dictated the overall form and motifs of the residential works; Wrights design duties were often reduced to detailing the projects from Sullivans sketches. During this time, Wright worked on ": null
    },
    {
        "Sullivans bungalow": "Louis Sullivan Bungalow"
    },
    {
        " and the James A. Charnley bungalow in ": null
    },
    {
        "Ocean Springs, Mississippi": "Ocean Springs, Mississippi"
    },
    {
        ", the Berry-MacHarg House, ": null
    },
    {
        "James A. Charnley House": "James A. Charnley House"
    },
    {
        " , and the Louis Sullivan House , all in Chicago.           Despite Sullivans loan and overtime salary, Wright was constantly short on funds. Wright admitted that his poor finances were likely due to his expensive tastes in wardrobe and vehicles, and the extra luxuries he designed into his house. To supplement his income and repay his debts, Wright accepted independent commissions for at least nine houses. These bootlegged houses, as he later called them, were conservatively designed in variations of the fashionable ": null
    },
    {
        "Queen Anne": "Queen Anne Style Architecture"
    },
    {
        " and ": null
    },
    {
        "Colonial Revival": "Colonial Revival Architecture"
    },
    {
        " styles. Nevertheless, unlike the prevailing architecture of the period, each house emphasized simple geometric massing and contained features such as bands of horizontal windows, occasional ": null
    },
    {
        "cantilever": "Cantilever"
    },
    {
        "s, and open floor plans, which would become hallmarks of his later work. Eight of these early houses remain today, including the ": null
    },
    {
        "Thomas Gale": "Thomas H. Gale House"
    },
    {
        ", ": null
    },
    {
        "Robert Parker": "Robert P. Parker House"
    },
    {
        ", George Blossom, and ": null
    },
    {
        "Walter Gale": "Walter Gale House"
    },
    {
        " houses.      As with the residential projects for Adler & Sullivan, he designed his bootleg houses on his own time. Sullivan knew nothing of the independent works until 1893, when he recognized that one of the houses was unmistakably a Frank Lloyd Wright design. This particular house, built for Allison Harlan, was only blocks away from Sullivans townhouse in the Chicago community of ": null
    },
    {
        "Kenwood": "Kenwood, Chicago"
    },
    {
        ". Aside from the location, the geometric purity of the composition and balcony ": null
    },
    {
        "tracery": "Tracery"
    },
    {
        " in the same style as the Charnley House likely gave away Wrights involvement. Since Wrights five-year contract forbade any outside work, the incident led to his departure from Sullivans firm. Several stories recount the break in the relationship between Sullivan and Wright; even Wright later told two different versions of the occurrence. In An Autobiography, Wright claimed that he was unaware that his side ventures were a breach of his contract. When Sullivan learned of them, he was angered and offended; he prohibited any further outside commissions and refused to issue Wright the ": null
    },
    {
        "deed": "Deed"
    },
    {
        " to his Oak Park house until after he completed his five years. Wright could not bear the new hostility from his master and thought the situation was unjust. He threw down pencil and walked out of the Adler & Sullivan office never to return. Dankmar Adler, who was more sympathetic to Wrights actions, later sent him the deed.  However, Wright told his ": null
    },
    {
        "Taliesin": "Taliesin"
    },
    {
        " apprentices that Sullivan fired him on the spot upon learning of the Harlan House. Tafel also recounted that Wright had Cecil Corwin sign several of the bootleg jobs, indicating that Wright was aware of their illegal nature.  Regardless of the correct series of events, Wright and Sullivan did not meet or speak for 12 years.       After leaving Louis Sullivans firm, Wright established his own practice on the top floor of the Sullivan-designed ": null
    },
    {
        "Schiller Building": "Schiller Building"
    },
    {
        " on ": null
    },
    {
        "Randolph Street": "Randolph Street"
    },
    {
        " in Chicago. Wright chose to locate his office in the building because the tower location reminded him of the office of Adler & Sullivan. Although Cecil Corwin followed Wright and set up his architecture practice in the same office, the two worked independently and did not consider themselves partners.      In 1896, Wright moved out of the Schiller Building and into the nearby and newly completed ": null
    },
    {
        "Steinway Hall": "Steinway Hall"
    },
    {
        " building. The loft space was shared with Robert C. Spencer, Jr., ": null
    },
    {
        "Myron Hunt": "Myron Hunt"
    },
    {
        ", and ": null
    },
    {
        "Dwight H. Perkins": "Dwight H. Perkins"
    },
    {
        ".  These young architects, inspired by the ": null
    },
    {
        "Arts and Crafts Movement": "Arts And Crafts Movement"
    },
    {
        " and the philosophies of Louis Sullivan, formed what became known as the Prairie School. They were joined by Perkins apprentice, ": null
    },
    {
        "Marion Mahony": "Marion Mahony Griffin"
    },
    {
        ", who in 1895 transferred to Wrights team of drafters and took over production of his ": null
    },
    {
        "presentation drawings": "Architectural Drawingpresentation Drawings"
    },
    {
        " and watercolor ": null
    },
    {
        "renderings": "Architectural Rendering"
    },
    {
        ". Mahony, the third woman to be licensed as an architect in Illinois and one of the first licensed female architects in the U.S., also designed furniture, leaded glass windows, and light fixtures, among other features, for Wrights houses. Between 1894 and the early 1910s, several other leading Prairie School architects and many of Wrights future employees launched their careers in the offices of Steinway Hall.          Wrights projects during this period followed two basic models. His first independent commission, the ": null
    },
    {
        "Winslow House": "Winslow House"
    },
    {
        ", combined Sullivanesque ornamentation with the emphasis on simple geometry and horizontal lines. The Francis Apartments , ": null
    },
    {
        "Heller House": "Heller House"
    },
    {
        " , ": null
    },
    {
        "Rollin Furbeck House": "Rollin Furbeck House"
    },
    {
        " and Husser House were designed in the same mode. For his more conservative clients, Wright designed more traditional dwellings. These included the ": null
    },
    {
        "Dutch Colonial Revival": "Dutch Colonial Revival Architecture"
    },
    {
        " style Bagley House , ": null
    },
    {
        "Tudor Revival": "Tudor Revival Architecture"
    },
    {
        " style ": null
    },
    {
        "Moore House I": "Nathan G. Moore House"
    },
    {
        " , and ": null
    },
    {
        "Queen Anne": "Queen Anne Style Architecture"
    },
    {
        " style ": null
    },
    {
        "Charles E. Roberts": "Charles E. Roberts"
    },
    {
        " House .  While Wright could not afford to turn down clients over disagreements in taste, even his most conservative designs retained simplified massing and occasional Sullivan-inspired details.           Soon after the completion of the Winslow House in 1894, Edward Waller, a friend and former client, invited Wright to meet Chicago architect and planner ": null
    },
    {
        "Daniel Burnham": "Daniel Burnham"
    },
    {
        ". Burnham had been impressed by the Winslow House and other examples of Wrights work; he offered to finance a four-year education at the ": null
    },
    {
        "École des Beaux-Arts": "École Nationale Supérieure Des Beaux-Arts"
    },
    {
        " and two years in Rome. To top it off, Wright would have a position in Burnhams firm upon his return. In spite of guaranteed success and support of his family, Wright declined the offer. Burnham, who had directed the classical design of the ": null
    },
    {
        "Worlds Columbian Exposition": "Worlds Columbian Exposition"
    },
    {
        ", was a major proponent of the ": null
    },
    {
        "Beaux Arts movement": "Beaux-Arts Architecture"
    },
    {
        ", thought that Wright was making a foolish mistake. Yet for Wright, the classical education of the École lacked creativity and was altogether at odds with his vision of modern American architecture.           Wright relocated his practice to his home in 1898 to bring his work and family lives closer. This move made further sense as the majority of the architects projects at that time were in Oak Park or neighboring River Forest. The birth of three more children prompted Wright to sacrifice his original home studio space for additional bedrooms and necessitated his design and construction of an expansive ": null
    },
    {
        "studio addition": "Frank Lloyd Wright Home And Studio"
    },
    {
        " to the north of the main house. The space, which included a hanging ": null
    },
    {
        "balcony": "Balcony"
    },
    {
        " within the two-story drafting room, was one of Wrights first experiments with innovative structure. The studio embodied Wrights developing aesthetics and would become the laboratory from which his next 10 years of architectural creations would emerge. Frank Lloyd Wright Preservation Trust 2001, pp. 6–9.       By 1901, Wright had completed about 50 projects, including many houses in Oak Park. As his son John Lloyd Wright wrote: ": null
    },
    {
        "William Eugene Drummond": "William Eugene Drummond"
    },
    {
        ", Francis ": null
    },
    {
        "Barry Byrne": "Barry Byrne"
    },
    {
        ", ": null
    },
    {
        "Walter Burley Griffin": "Walter Burley Griffin"
    },
    {
        ", ": null
    },
    {
        "Albert Chase McArthur": "Albert Chase Mcarthur"
    },
    {
        ", ": null
    },
    {
        "Marion Mahony": "Marion Mahony Griffin"
    },
    {
        ", ": null
    },
    {
        "Isabel Roberts": "Isabel Roberts"
    },
    {
        ", and ": null
    },
    {
        "George Willis": "George Willis"
    },
    {
        " were the draftsmen. Five men, two women. They wore flowing ties, and smocks suitable to the realm. The men wore their hair like Papa, all except Albert, he didnt have enough hair. They worshiped Papa! Papa liked them! I know that each one of them was then making valuable contributions to the pioneering of the modern American architecture for which my father gets the full glory, headaches, and recognition today! My Father: Frank Lloyd Wright, by John Lloyd Wright; 1992; page 35                Between 1900 and 1901, Frank Lloyd Wright completed four houses which have since been identified as the onset of the ": null
    },
    {
        "Prairie style": "Prairie Style"
    },
    {
        " . Two, the ": null
    },
    {
        "Hickox": "Warren Hickox House"
    },
    {
        " and ": null
    },
    {
        "Bradley Houses": "B. Harley Bradley House"
    },
    {
        ", were the last transitional step between Wrights early designs and the Prairie creations. Meanwhile, the ": null
    },
    {
        "Thomas House": "Frank Thomas House"
    },
    {
        " and ": null
    },
    {
        "Willits House": "Willits House"
    },
    {
        " received recognition as the first mature examples of the new style.  At the same time, Wright gave his new ideas for the American house widespread awareness through two publications in the  Ladies Home Journal . The articles were in response to an invitation from the president of ": null
    },
    {
        "Curtis Publishing Company": "Curtis Publishing Company"
    },
    {
        ", ": null
    },
    {
        "Edward Bok": "Edward Bok"
    },
    {
        ", as part of a project to improve modern house design. A Home in a Prairie Town and A Small House with Lots of Room in it appeared respectively in the February and July 1901 issues of the journal. Although neither of the affordable house plans was ever constructed, Wright received increased requests for similar designs in following years. Wright came to Buffalo and designed homes for three of the companys executives, including the ": null
    },
    {
        "Darwin D. Martin House": "Darwin D. Martin House"
    },
    {
        " in 1904. Other Wright houses considered to be masterpieces of the Prairie Style are the Frederick ": null
    },
    {
        "Robie House": "Robie House"
    },
    {
        " in Chicago and the Avery and Queene ": null
    },
    {
        "Coonley House": "Coonley House"
    },
    {
        " in ": null
    },
    {
        "Riverside, Illinois": "Riverside, Illinois"
    },
    {
        ". The Robie House, with its soaring, ": null
    },
    {
        "cantilever": "Cantilever"
    },
    {
        "ed roof lines, supported by a 110-foot-long channel of steel, is the most dramatic. Its living and dining areas form virtually one uninterrupted space. With this and other buildings, included in the publication of the ": null
    },
    {
        "Wasmuth Portfolio": "Wasmuth Portfolio"
    },
    {
        " , Wrights work became known to European architects and had a profound influence on them after World War I. It is sometimes called the cornerstone of modernism .     Wrights residential designs of this era were known as prairie houses because the designs complemented the land around Chicago. Prairie-style houses often have a combination of these features: One or two-stories with one-story projections, an open floor plan, low-pitched roofs with broad, overhanging eaves, strong horizontal lines, ribbons of windows , a prominent central chimney, built-in stylized cabinetry, and a wide use of natural materials—especially stone and wood.      By 1909, Wright had begun to reject the upper-middle-class Prairie Style ": null
    },
    {
        "single-family house": "Single-Family House"
    },
    {
        " model, shifting his focus to a more democratic architecture.  Wright went to Europe in 1909 with a portfolio of his work and presented it to Berlin publisher ": null
    },
    {
        "Ernst Wasmuth": "Ernst Wasmuth"
    },
    {
        ". Secrest, p. 202 Studies and Executed Buildings of Frank Lloyd Wright, published in 1911, was the first major exposure of Wrights work in Europe. The work contained more than 100 lithographs of Wrights designs, and is commonly known as the ": null
    },
    {
        "Wasmuth Portfolio": "Wasmuth Portfolio"
    },
    {
        ".       Wright designed the house of ": null
    },
    {
        "Cornells": "Cornell"
    },
    {
        "chapter of ": null
    },
    {
        "Alpha Delta Phi": "Alpha Delta Phi"
    },
    {
        " literary society , the Hillside Home School, built for his aunts in Spring Green, Wisconsin and the ": null
    },
    {
        "Unity Temple": "Unity Temple"
    },
    {
        " in Oak Park, Illinois.   As a lifelong ": null
    },
    {
        "Unitarian": "Unitarianism"
    },
    {
        " and member of Unity Temple, Wright offered his services to the congregation after their church burned down, working on the building from 1905 to 1909. Wright later said that Unity Temple was the edifice in which he ceased to be an architect of structure, and became an architect of space.  Other early notable public buildings included the ": null
    },
    {
        "Larkin Administration Building": "Larkin Administration Building"
    },
    {
        " as well as the Geneva Inn , the ": null
    },
    {
        "Midway Gardens": "Midway Gardens"
    },
    {
        " , the ": null
    },
    {
        "Banff National Park Pavilion": "Banff National Park Pavilion"
    },
    {
        " , and the ": null
    },
    {
        "Imperial Hotel": "Imperial Hotel, Tokyo"
    },
    {
        " .       In the early 1920s, Wright designed a ": null
    },
    {
        "textile": "Textile Block House"
    },
    {
        " concrete block system reinforced by an internal system of bars. The system of precast blocks, he wrote, enabled fabrication as infinite in color, texture, and variety as in that rug.  Wright first used his textile block system on the ": null
    },
    {
        "Millard House": "Millard House"
    },
    {
        " in Pasadena , California, in 1923. Typically Wrightian is the joining of the structure to its site by a series of terraces that reach out into and reorder the landscape, making it an integral part of the architects vision. With the ": null
    },
    {
        "Ennis House": "Ennis House"
    },
    {
        " and the ": null
    },
    {
        "Samuel Freeman House": "Samuel Freeman House"
    },
    {
        " , Wright had further opportunities to test the limits of the textile block system, including limited use in the ": null
    },
    {
        "Arizona Biltmore Hotel": "Arizona Biltmore Hotel"
    },
    {
        " in 1927. Sanderson, Arlene, Wright Sites, Princeton Architectural Press, 1995, p. 16, The Ennis house is now used in films, television, and print media to represent the future. Wrights son, ": null
    },
    {
        "Lloyd Wright": "Lloyd Wright"
    },
    {
        ", supervised construction for the Storer, Freeman and Ennis Houses. Architectural historian ": null
    },
    {
        "Thomas Hines": "Thomas Hines"
    },
    {
        " has suggested that Lloyds contribution to these projects is often overlooked.      After World War II, Wright updated the concrete block system, calling it the Usonian Automatic system, resulting in the construction of several notable homes. As he explained in The Natural House , The original blocks are made on the site by ramming concrete into wood or metal wrap-around forms, with one outside face , and one rear or inside face, generally coffered, for lightness.”            In 1903, while Wright was designing a house for Edwin Cheney , he became enamored with Cheneys wife, Mamah. ": null
    },
    {
        "Mamah Borthwick Cheney": "Mamah Borthwick"
    },
    {
        " was a modern woman with interests outside the home. She was an early feminist, and Wright viewed her as his intellectual equal. Their relationship became the talk of the town; they often could be seen taking rides in Wrights automobile through Oak Park. In 1909, Wright and Mamah Cheney met up in Europe, leaving their spouses and children behind. Wright remained in Europe for almost a year, first in ": null
    },
    {
        "Florence, Italy": "Florence, Italy"
    },
    {
        " and, later, in ": null
    },
    {
        "Fiesole, Italy": "Fiesole, Italy"
    },
    {
        ", where he lived with Mamah. During this time, Edwin Cheney granted Mamah a divorce, though Kitty still refused to grant one to her husband. After Wright returned to the United States in October 1910, he persuaded his mother to buy land for him in Spring Green, Wisconsin. The land, bought on April 10, 1911, was adjacent to land held by his mothers family, the Lloyd-Joneses. Wright began to build himself a new home, which he called , by May 1911. The recurring theme of  also came from his mothers side:  in ": null
    },
    {
        "Welsh mythology": "Welsh Mythology"
    },
    {
        " was a poet, magician, and priest. The family motto,  , was taken from the Welsh poet , who also had a son named Taliesin. The motto is still used today as the cry of the druids and chief bard of the  in Wales.        On August 15, 1914, while Wright was working in Chicago, Julian Carlton, a male servant who had been hired several months earlier, set fire to the living quarters of Taliesin and murdered seven people with an axe as the fire burned. The dead included Mamah; her two children, John and Martha Cheney; a gardener ; a draftsman ; a workman ; and another workmans son . Two people survived the mayhem, one of whom, William Weston, helped to put out the fire that almost completely consumed the residential wing of the house. Carlton swallowed ": null
    },
    {
        "hydrochloric acid": "Hydrochloric Acid"
    },
    {
        " immediately following the attack in an attempt to ": null
    },
    {
        "kill himself": "Suicide"
    },
    {
        ". He was nearly ": null
    },
    {
        "lynched": "Lynching"
    },
    {
        " on the spot, but was taken to the ": null
    },
    {
        "Dodgeville": "Dodgeville, Wisconsin"
    },
    {
        " jail. Carlton died from ": null
    },
    {
        "starvation": "Starvation"
    },
    {
        " seven weeks after the attack, despite medical attention.       In 1922, Kitty Wright finally granted Wright a divorce. Under the terms of the divorce, Wright was required to wait one year before he could marry his then-mistress, Maude Miriam Noel. In 1923, Wrights mother, Anna Wright, died. Wright wed Miriam Noel in November 1923, but her addiction to ": null
    },
    {
        "morphine": "Morphine"
    },
    {
        " led to the failure of the marriage in less than one year. In 1924, after the separation, but while still married, Wright met ": null
    },
    {
        "Olga Lazovich Hinzenburg": "Olgivanna Lloyd Wright"
    },
    {
        " at a Petrograd Ballet performance in Chicago. They moved in together at Taliesin in 1925, and soon Olgivanna was pregnant with their daughter, Iovanna, born on December 2, 1925.     On April 20, 1925, another fire destroyed the bungalow at Taliesin. Crossed wires from a newly installed telephone system were deemed to be responsible for the blaze, which destroyed a collection of Japanese prints that Wright estimated to be worth $250,000 to $500,000. Secrest, p. 315–317. Wright rebuilt the living quarters, naming the home Taliesin III .     In 1926, Olgas ex-husband, Vlademar Hinzenburg, sought custody of his daughter, Svetlana. In October 1926, Wright and Olgivanna were accused of violating the ": null
    },
    {
        "Mann Act": "Mann Act"
    },
    {
        " and arrested in ": null
    },
    {
        "Tonka Bay, Minnesota": "Tonka Bay, Minnesota"
    },
    {
        ". Minnesota Historical Society, Collections Up Close,  The charges were later dropped.     Wright and Miriam Noels divorce was finalized in 1927, Wright was again required to wait for one year before remarrying. Wright and Olgivanna married in 1928.           In 1932, Wright and his wife Olgivanna put out a call for students to come to Taliesin to study and work under Wright while they learned architecture and spiritual development. . Twenty-three came to live and work that year, as did many more in the years that followed.   Considerable controversy existed over the living conditions and education of the fellows; recent books and articles have given conflicting and often unflattering pictures of their treatment. Friedland, Roger, and Harold Zellman. The Fellowship: The Untold Story of Frank Lloyd Wright & the Taliesin Fellowship. New York: Harper Perennial, 2007. Marty, Myron A, and Shirley L. Marty. Frank Lloyd Wrights Taliesin Fellowship. Kirksville, Mo: Truman State University Press, 1999.  The Fellowship has evolved into what is now the Frank Lloyd Wright School of Architecture, an accredited school.  Wright was reputedly a difficult person to work with. One apprentice wrote: He is devoid of consideration and has a blind spot regarding others qualities. Yet I believe, that a year in his studio would be worth any sacrifice.                Wright is responsible for a series of concepts of suburban development united under the term ": null
    },
    {
        "Broadacre City": "Broadacre City"
    },
    {
        ". He proposed the idea in his book The Disappearing City in 1932, and unveiled a  model of this community of the future, showing it in several venues in the following years. Concurrent with the development of Broadacre City, also referred to as Usonia, Wright conceived a new type of dwelling that came to be known as the ": null
    },
    {
        "Usonia": "Usonia"
    },
    {
        "n House. Although an early version of the form can be seen in the ": null
    },
    {
        "Malcolm Willey House": "Malcolm Willey House"
    },
    {
        " in Minneapolis, the Usonian ideal emerged most completely in the ": null
    },
    {
        "Herbert and Katherine Jacobs First House": "Herbert And Katherine Jacobs First House"
    },
    {
        " in Madison, Wisconsin. Designed on a gridded concrete slab that integrated the houses radiant heating system, the house featured new approaches to construction, including walls composed of a sandwich of wood siding, plywood cores and building paper—a significant change from typically framed walls. Twombly, p.242 Usonian houses commonly featured flat roofs and were usually constructed without basements or attics, all features that Wright had been promoting since the early 20th century.     Usonian houses were Wrights response to the transformation of domestic life that occurred in the early 20th century when servants had become less prominent or completely absent from most American households. By developing homes with progressively more open plans, Wright allotted the woman of the house a workspace, as he often called the kitchen, where she could keep track of and be available for the children and/or guests in the dining room. Twombly, p.257 As in the Prairie Houses, Usonian living areas had a fireplace as a point of focus. Bedrooms, typically isolated and relatively small, encouraged the family to gather in the main living areas. The conception of spaces instead of rooms was a development of the Prairie ideal. The built-in furnishings related to the Arts and Crafts movements principles which influenced Wrights early work. Spatially and in terms of their construction, the Usonian houses represented a new model for independent living, and allowed dozens of clients to live in a Wright-designed house at relatively low cost. His Usonian homes set a new style for suburban design that influenced countless postwar developers. Twombly, p.244 Many features of modern American homes date back to Wright: open plans, slab-on-grade foundations, and simplified construction techniques that allowed more mechanization and efficiency in building.              Fallingwater , one of Wrights most famous private residences , was built for Mr. and Mrs. ": null
    },
    {
        "Edgar J. Kaufmann, Sr.": "Edgar J. Kaufmann"
    },
    {
        ", at ": null
    },
    {
        "Mill Run, Pennsylvania": "Mill Run, Pennsylvania"
    },
    {
        ". Constructed over a 30-foot waterfall, it was designed according to Wrights desire to place the occupants close to the natural surroundings. The house was intended to be more of a family getaway, rather than a live-in home. The construction is a series of cantilevered balconies and terraces, using ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        " for all verticals and concrete for the horizontals. The house cost $155,000, including the architects fee of $8,000. It was one of Wrights most expensive pieces. Kaufmanns own engineers argued that the design was not sound. They were overruled by Wright, but the contractor secretly added extra steel to the horizontal concrete elements. In 1994, Robert Silman and Associates examined the building and developed a plan to restore the structure. In the late 1990s, steel supports were added under the lowest cantilever until a detailed structural analysis could be done. In March 2002, ": null
    },
    {
        "post-tensioning": "Post-Tensioned Concrete"
    },
    {
        " of the lowest terrace was completed.     ": null
    },
    {
        "Taliesin West": "Taliesin West"
    },
    {
        ", Wrights winter home and studio complex in ": null
    },
    {
        "Scottsdale, Arizona": "Scottsdale, Arizona"
    },
    {
        ", was a laboratory for Wright from 1937 to his death in 1959. Now the home of the Frank Lloyd Wright Foundation and archives, it continues today as the site of the Frank Lloyd Wright School of Architecture.   Wright turned 80 shortly after World War II ended, yet remained busy. The ": null
    },
    {
        "Solomon R. Guggenheim Museum": "Solomon R. Guggenheim Museum"
    },
    {
        " in New York City occupied Wright for 16  years  and is probably his most recognized masterpiece. The building rises as a warm beige spiral from its site on ": null
    },
    {
        "Fifth Avenue": "Fifth Avenue"
    },
    {
        "; its interior is similar to the inside of a ": null
    },
    {
        "seashell": "Seashell"
    },
    {
        ". Its unique central geometry was meant to allow visitors to easily experience Guggenheims collection of nonobjective geometric paintings by taking an elevator to the top level and then viewing artworks by walking down the slowly descending, central spiral ramp, the floor of which is embedded with circular shapes and triangular light fixtures to complement the geometric nature of the structure. However, when the museum was completed, a number of details of Wrights design were ignored, such as his desire for the interior to be painted off-white.        The only realized skyscraper designed by Wright is the ": null
    },
    {
        "Price Tower": "Price Tower"
    },
    {
        ", a 19-story tower in ": null
    },
    {
        "Bartlesville, Oklahoma": "Bartlesville, Oklahoma"
    },
    {
        ". It is also one of the two existing vertically oriented Wright structures . The Price Tower was commissioned by Harold C. Price of the H. C. Price Company, a local ": null
    },
    {
        "oil pipeline": "Oil Pipeline"
    },
    {
        " and chemical firm. On March 29, 2007, Price Tower was designated a ": null
    },
    {
        "National Historic Landmark": "National Historic Landmark"
    },
    {
        " by the ": null
    },
    {
        "United States Department of the Interior": "United States Department Of The Interior"
    },
    {
        ", one of only 20 such properties in Oklahoma.  — National Historic Landmarks Designated, April 13, 2007     ": null
    },
    {
        "Monona Terrace": "Monona Terrace"
    },
    {
        ", originally designed in 1937 as municipal offices for Madison, Wisconsin, was completed in 1997 on the original site, using a variation of Wrights final design for the exterior, with the interior design altered by its new purpose as a convention center. The as-built design was carried out by Wrights apprentice Tony Puttnam. Monona Terrace was accompanied by controversy throughout the 60 years between the original design and the completion of the structure.      ": null
    },
    {
        "Florida Southern College": "Florida Southern College"
    },
    {
        ", located in ": null
    },
    {
        "Lakeland, Florida": "Lakeland, Florida"
    },
    {
        ", constructed 12 Frank Lloyd Wright buildings between 1941 and 1958 as part of the ": null
    },
    {
        "Child of the Sun": "Child Of The Sun"
    },
    {
        " project. It is the worlds largest single-site collection of Frank Lloyd Wright architecture.             His Prairie houses use themed, coordinated design elements that are repeated in windows, carpets, and other fittings. He made innovative use of new building materials such as ": null
    },
    {
        "precast concrete": "Precast Concrete"
    },
    {
        " blocks, glass bricks, and zinc ": null
    },
    {
        "cames": "Came"
    },
    {
        " for his leadlight windows, and he famously used ": null
    },
    {
        "Pyrex": "Pyrex"
    },
    {
        " glass tubing as a major element in the ": null
    },
    {
        "Johnson Wax Headquarters": "Johnson Wax Headquarters"
    },
    {
        ". Wright was also one of the first architects to design and install custom-made electric light fittings, including some of the first electric floor lamps, and his very early use of the then-novel spherical glass lampshade . In 1897, Wright received a patent for Prism Glass Tiles that were used in storefronts to direct light toward the interior.  Wright fully embraced glass in his designs and found that it fit well into his philosophy of organic architecture. According to Wrights organic theory, all components of the building should appear unified, as though they belong together. Nothing should be attached to it without considering the effect on the whole. To unify the house to its site, Wright often used large expanses of glass to blur the boundary between the indoors and outdoors.  Glass allowed for interaction and viewing of the outdoors while still protecting from the elements. In 1928, Wright wrote an essay on glass in which he compared it to the mirrors of nature: lakes, rivers and ponds. Frank Lloyd Wright. In the Cause of Architecture, VI: The Meaning of Materials—Glass . The Architectural Record, 64, 10-16. One of Wrights earliest uses of glass in his works was to string panes of glass along whole walls in an attempt to create light screens to join together solid walls. By using this large amount of glass, Wright sought to achieve a balance between the lightness and airiness of the glass and the solid, hard walls. Arguably, Wrights best-known art glass is that of the Prairie style. The simple geometric shapes that yield to very ornate and intricate windows represent some of the most integral ornamentation of his career.      Wright also designed some of his own clothing. His fashion sense was unique and he usually wore expensive suits, flowing neckties, and capes. He had a fascination with automobiles, purchasing his first car in 1909, a Stoddard-Dayton roadster, and owned many exotic vehicles over the years. During the cash-strapped Depression, Wright drove cheaper vehicles. Some of his last cars in the 1950s included four Volkswagens and a Chevrolet Nomad wagon along with flashier articles such as a Jaguar Mark VII. He owned some 50 cars between 1909 and his death, of which 10 are known to survive.          Wright strongly believed in individualism and did not affiliate with the ": null
    },
    {
        "American Institute of Architects": "American Institute Of Architects"
    },
    {
        " during his career, going so far as to call the organization a harbor of refuge for the incompetent, and a form of refined gangsterism. When an associate referred to him as an old amateur Wright confirmed, I am the oldest.  Wright rarely credited any influences on his designs, but most architects, historians and scholars agree he had five major influences:   ": null
    },
    {
        "Louis Sullivan": "Louis Sullivan"
    },
    {
        ", whom he considered to be his Lieber Meister   Nature, particularly shapes/forms and colors/patterns of plant life   Music    Japanese art, prints and buildings   ": null
    },
    {
        "Froebel Gifts": "Froebel Gifts"
    },
    {
        "      He also routinely claimed the work of architects and architectural designers who were his employees as his own designs, and also claimed that the rest of the Prairie School architects were merely his followers, imitators, and subordinates. The Magic of America , Marion Mahony Griffin As with any architect, though, Wright worked in a collaborative process and drew his ideas from the work of others. In his earlier days, Wright worked with some of the top architects of the ": null
    },
    {
        "Chicago School": "Chicago School"
    },
    {
        ", including Sullivan. In his Prairie School days, Wrights office was populated by many talented architects, including ": null
    },
    {
        "William Eugene Drummond": "William Eugene Drummond"
    },
    {
        ", ": null
    },
    {
        "John Van Bergen": "John Van Bergen"
    },
    {
        ", ": null
    },
    {
        "Isabel Roberts": "Isabel Roberts"
    },
    {
        ", Francis ": null
    },
    {
        "Barry Byrne": "Barry Byrne"
    },
    {
        ", ": null
    },
    {
        "Albert McArthur": "Albert Chase Mcarthur"
    },
    {
        ", ": null
    },
    {
        "Marion Mahony Griffin": "Marion Mahony Griffin"
    },
    {
        ", and ": null
    },
    {
        "Walter Burley Griffin": "Walter Burley Griffin"
    },
    {
        ".     The Czech-born architect ": null
    },
    {
        "Antonin Raymond": "Antonin Raymond"
    },
    {
        ", recognized as the father of modern architecture in Japan, worked for Wright at Taliesin and led the construction of the Imperial Hotel in Tokyo. He subsequently stayed in Japan and opened his own practice. ": null
    },
    {
        "Rudolf Schindler": "Rudolph Schindler"
    },
    {
        " also worked for Wright on the Imperial Hotel. His own work is often credited as influencing Wrights Usonian houses. Schindlers friend ": null
    },
    {
        "Richard Neutra": "Richard Neutra"
    },
    {
        " also worked briefly for Wright and became an internationally successful architect.     Later, in the ": null
    },
    {
        "Taliesin": "Taliesin"
    },
    {
        " days, Wright employed many architects and artists who later become notable, such as ": null
    },
    {
        "Aaron Green": "Aaron Green"
    },
    {
        ", ": null
    },
    {
        "John Lautner": "John Lautner"
    },
    {
        ", ": null
    },
    {
        "E. Fay Jones": "E. Fay Jones"
    },
    {
        ", ": null
    },
    {
        "Henry Klumb": "Henry Klumb"
    },
    {
        ", ": null
    },
    {
        "William Bernoudy": "William Bernoudy"
    },
    {
        ", and ": null
    },
    {
        "Paolo Soleri": "Paolo Soleri"
    },
    {
        ".       Frank Lloyd Wright was interested in site and community planning throughout his career. His commissions and theories on urban design began as early as 1900 and continued until his death. He had 41 commissions on the scale of community planning or urban design. Wrightscapes: Frank Lloyd Wrights Landscape Designs, Charles E. and Berdeana Aguar, McGraw-Hill, 2002, p.344     His thoughts on suburban design started in 1900 with a proposed subdivision layout for ": null
    },
    {
        "Charles E. Roberts": "Charles E. Roberts"
    },
    {
        " entitled the Quadruple Block Plan. This design strayed from traditional suburban lot layouts and set houses on small square blocks of four equal-sized lots surrounded on all sides by roads instead of straight rows of houses on parallel streets. The houses, which used the same design as published in A Home in a Prairie Town from the Ladies Home Journal, were set toward the center of the block to maximize the yard space and included private space in the center. This also allowed for far more interesting views from each house. Although this plan was never realized, Wright published the design in the Wasmuth Portfolio in 1910.      The more ambitious designs of entire communities were exemplified by his entry into the City Club of Chicago Land Development Competition in 1913. The contest was for the development of a suburban quarter section. This design expanded on the Quadruple Block Plan and included several social levels. The design shows the placement of the upscale homes in the most desirable areas and the ": null
    },
    {
        "blue collar": "Blue Collar"
    },
    {
        " homes and apartments separated by parks and common spaces. The design also included all the amenities of a small city: schools, museums, markets, etc.  This view of decentralization was later reinforced by theoretical ": null
    },
    {
        "Broadacre City": "Broadacre City"
    },
    {
        " design. The philosophy behind his community planning was decentralization. The new development must be away from the cities. In this decentralized America, all services and facilities could coexist factories side by side with farm and home.      Notable community planning designs:     1900–03 – Quadruple Block Plan, 24 homes in Oak Park, Illinois   1909 – ": null
    },
    {
        "Como Orchard Summer Colony": "Como Orchard Summer Colony"
    },
    {
        ", town site development for new town in the ": null
    },
    {
        "Bitterroot Valley": "Bitterroot Valley"
    },
    {
        ", Montana   1913 – Chicago Land Development competition, suburban Chicago quarter section   1934–59 – ": null
    },
    {
        "Broadacre City": "Broadacre City"
    },
    {
        ", theoretical decentralized city plan, exhibits of large-scale model   1938 – ": null
    },
    {
        "Suntop Homes": "Suntop Homes"
    },
    {
        ", also known as Cloverleaf Quadruple Housing Project – commission from ": null
    },
    {
        "Federal Works Agency": "Federal Works Agency"
    },
    {
        ", Division of Defense Housing, a low-cost multifamily housing alternative to suburban development   1942 – Cooperative Homesteads, commissioned by a group of auto workers, teachers and other professionals, 160-acre farm co-op was to be the pioneer of ": null
    },
    {
        "rammed earth": "Rammed Earth"
    },
    {
        " and earth berm construction Treasures of Taliesin: Seventy Seven Unbuilt Designs, Bruce Brooks Pfeiffer, Director of the Frank Lloyd Wright Archive   1945 – ": null
    },
    {
        "Usonia Homes": "Usonia Homes"
    },
    {
        ", 47 homes in ": null
    },
    {
        "Pleasantville, New York": "Pleasantville, New York"
    },
    {
        " The Acres": "The Acres"
    },
    {
        ", also known as Galesburg Country Homes, five homes in ": null
    },
    {
        "Charleston Township, Michigan": "Charleston Township, Michigan"
    },
    {
        " plat": "Plat"
    },
    {
        " in Kalamazoo, Michigan, developed by Wright containing mostly Usonian homes on circular lots with common spaces in between       Though most famous as an architect, Wright was an active dealer in Japanese art, primarily  ukiyo-e  ": null
    },
    {
        "woodblock prints": "Woodblock Printing In Japan"
    },
    {
        ". He frequently served as both architect and art dealer to the same clients; he designed a home, then provided the art to fill it.  For a time, Wright made more from selling art than from his work as an architect. Wright was also an avid collector of Japanese prints and used them as teaching aids with his apprentices in what were called print parties . Julia Meech. Frank Lloyd Wright and the Art of Japan: The Architects Other Passion. New York: Abrams, 2000.     Wright first traveled to Japan in 1905, where he bought hundreds of prints. The following year, he helped organize the worlds first retrospective exhibition of works by ": null
    },
    {
        "Hiroshige": "Hiroshige"
    },
    {
        ", held at the ": null
    },
    {
        "Art Institute of Chicago": "Art Institute Of Chicago"
    },
    {
        ". For many years, he was a major presence in the Japanese art world, selling a great number of works to prominent collectors such as John Spaulding of Boston, and to prominent museums such as the ": null
    },
    {
        "Metropolitan Museum of Art": "Metropolitan Museum Of Art"
    },
    {
        " in New York. He penned a book on Japanese art in 1912.     In 1920, however, rival art dealers began to spread rumors that Wright was selling retouched prints; this, combined with Wrights tendency to live beyond his means, and other factors, led to great financial troubles for the architect. Though he provided his clients with genuine prints as replacements for those he was accused of retouching, this marked the end of the high point of his career as an art dealer. He was forced to sell off much of his art collection in 1927 to pay off outstanding debts; the Bank of Wisconsin claimed his Taliesin home the following year, and sold thousands of his prints, for only one dollar a piece, to collector ": null
    },
    {
        "Edward Burr Van Vleck": "Edward Burr Van Vleck"
    },
    {
        ".     Wright continued to collect and deal in prints until his death in 1959, using prints as collateral for loans, often relying upon his art business to remain financially solvent.      The extent of his dealings in Japanese art went largely unknown, or underestimated, among art historians for decades until, in 1980, Julia Meech, then associate curator of Japanese art at the Metropolitan Museum, began researching the history of the museums collection of Japanese prints. She discovered a three-inch-deep clump of 400 cards from 1918, each listing a print bought from the same seller—F. L. Wright and a number of letters exchanged between Wright and the museums first curator of Far Eastern Art, Sigisbert C. Bosch Reitz, in 1918-22. These discoveries, and subsequent research, led to a renewed understanding of Wrights career as an art dealer.         On April 4, 1959, Wright was hospitalized for abdominal pains and was operated on April 6. He seemed to be recovering, but he died quietly on April 9. Huxtable, p.245 After his death, Wrights legacy was plagued with turmoil for years.       ": null
    }
]