[
    {
        "             Francium is a ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        "  Fr and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        "  87. Prior to its discovery, it was referred to as ": null
    },
    {
        "eka": "Mendeleevs Predicted Elements"
    },
    {
        "-": null
    },
    {
        "caesium": "Caesium"
    },
    {
        ". It is extremely ": null
    },
    {
        "radioactive": "Radioactive"
    },
    {
        "; its most stable isotope, francium-223 , has a half-life of only 22  minutes. It is the second-most ": null
    },
    {
        "electropositive": "Electronegative"
    },
    {
        " element, behind only caesium, and is the ": null
    },
    {
        "second rarest": "Abundance Of The Chemical Elements"
    },
    {
        " naturally occurring element . The isotopes of francium decay quickly into ": null
    },
    {
        "astatine": "Astatine"
    },
    {
        ", ": null
    },
    {
        "radium": "Radium"
    },
    {
        ", and ": null
    },
    {
        "radon": "Radon"
    },
    {
        ". The ": null
    },
    {
        "electronic structure": "Electronic Structure"
    },
    {
        " of a francium atom is 7s 1 , and so the element is classed as an ": null
    },
    {
        "alkali metal": "Alkali Metal"
    },
    {
        ".     Bulk francium has never been viewed. Because of the general appearance of the other elements in its periodic table column, it is assumed that francium would appear as a highly reactive metal, if enough could be collected together to be viewed as a bulk solid or liquid. Obtaining such a sample is highly improbable, since the extreme heat of decay caused by its short half-life would immediately vaporize any viewable quantity of the element.     Francium was discovered by ": null
    },
    {
        "Marguerite Perey": "Marguerite Perey"
    },
    {
        " in France in 1939.  It was the last element first discovered in nature, rather than by synthesis. Outside the laboratory, francium is extremely rare, with trace amounts found in ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        " and ": null
    },
    {
        "thorium": "Thorium"
    },
    {
        " ores, where the ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        " francium-223 continually forms and decays. As little as 20–30  g exists at any given time throughout the ": null
    },
    {
        "Earths crust": "Earths Crust"
    },
    {
        "; the other isotopes are entirely synthetic. The largest amount produced in the laboratory was a cluster of more than 300,000 atoms.       Francium is one of the most unstable of the naturally occurring elements: its longest-lived isotope, francium-223, has a ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of only 22  minutes. The only comparable element is ": null
    },
    {
        "astatine": "Astatine"
    },
    {
        ", whose most stable natural isotope, astatine-219 , has a half-life of 56  seconds, although synthetic astatine-210 is much longer-lived with a half-life of 8.1  hours. All isotopes of francium decay into astatine, ": null
    },
    {
        "radium": "Radium"
    },
    {
        ", or ": null
    },
    {
        "radon": "Radon"
    },
    {
        ".  Francium-223 also has a shorter half-life than the longest-lived isotope of each synthetic element up to and including element 105, ": null
    },
    {
        "dubnium": "Dubnium"
    },
    {
        ".      Francium is an alkali metal whose chemical properties mostly resemble those of caesium. A heavy element with a single ": null
    },
    {
        "valence electron": "Valence Electron"
    },
    {
        ",  it has the highest ": null
    },
    {
        "equivalent weight": "Equivalent Weight"
    },
    {
        " of any element. Liquid francium—if created—should have a ": null
    },
    {
        "surface tension": "Surface Tension"
    },
    {
        " of 0.05092  ": null
    },
    {
        "N": "Newton"
    },
    {
        "/m at its melting point.  Franciums melting point was estimated to be around 8.0  °C . The melting point is uncertain because of the elements extreme rarity and ": null
    },
    {
        "radioactivity": "Radioactivity"
    },
    {
        "; a different extrapolation based on ": null
    },
    {
        "Dmitri Mendeleevs": "Dmitri Mendeleev"
    },
    {
        " method gave 20±1.5  °C . The estimated boiling point of 620  °C is also uncertain; the estimate 598  °C , as well as the extrapolation from Mendeleevs method of 640  °C , have also been suggested. The density of francium is expected to be around 2.48  g/cm 3 .     ": null
    },
    {
        "Linus Pauling": "Linus Pauling"
    },
    {
        " estimated the ": null
    },
    {
        "electronegativity": "Electronegativity"
    },
    {
        " of francium at 0.7 on the ": null
    },
    {
        "Pauling scale": "Pauling Scale"
    },
    {
        ", the same as caesium;  the value for caesium has since been refined to 0.79, but there are no experimental data to allow a refinement of the value for francium.  Francium has a slightly higher ": null
    },
    {
        "ionization energy": "Ionization Energy"
    },
    {
        " than caesium,  392.811  kJ/mol as opposed to 375.7041  kJ/mol for caesium, as would be expected from ": null
    },
    {
        "relativistic effects": "Relativistic Quantum Chemistry"
    },
    {
        ", and this would imply that caesium is the less electronegative of the two. Francium should also have a higher ": null
    },
    {
        "electron affinity": "Electron Affinity"
    },
    {
        " than caesium and the Fr − ion should be more ": null
    },
    {
        "polarizable": "Polarizability"
    },
    {
        " than the Cs − ion.  The CsFr molecule is predicted to have francium at the negative end of the dipole, unlike all known heterodiatomic alkali metal molecules. Francium ": null
    },
    {
        "superoxide": "Superoxide"
    },
    {
        " is expected to have a more ": null
    },
    {
        "covalent": "Covalent"
    },
    {
        " character than its lighter ": null
    },
    {
        "congeners": "Congener"
    },
    {
        "; this is attributed to the 6p electrons in francium being more involved in the francium–oxygen bonding.     Francium ": null
    },
    {
        "coprecipitates": "Coprecipitation"
    },
    {
        " with several caesium ": null
    },
    {
        "salts": "Salt"
    },
    {
        ", such as ": null
    },
    {
        "caesium perchlorate": "Caesium Perchlorate"
    },
    {
        ", which results in small amounts of francium perchlorate. This coprecipitation can be used to isolate francium, by adapting the radiocaesium coprecipitation method of ": null
    },
    {
        "Lawrence E. Glendenin": "Lawrence E. Glendenin"
    },
    {
        " and C. M. Nelson. It will additionally coprecipitate with many other caesium salts, including the ": null
    },
    {
        "iodate": "Iodate"
    },
    {
        ", the ": null
    },
    {
        "picrate": "Picrate"
    },
    {
        ", the ": null
    },
    {
        "tartrate": "Tartrate"
    },
    {
        " , the ": null
    },
    {
        "chloroplatinate": "Chloroplatinate"
    },
    {
        ", and the ": null
    },
    {
        "silicotungstate": "Silicotungstate"
    },
    {
        ". It also coprecipitates with ": null
    },
    {
        "silicotungstic acid": "Silicotungstic Acid"
    },
    {
        ", and with ": null
    },
    {
        "perchloric acid": "Perchloric Acid"
    },
    {
        ", without another alkali metal as a ": null
    },
    {
        "carrier": "Carrier"
    },
    {
        ", which provides other methods of separation.  E. N K. Hyde Radiochemistry of Francium, Subcommittee on Radiochemistry, National Academy of Sciences-National Research Council; available from the Office of Technical Services, Dept. of Commerce, 1960. Nearly all francium salts are ": null
    },
    {
        "water-soluble": "Solubility"
    },
    {
        ".             There are 34 known isotopes of francium ranging in ": null
    },
    {
        "atomic mass": "Atomic Mass"
    },
    {
        " from 199 to 232.  Francium has seven ": null
    },
    {
        "metastable": "Metastability"
    },
    {
        "nuclear isomers": "Nuclear Isomer"
    },
    {
        ". Francium-223 and francium-221 are the only isotopes that occur in nature, though the former is far more common.      Francium-223 is the most stable isotope, with a half-life of 21.8  minutes, and it is highly unlikely that an isotope of francium with a longer half-life will ever be discovered or synthesized. Francium-223 is the fifth product of the ": null
    },
    {
        "actinium": "Actinium"
    },
    {
        " decay series as the daughter isotope of actinium-227.  Francium-223 then decays into radium-223 by ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        " , with a minor ": null
    },
    {
        "alpha decay": "Alpha Decay"
    },
    {
        " path to astatine-219 .      Francium-221 has a half-life of 4.8  minutes. It is the ninth product of the ": null
    },
    {
        "neptunium": "Neptunium"
    },
    {
        " decay series as a daughter isotope of ": null
    },
    {
        "actinium-225": "Actinium-225"
    },
    {
        ". Francium-221 then decays into astatine-217 by alpha decay .     The least stable ": null
    },
    {
        "ground state": "Ground State"
    },
    {
        " isotope is francium-215, with a half-life of 0.12  μs: it undergoes a 9.54  MeV alpha decay to astatine-211. Its ": null
    },
    {
        "metastable isomer": "Metastable Isomer"
    },
    {
        ", francium-215m, is less stable still, with a half-life of only 3.5  ns.        Due to its instability and rarity, there are no commercial applications for francium.    It has been used for research purposes in the fields of ": null
    },
    {
        "chemistry": "Chemistry"
    },
    {
        "    and of ": null
    },
    {
        "atomic structure": "Atom"
    },
    {
        ". Its use as a potential diagnostic aid for various ": null
    },
    {
        "cancers": "Cancer"
    },
    {
        " has also been explored, but this application has been deemed impractical.     Franciums ability to be synthesized, trapped, and cooled, along with its relatively simple ": null
    },
    {
        "atomic structure": "Atom"
    },
    {
        ", has made it the subject of specialized ": null
    },
    {
        "spectroscopy": "Spectroscopy"
    },
    {
        " experiments. These experiments have led to more specific information regarding ": null
    },
    {
        "energy levels": "Energy Level"
    },
    {
        " and the ": null
    },
    {
        "coupling constants": "Coupling Constant"
    },
    {
        " between ": null
    },
    {
        "subatomic particles": "Subatomic Particle"
    },
    {
        ".  Studies on the light emitted by laser-trapped francium-210 ions have provided accurate data on transitions between atomic energy levels which are fairly similar to those predicted by ": null
    },
    {
        "quantum theory": "Quantum Mechanics"
    },
    {
        ".        As early as 1870, chemists thought that there should be an alkali metal beyond ": null
    },
    {
        "caesium": "Caesium"
    },
    {
        ", with an atomic number of 87. It was then referred to by the provisional name  eka-caesium .   Adloff, Jean-Pierre; Kaufman, George B. .   . The Chemical Educator 10 . Retrieved on 2007-03-26.   Research teams attempted to locate and isolate this missing element, and at least four false claims were made that the element had been found before an authentic discovery was made.       Soviet chemist ": null
    },
    {
        "D. K. Dobroserdov": "D. K. Dobroserdov"
    },
    {
        " was the first scientist to claim to have found eka-caesium, or francium. In 1925, he observed weak radioactivity in a sample of ": null
    },
    {
        "potassium": "Potassium"
    },
    {
        ", another alkali metal, and incorrectly concluded that eka-caesium was contaminating the sample .  He then published a thesis on his predictions of the properties of eka-caesium, in which he named the element russium after his home country.  Shortly thereafter, Dobroserdov began to focus on his teaching career at the Polytechnic Institute of ": null
    },
    {
        "Odessa": "Odessa"
    },
    {
        ", and he did not pursue the element further.     The following year, English chemists ": null
    },
    {
        "Gerald J. F. Druce": "Gerald J. F. Druce"
    },
    {
        " and ": null
    },
    {
        "Frederick H. Loring": "Frederick H. Loring"
    },
    {
        " analyzed ": null
    },
    {
        "X-ray": "X-Ray"
    },
    {
        " photographs of ": null
    },
    {
        "manganese sulfate": "Manganese Sulfate"
    },
    {
        ". They observed spectral lines which they presumed to be of eka-caesium. They announced their discovery of element 87 and proposed the name alkalinium, as it would be the heaviest alkali metal.     In 1930, ": null
    },
    {
        "Fred Allison": "Fred Allison"
    },
    {
        " of the ": null
    },
    {
        "Alabama Polytechnic Institute": "Alabama Polytechnic Institute"
    },
    {
        " claimed to have discovered element 87 when analyzing ": null
    },
    {
        "pollucite": "Pollucite"
    },
    {
        " and ": null
    },
    {
        "lepidolite": "Lepidolite"
    },
    {
        " using his ": null
    },
    {
        "magneto-optical": "Magneto-Optic Effect"
    },
    {
        " machine. Allison requested that it be named virginium after his home state of ": null
    },
    {
        "Virginia": "Virginia"
    },
    {
        ", along with the symbols Vi and Vm .  In 1934, H.G. MacPherson of ": null
    },
    {
        "UC Berkeley": "University Of California, Berkeley"
    },
    {
        " disproved the effectiveness of Allisons device and the validity of his discovery.      In 1936, Romanian physicist ": null
    },
    {
        "Horia Hulubei": "Horia Hulubei"
    },
    {
        " and his French colleague ": null
    },
    {
        "Yvette Cauchois": "Yvette Cauchois"
    },
    {
        " also analyzed pollucite, this time using their high-resolution X-ray apparatus. They observed several weak emission lines, which they presumed to be those of element 87. Hulubei and Cauchois reported their discovery and proposed the name moldavium, along with the symbol Ml, after ": null
    },
    {
        "Moldavia": "Moldavia"
    },
    {
        ", the Romanian province where Hulubei was born. In 1937, Hulubeis work was criticized by American physicist ": null
    },
    {
        "F. H. Hirsh Jr.": "F. H. Hirsh Jr."
    },
    {
        ", who rejected Hulubeis research methods. Hirsh was certain that eka-caesium would not be found in nature, and that Hulubei had instead observed ": null
    },
    {
        "mercury": "Mercury"
    },
    {
        " or ": null
    },
    {
        "bismuth": "Bismuth"
    },
    {
        " X-ray lines. Hulubei insisted that his X-ray apparatus and methods were too accurate to make such a mistake. Because of this, ": null
    },
    {
        "Jean Baptiste Perrin": "Jean Baptiste Perrin"
    },
    {
        ", ": null
    },
    {
        "Nobel Prize": "Nobel Prize"
    },
    {
        " winner and Hulubeis mentor, endorsed moldavium as the true eka-caesium over ": null
    },
    {
        "Marguerite Pereys": "Marguerite Perey"
    },
    {
        " recently discovered francium. Perey took pains to be accurate and detailed in her criticism of Hulubeis work, and finally she was credited as the sole discoverer of element 87. All other previous purported discoveries of element 87 were ruled out due to franciums very limited half-life.       Eka-caesium was discovered in on 7 January 1939 by ": null
    },
    {
        "Marguerite Perey": "Marguerite Perey"
    },
    {
        " of the ": null
    },
    {
        "Curie Institute": "Curie Institute"
    },
    {
        " in Paris,  when she purified a sample of ": null
    },
    {
        "actinium": "Actinium"
    },
    {
        "-227 which had been reported to have a decay energy of 220  keV. Perey noticed decay particles with an energy level below 80  keV. Perey thought this decay activity might have been caused by a previously unidentified decay product, one which was separated during purification, but emerged again out of the pure actinium-227. Various tests eliminated the possibility of the unknown element being ": null
    },
    {
        "thorium": "Thorium"
    },
    {
        ", radium, ": null
    },
    {
        "lead": "Lead"
    },
    {
        ", bismuth, or ": null
    },
    {
        "thallium": "Thallium"
    },
    {
        ". The new product exhibited chemical properties of an alkali metal , which led Perey to believe that it was element 87, produced by the ": null
    },
    {
        "alpha decay": "Alpha Decay"
    },
    {
        " of actinium-227. Perey then attempted to determine the proportion of ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        " to alpha decay in actinium-227. Her first test put the alpha branching at 0.6%, a figure which she later revised to 1%.     Perey named the new isotope actinium-K and in 1946, she proposed the name catium for her newly discovered element, as she believed it to be the most ": null
    },
    {
        "electropositive": "Electronegativity"
    },
    {
        " cation": "Cation"
    },
    {
        " of the elements. ": null
    },
    {
        "Irène Joliot-Curie": "Irène Joliot-Curie"
    },
    {
        ", one of Pereys supervisors, opposed the name due to its connotation of cat rather than cation; furthermore, the symbol coincided with that which had since been assigned to ": null
    },
    {
        "curium": "Curium"
    },
    {
        ". Perey then suggested francium, after France. This name was officially adopted by the ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "International Union Of Pure And Applied Chemistry"
    },
    {
        " in 1949, becoming the second element after ": null
    },
    {
        "gallium": "Gallium"
    },
    {
        " to be named after France. It was assigned the symbol Fa, but this abbreviation was revised to the current Fr shortly thereafter.  Francium was the last element discovered in nature, rather than synthesized, following ": null
    },
    {
        "hafnium": "Hafnium"
    },
    {
        " and ": null
    },
    {
        "rhenium": "Rhenium"
    },
    {
        ". Further research into franciums structure was carried out by, among others, ": null
    },
    {
        "Sylvain Lieberman": "Sylvain Lieberman"
    },
    {
        " and his team at ": null
    },
    {
        "CERN": "Cern"
    },
    {
        " in the 1970s and 1980s.           223 Fr is the result of the alpha decay of ": null
    },
    {
        " 227 Ac": "Isotopes Of Actinium"
    },
    {
        " and can be found in trace amounts in ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        "minerals": "Mineral"
    },
    {
        ". In a given sample of uranium, there is estimated to be only one francium atom for every 1 × 10 18 uranium atoms. It is also calculated that there is a total mass of at most 30  g of francium in the ": null
    },
    {
        "Earths crust": "Crust"
    },
    {
        " at any given time.              Francium can be synthesized by a ": null
    },
    {
        "fusion": "Nuclear Fusion"
    },
    {
        " reaction when a gold-197 target is bombarded with a beam of oxygen-18 atoms from a ": null
    },
    {
        "linear accelerator": "Linear Accelerator"
    },
    {
        " in a process originally developed at the physics department of the ": null
    },
    {
        "State University of New York at Stony Brook": "State University Of New York At Stony Brook"
    },
    {
        " in 1995.  Depending on the energy of the oxygen beam, the reaction can yield francium isotopes with masses of 209, 210, and 211.     : 197 Au + 18 O → 209 Fr + 6 n   : 197 Au + 18 O → 210 Fr + 5 n   : 197 Au + 18 O → 211 Fr + 4 n     The francium atoms leave the gold target as ions, which are neutralized by collision with yttrium and then isolated in a ": null
    },
    {
        "magneto-optical trap": "Magneto-Optic Effect"
    },
    {
        " in a gaseous unconsolidated state.  Although the atoms only remain in the trap for about 30 seconds before escaping or undergoing nuclear decay, the process supplies a continual stream of fresh atoms. The result is a ": null
    },
    {
        "steady state": "Steady State"
    },
    {
        " containing a fairly constant number of atoms for a much longer time. The original apparatus could trap up to a few thousand atoms, while a later improved design could trap over 300,000 at a time.  Sensitive measurements of the light emitted and absorbed by the trapped atoms provided the first experimental results on various transitions between atomic energy levels in francium. Initial measurements show very good agreement between experimental values and calculations based on quantum theory. The research project using this production method relocated to ": null
    },
    {
        "TRIUMF": "Triumf"
    },
    {
        " in 2012, where over 10 6 francium atoms have been held at a time, including large amounts of 209 Fr in addition to 207 Fr and 221 Fr.       Other synthesis methods include bombarding radium with neutrons, and bombarding thorium with protons, ": null
    },
    {
        "deuterons": "Deuterium"
    },
    {
        ", or ": null
    },
    {
        "helium": "Helium"
    },
    {
        "ions": "Ion"
    },
    {
        ".      223 Fr can also be isolated from samples of its parent 227 Ac, the francium being milked via elution with NH 4 Cl–CrO 3 from an actinium-containing cation exchanger and purified by passing the solution through a ": null
    },
    {
        "silicon dioxide": "Silicon Dioxide"
    },
    {
        " compound loaded with ": null
    },
    {
        "barium sulfate": "Barium Sulfate"
    },
    {
        ".      In 1996, the Stony Brook group trapped 3000 atoms in their MOT, which was enough for a video camera to capture the light given off by the atoms as they fluoresce. Francium has not been synthesized in amounts large enough to weigh. ": null
    }
]