[
    {
        "     Frederick III was ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        " from 1452 until his death. He was the first emperor of the ": null
    },
    {
        "House of Habsburg": "House Of Habsburg"
    },
    {
        ", and the fourth member of the House of Habsburg to be elected King of Germany after ": null
    },
    {
        "Rudolf I of Germany": "Rudolf I Of Germany"
    },
    {
        ", ": null
    },
    {
        "Albert I": "Albert I Of Germany"
    },
    {
        " in the 13th century and his predecessor ": null
    },
    {
        "Albert II of Germany": "Albert Ii Of Germany"
    },
    {
        ". He was the penultimate emperor to be ": null
    },
    {
        "crowned": "Coronation Of The Holy Roman Emperor"
    },
    {
        " by the ": null
    },
    {
        "Pope": "Pope"
    },
    {
        ", and the last to be crowned in ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ".     Prior to his imperial coronation, he was duke of the ": null
    },
    {
        "Inner Austria": "Inner Austria"
    },
    {
        "n lands of ": null
    },
    {
        "Styria": "Duchy Of Styria"
    },
    {
        ", ": null
    },
    {
        "Carinthia": "Duchy Of Carinthia"
    },
    {
        " and ": null
    },
    {
        "Carniola": "Duchy Of Carniola"
    },
    {
        " from 1424, and also acted as ": null
    },
    {
        "regent": "Regent"
    },
    {
        " over the ": null
    },
    {
        "Duchy of Austria": "Duchy Of Austria"
    },
    {
        "  from 1439. He was ": null
    },
    {
        "elected": "Imperial Election Of 1440"
    },
    {
        " and crowned ": null
    },
    {
        "King of Germany": "List Of German Monarchs"
    },
    {
        "  in 1440. He was the fourth Frederick to rule Germany in the Habsburgs preferred enumeration, which counted ": null
    },
    {
        "Frederick the Fair": "Frederick The Fair"
    },
    {
        " as a legitimate king, although he was elected by only a minority of electors. Cf. Anthony Radcliffe , The Habsburg Images: Cigoli, Terzio and Reichle , The Burlington Magazine, 128 , 103–06. He was the longest-reigning German monarch when in 1493, after ruling his domains for more than 53 years, he was succeeded by his son ": null
    },
    {
        "Maximilian I": "Maximilian I, Holy Roman Emperor"
    },
    {
        ".     During his reign, Frederick concentrated on re-uniting the Habsburg ": null
    },
    {
        "hereditary lands": "Habsburg Monarchy"
    },
    {
        " of Austria and took a lesser interest in ": null
    },
    {
        "Imperial": "Holy Roman Empire"
    },
    {
        " affairs. Nevertheless, by his dynastic entitlement to ": null
    },
    {
        "Hungary": "Kingdom Of Hungary"
    },
    {
        " as well as by the ": null
    },
    {
        "Burgundian": "Duchy Of Burgundy"
    },
    {
        " inheritance, he laid the foundations for the later Habsburg Empire. Mocked as Arch-Sleepyhead of the Holy Roman Empire  during his lifetime,  he is today increasingly seen as an effective ruler.       Born at the ": null
    },
    {
        "Tyrolean": "County Of Tyrol"
    },
    {
        " residence of ": null
    },
    {
        "Innsbruck": "Innsbruck"
    },
    {
        " in 1415, Frederick was the eldest son of the Inner Austrian duke ": null
    },
    {
        "Ernest the Iron": "Ernest, Duke Of Austria"
    },
    {
        ", a member of the ": null
    },
    {
        "Leopoldian line": "Leopoldian Line"
    },
    {
        " of the Habsburg dynasty, and his second wife ": null
    },
    {
        "Cymburgis of Masovia": "Cymburgis Of Masovia"
    },
    {
        ". According to the 1379 ": null
    },
    {
        "Treaty of Neuberg": "Treaty Of Neuberg"
    },
    {
        ", the Leopoldinian branch ruled over the duchies of Styria, Carinthia and Carniola, or what was referred to as Inner Austria. Only three of Fredericks eight siblings survived childhood: his younger brother ": null
    },
    {
        "Albert": "Albert Vi, Archduke Of Austria"
    },
    {
        " , and his sisters ": null
    },
    {
        "Margaret": "Margaret Of Austria, Electress Of Saxony"
    },
    {
        " and ": null
    },
    {
        "Catherine": "Catherine Of Austria"
    },
    {
        ". In 1424, nine-year-old Fredericks father died, making Frederick the duke of Inner Austria, as Frederick V, with his uncle, Duke ": null
    },
    {
        "Frederick IV of Tyrol": "Frederick Iv, Duke Of Austria"
    },
    {
        ", acting as regent.     From 1431, Frederick tried to obtain majority but for several years was denied by his relatives. Finally, in 1435, ": null
    },
    {
        "Albert V, duke of Austria": "Albert Ii Of Germany"
    },
    {
        " , awarded him the rule over his Inner Austrian heritage. Almost from the beginning, Fredericks younger brother Albert asserted his rights as a co-ruler, as the beginning of a long rivalry. Already in these years, Frederick had begun to use the symbolic ": null
    },
    {
        "A.E.I.O.U.": "A.E.I.O.U."
    },
    {
        " signature as a kind of ": null
    },
    {
        "motto": "Motto"
    },
    {
        " with various meanings. In 1436 he made a pilgrimage to the ": null
    },
    {
        "Holy Land": "Holy Land"
    },
    {
        ", accompanied by numerous nobles knighted by the ": null
    },
    {
        "Order of the Holy Sepulchre": "Order Of The Holy Sepulchre"
    },
    {
        ", which earned him great reputation.     Upon the death of his uncle Duke Frederick IV in 1439, Frederick took over the regency of Tyrol and ": null
    },
    {
        "Further Austria": "Further Austria"
    },
    {
        " for the dukes heir ": null
    },
    {
        "Sigismund": "Sigismund, Archduke Of Austria"
    },
    {
        ". Again he had to ward off the claims raised by his brother Albert VI; he prevailed by the support of the Tyrolean aristocracy. Likewise he acted as regent for his nephew ": null
    },
    {
        "Ladislaus the Posthumous": "Ladislaus The Posthumous"
    },
    {
        ", son of late King Albert II and his consort ": null
    },
    {
        "Elizabeth of Luxembourg": "Elizabeth Of Luxembourg"
    },
    {
        ", in the ": null
    },
    {
        "duchy of Austria": "Duchy Of Austria"
    },
    {
        " . . Frederick was now the undisputed head of the Habsburg dynasty, though his regency in the lands of the ": null
    },
    {
        "Albertinian Line": "Albertinian Line"
    },
    {
        " was still viewed with suspicion.     As a cousin of late King Albert II, Frederick became a candidate for the imperial election. On 2 February 1440, the ": null
    },
    {
        "prince-electors": "Prince-Electors"
    },
    {
        " convened at ": null
    },
    {
        "Frankfurt": "Frankfurt"
    },
    {
        " and unanimously elected him ": null
    },
    {
        "King of the Romans": "King Of The Romans"
    },
    {
        " as Frederick IV; his rule was still based on his hereditary lands of Styria, Carinthia and Carniola, or Inner Austria.     In 1442, Frederick allied himself with ": null
    },
    {
        "Rudolf Stüssi": "Rudolf Stüssi"
    },
    {
        ", ": null
    },
    {
        "burgomaster": "Burgomaster"
    },
    {
        " of ": null
    },
    {
        "Zurich": "Zurich"
    },
    {
        ", against the ": null
    },
    {
        "Old Swiss Confederacy": "Old Swiss Confederacy"
    },
    {
        " in the ": null
    },
    {
        "Old Zurich War": "Old Zurich War"
    },
    {
        " but lost. In 1448, he entered into the ": null
    },
    {
        "Concordat of Vienna": "Concordat Of Vienna"
    },
    {
        " with the ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        ", which remained in force until 1806 and regulated the relationship between the Habsburgs and the Holy See.     In 1452, at the age of 37, Frederick III travelled to Italy to receive his bride and to be crowned ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        ". His fiancée, the 18-year-old infanta ": null
    },
    {
        "Eleanor": "Eleanor Of Portugal, Holy Roman Empress"
    },
    {
        ", daughter of King ": null
    },
    {
        "Edward of Portugal": "Edward Of Portugal"
    },
    {
        ", landed at ": null
    },
    {
        "Livorno": "Livorno"
    },
    {
        " after a 104-day trip. Her dowry would help Frederick alleviate his debts and cement his power. The couple met at ": null
    },
    {
        "Siena": "Siena"
    },
    {
        " on 24 February and proceeded together to Rome. As per tradition, they spent a night outside the walls of Rome before entering the city on 9 March, where Frederick and ": null
    },
    {
        "Pope Nicholas V": "Pope Nicholas V"
    },
    {
        " exchanged friendly greetings. Because the emperor had been unable to retrieve the ": null
    },
    {
        "Iron Crown of Lombardy": "Iron Crown Of Lombardy"
    },
    {
        " from the ": null
    },
    {
        "cathedral of Monza": "Cathedral Of Monza"
    },
    {
        " where it was kept, nor be crowned ": null
    },
    {
        "King of Italy": "Kingdom Of Italy"
    },
    {
        " by the ": null
    },
    {
        "archbishop of Milan": "Archbishop Of Milan"
    },
    {
        " , he convinced the pope to crown him as such with the German crown, which had been brought for the purpose. This coronation took place on the morning of 16 March, in spite of the protests of the Milanese ambassadors, and in the afternoon Frederick and Eleanor were married by the pope. Finally, on 19 March, Frederick and Eleanor were anointed in ": null
    },
    {
        "St Peters Basilica": "St Peters Basilica"
    },
    {
        " by the Vice-Chancellor of the Holy Roman Church, Cardinal ": null
    },
    {
        "Francesco Condulmer": "Francesco Condulmer"
    },
    {
        ", and Frederick was then crowned with the ": null
    },
    {
        "Imperial Crown": "Imperial Crown Of The Holy Roman Empire"
    },
    {
        " by the pope. M. Creighton, A History of the Papacy During the Period of the Reformation, Volume II: The Council of Basel to the Papal Restoration, 1418–1464 , pp. 297–99. Frederick was the last Emperor to be crowned in Rome; his great-grandson Charles V was the last emperor to be crowned, but this was done in ": null
    },
    {
        "Bologna": "Bologna"
    },
    {
        ".            Fredericks style of rulership was marked by hesitation and a sluggish pace of decision making. The Italian humanist Enea Silvio Piccolomini, later ": null
    },
    {
        "Pope Pius II": "Pope Pius Ii"
    },
    {
        ", who at one time worked at Fredericks court, described the Emperor as a person who wanted to conquer the world while remaining seated. Although this was regarded as a character flaw in older academic research, his delaying tactics are now viewed as a means of coping with political challenges in far-flung territorial possessions. Frederick is credited with having the ability to sit out difficult political situations patiently. Heinz-Dieter Heimann: Die Habsburger. Dynastie und Kaiserreiche. . pp.38-45     According to contemporary accounts, Frederick had difficulties developing emotional closeness to other persons, including his children and wife Eleanor . In general, Frederick kept himself away from women, the reasons for which are not known. As Frederick was rather distant to his family, Eleanor had a great influence on the raising and education of Fredericks children, and she therefore played an important role in the House of Habsburgs rise to prominence. Despite the fact that their marriage had been unhappy, when Eleanor died the Emperor was affected by her loss and remained widowed for the rest of his long life.         thu introduces Eleonora of Portugal to Frederick III by Pinturicchio     Fredericks political initiatives were hardly bold, but they were still successful. His first major opponent was his brother Albert VI , who challenged his rule. He did not manage to win a single conflict on the battlefield against him, and thus resorted to more subtle means. He held his second cousin once removed Ladislaus the Posthumous , the ruler of the Archduchy of Austria , Hungary and Bohemia, as a prisoner and attempted to extend his guardianship over him in perpetuity to maintain his control over Lower Austria . Ladislaus was freed in 1452 by the Lower Austrian estates. He acted similarly towards his first cousin Sigismund of the Tyrolian line of the Habsburg family. Despite those efforts, he failed to gain control over Hungary and Bohemia in the Bohemian–Hungarian War and was even defeated in the Austrian–Hungarian War by the Hungarian King Matthias Corvinus in 1485, who managed to maintain residence in Vienna until his death five years later in the Siege of Vienna .     Ultimately, Frederick prevailed in all those conflicts by outliving his opponents and sometimes inheriting their lands, as was the case with Ladislaus, from whom he gained Lower Austria in 1457, and with his brother Albert VI, whom he succeeded in Upper Austria . In 1462, his brother Albert raised an insurrection against him in Vienna and the emperor was besieged in his residence by rebellious subjects. In this war between the brothers, Frederick received support from the King of Bohemia, George of Poděbrady . These conflicts forced him into an anachronistic itinerant existence, as he had to move his court between various places through the years, residing in Graz , Linz and . Joachim Laczny:  Historical Geographic Information System . Joachim Laczny, Jürgen Sarnowsky eds., In: Perzeption und Rezeption. Wahrnehmung und Deutung im Mittelalter und in der Moderne, Göttingen 2014, , pp. 33–65.   owes him its castle and the New Monastery .     thu     Still, in some ways his policies were astonishingly successful. In the Siege of Neuss , he forced Charles the Bold of Burgundy to give up his daughter Mary of Burgundy as wife to Fredericks son Maximilian . With the inheritance of Burgundy, the House of Habsburg began to rise to predominance in Europe. This gave rise to the saying Let others wage wars, but you, happy Austria, shall marry , which became a motto of the dynasty.     Frederick secured in 1486 the succession of the son in his own lifetime. On 16 February 1486 Maximilian was unanimously elected Roman-German king at the Frankfurt Reichstag by the six electors present. The Elector of Bohemia was not invited because the Bohemian spa law might have been claimed by the Hungarian King Corvinus. The choice of Maximilian violated the rules of the Golden Bull. Protests against the irregular election remained in the kingdom but out. Fearing that the Electors would take advantage of his sons political inexperience, Friedrich Maximilian did not equip him with government powers. On the occasion of the election of Maximilian, a ten-year land peace was decided. In order to safeguard the peace of the land and against the expansive territorial policy of the Wittelsbachs, numerous affected empire-related states of Swabia joined in 1488 on Fredericks initiative for the Swabian League. After the royal election Frederick accompanied his son to Aachen, where Maximilian was crowned on 9 April 1486.     The marriage of his daughter Kunigunde to Albert IV, Duke of Bavaria , was another result of intrigues and deception, but must be counted as a defeat for Frederick. Albert illegally took control of some imperial fief s and then asked to marry Kunigunde , offering to give her the fiefs as a dower . Frederick agreed at first, but after Albert took over yet another fief, Regensburg , Frederick withdrew his consent. On 2 January 1487, however, before Fredericks change of heart could be communicated to his daughter, Kunigunde married Albert. A war was prevented only through the mediation of the Emperors son, Maximilian.     In some smaller matters, Frederick was quite successful: in 1469 he managed to establish bishopric s in Vienna and , a step that no previous Duke of Austria had been able to achieve.     thu   Fredericks personal motto was the mysterious string A.E.I.O.U. , which he imprinted on all his belongings. He never explained its meaning, leading to many different interpretations being presented, although it has been claimed that shortly before his death he said it stands for  or  . It may well symbolise his own understanding of the historical importance and meaning of his rule and of the early gaining of the Imperial title.       thu     Frederick had five children from his marriage with Eleanor of Portugal :   Christoph   Maximilian , Holy Roman Emperor, married   1477 Mary of Burgundy , daughter of Duke of Burgundy Charles the Bold   1494 Bianca Maria Sforza , daughter of Duke of Milan Galeazzo Maria Sforza   Helene   Kunigunde , married 1487 Albert IV, Duke of Bavaria   Johannes   For the last 10 years of Fredericks life, he and Maximilian ruled jointly.       thu   In his last years Friedrich remained in the region on the Danube, in Vienna and in Linz. In 1492 he was elected Knight of the Order of the Golden Fleece. Since February 1493, Fredericks health deteriorated increasingly. In the Lent of 1493, Friedrichs personal physicians diagnosed Kaiser in the left leg as a symptom, usually referred to as age-burning, in the research literature, which according to current medical terminology is considered to be the result of arteriosclerosis. On 8 June 1493 he was amputated under the direction of the surgeon Hans Seyff in the Linz castle of the affected area of the leg. This leg amputation is considered one of the most famous and best-documented surgical procedures of the entire Middle Ages. Although Frederick initially survived the procedure well, he died on 19 August 1493 in Linz at the age of 77. The contemporaries cited as the cause of death the consequences of leg amputation, senility or rapid diarrhea caused by melon consumption. His bowels were probably buried separately on 24 August 1493 in the Linz parish church. The arrival of Turks in Carinthia and the Krain delayed the arrival of Maximilian and with it the funeral service. On 6 and 7 December 1493, the funeral took place in St. Stephens Cathedral.     His grave, built by Nikolaus Gerhaert von Leyden , in St. Stephens Cathedral, Vienna , is one of the most important works of sculptural art of the late Middle Ages. The heavily adorned tomb was not completed until 1513, two decades after Fredericks death, and has survived in its original condition. Rudolf J. Meyer: Königs- und Kaiserbegräbnisse im Spätmittelalter. Von Rudolf von Habsburg bis zu Friedrich III. Köln 2000, pp. 186–188.                               Heinig, Paul-Joachim. The Court of Emperor Frederick III . In Princes Patronage and the Nobility: The Court at the Beginning of the Modern Age, cc. 1450-1650. Edited by Ronald G. Asch and ": null
    },
    {
        "Adolf M. Birke": "Adolf M. Birke"
    },
    {
        ". New York: Oxford University Press, 1991. .   Langmaier, Konstantin M. Erzherzog Albrecht VI. von Österreich , Ein Fürst im Spannungsfeld von Dynastie, Regionen und Reich       ": null
    }
]