[
    {
        "        Frontline is an Australian comedy television series which satirised Australian television ": null
    },
    {
        "current affairs": "Current Affairs"
    },
    {
        " programmes and reporting. It ran for three series of 13 half-hour episodes and was broadcast on ": null
    },
    {
        "ABC TV": "Abc Television"
    },
    {
        " in 1994, 1995 and 1997.          The series was written, directed and produced by ": null
    },
    {
        "Jane Kennedy": "Jane Kennedy"
    },
    {
        ", ": null
    },
    {
        "Santo Cilauro": "Santo Cilauro"
    },
    {
        ", ": null
    },
    {
        "Rob Sitch": "Rob Sitch"
    },
    {
        " and ": null
    },
    {
        "Tom Gleisner": "Tom Gleisner"
    },
    {
        ". They created and performed in the television shows  The D-Generation  and  The Late Show  before creating Frontline . After Frontline they moved into feature films, making several popular Australian movies including  The Castle  and  The Dish , and hosted  The Panel  for several years, before moving on to  Thank God Youre Here  and later  Have You Been Paying Attention? .     The series was partly inspired by a  60 Minutes  special Has the media gone too far? . It bears some similarity to the UK series  Drop the Dead Donkey .           The series follows the fortunes of a fictional current affairs show, Frontline. In the show, Frontline competes directly with ": null
    },
    {
        "Nines": "Nine Network"
    },
    {
        "  A Current Affair  and ": null
    },
    {
        "Sevens": "Seven Network"
    },
    {
        "  Real Life , which changed its name to  Today Tonight  from 1995 onwards.     The Frontline office showcases and satirises the machinations of the ruthless producers, the self-obsessed airhead host, and the ambitious, cynical reporters, all of whom resort to any sort of underhanded trick to get ratings and maintain their status—including the use of hidden cameras, ": null
    },
    {
        "foot-in-the-door": "Foot-In-The-Door"
    },
    {
        ", bullying interview techniques, and ": null
    },
    {
        "chequebook journalism": "Chequebook Journalism"
    },
    {
        ". They ingratiate themselves with the all-powerful network bosses, while the real work is in fact done by their long-suffering production staff.     The station itself also runs other television shows referenced by Frontline staff, such as 6 oclock news program, a 3-hour news review show Sunday Forum, a ": null
    },
    {
        "sketch": "Sketch Comedy"
    },
    {
        " show The Komedy Bunch, a game show Jackpot, a teen soap opera Sunshine Cove which later changed to Rainbow Island, also lesser mentioned shows such as the football show Ball-to-Ball, Late-Night OZ, Cartoon Crazies,The Morning Show, Face the Press and Vacation.       The characters and situations were often thinly-disguised parodies of recent real events and real people, giving the shows comedy a black edge. Episodes such as The Siege were replays of controversial events which often had occurred just a few months earlier, told as though Frontline itself had covered the story.      The dim-witted, egotistical host Mike Moore was a parody of current television hosts and journalists. Sitch has claimed that none of the characters were directly based on a single person, and indeed the character of Moore was a combination of well-known characteristics of a number of high-profile television figures, including A Current Affair host ": null
    },
    {
        "Ray Martin": "Ray Martin"
    },
    {
        ", Martins predecessor ": null
    },
    {
        "Mike Willesee": "Mike Willesee"
    },
    {
        ",  and Real Life host ": null
    },
    {
        "Stan Grant": "Stan Grant"
    },
    {
        ".     The ABCs media review show  Media Watch  was featured prominently. Much of the real life journalistic misconduct reported on Media Watch later appeared on Frontline in fictionalised form. One example of this was when Media Watch reported that ": null
    },
    {
        "Dave Sluggo Richardson": "David Richardson In Barcelona Tonight"
    },
    {
        " had made a highly misleading report on ": null
    },
    {
        "Christopher Skase": "Christopher Skase"
    },
    {
        " for Today Tonight. Richardson was suspended from duty for a month, and in the One Rule for One episode of Frontline, fictional reporter Martin di Stasio is suspended for a month for doing exactly the same thing. A video of Media Watchs original report about Richardsons Skase story. Retrieved from .     Multiple episodes of Frontline featured Media Watch segments criticising the show.           Mike Moore  is the anchor of Frontline. He is self-centred and dim-witted, but his intentions are generally noble. Mike is very protective of what he calls his journalistic integrity and resents any insinuation that he is a lightweight. He believes that he is on the cutting edge of journalism, but is oblivious to most of Frontlines content, as the executive producers go to some length to keep him out of production meetings, and a running gag within the show sees Mike ignore most of the stories that Frontline airs despite his position as host. Mike is desperate for any sort of publicity he can get, but his public appearances are a constant source of amusement for the rest of the Frontline team, as they typically end in disaster. While usually harmless, Mike is not above using underhanded tactics to get his way—in A Hole in the Heart , he steals a story from Marty because viewers are responding positively to it, while in ": null
    },
    {
        "Addicted to Fame": "Addicted To Fame"
    },
    {
        " , he demands that Geoffreys television show be cancelled because he is jealous of the attention his friend is getting. In the first two series Mikes position is constantly under threat from senior reporter Brooke Vandenberg, who has a better press profile, but by the last series he has been cemented as one of the networks most valuable stars and considerably more effort is made to pander to his whims. While Mike is usually portrayed as simply dumb  he occasionally surprises his colleagues with his sneakiness: in Give em Enough Rope he traps the network owner into admitting to contravening the Broadcasting Act in a live interview, after first getting the owner to publicly commit to allowing him to ask difficult questions without threat to his job. Many gags centre around how easily he is manipulated by his executive producer, the most typical case being when Mike refuses to present a story and then is convinced to run it by an appeal to his supposed fearlessness or journalistic integrity.   Brooke Vandenberg  is a reporter on Frontline. She is ambitious, amoral and publicity hungry. While there are constant rumours that she has affairs with male celebrities in order to build her profile, in some cases she simply creates the rumours herself; in The Desert Angel she confesses to ": null
    },
    {
        "Pat Cash": "Pat Cash"
    },
    {
        " that she started a rumour about having an affair with him. Like most of the employees of Frontline, she has no ethical problems with any action the show takes to get a good story. She is, however, portrayed as being very hypocritical; in The Invisible Man , she has no issues with violating peoples privacy when she runs a story using a hidden camera to catch shoplifters in a store change room, but is outraged when a rival network violates her own privacy in the same way when broadcasting a similar story. Brooke is also very vain, and tends to edit her stories to give herself as much screen time as she can manage. When a new segment producer edits footage of Brooke out of a story in I Disease , she becomes upset to the point where she demands that the producer be fired for it. In A Hole in the Heart , Brooke discovers she is pregnant to a former boyfriend and is bribed into having an abortion by a new hosting offer.   Martin Marty Di Stasio  is a senior reporter on Frontline. He is Mikes major antagonist on the team, often baiting him about sensitive topics, such as the supposedly ": null
    },
    {
        "anti-Semitic": "Anti-Semitic"
    },
    {
        " golf club of which Mike is a member , or whenever Mikes public appearances end in disaster. He is the most experienced journalist on the team: a few references are made to him winning a ": null
    },
    {
        "Walkley Award": "Walkley Award"
    },
    {
        ". Like Brooke, he is uncritical of the shows journalistic tactics ; in fact he is usually the confidante of the executive producers, and the one they can trust to do what is needed to get a good story, or to persuade Mike to present a story. His position on Frontline is more tenuous than that of Mike or Brooke: in Dick on the Line he tells Mike and Brooke that at his age he signs his yearly contract immediately and does not mess about negotiating.       Emma Ward  is the Line Producer on Frontline. She questions the shows practices most frequently and acts as the viewers conscience. In Heroes and Villains , she is the only member of the team to have read the supposedly racist book the show is attacking and objects to their incendiary treatment of its author. Early in series 2 and 3, the executive producers of the time approach Marty and ask him to explain Emma. Marty explains that while she has moral qualms like Mike does, she is more difficult to handle because she is intelligent. Despite often objecting, Emma is usually party to ethically questionable practices and occasionally finds them amusing. In A Hole in the Heart , to placate a director from charity organisation Rotary, she allows the executive producer to yell at her and pretend to fire her over one of the shows decisions, when in reality she is receiving a large pay rise in return for her part of the act.   Kate Preston  is the segment producer. While Kate is friendly with Emma, who has a more senior position, Kate has fewer ethical qualms about stories than Emma, and tends to be in the middle of conflicts between Emma and the executive producer.   Brian Thommo Thompson  is the executive producer during series 1. He is fired by the network in the first episode of series 2, although he is never shown on screen in that episode; the real reason for this is that Lawrence died of lung cancer between the filming of series 1 and series 2, forcing the writers to create a new executive producer character, Sam .   Sam Murphy  is the executive producer during series 2, hired immediately after Brian is fired. Thommos and Sams characters are similar; a hard-nosed EP who would not hesitate to air questionable stories to attract ratings.   Graham Prowsey Prowse  is the executive producer during series 3, hired after the producer who took Frontline to the top retires. Prowsey is much more aggressive and unpleasant than his two predecessors. He has a bad temper, is unpleasant to the staff and is unashamedly ": null
    },
    {
        "sexist": "Sexist"
    },
    {
        "bulimia": "Bulimia"
    },
    {
        " as a chick thing and writing off Brookes bad moods as ": null
    },
    {
        "PMS": "Premenstrual Syndrome"
    },
    {
        ". He is, however, like his predecessors, capable of being charming when needed to deceive Mike, placate Emma or feed Brookes ego.       Domenica Baroni  is the office receptionist, and the only person in the office who truly admires Mike. Her increasingly bizarre hairstyles become a running gag, culminating in Give em Enough Rope , when she is completely bald and festooned with ribbons. Her reactions to the show usually reflect the target audiences responses. She is a reluctant and sometimes traitorous party to the offices determination to keep Mike away from production meetings. She is always very supportive of Mike and there are often hints that she actually has a crush on him. Domenica occasionally contributes to stories run by the show, such as when she receives a tipoff from a relative in Divide the Community, Multiply the Ratings or when she is the only female staff member willing to go undercover in a nightclub in My Generation .   Shelley Cohen  is the executive producers secretary. She has worked for the network for many years and is usually unfazed by the mishaps in the office.   Stuart Stu OHallaran  is the offices main cameraman and shoots most of Brookes and Martys stories. He, Marty and Jase are all friends and frequently make fun of Mike.   Jason Jase Cotter  is the sound recorder who works with Stu. Jase is not actually heard speaking until series 3 despite appearing in most episodes in series 1 and 2. He is fired in the episode I Get the Big Names for audio taping Brooke Vandanberg while she urinates on the toilet and then leaking it to the media.   Hugh Tabbagh  is the editor of videos, who is almost always seen editing in the audio-visual room whilst sitting, smoking cigarettes, coughing wildly and inhaling an asthma puffer.   Trev  appears as Jases replacement as the sound recorder towards the end of the third series.       Geoffrey Salter  is the networks weatherman and Mikes closest friend at work. Geoff usually appears in private conversations in his office with Mike, and is often the catalyst for Mike to question the reassurance he has been given by a producer that the story of the moment is being ethically pursued. Despite his being Mikes closest friend, Mike frequently ignores Geoffs issues, and their conversations often serve to reinforce Mikes beliefs. Geoff is unpopular with the rest of the Frontline staff to the point where he is banned from the Frontline set, but they are all supportive when he unexpectedly achieves popularity with his own one-hour programme in Addicted to Fame , though he is unaware that Mike demanded the plans for the expansion of the show be cancelled because he was jealous of the attention Geoff was getting. He is the focus of a running gag where he will laugh hysterically along with Mike at any anecdote Mike tells him, before admitting that he does not understand it.   Ian Farmer  is the Station Manager, the boss of the local studios. He appears only in series one. He and Brian Thompson are good friends, and frequently play golf together.   Bob Caville  is the networks managing director, and definitively pulls the office into line.   Jan Whelan  is the networks head of publicity in series 1 and 2. Jan refers to everyone as poppet and darling and has extravagantly ": null
    },
    {
        "camp": "Camp"
    },
    {
        " mannerisms, but is in fact practical and efficient.   Trish  is the networks head of publicity in series 3. Gibson also appears in Workin Class Man from series 2 as the wife/mother of three of a working class family who is visited by Brooke for a story regarding the difficulties of making ends meet.   Elliot Rhodes  is a comedian and musician, performing short musical sketches about current events at the end of Friday night episodes of Frontline. Mike detests his act but is required to laugh uproariously and compliment it on air every week. In two episodes, he was fired at Mikes request.       Frontline frequently featured celebrity cameos, unusually including major Australian politicians appearing as themselves, often but not always as interviewees. The most memorable appearance is that of ": null
    },
    {
        "Pauline Hanson": "Pauline Hanson"
    },
    {
        " in The Shadow We Cast , in which she turns her famous please explain? phrase on Mike. ": null
    },
    {
        "Noel Pearson": "Noel Pearson"
    },
    {
        " appears as an interviewee later in the same episode. Other appearances include: ": null
    },
    {
        "John Hewson": "John Hewson"
    },
    {
        " in The Soufflé Rises ; ": null
    },
    {
        "Pat Cash": "Pat Cash"
    },
    {
        " in The Desert Angel ; ": null
    },
    {
        "Cheryl Kernot": "Cheryl Kernot"
    },
    {
        " in We Aint Got Dames ; ": null
    },
    {
        "Ben Elton": "Ben Elton"
    },
    {
        ", ": null
    },
    {
        "Bert Newton": "Bert Newton"
    },
    {
        ", ": null
    },
    {
        "Rosemary Margan": "Rosemary Margan"
    },
    {
        ", ": null
    },
    {
        "Amanda Keller": "Amanda Keller"
    },
    {
        " and ": null
    },
    {
        "Anne Fulwood": "Anne Fulwood"
    },
    {
        " in This Night of Nights ; ": null
    },
    {
        "Glenn Ridge": "Glenn Ridge"
    },
    {
        " in Add Sex and Stir and Office Mole ; ": null
    },
    {
        "Glenn Robbins": "Glenn Robbins"
    },
    {
        " and ": null
    },
    {
        "Molly Meldrum": "Molly Meldrum"
    },
    {
        " in Add Sex and Stir ; ": null
    },
    {
        "George Negus": "George Negus"
    },
    {
        " in Add Sex and Stir and Dick on the Line ; and ": null
    },
    {
        "Ian Baker-Finch": "Ian Baker-Finch"
    },
    {
        " in A Hole in the Heart . ": null
    },
    {
        "Harry Shearer": "Harry Shearer"
    },
    {
        " appeared in the series 2 episode Changing the Face of Current Affairs , where he played the character of Larry Hadges. ": null
    },
    {
        "Merv Hughes": "Merv Hughes"
    },
    {
        " also starred in the series 2 episode Workin Class Man .     Other guest stars appeared in mock-ups of their own shows: Mike Moore appeared on fictitious episodes of  Burkes Backyard  with ": null
    },
    {
        "Don Burke": "Don Burke"
    },
    {
        ", ": null
    },
    {
        "Rex Hunts": "Rex Hunt"
    },
    {
        "fishing show, and  The AFL Footy Show  with ": null
    },
    {
        "Sam Newman": "Sam Newman"
    },
    {
        ". ": null
    },
    {
        "Stuart Littlemore": "Stuart Littlemore"
    },
    {
        ", who at the time was hosting the media commentary show  Media Watch , appeared in several fictitious episodes as a critic of Frontline.         Frontline broke new ground for Australian situation comedy, by adopting some innovative production strategies. Its rapid production schedule was inspired by UK series  Drop the Dead Donkey , where each episode was written and taped in a single week and scripts were closely based on the real news stories of the preceding seven days.     The Frontline scripts were likewise written and the series filmed with a short period, often within a single week. It was a fully collaborative effort, with Cilauro, Kennedy, Gleisner and Sitch all sharing writing and directing duties, and the cast all contributing ideas during all stages of production. So sometimes when the show appeared on then-current events, it was a coincidence, as episodes were delayed by several months. In other cases there was direct commentary on real events, albeit not extremely recent ones.     To create a heightened illusion of grainy documentary realism, footage was shot under ": null
    },
    {
        "fluorescent lights": "Fluorescent Light"
    },
    {
        "in an actual office building set, and taped on hand-held ": null
    },
    {
        "Hi-8": "Hi-8"
    },
    {
        "camcorders": "Camcorder"
    },
    {
        "usually operated by Gleisner and Cilauro. The footage was then transferred onto film and finally transferred back to videotape The process used is described by Lawrie Zion in the front piece of Cilauro et al. . Footage that was portrayed as being part of the Frontline broadcast was shot at broadcast quality, to increase the realism of the satire and complement the behind-the-scenes footage.         In 1997, Channel Seven bought the rights to the series;  ": null
    },
    {
        "Usenet": "Usenet"
    },
    {
        " newsgroup aus.tv, 12 August 1997 however, they only aired a handful of episodes. The show was perceived by management as too close to the bone for a network significantly focused upon its prime-time current affairs ratings battle with rival stations. ": null
    },
    {
        "The Comedy Channel": "The Comedy Channel"
    },
    {
        " has shown the series as late as 2005.     In America, Frontline was shown as either Behind the Frontline on cable or as Breaking News on PBS .     In the UK, series 1 and 2 were shown by the Paramount Comedy Channel. Series 3, however, was never screened.     In Canada, it was aired as Behind the Frontline on Showcase in 1997.         The series was extremely popular through its run, winning a ": null
    },
    {
        "Logie Award": "Logie Award"
    },
    {
        " for Most Outstanding Achievement in Comedy in 1995, and a Logie for ": null
    },
    {
        "Alison Whyte": "Alison Whyte"
    },
    {
        " as most outstanding actress in 1997. A  Sydney Morning Herald  industry poll rated it No. 2 in the 25 all-time greatest Australian TV shows.     Six episodes from series one were a core text in the Year 12 English Advanced syllabus for the ": null
    },
    {
        "Higher School Certificate": "Higher School Certificate"
    },
    {
        " in ": null
    },
    {
        "New South Wales": "New South Wales"
    },
    {
        " for Module C: Representation and Text: Elective 1: Telling the Truth. The episodes are Playing the Ego Card , Add Sex and Stir , The Siege , Smaller Fish to Fry , We Aint Got Dames , and This Night of Nights . The show has also been used as a text response for both Years 11 and 12 in the English units of the ": null
    },
    {
        "Victorian Certificate of Education": "Victorian Certificate Of Education"
    },
    {
        ". Episodes of Frontline have been analysed for the Media topic in the Year 10 English syllabus in New South Wales since at least 2001 and in ": null
    },
    {
        "Western Australia": "Western Australia"
    },
    {
        " since at least 2009.         Sitch reprised the role of Mike Moore and Frontline during a short sketch on the Friday Night Crack Up in October 2014 as part of the ABCs MentalAs campaign to raise money and awareness for mental health issues.       ": null
    }
]