[
    {
        "              A furlong is a measure of ": null
    },
    {
        "distance": "Distance"
    },
    {
        " in ": null
    },
    {
        "imperial units": "Imperial Units"
    },
    {
        " and ": null
    },
    {
        "U.S. customary units": "U.S. Customary Units"
    },
    {
        " equal to one eighth of a ": null
    },
    {
        "mile": "Mile"
    },
    {
        ", equivalent to 660 ": null
    },
    {
        "feet": "Foot"
    },
    {
        ", 220 ": null
    },
    {
        "yards": "Yard"
    },
    {
        ", 40 ": null
    },
    {
        "rods": "Rod"
    },
    {
        ", or 10 ": null
    },
    {
        "chains": "Chain"
    },
    {
        ".     Using the international definition of the ": null
    },
    {
        "inch": "Inch"
    },
    {
        " as exactly 25.4 ": null
    },
    {
        "millimetres": "Millimetre"
    },
    {
        ", one furlong is 201.168 ": null
    },
    {
        "metres": "Metre"
    },
    {
        ". However, the ": null
    },
    {
        "United States": "United States"
    },
    {
        " does not uniformly use this conversion ratio. Older ratios are in use for surveying purposes in some states, leading to variations in the length of the furlong of two parts per million, or about 0.4 millimetre . This variation is too small to have practical consequences in most applications. Five furlongs are about 1 ": null
    },
    {
        "kilometre": "Kilometre"
    },
    {
        " .       The name furlong derives from the ": null
    },
    {
        "Old English": "Old English Language"
    },
    {
        " words  and  .  Dating back at least to early ": null
    },
    {
        "Anglo-Saxon": "Anglo-Saxon"
    },
    {
        " times, it originally referred to the length of the furrow in one ": null
    },
    {
        "acre": "Acre"
    },
    {
        " of a ploughed ": null
    },
    {
        "open field": "Open-Field System"
    },
    {
        " . The furlong was the distance a team of oxen could plough without resting. This was standardised to be exactly 40 rods or 10 chains. The system of long furrows arose because turning a team of oxen pulling a heavy plough was difficult. This offset the drainage advantages of short furrows and meant furrows were made as long as possible. An acre is an area that is one furlong long and one ": null
    },
    {
        "chain": "Chain"
    },
    {
        " wide. For this reason, the furlong was once also called an acres length,   though in modern usage an area of one acre can be of any shape. The term furlong, or shot, was also used to describe a grouping of adjacent strips within an open field.      Among the early Anglo-Saxons, the rod was the fundamental unit of land measurement. A furlong was 40 rods; an acre 4 by 40 rods, or 4 rods by 1 furlong, and thus 160 square rods. At the time, the Saxons used the North German foot, which was 10 percent longer than the foot of today. When England changed to the shorter foot in the late 13th century, rods and furlongs remained unchanged, since property boundaries were already defined in rods and furlongs. The only thing that changed was the number of feet and yards in a rod or a furlong, and the number of square feet and square yards in an acre. The definition of the rod went from 15 old feet to  new feet, or from 5 old yards to  new yards. The furlong went from 600 old feet to 660 new feet, or from 200 old yards to 220 new yards. The acre went from 36,000 old square feet to 43,560 new square feet, or from 4,000 old square yards to 4,840 new square yards.      The furlong was historically viewed as being equivalent to the ": null
    },
    {
        "Roman stade ": "Ancient Roman Units Of Measurement"
    },
    {
        ", Compare ": null
    },
    {
        "Josephus": "Josephus"
    },
    {
        ",  Antiquities  , who writes of the ": null
    },
    {
        "Temple Mount": "Temple Mount"
    },
    {
        " in Jerusalem that it was encompassed by a wall which measured one stadion  to each angle, a word translated in English as furlong. which in turn derived from the ": null
    },
    {
        "Greek system": "Ancient Greek Units Of Measurement"
    },
    {
        ". For example, the ": null
    },
    {
        "King James Bible": "King James Version"
    },
    {
        " uses the term furlong in place of the Greek stadion, although more recent translations often use miles or kilometres in the main text and give the original numbers in footnotes.     In the Roman system, there were 625 feet to the stadium, eight stadia to the mile, and three miles to the ": null
    },
    {
        "league": "League"
    },
    {
        ". A league was considered to be the distance a man could walk in one hour, and the mile  consisted of 1,000 passus .     After the fall of the ": null
    },
    {
        "Western Roman Empire": "Western Roman Empire"
    },
    {
        ", medieval Europe continued with the Roman system, which the people proceeded to diversify, leading to serious complications in trade, taxation, etc. Around the year 1300, by royal decree England standardized a long list of measures. Among the important units of distance and length at the time were the ": null
    },
    {
        "foot": "Foot"
    },
    {
        ", ": null
    },
    {
        "yard": "Yard"
    },
    {
        ", ": null
    },
    {
        "rod": "Rod"
    },
    {
        " , furlong, and the ": null
    },
    {
        "mile": "Mile"
    },
    {
        ". The rod was defined as  yards or  feet, and the mile was eight furlongs, so the definition of the furlong became 40 rods and that of the mile became 5,280 feet .     A description from 1675 states, Dimensurator or Measuring Instrument whereof the mosts usual has been the Chain, and the common length for English Measures four Poles, as answering indifferently to the Englishs Mile and Acre, 10 such Chains in length making a Furlong, and 10 single square Chains an Acre, so that a square Mile contains 640 square Acres. —John Ogilby, Britannia, 1675     The official use of the furlong was abolished in the United Kingdom under the ": null
    },
    {
        "Weights and Measures Act": "Weights And Measures Acts Of The United Kingdom"
    },
    {
        " 1985, an act that also abolished the official use of many other traditional units of measurement.             In ": null
    },
    {
        "Myanmar": "Myanmar"
    },
    {
        ", furlongs are currently used in conjunction with miles to indicate distances on highway signs. Mileposts on the ": null
    },
    {
        "Yangon–Mandalay Expressway": "Yangon–Mandalay Expressway"
    },
    {
        " use miles and furlongs.        In the rest of the world, the furlong has very limited use, with the notable exception of ": null
    },
    {
        "horse racing": "Horse Racing"
    },
    {
        " in most English-speaking countries, including ": null
    },
    {
        "Canada": "Canada"
    },
    {
        " and the ": null
    },
    {
        "United States": "United States"
    },
    {
        ". The distances for ": null
    },
    {
        "horse racing": "Horse Racing"
    },
    {
        " in Australia were converted to metric in 1972,  but in the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        ",   ": null
    },
    {
        "Ireland": "Ireland"
    },
    {
        ", ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ", and the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", races are still given in miles and furlongs. Also distances along the canals in English navigated by ": null
    },
    {
        "narrowboats": "Narrowboat"
    },
    {
        " are commonly expressed in miles and furlongs.     The city of ": null
    },
    {
        "Chicagos street numbering system": "Roads And Expressways In Chicago"
    },
    {
        " allots a measure of 800 address units to each mile, in keeping with the citys system of eight blocks per mile. This means that every block in a typical Chicago neighborhood is approximately one furlong in length. ": null
    },
    {
        "Salt Lake Citys": "Salt Lake City"
    },
    {
        " blocks are also each a square furlong in the downtown area. The blocks become less regular in shape farther from the center, but the numbering system remains the same everywhere in ": null
    },
    {
        "Salt Lake County": "Salt Lake County, Utah"
    },
    {
        ". Blocks in central ": null
    },
    {
        "Logan, Utah": "Logan, Utah"
    },
    {
        ", and in large sections of ": null
    },
    {
        "Phoenix, Arizona": "Phoenix, Arizona"
    },
    {
        ", are similarly a square furlong in extent . City blocks in the ": null
    },
    {
        "Hoddle Grid": "Hoddle Grid"
    },
    {
        " of ": null
    },
    {
        "Melbourne": "Melbourne"
    },
    {
        " are also one furlong in length.     Much of ": null
    },
    {
        "Ontario": "Ontario"
    },
    {
        ", Canada, was originally surveyed on a ten-furlong grid, with major roads being laid out along the grid lines. Now that distances are shown on road signs in kilometres, these major roads are almost exactly two kilometres apart. The exits on highways running through ": null
    },
    {
        "Toronto": "Toronto"
    },
    {
        ", for example, are generally at intervals of two kilometres.        The furlong is also a base unit of the humorous ": null
    },
    {
        "FFF system": "Fff System"
    },
    {
        " of units. Stan Kelly-Bootle,  , ACM Queue, March 2007, pp. 62–64.         The exact conversion of the furlong to ": null
    },
    {
        "SI units": "International System Of Units"
    },
    {
        " varies slightly among English-speaking countries. In Canada   , as amended; Schedule  II, Canadian Units of Measurement.   and the United Kingdom,   , as amended; Schedule  1,   Part  VI, Definitions of certain units which may not be used for trade except as supplementary indications.   which define the furlong in terms of the international yard of exactly 0.9144 metres, a furlong is 201.168  m.   Australia   , Statutory Rules 1999 No. 110 as amended, Schedule  11, Conversion Factors.   does not formally define the furlong, but it does define the chain and link in terms of the international yard.     In the United States, which defines the furlong, chain, rod, and ": null
    },
    {
        "link": "Link"
    },
    {
        " in terms of the ": null
    },
    {
        "U.S. survey foot": "U.S. Survey Foot"
    },
    {
        " of exactly  metre,   NIST Special Publication 811, Guide for the Use of the International System of Units , ": null
    }
]