[
    {
        "         Galicia  is an ": null
    },
    {
        "autonomous community": "Autonomous Communities Of Spain"
    },
    {
        " of ": null
    },
    {
        "Spain": "Spain"
    },
    {
        " and ": null
    },
    {
        "historic nationality": "Nationalities And Regions Of Spain"
    },
    {
        " under Spanish law. Galicia, a historic nationality, constitutes itself as an autonomous community for accessing to its self-government , Galicia, nacionalidade histórica, constitúese en Comunidade Autónoma para acceder ó seu autogoberno ": null
    },
    {
        "Statute of Autonomy of Galicia ": "Galician Statute Of Autonomy Of 1981"
    },
    {
        ", 1. Located in the northwest ": null
    },
    {
        "Iberian Peninsula": "Iberian Peninsula"
    },
    {
        ", it includes the ": null
    },
    {
        "provinces": "Provinces Of Spain"
    },
    {
        " of ": null
    },
    {
        "A Coruña": "A Coruña"
    },
    {
        ", ": null
    },
    {
        "Lugo": "Lugo"
    },
    {
        ", ": null
    },
    {
        "Ourense": "Ourense"
    },
    {
        " and ": null
    },
    {
        "Pontevedra": "Pontevedra"
    },
    {
        ".     Galicia is bordered by ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        " to the south, the Spanish autonomous communities of ": null
    },
    {
        "Castile and León": "Castile And León"
    },
    {
        " and ": null
    },
    {
        "Asturias": "Asturias"
    },
    {
        " to the east, the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " to the west, and the ": null
    },
    {
        "Cantabrian Sea": "Cantabrian Sea"
    },
    {
        " to the north. It had a population of 2,701,743 in 2018 and a total area of . Galicia has over  of coastline,  including its offshore islands and islets, among them ": null
    },
    {
        "Cíes Islands": "Cíes Islands"
    },
    {
        ", ": null
    },
    {
        "Ons": "Ons Island"
    },
    {
        ", ": null
    },
    {
        "Sálvora": "Sálvora"
    },
    {
        ", ": null
    },
    {
        "Cortegada": "Cortegada"
    },
    {
        ", and the largest and most populated, ": null
    },
    {
        "A Illa de Arousa": "A Illa De Arousa"
    },
    {
        ".     The area now called Galicia was first inhabited by humans during the ": null
    },
    {
        "Middle Paleolithic": "Middle Paleolithic"
    },
    {
        " period, and takes its name from the ": null
    },
    {
        "Gallaeci": "Gallaeci"
    },
    {
        ", the ": null
    },
    {
        "Celtic people": "Celts"
    },
    {
        " living north of the ": null
    },
    {
        "Douro": "Douro"
    },
    {
        " River during the last millennium BC. Galicia was incorporated into the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        " at the end of the ": null
    },
    {
        "Cantabrian Wars": "Cantabrian Wars"
    },
    {
        " in 19 BC, and was made a ": null
    },
    {
        "Roman province": "Roman Province"
    },
    {
        " in the 3rd century AD. In 410, the Germanic ": null
    },
    {
        "Suebi": "Suebi"
    },
    {
        " established a ": null
    },
    {
        "kingdom": "Kingdom Of The Suebi"
    },
    {
        " with its capital in ": null
    },
    {
        "Braga ": "Braga"
    },
    {
        "; this kingdom was incorporated into that of the ": null
    },
    {
        "Visigoths": "Visigoths"
    },
    {
        " in 585. In 711, the ": null
    },
    {
        "Islamic": "Islamic"
    },
    {
        " Umayyad Caliphate": "Umayyad Caliphate"
    },
    {
        " invaded the Iberian Peninsula conquering the ": null
    },
    {
        "Visigoth kingdom of Hispania": "Visigothic Kingdom"
    },
    {
        " by 718,  but soon Galicia was incorporated into the Christian ": null
    },
    {
        "kingdom of Asturias": "Kingdom Of Asturias"
    },
    {
        " by 740. During the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", the ": null
    },
    {
        "kingdom of Galicia": "Kingdom Of Galicia"
    },
    {
        " was occasionally ruled ": null
    },
    {
        "by its own kings": "Kings Of Galicia"
    },
    {
        ",  but most of the time it was leagued to the ": null
    },
    {
        "kingdom of Leon": "Kingdom Of Leon"
    },
    {
        " and later to that of ": null
    },
    {
        "Castile": "Kingdom Of Castile"
    },
    {
        ", while maintaining its own legal and customary practices and culture. From the 13th century on, the kings of Castile, as kings of Galicia, appointed an  Adiantado-mór , whose attributions passed to the  Governor and Captain General of the Kingdom of Galiza from the last years of the 15th century. The Governor also presided the  Real Audiencia do Reino de Galicia, a royal tribunal and government body. From the 16th century, the representation and voice of the kingdom was held by an assembly of deputies and representatives of the cities of the kingdom, the Cortes or  Junta of the Kingdom of Galicia .  This institution was forcibly discontinued in 1833 when the kingdom was divided into four administrative provinces with no legal mutual links. During the 19th and 20th centuries, demand grew for self-government and for the recognition of the culture of Galicia. This resulted in the ": null
    },
    {
        "Statute of Autonomy of 1936": "Galician Statute Of Autonomy"
    },
    {
        ", soon frustrated by Francos coup detat and subsequent long dictatorship. After democracy was restored the legislature passed the ": null
    },
    {
        "Statute of Autonomy of 1981": "Galician Statute Of Autonomy Of 1981"
    },
    {
        ", approved in referendum and currently in force, providing Galicia with self-government.     The interior of Galicia is characterized by a hilly landscape; mountain ranges rise to  in the east and south. The coastal areas are mostly an alternate series of  rías  and cliffs. The climate of Galicia is usually temperate and rainy, with markedly drier summers; it is usually classified as ": null
    },
    {
        "Oceanic": "Oceanic Climate"
    },
    {
        ". Its topographic and climatic conditions have made animal husbandry and farming the primary source of Galicias wealth for most of its history, allowing for a relative high density of population. Galicia had a population of 1,345,803 inhabitants in 1787, some 44 inhabitants per square kilometer, out of a total of 9,307,804 in metropolitan Spain. Cf.  With the exception of shipbuilding and food processing, Galicia was based on a farming and fishing economy until after the mid-20th century, when it began to industrialize. In 2018, the ": null
    },
    {
        "nominal gross domestic product": "Nominal Gross Domestic Product"
    },
    {
        " was €62,900  million,  with a nominal ": null
    },
    {
        "GDP per capita": "Gdp Per Capita"
    },
    {
        " of €23,300. Galicia is characterised, unlike other Spanish regions, by the absence of a metropolis dominating the territory. Indeed, the urban network is made up of 7 main cities  and other small towns. The population is largely concentrated in two main areas: from ": null
    },
    {
        "Ferrol": "Ferrol, Spain"
    },
    {
        " to ": null
    },
    {
        "A Coruña": "A Coruña"
    },
    {
        " in the northern coast, and in the ": null
    },
    {
        "Rías Baixas": "Rías Baixas"
    },
    {
        " region in the southwest, including the cities of ": null
    },
    {
        "Vigo": "Vigo"
    },
    {
        ", ": null
    },
    {
        "Pontevedra": "Pontevedra"
    },
    {
        ", and the interior city of ": null
    },
    {
        "Santiago de Compostela": "Santiago De Compostela"
    },
    {
        ". There are smaller populations around the interior cities of ": null
    },
    {
        "Lugo": "Lugo"
    },
    {
        " and ": null
    },
    {
        "Ourense": "Ourense"
    },
    {
        ". The political capital is Santiago de Compostela, in the province of A Coruña. ": null
    },
    {
        "A Coruña": "A Coruña"
    },
    {
        " is the largest city with 213,418 while Vigo, in the province of ": null
    },
    {
        "Pontevedra": "Pontevedra"
    },
    {
        ", is the largest municipality, with 292,817 . ": null
    },
    {
        "INE": "Instituto Nacional De Estadística"
    },
    {
        " 2013     Two languages are official and widely used today in Galicia: the native ": null
    },
    {
        "Galician": "Galician Language"
    },
    {
        ", a ": null
    },
    {
        "Romance language": "Romance Language"
    },
    {
        " closely related to ": null
    },
    {
        "Portuguese": "Portuguese Language"
    },
    {
        " with which it shares the ": null
    },
    {
        "Galician-Portuguese": "Galician-Portuguese"
    },
    {
        " medieval literature; and ": null
    },
    {
        "Spanish": "Spanish Language"
    },
    {
        ", usually known locally as Castilian. While most Galicians are bilingual, a 2013 survey reported that 51% of the Galician population spoke Galician most often on a day-to-day basis, while 48% most often used Spanish.                 The name Galicia derives from the Latin toponym Callaecia, later  Gallaecia , related to the name of an ancient Celtic tribe that resided north of the ": null
    },
    {
        "Douro": "Douro"
    },
    {
        " river, the ": null
    },
    {
        "Gallaeci or Callaeci": "Gallaeci"
    },
    {
        " in ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ", or   in ": null
    },
    {
        "Greek": "Ancient Greek"
    },
    {
        ".  These  Callaeci  were the first tribe in the area to help the ": null
    },
    {
        "Lusitanians": "Lusitanians"
    },
    {
        " against the invading Romans. The Romans applied their name to all the other tribes in the northwest who spoke the ": null
    },
    {
        "same language": "Gallaecian Language"
    },
    {
        " and lived the same life. Luján, Eugenio R. : Ptolemys Callaecia and the language of the ": null
    },
    {
        "Callaeci": "Callaeci"
    },
    {
        ", in Ptolemy: towards a linguistic atlas of the earliest Celtic place-names of Europe : papers from a workshop sponsored by the British Academy, Dept. of Welsh, University of Wales, Aberystwyth, 11–12 April 1999, pp. 55–72. Parsons and Patrick Sims-Williams editors.     The etymology of the name has been studied since the 7th century by authors such as ": null
    },
    {
        "Isidore of Seville": "Isidore Of Seville"
    },
    {
        ", who wrote that Galicians are called so, because of their fair skin, as the Gauls , relating the name to the Greek word for milk. In the 21st century, some scholars have derived the name of the ancient Callaeci either from ": null
    },
    {
        "Proto-Indo-European": "Proto-Indo-European"
    },
    {
        " suffix": "Suffix"
    },
    {
        " -aik-, so meaning the hill ; or either from ": null
    },
    {
        "Proto-Celtic": "Proto-Celtic"
    },
    {
        " . CUADERNOS DE ESTUDIOS GALLEGOS LV : 111. In any case, Galicia, being per se a derivation of the ethnic name Kallaikói, means the land of the Galicians.     The most recent proposal comes from linguist ": null
    },
    {
        "Francesco Benozzo": "Francesco Benozzo"
    },
    {
        " after identifying the root gall- / kall- in a number of Celtic words with the meaning stone or rock , as follows: gall , gal , gailleichan , kailhoù , galagh and gall . Hence, Benozzo explains the ethnonym Callaeci as being the stone people or the people of the stone , in reference to the builders of the ancient ": null
    },
    {
        "megaliths": "Megalith"
    },
    {
        "and stone formations so common in Galicia. Benozzo, F. Uma paisagem atlântica pré-histórica. Etnogénese e etno-filologia paleo-mesolítica das tradições galega e portuguesa , in proceedings of Jornadas das Letras Galego-Portuguesas 2015–2017, DTS, Università di Bologna and Academia Galega da Língua Portuguesa, pp. 159–170.     The name evolved during the Middle Ages from Gallaecia, sometimes written Galletia, to Gallicia. In the 13th century, with the written emergence of the Galician language, Galiza became the most usual written form of the name of the country, being replaced during the 15th and 16th centuries by the current form, Galicia. This coincides with the spelling of the ": null
    },
    {
        "Castilian Spanish": "Castilian Spanish"
    },
    {
        " name. The historical denomination Galiza became popular again during the end of the 19th and the first three-quarters of the 20th century, and is still used with some frequency today. The ": null
    },
    {
        "Xunta de Galicia": "Xunta De Galicia"
    },
    {
        ", the local ": null
    },
    {
        "devolved government": "Devolved Government"
    },
    {
        ", uses Galicia. The ": null
    },
    {
        "Royal Galician Academy": "Royal Galician Academy"
    },
    {
        ", the institution responsible for regulating the Galician language, whilst recognizing Galiza as a legitimate current denomination, has stated that the only official name of the country is Galicia.                     The oldest attestation of human presence in Galicia has been found in the Eirós Cave, in the municipality of ": null
    },
    {
        "Triacastela": "Triacastela"
    },
    {
        ", which has preserved animal remains and ": null
    },
    {
        "Neanderthal": "Neanderthal"
    },
    {
        " stone objects from the ": null
    },
    {
        "Middle Paleolithic": "Middle Paleolithic"
    },
    {
        ". The earliest culture to have left significant architectural traces is the ": null
    },
    {
        "Megalithic": "Megalithic"
    },
    {
        " culture, which expanded along the western European coasts during the ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " and ": null
    },
    {
        "Calcolithic": "Calcolithic"
    },
    {
        " eras. Thousands of Megalithic ": null
    },
    {
        "tumuli": "Tumulus"
    },
    {
        " are distributed throughout the country, but mostly along the coastal areas. Antonio de la Peña Santos,  , ; soldiers who had not joined the rebellion, such as Generals ": null
    },
    {
        "Rogelio Caridad Pita": "Rogelio Caridad Pita"
    },
    {
        " and ": null
    },
    {
        "Enrique Salcedo Molinuevo": "Enrique Salcedo Molinuevo"
    },
    {
        " and Admiral ": null
    },
    {
        "Antonio Azarola": "Antonio Azarola"
    },
    {
        "; and the founders of the PG, ": null
    },
    {
        "Alexandre Bóveda": "Alexandre Bóveda"
    },
    {
        " and ": null
    },
    {
        "Víctor Casas": "Víctor Casas"
    },
    {
        ",  as well as other professionals akin to republicans and nationalists, as the journalist ": null
    },
    {
        "Manuel Lustres Rivas": "Manuel Lustres Rivas"
    },
    {
        " or physician ": null
    },
    {
        "Luis Poza Pastrana": "Luis Poza Pastrana"
    },
    {
        ". Many others were forced to escape into exile, or were victims of other reprisals and removed from their jobs and positions.   General ": null
    },
    {
        "Francisco Franco": "Francisco Franco"
    },
    {
        " – himself a Galician from ": null
    },
    {
        "Ferrol": "Ferrol, Spain"
    },
    {
        " – ruled as dictator from the civil war until his death in 1975. Francos centralizing regime suppressed any official use of the Galician language, including the use of Galician names for newborns, although its everyday oral use was not forbidden. Among the attempts at resistance were small leftist guerrilla groups such as those led by ": null
    },
    {
        "José Castro Veiga": "José Castro Veiga"
    },
    {
        " and ": null
    },
    {
        "Benigno Andrade": "Benigno Andrade"
    },
    {
        " , both of whom were ultimately captured and executed.   In the 1960s, ministers such as ": null
    },
    {
        "Manuel Fraga Iribarne": "Manuel Fraga Iribarne"
    },
    {
        " introduced some reforms allowing ": null
    },
    {
        "technocrats": "Technocrat"
    },
    {
        "affiliated with ": null
    },
    {
        "Opus Dei": "Opus Dei"
    },
    {
        " to modernize administration in a way that facilitated ": null
    },
    {
        "capitalist": "Capitalism"
    },
    {
        " economic development. However, for decades Galicia was largely confined to the role of a supplier of raw materials and energy to the rest of Spain, causing environmental havoc and leading to a wave of migration to ": null
    },
    {
        "Venezuela": "Venezuela"
    },
    {
        " and to various parts of Europe. ": null
    },
    {
        "Fenosa": "Unión Fenosa"
    },
    {
        ", the monopolistic supplier of electricity, built hydroelectric dams, flooding many Galician river valleys.      The Galician economy finally began to modernize with a ": null
    },
    {
        "Citroën": "Citroën"
    },
    {
        " factory in Vigo, the modernization of the canning industry and the fishing fleet, and eventually a modernization of small peasant farming practices, especially in the production of cows milk. In the province of Ourense, businessman and politician ": null
    },
    {
        "Eulogio Gómez Franqueira": "Eulogio Gómez Franqueira"
    },
    {
        " gave impetus to the raising of livestock and poultry by establishing the ": null
    },
    {
        "Cooperativa Orensana S.A.": "Cooperativa Orensana S.A."
    },
    {
        " .     During the last decade of Francos rule, there was a renewal of nationalist feeling in Galicia. The early 1970s were a time of unrest among university students, workers, and farmers. In 1972, general strikes in Vigo and Ferrol cost the lives of Amador Rey and Daniel Niebla.  Later, the bishop of ": null
    },
    {
        "Mondoñedo": "Mondoñedo"
    },
    {
        "-": null
    },
    {
        "Ferrol": "Ferrol, Spain"
    },
    {
        ", ": null
    },
    {
        "Miguel Anxo Araúxo Iglesias": "Miguel Anxo Araúxo Iglesias"
    },
    {
        ", wrote a pastoral letter that was not well received by the Franco regime, about a demonstration in ": null
    },
    {
        "Bazán": "Navantia"
    },
    {
        " where two workers died.      As part of the ": null
    },
    {
        "transition to democracy": "Spanish Transition To Democracy"
    },
    {
        " upon the death of Franco in 1975, Galicia regained its status as an autonomous region within Spain with the Statute of Autonomy of 1981, which begins, Galicia, historical nationality, is constituted as an Autonomous Community to access to its self-government, in agreement with the ": null
    },
    {
        "Spanish Constitution": "Spanish Constitution"
    },
    {
        " and with the present Statute . Varying degrees of ": null
    },
    {
        "nationalist": "Nationalisms And Regionalisms Of Spain"
    },
    {
        " or independentist sentiment are evident at the political level. The  Bloque Nacionalista Galego  or BNG, is a conglomerate of ": null
    },
    {
        "left-wing": "Left-Wing"
    },
    {
        " parties and individuals that claims Galician political status as a nation.        From 1990 to 2005, Manuel Fraga, former minister and ambassador in the Franco dictature, presided over the Galician autonomous government, the ": null
    },
    {
        "Xunta de Galicia": "Xunta De Galicia"
    },
    {
        ". Fraga was associated with the  Partido Popular   since its founding. In 2002, when the oil tanker ": null
    },
    {
        "Prestige": "Prestige"
    },
    {
        " sank and covered the Galician coast in oil, Fraga was accused by the grassroots movement  Nunca Mais  of having been unwilling to react. In the 2005 Galician elections, the Peoples Party lost its absolute majority, though remaining the largest party in the parliament, with 43% of the total votes. As a result, power passed to a coalition of the  Partido dos Socialistas de Galicia  , a federal sister-party of Spains main social-democratic party, the  Partido Socialista Obrero Español  and the nationalist  Bloque Nacionalista Galego  . As the senior partner in the new coalition, the PSdeG nominated its leader, ": null
    },
    {
        "Emilio Perez Touriño": "Emilio Perez Touriño"
    },
    {
        ", to serve as Galicias new president, with ": null
    },
    {
        "Anxo Quintana": "Anxo Quintana"
    },
    {
        ", the leader of BNG, as its vice president.     In 2009, the PSdG-BNG coalition lost the elections and the government went back to the Peoples Party , even though the PSdG-BNG coalition actually obtained the most votes. ": null
    },
    {
        "Alberto Núñez Feijóo": "Alberto Núñez Feijóo"
    },
    {
        " is now Galicias president.     In 2012 several parties and individuals abandoned the BNG.  ": null
    },
    {
        "Encontro Irmandiño": "Encontro Irmandiño"
    },
    {
        " abandoned the bloc  and joined with ": null
    },
    {
        "Fronte Obreira Galega": "Galician Workers Front"
    },
    {
        ", the ": null
    },
    {
        "FPG": "Galician Peoples Front"
    },
    {
        ", ": null
    },
    {
        "Movemento pola Base": "Movemento Pola Base"
    },
    {
        " and other collectives to form ": null
    },
    {
        "Anova-Nationalist Brotherhood": "Anova-Nationalist Brotherhood"
    },
    {
        ".  Anova obtained 9 seats in the ": null
    },
    {
        "2012 Galician election": "Galician Parliamentary Election, 2012"
    },
    {
        " as part of the ": null
    },
    {
        "Galician Left Alternative": "Galician Left Alternative"
    },
    {
        " coalition. BNG obtained 7 seats and PPdG won the elections again.             Galicia has a surface area of . , Xunta de Galicia, Consellaría de Cultura e Deporte. Its northernmost point, at 43°47′N, is ": null
    },
    {
        "Estaca de Bares": "Estaca De Bares Point"
    },
    {
        " ; its southernmost, at 41°49′N, is on the Portuguese border in the ": null
    },
    {
        "Baixa Limia-Serra do Xurés Natural Park": "Baixa Limia-Serra Do Xurés Natural Park"
    },
    {
        ". The easternmost longitude is at 6°42′W on the border between the province of ": null
    },
    {
        "Ourense": "Ourense"
    },
    {
        " and the ": null
    },
    {
        "Castilian-Leonese": "Castile And León"
    },
    {
        " province of Zamora": "Province Of Zamora"
    },
    {
        "also known as Finisterre": null
    },
    {
        "3": "3"
    },
    {
        "though not all": null
    },
    {
        "v": "V"
    },
    {
        " High Rías  Low Rías  Intermediate Rías ": null
    },
    {
        "ograp": "Ograp"
    },
    {
        "westernmost point in Galicia": null
    },
    {
        "Serra do Eixe": "Serra Do Eixe"
    },
    {
        ", ": null
    },
    {
        "Serra da Lastra": "Serra Da Lastra"
    },
    {
        ", ": null
    },
    {
        "Serra do Courel": "Serra Do Courel"
    },
    {
        "northern ": null
    },
    {
        "Lugo": "Province Of Lugo"
    },
    {
        "on the border with ": null
    },
    {
        "León": "Province Of León"
    },
    {
        " and ": null
    },
    {
        "Asturias": "Asturias"
    },
    {
        "on the border with Leónthe border between ": null
    },
    {
        "Ourense": "Province Of Ourense"
    },
    {
        " and ": null
    },
    {
        "Zamora": "Province Of Zamora"
    },
    {
        "in the center of Ourense provincethe border between Lugo and Pontevedraborder of Lugo and A CoruñaA Coruñabetween Pontevedra and Ourense o país dos mil ríos Father Miño": null
    },
    {
        "v": "V"
    },
    {
        "v": "V"
    },
    {
        "v": "V"
    },
    {
        "v": "V"
    },
    {
        "ENCEBurn Galiciavariously known locally as fragas or devesasFragas do Eume": null
    },
    {
        "501807": "501807"
    },
    {
        "Spainsuch as on the Ría de Ribadeoroughly, the ": null
    },
    {
        "province of Ourense": "Province Of Ourense"
    },
    {
        " and ": null
    },
    {
        "Pontevedra": "Province Of Pontevedra"
    },
    {
        "CsbCfb               ": null
    }
]