[
    {
        "   A gametophyte  is one of the two ": null
    },
    {
        "alternating phases": "Alternation Of Generations"
    },
    {
        " in the life cycle of ": null
    },
    {
        "plants": "Plant"
    },
    {
        "and ": null
    },
    {
        "algae": "Algae"
    },
    {
        ". It is a ": null
    },
    {
        "haploid": "Haploid"
    },
    {
        " multicellular organism that develops from a haploid ": null
    },
    {
        "spore": "Spore"
    },
    {
        " that has one set of chromosomes. The gametophyte is the ": null
    },
    {
        "sexual phase": "Sexual Reproduction Of Plants"
    },
    {
        " in the life cycle of plants and algae. It develops sex organs that produce ": null
    },
    {
        "gamete": "Gamete"
    },
    {
        "s, haploid sex cells that participate in ": null
    },
    {
        "fertilization": "Fertilization"
    },
    {
        " to form a ": null
    },
    {
        "diploid": "Diploid"
    },
    {
        " zygote": "Zygote"
    },
    {
        " which has a double set of chromosomes. Cell division of the zygote results in a new ": null
    },
    {
        "diploid": "Diploid"
    },
    {
        " multicellular organism, the second stage in the life cycle known as the ": null
    },
    {
        "sporophyte": "Sporophyte"
    },
    {
        ". The sporophyte can produce haploid spores by ": null
    },
    {
        "meiosis": "Meiosis"
    },
    {
        ".       In some ": null
    },
    {
        "multicellular": "Multicellular"
    },
    {
        " green algae": "Green Algae"
    },
    {
        " , ": null
    },
    {
        "red algae": "Red Algae"
    },
    {
        " and ": null
    },
    {
        "brown algae": "Brown Algae"
    },
    {
        ", sporophytes and gametophytes may be externally indistinguishable . In  Ulva  the gametes are ": null
    },
    {
        "isogamous": "Isogamy"
    },
    {
        ", all of one size, shape and general morphology.        In ": null
    },
    {
        "land plants": "Embryophyte"
    },
    {
        ", ": null
    },
    {
        "anisogamy": "Anisogamy"
    },
    {
        " is universal. As in animals, female and male gametes are called, respectively, eggs and sperm. In extant land plants, either the sporophyte or the gametophyte may be reduced .        In ": null
    },
    {
        "bryophytes": "Bryophytes"
    },
    {
        " , the gametophyte is the most visible stage of the life cycle. The bryophyte gametophyte is longer lived, nutritionally independent, and the sporophytes are typically attached to the gametophytes and dependent on them.  When a moss spore germinates it grows to produce a filament of cells . The mature gametophyte of mosses develops into leafy shoots that produce sex organs  that produce gametes. Eggs develop in ": null
    },
    {
        "archegonia": "Archegonium"
    },
    {
        " and sperm in ": null
    },
    {
        "antheridia": "Antheridium"
    },
    {
        ". ": null
    },
    {
        "Ralf Reski": "Ralf Reski"
    },
    {
        " : Development, genetics and molecular biology of mosses. In: Botanica Acta 111, pp 1-15.     In some bryophyte groups such as many liverworts of the order ": null
    },
    {
        "Marchantiales": "Marchantiales"
    },
    {
        ", the gametes are produced on specialized structures called ": null
    },
    {
        "gametophores": "Gametophore"
    },
    {
        ".         All vascular plants are sporophyte dominant, and a trend toward smaller and more sporophyte-dependent female gametophytes is evident as land plants evolved reproduction by seeds.    Vascular plants such as ferns that produce only one type of spore are said to be homosporous. They have exosporic gametophytes—that is, the gametophyte is free-living and develops outside of the spore wall. Exosporic gametophytes can either be bisexual, capable of producing both sperm and eggs in the same ": null
    },
    {
        "thallus": "Thallus"
    },
    {
        " , or specialized into separate male and female organisms .     In ": null
    },
    {
        "heterosporous": "Heterospory"
    },
    {
        " vascular plants , the gametophyte develops endosporically . These gametophytes are ": null
    },
    {
        "dioicous": "Dioicous"
    },
    {
        ", producing either sperm or eggs but not both.         In most ": null
    },
    {
        "fern": "Fern"
    },
    {
        "s, for example, in the ": null
    },
    {
        "leptosporangiate fern": "Leptosporangiate Fern"
    },
    {
        "  Dryopteris , the gametophyte is a ": null
    },
    {
        "photosynthetic": "Photosynthesis"
    },
    {
        " free living ": null
    },
    {
        "autotroph": "Autotroph"
    },
    {
        "ic organism called a ": null
    },
    {
        "prothallus": "Prothallium"
    },
    {
        " that produces gametes and maintains the sporophyte during its early multicellular development. However, in some groups, notably the clade that includes ": null
    },
    {
        "Ophioglossaceae": "Ophioglossaceae"
    },
    {
        " and ": null
    },
    {
        "Psilotaceae": "Psilotaceae"
    },
    {
        ", the gametophytes are subterranean and subsist by forming ": null
    },
    {
        "mycotroph": "Mycotroph"
    },
    {
        "ic relationships with fungi.         Extant ": null
    },
    {
        "lycophytes": "Lycopodiophyta"
    },
    {
        " produce two different types of gametophytes. In the homosporous families ": null
    },
    {
        "Lycopodiaceae": "Lycopodiaceae"
    },
    {
        " and ": null
    },
    {
        "Huperziaceae": "Huperziaceae"
    },
    {
        ", spores germinate into bisexual free-living, subterranean and ": null
    },
    {
        "mycotroph": "Mycotroph"
    },
    {
        "ic gametophytes that derive nutrients from symbiosis with fungi. In  Isoetes  and  Selaginella , which are ": null
    },
    {
        "heterosporous": "Heterospory"
    },
    {
        ", microspores and megaspores are dispersed from sporangia either passively or by active ejection.  Microspores produce microgametophytes which the produce sperm. Megaspores produce reduced megagametophytes inside the spore wall. At maturity, the megaspore cracks open at the trilete suture to allow the male gametes to access the egg cells in the archegonia inside. The gametophytes of Isoetes appear to be similar in this respect to those of the extinct ": null
    },
    {
        "Carboniferous": "Carboniferous"
    },
    {
        " arborescent lycophytes Lepidodendron and Lepidostrobus.        The ": null
    },
    {
        "seed plants": "Spermatophyta"
    },
    {
        "  are endosporic and heterosporous. The gametophytes develop into multicellular organisms while still enclosed within the spore wall, and the megaspores are retained within the sporangium. C.Michael Hogan :  . Washington, DC            In plants with heteromorphic gametophytes, there are two distinct kinds of gametophytes. Because the two gametophytes differ in form and function, they are termed heteromorphic, from hetero- different and morph form . The egg producing gametophyte is known as a megagametophyte, because it is typically larger, and the sperm producing gametophyte is known as a microgametophyte. Gametophytes which produce egg and sperm on separate plants are termed ": null
    },
    {
        "dioicous": "Dioicous"
    },
    {
        ".     In ": null
    },
    {
        "heterosporous": "Heterospory"
    },
    {
        " plants , there are two distinct ": null
    },
    {
        "sporangia": "Sporangium"
    },
    {
        ", each of which produces a single kind of spore and single kind of gametophyte. However, not all heteromorphic gametophytes come from heterosporous plants. That is, some plants have distinct egg-producing and sperm-producing gametophytes, but these gametophytes develop from the same kind of spore inside the same sporangium;  Sphaerocarpos  is an example of such a plant.     In seed plants, the microgametophyte is called ": null
    },
    {
        "pollen": "Pollen"
    },
    {
        ". Seed plant microgametophytes consists of several cells when the pollen grains exit the sporangium. The megagametophyte develops within the megaspore of extant seedless vascular plants and within the megasporangium in a cone or flower in seed plants. In seed plants, the microgametophyte travels to the vicinity of the egg cell , and produces two sperm by mitosis.     In ": null
    },
    {
        "gymnosperms": "Gymnosperm"
    },
    {
        "the megagametophyte consists of several thousand cells and produces one to several ": null
    },
    {
        "archegonia": "Archegonia"
    },
    {
        ", each with a single egg cell. The gametophyte becomes a food storage tissue in the seed.      In ": null
    },
    {
        "angiosperm": "Angiosperm"
    },
    {
        "s, the megagametophyte is reduced to only a few nuclei and cells, and is sometimes called the ": null
    },
    {
        "embryo sac": "Embryo Sac"
    },
    {
        ". A typical embryo sac contains seven cells and eight nuclei, one of which is the egg cell. Two nuclei fuse with a sperm nucleus to form the ": null
    },
    {
        "endosperm": "Endosperm"
    }
]