[
    {
        "           Gavin MacLeod  is an ": null
    },
    {
        "American": "United States"
    },
    {
        " film": "Film"
    },
    {
        " and ": null
    },
    {
        "television": "Television"
    },
    {
        " character ": null
    },
    {
        "actor": "Actor"
    },
    {
        ", ships ambassador, and ": null
    },
    {
        "Christian": "Christianity"
    },
    {
        " activist and author, whose career spans six decades. He has also appeared as a guest on several talk, variety, and religious programs.     MacLeods long career began in films in 1957, playing opposite ": null
    },
    {
        "Peter Mann": "Peter Mann"
    },
    {
        " in  The Sword of Ali Baba  . He went on to play opposite ": null
    },
    {
        "Anthony Franciosa": "Anthony Franciosa"
    },
    {
        " in  A Man Called Gannon  , opposite ": null
    },
    {
        "Christopher George": "Christopher George"
    },
    {
        " in  The Thousand Plane Raid , and opposite ": null
    },
    {
        "Clint Eastwood": "Clint Eastwood"
    },
    {
        ", ": null
    },
    {
        "Telly Savalas": "Telly Savalas"
    },
    {
        ", and ": null
    },
    {
        "Carroll OConnor": "Carroll Oconnor"
    },
    {
        " in  Kellys Heroes  .     MacLeod achieved continuing television success co-starring opposite ": null
    },
    {
        "Ernest Borgnine": "Ernest Borgnine"
    },
    {
        " on  McHales Navy  , as Joseph Happy Haines, and on  The Mary Tyler Moore Show  as ": null
    },
    {
        "Murray Slaughter": "Murray Slaughter"
    },
    {
        ". He is best known for his starring role on ": null
    },
    {
        "ABCs": "American Broadcasting Company"
    },
    {
        "  The Love Boat  , in which he was cast as ships Captain Merrill Stubing.       MacLeod was born in ": null
    },
    {
        "Mount Kisco": "Mount Kisco, New York"
    },
    {
        ", ": null
    },
    {
        "New York": "New York"
    },
    {
        ", the elder of two children. His mother, Margaret  See , a middle school dropout, worked for  Readers Digest .  His father, George See , an ": null
    },
    {
        "electrician": "Electrician"
    },
    {
        ", was part ": null
    },
    {
        "Chippewa ": "Ojibwe"
    },
    {
        ".  He grew up in ": null
    },
    {
        "Pleasantville": "Pleasantville, New York"
    },
    {
        ", New York, and studied acting at ": null
    },
    {
        "Ithaca College": "Ithaca College"
    },
    {
        ", from which he graduated in 1952 with a Bachelors degree in fine arts.     After serving in the ": null
    },
    {
        "United States Air Force": "United States Air Force"
    },
    {
        ",  he moved to ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " and worked at ": null
    },
    {
        "Radio City Music Hall": "Radio City Music Hall"
    },
    {
        " while looking for acting work. At about this time he changed his name, drawing Gavin from a physically disabled victim in a television drama, and MacLeod from his Ithaca drama coach, Beatrice MacLeod.  MacLeod said in a 2013 interview with  Parade  about his stage name, he felt as if my name was getting in the way of my success. Allan, he wrote, just wasn’t strong enough, and See was too confusing.        MacLeod made his television debut in 1957 on  The Walter Winchell File  at the age of 26. His first movie appearance was a small, uncredited role in  The True Story of Lynn Stuart  in 1958. Soon thereafter, he landed a credited role in  I Want to Live! , a 1958 prison drama starring ": null
    },
    {
        "Susan Hayward": "Susan Hayward"
    },
    {
        ". He was soon noticed by ": null
    },
    {
        "Blake Edwards": "Blake Edwards"
    },
    {
        ", who in 1958 cast him in the pilot episode of his NBC series  Peter Gunn , two guest roles on the Edwards CBS series  Mr. Lucky  in 1959, and as a nervous harried navy ": null
    },
    {
        "yeoman": "Yeoman"
    },
    {
        " in  Operation Petticoat , with ": null
    },
    {
        "Cary Grant": "Cary Grant"
    },
    {
        " and ": null
    },
    {
        "Tony Curtis": "Tony Curtis"
    },
    {
        ". Operation Petticoat proved to be a ": null
    },
    {
        "breakout role": "Breakout Role"
    },
    {
        " for MacLeod, and he was soon cast in two other Edwards comedies,  High Time , with ": null
    },
    {
        "Bing Crosby": "Bing Crosby"
    },
    {
        " and  The Party  with ": null
    },
    {
        "Peter Sellers": "Peter Sellers"
    },
    {
        ".     Between 1957 and 1961, MacLeod made several television appearances. He was cast as the devious Dandy Martin in the 1960 episode, Yankee Confederate , of the syndicated ": null
    },
    {
        "anthology series": "Anthology Series"
    },
    {
        ",  Death Valley Days , hosted by ": null
    },
    {
        "Stanley Andrews": "Stanley Andrews"
    },
    {
        " and starring alongside ": null
    },
    {
        "Tod Andrews": "Tod Andrews"
    },
    {
        " and ": null
    },
    {
        "Elaine Devry": "Elaine Devry"
    },
    {
        ".      In December 1961, he landed a guest role on  The Dick Van Dyke Show  as Mels cousin Maxwell Cooley, a wholesale jeweler. This was his first time working with Mary Tyler Moore. MacLeod had three guest appearances on  Perry Mason  Hawaii Five-O . Other guest roles include  The Untouchables ,  Dr. Kildare ,  Rawhide ,  Gomer Pyle, U.S.M.C. ,  The Man from U.N.C.L.E. ,  My Favorite Martian ,  Hogans Heroes ,  Combat! ,  The Big Valley ,  The Andy Griffith Show ,  It Takes a Thief ,  The Flying Nun ,  The King of Queens , and  That 70s Show .          His first regular television role began in 1962 as Joseph Happy Haines on  McHales Navy ; he left this role after two seasons to appear in the motion picture,  The Sand Pebbles  with ": null
    },
    {
        "Steve McQueen": "Steve Mcqueen"
    },
    {
        ".  Between the years of 1965 – 69, MacLeod appeared in many weekly episodes in multiple roles on the TV series Hogans Heroes including Major Zolle , General Metzger Major Kiegel and General von Rauscher .  These roles were usually a stern and discerning officer of the Schutzstaffel , Luftwaffe or Geheime Staatspolizei which are vastly different from the lovable characters he portrayed in his subsequent TV roles.     MacLeods breakout role as Murray Slaughter on ": null
    },
    {
        "CBS": "Cbs"
    },
    {
        "  The Mary Tyler Moore Show  won him lasting fame, and two ": null
    },
    {
        "Golden Globe": "Golden Globe"
    },
    {
        " nominations. His starring role as Captain Stubing on  The Love Boat , his next TV series, brought laughter to 90 countries worldwide, between 1977 and 1986 . His work on that show earned him three Golden Globe nominations. Co-starring with him was familiar actor and best friend ": null
    },
    {
        "Bernie Kopell": "Bernie Kopell"
    },
    {
        " as Dr. Adam Bricker and unfamiliar actor and best friend ": null
    },
    {
        "Ted Lange": "Ted Lange"
    },
    {
        " as bartender Isaac Washington. Lange said in a 2017 interview with The Wiseguyz Show of MacLeod that Oh yeah, sure, Gavin was wonderful. Gavin lives down here in Palm Springs and were still tight, all of us, Gavin and Bernie and Jill; we still see each other. Fred lives in a different state, were still close, were still good friends.      MacLeod became the global ambassador for ": null
    },
    {
        "Princess Cruises": "Princess Cruises"
    },
    {
        " in 1986. He has played a role in ceremonies launching many of the lines new ships.  In 1997, MacLeod joined the Love Boat cast on  The Oprah Winfrey Show . After The Love Boat, MacLeod toured with ": null
    },
    {
        "Michael Learned": "Michael Learned"
    },
    {
        " of  The Waltons  in  Love Letters . He made several appearances in musicals such as  Gigi  and  Copacabana  between 1997 and 2003.   In December 2008, he appeared with the ": null
    },
    {
        "Colorado Symphony": "Colorado Symphony"
    },
    {
        " in ": null
    },
    {
        "Denver": "Denver"
    },
    {
        ".      MacLeod and his wife have been hosts on the ": null
    },
    {
        "Trinity Broadcasting Network": "Trinity Broadcasting Network"
    },
    {
        " for 17 years, primarily hosting a show about marriage called Back on Course.  MacLeod appeared in ": null
    },
    {
        "Rich Christianos": "Rich Christiano"
    },
    {
        "  Time Changer , a movie about time travel and how the morals of society have moved away from the Bible. He also plays the lead role in Christianos 2009 film  The Secrets of Jonathan Sperry .       In April 2010, the entire cast of The Love Boat attended the ": null
    },
    {
        "TV Land Awards": "Tv Land Award"
    },
    {
        "with the exception of MacLeod, due a back operation to repair a couple of injured discs. Former co-star and long-term friend Ted Lange contacted him and received word his beloved TV friend was doing well.  In December, MacLeod appeared as a guest narrator with the ": null
    },
    {
        "Florida Orchestra": "Florida Orchestra"
    },
    {
        " and Master Chorale of Tampa Bay for three concerts.     MacLeod served as the honorary Mayor of ": null
    },
    {
        "Pacific Palisades": "Pacific Palisades, Los Angeles"
    },
    {
        " for five years, until ": null
    },
    {
        "Ray Leonard": "Sugar Ray Leonard"
    },
    {
        " succeeded him in 2011.  On February 28, 2011, MacLeod celebrated his 80th birthday aboard The Golden Princess on ": null
    },
    {
        "Princess Cruises": "Princess Cruises"
    },
    {
        " in ": null
    },
    {
        "Los Angeles, California": "Los Angeles, California"
    },
    {
        ". His friends and family, wished him a Happy Birthday, and presented him with a 5  ft. long, 3D replica in cake of the original Love Boat , representing The Pacific Princess.      Gavin appeared on the special for ": null
    },
    {
        "Betty Whites": "Betty White"
    },
    {
        "90th birthday on January 17, 2012. He reunited with White to film Safety Old School Style , an in-flight safety video for ": null
    },
    {
        "Air New Zealand": "Air New Zealand"
    },
    {
        " in 2013.  By January 2013, the video had been viewed two million times on ": null
    },
    {
        "YouTube": "Youtube"
    },
    {
        ". In October 2013, MacLeod appeared on  Today  to begin the promotional tour for his new book This Is Your Captain Speaking: My Fantastic Voyage Through Hollywood, Faith & Life. This appearance included a special set change to honor McLeods appearance on the show. In addition to television appearances, his book tour continued in ": null
    },
    {
        "New York": "New York City"
    },
    {
        ", ": null
    },
    {
        "Los Angeles": "Los Angeles"
    },
    {
        ", and ": null
    },
    {
        "Central Florida": "Central Florida"
    },
    {
        ". ": null
    },
    {
        "Loretta Swit": "Loretta Swit"
    },
    {
        " and Ted Lange were both present at Gavin’s first ": null
    },
    {
        "Barnes & Noble": "Barnes  &  Noble"
    },
    {
        " book signing in New York City. This signing was the largest such event held at that particular location in three years. He continued his book tour throughout 2014.          On November 5, 2013, MacLeod joined his Love Boat cast mates live on the CBS daytime show  The Talk . A full one-hour episode was dedicated to the cast reunion. The Talk co-hosts dressed in costumes to commemorate their special guests arrivals. ": null
    },
    {
        "Spanish-American": "Spanish-American"
    },
    {
        " actress ": null
    },
    {
        "Charo": "Charo"
    },
    {
        " also appeared on the reunion show. Charo guest starred in eight episodes of The Love Boat. ": null
    },
    {
        "Jack Jones": "Jack Jones"
    },
    {
        " performed the Love Boat theme song, which he introduced in 1977.      In December 2013, MacLeod appeared on  The 700 Club  to discuss his life and career.     On February 1, 2014, MacLeod was honored with a star on the ": null
    },
    {
        "Palm Springs Walk of Stars": "Palm Springs Walk Of Stars"
    },
    {
        " in downtown ": null
    },
    {
        "Palm Springs": "Palm Springs, California"
    },
    {
        ", California.     In January 2015, MacLeod appeared in the ": null
    },
    {
        "Rose Parade": "Rose Parade"
    },
    {
        " along with several members of the original cast of The Love Boat.      In 2017, Gavin starred in the play “Happy Hour” at the Coachella Valley Repertory Theatre in Rancho Mirage, CA. He received a best acting award for his work on this project.       In 1987, following MacLeods conversion and remarriage, he and his wife, Patti, wrote about struggles with ": null
    },
    {
        "divorce": "Divorce"
    },
    {
        " and ": null
    },
    {
        "alcoholism": "Alcoholism"
    },
    {
        " in Back On Course: The Remarkable Story of a Divorce That Ended in Remarriage.     In 2013, MacLeod released his ": null
    },
    {
        "memoir": "Memoir"
    },
    {
        ",  This Is Your Captain Speaking: My Fantastic Voyage Through Hollywood, Faith & Life. The book recalls his upbringing in upstate New York during the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        ", as well as his life after more than fifty years in Hollywood. He said, ...all my living has been based on what other people have written...I hope it can help others, how I overcame and never gave up. There are so many lessons in life.  In the book, MacLeod recounts his stories as a young actor trying to make a name for himself in Hollywood, the lifelong friends he has made, his bout with alcoholism and divorce and his journey through faith and Christianity.       MacLeod married his current wife Patti in 1974. Both were previously divorced. The couple divorced in the 1980s, but were remarried in 1985. During the mid-1980s, MacLeod and Patti became ": null
    },
    {
        "Evangelical Protestants": "Christian Fundamentalism"
    },
    {
        " and credit their faith for bringing them back together.      During his time as the Captain on The Love Boat, MacLeod very selfishly divorced his wife Patti. She then spent the next three years seeking help from ": null
    },
    {
        "psychiatrists": "Psychiatrist"
    },
    {
        "on both the West and the East coasts. Then one day, his wife received a telephone call from Patti Lewis, first wife of ": null
    },
    {
        "Jerry Lewis": "Jerry Lewis"
    },
    {
        ", inviting her to a Christian prayer group which contained a number of famous actresses – they started to pray for Gavin. Gavin said, From that day, I started to think about her. Something told me to call Patti. I called Patti. I went back to see her the following Monday and things havent been the same since. MacLeod asked her what had happened. She then explained everything to him including that she had given her life to ": null
    },
    {
        "Jesus Christ": "Jesus Christ"
    },
    {
        ".      On September 20, 2009, MacLeod discussed his conversion to Christianity at The Rock Church in ": null
    },
    {
        "Anaheim": "Anaheim, California"
    },
    {
        ", California with further guest appearances in 2012.                         ": null
    }
]