[
    {
        "                A genetically modified organism  is any organism whose ": null
    },
    {
        "gene": "Gene"
    },
    {
        "tic material has been altered using ": null
    },
    {
        "genetic engineering techniques": "Genetic Engineering Techniques"
    },
    {
        ". The exact definition of a genetically modified organism and what constitutes ": null
    },
    {
        "genetic engineering": "Genetic Engineering"
    },
    {
        " varies, with the most common being an organism altered in a way that does not occur naturally by mating and/or natural ": null
    },
    {
        "recombination": "Recombination"
    },
    {
        " . A wide variety of organisms have been genetically modified , from animals to plants and microorganisms. Genes have been transferred ": null
    },
    {
        "within the same species": "Cisgenesis"
    },
    {
        ", across ": null
    },
    {
        "species": "Species"
    },
    {
        " and even across ": null
    },
    {
        "kingdoms": "Kingdom"
    },
    {
        ". New genes can be introduced, or ": null
    },
    {
        "endogenous genes": "Endogenous"
    },
    {
        " can be enhanced, altered or ": null
    },
    {
        "knocked out": "Gene Knockout"
    },
    {
        ".     Creating a genetically modified organism is a multi-step process. Genetic engineers must isolate the gene they wish to insert into the host organism and combine it with other genetic elements, including a ": null
    },
    {
        "promoter": "Promoter"
    },
    {
        " and ": null
    },
    {
        "terminator": "Terminator"
    },
    {
        " region and often a ": null
    },
    {
        "selectable marker": "Selectable Marker"
    },
    {
        ". A number of techniques are available for ": null
    },
    {
        "inserting the isolated gene into the host genome": "Gene Delivery"
    },
    {
        ". Recent advancements using ": null
    },
    {
        "genome editing": "Genome Editing"
    },
    {
        " techniques, notably ": null
    },
    {
        "CRISPR": "Crispr"
    },
    {
        ", have made the production of GMOs much simpler. ": null
    },
    {
        "Herbert Boyer": "Herbert Boyer"
    },
    {
        " and ": null
    },
    {
        "Stanley Cohen": "Stanley Norman Cohen"
    },
    {
        " made the first genetically modified organism in 1973, a bacteria resistant to the antibiotic ": null
    },
    {
        "kanamycin": "Kanamycin"
    },
    {
        ". The first ": null
    },
    {
        "genetically modified animal": "Genetically Modified Animal"
    },
    {
        ", a mouse, was created in 1974 by ": null
    },
    {
        "Rudolf Jaenisch": "Rudolf Jaenisch"
    },
    {
        ", and the first plant was produced in 1983. In 1994 the ": null
    },
    {
        "Flavr Savr": "Flavr Savr"
    },
    {
        " tomato was released, the first commercialized ": null
    },
    {
        "genetically modified food": "Genetically Modified Food"
    },
    {
        ". The first genetically modified animal to be commercialized was the ": null
    },
    {
        "GloFish": "Glofish"
    },
    {
        " and the first genetically modified animal to be approved for food use was the ": null
    },
    {
        "AquAdvantage salmon": "Aquadvantage Salmon"
    },
    {
        " in 2015.     Bacteria are the easiest organisms to engineer and have been used for research, food production, industrial protein purification , agriculture, and art. There is potential to use them for environmental, purposes or as medicine. Fungi have been engineered with much the same goals. Viruses play an important role as ": null
    },
    {
        "vectors": "Viral Vector"
    },
    {
        " for inserting genetic information into other organisms. This use is especially relevant to human ": null
    },
    {
        "gene therapy": "Gene Therapy"
    },
    {
        ". There are proposals to remove the ": null
    },
    {
        "virulent": "Virulence"
    },
    {
        " genes from viruses to create vaccines. Plants have been engineered for scientific research, to create new colors in plants, deliver vaccines and to create enhanced crops. ": null
    },
    {
        "Genetically modified crops": "Genetically Modified Crops"
    },
    {
        " are publicly the most controversial GMOs. The majority are engineered for herbicide tolerance or insect resistance. ": null
    },
    {
        "Golden rice": "Golden Rice"
    },
    {
        " has been engineered with three genes that increase its ": null
    },
    {
        "nutritional value": "Nutritional Value"
    },
    {
        ". Other prospects for GM crops are as ": null
    },
    {
        "bioreactors": "Bioreactor"
    },
    {
        " for the production of ": null
    },
    {
        "biopharmaceuticals": "Biopharmaceutical"
    },
    {
        ", biofuels or medicines.     Animals are generally much harder to transform and the vast majority are still at the research stage. Mammals are the best ": null
    },
    {
        "model organisms": "Model Organism"
    },
    {
        " for humans, making ones genetically engineered to resemble serious human diseases important to the discovery and development of treatments. Human proteins expressed in mammals are more likely to be similar to their natural counterparts than those expressed in plants or microorganisms. Livestock are modified with the intention of improving economically important traits such as growth-rate, quality of meat, milk composition, disease resistance and survival. ": null
    },
    {
        "Genetically modified fish": "Genetically Modified Fish"
    },
    {
        " are used for scientific research, as pets and as a food source. Genetic engineering has been proposed as a way to control mosquitos, a ": null
    },
    {
        "vector": "Vector"
    },
    {
        " for many deadly diseases. Although human gene therapy is still relatively new, it has been used to treat ": null
    },
    {
        "genetic disorders": "Genetic Disorder"
    },
    {
        " such as ": null
    },
    {
        "severe combined immunodeficiency": "Severe Combined Immunodeficiency"
    },
    {
        ", and ": null
    },
    {
        "Lebers congenital amaurosis": "Adeno Associated Virus And Gene Therapy Of The Human Retina"
    },
    {
        ".     Many objections have been raised over the development of GMOs, particularly their commercialization. Many of these involve GM crops and whether food produced from them is safe and what impact growing them will have on the environment. Other concerns are the objectivity and rigor of regulatory authorities, contamination of non-genetically modified food, control of the ": null
    },
    {
        "food supply": "Food Supply"
    },
    {
        ", ": null
    },
    {
        "patenting of life": "Biological Patent"
    },
    {
        " and the use of ": null
    },
    {
        "intellectual property": "Intellectual Property"
    },
    {
        " rights. Although there is a ": null
    },
    {
        "scientific consensus": "Scientific Consensus"
    },
    {
        " that currently available food derived from GM crops poses no greater risk to human health than conventional food, GM food safety is a leading issue with critics. ": null
    },
    {
        "Gene flow": "Gene Flow"
    },
    {
        ", impact on non-target organisms and escape are the major environmental concerns. Countries have adopted regulatory measures to deal with these concerns. There are differences in the regulation for the release of GMOs between countries, with some of the most marked differences occurring between the US and Europe. One of the key issues concerning regulators is whether GM food should be labeled and the status of gene edited organisms.       What constitutes a genetically modified organism is not always clear and can vary widely. At its broadest it can include anything that has had its genes altered, including by nature.   Taking a less broad view it can encompass every organism that has had its genes altered by humans, which would include all crops and livestock. In 1993 the  Encyclopedia Britannica  defined genetic engineering as any of a wide range of techniques ... among them ": null
    },
    {
        "artificial insemination": "Artificial Insemination"
    },
    {
        ", ": null
    },
    {
        "in vitro fertilization": "In Vitro Fertilization"
    },
    {
        " , ": null
    },
    {
        "sperm banks": "Sperm Bank"
    },
    {
        ", ": null
    },
    {
        "cloning": "Cloning"
    },
    {
        ", and gene manipulation.  The ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " included a similarly broad definition in early reviews, specifically mentioning GMOs being produced by ": null
    },
    {
        "selective breeding": "Selective Breeding"
    },
    {
        " and other means of artificial selection. Staff   The European Commission Directorate-General for Agriculture, Genetic engineering: The manipulation of an organisms genetic endowment by introducing or eliminating specific genes through modern molecular biology techniques. A broad definition of genetic engineering also includes selective breeding and other means of artificial selection. , Retrieved 5 November 2012 They later excluded traditional breeding, in vitro fertilization, induction of ": null
    },
    {
        "polyploidy": "Polyploidy"
    },
    {
        ", ": null
    },
    {
        "mutagenesis": "Mutagenesis"
    },
    {
        " and cell fusion techniques that do not use recombinant nucleic acids or a genetically modified organism in the process.      A narrower definition provided by the ": null
    },
    {
        "Food and Agriculture Organization": "Food And Agriculture Organization"
    },
    {
        ", the ": null
    },
    {
        "World Health Organization": "World Health Organization"
    },
    {
        " and the ": null
    },
    {
        "European Commission": "European Commission"
    },
    {
        " says that the organisms must be altered in a way that does not occur naturally by mating and/or natural ": null
    },
    {
        "recombination": "Recombination"
    },
    {
        " .    There are examples of crops that fit this definition, but are not normally considered GMOs.  For example, the grain crop ": null
    },
    {
        "triticale": "Triticale"
    },
    {
        " was fully developed in a laboratory in 1930 using various techniques to alter its genome.  The ": null
    },
    {
        "Cartagena Protocol on Biosafety": "Cartagena Protocol On Biosafety"
    },
    {
        " in 2000 used the synonym living modified organism  and defined it as any living organism that possesses a novel combination of genetic material obtained through the use of modern biotechnology. Secretariat of the Convention on Biological Diversity. Montreal: 2000. The Cartagena Protocol on Biosafety to the Convention on Biological Diversity. Modern biotechnology is further defined as In vitro nucleic acid techniques, including ": null
    },
    {
        "recombinant deoxyribonucleic acid": "Recombinant Dna"
    },
    {
        " and direct injection of nucleic acid into cells or organelles, or fusion of cells beyond the taxonomic family.      Genetically engineered organism can be considered a more precise term compared to GMO when describing organisms genomes that have been directly manipulated with biotechnology.  The term GMO originally was not typically used by scientists to describe genetically engineered organisms until after usage of GMO became common in popular media.  The ": null
    },
    {
        "United States Department of Agriculture": "United States Department Of Agriculture"
    },
    {
        " considers GMOs to be plants or animals with heritable changes introduced by genetic engineering or traditional methods, while GEO specifically refers to organisms with genes introduced, eliminated, or rearranged using molecular biology, particularly ": null
    },
    {
        "recombinant DNA": "Recombinant Dna"
    },
    {
        " techniques, such as ": null
    },
    {
        "transgenesis": "Transgenesis"
    },
    {
        ".      The definitions focus on the process more than the product, which means there could be GMOS and non-GMOs with very similar genotypes and phenotypes.   This has led scientists to label it as a scientifically meaningless category,  saying that it is impossible to group all the different types of GMOs under one common definition.  It has also caused issues for ": null
    },
    {
        "organic": "Organic Food"
    },
    {
        " institutions and groups looking to ban GMOs.   It also poses problems as new processes are developed. The current definitions came in before ": null
    },
    {
        "genome editing": "Genome Editing"
    },
    {
        " became popular and there is some confusion as to whether they are GMOs. The EU has adjudged that they are  changing their GMO definition to include organisms obtained by mutagenesis .  In contrast the USDA has ruled that gene edited organisms are not considered GMOs.               Creating a genetically modified organism is a multi-step process. Genetic engineers must isolate the gene they wish to insert into the host organism. This gene can be taken from a ": null
    },
    {
        "cell": "Cell"
    },
    {
        "  or ": null
    },
    {
        "artificially synthesized": "Gene Synthesis"
    },
    {
        ".  If the chosen gene or the donor organisms ": null
    },
    {
        "genome": "Genome"
    },
    {
        " has been well studied it may already be accessible from a ": null
    },
    {
        "genetic library": "Library"
    },
    {
        ". The gene is then combined with other genetic elements, including a ": null
    },
    {
        "promoter": "Promoter"
    },
    {
        " and ": null
    },
    {
        "terminator": "Terminator"
    },
    {
        " region and a ": null
    },
    {
        "selectable marker": "Selectable Marker"
    },
    {
        ".      A number of techniques are available for ": null
    },
    {
        "inserting the isolated gene into the host genome": "Gene Delivery"
    },
    {
        ". Bacteria can be induced to take up foreign DNA, usually by exposed ": null
    },
    {
        "heat shock": "Heat Shock Response"
    },
    {
        " or ": null
    },
    {
        "electroporation": "Electroporation"
    },
    {
        ".  DNA is generally inserted into animal cells using ": null
    },
    {
        "microinjection": "Microinjection"
    },
    {
        ", where it can be injected through the cells ": null
    },
    {
        "nuclear envelope": "Nuclear Envelope"
    },
    {
        " directly into the ": null
    },
    {
        "nucleus": "Cell Nucleus"
    },
    {
        ", or through the use of ": null
    },
    {
        "viral vectors": "Viral Vectors"
    },
    {
        ".  In plants the DNA is often inserted using ": null
    },
    {
        "Agrobacterium-mediated recombination": "Agrobacteriumuses In Biotechnology"
    },
    {
        ",   ": null
    },
    {
        "biolistics": "Biolistics"
    },
    {
        "  or electroporation.     As only a single cell is transformed with genetic material, the organism must be ": null
    },
    {
        "regenerated": "Regeneration"
    },
    {
        " from that single cell. In plants this is accomplished through ": null
    },
    {
        "tissue c": "Plant Tissue Culture"
    },
    {
        "ulture": "Plant Tissue Culture"
    },
    {
        ".   In animals it is necessary to ensure that the inserted DNA is present in the ": null
    },
    {
        "embryonic stem cells": "Embryonic Stem Cells"
    },
    {
        ". Further testing using ": null
    },
    {
        "PCR": "Polymerase Chain Reaction"
    },
    {
        ", ": null
    },
    {
        "Southern hybridization": "Southern Hybridization"
    },
    {
        ", and ": null
    },
    {
        "DNA sequencing": "Dna Sequencing"
    },
    {
        " is conducted to confirm that an organism contains the new gene.      Traditionally the new genetic material was inserted randomly within the host genome. ": null
    },
    {
        "Gene targeting": "Gene Targeting"
    },
    {
        " techniques, which creates ": null
    },
    {
        "double-stranded breaks": "Double-Strand Breaks"
    },
    {
        " and takes advantage on the cells natural ": null
    },
    {
        "homologous recombination": "Homologous Recombination"
    },
    {
        " repair systems, have been developed to target insertion to exact ": null
    },
    {
        "locations": "Locus"
    },
    {
        ". ": null
    },
    {
        "Genome editing": "Genome Editing"
    },
    {
        " uses artificially engineered ": null
    },
    {
        "nucleases": "Nuclease"
    },
    {
        " that create breaks at specific points. There are four families of engineered nucleases: ": null
    },
    {
        "meganucleases": "Meganuclease"
    },
    {
        ",   ": null
    },
    {
        "zinc finger nucleases": "Zinc Finger Nuclease"
    },
    {
        ",   ": null
    },
    {
        "transcription activator-like effector nucleases": "Transcription Activator-Like Effector Nuclease"
    },
    {
        " ,   and the Cas9-guideRNA system .   TALEN and CRISPR are the two most commonly used and each has its own advantages.  TALENs have greater target specificity, while CRISPR is easier to design and more efficient.             Humans have ": null
    },
    {
        "domesticated": "Domestication"
    },
    {
        " plants and animals since around 12,000 BCE, using ": null
    },
    {
        "selective breeding": "Selective Breeding"
    },
    {
        " or artificial selection . Noel Kingsbury.  University of Chicago Press, 15 Oct 2009  The process of ": null
    },
    {
        "selective breeding": "Selective Breeding"
    },
    {
        ", in which organisms with desired ": null
    },
    {
        "traits": "Phenotypic Trait"
    },
    {
        "  are used to breed the next generation and organisms lacking the trait are not bred, is a precursor to the modern concept of genetic modification.     Various advancements in ": null
    },
    {
        "genetics": "Genetics"
    },
    {
        " allowed humans to directly alter the DNA and therefore genes of organisms. In 1972 ": null
    },
    {
        "Paul Berg": "Paul Berg"
    },
    {
        " created the first ": null
    },
    {
        "recombinant DNA": "Recombinant Dna"
    },
    {
        " molecule when he combined DNA from a monkey virus with that of the ": null
    },
    {
        "lambda virus": "Lambda Phage"
    },
    {
        ".       ": null
    },
    {
        "Herbert Boyer": "Herbert Boyer"
    },
    {
        " and ": null
    },
    {
        "Stanley Cohen": "Stanley Norman Cohen"
    },
    {
        " made the first genetically modified organism in 1973.  They took a gene from a bacterium that provided resistance to the antibiotic ": null
    },
    {
        "kanamycin": "Kanamycin"
    },
    {
        ", inserted it into a ": null
    },
    {
        "plasmid": "Plasmid"
    },
    {
        " and then induced other bacteria to incorporate the plasmid. The bacteria that had successfully incorporated the plasmid was then able to survive in the presence of kanamycin.  Boyer and Cohen expressed other genes in bacteria. This included genes from the toad  Xenopus laevis  in 1974, creating the first GMO expressing a gene from an organism of a different ": null
    },
    {
        "kingdom": "Kingdom"
    },
    {
        ".         In 1974 ": null
    },
    {
        "Rudolf Jaenisch": "Rudolf Jaenisch"
    },
    {
        " created a ": null
    },
    {
        "transgenic mouse": "Transgenic Mouse"
    },
    {
        " by introducing foreign DNA into its embryo, making it the worlds first transgenic animal. Jaenisch, R. and Mintz, B. Simian virus 40 DNA sequences in DNA of healthy adult mice derived from preimplantation blastocysts injected with viral DNA. Proc. Natl. Acad. 71: 1250–54   However it took another eight years before transgenic mice were developed that passed the ": null
    },
    {
        "transgene": "Transgene"
    },
    {
        " to their offspring.   Genetically modified mice were created in 1984 that carried cloned ": null
    },
    {
        "oncogenes": "Oncogenes"
    },
    {
        ", predisposing them to developing cancer.  Mice with ": null
    },
    {
        "genes removed": "Gene Knockout"
    },
    {
        "  were created in 1989. The first transgenic livestock were produced in 1985  and the first animal to synthesize transgenic proteins in their milk were mice in 1987.  The mice were engineered to produce human ": null
    },
    {
        "tissue plasminogen activator": "Tissue Plasminogen Activator"
    },
    {
        ", a protein involved in breaking down ": null
    },
    {
        "blood clots": "Blood Clots"
    },
    {
        ".      In 1983 the first ": null
    },
    {
        "genetically engineered plant": "Genetically Modified Plant"
    },
    {
        " was developed by ": null
    },
    {
        "Michael W. Bevan": "Michael W. Bevan"
    },
    {
        ", ": null
    },
    {
        "Richard B. Flavell": "Richard B. Flavell"
    },
    {
        " and ": null
    },
    {
        "Mary-Dell Chilton": "Mary-Dell Chilton"
    },
    {
        ". They infected tobacco with  Agrobacterium  ": null
    },
    {
        "transformed": "Transformation"
    },
    {
        " with an antibiotic resistance gene and through ": null
    },
    {
        "tissue culture": "Tissue Culture"
    },
    {
        " techniques were able to grow a new plant containing the resistance gene.  The ": null
    },
    {
        "gene gun": "Biolistic Particle Delivery System"
    },
    {
        " was invented in 1987, allowing transformation of plants not susceptible to Agrobacterium infection.  In 2000, ": null
    },
    {
        "Vitamin A": "Vitamin A"
    },
    {
        "-enriched ": null
    },
    {
        "golden rice": "Golden Rice"
    },
    {
        " was the first plant developed with increased nutrient value.     In 1976 ": null
    },
    {
        "Genentech": "Genentech"
    },
    {
        ", the first genetic engineering company was founded by Herbert Boyer and ": null
    },
    {
        "Robert Swanson": "Robert A. Swanson"
    },
    {
        "; a year later, the company produced a human protein  in  E.coli . Genentech announced the production of genetically engineered human ": null
    },
    {
        "insulin": "Insulin"
    },
    {
        " in 1978.  The insulin produced by bacteria, branded ": null
    },
    {
        "humulin": "Humulin"
    },
    {
        ", was approved for release by the ": null
    },
    {
        "Food and Drug Administration": "Food And Drug Administration"
    },
    {
        " in 1982.  In 1988 the first human antibodies were produced in plants.  In 1987, a strain of  Pseudomonas syringae  became the first genetically modified organism to be released into the environment BBC News 14 June 2002  when a strawberry and potato field in California were sprayed with it. Thomas H. Maugh II for the Los Angeles Times. 9 June 1987.      The first ": null
    },
    {
        "genetically modified crop": "Genetically Modified Crop"
    },
    {
        ", an antibiotic-resistant tobacco plant, was produced in 1982.  China was the first country to commercialize transgenic plants, introducing a virus-resistant tobacco in 1992.  In 1994 ": null
    },
    {
        "Calgene": "Calgene"
    },
    {
        " attained approval to commercially release the ": null
    },
    {
        "Flavr Savr": "Flavr Savr"
    },
    {
        " tomato, the first ": null
    },
    {
        "genetically modified food": "Genetically Modified Food"
    },
    {
        ".  Also in 1994, the European Union approved tobacco engineered to be resistant to the herbicide ": null
    },
    {
        "bromoxynil": "Bromoxynil"
    },
    {
        ", making it the first genetically engineered crop commercialized in Europe.  An insect resistant Potato was approved for release in the US in 1995,  Lawrence Journal-World. 6 May 1995 and by 1996 approval had been granted to commercially grow 8 transgenic crops and one flower crop in 6 countries plus the EU.      In 2010, scientists at the ": null
    },
    {
        "J. Craig Venter Institute": "J. Craig Venter Institute"
    },
    {
        " announced that they had created the first synthetic bacterial ": null
    },
    {
        "genome": "Genome"
    },
    {
        ". They named it ": null
    },
    {
        "Synthia": "Synthia"
    },
    {
        " and it was the worlds first ": null
    },
    {
        "synthetic life": "Synthetic Life"
    },
    {
        " form.       The first genetically modified animal to be commercialized was the ": null
    },
    {
        "GloFish": "Glofish"
    },
    {
        ", a ": null
    },
    {
        "Zebra fish": "Zebrafish"
    },
    {
        " with a ": null
    },
    {
        "fluorescent gene": "Fluorescent Protein"
    },
    {
        " added that allows it to glow in the dark under ": null
    },
    {
        "ultraviolet light": "Ultraviolet Light"
    },
    {
        ".  It was released to the US market in 2003.  In 2015 ": null
    },
    {
        "AquAdvantage salmon": "Aquadvantage Salmon"
    },
    {
        " became the first genetically modified animal to be approved for food use.  Approval is for fish raised in Panama and sold in the US. The salmon were transformed with a ": null
    },
    {
        "growth hormone": "Growth Hormone"
    },
    {
        "-regulating gene from a ": null
    },
    {
        "Pacific Chinook salmon": "Chinook Salmon"
    },
    {
        " and a promoter from an ": null
    },
    {
        "ocean pout": "Ocean Pout"
    },
    {
        " enabling it to grow year-round instead of only during spring and summer.                ": null
    },
    {
        "Bacteria": "Bacteria"
    },
    {
        " were the first organisms to be genetically modified in the laboratory, due to the relative ease of modifying their chromosomes.  This ease made them important tools for the creation of other GMOs. Genes and other genetic information from a wide range of organisms can be added to a ": null
    },
    {
        "plasmid": "Plasmid"
    },
    {
        " and inserted into bacteria for storage and modification. Bacteria are cheap, easy to grow, ": null
    },
    {
        "clonal": "Clone"
    },
    {
        ", multiply quickly and can be stored at & minus;80  °C almost indefinitely. Once a gene is isolated it can be stored inside the bacteria, providing an unlimited supply for research.  A large number of custom plasmids make manipulating DNA extracted from bacteria relatively easy.      Their ease of use has made them great tools for scientists looking to study gene function and ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        ". The simplest ": null
    },
    {
        "model organisms": "Model Organism"
    },
    {
        " come from bacteria, with most of our early understanding of ": null
    },
    {
        "molecular biology": "Molecular Biology"
    },
    {
        " coming from studying  Escherichia coli .  Scientists can easily manipulate and combine genes within the bacteria to create novel or disrupted proteins and observe the effect this has on various molecular systems. Researchers have combined the genes from bacteria and ": null
    },
    {
        "archaea": "Archaea"
    },
    {
        ", leading to insights on how these two diverged in the past.  In the field of ": null
    },
    {
        "synthetic biology": "Synthetic Biology"
    },
    {
        ", they have been used to test various synthetic approaches, from synthesising genomes to creating novel ": null
    },
    {
        "nucleotides": "Nucleotides"
    },
    {
        ".        Bacteria have been used in the production of food for a long time, and specific strains have been developed and selected for that work on an ": null
    },
    {
        "industrial": "Industry"
    },
    {
        " scale. They can be used to produce ": null
    },
    {
        "enzymes": "Enzyme"
    },
    {
        ", ": null
    },
    {
        "amino acids": "Amino Acid"
    },
    {
        ", ": null
    },
    {
        "flavourings": "Flavor"
    },
    {
        ", and other compounds used in food production. With the advent of genetic engineering, new genetic changes can easily be introduced into these bacteria. Most food-producing bacteria are ": null
    },
    {
        "lactic acid bacteria": "Lactic Acid Bacteria"
    },
    {
        ", and this is where the majority of research into genetically engineering food-producing bacteria has gone. The bacteria can be modified to operate more efficiently, reduce toxic byproduct production, increase output, create improved compounds, and remove unnecessary ": null
    },
    {
        "pathways": "Biological Pathway"
    },
    {
        ".  Food products from genetically modified bacteria include ": null
    },
    {
        "alpha-amylase": "Alpha-Amylase"
    },
    {
        ", which converts starch to simple sugars, ": null
    },
    {
        "chymosin": "Chymosin"
    },
    {
        ", which clots milk protein for cheese making, and ": null
    },
    {
        "pectinesterase": "Pectinesterase"
    },
    {
        ", which improves fruit juice clarity. Panesar, Pamit et al. Enzymes in Food Processing: Fundamentals and Potential Applications, Chapter 10, I K International Publishing House,  The majority are produced in the US and even though regulations are in place to allow production in Europe, as of 2015 no food products derived from bacteria are currently available there.      Genetically modified bacteria are used to produce large amounts of proteins for industrial use. Generally the bacteria are grown to a large volume before the gene encoding the protein is activated. The bacteria are then harvested and the desired protein purified from them.  The high cost of extraction and purification has meant that only high value products have been produced at an industrial scale.  The majority of these products are human proteins for use in medicine.  Many of these proteins are impossible or difficult to obtain via natural methods and they are less likely to be contaminated with pathogens, making them safer. The first medicinal use of GM bacteria was to produce the protein ": null
    },
    {
        "insulin": "Insulin"
    },
    {
        " to treat ": null
    },
    {
        "diabetes": "Diabetes"
    },
    {
        ".  Other medicines produced include ": null
    },
    {
        "clotting factors": "Coagulation"
    },
    {
        " to treat ": null
    },
    {
        "haemophilia": "Haemophilia"
    },
    {
        ",  ": null
    },
    {
        "human growth hormone": "Human Growth Hormone"
    },
    {
        " to treat various forms of ": null
    },
    {
        "dwarfism": "Dwarfism"
    },
    {
        ",   ": null
    },
    {
        "interferon": "Interferon"
    },
    {
        " to treat some cancers, ": null
    },
    {
        "erythropoietin": "Erythropoietin"
    },
    {
        " for anemic patients, and ": null
    },
    {
        "tissue plasminogen activator": "Tissue Plasminogen Activator"
    },
    {
        " which dissolves blood clots. Outside of medicine they have been used to produce ": null
    },
    {
        "biofuels": "Biofuel"
    },
    {
        ". Summers, Rebecca  New Scientist, Retrieved 27 April 2013 There is interest in developing an extracellular expression system within the bacteria to reduce costs and make the production of more products economical.     With greater understanding of the role that the ": null
    },
    {
        "microbiome": "Human Microbiota"
    },
    {
        " plays in human health, there is the potential to treat diseases by genetically altering the bacteria to, themselves, be therapeutic agents. Ideas include altering gut bacteria so they destroy harmful bacteria, or using bacteria to replace or increase deficient ": null
    },
    {
        "enzymes": "Enzymes"
    },
    {
        " or proteins. One research focus is to modify  Lactobacillus , bacteria that naturally provide some protection against ": null
    },
    {
        "HIV": "Hiv"
    },
    {
        ", with genes that will further enhance this protection. If the bacteria do not form ": null
    },
    {
        "colonies": "Bacterial Colony"
    },
    {
        " inside the patient, the person must repeatedly ingest the modified bacteria in order to get the required doses. Enabling the bacteria to form a colony could provide a more long-term solution, but could also raise safety concerns as interactions between bacteria and the human body are less well understood than with traditional drugs. There are concerns that ": null
    },
    {
        "horizontal gene transfer": "Horizontal Gene Transfer"
    },
    {
        " to other bacteria could have unknown effects. As of 2018 there are clinical trials underway testing the ": null
    },
    {
        "efficacy": "Efficacy"
    },
    {
        " and safety of these treatments.      For over a century bacteria have been used in agriculture. Crops have been ": null
    },
    {
        "inoculated": "Inoculation"
    },
    {
        " with ": null
    },
    {
        "Rhizobia": "Rhizobia"
    },
    {
        "  to increase their production or to allow them to be grown outside their original ": null
    },
    {
        "habitat": "Habitat"
    },
    {
        ". Application of  Bacillus thuringiensis  and other bacteria can help protect crops from insect infestation and plant diseases. With advances in genetic engineering, these bacteria have been manipulated for increased efficiency and expanded host range. Markers have also been added to aid in tracing the spread of the bacteria. The bacteria that naturally colonize certain crops have also been modified, in some cases to express the Bt genes responsible for pest resistance.  Pseudomonas  strains of bacteria cause frost damage by ": null
    },
    {
        "nucleating": "Nucleation"
    },
    {
        " water into ": null
    },
    {
        "ice crystals": "Ice Crystals"
    },
    {
        " around themselves. This led to the development of ": null
    },
    {
        "ice-minus bacteria": "Ice-Minus Bacteria"
    },
    {
        ", that have the ice-forming genes removed. When applied to crops they can compete with the non-modified bacteria and confer some frost resistance.         Other uses for genetically modified bacteria include ": null
    },
    {
        "bioremediation": "Bioremediation"
    },
    {
        ", where the bacteria are used to convert pollutants into a less toxic form. Genetic engineering can increase the levels of the enzymes used to degrade a toxin or to make the bacteria more stable under environmental conditions.  ": null
    },
    {
        "Bioart": "Bioart"
    },
    {
        " has also been created using genetically modified bacteria. In the 1980s artist ": null
    },
    {
        "Jon Davis": "Joe Davis"
    },
    {
        " and geneticist ": null
    },
    {
        "Dana Boyd": "Dana Boyd"
    },
    {
        " converted the Germanic symbol for femininity into binary code and then into a DNA sequence, which was then expressed in  Escherichia coli .  This was taken a step further in 2012, when a whole book was encoded onto DNA.  Paintings have also been produced using bacteria transformed with fluorescent proteins.          Viruses are often modified so they can be used as ": null
    },
    {
        "vectors": "Viral Vector"
    },
    {
        " for inserting genetic information into other organisms. This process is called ": null
    },
    {
        "transduction": "Transduction"
    },
    {
        " and if successful the recipient of the introduced DNA becomes a GMO. Different viruses have different efficiencies and capabilities. Researchers can use this to control for various factors; including the target location, insert size and duration of gene expression. Any dangerous sequences inherent in the virus must be removed, while those that allow the gene to be delivered effectively are retained.      While viral vectors can be used to insert DNA into almost any organism it is especially relevant for its potential in treating human disease. Although primarily still at trial stages,  there has been some successes using ": null
    },
    {
        "gene therapy": "Gene Therapy"
    },
    {
        " to replace defective genes. This is most evident in curing patients with ": null
    },
    {
        "severe combined immunodeficiency": "Severe Combined Immunodeficiency"
    },
    {
        " rising from ": null
    },
    {
        "adenosine deaminase deficiency": "Adenosine Deaminase Deficiency"
    },
    {
        " ,  although the development of ": null
    },
    {
        "leukemia": "Leukemia"
    },
    {
        " in some ADA-SCID patients  along with the death of ": null
    },
    {
        "Jesse Gelsinger": "Jesse Gelsinger"
    },
    {
        " in a 1999 trial set back the development of this approach for many years.  In 2009 another breakthrough was achieved when an eight-year-old boy with ": null
    },
    {
        "Lebers congenital amaurosis": "Lebers Congenital Amaurosis"
    },
    {
        " regained normal eyesight and in 2016 ": null
    },
    {
        "GlaxoSmithKline": "Glaxosmithkline"
    },
    {
        " gained approval to commercialize a gene therapy treatment for ADA-SCID. As of 2018, there are a substantial number of ": null
    },
    {
        "clinical trials": "Clinical Trial"
    },
    {
        " underway, including treatments for ": null
    },
    {
        "hemophilia": "Haemophilia"
    },
    {
        ", ": null
    },
    {
        "glioblastoma": "Glioblastoma"
    },
    {
        ", ": null
    },
    {
        "chronic granulomatous disease": "Chronic Granulomatous Disease"
    },
    {
        ", ": null
    },
    {
        "cystic fibrosis": "Cystic Fibrosis"
    },
    {
        " and various ": null
    },
    {
        "cancers": "Cancer"
    },
    {
        ".     The most common virus used for gene delivery come from ": null
    },
    {
        "adenoviruses": "Adenoviruses"
    },
    {
        " as they can carry up to 7.5 kb of foreign DNA and infect a relatively broad range of host cells, although they have been know to elicit immune responses in the host and only provide short term expression. Other common vectors are ": null
    },
    {
        "adeno-associated virus": "Adeno-Associated Virus"
    },
    {
        "es, which have lower toxicity and longer term expression, but can only carry about 4kb of DNA. ": null
    },
    {
        "Herpes simplex virus": "Herpes Simplex Virus"
    },
    {
        "es make promising vectors, having a carrying capacity of over 30kb and providing long term expression, although they are less efficient at gene delivery than other vectors.  The best vectors for long term integration of the gene into the host genome are ": null
    },
    {
        "retrovirus": "Retrovirus"
    },
    {
        "es, but their propensity for random integration is problematic. ": null
    },
    {
        "Lentivirus": "Lentivirus"
    },
    {
        "es are a part of the same family as retroviruses with the advantage of infecting both dividing and non-dividing cells, whereas retroviruses only target dividing cells. Other viruses that have been used as vectors include ": null
    },
    {
        "alphavirus": "Alphavirus"
    },
    {
        "es, ": null
    },
    {
        "flavivirus": "Flavivirus"
    },
    {
        "es, ": null
    },
    {
        "measles virus": "Measles Virus"
    },
    {
        "es, ": null
    },
    {
        "rhabdovirus": "Rhabdovirus"
    },
    {
        "es, ": null
    },
    {
        "Newcastle disease virus": "Newcastle Disease Virus"
    },
    {
        ", ": null
    },
    {
        "poxviruses": "Poxviruses"
    },
    {
        ", and ": null
    },
    {
        "picornavirus": "Picornavirus"
    },
    {
        "es.     Most ": null
    },
    {
        "vaccines": "Vaccine"
    },
    {
        " consist of viruses that have been ": null
    },
    {
        "attenuated": "Attenuated Vaccine"
    },
    {
        ", disabled, weakened or killed in some way so that their ": null
    },
    {
        "virulent": "Virulence"
    },
    {
        " properties are no longer effective. Genetic engineering could theoretically be used to create viruses with the virulent genes removed. This does not affect the viruses ": null
    },
    {
        "infectivity": "Infectivity"
    },
    {
        ", invokes a natural immune response and there is no chance that they will regain their virulence function, which can occur with some other vaccines. As such they are generally considered safer and more efficient than conventional vaccines, although concerns remain over non-target infection, potential side effects and ": null
    },
    {
        "horizontal gene transfer": "Horizontal Gene Transfer"
    },
    {
        " to other viruses.  Another potential approach is to use vectors to create novel vaccines for diseases that have no vaccines available or the vaccines that do not work effectively, such as ": null
    },
    {
        "AIDS": "Hiv/Aids"
    },
    {
        ", ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        ", and ": null
    },
    {
        "tuberculosis": "Tuberculosis"
    },
    {
        ". The most effective vaccine against Tuberculosis, the ": null
    },
    {
        "Bacillus Calmette–Guérin vaccine": "Bcg Vaccine"
    },
    {
        ", only provides partial protection. A modified vaccine expressing a M tuberculosis antigen is able to enhance BCG protection.  It has been shown to be safe to use at ": null
    },
    {
        "phase II trials": "Phase Ii Trials"
    },
    {
        ", although not as effective as initially hoped.  Other vector-based vaccines have already been approved and many more are being developed.      Another potential use of genetically modified viruses is to alter them so they can directly treat diseases. This can be through expression of protective proteins or by directly targeting infected cells. In 2004, researchers reported that a genetically modified virus that exploits the selfish behaviour of cancer cells might offer an alternative way of killing tumours.   Since then, several researchers have developed genetically modified ": null
    },
    {
        "oncolytic virus": "Oncolytic Virus"
    },
    {
        "es that show promise as treatments for various types of ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ".  Perett, Linda  National Cancer Institute, Benchmarks, Retrieved 5 September 2012  Beasley, Deena  Reuters Science, Retrieved 5 September 2012  In 2017 researchers genetically modified a virus to express spinach ": null
    },
    {
        "defensin": "Defensin"
    },
    {
        " proteins. The virus was injected into orange trees to combat ": null
    },
    {
        "citrus greening disease": "Citrus Greening Disease"
    },
    {
        " that had reduced orange production by 70% since 2005.      Natural viral diseases, such as ": null
    },
    {
        "myxomatosis": "Myxomatosis"
    },
    {
        " and ": null
    },
    {
        "rabbit haemorrhagic disease": "Rabbit Haemorrhagic Disease"
    },
    {
        ", have been used to help control pest populations. Over time the surviving pests become resistant, leading researchers to look at alternative methods. Genetically modified viruses that make the target animals infertile through ": null
    },
    {
        "immunocontraception": "Immunocontraception"
    },
    {
        " have been created in the laboratory  as well as others that target the developmental stage of the animal.  There are concerns with using this approach regarding virus containment and cross species infection.  Sometimes the same virus can be modified for contrasting purposes. Genetic modification of the ": null
    },
    {
        "myxoma virus": "Myxoma Virus"
    },
    {
        " has been proposed to conserve ": null
    },
    {
        "European wild rabbits": "European Rabbit"
    },
    {
        " in the ": null
    },
    {
        "Iberian peninsula": "Iberian Peninsula"
    },
    {
        " and to help regulate them in Australia. To protect the Iberian species from viral diseases, the myxoma virus was genetically modified to immunize the rabbits, while in Australia the same myxoma virus was genetically modified to lower fertility in the Australian rabbit population.      Outside of biology scientists have used a genetically modified virus to construct a ": null
    },
    {
        "lithium-ion battery": "Lithium-Ion Battery"
    },
    {
        " and other ": null
    },
    {
        "nanostructure": "Nanostructure"
    },
    {
        "d materials. It is possible to engineer ": null
    },
    {
        "bacteriophages": "Bacteriophage"
    },
    {
        " to express modified proteins on their surface and join them up in specific patterns . These structures have potential uses for energy storage and generation, ": null
    },
    {
        "biosensing": "Biosensing"
    },
    {
        " and tissue regeneration with some new materials currently produced including ": null
    },
    {
        "quantum dots": "Quantum Dot"
    },
    {
        ", ": null
    },
    {
        "liquid crystals": "Liquid Crystal"
    },
    {
        ", ": null
    },
    {
        "nanorings": "Nanoring"
    },
    {
        " and ": null
    },
    {
        "nanofibres": "Nanofiber"
    },
    {
        ".  The battery was made by engineering ": null
    },
    {
        "M13 bacteriaophages": "M13 Bacteriophage"
    },
    {
        " so they would coat themselves in ": null
    },
    {
        "iron phosphate": "Iron Phosphate"
    },
    {
        " and then assemble themselves along a ": null
    },
    {
        "carbon nanotube": "Carbon Nanotube"
    },
    {
        ". This created a highly conductive medium for use in a cathode, allowing energy to be transferred quickly. They could be constructed at lower temperatures with non-toxic chemicals, making them more environmentally friendly.        Fungi can be used for many of the same processes as bacteria. For industrial applications, yeasts combines the bacterial advantages of being a single celled organism that is easy to manipulate and grow with the advanced protein modifications found in ": null
    },
    {
        "eukaryotes": "Eukaryote"
    },
    {
        ". They can be used to produce large complex molecules for use in food, pharmaceuticals, hormones and steroids.  Yeast is important for wine production and as of 2016 two genetically modified yeasts involved in the fermentation of wine have been commercialized in the United States and Canada. One has increased ": null
    },
    {
        "malolactic fermentation": "Malolactic Fermentation"
    },
    {
        " efficiency, while the other prevents the production of dangerous ": null
    },
    {
        "ethyl carbamate": "Ethyl Carbamate"
    },
    {
        " compounds during fermentation. There have also been advances in the production of ": null
    },
    {
        "biofuel": "Biofuel"
    },
    {
        " from genetically modified fungi.      Fungi, being the most common ": null
    },
    {
        "pathogens": "Pathogen"
    },
    {
        " of insects, make attractive ": null
    },
    {
        "biopesticides": "Biopesticide"
    },
    {
        ". Unlike bacteria and viruses they have the advantage of infecting the insects by contact alone, although they are out competed in efficiency by ": null
    },
    {
        "chemical pesticides": "Chemical Pesticides"
    },
    {
        ". Genetic engineering can improve virulence, usually by adding more virulent proteins,  increasing infection rate or enhancing ": null
    },
    {
        "spore": "Spore"
    },
    {
        " persistence.  Many of the ": null
    },
    {
        "disease carrying vectors": "Vector"
    },
    {
        " are susceptible to ": null
    },
    {
        "entomopathogenic fungi": "Entomopathogenic Fungus"
    },
    {
        ". An attractive target for ": null
    },
    {
        "biological control": "Biological Pest Control"
    },
    {
        " are ": null
    },
    {
        "mosquitos": "Mosquito"
    },
    {
        ", vectors for a range of deadly diseases, including ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        ", ": null
    },
    {
        "yellow fever": "Yellow Fever"
    },
    {
        " and ": null
    },
    {
        "dengue fever": "Dengue Fever"
    },
    {
        ". Mosquitos can evolve quickly so it becomes a balancing act of killing them before the  Plasmodium  they carry becomes the infectious disease, but not so fast that they become ": null
    },
    {
        "resistant": "Disease Resistance"
    },
    {
        " to the fungi. By genetically engineering fungi like  Metarhizium anisopliae  and  Beauveria bassiana  to delay the development of mosquito infectiousness the ": null
    },
    {
        "selection pressure": "Selection Pressure"
    },
    {
        " to evolve resistance is reduced.  Another strategy is to add proteins to the fungi that block transmission of malaria or remove the Plasmodium altogether.      A mushroom has been ": null
    },
    {
        "gene edited": "Genome Editing"
    },
    {
        " to resist browning, giving it a longer ": null
    },
    {
        "shelf life": "Shelf Life"
    },
    {
        ". The process used ": null
    },
    {
        "CRISPR": "Crispr"
    },
    {
        " to ": null
    },
    {
        "knock out": "Gene Knockout"
    },
    {
        " a gene that encodes ": null
    },
    {
        "polyphenol oxidase": "Polyphenol Oxidase"
    },
    {
        ". As it didnt introduce any foreign DNA into the organism it was not deemed to be regulated under existing GMO frameworks and as such is the first CRISPR-edited organism to be approved for release.  This has intensified debates as to whether gene-edited organisms should be considered genetically modified organisms  and how they should be regulated.              Plants have been engineered for scientific research, to display new flower colors, deliver vaccines and to create enhanced crops. Many plants are ": null
    },
    {
        "pluripotent": "Pluripotent"
    },
    {
        ", meaning that a single cell from a mature plant can be harvested and under the right conditions can develop into a new plant. This ability can be taken advantage of by genetic engineers; by selecting for cells that have been successfully transformed in an adult plant a new plant can then be grown that contains the transgene in every cell through a process known as ": null
    },
    {
        "tissue culture": "Tissue Culture"
    },
    {
        ".      Much of the advances in the field of genetic engineering has come from experimentation with ": null
    },
    {
        "tobacco": "Nicotiana"
    },
    {
        ". Major advances in tissue culture and ": null
    },
    {
        "plant cell": "Plant Cell"
    },
    {
        "ular mechanisms for a wide range of plants has originated from systems developed in tobacco.  It was the first plant to be altered using genetic engineering and is considered a model organism for not only genetic engineering, but a range of other fields.  As such the transgenic tools and procedures are well established making tobacco one of the easiest plants to transform.  Another major model organism relevant to genetic engineering is  Arabidopsis thaliana . Its small genome and short life cycle makes it easy to manipulate and it contains many ": null
    },
    {
        "homologues": "Homology"
    },
    {
        " to important crop species.  It was the first plant ": null
    },
    {
        "sequenced": "Sequencing"
    },
    {
        ", has a host of online resources available and can be transformed by simply dipping a flower in a transformed Agrobacterium solution.      In research, plants are engineered to help discover the functions of certain genes. The simplest way to do this is to remove the gene and see what ": null
    },
    {
        "phenotype": "Phenotype"
    },
    {
        " develops compared to the ": null
    },
    {
        "wild type": "Wild Type"
    },
    {
        " form. Any differences are possibly the result of the missing gene. Unlike ": null
    },
    {
        "mutagenisis": "Mutagenesis"
    },
    {
        ", genetic engineering allows targeted removal without disrupting other genes in the organism. Some genes are only expressed in certain tissue, so reporter genes, like ": null
    },
    {
        "GUS": "Gus Reporter System"
    },
    {
        ", can be attached to the gene of interest allowing visualization of the location.  Other ways to test a gene is to alter it slightly and then return it to the plant and see if it still has the same effect on phenotype. Other strategies include attaching the gene to a strong ": null
    },
    {
        "promoter": "Promoter"
    },
    {
        " and see what happens when it is over expressed, forcing a gene to be expressed in a different location or at different ": null
    },
    {
        "developmental stages": "Developmental Biology"
    },
    {
        ".          Some genetically modified plants are purely ": null
    },
    {
        "ornamental": "Ornamental Plant"
    },
    {
        ". They are modified for flower color, fragrance, flower shape and plant architecture.  The first genetically modified ornamentals commercialized altered color.  ": null
    },
    {
        "Carnations": "Carnations"
    },
    {
        " were released in 1997, with the most popular genetically modified organism, a ": null
    },
    {
        "blue rose": "Blue Rose"
    },
    {
        "  created in 2004.  The roses are sold in Japan, the United States, and Canada.   Other genetically modified ornamentals include  Chrysanthemum  and  Petunia . As well as increasing aesthetic value there are plans to develop ornamentals that use less water or are resistant to the cold, which would allow them to be grown outside their natural environments.      It has been proposed to genetically modify some plant species threatened by extinction to be resistant to invasive plants and diseases, such as the ": null
    },
    {
        "emerald ash borer": "Emerald Ash Borer"
    },
    {
        " in North American and the fungal disease,  Ceratocystis platani , in European ": null
    },
    {
        "plane trees": "Platanus"
    },
    {
        ".  The ": null
    },
    {
        "papaya ringspot virus": "Papaya Ringspot Virus"
    },
    {
        " devastated papaya trees in Hawaii in the twentieth century until transgenic ": null
    },
    {
        "papaya": "Papaya"
    },
    {
        " plants were given pathogen-derived resistance.  However, genetic modification for conservation in plants remains mainly speculative. A unique concern is that a transgenic species may no longer bear enough resemblance to the original species to truly claim that the original species is being conserved. Instead, the transgenic species may be genetically different enough to be considered a new species, thus diminishing the conservation worth of genetic modification.               Genetically modified crops are genetically modified plants that are used in ": null
    },
    {
        "agriculture": "Agriculture"
    },
    {
        ". The first crops developed were used for animal or human food and provide resistance to certain pests, diseases, environmental conditions, spoilage or chemical treatments . The second generation of crops aimed to improve the quality, often by altering the ": null
    },
    {
        "nutrient profile": "Nutrient Profiling"
    },
    {
        ". Third generation genetically modified crops could be used for non-food purposes, including the production of ": null
    },
    {
        "pharmaceutical agents": "Plant Manufactured Pharmaceuticals"
    },
    {
        ", ": null
    },
    {
        "biofuels": "Biofuels"
    },
    {
        ", and other industrially useful goods, as well as for ": null
    },
    {
        "bioremediation": "Bioremediation"
    },
    {
        ".           There are three main aims to agricultural advancement; increased production, improved conditions for agricultural workers and ": null
    },
    {
        "sustainability": "Sustainability"
    },
    {
        ". GM crops contribute by improving harvests through reducing insect pressure, increasing nutrient value and tolerating different ": null
    },
    {
        "abiotic stress": "Abiotic Stress"
    },
    {
        "es. Despite this potential, as of 2018, the commercialized crops are limited mostly to ": null
    },
    {
        "cash crops": "Cash Crop"
    },
    {
        " like cotton, soybean, maize and canola and the vast majority of the introduced traits provide either herbicide tolerance or insect resistance. Soybeans accounted for half of all genetically modified crops planted in 2014.  Adoption by farmers has been rapid, between 1996 and 2013, the total surface area of land cultivated with GM crops increased by a factor of 100. ISAAA 2013 Annual Report  ISAAA Brief 46-2013, Retrieved 6 August 2014 Geographically though the spread has been uneven, with strong growth in the ": null
    },
    {
        "Americas": "Americas"
    },
    {
        " and parts of Asia and little in Europe and Africa. Its ": null
    },
    {
        "socioeconomic": "Socioeconomics"
    },
    {
        " spread has been more even, with approximately 54% of worldwide GM crops grown in ": null
    },
    {
        "developing countries": "Developing Country"
    },
    {
        " in 2013. Although doubts have been raised,  most studies have found growing GM crops to be beneficial to farmers through decreased pesticide use as well as increased crop yield and farm profit.        The majority of GM crops have been modified to be resistant to selected herbicides, usually a ": null
    },
    {
        "glyphosate": "Glyphosate"
    },
    {
        " or ": null
    },
    {
        "glufosinate": "Glufosinate"
    },
    {
        " based one. Genetically modified crops engineered to resist herbicides are now more available than conventionally bred resistant varieties;  in the USA 93% of soybeans and most of the GM maize grown is glyphosate tolerant.  Most currently available genes used to engineer insect resistance come from the  Bacillus thuringiensis  bacterium and code for ": null
    },
    {
        "delta endotoxins": "Delta Endotoxin"
    },
    {
        ". A few use the genes that encode for ": null
    },
    {
        "vegetative insecticidal proteins": "Vegetative Insecticidal Protein"
    },
    {
        ".  The only gene commercially used to provide insect protection that does not originate from B. thuringiensis is the ": null
    },
    {
        "Cowpea": "Cowpea"
    },
    {
        " trypsin inhibitor": "Trypsin Inhibitor"
    },
    {
        " . CpTI was first approved for use cotton in 1999 and is currently undergoing trials in rice.   Less than one percent of GM crops contained other traits, which include providing virus resistance, delaying senescence and altering the plants composition.      ": null
    },
    {
        "Golden rice": "Golden Rice"
    },
    {
        " is the most well known GM crop that is aimed at increasing nutrient value. It has been engineered with three genes that ": null
    },
    {
        "biosynthesise": "Biosynthesis"
    },
    {
        " beta-carotene": "Beta-Carotene"
    },
    {
        ", a precursor of ": null
    },
    {
        "vitamin A": "Retinol"
    },
    {
        ", in the edible parts of rice.  It is intended to produce a fortified food to be grown and consumed in areas with a ": null
    },
    {
        "shortage of dietary vitamin A": "Vitamin A Deficiency"
    },
    {
        ",  a deficiency which each year is estimated to kill 670,000 children under the age of 5  and cause an additional 500,000 cases of irreversible childhood blindness.  The original golden rice produced 1.6μg/g of the ": null
    },
    {
        "carotenoids": "Carotenoid"
    },
    {
        ", with further development increasing this 23 times.  In 2018 it gained its first approvals for use as food.      Plants and plant cells have been genetically engineered for production of ": null
    },
    {
        "biopharmaceuticals": "Biopharmaceutical"
    },
    {
        " in ": null
    },
    {
        "bioreactors": "Bioreactors"
    },
    {
        ", a process known as ": null
    },
    {
        "pharming": "Pharming"
    },
    {
        ". Work has been done with ": null
    },
    {
        "duckweed": "Lemna"
    },
    {
        "  Lemna minor ,  the ": null
    },
    {
        "algae": "Algae"
    },
    {
        "  Chlamydomonas reinhardtii   PhysOrg, Retrieved 15 April 2013 and the ": null
    },
    {
        "moss": "Moss"
    },
    {
        "  Physcomitrella patens .   Biopharmaceuticals produced include ": null
    },
    {
        "cytokines": "Cytokine"
    },
    {
        ", ": null
    },
    {
        "hormones": "Hormone"
    },
    {
        ", ": null
    },
    {
        "antibodies": "Antibody"
    },
    {
        ", ": null
    },
    {
        "enzymes": "Enzyme"
    },
    {
        " and vaccines, most of which are accumulated in the plant seeds. Many drugs also contain natural plant ingredients and the pathways that lead to their production have been genetically altered or transferred to other plant species to produce greater volume.  Other options for bioreactors are ": null
    },
    {
        "biopolymers": "Biopolymer"
    },
    {
        "  and ": null
    },
    {
        "biofuels": "Biofuel"
    },
    {
        ".  Unlike bacteria, plants can ": null
    },
    {
        "modify the proteins post-translationally": "Post-Translational Modification"
    },
    {
        ", allowing them to make more complex molecules. They also pose less risk of being contaminated.  Therapeutics have been cultured in transgenic carrot and tobacco cells,  including a drug treatment for ": null
    },
    {
        "Gauchers disease": "Gauchers Disease"
    },
    {
        ". Gali Weinreb and Koby Yeshayahou for Globes 2 May 2012.       Vaccine production and storage has great potential in transgenic plants. Vaccines are expensive to produce, transport and administer, so having a system that could produce them locally would allow greater access to poorer and developing areas. As well as purifying vaccines expressed in plants it is also possible to produce edible vaccines in plants. Edible vaccines stimulate the ": null
    },
    {
        "immune system": "Immune System"
    },
    {
        " when ingested to protect against certain diseases. Being stored in plants reduces the long-term cost as they can be disseminated without the need for cold storage, dont need to be purified and have long term stability. Also being housed within plant cells provides some protection from the gut acids upon digestion. However the cost of developing, regulating and containing transgenic plants is high, leading to most current plant-based vaccine development being applied to ": null
    },
    {
        "veterinary medicine": "Veterinary Medicine"
    },
    {
        ", where the controls are not as strict.           The vast majority of genetically modified animals are at the research stage with the number close to entering the market remaining small.  As of 2018 only three genetically modified animals have been approved, all in the USA. A goat and a chicken have been engineered to produce medicines and a salmon that has increased growth.  Despite the differences and difficulties in modifying them, the end aims are much the same as for plants. GM animals are created for research purposes, production of industrial or therapeutic products, agricultural uses or improving their health. There is also a market for creating genetically modified pets. Rudinko, Larisa . Guidance for industry. USA: Center for veterinary medicine                  The process of genetically engineering mammals is slow, tedious, and expensive. However, new technologies are making genetic modifications easier and more precise. Murray, Joo . . Canada: Brainwaving The first transgenic mammals were produced by injecting viral DNA into embryos and then implanting the embryos in females.  The embryo would develop and it would be hoped that some of the genetic material would be incorporated into the reproductive cells. Then researchers would have to wait until the animal reached breeding age and then offspring would be screened for presence of the gene in every cell. The development of the ": null
    },
    {
        "CRISPR-Cas9 gene editing": "Crispr"
    },
    {
        " system as a cheap and fast way of directly modifying ": null
    },
    {
        "germ cells": "Germ Cell"
    },
    {
        ", effectively halving the amount of time needed to develop genetically modified mammals.           Mammals are the best models for human disease, making genetic engineered ones vital to the discovery and development of cures and treatments for many serious diseases. Knocking out genes responsible for ": null
    },
    {
        "human genetic disorders": "Human Genetic Disorder"
    },
    {
        " allows researchers to study the mechanism of the disease and to test possible cures. ": null
    },
    {
        "Genetically modified mice": "Genetically Modified Mouse"
    },
    {
        " have been the most common mammals used in ": null
    },
    {
        "biomedical research": "Biomedical Research"
    },
    {
        ", as they are cheap and easy to manipulate. Pigs are also a good target as they have a similar body size and anatomical features, ": null
    },
    {
        "physiology": "Physiology"
    },
    {
        ", ": null
    },
    {
        "pathophysiological": "Pathophysiology"
    },
    {
        " response and diet.  Nonhuman primates are the most similar model organisms to humans, but there is less public acceptance towards using them as research animals.  In 2009, scientists announced that they had successfully transferred a gene into a ": null
    },
    {
        "primate": "Primate"
    },
    {
        " species  for the first time.   Their first research target for these marmosets was ": null
    },
    {
        "Parkinsons disease": "Parkinsons Disease"
    },
    {
        ", but they were also considering ": null
    },
    {
        "amyotrophic lateral sclerosis": "Amyotrophic Lateral Sclerosis"
    },
    {
        " and ": null
    },
    {
        "Huntingtons disease": "Huntingtons Disease"
    },
    {
        ".      Human proteins expressed in mammals are more likely to be similar to their natural counterparts than those expressed in plants or microorganisms. Stable expression has been accomplished in sheep, pigs, rats and other animals. In 2009 the first human biological drug produced from such an animal, a ": null
    },
    {
        "goat": "Goat"
    },
    {
        ", was approved. The drug, ": null
    },
    {
        "ATryn": "Atryn"
    },
    {
        ", is an ": null
    },
    {
        "anticoagulant": "Anticoagulant"
    },
    {
        " which reduces the probability of ": null
    },
    {
        "blood clots": "Blood Clot"
    },
    {
        " during ": null
    },
    {
        "surgery": "Surgery"
    },
    {
        " or ": null
    },
    {
        "childbirth": "Childbirth"
    },
    {
        " and is extracted from the goats milk. Britt Erickson, 10 February 2009, for Chemical & Engineering News.  Accessed 6 October 2012 Human ": null
    },
    {
        "alpha-1-antitrypsin": "Alpha-1 Antitrypsin"
    },
    {
        " is another protein that has been produced from goats and is used in treating humans with this deficiency.  Another medicinal area is in creating pigs with greater capacity for ": null
    },
    {
        "human organ transplants": "Organ Transplantation"
    },
    {
        " . Pigs have been genetically modified so that their organs can no longer carry retroviruses  or have modifications to reduce the chance of rejection.   Pig lungs from genetically modified pigs are being considered for transplantation into humans.   There is even potential to create chimeric pigs that can carry human organs.      Livestock are modified with the intention of improving economically important traits such as growth-rate, quality of meat, milk composition, disease resistance and survival. Animals have been engineered to grow faster, be healthier  and resist diseases.  Modifications have also improved the wool production of sheep and udder health of cows. Goats have been genetically engineered to produce milk with strong spiderweb-like silk proteins in their milk.  A GM pig called ": null
    },
    {
        "Enviropig": "Enviropig"
    },
    {
        " was created with the capability of digesting plant ": null
    },
    {
        "phosphorus": "Phosphorus"
    },
    {
        " more efficiently than conventional pigs.   They could reduce water pollution since they excrete 30 to 70% less phosphorus in manure.  ": null
    },
    {
        "Dairy cows": "Dairy Cows"
    },
    {
        " have been genetically engineered to produce milk that would be the same as human breast milk.  This could potentially benefit mothers who cannot produce breast milk but want their children to have breast milk rather than formula.   Researchers have also developed a genetically engineered cow that produces allergy-free milk.           Scientists have genetically engineered several organisms, including some mammals, to include ": null
    },
    {
        "green fluorescent protein": "Green Fluorescent Protein"
    },
    {
        " , for research purposes.  GFP and other similar reporting genes allow easy visualization and localization of the products of the genetic modification.  Fluorescent pigs have been bred to study human organ transplants, regenerating ocular ": null
    },
    {
        "photoreceptor cells": "Photoreceptor Cell"
    },
    {
        ", and other topics.  In 2011 green-fluorescent cats were created to help find therapies for ": null
    },
    {
        "HIV/AIDS": "Hiv/Aids"
    },
    {
        " and other diseases  as ": null
    },
    {
        "feline immunodeficiency virus": "Feline Immunodeficiency Virus"
    },
    {
        " is related to ": null
    },
    {
        "HIV": "Hiv"
    },
    {
        ".      There have been suggestions that genetic engineering could be used to bring animals ": null
    },
    {
        "back from extinction": "De-Extinction"
    },
    {
        ". It involves changing the genome of a close living relative to resemble the extinct one and is currently being attempted with the ": null
    },
    {
        "passenger pigeon": "Passenger Pigeon"
    },
    {
        ".  Genes associated with the ": null
    },
    {
        "woolly mammoth": "Woolly Mammoth"
    },
    {
        " have been added to the genome of an ": null
    },
    {
        "African Elephant": "African Elephant"
    },
    {
        ", although the lead researcher says he has no intention of creating live elephants and transferring all the genes and reversing years of genetic evolution is a long way from being feasible.   It is more likely that scientists could use this technology to conserve endangered animals by bringing back lost diversity or transferring evolved genetic advantages from adapted organisms to those that are struggling.        ": null
    },
    {
        "Gene therapy": "Gene Therapy"
    },
    {
        "  uses genetically modified viruses to deliver genes which can cure disease in humans. Although gene therapy is still relatively new, it has had some successes. It has been used to treat ": null
    },
    {
        "genetic disorders": "Genetic Disorder"
    },
    {
        " such as ": null
    },
    {
        "severe combined immunodeficiency": "Severe Combined Immunodeficiency"
    },
    {
        ",  and ": null
    },
    {
        "Lebers congenital amaurosis": "Adeno Associated Virus And Gene Therapy Of The Human Retina"
    },
    {
        ".  Treatments are also being developed for a range of other currently incurable diseases, such as ": null
    },
    {
        "cystic fibrosis": "Cystic Fibrosis"
    },
    {
        ",  ": null
    },
    {
        "sickle cell anemia": "Sickle Cell Anemia"
    },
    {
        ",  ": null
    },
    {
        "Parkinsons disease": "Parkinsons Disease"
    },
    {
        ",  Gallaher, James  BBC News Health, 17 March 2011. Retrieved 24 April 2011 ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ",    ": null
    },
    {
        "diabetes": "Diabetes"
    },
    {
        ",  ": null
    },
    {
        "heart disease": "Heart Disease"
    },
    {
        "  and ": null
    },
    {
        "muscular dystrophy": "Muscular Dystrophy"
    },
    {
        ".  These treatments only effect ": null
    },
    {
        "somatic cells": "Somatic Cell"
    },
    {
        ", meaning any changes would not be inheritable. ": null
    },
    {
        "Germline": "Germline"
    },
    {
        " gene therapy results in any change being inheritable, which has raised concerns within the scientific community.       In 2015, CRISPR was used to edit the DNA of non-viable ": null
    },
    {
        "human embryos": "Human Embryos"
    },
    {
        ".   In November 2018, ": null
    },
    {
        "He Jiankui": "He Jiankui"
    },
    {
        " announced that he had ": null
    },
    {
        "edited the genomes": "Genome Editing"
    },
    {
        " of two human embryos, in an attempt to disable the  CCR5  gene, which codes for a receptor that HIV uses to enter cells. He said that twin girls, ": null
    },
    {
        "Lulu and Nana": "Lulu And Nana"
    },
    {
        ", had been born a few weeks earlier and that they carried functional copies of CCR5 along with disabled CCR5  and were still vulnerable to HIV. The work was widely condemned as unethical, dangerous, and premature.                Genetically modified fish are used for scientific research, as pets and as a food source. ": null
    },
    {
        "Aquaculture": "Aquaculture"
    },
    {
        " is a growing industry, currently providing over half the consumed fish worldwide.  Through genetic engineering it is possible to increase growth rates, reduce food intake, remove allergenic properties, increase cold tolerance and provide disease resistance. Fish can also be used to detect aquatic pollution or function as bioreactors.      Several groups have been developing ": null
    },
    {
        "zebrafish": "Zebrafish"
    },
    {
        " to detect pollution by attaching fluorescent proteins to genes activated by the presence of pollutants. The fish will then glow and can be used as environmental sensors.   The ": null
    },
    {
        "GloFish": "Glofish"
    },
    {
        " is a brand of genetically modified fluorescent ": null
    },
    {
        "zebrafish": "Zebrafish"
    },
    {
        " with bright red, green, and orange fluorescent color. It was originally developed by one of the groups to detect pollution, but is now part of the ornamental fish trade, becoming the first genetically modified animal to become publicly available as a pet when in 2003 it was introduced for sale in the USA.      GM fish are widely used in basic research in genetics and development. Two species of fish, zebrafish and ": null
    },
    {
        "medaka": "Oryzias Latipes"
    },
    {
        ", are most commonly modified because they have optically clear ": null
    },
    {
        "chorions": "Chorion"
    },
    {
        " , rapidly develop, and the one-cell embryo is easy to see and microinject with transgenic DNA.  Zebrafish are model organisms for developmental processes, ": null
    },
    {
        "regeneration": "Regeneration"
    },
    {
        ", genetics, behaviour, disease mechanisms and toxicity testing.  Their transparency allows researchers to observe developmental stages, intestinal functions and tumour growth.   The generation of transgenic protocols has increased the level of information gained by studying these fish.      GM fish have been developed with promoters driving an over-production of ": null
    },
    {
        "growth hormone": "Growth Hormone"
    },
    {
        " for use in the ": null
    },
    {
        "aquaculture": "Aquaculture"
    },
    {
        " industry to increase the speed of development and potentially reduce fishing pressure on wild stocks. This has resulted in dramatic growth enhancement in several species, including ": null
    },
    {
        "salmon": "Salmon"
    },
    {
        ",  ": null
    },
    {
        "trout": "Trout"
    },
    {
        "  and ": null
    },
    {
        "tilapia": "Tilapia"
    },
    {
        ".  ": null
    },
    {
        "AquaBounty Technologies": "Aquabounty Technologies"
    },
    {
        ", a biotechnology company, have produced a salmon  that can mature in half the time as wild salmon.  It obtained regulatory approval in 2015, the first non-plant GMO food to be commercialized.  As of August 2017, GMO salmon is being sold in Canada.  Sales in the US are expected to start in the second half of 2019.              In biological research, transgenic fruit flies  are ": null
    },
    {
        "model organisms": "Model Organism"
    },
    {
        " used to study the effects of genetic changes on development.  Fruit flies are often preferred over other animals due to their short life cycle and low maintenance requirements. They also have a relatively simple genome compared to many ": null
    },
    {
        "vertebrates": "Vertebrates"
    },
    {
        ", with typically only one copy of each gene, making ": null
    },
    {
        "phenotypic": "Phenotype"
    },
    {
        " analysis easy.  Drosophila have been used to study genetics and inheritance, embryonic development, learning, behavior, and aging.  The discovery of ": null
    },
    {
        "transposons": "Transposable Element"
    },
    {
        ", in particular the ": null
    },
    {
        "p-element": "P Element"
    },
    {
        ", in Drosophila provided an early method to add transgenes to their genome, although this has been taken over by more modern gene-editing techniques.      Due to their significance to human health, scientists are looking at ways to control mosquitoes through genetic engineering. Malaria-resistant mosquitoes have been developed in the laboratory by inserting a gene that reduces the development of the malaria parasite  and then use ": null
    },
    {
        "homing endonucleases": "Homing Endonuclease"
    },
    {
        " to rapidly spread that gene throughout the male population .   This approach has been taken further by using the gene drive to spread a lethal gene.   In trials the populations of  Aedes aegypti  mosquitoes, the single most important carrier of dengue fever and Zika virus, were reduced by between 80% and by 90%.  Staff  Oxitec Newsletter, March 2011. Retrieved 20 September 2011 Another approach is to use a ": null
    },
    {
        "sterile insect technique": "Sterile Insect Technique"
    },
    {
        ", whereby males genetically engineered to be sterile out compete viable males, to reduce population numbers.      Other insect pests that make attractive targets are ": null
    },
    {
        "moths": "Moth"
    },
    {
        ". ": null
    },
    {
        "Diamondback moths": "Diamondback Moth"
    },
    {
        " cause US$4 to $5 billion of damage each year worldwide.  The approach is similar to the sterile technique tested on mosquitoes, where males are transformed with a gene that prevents any females born from reaching maturity.  They underwent field trials in 2017. Genetically modified moths have previously been released in field trials.  In this case a strain of ": null
    },
    {
        "pink bollworm": "Pink Bollworm"
    },
    {
        " that were sterilized with radiation were genetically engineered to express a ": null
    },
    {
        "red fluorescent protein": "Green Fluorescent Protein"
    },
    {
        " making it easier for researchers to monitor them.      Silkworm, the larvae stage of  Bombyx mori , is an economically important insect in ": null
    },
    {
        "sericulture": "Sericulture"
    },
    {
        ". Scientists are developing strategies to enhance silk quality and quantity. There is also potential to use the silk producing machinery to make other valuable proteins.  Proteins currently developed to be expressed by silkworms include; ": null
    },
    {
        "human serum albumin": "Human Serum Albumin"
    },
    {
        ", ": null
    },
    {
        "human collagen α-chain": "Collagen Alpha-1 Chain"
    },
    {
        ", mouse ": null
    },
    {
        "monoclonal antibody": "Monoclonal Antibody"
    },
    {
        " and ": null
    },
    {
        "N-glycanase": "Ngly1"
    },
    {
        ".  Silkworms have been created that produce ": null
    },
    {
        "spider silk": "Spider Silk"
    },
    {
        ", a stronger but extremely difficult to harvest silk,  and even novel silks.           Systems have been developed to create transgenic organisms in a wide variety of other animals. Chickens have been genetically modified for a variety of purposes. This includes studying ": null
    },
    {
        "embryo development": "Embryo Development"
    },
    {
        ",  preventing the transmission of ": null
    },
    {
        "bird flu": "Bird-Flu"
    },
    {
        "  and providing evolutionary insights using ": null
    },
    {
        "reverse engineering": "Reverse Engineering"
    },
    {
        " to recreate dinosaur-like phenotypes.  A GM chicken that produces the drug ": null
    },
    {
        "Kanuma": "Kanuma"
    },
    {
        ", an enzyme that treats a rare condition, in its egg passed US regulatory approval in 2015.  Genetically modified frogs, in particular  Xenopus laevis  and  Xenopus tropicalis , are used in ": null
    },
    {
        "developmental biology": "Development"
    },
    {
        " research. GM frogs can also be used as pollution sensors, especially for ": null
    },
    {
        "endocrine disrupting chemicals": "Endocrine Disruptor"
    },
    {
        ".  There are proposals to use genetic engineering to control ": null
    },
    {
        "cane toads in Australia": "Cane Toads In Australia"
    },
    {
        ".       The ": null
    },
    {
        "nematode": "Nematode"
    },
    {
        "  Caenorhabditis elegans  is one of the major model organisms for researching ": null
    },
    {
        "molecular biology": "Molecular Biology"
    },
    {
        ".  ": null
    },
    {
        "RNA interference": "Rna Interference"
    },
    {
        " was discovered in C. elegans  and could be induced by simply feeding them bacteria modified to express ": null
    },
    {
        "double stranded RNA": "Double-Stranded Rna"
    },
    {
        ".  It is also relatively easy to produce stable transgenic nematodes and this along with RNAi are the major tools used in studying their genes.  The most common use of transgenic nematodes has been studying gene expression and localization by attaching reporter genes. Transgenes can also be combined with RNAi techniques to rescue phenotypes, study gene function, image cell development in real time or control expression for different tissues or developmental stages. Transgenic nematodes have been used to study viruses,  toxicology,  diseases,   and to detect environmental pollutants.           The gene responsible for ": null
    },
    {
        "albinism": "Albinism"
    },
    {
        " in ": null
    },
    {
        "sea cucumbers": "Sea Cucumber"
    },
    {
        " has been found and used to engineer ": null
    },
    {
        "white sea cucumbers": "White Sea Cucumber"
    },
    {
        ", a rare delicacy. The technology also opens the way to investigate the genes responsible for some of the cucumbers more unusual traits, including ": null
    },
    {
        "hibernating": "Hibernation"
    },
    {
        " in summer, ": null
    },
    {
        "eviscerating": "Evisceration"
    },
    {
        " their intestines, and dissolving their bodies upon death.  ": null
    },
    {
        "Flatworms": "Flatworm"
    },
    {
        " have the ability to regenerate themselves from a single cell.  Until 2017 there was no effective way to transform them, which hampered research. By using microinjection and radiation scientists have now created the first genetically modified flatworms.  The ": null
    },
    {
        "bristle worm": "Bristle Worm"
    },
    {
        ", a marine ": null
    },
    {
        "annelid": "Annelid"
    },
    {
        ", has been modified. It is of interest due to its reproductive cycle being synchronized with lunar phases, regeneration capacity and slow evolution rate.  ": null
    },
    {
        "Cnidaria": "Cnidarians"
    },
    {
        " such as  Hydra  and the sea anemone  Nematostella vectensis  are attractive model organisms to study the evolution of ": null
    },
    {
        "immunity": "Immunity"
    },
    {
        " and certain developmental processes.  Other animals that have been genetically modified include ": null
    },
    {
        "snails": "Snail"
    },
    {
        ",  ": null
    },
    {
        "geckos": "Gecko"
    },
    {
        ", ": null
    },
    {
        "turtles": "Turtle"
    },
    {
        ",  ": null
    },
    {
        "crayfish": "Crayfish"
    },
    {
        ", ": null
    },
    {
        "oysters": "Oyster"
    },
    {
        ", ": null
    },
    {
        "shrimp": "Shrimp"
    },
    {
        ", ": null
    },
    {
        "clams": "Clam"
    },
    {
        ", ": null
    },
    {
        "abalone": "Abalone"
    },
    {
        "  and ": null
    },
    {
        "sponges": "Sponge"
    },
    {
        ".           Genetically modified organisms are regulated by government agencies. This applies to research as well as the release of genetically modified organisms, including crops and food. The development of a regulatory framework concerning genetic engineering began in 1975, at ": null
    },
    {
        "Asilomar": "Asilomar Conference Grounds"
    },
    {
        ", California. The ": null
    },
    {
        "Asilomar meeting": "Asilomar Conference On Recombinant Dna"
    },
    {
        " recommended a set of guidelines regarding the cautious use of recombinant technology and any products resulting from that technology.  The ": null
    },
    {
        "Cartagena Protocol on Biosafety": "Cartagena Protocol On Biosafety"
    },
    {
        " was adopted on 29 January 2000 and entered into force on 11 September 2003.  It is an international treaty that governs the transfer, handling, and use of genetically modified organisms.  One hundred and fifty-seven countries are members of the Protocol and many use it as a reference point for their own regulations.      Universities and research institutes generally have a special committee that is responsible for approving any experiments that involve genetic engineering. Many experiments also need permission from a national regulatory group or legislation. All staff must be trained in the use of GMOs and all laboratories must gain approval from their regulatory agency to work with GMOs.  The legislation covering GMOs are often derived from regulations and guidelines in place for the non-GMO version of the organism, although they are more severe.  There is a near universal system for assessing the relative risks associated with GMOs and other agents to laboratory staff and the community. They are assigned to one of four risk categories based on their virulence, the severity of disease, the mode of transmission, and the availability of preventive measures or treatments. There are four ": null
    },
    {
        "biosafety levels": "Biosafety Level"
    },
    {
        " that a laboratory can fall into, ranging from level 1 to level 4 . Different countries use different nomenclature to describe the levels and can have different requirements for what can be done at each level.             There are differences in the regulation for the release of GMOs between countries, with some of the most marked differences occurring between the US and Europe.  Regulation varies in a given country depending on the intended use of the products of the genetic engineering. For example, a crop not intended for food use is generally not reviewed by authorities responsible for food safety.  Some nations have banned the release of GMOs or restricted their use, and others permit them with widely differing degrees of regulation.     In 2016 thirty eight countries officially ban or prohibit the cultivation of GMOs and nine ban their importation.  Most countries that do not allow GMO cultivation do permit research using GMOs.      The European Union differentiates between approval for cultivation within the EU and approval for import and processing.  While only a few GMOs have been approved for cultivation in the EU a number of GMOs have been approved for import and processing.  The cultivation of GMOs has triggered a debate about the market for GMOs in Europe.  Depending on the coexistence regulations, incentives for cultivation of GM crops differ.  The US policy does not focus on the process as much as other countries, looks at verifiable scientific risks and uses the concept of ": null
    },
    {
        "substantial equivalence": "Substantial Equivalence"
    },
    {
        ". Emily Marden, Risk and Regulation: U.S. Regulatory Policy on Genetically Modified Food and Agriculture, 44 B.C.L. Rev. 733  Whether gene edited organisms should be regulated the same as genetically modified organism is debated. USA regulations sees them as separate and does not regulate them under the same conditions, while in Europe a GMO is any organism created using genetic engineering techniques.      One of the key issues concerning regulators is whether GM products should be labeled. The ": null
    },
    {
        "European Commission": "European Commission"
    },
    {
        " says that mandatory labeling and traceability are needed to allow for informed choice, avoid potential ": null
    },
    {
        "false advertising": "False Advertising"
    },
    {
        "  and facilitate the withdrawal of products if adverse effects on health or the environment are discovered.  The ": null
    },
    {
        "American Medical Association": "American Medical Association"
    },
    {
        "  and the ": null
    },
    {
        "American Association for the Advancement of Science": "American Association For The Advancement Of Science"
    },
    {
        " American Association for the Advancement of Science , Board of Directors . , and associated   say that absent scientific evidence of harm even voluntary labeling is ": null
    },
    {
        "misleading": "Fear, Uncertainty And Doubt"
    },
    {
        " and will falsely alarm consumers. Labeling of GMO products in the marketplace is required in 64 countries.  Labeling can be mandatory up to a threshold GM content level or voluntary. In Canada and the US labeling of GM food is voluntary,  while in Europe all food  or ": null
    },
    {
        "feed": "Compound Feed"
    },
    {
        " which contains greater than 0.9% of approved GMOs must be labelled.  In 2014, sales of products that had been labeled as non-GMO grew 30 percent to $1.1 billion.             There is controversy over GMOs, especially with regard to their release outside laboratory environments. The dispute involves consumers, producers, biotechnology companies, governmental regulators, nongovernmental organizations, and scientists. Many of these concerns involve GM crops and whether food produced from them is safe and what impact growing them will have on the environment. These controversies have led to litigation, international trade disputes, and protests, and to restrictive regulation of commercial products in some countries.  Most concerns are around the health and environmental effects of GMOs. These include whether they may provoke an ": null
    },
    {
        "allergic reaction": "Allergic Reaction"
    },
    {
        ", whether the transgenes could transfer to human cells and whether genes not approved for human consumption could ": null
    },
    {
        "outcross": "Outcrossing"
    },
    {
        " into the ": null
    },
    {
        "food supply": "Food Supply"
    },
    {
        ".            There is a ": null
    },
    {
        "scientific consensus": "Scientific Consensus"
    },
    {
        " that currently available food derived from GM crops poses no greater risk to human health than conventional food, but that each GM food needs to be tested on a case-by-case basis before introduction. Nonetheless, members of the public are much less likely than scientists to perceive GM foods as safe. The legal and regulatory status of GM foods varies by country, with some nations banning or restricting them, and others permitting them with widely differing degrees of regulation. ": null
    }
]