[
    {
        "      Spain  is a country located in southwestern ": null
    },
    {
        "Europe": "Europe"
    },
    {
        " occupying most of the ": null
    },
    {
        "Iberian Peninsula": "Iberian Peninsula"
    },
    {
        " and includes a small ": null
    },
    {
        "exclave": "Exclave"
    },
    {
        " inside France called ": null
    },
    {
        "Llívia": "Llívia"
    },
    {
        " as well as the ": null
    },
    {
        "Balearic Islands": "Balearic Islands"
    },
    {
        " in the Mediterranean, the ": null
    },
    {
        "Canary Islands": "Canary Islands"
    },
    {
        " in the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        "  off northwest Africa, and five ": null
    },
    {
        "places of sovereignty": "Plazas De Soberanía"
    },
    {
        "  on and off the coast of ": null
    },
    {
        "North Africa": "North Africa"
    },
    {
        "Ceuta": "Ceuta"
    },
    {
        ", ": null
    },
    {
        "Melilla": "Melilla"
    },
    {
        ", ": null
    },
    {
        "Islas Chafarinas": "Islas Chafarinas"
    },
    {
        ", ": null
    },
    {
        "Peñón de Alhucemas": "Peñón De Alhucemas"
    },
    {
        ", and ": null
    },
    {
        "Peñón de Vélez de la Gomera": "Peñón De Vélez De La Gomera"
    },
    {
        ".     The Spanish mainland is bordered to the south and east almost entirely by the ": null
    },
    {
        "Mediterranean Sea": "Mediterranean Sea"
    },
    {
        " ; to the north by ": null
    },
    {
        "France": "France"
    },
    {
        ", ": null
    },
    {
        "Andorra": "Andorra"
    },
    {
        ", and the ": null
    },
    {
        "Bay of Biscay": "Bay Of Biscay"
    },
    {
        "; and to the west by the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " and ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        ". With a land area of  in the Iberian peninsula,  Spain is the largest country in ": null
    },
    {
        "Southern Europe": "Southern Europe"
    },
    {
        ", the second largest country in ": null
    },
    {
        "Western Europe": "Western Europe"
    },
    {
        " and the fourth largest country in the European continent . It has an average altitude of 650 m.     Its total area including Spanish island territories is  of which  is land and  is water.  It has the 30th largest ": null
    },
    {
        "Exclusive Economic Zone": "Exclusive Economic Zone"
    },
    {
        " of . Spain lies between latitudes ": null
    },
    {
        "36°": "36Th Parallel North"
    },
    {
        " and ": null
    },
    {
        "44° N": "44Th Parallel North"
    },
    {
        ", and longitudes ": null
    },
    {
        "19° W": "19Th Meridian West"
    },
    {
        " and ": null
    },
    {
        "5° E": "5Th Meridian East"
    },
    {
        ". Its Atlantic coast is  long. The ": null
    },
    {
        "Pyrenees": "Pyrenees"
    },
    {
        " mountain range": "Mountain Range"
    },
    {
        ", extends  from the Mediterranean to the Bay of Biscay. In the extreme south of Spain lie the ": null
    },
    {
        "Straits of Gibraltar": "Straits Of Gibraltar"
    },
    {
        ", which separate the Iberian peninsula and the rest of Europe from Ceuta and ": null
    },
    {
        "Morocco": "Morocco"
    },
    {
        " in ": null
    },
    {
        "North Africa": "North Africa"
    },
    {
        ".                    Most of Spains boundaries are water: the Mediterranean Sea along the east from the French border down to ": null
    },
    {
        "Gibraltar": "Gibraltar"
    },
    {
        " and the ": null
    },
    {
        "Strait of Gibraltar": "Strait Of Gibraltar"
    },
    {
        ", which can be divided into the ": null
    },
    {
        "Balearic Sea": "Balearic Sea"
    },
    {
        " along the northern stretch, and the ": null
    },
    {
        "Alboran Sea": "Alboran Sea"
    },
    {
        " in the southern sector, and the Atlantic Ocean on the northwest and southwest . The Spanish autonomous cities of ": null
    },
    {
        "Ceuta": "Ceuta"
    },
    {
        " and ": null
    },
    {
        "Melilla": "Melilla"
    },
    {
        " are Spanish enclaves lying in mainland Africa in territory claimed by Morocco, are located on the coast of the Alboran Sea, with Ceuta at the very mouth of the Strait of Gibraltar, and Melilla closer to the border with Algeria. The ": null
    },
    {
        "Canary Islands": "Canary Islands"
    },
    {
        ", geographically and geologically part of the ": null
    },
    {
        "African continent": "African Continent"
    },
    {
        ", are washed by the Atlantic Ocean.     Spain also shares land boundaries with ": null
    },
    {
        "France": "France"
    },
    {
        " and ": null
    },
    {
        "Andorra": "Andorra"
    },
    {
        " along the ": null
    },
    {
        "Pyrenees": "Pyrenees"
    },
    {
        " in the northeast, with ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        " on the west, with the small British colonial Territory of ": null
    },
    {
        "Gibraltar": "Gibraltar"
    },
    {
        " near the southernmost tip, and with ": null
    },
    {
        "Morocco": "Morocco"
    },
    {
        " in its autonomous cities of ": null
    },
    {
        "Ceuta": "Ceuta"
    },
    {
        " and ": null
    },
    {
        "Melilla": "Melilla"
    },
    {
        ", and certain other small but uninhabited enclaves, mostly capes and small isles. The affiliation of Gibraltar has continued to be a contentious issue between Spain and ": null
    },
    {
        "Britain": "United Kingdom"
    },
    {
        ", whereas the sovereignty of Spains enclaves, or  plazas de soberanía , on the Mediterranean coast of ": null
    },
    {
        "Morocco": "Morocco"
    },
    {
        " is disputed by Morocco.     Spain also has a small ": null
    },
    {
        "exclave": "Exclave"
    },
    {
        " inside France called ": null
    },
    {
        "Llívia": "Llívia"
    },
    {
        ", which is a mountain village in the historical  comarca  of ": null
    },
    {
        "La Cerdanya": "La Cerdanya"
    },
    {
        ", forming part of the historical territories of ": null
    },
    {
        "Catalonia": "Catalonia"
    },
    {
        ".       The majority of Spains peninsular region consists of the ": null
    },
    {
        "Meseta Central": "Meseta Central"
    },
    {
        ", a highland plateau rimmed and dissected by mountain ranges. Other landforms include narrow coastal plains and some lowland river valleys, the most prominent of which is the Andalusian Plain in the southwest. The country can be divided into ten natural regions or subregions: the dominant Meseta Central, the ": null
    },
    {
        "Cantabrian Mountains": "Cantabrian Mountains"
    },
    {
        " and the northwest region, the  Ibérico  region, the Pyrenees, the  Penibético  region in the southeast, the ": null
    },
    {
        "Andalusia": "Andalusia"
    },
    {
        "n Plain, the ": null
    },
    {
        "Ebro": "Ebro"
    },
    {
        " Basin, the coastal plains, the ": null
    },
    {
        "Balearic Islands": "Balearic Islands"
    },
    {
        ", and the ": null
    },
    {
        "Canary Islands": "Canary Islands"
    },
    {
        ". These are commonly grouped into four types: the Meseta Central and associated mountains, other mountainous regions, lowland regions, and islands.          The Meseta Central is a vast plateau in the heart of ": null
    },
    {
        "peninsular Spain": "Peninsular Spain"
    },
    {
        ", which has elevations that range from 610 to 760  m. Rimmed by mountains, the Meseta Central slopes gently to the west and to the series of rivers that form some of the border with ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        ". The ": null
    },
    {
        "Sistema Central": "Sistema Central"
    },
    {
        ", described as the dorsal spine of the Meseta Central, divides the Meseta into northern and southern subregions, the former higher in elevation and smaller in area than the latter. The Sistema Central rims the capital city of ": null
    },
    {
        "Madrid": "Madrid"
    },
    {
        " with peaks that rise to over 2,400  m within the Madrid region. South-west of Madrid, the Sistema Central shows its highest peak, ": null
    },
    {
        "Pico Almanzor": "Pico Almanzor"
    },
    {
        ", of 2,592  m. The mountains of the Sistema Central, which continue westward into Portugal, display some glacial features; the highest of the peaks are snow-capped for most of the year. Despite their height, however, the mountain system does not create a major barrier between the northern and the southern portions of the Meseta Central because several passes permit road and railroad transportation to the northwest and the northeast.     The southern portion of the Meseta  is further divided by twin mountain ranges, the ": null
    },
    {
        "Montes de Toledo": "Montes De Toledo"
    },
    {
        " running to the east with the ": null
    },
    {
        "Sierra de Guadalupe": "Sierra De Guadalupe, Spain"
    },
    {
        ", to the west. Their peaks do not rise much higher than 1,500  m. With many easy passes, including those that connect the Meseta with the Andalusian Plain, the Montes de Toledo do not present an obstacle to transportation and communication. This chain of lower mountain ranges is separated from the Sistema Central to the north by the longest river in the Iberian Peninsula: the ": null
    },
    {
        "Tagus River": "Tagus River"
    },
    {
        ".        The mountain regions that rim the Meseta Central and are associated with it are the ": null
    },
    {
        "Sierra Morena": "Sierra Morena"
    },
    {
        ", the ": null
    },
    {
        "Cordillera Cantábrica": "Cantabrian Mountains"
    },
    {
        ", and the ": null
    },
    {
        "Sistema Ibérico": "Sistema Ibérico"
    },
    {
        ". Forming the southern edge of the Meseta Central, the Sierra Morena merges in the east with the southern extension of the Sistema Iberico and reaches westward along the northern edge of the Rio Guadalquivir valley to join the mountains in southern Portugal. The massif of the Sierra Morena extends northward to the ": null
    },
    {
        "Río Guadiana": "Guadiana"
    },
    {
        ", which separates it from the Sistema Central. Despite their relatively low elevations, seldom surpassing 1,300  m, the mountains of the Sierra Morena are rugged at their southern edge.     The Cordillera Cantábrica, a limestone formation, runs parallel to, and close to, the northern coast near the Bay of Biscay. Its highest points are the ": null
    },
    {
        "Picos de Europa": "Picos De Europa"
    },
    {
        ", surpassing 2,600  m. The Cordillera Cantábrica extends 182  km and abruptly drops 1,500  m some 30  km from the coast. To the west lie the hills of the northwest region and to the east the ": null
    },
    {
        "Basque mountains": "Basque Mountains"
    },
    {
        " that link them to the Pyrenees.     The Sistema Ibérico extends from the Cordillera Cantábrica southeastward and, close to the Mediterranean, spreads out from the ": null
    },
    {
        "Río Ebro": "Ebro"
    },
    {
        " to the ": null
    },
    {
        "Río Júcar": "Júcar"
    },
    {
        ". The barren, rugged slopes of this mountain range cover an area of close to 21,000 square kilometers. The mountains exceed 2,000  m in their northern region and reach a maximum height of over 2,300  m east of the headwaters of the Rio Duero. The extremely steep mountain slopes in this range are often cut by deep, narrow gorges.         The major lowland regions are the Andalusian Plain in the southwest, the Ebro Basin in the northeast, and the coastal plains. The Andalusian Plain is essentially a wide river valley through which the Río ": null
    },
    {
        "Guadalquivir": "Guadalquivir"
    },
    {
        " flows. The river broadens out along its course, reaching its widest point at the Golfo de Cadiz. The Andalusian Plain is bounded on the north by the Sierra Morena and on the south by the Sistema Penibético; it narrows to an apex in the east where these two mountain chains meet. The Ebro Basin is formed by the Río Ebro valley, contained by mountains on three sides—the Sistema Ibérico to the south and west, the Pyrenees to the north and east, and their coastal extensions paralleling the shore to the east. Minor low-lying river valleys close to the Portuguese border are located on the Tagus and the Río Guadiana.     The Coastal Plains regions are narrow strips between the coastal mountains and the seas. They are broadest along the Golfo de Cádiz, where the coastal plain adjoins the Andalusian Plain, and along the southern and central eastern coasts. The narrowest coastal plain runs along the Bay of Biscay, where the Cordillera Cantábrica ends close to shore.            The remaining regions of Spain are the ": null
    },
    {
        "Balearic": "Balearic Islands"
    },
    {
        " and the ": null
    },
    {
        "Canary Islands": "Canary Islands"
    },
    {
        ", the former located in the Mediterranean Sea and the latter in the Atlantic Ocean. The Balearic Islands, encompassing a total area of 5,000 square kilometers, lie 80 kilometers off Spains central eastern coast. The mountains that rise up above the Mediterranean Sea to form these islands are an extension of the Sistema Penibetico. The archipelagos highest points, which reach 1,400 meters, are in northwestern ": null
    },
    {
        "Mallorca": "Mallorca"
    },
    {
        ", close to the coast. The central portion of Majorca is a plain, bounded on the east and the southeast by broken hills.     The Canary Islands, ninety kilometers off the west coast of ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ", are of volcanic origin. The large central islands, ": null
    },
    {
        "Tenerife": "Tenerife"
    },
    {
        " and ": null
    },
    {
        "Gran Canaria": "Gran Canaria"
    },
    {
        ", have the highest peaks. ": null
    },
    {
        "Pico de Las Nieves": "Pico De Las Nieves"
    },
    {
        ", on Gran Canaria, rises to 1,949  meters, and the ": null
    },
    {
        "Teide": "Teide"
    },
    {
        ", on Tenerife, to 3,718  meters. Teide, a dormant ": null
    },
    {
        "volcano": "Volcano"
    },
    {
        ", is the highest peak of Spain and the third largest volcano in the world from its base.             Of the roughly 1,800 rivers and streams in Spain, only the ": null
    },
    {
        "Tagus": "Tagus"
    },
    {
        " is more than 960 kilometers long; all but 90 extend less than 96 kilometers. These shorter rivers carry small volumes of water on an irregular basis, and they have seasonally dry river beds; however, when they do flow, they often are swift and torrential. Most major rivers rise in the mountains rimming or dissecting the Meseta Central and flow westward across the plateau through ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        " to empty into the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        ". One significant exception is the river with the most abundant flow in Spain, the ": null
    },
    {
        "Ebro": "Ebro"
    },
    {
        ", which flows eastward to the ": null
    },
    {
        "Mediterranean": "Mediterranean"
    },
    {
        ". Rivers in the extreme northwest and in the narrow northern coastal plain drain directly into the Atlantic Ocean. The northwestern coastline is also truncated by rias, waterbodies similar to fjords.      The major rivers flowing westward through the Meseta Central include the ": null
    },
    {
        "Duero": "Duero"
    },
    {
        ", the ": null
    },
    {
        "Tagus": "Tagus"
    },
    {
        ", the ": null
    },
    {
        "Guadiana": "Guadiana"
    },
    {
        ", and the ": null
    },
    {
        "Guadalquivir": "Guadalquivir"
    },
    {
        ". The Rio Guadalquivir is one of the most significant rivers in Spain because it irrigates a fertile valley, thus creating a rich agricultural area, and because it is navigable inland, making Seville the only inland river port for ocean-going traffic in Spain. The major river in the northwest region is the ": null
    },
    {
        "Miño": "Minho River"
    },
    {
        ".       ": null
    },
    {
        "El Atazar Dam": "El Atazar Dam"
    },
    {
        " is a major dam built near ": null
    },
    {
        "Madrid": "Madrid"
    },
    {
        " to provide a water supply.          Certain Spanish regions can be considered vulnerable to both ": null
    },
    {
        "flooding": "Flooding"
    },
    {
        " and ": null
    },
    {
        "erosion": "Erosion"
    },
    {
        ".    15 October 1879, in Murcia, ": null
    },
    {
        "Santa Teresa flood": "Santa Teresa Flood"
    },
    {
        ".   13–15 October 1957, in Valencia, torrential rain results in ": null
    },
    {
        "a devastating flood": "1957 Valencia Flood"
    },
    {
        ", at least 81 people lost their lives. , ABC, 13 August 2007   In 1982, the river ": null
    },
    {
        "Jucar": "Jucar"
    },
    {
        "  broke the Tous Reservoir causing a flood that killed 30 people. , La Vanguardia, 21 October 1982, p1          ": null
    },
    {
        "Water stress": "Water Stress"
    },
    {
        " or water lack, poses the greatest threat in Spain. ": null
    },
    {
        "Water scarcity": "Water Scarcity"
    },
    {
        " is a significant issue in many regions throughout Spain and ": null
    },
    {
        "climate change": "Climate Change"
    },
    {
        " may aggravate the problem, with longer periods of ": null
    },
    {
        "dry weather": "Dry Weather"
    },
    {
        ". Supply problems regularly occur in the ": null
    },
    {
        "Jucar basin": "Jucar Basin"
    },
    {
        " during summer. In the ": null
    },
    {
        "Segura basin": "Segura Basin"
    },
    {
        ", water scarcity has resulted in an increase of the water prices by 30% for households. Overall, the regions in the south-east of Spain are particularly vulnerable to ": null
    },
    {
        "water shortage": "Water Shortage"
    },
    {
        "s. Furthermore, large areas of the Mediterranean are affected by ": null
    },
    {
        "saltwater intrusion": "Saltwater Intrusion"
    },
    {
        ".             Three main climatic zones can be separated, according to geographical situation and ": null
    },
    {
        "orographic": "Orography"
    },
    {
        " conditions:  Agencia Estatal de Meteorología © . Ministerio de Medio Ambiente y Medio Rural y Marino © . Instituto de Meteorologia de Portugal ©.        The ": null
    },
    {
        "Mediterranean climate": "Mediterranean Climate"
    },
    {
        ", characterized by dry and warm summers. According to the ": null
    },
    {
        "Köppen climate classification": "Köppen Climate Classification"
    },
    {
        ", it is dominant in the peninsula, with two varieties: Csa and Csb.   The ": null
    },
    {
        "semiarid": "Semiarid"
    },
    {
        " climate , located in the southeastern quarter of the country, especially in the region of ": null
    },
    {
        "Murcia": "Murcia"
    },
    {
        " and in the ": null
    },
    {
        "Ebro": "Ebro"
    },
    {
        " valley. In contrast with the Mediterranean climate, the dry season extends beyond the summer.   The ": null
    },
    {
        "oceanic climate": "Oceanic Climate"
    },
    {
        " , is located in the northern quarter of the country, especially in the regions of ": null
    },
    {
        "Basque Country": "Basque Country"
    },
    {
        ", ": null
    },
    {
        "Asturias": "Asturias"
    },
    {
        ", ": null
    },
    {
        "Cantabria": "Cantabria"
    },
    {
        " and partly ": null
    },
    {
        "Galicia": "Galicia"
    },
    {
        ". In contrary to the Mediterranean climate, winter and summer temperatures are influenced by the ocean.     Apart from these main types, other sub-types can be found, like the ": null
    },
    {
        "desertic climate": "Desertic Climate"
    },
    {
        " in parts of southeastern Spain, like in coastal ": null
    },
    {
        "Almería": "Almería"
    },
    {
        ". ": null
    },
    {
        "Humid continental": "Humid Continental"
    },
    {
        ", ": null
    },
    {
        "alpine": "Alpine Climate"
    },
    {
        " and ": null
    },
    {
        "tundra": "Tundra"
    },
    {
        " climates in the ": null
    },
    {
        "Pyrenees": "Pyrenees"
    },
    {
        " and ": null
    },
    {
        "Sierra Nevada": "Sierra Nevada"
    },
    {
        ", and a typical ": null
    },
    {
        "subtropical climate": "Subtropical Climate"
    },
    {
        " in the Canary Islands, varying from humid subtropical climates to ": null
    },
    {
        "desertic climates": "Desertic Climate"
    },
    {
        " in most of the islands, and a tropical ": null
    },
    {
        "hot semi-arid climate": "Hot Semi-Arid Climate"
    },
    {
        " in coastal parts, such as ": null
    },
    {
        "Tenerife": "Santa Cruz De Tenerife"
    },
    {
        " or ": null
    },
    {
        "Gran Canaria": "Las Palmas De Gran Canaria"
    },
    {
        ".           ": null
    },
    {
        "Madrid": "Madrid"
    },
    {
        " 3,300,000   ": null
    },
    {
        "Barcelona": "Barcelona"
    },
    {
        " 1,582,738   ": null
    },
    {
        "Valencia": "Valencia"
    },
    {
        " 797,654  ": null
    },
    {
        "Seville": "Seville"
    },
    {
        " 709,975   ": null
    },
    {
        "Zaragoza": "Zaragoza"
    },
    {
        " 626,081   ": null
    },
    {
        "Málaga": "Málaga"
    },
    {
        " 547,105   ": null
    },
    {
        "Murcia": "Murcia"
    },
    {
        " 447,200   ": null
    },
    {
        "Las Palmas": "Las Palmas"
    },
    {
        " 377,600   ": null
    },
    {
        "Palma": "Palma De Mallorca"
    },
    {
        " 367,277   ": null
    },
    {
        "Bilbao": "Bilbao"
    },
    {
        " 353,567   ": null
    },
    {
        "Valladolid": "Valladolid"
    },
    {
        " 321,143   ": null
    },
    {
        "Córdoba": "Córdoba, Spain"
    },
    {
        " 318,628   ": null
    },
    {
        "Alicante": "Alicante"
    },
    {
        " 305,911   ": null
    },
    {
        "Vigo": "Vigo"
    },
    {
        " 292,576   ": null
    },
    {
        "Gijón": "Gijón"
    },
    {
        " 270,875   ": null
    },
    {
        "Hospitalet de Llobregat": "Lhospitalet De Llobregat"
    },
    {
        " 246,415   ": null
    },
    {
        "A Coruña": "A Coruña"
    },
    {
        " 243,902   ": null
    },
    {
        "Granada": "Granada"
    },
    {
        " 237,663   ": null
    },
    {
        "Vitoria-Gasteiz": "Vitoria, Spain"
    },
    {
        " 223,257   ": null
    },
    {
        "Santa Cruz de Tenerife": "Santa Cruz De Tenerife"
    },
    {
        " 220,022   ": null
    },
    {
        "Badalona": "Badalona"
    },
    {
        " 214,440   ": null
    },
    {
        "Oviedo": "Oviedo"
    },
    {
        " 207,699   ": null
    },
    {
        "Elche": "Elche"
    },
    {
        " 207,163   ": null
    },
    {
        "Móstoles": "Móstoles"
    },
    {
        " 201,789   ": null
    },
    {
        "Terrassa": "Terrassa"
    },
    {
        " 200,000   ": null
    },
    {
        "Pamplona": "Pamplona"
    },
    {
        " 198,750                 The largest metropolitan areas, based on 2007 population, were:    ": null
    },
    {
        "Madrid": "Madrid"
    },
    {
        " 5,603,285   ": null
    },
    {
        "Barcelona": "Barcelona"
    },
    {
        " 4,667,136   ": null
    },
    {
        "Valencia": "Valencia"
    },
    {
        " 1,671,189   ": null
    },
    {
        "Sevilla": "Sevilla"
    },
    {
        " 1,294,081   ": null
    },
    {
        "Bilbao": "Bilbao"
    },
    {
        " 950,829   ": null
    },
    {
        "Málaga": "Málaga"
    },
    {
        " 897,563   ": null
    },
    {
        "Asturias": "Asturias"
    },
    {
        "  857,079   ": null
    },
    {
        "Alicante": "Alicante"
    },
    {
        "-": null
    },
    {
        "Elche": "Elche"
    },
    {
        " 748,565   ": null
    },
    {
        "Zaragoza": "Zaragoza"
    },
    {
        " 731,803   ": null
    },
    {
        "Vigo": "Vigo"
    },
    {
        " 662,412   ": null
    },
    {
        "Las Palmas": "Las Palmas"
    },
    {
        " 616,903   ": null
    },
    {
        "Bahía de Cádiz": "Bay Of Cádiz"
    },
    {
        "  615,494   ": null
    },
    {
        "Santa Cruz de Tenerife": "Santa Cruz De Tenerife"
    },
    {
        " 573,825   ": null
    },
    {
        "Murcia": "Murcia"
    },
    {
        " 563,272   ": null
    },
    {
        "Palma de Mallorca": "Palma De Mallorca"
    },
    {
        " 474,035   ": null
    },
    {
        "Granada": "Granada"
    },
    {
        " 472,638   ": null
    },
    {
        "San Sebastián": "San Sebastián"
    },
    {
        " 402,168   ": null
    },
    {
        "Tarragona": "Tarragona"
    },
    {
        " 406,042   ": null
    },
    {
        "A Coruña": "A Coruña"
    },
    {
        " 403,007   ": null
    },
    {
        "Valladolid": "Valladolid"
    },
    {
        " 400,400   ": null
    },
    {
        "Santander - Torrelavega": "Santander, Cantabria"
    },
    {
        " 391,480   ": null
    },
    {
        "Cordoba": "Córdoba, Spain"
    },
    {
        " 323,600   ": null
    },
    {
        "Pamplona": "Pamplona"
    },
    {
        " 309,631       Islander population:   ": null
    },
    {
        "Tenerife": "Tenerife"
    },
    {
        " 886,033   ": null
    },
    {
        "Mallorca": "Mallorca"
    },
    {
        " 846,210   ": null
    },
    {
        "Gran Canaria": "Gran Canaria"
    },
    {
        " 829,597   ": null
    },
    {
        "Lanzarote": "Lanzarote"
    },
    {
        " 132,366   ": null
    },
    {
        "Ibiza": "Ibiza"
    },
    {
        " 113,908   ": null
    },
    {
        "Fuerteventura": "Fuerteventura"
    },
    {
        " 94,386   ": null
    },
    {
        "Menorca": "Menorca"
    },
    {
        " 86,697   ": null
    },
    {
        "La Palma": "La Palma"
    },
    {
        " 85,933   ": null
    },
    {
        "La Gomera": "La Gomera"
    },
    {
        " 22,259   ": null
    },
    {
        "El Hierro": "El Hierro"
    },
    {
        " 10,558   ": null
    },
    {
        "Formentera": "Formentera"
    },
    {
        " 7,957   ": null
    },
    {
        "Arousa": "Illa De Arousa"
    },
    {
        " 4,889   ": null
    },
    {
        "La Graciosa": "La Graciosa"
    },
    {
        " 658   ": null
    },
    {
        "Tabarca": "Tabarca"
    },
    {
        " 105   ": null
    },
    {
        "Ons": "Ons"
    },
    {
        " 61          Natural resources:   ": null
    },
    {
        "coal": "Coal"
    },
    {
        ", ": null
    },
    {
        "lignite": "Lignite"
    },
    {
        ", ": null
    },
    {
        "iron ore": "Iron Ore"
    },
    {
        ", ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        ", ": null
    },
    {
        "mercury": "Mercury"
    },
    {
        ", ": null
    },
    {
        "pyrite": "Pyrite"
    },
    {
        "s, ": null
    },
    {
        "fluorspar": "Fluorspar"
    },
    {
        ", ": null
    },
    {
        "gypsum": "Gypsum"
    },
    {
        ", ": null
    },
    {
        "zinc": "Zinc"
    },
    {
        ", ": null
    },
    {
        "lead": "Lead"
    },
    {
        ", ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        ", ": null
    },
    {
        "copper": "Copper"
    },
    {
        ", ": null
    },
    {
        "kaolin": "Kaolin"
    },
    {
        ", ": null
    },
    {
        "potash": "Potash"
    },
    {
        ", ": null
    },
    {
        "sepiolite": "Sepiolite"
    },
    {
        ", ": null
    },
    {
        "hydropower": "Hydropower"
    },
    {
        ", arable land     Land use:   :Arable land: 27.18%   :Permanent crops: 9.85%   :Other: 62.97%     Irrigated land:   38,000  km 2     Total renewable water resources:   111.1 cubic metres     Freshwater withdrawal :   :total: 37.22 cu km/yr   :per capita: 864 cu m/yr       Natural hazards:   periodic ": null
    },
    {
        "drought": "Drought"
    },
    {
        "s, occasional flooding     Environment  – Current Issues:   :": null
    },
    {
        "Pollution of the Mediterranean Sea": "Pollution Of The Mediterranean Sea"
    },
    {
        " from raw ": null
    },
    {
        "sewage": "Sewage"
    },
    {
        " and effluents from the ": null
    },
    {
        "offshore": "Offshore Drilling"
    },
    {
        " production of oil and gas; ": null
    },
    {
        "water quality": "Water Quality"
    },
    {
        " and quantity nationwide; ": null
    },
    {
        "air pollution": "Air Pollution"
    },
    {
        "; ": null
    },
    {
        "deforestation": "Deforestation"
    },
    {
        "; ": null
    },
    {
        "desertification": "Desertification"
    },
    {
        "     Environment  – International Agreements:   :Party to: Air Pollution, Air Pollution-Nitrogen Oxides, Air Pollution-Sulphur 94, Air Pollution-": null
    },
    {
        "Volatile Organic Compounds": "Volatile Organic Compounds"
    },
    {
        ", ": null
    },
    {
        "Antarctic-Environmental Protocol": "Antarctic-Environmental Protocol"
    },
    {
        ", ": null
    },
    {
        "Antarctic Treaty": "Antarctic Treaty"
    },
    {
        ", Biodiversity, Climate Change, Climate Change-": null
    },
    {
        "Kyoto Protocol": "Kyoto Protocol"
    },
    {
        ", Desertification, Endangered Species, Environmental Modification, Hazardous Wastes, ": null
    },
    {
        "Law of the Sea": "Law Of The Sea"
    },
    {
        ", ": null
    },
    {
        "Marine Dumping": "Marine Dumping"
    },
    {
        ", Marine Life Conservation, Ozone Layer Protection, Ship Pollution, Tropical Timber 83, Tropical Timber 94, Wetlands, Whaling   :Signed, but not ratified: Air Pollution-Persistent Organic Pollutants       : Contiguous zone :    : Exclusive economic zone :  with    :Territorial sea: ": null
    }
]