[
    {
        "        Armenia": "Armenia"
    },
    {
        " is a landlocked country in the ": null
    },
    {
        "Transcaucasia": "Transcaucasia"
    },
    {
        " region, between the ": null
    },
    {
        "Black": "Black Sea"
    },
    {
        " and ": null
    },
    {
        "Caspian Seas": "Caspian Sea"
    },
    {
        ", bordered on the north and east by ": null
    },
    {
        "Georgia": "Georgia"
    },
    {
        " and ": null
    },
    {
        "Azerbaijan": "Azerbaijan"
    },
    {
        " and on the south and west by ": null
    },
    {
        "Iran": "Iran"
    },
    {
        " and ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        ".     The terrain is mostly mountainous and flat, with fast flowing rivers and few forests but with many trees. The climate is highland continental: hot summers and cold winters. The land rises to 4,090 m above sea-level at ": null
    },
    {
        "Mount Aragats": "Mount Aragats"
    },
    {
        ".          Armenia is located in southern Transcaucasia, the region southwest of ": null
    },
    {
        "Russia": "Russia"
    },
    {
        " between the ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        " and the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        ". Modern ": null
    },
    {
        "Armenia": "Armenia"
    },
    {
        " occupies part of historical Armenia, whose ancient centres were in the valley of the ": null
    },
    {
        "Araks River": "Araks River"
    },
    {
        " and the region around ": null
    },
    {
        "Lake Van": "Lake Van"
    },
    {
        " in Turkey. Armenia is bordered on the north by Georgia, on the east by ": null
    },
    {
        "Azerbaijan": "Azerbaijan"
    },
    {
        ", on the southwest by the ": null
    },
    {
        "Nagorno-Karabagh": "Nagorno-Karabagh"
    },
    {
        ", on the south by Iran, and on the west by Turkey.            Twenty-five million years ago, a geological upheaval pushed up the Earths crust to form the Armenian Plateau, creating the complex topography of modern Armenia. The Lesser Caucasus range extends through northern Armenia, runs southeast between ": null
    },
    {
        "Lake Sevan": "Lake Sevan"
    },
    {
        " and Azerbaijan, then passes roughly along the Armenian-Azerbaijani border to Iran. Thus situated, the mountains make travel from north to south difficult. Geological turmoil continues in the form of devastating earthquakes, which have plagued Armenia. In December 1988, the second largest city in the republic, Leninakan , was heavily damaged by a massive quake that killed more than 25,000 people.     About half of Armenias area of approximately  has an elevation of at least , and only 3% of the country lies below . The lowest points are in the valleys of the ": null
    },
    {
        "Araks River": "Aras"
    },
    {
        " and the ": null
    },
    {
        "Debed River": "Debed"
    },
    {
        " in the far north, which have elevations of , respectively. Elevations in the Lesser Caucasus vary between . To the southwest of the range is the Armenian Plateau, which slopes southwestward toward the Araks River on the Turkish border. The plateau is masked by intermediate mountain ranges and extinct volcanoes. The largest of these, ": null
    },
    {
        "Mount Aragats": "Mount Aragats"
    },
    {
        ",  high, is also the highest point in Armenia. Most of the population lives in the western and northwestern parts of the country, where the two major cities, ": null
    },
    {
        "Yerevan": "Yerevan"
    },
    {
        " and ": null
    },
    {
        "Gyumri": "Gyumri"
    },
    {
        ", are located.     The valleys of the Debed and ": null
    },
    {
        "Akstafa": "Aghstafa"
    },
    {
        " rivers form the chief routes into Armenia from the north as they pass through the mountains. ": null
    },
    {
        "Lake Sevan": "Lake Sevan"
    },
    {
        ",  across at its widest point and  long, is by far the largest lake. It lies  above sea level on the plateau and is  large.  Other main lakes are: ": null
    },
    {
        "Arpi": "Lake Arpi"
    },
    {
        ", , Sev, , ": null
    },
    {
        "Akna": "Lake Akna"
    },
    {
        " .     Terrain is most rugged in the extreme southeast, which is drained by the Bargushat River, and most moderate in the Araks River valley to the extreme southwest. Most of Armenia is drained by the ": null
    },
    {
        "Araks": "Araks"
    },
    {
        " or its tributary, the ": null
    },
    {
        "Hrazdan": "Hrazdan"
    },
    {
        ", which flows from Lake Sevan. The Araks forms most of Armenias border with Turkey and Iran while the ": null
    },
    {
        "Zangezur Mountains": "Zangezur Mountains"
    },
    {
        " form the border between Armenias southern ": null
    },
    {
        "province of Syunik": "Syunik Province"
    },
    {
        " and Azerbaijans adjacent Nakhchivan Autonomous Republic.               Temperatures in Armenia generally depend upon elevation. Mountain formations block the moderating climatic influences of the Mediterranean Sea and the Black Sea, creating wide seasonal variations with cold snowy winters, and warm to hot summers. On the Armenian Plateau, the mean midwinter temperature is  to , and the mean midsummer temperature is  to . Average precipitation ranges from  per year in the lower Araks River valley to  at the highest altitudes. Despite the harshness of winter in most parts , the fertility of the plateaus volcanic soil made Armenia one of the worlds earliest sites of agricultural activity.       Areatotal: 29,743  km²     :country comparison to the world: 143   land: 28,203  km²   water: 1,540  km²     Area comparative ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " comparative: about one third the size of ": null
    },
    {
        "Tasmania": "Tasmania"
    },
    {
        " Canada": "Canada"
    },
    {
        " comparative: greater than half the size of ": null
    },
    {
        "Nova Scotia": "Nova Scotia"
    },
    {
        " Turkey": "Turkey"
    },
    {
        " comparative: about a quarter smaller than the size of ": null
    },
    {
        "Konya Province": "Konya Province"
    },
    {
        ".   ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " comparative: about one third larger than ": null
    },
    {
        "Wales": "Wales"
    },
    {
        " United States": "United States"
    },
    {
        " comparative: slightly smaller than ": null
    },
    {
        "Maryland": "Maryland"
    },
    {
        " EU": "European Union"
    },
    {
        " comparative: slightly smaller than ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        "     Land boundariestotal: 1,570  km   border countries:   ": null
    },
    {
        "Azerbaijan": "Azerbaijan"
    },
    {
        " and ": null
    },
    {
        "Nagorno-Karabakh Republic": "Nagorno-Karabakh Republic"
    },
    {
        "-proper 566  km, ": null
    },
    {
        "Azerbaijan-Nakhchivan": "Nakhchivan Autonomous Republic"
    },
    {
        " exclave 221  km, ": null
    },
    {
        "Georgia": "Georgia"
    },
    {
        " 219  km, ": null
    },
    {
        "Iran": "Iran"
    },
    {
        " 44  km, ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        " 311  km     Coastline:   0  km     Elevation extremes:   lowest point: 375m   highest point: ": null
    },
    {
        "Mount Aragats": "Mount Aragats"
    },
    {
        " 4,090 m     Extreme points of Armenia:   North:   ": null
    },
    {
        "Tavush": "Tavush"
    },
    {
        "    South:   ": null
    },
    {
        "Syunik": "Syunik Province"
    },
    {
        "    West:   ": null
    },
    {
        "Shirak": "Shirak Province"
    },
    {
        "    East:   Syunik           Natural resources:   deposits of ": null
    },
    {
        "gold": "Gold"
    },
    {
        ", ": null
    },
    {
        "copper": "Copper"
    },
    {
        ", ": null
    },
    {
        "molybdenum": "Molybdenum"
    },
    {
        ", ": null
    },
    {
        "zinc": "Zinc"
    },
    {
        ", ": null
    },
    {
        "bauxite": "Bauxite"
    },
    {
        "     Land use:   arable land:4.456 km² , 15.8%   permanent crops: 1.9%   permanent pastures: 4.2%   forest : 11.2%   other: 31.2%     Irrigated land: 2.084  km²     Total renewable water resources:   7.77 m³ Armenia is considered to be a big water “supplier” in the Caspian basin; as a result, the country lacks water, especially in summer when the rate of evaporation exceeds the amount of precipitation. That is the main reason why since ancient times inhabitants have built water reservoirs and irrigation canals in the area. ": null
    },
    {
        "Lake Sevan": "Lake Sevan"
    },
    {
        " contains the largest amount of water in the country.     Freshwater withdrawal :   total: 2.86  km³/yr   per capita: 929.7 m³/yr          A broad public discussion of environmental problems began in the mid-1980s, when the first green groups formed in opposition to Yerevans intense industrial air pollution and to nuclear power generation in the wake of the 1986 reactor explosion at Chernobyl. Environmental issues helped form the basis of the nationalist independence movement when environmental demonstrations subsequently merged with those for other political causes in the late 1980s. By 1980 the infrequency of sightings of Mount Ararat, which looms about sixty kilometers across the closed Turkish border, became a symbol of worsening air pollution in Yerevan.     Pollution from toxic chemicals such as ": null
    },
    {
        "DDT": "Ddt"
    },
    {
        " has not helped the already poor soil quality in many parts of the country.     Armenia is trying to address its environmental problems. It has established a ": null
    },
    {
        "Ministry of Environment": "Ministry Of Environment"
    },
    {
        " and introduced taxes for air and water pollution and solid waste disposal, whose revenues are used for environmental protection activities. Armenia is interested in cooperating with members of the international community on environmental issues. Armenian Government is working toward closing the ": null
    },
    {
        "Armenian Nuclear Power Plant": "Armenian Nuclear Power Plant"
    }
]