[
    {
        "     The geography of Finland is characterized by its northern position, its ubiquitous landscapes of intermingled ": null
    },
    {
        "boreal forests": "Taiga"
    },
    {
        " and lakes, and its low population density. Finland can be divided into three areas: archipelagoes and coastal lowlands, a slightly higher ": null
    },
    {
        "central lake plateau": "Finnish Lakeland"
    },
    {
        " and uplands to north and northeast. Bordering the ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        ", ": null
    },
    {
        "Gulf of Bothnia": "Gulf Of Bothnia"
    },
    {
        ", and ": null
    },
    {
        "Gulf of Finland": "Gulf Of Finland"
    },
    {
        ", as well as ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ", ": null
    },
    {
        "Norway": "Norway"
    },
    {
        ", and ": null
    },
    {
        "Russia": "Russia"
    },
    {
        ", Finland is the northernmost country in the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ". Most of the population and agricultural resources are concentrated in the south. Northern and eastern Finland are sparsely populated containing vast wilderness areas. ": null
    },
    {
        "Taiga forest": "Taiga"
    },
    {
        " is the dominant vegetation type.          Finlands total area is . Of this area 10% is water, 69% forest, 8% cultivated land and 13% other. Finland is the eighth largest country in Europe after Russia, France, Ukraine, Spain, Sweden, Norway and Germany.     As a whole, the shape of Finlands boundaries resembles a figure of a one-armed human. In Finnish, parallels are drawn between the figure and the ": null
    },
    {
        "national personification": "National Personification"
    },
    {
        " of Finland – ": null
    },
    {
        "Finnish Maiden": "Finnish Maiden"
    },
    {
        "  – and the country as a whole can be referred in the Finnish language by her name. Even in official context the area around ": null
    },
    {
        "Enontekiö": "Enontekiö"
    },
    {
        " in northwestern part of the country between ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        " and ": null
    },
    {
        "Norway": "Norway"
    },
    {
        " can be referred to as the Arm . After the ": null
    },
    {
        "Continuation War": "Continuation War"
    },
    {
        " Finland lost major land areas to Russia in the ": null
    },
    {
        "Moscow Armistice": "Moscow Armistice"
    },
    {
        " of 1944, and the figure was said to have lost the other of her arms, as well as a ": null
    },
    {
        "hem": "Wiktionary:Hem"
    },
    {
        " of her skirt .               The ": null
    },
    {
        "bedrock": "Bedrock"
    },
    {
        " of Finland belong to the ": null
    },
    {
        "Baltic Shield": "Baltic Shield"
    },
    {
        " and was formed by a succession of ": null
    },
    {
        "orogenies": "Orogeny"
    },
    {
        " in ": null
    },
    {
        "Precambrian": "Precambrian"
    },
    {
        " time. The oldest rocks of Finland, those of ": null
    },
    {
        "Archean": "Archean"
    },
    {
        " age, are found in the east and north. These rocks are chiefly ": null
    },
    {
        "granitoids": "Granite"
    },
    {
        " and ": null
    },
    {
        "migmatitic": "Migmatite"
    },
    {
        " gneiss": "Gneiss"
    },
    {
        ". Rocks in central and western Finland originated or came to place during the ": null
    },
    {
        "Svecokarelian orogeny": "Svecofennian Orogeny"
    },
    {
        ". Following this last orogeny ": null
    },
    {
        "Rapakivi granites": "Rapakivi Granite"
    },
    {
        " intruded": "Intrusion"
    },
    {
        " various locations of Finland during the ": null
    },
    {
        "Mesoproterozoic": "Mesoproterozoic"
    },
    {
        " and ": null
    },
    {
        "Neoproterozoic": "Neoproterozoic"
    },
    {
        ", specially at ": null
    },
    {
        "Åland": "Åland"
    },
    {
        " and the southeast. So-called ": null
    },
    {
        "Jotnian sediments": "Jotnian"
    },
    {
        " occur usually together with Rapakivi granites.  The youngest rocks in Finland are those found in the northwestern arm which belong to ": null
    },
    {
        "Scandinavian Caledonides": "Scandinavian Caledonides"
    },
    {
        " that assembled in ": null
    },
    {
        "Paleozoic": "Paleozoic"
    },
    {
        " times. During the ": null
    },
    {
        "Caledonian orogeny": "Caledonian Orogeny"
    },
    {
        " Finland was likely a sunken ": null
    },
    {
        "foreland basin": "Foreland Basin"
    },
    {
        " covered by sediments, subsequent uplift and erosion would have eroded all of these sediments.           About one third of Finland lies below 100 m, and about two thirds lies under 200 m. Finland can be divided into three topographical areas; the coastal landscapes, the ": null
    },
    {
        "interior lake plateau": "Finnish Lakeland"
    },
    {
        " also known as Finnish lake district and ": null
    },
    {
        "Upland Finland": "Upland Finland"
    },
    {
        ".  The coastal landscapes are made up mostly of plains below 20 m. These plains tilt gently towards the sea so that where its irregularities surpasses sea-level groups is islands like the ": null
    },
    {
        "Kvarken Archipelago": "Norra Kvarken"
    },
    {
        " or the ": null
    },
    {
        "Åland Islands": "Åland Islands"
    },
    {
        " are found. Åland Islands is connected to the Finnish mainland by a shallow submarine plateau that does not exceed 20 m in depth.  Next to the ": null
    },
    {
        "Gulf of Bothnia": "Gulf Of Bothnia"
    },
    {
        " the landscape of Finland is extremely flat with height differences no larger than 50 m.  This region called the ": null
    },
    {
        "Ostrobothnian Plain": "Ostrobothnian Plain"
    },
    {
        " extends inland about 100  km and constitute the largest plain in the ": null
    },
    {
        "Nordic countries": "Nordic Countries"
    },
    {
        ".     The interior lake plateau is dominated by undulating hilly terrain with valley to top height differences of 100 or less and occasionally up to 200 m. Only the area around the lakes ": null
    },
    {
        "Pielinen": "Pielinen"
    },
    {
        " and ": null
    },
    {
        "Päijänne": "Lake Päijänne"
    },
    {
        " stand with a subtly more pronounced relief. The relief of the interior lake plateau bears some resemblance to the Swedish ": null
    },
    {
        "Norrland terrain": "Norrland Terrain"
    },
    {
        ". Upland Finland and areas higher than 200 m are found mostly in the north and east of the country. A limited number of hills and mountains exceed 500 m in height in these regions. ": null
    },
    {
        "Inselberg plains": "Inselberggeology"
    },
    {
        " are common in the northern half of the country.  In the far north hills reach 200 to 400 m and the landscape is a ": null
    },
    {
        "Förfjäll": "Fellförfjäll"
    },
    {
        " . Only the extreme northwest contain a more dramatic ": null
    },
    {
        "mountain landscape": "Scandinavian Mountains"
    },
    {
        ".      The subdued landscape of Finland is the result of protracted erosion that has leveled down ancient mountain massifs into near-flat landforms called ": null
    },
    {
        "peneplains": "Peneplain"
    },
    {
        ". The last major leveling event resulted in the formation of the ": null
    },
    {
        "Sub-Cambrian peneplain": "Sub-Cambrian Peneplain"
    },
    {
        " in ": null
    },
    {
        "Late Neoproterozoic": "Neoproterozoic"
    },
    {
        " time.  While Finland has remained very close to sea-level since the formation of this last peneplain some further relief was formed by a slight uplift resulting in the ": null
    },
    {
        "carving of valleys": "River Incision"
    },
    {
        " by rivers. The slight uplift does also means that at parts the uplifted peneplain can be traced as ": null
    },
    {
        "summit accordances": "Summit Accordance"
    },
    {
        ".  The ": null
    },
    {
        "Quaternary ice ages": "Quaternary Glaciation"
    },
    {
        " resulted in the erosion of weak rock and loose materials by glaciers. When the ice masses ": null
    },
    {
        "retreated": "Deglaciation"
    },
    {
        " eroded depressions turned into lakes.  ": null
    },
    {
        "Fractures": "Joint"
    },
    {
        " in Finlands bedrock were particularly affected by weathering and erosion, leaving as result trace straight sea and lake inlets.     Except a few rivers along the coasts most rivers in Finland drain at some stage into one or more lakes. The drainage basins drain into various directions. Much of Finland drain into the ": null
    },
    {
        "Gulf of Bothnia": "Gulf Of Bothnia"
    },
    {
        " including the countrys largest and longest rivers, ": null
    },
    {
        "Kokemäenjoki": "Kokemäenjoki"
    },
    {
        " and ": null
    },
    {
        "Kemijoki": "Kemijoki"
    },
    {
        " respectively. Finlands largest lake drain by ": null
    },
    {
        "Vuoksi River": "Vuoksi River"
    },
    {
        " into ": null
    },
    {
        "Lake Ladoga": "Lake Ladoga"
    },
    {
        " in Russia. Upland Finland in the east drain east across Russian ": null
    },
    {
        "Republic of Karelia": "Republic Of Karelia"
    },
    {
        " into the ": null
    },
    {
        "White Sea": "White Sea"
    },
    {
        ". In the northeast ": null
    },
    {
        "Lake Inari": "Lake Inari"
    },
    {
        " discharges by ": null
    },
    {
        "Paatsjoki": "Paatsjoki"
    },
    {
        " into ": null
    },
    {
        "Barents Sea": "Barents Sea"
    },
    {
        " in the Arctic.               The ": null
    },
    {
        "ice sheet": "Ice Sheet"
    },
    {
        " that covered Finland intermittently during the ": null
    },
    {
        "Quaternary": "Quaternary"
    },
    {
        " grew out from the ": null
    },
    {
        "Scandinavian Mountains": "Scandinavian Mountains"
    },
    {
        ".  During the last ": null
    },
    {
        "deglaciation": "Deglaciation"
    },
    {
        " the first parts of Finland to become ice-free, the southeastern coast, did so slightly prior to the ": null
    },
    {
        "Younger Dryas": "Younger Dryas"
    },
    {
        " cold-spell 12,700 years ": null
    },
    {
        "before present": "Before Present"
    },
    {
        " . The retreat of the ice cover occurred simultaneously from the north-east, the east and southeast. The retreat was fastest from the southeast resulting in the lower course of ": null
    },
    {
        "Tornio": "Torne"
    },
    {
        " being the last part of Finland to be deglaciated. Finally by 10,100 years BP the ice cover had all but left Finland to concentrate in Sweden and Norway before fading away.      As the ice sheet became thinner and retreated the land begun to rise by effect of ": null
    },
    {
        "isostacy": "Post-Glacial Rebound"
    },
    {
        ". Much of Finland was under water when the ice retreated and was gradually uplifted in a process that continues today.  Albeit not all areas were drowned at the same time it is estimated at time or another about 62% has been under water.  Depending on location in Finland the ancient shoreline reached different maximum heights. In southern Finland 150 to 160 m, in central Finland about 200 m and in eastern Finland up to 220 m.             Latitude is the principal influence on Finlands climate. Because of Finlands northern location, winter is the longest season. Only in the south coast is summer as long as winter. On the average, winter lasts from early December to mid March in the archipelago and the southwestern coast and from early October to early May in Lapland. This means that southern portions of the country are snow-covered about three to four months of the year and the northern, about seven months. The long winter causes about half of the annual  of precipitation in the north to fall as snow. Precipitation in the south amounts to about  annually. Like that of the north, it occurs all through the year, though not so much of it is snow.     The ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " to the west and the ": null
    },
    {
        "Eurasian continent": "Eurasia"
    },
    {
        " to the east interact to modify the climate of the country. The warm waters of the ": null
    },
    {
        "Gulf Stream": "Gulf Stream"
    },
    {
        " and the ": null
    },
    {
        "North Atlantic Drift Current": "North Atlantic Current"
    },
    {
        ", which warm Norway and Sweden, also warm Finland. Westerly winds bring the warm air currents into the Baltic areas and to the countrys shores, moderating winter temperatures, especially in the south. These winds, because of clouds associated with weather systems accompanying the westerlies, also decrease the amount of sunshine received during the summer. By contrast, the continental high pressure system situated over the Eurasian continent counteracts the maritime influences, occasionally causing severe winters and high temperatures in the summer.     The highest ever recorded temperature is  .  The lowest,  . The annual middle temperature is relatively high in the southwestern part of the country , with quite mild winters and warm summers, and low in the northeastern part of ": null
    },
    {
        "Lapland": "Lapland"
    },
    {
        " .     Temperature extremes for every month:           Extreme highs:   January:     February:     March:     April:     May:     June:     July:     August:      September:     October:     November:     December:       Extreme lows:   January:     February:     March:     April:     May:     June:     July:     August:     September:     October:     November:     December:            Area:   total:      land:      water:        Area – comparative:   slightly smaller than ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", ": null
    },
    {
        "Montana": "Montana"
    },
    {
        ", and ": null
    },
    {
        "Newfoundland and Labrador": "Newfoundland And Labrador"
    },
    {
        "     Land boundaries:   total:      border countries:   Norway , Sweden , Russia         Coastline:        Maritime claims:   Territorial sea:   ,  in the ": null
    },
    {
        "Gulf of Finland": "Gulf Of Finland"
    },
    {
        "; there is a stretch of international waters between Finnish and Estonian claims; ": null
    },
    {
        "Bogskär": "Bogskär"
    },
    {
        " has separate ": null
    },
    {
        "internal waters": "Internal Waters"
    },
    {
        " and 3 nmi of territorial waters   Contiguous zone:       Exclusive economic zone :   ; extends to continental shelf boundary with Sweden, Estonia, and Russia   Continental shelf:    depth or to the depth of exploitation     Elevation extremes:   lowest point:   ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        " 0  m   highest point:   ": null
    },
    {
        "Haltitunturi": "Haltitunturi"
    },
    {
        "           Natural resources:   timber, iron ore, copper, lead, zinc, chromite, nickel, gold, silver, limestone     Land use:   arable land:   7.40%   permanent crops:   0.01%   other:   92.59%     Irrigated land:   685.8  km²     Total renewable water resources:   110  km 3     Freshwater withdrawal :   total:   1.63  km 3 /yr   per capita:   308.9 m 3 /yr         Natural hazards:   Cold periods in winter pose a threat to the unprepared.     Environment – current issues:   air pollution from manufacturing and power plants contributing to acid rain ; water pollution from industrial wastes, agricultural chemicals; habitat loss threatens wildlife populations     Environment – international agreements:   party to:   Air Pollution, Air Pollution-Nitrogen Oxides, Air Pollution-Sulphur 85, Air Pollution-Sulphur 94, Air Pollution-Volatile Organic Compounds, Antarctic-Environmental Protocol, Antarctic Treaty, Biodiversity, Climate Change, Desertification, Endangered Species, Environmental Modification, Hazardous Wastes, Law of the Sea, Marine Dumping, Marine Life Conservation, Ozone Layer Protection, Ship Pollution, Tropical Timber 83, Tropical Timber 94, Wetlands, Whaling, Air Pollution–Persistent Organic Pollutants ,  Climate Change–Kyoto Protocol .          in size, and 57,000 of over .  /ref  ref  /ref ": null
    }
]