[
    {
        "               With an area of , ": null
    },
    {
        "Romania": "Romania"
    },
    {
        " is the twelfth-largest country in Europe. Located in ": null
    },
    {
        "Southeastern Europe": "Southeast Europe"
    },
    {
        ", bordering on the ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        ", the country is halfway between the equator and the ": null
    },
    {
        "North Pole": "North Pole"
    },
    {
        " and equidistant from the westernmost part of Europe—the ": null
    },
    {
        "Atlantic Coast": "Atlantic Ocean"
    },
    {
        "—and the most easterly—the ": null
    },
    {
        "Ural Mountains": "Ural Mountains"
    },
    {
        ". Romania has 3,195 kilometers of border. ": null
    },
    {
        "Republic of Moldova": "Republic Of Moldova"
    },
    {
        " and ": null
    },
    {
        "Ukraine": "Ukraine"
    },
    {
        " lie to the east, ": null
    },
    {
        "Bulgaria": "Bulgaria"
    },
    {
        " lies to the south, and ": null
    },
    {
        "Serbia": "Serbia"
    },
    {
        " and ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        " to the west. In the southeast, 245 kilometers of sea coastline provide an important outlet to the ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        " and the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        ".       Traditionally Romania is divided into several historic regions that no longer perform any administrative function:   ": null
    },
    {
        "Dobruja": "Dobruja"
    },
    {
        " is the easternmost region, extending from the northward course of the Danube to the shores of the Black Sea.     ": null
    },
    {
        "Moldavia": "Moldavia"
    },
    {
        " stretches from the ": null
    },
    {
        "Eastern Carpathians": "Eastern Carpathians"
    },
    {
        " to the ": null
    },
    {
        "Prut River": "Prut River"
    },
    {
        " on the Moldovan and Ukrainian border.     ": null
    },
    {
        "Wallachia": "Wallachia"
    },
    {
        " reaches south from the ": null
    },
    {
        "Transylvanian Alps": "Transylvanian Alps"
    },
    {
        " to the Bulgarian border and is divided by the ": null
    },
    {
        "Olt River": "Olt River"
    },
    {
        " into ": null
    },
    {
        "Oltenia": "Oltenia"
    },
    {
        " on the west and ": null
    },
    {
        "Muntenia": "Muntenia"
    },
    {
        " on the east. The Danube forms a natural border between Muntenia and Dobruja.     The west-central region, known as ": null
    },
    {
        "Transylvania": "Transylvania"
    },
    {
        ", is delimited by the arc of the Carpathians, which separates it from the ": null
    },
    {
        "Maramureș region": "Maramureș Region"
    },
    {
        " in the northwest; by the ": null
    },
    {
        "Crișana": "Crișana"
    },
    {
        " area, which borders Hungary in the west; and by the ": null
    },
    {
        "Banat": "Banat"
    },
    {
        " region of the southwest, which adjoins both ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        " and ": null
    },
    {
        "Serbia": "Serbia"
    },
    {
        ". It is these areas west of the Carpathians that contain the highest concentrations of the nations largest ethnic minorities—": null
    },
    {
        "Hungarians": "Hungarians In Romania"
    },
    {
        ", ": null
    },
    {
        "Germans": "Transylvanian Saxons"
    },
    {
        ", and ": null
    },
    {
        "Serbs": "Serbs"
    },
    {
        ".     Romanias exterior boundaries are a result of relatively recent events. At the outbreak of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ", the countrys territory included only the provinces of Walachia, Moldavia, and ": null
    },
    {
        "Dobruja": "Dobruja"
    },
    {
        ". This area, known as the Regat or the ": null
    },
    {
        "Old Kingdom": "Old Kingdom"
    },
    {
        ", came into being with the disintegration of the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " in the mid-nineteenth century. At the end of World War I, Romania acquired Transylvania and the Banat. Some of this territory was lost during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", but negotiations returned it to Romania. Although this acquisition united some 85 percent of the ": null
    },
    {
        "Romanian-speaking": "Romanian Language"
    },
    {
        " population of Eastern Europe into one nation, it left a considerable number of ethnic Hungarians under Romanian rule. Disputes between Hungary and Romania regarding this territory would surface regularly, as both considered the region part of their national heritage. Questions were also periodically raised as to the historical validity of the Soviet-Romanian border. ": null
    },
    {
        "Bukovina": "Bukovina"
    },
    {
        " and ": null
    },
    {
        "Bessarabia": "Bessarabia"
    },
    {
        ", former Romanian provinces where significant percentages of the population are Romanian-speaking, were part of the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " from the end of World War II to its dissolution, and subsequently part of the states of Ukraine and ": null
    },
    {
        "Moldova": "Moldova"
    },
    {
        ". Despite ongoing and potential disputes, however, since 1989 Romania has no territorial claims to make.     Romanias current administrative divisions include 41 counties and one city - Bucharest - with special status, see ": null
    },
    {
        "Administrative divisions of Romania": "Administrative Divisions Of Romania"
    },
    {
        ".                  Romanias natural landscape is almost evenly divided among ": null
    },
    {
        "mountains": "Mountain"
    },
    {
        " , ": null
    },
    {
        "plains": "Plain"
    },
    {
        " , and ": null
    },
    {
        "hills": "Hill"
    },
    {
        " . These varied relief forms spread rather symmetrically from the Carpathian Mountains, which reach elevations of more than 2,500 meters, to the Danube Delta, which is just a few meters above ": null
    },
    {
        "sea level": "Sea Level"
    },
    {
        ".        The arc of the Carpathians extends over 1,000 kilometers through the center of the country, covering an area of 71,000 square kilometers. These mountains are of low to medium altitude and are no wider than 100 kilometers. They are deeply fragmented by longitudinal and transverse valleys and crossed by several major rivers. These features and the fact that there are many summit passes—some at altitudes up to 2,256 meters—have made the Carpathians less of a barrier to movement than other European ranges. Another distinguishing feature is the many eroded platforms that provide tableland at relatively high altitudes. There are permanent settlements here at above 1,200 meters.     Romanias Carpathians are differentiated into three ranges: the ": null
    },
    {
        "Eastern Carpathians": "Eastern Carpathians"
    },
    {
        ", the ": null
    },
    {
        "Southern Carpathians": "Southern Carpathians"
    },
    {
        " or ": null
    },
    {
        "Transylvanian Alps": "Transylvanian Alps"
    },
    {
        ", and the ": null
    },
    {
        "Western Romanian Carpathians": "Western Romanian Carpathians"
    },
    {
        ". Each of these ranges has important distinguishing features. The Eastern Carpathians are composed of three parallel ridges that run from northwest to southeast. The westernmost ridge is an extinct volcanic range with many preserved cones and craters. The range has many large depressions, in the largest of which the city of ": null
    },
    {
        "Brașov": "Brașov"
    },
    {
        " is situated. Important ": null
    },
    {
        "mining": "Mining Industry Of Romania"
    },
    {
        " and industrial centers as well as agricultural areas are found within these depressions. The Eastern Carpathians are covered with forests—some 32 percent of the countrys woodlands are there. They also contain important ore deposits, including gold and silver, and their mineral water springs feed numerous health resorts.      The Southern Carpathians offer the highest peaks at ": null
    },
    {
        "Moldoveanu Peak": "Moldoveanu Peak"
    },
    {
        " and ": null
    },
    {
        "Negoiu": "Negoiu"
    },
    {
        " and more than 150 glacial lakes. They have large grassland areas and some woodlands but few large depressions and subsoil resources. At higher ": null
    },
    {
        "elevations": "Elevation"
    },
    {
        ", the wind and rain have turned the ": null
    },
    {
        "rocks": "Rock"
    },
    {
        " into spectacular figures such as the ": null
    },
    {
        "Sphinx": "Sphinx"
    },
    {
        " and  Babele .     The region was crisscrossed by an ancient network of trans-Carpathian roads, and vestiges of the old Roman Way are still visible. Numerous passes and the valleys of the Olt, Jiu, and Danube rivers provide routes for roads and railways through the mountains.     The Western Romanian Carpathians are the lowest of the three ranges and are fragmented by many deep structural depressions. They have historically functioned as gates, which allow easy passage but can be readily defended. The most famous of these is the ": null
    },
    {
        "Iron Gate": "Iron Gate"
    },
    {
        " on the Danube. The Western Romanian Carpathians are the most densely settled, and it is in the northernmost area of this range, the Apuseni Mountains, that permanent settlements can be found at the highest ": null
    },
    {
        "altitudes": "Altitude"
    },
    {
        ".     Enclosed within the great arc of the Carpathians lie the undulating plains and low hills of the ": null
    },
    {
        "Transylvanian Plateau": "Transylvanian Plateau"
    },
    {
        "—the largest tableland in the country and the center of Romania. This important agricultural region also contains large deposits of methane gas and salt. To the south and east of the Carpathians, the ": null
    },
    {
        "Sub-Carpathians": "Sub-Carpathians"
    },
    {
        " form a fringe of rolling terrain ranging from 396 to 1,006 meters in elevation. This terrain is matched in the west by the slightly lower ": null
    },
    {
        "Western Hills": "Western Hills"
    },
    {
        ". The symmetry of Romanias relief continues with the Getic Tableland to the south of the Sub-Carpathians, the ": null
    },
    {
        "Moldavian Tableland": "Moldavian Tableland"
    },
    {
        " in the east between the Sub-Carpathians and the Prut River, and the ": null
    },
    {
        "Dobrujan Tableland": "Dobrujan Tableland"
    },
    {
        " in the southeast between the Danube and the Black Sea. The Sub-Carpathians and the tableland areas provide good conditions for human settlement and are important areas for fruit growing, ": null
    },
    {
        "viticulture": "Viticulture"
    },
    {
        ", and other agricultural activity. They also contain large deposits of ": null
    },
    {
        "brown coal": "Lignite"
    },
    {
        " and ": null
    },
    {
        "natural gas": "Natural Gas"
    },
    {
        ".     Beyond the Carpathian foothills and tablelands, the plains spread south and west. In the southern parts of the country, the lower Danube Plain is divided by the ": null
    },
    {
        "Olt River": "Olt River"
    },
    {
        "; east of the river lies the ": null
    },
    {
        "Wallachian Plain": "Wallachian Plain"
    },
    {
        ", and to the west is the ": null
    },
    {
        "Oltenian or Western Plain": "Oltenian Plain"
    },
    {
        ". The land here is rich with ": null
    },
    {
        "chernozem": "Chernozem"
    },
    {
        "ic soils and forms Romanias most important farming region. Irrigation is widely used, and marshlands in the Danubes floodplain have been diked and drained to provide additional tillable land.     Romanias lowest land is found on the northern edge of the ": null
    },
    {
        "Dobruja": "Dobruja"
    },
    {
        " region in the ": null
    },
    {
        "Danube Delta": "Danube Delta"
    },
    {
        ". The delta is a triangular swampy area of marshes, floating reed islands, and sandbanks, where the Danube ends its trek of almost 3,000 kilometers and divides into three frayed branches before emptying into the Black Sea. The Danube Delta provides a large part of the countrys fish production, and its reeds are used to manufacture cellulose. The region also serves as a nature preserve for rare species of plant and animal life including migratory birds.                   After entering the country in the southwest at Bazias, the ": null
    },
    {
        "Danube": "Danube"
    },
    {
        " travels some 1,075 kilometers through or along Romanian territory, forming the southern frontier with Serbia and Bulgaria. Virtually all of the countrys rivers are tributaries of the Danube, either directly or indirectly, and by the time the Danubes course ends in the Black Sea, they account for nearly 40 percent of the total discharge. The most important of these rivers are the ": null
    },
    {
        "Mureș River": "Mureș River"
    },
    {
        ", the ": null
    },
    {
        "Olt River": "Olt River"
    },
    {
        ", the ": null
    },
    {
        "Prut": "Prut"
    },
    {
        ", the ": null
    },
    {
        "Siret River": "Siret River"
    },
    {
        ", the ": null
    },
    {
        "Ialomița River": "Ialomița River"
    },
    {
        ", the ": null
    },
    {
        "Someș River": "Someș River"
    },
    {
        ", and the ": null
    },
    {
        "Argeș River": "Argeș River"
    },
    {
        ". The ": null
    },
    {
        "Olt River": "Olt River"
    },
    {
        "  is the longest river that is fully within Romanias national borders.     Romanias rivers primarily flow east, west, and south from the central crown of the Carpathians. They are fed by rainfall and melting snow, which causes considerable fluctuation in discharge and occasionally catastrophic ": null
    },
    {
        "flooding": "Flood"
    },
    {
        ". In the east, river waters are collected by the Siret and the Prut. In the south, the rivers flow directly into the Danube, and in the west, waters are collected by the ": null
    },
    {
        "Tisza": "Tisza"
    },
    {
        " on Hungarian territory.     The Danube is by far Romanias most important river, not only for transportation, but also for the production of ": null
    },
    {
        "hydroelectric power": "Hydroelectricity"
    },
    {
        ". One of Europes largest hydroelectric stations is located at the ": null
    },
    {
        "Iron Gates": "Iron Gates"
    },
    {
        ", where the Danube surges through the Carpathian gorges. The Danube is an important water route for domestic ": null
    },
    {
        "shipping": "Freight Transport"
    },
    {
        ", as well as international trade. It is navigable for river vessels along its entire Romanian course and for seagoing ships as far as the port of ": null
    },
    {
        "Brăila": "Brăila"
    },
    {
        ". An obvious problem with the use of the Danube for inland transportation is its remoteness from most of the major industrial centers. Moreover, marshy banks and perennial flooding impede navigation in some areas.       There are over 3,500 lakes in Romania. ": null
    },
    {
        "Lake Razelm": "Lake Razelm"
    },
    {
        "  is the largest.             Because of its position on the southeastern portion of the ": null
    },
    {
        "European": "Europe"
    },
    {
        " continent, Romania has a climate that is transitional between temperate and continental. Climatic conditions are somewhat modified by the countrys varied relief. The Carpathians serve as a barrier to Atlantic ": null
    },
    {
        "air masses": "Air Mass"
    },
    {
        ", restricting their oceanic influences to the west and center of the country, where they make for milder winters and heavier ": null
    },
    {
        "rainfall": "Rain"
    },
    {
        ". The mountains also block the continental influences of the vast plain to the north in Ukraine, which bring frosty winters and less rain to the south and southeast. In the extreme southeast, Mediterranean influences offer a milder, maritime climate. The average annual temperature is  in the south and  in the north. In Bucharest, the temperature ranges from  in January to  in July, with average temperatures of  in January and  in July. Rainfall, although adequate throughout the country, decreases from west to east and from mountains to plains. Some mountainous areas receive more than  of precipitation each year. Annual ": null
    },
    {
        "precipitation": "Precipitation"
    },
    {
        " averages about  in central Transylvania,  at Iași in Moldavia, and only  at Constanța on the Black Sea.     Temperate; cold, cloudy ": null
    },
    {
        "winters": "Winter"
    },
    {
        " with frequent snow and fog; sunny summers with frequent showers and thunderstorms. Winters generally are from November to March. The ": null
    },
    {
        "springs": "Spring"
    },
    {
        " are short, occasionally turning right into summer. ": null
    },
    {
        "Summer": "Summer"
    },
    {
        " lasts from May to August. They have a prolonged ": null
    },
    {
        "Autumn": "Autumn"
    },
    {
        ", from September to November. The average January temperature is  and the average July temperature is .   Facts: Record High Temperature:  - August 10, 1951 South-Eastern Romania; Record Low Temperature:  - January 24, 1942       Southeastern ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ", bordering the ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        " and ": null
    },
    {
        "Danube": "Danube"
    },
    {
        ", with the ": null
    },
    {
        "Carpathian mountains": "Carpathian Mountains"
    },
    {
        " in its center. Controls most easily traversable land route between the ": null
    },
    {
        "Balkans": "Balkans"
    },
    {
        ", ": null
    },
    {
        "Moldova": "Moldova"
    },
    {
        " and ": null
    },
    {
        "Ukraine": "Ukraine"
    },
    {
        "     Geographic coordinates     ": null
    },
    {
        "Extreme points of Romania": "Extreme Points Of Romania"
    },
    {
        ", a village in ": null
    },
    {
        "Botoșani County": "Botoșani County"
    },
    {
        ", on the border with ": null
    },
    {
        "Ukraine": "Ukraine"
    },
    {
        ",  ": null
    },
    {
        "Zimnicea": "Zimnicea"
    },
    {
        ", a town in ": null
    },
    {
        "Teleorman County": "Teleorman County"
    },
    {
        ", on the border with ": null
    },
    {
        "Bulgaria": "Bulgaria"
    },
    {
        ",  ": null
    },
    {
        "Beba Veche": "Beba Veche, Timiș"
    },
    {
        ", a village in ": null
    },
    {
        "Timiș County": "Timiș County"
    },
    {
        ", on the border with ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        " and ": null
    },
    {
        "Serbia": "Serbia"
    },
    {
        ",  ": null
    },
    {
        "Sulina": "Sulina"
    },
    {
        ", a town in ": null
    },
    {
        "Tulcea County": "Tulcea County"
    },
    {
        ", on the ": null
    },
    {
        "Danube Delta": "Danube Delta"
    },
    {
        ",        total: 238,391  km²     land: 231,231  km²     water: 7,160  km²     Area - comparative: slightly larger than the US state of ": null
    },
    {
        "Minnesota": "Minnesota"
    },
    {
        ".       total: 3,149.9 km   border countries: ": null
    },
    {
        "Bulgaria": "Bulgaria"
    },
    {
        " 631 km , ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        " 448 km , ": null
    },
    {
        "Moldova": "Moldova"
    },
    {
        " 681 km , ": null
    },
    {
        "Serbia": "Serbia"
    },
    {
        " 546 km , and ": null
    },
    {
        "Ukraine": "Ukraine"
    },
    {
        " to the north and east for 649 km .    Maritime claims: ": null
    },
    {
        "Snake Island": "Snake Island"
    },
    {
        "  exclusive economic zone": "Exclusive Economic Zone"
    },
    {
        " with              Central ": null
    },
    {
        "Transylvanian Basin": "Transylvanian Plateau"
    },
    {
        " is separated from the ": null
    },
    {
        "Plain of Moldavia": "Plain Of Moldavia"
    },
    {
        " on the east by the ": null
    },
    {
        "Carpathian Mountains": "Carpathian Mountains"
    },
    {
        " and separated from the ": null
    },
    {
        "Wallachian Plain": "Wallachian Plain"
    },
    {
        " on the south by the ": null
    },
    {
        "Transylvanian Alps": "Transylvanian Alps"
    },
    {
        ".     Elevation extremes: ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        " 0 m   highest point: ": null
    },
    {
        "Moldoveanu Peak": "Moldoveanu Peak"
    },
    {
        " 2,544 m     Natural resources Land use: Irrigated land:      Natural hazards:   ": null
    },
    {
        "earthquakes": "List Of Earthquakes In Romania"
    },
    {
        " most severe in south and southwest; geologic structure and climate promote landslides         Environment - current issues: soil erosion and degradation; water pollution; air pollution in south from industrial effluents; contamination of Danube delta wetlands     Environment - international agreements:     party to: Air Pollution, Antarctic Treaty, Biodiversity, Climate Change, Desertification, Endangered Species, Environmental Modification, Hazardous Wastes, Law of the Sea, Nuclear Test Ban, Ozone Layer Protection, Ship Pollution, Wetlands     signed, but not ratified: Air Pollution-Persistent Organic Pollutants, Antarctic-Environmental Protocol, Climate Change-": null
    },
    {
        "Kyoto Protocol": "Kyoto Protocol"
    }
]