[
    {
        "           Azerbaijan  is situated in the ": null
    },
    {
        "Caucasus": "Caucasus"
    },
    {
        " region of ": null
    },
    {
        "Eurasia": "Eurasia"
    },
    {
        ". Three physical features dominate Azerbaijan: the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        ", whose shoreline forms a natural boundary to the east; the ": null
    },
    {
        "Greater Caucasus": "Greater Caucasus"
    },
    {
        " mountain range to the north; and the extensive flatlands at the countrys center. About the size of ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        " or the US state of ": null
    },
    {
        "Maine": "Maine"
    },
    {
        ", Azerbaijan has a total land area of approximately 86,600 square kilometers, less than 0.5% of the land area of the former ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ". Of the three Transcaucasian states, Azerbaijan has the greatest land area. Special administrative subdivisions are the ": null
    },
    {
        "Nakhchivan Autonomous Republic": "Nakhchivan Autonomous Republic"
    },
    {
        ", which is separated from the rest of Azerbaijan by a strip of ": null
    },
    {
        "Armenia": "Armenia"
    },
    {
        "n territory, and the ": null
    },
    {
        "Nagorno-Karabakh Autonomous Region": "Nagorno-Karabakh"
    },
    {
        ", entirely within Azerbaijan. The status of Nagorno-Karabakh was under negotiation in 1994.     Located in the region of the southern Caucasus Mountains, Azerbaijan borders the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        " to the east, ": null
    },
    {
        "Georgia": "Georgia"
    },
    {
        " and ": null
    },
    {
        "Russia": "Russia"
    },
    {
        " to the north, ": null
    },
    {
        "Iran": "Iran"
    },
    {
        " to the south, and ": null
    },
    {
        "Armenia": "Armenia"
    },
    {
        " to the southwest and west. A small part of Nakhchivan also borders ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        " to the northwest. The capital of Azerbaijan is the ancient city of ": null
    },
    {
        "Baku": "Baku"
    },
    {
        ", which has the largest and best harbor on the Caspian Sea and has long been the center of the republics oil industry.            The elevation changes over a relatively short distance from lowlands to highlands; nearly half the country is considered mountainous. Notable physical features are the gently undulating hills of the subtropical southeastern coast, which are covered with tea plantations, orange groves, and lemon groves; numerous mud volcanoes and mineral springs in the ravines of ": null
    },
    {
        "Kobustan Mountain": "Kobustan Mountain"
    },
    {
        " near Baku; and coastal terrain that lies as much as twenty-eight meters below sea level.     Except for its eastern Caspian shoreline and some areas bordering Georgia and Iran, Azerbaijan is ringed by mountains. To the northeast, bordering Russias Dagestan Autonomous Republic, is the ": null
    },
    {
        "Greater Caucasus": "Greater Caucasus"
    },
    {
        " range; to the west, bordering Armenia, is the ": null
    },
    {
        "Lesser Caucasus": "Lesser Caucasus"
    },
    {
        " range. To the extreme southeast, the ": null
    },
    {
        "Talysh Mountains": "Talysh Mountains"
    },
    {
        " form part of the border with Iran. The highest elevations occur in the Greater Caucasus, where ": null
    },
    {
        "Mount Bazar-dyuzi": "Bazardüzü"
    },
    {
        " rises 4,466 meters above sea level. Eight large rivers flow down from the Caucasus ranges into the central ": null
    },
    {
        "Kura-Aras Lowlands": "Kura-Aras Lowlands"
    },
    {
        ", alluvial flatlands and low delta areas along the seacoast designated by the Azerbaijani name for the ": null
    },
    {
        "Mtkvari River": "Mtkvari River"
    },
    {
        " and its main tributary, the Aras. The Mtkvari, the longest river in the Caucasus region, forms the delta and drains into the Caspian a short distance downstream from the confluence with the Aras. The ": null
    },
    {
        "Mingechaur Reservoir": "Mingechaur Reservoir"
    },
    {
        ", with an area of 605 square kilometers that makes it the largest body of water in Azerbaijan, was formed by damming the Kura in western Azerbaijan. The waters of the reservoir provide hydroelectric power and irrigation of the Kura-Aras plain. Most of the countrys rivers are not navigable. About 15% of the land in Azerbaijan is arable.            Azerbaijan is nearly surrounded by mountains. The ": null
    },
    {
        "Greater Caucasus": "Greater Caucasus"
    },
    {
        " range, with the countrys highest elevations, lies in the north along the border with Russia and run southeast to the ": null
    },
    {
        "Abseron Peninsula": "Abseron Peninsula"
    },
    {
        " on the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        ". The countrys highest peak, ": null
    },
    {
        "Bazardyuze Dagi": "Bazardüzü"
    },
    {
        ", rises to 4,485 m in this range near the Azerbaijan-Russia border. The ": null
    },
    {
        "Lesser Caucasus": "Lesser Caucasus"
    },
    {
        " range, with elevations up to 3,500 m, lies to the west along the border with Armenia. The ": null
    },
    {
        "Talish Mountains": "Talish Mountains"
    },
    {
        " form part of the border with Iran at the southeast tip of the country.     ": null
    },
    {
        "Kobustan Mountain": "Kobustan Mountain"
    },
    {
        ", located near ": null
    },
    {
        "Baku": "Baku"
    },
    {
        ", is carved by deep ravines, from which bubble mud ": null
    },
    {
        "volcano": "Volcano"
    },
    {
        "es and ": null
    },
    {
        "mineral springs": "Mineral Spring"
    },
    {
        ".            The climate varies from subtropical and humid in the southeast to subtropical and dry in central and eastern Azerbaijan. Along the shores of the Caspian Sea it is temperate, while the higher mountain elevations are generally cold. ": null
    },
    {
        "Baku": "Baku"
    },
    {
        ", on the Caspian, enjoys mild weather that averages  in January and  in July.        Physiographic conditions and different atmosphere circulations admit 8 types of air currents including continental, sea, arctic, tropical currents of air that formulates the climate of the Republic. The maximum annual precipitation falls in Lenkeran and the minimum in Absheron . The maximum daily precipitation of 334  mm was observed at the Bilieser Station in 1955.      Environmental problems   Air and water pollution are widespread and pose great challenges to economic development. Major sources of pollution include oil refineries and chemical and metallurgical industries, which in the early 1990s continued to operate as inefficiently as they had in the Soviet era. Air quality is extremely poor in Baku, the center of oil refining. Some reports have described Bakus air as the most polluted in the former Soviet Union, and other industrial centers suffer similar problems.     The Caspian Sea, including Baku Bay, has been polluted by oil leakages and the dumping of raw or inadequately treated sewage, reducing the yield of caviar and fish. In the Soviet period, Azerbaijan was pressed to use extremely heavy applications of pesticides to improve its output of scarce subtropical crops for the rest of the Soviet Union. The continued regular use of the pesticide DDT in the 1970s and 1980s was an egregious lapse, although that chemical was officially banned in the Soviet Union because of its toxicity to humans. Excessive application of pesticides and chemical fertilizers has caused extensive ": null
    },
    {
        "groundwater pollution": "Groundwater Pollution"
    },
    {
        " and has been linked by Azerbaijani scientists to birth defects and illnesses. Rising water levels in the Caspian Sea, mainly caused by natural factors exacerbated by man-made structures, have reversed the decades-long drying trend and now threaten coastal areas; the average level rose 1.5 meters between 1978 and 1993. Because of the Nagorno-Karabakh conflict, large numbers of trees were felled, roads were built through pristine areas, and large expanses of agricultural land were occupied by military forces.     Like other former Soviet republics, Azerbaijan faces a gigantic environmental cleanup complicated by the economic uncertainties left in the wake of the Moscow-centered planning system. The Committee for the Protection of the Natural Environment is part of the Azerbaijani government, but in the early 1990s it was ineffective at targeting critical applications of limited funds, establishing pollution standards, or monitoring compliance with environmental regulations. Early in 1994, plans called for Azerbaijan to participate in the international Caspian Sea Forum, sponsored by the European Union .     ; Natural hazards:   : Droughts and floods; some lowland areas threatened by rising levels of the Caspian Sea   ; Environment—current issues:   : Local scientists consider the Abseron Yasaqligi and the Caspian Sea to be the ecologically most devastated area in the world because of severe air, water, and soil pollution; soil pollution results from the use of ": null
    },
    {
        "DDT": "Ddt"
    },
    {
        " as a pesticide and also from toxic defoliants used in the production of ": null
    },
    {
        "cotton": "Cotton Production In Azerbaijan"
    },
    {
        ".   ; Environment - international agreements   : Party to: ": null
    },
    {
        "Air Pollution": "Air Pollution"
    },
    {
        ", ": null
    },
    {
        "Biodiversity": "Biodiversity"
    },
    {
        ", Climate Change, ": null
    },
    {
        "Desertification": "Desertification"
    },
    {
        ", Endangered Species, Hazardous Wastes, Marine Dumping, Ozone Layer Protection, Ship Pollution, Wetlands       ; Area:   : Total: 86,600 km² - country comparison to the world: 113   : Land: 82,629 km²   : Water: 3,971 km²   : Note: Includes the exclave of ": null
    },
    {
        "Nakhchivan Autonomous Republic": "Nakhchivan Autonomous Republic"
    },
    {
        " and the ": null
    },
    {
        "Nagorno-Karabakh": "Nagorno-Karabakh"
    },
    {
        " region; the regions autonomy was abolished by Azerbaijani Supreme Soviet on November 26, 1991.     ; Area comparative   : Australia comparative: larger than ": null
    },
    {
        "Tasmania": "Tasmania"
    },
    {
        "   : Canada comparative: larger than ": null
    },
    {
        "New Brunswick": "New Brunswick"
    },
    {
        "   : United Kingdom comparative: slightly larger than ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        "   : United States comparative: slightly smaller than ": null
    },
    {
        "Maine": "Maine"
    },
    {
        "   : ": null
    },
    {
        "EU": "European Union"
    },
    {
        " comparative: slightly smaller than ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        "   ; Land boundaries:   : Total: 2,468 km   : Border countries: ": null
    },
    {
        "Armenia": "Armenia"
    },
    {
        " 566 km, Armenia 221 km, ": null
    },
    {
        "Georgia": "Georgia"
    },
    {
        " 428 km, Iran 432 km, ": null
    },
    {
        "Iran": "Iran"
    },
    {
        " 700 km, Russia 338 km, ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        " 17 km   ; Coastline:   : Mostly landlocked, but has a 713 km coastline with the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        ".   ; Maritime claims:   : None   ; Terrain   : large,flat lowland with Great Caucasus Mountains to the north, uplands in the west   ; Elevation extremes   : Lowest point: Caspian Sea -28 m   : Highest point: ": null
    },
    {
        "Bazarduzu Dagi": "Bazarduzu Dagi"
    },
    {
        " 4,485 m   : Highest peak entirely within Azeri territory: Shah Dagi 4,243 m                 ; Natural resources:   : ": null
    },
    {
        "Petroleum": "Petroleum"
    },
    {
        ", natural gas, iron ": null
    },
    {
        "ore": "Ore"
    },
    {
        ", nonferrous metals, ": null
    },
    {
        "bauxite": "Bauxite"
    },
    {
        "   ; Land use:   : ": null
    },
    {
        "Arable land": "Arable Land"
    }
]