[
    {
        "      \t   Georgius Agricola  was a ": null
    },
    {
        "German": "German People"
    },
    {
        " Humanist": "Renaissance Humanism"
    },
    {
        " scholar, ": null
    },
    {
        "mineralogist": "Mineralogy"
    },
    {
        " and ": null
    },
    {
        "metallurgist": "Metallurgy"
    },
    {
        ". Born in the small town of ": null
    },
    {
        "Glauchau": "Glauchau"
    },
    {
        ", in the ": null
    },
    {
        "Electorate of Saxony": "Electorate Of Saxony"
    },
    {
        " of the ": null
    },
    {
        "Holy Roman Empire": "Holy Roman Empire"
    },
    {
        ", he was broadly educated, but took a particular interest in the ": null
    },
    {
        "mining": "Mining"
    },
    {
        " and ": null
    },
    {
        "refining": "Refining"
    },
    {
        " of ": null
    },
    {
        "metals": "Metal"
    },
    {
        ". He is well known for his pioneering work  De re metallica libri XII , that was published in 1556, one year after his death. This 12-volume work is a comprehensive and systematic study, classification and methodical guide on all available factual and practical aspects, that are of concern for ": null
    },
    {
        "mining": "Mining"
    },
    {
        ", the mining sciences and ": null
    },
    {
        "metallurgy": "Metallurgy"
    },
    {
        ", investigated and researched in its natural environment by means of direct observation. Unrivalled in its complexity and accuracy, it served as the standard reference work for two centuries. Agricola stated in the preface, that he will exclude all those things which I have not myself seen, or have not read or heard of. That which I have neither seen, nor carefully considered after reading or hearing of, I have not written about. He thereby refuses to rely on abstruse methods through philosophical considerations and instead submits his work to the strict principles of the modern ": null
    },
    {
        "scientific method": "Scientific Method"
    },
    {
        ", centuries before its time. As a scholar of the ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        " he was committed to a universal approach towards learning and research and published over 40 complete scholarly works during his professional life on a wide range of subjects and disciplines, such as pedagogy, medicine, metrology, mercantilism, pharmacy, philosophy, geology, history and many more. His innovative and comprehensive scholarly work, based on new and precise methods of production and control is remarkable and has earned him international admiration to this day.        He is often, although not universally referred to as the Father of ": null
    },
    {
        "mineralogy": "Mineralogy"
    },
    {
        " and the founder of ": null
    },
    {
        "geology": "Geology"
    },
    {
        " as a scientific discipline.  Poet ": null
    },
    {
        "Georg Fabricius": "Georg Fabricius"
    },
    {
        " has bestowed a brief honorary title on him in recognition of his legacy, that his fellow ": null
    },
    {
        "Saxons": "Saxony"
    },
    {
        " cite regularly: die ausgezeichnete Zierde des Vaterlandes, . He was baptized with his birth name Georg Pawer. Pawer is a ": null
    },
    {
        "vernacular": "Vernacular"
    },
    {
        " form of the modern German term Bauer, which translates to farmer in English. His teacher, the ": null
    },
    {
        "Leipzig": "Leipzig"
    },
    {
        " professor ": null
    },
    {
        "Petrus Mosellanus": "Petrus Mosellanus"
    },
    {
        " convinced him to consider the common practice of ": null
    },
    {
        "name latinisation": "Latinisation Of Names"
    },
    {
        ", particularly popular among Renaissance scholars, so Georg Pawer became Georgius Agricola .     Interestingly, his first name, Georg or Georgius, derives from the Greek Γεωργιος , which in turn derives from γεωργος , meaning farmer or earthworker.  Therefore, his complete name translates to Farmer Farmer.              Agricola was born in 1494 as Georg Pawer, the second of seven children of a clothier and dyer in Glauchau. At the age of twelve he enrolled in the Latin school in ": null
    },
    {
        "Chemnitz": "Chemnitz"
    },
    {
        " or ": null
    },
    {
        "Zwickau": "Zwickau"
    },
    {
        ".  From 1514 to 1518 he studied at the ": null
    },
    {
        "Leipzig University": "Leipzig University"
    },
    {
        " where, under the name Georgius Pawer de Glauchaw, he first inscribed to the summer semester for theology, philosophy and philology under rector Nikolaus Apel and for ancient languages, ": null
    },
    {
        "Greek": "Ancient Greek"
    },
    {
        " and ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " in particular, He received his first Latin lectures under ": null
    },
    {
        "Petrus Mosellanus": "Petrus Mosellanus"
    },
    {
        ", a celebrated humanist of the time and adherent of ": null
    },
    {
        "Erasmus of Rotterdam": "Erasmus"
    },
    {
        ".         Gifted with a precocious intellect and his freshly acquired title of ": null
    },
    {
        "Baccalaureus artium": "Bachelor Of Arts"
    },
    {
        ", Agricola early threw himself into the pursuit of the ": null
    },
    {
        "new learning": "New Learning"
    },
    {
        " , with such effect that at the age of 24 he was appointed Rector extraordinarius of ": null
    },
    {
        "Ancient Greek": "Ancient Greek"
    },
    {
        " at the 1519 established Zwickau Greek school, which was soon to be united with the ": null
    },
    {
        "Great School of Zwickau": "Westsächsische Hochschule Zwickau - University Of Applied Sciences Zwickau"
    },
    {
        "  . In 1520 he published his first book, a Latin grammar manual with practical and methodical hints for teachers. In 1522 he ended his appointment to again study at ": null
    },
    {
        "Leipzig": "Leipzig"
    },
    {
        " for another year, where, as rector, he was supported by his former tutor and professor of classics, ": null
    },
    {
        "Peter Mosellanus": "Peter Mosellanus"
    },
    {
        ", with whom he had always been in correspondence. He also subscribed to the studies of ": null
    },
    {
        "medicine": "Medicine"
    },
    {
        ", ": null
    },
    {
        "physics": "Physics"
    },
    {
        ", and ": null
    },
    {
        "chemistry": "Chemistry"
    },
    {
        ".     In 1523 he traveled to ": null
    },
    {
        "Italy": "Italy"
    },
    {
        " and enrolled in the ": null
    },
    {
        "University of Bologna": "University Of Bologna"
    },
    {
        " and probably ": null
    },
    {
        "Padua": "University Of Padua"
    },
    {
        " and completed his studies in medicine. It remains unclear where he acquired his diploma. In 1524 he joined the ": null
    },
    {
        "Aldine Press": "Aldine Press"
    },
    {
        ", a prestigious printing office in ": null
    },
    {
        "Venice": "Venice"
    },
    {
        " that was established by ": null
    },
    {
        "Aldus Manutius": "Aldus Manutius"
    },
    {
        ", who had died in 1515. Manutius had established and maintained contacts and the friendship in a network among the many scholars, including the most celebrated, from all over Europe, whom he had encouraged to come to Venice and take care of the redaction of the numerous publications of the ": null
    },
    {
        "classics of antiquity": "Classics"
    },
    {
        ". At the time of Agricolas visit, the business was run by Andrea Torresani and his daughter Maria. Agricola participated in the edition of a work in several volumes on ": null
    },
    {
        "Galen": "Galen"
    },
    {
        " until 1526.               He returned to Zwickau in 1527 and to Chemnitz in autumn of the same year, where he married Anna Meyner, a widow from Schneeberg. Upon his search for employment as town physician and pharmacist in the ": null
    },
    {
        "Ore Mountains": "Ore Mountains"
    },
    {
        ", preferably a place, where he can satisfy his ardent longings for the studies on mining, he settled in the suitable little town ": null
    },
    {
        "Joachimsthal": "Jáchymov"
    },
    {
        " in the Bohemian Erzgebirge, where in 1516 significant silver ore deposits were found. The 15.000 inhabitants made Joachimsthal a busy, booming centre of mining and smelting works with hundreds of shafts for Agricola to investigate. His primary post proved to be not very demanding and he lent all his spare time to his studies. Beginning in 1528 he immersed himself in comparisons and tests on what had been written about mineralogy and mining and his own observations of the local materials and the methods of their treatment.  He constructed a logical system of the local conditions, rocks and sediments, the minerals and ores, explained the various terms of general and specific local territorial features. He combined this discourse on all natural aspects with a treatise on the actual mining, the methods and processes, local extraction variants, the differences and oddiities he had learnt from the miners. For the first time, he tackled questions on the formation of ores and minerals, attempted to bring the underlying mechanisms to light and introduce his conclusions in a systematic framework. He laid out the whole process in a scholarly dialogue and published it under the title Bermannus, sive de re metallica dialogus, in 1530. The work was highly praised by ": null
    },
    {
        "Erasmus": "Desiderius Erasmus"
    },
    {
        " for the attempt to put the knowledge, won by practical inquiry into order and further investigate in reduced form. Agricola, in his capacity of physician, also suggested, that minerals and their effects on and relationship to human medicine should be a future subject of investigation.         In 1531 Agricola received an offer of the city of Kepmnicz for the position of Stadtleybarzt , which he accepted and he relocated to ": null
    },
    {
        "Chemnitz": "Chemnitz"
    },
    {
        " in 1533. Georgius Agricola, De re metallica, translated from the first Latin edition of 1556, ": null
    },
    {
        "Herbert Clark Hoover": "Herbert Clark Hoover"
    },
    {
        " and Lou Henry Hoover, tr., New York: Dover Publications, 1950, , p. viii of the introduction. Although little is known about his work as physician, Agricola enters his most productive years and soon becomes Chemnitz lord mayor and serves as diplomat and historiograph for ": null
    },
    {
        "Duke George": "George, Duke Of Saxony"
    },
    {
        ", who was looking to uncover possible territorial claims and commissioned Agricola with a large historical work, the Dominatores Saxonici a prima origine ad hanc aetatem , which took 20 years to accomplish and was only published in 1555 at ": null
    },
    {
        "Freiberg": "Freiberg"
    },
    {
        ".      In his work De Mensuris et ponderibus, published in 1533, he describes the systems of Greek and Roman measures and weights. In the 16th century Holy Roman Empire there were no uniform dimensions, measures, and weights, which impeded trade and commerce. This work laid the foundation for Agricolas reputation as a humanist scholar, as he committed himself to the introduction of standardized weights and measures he enters the public stage and occupies a political position.      In 1544, he published the De ortu et causis subterraneorum , in which he criticized older theories and laid out the foundations of modern physical ": null
    },
    {
        "geology": "Geology"
    },
    {
        ", It discusses the effect of wind and water as powerful geological forces, the origin and distribution of ground water and mineralizing juices, the origin of subterranean heat, the origin of ore channels, and the principal divisions of the mineral kingdom. However, he maintained that a certain materia pinguis or fatty matter, set into fermentation by heat, gave birth to fossil organic shapes, as opposed to fossil shells having belonged to living animals.      In 1546, he published the four volumes of De natura eorum quae effluunt e terra . It deals with the properties of water, its effects, taste, smell, temperature etc. and air under the earth, which, as Agricola reasoned, is responsible for earthquakes and volcanoes.      The ten books of De veteribus et novis metallis, more commonly known as  De Natura Fossilium  are published in 1546 as a comprehensive textbook and account of the discovery and occurrence of minerals, ores, metals, gemstones, earths and igneous rocks,   followed by De animantibus subterraneis in 1548 and a number of smaller works on the metals during the following two years. Agricola served as Burgomaster of Chemnitz in 1546, 1547, 1551 and 1553.             Agricolas most famous work, the  De re metallica libri xii was published the year after his death, in 1556; it was perhaps finished in 1550, since the dedication to the elector and his brother is dated to that year. The delay is thought to be due to the books many woodcuts. The work is a systematic, illustrated treatise on ": null
    },
    {
        "mining": "Mining"
    },
    {
        " and ": null
    },
    {
        "extractive metallurgy": "Metallurgyextractive Metallurgy"
    },
    {
        ". It shows processes to extract ": null
    },
    {
        "ores": "Ore"
    },
    {
        " from the ground, and metals from ore.     Until that time, ": null
    },
    {
        "Pliny the Elders": "Pliny The Elder"
    },
    {
        " work  Historia Naturalis  was the main source of information on metals and mining techniques. Agricola acknowledged his debt to ancient authors, such as Pliny and ": null
    },
    {
        "Theophrastus": "Theophrastus"
    },
    {
        ", and made numerous references to Roman works. In ": null
    },
    {
        "geology": "Geology"
    },
    {
        ", Agricola described and illustrated how ": null
    },
    {
        "ore veins": "Ore Vein"
    },
    {
        " occur in and on the ground. He described ": null
    },
    {
        "prospecting": "Prospecting"
    },
    {
        " for ore veins and ": null
    },
    {
        "surveying": "Surveying"
    },
    {
        " in detail, as well as washing the ores to collect the heavier valuable minerals, such as ": null
    },
    {
        "gold": "Gold"
    },
    {
        " and ": null
    },
    {
        "tin": "Tin"
    },
    {
        ". The work shows ": null
    },
    {
        "water mills": "Water Mill"
    },
    {
        " used in ": null
    },
    {
        "mining": "Mining"
    },
    {
        ", such as the machine for lifting men and material into and out of a mine shaft. Water mills found application especially in crushing ores to release the fine particles of gold and other heavy minerals, as well as working giant ": null
    },
    {
        "bellows": "Bellows"
    },
    {
        " to force air into the confined spaces of underground workings.     Agricola described mining methods which are now obsolete, such as ": null
    },
    {
        "fire-setting": "Fire-Setting"
    },
    {
        ", which involved building fires against hard rock faces. The hot rock was quenched with water, and the ": null
    },
    {
        "thermal shock": "Thermal Shock"
    },
    {
        " weakened it enough for easy removal. It was a dangerous method when used underground, and was made redundant by ": null
    },
    {
        "explosives": "Explosives"
    },
    {
        ".     The work contains, in an appendix, the German equivalents for the technical terms used in the Latin text. Modern words that derive from the work include ": null
    },
    {
        "fluorspar": "Fluorspar"
    },
    {
        "  and ": null
    },
    {
        "bismuth": "Bismuth"
    },
    {
        ". In another example, believing the black rock of the ": null
    },
    {
        "Schloßberg": "Schloßberg"
    },
    {
        " at ": null
    },
    {
        "Stolpen": "Stolpen"
    },
    {
        " to be the same as Pliny the Elders ": null
    },
    {
        "basalt": "Basalt"
    },
    {
        ", Agricola applied this name to it, and thus originated a petrological term.     In 1912, the Mining Magazine published an English translation of De re metallica. The translation was made by ": null
    },
    {
        "Herbert Hoover": "Herbert Hoover"
    },
    {
        ", the American mining engineer and his wife ": null
    },
    {
        "Lou Henry Hoover": "Lou Henry Hoover"
    },
    {
        ". Hoover was later ": null
    },
    {
        "President of the United States": "President Of The United States"
    },
    {
        ".             Agricola died on November 21, 1555. His lifelong friend, the Protestant poet and classicist ": null
    },
    {
        "Georg Fabricius": "Georg Fabricius"
    },
    {
        ", wrote in a letter to the Protestant theologian ": null
    },
    {
        "Phillip Melanchthon": "Phillip Melanchthon"
    },
    {
        ", He who since the days of childhood had enjoyed robust health was carried off by a four-days fever. Agricola was a fervent Catholic, who, according to Fabricius, despised our Churches and would not tolerate with patience that anyone should discuss ecclesiastical matters with him . That did not stop Fabricius in the same letter from calling Agricola that distinguished ornament of our Fatherland, whose religious views...were compatible with reason, it is true, and were dazzling, though not compatible with truth ; in 1551 Fabricius had already written the introductory poem to De re metallica in praise of Agricola.      According to traditional urban customs, as a former lord mayor he was entitled to a burial in the local mother church. His religious affiliation, however, outweighed his secular prerogatives and monumental services for the city.  Chemnitz Protestant superintendent Tettelbach urged ": null
    },
    {
        "Prince August": "Augustus, Elector Of Saxony"
    },
    {
        " to command the refusal of a burial inside the city. The command was issued and Tettelbach immediately informed the Agricola party.      Upon the initiative of his childhood friend, ": null
    },
    {
        "Naumburg": "Naumburg"
    },
    {
        " bishop ": null
    },
    {
        "Julius von Pflug": "Julius Von Pflug"
    },
    {
        ", four days later Agricolas body was carried off to ": null
    },
    {
        "Zeitz": "Zeitz"
    },
    {
        ", more than  away and interred by von Pflug in the Zeitz cathedral. His wife had a memorial plate commissioned and placed inside, that was already removed during the 17th century. Its text, however has been preserved in the Zeitz annals, and reads:     To the physician and mayor of Chemnitz, Georgius Agricola, a man most distinguished by piety and scholarship, who had rendered outstanding services to his city, whose legacy will bestow immortal glory on his name, whose spirit Christ himself absorbed into his eternal kingdom. His mourning wife and children. He died in the 62nd year of life on November 21, 1555 and was born in Glauchau on March 24, 1494 ": null
    }
]