[
    {
        "         Gesta Danorum is a patriotic work of ": null
    },
    {
        "Danish": "Denmark"
    },
    {
        " history, by the 13th century author ": null
    },
    {
        "Saxo Grammaticus": "Saxo Grammaticus"
    },
    {
        " . It is the most ambitious literary undertaking of ": null
    },
    {
        "medieval": "Medieval"
    },
    {
        " Denmark and is an essential source for the nations early history. It is also one of the oldest known written documents about the ": null
    },
    {
        "history of Estonia": "History Of Estonia"
    },
    {
        " and ": null
    },
    {
        "Latvia": "History Of Latvia"
    },
    {
        ".     Consisting of sixteen books written in ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " on the invitation of ": null
    },
    {
        "Archbishop": "Archbishop"
    },
    {
        " Absalon": "Absalon"
    },
    {
        ", Gesta Danorum describes Danish history and to some degree ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        "n history in general, from prehistory to the late 12th century. In addition, Gesta Danorum offers singular reflections on European affairs in the ": null
    },
    {
        "High Middle Ages": "High Middle Ages"
    },
    {
        " from a unique Scandinavian perspective, supplementing what has been handed down by historians from ": null
    },
    {
        "Western": "Western Europe"
    },
    {
        " and ": null
    },
    {
        "Southern Europe": "Southern Europe"
    },
    {
        ".       The sixteen books, in prose with an occasional excursion into poetry, can be categorized into two parts: Books 1-9, which deal with ": null
    },
    {
        "Norse mythology": "Norse Mythology"
    },
    {
        " and semi-legendary Danish history, and Books 10-16, which deal with medieval history. Book 9 ends with ": null
    },
    {
        "Gorm the Old": "Gorm The Old"
    },
    {
        ". The last three books , which describe Danish conquests on the south shore of the Baltic Sea and wars against ": null
    },
    {
        "Slavic peoples": "Slavic Peoples"
    },
    {
        " , are very valuable for the history of West Slavic tribes  and ": null
    },
    {
        "Slavic paganism": "Slavic Mythology"
    },
    {
        ". Book 14 contains a unique description of the temple on the island of ": null
    },
    {
        "Rügen": "Rügen"
    },
    {
        ".       When exactly Gesta Danorum was written is the subject of numerous works; however, it is generally agreed that Gesta Danorum was not finished before 1208. The last event described in the last book is King ": null
    },
    {
        "Canute VI": "Canute Vi"
    },
    {
        " of Denmark subduing ": null
    },
    {
        "Pomerania": "Pomerania"
    },
    {
        " under Duke ": null
    },
    {
        "Bogislaw I": "Bogislaw I"
    },
    {
        ", in 1186. However the preface of the work, dictated to Archbishop ": null
    },
    {
        "Anders Sunesen": "Anders Sunesen"
    },
    {
        ", mentions the Danish conquest of the areas north of the ": null
    },
    {
        "Elbe": "Elbe"
    },
    {
        " in 1208.     Book 14, comprising nearly one-quarter of the text of the entire work, ends with ": null
    },
    {
        "Absalons": "Absalon"
    },
    {
        "appointment to archbishop in 1178. Since this book is so large and Absalon has greater importance than King ": null
    },
    {
        "Valdemar I": "Valdemar I Of Denmark"
    },
    {
        ", this book may have been written first and comprised a work on its own. It is possible that Saxo then enlarged it with Books 15 and 16, telling the story of King Valdemar Is last years and King Canute VIs first years.     It is believed that Saxo then wrote Books 11, 12, and 13. ": null
    },
    {
        "Svend Aagesens": "Svend Aagesen"
    },
    {
        "history of Denmark,  Brevis Historia Regum Dacie  , states that Saxo had decided to write about The king-father and his sons, which would be King ": null
    },
    {
        "Sweyn Estridson": "Sweyn Estridson"
    },
    {
        ", in Books 11, 12, and 13. He would later add the first ten books. This would also explain the 22 years between the last event described in the last book and the 1208 event described in the preface.       The original manuscripts of the work are lost, except for four fragments: the ": null
    },
    {
        "Angers Fragment": "Angers Fragment"
    },
    {
        ", ": null
    },
    {
        "Lassen Fragment": "Lassen Fragment"
    },
    {
        ", ": null
    },
    {
        "Kall-Rasmussen Fragment": "Kall-Rasmussen Fragment"
    },
    {
        " and ": null
    },
    {
        "Plesner Fragment": "Plesner Fragment"
    },
    {
        ". The Angers Fragment is the biggest fragment, and the only one attested to be in ": null
    },
    {
        "Saxo": "Saxo Grammaticus"
    },
    {
        "’s own handwriting. The other ones are copies from ca. 1275. All four fragments are in the collection of the ": null
    },
    {
        "Danish Royal Library": "Danish Royal Library"
    },
    {
        " in ": null
    },
    {
        "Copenhagen": "Copenhagen"
    },
    {
        ", Denmark.     The text has, however, survived. In 1510–1512, ": null
    },
    {
        "Christiern Pedersen": "Christiern Pedersen"
    },
    {
        ", a Danish translator working in Paris, searched Denmark high and low for an existing copy of Saxo’s works, which by that time was nearly all but lost. By that time most knowledge of Saxo’s work came from a summary located in  Chronica Jutensis , from around 1342, called  Compendium Saxonis . It is also in this summary that the name Gesta Danorum is found. The title Saxo himself used for his work is unknown.     Christiern Pedersen finally found a copy in the collection of Archbishop ": null
    },
    {
        "Birger Gunnersen": "Birger Gunnersen"
    },
    {
        " of ": null
    },
    {
        "Lund": "Lund"
    },
    {
        ", Skåne , which he gladly lent him. With the help of printer ": null
    },
    {
        "Jodocus Badius": "Jodocus Badius"
    },
    {
        ", Gesta Danorum was refined and printed.          The first printed press publication and the oldest known complete text of Saxo’s works is Christiern Pedersens Latin edition, printed and published by Jodocus Badius in Paris, France on 15 March 1514 under the title of Danorum Regum heroumque Historiae . The edition features the following ": null
    },
    {
        "colophon": "Colophon"
    },
    {
        "impressit in inclyta Parrhisorum academia Iodocus Badius Ascensius Idibus Martiis. MDXIIII. Supputatione Romana. .     The full front page reads in Latin:   Danorum Regum heroumque Historiae stilo eleganti a Saxone Grammatico natione Zialandico necnon Roskildensis ecclesiae praeposito, abhinc supra trecentos annos conscriptae et nunc primum literaria serie illustratae tersissimeque impressae.     ": null
    },
    {
        "Danish language": "Danish Language"
    },
    {
        "De danske Kongers og Heltes Historie, skrevet i pyntelig Stil for over 300 Aar siden af Saxo Grammaticus, en Sjællandsfar og Provst ved Kirken i Roskilde, og nu for første Gang oplyst ved et Register og omhyggeligt trykt.     English language:   Histories of the Kings and heroes of the Danes, composed in elegant style by Saxo Grammaticus, a Zealand er and also provost of the church of Roskilde , over three hundred years ago, and now for the first time illustrated and printed correctly in a learned compilation.       The source of all existing translations and new editions is Christiern Pedersens Latin Danorum Regum heroumque Historiae. There exist a number of different translations today, some complete, some partial:                  Christiern Pedersen, never published ca. 1540, Lost    , lost, never published ca. 1555         , 2 volumes            , Volume 1 includes books I-X and Volume 2 includes books XI-XVI.                Gesta Danorum is also translated partially in other English, ": null
    },
    {
        "French": "French Language"
    },
    {
        " and ": null
    },
    {
        "German": "German Language"
    },
    {
        " releases.             Certain aspects of Gesta Danorum formed the basis for ": null
    },
    {
        "William Shakespeares": "William Shakespeare"
    },
    {
        "play  Hamlet . It is thought that Shakespeare never read Gesta Danorum, and instead had access to an ": null
    },
    {
        "auxiliary version of the tale": "Ur-Hamlet"
    },
    {
        " describing the downfall of the ": null
    },
    {
        "Amleth": "Amleth"
    },
    {
        " Prince of Denmark.     Saxos version, told of in Books 3 and 4, is very similar to that of Shakespeares Hamlet. In Saxos version, two brothers, ": null
    },
    {
        "Orvendil": "Horwendill"
    },
    {
        " and ": null
    },
    {
        "Fengi": "Feng"
    },
    {
        " are given the rule over ": null
    },
    {
        "Jutland": "Jutland"
    },
    {
        " by King ": null
    },
    {
        "Rørik Slyngebond": "Hrærekr Slöngvanbaugi"
    },
    {
        " of the Danes. Soon after, Orvendil marries King Røriks daughter, Geruth ": null
    }
]