[
    {
        "                       A glacier  is a persistent body of dense ": null
    },
    {
        "ice": "Ice"
    },
    {
        " that is constantly moving under its own weight. A glacier forms where the accumulation of ": null
    },
    {
        "snow": "Snow"
    },
    {
        " exceeds its ": null
    },
    {
        "ablation": "Ablation"
    },
    {
        "  over many years, often ": null
    },
    {
        "centuries": "Century"
    },
    {
        ". Glaciers slowly deform and flow due to stresses induced by their weight, creating ": null
    },
    {
        "crevasses": "Crevasse"
    },
    {
        ", ": null
    },
    {
        "seracs": "Serac"
    },
    {
        ", and other distinguishing features. They also abrade rock and debris from their substrate to create landforms such as ": null
    },
    {
        "cirques": "Cirque"
    },
    {
        " and ": null
    },
    {
        "moraines": "Moraine"
    },
    {
        ". Glaciers form only on land and are distinct from the much thinner ": null
    },
    {
        "sea ice": "Sea Ice"
    },
    {
        " and lake ice that form on the surface of bodies of water.     On ": null
    },
    {
        "Earth": "Earth"
    },
    {
        ", 99% of glacial ice is contained within vast ": null
    },
    {
        "ice sheets": "Ice Sheet"
    },
    {
        " in the ": null
    },
    {
        "polar regions": "Polar Region"
    },
    {
        ", but glaciers may be found in ": null
    },
    {
        "mountain ranges": "Mountain Range"
    },
    {
        " on every ": null
    },
    {
        "continent": "Continent"
    },
    {
        " including Oceanias high-latitude ": null
    },
    {
        "oceanic island": "Oceanic Island"
    },
    {
        " countries such as New Zealand. Between 35°N and 35°S, glaciers occur only in the ": null
    },
    {
        "Himalayas": "Himalayas"
    },
    {
        ", ": null
    },
    {
        "Andes": "Andes"
    },
    {
        ", ": null
    },
    {
        "Rocky Mountains": "Rocky Mountains"
    },
    {
        ", a few high mountains in ": null
    },
    {
        "East Africa": "East Africa"
    },
    {
        ", ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        ", ": null
    },
    {
        "New Guinea": "New Guinea"
    },
    {
        " and on ": null
    },
    {
        "Zard Kuh": "Zard Kuh"
    },
    {
        " in Iran.  Glaciers cover about 10 percent of Earths land surface. Continental glaciers cover nearly  or about 98 percent of Antarcticas , with an average thickness of . ": null
    },
    {
        "Greenland": "Greenland"
    },
    {
        " and ": null
    },
    {
        "Patagonia": "Patagonia"
    },
    {
        " also have huge expanses of continental glaciers. National Geographic Almanac of Geography, 2005, , p. 149. The volume of glaciers, not including the ice sheets of Antarctica and Greenland, has been estimated as 170,000  km 3 .      Glacial ice is the largest reservoir of ": null
    },
    {
        "fresh water": "Fresh Water"
    },
    {
        " on Earth.  Many glaciers from temperate, alpine and seasonal polar climates store water as ice during the colder seasons and release it later in the form of ": null
    },
    {
        "meltwater": "Meltwater"
    },
    {
        " as warmer summer temperatures cause the glacier to melt, creating a ": null
    },
    {
        "water source": "Water Resources"
    },
    {
        " that is especially important for plants, animals and human uses when other sources may be scant. Within high-altitude and Antarctic environments, the seasonal temperature difference is often not sufficient to release meltwater.     Since glacial mass is affected by long-term ": null
    },
    {
        "climatic": "Climate"
    },
    {
        " changes, e.g., ": null
    },
    {
        "precipitation": "Precipitation"
    },
    {
        ", ": null
    },
    {
        "mean temperature": "Temperature"
    },
    {
        ", and ": null
    },
    {
        "cloud cover": "Cloud Cover"
    },
    {
        ", ": null
    },
    {
        "glacial mass changes": "Retreat Of Glaciers Since 1850"
    },
    {
        " are considered among the most sensitive indicators of ": null
    },
    {
        "climate change": "Climate Change"
    },
    {
        " and are a major source of variations in ": null
    },
    {
        "sea level": "Current Sea Level Rise"
    },
    {
        ".     A large piece of compressed ice, or a glacier, ": null
    },
    {
        "appears blue": "Blue Ice"
    },
    {
        ", as large quantities of ": null
    },
    {
        "water appear blue": "Color Of Water"
    },
    {
        ". This is because water molecules absorb other colors more efficiently than blue. The other reason for the blue color of glaciers is the lack of air bubbles. Air bubbles, which give a white color to ice, are squeezed out by pressure increasing the density of the created ice.       The word glacier is a ": null
    },
    {
        "loanword": "Loanword"
    },
    {
        " from ": null
    },
    {
        "French": "French Language"
    },
    {
        " and goes back, via ": null
    },
    {
        "Franco-Provençal": "Franco-Provençal Language"
    },
    {
        ", to the ": null
    },
    {
        "Vulgar Latin": "Vulgar Latin"
    },
    {
        " , derived from the ": null
    },
    {
        "Late Latin": "Late Latin"
    },
    {
        " , and ultimately ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " , meaning ice .  The processes and features caused by or related to glaciers are referred to as glacial. The process of glacier establishment, growth and flow is called ": null
    },
    {
        "glaciation": "Glacial Period"
    },
    {
        ". The corresponding area of study is called ": null
    },
    {
        "glaciology": "Glaciology"
    },
    {
        ". Glaciers are important components of the global ": null
    },
    {
        "cryosphere": "Cryosphere"
    },
    {
        ".                 Glaciers are categorized by their morphology, thermal characteristics, and behavior.  Alpine glaciers form on the crests and slopes of ": null
    },
    {
        "mountains": "Mountain"
    },
    {
        ". A glacier that fills a valley is called a valley glacier, or alternatively an alpine glacier or mountain glacier.  A large body of glacial ice astride a mountain, ": null
    },
    {
        "mountain range": "Mountain Range"
    },
    {
        ", or ": null
    },
    {
        "volcano": "Volcano"
    },
    {
        " is termed an  ice cap  or  ice field .  Ice caps have an area less than  by definition.     Glacial bodies larger than  are called  ice sheet s or continental glaciers.  Several kilometers deep, they obscure the underlying topography. Only ": null
    },
    {
        "nunataks": "Nunatak"
    },
    {
        " protrude from their surfaces. The only extant ice sheets are the two that cover most of ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        " and ": null
    },
    {
        "Greenland": "Greenland"
    },
    {
        ".  They contain vast quantities of fresh water, enough that if both melted, global sea levels would rise by over .  Portions of an ice sheet or cap that extend into water are called ": null
    },
    {
        "ice shelves": "Ice Shelves"
    },
    {
        "; they tend to be thin with limited slopes and reduced ": null
    },
    {
        "velocities": "Velocities"
    },
    {
        ".  Narrow, fast-moving sections of an ice sheet are called  ice streams .   In Antarctica, many ice streams drain into large ": null
    },
    {
        "ice shelves": "Ice Shelf"
    },
    {
        ". Some drain directly into the sea, often with an ": null
    },
    {
        "ice tongue": "Ice Tongue"
    },
    {
        ", like ": null
    },
    {
        "Mertz Glacier": "Mertz Glacier"
    },
    {
        ".            Tidewater glaciers  are glaciers that terminate in the sea, including most glaciers flowing from ": null
    },
    {
        "Greenland": "Greenland"
    },
    {
        ", ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        ", ": null
    },
    {
        "Baffin": "Baffin Island"
    },
    {
        " and ": null
    },
    {
        "Ellesmere Islands": "Ellesmere Island"
    },
    {
        " in Canada, ": null
    },
    {
        "Southeast Alaska": "Southeast Alaska"
    },
    {
        ", and the ": null
    },
    {
        "Northern": "Northern Patagonian Ice Field"
    },
    {
        " and ": null
    },
    {
        "Southern Patagonian Ice Fields": "Southern Patagonian Ice Field"
    },
    {
        ". As the ice reaches the sea, pieces break off, or calve, forming ": null
    },
    {
        "icebergs": "Iceberg"
    },
    {
        ". Most tidewater glaciers calve above sea level, which often results in a tremendous impact as the iceberg strikes the water. Tidewater glaciers undergo centuries-long ": null
    },
    {
        "cycles of advance and retreat": "Tidewater Glacier Cycle"
    },
    {
        " that are much less affected by the climate change than those of other glaciers.        Thermally, a temperate glacier is at melting point throughout the year, from its surface to its base. The ice of a polar glacier is always below the freezing point from the surface to its base, although the surface snowpack may experience seasonal melting. A subpolar glacier includes both temperate and polar ice, depending on depth beneath the surface and position along the length of the glacier. In a similar way, the thermal regime of a glacier is often described by its basal temperature. A cold-based glacier is below freezing at the ice-ground interface, and is thus frozen to the underlying substrate. A warm-based glacier is above or at freezing at the interface, and is able to slide at this contact.  This contrast is thought to a large extent to govern the ability of a glacier to effectively ": null
    },
    {
        "erode its bed": "Glacial Erosion"
    },
    {
        ", as sliding ice promotes ": null
    },
    {
        "plucking": "Plucking"
    },
    {
        " at rock from the surface below. Boulton, G.S. Processes and patterns of glacial erosion ,  Glaciers which are partly cold-based and partly warm-based are known as polythermal.            Glaciers form where the ": null
    },
    {
        "accumulation": "Glacier Ice Accumulation"
    },
    {
        " of snow and ice exceeds ": null
    },
    {
        "ablation": "Ablation"
    },
    {
        ". A glacier usually originates from a landform called ": null
    },
    {
        "cirque": "Cirque"
    },
    {
        " – a typically armchair-shaped geological feature – which collects and compresses through gravity the snow that falls into it. This snow collects and is compacted by the weight of the snow falling above it, forming ": null
    },
    {
        "névé": "Névé"
    },
    {
        ". Further crushing of the individual snowflakes and squeezing the air from the snow turns it into glacial ice . This glacial ice will fill the cirque until it overflows through a geological weakness or vacancy, such as the gap between two mountains. When the mass of snow and ice is sufficiently thick, it begins to move due to a combination of surface slope, gravity and pressure. On steeper slopes, this can occur with as little as 15  m of snow-ice.        In temperate glaciers, snow repeatedly freezes and thaws, changing into granular ice called ": null
    },
    {
        "firn": "Firn"
    },
    {
        ". Under the pressure of the layers of ice and snow above it, this granular ice fuses into denser and denser ": null
    },
    {
        "firn": "Firn"
    },
    {
        ". Over a period of years, layers of firn undergo further compaction and become glacial ice. Glacier ice is slightly less dense than ice formed from frozen water because it contains tiny trapped air bubbles.     Glacial ice has a distinctive ": null
    },
    {
        "blue": "Blue"
    },
    {
        " tint because it absorbs some red light due to an ": null
    },
    {
        "overtone": "Overtone"
    },
    {
        " of the infrared ": null
    },
    {
        "OH stretching": "Infrared Spectroscopy"
    },
    {
        " mode of the water molecule. Liquid ": null
    },
    {
        "water": "Water"
    },
    {
        " is blue for the same reason. The blue of glacier ice is sometimes misattributed to ": null
    },
    {
        "Rayleigh scattering": "Rayleigh Scattering"
    },
    {
        " due to bubbles in the ice.             A glacier originates at a location called its glacier head and terminates at its glacier foot, snout, or ": null
    },
    {
        "terminus": "Glacier Terminus"
    },
    {
        ".     Glaciers are broken into zones based on surface snowpack and melt conditions. Benson, C.S., 1961, Stratigraphic studies in the snow and firn of the Greenland Ice Sheet , Res. Rep. 70, U.S. Army Snow, Ice and Permafrost Res Establ., Corps of Eng., 120 pp. The ablation zone is the region where there is a net loss in glacier mass. The equilibrium line separates the ablation zone and the ": null
    },
    {
        "accumulation zone": "Accumulation Zone"
    },
    {
        "; it is the altitude where the amount of new snow gained by accumulation is equal to the amount of ice lost through ablation. The upper part of a glacier, where accumulation exceeds ablation, is called the ": null
    },
    {
        "accumulation zone": "Accumulation Zone"
    },
    {
        ". In general, the accumulation zone accounts for 60–70% of the glaciers surface area, more if the glacier calves icebergs. Ice in the accumulation zone is deep enough to exert a downward force that erodes underlying rock. After a glacier melts, it often leaves behind a bowl- or amphitheater-shaped depression that ranges in size from large basins like the Great Lakes to smaller mountain depressions known as ": null
    },
    {
        "cirques": "Cirque"
    },
    {
        ".     The accumulation zone can be subdivided based on its melt conditions.   The dry snow zone is a region where no melt occurs, even in the summer, and the snowpack remains dry.   The percolation zone is an area with some surface melt, causing ": null
    },
    {
        "meltwater": "Meltwater"
    },
    {
        " to percolate into the ": null
    },
    {
        "snowpack": "Snowsnowpack"
    },
    {
        ". This zone is often marked by refrozen ": null
    },
    {
        "ice lenses": "Ice Segregation"
    },
    {
        ", glands, and layers. The snowpack also never reaches melting point.   Near the equilibrium line on some glaciers, a superimposed ice zone develops. This zone is where meltwater refreezes as a cold layer in the glacier, forming a continuous mass of ice.   The wet snow zone is the region where all of the snow deposited since the end of the previous summer has been raised to 0  °C.     The health of a glacier is usually assessed by determining the ": null
    },
    {
        "glacier mass balance": "Glacier Mass Balance"
    },
    {
        " or observing terminus behavior. Healthy glaciers have large accumulation zones, more than 60% of their area snowcovered at the end of the melt season, and a terminus with vigorous flow.     Following the ": null
    },
    {
        "Little Ice Ages": "Little Ice Age"
    },
    {
        " end around 1850, ": null
    },
    {
        "glaciers around the Earth have retreated substantially": "Retreat Of Glaciers Since 1850"
    },
    {
        ". A slight cooling led to the advance of many alpine glaciers between 1950 and 1985, but since 1985 glacier retreat and mass loss has become larger and increasingly ubiquitous.                Glaciers move, or flow, downhill due to ": null
    },
    {
        "gravity": "Gravity"
    },
    {
        " and the internal deformation of ice.  Ice behaves like a brittle solid until its thickness exceeds about 50  m . The pressure on ice deeper than 50  m causes ": null
    },
    {
        "plastic flow": "Plasticity"
    },
    {
        ". At the molecular level, ice consists of stacked layers of molecules with relatively weak bonds between layers. When the stress on the layer above exceeds the inter-layer binding strength, it moves faster than the layer below. W.S.B. Paterson, Physics of ice     Glaciers also move through ": null
    },
    {
        "basal sliding": "Basal Sliding"
    },
    {
        ". In this process, a glacier slides over the terrain on which it sits, ": null
    },
    {
        "lubricated": "Lubrication"
    },
    {
        " by the presence of liquid water. The water is created from ice that melts under high pressure from frictional heating. Basal sliding is dominant in temperate, or warm-based glaciers.     Although evidence in favour of glacial flow was known by the early 19th century, other theories of glacial motion were advanced, such as the idea that melt water, refreezing inside glaciers, caused the glacier to dilate and extend its length. As it became clear that glaciers behaved to some degree as if the ice were a viscous fluid, it was argued that regelation , or the melting and refreezing of ice at a temperature lowered by the pressure on the ice inside the glacier, was what allowed the ice to deform and flow. ": null
    },
    {
        "James Forbes": "James David Forbes"
    },
    {
        " came up with the essentially correct explanation in the 1840s, although it was several decades before it was fully accepted.              The top  of a glacier are rigid because they are under low pressure. This upper section is known as the fracture zone and moves mostly as a single unit over the plastically flowing lower section. When a glacier moves through irregular terrain, cracks called ": null
    },
    {
        "crevasses": "Crevasse"
    },
    {
        " develop in the fracture zone. Crevasses form due to differences in glacier velocity. If two rigid sections of a glacier move at different speeds and directions, ": null
    },
    {
        "shear": "Shear"
    },
    {
        " forces cause them to break apart, opening a crevasse. Crevasses are seldom more than  deep but in some cases can be at least . Beneath this point, the plasticity of the ice is too great for cracks to form. Intersecting crevasses can create isolated peaks in the ice, called ": null
    },
    {
        "seracs": "Serac"
    },
    {
        ".     Crevasses can form in several different ways. Transverse crevasses are transverse to flow and form where steeper slopes cause a glacier to accelerate. Longitudinal crevasses form semi-parallel to flow where a glacier expands laterally. Marginal crevasses form from the edge of the glacier, due to the reduction in speed caused by friction of the valley walls. Marginal crevasses are usually largely transverse to flow. Moving glacier ice can sometimes separate from stagnant ice above, forming a ": null
    },
    {
        "bergschrund": "Bergschrund"
    },
    {
        ". Bergschrunds resemble crevasses but are singular features at a glaciers margins.     Crevasses make travel over glaciers hazardous, especially when they are hidden by fragile ": null
    },
    {
        "snow bridges": "Snow Bridge"
    },
    {
        ".          Below the equilibrium line, glacial meltwater is concentrated in stream channels. Meltwater can pool in proglacial lakes on top of a glacier or descend into the depths of a glacier via ": null
    },
    {
        "moulins": "Moulin"
    },
    {
        ". Streams within or beneath a glacier flow in englacial or sub-glacial tunnels. These tunnels sometimes reemerge at the glaciers surface.        The speed of glacial displacement is partly determined by ": null
    },
    {
        "friction": "Friction"
    },
    {
        ". Friction makes the ice at the bottom of the glacier move more slowly than ice at the top. In alpine glaciers, friction is also generated at the valleys side walls, which slows the edges relative to the center.     Mean speeds vary greatly, but is typically around  per day.  There may be no motion in stagnant areas; for example, in parts of ": null
    },
    {
        "Alaska": "Alaska"
    },
    {
        ", trees can establish themselves on surface sediment deposits. In other cases, glaciers can move as fast as  per day, such as in Greenlands ": null
    },
    {
        "Jakobshavn Isbræ": "Jakobshavn Isbræ"
    },
    {
        " . Velocity increases with increasing slope, increasing thickness, increasing snowfall, increasing longitudinal confinement, increasing basal temperature, increasing meltwater production and reduced bed hardness.     A few glaciers have periods of very rapid advancement called ": null
    },
    {
        "surges": "Surge"
    },
    {
        ". These glaciers exhibit normal movement until suddenly they accelerate, then return to their previous state. During these surges, the glacier may reach velocities far greater than normal speed.  These surges may be caused by failure of the underlying bedrock, the pooling of meltwater at the base of the glacier   — perhaps delivered from a ": null
    },
    {
        "supraglacial lake": "Supraglacial Lake"
    },
    {
        "  — or the simple accumulation of mass beyond a critical tipping point . Meier & Post Temporary rates up to  per day have occurred when increased temperature or overlying pressure caused bottom ice to melt and water to accumulate beneath a glacier.     In glaciated areas where the glacier moves faster than one km per year, ": null
    },
    {
        "glacial earthquakes": "Glacial Earthquake"
    },
    {
        " occur. These are large scale ": null
    },
    {
        "earthquakes": "Earthquake"
    },
    {
        " that have seismic magnitudes as high as 6.1.  , Ekström, G., M. Nettles, and V.C. Tsai Science, 311, 5768, 1756–1758,    Tsai, V. C. and G. Ekström . J. Geophys. Res., 112, F03S22,  The number of glacial earthquakes in ": null
    },
    {
        "Greenland": "Greenland"
    },
    {
        " peaks every year in July, August and September and increased rapidly in the 1990s and 2000s. In a study using data from January 1993 through October 2005, more events were detected every year since 2002, and twice as many events were recorded in 2005 as there were in any other year.       Ogives   are alternating wave crests and valleys that appear as dark and light bands of ice on glacier surfaces. They are linked to seasonal motion of glaciers; the width of one dark and one light band generally equals the annual movement of the glacier. Ogives are formed when ice from an icefall is severely broken up, increasing ablation surface area during summer. This creates a ": null
    },
    {
        "swale": "Swale"
    },
    {
        " and space for snow accumulation in the winter, which in turn creates a ridge.  Sometimes ogives consist only of undulations or color bands and are described as wave ogives or band ogives.              Glaciers are present on every continent and approximately fifty countries, excluding those that have glaciers only on distant ": null
    },
    {
        "subantarctic": "Subantarctic"
    },
    {
        " island territories. Extensive glaciers are found in ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        ", Argentina, Chile, Canada, ": null
    },
    {
        "Alaska": "Alaska"
    },
    {
        ", ": null
    },
    {
        "Greenland": "Greenland"
    },
    {
        " and ": null
    },
    {
        "Iceland": "Iceland"
    },
    {
        ". Mountain glaciers are widespread, especially in the ": null
    },
    {
        "Andes": "Andes"
    },
    {
        ", the ": null
    },
    {
        "Himalayas": "Himalayas"
    },
    {
        ", the ": null
    },
    {
        "Rocky Mountains": "Rocky Mountains"
    },
    {
        ", the ": null
    },
    {
        "Caucasus": "Caucasus Mountains"
    },
    {
        ", ": null
    },
    {
        "Scandinavian mountains": "Scandinavian Mountains"
    },
    {
        ", and the ": null
    },
    {
        "Alps": "Alps"
    },
    {
        ". ": null
    },
    {
        "Snezhnika": "Snezhnika"
    },
    {
        " glacier in ": null
    },
    {
        "Pirin": "Pirin"
    },
    {
        " Mountain, ": null
    },
    {
        "Bulgaria": "Bulgaria"
    },
    {
        " with a ": null
    },
    {
        "latitude": "Latitude"
    },
    {
        " of 41°46′09″ N is the southernmost glacial mass in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ". Grunewald, p. 129. Mainland Australia currently contains no glaciers, although a small glacier on ": null
    },
    {
        "Mount Kosciuszko": "Mount Kosciuszko"
    },
    {
        " was present in the ": null
    },
    {
        "last glacial period": "Last Glacial Period"
    },
    {
        ".  In ": null
    },
    {
        "New Guinea": "New Guinea"
    },
    {
        ", small, rapidly diminishing, glaciers are located on its highest summit massif of ": null
    },
    {
        "Puncak Jaya": "Puncak Jaya"
    },
    {
        ".  Africa has glaciers on ": null
    },
    {
        "Mount Kilimanjaro": "Mount Kilimanjaro"
    },
    {
        " in ": null
    },
    {
        "Tanzania": "Tanzania"
    },
    {
        ", on ": null
    },
    {
        "Mount Kenya": "Mount Kenya"
    },
    {
        " and in the ": null
    },
    {
        "Rwenzori Mountains": "Rwenzori Mountains"
    },
    {
        ". Oceanic islands with glaciers include Iceland, several of the islands off the coast of Norway including ": null
    },
    {
        "Svalbard": "Svalbard"
    },
    {
        " and ": null
    },
    {
        "Jan Mayen": "Jan Mayen"
    },
    {
        " to the far North, ": null
    },
    {
        "New Zealand": "New Zealand"
    },
    {
        " and the subantarctic islands of ": null
    },
    {
        "Marion": "Marion Island"
    },
    {
        ", ": null
    },
    {
        "Heard": "Heard Island"
    },
    {
        ", ": null
    },
    {
        "Grande Terre ": "Kerguelen Islandsgrande Terre"
    },
    {
        " and ": null
    },
    {
        "Bouvet": "Bouvet Island"
    },
    {
        ". During glacial periods of the Quaternary, ": null
    },
    {
        "Taiwan": "Taiwan"
    },
    {
        ", ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        " on ": null
    },
    {
        "Mauna Kea": "Mauna Kea"
    },
    {
        "  and ": null
    },
    {
        "Tenerife": "Tenerife"
    },
    {
        " also had large alpine glaciers, while the ": null
    },
    {
        "Faroe": "Faroe Islands"
    },
    {
        " and ": null
    },
    {
        "Crozet Islands": "Crozet Islands"
    },
    {
        "  were completely glaciated.     The permanent snow cover necessary for glacier formation is affected by factors such as the degree of ": null
    },
    {
        "slope": "Slope"
    },
    {
        " on the land, amount of snowfall and the ": null
    },
    {
        "winds": "Wind"
    },
    {
        ". Glaciers can be found in all ": null
    },
    {
        "latitudes": "Latitude"
    },
    {
        " except from 20° to 27° north and south of the equator where the presence of the descending limb of the ": null
    },
    {
        "Hadley circulation": "Hadley Circulation"
    },
    {
        " lowers precipitation so much that with high ": null
    },
    {
        "insolation": "Insolation"
    },
    {
        "snow lines": "Snow Line"
    },
    {
        " reach above . Between 19˚N and 19˚S, however, precipitation is higher and the mountains above  usually have permanent snow.     Even at high latitudes, glacier formation is not inevitable. Areas of the ": null
    },
    {
        "Arctic": "Arctic"
    },
    {
        ", such as ": null
    },
    {
        "Banks Island": "Banks Island"
    },
    {
        ", and the ": null
    },
    {
        "McMurdo Dry Valleys": "Mcmurdo Dry Valleys"
    },
    {
        " in Antarctica are considered ": null
    },
    {
        "polar deserts": "Polar Desert"
    },
    {
        " where glaciers cannot form because they receive little snowfall despite the bitter cold. Cold air, unlike warm air, is unable to transport much water vapor. Even during glacial periods of the ": null
    },
    {
        "Quaternary": "Quaternary"
    },
    {
        ", ": null
    },
    {
        "Manchuria": "Manchuria"
    },
    {
        ", lowland ": null
    },
    {
        "Siberia": "Siberia"
    },
    {
        ", Collins, Henry Hill; Europe and the USSR; p. 263.  and ": null
    },
    {
        "central": "Alaska Interior"
    },
    {
        " and ": null
    },
    {
        "northern Alaska": "Northern Alaska"
    },
    {
        ",  though extraordinarily cold, had such light snowfall that glaciers could not form.       In addition to the dry, unglaciated polar regions, some mountains and volcanoes in Bolivia, Chile and Argentina are high  and cold, but the relative lack of precipitation prevents snow from accumulating into glaciers. This is because these peaks are located near or in the ": null
    },
    {
        "hyperarid": "Hyperarid"
    },
    {
        " Atacama Desert": "Atacama Desert"
    },
    {
        ".             Glaciers erode terrain through two principal processes:  abrasion  and  plucking .     As glaciers flow over bedrock, they soften and lift blocks of rock into the ice. This process, called plucking, is caused by subglacial water that penetrates fractures in the bedrock and subsequently freezes and expands. This expansion causes the ice to act as a lever that loosens the rock by lifting it. Thus, sediments of all sizes become part of the glaciers load. If a retreating glacier gains enough debris, it may become a rock glacier , like the Timpanogos Glacier in Utah.     Abrasion occurs when the ice and its load of rock fragments slide over bedrock and function as sandpaper, smoothing and polishing the bedrock below. The pulverized rock this process produces is called rock flour and is made up of rock grains between 0.002 and 0.00625  mm in size. Abrasion leads to steeper valley walls and mountain slopes in alpine settings, which can cause avalanches and rock slides, which add even more material to the glacier.     Glacial abrasion is commonly characterized by glacial striation s. Glaciers produce these when they contain large boulders that carve long scratches in the bedrock. By mapping the direction of the striations, researchers can determine the direction of the glaciers movement. Similar to striations are chatter mark s, lines of crescent-shape depressions in the rock underlying a glacier. They are formed by abrasion when boulders in the glacier are repeatedly caught and released as they are dragged along the bedrock.     The rate of glacier erosion varies. Six factors control erosion rate:   Velocity of glacial movement   Thickness of the ice   Shape, abundance and hardness of rock fragments contained in the ice at the bottom of the glacier   Relative ease of erosion of the surface under the glacier   Thermal conditions at the glacier base   Permeability and water pressure at the glacier base   When the bedrock has frequent fractures on the surface, glacial erosion rates tend to increase as plucking is the main erosive force on the surface; when the bedrock has wide gaps between sporadic fractures, however, abrasion tends to be the dominant erosive form and glacial erosion rates become slow.     Glaciers in lower latitudes tend to be much more erosive than glaciers in higher latitudes, because they have more meltwater reaching the glacial base and facilitate sediment production and transport under the same moving speed and amount of ice.     Material that becomes incorporated in a glacier is typically carried as far as the zone of ablation before being deposited. Glacial deposits are of two distinct types:   Glacial tillFluvial and outwash sedimentsglacial drift, which often blankets the surface underneath the glacier downslope from the equilibrium line.     The term moraine is of French origin. It was coined by peasants to describe alluvial embankments and rims found near the margins of glaciers in the French Alps . In modern geology, the term is used more broadly, and is applied to a series of formations, all of which are composed of till. Moraines can also create moraine dammed lakes.       fra   Drumlin s are asymmetrical, canoe shaped hills made mainly of till. Their heights vary from 15 to 50  meters and they can reach a kilometer in length. The steepest side of the hill faces the direction from which the ice advanced , while a longer slope is left in the ices direction of movement .     Drumlins are found in groups called ": null
    },
    {
        "drumlin fields": "Drumlin Field"
    },
    {
        "  or drumlin camps. One of these fields is found east of Rochester, New York ; it is estimated to contain about 10,000 drumlins.     Although the process that forms drumlins is not fully understood, their shape implies that they are products of the plastic deformation zone of ancient glaciers. It is believed that many drumlins were formed when glaciers advanced over and altered the deposits of earlier glaciers.       rig     Before glaciation, mountain valleys have a characteristic V shape , produced by eroding water. During glaciation, these valleys are often widened, deepened and smoothed to form a U -shaped glacial valley or glacial trough, as it is sometimes called. Glacial Landforms: Trough The erosion that creates glacial valleys truncates any spurs of rock or earth that may have earlier extended across the valley, creating broadly triangular-shaped cliffs called truncated spurs . Within glacial valleys, depressions created by plucking and abrasion can be filled by lakes, called paternoster lake s. If a glacial valley runs into a large body of water, it forms a fjord .     Typically glaciers deepen their valleys more than their smaller tributaries . Therefore, when glaciers recede, the valleys of the tributary glaciers remain above the main glaciers depression and are called hanging valley s.     At the start of a classic valley glacier is a bowl-shaped cirque , which has escarped walls on three sides but is open on the side that descends into the valley. Cirques are where ice begins to accumulate in a glacier. Two glacial cirques may form back to back and erode their backwalls until only a narrow ridge, called an arête is left. This structure may result in a mountain pass . If multiple cirques encircle a single mountain, they create pointed pyramidal peak s; particularly steep examples are called horns .       Passage of glacial ice over an area of bedrock may cause the rock to be sculpted into a knoll called a ": null
    },
    {
        "roche moutonnée": "Roche Moutonnée"
    },
    {
        ", or sheepback rock. Roches moutonnées may be elongated, rounded and asymmetrical in shape. They range in length from less than a meter to several hundred meters long. Glaciers & Glaciation Douglas Benn and David Evans, pp324-326 Roches moutonnées have a gentle slope on their up-glacier sides and a steep to vertical face on their down-glacier sides. The glacier abrades the smooth slope on the upstream side as it flows along, but tears rock fragments loose and carries them away from the downstream side via plucking .       As the water that rises from the ablation zone moves away from the glacier, it carries fine eroded sediments with it. As the speed of the water decreases, so does its capacity to carry objects in suspension. The water thus gradually deposits the sediment as it runs, creating an alluvial plain . When this phenomenon occurs in a valley, it is called a valley train. When the deposition is in an estuary , the sediments are known as bay mud .     Outwash plains and valley trains are usually accompanied by basins known as kettles . These are small lakes formed when large ice blocks that are trapped in alluvium melt and produce water-filled depressions. Kettle diameters range from 5  m to 13  km, with depths of up to 45  meters. Most are circular in shape because the blocks of ice that formed them were rounded as they melted.       thu   When a glaciers size shrinks below a critical point, its flow stops and it becomes stationary. Meanwhile, meltwater within and beneath the ice leaves stratified alluvial deposits. These deposits, in the forms of columns, terraces and clusters, remain after the glacier melts and are known as glacial deposits .     Glacial deposits that take the shape of hills or mounds are called ": null
    },
    {
        "kames": "Kame"
    },
    {
        " . Some kames form when meltwater deposits sediments through openings in the interior of the ice. Others are produced by fans or deltas created by meltwater. When the glacial ice occupies a valley, it can form terraces or kames along the sides of the valley.     Long, sinuous glacial deposits are called ": null
    },
    {
        "eskers": "Esker"
    },
    {
        " . Eskers are composed of sand and gravel that was deposited by meltwater streams that flowed through ice tunnels within or beneath a glacier. They remain after the ice melts, with heights exceeding 100  meters and lengths of as long as 100  km.       Very fine glacial sediments or rock flour is often picked up by wind blowing over the bare surface and may be deposited great distances from the original fluvial deposition site. These eolian loess deposits may be very deep, even hundreds of meters, as in areas of China and the Midwestern United States of America. Katabatic wind s can be important in this process.         rig   Large masses, such as ice sheets or glaciers, can depress the crust of the Earth into the mantle. The depression usually totals a third of the ice sheet or glaciers thickness. After the ice sheet or glacier melts, the mantle begins to flow back to its original position, pushing the crust back up. This post-glacial rebound , which proceeds very slowly after the melting of the ice sheet or glacier, is currently occurring in measurable amounts in Scandinavia and the Great Lakes region of North America.     A geomorphological feature created by the same process on a smaller scale is known as dilation-faulting": null
    }
]