[
    {
        "            , or in English co-ordination, was in ": null
    },
    {
        "Nazi term": "Nazi Term"
    },
    {
        "inology the process of Nazification by which ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        " and the ": null
    },
    {
        "Nazi Party": "Nazi Party"
    },
    {
        " successively established a system of ": null
    },
    {
        "totalitarian": "Totalitarian"
    },
    {
        " control and coordination over all aspects of German society and societies occupied by ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        " from the economy and trade associations to the media, culture and education .     The apex of the Nazification of Germany was in the resolutions approved during the ": null
    },
    {
        "Nuremberg Rally": "Nuremberg Rally"
    },
    {
        " of 1935, when the symbols of the ": null
    },
    {
        "Nazi Party": "Nazi Party"
    },
    {
        " and the State were fused  and German Jews were deprived of their citizenship .       The Nazis used the word Gleichschaltung for the process of successively establishing a system of ": null
    },
    {
        "totalitarian": "Totalitarian"
    },
    {
        " control and coordination over all aspects of German society and societies occupied by ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        ". It has been variously translated as co-ordination,  Nazification of state and society, synchronization, and bringing into line, but English texts often use the untranslated German word to convey its unique historical meaning. In their seminal work on National Socialist vernacular, Nazi-Deutsch/Nazi-German: An English Lexicon of the Language of the Third Reich, historians Robert Micheal and Karin Doerr define Gleichschaltung as: Consolidation. All of the German Volk’s social, political, and cultural organizations to be controlled and run according to Nazi ideology and policy. All opposition to be eliminated.        The Nazis were able to put  into effect due to the legal measures taken by the government during the 20 months following 30 January 1933, when ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        " became ": null
    },
    {
        "Chancellor of Germany": "Chancellor Of Germany"
    },
    {
        ".     One day after the ": null
    },
    {
        "Reichstag fire": "Reichstag Fire"
    },
    {
        " on 27 February 1933, ": null
    },
    {
        "President of Germany": "President Of Germany"
    },
    {
        " Paul von Hindenburg": "Paul Von Hindenburg"
    },
    {
        ", acting at Hitlers request and on the basis of the emergency powers in ": null
    },
    {
        "article 48": "Article 48"
    },
    {
        " of the ": null
    },
    {
        "Weimar Constitution": "Weimar Constitution"
    },
    {
        ", issued the ": null
    },
    {
        "Reichstag Fire Decree": "Reichstag Fire Decree"
    },
    {
        ". This decree suspended most ": null
    },
    {
        "citizen rights": "Citizen Rights"
    },
    {
        " provided for by the constitution and thus allowed for the arrest of political adversaries, mostly ": null
    },
    {
        "Communists": "Communists"
    },
    {
        ", and for terrorizing of other electors by the  Sturmabteilung  before the upcoming election.     In this atmosphere the  Reichstag  ": null
    },
    {
        "general election": "March 1933 German Federal Election"
    },
    {
        " of 5 March 1933 took place. The Nazis had hoped to win an outright majority and push aside their ": null
    },
    {
        "coalition partners": "Coalition Government"
    },
    {
        ", the ": null
    },
    {
        "German National Peoples Party": "German National Peoples Party"
    },
    {
        ". However, the Nazis won only 43.9 percent of the vote, well short of a majority. Despite not securing the necessary vote to secure any amendments to the existing federal constitution, the disaffection with the predecessor Weimar governments attempt at democracy was palpable and subsequent violence followed. SA units stormed the Social Democrats headquarters in ": null
    },
    {
        "Königsberg": "Königsberg"
    },
    {
        ", destroying the premises and even beating Communist Reichstag deputy Walter Schütz to death. Other non-Nazi party officials were attacked by the SA in ": null
    },
    {
        "Wuppertal": "Wuppertal"
    },
    {
        ", ": null
    },
    {
        "Cologne": "Cologne"
    },
    {
        ", ": null
    },
    {
        "Braunschweig": "Braunschweig"
    },
    {
        ", ": null
    },
    {
        "Chemnitz": "Chemnitz"
    },
    {
        ", and elsewhere throughout Germany, in a series of violent acts which continued to escalate through the summer of 1933; meanwhile the SAs membership grew to some two-million members.          When the newly elected Reichstag first convened on 23 March 1933—not including the Communist delegates because their party had been banned on 6 March—it passed the ": null
    },
    {
        "Enabling Act": "Enabling Act Of 1933"
    },
    {
        " . This law gave the government—and in practice, Hitler—the right to make laws without the involvement of the Reichstag. Throughout Germany, the Nazis were able to tighten their grip upon the state thanks to the Enabling Act. For all intents and purposes, the entire ": null
    },
    {
        "Weimar Constitution": "Weimar Constitution"
    },
    {
        " was rendered void. Soon afterwards the government banned the ": null
    },
    {
        "Social Democratic Party": "Social Democratic Party Of Germany"
    },
    {
        ", as an avalanche soon buried the other parties. By midsummer, the other parties had been intimidated into dissolving themselves rather than face arrests and ": null
    },
    {
        "concentration camp": "Nazi Concentration Camps"
    },
    {
        " imprisonment and all non-Nazi ministers of the coalition government had been compelled to resign their posts.     The First Gleichschaltung Law , passed using the Enabling Act; this law dissolved the diets of all  Länder  except the recently-elected ": null
    },
    {
        "Prussia": "Prussia"
    },
    {
        "n parliament, which the Nazis already controlled. The same law ordered the state diets reconstituted on the basis of the votes in the last Reichstag election , and also gave the state governments the same powers the Reich government possessed under the Enabling Act.     The Second Gleichschaltung Law  deployed one  in each state, apart from Prussia. These officers, responsible to ": null
    },
    {
        "Interior Minister": "Minister Of The Interior"
    },
    {
        " Wilhelm Frick": "Wilhelm Frick"
    },
    {
        ", were supposed to act as local ": null
    },
    {
        "proconsuls": "Proconsul"
    },
    {
        " in each state, with near-complete control over the state governments.     Another measure of Nazi Gleichschaltung was the passing of the ": null
    },
    {
        "Law for the Restoration of a Professional Civil Service": "Law For The Restoration Of A Professional Civil Service"
    },
    {
        " , decreed on 7 April 1933, which enabled the co-ordination of the civil service—which in Germany included not only bureaucrats, but also schoolteachers and professors, judges, prosecutors and other professionals—at both the Federal and state level, and authorized the removal of Jews and Communists from all corresponding positions.     On 14 July 1933, the Nazis passed the Law Against the Founding of New Parties , which declared the NSDAP as the countrys only legal political party. The Law Concerning the Reconstruction of the Reich  formally did away with the concept of a ": null
    },
    {
        "federal republic": "Federal Republic"
    },
    {
        ", converting Germany into a highly centralized state. The states were reduced to mere provinces, as their institutions were practically abolished altogether. All of their powers passed to the central government. A law passed on 14 February formally abolished the ": null
    },
    {
        "Reichsrat": "Reichsrat"
    },
    {
        ".          One of the most important steps towards Gleichschaltung of German society was the introduction of the Ministry of Public Enlightenment and Propaganda under ": null
    },
    {
        "Joseph Goebbels": "Joseph Goebbels"
    },
    {
        " in March 1933 and the subsequent steps taken by the Propaganda Ministry to assume full control of the press and all means of social communication. This included oversight of newspapers, magazines, films, books, public meetings and ceremonies, foreign press relations, theater, art and music, radio, and television. To this end, Goebbels said:     e secret of propaganda permeate the person it aims to grasp, without his even noticing that he is being permeated. Of course propaganda has a purpose, but the purpose must be concealed with such cleverness and virtuosity that the person on whom this purpose is to be carried out doesnt notice it at all.     This was also the purpose of co-ordination : to ensure that every aspect of the lives of German citizens was permeated with the ideas and prejudices of the Nazis. From March to July 1933 and continuing afterwards, the Nazi Party systematically eliminated or co-opted non-Nazi organizations that could potentially influence people. Those critical of Hitler and the Nazis were suppressed, intimidated or murdered.     Every national voluntary association, and every local club, was brought under Nazi control, from industrial and agricultural pressure groups to sports associations, football clubs, male voice choirs, womens organizations—in short, the whole fabric of associational life was Nazified. Rival, politically oriented clubs or societies were merged into a single Nazi body. Existing leaders of voluntary associations were either unceremoniously ousted, or knuckled under of their own accord. Many organizations expelled leftish or liberal members and declared their allegiance to the new state and its institutions. The whole process ... went on all over Germany. ... By the end, virtually the only non-Nazi associations left were the army and the Churches with their lay organizations.     An important part of the co-ordination effort was the purging of the civil service, both at the Federal and state level. Top Federal civil servants—the State Secretaries—were largely replaced if they werent sympathetic to the Nazi program, as were the equivalent bureaucrats in the states, but Nazification took place at every level. Civil servants rushed to join the Nazi Party, fearing that if they did not they would lose their jobs. At the local level, mayors and councils were terrorized by Nazi stormtroopers of the ": null
    },
    {
        "SA": "Sturmabteilung"
    },
    {
        " and ": null
    },
    {
        "SS": "Schutzstaffel"
    },
    {
        " into resigning or following orders to replace officials and workers at local public institutions who were Jewish or belonged to other political parties.     The  also included the formation of various organisations with compulsory membership for segments of the population, in particular the youth of Germany. Boys first served as apprentices in the  , beginning at the age of six, and at age ten, entered the  and served there until entering the ": null
    },
    {
        "Hitler Youth": "Hitler Youth"
    },
    {
        " proper at age fourteen. Boys remained there until age eighteen, at which time they entered into the  Arbeitsdienst  and the ": null
    },
    {
        "armed forces": "Wehrmacht"
    },
    {
        ". Girls became part of the  at age ten and at age fourteen were enrolled in the  . At eighteen, ": null
    },
    {
        "BDM": "League Of German Girls"
    },
    {
        " members went generally to the eastern territory for their , or , a year of labor on a farm. By 1940, membership in the Hitler Youth numbered some eight million.       An all-embracing recreational organization for workers, called  was set up under the auspices of the ": null
    },
    {
        "German Labor Front": "German Labor Front"
    },
    {
        " , which had been created when the Nazis forcibly dissolved the trade unions on 2 May 1933, thus eviscerating the labor movement. Hobbies were regimented, and all private clubs, whether they be for chess, football, or woodworking, were brought under the control of Strength Through Joy, which also provided vacation trips, skiing, swimming, concerts, and ocean cruises. Some 43 million Germans enjoyed trips via the Strength Through Joy initiative and it was this effort which helped inspire the idea of Germans enjoying the acquisition of automobiles and the construction of the  Autobahn . It was the largest of the many organizations established by the Nazis and a propaganda success. Workers were also brought in line with the party, through activities such as the , a national vocational competition.       Historian ": null
    },
    {
        "Claudia Koonz": "Claudia Koonz"
    },
    {
        " explains that the word Gleichschaltung stems from the arena of ": null
    },
    {
        "electricity": "Electricity"
    },
    {
        ", where it refers to converting power from ": null
    },
    {
        "alternating current": "Alternating Current"
    },
    {
        " to ": null
    },
    {
        "direct current": "Direct Current"
    },
    {
        ", which is called ": null
    },
    {
        "rectification": "Rectifier"
    },
    {
        " in English; the word Gleichschaltung translates literally as phasing . Used in its socio-political sense, Gleichschaltung has no equivalent in any other language. Other similar terms were also used by the Nazis, such as Ausschaltung, which constituted the removal or switching off of anyone who stained or soiled the German nation. This seemingly clinical terminology captured both the mechanical and biological meaning for members of German society, as one German citizen visiting London explained, It means the same stream will flow through the ethnic body politic Volkskörper.      Former University of ": null
    },
    {
        "Dresden": "Dresden"
    },
    {
        " professor of romance languages, ": null
    },
    {
        "Viktor Klemperer": "Viktor Klemperer"
    },
    {
        ", who was dismissed from his post for being Jewish in 1935, and only survived his time in Germany due to being married to a prominent German woman, collected a list of terms employed in everyday speech by the Nazis, which he discussed in his book,  LTI - Lingua Tertii Imperii , published in English as The Language of the Third Reich. In this work, Klemperer contends that the Nazis made the German language itself, a servant to their ideology through its repetitive use, eventually permeating the very flesh and blood of its people. If it was sunny and pleasant, it was described as Hitler weather for instance, or if you failed to comply with Nazi ideals of racial and social conformity, you were switched off.      When the blatant emphasis of racial hatred of others seemed to reach an impasse in the school system, through radio broadcasts, or on film reels, the overseers of Nazi Gleichschaltung propaganda switched to strategies that focused more on togetherness and the we-consciousness of the collective Volk, but the mandates of Nazi coordination remained: pay homage to the Führer, expel all foreigners, sacrifice for the German people, and welcome future challenges. While greater German social and economic unity was produced through the Gleichschaltung initiatives of the regime, it was at the expense of individuality and to the social detriment of any nonconformist; and worse—it contributed to and reinforced the social and racial exclusion of anyone deemed an enemy by National Socialist doctrine.": null
    }
]