[
    {
        "An alphabetic list of modern ": null
    },
    {
        "country dance": "Country Dance"
    },
    {
        " terminology:     Active couple - for longways sets, the active couple is the couple nearest the head of the set within each minor set. There are always exactly as many active couples as minor sets. If the dance is duple minor, this works out to every other couple, while in a triple minor it is every third couple. In older dances from the seventeenth and eighteenth centuries, the active couples do more complicated figures than the inactives, whence the name; however, this is not so usual in modern dances. Active couples may also be termed first couple or the Ones, while inactives are second couple/the Twos and third couple/the Threes.     Arm right  - couples link right arms and move forward in a circle, returning to their starting positions.     Back to back - facing another person, move forward passing right shoulders and fall back to place passing left. May also start by passing left and falling back right. Called a ": null
    },
    {
        "do si do": "Dosado"
    },
    {
        " in ": null
    },
    {
        "contra dance": "Contra Dance"
    },
    {
        " .     Balance - a single, generally found in pairs, as balance forward and back.     Becket formation - a 20th-century variation of the duple minor longways set. Each couple stands either on the mens line or the womens line, with the lady on the right. Within each minor set, one couple faces the left wall of the hall and the other the right wall, rather than facing the head or foot. There are no active or inactive couples. Progression is accomplished by each couple moving to their own left along their line at the end of each iteration of the dance; thus the couples on the mens line go up, while those on the womens line go down. This was originally a ": null
    },
    {
        "contra dance form": "Contra Dance Form"
    },
    {
        " but can sometimes be found in English country dance.     Both hands - two dancers face each other and give hands right to left and left to right.     Cast - turn outward and dance up or down outside the set, as directed. The instruction cast off is frequently synonymous with cast down .     Changes of right and left - like the circular hey, but dancers give hands as they pass . The number of changes is given first .      Chassé  - slipping step to right or left as directed.     Circular hey - dancers face partners or along the line and pass right and left alternating a stated number of changes. Usually done without hands, the circular hey may also be done by more than two couples facing alternately and moving in opposite directions - usually to their original places. This name for the figure was invented by Cecil Sharp and does not appear in sources pre-1900. Nonetheless, some early country dances calling for heys have been interpreted in modern times using circular heys. In early dances, where the hey is called a double hey , it works to interpret this as an oval hey, like the modern circular hey but adapted to the straight sides of a longways formation.     Clockwise - in a ring, move to ones left. In a turn single turn to the right.     Contrary - your contrary is not your partner. In Playfords original notation, this term meant the same thing that Corner  means today.     Corner - in a two-couple minor set, the dancer diagonally opposite one. The first man and the second woman are first corners, while the first woman and second man are second corners. In other dance formations, it has similar meanings.     Counter-clockwise - the opposite of clockwise - in a ring, move right. In a turn single, turn to the left.     Cross hands - face and give left to left and right to right.     Cross over or pass - change places with another dancer moving forward and passing by the right shoulder, unless otherwise directed.     Cross and go below - cross as above and go outside below one couple, ending improper.     Double - four steps forward or back, closing the feet on the 4th step .     Fall  - dance backwards.     Figure of 8 - a weaving figure in which a moving couple crosses between a standing couple and casts around them in a figure 8 pattern. To do this once, ending in ones partners place, is a half figure of 8; to do it twice, returning to ones own place, is a full figure of 8. The right of way in the cross has traditionally been given to the lady; some communities prefer to give it to whichever dancer is coming from the left-hand side. In a double figure of 8, the other couple does not stand still, but performs their own figure of 8 simultaneously; they begin with the cast and end with the cross to avoid collision.     Forward - lead or move in the direction you are facing.     Grand chain - a handing hey done in a circle of more than two couples.     Gypsy - two dancers move around each other in a circular path while facing each other.     Hands across - right or left hands are given to corners, and dancers move in the direction they face. In ": null
    },
    {
        "contra dance": "Contra Dance"
    },
    {
        ", instead of taking ones corners hand, one grasps the wrist of the next dancer. Also known as a star right/left.     Hands three, four etc. - the designated number of dancers form a ring and move around in the direction indicated, usually first to the left and back to the right.     Head and foot - the head of a longways set is the end with the music; the foot is the other end. Toward the head is up, and toward the foot is down.     Hey - a weaving figure in which dancers move in single file along a set track, passing one another on alternating sides . In ": null
    },
    {
        "Scottish country dance": "Scottish Country Dance"
    },
    {
        ", the hey is known as the reel.      Hole in the Wall cross - a type of cross. In a regular cross, the dancers walk past each other and turn upon reaching the other line; in a Hole in the Wall cross, they meet in the middle, make a brief half-turn without hands, and back into one anothers place, maintaining eye contact the while. Named for Hole in the Wall, a dance in which it appears.     Honour - couples step forward and right, close, shift weight, and ": null
    },
    {
        "curtsey": "Curtsey"
    },
    {
        " or ": null
    },
    {
        "bow": "Bowing"
    },
    {
        ", then repeat to their left. In the time of Playfords original manual, a womans curtsey was similar to the modern one, but a mans honour kept the upper body upright and involved sliding the left leg forward while bending the right knee      Improper - see proper.     Ladies chain - a figure in which ladies dance first with each other in the center of the set and then with the gentlemen on the sides. In its simplest form, two ladies begin in second corner positions . The ladies pass each other by right hand and turn with the gentlemen by left hand, approximately once around, to end with the ladies in each others place and the gentlemen where they began. The figure can be extended to more couples in a ring, as long as the dancers in the ring are alternating between gentlemen and ladies. If the gentlemen turn the ladies only by left hand, that is an open ladies chain; if they also place their right hands on the ladies backs during the turn, that is a closed ladies chain. In English country dance, both closed and open ladies chains are to be found, and the gentlemen make a short cast up or down the set to meet the ladies; in ": null
    },
    {
        "contra dance": "Contra Dance"
    },
    {
        ", only the closed ladies chain is done, and the gentlemen sidestep to meet the ladies. The mens chain is a simple gender reversal, but is a much rarer figure.     Lead - join inside hands and walk in a certain direction. To lead up or down is to walk toward or away from the head of the set; to lead out is to walk away from the other line of dancers.     Link - see set and link.     Longways set - a line of couples dancing together. This is usually longways for as many as will, indicating that any number of couples may join the longways set—although some dances require a three- or four-couple longways set. If the longways set is not restricted to three or four couples, it will be subdivided into minor sets of two or three couples each.      Mad Robin figure - a figure in which one couple dances around their respective neighbours. Men take one step forward and then slide to the right passing in front of their neighbour, then step backward and slide left behind their neighbour. Conversely women take one step backward and then slide to the left passing behind their neighbour, then step forward and slide right in front of their neighbour. In one version, the dancer who is going outside the set at the moment casts out to begin that motion; in the other, the active couple maintains eye contact. The term Mad Robin comes from the name of the dance which originated the figure. A version involving all four dancers was developed for contra dancing and later readmitted into some modern English dances.     Minor set - a longways set is subdivided into several minor sets. In a duple minor dance, every two couples form a minor set. In a triple minor dance, every three couples form a minor set. The active couple is always the couple in each minor set who are closest to the head. After every iteration of the dance, the progression will create new minor sets for the next iteration.     Neighbour - the person you are standing beside, but not your partner.     Opposite - the person you are facing, if you are not facing your partner.     Poussette - two dancers face, give both hands and change places as a couple with two adjacent dancers. One pair moves a double toward one wall, the other toward the other wall; they shift up or down, respectively, and move into the other couples place with another double. This completes a half-poussette; it is repeated for a whole poussette. In a draw poussette, each couple turns instead of reversing direction, so that the same dancer in each couple is always in the lead.     Progression - the process by which every couple will eventually dance with every other couple in the set, if the dance is repeated enough times. In a duple minor dance with five couples dancing, for example, the couples are initially in this order: Active /Inactive /Active /Inactive /Out . This represents two minor sets and one couple who are standing out due to having no one to dance with. After one iteration of the dance, every active couple will have moved below the inactive couple in their minor set, which in the example would be thus: Inactive /Active /Inactive /Active /Out . For the next iteration, any inactive couple at the top will stand out, while any couple standing out will begin dancing as actives or inactives . So the next iteration would begin as follows: Out /Active /Inactive /Active /Inactive . The minor sets now contain couples A-D and couples C-E, while couple B is standing out. Dances in other forms progress differently, though the triple minor progression is quite similar.     Progression, double or triple - a longways dance has a double progression if the arrangement of couples into minor sets advances twice during one iteration of the dance instead of just once. A triple-progression dance advances thrice during one iteration.     Proper - with the man on the left and the woman on the right, from the perspective of someone facing the music. Improper is the opposite. The terms carry no value judgment, but only indicate whether one is on ones home side. A dance in duple-minor longways form is termed improper if the active couples are improper by default; this is the exception in English country dance, but the rule in ": null
    },
    {
        "contra dance": "Contra Dance"
    },
    {
        ".     Right and left - see changes of right and left.     Set - a dancer steps right, closes with left foot and shifts weight to it, then steps back to the right foot ; then repeats the process mirror-image . In some areas, such as the ": null
    },
    {
        "Society for Creative Anachronism": "Society For Creative Anachronism"
    },
    {
        ", it is done starting to the left. It may be done in place or advancing. Often followed by a turn single. In ": null
    },
    {
        "Scottish country dance": "Scottish Country Dance"
    },
    {
        " there are several variations; in ": null
    },
    {
        "contra dance": "Contra Dance"
    },
    {
        " its place is generally taken by a balance right and left. Not to be confused with terms indicating groups of dancers, like longways set or minor set.     Set and link - a figure done by a pair of dancers and simultaneously by another pair of dancers who are facing them. Most commonly this means that the men do it facing the women, while the women do it facing the men. First, all dancers set; then the dancer on the left of each pair dances a turn single right, while also moving to the right, to end in his or her neighbors place. Meanwhile the dancer on the right of each pair casts to the left into his or her neighbors place; thus the men have traded places with each other, and so have the women. This figure is most commonly found in ": null
    },
    {
        "Scottish country dance": "Scottish Country Dance"
    },
    {
        ".     Sicilian circle - a type of dance formation, roughly equivalent to a longways set rolled into a ring. Every couple stands along the line of a large circle, facing another couple; thus half of the couples face clockwise, while the other half face counterclockwise. Since, unlike the longways set, the Sicilian circle has no place for dancers to stand out, Sicilian circle dances must be done by an even number of couples. The progression is similar to that of a duple minor, but since there is nowhere for couples to reverse direction, every clockwise couple will only dance with the counterclockwise couples .     Siding - two dancers go forward in four counts to meet side by side, then back in four counts to where they started the figure. As depicted by Feuillet, this is done right side by right side the first time, left by left the second time. In ": null
    },
    {
        "Cecil Sharps": "Cecil Sharp"
    },
    {
        " reconstruction, the dancers pass by left shoulder , turn to face each other, then return along the same path, passing by right shoulder; this is then repeated. So-called Cecil Sharp siding is no longer considered historical, but is still used on its own merits. Standard siding is sometimes called Pat Shaw siding to distinguish it from Cecil Sharp siding.      Single - two steps in any direction, closing feet on the second step. The second step tends to be interpreted as a closing action in which weight usually stays on the same foot as before, consistent with descriptions from Renaissance sources.     Slipping circle  - dancers take hands in a circle and chassé left or right.     Star - see hands across.     Straight hey for four - dancers face alternately, the two in the middle facing out. Dancers pass right shoulders on either end and weave to the end opposite. If the last pass at the end is by the right, the dancer turns right and reenters the line by the same shoulder; vice versa if the last pass was to the left. Dancers end in their original places.     Straight hey for three - the first dancer faces the other two and passes right shoulders with the second dancer, left shoulder with the third - the other dancers moving and passing the indicated shoulder. On making the last pass, each dancer makes a whole turn on the end, bearing right if the last pass was by the right shoulder or left if last pass was by the left, and reenters the figure returning to place. Each dancer describes a figure of eight pattern.     Swing - a turn with two hands, but moving faster and making more than one revolution. Several variants exist, including the ballroom swing and the Welsh swing.     Track figure - a generic term for any composite figure where the dancers involved travel within the set. An example track figure might be Ones cast around the Twos, cross, cast around the Threes, and lead back up to place. The figure of 8 would be considered a track figure if it were not common enough to have its own name.     Turn both-hands - face, give both hands, and make a complete circular, clockwise turn to place.     Turn by right or left - dancers join right hands and turn around, separate, and fall to places.     Turn single - dancers turn around in four steps. Turn single right is a clockwise turn; turn single left is a counterclockwise turn. May involve a backward motion, as after a set advancing.     Up a double and back": null
    }
]