[
    {
        "              Gnosticism  is a collection of ancient religious ideas and systems which originated in the first century AD among some ": null
    },
    {
        "early Christian": "Early Christian"
    },
    {
        " and ": null
    },
    {
        "Jewish": "Jewish"
    },
    {
        " sects. These various groups, labeled gnostics by their opponents, emphasised personal spiritual knowledge  over orthodox teachings, traditions, and ": null
    },
    {
        "ecclesiastical": "Ecclesiastical"
    },
    {
        " authority. They considered the principal element of ": null
    },
    {
        "salvation": "Salvation"
    },
    {
        " to be direct knowledge of the supreme divinity, experienced as intuitive or ": null
    },
    {
        "esoteric": "Esoteric"
    },
    {
        " insight. Generally, Gnostic ": null
    },
    {
        "cosmogony": "Cosmogony"
    },
    {
        " presents a distinction between a supreme, transcendent ": null
    },
    {
        "God": "God"
    },
    {
        " and a blind, evil ": null
    },
    {
        "demiurge": "Demiurge"
    },
    {
        " responsible for creating the ": null
    },
    {
        "material universe": "Nature"
    },
    {
        ", thereby trapping the ": null
    },
    {
        "divine spark": "Divine Spark"
    },
    {
        " within matter. Many Gnostic texts deal not in concepts of ": null
    },
    {
        "sin": "Sin"
    },
    {
        " and ": null
    },
    {
        "repentance": "Repentance"
    },
    {
        ", but with ": null
    },
    {
        "illusion": "Illusion"
    },
    {
        " and ": null
    },
    {
        "enlightenment": "Spiritual Enlightenment"
    },
    {
        ".      Gnostic writings flourished among certain Christian groups in the ": null
    },
    {
        "Mediterranean": "Mediterranean"
    },
    {
        " world until about the second century, when the ": null
    },
    {
        "Fathers of the early church": "Early Church Fathers"
    },
    {
        " denounced them as ": null
    },
    {
        "heresy": "Heresy"
    },
    {
        ". The Social World of the First Christians , essay Prolegomena to the Study of Ancient Gnosticism by ": null
    },
    {
        "Bentley Layton": "Bentley Layton"
    },
    {
        "  Efforts to destroy supposedly heretical texts proved largely successful, allowing for the survival of very few Gnostic texts. Nonetheless, early Gnostic teachers such as ": null
    },
    {
        "Valentinus": "Valentinus"
    },
    {
        " saw their beliefs as aligned with Christianity. In the Gnostic Christian tradition, ": null
    },
    {
        "Christ": "Christ"
    },
    {
        " is seen as a divine being which has taken human form in order to lead humanity back to the Light.  However, Gnosticism is not a single standardized system, and the emphasis on direct experience allows for a wide variety of teachings, including distinct currents such as ": null
    },
    {
        "Valentianism": "Valentianism"
    },
    {
        " and ": null
    },
    {
        "Sethianism": "Sethianism"
    },
    {
        ". In the ": null
    },
    {
        "Persian Empire": "Persian Empire"
    },
    {
        ", Gnostic ideas spread as far as China via the related movement ": null
    },
    {
        "Manichaeism": "Manichaeism"
    },
    {
        ", while ": null
    },
    {
        "Mandaeism": "Mandaeism"
    },
    {
        " is still alive in ": null
    },
    {
        "Iraq": "Iraq"
    },
    {
        ".     For centuries, most scholarly knowledge of Gnosticism was limited to the anti-heretical writings of orthodox Christian figures such as ": null
    },
    {
        "Irenaeus of Lyons": "Irenaeus Of Lyons"
    },
    {
        " and ": null
    },
    {
        "Hippolytus of Rome": "Hippolytus Of Rome"
    },
    {
        ". Renewed interest in Gnosticism occurred after the 1945 discovery of Egypts ": null
    },
    {
        "Nag Hammadi library": "Nag Hammadi Library"
    },
    {
        ", a collection of rare early Christian and Gnostic texts, including the ": null
    },
    {
        "Gospel of Thomas": "Gospel Of Thomas"
    },
    {
        " and the ": null
    },
    {
        "Apocryphon of John": "Apocryphon Of John"
    },
    {
        ". A major question in scholarly research is the qualification of Gnosticism as either an interreligious phenomenon or as an independent religion. Scholars have acknowledged the influence of sources such as ": null
    },
    {
        "Hellenistic Judaism": "Hellenistic Judaism"
    },
    {
        " and ": null
    },
    {
        "Platonism": "Platonism"
    },
    {
        ", and some have noted possible links to ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        " and ": null
    },
    {
        "Hinduism": "Hinduism"
    },
    {
        ", though the evidence of direct influence from these latter sources is inconclusive.          Gnosis refers to knowledge based on personal experience or perception. In a religious context, gnosis is ": null
    },
    {
        "mystical": "Mysticism"
    },
    {
        " or esoteric ": null
    },
    {
        "knowledge": "Knowledge"
    },
    {
        " based on direct participation with the divine. In most Gnostic systems, the sufficient cause of salvation is this knowledge of the divine. It is an inward knowing , comparable to that encouraged by ": null
    },
    {
        "Plotinus": "Plotinus"
    },
    {
        " , and differs from ": null
    },
    {
        "proto-orthodox Christian": "Proto-Orthodox Christianity"
    },
    {
        " views. Gnostics are those who are oriented toward knowledge and understanding  – or perception and learning  – as a particular modality for living .      The usual meaning of gnostikos in Classical Greek texts is learned or intellectual , such as used by ": null
    },
    {
        "Plato": "Plato"
    },
    {
        " in the comparison of practical  and intellectual . Platos use of learned is fairly typical of Classical texts.     By the ": null
    },
    {
        "Hellenistic period": "Hellenistic Period"
    },
    {
        ", it began to also be associated with ": null
    },
    {
        "Greco-Roman mysteries": "Greco-Roman Mysteries"
    },
    {
        ", becoming synonymous with the Greek term musterion. The adjective is not used in the New Testament, but ": null
    },
    {
        "Clement of Alexandria": "Clement Of Alexandria"
    },
    {
        " speaks of the learned  Christian in complimentary terms. ": null
    },
    {
        "Morton Smith": "Morton Smith"
    },
    {
        " History of the term gnostikos 1973 The use of gnostikos in relation to heresy originates with interpreters of ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        ". Some scholars consider that Irenaeus sometimes uses gnostikos to simply mean intellectual , whereas his mention of the intellectual sect  is a specific designation.     The term Gnosticism does not appear in ancient sources, and was first coined in the 17th century by ": null
    },
    {
        "Henry More": "Henry More"
    },
    {
        " in a commentary on the seven letters of the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ", where More used the term Gnosticisme to describe the heresy in ": null
    },
    {
        "Thyatira": "Thyatira"
    },
    {
        ". The term Gnosticism was derived from the use of the Greek adjective gnostikos by St. Irenaeus to describe the school of ": null
    },
    {
        "Valentinus": "Valentinus"
    },
    {
        " as he legomene gnostike haeresis the heresy called Learned . Stephen Charles Haar Simon Magus: the first gnostic? p. 231        The earliest origins of Gnosticism are obscure and still disputed. The proto-orthodox Christian groups called Gnostics a heresy of Christianity,  but according to the modern scholars the theologys origin is closely related to Jewish sectarian milieus and early Christian sects. Scholars debate Gnosticisms origins as having roots in ": null
    },
    {
        "Neoplatonism": "Neoplatonism"
    },
    {
        " and ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        ", due to similarities in beliefs, but ultimately, its origins are currently unknown. As Christianity developed and became more popular, so did Gnosticism, with both proto-orthodox Christian and Gnostic Christian groups often existing in the same places. The Gnostic belief was widespread within Christianity until the proto-orthodox Christian communities expelled the group in the second and third centuries . Gnosticism became the first group to be declared ": null
    },
    {
        "heretical": "Heresy"
    },
    {
        ".     Some scholars prefer to speak of gnosis when referring to first-century ideas that later developed into gnosticism, and to reserve the term gnosticism for the synthesis of these ideas into a coherent movement in the second century. Wilson, R. McL. Nag Hammadi and the New Testament , New Testament Studies, vol. 28, , p. 292. According to ": null
    },
    {
        "James M. Robinson": "James M. Robinson"
    },
    {
        ", no gnostic texts clearly pre-date Christianity, and pre-Christian Gnosticism as such is hardly attested in a way to settle the debate once and for all. J. M. Robinson, Jesus: From Easter to Valentinus , Journal of Biblical Literature, 101 , p. 5. However, the Nag Hammadi library contained Hermetic teachings that can be argued go back to the Old Egyptian Kingdom .           Contemporary scholarship largely agrees that Gnosticism has ": null
    },
    {
        "Jewish Christian": "Jewish Christian"
    },
    {
        " origins, originating in the late first century AD in nonrabbinical Jewish sects and early Christian sects.     Many heads of gnostic schools were identified as Jewish Christians by Church Fathers, and Hebrew words and names of God were applied in some gnostic systems. Jewish Encyclopedia,  The ": null
    },
    {
        "cosmogonic": "Religious Cosmology"
    },
    {
        " speculations among Christian Gnostics had partial origins in ": null
    },
    {
        "Maaseh Bereshit": "Maaseh Bereshit"
    },
    {
        " and  Maaseh Merkabah . This thesis is most notably put forward by ": null
    },
    {
        "Gershom Scholem": "Gershom Scholem"
    },
    {
        " and ": null
    },
    {
        "Gilles Quispel": "Gilles Quispel"
    },
    {
        " . Scholem detected Jewish gnosis in the imagery of the ": null
    },
    {
        "merkavah": "Merkavah"
    },
    {
        ", which can also be found in Christian Gnostic documents, for example the being caught away to the ": null
    },
    {
        "third heaven": "Third Heavenchristianity"
    },
    {
        " mentioned by ": null
    },
    {
        "Paul the Apostle": "Paul The Apostle"
    },
    {
        ". Quispel sees Gnosticism as an independent Jewish development, tracing its origins to Alexandrian Jews, to which group Valentinus was also connected.     Many of the ": null
    },
    {
        "Nag Hammadi texts": "Nag Hammadi Texts"
    },
    {
        " make reference to Judaism, in some cases with a violent rejection of the Jewish God. ": null
    },
    {
        "Gershom Scholem": "Gershom Scholem"
    },
    {
        " once described Gnosticism as the Greatest case of metaphysical anti-Semitism .  Professor ": null
    },
    {
        "Steven Bayme": "Steven Bayme"
    },
    {
        " said gnosticism would be better characterized as ": null
    },
    {
        "anti-Judaism": "Anti-Judaism"
    },
    {
        ". Understanding Jewish History: Texts and Commentaries by ": null
    },
    {
        "Steven Bayme": "Steven Bayme"
    },
    {
        " Publisher: Ktav Publishing House   Recent research into the origins of Gnosticism shows a strong Jewish influence, particularly from ": null
    },
    {
        "Hekhalot": "Merkabahhekhalot"
    },
    {
        " literature. Idel, Moshe. Kabbalah: New Perspectives, ": null
    },
    {
        "Yale University Press": "Yale University Press"
    },
    {
        ", 1990, .      Within early Christianity, the teachings of Paul and ": null
    },
    {
        "John": "John The Evangelist"
    },
    {
        " may have been a starting point for Gnostic ideas, with a growing emphasis on the opposition between flesh and spirit, the value of charisma, and the disqualification of the Jewish law. The mortal body belonged to the world of inferior, worldly powers , and only the spirit or soul could be saved. The term gnostikos may have acquired a deeper significance here.     Alexandria was of central importance for the birth of Gnosticism. The Christian ecclesia was of Jewish–Christian origin, but also attracted Greek members, and various strand of thought were available, such as Judaic ": null
    },
    {
        "apocalypticism": "Apocalypticism"
    },
    {
        ", ": null
    },
    {
        "speculation on divine wisdom": "Wisdom"
    },
    {
        ", Greek philosophy, and Hellenistic ": null
    },
    {
        "mystery religions": "Mystery Religions"
    },
    {
        ".      Regarding the angel Christology of some early Christians, Darrell Hannah notes:        The ": null
    },
    {
        "pseudepigraphical": "Pseudepigrapha"
    },
    {
        " Christian text  Ascension of Isaiah  identifies Jesus with angel Christology:        ": null
    },
    {
        "The Shepherd of Hermas": "The Shepherd Of Hermas"
    },
    {
        " is a Christian literary work considered as ": null
    },
    {
        "canonical scripture": "Biblical Canon"
    },
    {
        " by some of the early ": null
    },
    {
        "Church fathers": "Church Fathers"
    },
    {
        " such as ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        ". Jesus is identified with angel Christology in parable 5, when the author mentions a Son of God, as a virtuous man filled with a Holy pre-existent spirit .           In the 1880s Gnostic connections with neo-Platonism were proposed. Ugo Bianchi, who organised the Congress of Messina of 1966 on the origins of Gnosticism, also argued for Orphic and Platonic origins. Gnostics borrowed significant ideas and terms from Platonism,  using Greek philosophical concepts throughout their text, including such concepts as ": null
    },
    {
        "hypostasis": "Hypostasis"
    },
    {
        " ,  ousia  , and demiurge . Both ": null
    },
    {
        "Sethian": "Sethian"
    },
    {
        " Gnostics and ": null
    },
    {
        "Valentinian": "Valentinius"
    },
    {
        " Gnostics seem to have been influenced by ": null
    },
    {
        "Plato": "Plato"
    },
    {
        ", ": null
    },
    {
        "Middle Platonism": "Middle Platonism"
    },
    {
        ", and ": null
    },
    {
        "Neo-Pythagoreanism": "Neo-Pythagoreanism"
    },
    {
        " academies or schools of thought. Both schools attempted an effort towards conciliation, even affiliation with late antique philosophy, Schenke, Hans Martin. The Phenomenon and Significance of Gnostic Sethianism in The Rediscovery of Gnosticism. E.J. Brill 1978 and were rebuffed by some ": null
    },
    {
        "Neoplatonists": "Neoplatonism"
    },
    {
        ", including Plotinus.       Early research into the origins of Gnosticism proposed Persian origins or influences, spreading to Europe and incorporating Jewish elements. According to ": null
    },
    {
        "Wilhelm Bousset": "Wilhelm Bousset"
    },
    {
        " , Gnosticism was a form of Iranian and Mesopotamian syncretism, and ": null
    },
    {
        "Richard August Reitzenstein": "Richard August Reitzenstein"
    },
    {
        " most famously situated the origins of Gnosticism in Persia.     Carsten Colpe has analyzed and criticised the Iranian hypothesis of Reitzenstein, showing that many of his hypotheses are untenable. Nevertheless, Geo Widengren argued for the origin of Gnosticism in ": null
    },
    {
        "Mazdean": "Mazdean"
    },
    {
        " Zurvanism": "Zurvanism"
    },
    {
        ", in conjunction with ideas from the Aramaic Mesopotamian world.          In 1966, at the Congress of Median, Buddhologist ": null
    },
    {
        "Edward Conze": "Edward Conze"
    },
    {
        " noted phenomenological commonalities between ": null
    },
    {
        "Mahayana Buddhism": "Mahayana Buddhism"
    },
    {
        " and Gnosticism, in his paper Buddhism and Gnosis, following an early suggestion put forward by ": null
    },
    {
        "Isaac Jacob Schmidt": "Isaac Jacob Schmidt"
    },
    {
        ". The influence of Buddhism in any sense on either the gnostikos Valentinus  or the Nag Hammadi texts is not supported by modern scholarship, although ": null
    },
    {
        "Elaine Pagels": "Elaine Pagels"
    },
    {
        " called it a possibility .               The Syrian–Egyptian traditions postulate a remote, supreme Godhead, the ": null
    },
    {
        "Monad": "Monad"
    },
    {
        ". From this highest divinity ": null
    },
    {
        "emanate": "Emanationism"
    },
    {
        " lower divine beings, known as ": null
    },
    {
        "Aeons": "Aeon"
    },
    {
        ". The ": null
    },
    {
        "Demiurge": "Demiurge"
    },
    {
        ", one of those Aeons, creates the physical world. Divine elements fall into the material realm, and are locked within human beings. This divine element returns to the divine realm when Gnosis, ": null
    },
    {
        "esoteric": "Wikt:Esoteric"
    },
    {
        " or ": null
    },
    {
        "intuitive knowledge": "Intuition"
    },
    {
        " of the divine element within, is obtained.       Gnostic systems postulate a ": null
    },
    {
        "dualism": "Dualistic Cosmology"
    },
    {
        " between God and the world, Hans Jonas, The Gnostic Religion, p. 42, Beacon Press, 1963, ; 1st ed. 1958 varying from the radical dualist systems of ": null
    },
    {
        "Manichaeism": "Manichaeism"
    },
    {
        " to the mitigated dualism of classic gnostic movements. Radical dualism, or absolute dualism, posits two co-equal divine forces, while in mitigated dualism one of the two principles is in some way inferior to the other. In qualified monism the second entity may be divine or semi-divine. Valentinian Gnosticism is a form of ": null
    },
    {
        "monism": "Monism"
    },
    {
        ", expressed in terms previously used in a dualistic manner.       Gnostics tended toward ": null
    },
    {
        "asceticism": "Asceticism"
    },
    {
        ", especially in their sexual and dietary practice. Layton, Bentley . The Gnostic Scriptures. SCM Press  – Introduction to Against Heresies by St. Irenaeus In other areas of morality, Gnostics were less rigorously ascetic, and took a more moderate approach to correct behaviour. In normative early Christianity the ": null
    },
    {
        "Church": "Local Church"
    },
    {
        " administered and prescribed the correct behaviour for Christians, while in Gnosticism it was the internalised motivation that was important. Ritualistic behaviour was not important unless it was based on a personal, internal motivation. Ptolemys Epistle to Flora describes a general asceticism, based on the moral inclination of the individual.              In many Gnostic systems, God is known as the Monad, ": null
    },
    {
        "the One": "Neoplatonismthe One"
    },
    {
        ". God is the high source of the pleroma, the region of light. The various emanations of God are called æons. According to Hippolytus, this view was inspired by the ": null
    },
    {
        "Pythagoreans": "Pythagoreans"
    },
    {
        ", who called the first thing that came into existence the Monad, which begat the dyad, which begat the numbers, which begat the ": null
    },
    {
        "point": "Point"
    },
    {
        ", begetting ": null
    },
    {
        "lines": "Line"
    },
    {
        ", etc.     The Sethian cosmogony as most famously contained in the ": null
    },
    {
        "Apocryphon of John": "Apocryphon Of John"
    },
    {
        " describes an unknown God, very similar to the ": null
    },
    {
        "orthodox": "Orthodoxy"
    },
    {
        " apophatic theology": "Apophatic Theology"
    },
    {
        ", but different from the orthodox teachings that this God is the creator of heaven and earth. Orthodox theologians often attempt to define God through a series of explicit positive statements: he is ": null
    },
    {
        "omniscient": "Omniscient"
    },
    {
        ", ": null
    },
    {
        "omnipotent": "Omnipotent"
    },
    {
        ", and truly ": null
    },
    {
        "benevolent": "Omnibenevolence"
    },
    {
        ". The Sethian hidden transcendent God is, by contrast, defined through ": null
    },
    {
        "negative theology": "Negative Theology"
    },
    {
        "hermaphroditic": "Hermaphroditic"
    },
    {
        ", a potent symbol for being, as it were, all-containing . In the Apocryphon of John, this god is good in that it bestows goodness. After the apophatic statements, the process of the Divine in action is used to describe the effect of such a god.          Pleroma refers to the totality of Gods powers. The heavenly pleroma is the center of divine life, a region of light above our world, occupied by spiritual beings such as aeons and sometimes archons. Jesus is interpreted as an intermediary aeon who was sent from the pleroma, with whose aid humanity can recover the lost knowledge of the divine origins of humanity. The term is thus a central element of Gnostic ": null
    },
    {
        "cosmology": "Cosmology"
    },
    {
        ".     Pleroma is also used in the general Greek language, and is used by the ": null
    },
    {
        "Greek Orthodox church": "Greek Orthodox Church"
    },
    {
        " in this general form, since the word appears in the ": null
    },
    {
        "Epistle to the Colossians": "Epistle To The Colossians"
    },
    {
        ". Proponents of the view that ": null
    },
    {
        "Paul was actually a gnostic": "Gnosticism And The New Testament"
    },
    {
        ", such as ": null
    },
    {
        "Elaine Pagels": "Elaine Pagels"
    },
    {
        ", view the reference in Colossians as a term that has to be interpreted in a gnostic sense.          The Supreme Light or Consciousness descends through a series of stages, gradations, worlds, or hypostases, becoming progressively more material and embodied. In time it will turn around to return to the One , retracing its steps through spiritual knowledge and contemplation.          In many Gnostic systems, the aeons are the various emanations of the superior God or Monad. From this first being, also an æon, a series of different emanations occur, beginning in certain Gnostic texts with the ": null
    },
    {
        "hermaphroditic": "Hermaphrodite"
    },
    {
        " Barbelo,   from which successive pairs of aeons emanate, often in male–female pairings called syzygies.  The numbers of these pairings varied from text to text, though some identify their number as being thirty.  The aeons as a totality constitute the pleroma, the region of light . The lowest regions of the pleroma are closest to the darkness; that is, the physical world      Two of the most commonly paired æons were Christ and Sophia ; the latter refers to Christ as her consort in A Valentinian Exposition.           In Gnostic tradition, the term Sophia refers to the final and lowest emanation of God. In most if not all versions of the gnostic myth, Sophia births the demiurge, who in turn brings about the creation of materiality. The positive or negative depiction of materiality thus resides a great deal on mythic depictions of Sophias actions. She is occasionally referred to by the ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " equivalent of Achamoth . Jewish Gnosticism with a focus on Sophia was active by 90  AD.     Sophia, emanating without her partner, resulted in the production of the Demiurge ,  who is also referred to as Yaldabaoth and variations thereof in some Gnostic texts. This creature is concealed outside the pleroma; in isolation, and thinking itself alone, it creates materiality and a host of co-actors, referred to as archons. The demiurge is responsible for the creation of mankind; trapping elements of the pleroma stolen from Sophia inside human bodies.  In response, the Godhead emanates two savior aeons, Christ and the Holy Spirit; Christ then embodies itself in the form of Jesus, in order to be able to teach man how to achieve gnosis, by which they may return to the pleroma.             The term demiurge derives from the ": null
    },
    {
        "Latin": "Latin"
    },
    {
        "ized form of the Greek term dēmiourgos, δημιουργός, literally public or skilled worker . This figure is also called Yaldabaoth , ": null
    },
    {
        "Samael": "Samael"
    },
    {
        " , or Saklas , who is sometimes ignorant of the superior god, and sometimes opposed to it; thus in the latter case he is correspondingly malevolent. Other names or identifications are ": null
    },
    {
        "Ahriman": "Ahriman"
    },
    {
        ", ": null
    },
    {
        "El": "El"
    },
    {
        ", ": null
    },
    {
        "Satan": "Satan"
    },
    {
        ", and ": null
    },
    {
        "Yahweh": "Yahweh"
    },
    {
        ".     The demiurge creates the ": null
    },
    {
        "physical universe": "Physical Universe"
    },
    {
        " and the physical aspect of ": null
    },
    {
        "humanity": "Human Nature"
    },
    {
        ".  The demiurge typically creates a group of co-actors named ": null
    },
    {
        "archons": "Archon"
    },
    {
        " who preside over the material realm and, in some cases, present obstacles to the soul seeking ascent from it. The inferiority of the demiurges creation may be compared to the technical inferiority of a work of art, painting, sculpture, etc. to the thing the art ": null
    },
    {
        "represents": "Mimesis"
    },
    {
        ". In other cases it takes on a more ": null
    },
    {
        "ascetic": "Ascetic"
    },
    {
        " tendency to view material existence negatively, which then becomes more extreme when materiality, including the human body, is perceived as evil and constrictive, a deliberate prison for its inhabitants.     Moral judgements of the demiurge vary from group to group within the broad category of Gnosticism, viewing materiality as being inherently evil, or as merely flawed and as good as its passive constituent matter allows.           In late antiquity some variants of Gnosticism used the term archon to refer to several servants of the demiurge.   According to ": null
    },
    {
        "Origens": "Origen"
    },
    {
        "  Contra Celsum , a sect called the ": null
    },
    {
        "Ophites": "Ophites"
    },
    {
        " posited the existence of seven archons, beginning with Iadabaoth or Ialdabaoth, who created the six that follow: Iao, ": null
    },
    {
        "Sabaoth": "Sabaoth"
    },
    {
        ", Adonaios, Elaios, Astaphanos, and Horaios.  Similarly to the ": null
    },
    {
        "Mithraic": "Mithraic"
    },
    {
        " Kronos": "Chronos"
    },
    {
        " and ": null
    },
    {
        "Vedic": "Historical Vedic Religion"
    },
    {
        " Narasimha": "Narasimha"
    },
    {
        ", a form of ": null
    },
    {
        "Vishnu": "Vishnu"
    },
    {
        ", Ialdabaoth had a head of a lion.         Other Gnostic concepts are: ": null
    },
    {
        "sarkic": "Sarkic"
    },
    {
        " – earthly, hidebound, ignorant, uninitiated. The lowest level of human thought; the fleshly, instinctive level of thinking.   ": null
    },
    {
        "hylic": "Hylic"
    },
    {
        " – lowest order of the three types of human. Unable to be saved since their thinking is entirely material, incapable of understanding the gnosis.   psychic – soulful , partially initiated. Matter-dwelling spirits   ": null
    },
    {
        "pneumatic": "Pneumatic"
    },
    {
        " – spiritual , fully initiated, immaterial souls escaping the doom of the material world via gnosis.   ": null
    },
    {
        "kenoma": "Kenoma"
    },
    {
        " – the visible or manifest cosmos, lower than the pleroma   ": null
    },
    {
        "charisma": "Charisma"
    },
    {
        " – gift, or energy, bestowed by pneumatics through oral teaching and personal encounters   ": null
    },
    {
        "logos": "Logos"
    },
    {
        " – the divine ordering principle of the cosmos; personified as Christ. See also ": null
    },
    {
        "Odic force": "Odic Force"
    },
    {
        ".   ": null
    },
    {
        "hypostasis": "Hypostasis"
    },
    {
        " – literally that which stands beneath the inner reality, emanation of God, known to psychics   ": null
    },
    {
        "ousia": "Ousia"
    },
    {
        " – essence of God, known to pneumatics. Specific individual things or being.       Jesus is identified by some Gnostics as an embodiment of the ": null
    },
    {
        "supreme being": "God"
    },
    {
        " who became ": null
    },
    {
        "incarnate": "Incarnate"
    },
    {
        " to bring gnōsis to the earth,   while others adamantly denied that the supreme being came in the flesh, claiming Jesus to be merely a human who attained divinity through gnosis and taught his disciples to do the same. Among the ": null
    },
    {
        "Mandaeans": "Mandaeans"
    },
    {
        ", Jesus was considered a mšiha kdaba or ": null
    },
    {
        "false messiah": "False Messiah"
    },
    {
        " who perverted the teachings entrusted to him by ": null
    },
    {
        "John the Baptist": "John The Baptist"
    },
    {
        ".  Still other traditions identify ": null
    },
    {
        "Mani": "Mani"
    },
    {
        " and ": null
    },
    {
        "Seth": "Seth"
    },
    {
        ", third son of ": null
    },
    {
        "Adam and Eve": "Adam And Eve"
    },
    {
        ", as salvific figures.       Three periods can be discerned in the development of Gnosticism:   ": null
    }
]