[
    {
        "          The drachma  was the ": null
    },
    {
        "currency": "Currency"
    },
    {
        " used in ": null
    },
    {
        "Greece": "Greece"
    },
    {
        " during several periods in its history:   An ": null
    },
    {
        "ancient Greek": "Ancient Greece"
    },
    {
        " currency unit issued by many ": null
    },
    {
        "Greek city states": "Greek City States"
    },
    {
        " during a period of ten centuries, from the ": null
    },
    {
        "Archaic period": "Archaic Greece"
    },
    {
        " throughout the ": null
    },
    {
        "Classical period": "Classical Greece"
    },
    {
        ", the ": null
    },
    {
        "Hellenistic period": "Hellenistic Period"
    },
    {
        " up to the ": null
    },
    {
        "Roman period": "Roman Greece"
    },
    {
        " under ": null
    },
    {
        "Greek Imperial Coinage": "Roman Provincial Currency"
    },
    {
        ".   Three ": null
    },
    {
        "modern Greek": "History Of Modern Greece"
    },
    {
        " currencies, the first introduced in 1832 and the last replaced by the ": null
    },
    {
        "euro": "Euro"
    },
    {
        " in 2001 . The euro did not begin circulating until 2002 but the exchange rate was fixed on 19 June 2000, with legal introduction of the euro taking place in January 2002.     It was also a ": null
    },
    {
        "small unit of weight": "Dram"
    },
    {
        ". .              The name drachma is derived from the verb  . It is believed that the same word with the meaning of handful or handle is found in ": null
    },
    {
        "Linear B": "Linear B"
    },
    {
        " tablets of the ": null
    },
    {
        "Mycenean": "Mycenaean Greece"
    },
    {
        " Pylos": "Pylos"
    },
    {
        ".   Initially a drachma was a fistful of six ": null
    },
    {
        "oboloí or obeloí": "Obolus"
    },
    {
        "  used as a form of currency as early as 1100  BC and being a form of bullion : bronze, copper, or iron ingots denominated by weight. A ": null
    },
    {
        "hoard": "Hoard"
    },
    {
        " of over 150 rod-shaped obeloi was uncovered at ": null
    },
    {
        "Heraion of Argos": "Heraion Of Argos"
    },
    {
        " in ": null
    },
    {
        "Peloponnese": "Peloponnese"
    },
    {
        ". Six of them are displayed at the ": null
    },
    {
        "Numismatic Museum of Athens": "Numismatic Museum Of Athens"
    },
    {
        ".     It was the standard unit of silver coinage at most ancient Greek mints, and the name obol was used to describe a coin that was one-sixth of a drachma. The notion that drachma derived from the word for fistful was recorded by ": null
    },
    {
        "Herakleides of Pontos": "Heraclides Ponticus"
    },
    {
        " who was informed by the priests of Heraion that ": null
    },
    {
        "Pheidon": "Pheidon"
    },
    {
        ", king of Argos, dedicated rod-shaped obeloi to Heraion. Similar information about Pheidons obeloi was also recorded at the ": null
    },
    {
        "Parian Chronicle": "Parian Chronicle"
    },
    {
        ".     ": null
    },
    {
        "Ancient Greek coins": "Ancient Greek Coinage"
    },
    {
        " normally had distinctive names in daily use. The Athenian ": null
    },
    {
        "tetradrachm": "Tetradrachm"
    },
    {
        " was called ": null
    },
    {
        "owl": "Owl Of Athena"
    },
    {
        ", ": null
    },
    {
        "Philochorus": "Philochorus"
    },
    {
        "Aeginetic stater": "Aeginacoinage And Sea Power"
    },
    {
        " was called ": null
    },
    {
        "chelone": "Chelone"
    },
    {
        ", the Corinthian ": null
    },
    {
        "stater": "Stater"
    },
    {
        " was called hippos  and so on. Each city would mint its own and have them stamped with recognizable ": null
    },
    {
        "symbols of the city": "Ancient Greek Coinagecoins As A Symbol Of The City-State"
    },
    {
        ", known as ": null
    },
    {
        "badge": "Badge"
    },
    {
        " in numismatics, along with suitable inscriptions, and they would often be referred to either by the name of the city or of the image depicted. The exact exchange value of each was determined by the quantity and quality of the metal, which reflected on the reputation of each mint.     Among the Greek cities that used the drachma were: ": null
    },
    {
        "Abdera": "Abdera, Thrace"
    },
    {
        ", ": null
    },
    {
        "Abydos": "Abydos"
    },
    {
        ", ": null
    },
    {
        "Alexandria": "Alexandria"
    },
    {
        ", ": null
    },
    {
        "Aetna": "Aetna"
    },
    {
        ", ": null
    },
    {
        "Antioch": "Antioch"
    },
    {
        ", ": null
    },
    {
        "Athens": "Athens"
    },
    {
        ", ": null
    },
    {
        "Chios": "Chios"
    },
    {
        ", ": null
    },
    {
        "Cyzicus": "Cyzicus"
    },
    {
        ", ": null
    },
    {
        "Corinth": "Corinth"
    },
    {
        ", ": null
    },
    {
        "Ephesus": "Ephesus"
    },
    {
        ", ": null
    },
    {
        "Eretria": "Eretria"
    },
    {
        ", ": null
    },
    {
        "Gela": "Gela"
    },
    {
        ", ": null
    },
    {
        "Catana": "Catana"
    },
    {
        ", ": null
    },
    {
        "Kos": "Kos"
    },
    {
        ", ": null
    },
    {
        "Maronia": "Maronia"
    },
    {
        ", ": null
    },
    {
        "Naxos": "Naxos"
    },
    {
        ", ": null
    },
    {
        "Pella": "Pella"
    },
    {
        ", ": null
    },
    {
        "Pergamum": "Pergamum"
    },
    {
        ", ": null
    },
    {
        "Rhegion": "Reggio Calabria"
    },
    {
        ", ": null
    },
    {
        "Salamis": "Salamis Island"
    },
    {
        ", ": null
    },
    {
        "Smyrni": "Smyrni"
    },
    {
        ", ": null
    },
    {
        "Sparta": "Sparta"
    },
    {
        ", ": null
    },
    {
        "Syracuse": "Syracuse, Sicily"
    },
    {
        ", ": null
    },
    {
        "Tarsus": "Tarsus, Mersin"
    },
    {
        ", ": null
    },
    {
        "Thasos": "Thasos"
    },
    {
        ", ": null
    },
    {
        "Tenedos": "Tenedos"
    },
    {
        ", ": null
    },
    {
        "Troy": "Troy"
    },
    {
        " and more.     The 5th century BC ": null
    },
    {
        "Athenian": "Athens"
    },
    {
        "  tetradrachm  ": null
    },
    {
        "coin": "Coin"
    },
    {
        " was perhaps the most widely used coin in the Greek world prior to the time of ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " . It featured the helmeted profile bust of ": null
    },
    {
        "Athena": "Athena"
    },
    {
        " on the obverse and an owl on the reverse . In daily use they were called  glaukes , . hence ": null
    },
    {
        "the proverb": "List Of Greek Phrasesγγ"
    },
    {
        " , an owl to Athens, referring to something that was in plentiful supply, like ": null
    },
    {
        "coals to Newcastle": "Coals To Newcastle"
    },
    {
        ". The reverse is featured on the national side of the modern ": null
    },
    {
        "Greek 1 euro coin": "Greek Euro Coins"
    },
    {
        ".     Drachmae were minted on different weight standards at different Greek mints. The standard that came to be most commonly used was the Athenian or Attic one, which weighed a little over 4.3  grams.     After ": null
    },
    {
        "Alexander the Greats": "Alexander The Great"
    },
    {
        " conquests, the name drachma was used in many of the ": null
    },
    {
        "Hellenistic": "Hellenistic"
    },
    {
        " kingdoms in the ": null
    },
    {
        "Middle East": "Middle East"
    },
    {
        ", including the ": null
    },
    {
        "Ptolemaic": "Ptolemaic Dynasty"
    },
    {
        " kingdom in ": null
    },
    {
        "Alexandria": "Alexandria"
    },
    {
        " and the ": null
    },
    {
        "Parthian Empire": "Parthian Empire"
    },
    {
        " based in what is modern-day ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ". The ": null
    },
    {
        "Arabic": "Arabia"
    },
    {
        " unit of currency known as  dirham  , known from pre-": null
    },
    {
        "Islam": "Islam"
    },
    {
        "ic times and afterwards, inherited its name from the drachma or ": null
    },
    {
        "didrachm": "Didrachm"
    },
    {
        " ; the dirham is still the name of the official currencies of ": null
    },
    {
        "Morocco": "Moroccan Dirham"
    },
    {
        " and the ": null
    },
    {
        "United Arab Emirates": "United Arab Emirates Dirham"
    },
    {
        ". The ": null
    },
    {
        "Armenia": "Armenia"
    },
    {
        "n ": null
    },
    {
        "dram": "Dram"
    },
    {
        "  also derives its name from the drachma.         It is difficult to estimate comparative exchange rates with modern currency because the range of products produced by economies of centuries gone by were different from today, which makes ": null
    },
    {
        "purchasing power parity ": "Purchasing Power Parity"
    },
    {
        " calculations very difficult; however, some historians and economists have estimated that in the 5th century BC a drachma had a rough value of 25 ": null
    },
    {
        "U.S. dollars": "United States Dollar"
    },
    {
        " , whereas classical historians regularly say that in the heyday of ancient Greece the daily wage for a skilled worker or a ": null
    },
    {
        "hoplite": "Hoplite"
    },
    {
        " Thucydides": "Thucydides"
    },
    {
        ",  History of the Peloponnesian War  . was one drachma, and for a ": null
    },
    {
        "heliast": "Heliaia"
    },
    {
        " half a drachma since 425  BC. It was originally set at 1/6 drachma by Pericles, until ": null
    },
    {
        "Cleon": "Cleon"
    },
    {
        " raised it in 425  BC; see also ": null
    },
    {
        "Aristophanes": "Aristophanes"
    },
    {
        ", Knights and Wasps .     Modern commentators derived from ": null
    },
    {
        "Xenophon": "Xenophon"
    },
    {
        " Cf. footnote 18 of H. G. Dakynss translation of  . This footnote is quoting George Grote . that half a drachma per day would provide a comfortable subsistence for the poor citizens . Earlier in 422  BC, we also see in Aristophanes  that the daily half-drachma of a juror is just enough for the daily subsistence of a family of three.     A modern person might think of one drachma as the rough equivalent of a skilled workers daily pay in the place where they live, which could be as low as US$1, or as high as $100, depending on the country.     Fractions and multiples of the drachma were minted by many states, most notably in ": null
    },
    {
        "Ptolemaic Egypt": "Ptolemaic Egypt"
    },
    {
        ", which minted large coins in gold, silver and bronze.     Notable Ptolemaic coins included the gold pentadrachm and octadrachm, and silver tetradrachm, decadrachm and pentakaidecadrachm. This was especially noteworthy as it would not be until the introduction of the ": null
    },
    {
        "Guldengroschen": "Guldengroschen"
    },
    {
        " in 1486 that coins of substantial size would be minted in significant quantities.     For the Roman successors of the drachma, see ": null
    },
    {
        "Roman provincial coins": "Roman Provincial Coins"
    },
    {
        ".       The weight of the silver drachma was approximately 4.3 grams or 0.15 ounces, British Museum Catalogue 11 – Attica Megaris Aegina although weights varied significantly from one city-state to another. It was divided into six obols of 0.72 grams, which were subdivided into four tetartemoria of 0.18 grams, one of the smallest coins ever struck, approximately 5–7  mm in diameter. Photo gallery of  and other small Greek coins              :8 chalkoi 1  obolus    :6 oboloi 1 drachma   :70 drachmae 1  mina  , later 100 drachmae 1 mina ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        ", Athenian Constitution, 10.2   :60  minae  1  Athenian Talent  Drachma, The Catholic Encyclopedia, Volume V. Published 1909. New York: Robert Appleton Company. Nihil Obstat, 1 May 1909. Remy Lafort, Censor. Imprimatur. John M. Farley, Archbishop of New York     Minae and talents were never actually minted: they represented weight measures used for commodities as well as metals like silver or gold. The ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        " mentions both didrachma and, by implication, tetradrachma in context of the ": null
    },
    {
        "Temple tax": "Temple Tax"
    },
    {
        ". ": null
    },
    {
        "Lukes Gospel": "Gospel Of Luke"
    },
    {
        " includes a ": null
    },
    {
        "parable": "Parable Of The Lost Coin"
    },
    {
        " told by Jesus of a woman with 10 drachmae, who lost one and searched her home until she found it. Luke 15:8–10                 The drachma was reintroduced in May 1832, shortly before the establishment of the modern state of Greece .  It replaced the  phoenix  at par. The drachma was subdivided into 100 ": null
    },
    {
        "lepta": "Greek Lepton"
    },
    {
        ".          The first coinage consisted of copper denominations of 1, 2, 5 and 10 lepta, silver denominations of , , 1 and 5 drachmae and a gold coin of 20 drachmae. The drachma coin weighed 4.5  g and contained 90% silver, with the 20-drachma coin containing 5.8  g of gold.     In 1868, Greece joined the ": null
    },
    {
        "Latin Monetary Union": "Latin Monetary Union"
    },
    {
        " and the drachma became equal in weight and value to the ": null
    },
    {
        "French franc": "French Franc"
    },
    {
        ". The new coinage issued consisted of copper coins of 1, 2, 5 and 10 lepta, with the 5- and 10-lepta coins bearing the names obolos  and diobolon , respectively; silver coins of 20 and 50 lepta, 1, 2 and 5 drachmae and gold coins of 5, 10 and 20 drachmae.     In 1894, ": null
    },
    {
        "cupro-nickel": "Cupro-Nickel"
    },
    {
        " 5-, 10- and 20-lepta coins were introduced. No 1-lepton or 2-lepta coin had been issued since the late 1870s. Silver coins of 1 and 2 drachmae were last issued in 1911, and no coins were issued between 1912 and 1922, during which time the ": null
    },
    {
        "Latin Monetary Union": "Latin Monetary Union"
    },
    {
        " collapsed due to ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ".     Between 1926 and 1930, a new coinage was introduced for the new Hellenic Republic, consisting of cupro-nickel coins in denominations of 20 lepta, 50 lepta, 1 drachma, and 2 drachmae; nickel coins of 5 drachmae; and silver coins of 10 and 20 drachmae. These were the last coins issued for the first modern drachma, and none were issued for the second.          Notes were issued by the ": null
    },
    {
        "National Bank of Greece": "National Bank Of Greece"
    },
    {
        " from 1841 until 2001 when Greece joined the ": null
    },
    {
        "Euro": "Euro"
    },
    {
        ". Early denominations ranged from 10 to 500 drachmae. Smaller denominations were issued from 1885, with the first 5-drachma notes being made by cutting 10-drachma notes in half.     When Greece finally achieved its independence from the Ottoman Empire in 1828, the ": null
    },
    {
        "phoenix": "Greek Phoenix"
    },
    {
        " was introduced as the monetary unit; its use was short-lived, however, and in 1832 the phoenix was replaced by the drachma, adorned with the image of ": null
    },
    {
        "King Otto of Greece": "Otto Of Greece"
    },
    {
        ", who reigned as modern Greeces first king from 1832 to 1862. The drachma was divided into 100 lepta. In 2002 the drachma ceased to be legal tender after the euro, the monetary unit of the European Union, became Greeces sole currency.     Between 1917 and 1920, the Greek government issued paper money in denominations of 10 lepta, 50 lepta, 1 drachma, 2 drachmae, and 5 drachmae. The National Bank of Greece introduced 1000-drachma notes in 1901, and the Bank of Greece introduced 5,000-drachma notes in 1928. The economic depression of the 1920s affected many nations around the globe, including Greece. In 1922, the Greek government issued a forced loan in order to finance their growing budget deficit. On April 1, 1922, the government decreed that half of all bank notes had to be surrendered and exchanged for 6.5% bonds. The notes were then cut in half, with the portion bearing the Greek crown standing in for the bonds while the other half was exchanged for a new issue of central bank notes at half the original value.  The Greek government again issued notes between 1940 and 1944, in denominations ranging from 50 lepta to 20 drachmae.        During the ": null
    },
    {
        "German": "Nazi Germany"
    },
    {
        "–": null
    },
    {
        "Italian": "Kingdom Of Italy"
    },
    {
        " occupation of Greece": "Axis Occupation Of Greece"
    },
    {
        " from 1941 to 1944, catastrophic ": null
    },
    {
        "hyperinflation": "Hyperinflation"
    },
    {
        " and ": null
    },
    {
        "Nazi": "Nazism"
    },
    {
        " looting of the Greek treasury caused much higher denominations to be issued, culminating in 100,000,000,000-drachma notes in 1944.  The Italian occupation authorities in the Ionian Islands printed their own currency .       In November 1944, after Greece was liberated from Germany, old drachmae were exchanged for new ones at the rate of 50,000,000,000 to 1. Only paper money was issued. The government issued notes of 1, 5, 10 and 20 drachmae, with the Bank of Greece issuing 50-, 100-, 500-, 1000-, 5000-, and 10,000-drachma notes. This drachma also suffered from high inflation. The government later issued 100-, 500-, and 1000-drachma notes, and the Bank of Greece issued 20,000-and 50,000-drachma notes.       In 1953, in an effort to halt inflation, Greece joined the ": null
    },
    {
        "Bretton Woods system": "Bretton Woods System"
    },
    {
        ". In 1954, the drachma was revalued at a rate of 1000 to 1. The new currency was pegged at 30 drachmae 1 ": null
    },
    {
        "United States dollar": "United States Dollar"
    },
    {
        ". In 1973, the Bretton Woods System was abolished; over the next 25 years the official exchange rate gradually declined, reaching 400 drachmae to 1 U. S. dollar. On 1 January 2002, the Greek drachma was officially replaced as the circulating currency by the ": null
    },
    {
        "euro": "Euro"
    },
    {
        ", and it has not been ": null
    },
    {
        "legal tender": "Legal Tender"
    },
    {
        " since 1 March 2002.       The first issue of coins minted in 1954 consisted of holed aluminium 5-, 10- and 20-lepton pieces, with 50-lepton, 1-, 2-, 5- and 10-drachma pieces in cupro-nickel. A silver 20-drachma piece was issued in 1960, replacing the 20-drachma banknote, and also minted only in collector sets in 1965. Coins in denominations from 50 lepta to 20 drachmae carried a portrait of ": null
    },
    {
        "King Paul": "Paul Of Greece"
    },
    {
        " . New coins were introduced in 1966, ranging from 50 lepta to 10 drachmae, depicting ": null
    },
    {
        "King Constantine II": "Constantine Ii Of Greece"
    },
    {
        " . A silver 30 drachma coin for the centennial of Greeces royal dynasty was minted in 1963. The following year a non-circulating coin of this value was produced to commemorate the royal wedding. The reverse of all coins was altered in 1971 to reflect the military junta which was in power from 1967 to 1974. This design included a soldier standing in front of the flames of the rising phoenix.     A 20-drachmae coin in cupro-nickel with an image of ": null
    },
    {
        "Europa": "Europa"
    },
    {
        " on the obverse was issued in 1973. In the latter part of 1973, several new coin types were introduced: unholed aluminium , nickel-brass and cupro-nickel . These provisional coins carried the design of the phoenix rising from the flame on the obverse, and used the countrys new designation as the Hellenic Republic , replacing the coins also issued in 1973 as the Kingdom of Greece with King Constantine IIs portrait. A new series of all 8 denominations was introduced in 1976 carrying images of early national heroes on the smaller values.     Cupro-nickel 50-drachmae coins were introduced in 1980. In 1986, nickel-brass 50-drachma coins were introduced, followed by copper 1- and 2-drachma pieces in 1988 and nickel-brass coins of 20 and 100 drachmae in 1990. In 2000, a set of 6 themed 500-drachma coins were issued to commemorate the ": null
    },
    {
        "2004 Athens Olympic Games": "2004 Summer Olympics"
    },
    {
        ".     ": null
    },
    {
        "Coins": "Coin"
    },
    {
        " in circulation at the time of the adoption of the euro  were   50 lepta    ": null
    },
    {
        "Othon": "Otto Of Greece"
    },
    {
        " Georgios I": "George I Of Greece"
    },
    {
        " 1973-1974 military-controlled Republic ": "Metapolitefsiprologue"
    },
    {
        " Owl of Athena": "Owl Of Athena"
    },
    {
        "Banknotes": "Banknote"
    },
    {
        " in circulation at the time of the adoption of the euro  were   100 drachmae , depicting ": null
    },
    {
        "Athena": "Athena"
    },
    {
        " and ": null
    },
    {
        "Adamantios Korais": "Adamantios Korais"
    },
    {
        " Rigas Feraios": "Rigas Feraios"
    },
    {
        " Ioannis Capodistrias": "Ioannis Capodistrias"
    },
    {
        " Apollo": "Apollo"
    },
    {
        " Theodoros Kolokotronis": "Theodoros Kolokotronis"
    },
    {
        " George Papanicolaou": "Georgios Papanikolaou"
    },
    {
        " and ": null
    },
    {
        "Asclepius": "Asclepius"
    },
    {
        "      Axis Occupation": "Axis Occupation Of Greece"
    },
    {
        " hyperinflation": "Hyperinflation"
    },
    {
        " . There is a special ": null
    },
    {
        "Attic numeral": "Attic Numerals"
    },
    {
        ",  for the value of one drachma but it fails to render in most browsers.  Entry for            The ": null
    },
    {
        "Drachmi Greek Democratic Movement Five Stars": "Drachmi Greek Democratic Movement Five Stars"
    },
    {
        " which was founded in 2013,  aims to restore the Drachma, as Greeces currency.       The golden drachma is the main unit of currency in ": null
    },
    {
        "Rick Riordans": "Rick Riordan"
    },
    {
        "  Percy Jackson & the Olympians  series, as well as its spinoff  The Heroes of Olympus , the latter of which also features the Roman ": null
    },
    {
        "denarius": "Denarius"
    },
    {
        ".   The drachma is used in the video game  Assassins Creed Origins , set in ": null
    },
    {
        "Ptolemaic Egypt": "Ptolemaic Egypt"
    },
    {
        ", as the currency used by the player to purchase weapons, outfits and mounts. It is also used in the subsequent game  Assassins Creed Odyssey , set in ": null
    },
    {
        "Ancient Greece": "Ancient Greece"
    }
]