[
    {
        "        Grus  is a ": null
    },
    {
        "constellation": "Constellation"
    },
    {
        " in the ": null
    },
    {
        "southern sky": "Southern Sky"
    },
    {
        ". Its name is ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " for the ": null
    },
    {
        "crane": "Crane"
    },
    {
        ", a type of bird. It is one of twelve constellations conceived by ": null
    },
    {
        "Petrus Plancius": "Petrus Plancius"
    },
    {
        " from the observations of ": null
    },
    {
        "Pieter Dirkszoon Keyser": "Pieter Dirkszoon Keyser"
    },
    {
        " and ": null
    },
    {
        "Frederick de Houtman": "Frederick De Houtman"
    },
    {
        ". Grus first appeared on a  celestial globe published in 1598 in Amsterdam by Plancius and ": null
    },
    {
        "Jodocus Hondius": "Jodocus Hondius"
    },
    {
        " and was depicted in ": null
    },
    {
        "Johann Bayers": "Johann Bayer"
    },
    {
        "star atlas  Uranometria  of 1603. French explorer and astronomer ": null
    },
    {
        "Nicolas-Louis de Lacaille": "Nicolas-Louis De Lacaille"
    },
    {
        " gave ": null
    },
    {
        "Bayer designations": "Bayer Designation"
    },
    {
        "to its stars in 1756, some of which had been previously considered part of the neighbouring constellation ": null
    },
    {
        "Piscis Austrinus": "Piscis Austrinus"
    },
    {
        ". The constellations Grus, ": null
    },
    {
        "Pavo": "Pavo"
    },
    {
        ", ": null
    },
    {
        "Phoenix": "Phoenix"
    },
    {
        " and ": null
    },
    {
        "Tucana": "Tucana"
    },
    {
        " are collectively known as the Southern Birds .     The constellations brightest star, ": null
    },
    {
        "Alpha Gruis": "Alpha Gruis"
    },
    {
        ", is also known as Alnair and appears as a 1.7-": null
    },
    {
        "magnitude": "Apparent Magnitude"
    },
    {
        " blue-white star. ": null
    },
    {
        "Beta Gruis": "Beta Gruis"
    },
    {
        " is a ": null
    },
    {
        "red giant": "Red Giant"
    },
    {
        " variable star": "Variable Star"
    },
    {
        " with a minimum magnitude of 2.3 and a maximum magnitude of 2.0. Six star systems have been found to have ": null
    },
    {
        "planets": "Exoplanet"
    },
    {
        ": the red dwarf ": null
    },
    {
        "Gliese 832": "Gliese 832"
    },
    {
        " is one of the closest stars to Earth to have a planetary system. Another—": null
    },
    {
        "WASP-95": "Wasp-95"
    },
    {
        "—has a planet that orbits every two days. ": null
    },
    {
        "Deep-sky objects": "Deep-Sky Object"
    },
    {
        "found in Grus include the ": null
    },
    {
        "planetary nebula": "Planetary Nebula"
    },
    {
        " IC 5148": "Ic 5148"
    },
    {
        ", also known as the Spare Tyre Nebula, and a group of four interacting galaxies known as the Grus Quartet.             The stars that form Grus were originally considered part of the neighbouring constellation ": null
    },
    {
        "Piscis Austrinus": "Piscis Austrinus"
    },
    {
        " , with ": null
    },
    {
        "Gamma Gruis": "Gamma Gruis"
    },
    {
        " seen as part of the fishs tail.  The stars were first defined as a separate constellation by the Dutch astronomer ": null
    },
    {
        "Petrus Plancius": "Petrus Plancius"
    },
    {
        ", who created twelve new constellations based on the observations of the southern sky by the Dutch explorers ": null
    },
    {
        "Pieter Dirkszoon Keyser": "Pieter Dirkszoon Keyser"
    },
    {
        " and ": null
    },
    {
        "Frederick de Houtman": "Frederick De Houtman"
    },
    {
        ", who had sailed on the first Dutch trading expedition, known as the  Eerste Schipvaart , to the ": null
    },
    {
        "East Indies": "East Indies"
    },
    {
        ". Grus first appeared on a 35-centimetre-diameter celestial globe published in 1598 in ": null
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        " by Plancius with ": null
    },
    {
        "Jodocus Hondius": "Jodocus Hondius"
    },
    {
        ". Its first depiction in a celestial atlas was in the German cartographer ": null
    },
    {
        "Johann Bayers": "Johann Bayer"
    },
    {
        "  Uranometria  of 1603.  De Houtman included it in his southern star catalogue the same year under the Dutch name Den Reygher, The Heron ,  but Bayer followed Plancius and Hondius in using Grus.     An alternative name for the constellation, Phoenicopterus , was used briefly during the early 17th century, seen in the 1605 work Cosmographiae Generalis by Paul Merula of ": null
    },
    {
        "Leiden University": "Leiden University"
    },
    {
        " and a c. 1625 globe by Dutch globe maker Pieter van den Keere. Astronomer Ian Ridpath has reported the symbolism likely came from Plancius originally, who had worked with both of these people. Grus and the nearby constellations ": null
    },
    {
        "Phoenix": "Phoenix"
    },
    {
        ", ": null
    },
    {
        "Tucana": "Tucana"
    },
    {
        " and ": null
    },
    {
        "Pavo": "Pavo"
    },
    {
        " are collectively called the Southern Birds .      The stars that correspond to Grus were generally too far south to be seen from China. In ": null
    },
    {
        "Chinese astronomy": "Chinese Astronomy"
    },
    {
        ", Gamma and ": null
    },
    {
        "Lambda Gruis": "Lambda Gruis"
    },
    {
        " may have been included in the tub-shaped asterism Bàijiù, along with stars from Piscis Austrinus. In Central Australia, the ": null
    },
    {
        "Arrernte": "Upper Arrernte Language"
    },
    {
        " and ": null
    },
    {
        "Luritja": "Luritja Dialect"
    },
    {
        " people living on a mission in ": null
    },
    {
        "Hermannsburg": "Hermannsburg, Northern Territory"
    },
    {
        " viewed the sky as divided between them, east of the ": null
    },
    {
        "Milky Way": "Milky Way"
    },
    {
        " representing Arrernte camps and west denoting Luritja camps. ": null
    },
    {
        "Alpha": "Alpha Gruis"
    },
    {
        " and ": null
    },
    {
        "Beta Gruis": "Beta Gruis"
    },
    {
        ", along with ": null
    },
    {
        "Fomalhaut": "Fomalhaut"
    },
    {
        ", ": null
    },
    {
        "Alpha Pavonis": "Alpha Pavonis"
    },
    {
        " and the stars of ": null
    },
    {
        "Musca": "Musca"
    },
    {
        ", were all claimed by the Arrernte.        Grus is bordered by Piscis Austrinus to the north, ": null
    },
    {
        "Sculptor": "Sculptor"
    },
    {
        " to the northeast, Phoenix to the east, Tucana to the south, ": null
    },
    {
        "Indus": "Indus"
    },
    {
        " to the southwest, and ": null
    },
    {
        "Microscopium": "Microscopium"
    },
    {
        " to the west. Bayer straightened the tail of Piscis Austrinus to make way for Grus in his Uranometria. Covering 366 square degrees, it ranks 45th of the 88 ": null
    },
    {
        "modern constellations": "Lists Of Constellations"
    },
    {
        " in size and covers 0.887% of the night sky.  The three-letter abbreviation for the constellation, as adopted by the ": null
    },
    {
        "International Astronomical Union": "International Astronomical Union"
    },
    {
        " in 1922, is Gru .  The official constellation boundaries, as set by ": null
    },
    {
        "Eugène Delporte": "Eugène Joseph Delporte"
    },
    {
        " in 1930, are defined as a polygon of 6 segments. In the ": null
    },
    {
        "equatorial coordinate system": "Equatorial Coordinate System"
    },
    {
        ", the ": null
    },
    {
        "right ascension": "Right Ascension"
    },
    {
        " coordinates of these borders lie between  and , while the ": null
    },
    {
        "declination": "Declination"
    },
    {
        " coordinates are between −36.31° and −56.39°.  Grus is located too far south to be seen by observers in the British Isles and the northern United States, though it can easily be seen from ": null
    },
    {
        "Florida": "Florida"
    },
    {
        " or ": null
    },
    {
        "California": "California"
    },
    {
        ";  the whole constellation is visible to observers south of latitude ": null
    },
    {
        "33°N": "33Rd Parallel North"
    },
    {
        ".                   Keyser and de Houtman assigned twelve stars to the constellation.  Bayer depicted Grus on his chart, but did not assign its stars ": null
    },
    {
        "Bayer designation": "Bayer Designation"
    },
    {
        "s. French explorer and astronomer ": null
    },
    {
        "Nicolas-Louis de Lacaille": "Nicolas-Louis De Lacaille"
    },
    {
        " labelled them Alpha to Phi in 1756 with some omissions. In 1879, American astronomer ": null
    },
    {
        "Benjamin Gould": "Benjamin Apthorp Gould"
    },
    {
        " added Kappa, Nu, Omicron and Xi, which had all been catalogued by Lacaille but not given Bayer designations. Lacaille considered them too faint, while Gould thought otherwise. Xi Gruis had originally been placed in Microscopium. Conversely, Gould dropped Lacailles Sigma as he thought it was too dim.      Grus has several bright stars. Marking the left wing is Alpha Gruis, a blue-white star of spectral type B6V and ": null
    },
    {
        "apparent magnitude": "Apparent Magnitude"
    },
    {
        " 1.7, around 101 ": null
    },
    {
        "light-years": "Light-Year"
    },
    {
        "from Earth.  Its traditional name, Alnair, means the bright one and refers to its status as the brightest star in Grus . Alnair is around 380 times as ": null
    },
    {
        "luminous": "Luminosity"
    },
    {
        " and has over 3 times the diameter of the ": null
    },
    {
        "Sun": "Sun"
    },
    {
        ".  Lying 5 degrees west of Alnair, denoting the Cranes heart is Beta Gruis , a ": null
    },
    {
        "red giant": "Red Giant"
    },
    {
        " of spectral type M5III.  It has a diameter of 0.8 ": null
    },
    {
        "astronomical units": "Astronomical Unit"
    },
    {
        " located around 170 light-years from Earth. It is a ": null
    },
    {
        "variable star": "Variable Star"
    },
    {
        " with a minimum magnitude of 2.3 and a maximum magnitude of 2.0.  An imaginary line drawn from the Great Square of ": null
    },
    {
        "Pegasus": "Pegasus"
    },
    {
        " through Fomalhaut will lead to Alnair and Beta Gruis.     Lying in the northwest corner of the constellation and marking the cranes eye is Gamma Gruis,  a blue-white ": null
    },
    {
        "subgiant": "Subgiant"
    },
    {
        " of spectral type B8III and magnitude 3.0 lying around 211 light-years from Earth.  Also known as Al Dhanab, it has finished fusing its core hydrogen and has begun cooling and expanding, which will see it transform into a red giant.      There are several naked-eye ": null
    },
    {
        "double stars": "Double Star"
    },
    {
        "in Grus. Forming a triangle with Alnair and Beta, Delta Gruis is an optical double whose components—": null
    },
    {
        "Delta 1 ": "Delta1 Gruis"
    },
    {
        " and ": null
    },
    {
        "Delta 2 ": "Delta2 Gruis"
    },
    {
        "—are separated by 45 arcseconds. Delta 1 is a ": null
    },
    {
        "yellow giant": "Yellow Giant"
    },
    {
        " of spectral type G7III and magnitude 4.0, 309 light-years from Earth,  and may have its own magnitude 12 ": null
    },
    {
        "orange dwarf": "K-Type Main-Sequence Star"
    },
    {
        " companion.  Delta 2 is a red giant of spectral type M4.5III and semiregular variable that ranges between magnitudes 3.99 and 4.2,  located 325 light-years from Earth. It has around 3 times the mass and 135 times the diameter of our sun. Mu Gruis, composed of ": null
    },
    {
        "Mu 1 ": "Mu1 Gruis"
    },
    {
        " and ": null
    },
    {
        "Mu 2 ": "Mu2 Gruis"
    },
    {
        ", is also an optical double—both stars are yellow giants of spectral type G8III around 2.5 times as massive as the Sun with surface temperatures of around 4900 K.  Mu 1 is the brighter of the two at magnitude 4.8 located around 275 light-years from Earth,  while Mu 2 the dimmer at magnitude 5.11 lies 265 light-years distant from Earth.  Pi Gruis, an optical double with a variable component, is composed of ": null
    },
    {
        "Pi 1 Gruis": "Pi1 Gruis"
    },
    {
        " and ": null
    },
    {
        "Pi 2 ": "Pi2 Gruis"
    },
    {
        ". Pi 1 is a ": null
    },
    {
        "semi-regular": "Semiregular Variable Star"
    },
    {
        " red giant of spectral type S5, ranging from magnitude 5.31 to 7.01 over a period of 191 days,  and is around 532 light-years from Earth.  One of the brightest S-class stars to Earth viewers, it has a companion star of apparent magnitude 10.9 with sunlike properties, being a ": null
    },
    {
        "yellow main sequence star": "G-Type Main-Sequence Star"
    },
    {
        " of spectral type G0V. The pair make up a likely binary system.  Pi 2 is a ": null
    },
    {
        "giant star": "Giant Star"
    },
    {
        " of spectral type F3III-IV located around 130 light-years from Earth,  and is often brighter than its companion at magnitude 5.6. Marking the right wing is ": null
    },
    {
        "Theta Gruis": "Theta Gruis"
    },
    {
        ", yet another double star, lying 5 degrees east of Delta 1 and Delta 2 .     ": null
    },
    {
        "RZ Gruis": "Rz Gruis"
    },
    {
        " is a binary system of apparent magnitude 12.3 with occasional dimming to 13.4, whose components—a ": null
    },
    {
        "white dwarf": "White Dwarf"
    },
    {
        " and ": null
    },
    {
        "main sequence": "Main Sequence"
    },
    {
        " star—are thought to orbit each other roughly every 8.5 to 10 hours. It belongs to the UX Ursae Majoris subgroup of ": null
    },
    {
        "cataclysmic variable star": "Cataclysmic Variable Star"
    },
    {
        " systems, where material from the donor star is drawn to the white dwarf where it forms an ": null
    },
    {
        "accretion disc": "Accretion Disc"
    },
    {
        " that remains bright and outshines the two component stars. The system is poorly understood,  though the donor star has been calculated to be of spectral type F5V.  These stars have spectra very similar to novae that have returned to quiescence after outbursts, yet they have not been observed to have erupted themselves. The ": null
    },
    {
        "American Association of Variable Star Observers": "American Association Of Variable Star Observers"
    },
    {
        " recommends watching them for future events.  ": null
    },
    {
        "CE Gruis": "Ce Gruis"
    },
    {
        " is a faint star system also composed of a white dwarf and donor star; in this case the two are so close they are ": null
    },
    {
        "tidally locked": "Tidal Locking"
    },
    {
        ". Known as ": null
    },
    {
        "polars": "Polar"
    },
    {
        ", material from the donor star does not form an accretion disc around the white dwarf, but rather streams directly onto it.      Six star systems are thought to have planetary systems. ": null
    },
    {
        "Tau 1 Gruis": "Tau1 Gruis"
    },
    {
        " is a yellow star of magnitude 6.0 located around 106 light-years away.  It may be a main sequence star or be just beginning to depart from the sequence as it expands and cools. In 2002 the star was found to have a planetary companion.  ": null
    },
    {
        "HD 215456": "Hd 215456"
    },
    {
        ", ": null
    },
    {
        "HD 213240": "Hd 213240"
    },
    {
        " and ": null
    },
    {
        "WASP-95": "Wasp-95"
    },
    {
        " are yellow sunlike stars discovered to have two planets,  a planet and a remote ": null
    },
    {
        "red dwarf": "Red Dwarf"
    },
    {
        ",  and a ": null
    },
    {
        "hot Jupiter": "Hot Jupiter"
    },
    {
        ", respectively; this last—WASP-95b—completes an orbit round its sun in a mere two days.  ": null
    },
    {
        "Gliese 832": "Gliese 832"
    },
    {
        " is a red dwarf of spectral type M1.5V and apparent magnitude 8.66 located only 16.1 light-years distant; hence it is one of the nearest stars to the Solar System. A ": null
    },
    {
        "Jupiter": "Jupiter"
    },
    {
        "-like planet—": null
    },
    {
        "Gliese 832 b": "Gliese 832 B"
    },
    {
        "—orbiting the red dwarf over a period of 9.4±0.4 years was discovered in 2008.  ": null
    },
    {
        "WISE 2220−3628": "Wise 2220−3628"
    },
    {
        " is a ": null
    },
    {
        "brown dwarf": "Brown Dwarf"
    },
    {
        " of spectral type Y, and hence one of the coolest star-like objects known. It has been calculated as being around 26 light-years distant from Earth.      In July 2019, astronomers reported finding a star, ": null
    },
    {
        "S5-HVS1": "S5-Hvs1"
    },
    {
        ", traveling , faster that any other star detected so far. The star is in the Grus constellation in the southern sky, and about 29,000 light-years from Earth, and may have been propelled out of the ": null
    },
    {
        "Milky Way": "Milky Way"
    },
    {
        " galaxy": "Galaxy"
    },
    {
        " after interacting with ": null
    },
    {
        "Sagittarius A": "Sagittarius A"
    },
    {
        ", the ": null
    },
    {
        "supermassive black hole": "Supermassive Black Hole"
    },
    {
        " at the center of the galaxy.              Nicknamed the spare-tyre nebula,  ": null
    },
    {
        "IC 5148": "Ic 5148"
    },
    {
        " is a ": null
    },
    {
        "planetary nebula": "Planetary Nebula"
    },
    {
        " located around 1 degree west of Lambda Gruis.  Around 3000 light-years distant, it is expanding at 50 kilometres a second, one of the fastest rates of expansion of all planetary nebulae.     Northeast of Theta Gruis are four interacting galaxies known as the Grus Quartet.  These galaxies are ": null
    },
    {
        "NGC 7552": "Ngc 7552"
    },
    {
        ", ": null
    },
    {
        "NGC 7590": "Ngc 7590"
    },
    {
        ", ": null
    },
    {
        "NGC 7599": "Ngc 7599"
    },
    {
        ", and ": null
    },
    {
        "NGC 7582": "Ngc 7582"
    },
    {
        ".  The latter three galaxies occupy an area of sky only 10 arcminutes across and are sometimes referred to as the Grus Triplet, although all four are part of a larger loose group of galaxies called the IC 1459 Grus Group. NGC 7552 and 7582 are exhibiting high ": null
    },
    {
        "starburst": "Starburst Galaxy"
    },
    {
        " activity; this is thought to have arisen because of the tidal forces from interacting. Located on the border of Grus with Piscis Austrinus, ": null
    },
    {
        "IC 1459": "Ic 1459"
    },
    {
        " is a peculiar E3 giant ": null
    },
    {
        "elliptical galaxy": "Elliptical Galaxy"
    },
    {
        ". It has a fast counterrotating stellar core, and shells and ripples in its outer region.  The galaxy has an apparent magnitude of 11.9  and is around 80 million light-years distant.     ": null
    },
    {
        "NGC 7424": "Ngc 7424"
    },
    {
        " is a ": null
    },
    {
        "barred spiral galaxy": "Barred Spiral Galaxy"
    },
    {
        " with an apparent magnitude of 10.4.  located around 4 degrees west of the Grus Triplet. Approximately 37.5 million light-years distant, it is about 100,000 light-years in diameter, has well defined spiral arms and is thought to resemble the ": null
    },
    {
        "Milky Way": "Milky Way"
    },
    {
        ".  Two ": null
    },
    {
        "ultraluminous X-ray sources": "Ultraluminous X-Ray Source"
    },
    {
        "and one ": null
    },
    {
        "supernova": "Supernova"
    },
    {
        " have been observed in NGC 7424.  ": null
    },
    {
        "SN 2001ig": "Sn 2001Ig"
    },
    {
        " was discovered in 2001 and classified as a ": null
    },
    {
        "Type IIb supernova": "Type Iib Supernovatype Iib Supernovae"
    },
    {
        ", one that initially showed a weak hydrogen line in its ": null
    },
    {
        "spectrum": "Stellar Spectrum"
    },
    {
        ", but this emission later became undetectable and was replaced by lines of oxygen, magnesium and calcium, as well as other features that resembled the spectrum of a ": null
    },
    {
        "Type Ib supernova": "Type Ib Supernova"
    },
    {
        ".  A massive star of ": null
    },
    {
        "spectral type": "Spectral Type"
    },
    {
        " F, A or B is thought to be the surviving binary companion to SN 2001ig, which was believed to have been a ": null
    },
    {
        "Wolf–Rayet star": "Wolf–Rayet Star"
    },
    {
        ".      Located near Alnair is ": null
    },
    {
        "NGC 7213": "Ngc 7213"
    },
    {
        ", a face-on type 1 ": null
    },
    {
        "Seyfert galaxy": "Seyfert Galaxy"
    },
    {
        " located approximately 71.7 million light-years from Earth.  It has an apparent magnitude of 12.1.  Appearing undisturbed in visible light, it shows signs of having undergone a collision or merger when viewed at longer wavelengths, with disturbed patterns of ionized hydrogen including a filament of gas around 64,000 light-years long. It is part of a group of ten galaxies.      ": null
    },
    {
        "NGC 7410": "Ngc 7410"
    },
    {
        " is a spiral galaxy discovered by British astronomer ": null
    },
    {
        "John Herschel": "John Herschel"
    },
    {
        " during observations at the ": null
    },
    {
        "Cape of Good Hope": "Cape Of Good Hope"
    },
    {
        " in October 1834. The galaxy has a visual magnitude of 11.7 and is approximately 122 million light-years distant from Earth. ": null
    }
]