[
    {
        "         A guitarist  is a person who plays the ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        ". Guitarists may play a variety of guitar family ": null
    },
    {
        "instruments": "Musical Instrument"
    },
    {
        " such as ": null
    },
    {
        "classical guitar": "Classical Guitar"
    },
    {
        "s, ": null
    },
    {
        "acoustic guitar": "Acoustic Guitar"
    },
    {
        "s, ": null
    },
    {
        "electric guitar": "Electric Guitar"
    },
    {
        "s, and ": null
    },
    {
        "bass guitar": "Bass Guitar"
    },
    {
        "s. Some guitarists accompany themselves on the guitar by ": null
    },
    {
        "singing": "Singing"
    },
    {
        " or playing the harmonica.       The guitarist may employ any of several methods for sounding the guitar, including finger picking, depending on the type of strings used , and including ": null
    },
    {
        "strumming": "Strumming"
    },
    {
        " with the fingers, or a ": null
    },
    {
        "guitar pick": "Guitar Pick"
    },
    {
        " made of bone, horn, plastic, metal, felt, leather, or paper, and melodic ": null
    },
    {
        "flatpicking": "Flatpicking"
    },
    {
        " and ": null
    },
    {
        "finger-picking": "Fingerstyle Guitar"
    },
    {
        ".     The guitarist may also employ various methods for selecting notes and chords, including fingering, thumbing, the barre , and bottleneck or steel-guitar slides, usually made of glass or metal. These left- and right-hand techniques may be intermixed in performance.              Several ": null
    },
    {
        "magazines": "Magazine"
    },
    {
        "and ": null
    },
    {
        "websites": "Website"
    },
    {
        "have compiled what they intend as lists of the greatest guitarists—for example The 100 Greatest Guitarists of All Time by  Rolling Stone  magazine, or 100 Greatest Guitarists of All Time by  Guitar World  magazine.     ;Rolling Stone: In 2003,  Rolling Stone  magazine published a list called The 100 Greatest Guitarists of All Time. This list included 100 guitarists whom the magazine editor ": null
    },
    {
        "David Fricke": "David Fricke"
    },
    {
        " considered the best, with a brief introduction for each of them.  The first in this list is the American guitarist ": null
    },
    {
        "Jimi Hendrix": "Jimi Hendrix"
    },
    {
        " introduced by ": null
    },
    {
        "Pete Townshend": "Pete Townshend"
    },
    {
        ", guitarist for ": null
    },
    {
        "The Who": "The Who"
    },
    {
        ", who was, in his turn, ranked at 50 in the list.     :In describing the list to readers, Paul MacInnes from British newspaper  The Guardian  wrote, Surprisingly enough for an American magazine, the top 10 is fair jam-packed with Yanks, though he also noted three exceptions in the top 10.  The online magazine  Blogcritics  criticized the list for introducing some  allegedly undeserving guitarists while forgetting some artists the writer considered perhaps more worthy, such as ": null
    },
    {
        "Johnny Marr": "Johnny Marr"
    },
    {
        ", ": null
    },
    {
        "Al Di Meola": "Al Di Meola"
    },
    {
        ", ": null
    },
    {
        "Phil Keaggy": "Phil Keaggy"
    },
    {
        " or ": null
    },
    {
        "John Petrucci": "John Petrucci"
    },
    {
        ".      :In 2011, Rolling Stone updated the list, which this time was chosen by a panel of guitarists and other experts with the top 5 consisting of ": null
    },
    {
        "Jimi Hendrix": "Jimi Hendrix"
    },
    {
        ", ": null
    },
    {
        "Eric Clapton": "Eric Clapton"
    },
    {
        ", ": null
    },
    {
        "Jimmy Page": "Jimmy Page"
    },
    {
        ", ": null
    },
    {
        "Keith Richards": "Keith Richards"
    },
    {
        " and ": null
    },
    {
        "Jeff Beck": "Jeff Beck"
    },
    {
        ". Artists who had not been included in the previous list were added. ": null
    },
    {
        "Rory Gallagher": "Rory Gallagher"
    },
    {
        ", for example, was ranked in 57th place.    :The 100 Greatest Guitarists of All Time is mentioned in many biographies about artists who appear in the list.      ;Guitar World:  Guitar World , a monthly music magazine devoted to the guitar, also published their list of 100 greatest guitarists in the book Guitar World Presents the 100 Greatest Guitarists of All Time from the Pages of Guitar World Magazine.  Different from the Rolling Stone list, which listed guitarists in descending order, Guitar World divided guitarists by ": null
    },
    {
        "music genre": "Music Genre"
    },
    {
        "—such as Lords of Hard Rock for ": null
    },
    {
        "hard rock": "Hard Rock"
    },
    {
        " artists or Jazzmen for ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " players. Despite the appearance in other magazines like  Billboard , Billboard, vol. 117, n° 49, pp. 67 this publication by Guitar World was criticized for including no female musicians within its selection.  However, Guitar World recently published a list of Eight Amazing Female Acoustic Players, including ": null
    },
    {
        "Kaki King": "Kaki King"
    },
    {
        ", ": null
    },
    {
        "Muriel Anderson": "Muriel Anderson"
    },
    {
        " and ": null
    },
    {
        "Sharon Isbin": "Sharon Isbin"
    },
    {
        ".      ;TIME and others: Following the death of ": null
    },
    {
        "Les Paul": "Les Paul"
    },
    {
        ",  TIME  website presented their list of 10 greatest artists in ": null
    },
    {
        "electric guitar": "Electric Guitar"
    },
    {
        ". As in Rolling Stone magazines list, Jimi Hendrix was chosen as the greatest guitarist followed by ": null
    },
    {
        "Slash": "Slash"
    },
    {
        " from ": null
    },
    {
        "Guns N Roses": "Guns Nroses"
    },
    {
        ", ": null
    },
    {
        "B.B. King": "B.B. King"
    },
    {
        ", ": null
    },
    {
        "Keith Richards": "Keith Richards"
    },
    {
        ", ": null
    },
    {
        "Jimmy Page": "Jimmy Page"
    },
    {
        ", and ": null
    },
    {
        "Eric Clapton": "Eric Clapton"
    },
    {
        ".   Gigwise.com , an online music magazine, also ranks Jimi Hendrix as the greatest guitarist ever, followed by Jimmy Page, B.B. King, Keith Richards and ": null
    },
    {
        "Kirk Hammett": "Kirk Hammett"
    },
    {
        ".        There are many ": null
    },
    {
        "classical guitarists": "List Of Classical Guitarists"
    },
    {
        " listed as notable in their respective epochs.     In recent decades, the most notable classical and cross genre guitarist was ": null
    },
    {
        "Paco de Lucía": "Paco De Lucía"
    },
    {
        ", one of the first ": null
    },
    {
        "flamenco guitarists": "Flamenco Guitarists"
    },
    {
        " to have successfully crossed over into other genres of music such as classical and jazz. ": null
    },
    {
        "Richard Chapman": "Richard Chapman"
    },
    {
        " and ": null
    },
    {
        "Eric Clapton": "Eric Clapton"
    },
    {
        ", authors of Guitar: Music, History, Players, describe de Lucía as a titanic figure in the world of ": null
    },
    {
        "flamenco guitar": "Flamenco Guitar"
    },
    {
        " ,  and Dennis Koster, author of Guitar Atlas, Flamenco, has referred to de Lucía as one of historys greatest guitarists. .   Another classical guitarist who has enjoyed great success is ": null
    },
    {
        "Tommy Emmanuel": "Tommy Emmanuel"
    }
]