[
    {
        "           Gunpowder, also known as black powder to distinguish it from modern ": null
    },
    {
        "smokeless powder": "Smokeless Powder"
    },
    {
        ", is the earliest known chemical ": null
    },
    {
        "explosive": "Explosive"
    },
    {
        ". It consists of a mixture of ": null
    },
    {
        "sulfur": "Sulfur"
    },
    {
        " , ": null
    },
    {
        "charcoal": "Charcoal"
    },
    {
        " , and ": null
    },
    {
        "potassium nitrate": "Potassium Nitrate"
    },
    {
        " . The sulfur and charcoal act as ": null
    },
    {
        "fuels": "Fuel"
    },
    {
        " while the saltpeter is an ": null
    },
    {
        "oxidizer": "Oxidizer"
    },
    {
        ". Because of its incendiary properties and the amount of heat and gas volume that it generates, gunpowder has been widely used as a ": null
    },
    {
        "propellant": "Propellant"
    },
    {
        " in ": null
    },
    {
        "firearms": "Firearm"
    },
    {
        ", ": null
    },
    {
        "artillery": "Artillery"
    },
    {
        ", ": null
    },
    {
        "rockets": "Rocket"
    },
    {
        ", and ": null
    },
    {
        "fireworks": "Fireworks"
    },
    {
        ", and as a blasting powder in ": null
    },
    {
        "quarry": "Quarry"
    },
    {
        "ing, ": null
    },
    {
        "mining": "Mining"
    },
    {
        ", and ": null
    },
    {
        "road building": "Roadconstruction"
    },
    {
        ".     Gunpowder was invented in 9th-century China and spread throughout most parts of Eurasia by the end of the 13th century. Originally developed by the ": null
    },
    {
        "Taoists": "Taoist"
    },
    {
        " for medicinal purposes, gunpowder was first used for warfare about 904 AD.     Gunpowder is classified as a ": null
    },
    {
        "low explosive": "Explosive Material"
    },
    {
        " because of its relatively slow decomposition rate and consequently low ": null
    },
    {
        "brisance": "Brisance"
    },
    {
        ". Low explosives ": null
    },
    {
        "deflagrate": "Deflagration"
    },
    {
        " at subsonic speeds, whereas ": null
    },
    {
        "high explosives": "High Explosives"
    },
    {
        " detonate": "Detonation"
    },
    {
        ", producing a supersonic wave.     Ignition of gunpowder packed behind a ": null
    },
    {
        "projectile": "Projectile"
    },
    {
        " generates enough pressure to force the shot from the muzzle at high speed, but usually not enough force to rupture the ": null
    },
    {
        "gun barrel": "Gun Barrel"
    },
    {
        ". Gunpowder thus makes a good propellant, but is less suitable for shattering rock or fortifications with its low-yield explosive power. However, by transferring enough energy eventually a ": null
    },
    {
        "bombardier": "Bombardier"
    },
    {
        " may wear down an opponents fortified defenses.     Gunpowder was widely used to fill fused artillery shells  until the second half of the 19th century, when the first ": null
    },
    {
        "high explosives": "High Explosives"
    },
    {
        " were put into use. Gunpowder is no longer used in modern weapons, nor is it used for industrial purposes, due to its relatively inefficient cost compared to newer alternatives such as ": null
    },
    {
        "dynamite": "Dynamite"
    },
    {
        " and ": null
    },
    {
        "ammonium nitrate/fuel oil": "Anfo"
    },
    {
        ".   Today gunpowder firearms are limited primarily to hunting, target shooting, and bulletless historical reenactments.                                  The first confirmed reference to what can be considered gunpowder in China occurred in the 9th century AD during the ": null
    },
    {
        "Tang dynasty": "Tang Dynasty"
    },
    {
        ", first in a formula contained in the Taishang Shengzu Jindan Mijue in 808, and then about 50 years later in a Taoist text known as the Zhenyuan miaodao yaolüe . Based on a 9th-century Taoist text, the invention of gunpowder by Chinese alchemists was likely an accidental byproduct from experiments seeking to create the ": null
    },
    {
        "elixir of life": "Elixir Of Life"
    },
    {
        ". This ": null
    },
    {
        "experimental medicine": "Experimental Medicine"
    },
    {
        " origin of gunpowder is reflected in its Chinese name huoyao, which means fire medicine . The first military applications of gunpowder were developed around 904 AD. The earliest chemical formula for gunpowder appeared in the 11th century ": null
    },
    {
        "Song dynasty": "Song Dynasty"
    },
    {
        " text,  Wujing Zongyao , however gunpowder had already been used for ": null
    },
    {
        "fire arrows": "Fire Arrows"
    },
    {
        " since at least the 10th century. In the following centuries various gunpowder weapons such as ": null
    },
    {
        "bombs": "Bomb"
    },
    {
        ", ": null
    },
    {
        "fire lances": "Fire Lances"
    },
    {
        ", and the ": null
    },
    {
        "gun": "Gun"
    },
    {
        " appeared in China.     ": null
    },
    {
        "Saltpeter": "Saltpeter"
    },
    {
        " was known to the Chinese by the mid-1st century AD and was primarily produced in the provinces of ": null
    },
    {
        "Sichuan": "Sichuan"
    },
    {
        ", ": null
    },
    {
        "Shanxi": "Shanxi"
    },
    {
        ", and ": null
    },
    {
        "Shandong": "Shandong"
    },
    {
        ". There is strong evidence of the use of saltpeter and sulfur in various ": null
    },
    {
        "medicinal": "Medicine"
    },
    {
        " combinations. A Chinese alchemical text dated 492 noted saltpeter burnt with a purple flame, providing a practical and reliable means of distinguishing it from other inorganic salts, thus enabling alchemists to evaluate and compare purification techniques; the earliest Latin accounts of saltpeter purification are dated after 1200.     The first reference to the incendiary properties of such mixtures is the passage of the Zhenyuan miaodao yaolüe, a ": null
    },
    {
        "Taoist": "Taoist"
    },
    {
        " text tentatively dated to the mid-9th century: Some have heated together sulfur, ": null
    },
    {
        "realgar": "Realgar"
    },
    {
        " and saltpeter with ": null
    },
    {
        "honey": "Honey"
    },
    {
        "; smoke and flames result, so that their hands and faces have been burnt, and even the whole house where they were working burned down.  The Chinese word for gunpowder is  , which literally means Fire Medicine ; however this name only came into use some centuries after the mixtures discovery. In the following centuries a variety of gunpowder weapons such as rockets, bombs, and land mines appeared before the first metal barrel firearms were invented. Explosive weapons such as bombs have been discovered in a shipwreck off the shore of Japan dated from 1281, during the Mongol invasions of Japan.      The Chinese  Wujing Zongyao  , written by ": null
    },
    {
        "Zeng Gongliang": "Zeng Gongliang"
    },
    {
        " between 1040 and 1044, provides encyclopedia references to a variety of mixtures that included petrochemicals—as well as garlic and honey. A slow match for flame throwing mechanisms using the siphon principle and for fireworks and rockets is mentioned. The mixture formulas in this book do not contain enough saltpeter to create an explosive however; being limited to at most 50% saltpeter, they produce an ": null
    },
    {
        "incendiary": "Incendiary Device"
    },
    {
        ". The Essentials was however written by a ": null
    },
    {
        "Song dynasty": "Song Dynasty"
    },
    {
        " court bureaucrat, and there is little evidence that it had any immediate impact on warfare; there is no mention of gunpowder use in the chronicles of the wars against the ": null
    },
    {
        "Tanguts": "Tangut People"
    },
    {
        " in the 11th century, and China was otherwise mostly at peace during this century.     However, by 1083 the Song court was producing hundreds of thousands of fire arrows for their garrisons. Bombs and the first proto-guns, known as fire lances , became prominent during the 12th century and were used by the Song during the ": null
    },
    {
        "Jin-Song Wars": "Jin-Song Wars"
    },
    {
        ". Fire lances were first recorded to have been used at the ": null
    },
    {
        "Siege of Dean": "Siege Of Dean"
    },
    {
        " in 1132 by Song forces against the ": null
    },
    {
        "Jin": "Jin Dynasty"
    },
    {
        ". In the early 13th century the Jin utilized iron-casing bombs. Projectiles were added to fire lances, and re-usable fire lance barrels were developed, first out of hardened paper, and then metal. By 1257 some fire lances were firing wads of bullets. In the late 13th century metal fire lances became eruptors, proto-cannons firing co-viative projectiles , and by 1287 at the latest, had become true guns, the ": null
    },
    {
        "hand cannon": "Hand Cannon"
    },
    {
        ".  Huolongjing   Huolongjing   Wujing Zongyao   Huolongjing   Huolongjing   Huolongjing   Huolongjing   Huolongjing  c. 1350.                   The ": null
    },
    {
        "Muslims": "Muslim"
    },
    {
        " acquired knowledge of gunpowder some time between 1240 and 1280, by which point the Syrian ": null
    },
    {
        "Hasan al-Rammah": "Hasan Al-Rammah"
    },
    {
        " had written, in Arabic, recipes for gunpowder, instructions for the purification of saltpeter, and descriptions of gunpowder incendiaries. It is implied by al-Rammahs usage of terms that suggested he derived his knowledge from Chinese sources and his references to saltpeter as Chinese snow , fireworks as Chinese flowers and rockets as Chinese arrows that knowledge of gunpowder arrived from China. However, because al-Rammah attributes his material to his father and forefathers , ": null
    },
    {
        "al-Hassan": "Ahmad Y. Al-Hassan"
    },
    {
        " argues that gunpowder became prevalent in Syria and Egypt by the end of the twelfth century or the beginning of the thirteenth . In Persia saltpeter was known as Chinese salt  namak-i chīnī The Book of Military Horsemanship and Ingenious War Devices75% nitrates, 9.06% sulfur, and 15.94% charcoal": null
    },
    {
        "i": "I"
    },
    {
        "16212010-07": null
    },
    {
        ".OPB.0168.0": ".Opb.0168.0"
    },
    {
        "that act on the senses": null
    },
    {
        "dievali": "Dievali"
    },
    {
        "7:5:5 saltpeter:charcoal:sulfurignis volatilis19961748controlled by the Britishand later eliminatedthe process taking about 18 months1766-17831642–1645": null
    },
    {
        "otla": "Otla"
    },
    {
        "1606–16071504": null
    },
    {
        "67–15": "67–15"
    },
    {
        "mainly for signalling": null
    },
    {
        "dones": "Dones"
    },
    {
        "Chinese: ": null
    },
    {
        "Pao": "Hu Dun Pao"
    },
    {
        "Khorasan iron198822 pages1817 book18171817 bookoriginally published in 1817Sharp grains rounded off in transport, producing fine meal dust that changed the burning properties.1864Great Britain1885pressure vs. timeKNO 3 CSknown as saltpeter or saltpetrenow in Chilefor instance if it was contaminated with highly ": null
    },
    {
        "hygroscopic": "Hygroscopic"
    },
    {
        " calcium nitrate": "Calcium Nitrate"
    },
    {
        "due to the mildly hygroscopic nature of potassium nitrate": null
    },
    {
        "ap": "Ap"
    },
    {
        "1861or a tightly packed mass0.20 feet/s30 feet/s1.7  g/cm³for finefor coarse1998medium and small-bore arms such as muskets and fusilssmall-bore rifles and pistolsextreme small bore, short pistols and most commonly for priming ": null
    },
    {
        "flintlocks": "Flintlock"
    },
    {
        " rtrid": "Rtrid"
    },
    {
        "1953rifle grained finerifle grained large": null
    },
    {
        "a": "A"
    },
    {
        "solid residueSBCSMPSFG nin order of descending quantitiesin appropriate proportionsan early gun ignition system4.7 ": null
    },
    {
        "megajoules": "Joulemegajoule"
    },
    {
        " per kilogram47.2 megajoules per kilogram, but gasoline requires an oxidant, so an optimized gasoline and O 2 mixture contains 10.4 megajoules per kilogramburns quicklyand most importantly, gases produced by its burning": null
    },
    {
        "apon": "Apon"
    },
    {
        "2007giving away a soldiers position, generating fog that hinders vision, etc.black powderincluding railroad constructionsuch as those for cement, lime, phosphate, etc.1809": null
    },
    {
        "o": "O"
    },
    {
        "1841–42": null
    }
]