[
    {
        "        Gustav Klimt was an Austrian ": null
    },
    {
        "symbolist painter": "Symbolism"
    },
    {
        " and one of the most prominent members of the ": null
    },
    {
        "Vienna Secession": "Vienna Secession"
    },
    {
        " movement. Klimt is noted for his paintings, ": null
    },
    {
        "murals": "Mural"
    },
    {
        ", ": null
    },
    {
        "sketches": "Sketch"
    },
    {
        ", and other ": null
    },
    {
        "objets dart": "Objets Dart"
    },
    {
        ". Klimts primary subject was the female body, and his works are marked by a frank eroticism. In addition to his figurative works, which include allegories and portraits, he painted landscapes. Among the artists of the Vienna Secession, Klimt was the most influenced by ": null
    },
    {
        "Japanese art": "Japanese Art"
    },
    {
        " and its methods.     Early in his artistic career, he was a successful painter of architectural decorations in a conventional manner. As he developed a more personal style, his work was the subject of controversy that culminated when the paintings he completed around 1900 for the ceiling of the Great Hall of the ": null
    },
    {
        "University of Vienna": "University Of Vienna"
    },
    {
        " were criticized as pornographic. He subsequently accepted no more public commissions, but achieved a new success with the paintings of his golden phase , many of which include gold leaf. Klimts work was an important influence on his younger contemporary ": null
    },
    {
        "Egon Schiele": "Egon Schiele"
    },
    {
        ".                   Gustav Klimt was born in ": null
    },
    {
        "Baumgarten": "Baumgarten, Vienna"
    },
    {
        ", near ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        " in Austria-Hungary, the second of seven children—three boys and four girls. His mother, Anna Klimt , had an unrealized ambition to be a musical performer. His father, Ernst Klimt the Elder, formerly from ": null
    },
    {
        "Bohemia": "Bohemia"
    },
    {
        ", was a gold engraver. All three of their sons displayed artistic talent early on. Klimts younger brothers were ": null
    },
    {
        "Ernst Klimt": "Ernst Klimt"
    },
    {
        " and Georg Klimt.     Klimt lived in poverty while attending the Vienna ": null
    },
    {
        "Kunstgewerbeschule": "Kunstgewerbeschule"
    },
    {
        ", a school of applied arts and crafts, now the ": null
    },
    {
        "University of Applied Arts Vienna": "University Of Applied Arts Vienna"
    },
    {
        ", where he studied ": null
    },
    {
        "architectural painting": "Architectural Painting"
    },
    {
        " from 1876 until 1883. Bailey, Colin B., Peter Vergo, Emily Braun, Jane Kallir, and John Collins . Gustav Klimt: Modernism in the Making. New York: Abrams. p. 55. . He revered Viennas foremost history painter of the time, ": null
    },
    {
        "Hans Makart": "Hans Makart"
    },
    {
        ". Klimt readily accepted the principles of a conservative training; his early work may be classified as academic. In 1877 his brother, Ernst, who, like his father, would become an engraver, also enrolled in the school. The two brothers and their friend, Franz Matsch, began working together and by 1880 they had received numerous commissions as a team that they called the Company of Artists . They also helped their teacher in painting murals in the ": null
    },
    {
        "Kunsthistorisches Museum": "Kunsthistorisches Museum"
    },
    {
        " in Vienna. Klimt began his professional career painting interior murals and ceilings in large public buildings on the ": null
    },
    {
        "Ringstraße": "Ringstraße"
    },
    {
        ", including a successful series of Allegories and Emblems .     In 1888 Klimt received the Golden Order of Merit from Emperor ": null
    },
    {
        "Franz Josef I of Austria": "Franz Josef I Of Austria"
    },
    {
        " for his contributions to murals painted in the ": null
    },
    {
        "Burgtheater": "Burgtheater"
    },
    {
        " in Vienna. He also became an honorary member of the ": null
    },
    {
        "University of Munich": "University Of Munich"
    },
    {
        " and the ": null
    },
    {
        "University of Vienna": "University Of Vienna"
    },
    {
        ". In 1892 Klimts father and brother Ernst both died, and he had to assume financial responsibility for his fathers and brothers families. The tragedies also affected his artistic vision and soon he would move towards a new personal style.   Characteristic of his style at the end of the 19th century is the inclusion of  Nuda Veritas   as a symbolic figure in some of his works, including Ancient Greece and Egypt , Pallas Athene and Nuda Veritas .  Article in Kurier, May 12, 2012.  Article on the Website of the ": null
    },
    {
        "Austrian Theatre Museum": "Austrian Theatre Museum"
    },
    {
        ". Historians believe that Klimt with the nuda veritas denounced both the policy of the ": null
    },
    {
        "Habsburgs": "Habsburg Monarchy"
    },
    {
        " and Austrian society, which ignored all political and social problems of that time. Jane Rogoyska, Patrick Bade: Gustav Klimt, page 30. Parkstone International, 2012 . , .   In the early 1890s Klimt met Austrian ": null
    },
    {
        "fashion designer": "Fashion Designer"
    },
    {
        " Emilie Louise Flöge": "Emilie Louise Flöge"
    },
    {
        " who was to be his companion until the end of his life. His painting, ": null
    },
    {
        "The Kiss": "The Kiss"
    },
    {
        " , is thought to be an image of them as lovers. He designed many costumes that she produced and modeled in his works.     During this period Klimt fathered at least fourteen children.             Klimt became one of the founding members and president of the Wiener Sezession  in 1897 and of the groups periodical,  Ver Sacrum  . He remained with the Secession until 1908. The goals of the group were to provide exhibitions for unconventional young artists, to bring the works of the best foreign artists to Vienna, and to publish its own magazine to showcase the work of members. The group declared no ": null
    },
    {
        "manifesto": "Manifesto"
    },
    {
        " and did not set out to encourage any particular style—": null
    },
    {
        "Naturalists": "Naturalist School Of Painting"
    },
    {
        ", ": null
    },
    {
        "Realists": "Realism"
    },
    {
        ", and ": null
    },
    {
        "Symbolists": "Symbolism"
    },
    {
        " all coexisted. The government supported their efforts and gave them a lease on public land to erect an exhibition hall. The groups symbol was ": null
    },
    {
        "Pallas Athena": "Pallas Athena"
    },
    {
        ", the ": null
    },
    {
        "Greek": "Greek Mythology"
    },
    {
        " goddess of just causes, wisdom, and the arts—of whom Klimt painted his radical version in 1898. Klimts radical version of       In 1894, Klimt was commissioned to create ": null
    },
    {
        "three paintings": "Klimt University Of Vienna Ceiling Paintings"
    },
    {
        " to decorate the ceiling of the Great Hall of the ": null
    },
    {
        "University of Vienna": "University Of Vienna"
    },
    {
        ". Not completed until the turn of the century, his three paintings, Philosophy, Medicine, and Jurisprudence were criticized for their radical themes and material, and were called ": null
    },
    {
        "pornographic": "Pornography"
    },
    {
        " . Klimt had transformed traditional ": null
    },
    {
        "allegory": "Allegory"
    },
    {
        " and symbolism into a new language that was more overtly sexual and hence more disturbing to some. The public outcry came from all quarters—political, aesthetic and religious. As a result, the paintings  were not displayed on the ceiling of the Great Hall. This would be the last public commission accepted by the artist.     All three paintings were destroyed when retreating German forces burned ": null
    },
    {
        "Schloss Immendorf": "Schloss Immendorf"
    },
    {
        " in May 1945.       His Nuda Veritas defined his bid to further shake up the establishment.  The starkly naked red-headed woman holds the mirror of truth, while above her is a quotation by ": null
    },
    {
        "Friedrich Schiller": "Friedrich Schiller"
    },
    {
        " in stylized lettering: If you cannot please everyone with your deeds and your art, please only a few. To please many is bad.      In 1902, Klimt finished the  Beethoven Frieze  for the Fourteenth Vienna Secessionist exhibition, which was intended to be a celebration of the composer and featured a monumental ": null
    },
    {
        "polychrome": "Polychrome"
    },
    {
        " sculpture by ": null
    },
    {
        "Max Klinger": "Max Klinger"
    },
    {
        ". Intended for the exhibition only, the frieze was painted directly on the walls with light materials. After the exhibition the painting was preserved, although it was not displayed again until 1986. The face on the Beethoven portrait resembled the composer and Vienna Court Opera director ": null
    },
    {
        "Gustav Mahler": "Gustav Mahler"
    },
    {
        ". Johnson, Julian, Mahlers Voices: Expression and Irony in the Songs and Symphonies. Oxford University Press , , p. 235 .     During this period Klimt did not confine himself to public commissions. Beginning in the late 1890s he took annual summer holidays with the Flöge family on the shores of ": null
    },
    {
        "Attersee": "Attersee"
    },
    {
        " and painted many of his landscapes there. These landscapes constitute the only genre aside from ": null
    },
    {
        "figure painting": "Figure Painting"
    },
    {
        " that seriously interested Klimt. In recognition of his intensity, the locals called him Waldschrat .      Klimts Attersee paintings are of sufficient number and quality as to merit separate appreciation. Formally, the landscapes are characterized by the same refinement of design and emphatic patterning as the figural pieces. Deep space in the Attersee works is flattened so efficiently to a single plane that it is believed that Klimt painted them by using a telescope.             Klimts Golden Phase was marked by positive critical reaction and financial success. Many of his paintings from this period included ": null
    },
    {
        "gold leaf": "Gold Leaf"
    },
    {
        ". Klimt had previously used gold in his Pallas Athene and  Judith I  , although the works most popularly associated with this period are the  Portrait of Adele Bloch-Bauer I  and  The Kiss  .     Klimt travelled little, but trips to Venice and ": null
    },
    {
        "Ravenna": "Ravenna"
    },
    {
        ", both famous for their beautiful mosaics, most likely inspired his gold technique and his ": null
    },
    {
        "Byzantine imagery": "Byzantine Art"
    },
    {
        ". In 1904, he collaborated with other artists on the lavish ": null
    },
    {
        "Palais Stoclet": "Stoclet Palace"
    },
    {
        ", the home of a wealthy Belgian industrialist that was one of the grandest monuments of the ": null
    },
    {
        "Art Nouveau": "Art Nouveau"
    },
    {
        " age. Klimts contributions to the dining room, including both Fulfillment and Expectation, were some of his finest decorative works, and as he publicly stated, probably the ultimate stage of my development of ornament.      In 1905, Klimt created a painted portrait of Margarete Wittgenstein, ": null
    },
    {
        "Ludwig Wittgensteins": "Ludwig Wittgenstein"
    },
    {
        " sister, on the occasion of her marriage. Edmunds, D. and Eidenow, J. Wittgensteins Poker: The Story of a Ten-Minute Argument Between Two Great Philosophers, 2001, page 83. Then, between 1907 and 1909, Klimt painted five canvases of society women wrapped in fur. His apparent love of costume is expressed in the many photographs of Flöge modeling clothing he had designed.     As he worked and relaxed in his home, Klimt normally wore sandals and a long robe with no undergarments. His simple life was somewhat cloistered, devoted to his art, family, and little else except the Secessionist Movement. He avoided café society and seldom socialized with other artists. Klimts fame usually brought patrons to his door and he could afford to be highly selective. His painting method was very deliberate and painstaking at times and he required lengthy sittings by his subjects. Although very active sexually, he kept his affairs discreet and he avoided personal scandal.     Klimt wrote little about his vision or his methods. He wrote mostly postcards to Flöge and kept no diary. In a rare writing called Commentary on a non-existent self-portrait , he states I have never painted a self-portrait. I am less interested in myself as a subject for a painting than I am in other people, above all women... There is nothing special about me. I am a painter who paints day after day from morning to night  ... Who ever wants to know something about me  ... ought to look carefully at my pictures.      In 1901 ": null
    },
    {
        "Hermann Bahr": "Hermann Bahr"
    },
    {
        " wrote, in his Speech on Klimt            In 1911 his painting  Death and Life  received first prize in the ": null
    },
    {
        "world exhibitions": "International Exhibition Of Art"
    },
    {
        " in Rome. In 1915 Anna, his mother, died. Klimt died three years later in Vienna on February 6, 1918, having suffered a ": null
    },
    {
        "stroke": "Stroke"
    },
    {
        " and ": null
    },
    {
        "pneumonia": "Pneumonia"
    },
    {
        " due to the ": null
    },
    {
        "worldwide influenza epidemic of that year": "1918 Flu Pandemic"
    },
    {
        ".    He was buried at the ": null
    },
    {
        "Hietzinger Cemetery": "Hietzinger Cemetery"
    },
    {
        " in ": null
    },
    {
        "Hietzing": "Hietzing"
    },
    {
        ", Vienna. Numerous paintings by him were left ": null
    },
    {
        "unfinished": "Unfinished Creative Work"
    },
    {
        ".     Klimts paintings have brought some of the highest prices recorded for individual works of art. In November 2003, Klimts Landhaus am Attersee sold for ": null
    },
    {
        "$": "United States Dollar"
    },
    {
        "29,128,000, . but that sale was soon eclipsed by prices paid for Willem de Koonings Woman III and later Klimts own  Adele Bloch-Bauer II , the latter of which sold for $150 million in 2016. More frequently than paintings, however, the artists works on paper can be found on the art market. The art market database Artprice lists 67 auction entries for paintings, but 1564 for drawings and watercolors.  The most expensive drawing sold so far was Reclining Female Nude Facing Left , which was made between 1914 and 1915 and sold in London in 2008 for .  However, the majority of the art trade traditionally takes place privately  through galleries such as Wienerroither & Kohlbacher, which specialize in the trade with original works by Gustav Klimt and ": null
    },
    {
        "Egon Schiele": "Egon Schiele"
    },
    {
        " and regularly present these at monographic exhibitions and international art fairs.       In 2006, the 1907 portrait,  Adele Bloch-Bauer I , was purchased for the ": null
    },
    {
        "Neue Galerie New York": "Neue Galerie New York"
    },
    {
        " by ": null
    },
    {
        "Ronald Lauder": "Ronald Lauder"
    },
    {
        " reportedly for US $135 million, surpassing ": null
    },
    {
        "Picassos": "Picasso"
    },
    {
        " 1905  Boy With a Pipe  , as the highest reported price ever paid for a painting up to that point.     On August 7, 2006, ": null
    },
    {
        "Christies": "Christies"
    },
    {
        " auction house announced it was handling the sale of the remaining four works by Klimt that were recovered by ": null
    },
    {
        "Maria Altmann": "Maria Altmann"
    },
    {
        " and her co-heirs after their long legal battle against Austria . Maria Altmanns fight to regain her familys paintings has been the subject of a number of documentary films, including Adeles Wish.  Her struggle also became the subject of the dramatic film the  Woman in Gold , a movie inspired by Stealing Klimt, the documentary featuring ": null
    },
    {
        "Maria Altmann": "Maria Altmann"
    },
    {
        " herself.  The portrait of  Adele Bloch-Bauer II  was sold at auction in November 2006 for $88 million, the third-highest priced piece of art at auction at the time.   The Apple Tree I sold for $33 million, Birch Forest sold for $40.3 million, and Houses in Unterach on Lake Atter sold for $31 million. Collectively, the five restituted paintings netted more than $327 million. The painting Litzlberg am Attersee was auctioned for $40.4 million at ": null
    },
    {
        "Sothebys": "Sothebys"
    },
    {
        " in November 2011.      The city of ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        ", Austria had many special exhibitions commemorating the 150th anniversary of Klimts birth in 2012.               Das Werk   The only folio set produced in Klimts lifetime, Das Werk Gustav Klimts, was published initially by H. O. Miethke from 1908 to 1914 in an edition of 300, supervised personally by the artist. The first thirty-five editions each included an original drawing by Klimt, and the next thirty-five editions each with a facsimile signature on the title page.  Fifty images depicting Klimts most important paintings were reproduced using ": null
    },
    {
        "collotype": "Collotype"
    },
    {
        " lithography and mounted on a heavy, cream-colored ": null
    },
    {
        "wove paper": "Wove Paper"
    },
    {
        " with ": null
    },
    {
        "deckle": "Deckle"
    },
    {
        "d edges. Thirty-one of the images are printed on  Chine-collé . The remaining nineteen are high quality ": null
    },
    {
        "halftones": "Halftones"
    },
    {
        " prints. Each piece was marked with a unique signet—designed by Klimt—which was impressed into the wove paper in gold metallic ink. The prints were issued in groups of ten to subscribers, in unbound black paper folders ": null
    },
    {
        "embossed": "Paper Embossing"
    },
    {
        " with Klimts name. Because of the delicate nature of collotype lithography, as well as the necessity for multicolored prints , and Klimts own desire for perfection, the series that was published in mid-1908 was not completed until 1914.     Each of the fifty prints was categorized among five themes:   Allegorical    Erotic-Symbolist    Landscapes    Mythical or Biblical    Portraits      The monochrome collotypes as well as the halftone works were printed with a variety of colored inks ranging from sepia to blue and green. Emperor ": null
    },
    {
        "Franz Joseph I of Austria": "Franz Joseph I Of Austria"
    },
    {
        " was the first to purchase a folio set of Das Werk Gustav Klimts in 1908.     Fünfundzwanzig HandzeichnungenFünfundzwanzig Handzeichnungen was released the year after Klimts death. Many of the drawings in the collection were erotic in nature and just as polarizing as his painted works. Published in Vienna in 1919 by Gilhofer & Ranschburg, the edition of 500 features twenty-five monochrome and two-color collotype reproductions, nearly indistinguishable from the original works. While the set was released a year after Klimts death, some art historians suspect he was involved with production planning due to the meticulous nature of the printing . The first ten editions also each contained an original Klimt drawing.     Many of the works contained in this volume depict erotic scenes of nude women, some of whom are masturbating alone or are coupled in ": null
    },
    {
        "sapphic": "Sapphic Love"
    },
    {
        " embraces. ,  Gottfried Fliedl, Gustav Klimt, 1862-1918: The World in Female Form, Taschen, 1997, p. 192,  When a number of the original drawings were exhibited to the public, at Gallerie Miethke in 1910 and the International Exhibition of Prints and Drawings in Vienna in 1913, they were met by critics and viewers who were hostile towards Klimts contemporary perspective. There was an audience for Klimts erotic drawings, however, and fifteen of his drawings were selected by Viennese poet ": null
    },
    {
        "Franz Blei": "Franz Blei"
    },
    {
        " for his translation of Hellenistic satirist ": null
    },
    {
        "Lucians": "Lucian"
    },
    {
        " Dialogues of the Courteseans. The book, limited to 450 copies, provided Klimt the opportunity to show these more lurid depictions of women and avoided censorship thanks to an audience composed of a small group of affluent patrons.     Gustav Klimt An AftermathGustav Klimt An Aftermath was intended to complete the lifetime folio Das Werk Gustav Klimts. The folio contains thirty colored ": null
    },
    {
        "collotypes": "Collotypes"
    },
    {
        " and follows a similar format found in Das Werk Gustav Klimts, replacing the unique Klimt-designed signets with gold-debossed plate numbers. One hundred and fifty sets were produced in English, with twenty of them presented as a gala edition bound in gilt leather. The set contains detailed images from previously released works , as well as the unfinished paintings  Der Blinde  1896, ": null
    },
    {
        "Leopold Museum": "Leopold Museum"
    },
    {
        " Stiller Weiher   1899, ": null
    },
    {
        "Leopold Museum": "Leopold Museum"
    },
    {
        " Schubert am Klavier  Philosophie Medicine  Medicine  Jurisprudence  Judith and the Head of Holofernes , 1901. ": null
    },
    {
        "Österreichische Galerie Belvedere": "Österreichische Galerie Belvedere"
    },
    {
        ", ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        " Portrait of Hermine Gallia, 1904. ": null
    },
    {
        "National Gallery, London": "National Gallery, London"
    },
    {
        "  The Three Ages of Woman , 1905, ": null
    },
    {
        "Galleria Nazionale dArte Moderna": "Galleria Nazionale Darte Moderna"
    },
    {
        ", ": null
    },
    {
        "Rome": "Rome"
    },
    {
        " Portrait of Fritza Riedler   Danaë   Hope II , 1907–08, ": null
    },
    {
        "Museum of Modern Art": "Museum Of Modern Art"
    },
    {
        ", ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " Mäda Gertrude Primavesi, 1912, ": null
    },
    {
        "Metropolitan Museum of Art": "Metropolitan Museum Of Art"
    },
    {
        " Eugenia Primavesi Avenue in Schloss Kammer Park Girlfriends or Two Women Friends, 1916–17,  Idylle  1884, ": null
    },
    {
        "Vienna Museum": "Vienna Museum"
    },
    {
        ", ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        ", ": null
    },
    {
        "Austria": "Austria"
    },
    {
        "           In 1963, the Albertina Museum in Vienna began researching the drawings of Gustav Klimt. The research project Gustav Klimt. Die Zeichnungen, has since been associated with intensive exhibition and publication activities.     Between 1980 and 1984 ": null
    },
    {
        "Alice Strobl": "Alice Strobl"
    },
    {
        " published the three-volume catalogue raisonné, which records and describes all drawings by Gustav Klimt known at the time in chronological order. An additional supplementary volume was published in 1989. In the following year Alice Strobl transferred her work to the art historian and curator ": null
    },
    {
        "Marian Bisanz-Prakken": "Marian Bisanz-Prakken"
    },
    {
        ", who had assisted her since 1975 in the determination and classification of the works and who continues the research project to this day. Since 1990, Marian Bisanz-Prakken has redefined, documented, and scientifically processed around 400 further drawings.      This makes the Albertina Vienna the only institution in the world that has been examining and scientifically classifying the artists works for half a century. The research project now includes information on over 4300 works by Gustav Klimt.       GUGG Two Female Nudes Standing.jpg|Two Female Nudes Standing, c. 1900, ": null
    },
    {
        "Solomon R. Guggenheim Museum": "Solomon R. Guggenheim Museum"
    },
    {
        "   GUGG Girl Seated in a Chair.jpg|Girl Seated in a Chair, 1904, ": null
    },
    {
        "Solomon R. Guggenheim Museum": "Solomon R. Guggenheim Museum"
    },
    {
        " Portrait of a Woman, c. 1910, ": null
    },
    {
        "National Gallery of Art": "National Gallery Of Art"
    },
    {
        " Frau bei der Selbstbefriedigung , 1913                      ": null
    },
    {
        "Klimt University of Vienna Ceiling Paintings": "Klimt University Of Vienna Ceiling Paintings"
    },
    {
        "  Palais Stoclet  ": null
    },
    {
        "mosaic": "Mosaic"
    },
    {
        " in ": null
    },
    {
        "Brussels": "Brussels, Belgium"
    },
    {
        "  Fable    Idylle   ": null
    },
    {
        "The Theatre in Taormina": "Commons:File:Klimt - Theater In Taormina.Jpeg"
    },
    {
        " , ": null
    },
    {
        "Burgtheater": "Burgtheater"
    },
    {
        ", Vienna   ": null
    },
    {
        "Auditorium in the Old Burgtheater, Vienna": "Commons:File:Gustav Klimt 072.Jpg"
    },
    {
        "   Portrait of Joseph Pembauer, the Pianist and Piano Teacher   Ancient Greece II    Portrait of a Lady   Music I   Love   Sculpture   Tragedy   Music II    Pallas Athene    Flowing water   Portrait of Sonja Knips   Fish Blood    Schubert at the Piano   After the Rain    Nymphs    Mermaids   ": null
    },
    {
        "Philosophy": "Klimt University Of Vienna Ceiling Paintings"
    },
    {
        "    Nuda Veritas   Portrait of Serena Lederer    ": null
    },
    {
        "Medicine": "Medicine"
    },
    {
        "   Music    Judith I     Buchenwald    Gold Fish    Portrait of Gertha Felsovanyi   Portrait of Emilie Flöge    Beech Forest   Beech Forest I    Beethoven Frieze       Beech woods    Hope    Pear Tree    Life is a struggle   ": null
    },
    {
        "Jurisprudence": "Klimt University Of Vienna Ceiling Paintings"
    },
    {
        "     Water Serpents I    Water Serpents II    The Three Ages of Woman    Portrait of Margaret Stonborough-Wittgenstein    Farm Garden    The Stoclet Frieze     Portrait of Fritsa Reidler    Sunflower   Farm Garden with Sunflowers    Danaë     Portrait of Adele Bloch-Bauer I    Poppy Field    Hope II     on the ": null
    },
    {
        "Attersee": "Attersee"
    },
    {
        " I    The Kiss    Lady with Hat and Feather Boa    The Tree of Life    ": null
    },
    {
        "Judith II": ":Image:Gustav Klimt 038.Jpg"
    },
    {
        "    Black Feather Hat    Schloss Kammer on the Attersee III   The Park    Death and Life    ": null
    },
    {
        "Cottage Garden with Crucifix": ":File:Gustav Klimt - Bauerngarten Mit Kruzifix 1911-12.Jpg"
    },
    {
        "   Apple Tree   Foresters House, Weissenbach on Lake Attersee   Portrait of Mäda Gertrude Primavesi     Portrait of Adele Bloch-Bauer II     The Maiden    Semi-nude seated, reclining   Semi-nude seated, with closed eyes   Portrait of Eugenia Primavesi   Lovers, drawn from the right   Portrait of Elisabeth Bachofen-Echt   Semi-nude lying, drawn from the right   Portrait of Friederike Maria Beer    Houses in Unterach on the Attersee     Death and Life    Garden Path with Chickens   The Girl-Friends   Woman seated with thighs apart, drawing   The Dancer   Leda    Portrait of a Lady , en face   The Bride   Adam and Eve   Portrait of Johanna Staude                   According to the writer Frank Whitford: Klimt of course, is an important artist—hes a very popular artist—but in terms of the history of art, hes a very unimportant artist. Although he sums up so much in his work, about the society in which he found himself—in art historical terms his effect was negligible. So hes an artist really in a cul-de-sac. Whitford, speaking on The Kiss: The Private Life of a Masterpiece, BBC TV Klimts work had a strong influence on the paintings of Egon Schiele , with whom he would collaborate to found the Kunsthalle in 1917, to try to keep local artists from going abroad. Artists who reinterpreted Klimts work include Slovak artist Rudolf Fila .       Several of Klimts most famous works from his golden period inspired the title sequence for the animated adaptation of the manga series, ": null
    },
    {
        "Elfen Lied": "Elfen Lied"
    },
    {
        ", in which the art is recreated to fit with the series own characters and is arranged as a montage with the song Lilium . The opening to the anime ": null
    },
    {
        "Sound of the Sky": "Sound Of The Sky"
    },
    {
        " also is largely inspired by Klimts works, which was also directed by the same director as Elfen Lied. The design of the land of Centopia on the TV series ": null
    },
    {
        "Mia and Me": "Mia And Me"
    },
    {
        " is inspired by Klimts works. The art of the video game Transistor also uses patterns and embellishments inspired by Klimt.     Couturier John Galliano found inspiration for the Christian Dior Spring-Summer 2008 haute couture collection in Klimts work.     Gustav Klimt and his work have been the subjects of many collector coins and medals, such as the 100 Euro Painting Gold Coin , issued on November 5, 2003, by the Austrian Mint . The obverse depicts Klimt in his studio with two unfinished paintings on easels.       In addition to the permanent exhibitions on display, the city of Vienna , Austria celebrated the 150th anniversary of the birth of Klimt with special exhibitions throughout the city. Guided walking tours through the city allowed people to see some of the buildings where Klimt worked.     Google commemorated Gustav Klimt with a Google doodle celebrating Klimts painting ": null
    },
    {
        "The Kiss": "The Kiss"
    },
    {
        " on his 150th birthday, 14 July 2012.     In 2012, the Austrian Mint began a five-coin gold series to coincide with the 150th anniversary of Klimts birth. The first 50 Euro gold coin was issued on January 25, 2012 and featured a portrait of Klimt on the obverse and a portion of his painting of Adele Bloch-Bauer. Coin Update News 13 January 2012.       In 2013, the Gustav Klimt Foundation was set up by Ursula Ucicky, widow of Klimts illegitimate son Gustav Ucicky , with a mission to preserve and disseminate Gustav Klimts legacy. The managing director of the Leopold Museum , Peter Weinhäupl, was appointed as Chairman of the foundation. As a reaction, the museums director Tobias G. Natter resigned in protest, citing Ucickys past as a Nazi propaganda film-maker. Julia Michalska , ": null
    },
    {
        "The Art Newspaper": "The Art Newspaper"
    },
    {
        ".       National Public Radio reported on January 17, 2006 that The Austrian National Gallery is being compelled by a national arbitration board to return five paintings by Gustav Klimt to a Los Angeles based woman, the heir of a Jewish family that had its art stolen by the Nazis . The paintings are estimated to be worth at least $150 million. Burbank, Luke National Public Radio , 17 January 2006. This incident, involving Maria Altmann , was subsequently made into the Hollywood movie ": null
    },
    {
        "Woman in Gold": "Woman In Gold"
    }
]