[
    {
        "        Gylfaginning  is the first part of ": null
    },
    {
        "Snorri Sturlusons": "Snorri Sturluson"
    },
    {
        " 13th century  Prose Edda  after ": null
    },
    {
        "Prologue": "Prologue"
    },
    {
        ". The Gylfaginning deals with the creation and destruction of the world of the ": null
    },
    {
        "Norse gods": "Norse Gods"
    },
    {
        ", and many other aspects of ": null
    },
    {
        "Norse mythology": "Norse Mythology"
    },
    {
        ". The second part of the Prose Edda is called the  Skáldskaparmál  and the third  Háttatal .       The Gylfaginning tells the story of Gylfi, a king of the land that men now call Sweden , who after being tricked by one of the goddesses of the ": null
    },
    {
        "Æsir": "Æsir"
    },
    {
        ", wonders if all ": null
    },
    {
        "Æsir": "Æsir"
    },
    {
        " use magic and tricks for their will to be done. This is why he journeys to ": null
    },
    {
        "Asgard": "Asgard"
    },
    {
        ", but on the way he is tricked by the gods and arrives in some other place, where he finds a great palace. Inside the palace he encounters a man who asks Gylfis name and so King Gylfi introduces himself as Gangleri. Gangleri then is taken to the king of the palace and comes upon three men: ": null
    },
    {
        "High, Just-As-High, and Third": "High, Just-As-High, And Third"
    },
    {
        ".     Gangleri is then challenged to show his wisdom by asking questions, as is the custom in many ": null
    },
    {
        "Norse sagas": "Norse Sagas"
    },
    {
        ". Each question made to High, Just-As-High, and Third is about an aspect of the Norse mythology or its gods, and also about the creation and destruction of the world . In the end all the palace and its people just vanish and Gylfi is left standing on empty ground. It is then implied that as Gylfi returns to his nation, he retells the tales he was told. It can be argued that Snorri used this narrative device as a means of being able to safely document a vanishing and largely oral tradition within a Christian context.               in ": null
    },
    {
        "Old Norse": "Old Norse"
    },
    {
        " at heimskringla.no                               ": null
    }
]