[
    {
        "            The Göta Canal  is a ": null
    },
    {
        "Swedish": "Sweden"
    },
    {
        " canal": "Canal"
    },
    {
        " constructed in the early 19th century. It formed the backbone of a waterway stretching some , linking a number of lakes and rivers to provide a route from ": null
    },
    {
        "Gothenburg": "Gothenburg"
    },
    {
        " on the west coast to ": null
    },
    {
        "Söderköping": "Söderköping"
    },
    {
        " on the ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        " via the river ": null
    },
    {
        "Göta älv": "Göta Älv"
    },
    {
        " and the ": null
    },
    {
        "Trollhätte kanal": "Trollhätte Canal"
    },
    {
        ", through the large lakes ": null
    },
    {
        "Vänern": "Vänern"
    },
    {
        " and ": null
    },
    {
        "Vättern": "Vättern"
    },
    {
        ".     The canal itself is  long, of which  were dug or blasted, with a width varying between  and a maximum depth of about . Uno Svedin, Britt Hägerhäll Aniansson, Sustainability, Local Democracy and the Future: The Swedish Model, pp. 93-94. Springer, 2002.  It has 58 locks and can accommodate vessels up to  long,  wide and  in ": null
    },
    {
        "draft": "Draft"
    },
    {
        ". Gunnar Alexandersson, The Baltic Straits, fn. 9 p. 123. Martinus Nijhoff Publishers, 1982.  Göta Canal is a sister canal of ": null
    },
    {
        "Caledonian Canal": "Caledonian Canal"
    },
    {
        " in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ", which was also constructed by ": null
    },
    {
        "Thomas Telford": "Thomas Telford"
    },
    {
        ".          The idea of a canal across southern Sweden was first put forward as early as 1516, by ": null
    },
    {
        "Hans Brask": "Hans Brask"
    },
    {
        ", the bishop of ": null
    },
    {
        "Linköping": "Linköping"
    },
    {
        ". However, it was not until the start of the 19th century that Brasks proposals were put into action by ": null
    },
    {
        "Baltzar von Platen": "Baltzar Von Platen"
    },
    {
        ", a German-born former officer in the ": null
    },
    {
        "Swedish Navy": "Swedish Navy"
    },
    {
        ". He organised the project and obtained the necessary financial and political backing. His plans attracted the enthusiastic backing of the government and the new king, ": null
    },
    {
        "Charles XIII": "Charles Xiii Of Sweden"
    },
    {
        ", who saw the canal as a way of kick-starting the modernisation of Sweden. Litellus Russell Muirhead, Sweden, p. 105. Rand McNally, 1952. Von Platen himself extolled the modernising virtues of the canal in 1806, claiming that mining, agriculture and other industries would benefit from a navigation way through the country. Quoted in Lars Magnusson, An Economic History of Sweden, p. 115. Routledge, 2000.      The project was inaugurated on 11 April 1810 with a budget of 24 million ": null
    },
    {
        "Swedish riksdalers": "Swedish Riksdaler"
    },
    {
        ". R Nisbet Bain, Scandinavia: A Political History of Denmark, Norway and Sweden from 1513 to 1900, p. 432. University Press, Cambridge, 1905 It was by far the greatest civil engineering project ever undertaken in Sweden up to that time, taking 22 years of effort by more than 58,000 workers. Much of the expertise and equipment had to be acquired from abroad, notably from ": null
    },
    {
        "Britain": "United Kingdom"
    },
    {
        ", whose ": null
    },
    {
        "canal system": "History Of The British Canal System"
    },
    {
        " was the most advanced in the world at that time. The ": null
    },
    {
        "Scottish": "Scotland"
    },
    {
        " civil engineer": "Civil Engineer"
    },
    {
        " Thomas Telford": "Thomas Telford"
    },
    {
        " developed the initial plans for the canal and travelled to Sweden in 1810 to oversee some of the early work on the route. Many other British engineers and craftsmen were imported to assist with the project, along with significant quantities of equipment - even apparently mundane items such as pickaxes, spades and wheelbarrows.     The Göta Canal was officially opened on 26 September 1832 in an event commemorated by the painter ": null
    },
    {
        "Johan Christian Berger": "Johan Christian Berger"
    },
    {
        " in his work The Opening of the Göta Canal on 26 September 1832. Von Platen himself did not live to see the completion of the canal, having died shortly before its opening. However, it was never an economic success. The ": null
    },
    {
        "arrival of the railways": "Rail Transport In Sweden"
    },
    {
        " in 1855 quickly made it redundant, as trains could carry passengers and goods far more rapidly and did not have to shut down with the arrival of winter, which made the canal impassable for five months of the year. Neil Kent, The Soul of the North: A Social, Architectural and Cultural History of the Nordic Countries, 1700-1940, p. 172. Reaktion Books, 2000.  By the 1870s, the canals goods traffic had dwindled to just three major types of bulk goods - forest products, coal and ore, none of which required rapid transportation. Traffic volumes stagnated after that and never recovered.        Bishop Hans Brasks original justifications for the canals construction were the onerous ": null
    },
    {
        "Sound Dues": "Sound Dues"
    },
    {
        " imposed by ": null
    },
    {
        "Denmark–Norway": "Denmark–Norway"
    },
    {
        " on all vessels passing through the narrow ": null
    },
    {
        "Øresund": "Øresund"
    },
    {
        " channel between Sweden and Denmark and the trouble with the ": null
    },
    {
        "Hanseatic League": "Hanseatic League"
    },
    {
        ". The canal enabled vessels travelling to or from the Baltic Sea to bypass the Øresund and so evade the Danish toll. Gunnar Alexandersson, The Baltic Straits, p. 72. Martinus Nijhoff Publishers, 1982.  In 1851, the tycoon ": null
    },
    {
        "André Oscar Wallenberg": "Wallenberg Family"
    },
    {
        " founded the Company for Swedish Canal Steamboat Transit Traffic to carry goods from England to Russia via the canal. However, it only ran two trips between ": null
    },
    {
        "St Petersburg": "St Petersburg"
    },
    {
        " and ": null
    },
    {
        "Hull": "Kingston Upon Hull"
    },
    {
        " via ": null
    },
    {
        "Motala": "Motala"
    },
    {
        " before the ": null
    },
    {
        "Crimean War": "Crimean War"
    },
    {
        " halted Anglo-Russian trade. After the war ended, the great powers pressured Denmark into ending the four-hundred-year-old tradition of the Sound Dues, thus eliminating at a stroke the canals usefulness as an alternative to the Øresund. Goran B. Nilsson, Founder: André Oscar Wallenberg , p. 231. Almqvist & Wiksell International, 2005.      The canal had one major industrial legacy in the shape of ": null
    },
    {
        "Motala Verkstad": "Motala Verkstad"
    },
    {
        " - a factory established in Motala to produce the machines such as cranes and steam dredgers that were needed to build the canal. This facility has sometimes been referred to as the cradle of the Swedish engineering industry . After the canal was opened, Motala Verkstad focused on producing equipment, locomotives and rolling stock for the newly constructed railways, beginning a tradition of railway engineering that continues to this day in the form of ": null
    },
    {
        "AB Svenska Järnvägsverkstädernas Aeroplanavdelning": "Ab Svenska Järnvägsverkstädernas Aeroplanavdelning"
    },
    {
        " that was bought by the aeroplane manufacturer ": null
    },
    {
        "SAAB": "Saab Ab"
    },
    {
        " in ": null
    },
    {
        "Linköping": "Linköping"
    },
    {
        ".  in ": null
    },
    {
        "Östgöta Correspondenten": "Östgöta Correspondenten"
    },
    {
        "         The Trollhätte Canal  is a canal in ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        " that is now part of the Göta Canal. It connects the ": null
    },
    {
        "Göta älv": "Göta Älv"
    },
    {
        " river with Lake ": null
    },
    {
        "Vänern": "Vänern"
    },
    {
        ".          Ships classified as Vänermax are of the maximum dimensions that will fit through the canal. The maximum dimensions for a boat to traverse this canal are:   Length: 88 m   Width: 13.20 m   Mast height: 27 m   Depth: 5.40 m   This allows ships of around 4000 tonnes in total. The allowed height allows ocean going ships. Around 3.5 million tonnes of goods is freighted annually on Trollhätte Canal.     Trollhätte Canal has six locks. They are from north to south:   Brinkebergskulle   Trollhättan övre   Trollhättan nedre, 3 locks   Lilla Edet       Parts of the canal are still used to transport cargo, but it is now primarily used as a tourist and recreational attraction, dubbed Sveriges blå band . Around two million people visit the canal each year on pleasure cruises - either on own boats or on one of the many cruise ships - and related activities. The canal is called the divorce ditch because of the troubles that couples have to endure while trying to navigate the narrow canal and the many locks by themselves.       From the east-coast of Sweden to Lake ": null
    },
    {
        "Vänern": "Vänern"
    },
    {
        " the locks are as follows :     ": null
    },
    {
        "Mem": "Mem Castle"
    },
    {
        ", 3   ": null
    },
    {
        "Tegelbruket": "Tegelbruket"
    },
    {
        ", 2.3   ": null
    },
    {
        "Söderköping": "Söderköping"
    },
    {
        ", 2.4   ": null
    },
    {
        "Duvkullen nedre": "Duvkullen Nedre"
    },
    {
        ", 2.3   ": null
    },
    {
        "Duvkullen övre": "Duvkullen Övre"
    },
    {
        ", 2.4   ": null
    },
    {
        "Mariehov nedre": "Mariehov Nedre"
    },
    {
        ", 2.1   ": null
    },
    {
        "Mariehov övre": "Mariehov Övre"
    },
    {
        ", 2.6   ": null
    },
    {
        "Carlsborg nedre": "Carlsborg Nedre"
    },
    {
        ", 5.1   ": null
    },
    {
        "Carlsborg övre": "Carlsborg Övre"
    },
    {
        ", 4.7   ": null
    },
    {
        "Klämman": "Klämman"
    },
    {
        ", open   ": null
    },
    {
        "Hulta": "Hulta Locks"
    },
    {
        ", 3.2   ": null
    },
    {
        "Bråttom": "Bråttom"
    },
    {
        ", 2.3   ": null
    },
    {
        "Norsholm": "Norsholm"
    },
    {
        ", 0.8   ": null
    },
    {
        "Carl Johans slussar": "Berg Locks"
    },
    {
        " , 18.8   ": null
    },
    {
        "Oskars slussar": "Bergs Locks"
    },
    {
        ", 4.8   ": null
    },
    {
        "Karl Ludvig Eugéns slussar": "Bergs Locks"
    },
    {
        ", 5.5   ": null
    },
    {
        "Brunnby": "Brunnby Lock"
    },
    {
        ", 5.3   ": null
    },
    {
        "Heda": "Heda Locks"
    },
    {
        ", 5.2   ": null
    },
    {
        "Borensberg": "Borensberg"
    },
    {
        ", 0.2   ": null
    },
    {
        "Borenshult": "Borenshult"
    },
    {
        ", 15.3   ": null
    },
    {
        "Motala": "Motala"
    },
    {
        ", 0.1     Lake Vättern      ": null
    },
    {
        "Forsvik": "Forsvik"
    },
    {
        ", 3.5      Lake Viken  canal highest point     ": null
    },
    {
        "Tåtorp": "Tåtorp"
    },
    {
        ", 0.2   ": null
    },
    {
        "Hajstorp övre": "Hajstorp Övre"
    },
    {
        ", 5.0   ": null
    },
    {
        "Hajstorp nedre": "Hajstorp Nedre"
    },
    {
        ", 5.1   ": null
    },
    {
        "Riksberg": "Riksberg"
    },
    {
        ", 7.5   ": null
    },
    {
        "Godhögen": "Godhögen"
    },
    {
        ", 5.1   ": null
    },
    {
        "Norrkvarn övre": "Norrkvarn Övre"
    },
    {
        ", 2.9   ": null
    },
    {
        "Norrkvarn nedre": "Norrkvarn Nedre"
    },
    {
        ", 2.9   ": null
    },
    {
        "Sjötorp 7-8": "Sjötorp 7-8"
    },
    {
        ", 4.6   ": null
    },
    {
        "Sjötorp 6": "Sjötorp 6"
    },
    {
        ", 2.4   ": null
    },
    {
        "Sjötorp 4-5": "Sjötorp 4-5"
    },
    {
        ", 4.8   ": null
    },
    {
        "Sjötorp 2-3": "Sjötorp 2-3"
    },
    {
        ", 4.8   ": null
    },
    {
        "Sjötorp 1": "Sjötorp 1"
    },
    {
        ", 2.9     After Lake ": null
    },
    {
        "Vänern": "Vänern"
    },
    {
        " Trollhätte kanal": "Trollhatte Canal"
    },
    {
        " to ": null
    },
    {
        "Gothenburg": "Gothenburg"
    }
]