[
    {
        "      Wessel Johannes  Hansie  Cronje was a South African international ": null
    },
    {
        "cricket": "Cricket"
    },
    {
        "er and captain of the South African national cricket team in the 1990s. He was voted the ": null
    },
    {
        "11th greatest South African": "Sabc3S Great South Africans"
    },
    {
        " in 2004 despite having been banned from cricket for life due to his role in a ": null
    },
    {
        "match-fixing scandal": "South Africa Cricket Match Fixing"
    },
    {
        ". He died in a plane crash in 2002.     Cronje led South Africa to a record 23 wins in his 53 test matches, with just 11 losses. Under his captaincy they had won 99 ODIs. He along with coach Bob Woolmer were a deadly pair, which brought many wins to the nation.       Cronje was born in ": null
    },
    {
        "Bloemfontein": "Bloemfontein"
    },
    {
        ", South Africa to Ewie Cronje and San-Marie Cronje on 25 September 1969. He graduated in 1987 from Grey College in Bloemfontein, where he was the head boy. An excellent all round sportsman, he represented the then ": null
    },
    {
        "Orange Free State Province": "Orange Free State Province"
    },
    {
        " in ": null
    },
    {
        "cricket": "Cricket"
    },
    {
        " and ": null
    },
    {
        "rugby": "Rugby Union"
    },
    {
        " at schools level. He was the ": null
    },
    {
        "captain": "Captain"
    },
    {
        " of his schools cricket and rugby teams. Cronje earned a Bachelor of Commerce degree from the ": null
    },
    {
        "University of the Free State": "University Of The Free State"
    },
    {
        ". He had an older brother, ": null
    },
    {
        "Frans Cronje": "Frans Cronje"
    },
    {
        ", and a younger sister, Hester Parsons.     His father Ewie had played for ": null
    },
    {
        "Orange Free State": "Orange Free State Cricket Team"
    },
    {
        " in the 1960s, and Frans had also played ": null
    },
    {
        "first-class cricket": "First-Class Cricket"
    },
    {
        ".         Cronje made his first-class debut for Orange Free State against ": null
    },
    {
        "Transvaal": "Transvaal Cricket Team"
    },
    {
        " at ": null
    },
    {
        "Johannesburg": "Johannesburg"
    },
    {
        " in January 1988 at the age of 18. In the following season, he was a regular, appearing in all eight ": null
    },
    {
        "Currie Cup": "Supersport Series"
    },
    {
        " matches plus being part of the Benson and Hedges Series winning team, scoring 73 as an opener in the final. In 1989–90, despite playing all the Currie Cup matches, he failed to make a century, and averaged only 19.76; however, in one-day games he averaged 60.12. During that season he scored his maiden century for ": null
    },
    {
        "South African Universities": "South African Universities Cricket Team"
    },
    {
        " against ": null
    },
    {
        "Mike Gattings": "Mike Gatting"
    },
    {
        "rebels": "South African Rebel Toursengland Rebel Tour 1990"
    },
    {
        ".      Despite having just turned 21, Cronje was made captain of Orange Free State for the 1990–91 season. He scored his maiden century for them against ": null
    },
    {
        "Natal": "Natal Cricket Team"
    },
    {
        " in December 1990, and finished the season with another century and a total of 715 runs at 39.72. That season he also scored 159 in a 40-over match against ": null
    },
    {
        "Griqualand West": "Griqualand West Cricket Team"
    },
    {
        ".     In 1992–93, he captained Orange Free State to the Castle Cup/Total Power Series double.     In 1995, Cronje appeared for ": null
    },
    {
        "Leicestershire": "Leicestershire County Cricket Club"
    },
    {
        " where he scored 1301 runs at 52.04 finishing the season as the countys leading scorer.     In 1995–96, he finished the season top of the batting averages in the Currie Cup,  his top score of 158 helped Free State chase down 389 to beat Northern Transvaal.      In 1997, Cronje played for ": null
    },
    {
        "Ireland": "Ireland National Cricket Team"
    },
    {
        " as an overseas player in the ": null
    },
    {
        "Benson and Hedges Cup": "Benson And Hedges Cup"
    },
    {
        " and helped them to a 46-run win over ": null
    },
    {
        "Middlesex": "Middlesex County Cricket Club"
    },
    {
        " by scoring 94 not out and taking three wickets.  This was Irelands first ever win against English county opposition.  Later in the same competition, he scored 85 and took one wicket against ": null
    },
    {
        "Glamorgan": "Glamorgan County Cricket Club"
    },
    {
        ".            Cronjes form in 1991/92 was impressive especially in the one-day format where he averaged 61.40. He earned an international call up for the ": null
    },
    {
        "1992 World Cup": "1992 Cricket World Cup"
    },
    {
        ", making his ": null
    },
    {
        "One Day International": "One Day International"
    },
    {
        " debut against ": null
    },
    {
        "Australia": "Australia National Cricket Team"
    },
    {
        " at ": null
    },
    {
        "Sydney": "Sydney"
    },
    {
        ". During the tournament he played in eight of the teams nine games, averaging 34.00 with the bat, while his medium pace was used in bowling 20 overs.     After the World Cup Cronje was part of the tour to the West Indies; he featured in the three ODIs, and in the Test match at ": null
    },
    {
        "Bridgetown": "Bridgetown"
    },
    {
        " that followed, he made his ": null
    },
    {
        "Test": "Test Cricket"
    },
    {
        " debut. This was South Africas first Test since readmission and they came close to beating a strong ": null
    },
    {
        "West Indian": "West Indies National Cricket Team"
    },
    {
        " side, going into the final day at 122/2 chasing 200 they collapsed to 148.     ": null
    },
    {
        "India": "India National Cricket Team"
    },
    {
        " toured South Africa in 1992/93. In the first one-day international, he hit the famous six when his team needed 6 runs off only 4 balls, and was awarded Man of the match for his bowling. In the one-day series, Cronje managed just one fifty but with the ball he was economical and took his career best figures of 5/32, becoming the second South African to take five wickets in an ODI.  In the Test series that followed he scored his maiden test century, 135 off 411 balls, after coming in at 0–1 in the second over he was last man out, after eight and three-quarter hours, in a total of 275. This contributed to South Africas first Test win since readmission. At the end of the season in a triangular tournament with ": null
    },
    {
        "Pakistan": "Pakistan National Cricket Team"
    },
    {
        " and West Indies he scored 81 off 70 balls against Pakistan.     In South Africas next Test series against ": null
    },
    {
        "Sri Lanka": "Sri Lanka National Cricket Team"
    },
    {
        ", Cronje scored his second Test century, 122 in the second Test in ": null
    },
    {
        "Colombo": "Colombo"
    },
    {
        "; the victory margin of an innings and 208 runs is a South African record. He finished the series with 237 runs at 59.25 after scoring 73 in the drawn third Test.         In 1993–94, there was another Castle Cup/Total Power Series double for Orange Free State. In international cricket, he was named as vice-captain for the tour of Australia despite being the youngest member of the squad. In the first ODI of the triangular tournament with ": null
    },
    {
        "New Zealand": "New Zealand National Cricket Team"
    },
    {
        " and ": null
    },
    {
        "Australia": "Australia National Cricket Team"
    },
    {
        ", he guided South Africa to victory against Australia at the MCG with 91, which won him the man of the match award. He scored 71 in a rain-affected first test at ": null
    },
    {
        "Melbourne": "Melbourne"
    },
    {
        " before a tense second test that South Africa won by 5 runs. An injury to captain ": null
    },
    {
        "Kepler Wessels": "Kepler Wessels"
    },
    {
        " meant Cronje was captain for the final day of the match. Between the second and third tests, the one-day tournament continued, now with Cronje as captain, South Africa made the final series but lost it 2–1 to Australia. He became South Africas second youngest Test captain, after ": null
    },
    {
        "Murray Bisset": "Murray Bisset"
    },
    {
        " in 1898–99, when he led the team for the third test at ": null
    },
    {
        "Adelaide": "Adelaide"
    },
    {
        " but it was an unsuccessful start to his captaincy career as the series was squared.     In February 1994, there was the return series as Australia toured South Africa. Cronje started the ODI series with scores of 112, 97, 45 and 50 and when Australia played Orange Free State in their final match before the first Test, Cronje hit 251 off 306 balls, 200 of these came on the final day in which 294 runs were added. Despite this, Orange Free State lost the match. In the first test at Johannesburg, he added another century as South Africa won by 197 runs. This innings was the end of a 14-day period in which hed scored 721 runs against the Aussies. However, he failed to reach fifty in the next two tests and four ODIs as both series were drawn.     There was another drawn series when South Africa toured England in 1994. Cronje scored only one century on the whole tour and scored only 90 runs in the three-test series. In October 1994, South Africa again came up against Australia in a triangular one day series also featuring ": null
    },
    {
        "Pakistan": "Pakistan National Cricket Team"
    },
    {
        ". Cronje scored 354 runs at an average of 88.50. Despite this, South Africa lost all their matches.  This series was ": null
    },
    {
        "Bob Woolmers": "Bob Woolmer"
    },
    {
        " first as coach and Kepler Wessels last as captain. Cronje, whod previously been vice-captain, was named as captain for the test series with New Zealand in 1994–95.         South Africa lost the first Test in Johannesburg but before the second test the two teams plus Pakistan and Sri Lanka competed for the ": null
    },
    {
        "Mandela Trophy": "Mandela Trophy"
    },
    {
        ", New Zealand failed to gain a win in the six match round robin stage while South Africa beat Pakistan in the final. This changed the momentum as South Africa secured wins in ": null
    },
    {
        "Durban": "Durban"
    },
    {
        " and ": null
    },
    {
        "Cape Town": "Cape Town"
    },
    {
        ", where Cronje scored his fourth test century, he was the first captain since ": null
    },
    {
        "W. G. Grace": "W. G. Grace"
    },
    {
        " to win a three-match rubber after being one down.     In early 1995, South Africa won one-off tests against both Pakistan and New Zealand, in ": null
    },
    {
        "Auckland": "Auckland"
    },
    {
        " Cronje scored the only century of the match before a final day declaration left his bowlers barely enough time to dismiss the Kiwis.     In October 1995, South Africa won a one-off Test with ": null
    },
    {
        "Zimbabwe": "Zimbabwe National Cricket Team"
    },
    {
        ". Cronje scored a second innings 54 to guide them to a seven wicket win. In two one-dayers that followed, he took five wickets as South Africa comfortably won both. South Africa won the five Test series against England 1–0 despite Cronje struggling, scoring 113 runs at 18.83. However, he top scored in the one-day series that they won 6–1.     In the ": null
    },
    {
        "1996 World Cup": "1996 Cricket World Cup"
    },
    {
        ", he scored 78 and 45 against New Zealand and Pakistan respectively as South Africa won their group but in the Quarter final with West Indies a ": null
    },
    {
        "Brian Lara": "Brian Lara"
    },
    {
        " century ended their ten-game winning streak.     The 1996–97 season featured back-to-back series with India. The first away was lost 2–1. The home series was won 2–0. In the six tests combined, Cronje managed one fifty. Cronje produced better form against Australia, averaging over 50 in both test and ODI series although both were lost.     Cronje started 1997–98 by leading South Africa to their first series victory in Pakistan, his batting continued to struggle with his biggest contribution being taking the wickets of ": null
    },
    {
        "Inzamam-ul-Haq": "Inzamam-Ul-Haq"
    },
    {
        " and ": null
    },
    {
        "Moin Khan": "Moin Khan"
    },
    {
        " in the Third Test.        Cronje once again came up against Australia and once again ended on the losing side. In the triangular one day series they won the group with Australia just scraping through, they also won the first final but South Africa lost the last two finals. During the group matches Cronje had threatened to lead his team off after ": null
    },
    {
        "Pat Symcox": "Pat Symcox"
    },
    {
        " had missiles thrown at him, Symcox had the last laugh ending the match with 4/24. Before the Test series started he scored consecutive centuries against ": null
    },
    {
        "Tasmania": "Tasmania Cricket Team"
    },
    {
        " and ": null
    },
    {
        "Australia A": "Australia A Cricket Team"
    },
    {
        " these were his first in two years.     In the first Test, Cronje scored 70 as South Africa saved the match; in the second Test, he lasted 335 minutes for his 88. Despite this, they lost by an innings. In the third Test, they scored 517 and although ": null
    },
    {
        "Mark Taylor": "Mark Taylor"
    },
    {
        " carried his bat for 169, Australia needed to bat 109 overs to save the match. ": null
    },
    {
        "Mark Waugh": "Mark Waugh"
    },
    {
        " batted 404 minutes, and, despite controversy when Waugh hit one of his bails off , South Africa fell three wickets short. Cronje put a stump through the umpires dressing room door after the match and was lucky to avoid a ban.      Cronje missed the first Test of the series with Pakistan because of a knee injury. The second Test at Durban was lost, but he top scored at ": null
    },
    {
        "Port Elizabeth": "Port Elizabeth"
    },
    {
        " with 85, to help square the three Test series 1–1. There was still time in the season for a two-Test series with Sri Lanka. The first was won with Cronje scoring 49 and 74; in the second Test, he took 3/14, his best bowling in Tests, and smashed 82 off 63 balls, his fifty being brought up with three consecutive sixes off ": null
    },
    {
        "Muttiah Muralitharan": "Muttiah Muralitharan"
    },
    {
        ", and was reached off just 31 balls; at the time, it was the second fastest in Tests after ": null
    },
    {
        "Kapil Devs": "Kapil Dev"
    },
    {
        ".  In the triangular series, which South Africa won, he scored only one fifty at ": null
    },
    {
        "East London": "East London, South Africa"
    },
    {
        " where he also took 2/17 off 10 overs.      During the 1998 Test series against England, Cronje scored five consecutive fifties, having failed to score one in the nine previous Tests against them. In his fiftieth Test, at ": null
    },
    {
        "Trent Bridge": "Trent Bridge"
    },
    {
        " he scored 126, his sixth and last Test century and his first in 29 matches. During his second innings of 67, he passed 3,000 runs – only the second South African to do so.  However, England won the Test, and the one at ": null
    },
    {
        "Headingley": "Headingley Carnegie Cricket Ground"
    },
    {
        ", to win the series 2–1, Cronje finished the series as South Africas top scorer with 401 runs at 66.83.         In the West Indies series of 1998–99, Cronje captained South Africa to their only whitewash in a five Test series.  His best batting against West Indies came when playing for Free State; he scored 158 as they chased down 438 and made up a first innings deficit of 249.  In the ODI series he was South Africas top scorer and took 11 wickets at 14.72 as South Africa won 6–1.     In March 1999, they toured New Zealand, beating them 1–0 in the Test series and 3–2 in the one-dayers.     At the ": null
    },
    {
        "1999 World Cup": "1999 Cricket World Cup"
    },
    {
        ", Cronje finished with 98 runs at 12.25 as South Africa were eliminated after the famous tied semi-final against Australia at ": null
    },
    {
        "Edgbaston": "Edgbaston Cricket Ground"
    },
    {
        ". In the first match of the tournament versus India, Cronje came onto the field with an earpiece wired to coach ": null
    },
    {
        "Bob Woolmer": "Bob Woolmer"
    },
    {
        ", but at the first drinks break match referee ": null
    },
    {
        "Talat Ali": "Talat Ali"
    },
    {
        " ordered him to remove it.      In October 1999, Cronje became South Africas highest Test run scorer during the first Test against Zimbabwe.  The two Test series was won 2–0 thanks to innings victories. South Africa won the series with England in the fourth Test at Cape Town, Cronjes fiftieth as captain.     The fifth test of the 1999–2000 South Africa versus England series at ": null
    },
    {
        "Centurion": "Centurion, Gauteng"
    },
    {
        " was ruined by rain, entering the final day only 45 overs had been possible with South Africa 155/6. On the final morning as they batted on, news filtered through that the captains had met and were going to make a game of it . A target of 250 from 70 overs was agreed. When South Africa reached 248/8, Cronje declared; both teams then forfeited an innings leaving England a target of 249 to win the Test, which they did with two wickets left and only five balls remaining. It ended South Africas 14-game unbeaten streak in Test cricket. It was later learnt Cronje accepted money and a gift from a bookmaker in return for making an early declaration in this Test. .     Cronje top scored with 56 after South Africa were left reeling at 21–5 in the Final of the triangular tournament which featured England and Zimbabwe.      On 31 March 2000, his cricket career finished with a 73-ball 79 against Pakistan in the final of Sharjah Cup 1999/2000.          Under Cronjes captaincy, South Africa won 27 Tests and lost 11, completing series victories against every team except Australia.      He captained the One Day International team to 99 wins out of 138 matches with one tied match and three ": null
    },
    {
        "no results": "No Result"
    },
    {
        ". He holds the South African record for matches won as captain, and his record of captaining his side in 138 matches stands bettered only by ": null
    },
    {
        "Graeme Smiths": "Graeme Smith"
    },
    {
        " 149 matches as ODI captain.  His 99 wins as captain makes him the fourth most successful captain worldwide in terms of matches won, behind ": null
    },
    {
        "Ricky Ponting": "Ricky Ponting"
    },
    {
        ", ": null
    },
    {
        "Allan Border": "Allan Border"
    },
    {
        " and ": null
    },
    {
        "Mahendra Singh Dhoni": "Mahendra Singh Dhoni"
    },
    {
        " and in terms of percentage of wins , behind Ponting and ": null
    },
    {
        "Clive Lloyd": "Clive Lloyd"
    },
    {
        ".      Between September 1993 and March 2000, he played in 162 consecutive ODIs, a South African record.      Cronje has the record for playing the most consecutive ODI matches as captain and is the only player to play in 100+ consecutive ODI matches as captain.           On 7 April 2000, it was revealed there was a conversation between Cronje and Sanjay Chawla, a representative of an Indian betting syndicate, over match-fixing allegations. Three other players, ": null
    },
    {
        "Herschelle Gibbs": "Herschelle Gibbs"
    },
    {
        ", ": null
    },
    {
        "Nicky Boje": "Nicky Boje"
    },
    {
        ", and ": null
    },
    {
        "Pieter Strydom": "Pieter Strydom"
    },
    {
        ", were also implicated. After an enquiry by the ": null
    },
    {
        "King Commission": "King Commission"
    },
    {
        ", Cronje was banned from any involvement in cricket for life.  He challenged his life ban in September 2001 but on 17 October 2001, his application was dismissed.      After 13 years, on 22 July 2013, the Indian Police registered a ": null
    },
    {
        "First Information Report": "First Information Report"
    },
    {
        " for match-fixing in 2000; the charge sheet in the case involving a few South African cricketers including its former captain Hansie Cronje, was finally filed. The scandal was one of the biggest ever to have hit international cricket until the ": null
    },
    {
        "Pakistan cricket spot-fixing scandal": "Pakistan Cricket Spot-Fixing Scandal"
    },
    {
        ".         On 1 June 2002, Cronjes scheduled flight home from Johannesburg to ": null
    },
    {
        "George": "George, Western Cape"
    },
    {
        " was grounded. He then hitched a ride as the only passenger aboard a ": null
    },
    {
        "Hawker Siddeley HS 748": "Hawker Siddeley Hs 748"
    },
    {
        " turboprop": "Turboprop"
    },
    {
        " aircraft. Near George airport, the pilots lost visibility in clouds and were unable to land, partly due to unusable navigational equipment. While circling, the plane crashed into the ": null
    },
    {
        "Outeniqua Mountains": "Outeniqua Mountains"
    },
    {
        " northeast of the airport. Cronje, aged 32, and the two pilots were killed instantly.      In August 2006, an inquest into the plane crash was opened by South Africas High Court.  The inquest concluded that the death of the deceased Wessel Johannes Cronje was brought about by an act or omission ": null
    },
    {
        "prima facie": "Prima Facie"
    },
    {
        " amounting to an offence on the part of pilots.      Theories that Cronje was murdered on the orders of a cricket betting syndicate flourished after his death and were most recently re-floated by former ": null
    },
    {
        "Nottinghamshire": "Nottinghamshire"
    },
    {
        " coach ": null
    },
    {
        "Clive Rice": "Clive Rice"
    },
    {
        " in the wake of the death of Pakistan coach ": null
    },
    {
        "Bob Woolmer": "Bob Woolmer"
    },
    {
        " in March 2007. It was alleged that he was murdered to hide the truths behind match-fixing. ": null
    }
]