[
    {
        "           Harmonic analysis is a branch of ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " concerned with the representation of ": null
    },
    {
        "functions": "Function"
    },
    {
        " or signals as the ": null
    },
    {
        "superposition": "Superposition Principle"
    },
    {
        " of basic ": null
    },
    {
        "waves": "Wave"
    },
    {
        ", and the study of and generalization of the notions of ": null
    },
    {
        "Fourier series": "Fourier Series"
    },
    {
        " and ": null
    },
    {
        "Fourier transforms": "Fourier Transform"
    },
    {
        " . In the past two centuries, it has become a vast subject with applications in areas as diverse as ": null
    },
    {
        "number theory": "Number Theory"
    },
    {
        ", ": null
    },
    {
        "representation theory": "Representation Theory"
    },
    {
        ", ": null
    },
    {
        "signal processing": "Signal Processing"
    },
    {
        ", ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ", ": null
    },
    {
        "tidal analysis": "Tidal Analysis"
    },
    {
        " and ": null
    },
    {
        "neuroscience": "Neuroscience"
    },
    {
        ".     The term ": null
    },
    {
        "harmonics": "Harmonic"
    },
    {
        " originated as the ": null
    },
    {
        "Ancient Greek": "Ancient Greek"
    },
    {
        " word harmonikos, meaning skilled in music . .  Online Etymology Dictionary . In physical ": null
    },
    {
        "eigenvalue": "Eigenvalue"
    },
    {
        " problems, it began to mean waves whose frequencies are ": null
    },
    {
        "integer multiples": "Multiple"
    },
    {
        " of one another, as are the frequencies of the ": null
    },
    {
        "harmonics of music notes": "Harmonic Series"
    },
    {
        ", but the term has been generalized beyond its original meaning.     The classical Fourier transform on R n is still an area of ongoing research, particularly concerning Fourier transformation on more general objects such as ": null
    },
    {
        "tempered distributions": "Distribution Tempered Distributions And Fourier Transform"
    },
    {
        ". For instance, if we impose some requirements on a distribution f, we can attempt to translate these requirements in terms of the Fourier transform of f. The ": null
    },
    {
        "Paley–Wiener theorem": "Paley–Wiener Theorem"
    },
    {
        " is an example of this. The Paley–Wiener theorem immediately implies that if f is a nonzero ": null
    },
    {
        "distribution": "Distribution"
    },
    {
        " of ": null
    },
    {
        "compact support": "Compact Support"
    },
    {
        " , then its Fourier transform is never compactly supported. This is a very elementary form of an ": null
    },
    {
        "uncertainty principle": "Uncertainty Principle"
    },
    {
        " in a harmonic-analysis setting.     Fourier series can be conveniently studied in the context of ": null
    },
    {
        "Hilbert spaces": "Hilbert Space"
    },
    {
        ", which provides a connection between harmonic analysis and ": null
    },
    {
        "functional analysis": "Functional Analysis"
    },
    {
        ".                 Many applications of harmonic analysis in science and engineering begin with the idea or hypothesis that a phenomenon or signal is composed of a sum of individual oscillatory components. Ocean ": null
    },
    {
        "tides": "Tide"
    },
    {
        " and vibrating ": null
    },
    {
        "strings": "String"
    },
    {
        " are common and simple examples. The theoretical approach is often to try to describe the system by a ": null
    },
    {
        "differential equation": "Differential Equation"
    },
    {
        " or ": null
    },
    {
        "system of equations": "System Of Equations"
    },
    {
        " to predict the essential features, including the amplitude, frequency, and phases of the oscillatory components. The specific equations depend on the field, but theories generally try to select equations that represent major principles that are applicable.     The experimental approach is usually to ": null
    },
    {
        "acquire data": "Data Collection"
    },
    {
        " that accurately quantifies the phenomenon. For example, in a study of tides, the experimentalist would acquire samples of water depth as a function of time at closely enough spaced intervals to see each oscillation and over a long enough duration that multiple oscillatory periods are likely included. In a study on vibrating strings, it is common for the experimentalist to acquire a sound waveform sampled at a rate at least twice that of the highest frequency expected and for a duration many times the period of the lowest frequency expected.     For example, the top signal at the right is a sound waveform of a bass guitar playing an open string corresponding to an A note with a fundamental frequency of 55  Hz. The waveform appears oscillatory, but it is more complex than a simple sine wave, indicating the presence of additional waves. The different wave components contributing to the sound can be revealed by applying a mathematical analysis technique known as the ": null
    },
    {
        "Fourier transform": "Fourier Transform"
    },
    {
        ", the result of which is shown in the lower figure. Note that there is a prominent peak at 55  Hz, but that there are other peaks at 110  Hz, 165  Hz, and at other frequencies corresponding to integer multiples of 55  Hz. In this case, 55  Hz is identified as the fundamental frequency of the string vibration, and the integer multiples are known as ": null
    },
    {
        "harmonics": "Harmonic"
    },
    {
        ".       One of the most modern branches of harmonic analysis, having its roots in the mid-20th century, is ": null
    },
    {
        "analysis": "Mathematical Analysis"
    },
    {
        " on ": null
    },
    {
        "topological groups": "Topological Group"
    },
    {
        ". The core motivating ideas are the various ": null
    },
    {
        "Fourier transforms": "Fourier Transform"
    },
    {
        ", which can be generalized to a transform of ": null
    },
    {
        "functions": "Function"
    },
    {
        " defined on Hausdorff ": null
    },
    {
        "locally compact topological groups": "Locally Compact Group"
    },
    {
        ".     The theory for ": null
    },
    {
        "abelian": "Abelian Group"
    },
    {
        "locally compact groups": "Locally Compact Group"
    },
    {
        " is called ": null
    },
    {
        "Pontryagin duality": "Pontryagin Duality"
    },
    {
        ".     Harmonic analysis studies the properties of that duality and Fourier transform and attempts to extend those features to different settings, for instance, to the case of non-abelian ": null
    },
    {
        "Lie groups": "Lie Group"
    },
    {
        ".     For general non-abelian locally compact groups, harmonic analysis is closely related to the theory of unitary group representations. For compact groups, the ": null
    },
    {
        "Peter–Weyl theorem": "Peter–Weyl Theorem"
    },
    {
        " explains how one may get harmonics by choosing one irreducible representation out of each equivalence class of representations. This choice of harmonics enjoys some of the useful properties of the classical Fourier transform in terms of carrying convolutions to pointwise products, or otherwise showing a certain understanding of the underlying ": null
    },
    {
        "group": "Group"
    },
    {
        " structure. See also: ": null
    },
    {
        "Non-commutative harmonic analysis": "Non-Commutative Harmonic Analysis"
    },
    {
        ".     If the group is neither abelian nor compact, no general satisfactory theory is currently known . However, many specific cases have been analyzed, for example ": null
    },
    {
        "SL n ": "Special Linear Group"
    },
    {
        ". In this case, ": null
    },
    {
        "representations": "Group Representation"
    },
    {
        " in infinite ": null
    },
    {
        "dimensions": "Dimension"
    },
    {
        " play a crucial role.       Study of the ": null
    },
    {
        "eigenvalues": "Eigenvalue"
    },
    {
        " and ": null
    },
    {
        "eigenvectors": "Eigenvector"
    },
    {
        " of the ": null
    },
    {
        "Laplacian": "Laplacian"
    },
    {
        " on ": null
    },
    {
        "domains": "Domain"
    },
    {
        ", ": null
    },
    {
        "manifolds": "Manifold"
    },
    {
        ", and ": null
    },
    {
        "graphs": "Graph"
    },
    {
        " is also considered a branch of harmonic analysis. See e.g., ": null
    },
    {
        "hearing the shape of a drum": "Hearing The Shape Of A Drum"
    },
    {
        ".    Harmonic analysis on Euclidean spaces deals with properties of the ": null
    },
    {
        "Fourier transform": "Fourier Transform"
    },
    {
        " on R n that have no analog on general groups. For example, the fact that the Fourier transform is rotation-invariant. Decomposing the Fourier transform into its radial and spherical components leads to topics such as ": null
    },
    {
        "Bessel functions": "Bessel Function"
    },
    {
        " and ": null
    },
    {
        "spherical harmonics": "Spherical Harmonic"
    },
    {
        ".   Harmonic analysis on tube domains is concerned with generalizing properties of ": null
    },
    {
        "Hardy space": "Hardy Space"
    }
]