[
    {
        "   Hasidism, sometimes Hasidic Judaism , is a ": null
    },
    {
        "Jewish": "Judaism"
    },
    {
        " religious group. It arose as a spiritual revival movement in the territory of contemporary ": null
    },
    {
        "Western Ukraine": "Western Ukraine"
    },
    {
        " during the ": null
    },
    {
        "18th century": "18Th Century"
    },
    {
        ", and spread rapidly throughout ": null
    },
    {
        "Eastern Europe": "Eastern Europe"
    },
    {
        ". Today, most affiliates reside in ": null
    },
    {
        "Israel": "Israel"
    },
    {
        " and the ": null
    },
    {
        "United States": "United States"
    },
    {
        ".     Israel Ben Eliezer, the ": null
    },
    {
        "Baal Shem Tov": "Baal Shem Tov"
    },
    {
        " , is regarded as its founding father, and his disciples developed and disseminated it. Present-day Hasidism is a sub-group within ": null
    },
    {
        "Ultra-Orthodox Judaism": "Haredi Judaism"
    },
    {
        ", and is noted for its religious conservatism and social seclusion. Its members adhere closely both to ": null
    },
    {
        "Orthodox Jewish practice": "Orthodox Judaism"
    },
    {
        " – with the movements own unique emphases – and the traditions of Eastern European Jews, so much so that many of the latter, including various special styles of dress and the use of the ": null
    },
    {
        "Yiddish language": "Yiddish Language"
    },
    {
        ", are nowadays associated almost exclusively with Hasidism.     Hasidic thought draws heavily on ": null
    },
    {
        "Lurianic Kabbalah": "Lurianic Kabbalah"
    },
    {
        ", and, to an extent, is a popularization of it. Teachings emphasize Gods ": null
    },
    {
        "immanence": "Immanence"
    },
    {
        " in the universe, the need to cleave and be one with him at all times, the devotional aspect of religious practice, and the spiritual dimension of corporeality and mundane acts. Hasidim, the adherents of Hasidism, are organized in ": null
    },
    {
        "independent sects known as courts or dynasties": "Hasidic Dynasty"
    },
    {
        ", each headed by its own hereditary leader, a  Rebbe . Reverence and submission to the Rebbe are key tenets, as he is considered a spiritual authority with whom the follower must bond to gain closeness to God. The various courts share basic convictions, but operate apart, and possess unique traits and customs. Affiliation is often retained in families for generations, and being Hasidic is as much a sociological factor – entailing, as it does, birth into a specific community and allegiance to a dynasty of Rebbes – as it is a purely religious one. There are several courts with many thousands of member households each, and hundreds of smaller ones. As of 2016, there were over 130,000 Hasidic households worldwide, about 5% of the global Jewish population.       The ": null
    },
    {
        "terms hasid": "Hasid"
    },
    {
        " and hasidut, meaning pietist and piety , have a long history in Judaism. The ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        " and other old sources refer to the Pietists of Old  who would contemplate an entire hour in preparation for prayer. The phrase denoted extremely devoted individuals who not only observed the Law to its letter, but performed good deeds even beyond it. ": null
    },
    {
        "Adam": "Adam"
    },
    {
        " himself is honored with the title in ": null
    },
    {
        "tractate Eruvin": "Eruvin"
    },
    {
        " 18b by ": null
    },
    {
        "Rabbi Meir": "Rabbi Meir"
    },
    {
        "hasid, having fasted for 130 years. The first to adopt the epithet collectively were apparently the hasidim in ": null
    },
    {
        "Second Temple period": "Second Temple Period"
    },
    {
        " Judea": "Judea"
    },
    {
        ", known as ": null
    },
    {
        "Hasideans": "Hasideans"
    },
    {
        " after the Greek rendering of their name, who perhaps served as the model for those mentioned in the Talmud. The title continued to be applied as an honorific for the exceptionally devout. In 12th-century ": null
    },
    {
        "Rhineland": "Rhineland"
    },
    {
        ", or  Ashkenaz  in Jewish parlance, another prominent school of ascetics named themselves hasidim; to distinguish them from the rest, later research employed the term ": null
    },
    {
        "Ashkenazi Hasidim": "Ashkenazi Hasidim"
    },
    {
        ". In the 16th century, when ": null
    },
    {
        "Kabbalah": "Kabbalah"
    },
    {
        " spread, the title also became associated with it. ": null
    },
    {
        "Jacob ben Hayyim Zemah": "Jacob Ben Hayyim Zemah"
    },
    {
        " wrote in his glossa on ": null
    },
    {
        "Isaac Lurias": "Isaac Luria"
    },
    {
        "version of the ": null
    },
    {
        "Shulchan Aruch": "Shulchan Aruch"
    },
    {
        " that, One who wishes to tap the hidden wisdom, must conduct himself in the manner of the Pious.     The movement founded by ": null
    },
    {
        "Israel Ben Eliezer": "Israel Ben Eliezer"
    },
    {
        " in the 18th century adopted the term hasidim in the original connotation. But when the sect grew and developed specific attributes, from the 1770s, the names gradually acquired a new meaning. Its common adherents, belonging to groups each headed by a spiritual leader, were henceforth known as Hasidim. The transformation was slow: The movement was at first referred to as New Hasidism by outsiders  to separate it from the old one, and its enemies derisively mocked its members as Mithasdim, pretend hasidim . Yet, eventually, the young sect gained such a mass following that the old connotation was sidelined. In popular discourse, at least, Hasid came to denote someone who follows a religious teacher from the movement. It also entered ": null
    },
    {
        "Modern Hebrew": "Modern Hebrew"
    },
    {
        " as such, meaning adherent or disciple . One was not merely a hasid anymore, observed historian David Assaf, but a Hasid of someone or some dynasty in particular. This linguistic transformation paralleled that of the word  tzaddik , righteous , which the Hasidic leaders adopted for themselves – though they are known colloquially as Rebbes or by the honorific Admor. Originally denoting an observant, moral person, in Hasidic literature tzaddik became synonymous with the often hereditary master heading a sect of followers.                 The lengthy history of Hasidism, the numerous schools of thought therein, and particularly its use of the traditional medium of ": null
    },
    {
        "homiletic": "Homiletic"
    },
    {
        " literature and sermons – comprising numerous references to earlier sources in the Pentateuch, Talmud and exegesis as a means to grounding oneself in tradition – as the almost sole channel to convey its ideas, all made the isolation of a common doctrine highly challenging to researchers. As noted by ": null
    },
    {
        "Joseph Dan": "Joseph Dan"
    },
    {
        ", Every attempt to present such a body of ideas has failed . Even motifs presented by scholars in the past as unique Hasidic contributions were later revealed to have been common among both their predecessors and opponents, all the more so regarding many other traits that are widely extant – these play, Dan added, a prominent role in modern non-Hasidic and anti-Hasidic writings as well . Joseph Dan, https://yivoencyclopedia.org/article.aspx/Hasidism/TeachingsandLiterature Hasidism: Teachings and Literature, ": null
    },
    {
        "The YIVO Encyclopedia of Jews in Eastern Europe": "The Yivo Encyclopedia Of Jews In Eastern Europe"
    },
    {
        " The difficulty of separating the movements philosophy from that of its main inspiration, Lurianic Kabbalah, and determining what was novel and what merely a recapitulation, also baffled historians. Some, like ": null
    },
    {
        "Louis Jacobs": "Louis Jacobs"
    },
    {
        ", regarded the early masters as innovators who introduced much that was new if only by emphasis ; Louis Jacobs, Basic Ideas of Hasidism, in: Hasidism, ": null
    },
    {
        "Encyclopedia Judaica": "Encyclopedia Judaica"
    },
    {
        ", 2007. Volume 8, p. 408. others, primarily ": null
    },
    {
        "Mendel Piekarz": "Mendel Piekarz"
    },
    {
        ", argued to the contrary that but a little was not found in much earlier tracts, and the movements originality lay in the manner it popularized these teachings to become the ideology of a well-organized sect. Mendel Piekarz, Ben ideʼologyah li-metsiʼut, ": null
    },
    {
        "Bialik Institute": "Bialik Institute"
    },
    {
        " , . pp. 151-152; Dynner, Men of Silk, p. 27.     Among the traits particularly associated with Hasidism in common understanding which are in fact widespread, is the importance of joy and happiness at worship and religious life – though the sect undoubtedly stressed this aspect and still possesses a clear populist bent. Another example is the value placed on the simple, ordinary Jew in supposed contradiction with the favouring of elitist scholars beforehand; such ideas are common in ethical works far preceding Hasidism. The movement did for a few decades challenge the rabbinic establishment, which relied on the authority of ": null
    },
    {
        "Torah": "Torah"
    },
    {
        " acumen, but affirmed the centrality of study very soon. Concurrently, the image of its ": null
    },
    {
        "Opponents": "Misnagdim"
    },
    {
        " as dreary intellectuals who lacked spiritual fervour and opposed mysticism is likewise unfounded. Neither did Hasidism, often portrayed as promoting healthy sensuality, unanimously reject the asceticism and self-mortification associated primarily with its rivals. Joseph Dan ascribed all these perceptions to so-called ": null
    },
    {
        "Neo-Hasidic": "Neo-Hasidic"
    },
    {
        " writers and thinkers, like ": null
    },
    {
        "Martin Buber": "Martin Buber"
    },
    {
        ". In their attempt to build new models of spirituality for modern Jews, they propagated a romantic, sentimental image of the movement. The Neo-Hasidic interpretation influenced even scholarly discourse to a great degree, but had a tenuous connection with reality.     A further complication is the divide between what researchers term early Hasidism , which ended roughly in the 1810s, and established Hasidism since then onwards. While the former was a highly dynamic religious revival movement, the latter phase is characterized by consolidation into sects with hereditary leadership. The mystical teachings formulated during the first era were by no means repudiated, and many Hasidic masters remained consummate spiritualists and original thinkers; as noted by ": null
    },
    {
        "Benjamin Brown": "Benjamin Brown"
    },
    {
        ", Bubers once commonly accepted view that the routinization constituted decadence was refuted by later studies, demonstrating that the movement remained very much innovative. See, for example, Benjamin Brown, . pp. 455-456. Yet many aspects of early Hasidism were indeed de-emphasized in favour of more conventional religious expressions, and its radical concepts were largely neutralized. Some Rebbes adopted a relatively rationalist bent, sidelining their explicit mystical, ": null
    },
    {
        "theurgical": "Theurgical"
    },
    {
        " roles, and many others functioned almost solely as political leaders of large communities. As to their Hasidim, affiliation was less a matter of admiring a charismatic leader as in the early days, but rather birth into a family belonging to a specific court . Assaf, Regal Way, pp. 49-55, 63-67; Dynner, Men of Silk, pp. 117-121.       The most fundamental theme underlying all Hasidic theory is the ": null
    },
    {
        "immanence": "Immanence"
    },
    {
        " of God in the universe, often expressed in a phrase from ": null
    },
    {
        "Tikunei haZohar": "Tikunei Hazohar"
    },
    {
        ", Leit Atar panuy mi-néya . This ": null
    },
    {
        "panentheistic": "Panentheistic"
    },
    {
        " concept was derived from Lurianic discourse, but greatly expanded in the Hasidic one. In the beginning, in order to ": null
    },
    {
        "create the world": "Genesis Creation Narrative"
    },
    {
        ", God contracted  his omnipresence, the  Ein Sof , leaving a Vacant Void , bereft from obvious presence and therefore able to entertain free will, contradictions and other phenomena seemingly separate from God himself. These would have been impossible within his original, perfect existence. Yet, the very reality of the world which was created in the Void is entirely dependent on its divine origin. Matter would have been null and void without the true, spiritual essence it possesses. Just the same, the infinite Ein Sof cannot manifest in the Vacant Void, and must limit itself in the guise of measurable corporeality that may be perceived. Rachel Elior, , in: Masuʼot : meḥḳarim be-sifrut ha-ḳabalah ube-maḥshevet Yiśraʼel, ": null
    },
    {
        "Bialik Institute": "Bialik Institute"
    },
    {
        " , . pp. 53-54.     Thus, there is a dualism between the true aspect of everything and the physical side, false but ineluctable, with each evolving into the other: as God must compress and disguise himself, so must humans and matter in general ascend and reunite with the omnipresence. ": null
    },
    {
        "Rachel Elior": "Rachel Elior"
    },
    {
        " quoted ": null
    },
    {
        "Shneur Zalman of Liadi": "Shneur Zalman Of Liadi"
    },
    {
        ", in his commentary  Torah Or  on Genesis 28:21, who wrote that this is the purpose of Creation, from Infinity to Finitude, so it may be reversed from the state of Finite to that of Infinity . Kabbalah stressed the importance of this dialectic, but mainly evoked it in cosmic terms, referring for example to the manner in which God progressively diminished himself into the world through the various dimensions, or  Sephirot . Hasidism applied it also to the most mundane details of human existence. All Hasidic schools devoted a prominent place in their teaching, with differing accentuation, to the interchanging nature of Ein, both infinite and imperceptible, becoming Yesh, Existent – and vice versa. They used the concept as a prism to gauge the world, and the needs of the spirit in particular. Elior noted: Reality lost its static nature and permanent value, now measured by a new standard, seeking to expose the Godly, boundless essence, manifest in its tangible, circumscribed opposite. Elior, p. 56.     One major derivative of this philosophy is the notion of  devekut , communion . As God was everywhere, connection with him had to be pursued ceaselessly as well, in all times, places and occasions. Such an experience was in the reach of every person, who only had to negate his inferior impulses and grasp the truth of divine immanence, enabling him to unite with it and attain the state of perfect, selfless bliss. Hasidic masters, well versed in the teachings concerning communion, are supposed not only to gain it themselves, but to guide their flock to it. Devekut was not a strictly defined experience; many varieties were described, from the utmost ecstasy of the learned leaders to the common mans more humble yet no less significant emotion during prayer.     Closely linked with the former is Bitul ha-Yesh, Negation of the Existent , or of the Corporeal . Hasidism teaches that while a superficial observance of the universe by the eyes of the flesh  purportedly reflects the reality of all things profane and worldly, a true devotee must transcend this illusory façade and realize that there is nothing but God. It is not only a matter of perception, but very practical, for it entails also abandoning material concerns and cleaving only to the true, spiritual ones, oblivious to the surrounding false distractions of life. The practitioners success in detaching from his sense of person, and conceive himself as Ein , is regarded as the highest state of elation in Hasidism. The true divine essence of man – the soul – may then ascend and return to the upper realm, where it does not possess an existence independent from God. This ideal is termed Hitpashtut ha-Gashmiyut, the expansion of corporeality . It is the dialectic opposite of Gods contraction into the world. Elior, pp. 60-61.     To be enlightened and capable of Bitul ha-Yesh, pursuing the pure spiritual aims and defying the primitive impulses of the body, one must overcome his inferior Bestial Soul , connected with the Eyes of the Flesh. He may be able to tap into his Divine Soul , which craves communion, by employing constant contemplation, Hitbonenot, on the hidden Godly dimension of all that exists. Then he could understand his surroundings with the Eyes of the Intellect . The ideal adherent was intended to develop equanimity, or Hishtavut in Hasidic parlance, toward all matters worldly, not ignoring them, but understanding their superficiality.     Hasidic masters exhorted their followers to negate themselves , paying as little heed as they could for worldly concerns, and thus, to clear the way for this transformation. The struggle and doubt of being torn between the belief in Gods immanence and the very real sensual experience of the indifferent world is a key theme in the movements literature. Many tracts have been devoted to the subject, acknowledging that the callous and rude flesh hinders one from holding fast to the ideal, and these shortcomings are extremely hard to overcome even in the purely intellectual level, a fortiori in actual life. Elior, pp. 55, 62-63.     Another implication of this dualism is the notion of Worship through Corporeality , Avodah be-Gashmiyut. As the Ein Sof metamorphosed into substance, so may it in turn be raised back to its higher state; likewise, since the machinations in the higher Sephirot exert their influence on this world, even the most simple action may, if performed correctly and with understanding, achieve the reverse effect. According to Lurianic doctrine, the netherworld was suffused with divine sparks, concealed within husks ,  Qliphoth . The glints had to be recovered and elevated to their proper place in the cosmos. Materiality itself could be embraced and consecrated , noted ": null
    },
    {
        "Glenn Dynner": "Glenn Dynner"
    },
    {
        ", and Hasidism taught that by common acts like dancing or eating, performed with intention, the sparks could be extricated and set free. Avodah be-Gashmiyut had a clear, if not implicit, ": null
    },
    {
        "antinomian": "Antinomian"
    },
    {
        " edge, possibly equating sacred rituals mandated by Judaism with everyday activities, granting them the same status in the believers eyes and having him content to commit the latter at the expense of the former. While at some occasions the movement did appear to step at that direction – for example, in its early days prayer and preparation for it consumed so much time that adherents were blamed of neglecting sufficient Torah study – Hasidic masters proved highly conservative. Unlike in other, more radical sects influenced by kabbalistic ideas, like the ": null
    },
    {
        "Sabbateans": "Sabbateans"
    },
    {
        ", Worship through Corporeality was largely limited to the elite and carefully restrained. The common adherents were taught they may engage it only mildly, through small deeds like earning money to support their leaders.     The complementary opposite of corporeal worship, or the elation of the finite into infinite, is the concept of Hamshacha, drawing down or absorbing , and specifically, Hamschat ha-Shefa, absorption of effluence . During spiritual ascension, one could siphon the power animating the higher dimensions down into the material world, where it would manifest as benevolent influence of all kinds. These included spiritual enlightenment, zest in worship and other high-minded aims, but also the more prosaic health and healing, deliverance from various troubles and simple economic prosperity. Thus, a very tangible and alluring motivation to become followers emerged. Both corporeal worship and absorption allowed the masses to access, with common actions, a religious experience once deemed esoteric. Dynner, Men of Silk, pp. 32-33.     Yet another reflection of the Ein-Yesh dialectic is pronounced in the transformation of evil to goodness and the relations between these two poles and other contradicting elements – including various traits and emotions of the human psyche, like pride and humility, purity and profanity, et cetera. Hasidic thinkers argued that in order to redeem the sparks hidden, one had to associate not merely with the corporeal, but with sin and evil. One example is the elevation of impure thoughts during prayer, transforming them to noble ones rather than repressing them, advocated mainly in the early days of the sect; or breaking oneselfs character by directly confronting profane inclinations. This aspect, once more, had sharp antinomian implications and was used by the Sabbateans to justify excessive sinning. It was mostly toned down in late Hasidism, and even before that leaders were careful to stress that it was not exercised in the physical sense, but in the contemplative, spiritual one. This kabbalistic notion, too, was not unique to the movement and appeared frequently among other Jewish groups. The entire section is based on: Elior, יש ואין; Dan, Teachings, YIVO; Hasidism, Judaica, pp. 410-412.       While its mystical and ethical teachings are not easily sharply distinguished from those of other Jewish currents, the defining doctrine of Hasidism is that of the saintly leader, serving both as an ideal inspiration and an institutional figure around whom followers are organized. In the movements sacral literature, this person is referred to as the  Tzaddiq , the Righteous One – often also known by the general honorific Admor , granted to rabbis in general, or colloquially as Rebbe. The idea that, in every generation, there are righteous persons through whom the divine effluence is drawn to the material world is rooted in the kabbalistic thought, which also claims that one of them is supreme, the reincarnation of ": null
    },
    {
        "Moses": "Moses"
    },
    {
        ". Hasidism elaborated the notion of the Tzaddiq into the basis of its entire system – so much that the very term gained an independent meaning within it, apart from the ": null
    },
    {
        "original which denoted God-fearing, highly observant": "Tzadik"
    },
    {
        " people. David Assaf, The Regal Way: The Life and Times of Rabbi Israel of Ruzhin, Stanford University Press . pp. 101–104.     When the sect began to attract following and expanded from a small circle of learned disciples to a mass movement, it became evident that its complex philosophy could be imparted only partially to the new rank and file. As even intellectuals struggled with the sublime dialectics of infinity and corporeality, there was little hope to have the common folk truly internalize these, not as mere abstractions to pay lip service to. Elior, p. 65. Ideologues exhorted them to have faith, but the true answer, which marked their rise as a distinct sect, was the concept of the Tzaddiq. A Hasidic master was to serve as a living embodiment of the recondite teachings. He was able to transcend matter, gain spiritual communion, Worship through Corporeality and fulfill all the theoretical ideals. As the vast majority of his flock could not do so themselves, they were to cleave to him instead, acquiring at least some semblance of those vicariously. His commanding and often – especially in the early generations – charismatic presence was to reassure the faithful and demonstrate the truth in Hasidic philosophy by countering doubts and despair. But more than spiritual welfare was concerned: Since it was believed he could ascend to the higher realms, the leader was able to harvest effluence and bring it down upon his adherents, providing them with very material benefits. The crystallization of that ": null
    },
    {
        "theurgical": "Theurgical"
    },
    {
        " phase , noted ": null
    },
    {
        "Glenn Dynner": "Glenn Dynner"
    },
    {
        ", marked Hasidisms evolution into a full-fledged social movement.     In Hasidic discourse, the willingness of the leader to sacrifice the ecstasy and fulfillment of unity in God was deemed a heavy sacrifice undertaken for the benefit of the congregation. His followers were to sustain and especially to obey him, as he possessed superior knowledge and insight gained through communion. The descent of the Righteous  into the matters of the world was depicted as identical with the need to save the sinners and redeem the sparks concealed in the most lowly places. Such a link between his functions as communal leader and spiritual guide legitimized the political power he wielded. It also prevented a retreat of Hasidic masters into hermitism and passivity, as many mystics before them did. Their worldly authority was perceived as part of their long-term mission to elevate the corporeal world back into divine infinity. Elior, pp. 66–68; Dynner, pp. 20–21. To a certain extent, the Saint even fulfilled for his congregation, and for it alone, a limited ": null
    },
    {
        "Messianic": "Messiah In Judaism"
    },
    {
        " capacity in his lifetime. After the Sabbatean debacle, this moderate approach provided a safe outlet for the eschatological urges. At least two leaders radicalized in this sphere and caused severe controversy: ": null
    },
    {
        "Nachman of Breslov": "Nachman Of Breslov"
    },
    {
        ", who declared himself the only true Tzaddiq, and ": null
    },
    {
        "Menachem Mendel Schneerson": "Menachem Mendel Schneerson"
    },
    {
        ", whom many of his followers believed to be the Messiah. The Rebbes were subject to intense hagiography, even subtly compared with Biblical figures by employing prefiguration. It was argued that since followers could not negate themselves sufficiently to transcend matter, they should instead negate themselves in submission to the Saint , thus bonding with him and enabling themselves to access what he achieved in terms of spirituality. The Righteous served as a mystical bridge, drawing down effluence and elevating the prayers and petitions of his admirers.     The Saintly forged a well-defined relationship with the masses: they provided the latter with inspiration, were consulted in all matters, and were expected to intercede on behalf of their adherents with God and ensure they gained financial prosperity, health and male offspring. The pattern still characterizes Hasidic sects, though prolonged routinization in many turned the Rebbes into de facto political leaders of strong, institutionalized communities. The role of a Saint was obtained by charisma, erudition and appeal in the early days of Hasidism. But by the dawn of the 19th century, the Righteous began to claim legitimacy by descent to the masters of the past, arguing that since they linked matter with infinity, their abilities had to be associated with their own corporeal body. Therefore, it was accepted there can be no Tzaddiq but the son of a Tzaddiq . Virtually all modern sects maintain this hereditary principle. For example, the Rebbes families maintain endogamy and marry almost solely with scions of other dynasties. Assaf, Regal Way, pp. 108–110.       Some Hasidic courts , and not a few individual prominent masters, developed distinct philosophies with particular accentuation of various themes in the movements general teachings. Several of these Hasidic schools had lasting influence over many dynasties, while others died with their proponents. In the doctrinal sphere, the dynasties may be divided along many lines. Some are characterized by Rebbes who are predominantly Torah scholars and ": null
    },
    {
        "decisors": "Posek"
    },
    {
        ", deriving their authority much like ordinary non-Hasidic rabbis do. Such courts place great emphasis on strict observance and study, and are among the most meticulous in the Orthodox world in practice. Prominent examples are the House of ": null
    },
    {
        "Sanz": "Sanz"
    },
    {
        " and its scions, such as ": null
    },
    {
        "Satmar": "Satmar"
    },
    {
        ", or ": null
    },
    {
        "Belz": "Belz"
    },
    {
        ". Other sects, like ": null
    },
    {
        "Vizhnitz": "Vizhnitz"
    },
    {
        ", espouse a charismatic-populist line, centered on the admiration of the masses for the Righteous, his effervescent style of prayer and conduct and his purported miracle-working capabilities. Fewer still retain a high proportion of the mystical-spiritualist themes of early Hasidism, and encourage members to study much kabbalistic literature and engage in the field. The various ": null
    },
    {
        "Ziditchover": "Ziditchover"
    },
    {
        " dynasties mostly adhere to this philosophy.   Others still focus on contemplation and achieving inner perfection. No dynasty is wholly devoted to a single approach of the above, and all offer some combination with differing emphasis on each of those.     In 1812, a schism occurred between the ": null
    },
    {
        "Seer of Lublin": "Yaakov Yitzchak Of Lublin"
    },
    {
        " and his prime disciple, the ": null
    },
    {
        "Holy Jew": "Yaakov Yitzchak Rabinowicz"
    },
    {
        " of ": null
    },
    {
        "Przysucha": "Przysucha"
    },
    {
        ", due to both personal and doctrinal disagreements. The Seer adopted a populist approach, centered on the Righteous theurgical functions to draw the masses. He was famous for his lavish, enthusiastic conduct during prayer and worship, and extremely charismatic demeanour. He stressed that as Tzaddiq, his mission was to influence the common folk by absorbing Divine Light and satisfying their material needs, thus converting them to his cause and elating them. The Holy Jew pursued a more introspective course, maintaining that the Rebbes duty was to serve as a spiritual mentor for a more elitist group, helping them to achieve a senseless state of contemplation, aiming to restore man to his oneness with God which Adam supposedly lost when he ate the fruit of the Lignum Scientiae . The Holy Jew and his successors did neither repudiate miracle working, nor did they eschew dramatic conduct; but they were much more restrained in general. The Przysucha School became dominant in Central Poland , while populist Hasidism resembling the Lublin ethos often prevailed in Galicia . Dynner, pp. 29-31. One extreme and renowned philosopher who emerged from the Przysucha School was Menachem Mendel of Kotzk . Adopting an elitist, hard-line attitude, he openly denounced the folkly nature of other Tzaddiqim, and rejected financial support. Gathering a small group of devout scholars who sought to attain spiritual perfection, whom he often berated and mocked, he always stressed the importance of both somberness and totality, stating it was better to be fully wicked than only somewhat good.     The Chabad school, limited to its namesake dynasty, but prominent, was founded by Shneur Zalman of Liadi and was elaborated by his successors, until the late 20th century. The movement retained many of the attributes of early Hasidism, before a clear divide between Righteous and ordinary followers was cemented. Chabad Rebbes insisted their adherents acquire proficiency in the sects lore, and not relegate most responsibility to the leaders. The sect emphasizes the importance of intellectually grasping the dynamics of the hidden divine aspect and how they affect the human psyche; the very acronym Chabad is for the three penultimate Sephirot , associated with the cerebral side of consciousness.     Another famous philosophy is that formulated by Nachman of Breslov and adhered to by Breslov Hasidim. In contrast to most of his peers who believed God must be worshiped through joy, Nachman portrayed the corporeal world in grim colors, as a place devoid of Gods immediate presence from which the soul yearns to liberate itself. He mocked the attempts to perceive the nature of infinite-finite dialectics and the manner in which God still occupies the Vacant Void albeit not, stating these were paradoxical, beyond human understanding. Only naive faith in their reality would do. Mortals were in constant struggle to overcome their profane instincts, and had to free themselves from their limited intellects to see the world as it truly is.     Tzvi Hirsh of Zidichov , a major Galician Tzaddiq, was a disciple of the Seer of Lublin, but combined his populist inclination with a strict observance even among his most common followers, and great pluralism in matters pertaining to mysticism, as those were eventually emanating from each persons unique soul.     Mordechai Yosef Leiner of Izbica promulgated a radical understanding of free will, which he considered illusory and also derived directly from God. He argued that when one attained a sufficient spiritual level and could be certain evil thoughts did not derive from his animalistic soul, then sudden urges to transgress revealed Law were God-inspired and may be pursued. This volatile, potentially antinomian doctrine of Transgression for the Sake of Heaven is found also in other Hasidic writings, especially from the early period. His successors de-emphasized it in their commentaries. Leiners disciple Zadok HaKohen of Lublin also developed a complex philosophic system which presented a dialectic nature in history, arguing that great progress had to be preceded by crisis and calamity.           The Hasidic community is organized in a sect known as court . In the early days of the movement, a particular Rebbes following usually resided in the same town, and Hasidim were categorized by their leaders settlement: a Hasid of Belz, Vizhnitz and so forth. Later, especially after World War II, the dynasties retained the names of their original Eastern European settlements when moving to the West or Israel. Thus, for example, the court established by Joel Teitelbaum in 1905 at Transylvania remained known after its namesake town, Sathmar , even though its headquarters lay in New York, and almost all other Hasidic sects likewise – albeit some groups founded overseas were named accordingly, like the Boston .     Akin to his spiritual status, the Rebbe is also the administrative head of the community. Sects often possess their own synagogues, study halls and internal charity mechanisms, and ones sufficiently large also maintain entire educational systems. The Rebbe is the supreme figure of authority, and not just for the institutions. The rank-and-file Hasidim are also expected to consult with him on important matters, and often seek his blessing and advice. He is personally attended by aides known as Gabbai or Mashbak.     Many particular Hasidic rites surround the leader. On the Sabbath, holidays, and celebratory occasions, Rebbes hold a Tisch , a large feast for their male adherents. Together, they sing, dance, and eat, and the head of the sect shakes the hands of his followers to bless them, and often delivers a sermon. A Chozer, repeater , selected for his good memory, commits the text to writing after the Sabbath . In many courts , the remnants of his meal, supposedly suffused with holiness, are handed out and even fought over. Often, a very large dish is prepared beforehand and the Rebbe only tastes it before passing it to the crowd. Apart from the gathering at noon, the third repast on Sabbath and the Melaveh Malkah meal when it ends are also particularly important and an occasion for song, feasting, tales and sermons. A central custom, which serves as a major factor in the economics of most courts , is the Pidyon, Ransom , better known by its Yiddish name Kvitel , little note : adherents submit a written petition, which the master may assist with on behalf of his sanctity, adding a sum of money for either charity or the leaders needs. Louis Jacobs , The YIVO Encyclopedia of Jews in Eastern Europe . Hasidism: Hasidic Way of Life, Encyclopedia Judaica, Volume 8, pp. 398-399. Occasions in the court serve as pretext for mass gatherings, flaunting the power, wealth and size of each. Weddings of the leaders family, for example, are often held with large multistoried stands filled with Hasidim surround the main floor, where the Rebbe and his relatives dine, celebrate and perform the Mitzvah tantz . This is a festive dance with the bride: both parties hold one end of a long sash, a Hasidic gartel , for reasons of modesty.     Allegiance to the dynasty and Rebbe is also often a cause for tension and violence. Mintz, Jerome R. . Hasidic People: A Place in the New World. Harvard University Press. . pp. 58, 135-136, etc. Notable feuds between courts include the 1926–34 strife after Chaim Elazar Spira of Munkatch cursed the deceased Yissachar Dov Rokeach I of Belz; JTA, February 10, 1927. the 1980–2012 Satmar-Belz collision after Yissachar Dov Rokeach II broke with the Orthodox Council of Jerusalem , which culminated when he had to travel in a bulletproof car; JTA, March 5, 1981. and the 2006–present Satmar succession dispute between brothers Aaron Teitelbaum and Zalman Teitelbaum , which saw mass riots.     Like in other Ultra-Orthodox groups, Hasidim who wish to disaffiliate from the community face threats, hostility, violence, and various punitive measures, among them separation of children from their disaffiliated parents, especially in divorce cases. Due to their strictly religious education and traditionalist upbringing, those who leave their sects are devoid of working skills and even command of the English language, and their integration into outer society is extremely problematic. Cf., for example: Judy Bolton-Fasman, Haaretz , 11 August 2015. The conservative and segregated communities are also a comfortable setting for sexual abuse of children , and numerous incidents have been reported. While Hasidic leadership has often been accused of silencing the matter, awareness of it is rising within the sects.     Another related phenomenon is the recent rise of Mashpiim . Once a title for an instructor in Chabad and Breslov only, the institutionalized nature of the established courts led many adherents to seek guidance and inspiration from persons who did not declare themselves new leaders, but only Mashpiim. Technically, they fill the original role of Rebbes in providing for spiritual welfare; yet, they do not usurp the title, and are therefore countenanced. Tomer Persico,       Most Hasidim use some variation of Nusach Sefard , a blend of Ashkenazi and Sephardi liturgies, based on the innovations of Rabbi Isaac Luria . Many dynasties have their own specific adaptation of Nusach Sefard; some, such as the versions of the Belzer, Bobover, and Dushinsky Hasidim, are closer to Nusach Ashkenaz, while others, such as the Munkacz version, are closer to the old Lurianic. Many sects believe that their version reflects Lurias mystical devotions best. The Baal Shem Tov added two segments to Friday services on the eve of Sabbath: Psalm 107 before afternoon prayer , and Psalm 23 at the end of evening service .     Hasidim use the Ashkenazi pronunciation of Hebrew and Aramaic for liturgical purposes, reflecting their Eastern European background. Wordless, emotional melodies, nigun im, are particularly common in their services.     Hasidim lend great importance to kavana , devotion or intention, and their services tend to be extremely long and repetitive. Some courts nearly abolished traditional specified times by which prayers must be conducted , to prepare and concentrate. This practice, still enacted in Chabad for one, is controversial in many dynasties, which do follow the specifics of Jewish Law on praying earlier, and not eating beforehand. Another reglement is daily immersion in a ritual bath by males for spiritual cleansing, at a rate much higher than is customary among other Orthodox Jews.       thu . The man is wearing a shtreimel , and either a bekishe or a rekel . The woman is wearing a wig, called a sheitel , as she is forbidden to show her hair in public.     Within the Hasidic world, it is possible to distinguish different Hasidic groups by subtle differences in dress. Some details of their dress are shared by non-Hasidic Haredim. Much of Hasidic dress was historically the clothing of all Eastern European Jews, influenced by the style of Polish–Lithuanian nobility . Furthermore, Hasidim have attributed religious origins to specific Hasidic items of clothing.     Hasidic men most commonly wear dark overclothes. On weekdays, they wear a long, black, cloth jacket called a rekel , and on Jewish Holy Days , the bekishe zaydene kapote , a similarly long, black jacket, but of satin fabric traditionally silk. Indoors, the colorful tish bekishe is still worn. Some Hasidim wear a satin overcoat, known as rezhvolke. A rebbes rezhvolke might be trimmed with velvet. Most do not wear necktie s.     On the Sabbath , the Hasidic Rebbes traditionally wore a white bekishe . This practice has fallen into disuse among most. Many of them wear a black silk bekishe that is trimmed with velvet and in Hungarian ones, gold-embroidered.     Various symbolic and religious qualities are attributed to Hasidic dress, though they are mainly apocryphal and the clothes origin is cultural and historical. For example, the long overcoats are considered modest, the Shtreimel is supposedly related to shaatnez and keeps one warm without using wool , and Sabbath shoes are laceless in order not to have to tie a knot, a prohibited action. A gartel divides the Hasids lower parts from his upper parts, implying modesty and chastity, and for kabbalistic reasons, Hasidim button their clothes right over left. Hasidic men customarily wear black hats during the weekdays, as do nearly all Haredi men today. A variety of hats are worn depending on the group: Chabad men often pinch their hats to form a triangle on the top, Satmar men wear an open-crown hat with rounded edges, and Samet or biber hats are worn by many Galician and Hungarian Hasidic men.     thu , Munkacser Rebbe, wearing a kolpik     Married Hasidic men don a variety of fur headdress es on the Sabbath, once common among all wedded Eastern European Jewish males and still worn by non-Hasidic Perushim in Jerusalem. The most ubiquitous is the Shtreimel , which is seen especially among Galician and Hungarian sects like Satmar or Belz. A taller Spodik is donned by Polish dynasties such as Ger . A Kolpik is worn by unmarried sons and grandsons of many Rebbes on the Sabbath. Some Rebbes don it on special occasions.     thu Rebbe in his traditional rabbinical Sabbath garb   There are many other distinct items of clothing. Such are the Gerrer hoyznzokn—long black socks into which the trousers are tucked. Some Hasidic men from Eastern Galicia wear black socks with their breeches on the Sabbath, as opposed to white ones on weekdays, particularly Belzer Hasidim.     Following a Biblical commandment not to shave the sides of ones face , male members of most Hasidic groups wear long, uncut sidelocks called payot . Some Hasidic men shave off the rest of their hair. Not every Hasidic group requires long peyos, and not all Jewish men with peyos are Hasidic, but all Hasidic groups discourage the shaving of ones beard. Most Hasidic boys receive their first haircut s ceremonially at the age of three years . Until then, Hasidic boys have long hair.     Hasidic women wear clothing adhering to the principles of modest dress in Jewish law . This includes long, conservative skirts and sleeves past the elbow, as well as covered necklines. Also, the women wear stockings to cover their legs; in some Hasidic groups, such as Satmar or Toldot Aharon , the stockings must be opaque. In keeping with Jewish law , married women cover their hair, using either a sheitel , a tichel , a shpitzel , a snood , a hat, or a beret. In some Hasidic groups, such as Satmar , women may wear two headcoverings – a wig and a scarf, or a wig and a hat.         Hasidic Jews, like many other Orthodox Jews, typically produce large families; the average Hasidic family in the United States has 8 children. This is followed out of a desire to fulfill the Biblical mandate to be fruitful and multiply .       Most Hasidim speak the language of their countries of residence, but use Yiddish among themselves as a way of remaining distinct and preserving tradition. Thus, children are still learning Yiddish today, and the language, despite predictions to the contrary, is not dead. Yiddish newspapers are still published, and Yiddish fiction is being written, primarily aimed at women. Even films in Yiddish are being produced within the Hasidic community. Some Hasidic groups, such as Satmar or Toldot Aharon, actively oppose the everyday use of Hebrew, which they consider a holy tongue. The use of Hebrew for anything other than prayer and study is, according to them, profane and so Yiddish is the vernacular and common tongue for many Hasidim around the world.       thu   Hasidic Tales are a literary genre, concerning both hagiography of various Rebbes and moralistic themes. Some are anecdotes or recorded conversations dealing with matters of faith, practice, and the like. The most famous tend to be terse and carry a strong and obvious point. They were often transmitted orally, though the earliest compendium is from 1815. Schacter-Shalomi, Zalman, Wrapped in a Holy Flame San Francisco CA, Jossey-Bass,     Many revolve around the Righteous. The Baal Shem, in particular, was subject to excess hagiography. Buber, Martin, Tales of the Hasidim: The Early Masters New York, NY, Schocken Books Characterized by vivid metaphors, miracles, and piety, each reflects the surrounding and era it was composed in. Common themes include dissenting the question what is acceptable to pray for, whether or not the commoner may gain communion, or the meaning of wisdom.   The tales were a popular, accessible medium to convey to movements messages.         The various Hasidic groups may be categorized along several parameters, including their geographical origin, their proclivity for certain teachings, and their political stance. These attributes are quite often, but by no means always, correlated, and there are many instances when a court espouses a unique combination. Dynner, pp. 29-30. Thus, while most dynasties from the former Greater Hungary and Galicia are inclined to extreme conservatism and anti-Zionism , Rebbe Yekutiel Yehuda Halbertsam led the Sanz-Klausenburg sect in a more open and mild direction; Benjamin Brown, in: כשיהדות פוגשת מדינה, Israeli Democracy Institute, 2015. pp. 234-236. and though Hasidim from Lithuania and Belarus are popularly perceived as prone to intellectualism, David Assaf noted this notion is derived more from their Litvak surroundings than their actual philosophies. David Assaf, in: גלעד: מאסף לתולדות יהדות פולין.   Apart from those, each court often possesses its unique customs, including style of prayer, melodies, particular items of clothing and the like.     On the political scale, courts are mainly divided on their relations to Zionism . The right-wing, identified with Satmar , are hostile to the State of Israel , and refuse to participate in the elections there or receive any state funding. They are mainly affiliated with the Orthodox Council of Jerusalem and the Central Rabbinical Congress . The great majority belong to Agudas Israel, represented in Israel by the United Torah Judaism party. Its Council of Torah Sages now includes a dozen Rebbes. In the past, there were Religious Zionist Rebbes, mainly of the Ruzhin line, but there are virtually none today. Brown, היהדות החרדית והמדינה. pp. 1-14, etc.     In 2016, a study conducted by Prof. Marcin Wodziński , drawing from the courts own internal phone-books and other resources, located 129,213 Hasidic households worldwide, about 5% of the estimated total Jewish population. Of those, 62,000 resided in Israel and 53,500 in the United States , 5,500 in Britain and 3,400 in Canada . In Israel, the largest Hasidic concentrations are in the Ultra-Orthodox neighbourhoods of Jerusalem – including Ramot Alon , Batei Ungarin et cetera – in the cities of Bnei Brak and Elad , and in the West Bank settlement s of Modiin Illit and Beitar Illit . There is considerable presence in other specifically Orthodox municipalities or enclaves, like Kiryat Sanz, Netanya . In the United States, most Hasidim reside in New York , though there are small communities across the entire country. Brooklyn , Borough Park , Williamsburg , and Crown Heights all house a particularly large population. So does the hamlet of Monsey in upstate New York. In the same region, New Square and Kiryas Joel are rapidly growing all-Hasidic enclaves, one founded by the Skver dynasty and the other by Satmar. In Britain, Stamford Hill is home to the largest Hasidic community in the country, and there are others in London and Prestwich in Manchester. In Canada, Kiryas Tosh is a settlement populated entirely by Tosh Hasidim, and there are more adherents of other sects in and around Montreal. All numbers are from: Marcin Wodziński, Historical Atlas of Hasidism, Princeton University Press, 2018. pp. 192-205.     There are more than a dozen Hasidic dynasties with a large following, and over a hundred which have small or minuscule adherence, sometimes below twenty people, with the presumptive Rebbe holding the title more as a matter of prestige. Many courts became completely extinct during the Holocaust , like the Aleksander from Aleksandrów Łódzki , which numbered tens of thousands in 1939, and barely exists today. Jacques Gutwirth, The Rebirth of Hasidism: From 1945 to the Present Day, Odile Jacob, 2004. pp. 106-108.     The largest sect in the world, with some 26,000 member households which constitute 20% of all Hasidim, is Satmar, founded in 1905 in the namesake city in Hungary and based in Williamsburg, Brooklyn and Kiryas Joel . Satmar is known for its conservatism and opposition to both Agudas Israel and Zionism , inspired by the legacy of Hungarian Ultra-Orthodoxy. The sect underwent a schism in 2006 and two competing factions emerged, led by rival brothers Aaron Teitelbaum and Zalman Teitelbaum . The second-largest court worldwide, with some 11,600 households is Ger , established in 1859 at Góra Kalwaria , near Warsaw . For decades, it was the dominant power in Agudas and espoused a moderate line toward Zionism and modern culture. Its origins lay in the rationalist Przysucha School of Central Poland . The current Rebbe is Yaakov Aryeh Alter . The third largest dynasty is Vizhnitz , a charismatic sect founded in 1854 at Vyzhnytsia , Bukovina . A moderate group involved in Israeli politics, it is split into several branches, which maintain cordial relations. The main partition is between Vizhnitz-Israel and Vizhnitz-Monsey, headed respectively by Rebbes Israel Hager and the eight sons of the late Rebbe Mordecai Hager. In total, all Vizhnitz sub- courts constitute over 10,500 households. The fourth major dynasty, with some 7,000 households, is Belz , established 1817 in namesake Belz , south of Lviv . An Eastern Galicia n dynasty drawing both from the Seer of Lublin s charismatic-populist style and rabbinic Hasidism, it espoused hard-line positions, but broke off from the Orthodox Council of Jerusalem and joined Agudas in 1979. Belz is led by Rebbe Yissachar Dov Rokeach .     The Bobover dynasty, founded 1881 in Bobowa , West Galicia , constitutes some 4,500 households in total and has undergone a bitter succession strife since 2005, eventually forming the Bobov and Bobov-45 sects. Sanz-Klausenburg , divided into a New York and Israeli branches, presides over 3,800 households. The Skver sect, established in 1848 in Skvyra near Kiev , constitutes 3,300. The Shomer Emunim dynasties, originating in Jerusalem during the 1920s and known for their unique style of dressing imitating that of the Old Yishuv , have over 3,000 families, almost all in the larger courts of Toldos Aharon and Toldos Avraham Yitzchak . Karlin Stolin , which rose already in the 1760s in a quarter of Pinsk , encompasses 2,200 families.     There are two other populous Hasidic sub-groups, which do not function as classical Rebbe-headed courts , but as decentralized movements, retaining some of the characteristics of early Hasidism. Brown, היהדות החרדית והמדינה. p. 86. Breslov rose under its charismatic leader Nachman of Breslov in the early 19th century. Critical of all other Rebbes, he forbade his followers to appoint a successor upon his death in 1810. His acolytes led small groups of adherents, persecuted by other Hasidim, and disseminated his teachings. The original philosophy of the sect elicited great interest among modern scholars, and that led many newcomers to Orthodox Judaism to join it. Numerous Breslov communities, each led by its own rabbis, now have thousands of full-fledged followers and far more admirers and semi-committed supporters; Marcin Wodziński estimated that the fully committed population of Breslovers may be estimated at 7,000 households. Chabad-Lubavitch , originating in the 1770s, did have hereditary leadership, but always stressed the importance of self-study rather than reliance on the Righteous. Its seventh and last leader, Menachem Mendel Schneerson , converted it into a vehicle for Jewish outreach. By his death in 1994, it had many more semi-engaged supporters than Hasidim in the strict sense, and they are still hard to distinguish. Chabads own internal phone-books list some 16,800 member households. None succeeded Schneerson, and the sect operates as a large network of communities with independent leaders.             In the late 17th century, several social trends converged among the Jews who inhabited the southern periphery of the Polish–Lithuanian Commonwealth , especially in contemporary Western Ukraine . These enabled the emergence and flourishing of Hasidism.     The first and most prominent was the popularization of the mystical lore of Kabbalah. For several centuries, an esoteric teaching practiced surreptitiously by few, it was transformed into almost household knowledge by a mass of cheap printed pamphlets. The kabbalistic inundation was a major influence behind the rise of the heretical Sabbatean movement, led by Sabbatai Zevi , who declared himself Messiah in 1665. The propagation of Kabbalah made the Jewish masses susceptible to Hasidic ideas, themselves in essence a popularized version of the teaching – indeed, Hasidism actually emerged when its founders determined to openly practice it instead of remaining a secret circle of ascetics as was the manner of almost all past kabbalists. The correlation between publicizing the lore and Sabbateanism did not escape the rabbinic elite, and caused vehement opposition to the new movement.     Another factor was the decline of the traditional authority structures. Jewish autonomy remained quite secured; later research debunked Simon Dubnow s claim that the Council of Four Lands demise in 1746 was a culmination of a long process which destroyed judicial independence and paved the way for the Hasidic rebbes to serve as leaders . However, the magnates and nobles held much sway over the nomination of both rabbis and communal elders, to such a degree that the masses often perceived them as mere lackeys of the land owners. Their ability to serve as legitimate arbiters in disputes – especially those concerning the regulation of leasehold rights over alcohol distillation and other monopolies in the estates – was severely diminished. The reduced prestige of the establishment, and the need for an alternative source of authority to pass judgement, left a vacuum which Hasidic charismatics eventually filled. They transcended old communal institutions, to which all the Jews of a locality were subordinate, and had groups of followers in each town across vast territories. Often supported by rising strata outside the traditional elite, whether nouveau riche or various low-level religious functionaries, they created a modern form of leadership.     Historians discerned other influences. The formative age of Hasidism coincided with the rise of numerous religious revival movements across the world, including the First Great Awakening in New England , German Pietism , Wahhabism in Arabia and the Russian Old Believers who opposed the established church. They all rejected the existing order, decrying it as stale and overly hierarchic. They offered what they described as more spiritual, candid and simple substitutes. Gershon David Hundert noted the considerable similarity between the Hasidic conceptions and this general background, rooting both in the growing importance attributed to the individuals consciousness and choices. Glenn Dynner , Men of Silk: The Hasidic Conquest of Polish Jewish Society, Oxford University Press . pp. 3–23.         thu   Israel ben Eliezer , known as the Baal Shem Tov , is considered the founder of Hasidism. Born apparently south of the Prut , in the northern frontier of Moldavia , he earned a reputation as a Baal Shem , Master of the Name . These were common folk healers who employed mysticism, amulets and incantations at their trade. Little is known for certain on ben Eliezer. Though no scholar, he was sufficiently learned to become notable in the communal hall of study and marry into the rabbinic elite, his wife being the divorced sister of a rabbi; in his later years he was wealthy and famous, as attested by contemporary chronicles. Apart from that, most is derived from Hasidic hagiographic accounts. These claim that as a boy he was recognized by one Rabbi Adam Baal Shem Tov who entrusted him with great secrets of the Torah passed in his illustrious family for centuries. The Besht later spent a decade in the Carpathian Mountains as a hermit, where he was visited by the Biblical prophet Ahijah the Shilonite who taught him more. At the age of thirty-six, he was granted heavenly permission to reveal himself as a great kabbalist and miracle worker.     By the 1740s, it is verified that he relocated to the town of Medzhybizh and became recognized and popular in all Podolia and beyond. It is well attested that he did emphasize several known kabbalistic concepts, formulating a teaching of his own to some degree. The Besht stressed the immanence of God and his presence in the material world, and that therefore, physical acts, such as eating, have actual influence on the spiritual sphere and may serve to hasten the achievement of communion with the divine . He was known to pray ecstatically and with great intention , again in order to provide channels for the divine light to flow into the earthly realm. The Besht stressed the importance of joy and contentment in the worship of God, rather than the abstinence and self-mortification deemed essential to become a pious mystic, and of fervent and vigorous prayer as a means of spiritual elation instead of severe aestheticism , but many of his immediate disciples reverted in part to the older doctrines, especially in disavowing sexual pleasure even in marital relations. David Biale, The Lust for Asceticism in the Ha-sidic Movement, in: Jonathan Magonet, Jewish Explorations of Sexuality. Oxford University Press . pp. 53-55.     In that, the Besht laid the foundation for a popular movement, offering a far less rigorous course for the masses to gain a significant religious experience. And yet, he remained the guide of a small society of elitists, in the tradition of former kabbalists, and never led a large public as his successors did. While many later figures cited him as the inspiration behind the full-fledged Hasidic doctrine, the Besht himself did not practice it in his lifetime. Moshe Rosman, The YIVO Encyclopedia of Jews in Eastern Europe .       thu , one of the greatest promulgators of Hasidism in Poland, blessing acolytes. Circa 1800.|300px   Israel ben Eliezer gathered a considerable following, drawing to himself disciples from far away. They were largely of elitist background, yet adopted the populist approach of their master. The most prominent was Rabbi Dov Ber the Maggid . He succeeded the former upon his death, though other important acolytes, mainly Jacob Joseph of Polonne , did not accept his leadership. Establishing himself in Mezhirichi , the Maggid turned to greatly elaborate the Beshts rudimentary ideas and institutionalize the nascent circle into an actual movement. Ben Eliezer and his acolytes used the very old and common epithet hasidim , pious ; in the latter third of the 18th century, a clear differentiation arose between that sense of the word and what was at first described as New Hasidism , propagated to a degree by the Maggid and especially his successors. Moshe Rosman, Founder of Hasidism: A Quest for the Historical Baal Shem Tov. University of California Press . pp. 37-38.     Doctrine coalesced as Jacob Joseph, Dov Ber and the latters disciple Rabbi Elimelech of Lizhensk composed the three magna opera of early Hasidism, respectively: the 1780 Toldot Yaakov Yosef, the 1781 Maggid dvarav le-Yaakov and the 1788 Noam Elimelekh. Other books were also published. Their new teaching had many aspects. The importance of devotion in prayer was stressed to such degree that many waited beyond the prescribed time to properly prepare; the Beshts recommendation to elevate and sanctify impure thoughts rather than simply repress them during the service was expanded by Dov Ber into an entire precept, depicting prayer as a mechanism to transform thoughts and feelings from a primal to a higher state in a manner parallel to the unfolding of the Sephirot . But the most important was the notion of the Tzaddiq – later designated by the general rabbinic honorific Admor or by the colloquial Rebbe – the Righteous One, the mystic who was able to elate and achieve communion with the divine, but unlike kabbalists past, did not practice it in secret, but as leader of the masses. He was able to bring down prosperity and guidance from the higher Sephirot, and the common people who could not attain such a state themselves would achieve it by clinging to and obeying him. The Tzaddiq served as a bridge between the spiritual realm and the ordinary folk, as well as a simple, understandable embodiment of the esoteric teachings of the sect, which were still beyond the reach of most just as old-style Kabbalah before.     The various Hasidic Tzaddiqim, mainly the Maggids disciples, spread across Eastern Europe with each gathering adherents among the people and learned acolytes who could be initiated as leaders. The Righteous courts in which they resided, attended by their followers to receive blessing and council, became the institutional centers of Hasidism, serving as its branches and organizational core. Slowly, various rites emerged in them, like the Sabbath Tisch or table , in which the Righteous would hand out food scraps from their meals, considered blessed by the touch of ones imbued with godly Light during their mystical ascensions. Dynner, pp. 34-39, 42. Another potent institution was the Shtibel , the private prayer gatherings opened by adherents in every town which served as a recruiting mechanism. The Shtibel differed from the established synagogues and study halls, allowing their members greater freedom to worship when they pleased and also serving recreational and welfare purposes. Combined with its simplified message, more appealing to the common man, its honed organizational framework accounted for the exponential growth of Hasidic ranks. Having ousted the old communal model and replaced it with a less-hierarchical structure and more individually-oriented religiosity, Hasidism was in fact the first great modern – albeit not modernist; its self-understanding was grounded in a traditional mindset – Jewish movement. For exampe: Murray Rosman, Simon Dubnow Institute Yearbook 6 .     From its original base in Podolia and Volhynia , the movement was rapidly disseminated during the Maggids lifetime and after his 1772 death. Twenty or so of Dov Bers prime disciples each brought it to a different region, and their own successors followed: Aharon of Karlin , Menachem Mendel of Vitebsk and Shneur Zalman of Liadi were the emissaries to the former Lithuania in the far north, while Menachem Nachum Twersky headed to Chernobyl in the east and Levi Yitzchok of Berditchev remained nearby. Elimelech of Lizhensk, his brother Zusha of Hanipol and Yisroel Hopsztajn established the sect in Poland proper . Vitebsk and Abraham Kalisker later led a small ascension to the Land of Israel , establishing a Hasidic presence in the Galilee .     The spread of Hasidism also incurred organized opposition. Rabbi Elijah of Vilnius , one of the greatest authorities of the generation and a hasid and secret kabbalist of the old style, was deeply suspicious of their emphasis on mysticism rather than mundane Torah study, threat to established communal authority, resemblance to the Sabbatean movement and other details he considered infractions. In April 1772, he and the Vilnius community wardens launched a systematic campaign against the sect, placing an anathema upon them, banishing their leaders and sending letters denouncing the movement. Further excommunication followed in Brody and other cities. In 1781, during a second round of hostilities, the books of Jacob Joseph were burned in Vilnius. Another cause for strife emerged when the Hasidim adopted the Lurianic prayer rite, which they revised somewhat to Nusach Sefard ; the first edition in Eastern Europe was printed in 1781 and received approbation from the anti-Hasidic scholars of Brody, but the sect quickly embraced the Kabbalah-infused tome and popularized it, making it their symbol. Their rivals, named Misnagdim , opponents soon accused them of abandoning the traditional Nusach Ashkenaz .     In 1798, Opponents made accusations of espionage against Shneur Zalman of Liadi and he was imprisoned by the Russian government for two months. Excoriatory polemics were printed and anathemas declared in the entire region. But Elijahs death in 1797 denied the Misnagdim their powerful leader. In 1804, Alexander I of Russia allowed independent prayer groups to operate, the chief vessel through which the movement spread from town to town. The failure to eradicate Hasidism, which acquired a clear self-identity in the struggle and greatly expanded throughout it, convinced its adversaries to adopt a more passive method of resistance, as exemplified by Chaim of Volozhin . The growing conservatism of the new movement – which at some occasions drew close to Kabbalah-based antinomian phraseology, as did the Sabbateans, but never crossed the threshold and remained thoroughly observant – and the rise of common enemies slowly brought a rapprochement, and by the second half of the 19th century both sides basically considered each other legitimate.     The turn of the century saw several prominent new, fourth-generation tzaddiqim. Upon Elimelechs death in the now-partitioned Poland , his place in Habsburg Galicia was assumed by Menachem Mendel of Rimanov , who was deeply hostile to the modernization the Austrian rulers attempted to force on the traditional Jewish society . The rabbi of Rimanov hearkened the alliance the hasidim would form with the most conservative elements of the Jewish public. In Central Poland, the new leader was Jacob Isaac Horowiz, the Seer of Lublin , who was of a particularly populist bent and appealed to the common folk with miracle working and little strenuous spiritual demands. The Seers senior acolyte, Jacob Isaac Rabinovitz the Holy Jew of Przysucha , gradually dismissed his mentors approach as overly vulgar and adopted a more aesthetic and scholarly approach, virtually without theurgy to the masses. The Holy Jews Przysucha School was continued by his successor Simcha Bunim and especially the reclusive, morose Menachem Mendel of Kotzk . The most controversial fourth-generation tzaddiq was the Podolia-based Nachman of Breslov , who denounced his peers for becoming too institutionalized, much like the old establishment their predecessors challenged decades before, and espoused an anti-rationalist, pessimistic spiritual teaching, very different from the prevalent stress on joy.       thu     The opening of the 19th century saw the Hasidic sect transformed. Once a rising force outside the establishment, the tzaddiqim now became an important and often dominant power in most of Eastern Europe. The slow process of encroachment, which mostly begun with forming an independent Shtibel and culminated in the Righteous becoming an authority figure for the entire community, overwhelmed many towns even in Misnagdic stronghold of Lithuania, far more so in Congress Poland and the vast majority in Podolia, Volhynia and Galicia. It began to make inroads into Bukovina , Bessarabia and the westernmost frontier of autochthonic pre-WWII Hasidism, in northeastern Hungary , where the Seers disciple Moses Teitelbaum was appointed in Ujhely .     Less than three generations after the Beshts death, the sect grew to encompass hundreds of thousands by 1830. As a mass movement, a clear stratification emerged between the courts functionaries and permanent residents , the devoted followers who would often visit the Righteous on Sabbath, and the large public which prayed at Sefard Rite synagogues and was minimally affiliated.     All this was followed by a more conservative approach and power bickering among the Righteous. Since the Maggids death, none could claim the overall leadership. Among the several dozens active, each ruled over his own turf, and local traditions and customs began to emerge in the various courts which developed their own identity. The high mystical tension typical of a new movement subsided, and was soon replaced by more hierarchical, orderly atmosphere.     The most important aspect of the routinization Hasidism underwent was the adoption of dynasticism. The first to claim legitimacy by right of descent from the Besht was his grandson, Boruch of Medzhybizh , appointed 1782. He held a lavish court with Hershel of Ostropol as jester, and demanded the other Righteous acknowledge his supremacy. Upon the death of Menachem Nachum Twersky of Chernobyl , his son Mordechai Twersky succeeded him. The principle was conclusively affirmed in the great dispute after Liadis demise in 1813: his senior acolyte Aharon HaLevi of Strashelye was defeated by his son, Dovber Schneuri , whose offspring retained the title for 181 years .     By the 1860s, virtually all courts were dynastic. Rather than single tzaddiqim with followings of their own, each sect would command a base of rank-and-file hasidim attached not just to the individual leader, but to the bloodline and the courts unique attributes. Israel Friedman of Ruzhyn insisted on royal splendour, resided in a palace and his six sons all inherited some of his followers. With the constraints of maintaining their gains replacing the dynamism of the past, the Righteous or Rebbes/Admorim also silently retreated from the overt, radical mysticism of their predecessors. While populist miracle working for the masses remained a key theme in many dynasties, a new type of Rebbe-Rabbi emerged, one who was both a completely traditional halakhic authority as well as a spiritualist. The tension with the Misnagdim subsided significantly. Benjamin Brown, Stephen Sharot, Journal for the Scientific Study of Religion, 1980     But it was an external threat, more than anything else, that mended relations. While traditional Jewish society remained well entrenched in backward Eastern Europe, reports of the rapid acculturation and religious laxity in the West troubled both camps. When the Haskalah , the Jewish Enlightenment , appeared in Galicia and Congress Poland in the 1810s, it was soon perceived as a dire threat. The maskilim themselves detested Hasidism as an anti-rationalist and barbaric phenomenon, as did Western Jews of all shades, including the most right-wing Orthodox such as Rabbi Azriel Hildesheimer . David Ellenson , Rabbi Esriel Hildesheimer and the Creation of a Modern Jewish Orthodoxy. University of Alabama Press, 1990. p. 44. In Galicia especially, hostility towards it defined the Haskalah to a large extent, from the staunchly observant Rabbi Zvi Hirsch Chajes and Joseph Perl to the radical anti-Talmudists like Osias Schorr . The Enlightened, who revived Hebrew grammar , often mocked their rivals lack of eloquence in the language. While a considerable proportion of the Misnagdim were not adverse to at least some of the Haskalas goals, the Rebbes were unremittingly hostile.     The most distinguished Hasidic leader in Galicia in the era was Chaim Halberstam , who combined talmudic erudition and the status of a major decisor with his function as tzaddiq. He symbolized the new era, brokering peace between the small Hasidic sect in Hungary to its opponents. At that country, where modernization and assimilation were much more imminent than in the East, the local Righteous joined forces with those now termed Orthodox against the rising liberals. Rabbi Moses Sofer of Pressburg , while no friend to Hasidism, tolerated it as he combated the forces which sought modernization of the Jews; a generation later, in the 1860s, the Rebbes and the zealot ultra-Orthodox Hillel Lichtenstein allied closely.     Around the mid-19th century, over a hundred dynastic courts related by marriage were the main religious power in the territory enclosed between Hungary, former Lithuania, Prussia and inner Russia, with considerable presence in the former two. In Central Poland, the pragmatist, rationalist Przysucha school thrived: Yitzchak Meir Alter founded the court of Ger in 1859, and in 1876 Jechiel Danziger established Alexander . In Galicia and Hungary, apart from Halberstams House of Sanz , Tzvi Hirsh of Zidichov s descendants each pursued a mystical approach in the dynasties of Zidichov , Komarno and so forth. In 1817, Sholom Rokeach became the first Rebbe of Belz . At Bukovina , the Hager line of Kosov - Vizhnitz was the largest court.     The Haskalah was always a minor force, but the Jewish national movements which emerged in the 1880s, as well as Socialism, proved much more appealing to the young. Progressive strata condemned Hasidism as a primitive relic, strong, but doomed to disappear, as Eastern European Jewry underwent slow yet steady secularization. The gravity of the situation was attested to by the foundation of Hasidic yeshiva s to enculturate the young and preserve their loyalty: The first was established at Nowy Wiśnicz by Rabbi Shlomo Halberstam in 1881. These institutions were originally utilized by the Misnagdim to inoculate their youth from Hasidic influence, but now, the latter faced a similar crisis. One of the most contentious issues in this respect was Zionism ; the Ruzhin dynasties were quite favourably disposed toward it, while Hungarian and Galician courts reviled it.       Outside pressure was mounting in the early 20th century. In 1912, many Hasidic leaders partook in the creation of the Agudas Israel party, a political instrument intended to safeguard what was now named Orthodox Judaism even in the relatively traditional East; the more hard-line dynasties, mainly Galician and Hungarian, opposed the Aguda as too lenient. Mass immigration to America, urbanization, World War I and the subsequent Russian Civil War uprooted the ": null
    },
    {
        "shtetl": "Shtetl"
    },
    {
        "s in which the local Jews lived for centuries and were the bedrock of Hasidism. In the new Soviet Union , civil equality first achieved and a harsh repression of religion caused a rapid secularization. Few remaining Hasidim, especially of Chabad , continued to practice underground for decades. In the new states of the Interbellum era, the process was only somewhat slower. On the eve of World War II , strictly observant Jews were estimated to constitute no more than a third of the total Jewish population in Poland, the worlds most Orthodox country. Jaff Schatz, Jews and the Communist Movement in Interwar Poland, in: Dark Times, Dire Decisions: Jews and Communism. Oxford University Press . p. 36. While the Rebbes still had a vast base of support, it was aging and declining.     The Holocaust hit the Hasidim, easily identifiable and almost unable to disguise themselves among the larger populace due to cultural insularity, particularly hard. Hundreds of leaders perished with their flock, while the flight of many notable ones as their followers were being exterminated – especially Aharon Rokeach of Belz and Joel Teitelbaum of Satmar – elicited bitter recrimination. In the immediate post-war years, the entire movement seemed to teeter on the precipice of oblivion. In Israel, the United States, and Western Europe, the survivors children were at best becoming Modern Orthodox . While a century earlier the Haskalah depicted it as a medieval, malicious power, now it was so weakened that the popular cultural image was sentimental and romantic, what Joseph Dan termed Frumkinian Hasidism for it began with the short stories of Michael Levi Rodkinson . Martin Buber was the major contributor to this trend, portraying the sect as a model of a healthy folk consciousness. Frumkinian style was very influential, later inspiring the so-called Neo-Hasidism , and also utterly ahistorical. Joseph Dan, , Modern Judaism, Volume 11, pp. 175-193.     Yet, the movement proved more resilient than expected. Talented and charismatic Hasidic masters emerged, who reinvigorated their following and drew new crowds. In New York, the Satmar Rebbe Joel Teitelbaum formulated a fiercely anti-Zionist Holocaust theology and founded an insular, self-sufficient community which attracted many immigrants from Greater Hungary; already by 1961, 40% of families were newcomers. Israel Rubin. Satmar: Two Generations of an Urban Island. P. Lang . p. 42 Yisrael Alter of Ger created robust institutions, fortified his courts standing in Agudas Israel and held tisch every week for 29 years. He halted the hemorrhage of his followers and retrieved many Litvaks  and Religious Zionists whose parents were Gerrer Hasidim before the war. Chaim Meir Hager similarly restored Vizhnitz . Moses Isaac Gewirtzman founded the new Pshevorsk in Antwerp .     The most explosive growth was experienced in Chabad-Lubavitch , whose head Menachem Mendel Schneerson adopted a modern and outreach-centered orientation. At a time when most Orthodox and Hasidim in particular rejected proselytization, he turned his sect into a mechanism devoted almost solely to it, blurring the difference between actual Hasidim and loosely affiliated supporters until researchers could scarcely define it as a regular Hasidic group. Another phenomenon was the revival of Breslov , which remained without an acting Tzaddiq since the rebellious ": null
    },
    {
        "Rebbe Nachmans": "Rebbe Nachman"
    },
    {
        "1810 death. Its complex, existentialist philosophy drew many to it.     High fertility rates, increasing tolerance and ": null
    },
    {
        "multiculturalism": "Multiculturalism"
    },
    {
        " on behalf of surrounding society, and the great wave of ": null
    },
    {
        "newcomers to Orthodox Judaism": "Baal Teshuva Movement"
    }
]