[
    {
        "     Heather Fargo is an American politician who served as ": null
    },
    {
        "mayor": "Mayor Of Sacramento, California"
    },
    {
        " and was a former ": null
    },
    {
        "City Council Member": "Sacramento City Council"
    },
    {
        " of ": null
    },
    {
        "Sacramento, California": "Sacramento, California"
    },
    {
        ". She was sworn in as mayor in November 2000, replacing ": null
    },
    {
        "Jimmie R. Yee": "Jimmie R. Yee"
    },
    {
        ", and served until December 2008, when she was succeeded by ": null
    },
    {
        "Kevin Johnson": "Kevin Johnson"
    },
    {
        ".       Heather Fargo grew up in Davis, Santa Maria, and Stockton, CA. She graduated from AA Stagg High School. She received a ": null
    },
    {
        "Bachelor of Science": "Bachelor Of Science"
    },
    {
        " degree in Environmental Planning and Management from the ": null
    },
    {
        "University of California, Davis": "University Of California, Davis"
    },
    {
        " in 1975. In 1981, Fargo earned a Certificate of Completion from the Revenue Sources Management School in ": null
    },
    {
        "Boulder, Colorado": "Boulder, Colorado"
    },
    {
        ". She also completed the State and Local Government Executive Program at the ": null
    },
    {
        "John F. Kennedy School of Government": "John F. Kennedy School Of Government"
    },
    {
        " at ": null
    },
    {
        "Harvard University": "Harvard University"
    },
    {
        " in 1991.       Heather Fargo was first elected to the ": null
    },
    {
        "Sacramento City Council": "Sacramento City Council"
    },
    {
        " in 1989 to a five-year term as Sacramento was transitioning to even year citywide elections. Fargo represented District One which includes ": null
    },
    {
        "Downtown": "Downtown Sacramento"
    },
    {
        " and ": null
    },
    {
        "Natomas": "Natomas"
    },
    {
        ". In the September primary, she came in second place to businesswoman Kate Karpilow but beat future City Councilman Ray Tretheway who came in third place and incumbent David Shore who came in fourth place. However, Fargo came back to beat Karpilow in November.     Upon Grantland Johnsons resignation from the County Board of Supervisors in 1994, Fargo decided to run for the Board. In that election, she faced attorney and community activist Roger Dickinson. In a closely fought election, Dickinson narrowly beat Fargo. After that loss she was re-elected in 1994 and 1998. While serving on the city council, , she was employed as a manager of the California State Parks Volunteer Program.            Upon the sudden death in November 1999 of Mayor ": null
    },
    {
        "Joe Serna, Jr.": "Joe Serna, Jr."
    },
    {
        ", Land Park city councilman Jimmie Yee became the acting mayor. Several candidates announced their intentions to run. Other than Fargo, three other council members were also seeking the mayorship. North Sacramento city councilman Rob Kerth who represented an area immediately adjacent to Fargos also decided to run. In addition, ": null
    },
    {
        "Steve Cohn": "Sacramento City Councilsteve Cohn"
    },
    {
        ", the city councilman for ": null
    },
    {
        "East Sacramento": "East Sacramento, Sacramento, California"
    },
    {
        " ran along with ": null
    },
    {
        "Robbie Waters": "Sacramento City Councilrobbie Waters"
    },
    {
        " who represents the Pocket and Greenhaven areas decided to run along with several lesser known candidates that included businessman and attorney Joe Genshlea and community activist Julie Padilla. Fargo, who won 22% of the vote in the primary and Kerth who won 20% of the vote made it into the November runoff, where Fargo was elected with just 53% of the vote. In winning, Fargo became the first Latina mayor of an American city. David Goldfield, Encyclopedia of American Cities, v.1. Thousand Oaks: Sage, 2007, p. 881. 9780761928843          Fargo did not face as stiff competition in her 2004 re-election. Her main opponent was Ross W. Relles, Jr., a businessman. Other candidates were Deputy Attorney General Mark Soble and Lorenzo Patino Law School President Leonard Padilla. Virtually unopposed against candidates far less funded, Fargo won solidly in the primary election, thus no runoff was necessary.          The primary election for Mayor took place on 3 June 2008. Fargo received 39% of the vote, while former ": null
    },
    {
        "NBA": "Nba"
    },
    {
        " star and Sacramento native ": null
    },
    {
        "Kevin Johnson": "Kevin Johnson"
    },
    {
        " received 46% of the vote.  Since neither received a majority of the votes, a run off election was scheduled for November 2008, where she was defeated by a margin of 58% to 42%.     During the primary election campaign, Fargo initially claimed that she had the support of all the city councilmembers. Yet, Councilman Robbie Waters, Steve Cohn, and Sandra Sheedy all ended up endorsing Johnson during the primary.  On September 4, 2008 only Councilman Kevin McCarty endorsed Heather Fargo.             Heather Fargo was a founding member and the first secretary of the Sacramento Tree Foundation, which is considered an important voice in Sacramento’s environmental community.        During her tenure Mayor Fargo became a member of the ": null
    },
    {
        "Mayors Against Illegal Guns Coalition": "Mayors Against Illegal Guns Coalition"
    },
    {
        ",  an organization formed in 2006 and co-chaired by ": null
    },
    {
        "New York City": "New York City"
    },
    {
        " mayor ": null
    },
    {
        "Michael Bloomberg": "Michael Bloomberg"
    },
    {
        " and ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " mayor ": null
    },
    {
        "Thomas Menino": "Thomas Menino"
    },
    {
        ".       Mayor Fargos tenure as mayor included disagreements with the Maloof family, owners of the NBAs Sacramento Kings, over the building of a new arena.     In 2006, 2007, and 2008, Mayor Fargo was named Best Local Elected Official by the readers of  Sacramento Magazine  in their annual poll.                                Because Fargo received a majority of the votes in the primary election, no general election was necessary.          Johnson and Fargo proceeded to a runoff election on November 5.       ": null
    }
]