[
    {
        "      Heimskringla  is the best known of the Old Norse ": null
    },
    {
        "kings sagas": "Kings Sagas"
    },
    {
        ". It was written in ": null
    },
    {
        "Old Norse": "Old Norse"
    },
    {
        " in ": null
    },
    {
        "Iceland": "Iceland"
    },
    {
        " by the poet and historian ": null
    },
    {
        "Snorri Sturluson": "Snorri Sturluson"
    },
    {
        "  1230. The name Heimskringla was first used in the 17th century, derived from the first two words of one of the manuscripts .     Heimskringla is a collection of ": null
    },
    {
        "sagas": "Saga"
    },
    {
        "about Swedish and Norwegian ": null
    },
    {
        "king": "King"
    },
    {
        "s, beginning with the saga of the legendary Swedish dynasty of the ": null
    },
    {
        "Yngling": "Yngling"
    },
    {
        "s, followed by accounts of historical Norwegian rulers from ": null
    },
    {
        "Harald Fairhair": "Harald Fairhair"
    },
    {
        " of the 9th century up to the death of the pretender ": null
    },
    {
        "Eystein Meyla": "Eystein Meyla"
    },
    {
        " in 1177. The exact sources of his work are disputed, but included earlier kings sagas, such as ": null
    },
    {
        "Morkinskinna": "Morkinskinna"
    },
    {
        ", ": null
    },
    {
        "Fagrskinna": "Fagrskinna"
    },
    {
        " and the twelfth century Norwegian synoptic histories and oral traditions, notably many ": null
    },
    {
        "skald": "Skald"
    },
    {
        "ic poems. Snorri had himself visited Norway and Sweden. For events of the mid-12th century, Snorri explicitly names the now-lost work  Hryggjarstykki  as his source. The composition of the sagas is Snorris.       The name Heimskringla comes from the fact that the first words of the first saga in the compilation  are Kringla heimsins, the orb of the Earth . Geir T. Zoëga, A Concise Dictionary of Old Icelandic , s.vv. http://www.northvegr.org/zoega/h249.php kringla, disk, circle, orb and heimr.       The earliest parchment copy of the work is referred to as Kringla, now catalogued as Reykjavík, National Library, Lbs fragm 82. This is now a single vellum leaf from c. 1260; the rest of the manuscript was lost to fire in 1728. .          Heimskringla consists of several sagas, often thought of as falling into three groups, giving the overall work the character of a ": null
    },
    {
        "triptych": "Triptych"
    },
    {
        ". Snorri Sturluson, Heimskringla, trans. by Alison Finlay and Anthony Faulkes, 3 vols ,  . The saga narrates the contests of the kings, the establishment of the kingdom of Norway, ": null
    },
    {
        "Viking": "Vikings"
    },
    {
        " expeditions to various European countries, ranging as far afield as ": null
    },
    {
        "Palestine": "Palestine"
    },
    {
        " in the saga of ": null
    },
    {
        "Sigurd the Crusader": "Sigurd The Crusader"
    },
    {
        ". The stories are told with a life and freshness, giving a picture of human life in all its reality. The saga is a prose epic, relevant to the history not only of Scandinavia but the regions included in the wider medieval ": null
    },
    {
        "Scandinavian diaspora": "Viking Expansion"
    },
    {
        ". The first part of the Heimskringla is rooted in ": null
    },
    {
        "Norse mythology": "Norse Mythology"
    },
    {
        "; as the collection proceeds, fable and fact intermingle, but the accounts become increasingly historically reliable.     The first section tells of the mythological prehistory of the Norwegian royal dynasty, tracing ": null
    },
    {
        "Odin": "Odin"
    },
    {
        ", described here as a mortal man, and his followers from the East, from Asaland and ": null
    },
    {
        "Asgard": "Asgard"
    },
    {
        ", its chief city, to their settlement in ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        " . The subsequent sagas are devoted to individual rulers, starting with ": null
    },
    {
        "Halfdan the Black": "Halfdan The Black"
    },
    {
        ".     A version of  Óláfs saga helga , about the saint ": null
    },
    {
        "Olaf II of Norway": "Olaf Ii Of Norway"
    },
    {
        ", is the main and central part of the collection: Olafs 15-year-long reign takes up about one third of the entire work.     Thereafter, the saga of ": null
    },
    {
        "Harald Hardrada": "Harald Hardrada"
    },
    {
        " narrates Haralds expedition to the East, his brilliant exploits in ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        ", ": null
    },
    {
        "Syria": "Syria"
    },
    {
        ", and ": null
    },
    {
        "Sicily": "Sicily"
    },
    {
        ", his skaldic accomplishments, and his battles in England against ": null
    },
    {
        "Harold Godwinson": "Harold Godwinson"
    },
    {
        ", the son of ": null
    },
    {
        "Godwin, Earl of Wessex": "Godwin, Earl Of Wessex"
    },
    {
        ", where he fell at the battle ": null
    },
    {
        "Battle of Stamford Bridge": "Battle Of Stamford Bridge"
    },
    {
        " in 1066 only a few days before Harold fell at the ": null
    },
    {
        "Battle of Hastings": "Battle Of Hastings"
    },
    {
        ". After presenting a series of other kinds, the saga ends with ": null
    },
    {
        "Magnus V of Norway": "Magnus V Of Norway"
    },
    {
        ".        Heimskringla contains the following sagas  Ynglinga saga    Saga of ": null
    },
    {
        "Halfdanr svarti": "Halfdan The Black"
    },
    {
        "   Saga of ": null
    },
    {
        "Haraldr hárfagi": "Harald I Of Norway"
    },
    {
        "   Saga of ": null
    },
    {
        "Hákon góði": "Haakon I Of Norway"
    },
    {
        "   Saga of King ": null
    },
    {
        "Haraldr gráfeldr": "Harald Ii Of Norway"
    },
    {
        "   Saga of King Óláfr Tryggvason": "Óláfs Saga Tryggvasonar"
    },
    {
        "   Saga of King Óláfr Haraldsson": "Óláfs Saga Helga"
    },
    {
        " , excerpt from conversion of Dale-Gudbrand    Saga of ": null
    },
    {
        "Magnús góði": "Magnus The Good"
    },
    {
        "   Saga of ": null
    },
    {
        "Haraldr harðráði": "Harald Iii Of Norway"
    },
    {
        "   Saga of ": null
    },
    {
        "Óláfr Haraldsson kyrri": "Olaf Iii Of Norway"
    },
    {
        "   Saga of ": null
    },
    {
        "Magnús berfœttr": "Magnus Barefoot"
    },
    {
        "   Saga of ": null
    },
    {
        "Sigurðr Jórsalafari": "Sigurd Jorsalfar"
    },
    {
        " and his brothers   Saga of ": null
    },
    {
        "Magnús blindi": "Magnus Iv Of Norway"
    },
    {
        " and of ": null
    },
    {
        "Haraldr Gilli": "Harald Gilli"
    },
    {
        "   Saga of ": null
    },
    {
        "Sigurðr": "Sigurd Haraldson"
    },
    {
        " , ": null
    },
    {
        "Eysteinn": "Eystein Haraldson"
    },
    {
        " and ": null
    },
    {
        "Ingi": "Inge Haraldson"
    },
    {
        " , the sons of Haraldr   Saga of ": null
    },
    {
        "Hákon herðibreiðs": "Hakon Ii Of Norway"
    },
    {
        "   Saga of ": null
    },
    {
        "Magnús Erlingsson": "Magnus V Of Norway"
    },
    {
        "         Snorri explicitly mentions a few prose sources, now mostly lost in the form that he knew them:  Hryggjarstykki  by Eiríkr Oddsson ,  Skjǫldunga saga , an unidentified saga about Knútr inn gamli, and a text called Jarlasǫgurnar . Snorri Sturluson, Heimskringla, trans. by Alison Finlay and Anthony Faulkes, 3 vols ,  .     Snorri may have had access to a wide range of the early Scandinavian historical texts known today as the synoptic histories, but made most use of: Snorri Sturluson, Heimskringla, trans. by Alison Finlay and Anthony Faulkes, 3 vols ,  .    Ágrip af Nóregs konunga sǫgum  .    Morkinskinna  .   Possibly  Fagrskinna , itself based on Morkinskinna, but the much shorter.   His own  Separate saga of St Óláfr , which he incorporated bodily into Heimskringla. This text was apparently based primarily on a saga of Olaf from about 1220 by Styrmir Kárason, now mostly lost.   ": null
    },
    {
        "Oddr Snorrasons": "Oddr Snorrason"
    },
    {
        " Life of Óláfr Tryggvason, and possibly a Latin life of the same figure by ": null
    },
    {
        "Gunnlaugr Leifsson": "Gunnlaugr Leifsson"
    },
    {
        ".     Snorri also made extensive use of ": null
    },
    {
        "skaldic verse": "Skaldic Verse"
    },
    {
        " which he believed to have been composed at the time of the events portrayed and transmitted orally from that time onwards, and clearly made use of other oral accounts, though it is uncertain to what extent. Snorri Sturluson, Heimskringla, trans. by Alison Finlay and Anthony Faulkes, 3 vols ,  .         Up until the mid-19th century, historians put great trust in the factual truth of Snorris narrative, as well as other old Norse sagas. In the early 20th century, this trust was largely abandoned with the advent of saga criticism, pioneered by ": null
    },
    {
        "Lauritz": "Lauritz Weibull"
    },
    {
        " and ": null
    },
    {
        "Curt Weibull": "Curt Weibull"
    },
    {
        ". These historians pointed out that Snorris work had been written several centuries after most of the events it describes. In Norway, the historian ": null
    },
    {
        "Edvard Bull": "Edvard Bull, Sr."
    },
    {
        " famously proclaimed that we have to give up all illusions that Snorris mighty epic bears any deeper resemblance to what actually happened in the time it describes. Edvard Bull, Det norske folks liv og historie gjennom tidene bd. 2 A school of historians has come to believe that the motives Snorri and the other saga writers give to their characters owe more to conditions in the 13th century than in earlier times.     Heimskringla has, however, continued to be used as a historical source, though with more caution. It is not common to believe in the detailed accuracy of the historical narrative and historians tend to see little to no historical truth behind the first few sagas, however, they are still seen by many as a valuable source of knowledge about the society and politics of medieval Norway. e.g. Sverre Bagge, Society and Politics in Snorri Sturlusons Heimskringla . The factual content of the work tends to be deemed more credible where it discusses more recent times, as the distance in time between the events described and the composition of the saga was shorter, allowing traditions to be retained in a largely accurate form, and because in the twelfth century the first contemporary written sources begin to emerge in Norway.       Whereas prior to Heimskringla there seems to have been a diversity of efforts to write histories of kings, Snorris Heimskringla seems thereafter to have been the basis for Icelandic writing about Scandinavian kings, and was expanded by scribes rather than entirely revised.  Flateyjarbók , from the end of the fourteenth century, is the most extreme example of expansion, interweaving Snorris text with many þættir and other whole sagas, prominently Orkneyinga saga, Færeyinga saga, and Fóstbrœðra saga. Snorri Sturluson, Heimskringla, trans. by Alison Finlay and Anthony Faulkes, 3 vols ,  .     The text is also referenced in  Journey to the Center of the Earth  by ": null
    },
    {
        "Jules Verne": "Jules Verne"
    },
    {
        "; the work is the one Professor Liedenbrock finds Arne Saknussems note in.         By the mid-16th century, the Old Norse language was unintelligible to Norwegian, Swedish or Danish readers. At that time several translations of extracts were made in Norway into the Danish language, which was the literary language of Norway at the time. The first complete translation was made around 1600 by Peder Claussøn Friis, and printed in 1633. This was based on a manuscript known as Jofraskinna.     Subsequently, the Stockholm manuscript was translated into Swedish and Latin by ": null
    },
    {
        "Johan Peringskiöld": "Johan Peringskiöld"
    },
    {
        "  and published in 1697 at Stockholm under the title Heimskringla, which is the first known use of the name. This edition also included the first printing of the text in Old Norse. A new Danish translation with the text in Old Norse and a Latin translation came out in 1777–83 . An English translation by ": null
    },
    {
        "Samuel Laing": "Samuel Laing"
    },
    {
        " was finally published in 1844, with a second edition in 1889. Other English translations followed.     In the 19th century, as Norway was achieving independence after centuries of union with Denmark and Sweden, the stories of the independent Norwegian medieval kingdom won great popularity in Norway. Heimskringla, although written by an Icelander, became an important national symbol for Norway during the period of ": null
    },
    {
        "romantic nationalism": "Romantic Nationalism"
    },
    {
        ".  In 1900, the Norwegian parliament, the ": null
    },
    {
        "Storting": "Stortinget"
    },
    {
        ", subsidized the publication of new translations of Heimskringla into both Norwegian written forms, ": null
    },
    {
        "landsmål": "Nynorsk"
    },
    {
        " and ": null
    },
    {
        "riksmål": "Bokmål"
    },
    {
        ", in order that the work may achieve wide distribution at a low price .  forat verket ved en lav pris kan faa almindelig udbredelse . Snorre Sturlason, Kongesagaer .       Heimskringla eða Sögur Noregs konunga Snorra Sturlusonar, ed. by N. Linder and H. A. Haggson , , ,  Heimskringla, ed. by Bjarni Aðalbjarnarson, Íslenzk fornrit, 26–28, 3 vols .       The most recent English translation of Heimskringla is by ": null
    },
    {
        "Alison Finlay": "Alison Finlay"
    },
    {
        " and ": null
    },
    {
        "Anthony Faulkes": "Anthony Faulkes"
    },
    {
        " and is available ": null
    },
    {
        "open-access": "Open-Access"
    },
    {
        ".   Snorri Sturluson, http://www.sacred-texts.com/neu/heim/index.htm The Heimskringla: Or, Chronicle of the Kings of Norway, trans. by Samuel Laing ,  .   The Saga Library: Done into English out of the Icelandic, trans. by William Morris and Eiríkr Magnússon, 6 vols , vols 3-6.   Snorri Sturluson, Heimskringla: Sagas of the Norse Kings, trans. by Samuel Laing, part 1 rev. by Jaqueline Simpson, part 2 rev. by Peter Foote, Everymans Library, 717, 722, 847 .   Snorri Sturluson, Heimskringla: History of the Kings of Norway, trans. by Lee M. Hollander .   Snorri Sturluson, Histoire des rois de Norvège, première partie: des origines mythiques de la dynastie à la bataille de Svold, trans. by François-Xavier Dillmann .   Snorri Sturluson, Heimskringla, trans. by Alison Finlay and Anthony Faulkes, 3 vols , ; ; ; .       . A reprint of the 1932 Cambridge edition by W. Heffer.   ": null
    }
]