[
    {
        "        Hermann Karl Hesse  was a German-born poet, novelist, and painter. His best-known works include  Demian ,  Steppenwolf ,  Siddhartha , and  The Glass Bead Game , each of which explores an individuals search for ": null
    },
    {
        "authenticity": "Authenticity"
    },
    {
        ", self-knowledge and ": null
    },
    {
        "spirituality": "Spirituality"
    },
    {
        ". In 1946, he received the ": null
    },
    {
        "Nobel Prize in Literature": "Nobel Prize In Literature"
    },
    {
        ".           Hermann Karl Hesse German Wikipedia, other sources. was born on 2 July 1877 in the ": null
    },
    {
        "Black Forest": "Black Forest"
    },
    {
        " town of ": null
    },
    {
        "Calw": "Calw"
    },
    {
        " in ": null
    },
    {
        "Württemberg": "Kingdom Of Württemberg"
    },
    {
        ", German Empire. His grandparents served in India at a mission under the auspices of the ": null
    },
    {
        "Basel Mission": "Basel Mission"
    },
    {
        ", a Protestant Christian missionary society. His grandfather ": null
    },
    {
        "Hermann Gundert": "Hermann Gundert"
    },
    {
        " compiled the current grammar in ": null
    },
    {
        "Malayalam": "Malayalam"
    },
    {
        " language, compiled a Malayalam-English dictionary, and also contributed to the work in translating the Bible to Malayalam.  Hesses mother, Marie Gundert, was born at such a mission in India in 1842. In describing her own childhood, she said, A happy child I was not... As was usual among missionaries at the time, she was left behind in Europe at the age of four when her parents returned to India.  as quoted in Freedman pp. 18–19.          Hesses father, Johannes Hesse, the son of a doctor, was born in 1847 in ": null
    },
    {
        "Weissenstein": "Paide"
    },
    {
        ", ": null
    },
    {
        "Governorate of Estonia": "Governorate Of Estonia"
    },
    {
        " in the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        " . Johannes Hesse belonged to the ": null
    },
    {
        "Baltic German": "Baltic German"
    },
    {
        " minority in the Russian-ruled ": null
    },
    {
        "Baltic region": "Baltic Region"
    },
    {
        "German Empire": "German Empire"
    },
    {
        " and the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        ". . Hermann had five siblings, but two of them died in infancy. In 1873, the Hesse family moved to Calw, where Johannes worked for the Calwer Verlagsverein, a publishing house specializing in theological texts and schoolbooks. Maries father, ": null
    },
    {
        "Hermann Gundert": "Hermann Gundert"
    },
    {
        " , managed the publishing house at the time, and Johannes Hesse succeeded him in 1893.     Hesse grew up in a ": null
    },
    {
        "Swabia": "Swabia"
    },
    {
        "n ": null
    },
    {
        "Pietist": "Pietism"
    },
    {
        " household, with the Pietist tendency to insulate believers into small, deeply thoughtful groups. Furthermore, Hesse described his fathers Baltic German heritage as an important and potent fact of his developing identity. His father, Hesse stated, always seemed like a very polite, very foreign, lonely, little-understood guest. . His fathers tales from Estonia instilled a contrasting sense of religion in young Hermann. an exceedingly cheerful, and, for all its Christianity, a merry world... We wished for nothing so longingly as to be allowed to see this Estonia... where life was so paradisiacal, so colorful and happy. Hermann Hesses sense of estrangement from the Swabian petty bourgeoisie grew further through his relationship with his maternal grandmother Julie Gundert,  Dubois, whose French-Swiss heritage kept her from ever quite fitting in among that milieu.       From childhood, Hesse was headstrong and hard for his family to handle. In a letter to her husband, Hermanns mother Marie wrote: The little fellow has a life in him, an unbelievable strength, a powerful will, and, for his four years of age, a truly astonishing mind. How can he express all that? It truly gnaws at my life, this internal fighting against his tyrannical temperament, his passionate turbulence God must shape this proud spirit, then it will become something noble and magnificent – but I shudder to think what this young and passionate person might become should his upbringing be false or weak. Volker Michels : Über Hermann Hesse. Verlag Suhrkamp, Frankfurt am Main, vol 1: 1904–1962, Repräsentative Textsammlung zu Lebzeiten Hesses. 2nd ed., 1979, , p. 400.        Hesse showed signs of serious depression as early as his first year at school. Freedman, p. 30   In his ": null
    },
    {
        "juvenilia": "Juvenilia"
    },
    {
        " collection Gerbersau, Hesse vividly describes experiences and anecdotes from his childhood and youth in Calw: the atmosphere and adventures by the river, the bridge, the chapel, the houses leaning closely together, hidden nooks and crannies, as well as the inhabitants with their admirable qualities, their oddities, and their idiosyncrasies. The fictional town of Gerbersau is pseudonymous for Calw, imitating the real name of the nearby town of ": null
    },
    {
        "Hirsau": "Hirsau"
    },
    {
        ". It is derived from the German words gerber, meaning tanner, and aue, meaning meadow. An English equivalent would be Tannersmead. Calw had a centuries-old leather-working industry, and during Hesses childhood the tanneries influence on the town was still very much in evidence. Siegfried Greiner Hermann Hesse, Jugend in Calw, Thorbecke ,  p. viii Hesses favorite place in Calw was the St. Nicholas-Bridge , which is why a Hesse monument was built there in 2002.      Hermann Hesses grandfather ": null
    },
    {
        "Hermann Gundert": "Hermann Gundert"
    },
    {
        ", a doctor of philosophy and fluent in multiple languages, encouraged the boy to read widely, giving him access to his library, which was filled with the works of world literature. All this instilled a sense in Hermann Hesse that he was a citizen of the world. His family background became, he noted, the basis of an isolation and a resistance to any sort of nationalism that so defined my life.     Young Hesse shared a love of music with his mother. Both music and poetry were important in his family. His mother wrote poetry, and his father was known for his use of language in both his sermons and the writing of religious tracts. His first role model for becoming an artist was his half-brother, Theo, who rebelled against the family by entering a music conservatory in 1885. Freedman pp. 30–32 Hesse showed a precocious ability to rhyme, and by 1889–90 had decided that he wanted to be a writer. Freedman p. 39       In 1881, when Hesse was four, the family moved to ": null
    },
    {
        "Basel": "Basel"
    },
    {
        ", Switzerland, staying for six years and then returning to Calw. After successful attendance at the Latin School in ": null
    },
    {
        "Göppingen": "Göppingen"
    },
    {
        ", Hesse entered the ": null
    },
    {
        "Evangelical Theological Seminary": "Evangelical Seminaries Of Maulbronn And Blaubeuren"
    },
    {
        " of ": null
    },
    {
        "Maulbronn Abbey": "Maulbronn Abbey"
    },
    {
        " in 1891. The pupils lived and studied at the abbey, one of Germanys most beautiful and well-preserved, attending 41 hours of classes a week. Although Hesse did well during the first months, writing in a letter that he particularly enjoyed writing essays and translating classic Greek poetry into German, his time in Maulbronn was the beginning of a serious personal crisis. Zeller, pp. 26–30 In March 1892, Hesse showed his rebellious character, and, in one instance, he fled from the Seminary and was found in a field a day later. Hesse began a journey through various institutions and schools and experienced intense conflicts with his parents. In May, after an attempt at suicide, he spent time at an institution in ": null
    },
    {
        "Bad Boll": "Bad Boll"
    },
    {
        " under the care of theologian and minister ": null
    },
    {
        "Christoph Friedrich Blumhardt": "Christoph Friedrich Blumhardt"
    },
    {
        ". Later, he was placed in a mental institution in ": null
    },
    {
        "Stetten im Remstal": "Stetten Im Remstal"
    },
    {
        ", and then a boys institution in Basel. At the end of 1892, he attended the ": null
    },
    {
        "Gymnasium": "Gymnasium"
    },
    {
        " in Cannstatt, now part of ": null
    },
    {
        "Stuttgart": "Stuttgart"
    },
    {
        ". In 1893, he passed the One Year Examination, which concluded his schooling. The same year, he began spending time with older companions and took up drinking and smoking. Freedman p. 53     After this, Hesse began a bookshop apprenticeship in ": null
    },
    {
        "Esslingen am Neckar": "Esslingen Am Neckar"
    },
    {
        ", but quit after three days. Then, in the early summer of 1894, he began a 14-month mechanic apprenticeship at a clock tower factory in Calw. The monotony of soldering and filing work made him turn himself toward more spiritual activities. In October 1895, he was ready to begin wholeheartedly a new apprenticeship with a bookseller in ": null
    },
    {
        "Tübingen": "Tübingen"
    },
    {
        ". This experience from his youth, especially his time spent at the Seminary in Maulbronn, he returns to later in his novel  Beneath the Wheel .          On 17 October 1895, Hesse began working in the bookshop in Tübingen, which had a specialized collection in theology, philology, and law. . Hesses tasks consisted of organizing, packing, and archiving the books. After the end of each twelve-hour workday, Hesse pursued his own work, and he spent his long, idle Sundays with books rather than friends. Hesse studied theological writings and later ": null
    },
    {
        "Goethe": "Johann Wolfgang Von Goethe"
    },
    {
        ", ": null
    },
    {
        "Lessing": "Gotthold Ephraim Lessing"
    },
    {
        ", ": null
    },
    {
        "Schiller": "Friedrich Schiller"
    },
    {
        ", and ": null
    },
    {
        "Greek mythology": "Greek Mythology"
    },
    {
        ". He also began reading ": null
    },
    {
        "Nietzsche": "Friedrich Nietzsche"
    },
    {
        " in 1895, Freedman p. 69. and that philosophers ideas of dual… impulses of passion and order in humankind was a heavy influence on most of his novels. Freedman p. 111.     By 1898, Hesse had a respectable income that enabled financial independence from his parents.  During this time, he concentrated on the works of the ": null
    },
    {
        "German Romantics": "German Romanticism"
    },
    {
        ", including much of the work from ": null
    },
    {
        "Clemens Brentano": "Clemens Brentano"
    },
    {
        ", ": null
    },
    {
        "Joseph Freiherr von Eichendorff": "Joseph Freiherr Von Eichendorff"
    },
    {
        ", ": null
    },
    {
        "Friedrich Hölderlin": "Friedrich Hölderlin"
    },
    {
        ", and ": null
    },
    {
        "Novalis": "Novalis"
    },
    {
        ". In letters to his parents, he expressed a belief that the morality of artists is replaced by aesthetics .     During this time, he was introduced to the home of Fräulein von Reutern, a friend of his familys. There he met with people his own age. His relationships with his contemporaries were problematic , in that most of them were now at university. This usually left him feeling awkward in social situations. Freedman p. 64.     In 1896, his poem Madonna appeared in a ": null
    },
    {
        "Viennese": "Vienna"
    },
    {
        " periodical and Hesse released his first small volume of poetry, Romantic Songs. In 1897, a published poem of his, Grand Valse , drew him a fan letter. It was from ": null
    },
    {
        "Helene Voigt": "Helene Voigt-Diederichs"
    },
    {
        ", who the next year married ": null
    },
    {
        "Eugen Diederichs": "Eugen Diederichs"
    },
    {
        ", a young publisher. To please his wife, Diederichs agreed to publish Hesses collection of prose entitled  One Hour After Midnight  in 1898 . Freedman pp. 78–80. Both works were a business failure. In two years, only 54 of the 600 printed copies of Romantic Songs were sold, and One Hour After Midnight received only one printing and sold sluggishly. Furthermore, Hesse suffered a great shock when his mother disapproved of Romantic Songs on the grounds that they were too secular and even vaguely sinful. Freedman, p. 79.     From late 1899, Hesse worked in a distinguished antique book shop in Basel. Through family contacts, he stayed with the intellectual families of Basel. In this environment with rich stimuli for his pursuits, he further developed spiritually and artistically. At the same time, Basel offered the solitary Hesse many opportunities for withdrawal into a private life of artistic self-exploration, journeys and wanderings. In 1900, Hesse was exempted from compulsory military service due to an ": null
    },
    {
        "eye condition": "Amblyopia"
    },
    {
        ". This, along with ": null
    },
    {
        "nerve disorders": "Neuralgia"
    },
    {
        " and persistent headaches, affected him his entire life.     In 1901, Hesse undertook to fulfill a long-held dream and travelled for the first time to Italy. In the same year, Hesse changed jobs and began working at the antiquarium Wattenwyl in Basel. Hesse had more opportunities to release poems and small literary texts to journals. These publications now provided honorariums. His new bookstore agreed to publish his next work,  Posthumous Writings and Poems of Hermann Lauscher . Freedman p. 97. In 1902, his mother died after a long and painful illness. He could not bring himself to attend her funeral, stating in a letter to his father: I think it would be better for us both that I do not come, in spite of my love for my mother. Freedman , pp. 99–101.     Due to the good notices that Hesse received for  Lauscher , the publisher ": null
    },
    {
        "Samuel Fischer": "Samuel Fischer"
    },
    {
        " became interested in Hesse Freedman p. 107. and, with the novel  Peter Camenzind , which appeared first as a pre-publication in 1903 and then as a regular printing by Fischer in 1904, came a breakthrough: from now on, Hesse could make a living as a writer. The novel became popular throughout Germany. Freedman p. 108. Sigmund Freud praised  Peter Camenzind  as one of his favorite readings. Freedman p. 117.             Having realized he could make a living as a writer, Hesse finally married Maria Bernoulli  in 1904, while her father, who disapproved of their relationship, was away for the weekend. The couple settled down in ": null
    },
    {
        "Gaienhofen": "Gaienhofen"
    },
    {
        " on ": null
    },
    {
        "Lake Constance": "Lake Constance"
    },
    {
        ", and began a family, eventually having three sons. In Gaienhofen, he wrote his second novel,  Beneath the Wheel , which was published in 1906. In the following time, he composed primarily short stories and poems. His story The Wolf , written in 1906–07, was quite possibly a foreshadowing of  Steppenwolf . Freedman p. 140     His next novel,  Gertrude , published in 1910, revealed a production crisis. He had to struggle through writing it, and he later would describe it as a miscarriage . Gaienhofen was the place where Hesses interest in ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        " was re-sparked. Following a letter to Kapff in 1895 entitled Nirvana, Hesse had ceased alluding to Buddhist references in his work. In 1904, however, ": null
    },
    {
        "Arthur Schopenhauer": "Arthur Schopenhauer"
    },
    {
        " and his philosophical ideas started receiving attention again, and Hesse discovered ": null
    },
    {
        "theosophy": "Theosophy"
    },
    {
        ". Schopenhauer and theosophy renewed Hesses interest in India. Although it was many years before the publication of Hesses Siddhartha , this masterpiece was to be derived from these new influences.     During this time, there also was increased dissonance between him and Maria, and in 1911 Hesse left for a long trip to ": null
    },
    {
        "Sri Lanka": "Sri Lanka"
    },
    {
        " and ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        ". He also visited Sumatra, Borneo, and Burma, but the physical experience... was to depress him. Freedman p. 149 Any spiritual or religious inspiration that he was looking for eluded him,  but the journey made a strong impression on his literary work. Following Hesses return, the family moved to ": null
    },
    {
        "Bern": "Bern"
    },
    {
        " , but the change of environment could not solve the marriage problems, as he himself confessed in his novel  Rosshalde  from 1914.       At the outbreak of the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        " in 1914, Hesse registered himself as a volunteer with the ": null
    },
    {
        "Imperial army": "German Army"
    },
    {
        ", saying that he could not sit inactively by a warm fireplace while other young authors were dying on the front. He was found unfit for combat duty, but was assigned to service involving the care of prisoners of war.  While most poets and authors of the warring countries quickly became embroiled in a tirade of mutual hate, Hesse, seemingly immune to the general war enthusiasm of the time, Zeller, p. 83 wrote an essay titled O Friends, Not These Tones , which was published in the  Neue Zürcher Zeitung , on November 3.  In this essay he appealed to his fellow intellectuals not to fall for nationalistic madness and hatred. Calling for subdued voices and a recognition of Europes common heritage, Freedman p. 166 Hesse wrote:  That love is greater than hate, understanding greater than ire, peace nobler than war, this exactly is what this unholy World War should burn into our memories, more so than ever felt before. Zeller, pp. 83–84 What followed from this, Hesse later indicated, was a great turning point in his life: For the first time, he found himself in the middle of a serious political conflict, attacked by the German press, the recipient of hate mail, and distanced from old friends. However, he did receive support from his friend ": null
    },
    {
        "Theodor Heuss": "Theodor Heuss"
    },
    {
        ", and the French writer ": null
    },
    {
        "Romain Rolland": "Romain Rolland"
    },
    {
        ", who visited Hesse in August 1915. Freedman pp. 170–71. In 1917, Hesse wrote to Rolland, The attempt...to apply love to matters political has failed. Freedman p. 189     This public controversy was not yet resolved when a deeper life crisis befell Hesse with the death of his father on 8 March 1916, the serious illness of his son Martin, and his wifes ": null
    },
    {
        "schizophrenia": "Schizophrenia"
    },
    {
        ". He was forced to leave his military service and begin receiving ": null
    },
    {
        "psychotherapy": "Psychotherapy"
    },
    {
        ". This began for Hesse a long preoccupation with ": null
    },
    {
        "psychoanalysis": "Psychoanalysis"
    },
    {
        ", through which he came to know ": null
    },
    {
        "Carl Jung": "Carl Jung"
    },
    {
        " personally, and was challenged to new creative heights. During a three-week period in September and October 1917, Hesse penned his novel  Demian , which would be published following the armistice in 1919 under the ": null
    },
    {
        "pseudonym": "Pseudonym"
    },
    {
        " Emil Sinclair.       By the time Hesse returned to civilian life in 1919, his marriage had fallen apart. His wife had a severe episode of ": null
    },
    {
        "psychosis": "Psychosis"
    },
    {
        ", but, even after her recovery, Hesse saw no possible future with her. Their home in Bern was divided, their children were accommodated in boarding houses and by relatives, Zeller, p. 93 and Hesse resettled alone in the middle of April in ": null
    },
    {
        "Ticino": "Ticino"
    },
    {
        ". He occupied a small farm house near Minusio , living from 25 April to 11 May in Sorengo. On 11 May, he moved to the town ": null
    },
    {
        "Montagnola": "Montagnola"
    },
    {
        " and rented four small rooms in a castle-like building, the Casa Camuzzi. Here, he explored his writing projects further; he began to paint, an activity reflected in his next major story, ": null
    },
    {
        "Klingsors Last Summer": "Klingsors Last Summer"
    },
    {
        " , published in 1920. This new beginning in different surroundings brought him happiness, and Hesse later called his first year in Ticino the fullest, most prolific, most industrious and most passionate time of my life. Zeller, p. 94 In 1922, Hesses novella  Siddhartha  appeared, which showed the love for Indian culture and Buddhist philosophy that had already developed earlier in his life. In 1924, Hesse married the singer Ruth Wenger, the daughter of the Swiss writer ": null
    },
    {
        "Lisa Wenger": "Lisa Wenger"
    },
    {
        " and aunt of ": null
    },
    {
        "Méret Oppenheim": "Méret Oppenheim"
    },
    {
        ". This marriage never attained any stability, however.     In 1923, Hesse was granted Swiss citizenship. His next major works, Kurgast and The Nuremberg Trip , were autobiographical narratives with ironic undertones and foreshadowed Hesses following novel,  Steppenwolf , which was published in 1927. In the year of his 50th birthday, the first biography of Hesse appeared, written by his friend ": null
    },
    {
        "Hugo Ball": "Hugo Ball"
    },
    {
        ". Shortly after his new successful novel, he turned away from the solitude of Steppenwolf and married art historian Ninon Dolbin,  Ausländer. This change to companionship was reflected in the novel  Narcissus and Goldmund , appearing in 1930. In 1931, Hesse left the Casa Camuzzi and moved with Ninon to a large house near ": null
    },
    {
        "Montagnola": "Montagnola"
    },
    {
        ", which was built according to his wishes.     In 1931, Hesse began planning what would become his last major work,  The Glass Bead Game  . In 1932, as a preliminary study, he released the novella  Journey to the East . The Glass Bead Game was printed in 1943 in Switzerland. He was awarded the ": null
    },
    {
        "Nobel Prize in Literature": "Nobel Prize In Literature"
    },
    {
        " in 1946.         As reflected in Demian, and other works, he believed that for different people, there are different ways to God ; . but despite the influence he drew from Indian and Buddhist philosophies, he stated about his parents: “their ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", one not preached but lived, was the strongest of the powers that shaped and moulded me . . Another translation: Not the preached, but their practiced Christianity, among the powers that shaped and molded me, has been the strongest . .            Hesse observed the rise to power of ": null
    },
    {
        "Nazism": "Nazism"
    },
    {
        " in Germany with concern. In 1933, ": null
    },
    {
        "Bertolt Brecht": "Bertolt Brecht"
    },
    {
        " and ": null
    },
    {
        "Thomas Mann": "Thomas Mann"
    },
    {
        " made their travels into exile, each aided by Hesse. In this way, Hesse attempted to work against ": null
    },
    {
        "Hitlers": "Adolf Hitler"
    },
    {
        " suppression of art and literature that protested Nazi ideology. Hesses third wife was Jewish, and he had publicly expressed his opposition to anti-Semitism long before then. Galbreath Robert. Hermann Hesse and the Politics of Detachment , p. 63, Political Theory, vol. 2, No 1 . Hesse was criticized for not condemning the Nazi party, but his failure to criticize or support any political idea stemmed from his politics of detachment At no time did he openly condemn , although his detestation of their politics is beyond question. Galbreath Robert. Hermann Hesse and the Politics of Detachment , p. 64, Political Theory, vol. 2, No 1 Nazism, with its blood sacrifice of the individual to the state and the race, represented the opposite of everything he believed in. In March 1933, seven weeks after Hitler took power, Hesse wrote to a correspondent in Germany, “It is the duty of spiritual types to stand alongside the spirit and not to sing along when the people start belting out the patriotic songs their leaders have ordered them to sing.” In the nineteen-thirties, Hesse made a quiet statement of resistance by reviewing and publicizing the work of banned Jewish authors, including ": null
    },
    {
        "Franz Kafka": "Franz Kafka"
    },
    {
        ".  From the end of the 1930s, German journals stopped publishing Hesses work, and the Nazis eventually banned it.     The Glass Bead Game was Hesses last novel. During the last twenty years of his life, Hesse wrote many short stories and poems . Hesse also wrote ironic essays about his alienation from writing  and spent much time pursuing his interest in watercolors. Hesse also occupied himself with the steady stream of letters he received as a result of the Nobel Prize and as a new generation of German readers explored his work. In one essay, Hesse reflected wryly on his lifelong failure to acquire a talent for idleness and speculated that his average daily correspondence exceeded 150 pages. He died on 9 August 1962, aged 85, and was buried in the cemetery at ": null
    },
    {
        "San Abbondio": "Sant’Abbondio"
    },
    {
        " in ": null
    },
    {
        "Montagnola": "Montagnola"
    },
    {
        ", where ": null
    },
    {
        "Hugo Ball": "Hugo Ball"
    },
    {
        " and the great conductor ": null
    },
    {
        "Bruno Walter": "Bruno Walter"
    },
    {
        " are also buried.           In his time, Hesse was a popular and influential author in the German-speaking world; worldwide fame only came later. Hesses first great novel,  Peter Camenzind , was received enthusiastically by young Germans desiring a different and more natural way of life in this time of great economic and technological progress in the country . Prinz, pp. 139–42  Demian  had a strong and enduring influence on the generation returning home from the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ". Zeller, p. 90 Similarly,  The Glass Bead Game , with its disciplined intellectual world of Castalia and the powers of meditation and humanity, captivated Germans longing for a new order amid the chaos of a broken nation following the loss in the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        ". Zeller, p. 186     Towards the end of his life, German composer ": null
    },
    {
        "Richard Strauss": "Richard Strauss"
    },
    {
        " set three of Hesses poems to music in his song cycle  Four Last Songs  for soprano and orchestra : Frühling , September , and Beim Schlafengehen .     In the 1950s, Hesses popularity began to wane, while literature critics and intellectuals turned their attention to other subjects. In 1955, the sales of Hesses books by his publisher ": null
    },
    {
        "Suhrkamp": "Suhrkamp Verlag"
    },
    {
        " reached an all-time low. However, after Hesses death in 1962, posthumously published writings, including letters and previously unknown pieces of prose, contributed to a new level of understanding and appreciation of his works. Zeller, pp. 180–81     By the time of Hesses death in 1962, his works were still relatively little read in the United States, despite his status as a Nobel laureate. A memorial published in  The New York Times  went so far as to claim that Hesses works were largely inaccessible to American readers. The situation changed in the mid-1960s, when Hesses works suddenly became bestsellers in the United States. Zeller, p. 185 The revival in popularity of Hesses works has been credited to their association with some of the popular themes of the 1960s ": null
    },
    {
        "counterculture": "Counterculture Of The 1960S"
    },
    {
        " movement. In particular, the quest-for-enlightenment theme of  Siddhartha ,  Journey to the East , and  Narcissus and Goldmund  resonated with those espousing counter-cultural ideals. The magic theatre sequences in  Steppenwolf  were interpreted by some as drug-induced ": null
    },
    {
        "psychedelia": "Psychedelia"
    },
    {
        " although there is no evidence that Hesse ever took psychedelic drugs or recommended their use. Zeller p. 189 To a large part, the Hesse boom in the United States can be traced back to enthusiastic writings by two influential counter-culture figures: ": null
    },
    {
        "Colin Wilson": "Colin Wilson"
    },
    {
        " and ": null
    },
    {
        "Timothy Leary": "Timothy Leary"
    },
    {
        ". Zeller, p. 188 From the United States, the Hesse renaissance spread to other parts of the world and even back to Germany: more than 800,000 copies were sold in the German-speaking world from 1972 to 1973. In a space of just a few years, Hesse became the most widely read and translated European author of the 20th century. Hesse was especially popular among young readers, a tendency which continues today. Zeller p. 186     There is a quote from  Demian  on the cover of ": null
    },
    {
        "Santanas": "Santana"
    },
    {
        " 1970 album  Abraxas , revealing the source of the albums title.     Hesses Siddhartha is one of the most popular Western novels set in India. An authorized translation of Siddhartha was published in the Malayalam language in 1990, the language that surrounded Hesses grandfather, Hermann Gundert, for most of his life. A Hermann Hesse Society of India has also been formed. It aims to bring out authentic translations of Siddhartha in all Indian languages and has already prepared the Sanskrit, Hesse, Hermann. Siddhartha. Sanskrit Translation by L. Sulochana Devi. Trivandrum,Hermann Hesse Society of India, 2008    Malayalam Hesse, Hermann. Siddhartha. Malaylam Translation by R. Raman Nair. Trivandrum, CSIS, 1993 and Hindi Hesse, Hermann. Siddhartha. Hindi Translation by Prabakaran, hebbar Illath. Trivandrum,Hermann Hesse Society of India, 2012  translations of Siddhartha.   One enduring monument to Hesses lasting popularity in the United States is the ": null
    },
    {
        "Magic Theatre": "Magic Theatre"
    },
    {
        " in ": null
    },
    {
        "San Francisco": "San Francisco"
    },
    {
        ". Referring to The Magic Theatre for Madmen Only in Steppenwolf , the Magic Theatre was founded in 1967 to perform works by new playwrights. Founded by John Lion, the Magic Theatre has fulfilled that mission for many years, including the world premieres of many plays by Sam Shepard.     There is also a theater in Chicago named after the novel, ": null
    },
    {
        "Steppenwolf Theater": "Steppenwolf Theatre Company"
    },
    {
        ".     Throughout Germany, many schools are named after him. The ": null
    },
    {
        "Hermann-Hesse-Literaturpreis": "Hermann-Hesse-Literaturpreis"
    },
    {
        " is a literary prize associated with the city of ": null
    },
    {
        "Karlsruhe": "Karlsruhe"
    },
    {
        " that has been awarded since 1957.  . karlsruhe.de Since 1990,  the ": null
    },
    {
        "Calw Hermann Hesse Prize": "Calw Hermann Hesse Prize"
    },
    {
        " has been awarded every two years alternately to a German-language literary journal and a translator of Hesses work. . Hermann-hesse.de . Retrieved on 2012-09-23.   The Internationale Hermann-Hesse-Gesellschaft  was founded in 2002 on the 125th birthday of Hesse and began awarding its Hermann Hesse prize in 2017.      Musician ": null
    },
    {
        "Steve Adey": "Steve Adey"
    },
    {
        " adapted the poem How Heavy the Days on his 2017 LP  Do Me a Kindness .     Classic rock band Steppenwolf took their name from Hesses novel.       1906 – Bauernfeld-Preis   1928 – Mejstrik-Preis of the Schiller Foundation in Vienna   1936 – ": null
    },
    {
        "Gottfried-Keller-Preis": "Gottfried-Keller-Preis"
    },
    {
        " Goethe Prize": "Goethe Prize"
    },
    {
        " Nobel Prize in Literature": "Nobel Prize In Literature"
    },
    {
        " University of Bern": "University Of Bern"
    },
    {
        " Wilhelm Raabe Literature Prize": "Wilhelm Raabe Literature Prize"
    },
    {
        " Pour le Mérite": "Pour Le Mérite"
    },
    {
        " Peace Prize of the German Book Trade": "Peace Prize Of The German Book Trade"
    },
    {
        "        Eine Stunde hinter Mitternacht—novella   Hermann Lauscher—collection of poetry and prose    Peter Camenzind —novel   Unterm Rad —novel   Freunde—novella    Gertrud —novel   Besuch aus Indien —nonfiction/philosophy   In the Old Sun—novella    Roßhalde —novel    Knulp  —novel   Schön ist die Jugend—novella    Strange News from Another Star  —collection of short stories written between 1913 and 1918    Demian  —novel    Klein und Wagner —novella   Blick ins Chaos —essays   Klingsors letzter Sommer —novella   Wandering—notes and sketches    Siddhartha —novel    Der Steppenwolf —novel   Narziß und Goldmund —novel   Die Morgenlandfahrt —novel   Das Glasperlenspiel —novel   Poems —poetry   If the War Goes On—essays   Stories of Five Decades —collection of stories   Autobiographical Writings —collection of prose pieces   Crisis: Pages from a Diary—poetry   Hours in the Garden and Other Poems  —poetry        El lobo estepario      Zachariah      Siddhartha   Steppenwolf   Kinderseele   Francesco   Ansatsu      Poem: I Set My Foot Upon the Air and It Carried Me   Siddhartha   Die Heimkehr ": null
    }
]