[
    {
        "Hermann Ebbinghaus was a ": null
    },
    {
        "German": "Germany"
    },
    {
        " psychologist": "Psychology"
    },
    {
        " who pioneered the experimental study of ": null
    },
    {
        "memory": "Memory"
    },
    {
        ", and is known for his discovery of the ": null
    },
    {
        "forgetting curve": "Forgetting Curve"
    },
    {
        " and the ": null
    },
    {
        "spacing effect": "Spacing Effect"
    },
    {
        ". He was also the first person to describe the ": null
    },
    {
        "learning curve": "Learning Curve"
    },
    {
        ". He was the father of the ": null
    },
    {
        "neo-Kantian": "Neo-Kantianism"
    },
    {
        " philosopher ": null
    },
    {
        "Julius Ebbinghaus": "Julius Ebbinghaus"
    },
    {
        ".       Ebbinghaus was born in ": null
    },
    {
        "Barmen": "Barmen"
    },
    {
        ", in the ": null
    },
    {
        "Rhine Province": "Rhine Province"
    },
    {
        " of the ": null
    },
    {
        "Kingdom of Prussia": "Kingdom Of Prussia"
    },
    {
        ", as the son of a wealthy merchant, Carl Ebbinghaus. Little is known about his infancy except that he was brought up in the ": null
    },
    {
        "Lutheran": "Lutheranism"
    },
    {
        " faith and was a pupil at the town ": null
    },
    {
        "Gymnasium": "Gymnasium"
    },
    {
        ". At the age of 17 , he began attending the ": null
    },
    {
        "University of Bonn": "University Of Bonn"
    },
    {
        ", where he had planned to study ": null
    },
    {
        "history": "History"
    },
    {
        " and ": null
    },
    {
        "philology": "Philology"
    },
    {
        ". However, during his time there he developed an interest in ": null
    },
    {
        "philosophy": "Philosophy"
    },
    {
        ". In 1870, his studies were interrupted when he served with the Prussian Army in the ": null
    },
    {
        "Franco-Prussian War": "Franco-Prussian War"
    },
    {
        ". Following this short stint in the military, Ebbinghaus finished his dissertation on ": null
    },
    {
        "Eduard von Hartmanns": "Eduard Von Hartmann"
    },
    {
        "  and received his doctorate on August 16, 1873, when he was 23 years old. During the next three years, he spent time at ": null
    },
    {
        "Halle": "University Of Halle"
    },
    {
        " and ": null
    },
    {
        "Berlin": "University Of Berlin"
    },
    {
        ".        After acquiring his ": null
    },
    {
        "PhD": "Phd"
    },
    {
        ", Ebbinghaus moved around England and France, tutoring students to support himself. In England, he may have taught in two small schools in the south of the country . In ": null
    },
    {
        "London": "London"
    },
    {
        ", in a used bookstore, he came across ": null
    },
    {
        "Gustav Fechners": "Gustav Fechner"
    },
    {
        "book Elemente der Psychophysik , which spurred him to conduct his famous memory experiments. After beginning his studies at the University of Berlin, he founded the third psychological testing lab in Germany . Hermann Ebbinghaus. . Retrieved from International Encyclopedia of the Social Sciences:  He began his memory studies here in 1879. In 1885 — the same year that he published his monumental work, Über das Gedächtnis. Untersuchungen zur experimentellen Psychologie, later published in English under the title Memory: A Contribution to Experimental Psychology Ebbinghaus, H. .. New York, NY: Teachers College. — he was made a professor at the ": null
    },
    {
        "University of Berlin": "University Of Berlin"
    },
    {
        ", most likely in recognition of this publication. In 1890, along with ": null
    },
    {
        "Arthur König": "Arthur König"
    },
    {
        ", he founded the psychological journal Zeitschrift für Physiologie und Psychologie der Sinnesorgane .     In 1894, he was passed over for promotion to head of the philosophy department at ": null
    },
    {
        "Berlin": "University Of Berlin"
    },
    {
        ", most likely due to his lack of publications. Instead, ": null
    },
    {
        "Carl Stumpf": "Carl Stumpf"
    },
    {
        " received the promotion. As a result of this, Ebbinghaus left to join the ": null
    },
    {
        "University of Breslau": "University Of Breslau"
    },
    {
        " , in a chair left open by ": null
    },
    {
        "Theodor Lipps": "Theodor Lipps"
    },
    {
        " . While in ": null
    },
    {
        "Breslau": "Breslau"
    },
    {
        ", he worked on a commission that studied how childrens mental ability declined during the school day. While the specifics on how these mental abilities were measured have been lost, the successes achieved by the commission laid the groundwork for future ": null
    },
    {
        "intelligence testing": "Intelligence Testing"
    },
    {
        ".   At Breslau, he again founded a psychological testing laboratory.     In 1902, Ebbinghaus published his next piece of writing entitled Die Grundzüge der Psychologie . It was an instant success and continued to be long after his death. In 1904, he moved to ": null
    },
    {
        "Halle": "University Of Halle"
    },
    {
        " where he spent the last few years of his life. His last published work, Abriss der Psychologie  was published six years later, in 1908. This, too, continued to be a success, being re-released in eight different editions.  Shortly after this publication, on February 26, 1909, Ebbinghaus died from ": null
    },
    {
        "pneumonia": "Pneumonia"
    },
    {
        " at the age of 59.       Ebbinghaus was determined to show that higher mental processes could actually be studied using ": null
    },
    {
        "experimentation": "Experimentation"
    },
    {
        ", which was in opposition to the popularly held thought of the time. To control for most potentially confounding variables, Ebbinghaus wanted to use simple acoustic encoding and ": null
    },
    {
        "maintenance rehearsal": "Rehearsal"
    },
    {
        " for which a list of words could have been used. As ": null
    },
    {
        "learning": "Learning"
    },
    {
        " would be affected by prior knowledge and understanding, he needed something that could be easily memorized but which had no prior cognitive associations. Easily formable associations with regular words would interfere with his results, so he used items that would later be called ": null
    },
    {
        "nonsense syllables": "Nonsense Syllable"
    },
    {
        " . A nonsense syllable is a ": null
    },
    {
        "consonant": "Consonant"
    },
    {
        "-": null
    },
    {
        "vowel": "Vowel"
    },
    {
        "-consonant combination, where the consonant does not repeat and the syllable does not have prior meaning. BOL and DOT would then not be allowed. However, syllables such as DAX, BOK, and YAT would all be acceptable . After eliminating the meaning-laden syllables, Ebbinghaus ended up with 2,300 resultant syllables. Once he had created his collection of syllables, he would pull out a number of random syllables from a box and then write them down in a notebook. Then, to the regular sound of a ": null
    },
    {
        "metronome": "Metronome"
    },
    {
        ", and with the same voice ": null
    },
    {
        "inflection": "Inflection"
    },
    {
        ", he would read out the syllables, and attempt to ": null
    },
    {
        "recall": "Recall"
    },
    {
        " them at the end of the procedure. One ": null
    },
    {
        "investigation": "Research"
    },
    {
        " alone required 15,000 recitations.     It was later determined that humans impose meaning even on nonsense syllables to make them more meaningful. The nonsense syllable PED turns out to be less nonsensical than a syllable such as KOJ; the syllables are said to differ in ": null
    },
    {
        "association value": "Association Value"
    },
    {
        ". Glaze, J. A. . The association value of non-sense syllables. Pedagogical Seminary and Journal of Genetic Psychology, 35, 255-269. It appears that Ebbinghaus recognized this, and only referred to the strings of syllables as nonsense in that the syllables might be less likely to have a specific meaning and he should make no attempt to make associations with them for easier retrieval.       There are several limitations to his work on memory. The most important one was that Ebbinghaus was the only subject in his study. This limited the studys ": null
    },
    {
        "generalizability": "Generalizability"
    },
    {
        " to the population. Although he attempted to regulate his daily routine to maintain more control over his results, his decision to avoid the use of participants sacrificed the ": null
    },
    {
        "external validity": "External Validity"
    },
    {
        " of the study despite sound ": null
    },
    {
        "internal validity": "Internal Validity"
    },
    {
        ". In addition, although he tried to account for his personal influences, there is an inherent bias when someone serves as researcher as well as participant. Also, Ebbinghauss memory research halted research in other, more complex matters of memory such as ": null
    },
    {
        "semantic": "Semantic"
    },
    {
        " and ": null
    },
    {
        "procedural memory": "Procedural Memory"
    },
    {
        " and ": null
    },
    {
        "mnemonics": "Mnemonics"
    },
    {
        ". Thorne, B., Henley, T. . Hermann Ebbinghaus in Connections in the History and Systems of Psychology . Belmont, CA: Wadsworth Cengage Learning.       In 1885, he published his groundbreaking Über das Gedächtnis  in which he described experiments he conducted on himself to describe the processes of ": null
    },
    {
        "learning": "Learning"
    },
    {
        " and ": null
    },
    {
        "forgetting": "Forgetting"
    },
    {
        ".     Ebbinghaus made several findings that are still relevant and supported to this day. First, Ebbinghaus made a 2,300 three letter syllables to measure mental associations that helped him find that memory is orderly. Second, and arguably his most famous finding, was the ": null
    },
    {
        "forgetting curve": "Forgetting Curve"
    },
    {
        ". The forgetting curve describes the ": null
    },
    {
        "exponential": "Exponential Decay"
    },
    {
        " loss of information that one has learned. T.L. Brink Psychology: A Student Friendly Approach. Unit 7: Memory. pp. 126  The sharpest decline occurs in the first twenty minutes and the decay is significant through the first hour. The curve levels off after about one day.     The ": null
    },
    {
        "learning curve": "Learning Curve"
    },
    {
        " described by Ebbinghaus refers to how fast one learns information. The sharpest increase occurs after the first try and then gradually evens out, meaning that less and less new information is retained after each repetition. Like the forgetting curve, the learning curve is exponential. Ebbinghaus had also documented the ": null
    },
    {
        "serial position effect": "Serial Position Effect"
    },
    {
        ", which describes how the position of an item affects recall. The two main concepts in the serial position effect are recency and primacy. The recency effect describes the increased recall of the most recent information because it is still in the short-term memory. The primacy effect causes better memory of the first items in a list due to increased rehearsal and commitment to long-term memory.     Another important discovery is that of savings. This refers to the amount of information retained in the ": null
    },
    {
        "subconscious": "Subconscious"
    },
    {
        " even after this information cannot be consciously accessed. Ebbinghaus would memorize a list of items until perfect ": null
    },
    {
        "recall": "Recollection"
    },
    {
        " and then would not access the list until he could no longer recall any of its items. He then would relearn the list, and compare the new learning curve to the learning curve of his previous memorization of the list. The second list was generally memorized faster, and this difference between the two learning curves is what Ebbinghaus called savings . Ebbinghaus also described the difference between involuntary and voluntary memory, the former occurring with apparent spontaneity and without any act of the will and the latter being brought into consciousness by an exertion of the will .     Prior to Ebbinghaus, most contributions to the study of memory were undertaken by philosophers and centered on observational description and speculation. For example, ": null
    },
    {
        "Immanuel Kant": "Immanuel Kant"
    },
    {
        " used pure description to discuss recognition and its components and ": null
    },
    {
        "Sir Francis Bacon": "Francis Bacon"
    },
    {
        " claimed that the simple observation of the rote recollection of a previously learned list was no use to the art of memory. This dichotomy between descriptive and experimental study of memory would resonate later in Ebbinghauss life, particularly in his public argument with former colleague ": null
    },
    {
        "Wilhelm Dilthey": "Wilhelm Dilthey"
    },
    {
        ". However, more than a century before Ebbinghaus, ": null
    },
    {
        "Johann Andreas Segner": "Johann Andreas Segner"
    },
    {
        " invented the Segner-wheel to see the length of after-images by seeing how fast a wheel with a hot ": null
    },
    {
        "coal": "Coal"
    },
    {
        " attached had to move for the red ember circle from the coal to appear complete.      Ebbinghauss effect on memory research was almost immediate. With very few works published on memory in the previous two millennia, Ebbinghauss works spurred memory research in the ": null
    },
    {
        "United States": "United States"
    },
    {
        " in the 1890s, with 32 papers published in 1894 alone. This research was coupled with the growing development of mechanized ": null
    },
    {
        "mnemometer": "Mnemometer"
    },
    {
        "s, or devices that aided in the recording and study of memory.     The reaction to his work in his day was mostly positive. Noted psychologist ": null
    },
    {
        "William James": "William James"
    },
    {
        " called the studies heroic and said that they were the single most brilliant investigation in the history of psychology . ": null
    },
    {
        "Edward B. Titchener": "Edward B. Titchener"
    },
    {
        " also mentioned that the studies were the greatest undertaking in the topic of memory since ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        ".       Ebbinghaus can also be credited with pioneering sentence completion exercises, which he developed in studying the abilities of schoolchildren. It was these same exercises that ": null
    },
    {
        "Alfred Binet": "Alfred Binet"
    },
    {
        " had borrowed and incorporated into the ": null
    },
    {
        "Binet-Simon intelligence scale": "Iq"
    },
    {
        ". Sentence completion had since then also been used extensively in memory research, especially in tapping into measures of ": null
    },
    {
        "implicit memory": "Implicit Memory"
    },
    {
        ", and also has been used in ": null
    },
    {
        "psychotherapy": "Psychotherapy"
    },
    {
        " as a tool to help tap into the motivations and drives of the patient. He had also influenced ": null
    },
    {
        "Charlotte Bühler": "Charlotte Bühler"
    },
    {
        ", who along with ": null
    },
    {
        "Lev Vygotsky": "Lev Vygotsky"
    },
    {
        " and others went on to study ": null
    },
    {
        "language": "Language"
    },
    {
        " meaning and ": null
    },
    {
        "society": "Society"
    },
    {
        ".    Ebbinghaus is also credited with discovering an ": null
    },
    {
        "optical illusion": "Optical Illusion"
    },
    {
        " now known after its discoverer—the ": null
    },
    {
        "Ebbinghaus illusion": "Ebbinghaus Illusion"
    },
    {
        ", which is an illusion of relative size perception. In the best-known version of this illusion, two circles of identical size are placed near to each other and one is surrounded by large circles while the other is surrounded by small circles; the first central circle then appears smaller than the second central circle. This illusion is now used extensively in research in ": null
    },
    {
        "cognitive psychology": "Cognitive Psychology"
    },
    {
        ", to find out more about the various ": null
    },
    {
        "perception": "Perception"
    },
    {
        " pathways in our ": null
    },
    {
        "brain": "Human Brain"
    },
    {
        ".     Ebbinghaus is also largely credited with drafting the first standard research report. In his paper on memory, Ebbinghaus arranged his research into four sections: the introduction, the methods, the results, and a discussion section. The clarity and organization of this format was so impressive to contemporaries that it has now become standard in the discipline, and all research reports follow the same standards laid out by Ebbinghaus.     After Ebbinghaus worked on memory, he also had a contribution with color vision. In 1890, Ebbinghaus came up with the double pyramid design where corners were rounded off.     Unlike notable contemporaries like Titchener and James, Ebbinghaus did not promote any specific ": null
    },
    {
        "school of psychology": "School Of Psychology"
    },
    {
        " nor was he known for extensive lifetime research, having done only three works. He never attempted to bestow upon himself the title of the pioneer of ": null
    },
    {
        "experimental psychology": "Experimental Psychology"
    },
    {
        ", did not seek to have any ": null
    },
    {
        "disciples": "Wikt:Disciple"
    },
    {
        " , and left the exploitation of the new field to others.       In addition to pioneering experimental psychology, Ebbinghaus was also a strong defender of this direction of the new science, as is illustrated by his public dispute with University of Berlin colleague, ": null
    },
    {
        "Wilhelm Dilthey": "Wilhelm Dilthey"
    },
    {
        ". Shortly after Ebbinghaus left Berlin in 1893, Dilthey published a paper extolling the virtues of descriptive psychology, and condemning experimental psychology as boring, claiming that the ": null
    },
    {
        "mind": "Mind"
    },
    {
        " was too complex, and that ": null
    },
    {
        "introspection": "Introspection"
    },
    {
        " was the desired method of studying the mind. The debate at the time had been primarily whether psychology should aim to explain or understand the mind and whether it belonged to the ": null
    },
    {
        "natural": "Natural Sciences"
    },
    {
        " or ": null
    },
    {
        "human sciences": "Human Sciences"
    },
    {
        ". Many had seen Diltheys work as an outright attack on experimental psychology, Ebbinghaus included, and he responded to Dilthey with a personal letter and also a long scathing public article. Amongst his counterarguments against Dilthey he mentioned that it is inevitable for psychology to do ": null
    },
    {
        "hypothetical": "Hypothetical"
    },
    {
        " work and that the kind of psychology that Dilthey was attacking was the one that existed before Ebbinghauss experimental revolution . ": null
    },
    {
        "Charlotte Bühler": "Charlotte Bühler"
    },
    {
        " echoed his words some forty years later, stating that people like Ebbinghaus buried the old psychology in the 1890s . Ebbinghaus explained his scathing review by saying that he could not believe that Dilthey was advocating the ": null
    },
    {
        "status quo": "Status Quo"
    },
    {
        " of ": null
    },
    {
        "structuralists": "Structuralism"
    },
    {
        " like ": null
    },
    {
        "Wilhelm Wundt": "Wilhelm Wundt"
    },
    {
        " and Titchener and attempting to stifle psychologys progress.     Some contemporary texts still describe Ebbinghaus as a philosopher rather than a psychologist and he had also spent his life as a professor of philosophy. However, Ebbinghaus himself would probably describe himself as a psychologist considering that he fought to have psychology viewed as a separate discipline from philosophy.       There has been some speculation as to what influenced Ebbinghaus in his undertakings. None of his professors seem to have influenced him, nor are there suggestions that his colleagues affected him. Von Hartmanns work, on which Ebbinghaus based his doctorate, did suggest that higher mental processes were hidden from view, which may have spurred Ebbinghaus to attempt to prove otherwise. The one influence that has always been cited as having inspired Ebbinghaus was ": null
    },
    {
        "Gustav Fechners": "Gustav Fechner"
    },
    {
        "two-volume Elemente der Psychophysik. , a book which he purchased second-hand in England. It is said that the meticulous mathematical procedures impressed Ebbinghaus so much that he wanted to do for ": null
    },
    {
        "psychology": "Psychology"
    },
    {
        " what Fechner had done for ": null
    },
    {
        "psychophysics": "Psychophysics"
    },
    {
        ". This inspiration is also evident in that Ebbinghaus dedicated his second work Principles of Psychology to Fechner, signing it I owe everything to you.    New York: Dover.   Ebbinghaus, H. . Grundzüge der Psychologie. Leipzig: Veit & Co.   Ebbinghaus, H. . https://archive.org/details/cu31924029211286 Psychology: An elementary textbook.": null
    }
]