[
    {
        "The Hero System is a ": null
    },
    {
        "generic role-playing game system": "Generic Role-Playing Game System"
    },
    {
        " that was developed from the ": null
    },
    {
        "superhero": "Superhero"
    },
    {
        " RPG": "Role Playing Game"
    },
    {
        "  Champions . After Champions fourth edition was released in 1989, a stripped-down version of its ruleset with no superhero or other genre elements was released as The Hero System Rulesbook in 1990. As a spinoff of Champions, the Hero System is considered to have started with 4th edition , rather than on its own with a 1st edition. However, the first three editions of the game are typically referred to as Champions, rather than the Hero System, as the game for its first three editions was not sold as a universal toolkit, instead largely focusing on superheroes.     The Hero System is used as the underlying ": null
    },
    {
        "mechanics": "Game Mechanics"
    },
    {
        " of other ": null
    },
    {
        "Hero Games": "Hero Games"
    },
    {
        " role-playing games such as  Fantasy Hero ,  Star Hero , and  Pulp Hero . It is characterized by point-based character creation and the rigor with which it measures character abilities. It uses only six-sided ": null
    },
    {
        "dice": "Dice"
    },
    {
        ".       The Hero System uses Champions key system features. Tasks are resolved using three six-sided dice and power effects are resolved by rolling a number of dice based on the powers strength.     Like Champions, it uses a tool-kit approach to creating effects. While the system does have more typical features of many RPGs, such as a skill system, most abilities in the Hero System rules are listed as generic powers . Most powers are meant to be able to model a vast number of potential effects. When creating a character, a player decides on what effect they wish to create, then constructs this effect by consulting the powers in the rulebook. Most powers have a set of modifiers that alter their base performance to more finely-tune their representation of the effect desired. Each such modifier makes the power more or less capable, and correspondingly more or less expensive to purchase with character points . The result is that many effects are possible from exactly the same base power. For example, while systems such as ": null
    },
    {
        "Dungeons & Dragons": "Dungeons  &  Dragons"
    },
    {
        " would list a wide variety of separate ranged attack powers that deal damage , the vast majority of such effects in the Hero System would be constructed out of the same base two powers, Blast or Killing Attack .     The Hero System rules only define an abilitys very basic mechanical effects—the player is the one who defines what the ability looks like when used. For example, if a player wishes to model the ability to project a jet of fire, they could choose the Blast power. However, the powers text has no mention of what it looks like or how it operates beyond some very base notes concerning damage and range. To make it a jet of fire, the player simply states that this Blast is a jet of fire. To some degree this is simply cosmetic. However, in the game, that power now is treated as a fire attack, with all that implies as decided by the gamemaster in each situation: it has the possibility of starting secondary fires; it looks, smells and sounds like a jet of fire; will not work in water; will terrify people with a phobia of fire; etc. The system does have mechanical effect alterations as well: a Blast could be altered by any number of power modifiers such as Explosion , Area of Effect , Megascale , etc.: both advantages and disadvantages are available. As players are typically attempting to model something with at least a partial real-life analogue, limitations on a power are as much about making it more accurate a representation as they are making it less expensive to purchase . The system also allows players to construct very exacting modifiers not specifically detailed in the base rules. For example, a player could define one or more powers as not working when the moon is full, or when it is Tuesday, or any other limitation that the player can imagine and the gamemaster feels is applicable.     Also like Champions, the Hero System uses a point-based system for character creation. Instead of templates which define what a character is, how it performs mechanically, and the new abilities gained after a certain amount of play, a player is given a fixed number of points and allowed to create what they want. As this is a much more freeform process than in most games, the system encourages close involvement between players and gamemasters to ensure that all participants have the same understanding regarding the type of effects permitted, relative power levels, and the like.       Each player creates his character starting with a pool of points to buy abilities , increase characteristics and buy skills . This pool can be increased by taking disadvantages for your character . The initial pool, as well as the final pool size, is determined by the ": null
    },
    {
        "Game Master": "Gamemaster"
    },
    {
        " , as well as the point limits on each individual ability.          Unlike the ": null
    },
    {
        "d20 System": "D20 System"
    },
    {
        " and many other game systems, experience awards are in the form of character points, which have the same value as those used in character creation and can be applied directly to the characters abilities upon receipt.       The powers system are the variables players can manipulate in the characters of Hero System. The powers in the Hero System are categorized roughly as follows:     :Adjustment Powers — Modify the Characteristics of self or another.   :Attack Powers — Inflict physical damage or some other negative effect on an opponent.   :Body-Affecting Powers — Change shape, size, density, etc.   :Defense Powers — Protect against an attack or mishap.   :Mental Powers — Detect and/or affect the mind of another.   :Movement Powers — Employ various forms of movement.   :Sense-Affecting Powers — Alter or hinder a characters senses.   :Sensory Powers — Improve or expand upon the sensory abilities.   :Size Powers — Growth and Shrinking.   :Special Powers — Powers with some unusual quality, including ones that do not fall into the other categories.   :Standard Powers — A catch-all for Powers that are not Adjustment, Mental, Movement, Size, or Special Powers.     Within each of these categories are multiple Powers that have more specialized effects. Thus for the movement category there are powers that can be used for ": null
    },
    {
        "Running": "Running"
    },
    {
        ", ": null
    },
    {
        "Swimming": "Human Swimming"
    },
    {
        ", ": null
    },
    {
        "Climbing": "Climbing"
    },
    {
        ", ": null
    },
    {
        "Leaping": "Jumping"
    },
    {
        ", ": null
    },
    {
        "Gliding": "Gliding"
    },
    {
        ", ": null
    },
    {
        "Flying": "Flight"
    },
    {
        ", ": null
    },
    {
        "Tunnel": "Tunnel"
    },
    {
        "ing through solid surfaces, and even ": null
    },
    {
        "Teleportation": "Teleportation"
    },
    {
        ". For certain game ": null
    },
    {
        "genres": "Genre"
    },
    {
        " there are even powers for traveling to other dimensions or moving faster than light.     Also, many Powers appear in at least two categories. For example, most Attack Powers are also Standard Powers, and Size Powers are basically just a subcategory of Body-Affecting Powers. Darkness is in three categories — Standard, Attack, and Sense-Affecting.       Each power has a base point cost for a given effect. This could be, for example, a certain number of points per six-sided-die of damage inflicted upon a foe.     Powers can have both advantages and limitations. Both are modifiers applied at different stages in calculating cost. These modifiers are typically changes of ±¼, but can range up to ±2 or even higher.     After the base cost is calculated, advantages are applied. These, which can make a power more useful, typically expand its effectiveness or make it more powerful, and thus make it more expensive. Once advantages are applied, the base cost becomes the Active Cost.     The Active Cost is calculated as an intermediate step as it is required to calculate certain figures, such as range, END usage, difficulty of activation rolls, and other things.     The formula for calculating the Active Cost is:   :Active Cost Base Cost & times;      Once Active Cost is calculated, limitations are applied. These represent shortcomings in the power, lessened reliability or situations in which the power can not be used. Limitations are added separately as positive numbers, even though they are listed as negative.     The Real Cost of the power is then determined by:   :Real Cost Active Cost /      The Real Cost is the amount the character must actually pay for the Power.       The rules also include schemes for providing a larger number of powers to a character for a given cost. These power frameworks reduce the cost either by requiring the group of powers to have a common theme as in an Elemental Control Framework, or by limiting the number of powers that can be active at one time with a Multipower Framework. Powers within a framework can share common limitations, further reducing the cost. A third type of power framework, the Variable Power Pool , trades thrift for flexibility. With it, powers can be arbitrarily chosen on the fly, granting enhanced in-game flexibility. The price is a premium on points, called the Control Cost. Additionally, it is marked as potentially unbalancing, so not all GMs will permit VPPs.     Elemental Controls were eliminated in the Sixth Edition.            Although several games based on what would become known as the Hero System were published in the 1980s, including  Champions ,  Danger International ,  Justice, Inc. ,  Robot Warriors  and the original versions of  Fantasy Hero  and  Star Hero , each of the RPGs was self-contained, much as ": null
    },
    {
        "Chaosiums": "Chaosium"
    },
    {
        " Basic Role-Playing": "Basic Role-Playing"
    },
    {
        " games are. The Hero System itself was not released as an independent entity until 1990, as ": null
    },
    {
        "Steve Jackson Games": "Steve Jackson Games"
    },
    {
        "  GURPS   became more popular. As a joint venture between Hero Games and ": null
    },
    {
        "Iron Crown Enterprises": "Iron Crown Enterprises"
    },
    {
        ", a stand-alone Hero System Rulebook was published alongside the fourth edition of Champions. The content was identical to the opening sections of the Champions rules, but all genre-related material was removed. Afterward, genre books such as Ninja Hero  and  Fantasy Hero  were published as sourcebooks for the Hero System Rulebook as opposed to being independent games.     With the collapse of the Hero-ICE alliance, the Hero System went into limbo for several years. The Champions franchise released a new version under the ": null
    },
    {
        "Fuzion": "Fuzion"
    },
    {
        " system, which had been a joint development with ": null
    },
    {
        "R. Talsorian Games": "R. Talsorian Games"
    },
    {
        ", called Champions: the New Millennium. Although two editions were published, it was very poorly received by Champions fans. In 2001, a reconstituted Hero Games was formed under the leadership of ": null
    },
    {
        "Steven S. Long": "Steven S. Long"
    },
    {
        ", who had written several books for the earlier version of the system. It regained the rights to the Hero System and to the Champions trademark.     In 2001, the Fifth Edition of the Hero System Rulebook was released, incorporating heavy revisions by Long. A large black hardcover, it was critically well received and attained a degree of commercial success.  The Fifth Edition is often referred to as FREd , which is a ": null
    },
    {
        "backronym": "Backronym"
    },
    {
        " for Fifth Rules Edition . The name actually comes from Steve S. Longs reply when asked what the standard abbreviation for the Fifth Edition would be: I dont care if you call it Fred, as long as you buy it. This was made the unofficial nickname by several replies on the same board affirming it after a reply from Willpower, who coined the backronym by saying, OK. FREd it is, Fifth Rules Edition !     A revised version  was issued in 2004, along with Hero System Sidekick, a condensed version of the rulebook with a cover price of under $10. Fans often call the revised Fifth Edition Fiver, ReFREd, or 5ER . This rulebook is so big that some fans speculated that it might be bulletproof, and it did indeed stop some bullets when tested by Hero Games staffers.     hosted at ": null
    },
    {
        "YouTube": "Youtube"
    },
    {
        ".     On February 28, 2008, ": null
    },
    {
        "Cryptic Studios": "Cryptic Studios"
    },
    {
        " purchased the Champions ": null
    },
    {
        "intellectual property": "Intellectual Property"
    },
    {
        ", and sold the rights back to Hero Games to publish the 6th edition books. One of the new features will be to allow players to adapt their  Champions Online  characters to the pen-and-paper game.      On 28 November 2011, Hero Games announced a restructuring, with Darren Watts and long-time developer Steven S. Long relinquishing their full-time statuses to work freelance. In late 2012 Champions Complete was released, which contained all of the core 6th edition rules as well as enough information to play a superhero campaign in a single 240-page book. This compact presentation reflected criticism that the 6th edition rules had become too unwieldy.       Heromaker , an ": null
    },
    {
        "MS-DOS": "Ms-Dos"
    },
    {
        " program, was distributed with some versions of ": null
    },
    {
        "Champions": "Champions"
    },
    {
        ". Today, Hero Designer , vendor website for the Fifth and Sixth Editions is available on several platforms, and is supported by numerous character packs and other extensions linked to Hero Games book releases. In late 2008, Hero released a licensed RPG for ": null
    },
    {
        "Aaron Williamss": "Aaron Williams"
    },
    {
        " popular comic ": null
    },
    {
        "PS238": "Ps238"
    },
    {
        " using a simplified version of the Fifth Edition rules.     In late 2009, Hero Games released the 6th Edition of the Hero System. The game has so far had a mostly positive reception, with little in the way of Edition Wars. The largest rules change was the removal of Figured Characteristics . Other, more minor rules changes include folding Armor and Force field into Resistant Defense and reestablishing Regeneration as a separate power. The rules were released in two volumes, with the first covering character creation in depth and the second describing campaigns and the running of games. The new genre book for Champions came out shortly thereafter, and a new Fantasy Hero was released in the summer of 2010. A new version of Sidekick was released in late 2009 under the title The Hero System Basic Rulebook, while an Advanced Player Guide was published that had additional options for character creation. Other recent releases included a large book of pre-constructed Powers, a set of pre-generated Martial Arts styles, abilities and skills, a large bestiary, a new ": null
    },
    {
        "grimoire": "Grimoire"
    },
    {
        " for Fantasy Hero and a three-volume set of villains for Champions. A new edition of Star Hero was released in 2011, along with a second Advanced Player Guide.     Hero Games now maintains an irregular release schedule, with a minimal staff, and has successfully used ": null
    },
    {
        "Kickstarter": "Kickstarter"
    },
    {
        " to raise funds for new projects. One of these new products, Fantasy Hero Complete": null
    }
]