[
    {
        "In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", specifically ": null
    },
    {
        "commutative algebra": "Commutative Algebra"
    },
    {
        ", Hilberts basis theorem says that a ": null
    },
    {
        "polynomial ring": "Polynomial Ring"
    },
    {
        " over a ": null
    },
    {
        "Noetherian ring": "Noetherian Ring"
    },
    {
        " is Noetherian.         If R is a ring, let R denote the ring of polynomials in the indeterminate X over R . ": null
    },
    {
        "Hilbert": "David Hilbert"
    },
    {
        " proved that if R is not too large , in the sense that if R is Noetherian, the same must be true for R . Formally,     Hilberts Basis Theorem. If R is a Noetherian ring, then R is a Noetherian ring.     Corollary. If R is a Noetherian ring, then R is a Noetherian ring.     This can be translated into ": null
    },
    {
        "algebraic geometry": "Algebraic Geometry"
    },
    {
        " as follows: every ": null
    },
    {
        "algebraic set": "Algebraic Set"
    },
    {
        " over a field can be described as the set of common roots of finitely many polynomial equations.  proved the theorem in the course of his proof of finite generation of rings of invariants.     Hilbert produced an innovative proof by contradiction using ": null
    },
    {
        "mathematical induction": "Mathematical Induction"
    },
    {
        "; his method does not give an ": null
    },
    {
        "algorithm": "Algorithm"
    },
    {
        " to produce the finitely many basis polynomials for a given ideal: it only shows that they must exist. One can determine basis polynomials using the method of ": null
    },
    {
        "Gröbner bases": "Gröbner Basis"
    },
    {
        ".       :Theorem. If R is a left ": null
    },
    {
        "Noetherian ring": "Noetherian Ring"
    },
    {
        ", then the ": null
    },
    {
        "polynomial ring": "Polynomial Ring"
    },
    {
        " R is also a left Noetherian ring.     Remark. We will give two proofs, in both only the left case is considered; the proof for the right case is similar.         Suppose   a   R is a non-finitely generated left-ideal. Then by recursion  there is a sequence   of polynomials such that if   bn is the left ideal generated by f0,   f then fn     a     bn is of minimal degree. It is clear that   is a non-decreasing sequence of naturals. Let an be the leading coefficient of fn and let   be the left ideal in R generated by a0,a1,  . Since R is Noetherian the chain of ideals     :           must terminate. Thus   b for some integer N . So in particular,     : aN ": null
    }
]