[
    {
        "The ": null
    },
    {
        "African Great Lakes": "African Great Lakes"
    },
    {
        " nation of  Tanzania  dates formally from 1964, when it was formed out of the union of the much larger mainland territory of ": null
    },
    {
        "Tanganyika": "Tanganyika"
    },
    {
        " and the coastal archipelago of ": null
    },
    {
        "Zanzibar": "Zanzibar"
    },
    {
        ". The former was a colony and part of ": null
    },
    {
        "German East Africa": "German East Africa"
    },
    {
        " from the 1880s to 1919, when, under the ": null
    },
    {
        "League of Nations": "League Of Nations"
    },
    {
        ", it became a British ": null
    },
    {
        "mandate": "League Of Nations Mandate"
    },
    {
        ". It served as a British military outpost during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", providing financial help, munitions, and soldiers. In 1947, Tanganyika became a ": null
    },
    {
        "United Nations Trust Territory": "United Nations Trust Territory"
    },
    {
        " under British administration, a status it kept until its independence in 1961. The island of Zanzibar thrived as a trading hub, subsequently controlled by the Portuguese, the Sultanate of Oman, and then as a British ": null
    },
    {
        "protectorate": "Protectorate"
    },
    {
        " by the end of the nineteenth century.     ": null
    },
    {
        "Julius Nyerere": "Julius Nyerere"
    },
    {
        ", independence leader and baba wa taifa for Tanganyika , ruled the country for decades, while ": null
    },
    {
        "Abeid Amaan Karume": "Abeid Karume"
    },
    {
        ", governed Zanzibar as its president and Vice President of the United Republic of Tanzania. Following Nyereres retirement in 1985, various political and economic reforms began. He was succeeded in office by President ": null
    },
    {
        "Ali Hassan Mwinyi": "Ali Hassan Mwinyi"
    },
    {
        ".           Tanzania is home to some of the oldest ": null
    },
    {
        "hominid": "Hominid"
    },
    {
        " settlements unearthed by ": null
    },
    {
        "archaeologists": "Archaeology"
    },
    {
        ". Prehistoric stone tools and fossils have been found in and around ": null
    },
    {
        "Olduvai Gorge": "Olduvai Gorge"
    },
    {
        " in northern Tanzania, an area often referred to as The Cradle of Mankind . ": null
    },
    {
        "Acheulian": "Acheulian"
    },
    {
        " stone tools were discovered there in 1931 by ": null
    },
    {
        "Louis Leakey": "Louis Leakey"
    },
    {
        ", after he had correctly identified the rocks brought back by ": null
    },
    {
        "Hans Reck": "Hans Reck"
    },
    {
        " to Germany from his 1913 Olduvai expedition as stone tools. The same year, Louis Leakey found older, more primitive stone tools in Olduvai Gorge. These were the first examples of the oldest human technology ever discovered in Africa, and were subsequently known throughout the world as ": null
    },
    {
        "Oldowan": "Oldowan"
    },
    {
        " after Olduvai Gorge.  The first hominid skull in Olduvai Gorge was discovered by ": null
    },
    {
        "Mary Leakey": "Mary Leakey"
    },
    {
        " in 1959, and named ": null
    },
    {
        "Zinj or Nutcracker Man": "Oh 5"
    },
    {
        ", the first example of  Paranthropus boisei , and is thought to be over 1.8 million years old. Other finds including  Homo habilis  fossils were subsequently made. At nearby ": null
    },
    {
        "Laetoli": "Laetoli"
    },
    {
        " the oldest known hominid footprints, the ": null
    },
    {
        "Laetoli footprints": "Laetoli Footprints"
    },
    {
        ", were discovered by ": null
    },
    {
        "Mary Leakey": "Mary Leakey"
    },
    {
        " in 1978, and estimated to be about 3.6 million years old and probably made by  Australopithecus afarensis .  The oldest hominid fossils ever discovered in Tanzania also come from Laetoli and are the 3.6 to 3.8 million year old remains of  Australopithecus afarensis —": null
    },
    {
        "Louis Leakey": "Louis Leakey"
    },
    {
        " had found what he thought was a baboon tooth at Laetoli in 1935 , a fragment of hominid jaw with three teeth was found there by ": null
    },
    {
        "Kohl-Larsen": "Kohl-Larsen"
    },
    {
        " in 1938–39, and in 1974–75 ": null
    },
    {
        "Mary Leakey": "Mary Leakey"
    },
    {
        " recovered 42 teeth and several jawbones from the site.        ": null
    },
    {
        "Mumba Cave": "Mumba Cave"
    },
    {
        " in northern Tanzania includes a ": null
    },
    {
        "Middle Stone Age": "Middle Stone Age"
    },
    {
        " to ": null
    },
    {
        "Later Stone Age": "Later Stone Age"
    },
    {
        " archaeological sequence. The MSA represents the time period in Africa during which many archaeologists see the origins of ": null
    },
    {
        "modern human behavior": "Behavioral Modernity"
    },
    {
        ".        Reaching back about 10,000 years in the ": null
    },
    {
        "Later Stone Age": "Later Stone Age"
    },
    {
        ", Tanzania is believed to have been populated by ": null
    },
    {
        "hunter-gatherer": "Hunter-Gatherer"
    },
    {
        " communities, probably ": null
    },
    {
        "Khoisan": "Khoisan Languages"
    },
    {
        "-speaking people. Between approximately 4,000 to 3,000 years ago, during a time period known as the ": null
    },
    {
        "Pastoral Neolithic": "Pastoral Neolithic"
    },
    {
        ", pastoralists who relied on cattle, sheep, goats, and donkeys came into Tanzania from the north.  Two archaeological cultures are known from this time period, the ": null
    },
    {
        "Savanna Pastoral Neolithic": "Savanna Pastoral Neolithic"
    },
    {
        " and the ": null
    },
    {
        "Elmenteitan": "Elmenteitan"
    },
    {
        " . ": null
    },
    {
        "Luxmanda": "Luxmanda"
    },
    {
        " is the largest and southernmost-known Pastoral Neolithic site in Tanzania.        About 2000 years ago, ": null
    },
    {
        "Bantu-speaking people": "Bantu Languages"
    },
    {
        " began to arrive from western Africa in a series of migrations collectively referred to as the ": null
    },
    {
        "Bantu expansion": "Bantu Expansion"
    },
    {
        ". These groups brought and developed ironworking skills, agriculture, and new ideas of social and political organization. They absorbed many of the ": null
    },
    {
        "Cushitic": "Cushitic"
    },
    {
        " peoples who had preceded them, as well as most of the remaining Khoisan-speaking inhabitants. Later, ": null
    },
    {
        "Nilotic": "Nilotic"
    },
    {
        " pastoralists arrived, and continued to immigrate into the area through to the 18th century.       One of Tanzanias most important Iron Age archeological sites is ": null
    },
    {
        "Engaruka": "Engaruka"
    },
    {
        " in the ": null
    },
    {
        "Great Rift Valley": "Great Rift Valley"
    },
    {
        ", which includes an irrigation and cultivation system.         Travellers and merchants from the Persian Gulf and Western India have visited the East African coast since early in the first millennium ": null
    },
    {
        "CE": "Common Era"
    },
    {
        ". Greek texts such as the  Periplus of the Erythraean Sea  and ": null
    },
    {
        "Ptolemys": "Ptolemy"
    },
    {
        " Geography list a string of market places along the coast. Finds of Roman-era coins along the coast confirm the existence of trade, and Ptolomeys Geography refers to a town of ": null
    },
    {
        "Rhapta": "Rhapta"
    },
    {
        " as metropolis of a political entity called ": null
    },
    {
        "Azania": "Azania"
    },
    {
        ". Archaeologists have not yet succeeded in identifying the location of Rhapta, though many believe it lies deeply buried in the silt of the delta of the Rufiji River. A long documentary silence follows these ancient texts, and it is not until Arab geographical treatises were written about the coast that our information resumes.     Remains of those towns material culture demonstrate that they arose from indigenous roots, not from foreign settlement. And the language that was spoken in them, Swahili , is a member of the Bantu language family that spread from the northern Kenya coast well before significant Arab presence was felt in the region. By the beginning of the second millennium CE the Swahili towns conducted a thriving trade that linked Africans in the interior with trade partners throughout the Indian Ocean. From c. 1200 to 1500 CE, the town of ": null
    },
    {
        "Kilwa": "Kilwa Kisiwani"
    },
    {
        ", on Tanzanias southern coast, was perhaps the wealthiest and most powerful of these towns, presiding over what some scholars consider the golden age of Swahili civilization. In the early 14th century, ": null
    },
    {
        "Ibn Battuta": "Ibn Battuta"
    },
    {
        ", a Berber traveller from North Africa, visited Kilwa and proclaimed it one of the best cities in the world. Islam was practised on the Swahili coast as early as the eighth or ninth century CE. The Swahili: The Social Landscape of a Mercantile Society, authored by Mark Horton and John Middleton, published by Wiley, 2001 The Swahili: Reconstructing the History and Language of an African Society, 800-1500, authored by Derek Nurse and Thomas Spear, University of Pennsylvania Press, 1985     In 1498, ": null
    },
    {
        "Portuguese": "Portugal"
    },
    {
        " explorer ": null
    },
    {
        "Vasco da Gama": "Vasco Da Gama"
    },
    {
        " became the first known European to reach the ": null
    },
    {
        "African Great Lakes": "African Great Lakes"
    },
    {
        " coast; he stayed for 32 days.  In 1505 the Portuguese captured the island of Zanzibar.  Portuguese control lasted until the early 18th century, when Arabs from ": null
    },
    {
        "Oman": "Oman"
    },
    {
        " established a foothold in the region. Assisted by Omani Arabs, the indigenous coastal dwellers succeeded in driving the Portuguese from the area north of the ": null
    },
    {
        "Ruvuma River": "Ruvuma River"
    },
    {
        " by the early 18th century. Claiming the coastal strip, Omani Sultan ": null
    },
    {
        "Seyyid Said": "Said Bin Sultan"
    },
    {
        " moved his capital to ": null
    },
    {
        "Zanzibar City": "Zanzibar City"
    },
    {
        " in 1840. He focused on the island and developed trade routes that stretched as far as ": null
    },
    {
        "Lake Tanganyika": "Lake Tanganyika"
    },
    {
        " and ": null
    },
    {
        "Central Africa": "Central Africa"
    },
    {
        ". During this time, Zanzibar became the centre for the ": null
    },
    {
        "Arab slave trade": "Arab Slave Trade"
    },
    {
        ". Due to the Arab and Persian domination at this later time, many Europeans misconstrued the nature of Swahili civilization as a product of Arab colonization. However, this misunderstanding has begun to dissipate over the past 40 years as Swahili civilization is becoming recognized as principally African in origin.          ": null
    },
    {
        "Tanganyika": "Tanganyika"
    },
    {
        " as a geographical and political entity did not take shape before the period of ": null
    },
    {
        "High Imperialism": "New Imperialism"
    },
    {
        "; its name only came into use after ": null
    },
    {
        "German East Africa": "German East Africa"
    },
    {
        " was transferred to the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " as a mandate by the ": null
    },
    {
        "League of Nations": "League Of Nations"
    },
    {
        " in 1920. What is referred to here, therefore, is the history of the region that was to become Tanzania. A part of the ": null
    },
    {
        "Great Lakes": "Great Lakes"
    },
    {
        " region, namely the western shore of ": null
    },
    {
        "Lake Victoria": "Lake Victoria"
    },
    {
        " consisted of many small kingdoms, most notably ": null
    },
    {
        "Karagwe": "Karagwe"
    },
    {
        " and ": null
    },
    {
        "Buzinza": "Buzinza"
    },
    {
        ", which were dominated by their more powerful neighbors ": null
    },
    {
        "Rwanda": "Rwanda"
    },
    {
        ", ": null
    },
    {
        "Burundi": "Burundi"
    },
    {
        ", and ": null
    },
    {
        "Buganda": "Buganda"
    },
    {
        ".     European exploration of the interior began in the mid-19th century. In 1848 the German missionary ": null
    },
    {
        "Johannes Rebmann": "Johannes Rebmann"
    },
    {
        " became the first European to see ": null
    },
    {
        "Mount Kilimanjaro": "Mount Kilimanjaro"
    },
    {
        ".  British explorers ": null
    },
    {
        "Richard Burton": "Richard Francis Burton"
    },
    {
        " and ": null
    },
    {
        "John Speke": "John Speke"
    },
    {
        " crossed the interior to ": null
    },
    {
        "Lake Tanganyika": "Lake Tanganyika"
    },
    {
        " in June 1857.  In January 1866, the Scottish explorer and missionary ": null
    },
    {
        "David Livingstone": "David Livingstone"
    },
    {
        ", who crusaded against the slave trade, went to Zanzibar, from where he sought the source of the Nile, and established his last mission at ": null
    },
    {
        "Ujiji": "Ujiji"
    },
    {
        " on the shores of Lake Tanganyika. After having lost contact with the outside world for years, he was found there on 10 November 1871. ": null
    },
    {
        "Henry Morton Stanley": "Henry Morton Stanley"
    },
    {
        ", who had been sent in a publicity stunt to find him by the New York Herald newspaper, greeted him with the now famous words Dr Livingstone, I presume? In 1877, the first of a series of Belgian expeditions arrived on Zanzibar. In the course of these expeditions, in 1879 a station was founded in ": null
    },
    {
        "Kigoma": "Kigoma"
    },
    {
        " on the eastern bank of Lake Tanganyika, soon to be followed by the station of ": null
    },
    {
        "Mpala": "Mpala"
    },
    {
        " on the opposite western bank. Both stations were founded in the name of the Comite DEtudes Du Haut Congo, a predecessor organization of the ": null
    },
    {
        "Congo Free State": "Congo Free State"
    },
    {
        ". German colonial interests were first advanced in 1884.   ": null
    },
    {
        "Karl Peters": "Karl Peters"
    },
    {
        ", who formed the ": null
    },
    {
        "Society for German Colonization": "Society For German Colonization"
    },
    {
        ", concluded a series of treaties by which tribal chiefs ceded territory to the society.  Prince ": null
    },
    {
        "Otto von Bismarcks": "Otto Von Bismarck"
    },
    {
        " government in 1885 granted imperial protection to the ": null
    },
    {
        "German East Africa Company": "German East Africa Company"
    },
    {
        " established by Peters with Bismarks encouragement.      At the ": null
    },
    {
        "Berlin Conference": "Berlin Conference"
    },
    {
        " of 1885, the fact that Kigoma had been established and supplied from ": null
    },
    {
        "Zanzibar": "Zanzibar"
    },
    {
        " and ": null
    },
    {
        "Bagamoyo": "Bagamoyo"
    },
    {
        " led to the inclusion of ": null
    },
    {
        "German East Africa": "German East Africa"
    },
    {
        " into the territory of the ": null
    },
    {
        "Conventional Basin of the Congo": "Conventional Basin Of The Congo"
    },
    {
        ", to Belgiums advantage. At the table in Berlin, contrary to widespread perception, Africa was not partitioned; rather, rules were established among the colonial powers and prospective colonial powers as how to proceed in the establishment of colonies and protectorates. While the Belgian interest soon concentrated on the ": null
    },
    {
        "Congo River": "Congo River"
    },
    {
        ", the British and Germans focused on ": null
    },
    {
        "Eastern Africa": "Eastern Africa"
    },
    {
        " and in 1886 partitioned continental East Africa between themselves; the Sultanate of Zanzibar, now reduced to the islands of Zanzibar and Pemba, remained independent, for the moment. The ": null
    },
    {
        "Congo Free State": "Congo Free State"
    },
    {
        " was eventually to give up its claim on ": null
    },
    {
        "Kigoma": "Kigoma"
    },
    {
        " and on any territory to the east of ": null
    },
    {
        "Lake Tanganyika": "Lake Tanganyika"
    },
    {
        ", to ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ".               All resistance to the ": null
    },
    {
        "Germans": "Germans"
    },
    {
        " in the interior ceased and they could now set out to organize German East Africa. They continued brutally to exercise their authority with disregard and contempt for existing local structures and traditions. While the German colonial administration brought cash crops, railroads, and roads to ": null
    },
    {
        "Tanganyika": "Tanganyika"
    },
    {
        ", European rule provoked African resistance. Between 1891 and 1894, the ": null
    },
    {
        "Hehe": "Hehe People"
    },
    {
        "—led by ": null
    },
    {
        "Chief Mkwawa": "Chief Mkwawa"
    },
    {
        "—resisted German expansion, but were eventually defeated. After a period of ": null
    },
    {
        "guerrilla warfare": "Guerrilla Warfare"
    },
    {
        ", Mkwawa was cornered and committed suicide in 1898.               Widespread discontent re-emerged, and in 1902 a movement against forced labour for a cotton scheme rejected by the local population started along the ": null
    },
    {
        "Rufiji River": "Rufiji River"
    },
    {
        ". The tension reached a breaking point in July 1905 when the ": null
    },
    {
        "Matumbi": "Matumbi People"
    },
    {
        " of ": null
    },
    {
        "Nandete": "Nandete"
    },
    {
        " led by Kinjikitile Ngwale revolted against the local administrators  and suddenly the revolt grew wider from ": null
    },
    {
        "Dar Es Salaam": "Dar Es Salaam"
    },
    {
        " to the ": null
    },
    {
        "Uluguru": "Uluguru"
    },
    {
        " Mountains, the ": null
    },
    {
        "Kilombero Valley": "Ulanga River"
    },
    {
        ", the ": null
    },
    {
        "Mahenge": "Mahenge Mountains"
    },
    {
        " and ": null
    },
    {
        "Makonde": "Makonde Plateau"
    },
    {
        " plateaux, the ": null
    },
    {
        "Ruvuma": "Ruvuma"
    },
    {
        " in the southernmost part and Kilwa, ": null
    },
    {
        "Songea": "Songea"
    },
    {
        ", ": null
    },
    {
        "Masasi": "Masasi"
    },
    {
        ", and from ": null
    },
    {
        "Kilosa": "Kilosa"
    },
    {
        " to ": null
    },
    {
        "Iringa": "Iringa"
    },
    {
        " down to the eastern shores of ": null
    },
    {
        "Lake Nyasa": "Lake Nyasa"
    },
    {
        ". The resistance culminated in the ": null
    },
    {
        "Maji Maji Resistance": "Maji Maji Rebellion"
    },
    {
        " of 1905–1907. The resistance, which temporarily united a number of southern tribes ended only after an estimated 120,000 Africans had died from fighting or starvation. Research has shown that traditional hostilities played a large part in the resistance.     Germans had occupied the area since 1897 and totally altered many aspects of everyday life. They were actively supported by the ": null
    },
    {
        "missionaries": "Missionaries"
    },
    {
        " who tried to destroy all signs of ": null
    },
    {
        "indigenous beliefs": "Traditional African Religion"
    },
    {
        ", notably by razing the mahoka huts where the local population worshiped their ancestors spirits and by ridiculing their rites, dances and other ceremonies. This would not be forgotten or forgiven; the first battle which broke out at ": null
    },
    {
        "Uwereka": "Uwereka"
    },
    {
        " in September 1905 under the Governorship of Count ": null
    },
    {
        "Gustav Adolf von Götzen": "Gustav Adolf Von Götzen"
    },
    {
        " turned instantly into an all-out war with indiscriminate murders and massacres perpetrated by all sides against farmers, settlers, missionaries, planters, villages, indigenous people and peasants. Known as the ": null
    },
    {
        "Maji-Maji": "Maji-Maji"
    },
    {
        " war with the main brunt borne by the ": null
    },
    {
        "Ngoni people": "Ngoni People"
    },
    {
        ", this was a merciless rebellion and by far the bloodiest in ": null
    },
    {
        "Tanganyika": "Tanganyika"
    },
    {
        ".               Before the outbreak of the war, German East Africa had been prepared to resist any attack that could be made without extensive preparation. For the first year of hostilities, the Germans were strong enough to conduct offensive operations in their neighbours territories by, for example, repeatedly attacking railways in ": null
    },
    {
        "British East Africa": "British East Africa"
    },
    {
        ". The strength of German forces at the beginning of the war is uncertain. Lieutenant-General ": null
    },
    {
        "Jan Smuts": "Jan Smuts"
    },
    {
        ", the commander of British forces in east Africa beginning in 1916, estimated them at 2,000 Germans and 16,000 ": null
    },
    {
        "Askaris": "Askarigerman Colonies"
    },
    {
        ". The white adult male population in 1913 numbered over 3,500 . In addition, the indigenous population of over 7,000,000 formed a reservoir of manpower from which a force might be drawn, limited only by the supply of German officers and equipment. There is no reason to doubt that the Germans made the best of this material during the ... nearly eighteen months which separated the outbreak of war from the invasion in force of their territory.      The geography of German East Africa also was a severe impediment to British and allied forces. The coastline offered few suitable points for landing and was backed by unhealthy swamps. The line of lakes and mountains to the west proved to be impenetrable. Belgian forces from the ": null
    },
    {
        "Belgian Congo": "Belgian Congo"
    },
    {
        " had to be moved through Uganda. On the south, the ": null
    },
    {
        "Ruvuma River": "Ruvuma River"
    },
    {
        " was fordable only its upper reaches. In the north, only one practicable pass about five miles wide existed between the ": null
    },
    {
        "Pare Mountains": "Pare Mountains"
    },
    {
        " and ": null
    },
    {
        "Mount Kilimanjaro": "Mount Kilimanjaro"
    },
    {
        ", and here the German forces had been digging in for eighteen months.     Germany commenced hostilities in 1914 by unsuccessfully attacking from the town of ": null
    },
    {
        "Tanga": "Tanga, Tanzania"
    },
    {
        ". The British then attacked the town in November 1914 but were thwarted by General ": null
    },
    {
        "Paul von Lettow-Vorbecks": "Paul Von Lettow-Vorbeck"
    },
    {
        " forces at the ": null
    },
    {
        "Battle of Tanga": "Battle Of Tanga"
    },
    {
        ". The British ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        " occupied ": null
    },
    {
        "Mafia Island": "Mafia Island"
    },
    {
        " in January 1915. However, the attack on Tanga and the numerous smaller engagements that followed the strength ... of and made it evident that a powerful force must be organized before the conquest of could be ... undertaken. Such an enterprise had ... to await more favourable conditions on European battlefields and elsewhere. But in July, 1915, the last German troops in S.W. Africa capitulated ... and the nucleus of the requisite force ... became available. British forces from the northeast and southwest and Belgian forces from the northwest steadily attacked and defeated German forces beginning in January 1916. In October 1916, General Smuts wrote, With the exception of the ": null
    },
    {
        "Mahenge Plateau": "Mahenge"
    },
    {
        " have lost every healthy or valuable part of their Colony .     Cut-off from Germany, General Von Lettow by necessity conducted a guerilla campaign throughout 1917, living off the land and dispersing over a wide area. In December, the remaining German forces evacuated the colony by crossing the Ruvuma River into ": null
    },
    {
        "Portuguese Mozambique": "Portuguese Mozambique"
    },
    {
        ". Those forces were estimated at 320 German troops and 2,500 Askaris. 1,618 Germans and 5,482 Askaris were killed or captured during the last six months of 1917. In November 1918, his remaining force surrendered near present-day ": null
    },
    {
        "Mbala, Zambia": "Mbala, Zambia"
    },
    {
        " consisting of 155 Europeans, 1,165 Askaris, 2,294 African porters etc., and 819 African women.     Under the ": null
    },
    {
        "Treaty of Versailles": "Treaty Of Versailles"
    },
    {
        ", Germany relinquished all her overseas possessions, including German East Africa.  Britain lost 3,443 men in battle plus 6,558 men to disease.  The equivalent numbers for Belgium were 683 and 1,300.  Germany lost 734 Europeans and 1,798 Africans.      Von Lettows ": null
    },
    {
        "scorched earth": "Scorched Earth"
    },
    {
        " policy and the requisition of buildings meant a complete collapse of the Governments education system, though some ": null
    },
    {
        "mission": "Mission"
    },
    {
        " schools managed to retain a semblance of instruction. Unlike the Belgian, British, French and Portuguese colonial masters in central Africa, Germany had developed an educational program for her Africans that involved elementary, secondary and vocational schools. Instructor qualifications, curricula, textbooks, teaching materials, all met standards unmatched anywhere in tropical Africa.  In 1924, ten years after the beginning of the First World War and six years into British rule, the visiting American Phelps-Stokes Commission reported: In regards to schools, the Germans have accomplished marvels. Some time must elapse before education attains the standard it had reached under the Germans. But by 1920, the Education Department consisted of 1 officer and 2 clerks with a budget equal to 1% of the countrys revenue—less than the amount appropriated for the maintenance of Government House.         In 1919, the population was estimated at 3,500,000.     The first British civilian administrator after the end of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " was ": null
    },
    {
        "Sir Horace Archer Byatt": "Horace Archer Byatt"
    },
    {
        " CMG": "Order Of St Michael And St George"
    },
    {
        ", appointed by Royal Commission on 31 January 1919.   The colony was renamed ": null
    },
    {
        "Tanganyika Territory": "Tanganyika Territory"
    },
    {
        " in January 1920.   In September 1920 by the Tanganyika Order in Council, 1920, the initial boundaries of the territory, the Executive Council, and the offices of governor and commander-in-chief were established.  The governor legislated by proclamation or ordinance until 1926.      Britain and ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        " signed an agreement regarding the border between Tanganyika and ": null
    },
    {
        "Ruanda-Urundi": "Ruanda-Urundi"
    },
    {
        " in 1924.      The administration of the Territory continued to be carried out under the terms of the mandate until its transfer to the Trusteeship System under the Charter of the United Nations by the Trusteeship Agreement of 13 December 1946.         Governor Byatt took measures to revive African institutions by encouraging limited local rule. He authorized the formation in 1922 of political clubs such as the Tanganyika Territory African Civil Service Association, which in 1929 became the ": null
    },
    {
        "Tanganyika African Association": "Tanganyika African Association"
    },
    {
        " and later constituted the core of the nationalist movement. Under the Native Authority Ordinances of 1923, limited powers were granted to certain recognized chiefs who could also exercise powers granted by local customary law.      ": null
    },
    {
        "Sir Donald Cameron": "Donald Charles Cameron"
    },
    {
        " became the governor of Tanganyika in 1925.  His work ... was of great significance in the development of colonial administrative policy, being associated especially with the vigorous attempt to establish a system of Indirect Rule through the traditional indigenous authorities.  He was a major critic of Governor Byatts policies about indirect rule, as evidenced by his Native Administration Memorandum No. 1, Principles of Native Administration and their Application.      In 1926, the Legislative Council was established with seven unofficial and thirteen official members, whose function was to advise and consent to ordinances issued by the governor.  In 1945, the first Africans were appointed to the council.  The council was reconstituted in 1948 under Governor ": null
    },
    {
        "Edward Twining": "Edward Twining"
    },
    {
        ", with 15 unofficial members and 14 official members.  ": null
    },
    {
        "Julius Nyerere": "Julius Nyerere"
    },
    {
        " became one of the unofficial members in 1954.  The council was again reconstituted in 1955 with 44 unofficial members and 17 official members.      Governor Cameron in 1929 enacted the Native Courts Ordinance No. 5, which removed those courts from the jurisdiction of the colonial courts and provided for a system of appeals with final resort to the governor himself.          In 1928, the ": null
    },
    {
        "Tabora": "Tabora"
    },
    {
        " to ": null
    },
    {
        "Mwanza": "Mwanza"
    },
    {
        " railway line was opened to traffic. International Geographical Union. XVIIth International Geographical Congress. United States 1952. Tanzania: A Political Economy  p. 107 The line from ": null
    },
    {
        "Moshi": "Moshi, Tanzania"
    },
    {
        " to ": null
    },
    {
        "Arusha": "Arusha"
    },
    {
        " opened in 1930.          In 1931 a census established the population of ": null
    },
    {
        "Tanganyika": "Tanganyika"
    },
    {
        " at 5,022,640 natives, in addition to 32,398 Asians and 8,228 Europeans.         Under British rule, efforts were undertaken to fight the ": null
    },
    {
        "Tsetse fly": "Tsetse Fly"
    },
    {
        " , and to fight ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        " and ": null
    },
    {
        "bilharziasis": "Bilharziasis"
    },
    {
        "; more hospitals were built.     In 1926, the colonial administration provided subsidies to schools run by missionaries, and at the same time established its authority to exercise supervision and to establish guidelines. Yet in 1935, the education budget for the entire country of Tanganyika amounted to only US$290,000, although it is unclear how much this represented at the time in terms of ": null
    },
    {
        "purchasing power parity": "Purchasing Power Parity"
    },
    {
        ".       The British Government decided to develop wheat growing to help feed a war-ravaged and severely rationed Britain and eventually Europe at the hoped-for Allied victory at the end of the Second World War. An American farmer in Tanganyika, ": null
    },
    {
        "Freddie Smith": "Freddie Smith"
    },
    {
        ", was in charge, and ": null
    },
    {
        "David Gordon Hines": "David Gordon Hines"
    },
    {
        " was the accountant responsible for the finances. The scheme had  on the ": null
    },
    {
        "Ardai": "Ardai"
    },
    {
        " plains just outside ": null
    },
    {
        "Arusha": "Arusha"
    },
    {
        ";  on ": null
    },
    {
        "Mount Kilimanjaro": "Mount Kilimanjaro"
    },
    {
        "; and  towards ": null
    },
    {
        "Ngorongoro": "Ngorongoro"
    },
    {
        " to the west. All the machinery was lend/lease from the US, including 30 tractors, 30 ploughs, and 30 harrows. There were western agricultural and engineering managers. Most of the workers were ": null
    },
    {
        "Italian prisoners of war": "Italian Prisoners Of War"
    },
    {
        " from Somalia and Ethiopia: excellent, skilled engineers and mechanics. The Ardai plains were too arid to be successful, but there were good crops in the Kilimanjaro and Ngorongoro areas. Work by WD Ogilvie: 1999 interview of David Hines; London Daily Telegraph obituary of David Hines 8 April 2000       Two days after ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        " invaded": "Invasion Of Poland"
    },
    {
        " Poland": "Poland"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " declared war and the British forces in Tanganyika were ordered to ": null
    },
    {
        "intern": "Internment"
    },
    {
        " the German males living in Tanganyika. The British government feared that these Axis country citizens would attempt to help the ": null
    },
    {
        "Axis forces": "Axis Forces"
    },
    {
        " and some of the Germans living in Dar es Salaam did attempt to flee the country but were stopped and later interned by ": null
    },
    {
        "Roald Dahl": "Roald Dahl"
    },
    {
        " and a small group of Tanganyikan soldiers of the ": null
    },
    {
        "Kings African Rifles": "Kings African Rifles"
    },
    {
        ". Going Solo, By Roald Dahl, Publisher: Puffin Books ,      During the war about 100,000 people from Tanganyika joined the ": null
    },
    {
        "Allied forces": "Allies Of World War Ii"
    },
    {
        ". Jay Heale, Winnie Wong, 2009, Cultures of the World, Second , Tanzania, Publisher: Cavendish Square Publishing ,  and were part of the 375,000 British colonial troops who fought against the Axis forces. Tanganyikans fought in units of the Kings African Rifles and fought in the ": null
    },
    {
        "East African Campaign": "East African Campaign"
    },
    {
        " in ": null
    },
    {
        "Somalia": "Somalia"
    },
    {
        " and ": null
    },
    {
        "Abyssinia": "Ethiopian Empire"
    },
    {
        " against the Italians, in ": null
    },
    {
        "Madagascar": "Madagascar"
    },
    {
        " against the ": null
    },
    {
        "Vichy French": "Vichy French"
    },
    {
        " during the ": null
    },
    {
        "Madagascar Campaign": "Battle Of Madagascar"
    },
    {
        ", and in ": null
    },
    {
        "Burma": "Burma"
    },
    {
        " against the ": null
    },
    {
        "Japanese": "Empire Of Japan"
    },
    {
        " during the ": null
    },
    {
        "Burma Campaign": "Burma Campaign 1944–45"
    },
    {
        ". Memorial Gates Trust, , African participants in the Second World War, www.mgtrust.org/afr2.htm Tanganyika became an important source of food and Tanganyikas export income greatly increased from the pre-war years of the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        " however despite the additional income the war caused ": null
    },
    {
        "inflation": "Inflation"
    },
    {
        " within the country. Tanzania: British rule between the Wars , Updated September 2005, Electoral Institute for Sustainable Democracy in Africa, www.content.eisa.org.za/old-page/tanzania-british-rule-between-wars-1916-1945         In 1947, Tanganyika became a ": null
    },
    {
        "United Nations trust territory": "United Nations Trust Territories"
    },
    {
        " under British control. Its geography, topography, climate, geopolitics, patterns of settlement and history made Tanganyika the most significant of all UN Trust Territories. Voices from Tanganyika: Great Britain, The United Nations and the Decolonization of a Trust Territory, 1946-1961, authored by Ullrich Lohrmann, published by Lit Verlag, Berlin, 2007, accessed 30 October 2014  But two-thirds of the population lived in one-tenth of the territory because of water shortages, soil erosion, unreliable rainfall, tsetse fly infestations, and poor communications and transportation infrastructures.         In 1957, only 15 towns had over 5,000 inhabitants, with the capital ": null
    },
    {
        "Dar es Salaam": "Dar Es Salaam"
    },
    {
        " having the nations highest population of 128,742.  Tanganyika was a multi-racial territory, which made it unique in the trusteeship world.  Its total non-African population in 1957 was 123,310 divided as follows: 95,636 Asians and Arabs , 3,114 Somalis, and 3,782 coloured and other individuals.  The white population, which included the Europeans and white South Africans, totalled 20,598 individuals.  Tanganyikas ethnic and economic make-up posed problems for the British.  Their policy was geared to ensuring the continuance of the European presence as necessary to support the countrys economy.  But the British also had to remain responsive to the political demands of the Africans.      Many Africans were government servants, business employees, labourers, and producers of important cash crops during this period. But the vast majority were subsistence farmers who produced barely enough to survive.  The standards of housing, clothing, and other social conditions were equally quite poor.  The Asians and Arabs were the middle class and tended to be wholesale and retail traders.  The white population were missionaries, professional and government servants, and owners and managers of farms, plantations, mines, and other businesses.  White farms were of primary importance as producers of exportable agricultural crops.      Britain, through its colonial officer ": null
    },
    {
        "David Gordon Hines": "David Gordon Hines"
    },
    {
        ", encouraged the development of farming co-operatives to help convert subsistence farmers to cash husbandry. The subsistence farmers sold their produce to Indian traders at poor prices. By the early 1950s, there were over 400 co-operatives nationally. 3rd edition 1994 Lonely Planet: East Africa  page 497 Co-operatives formed unions for their areas and developed ": null
    },
    {
        "cotton gin": "Cotton Gin"
    },
    {
        "neries, coffee factories, and ": null
    },
    {
        "tobacco dryers": "Tobaccocuring"
    },
    {
        ". A major success for Tanzania was the ": null
    },
    {
        "Moshi": "Moshi, Kilimanjaro"
    },
    {
        " coffee auctions that attracted international buyers after the annual Nairobi auctions.     The disastrous ": null
    },
    {
        "Tanganyika groundnut scheme": "Tanganyika Groundnut Scheme"
    },
    {
        " began in 1946 and was abandoned in 1951.     After Tanganyika became a UN trust territory, the British felt extra pressure for political progress.  The British principle of gradualism was increasingly threatened and was abandoned entirely during the last few years before independence.  Five UN missions visited Tanganyika, the UN received several hundred written petitions, and a handful of oral presentations made it to the debating chambers in New York City between 1948 and 1960.  The UN and the Africans who used the UN to achieve their purposes were very influential in driving Tanganyika towards independence.  The Africans attended public gatherings in Tanganyika with UN representatives.  There were peasants, urban workers, government employees, and local chiefs and nobles who personally approached the UN about local matters needing immediate action.  And finally, there were Africans at the core of the political process who had the power to mould the future.  Their goal was political advancement for Africans, with many supporting the nationalist movement, which had its roots in the African Association . It was formed in 1929 as a social organization for African government servants in Dar es Salaam and Zanzibar.  The AA was renamed the ": null
    },
    {
        "Tanganyika African Association": "Tanganyika African Association"
    },
    {
        " in 1948 and ceased being concerned with events in Zanzibar.      Beginning in 1954, African nationalism centered on the ": null
    },
    {
        "Tanganyika African National Union": "Tanganyika African National Union"
    },
    {
        " , which was a political organization formed by ": null
    },
    {
        "Julius Nyerere": "Julius Nyerere"
    },
    {
        " in that year  as the successor to the TAA.  The TANU won the Legislative Council elections in 1958, 1959, and 1960, with Nyerere becoming chief minister after the 1960 election.  Internal self-government started on 1 May 1961 followed by independence on 9 December 1961.             ": null
    },
    {
        "Zanzibar": "Zanzibar"
    },
    {
        " today refers to the island of that name, also known as Unguja, and the neighboring island of Pemba. Both islands fell under Portuguese domination in the 16th and early 17th centuries but were retaken by Omani Arabs in the early 18th century. The height of Arab rule came during the reign of Sultan ": null
    },
    {
        "Seyyid Said": "Said Bin Sultan"
    },
    {
        ", who moved his capital from ": null
    },
    {
        "Muscat": "Muscat, Oman"
    },
    {
        " to Zanzibar, established a ruling Arab elite, and encouraged the development of ": null
    },
    {
        "clove": "Clove"
    },
    {
        " plantations, using the islands slave labor. Zanzibar and Pemba were world-famous for their trade in spices and became known as the ": null
    },
    {
        "Spice Islands": "Zanzibar Archipelago"
    },
    {
        "; in the early 20th century, they produced approximately 90% of the worlds supply of cloves. Zanzibar was also a major transit point in the African Great Lakes and Indian Ocean slave trade . Zanzibar attracted ships from as far away as the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", which established a consulate in 1833. The United Kingdoms early interest in Zanzibar was motivated by both commerce and the determination to end the ": null
    },
    {
        "slave trade": "Slave Trade"
    },
    {
        ". In 1822, the British signed the first of a series of treaties with Sultan Said to curb this trade, but not until 1876 was the sale of slaves finally prohibited. The ": null
    },
    {
        "Heligoland-Zanzibar Treaty": "Heligoland-Zanzibar Treaty"
    },
    {
        " of 1890 made Zanzibar and Pemba a British ": null
    },
    {
        "protectorate": "Protectorate"
    },
    {
        ", and the ": null
    },
    {
        "Caprivi Strip": "Caprivi Strip"
    },
    {
        " in ": null
    },
    {
        "Namibia": "Namibia"
    },
    {
        " became a German protectorate. British rule through a Sultan remained largely unchanged from the late 19th century until 1957, when elections were held for a largely advisory Legislative Council.            In 1954, ": null
    },
    {
        "Julius Nyerere": "Julius Nyerere"
    },
    {
        ", a school teacher who was then one of only two Tanganyikans educated to university level, organized a political party—the ": null
    },
    {
        "Tanganyika African National Union": "Tanganyika African National Union"
    },
    {
        " . On 9 December 1961, ": null
    },
    {
        "Tanganyika": "Tanganyika"
    },
    {
        " became independent, though retaining the ": null
    },
    {
        "British monarch": "British Monarch"
    },
    {
        " as ": null
    },
    {
        "Queen of Tanganyika": "Queen Of Tanganyika"
    },
    {
        ", and Nyerere became Prime Minister, under a new constitution. On 9 December 1962, a republican constitution was implemented with Mwalimu Julius Kambarage Nyerere as Tanganyikas first president.     Zanzibar received its independence from the United Kingdom on 10 December 1963, as a ": null
    },
    {
        "constitutional monarchy": "Constitutional Monarchy"
    },
    {
        " under its ": null
    },
    {
        "Sultan": "List Of Sultans Of Zanzibar"
    },
    {
        ". On 12 January 1964, the African majority revolted against the ": null
    },
    {
        "sultan": "Sultan"
    },
    {
        " and a new government was formed with the ASP leader, ": null
    },
    {
        "Abeid Karume": "Abeid Karume"
    },
    {
        ", as President of Zanzibar and ": null
    },
    {
        "Chairman": "Chairman"
    },
    {
        " of the Revolutionary Council. In the first few days of what would came to be known as the ": null
    },
    {
        "Zanzibar Revolution": "Zanzibar Revolution"
    },
    {
        ", between 5,000 and 15,000 Arabs and Indians were murdered. During a series of riots, followers of the radical ": null
    },
    {
        "John Okello": "John Okello"
    },
    {
        " carried out thousands of rapes and destroyed homes and other property. Petterson, Don Revolution In Zanzibar: An Americans Cold War Tale, New York: Basic Books, 2002 page 65. Within a few weeks, a fifth of the population had died or fled.     It was at this time that the Tanganyika army revolted and Britain was asked by ": null
    },
    {
        "Julius Nyerere": "Julius Nyerere"
    },
    {
        " to send in troops. Royal Marines Commandos were sent by air from England via Nairobi and 40 Commando came ashore from the aircraft carrier HMS Bulwark. Several months were spent with Commandos touring the country disarming military outposts. When the successful operation ended, the Royal Marines left to be replaced by Canadian troops.     On 26 April 1964, Tanganyika united with Zanzibar to form the United Republic of Tanganyika and Zanzibar. The country was renamed the United Republic of Tanzania on 29 October of that year. The name Tanzania is a blend of Tanganyika and Zanzibar and previously had no significance. Under the terms of this union, the Zanzibar Government retains considerable local autonomy.         To form a sole ruling party in both parts of the union, ": null
    },
    {
        "Julius Nyerere": "Julius Nyerere"
    },
    {
        " merged ": null
    },
    {
        "TANU": "Tanu"
    },
    {
        " with the Zanzibar ruling party, the ": null
    },
    {
        "Afro-Shirazi Party": "Afro-Shirazi Party"
    },
    {
        " of Zanzibar to form the ": null
    },
    {
        "CCM": "Chama Cha Mapinduzi"
    },
    {
        " , on February 5, 1977. The merger was reinforced by principles enunciated in the 1982 union constitution and reaffirmed in the constitution of 1984.     Nyerere believed multiple political parties, in a nation with hundreds of ethnic groups, were a threat to national unity and therefore sought ways to ensure a one party system.  /ref ref  /ref ref  /ref ": null
    }
]