[
    {
        "The history of Guatemala begins with the ": null
    },
    {
        "Maya civilization": "Maya Civilization"
    },
    {
        " , which was among those that flourished in the region. The countrys modern history began with the ": null
    },
    {
        "Spanish conquest of Guatemala": "Spanish Conquest Of Guatemala"
    },
    {
        " in 1511.     Most of the great Classic-era Maya cities of the ": null
    },
    {
        "Petén Basin": "Petén Basin"
    },
    {
        " region, in the northern lowlands, had been abandoned by the year 1000  AD. The states in the ": null
    },
    {
        "Belize": "Belize"
    },
    {
        " central highlands flourished until the 1525 arrival of Spanish ": null
    },
    {
        "Conquistador": "Conquistador"
    },
    {
        " Pedro de Alvarado": "Pedro De Alvarado"
    },
    {
        ". Called The Invader by the Maya peoples, he immediately began subjugating the Indian states.     Guatemala was part of the ": null
    },
    {
        "Captaincy General of Guatemala": "Captaincy General Of Guatemala"
    },
    {
        " for nearly 330 years. This Captaincy, or Capitanía, included the territories of modern ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        " and the modern countries of ": null
    },
    {
        "Guatemala": "Guatemala"
    },
    {
        ", ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        ", ": null
    },
    {
        "Honduras": "Honduras"
    },
    {
        ", ": null
    },
    {
        "Nicaragua": "Nicaragua"
    },
    {
        " and ": null
    },
    {
        "Costa Rica": "Costa Rica"
    },
    {
        ". The Capitania became independent in 1821 and became a part of the ": null
    },
    {
        "First Mexican Empire": "First Mexican Empire"
    },
    {
        " until 1823. From 1824 it was a part of the ": null
    },
    {
        "Federal Republic of Central America": "Federal Republic Of Central America"
    },
    {
        ". When the Republic dissolved in 1841, Guatemala became fully independent.     In the late 19th and early 20th century, Guatemalas potential for agricultural exploitation attracted several foreign companies, most prominently the ": null
    },
    {
        "United Fruit Company": "United Fruit Company"
    },
    {
        " . These companies, supported by the countrys authoritarian rulers, and the ": null
    },
    {
        "United States": "United States"
    },
    {
        " government through their support for brutal labor regulations and massive concessions to wealthy landowners. In 1944, the policies of ": null
    },
    {
        "Jorge Ubico": "Jorge Ubico"
    },
    {
        " led to a popular uprising that began the ten-year ": null
    },
    {
        "Guatemalan Revolution": "Guatemalan Revolution"
    },
    {
        ". The presidencies of ": null
    },
    {
        "Juan José Arévalo": "Juan José Arévalo"
    },
    {
        " and ": null
    },
    {
        "Jacobo Árbenz": "Jacobo Árbenz"
    },
    {
        " saw sweeping social and economic reforms, including a significant increase in literacy and a successful ": null
    },
    {
        "agrarian reform program": "Decree 900"
    },
    {
        ".     The progressive policies of Arévalo and Árbenz led the United Fruit Company to lobby the United States government for their overthrow, and a ": null
    },
    {
        "US-engineered coup": "1954 Guatemalan Coup Détat"
    },
    {
        " in 1954 ended the revolution and installed a military regime. This was followed by other military governments, and jolted off a ": null
    },
    {
        "civil war": "Guatemalan Civil War"
    },
    {
        " that lasted from 1960 to 1996. The war saw ": null
    },
    {
        "human rights violations": "Human Rights Violations"
    },
    {
        ", including a ": null
    },
    {
        "genocide": "Genocide"
    },
    {
        " of the indigenous ": null
    },
    {
        "Maya population": "Maya Peoples"
    },
    {
        " by the military. Following the wars end in 1997, Guatemala re-established a ": null
    },
    {
        "representative democracy": "Representative Democracy"
    },
    {
        ". It has since struggled to enforce the rule of law and suffers a high crime rate and continued extrajudicial killings, often executed by security forces.              The earliest human settlements in Guatemala date back to the ": null
    },
    {
        "Paleo-Indian": "Paleo-Indian"
    },
    {
        " period and were made up of hunters and gatherers. Historia General de Guatemala, 1999. Sites dating back to 6500 ": null
    },
    {
        "BC": "Before Christ"
    },
    {
        " have been found in ": null
    },
    {
        "Quiché": "Quiché Department"
    },
    {
        " in the Highlands and ": null
    },
    {
        "Sipacate": "Sipacate"
    },
    {
        ", ": null
    },
    {
        "Escuintla": "Escuintla"
    },
    {
        " on the central Pacific coast.     Although it is unclear when these groups of hunters and gatherers turned to cultivation, pollen samples from ": null
    },
    {
        "Petén": "Petén"
    },
    {
        " and the Pacific coast indicate maize cultivation as early as 3500  BC.  By 2500  BC, small settlements were developing in Guatemalas Pacific lowlands in such places as Tilapa, ": null
    },
    {
        "La Blanca": "La Blanca"
    },
    {
        ", Ocós, El Mesak, and ": null
    },
    {
        "Ujuxte": "Ujuxte"
    },
    {
        ", where the oldest pieces of ceramic pottery from Guatemala have been found.  Excavations in the ": null
    },
    {
        "Antigua Guatemala": "Antigua Guatemala"
    },
    {
        " Urías and Rucal, have yielded stratified materials from the Early and Middle Preclassic periods . Paste analyses of these early pieces of pottery in the Antigua Valley indicate they were made of clays from different environmental zones, suggesting people from the Pacific coast expanded into the Antigua Valley.      Guatemalas ": null
    },
    {
        "Pre-Columbian era": "Pre-Columbian Era"
    },
    {
        " can be divided into the Preclassic period , the Classic period and the Postclassic period .  Until recently, the Preclassic was regarded as a formative period, consisting of small villages of farmers who lived in huts and few permanent buildings, but this notion has been challenged by recent discoveries of monumental architecture from that period, such as an altar in ": null
    },
    {
        "La Blanca": "La Blanca"
    },
    {
        ", ": null
    },
    {
        "San Marcos": "San Marcos Department"
    },
    {
        ", from 1000  BC; ceremonial sites at Miraflores and El Naranjo from 801  BC; the earliest monumental masks; and the ": null
    },
    {
        "Mirador Basin": "Mirador Basin"
    },
    {
        " cities of ": null
    },
    {
        "Nakbé": "Nakbé"
    },
    {
        ", Xulnal, ": null
    },
    {
        "El Tintal": "El Tintal"
    },
    {
        ", Wakná and ": null
    },
    {
        "El Mirador": "El Mirador"
    },
    {
        ".        In Monte Alto near ": null
    },
    {
        "La Democracia, Escuintla": "La Democracia, Escuintla"
    },
    {
        ", giant stone heads and ": null
    },
    {
        "potbellies": "Potbelly Sculpture"
    },
    {
        "  have been found, dating back to around 1800  BC.   Authentic Maya. . The stone heads have been ascribed to the Pre-": null
    },
    {
        "Olmec": "Olmec"
    },
    {
        " Monte Alto Culture": "Monte Alto Culture"
    },
    {
        " and some scholars suggest the ": null
    },
    {
        "Olmec": "Olmec"
    },
    {
        " Culture originated in the Monte Alto area. Malmström. The Origins of Civilization in Mesoamerica: A Geographic Perspective, Department of Geography, Dartmouth College. It has also been argued the only connection between the statues and the later Olmec heads is their size. Coe, 1981. The ": null
    },
    {
        "Monte Alto Culture": "Monte Alto Culture"
    },
    {
        " may have been the first complex ": null
    },
    {
        "culture": "Culture"
    },
    {
        " of Mesoamerica, and predecessor of all other cultures of the region. In Guatemala, some sites have unmistakable Olmec style, such as ": null
    },
    {
        "Chocolá": "Chocolá"
    },
    {
        " in ": null
    },
    {
        "Suchitepéquez": "Suchitepéquez Department"
    },
    {
        ", ": null
    },
    {
        "La Corona": "La Corona"
    },
    {
        " in ": null
    },
    {
        "Peten": "Petén Department"
    },
    {
        ", and ": null
    },
    {
        "Takalik A´baj": "Takalik Abaj"
    },
    {
        ", in ": null
    },
    {
        "Retalhuleu": "Retalhuleu Department"
    },
    {
        ", the last of which is the only ancient city in the Americas with ": null
    },
    {
        "Olmec": "Olmec"
    },
    {
        " and ": null
    },
    {
        "Mayan": "Maya Civilization"
    },
    {
        " features. Green, Dee F., and Gareth W. Lowe Olmec Diffusion: A Sculptural View from Pacific Guatemala , In Regional Perspectives on the Olmec : 227–246. Cambridge University Press, Cambridge, Eng.     El Mirador was by far the most populated city in pre-Columbian America. Both the El Tigre and Monos pyramids encompass a volume greater than 250,000 cubic meters. Trigger, Bruce G. and Washburn, Wilcomb E. and Adams, Richard E. W. The Cambridge History of the Native Peoples of the Americas. 2000, p. 212. ": null
    },
    {
        "Richard Hansen": "Richard D. Hansen"
    },
    {
        ", the director of the ": null
    },
    {
        "archaeological": "Archaeological"
    },
    {
        " project of the ": null
    },
    {
        "Mirador Basin": "Mirador Basin"
    },
    {
        ", believes the ": null
    },
    {
        "Maya": "Maya Peoples"
    },
    {
        " at Mirador Basin developed the first politically organized state in America around 1500  BC, named the Kan Kingdom in ancient texts. There were 26 cities, all connected by sacbeob , which were several kilometers long, up to 40 meters wide, and two to four meters above the ground, paved with ": null
    },
    {
        "stucco": "Stucco"
    },
    {
        ". These are clearly distinguishable from the air in the most extensive virgin tropical rain forest in Mesoamerica.     Hansen believes the ": null
    },
    {
        "Olmec": "Olmec"
    },
    {
        " were not the mother culture in ": null
    },
    {
        "Mesoamerica": "Mesoamerica"
    },
    {
        ". Due to findings at ": null
    },
    {
        "Mirador Basin": "Mirador Basin"
    },
    {
        " in Northern ": null
    },
    {
        "Petén": "Petén"
    },
    {
        ", Hansen suggests the ": null
    },
    {
        "Olmec": "Olmec"
    },
    {
        " and Maya cultures developed separately, and merged in some places, such as Takalik Abaj in the Pacific lowlands.        Northern Guatemala has particularly high densities of Late Pre-classic sites, including ": null
    },
    {
        "Naachtun": "Naachtun"
    },
    {
        ", Xulnal, ": null
    },
    {
        "El Mirador": "El Mirador"
    },
    {
        ", Porvenir, Pacaya, La Muralla, ": null
    },
    {
        "Nakbé": "Nakbé"
    },
    {
        ", ": null
    },
    {
        "El Tintal": "El Tintal"
    },
    {
        ", Wakná , ": null
    },
    {
        "Uaxactún": "Uaxactún"
    },
    {
        ", and ": null
    },
    {
        "Tikal": "Tikal"
    },
    {
        ". Of these, El Mirador, Tikal, Nakbé, Tintal, Xulnal and Wakná are the largest in the Maya world, Such size was manifested not only in the extent of the site, but also in the volume or monumentality, especially in the construction of immense platforms to support large temples. Many sites of this era display monumental masks for the first time . Hansens dating has been called into question by many other Maya archaeologists, and developments leading to probably extra-regional power by the Late Preclassic of Kaminaljuyu, in the southern Maya area, suggest that Maya civilization developed in different ways in the Lowlands and the SMA to produce what we know as the Classic Maya.     The Classic period of Mesoamerican civilization corresponds to the height of the Maya civilization, and is represented by countless sites throughout Guatemala. The largest concentration is found in Petén. This period is characterized by expanded city-building, the development of independent city-states, and contact with other Mesoamerican cultures.     This lasted until around 900  AD, when the ": null
    },
    {
        "Classic Maya civilization collapsed": "Classic Maya Collapse"
    },
    {
        ". The Maya abandoned many of the cities of the central lowlands or died in a drought-induced famine. Dr. Richardson Gill, The Great Maya Droughts , University of New Mexico Press.  Scientists debate the cause of the Classic Maya Collapse, but gaining currency is the Drought Theory discovered by physical scientists studying lake beds, ancient pollen, and other tangible evidence. Dr. Richardson Gill, The Great Maya Droughts , University of New Mexico Press                 Second-in-command to ": null
    },
    {
        "Hernán Cortés": "Hernán Cortés"
    },
    {
        ", ": null
    },
    {
        "Pedro de Alvarado": "Pedro De Alvarado"
    },
    {
        " was sent to the ": null
    },
    {
        "Guatemala": "Guatemala"
    },
    {
        " highlands with 300 Spanish foot soldiers, 120 Spanish horsemen and several hundred Cholula and Tlascala auxiliaries.  , ThePirateKing.com .     Alvarado entered Guatemala from ": null
    },
    {
        "Soconusco": "Soconusco"
    },
    {
        " on the Pacific lowlands, headed for Xetulul Humbatz, ": null
    },
    {
        "Zapotitlán": "Zapotitlán, Jutiapa"
    },
    {
        ". He initially allied himself with the ": null
    },
    {
        "Cakchiquel": "Kaqchikel People"
    },
    {
        " nation to fight against their traditional rivals the ": null
    },
    {
        "Kiche": "Kiche People"
    },
    {
        ". The conquistador started his conquest in Xepau ": null
    },
    {
        "Olintepeque": "Olintepeque"
    },
    {
        ", defeating the Kichés 72,000 men, led by ": null
    },
    {
        "Tecún Umán": "Tecún Umán"
    },
    {
        " . Alvarado went to ": null
    },
    {
        "Qumarkaj": "Qumarkaj"
    },
    {
        ", , the Kiche capital, and burned it on 7 March 1524. He proceeded to ": null
    },
    {
        "Iximche": "Iximche"
    },
    {
        ", and made a base near there in ": null
    },
    {
        "Tecpan": "Tecpán Guatemala"
    },
    {
        " on 25 July 1524. From there he made several campaigns to other cities, including Chuitinamit, the capital of the ": null
    },
    {
        "Tzutuhils": "Tzutujil People"
    },
    {
        ", ; ": null
    },
    {
        "Mixco Viejo": "Mixco Viejo"
    },
    {
        ", capital of the ": null
    },
    {
        "Poqomam": "Poqomam People"
    },
    {
        "; and ": null
    },
    {
        "Zaculeu": "Zaculeu"
    },
    {
        ", capital of the ": null
    },
    {
        "Mam": "Mam People"
    },
    {
        " . He was named captain general in 1527.     Having secured his position, Alvarado turned against his allies the Cakchiquels, confronting them in several battles until they were subdued in 1530. Battles with other tribes continued up to 1548, when the ": null
    },
    {
        "Qeqchi": "Qeqchi People"
    },
    {
        " in Nueva Sevilla, ": null
    },
    {
        "Izabal": "Izabal Department"
    },
    {
        " were defeated, leaving the Spanish in complete control of the region.     Not all native tribes were subdued by bloodshed. ": null
    },
    {
        "Bartolomé de las Casas": "Bartolomé De Las Casas"
    },
    {
        " pacified the ": null
    },
    {
        "Kekchí": "Qeqchi People"
    },
    {
        " in ": null
    },
    {
        "Alta Verapaz": "Alta Verapaz"
    },
    {
        " without violence.     After more than a century of colonization, during which mutually independent Spanish authorities in Yucatán and Guatemala made various attempts to subjugate Petén and neighboring parts of what is now Mexico. In 1697, the Spanish finally conquered ": null
    },
    {
        "Nojpetén": "Nojpetén"
    },
    {
        ", capital of the ": null
    },
    {
        "Itzá": "Itza"
    },
    {
        " Maya, and ": null
    },
    {
        "Zacpetén": "Zacpeten"
    },
    {
        ", capital of the ": null
    },
    {
        "Kowoj": "Kowoj"
    },
    {
        " Maya.                     In 1821, ": null
    },
    {
        "Fernando VIIs": "Fernando Vii Of Spain"
    },
    {
        " power in Spain was weakened by French invasions and other conflicts, and ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        " declared the ": null
    },
    {
        "Plan de Iguala": "Plan De Iguala"
    },
    {
        "; this led Mariano Aycinena y Piñol and other ": null
    },
    {
        "criollos": "Criollo People"
    },
    {
        " to demand the weak ": null
    },
    {
        "Captain General": "Captain General"
    },
    {
        " Gabino Gaínza": "Gabino Gaínza"
    },
    {
        " to declare Guatemala and the rest of Central America as an independent entity. Aycinena y Piñol was one of the signatories of the ": null
    },
    {
        "Declaration of Independence of Central America": "Act Of Independence Of Central America"
    },
    {
        " from the ": null
    },
    {
        "Spanish Empire": "Spanish Empire"
    },
    {
        ", and then lobbied strongly for the Central America annexation to the ": null
    },
    {
        "Mexican Empire": "First Mexican Empire"
    },
    {
        " of ": null
    },
    {
        "Agustín de Iturbide": "Agustín De Iturbide"
    },
    {
        ", due to its conservative and ecclesiastical nature. Aycinena remained in the legislature and was the advisor of the Governors of Guatemala in the next few years.     In October 1826, ": null
    },
    {
        "Central American Federation": "Central American Federation"
    },
    {
        " president ": null
    },
    {
        "Manuel José de Arce y Fagoaga": "Manuel José Arce"
    },
    {
        " dissolved the Legislature and tried to establish a Unitarian System for the region, switching from the Liberal to the Conservative party, that Aycinena led.  The rest of Central America did not want this system; they wanted the Aycinena family out of power altogether, and therefore, the Central American Civil War started. From this war emerged the dominant figure of the ": null
    },
    {
        "Honduran": "Honduras"
    },
    {
        " general ": null
    },
    {
        "Francisco Morazán": "Francisco Morazán"
    },
    {
        ". Mariano Aycinena y Piñol -leader of the Ayicena family and the conservative power- was appointed as Governor of Guatemala on 1 March 1827 by president ": null
    },
    {
        "Manuel José Arce": "Manuel José Arce"
    },
    {
        "; Aycinena regime was a dictatorship: he censored free press and any book with liberal ideology was forbidden. He also established Martial Law and the retroactive death penalty. He reinstated mandatory tithing for the ": null
    },
    {
        "secular clergy": "Secular Clergy"
    },
    {
        " of the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        "            Morazán and his liberal forces were fighting around San Miguel, in ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        " beating any conservative federal forces sent by Guatemalan general Manuel Arzú from ": null
    },
    {
        "San Salvador": "San Salvador"
    },
    {
        ".  Then, Arzú decided to take matters in his own hands and left colonel Montúfar in charge of San Salvador and went after Morazán. After realizing that Arzu was after him, Morazán left for Honduras to look for more volunteers for his army. On 20 September, Manuel Arzá was close to the ": null
    },
    {
        "Lempa River": "Lempa River"
    },
    {
        " with 500 men, when he was notified that the rest of his army had capitulated in ": null
    },
    {
        "San Salvador": "San Salvador"
    },
    {
        ". Morazán then went back to ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        " with a considerable army and general Arzú, feigning a sickness, fled to ": null
    },
    {
        "Guatemala": "Guatemala"
    },
    {
        ", leaving lieutenant colonel Antonio de Aycinena in command. Aycinena and his 500 troops were going to Honduras when they were intercepted by Morazán troops in San Antonio, forcing Aycinena to concede defeat on 9 October.  With Aycinena defeat, there were no more conservative federal troops in ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        ". On 23 October, general Morazán marched triumphantly in ": null
    },
    {
        "San Salvador": "San Salvador"
    },
    {
        ". A few days later, he went to ": null
    },
    {
        "Ahuachapán": "Ahuachapán"
    },
    {
        ", to organize an army to take down the conservative aristocrats led by Mariano Aycinena y Piñol in Guatemala and establish a regime favorable to the ": null
    },
    {
        "central American Federation": "Central American Federation"
    },
    {
        " that was the dream of the liberal ": null
    },
    {
        "criollos": "Criollo People"
    },
    {
        ".     Upon learning this, Aycinena y Piñol tried to negotiate with Morazán to no avail: Morazán was willing to take down the aristocrats at all costs.             After his victory in San Miguelito, Morazáns army increased in size given that a lot of voluntaries from Guatemala joined him. On 15 March, when Morazán and his army were on their way to occupy their previous positions, they were intercepted by federal troops in Las Charcas. However, Morazán had a better position and smashed the federal army. The battle field was left full of corpses, while the allies took a lot of prisoners and weaponry. the allies continued to recapture their old positions in ": null
    },
    {
        "San José Pinula": "San José Pinula"
    },
    {
        " and Aceituno, and place ": null
    },
    {
        "Guatemala City": "Guatemala City"
    },
    {
        " under siege once again. General Verveer, Ambassador from the King of Netherlands and Belgium before the Central American government and who was in Guatemala to negotiate the construction of a transoceanic Canal in Nicaragua, tried to mediate between the State of Guatemala and Morazán, but did not succeed. Military operations continued, with great success for the allies.     To prepare for the siege from Morazán troops, on 18 March 1829, Aycinena decreed Martial Law, but he was completely defeated. On 12 April 1829, Aycinena conceded defeat and he and Morazán signed an armistice pact; then, he was sent to prison, along with his Cabinet members and the Aycinena family was secluded in their Mansion. Morazán, however, annulled the pact on 20 April, since his real objective was to take power away from the conservatives and the ": null
    },
    {
        "regular clergy": "Regular Clergy"
    },
    {
        " of the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        " in Guatemala, whom the Central American leaders despised since they had had the commerce and power monopoly during the Spanish Colony.            A member of the liberal party, Mariano Gálvez was appointed the chief of state in 1831. This was during a period of turmoil that made governing difficult. After the expulsion of the conservative leader of the ": null
    },
    {
        "Aycinena family": "Mariano De Aycinena Y Piñol"
    },
    {
        " and the ": null
    },
    {
        "regular clergy": "Regular Clergy"
    },
    {
        " in 1829, Gálvez was appointed by ": null
    },
    {
        "Francisco Morazán": "Francisco Morazán"
    },
    {
        " as Governor of Guatemala in 1831. According to liberal historians ": null
    },
    {
        "Ramón Rosa": "Ramón Rosa"
    },
    {
        " and ": null
    },
    {
        "Lorenzo Montúfar y Rivera": "Lorenzo Montúfar Y Rivera"
    },
    {
        ", Gálvez promoted major innovations in all aspects of the administration to make it less dependent on the influence of the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        ". He also made public education independent of the Church, fostered science and the arts, eliminated religious festivals as holidays, founded the National Library and the National Museum, promoted respect for the laws and the rights of citizens, guaranteed freedom of the press and freedom of thought, established civil marriage and divorce, respected freedom of association, and promulgated the ": null
    },
    {
        "Livingston Code": "Edward Livingston"
    },
    {
        " . Gálvez did this against much opposition from the population who were not used to the fast pace of change; he also initiated judicial reform, reorganized municipal government and established a general head tax which severely impacted the native population. However, these were all changes that the liberals wanted to implement to completely eliminate the political and economic power of the aristocrats and of the Catholic Church -whose regular orders were expelled in 1829 and the ": null
    },
    {
        "secular clergy": "Secular Clergy"
    },
    {
        " was weakened by means of abolishing mandatory tithing. ": null
    },
    {
        "Ramón Rosa": "Ramón Rosa"
    },
    {
        " and ": null
    },
    {
        "Lorenzo Montúfar y Rivera": "Lorenzo Montúfar Y Rivera"
    },
    {
        " were the ideologists of the liberal trend in both ": null
    },
    {
        "Honduras": "Honduras"
    },
    {
        " and ": null
    },
    {
        "Guatemala": "Guatemala"
    },
    {
        ", respectively, once the Liberal Reform took over power in Guatemala in 1871 and in Honduras in 1876 and their writings were biased against conservatives.     Among his major errors was a contract made with Michael Bennett -commercial partner of Francisco Morazán in the fine wood business- on 6 August 1834; the contract provided that the territories of ": null
    },
    {
        "Izabal": "Izabal Department"
    },
    {
        ", las Verapaces, ": null
    },
    {
        "Petén": "Petén"
    },
    {
        " and ": null
    },
    {
        "Belize": "Belize"
    },
    {
        " would be colonized within twenty years, but this proved impossible, plus made people irritated by having to deal with heretics . In February 1835 Gálvez was re-elected for a second term, during which the Asiatic ": null
    },
    {
        "cholera": "Cholera"
    },
    {
        " afflicted the country. The secular clergy that was still in the country, persuaded the uneducated people of the interior that the disease was caused by the poisoning of the springs by order of the government and turned the complaints against Gálvez into a religious war. Peasant revolts began in 1837 and under chants of Hurray for the true religion! and Down with the heretics! started growing and spreading. Gálvez asked the National Assembly to transfer the capital of the Federation from Guatemala City to ": null
    },
    {
        "San Salvador": "San Salvador"
    },
    {
        ".     His major opponents were Colonel and Juan de Dios Mayorga; also, ": null
    },
    {
        "José Francisco Barrundia": "José Francisco Barrundia"
    },
    {
        " and ": null
    },
    {
        "Pedro Molina": "Pedro Molina"
    },
    {
        ", who had been his friends and party colleagues, came to oppose him in the later years of his government after he violently tried to repress the peasant revolt using a scorched earth approach against rural communities.     In 1838, ": null
    },
    {
        "Antigua Guatemala": "Antigua Guatemala"
    },
    {
        ", ": null
    },
    {
        "Chiquimula": "Chiquimula"
    },
    {
        " and ": null
    },
    {
        "Salamá": "Salamá"
    },
    {
        " withdrew recognition of his government, and in February of that year ": null
    },
    {
        "Rafael Carreras": "Rafael Carrera"
    },
    {
        "revolutionary forces entered Guatemala City asking for the Cathedral to be opened to restore order in the catholic communities, The Cathedral had remained closed since the archbishop and regular clergy had been expelled from Guatemala in 1829. obliging Gálvez to relinquish power. Gálvez remained in the city after he lost power.            In 1838, the liberal forces of the Honduran leader ": null
    },
    {
        "Francisco Morazán": "Francisco Morazán"
    },
    {
        " and Guatemalan ": null
    },
    {
        "José Francisco Barrundia": "José Francisco Barrundia"
    },
    {
        " invaded Guatemala and reached San Sur, where they executed Pascual Alvarez, Carreras father-in-law. They impaled his head on a pike as a warning to all followers of the Guatemalan caudillo. On learning this, Carrera and his wife Petrona – who had come to confront Morazán as soon as they learned of the invasion and were in Mataquescuintla – swore they would never forgive Morazán even in his grave; they felt it impossible to respect anyone who would not avenge family members.     After sending several envoys, whom Carrera would not receive – especially Barrundia whom Carrera did not want to murder in cold blood – Morazán began a scorched earth offensively, destroying villages in his path and stripping them of their few assets. The Carrera forces had to hide in the mountains.  Believing that Carrera was totally defeated, Morazán and Barrundia marched on to ": null
    },
    {
        "Guatemala City": "Guatemala City"
    },
    {
        ", where they were welcomed as saviors by the state governor Pedro Valenzuela and members of the conservative Aycinena Clan, who proposed to sponsor one of the liberal battalions, while Valenzuela and Barrundia gave Morazán all the Guatemalan resources needed to solve any financial problem he had. The ": null
    },
    {
        "criollos": "Criollo People"
    },
    {
        " of both parties celebrated until dawn that they finally had a criollo caudillo like Morazán, who was able to crush the peasant rebellion.     Morazán used the proceeds to support Los Altos and then replaced Valenzuela by ": null
    },
    {
        "Mariano Rivera Paz": "Mariano Rivera Paz"
    },
    {
        ", member of the Aycinena clan, although he did not return to that clan any property confiscated in 1829; in revenge, Juan José de Aycinena y Piñol voted for the dissolution of the Central American Federation in ": null
    },
    {
        "San Salvador": "San Salvador"
    },
    {
        " a little later, forcing Morazán to return to El Salvador to fight to save his federal mandate. Along the way, Morazán increased repression in eastern Guatemala, as punishment for helping Carrera. Knowing that Morazán had gone to El Salvador, Carrera tried to take ": null
    },
    {
        "Salamá": "Salamá"
    },
    {
        " with the small force that remained but was defeated, losing his brother Laureano in the combat. With just a few men left, he managed to escape, badly wounded, to Sanarate. After recovering to some extent, he attacked a detachment in Jutiapa and managed to get a small amount of booty which he handed to the volunteers who accompanied him and prepared to attack Petapa – near Guatemala City – where he was victorious, though with heavy casualties.     In September of that year, he attempted an assault on the capital of Guatemala, but the liberal general ": null
    },
    {
        "Carlos Salazar Castro": "Carlos Salazar Castro"
    },
    {
        " defeated him in the fields of Villa Nueva and Carrera had to retreat. After an unsuccessful attempt to take the Quetzaltenango, Carrera was surrounded and wounded, and he had to capitulate to the Mexican General Agustin Guzman, who had been in Quetzaltenango since the time of ": null
    },
    {
        "Vicente Filísolas": "Vicente Filísola"
    },
    {
        "arrival in 1823. Morazán had the opportunity to shoot Carrera, but did not because he needed the support of the Guatemalan peasants to counter the attacks of ": null
    },
    {
        "Francisco Ferrera": "Francisco Ferrera"
    },
    {
        " in ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        "; instead, Morazán left Carrera in charge of a small fort in Mita, and without any weapons. Knowing that Morazán was going to attack El Salvador, ": null
    },
    {
        "Francisco Ferrera": "Francisco Ferrera"
    },
    {
        " gave arms and ammunition to Carrera and convinced him to attack Guatemala City.     Meanwhile, despite insistent advice to definitely crush Carrera and his forces, Salazar tried to negotiate with him diplomatically; he even went as far as to show that he neither feared nor distrusted Carrera by removing the fortifications of the Guatemalan capital, in place in since the battle of Villa Nueva. Taking advantage of Salazars good faith and Ferreras weapons, Carrera took Guatemala City by surprise on 13 April 1839; Castro Salazar, Mariano Gálvez and Barrundia fled before the arrival of Carreras militiamen. Salazar, in his nightshirt, vaulted roofs of neighboring houses and sought refuge; reaching the border disguised as a peasant. With Salazar gone, Carrera reinstated Rivera Paz as Head of State of Guatemala.                    On 2 April 1838, in the city of ": null
    },
    {
        "Quetzaltenango": "Quetzaltenango"
    },
    {
        ", a secessionist group founded the independent ": null
    },
    {
        "State of Los Altos": "Los Altos"
    },
    {
        " which sought independence from Guatemala. The most important members of the Liberal Party of Guatemala and liberal enemies of the conservative regime moved to Los Altos, leaving their exile in El Salvador. The liberals in Los Altos began severely criticizing the Conservative government of Rivera Paz; they had their own newspaper – El Popular, which contributed to the harsh criticism.     Los Altos was the region with the main production and economic activity of the former state of Guatemala. without Los Altos, conservatives lost much of the resources that had given Guatemala hegemony in Central America. Then, the government of Guatemala tried to reach to a peaceful solution, but altenses, Altenses is how people from Quetzaltenango are known in Guatemala. protected by the recognition of the Central American Federation Congress, did not accept; Guatemalas government then resorted to force, sending Carrera as commanding general of the Army to subdue Los Altos.     Carrera defeated General Agustin Guzman when the former Mexican officer tried to ambush him and then went on to ": null
    },
    {
        "Quetzaltenango": "Quetzaltenango"
    },
    {
        ", where he imposed a harsh and hostile conservative regime instead of the liberals. Calling all council members, he told them flatly that he was behaving leniently towards them as it was the first time they had challenged him, but sternly warned them that there would be no mercy if there was a second time. Finally, Guzmán, and the head of state of Los Altos, Marcelo Molina, were sent to the capital of Guatemala, where they were displayed as trophies of war during a triumphant parade on 17 February 1840; in the case of Guzman, shackled, still with bleeding wounds, and riding a mule.          On 18 March 1840, liberal caudillo Morazán invaded Guatemala with 1500 soldiers to avenge the insult done in Los Altos. Fearing that such action would end with liberal efforts to hold together the Central American Federation, Guatemala had a cordon of guards from the border with El Salvador; without a telegraph service, men ran carrying last-minute messages. With the information from these messengers, Carrera hatched a plan of defense leaving his brother Sotero in charge of troops who presented only slight resistance in the city. Carrera pretended to flee and led his ragtag army to the heights of Aceituno, with few men, few rifles and two old cannons. The city was at the mercy of the army of Morazán, with bells of the twenty churches ringing for divine assistance.     Once Morazán reached the capital, he took it very easyily and freed Guzman, who immediately left for Quetzaltenango to give the news that Carrera was defeated; Carrera then, taking advantage of what his enemies believed, applied a strategy of concentrating fire on the Central Park of the city and also employed surprise attack tactics which caused heavy casualties to the army of Morazán, finally forcing the survivors to fight for their lives. Among those fighting in these battles was the famous Guatemalan poet ": null
    },
    {
        "José Batres Montúfar": "José Batres Montúfar"
    },
    {
        "  Morazáns soldiers lost the initiative and their previous numerical superiority. Furthermore, in unfamiliar surroundings in the city, they had to fight, carry their dead and care for their wounded while resentful and tired from the long march from ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        " to Guatemala.     Carrera, by then an experienced military man, was able to defeat Morazán thoroughly. The disaster for the liberal general was complete: aided by Angel Molina -son of Guatemalan Liberal leader ": null
    },
    {
        "Pedro Molina Mazariegos": "Pedro Molina Mazariegos"
    },
    {
        "- who knew the streets of the city, had to flee with his favorite men, disguised, shouting Long live Carrera! through the ravine of El Incienso to El Salvador. In his absence, Morazán had been supplanted as Head of State of his country, and had to embark for exile in ": null
    },
    {
        "Perú": "Perú"
    },
    {
        ". In Guatemala, survivors from his troops were shot without mercy, while Carrera was out in unsuccessful pursuit of Morazán. This engagement sealed the status of Carrera and marked the decline of Morazán, and forced the conservative Aycinena clan ": null
    },
    {
        "criollos": "Criollo People"
    },
    {
        "to negotiate with Carrera and his peasant revolutionary supporters.     Guzmán, who was freed by Morazán when the latter had seemingly defeated Carrera in ": null
    },
    {
        "Guatemala City": "Guatemala City"
    },
    {
        ", had gone back to Quetzaltenango to bring the good news. The city liberal criollo leaders rapidly reinstated the Los Altos State and celebrated Morazáns victory. However, as soon as Carrera and the newly reinstated ": null
    },
    {
        "Mariano Rivera Paz": "Mariano Rivera Paz"
    },
    {
        " heard the news, Carrera went back to Quetzaltenango with his volunteer army to regain control of the rebel liberal state once and for all. On 2 April 1840, after entering the city, Carrera told the citizens that he had already warned them after he defeated them earlier that year. Then, he ordered the majority of the liberal city hall officials from Los Altos to be shot. Carrera then forcibly annexed Quetzaltenango and much of Los Altos back into conservative Guatemala.     After the violent and bloody reinstatement of the State of Los Altos by Carrera in April 1840, ": null
    },
    {
        "Luis Batres Juarros": "Luis Batres Juarros"
    },
    {
        " – conservative member of the Aycinena Clan, then secretary general of the Guatemalan government of recently reinstated ": null
    },
    {
        "Mariano Rivera Paz": "Mariano Rivera Paz"
    },
    {
        " – obtained from the vicar Larrazabal authorization to dismantle the regionalist Church. Serving priests of ": null
    },
    {
        "Quetzaltenango": "Quetzaltenango"
    },
    {
        " – capital of the would-be-state of Los Altos, Urban Ugarte and his coadjutor, José Maria Aguilar, were removed from their parish and likewise the priests of the parishes of ": null
    },
    {
        "San Martin Jilotepeque": "San Martin Jilotepeque"
    },
    {
        " and ": null
    },
    {
        "San Lucas Tolimán": "San Lucas Tolimán"
    },
    {
        ". Larrazabal ordered the priests Fernando Antonio Dávila, Mariano Navarrete and Jose Ignacio Iturrioz to cover the parishes of Quetzaltenango, San Martin Jilotepeque and San Lucas Toliman, respectively.     The liberal criollos defeat and execution in Quetzaltenango enhanced Carreras status with the native population of the area, whom he respected and protected.     In 1840, Belgium began to act as an external source of support for Carreras independence movement, in an effort to exert influence in Central America. The Compagnie belge de colonisation , commissioned by Belgian King ": null
    },
    {
        "Leopold I": "Leopold I Of Belgium"
    },
    {
        ", became the administrator of ": null
    },
    {
        "Santo Tomas de Castilla": "Santo Tomas De Castilla"
    },
    {
        " replacing the failed British ": null
    },
    {
        "Eastern Coast of Central America Commercial and Agricultural Company": "Eastern Coast Of Central America Commercial And Agricultural Company"
    },
    {
        ". Even though the colony eventually crumbled, Belgium continued to support Carrera in the mid-19th century, although Britain continued to be the main business and political partner to Carreras regime.     Rafael Carrera was elected Guatemalan Governor in 1844. On 21 March 1847, Guatemala declared itself an independent republic and Carrera became its first president.             During the first term as president, Carrera had brought the country back from extreme conservatism to a traditional moderation; in 1848, the liberals were able to drive him from office, after the country had been in turmoil for several months. Carrera resigned of his own free will and left for México. The new liberal regime allied itself with the Aycinena family and swiftly passed a law ordering Carreras execution if he dared to return to Guatemalan soil. The liberal criollos from ": null
    },
    {
        "Quetzaltenango": "Quetzaltenango"
    },
    {
        " were led by general ": null
    },
    {
        "Agustín Guzmán": "Agustín Guzmán"
    },
    {
        " who occupied the city after Corregidor general ": null
    },
    {
        "Mariano Paredes": "Mariano Paredes"
    },
    {
        " was called to ": null
    },
    {
        "Guatemala City": "Guatemala City"
    },
    {
        " to take over the Presidential office. They declared on 26 August 1848 that Los Altos was an independent state once again. The new state had the support of Vasconcelos regime in ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        " and the rebel guerrilla army of Vicente and Serapio Cruz who were sworn enemies of Carrera. The interim government was led by Guzmán himself and had Florencio Molina and the priest Fernando Davila as his Cabinet members. On 5 September 1848, the criollos altenses chose a formal government led by Fernando Antonio Martínez.     In the meantime, Carrera decided to return to Guatemala and did so entering by ": null
    },
    {
        "Huehuetenango": "Huehuetenango"
    },
    {
        ", where he met with the native leaders and told them that they must remain united to prevail; the leaders agreed and slowly the segregated native communities started developing a new Indian identity under Carreras leadership. In the meantime, in the eastern part of Guatemala, the Jalapa region became increasingly dangerous; former president ": null
    },
    {
        "Mariano Rivera Paz": "Mariano Rivera Paz"
    },
    {
        " and rebel leader Vicente Cruz were both murdered there after trying to take over the Corregidor office in 1849.     When Carrera arrived to ": null
    },
    {
        "Chiantla": "Chiantla"
    },
    {
        " in ": null
    },
    {
        "Huehuetenango": "Huehuetenango"
    },
    {
        ", he received two altenses emissaries who told him that their soldiers were not going to fight his forces because that would lead to a native revolt, much like that of 1840; their only request from Carrera was to keep the natives under control. The altenses did not comply, and led by Guzmán and his forces, they started chasing Carrera; the caudillo hid helped by his native allies and remained under their protection when the forces of ": null
    },
    {
        "Miguel Garcia Granados": "Miguel Garcia Granados"
    },
    {
        " – who arrived from ": null
    },
    {
        "Guatemala City": "Guatemala City"
    },
    {
        " were looking for him.     On learning that officer ": null
    },
    {
        "José Víctor Zavala": "José Víctor Zavala"
    },
    {
        " had been appointed as Corregidor in ": null
    },
    {
        "Suchitepéquez Department": "Suchitepéquez Department"
    },
    {
        ", Carrera and his hundred jacalteco bodyguards crossed a dangerous jungle infested with jaguars to meet his former friend. When they met, Zavala not only did not capture him, but agreed to serve under his orders, thus sending a strong message to both liberal and conservatives in Guatemala City that they would have to negotiate with Carrera or battle on two fronts – Quetzaltenango and Jalapa. Carrera went back to the Quetzaltenango area, while Zavala remained in Suchitepéquez as a tactical maneuver. Carrera received a visit from a Cabinet member of Paredes and told him that he had control of the native population and that he assured Paredes that he would keep them appeased. When the emissary returned to Guatemala City, he told the president everything Carrera said, and added that the native forces were formidable.     Guzmán went to ": null
    },
    {
        "Antigua Guatemala": "Antigua Guatemala"
    },
    {
        " to meet with another group of Paredes emissaries; they agreed that Los Altos would rejoin Guatemala, and that the latter would help Guzmán defeat his hated enemy and also build a port on the Pacific Ocean. Guzmán was sure of victory this time, but his plan evaporated when, in his absence, Carrera and his native allies had occupied Quetzaltenango; Carrera appointed Ignacio Yrigoyen as Corregidor and convinced him that he should work with the kiche, mam, qanjobal and mam leaders to keep the region under control. On his way out, Yrigoyen murmured to a friend: Now he is the King of the Indians, indeed!     Guzmán then left for Jalapa, where he struck a deal with the rebels, while ": null
    },
    {
        "Luis Batres Juarros": "Luis Batres Juarros"
    },
    {
        " convinced President Paredes to deal with Carrera. Back in Guatemala City within a few months, Carrera was commander-in-chief, backed by military and political support of the Indian communities from the densely populated western highlands. During the first presidency from 1844 to 1848, he brought the country back from excessive conservatism to a moderate regime, and – with the advice of Juan José de Aycinena y Piñol and ": null
    },
    {
        "Pedro de Aycinena": "Pedro De Aycinena"
    },
    {
        " – restored relations with the Church in Rome with a ": null
    },
    {
        "Concordat ratified in 1854": "Concordat Of 1854"
    },
    {
        ". He also kept peace between natives and criollos, with the latter fearing a rising like the one that was taking place in Yucatán at the time.            In Yucatán, then an independent republic north of Guatemala, a war started between the natives and criollo people; this war seemed rooted in the defense of communal lands against the expansion of private ownership, which was accentuated by the boom in the production of ": null
    },
    {
        "henequen": "Henequen"
    },
    {
        ", which was an important industrial fiber used to make rope. After discovering the value of the plant, the wealthier Yucateco criollos started plantations, beginning in 1833, to cultivate it on a large scale; not long after the henequen boom, a boom in sugar production led to more wealth. The sugar and henequen plantations encroached on native communal land, and native workers recruited to work on the plantations were mistreated and underpaid.     However, rebel leaders in their correspondence with British Honduras -Belize- were more often inclined to cite taxation as the immediate cause of the war; Jacinto Pat, for example, wrote in 1848 that what we want is liberty and not oppression, because before we were subjugated with the many contributions and taxes that they imposed on us.  Pacs companion, Cecilio Chi added in 1849, that promises made by the rebel Santiago Imán, that he was liberating the Indians from the payment of contributions as a reason for resisting the central government, but in fact he continued levying them.     In June 1847, Méndez learned that a large force of armed natives and supplies had gathered at the Culumpich, a property owned by Jacinto Pat, the Maya batab , near Valladolid. Fearing revolt, Mendez arrested ": null
    },
    {
        "Manuel Antonio Ay": "Manuel Antonio Ay"
    },
    {
        ", the principal Maya leader of Chichimilá, accused of planning a revolt, and executed him at the town square of Valladolid. Furthermore, Méndez searching for other insurgents burned the town of Tepich and repressed its residents. In the following months, several Maya towns were sacked and many people arbitrarily killed. In his letter of 1849, Cecilio Chi noted that Santiago Mendez had come to put every Indian, big and little, to death but that the Maya had responded to some degree, in kind, writing it has pleased God and good fortune that a much greater portion of them than of the Indians      Cecilio Chi, the native leader of Tepich, along with Jacinto Pat attacked Tepich on 30 July 1847, in reaction to the indiscriminate massacre of Mayas, ordered that all the non-Maya population be killed. By spring of 1848, the Maya forces had taken over most of the Yucatán, with the exception of the walled cities of ": null
    },
    {
        "Campeche": "Campeche, Campeche"
    },
    {
        " and ": null
    },
    {
        "Mérida": "Mérida, Yucatán"
    },
    {
        " and the south-west coast, with Yucatecan troops holding the road from Mérida to the port of ": null
    },
    {
        "Sisal": "Sisal, Yucatán"
    },
    {
        ". The Yucatecan governor ": null
    },
    {
        "Miguel Barbachano": "Miguel Barbachano"
    },
    {
        " had prepared a decree for the evacuation of Mérida, but was apparently delayed in publishing it by the lack of suitable paper in the besieged capital. The decree became unnecessary when the republican troops suddenly broke the siege and took the offensive with major advances.     Governor Barbachano sought allies anywhere he could find them, in Cuba , Jamaica and the United States, but none of these foreign powers would intervene, although the matter was taken seriously enough in the United States to be debated in Congress. Subsequently, therefore, he turned to Mexico, and accepted a return to Mexican authority. Yucatán was officially reunited with Mexico on 17 August 1848. Yucateco forces rallied, aided by fresh guns, money, and troops from Mexico, and pushed back the natives from more than half of the state.     By 1850 the nativesoccupied two distinct regions in the southeast and they were inspired to continue the struggle by the apparition of the Talking Cross . This apparition, believed to be a way in which God communicated with the Maya, dictated that the War continue. Chan Santa Cruz, or Small Holy Cross became the religious and political center of the Maya resistance and the rebellion came to be infused with religious significance. Chan Santa Cruz also became the name of the largest of the independent Maya states, as well as the name of the capital city which is now the city of ": null
    },
    {
        "Felipe Carrillo Puerto, Quintana Roo": "Felipe Carrillo Puerto, Quintana Roo"
    },
    {
        ". The followers of the Cross were known as the Cruzob .     The government of Yucatán first declared the war over in 1855, but hopes for peace were premature. There were regular skirmishes, and occasional deadly major assaults into each others territory, by both sides. The ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " recognized the Chan Santa Cruz Maya as a de facto independent nation, in part because of the major trade between Chan Santa Cruz and ": null
    },
    {
        "British Honduras": "British Honduras"
    },
    {
        ".               After Carrera returned from exile in 1849, Vasconcelos granted asylum to the Guatemalan liberals, who harassed the Guatemalan government in several different forms: José Francisco Barrundia did it through a liberal newspaper established with that specific goal; Vasconcelos gave support during a whole year to a rebel faction La Montaña , in eastern Guatemala, providing and distributing money and weapons. By late 1850, Vasconcelos was getting impatient at the slow progress of the war with Guatemala and decided to plan an open attack. Under that circumstance, the Salvadorean head of state started a campaign against the conservative Guatemalan regime, inviting ": null
    },
    {
        "Honduras": "Honduras"
    },
    {
        " and ": null
    },
    {
        "Nicaragua": "Nicaragua"
    },
    {
        " to participate in the alliance; only the ": null
    },
    {
        "Honduran": "Honduras"
    },
    {
        " government led by ": null
    },
    {
        "Juan Lindo": "Juan Lindo"
    },
    {
        " accepted.     Meanwhile, in Guatemala, where the invasion plans were perfectly well known, President ": null
    },
    {
        "Mariano Paredes": "Mariano Paredes"
    },
    {
        " started taking precautions to face the situation, while the Guatemalan Archbishop, ": null
    },
    {
        "Francisco de Paula García Peláez": "Francisco De Paula García Peláez"
    },
    {
        ", ordered peace prayers in the archdiocese.      On 4 January 1851, ": null
    },
    {
        "Doroteo Vasconcelos": "Doroteo Vasconcelos"
    },
    {
        " and Juan Lindo met in ": null
    },
    {
        "Ocotepeque": "Ocotepeque"
    },
    {
        ", Honduras, where they signed an alliance against Guatemala. The Salvadorean army had 4,000 men, properly trained and armed and supported by artillery; the Honduran army numbered 2,000 men. The coalition army was stationed in ": null
    },
    {
        "Metapán": "Metapán"
    },
    {
        ", El Salvador, due to its proximity with both the Guatemalan and Honduran borders.     On 28 January 1851, Vasconcelos sent a letter to the Guatemalan Ministry of Foreign Relations, in which he demanded that the Guatemalan president relinquish power, so that the alliance could designate a new head of state loyal to the liberals and that Carrera be exiled, escorted to any of the Guatemalan southern ports by a Salvadorean regiment. The Guatemalan government did not accept the terms and the Allied army entered Guatemalan territory at three different places. On 29 January, a 500-man contingent entered through Piñuelas, ": null
    },
    {
        "Agua Blanca": "Agua Blanca, Jutiapa"
    },
    {
        " and ": null
    },
    {
        "Jutiapa": "Jutiapa"
    },
    {
        ", led by General Vicente Baquero, but the majority of the invading force marched from Metapán. The Allied army was composed of 4,500 men led by Vasconcelos, as Commander in Chief. Other commanders were the generals ": null
    },
    {
        "José Santos Guardiola": "José Santos Guardiola"
    },
    {
        ", ": null
    },
    {
        "Ramón Belloso": "Ramón Belloso"
    },
    {
        ", ": null
    },
    {
        "José Trinidad Cabañas": "José Trinidad Cabañas"
    },
    {
        " and ": null
    },
    {
        "Gerardo Barrios": "Gerardo Barrios"
    },
    {
        ". Guatemala was able to recruit 2,000 men, led by Lieutenant General Carrera as Commander in Chief, with several colonels.     Carreras strategy was to feign a retreat, forcing the enemy forces to follow the retreating troops to a place he had previously chosen; on 1 February 1851, both armies were facing each other with only the San José river between them. Carrera had fortified the foothills of La Arada, its summit about  above the level of the river. A meadow  deep lay between the hill and the river, and boarding the meadow was a sugar cane plantation. Carrera divided his army in three sections: the left wing was led by Cerna and Solares; the right wing led by Bolaños. He personally led the central battalion, where he placed his artillery. Five hundred men stayed in ": null
    },
    {
        "Chiquimula": "Chiquimula"
    },
    {
        " to defend the city and to aid in a possible retreat, leaving only 1,500 Guatemalans against an enemy of 4,500.     The battle began at 8:30  AM, when Allied troops initiated an attack at three different points, with an intense fire opened by both armies. The first Allied attack was repelled by the defenders of the foothill; during the second attack, the Allied troops were able to take the first line of trenches. They were subsequently expelled. During the third attack, the Allied force advanced to a point where it was impossible to distinguish between Guatemalan and Allied troops. Then, the fight became a melée, while the Guatemalan artillery severely punished the invaders. At the height of the battle when the Guatemalans faced an uncertain fate, Carrera ordered that sugar cane plantation around the meadow to be set on fire. The invading army was now surrounded: to the front, they faced the furious Guatemalan firepower, to the flanks, a huge blaze and to the rear, the river, all of which made retreat very difficult. The central division of the Allied force panicked and started a disorderly retreat. Soon, all of the Allied troops started retreating.     The 500 men of the rearguard pursued what was left of the Allied army, which desperately fled for the borders of their respective countries. The final count of the Allied losses were 528 dead, 200 prisoners, 1,000 rifles, 13,000 rounds of ammunition, many pack animals and baggage, 11 drums and seven artillery pieces. Vasconcelos sought refuge in ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        ", while two Generals mounted on the same horse were seen crossing the Honduran border. Carrera regrouped his army and crossed the Salvadorean border, occupying ": null
    },
    {
        "Santa Ana": "Santa Ana, El Salvador"
    },
    {
        ", before he received orders from the Guatemalan President, Mariano Paredes, to return to Guatemala, since the Allies were requesting a cease-fire and a peace treaty.                 The Concordat of 1854 was an international treaty between Carrera and the ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        ", signed in 1852 and ratified by both parties in 1854. Through this, Guatemala gave the education of Guatemalan people to regular orders of the Catholic Church, committed to respect ecclesiastical property and monasteries, imposed mandatory tithing and allowed the bishops to censor what was published in the country; in return, Guatemala received dispensations for the members of the army, allowed those who had acquired the properties that the liberals had expropriated from the Church in 1829 to keep those properties, received the taxes generated by the properties of the Church, and had the right to judge certain crimes committed by clergy under Guatemalan law. The concordat was designed by Juan José de Aycinena y Piñol and not only reestablished but reinforced the relationship between Church and State in Guatemala. It was in force until the fall of the conservative government of Field Marshal ": null
    },
    {
        "Vicente Cerna y Cerna": "Vicente Cerna Y Cerna"
    },
    {
        ".     In 1854, by initiative of ": null
    },
    {
        "Manuel Francisco Pavón Aycinena": "Manuel Francisco Pavón Aycinena"
    },
    {
        ", Carrera was declared supreme and perpetual leader of the nation for life, with the power to choose his successor. He was in that position until he died on 14 April 1865. While he pursued some measures to set up a foundation for economic prosperity to please the conservative landowners, military challenges at home and in a three-year war with ": null
    },
    {
        "Honduras": "Honduras"
    },
    {
        ", El Salvador, and ": null
    },
    {
        "Nicaragua": "Nicaragua"
    },
    {
        " dominated his presidency. His rivalry with ": null
    },
    {
        "Gerardo Barrios": "Gerardo Barrios"
    },
    {
        ", President of El Salvador, resulted in open war in 1863.     At ": null
    },
    {
        "Coatepeque": "Coatepeque, Quetzaltenango"
    },
    {
        " the Guatemalans suffered a severe defeat, which was followed by a truce. Honduras joined with El Salvador, and Nicaragua and ": null
    },
    {
        "Costa Rica": "Costa Rica"
    },
    {
        " with Guatemala. The contest was finally settled in favor of Carrera, who besieged and occupied San Salvador, and dominated Honduras and Nicaragua. He continued to act in concert with the Clerical Party, and tried to maintain friendly relations with the European governments. Before his death, Carrera nominated his friend and loyal soldier, Army Marshall Vicente Cerna y Cerna, as his successor.                    The Belize region in the ": null
    },
    {
        "Yucatán Peninsula": "Yucatán Peninsula"
    },
    {
        " was never occupied by either Spain or Guatemala. Spain made some exploratory expeditions in the 16th century that served as her basis to claim the area.  Guatemala simply inherited that argument to claim the territory, even though it never sent an expedition to the area after independence from Spain, due to the ensuing Central American civil war that lasted until 1860.     The British had had a small settlement there since the middle of the 17th century, mainly as buccaneers quarters and then for wood production. The settlements were never recognized as British colonies although they were somewhat under the jurisdiction of the British Jamaican government. In the 18th century, Belize became the main smuggling center for Central America, even though the British accepted Spains sovereignty over the region via the 1783 and 1786 treaties, in exchange for a ceasefire and the authorization for British subjects to work with Belizes precious woods.     After 1821, Belize became the leading edge of Britains commercial entrance in the isthmus. British commercial brokers established themselves and began prosperous commercial routes plying the Caribbean harbors of Guatemala, Honduras and Nicaragua.     When Carrera came to power in 1840 he stopped the complaints over Belize and established a Guatemalan consulate in the region to oversee Guatemalan interests. Belize commerce boomed in the region until 1855, when the Colombians built a transoceanic railway that allowed commerce to flow more efficiently between the oceans. Thereafter Belizes commercial importance declined. When the ": null
    },
    {
        "Caste War of Yucatán": "Caste War Of Yucatán"
    },
    {
        " began in the ": null
    },
    {
        "Yucatán Peninsula": "Yucatán Peninsula"
    },
    {
        " the Belize and Guatemala representatives were on high alert; Yucatán refugees fled into both Guatemala and Belize and Belizes superintendent came to fear that Carrera–given his strong alliance with Guatemalan natives–could support the native uprisings.     In the 1850s, the British employed goodwill to settle the territorial differences with Central American countries. They: withdrew from the Mosquito Coast in ": null
    },
    {
        "Nicaragua": "Nicaragua"
    },
    {
        " and began talks that would end by restoring the territory to Nicaragua in 1894: returned the Bay Islands to ": null
    },
    {
        "Honduras": "Honduras"
    },
    {
        " and negotiated with the American ": null
    },
    {
        "filibuster": "Filibuster"
    },
    {
        " William Walker": "William Walker"
    },
    {
        " in an effort to avoid the invasion of Honduras. They signed a treaty with Guatemala regarding Belizes borders, which has been called by Guatemalans as the worst mistake made by the regime of Rafael Carrera.     ": null
    },
    {
        "Pedro de Aycinena y Piñol": "Pedro De Aycinena Y Piñol"
    },
    {
        ", as Foreign Secretary, made an extra effort to keep good relations with the British crown. In 1859, Walker again threatened Central America; in order to get the weapons needed to face the filibuster, Carreras regime had to come to terms about Belize with the British Empire. On 30 April 1859, the Wyke-Aycinena treaty was signed, between the British and Guatemalan representatives. The controversial treaty had two parts:     The first six articles clearly defined the Guatemala-Belize border: Guatemala acknowledged Britains sovereignty over Belize.      Among those who signed the treaty was ": null
    },
    {
        "José Milla y Vidaurre": "José Milla Y Vidaurre"
    },
    {
        ", who worked with Aycinena in the Foreign Ministry at the time. Carrera ratified the treaty on 1 May 1859, while Charles Lennox Wyke, British consul in Guatemala, traveled to Great Britain and got royal approval on 26 September 1859. American consul Beverly Clarke objected with some liberal representatives, but the issue was settled.     As of 1850, it was estimated that Guatemala had a population of 600,000.     Guatemalas Liberal Revolution came in 1871 under the leadership of ": null
    },
    {
        "Justo Rufino Barrios": "Justo Rufino Barrios"
    },
    {
        ", who worked to modernize the country, improve trade and introduce new crops and manufacturing. During this era coffee became an important crop for Guatemala. Barrios had ambitions of reuniting Central America and took the country to war in an unsuccessful attempt to attain it, losing his life on the battlefield in 1885 to forces in El Salvador.                 The Conservative government in ": null
    },
    {
        "Honduras": "Honduras"
    },
    {
        " gave military backing to a group of Guatemalan Conservatives wishing to take back the government, so Barrios declared war on the Honduran government. At the same time, Barrios, together with President ": null
    },
    {
        "Luis Bogran": "Luis Bogran"
    },
    {
        " of ": null
    },
    {
        "Honduras": "Honduras"
    },
    {
        ", declared an intention to reunify the old ": null
    },
    {
        "United Provinces of Central America": "United Provinces Of Central America"
    },
    {
        ".     During his time in office, Barrios continued with the liberal reforms initiated by García Granados, but he was more aggressive implementing them. A summary of his reforms is: ": null
    },
    {
        "regular clergy": "Regular Clergy"
    },
    {
        " such as Morazán had done in 1829 and confiscated their properties.     ::     Forbid mandatory tithing to weaken ": null
    },
    {
        "secular clergy": "Secular Clergy"
    },
    {
        " members and the archbishop.   Established civil marriage as the only official one in the country   Secular cemeteries   Civil records superseded religious ones   Established secular education across the country   Established free and mandatory elementary schools   Closed the ": null
    },
    {
        "Pontifical University of San Carlos": "University Of San Carlos Of Guatemala"
    },
    {
        " and in its place created the secular National University.     Barrios had a National Congress totally pledge to his will, and therefore he was able to create a new constitution in 1879, which allowed him to be reelected as president for another six-year term.     He also was intolerant with his political opponents, forcing a lot of them to flee the country and building the infamous Guatemalan Central penitentiary where he had numerous people incarcerated and tortured.     Appletons guide for México and Guatemala from 1884, shows the twenty departments in which Guatemala was divided during Barrios time in office:                          During Barrios tenure, the indian land that the conservative regime of ": null
    },
    {
        "Rafael Carrera": "Rafael Carrera"
    },
    {
        " had so strongly defended was confiscated and distributed among those officers who had helped him during the Liberal Revolution in 1871. Decree 170 made it easy to confiscate those lands in favor of the army officers and the German settlers in ": null
    },
    {
        "Verapaz": "Baja Verapaz"
    },
    {
        " as it allowed to publicly sell those common Indian lots. Therefore, the fundamental characteristic of the productive system during Barrios regime was the accumulation of large extension of land among few owners and a sort of farmland servitude , based on the exploitation of the native day laborers.     In order to make sure that there was a steady supply of day laborers for the coffee plantations, which required a lot of them, Barrios government decreed the Day Laborer regulations, labor legislation that placed the entire native population at the disposition of the new and traditional Guatemalan landlords, except the ": null
    },
    {
        "regular clergy": "Regular Clergy"
    },
    {
        ", who were eventually expelled form the country and saw their properties confiscated. This decree set the following for the native Guatemalans:     Were forced by law to work on farms when the owners of those required them, without any regard for where the native towns were located.   Were under control of local authorities, who were in charge to make sure that day laborer batches were sent to all the farms that required them.   Were subject to habilitationday laborer booklet     In 1879, a constitution was ratified for Guatemala . In 1880, Barrios was reelected President for a six-year term. Barrios unsuccessfully attempted to get the United States of America to mediate the disputed boundary between Guatemala and Mexico .           General Manuel Lisandro Barillas Bercián was able to become interim president of Guatemala after the death of President Justo Rufino Barrios in the Batalla of Chalchuapa in El Salvador in April 1885 and after the resignation of first designate Alejandro Manuel Sinibaldi Castro , by means of a clever scam: he went to the General Cemetery when Barrios was being laid to rest and told the Congress president: please prepare room and board for the 5,000 troops that I have waiting for my orders in Mixco . The congress president was scared of this, and declared Barillas interim president on the spot. By the time he realized that it was all a lie, it was too late to change anything.     Instead of calling for elections, as he should have, Barillas Bercián was able to be declared President on 16 March 1886 and remained in office until 1892.     During the government of general Barillas Bercián, the Carrera theater was remodeled to celebrate the Discovery of America fourth centennial; the Italian community in Guatemala donated a statue of Christopher Columbus -Cristóbal Colón, in Spanish- which was placed next to the theater. Since then, the place was called Colón Theater .     In 1892, Barillas called for elections as he wanted to take care of his personal business; it was the first election in Guatemala that allowed the candidates to make propaganda in the local newspapers. The candidates who ran for office were:         Barillas Bercian was unique among liberal presidents of Guatemala between 1871 and 1944: he handed over power to his successor peacefully. When election time approached, he sent for the three Liberal candidates to ask them what their government plan would be. Happy with what he heard from general Reyna Barrios , Barillas made sure that a huge column of Quetzaltenango and Totonicapán Indigenous people came down from the mountains to vote for general Reyna Barrios. Reyna was elected president. As to not to offend the losing candidates, Barillas gave them checks to cover the costs of their presidential campaigns. Reyna Barrios went on to become President on 15 March 1892.         In the 1890s, the United States began to implement the Monroe Doctrine , pushing out European colonial powers and establishing U.S. hegemony over resources and labor in Latin American nations. The dictators that ruled Guatemala during the late 19th and early 20th century were generally very accommodating to U.S. business and political interests; thus, unlike other Latin American nations such as Haiti, Nicaragua and Cuba the U.S. did not have to use overt military force to maintain dominance in Guatemala. The Guatemalan military/police worked closely with the U.S. military and State Department to secure U.S. interests. The Guatemalan government exempted several U.S. corporations from paying taxes, especially the United Fruit Company , privatized and sold off publicly owned utilities, and gave away huge swaths of public land.           thu ruled Guatemala between 1898 and 1920.     After the assassination of general José María Reina Barrios on 8 February 1898, the Guatemalan cabinet called an emergency meeting to appoint a new successor, but declined to invite Estrada Cabrera to the meeting, even though he was the First Designated to the Presidency. There are two versions on how he was able to get the Presidency: Estrada Cabrera entered with pistol drawn to assert his entitlement to the presidency and Estrada Cabrera showed up unarmed to the meeting and demanded to be given the presidency as he was the First Designated .     The first Guatemalan head of state taken from civilian life in over 50 years, Estrada Cabrera overcame resistance to his regime by August 1898 and called for September elections, which he won handily. At that time, Estrada Cabrera was 44 years old; he was stocky, of medium height, dark, and broad-shouldered. The mustache gave him plebeian appearance. Black and dark eyes, metallic sounding voice and was rather sullen and brooding. At the same time, he already showed his courage and character. This was demonstrated on the night of the death of Reina Barrios when he stood in front of the ministers, meeting in the Government Palace to choose a successor, Gentlemen, let me please sign this decree. As First Designated, you must hand me the Presidency. His first decree was a general amnesty and the second was to reopen all the elementary schools closed by Reyna Barrios, both administrative and political measures aimed to gain the public opinion. Estrada Cabrera was almost unknown in the political circles of the capital and one could not foresee the features of his government or his intentions.     In 1898, the Legislature convened for the election of President Estrada Cabrera, who triumphed thanks to the large number of soldiers and policemen who went to vote in civilian clothes and to the large number of illiterate family that they brought with them to the polls. Also, the effective propaganda that was written in the official newspaper the Liberal Idea . The latter was run by the poet Joaquin Mendez, and among the drafters were Enrique Gómez Carrillo , -a famous writer who had just returned to Guatemala from Paris , and who had confidence that Estrada Cabrera was the president that Guatemala needed- Rafael Spinola , Máximo Soto Hall and Juan Manuel Mendoza, who later would be Gómez Carrillos biographer, and others. Gómez Carrillo received as a reward for his work as political propagandist the appointment as General Consul in Paris, with 250 gold pesos monthly salary and immediately went back to Europe     One of Estrada Cabreras most famous and most bitter legacies was allowing the entry of the United Fruit Company into the Guatemalan economical and political arena. As a member of the Liberal Party , he sought to encourage development of the nations infrastructure of highways, railroads, and sea port s for the sake of expanding the export economy. By the time Estrada Cabrera assumed the presidency, there had been repeated efforts to construct a railroad from the major port of Puerto Barrios to the capital, Guatemala City. Yet due to lack of funding exacerbated by the collapse of the internal coffee trade, the railway fell sixty miles short of its goal. Estrada Cabrera decided, without consulting the legislature or judiciary, that striking a deal with the United Fruit Company was the only way to get finish the railway. Cabrera signed a contract with UFCOs Minor Cooper Keith in 1904 that gave the company tax-exemptions, land grants, and control of all railroads on the Atlantic side.     Estrada Cabrera often employed brutal methods to assert his authority, as that was the school of government in Guatemala at the time. Like him, presidents Rafael Carrera y Turcios and Justo Rufino Barrios had led tyrannical governments in the country. Right at the beginning of his first presidential period, he started prosecuting his political rivals and soon established a well-organized web of spies. One American Ambassador returned to the United States after he learned the dictator had given orders to poison him. Former President Manuel Barillas was stabbed to death in Mexico City, on a street outside of the Mexican Presidential Residence on Cabreras orders; the street now bears the name of Calle Guatemala. Also, Estrada Cabrera responded violently to workers strikes against UFCO. In one incident, when UFCO went directly to Estrada Cabrera to resolve a strike , the president ordered an armed unit to enter the workers compound. The forces arrived in the night, firing indiscriminately into the workers sleeping quarters, wounding and killing an unspecified number.     In 1906, Estrada faced serious revolts against his rule; the rebels were supported by the governments of some of the other Central America n nations, but Estrada succeeded in putting them down. Elections were held by the people against the will of Estrada Cabrera and thus he had the president-elect murdered in retaliation. In 1907, the brothers Avila Echeverría and group of friends decided to kill the president using a bomb along his way. They came from prominent families in Guatemala and studied in foreign universities, but when they returned to their homeland, they found a situation where everybody live in constant fear and the president ruled without any opposition.     Everything was carefully planned. When Estrada Cabrera went for a ride in his carriage, the bomb exploded, killing the horse and the driver, but only slightly injuring the President. Since their attack failed and they were forced to take their own lives; their families also suffered, as they were jailed in the infamous Penitenciaría Central. Conditions in the penitentiary were cruel and foul. Political offenses were tortured daily and their screams could be heard all over the penitentiary. Prisoners regularly died under these conditions since political crimes had no pardon. It has been suggested that the extreme despotic characteristics of Estrada did not emerge until after an attempt on his life in 1907.     Estrada Cabrera continued in power until forced to resign by new revolts in 1920. By that time, his power had declined drastically and he was reliant on the loyalty of a few generals. While the United States threatened intervention if he was removed through revolution, a bipartisan coalition came together to remove him from the presidency. He was removed from office after the national assembly charged that he was mentally incompetent, and appointed Carlos Herrera in his place on 8 April 1920.     In 1920, prince Wilhelm of Sweden visited Guatemala and made a very objective description of both Guatemalan society and Estrada Cabrera government in his book Between two continents, notes from a journey in Central America, 1920. The prince explained the dynamics of the Guatemalan society at the time pointing out that even though it called itself a Republic , Guatemala had three sharply defined classes:     Criollos : a minority conformed originally by ancient families descendants of the Spaniards that conquered Central America and that by 1920 conformed both political parties in the country. By 1920, they were mixed to a large extended with foreigners and the great majority had Indian blood in their veins. They led the country both politically and intellectually partly because their education, although poor for European standards of the time, was enormously superior to the rest of the people of the country, partly because only criollos were allowed in the main political parties and also because their families controlled and for the most part owner the cultivated parts of the country.   Ladinos: middle class. Formed of people born of the cross between natives, blacks and criollos. The held almost no political power in 1920 and made the bulk of artisans, storekeepers, tradesmen and minor officials. In the eastern part of the country were found agricultural laborers.   Indians: the majority conformed by a mass of natives. Uneducated and disinclined to all forms of change, they had furnished excellent soldiers for the Army and often raised, as soldiers, to positions of considerable trust given their disinclination for independent political activity and their inherent respect for government and officialdom. They made the main element in the working agricultural population. There were three categories within them:   Mozos colonos : settled on the plantations. Were given a small piece of land to cultivate on their own account, in return for work in the plantations so many months of the year.   Mozos jornaleros : day-laborers who were contracted to work for certain periods of time. They were paid a daily wage.   ::In theory, each mozo was free to dispose of his labor as he or she pleased, but they were bound to the property by economical ties. They could not leave until they had paid off their debt to the owner, and they were victim of those owners, who encouraged the mozos to get into debt beyond their power to free themselves by granting credit or lending cash. If the mozos ran away, the owner could have them pursued and imprisoned by the authorities, with all the cost incurred in the process charged to the ever increasing debt of the mozo. If one of them refused to work, he or she was put in prison on the spot.   ::Finally, the wages were extremely low. The work was done by contract, but since every mozo starts with a large debt, the usual advance on engagement, they become servants to the owner.   Independent tillers: living in the most remote provinces, survived by growing crops of maize, wheat or beans, sufficient to meet their own needs and leave a small margin for disposal in the market places of the towns and often carried their goods on their back for up to twenty five miles a day.           In 1931, the dictator general Jorge Ubico came to power, backed by the United States, and initiated one of the most brutally repressive governments in Central American history. Just as Estrada Cabrera had done during his government, Ubico created a widespread network of spies and informants and had large numbers of political opponents tortured and put to death. A wealthy aristocrat and a staunch anti-communist, he consistently sided with the United Fruit Company , Guatemalan landowners and urban elites in disputes with peasants. After the crash of the New York Stock Exchange in 1929, the peasant system established by Barrios in 1875 to jump start coffee production in the country was not good enough anymore, and Ubico was forced to implement a system of debt slavery and forced labor to make sure that there was enough labor available for the coffee plantations and that the UFCO workers were readily available.     Allegedly, he passed laws allowing landowners to execute workers as a disciplinary measure. He also openly identified as a fascist; he admired Mussolini , Franco , and Hitler , saying at one point: I am like Hitler. I execute first and ask questions later. Ubico was disdainful of the indigenous population, calling them animal-like , and stated that to become civilized they needed mandatory military training, comparing it to domesticating donkeys. He gave away hundreds of thousands of hectares to the United Fruit Company , exempted them from taxes in Tiquisate , and allowed the U.S. military to establish bases in Guatemala.     Ubico considered himself to be another Napoleon . He dressed ostentatiously and surrounded himself with statues and paintings of the emperor, regularly commenting on the similarities between their appearances. He militarized numerous political and social institutions—including the post office, schools, and symphony orchestras—and placed military officers in charge of many government posts. He frequently traveled around the country performing inspections in dress uniform, followed by a military escort, a mobile radio station, an official biographer, and cabinet members.     On the other hand, Ubico was an efficient administrator:     His new decrees, although unfair to the majority of the indigenous population, proved good for the Guatemalan economy during the Great Depression era, as they increased coffee production across the country.   He cut the bureaucrats salaries by almost half, forcing inflation to recede.   One of his last administrative decision was to pay the English Debt, which he inherited and was originally generated when president José María Reyna Barrios tried to promote his interoceanic railway in 1897 through a major Central American fair, which failed miserably when the railway was not finished on time: at that time, the Panama Canal had not been built yet, and the interoceanic railways would have been a major investor attraction for Guatemala. Since the fair failed, the Guatemalan government was left with a large debt with the British bankers and the new president, Manuel Estrada Cabrera feared that those bankers would use the British Navy to invade Guatemala to force it to pay the debt.   Kept the peace and order in Guatemala City , by effectively fighting its crime.         After 14 years, Ubicos repressive policies and arrogant demeanor finally led to pacific disobedience by urban middle-class intellectuals, professionals, and junior army officers in 1944. On 25 June, a peaceful demonstration of female schoolteachers culminated in its suppression by government troops and the assassination of María Chinchilla who became a national heroine. On 1 July 1944 Ubico resigned from office amidst a general strike and nationwide protests. Initially, he had planned to hand over power to the former director of police, General Roderico Anzueto, whom he felt he could control. But his advisors noted that Anzuetos pro-Nazi sympathies had made him very unpopular, and that he would not be able to control the military. So Ubico instead chose to select a triumvirate of Major General Bueneventura Piñeda, Major General Eduardo Villagrán Ariza, and General Federico Ponce Vaides . The three generals promised to convene the national assembly to hold an election for a provisional president, but when the congress met on 3 July, soldiers held everyone at gunpoint and forced them to vote for General Ponce rather than the popular civilian candidate, Dr. Ramón Calderón. Ponce, who had previously retired from military service due to alcoholism, took orders from Ubico and kept many of the officials who had worked in the Ubico administration. The repressive policies of the Ubico administration were continued. Jonas, 1991:     Opposition groups began organizing again, this time joined by many prominent political and military leaders, who deemed the Ponce regime unconstitutional. Among the military officers in the opposition were Jacobo Árbenz and Major Francisco Javier Arana . Ubico had fired Árbenz from his teaching post at the Escuela Politécnica, and since then Árbenz had been living in El Salvador, organizing a band of revolutionary exiles. On 19 October 1944 a small group of soldiers and students led by Árbenz and Arana attacked the National Palace in what later became known as the October Revolution . Ponce was defeated and driven into exile; and Árbenz, Arana, and a lawyer name Jorge Toriello established a junta . They declared that democratic elections would be held before the end of the year.     The winner of the 1944 elections was a teaching major named Juan José Arévalo , PhD, who had earned a scholarship in Argentina during the government of general Lázaro Chacón due to his superb professor skills. Arévalo remained in South America during a few years, working as a university professor in several countries. Back in Guatemala during the early years of the Jorge Ubico regime, his colleagues asked him to present a project to the president to create the Faculty of Humanism at the National University , to which Ubico was strongly opposed. Realizing the dictatorial nature of Ubico, Arévalo left Guatemala and went back to Argentina. He went back to Guatemala after the 1944 Revolution and ran under a coalition of leftist parties known as the ": null
    },
    {
        "Partido Acción Revolucionaria": "Revolutionary Action Party"
    },
    {
        " , and won 85% of the vote in elections that are widely considered to have been fair and open.     Arévalo implemented social reforms, including minimum wage laws, increased educational funding, near-universal suffrage , and labor reforms. But many of these changes only benefited the upper-middle classes and did little for the peasant agricultural laborers who made up the majority of the population. Although his reforms were relatively moderate, he was widely disliked by the United States government, the Catholic Church, large landowners, employers such as the United Fruit Company, and Guatemalan military officers, who viewed his government as inefficient, corrupt, and heavily influenced by communists. At least 25 coup attempts took place during his presidency, mostly led by wealthy liberal military officers.           Árbenz served as defense minister under President Arévalo. He was the first minister of this portfolio, since it was previously called the Ministry of War. In 1947, Dr. Arévalo, in company with a friend and two Russian dancers who were visiting Guatemala, had a car accident on the road to Panajachel. Arévalo fell into a ravine and was seriously injured, while all his companions were killed. The official party leaders signed a pact with Lieutenant Colonel Arana, in which he pledged not to attempt any coup against the ailing president, in exchange for the revolutionary parties as the official candidate in the next election. However, the recovery of the sturdy president was almost miraculous and soon he was able to take over the government. Lieutenant Colonel Francisco Javier Arana had accepted this pact because he wanted to be known as a Democratic hero of the uprising against Ponce and believed that the Barranco Pact ensured his position when the time of the presidential elections came.     Arana was a very influential person in Arévalos government, and had managed to be nominated as the next presidential candidate, ahead of Captain Arbenz, who was told that because of his young age he would have no problem in waiting turn to the next election. Arana died in a gun battle against military civilian who wanted to capture him on 18 July 1949, at the Bridge of Glory, in Amatitlán , where he and his assistant commander had gone to check on weapons and that had been seized at the Aurora Air Base a few days before There are different versions about who ambushed him, and those who ordered the attack; Arbenz and Arévalo have been accused of instigating an attempt to get Arana out of the presidential picture.     The death of Lieutenant Colonel Arana is of critical importance in the history of Guatemala, because it was a pivotal event in the history of the Guatemalan revolution: his death not only paved the way for the election of Colonel Arbenz as president of the republic in 1950 but also caused an acute crisis in the government of Dr. Arévalo Bermejo, who all of a sudden had against him an army that was more faithful to Arana than to him, and elite civilian groups that used the occasion to protest strongly against his government.     Before his death, Arana had planned to run in the upcoming 1950 presidential elections. His death left Árbenz without any serious contenders in the elections . Árbenz got more than three times as many votes as the runner-up, Miguel Ydígoras Fuentes . Fuentes claimed that electoral fraud benefited Árbenz; however scholars have pointed out that while fraud may possibly have given Árbenz some of his votes, it was not the reason that he won the election. In 1950s Guatemala, only literate men were able to vote by secret ballot; illiterate men and literate women voted by open ballot. Illiterate women were not enfranchised at all.     For the campaign of 1950, Arbenz asked José Manuel Fortuny – a high-ranking member of the Guatemalan Communist party – to write some speeches. The central theme of these was the land reform, the pet project of Arbenz. They shared a comfortable victory in elections in late 1950 and, thereafter, the tasks of government. While many of the leaders of the ruling coalition fought hard closeness to the president seeking personal benefits, the leaders of the Guatemalan Labor Party, and especially Fortuny, were the closest advisers and Arbenz were his private practice.     The election of Árbenz alarmed U.S. State Department officials, who stated that Arana has always represented only positive conservative element in Arévalo administration , that his death would strengthen Leftist materially , and that developments forecast sharp leftist trend within government.           thu as president of Guatemala in 1951.     In his inaugural address, Árbenz promised to convert Guatemala from a backward country with a predominantly feudal economy into a modern capitalist state. He declared that he intended to reduce dependency on foreign markets and dampen the influence of foreign corporations over Guatemalan politics. He also stated that he would modernize Guatemalas infrastructure and do so without the aid of foreign capital.     Based on his plan of government, he did the following:   Promulgated the Decree 900, to expropriate idle land from UFCO.   Began construction of the Atlantic Highway   Began construction of the Santo Tomas de Castilla port where port Matías de Gálvez used to be, to compete with Puerto Barrios, UFCOs port.   Began studies for Jurun Marinalá generation plant to compete with the electric company in the hands of Americans.     Árbenz was a Christian socialist and governed as a European-style democratic socialist , and took great inspiration from Franklin Delano Roosevelts New Deal . According to historian Stephen Schlesinger , while Árbenz did have a few communists in lower-level positions in his administration, he was not a dictator, he was not a crypto-communist. Nevertheless, some of his policies, particularly those involving agrarian reform, would be branded as communist by the upper classes of Guatemala and the United Fruit Company .         thu , which had the monopoly of freight and passenger maritime transportante to and from Puerto Barrios in Guatemala since 1903.     Prior to Árbenzs election in 1950, a handful of U.S. corporations controlled Guatemalas primary electrical utilities, the nations only railroad, and the banana industry, which was Guatemalas chief agricultural export industry. By the mid-1940s, Guatemalan banana plantations accounted for more than one quarter of all of United Fruit Company s production in Latin America. Land reform was the centerpiece of Árbenzs election campaign. The revolutionary organizations that had helped put Árbenz in power put constant pressure on him to live up to his campaign promises regarding land reform. Árbenz continued Arévalos reform agenda and in June 1952, his government enacted an agrarian reform program. Árbenz set land reform as his central goal, as only 2% of the population owned 70% of the land.     On 17 June 1952 Árbenzs administration enacted an agrarian reform law known as Decree 900 . The law empowered the government to create a network of agrarian councils which would be in charge of expropriating uncultivated land on estates that were larger than . The land was then allocated to individual families. Owners of expropriated land were compensated according to the worth of the land claimed in May 1952 tax assessments . Land was paid for in 25-year bonds with a 3 percent interest rate. The program was in effect for 18 months, during which it distributed to about 100,000 families. Árbenz himself, a landowner through his wife, gave up of his own land in the land reform program.     In 1953, the reform was ruled unconstitutional by the Supreme Court, however the democratically elected Congress later impeached four judges associated with the ruling.     Decree 900, for the Agrarian Reform in Guatemala created the possibility of gaining crops for those field workers who had no land of their own. The effect of this law was similar to what occurred in Europe after the bubonic plague in the Middle Ages: after the plague, which killed one third of Europes population at the time, the number of landowners decreased, which released many of the terrestrial land, increased supply and lowered land price. At the same time, many farmers also died from the plague, so that the labor force declined; this shift in supply of workers increased wages. The economic effects of the plague are very similar to those caused by the land reform in Guatemala: During the first harvest after the implementation of the law, the average income of farmers increased from Q225.00/year TO Q700.00/year. Some analysts say that conditions in Guatemala improved after the reform and that there was a fundamental transformation of agricultural technology as a result of the decrease labor supply. Rising living standards also happened in Europe in the fifteenth century, while large-scale technological advances occurred. Missing workforce after the plague was the mother of invention. The benefits from the reform were not limited solely to the working class of fields: There were increases in consumption, production and domestic private investment.         200     In order to establish the necessary physical infrastructure to make possible the independent and national capitalist development that could get rid of extreme dependence on the United States and break the American monopolies operating in the country, basically the economy of the banana enclave, Arbenz and his government began the planning and construction of the Atlantic Highway, which was intended to compete in the market with the monopoly on land transport exerted by the United Fruit Company , through one of its subsidiaries: the International Railways of Central America , which had the concession since 1904, when it was granted by then President Manuel Estrada Cabrera . Construction of the highway began by the Roads Department of the Ministry of Communications, with the help of the military engineering battalion. It was planned to be built parallel along the railway line, as much as possible. The construction of the new port was also aimed to break another UFCO monopoly: Puerto Barrios was owned and operated solely by The Great White Fleet, another UFCOs subsidiary.         200   200     The Jurun Marinalá electric power generation plant was planned as the first national hydroelectric power plant in Guatemala. The goal was to disrupt the monopoly of the Electric Company, a subsidiary of American Electric Bond and Share , which did not make use of indigenous water resources, but ran fossil fuel-powered plants, thus creating a drain on foreign currency reserves. Owing to its massive economic importance, construction continued beyond the Árbenz presidency. The plant was finally completed under President Julio Cesar Mendez Montenegro in 1968. It is located in the village of Agua Blanca, inside El Salto, Escuintla .         The Catholic Church , who possessed a large share of power in Central America during the Colonial Era, was gradually losing it after the emancipation from Spain. First, it was the struggle of the liberals who overtook power from Guatemalan conservatives ; conservatives and the Church lost all of their power quota in the provinces of Central America, Guatemala remaining as their last bastion. In 1838, with the fall of the liberal President Mariano Galvez, the figure of Lieutenant General Rafael Carrera arose and became the countrys conservative leader. He rallied his party and the Church back to power, at least in the province of Guatemala. With this state of affairs, the Central American Federation could not be carried out because it was liberal in nature and Guatemalas military power and that of its leader Carrera were invincible in his time; so much so, that Carrera eventually founded the Republic of Guatemala on 21 March 1847. After Carreras death in 1865, Guatemalan Liberals saw their chance to seize power again, and conducted the Liberal Revolution in 1871. Since that time, the attacks on the senior clergy of the Catholic Church raged in Guatemala and secular education, freedom of religion, the expulsion of several religious orders and the expropriation of many church properties were decreed. This situation continued throughout all the liberal governments that followed, until October Revolution in 1944, in which the religious situation worsened: now the attacks towards the Church were not only economic, but also religious, as many revolutionaries began to declare themselves opposed to any kind of religion.     By 1951, Archbishop Mariano Rossell Arellano found that it was urgent to recover the elite position of the Catholic Church in Guatemala, and for that reason he allied himself to the interests of the United Fruit Company through the National Liberation Movement and aimed to overthrow the revolutionary governments, which he branded as atheists and communists . After the consecration of the Shrine of Esquipulas , and as part of a smear campaign launched against the Arbenz government, he requested sculptor Julio Urruela Vásquez to carve a replica of the Christ of Esquipulas, which was transferred to bronze in 1952 and converted the following year in symbol and banner of the national pilgrimage against communism. This Christ was then appointed as Commander in Chief of the forces of the National Liberation Movement during the invasion of June 1954.     On 4 April 1954, Rossell Arellano issued a pastoral letter in which he criticized the progress of communism in the country, and made a call to Guatemalans to rise up and fight the common enemy of God and the homeland. This pastoral was distributed throughout the country.             In 1953, when the government implemented Agrarian Reform , it intended to redistribute large holdings of unused land to peasants, both Latino and Amerindian, for them to develop for subsistence farming. It expropriated 250,000 of 350,000 ": null
    },
    {
        "manzanas": "Manzanas"
    },
    {
        " held by the United Fruit Company . According to the governments Decree 900, it would redistribute the land for agricultural purposes. UFCO continued to hold thousands of acres in pasture as well as substantial forest reserves. The Guatemalan government had offered the company a Q 609,572 in compensation for the appropriated land. The company fought the land expropriation, making several legal arguments. It said the government had misinterpreted its own law. The Agrarian Reform Law was directed at redistributing unused land able to be developed for agricultural purposes. Thus land in pasture, specified forest cover and under cultivation was to be left with the owners and untouched by the expropriators. The company argued that most of the land taken from them was cultivated and in use, so it was illegal for the government to take it.     Secondly, they argued that the offered compensation was insufficient for the amount and value of the land taken. However, the valuations of United Fruit Companys rural property were based on the values declared by the company in its own tax filings. In 1945, Arevalos administration ordered new assessments, to be complete by 1948. UFCo had submitted the assessment by the due date; but, when the Agrarian Reform was implemented, the company declared that they wanted the value of its property changed from the values the company had previously used to dodge taxes. The government had investigated in 1951, but a new assessment was never completed. UFCo said that the 1948 assessment was outdated, and claimed its land value was much greater. They had estimated just compensation would be as high as Q 15,854,849, nearly twenty times more than what the Guatemalan government had offered.     The U.S. State Department and the embassy actively began to support the position of UFCo, which was a major US company. The Guatemalan government had to fight the pressure. The US officially acknowledged that Guatemala had the right to conduct their own politics and business, but U.S. representatives said they were trying to protect UFCo, a US company that generated much revenue and contributed to the US economy. Arbenzs administration said that Guatemala needed Agrarian Reform to improve its own economy. Arbenz said he would adopt policies for a nationalist economic development if necessary. He argued that all foreign investment would be subject to Guatemalan laws. Arbenz was firm in promoting the Agrarian Reform and within a couple of years had acted quickly; he claimed that Guatemalan government was not prepared to make an exception for the U.S. concerning Decree 900 and that it was not Guatemalans fault that the American corporation had lied in its tax forms and declared an artificially low value on their land.     Because Arbenz could not be pressured to take into consideration the arguments made to prevent expropriation from UFCo, his government was undermined with propaganda. For U.S. the national security was also highly important. They had combined both political and economic interests. The fear of allowing communist practices in Guatemala was shared by the urban elite and middle classes, who would not relinquish their privileges that easily. The local media-such as newspapers ": null
    },
    {
        "El Imparcial": "El Imparcial"
    },
    {
        " and La Hora- took advantage of the freedom of press of the regime, and with the sponsorship of UFCo were critical of communism and of the governments legal recognition of the party. The opposing political parties organized anticommunism campaigns; thousands of people appeared at the periodic rallies, and the membership in anticommunist organizations had grown steadily.         Between 1950 and 1955, during the government of General Eisenhower in the United States, a witch hunt for communists was conducted: McCarthyism . This was characterized by persecuting innocent people by mere suspicion, with unfounded accusations, interrogation, loss of labor, passport denial, and even imprisonment. These mechanisms of social control and repression in the United States skirted dangerously with the totalitarian and fascist methods.     One of the main characters of McCarthyism was John Peurifoy , who was sent as the ambassador of the United States to Guatemala, as this was the first country in the American sphere of influence after World War II that included elements openly communists in his government. He came from Greece, where he had already done considerable anticommunist activity, and was installed as ambassador in November 1953, when Carlos Castillo Armas was already organizing his tiny revolutionary army. After a long meeting, Peurifoy made it clear to President Arbenz that the US was worried about the communist elements in his government, and then reported to the Department of State that the Guatemalan leader was not a communist, but that surely a communist leader would come after him; furthermore, in January 1954 he told ": null
    },
    {
        "Time": "Time"
    },
    {
        " magazine: American public opinion could force us to take some measures to prevent Guatemala from falling into the orbit of international communism.           The Communist Party was never the center of the communist movement in Guatemala until Jacobo Árbenz came to power in 1951. Prior to 1951, communism lived within the urban labor forces in small study groups during 1944 to 1953 which it had a tremendous influence on these urban labor forces. Despite its small size within Guatemala, many leaders were extremely vocal about their beliefs . In 1949, in Congress, the Communist Party only had less than forty members, however, by 1953 it went up to nearly four thousand. Before Arbenz come to power in 1951, the communist movement preferred to carry out many of their activities through the so-called mass organization. In addition to Arbenz success, Guatemalan Communist Party moved forward its activities into public.     After Jacobo Arbenz came to power in 1951, he extended political freedom, allowing communists in Guatemala to participate in politics. This move by Arbenz let many opponents in Ubicos regime to recognize themselves as communists. By 1952, Arbenz supported a land reform, and took unused agricultural land, about , from owners who had large properties, and made it available to rural workers and farmers. These lands were to be taken from the United Fruit Company with compensation; however, the UFC believed the compensation was not enough. Meantime, Arbenz allowed the Communist Party to organize and include leaders notably his adviser who were leftist. The propaganda effort that was led by United Fruit Company against the revolution in Guatemala persuaded the U.S. government to fight against communism in Guatemala. The United States clutched on small details to prove the existence of widespread communism in Guatemala. The Eisenhower administration at the time in the U.S. were not happy about the Arbenz government, they considered Arbenz to be too close to communism; there have been reports that Arbenzs wife was a communist and part of the Communist Party in Guatemala. Even though it was impossible for the U.S. to gather evidence and information about Guatemalas relations to the Soviet Union, Americans wanted to believe that communism existed in Guatemala.     As Arbenz proceeded with land reform, the United Fruit Company , which had a practical monopoly on Guatemalan fruit production and some industry, lobbied the Eisenhower administration to remove Arbenz. Of still greater importance, though, was the widespread American concern about the possibility of a so-called Soviet beachhead , pg 17, quoting Allen Dulles opening up in the western hemisphere. Arbenzs sudden legalization of the Communist party and importing of arms from then Soviet- satellite state of Czechoslovakia , among other events, convinced major policy makers in the White House and CIA to try for Arbenzs forced removal, although his term was to end naturally in two years. This led to a CIA-orchestrated coup in 1954, known as Operation PBSUCCESS , which saw Arbenz toppled and forced into exile by Colonel Carlos Castillo Armas . Despite most Guatemalans attachment to the original ideals of the 1944 uprising, some private sector leaders and the military began to believe that Arbenz represented a communist threat and supported his overthrow, hoping that a successor government would continue the more moderate reforms started by Arevalo.     Many groups of Guatemalan exiles were armed and trained by the CIA, and commanded by Colonel Carlos Castillo Armas they invaded Guatemala on 18 June 1954. The Americans called it an anti-communist coup against Arbenz. The coup was supported by CIA radio broadcasts and so the Guatemalan army refused to resist the coup, Arbenz was forced to resign. In 1954, a military government replaced Arbenz government and disbanded the legislature and they arrested communist leaders, Castillo Armas became president.     After the CIA coup, hundreds of Guatemalans were rounded up and killed. Documents obtained by the National Security Archive revealed that the CIA was involved in planning assassinations of enemies of the new military government, should the coup be successful.       rig               The government, right-wing paramilitary organizations, and left-wing insurgents were all engaged in the Guatemalan Civil War . A variety of factors contributed: social and economic injustice and racial discrimination suffered by the indigenous population, the 1954 coup which reversed reforms, weak civilian control of the military, the United States support of the government, and Cuba n support of the insurgents. The Historical Clarification Commission after the war estimated that more than 200,000 people were killed — the vast majority of whom were indigenous civilians. 93% of the human rights abuses reported to the Commission were attributed to the military or other government-supported forces. It also determined that in several instances, the government was responsible for acts of genocide . , English summary of Commission report. See paragraphs 82 and 108–123     In response to the increasingly autocratic rule of Gen. Ydígoras Fuentes , who took power in 1958 following the murder of Col. Castillo Armas , a group of junior military officers revolted in 1960. When they failed, several went into hiding and established close ties with Cuba . This group became the nucleus of the forces who mounted armed insurrection against the government for the next 36 years.     Shortly after President Julio César Méndez Montenegro took office in 1966, the army launched a major counterinsurgency campaign that largely broke up the guerrilla movement in the countryside.     The guerrillas concentrated their attacks in Guatemala City, where they assassinated many leading figures, including U.S. Ambassador John Gordon Mein in 1968. During the next nearly two decades, Méndez Montenegro was the only civilian to head Guatemala until the inauguration of Vinicio Cerezo in 1986.           200 -Northern Transversal Strip- in Guatemala.     The first settler project in the FTN was in Sebol-Chinajá in Alta Verapaz . Sebol, then regarded as a strategic point and route through Cancuén river, which communicated with Petén through the Usumacinta River on the border with Mexico and the only road that existed was a dirt one built by President Lázaro Chacón in 1928. In 1958, during the government of General Miguel Ydígoras Fuentes the Inter-American Development Bank financed infrastructure projects in Sebol, which finally adopted the name Fray Bartolomé de las Casas, municipality created in 1983 in Alta Verapaz. In 1960, then Army captain Fernando Romeo Lucas Garcia inherited Saquixquib and Punta de Boloncó farms in northeastern Sebol. In 1963 he bought the farm San Fernando El Palmar de Sejux and finally bought the Sepur farm near San Fernando. During those years, Lucas was in the Guatemalan legislature and lobbied in Congress to boost investment in that area of the country.     In those years, the importance of the region was in livestock, exploitation of precious export wood and archaeological wealth. Timber contracts were granted to multinational companies such as Murphy Pacific Corporation from California, which invested US$30  million for the colonization of southern Petén and Alta Verapaz, and formed the North Impulsadora Company. Colonization of the area was made through a process by which inhospitable areas of the FTN were granted to native peasants.     In 1962, the DGAA became the National Institute of Agrarian Reform , by Decree 1551 which created the law of Agrarian Transformation. In 1964, INTA defined the geography of the FTN as the northern part of the departments of Huehuetenango, Quiché, Alta Verapaz and Izabal and that same year priests of the Maryknoll order and the Order of the Sacred Heart began the first process of colonization, along with INTA, carrying settlers from Huehuetenango to the Ixcán sector in Quiché.         The Northern Transversal Strip was officially created during the government of General Carlos Arana Osorio in 1970, by Decree 60–70 in the Congress, for agricultural development.           On 19 January 1972, members of a new Guatemalan guerrilla movement entered Ixcán, from Mexico, and were accepted by many farmers; in 1973, after an exploratory foray into the municipal seat of Cotzal, the insurgent group decided to set up camp underground in the mountains of Xolchiché, municipality of Chajul.     In 1974, the insurgent guerrilla group held its first conference, where it defined its strategy of action for the coming months and called itself Guerrilla Army of the Poor . In 1975, the organization had spread around the area of the mountains of northern municipalities of Nebaj and Chajul. As part of its strategy EGP agreed to perform acts that notoriety was obtained and through which also symbolize the establishment of a social justice against the inefficiency and ineffectiveness of the judicial and administrative organs of the State. They saw also that with these actions the indigenous rural population of the region is identified with the insurgency, thus motivating joining their ranks. As part of this plan was agreed to so-called executions . To determine who would be these people subject to execution , the EGP attended complaints received from the public. For example, they selected two victims: Guillermo Monzón, who was a military Commissioner in Ixcán and José Luis Arenas, the largest landowner in the area of Ixcán, and who had been reported to the EGP for allegedly having land conflicts with neighboring settlements and abusing their workers. José Luis Arenas, who at that time a journalist called Ixcán Tiger had been active in Guatemalan politics. He joined as Congress of Republic in the period of Jacobo Arbenz in the opposition; in 1952, he founded the Anti-communist Unification Party , which later became part of the liberationist movement; went into exile when the first armed clashes between the Liberation Army and the Guatemalan Army occurred, but returned with the victory of the National Liberation Movement and during the government of colonel Carlos Castillo Armas he held various public offices. In the presidential term of Carlos Arana Osorio Arenas was in charge of the Promotion and Development of Petén . Later, he left politics for agriculture in his coffee and cardamom plantations in the Ixcán and Ixil, in Quiché .     On Saturday, 7 June 1975, José Luis Arenas was killed by unknowns when he was in the premises of his farm La Perla to pay wage workers. In front of his office there were approximately two to three hundred people to receive their payment and four members of EGP mixed among farmers. Subsequently, the guerrilla members destroyed the communication radio of the farm and executed Arenas. After having murdered José Luis Arenas, guerrilla members spoke in Ixil language to the farmers, informing them that they were members of the Guerrilla Army of the Poor and had killed the Tiger Ixcán . They requested to prepare beasts to help the injured and were transported to Chajul to receive medical care. Then the attackers fled towards Chajul.     José Luis Arenas son, who was in San Luis Ixcán at the time, seek refuge in a nearby mountain, waiting for a plane to arrive to take him to the capital, in order to immediately report the matter to the Minister of Defense. The defense minister replied, You are mistaken, there are no guerrillas in the area .               Also located in the Northern Transversal Strip, the valley of the Polochic River was inhabited since ancient times by kekchí and Pokomchi people. In the second half of the nineteenth century, President Justo Rufino Barrios began the allocation of land in the area to German farmers. Decree 170 facilitated the expropriation of Indian land in favor of the Germans, because it promoted the auction of communal lands. Since that time, the main economic activity was export-oriented, especially coffee, bananas and cardamom. Testimony, Center for Social History Investigations. Panzós: CEIHS, 1979. The communal property, dedicated to subsistence farming, became private property led to the cultivation and mass marketing of agricultural products. Therefore, the fundamental characteristic of the Guatemalan production system has since that time been the accumulation of property in few hands, and a sort of farm servitude based on the exploitation of farmer settlers . According to Guatemalan leftists, this would be only a euphemism to refer to native slaves .     In 1951, the agrarian reform law that expropriated idle land from private hands was enacted, but in 1954, with the National Liberation Movement coup supported by the United States , most of the land that had been expropriated, was awarded back to its former landowners. Flavio Monzón was appointed mayor and in the next twenty years he became one of the largest landowners in the area. In 1964, several communities settled for decades on the shore of Polochic River claimed property titles to INTA which was created in October 1962, but the land was awarded to Monzón. A Mayan peasant from Panzós later said that Monzón got the signatures of the elders before he went before INTA to talk about the land. When he returned, gathered the people and said that, by an INTA mistake, the land had gone to his name. Throughout the 1970s, Panzós farmers continued to claim INTA regularization of land ownership receiving legal advice from the FASGUA , an organization that supported the peasants demands through legal procedures. However, no peasant received a property title, ever. Some obtained promises while other had provisional property titles, and there were also some that only had received permission to plant. The peasants began to suffer evictions from their land by farmers, the military and local authorities in favor of the economic interests of Izabal Mining Operations Company and Transmetales. Another threat at that time for peasant proprietors were mining projects and exploration of oil: Exxon, Shenandoah, Hispanoil and Getty Oil all had exploration contracts; besides there was the need for territorial expansion of two mega-projects of that era: Northern Transversal Strip and Chixoy Hydroelectric Plant.     In 1978, a military patrol was stationed a few kilometers from the county seat of Panzós, in a place known as Quinich . At this time organizational capacity of peasant had increased through committees who claimed titles to their land, a phenomenon that worried the landlord sector. Some of these owners, among them Monzón, stated: Several peasants living in the villages and settlements want to burn urban populations to gain access to private property , Gobernación Departamental de Alta Verapaz: 5 May 1978 Audience, signatories: colonel Benigno Álvarez S., Alta Verapaz governor, and Flavio Monzón, Héctor Monzón, Raúl Aníbal Ayala, Joaquín González, Mario Cazs and José María Borges. and requested protection from Alta Verapaz governor. In municipal act 34–64 one can see the first indication of military presence in the region, when it was written that it was imperative to incorporate order and security in the area.     On 29 May 1978, peasants from Cahaboncito, Semococh, Rubetzul, Canguachá, Sepacay villages, finca Moyagua and neighborhood La Soledad, decided to hold a public demonstration in the Plaza de Panzós to insist on the claim of land and to express their discontent caused by the arbitrary actions of the landowners and the civil and military authorities. Hundreds of men, women, indigenous children went to the square of the municipal seat of Panzós, carrying their tools, machetes and sticks. One of the people who participated in the demonstration states: The idea was not to fight with anyone, what was required was the clarification of the status of the land. People came from various places and they had guns.     There are different versions on how the shooting began: some say it began when Mama Maquín -an important peasant leader- pushed a soldier who was in her way; others argue that it started because people kept pushing trying to get into the municipality, which was interpreted by the soldiers as an aggression. The mayor at the time, Walter Overdick, said that people of the middle of the group pushed those who in front. A witness says one protester grabbed the gun from a soldier but did not use it and several people argue that a military voice yelled: One, two, three! Fire! In fact, the lieutenant who led the troops gave orders to open fire on the crowd.     The shots that rang for about five minutes, were made by regulation firearms carried by the military as well as the three machine guns located on the banks of the square. 36 Several peasants with machetes wounded several soldiers. No soldier was wounded by gunfire. The square was covered with blood.     Immediately, the army closed the main access roads, despite that indigenous felt terrified. An army helicopter flew over the town before picking up wounded soldiers.         Due to his seniority in both the military and economic elites in Guatemala, as well as the fact that he spoke perfectly the qekchi, one of the Guatemalan indigenous languages, Lucas García the ideal official candidate for the 1978 elections; and to further enhance his image, he was paired with the leftist doctor Francisco Villagrán Kramer as running mate. Villagrán Kramer was a man of recognized democratic trajectory, having participated in the Revolution of 1944, and was linked to the interests of transnational corporations and elites, as he was one of the main advisers of agricultural, industrial and financial chambers of Guatemala. Despite the democratic façade, the electoral victory was not easy and the establishment had to impose Lucas García, causing further discredit the electoral system -which had already suffered a fraud when General Laugerud was imposed in the 1974 elections.     In 1976, student group called FRENTE emerged in the University of San Carlos , which completely swept all student body positions that were up for election that year. FRENTE leaders were mostly members of the Patriotic Workers Youth, the youth wing of the Guatemalan Labor Party , the Guatemalan communist party who had worked in the shadows since it was illegalized in 1954. Unlike other Marxist organizations in Guatemala at the time, PGT leaders trusted the mass movement to gain power through elections.     FRENTE used its power within the student associations to launch a political campaign for the 1978 university general elections, allied with leftist Faculty members grouped in University Vanguard . The alliance was effective and Oliverio Castañeda de León was elected as President of the Student Body and Saúl Osorio Paz as President of the University; plus they had ties with the University workers union thru their PGT connections. Osorio Paz gave space and support to the student movement and instead of having a conflicted relationship with students, different representations combined to build a higher education institution of higher social projection. In 1978, the University of San Carlos became one of the sectors with more political weight in Guatemala; that year the student movement, faculty and University Governing Board -Consejo Superior Universitario- united against the government and were in favor of opening spaces for the neediest sectors. In order to expand its university extension, the Student Body rehabilitated the Student House in downtown Guatemala City ; there, they welcomed and supported families of villagers and peasant already sensitized politically. They also organized groups of workers in the informal trade.     At the beginning of his tenure as President, Saúl Osorio founded the weekly Siete Días en la USAC, which besides reporting on the activities of the University, constantly denounced the violation of human rights, especially the repression against the popular movement. It also told what was happening with revolutionary movements in both Nicaragua and El Salvador . For a few months, the state university was a united and progressive institution, preparing to confront the State head on.     Now, FRENTE had to face the radical left, represented then by the Student Revolutionary Front Robin García , which emerged during the Labor Day march of 1 May 1978. FERG coordinated several student associations on different colleges within University of San Carlos and public secondary education institutions. This coordination between legal groups came from the Guerrilla Army of the Poor , a guerrilla group that had appeared in 1972 and had its headquarters in the oil rich region of northern Quiché department -i.e., the Ixil Triangle of Ixcán, Nebaj and Chajul in Franja Transversal del Norte . Although not strictly an armed group, FERG sought confrontation with government forces all the time, giving prominence to measures that could actually degenerate into mass violence and paramilitary activity. Its members were not interested in working within an institutional framework and never asked permission for their public demonstrations or actions.     On 7 March 1978, Lucas Garcia was elected President; shortly after, on 29 May 1978 -in the late days of General Laugerud García government- in the central square of Panzós , Alta Verapaz , members of the Zacapa Military Zone attacked a peaceful peasant demonstration, killing a lot of people. The deceased, indigenous peasants who had been summoned in place, were fighting for the legalization of public lands they had occupied for years. Their struggle faced them directly with investors who wanted to exploit the mineral wealth of the area, particularly oil reserves -by Basic Resources International and Shenandoah Oil- and nickel -EXMIBAL. The Panzós Massacre caused a stir at the University by the high number of victims and conflicts arose from the exploitation of natural resources by foreign companies. In 1978, for example, Osorio Paz and other university received death threats for their outspoken opposition to the construction of an inter-oceanic pipeline that would cross the country to facilitate oil exploration. On 8 June the AEU organized a massive protest in downtown Guatemala City where speakers denounced the slaughter of Panzós and expressed their repudiation of Laugerud García regime in stronger terms than ever before.         After the execution of José Luis Arenas population of Hom, Ixtupil, Sajsivan and Sotzil villages, neighbors of La Perla and annexes, increased support for the new guerrilla movement, mainly due to the land dispute that peasants kept with the owners of the farm for several years and that the execution was seen as an act of social justice .     The murder owner of the farm La Perla , located in the municipality of Chajul, resulted in the escalation of violence in the area: part of the population moved closer to the guerrillas, while another part of the inhabitants of Hom kept out of the insurgency. In 1979, the owners of the farm La Perla established links with the army and for the first time a military detachment was installed within the property; in this same building the first civil patrol of the area was established. The Army high command, meanwhile, was very pleased with the initial results of the operation and was convinced it had succeeded in destroying most of the social basis of EGP, which had to be expelled from the Ixil Triangle . At this time the presence of EGP in the area decreased significantly due to the repressive actions of the Army, who developed its concept of enemy without necessarily including the notion of armed combatants; the officers who executed the plan were instructed to destroy all towns suspect of cooperate with EGP and eliminate all sources of resistance. Army units operating in the Ixil Triangle belonged to the Mariscal Zavala Brigade, stationed in Guatemala City . Moreover, although the guerrillas did not intervene directly when the army attacked the civilian population allegedly because they lacked supplies and ammunition, it did support some survival strategies. It streamlined, for example, survival plans designed to give evacuation instructions in assumption that military incursions took place. Most of the population began to participate in the schemes finding that them represented their only alternative to military repression.           The election of Lucas García on 7 March 1978 marked the beginning of a full return to the counterinsurgency practices of the Arana period. This was compounded by the strong reaction of the Guatemalan military to the situation unfolding in Nicaragua at the time, where the popularly supported Sandinista insurgency was on the verge of toppling the Somoza regime. With the aim of preventing an analogous situation from unfolding in Guatemala, the government intensified its repressive campaign against the predominantly indigenous mass movement. The repression not only intensified, but became more overt.     On 4 August 1978, high school and university students, along with other popular movement sectors, organized the mass movements first urban protest of the Lucas García period. The protests, intended as a march against violence, were attended by an estimated 10,000 people. The new minister of the interior under President Lucas García, Donaldo Alvarez Ruiz, promised to break up any protests done without government permission. Having refused to ask for permission, the protesters were met by the Pelotón Modelo of the National Police. Employing new anti-riot gear donated by the United States Government , Platoon agents surrounded marchers and tear-gassed them. Students were forced to retreat and dozens of people, mostly school-aged adolescents, were hospitalized. Amnesty International 1979b: 7; interviews This was followed by more protests and death squad killings throughout the later part of the year. In September 1978 a general strike broke out to protest sharp increases in public transportation fares; the government responded harshly, arresting dozens of protesters and injuring many more. However, as a result of the campaign, the government agreed to the protesters demands, including the establishment of a public transportation subsidy . Fearful that this concession would encourage more protests, the military government, along with state-sponsored paramilitary death squads , generated an unsafe situation for public leaders.     The administrator of a large cemetery in Guatemala City informed the press that in the first half of 1978, more than 760 unidentified bodies had arrived at the cemetery, all apparent victims of death squads. Amnesty International stated that disappearances were an epidemic in Guatemala and reported more than 2,000 killings between mid-1978 and 1980. Between January and November 1979 alone the Guatemalan press reported 3,252 disappearances .         On 31 January 1980, a group of displaced Kiche and Ixil peasant farmers occupied the Spanish Embassy in Guatemala City to protest the kidnapping and murder of peasants in Uspantán by elements of the Guatemalan Army. In the subsequent police raid, over the protests of the Spanish ambassador, the police attacked the building with incendiary explosives. A fire ensued as police prevented those inside of the embassy from exiting the building. In all, 36 people were killed in the fire. The funeral of the victims attracted hundreds of thousands of mourners, and a new guerrilla group was formed commemorating the date, the Frente patriotico 31 de enero . The incident has been called the defining event of the Guatemalan Civil War.     The Guatemalan government issued a statement claiming that its forces had entered the embassy at the request of the Spanish Ambassador, and that the occupiers of the embassy, whom they referred to as terrorist s, had sacrificed the hostages and immolated themselves afterward. Ambassador Cajal denied the claims of the Guatemalan government and Spain immediately terminated diplomatic relations with Guatemala, calling the action a violation of the most elementary norms of international law.     Relations between Spain and Guatemala were not normalized until 22 September 1984.         In the months following the Spanish Embassy Fire, the human rights situation continued to deteriorate. The daily number of killings by official and unofficial security forces increased from an average of 20 to 30 in 1979 to a conservative estimate of 30 to 40 daily in 1980. Human rights sources estimated 5,000 Guatemalans were killed by the government for political reasons in 1980 alone, making it the worst human rights violator in the hemisphere after El Salvador . Guatemala and El Salvador: Latin Americas worst human rights violators in 1980 The Council on Hemispheric Affairs In a report titled Guatemala: A Government Program of Political Murder, Amnesty International stated, Between January and November of 1980, some 3,000 people described by government representatives as subversives and criminals were either shot on the spot in political assassinations or seized and murdered later; at least 364 others seized in this period have not yet been accounted for.     The repression and excessive force used by the government against the opposition was such that it became source of contention within Lucas Garcias administration itself. This contention within the government caused Lucas Garcias Vice President Francisco Villagrán Kramer to resign from his position on 1 September 1980. In his resignation, Kramer cited his disapproval of the governments human rights record as one of the primary reasons for his resignation. He then went into voluntary exile in the United States, taking a position in the Legal Department of the Inter-American Development Bank .       The effects of state repression on the population further radicalized individuals within the mass movement and led to increased popular support for the insurgency. In late 1979, the EGP expanded its influence, controlling a large amount of territory in the Ixil Triangle in El Quiche and holding many demonstrations in Nebaj, Chajul and Cotzal. At the same time the EGP was expanding its presence in the Altiplano, a new insurgent movement called the ORPA made itself known. Composed of local youths and university intellectuals, the ORPA developed out of a movement called the Regional de Occidente, which split from the FAR-PGT in 1971. The ORPAs leader, Rodrigo Asturias , formed the organization after returning from exile in Mexico . Concerned Guatemala Scholars , Guatemala, Dare to Struggle, Dare to Win, p. 40 The ORPA established an operational base in the mountains and rain-forests above the coffee plantations of southwestern Guatemala and in the Atitlan where it enjoyed considerable popular support. Robert S. Carlsen , The War for the Heart and Soul of a Highland Maya Town: Revised Edition, p. 144 On 18 September 1979, the ORPA made its existence publicly known when it occupied the Mujulia coffee farm in the coffee-growing region of the Quezaltenango province to hold a political education meeting with the workers. Jonathan L. Fried , Guatemala in Rebellion: Unfinished History, p. 270     Insurgent movements active in the initial phase of the conflict such as the FAR also began to reemerge and prepare for combat. In 1980, guerrilla operations on both the urban and rural fronts greatly intensified, with the insurgency carrying out a number of overt acts of armed propaganda and assassinations of prominent right-wing Guatemalans and landowners. In 1980, armed insurgents assassinated prominent Ixil landowner Enrique Brol, and president of the CACIF Alberto Habie. Encouraged by guerrilla advances elsewhere in Central America, the Guatemalan insurgents, especially the EGP, began to quickly expand their influence through a wide geographic area and across different ethnic groups, thus broadening the appeal of the insurgent movement and providing it with a larger popular base. In October 1980, a tripartite alliance was formalized between the EGP, the FAR and the ORPA as a precondition for Cuban-backing.     In early 1981, the insurgency mounted the largest offensive in the countrys history. This was followed by an additional offensive towards the end of the year, in which many civilians were forced to participate by the insurgents. Villagers worked with the insurgency to sabotage roads and army establishments, and destroy anything of strategic value to the armed forces. Ejército Guerrillero de los Pobres, 1983 By 1981, an estimated 250,000 to 500,000 members of Guatemalas indigenous community actively supported the insurgency. Guatemalan Army Intelligence estimated a minimum 360,000 indigenous supporters of the EGP alone. Arias, 1990; 255 Since late 1981 the Army applied a strategy of scorched earth in Quiché, to eliminate the guerrilla social support EGP. In some communities of the regions military forced all residents to leave their homes and concentrate in the county seat under military control. Some families obeyed; others took refuge in the mountains. Kiches who took refuge in the mountains, were identified by the Army with the guerrillas and underwent a military siege, and continuous attacks that prevented them from getting food, shelter and medical care.         La Llorona, located about 18 kilometers from El Estor, department of Izabal , was a small village with no more than twenty houses. Most of the first settlers arrived from the areas of Senahú and Panzós, both in Alta Verapaz. In 1981, the total population was about 130 people, all belonging to the qeqchi ethnic group. Few people spoke Spanish and most worked in their own cornfields, sporadically working for the local landowners. In the vicinity are the villages of El Bongo, Socela, Benque, Rio Pita, Santa Maria, Big Plan and New Hope. Conflicts in the area were related to land tenure, highlighting the uncertainty about the boundaries between farms and communities, and the lack of titles. As in the National Institute of Agrarian Transformation was not registered a legitimate owner of land occupied La Llorona, the community remained in the belief that the land belonged to the state, which had taken steps to obtain title property. However, a farmer with great influence in the area occupied part of the land, generating a conflict between him and the community; men of the village, on its own initiative, devised a new boundary between community land and the farmer, but the problem remained dormant.     The second half of the seventies gave rise to the first news about the presence of guerrillas in the villages. The commander aparacimiento Ramon, talked to people and said they were the Guerrilla Army of the Poor. They passed many villages asking what problems people had and offered to solve them. They told peasants that the land belonged to the poor and that they should trust them. In 1977, Ramon, a guerrilla commander, regularly visited the village of La Llorona and after finding that the issue of land was causing many problems in the community, taught people to practice new measurements, which spread fear among landowners. That same year, the group under Ramon arbitrarily executed the Spanish landowner José Hernández, near El Recreo, which he owned. Following this, a clandestine group of mercenaries, dubbed fighters of the rich was formed to protect the interests of landlords; public authority of El Estor organized the group and paid its members, stemming from the funding of major landowners. The group, irregular, was related to the military commissioners of the region and with commanders of the Army, although mutual rivalries also took place. The secret organization murdered several people, including victims who had no connection whatsoever with insurgent groups.     In December 1978, the EGP group leader, Ramon, was captured by soldiers of the military detachment in El Estor and transferred to the military zone of Puerto Barrios; after two years returned to El Estor; but this time as an officer in the Army G2 and joined a group of soldiers that came to the village. On the evening of 28 September 1981, an army officer accompanied by four soldiers and a military commissioner met with about thirty civilians. At seven oclock, over thirty civilians, mostly from Nueva Esperanza, including several informants known to military intelligence, gathered around La Llorona along with some military commissioners and a small group of soldiers and army officers. Then they entered the village. Civilians and commissioners entered twelve houses, and each of them were pulling men and shot them dead outside their own homes; those who tried to escape were also killed. Women who tried to protect their husbands were beaten. While the military commissioners and civilians executed men, soldiers subtracted belongings of the victims; within half an hour, the authors of the assault left the village. The victims bodies, fourteen in all, were in front of houses. Women, despite having been threatened with death if they told what happened, ran to the nearest village, El Bongo, for help. After a few hours, women came back with people who helped to bury the bodies. Days later, widows, with almost 60 fatherless children were welcomed by the parish of El Estor for several days, until the soldiers forced them to return to their village. Two widows of those executed on 29 September established close relations with the military commissioners from Bongo. This situation led to divisions that still exist in the community.     The economic and social activity was disrupted in the village: widows had to take the jobs of their husbands; because of their lack of knowledge in the cultivation of land, harvested very little corn and beans. There were diseases, especially among children and the elderly, there was no food or clothing. The teacher of the village came only part-time, mostly out of fear, but left after he realized it was not worth to stay because young people had to work nor could they spend money on travel. The village had no teacher for the next four years. The events generated finally the breakup of the community. Some village women though that their husbands were killed because of three others who were linked with the guerrillas and were involved in a land dispute.     According to the Historical Clarification Commission, the landlord with whom the villagers had the land dispute took advantage of the situation to appropriate another twelve acres of land.           The report of the Recovery of Historical Memory lists 422 massacres committed by both sides in the conflict; however, it also states that they did the best they could in terms of obtaining information and therefore the list is incomplete; therefore here are the cases that have also been documented in other reports as well.             According to a report by the rightist magazine Crónica , there were 1,258 guerrilla actions against civilians and infrastructure in Guatemala, including more than two hundred murders, sixty eight kidnappings, eleven bombs against embassies and three hundred twenty-nine attacks against civilians. Almost all guerrilla massacres occurred in 1982 when further militarization reigned and there was widespread presence of PAC in communities; many of them were victims of non-cooperation with the guerrillas and in some cases they came after a previous attack by the PAC. In the massacres perpetrated by the guerrillas there is no use of informants, or concentration of population, or separation of groups; also, there are no recounts of rape or repetitive slaughter. There are cases of razed villages and less tendency to mass flight, even thought it occurred in some cases. the use of lists was also more frequent.     In a publication of the Army of Guatemala, sixty massacres perpetrated by the EGP were reported, arguing that they were mostly ignored by REHMI and the Historical Clarification Commission reports. It is also reported that in mid-1982, 32 members of Star Guerilla Front were shot for not raising the EGP flag.                   On 31 January 1980, Guatemala got worldwide attention when the Spanish Embassy in Guatemala City was burnt down, resulting in 37 deaths, including embassy personnel and high ranked Guatemalan former government officials. A group of native people from El Quiché occupied the embassy in a desperate attempt to bring attention to the issues they were having with the Army in that region of the country, which was rich in oil and had been recently populated as part of the Franja Transversal del Norte agricultural program. In the end, thirty seven people died after a fire started within the embassy after the police force tried to occupy the building; after that, Spain broke its diplomatic relationships with Guatemala.     le     On 5 September 1980 a terrorist attack by Ejército Guerrillero de los Pobres took place in front of the Guatemalan National Palace, then the headquarters of the Guatemalan government. The intention was to prevent the Guatemalan people to support a huge demonstration that the government of general Lucas Garcia had prepared for Sunday 7 September 1980. In the attack, six adults and a boy died after two bombs inside a vehicle went off.     There was an undetermined number of wounded and heavy material losses, not only from art pieces from the National Palace, but from all the surrounding buildings, particularly in the Lucky Building, which is right across from the Presidential Office. Among the deceased was Domingo Sánchez, Secretary of Agriculture driver; Joaquín Díaz y Díaz, car washer; and Amilcar de Paz, a security guard.     The attacks against private financial, commercial and agricultural targets increased in the Lucas Garcia years, as the leftist Marxist groups saw those institutions as reactionaries and millionaire exploiters that were collaborating with the genocidal government. The following is a non-exhaustive list of the terrorist attacks that occurred in Guatemala city and are presented in the UN Commission report:         Despite advances by the insurgency, the insurgency made a series of fatal strategic errors. The successes made by the revolutionary forces in Nicaragua against the Somoza regime combined with the insurgencys own successes against the Lucas government led rebel leaders to falsely conclude that a military equilibrium was being reached in Guatemala, thus the insurgency underestimated the military strength of the government. The insurgency subsequently found itself overwhelmed, and was unable to secure its advances and protect the indigenous civilian population from reprisals by the security forces.         In response to the guerrilla offensive in early 1981, the Guatemalan Army began mobilizing for a large-scale rural counter-offensive. The Lucas government instituted a policy of forced recruitment and began organizing a task-force model for fighting the insurgency, by which strategic mobile forces were drawn from larger military brigades. To curtail civilian participation in the insurgency and provide greater distinction between hostile and compliant communities in the countryside, the army resorted to a series of civic action measures. The army under Chief of Staff Benedicto Lucas García began to search out communities in which to organize and recruit civilians into pro-government paramilitary patrols, who would combat the insurgents and kill their collaborators.     In 1980, and 1981, the United States under Reagan administration delivered $10.5  million worth of Bell 212 and Bell 412 helicopters and $3.2  million worth of military trucks and jeeps to the Guatemalan Army. In 1981, the Reagan administration also approved a $2  million covert CIA program for Guatemala.     On 15 April 1981, EGP rebels attacked a Guatemalan Army patrol from the village of Cocob near Nebaj, killing five personnel. On 17 April 1981, a reinforced company of Airborne troops was deployed to the village. They discovered fox holes, guerrillas and a hostile population. The local people appeared to fully support the guerrillas. The soldiers were forced to fire at anything that moved. The army killed 65 civilians, including 34 children, five adolescents, 23 adults and two elderly people. CEH, 1998, p. 51     In July 1981, the armed forces initiated a new phase of counterinsurgency operations under the code-name Operación Ceniza, or Operation Ashes, which lasted through March 1982. The purpose of the operation was to separate and isolate the insurgents from the civilian population. During Operación Ceniza some 15,000 troops were deployed on a gradual sweep through the predominantly indigenous Altiplano region, comprising the departments of El Quiché and Huehuetenango . Grupo de Apoyo Mutuo , Draining the Sea: An Analysis of Terror in Three Rural Communities in Guatemala , p. 42     Large numbers of civilians were killed or displaced in the Guatemalan militarys counterinsurgency operations. To alienate the insurgents from their civilian base, the army carried out large-scale mass killing of unarmed civilians, burned villages and crops, and butchered animals, destroying survivors means of livelihood. Sources with the human rights office of the Catholic Church estimated the death toll from the counterinsurgency in 1981 at 11,000, with most of the victims indigenous peasants of the Guatemalan highlands. Other sources and observers put the death toll due to government repression in 1981 at between 9,000 and 13,500.     As army repression intensified in the countryside, relations between the Guatemalan military establishment and the Lucas Garcia regime worsened. Professionals within the Guatemalan military considered the Lucas approach counterproductive, on grounds that the Lucas governments strategy of military action and systematic terror overlooked the social and ideological causes of the insurgency while radicalizing the civilian population. Additionally, Lucas went against the militarys interests by endorsing his defense minister, Angel Anibal Guevara , as a candidate in the March 1982 presidential elections.     The guerrilla organizations in 1982 combined to form the Guatemalan National Revolutionary Unity . At the same time, extreme right-wing groups of self-appointed vigilantes, including the Secret Anti-Communist Army and the White Hand , tortured and murdered students, professionals, and peasants suspected of involvement in leftist activities.     On 23 March 1982, army troops commanded by junior officers staged a coup détat to prevent the assumption of power by General Ángel Aníbal Guevara , the hand-picked candidate of outgoing President and General Romeo Lucas García . They denounced Guevaras electoral victory as fraudulent. The coup leaders asked retired Gen. Efraín Ríos Montt to negotiate the departure of Lucas Guevara. Ríos Montt had been the candidate of the Christian Democracy Party in the 1974 presidential election and was widely regarded as having been denied his own victory through fraud.     Ríos Montt was by this time a lay pastor in the evangelical Protestant Church of the Word . In his inaugural address, he stated that his presidency resulted from the will of God . He was widely perceived as having strong backing from the Reagan administration in the United States. He formed a three-member military junta that annulled the 1965 constitution, dissolved Congress , suspended political parties and canceled the electoral law. After a few months, Montt dismissed his junta colleagues and assumed the de facto title of President of the Republic .     Guerrilla forces and their leftist allies denounced Montt, who sought to defeat them by a combination of military actions and economic reforms; in his words, rifles and beans . In May 1982, the Conference of Catholic Bishops accused Montt of responsibility for growing militarization of the country and for continuing military massacres of civilians. An army officer was quoted in ": null
    },
    {
        "The New York Times": "The New York Times"
    },
    {
        " of 18 July 1982 as telling an audience of indigenous Guatemalans in Cunén that: If you are with us, well feed you; if not, well kill you. Raymond Bonner, Guatemala Enlists Religion in Battle , New York Times, 18 July 1982. For a number of years, the U.S. State Department, in its background notes on Guatemala, attributed this quotation to Gen. Ríos Montt. See: via the Internet Archive .   The Plan de Sánchez massacre occurred on the same day.     The government began to form local civilian defense patrols . Participation was in theory voluntary, but in practice, many rural Guatemalan men , especially in the northwest, had no choice but to join either the PACs or be considered guerrillas. At their peak, the PACs are estimated to have included 1  million conscripts. Montts conscript army and PACs recaptured essentially all guerrilla territory. The insurgents activity lessened and was largely limited to hit-and-run operations. Montt won this partial victory at an enormous cost in civilian deaths.     Montts brief presidency was probably the most violent period of the 36-year internal conflict, which resulted in thousands of deaths of mostly unarmed indigenous civilians. Although leftist guerrillas and right-wing death squads also engaged in summary executions, forced disappearances, and torture of noncombatants, the vast majority of human rights violations were carried out by the Guatemalan military and the PACs they controlled. The internal conflict is described in great detail in the reports of the Historical Clarification Commission and the Archbishops Office for Human Rights . The CEH estimates that government forces were responsible for 93% of the violations; ODHAG earlier estimated that government forces were responsible for 80%.     On 8 August 1983, Montt was deposed by his Minister of Defense, General Óscar Humberto Mejía Víctores , who succeeded him as de facto president of Guatemala. Mejía justified his coup, based on problems with religious fanatics in government and official corruption . Seven people were killed in the coup. Montt survived to found a political party and to be elected President of Congress in 1995 and again in 2000.     Awareness in the United States of the conflict in Guatemala, and its ethnic dimension, increased with the 1983 publication of the testimonial account I, Rigoberta Menchú, a memoir by a leading activist. Rigoberta Menchú was awarded the 1992 Nobel Peace Prize for her work in favor of broader social justice. In 1998, a book by U.S. anthropologist David Stoll challenged some of the details in Menchús book, creating an international controversy. After the publication of Stolls book, the Nobel Committee reiterated that it had awarded the Peace Prize based on Menchús uncontested work promoting human rights and the peace process.     General Mejía allowed a managed return to democracy in Guatemala, starting with a 1 July 1984 election for a Constituent Assembly to draft a democratic constitution. On 30 May 1985, after nine months of debate, the Constituent Assembly finished drafting a new constitution , which took effect immediately. Vinicio Cerezo , a civilian politician and the presidential candidate of the Christian Democracy Party , won the first election held under the new constitution with almost 70% of the vote, and took office on 14 January 1986.       Upon its inauguration in January 1986, President Cerezos civilian government announced that its top priorities would be to end the political violence and establish the rule of law. Reforms included new laws of habeas corpus and ": null
    },
    {
        "amparo": "Amparo"
    },
    {
        " , the creation of a legislative human rights committee, and the establishment in 1987 of the Office of Human Rights Ombudsman. The Supreme Court embarked on a series of reforms to fight corruption and improve legal system efficiency.     With Cerezos election, the military returned to the more traditional role of providing internal security, specifically by fighting armed insurgents. The first two years of Cerezos administration were characterized by a stable economy and a marked decrease in political violence. Dissatisfied military personnel made two coup attempts in May 1988 and May 1989, but the military leadership supported the constitutional order. The government was strongly criticized for its reluctance to investigate or prosecute cases of human rights violations.     The final two years of Cerezos government were marked by a failing economy, strikes, protest marches, and allegations of widespread corruption. The governments inability to deal with many of the nations social and health problems — such as infant mortality, illiteracy, deficient health and social services, and rising levels of violence — contributed to popular discontent.     Presidential and congressional elections were held on 11 November 1990. After a runoff ballot, Jorge Antonio Serrano Elías was inaugurated on 14 January 1991, completing the first successful transition from one democratically elected civilian government to another. Because his Movement of Solidarity Action Party gained only 18 of 116 seats in Congress , Serrano entered into a tenuous coalition with the Christian Democrats and the National Union of the Center to form a government.     The Serrano administrations record was mixed. It had some success in consolidating civilian control over the army, replacing a number of senior officers and persuading the military to participate in peace talks with the URNG. He took the politically unpopular step of recognizing the sovereignty of Belize , which had long been officially, though fruitlessly, claimed as a province by Guatemala. The Serrano government reversed the economic slide it inherited, reducing inflation and boosting real growth.     In 1992, Efraín Bámaca , a notable guerrilla leader also known as Comandante Everardo , disappeared. It was later found that Bámaca was tortured and killed that year by Guatemalan Army officers. His widow, the American Jennifer Harbury, and members of the Guatemala Human Rights Commission , based in Washington, DC, raised protests that ultimately led the United States to declassify documents going back to 1954 related to its actions in Guatemala. It was learned that the CIA had been funding the military, although Congress had prohibited such funding since 1990 because of the Armys human rights abuses. Congress forced the CIA to end its aid to the Guatemalan Army.     On 25 May 1993, Serrano illegally dissolved Congress and the Supreme Court and tried to restrict civil freedoms, allegedly to fight corruption. The ": null
    },
    {
        "autogolpe": "Autogolpe"
    },
    {
        " failed due to unified, strong protests by most elements of Guatemalan society, international pressure, and the armys enforcement of the decisions of the Court of Constitutionality, which ruled against the attempted takeover. In the face of this pressure, Serrano fled the country.     On 5 June 1993, Congress, pursuant to the 1985 constitution, elected the Human Rights Ombudsman, Ramiro de León Carpio , to complete Serranos presidential term. De León was not a member of any political party. Lacking a political base but with strong popular support, he launched an ambitious anti-corruption campaign to purify Congress and the Supreme Court, demanding the resignations of all members of the two bodies.     Despite considerable congressional resistance, presidential and popular pressure led to a November 1993 agreement brokered by the Catholic Church between the administration and Congress. This package of constitutional reforms was approved by popular referendum on 30 January 1994. In August 1994, a new Congress was elected to complete the unexpired term. Controlled by the anti-corruption parties: the populist Guatemalan Republican Front headed by Ríos Montt, and the center-right National Advancement Party , the new Congress began to abandon the corruption that characterized its predecessors.     Under de León, the peace process, now brokered by the United Nations, took on new life. The government and the URNG signed agreements on human rights , resettlement of displaced persons , historical clarification , and indigenous rights . They also made significant progress on a socioeconomic and agrarian agreement.     National elections for president, Congress, and municipal offices were held in November 1995. With almost 20 parties competing in the first round, the presidential election came down to a 7 January 1996 runoff in which PAN candidate Álvaro Arzú Irigoyen defeated Alfonso Portillo Cabrera of the FRG by just over 2% of the vote. Arzú won because of his strength in Guatemala City, where he had previously served as mayor, and in the surrounding urban area. Portillo won all of the rural departments except Petén. Under the Arzú administration, peace negotiations were concluded, and the government signed peace accords ending the 36-year internal conflict in December 1996.       The human rights situation remained difficult during Arzús tenure, although some initial steps were taken to reduce the influence of the military in national affairs. The most notable human rights case of this period was the brutal slaying of Bishop Juan José Gerardi on 24 April 1998, two days after he had publicly presented a major Catholic Church-sponsored human rights report known as ": null
    },
    {
        "Guatemala: Nunca Mas": "Guatemala: Nunca Mas"
    }
]