[
    {
        "           The history of public transport authorities in London details the various organisations that have been responsible for the ": null
    },
    {
        "public transport": "Public Transport"
    },
    {
        " network in and around ": null
    },
    {
        "London": "London"
    },
    {
        ", England from 1933 until 2000 and have used the ": null
    },
    {
        "London Transport": "London Transport"
    },
    {
        " brand. Their responsibilities have encompassed the ": null
    },
    {
        "buses": "Buses In London"
    },
    {
        ", ": null
    },
    {
        "coaches": "Coach Transport In The United Kingdom"
    },
    {
        ", ": null
    },
    {
        "trams": "Trams In London"
    },
    {
        " and the ": null
    },
    {
        "London Underground": "London Underground"
    },
    {
        ". The period began with the creation of the ": null
    },
    {
        "London Passenger Transport Board": "London Passenger Transport Board"
    },
    {
        ", which covered the ": null
    },
    {
        "County of London": "County Of London"
    },
    {
        " and adjacent counties within a 30-mile radius. This area later came under the control of the ": null
    },
    {
        "London Transport Executive": "London Transport Executive"
    },
    {
        " and then the ": null
    },
    {
        "London Transport Board": "London Transport Board"
    },
    {
        ". The area of responsibility was reduced to that of the ": null
    },
    {
        "Greater London": "Greater London"
    },
    {
        " administrative area in 1970 when the ": null
    },
    {
        "Greater London Council": "Greater London Council"
    },
    {
        ", and then ": null
    },
    {
        "London Regional Transport": "London Regional Transport"
    },
    {
        " took over responsibility. Since 2000, the ": null
    },
    {
        "Greater London Authority": "Greater London Authority"
    },
    {
        " has been the transport authority and the executive agency has been called ": null
    },
    {
        "Transport for London": "Transport For London"
    },
    {
        "; ending the 67-year use of the London Transport name.       Prior to 1933, the ownership and management of the transport system in London was distributed among a large number of independent and separate organisations. The ": null
    },
    {
        "Underground": "London Underground"
    },
    {
        " railway system had been developed and was owned by the ": null
    },
    {
        "Underground Electric Railways Company of London": "Underground Electric Railways Company Of London"
    },
    {
        " and the ": null
    },
    {
        "Metropolitan Railway": "Metropolitan Railway"
    },
    {
        ". ": null
    },
    {
        "Tram": "Tram"
    },
    {
        " and ": null
    },
    {
        "Trolleybus": "Trolleybus"
    },
    {
        " networks were owned by various local authorities and public companies and buses were owned by numerous companies. Many of these services were in competition with one another leading to wasteful duplication. The ": null
    },
    {
        "London County Council": "London County Council"
    },
    {
        " managed tram operations within the ": null
    },
    {
        "County of London": "County Of London"
    },
    {
        ", but its responsibility did not extend to the bus or tram routes that ran outside its area; or to the railways, which also extended into neighbouring counties. A ": null
    },
    {
        "Royal Commission on London Government": "Royal Commission On London Government"
    },
    {
        " in the 1920s did not permit the London County Council to extend its area of responsibility and an ad hoc ": null
    },
    {
        "London Traffic Area": "London Traffic Area"
    },
    {
        " was created to regulate motor traffic in the wider London region. In the 1930s another ad hoc solution was sought to improve the control and coordination of public transport.                 The London Passenger Transport Board was the transport authority from 1 July 1933 to 31 December 1947. ": null
    },
    {
        "Day & Reed 2008": "Reference-Day"
    },
    {
        ", p. 112. It unified services in the London area for the first time. The ": null
    },
    {
        "London Passenger Transport Act 1933": "London Passenger Transport Act 1933"
    },
    {
        " removed responsibility for  of tram route from the ": null
    },
    {
        "London County Council": "London County Council"
    },
    {
        ", three ": null
    },
    {
        "county boroughs": "County Borough"
    },
    {
        " and a number of other local authorities in the Greater London area. It brought the UERL lines under the same control, and took over supervision of buses from the ": null
    },
    {
        "Metropolitan Police": "Metropolitan Police"
    },
    {
        ". The area of responsibility of the LPTB was far greater than the current ": null
    },
    {
        "Greater London": "Greater London"
    },
    {
        " boundaries and was known as the London Passenger Transport Area. The period saw massive expansion of the tube network and was directly responsible for the expansion of the suburbs. The extensive ": null
    },
    {
        "New Works Programme": "New Works Programme"
    },
    {
        " was halted by ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", with some projects abandoned and others completed after the end of hostilities. The roundel symbol designed in 1918 was adopted by London Passenger Transport Board and the ": null
    },
    {
        "London Transport": "London Transport"
    },
    {
        " brand and architectural style was perfected during this period.  The iconic ": null
    },
    {
        "tube map": "Tube Map"
    },
    {
        " designed in 1931, was published in 1933.          The London Transport Executive was the transport authority from 1 January 1948 to 31 December 1962. ": null
    },
    {
        "Day & Reed 2008": "Reference-Day"
    },
    {
        ", p. 150. London Transport was taken into public ownership and became part of the ": null
    },
    {
        "British Transport Commission": "British Transport Commission"
    },
    {
        ", which brought London Transport and ": null
    },
    {
        "British Railways": "British Railways"
    },
    {
        " under the same control for the first and last time. The period saw the start of direct recruitment from the Caribbean and the repair and replacement of stock and stations damaged during the war as well as completion of delayed projects such as the ": null
    },
    {
        "Central line": "Central Line"
    },
    {
        " eastern extension. The ": null
    },
    {
        "AEC Routemaster": "Aec Routemaster"
    },
    {
        " bus was introduced in 1956. ": null
    },
    {
        "Trams": "Tram"
    },
    {
        " were withdrawn in 1952 and ": null
    },
    {
        "trolleybus": "Trolleybus"
    },
    {
        "es in 1962.          The London Transport Board was the transport authority from 1 January 1963 to 31 December 1969 ": null
    },
    {
        "Day & Reed 2008": "Reference-Day"
    },
    {
        ", p. 163. It reported directly to the ": null
    },
    {
        "Minister of Transport": "Secretary Of State For Transport"
    },
    {
        ", ending its direct association with the management of British Railways. During this period many of Britain’s unprofitable railways were closed down, as most routes in the capital were widely used the ": null
    },
    {
        "Beeching Axe": "Beeching Axe"
    },
    {
        " had little effect. However, during this period there was little investment in public transport and the motor car increased in popularity. During this period, the Victoria line was opened - although work had started in the early 1960s - and the ": null
    },
    {
        "AEC Merlin": "Aec Merlin"
    },
    {
        " single-deck bus was introduced.             The Greater London Council was the transport authority from 1 January 1970 to 28 June 1984 and the executive agency was called the London Transport Executive. ": null
    },
    {
        "Day & Reed 2008": "Reference-Day"
    },
    {
        ", p. 172. The legislation creating the ": null
    },
    {
        "Greater London Council": "Greater London Council"
    },
    {
        " was already passed in 1963 when the London Transport Board was created. However, control did not pass to the new authority until 1 January 1970. The GLC broadly controlled only those services within the boundaries of ": null
    },
    {
        "Greater London": "Greater London"
    },
    {
        ". The country buses and ": null
    },
    {
        "Green Line Coaches": "Green Line Coaches"
    },
    {
        " had been passed in 1969 to a new company, ": null
    },
    {
        "London Country Bus Services": "London Country Bus Services"
    },
    {
        ", which in 1970 became part of the ": null
    },
    {
        "National Bus Company": "National Bus Company"
    },
    {
        ". The period is perhaps the most controversial in Londons transport history and there was a severe lack of funding from central government and staff shortages.     The inter-modal zonal ticketing system currently used by ": null
    },
    {
        "Transport for London": "Transport For London"
    },
    {
        " originated in this period. Following the ": null
    },
    {
        "Greater London Council election in 1981": "1981 Greater London Council Election"
    },
    {
        ", the incoming Labour administration simplified fares in Greater London by introducing four new bus fare zones and two central London Underground zones, named City and West End, where flat fares applied for the first time.  This was accompanied by a cut in prices of about a third and was marketed as the  Fares Fair  campaign.   Following successful legal action against it, on 21 March 1982  London Buses fares were subsequently doubled and London Underground fares increased by 91%. The two central area zones were retained and the fares to all other stations were restructured to be graduated at three-mile intervals. In 1983, a third revision of fares was undertaken, and a new inter-modal ": null
    },
    {
        "Travelcard": "Travelcard"
    },
    {
        " season ticket was launched covering five new numbered zones; representing an overall cut in prices of around 25%. The One Day Travelcard was launched in 1984 and on weekdays was only sold for travel after 09.30.          London Regional Transport was the transport authority from 29 June 1984 to 2 July 2000. ": null
    },
    {
        "Day & Reed 2008": "Reference-Day"
    },
    {
        ", p. 189. The GLC was abolished in 1986 with responsibility for public transport removed two years earlier in 1984. The new authority, London Regional Transport , again came under direct state control, reporting to the ": null
    },
    {
        "Secretary of State for Transport": "Secretary Of State For Transport"
    },
    {
        ". The London Regional Transport Act contained provision for setting up subsidiary companies to run the Underground and bus services and in 1985 London Underground Limited , a wholly owned subsidiary of London Regional Transport, was set up to manage the tube network. In 1988 ten individual line business units were created to manage the network. London Buses Limited was constituted to progress the ": null
    },
    {
        "privatisation of London bus services": "Privatisation Of London Bus Services"
    },
    {
        ". London Transport was converted to a route operating contract tendering authority, and the former bus operating interests and assets of London Transport were split into 12 business units under the banner London Buses. The 12 units competed for contracts with private operators from 1984, and were all sold off by 1994/5 becoming private operators themselves.     Further amendments to the fare system were made during this period, including inclusion of the separately managed British Rail services. In January 1985 the Capitalcard season ticket was launched, offering validity on British Rail as well as London Underground and London Buses. It was priced around 10-15% higher than the Travelcard. In June 1986 the One Day Capitalcard was launched. The Capitalcard brand ended in January 1989 when the Travelcard gained validity on British Rail. In January 1991 ": null
    },
    {
        "Zone 5": "Travelcard Zone 5"
    },
    {
        " was split to create a new ": null
    },
    {
        "Zone 6": "Travelcard Zone 6"
    },
    {
        ". The ": null
    },
    {
        "Docklands Light Railway": "Docklands Light Railway"
    },
    {
        " was opened on 31 August 1987 and was included in the zonal Travelcard ticketing scheme.             The ": null
    },
    {
        "Greater London Authority": "Greater London Authority"
    },
    {
        ", a replacement authority for the GLC, was set up in 2000 with a transport executive called ": null
    },
    {
        "Transport for London": "Transport For London"
    },
    {
        " that took control from 3 July 2000.  It is the first London transport authority since 1933 not to be commonly called London Transport. The London Underground did not pass to TfL until after a ": null
    },
    {
        "Private Finance Initiative": "Private Finance Initiative"
    }
]