[
    {
        "The history of Moldova can be traced to the 1350s, when the ": null
    },
    {
        "Principality of Moldavia": "Moldavia"
    },
    {
        ", the medieval precursor of modern ": null
    },
    {
        "Moldova": "Moldova"
    },
    {
        " and ": null
    },
    {
        "Romania": "Romania"
    },
    {
        ", ": null
    },
    {
        "was founded": "Foundation Of Moldavia"
    },
    {
        ". The principality was a ": null
    },
    {
        "vassal": "Vassal"
    },
    {
        " of the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " from 1538 until the 19th century. In 1812, following ": null
    },
    {
        "one of several Russian-Turkish wars": "Russo-Turkish War, 1806-1812"
    },
    {
        ", the eastern half of the principality, ": null
    },
    {
        "Bessarabia": "Bessarabia"
    },
    {
        ", was annexed by the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        ". In 1918, Bessarabia briefly became independent as the ": null
    },
    {
        "Moldavian Democratic Republic": "Moldavian Democratic Republic"
    },
    {
        " and, following the decision of the Parliament , united with ": null
    },
    {
        "Romania": "Romania"
    },
    {
        ". In time of ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        " it was freed by Soviet Union from German occupation and joined it as ": null
    },
    {
        "Moldavian ASSR": "Moldavian Autonomous Soviet Socialist Republic"
    },
    {
        ", until the ": null
    },
    {
        "dissolution of the USSR": "Dissolution Of The Ussr"
    },
    {
        ". In 1991 the country ": null
    },
    {
        "declared independence": "Moldovan Declaration Of Independence"
    },
    {
        " as the Republic of Moldova.          In 2010 ": null
    },
    {
        "Oldowan": "Oldowan"
    },
    {
        " flint tools were discovered at Dubasari on the lower ": null
    },
    {
        "Dniester": "Dniester"
    },
    {
        " that are 800,000-1.2 million years old demonstrating that early humans were present in Moldova during the ": null
    },
    {
        "early paleolithic": "Lower Paleolithic"
    },
    {
        ".    During ": null
    },
    {
        "prehistoric": "Prehistory"
    },
    {
        " times there was a succession of cultures that flourished in the land of present-day Moldova from the end of the ": null
    },
    {
        "ice age": "Quaternary Glaciation"
    },
    {
        " up through the ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " Age, the ": null
    },
    {
        "Copper Age": "Copper Age"
    },
    {
        ", the ": null
    },
    {
        "Bronze Age": "Bronze Age"
    },
    {
        ", and the beginning of the ": null
    },
    {
        "Iron Age": "Iron Age"
    },
    {
        ", when ": null
    },
    {
        "historical records": "Recorded History"
    },
    {
        " begin to be made about the people who lived in these lands. These cultures included the ": null
    },
    {
        "Linear Pottery culture": "Linear Pottery Culture"
    },
    {
        " , the ": null
    },
    {
        "Cucuteni-Trypillian culture": "Cucuteni-Trypillian Culture"
    },
    {
        " , and the ": null
    },
    {
        "Yamna culture": "Yamna Culture"
    },
    {
        " . During this period of time many innovations and advancements were made, including the practice of ": null
    },
    {
        "agriculture": "Agriculture"
    },
    {
        ", ": null
    },
    {
        "animal husbandry": "Animal Husbandry"
    },
    {
        ", ": null
    },
    {
        "kiln-fired pottery": "Potteryfiring"
    },
    {
        ", ": null
    },
    {
        "weaving": "Weaving"
    },
    {
        ", and the formation of large ": null
    },
    {
        "settlements": "Human Settlement"
    },
    {
        " and towns. Indeed, during the Cucuteni-Trypillian Culture, some of the settlements in this area were larger than anywhere on Earth at the time, and they predate even the earliest towns of ": null
    },
    {
        "Sumer": "Sumer"
    },
    {
        " in the ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    },
    {
        ". The area, stretching from the ": null
    },
    {
        "Dnieper River": "Dnieper River"
    },
    {
        " in the east to the ": null
    },
    {
        "Iron Gate of the Danube": "Iron Gate"
    },
    {
        " in the west , had a civilization as highly advanced as anywhere else on Earth during the Neolithic period. Iranica Antiqua,vol. XXXVII 2002 Archeological Transformations:Crossing the Pastoral/Agricultural Bridge by Philip L. Khol     The question as to why this area did not remain at the forefront of technological and social development lies in the subsequent history of its geographical location. At the end of the mostly peaceful Neolithic period, this area became a highway for invaders from the east moving into Europe. By the time the historical written record begins to cover this area, it has already seen a number of invasions sweep over it, leaving social and political upheaval in their wake. This trend was to continue on a fairly regular basis up until the 20th century. With so much destruction, it was difficult for the residents of this area to recover from each successive invasion before encountering the next. However, the few societies in this area that managed to survive for a while through these turbulent centuries left behind a culture and history that are rich and dramatic. ": null
    },
    {
        "Cucuteni-Trypillian culture": "Cucuteni-Trypillian Culture"
    },
    {
        " Dacia": "Dacia"
    },
    {
        " and ": null
    },
    {
        "Moesia Inferior": "Moesia Inferior"
    },
    {
        " Lower Danube": "Lower Danube"
    },
    {
        " in Roman times               In recorded ": null
    },
    {
        "antiquity": "Classical Antiquity"
    },
    {
        " Moldovas territory was inhabited by several tribes, mainly by ": null
    },
    {
        "Akatziroi": "Akatziroi"
    },
    {
        ", and at different periods also by ": null
    },
    {
        "Bastarnae": "Bastarnae"
    },
    {
        ", ": null
    },
    {
        "Scythians": "Scythians"
    },
    {
        " and ": null
    },
    {
        "Sarmatians": "Sarmatians"
    },
    {
        ". Between the 1st and 7th centuries AD, the south was intermittently under the ": null
    },
    {
        "Roman": "Roman Empire"
    },
    {
        ", then ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        "s. Due to its strategic location on a route between Asia and Europe, Moldova was repeatedly invaded by, among others, the ": null
    },
    {
        "Goths": "Goths"
    },
    {
        ", ": null
    },
    {
        "Huns": "Huns"
    },
    {
        ", ": null
    },
    {
        "Avars": "Avars"
    },
    {
        ", ": null
    },
    {
        "Magyars": "Magyars"
    },
    {
        ", ": null
    },
    {
        "Kievan Rus": "Kievan Rus"
    },
    {
        ", ": null
    },
    {
        "Pechenegs": "Pechenegs"
    },
    {
        ", ": null
    },
    {
        "Cumans": "Cumans"
    },
    {
        ", and the ": null
    },
    {
        "Mongols": "Mongol Invasion Of Europe"
    },
    {
        ". The ": null
    },
    {
        "First Bulgarian Empire": "First Bulgarian Empire"
    },
    {
        " ruled the area or parts of it from the late 7th century/early 8th century until the late 10th century, the ": null
    },
    {
        "Principality of Halych": "Principality Of Halych"
    },
    {
        " in the 12th century and the ": null
    },
    {
        "Second Bulgarian Empire": "Second Bulgarian Empire"
    },
    {
        " from the early 13th century with interruptions until the early 14th century. The colonists of the ": null
    },
    {
        "Genoa Republic": "Genoa Republic"
    },
    {
        " also left a trace in this region. The Hypatian Chronicle mentioned the name of the Bolohoveni a purportedly Romanian population connected to voloch, the East Slavic exonym of the Romanians. Alexandru V. Boldur identified the Bolohoveni as Romanians. A.V. Boldur, Istoria Basarabiei, Editura Frunza, p.111-119               The medieval Principality of ": null
    },
    {
        "Moldavia": "Moldavia"
    },
    {
        " was established in 1359 and covered the so-called ": null
    },
    {
        "Carpathian": "Carpathian Mountains"
    },
    {
        "–": null
    },
    {
        "Danube": "Danube"
    },
    {
        "–": null
    },
    {
        "Dniester": "Dniester"
    },
    {
        " area, stretching from ": null
    },
    {
        "Transylvania": "Transylvania"
    },
    {
        " in the west to the Dniester River in the east.  , ": null
    },
    {
        "Mike Bennighof": "Michael Bennighof"
    },
    {
        ", Ph.D. Its territory comprised the present-day territory of the Republic of Moldova, the eastern 8 of the 41 counties of Romania , the ": null
    },
    {
        "Chernivtsi oblast": "Chernivtsi Oblast"
    },
    {
        " and ": null
    },
    {
        "Budjak": "Budjak"
    },
    {
        " region of ": null
    },
    {
        "Ukraine": "Ukraine"
    },
    {
        ". Its nucleus was in the northwestern part, the Țara de Sus , part of which later became known as ": null
    },
    {
        "Bukovina": "Bukovina"
    },
    {
        ". The name of the principality originates from the ": null
    },
    {
        "Moldova River": "Moldova River"
    },
    {
        ".          The ": null
    },
    {
        "foundation of Moldavia": "Foundation Of Moldavia"
    },
    {
        " is attributed to the ": null
    },
    {
        "Vlach": "Vlach"
    },
    {
        " noblemen ": null
    },
    {
        "Dragoş": "Dragoş"
    },
    {
        " of ": null
    },
    {
        "Bedeu": "Bedeu"
    },
    {
        ", from ": null
    },
    {
        "Maramureş": "Maramureş"
    },
    {
        ", who had been ordered in 1343  by the ": null
    },
    {
        "Hungarian": "Hungary"
    },
    {
        " king to establish a defense for the historic ": null
    },
    {
        "Kingdom of Hungary": "Kingdom Of Hungary"
    },
    {
        " against the ": null
    },
    {
        "Tatars": "Tatars"
    },
    {
        ", and ": null
    },
    {
        "Bogdan I": "Bogdan I Of Moldavia"
    },
    {
        " of ": null
    },
    {
        "Cuhea": "Cuhea"
    },
    {
        ", another vlach/Romanian from Maramureș, who became the first independent prince of Moldavia, when he rejected Hungarian authority in 1359. Bogdan I left his lands from Maramures with his army and part of the vlach/Romanian population, by crossing the mountains to the east, after entering in conflict with the Hungarian rulers. The greatest Moldavian personality was prince ": null
    },
    {
        "Stephen the Great": "Stephen Iii Of Moldavia"
    },
    {
        ", who ruled from 1457 to 1504. He fought the Hungarian Kingdom, the Polish Kingdom and the Ottoman Empire, with success, for the most part of his rule.          Stephen III was succeeded by increasingly weaker princes, and in 1538 Moldavia became a ": null
    },
    {
        "vassal": "Vassal"
    },
    {
        " of the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        ", to which it owed a percentage of the internal revenue, that in time rose to 10%. Moldavia was forbidden to have foreign relations to the detriment of the Ottoman Empire , but was allowed internal autonomy, including sole authority over foreign trade. Turks were legally forbidden to own land or build religious establishments in Moldavia. Prince ": null
    },
    {
        "Vasile Lupu": "Vasile Lupu"
    },
    {
        " had secured the Moldavian throne in 1634 after a series of complicated intrigues, and managed to hold it for twenty years. Lupu was a capable administrator and a brilliant financier, and soon was the richest man in the Christian East. Judiciously placed gifts kept him on good terms with the Ottoman authorities. For Basil Lupul see N.Norga Byzance après Byzance , pp. 163–81 see Steven Runciman. The Great Church in captivity Edition 3, 1985 pp. 286–7, 341–3, 370     In the 18th century, the territory of Moldavia often became a transit or war zone during conflicts between the Ottomans, Austrians, and ": null
    },
    {
        "Russians": "Russian Empire"
    },
    {
        ". In 1774, following a victory in ": null
    },
    {
        "a war against the Ottomans": "Russo-Turkish War"
    },
    {
        ", Russia occupied Christian Moldavia, still a vassal of the Ottoman Empire at the time.  In 1775, the ": null
    },
    {
        "Habsburg Monarchy": "Habsburg Monarchy"
    },
    {
        " annexed ca 11% of the territory of Moldavia, which became known as ": null
    },
    {
        "Bukovina": "Bukovina"
    },
    {
        ". By the ": null
    },
    {
        "Treaty of Bucharest": "Treaty Of Bucharest, 1812"
    },
    {
        " following the ": null
    },
    {
        "Russo-Turkish War ": "Russo-Turkish War, 1806-1812"
    },
    {
        ", Russia had annexed further 50% of its territory, which became known as ": null
    },
    {
        "Bessarabia": "Bessarabia"
    },
    {
        ".               With the notable exception of ": null
    },
    {
        "Transnistria": "Transnistria"
    },
    {
        ", the territory of todays ": null
    },
    {
        "Republic of Moldova": "Republic Of Moldova"
    },
    {
        " covers most of the historical region of ": null
    },
    {
        "Bessarabia": "Bessarabia"
    },
    {
        ". Until 1812, the term Bessarabia referred to the region between the Danube, Dniester, the ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        " shores, and the ": null
    },
    {
        "Upper Trajan Wall": "Upper Trajan Wall"
    },
    {
        ", slightly larger than what today is called ": null
    },
    {
        "Budjak": "Budjak"
    },
    {
        ". By the ": null
    },
    {
        "Treaty of Bucharest": "Treaty Of Bucharest, 1812"
    },
    {
        " of May 28, 1812 between the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " and the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        " — concluding the ": null
    },
    {
        "Russo-Turkish War, 1806-1812": "Russo-Turkish War, 1806-1812"
    },
    {
        " — the latter annexed the eastern half of the Principality of Moldavia.  That region was then called Bessarabia. Mitrasca, pp. 10–11.     Initially, after being annexed by the Russian Empire, Bessarabia enjoyed a period of local autonomy until 1828. Organized as an imperial district , it was governed by a provisional government with two departments: a civil administration and a religious administration, the former led by the aged Moldavian boyar ": null
    },
    {
        "Scarlat Sturdza": "Scarlat Sturdza"
    },
    {
        ", the latter – by the archbishop ": null
    },
    {
        "Gavriil Bănulescu-Bodoni": "Gavriil Bănulescu-Bodoni"
    },
    {
        ". On top of these was the Russian military administration of Governor General ": null
    },
    {
        "Harting": "Ivan Markovich Garting"
    },
    {
        ". However, already in 1813, the civil administration was handed to the Governor General. In 1818, reform-minded Russian tsar ": null
    },
    {
        "Alexander I": "Alexander I Of Russia"
    },
    {
        " passed a Settlement of the establishment of the region of Bessarabia which divided the legal power between the tsar-appointed Governor General  and a 10-member High Council of the Region with 4 members appointed by the tsar and 6 elected by the local nobility. In lieu of the older 12 lands, the region was divided into 6, later 9 ": null
    },
    {
        "counties": "County"
    },
    {
        ". In 1828 however, the conservative tsar ": null
    },
    {
        "Nikolai I": "Nikolai I"
    },
    {
        " abrogated the Settlement and passed a new regulation which endowed the Governor General with supreme power, with the regional council having only advisory functions and meeting twice a year. Article 63 of the regulation stated that all administrative personnel must know and perform their duties in ": null
    },
    {
        "Russian": "Russian Language"
    },
    {
        ". Nevertheless, Romanian language would occasionally appear in documents up to 1854. Ion Nistor, Istoria Basarabiei, 4th edition, Cartea moldovenească, Chișinău, 1991, p. 179-189     At the end of the Crimean War , in 1856, by the Treaty of Paris , the southern parts of Bessarabia were returned to Moldavia, which organized the territory into the districts of Cahul , Bolgrad and Ismail . Consequently, Russia lost access to the Danube river. In 1859, the Principalities of Moldavia and Wallachia united and formed the Romanian United Principalities , a vassal state of the Ottoman Empire .     In 1870, the institution of zemstva was instated in the Bessarabian oblast. Cities, communes, counties, and the entire region would elect each a local council representing noblemen, merchants and peasants. They had substantial authority in economic and sanitary areas, including roads, posts, food, public safety and education. On the other hand, political and cultural matters remained an exclusive domain of the Governor General and were used as a vehicle of Russification . With the accomplishment of these introductions, in 1871, Bessarabia was transformed into a governorate. Ion Nistor, p.190-191     The defeat of the Ottoman Empire in the Russo-Turkish War 1877–1878 and the subsequent signing of the Treaty of Berlin granted independence to Romania. Although the treaty of alliance between Romania and Russia specified that Russia would defend the territorial integrity of Romania and not claim any part of Romania at the end of the war, the southern part of Bessarabia was re-annexed to Russia. In exchange, Romania was given Dobruja , which was at the time part of the Ottoman Empire. Mitrasca, p. 23.     thu in the 19th century     Public education was entrusted to the religious establishment of the region, which since 1821 had only Russian archbishops, and later also to the zemstvos. Dimitrie Sulima , and Antonie Shokotov allowed the parallel usage of both Romanian and Russian in church, and did not take any measures to infringe upon the linguistic specifics of the region. With the appointment of Pavel Lebedev , the situation changed radically, and the language of the locals was soon purged from the church. To prevent the printing of religious literature in Romanian, Lebedev closed down the printing press in Chișinău , collected from the region and burned the already printed books in Romanian . The following archbishops Sergey Lapidevsky , Isakyi Polozensky , Neofit Novodchikov eased some of Lebedevs measures to help quell the serious dissatisfaction of the population. The next Archbishop Iakov Pyatnitsky discovered that his desire to popularize a Christian culture and a moral education faced a language barrier, and in 1900 convinced the Russian High Synod to allow the publication of religious pamphlets in Romanian, while his follower Archbishop Vladimir allowed the printing of books, and from 1908 even of a regular religious journal Luminătorul by Constantin Popovici and Gurie Grosu . The last Russian Archbishops, Serafim Chichyagov , Platon and Anastasius tried to preserve the privileged status of the Russian language in the church in Bessarabia, but did not introduce any new anti-Romanian measures. In 1918, after the installation of the Romanian administration in Bessarabia, Archbishop Anastasius refused to subordinate his eparchy to the Romanian Orthodox Church , and was forced into exile. The new authorities entrusted the archbishopric to the Bishop Nicodem de Huși from Romania, who appointed a local Archbishop Dionisie Erhan . Then the Clerical Congress on February 21, 1920 elected Gurie Botoșăneanu as the highest church official in Bessarabia, which afterwards was raised from Archbishop to Metropolitan. Ion Nistor, p. 224-244     thu     Under the protection of Gavriil Bănulescu-Bodoni and Dimitrie Sulima a theological school and a seminary were opened in Chișinău, and public schools throughout the region: in the cities of Chișinău, Hotin, Cetatea Albă, Briceni, Bender, Bălți, Cahul, Soroca, Orhei, at the monasteries of Dobrușa and Hârjauca, and even in several villages . In 1835, the tsarist authorities declared a 7-year deadline to transfer the education from Romanian to Russian . Although the measure was implemented more gradually, since 1867, Romanian was purged entirely from the education. This had the effect of keeping the peasant population of Bessarabia backward, as witnessed by the fact that in 1912 Moldavians had a literacy rate of only 10.5%, lowest among all ethnic groups of the region , with a record low 1.7% literacy rate for Moldavian women. Of the 1709 primary schools in Bessarabia in 1912, none was in the language of the main ethnic group. Ion Nistor, p. 249-255   thu water carrier     After 1812, the newly installed Russian authorities expelled the large Nogai Tatar population of Budjak , and encouraged the settlement of Moldavians, Wallachians, Bulgarians, Ukrainians and others through various fiscal facilities and exemption from military service. The colonization was generated by the need to better exploit the resources of the land, Marcel Mitrasca, Moldova: A Romanian Province Under Russian Rule, Algora, 2002, , pg. 25 and by the absence of serfdom in Bessarabia. Ion Nistor, Istoria Basarabiei, Cernăuți, 1921 German colonists from Switzerland , France, and Germany settled in 27 localities in Budjak , and by 1856 Bessarabian Germans were 42,216. Russian veterans of the 1828–1829 war with the Ottomans were settled in 10 localities in Budjak, and three other localities were settled by Cossacks from Dobrudja . Bessarabian Bulgarians and Gagauz arrived from modern eastern Bulgaria as early as the second half of the 18th century. In 1817, they numbered 482 families in 12 localities, in 1856 – 115,000 people in 43 localities. Ukrainians had arrived Bessarabia since before 1812, and already in the 1820s they made up one third of the population of the most northern Hotin county . In the following decades more Ukrainians settled throughout the northern part of Bessarabia from Galicia and Podolia . Jews from Galicia, Podolia and Poland also settled in Bessarabia in the 19th century, but mostly in the cities and fairs; in some of these they eventually became a plurality. In 1856, there were 78,751 Bessarabian Jews and according to the Imperial Russian census of 1897, the capital Kishinev had a Jewish population of 50,000, or 46%, out of a total of approximately 110,000. There was even an attempt by the Russian authorities to create 16 Jewish agricultural colonies, where 10,589 people would settle. However within less than 2 generations, most of them sold the land to the local Moldavians and moved to the cities and fairs. Ion Nistor, p.197-214 The various population movements saw an increase of the Slavic population to more than a fifth of the total population by 1920, : Today, the Bulgarians form one of the most solid elements in Southern Bessarabia, numbering nearly 150,000. Colonization brought in numerous Great Russian peasants, and the Russian bureaucracy imported Russian office-holders and professional men; according to the Romanian estimate of 1920, the Great Russians were about 75,000 in number , and the Lipovans and Cossacks 59,000 ; the Little Russians came to 254,000 . That, plus about 10,000 Poles, brings the total number of Slavs to 545,000 in a population of 2,631,000, or about one-fifth while the proportion of the Moldovan population steadily decreased. In absence of any official records on ethnic distribution until the late 19th century, various figures for the ethnic proportions of the region have been advanced. Thus, in the 1920s Romanian historian Ion Nistor alleged that, at the beginning of the Russian administration, Moldavians represented 86% of the population. Ion Nistor, Istoria Bassarabiei, Cernăuți, 1921 While according to official statistics speakers of Moldovan and Romanian accounted for 47.8% in 1897, Flavius Solomon, Die Republik Moldau und ihre Minderheiten , in: Ethnodoc-Datenbank für Minderheitenforschung in Südostosteuropa, p. 52 some authors proposed figures as high as 70% for the beginning of the 20th century.       thu       After the Russian Revolution of 1905 , a Romanian nationalist movement started to develop in Bessarabia. While it received a setback in 1906–1907, the movement re-emerged even stronger in 1917. Mitrasca, pp. 28–29     To quell the chaos brought about by the Russian revolutions of February and October 1917 , a national council, Sfatul Țării , was established in Bessarabia, with 120 members elected in county meetings of peasants, and by political and professional organizations from Bessarabia. On December 15, 1917, the Council proclaimed the Moldavian Democratic Republic , as part of the Russian Republic , then formed the government of Moldavia. With the approval of the Allies and the Russian White general Dmitry Shcherbachev , commander-in-chief of the Russian forces on the Romanian Front, on January 26, 1918, Romanian troops entered Bessarabia, ostensibly as a temporary measure to maintain security, which had deteriorated due to large numbers of deserters from the Russian Army. , Literatura și Arta, 11 September 2008 Corneliu Chirieș, , Observator de Bacău, 23 March 2008 While Romanian historiography generally asserts the intervention was done on the request of Sfatul Țării, Ion Nistor , Istoria Basarabiei, 4th edition, Chișinău, Cartea moldovenească, 1991, p. 281 Petre P. Panaitescu , Istoria Românilor, 7th edition, Editura didactică și pedagogică, București, 1990, p. 322 Pantelimon Halippa , Anatolie Moraru, Testament pentru urmași, München, 1967, reprint Hyperion, Chișinău, 1991, pp. 82–86 the presence of the Romanian army in Bessarabia was protested by some of the republics leaders, notably Ion Inculeț , president of Sfatul Țării and Pantelimon Erhan , head of the provisional Moldavian executive protesting against it. Charles Upson Clark, Bessarabia , Chapter XIX, New York, 1926, In particular they feared that big land owners-dominated Romanian Government could use the troops to prevent the envisaged Agrarian reform, a cornerstone priority of the Bessarabian government. P.Halippa, A.Moraru, Testament pentru urmasi, 2nd edition, Hyperion, Chișinău, 1991, p.85-87     After this, the Council declared the independence of the Moldavian Democratic Republic on . Under pressure from the Romanian army, Cristina Petrescu, Contrasting/Conflicting Identities:Bessarabians, Romanians, Moldovans in Nation-Building and Contested Identities, Polirom, 2001, pg. 156 King, C. The Moldovans: Romania, Russia and the Politics of Culture, Hoover Institution Press, 2000, pg. 35 on , Sfatul Țării, by a vote of 86 to 3, with 36 abstentions, approved a conditional Union of Bessarabia with Romania . Conditions included territorial autonomy of Bessarabia, an agrarian reform, respect for human freedoms and general amnesty. Nevertheless, as early as the summer of 1918 the Romanian government began encroaching on the existing forms of local autonomy. Thus, the members of the zemstvo s were appointed by royal decree, rather than being elected, as had been the case during the Russian rule. The province was subordinated to a royal-appointed General Commissar, and Sfatul Țării was relegated to a consultative position. Furthermore, the state of siege was declared throughout Bessarabia and censorship was instated. Under the pressure of the Romanian central government, worried about the growing dissatisfaction with its administration of the region and the strengthening of the autonomist current, the conditions were nominally dropped by the Sfatul Țării in December 1918. Alberto Basciani, La Difficile unione. La Bessarabia e la Grande Romania , Aracne, 2007, pg. 118 The vote was taken in the presence of only 44 of the 125 members, or, according to other sources, 48 of 160; lacking a quorum , the vote was judged to be illegitimate by some. Charles King, The Moldovans: Romania, Russia, and the Politics of Culture , Hoover Press, 2000, pg. 35     The union was recognized by Britain, France and Italy, but not by the Soviet government, which claimed the area as the Bessarabian Soviet Socialist Republic , and argued the union was made under conditions of Romanian military occupation by a Council that had not been elected by the people of Bessarabia in elections.       thu   After 1918 Bessarabia was under Romanian jurisdiction for the next 22 years. This fact was recognized in the 1920 Treaty of Paris which, however, has never come into force since it was not ratified by Japan. The newly communist Russia did not recognize the Romanian rule over Bessarabia. Wayne S Vucinich, Bessarabia In: ": null
    },
    {
        "Colliers Encyclopedia": "Colliers Encyclopedia"
    },
    {
        " vol. 4, p. 103 The Bessarabian Soviet Socialist Republic was proclaimed on May 5, 1919 in Odessa as a Provisional Workers and Peasants Government in exile and established on May 11, 1919 in Tiraspol as an autonomous part of Russian SFSR . Furthermore, Russia and later, the Soviet Union, considered the region to be Soviet territory under foreign occupation and conducted numerous diplomatic attempts to reclaim it. No diplomatic relations existed between the two states until 1934. During that time, both countries subscribed to the principle of non-violent resolution of territorial disputes in the Kellogg-Briand Treaty of 1928 and the Treaty of London of July 1933. Meanwhile, the neighboring region of Transnistria , part of the Ukrainian SSR at the time, was formed into the Moldavian ASSR after the failure of the Tatarbunary Uprising in 1924.     The land reform , implemented by Sfatul Țării in 1918–1919, resulted in a rise of a middle class , as 87% of the regions population lived in rural areas. The reform was however marred by the small size of the awarded plots, as well as by preferential allotment of land to politicians and administrative personnel who had supported the political goals of the Romanian government. Generally, urban development and industry were insignificant, and the region remained primarily an agrarian rural region throughout the interwar period. Cristina Petrescu, Contrasting/Conflicting Identities: Bessarabians, Romanians, Moldovans in Nation-Building and Contested Identities, Polirom, 2001, pg. 159 Certain improvements were achieved in the area of education, the literacy rate rising from 15.6% in 1897 Charles King , The Moldovans: Romania, Russia, and the politics of culture, Hoover Institution Press, Stanford University, 2000. . p. 23 to 37% by 1930; however, Bessarabia continued to lag behind the rest of the country, the national literacy rate being 60%. During the inter-war period, Romanian authorities also conducted a program of Romanianization that sought to assimilate ethnic minorities throughout the country. The enforcement of this policy was especially pervasive in Bessarabia due to its highly diverse population, and resulted in the closure of minority educational and cultural institutions. Charles King , The Moldovans: Romania, Russia, and the politics of culture, Hoover Institution Press, Stanford University, 2000. . p. 44     thu , 1939     On 1 January 1919 the Municipal Conservatory was created in Chişinău, in 1927 – the Faculty of Theology, in 1934 the subsidiary of the Romanian Institute of social sciences, in 1939 – municipal picture gallery. The Agricultural State University of Moldova was founded in 1933 in Chișinău. The Museum of Fine Arts was founded in 1939 by the sculptor Alexandru Plămădeală . Gurie Grosu was the first Metropolitan of Bessarabia .     The first scheduled flights to Chișinău started on 24 June 1926, on the route Bucharest – Galați – Iași – Chișinău. The flights were operated by Compagnie Franco-Roumaine de Navigation Aérienne – CFRNA, later LARES .     The first society of the Romanian writers in Chișinău was formed in 1920, among the members were Mihail Sadoveanu , Ștefan Ciobanu , Tudor Pamfile , Nicolae Dunăreanu , N.N.Beldiceanu , Apostol D.Culea . Writer and Journalist Bessarabian Society took an institutionalized form in 1940. The First Congress of the Society elected as president Pan Halippa as Vice President Nicolae Spătaru , and as secretary general Nicolae Costenco .     Viața Basarabiei was founded in 1932 by Pan Halippa . Radio Basarabia was launched on 8 October 1939, as the second radio station of the Romanian Radio Broadcasting Company . The Capitoline Wolf was opened in 1926 and in 1928 the Stephen the Great Monument , by the sculptor Alexandru Plămădeală , was opened.           After the establishment of the Soviet Union in December 1922, the Soviet government moved in 1924 to establish the Moldavian Autonomous Oblast on the lands to the east of the Dniester River in the Ukrainian SSR . The capital of the oblast was Balta , situated in present-day Ukraine . Seven months later, the oblast was upgraded to the Moldavian Autonomous Soviet Socialist Republic , even though its population was only 30% ethnic Romanian. The capital remained at Balta until 1929, when it was moved to Tiraspol . Charles King , The Moldovans: Romania, Russia, and the Politics of Culture, Hoover Institution Press, Stanford University, 2000. . p. 181     In the secret protocol attached to the 1939 Molotov–Ribbentrop Pact defining the division of the spheres of influence in Eastern Europe, Nazi Germany declared it had no political interest in Bessarabia, in response to the Soviet Unions expression of interest, thereby consigning Bessarabia to the Soviet sphere . On June 26, 1940 the Soviet government issued an ultimatum to the Romanian minister in Moscow, demanding Romania immediately cede Bessarabia and Northern Bukovina. Italy and Germany, which needed a stable Romania and access to its oil fields, urged King Carol II to do so. On June 28, Soviet troops crossed the Dniester and occupied Bessarabia, Northern Bukovina, and the Hertza region .     thu , 1941     The Soviet republic created following annexation did not follow Bessarabias traditional border. The Moldovan Soviet Socialist Republic , established on August 2, 1940, consisted of six and a half counties of Bessarabia joined with the westernmost part of the already extant MASSR . Various changes were made to its borders, which were finally settled by November 1940. Territories where ethnic Ukrainians formed a large portion of the population went to Ukraine, while a small strip of Transnistria east of the Dniester with a significant Moldovan population was joined to the MSSR. The transfer of Bessarabias Black Sea and Danube frontage to Ukraine insured its control by a stable Soviet republic. This transfer, along with the division of Bessarabia, was also designed to discourage future Romanian claims and irredentism . Charles King , The Moldovans: Romania, Russia, and the Politics of Culture, Hoover Institution Press, Stanford University, 2000. . p. 94     Under early Soviet rule, deportations of locals to the northern Urals , to Siberia , and Kazakhstan occurred regularly throughout the Stalinist period, with the largest ones on 12–13 June 1941, and 5–6 July 1949, accounting for 19,000 and 35,000 deportees respectively . , pages 584 and 587 In 1940–1941, ca. 90,000 inhabitants of the annexed territories were subject to political persecutions, such as arrests, deportations, or executions. Comisia Prezidențială pentru Analiza Dictaturii Comuniste din România: Raport Final / ed.: Vladimir Tismăneanu, Dorin Dobrincu, Cristian Vasile, București: Humanitas, 2007, 879 pp.,     By participating in the 1941 Axis invasion of the Soviet Union , pro-German Romania seized the lost territories of Bessarabia, Northern Bukovina, as well as those of the former MASSR, and established its administration there. In occupied Transnistria , Romanian forces, working with the Germans, deported ca. 147,000 Jews from the territories of Bessarabia and Bukovina, of whom over 90,000 perished in ghettoes and concentration camps. Comisia prezidențială pentru alaliza dictaturii comuniste din România. Raport final. Humanitas, București, 2008, p. 585, see also     By April 1944, successful offensives of the Soviet Army occupied northern Moldavia and Transnistria, and by the end of August 1944 the entire territory was under Soviet control, with Soviet Army units entering Kishinev on 24 August 1944. The Paris peace treaty signed in February 1947 fixed the Romanian-Soviet border to the one established in June 1940. Ian Sinclair, Boundaries in Daniel Bardonnet, Hague Academy of International Law , Le règlement pacifique des différends internationaux en Europe, Martinus Nijhoff Publishers, Hague, 1991, , p.36 Charles King , The Moldovans: Romania, Russia, and the politics of culture, Hoover Institution Press , Stanford University, 2000. , p.91     The territory remained part of the Soviet Union after World War II as the Moldavian Soviet Socialist Republic . Soviet Union created the universal educational system, brought high-tech industry and science. Most of these industries were built in Transnistria and around large cities, while in the rest of the republic agriculture was developed. By the late Soviet period, the urban intelligentsia and government officials were dominated mostly by ethnic Moldovans, while Russians and Ukrainians made up most of the technical and engineering specialists. Aleksei Georgievich Arbatov, Managing Conflict in the Former Soviet Union: Russian and American Perspectives, MIT Press , 1997, , p. 154-155.     thu , 1941     The conditions imposed during the reestablishment of Soviet rule became the basis of deep resentment toward Soviet authorities, manifested in numerous resistance movements to Soviet rule . Tismaneanu Report, p. 755-758 In 1946, as a result of a severe drought and excessive delivery quota obligations and requisitions imposed by the Soviet government, the southwestern part of the USSR suffered from a major famine resulting in a minimum of 115,000 deaths among the peasants. Charles King , The Moldovans: Romania, Russia, and the politics of culture, Hoover Institution Press, Stanford University, 2000. . p. 96 During Leonid Brezhnev s 1950–1952 tenure as the First Secretary of the Communist Party of Moldavia , he was ruthless comparing to his predecessor Nicolae Coval in putting down numerous resistance groups, and issuing harsh sentences. Tismaneanu Report, p. 758 During the Operation North , 723 families were deported from the Moldavian SSR, on the night of March 31 to April 1, 1951, members of neoprotestant sects, mostly Jehovahs Witnesses , qualified as religious elements considered a potential danger for the communist regime. Comisia Prezidențială pentru Analiza Dictaturii Comuniste din România: Raport Final / ed.: Vladimir Tismăneanu, Dorin Dobrincu, Cristian Vasile, București: Humanitas, 2007, , p. 754 Elena Șișcanu, Basarabia sub ergimul bolşevic , București, Ed. Semne, 1998, p.111     thu     Most political and academic positions were given to members of non-Romanian ethnic groups . E.S. Lazo, Moldavskaya partiynaya organizatsia v gody stroitelstva sotsializma, Chișinău, Știința, 1981, p. 38 William Crowther, Ethnicity and Participation in the Communist Party of Moldavia , in Journal of Soviet Nationalities I, no. 1990, p. 148-49     Although Brezhnev and other CPM first secretaries were largely successful in suppressing Romanian irredentism in the 1950s–1980s, Mikhail Gorbachev s administration facilitated the revival of the movement in the region. His policies of glasnost and perestroika created conditions in which nationalistic feelings could be openly expressed and in which the Soviet republics could consider reforms. King, p. 121     In the 1970s and 80s Moldova received substantial investment from the budget of the USSR to develop industrial, scientific facilities, as well as housing. In 1971 the Council of Ministers of the USSR adopted a decision About the measures for further development of Kishinev city that secured more than one billion rubles of funds for Chișinău alone from the USSR budget. Subsequent decisions directed large amounts of funds and brought qualified specialists from all over the USSR to further develop the Moldavian SSR. on Kishinev.info, Retrieved on 2008-10-12 Such an allocation of USSR assets was influenced by the fact that the-then leader of the Soviet Union , Leonid Brezhnev , was the First Secretary of the local Communist Party in the 1950s. These investments stopped in 1991 with the dissolution of the Soviet Union , when Moldova became independent.     thu               In the climate of Mikhail Gorbachev s perestroika and glasnost , national sentiment escalated in the Moldavian SSR in 1988. In 1989, the Popular Front of Moldova was formed as an association of independent cultural and political groups and gained official recognition. The Popular Front organized a number of large demonstrations, which led to the designation of Moldovan as the official language of the MSSR on August 31, 1989 and a return to the Latin alphabet. by Andrei Panici, American University in Bulgaria, 2002; pages 39–41     However, opposition was growing to the increasingly exclusionary nationalist policies of the Popular Front, especially in Transnistria, where the Yedinstvo-Unitatea Intermovement had been formed in 1988 by Slavic minorities, , Fedor, Helen, ed. Moldova: A Country Study. GPO for the Library of Congress , Washington, D.C., 1995 and in the south, where the organization Gagauz Halkî , formed in November 1989, came to represent the Gagauz , a Turkic-speaking minority there.     The first democratic elections to the Moldavian SSRs Supreme Soviet were held on February 25, 1990. Runoff elections were held in March. The Popular Front won a majority of the votes. After the elections, Mircea Snegur , a reformed communist, was elected chairman of the Supreme Soviet; in September he became president of the republic. The reformist government that took over in May 1990 made many changes that did not please the minorities, including changing the republics name in June from the Moldavian Soviet Socialist Republic to the Soviet Socialist Republic of Moldova and declaring it sovereign the following month. At the same time, Romanian tricolor with the Moldavian coat-of-arms was adopted as the state flag, and ": null
    },
    {
        "Deșteaptă-te române!": "Deșteaptă-Te Române!"
    },
    {
        ", the Romanian anthem, became the anthem of the SSRM. During that period a Movement for unification of Romania and the Republic of Moldova became active in each country.     In August 1990, following a refusal of the increasingly nationalist republican government, to grant cultural and territorial autonomy to Gagauzia and Transnistria, two regions populated primarily by ethnic minorities. In response, the Gagauz Autonomous Soviet Socialist Republic was declared in the south, in the city of Comrat . In September in Tiraspol, the main city on the east bank of the Dniester River , the Pridnestrovian Moldavian Soviet Socialist Republic followed suit. The parliament of Moldova immediately declared these declarations null and void. , Kumar Rupesinghe and Valery A. Tishkov, United Nations University Press, 1996     In mid-October 1990, approximately 30,000 Moldovan nationalist volunteers were sent to Gagauzia and Transnistria, where an outbreak of violence was averted by the intervention of the Soviet 14th Army. human rights assessment by ": null
    },
    {
        "Memorial": "Memorial"
    },
    {
        ", May, 1992 However, negotiations in Moscow between the Gagauz and Transnistrian leadership, and the government of the Soviet Socialist Republic of Moldova failed.     In May 1991, the countrys official name was changed to the Republic of Moldova . The name of the Supreme Soviet also was changed, to the Moldovan Parliament.     During the 1991 Soviet coup détat attempt in Moscow against Mikhail Gorbachev, commanders of the Soviet Unions Southwestern Theater of Military Operations attempted to impose a state of emergency in Moldova. They were overruled by the Moldovan government, which declared its support for Russian president Boris Yeltsin , who led the counter-coup in Moscow. On 27 August 1991, following the coups collapse, Moldova declared its independence from the Soviet Union.     The December elections of Stepan Topal and Igor Smirnov as presidents of Gagauzia and Transnistria respectively, and the official dissolution of the Soviet Union at the end of the year, had further increased tensions in Moldova.         thu n region of Moldova     Transnistria is the region east of the Dniester River , which includes a large proportion of predominantly Russophone ethnic Russians and Ukrainians . The headquarters of the Soviet 14th Guards Army was located in the regional capital Tiraspol. There, on September 2, 1990, local authorities proclaimed an independent Pridnestrovian Moldavian Soviet Socialist Republic . The motives behind this move were fear of the rise of nationalism in Moldova and the countrys expected reunification with Romania upon secession from the USSR. In the winter of 1991–1992 clashes occurred between Transnistrian forces and the Moldovan police. Between March 2 and July 26, 1992, the conflict escalated into a military engagement. Following an intervention of the 14th Army into the conflict on the side of the separatists, the war was stopped and the Moscow Agreement on the principles of peace settlement of armed conflict in Trans-Dniester districts of the republic of Moldova was signed on 21 July 1992.     As of 2007, the Russian military remains in Transnistria, despite Russia having signed international agreements to withdraw, and against the will of Moldovan government. : I would like to reiterate on this occasion the position of the Republic of Moldova according to which the withdrawal of the Russian troops that remain on the Moldovan territory against its will, in conformity with the obligations assumed by the Russian Federation in 1999 in Istanbul, would create the necessary premises for ratifying and applying the Adapted CFE Treaty. Jamestown: Moldovan President wants out of Russias orbit The government of Moldova continues to offer extensive autonomy to Transnistria, while the government of Transnistria demands independence. ": null
    },
    {
        "De jure": "De Jure"
    },
    {
        ", Transnistria is internationally recognized as part of Moldova, but ": null
    },
    {
        "de facto": "De Facto"
    },
    {
        ", the Moldovan government does not exercise any control over the territory.  Horia C. Matei, State lumii. Enciclopedie de istorie. Meronia, București, 2006, p. 292-294            On 8 December 1991, ": null
    },
    {
        "Mircea Snegur": "Mircea Snegur"
    },
    {
        ", an ex-communist reformer, ran an unopposed ": null
    },
    {
        "election for the presidency": "1991 Moldovan Presidential Election"
    },
    {
        ". On March 2, 1992, the country achieved formal recognition as an independent state at the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        ".   at data.un.org     In 1992, Moldova became involved in a brief conflict against local insurgents in Transnistria, who were aided by ": null
    },
    {
        "locally stationed Russian armed forces": "14Th Army Involvement In Transnistria"
    },
    {
        " and ": null
    },
    {
        "Don Cossacks": "Don Cossacks"
    },
    {
        ", which resulted in the failure of Moldova to regain control over the breakaway republic.     Starting 1993, Moldova began to distance itself from Romania. The ": null
    },
    {
        "1994 Constitution of Moldova": "Constitution Of Moldova"
    },
    {
        " used the term Moldovan language instead of Romanian and changed the national anthem to ": null
    },
    {
        "Limba noastră": "Limba Noastră"
    },
    {
        " .     On January 2, 1992, Moldova introduced a ": null
    },
    {
        "market economy": "Market Economy"
    },
    {
        ", liberalizing prices, which resulted in huge ": null
    },
    {
        "inflation": "Inflation"
    },
    {
        ". From 1992 to 2001, the young country suffered its worst economic crisis, leaving most of the population below the poverty line. In 1993, a national currency, the ": null
    },
    {
        "Moldovan leu": "Moldovan Leu"
    },
    {
        ", was introduced to replace the ": null
    },
    {
        "Soviet ruble": "Soviet Ruble"
    },
    {
        ". The end of the ": null
    },
    {
        "planned economy": "Planned Economy"
    },
    {
        " also meant that industrial enterprises would have to buy supplies and sell their goods by themselves, and most of the management was unprepared for such a change. Moldovas industry, especially machine building, became all but defunct, and unemployment skyrocketed. The economic fortunes of Moldova began to change in 2001; since then the country has seen a steady annual growth of between 5% and 10%. In the early 2000s, there was also a considerable growth of emigration of Moldovans looking for work in Italy, Portugal, Spain, Greece, Cyprus, Turkey, Russia and other countries. Remittances from Moldovans abroad account for almost 38% of Moldovas ": null
    },
    {
        "GDP": "Gdp"
    },
    {
        ", the second-highest percentage in the world.  Officially, Moldovas annual GDP is on the order of $1,000 per capita; however, a significant part of the economy goes unregistered due to ": null
    },
    {
        "corruption": "Political Corruption"
    },
    {
        ".     The pro-nationalist governments of prime ministers Mircea Druc , and ": null
    },
    {
        "Valeriu Muravschi": "Valeriu Muravschi"
    },
    {
        " , were followed by a more moderate government of ": null
    },
    {
        "Andrei Sangheli": "Andrei Sangheli"
    },
    {
        ", during which there was a decline of the pro-Romanian nationalist sentiment. Helen Fedor, ed.   Washington: GPO for the Library of Congress, 1995. After the 1994 elections, Moldovan Parliament adopted measures that distanced Moldova from Romania. The new Moldovan Constitution also provided for autonomy for Transnistria and Gagauzia. On December 23, 1994, the Parliament of Moldova adopted a Law on the Special Legal Status of Gagauzia , and in 1995 it was constituted. alegeri.md:       After winning the presidential elections of 1996, on January 15, 1997, ": null
    },
    {
        "Petru Lucinschi": "Petru Lucinschi"
    },
    {
        ", the former First Secretary of the ": null
    },
    {
        "Moldavian Communist Party": "Moldavian Communist Party"
    },
    {
        " in 1989–91, became the countrys second president. After the legislative elections on March 22, 1998, the Alliance for Democracy and Reform was formed by non-Communist parties. However, the term of the new government of Prime Minister ": null
    },
    {
        "Ion Ciubuc": "Ion Ciubuc"
    },
    {
        " was marked by chronic political instability, which prevented a coherent reform program. The ": null
    },
    {
        "1998 financial crisis in Russia": "1998 Russian Financial Crisis"
    },
    {
        ", Moldovas main economic partner at the time, produced an economic crisis in the country. The standard of living plunged, with 75% of population living below the poverty line, while the economic disaster caused 600,000 people to emigrate.     New governments were formed by ": null
    },
    {
        "Ion Sturza": "Ion Sturza"
    },
    {
        " and ": null
    },
    {
        "Dumitru Braghiş": "Dumitru Braghiş"
    },
    {
        " . On July 21, 2000, the Parliament adopted an amendment to the Constitution that transformed Moldova from a presidential to a parliamentary republic, in which the president is elected by three fifths of the votes in the parliament, and no longer directly by the people.            Only 3 of the 31 political parties won more than the 6% of the popular vote required to win seats in parliament in the February 25, 2001 elections. Winning 49.9% of the vote, the ": null
    },
    {
        "Party of Communists of the Republic of Moldova": "Party Of Communists Of The Republic Of Moldova"
    },
    {
        " , gained 71 of the 101 parliament seats, and elected ": null
    },
    {
        "Vladimir Voronin": "Vladimir Voronin"
    },
    {
        " as the countrys third president on April 4, 2001. A new government was formed on April 19, 2001 by ": null
    },
    {
        "Vasile Tarlev": "Vasile Tarlev"
    },
    {
        ". The country became the first post-Soviet state where a non-reformed communist party returned to power. In March–April 2002, the opposition ": null
    },
    {
        "Christian-Democratic Peoples Party": "Christian-Democratic Peoples Party"
    },
    {
        " organized a mass protest in Chișinău against the plans of the government to fulfill its electoral promise and introduce ": null
    },
    {
        "Russian": "Russian Language"
    },
    {
        " as the second state language along with its compulsory study in schools. BBC News:  , 9 January 2002 The government annulled these plans.     The relationship between Moldova and Russia deteriorated in November 2003 over a ": null
    },
    {
        "Russian proposal": "Kozak Memorandum"
    },
    {
        " for the solution of the Transnistrian conflict, which Moldovan authorities refused to accept Dr. Mihai Gribincea:   because it stipulated a 20-year Russian military presence in Moldova. The federalization plan for Moldova would have also turned Transnistria and Gagauzia into a ": null
    },
    {
        "blocking minority": "Veto"
    },
    {
        " over all major policy matters of Moldova. As of 2006, approximately 1,200 of the 14th Army personnel remain stationed in Transnistria, guarding a large ammunitions depot at ": null
    },
    {
        "Colbasna": "Colbasna"
    },
    {
        ". In recent years, negotiations between the Transnistrian and Moldovan leaders have been going on under the mediation of the ": null
    },
    {
        "Organization for Security and Co-operation in Europe": "Organization For Security And Co-Operation In Europe"
    },
    {
        " , Russia, and Ukraine; lately observers from the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " and the United States have become involved, creating a 5+2 format.     In the wake of the November 2003 deadlock with Russia, a series of shifts in the external policy of Moldova occurred, targeted at rapprochement with the European Union. In the context of the EUs expansion to the east, Moldova wants to sign the Stability and Association Agreement. It implemented its first three-year action plan within the framework of the ": null
    },
    {
        "European Neighborhood Policy": "European Neighborhood Policy"
    },
    {
        " of the EU.       In the ": null
    },
    {
        "March 2005 elections": "2005 Moldovan Parliamentary Election"
    },
    {
        ", the Party of the Communists won 46% of the vote, , the Democratic Moldova Block won 28.5% of the vote , and the ": null
    },
    {
        "Christian Democratic People Party": "Christian-Democratic Peoples Party"
    },
    {
        " won 9.1% . On April 4, 2005, ": null
    },
    {
        "Vladimir Voronin": "Vladimir Voronin"
    },
    {
        " was re-elected as countrys president, supported by a part of the opposition, and on April 8, Vasile Tarlev was again appointed head of government. On March 31, 2008, Vasile Tarlev was replaced by ": null
    },
    {
        "Zinaida Greceanîi": "Zinaida Greceanîi"
    },
    {
        " as head of the government.          Following the ": null
    },
    {
        "parliamentary elections": "April 2009 Moldovan Parliamentary Election"
    },
    {
        " on April 5, 2009 the Communist Party won 49.48% of the votes, followed by the Liberal Party with 13.14% of the votes, the Liberal Democratic Party with 12.43% and the Alliance Moldova Noastră with 9.77%. The opposition leaders have protested against the outcome calling it fraudulent and demanded a repeated election. A preliminary report by OSCE observers called the vote generally free and fair. However, one member of the OSCE observation team expressed concerns over that conclusion and said that she and a number of other team members feel that there had been some manipulation, but they were unable to find any proof. ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        ":   , 8 April 2009     On April 6, 2009, several ": null
    },
    {
        "NGOs": "Ngo"
    },
    {
        "and opposition parties organized a protest in Chișinău, gathering a crowd of about 15,000 with the help of social network sites such as ": null
    },
    {
        "Twitter": "Twitter"
    },
    {
        " and ": null
    },
    {
        "Facebook": "Facebook"
    },
    {
        ". The protesters accused the Communist government of electoral fraud. Anti-communist and pro-Romanian slogans were widely used. The demonstration had spun out of control on April 7 and ": null
    },
    {
        "escalated into a riot": "2009 Moldova Civil Unrest"
    },
    {
        " when a part of the crowd attacked the presidential offices and broke into the parliament building, looting and setting its interior on fire. SevenTimes.ro:  , 08 April 2009  , April 08, 2009 Police had regained control on the night of April 8, arresting and detaining several hundred protesters. Numerous detainees reported beatings by the police when released. ": null
    },
    {
        "Al Jazeera": "Al Jazeera"
    },
    {
        " English:   , 7 April 2009. The violence on both sides was condemned by the OSCE and other international organizations. OSCE press release:    Three young people died during the day the protests took place. The opposition blamed police abuse for these deaths, while the government claimed they were either unrelated to the protests, or accidents. Government officials, including President Vladimir Voronin, called the rioting a ": null
    },
    {
        "coup détat": "Coup Détat"
    },
    {
        " attempt and accused Romania of organizing it. The opposition accused the government of organizing the riots by introducing ": null
    },
    {
        "agents provocateurs": "Agent Provocateur"
    },
    {
        " among the protesters. The political climate in Moldova remained unstable. The parliament failed to elect a new president.  For this reason, the parliament was dissolved and ": null
    },
    {
        "new general elections": "July 2009 Moldovan Parliamentary Election"
    },
    {
        " were held on July 29, 2009, with the Communists losing power to the ": null
    },
    {
        "Alliance for European Integration": "Alliance For European Integration"
    },
    {
        ", a pro-European coalition.           An attempt by the new ruling coalition to amend the constitution of Moldova via ": null
    },
    {
        "a referendum in 2010": "2010 Moldovan Constitutional Referendum"
    },
    {
        " in order to enable presidential election by popular vote failed due to lack of turnout. The ": null
    },
    {
        "parliamentary election": "2010 Moldovan Parliamentary Election"
    },
    {
        " in November 2010 had retained the status quo between the ruling coalition and the communist opposition.On 16 March 2012,  parliament elected ": null
    },
    {
        "Nicolae Timofti": "Nicolae Timofti"
    },
    {
        " as president by 62 votes out of 101, with the PCRM boycotting the election, putting an end to a political crisis that had lasted since ": null
    },
    {
        "April 2009": "April 2009 Moldovan Parliamentary Election"
    },
    {
        ". ": null
    },
    {
        "Washington Post": "Washington Post"
    },
    {
        ",   In the November 2014 elections the pro-European parties maintained their majority in parliament. ": null
    }
]