[
    {
        "The history of The Church of Jesus Christ of Latter-day Saints  is typically divided into three broad time periods:   the early history during the lifetime of ": null
    },
    {
        "Joseph Smith": "Joseph Smith"
    },
    {
        " which is in common with all ": null
    },
    {
        "Latter Day Saint movement": "Latter Day Saint Movement"
    },
    {
        " churches,   a pioneer era under the leadership of ": null
    },
    {
        "Brigham Young": "Brigham Young"
    },
    {
        " and his 19th-century successors, and   a modern era beginning around the turn of the 20th century as the practice of ": null
    },
    {
        "polygamy": "Polygamy"
    },
    {
        " was discontinued.     ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "The Church Of Jesus Christ Of Latter-Day Saints"
    },
    {
        " traces its ": null
    },
    {
        "origins": "Christian Revivalunited States 1800–1850"
    },
    {
        " to ": null
    },
    {
        "western": "Burned-Over District"
    },
    {
        " New York": "New York"
    },
    {
        ", where Joseph Smith, founder of the Latter Day Saint ": null
    },
    {
        "movement": "Restoration"
    },
    {
        ", was raised. Joseph Smith gained a small following in the late 1820s as he was dictating the ": null
    },
    {
        "Book of Mormon": "Book Of Mormon"
    },
    {
        ", which he said was a translation of words found on a set of ": null
    },
    {
        "golden plates": "Golden Plates"
    },
    {
        " that had been buried near his home in ": null
    },
    {
        "upstate New York": "Upstate New York"
    },
    {
        " by an ": null
    },
    {
        "indigenous American": "Indigenous Peoples Of The Americas"
    },
    {
        " prophet. On April 6, 1830, at the ": null
    },
    {
        "home of Peter Whitmer": "Peter Whitmer Log Home"
    },
    {
        " in ": null
    },
    {
        "Fayette, New York": "Fayette, New York"
    },
    {
        ", Smith organized the religions first legal church entity, the ": null
    },
    {
        "Church of Christ": "Church Of Christ"
    },
    {
        ". The church rapidly gained a following, who viewed Smith as their ": null
    },
    {
        "prophet": "Prophet, Seer, And Revelator"
    },
    {
        ". The main body of the church moved first to ": null
    },
    {
        "Kirtland, Ohio": "Kirtland, Ohio"
    },
    {
        " in the early 1830s, then to ": null
    },
    {
        "Missouri": "Missouri"
    },
    {
        " in 1838, where the ": null
    },
    {
        "1838 Mormon War": "Mormon War"
    },
    {
        " with other Missouri settlers ensued, culminating in adherents being expelled from the state under ": null
    },
    {
        "Missouri Executive Order 44": "Missouri Executive Order 44"
    },
    {
        " signed by ": null
    },
    {
        "the governor of Missouri": "Lilburn W. Boggs"
    },
    {
        ". After Missouri, Smith built the city of ": null
    },
    {
        "Nauvoo, Illinois": "Nauvoo, Illinois"
    },
    {
        ", near which ": null
    },
    {
        "Smith was killed": "Death Of Joseph Smith"
    },
    {
        ". After Smiths death, a ": null
    },
    {
        "succession crisis": "Succession Crisis"
    },
    {
        " ensued, and the majority voted to accept the ": null
    },
    {
        "Quorum of the Twelve": "Quorum Of The Twelve"
    },
    {
        ", led by Brigham Young, as the churchs leading body.     After continued difficulties and persecution in Illinois, Young left Nauvoo in 1846 and led his followers, the ": null
    },
    {
        "Mormon pioneers": "Mormon Pioneers"
    },
    {
        ", to the Great ": null
    },
    {
        "Salt Lake Valley": "Salt Lake Valley"
    },
    {
        ". The group branched out in an effort to pioneer a large state to be called ": null
    },
    {
        "Deseret": "State Of Deseret"
    },
    {
        ", eventually establishing colonies from Canada to present-day Mexico. Young incorporated The Church of Jesus Christ of Latter-day Saints as a legal entity, and governed his followers as a ": null
    },
    {
        "theocratic": "Theocracy"
    },
    {
        " leader serving in both political and religious positions. He also publicized the previously secret practice of ": null
    },
    {
        "plural marriage": "Plural Marriage"
    },
    {
        ", a form of ": null
    },
    {
        "polygamy": "Polygamy"
    },
    {
        ". By 1857, tensions had again escalated between Mormons and other Americans, largely as a result of church teachings on polygamy and theocracy. The ": null
    },
    {
        "Utah Mormon War": "Utah War"
    },
    {
        " ensued from 1857 to 1858, which resulted in the relatively peaceful invasion of Utah by the ": null
    },
    {
        "United States Army": "United States Army"
    },
    {
        ", after which Young agreed to step down from power and be replaced by a non-Mormon territorial governor, ": null
    },
    {
        "Alfred Cumming": "Alfred Cumming"
    },
    {
        ". Nevertheless, the LDS Church still wielded significant political power in the ": null
    },
    {
        "Utah Territory": "Utah Territory"
    },
    {
        " as part of a shadow government. At Youngs death in 1877, he was followed by other powerful members, who continued the practice of polygamy despite opposition by the ": null
    },
    {
        "United States Congress": "United States Congress"
    },
    {
        ". After tensions with the U.S. government came to a head in 1890, the church ": null
    },
    {
        "officially abandoned": "1890 Manifesto"
    },
    {
        " the public practice of polygamy in the United States, and eventually stopped performing official polygamous marriages altogether after a ": null
    },
    {
        "Second Manifesto": "Second Manifesto"
    },
    {
        " in 1904. Eventually, the church adopted a policy of ": null
    },
    {
        "excommunicating": "Excommunication"
    },
    {
        " its members found practicing polygamy and today seeks to actively distance itself from ": null
    },
    {
        "fundamentalist": "Mormon Fundamentalism"
    },
    {
        " groups still practicing polygamy.     During the 20th century, the church grew substantially and became an international organization. Distancing itself from polygamy, the church began engaging, first with mainstream American culture, and then with international cultures, particularly those of ": null
    },
    {
        "Latin America": "Latin America"
    },
    {
        ", by sending out thousands of ": null
    },
    {
        "missionaries": "Mormon Missionary"
    },
    {
        " across the globe. The church became a strong and public champion of ": null
    },
    {
        "monogamy": "Monogamy"
    },
    {
        " and the ": null
    },
    {
        "nuclear family": "Nuclear Family"
    },
    {
        ", and at times played a prominent role in political matters. Among the official changes to the organization during the modern area include the ": null
    },
    {
        "ordination of black men": "Black People And Mormonism"
    },
    {
        " to the priesthood in 1978, reversing a policy originally instituted by Brigham Young. The church has also periodically changed its ": null
    },
    {
        "temple ceremony": "Endowment"
    },
    {
        ", gradually omitting certain controversial elements. There are also periodic changes in the structure and organization of the church, mainly to accommodate the organizations growth and increasing international presence.                    The early history of the LDS Church is shared with other denominations of the Latter Day Saint movement, who all regard Joseph Smith as the founder of their religious tradition. Smith gained a small following in the late 1820s as he was dictating the Book of Mormon, which he said was a translation of words found on the Golden Plates that had been buried near his home in western New York by an ": null
    },
    {
        "indigenous American": "Indigenous Peoples Of The Americas"
    },
    {
        " prophet. Smith said he had been in contact with an ": null
    },
    {
        "angel Moroni": "Angel Moroni"
    },
    {
        ", who showed him the plates location and had been grooming him for a role as a religious leader. ": null
    },
    {
        "Joseph Smith, Sr.": "Joseph Smith, Sr."
    },
    {
        " in the ": null
    },
    {
        "Manchester": "Manchester , New York"
    },
    {
        " area, near ": null
    },
    {
        "Rochester": "Rochester, New York"
    },
    {
        ", followed by a meeting the next Sunday in nearby ": null
    },
    {
        "Fayette": "Fayette, New York"
    },
    {
        " at the house of ": null
    },
    {
        "Peter Whitmer, Sr.": "Peter Whitmer, Sr."
    },
    {
        " Nevertheless, one of Smiths histories and an 1887 reminiscence by ": null
    },
    {
        "David Whitmer": "David Whitmer"
    },
    {
        " say the church was organized at the Whitmer house in Fayette.  See ": null
    },
    {
        "Church of Christ ": "Church Of Christ"
    },
    {
        ". The LDS Church refers to Fayette as the place of organization in all its official ": null
    },
    {
        "publications": "Publication"
    },
    {
        ". Smith organized the religions first legal church entity, the Church of Christ. The church rapidly gained a following, who viewed Smith as their prophet. In late 1830, Smith envisioned a ": null
    },
    {
        " city of Zion ": "Zion"
    },
    {
        ", a Utopian city in ": null
    },
    {
        "Native American": "Native Americans In The United States"
    },
    {
        " lands near ": null
    },
    {
        "Independence, Missouri": "Independence, Missouri"
    },
    {
        ". In October 1830, he sent his ": null
    },
    {
        "Assistant President": "Assistant President Of The Church"
    },
    {
        ", ": null
    },
    {
        "Oliver Cowdery": "Oliver Cowdery"
    },
    {
        ", and others on a ": null
    },
    {
        "mission": "Missionary"
    },
    {
        " to the area.  Passing through ": null
    },
    {
        "Kirtland, Ohio": "Kirtland, Ohio"
    },
    {
        ", the missionaries converted a congregation of ": null
    },
    {
        "Disciples of Christ": "Disciples Of Christ"
    },
    {
        " led by ": null
    },
    {
        "Sidney Rigdon": "Sidney Rigdon"
    },
    {
        ", and in 1831, Smith decided to temporarily move his followers to Kirtland until lands in the Missouri area could be purchased. In the meantime, the churchs headquarters remained in Kirtland from 1831 to 1838; and there the church built ": null
    },
    {
        "its first temple": "Kirtland Temple"
    },
    {
        " and continued to grow in membership from 680 to 17,881. The Desert Morning News 2008 Church Almanac pg.655     While the main church body was in Kirtland, many of Smiths followers had attempted to establish settlements in Missouri, but had met with resistance from other Missourians who believed Mormons were ": null
    },
    {
        "abolitionists": "Abolitionism In The United States"
    },
    {
        ", or who distrusted their political ambitions. After Smith and other Mormons in Kirtland emigrated to Missouri in 1838, hostilities escalated into the ": null
    },
    {
        "1838 Mormon War": "Mormon War"
    },
    {
        ", culminating in adherents being expelled from the state under an Extermination Order signed by ": null
    },
    {
        "the governor of Missouri": "Lilburn W. Boggs"
    },
    {
        ".          After Missouri, Smith built the city of Nauvoo, Illinois as the new church headquarters, and served as the citys mayor and leader of the militia. As church leader, Smith also instituted the then-secret practice of plural marriage, and taught a form of ": null
    },
    {
        "Millennialism": "Millennialism"
    },
    {
        " which he called ": null
    },
    {
        "theodemocracy": "Theodemocracy"
    },
    {
        " , to be led by a ": null
    },
    {
        "Council of Fifty": "Council Of Fifty"
    },
    {
        " which, allegedly, had secretly and symbolically anointed him as king of this Millennial theodemocracy.  Partly in response to these trends, on June 7, 1844, a newspaper called the  Nauvoo Expositor , edited by dissident Mormon ": null
    },
    {
        "William Law": "William Law"
    },
    {
        ", issued a scathing criticism of polygamy and Nauvoo theocratic government, including a call for church reform based on earlier Mormon principles. ": null
    },
    {
        "Nauvoo Expositor": "S:Nauvoo Expositor"
    },
    {
        ", p. 1, col. E to p. 2, col. E. The paper also contained editorials and letters to the editor that were highly critical of Joseph Smiths political actions and his 1844 candidacy for ": null
    },
    {
        "President of the United States": "President Of The United States"
    },
    {
        ". Considering the paper to be libellous, Smith and the Nauvoo city council voted to shut down the paper as a public nuisance. Relations between Mormons and residents of surrounding communities had been strained, and some of them instituted criminal charges against Smith for treason. Smith surrendered to police in the nearby ": null
    },
    {
        "Carthage, Illinois": "Carthage, Illinois"
    },
    {
        ", and while in state custody, he and his brother ": null
    },
    {
        "Hyrum Smith": "Hyrum Smith"
    },
    {
        ", who was second in line to the church presidency, Regarding ": null
    },
    {
        "Hyrum Smith": "Hyrum Smith"
    },
    {
        ", ": null
    },
    {
        "Brigham Young": "Brigham Young"
    },
    {
        " later stated: Did Joseph Smith ordain any man to take his place. He did. Who was it? It was Hyrum, but Hyrum fell a martyr before Joseph did. If Hyrum had lived he would have acted for Joseph . ": null
    },
    {
        "were killed": "Death Of Joseph Smith"
    },
    {
        " in a firefight with an angry mob attacking the jail on June 27, 1844. Encyclopedia of Latter-Day Saint History pg. 824.     After Smiths death, a ": null
    },
    {
        "succession crisis": "Succession Crisis"
    },
    {
        " ensued. In this crisis a number of church leaders campaigned to lead the church. Most adherents voted on August 8, 1844 to accept the argument of Brigham Young, the ": null
    },
    {
        "senior apostle": "President Of The Quorum Of The Twelve Apostles"
    },
    {
        ", that there could be no true successor to Joseph Smith, but that the Twelve had all the required authority to lead the church, and were best suited to take on that role. Later, adherents bolstered their succession claims by referring to a March 1844 meeting in which Joseph committed the keys of the kingdom to a group of members within the ": null
    },
    {
        "Council of Fifty": "Council Of Fifty"
    },
    {
        " that included the ": null
    },
    {
        "apostles": "Quorum Of The Twelve Apostles"
    },
    {
        ". , republished as  In addition, by the end of the 1800s, several of Youngs followers had published reminiscences recalling that during Youngs August 8 speech, he looked or sounded similar to Joseph Smith, to which they attributed the power of God. ; Lynne Watkins Jorgensen, The Mantle of the Prophet Joseph Smith Passes to Brother Brigham: One Hundred Twenty-one Testimonies of a Collective Spiritual Witness in ": null
    },
    {
        "John W. Welch": "John W. Welch"
    },
    {
        " , 2005. Opening the Heavens: Accounts of Divine Manifestations, 1820-1844, Provo, Utah: ": null
    },
    {
        "BYU Press": "Byu Press"
    },
    {
        ", pp. 374-480; Eugene English, George Laub Nauvoo Diary,  BYU Studies , 18 167 ; William Burton Diary, May 1845. LDS Church Archives ; Benjamin F. Johnson, My Lifes Review p. 103-104 ; Life Story of Mosiah Hancock, p. 23, BYU Library ; ": null
    },
    {
        "Wilford Woodruff": "Wilford Woodruff"
    },
    {
        ", Deseret News, 15 March 1892 ; ": null
    },
    {
        "George Q. Cannon": "George Q. Cannon"
    },
    {
        ",  Juvenile Instructor , 22 174-175 .                 Under the leadership of Brigham Young, Church leaders planned to leave Nauvoo, Illinois in April 1846, but amid threats from the state militia, they were forced to cross the Mississippi River in the cold of February. They eventually left the boundaries of the United States to what is now ": null
    },
    {
        "Utah": "Utah"
    },
    {
        " where they founded ": null
    },
    {
        "Salt Lake City": "Salt Lake City"
    },
    {
        ".     The groups that left Illinois for Utah became known as the ": null
    },
    {
        "Mormon pioneers": "Mormon Pioneers"
    },
    {
        " and forged a path to Salt Lake City known as the ": null
    },
    {
        "Mormon Trail": "Mormon Trail"
    },
    {
        ". The arrival of the original Mormon Pioneers in the Salt Lake Valley on July 24, 1847 is commemorated by the ": null
    },
    {
        "Utah State holiday": "U.S. State Holiday"
    },
    {
        " Pioneer Day": "Pioneer Day"
    },
    {
        ".          Groups of converts from the United States, Canada, Europe, and elsewhere were encouraged to gather to Utah in the decades following. Both the original Mormon migration and subsequent convert migrations resulted in much sacrifice and quite a number of deaths. Brigham Young organized a great colonization of the American West, with Mormon settlements extending from Canada to Mexico. Notable cities that sprang from early Mormon settlements include ": null
    },
    {
        "San Bernardino, California": "San Bernardino, California"
    },
    {
        ", ": null
    },
    {
        "Las Vegas, Nevada": "Las Vegas, Nevada"
    },
    {
        ", and ": null
    },
    {
        "Mesa, Arizona": "Mesa, Arizona"
    },
    {
        ".            Following the death of Joseph Smith, Brigham Young stated that the Church should be led by the Quorum of the Twelve Apostles . Later, after the migration to Utah had begun, Brigham Young was sustained as a member of the ": null
    },
    {
        "First Presidency": "First Presidency"
    },
    {
        " on December 25, 1847, , and then as ": null
    },
    {
        "President of the Church": "President Of The Church"
    },
    {
        " on October 8, 1848. .     One of the reasons the Saints had chosen the Great Basin as a settling place was that the area was at the time outside the territorial borders of the United States, which Young had blamed for failing to protect Mormons from political opposition from the states of Missouri and Illinois. However, in the 1848 ": null
    },
    {
        "Treaty of Guadalupe Hidalgo": "Treaty Of Guadalupe Hidalgo"
    },
    {
        ", ": null
    },
    {
        "Mexico": "Mexico"
    },
    {
        " ceded": "Mexican Cession"
    },
    {
        " the area to the United States. As a result, Brigham Young sent emissaries to ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        " with a proposal to create a vast ": null
    },
    {
        "State of Deseret": "State Of Deseret"
    },
    {
        ", of which Young would naturally be the first governor. Instead, Congress created the much smaller ": null
    },
    {
        "Utah Territory": "Utah Territory"
    },
    {
        " in 1850, and Young was appointed governor in 1851. Because of his religious position, Young exercised much more practical control over the affairs of Mormon and non-Mormon settlers than a typical territorial governor of the time.     For most of the 19th century, the LDS Church maintained an ecclesiastical court system parallel to federal courts, and required Mormons to use the system exclusively for civil matters, or face church discipline.        In 1856-1858, the Church underwent what is commonly called the ": null
    },
    {
        "Mormon Reformation": "Mormon Reformation"
    },
    {
        ". Peterson, Paul H. The Mormon Reformation of 1856-1857: The Rhetoric and the Reality. 15 Journal of Mormon History 59-87 . In 1855, a drought struck the flourishing territory. Very little rain fell, and even the dependable mountain streams ran very low. An infestation of grasshoppers and crickets destroyed whatever crops the Mormons had managed to salvage. During the winter of 1855-56, flour and other basic necessities were very scarce and very costly. ": null
    },
    {
        "Heber C. Kimball": "Heber C. Kimball"
    },
    {
        " wrote his son, Dollars and cents do not count now, in these times, for they are the tightest that I have ever seen in the territory of Utah.     In September 1856, as the drought continued, the trials and difficulties of the previous year led to an explosion of intense soul searching. ": null
    },
    {
        "Jedediah M. Grant": "Jedediah M. Grant"
    },
    {
        ", a counselor in the First Presidency and a well-known conservative voice in the extended community, preached three days of fiery sermons to the people of ": null
    },
    {
        "Kaysville, Utah": "Kaysville, Utah"
    },
    {
        " territory. He called for repentance and a general recommitment to moral living and religious teachings. 500 people presented themselves for rebaptism   a symbol of their determination to reform their lives. The zealous message spread from Kaysville to surrounding Mormon communities. Church leaders traveled around the territory, expressing their concern about signs of spiritual decay and calling for repentance. Members were asked to seal their rededication with rebaptism.     Several sermons ": null
    },
    {
        "Willard Richards": "Willard Richards"
    },
    {
        " and ": null
    },
    {
        "George A. Smith": "George A. Smith"
    },
    {
        " had given earlier in the history of the church had touched on the concept of ": null
    },
    {
        "blood atonement": "Blood Atonement"
    },
    {
        ", suggesting that ": null
    },
    {
        "apostates": "Apostate"
    },
    {
        " could become so enveloped in sin that the voluntary shedding of their own blood might increase their chances of eternal salvation. On 21 September 1856, while calling for sincere repentance, Brigham Young took the idea further, and stated:     I know that there are transgressors, who, if they knew themselves and the only condition upon which they can obtain forgiveness, would beg of their brethren to shed their blood, that the smoke might ascend to God as an offering to appease the wrath that is kindled against them, and that the law might have its course. Journal of Discourses 4:43.     This belief became part of the public image of the church at the time and was pilloried in Eastern newspapers along with the practice of polygamy. The concept was frequently criticized by many Mormons and eventually repudiated as official church doctrine by the LDS Church in 1978. However, modern critics of the church and popular writers often attribute a formal doctrine of blood atonement to the Church.     Throughout the winter special meetings were held and Mormons urged to adhere to the commandments of God and the practices and precepts of the church. Preaching placed emphasis on the practice of ": null
    },
    {
        "plural marriage": "Plural Marriage"
    },
    {
        ", adherence to the ": null
    },
    {
        "Word of Wisdom": "Word Of Wisdom"
    },
    {
        ", attendance at church meetings, and personal prayer. On December 30, 1856, the entire all-Mormon territorial legislature was rebaptized for the remission of their sins, and confirmed under the hands of the Twelve Apostles. As time went on, however, the sermons became excessive and intolerant, and some verged on the hysterical.       In 1857-1858, the church was involved in an armed conflict with the U.S. government, entitled the ": null
    },
    {
        "Utah War": "Utah War"
    },
    {
        ". The settlers and the United States government battled for ": null
    },
    {
        "hegemony": "Hegemony"
    },
    {
        " over the culture and government of the territory. Tensions over the Utah War, the murder of Mormon apostle Parley P. Pratt in Arkansas, and threats of violence from the Baker-Fancher wagon train , resulted in rogue Mormon settlers in southern Utah massacring a wagon train from Arkansas, known as ": null
    },
    {
        "Mountain Meadows massacre": "Mountain Meadows Massacre"
    },
    {
        ". The result of the Utah War was the succeeding of the governorship of the Utah territory from Brigham Young to ": null
    },
    {
        "Alfred Cumming": "Alfred Cumming"
    },
    {
        ", an outsider appointed by President ": null
    },
    {
        "James Buchanan": "James Buchanan"
    },
    {
        ".       The church had attempted unsuccessfully to institute the ": null
    },
    {
        "United Order": "United Order"
    },
    {
        " numerous times, most recently during the ": null
    },
    {
        "Mormon Reformation": "Mormon Reformation"
    },
    {
        ". In 1874, Young once again attempted to establish a permanent Order, which he now called the United Order of Enoch in at least 200 Mormon communities, beginning in ": null
    },
    {
        "St. George, Utah": "St. George, Utah"
    },
    {
        " on February 9, 1874.   In Youngs Order, producers would generally deed their property to the Order, and all members of the order would share the cooperatives net income, often divided into shares according to how much property was originally contributed. Sometimes, the members of the Order would receive wages for their work on the communal property. Like the United Order established by Joseph Smith, Youngs Order was short-lived. By the time of Brigham Youngs death in 1877, most of these United Orders had failed. By the end of the 19th century, the Orders were essentially extinct.     Brigham Young died in August 1877. After the death of Brigham Young, the First Presidency was not reorganized until 1880, when Young was succeeded by President ": null
    },
    {
        "John Taylor": "John Taylor"
    },
    {
        ", who in the interim had served as ": null
    },
    {
        "President of the Quorum of the Twelve Apostles": "President Of The Quorum Of The Twelve Apostles"
    },
    {
        ".            For several decades, polygamy was preached as ": null
    },
    {
        "Gods": "God"
    },
    {
        " law. Brigham Young, the Prophet of the church at that time, had quite a few wives, as did many other church leaders. This early practice of polygamy caused conflict between church members and the wider American society. In 1854 the Republican party referred in its platform to polygamy and ": null
    },
    {
        "slavery": "Slavery"
    },
    {
        " as the twin relics of barbarism. In 1862, the U.S. Congress enacted the ": null
    },
    {
        "Morrill Anti-Bigamy Act": "Morrill Anti-Bigamy Act"
    },
    {
        ", signed by ": null
    },
    {
        "Abraham Lincoln": "Abraham Lincoln"
    },
    {
        ", which made bigamy a felony in the territories punishable by $500 or five years in prison. The law also permitted the confiscation of church property Late Corporation of the Church of Jesus Christ of Latter-day Saints v. United States, 136 U.S. 1 without compensation. This law was not enforced however, by the Lincoln administration or by Mormon-controlled territorial probate courts. Moreover, as Mormon polygamist marriages were performed in secret, it was difficult to prove when a polygamist marriage had taken place. In the meantime, Congress was preoccupied with the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        ".     In 1874, after the war, Congress passed the ": null
    },
    {
        "Poland Act": "Poland Act"
    },
    {
        ", which transferred jurisdiction over Morrill Act cases to federal prosecutors and courts, which were not controlled by Mormons. In addition, the Morrill Act was upheld in 1878 by the ": null
    },
    {
        "United States Supreme Court": "Supreme Court Of The United States"
    },
    {
        " in the case of  Reynolds v. United States . After Reynolds, Congress became even more aggressive against polygamy, and passed the ": null
    },
    {
        "Edmunds Act": "Edmunds Act"
    },
    {
        " in 1882. The Edmunds Act prohibited not just bigamy, which remained a felony, but also bigamous cohabitation, which was prosecuted as a misdemeanor, and did not require proof an actual marriage ceremony had taken place. The Act also vacated the Utah territorial government, created an independent committee to oversee elections to prevent Mormon influence, and disenfranchised any former or present polygamist. Further, the law allowed the government to deny civil rights to polygamists without a trial.     In 1887, Congress passed the ": null
    },
    {
        "Edmunds-Tucker Act": "Edmunds-Tucker Act"
    },
    {
        ", which allowed prosecutors to force plural wives to testify against their husbands, abolished the right of women to vote, disincorporated the church, and confiscated the churchs property. By this time, many church leaders had gone into hiding to avoid prosecution, and half the Utah prison population was composed of polygamists.     Church leadership officially ended the practice in 1890, based on a revelation to ": null
    },
    {
        "Wilford Woodruff": "Wilford Woodruff"
    },
    {
        " called the ": null
    },
    {
        "1890 Manifesto": "1890 Manifesto"
    },
    {
        ".          The churchs modern era began soon after it renounced polygamy in 1890. Prior to the ": null
    },
    {
        "1890 Manifesto": "1890 Manifesto"
    },
    {
        ", church leaders had been in hiding, many ecclesiastical matters had been neglected,    and the church organization itself had been disincorporated. With the reduction in federal pressure afforded by the Manifesto, however, the church began to re-establish its institutions.       The ": null
    },
    {
        "1890 Manifesto": "1890 Manifesto"
    },
    {
        " did not, itself, eliminate the practice of new plural marriages, as they continued to occur clandestinely, mostly with church approval and authority.  . In addition, most Mormon polygamists and every polygamous general authority continued to co-habit with their polygamous wives. Quinn at 51. Mormon leaders, including Woodruff, maintained that the Manifesto was a temporary expediency designed to enable Utah to obtain statehood, and that at some future date, the practice would soon resume. Lyman, 1998, p. 39-40. Nevertheless, the 1890 Manifesto provided the church breathing room to obtain Utahs statehood, which it received in 1896 after a campaign to convince the American public that Mormon leaders had abandoned polygamy and intended to stay out of politics. Lyman, 1998, p. 41.     Despite being admitted to the United States, Utah was initially unsuccessful in having its elected representatives and senators seated in the United States Congress. In 1898, Utah elected ": null
    },
    {
        "general authority": "General Authority"
    },
    {
        " B.H. Roberts": "B.H. Roberts"
    },
    {
        " to the ": null
    },
    {
        "United States House of Representatives": "United States House Of Representatives"
    },
    {
        " as a Democrat. Roberts, however, was denied a seat there because he was practicing polygamy. In 1903, the Utah legislature selected ": null
    },
    {
        "Reed Smoot": "Reed Smoot"
    },
    {
        ", also an LDS general authority but also a monogamist, as its first senator. From 1904 to 1907, the ": null
    },
    {
        "United States Senate": "United States Senate"
    },
    {
        " conducted a ": null
    },
    {
        "series of Congressional hearings": "Reed Smoot Hearings"
    },
    {
        " on whether Smoot should be seated. Eventually, the Senate granted Smoot a seat and allowed him to vote. However, the hearings raised controversy as to whether polygamy had actually been abandoned as claimed in the 1890 Manifesto, and whether the LDS Church continued to exercise influence on Utah politics. In response to these hearings, President of the Church ": null
    },
    {
        "Joseph F. Smith": "Joseph F. Smith"
    },
    {
        " issued a ": null
    },
    {
        "Second Manifesto": "Second Manifesto"
    },
    {
        " denying that any post-Manifesto marriages had the churchs sanction, Later scholars, however, have determined that 90% of polygamous marriages between 1890 and 1904 were, in fact, conducted under church authority. See Quinn at 56. and announcing that those entering such marriages in the future would be ": null
    },
    {
        "excommunicated": "Excommunication"
    },
    {
        ".     The Second Manifesto did not annul existing plural marriages within the church, and the church tolerated some degree of polygamy into at least the 1930s. However, eventually the church adopted a policy of excommunicating its members found practicing polygamy and today seeks to actively distance itself from ": null
    },
    {
        "Mormon fundamentalist": "Mormon Fundamentalism"
    },
    {
        " groups still practicing polygamy. In 1998 President Gordon B. Hinckley stated,   If any of our members are found to be practicing plural marriage, they are excommunicated, the most serious penalty the Church can impose. Not only are those so involved in direct violation of the civil law, they are in violation of the law of this Church. Gordon B. Hinckley, ,  Ensign , November 1998, p. 70.   In modern times, members of the Mormon religion do not practice polygamy. However, if a Mormon man becomes widowed, he can be sealed to another woman while remaining sealed to his first wife. However, if a woman becomes widowed, she will not be allowed to be sealed to another man. She can be married by law, but not sealed in the temple.                In 1870, the ": null
    },
    {
        "Utah Territory": "Utah Territory"
    },
    {
        " had become one of the first polities to grant women the right to vote—a right which the U.S. Congress revoked in 1887 as part of the ": null
    },
    {
        "Edmunds-Tucker Act": "Edmunds-Tucker Act"
    },
    {
        ".     As a result, a number of LDS women became active and vocal proponents of womens rights. Of particular note was the LDS journalist and suffragist ": null
    },
    {
        "Emmeline Blanch Wells": "Emmeline B. Wells"
    },
    {
        ", editor of the  Womans Exponent , a Utah feminist newspaper. Wells, who was both a ": null
    },
    {
        "feminist": "Feminism"
    },
    {
        " and a polygamist, wrote vocally in favor of a womans role in the political process and public discourse. National suffrage leaders, however, were somewhat perplexed by the seeming paradox between Utahs progressive stand on womens rights, and the churchs stand on polygamy.     In 1890, after the church officially renounced polygamy, U.S. suffrage leaders began to embrace Utahs feminism more directly, and in 1891, Utah hosted the Rocky Mountain Suffrage Conference in Salt Lake City, attended by such national feminist leaders as ": null
    },
    {
        "Susan B. Anthony": "Susan B. Anthony"
    },
    {
        " and ": null
    },
    {
        "Anna Howard Shaw": "Anna Howard Shaw"
    },
    {
        ". The Utah Woman Suffrage Association, which had been formed in 1889 as a branch of the American Woman Suffrage Association , was then successful in demanding that the constitution of the nascent state of Utah should enfranchise women. In 1896, Utah became the third state in the U.S. to grant women the right to vote.       The LDS church was actively involved in support of the ": null
    },
    {
        "temperance movement": "Temperance Movement In The United States"
    },
    {
        " in the 19th century, and then the ": null
    },
    {
        "prohibition": "Prohibition"
    },
    {
        " movement in the early 20th century.           Mormonism has had a mixed relationship with socialism in its various forms. In the earliest days of Mormonism, Joseph Smith had established a form of Christian ": null
    },
    {
        "communalism": "Communalism"
    },
    {
        ", an idea made popular during the ": null
    },
    {
        "Second Great Awakening": "Second Great Awakening"
    },
    {
        ", combined with a move toward ": null
    },
    {
        "theocracy": "Theocracy"
    },
    {
        ". Mormons referred to this form of theocratic communalism as the ": null
    },
    {
        "United Order": "United Order"
    },
    {
        ", or the ": null
    },
    {
        "law of consecration": "Law Of Consecration"
    },
    {
        ". While short-lived during the life of Joseph Smith, the United Order was re-established for a time in several communities of Utah during the theocratic political leadership of Brigham Young. Some aspects of secular socialism also found place in the political views of Joseph Smith, who ran for President of the United States on a platform which included a nationalized bank that he believed would do away with much of the abuses of private banks. As secular political leader of Nauvoo, Joseph Smith also set aside collective farms which insured that the propertyless poor could maintain a living and provide for themselves and their families. Once in Utah, under the direction of Brigham Young, the Church leadership would also promote collective ownership of industry and issued a circular in 1876 which warned that The experience of mankind has shown that the people of communities and nations among whom wealth is the most equally distributed, enjoy the largest degree of liberty, are the least exposed to tyranny and oppression and suffer the least from luxurious habits which beget vice . The circular, signed and endorsed by the Quorum of the Twelve and the First Presidency went on to warn that if measures not taken to prevent the continued enormous growth of riches among the class already rich, and the painful increase of destitution and want among the poor, the nation is likely to be overtaken by disaster; for, according to history, such a tendency among nations once powerful was the sure precursor of ruin .      In addition to religious socialism, many Mormons in Utah were receptive to the secular socialist movement that began in America during the 1890s. During the 1890s to the 1920s, the Utah Social Democratic Party, which became part of the ": null
    },
    {
        "Socialist Party of America": "Socialist Party Of America"
    },
    {
        " in 1901, elected about 100 socialists to state offices in Utah. An estimated 40% of Utah Socialists were Mormon. Many early socialists visited the Churchs cooperative communities in Utah with great interest and were well received by the Church leadership. Prominent early socialists such as ": null
    },
    {
        "Albert Brisbane": "Albert Brisbane"
    },
    {
        ", ": null
    },
    {
        "Victor Prosper Considerant": "Victor Prosper Considerant"
    },
    {
        ", ": null
    },
    {
        "Plotino Rhodakanaty": "Plotino Rhodakanaty"
    },
    {
        ", ": null
    },
    {
        "Edward Bellamy": "Edward Bellamy"
    },
    {
        ", and Ruth & Reginald Wright Kauffman showed great interest in the successful cooperative communities of the Church in Utah. For example, while doing research for what would become a best selling socialist novel,  Looking Backward , Edward Bellamy toured the Churchs cooperative communities in Utah and visited with ": null
    },
    {
        "Lorenzo Snow": "Lorenzo Snow"
    },
    {
        " for a week.  Ruth & Reginald Wright Kauffman also wrote a book, though this one non-fiction, after visiting the Church in Utah. Their book was titled  The Latter Day Saints: A Study of the Mormons in the Light of Economic Conditions , which discussed the Church from a Marxist perspective. ": null
    },
    {
        "Plotino Rhodakanaty": "Plotino Rhodakanaty"
    },
    {
        " was also drawn to Mormonism and became the first Elder of the Church in Mexico after being baptized when a group of missionaries which included ": null
    },
    {
        "Moses Thatcher": "Moses Thatcher"
    },
    {
        " came to Mexico. Moses Thatcher kept in touch with Plotino Rhodakanaty for years following and was himself perhaps the most prominent member of the Church to have openly identified himself as a socialist supporter.     Albert Brisbane and Victor Prosper Considerant also visited the Church in Utah during its early years, prompting Considerant to note that thanks to a certain dose of socialist solidarity, the Mormons have in a few years attained a state of unbelievable prosperity .  Attributing the peculiar socialist attitudes of the early Mormons with their success in the desert of the western United States was common even among those who were not themselves socialist. For instance, in his book History of Utah, 1540-1886, ": null
    },
    {
        "Hubert Howe Bancroft": "Hubert Howe Bancroft"
    },
    {
        " points out that the Mormons while not communists, the elements of socialism enter strongly into all their relations, public and private, social, commercial, and industrial, as well as religious and political. This tends to render them exclusive, independent of the gentiles and their government, and even in some respects antagonistic to them. They have assisted each other until nine out of ten own their farms, while commerce and manufacturing are to large extent cooperative. The rights of property are respected; but while a Mormon may sell his farm to a gentile, it would not be deemed good fellowship for him to do so.      While religious and secular socialism gained some acceptance among Mormons, the church was more circumspect about ": null
    },
    {
        "Marxist": "Marxism"
    },
    {
        " Communism, because of its acceptance of violence as a means to achieve revolution. From the time of Joseph Smith, the church had taken a favorable view as to the ": null
    },
    {
        "American Revolution": "American Revolution"
    },
    {
        " and the necessity at times to violently overthrow the government, however the church viewed the revolutionary nature of ": null
    },
    {
        "Leninist": "Leninism"
    },
    {
        " Communism": "Communism"
    },
    {
        " as a threat to the ": null
    },
    {
        "United States Constitution": "United States Constitution"
    },
    {
        ", which the church saw as divinely inspired to ensure the agency of man . In 1936, the ": null
    },
    {
        "First Presidency": "First Presidency"
    },
    {
        " issued a statement stating:          In later years, such leaders as ": null
    },
    {
        "Ezra Taft Benson": "Ezra Taft Benson"
    },
    {
        " would take a stronger anti-Communist position publicly, his anti-Communism often being anti-leftist in general. However, Bensons views often brought embarrassment to the Church leadership, and when Benson was sent to Europe on a mission for the Church, many believed this was a way of getting Benson out of the US where his right-wing views were a point of embarrassment for the church. While publicly claiming that this was not the reason for Bensons call to Europe, then President ": null
    },
    {
        "Joseph Fielding Smith": "Joseph Fielding Smith"
    },
    {
        " wrote a letter to Congressman ": null
    },
    {
        "Ralph Harding": "Ralph Harding"
    },
    {
        " stating that It would be better for him and for the Church and all concerned, if he would settle down to his present duties and let all political matters take their course. He is going to take a mission to Europe in the near future and by the time he returns I hope he will get all the political notions out of his system. In another letter written in response to questions about how long Benson would be on his mission to Europe from U.S. Under-Secretary of State ": null
    },
    {
        "Averell Harriman": "Averell Harriman"
    },
    {
        ", First Counselor ": null
    },
    {
        "Hugh B. Brown": "Hugh B. Brown"
    },
    {
        " responded: If I had my way, hell never come back! .  Later, Benson would become the President of the Church and backed off of his political rhetoric. Toward the end of his presidency, the Church even began to discipline Church members who had taken Bensons earlier hardline right-wing speeches too much to heart, some of whom claimed that the Church had excommunicated them for adhering too closely to Bensons right-wing ideology.            In the 1890s soon after the ": null
    },
    {
        "1890 Manifesto": "1890 Manifesto"
    },
    {
        ", the LDS Church was in a dire financial condition. It was recovering from the U.S. crackdown on polygamy, and had difficulty reclaiming property that had been confiscated during polygamy raids. Meanwhile, there was a ": null
    },
    {
        "national recession beginning in 1893": "Panic Of 1893"
    },
    {
        ". By the late 1890s, the church was about $2 million in debt, and near bankruptcy.  In response, ": null
    },
    {
        "Lorenzo Snow": "Lorenzo Snow"
    },
    {
        ", then President of the Church, conducted a campaign to raise the payment of ": null
    },
    {
        "tithing": "Tithing"
    },
    {
        ", of which less than 20% of LDS had been paying during the 1890s. Bell, 1994, p. 52. After a visit to ": null
    },
    {
        "Saint George, Utah": "Saint George, Utah"
    },
    {
        ", which had a much higher-than-average percentage of full 10% tithe-payers, Bell, 1994, p. 63. Snow felt that he had received a ": null
    },
    {
        "revelation": "Revelation"
    },
    {
        ". Bell, 1994, p. 65. This prompted him to promise adherents in various Utah settlements that if they paid their tithing, they would experience an outpouring of blessings, prosperity, the preparation for ": null
    },
    {
        "Zion": "Zion"
    },
    {
        ", and protection of the LDS Church from its enemies; however, failure to pay tithing would result in the people being scattered. Bell, 1994, p. 67. As a result of Snows vigorous campaign, tithing payment increased dramatically from 18.4% in 1898 to an eventual peak of 59.3% in 1910. Bell, 1994, p. 82. Eventually, payment of tithing would become a requirement for temple worship within the faith.     Constructing administration buildings   ": null
    },
    {
        "Zions Securities": "Zions Securities"
    },
    {
        " Corporation   Corporation of the President   Changes in stipends for bishops and general authorities.       ": null
    },
    {
        "Church Educational System": "Church Educational System"
    },
    {
        ".   Building of seminaries on church property adjacent to public high schools .   Establishment of a General Board of Education   Institutes of religion       Church welfare systems:   Relief Societys Social Services department   Church Security Program   Welfare Program , including ": null
    },
    {
        "Welfare Square": "Welfare Square"
    },
    {
        " See Quinn, Mormon Hierarchy: Extensions of Power.       In 1982, the ": null
    },
    {
        "First Presidency": "First Presidency"
    },
    {
        " announced that the length of service of male full-time ": null
    },
    {
        "missionaries": "Missionary"
    },
    {
        " would be reduced to 18 months. In 1984, a little more than two years later, it was announced that the length of service would be returned to its original length of 24 months.       The change was publicized as a way to increase the ability for missionaries to serve. At the time, missionaries paid for all their expenses in their country of service. The recession during the Carter presidency pushed inflation higher and the exchange rate lower. This sudden increase in costs together with already high costs of living in Europe and other industrialized nations resulted in a steady decline in the number of missionaries able to pay for two full years of service. The shortening of the required service time from 24 to 18 months cut off this decline in numbers, leveling out in the period following the reinstatement. For those in foreign missions, this was barely enough time to learn a more difficult language and difficulty with language was reported.     Nevertheless, the shortened period of time also affected numbers of conversions: they declined by 7% annually during the same period. Some also saw the shortening as a weakening of faithfulness among those who were eventually called as missionaries, less length meaning less commitment required in terms of faith. However, it has also been seen as a recognition by the leadership of changes within the LDS cultural climate.     Record economic growth starting in the mid-1980s mostly erased the problem of finances preventing service. As a secondary measure, starting in 1990, paying for a mission became easier on those called to work in industrialized nations. Missionaries began paying into a church-wide general missionary fund instead of paying on their own. This amount paid is used by the church to pay for the costs of all missionaries, wherever they go. This enabled those going to Bolivia, whose average cost of living is about $100 per month, to help pay for those going to Japan, whose cost tops out at around $900 per month.       ": null
    },
    {
        "Priesthood Correlation Program": "Priesthood Correlation Program"
    },
    {
        "YMMIA": "Ymmia"
    },
    {
        ", ": null
    },
    {
        "YLMIA": "Ylmia"
    },
    {
        ", ": null
    },
    {
        "Relief Society": "Relief Society"
    },
    {
        ", ": null
    },
    {
        "Primary": "Primary Association"
    },
    {
        ", and ": null
    },
    {
        "Sunday School": "Sunday School"
    },
    {
        " magazines.   Adoption of the ": null
    },
    {
        "Scouting": "Boy Scouts Of America"
    },
    {
        " program   Priesthood Committee on Outlines established for publishing lesson materials for each priesthood quorum   ": null
    },
    {
        "Melchizedek Priesthood": "Melchizedek Priesthood"
    },
    {
        " handbook   Priesthood-Auxiliary movement : re-emphasized the church hierarchy around Priesthood, and re-emphasized other church organizations as priesthood auxiliaries with reduced autonomy.     Other:   Elimination of Presiding Patriarch office   Emeritus status of general authorities who are too old or ill   Reorganizing the quorums of seventy   Dismantling ward and stake prayer circles       As the church began to collide and meld with cultures outside of Utah and the United States, the church began to jettison some of the parochialisms and prejudices that had become part of Latter-day Saint culture, but were not essential to Mormonism. In 1971, LDS General Authority and scholar ": null
    },
    {
        "Bruce R. McConkie": "Bruce R. Mcconkie"
    },
    {
        " drew parallels between the LDS Church and the New Testament church, who had difficulty embracing the ": null
    },
    {
        "Gentiles": "Gentiles"
    },
    {
        " within Christianity, and encouraged members not to be so indoctrinated with social customs that they fail to engage other cultures in Mormonism. Other peoples, he stated, have a different background than we have, which is of no moment to the Lord. ... It is no different to have different social customs than it is to have different languages. ... And the Lord knows all languages . In 1987, ": null
    },
    {
        "Boyd K. Packer": "Boyd K. Packer"
    },
    {
        ", another Latter-day Saint ": null
    },
    {
        "Apostle": "Apostle"
    },
    {
        ", stated, We cant move with a 1947 Utah Church! Could it be that we are not prepared to take the gospel because we are not prepared to take all of the things we have wrapped up with it as extra baggage? 21 ": null
    },
    {
        "Dialogue: A Journal of Mormon Thought": "Dialogue: A Journal Of Mormon Thought"
    },
    {
        " 97 During and after the ": null
    },
    {
        "civil rights movement": "Civil Rights Movement"
    },
    {
        ", the church faced a critical point in its history, where its previous attitudes toward other cultures and people of color, which had once been shared by much of the white American mainstream, began to appear racist and neocolonial. The church came under intense fire for its stances on blacks and Native Americans issues.            The cause of some of the churchs most damaging publicity had to do with the churchs policy of discrimination toward blacks. Blacks were always officially welcome in the church, and Joseph Smith established an early precedent of ordained black males to the ": null
    },
    {
        "Priesthood": "Priesthood"
    },
    {
        ". Smith was also anti-slavery, going so far as to run on an anti-slavery platform as candidate for the presidency of the United States. At times, however, Smith had shown sympathy toward a belief common in his day that blacks were the cursed descendants of ": null
    },
    {
        "Cain": "Cain"
    },
    {
        ". In 1849, church doctrine taught that though blacks could be baptized, they and others could not be ordained to the Priesthood or enter ": null
    },
    {
        "LDS temples": "Temple"
    },
    {
        ". Journal histories and public teachings of the time reflect that Young and others stated that God would some day reverse this policy of discrimination. It is also important to note that while blacks as a whole were specifically withheld from priesthood blessings , other races and genealogical lineages were also prohibited from holding the priesthood.     By the late 1960s, the Church had expanded into ": null
    },
    {
        "Brazil": "Brazil"
    },
    {
        ", the ": null
    },
    {
        "Caribbean": "Caribbean"
    },
    {
        ", and the nations of ": null
    },
    {
        "Africa": "Africa"
    },
    {
        ", and was suffering criticism for its policy of racial discrimination. In the case of Africa and the Caribbean, the church had not yet begun large-scale missionary efforts in most areas. There were large groups in both Ghana and Nigeria who desired to join the church and many faithful members of African descent in Brazil. On June 9, 1978, under the administration of ": null
    },
    {
        "Spencer W. Kimball": "Spencer W. Kimball"
    },
    {
        ", the church leadership finally received sanction to change the long-standing policy. ": null
    },
    {
        "Doctrine and Covenants": "Doctrine And Covenants"
    },
    {
        ", OD-2     Today, there are many black members of the church, and many predominantly black congregations. In the Salt Lake City area black members have organized branches of an official church auxiliary called the ": null
    },
    {
        "Genesis Groups": "Genesis Group"
    },
    {
        ".          During the post-": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " period, the church also began to focus on expansion into a number of ": null
    },
    {
        "Native American": "Native Americans In The United States"
    },
    {
        " cultures, as well as Oceanic cultures, which many Mormons considered to be the same ethnicity. These peoples were called Lamanites , because they were all believed to descend from the ": null
    },
    {
        "Lamanite": "Lamanite"
    },
    {
        " group in the  Book of Mormon . In 1947, the church began the ": null
    },
    {
        "Indian Placement Program": "Indian Placement Program"
    },
    {
        ", where Native American students were voluntarily placed in white Latter-day Saint foster homes during the school year, where they would attend public schools and become assimilated into Mormon culture.     In 1955, the church began ordaining black ": null
    },
    {
        "Melanesia": "Melanesia"
    },
    {
        "ns to the ": null
    },
    {
        "Priesthood": "Priesthood"
    },
    {
        ".     The churchs policy toward Native Americans also came under fire during the 1970s. In particular the Indian Placement Program was criticized as ": null
    },
    {
        "neocolonial": "Neocolonialism"
    },
    {
        ". In 1977, the U.S. government commissioned a study to investigate accusations that the church was using its influence to push children into joining the program. However, the commission rejected these accusations and found that the program was beneficial in many cases, and provided well-balanced American education for thousands, allowing the children to return to their cultures and customs. One issue was that the time away from family caused the assimilation of Native American students into American culture, rather than allowing the children to learn within, and preserve, their own culture. By the late 1980s, the program had been in decline, and in 1996, it was discontinued. In 2016, three lawsuits against the LDS Church were filed in the Navajo Nation District Court, alleging that participants in the program were sexually abused in their foster homes.  The Church has asked for the lawsuits to be dismissed on jurisdictional grounds, arguing that the alleged abuse took place outside the reservation.     In 1981, the church published a new LDS edition of the ": null
    },
    {
        "Standard Works": "Standard Works"
    },
    {
        " that changed a passage in The Book of Mormon that Lamanites will become white and delightsome after accepting the gospel of Jesus Christ. Instead of continuing the original reference to skin color, the new edition replaced the word white with the word pure , emphasizing inward spirituality.       ": null
    },
    {
        "Good Neighbor policy ": "Good Neighbor Policy"
    },
    {
        " and temple ordinance reforms.       Beginning soon after the turn of the 20th century, four influential Latter-day Saint scholars began to systematize, modernize, and codify Mormon doctrine: ": null
    },
    {
        "B. H. Roberts": "B. H. Roberts"
    },
    {
        ", ": null
    },
    {
        "James E. Talmage": "James E. Talmage"
    },
    {
        ", ": null
    },
    {
        "John A. Widtsoe": "John A. Widtsoe"
    },
    {
        ", and ": null
    },
    {
        "Joseph Fielding Smith": "Joseph Fielding Smith"
    },
    {
        ".     In 1921, the church called chemistry professor John A. Widtsoe as an apostle. Widtsoes writings, particularly Rational theology and Joseph Smith as Scientist, reflected the optimistic faith in science and technology that was pervasive at the time in American life. According to Widtsoe, all Mormon theology could be reconciled within a rational, positivist framework.          The issue of evolution has been a point of controversy for some members of the church. The first ": null
    },
    {
        "official statement on the issue of evolution": "1909 Statement On The Origin Of The Earth And Man"
    },
    {
        " was in 1909, which marked the centennial of ": null
    },
    {
        "Charles Darwins": "Charles Darwin"
    },
    {
        " birth and the 50th anniversary of his masterwork,  On the Origin of Species . On that year, the ": null
    },
    {
        "First Presidency": "First Presidency"
    },
    {
        " led by ": null
    },
    {
        "Joseph F. Smith": "Joseph F. Smith"
    },
    {
        " as President, issued a statement reinforcing the predominant religious view of ": null
    },
    {
        "creationism": "Creationism"
    },
    {
        ", and calling human evolution one of the theories of men , but falling short of declaring evolution untrue or evil. It is held by some , they said, that Adam was not the first man upon the earth, and that the original human was a development from lower orders of the animal creation. These, however, are the theories of men. Notably, the church did not opine on the evolution of animals other than humans, nor did it endorse a particular theory of creationism.     Soon after the 1909 statement, Joseph F. Smith professed in an editorial that the church itself has no philosophy about the modus operandi employed by the Lord in His creation of the world.  Juvenile Instructor , 46 , 208-209 .     Some also cite an additional editorial that enumerates various possibilities for creation including the idea that Adam and Eve:   evolved in natural processes to present perfection ,   were transplanted from another sphere , or   were born here ... as other mortals have been. .   Proponents of evolution attribute this 1910 editorial to Joseph F. Smith and have sometimes identified it under the title First Presidency Instructions to the Priesthood: Origin of Man.  However, others have cast doubt on Joseph F. Smiths authorship of the editorial, which was published without attribution and seems to have contradicted contemporary views published elsewhere by Joseph F. Smith himself. , at blogspot.com They also contend that there is little evidence that the editorial represents First Presidency Instructions as the title under which it is often cited indicates.     In 1925, as a result of publicity from the ": null
    },
    {
        " Scopes Monkey Trial ": "Scopes Trial"
    },
    {
        " concerning the right to teach evolution in ": null
    },
    {
        "Tennessee": "Tennessee"
    },
    {
        " public schools, the First Presidency reiterated its 1909 stance, stating that The Church of Jesus Christ of Latter-day Saints, basing its belief on divine revelation, ancient and modern, declares man to be the direct and lineal offspring of Deity. ... . Man is the child of God, formed in the divine image and endowed with divine attributes.     In the early 1930s there was an intense debate between liberal theologian and general authority B. H. Roberts and some members of the ": null
    },
    {
        "Council of the Twelve Apostles": "Council Of The Twelve Apostles"
    },
    {
        " over attempts by B. H. Roberts to reconcile the fossil record with the scriptures by introducing a doctrine of pre-Adamic creation, and backing up this speculative doctrine using geology, biology, anthropology, and archeology . More conservative members of the Twelve Apostles, including Joseph Fielding Smith, rejected his speculation because it contradicted the idea that there was no death until after the fall of Adam. Scriptural references in the Book of Mormon such as 2 Nephi 2:22, Alma 12:23, and Doctrine and Covenants sec. 77:5-7 have been cited as teaching the doctrine that there was no death on the Earth before the Fall of Adam and Eve, and that the Earths temporal existence consists of a total of seven thousand years . Some maintain that those scriptural references pertain to a spiritual death, although others disagree. It is clear, however, that the LDS church does not conform to the same young-Earth creationist creed as many other faiths. The church has made it quite clear that the six days of creation are not necessarily six 24-hour periods. Brigham Young definitely addressed the issue , and even the very anti-evolution ": null
    },
    {
        "Bruce R. McConkie": "Bruce R. Mcconkie"
    },
    {
        " taught that a day, in the Creation accounts, is a specified time period; it is an age, an eon, a division of eternity; it is the time between two identifiable events. And each day, of whatever length, has the duration needed for its purposes. ... There is no revealed recitation specifying that each of the six days involved in the Creation was of the same duration . Bruce R. McConkie, ,  Ensign , June 1982, p. 11. ": null
    },
    {
        "James E. Talmage": "James E. Talmage"
    },
    {
        " published a book through the LDS Church that explicitly stated that organisms lived and died on this earth before the earth was fit for human habitation. Talmage, James E.  However, the official Church Educational System Student Manual teaches that there was no death before the Fall.   The debate between different LDS leaders in 1931 prompted the First Presidency, then led by ": null
    },
    {
        "Heber J. Grant": "Heber J. Grant"
    },
    {
        " as President, to conclude:          The debate over ": null
    },
    {
        "pre-Adamites": "Pre-Adamite"
    },
    {
        " has been interpreted by LDS proponents of evolution as a debate about organic evolution. This view, based on the belief that a dichotomy of thought on the subject of evolution existed between B. H. Roberts and Joseph Fielding Smith, has become common among pro-evolution members of the church. As a result, the ensuing 1931 statement has been interpreted by some as official permission for members to believe in organic evolution. However, there is no evidence that the debate included the topic of evolution, and historically there was no strong disagreement between Joseph Fielding Smith and B. H. Roberts concerning evolution; they both rejected it, although to different degrees. B. H. Roberts wrote that the hypothesis of organic evolution was destructive of the grand, central truth of all revelation, .     Later, ": null
    },
    {
        "Joseph Fielding Smith": "Joseph Fielding Smith"
    },
    {
        " published his book Man: His Origin and Destiny, which denounced evolution without qualification. Similar statements of denunciation were made by ": null
    },
    {
        "Bruce R. McConkie": "Bruce R. Mcconkie"
    },
    {
        ", who as late as 1980 denounced evolution as one of the seven deadly heresies , and stated: There are those who say that revealed religion and organic evolution can be harmonized. This is both false and devilish. Evolution was also denounced by the conservative ": null
    },
    {
        "Ezra Taft Benson": "Ezra Taft Benson"
    },
    {
        ", who as an Apostle called on members to use the Book of Mormon to combat evolution and several times denounced evolution as a falsehood on a par with ": null
    },
    {
        "socialism": "Socialism"
    },
    {
        ", ": null
    },
    {
        "rationalism": "Rationalism"
    },
    {
        ", and ": null
    },
    {
        "humanism": "Humanism"
    },
    {
        ". .     A dichotomy of opinion exists among some church members today. Largely influenced by Smith, McConkie, and Benson, evolution is rejected by a large number of conservative church members.   A minority accept evolution, supported in part by the debate between B. H. Roberts and Joseph Fielding Smith, in part by a large amount of scientific evidence, and in part by Joseph F. Smiths words that the church itself has no philosophy about the modus operandi employed by the Lord in His creation of the world. Meanwhile, ": null
    },
    {
        "Brigham Young University": "Brigham Young University"
    },
    {
        ", the largest private university owned and operated by the church, not only teaches evolution to its biology majors, but has also done significant research in evolution.   BYU-I, another church-run school, also teaches it; the following link is an article on how evolution and faith are reconciled at BYU-I.   Trent D. Stephens, D. Jeffrey Meldrum, & Forrest B. Peterson,   .              E.T.Bensons views on whether women should work outside the home   ": null
    },
    {
        "The Family: A Proclamation to the World": "The Family: A Proclamation To The World"
    },
    {
        "      Doctrinal position on homosexuality:   Statements about homosexuality by Church leaders   New views on the separation between gay identity and gay conduct   Hinckley: Marriage should not be viewed as a therapeutic step to solve problems such as homosexual inclinations or practices, which first should clearly be overcome with a firm and fixed determination never to slip to such practices again.     Connections with the gay and ex-gay groups:   Leaders have met with people from ": null
    },
    {
        "Evergreen International, Inc.": "Evergreen International, Inc."
    },
    {
        " and several gay rights leaders.      The churchs political involvement in LGBT issues   The church opposes same-sex marriage, but does not object to rights regarding hospitalization and medical care, fair housing and employment rights, or probate rights, so long as these do not infringe on the integrity of the family or the constitutional rights of churches and their adherents to administer and practice their religion free from government interference.  The church supported a gay rights bill in Salt Lake City which bans discrimination against gay men and lesbians in housing and employment, calling them common-sense rights .       LGBT Mormon support groups   Some Church members have formed a number of unofficial support organizations, including ": null
    },
    {
        "Evergreen International": "Evergreen International"
    },
    {
        ", ": null
    },
    {
        "Affirmation: Gay & Lesbian Mormons": "Affirmation: Gay  &  Lesbian Mormons"
    },
    {
        ", ": null
    },
    {
        "North Star": "North Star"
    },
    {
        ",  Disciples2,  Wildflowers,  ": null
    },
    {
        "Family Fellowship": "Family Fellowship"
    },
    {
        ", GLYA ,  ": null
    },
    {
        "LDS Reconciliation": "Lds Reconciliation"
    },
    {
        ",  ": null
    },
    {
        "Gamofites": "Gamofites"
    },
    {
        " and the Guardrail foundation.           In 1967, a set of papyrus manuscripts were discovered in the ": null
    },
    {
        "Metropolitan Museum of Art": "Metropolitan Museum Of Art"
    },
    {
        " that appear to be the manuscripts from which Joseph Smith claimed to have translated the Book of Abraham in 1835. These manuscripts were presumed lost in the Chicago fire of 1871. Analyzed by Egyptologists, the manuscripts were identified by some as The Book of the Dead , an ancient Egyptian funery text. Moreover, the scholars translations of certain portions of the scrolls disagreed with Smiths translation. This discovery forced many Mormon apologists to moderate the earlier prevailing view that Smiths translations were literal one-to-one translations. As a result of this discovery, some Mormon apologists consider The Book of the Dead to be a starting-point that Smith used to reconstruct the original writings of Abraham through inspiration.     In the early 1980s, the apparent discovery of an early Mormon manuscript, which came to be known as the Salamander Letter , received much publicity. This letter, reportedly discovered by a scholar named Mark Hofmann, alleged that the Book of Mormon was given to Joseph Smith by a being that changed itself into a ": null
    },
    {
        "salamander": "Salamander"
    },
    {
        ", not by an angel as the official Church history recounted. The document was purchased by private collector Steven Christensen, but was still significantly publicized and even printed in the Churchs official magazine, the  Ensign . Some Mormon apologists including ": null
    },
    {
        "Apostle": "Apostle"
    },
    {
        " Dallin H. Oaks": "Dallin H. Oaks"
    },
    {
        " suggested that the letter used the idea of a salamander as a metaphor for an angel. The document, however, was revealed as a forgery in 1985, and Hofmann was arrested for two murders related to his forgeries.     Not all of Hofmanns findings have been deemed fraudulent. A document called the Anthon transcript that allegedly contains ": null
    },
    {
        "reformed Egyptian": "Reformed Egyptian"
    },
    {
        " characters from the Book of Mormon plates is still in dispute, although the characters have been highly circulated both by the Church and other individuals. Due to Hofmanns methods, the authenticity of many of the documents he sold to the Church and the Smithsonian will likely never be sorted out.       In 1989, ": null
    },
    {
        "George P. Lee": "George P. Lee"
    },
    {
        ", a ": null
    },
    {
        "Navajo": "Navajo Nation"
    },
    {
        " member of the First ": null
    },
    {
        "Quorum of the Seventy": "Seventy"
    },
    {
        " who had participated in the ": null
    },
    {
        "Indian Placement Program": "Indian Placement Program"
    },
    {
        " in his youth, was excommunicated. The church action occurred not long after he had submitted to the Church a 23-page letter critical of the program and the effect it had on Native American culture. In October 1994, Lee confessed to, and was convicted of, sexually molesting a 13-year-old girl in 1989. It is not known if church leaders had knowledge of this crime during the excommunication process.     In the late 1980s, the administration of ": null
    },
    {
        "Ezra Taft Benson": "Ezra Taft Benson"
    },
    {
        " formed what it called the ": null
    },
    {
        "Strengthening Church Members Committee": "Strengthening Church Members Committee"
    },
    {
        ", to keep files on potential church dissidents and collect their published material for possible later use in church disciplinary proceedings. The existence of this committee was first publicized by an anti-Mormon ministry in 1991, when it was referred to in a memo dated July 19, 1990 leaked from the office of the churchs Presiding Bishopric.     At the 1992 ": null
    },
    {
        "Sunstone Symposium": "Sunstone Magazine"
    },
    {
        ", dissident Mormon scholar ": null
    },
    {
        "Lavina Fielding Anderson": "Lavina Fielding Anderson"
    },
    {
        " accused the Committee of being an internal espionage system, which prompted ": null
    },
    {
        "Brigham Young University": "Brigham Young University"
    },
    {
        " professor and moderate Mormon scholar ": null
    },
    {
        "Eugene England": "Eugene England"
    },
    {
        " to accuse that committee of undermining the Church, a charge for which he later publicly apologized. Letter to the Editor,  Sunstone , March 1993. The publicity concerning the statements of Anderson and England, however, prompted the church to officially acknowledge the existence of the Committee. Mormon Church keeps files on its dissenters, St. Petersburg Times, Aug. 15, 1992, at 6e. The Church explained that the Committee provides local church leadership with information designed to help them counsel with members who, however well-meaning, may hinder the progress of the church through public criticism. Secret Files, New York Times, Aug. 22, 1992.     The First Presidency also issued a statement on August 22, 1992, explaining its position that the Committee had precedent and was justified based on a reference to ": null
    },
    {
        "D & C": "Doctrine And Covenants"
    },
    {
        " Sec. 123, written while Joseph Smith was imprisoned in ": null
    },
    {
        "Liberty, Missouri": "Liberty, Missouri"
    },
    {
        ", suggesting that a committee be formed to record and document acts of persecution against the church by the people of Missouri.     Official concern about the work of dissident scholars within the church led to the excommunication or disfellowshipping of six such scholars, dubbed the ": null
    },
    {
        "September Six": "September Six"
    },
    {
        ", in September 1993. Six intellectuals disciplined for apostasy.  Sunstone , November 1993, 65-73.       The church has always been against the creation, distribution and viewing of pornography. Gordon B. Hinckley had been known to say that pornography is as addictive as the worst drugs. Lynn Arave LDS urged to boost worthiness  Deseret News  May 19, 2004 He often talked of what a shame it is to use such great resources for such material.          By the 1960s and 1970s, as a consequence of its massive, international growth in the post-": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " era, the church was no longer primarily a Utah-based church, but a worldwide organization. The church, mirroring the world around it, felt the disunifying strains of alien cultures and diverse points of view that had brought an end to the idealistic modern age. At the same time, the ": null
    },
    {
        "postmodern": "Postmodernity"
    },
    {
        " world was increasingly skeptical of traditional religion and authority, and driven by mass-media and public image. These influences awoke within the church a new self-consciousness. The church could no longer rest quietly upon its fundamentals and history. It felt a need to sell its image to an increasingly jaded public, to jettison some of its Utah-based parochialism, to control and manage Mormon scholarship that might present an unfavorable image of the church, and to alter its organization to cope with its size and cultural diversity, while preserving centralized control of Latter-day Saint doctrine, practice, and culture.     Thus, the church underwent a number of important changes in organization, practices, and meeting schedule. In addition, the church became more media-savvy, and more self-conscious and protective of its public image. The church also became more involved in public discourse, using its new-found political and cultural influence and the media to affect its image, public morality, and Mormon scholarship, and to promote its missionary efforts. At the same time, the church struggled with how to deal with increasingly pluralistic voices within the church and within Mormonism. In general, this period has seen both an increase in cultural and racial diversity and extra-faith ": null
    },
    {
        "ecumenism": "Ecumenism"
    },
    {
        ", and a decrease in intra-faith ": null
    },
    {
        "pluralism": "Religious Pluralism"
    },
    {
        ".     Until the churchs rapid growth after World War II, it had been seen in the eyes of the general public as a backward, non- or vaguely Christian polygamist cult in Utah   an image that interfered with proselyting efforts. As the churchs size began to merit new visibility in the world, the church seized upon the opportunity to re-define its public image, and to establish itself in the public mind as a mainstream Christian faith. At the same time, the church became publicly involved in numerous ecumenical and welfare projects that continue to serve as the foundation of its ecumenism today.     In the 1960s the Church formed the Church Information Service with the goal of being ready to respond to media inquiries and generate positive media coverage. The organization kept a photo file to provide photos to the media for such events as Temple dedications. It also would work to get stories covering ": null
    },
    {
        "Family Home Evening": "Family Home Evening"
    },
    {
        ", the Church welfare plan and the Churchs youth activities in various publications. ": null
    },
    {
        "Richard O. Cowan": "Richard O. Cowan"
    },
    {
        ". The Church in the 20th Century p. 289     As part of the churchs efforts to re-position its image as that of a mainstream religion, the church began to moderate its earlier anti-": null
    },
    {
        "Roman Catholic": "Roman Catholic Church"
    },
    {
        " rhetoric. In Elder ": null
    },
    {
        "Bruce R. McConkies": "Bruce R. Mcconkie"
    },
    {
        " 1958 edition of  Mormon Doctrine , he had stated his unofficial opinion that the Catholic Church was part of the church of the devil and the great and abominable church because it was among organizations that misled people away from following Gods laws. In his 1966 edition of the same book, the specific reference to the Catholic Church was removed. See generally: ": null
    },
    {
        "Armand L. Mauss": "Armand L. Mauss"
    },
    {
        ", The Angel and the Beehive: The Mormon Struggle with Assimilation ; Gordon Sheperd & Gary Sheperd, Mormonism in Secular Society: Changing Patterns in Official Ecclesiastical Rhetoric, Review of Religious Research 26 : 28-42.     The first routinized system for teaching church principles to potential proselytes had been created in 1953 and named A Systematic Program for Teaching the Gospel . In 1961, this system was enhanced, expanded, and renamed A Uniform System for Teaching Investigators . This new system, in the form of a hypothetical dialogue with a fictional character named Mr. Brown , included intricate details for what to say in almost every situation. These routinized missionary discussions would be further refined in 1973 and 1986, and then de-emphasized in 2003.     In 1973, the church recast its missionary discussions, making them more family-friendly and focused on building on common Christian ideals. The new discussions, named A Uniform System for Teaching Families , de-emphasized the ": null
    },
    {
        "Great Apostasy": "Great Apostasy"
    },
    {
        ", which previously held a prominent position just after the story of the ": null
    },
    {
        "First Vision": "First Vision"
    },
    {
        ". When the discussions were revised in the early 1980s, the new discussions dealt with the apostasy less conspicuously, and in later discussions, rather than in the first discussion. The discussions also became more family-friendly, including a flip chart with pictures, in part to encourage the participation of children.     According to Riess and Tickle, early Mormons rarely quoted from the Book of Mormon in their speeches and writings. It was not until the 1980s that it was cited regularly in speeches given by LDS Church leaders at the semiannual ": null
    },
    {
        "General Conferences": "General Conference"
    },
    {
        ". In 1982, the LDS Church subtitled the Book of Mormon another testament of Jesus Christ. LDS leader ": null
    },
    {
        "Boyd K. Packer": "Boyd K. Packer"
    },
    {
        " stated that the scripture now took its place beside the Old Testament and the New Testament.  , 2 January 1988,  Church News  Riess and Tickle assert that the introduction of this subtitle was intended to emphasize the Christ-centered nature of the Book of Mormon. They assert that the LDS rediscovery of the Book of Mormon in the late twentieth century is strongly connected to their renewed emphasis on the person and nature of Jesus Christ.           In 1995, the church announced a new logo design that emphasized the words JESUS CHRIST in large capital letters, and de-emphasized the words The Church of and of Latter-day Saints . According to Bruce L. Olsen, director of public affairs for the church, The logo re-emphasizes the official name of the church and the central position of the Savior in its theology. It stresses our allegiance to the Lord, Jesus Christ.     On January 1, 2000, the First Presidency and the ": null
    },
    {
        "Quorum of the Twelve Apostles": "Quorum Of The Twelve Apostles"
    },
    {
        " released a proclamation entitled ": null
    },
    {
        "The Living Christ: The Testimony of the Apostles": "The Living Christ: The Testimony Of The Apostles"
    },
    {
        " . This document commemorated the birth of Jesus and set forth the churchs official view regarding Christ.     In 2001, the church sent out a press release encouraging reporters to use the full name of the church at the beginning of news articles, with following references to the Church of Jesus Christ . The release discouraged the use of the term Mormon Church .     Cooperation with other churches:   The church has opened its broadcasting facilities to other Christian groups, and has participated in the VISN Religious Interfaith Cable Television Network.   The church has participated in numerous joint humanitarian efforts with other churches.   The church has agreed not to baptize Holocaust victims by proxy     The church and the Information Age: This would include topics like how the church seeks to battle pornography, its use of the internet, its battle to control its public image, broadcasting the Nauvoo temple dedication, appearances on Larry King Live, and so on.     The church in the media:   Official press releases   and  Homefront Our Heavenly Fathers Plan, Together Forever, What is Real, Prodigal Son, and so on.   Legacy, and so on.   Hinckleys appearances on  Larry King Live  ": null
    },
    {
        "United States Constitution": "United States Constitution"
    },
    {
        " banning marriage except between a man and a woman. The Church also announced its opposition to political measures that confer legal status on any other sexual relationship than a man and a woman lawfully wedded as husband and wife. .     On November 5, 2015, an update letter to LDS Church leaders for the ": null
    },
    {
        "Church Handbook": "Handbook"
    },
    {
        " was leaked. The policy banned a child of a parent living in a same-gender relationship from ": null
    },
    {
        "baby blessings": "Naming And Blessing Of Children"
    },
    {
        ", ": null
    },
    {
        "baptism": "Baptism In Mormonism"
    },
    {
        ", ": null
    },
    {
        "confirmation": "Confirmation"
    },
    {
        ", ": null
    },
    {
        "priesthood ordination": "Priesthood"
    },
    {
        ", and ": null
    },
    {
        "missionary service": "Missionary"
    },
    {
        " until the child was not living with their homosexual parent, was of legal age , and disavow the practice of same-gender cohabitation and marriage , in addition to receiving approval from the Office of the First Presidency. The policy update also added that entering a same-sex marriage as a type of apostasy , mandating a ": null
    },
    {
        "disciplinary council": "Disciplinary Council"
    },
    {
        ".   The next day, in a video interview, D. Todd Christofferson clarified that the policy was about love and protect children from difficulties, challenges, conflicts where parents feel one way and the expectations of the Church are very different .  On November 13, the First Presidency released a letter clarifying that the policy applied only to those children whose primary residence is with a couple living in a same-gender marriage or similar relationship and that for children residing with parents in a same-sex relationship who had already received ordinances the policy would not require that privileges be curtailed or that further ordinances be withheld .   The next day around 1,500 members gathered across from the Church Office to submit their resignation letters in response to the policy change with thousands more resigning online in the weeks after     Two months later, in a satellite broadcast, Russell M. Nelson stated that the policy change was revealed to President Monson in a sacred moment when the Lord inspired ... to declare ... the will of the Lord . ": null
    }
]