[
    {
        "      The history of Turkmenistan  is largely shrouded in mystery, its past since the arrival of ": null
    },
    {
        "Indo-European": "Proto-Indo-Europeans"
    },
    {
        " Iranian tribes": "Ancient Iranian Peoples"
    },
    {
        " around 2000 BC is often the starting point of the areas discernible history. Early tribes were ": null
    },
    {
        "nomad": "Nomad"
    },
    {
        "ic or semi-nomadic due to the arid conditions of the region as the steppe culture in Central Asia was an extension of a larger ": null
    },
    {
        "Eurasian": "Eurasian Nomads"
    },
    {
        " series of horse cultures which spanned the entire spectrum of language families including the ": null
    },
    {
        "Indo-Europeans": "Proto-Indo-European Language"
    },
    {
        " and ": null
    },
    {
        "Turko-Mongol": "Turko-Mongol"
    },
    {
        " groups. Some of the known early Iranian tribes included the ": null
    },
    {
        "Massagatae": "Massagatae"
    },
    {
        ", ": null
    },
    {
        "Scythia": "Scythia"
    },
    {
        "ns/": null
    },
    {
        "Sakas": "Sakas"
    },
    {
        ", and early ": null
    },
    {
        "Soghdians": "Soghdians"
    },
    {
        " . Turkmenistan was a passing point for numerous migrations and invasions by tribes which gravitated towards the settled regions of the south including ancient ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    },
    {
        ", ": null
    },
    {
        "Elam": "Elam"
    },
    {
        ", and the ": null
    },
    {
        "Indus Valley Civilization": "Indus Valley Civilization"
    },
    {
        ".     The regions ": null
    },
    {
        "written history": "Recorded History"
    },
    {
        " begins with the regions conquest by the ": null
    },
    {
        "Achaemenid Empire": "Achaemenid Empire"
    },
    {
        " of ": null
    },
    {
        "ancient Iran": "Ancient Iran"
    },
    {
        ", as the region was divided between the ": null
    },
    {
        "satrapys": "Satrapy"
    },
    {
        " of ": null
    },
    {
        "Margiana": "Margiana"
    },
    {
        ", ": null
    },
    {
        "Chorasmia": "Khwarezmian Language"
    },
    {
        " and ": null
    },
    {
        "Parthia": "Parthia"
    },
    {
        ". Later conquerors included ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        ", the ": null
    },
    {
        "Parni": "Parni"
    },
    {
        ", ": null
    },
    {
        "Ephthalites": "Ephthalites"
    },
    {
        ", ": null
    },
    {
        "Huns": "Huns"
    },
    {
        ", ": null
    },
    {
        "Göktürks": "Göktürks"
    },
    {
        ", ": null
    },
    {
        "Sarmatians": "Sarmatians"
    },
    {
        ", and ": null
    },
    {
        "Sassanid": "Sassanid"
    },
    {
        " Iranians. During this early phase of history, the majority of Turkmenistans inhabitants were either adherents of ": null
    },
    {
        "Zoroastrianism": "Zoroastrianism"
    },
    {
        " or ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        " and the region was largely dominated by Iranian peoples. However, these incursions and epochs, though pivotal, did not shape the regions history as the invasions of two later invading groups: ": null
    },
    {
        "Arabs": "Arabs"
    },
    {
        " and the ": null
    },
    {
        "Oghuz Turks": "Oghuz Turks"
    },
    {
        ". The vast majority of inhabitants were converted to ": null
    },
    {
        "Hanif": "Hanif"
    },
    {
        "ism, while the ": null
    },
    {
        "Oghuz": "Oghuz Turks"
    },
    {
        " brought the beginnings of the ": null
    },
    {
        "Turkic": "Turkic Languages"
    },
    {
        " Turkmen language": "Turkmen Language"
    },
    {
        " that came to dominate the area. The Turkic period was a time of cultural fusion as Islamic traditions brought by the Arabs merged with local Iranian cultures and then were further altered by Turkic invaders and rulers such as the ": null
    },
    {
        "Seljuks": "Great Seljuq Empire"
    },
    {
        ". ": null
    },
    {
        "Genghis Khan": "Genghis Khan"
    },
    {
        " and ": null
    },
    {
        "Mongol": "Mongol"
    },
    {
        " invasions devastated the region during the late ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", but their hold upon the area was transitional as later ": null
    },
    {
        "Timur": "Timur"
    },
    {
        " Leng and ": null
    },
    {
        "Uzbeks": "Uzbeks"
    },
    {
        " contested the land.     Modern Turkmenistan was radically transformed by the invasion of the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        ", which conquered the region in the late 19th century. Later, the ": null
    },
    {
        "Russian Revolution of 1917": "Russian Revolution Of 1917"
    },
    {
        " would ultimately transform Turkmenistan from an Islamic tribal society to a ": null
    },
    {
        "totalitarian": "Totalitarian"
    },
    {
        " Leninist": "Leninist"
    },
    {
        " one during the ": null
    },
    {
        "Soviet": "Soviet Union"
    },
    {
        " era. Independence came in 1991, as ": null
    },
    {
        "Saparmurat Niyazov": "Saparmurat Niyazov"
    },
    {
        ", a former local communist party boss, declared himself absolute ruler for life as Turkmenbashi or Leader of the Turkmen and transitioned the newly independent Turkmenistan into an ": null
    },
    {
        "authoritarian": "Authoritarian"
    },
    {
        " state under his absolute control and has thus far resisted the democratization that has influenced many of the other former Soviet Republics. Niyazov ruled until his death on December 21, 2006.          Scant remains point to early human settlements east of the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        ", possibly including ": null
    },
    {
        "Neanderthals": "Neanderthals"
    },
    {
        ", although the archaeology of the region as a whole is underresearched.      ": null
    },
    {
        "Bronze Age": "Bronze Age"
    },
    {
        " and ": null
    },
    {
        "Iron Age": "Iron Age"
    },
    {
        " finds support the probability of advanced civilizations in the area including finds associated with a society known to scholars as the ": null
    },
    {
        "Bactria-Margiana Archaeological Complex": "Bactria-Margiana Archaeological Complex"
    },
    {
        " – near the modern cities of ": null
    },
    {
        "Mary": "Mary, Turkmenistan"
    },
    {
        " , ": null
    },
    {
        "Djeitun": "Djeitun"
    },
    {
        " and ": null
    },
    {
        "Gonur Tepe": "Gonur Tepe"
    },
    {
        ".       By 2000 BCE, ": null
    },
    {
        "Indo-European peoples": "Proto-Indo-Europeans"
    },
    {
        " had settled throughout the region. Most of the present-day Turkmenistan was occupied by BMAC-related societies and the ": null
    },
    {
        "Dahae": "Dahae"
    },
    {
        " – a tribal confederation located immediately east of the Caspian. The ": null
    },
    {
        "Massagetae": "Massagetae"
    },
    {
        " and ": null
    },
    {
        "Scythians": "Scythians"
    },
    {
        " were also present, immediately north of BMAC and the Dahae.          ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " conquered the territory in the 4th century BC on his way to South Asia. In 330 BC, Alexander marched northward into Central Asia and founded the city of Alexandria near the Murgab River. Located on an important trade route, Alexandria later became the city of Merv. The ruins of Alexanders ancient city are still to be found and have been extensively researched. After Alexanders death his empire quickly fell apart. It was ruled by ": null
    },
    {
        "Seleucids": "Seleucids"
    },
    {
        " before the satrap of Parthia declared independence. The ": null
    },
    {
        "Parthia": "Parthia"
    },
    {
        "ns – fierce, nomadic warriors from the north of Iran – then established the kingdom of Parthia, which covered present-day Turkmenistan and Iran. The Parthian kings ruled their domain from the city of ": null
    },
    {
        "Nisa": "Nisa, Turkmenistan"
    },
    {
        " – an area now located near the modern-day capital of ": null
    },
    {
        "Ashgabat": "Ashgabat"
    },
    {
        " – founded by ": null
    },
    {
        "Arsaces": "Arsaces"
    },
    {
        " I , and was reputedly the royal necropolis of the Parthian kings, although it has neither been established that the fortress at Nisa was a royal residence nor a mausoleum.     Excavations at Nisa have revealed substantial buildings, mausoleums and shrines, many inscribed documents, and a looted treasury. Many Hellenistic art works have been uncovered, as well as a large number of ivory rhytons, the outer rims decorated with Iranian subjects or classical mythological scenes.          The Parthian Kingdom succumbed in 224 AD to the ": null
    },
    {
        "Sasanids": "Sasanids"
    },
    {
        " – rulers of ": null
    },
    {
        "Iran": "Iran"
    },
    {
        ". At the same time, several tribal groups—including in the ": null
    },
    {
        "Huns": "Huns"
    },
    {
        " of ": null
    },
    {
        "Kushan": "Yuezhi"
    },
    {
        " controlled ": null
    },
    {
        "Balkan Province": "Balkan Province"
    },
    {
        " in 91 AD according to Tacitus and later the ": null
    },
    {
        "Alans": "Alans"
    },
    {
        " according to Chinese records —were moving into Turkmenistan from the east and north. Although Ancient Persian traditions always mentioned the Turanian control of the area, these records provided the first independently corroborated evidence of nomadic Non-Iranian peoples into the area of Turkmenistan.     By the early 4th century AD, a Kushan noble from the Balkan province called Malkar of Khi, had become leader of the Huns settled there. In alliance with Dulo the Alan king on the Volga Delta, Malkar went on to forge ten tribes into the first proto-": null
    },
    {
        "Turkic tribal confederation": "Turkic Tribal Confederation"
    },
    {
        ". The Dulo clans first proto-": null
    },
    {
        "Turkic Empire": "Turkic Tribal Confederation"
    },
    {
        " spread its influence as far east as the sub-continent under the Kitolo and as far west as Central Europe under Attilas Dulo. Wresting control of southern ": null
    },
    {
        "Turkmenistan": "Turkmenistan"
    },
    {
        " from the Sasanian Empire in the 5th century AD, Malkars Dulo Confederation of Ten Tribes caused a migration of Khurasanis into Dagestan as the ": null
    },
    {
        "Caucasian Avars": "Caucasian Avars"
    },
    {
        ". As a result of this backfire, the ": null
    },
    {
        "Sabirs": "Sabirs"
    },
    {
        " settled there were forced to attack the Alan strongholds of the Dulo Ten Tribe Confederation in the Kuban steppe. To strengthen their position, Malkars Confederation of Ten Tribes now under the leadership of Ernakh entered into an alliance with Byzantium at Phanagoria in the 460s AD. However, in the 550s AD, the Caucasian Avars pushed further conquering Phanagoria and forcing Sarosios of the Alans to petition Byzantium for land. Within a few years, Dulos Ten Tribe Confederation in Balkan Province allied themselves to the Ashinas forming the Western part of the Gokturk Empire and were able to snatch Phanagoria back from the Avars renaming the Sabirs as Khazars under the rule of Kaghan Kazarig. By exposing the Avars close ties to Persia, once again the Ten Tribes of the Dulo entered into alliance with Byzantium. However, the Dulo clans Ten Tribes soon seceded from the Gokturks to become the Western Turkic Kaghanate which thrived until 630s. They appointed Dulo Kaghan Kubrat to establish the short-lived state of Old Great Bolgary disintegrating upon his death with the majority migrated west where they carried out the first Hungarian conquest in 677 under Kotrag who also went up the volga to establish Bolgary, and Batbayans Balkars who settled down with the Circassians north of the Caucasus. The Kara-khazars in the Balkan Province eventually revolted against the Aq-Khazars to establish the Yabghu Oghuz State of the Kara dynasty which produced the Seljuks who thrived until their dynasty was taken over by Temujin.     At this time much of the population was already in settlements around the fertile river valleys along the ": null
    },
    {
        "Amu Darya": "Amu Darya"
    },
    {
        ", and ": null
    },
    {
        "Merv": "Merv"
    },
    {
        " and ": null
    },
    {
        "Nisa": "Nisa, Turkmenistan"
    },
    {
        " became centers of ": null
    },
    {
        "sericulture": "Sericulture"
    },
    {
        " . A busy caravan route, connecting ": null
    },
    {
        "Tang Dynasty": "Tang Dynasty"
    },
    {
        " China and the city of ": null
    },
    {
        "Baghdad": "Baghdad"
    },
    {
        " , passed through Merv. Thus, the city of Merv constituted an important prize for any conqueror.       Central Asia came under Arab control after a series of invasions in the late 7th and early 8th centuries and was incorporated into Islamic ": null
    },
    {
        "Caliphate": "Caliphate"
    },
    {
        " divided between provinces of Mawaraun Nahr and ": null
    },
    {
        "Khorasan": "Greater Khorasan"
    },
    {
        ". The Arab conquest brought the religion of Islam to all of the peoples of central Asia. The city of Merv was occupied by the lieutenants of the caliph ": null
    },
    {
        "Uthman ibn Affan": "Uthman Ibn Affan"
    },
    {
        ", and was constituted as the capital of Khorasan. Using this city as their base, the Arabs, led by their commander ": null
    },
    {
        "Qutayba ibn Muslim": "Qutayba Ibn Muslim"
    },
    {
        ", brought under subjection ": null
    },
    {
        "Balkh": "Balkh"
    },
    {
        ", ": null
    },
    {
        "Bokhara": "Bokhara"
    },
    {
        ", ": null
    },
    {
        "Fergana": "Fergana"
    },
    {
        " and ": null
    },
    {
        "Kashgaria": "Kashgaria"
    },
    {
        ", and penetrated into China as far as the province of ": null
    },
    {
        "Kan-suh": "Kan-Suh"
    },
    {
        " early in the 8th century.     Merv achieved some political spotlight in February 748 when ": null
    },
    {
        "Abu Muslim": "Abu Muslim"
    },
    {
        " declared a new ": null
    },
    {
        "Abbasid": "Abbasid"
    },
    {
        " dynasty at Merv, and set out from the city to conquer Iran and Iraq and establish a new capital at Baghdad. Abu Muslim was famously challenged by the Goldsmith of Merv to do the right thing and not make war on fellow Muslims. The Goldsmith was put to death.     In the latter part of the 8th century Merv became obnoxious to Islam as the centre of heretical propaganda preached by al-Muqanna The Veiled Prophet of Khorasan . Present Turkmenistan was ruled by ": null
    },
    {
        "Tahirids": "Tahirid Dynasty"
    },
    {
        " between 821 and 873. In 873, Arab rule in Central Asia came to an end as a result of the ": null
    },
    {
        "Saffarid": "Saffarid"
    },
    {
        " conquest. During their dominion Merv, like ": null
    },
    {
        "Samarkand": "Samarkand"
    },
    {
        " and Bokhara, was one of the great schools of learning, and the celebrated historian ": null
    },
    {
        "Yaqut": "Yaqut Al-Hamawi"
    },
    {
        " studied in its libraries. Merv produced a number of scholars in various branches of knowledge, such as Islamic law, ": null
    },
    {
        "Hadith": "Hadith"
    },
    {
        ", history, literature, and the like. Several scholars have the name: Marwazi designating them as hailing from Merv. But Saffarid rule was brief and they were defeated by ": null
    },
    {
        "Samanids": "Samanids"
    },
    {
        " in 901. The Samanid dynasty weaked after second half of 10th century and ": null
    },
    {
        "Ghaznavids": "Ghaznavids"
    },
    {
        " took present Turkmenistan in 990s. But, they challenged with ": null
    },
    {
        "Seljuks": "Seljuks"
    },
    {
        ", newcomers from north. Seljuks decisive victory against them, present Turkmenistan was passed to them in 1041.       The origins of the ": null
    },
    {
        "Turkmen": "Turkmen People"
    },
    {
        " may be traced back to the ": null
    },
    {
        "Oghuz": "Oghuz"
    },
    {
        " confederation of nomadic pastoral tribes of the early Middle Ages, which lived in present-day Mongolia and around ": null
    },
    {
        "Lake Baikal": "Lake Baikal"
    },
    {
        " in present-day southern Siberia. Known as the Nine Oghuz, this confederation was composed of Turkic-speaking peoples who formed the basis of powerful steppe empires in Inner Asia. In the second half of the 8th century, components of the Nine Oghuz migrated through Jungaria into Central Asia, and Arabic sources located them under the term Guzz in the area of the middle and lower Syrdariya in the 8th century. By the 10th century, the Oghuz had expanded west and north of the ": null
    },
    {
        "Aral Sea": "Aral Sea"
    },
    {
        " and into the steppe of present-day Kazakhstan, absorbing not only Iranians but also Turks from the Kipchak and Karluk ethnolinguistic groups. In the 11th century, the renowned Muslim Turk scholar ": null
    },
    {
        "Mahmud al-Kashgari": "Mahmud Al-Kashgari"
    },
    {
        " described the language of the Oghuz and Turkmen as distinct from that of other Turks and identified twenty-two Oghuz clans or sub-tribes, some of which appear in later Turkmen genealogies and legends as the core of the early Turkmen.      First mention of Oghuz goes back to the time prior to the ": null
    },
    {
        "Göktürk": "Göktürk"
    },
    {
        " state- there are references to the Sekiz-Oghuz and the Dokuz-Oghuz union. The ": null
    },
    {
        "Oghuz Turks": "Oghuz Turks"
    },
    {
        " under Sekiz-Oghuz and the Dokuz-Oghuz state formations ruled different areas in the vicinity of the ": null
    },
    {
        "Altay Mountains": "Altay Mountains"
    },
    {
        ". During the establishment of the ": null
    },
    {
        "Göktürk": "Göktürk"
    },
    {
        " state, Oghuz tribes inhabited the Altay mountain region and also lived along the ": null
    },
    {
        "Tula": "Tuul River"
    },
    {
        " River. They also formed as a community near the Barlik river in present-day northern Mongolia.     Oghuz expansion by means of military campaigns went at least as far as the ": null
    },
    {
        "Volga River": "Volga River"
    },
    {
        " and ": null
    },
    {
        "Ural Mountains": "Ural Mountains"
    },
    {
        ", but the geographic limits of their dominance fluctuated in the steppe areas extending north and west from the Aral Sea. Accounts of Arab geographers and travelers portray the Oghuz ethnic group as lacking centralized authority and being governed by a number of kings and chieftains. Because of their disparate nature as a polity and the vastness of their domains, Oghuz tribes rarely acted in concert. Hence, by the late 10th century, the bonds of their confederation began to loosen. At that time, a clan leader named Seljuk founded a dynasty and the empire that bore his name on the basis of those Oghuz elements that had migrated southward into present-day Turkmenistan and Iran. The Seljuk Empire was centered in Persia, from which Oghuz groups spread into Azerbaijan and Anatolia.     After the fall of Göktürk kingdom, Oghuz tribes migrated to the area of ": null
    },
    {
        "Transoxiana": "Transoxiana"
    },
    {
        ", in western Turkestan, in modern Kazakhstan and Kirghizstan. This land became known as the Oghuz steppe which is an area between the Caspian and Aral Seas. Ibn al-Athir, an Arab historian, stated that the Oghuz Turks had come to Transoxiana in the period of the caliph ": null
    },
    {
        "Al-Mahdi": "Al-Mahdi"
    },
    {
        " in the years between 775 and 785. In the period of the ": null
    },
    {
        "Abbasid": "Abbasid"
    },
    {
        " caliph ": null
    },
    {
        "Al-Mamun": "Al-Mamun"
    },
    {
        " , the name Oghuz starts to appear in the Islamic historiography. By 780 AD, the eastern parts of the Syr Darya were ruled by the ": null
    },
    {
        "Karluk": "Karluks"
    },
    {
        " Turks and the western region was ruled by the ": null
    },
    {
        "Oghuz Turks": "Oghuz Turks"
    },
    {
        ".     The name Turkmen first appears in written sources of the 10th century to distinguish those Oghuz groups who migrated south into the Seljuk domains and accepted Islam from those that had remained in the steppe. Gradually, the term took on the properties of an ethnonym and was used exclusively to designate Muslim Oghuz, especially those who migrated away from the ": null
    },
    {
        "Syrdariya Basin": "Syrdariya Basin"
    },
    {
        ". By the 13th century, the term Turkmen supplanted the designation Oghuz altogether. The origin of the word Turkmen remains unclear. According to popular etymologies as old as the 11th century, the word derives from Turk plus the Iranian element ": null
    },
    {
        "manand": "Manand"
    },
    {
        ", and means resembling a Turk. Modern scholars, on the other hand, have proposed that the element man /men acts as an intensifier and have translated the word as pure Turk or most Turk-like of the Turks.       In the 11th century, ": null
    },
    {
        "Seljuk": "Great Seljuq Empire"
    },
    {
        " domains stretched from the delta of the Amu Darya delta into Iran, Iraq, the Caucasus region, Syria, and Asia Minor. In 1040 the ": null
    },
    {
        "Seljuk Turks": "Seljuk Turks"
    },
    {
        " crossed the Oxus from the north, and having defeated Masud, sultan of Ghazni, raised Toghrul Beg, grandson of ": null
    },
    {
        "Seljuk": "Seljuk"
    },
    {
        ", to the throne of Iran, founding the Seljukid dynasty, with its capital at ": null
    },
    {
        "Nishapur": "Nishapur"
    },
    {
        ". A younger brother of Toghrul, Daud, took possession of ": null
    },
    {
        "Merv": "Merv"
    },
    {
        " and Herat. ": null
    },
    {
        "Toghrul": "Tughril"
    },
    {
        " was succeeded by his nephew ": null
    },
    {
        "Alp Arslan": "Alp Arslan"
    },
    {
        " , who was buried at Merv. It was about this time that ": null
    },
    {
        "Merv": "Merv"
    },
    {
        " reached the zenith of her glory. In 1055 Seljuk forces entered ": null
    },
    {
        "Baghdad": "Baghdad"
    },
    {
        ", becoming masters of the Islamic heartlands and important patrons of Islamic institutions. Until these revolts, Turkmen tribesmen were an integral part of the Seljuk military forces. Turkmen migrated with their families and possessions on Seljuk campaigns into Azerbaijan and Anatolia, a process that began the Turkification of these areas. During this time, Turkmen also began to settle the area of present-day Turkmenistan. Prior to the Turkmen habitation, most of this desert had been uninhabited, while the more habitable areas along the Caspian Sea, ": null
    },
    {
        "Kopetdag Mountains": "Kopetdag Mountains"
    },
    {
        ", ": null
    },
    {
        "Amu Darya": "Amu Darya"
    },
    {
        ", and ": null
    },
    {
        "Murgap River": "Murgap River"
    },
    {
        " were populated predominantly by Iranians. The city-state of ": null
    },
    {
        "Merv": "Merv"
    },
    {
        " was an especially large sedentary and agricultural area, important as both a regional economic-cultural center and a transit hub on the ": null
    },
    {
        "Silk Road": "Silk Road"
    },
    {
        ". The last powerful Seljuk ruler, Sultan ": null
    },
    {
        "Sanjar": "Sanjar"
    },
    {
        " , witnessed the fragmentation and destruction of the empire because of attacks by Turkmen and other tribes. During the reign of Sultan Sanjar or Sinjar of the same house, in the middle of the 11th century, Merv was overrun by the Turkish tribes of the Ghuzz from beyond the Oxus. It eventually passed under the sway of the rulers of Khwarizm . After mixing with the settled peoples in Turkmenistan, the Oguz living north of the Kopet-Dag Mountains gradually became known as the ": null
    },
    {
        "Turkmen": "Turkmen People"
    },
    {
        ".     The Seljuk empire broke down in the second half of the 12th century, and the Turkmen became independent tribal federation.       In 1157, the rule of Seljuks dynasty came to an end in the province of ": null
    },
    {
        "Khorasan": "Greater Khorasan"
    },
    {
        ". The Turkic rulers of Khiva took control of the area of Turkmenistan, under the title of ": null
    },
    {
        "Khwarezmshahs": "Khwarezmshah"
    },
    {
        " in 1221, central Asia suffered a disastrous invasion by ": null
    },
    {
        "Mongol": "Mongol"
    },
    {
        " warriors who swept across the region from their base in eastern Asia.          Under their commander, ": null
    },
    {
        "Genghis Khan": "Genghis Khan"
    },
    {
        ", founder of the ": null
    },
    {
        "Mongol Empire": "Mongol Empire"
    },
    {
        ", the ": null
    },
    {
        "Mongols": "Mongols"
    },
    {
        " conquered ": null
    },
    {
        "Khwarezm": "Khwarezm"
    },
    {
        " and burned the city of Merv to the ground. The Mongol leader ordered the massacre of Mervs inhabitants as well as the destruction of the provinces farms and irrigation works which effectively ended the Iranian dominance in urban areas and agricultural communities of khwarezm. These areas were soon repopulated by the Turkmen who survived the invasion and had retreated northward to the plains of Kazakhstan or westward to the shores of the Caspian Sea. After the ": null
    },
    {
        "division of the Mongol Empire": "Division Of The Mongol Empire"
    },
    {
        ", present Turkmenistan was passed to ": null
    },
    {
        "Chagatai Khanate": "Chagatai Khanate"
    },
    {
        " except southernmost part was belonged to ": null
    },
    {
        "Ilkhanate": "Ilkhanate"
    },
    {
        ".     Small, semi-independent states arose under the rule of the regions tribal chiefs later in the 14th century. In the 1370s, Amir Timur , one of the greatest conquerors in human history, captured Turkmen states once more and established the short lived ": null
    },
    {
        "Timurid Empire": "Timurid Empire"
    },
    {
        ", which collapsed after Timurs death in 1405, when Turkmens became independent once again.       As a whole, the 14th to 16th centuries was a period in which the Turkmens dislocation due to the Mongol invasions gave way to new political groupings which became tribal groupings which have continued to modern day.     In addition to the new political arrangements, historical sources suggest that a large tribal union called the ": null
    },
    {
        "Salor confederation": "Salor Confederation"
    },
    {
        " remained from the original Oghuz tribes and into modern times. In the late 17th century, the confederation fell apart and three senior tribes moved eastward and then southward. Of these tribes, the ": null
    },
    {
        "Yomud": "Yomut"
    },
    {
        " split into eastern and western groups, and the ": null
    },
    {
        "Teke": "Teke Tribe"
    },
    {
        " migrated to the Akhal region near the ": null
    },
    {
        "Kopetdag Mountains": "Kopet Dag"
    },
    {
        " and eventually into the ": null
    },
    {
        "Murgap River": "Morghab River"
    },
    {
        " basin. Other Salor tribes moved into the region near the ": null
    },
    {
        "Amu Darya": "Amu Darya"
    },
    {
        " delta and into other parts of modern-day southeast ": null
    },
    {
        "Turkmenistan": "Turkmenistan"
    },
    {
        ". Salor groups also live in ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        ", Afghanistan, ": null
    },
    {
        "Uzbekistan": "Uzbekistan"
    },
    {
        ", and China.          The history of Turkmenistan from the 16th until the 19th century is mostly known by the relations with the states of ": null
    },
    {
        "Iran": "Iranian Empire"
    },
    {
        ", ": null
    },
    {
        "Khiva": "Khanate Of Khiva"
    },
    {
        ", ": null
    },
    {
        "Bukhara": "Emirate Of Bukhara"
    },
    {
        ", and ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ". However, wars of the period took place mostly in the lands of Turkmenistan. The invasion of the Khan of Khiva, ": null
    },
    {
        "Abul Gazi Bahadur Khan": "Abulghazi Bahadur"
    },
    {
        ", from 1645 to 1663, caused some difficulties to the Turkmens, coupled with the impact of the drought that occurred at about the same period, most of the Turkmens within the khanate moved to areas around Akhal, Atrek, Murgap and Tedjen. In this period, many of the Turkmens tribes living around the Lake Aral left also migrated because of pressures from both the Khanate of Khiva and the ": null
    },
    {
        "Kalmyks": "Kalmyk People"
    },
    {
        " and migrated to around Astrakhan and Stavropol in northern Caucasus.     Popular epics such as ": null
    },
    {
        "Koroglu": "Koroglu"
    },
    {
        ", and other oral traditions, took shape during this period which could be taken as a beginning of Turkmen nation. The poets and thinkers of the time such as Devlet Mehmed Azadi and ": null
    },
    {
        "Makhtumkuli": "Makhtumkuli"
    },
    {
        " became a voice for an emerging nation, calling for unity, brotherhood and peace among Turkmen tribes. ": null
    },
    {
        "Makhtumkuli": "Makhtumkuli"
    },
    {
        " is venerated in Turkmenistan as the father of the national literature. Most of present Turkmenistan was divided between Khanates of Khiva and Bukhara except southernmost parts were handed to Persia. ": null
    },
    {
        "Nader": "Nader Shah"
    },
    {
        ", was shah of Persia conquered it in 1740 but after him assassination in 1747, Turkmen lands were recaptured by Uzbek khanates of Khiva and Bukhara. During the 1830s, the Tekke Turkomans, then living on the Tejen River, were forced by the Persians to migrate northward. Khiva contested the advance of the Tekkes, but ultimately, about 1856, the latter became the sovereign power of southern and southeastern parts of present Turkmenistan.       In the 18th century Turkoman tribes came into contact with ": null
    },
    {
        "Tsarist Empire": "Imperial Russia"
    },
    {
        ". The Russian Empire began to move into the area in 1869 with the establishment of the ": null
    },
    {
        "Caspian Sea": "Caspian Sea"
    },
    {
        " port of Krasnovodsk, current-day ": null
    },
    {
        "Turkmenbashy": "Türkmenbaşy, Turkmenistan"
    },
    {
        ". After the suppression of Khanates of Bukhara and Khiva the Turkmen area remained independent. Russians decided to move into ": null
    },
    {
        "Transcaspian": "Transcaspian"
    },
    {
        " region, allegedly to subdue Turkmen slave trade and banditry. The service of some Turkmen tribes, especially the Yomud, for the Khivan Khan also encouraged the Russia to punish them by raids into Khorazm, which killed hundreds. These wars culminated in the ": null
    },
    {
        "Battle of Geok Tepe": "Battle Of Geok Tepe"
    },
    {
        " in 1881 where General ": null
    },
    {
        "Skobelev": "Mikhail Skobelev"
    },
    {
        " massacred 7,000 Turkmen at the desert fortress of ": null
    },
    {
        "Geok Depe": "Geok Depe"
    },
    {
        ", near modern Ashgabat; another 8,000 were killed trying to flee across the desert. By 1894 imperial Russia had taken control of almost all of Turkmenistan except around part of ": null
    },
    {
        "Konye-Urgench": "Konye-Urgench"
    },
    {
        " was in ": null
    },
    {
        "Khiva": "Khiva"
    },
    {
        " and around part of ": null
    },
    {
        "Charju": "Turkmenabad"
    },
    {
        " was in ": null
    },
    {
        "Emirate of Bukhara": "Emirate Of Bukhara"
    },
    {
        ".     The ": null
    },
    {
        "Transcaspian": "Transcaspian"
    },
    {
        " Railway was started from the shores of the Caspian in 1879 in order to secure Russian control over the region and provide a rapid military route to the Afghan border. In 1885 ": null
    },
    {
        "a crisis": "Panjdeh Incident"
    },
    {
        " was precipitated by the Russian annexation of the ": null
    },
    {
        "Pandjeh": "Serhetabad"
    },
    {
        " oasis, to the south of Merv, on a territory of modern ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ", which nearly led to war with ": null
    },
    {
        "Britain": "United Kingdom Of Great Britain And Ireland"
    },
    {
        ". Peter Hopkirk, Great Game , pp 332 as it was thought that the Russians were planning to march on to Herat in ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ". Until 1898 Transcaspia was part of the Governor-Generalship of the Caucasus and administered from Tiflis, but in that year it was made an Oblast of Russian ": null
    },
    {
        "Turkestan": "Turkestan"
    },
    {
        " and governed from ": null
    },
    {
        "Tashkent": "Tashkent"
    },
    {
        ". Nevertheless, Turkestan remained an isolated colonial outpost, with an administration that preserved many distinctive features from the previous Islamic regimes, including Qadis courts and a native administration that devolved much power to local Aksakals . In 1897 the Transcaspian Railway reached Tashkent, and finally in 1906 a direct rail link with European Russia was opened across the steppe from Orenburg to Tashkent. This led to much larger numbers of Slavic settlers flowing into Turkestan than had hitherto been the case, and their settlement was overseen by a specially created Migration Department in St. Petersburg . This caused considerable discontent amongst the local Turkmen population, as mainly Russian-populated cities such as ": null
    },
    {
        "Ashgabat": "Ashgabat"
    },
    {
        " appeared.     The best-known Military Governor to have ruled the region from Ashkhabad was probably ": null
    },
    {
        "General Kuropatkin": "Aleksey Kuropatkin"
    },
    {
        ", whose authoritarian methods and personal style of governance made the province very difficult for his successors to control and led to a revolt in 1916. Consequently, the administration of Transcaspia became a byword for corruption and brutality within Russian Turkestan, as Russian administrators turned their districts into petty fiefdoms and extorted money from the local population. In 1908 Count Konstantin Konstantinovich Pahlen led a reforming commission to Turkestan which produced a monumental report detailing these abuses of power, administrative corruption and inefficiency.          Following the ": null
    },
    {
        "October Revolution": "October Revolution"
    },
    {
        " of 1917 in Russia, ": null
    },
    {
        "Ashgabat": "Ashgabat"
    },
    {
        " became a base for anti-": null
    },
    {
        "Bolshevik": "Bolshevik"
    },
    {
        " counter-revolutionaries, who soon came under attack from the ": null
    },
    {
        "Tashkent Soviet": "Tashkent Soviet"
    },
    {
        ". The Communists succeeded in taking control of Ashkhabad in the summer of 1918, forming a Soviet. In response, ": null
    },
    {
        "Junaid Khan": "Junaid Khan"
    },
    {
        " and forces loyal to the old Russian regime joined together to drive out the Communists. In July 1919, these anti-Communist allies established the independent state of ": null
    },
    {
        "Transcaspia": "Transcaspian Government"
    },
    {
        ". A small British force, led by General ": null
    },
    {
        "Wilfrid Malleson": "Wilfrid Malleson"
    },
    {
        ", from Meshed occupied Ashgabat and parts of southern Turkmenistan until 1919. It is alleged that ": null
    },
    {
        "26 Baku Commissars": "26 Baku Commissars"
    },
    {
        " were gunned down by British forces or their Transcaspian allies. The region was one of the last centres of ": null
    },
    {
        "Basmachi": "Basmachi"
    },
    {
        " resistance to ": null
    },
    {
        "Bolshevik": "Bolshevik"
    },
    {
        " rule, with the last of the rebellious Turkoman fleeing across the border to Afghanistan and Iran in 1922–23.       In 27 of October 1924, the Turkestan ASSR was dissolved, in accordance with the decree of the Central   Executive Committee of the USSR and the ": null
    },
    {
        "Turkmen SSR": "Turkmen Ssr"
    },
    {
        " became one of the ": null
    },
    {
        "republics": "Republics Of The Soviet Union"
    },
    {
        " of the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ". At this time the modern borders of Turkmenistan were formed. The Turkmen Government renamed ": null
    },
    {
        "Ashgabat": "Ashgabat"
    },
    {
        " into Poltoratsk after a local revolutionary, however the name Ashgabat was restored in 1927. In February 1925, the Turkmenistan Communist Party held its first Congress in Ashkhabad. From this period onward the city experienced rapid growth and industrialisation, although it was severely disrupted by the October ": null
    },
    {
        "1948 Ashgabat earthquake": "1948 Ashgabat Earthquake"
    },
    {
        ". With an estimated surface wave magnitude of 7.3, the earthquake killed 10,000–110,000. According to other local sources, two-third of a population of 176,000 inhabitants perished.     In the 1950s, the 1375 kilometer long ": null
    },
    {
        "Qaraqum Canal": "Qaraqum Canal"
    },
    {
        " was built. Draining the ": null
    },
    {
        "Amu-Darya": "Amu-Darya"
    },
    {
        " river, it enabled huge areas to be opened for cotton production. It also greatly diminished the inflow of water to the ": null
    },
    {
        "Aral Sea": "Aral Sea"
    },
    {
        ", resulting in an ecological catastrophe.     Turkmenistan was not among the most economically developed Soviet republics, with largely agrarian economy, despite exploration and exploitation of enormous oil and gas resources – discovery of 62 ": null
    },
    {
        "trillion cubic feet": "Trillion Cubic Feet"
    },
    {
        " Dawletabad": "Dawletabad"
    },
    {
        " gas field in the 1960s became the largest ": null
    },
    {
        "gas field": "Gas Field"
    },
    {
        " find in the world outside Russia and Middle East.       Turkmenistan became independent on October 27, 1991, amidst the ": null
    },
    {
        "dissolution of the Soviet Union": "Dissolution Of The Soviet Union"
    },
    {
        ". The former head of Turkmenistans Communist Party at the time of independence, ": null
    },
    {
        "Saparmurat Niyazov": "Saparmurat Niyazov"
    },
    {
        ", was elected president of the newly independent nation in an uncontested election. At the 25th Congress of the Communist Party of Turkmenistan in the autumn of 1991, the party decided to dissolve itself, a process that continued into 1992. In its place, the Turkmenistan Democratic Party was organized, and on December 16, 1991, Saparmurat   Niyazov, who was elected President of Turkmenistan in October 1990, signed a decree officially   conferring TDP membership on former TCP members.     The authoritarian Niyazov, who has assumed the title of Turkmenbashi , or Leader of all Turkmen , was accused of developing a totalitarian ": null
    },
    {
        "cult of personality": "Cult Of Personality"
    },
    {
        ". His opus, the  Ruhnama , was made a mandatory reading in Turkmenistans schools and months of the calendar were renamed after members of his family. Opposition parties are banned in Turkmenistan and the government controls all sources of information. In December 1999, ": null
    },
    {
        "Turkmenistans constitution": "Constitution Of Turkmenistan"
    },
    {
        " was amended to allow Niyazov to serve as president for life.     Niyazov was the main proponent of Turkmenistans constitutional neutrality. Under this policy, Turkmenistan does not participate in any military alliance and does not contribute to United Nations monitoring forces. This in fact means an internal isolation of Turkmenistan from world politics.     In late 2004, Niyazov met with former Canadian Prime Minister ": null
    },
    {
        "Jean Chrétien": "Jean Chrétien"
    },
    {
        " to discuss an oil contract in Turkmenistan for a Canadian corporation. In March 2005, news of this meeting caused an uproar amongst opposition circles in Canada, who claimed the affair could damage Chrétiens legacy.     In 2005, Niyazov announced that his country would downgrade its links with the Commonwealth of Independent States, a loose alliance of post-Soviet states; he furthermore promised free and fair elections by 2010 in a move that surprised many Western observers.     Niyazov acknowledged having heart disease in November 2006. On December 21, 2006, Niyazov died unexpectedly, leaving no heir-apparent and an unclear line of succession. A former deputy prime minister rumored to be the illegitimate son of Niyazov, ": null
    },
    {
        "Gurbanguly Berdimuhamedow": "Gurbanguly Berdimuhamedow"
    },
    {
        ", became acting president, although under the constitution the Chairman of the ": null
    },
    {
        "Peoples Council": "Peoples Council Of Turkmenistan"
    },
    {
        ", ": null
    },
    {
        "Öwezgeldi Ataýew": "Öwezgeldi Ataýew"
    },
    {
        ", should have succeeded to the post. However, Ataýew was accused of crimes and removed from office.       In ": null
    },
    {
        "an election": "Turkmenistani Presidential Election, 2007"
    },
    {
        " on February 11, 2007, ": null
    },
    {
        "Gurbanguly Berdimuhamedow": "Gurbanguly Berdimuhamedow"
    },
    {
        " was elected president with 89% of the vote and 95% turnout, although the election was condemned by outside observers.     Following his election, Berdimuhamedow moved to reduce foreign isolation and reversed some of Niyazovs more egocentric and damaging policies. Internet cafes offering free and uncensored Web access opened in ": null
    },
    {
        "Ashgabat": "Ashgabat"
    },
    {
        ",  compulsory education was extended from nine to ten years and classes in sports and foreign languages were re-introduced into the curriculum, and the government announced plans to open several specialized schools for the arts.  President Berdimuhamedow has called for reform of education, health care and pension systems, and government officials of non-Turkmen ethnic origin who had been sacked by Niyazov have returned to work.      President Berdimuhamedow began to reduce the personality cult surrounding Niyazov and the office of the president. He called for an end to the elaborate pageants of music and dancing that formerly greeted the president on his arrival anywhere, and said that the Turkmen sacred oath , part of which states that the speakers tongue should shrivel if he ever speaks ill of Turkmenistan or its president, should not be recited multiple times a day but reserved for special occasions. Previously the oath was recited at the beginning and end of TV news reports, by students at the beginning of the school day, and at the beginning of virtually all meetings of any official nature that took place in the country.      However, Berdimuhamedow is criticized for building a personality cult of his own . For example, he is the only person whose first name is used in government press releases; other officials always have their first names abbreviated to a single letter. He is also sometimes called the Turkmen leader by his countrys press. Additionally, while his regime is somewhat less heavy-handed than Niyazovs, it is still rigidly authoritarian.     On March 19, 2007, Berdimuhamedow reversed one of Niyazovs most unpopular decrees by giving pensions back to 100,000 elderly people whose pensions Niyazov had slashed in the face of an unspecified budget crisis.      On March 20, in a decision of significant symbolic weight in the ongoing rejection of Niyazovs personality cult, he abolished the power of the president to rename any landmarks, institutions, or cities.      On March 31, 2007, the 20th Congress of the ": null
    },
    {
        "Halk Maslahaty": "Halk Maslahaty"
    },
    {
        " began in the city of Mary. New laws relating to agricultural efficiency were passed, and it was decreed that school teachers wages would soon rise by 40%.      On May 12, Russia and Turkmenistan announced that they had reached an agreement to build a new natural gas pipeline from Turkmenistan to Russia, via Kazakhstan. This has led to speculation that the European Union will become more energy-dependent on Russia, which buys Turkmen gas at below-market prices, and that as a result Russias political influence in Eastern Europe may increase.      On May 16, in what was described as one of his boldest moves up to that time, Berdimuhamedow sacked a high-ranking security official who had been instrumental in building and maintaining the late president Niyazovs extensive cult of personality. According to official Turkmen news media, ": null
    },
    {
        "Akmyrat Rejepow": "Akmyrat Rejepow"
    },
    {
        ", the head of the presidential security service, was removed from office by presidential decree and transferred to another job. The nature of this job was not specified.  Turkmenistan: New President Sacks Long-Serving Security Chief from EurasiaNet.org     On June 14, Berdimuhamedow re-opened the Turkmen Academy of Sciences, which had been shut down by his predecessor.  According to reports, as of June 25 Berdimuhamedow had also ordered the closure of the International Fund of Saparmurat Niyazov, the former Turkmenbashis personal private fund, and stated his intent to begin a series of reforms in the military.      Berdimuhamedow celebrated his 50th birthday on June 29, 2007. He was awarded the ": null
    },
    {
        "Watan Order": "Watan Order"
    },
    {
        " for his outstanding achievements – a gold and diamond pendant weighing about 1 kilogram. The President also published his biography and held a gala birthday celebration. The government also issued 400 gold and silver coins decorated with the presidents portrait.      In 2008, Berdimuhamedow restored the traditional names of the months and days of the week ,  and announced plans to move the infamous ": null
    },
    {
        "gold rotating statue": "Neutrality Arch"
    },
    {
        " of Niyazov from Ashgabats central square.  He has not, however, moved toward Western-style democracy.      In September 2008, a new constitution was accepted by the Peoples Council.  ": null
    },
    {
        "Parliamentary elections": "Turkmenistani Parliamentary Election, 2008–2009"
    },
    {
        " under this new constitution were held on December 14, 2008.      In December 2008, Berdimuhamedow announced changes to the ": null
    },
    {
        "national anthem": "National Anthem Of Turkmenistan"
    },
    {
        ", which involved removing the repeated references to former President Niyazov. The new version was to take effect on December 21, the second anniversary of Niyazovs death. ": null
    }
]