[
    {
        "           Tajikistan": "Tajikistan"
    },
    {
        " harkens to the ": null
    },
    {
        "Samanid Empire": "Samanid Empire"
    },
    {
        " . The ": null
    },
    {
        "Tajik people": "Tajik People"
    },
    {
        " came under ": null
    },
    {
        "Russia": "Russia"
    },
    {
        "n rule in the 1860s. The ": null
    },
    {
        "Basmachi revolt": "Basmachi Revolt"
    },
    {
        " broke out in the wake of the ": null
    },
    {
        "Russian Revolution of 1917": "Russian Revolution Of 1917"
    },
    {
        " and was quelled in the early 1920s during the ": null
    },
    {
        "Russian Civil War": "Russian Civil War"
    },
    {
        ". In 1924 Tajikistan became an ": null
    },
    {
        "Autonomous Soviet Socialist Republics of the Soviet Union": "Autonomous Soviet Socialist Republics Of The Soviet Union"
    },
    {
        ", the ": null
    },
    {
        "Tajik ASSR": "Tajik Assr"
    },
    {
        ", within ": null
    },
    {
        "Uzbekistan": "Uzbekistan"
    },
    {
        ". In 1929 Tajikistan was made one of the component republics of the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " – ": null
    },
    {
        "Tajik Soviet Socialist Republic": "Tajik Soviet Socialist Republic"
    },
    {
        " – and it kept that status until gaining independence 1991 after the ": null
    },
    {
        "dissolution of the Soviet Union": "Dissolution Of The Soviet Union"
    },
    {
        ".     It has since experienced three changes in government and the ": null
    },
    {
        "Tajik civil war": "Tajik Civil War"
    },
    {
        ". A peace agreement among rival factions was signed in 1997.             Tajikistan was part of ": null
    },
    {
        "Scythia": "Scythia"
    },
    {
        " in Classical Antiquity. ": null
    },
    {
        "Sogdiana": "Sogdiana"
    },
    {
        ", ": null
    },
    {
        "Bactria": "Bactria"
    },
    {
        ", ": null
    },
    {
        "Merv": "Merv"
    },
    {
        " and ": null
    },
    {
        "Khorezm": "Khorezm"
    },
    {
        " were the four principal divisions of Ancient Central Asia inhabited by the ancestors of the present-day Tajikistani Tajiks. Tajiks are now found only in historic Bactria and Sogdiana. Merv is inhabited by the ": null
    },
    {
        "Turkoman": "Turkmen People"
    },
    {
        " and Khorezm by ": null
    },
    {
        "Uzbeks": "Uzbeks"
    },
    {
        " and ": null
    },
    {
        "Kazakhs": "Kazakhs"
    },
    {
        ". Sogdiana was made up of the ": null
    },
    {
        "Zeravshan": "Zeravshan"
    },
    {
        " and ": null
    },
    {
        "Kashka-Darya": "Kashka-Darya"
    },
    {
        " river valleys. Currently, two of the surviving peoples of Sogdiana who speak a dialect of the Sogdian language are the ": null
    },
    {
        "Yaghnobis": "Yaghnobi People"
    },
    {
        " and ": null
    },
    {
        "Shugnan": "Shighnan"
    },
    {
        "is.     Tajikistan was part of the ": null
    },
    {
        "Bactria-Margiana Archaeological Complex": "Bactria-Margiana Archaeological Complex"
    },
    {
        " in the ": null
    },
    {
        "Bronze Age": "Bronze Age"
    },
    {
        ", candidate for ": null
    },
    {
        "Proto-Indo-Iranian": "Proto-Indo-Iranian"
    },
    {
        " or ": null
    },
    {
        "Proto-Iranian": "Proto-Iranian"
    },
    {
        " culture. Bactria was located in northern ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        "  between the mountain range of the ": null
    },
    {
        "Hindu Kush": "Hindu Kush"
    },
    {
        " and the ": null
    },
    {
        "Amu Darya": "Amu Darya"
    },
    {
        "  River and some areas of current south Tajikistan. During different periods, Bactria was a center of various Kingdoms or Empires, and is probably where ": null
    },
    {
        "Zoroastrianism": "Zoroastrianism"
    },
    {
        " originated. The ": null
    },
    {
        "Avesta": "Avesta"
    },
    {
        " —the holy book of Zoroastrianism—was written in the old-Bactrian dialect; it is also thought that Zoroaster was most likely born in Bactria.     Some authors have also suggested that in the 7th and 6th century BCE parts of modern Tajikistan, including territories in the Zeravshan valley, formed part of ": null
    },
    {
        "Kambojas": "Kambojas"
    },
    {
        ", which were referenced in the ": null
    },
    {
        "Mahabharata": "Mahabharata"
    },
    {
        " epic as the ": null
    },
    {
        "Parama Kamboja": "Parama Kamboja"
    },
    {
        ", before it became part of the ": null
    },
    {
        "Achaemenid Empire": "Achaemenid Empire"
    },
    {
        ". See: The Deeds of Harsha: Being a Cultural Study of Bāṇas Harshacharita, 1969, p 199, Dr Vasudeva Sharana Agrawala; Proceedings and Transactions of the All-India Oriental Conference, 1930, p 118, Dr J. C. Vidyalankara; Prācīna Kamboja, jana aura janapada : Ancient Kamboja, people and country, 1981, Dr Jiyālāla Kāmboja, Dr Satyavrat Śāstrī – Kamboja . ": null
    },
    {
        "Linguistic": "Linguistics"
    },
    {
        " evidence, combined with ancient literary and inscriptional evidence suggest the Kambojas originally emigrated from ": null
    },
    {
        "Central Asia": "Central Asia"
    },
    {
        ". Dr J. C. Vidyalankara, Proceedings and Transactions of 6th A.I.O. Conference, 1930, p 118; cf: Linguistic Survey of India, Vol X, pp 455-56, Dr G. A. Grierson.          During the ": null
    },
    {
        "Achaemenid period": "Achaemenids"
    },
    {
        ", Sogdiana and Bactria were part of the ": null
    },
    {
        "Persian empire": "Persian Empire"
    },
    {
        ". Sogdians and Bactrians occupied important positions in the administration and military of the Achaemenid Empire             After the Persian Empire was defeated by ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        ", Bactria, Sogdiana and Merv, being part of Persian Empire, had to defend themselves from new invaders. In fact, the Macedonians faced very stiff resistance under the leadership of Sogdian ruler ": null
    },
    {
        "Spitamenes": "Spitamenes"
    },
    {
        ". ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " managed to marry ": null
    },
    {
        "Roxana": "Roxana"
    },
    {
        ", the daughter of a local ruler, and inherited his land. Following Alexanders brief occupation, the ": null
    },
    {
        "Hellenistic": "Hellenistic"
    },
    {
        " successor states of the Seleucids and ": null
    },
    {
        "Greco-Bactrians": "Greco-Bactrians"
    },
    {
        " controlled the area for another 200 years in what is known as the ": null
    },
    {
        "Greco-Bactrian Kingdom": "Greco-Bactrian Kingdom"
    },
    {
        ". During the time period from 90 BC to 30 BC, ": null
    },
    {
        "Yuezhi": "Yuezhi"
    },
    {
        " destroyed the last Hellenistic ": null
    },
    {
        "successor states": "Successor States"
    },
    {
        " and, together with the Tokhari, created a ": null
    },
    {
        "Kushan": "Kushan"
    },
    {
        " Empire around 30 AD.          For another 400 years, until 410 AD, the Kushan Empire was a major power in the region along with the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        ", the ": null
    },
    {
        "Parthia": "Parthia"
    },
    {
        "n Empire and the ": null
    },
    {
        "Han": "Han Dynasty"
    },
    {
        " Empire . Notable contact was made with local peoples when the envoys of the ": null
    },
    {
        "Han Dynasty": "Han Dynasty"
    },
    {
        " journeyed to this area in the 2nd century BC. At the end of the Kushan period, the Empire became much smaller and would have to defend itself from the powerful ": null
    },
    {
        "Sassanid": "Sassanid Dynasty"
    },
    {
        " Empire that replaced the Parthian Empire. The famous Kushan king Kanishka promoted Buddhism and during this time Buddhism was exported from Central Asia to China.            The Sassanids once controlled much of what is now Tajikistan, but lost the territory to the Hephthalites  during the time of ": null
    },
    {
        "Peroz I": "Peroz I"
    },
    {
        ".     They created a powerful empire that succeeded in making ": null
    },
    {
        "Iran": "Iran"
    },
    {
        " a tributary state around 483–485. Shah of ": null
    },
    {
        "Persia": "Persia"
    },
    {
        " Peroz": "Peroz"
    },
    {
        " fought three wars with Hephthalites. During the first war he was captured by Hephthalite army and later was released after ": null
    },
    {
        "Byzantine": "Byzantine"
    },
    {
        " emperor paid a ransom for him. During the second war Peroz was captured again and was released after paying a huge contribution to the Hephthalite king. During the third war Peroz was killed. The Hephthalites were subjugated in 565 by a combination of ": null
    },
    {
        "Sassanid": "Sassanid"
    },
    {
        " and ": null
    },
    {
        "Kök-Turk": "Göktürks"
    },
    {
        " forces. Subsequently, present Tajikistan was ruled by ": null
    },
    {
        "Göktürks": "Göktürks"
    },
    {
        " and ": null
    },
    {
        "Sassanids": "Sassanids"
    },
    {
        ", however when the ": null
    },
    {
        "Sassanid Empire": "Sassanid Empire"
    },
    {
        " fell the Turks kept control of Tajikistan but they later lost it to the ": null
    },
    {
        "Chinese people": "China"
    },
    {
        ", however, they later managed to take control of Tajikistan once again, only to lose it to the Arabs in 710.              The Transoxiana principalities never formed a viable confederacy. Beginning in 651, the Arabs organized periodic marauding raids deep into the territory of Transoxania, but it was not until the appointment of Ibn Qutaiba as Governor of ": null
    },
    {
        "Khorasan": "Greater Khorasan"
    },
    {
        " in 705, during the reign of Walid I, that the Caliphate adopted the policy of annexing the lands beyond the Oxus. In 715, the task of annexation was accomplished. The entire region thus came under the control of the ": null
    },
    {
        "Caliph": "Caliph"
    },
    {
        " and of Islam, but the Arabs continued to rule through local Soghdian Kings and  dihqan s. The ascension of the ": null
    },
    {
        "Abbasids": "Abbasids"
    },
    {
        " to rule the Caliphate opened a new era in the history of Central Asia. While their predecessors the ": null
    },
    {
        "Umayyads": "Umayyads"
    },
    {
        " were little more than leaders of a loose confederation of Arab tribes, the Abbasids set out to build a huge multi-ethnic centralized state that would emulate and perfect the Sassanian government machine. They gave the Near East and Transoxiana a unity, which they had been lacking since the time of Alexander the Great.            The ": null
    },
    {
        "Samanid dynasty": "Samanid Dynasty"
    },
    {
        " ruled in ": null
    },
    {
        "Khorasan": "Greater Khorasan"
    },
    {
        "  and was founded by ": null
    },
    {
        "Saman Khuda": "Saman Khuda"
    },
    {
        ". The Samanids were one of the first purely indigenous dynasties to rule in Persia after the Muslim Arab conquest. During the reign of Saman Khudas great-grandson, Ismail I , Samanids expanded in Khorasan. In 900, Ismail defeated the Saffarids in Khorasan , while his brother was the governor of Transoxiana. Thus, Samanid rule was acclaimed over the combined regions. The cities of ": null
    },
    {
        "Bukhara": "Bukhara"
    },
    {
        " and Samarkand became centres of art, science, and literature; industries included pottery making and bronze casting. After 950, Samanid power weakened, but was briefly revitalized under Nuh II, who ruled from 976 to 997. However, with the oncoming encroachment of Muslim ": null
    },
    {
        "Turks": "Turkic Peoples"
    },
    {
        ", the Samanids lost their domains south of the ": null
    },
    {
        "Oxus river": "Oxus River"
    },
    {
        " which were taken by ": null
    },
    {
        "Ghaznavids": "Ghaznavids"
    },
    {
        ". In 999, Bukhara was taken by the ": null
    },
    {
        "Qarakhanids": "Qarakhanids"
    },
    {
        ". The Samanid ": null
    },
    {
        "Ismail Muntasir": "Ismail Muntasir"
    },
    {
        " tried to restore the dynasty , until he was assassinated by an Arab ": null
    },
    {
        "bedouin": "Bedouin"
    },
    {
        " chieftain.      The attack of the Qarakhanid Turks ended the Samanid dynasty in 999 and dominance in Transoxiana passed on to Turkic rulers.       After the collapse of Samanid Dynasty, Central Asia became the battleground of many Asian invaders who came from the north-east.         The ": null
    },
    {
        "Mongol Empire": "Mongol Empire"
    },
    {
        " swept through Central Asia, invaded ": null
    },
    {
        "Khwarezmian Empire": "Khwarezmian Empire"
    },
    {
        " and sacked the cities of Bukhara and Samarkand, looting and massacring people everywhere.       Timur, founder of the ": null
    },
    {
        "Timurid Empire": "Timurid Empire"
    },
    {
        ", was born on 8 April 1336 in ": null
    },
    {
        "Kesh": "Shahrisabz"
    },
    {
        " near Samarkand. He was a member of the Turkicized Barlas tribe, a Mongol subgroup that had settled in ": null
    },
    {
        "Transoxiana": "Transoxiana"
    },
    {
        " after taking part in ": null
    },
    {
        "Genghis Khans": "Genghis Khan"
    },
    {
        " son ": null
    },
    {
        "Chagatais": "Chagatai Khan"
    },
    {
        " campaigns in that region. Timur began his life as a bandit leader. During this period, he received an arrow-wound in the leg, as a result of which he was nicknamed Timur-e Lang or Timur the Lame. Although the last Timurid ruler of Herat, Badi az Zaman finally fell to the armies of the Uzbek Muhammad Shaibani Khan in 1506, the Timurid ruler of Ferghana, Zahir-ud-Din ": null
    },
    {
        "Babur": "Babur"
    },
    {
        ", survived the collapse of the dynasty and re-established the ": null
    },
    {
        "Timurid dynasty": "Timurid Dynasty"
    },
    {
        " in India in 1526 where they became known as the ": null
    },
    {
        "Mughals": "Mughal Empire"
    },
    {
        ".         The ": null
    },
    {
        "Shaybanid": "Shaybanid"
    },
    {
        " state was divided into ": null
    },
    {
        "appanages": "Appanage"
    },
    {
        " between all male members of the dynasty, who would designate the supreme ruler , the oldest member of clan. The seat of Khan was first Samarkand, the capital of the Timurids, but some of the Khans preferred to remain in their former appanages. Thus Bukhara became the seat of the khan for the first time under Ubaid Allah Khan .     The period of political expansion and economical prosperity was short-lived. Soon after the death of Abd Allah Khan the Shaibanid dynasty died out and was replaced by the Janid or ": null
    },
    {
        "Astrakhanid": "Astrakhanid"
    },
    {
        " dynasty, another branch of the descendants of ": null
    },
    {
        "Jöchi": "Jochi"
    },
    {
        ", whose founder Jani Khan was related to Abd Allah Khan Through his marriage to Abdullah Khans Sister. The Astrakhanids are also said to be connected to the ": null
    },
    {
        "Hashemites": "Hashemites"
    },
    {
        " due to Imam Quli Khans status as a ": null
    },
    {
        "Sayyid": "Sayyid"
    },
    {
        ". Their descendants today live in ": null
    },
    {
        "India": "India"
    },
    {
        ". In 1709, eastern part of ": null
    },
    {
        "Khanate of Bukhara": "Khanate Of Bukhara"
    },
    {
        " seceded and formed ": null
    },
    {
        "Khanate of Kokand": "Khanate Of Kokand"
    },
    {
        ". Thus, the eastern part of present Tajikistan passed to the Khanate of Kokand, while the western one remained part of the Khanate of Bukhara.       In 1740, the Janid khanate was conquered by ": null
    },
    {
        "Nader Shah": "Nader Shah"
    },
    {
        ", the ": null
    },
    {
        "Afsharid": "Afsharid Dynasty"
    },
    {
        " ruler of ": null
    },
    {
        "Persia": "Persia"
    },
    {
        ". The Janid khan Abu al Faiz retained his throne, becoming Nadirs vassal.     After the death of Nader Shah in 1747, the chief of the ": null
    },
    {
        "Manghit": "Manghit"
    },
    {
        " tribe, Muhammad Rahim Biy Azaliq, overcame his rivals from other tribes and consolidated his rule in the ": null
    },
    {
        "Khanate of Bukhara": "Khanate Of Bukhara"
    },
    {
        ". His successor, however, ruled in the name of puppet khans of Janid origin. In 1785 Shah Murad formalized the familys dynastic rule , and the khanate became the Emirate of Bukhara ": null
    },
    {
        "Soucek, Svat": "Svat Soucek"
    },
    {
        ". A History of Inner Asia , p. 180.              Russian ": null
    },
    {
        "Imperialism": "Imperialism"
    },
    {
        " led to the ": null
    },
    {
        "Russian Empires": "Russian Empire"
    },
    {
        " conquest of ": null
    },
    {
        "Central Asia": "Central Asia"
    },
    {
        " during the late 19th centurys ": null
    },
    {
        "Imperial Era": "Great Game"
    },
    {
        ". Between 1864 and 1885 Russia gradually took control of the entire territory of ": null
    },
    {
        "Russian Turkestan": "Russian Turkestan"
    },
    {
        ", the Tajikistan portion of which had been controlled by the ": null
    },
    {
        "Emirate of Bukhara": "Emirate Of Bukhara"
    },
    {
        " and ": null
    },
    {
        "Khanate of Kokand": "Khanate Of Kokand"
    },
    {
        " . Tashkent was conquered in 1865 and in 1867 the Turkestan ": null
    },
    {
        "Governor-Generalship": "Guberniya"
    },
    {
        " was created with ": null
    },
    {
        "Konstantin Petrovich Von Kaufman": "Konstantin Petrovich Von Kaufman"
    },
    {
        " as the first Governor-General. The History of Tajik SSR, Maorif Publ. House, Dushanbe, 1983, Chapter V . W. Fierman, The Soviet transformation of Central Asia , in: W. Fierman, ed., Soviet Central Asia, Westview Press, Boulder, CO, 1991.        The expansion was motivated by Russias economic interests and was connected with the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        " in the early 1860s, which severely interrupted the supply of cotton fiber to the Russian industry and forced Russia to turn to Central Asia as an alternative source of cotton supply as well as a market for Russian made goods. The Russian regime in the 1870s attempted to switch cultivation in the region from grain to cotton . A Country Study: Tajikistan, Tajikistan under Russian Rule, Library of Congress Call Number DK851 .K34 1997,  By 1885 Tajikistans territory was either ruled by the Russian Empire or its ": null
    },
    {
        "vassal state": "Vassal State"
    },
    {
        ", the Emirate of Bukhara, nevertheless Tajiks felt little Russian influence.     Russian Empire, being a much bigger state with a huge population and having an advanced military, had little difficulty in conquering the regions inhabited by Tajiks, meeting fierce resistance only at ": null
    },
    {
        "Jizzakh": "Jizzakh"
    },
    {
        ", ": null
    },
    {
        "Ura-Tyube": "Ura-Tyube"
    },
    {
        ", and when their garrison in ": null
    },
    {
        "Samarkand": "Samarkand"
    },
    {
        " was besieged in 1868 by forces from ": null
    },
    {
        "Shahr-e Sabz": "Shahr-E Sabz"
    },
    {
        " and the inhabitants of the city. The army of the ": null
    },
    {
        "Emirate of Bukhara": "Emirate Of Bukhara"
    },
    {
        " was utterly defeated in three battles, and on 18 June 1868 Emir Mozaffar al-Din signed a peace treaty with the Governor-General of Russian Turkestan Von Kaufman. Samarkand and the Upper ": null
    },
    {
        "Zeravshan": "Zeravshan"
    },
    {
        " were annexed by Russia and the country was opened to Russian merchants. The ": null
    },
    {
        "emir": "Emir"
    },
    {
        " retained his throne as a vassal of Russia and with Russian help he established control over ": null
    },
    {
        "Shahr-e Sabz": "Shahr-E Sabz"
    },
    {
        ", the mountainous regions in the upper Zeravshan Valley and the principalities of the western Pamir .     During the late 19th century the ": null
    },
    {
        "Jadid": "Jadid"
    },
    {
        "ists established themselves as an Islamic social movement throughout the region. Although the Jadidists were pro-modernization and not necessarily anti-Russian the Russians viewed the movement as a threat. anti-Russian, tsarist officials in Turkestan found their kind of education even more threatening than traditional Islamic teaching, A Country Study: Tajikistan, Tajikistan under Russian Rule, Library of Congress Call Number DK851 .K34 1997,  Russian troops were required to restore order during uprisings against the Khanate of Kokand between 1910 and 1913. Further violence occurred in July 1916 when demonstrators attacked Russian soldiers in ": null
    },
    {
        "Khujand": "Khujand"
    },
    {
        " over the threat of forced ": null
    },
    {
        "conscription": "Conscription"
    },
    {
        " during ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ". Despite Russian troops quickly bringing Khujand back under control, clashes continued throughout the year in various locations in Tajikistan.     At the end of August 1920 the last emir, Sayyid Alim Khan, was overthrown by Soviet troops. On 6 October 1920 the emirate was abolished and the ": null
    },
    {
        "Bukharan Peoples Soviet Republic": "Bukharan Peoples Soviet Republic"
    },
    {
        " was proclaimed.             The ": null
    },
    {
        "Basmachi movement": "Basmachi Movement"
    },
    {
        " or Basmachi Revolt was an uprising against ": null
    },
    {
        "Russian Imperial": "Russian Empire"
    },
    {
        " and ": null
    },
    {
        "Soviet": "Soviet Union"
    },
    {
        " rule that arose after the ": null
    },
    {
        "Russian Revolution": "Russian Revolution"
    },
    {
        " of 1917 guerrillas throughout Central Asia.     The movements roots lay in the anti-conscription violence of 1916 that erupted when the Russian Empire began to draft Muslims for army service during ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ". Victor Spolnikov, Impact of Afghanistans War on the Former Soviet Republics of Central Asia, in Hafeez Malik, ed, Central Asia: Its Strategic Importance and Future Prospects , 101. In the months following the ": null
    },
    {
        "October 1917 Revolution": "October Revolution"
    },
    {
        " the ": null
    },
    {
        "Bolsheviks": "Bolsheviks"
    },
    {
        " seized power in many parts of the Russian Empire and the ": null
    },
    {
        "Russian Civil War": "Russian Civil War"
    },
    {
        " began. Turkestani Muslim political movements attempted to form an autonomous government in the city of ": null
    },
    {
        "Kokand": "Kokand"
    },
    {
        ", in the ": null
    },
    {
        "Ferghana Valley": "Ferghana Valley"
    },
    {
        ". The Bolsheviks launched an assault on Kokand in February 1918 and carried out a general massacre of up to 25,000 people. Uzbekistan, By Thomas R McCray, Charles F Gritzner, pg. 30, 2004,  The massacre rallied support to the Basmachi movements who waged ": null
    },
    {
        "a guerrilla war and a conventional war": "Basmachi Movementthe Kokand Autonomy And The Start Of Hostilities"
    },
    {
        " that seized control of large parts of the ": null
    },
    {
        "Ferghana Valley": "Ferghana Valley"
    },
    {
        " and much of ": null
    },
    {
        "Turkestan": "Turkestan"
    },
    {
        ".     The fortunes of the decentralized movement fluctuated throughout the early 1920s but by 1923 the Red Armys extensive campaigns dealt the Basmachis many defeats. After major ": null
    },
    {
        "Red Army": "Red Army"
    },
    {
        " campaigns and concessions regarding economic and ": null
    },
    {
        "Islam": "Islam"
    },
    {
        "ic practices in the mid-1920s, the military fortunes and popular support of the Basmachi declined. Michael Rywkin, Moscows Muslim Challenge: Soviet Central Asia , 41. Resistance to Soviet/Russian rule did flare up again to a lesser extent in response to ": null
    },
    {
        "collectivization campaigns": "Collectivization In The Soviet Union"
    },
    {
        " in the pre-WWII Era. Martha B. Olcott, The Basmachi or Freemens Revolt in Turkestan, 1918-24, Soviet Studies, Vol. 33, No. 3 , 361.               In 1924, the ": null
    },
    {
        "Tajik Autonomous Soviet Socialist Republic": "Tajik Autonomous Soviet Socialist Republic"
    },
    {
        " was created as a part of ": null
    },
    {
        "Uzbekistan": "Uzbekistan"
    },
    {
        ", but when national borders were drawn in 1928  the ancient Tajik cities of ": null
    },
    {
        "Bukhara": "Bukhara"
    },
    {
        " and ": null
    },
    {
        "Samarkand": "Samarkand"
    },
    {
        " were placed outside the ": null
    },
    {
        "Tajikistan SSR": "Tajik Soviet Socialist Republic"
    },
    {
        ". As citizens of the newly established ": null
    },
    {
        "Uzbek SSR": "Uzbek Ssr"
    },
    {
        ", many Tajiks came under pressure to conform to their newly ascribed Uzbek identity, and under threat of exile, many were ": null
    },
    {
        "forced to change their identity": "Uzbekization"
    },
    {
        " and sign in passports as Uzbeks . Tajik schools were closed and Tajiks were not appointed to leadership positions simply because of their ethnicity.     Between 1927 and 1934 ": null
    },
    {
        "collectivization": "Collectivization"
    },
    {
        " of agriculture and a rapid expansion of cotton production took place, especially in the southern region. Collectivization, U.S. Library of Congress,  Soviet collectivization policy brought violence against peasants and forced resettlement occurred throughout Tajikistan. Consequently, some peasants fought collectivization and revived the ": null
    },
    {
        "Basmachi movement": "Basmachi Movement"
    },
    {
        ". Some small scale industrial development also occurred during this time along with the expansion of irrigation infrastructure.     Two rounds of Soviet purges directed by Moscow resulted in the expulsion of nearly 10,000 people, from all levels of the ": null
    },
    {
        "Communist Party of Tajikistan": "Communist Party Of Tajikistan"
    },
    {
        ". The Purges, U.S. Library of Congress, Tajikistan Country study, 1996,  Ethnic Russians were sent in to replace those expelled and subsequently Russians dominated party positions at all levels, including the top position of first secretary. Between 1926 and 1959 the proportion of ": null
    },
    {
        "Russians": "Russians"
    },
    {
        " among Tajikistans population grew from less than 1% to 13%. , U.S. Library of Congress ": null
    },
    {
        "Bobojon Ghafurov": "Bobojon Ghafurov"
    },
    {
        ", Tajikistans ": null
    },
    {
        "First Secretary of the Communist Party of Tajikistan": "First Secretary Of The Communist Party Of Tajikistan"
    },
    {
        " from 1946–1956 was the only Tajikistani politician of significance outside the country during the Soviet Era. He was followed in office by ": null
    },
    {
        "Tursun Uljabayev": "Tursun Uljabayev"
    },
    {
        " , ": null
    },
    {
        "Jabbor Rasulov": "Jabbor Rasulov"
    },
    {
        " , and ": null
    },
    {
        "Rahmon Nabiyev": "Rahmon Nabiyev"
    },
    {
        " .     Tajiks began to be conscripted into the Soviet Army in 1939 and during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " around 260,000 Tajik citizens fought against Germany, Finland and Japan. Between 60,000 Historical Dictionary of Tajikistan, by Kamoludin Abdullaev, Shahram Akbarzaheh, 2010, second edition, pg 383 and 120,000 Vadim Erlikman. Poteri narodonaseleniia v XX veke spravochnik. Moscow 2004; , pp. 23–35 of Tajikistans 1,530,000 citizens were killed during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ". Tajikistan, viewed 2014,  Following the war and Stalins reign attempts were made to further expand the agriculture and industry of Tajikistan. Post War Period, U.S. Library of Congress,  During 1957–58 ": null
    },
    {
        "Nikita Khrushchevs": "Nikita Khrushchev"
    },
    {
        " Virgin Lands Campaign": "Virgin Lands Campaign"
    },
    {
        " focused attention on Tajikistan, where living conditions, education and industry lagged behind the other ": null
    },
    {
        "Soviet Republics": "Republics Of The Soviet Union"
    },
    {
        ".     In the 1980s, Tajikistan had the lowest household saving rate in the USSR, Boris Rumer, Soviet Central Asia: A Tragic Experiment, Unwin Hyman, London, 1989, p. 126. the lowest percentage of households in the two top per capita income groups, Statistical Yearbook of the USSR 1990, Goskomstat, Moscow, 1991, p. 115 . and the lowest rate of university graduates per 1000 people. Statistical Yearbook of the USSR 1990, Goskomstat, Moscow, 1991, p. 210 .        Living standards were undermined during the tenure of Kahar Mahkamov as first secretary of the Communist Party of Tajikistan from 1985. Mahkamovs attempted marketisation of the Tajik economy aggravated the poor living conditions and unemployment. On the eve of the Soviet collapse Tajikistan was suffering from a declining economy and dim prospects for recovery. The ": null
    },
    {
        "glasnost": "Glasnost"
    },
    {
        " policy of openness initiated by ": null
    },
    {
        "Mikhil Gorbachev": "Mikhil Gorbachev"
    },
    {
        " offered disgruntled Tajiks a chance to voice their grievances. In 1991, the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " collapsed, and Tajikistan ": null
    },
    {
        "declared its independence": "Independence Day"
    },
    {
        ".             The Tajikistan Soviet Socialist Republic was among the last republics of the Soviet Union to declare its independence. On September 9 , following the collapse of the Union of Soviet Socialist Republics , Tajikistan declared its independence. During this time, use of the ": null
    },
    {
        "Tajik language": "Tajik Language"
    },
    {
        ", an official language of the Tajikistan SSR next to Russian, was increasingly promoted. Ethnic Russians, who had held many governing posts, lost much of their influence and more Tajiks became politically active.     The nation almost immediately fell into a civil war that involved various factions fighting one another; these factions were often distinguished by clan loyalties. The non-Muslim population, particularly Russians and Jews, fled the country during this time because of persecution, increased poverty and better economic opportunities in the West or in other former Soviet republics.     ": null
    },
    {
        "Emomali Rahmon": "Emomali Rahmon"
    },
    {
        " came to power in 1994, and continues to rule to this day. Ethnic cleansing was controversial during the ": null
    },
    {
        "civil war in Tajikistan": "Civil War In Tajikistan"
    },
    {
        ". By the end of the war Tajikistan was in a state of complete devastation. The estimated dead numbered over 100,000. Around 1.2 million people were ": null
    },
    {
        "refugees": "Refugee"
    },
    {
        " inside and outside the country. . United Nations In 1997, a ": null
    },
    {
        "ceasefire": "Ceasefire"
    },
    {
        " was reached between Rahmon and opposition parties .     Peaceful elections were held in 1999, but they were reported by the opposition as unfair, and Rahmon was re-elected by almost unanimous vote. ": null
    },
    {
        "Russia": "Russia"
    },
    {
        "n troops were stationed in southern Tajikistan, in order to guard the border with ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        ", until summer 2005. Since the ": null
    },
    {
        "September 11, 2001 attacks": "September 11, 2001 Attacks"
    },
    {
        ", ": null
    },
    {
        "American": "United States"
    },
    {
        ", ": null
    },
    {
        "India": "India"
    },
    {
        "n and ": null
    },
    {
        "French": "France"
    }
]