[
    {
        "            The History of Oceania includes the ": null
    },
    {
        "history of Australia": "History Of Australia"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "History Of New Zealand"
    },
    {
        ", ": null
    },
    {
        "Papua New Guinea": "History Of Papua New Guinea"
    },
    {
        ", ": null
    },
    {
        "Fiji": "History Of Fiji"
    },
    {
        " and other ": null
    },
    {
        "Pacific island nations": "History Of The Pacific Islands"
    },
    {
        ".         The prehistory of Oceania is divided into the prehistory of each of its major areas: ": null
    },
    {
        "Polynesia": "Polynesiaorigins And Expansion"
    },
    {
        ", ": null
    },
    {
        "Micronesia": "Micronesiaprehistory"
    },
    {
        ", ": null
    },
    {
        "Melanesia": "Melanesiahistory"
    },
    {
        ", and ": null
    },
    {
        "Australasia": "Prehistory Of Australia"
    },
    {
        ", and these vary greatly as to when they were first inhabited by humans—from 70,000 years ago to 3,000 years ago .            The Polynesian people are considered to be by linguistic, archaeological and human genetic ancestry a subset of the sea-migrating ": null
    },
    {
        "Austronesian people": "Austronesian People"
    },
    {
        " and tracing ": null
    },
    {
        "Polynesian languages": "Polynesian Languages"
    },
    {
        " places their ": null
    },
    {
        "prehistoric": "Prehistory"
    },
    {
        " origins in the ": null
    },
    {
        "Malay Archipelago": "Malay Archipelago"
    },
    {
        ", and ultimately, in ": null
    },
    {
        "Taiwan": "Geography Of Taiwan"
    },
    {
        ". Between about 3000 and 1000 BCE speakers of ": null
    },
    {
        "Austronesian languages": "Austronesian Languages"
    },
    {
        " began spreading from Taiwan into ": null
    },
    {
        "Island South-East Asia": "Island Southeast Asia"
    },
    {
        ",    as tribes whose ": null
    },
    {
        "natives": "Taiwanese Aborigines"
    },
    {
        " were thought to have arrived through South China about 8,000 years ago to the edges of western ": null
    },
    {
        "Micronesia": "Micronesia"
    },
    {
        " and on into ": null
    },
    {
        "Melanesia": "Melanesia"
    },
    {
        ", although they are different from the ": null
    },
    {
        "Han Chinese": "Han Chinese"
    },
    {
        " who now form the majority of people in China and Taiwan. There are three theories regarding the spread of humans across the Pacific to Polynesia. These are outlined well by Kayser et al.  and are as follows:   Express Train model: A recent expansion out of Taiwan, via the ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        " and eastern ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        " and from the north-west  of ": null
    },
    {
        "New Guinea": "New Guinea"
    },
    {
        ", on to ": null
    },
    {
        "Island Melanesia": "Island Melanesia"
    },
    {
        " by roughly 1400 BCE, reaching western Polynesian islands right about 900 BCE. This theory is supported by the majority of current human genetic data, ": null
    },
    {
        "linguistic": "Austronesian Languages"
    },
    {
        " data, and archaeological data   Entangled Bank model: Emphasizes the long history of Austronesian speakers cultural and genetic interactions with indigenous Island South-East Asians and Melanesians along the way to becoming the first Polynesians.   Slow Boat model: Similar to the express-train model but with a longer hiatus in Melanesia along with admixture, both genetically, culturally and linguistically with the local population. This is supported by the Y-chromosome data of Kayser et al. , which shows that all three ": null
    },
    {
        "haplotypes": "Haplotype"
    },
    {
        " of Polynesian Y chromosomes can be traced back to Melanesia.      In the archaeological record there are well-defined traces of this expansion which allow the path it took to be followed and dated with some certainty. It is thought that by roughly 1400 BCE,  Quoted in Kayser, M.; et al. . ": null
    },
    {
        "Lapita": "Lapita"
    },
    {
        " Peoples , so-named after their pottery tradition, appeared in the ": null
    },
    {
        "Bismarck Archipelago": "Bismarck Archipelago"
    },
    {
        " of north-west ": null
    },
    {
        "Melanesia": "Melanesia"
    },
    {
        ". This culture is seen as having adapted and evolved through time and space since its emergence Out of ": null
    },
    {
        "Taiwan": "Taiwan"
    },
    {
        " . They had given up rice production, for instance, after encountering and adapting to breadfruit in the Birds Head area of New Guinea. In the end, the most eastern site for Lapita archaeological remains recovered so far has been through work on the ": null
    },
    {
        "archaeology in Samoa": "Archaeology In Samoa"
    },
    {
        ". The site is at ": null
    },
    {
        "Mulifanua": "Mulifanua"
    },
    {
        " on ": null
    },
    {
        "Upolu": "Upolu"
    },
    {
        ". The Mulifanua site, where 4,288 pottery shards have been found and studied, has a true age of c. 1000 BCE based on C14 dating.  A 2010 study places the beginning of the human archaeological sequences of Polynesia in ": null
    },
    {
        "Tonga": "Tonga"
    },
    {
        " at 900 BCE,  the small differences in dates with Samoa being due to differences in radiocarbon dating technologies between 1989 and 2010, the Tongan site apparently predating the Samoan site by some few decades in real time.     Within a mere three or four centuries between about 1300 and 900 BCE, the Lapita ": null
    },
    {
        "archaeological culture": "Archaeological Culture"
    },
    {
        " spread 6,000 kilometres further to the east from the Bismarck Archipelago, until it reached as far as ": null
    },
    {
        "Fiji": "Fiji"
    },
    {
        ", ": null
    },
    {
        "Tonga": "Tonga"
    },
    {
        ", and ": null
    },
    {
        "Samoa": "Samoa"
    },
    {
        ".  PV Kirch. 1997. The Lapita Peoples. Cambridge: Blackwell Publisher The area of Tonga, Fiji, and Samoa served as a gateway into the rest of the Pacific region known as Polynesia.  Ancient Tongan mythologies recorded by early European explorers report the islands of Ata and Tongatapu as the first islands being hauled to the surface from the deep ocean by Maui. Honolulu: The Museum ": null
    },
    {
        "John Martin": "John Martin"
    },
    {
        ". 2005 . William Mariner: An Account of the Natives of the Tonga Islands in the South Pacific Ocean. Vol. 1. Elibron Classics          The ": null
    },
    {
        " Tuʻi Tonga Empire ": "Tui Tonga Empire"
    },
    {
        " or Tongan Empire in ": null
    },
    {
        "Oceania": "Oceania"
    },
    {
        " are descriptions sometimes given to Tongan expansionism and projected hegemony dating back to 950 CE, but at its peak during the period 1200–1500. While modern researchers and cultural experts attest to widespread Tongan influence and evidences of transoceanic trade and exchange of material and non-material cultural artifacts, ": null
    },
    {
        "empirical evidence": "Empirical Evidence"
    },
    {
        " of a true political empire ruled for any length of time by successive rulers is lacking. The Pacific Islands: An Encyclopedia , edited by Lal and Fortune, p. 133     Modern archeology, anthropology and linguistic studies confirm widespread Tongan cultural influence ranging widely   2008: Vol 21. University of Otago Studies in Prehistoric Anthropology. , Patrick Vinton Kirch; Roger C. Green through East Uvea, Rotuma, Futuna, Samoa and Niue, parts of Micronesia , Vanuatu, and New Caledonia and the Loyalty Islands, , Geraghty, P., 1994 in Language Contact and Change in the Austronesian World: pp. 236–39. and while some academics prefer the term maritime chiefdom ,  others argue that, while very different from examples elsewhere, ... empire is probably the most convenient term. Neich, R. 2006 in K.R. Howe Vaka Moana, voyages of the ancestors: the discovery and settlement of the Pacific: 198–245. Auckland: David Bateman. p. 230     ": null
    },
    {
        "Pottery": "Pottery"
    },
    {
        " art from Fijian towns shows that Fiji was settled before or around 3500 to 1000  BC, although the question of Pacific migration still lingers. It is believed that the ": null
    },
    {
        "Lapita people": "Lapita People"
    },
    {
        " or the ancestors of the ": null
    },
    {
        "Polynesians": "Polynesians"
    },
    {
        " settled the islands first but not much is known of what became of them after the ": null
    },
    {
        "Melanesians": "Melanesians"
    },
    {
        " arrived; they may have had some influence on the new culture, and archaeological evidence shows that they would have then moved on to ": null
    },
    {
        "Tonga": "Tonga"
    },
    {
        ", ": null
    },
    {
        "Samoa": "Samoa"
    },
    {
        " and even Hawaii.     The first settlements in Fiji were started by voyaging traders and settlers from the west about 5000 years ago. ": null
    },
    {
        "Lapita": "Lapita"
    },
    {
        " pottery shards have been found at numerous excavations around the country. Aspects of Fijian culture are similar to the Melanesian culture of the western ": null
    },
    {
        "Pacific": "Pacific Ocean"
    },
    {
        " but have a stronger connection to the older Polynesian cultures. Across  from east to west, Fiji has been a nation of many languages. Fijis history was one of settlement but also of mobility.     Over the centuries, a unique Fijian culture developed. Constant warfare and ": null
    },
    {
        "cannibalism": "Cannibalism"
    },
    {
        " between warring tribes were quite rampant and very much part of everyday life. Sanday, Peggy Reeves https://books.google.com/books?idSYW6EzB9rYkC & pgPA151 Divine hunger: cannibalism as a cultural system, Cambridge University Press, p. 151, IBNS 0521311144. In later centuries, the ferocity of the cannibal lifestyle deterred European sailors from going near Fijian waters, giving Fiji the name Cannibal Isles; as a result, Fiji remained unknown to the rest of the world. , ": null
    },
    {
        "Central Queensland University": "Central Queensland University"
    },
    {
        ".          Early European visitors to Easter Island recorded the local oral traditions about the original settlers. In these traditions, Easter Islanders claimed that a chief ": null
    },
    {
        "Hotu Matua": "Hotu Matua"
    },
    {
        " Resemblance of the name to an early ": null
    },
    {
        "Mangareva": "Mangareva"
    },
    {
        "n founder god  Atu Motua  has made some historians suspect that Hotu Matua was added to Easter Island mythology only in the 1860s, along with adopting the Mangarevan language. The real founder would have been  Tuu ko Iho , who became just a supporting character in Hotu Matua centric legends. See Steven Fischer . Rapanuis Tuu ko Iho Versus Mangarevas Atu Motua. Evidence for Multiple Reanalysis and Replacement in Rapanui Settlement Traditions, Easter Island. The Journal of Pacific History, 29, 3–18. See also Rapa Nui / Geography, History and Religion. Peter H. Buck, Vikings of the Pacific, University of Chicago Press, 1938. pp. 228–36. . arrived on the island in one or two large canoes with his wife and extended family. . They are believed to have been ": null
    },
    {
        "Polynesian": "Polynesians"
    },
    {
        ". There is considerable uncertainty about the accuracy of this legend as well as the date of settlement. Published literature suggests the island was settled around 300–400 ": null
    },
    {
        "CE": "Common Era"
    },
    {
        ", or at about the time of the arrival of the earliest settlers in ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        ".     Some scientists say that Easter Island was not inhabited until 700–800 CE. This date range is based on ": null
    },
    {
        "glottochronological": "Glottochronology"
    },
    {
        " calculations and on three ": null
    },
    {
        "radiocarbon dates": "Radiocarbon Dating"
    },
    {
        " from charcoal that appears to have been produced during forest clearance activities. ": null
    },
    {
        "Diamond, Jared": "Jared Diamond"
    },
    {
        ".  Collapse: How Societies Choose to Fail or Succeed . Penguin Books: 2005. . Chapter 2: Twilight at Easter pp. 79–119. See p. 89.     Moreover, a recent study which included radiocarbon dates from what is thought to be very early material suggests that the island was settled as recently as 1200 CE. Hunt, T.L., Lipo, C.P., 2006. Science, 1121879. See also  in Science Magazine.   is also hosted by the Department of Anthropology of the University of Hawaii. This seems to be supported by a 2006 study of the islands deforestation, which could have started around the same time.   A large now ": null
    },
    {
        "extinct": "Extinction"
    },
    {
        " palm": "Arecaceae"
    },
    {
        ",  Paschalococos disperta, related to the ": null
    },
    {
        "Chilean wine palm": "Chilean Wine Palm"
    },
    {
        " , was one of the dominant trees as attested by fossil evidence; this species, whose sole occurrence was Easter Island, became extinct due to deforestation by the early settlers. C. Michael Hogan               Micronesia began to be settled several millennia ago, although there are competing theories about the origin and arrival of the first settlers. There are numerous difficulties with conducting archaeological excavations in the islands, due to their size, settlement patterns and storm damage. As a result, much evidence is based on linguistic analysis. The earliest archaeological traces of civilization have been found on the island of ": null
    },
    {
        "Saipan": "Saipan"
    },
    {
        ", dated to 1500 BCE or slightly before.     The ancestors of the Micronesians settled there over 4,000 years ago. A decentralized chieftain-based system eventually evolved into a more centralized economic and religious culture centered on ": null
    },
    {
        "Yap": "Yap"
    },
    {
        " and ": null
    },
    {
        "Pohnpei": "Pohnpei"
    },
    {
        ".  The prehistory of many Micronesian islands such as Yap are not known very well.              On ": null
    },
    {
        "Pohnpei": "Pohnpei"
    },
    {
        ", pre-colonial history is divided into three eras: Mwehin Kawa or Mwehin Aramas ; Mwehin Sau Deleur ; and Mwehin Nahnmwarki  .   Pohnpeian legend recounts that the Saudeleur rulers, the first to bring government to Pohnpei, were of foreign origin. The Saudeleur centralized form of absolute rule is characterized in Pohnpeian legend as becoming increasingly oppressive over several generations. Arbitrary and onerous demands, as well as a reputation for offending Pohnpeian deities, sowed resentment among Pohnpeians. The Saudeleur Dynasty ended with the invasion of ": null
    },
    {
        "Isokelekel": "Isokelekel"
    },
    {
        ", another semi-mythical foreigner, who replaced the Saudeleur rule with the more decentralized  nahnmwarki  system in existence today.    Isokelekel is regarded as the creator of the modern Pohnpeian  nahnmwarki  social system and the father of the Pompeian people.      Construction of ": null
    },
    {
        "Nan Madol": "Nan Madol"
    },
    {
        ", a ": null
    },
    {
        "megalith": "Megalith"
    },
    {
        "ic complex made from ": null
    },
    {
        "basalt lava logs": "Basaltcolumnar Basalt"
    },
    {
        " in Pohnpei began as early as 1200 CE. Nan Madol is offshore of ": null
    },
    {
        "Temwen Island": "Temwen Island"
    },
    {
        " near ": null
    },
    {
        "Pohnpei": "Pohnpei"
    },
    {
        ", consists of a series of small ": null
    },
    {
        "artificial islands": "Artificial Island"
    },
    {
        " linked by a network of canals, and is often called the  Venice of the Pacific. It is located near the island of ": null
    },
    {
        "Pohnpei": "Pohnpei"
    },
    {
        " and was the ceremonial and political seat of the ": null
    },
    {
        "Saudeleur Dynasty": "Saudeleur Dynasty"
    },
    {
        " that united Pohnpeis estimated 25,000 people until its centralized system collapsed amid the invasion of ": null
    },
    {
        "Isokelekel": "Isokelekel"
    },
    {
        ". Isokelekel and his descendants initially occupied the stone city, but later abandoned it.     The first people of the Northern Mariana Islands navigated to the islands at some period between 4000 BCE to 2000 BCE from ": null
    },
    {
        "South-East Asia": "South-East Asia"
    },
    {
        ". They became known as the ": null
    },
    {
        "Chamorros": "Chamorro People"
    },
    {
        ", and spoke an ": null
    },
    {
        "Austronesian language": "Austronesian Languages"
    },
    {
        " called ": null
    },
    {
        "Chamorro": "Chamorro Language"
    },
    {
        ". The ancient Chamorro left a number of megalithic ruins, including ": null
    },
    {
        "Latte stone": "Latte Stone"
    },
    {
        ". The Refaluwasch, or Carolinian, people came to the Marianas in the 1800s from the ": null
    },
    {
        "Caroline Islands": "Caroline Islands"
    },
    {
        ". Micronesian colonists gradually settled the Marshall Islands during the ": null
    },
    {
        "2nd millennium BCE": "2Nd Millennium Bce"
    },
    {
        ", with inter-island navigation made possible using ": null
    },
    {
        "traditional stick charts": "Marshall Islands Stick Chart"
    },
    {
        ".   by Professor Friedrich Ratzel, Book II, Section A, The Races of Oceania p. 165, picture of a stick chart from the Marshall Islands. MacMillan and Co., published 1896.                 The first settlers of Australia, New Guinea, and the large islands just to the east arrived between 50,000 and 30,000 years ago, when ": null
    },
    {
        "Neanderthals": "Neanderthals"
    },
    {
        " still roamed Europe. The original inhabitants of the group of islands now named Melanesia were likely the ancestors of the present-day ": null
    },
    {
        "Papuan": "Papuan Languages"
    },
    {
        "-speaking people. Migrating from South-East Asia, they appear to have occupied these islands as far east as the main islands in the ": null
    },
    {
        "Solomon Islands archipelago": "Solomon Islands"
    },
    {
        ", including ": null
    },
    {
        "Makira": "Makira"
    },
    {
        " and possibly the smaller islands farther to the east.      Particularly along the north coast of New Guinea and in the islands north and east of New Guinea, the ": null
    },
    {
        "Austronesian people": "Austronesian People"
    },
    {
        ", who had migrated into the area somewhat more than 3,000 years ago, came into contact with these pre-existing populations of Papuan-speaking peoples. In the late 20th century, some scholars theorized a long period of interaction, which resulted in many complex changes in genetics, languages, and culture among the peoples.  Kayser, et al. proposed that, from this area, a very small group of people  departed to the east to become the forebears of the ": null
    },
    {
        "Polynesian people": "Polynesian Peoples"
    },
    {
        ".           However, the theory is contradicted by the findings of a ": null
    },
    {
        "genetic study": "Genetic Study"
    },
    {
        " published by ": null
    },
    {
        "Temple University": "Temple University"
    },
    {
        " in 2008; based on genome scans and evaluation of more than 800 genetic markers among a wide variety of Pacific peoples, it found that neither Polynesians nor Micronesians have much genetic relation to Melanesians. Both groups are strongly related genetically to East Asians, particularly ": null
    },
    {
        "Taiwanese aborigines": "Taiwanese Aborigines"
    },
    {
        ". It appeared that, having developed their sailing outrigger canoes, the Polynesian ancestors migrated from East Asia, moved through the Melanesian area quickly on their way, and kept going to eastern areas, where they settled. They left little genetic evidence in Melanesia.     The study found a high rate of genetic differentiation and diversity among the groups living within the Melanesian islands, with the peoples distinguished by island, language, topography, and geography among the islands. Such diversity developed over their tens of thousands of years of settlement before the Polynesian ancestors ever arrived at the islands. For instance, populations developed differently in coastal areas, as opposed to those in more isolated mountainous valleys. , Press Release, Temple University, 18 January 2008, accessed 9 March 2013      Additional DNA analysis has taken research into new directions, as more human species have been discovered since the late 20th century. Based on his genetic studies of the ": null
    },
    {
        "Denisova hominin": "Denisova Hominin"
    },
    {
        ", an ancient human species discovered in 2010, ": null
    },
    {
        "Svante Pääbo": "Svante Pääbo"
    },
    {
        " claims that ancient human ancestors of the Melanesians interbred in Asia with these humans. He has found that people of New Guinea share 4–6% of their genome with the Denisovans, indicating this exchange.  The Denisovans are considered cousin to the Neanderthals; both groups are now understood to have migrated out of Africa, with the Neanderthals going into Europe, and the Denisovans heading east about 400,000 years ago. This is based on genetic evidence from a fossil found in ": null
    },
    {
        "Siberia": "Siberia"
    },
    {
        ". The evidence from Melanesia suggests their territory extended into south Asia, where ancestors of the Melanesians developed.     Melanesians of some islands are one of the few non-European peoples, and the only dark-skinned group of people outside Australia, known to have blond hair.            Indigenous Australians are the original inhabitants of the ": null
    },
    {
        "Australian continent": "Australia"
    },
    {
        " and nearby islands.  Indigenous Australians migrated from Africa to Asia around 70,000 years ago  and arrived in Australia around 50,000 years ago. , Biotechnology and Biological Sciences Research Council .  The ": null
    },
    {
        "Torres Strait Islanders": "Torres Strait Islanders"
    },
    {
        " are indigenous to the ": null
    },
    {
        "Torres Strait": "Torres Strait"
    },
    {
        " Islands, which are at the northernmost tip of Queensland near ": null
    },
    {
        "Papua New Guinea": "Papua New Guinea"
    },
    {
        ". The term Aboriginal is traditionally applied to only the ": null
    },
    {
        "indigenous inhabitants of mainland Australia": "Aboriginal Australians"
    },
    {
        " and ": null
    },
    {
        "Tasmania": "Tasmania"
    },
    {
        ", along with some of the adjacent islands, i.e.: the first peoples . Indigenous Australians is an inclusive term used when referring to both Aboriginal and Torres Strait islanders.     The earliest definite human remains found to date are that of ": null
    },
    {
        "Mungo Man": "Mungo Man"
    },
    {
        ", which have been dated at about 40,000 years old, but the time of arrival of the ancestors of Indigenous Australians is a matter of debate among researchers, with estimates dating back as far as 125,000 years ago. , University of Wollongong, 2004. Retrieved 6 June 2008. There is great diversity among different Indigenous communities and societies in Australia, each with its own unique mixture of cultures, customs and languages. In present-day Australia these groups are further divided into local communities. , The Australian Journal of Media & Culture, vol. 3 no 3, 1990. Retrieved 6 June 2008.                    Oceania was first explored by Europeans from the 16th century onwards. Portuguese navigators, between 1512 and 1526, reached the ": null
    },
    {
        "Moluccas": "Moluccas"
    },
    {
        " , ": null
    },
    {
        "Timor": "Timor"
    },
    {
        ", the ": null
    },
    {
        "Aru Islands": "Aru Islands Regency"
    },
    {
        " , the ": null
    },
    {
        "Tanimbar Islands": "Tanimbar Islands"
    },
    {
        ", some of the ": null
    },
    {
        "Caroline Islands": "Caroline Islands"
    },
    {
        " , and west ": null
    },
    {
        "Papua New Guinea": "Papua New Guinea"
    },
    {
        " . In 1519 a ": null
    },
    {
        "Castilian": "Crown Of Castile"
    },
    {
        "  expedition led by ": null
    },
    {
        "Ferdinand Magellan": "Ferdinand Magellan"
    },
    {
        " sailed down the east coast of South America, found and sailed through the ": null
    },
    {
        "strait that bears his name": "Strait Of Magellan"
    },
    {
        " and on 28 November 1520 entered the ocean which he named Pacific . The three remaining ships, led by Magellan and his captains ": null
    },
    {
        "Duarte Barbosa": "Duarte Barbosa"
    },
    {
        " and ": null
    },
    {
        "João Serrão": "João Serrão"
    },
    {
        ", then sailed north and caught the ": null
    },
    {
        "trade winds": "Trade Winds"
    },
    {
        " which carried them across the Pacific to the Philippines where Magellan was killed. One surviving ship led by ": null
    },
    {
        "Juan Sebastián Elcano": "Juan Sebastián Elcano"
    },
    {
        " returned west across the Indian Ocean and ": null
    },
    {
        "the other": "Trinidad"
    },
    {
        " went north in the hope of finding the ": null
    },
    {
        "westerlies": "Westerlies"
    },
    {
        " and reaching Mexico. Unable to find the right winds, it was forced to return to the East Indies. The ": null
    },
    {
        "Magellan-Elcano": "Timeline Of Magellans Circumnavigation"
    },
    {
        " expedition achieved the first ": null
    },
    {
        "circumnavigation": "Circumnavigation"
    },
    {
        " of the world and reached the ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        ", the ": null
    },
    {
        "Mariana Islands": "Mariana Islands"
    },
    {
        " and other islands of Oceania.          From 1527 to 1595 a number of other large Spanish expeditions crossed the Pacific Ocean, leading to the discovery of the ": null
    },
    {
        "Marshall Islands": "Marshall Islands"
    },
    {
        " and ": null
    },
    {
        "Palau": "Palau"
    },
    {
        " in the North Pacific, as well as ": null
    },
    {
        "Tuvalu": "Tuvalu"
    },
    {
        ", the ": null
    },
    {
        "Marquesas": "Marquesas Islands"
    },
    {
        ", the ": null
    },
    {
        "Solomon Islands archipelago": "Solomon Islands"
    },
    {
        ", the ": null
    },
    {
        "Cook Islands": "Cook Islands"
    },
    {
        " and the ": null
    },
    {
        "Admiralty Islands": "Admiralty Islands"
    },
    {
        " in the South Pacific.      In 1565, Spanish navigator ": null
    },
    {
        "Andrés de Urdaneta": "Andrés De Urdaneta"
    },
    {
        " found a wind system that would allow ships to sail eastward from Asia, back to the Americas. From then until 1815 the annual ": null
    },
    {
        "Manila Galleons": "Manila Galleons"
    },
    {
        " crossed the Pacific from Mexico to the Philippines and back, in the first transpacific trade route in history. Combined with the Spanish Atlantic or ": null
    },
    {
        "West Indies Fleet": "West Indies Fleet"
    },
    {
        ", the Manila Galleons formed one of the first global maritime exchange in human history, linking Seville in Spain with Manila in the Philippines, via Mexico.     Later, in the quest for ": null
    },
    {
        "Terra Australis": "Terra Australis"
    },
    {
        ", Spanish explorers in the 17th century discovered the ": null
    },
    {
        "Pitcairn": "Pitcairn Islands"
    },
    {
        " and ": null
    },
    {
        "Vanuatu": "Vanuatu"
    },
    {
        " archipelagos, and sailed the ": null
    },
    {
        "Torres Strait": "Torres Strait"
    },
    {
        " between ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " and New Guinea, named after navigator ": null
    },
    {
        "Luís Vaz de Torres": "Luís Vaz De Torres"
    },
    {
        ". In 1668 the Spanish founded a colony on ": null
    },
    {
        "Guam": "Guam"
    },
    {
        " as a resting place for west-bound galleons. For a long time this was the only non-coastal European settlement in the Pacific.                    The Dutch were the first non-natives to undisputedly explore and chart coastlines of ": null
    },
    {
        "Australia": "European Maritime Exploration Of Australia"
    },
    {
        ", ": null
    },
    {
        "Tasmania": "History Of Tasmania"
    },
    {
        ", ": null
    },
    {
        "New Zealand": "History Of New Zealand"
    },
    {
        ", ": null
    },
    {
        "Tonga": "History Of Tonga"
    },
    {
        ", ": null
    },
    {
        "Fiji": "History Of Fiji"
    },
    {
        ", ": null
    },
    {
        "Samoa": "History Of Samoa"
    },
    {
        ", and ": null
    },
    {
        "Easter Island": "History Of Easter Island"
    },
    {
        ". ": null
    },
    {
        "Verenigde Oostindische Compagnie": "Verenigde Oostindische Compagnie"
    },
    {
        " was a major force behind the ": null
    },
    {
        "Golden Age of Dutch exploration": ":Category:Dutch Exploration In The Age Of Discovery"
    },
    {
        " and ": null
    },
    {
        "Netherlandish cartography": "History Of Cartographynetherlandish Cartography In The Age Of Discovery"
    },
    {
        " . In the 17th century, the VOCs navigators and explorers ": null
    },
    {
        "charted almost three-quarters of the Australian coastline": "European Maritime Exploration Of Australia"
    },
    {
        ", except the east coast.       ": null
    },
    {
        "Abel Tasman": "Abel Tasman"
    },
    {
        " was the first known European explorer to reach the islands of ": null
    },
    {
        "Van Diemens Land": "Van Diemens Land"
    },
    {
        "  and New Zealand, and to sight the ": null
    },
    {
        "Fiji": "Fiji"
    },
    {
        " islands. His navigator François Visscher, and his merchant ": null
    },
    {
        "Isaack Gilsemans": "Isaack Gilsemans"
    },
    {
        ", mapped substantial portions of Australia, New Zealand, Tonga and the Fijian islands.       On 24 November 1642 Abel Tasman sighted the west coast of Tasmania, north of Macquarie Harbour.  He named his discovery Van Diemens Land after ": null
    },
    {
        "Antonio van Diemen": "Antonio Van Diemen"
    },
    {
        ", ": null
    },
    {
        "Governor-General of the Dutch East Indies": "Governor-General Of The Dutch East Indies"
    },
    {
        ". then claimed formal possession of the land on 3 December 1642.       After some exploration, Tasman had intended to proceed in a northerly direction but as the wind was unfavourable he steered east. On 13 December they sighted land on the north-west coast of the ": null
    },
    {
        "South Island": "South Island"
    },
    {
        ", New Zealand, becoming the first Europeans to do so.  Tasman named it Staten Landt on the assumption that it was connected to an island  at the south of the tip of South America. Proceeding north and then east, he stopped to gather water, but one of his boats was attacked by ": null
    },
    {
        "Māori": "Māori People"
    },
    {
        " in a double hulled ": null
    },
    {
        "waka": "Waka"
    },
    {
        " and four of his men were attacked and killed by ": null
    },
    {
        "mere": "Mere"
    },
    {
        ". As Tasman sailed out of the bay he was again attacked, this time by 11 waka . The waka approached the Zeehan which fired and hit one Māori who fell down. Canister shot hit the side of a waka. Diary of Abel Tasman pp. 21–22. Random House. 2008     Archeological research has shown the Dutch had tried to land at a major agricultural area, which the Māori may have been trying to protect.  Tasman named the bay Murderers Bay  and sailed north, but mistook ": null
    },
    {
        "Cook Strait": "Cook Strait"
    },
    {
        " for a ": null
    },
    {
        "bight": "Bight"
    },
    {
        " . Two names he gave to New Zealand landmarks still endure, ": null
    },
    {
        "Cape Maria van Diemen": "Cape Maria Van Diemen"
    },
    {
        " and ": null
    },
    {
        "Three Kings Islands": "Three Kings Islands"
    },
    {
        ", but Kaap Pieter Boreels was renamed by Cook 125 years later to ": null
    },
    {
        "Cape Egmont": "Cape Egmont"
    },
    {
        ".     En route back to Batavia, Tasman came across the ": null
    },
    {
        "Tonga": "Tonga"
    },
    {
        "n archipelago on 20 January 1643. While passing the ": null
    },
    {
        "Fiji": "Fiji"
    },
    {
        " Islands Tasmans ships came close to being wrecked on the dangerous reefs of the north-eastern part of the Fiji group. He charted the eastern tip of ": null
    },
    {
        "Vanua Levu": "Vanua Levu"
    },
    {
        " and Cikobia before making his way back into the open sea. He eventually turned north-west to ": null
    },
    {
        "New Guinea": "New Guinea"
    },
    {
        ", and arrived at Batavia on 15 June 1643. For over a century after Tasmans voyages, until the era of ": null
    },
    {
        "James Cook": "James Cook"
    },
    {
        " Golden Age of Netherlandish cartography": "Golden Age Of Dutch Cartography"
    },
    {
        ". ": null
    },
    {
        "Australasia": "Australasia"
    },
    {
        " during the Golden Age of Dutch exploration and discovery : including ": null
    },
    {
        "Nova Guinea": "New Guineahistory"
    },
    {
        " , ": null
    },
    {
        "Nova Hollandia": "New Holland"
    },
    {
        " , ": null
    },
    {
        "Van Diemens Land": "Van Diemens Land"
    },
    {
        " , and ": null
    },
    {
        "Nova Zeelandia": "Nova Zeelandia"
    },
    {
        "  Bay of Islands": "Bay Of Islands"
    },
    {
        " Abel Tasman": "Abel Tasman"
    },
    {
        " Abel Tasman": "Abel Tasman"
    },
    {
        "  integrated within ": null
    },
    {
        "Asia": "Asia"
    },
    {
        " Dutch East India Company": "Dutch East India Company"
    },
    {
        "       Murderers Bay": "Golden Bay"
    },
    {
        ". Drawing by Isaack Gilsemans in ": null
    },
    {
        "Abel Tasmans": "Abel Tasman"
    },
    {
        " travel journal": "Travel Journal"
    },
    {
        " .  ": null
    },
    {
        "Tongatapu": "Tongatapu"
    },
    {
        " Tongatapu": "Tongatapu"
    },
    {
        " with the two ships, drawing by Isaack Gilsemans                      In 1766 the ": null
    },
    {
        "Royal Society": "Royal Society"
    },
    {
        " engaged ": null
    },
    {
        "James Cook": "James Cook"
    },
    {
        " to travel to the Pacific Ocean to observe and record the ": null
    },
    {
        "transit of Venus": "Transit Of Venus"
    },
    {
        " across the Sun. The expedition sailed from England on 26 August 1768,  rounded ": null
    },
    {
        "Cape Horn": "Cape Horn"
    },
    {
        " and continued westward across the Pacific to arrive at ": null
    },
    {
        "Tahiti": "Tahiti"
    },
    {
        " on 13 April 1769, where the ": null
    },
    {
        "observations of the Venus Transit": "1769 Transit Of Venus Observed From Tahiti"
    },
    {
        " were made. Once the observations were completed, Cook opened the sealed orders which were additional instructions from the ": null
    },
    {
        "Admiralty": "Admiralty"
    },
    {
        " for the second part of his voyage: to search the south Pacific for signs of the postulated rich southern ": null
    },
    {
        "continent": "Continent"
    },
    {
        " of  Terra Australis .      With the help of a Tahitian named ": null
    },
    {
        "Tupaia": "Tupaia"
    },
    {
        ", who had extensive knowledge of Pacific ": null
    },
    {
        "geography": "Geography"
    },
    {
        ", Cook managed to reach New Zealand on 6 October 1769, leading only the second group of ": null
    },
    {
        "Europeans": "European Ethnic Groups"
    },
    {
        " to do so . Cook mapped the complete New Zealand coastline, making only some minor errors . He also identified ": null
    },
    {
        "Cook Strait": "Cook Strait"
    },
    {
        ", which separates the ": null
    },
    {
        "North Island": "North Island"
    },
    {
        " from the South Island, and which Tasman had not seen.     Cook then voyaged west, reaching the south-eastern coast of Australia on 19 April 1770, and in doing so his expedition became the first recorded Europeans to have encountered its eastern coastline. At this time, the ": null
    },
    {
        "International Date Line": "International Date Line"
    },
    {
        " had yet to be established, so the dates in Cooks journal are a day earlier than those accepted today. On 23 April he made his first recorded direct observation of ": null
    },
    {
        "indigenous Australians": "Indigenous Australians"
    },
    {
        " at ": null
    },
    {
        "Brush Island": "Brush Island"
    },
    {
        " near ": null
    },
    {
        "Bawley Point": "Bawley Point, New South Wales"
    },
    {
        ", noting in his journal: …and were so near the Shore as to distinguish several people upon the Sea beach they appeard to be of a very dark or black Colour but whether this was the real colour of their skins or the C thes they might have on I know not.  On 29 April Cook and crew made their first landfall on the mainland of the continent at a place now known as the ": null
    },
    {
        "Kurnell Peninsula": "Cronulla Sand Dunes, Kurnell Peninsula"
    },
    {
        ". It is here that James Cook made first contact with an aboriginal tribe known as the ": null
    },
    {
        "Gweagal": "Gweagal"
    },
    {
        ".      After his departure from Botany Bay he continued northwards. After a grounding mishap on the ": null
    },
    {
        "Great Barrier Reef": "Great Barrier Reef"
    },
    {
        ", the voyage continued, sailing through ": null
    },
    {
        "Torres Strait": "Torres Strait"
    },
    {
        " before returning to England via ": null
    },
    {
        "Batavia": "History Of Jakarta"
    },
    {
        ", the ": null
    },
    {
        "Cape of Good Hope": "Cape Of Good Hope"
    },
    {
        ", and ": null
    },
    {
        "Saint Helena": "Saint Helena"
    },
    {
        ".                  In 1772 the Royal Society commissioned Cook to search for the hypothetical ": null
    },
    {
        "Terra Australis": "Terra Australis"
    },
    {
        " again. On his first voyage, Cook had demonstrated by circumnavigating New Zealand that it was not attached to a larger landmass to the south. Although he charted almost the entire eastern coastline of Australia, showing it to be continental in size, the Terra Australis was believed by the Royal Society to lie further south.      Cook commanded  on this voyage, while ": null
    },
    {
        "Tobias Furneaux": "Tobias Furneaux"
    },
    {
        " commanded its companion ship, . Cooks expedition circumnavigated the globe at an extreme southern ": null
    },
    {
        "latitude": "Latitude"
    },
    {
        ", becoming one of the first to cross the ": null
    },
    {
        "Antarctic Circle": "Antarctic Circle"
    },
    {
        " . In the Antarctic fog, Resolution and Adventure became separated. Furneaux made his way to New Zealand, where he lost some of his men during an encounter with ": null
    },
    {
        "Māori": "Māori People"
    },
    {
        ", and eventually sailed back to Britain, while Cook continued to explore the Antarctic, reaching 71°10S on 31 January 1774.          Cook almost encountered the mainland of ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        ", but turned towards Tahiti to resupply his ship. He then resumed his southward course in a second fruitless attempt to find the supposed continent. On this leg of the voyage he brought a young Tahitian named ": null
    },
    {
        "Omai": "Omai"
    },
    {
        ", who proved to be somewhat less knowledgeable about the Pacific than ": null
    },
    {
        "Tupaia": "Tupaia"
    },
    {
        " had been on the first voyage. On his return voyage to New Zealand in 1774, Cook landed at the ": null
    },
    {
        "Friendly Islands": "Tonga"
    },
    {
        ", ": null
    },
    {
        "Easter Island": "Easter Island"
    },
    {
        ", ": null
    },
    {
        "Norfolk Island": "Norfolk Island"
    },
    {
        ", ": null
    },
    {
        "New Caledonia": "New Caledonia"
    },
    {
        ", and ": null
    },
    {
        "Vanuatu": "Vanuatu"
    },
    {
        ".     Before returning to England, Cook made a final sweep across the South Atlantic from ": null
    },
    {
        "Cape Horn": "Cape Horn"
    },
    {
        ". He then turned north to South Africa, and from there continued back to England. His reports upon his return home put to rest the popular myth of Terra Australis.             On his last voyage, Cook again commanded HMS Resolution, while Captain ": null
    },
    {
        "Charles Clerke": "Charles Clerke"
    },
    {
        " commanded . The voyage was ostensibly planned to return the ": null
    },
    {
        "Pacific Islander": "Pacific Islander"
    },
    {
        ", ": null
    },
    {
        "Omai": "Omai"
    },
    {
        " to Tahiti, or so the public were led to believe. The trips principal goal was to locate a ": null
    },
    {
        "North-West Passage": "North-West Passage"
    },
    {
        " around the American continent.  After dropping Omai at Tahiti, Cook travelled north and in 1778 became the first European to visit the ": null
    },
    {
        "Hawaiian Islands": "Hawaiian Islands"
    },
    {
        ". After his initial landfall in January 1778 at ": null
    },
    {
        "Waimea": "Waimea, Kauai County, Hawaii"
    },
    {
        " harbour, ": null
    },
    {
        "Kauai": "Kauai"
    },
    {
        ", Cook named the ": null
    },
    {
        "archipelago": "Archipelago"
    },
    {
        " the Sandwich Islands after the ": null
    },
    {
        "fourth Earl of Sandwich": "John Montagu, 4Th Earl Of Sandwich"
    },
    {
        "—the acting ": null
    },
    {
        "First Lord of the Admiralty": "Lords Commissioners Of The Admiralty"
    },
    {
        ".      From the Sandwich Islands Cook sailed north and then north-east to explore the west coast of North America north of the Spanish settlements in ": null
    },
    {
        "Alta California": "Alta California"
    },
    {
        ". Cook explored and mapped the coast all the way to the ": null
    },
    {
        "Bering Strait": "Bering Strait"
    },
    {
        ", on the way identifying what came to be known as ": null
    },
    {
        "Cook Inlet": "Cook Inlet"
    },
    {
        " in Alaska. In a single visit, Cook charted the majority of the North American north-west coastline on world maps for the first time, determined the extent of Alaska, and closed the gaps in Russian and Spanish exploratory probes of the Northern limits of the Pacific.      Cook returned to Hawaii in 1779. After sailing around the archipelago for some eight weeks, he made landfall at ": null
    },
    {
        "Kealakekua Bay": "Kealakekua Bay"
    },
    {
        ", on ": null
    },
    {
        "Hawaii Island": "Hawaii"
    },
    {
        ", largest island in the ": null
    },
    {
        "Hawaiian Archipelago": "Hawaiian Islands"
    },
    {
        ". Cooks arrival coincided with the  Makahiki , a Hawaiian ": null
    },
    {
        "harvest festival": "Harvest Festival"
    },
    {
        " of worship for the Polynesian god ": null
    },
    {
        "Lono": "Lono"
    },
    {
        ". Coincidentally the form of Cooks ship, HMS Resolution, or more particularly the mast formation, sails and rigging, resembled certain significant artefacts that formed part of the season of worship.  Similarly, Cooks clockwise route around the island of Hawaii before making landfall resembled the processions that took place in a clockwise direction around the island during the Lono festivals. It has been argued  that such coincidences were the reasons for Cooks initial ": null
    },
    {
        "deification": "Apotheosis"
    },
    {
        " by some Hawaiians who treated Cook as an incarnation of Lono.  Though this view was first suggested by members of Cooks expedition, the idea that any Hawaiians understood Cook to be Lono, and the evidence presented in support of it, were challenged in 1992.            After a months stay, Cook resumed his exploration of the Northern Pacific. Shortly after leaving Hawaii Island, however, the Resolution foremast broke, so the ships returned to ": null
    },
    {
        "Kealakekua Bay": "Kealakekua Bay"
    },
    {
        " for repairs. Tensions rose, and a number of quarrels broke out between the Europeans and Hawaiians. On 14 February 1779, at Kealakekua Bay, some Hawaiians took one of Cooks small boats. As thefts were quite common in ": null
    },
    {
        "Tahiti": "Tahiti"
    },
    {
        " and the other islands, Cook would have taken hostages until the stolen articles were returned. He attempted to take as hostage the ": null
    },
    {
        "King of Hawaiʻi": "Alii Aimoku Of Hawaii"
    },
    {
        ", ": null
    },
    {
        "Kalaniʻōpuʻu": "KalaniʻŌpuʻU"
    },
    {
        ". The Hawaiians prevented this, and Cooks men had to retreat to the beach. As Cook turned his back to help launch the boats, he was struck on the head by the villagers and then stabbed to death as he fell on his face in the surf.  Hawaiian tradition says that he was killed by a chief named ": null
    },
    {
        "Kalaimanokahoʻowaha or Kanaʻina": "Kalaimanokahoowaha"
    },
    {
        ".  The Hawaiians dragged his body away. Four of Cooks men were also killed and two others were wounded in the confrontation.     The esteem which the islanders nevertheless held for Cook caused them to retain his body. Following their practice of the time, they prepared his body with funerary rituals usually reserved for the chiefs and highest elders of the society. The body was ": null
    },
    {
        "disembowelled": "Disembowelment"
    },
    {
        ", baked to facilitate removal of the flesh, and the bones were carefully cleaned for preservation as ": null
    },
    {
        "religious icons": "Icon"
    },
    {
        " in a fashion somewhat reminiscent of the treatment of European saints in the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ". Some of Cooks remains, thus preserved, were eventually returned to his crew for a formal ": null
    },
    {
        "burial at sea": "Burial At Sea"
    },
    {
        ".      Clerke assumed leadership of the expedition.  Following the death of Clerke, Resolution and Discovery returned home in October 1780 commanded by ": null
    },
    {
        "John Gore": "John Gore"
    },
    {
        ", a veteran of Cooks first voyage, and ": null
    },
    {
        "Captain James King": "James King"
    },
    {
        ".  After their arrival in England, King completed Cooks account of the voyage.                       In 1789 the ": null
    },
    {
        "Mutiny on the Bounty": "Mutiny On The Bounty"
    },
    {
        " against ": null
    },
    {
        "William Bligh": "William Bligh"
    },
    {
        " led to several of the mutineers escaping the ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        " and settling on ": null
    },
    {
        "Pitcairn Islands": "Pitcairn Islands"
    },
    {
        ", which later became a British colony. Britain also established colonies in Australia in 1788, New Zealand in 1840 and ": null
    },
    {
        "Fiji": "Colonial Fiji"
    },
    {
        " in 1872, with much of Oceania becoming part of the ": null
    },
    {
        "British Empire": "British Empire"
    },
    {
        ".     The ": null
    },
    {
        "Gilbert Islands": "Gilbert Islands"
    },
    {
        "  and the Ellice Islands  came under Britains sphere of influence in the late 19th century. The Ellice Islands were administered as British ": null
    },
    {
        "protectorate": "Protectorate"
    },
    {
        " by a ": null
    },
    {
        "Resident Commissioner": "Resident Commissioner"
    },
    {
        " from 1892 to 1916 as part of the ": null
    },
    {
        "British Western Pacific Territories": "British Western Pacific Territories"
    },
    {
        " , and later as part of the ": null
    },
    {
        "Gilbert and Ellice Islands": "Gilbert And Ellice Islands"
    },
    {
        " colony from 1916 to 1974.  Macdonald, Barrie Cinderellas of the Empire: towards a history of Kiribati and Tuvalu, Institute of Pacific Studies, ": null
    },
    {
        "University of the South Pacific": "University Of The South Pacific"
    },
    {
        ", Suva, Fiji, , p. 1     Among the last islands in Oceania to be colonised was ": null
    },
    {
        "Niue": "Niue"
    },
    {
        " . In 1887, King Fata-a-iki, who reigned Niue from 1887 to 1896, offered to cede sovereignty to the ": null
    },
    {
        "British Empire": "British Empire"
    },
    {
        ", fearing the consequences of annexation by a less benevolent colonial power. The offer was not accepted until 1900. Niue was a British protectorate, but the ": null
    },
    {
        "UKs": "United Kingdom"
    },
    {
        " direct involvement ended in 1901 when New Zealand annexed the island.              French Catholic missionaries arrived on Tahiti in 1834; their expulsion in 1836 caused France to send a gunboat in 1838. In 1842, Tahiti and ": null
    },
    {
        "Tahuata": "Tahuata"
    },
    {
        " were declared a ": null
    },
    {
        "French protectorate": "Protectorate"
    },
    {
        ", to allow Catholic missionaries to work undisturbed. The capital of ": null
    },
    {
        "Papeetē": "Papeete"
    },
    {
        " was founded in 1843. In 1880, France annexed Tahiti, changing the status from that of a protectorate to that of a ": null
    },
    {
        "colony": "French Colonial Empires"
    },
    {
        ".      On 24 September 1853, under orders from ": null
    },
    {
        "Napoleon III": "Napoleon Iii"
    },
    {
        ", Admiral ": null
    },
    {
        "Febvrier Despointes": "Auguste Febvrier Despointes"
    },
    {
        " took formal possession of New Caledonia and ": null
    },
    {
        "Port-de-France": "Port-De-France"
    },
    {
        " was founded 25 June 1854.  A few dozen free settlers settled on the west coast in the following years. New Caledonia became a ": null
    },
    {
        "penal colony": "Penal Colony"
    },
    {
        ", and from the 1860s until the end of the transportations in 1897, about 22,000 criminals and political prisoners were sent to New Caledonia, among them many ": null
    },
    {
        "Communards": "Communards"
    },
    {
        ", including ": null
    },
    {
        "Henri de Rochefort": "Victor Henri Rochefort, Marquis De Rochefort-Luçay"
    },
    {
        " and ": null
    },
    {
        "Louise Michel": "Louise Michel"
    },
    {
        ".  Between 1873 and 1876, 4,200 political prisoners were relegated in New Caledonia. Only forty of them settled in the colony, the rest returned to France after being granted amnesty in 1879 and 1880.     In the 1880s, France claimed the ": null
    },
    {
        "Tuamotu Archipelago": "Tuamotu Archipelago"
    },
    {
        ", which formerly belonged to the ": null
    },
    {
        "Pōmare Dynasty": "Pomare Dynasty"
    },
    {
        ", without formally annexing it. Having declared a protectorate over Tahuata in 1842, the French regarded the entire ": null
    },
    {
        "Marquesas Islands": "Marquesas Islands"
    },
    {
        " as French. In 1885, France appointed a governor and established a general council, thus giving it the proper administration for a colony. The islands of ": null
    },
    {
        "Rimatara": "Rimatara"
    },
    {
        " and ": null
    },
    {
        "Rūrutu": "Rurutu"
    },
    {
        " unsuccessfully lobbied for British protection in 1888, so in 1889 they were annexed by France. Postage stamps were first issued in the colony in 1892. The first official name for the colony was Établissements de lOcéanie ; in 1903 the general council was changed to an advisory council and the colonys name was changed to Établissements Français de lOcéanie .           The Spanish explorer ": null
    },
    {
        "Alonso de Salazar": "Alonso De Salazar"
    },
    {
        " landed in the Marshall Islands in 1529. They were named by ": null
    },
    {
        "Krusenstern": "Adam Johann Von Krusenstern"
    },
    {
        ", after English ": null
    },
    {
        "explorer": "Explorer"
    },
    {
        " John Marshall": "John Marshall"
    },
    {
        ", who visited them together with ": null
    },
    {
        "Thomas Gilbert": "Thomas Gilbert"
    },
    {
        " in 1788, en route from ": null
    },
    {
        "Botany Bay": "Botany Bay"
    },
    {
        " to ": null
    },
    {
        "Canton": "Guangzhou"
    },
    {
        " . The Marshall Islands were claimed by Spain in 1874.       In 1606 ": null
    },
    {
        "Luís Vaz de Torres": "Luís Vaz De Torres"
    },
    {
        " explored the southern coast of New Guinea from ": null
    },
    {
        "Milne Bay": "Milne Bay"
    },
    {
        " to the ": null
    },
    {
        "Gulf of Papua": "Gulf Of Papua"
    },
    {
        " including Orangerie Bay which he named Bahía de San Lorenzo. His expedition also discovered ": null
    },
    {
        "Basilaki Island": "Basilaki Island"
    },
    {
        " naming it Tierra de San Buenaventura, which he claimed for Spain in July 1606. Translation of Torres’ report to the king in Collingridge, G. Discovery of Australia pp. 229–37. Golden Press Edition 1983, Gladesville, NSW.  On 18 October his expedition reached the western part of the island in present-day ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        ", and also claimed the territory for the King of Spain.          A successive European claim occurred in 1828, when the Netherlands formally claimed the western half of the island as ": null
    },
    {
        "Netherlands New Guinea": "Netherlands New Guinea"
    },
    {
        ". In 1883, following a short-lived French annexation of ": null
    },
    {
        "New Ireland": "New Ireland"
    },
    {
        ", the ": null
    },
    {
        "British colony": "British Colony"
    },
    {
        " of ": null
    },
    {
        "Queensland": "Queensland"
    },
    {
        " annexed south-eastern New Guinea. However, the Queensland governments superiors in the ": null
    },
    {
        "United Kingdom": "United Kingdom Of Great Britain And Ireland"
    },
    {
        " revoked the claim, and assumed direct responsibility in 1884, when ": null
    },
    {
        "Germany": "German Empire"
    },
    {
        " claimed north-eastern New Guinea as the protectorate of ": null
    },
    {
        "German New Guinea": "German New Guinea"
    },
    {
        " .     The first Dutch government posts were established in 1898 and in 1902: Manokwari on the north coast, Fak-Fak in the west and Merauke in the south at the border with ": null
    },
    {
        "British New Guinea": "Territory Of Papua"
    },
    {
        ". The German, Dutch and British colonial administrators each attempted to suppress the still-widespread practices of inter-village warfare and ": null
    },
    {
        "headhunting": "Headhunting"
    },
    {
        " within their respective territories. White, Osmar. Parliament of a Thousand Tribes, Heinemann, London, 1965     In 1905 the British government transferred some administrative responsibility over south-east New Guinea to Australia ; and in 1906, transferred all remaining responsibility to Australia. During World War I, Australian forces seized German New Guinea, which in 1920 became the ": null
    },
    {
        "Territory of New Guinea": "Territory Of New Guinea"
    },
    {
        ",   to be administered by Australia under a ": null
    },
    {
        "League of Nations mandate": "League Of Nations Mandate"
    },
    {
        ". The territories under Australian administration became collectively known as The Territories of Papua and New Guinea .         Germany established colonies in ": null
    },
    {
        "New Guinea": "German New Guinea"
    },
    {
        " in 1884, and ": null
    },
    {
        "Samoa": "German Samoa"
    },
    {
        " in 1900.     Following ": null
    },
    {
        "papal": "Papal"
    },
    {
        " mediation and German compensation of $4.5 million, Spain recognized a German claim in 1885. Germany established a ": null
    },
    {
        "protectorate": "Protectorate"
    },
    {
        " and set up trading stations on the islands of ": null
    },
    {
        "Jaluit": "Jaluit"
    },
    {
        " and ": null
    },
    {
        "Ebon": "Ebon Atoll"
    },
    {
        " to carry out the flourishing ": null
    },
    {
        "copra": "Copra"
    },
    {
        "  trade. Marshallese ": null
    },
    {
        "Iroij": "Iroij"
    },
    {
        " continued to rule under indirect colonial German administration.         The United States also expanded into the Pacific, beginning with ": null
    },
    {
        "Baker Island": "Baker Island"
    },
    {
        " and ": null
    },
    {
        "Howland Island": "Howland Island"
    },
    {
        " in 1857, and with Hawaii becoming a ": null
    },
    {
        "U.S. territory": "Territory Of Hawaii"
    },
    {
        " in 1898. Disagreements between the US, Germany and UK over Samoa led to the ": null
    },
    {
        "Tripartite Convention of 1899": "Tripartite Convention"
    },
    {
        ".     Samoa aligned its interests with the United States in a Deed of Succession, signed by the  Tui Manúʻa  on 16 July 1904 at the Crown residence of the Tuimanuʻa called the Faleula in the place called Lalopua .     Cession followed the ": null
    },
    {
        "Tripartite Convention of 1899": "Tripartite Convention"
    },
    {
        " that partitioned the eastern islands of ": null
    },
    {
        "Samoa": "Samoa"
    },
    {
        " from the western islands of Samoa .       At the beginning of World War I, Japan assumed control of the Marshall Islands. The Japanese headquarters was established at the German center of administration, ": null
    },
    {
        "Jaluit": "Jaluit"
    },
    {
        ". On 31 January 1944, during World War II, American forces landed on ": null
    },
    {
        "Kwajalein": "Kwajalein"
    },
    {
        " atoll": "Atoll"
    },
    {
        " and U.S. Marines and Army troops later took control of the islands from the Japanese on 3 February, following intense fighting on Kwajalein and ": null
    },
    {
        "Enewetak": "Enewetak Atoll"
    },
    {
        " atolls. In 1947, the United States, as the occupying power, entered into an agreement with the ": null
    },
    {
        "UN Security Council": "Un Security Council"
    },
    {
        " to administer much of ": null
    },
    {
        "Micronesia": "Micronesia"
    },
    {
        ", including the Marshall Islands, as the ": null
    },
    {
        "Trust Territory of the Pacific Islands": "Trust Territory Of The Pacific Islands"
    },
    {
        ".     During World War II, Japan colonized many Oceanic colonies by wresting control from western powers.                  The Samoan Crisis was a confrontation standoff between the United States, ": null
    },
    {
        "Imperial Germany": "Imperial Germany"
    },
    {
        " and Great Britain from 1887–1889 over control of the ": null
    },
    {
        "Samoan Islands": "Samoan Islands"
    },
    {
        " during the ": null
    },
    {
        "Samoan Civil War": "Samoan Civil War"
    },
    {
        ". The incident involved three American warships, USS ,  and  and three German warships, ": null
    },
    {
        "SMS Adler": "Sms Adler"
    },
    {
        ", ": null
    },
    {
        "SMS Olga": "Sms Olga"
    },
    {
        ", and ": null
    },
    {
        "SMS Eber": "Sms Eber"
    },
    {
        ", keeping each other at bay over several months in ": null
    },
    {
        "Apia": "Apia"
    },
    {
        " harbor, which was monitored by the British warship .     The standoff ended on 15 and 16 March when a ": null
    },
    {
        "cyclone": "1889 Apia Cyclone"
    },
    {
        " wrecked all six warships in the harbor. Calliope was able to escape the harbor and survived the storm. ": null
    },
    {
        "Robert Louis Stevenson": "Robert Louis Stevenson"
    },
    {
        " witnessed the storm and its aftermath at Apia and later wrote about what he saw.  The Samoan Civil War ": null
    },
    {
        "continued": "Second Samoan Civil War"
    },
    {
        ", involving Germany, United States and Britain, eventually resulting, via the ": null
    },
    {
        "Tripartite Convention of 1899": "Tripartite Convention"
    },
    {
        ", in the partition of the Samoan Islands into ": null
    },
    {
        "American Samoa": "American Samoa"
    },
    {
        " and ": null
    },
    {
        "German Samoa": "German Samoa"
    },
    {
        ". Ryden, George Herbert. The Foreign Policy of the United States in Relation to Samoa. New York: Octagon Books, 1975. , p. 574; the Tripartite Convention was signed at Washington on 2 December 1899 with ratification exchanged on 16 February 1900                 The Asian and Pacific Theatre of World War I was a conquest of ": null
    },
    {
        "German colonial possession": "French Colonial Empire"
    },
    {
        " in the Pacific Ocean and China. The most significant military action was the ": null
    },
    {
        "Siege of Tsingtao": "Siege Of Tsingtao"
    },
    {
        " in what is now China, but smaller actions were also fought at ": null
    },
    {
        "Battle of Bita Paka": "Battle Of Bita Paka"
    },
    {
        " and ": null
    },
    {
        "Siege of Toma": "Siege Of Toma"
    },
    {
        " in ": null
    },
    {
        "German New Guinea": "German New Guinea"
    },
    {
        ".     All other German and Austrian possessions in Asia and the Pacific fell without bloodshed. Naval warfare was common; all of the colonial powers had naval squadrons stationed in the ": null
    },
    {
        "Indian": "Indian Ocean"
    },
    {
        " or Pacific Oceans. These fleets operated by supporting the invasions of German held territories and by destroying the ": null
    },
    {
        "East Asia Squadron": "East Asia Squadron"
    },
    {
        ".          One of the first land offensives in the Pacific theatre was the ": null
    },
    {
        "Occupation of German Samoa": "Occupation Of German Samoa"
    },
    {
        " in August 1914 by New Zealand forces. The campaign to take Samoa ended without bloodshed after over 1,000 New Zealanders landed on the German ": null
    },
    {
        "colony": "Colony"
    },
    {
        ", supported by an Australian and French naval squadron.     Australian forces attacked ": null
    },
    {
        "German New Guinea": "German New Guinea"
    },
    {
        " in September 1914: 500 Australians encountered 300 Germans and native policemen at the ": null
    },
    {
        "Battle of Bita Paka": "Battle Of Bita Paka"
    },
    {
        "; the Allies won the day and the Germans retreated to ": null
    },
    {
        "Toma": "Siege Of Toma"
    },
    {
        ". A company of Australians and a British warship besieged the Germans and their colonial subjects, ending with a German surrender.      After the fall of Toma, only minor German forces were left in New Guinea and these generally capitulated once met by Australian forces. In December 1914, one German officer near Angorum attempted resist the occupation with thirty native police but his force deserted him after they fired on an Australian scouting party and he was subsequently captured.     ": null
    },
    {
        "German Micronesia": "German Micronesia"
    },
    {
        ", the ": null
    },
    {
        "Marianas": "Mariana Islands"
    },
    {
        ", the ": null
    },
    {
        "Carolines": "Caroline Islands"
    },
    {
        " and the ": null
    },
    {
        "Marshall Islands": "Marshall Islands"
    },
    {
        " also fell to Allied forces during the war.                  The ": null
    },
    {
        "Pacific front": "Military History Of Oceaniaworld War Ii"
    },
    {
        " saw major action during the ": null
    },
    {
        "Second World War": "World War Ii"
    },
    {
        ", mainly between the belligerents ": null
    },
    {
        "Japan": "Empire Of Japan"
    },
    {
        " and the ": null
    },
    {
        "United States": "United States"
    },
    {
        ".     The attack on Pearl Harbor was a surprise ": null
    },
    {
        "military strike": "Military Strike"
    },
    {
        " conducted by the ": null
    },
    {
        "Imperial Japanese Navy": "Imperial Japanese Navy"
    },
    {
        " against the United States ": null
    },
    {
        "naval base": "Naval Base"
    },
    {
        " at ": null
    },
    {
        "Pearl Harbor": "Pearl Harbor"
    },
    {
        ", ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        ", on the morning of 7 December 1941 . The attack led to the ": null
    },
    {
        "United States entry into World War II": "Military History Of The United States During World War Ii"
    },
    {
        ".     The attack was intended as a ": null
    },
    {
        "preventive": "Preventive War"
    },
    {
        " action in order to keep the ": null
    },
    {
        "U.S. Pacific Fleet": "U.S. Pacific Fleet"
    },
    {
        " from interfering with military actions the ": null
    },
    {
        "Empire of Japan": "Empire Of Japan"
    },
    {
        " was planning in South-East Asia against overseas territories of the United Kingdom, the Netherlands, and the United States. There were simultaneous Japanese attacks on the U.S.-held ": null
    },
    {
        "Philippines": "Commonwealth Of The Philippines"
    },
    {
        " and on the ": null
    },
    {
        "British Empire": "British Empire"
    },
    {
        " in ": null
    },
    {
        "Malaya": "British Malaya"
    },
    {
        ", ": null
    },
    {
        "Singapore": "Singapore"
    },
    {
        ", and Hong Kong.     The Japanese subsequently invaded New Guinea, the Solomon Islands and other Pacific islands. The Japanese were turned back at the ": null
    },
    {
        "Battle of the Coral Sea": "Battle Of The Coral Sea"
    },
    {
        " and the ": null
    },
    {
        "Kokoda Track campaign": "Kokoda Track Campaign"
    },
    {
        " before they were finally defeated in 1945.     Some of the most prominent Oceanic battlegrounds were the ": null
    },
    {
        "Solomon Islands campaign": "Solomon Islands Campaign"
    },
    {
        ", the ": null
    },
    {
        "Air raids on Darwin": "Bombing Of Darwin"
    },
    {
        ", the ": null
    },
    {
        "Kokada Track": "Kokoda Track Campaign"
    },
    {
        ", and the ": null
    },
    {
        "Borneo campaign": "Borneo Campaign"
    },
    {
        ".     In 1940 the administration of French Polynesia recognised the Free French Forces and many Polynesians served in World War II. Unknown at the time to French and Polynesians, the Konoe Cabinet in Imperial Japan on 16 September 1940 included French Polynesia among the many territories which were to become Japanese possessions in the post-war world—though in the course of the war in the Pacific the Japanese were not able to launch an actual invasion of the French islands.                       Some of the most intense fighting of the Second World War occurred in the Solomons. The most significant of the Allied Forces operations against the ": null
    },
    {
        "Japanese Imperial": "Japanese Imperial"
    },
    {
        " Forces was launched on 7 August 1942, with simultaneous naval bombardments and amphibious landings on the ": null
    },
    {
        "Florida Islands": "Florida Islands"
    },
    {
        " at ": null
    },
    {
        "Tulagi": "Tulagi"
    },
    {
        "  and Red Beach on ": null
    },
    {
        "Guadalcanal": "Guadalcanal"
    },
    {
        ".     The ": null
    },
    {
        "Guadalcanal Campaign": "Guadalcanal Campaign"
    },
    {
        " became an important and bloody campaign fought in the Pacific War as the Allies began to repulse Japanese expansion. Of strategic importance during the war were the ": null
    },
    {
        "coastwatchers": "Coastwatchers"
    },
    {
        " operating in remote locations, often on Japanese held islands, providing early warning and intelligence of Japanese naval, army and aircraft movements during the campaign. . NPR: National Public Radio.     The Slot was a name for ": null
    },
    {
        "New Georgia Sound": "New Georgia Sound"
    },
    {
        ", when it was used by the ": null
    },
    {
        "Tokyo Express": "Tokyo Express"
    },
    {
        " to supply the Japanese garrison on Guadalcanal. Of more than 36,000 Japanese on Guadalcanal, about 26,000 were killed or missing, 9,000 died of disease, and 1,000 were captured. Elmer Belmont Potter, Roger Fredland, Henry Hitch Adams . Naval Institute Press  p. 310                 The Kokoda Track campaign was a campaign consisting of a series of battles fought between July and November 1942 between ": null
    },
    {
        "Japanese": "Military History Of Japanshowa Period – World War Ii"
    },
    {
        " and ": null
    },
    {
        "Allied": "Allies Of World War Ii"
    },
    {
        "—primarily Australian—forces in what was then the Australian territory of ": null
    },
    {
        "Papua": "Papua"
    },
    {
        ". Following a landing near Gona, on the north coast of ": null
    },
    {
        "New Guinea": "New Guinea"
    },
    {
        ", Japanese forces attempted to advance south overland through the mountains of the ": null
    },
    {
        "Owen Stanley Range": "Owen Stanley Range"
    },
    {
        " to seize ": null
    },
    {
        "Port Moresby": "Port Moresby"
    },
    {
        " as part of a strategy of isolating Australia from the United States. Initially only limited Australian forces were available to oppose them, and after making rapid progress the Japanese ": null
    },
    {
        "South Seas Force": "South Seas Force"
    },
    {
        " clashed with under strength Australian forces at Awala, forcing them back to Kokoda. A number of Japanese attacks were subsequently fought off by the Australian ": null
    },
    {
        "Militia": "Australian Army Reserve"
    },
    {
        ", yet they began to withdraw over the Owen Stanley Range, down the ": null
    },
    {
        "Kokoda Track": "Kokoda Track"
    },
    {
        ".     In sight of Port Moresby itself, the Japanese began to run out of momentum against the Australians who began to receive further reinforcements. Having outrun their supply lines and following the reverses suffered by the Japanese at ": null
    },
    {
        "Guadalcanal": "Guadalcanal Campaign"
    },
    {
        ", the Japanese were now on the defensive, marking the limit of the Japanese advance southwards. The Japanese subsequently withdrew to establish a defensive position on the north coast, but they were followed by the Australians who recaptured Kokoda on 2 November. Further fighting continued into November and December as the Australian and ": null
    },
    {
        "United States": "Us Army"
    },
    {
        " forces assaulted the Japanese beachheads, in what later became known as the ": null
    },
    {
        "Battle of Buna–Gona": "Battle Of Buna–Gona"
    },
    {
        ".              Due to its low population, Oceania was a popular location for atmospheric and ": null
    },
    {
        "underground nuclear tests": "Underground Nuclear Testing"
    },
    {
        ". Tests were conducted in various locations by the United Kingdom , the United States  and France , often with devastating consequences for the inhabitants.     From 1946 to 1958, the Marshall Islands served as the ": null
    },
    {
        "Pacific Proving Grounds": "Pacific Proving Grounds"
    },
    {
        " for the United States, and was the site of 67 ": null
    },
    {
        "nuclear tests": "Nuclear Tests"
    },
    {
        " on various atolls. The worlds first ": null
    },
    {
        "hydrogen bomb": "Hydrogen Bomb"
    },
    {
        ", codenamed ": null
    },
    {
        "Mike": "Ivy Mike"
    },
    {
        " , was tested at the ": null
    },
    {
        "Enewetak": "Enewetak"
    },
    {
        " atoll in the ": null
    },
    {
        "Marshall Islands": "Marshall Islands"
    },
    {
        " on 1 November in 1952, by the United States.     In 1954, ": null
    },
    {
        "fallout": "Nuclear Fallout"
    },
    {
        " from the American ": null
    },
    {
        "Castle Bravo": "Castle Bravo"
    },
    {
        " hydrogen bomb": "Hydrogen Bomb"
    },
    {
        " test in the ": null
    },
    {
        "Marshall Islands": "Marshall Islands"
    },
    {
        " was such that the inhabitants of the ": null
    },
    {
        "Rongelap": "Rongelap"
    },
    {
        " Atoll were forced to abandon their island. Three years later the islanders were allowed to return, but suffered abnormally high levels of cancer. They were evacuated again in 1985 and in 1996 given $45 million in compensation.     A series of British tests were also conducted in the 1950s at ": null
    },
    {
        "Maralinga": "British Nuclear Tests At Maralinga"
    },
    {
        " in ": null
    },
    {
        "South Australia": "South Australia"
    },
    {
        ", forcing the removal of the ": null
    },
    {
        "Pitjantjatjara": "Pitjantjatjara People"
    },
    {
        " and ": null
    },
    {
        "Yankunytjatjara": "Yankunytjatjara"
    },
    {
        " peoples from their ancestral homelands.     In 1962, Frances early nuclear testing ground of Algeria became independent and the atoll of ": null
    },
    {
        "Moruroa": "Moruroa"
    },
    {
        " in the Tuamotu Archipelago was selected as the new testing site. Moruroa atoll became notorious as a site of French nuclear testing, primarily because tests were carried out there after most Pacific testing had ceased. These tests were opposed by most other nations in Oceania. The last atmospheric test was conducted in 1974, and the last underground test in 1996.     French ": null
    },
    {
        "nuclear testing": "Nuclear Testing"
    },
    {
        " in the Pacific was controversial in the 1980s, in 1985 French agents caused the ": null
    },
    {
        "Sinking of the Rainbow Warrior": "Sinking Of The Rainbow Warrior"
    },
    {
        " in ": null
    },
    {
        "Auckland": "Auckland"
    },
    {
        " to prevent it from arriving at the test site in ": null
    },
    {
        "Moruroa": "Moruroa"
    },
    {
        ". In September 1995, France stirred up widespread protests by resuming nuclear testing at Fangataufa atoll after a three-year moratorium. The last test was on 27 January 1996. On 29 January 1996, France announced that it would accede to the Comprehensive Test Ban Treaty, and no longer test nuclear weapons.                 Fiji has suffered several ": null
    },
    {
        "coups détat": "Coups Détat"
    },
    {
        "indigenous Fijians": "Fijians"
    },
    {
        " and ": null
    },
    {
        "Indo-Fijians": "Indians In Fiji"
    },
    {
        ", who originally came to the islands as indentured labour in the late nineteenth and early twentieth century. The 1987 coup followed the election of a multi-ethnic coalition, which ": null
    },
    {
        "Lieutenant Colonel": "Lieutenant Colonel"
    },
    {
        " Sitiveni Rabuka": "Sitiveni Rabuka"
    },
    {
        " overthrew, claiming racial discrimination against ethnic Fijians. The coup was denounced by the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " and Fiji was expelled from the ": null
    },
    {
        "Commonwealth of Nations": "Commonwealth Of Nations"
    },
    {
        ".     The 2000 coup was essentially a repeat of the 1987 affair, although it was led by civilian ": null
    },
    {
        "George Speight": "George Speight"
    },
    {
        ", apparently with military support. ": null
    },
    {
        "Commodore": "Commodore"
    },
    {
        " Frank Bainimarama": "Frank Bainimarama"
    },
    {
        ", who was opposed to Speight, then took over and appointed a new Prime Minister. Speight was later tried and convicted for ": null
    },
    {
        "treason": "Treason"
    },
    {
        ". Many indigenous Fijians were unhappy at the treatment of Speight and his supporters, feeling that the coup had been legitimate. In 2006 the ": null
    },
    {
        "Fijian parliament": "Parliament Of Fiji"
    },
    {
        " attempted to introduce a series of bills which would have, amongst other things, pardoned those involved in the 2000 coup. Bainimarama, concerned that the legal and racial injustices of the previous coups would be perpetuated, staged his own coup. It was internationally condemned, and Fiji again suspended from the Commonwealth.     In 2006 the then Australia Defence Minister, ": null
    },
    {
        "Brendan Nelson": "Brendan Nelson"
    },
    {
        ", warned Fijian officials of an Australian Naval fleet within proximity of Fiji that would respond to any attacks against its citizens.             The Australian government estimated that anywhere between 15,000 and 20,000 people could have died in the ": null
    },
    {
        "Bougainville Civil War": "Bougainville Civil War"
    },
    {
        ". More conservative estimates put the number of combat deaths as 1–2,000.      From 1975, there were attempts by the ": null
    },
    {
        "Bougainville Province": "Bougainville Province"
    },
    {
        " to secede from ": null
    },
    {
        "Papua New Guinea": "Papua New Guinea"
    },
    {
        ". These were resisted by Papua New Guinea primarily because of the presence in Bougainville of the Panguna mine, which was vital to Papua New Guineas economy. The ": null
    },
    {
        "Bougainville Revolutionary Army": "Bougainville Revolutionary Army"
    },
    {
        " began attacking the mine in 1988, forcing its closure the following year. Further BRA activity led to the declaration of a ": null
    },
    {
        "state of emergency": "State Of Emergency"
    },
    {
        " and the conflict continued until about 2005, when successionist leader and self-proclaimed King of Bougainville ": null
    },
    {
        "Francis Ona": "Francis Ona"
    },
    {
        " died of malaria. Peacekeeping troops led by Australia have been in the region since the late 1990s, and a referendum on independence will be held in the 2010s.              In 1946, French Polynesians were granted French citizenship and the islands status was changed to an overseas territory; the islands name was changed in 1957 to Polynésie Française .     Australia and New Zealand became ": null
    },
    {
        "dominions": "British Dominions"
    },
    {
        " in the 20th century, adopting the ": null
    },
    {
        "Statute of Westminster Act": "Statute Of Westminster 1931"
    },
    {
        " in 1942 and 1947 respectively, marking their legislative independence from the United Kingdom. Hawaii became a U.S. state in 1959.     Samoa became the first pacific nation to gain independence in 1962, Fiji and Tonga became independent in 1970, with many other nations following in the 1970s and 1980s. The South Pacific Forum was founded in 1971, which became the ": null
    },
    {
        "Pacific Islands Forum": "Pacific Islands Forum"
    },
    {
        " in 2000. ": null
    },
    {
        "Bougainville Island": "Bougainville Island"
    },
    {
        ", geographically part of the ": null
    },
    {
        "Solomon Islands archipelago": "Solomon Islands"
    },
    {
        " but politically part of ": null
    },
    {
        "Papua New Guinea": "Papua New Guinea"
    },
    {
        ", tried unsuccessfully to ": null
    },
    {
        "become independent": "Republic Of The North Solomons"
    },
    {
        " in 1975, and a civil war followed in the early 1990s, with it later being granted autonomy.     On 1 May 1979, in recognition of the evolving political status of the Marshall Islands, the United States recognized the constitution of the Marshall Islands and the establishment of the Government of the ": null
    },
    {
        "Republic of the Marshall Islands": "Republic Of The Marshall Islands"
    },
    {
        ". The constitution incorporates both American and British constitutional concepts.     In 1852, French Polynesia was granted partial internal autonomy; in 1984, the autonomy was extended. French Polynesia became a full overseas collectivity of France in 2004.     Between 2001 and 2007 Australias ": null
    },
    {
        "Pacific Solution": "Pacific Solution"
    },
    {
        " policy transferred asylum seekers to several Pacific nations, including the ": null
    },
    {
        "Nauru detention centre": "Nauru Detention Centre"
    },
    {
        ". Australia, New Zealand and other nations took part in the ": null
    },
    {
        "Regional Assistance Mission to Solomon Islands": "Regional Assistance Mission To Solomon Islands"
    }
]