[
    {
        "         Although the start of the history of film is not clearly defined, the commercial, public screening of ten of ": null
    },
    {
        "Lumière brothers": "Auguste And Louis Lumière"
    },
    {
        " short films in Paris on 28 December 1895 can be regarded as the breakthrough of projected ": null
    },
    {
        "cinematographic": "Cinematography"
    },
    {
        " motion pictures. There had been earlier cinematographic results and screenings but these lacked either the quality or the momentum that propelled the cinématographe Lumière into a worldwide success.     Soon ": null
    },
    {
        "film production companies": "Film Production Companies"
    },
    {
        " and studios were established all over the world. The first decade of motion picture saw film moving from a novelty to an established mass entertainment industry. The earliest films were in black and white, under a minute long, without recorded sound and consisted of a single shot from a steady camera.     Conventions towards a general cinematic language developed over the years with the use of several shots , continuity between shots, camera movements , ": null
    },
    {
        "camera angle": "Camera Angle"
    },
    {
        ", field size  and other ": null
    },
    {
        "cinematic techniques": "Cinematic Techniques"
    },
    {
        " all contributing specific roles in the ": null
    },
    {
        "narrative": "Narrativity"
    },
    {
        " of films.     ": null
    },
    {
        "Special effects": "Special Effects"
    },
    {
        " became a feature in movies since the late 1890s, popularized by ": null
    },
    {
        "Georges Méliès": "Georges Méliès"
    },
    {
        " fantasy films. Many effects were impossible or impractical to perform in theater plays and thus added more magic to the experience of movies.     Technical improvements added length , synchronized sound recording , color and 3D . Sound ended the necessity of interruptions of ": null
    },
    {
        "title cards": "Title Cards"
    },
    {
        ", revolutionized the narrative possibilities for filmmakers, and became an integral part of moviemaking.     Different ": null
    },
    {
        "film genres": "Film Genre"
    },
    {
        " emerged and enjoyed variable degrees of success over time, with huge differences between for instance ": null
    },
    {
        "horror films": "Horror Film"
    },
    {
        " , ": null
    },
    {
        "newsreels": "Newsreel"
    },
    {
        " , ": null
    },
    {
        "musicals": "Musical Film"
    },
    {
        " and ": null
    },
    {
        "pornographic films": "Pornographic Film"
    },
    {
        " .     The popularity of ": null
    },
    {
        "television": "Television"
    },
    {
        " seemed to form a threat to cinemas in the 1950s , which resulted in attempts to make theatrical films more attractive with technological innovations. New ": null
    },
    {
        "widescreen": "Widescreen"
    },
    {
        " formats enticed filmmakers to create more epic films and spectacles that looked better on a big screen than on television. 3D films experienced a short ": null
    },
    {
        "golden age": "3D Filmthe   Golden Era"
    },
    {
        " from 1952 to 1954. Television also opened up a new market for filmmakers, introducing new possibilities that led to new genres, especially in serialized form.     Since the 1950s ": null
    },
    {
        "video": "Video"
    },
    {
        " became a viable, cheaper alternative to film, with direct results, forming a more accessible moving image medium for many more artists and amateurs to experiment with. This led to the emergence of ": null
    },
    {
        "video art": "Video Art"
    },
    {
        " in the late 1960s and to much more ": null
    },
    {
        "home movies": "Home Movies"
    },
    {
        " being made.     By the 1980s ": null
    },
    {
        "home video": "Home Video"
    },
    {
        " had opened a big market for films that already had their theatrical run, giving people easier access to titles of their choice in ": null
    },
    {
        "video rental shops": "Video Rental Shop"
    },
    {
        ". ": null
    },
    {
        "Direct-to-video": "Direct-To-Video"
    },
    {
        " markets usually offered lower quality, cheap productions that were not deemed very suitable for the general audiences of television and theatrical releases.     Improving over time, digital production methods became more and more popular during the 1990s, resulting in increasingly realistic ": null
    },
    {
        "visual effects": "Visual Effects"
    },
    {
        " and popular feature-length ": null
    },
    {
        "computer animations": "Computer Animation"
    },
    {
        ".     Since the late 2000s ": null
    },
    {
        "streaming media": "Streaming Media"
    },
    {
        " platforms like ": null
    },
    {
        "YouTube": "Youtube"
    },
    {
        " provided means for anyone with access to internet and cameras  to publish videos to the world. Also competing with the increasing popularity of ": null
    },
    {
        "video games": "Video Games"
    },
    {
        " and other forms of ": null
    },
    {
        "home entertainment": "Home Entertainment"
    },
    {
        ", the industry once again started to make theatrical releases more attractive with new 3D technologies and epic films became a mainstay in cinemas.          ": null
    },
    {
        "Film": "Film"
    },
    {
        " as an art form has drawn on several earlier traditions in the fields such as ": null
    },
    {
        "storytelling": "Storytelling"
    },
    {
        ", ": null
    },
    {
        "literature": "Literature"
    },
    {
        ", ": null
    },
    {
        "theatre": "Theatre"
    },
    {
        " and ": null
    },
    {
        "visual arts": "Visual Art"
    },
    {
        ". Forms of art and entertainment that had already featured moving and/or projected images include:   ": null
    },
    {
        "shadowgraphy": "Shadowgraphy"
    },
    {
        ", probably used since prehistoric times   ": null
    },
    {
        "camera obscura": "Camera Obscura"
    },
    {
        ", a natural phenomenon that has possibly been used as an artistic aid since prehistoric times   ": null
    },
    {
        "shadow puppetry": "Shadow Play"
    },
    {
        ", possibly originated around 200 BCE in Central Asia, India, Indonesia or China   ": null
    },
    {
        "magic lantern": "Magic Lantern"
    },
    {
        ", developed in the 1650s, preceded by some incidental and/or inferior ": null
    },
    {
        "projectors": "Projector"
    },
    {
        "   stroboscopic": "Stroboscope"
    },
    {
        " persistence of vision": "Persistence Of Vision"
    },
    {
        " animation devices      Some ancient sightings of gods and spirits may have been conjured up by means of mirrors, camera obscura or unknown projectors. By the 16th century ": null
    },
    {
        "necromantic": "Necromancy"
    },
    {
        " ceremonies and the conjuring of ghostly apparitions by charlatan magicians and witches seemed commonplace.  The very first magic lantern shows seem to have continued this tradition with images of death, monsters and other scary figures. Around 1790 this was developed into multi-media ghost shows known as ": null
    },
    {
        "phantasmagoria": "Phantasmagoria"
    },
    {
        " that could feature mechanical slides, rear projection, mobile projectors, ": null
    },
    {
        "superimposition": "Superimposition"
    },
    {
        ", ": null
    },
    {
        "dissolves": "Dissolve"
    },
    {
        ", live actors, smoke , odors, sounds and even electric shocks. While the first magic lantern images seem to have been intended to scare audiences, soon all sorts of subjects appeared and the lantern was not only used for storytelling but also for education. In the 19th century several new and popular magic lantern techniques were developed, including ": null
    },
    {
        "dissolving views": "Dissolving Views"
    },
    {
        " and several types of mechanical slides that created dazzling abstract effects or that showed for instance falling snow, or the planets and their moons revolving.         Early photographic sequences, known as ": null
    },
    {
        "chronophotography": "Chronophotography"
    },
    {
        ", can be regarded as early motion picture recordings that could not yet be presented as moving pictures. Since 1878, ": null
    },
    {
        "Eadward Muybridge": "Eadward Muybridge"
    },
    {
        " made hundreds of chronophotographic studies of the motion of animals and humans in real-time, soon followed by other chronophotographers like ": null
    },
    {
        "Étienne-Jules Marey": "Étienne-Jules Marey"
    },
    {
        ", ": null
    },
    {
        "Georges Demenÿ": "Georges Demenÿ"
    },
    {
        " and ": null
    },
    {
        "Ottomar Anschütz": "Ottomar Anschütz"
    },
    {
        ". Usually chronophotography was regarded as a serious, even scientific, method to study motion and almost exclusively involved humans or animals performing a simple movement in front of the camera. Soon after Muybridge published his first results as ": null
    },
    {
        "The Horse in Motion": "The Horse In Motion"
    },
    {
        " cabinet cards, people put the silhouette-like photographic images in zoetropes to watch them in motion. Most sequences could later be animated into very short films with fluent motion .             In the 1890s, films were seen mostly via temporary storefront spaces and traveling exhibitors or as acts in vaudeville programs. A film could be under a minute long and would usually present a single scene, authentic or staged, of everyday life, a public event, a sporting event or ": null
    },
    {
        "slapstick": "Slapstick"
    },
    {
        ". There was little to no cinematic technique, the film was usually black and white and it was without sound.        The novelty of realistic moving photographs was enough for a motion picture industry to blossom before the end of the century, in countries around the world. The Cinema was to offer a relatively cheap and simple way of providing entertainment to the masses. Filmmakers could record actors performances, which then could be shown to audiences around the world. Travelogues would bring the sights of far-flung places, with movement, directly to spectators hometowns. Movies would become the most popular visual art form of the late Victorian age. Bordwell, David and Thompson, Kristin. Film History An Introduction. New York: McGraw-Hill Company Inc.p.13     The ": null
    },
    {
        "Berlin Wintergarten theater": "Berlin Wintergarten Theatre"
    },
    {
        " hosted an early movie presentation in front of an audience, shown by the ": null
    },
    {
        "Skladanowsky brothers": "Max Skladanowsky"
    },
    {
        " in 1895. The ": null
    },
    {
        "Melbourne Athenaeum": "Melbourne Athenaeum"
    },
    {
        " started to screen movies in 1896. ": null
    },
    {
        "Movie theaters": "Movie Theater"
    },
    {
        " became popular entertainment venues and social hubs in the early 20th century, much like ": null
    },
    {
        "cabarets": "Cabaret"
    },
    {
        " and other theaters.        Until 1927, most motion pictures were produced without sound. This era is referred to as the ": null
    },
    {
        "silent era of film": "Silent Film"
    },
    {
        ". To enhance the viewers experience, silent films were commonly accompanied by live musicians in an orchestra, a theatre organ, and sometimes ": null
    },
    {
        "sound effects": "Sound Effect"
    },
    {
        " and even commentary spoken by the showman or projectionist. In most countries, ": null
    },
    {
        "intertitles": "Intertitle"
    },
    {
        " came to be used to provide dialogue and narration for the film, thus dispensing with narrators, but in Japanese cinema human narration remained popular throughout the silent era. The technical problems were resolved by 1923.     ": null
    },
    {
        "Illustrated songs": "Illustrated Song"
    },
    {
        " were a notable exception to this trend that began in 1894 in ": null
    },
    {
        "vaudeville": "Vaudeville"
    },
    {
        " houses and persisted as late as the late 1930s in film theaters.  Live performance or sound recordings were paired with hand-colored glass ": null
    },
    {
        "slides": "Magic Lantern"
    },
    {
        " projected through ": null
    },
    {
        "stereopticons": "Stereopticon"
    },
    {
        " and similar devices. In this way, song narrative was illustrated through a series of slides whose changes were simultaneous with the narrative development. The main purpose of illustrated songs was to encourage ": null
    },
    {
        "sheet music": "Sheet Music"
    },
    {
        " sales, and they were highly successful with sales reaching into the millions for a single song. Later, with the birth of film, illustrated songs were used as filler material preceding films and during ": null
    },
    {
        "reel changes": "Film Reel"
    },
    {
        ".      The 1914  The Photo-Drama of Creation  was a non-commercial attempt to combine the motion picture with a combination of slides and synchronize the resulting moving picture with audio. The film included hand-painted slides as well as other previously used techniques. Simultaneously playing the audio while the film was being played with a projector was required. Produced by the ": null
    },
    {
        "Watch Tower Bible and Tract Society of Pennsylvania": "Watch Tower Bible And Tract Society Of Pennsylvania"
    },
    {
        " , this eight–hour bible drama was being shown in 80 cities every day and almost eight million people in the United States and Canada saw the presentation. Encyclopedia of American Religion and Politics  p. 22       Within eleven years of motion pictures, the films moved from a novelty show to an established large-scale entertainment industry. Films moved from a single shot, completely made by one person with a few assistants, towards films several minutes long consisting of several shots, which were made by large companies in something like industrial conditions.     By 1900, the first motion pictures that can be considered films  emerged, and film-makers began to introduce basic editing techniques and film narrative.           Early movie cameras were fastened to the head of a tripod with only simple levelling devices provided. These cameras were effectively fixed during the course of a shot, and the first camera movements were the result of mounting a camera on a moving vehicle. The ": null
    },
    {
        "Lumière brothers": "Lumière Brothers"
    },
    {
        " shot a scene from the back of a train in 1896.     The first rotating camera for taking ": null
    },
    {
        "panning shots": "Panning"
    },
    {
        " was built by ": null
    },
    {
        "Robert W. Paul": "Robert W. Paul"
    },
    {
        " in 1897, on the occasion of ": null
    },
    {
        "Queen Victorias": "Queen Victoria"
    },
    {
        " Diamond Jubilee": "Diamond Jubilee"
    },
    {
        ". He used his camera to shoot the procession in one shot. His device had the camera mounted on a vertical axis that could be rotated by a ": null
    },
    {
        "worm gear": "Worm Gear"
    },
    {
        " driven by turning a crank handle, and Paul put it on general sale the next year. Shots taken using such a panning head were also referred to as panoramas in the film catalogues.      ": null
    },
    {
        "Georges Méliès": "Georges Méliès"
    },
    {
        " built one of the first film studios in May 1897. It had a glass roof and three glass walls constructed after the model of large studios for still photography, and it was fitted with thin cotton cloths that could be stretched below the roof to diffuse the direct rays of the sun on sunny days. Wakeman, John. World Film Directors, Volume 1. The H. W. Wilson Company. 1987. pp. 747–765. Beginning in 1896, Méliès would go on to produce, direct, and distribute over 500 short films. The majority of these films were short, one-shot films completed in one take. Méliès drew many comparisons between film and the stage, which was apparent in his work. He realized that film afforded him the ability to produce visual spectacles not achievable in the theater. Gazetas, Aristides. An Introduction to World Cinema. Jefferson: McFarland Company, Inc, 2000. Print.      The Execution of Mary Stuart , produced by the Edison Company for viewing with the ": null
    },
    {
        "Kinetoscope": "Kinetoscope"
    },
    {
        ", showed ": null
    },
    {
        "Mary Queen of Scots": "Mary Queen Of Scots"
    },
    {
        " being executed in full view of the camera. The effect was achieved by replacing the actor with a dummy for the final shot.  Georges Méliès also utilized this technique in the making of Escamotage dun dame chez Robert-Houdin . The woman is seen to vanish through the use of ": null
    },
    {
        "stop motion": "Stop Motion"
    },
    {
        " techniques.        The other basic technique for trick cinematography was the ": null
    },
    {
        "double exposure": "Multiple Exposure"
    },
    {
        " of the film in the camera. This was pioneered by ": null
    },
    {
        "George Albert Smith": "George Albert Smith"
    },
    {
        " in July 1898 in England. The set was draped in black, and after the main shot, the negative was re-exposed to the overlaid scene. His The Corsican Brothers was described in the catalogue of the ": null
    },
    {
        "Warwick Trading Company": "Warwick Trading Company"
    },
    {
        " in 1900: By extremely careful photography the ghost appears quite transparent. After indicating that he has been killed by a sword-thrust, and appealing for vengeance, he disappears. A vision then appears showing the fatal duel in the snow.”     G.A. Smith also initiated the special effects technique of ": null
    },
    {
        "reverse motion": "Reverse Motion"
    },
    {
        ". He did this by repeating the action a second time, while filming it with an inverted camera, and then joining the tail of the second negative to that of the first.  The first films made using this device were Tipsy, Topsy, Turvy and The Awkward Sign Painter. The earliest surviving example of this technique is Smiths  The House That Jack Built , made before September 1900.     ": null
    },
    {
        "Cecil Hepworth": "Cecil Hepworth"
    },
    {
        " took this technique further, by printing the ": null
    },
    {
        "negative": "Negative"
    },
    {
        " of the forwards motion backwards frame by frame, so producing a print in which the original action was exactly reversed. To do this he built a special printer in which the negative running through a projector was projected into the gate of a camera through a special lens giving a same-size image. This arrangement came to be called a projection printer , and eventually an ": null
    },
    {
        "optical printer": "Optical Printer"
    },
    {
        " .     The use of different camera speeds also appeared around 1900 in the films of ": null
    },
    {
        "Robert W. Paul": "Robert W. Paul"
    },
    {
        " and Hepworth. Paul shot scenes from On a Runaway Motor Car through Piccadilly Circus with the camera turning very slowly. When the film was projected at the usual 16 frames per second, the scenery appeared to be passing at great speed. Hepworth used the opposite effect in The Indian Chief and the Seidlitz Powder  . The Chiefs movements are sped up by cranking the camera much faster than 16 frames per second. This gives what we would call a ": null
    },
    {
        "slow motion": "Slow Motion"
    },
    {
        " effect.       The first films to consist of more than one shot appeared toward the end of the 19th century. A notable example was the French film of the life of ": null
    },
    {
        "Jesus Christ": "Jesus"
    },
    {
        ", La vie du Christ ,  by ": null
    },
    {
        "Alice Guy": "Alice Guy"
    },
    {
        ". These werent represented as a continuous film, the separate scenes were interspersed with lantern slides, a lecture, and live choral numbers, to increase the running time of the spectacle to about 90 minutes. Another example of this is the reproductions of scenes from the ": null
    },
    {
        "Greco-Turkish war": "Greco-Turkish War"
    },
    {
        ", made by ": null
    },
    {
        "Georges Méliès": "Georges Méliès"
    },
    {
        " in 1897. Although each scene was sold separately, they were shown one after the other by the exhibitors. Even Méliès Cendrillon  of 1898 contained no action moving from one shot to the next one. To understand what was going on in the film the audience had to know their stories beforehand, or be told them by a presenter.        Real film continuity, involving action moving from one sequence into another, is attributed to British film pioneer ": null
    },
    {
        "Robert W. Pauls": "Robert W. Paul"
    },
    {
        "  Come Along, Do! , made in 1898 and one of the first films to feature more than one shot.  In the first shot, an elderly couple is outside an ": null
    },
    {
        "art exhibition": "Art Exhibition"
    },
    {
        " having lunch and then follow other people inside through the door. The second shot shows what they do inside. Pauls Cinematograph Camera No. 1 of 1895 was the first camera to feature reverse-cranking, which allowed the same film footage to be exposed several times and thereby to create super-positions and ": null
    },
    {
        "multiple exposures": "Multiple Exposure"
    },
    {
        ". This technique was first used in his 1901 film  Scrooge, or, Marleys Ghost .     The further development of action continuity in multi-shot films continued in 1899 at the ": null
    },
    {
        "Brighton": "Brighton"
    },
    {
        " School in ": null
    },
    {
        "England": "England"
    },
    {
        ". In the latter part of that year, ": null
    },
    {
        "George Albert Smith": "George Albert Smith"
    },
    {
        " made The Kiss in the Tunnel. This started with a shot from a phantom ride at the point at which the train goes into a tunnel, and continued with the action on a set representing the interior of a railway carriage, where a man steals a kiss from a woman, and then cuts back to the phantom ride shot when the train comes out of the tunnel. A month later, the Bamforth company in Yorkshire made a restaged version of this film under the same title, and in this case they filmed shots of a train entering and leaving a tunnel from beside the tracks, which they joined before and after their version of the kiss inside the train compartment.        In 1900, continuity of action across successive shots was definitively established by George Albert Smith and ": null
    },
    {
        "James Williamson": "James Williamson"
    },
    {
        ", who also worked in ": null
    },
    {
        "Brighton": "Brighton"
    },
    {
        ". In that year Smith made  As Seen Through a Telescope , in which the main shot shows street scene with a young man tying the shoelace and then caressing the foot of his girlfriend, while an old man observes this through a telescope. There is then a cut to close shot of the hands on the girls foot shown inside a black circular mask, and then a cut back to the continuation of the original scene. Even more remarkable is ": null
    },
    {
        "James Williamsons": "James Williamson"
    },
    {
        " Attack on a China Mission Station . The first shot shows Chinese Boxer rebels at the gate; it then cuts to the missionary family in the garden, where a fight ensues. The wife signals to British sailors from the ": null
    },
    {
        "balcony": "Balcony"
    },
    {
        ", who come and rescue them. The film also used the first reverse angle cut in film history.     G.A Smith pioneered the use of the close-up shot in his 1900 films  As Seen Through a Telescope  and  Grandmas Reading Glass . He further developed the ideas of breaking a scene shot in one place into a series of shots taken from different camera positions over the next couple of years, starting with The Little Doctors of 1901. In a series of films he produced at this time, he also introduced the use of subjective and objective point-of-view shots, the creation of dream-time and the use of reversing. He summed up his work in Mary Janes Mishap of 1903, with repeated cuts in to a close shot of a housemaid fooling around, along with superimpositions and other devices, before abandoning film-making to invent the Kinemacolor system of colour cinematography. His films were the first to establish the basics of coherent narrative and what became known as film language, or ": null
    },
    {
        "film grammar": "Film Grammar"
    },
    {
        " .       James Williamson concentrated on making films taking action from one place shown in one shot to the next shown in another shot in films like Stop Thief!, made in 1901, and many others. He also experimented with the close-up, and made perhaps the most extreme one of all in  The Big Swallow , when his character approaches the camera and appears to swallow it. These two film makers of the Brighton School also pioneered the editing of the film; they tinted their work with color and used trick photography to enhance the narrative. By 1900, their films were extended scenes of up to 5 minutes long.      Most films of this period were what came to be called chase films . These were inspired by ": null
    },
    {
        "James Williamsons": "James Williamson"
    },
    {
        "  Stop Thief!  of 1901, which showed a tramp stealing a leg of mutton from a butchers boy in the first shot, then being chased through the second shot by the butchers boy and assorted dogs, and finally being caught by the dogs in the third shot. Several British films made in the first half of 1903 extended the chase method of film construction. These included An Elopement à la Mode and The Pickpocket: A Chase Through London, made by Alf Collins for the British branch of the French ": null
    },
    {
        "Gaumont company": "Gaumont Film Company"
    },
    {
        ", Daring Daylight Burglary, made by ": null
    },
    {
        "Frank Mottershaw": "Frank Mottershaw"
    },
    {
        " at the Sheffield Photographic Company, and  Desperate Poaching Affray , made by ": null
    },
    {
        "William Haggar": "William Haggar"
    },
    {
        ". Haggar in particular innovated the first extant panning shots; the ": null
    },
    {
        "poachers": "Poaching"
    },
    {
        " are chased by gamekeepers and police officers and the camera pans along, creating a sense of urgency and speed.  His films were also recognised for their intelligent use of depth of staging and screen edges, while film academic ": null
    },
    {
        "Noël Burch": "Noël Burch"
    },
    {
        " praised Haggars effective use of off-screen space. Hayes, Christian. , ": null
    },
    {
        "BFI Screen Online": "British Film Institute"
    },
    {
        ". Accessed 30 August 2011. He was also one of the first film makers to purposefully introduce violence for entertainment; in Desperate Poaching Affray the villains are seen firing guns at their pursuers.        Other filmmakers took up all these ideas including the American ": null
    },
    {
        "Edwin S. Porter": "Edwin Stanton Porter"
    },
    {
        ", who started making films for the Edison Company in 1901. Porter, a projectionist, was hired by Thomas Edison to develop his new projection model known as the ": null
    },
    {
        "Vitascope": "Vitascope"
    },
    {
        ". Porter wanted to develop a style of filmmaking that would move away from the one-shot short films into a story-telling style. When he began making longer films in 1902, he put a dissolve between every shot, just as Georges Méliès was already doing, and he frequently had the same action repeated across the dissolves. His film,  The Great Train Robbery  , had a running time of twelve minutes, with twenty separate shots and ten different indoor and outdoor locations. He used ": null
    },
    {
        "cross-cutting": "Cross-Cutting"
    },
    {
        " editing": "Film Editing"
    },
    {
        " method to show simultaneous action in different places. The time continuity in The Great Train Robbery was actually more confusing than that in the films it was modeled on, but nevertheless it was a greater success than them due to its ": null
    },
    {
        "Wild West": "American Old West"
    },
    {
        " violence. The Great Train Robbery served as one of the vehicles that would launch the film medium into mass popularity.     The Pathé company in France also made imitations and variations of Smith and Williamsons films from 1902 onwards using cuts between the shots, which helped to standardize the basics of film construction. An influential French film of the period was Mélièss 14-minute-long  A Trip to the Moon .  It was extremely popular at the time of its release, and is the best-known of the hundreds of films made by Méliès. It was one of the first known ": null
    },
    {
        "science fiction films": "Science Fiction Film"
    },
    {
        ", and used innovative ": null
    },
    {
        "animation": "Animation"
    },
    {
        " and ": null
    },
    {
        "special effects": "Special Effects"
    },
    {
        ", including the well-known image of the spaceship landing in the Moons eye. The sheer volume of Pathés production led to their filmmakers giving a further precision and polish to the details of film continuity.                    When cinematography was introduced, animation was familiar from various optical toys , magic lantern shows and from Emile Reynauds  Pantomimes Lumineuses . It took over a decade before animation started to play a role in cinemas with ": null
    },
    {
        "stop motion": "Stop Motion"
    },
    {
        " short films like ": null
    },
    {
        "Segundo de Chomóns": "Segundo De Chomón"
    },
    {
        " Le théâtre de Bob and ": null
    },
    {
        "J. Stuart Blacktons": "J. Stuart Blackton"
    },
    {
        " The Haunted Hotel as well as hand-drawn short animation films like Blacktons 1906 film  Humorous Phases of Funny Faces  and ": null
    },
    {
        "Émile Cohls": "Émile Cohl"
    },
    {
        "  Fantasmagorie  .     The worlds first animated feature film was  El Apóstol  , made by Italian-Argentine cartoonist ": null
    },
    {
        "Quirino Cristiani": "Quirino Cristiani"
    },
    {
        " utilizing cutout animation. Cristiani also directed the first animated feature film with sound,  Peludópolis , released with a vitaphone sound-on-disc synchronization system soundtrack. Unfortunately, a fire that destroyed producer Federico Valles film studio incinerated the only known copies of the movies, and they are now considered lost films.             Films at the time were no longer than one reel, although some multi-reel films had been made on the life of Christ in the first few years of cinema. The first feature-length multi-reel film in the world was the 1906 Australian production called  The Story of the Kelly Gang .      It traced the life of the legendary infamous ": null
    },
    {
        "outlaw": "Outlaw"
    },
    {
        " and ": null
    },
    {
        "bushranger": "Bushranger"
    },
    {
        " Ned Kelly": "Ned Kelly"
    },
    {
        " and ran for more than an hour with a reel length of approximately 4,000 feet . Ray Edmondson and Andrew Pike Australias Lost Films. P.13. National Library of Australia, Canberra.  It was first shown at the ": null
    },
    {
        "Athenaeum Hall": "Melbourne Athenaeum"
    },
    {
        " in Collins Street, Melbourne, Australia on 26 December 1906 and in the UK in January 1908.  Ina Bertrand and Ken Robb The continuing saga of...The Story of the Kelly Gang. Cinema Papers, No. 36, February 1982, p.18-22              The first successful permanent theatre showing only films was The Nickelodeon , which was opened in Pittsburgh in 1905. By then there were enough films several minutes long available to fill a programme running for at least half an hour, and which could be changed weekly when the local audience became bored with it. Other exhibitors in the United States quickly followed suit, and within a couple of years there were thousands of these ": null
    },
    {
        "nickelodeons": "Nickelodeon"
    },
    {
        " in operation. The American experience led to a worldwide boom in the production and exhibition of films from 1906 onwards.     By 1907 purpose-built cinemas for motion pictures were being opened across the United States, Britain and France. The films were often shown with the accompaniment of music provided by a pianist, though there could be more musicians. There were also a very few larger cinemas in some of the biggest cities. Initially, the majority of films in the programmes were ": null
    },
    {
        "Pathé": "Pathé"
    },
    {
        " films, but this changed fairly quickly as the American companies cranked up production. The programme was made up of just a few films, and the show lasted around 30 minutes. The reel of film, of maximum length , which usually contained one individual film, became the standard unit of film production and exhibition in this period. The programme was changed twice or more a week, but went up to five changes of programme a week after a couple of years. In general, cinemas were set up in the established entertainment districts of the cities. In 1907, Pathé began renting their films to cinemas through film exchanges rather than selling the films outright.        By about 1910, actors began to receive screen credit for their roles, and the way to the creation of film stars was opened. Films were increasingly longer, and began to feature proper plots and development.     The litigation over patents between all the major American film-making companies led to the formation of a trust to control the American film business, with each company in the trust being allocated production quotas . However, although 6,000 exhibitors signed up to the trust, about 2,000 others did not and began to fund new film producing companies. By 1912 the independents had nearly half of the market and the government defeated the trust by initiating ": null
    },
    {
        "anti-trust": "Antitrust"
    },
    {
        " action at the same time.     In the early 20th century, before ": null
    },
    {
        "Hollywood": "Hollywood, Los Angeles"
    },
    {
        ", the motion picture industry was based in ": null
    },
    {
        "Fort Lee, New Jersey": "Americas First Motion Picture Industry"
    },
    {
        " across the Hudson River from New York City. Kannapell, Andrea. ,  The New York Times , October 4, 1998. Accessed December 7, 2013. Amith, Dennis. , J!-ENTonline.com, January 1, 2011. Accessed December 7, 2013. When Hollywood, California, was mostly orange groves, Fort Lee, New Jersey, was a center of American film production. Rose, Lisa.,  The Star-Ledger , April 29, 2012. Accessed December 7, 2013. Back in 1912, when Hollywood had more cattle than cameras, Fort Lee was the center of the cinematic universe. Icons from the silent era like Mary Pickford, Lionel Barrymore and Lillian Gish crossed the Hudson River via ferry to emote on Fort Lee back lots. In need of a winter headquarters, moviemakers were attracted to ": null
    },
    {
        "Jacksonville, Florida": "Jacksonville, Florida"
    },
    {
        " due to its warm climate, exotic locations, excellent rail access, and cheaper labor, earning the city the title of The Winter Film Capital of the World. New York-based ": null
    },
    {
        "Kalem Studios": "Kalem Studios"
    },
    {
        " was the first to open a permanent studio in Jacksonville in 1908. Over the course of the next decade, more than 30 silent film companies established studios in town, including ": null
    },
    {
        "Metro Pictures": "Metro Pictures"
    },
    {
        " , ": null
    },
    {
        "Edison Studios": "Edison Studios"
    },
    {
        ", Majestic Films, King Bee Film Company, ": null
    },
    {
        "Vim Comedy Company": "Vim Comedy Company"
    },
    {
        ", ": null
    },
    {
        "Norman Studios": "Norman Studios"
    },
    {
        ", ": null
    },
    {
        "Gaumont Studios": "Gaumont Studios"
    },
    {
        " and the ": null
    },
    {
        "Lubin Manufacturing Company": "Lubin Manufacturing Company"
    },
    {
        ". Comedic actor and Georgia native ": null
    },
    {
        "Oliver Babe Hardy": "Oliver Hardy"
    },
    {
        " began his motion picture career here in 1914. He starred in over 36 short silent films his first year acting. With the closing of Lubin in early 1915, Oliver moved to New York then New Jersey to find film jobs. Acquiring a job with the Vim Company in early 1915, he returned to ": null
    },
    {
        "Jacksonville": "Jacksonville"
    },
    {
        " in the spring of 1917 before relocating to Los Angeles in October 1917. The first motion picture made in ": null
    },
    {
        "Technicolor": "Technicolor"
    },
    {
        " and the first feature-length color movie produced in the United States, ": null
    },
    {
        "The Gulf Between": "The Gulf Between"
    },
    {
        ", was also filmed on location in Jacksonville in 1917.     Jacksonville was especially important to the ": null
    },
    {
        "African American film": "African-American Art"
    },
    {
        " industry. One notable individual in this regard is the European American producer Richard Norman, who created a string of films starring black actors in the vein of ": null
    },
    {
        "Oscar Micheaux": "Oscar Micheaux"
    },
    {
        " and the ": null
    },
    {
        "Lincoln Motion Picture Company": "Lincoln Motion Picture Company"
    },
    {
        ". In contrast to the degrading parts offered in certain white films such as ": null
    },
    {
        "The Birth of a Nation": "The Birth Of A Nation"
    },
    {
        ", Norman and his contemporaries sought to create positive stories featuring African Americans in what he termed splendidly assuming different roles.     Jacksonvilles mostly conservative residents, however, objected to the hallmarks of the early movie industry, such as car chases in the streets, simulated bank robberies and fire alarms in public places, and even the occasional riot. In 1917, conservative Democrat ": null
    },
    {
        "John W. Martin": "John W. Martin"
    },
    {
        " was elected mayor on the platform of taming the citys movie industry. By that time, southern ": null
    },
    {
        "California": "California"
    },
    {
        " was emerging as the major movie production center, thanks in large part to the move of film pioneers like ": null
    },
    {
        "William Selig": "William Selig"
    },
    {
        " and ": null
    },
    {
        "D.W. Griffith": "D.W. Griffith"
    },
    {
        " to the area. These factors quickly sealed the demise of Jacksonville as a major film destination.     Another factor for the industrys move west was that up until 1913, most American film production was still carried out around New York, but due to the monopoly of ": null
    },
    {
        "Thomas A. Edison, Inc.s": "Thomas A. Edison, Inc."
    },
    {
        " film patents and its litigious attempts to preserve it, many filmmakers moved to Southern California, starting with ": null
    },
    {
        "Selig": "William Nicholas Selig"
    },
    {
        " in 1909. The sunshine and scenery was important for the production of Westerns, which came to form a major American film genre with the first cowboy stars, ": null
    },
    {
        "G.M. Anderson ": "Broncho Billy Anderson"
    },
    {
        " and ": null
    },
    {
        "Tom Mix": "Tom Mix"
    },
    {
        ". Selig pioneered the use of wild animals from a zoo for a series of exotic adventures, with the actors being menaced or saved by the animals. ": null
    },
    {
        "Kalem Company": "Kalem Company"
    },
    {
        " sent film crews to places in America and abroad to film stories in the actual places they were supposed to have happened. Kalem also pioneered the female action heroine from 1912, with ": null
    },
    {
        "Ruth Roland": "Ruth Roland"
    },
    {
        " playing starring roles in their Westerns.     In France, Pathé retained its dominant position, followed still by Gaumont, and then other new companies that appeared to cater to the film boom. A film company with a different approach was Film dArt. This was set up at the beginning of 1908 to make films of a serious artistic nature. Their declared programme was to make films using only the best dramatists, artists and actors. The first of these was  LAssassinat du Duc de Guise  , a historical subject set in the court of ": null
    },
    {
        "Henri III": "Henry Iii Of France"
    },
    {
        ". This film used leading actors from the ": null
    },
    {
        "Comédie-Française": "Comédie-Française"
    },
    {
        ", and had a special accompanying score written by ": null
    },
    {
        "Camille Saint-Saëns": "Camille Saint-Saëns"
    },
    {
        ". The other French majors followed suit, and this wave gave rise to the English-language description of films with artistic pretensions aimed at a sophisticated audience as ": null
    },
    {
        " art films ": "Art Film"
    },
    {
        ". By 1910, the French film companies were starting to make films as long as two, or even three reels, though most were still one reel long. This trend was followed in Italy, Denmark, and Sweden.     In Britain, the ": null
    },
    {
        "Cinematograph Act 1909": "Cinematograph Act 1909"
    },
    {
        " was the first ": null
    },
    {
        "primary legislation": "Primary Legislation"
    },
    {
        " to specifically regulate the ": null
    },
    {
        "film industry": "Film Industry"
    },
    {
        ". ": null
    },
    {
        "Film exhibitions": "Cinematograph"
    },
    {
        " often took place in temporary venues and the use of highly flammable ": null
    },
    {
        "cellulose nitrate": "Nitrocellulose"
    },
    {
        " for film, combined with ": null
    },
    {
        "limelight": "Limelight"
    },
    {
        " illumination, created a significant fire hazard. The Act specified a strict building code which required, amongst other things, that the projector be enclosed within a fire resisting enclosure.      Regular newsreels were exhibited from 1910 and soon became a popular way for finding out the news the ": null
    },
    {
        "British Antarctic Expedition": "British Antarctic Expedition, 1910–13"
    },
    {
        " to the ": null
    },
    {
        "South Pole": "South Pole"
    },
    {
        " was filmed for the newsreels as were the ": null
    },
    {
        "suffragette": "Suffragette"
    },
    {
        " demonstrations that were happening at the same time. ": null
    },
    {
        "F. Percy Smith": "F. Percy Smith"
    },
    {
        " was an early ": null
    },
    {
        "nature documentary": "Nature Documentary"
    },
    {
        " pioneer working for ": null
    },
    {
        "Charles Urban": "Charles Urban"
    },
    {
        " and he pioneered the use of time lapse and micro cinematography in his 1910 documentary on the growth of flowers.         With the worldwide film boom, yet more countries now joined Britain, France, Germany and the United States in serious film production. In Italy, production was spread over several centres, with Turin being the first and biggest. There, ": null
    },
    {
        "Ambrosio": "Ambrosio Film"
    },
    {
        " was the first company in the field in 1905, and remained the largest in the country through this period. Its most substantial rival was ": null
    },
    {
        "Cines": "Cines"
    },
    {
        " in Rome, which started producing in 1906. The great strength of the ": null
    },
    {
        "Italian industry": "Cinema Of Italy"
    },
    {
        " was historical epics, with large casts and massive scenery. As early as 1911, ": null
    },
    {
        "Giovanni Pastrones": "Giovanni Pastrone"
    },
    {
        " two-reel La Caduta di Troia  made a big impression worldwide, and it was followed by even bigger glasses like  Quo Vadis?  , which ran for 90 minutes, and Pastrones  Cabiria  of 1914, which ran for two and a half hours.     Italian companies also had a strong line in slapstick comedy, with actors like ": null
    },
    {
        "André Deed": "André Deed"
    },
    {
        ", known locally as Cretinetti , and elsewhere as Foolshead and Gribouille , achieving worldwide fame with his almost surrealistic gags.     The most important film-producing country in Northern Europe up until the First World War was Denmark. The ": null
    },
    {
        "Nordisk": "Nordisk Film"
    },
    {
        " company was set up there in 1906 by ": null
    },
    {
        "Ole Olsen": "Ole Olsen"
    },
    {
        ", a fairground showman, and after a brief period imitating the successes of French and British filmmakers, in 1907 he produced 67 films, most directed by Viggo Larsen, with sensational subjects like Den hvide Slavinde , Isbjørnenjagt  and Løvejagten . By 1910, new smaller Danish companies began joining the business, and besides making more films about the ": null
    },
    {
        "white slave trade": "White Slavery"
    },
    {
        ", they contributed other new subjects. The most important of these finds was ": null
    },
    {
        "Asta Nielsen": "Asta Nielsen"
    },
    {
        " in  Afgrunden , directed by ": null
    },
    {
        "Urban Gad": "Urban Gad"
    },
    {
        " for Kosmorama, This combined the circus, sex, jealousy and murder, all put over with great conviction, and pushed the other Danish filmmakers further in this direction. By 1912, the Danish film companies were multiplying rapidly.     The ": null
    },
    {
        "Swedish film industry": "Cinema Of Sweden"
    },
    {
        " was smaller and slower to get started than the Danish industry. Here, the important man was ": null
    },
    {
        "Charles Magnusson": "Charles Magnusson"
    },
    {
        ", a newsreel cameraman for the Svenskabiografteatern cinema chain. He started fiction film production for them in 1909, directing a number of the films himself. Production increased in 1912, when the company engaged ": null
    },
    {
        "Victor Sjöström": "Victor Sjöström"
    },
    {
        " and ": null
    },
    {
        "Mauritz Stiller": "Mauritz Stiller"
    },
    {
        " as directors. They started out by imitating the subjects favoured by the Danish film industry, but by 1913 they were producing their own strikingly original work, which sold very well.     Russia began its film industry in 1908 with Pathé shooting some fiction subjects there, and then the creation of real Russian film companies by ": null
    },
    {
        "Aleksandr Drankov": "Aleksandr Drankov"
    },
    {
        " and ": null
    },
    {
        "Aleksandr Khanzhonkov": "Aleksandr Khanzhonkov"
    },
    {
        ". The Khanzhonkov company quickly became much the largest Russian film company, and remained so until 1918.     In Germany, ": null
    },
    {
        "Oskar Messter": "Oskar Messter"
    },
    {
        " had been involved in film-making from 1896, but did not make a significant number of films per year until 1910. When the worldwide film boom started, he, and the few other people in the German film business, continued to sell prints of their own films outright, which put them at a disadvantage. It was only when ": null
    },
    {
        "Paul Davidson": "Paul Davidson"
    },
    {
        ", the owner of a chain of cinemas, brought Asta Nielsen and Urban Gad to Germany from Denmark in 1911, and set up a production company, Projektions-AG Union , for them, that a change-over to renting prints began. Messter replied with a series of longer films starring Henny Porten, but although these did well in the German-speaking world, they were not particularly successful internationally, unlike the Asta Nielsen films. Another of the growing German film producers just before World War I was the German branch of the French ": null
    },
    {
        "Éclair": "Eclair"
    },
    {
        " company, Deutsche Éclair. This was expropriated by the German government, and turned into DECLA when the war started. But altogether, German producers only had a minor part of the German market in 1914.     Overall, from about 1910, American films had the largest share of the market in all European countries except France, and even in France, the American films had just pushed the local production out of first place on the eve of World War I. So even if the war had not happened, American films may have become dominant worldwide. Although the war made things much worse for European producers, the technical qualities of American films made them increasingly attractive to audiences everywhere.          New film techniques that were introduced in this period include the use of artificial lighting, fire effects and ": null
    },
    {
        "Low-key lighting": "Low-Key Lighting"
    },
    {
        " for enhanced atmosphere during sinister scenes.     Continuity of action from shot to shot was also refined, such as in Pathés le Cheval emballé  where ": null
    },
    {
        "cross-cutting between parallel actions": "Cross Cutting"
    },
    {
        " is used. ": null
    },
    {
        "D. W. Griffith": "David Wark Griffith"
    },
    {
        " also began using cross-cutting in the film  The Fatal Hour , made in July 1908. Another development was the use of the ": null
    },
    {
        "Point of View shot": "Point Of View Shot"
    },
    {
        ", first used in 1910 in Vitagraphs Back to Nature. Insert shots were also used for artistic purposes; the Italian film La mala planta , directed by ": null
    },
    {
        "Mario Caserini": "Mario Caserini"
    },
    {
        " had an insert shot of a snake slithering over the Evil Plant .     As films grew longer, specialist writers were employed to simplify more complex stories derived from novels or plays into a form that could be contained on one reel. ": null
    },
    {
        "Genres": "Genres"
    },
    {
        " began to be used as categories; the main division was into comedy and drama, but these categories were further subdivided.     ": null
    },
    {
        "Intertitles": "Intertitles"
    },
    {
        " containing lines of dialogue began to be used consistently from 1908 onwards, such as in Vitagraphs An Auto Heroine; or, The Race for the Vitagraph Cup and How It Was Won. The dialogue was eventually inserted into the middle of the scene and became commonplace by 1912. The introduction of dialogue titles transformed the nature of film narrative. When dialogue titles came to be always cut into a scene just after a character starts speaking, and then left with a cut to the character just before they finish speaking, then one had something that was effectively the equivalent of a present-day sound film.              The years of the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        " were a complex transitional period for the film industry. The exhibition of films changed from short one-reel programmes to feature films. Exhibition venues became larger and began charging higher prices.     In the United States, these changes brought destruction to many film companies, the Vitagraph company being an exception. Film production began to shift to ": null
    },
    {
        "Los Angeles": "Los Angeles"
    },
    {
        " during World War I. The ": null
    },
    {
        "Universal Film Manufacturing Company": "Universal Studios"
    },
    {
        " was formed in 1912 as an umbrella company. New entrants included the ": null
    },
    {
        "Jesse Lasky": "Jesse L. Lasky"
    },
    {
        " Feature Play Company, and Famous Players, both formed in 1913, and later amalgamated into ": null
    },
    {
        "Famous Players-Lasky": "Famous Players-Lasky"
    },
    {
        ". The biggest success of these years was ": null
    },
    {
        "David Wark Griffiths": "David Wark Griffith"
    },
    {
        "  The Birth of a Nation  . Griffith followed this up with the even bigger  Intolerance  , but, due to the high quality of film produced in the US, the market for their films was high.     In France, film production shut down due to the general ": null
    },
    {
        "military mobilization": "Mobilization"
    },
    {
        " of the country at the start of the war. Although film production began again in 1915, it was on a reduced scale, and the biggest companies gradually retired from production. Italian film production held up better, although so called diva films , starring anguished female leads were a commercial failure. In Denmark, the Nordisk company increased its production so much in 1915 and 1916 that it could not sell all its films, which led to a very sharp decline in Danish production, and the end of Denmarks importance on the world film scene.     The ": null
    },
    {
        "German film industry": "Cinema Of Germany"
    },
    {
        " was seriously weakened by the war. The most important of the new film producers at the time was ": null
    },
    {
        "Joe May": "Joe May"
    },
    {
        ", who made a series of thrillers and ": null
    },
    {
        "adventure films": "Adventure Film"
    },
    {
        " through the war years, but ": null
    },
    {
        "Ernst Lubitsch": "Ernst Lubitsch"
    },
    {
        " also came into prominence with a series of very successful comedies and dramas.          At this time, studios were blacked out to allow shooting to be unaffected by changing sunlight. This was replaced with floodlights and spotlights. The widespread adoption of irising-in and out to begin and end scenes caught on in this period. This is the revelation of a film shot in a circular mask, which gradually gets larger until it expands beyond the frame. Other shaped slits were used, including vertical and diagonal apertures.     A new idea taken over from still photography was ": null
    },
    {
        "soft focus": "Soft Focus"
    },
    {
        " . This began in 1915, with some shots being intentionally thrown out of focus for expressive effect, as in ": null
    },
    {
        "Mary Pickford": "Mary Pickford"
    },
    {
        " starrer  Fanchon the Cricket .     It was during this period that camera effects intended to convey the subjective feelings of characters in a film really began to be established. These could now be done as Point of View  shots, as in Sidney Drews The Story of the Glove , where a wobbly hand-held shot of a door and its keyhole represents the POV of a drunken man. The use of anamorphic images first appears in these years with ": null
    },
    {
        "Abel Gance": "Abel Gance"
    },
    {
        " directed  la Folie du Docteur Tube . In this film the effect of a drug administered to a group of people was suggested by shooting the scenes reflected in a ": null
    },
    {
        "distorting mirror": "Curved Mirror"
    },
    {
        " of the fair-ground type.     Symbolic effects taken over from conventional literary and artistic tradition continued to make some appearances in films during these years. In D. W. Griffiths  The Avenging Conscience  , the title The birth of the evil thought precedes a series of three shots of the protagonist looking at a spider, and ants eating an insect. Symbolist art and literature from the turn of the century also had a more general effect on a small number of films made in Italy and Russia. The supine acceptance of death resulting from passion and forbidden longings was a major feature of this art, and states of delirium dwelt on at length were important as well.        The use of ": null
    },
    {
        "insert shots": "Insert"
    },
    {
        ", i.e. close-ups of objects other than faces, had already been established by the Brighton school, but were infrequently used before 1914. It is really only with Griffiths The Avenging Conscience that a new phase in the use of the Insert Shot starts. As well as the symbolic inserts already mentioned, the film also made extensive use of large numbers of Big Close Up shots of clutching hands and tapping feet as a means of emphasizing those parts of the body as indicators of psychological tension.     Atmospheric inserts were developed in Europe in the late 1910s. This kind of shot is one in a scene which neither contains any of the characters in the story, nor is a Point of View shot seen by one of them. An early example is in ": null
    },
    {
        "Maurice Tourneur": "Maurice Tourneur"
    },
    {
        " directed  The Pride of the Clan  , in which there is a series of shots of waves beating on a rocky shore to demonstrate the harsh lives of the fishing folk. ": null
    },
    {
        "Maurice Elveys": "Maurice Elvey"
    },
    {
        "  Nelson; The Story of Englands Immortal Naval Hero  has a symbolic sequence dissolving from a picture of ": null
    },
    {
        "Kaiser Wilhelm II": "William Ii, German Emperor"
    },
    {
        " to a peacock, and then to a battleship.     By 1914, continuity cinema was the established mode of commercial cinema. One of the advanced continuity techniques involved an accurate and smooth transition from one shot to another. Cutting to different angles within a scene also became well-established as a technique for dissecting a scene into shots in American films. If the direction of the shot changes by more than ninety degrees, it is called a reverse-angle cutting. The leading figure in the full development of reverse-angle cutting was ": null
    },
    {
        "Ralph Ince": "Ralph Ince"
    },
    {
        " in his films, such as The Right Girl and His Phantom Sweetheart     The use of ": null
    },
    {
        "flash-back": "Flashback"
    },
    {
        " structures continued to develop in this period, with the usual way of entering and leaving a flash-back being through a dissolve. The Vitagraph companys  The Man That Might Have Been  , is even more complex, with a series of reveries and flash-backs that contrast the protagonists real passage through life with what might have been, if his son had not died.     After 1914, ": null
    },
    {
        "cross cutting": "Cross Cutting"
    },
    {
        " between parallel actions came to be used more so in American films than in European ones. Cross-cutting was often used to get new effects of contrast, such as the cross-cut sequence in ": null
    },
    {
        "Cecil B. DeMilles": "Cecil B. Demille"
    },
    {
        "  The Whispering Chorus  , in which a supposedly dead husband is having a liaison with a Chinese prostitute in an opium den, while simultaneously his unknowing wife is being remarried in church.          The general trend in the development of cinema, led from the United States, was towards using the newly developed specifically filmic devices for expression of the narrative content of film stories, and combining this with the standard dramatic structures already in use in commercial theatre. ": null
    },
    {
        "D. W. Griffith": "David Wark Griffith"
    },
    {
        " had the highest standing amongst American directors in the industry, because of the dramatic excitement he conveyed to the audience through his films. ": null
    },
    {
        "Cecil B. DeMilles": "Cecil B. Demille"
    },
    {
        "  The Cheat  , brought out the moral dilemmas facing their characters in a more subtle way than Griffith. DeMille was also in closer touch with the reality of contemporary American life. ": null
    },
    {
        "Maurice Tourneur": "Maurice Tourneur"
    },
    {
        " was also highly ranked for the pictorial beauties of his films, together with the subtlety of his handling of fantasy, while at the same time he was capable of getting greater ": null
    },
    {
        "naturalism": "Naturalism"
    },
    {
        " from his actors at appropriate moments, as in  A Girls Folly  .     ": null
    },
    {
        "Sidney Drew": "Mr.  &  Mrs. Sidney Drew"
    },
    {
        " was the leader in developing polite comedy , while slapstick was refined by ": null
    },
    {
        "Fatty Arbuckle": "Roscoe Arbuckle"
    },
    {
        " and ": null
    },
    {
        "Charles Chaplin": "Charlie Chaplin"
    },
    {
        ", who both started with ": null
    },
    {
        "Mack Sennetts": "Mack Sennett"
    },
    {
        " Keystone company. They reduced the usual frenetic pace of Sennetts films to give the audience a chance to appreciate the subtlety and finesse of their movement, and the cleverness of their gags. By 1917 Chaplin was also introducing more dramatic plot into his films, and mixing the comedy with sentiment.     In Russia, ": null
    },
    {
        "Yevgeni Bauer": "Yevgeni Bauer"
    },
    {
        " put a slow intensity of acting combined with Symbolist overtones onto film in a unique way.     In Sweden, ": null
    },
    {
        "Victor Sjöström": "Victor Sjöström"
    },
    {
        " made a series of films that combined the realities of peoples lives with their surroundings in a striking manner, while Mauritz Stiller developed sophisticated comedy to a new level.     In Germany, ": null
    },
    {
        "Ernst Lubitsch": "Ernst Lubitsch"
    },
    {
        " got his inspiration from the stage work of ": null
    },
    {
        "Max Reinhardt": "Max Reinhardt"
    },
    {
        ", both in bourgeois comedy and in spectacle, and applied this to his films, culminating in his  die Puppe  ,  die Austernprinzessin   and  Madame DuBarry .          At the start of the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ", ": null
    },
    {
        "French": "Cinema Of France"
    },
    {
        " and ": null
    },
    {
        "Italian": "Cinema Of Italy"
    },
    {
        " cinema had been the most globally popular. The war came as a devastating interruption to European film industries. The American industry, or Hollywood , as it was becoming known after ": null
    },
    {
        "its new geographical center in California": "Hollywood, Los Angeles"
    },
    {
        ", gained the position it has held, more or less, ever since: film factory for the world and exporting its product to most countries on earth.     By the 1920s, the United States reached what is still its era of greatest-ever output, producing an average of 800 feature films annually,  or 82% of the global total . The comedies of ": null
    },
    {
        "Charlie Chaplin": "Charlie Chaplin"
    },
    {
        " and ": null
    },
    {
        "Buster Keaton": "Buster Keaton"
    },
    {
        ", the ": null
    },
    {
        "swashbuckling": "Swashbuckler"
    },
    {
        " adventures of ": null
    },
    {
        "Douglas Fairbanks": "Douglas Fairbanks"
    },
    {
        " and the romances of ": null
    },
    {
        "Clara Bow": "Clara Bow"
    },
    {
        ", to cite just a few examples, made these performers faces well known on every continent. The Western visual norm that would become classical ": null
    },
    {
        "continuity editing": "Continuity Editing"
    },
    {
        " was developed and exported – although its adoption was slower in some non-Western countries without strong ": null
    },
    {
        "realist": "Realism"
    },
    {
        " traditions in art and drama, such as ": null
    },
    {
        "Japan": "Cinema Of Japan"
    },
    {
        ".     This development was contemporary with the growth of the ": null
    },
    {
        "studio system": "Studio System"
    },
    {
        " and its greatest publicity method, the ": null
    },
    {
        "star system": "Star System"
    },
    {
        ", which characterized American film for decades to come and provided models for other film industries. The studios efficient, top-down control over all stages of their product enabled a new and ever-growing level of lavish production and technical sophistication. At the same time, the systems commercial regimentation and focus on glamorous ": null
    },
    {
        "escapism": "Escapism"
    },
    {
        " discouraged daring and ambition beyond a certain degree, a prime example being the brief but still legendary directing career of the iconoclastic ": null
    },
    {
        "Erich von Stroheim": "Erich Von Stroheim"
    },
    {
        " in the late teens and the 1920s.                During late 1927, Warners released  The Jazz Singer , which was mostly silent but contained what is generally regarded as the first synchronized dialogue in a feature film; but this process was actually accomplished first by ": null
    },
    {
        "Charles Taze Russell": "Charles Taze Russell"
    },
    {
        " in 1914 with the lengthy film  The Photo-Drama of Creation . This drama consisted of picture slides and moving pictures synchronized with ": null
    },
    {
        "phonograph": "Phonograph"
    },
    {
        " records of talks and music. The early ": null
    },
    {
        "sound-on-disc": "Sound-On-Disc"
    },
    {
        " processes such as ": null
    },
    {
        "Vitaphone": "Vitaphone"
    },
    {
        " were soon superseded by ": null
    },
    {
        "sound-on-film": "Sound-On-Film"
    },
    {
        " methods like Fox ": null
    },
    {
        "Movietone": "Movietone Sound System"
    },
    {
        ", DeForest ": null
    },
    {
        "Phonofilm": "Phonofilm"
    },
    {
        ", and ": null
    },
    {
        "RCA Photophone": "Rca Photophone"
    },
    {
        ". The trend convinced the largely reluctant industrialists that talking pictures , or talkies , were the future. A lot of attempts were made before the success of The Jazz Singer, that can be seen in the ": null
    },
    {
        "List of film sound systems": "List Of Film Sound Systems"
    },
    {
        ".     The change was remarkably swift. By the end of 1929, Hollywood was almost all-talkie, with several competing sound systems . Total changeover was slightly slower in the rest of the world, principally for economic reasons. Cultural reasons were also a factor in countries like ": null
    },
    {
        "China": "Cinema Of China"
    },
    {
        " and ": null
    },
    {
        "Japan": "Cinema Of Japan"
    },
    {
        ", where silents co-existed successfully with sound well into the 1930s, indeed producing what would be some of the most revered classics in those countries, like ": null
    },
    {
        "Wu Yonggangs": "Wu Yonggang"
    },
    {
        "  The Goddess  and ": null
    },
    {
        "Yasujirō Ozus": "Yasujirō Ozu"
    },
    {
        "  I Was Born, But...  . But even in Japan, a figure such as the ": null
    },
    {
        "benshi": "Benshi"
    },
    {
        ", the live narrator who was a major part of Japanese silent cinema, found his acting career was ending.     Sound further tightened the grip of major studios in numerous countries: the vast expense of the transition overwhelmed smaller competitors, while the novelty of sound lured vastly larger audiences for those producers that remained. In the case of the U.S., some historians credit sound with saving the Hollywood studio system in the face of the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        " . Thus began what is now often called The Golden Age of Hollywood , which refers roughly to the period beginning with the introduction of sound until the late 1940s. The American cinema reached its peak of efficiently manufactured glamour and global appeal during this period. The top actors of the era are now thought of as the classic film stars, such as ": null
    },
    {
        "Clark Gable": "Clark Gable"
    },
    {
        ", ": null
    },
    {
        "Katharine Hepburn": "Katharine Hepburn"
    },
    {
        ", ": null
    },
    {
        "Humphrey Bogart": "Humphrey Bogart"
    },
    {
        ", ": null
    },
    {
        "Greta Garbo": "Greta Garbo"
    },
    {
        ", and the greatest box office draw of the 1930s, child performer ": null
    },
    {
        "Shirley Temple": "Shirley Temple"
    },
    {
        ".            Creatively, however, the rapid transition was a difficult one, and in some ways, film briefly reverted to the conditions of its earliest days. The late 20s were full of static, stagey talkies as artists in front of and behind the camera struggled with the stringent limitations of the early sound equipment and their own uncertainty as to how to utilize the new medium. Many stage performers, directors and writers were introduced to cinema as producers sought personnel experienced in dialogue-based storytelling. Many major silent filmmakers and actors were unable to adjust and found their careers severely curtailed or even ended.     This awkward period was fairly short-lived. 1929 was a watershed year: ": null
    },
    {
        "William Wellman": "William Wellman"
    },
    {
        " with  Chinatown Nights  and  The Man I Love , ": null
    },
    {
        "Rouben Mamoulian": "Rouben Mamoulian"
    },
    {
        " with  Applause , ": null
    },
    {
        "Alfred Hitchcock": "Alfred Hitchcock"
    },
    {
        " with  Blackmail  , were among the directors to bring greater fluidity to talkies and experiment with the expressive use of sound . In this, they both benefited from, and pushed further, technical advances in microphones and cameras, and capabilities for editing and post-synchronizing sound .        Sound films emphasized black history and benefited different ": null
    },
    {
        "genres": "Genres"
    },
    {
        " more so than silents did. Most obviously, the ": null
    },
    {
        "musical film": "Musical Film"
    },
    {
        " was born; the first classic-style Hollywood musical was  The Broadway Melody  and the form would find its first major creator in ": null
    },
    {
        "choreographer": "Choreographer"
    },
    {
        "/director ": null
    },
    {
        "Busby Berkeley": "Busby Berkeley"
    },
    {
        " . In France, ": null
    },
    {
        "avant-garde": "Avant-Garde"
    },
    {
        " director ": null
    },
    {
        "René Clair": "René Clair"
    },
    {
        " made ": null
    },
    {
        "surreal": "Surrealism"
    },
    {
        " use of song and dance in comedies like  Under the Roofs of Paris  and  Le Million  . ": null
    },
    {
        "Universal Pictures": "Universal Pictures"
    },
    {
        " began releasing ": null
    },
    {
        "gothic horror": "Gothic Horror"
    },
    {
        " films like  Dracula  and  Frankenstein  . In 1933, ": null
    },
    {
        "RKO Pictures": "Rko Pictures"
    },
    {
        " released ": null
    },
    {
        "Merian C. Coopers": "Merian C. Cooper"
    },
    {
        " classic giant monster film  King Kong . The trend thrived best in ": null
    },
    {
        "India": "Cinema Of India"
    },
    {
        ", where the influence of the countrys traditional song-and-dance drama made the musical the basic form of most sound films ; virtually unnoticed by the Western world for decades, this Indian popular cinema would nevertheless become the worlds most prolific.      At this time, American ": null
    },
    {
        "gangster films": "Gangster Film"
    },
    {
        " like  Little Caesar  and Wellmans  The Public Enemy  became popular. Dialogue now took precedence over slapstick in Hollywood comedies: the fast-paced, witty banter of  The Front Page  or  It Happened One Night  , the sexual double entrendres of ": null
    },
    {
        "Mae West": "Mae West"
    },
    {
        "  or the often subversively anarchic nonsense talk of the ": null
    },
    {
        "Marx Brothers": "Marx Brothers"
    },
    {
        " . ": null
    },
    {
        "Walt Disney": "Walt Disney"
    },
    {
        ", who had previously been in the short cartoon business, stepped into feature films with the first English-speaking animated feature  Snow White and the Seven Dwarfs ; released by ": null
    },
    {
        "RKO Pictures": "Rko Pictures"
    },
    {
        " in 1937. 1939, a major year for American cinema, brought such films as  The Wizard of Oz  and  Gone with The Wind .       Previously, it was believed that color films were first projected in 1909 at the ": null
    },
    {
        "Palace Theatre": "Palace Theatre, London"
    },
    {
        " in London . But in fact, it was in 1901 when the first color film in history was created. This untitled film was directed by photographer ": null
    },
    {
        "Edward Raymond Turner": "Edward Raymond Turner"
    },
    {
        " and his patron ": null
    },
    {
        "Frederick Marshall Lee": "Fred Lee"
    },
    {
        ". The way they did it was to use black and white film rolls, but have green, red, and blue filters go over the camera individually as it shot. To complete the film, they joined the original footage and filters on a special projector. However, both the shooting of the film and its projection suffered from major unrelated issues that, eventually, sank the idea.     Subsequently, in 1916, the ": null
    },
    {
        "technicolor": "Technicolor"
    },
    {
        " technique arrived . The first audiovisual piece that was completely realized with this technique was the short of ": null
    },
    {
        "Walt Disney": "Walt Disney"
    },
    {
        " Flowers and Trees": "Flowers And Trees"
    },
    {
        " , directed by ": null
    },
    {
        "Burt Gillett": "Burt Gillett"
    },
    {
        " in 1932. Even so, the first film to be performed with this technique will be The Vanities Fair by Rouben Mamoulian. Later on, the technicolor was extended mainly in the musical field as ": null
    },
    {
        "The Wizard of Oz": "The Wizard Of Oz"
    },
    {
        " or ": null
    },
    {
        "Singin in the Rain": "Singin In The Rain"
    },
    {
        " , in films such as ": null
    },
    {
        "The Adventures of Robin Hood": "The Adventures Of Robin Hood"
    },
    {
        " or the animation film, ": null
    },
    {
        "Snow White and the Seven Dwarfs": "Snow White And The Seven Dwarfs"
    },
    {
        " .           The desire for wartime propaganda against the opposition created a renaissance in the film industry in Britain, with realistic war dramas like  49th Parallel  ,  Went the Day Well?  ,  The Way Ahead  and ": null
    },
    {
        "Noël Coward": "Noël Coward"
    },
    {
        " and ": null
    },
    {
        "David Leans": "David Lean"
    },
    {
        " celebrated naval film  In Which We Serve  in 1942, which won a special ": null
    },
    {
        "Academy Award": "Academy Awards"
    },
    {
        ". These existed alongside more flamboyant films like ": null
    },
    {
        "Michael Powell": "Michael Powell"
    },
    {
        " and ": null
    },
    {
        "Emeric Pressburgers": "Emeric Pressburger"
    },
    {
        "  The Life and Death of Colonel Blimp  ,  A Canterbury Tale  and  A Matter of Life and Death  , as well as ": null
    },
    {
        "Laurence Oliviers": "Laurence Olivier"
    },
    {
        " 1944 film": "1944 In Film"
    },
    {
        "  Henry V , based on the ": null
    },
    {
        "Shakespearean history": "Shakespearean Histories"
    },
    {
        "  Henry V . The success of Snow White and the Seven Dwarfs allowed Disney to make more animated features like  Pinocchio  ,  Fantasia  ,  Dumbo  and  Bambi  .     The onset of US involvement in World War II also brought a proliferation of films as both ": null
    },
    {
        "patriotism": "Patriotism"
    },
    {
        " and ": null
    },
    {
        "propaganda": "Propaganda"
    },
    {
        ". American propaganda films included  Desperate Journey  ,  Mrs. Miniver  ,  Forever and a Day  and  Objective, Burma!  . Notable American films from the war years include the anti-Nazi  Watch on the Rhine  , scripted by ": null
    },
    {
        "Dashiell Hammett": "Dashiell Hammett"
    },
    {
        ";  Shadow of a Doubt  , Hitchcocks direction of a script by ": null
    },
    {
        "Thornton Wilder": "Thornton Wilder"
    },
    {
        "; the ": null
    },
    {
        "George M. Cohan": "George M. Cohan"
    },
    {
        " biopic": "Biopic"
    },
    {
        ",  Yankee Doodle Dandy  , starring ": null
    },
    {
        "James Cagney": "James Cagney"
    },
    {
        ", and the immensely popular  Casablanca , with ": null
    },
    {
        "Humphrey Bogart": "Humphrey Bogart"
    },
    {
        ". Bogart would star in 36 films between 1934 and 1942 including ": null
    },
    {
        "John Hustons": "John Huston"
    },
    {
        "  The Maltese Falcon  , one of the first films now considered a classic ": null
    },
    {
        "film noir": "Film Noir"
    },
    {
        ". In 1941, ": null
    },
    {
        "RKO Pictures": "Rko Pictures"
    },
    {
        " released  Citizen Kane  made by ": null
    },
    {
        "Orson Welles": "Orson Welles"
    },
    {
        ". It is often considered the greatest film of all time. It would set the stage for the modern motion picture, as it revolutionized film story telling.     The strictures of wartime also brought an interest in more fantastical subjects. These included Britains ": null
    },
    {
        "Gainsborough": "Gainsborough Pictures"
    },
    {
        " melodramas , and films like  Here Comes Mr. Jordan ,  Heaven Can Wait , I Married a Witch and  Blithe Spirit . ": null
    },
    {
        "Val Lewton": "Val Lewton"
    },
    {
        " also produced a series of atmospheric and influential small-budget ": null
    },
    {
        "horror": "Horror Film"
    },
    {
        " films, some of the more famous examples being  Cat People ,  Isle of the Dead  and  The Body Snatcher . The decade probably also saw the so-called womens pictures , such as  Now, Voyager ,  Random Harvest  and  Mildred Pierce  at the peak of their popularity.     1946 saw RKO Radio releasing  Its a Wonderful Life  directed by Italian-born filmmaker ": null
    },
    {
        "Frank Capra": "Frank Capra"
    },
    {
        ". Soldiers returning from the war would provide the inspiration for films like  The Best Years of Our Lives , and many of those in the film industry had served in some capacity during the war. ": null
    },
    {
        "Samuel Fullers": "Samuel Fuller"
    },
    {
        " experiences in World War II would influence his largely autobiographical films of later decades such as  The Big Red One . ": null
    },
    {
        "The Actors Studio": "The Actors Studio"
    },
    {
        " was founded in October 1947 by ": null
    },
    {
        "Elia Kazan": "Elia Kazan"
    },
    {
        ", ": null
    },
    {
        "Robert Lewis": "Robert Lewis"
    },
    {
        ", and ": null
    },
    {
        "Cheryl Crawford": "Cheryl Crawford"
    },
    {
        ", and the same year ": null
    },
    {
        "Oskar Fischinger": "Oskar Fischinger"
    },
    {
        " filmed  Motion Painting No. 1 .     In 1943,  Ossessione  was screened in Italy, marking the beginning of ": null
    },
    {
        "Italian neorealism": "Italian Neorealism"
    },
    {
        ". Major films of this type during the 1940s included  Bicycle Thieves ,  Rome, Open City , and  La Terra Trema . In 1952  Umberto D  was released, usually considered the last film of this type.     In the late 1940s, in Britain, ": null
    },
    {
        "Ealing Studios": "Ealing Studios"
    },
    {
        " embarked on their series of celebrated comedies, including  Whisky Galore! ,  Passport to Pimlico ,  Kind Hearts and Coronets  and  The Man in the White Suit , and ": null
    },
    {
        "Carol Reed": "Carol Reed"
    },
    {
        " directed his influential thrillers  Odd Man Out ,  The Fallen Idol  and  The Third Man . ": null
    },
    {
        "David Lean": "David Lean"
    },
    {
        " was also rapidly becoming a force in world cinema with  Brief Encounter  and his ": null
    },
    {
        "Dickens": "Charles Dickens"
    },
    {
        " adaptations  Great Expectations  and  Oliver Twist , and ": null
    },
    {
        "Michael Powell": "Michael Powell"
    },
    {
        " and ": null
    },
    {
        "Emeric Pressburger": "Emeric Pressburger"
    },
    {
        " would experience the best of their creative partnership with films like  Black Narcissus  and  The Red Shoes .             The ": null
    },
    {
        "House Un-American Activities Committee": "House Un-American Activities Committee"
    },
    {
        " investigated Hollywood in the early 1950s. Protested by the ": null
    },
    {
        "Hollywood Ten": "Hollywood Blacklist"
    },
    {
        " before the committee, the hearings resulted in the ": null
    },
    {
        "blacklist": "Blacklist"
    },
    {
        "ing of many actors, writers and directors, including Chayefsky, ": null
    },
    {
        "Charlie Chaplin": "Charlie Chaplin"
    },
    {
        ", and ": null
    },
    {
        "Dalton Trumbo": "Dalton Trumbo"
    },
    {
        ", and many of these fled to Europe, especially the United Kingdom.     The ": null
    },
    {
        "Cold War era": "Cold War"
    },
    {
        " zeitgeist": "Zeitgeist"
    },
    {
        " translated into a type of near-": null
    },
    {
        "paranoia": "Paranoia"
    },
    {
        " manifested in ": null
    },
    {
        "themes": "Theme"
    },
    {
        " such as ": null
    },
    {
        "invading armies of evil aliens": "Alien Invasion"
    },
    {
        ", ; and ": null
    },
    {
        "communist": "Communism"
    },
    {
        " fifth column": "Fifth Column"
    },
    {
        "ists, .     During the immediate post-war years the cinematic industry was also threatened by television, and the increasing popularity of the medium meant that some film theatres would bankrupt and close. The demise of the studio system spurred the ": null
    },
    {
        "self-commentary": "Criticism"
    },
    {
        " of films like  Sunset Boulevard  and  The Bad and the Beautiful  .     In 1950, the ": null
    },
    {
        "Lettrists": "Lettrists"
    },
    {
        " avante-gardists caused riots at the ": null
    },
    {
        "Cannes Film Festival": "Cannes Film Festival"
    },
    {
        ", when ": null
    },
    {
        "Isidore Isous": "Isidore Isou"
    },
    {
        " Treatise on Slime and Eternity was screened. After their criticism of ": null
    },
    {
        "Charlie Chaplin": "Charlie Chaplin"
    },
    {
        " and split with the movement, the ": null
    },
    {
        "Ultra-Lettrists": "Ultra-Lettrist"
    },
    {
        " continued to cause disruptions when they showed their new ": null
    },
    {
        "hypergraphical": "Hypergraphics"
    },
    {
        " techniques.   The most notorious film is ": null
    },
    {
        "Guy Debords": "Guy Debord"
    },
    {
        " Howls for Sade of 1952.     Distressed by the increasing number of closed theatres, studios and companies would find new and innovative ways to bring audiences back. These included attempts to widen their appeal with new screen formats. ": null
    },
    {
        "Cinemascope": "Cinemascope"
    },
    {
        ", which would remain a ": null
    },
    {
        "20th Century Fox": "20Th Century Fox"
    },
    {
        " distinction until 1967, was announced with 1953s  The Robe . ": null
    },
    {
        "VistaVision": "Vistavision"
    },
    {
        ", ": null
    },
    {
        "Cinerama": "Cinerama"
    },
    {
        ", and ": null
    },
    {
        "Todd-AO": "Todd-Ao"
    },
    {
        " boasted a bigger is better approach to ": null
    },
    {
        "marketing": "Marketing"
    },
    {
        " films to a dwindling US audience. This resulted in the revival of epic films to take advantage of the new big screen formats. Some of the most successful examples of these ": null
    },
    {
        "Biblical": "Bible"
    },
    {
        " and ": null
    },
    {
        "historical": "History"
    },
    {
        " spectaculars include  The Ten Commandments  ,  The Vikings  ,  Ben-Hur  ,  Spartacus  and  El Cid  . Also during this period a number of other significant films were produced in ": null
    },
    {
        "Todd-AO": "Todd-Ao"
    },
    {
        ", developed by ": null
    },
    {
        "Mike Todd": "Mike Todd"
    },
    {
        " shortly before his death, including ": null
    },
    {
        "Oklahoma!": "Oklahoma!"
    },
    {
        " , ": null
    },
    {
        "Around the World in 80 Days": "Around The World In 80 Days"
    },
    {
        " , ": null
    },
    {
        "South Pacific": "South Pacific"
    },
    {
        " and ": null
    },
    {
        "Cleopatra": "Cleopatra"
    },
    {
        " plus many more.     ": null
    },
    {
        "Gimmicks": "Gimmick"
    },
    {
        " also proliferated to lure in audiences. The fad for ": null
    },
    {
        "3-D film": "3-D Film"
    },
    {
        " would last for only two years, 1952–1954, and helped sell  House of Wax  and  Creature from the Black Lagoon . Producer ": null
    },
    {
        "William Castle": "William Castle"
    },
    {
        " would tout films featuring Emergo Percepto , the first of a series of gimmicks that would remain popular marketing tools for Castle and others throughout the 1960s.     In the U.S., a post-WW2 tendency toward questioning the establishment and societal norms and the early ": null
    },
    {
        "activism": "Activism"
    },
    {
        " of the ": null
    },
    {
        "civil rights movement": "Civil Rights Movement"
    },
    {
        " was reflected in Hollywood films such as  Blackboard Jungle  ,  On the Waterfront  , ": null
    },
    {
        "Paddy Chayefskys": "Paddy Chayefsky"
    },
    {
        "  Marty  and ": null
    },
    {
        "Reginald Roses": "Reginald Rose"
    },
    {
        "  12 Angry Men  . Disney continued making animated films, notably;  Cinderella  ,  Peter Pan  ,  Lady and the Tramp  , and  Sleeping Beauty  . He began, however, getting more involved in live action films, producing classics like  20,000 Leagues Under the Sea  , and  Old Yeller  . Television began competing seriously with films projected in theatres, but surprisingly it promoted more filmgoing rather than curtailing it.      Limelight  is probably a unique film in at least one interesting respect. Its two leads, ": null
    },
    {
        "Charlie Chaplin": "Charlie Chaplin"
    },
    {
        " and ": null
    },
    {
        "Claire Bloom": "Claire Bloom"
    },
    {
        ", were in the industry in no less than three different centuries. In the 19th Century, Chaplin made his theatrical debut at the age of eight, in 1897, in a clog dancing troupe, The Eight Lancaster Lads. In the 21st Century, Bloom is still enjoying a full and productive career, having appeared in dozens of films and television series produced up to and including 2013. She received particular acclaim for her role in  The Kings Speech  .             Following the end of World War II in the 1940s, the following decade, the 1950s, marked a golden age for non-English ": null
    },
    {
        "world cinema": "World Cinema"
    },
    {
        ",   especially for ": null
    },
    {
        "Asian cinema": "Asian Cinema"
    },
    {
        ".   Many of the most critically acclaimed Asian films of all time were produced during this decade, including ": null
    },
    {
        "Yasujirō Ozus": "Yasujirō Ozu"
    },
    {
        "  Tokyo Story  , ": null
    },
    {
        "Satyajit Rays": "Satyajit Ray"
    },
    {
        "  The Apu Trilogy  and  Jalsaghar  , ": null
    },
    {
        "Kenji Mizoguchis": "Kenji Mizoguchi"
    },
    {
        "  Ugetsu  and  Sansho the Bailiff  , ": null
    },
    {
        "Raj Kapoors": "Raj Kapoor"
    },
    {
        "  Awaara  , ": null
    },
    {
        "Mikio Naruses": "Mikio Naruse"
    },
    {
        "  Floating Clouds  , ": null
    },
    {
        "Guru Dutts": "Guru Dutt"
    },
    {
        "  Pyaasa  and  Kaagaz Ke Phool  , and the ": null
    },
    {
        "Akira Kurosawa": "Akira Kurosawa"
    },
    {
        " films  Rashomon  ,  Ikiru  ,  Seven Samurai  and  Throne of Blood  .     During ": null
    },
    {
        "Japanese cinemas": "Cinema Of Japan"
    },
    {
        " Golden Age of the 1950s, successful films included  Rashomon  ,  Seven Samurai  and  The Hidden Fortress  by ": null
    },
    {
        "Akira Kurosawa": "Akira Kurosawa"
    },
    {
        ", as well as ": null
    },
    {
        "Yasujirō Ozus": "Yasujirō Ozu"
    },
    {
        "  Tokyo Story  and ": null
    },
    {
        "Ishirō Hondas": "Ishirō Honda"
    },
    {
        "  Godzilla  . Dave Kehr, ,  The New York Times , January 20, 2002. These films have had a profound influence on world cinema. In particular, Kurosawas Seven Samurai has been remade several times as ": null
    },
    {
        "Western films": "Western"
    },
    {
        ", such as  The Magnificent Seven  and  Battle Beyond the Stars  , and has also inspired several ": null
    },
    {
        "Bollywood": "Bollywood"
    },
    {
        " films, such as  Sholay  and  China Gate  . Rashomon was also remade as  The Outrage  , and inspired films with ": null
    },
    {
        "Rashomon effect": "Rashomon Effect"
    },
    {
        " storytelling methods, such as  Andha Naal  ,  The Usual Suspects  and  Hero  . The Hidden Fortress was also the inspiration behind ": null
    },
    {
        "George Lucas": "George Lucas"
    },
    {
        "  Star Wars  . Other famous Japanese filmmakers from this period include ": null
    },
    {
        "Kenji Mizoguchi": "Kenji Mizoguchi"
    },
    {
        ", ": null
    },
    {
        "Mikio Naruse": "Mikio Naruse"
    },
    {
        ", ": null
    },
    {
        "Hiroshi Inagaki": "Hiroshi Inagaki"
    },
    {
        " and ": null
    },
    {
        "Nagisa Oshima": "Nagisa Oshima"
    },
    {
        ". Japanese cinema later became one of the main inspirations behind the ": null
    },
    {
        "New Hollywood": "New Hollywood"
    },
    {
        " movement of the 1960s to 1980s.     During ": null
    },
    {
        "Indian cinemas": "Cinema Of India"
    },
    {
        " Golden Age of the 1950s, it was producing 200 films annually, while ": null
    },
    {
        "Indian independent films": "Parallel Cinema"
    },
    {
        " gained greater recognition through international ": null
    },
    {
        "film festivals": "Film Festival"
    },
    {
        ". One of the most famous was  The Apu Trilogy  from critically acclaimed ": null
    },
    {
        "Bengali film": "Cinema Of West Bengal"
    },
    {
        " director ": null
    },
    {
        "Satyajit Ray": "Satyajit Ray"
    },
    {
        ", whose films had a profound influence on world cinema, with directors such as Akira Kurosawa,  ": null
    },
    {
        "Martin Scorsese": "Martin Scorsese"
    },
    {
        ",     ": null
    },
    {
        "James Ivory": "James Ivory"
    },
    {
        ",    ": null
    },
    {
        "Abbas Kiarostami": "Abbas Kiarostami"
    },
    {
        ", ": null
    },
    {
        "Elia Kazan": "Elia Kazan"
    },
    {
        ", ": null
    },
    {
        "François Truffaut": "François Truffaut"
    },
    {
        ",  ": null
    },
    {
        "Steven Spielberg": "Steven Spielberg"
    },
    {
        ",    ": null
    },
    {
        "Carlos Saura": "Carlos Saura"
    },
    {
        ",  ": null
    },
    {
        "Jean-Luc Godard": "Jean-Luc Godard"
    },
    {
        ",    ": null
    },
    {
        "Isao Takahata": "Isao Takahata"
    },
    {
        ",  ": null
    },
    {
        "Gregory Nava": "Gregory Nava"
    },
    {
        ", ": null
    },
    {
        "Ira Sachs": "Ira Sachs"
    },
    {
        ", ": null
    },
    {
        "Wes Anderson": "Wes Anderson"
    },
    {
        "  and ": null
    },
    {
        "Danny Boyle": "Danny Boyle"
    },
    {
        "  being influenced by his cinematic style. According to Michael Sragow of  The Atlantic Monthly , the youthful ": null
    },
    {
        "coming-of-age": "Coming Of Age"
    },
    {
        " dramas": "Drama Film"
    },
    {
        " that have flooded art houses since the mid-fifties owe a tremendous debt to the Apu trilogy .  ": null
    },
    {
        "Subrata Mitras": "Subrata Mitra"
    },
    {
        " cinematographic technique of ": null
    },
    {
        "bounce lighting": "Reflector Bounce Lighting"
    },
    {
        " also originates from The Apu Trilogy.  Other famous Indian filmmakers from this period include ": null
    },
    {
        "Guru Dutt": "Guru Dutt"
    },
    {
        ", ": null
    },
    {
        "Ritwik Ghatak": "Ritwik Ghatak"
    },
    {
        ", ": null
    },
    {
        "Mrinal Sen": "Mrinal Sen"
    },
    {
        ", ": null
    },
    {
        "Raj Kapoor": "Raj Kapoor"
    },
    {
        ", ": null
    },
    {
        "Bimal Roy": "Bimal Roy"
    },
    {
        ", ": null
    },
    {
        "K. Asif": "K. Asif"
    },
    {
        " and ": null
    },
    {
        "Mehboob Khan": "Mehboob Khan"
    },
    {
        ".      The ": null
    },
    {
        "cinema of South Korea": "Cinema Of South Korea"
    },
    {
        " also experienced a Golden Age in the 1950s, beginning with director Lee Kyu-hwans tremendously successful remake of Chunhyang-jon .  That year also saw the release of  Yangsan Province  by the renowned director, ": null
    },
    {
        "Kim Ki-young": "Kim Ki-Young"
    },
    {
        ", marking the beginning of his productive career. Both the quality and quantity of filmmaking had increased rapidly by the end of the 1950s. South Korean films, such as Lee Byeong-ils 1956 comedy Sijibganeun nal , had begun winning international awards. In contrast to the beginning of the 1950s, when only 5 films were made per year, 111 films were produced in South Korea in 1959.      The 1950s was also a Golden Age for ": null
    },
    {
        "Philippine cinema": "Cinema Of The Philippines"
    },
    {
        ", with the emergence of more artistic and mature films, and significant improvement in cinematic techniques among filmmakers. The studio system produced frenetic activity in the local film industry as many films were made annually and several local talents started to earn recognition abroad. The premiere Philippine directors of the era included ": null
    },
    {
        "Gerardo de Leon": "Gerardo De Leon"
    },
    {
        ", ": null
    },
    {
        "Gregorio Fernández": "Gregorio Fernández"
    },
    {
        ", ": null
    },
    {
        "Eddie Romero": "Eddie Romero"
    },
    {
        ", ": null
    },
    {
        "Lamberto Avellana": "Lamberto Avellana"
    },
    {
        ", and ": null
    },
    {
        "Cirio Santiago": "Cirio Santiago"
    },
    {
        ". . Accessed January 25, 2009. . Accessed January 22, 2009.          During the 1960s, the studio system in ": null
    },
    {
        "Hollywood": "Cinema Of The United States"
    },
    {
        " declined, because many films were now being made on location in other countries, or using studio facilities abroad, such as ": null
    },
    {
        "Pinewood": "Pinewood Studios"
    },
    {
        " in the UK and ": null
    },
    {
        "Cinecittà": "Cinecittà"
    },
    {
        " in Rome. Hollywood films were still largely aimed at family audiences, and it was often the more old-fashioned films that produced the studios biggest successes. Productions like  Mary Poppins  ,  My Fair Lady  and  The Sound of Music  were among the biggest money-makers of the decade. The growth in independent producers and production companies, and the increase in the power of individual actors also contributed to the decline of traditional Hollywood studio production.     There was also an increasing awareness of foreign language cinema in America during this period. During the late 1950s and 1960s, the ": null
    },
    {
        "French New Wave": "French New Wave"
    },
    {
        " directors such as ": null
    },
    {
        "François Truffaut": "François Truffaut"
    },
    {
        " and ": null
    },
    {
        "Jean-Luc Godard": "Jean-Luc Godard"
    },
    {
        " produced films such as  Les quatre cents coups ,  Breathless  and  Jules et Jim  which broke the rules of Hollywood cinemas ": null
    },
    {
        "narrative structure": "Narrative Structure"
    },
    {
        ". As well, audiences were becoming aware of Italian films like ": null
    },
    {
        "Federico Fellinis": "Federico Fellini"
    },
    {
        "  La Dolce Vita  and the stark dramas of Swedens ": null
    },
    {
        "Ingmar Bergman": "Ingmar Bergman"
    },
    {
        ".     In Britain, the Free Cinema of ": null
    },
    {
        "Lindsay Anderson": "Lindsay Anderson"
    },
    {
        ", ": null
    },
    {
        "Tony Richardson": "Tony Richardson"
    },
    {
        " and others lead to a group of realistic and innovative dramas including  Saturday Night and Sunday Morning ,  A Kind of Loving  and  This Sporting Life . Other British films such as  Repulsion ,  Darling ,  Alfie ,  Blowup  and  Georgy Girl  helped to reduce prohibitions of sex and nudity on screen, while the casual sex and violence of the ": null
    },
    {
        "James Bond": "James Bond"
    },
    {
        " films, beginning with  Dr. No  in 1962 would render the series popular worldwide.     During the 1960s, ": null
    },
    {
        "Ousmane Sembène": "Ousmane Sembène"
    },
    {
        " produced several French- and ": null
    },
    {
        "Wolof-language": "Wolof Language"
    },
    {
        " films and became the father of ": null
    },
    {
        "African Cinema": "African Cinema"
    },
    {
        ". In Latin America, the dominance of the Hollywood model was challenged by many film makers. ": null
    },
    {
        "Fernando Solanas": "Fernando Solanas"
    },
    {
        " and ": null
    },
    {
        "Octavio Getino": "Octavio Getino"
    },
    {
        " called for a politically engaged ": null
    },
    {
        "Third Cinema": "Third Cinema"
    },
    {
        " in contrast to Hollywood and the European ": null
    },
    {
        "auteur": "Auteur"
    },
    {
        " cinema.     Further, the nuclear paranoia of the age, and the threat of an apocalyptic nuclear exchange  prompted a reaction within the film community as well. Films like ": null
    },
    {
        "Stanley Kubricks": "Stanley Kubrick"
    },
    {
        "  Dr. Strangelove  and  Fail Safe  with ": null
    },
    {
        "Henry Fonda": "Henry Fonda"
    },
    {
        " were produced in a Hollywood that was once known for its overt patriotism and wartime propaganda.     In ": null
    },
    {
        "documentary film": "Documentary Film"
    },
    {
        " the sixties saw the blossoming of ": null
    },
    {
        "Direct Cinema": "Direct Cinema"
    },
    {
        ", an observational style of film making as well as the advent of more overtly partisan films like  In the Year of the Pig  about the ": null
    },
    {
        "Vietnam War": "Vietnam War"
    },
    {
        " by ": null
    },
    {
        "Emile de Antonio": "Emile De Antonio"
    },
    {
        ". By the late 1960s however, Hollywood filmmakers were beginning to create more innovative and groundbreaking films that reflected the social revolution taken over much of the western world such as  Bonnie and Clyde  ,  The Graduate  ,  2001: A Space Odyssey  ,  Rosemarys Baby  ,  Midnight Cowboy  ,  Easy Rider  and  The Wild Bunch  .  Bonnie and Clyde  is often considered the beginning of the so-called ": null
    },
    {
        "New Hollywood": "New Hollywood"
    },
    {
        ".     In Japanese cinema, Academy Award-winning director ": null
    },
    {
        "Akira Kurosawa": "Akira Kurosawa"
    },
    {
        " produced  Yojimbo  , which like his previous films also had a profound influence around the world. The influence of this film is most apparent in ": null
    },
    {
        "Sergio Leones": "Sergio Leone"
    },
    {
        "  A Fistful of Dollars  and ": null
    },
    {
        "Walter Hills": "Walter Hill"
    },
    {
        "  Last Man Standing  . Yojimbo was also the origin of the ": null
    },
    {
        "Man with No Name": "Man With No Name"
    },
    {
        " trend.          The ": null
    },
    {
        "New Hollywood": "New Hollywood"
    },
    {
        " was the period following the decline of the ": null
    },
    {
        "studio system": "Studio System"
    },
    {
        " during the 1950s and 1960s and the end of the ": null
    },
    {
        "production code": "Production Code"
    },
    {
        ", . During the 1970s, filmmakers increasingly depicted explicit sexual content and showed gunfight and battle scenes that included graphic images of bloody deaths a good example of this is ": null
    },
    {
        "Wes Cravens": "Wes Craven"
    },
    {
        "  The Last House on the Left  .     Post-classical cinema is the changing methods of storytelling of the New Hollywood producers. The new methods of ": null
    },
    {
        "drama": "Drama"
    },
    {
        " and characterization played upon audience expectations acquired during the classical/Golden Age period: story chronology may be scrambled, storylines may feature unsettling ": null
    },
    {
        "twist endings": "Twist Ending"
    },
    {
        " , main characters may behave in a morally ambiguous fashion, and the lines between the ": null
    },
    {
        "antagonist": "Antagonist"
    },
    {
        " and ": null
    },
    {
        "protagonist": "Protagonist"
    },
    {
        " may be blurred. The beginnings of post-classical storytelling may be seen in 1940s and 1950s ": null
    },
    {
        "film noir": "Film Noir"
    },
    {
        " films, in films such as  Rebel Without a Cause  , and in Hitchcocks  Psycho . 1971 marked the release of controversial films like  Straw Dogs ,  A Clockwork Orange ,  The French Connection  and  Dirty Harry . This sparked heated controversy over the perceived escalation of violence in cinema.     During the 1970s, a new group of American filmmakers emerged, such as ": null
    },
    {
        "Martin Scorsese": "Martin Scorsese"
    },
    {
        ", ": null
    },
    {
        "Francis Ford Coppola": "Francis Ford Coppola"
    },
    {
        ", ": null
    },
    {
        "George Lucas": "George Lucas"
    },
    {
        ", ": null
    },
    {
        "Woody Allen": "Woody Allen"
    },
    {
        ", ": null
    },
    {
        "Terrence Malick": "Terrence Malick"
    },
    {
        ", and ": null
    },
    {
        "Robert Altman": "Robert Altman"
    },
    {
        ". This coincided with the increasing popularity of the ": null
    },
    {
        "auteur theory": "Auteur Theory"
    },
    {
        " in film literature and the media, which posited that a film directors films express their personal vision and creative insights. The development of the auteur style of filmmaking helped to give these directors far greater control over their projects than would have been possible in earlier eras. This led to some great critical and commercial successes, like Scorseses  Taxi Driver , Coppolas  The Godfather  films, ": null
    },
    {
        "William Friedkins": "William Friedkin"
    },
    {
        "  The Exorcist , Altmans  Nashville , Allens  Annie Hall  and  Manhattan , Malicks  Badlands  and  Days of Heaven , and Polish immigrant ": null
    },
    {
        "Roman Polanskis": "Roman Polanski"
    },
    {
        "  Chinatown . It also, however, resulted in some failures, including ": null
    },
    {
        "Peter Bogdanovichs": "Peter Bogdanovich"
    },
    {
        "  At Long Last Love  and ": null
    },
    {
        "Michael Ciminos": "Michael Cimino"
    },
    {
        " hugely expensive Western epic  Heavens Gate , which helped to bring about the demise of its backer, ": null
    },
    {
        "United Artists": "United Artists"
    },
    {
        ".     The financial disaster of Heavens Gate marked the end of the visionary auteur directors of the New Hollywood , who had unrestrained creative and financial freedom to develop films. The phenomenal success in the 1970s of ": null
    },
    {
        "Spielbergs": "Steven Spielberg"
    },
    {
        "  Jaws  originated the concept of the modern ": null
    },
    {
        "blockbuster": "Blockbuster"
    },
    {
        " . However, the enormous success of George Lucas 1977 film  Star Wars  led to much more than just the popularization of blockbuster film-making. The films revolutionary use of special effects, sound editing and music had led it to become widely regarded as one of the single most important films in the mediums history, as well as the most influential film of the 1970s. Hollywood studios increasingly focused on producing a smaller number of very large budget films with massive marketing and promotional campaigns. This trend had already been foreshadowed by the commercial success of ": null
    },
    {
        "disaster films": "Disaster Film"
    },
    {
        " such as  The Poseidon Adventure  and  The Towering Inferno .     During the mid-1970s, more pornographic theatres, euphemistically called adult cinemas , were established, and the legal production of ": null
    },
    {
        "hardcore pornographic": "Hardcore Pornography"
    },
    {
        " films began. Porn films such as  Deep Throat  and its star ": null
    },
    {
        "Linda Lovelace": "Linda Lovelace"
    },
    {
        " became something of a popular culture phenomenon and resulted in a spate of similar sex films. The porn cinemas finally died out during the 1980s, when the popularization of the home ": null
    },
    {
        "VCR": "Vcr"
    },
    {
        " and pornography videotapes allowed audiences to watch sex films at home. In the early 1970s, English-language audiences became more aware of the new ": null
    },
    {
        "West German": "West German"
    },
    {
        " cinema, with ": null
    },
    {
        "Werner Herzog": "Werner Herzog"
    },
    {
        ", ": null
    },
    {
        "Rainer Werner Fassbinder": "Rainer Werner Fassbinder"
    },
    {
        " and ": null
    },
    {
        "Wim Wenders": "Wim Wenders"
    },
    {
        " among its leading exponents.     In ": null
    },
    {
        "world cinema": "World Cinema"
    },
    {
        ", the 1970s saw a dramatic increase in the popularity of ": null
    },
    {
        "martial arts films": "Martial Arts Film"
    },
    {
        ", largely due to its reinvention by ": null
    },
    {
        "Bruce Lee": "Bruce Lee"
    },
    {
        ", who departed from the artistic style of traditional ": null
    },
    {
        "Chinese martial arts": "Chinese Martial Arts"
    },
    {
        " films and added a much greater sense of realism to them with his ": null
    },
    {
        "Jeet Kune Do": "Jeet Kune Do"
    },
    {
        " style. This began with  The Big Boss  , which was a major success across ": null
    },
    {
        "Asia": "Asian Cinema"
    },
    {
        ". However, he didnt gain fame in the ": null
    },
    {
        "Western world": "Western World"
    },
    {
        " until shortly after his death in 1973, when  Enter the Dragon  was released. The film went on to become the most successful martial arts film in cinematic history, popularized the martial arts film genre across the world, and cemented Bruce Lees status as a cultural icon. ": null
    },
    {
        "Hong Kong action cinema": "Hong Kong Action Cinema"
    },
    {
        ", however, was in decline due to a wave of ": null
    },
    {
        "Bruceploitation": "Bruceploitation"
    },
    {
        " films. This trend eventually came to an end in 1978 with the martial arts ": null
    },
    {
        "comedy films": "Comedy Film"
    },
    {
        ",  Snake in the Eagles Shadow  and  Drunken Master , directed by ": null
    },
    {
        "Yuen Woo-ping": "Yuen Woo-Ping"
    },
    {
        " and starring ": null
    },
    {
        "Jackie Chan": "Jackie Chan"
    },
    {
        ", laying the foundations for the rise of Hong Kong action cinema in the 1980s.     While the ": null
    },
    {
        "musical film": "Musical Film"
    },
    {
        " genre had declined in Hollywood by this time, musical films were quickly gaining popularity in the ": null
    },
    {
        "cinema of India": "Cinema Of India"
    },
    {
        ", where the term ": null
    },
    {
        "Bollywood": "Bollywood"
    },
    {
        " was coined for the growing ": null
    },
    {
        "Hindi": "Hindi"
    },
    {
        " film industry in ": null
    },
    {
        "Bombay": "Mumbai"
    },
    {
        " that ended up dominating ": null
    },
    {
        "South Asian cinema": "South Asian Cinema"
    },
    {
        ", overtaking the more critically acclaimed ": null
    },
    {
        "Bengali film industry": "Cinema Of West Bengal"
    },
    {
        " in popularity. Hindi filmmakers combined the Hollywood musical formula with the conventions of ancient ": null
    },
    {
        "Indian theatre": "Theatre Of India"
    },
    {
        " to create a new film genre called ": null
    },
    {
        "Masala": "Masala"
    },
    {
        " , which dominated Indian cinema throughout the late 20th century.  These Masala films portrayed ": null
    },
    {
        "action": "Action Film"
    },
    {
        ", comedy, ": null
    },
    {
        "drama": "Drama Film"
    },
    {
        ", ": null
    },
    {
        "romance": "Romance Film"
    },
    {
        " and ": null
    },
    {
        "melodrama": "Melodrama"
    },
    {
        " all at once, with ": null
    },
    {
        "filmi": "Filmi"
    },
    {
        " song and dance routines thrown in. This trend began with films directed by ": null
    },
    {
        "Manmohan Desai": "Manmohan Desai"
    },
    {
        " and starring ": null
    },
    {
        "Amitabh Bachchan": "Amitabh Bachchan"
    },
    {
        ", who remains one of the most popular ": null
    },
    {
        "film stars": "Film Star"
    },
    {
        " in South Asia. The most popular Indian film of all time was  Sholay  , a Masala film inspired by a real-life ": null
    },
    {
        "dacoit": "Dacoity"
    },
    {
        " as well as Kurosawas  Seven Samurai  and the ": null
    },
    {
        "Spaghetti Westerns": "Spaghetti Western"
    },
    {
        ".     The end of the decade saw the first major international marketing of ": null
    },
    {
        "Australia": "Australia"
    },
    {
        "n cinema, as ": null
    },
    {
        "Peter Weirs": "Peter Weir"
    },
    {
        " films  Picnic at Hanging Rock  and  The Last Wave  and ": null
    },
    {
        "Fred Schepisis": "Fred Schepisi"
    },
    {
        "  The Chant of Jimmie Blacksmith  gained critical acclaim. In 1979, Australian filmmaker ": null
    },
    {
        "George Miller": "George Miller"
    },
    {
        " also garnered international attention for his violent, low-budget action film  Mad Max .          During the 1980s, audiences began increasingly watching films on their home ": null
    },
    {
        "VCRs": "Vcr"
    },
    {
        ". In the early part of that decade, the ": null
    },
    {
        "film studios": "Film Studio"
    },
    {
        " tried legal action to ban home ownership of VCRs as a violation of ": null
    },
    {
        "copyright": "Copyright"
    },
    {
        ", which proved unsuccessful. Eventually, the sale and rental of films on ": null
    },
    {
        "home video": "Home Video"
    },
    {
        " became a significant second venue for exhibition of films, and an additional source of revenue for the film industries.     The ": null
    },
    {
        "Lucas": "George Lucas"
    },
    {
        "–": null
    },
    {
        "Spielberg": "Steven Spielberg"
    },
    {
        " combine would dominate Hollywood cinema for much of the 1980s, and lead to much imitation. Two follow-ups to  Star Wars , three to  Jaws , and three  Indiana Jones  films helped to make sequels of successful films more of an expectation than ever before. Lucas also launched ": null
    },
    {
        "THX Ltd": "Thx"
    },
    {
        ", a division of ": null
    },
    {
        "Lucasfilm": "Lucasfilm"
    },
    {
        " in 1982,  while Spielberg enjoyed one of the decades greatest successes in  E.T. the Extra-Terrestrial  the same year. 1982 also saw the release of Disneys  Tron  which was one of the first films from a major studio to use ": null
    },
    {
        "computer graphics": "Computer Graphics"
    },
    {
        " extensively. American independent cinema struggled more during the decade, although ": null
    },
    {
        "Martin Scorseses": "Martin Scorsese"
    },
    {
        "  Raging Bull  ,  After Hours  , and  The King of Comedy  helped to establish him as one of the most critically acclaimed American film makers of the era. Also during 1983  Scarface  was released, which was very profitable and resulted in even greater fame for its leading actor ": null
    },
    {
        "Al Pacino": "Al Pacino"
    },
    {
        ". Probably the most successful film commercially was ": null
    },
    {
        "Tim Burtons": "Tim Burton"
    },
    {
        " 1989 version of ": null
    },
    {
        "Bob Kanes": "Bob Kane"
    },
    {
        " creation,  Batman , which broke box-office records. ": null
    },
    {
        "Jack Nicholsons": "Jack Nicholson"
    },
    {
        " portrayal of the demented ": null
    },
    {
        "Joker": "Joker"
    },
    {
        " earned him a total of $60,000,000 after figuring in his percentage of the gross.     British cinema was given a boost during the early 1980s by the arrival of ": null
    },
    {
        "David Puttnams": "David Puttnam"
    },
    {
        " company ": null
    },
    {
        "Goldcrest Films": "Goldcrest Films"
    },
    {
        ". The films  Chariots of Fire ,  Gandhi ,  The Killing Fields  and  A Room with a View  appealed to a middlebrow audience which was increasingly being ignored by the major Hollywood studios. While the films of the 1970s had helped to define modern ": null
    },
    {
        "blockbuster": "Blockbuster"
    },
    {
        " motion pictures, the way Hollywood released its films would now change. Films, for the most part, would premiere in a wider number of theatres, although, to this day, some films still premiere using the route of the ": null
    },
    {
        "limited/roadshow release system": "Roadshow Theatrical Release"
    },
    {
        ". Against some expectations, the rise of the multiplex cinema did not allow less mainstream films to be shown, but simply allowed the major blockbusters to be given an even greater number of screenings. However, films that had been overlooked in cinemas were increasingly being given a second chance on home video.        During the 1980s, ": null
    },
    {
        "Japanese cinema": "Japanese Cinema"
    },
    {
        " experienced a revival, largely due to the success of ": null
    },
    {
        "anime": "Anime"
    },
    {
        " films. At the beginning of the 1980s,  Space Battleship Yamato  and  Mobile Suit Gundam  , both of which were unsuccessful as television series, were remade as films and became hugely successful in Japan. In particular, Mobile Suit Gundam sparked the ": null
    },
    {
        "Gundam": "Gundam"
    },
    {
        " franchise of ": null
    },
    {
        "Real Robot": "Real Robot"
    },
    {
        " mecha": "Mecha"
    },
    {
        " anime. The success of  Macross: Do You Remember Love?  also sparked a ": null
    },
    {
        "Macross": "Macross"
    },
    {
        " franchise of mecha anime. This was also the decade when ": null
    },
    {
        "Studio Ghibli": "Studio Ghibli"
    },
    {
        " was founded. The studio produced ": null
    },
    {
        "Hayao Miyazakis": "Hayao Miyazaki"
    },
    {
        " first ": null
    },
    {
        "fantasy films": "Fantasy Film"
    },
    {
        ",  Nausicaä of the Valley of the Wind  and  Castle in the Sky  , as well as ": null
    },
    {
        "Isao Takahatas": "Isao Takahata"
    },
    {
        "  Grave of the Fireflies  , all of which were very successful in Japan and received worldwide critical acclaim. ": null
    },
    {
        "Original video animation": "Original Video Animation"
    },
    {
        " films also began during this decade; the most influential of these early OVA films was ": null
    },
    {
        "Noboru Ishiguros": "Noboru Ishiguro"
    },
    {
        " cyberpunk": "Cyberpunk"
    },
    {
        " film  Megazone 23  . The most famous anime film of this decade was ": null
    },
    {
        "Katsuhiro Otomos": "Katsuhiro Otomo"
    },
    {
        " cyberpunk film  Akira  , which although initially unsuccessful at Japanese theaters, went on to become an international success.     ": null
    },
    {
        "Hong Kong action cinema": "Hong Kong Action Cinema"
    },
    {
        ", which was in a state of decline due to endless ": null
    },
    {
        "Bruceploitation": "Bruceploitation"
    },
    {
        " films after the death of ": null
    },
    {
        "Bruce Lee": "Bruce Lee"
    },
    {
        ", also experienced a revival in the 1980s, largely due to the reinvention of the ": null
    },
    {
        "action film": "Action Film"
    },
    {
        " genre by ": null
    },
    {
        "Jackie Chan": "Jackie Chan"
    },
    {
        ". He had previously combined the ": null
    },
    {
        "comedy film": "Comedy Film"
    },
    {
        " and ": null
    },
    {
        "martial arts film": "Martial Arts Film"
    },
    {
        " genres successfully in the 1978 films  Snake in the Eagles Shadow  and  Drunken Master . The next step he took was in combining this comedy martial arts genre with a new emphasis on elaborate and highly dangerous ": null
    },
    {
        "stunts": "Stunt"
    },
    {
        ", reminiscent of the ": null
    },
    {
        "silent film": "Silent Film"
    },
    {
        " era. The first film in this new style of action cinema was  Project A  , which saw the formation of the ": null
    },
    {
        "Jackie Chan Stunt Team": "Jackie Chan Stunt Team"
    },
    {
        " as well as the Three Brothers . The film added elaborate, dangerous stunts to the fights and ": null
    },
    {
        "slapstick": "Slapstick"
    },
    {
        " humor, and became a huge success throughout the ": null
    },
    {
        "Far East": "Far East"
    },
    {
        ". As a result, Chan continued this trend with martial arts action films containing even more elaborate and dangerous stunts, including  Wheels on Meals  ,  Police Story  ,  Armour of God  ,  Project A Part II  ,  Police Story 2  , and  Dragons Forever  . Other new trends which began in the 1980s were the ": null
    },
    {
        "girls with guns": "Girls With Guns"
    },
    {
        " subgenre, for which ": null
    },
    {
        "Michelle Yeoh": "Michelle Yeoh"
    },
    {
        " gained fame; and especially the ": null
    },
    {
        "heroic bloodshed": "Heroic Bloodshed"
    },
    {
        " genre, revolving around ": null
    },
    {
        "Triads": "Triad"
    },
    {
        ", largely pioneered by ": null
    },
    {
        "John Woo": "John Woo"
    },
    {
        " and for which ": null
    },
    {
        "Chow Yun-fat": "Chow Yun-Fat"
    },
    {
        " became famous. These Hong Kong action trends were later adopted by many Hollywood action films in the 1990s and 2000s.          The early 1990s saw the development of a commercially successful independent cinema in the United States. Although cinema was increasingly dominated by special-effects films such as  Terminator 2: Judgment Day  ,  Jurassic Park  and  Titanic  , the latter of which became the highest-grossing film of all time at the time up until  Avatar  , also directed by James Cameron, independent films like ": null
    },
    {
        "Steven Soderberghs": "Steven Soderbergh"
    },
    {
        "  Sex, Lies, and Videotape  and ": null
    },
    {
        "Quentin Tarantinos": "Quentin Tarantino"
    },
    {
        "  Reservoir Dogs  had significant commercial success both at the cinema and on home video. Filmmakers associated with the Danish film movement ": null
    },
    {
        "Dogme 95": "Dogme 95"
    },
    {
        " introduced a manifesto aimed to purify filmmaking. Its first few films gained worldwide critical acclaim, after which the movement slowly faded out.        Major American studios began to create their own ": null
    },
    {
        " independent production companies": "Independent Film"
    },
    {
        " to finance and produce non-mainstream fare. One of the most successful independents of the 1990s, ": null
    },
    {
        "Miramax Films": "Miramax Films"
    },
    {
        ", was bought by Disney the year before the release of Tarantinos runaway hit  Pulp Fiction  in 1994. The same year marked the beginning of film and video distribution online. Animated films aimed at family audiences also regained their popularity, with Disneys  Beauty and the Beast  ,  Aladdin  , and  The Lion King  . During 1995, the first feature-length ": null
    },
    {
        "computer-animated": "Computer Animation"
    },
    {
        " feature,  Toy Story , was produced by ": null
    },
    {
        "Pixar Animation Studios": "Pixar"
    },
    {
        " and released by Disney. After the success of Toy Story, computer animation would grow to become the dominant technique for feature-length animation, which would allow competing film companies such as ": null
    },
    {
        "DreamWorks Animation": "Dreamworks Animation"
    },
    {
        " and ": null
    },
    {
        "20th Century Fox": "20Th Century Fox"
    },
    {
        " to effectively compete with Disney with successful films of their own. During the late 1990s, another cinematic transition began, from physical film stock to ": null
    },
    {
        "digital cinema": "Digital Cinema"
    },
    {
        " technology. Meanwhile, ": null
    },
    {
        "DVDs": "Dvd"
    },
    {
        " became the new standard for consumer video, replacing VHS tapes.          The ": null
    },
    {
        "documentary film": "Documentary Film"
    },
    {
        " also rose as a commercial genre for perhaps the first time, with the success of films such as  March of the Penguins  and ": null
    },
    {
        "Michael Moores": "Michael Moore"
    },
    {
        "  Bowling for Columbine  and  Fahrenheit 9/11 . A new genre was created with ": null
    },
    {
        "Martin Kunert": "Martin Kunert"
    },
    {
        " and ": null
    },
    {
        "Eric Manes": "Eric Manes"
    },
    {
        "  Voices of Iraq , when 150 inexpensive DV cameras were distributed across Iraq, transforming ordinary people into collaborative filmmakers. The success of  Gladiator  led to a revival of interest in ": null
    },
    {
        "epic cinema": "Epic Film"
    },
    {
        ", and  Moulin Rouge!  renewed interest in ": null
    },
    {
        "musical cinema": "Musical Film"
    },
    {
        ". ": null
    },
    {
        "Home theatre": "Home Cinema"
    },
    {
        " systems became increasingly sophisticated, as did some of the special edition ": null
    },
    {
        "DVDs": "Dvd"
    },
    {
        " designed to be shown on them.  The Lord of the Rings trilogy  was released on DVD in both the theatrical version and in a special extended version intended only for home cinema audiences.     In 2001, the ": null
    },
    {
        "Harry Potter film series": "Harry Potter"
    },
    {
        " began, and by its end in 2011, it had become the highest-grossing film franchise of all time until the Marvel Cinematic Universe passed it in 2015.     More films were also being released simultaneously to ": null
    },
    {
        "IMAX": "Imax"
    },
    {
        " cinema, the first was in 2002s Disney animation  Treasure Planet ; and the first live action was in 2003s  The Matrix Revolutions  and a re-release of  The Matrix Reloaded . Later in the decade,  The Dark Knight  was the first major feature film to have been at least partially shot in IMAX technology.     There has been an increasing globalization of cinema during this decade, with foreign-language films gaining popularity in English-speaking markets. Examples of such films include  Crouching Tiger, Hidden Dragon  ,  Amélie  ,  Lagaan  ,  Spirited Away  ,  City of God  ,  The Passion of the Christ  ,  Apocalypto  and  Inglourious Basterds  . Italy is the most awarded country at the ": null
    },
    {
        "Academy Award for Best Foreign Language Film": "Academy Award For Best Foreign Language Film"
    },
    {
        ", with 14 awards won, 3 Special Awards and 31 ": null
    },
    {
        "nominations": "List Of Italian Submissions For The Academy Award For Best Foreign Language Film"
    },
    {
        ".     In 2003, there was a revival in 3D film popularity the first being James Camerons  Ghosts of the Abyss  which was released as the first full-length 3-D IMAX feature filmed with the ": null
    },
    {
        "Reality Camera System": "Reality Camera System"
    },
    {
        ". This camera system used the latest HD video cameras, not film, and was built for Cameron by Emmy nominated Director of Photography Vince Pace, to his specifications. The same camera system was used to film  Spy Kids 3D: Game Over  ,  Aliens of the Deep  IMAX , and  The Adventures of Sharkboy and Lavagirl in 3-D  .     After James Camerons 3D film  Avatar  became the highest-grossing film of all time, 3D films gained brief popularity with many other films being released in 3D, with the best critical and financial successes being in the field of feature film animation such as ": null
    },
    {
        "Universal Pictures": "Universal Pictures"
    },
    {
        "/": null
    },
    {
        "Illumination Entertainments": "Illumination Entertainment"
    },
    {
        "  Despicable Me  and ": null
    },
    {
        "DreamWorks Animations": "Dreamworks Animation"
    },
    {
        "  How To Train Your Dragon ,  Shrek Forever After  and  Megamind . Avatar is also note-worthy for pioneering highly sophisticated use of motion capture technology and influencing several other films such as  Rise of the Planet of the Apes .             , the largest film industries by number of feature films produced were those of India, the United States, China, Nigeria and Japan.      In Hollywood, ": null
    },
    {
        "superhero films": "Superhero Film"
    },
    {
        " have greatly increased in popularity and financial success, with films based on ": null
    },
    {
        "Marvel": "Marvel Comics"
    },
    {
        " and ": null
    },
    {
        "DC comics": "Dc Comics"
    },
    {
        " regularly being released every year up to the present.  , the superhero genre has been the most dominant genre as far as ": null
    },
    {
        "American box office receipts": "List Of Highest-Grossing Films In The United States And Canada"
    },
    {
        " are concerned. The 2019 superhero film  Avengers: Endgame ": null
    }
]