[
    {
        "           The history of Panama refers to the ": null
    },
    {
        "Isthmus of Panama": "Isthmus Of Panama"
    },
    {
        " regions long history that occurred in Central America, from ": null
    },
    {
        "Pre-Colombian": "Pre-Colombian"
    },
    {
        " cultures, during the Spanish colonial era, through independence and the current country of ": null
    },
    {
        "Panama": "Panama"
    },
    {
        ".             The earliest artifacts discovered in Panama include ": null
    },
    {
        "Paleo-Indians": "Paleo-Indians"
    },
    {
        " projectile point": "Projectile Point"
    },
    {
        "s. Later central Panama was home to some of the earliest ": null
    },
    {
        "pottery": "Pottery"
    },
    {
        "-making in the Americas, such as the ": null
    },
    {
        "Monagrillo": "Monagrillo"
    },
    {
        " cultures dating to about 2500–1700 BC. These evolved into significant populations that are best known through the noteworthy burials at the Monagrillo ": null
    },
    {
        "archaeological site": "Archaeological Site"
    },
    {
        ", and the ": null
    },
    {
        "polychrome": "Polychrome"
    },
    {
        " pottery of the ": null
    },
    {
        "Gran Coclé": "Gran Coclé"
    },
    {
        " style. The monumental ": null
    },
    {
        "monolith": "Monolith"
    },
    {
        "ic sculptures at the ": null
    },
    {
        "Barriles": "Barriles"
    },
    {
        " site are other important evidence of the ancient isthmian cultures.     Prior to the arrival of Europeans, Panama was widely settled by ": null
    },
    {
        "Chibchan": "Chibchan"
    },
    {
        ", ": null
    },
    {
        "Chocoan": "Chocoan"
    },
    {
        ", and ": null
    },
    {
        "Cueva": "Cueva People"
    },
    {
        " peoples, among whom the largest group were the Cueva . There is no accurate knowledge of the size of the Pre-Colombian indigenous population of the isthmus at the time of the European conquest. Estimates range as high as two million people, but more recent studies place that number closer to 200,000.  Archaeological finds, as well as testimonials by early European explorers, describe diverse native isthmian groups exhibiting cultural variety and already experienced in using regional ": null
    },
    {
        "trade route": "Trade Route"
    },
    {
        "s. The indigenous people of Panama lived by hunting, gathering edible plants & fruits, growing corn, cacao, and root crops. They lived in small huts made of palm leaves over a rounded branch structure, with hammocks hung between the interior walls.          In 1501, ": null
    },
    {
        "Rodrigo de Bastidas": "Rodrigo De Bastidas"
    },
    {
        " was the first European to explore the ": null
    },
    {
        "Isthmus of Panama": "Isthmus Of Panama"
    },
    {
        " sailing along the eastern coast. A year later ": null
    },
    {
        "Christopher Columbus": "Christopher Columbus"
    },
    {
        " on his fourth voyage, sailing south and eastward from upper Central America, explored ": null
    },
    {
        "Bocas del Toro": "Bocas Del Toro Province"
    },
    {
        ", ": null
    },
    {
        "Veragua": "Veragua"
    },
    {
        ", the ": null
    },
    {
        "Chagres River": "Chagres River"
    },
    {
        " and Portobelo which he named. Soon Spanish expeditions would converge upon Tierra Firma which served in Spanish colonial times as the name for the Isthmus of Panama.     In 1509, authority was granted to Alonso de Ojeda and Diego de Nicuesa to colonize the territories between the west side of the Gulf of Uraba to Cabo Gracias a Dios in present-day Honduras. The idea was to create an early unitary administrative organization similar to what later became Nueva España . Tierra Firme later received control over other territories: the Isla de Santiago the Cayman Islands; Roncador, Quitasueño, and Providencia and other islands now under Colombian control.       In September 1510, the first permanent European settlement,  Santa María la Antigua del Darién  on the Americas mainland was founded. ": null
    },
    {
        "Vasco Nuñez de Balboa": "Vasco Nuñez De Balboa"
    },
    {
        " and ": null
    },
    {
        "Martín Fernández de Enciso": "Martín Fernández De Enciso"
    },
    {
        " agreed on the site near the mouth of the Tarena River on the Atlantic. Balboa maneuvered and was appointed Mayor on the first official cabildo abierto held on the mainland. On August 28, 1513, the Santa María de La Antigua del Darién mission was erected with Fray Juan de Quevedo as the first Catholic Bishop in the continental Americas.                On September 25, 1513 the ": null
    },
    {
        "Balboa expedition": "Vasco Nuñez De Balboadiscovery Of The South Sea"
    },
    {
        " verified claims by indigenous people that the Panama isthmus had another coast to the southwest along another ocean. Balboa was the first known European to see the Pacific Ocean, which he named the South Sea.     The fantastic descriptions of the isthmus by Balboa, as well as by Columbus and other explorers, impressed ": null
    },
    {
        "Ferdinand II of Aragon": "Ferdinand Ii Of Aragon"
    },
    {
        " and Castilla, who named the territory Castilla Aurifica . He assigned ": null
    },
    {
        "Pedro Arias Dávila": "Pedro Arias Dávila"
    },
    {
        " as Royal Governor. Pedrarias arrived in June 1514 with a 22 vessel, 1,500 men armada. Dávila was a veteran soldier who had served in the wars against the Moors at ": null
    },
    {
        "Granada": "Granada"
    },
    {
        " and in North Africa.       On August 15, 1519, Pedrarias, having abandoned Santa María la Antigua del Darién, moved the capital of Castilla del Oro with all its organizational institutions to the Pacific Oceans coast and founded Nuestra Señora de la Asunción de Panamá , the first European settlement on the shores of the Pacific.     Governor Pedrarias sent Gil González Dávila to explore northward, and in 1524 ": null
    },
    {
        "Francisco Hernández de Córdoba": "Francisco Hernández De Córdoba"
    },
    {
        " to settle that region . Pedrarias was a party to the agreement authorizing the expedition by ": null
    },
    {
        "conquistadors": "Conquistador"
    },
    {
        " Francisco Pizarro": "Francisco Pizarro"
    },
    {
        " and ": null
    },
    {
        "Diego de Almagro": "Diego De Almagro"
    },
    {
        " that brought the European discovery and ": null
    },
    {
        "conquest of the Inca Empire": "Spanish Conquest Of The Inca Empire"
    },
    {
        " .     In 1526, Pedrarias was superseded as Governor of Panama by Pedro de los Ríos, and retired to León in Nicaragua, where he was named its new governor on July 1, 1527. Here he died on March 6, 1531, aged 63.     Panama was part of the ": null
    },
    {
        "Spanish Empire": "Spanish Empire"
    },
    {
        " for over 300 years and its fate changed with the geopolitical importance of the isthmus to the Spanish crown. In the 16th and 17th centuries, at the height of the Empire, no other region would prove of more strategic and economic importance.     Governor Pedrarias began building intercontinental and trans-isthmian portage routes, such as the Camino Real and Camino de Cruces , linking Panama City and the Pacific with Nombre de Dios and the Atlantic, making possible the establishment of a trans-atlantic system of Treasure Fleets and trade. It is estimated that of all the gold entering Spain from the New World between 1531 and 1660, 60% had arrived at its destiny via the Treasure Fleet and Fairs system from Nombre de Dios/Portobello.     Explorations and conquest expeditions launched from Panama claimed new lands and riches from Central and South America. Other explorations sought a natural waterway between the Atlantic and the South Sea with the hope of reaching the Molucas  and ": null
    },
    {
        "Cathay": "Cathay"
    },
    {
        " .               In 1538, the Audiencia Real de Panama, ": null
    },
    {
        "Royal Audiencia of Panama": "Royal Audiencia Of Panama"
    },
    {
        ", was established, initially with jurisdiction from Nicaragua to Cape Horn. An ": null
    },
    {
        "Audiencia Real": "Audiencia Real"
    },
    {
        " was a judicial district that functioned as an ": null
    },
    {
        "appellate court": "Appellate Court"
    },
    {
        ". Each audiencia had oidores .     Strategically located on the Pacific coast, Panama City was relatively free of the permanent menace of pirates that roamed the Atlantic coast for over one and a half centuries, until it was destroyed by a devastating fire, when the pirate ": null
    },
    {
        "Henry Morgan": "Henry Morgan"
    },
    {
        " sacked it on January 28, 1671. It was rebuilt and formally established on January 21, 1673, in a peninsula located 8  km from the original settlement. The ruins of the original city are a tourist attraction known as old Panama .     In 1698, a Scottish colony called New Caledonia was founded west of the ": null
    },
    {
        "Gulf of Darien": "Gulf Of Darien"
    },
    {
        " in the Bay of Caledonia, under the ": null
    },
    {
        "Darien scheme": "Darien Scheme"
    },
    {
        ". The scheme failed for a number of reasons, and the ensuing Scottish debt contributed to the 1707 ": null
    },
    {
        "Acts of Union": "Acts Of Union 1707"
    },
    {
        " that joined the previously separate ": null
    },
    {
        "states": "Sovereign State"
    },
    {
        "of the ": null
    },
    {
        "Kingdom of England": "Kingdom Of England"
    },
    {
        " and the ": null
    },
    {
        "Kingdom of Scotland": "Kingdom Of Scotland"
    },
    {
        " – into the ": null
    },
    {
        "Kingdom of Great Britain": "Kingdom Of Great Britain"
    },
    {
        " . ": null
    },
    {
        "Act of Union 1707": "Act Of Union 1707"
    },
    {
        "cimarrons, escaped former slaves who lived in communes or palenques around the Camino Real in Panamas Interior, and on some of the islands off Panamas Pacific coast. During the latter 18th and early 19th centuries, migrations to the countryside decreased Panama Citys population and the isthmus economy shifted from the tertiary to the primary sector.     Attempts by other Europeans to take its Caribbean territory prompted Spain to found the ": null
    },
    {
        "Viceroyalty of New Granada": "Viceroyalty Of New Granada"
    },
    {
        " in 1713. The Isthmus of Panama was placed under its jurisdiction. But the remoteness of New Granadas capital ": null
    },
    {
        "Santa Fe de Bogotá": "Bogotá"
    },
    {
        " proved to be a great obstacle. The authority of the new Viceroyalty was contested by the seniority, closer proximity, previous ties to the ": null
    },
    {
        "Viceroyalty of Peru": "Viceroyalty Of Peru"
    },
    {
        " in Lima and even Panamas own initiative. This uneasy relationship between Panama and Bogotá would persist for a century.          In 1819, New Granada finally achieved freedom from Spain. Panama and the other regions of former New Granada were therefore technically free. Panama considered union with Peru or with Central America in federations that were emerging in the region. Finally it was won over by Venezuelas ": null
    },
    {
        "Simón Bolívar": "Simón Bolívar"
    },
    {
        ", who, after residing in ": null
    },
    {
        "Jacmel": "Jacmel"
    },
    {
        ", Haiti, was given 2 armies to liberate South America. Bolívars ambitious project of a ": null
    },
    {
        "Gran Colombia": "Gran Colombia"
    },
    {
        " was taking shape. Then, timing the action with the rest of the Central American isthmus, Panama declared ": null
    },
    {
        "independence": "Independence Of Panama From Spain"
    },
    {
        " in 1821 and joined the southern federation. As the isthmus central interoceanic traffic zone, as well as the City of Panama had been of great historical importance to the ": null
    },
    {
        "Spanish Empire": "Spanish Empire"
    },
    {
        " and subject of direct influence, so, the differences in social and economic status between the more liberal region of ": null
    },
    {
        "Azuero": "Azuero Peninsula"
    },
    {
        ", and the much more royalist and conservative area of ": null
    },
    {
        "Veraguas": "Veraguas"
    },
    {
        " displayed contrasting loyalties. When the Grito de la Villa de Los Santos independence motion occurred, Veraguas firmly opposed it.       The Panamanian movement for independence can be indirectly attributed to the abolishment of the ": null
    },
    {
        "encomienda": "Encomienda"
    },
    {
        " system in Azuero, set forth by the Spanish Crown, in 1558 due to repeated protests by locals against the mistreatment of the native population. In its stead, a system of medium and smaller-sized landownership was promoted, thus taking away the power from the large landowners and into the hands of medium and small sized proprietors.     However, the end of the encomienda system in Azuero sparked the conquest of Veraguas in that same year. Under the leadership of ": null
    },
    {
        "Francisco Vázquez": "Francisco Vásquez De Coronado"
    },
    {
        ", the region of Veraguas passed into Castillan rule in 1558. In the newly conquered region, the old system of encomienda was reimposed.         After the region of Veraguas was conquered, the two regions settled for a mutual dislike of each other. Inhabitants of Azuero considered their own region symbolic of the power of the people, while Veraguas represented an old, oppressive order. Diametrically, inhabitants of Veraguas saw their region as a bastion of loyalty and morality, while Azuero was a hotbed for vice and treason.     The tension between the two regions peaked when the first printing press arrived in Panama in 1820. Under the guidance of ": null
    },
    {
        "José María Goitía": "José María Goitía"
    },
    {
        ", the press was used to create a newspaper called La Miscelánea. Panamanians ": null
    },
    {
        "Mariano Arosemena": "Mariano Arosemena"
    },
    {
        ", ": null
    },
    {
        "Manuel María Ayala": "Manuel María Ayala"
    },
    {
        ", and ": null
    },
    {
        "Juan José Calvo": "Juan José Calvo"
    },
    {
        ", as well as Colombian ": null
    },
    {
        "Juan José Argote": "Juan José Argote"
    },
    {
        ", formed the writing team of the new newspaper, whose stories would circulate throughout every town in the isthmus.     The newspaper was put to use for the cause of independence. It circulated stories expounding the virtues of liberty, independence, and the teachings of the French Revolution, as well as stories of the great battles of Bolívar, the emancipation of the United States from their British masters, and the greatness of men such as Santander, Jose Martí, and other such messengers of freedom.     Due to the narrow area of circulation, those in the capital were able to transmit these intoxicating ideals to other such separatists, such as those in Azuero. In Veraguas, however, there remained a strict sense of submission to the Spanish Crown.         On November 10, 1821, in a special event called Grito de La Villa de Los Santos, the residents of the Azuero declared their separation from the Spanish Empire. In Veraguas and Panama City, this act was met with disdain, but of differing degrees. To Veraguas, it was the ultimate act of treason, while in the capital, it was seen as inefficient and irregular, and it forced them to accelerate their plans.     The Grito event shook the isthmus to the core. It was a sign, on the part of the Azuero residents, of their antagonism to the independence movement in the capital, who in turn regarded the Azueran movement with contempt, as they believed that Azuerans fought against their right to rule, once the peninsulares were long gone.     The Grito was an incredibly brave move by Azuero, which feared quick retaliation by staunch loyalist Colonel ": null
    },
    {
        "José de Fábrega": "José De Fábrega"
    },
    {
        ", who had controlled the isthmus military supplies. However, separatists in the capital had converted Fábrega to separatism by. This gradual process had begun when Fábrega was left in charge by the former Governor General, ": null
    },
    {
        "Juan de la Cruz Mourgeón": "Juan De La Cruz Mourgeón"
    },
    {
        ", who had left the isthmus on a campaign in Quito in October 1821. Thus, soon after the separatist declaration of Los Santos, Fábrega convened every organization in the capital with separatist interests and formally declared the citys support for independence. No military repercussions occurred due to the skillful bribing of royalist troops.     Having sealed the fate of the Spanish Crowns rule in Panama with his defection, Jóse de Fábrega now collaborated with the separatists in the capital to bring about a national assembly, where the fate of the country would be decided. Every region in Panama attended the assembly, including the former loyalist region of Veraguas, which was eventually convinced to join the revolution, due to the sheer fact that nothing more could be done for the royalist presence in Panama. Thus, on November 28, 1821, the national assembly was convened and ": null
    },
    {
        "Independence Act of Panama": "Independence Act Of Panama"
    },
    {
        " was officially declared that the isthmus of Panama had severed its ties with the Spanish Empire and its decision to join New Granada and Venezuela in Bolívars recently founded Republic of Colombia.     After the act, Fábrega wrote to Bolívar of the event, saying:       Exalted Sir,     I have the pleasure to communicate to Your Excellency the praiseworthy news of the Isthmus decision of independence from Spanish dominion. The town of Los Santos, to the comprehension of this Province, was the first town to pronounce with enthusiasm the sacred name of Liberty and immediately almost every other town imitated their glorious example...     Inasmuch as I am concerned, Most Excellent Sir, the effusion of my gratitude is inexplicable, at having had the unique satisfaction capable of filling the human heart, as is to deserve the public confidence in circumstances so critical to govern the independent Isthmus; and I can only correspond to such high distinction with the sacrifices I am willing to make since I devoted myself, as it wished, to the mother country that has seen me be born and to who I owe all that I own...       Bólivar, in turn, replied,       It is not possible to me to express the feeling of joy and admiration that I have experimented to the knowledge that Panama, the center of the Universe, is segregated by itself and freed by its own virtue. The act of independence of Panama is the monument most glorious that any American province can give. Everything there is addressed; justice, generosity, policy and national interest. Transmit, then, you to those meritorious Colombians the tribute of my enthusiasm by their pure patriotism and true actions...               ": null
    },
    {
        "Simón Bolívar": "Simón Bolívar"
    },
    {
        " had hesitated to include Panama in his ": null
    },
    {
        "Gran Colombia": "Gran Colombia"
    },
    {
        " project, because he was aware of Panamas geographical obstacles and the unique qualities and its critical role in trade throughout history and under Spanish tutelage. Also, he had no role in Panamas independence, unlike his decisive military factor in the independence of Venezuela, New Granada and Ecuador. Thus, while Bolívar knew that Panama was linked historically and culturally to South America, he also knew that the region was part of the Central American geography. This view is clearly seen in some of his famous documents and quotes such as his Carta de Jamaica :       The Isthmian States, from Panama to Guatemala, will perhaps form an association. This magnificent position between the two great oceans could with time become the emporium of the universe. Its canals will shorten the distances of the world: they will narrow commercial ties between Europe, America and Asia; and bring to such fortunate region the tributes of the four parts of the globe. Perhaps some day only there could the capital of the world be established!     New Granada will join Venezuela, if they convene to form a new republic, their capital will be Maracaibo….This great nation would be called Colombia in tribute to the justice and gratitude of the creator of our hemisphere.     Nevertheless, in 1821, convinced that under Bolívars leadership the nations destiny would move in the most progressive direction, the Isthmus joined Venezuela, New Granada and in 1822 Ecuador. The ": null
    },
    {
        "Republic of Colombia": "Great Colombia"
    },
    {
        " or ‘Gran Colombia’ as it was called after 1886, roughly corresponded in territory to the former colonial administrative district ": null
    },
    {
        "Viceroyalty of New Granada": "Viceroyalty Of New Granada"
    },
    {
        " . Although Panama belonged to that Viceroyalty, its economic and political ties had been much closer to the Viceroyalty of Peru .     Panama separated from the Republic of Colombia In September 1830 under the guidance of General José Domingo Espinar. Espinar rebelled against the nations central government in response to being transferred to another command, and requested that Bolívar take direct command of the ": null
    },
    {
        "Isthmus Department": "Isthmus Department"
    },
    {
        ". It made this a condition to reunification with Republic of Colombia. Bolívar rejected Espinars actions and called for Panama to rejoin the central state.     Because of overall political tension, Republic of Colombias final days approached. Bolívars vision for territorial unity disintegrated when General Juan Eligio Alzuru led a military coup against Espinar. After order was restored, in early 1831 Panama rejoined what was left of the republic, forming a territory slightly larger than present Panama and Colombia combined, which by then had adopted the name ": null
    },
    {
        "Republic of New Granada": "Republic Of New Granada"
    },
    {
        ". The alliance lasted 70 years and proved precarious.         Juan Lopez Sr. Jr. 3 of Venezuela and Ecuador were being established, the isthmus again reiterated its independence, now under the same General Alzuru as supreme military commander. Abuses by Alzurus short-lived administration were countered by forces led by Colonel ": null
    },
    {
        "Tomás de Herrera": "Tomás De Herrera"
    },
    {
        ", resulting in the defeat and execution of Alzuru in August, and the reestablishment of ties with ": null
    },
    {
        "New Granada": "Republic Of The New Granada"
    },
    {
        ".     A religious conflict sparked a civil war. During this war, in November 1840, the isthmus led by General Tomás Herrera, who assumed the title Superior Civil Chief, declared its independence as did multiple other local authorities. The State of Panama took in March 1841 the name of Estado Libre del Istmo, or the Free State of the Isthmus. The new state established external political and economic ties and by March 1841, had drawn up a constitution which included the possibility to rejoin New Granada, but only as a federal district. Herreras title was changed to Superior Chief of State in March 1841 and in June 1841 to President. By the time the civil conflict ended and New Granada and the Isthmus had negotiated the Isthmuss reincorporation to the union, Panamas First Republic had been free for 13 months. Reunification happened on December 31, 1841.     In the end, the union was made possible by the active participation of USA under the 1846 Bidlack Mallarino treaty until 1903. In the 1840s, two decades after the ": null
    },
    {
        "Monroe Doctrine": "Monroe Doctrine"
    },
    {
        " declared US intentions to be the dominant anti-European imperial power in the ": null
    },
    {
        "Western Hemisphere": "Western Hemisphere"
    },
    {
        ", North American and French interests became excited about the prospects of constructing railroads and/or canals through Central America to quicken trans-oceanic travel. At the same time, it was clear that New Granadas control over the isthmus was becoming untenable. In 1846, the US and New Granada signed the ": null
    },
    {
        "Bidlack Mallarino Treaty": "Bidlack Mallarino Treaty"
    },
    {
        ", granting the US right of way across the Isthmus, and most significantly the power to intervene militarily, ensuring neutrality of the Isthmus, and guaranteeing New Granada sovereignty. Musicant, I, The Banana Wars, 1990, New York: Macmillan Publishing Co.,       The worlds first ": null
    },
    {
        "transcontinental railroad": "Transcontinental Railroad"
    },
    {
        ", the ": null
    },
    {
        "Panama Railway": "Panama Railway"
    },
    {
        ", was completed in 1855 across the Isthmus from ": null
    },
    {
        "Aspinwall/Colón": "Colón, Panama"
    },
    {
        " to ": null
    },
    {
        "Panama City": "Panama City"
    },
    {
        ".  The US used troops to suppress separatist uprisings and social disturbances on many occasions.  The first conflict was known as the ": null
    },
    {
        "Watermelon War": "Watermelon War"
    },
    {
        " of 1856, where US soldiers mistreated locals, causing massive race riots that US Marines eventually put down.     Under a federalist constitution that was later brought up in 1858 , Panama and other constituent states gained almost complete autonomy on many levels of their administration, which led to an often ": null
    },
    {
        "anarchic": "Anarchy"
    },
    {
        " national state of affairs that lasted roughly until Colombias return to centralism in 1886 with the establishment of a new Republic of Colombia.     As was often the case in the New World after independence, administration and politics were controlled by the remnants of colonial aristocracy. In Panama, this elite was a group of under ten extended families. Though Panama has made enormous advances in social mobility and ": null
    },
    {
        "racial integration": "Racial Integration"
    },
    {
        ", still much of economic and social life is controlled by a small number of families. The derogatory term rabiblanco , of uncertain origin, has been used for generations to refer to the usually Caucasian members of the elite families.     In 1852, the isthmus adopted trial by jury in criminal cases and—30 years after abolition—would finally declare and enforce an end to slavery.          Panamanian history which has been shaped by the recurrent theme of transisthmian commerce, looked now at the possibility of a canal to replace the difficult overland route. In 1519, the Spanish crown built a cobbled track joined the oceans, and by 1534, the Chagres River was dredged, facilitating traffic for two-thirds of the way.        From 1882, ": null
    },
    {
        "Ferdinand de Lesseps": "Ferdinand De Lesseps"
    },
    {
        " started work on a canal.  By 1889, with engineering challenges caused by frequent landslides, slippage of equipment and mud, plus disease, the effort failed in bankruptcy.  A new company was formed in 1894 to recoup some of the losses of the original canal company.             US President ": null
    },
    {
        "Theodore Roosevelt": "Theodore Roosevelt"
    },
    {
        " convinced US Congress to take on the abandoned works in 1902, while Colombia was in the midst of the ": null
    },
    {
        "Thousand Days War": "Thousand Days War"
    },
    {
        ". During the war, there were at least three attempts by Panamanian Liberals to seize control of Panama and potentially achieve full autonomy, including one led by Liberal ": null
    },
    {
        "guerrillas": "Guerrilla Warfare"
    },
    {
        " like ": null
    },
    {
        "Belisario Porras": "Belisario Porras"
    },
    {
        " and ": null
    },
    {
        "Victoriano Lorenzo": "Victoriano Lorenzo"
    },
    {
        ", each of whom was suppressed by a collaboration of Conservative Colombian and US forces under the ": null
    },
    {
        "Mallarino–Bidlack Treaty": "Mallarino–Bidlack Treaty"
    },
    {
        " which had been in effect since 1846. The Roosevelt administration proposed to Colombia that the US should control the canal in return for a $10 million payment and $250,000 annual payment that would begin in 1912. The negotiations initially went well for the US and it received everything it was asking for in the ": null
    },
    {
        "Hay–Herrán Treaty": "Hay–Herrán Treaty"
    },
    {
        ", but the Colombian government, upset by the US bias in the treaty, refused to ratify it and began demanding more money. By September 1903, negotiations had all but broken down. The US then changed tactics.      According to the treaty, the US was to pay $40,000,000 to the stockholders of the French company that had tried to build the canal across Panama.  Colombias rejection of the treaty confronted these French investors with the prospect of losing everything. At this point, the French companys chief lobbyist , ": null
    },
    {
        "Philippe Bunau-Varilla": "Philippe-Jean Bunau-Varilla"
    },
    {
        " went into action. Justly confident that the Roosevelt administration would support his initiative, he met with ": null
    },
    {
        "Manuel Amador": "Manuel Amador Guerrero"
    },
    {
        ", the leader of the Panamanian Independence movement, in a suite in the Waldorf-Astoria hotel in New York where he wrote him a $100,000 check to fund a renewed Panamanian revolt. In return, Bunau-Varilla would become Panamas representative in Washington.      Bunau-Varilla arranged for the Panama City fire department to stage a revolution against Colombia which officially began on November 3, 1903. The US Navy ": null
    },
    {
        "gunboat": "Gunboat"
    },
    {
        "  was dispatched to local waters around the city of Colón, where 474 Colombian soldiers had landed to cross the isthmus and crush the rebellion.  Nashvilles ": null
    },
    {
        "commanding officer": "Commanding Officer"
    },
    {
        ", ": null
    },
    {
        "Commander": "Commander"
    },
    {
        " John Hubbard": "John Hubbard"
    },
    {
        ", sent a small party ashore and, with the support of the American superintendent of the Panama Railroad, prevented the Colombians from taking the train to Panama City. On November 13, 1903, after 57 years of policing Bogotás interests, the US formally recognized the country of Panama.      Less than three weeks later, on November 18, 1903, the ": null
    },
    {
        "Hay–Bunau-Varilla Treaty": "Hay–Bunau-Varilla Treaty"
    },
    {
        " was signed between Frenchman Philippe Bunau-Varilla, who had promptly been appointed Panamanian ambassador to the United States, representing Panamanian interests, and the US Secretary of State John Hay. The treaty allowed for the construction of a ": null
    },
    {
        "canal": "Canal"
    },
    {
        " and US sovereignty over a strip of land  wide and  long, on either side of the ": null
    },
    {
        "Panama Canal Zone": "Panama Canal Zone"
    },
    {
        ". In that zone, the US would build a canal, then administer, fortify, and defend it in perpetuity .     Roosevelts explanation of the US role in the region was made clear throughout many speeches since 1902. First, he invoked the Mallarino–Bidlack Treaty; second, he made clear that Colombia had rejected his offers for a deal; and finally, he argued that Colombia had never been able to prevent Panama from gaining sovereignty. On his December 7, 1903 Third Annual Message to the Senate and House of Representatives, he enumerated an extensive list of interventions the US armed forces had made in Panama since 1850 explaining:       The above is only a partial list of the revolutions, rebellions, insurrections, riots, and other outbreaks that have occurred during the period in question; yet they number fifty-three for the fifty-three years...       And he added:       In short, the experience of over half a century has shown Colombia to be utterly incapable of keeping order on the Isthmus. Only the active interference of the United States has enabled her to preserve so much as a semblance of sovereignty. Had it not been for the exercise by the United States of the police power in her interest, her connection with the Isthmus would have been sundered long ago.       Treaties like the Bidlack-Mallarino Treaty were considered constitutional and legal, even though they involved US interference in matters of a sovereign country. Roosevelts speeches made clear that the US decided to unilaterally break with the Bidlack-Mallarino treaty and, instead of solving the internal Panamanian problem as the treaty stipulated, helped Panama to separate from Colombia. Thus it enforced only that part of the treaty which was of interest to the US, namely, ": null
    },
    {
        " it granted the US significant transit rights over the Panamanian isthmus ": "Mallarino–Bidlack Treaty"
    },
    {
        ".     It is a common mistake to call the 1903 events ‘Panama’s independence from Colombia’. Panamanians do not consider themselves former Colombians. They celebrate their independence from Spain on November 28, 1821, and separation from Colombia on November 3, 1903, which is referred to as Separation Day .           The reaction to the treaty in the US was generally positive, public support for building a canal having already been high. The Panamanian reaction, however, was more mixed. Although the new Panamanian government, led by Manuel Amador, was happy to have its independence from Colombia, they also knew that the US could easily assert itself over them if it felt they were not working in line with its interests. They had instructed their ambassador, Bunau-Varilla, to not make any agreements with the US that would compromise Panamas new freedom, nor could he make a canal treaty without consulting them. Both of these orders were ignored. Nevertheless, the Panamanian government, fearing the alternative, ratified the treaty.     By the time the Canal opened in 1914, many Panamanians still questioned the validity of the treaty. The controversy surrounding the USs presence in Panama was a major issue in Panamanian politics throughout the following decades and revisions to the Hay—Bunau-Varilla Treaty in 1936 and 1955  both failed to adequately address the situation. The controversy would continue until the US agreed to hand over the Canal Zone wholly to Panama in the 1977 ": null
    },
    {
        "Torrijos-Carter Treaties": "Torrijos–Carter Treaties"
    },
    {
        ".        The Panama Canal was built by the ": null
    },
    {
        "U.S. Army Corps of Engineers": "U.S. Army Corps Of Engineers"
    },
    {
        " between 1904 and 1914; the existing 83-kilometer lock canal is considered one of the worlds great engineering triumphs. On January 5, 1909 the government of ": null
    },
    {
        "Rafael Reyes": "Rafael Reyes"
    },
    {
        " in Colombia signed and presented to its Congress a treaty that would officially recognize the loss of its former province, but the treaty was not ratified, due to popular and legislative opposition. Negotiations continued intermittently until a new treaty was signed on December 21, 1921 which formally accepted the independence of Panama.     Roosevelts policy to ‘walk softly and carry a big stick’, and the Canal Companys apartheid early on, have been much criticized. Yet, beyond the financial injection to the countrys economy and workforce, the changes brought about by the canal venture were largely positive for Panama. To sanitize the area before and during construction, engineers developed an infrastructure to treat potable water, sewage, and garbage, that encompassed the Canal Zone and the cities of Panama and Colon.     Standards in construction, transportation and landscaping for the Canal Zones urban development during the first half of the 20th century had no parallel in tropical regions in the hemisphere. Dr. William Gorgas used techniques pioneered by Cuban physician Carlos Finley, to rid the area of yellow fever between 1902 and 1905. Gorgas work in the sanitation of the Canal Zone and the cities of Panama and Colon eventually made him sought after internationally.     The Panama Canal, the area supporting the Canal, and remaining US military bases were turned over to Panama on December 31, 1999 in accordance with the Torrijos-Carter Treaties.           From 1903 until 1968, Panama was a republic dominated by a commercially oriented ": null
    },
    {
        "oligarchy": "Oligarchy"
    },
    {
        ". During the 1950s, the Panamanian military began to challenge the oligarchys political hegemony. The January 9, 1964 ": null
    },
    {
        "Martyrs Day": "Martyrs Day"
    },
    {
        " riots escalated tensions between the country and the US government over its long-term occupation of the Canal Zone. Twenty rioters were killed, and 500 other Panamanians were wounded. 4 US soldiers were killed as well.     In October 1968, Dr. ": null
    },
    {
        "Arnulfo Arias Madrid": "Arnulfo Arias Madrid"
    },
    {
        " was elected president for the third time. Twice ousted by the Panamanian military, he was ousted again as president by the ": null
    },
    {
        "National Guard": "Panamanian National Guard"
    },
    {
        " after only 10 days in office. A military junta government was established, and the commander of the National Guard, Brig. Gen. ": null
    },
    {
        "Omar Torrijos": "Omar Torrijos"
    },
    {
        ", emerged as the principal power in Panamanian political life. Torrijos implemented a populist policy, with the inauguration of schools and the creation of jobs, the redistribution of agricultural land . The reforms were accompanied by a major public works programme. It also faces North American multinationals, demanding wage increases for workers and redistributing 180,000 hectares of uncultivated land. In February 1974, following OPECs model for oil, it attempted to form the Union of Banana Exporting Countries with the other Central American States to respond to the influence of these multinationals, but did not obtain their support. Its policy promotes the emergence of a middle class and the representation of indigenous communities.     On September 7, 1977, the ": null
    },
    {
        "Torrijos–Carter Treaties": "Torrijos–Carter Treaties"
    },
    {
        " were signed by the Panamanian head of state Omar Torrijos and US President ": null
    },
    {
        "Jimmy Carter": "Jimmy Carter"
    },
    {
        " for the complete transfer of the Canal and the 14 US army bases from the US to Panama by 1999. These treaties also granted the US a perpetual right of military intervention. Certain portions of the Zone and increasing responsibility over the Canal were turned over in the intervening years.             Torrijos died in a mysterious plane crash on August 1, 1981. The circumstances of his death generated charges and speculation that he was assassinated. Torrijos death changed the tone but not the direction of Panamas political evolution. Despite constitutional amendments in 1983, which appeared to proscribe a political role for the military, the ": null
    },
    {
        "Panama Defense Forces": "Panama Defense Forces"
    },
    {
        " continued to dominate political life behind a facade of civilian government. By then, General ": null
    },
    {
        "Manuel Noriega": "Manuel Noriega"
    },
    {
        " was firmly in control of both the PDF and the civilian government, and had created the ": null
    },
    {
        "Dignity Battalions": "Dignity Battalions"
    },
    {
        " to help suppress opposition.     Despite undercover collaboration with US president ": null
    },
    {
        "Ronald Reagan": "Ronald Reagan"
    },
    {
        " on his ": null
    },
    {
        "Contra": "Contra"
    },
    {
        " war in ": null
    },
    {
        "Nicaragua": "Nicaragua"
    },
    {
        " , to deliver arms and drugs by airplane, ": null
    },
    {
        "relations between the United States and Panama": "Panama–United States Relations"
    },
    {
        " worsened in the 1980s. In response to a domestic political crisis and an attack on the US embassy, the US froze economic and military aid to Panama in the summer of 1987. Tensions sharpened in February 1988 when Noriega was indicted in US courts for drug-trafficking. In April 1988, Reagan invoked the ": null
    },
    {
        "International Emergency Economic Powers Act": "International Emergency Economic Powers Act"
    },
    {
        ", freezing Panamanian Government assets in US banks, withholding fees for using the canal, and prohibiting payments by US agencies, firms, and individuals to the Noriega regime. The country went into turmoil.     National elections of May 1989 were marred by accusations of fraud from both sides. Panamanian authorities arrested American Kurt Muse who had set up an installation to jam Panamanian radio and broadcast phony election returns. However, the election proceeded and ": null
    },
    {
        "Guillermo Endara": "Guillermo Endara"
    },
    {
        " won by a margin of over three-to-one over Noriega. The Noriega regime promptly annulled the election, citing massive US interference, and embarked on new repression.     Foreign observers including the Catholic Church and ": null
    },
    {
        "Jimmy Carter": "Jimmy Carter"
    },
    {
        " certified Endaras electoral victory despite widespread attempts at fraud by the regime. At the request of the US, the ": null
    },
    {
        "Organization of American States": "Organization Of American States"
    },
    {
        " convened a meeting of foreign ministers but was unable to obtain Noriegas departure. The US began sending thousands of troops to bases in the canal zone. Panamanian authorities alleged that US troops left their bases and illegally stopped and searched vehicles in Panama. An American Marine got lost in the former French quarter of Panama City, ran a roadblock, and was killed by Panamanian Police .               By autumn 1989 the regime was barely clinging to power. On December 20, US troops began an ": null
    },
    {
        "invasion of Panama": "United States Invasion Of Panama"
    },
    {
        ". They achieved their objectives and began withdrawal on December 27. The US was obligated to return control of the Canal to Panama on January 1 due to a treaty signed decades before. Endara was sworn in as President at a US military base on the day of the invasion. Noriega is now serving a 40-year sentence for drug trafficking.     The US estimated the civilian death toll at 202, while the UN estimated 500 civilians dead and Americas Watch put the civilian death toll at 300.      After the invasion, US President George H. W. Bush announced a billion dollars in aid to Panama. Critics argue that about half of the aid was a gift from American taxpayers to American businesses, because $400 million consisted of incentives for US business to export products to Panama, $150 million was to pay off bank loans and $65 million went to private sector loans and guarantees to US investors.        In the morning of December 20, 1989, hours after the invasion started, the presumptive winner of the May 1989 election, Guillermo Endara, was sworn in as president of Panama at a US military installation in the ": null
    },
    {
        "Canal Zone": "Panama Canal Zone"
    },
    {
        ". On December 27, Panamas Electoral Tribunal invalidated the Noriega regimes annulment of the May 1989 election and confirmed the victory of opposition candidates for president and vice presidents .     President Endara took office as the head of a four-party minority government, pledging to foster Panamas economic recovery, transform the Panamanian military into a police force under ": null
    },
    {
        "civilian control": "Civilian Control Of The Military"
    },
    {
        ", and strengthen democratic institutions. During its 5-year term, the Endara government struggled to meet the publics high expectations. Its new police force proved to be a major improvement in outlook and behavior over its thuggish predecessor but was not fully able to deter crime. In 1992, he would have received 2.4% of the vote if there had been an election.  After an internationally monitored election campaign, ": null
    },
    {
        "Ernesto Pérez Balladares": "Ernesto Pérez Balladares"
    },
    {
        " was sworn in as President on September 1, 1994.     He ran as the candidate for a three-party coalition dominated by the ": null
    },
    {
        "Democratic Revolutionary Party": "Democratic Revolutionary Party"
    },
    {
        " , the erstwhile political arm of the military dictatorship during the Torrijos and Norieiga years. A long-time member of the PRD, Pérez Balladares worked skillfully during the campaign to rehabilitate the PRDs image, emphasizing the partys populist Torrijos roots rather than its association with Noriega. He won the election with only 33% of the vote when the major non-PRD forces, unable to agree on a joint candidate, splintered into competing factions. His administration carried out economic reforms and often worked closely with the US on implementing the Canal treaties.     On May 2, 1999, ": null
    },
    {
        "Mireya Moscoso": "Mireya Moscoso"
    },
    {
        ", the widow of former President ": null
    },
    {
        "Arnulfo Arias Madrid": "Arnulfo Arias Madrid"
    },
    {
        ", defeated PRD candidate ": null
    },
    {
        "Martín Torrijos": "Martín Torrijos"
    },
    {
        ", son of the late dictator. The elections were considered free and fair. Moscoso took office on September 1, 1999.     During her administration, Moscoso tried to strengthen social programs, especially for child and youth development, protection, and general welfare. Education programs have also been highlighted. More recently, Moscoso focused on bilateral and multilateral free trade initiatives with the hemisphere. Moscosos administration successfully handled the Panama Canal transfer and has been effective in administering of the Canal.     Panamas official counternarcotics cooperation has historically been excellent. For example, officials of the US ": null
    },
    {
        "Drug Enforcement Administration": "Drug Enforcement Administration"
    },
    {
        " praised the role of ": null
    },
    {
        "Manuel Noriega": "Manuel Noriega"
    },
    {
        " prior to his falling-out with the US over his own drug dealing. The Panamanian Government expanded money-laundering legislation and concluded with the US a Counternarcotics Maritime Agreement and a Stolen Vehicles Agreement. The Panamanian Government has enforced intellectual property rights and concluded the very important Bilateral Investment Treaty Amendment with the US and an agreement with the ": null
    },
    {
        "Overseas Private Investment Corporation": "Overseas Private Investment Corporation"
    }
]