[
    {
        "      The history of Nepal is intertwined with the history of the broader ": null
    },
    {
        "Indian subcontinent": "Indian Subcontinent"
    },
    {
        " and the surrounding regions, comprising the areas of ": null
    },
    {
        "South Asia": "South Asia"
    },
    {
        " and ": null
    },
    {
        "East Asia": "East Asia"
    },
    {
        ".     It is a multi-ethnic, multiracial, multicultural, multi-religious, and multilingual country. The most spoken language of Nepal is ": null
    },
    {
        "Nepali": "Nepali Language"
    },
    {
        " followed by several other ethnic languages.     Nepal experienced a struggle for democracy at times in the 20th century and early 21st century. During the 1990s and until 2008, the country was in a civil strife. A peace treaty was signed in 2006 and elections were held in the same year. In a historical vote for the election of the ": null
    },
    {
        "constituent assembly": "Constituent Assembly"
    },
    {
        ", Nepalese parliament voted to oust the ": null
    },
    {
        "monarchy": "Monarchy"
    },
    {
        " in June 2006. Nepal became a ": null
    },
    {
        "federal republic": "Federal Republic"
    },
    {
        " on 28 May 2008 and was formally renamed the Federal Democratic Republic of Nepal ending the 200 year old ": null
    },
    {
        "Shah dynasty": "Shah Dynasty"
    },
    {
        ".       In a Licchavi-era inscription found in Tistung, the local people have been addressed are the Nepals. Experts are of the opinion that some or all of the inhabitants of Nepal in the ancient period were likely called Nepals, which meant that the word Nepal was used to refer to both the land and its population. These Nepals are considered the progenitors of modern-day Newars. The terms Nepal and Newar are variations of the same term. Other variants found in medieval texts are Nepar and Newal.     The derivation of the word Nepal is also the subject of a number of other theories:   Nep are the people that used to be cow herders  who came to the Nepal valley from the ": null
    },
    {
        "Ganges Plain": "Ganges Plain"
    },
    {
        " of modern-day India. Combining the two words yields Nepal.   The ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " word nepalaya means at the foot of the mountains or abode at the foot ; Nepal may be derived from this.   The ": null
    },
    {
        "Tibetan": "Classical Tibetan"
    },
    {
        " word niyampal means holy land . Nepal may be derived from it.   Some inhabitants of northern Nepal came from Tibet, where they herded sheep and produced wool. In Tibetan, ne means wool and pal means house . Thus, Nepal is house of wool .    A popular theory is that ": null
    },
    {
        "Lepcha people": "Lepcha People"
    },
    {
        " used the words ne and pal and thus Nepal to describe a holy cave .   According to Buddhist legend, the deity ": null
    },
    {
        "Manjusri": "Manjusri"
    },
    {
        " drained the water from ": null
    },
    {
        "Nagadaha": "Nagadaha"
    },
    {
        " . The valley became inhabitable and was ruled by ": null
    },
    {
        "Bhumigupta": "Hinduism In Nepalhindu Foundation Of The Kingdom Of Nepal"
    },
    {
        ", a cow-herder, who took advice from a sage named Ne . Pāla means protector or taking care , so Nepal reflected the name of the sage who took care of the place, according to Nepali scholar Rishikesh Shaha.                Prehistoric site of ": null
    },
    {
        "palaeolithic": "Paleolithic"
    },
    {
        ", ": null
    },
    {
        "Mesolithic": "Mesolithic"
    },
    {
        " and ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " have been discovered in the Siwalik hills of Dang District.  The earliest inhabitants of modern Nepal and adjoining areas are believed to be people from the ": null
    },
    {
        "Indus Valley Civilization": "Indus Valley Civilization"
    },
    {
        ", though concrete evidence to support the theory is lacking. ": null
    },
    {
        "Tharus": "Tharu People"
    },
    {
        ", Tibeto-Burmans who mixed heavily with Indians in the southern regions, are natives of the Cental ": null
    },
    {
        "Terai": "Terai"
    },
    {
        " region of Nepal. The first documented tribes in Nepal are the ": null
    },
    {
        "Kirat people": "Kirat People"
    },
    {
        ", who arrived into Nepal roughly 2500 years ago and moved into the Kathmandu Valley, before being made to retreat by the invading Licchavais from India. Other ethnic groups of Indo-Aryan origin later migrated to southern part of Nepal from ": null
    },
    {
        "Indo-Gangetic Plain": "Indo-Gangetic Plain"
    },
    {
        " of ": null
    },
    {
        "northern India": "Northern India"
    },
    {
        ".         Very little is known about the early history of Nepal, legends and documented references reach far back to the 30th century BC:    Also, the presence of historical sites, e.g., ": null
    },
    {
        "Valmiki": "Valmiki"
    },
    {
        " ashram": "Ashram"
    },
    {
        ", indicates the presence of Sanatana Hindu culture in parts of Nepal at that period.   According to some legendary accounts in the chronicles, the successors of Nepal were the gopālavaṃśi/": null
    },
    {
        "gopal bansa": "Gopal Bansa"
    },
    {
        " or Cowherd family are said to have ruled for some 491 years. They are said to have been followed by the mahaiṣapālavaṃśa or Buffalo-herder Dynasty , established by a ": null
    },
    {
        "Rajput": "Rajput"
    },
    {
        " named Bhul Singh. ": null
    },
    {
        "Shaha, Rishikesh": "Shaha, Rishikesh"
    },
    {
        ". Ancient and Medieval Nepal , p. 7. Manohar Publications, New Delhi. .       The context of ": null
    },
    {
        "Kirats": "Kirata Kingdom"
    },
    {
        " ruling in Nepal before ": null
    },
    {
        "Licchavi": "Licchavi"
    },
    {
        " Dynasty and after Mahispal or Avir Dynasty can be found in different manuscripts. Mentioning the area between Sun Kosi and Tama Kosi as their native land, the list of Kirati kings is also given in the Gopal genealogy. By defeating the last king of Avir Dynasty Bhuwansingh in a battle, Kirati King Yalung or ": null
    },
    {
        "Yalamber": "Yalambar"
    },
    {
        " had taken the regime of the valley under his control. In the Hindu mythological perspective, this event is believed to have taken place in the final phase of Dwaparyug or initial phase of Kaliyug or around the 6th century BC. We can find descriptions of 32, 28 and 29 Kirati kings according in Gopal genealogy, language-genealogy and Wright genealogy respectively.  By means of the notices contained in the classics of the East and West, we are assured that ": null
    },
    {
        "Kiranti people ": "Kirati People"
    },
    {
        " was forth-coming in their present abode from 2000 to 2500 years back, and that their powers was great and their dominion extensive, reaching possibly at one time to the delta of the Ganges.        The kings of the ": null
    },
    {
        "Lichhavi": "Licchavi"
    },
    {
        " dynasty ruled Nepal after the Kirat monarchical dynasty. The context that Suryavansi Kshetriyas had established new regime by defeating the Kirats can be found in some genealogies and Puranas. It has been written in Gopal genealogy that then, defeating the Kirat King with the impact of Suryavanshi, Lichhavi dynasty was established in Nepal. Likewise, It has been written in Pashupati Purana that the masters of Vaishali established their own regime by confiding Kiratis with sweet words and defeating them in war. Similar contexts can be also found in Himbatkhanda. That purana also mention that the masters of Vaishali had started ruling in Nepal by defeating Kirats. In this way, Lichhavis regime seems to have started in Nepal subsequently after the regime of Kirats. However, different genealogies have found to be stating different names of last Kirati King. The Lichhavi monarchical dynasty was established in Nepal by defeating last Kirati King Khigu, according to Gopal genealogy, Galiz according to language-genealogy and Gasti, according to Wright genealogy.        The Simroun, Karnat or Dev Dynasty originated with an establishment of a kingdom in 1097 CE headquartered at present day ": null
    },
    {
        "Simroungarh": "Simraungadh"
    },
    {
        " in Bara District. The kingdom controlled the areas we today know as Tirhoot or Mithila in Nepal and Bihar of India. The rulers of Simroungarh are as follows:   Nanya Dev - 1097 - 1147 CE   Ganga Dev - 1147 - 1187 CE   Narsingh Dev - 1187 - 1227 CE   Ramsingh Dev - 1227 - 1285 CE   Shaktisingh Dev - 1285 - 1295 CE   Harisingh Dev - 1295 - 1324 CE    In 1324 CE, ": null
    },
    {
        "Ghiyasuddin Tughlaq": "Ghiyath Al-Din Tughluq"
    },
    {
        " attacked Simroungarh and demolished the fort. The remains are still scattered all over the Simroungarh region. The king fled northwards into the then Nepal. The son of Harisingh Dev, Jagatsingh Dev married the widow princess of Bhaktapur Nayak Devi.             The ": null
    },
    {
        "Thakuri": "Thakuri"
    },
    {
        " Dynasty was a ": null
    },
    {
        "Rajput": "Rajput"
    },
    {
        " Dynasty. After Aramudi, who is mentioned in the Kashmirian chronicle, the Rajatarangini of Kalhana , many Thakuri kings ruled over parts of the country up to the middle of the 12th century CE. Raghava Deva is said to have founded a ruling dynasty in 879 CE, when the Lichhavi rule came to an end. To commemorate this important event, Raghu Deva started the Nepal Era which began on 20 October, 879 CE. After Amshuvarma, who ruled from 605 CE onward; the Thakuris had lost power and they could regain it only in 869 CE.       After the death of King Raghava Dev, many Thakuri kings ruled Southern Nepal up to the middle of the 12th century CE. During that period, Gunakama Deva was one of the famous kings. He ruled from 949 to 994 CE. During his rule, a big wooden house was built out of one single tree which was called Kasthamandapa, from which the name of the capital, Kathmandu, is derived. Gunakama Deva founded a town called Kantipur, the modern Kathmandu.   It was also Gunakama Deva who started the Indra Jatra festival. He repaired the temple that lies to the northern part of the temple of Pashupatinath. He introduced Krishna Jatra and Lakhe Jatra as well. He also performed Kotihoma.       Bhola Deva succeeded Gunakama Deva. The next ruler was Laxmikama Deva who ruled from 1024 to 1040 CE. He built Laksmi Vihara and introduced the custom of worshipping a virgin girl as Kumari. Then, Vijayakama Deva, the son of Laksmikama, became the Nepalese king. Vijaykama Deva was the last ruler of this dynasty. He introduced the worship of the Naga and Vasuki . After his death, the Thakuri clan of Nuwakot occupied the throne of Nepal.       Bhaskara Deva, a Thakuri from Nuwakot, succeeded Vijayakama Deva and established Nuwakot-Thakuri rule. He is said to have built Navabahal and Hemavarna Vihara. After Bhaskara Deva, four kings of this line ruled over the country. They were Bala Deva, Padma Deva, Nagarjuna Deva and Shankara Deva.     Shankara Deva was the most illustrious ruler of this dynasty. He established the image of Shantesvara Mahadeva and Manohara Bhagavati. The custom of pasting the pictures of Nagas and Vasuki on the doors of houses on the day of Nagapanchami was introduced by him. During his time, the Buddhists wreaked vengeance on the Hindu Brahmins for the harm they had received earlier from Shankaracharya. Shankara Deva tried to pacify the Brahmins harassed by the Buddhists.       Bama Deva, a descendant of Amshuvarma, defeated Shankar Deva in 1080 CE. He suppressed the Nuwakot-Thankuris with the help of nobles and restored the old Solar Dynasty rule in Nepal for the second time. Harsha Deva, the successor of Bama Deva was a weak ruler. There was no unity among the nobles and they asserted themselves in their respective spheres of influence. Taking that opportunity Nanya Deva, a Karnat dynasty king, attacked Nepal from Simraungarh. In reply Army of Nepal defended, won the battle and successfully protected Nepal from a foreign invasion.       After Harsha Deva, Shivadeva the third ruled from 1099 to 1126 CE. He was a brave and powerful king. He founded the town of Kirtipur and roofed the temple of Pashupatinath with gold. He introduced twenty-five paisa coins. He also constructed wells, canals, and tanks at different places.     After Sivadeva III, Mahendra Deva, Mana Deva, Narendra Deva II, Ananda Deva, Rudra Deva, Amrita Deva, Ratna Deva II, Somesvara Deva, Gunakama Deva II, Lakmikama Deva III and Vijayakama Deva II ruled Nepal in quick succession. Historians differ about the rule of several kings and their respective times. After the fall of the Thakuri dynasty, a new dynasty was founded by Arideva or Ari Malla, popularly known as the Malla Dynasty.          Early ": null
    },
    {
        "Malla": "Malla"
    },
    {
        " rule started with ": null
    },
    {
        "Ari Malla": "Arimalla"
    },
    {
        " in the 12th century. Over the next two centuries, his kingdom expanded widely, into much of the Indian subcontinent and western Tibet, before disintegrating into small principalities, which later became known as the ": null
    },
    {
        "Baise Rajya": "Baise Rajya"
    },
    {
        ".     Jayasthiti Malla, with whom commences the later Malla dynasty of the Kathmandu Valley, began to reign at the end of the 18th century. ": null
    },
    {
        "King Prithvi Narayan Shah": "Prithvi Narayan Shah"
    },
    {
        " captured Kathmandu at the day of Indra Jatra . Malla Dynasty was the Longest ruling dynasty, ruling from the 12th century to the 18th century . This era in the Valley is eminent for the various social and economic reforms such as the ": null
    },
    {
        "Sanskritization": "Sanskritisation"
    },
    {
        " of the Valley people, new methods of land measurement and allocation, etc. In this Era, new Art and Architecture was introduced. The monuments in Kathmandu Valley which are listed by ": null
    },
    {
        "UNESCO": "Unesco"
    },
    {
        " these days were built during Malla rule. In the 14th century, before Kathmandu was divided into 3 princely states, ": null
    },
    {
        "Araniko": "Araniko"
    },
    {
        " went to China upon the request of ": null
    },
    {
        "Abhaya Malla": "Abhaya Malla"
    },
    {
        " for representing the skill of art and architecture, and he introduced Pagoda Style of architecture to China and subsequently, whole Asia. ": null
    },
    {
        "Yaksha Malla": "Jayayakshya Malla"
    },
    {
        ", the grandson of ": null
    },
    {
        "Jayasthiti Malla": "Jayasthitimalla"
    },
    {
        ", ruled the Kathmandu Valley until almost the end of the 15th century. After his demise, the Valley was divided into three independent Valley kingdoms—Kathmandu, Bhaktapur, and Patan—in about 1484 CE. This division led the Malla rulers into internecine clashes and wars for territorial and commercial gains. Mutually debilitating wars gradually weakened them, that facilitated conquest of the Kathmandu Valley by King Prithvi Narayan Shah of Gorkha. The last Malla rulers were ": null
    },
    {
        "Jaya Prakash Malla": "Jaya Prakash Malla"
    },
    {
        ", Teja Narasingha Malla and ": null
    },
    {
        "Ranjit Malla": "Ranajit Malla"
    },
    {
        " of Kathmandu, Patan, and Bhaktapur respectively.             ": null
    },
    {
        "Prithvi Narayan Shah": "Prithvi Narayan Shah"
    },
    {
        " , with whom we move into the modern period of Nepals history, was the ninth generation descendant of ": null
    },
    {
        "Dravya Shah": "Dravya Shah"
    },
    {
        " , the founder of the ruling house of Gorkha. Prithvi Narayan Shah succeeded his father Nara Bhupal Shah to the throne of Gorkha in 1743 CE. King Prithvi Narayan Shah was quite aware of the political situation of the Valley kingdoms as well as of the Baise and Chaubise principalities. He foresaw the need for capturing the small principalities as an urgent condition for survival in the future and set himself to the task accordingly.     His assessment of the situation among the hill principalities was correct, and the principalities were subjugated fairly easily. King Prithvi Narayan Shahs victory march began with the conquest of Nuwakot, which lies between Kathmandu and Gorkha, in 1744. After Nuwakot, he occupied strategic points in the hills surrounding the Kathmandu Valley. The Valleys communications with the outside world were thus cut off. The occupation of the Kuti Pass in about 1756 stopped the Valleys trade with Tibet. Finally, Prithvi Narayan Shah entered the Valley. After the victory of Kirtipur. King Jaya Prakash Malla of Kathmandu sought help from the British and so the than East India Company sent a contingent of soldiers under Captain Kinloch in 1767. The British force was defeated at Sindhuli by King Prithvi Narayan Shahs army. This defeat of the British completely shattered the hopes of King Jaya Prakash Malla. The capture of Kathmandu was very dramatic. As the people of Kathmandu were celebrating the festival of Indrajatra, Prithvi Narayan Shah and his men marched into the city. A throne was put on the palace courtyard for the king of Kathmandu. Prithvi Narayan Shah sat on the throne. Jaya Prakash Malla somehow managed to escape with his life and took asylum in Patan. When Patan was too captured a few weeks later, both Jaya Prakash Malla and the king of Patan;Tej Narsingh Malla took refuge in Bhaktapur, which was also captured after some time. Thus, the Kathmandu Valley was conquered by King Prithvi Narayan Shah and Kathmandu became the capital of the modern Nepal by 1769.      In 1794, troops of Prithivi Narayan Shah has made a complete conquered on Nuwakot which they were commanded by Biraj Thapa, but they were badly defeated, largely because of the following reasons:   Burial of Tulsi river   Lack of arms and ammunition   Lack of trained soldiers   Lack of detailed research and plans     King Prithvi started unifying parts of Baise-Rajya in the Rapti region in around 1760CE. By 1763, Tulsipur-Dang Rajya fell and by 1775 CE, Chauhan Raja Nawal Singh of ": null
    },
    {
        "House of Tulsipur": "House Of Tulsipur"
    },
    {
        " was completely defeated. After losing his northern hill territories to King Prithvi, Chauhan Raja Nawal Singh was forced to move to his southern territories and ruled as one of the largest Taluqdar of Oudh.     King Prithvi Narayan Shah was successful in bringing together diverse religio-ethnic groups under one nation. He was a true nationalist in his outlook and was in favor of adopting a closed-door policy with regard to the British. Not only his social and economic views guided the countrys socio-economic course for a long time, his use of the imagery, a yam between two boulders in Nepals geopolitical context, formed the principal guideline of the countrys foreign policy for future centuries. But in the modern days, this saying is to be modified as a link between two giant countries and Nepal can be able to get benefit from both countries.                 After decades of rivalry between the medieval kingdoms, modern ": null
    },
    {
        "Nepal": "Nepal"
    },
    {
        " was unified in the latter half of the 18th century, when ": null
    },
    {
        "Prithvi Narayan Shah": "Prithvi Narayan Shah"
    },
    {
        ", the ruler of the small principality of Gorkha, formed a unified country from a number of independent hill high states. ": null
    },
    {
        "Prithvi Narayan Shah": "Prithvi Narayan Shah"
    },
    {
        " dedicated himself at an early age to the conquest of the Kathmandu Valley and the creation of a single state, which he achieved in 1768 with the temporary alliance of East India Company which supplied ammunitions to the state of Gorkha.     The country was frequently called the ": null
    },
    {
        "Gorkha Kingdom": "Gorkha Kingdom"
    },
    {
        ". It is a misconception that the Gorkhali took their name from the Gorkha region of Nepal; actually, the region was given its name after the Gorkhali had established their control of these areas.     After Shahs death, the Shah dynasty began to expand their kingdom into much of the Indian subcontinent. Between 1788 and 1791, during the ": null
    },
    {
        "Sino-Nepalese War": "Sino-Nepalese War"
    },
    {
        ", Nepal invaded ": null
    },
    {
        "Tibet": "Tibet"
    },
    {
        " and robbed ": null
    },
    {
        "Tashilhunpo Monastery": "Tashilhunpo Monastery"
    },
    {
        " in ": null
    },
    {
        "Shigatse": "Shigatse"
    },
    {
        ". Alarmed, the ": null
    },
    {
        "Qianlong Emperor": "Qianlong Emperor"
    },
    {
        " of the Chinese ": null
    },
    {
        "Qing Dynasty": "Qing Dynasty"
    },
    {
        " appointed ": null
    },
    {
        "Fukanggan": "Fukanggan"
    },
    {
        " commander-in-chief of the Tibetan campaign; Fukanggan signed treaty to protect his troops thus attaining a draw.  The draw was later converted to victory by Nepali forces sent on commands of PM ": null
    },
    {
        "Jung Bahadur Rana": "Jung Bahadur Rana"
    },
    {
        ".        After 1800, the heirs of Prithvi Narayan Shah proved unable to maintain firm political control over Nepal. A period of internal turmoil followed. Rivalry between Nepal and the ": null
    },
    {
        "British East India Company": "British East India Company"
    },
    {
        " over the princely states bordering Nepal and British-India eventually led to the ": null
    },
    {
        "Anglo-Nepalese War": "Anglo-Nepalese War"
    },
    {
        " , in which Nepali suffered a lot due to lack of guns and ammunitions against advanced British India forces with advanced weapons.The Treaty of Sugauli was signed in 1816, ceding large parts of the Nepalese controlled territories to the British.          ": null
    },
    {
        "Jung Bahadur Rana": "Jung Bahadur Rana"
    },
    {
        " was the first ruler from this dynasty. Rana rulers were titled Shri Teen and Maharaja , whereas Shah kings were Shri Panch and Maharajdiraj . Both the Rana dynasty and Shah dynasty are Rajput caste in the Hindu tradition. Jung Bahadur codified laws and modernized the states bureaucracy. In the coup détat of 1885, the nephews of Jung Bahadur and Ranodip Singh murdered Ranodip Singh and the sons of Jung Bahadur, stole the name of Jung Bahadur and took control of Nepal. Nine Rana rulers took the hereditary office of Prime Minister. All were styled Maharaja of ": null
    },
    {
        "Lamjung": "Lamjung District"
    },
    {
        " and ": null
    },
    {
        "Kaski": "Kaski District"
    },
    {
        ".     The Rana regime, a tightly centralized ": null
    },
    {
        "autocracy": "Autocracy"
    },
    {
        ", pursued a policy of isolating Nepal from external influences. This policy helped Nepal maintain its national independence during the British colonial era, but it also impeded the countrys economic development and modernisation. The Ranas were staunchly pro-British and assisted the British during the ": null
    },
    {
        "Indian Rebellion of 1857": "Indian Rebellion Of 1857"
    },
    {
        " and later in both ": null
    },
    {
        "World Wars": "World War"
    },
    {
        ". At the same time, although Chinese claims, the British supported Nepalese independence at the beginning of the twentieth century.      In December 1923, Britain and Nepal formally signed a treaty of perpetual peace and friendship superseding the Sugauli Treaty of 1816 and upgrading the British resident in Kathmandu to an envoy.     Slavery was abolished in Nepal in 1924 under premiership of ": null
    },
    {
        "Chandra Shamsher Jang Bahadur Rana": "Chandra Shamsher Jang Bahadur Rana"
    },
    {
        ". Tucci, Giuseppe. . Journey to Mustang, 1952. Trans. by Diana Fussell. 1st Italian edition, 1953; 1st English edition, 1977. 2nd edition revised, 2003, p. 22. Bibliotheca Himalayica.  ; 974-524-024-9 .     Following the ": null
    },
    {
        "German invasion of Poland": "German Invasion Of Poland"
    },
    {
        ", the Kingdom of Nepal ": null
    },
    {
        "declared war on Germany": "Nepal In World War Ii"
    },
    {
        " on September 4, 1939. Once Japan entered the conflict, sixteen battalions of the ": null
    },
    {
        "Royal Nepalese Army": "Royal Nepalese Army"
    },
    {
        " fought on the ": null
    },
    {
        "Burmese front": "Burma Campaign"
    },
    {
        ". In addition to military support, Nepal contributed guns, equipment as well as hundreds of thousand of pounds of tea, sugar and raw materials such as timber to the Allied war effort.          The ": null
    },
    {
        "revolution of 1951": "Revolution Of 1951"
    },
    {
        " started when dissatisfaction against the family rule of the Ranas had started emerging from among the few educated people, who had studied in various South Asian schools and colleges, and also from within the Ranas, many of whom were marginalized within the ruling Rana hierarchy. Many of these Nepalese in exile had actively taken part in the Indian Independence struggle and wanted to liberate Nepal as well from the autocratic Rana occupation. The political parties such as The Prajaparishad and  Nepali Congress  were already formed in exile by leaders such as B. P. Koirala, Ganesh Man Singh, Subarna Sumsher Rana, ": null
    },
    {
        "Krishna Prasad Bhattarai": "Krishna Prasad Bhattarai"
    },
    {
        ", ": null
    },
    {
        "Girija Prasad Koirala": "Girija Prasad Koirala"
    },
    {
        ", and many other patriotic-minded Nepalis who urged the military and popular political movement in Nepal to overthrow the autocratic Rana Regime. Thus Nepali congress formed a military wing ": null
    },
    {
        "Nepali Congresss Liberation Army": "Nepali Congresss Liberation Army"
    },
    {
        " Among the prominent martyrs to die for the cause, executed at the hands of the Ranas, were Dharma Bhakta Mathema, Shukraraj Shastri, Gangalal Shrestha, and Dasharath Chand who were the members of Praja Parisad. This turmoil culminated in ": null
    },
    {
        "King Tribhuvan": "Tribhuvan Of Nepal"
    },
    {
        ", a direct descendant of Prithvi Narayan Shah, fleeing from his palace prison in 1950, to India, touching off an armed revolt against the Rana administration. This eventually ended in the return of the Shah family to power and the appointment of a non-Rana as prime minister according to a tri-partite agreement signed called Delhi Compromise. A period of quasi-constitutional rule followed, during which the monarch, assisted by the leaders of fledgling political parties, governed the country. During the 1950s, efforts were made to frame a constitution for Nepal that would establish a representative form of government, based on a British model.there was a 10-member cabinent under Prime Minister Mohan Shumsher having 5 members of Rana and 5 of Nepali congress party. This government drafted a constitution called Interim Government Act which was the first constitution of Nepal. But this Government doomed as Ranas and Congressmen were never on good terms. So, on 1 Mangsir 2008 BS, the king formed a new government of 14 ministers. which was also dissolved. later on Sharawan 2009 BS King formed 5 members councillors government which was also failed.       Declaring parliamentary democracy a failure, King Mahendra carried out a royal coup 18 months later, in 1960. He dismissed the elected Koirala government, declared that a partyless system would govern Nepal, and promulgated another new constitution on December 16, 1960.     Subsequently, the elected Prime Minister, Members of Parliament and hundreds of democratic activists were arrested. .     The new constitution established a partyless system of panchayats which King Mahendra considered to be a democratic form of government, closer to Nepalese traditions. As a pyramidal structure, progressing from village assemblies to the Panchayat system constitutionalized the absolute power of the monarchy and kept the King as head of state with sole authority over all governmental institutions, including the Cabinet and the Parliament. One-state-one-language became the national policy in an effort to carry out state unification, uniting various ethnic and regional groups into a singular Nepali nationalist bond. The ": null
    },
    {
        "Gaun Pharka Aviyan": "Back To The Village National Campaign"
    },
    {
        " launched in 1967, was one of the main rural development programs of the Panchayat system.     King Mahendra was succeeded by his 27-year-old son, King ": null
    },
    {
        "Birendra": "Birendra Of Nepal"
    },
    {
        ", in 1972. Amid student demonstrations and anti-regime activities in 1979, King Birendra called for a national referendum to decide on the nature of Nepals government: either the continuation of the panchayat system along with democratic reforms or the establishment of a multiparty system. The referendum was held in May 1980, and the panchayat system won a narrow victory. The king carried out the promised reforms, including selection of the prime minister by the Rastriya Panchayat.       People in rural areas had expected that their interests would be better represented after the adoption of parliamentary democracy in 1990. The ": null
    },
    {
        "Nepali Congress": "Nepali Congress"
    },
    {
        " with the support of Alliance of leftist parties decided to launch a decisive agitational movement, ": null
    },
    {
        "Jana Andolan": "Jana Andolan"
    },
    {
        ", which forced the monarchy to accept constitutional reforms and to establish a multiparty parliament. In May 1991, Nepal held its first parliamentary elections in nearly 50 years. The Nepali Congress won 110 of the 205 seats and formed the first elected government in 32 years.         In 1992, in a situation of economic crisis and chaos, with spiraling prices as a result of the implementation of changes in policy of the new ": null
    },
    {
        "Congress": "Nepali Congress"
    },
    {
        " government, the radical left stepped up their political agitation. A Joint Peoples Agitation Committee was set up by the various groups. The organisers of the Committee were the ": null
    },
    {
        "Samyukta Janamorcha Nepal": "Samyukta Janamorcha Nepal"
    },
    {
        ", the ": null
    },
    {
        "Communist Party of Nepal ": "Communist Party Of Nepal"
    },
    {
        ", ": null
    },
    {
        "Communist Party of Nepal ": "Communist Party Of Nepal"
    },
    {
        ", the ": null
    },
    {
        "Nepal Communist League": "Nepal Communist League"
    },
    {
        " and the ": null
    },
    {
        "Communist Party of Nepal ": "Communist Party Of Nepal"
    },
    {
        ". A ": null
    },
    {
        "general strike": "Hartal"
    },
    {
        " was called for April 6.     Violent incidents began to occur on the evening before the strike. The Joint Peoples Agitation Committee had called for a 30-minute lights out in the capital, and violence erupted outside ": null
    },
    {
        "Bir Hospital": "Bir Hospital"
    },
    {
        " when activists tried to enforce the lights out. At dawn on April 6, clashes between strike activists and police, outside a police station in Pulchok , left two activists dead.     Later in the day, a mass rally of the Agitation Committee at Tundikhel in the capital ": null
    },
    {
        "Kathmandu": "Kathmandu"
    },
    {
        " was attacked by police forces. As a result, riots broke out and the ": null
    },
    {
        "Nepal Telecom": "Nepal Telecom"
    },
    {
        "munications building was set on fire; police opened fire at the crowd, killing several persons. The Human Rights Organisation of Nepal estimated that 14 persons, including several onlookers, had been killed in police firing. Hoftun, Martin, William Raeper and John Whelpton. People, politics and ideology: Democracy and Social Change in Nepal. Kathmandu: Mandala Book Point, 1999. p. 189     When promised land reforms failed to appear, people in some districts started to organize to enact their own land reform and to gain some power over their lives in the face of usurious landlords. However, this movement was repressed by the Nepali government, in Operation Romeo and Operation Kilo Sera II , which took the lives of many of the leading activists of the struggle. As a result, many witnesses to this repression became radicalized.          In March 1997, the ": null
    },
    {
        "Communist Party of Nepal ": "Unified Communist Party Of Nepal"
    },
    {
        " started a bid to replace the ": null
    },
    {
        "parliamentary": "Parliamentary"
    },
    {
        " monarchy with a peoples new democratic republic, through a Maoist revolutionary strategy known as the ": null
    },
    {
        "peoples war": "Peoples War"
    },
    {
        ", which led to the ": null
    },
    {
        "Nepalese Civil War": "Nepalese Civil War"
    },
    {
        ". Led by Dr. ": null
    },
    {
        "Baburam Bhattarai": "Baburam Bhattarai"
    },
    {
        " and ": null
    },
    {
        "Pushpa Kamal Dahal": "Pushpa Kamal Dahal"
    },
    {
        " , the insurgency began in five districts in Nepal: ": null
    },
    {
        "Rolpa": "Rolpa"
    },
    {
        ", ": null
    },
    {
        "Rukum": "Rukum"
    },
    {
        ", ": null
    },
    {
        "Jajarkot": "Jajarkot"
    },
    {
        ", ": null
    },
    {
        "Gorkha": "Gurkha"
    },
    {
        ", and ": null
    },
    {
        "Sindhuli": "Sindhuli"
    },
    {
        ". The Communist Party of Nepal established a provisional peoples government at the district level in several locations.     On June 1, 2001, ": null
    },
    {
        "Prince Dipendra": "Dipendra Of Nepal"
    },
    {
        ", went on a ": null
    },
    {
        "shooting-spree": "Nepalese Royal Massacre"
    },
    {
        ", assassinating 9 members of the royal family, including ": null
    },
    {
        "King Birendra": "Birendra Of Nepal"
    },
    {
        " and ": null
    },
    {
        "Queen Aishwarya": "Aishwarya Of Nepal"
    },
    {
        ", before shooting himself. Due to his survival, he temporarily became king before dying of his wounds, after which ": null
    },
    {
        "Prince Gyanendra": "Gyanendra Of Nepal"
    },
    {
        " inherited the throne, as per tradition. Meanwhile, the rebellion escalated, and in October 2002 the king temporarily deposed the government and took complete control of it. A week later he reappointed another government, but the country was still very unstable.        In the face of unstable governments and a siege on the Kathmandu Valley in August 2004, popular support for the monarchy began to wane. On February 1, 2005, Gyanendra dismissed the entire government and assumed full executive powers, declaring a ": null
    },
    {
        "state of emergency": "State Of Emergency"
    },
    {
        " to quash the revolution. Politicians were placed under ": null
    },
    {
        "house arrest": "House Arrest"
    },
    {
        ", phone and internet lines were cut, and freedom of the press was severely curtailed.     The kings new regime made little progress in his stated aim to suppress the insurgents. Municipal elections in February 2006 were described by the European Union as a backward step for democracy , as the major parties ": null
    },
    {
        "boycotted the election": "Election Boycott"
    },
    {
        " and some candidates were forced to run for office by the army. . Guardian. 2 February 2006. Retrieved on 2012-04-08. In April 2006 ": null
    },
    {
        "strikes and street protests in Kathmandu": "2006 Democracy Movement In Nepal"
    },
    {
        " forced the king to reinstate the parliament. A seven-party coalition resumed control of the government and stripped the king of most of his powers. As of 15 January 2007, Nepal was governed by a ": null
    },
    {
        "unicameral": "Unicameral"
    },
    {
        " legislature under an ": null
    },
    {
        "interim constitution": "Provisional Constitution"
    },
    {
        ". On December 24, 2007, seven parties, including the former Maoist rebels and the ruling party, agreed to abolish the monarchy and declare Nepal the Federal Republic. . CNN. 28 December 2007 In the elections held on 10 April 2008, the Maoists secured a simple majority, with the prospect of forming a government to rule the proposed Republic of Nepal.       On May 28, 2008, the newly-elected ": null
    },
    {
        "Constituent Assembly": "1St Nepalese Constituent Assembly"
    },
    {
        " declared Nepal the Federal Democratic Republic, abolishing the 240-year-old monarchy. The motion for the abolition of the monarchy was carried by a huge majority: out of 564 members present in the assembly, 560 voted for the motion while 4 members voted against it.  . Nepalnews.com. 28 May 2008. Retrieved on 2012-04-08. On June 11, 2008, ex-King Gyanendra left the palace. . nepalnews.com. 11 June 2008 ": null
    },
    {
        "Ram Baran Yadav": "Ram Baran Yadav"
    },
    {
        " of the Nepali Congress became the first ": null
    },
    {
        "President of the Federal Democratic Republic of Nepal": "President Of Nepal"
    },
    {
        " on July 23, 2008. Similarly, the Constituent Assembly elected Pushpa Kamal Dahal  of the ": null
    },
    {
        "Unified Communist Party of Nepal ": "Unified Communist Party Of Nepal"
    },
    {
        " as the first Republican ": null
    },
    {
        "Prime Minister": "List Of Prime Ministers Of Nepal"
    },
    {
        " on August 15, 2008, favoring him over ": null
    },
    {
        "Sher Bahadur Deuba": "Sher Bahadur Deuba"
    },
    {
        " of the ": null
    },
    {
        "Nepali Congress": "Nepali Congress"
    },
    {
        " Party.     After failing to draft a constitution before the deadline, the existing Constituent Assembly was dissolved and a new interim government formed under the Prime-Ministership of the ": null
    },
    {
        "Chief Justice of Nepal": "Chief Justice Of Nepal"
    },
    {
        ", ": null
    },
    {
        "Supreme Court": "Supreme Court Of Nepal"
    },
    {
        " judge ": null
    },
    {
        "Khil Raj Regmi": "Khil Raj Regmi"
    },
    {
        ". In the ": null
    },
    {
        "Constituent Assembly election": "2013 Nepalese Constituent Assembly Election"
    },
    {
        " of November 2013 the Nepali Congress won the largest share of the votes but failed to get a majority. The ": null
    },
    {
        "Communist Party of Nepal ": "Communist Party Of Nepal"
    },
    {
        " and the Nepali Congress negotiated to form a consensus government, and ": null
    },
    {
        "Sushil Koirala": "Sushil Koirala"
    },
    {
        " of the Nepali Congress was elected as Prime Minister with support from the CPN .         Minority ethnic groups like ": null
    },
    {
        "Madhesi": "Madhesi People"
    },
    {
        " and ": null
    },
    {
        "Tharu": "Tharu People"
    },
    {
        " have protested vigorously against the constitution which came into effect on September 20, 2015.  They point out that their concerns have not been addressed and there are few explicit protections for their ethnic groups in the document. At least 56 civilians and 11 police died in clashes over the draft constitution.  In response to the Madhesi protests, India suspended vital supplies to landlocked Nepal, citing insecurity and violence in border areas.    It has been alleged that Indias denial of petroleum and medicine to Nepal constituted a violation of human rights.  Then Prime Minister of Nepal, ": null
    },
    {
        "Oli": "Khadga Prasad Oli"
    },
    {
        ", publicly accused India for the Blockade calling the act more inhuman than war.  India has denied enacting the blockade. ": null
    }
]