[
    {
        "                 The history of science is the study of the development of ": null
    },
    {
        "science": "Science"
    },
    {
        " and scientific knowledge, including both the ": null
    },
    {
        "natural": "Natural Science"
    },
    {
        " and ": null
    },
    {
        "social sciences": "Social Science"
    },
    {
        " . Science is a body of ": null
    },
    {
        "empirical": "Empirical Knowledge"
    },
    {
        ", ": null
    },
    {
        "theoretical": "Theory"
    },
    {
        ", and ": null
    },
    {
        "practical": "Procedural Knowledge"
    },
    {
        " knowledge": "Knowledge"
    },
    {
        " about the ": null
    },
    {
        "natural world": "Nature"
    },
    {
        ", produced by scientists who emphasize the observation, ": null
    },
    {
        "explanation": "Scientific Explanation"
    },
    {
        ", and prediction of real-world ": null
    },
    {
        "phenomena": "Phenomenon"
    },
    {
        ". ": null
    },
    {
        "Historiography of science": "Historiography Of Science"
    },
    {
        ", in contrast, studies the methods employed by historians of science.     The English word scientist is relatively recent, first coined by ": null
    },
    {
        "William Whewell": "William Whewell"
    },
    {
        " in the 19th century.  Before that, investigators of nature called themselves ": null
    },
    {
        "natural philosophers": "Natural Philosophers"
    },
    {
        " . While ": null
    },
    {
        "observations": "Discovery"
    },
    {
        " of the natural world have been described since ": null
    },
    {
        "classical antiquity": "Classical Antiquity"
    },
    {
        " , and the ": null
    },
    {
        "scientific method": "Scientific Method"
    },
    {
        " has been employed since the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        " , modern science began to develop in the ": null
    },
    {
        "early modern period": "Early Modern Period"
    },
    {
        ", and in particular in the ": null
    },
    {
        "scientific revolution": "Scientific Revolution"
    },
    {
        " of 16th- and 17th-century Europe.  Traditionally, historians of science have defined science sufficiently broadly to include those earlier inquiries. For our purpose, science may be defined as ordered knowledge of natural phenomena and of the relations between them. ": null
    },
    {
        "William C. Dampier-Whetham": "William Cecil Dampier"
    },
    {
        ", Science , in Encyclopædia Britannica, 11th ed. ; Science comprises, first, the orderly and systematic comprehension, description and/or explanation of natural phenomena and, secondly, the tools necessary for the undertaking. ": null
    },
    {
        "Marshall Clagett": "Marshall Clagett"
    },
    {
        ", Greek Science in Antiquity ; Science is a systematic explanation of perceived or imaginary phenomena, or else is based on such an explanation. Mathematics finds a place in science only as one of the symbolical languages in which scientific explanations may be expressed. ": null
    },
    {
        "David Pingree": "David Pingree"
    },
    {
        ", Hellenophilia versus the History of Science , Isis 83, 559 ; ": null
    },
    {
        "Pat Munday": "Pat Munday"
    },
    {
        ", entry History of Science , New Dictionary of the History of Ideas .     From the 18th through the late 20th century, the history of science, especially of the physical and biological sciences, was often presented as a progressive accumulation of knowledge, in which true theories replaced false beliefs.  More recent historical interpretations, such as those of ": null
    },
    {
        "Thomas Kuhn": "Thomas Kuhn"
    },
    {
        ", tend to portray the history of science in terms of competing paradigms or conceptual systems within a wider matrix of intellectual, cultural, economic and political trends. These interpretations, however, have met with opposition for they also portray the history of science as an incoherent system of incommensurable paradigms, not leading to any actual scientific progress but only to the illusion that it has occurred. Kuhn, T., 1962, The Structure of Scientific Revolutions , University of Chicago Press, p. 137: Partly by selection and partly by distortion, the scientists of earlier ages are implicitly presented as having worked upon the same set of fixed problems and in accordance with the same set of fixed canons that the most recent revolution in scientific theory and method made seem scientific.               In ": null
    },
    {
        "prehistoric": "Prehistory"
    },
    {
        " times, knowledge and technique were passed from generation to generation in an ": null
    },
    {
        "oral tradition": "Oral Tradition"
    },
    {
        ". For example, the domestication of maize for agriculture has been dated to about 9,000 years ago in southern Mexico, before the development of ": null
    },
    {
        "writing systems": "Writing System"
    },
    {
        ".  . Francesca Bray ,  Science and Civilisation in China  VI.2 Agriculture pp 299, 453 writes that ": null
    },
    {
        "teosinte": "Teosinte"
    },
    {
        ", the father of corn, helps the success and vitality of corn when planted between the rows of its children, ": null
    },
    {
        "maize": "Maize"
    },
    {
        ". Similarly, archaeological evidence indicates the development of astronomical knowledge in preliterate societies.   The development of writing enabled humans to store and communicate knowledge across generations with much greater accuracy.     Many ancient civilizations systematically collected astronomical observations. Rather than speculating on the material nature of the planets and stars, the ancients charted the relative positions of celestial bodies, often inferring their influence on human individual and humankind. This demonstrates how ancient investigators generally employed a holistic intuition, assuming the interconnectedness of all things, whereas modern science rejects such conceptual leaps.     Basic facts about ": null
    },
    {
        "human physiology": "Human Body"
    },
    {
        " were known in some places, and ": null
    },
    {
        "alchemy": "Alchemy"
    },
    {
        " was practiced in several ": null
    },
    {
        "civilizations": "Civilization"
    },
    {
        ". See Homers Odyssey  are of the race of ": null
    },
    {
        "Paeeon": "Paean"
    },
    {
        " See, for example ": null
    },
    {
        "Joseph Needham": "Joseph Needham"
    },
    {
        " and his co-authors,  Science and Civilisation in China , V, Cambridge University Press, specifically:   Joseph Needham and Lu Gwei-djen , V.2 Spagyrical Discovery and Invention: Magisteries of Gold and Immortality V.3 Spagyrical Discovery and Invention: Historical Survey, from Cinnabar Elixirs to Synthetic Insulin V.4 Spagyrical Discovery and Invention: Apparatus and Theory V.5 Spagyrical Discovery and Invention: Physiological Alchemy Considerable observation of ": null
    },
    {
        "macroscopic": "Macroscopic"
    },
    {
        " flora": "Flora"
    },
    {
        " and ": null
    },
    {
        "fauna": "Fauna"
    },
    {
        " was also performed.               The ancient Mesopotamians had no distinction between rational science and ": null
    },
    {
        "magic": "Magic"
    },
    {
        ".        When a person became ill, doctors prescribed magical formulas to be recited as well as medicinal treatments.  The earliest medical prescriptions appear in ": null
    },
    {
        "Sumerian": "Sumerian Language"
    },
    {
        " during the ": null
    },
    {
        "Third Dynasty of Ur": "Third Dynasty Of Ur"
    },
    {
        " .  The most extensive Babylonian medical text, however, is the Diagnostic Handbook written by the ummânū, or chief scholar, ": null
    },
    {
        "Esagil-kin-apli": "Esagil-Kin-Apli"
    },
    {
        " of ": null
    },
    {
        "Borsippa": "Borsippa"
    },
    {
        ",  during the reign of the Babylonian king ": null
    },
    {
        "Adad-apla-iddina": "Adad-Apla-Iddina"
    },
    {
        " . Marten Stol , Epilepsy in Babylonia, p. 55, ": null
    },
    {
        "Brill Publishers": "Brill Publishers"
    },
    {
        ", . In ": null
    },
    {
        "East Semitic": "East Semitic"
    },
    {
        " cultures, the main medicinal authority was a kind of exorcist-healer known as an  āšipu . The profession was generally passed down from father to son and was held in extremely high regard. Of less frequent recourse was another kind of healer known as an asu, who corresponds more closely to a modern physician and treated physical symptoms using primarily ": null
    },
    {
        "folk remedies": "Folk Remedies"
    },
    {
        " composed of various herbs, animal products, and minerals, as well as potions, enemas, and ointments or ": null
    },
    {
        "poultices": "Poultices"
    },
    {
        ". These physicians, who could be either male or female, also dressed wounds, set limbs, and performed simple surgeries. The ancient Mesopotamians also practiced ": null
    },
    {
        "prophylaxis": "Prophylaxis"
    },
    {
        " and took measures to prevent the spread of disease.     The ancient Mesopotamians had extensive knowledge about the chemical properties of clay, sand, metal ore, ": null
    },
    {
        "bitumen": "Bitumen"
    },
    {
        ", stone, and other natural materials, and applied this knowledge to practical use in manufacturing ": null
    },
    {
        "pottery": "Pottery"
    },
    {
        ", ": null
    },
    {
        "faience": "Faience"
    },
    {
        ", glass, soap, metals, ": null
    },
    {
        "lime plaster": "Lime Plaster"
    },
    {
        ", and waterproofing. ": null
    },
    {
        "Metallurgy": "Metallurgy"
    },
    {
        " required scientific knowledge about the properties of metals. Nonetheless, the Mesopotamians seem to have had little interest in gathering information about the natural world for the mere sake of gathering information and were far more interested in studying the manner in which the gods had ordered the universe. Biology of non-human organisms was generally only written about in the context of mainstream academic disciplines. ": null
    },
    {
        "Animal physiology": "Animal Physiology"
    },
    {
        " was studied extensively for the purpose of ": null
    },
    {
        "divination": "Divination"
    },
    {
        "; the anatomy of the ": null
    },
    {
        "liver": "Liver"
    },
    {
        ", which was seen as an important organ in ": null
    },
    {
        "haruspicy": "Haruspicy"
    },
    {
        ", was studied in particularly intensive detail. ": null
    },
    {
        "Animal behavior": "Animal Behavior"
    },
    {
        " was also studied for divinatory purposes. Most information about the training and domestication of animals was probably transmitted orally without being written down, but one text dealing with the training of horses has survived. The Mesopotamian cuneiform tablet ": null
    },
    {
        "Plimpton 322": "Plimpton 322"
    },
    {
        ", dating to the eighteenth century BC, records a number of ": null
    },
    {
        "Pythagorean triple": "Pythagorean Triple"
    },
    {
        "ts ..., ": null
    },
    {
        "Paul Hoffman": "Paul Hoffman"
    },
    {
        ", The man who loved only numbers: the story of Paul Erdös and the search for mathematical truth, , 1998, p. 187.  hinting that the ancient Mesopotamians might have been aware of the ": null
    },
    {
        "Pythagorean theorem": "Pythagorean Theorem"
    },
    {
        " over a millennium before Pythagoras.             In ": null
    },
    {
        "Babylonian astronomy": "Babylonian Astronomy"
    },
    {
        ", records of the motions of the ": null
    },
    {
        "stars": "Star"
    },
    {
        ", ": null
    },
    {
        "planets": "Planet"
    },
    {
        ", and the ": null
    },
    {
        "moon": "Moon"
    },
    {
        " are left on thousands of ": null
    },
    {
        "clay tablets": "Clay Tablet"
    },
    {
        " created by ": null
    },
    {
        "scribes": "Scribe"
    },
    {
        ". Even today, astronomical periods identified by Mesopotamian proto-scientists are still widely used in Western calendars such as the ": null
    },
    {
        "solar year": "Solar Year"
    },
    {
        " and the ": null
    },
    {
        "lunar month": "Lunar Month"
    },
    {
        ". Using these data they developed arithmetical methods to compute the changing length of daylight in the course of the year and to predict the appearances and disappearances of the Moon and planets and eclipses of the Sun and Moon. Only a few astronomers names are known, such as that of ": null
    },
    {
        "Kidinnu": "Kidinnu"
    },
    {
        ", a ": null
    },
    {
        "Chaldean": "Chaldean Dynasty"
    },
    {
        " astronomer and mathematician. Kiddinus value for the solar year is in use for todays calendars. Babylonian astronomy was the first and highly successful attempt at giving a refined mathematical description of astronomical phenomena. According to the historian A. Aaboe, all subsequent varieties of scientific astronomy, in the Hellenistic world, in India, in Islam, and in the West—if not indeed all subsequent endeavour in the exact sciences—depend upon Babylonian astronomy in decisive and fundamental ways.           ": null
    },
    {
        "Ancient Egypt": "Ancient Egypt"
    },
    {
        " made significant advances in astronomy, mathematics and medicine.  Their development of ": null
    },
    {
        "geometry": "Geometry"
    },
    {
        " was a necessary outgrowth of ": null
    },
    {
        "surveying": "Surveying"
    },
    {
        " to preserve the layout and ownership of farmland, which was flooded annually by the ": null
    },
    {
        "Nile river": "Nile River"
    },
    {
        ". The 3-4-5 ": null
    },
    {
        "right triangle": "Right Triangle"
    },
    {
        " and other rules of geometry were used to build rectilinear structures, and the post and lintel architecture of Egypt. Egypt was also a center of ": null
    },
    {
        "alchemy": "History Of Alchemy"
    },
    {
        " research for much of the ": null
    },
    {
        "Mediterranean": "Mediterranean Basin"
    },
    {
        ". The ": null
    },
    {
        "Edwin Smith papyrus": "Edwin Smith Papyrus"
    },
    {
        " is one of the first medical documents still extant, and perhaps the earliest document that attempts to describe and analyse the brain: it might be seen as the very beginnings of modern ": null
    },
    {
        "neuroscience": "Neuroscience"
    },
    {
        ". However, while ": null
    },
    {
        "Egyptian medicine": "Egyptian Medicine"
    },
    {
        " had some effective practices, it was often ineffective and sometimes harmful. Medical historians believe that ancient Egyptian pharmacology, for example, was largely ineffective.       Nevertheless, it applied the following components to the treatment of disease: examination, diagnosis, treatment, and prognosis,  which display strong parallels to the basic ": null
    },
    {
        "empirical method": "Empirical Method"
    },
    {
        " of science and, according to G.E.R. Lloyd, Lloyd, G.E.R. The development of empirical research , in his Magic, Reason and Experience: Studies in the Origin and Development of Greek Science. played a significant role in the development of this methodology. The ": null
    },
    {
        "Ebers papyrus": "Ebers Papyrus"
    },
    {
        " also contains evidence of traditional ": null
    },
    {
        "empiricism": "Empiricism"
    },
    {
        ".               In ": null
    },
    {
        "Classical Antiquity": "Classical Antiquity"
    },
    {
        ", the inquiry into the workings of the universe took place both in investigations aimed at such practical goals as establishing a reliable calendar or determining how to cure a variety of illnesses and in those abstract investigations known as ": null
    },
    {
        "natural philosophy": "Natural Philosophy"
    },
    {
        ". The ancient people who are considered the first  scientists  may have thought of themselves as natural philosophers, as practitioners of a skilled profession , or as followers of a religious tradition .     The earliest Greek philosophers, known as the ": null
    },
    {
        "pre-Socratics": "Pre-Socratics"
    },
    {
        ",  called the pre-Socratics the transition from  mythos  to  logos  provided competing answers to the question found in the myths of their neighbors: How did the ordered ": null
    },
    {
        "cosmos": "Cosmos"
    },
    {
        " in which we live come to be? ": null
    },
    {
        "F.M. Cornford": "F.M. Cornford"
    },
    {
        ", Principium Sapientiae: The Origins of Greek Philosophical Thought, , p. 159. The pre-Socratic philosopher ": null
    },
    {
        "Thales": "Thales"
    },
    {
        " , dubbed the father of science , was the first to postulate non-supernatural explanations for natural phenomena. For example, that land floats on water and that earthquakes are caused by the agitation of the water upon which the land floats, rather than the god Poseidon. Arieti, James A. Philosophy in the ancient world: an introduction, p. 45 . Rowman & Littlefield, 2005. 386 pp. . Thales student ": null
    },
    {
        "Pythagoras": "Pythagoras"
    },
    {
        " of ": null
    },
    {
        "Samos": "Samos"
    },
    {
        " founded the ": null
    },
    {
        "Pythagorean school": "Pythagoreanism"
    },
    {
        ", which investigated mathematics for its own sake, and was the first to postulate that the Earth is spherical in shape.  ": null
    },
    {
        "Leucippus": "Leucippus"
    },
    {
        " introduced ": null
    },
    {
        "atomism": "Atomism"
    },
    {
        ", the theory that all matter is made of indivisible, imperishable units called ": null
    },
    {
        "atoms": "Atoms"
    },
    {
        ". This was greatly expanded on by his pupil ": null
    },
    {
        "Democritus": "Democritus"
    },
    {
        " and later ": null
    },
    {
        "Epicurus": "Epicurus"
    },
    {
        ".     Subsequently, ": null
    },
    {
        "Plato": "Plato"
    },
    {
        " and ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        " produced the first systematic discussions of natural philosophy, which did much to shape later investigations of nature. Their development of ": null
    },
    {
        "deductive reasoning": "Deductive Reasoning"
    },
    {
        " was of particular importance and usefulness to later scientific inquiry. Plato founded the ": null
    },
    {
        "Platonic Academy": "Platonic Academy"
    },
    {
        " in 387 BC, whose motto was Let none unversed in geometry enter here , and turned out many notable philosophers. Platos student Aristotle introduced ": null
    },
    {
        "empiricism": "Empiricism"
    },
    {
        " and the notion that universal truths can be arrived at via observation and induction, thereby laying the foundations of the scientific method.  Aristotle also produced ": null
    },
    {
        "many biological writings": "Aristotles Biology"
    },
    {
        " that were empirical in nature, focusing on biological causation and the diversity of life. He made countless observations of nature, especially the habits and attributes of plants and animals on ": null
    },
    {
        "Lesbos": "Lesbos"
    },
    {
        ", classified more than 540 animal species, and dissected at least 50.  Aristotles writings profoundly influenced subsequent ": null
    },
    {
        "Islamic": "Science In Medieval Islam"
    },
    {
        " and ": null
    },
    {
        "European": "Science In Medieval Western Europe"
    },
    {
        " scholarship, though they were eventually superseded in the ": null
    },
    {
        "Scientific Revolution": "Scientific Revolution"
    },
    {
        ".            The important legacy of this period included substantial advances in factual knowledge, especially in ": null
    },
    {
        "anatomy": "Anatomy"
    },
    {
        ", ": null
    },
    {
        "zoology": "Zoology"
    },
    {
        ", ": null
    },
    {
        "botany": "Botany"
    },
    {
        ", ": null
    },
    {
        "mineralogy": "Mineralogy"
    },
    {
        ", ": null
    },
    {
        "geography": "Geography"
    },
    {
        ", ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " and ": null
    },
    {
        "astronomy": "Astronomy"
    },
    {
        "; an awareness of the importance of certain scientific problems, especially those related to the problem of change and its causes; and a recognition of the methodological importance of applying mathematics to natural phenomena and of undertaking empirical research. ": null
    },
    {
        "G.E.R. Lloyd": "G.E.R. Lloyd"
    },
    {
        ", Early Greek Science: Thales to Aristotle, , pp. 144–146. In the ": null
    },
    {
        "Hellenistic age": "Hellenistic Age"
    },
    {
        " scholars frequently employed the principles developed in earlier Greek thought: the application of ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " and deliberate empirical research, in their scientific investigations. Lloyd , p. 177. Thus, clear unbroken lines of influence lead from ancient ": null
    },
    {
        "Greek": "Ancient Greece"
    },
    {
        " and ": null
    },
    {
        "Hellenistic philosophers": "Hellenistic Philosophy"
    },
    {
        ", to medieval ": null
    },
    {
        "Muslim philosophers": "Early Islamic Philosophy"
    },
    {
        " and ": null
    },
    {
        "scientists": "Islamic Science"
    },
    {
        ", to the European ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        " and ": null
    },
    {
        "Enlightenment": "Age Of Enlightenment"
    },
    {
        ", to the secular ": null
    },
    {
        "sciences": "Science"
    },
    {
        " of the modern day.   Neither reason nor inquiry began with the Ancient Greeks, but the ": null
    },
    {
        "Socratic method": "Socratic Method"
    },
    {
        " did, along with the idea of ": null
    },
    {
        "Forms": "Substantial Form"
    },
    {
        ", great advances in ": null
    },
    {
        "geometry": "Geometry"
    },
    {
        ", ": null
    },
    {
        "logic": "Logic"
    },
    {
        ", and the natural sciences. According to ": null
    },
    {
        "Benjamin Farrington": "Benjamin Farrington"
    },
    {
        ", former Professor of ": null
    },
    {
        "Classics": "Classics"
    },
    {
        " at ": null
    },
    {
        "Swansea University": "Swansea University"
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        " worked out the laws of equilibrium; they must have had practical and intuitional knowledge of the principles involved. What Archimedes did was to sort out the theoretical implications of this practical knowledge and present the resulting body of knowledge as a logically coherent system.     and again:     : With astonishment we find ourselves on the threshold of modern science. Nor should it be supposed that by some trick of translation the extracts have been given an air of modernity. Far from it. The vocabulary of these writings and their style are the source from which our own vocabulary and style have been derived. Greek Science, many editions, such as the paperback by Penguin Books. Copyrights in 1944, 1949, 1953, 1961, 1963. The first quote above comes from Part 1, Chapter 1; the second, from Part 2, Chapter 4.          The astronomer ": null
    },
    {
        "Aristarchus of Samos": "Aristarchus Of Samos"
    },
    {
        " was the first known person to propose a heliocentric model of the solar system, while the geographer ": null
    },
    {
        "Eratosthenes": "Eratosthenes"
    },
    {
        " accurately calculated the circumference of the Earth. ": null
    },
    {
        "Hipparchus": "Hipparchus"
    },
    {
        " produced the first systematic ": null
    },
    {
        "star catalog": "Timeline Of Astronomical Maps, Catalogs, And Surveys"
    },
    {
        ". The level of achievement in Hellenistic ": null
    },
    {
        "astronomy": "Astronomy"
    },
    {
        " and ": null
    },
    {
        "engineering": "Engineering"
    },
    {
        " is impressively shown by the ": null
    },
    {
        "Antikythera mechanism": "Antikythera Mechanism"
    },
    {
        " , an ": null
    },
    {
        "analog computer": "Analog Computer"
    },
    {
        " for calculating the position of planets. Technological artifacts of similar complexity did not reappear until the 14th century, when mechanical ": null
    },
    {
        "astronomical clocks": "Astronomical Clock"
    },
    {
        " appeared in Europe.      In ": null
    },
    {
        "medicine": "Medicine"
    },
    {
        ", ": null
    },
    {
        "Hippocrates": "Hippocrates"
    },
    {
        " and his followers were the first to describe many diseases and medical conditions and developed the ": null
    },
    {
        "Hippocratic Oath": "Hippocratic Oath"
    },
    {
        " for physicians, still relevant and in use today. ": null
    },
    {
        "Herophilos": "Herophilos"
    },
    {
        " was the first to base his conclusions on dissection of the human body and to describe the ": null
    },
    {
        "nervous system": "Nervous System"
    },
    {
        ". ": null
    },
    {
        "Galen": "Galen"
    },
    {
        " performed many audacious operations—including brain and eye ": null
    },
    {
        "surgeries": "Surgery"
    },
    {
        "— that were not tried again for almost two millennia.          In ": null
    },
    {
        "Hellenistic Egypt": "Ptolemaic Kingdom"
    },
    {
        ", the mathematician ": null
    },
    {
        "Euclid": "Euclid"
    },
    {
        " laid down the foundations of ": null
    },
    {
        "mathematical rigor": "Mathematical Rigor"
    },
    {
        " and introduced the concepts of definition, axiom, theorem and proof still in use today in his ": null
    },
    {
        "Elements": "Euclids Elements"
    },
    {
        ", considered the most influential textbook ever written.  ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        ", considered one of the greatest mathematicians of all time,  is credited with using the ": null
    },
    {
        "method of exhaustion": "Method Of Exhaustion"
    },
    {
        " to calculate the ": null
    },
    {
        "area": "Area"
    },
    {
        " under the arc of a ": null
    },
    {
        "parabola": "Parabola"
    },
    {
        " with the ": null
    },
    {
        "summation of an infinite series": "Series"
    },
    {
        ", and gave a remarkably accurate approximation of ": null
    },
    {
        "Pi": "Pi"
    },
    {
        ".  He is also known in ": null
    },
    {
        "physics": "Physics"
    },
    {
        " for laying the foundations of ": null
    },
    {
        "hydrostatics": "Fluid Statics"
    },
    {
        ", ": null
    },
    {
        "statics": "Statics"
    },
    {
        ", and the explanation of the principle of the ": null
    },
    {
        "lever": "Lever"
    },
    {
        ".     ": null
    },
    {
        "Theophrastus": "Theophrastus"
    },
    {
        " wrote some of the earliest descriptions of plants and animals, establishing the first ": null
    },
    {
        "taxonomy": "Taxonomy"
    },
    {
        " and looking at minerals in terms of their properties such as ": null
    },
    {
        "hardness": "Hardness"
    },
    {
        ". ": null
    },
    {
        "Pliny the Elder": "Pliny The Elder"
    },
    {
        " produced what is one of the largest ": null
    },
    {
        "encyclopedias": "Encyclopedia"
    },
    {
        " of the natural world in 77 AD, and must be regarded as the rightful successor to Theophrastus. For example, he accurately describes the ": null
    },
    {
        "octahedral": "Octahedral"
    },
    {
        " shape of the ": null
    },
    {
        "diamond": "Diamond"
    },
    {
        ", and proceeds to mention that diamond dust is used by ": null
    },
    {
        "engravers": "Engraver"
    },
    {
        " to cut and polish other gems owing to its great hardness. His recognition of the importance of ": null
    },
    {
        "crystal": "Crystal"
    },
    {
        " shape is a precursor to modern ": null
    },
    {
        "crystallography": "Crystallography"
    },
    {
        ", while mention of numerous other minerals presages ": null
    },
    {
        "mineralogy": "Mineralogy"
    },
    {
        ". He also recognises that other minerals have characteristic crystal shapes, but in one example, confuses the ": null
    },
    {
        "crystal habit": "Crystal Habit"
    },
    {
        " with the work of ": null
    },
    {
        "lapidaries": "Lapidaries"
    },
    {
        ". He was also the first to recognise that ": null
    },
    {
        "amber": "Amber"
    },
    {
        " was a fossilized resin from pine trees because he had seen samples with trapped insects within them.               Mathematics: The earliest traces of mathematical knowledge in the Indian subcontinent appear with the ": null
    },
    {
        "Indus Valley Civilization": "Indus Valley Civilization"
    },
    {
        " . The people of this civilization made bricks whose dimensions were in the proportion 4:2:1, considered favorable for the stability of a brick structure.  They also tried to standardize measurement of length to a high degree of accuracy. They designed a ruler—the Mohenjo-daro ruler—whose unit of length was divided into ten equal parts. Bricks manufactured in ancient Mohenjo-daro often had dimensions that were integral multiples of this unit of length.      Indian astronomer and mathematician ": null
    },
    {
        "Aryabhata": "Aryabhata"
    },
    {
        " , in his  Aryabhatiya  introduced a number of ": null
    },
    {
        "trigonometric functions": "Trigonometric Functions"
    },
    {
        " , ": null
    },
    {
        "trigonometric": "Trigonometry"
    },
    {
        " tables": "Aryabhatas Sine Table"
    },
    {
        ", and techniques and ": null
    },
    {
        "algorithms": "Algorithm"
    },
    {
        " of ": null
    },
    {
        "algebra": "Algebra"
    },
    {
        ". In 628 AD, ": null
    },
    {
        "Brahmagupta": "Brahmagupta"
    },
    {
        " suggested that ": null
    },
    {
        "gravity": "Gravity"
    },
    {
        " was a force of attraction.  Mainak Kumar Bose, Late Classical India, A. Mukherjee & Co., 1988, p. 277. He also lucidly explained the use of ": null
    },
    {
        "zero": "0"
    },
    {
        " as both a placeholder and a ": null
    },
    {
        "decimal digit": "Decimal Digit"
    },
    {
        ", along with the ": null
    },
    {
        "Hindu-Arabic numeral system": "Hindu-Arabic Numeral System"
    },
    {
        " now used universally throughout the world. ": null
    },
    {
        "Arabic": "Arabic"
    },
    {
        " translations of the two astronomers texts were soon available in the ": null
    },
    {
        "Islamic world": "Caliph"
    },
    {
        ", introducing what would become ": null
    },
    {
        "Arabic numerals": "Arabic Numerals"
    },
    {
        " to the Islamic world by the 9th century. Ifrah, Georges. 1999. The Universal History of Numbers : From Prehistory to the Invention of the Computer, Wiley. . OConnor, J.J. and E.F. Robertson. 2000. , MacTutor History of Mathematics Archive, School of Mathematics and Statistics, University of St. Andrews, Scotland. During the 14th–16th centuries, the ": null
    },
    {
        "Kerala school of astronomy and mathematics": "Kerala School Of Astronomy And Mathematics"
    },
    {
        " made significant advances in astronomy and especially mathematics, including fields such as ": null
    },
    {
        "trigonometry": "Trigonometry"
    },
    {
        " and ": null
    },
    {
        "analysis": "Mathematical Analysis"
    },
    {
        ". In particular, ": null
    },
    {
        "Madhava of Sangamagrama": "Madhava Of Sangamagrama"
    },
    {
        " is considered the founder of ": null
    },
    {
        "mathematical analysis": "Mathematical Analysis"
    },
    {
        " . George G. Joseph . The crest of the peacock. London.     Astronomy: The first textual mention of astronomical concepts comes from the ": null
    },
    {
        "Vedas": "Veda"
    },
    {
        ", religious literature of India.  According to Sarma : One finds in the ": null
    },
    {
        "Rigveda": "Rigveda"
    },
    {
        " intelligent speculations about the genesis of the universe from nonexistence, the configuration of the universe, the ": null
    },
    {
        "spherical self-supporting earth": "Spherical Earth"
    },
    {
        ", and the year of 360 days divided into 12 equal parts of 30 days each with a periodical intercalary month. . The first 12 chapters of the Siddhanta Shiromani, written by ": null
    },
    {
        "Bhāskara": "Bhāskara Ii"
    },
    {
        " in the 12th century, cover topics such as: mean longitudes of the planets; true longitudes of the planets; the three problems of diurnal rotation; syzygies; lunar eclipses; solar eclipses; latitudes of the planets; risings and settings; the moons crescent; conjunctions of the planets with each other; conjunctions of the planets with the fixed stars; and the patas of the sun and moon. The 13 chapters of the second part cover the nature of the sphere, as well as significant astronomical and trigonometric calculations based on it.     ": null
    },
    {
        "Nilakantha Somayajis": "Nilakantha Somayaji"
    },
    {
        " astronomical treatise the ": null
    },
    {
        "Tantrasangraha": "Tantrasangraha"
    },
    {
        " similar in nature to the ": null
    },
    {
        "Tychonic system": "Tychonic System"
    },
    {
        " proposed by ": null
    },
    {
        "Tycho Brahe": "Tycho Brahe"
    },
    {
        " had been the most accurate astronomical model until the time of ": null
    },
    {
        "Johannes Kepler": "Johannes Kepler"
    },
    {
        " in the 17th century. George G. Joseph . The Crest of the Peacock: Non-European Roots of Mathematics, p. 408. ": null
    },
    {
        "Princeton University Press": "Princeton University Press"
    },
    {
        ".     Linguistics: Some of the earliest linguistic activities can be found in ": null
    },
    {
        "Iron Age India": "Iron Age India"
    },
    {
        " with the analysis of ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " for the purpose of the correct recitation and interpretation of ": null
    },
    {
        "Vedic": "Vedas"
    },
    {
        " texts. The most notable grammarian of ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        " was  , whose grammar formulates close to 4,000 rules which together form a compact ": null
    },
    {
        "generative grammar": "Generative Grammar"
    },
    {
        " of Sanskrit. Inherent in his analytic approach are the concepts of the ": null
    },
    {
        "phoneme": "Phoneme"
    },
    {
        ", the ": null
    },
    {
        "morpheme": "Morpheme"
    },
    {
        " and the ": null
    },
    {
        "root": "Root"
    },
    {
        ".     Medicine: Findings from ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " graveyards in what is now Pakistan show evidence of proto-dentistry among an early farming culture.  ": null
    },
    {
        "Ayurveda": "Ayurveda"
    },
    {
        " is a system of traditional medicine that originated in ancient India before 2500 BC,  and is now practiced as a form of ": null
    },
    {
        "alternative medicine": "Alternative Medicine"
    },
    {
        " in other parts of the world. Its most famous text is the ": null
    },
    {
        "Suśrutasamhitā": "Sushruta Samhita"
    },
    {
        " of ": null
    },
    {
        "Suśruta": "Sushruta"
    },
    {
        ", which is notable for describing procedures on various forms of ": null
    },
    {
        "surgery": "Surgery"
    },
    {
        ", including ": null
    },
    {
        "rhinoplasty": "Rhinoplasty"
    },
    {
        ", the repair of torn ear lobes, perineal ": null
    },
    {
        "lithotomy": "Lithotomy"
    },
    {
        ", cataract surgery, and several other excisions and other surgical procedures.     Metallurgy: The ": null
    },
    {
        "wootz": "Wootz Steel"
    },
    {
        ", ": null
    },
    {
        "crucible": "Crucible Steel"
    },
    {
        " and ": null
    },
    {
        "stainless": "Stainless Steel"
    },
    {
        " steels": "Steels"
    },
    {
        " were invented in India, and were widely exported in Classic Mediterranean world. It was known from ": null
    },
    {
        "Pliny the Elder": "Pliny The Elder"
    },
    {
        " as ferrum indicum. Indian Wootz steel was held in high regard in Roman Empire, was often considered to be the best. After in Middle Age it was imported in Syria to produce with special techniques the ": null
    },
    {
        "Damascus steel": "Damascus Steel"
    },
    {
        " by the year 1000. C.S. Smith, A History of Metallography, University Press, Chicago ; Juleff 1996; Srinivasan, Sharda and Srinivasa Rangnathan 2004       The Hindus excel in the manufacture of iron, and in the preparations of those ingredients along with which it is fused to obtain that kind of soft iron which is usually styled Indian steel . They also have workshops wherein are forged the most famous sabres in the world.   :—": null
    },
    {
        "Henry Yule": "Henry Yule"
    },
    {
        " quoted the 12th-century Arab Edrizi. Srinivasan, Sharda and Srinivasa Rangnathan. 2004. Indias Legendary Wootz Steel. Bangalore: Tata Steel.              Mathematics The Nine Chapters on the Mathematical Art  included methods for extracting higher order roots by ": null
    },
    {
        "Horners method": "Horners Method"
    },
    {
        " and solving linear equations and by ": null
    },
    {
        "Pythagoras theorem": "Pythagorean Theorem"
    },
    {
        ". Cubic equations were solved in the ": null
    },
    {
        "Tang dynasty": "Tang Dynasty"
    },
    {
        " and solutions of equations of order higher than 3 appeared in print in 1245 AD by ": null
    },
    {
        "Chin Chiu-shao": "Chin Chiu-Shao"
    },
    {
        ". ": null
    },
    {
        "Pascals triangle": "Pascals Triangle"
    },
    {
        " for binomial coefficients was described around 1100 by ": null
    },
    {
        "Jia Xian": "Jia Xian"
    },
    {
        ".     Although the first attempts at an axiomatisation of geometry appear in the ": null
    },
    {
        "Mohist": "Mohist"
    },
    {
        " canon in 330 BC, ": null
    },
    {
        "Liu Hui": "Liu Hui"
    },
    {
        " developed algebraic methods in geometry in the 3rd century AD and also calculated ": null
    },
    {
        "pi": "Pi"
    },
    {
        " to 5 significant figures. In 480, ": null
    },
    {
        "Zu Chongzhi": "Zu Chongzhi"
    },
    {
        " improved this by discovering the ratio   which remained the most accurate value for 1200 years.          Astronomy": null
    },
    {
        "Matteo Ricci": "Matteo Ricci"
    },
    {
        " gained much favour in 1601 by his predictions. Needham p422   By 635 Chinese astronomers had observed that the tails of comets always point away from the sun.     From antiquity, the Chinese used an equatorial system for describing the skies and a star map from 940 was drawn using a cylindrical  projection. The use of an ": null
    },
    {
        "armillary sphere": "Armillary Sphere"
    },
    {
        " is recorded from the 4th century BC and a sphere permanently mounted in equatorial axis from 52 BC. In 125 AD ": null
    },
    {
        "Zhang Heng": "Zhang Heng"
    },
    {
        " used water power to rotate the sphere in real time. This included rings for the meridian and ecliptic. By 1270 they had incorporated the principles of the Arab ": null
    },
    {
        "torquetum": "Torquetum"
    },
    {
        ".          Seismology": null
    },
    {
        "seismometer": "Seismometer"
    },
    {
        " in 132 CE which provided instant alert to authorities in the capital Luoyang that an earthquake had occurred in a location indicated by a specific ": null
    },
    {
        "cardinal or ordinal direction": "Cardinal Direction"
    },
    {
        ". de Crespigny , 1050; Morton & Lewis , 70. Although no tremors could be felt in the capital when Zhang told the court that an earthquake had just occurred in the northwest, a message came soon afterwards that an earthquake had indeed struck 400  km to 500  km northwest of Luoyang . Minford & Lau , 307; Balchin , 26–27; Needham , 627; Needham , 484; Krebs , 31. Zhang called his device the instrument for measuring the seasonal winds and the movements of the Earth , so-named because he and others thought that earthquakes were most likely caused by the enormous compression of trapped air. Needham , 626. See ": null
    },
    {
        "Zhangs seismometer": "Zhang Hengzhangs Seismometer"
    },
    {
        " for further details.     There are many notable contributors to the field of Chinese science throughout the ages. One of the best examples would be the medieval Song Chinese ": null
    },
    {
        "Shen Kuo": "Shen Kuo"
    },
    {
        " , a ": null
    },
    {
        "polymath": "Polymath"
    },
    {
        " scientist and statesman who was the first to describe the ": null
    },
    {
        "magnetic": "Magnetic"
    },
    {
        "-needle ": null
    },
    {
        "compass": "Compass"
    },
    {
        " used for ": null
    },
    {
        "navigation": "Navigation"
    },
    {
        ", discovered the concept of ": null
    },
    {
        "true north": "True North"
    },
    {
        ", improved the design of the astronomical ": null
    },
    {
        "gnomon": "Gnomon"
    },
    {
        ", ": null
    },
    {
        "armillary sphere": "Armillary Sphere"
    },
    {
        ", sight tube, and ": null
    },
    {
        "clepsydra": "Water Clock"
    },
    {
        ", and described the use of ": null
    },
    {
        "drydocks": "Drydock"
    },
    {
        " to repair boats. After observing the natural process of the inundation of ": null
    },
    {
        "silt": "Silt"
    },
    {
        " and the find of ": null
    },
    {
        "marine": "Marine"
    },
    {
        "fossils": "Fossil"
    },
    {
        " in the ": null
    },
    {
        "Taihang Mountains": "Taihang Mountains"
    },
    {
        " , Shen Kuo devised a theory of land formation, or ": null
    },
    {
        "geomorphology": "Geomorphology"
    },
    {
        ". He also adopted a theory of gradual ": null
    },
    {
        "climate change": "Climate Change"
    },
    {
        " in regions over time, after observing ": null
    },
    {
        "petrified": "Petrified"
    },
    {
        " bamboo": "Bamboo"
    },
    {
        " found underground at ": null
    },
    {
        "Yanan": "Yanan"
    },
    {
        ", ": null
    },
    {
        "Shaanxi": "Shaanxi"
    },
    {
        " province. If not for Shen Kuos writing, ": null
    },
    {
        "Shen Kuo": "Shen Kuo"
    },
    {
        " 沈括 , Meng Chi Pi Than  as cited in  p. 244 the architectural works of ": null
    },
    {
        "Yu Hao": "Yu Hao"
    },
    {
        " would be little known, along with the inventor of ": null
    },
    {
        "movable type": "Movable Type"
    },
    {
        " printing": "Printing"
    },
    {
        ", ": null
    },
    {
        "Bi Sheng": "Bi Sheng"
    },
    {
        " . Shens contemporary ": null
    },
    {
        "Su Song": "Su Song"
    },
    {
        " was also a brilliant polymath, an astronomer who created a celestial atlas of star maps, wrote a pharmaceutical treatise with related subjects of ": null
    },
    {
        "botany": "Botany"
    },
    {
        ", ": null
    },
    {
        "zoology": "Zoology"
    },
    {
        ", ": null
    },
    {
        "mineralogy": "Mineralogy"
    },
    {
        ", and ": null
    },
    {
        "metallurgy": "Metallurgy"
    },
    {
        ", and had erected a large ": null
    },
    {
        "astronomical": "Astronomical"
    },
    {
        " clocktower": "Clocktower"
    },
    {
        " in ": null
    },
    {
        "Kaifeng": "Kaifeng"
    },
    {
        " city in 1088. To operate the crowning ": null
    },
    {
        "armillary sphere": "Armillary Sphere"
    },
    {
        ", his clocktower featured an ": null
    },
    {
        "escapement": "Escapement"
    },
    {
        " mechanism and the worlds oldest known use of an endless power-transmitting ": null
    },
    {
        "chain drive": "Chain Drive"
    },
    {
        ". Needham, Joseph . Science and Civilization in China: Volume 4, Part 2, Mechanical Engineering. Cave Books, Ltd. Page 111, 165, 456–457. Needham, Joseph . Science and Civilization in China: Volume 4, Physics and Physical Technology, Part 2, Mechanical Engineering. Taipei: Caves Books Ltd, pp. 445 & 448, 469  471.     The ": null
    },
    {
        "Jesuit China missions": "Jesuit China Missions"
    },
    {
        " of the 16th and 17th centuries learned to appreciate the scientific achievements of this ancient culture and made them known in Europe. Through their correspondence European scientists first learned about the Chinese science and culture. Agustín Udías, Searching the Heavens and the Earth: The History of Jesuit Observatories. . p. 53 Western academic thought on the history of Chinese technology and science was galvanized by the work of ": null
    },
    {
        "Joseph Needham": "Joseph Needham"
    },
    {
        " and the Needham Research Institute. Among the technological accomplishments of China were, according to the British scholar Needham, early ": null
    },
    {
        "seismological": "Seismometer"
    },
    {
        " detectors , the ": null
    },
    {
        "water-powered": "Hydraulics"
    },
    {
        " celestial globe": "Celestial Globe"
    },
    {
        " , ": null
    },
    {
        "match": "Match"
    },
    {
        "es, the independent invention of the ": null
    },
    {
        "decimal system": "Decimal"
    },
    {
        ", ": null
    },
    {
        "dry docks": "Graving Dock"
    },
    {
        ", sliding ": null
    },
    {
        "calipers": "Calipers"
    },
    {
        ", the double-action ": null
    },
    {
        "piston pump": "Piston Pump"
    },
    {
        ", ": null
    },
    {
        "cast iron": "Cast Iron"
    },
    {
        ", the ": null
    },
    {
        "blast furnace": "Blast Furnace"
    },
    {
        ", the ": null
    },
    {
        "iron": "Iron"
    },
    {
        " plough": "Plough"
    },
    {
        ", the multi-tube ": null
    },
    {
        "seed drill": "Seed Drill"
    },
    {
        ", the ": null
    },
    {
        "wheelbarrow": "Wheelbarrow"
    },
    {
        ", the ": null
    },
    {
        "suspension bridge": "Suspension Bridge"
    },
    {
        ", the ": null
    },
    {
        "winnowing machine": "Fengshanche"
    },
    {
        ", the ": null
    },
    {
        "rotary fan": "Mechanical Fan"
    },
    {
        ", the ": null
    },
    {
        "parachute": "Parachute"
    },
    {
        ", ": null
    },
    {
        "natural gas": "Natural Gas"
    },
    {
        " as fuel, the ": null
    },
    {
        "raised-relief map": "Raised-Relief Map"
    },
    {
        ", the ": null
    },
    {
        "propeller": "Propeller"
    },
    {
        ", the ": null
    },
    {
        "crossbow": "Crossbow"
    },
    {
        ", and a solid fuel ": null
    },
    {
        "rocket": "Rocket"
    },
    {
        ", the ": null
    },
    {
        "multistage rocket": "Multistage Rocket"
    },
    {
        ", the ": null
    },
    {
        "horse collar": "Horse Collar"
    },
    {
        ", along with contributions in ": null
    },
    {
        "logic": "Logic"
    },
    {
        ", ": null
    },
    {
        "astronomy": "Astronomy"
    },
    {
        ", ": null
    },
    {
        "medicine": "Medicine"
    },
    {
        ", and other fields.     However, cultural factors prevented these Chinese achievements from developing into what we might call modern science . According to Needham, it may have been the religious and philosophical framework of Chinese intellectuals which made them unable to accept the ideas of laws of nature:                   Because of the collapse of the ": null
    },
    {
        "Western Roman Empire": "Western Roman Empire"
    },
    {
        ", the intellectual level in the western part of Europe declined ": null
    },
    {
        "in the 400s": "Migration Period"
    },
    {
        ". In contrast, the ": null
    },
    {
        "Eastern Roman": "Eastern Roman Empire"
    },
    {
        " or ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        " resisted the barbarian attacks, and preserved and improved the learning. Lindberg, David. The Beginnings of Western Science. University of Chicago Press. p. 363.     While the ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        " still held learning centers such as ": null
    },
    {
        "Constantinople": "Constantinople"
    },
    {
        ", Alexandria and Antioch, Western Europes knowledge was concentrated in ": null
    },
    {
        "monasteries": "Monastery"
    },
    {
        " until the development of ": null
    },
    {
        "medieval universities": "Medieval University"
    },
    {
        " in the 12th centuries. The curriculum of monastic schools included the study of the few available ancient texts and of new works on practical subjects like medicine Linda E. Voigts, Anglo-Saxon Plant Remedies and the Anglo-Saxons , Isis, 70 : 250–268; reprinted in Michael H. Shank, The Scientific Enterprise in Antiquity and the Middle Ages, Chicago: Univ. of Chicago Pr., 2000, pp. 163–181. . and timekeeping. Faith Wallis, Bede: The Reckoning of Time, Liverpool: Liverpool Univ. Pr., 2004, pp. xviii–xxxiv. .     In the sixth century in the Byzantine Empire, ": null
    },
    {
        "Isidore of Miletus": "Isidore Of Miletus"
    },
    {
        " compiled Archimedes mathematical works in the ": null
    },
    {
        "Archimedes Palimpsest": "Archimedes Palimpsest"
    },
    {
        ", where all Archimedes mathematical contributions were collected and studied.     ": null
    },
    {
        "John Philoponus": "John Philoponus"
    },
    {
        ", another Byzantine scholar, was the first to question Aristotles teaching of physics, introducing the ": null
    },
    {
        "theory of impetus": "Theory Of Impetus"
    },
    {
        ".   Link to  from Googles copy of 2008 reprint. The theory of impetus was an auxiliary or secondary theory of Aristotelian dynamics, put forth initially to explain projectile motion against gravity. It is the intellectual precursor to the concepts of inertia, momentum and acceleration in classical mechanics.  The works of John Philoponus inspired ": null
    },
    {
        "Galileo Galilei": "Galileo Galilei"
    },
    {
        " ten centuries later. Lindberg, David. https://books.google.com/books?iddPUBAkIm2lUC & pgPA162 The Beginnings of Western Science. University of Chicago Press. p. 162.      The first record of separating conjoined twins took place in the ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        " in the 900s when the surgeons tried to separate a dead body of a pair of conjoined twins. The result was partly successful as the other twin managed to live for three days. The next recorded case of separating conjoined twins was several centuries later, in 1600s Germany.       During the ": null
    },
    {
        "Fall of Constantinople": "Fall Of Constantinople"
    },
    {
        " in 1453, a number of Greek scholars fled to North Italy in which they fueled the era later commonly known as the ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        "” as they brought with them a great deal of classical learning including an understanding of botany, medicine, and zoology. Byzantium also gave the West important inputs: John Philoponus criticism of Aristotelian physics, and the works of Dioscorides. Lindberg, David. . The Beginnings of Western Science. University of Chicago Press. p. 162.               In the ": null
    },
    {
        "Middle East": "Middle East"
    },
    {
        ", ": null
    },
    {
        "Greek philosophy": "Greek Philosophy"
    },
    {
        " was able to find some support under the newly created ": null
    },
    {
        "Arab Empire": "Caliphate"
    },
    {
        ". With the ": null
    },
    {
        "spread of Islam": "Spread Of Islam"
    },
    {
        " in the 7th and 8th centuries, a period of ": null
    },
    {
        "Muslim": "Muslim"
    },
    {
        " scholarship, known as the ": null
    },
    {
        "Islamic Golden Age": "Islamic Golden Age"
    },
    {
        ", lasted until the 13th century. This scholarship was aided by several factors. The use of a single language, ": null
    },
    {
        "Arabic": "Arabic Language"
    },
    {
        ", allowed communication without need of a translator. Access to ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " texts from the ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        ", along with ": null
    },
    {
        "Indian": "History Of India"
    },
    {
        " sources of learning, provided Muslim scholars a knowledge base to build upon.     ": null
    },
    {
        "Scientific method": "Scientific Method"
    },
    {
        " began developing in the Muslim world, where significant progress in methodology was made, beginning with the experiments of ": null
    },
    {
        "Ibn al-Haytham": "Ibn Al-Haytham"
    },
    {
        " on ": null
    },
    {
        "optics": "Optics"
    },
    {
        " from c. 1000, in his  Book of Optics . , Arab Origins of the Discovery of the Refraction of Light; Roshdi Hifni Rashed Awarded the 2007 King Faisal International Prize, Optics & Photonics News , Vol. 18, No. 10, pp. 22–23 . The most important development of the scientific method was the use of experiments to distinguish between competing scientific theories set within a generally ": null
    },
    {
        "empirical": "Empiricism"
    },
    {
        " orientation, which began among Muslim scientists. Ibn al-Haytham is also regarded as the father of optics, especially for his empirical proof of the intromission theory of light. Some have also described Ibn al-Haytham as the first scientist for his development of the modern scientific method.      In ": null
    },
    {
        "mathematics": "Islamic Mathematics"
    },
    {
        ", the mathematician ": null
    },
    {
        "Muhammad ibn Musa al-Khwarizmi": "Muhammad Ibn Musa Al-Khwarizmi"
    },
    {
        " gave his name to the concept of the ": null
    },
    {
        "algorithm": "Algorithm"
    },
    {
        ", while the term ": null
    },
    {
        "algebra": "Algebra"
    },
    {
        " is derived from al-jabr, the beginning of the title of one of his publications. ": null
    },
    {
        "Toomer, Gerald": "Gerald J. Toomer"
    },
    {
        " . Al-Khwārizmī, Abu Jaʿfar Muḥammad ibn Mūsā . In Gillispie, Charles Coulston. Dictionary of Scientific Biography. 7. New York: Charles Scribners Sons. . What is now known as ": null
    },
    {
        "Arabic numerals": "Arabic Numerals"
    },
    {
        " originally came from India, but Muslim mathematicians made several key refinements to the number system, such as the introduction of ": null
    },
    {
        "decimal point": "Decimal Separator"
    },
    {
        " notation.     In ": null
    },
    {
        "astronomy": "Islamic Astronomy"
    },
    {
        ", ": null
    },
    {
        "Al-Battani": "Al-Battani"
    },
    {
        " improved the measurements of ": null
    },
    {
        "Hipparchus": "Hipparchus"
    },
    {
        ", preserved in the translation of ": null
    },
    {
        "Ptolemys": "Ptolemy"
    },
    {
        " Hè Megalè Syntaxis  translated as  Almagest . Al-Battani also improved the precision of the measurement of the precession of the Earths axis. The corrections made to the ": null
    },
    {
        "geocentric model": "Geocentric Model"
    },
    {
        " by al-Battani, ": null
    },
    {
        "Ibn al-Haytham": "Ibn Al-Haytham"
    },
    {
        ",  ": null
    },
    {
        "Averroes": "Averroes"
    },
    {
        " and the ": null
    },
    {
        "Maragha astronomers": "Maragheh Observatory"
    },
    {
        " such as ": null
    },
    {
        "Nasir al-Din al-Tusi": "Nasir Al-Din Al-Tusi"
    },
    {
        ", ": null
    },
    {
        "Moayyeduddin Urdi": "Moayyeduddin Urdi"
    },
    {
        " and ": null
    },
    {
        "Ibn al-Shatir": "Ibn Al-Shatir"
    },
    {
        " are similar to ": null
    },
    {
        "Copernican heliocentric": "Copernican Heliocentrism"
    },
    {
        " model.   ": null
    },
    {
        "Heliocentric": "Heliocentrism"
    },
    {
        " theories may have also been discussed by several other Muslim astronomers such as ": null
    },
    {
        "Jafar ibn Muhammad Abu Mashar al-Balkhi": "Jafar Ibn Muhammad Abu Mashar Al-Balkhi"
    },
    {
        ",  ": null
    },
    {
        "Abu-Rayhan Biruni": "Abu-Rayhan Biruni"
    },
    {
        ", Abu Said ": null
    },
    {
        "al-Sijzi": "Al-Sijzi"
    },
    {
        ",  ": null
    },
    {
        "Qutb al-Din al-Shirazi": "Qutb Al-Din Al-Shirazi"
    },
    {
        ", and ": null
    },
    {
        "Najm al-Dīn al-Qazwīnī al-Kātibī": "Najm Al-Dīn Al-Qazwīnī Al-Kātibī"
    },
    {
        ". , in      ": null
    },
    {
        "Muslim chemists and alchemists": "Alchemy"
    },
    {
        " played an important role in the foundation of modern ": null
    },
    {
        "chemistry": "Chemistry"
    },
    {
        ". Scholars such as ": null
    },
    {
        "Will Durant": "Will Durant"
    },
    {
        " Will Durant": "Will Durant"
    },
    {
        " . The Age of Faith , pp. 162–186. Simon & Schuster. . and ": null
    },
    {
        "Fielding H. Garrison": "Fielding H. Garrison"
    },
    {
        " Fielding H. Garrison": "Fielding H. Garrison"
    },
    {
        ", An Introduction to the History of Medicine with Medical Chronology, Suggestions for Study and Biblographic Data, p. 86 considered Muslim chemists to be the founders of chemistry. In particular, ": null
    },
    {
        "Jābir ibn Hayyān": "Jābir Ibn Hayyān"
    },
    {
        " is considered by many to be the father of chemistry .   The works of Arabic scientists influenced ": null
    },
    {
        "Roger Bacon": "Roger Bacon"
    },
    {
        " ,  and later ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        ".  The scholar ": null
    },
    {
        "Al-Razi": "Al-Razi"
    },
    {
        " contributed to chemistry and medicine.      Ibn Sina  is regarded as the most influential philosopher of Islam.  He pioneered the science of experimental medicine Jacquart, Danielle . Islamic Pharmacology in the Middle Ages: Theories and Substances . European Review 16: 219–227. and was the first physician to conduct clinical trials. David W. Tschanz, MSPH, PhD . Arab Roots of European Medicine , Heart Views 4 . His two most notable works in medicine are the Kitāb al-shifāʾ and ": null
    },
    {
        "The Canon of Medicine": "The Canon Of Medicine"
    },
    {
        ", both of which were used as standard medicinal texts in both the Muslim world and in Europe well into the 17th century. Amongst his many contributions are the discovery of the contagious nature of infectious diseases, and the introduction of clinical pharmacology.      Scientists from the Islamic world include ": null
    },
    {
        "al-Farabi": "Al-Farabi"
    },
    {
        " , ": null
    },
    {
        "Abu al-Qasim al-Zahrawi": "Abu Al-Qasim Al-Zahrawi"
    },
    {
        " ,  ": null
    },
    {
        "Abū Rayhān al-Bīrūnī": "Abū Rayhān Al-Bīrūnī"
    },
    {
        " ,  ": null
    },
    {
        "Nasīr al-Dīn al-Tūsī": "Nasīr Al-Dīn Al-Tūsī"
    },
    {
        " , and ": null
    },
    {
        "Ibn Khaldun": "Ibn Khaldun"
    },
    {
        " ,  among many others.     Islamic science began its decline in the 12th or 13th century, before the ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        " in Europe, and due in part to the 11th–13th century ": null
    },
    {
        "Mongol conquests": "Mongol Conquests"
    },
    {
        ", during which libraries, observatories, hospitals and universities were destroyed. Erica Fraser. The Islamic World to 1600, University of Calgary. The end of the ": null
    },
    {
        "Islamic Golden Age": "Islamic Golden Age"
    },
    {
        " is marked by the destruction of the intellectual center of ": null
    },
    {
        "Baghdad": "Baghdad"
    },
    {
        ", the capital of the ": null
    },
    {
        "Abbasid caliphate": "Abbasid Caliphate"
    },
    {
        " in 1258.               By the eleventh century, most of Europe had become Christian; stronger monarchies emerged; borders were restored; technological developments and agricultural innovations were made, increasing the food supply and population. Classical Greek texts were translated from Arabic and Greek into Latin, stimulating scientific discussion in Western Europe. Lindberg, David. The Beginnings of Western Science University of Chicago Press. p. 204.     An intellectual revitalization of Western Europe started with the birth of ": null
    },
    {
        "medieval universities": "Medieval University"
    },
    {
        " in the 12th century. Contact with the Byzantine Empire, and with the Islamic world during the ": null
    },
    {
        "Reconquista": "Reconquista"
    },
    {
        " and the ": null
    },
    {
        "Crusades": "Crusades"
    },
    {
        ", allowed Latin Europe access to scientific ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " and ": null
    },
    {
        "Arabic": "Arabic Language"
    },
    {
        " texts, including the works of ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        ", ": null
    },
    {
        "Ptolemy": "Ptolemy"
    },
    {
        ", ": null
    },
    {
        "Isidore of Miletus": "Isidore Of Miletus"
    },
    {
        ", ": null
    },
    {
        "John Philoponus": "John Philoponus"
    },
    {
        ", ": null
    },
    {
        "Jābir ibn Hayyān": "Jābir Ibn Hayyān"
    },
    {
        ", ": null
    },
    {
        "al-Khwarizmi": "Muhammad Ibn Mūsā Al-Khwārizmī"
    },
    {
        ", ": null
    },
    {
        "Alhazen": "Ibn Al-Haytham"
    },
    {
        ", ": null
    },
    {
        "Avicenna": "Avicenna"
    },
    {
        ", and ": null
    },
    {
        "Averroes": "Averroes"
    },
    {
        ". European scholars had access to the translation programs of ": null
    },
    {
        "Raymond of Toledo": "Raymond Of Toledo"
    },
    {
        ", who sponsored the 12th century ": null
    },
    {
        "Toledo School of Translators": "Toledo School Of Translators"
    },
    {
        " from Arabic to Latin. Later translators like ": null
    },
    {
        "Michael Scotus": "Michael Scotus"
    },
    {
        " would learn Arabic in order to study these texts directly. The European universities aided materially in the ": null
    },
    {
        "translation and propagation of these texts": "Latin Translations Of The 12Th Century"
    },
    {
        " and started a new infrastructure which was needed for scientific communities. In fact, European university put many works about the natural world and the study of nature at the center of its curriculum, Huff, Toby. Rise of early modern science 2nd ed. pp. 180–181 with the result that the medieval university laid far greater emphasis on science than does its modern counterpart and descendent. Grant, Edward. Science in the Medieval University , in James M. Kittleson and Pamela J. Transue, ed., Rebirth, Reform and Resilience: Universities in Transition, 1300–1700, Ohio State University Press, 1984, p. 68     In ": null
    },
    {
        "classical antiquity": "Classical Antiquity"
    },
    {
        ", Greek and Roman taboos had meant that dissection was usually banned, but in the Middle Ages medical teachers and students at Bologna began to open human bodies, and ": null
    },
    {
        "Mondino de Luzzi": "Mondino De Luzzi"
    },
    {
        " produced the ﬁrst known anatomy textbook based on human dissection.       As a result of the ": null
    },
    {
        "Pax Mongolica": "Pax Mongolica"
    },
    {
        ", Europeans, such as ": null
    },
    {
        "Marco Polo": "Marco Polo"
    },
    {
        ", began to venture further and further east. This led to the increased awareness of Indian and even Chinese culture and civilization within the European tradition. Technological advances were also made, such as the early flight of ": null
    },
    {
        "Eilmer of Malmesbury": "Eilmer Of Malmesbury"
    },
    {
        " , ": null
    },
    {
        "William of Malmesbury": "William Of Malmesbury"
    },
    {
        ",  Gesta Regum Anglorum / The history of the English kings, ed. and trans. R.A.B. Mynors, R.M. Thomson, and M. Winterbottom, 2 vols., Oxford Medieval Texts and the ": null
    },
    {
        "metallurgical": "Metallurgy"
    },
    {
        " achievements of the ": null
    },
    {
        "Cistercian": "Cistercians"
    },
    {
        " blast furnace": "Blast Furnace"
    },
    {
        " at ": null
    },
    {
        "Laskill": "Laskill"
    },
    {
        ". R.W. Vernon, G. McDonnell and A. Schmidt, An integrated geophysical and analytical appraisal of early iron-working: three case studies Historical Metallurgy 31 , 72–75 79. David Derbyshire, Henry Stamped Out Industrial Revolution , ": null
    },
    {
        "The Daily Telegraph": "The Daily Telegraph"
    },
    {
        "          At the beginning of the 13th century, there were reasonably accurate Latin translations of the main works of almost all the intellectually crucial ancient authors, allowing a sound transfer of scientific ideas via both the universities and the monasteries. By then, the natural philosophy in these texts began to be extended by ": null
    },
    {
        "scholastics": "Scholasticism"
    },
    {
        " such as ": null
    },
    {
        "Robert Grosseteste": "Robert Grosseteste"
    },
    {
        ", ": null
    },
    {
        "Roger Bacon": "Roger Bacon"
    },
    {
        ", ": null
    },
    {
        "Albertus Magnus": "Albertus Magnus"
    },
    {
        " and ": null
    },
    {
        "Duns Scotus": "Duns Scotus"
    },
    {
        ". Precursors of the modern scientific method, influenced by earlier contributions of the Islamic world, can be seen already in Grossetestes emphasis on mathematics as a way to understand nature, and in the empirical approach admired by Bacon, particularly in his  Opus Majus . ": null
    },
    {
        "Pierre Duhems": "Pierre Duhem"
    },
    {
        " thesis is that ": null
    },
    {
        "Stephen Tempier": "Stephen Tempier"
    },
    {
        " - the Bishop of Paris - ": null
    },
    {
        "Condemnation of 1277": "Condemnation Of 1277"
    },
    {
        " led to the study of medieval science as a serious discipline, but no one in the field any longer endorses his view that modern science started in 1277 .  However, many scholars agree with Duhems view that the mid-late Middle Ages saw important scientific developments.         The first half of the 14th century saw much important scientific work, largely within the framework of ": null
    },
    {
        "scholastic": "Scholasticism"
    },
    {
        " commentaries on Aristotles scientific writings. Edward Grant, The Foundations of Modern Science in the Middle Ages: Their Religious, Institutional, and Intellectual Contexts, , pp. 127–131. ": null
    },
    {
        "William of Ockham": "William Of Ockham"
    },
    {
        " emphasised the principle of ": null
    },
    {
        "parsimony": "Occams Razor"
    },
    {
        "A Source Book in Medieval Science, , p. 232 and an intermediary sensible species is not needed to transmit an image of an object to the eye. David C. Lindberg, Theories of Vision from al-Kindi to Kepler, , pp. 140–142. Scholars such as ": null
    },
    {
        "Jean Buridan": "Jean Buridan"
    },
    {
        " and ": null
    },
    {
        "Nicole Oresme": "Nicole Oresme"
    },
    {
        " started to reinterpret elements of Aristotles mechanics. In particular, Buridan developed the theory that impetus was the cause of the motion of projectiles, which was a first step towards the modern concept of ": null
    },
    {
        "inertia": "Inertia"
    },
    {
        ". Edward Grant, The Foundations of Modern Science in the Middle Ages: Their Religious, Institutional, and Intellectual Contexts, , pp. 95–97. The ": null
    },
    {
        "Oxford Calculators": "Oxford Calculators"
    },
    {
        " began to mathematically analyze the ": null
    },
    {
        "kinematics": "Kinematics"
    },
    {
        " of motion, making this analysis without considering the causes of motion. Edward Grant, The Foundations of Modern Science in the Middle Ages: Their Religious, Institutional, and Intellectual Contexts, , pp. 100–103.     In 1348, the ": null
    },
    {
        "Black Death": "Black Death"
    },
    {
        " and other disasters sealed a sudden end to philosophic and scientific development. Yet, the rediscovery of ancient texts was stimulated by the ": null
    },
    {
        "Fall of Constantinople": "Fall Of Constantinople"
    },
    {
        " in 1453, when many ": null
    },
    {
        "Byzantine": "Byzantine Empire"
    },
    {
        " scholars sought refuge in the West. Meanwhile, the introduction of printing was to have great effect on European society. The facilitated dissemination of the printed word democratized learning and allowed ideas such as ": null
    },
    {
        "algebra": "Algebra"
    },
    {
        " to propagate more rapidly. These developments paved the way for the ": null
    },
    {
        "Scientific Revolution": "Scientific Revolution"
    },
    {
        ", where scientific inquiry, halted at the start of the Black Death, resumed.                     The renewal of learning in Europe began with 12th century ": null
    },
    {
        "Scholasticism": "Scholasticism"
    },
    {
        ". The ": null
    },
    {
        "Northern Renaissance": "Northern Renaissance"
    },
    {
        " showed a decisive shift in focus from Aristotelian natural philosophy to chemistry and the biological sciences . ": null
    },
    {
        "Allen Debus": "Allen Debus"
    },
    {
        ", Man and Nature in the Renaissance, . Thus modern science in Europe was resumed in a period of great upheaval: the ": null
    },
    {
        "Protestant Reformation": "Protestant Reformation"
    },
    {
        " and ": null
    },
    {
        "Catholic": "Roman Catholic Church"
    },
    {
        " Counter-Reformation": "Counter-Reformation"
    },
    {
        "; the discovery of the Americas by ": null
    },
    {
        "Christopher Columbus": "Christopher Columbus"
    },
    {
        "; the ": null
    },
    {
        "Fall of Constantinople": "Fall Of Constantinople"
    },
    {
        "; but also the re-discovery of Aristotle during the Scholastic period presaged large social and political changes. Thus, a suitable environment was created in which it became possible to question scientific doctrine, in much the same way that ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        " and ": null
    },
    {
        "John Calvin": "John Calvin"
    },
    {
        " questioned religious doctrine. The works of ": null
    },
    {
        "Ptolemy": "Ptolemy"
    },
    {
        " and ": null
    },
    {
        "Galen": "Galen"
    },
    {
        " were found not always to match everyday observations. Work by ": null
    },
    {
        "Vesalius": "Vesalius"
    },
    {
        " on human cadavers found problems with the Galenic view of anatomy. Precise titles of these landmark books can be found in the collections of the ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        ". A list of these titles can be found in           The willingness to question previously held truths and search for new answers resulted in a period of major scientific advancements, now known as the ": null
    },
    {
        "Scientific Revolution": "Scientific Revolution"
    },
    {
        ". The Scientific Revolution is traditionally held by most historians to have begun in 1543, when the books  De humani corporis fabrica   by ": null
    },
    {
        "Andreas Vesalius": "Andreas Vesalius"
    },
    {
        ", and also  De Revolutionibus , by the astronomer ": null
    },
    {
        "Nicolaus Copernicus": "Nicolaus Copernicus"
    },
    {
        ", were first printed. The thesis of Copernicus book was that the Earth moved around the Sun. The period culminated with the publication of the  Philosophiæ Naturalis Principia Mathematica  in 1687 by ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        ", representative of the unprecedented growth of ": null
    },
    {
        "scientific publications": "Antiquarian Science Book"
    },
    {
        " throughout Europe.     Other significant scientific advances were made during this time by ": null
    },
    {
        "Galileo Galilei": "Galileo Galilei"
    },
    {
        ", ": null
    },
    {
        "Edmond Halley": "Edmond Halley"
    },
    {
        ", ": null
    },
    {
        "Robert Hooke": "Robert Hooke"
    },
    {
        ", ": null
    },
    {
        "Christiaan Huygens": "Christiaan Huygens"
    },
    {
        ", ": null
    },
    {
        "Tycho Brahe": "Tycho Brahe"
    },
    {
        ", ": null
    },
    {
        "Johannes Kepler": "Johannes Kepler"
    },
    {
        ", ": null
    },
    {
        "Gottfried Leibniz": "Gottfried Leibniz"
    },
    {
        ", and ": null
    },
    {
        "Blaise Pascal": "Blaise Pascal"
    },
    {
        ". In philosophy, major contributions were made by ": null
    },
    {
        "Francis Bacon": "Francis Bacon"
    },
    {
        ", Sir ": null
    },
    {
        "Thomas Browne": "Thomas Browne"
    },
    {
        ", ": null
    },
    {
        "René Descartes": "René Descartes"
    },
    {
        ", and ": null
    },
    {
        "Thomas Hobbes": "Thomas Hobbes"
    },
    {
        ". The scientific method was also better developed as the modern way of thinking emphasized experimentation and reason over traditional considerations.                  The ": null
    },
    {
        "Age of Enlightenment": "Age Of Enlightenment"
    },
    {
        " was a European affair. The 17th century brought decisive steps towards modern science, which accelerated during the 18th century. Directly based on the works , 741 of ": null
    },
    {
        "Newton": "Isaac Newton"
    },
    {
        ", ": null
    },
    {
        "Descartes": "Descartes"
    },
    {
        ", ": null
    },
    {
        "Pascal": "Blaise Pascal"
    },
    {
        " and ": null
    },
    {
        "Leibniz": "Gottfried Leibniz"
    },
    {
        ", the way was now clear to the development of modern ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", ": null
    },
    {
        "physics": "Physics"
    },
    {
        " and ": null
    },
    {
        "technology": "Technology"
    },
    {
        "   by the generation of ": null
    },
    {
        "Benjamin Franklin": "Benjamin Franklin"
    },
    {
        " , ": null
    },
    {
        "Leonhard Euler": "Leonhard Euler"
    },
    {
        " , ": null
    },
    {
        "Mikhail Lomonosov": "Mikhail Lomonosov"
    },
    {
        " and ": null
    },
    {
        "Jean le Rond dAlembert": "Jean Le Rond Dalembert"
    },
    {
        " . ": null
    },
    {
        "Denis Diderots": "Denis Diderot"
    },
    {
        "  Encyclopédie , published between 1751 and 1772 brought this new understanding to a wider audience. The impact of this process was not limited to science and technology, but affected ": null
    },
    {
        "philosophy": "History Of Philosophy"
    },
    {
        " , ": null
    },
    {
        "religion": "History Of Religion"
    },
    {
        " , and society and politics in general . The ": null
    },
    {
        "early modern period": "Early Modern Period"
    },
    {
        " is seen as a flowering of the European Renaissance, in what is often known as the ": null
    },
    {
        "Scientific Revolution": "Scientific Revolution"
    },
    {
        ", viewed as a foundation of ": null
    },
    {
        "modern science": "Modern Science"
    },
    {
        ". See, for example, pp. 741–744 of           The Romantic Movement of the early 19th century reshaped science by opening up new pursuits unexpected in the classical approaches of the Enlightenment. Major breakthroughs came in biology, especially in ": null
    },
    {
        "Darwins theory of evolution": "Darwinism"
    },
    {
        ", as well as physics , mathematics and chemistry . The decline of Romanticism occurred because a new movement, ": null
    },
    {
        "Positivism": "Positivism"
    },
    {
        ", began to take hold of the ideals of the intellectuals after 1840 and lasted until about 1880.       Eurocentrism in scientific history are historical accounts written about the development of ": null
    },
    {
        "modern science": "Modern Science"
    },
    {
        " that attribute all scholarly, technological, and philosophical gains to Europe and marginalize outside contributions.  The ": null
    },
    {
        "Scientific Revolution": "Scientific Revolution"
    },
    {
        " in Europe during the 16th-18th centuries was the period of human advancement into modern science by disproving the Aristotelian view of natural sciences and philosophy through proofs of calculations. Until Joseph Needhams book series ": null
    },
    {
        "Science and Civilisation in China": "Science And Civilisation In China"
    },
    {
        " began in 1954, many historians would write about modern science solely as a European achievement with no significant contributions form civilizations other than the Greeks.  Recent historical writings have argued that there was significant influence and contribution from Egyptian, Mesopotamian, Arabic, Indian, and Chinese astronomy and mathematics.      In contrast to the Eurocentric view, historians argue evidence of east Asian influence in the scientific revolution. The German astronomer and mathematician Nicolaus Copernicuss is credited to have begun the Scientific Revolution with his work De revolutionibus orbium coelestium which used calculations of Islamic astronomers. His findings were focused on the earths rotation on its axis every twenty-four hours and its orbit around the sun every 365¼ days. These findings lead Copernicuss ": null
    },
    {
        "heliocentric": "Heliocentrism"
    },
    {
        " system; knowledge known to Chinese astronomers based on their understanding of heavenly bodies moving against the path of the sun and the pole star, such as comets.  His heliocentric planetary theory was published in 1543, the same year the Greek works of ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        " were translated from Arabic into Latin.  The change in philosophical mindset as well as astronomical improvements gained by the Jesuits research in China is used as evidence to argue for its influence in Copernican work as well as Arab calculations and translations of Greek texts.         With the ": null
    },
    {
        "scientific revolution": "Scientific Revolution"
    },
    {
        ", paradigms established in the time of ": null
    },
    {
        "classical antiquity": "Classical Antiquity"
    },
    {
        " were replaced with those of scientists like ": null
    },
    {
        "Nicolaus Copernicus": "Nicolaus Copernicus"
    },
    {
        ", ": null
    },
    {
        "Galileo Galilei": "Galileo Galilei"
    },
    {
        " and ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        ". , 741–743 During the 19th century, the practice of science became professionalized and institutionalized in ways that continued through the 20th century. As the role of scientific knowledge grew in society, it became incorporated with many aspects of the functioning of nation-states.                    The scientific revolution is a convenient boundary between ancient thought and classical physics. ": null
    },
    {
        "Nicolaus Copernicus": "Nicolaus Copernicus"
    },
    {
        " revived the ": null
    },
    {
        "heliocentric": "Heliocentrism"
    },
    {
        " model of the solar system described by ": null
    },
    {
        "Aristarchus of Samos": "Aristarchus Of Samos"
    },
    {
        ". This was followed by the first known model of planetary motion given by ": null
    },
    {
        "Johannes Kepler": "Johannes Kepler"
    },
    {
        " in the early 17th century, which proposed that the planets follow ": null
    },
    {
        "elliptical": "Ellipse"
    },
    {
        " orbits, with the Sun at one focus of the ellipse. ": null
    },
    {
        "Galileo": "Galileo Galilei"
    },
    {
        "  also made use of experiments to validate physical theories, a key element of the scientific method. ": null
    },
    {
        "William Gilbert": "William Gilbert"
    },
    {
        " did some of the earliest experiments with electricity and magnetism, establishing that the Earth itself is magnetic.     In 1687, ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        " published the  Principia Mathematica , detailing two comprehensive and successful physical theories: ": null
    },
    {
        "Newtons laws of motion": "Newtons Laws Of Motion"
    },
    {
        ", which led to classical mechanics; and ": null
    },
    {
        "Newtons law of universal gravitation": "Newtons Law Of Universal Gravitation"
    },
    {
        ", which describes the fundamental force of gravity.     During the late 18th and early 19th century, the behavior of electricity and magnetism was studied by ": null
    },
    {
        "Luigi Galvani": "Luigi Galvani"
    },
    {
        ", ": null
    },
    {
        "Giovanni Aldini": "Giovanni Aldini"
    },
    {
        ", ": null
    },
    {
        "Alessandro Volta": "Alessandro Volta"
    },
    {
        ", ": null
    },
    {
        "Michael Faraday": "Michael Faraday"
    },
    {
        ", ": null
    },
    {
        "Georg Ohm": "Georg Ohm"
    },
    {
        ", and others. These studies led to the unification of the two phenomena into a single theory of ": null
    },
    {
        "electromagnetism": "Electromagnetism"
    },
    {
        ", by ": null
    },
    {
        "James Clerk Maxwell": "James Clerk Maxwell"
    },
    {
        " .     The beginning of the 20th century brought the start of a revolution in physics. The long-held theories of Newton were shown not to be correct in all circumstances. Beginning in 1900, ": null
    },
    {
        "Max Planck": "Max Planck"
    },
    {
        ", ": null
    },
    {
        "Albert Einstein": "Albert Einstein"
    },
    {
        ", ": null
    },
    {
        "Niels Bohr": "Niels Bohr"
    },
    {
        " and others developed quantum theories to explain various anomalous experimental results, by introducing discrete energy levels. Not only did quantum mechanics show that the laws of motion did not hold on small scales, but even more disturbingly, the theory of ": null
    },
    {
        "general relativity": "General Relativity"
    },
    {
        ", proposed by Einstein in 1915, showed that the fixed background of ": null
    },
    {
        "spacetime": "Spacetime"
    },
    {
        ", on which both ": null
    },
    {
        "Newtonian mechanics": "Newtonian Mechanics"
    },
    {
        " and ": null
    },
    {
        "special relativity": "Special Relativity"
    },
    {
        " depended, could not exist. In 1925, ": null
    },
    {
        "Werner Heisenberg": "Werner Heisenberg"
    },
    {
        " and ": null
    },
    {
        "Erwin Schrödinger": "Erwin Schrödinger"
    },
    {
        " formulated ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ", which explained the preceding quantum theories. The observation by ": null
    },
    {
        "Edwin Hubble": "Edwin Hubble"
    },
    {
        " in 1929 that the speed at which galaxies recede positively correlates with their distance, led to the understanding that the universe is expanding, and the formulation of the ": null
    },
    {
        "Big Bang": "Big Bang"
    },
    {
        " theory by ": null
    },
    {
        "Georges Lemaître": "Georges Lemaître"
    },
    {
        ".          In 1938 ": null
    },
    {
        "Otto Hahn": "Otto Hahn"
    },
    {
        " and ": null
    },
    {
        "Fritz Strassmann": "Fritz Strassmann"
    },
    {
        " discovered ": null
    },
    {
        "nuclear fission": "Nuclear Fission"
    },
    {
        " with radiochemical methods, and in 1939 ": null
    },
    {
        "Lise Meitner": "Lise Meitner"
    },
    {
        " and ": null
    },
    {
        "Otto Robert Frisch": "Otto Robert Frisch"
    },
    {
        " wrote the first theoretical interpretation of the fission process, which was later improved by ": null
    },
    {
        "Niels Bohr": "Niels Bohr"
    },
    {
        " and ": null
    },
    {
        "John A. Wheeler": "John A. Wheeler"
    },
    {
        ". Further developments took place during World War II, which led to the practical application of ": null
    },
    {
        "radar": "Radar"
    },
    {
        " and the development and use of the ": null
    },
    {
        "atomic bomb": "Atomic Bomb"
    },
    {
        ". Around this time, ": null
    },
    {
        "Chien-Shiung Wu": "Chien-Shiung Wu"
    },
    {
        " was recruited by the ": null
    },
    {
        "Manhattan Project": "Manhattan Project"
    },
    {
        " to help develop a process for separating uranium metal into U-235 and U-238 isotopes by ": null
    },
    {
        "Gaseous diffusion": "Gaseous Diffusion"
    },
    {
        ". Ronald K. Smeltzer. “Chien-Shiung Wu.” Atomic Heritage Foundation, . Accessed 26 Oct. 2017. She was an expert experimentalist in beta decay and weak interaction physics. Biography.com Editors. “Chien-Shiung Wu.” Biography.com, 2 June 2016, . Garwin, Richard L., and Tsung-Dao Lee. “Chien‐Shiung Wu.” Physics Today, vol. 50, no. 10, 1997, p. 130. world, physicstoday.scitation.org, doi:10.1063/1.2806727. Wu designed an experiment  that enabled theoretical physicists ": null
    },
    {
        "Tsung-Dao Lee": "Tsung-Dao Lee"
    },
    {
        " and ": null
    },
    {
        "Chen-Ning Yang": "Chen-Ning Yang"
    },
    {
        " to disprove the law of parity experimentally, winning them a Nobel Prize in 1957.     Though the process had begun with the invention of the ": null
    },
    {
        "cyclotron": "Cyclotron"
    },
    {
        " by ": null
    },
    {
        "Ernest O. Lawrence": "Ernest O. Lawrence"
    },
    {
        " in the 1930s, physics in the postwar period entered into a phase of what historians have called ": null
    },
    {
        "Big Science": "Big Science"
    },
    {
        " , requiring massive machines, budgets, and laboratories in order to test their theories and move into new frontiers. The primary patron of physics became state governments, who recognized that the support of basic research could often lead to technologies useful to both military and industrial applications.     Currently, general relativity and quantum mechanics are inconsistent with each other, and efforts are underway to unify the two.             Modern chemistry emerged from the sixteenth through the eighteenth centuries through the material practices and theories promoted by alchemy, medicine, manufacturing and mining.  A decisive moment came when chemistry was distinguished from ": null
    },
    {
        "alchemy": "Alchemy"
    },
    {
        " by ": null
    },
    {
        "Robert Boyle": "Robert Boyle"
    },
    {
        " in his work  The Sceptical Chymist , in 1661; although the alchemical tradition continued for some time after his work. Other important steps included the gravimetric experimental practices of medical chemists like ": null
    },
    {
        "William Cullen": "William Cullen"
    },
    {
        ", ": null
    },
    {
        "Joseph Black": "Joseph Black"
    },
    {
        ", ": null
    },
    {
        "Torbern Bergman": "Torbern Bergman"
    },
    {
        " and ": null
    },
    {
        "Pierre Macquer": "Pierre Macquer"
    },
    {
        " and through the work of ": null
    },
    {
        "Antoine Lavoisier": "Antoine Lavoisier"
    },
    {
        "  on ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        " and the law of ": null
    },
    {
        "conservation of mass": "Conservation Of Mass"
    },
    {
        ", which refuted ": null
    },
    {
        "phlogiston theory": "Phlogiston Theory"
    },
    {
        ". The theory that all matter is made of atoms, which are the smallest constituents of matter that cannot be broken down without losing the basic chemical and physical properties of that matter, was provided by ": null
    },
    {
        "John Dalton": "John Dalton"
    },
    {
        " in 1803, although the question took a hundred years to settle as proven. Dalton also formulated the law of mass relationships. In 1869, ": null
    },
    {
        "Dmitri Mendeleev": "Dmitri Mendeleev"
    },
    {
        " composed his ": null
    },
    {
        "periodic table": "Periodic Table"
    },
    {
        " of elements on the basis of Daltons discoveries.     The synthesis of ": null
    },
    {
        "urea": "Urea"
    },
    {
        " by ": null
    },
    {
        "Friedrich Wöhler": "Friedrich Wöhler"
    },
    {
        " opened a new research field, ": null
    },
    {
        "organic chemistry": "Organic Chemistry"
    },
    {
        ", and by the end of the 19th century, scientists were able to synthesize hundreds of organic compounds. The later part of the 19th century saw the exploitation of the Earths petrochemicals, after the exhaustion of the oil supply from ": null
    },
    {
        "whaling": "Whaling"
    },
    {
        ". By the 20th century, systematic production of refined materials provided a ready supply of products which provided not only energy, but also synthetic materials for clothing, medicine, and everyday disposable resources. Application of the techniques of organic chemistry to living organisms resulted in ": null
    },
    {
        "physiological chemistry": "Physiological Chemistry"
    },
    {
        ", the precursor to ": null
    },
    {
        "biochemistry": "Biochemistry"
    },
    {
        ". The 20th century also saw the integration of physics and chemistry, with chemical properties explained as the result of the electronic structure of the atom. ": null
    },
    {
        "Linus Paulings": "Linus Pauling"
    },
    {
        " book on The Nature of the Chemical Bond used the principles of quantum mechanics to deduce ": null
    },
    {
        "bond angles": "Bond Angle"
    },
    {
        " in ever-more complicated molecules. Paulings work culminated in the physical modelling of ": null
    },
    {
        "DNA": "Dna"
    },
    {
        ", the secret of life . In the same year, the ": null
    },
    {
        "Miller–Urey experiment": "Miller–Urey Experiment"
    },
    {
        " demonstrated in a simulation of primordial processes, that basic constituents of proteins, simple ": null
    },
    {
        "amino acids": "Amino Acid"
    },
    {
        ", could themselves be built up from simpler molecules.          Geology existed as a cloud of isolated, disconnected ideas about rocks, minerals, and landforms long before it became a coherent science. ": null
    },
    {
        "Theophrastus": "Theophrastus"
    },
    {
        " work on rocks, Peri lithōn, remained authoritative for millennia: its interpretation of fossils was not overturned until after the Scientific Revolution. Chinese polymath ": null
    },
    {
        "Shen Kua": "Shen Kua"
    },
    {
        " first formulated hypotheses for the process of land formation. Based on his observation of fossils in a geological ": null
    },
    {
        "stratum": "Stratum"
    },
    {
        " in a mountain hundreds of miles from the ocean, he deduced that the land was formed by erosion of the mountains and by ": null
    },
    {
        "deposition": "Deposition"
    },
    {
        " of silt.          Geology did not undergo systematic restructuring during the ": null
    },
    {
        "Scientific Revolution": "Scientific Revolution"
    },
    {
        ", but individual theorists made important contributions. ": null
    },
    {
        "Robert Hooke": "Robert Hooke"
    },
    {
        ", for example, formulated a theory of earthquakes, and ": null
    },
    {
        "Nicholas Steno": "Nicholas Steno"
    },
    {
        " developed the theory of ": null
    },
    {
        "superposition": "Law Of Superposition"
    },
    {
        " and argued that ": null
    },
    {
        "fossils": "Fossils"
    },
    {
        " were the remains of once-living creatures. Beginning with ": null
    },
    {
        "Thomas Burnets": "Thomas Burnet"
    },
    {
        " Sacred Theory of the Earth in 1681, natural philosophers began to explore the idea that the Earth had changed over time. Burnet and his contemporaries interpreted Earths past in terms of events described in the Bible, but their work laid the intellectual foundations for secular interpretations of Earth history.          Modern geology, like modern chemistry, gradually evolved during the 18th and early 19th centuries. ": null
    },
    {
        "Benoît de Maillet": "Benoît De Maillet"
    },
    {
        " and the ": null
    },
    {
        "Comte de Buffon": "Georges-Louis Leclerc, Comte De Buffon"
    },
    {
        " saw the Earth as much older than the 6,000 years envisioned by biblical scholars. ": null
    },
    {
        "Jean-Étienne Guettard": "Jean-Étienne Guettard"
    },
    {
        " and ": null
    },
    {
        "Nicolas Desmarest": "Nicolas Desmarest"
    },
    {
        " hiked central France and recorded their observations on some of the first geological maps. Aided by chemical experimentation, naturalists such as Scotlands ": null
    },
    {
        "John Walker": "John Walker"
    },
    {
        ",  Swedens Torbern Bergman, and Germanys ": null
    },
    {
        "Abraham Werner": "Abraham Werner"
    },
    {
        " created comprehensive classification systems for rocks and minerals—a collective achievement that transformed geology into a cutting edge field by the end of the eighteenth century. These early geologists also proposed a generalized interpretations of Earth history that led ": null
    },
    {
        "James Hutton": "James Hutton"
    },
    {
        ", ": null
    },
    {
        "Georges Cuvier": "Georges Cuvier"
    },
    {
        " and ": null
    },
    {
        "Alexandre Brongniart": "Alexandre Brongniart"
    },
    {
        ", following in the steps of ": null
    },
    {
        "Steno": "Nicolas Steno"
    },
    {
        ", to argue that layers of rock could be dated by the fossils they contained: a principle first applied to the geology of the Paris Basin. The use of ": null
    },
    {
        "index fossils": "Index Fossil"
    },
    {
        " became a powerful tool for making geological maps, because it allowed geologists to correlate the rocks in one locality with those of similar age in other, distant localities. Over the first half of the 19th century, geologists such as ": null
    },
    {
        "Charles Lyell": "Charles Lyell"
    },
    {
        ", ": null
    },
    {
        "Adam Sedgwick": "Adam Sedgwick"
    },
    {
        ", and ": null
    },
    {
        "Roderick Murchison": "Roderick Murchison"
    },
    {
        " applied the new technique to rocks throughout Europe and eastern North America, setting the stage for more detailed, government-funded mapping projects in later decades.     Midway through the 19th century, the focus of geology shifted from description and classification to attempts to understand how the surface of the Earth had changed. The first comprehensive theories of mountain building were proposed during this period, as were the first modern theories of earthquakes and volcanoes. ": null
    },
    {
        "Louis Agassiz": "Louis Agassiz"
    },
    {
        " and others established the reality of continent-covering ": null
    },
    {
        "ice ages": "Ice Age"
    },
    {
        ", and fluvialists like ": null
    },
    {
        "Andrew Crombie Ramsay": "Andrew Crombie Ramsay"
    },
    {
        " argued that river valleys were formed, over millions of years by the rivers that flow through them. After the discovery of ": null
    },
    {
        "radioactivity": "Radioactivity"
    },
    {
        ", ": null
    },
    {
        "radiometric dating": "Radiometric Dating"
    },
    {
        " methods were developed, starting in the 20th century. ": null
    },
    {
        "Alfred Wegeners": "Alfred Wegener"
    },
    {
        " theory of continental drift was widely dismissed when he proposed it in the 1910s, but new data gathered in the 1950s and 1960s led to the theory of ": null
    },
    {
        "plate tectonics": "Plate Tectonics"
    },
    {
        ", which provided a plausible mechanism for it. Plate tectonics also provided a unified explanation for a wide range of seemingly unrelated geological phenomena. Since 1970 it has served as the unifying principle in geology.     Geologists embrace of ": null
    },
    {
        "plate tectonics": "Plate Tectonics"
    },
    {
        " became part of a broadening of the field from a study of rocks into a study of the Earth as a planet. Other elements of this transformation include: geophysical studies of the interior of the Earth, the grouping of geology with ": null
    },
    {
        "meteorology": "Meteorology"
    },
    {
        " and ": null
    },
    {
        "oceanography": "Oceanography"
    },
    {
        " as one of the earth sciences , and comparisons of Earth and the solar systems other rocky planets.          ": null
    },
    {
        "Aristarchus of Samos": "Aristarchus Of Samos"
    },
    {
        " published ": null
    },
    {
        "work": "Aristarchus On The Sizes And Distances"
    },
    {
        " on how to determine the sizes and distances of the Sun and the Moon, and ": null
    },
    {
        "Eratosthenes": "Eratosthenes"
    },
    {
        " used this work to figure the size of the Earth. ": null
    },
    {
        "Hipparchus": "Hipparchus"
    },
    {
        " later discovered the ": null
    },
    {
        "precession": "Precession"
    },
    {
        " of the Earth.     Advances in astronomy and in optical systems in the 19th century resulted in the first observation of an ": null
    },
    {
        "asteroid": "Asteroid"
    },
    {
        "  in 1801, and the discovery of ": null
    },
    {
        "Neptune": "Neptune"
    },
    {
        " in 1846.     In 1925, ": null
    },
    {
        "Cecilia Payne-Gaposchkin": "Cecilia Payne-Gaposchkin"
    },
    {
        " determined that stars were composed mostly of hydrogen and helium. Erik Gregersen. “Cecilia Payne-Gaposchkin | American Astronomer.” Encyclopædia Britannica, . She was dissuaded by astronomer ": null
    },
    {
        "Henry Norris Russell": "Henry Norris Russell"
    },
    {
        " from publishing this finding in her Ph.D.thesis because of the widely held belief that stars had the same composition as the Earth. Rachael Padman. “Cecilia Payne-Gaposchkin .” Newnham College Biographies, 2004, . However, four years later, in 1929, ": null
    },
    {
        "Henry Norris Russell": "Henry Norris Russell"
    },
    {
        " came to the same conclusion through different reasoning and the discovery was eventually accepted.     ": null
    },
    {
        "George Gamow": "George Gamow"
    },
    {
        ", ": null
    },
    {
        "Ralph Alpher": "Ralph Alpher"
    },
    {
        ", and ": null
    },
    {
        "Robert Herman": "Robert Herman"
    },
    {
        " had calculated that there should be evidence for a Big Bang in the background temperature of the universe.   In 1964, ": null
    },
    {
        "Arno Penzias": "Arno Penzias"
    },
    {
        " and ": null
    },
    {
        "Robert Wilson": "Robert Woodrow Wilson"
    },
    {
        "  discovered a 3  Kelvin background hiss in their ": null
    },
    {
        "Bell Labs": "Bell Labs"
    },
    {
        " radiotelescope": "Radiotelescope"
    },
    {
        " , which was evidence for this hypothesis, and formed the basis for a number of results that helped determine the ": null
    },
    {
        "age of the universe": "Age Of The Universe"
    },
    {
        ".     Supernova ": null
    },
    {
        "SN1987A": "Sn1987A"
    },
    {
        " was observed by astronomers on Earth both visually, and in a triumph for ": null
    },
    {
        "neutrino astronomy": "Neutrino Astronomy"
    },
    {
        ", by the solar neutrino detectors at ": null
    },
    {
        "Kamiokande": "Kamiokande"
    },
    {
        ". But the solar neutrino flux was ": null
    },
    {
        "a fraction of its theoretically expected value": "Solar Neutrino Problem"
    },
    {
        ". This discrepancy forced a change in some values in the ": null
    },
    {
        "standard model": "Standard Model"
    },
    {
        " for ": null
    },
    {
        "particle physics": "Particle Physics"
    },
    {
        ".               ": null
    },
    {
        "William Harvey": "William Harvey"
    },
    {
        " published De Motu Cordis in 1628, which revealed his conclusions based on his extensive studies of vertebrate circulatory systems. He identified the central role of the heart, arteries, and veins in producing blood movement in a circuit, and   failed to find any confirmation of Galens pre-existing notions of heating and cooling functions. Power, dArcey. Life of Harvey. Longmans, Green, & co. The history of early modern biology and medicine is often told through the search for the seat of the soul.  Galen in his descriptions of his foundational work in medicine presents the distinctions between arteries, veins, and nerves using the vocabulary of the soul.      In 1847, Hungarian physician ": null
    },
    {
        "Ignác Fülöp Semmelweis": "Ignaz Semmelweis"
    },
    {
        " dramatically reduced the occurrency of ": null
    },
    {
        "puerperal fever": "Puerperal Fever"
    },
    {
        " by simply requiring physicians to wash their hands before attending to women in childbirth. This discovery predated the ": null
    },
    {
        "germ theory of disease": "Germ Theory Of Disease"
    },
    {
        ". However, Semmelweis findings were not appreciated by his contemporaries and handwashing came into use only with discoveries by British surgeon ": null
    },
    {
        "Joseph Lister": "Joseph Lister, 1St Baron Lister"
    },
    {
        ", who in 1865 proved the principles of ": null
    },
    {
        "antisepsis": "Antisepsis"
    },
    {
        ". Listers work was based on the important findings by French biologist ": null
    },
    {
        "Louis Pasteur": "Louis Pasteur"
    },
    {
        ". Pasteur was able to link microorganisms with disease, revolutionizing medicine. He also devised one of the most important methods in ": null
    },
    {
        "preventive medicine": "Preventive Medicine"
    },
    {
        ", when in 1880 he produced a ": null
    },
    {
        "vaccine": "Vaccine"
    },
    {
        " against ": null
    },
    {
        "rabies": "Rabies"
    },
    {
        ". Pasteur invented the process of ": null
    },
    {
        "pasteurization": "Pasteurization"
    },
    {
        ", to help prevent the spread of disease through milk and other foods.      Perhaps the most prominent, controversial and far-reaching theory in all of science has been the theory of ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        " by ": null
    },
    {
        "natural selection": "Natural Selection"
    },
    {
        " put forward by the English naturalist ": null
    },
    {
        "Charles Darwin": "Charles Darwin"
    },
    {
        " in his book  On the Origin of Species  in 1859. He proposed that the features of all living things, including humans, were shaped by natural processes over long periods of time. The theory of evolution in its current form affects almost all areas of biology.  Implications of evolution on fields outside of pure science have led to both ": null
    },
    {
        "opposition and support": "Social Effect Of Evolutionary Theory"
    },
    {
        " from different parts of society, and profoundly influenced the popular understanding of mans place in the universe . In the early 20th century, the study of heredity became a major investigation after the rediscovery in 1900 of the laws of inheritance developed by the ": null
    },
    {
        "Moravia": "Moravia"
    },
    {
        "n  monk ": null
    },
    {
        "Gregor Mendel": "Gregor Mendel"
    },
    {
        " in 1866. Mendels laws provided the beginnings of the study of ": null
    },
    {
        "genetics": "Genetics"
    },
    {
        ", which became a major field of research for both scientific and industrial research. By 1953, ": null
    },
    {
        "James D. Watson": "James D. Watson"
    },
    {
        ", ": null
    },
    {
        "Francis Crick": "Francis Crick"
    },
    {
        " and ": null
    },
    {
        "Maurice Wilkins": "Maurice Wilkins"
    },
    {
        " clarified the basic structure of DNA, the ": null
    },
    {
        "genetic material": "Genetic Material"
    },
    {
        " for expressing life in all its forms. James D. Watson and Francis H. Crick. Letters to Nature Nature  171, 737–738 . In the late 20th century, the possibilities of ": null
    },
    {
        "genetic engineering": "Genetic Engineering"
    },
    {
        " became practical for the first time, and a massive international effort began in 1990 to map out an entire human ": null
    },
    {
        "genome": "Genome"
    },
    {
        " .             The discipline of ": null
    },
    {
        "ecology": "Ecology"
    },
    {
        " typically traces its origin to the synthesis of ": null
    },
    {
        "Darwinian evolution": "Evolution"
    },
    {
        " and ": null
    },
    {
        "Humboldtian": "Humboldtian Science"
    },
    {
        " biogeography": "Biogeography"
    },
    {
        ", in the late 19th and early 20th centuries. Equally important in the rise of ecology, however, were ": null
    },
    {
        "microbiology": "Microbiology"
    },
    {
        " and ": null
    },
    {
        "soil science": "Soil Science"
    },
    {
        "—particularly the ": null
    },
    {
        "cycle of life": "Biogeochemical Cycle"
    },
    {
        " concept, prominent in the work ": null
    },
    {
        "Louis Pasteur": "Louis Pasteur"
    },
    {
        " and ": null
    },
    {
        "Ferdinand Cohn": "Ferdinand Cohn"
    },
    {
        ". The word ecology was coined by ": null
    },
    {
        "Ernst Haeckel": "Ernst Haeckel"
    },
    {
        ", whose particularly holistic view of nature in general was important in the spread of ecological thinking. In the 1930s, ": null
    },
    {
        "Arthur Tansley": "Arthur Tansley"
    },
    {
        " and others began developing the field of ": null
    },
    {
        "ecosystem ecology": "Ecosystem Ecology"
    },
    {
        ", which combined experimental soil science with physiological concepts of energy and the techniques of ": null
    },
    {
        "field biology": "Natural History"
    },
    {
        ".          Successful use of the scientific method in the physical sciences led to the same methodology being adapted to better understand the many fields of human endeavor. From this effort the social sciences have been developed.          Political science is a late arrival in terms of ": null
    },
    {
        "social sciences": "Social Sciences"
    },
    {
        ". However, the discipline has a clear set of antecedents such as ": null
    },
    {
        "moral philosophy": "Moral Philosophy"
    },
    {
        ", ": null
    },
    {
        "political philosophy": "Political Philosophy"
    },
    {
        ", ": null
    },
    {
        "political economy": "Political Economy"
    },
    {
        ", history, and other fields concerned with ": null
    },
    {
        "normative": "Norm"
    },
    {
        " determinations of what ought to be and with ": null
    },
    {
        "deducing": "Deductive Reasoning"
    },
    {
        " the characteristics and functions of the ideal form of ": null
    },
    {
        "government": "Forms Of Government"
    },
    {
        ". The roots of politics are in ": null
    },
    {
        "prehistory": "Prehistory"
    },
    {
        ". In each historic period and in almost every geographic area, we can find someone studying politics and increasing political understanding.     In ": null
    },
    {
        "Western culture": "Western Culture"
    },
    {
        ", the study of politics is first found in ": null
    },
    {
        "Ancient Greece": "Ancient Greece"
    },
    {
        ". The antecedents of European politics trace their roots back even earlier than ": null
    },
    {
        "Plato": "Plato"
    },
    {
        " and ": null
    },
    {
        "Aristotle": "Aristotle"
    },
    {
        ", particularly in the works of ": null
    },
    {
        "Homer": "Homer"
    },
    {
        ", ": null
    },
    {
        "Hesiod": "Hesiod"
    },
    {
        ", ": null
    },
    {
        "Thucydides": "Thucydides"
    },
    {
        ", ": null
    },
    {
        "Xenophon": "Xenophon"
    },
    {
        ", and ": null
    },
    {
        "Euripides": "Euripides"
    },
    {
        ". Later, Plato analyzed political systems, abstracted their analysis from more ": null
    },
    {
        "literary": "Literary"
    },
    {
        "- and history- oriented studies and applied an approach we would understand as closer to ": null
    },
    {
        "philosophy": "Philosophy"
    },
    {
        ". Similarly, Aristotle built upon Platos analysis to include historical empirical evidence in his analysis.     An ancient Indian ": null
    },
    {
        "treatise": "Treatise"
    },
    {
        " on ": null
    },
    {
        "statecraft": "Public Administration"
    },
    {
        ", ": null
    },
    {
        "economic": "Economics"
    },
    {
        " policy and ": null
    },
    {
        "military strategy": "Military Strategy"
    },
    {
        " by Kautilya   and , Mabbett 1964 Trautmann 1971:5 the very last verse of the work...is the unique instance of the personal name  rather than the  gotra  name  in the Arthaśāstra. who are traditionally identified with  . In this treatise, the behaviors and relationships of the people, the King, the State, the Government Superintendents, Courtiers, Enemies, Invaders, and Corporations are analysed and documented. ": null
    },
    {
        "Roger Boesche": "Roger Boesche"
    },
    {
        " describes the Arthaśāstra as a book of political realism, a book analysing how the political world does work and not very often stating how it ought to work, a book that frequently discloses to a king what calculating and sometimes brutal measures he must carry out to preserve the state and the common good.      During the rule of Rome, famous historians such as ": null
    },
    {
        "Polybius": "Polybius"
    },
    {
        ", ": null
    },
    {
        "Livy": "Livy"
    },
    {
        " and ": null
    },
    {
        "Plutarch": "Plutarch"
    },
    {
        " documented the rise of the ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        ", and the organization and histories of other nations, while ": null
    },
    {
        "statesmen": "Politician"
    },
    {
        " like ": null
    },
    {
        "Julius Caesar": "Julius Caesar"
    },
    {
        ", ": null
    },
    {
        "Cicero": "Cicero"
    },
    {
        " and others provided us with examples of the politics of the republic and Romes empire and wars. The study of politics during this age was oriented toward understanding history, understanding methods of governing, and describing the operation of governments.     With the ": null
    },
    {
        "fall of the Western Roman Empire": "Fall Of The Western Roman Empire"
    },
    {
        ", there arose a more diffuse arena for political studies. The rise of ": null
    },
    {
        "monotheism": "Monotheism"
    },
    {
        " and, particularly for the Western tradition, ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", brought to light a new space for politics and political action. During the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", the study of politics was widespread in the churches and courts. Works such as ": null
    },
    {
        "Augustine of Hippos": "Augustine Of Hippo"
    },
    {
        "  The City of God  synthesized current philosophies and political traditions with those of ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        ", redefining the borders between what was religious and what was political. Most of the political questions surrounding the relationship between ": null
    },
    {
        "Church and State": "Religion And Politics"
    },
    {
        " were clarified and contested in this period.     In the Middle East and later other ": null
    },
    {
        "Islam": "Islam"
    },
    {
        "ic areas, works such as the ": null
    },
    {
        "Rubaiyat of Omar Khayyam": "Rubaiyat Of Omar Khayyam"
    },
    {
        " and Epic of Kings by ": null
    },
    {
        "Ferdowsi": "Ferdowsi"
    },
    {
        " provided evidence of political analysis, while the Islamic ": null
    },
    {
        "Aristotelians": "Aristotelians"
    },
    {
        " such as ": null
    },
    {
        "Avicenna": "Avicenna"
    },
    {
        " and later ": null
    },
    {
        "Maimonides": "Maimonides"
    },
    {
        " and ": null
    },
    {
        "Averroes": "Averroes"
    },
    {
        ", continued ": null
    },
    {
        "Aristotles": "Aristotle"
    },
    {
        " tradition of analysis and ": null
    },
    {
        "empiricism": "Empiricism"
    },
    {
        ", writing commentaries on Aristotles works.     During the ": null
    },
    {
        "Italian Renaissance": "Italian Renaissance"
    },
    {
        ", ": null
    },
    {
        "Niccolò Machiavelli": "Niccolò Machiavelli"
    },
    {
        " established the emphasis of modern political science on direct ": null
    },
    {
        "empirical": "Empirical"
    },
    {
        " observation": "Observation"
    },
    {
        " of political ": null
    },
    {
        "institutions": "Institution"
    },
    {
        " and actors. Later, the expansion of the scientific paradigm during the ": null
    },
    {
        "Enlightenment": "The Age Of Enlightenment"
    },
    {
        " further pushed the study of politics beyond normative determinations. In particular, the study of ": null
    },
    {
        "statistics": "Statistics"
    },
    {
        ", to study the subjects of the ": null
    },
    {
        "state": "Sovereign State"
    },
    {
        ", has been applied to ": null
    },
    {
        "polling": "Opinion Poll"
    },
    {
        " and ": null
    },
    {
        "voting": "Voting"
    },
    {
        ".     In the 20th century, the study of ideology, behaviouralism and international relations led to a multitude of pol-sci subdisciplines including ": null
    },
    {
        "rational choice theory": "Rational Choice Theory"
    },
    {
        ", ": null
    },
    {
        "voting theory": "Voting Theory"
    },
    {
        ", ": null
    },
    {
        "game theory": "Game Theory"
    },
    {
        " , ": null
    },
    {
        "psephology": "Psephology"
    },
    {
        ", ": null
    },
    {
        "political geography": "Political Geography"
    },
    {
        "/": null
    },
    {
        "geopolitics": "Geopolitics"
    },
    {
        ", ": null
    },
    {
        "political psychology": "Political Psychology"
    },
    {
        "/": null
    },
    {
        "political sociology": "Political Sociology"
    },
    {
        ", ": null
    },
    {
        "political economy": "Political Economy"
    },
    {
        ", ": null
    },
    {
        "policy analysis": "Policy Analysis"
    },
    {
        ", ": null
    },
    {
        "public administration": "Public Administration"
    },
    {
        ", comparative political analysis and ": null
    },
    {
        "peace studies": "Peace Studies"
    },
    {
        "/conflict analysis.          ": null
    },
    {
        "Historical linguistics": "Historical Linguistics"
    },
    {
        " emerged as an independent field of study at the end of the 18th century. ": null
    },
    {
        "Sir William Jones": "William Jones"
    },
    {
        " proposed that ": null
    },
    {
        "Sanskrit": "Sanskrit"
    },
    {
        ", ": null
    },
    {
        "Persian": "Persian Language"
    },
    {
        ", ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        ", ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ", ": null
    },
    {
        "Gothic": "Gothic Language"
    },
    {
        ", and ": null
    },
    {
        "Celtic languages": "Celtic Languages"
    },
    {
        " all shared a common base. After Jones, an effort to catalog all languages of the world was made throughout the 19th century and into the 20th century. Publication of ": null
    },
    {
        "Ferdinand de Saussures": "Ferdinand De Saussure"
    },
    {
        "  Cours de linguistique générale  created the development of ": null
    },
    {
        "descriptive linguistics": "Descriptive Linguistics"
    },
    {
        ". Descriptive linguistics, and the related ": null
    },
    {
        "structuralism": "Structuralism"
    },
    {
        " movement caused linguistics to focus on how language changes over time, instead of just describing the differences between languages. ": null
    },
    {
        "Noam Chomsky": "Noam Chomsky"
    },
    {
        " further diversified linguistics with the development of ": null
    },
    {
        "generative linguistics": "Generative Linguistics"
    },
    {
        " in the 1950s. His effort is based upon a mathematical model of language that allows for the description and prediction of valid ": null
    },
    {
        "syntax": "Syntax"
    },
    {
        ". Additional specialties such as ": null
    },
    {
        "sociolinguistics": "Sociolinguistics"
    },
    {
        ", ": null
    },
    {
        "cognitive linguistics": "Cognitive Linguistics"
    },
    {
        ", and ": null
    },
    {
        "computational linguistics": "Computational Linguistics"
    },
    {
        " have emerged from collaboration between linguistics and other disciplines.                The basis for ": null
    },
    {
        "classical economics": "Classical Economics"
    },
    {
        " forms ": null
    },
    {
        "Adam Smiths": "Adam Smith"
    },
    {
        "  An Inquiry into the Nature and Causes of the Wealth of Nations , published in 1776. Smith criticized ": null
    },
    {
        "mercantilism": "Mercantilism"
    },
    {
        ", advocating a system of free trade with ": null
    },
    {
        "division of labour": "Division Of Labour"
    },
    {
        ". He postulated an ": null
    },
    {
        "invisible hand": "Invisible Hand"
    },
    {
        " that regulated economic systems made up of actors guided only by self-interest. ": null
    },
    {
        "Karl Marx": "Karl Marx"
    },
    {
        " developed an alternative economic theory, called ": null
    },
    {
        "Marxian economics": "Marxian Economics"
    },
    {
        ". Marxian economics is based on the ": null
    },
    {
        "labor theory of value": "Labor Theory Of Value"
    },
    {
        " and assumes the value of good to be based on the amount of labor required to produce it. Under this assumption, ": null
    },
    {
        "capitalism": "Capitalism"
    },
    {
        " was based on employers not paying the full value of workers labor to create profit. The ": null
    },
    {
        "Austrian School": "Austrian School"
    },
    {
        " responded to Marxian economics by viewing ": null
    },
    {
        "entrepreneurship": "Entrepreneurship"
    },
    {
        " as driving force of economic development. This replaced the labor theory of value by a system of ": null
    },
    {
        "supply and demand": "Supply And Demand"
    },
    {
        ".     In the 1920s, ": null
    },
    {
        "John Maynard Keynes": "John Maynard Keynes"
    },
    {
        " prompted a division between ": null
    },
    {
        "microeconomics": "Microeconomics"
    },
    {
        " and ": null
    },
    {
        "macroeconomics": "Macroeconomics"
    },
    {
        ". Under ": null
    },
    {
        "Keynesian economics": "Keynesian Economics"
    },
    {
        " macroeconomic trends can overwhelm economic choices made by individuals. Governments should promote ": null
    },
    {
        "aggregate demand": "Aggregate Demand"
    },
    {
        " for goods as a means to encourage economic expansion. Following World War II, ": null
    },
    {
        "Milton Friedman": "Milton Friedman"
    },
    {
        " created the concept of ": null
    },
    {
        "monetarism": "Monetarism"
    },
    {
        ". Monetarism focuses on using the supply and demand of money as a method for controlling economic activity. In the 1970s, monetarism has adapted into ": null
    },
    {
        "supply-side economics": "Supply-Side Economics"
    },
    {
        " which advocates reducing taxes as a means to increase the amount of money available for economic expansion.     Other modern schools of economic thought are ": null
    },
    {
        "New Classical economics": "New Classical Economics"
    },
    {
        " and ": null
    },
    {
        "New Keynesian economics": "New Keynesian Economics"
    },
    {
        ". New Classical economics was developed in the 1970s, emphasizing solid microeconomics as the basis for macroeconomic growth. New Keynesian economics was created partially in response to New Classical economics, and deals with how inefficiencies in the market create a need for control by a central bank or government.     The above history of economics reflects modern economic textbooks and this means that the last stage of a science is represented as the culmination of its history . The ": null
    },
    {
        "invisible hand": "Invisible Hand"
    },
    {
        " mentioned in a lost page in the middle of a chapter in the middle of the ": null
    },
    {
        "Wealth of Nations": "Wealth Of Nations"
    },
    {
        " , 1776, advances as Smiths central message. It is played down that this invisible hand acts only frequently and that it is no part of his intentions because competition leads to lower prices by imitating his invention. That this invisible hand prefers the support of domestic to foreign industry is cleansed—often without indication that part of the citation is truncated. Compare Smiths original phrase with ": null
    },
    {
        "Samuelsons": "Paul Samuelson"
    },
    {
        " quotation of it. In brackets what Samuelson curtailed without indication and without giving a reference:   every individual … neither intends to promote the general interest, nor knows how much he is promoting it. he intends only his own security, his own gain; and he is in this, led by an invisible hand to promote an end which was no part of his intention. By pursuing his own interest, he frequently promotes that of the society more effectually than when he really intends to promote it Samuelson, Paul A./Nordhaus, William D., 1989, ": null
    },
    {
        "Economics": "Economics"
    },
    {
        ", 13th edition, New York: McGraw-Hill, p. 825; Smith, Adam, 1937, The Wealth of Nations, N.Y.: Random House, p. 423 The opening passage of the Wealth containing Smiths message is never mentioned as it cannot be integrated into modern theory: Wealth depends on the division of labour which changes with market volume and on the proportion of productive to ": null
    },
    {
        "Unproductive labor": "Unproductive Labor"
    },
    {
        ".          The end of the 19th century marks the start of psychology as a scientific enterprise. The year 1879 is commonly seen as the start of psychology as an independent field of study. In that year ": null
    },
    {
        "Wilhelm Wundt": "Wilhelm Wundt"
    },
    {
        " founded the first laboratory dedicated exclusively to psychological research . Other important early contributors to the field include ": null
    },
    {
        "Hermann Ebbinghaus": "Hermann Ebbinghaus"
    },
    {
        " , ": null
    },
    {
        "Ivan Pavlov": "Ivan Pavlov"
    },
    {
        " , ": null
    },
    {
        "William James": "William James"
    },
    {
        ", and ": null
    },
    {
        "Sigmund Freud": "Sigmund Freud"
    },
    {
        ". Freuds influence has been enormous, though more as cultural icon than a force in scientific psychology.     The 20th century saw a rejection of Freuds theories as being too unscientific, and a reaction against ": null
    },
    {
        "Edward Titcheners": "Edward Titchener"
    },
    {
        " atomistic approach of the mind. This led to the formulation of ": null
    },
    {
        "behaviorism": "Behaviorism"
    },
    {
        " by ": null
    },
    {
        "John B. Watson": "John B. Watson"
    },
    {
        ", which was popularized by ": null
    },
    {
        "B.F. Skinner": "B.F. Skinner"
    },
    {
        ". Behaviorism proposed ": null
    },
    {
        "epistemologically": "Epistemology"
    },
    {
        " limiting psychological study to overt behavior, since that could be reliably measured. Scientific knowledge of the mind was considered too metaphysical, hence impossible to achieve.     The final decades of the 20th century have seen the rise of a new interdisciplinary approach to studying human psychology, known collectively as ": null
    },
    {
        "cognitive science": "Cognitive Science"
    },
    {
        ". Cognitive science again considers the mind as a subject for investigation, using the tools of ": null
    },
    {
        "psychology": "Psychology"
    },
    {
        ", ": null
    },
    {
        "linguistics": "Linguistics"
    },
    {
        ", ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        ", ": null
    },
    {
        "philosophy": "Philosophy"
    },
    {
        ", and ": null
    },
    {
        "neurobiology": "Neurobiology"
    },
    {
        ". New methods of visualizing the activity of the brain, such as ": null
    },
    {
        "PET scans": "Pet Scan"
    },
    {
        " and ": null
    },
    {
        "CAT scans": "Cat Scan"
    },
    {
        ", began to exert their influence as well, leading some researchers to investigate the mind by investigating the brain, rather than cognition. These new forms of investigation assume that a wide understanding of the human mind is possible, and that such an understanding may be applied to other research domains, such as ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        ".          ": null
    },
    {
        "Ibn Khaldun": "Ibn Khaldun"
    },
    {
        " can be regarded as the earliest scientific systematic sociologist. Muhammed Abdullah Enan, Ibn Khaldun: His Life and Works, The Other Press, 2007, pp. 104–105. . The modern sociology emerged in the early 19th century as the academic response to the modernization of the world. Among many early sociologists , the aim of sociology was in ": null
    },
    {
        "structuralism": "Structural Functionalism"
    },
    {
        ", understanding the cohesion of social groups, and developing an antidote to social disintegration. ": null
    },
    {
        "Max Weber": "Max Weber"
    },
    {
        " was concerned with the modernization of society through the concept of ": null
    },
    {
        "rationalization": "Rationalization"
    },
    {
        ", which he believed would trap individuals in an iron cage of rational thought. Some sociologists, including ": null
    },
    {
        "Georg Simmel": "Georg Simmel"
    },
    {
        " and ": null
    },
    {
        "W. E. B. Du Bois": "W. E. B. Du Bois"
    },
    {
        ", utilized more ": null
    },
    {
        "microsociological": "Microsociology"
    },
    {
        ", qualitative analyses. This microlevel approach played an important role in American sociology, with the theories of ": null
    },
    {
        "George Herbert Mead": "George Herbert Mead"
    },
    {
        " and his student ": null
    },
    {
        "Herbert Blumer": "Herbert Blumer"
    },
    {
        " resulting in the creation of the ": null
    },
    {
        "symbolic interactionism": "Symbolic Interactionism"
    },
    {
        " approach to sociology.     In particular, just Auguste Comte, illustrated with his work the transition from a theological to a metaphysical stage and, from this, to a positive stage. Comte took care of the classification of the sciences as well as a transit of humanity towards a situation of progress attributable to a re-examination of nature according to the affirmation of sociality as the basis of the scientifically interpreted society.      American sociology in the 1940s and 1950s was dominated largely by ": null
    },
    {
        "Talcott Parsons": "Talcott Parsons"
    },
    {
        ", who argued that aspects of society that promoted structural integration were therefore functional . This ": null
    },
    {
        "structural functionalism": "Structural Functionalism"
    },
    {
        " approach was questioned in the 1960s, when sociologists came to see this approach as merely a justification for inequalities present in the status quo. In reaction, ": null
    },
    {
        "conflict theory": "Conflict Theory"
    },
    {
        " was developed, which was based in part on the philosophies of ": null
    },
    {
        "Karl Marx": "Karl Marx"
    },
    {
        ". Conflict theorists saw society as an arena in which different groups compete for control over resources. Symbolic interactionism also came to be regarded as central to sociological thinking. ": null
    },
    {
        "Erving Goffman": "Erving Goffman"
    },
    {
        " saw social interactions as a stage performance, with individuals preparing backstage and attempting to control their audience through ": null
    },
    {
        "impression management": "Impression Management"
    },
    {
        ". While these theories are currently prominent in sociological thought, other approaches exist, including ": null
    },
    {
        "feminist theory": "Feminist Theory"
    },
    {
        ", ": null
    },
    {
        "post-structuralism": "Post-Structuralism"
    },
    {
        ", ": null
    },
    {
        "rational choice theory": "Rational Choice Theory"
    },
    {
        ", and ": null
    },
    {
        "postmodernism": "Postmodernism"
    },
    {
        ".          Anthropology can best be understood as an outgrowth of the ": null
    },
    {
        "Age of Enlightenment": "Age Of Enlightenment"
    },
    {
        ". It was during this period that Europeans attempted systematically to study human behaviour. Traditions of jurisprudence, history, philology and sociology developed during this time and informed the development of the social sciences of which anthropology was a part.     At the same time, the romantic reaction to the Enlightenment produced thinkers such as ": null
    },
    {
        "Johann Gottfried Herder": "Johann Gottfried Herder"
    },
    {
        " and later ": null
    },
    {
        "Wilhelm Dilthey": "Wilhelm Dilthey"
    },
    {
        " whose work formed the basis for the ": null
    },
    {
        "culture": "Culture"
    },
    {
        " concept which is central to the discipline. Traditionally, much of the history of the subject was based on ": null
    },
    {
        "colonial": "Colonialism"
    },
    {
        " encounters between Western Europe and the rest of the world, and much of 18th- and 19th-century anthropology is now classed as ": null
    },
    {
        "scientific racism": "Scientific Racism"
    },
    {
        ".     During the late 19th-century, battles over the study of man took place between those of an anthropological persuasion  and those of an ": null
    },
    {
        "ethnological": "Ethnology"
    },
    {
        " persuasion , and these distinctions became part of the later divide between ": null
    },
    {
        "physical anthropology": "Physical Anthropology"
    },
    {
        " and ": null
    },
    {
        "cultural anthropology": "Cultural Anthropology"
    },
    {
        ", the latter ushered in by the students of ": null
    },
    {
        "Franz Boas": "Franz Boas"
    },
    {
        ".     In the mid-20th century, much of the methodologies of earlier anthropological and ethnographical study were reevaluated with an eye towards research ethics, while at the same time the scope of investigation has broadened far beyond the traditional study of primitive cultures .     The emergence of ": null
    },
    {
        "paleoanthropology": "Paleoanthropology"
    },
    {
        ", a scientific discipline which draws on the ": null
    },
    {
        "methodologies": "Methodology"
    },
    {
        " of ": null
    },
    {
        "paleontology": "Paleontology"
    },
    {
        ", ": null
    },
    {
        "physical anthropology": "Physical Anthropology"
    },
    {
        " and ": null
    },
    {
        "ethology": "Ethology"
    },
    {
        ", among other disciplines, and increasing in scope and momentum from the mid-20th century, continues to yield further insights into human origins, evolution, genetic and cultural heritage, and perspectives on the contemporary human predicament as well.       During the 20th century, a number of interdisciplinary scientific fields have emerged. Examples include:     ": null
    },
    {
        "Communication studies": "Communication Studies"
    },
    {
        " combines ": null
    },
    {
        "animal communication": "Animal Communication"
    },
    {
        ", ": null
    },
    {
        "information theory": "Information Theory"
    },
    {
        ", ": null
    },
    {
        "marketing": "Marketing"
    },
    {
        ", ": null
    },
    {
        "public relations": "Public Relations"
    },
    {
        ", ": null
    },
    {
        "telecommunications": "Telecommunication"
    },
    {
        " and other forms of communication.     ": null
    },
    {
        "Computer science": "Computer Science"
    },
    {
        ", built upon a foundation of ": null
    },
    {
        "theoretical linguistics": "Theoretical Linguistics"
    },
    {
        ", ": null
    },
    {
        "discrete mathematics": "Discrete Mathematics"
    },
    {
        ", and ": null
    },
    {
        "electrical engineering": "Electrical Engineering"
    },
    {
        ", studies the nature and limits of computation. Subfields include ": null
    },
    {
        "computability": "Computability Theory"
    },
    {
        ", ": null
    },
    {
        "computational complexity": "Computational Complexity Theory"
    },
    {
        ", ": null
    },
    {
        "database": "Database"
    },
    {
        " design, ": null
    },
    {
        "computer networking": "Computer Networking"
    },
    {
        ", ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        ", and the design of ": null
    },
    {
        "computer hardware": "Computer Hardware"
    },
    {
        ". One area in which advances in computing have contributed to more general scientific development is by facilitating large-scale ": null
    },
    {
        "archiving of scientific data": "Scientific Data Archiving"
    },
    {
        ". Contemporary computer science typically distinguishes   itself by emphasising mathematical theory in contrast to the practical emphasis of ": null
    },
    {
        "software engineering": "Software Engineering"
    },
    {
        ".     ": null
    },
    {
        "Environmental science": "Environmental Science"
    },
    {
        " is an interdisciplinary field. It draws upon the disciplines of biology, chemistry, ": null
    },
    {
        "earth sciences": "Earth Sciences"
    },
    {
        ", ecology, geography, mathematics, and physics.     ": null
    },
    {
        "Materials science": "Materials Science"
    },
    {
        " has its roots in ": null
    },
    {
        "metallurgy": "Metallurgy"
    },
    {
        ", ": null
    },
    {
        "mineralogy": "Mineralogy"
    },
    {
        ", and ": null
    },
    {
        "crystallography": "Crystallography"
    },
    {
        ". It combines chemistry, physics, and several engineering disciplines. The field studies metals, ": null
    },
    {
        "ceramics": "Ceramic"
    },
    {
        ", ": null
    },
    {
        "glass": "Glass"
    },
    {
        ", ": null
    },
    {
        "plastics": "Plastic"
    },
    {
        ", ": null
    },
    {
        "semiconductors": "Semiconductor"
    },
    {
        ", and ": null
    },
    {
        "composite materials": "Composite Material"
    },
    {
        ".     ": null
    },
    {
        "Neuroscience": "Neuroscience"
    },
    {
        " is a multidisciplinary branch of science that combines ": null
    },
    {
        "physiology": "Neurophysiology"
    },
    {
        ", ": null
    },
    {
        "neuroanatomy": "Neuroanatomy"
    },
    {
        ", ": null
    },
    {
        "molecular biology": "Molecular Neuroscience"
    },
    {
        ", ": null
    },
    {
        "developmental biology": "Development Of The Nervous System"
    },
    {
        ", ": null
    },
    {
        "cytology": "Cellular Neuroscience"
    },
    {
        ", ": null
    },
    {
        "mathematical modeling": "Theoretical Neuroscience"
    },
    {
        " and ": null
    },
    {
        "psychology": "Psychology"
    },
    {
        " to understand the fundamental and emergent properties of ": null
    },
    {
        "neurons": "Neuron"
    },
    {
        ", ": null
    },
    {
        "glia": "Glia"
    },
    {
        ", ": null
    },
    {
        "nervous systems": "Nervous System"
    },
    {
        " and ": null
    },
    {
        "neural circuits": "Biological Neural Network"
    },
    {
        ".      ": null
    },
    {
        "Metascience": "Metascience"
    },
    {
        " is the use of scientific methodology to study science itself. Metascience seeks to increase the quality of research while reducing waste. The ": null
    },
    {
        "replication crisis": "Replication Crisis"
    },
    {
        " is the result of metascientific research.           As an academic field, ": null
    },
    {
        "history of science and technology": "History Of Science And Technology"
    },
    {
        " began with the publication of ": null
    },
    {
        "William Whewells": "William Whewell"
    },
    {
        " History of the Inductive Sciences . A more formal study of the history of science as an independent discipline was launched by ": null
    },
    {
        "George Sartons": "George Sarton"
    },
    {
        " publications, Introduction to the History of Science and the ": null
    },
    {
        "Isis journal": "Isis"
    },
    {
        " . Sarton exemplified the early 20th-century view of the history of science as the history of great men and great ideas. He shared with many of his contemporaries a ": null
    },
    {
        "Whiggish": "Whig Historyin The History Of Science"
    },
    {
        " belief in history as a record of the advances and delays in the march of progress. The history of science was not a recognized subfield of American history in this period, and most of the work was carried out by interested scientists and physicians rather than professional historians.  With the work of ": null
    },
    {
        "I. Bernard Cohen": "I. Bernard Cohen"
    },
    {
        " at Harvard, the history of science became an established subdiscipline of history after 1945.      The ": null
    },
    {
        "history of mathematics": "History Of Mathematics"
    },
    {
        ", ": null
    },
    {
        "history of technology": "History Of Technology"
    },
    {
        ", and ": null
    },
    {
        "history of philosophy": "History Of Philosophy"
    },
    {
        " are distinct areas of research and are covered in other articles. Mathematics is closely related to but distinct from natural science . Technology is likewise closely related to but clearly differs from the search for empirical truth.     History of science is an academic discipline, with an international community of specialists. Main professional organizations for this field include the ": null
    },
    {
        "History of Science Society": "History Of Science Society"
    },
    {
        ", the ": null
    },
    {
        "British Society for the History of Science": "British Society For The History Of Science"
    },
    {
        ", and the ": null
    },
    {
        "European Society for the History of Science": "European Society For The History Of Science"
    },
    {
        ".          Much of the study of the history of science has been devoted to answering questions about what science is, how it functions, and whether it exhibits large-scale patterns and trends.  The ": null
    },
    {
        "sociology of science": "Sociology Of Science"
    },
    {
        " in particular has focused on the ways in which scientists work, looking closely at the ways in which they produce and construct scientific knowledge. Since the 1960s, a common trend in ": null
    },
    {
        "science studies": "Science Studies"
    },
    {
        " has been to emphasize the human component of scientific knowledge, and to de-emphasize the view that scientific data are self-evident, value-free, and context-free.  The field of ": null
    },
    {
        "Science and Technology Studies": "Science And Technology Studies"
    },
    {
        ", an area that overlaps and often informs historical studies of science, focuses on the social context of science in both contemporary and historical periods.     ": null
    },
    {
        "Humboldtian science": "Humboldtian Science"
    },
    {
        " refers to the early 19th century approach of combining scientific field work with the age of ": null
    },
    {
        "Romanticism": "Romanticism"
    },
    {
        " sensitivity, ethics and aesthetic ideals. Böhme, Hartmut: Ästhetische Wissenschaft, in: Matices, Nr. 23, 1999, S. 37–41 It helped to install ": null
    },
    {
        "natural history": "Natural History"
    },
    {
        " as a separate field, gave base for ": null
    },
    {
        "ecology": "Ecology"
    },
    {
        " and was based on the role model of scientist, naturalist and explorer ": null
    },
    {
        "Alexander von Humboldt": "Alexander Von Humboldt"
    },
    {
        ". Jardine et al., Cultures of Natural History, p. 304 The later 19th century ": null
    },
    {
        "positivism": "Positivism"
    },
    {
        " asserted that all authentic knowledge allows verification and that all authentic knowledge assumes that the only valid knowledge is scientific. ": null
    },
    {
        "Jorge Larrain": "Jorge Larrain"
    },
    {
        " The Concept of Ideology , quotation:      A major subject of concern and controversy in the ": null
    },
    {
        "philosophy of science": "Philosophy Of Science"
    },
    {
        " has been the nature of theory change in science. ": null
    },
    {
        "Karl Popper": "Karl Popper"
    },
    {
        " argued that scientific knowledge is progressive and cumulative; ": null
    },
    {
        "Thomas Kuhn": "Thomas Kuhn"
    },
    {
        ", that scientific knowledge moves through ": null
    },
    {
        "paradigm shifts": "Paradigm Shift"
    },
    {
        " and is not necessarily progressive; and ": null
    },
    {
        "Paul Feyerabend": "Paul Feyerabend"
    },
    {
        ", that scientific knowledge is not cumulative or progressive and that there can be no ": null
    },
    {
        "demarcation": "Demarcation Problem"
    },
    {
        " in terms of method between science and any other form of investigation.      The mid 20th century saw a series of studies relying to the role of ": null
    },
    {
        "science in a social context": "Sociology Of Scientific Knowledge"
    },
    {
        ", starting from Thomas Kuhns  The Structure of Scientific Revolutions  in 1962. It opened the study of science to new disciplines by suggesting that the evolution of science was in part sociologically determined and that positivism did not explain the actual interactions and strategies of the human participants in science. As Thomas Kuhn put it, the history of science may be seen in more nuanced terms, such as that of competing paradigms or conceptual systems in a wider matrix that includes intellectual, cultural, economic and political themes outside of science. Partly by selection and partly by distortion, the scientists of earlier ages are implicitly presented as having worked upon the same set of fixed problems and in accordance with the same set of fixed canons that the most recent revolution in scientific theory and method made seem scientific. Kuhn, T., 1962, The Structure of Scientific Revolutions , University of Chicago Press, p. 137     Further studies, e.g. ": null
    },
    {
        "Jerome Ravetz": "Jerome Ravetz"
    },
    {
        " 1971 Scientific Knowledge and its Social Problems referred to the role of the scientific community, as a social construct, in accepting or rejecting scientific knowledge.  The ": null
    },
    {
        "Science wars": "Science Wars"
    },
    {
        " of the 1990 were about the influence of especially French philosophers, which denied the objectivity of science in general or seemed to do so. They described as well differences between the idealized model of a pure science and the actual scientific practice; while ": null
    },
    {
        "scientism": "Scientism"
    },
    {
        ", a revival of the positivism approach, saw in precise measurement and rigorous calculation the basis for finally settling enduring metaphysical and moral controversies.   However, more recently some of the leading critical theorists have recognized that their postmodern deconstructions have at times been counter-productive, and are providing intellectual ammunition for reactionary interests. ": null
    },
    {
        "Bruno Latour": "Bruno Latour"
    },
    {
        " noted that dangerous extremists are using the very same argument of social construction to destroy hard-won evidence that could save our lives. Was I wrong to participate in the invention of this field known as science studies? Is it enough to say that we did not really mean what we meant?        One recurring observation in the history of science involves the struggle for recognition of first-rate scientists working on the periphery of the scientific establishment. For instance, the great physicist ": null
    },
    {
        "Lord Rayleigh": "John William Strutt, 3Rd Baron Rayleigh"
    },
    {
        " looked back  on ": null
    },
    {
        "John James Waterstons": "John James Waterston"
    },
    {
        " seminal paper on the kinetic theory of gases. The history of the neglect of Waterstons path-breaking article, Rayleigh felt, suggests that a young author who believes himself capable of great things would usually do well to secure favourable recognition of the scientific world . . . before embarking upon higher flights.     ": null
    },
    {
        "William Harveys": "William Harvey"
    },
    {
        " experiences led him to an even more pessimistic view:  But what remains to be said about the quantity and source of the blood which thus passes, is of so novel and unheard-of character that I not only fear injury to myself from the envy of a few, but I tremble lest I have mankind at large for my enemies, so much doth wont and custom, that become as another nature, and doctrine once sown and that hath struck deep root, and respect for antiquity, influence all men. In more general terms, Robert K. Merton remarks that the history of science abounds in instances of basic papers having been written by comparatively unknown scientists, only to be rejected or neglected for years.  ": null
    }
]