[
    {
        "        The recorded written history of Haiti  began on 5 December 1492 when the European navigator ": null
    },
    {
        "Christopher Columbus": "Christopher Columbus"
    },
    {
        " happened upon a large island in the region of the western ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " that later came to be known as the ": null
    },
    {
        "Caribbean": "Caribbean"
    },
    {
        ". It was inhabited by the ": null
    },
    {
        "Taíno": "Taíno People"
    },
    {
        ", and ": null
    },
    {
        "Arawakan": "Arawak Peoples"
    },
    {
        " people, who variously called their island Ayiti, Bohio, or Kiskeya . Columbus promptly claimed the island for the ": null
    },
    {
        "Spanish Crown": "Spanish Empire"
    },
    {
        ", naming it La Isla Española , later ": null
    },
    {
        "Latinized": "Latinisation Of Names"
    },
    {
        " to  Hispaniola . French influence began in 1625, and French control of what was called ": null
    },
    {
        "Saint-Domingue": "Saint-Domingue"
    },
    {
        "—modern-day Haiti—began in 1660. From 1697 on, the western part of the island was French and the eastern part was Spanish. Haiti became one of the wealthiest of Frances colonies, producing vast quantities of sugar and coffee and depended on a brutal slave system for the necessary labor. Inspired by the message of the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        ", Haitian slaves rose up in ": null
    },
    {
        "revolt": "Haitian Revolutionthe Revolution"
    },
    {
        " in 1791 and after decades of struggle the independent republic of Haiti was officially proclaimed in 1804.            Successive waves of ": null
    },
    {
        "Arawak": "Arawak Peoples"
    },
    {
        " migrants, moving northward from the ": null
    },
    {
        "Orinoco": "Orinoco"
    },
    {
        " delta in South America, settled the islands of the ": null
    },
    {
        "Caribbean": "Caribbean"
    },
    {
        ". Around A.D. 600, the ": null
    },
    {
        "Taíno": "Taíno People"
    },
    {
        ", an Arawak culture, arrived on the island, displacing the previous inhabitants. They were organized into  cacicazgo s , each led by a cacique .       ": null
    },
    {
        "Christopher Columbus": "Christopher Columbus"
    },
    {
        " established the settlement, ": null
    },
    {
        "La Navidad": "La Navidad"
    },
    {
        ", near the modern town of ": null
    },
    {
        "Cap-Haïtien": "Cap-Haïtien"
    },
    {
        ". It was built from the timbers of his wrecked ship, ": null
    },
    {
        "Santa María": "Santa María"
    },
    {
        ", during his ": null
    },
    {
        "first voyage": "Voyages Of Christopher Columbus"
    },
    {
        " in December 1492. When he returned in 1493 on his second voyage he found the settlement had been destroyed and all 39 settlers killed. Columbus continued east and founded a new settlement at ": null
    },
    {
        "La Isabela": "La Isabela"
    },
    {
        " on the territory of the present-day ": null
    },
    {
        "Dominican Republic": "Dominican Republic"
    },
    {
        " in 1493. The capital of the colony was moved to ": null
    },
    {
        "Santo Domingo": "Santo Domingo"
    },
    {
        " in 1496, on the south west coast of the island also in the territory of the present-day Dominican Republic. The Spanish returned to western Hispaniola in 1502, establishing a settlement at Yaguana near modern-day ": null
    },
    {
        "Léogâne": "Léogâne"
    },
    {
        ". A second settlement was established on the north coast in 1504 called Puerto Real near modern ": null
    },
    {
        "Fort-Liberté": "Fort-Liberté"
    },
    {
        " – which in 1578 was relocated to a nearby site and renamed Bayaja.        Following the arrival of Europeans, La Hispaniolas indigenous population suffered greatly to near extinction, in possibly the worst case of depopulation in the Americas. A commonly accepted hypothesis attributes the high mortality of this colony in part to European diseases to which the natives had no immunity. A small number of ": null
    },
    {
        "Taínos": "Taíno People"
    },
    {
        " were able to survive and set up villages elsewhere. Spanish interest in ": null
    },
    {
        "Hispaniola": "Hispaniola"
    },
    {
        " began to wane in the 1520s, as more lucrative ": null
    },
    {
        "gold": "Gold"
    },
    {
        " and ": null
    },
    {
        "silver": "Silver"
    },
    {
        " deposits were found in Mexico and South America. Thereafter, the population of Spanish Hispaniola grew at a slow pace.     The settlement of Yaguana was burnt to the ground three times in its just over a century long existence as a Spanish settlement, first by French pirates in 1543, again on May 27, 1592, by a 110-strong landing party from a four-ship English naval squadron led by ": null
    },
    {
        "Christopher Newport": "Christopher Newport"
    },
    {
        " in his flagship Golden Dragon, who destroyed all 150 houses in the settlement, and finally by the Spanish themselves in 1605, for reasons set out below. Historic Cities of the Americas: An Illustrated Encyclopedia . David Marley. Page 121     In 1595, the Spanish, frustrated by the twenty-year ": null
    },
    {
        "rebellion of their Dutch subjects": "Dutch Revolt"
    },
    {
        ", closed their home ports to rebel shipping from the Netherlands, cutting them off from the critical salt supplies necessary for their herring industry. The Dutch responded by sourcing new salt supplies from Spanish America where colonists were more than happy to trade. So large numbers of Dutch traders/pirates joined their English and French brethren trading on the remote coasts of Hispaniola. In 1605, Spain was infuriated that Spanish settlements on the northern and western coasts of the island persisted in carrying out large scale and illegal trade with the Dutch, who were at that time fighting a war of independence against Spain in Europe and the English, a very recent enemy state, and so decided to forcibly resettle their inhabitants closer to the city of ": null
    },
    {
        "Santo Domingo": "Santo Domingo"
    },
    {
        ". Knight, Franklin, The Caribbean: The Genesis of a Fragmented Nationalism, 3rd ed. p. 54 New York, Oxford University Press 1990. This action, known as the Devastaciones de Osorio, proved disastrous; more than half of the resettled colonists died of starvation or disease, over 100,000 cattle were abandoned, and many slaves escaped. Rough Guide to the Dominican Republic, p. 352. Five of the existing thirteen settlements on the island were brutally razed by Spanish troops including the two settlements on the territory of present-day Haiti, La Yaguana, and Bayaja. Many of the inhabitants fought, escaped to the jungle, or fled to the safety of passing Dutch ships. Peasants and Religion: A Socioeconomic Study of Dios Olivorio and the Palma Sola Movement in the Dominican Republic. Jan Lundius & Mats Lundah. Routledge 2000, p. 397.     This Spanish action was counterproductive as English, Dutch, and French pirates were now free to establish bases on the islands abandoned northern and western coasts, where wild cattle were now plentiful and free. In 1697, after decades of fighting over the territory, the Spanish ceded the western   part of the island to the French, who henceforth called it Saint-Domingue. Saint-Domingue developed into a highly lucrative colony for France. Its economy was based on a labor-intensive sugar industry which rested on vast numbers of African slaves. Meanwhile, the situation on the Spanish part of the island deteriorated. The entire Spanish empire sank into a deep economic crisis, and Santo Domingo was in addition struck by earthquakes, hurricanes and a shrinking population.                      In 1711, the city of ": null
    },
    {
        "Cap-Français": "Cap-Français"
    },
    {
        " was formally established by ": null
    },
    {
        "Louis XIV": "Louis Xiv"
    },
    {
        " and took over as capital of the colony from ": null
    },
    {
        "Port-de-Paix": "Port-De-Paix"
    },
    {
        ". In 1726, the city of ": null
    },
    {
        "Les Cayes": "Les Cayes"
    },
    {
        " was founded on the Southern coast which became the biggest settlement in the south. In 1749, the city of ": null
    },
    {
        "Port-au-Prince": "Port-Au-Prince"
    },
    {
        " was established on the West coast, which in 1770 took over as the capital of the colony from Cap-Français, however that same year the ": null
    },
    {
        "1770 Port-au-Prince earthquake": "1770 Port-Au-Prince Earthquake"
    },
    {
        " and tsunami destroyed the city killing 200 people immediately, and 30,000 later from famine and disease brought on by the natural disaster. This was the second major earthquake to hit Saint-Domingue as it followed the ": null
    },
    {
        "1751 Port-au-Prince earthquake": "1751 Port-Au-Prince Earthquake"
    },
    {
        " which had left only a single stone built building standing in the town.     Prior to the ": null
    },
    {
        "Seven Years War": "Seven Years War"
    },
    {
        " , the economy of Saint-Domingue gradually expanded, with sugar and, later, coffee becoming important export crops. After the war, which disrupted maritime commerce, the colony underwent rapid expansion. In 1767, it exported 72  million pounds of ": null
    },
    {
        "raw sugar": "Raw Sugar"
    },
    {
        " and 51  million pounds of refined sugar, one million pounds of indigo, and two million pounds of cotton.  Saint-Domingue became known as the Pearl of the ": null
    },
    {
        "Antilles": "Antilles"
    },
    {
        " – the richest colony in the 18th century ": null
    },
    {
        "French empire": "French Colonial Empire"
    },
    {
        ". By the 1780s, Saint-Domingue produced about 40 percent of all the sugar and 60 percent of all the coffee consumed in Europe. This single colony, roughly the size of ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        " or ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        ", produced more sugar and coffee than all of ": null
    },
    {
        "Britains West Indian colonies": "British West Indies"
    },
    {
        " combined.     In the second half of the 1780s, Saint-Domingue accounted for a third of the entire ": null
    },
    {
        "Atlantic slave trade": "Atlantic Slave Trade"
    },
    {
        ". The population of the African slaves imported for these plantations is estimated to have been 790,000. Between 1764 and 1771, the average importation of slaves varied between 10,000–15,000, by 1786 about 28,000, and, from 1787 onward, the colony received more than 40,000 slaves a year. However, the inability to maintain slave numbers without constant resupply from Africa meant the slave population, by 1789, totaled 500,000, ruled over by a white population that, by 1789, numbered only 32,000.  At all times, a majority of slaves in the colony were African-born, as the brutal conditions of slavery prevented the population from experiencing growth through natural increase . African culture thus remained strong among slaves to the end of French rule, in particular the folk-religion of ": null
    },
    {
        "Vodou": "Haitian Vodou"
    },
    {
        ", which commingled Catholic liturgy and ritual with the beliefs and practices of ": null
    },
    {
        "Guinea": "Guinea"
    },
    {
        ", ": null
    },
    {
        "Congo": "Kingdom Of Kongo"
    },
    {
        ", and ": null
    },
    {
        "Dahomey": "Dahomey"
    },
    {
        ". Vodou is a Dahomean word meaning god or spirit Slave traders scoured the Atlantic coast of Africa, and the slaves who arrived came from hundreds of different tribes, their languages often mutually incomprehensible.        To regularize slavery, in 1685 ": null
    },
    {
        "Louis XIV": "Louis Xiv Of France"
    },
    {
        " enacted the  Code Noir , which accorded certain human rights to slaves and responsibilities to the master, who was obliged to feed, clothe, and provide for the general well-being of their slaves. The code noir also sanctioned corporal punishment, allowing masters to employ brutal methods to instill in their slaves the necessary docility, while ignoring provisions intended to regulate the administration of punishments. A passage from ": null
    },
    {
        "Henri Christophes": "Henri Christophe"
    },
    {
        " personal secretary, who lived more than half his life as a slave, describes the crimes perpetrated against the slaves of Saint-Domingue by their French masters:          Thousands of slaves found freedom by fleeing from their masters, forming communities of ": null
    },
    {
        "maroons": "Maroon"
    },
    {
        " and raiding isolated plantations. The most famous was ": null
    },
    {
        "Mackandal": "François Mackandal"
    },
    {
        ", a one-armed slave, originally from ": null
    },
    {
        "Guinea": "Guinea"
    },
    {
        ", who escaped in 1751. A ": null
    },
    {
        "Vodou": "Haitian Vodou"
    },
    {
        " Houngan , he united many of the different maroon bands. He spent the next six years staging successful raids and evading capture by the French, reputedly killing over 6,000 people, while preaching a fanatic vision of the destruction of white civilization in St. Domingue. In 1758, after a failed plot to poison the drinking water of the plantation owners, he was captured and burned alive at the public square in Cap-Français.     Saint-Domingue also had the largest and wealthiest ": null
    },
    {
        "free population of color": "Free People Of Color"
    },
    {
        " in the ": null
    },
    {
        "Caribbean": "History Of The Caribbean"
    },
    {
        ", the  gens de couleur  . The mixed-race community in Saint-Domingue numbered 25,000 in 1789. First-generation gens de couleur were typically the offspring of a male, French slaveowner and an African slave chosen as a concubine. In the French colonies, the semi-official institution of ": null
    },
    {
        "plaçage": "Plaçage"
    },
    {
        " defined this practice. By this system, the children were free people and could inherit property, thus originating a class of mulattos with property and some with wealthy fathers. This class occupied a middle status between African slaves and French colonists. Africans who attained freedom also enjoyed status as gens de couleur.     As numbers of gens de couleur grew, the French rulers enacted discriminatory laws. Statutes forbade gens de couleur from taking up certain professions, marrying whites, wearing European clothing, carrying swords or firearms in public, or attending social functions where whites were present. However, these regulations did not restrict their purchase of land, and many accumulated substantial holdings and became slave-owners. By 1789, they owned one-third of the plantation property and one-quarter of the slaves of ": null
    },
    {
        "Saint-Domingue": "Saint-Domingue"
    },
    {
        ".  Central to the rise of the gens de couleur planter class was the growing importance of coffee, which thrived on the marginal hillside plots to which they were often relegated. The largest concentration of gens de couleur was in the southern peninsula, the last region of the colony to be settled, owing to its distance from Atlantic shipping lanes and its formidable terrain, with the highest mountain range in the Caribbean.                 The outbreak of ": null
    },
    {
        "revolution in France": "French Revolution"
    },
    {
        " in the summer of 1789 had a powerful effect on the colony. While the French settlers debated how new revolutionary laws would apply to Saint-Domingue, outright civil war broke out in 1790 when the free men of color claimed they too were French citizens under the terms of the ": null
    },
    {
        "Declaration of the Rights of Man and of the Citizen": "Declaration Of The Rights Of Man And Of The Citizen"
    },
    {
        ". Ten days before the fall of the ": null
    },
    {
        "Bastille": "Bastille"
    },
    {
        ", in July 1789, the French ": null
    },
    {
        "National Assembly": "National Assembly"
    },
    {
        " had voted to seat six delegates from Saint-Domingue. In Paris, a group of wealthy mulattoes, led by ": null
    },
    {
        "Julien Raimond": "Julien Raimond"
    },
    {
        " and ": null
    },
    {
        "Vincent Ogé": "Vincent Ogé"
    },
    {
        ", unsuccessfully petitioned the white planter delegates to support mulatto claims for full civil and political rights. Through the efforts of a group called ": null
    },
    {
        "Société dAmis des Noirs": "Society Of The Friends Of The Blacks"
    },
    {
        ", of which Raimond and Ogé were prominent leaders, in March 1790 the ": null
    },
    {
        "National Assembly": "National Assembly"
    },
    {
        " granted full civic rights to the gens de couleur.   Vincent Ogé traveled to St. Domingue to secure the promulgation and implementation of this decree, landing near Cap-Français  in October 1790 and petitioning the royal governor, the Comte de Peynier. After his demands were refused, he attempted to incite the gens de couleur to revolt. Ogé and ": null
    },
    {
        "Jean-Baptiste Chavennes": "Jean-Baptiste Chavannes"
    },
    {
        ", a veteran of the ": null
    },
    {
        "Siege of Savannah": "Siege Of Savannah"
    },
    {
        " during the ": null
    },
    {
        "American Revolution": "American Revolution"
    },
    {
        ", attempted to attack Cap-Français. However, the mulatto rebels refused to arm or free their slaves, or to challenge the status of slavery, and their attack was defeated by a force of white militia and black volunteers . Afterwards, they fled across the frontier to ": null
    },
    {
        "Hinche": "Hinche"
    },
    {
        ", at the time in the Spanish part of the island. However, they were captured, returned to the French authorities, and both Ogé and Chavennes were executed in February 1791.          On 14 August 1791, slaves in the northern region of the colony staged a revolt that began the ": null
    },
    {
        "Haitian Revolution": "Haitian Revolution"
    },
    {
        ". Tradition marks the beginning of the revolution at a ": null
    },
    {
        "vodou": "Haitian Vodou"
    },
    {
        " ceremony at ": null
    },
    {
        "Bois Caïman": "Bois Caïman"
    },
    {
        " near Cap-Français. The call to arms was issued by a ": null
    },
    {
        "Houngan": "Houngan"
    },
    {
        " named ": null
    },
    {
        "Dutty Boukman": "Dutty Boukman"
    },
    {
        ". Within hours, the northern plantations were in flames. The rebellion spread through the entire colony. Boukman was captured and executed, but the rebellion continued to spread rapidly.     In 1792, ": null
    },
    {
        "Léger-Félicité Sonthonax": "Léger-Félicité Sonthonax"
    },
    {
        " was sent to the colony by the French Legislative Assembly as part of the Revolutionary Commission. His main goal was to maintain French control of Saint-Domingue, stabilize the colony, and enforce the social equality recently granted to free people of color by the National Convention of France.                  On 29 August 1793, Sonthonax took the radical step of proclaiming the freedom of the slaves in the north province . In September and October, emancipation was extended throughout the colony. The French National Convention, the first elected Assembly of the ": null
    },
    {
        "First Republic": "French First Republic"
    },
    {
        " , on 4 February 1794, under the leadership of ": null
    },
    {
        "Maximilien de Robespierre": "Maximilien De Robespierre"
    },
    {
        ", abolished slavery by law in France and all its colonies. The constitution of 1793, which was never applied, and the constitution of 1795, which was put into effect, did both contain an explicit ban on slavery.     The slaves did not immediately flock to Sonthonaxs banner, however. White colonists continued to fight Sonthonax, with assistance from the British. They were joined by many of the free men of color who opposed the abolition of slavery. It was not until word of Frances ratification of emancipation arrived back in the colony that ": null
    },
    {
        "Toussaint Louverture": "Toussaint Louverture"
    },
    {
        " and his corps of well disciplined, battle-hardened former slaves came over to the French Republican side in early May 1794. A change in the political winds in France caused Sonthonax to be recalled in 1796, but not before taking the step of arming the former slaves.     When the radical revolutionaries in Paris declared war against Spain in January 1793, the Spanish Crown sent its forces in ": null
    },
    {
        "Santo Domingo": "Captaincy General Of Santo Domingo"
    },
    {
        " into battle on the side of the slaves. By the end of 1793, Spain controlled most of the north, except British-held Môle-Saint-Nicolas and French-held Le Cap François and Port-de-Paix.  In 1795, Spain ceded Santo Domingo to France and Spanish attacks on Saint-Domingue ceased.     In the south the British suffered a series of defeats at the hands of the mulatto General ": null
    },
    {
        "André Rigaud": "André Rigaud"
    },
    {
        ". On October 6, 1794, Rigaud took Léogane. On December 26, 1794, he attacked the British-held Tiburon, routing and decimating the British garrison along with black troops under the command of Jean Kina fighting with them.  In 1798, having lost territory and thousands of men, the British were forced to withdraw.     In the meantime, Rigaud had set up a mulatto separatist movement in the south and ": null
    },
    {
        "Pétion": "Alexandre Pétion"
    },
    {
        " had joined him. With the British out, Toussaint swung into action against them. As he sent General ": null
    },
    {
        "Dessalines": "Jean-Jacques Dessalines"
    },
    {
        " against Grand and Petit Goâve and General ": null
    },
    {
        "Christophe": "Henri Christophe"
    },
    {
        " against the mulatto stronghold of Jacmel, heavily armed American ships bombarded mulatto fortifications and destroyed Rigauds transport barges.  The display of American force and the fierce fighting of Toussaints troops brought victory.     By 1801, Toussaint was in control of all of Hispaniola, after conquering ": null
    },
    {
        "French Santo Domingo": "Era De Francia"
    },
    {
        " and proclaiming the abolition of slavery there. He did not, however, proclaim full independence for the country, nor did he seek reprisals against the countrys former white slaveholders, convinced that the French would not restore slavery and that a population of slaves recently landed from Africa could not attain to civilization by going it alone.                            Toussaint, however, asserted so much independence that in 1802, ": null
    },
    {
        "Napoleon": "Napoleon"
    },
    {
        " sent a massive invasion force, under his brother-in-law ": null
    },
    {
        "Charles Leclerc": "Charles Leclerc"
    },
    {
        ", to increase French control. For a time, Leclerc met with some success; he also brought the eastern part of the island of Hispaniola under the direct control of France in accordance with the terms of the 1795 ": null
    },
    {
        "Treaties of Bâle": "Peace Of Basel"
    },
    {
        " with Spain. With a large expedition that eventually included 40,000 European troops, and receiving help from white colonists and mulatto forces commanded by ": null
    },
    {
        "Alexandre Pétion": "Alexandre Pétion"
    },
    {
        ", a former lieutenant of Rigaud, the French won several victories after severe fighting. Two of Toussaints chief lieutenants, Dessalines and Christophe, recognizing their untenable situation, held separate parleys with the invaders, and agreed to transfer their allegiance. At this point, Leclerc invited Toussaint to negotiate a settlement. It was a deception; Toussaint was seized and deported to France, where he died of ": null
    },
    {
        "pneumonia": "Pneumonia"
    },
    {
        " while imprisoned at ": null
    },
    {
        "Fort de Joux": "Fort De Joux"
    },
    {
        " in the ": null
    },
    {
        "Jura Mountains": "Jura Mountains"
    },
    {
        " in April 1803.     On 20 May 1802, Napoleon signed a law to maintain slavery where it had not yet disappeared, namely ": null
    },
    {
        "Martinique": "Martinique"
    },
    {
        ", ": null
    },
    {
        "Tobago": "Tobago"
    },
    {
        ", and ": null
    },
    {
        "Saint Lucia": "Saint Lucia"
    },
    {
        ". A confidential copy of this decree was sent to Leclerc, who was authorized to restore slavery in Saint-Domingue when the time was opportune. At the same time, further edicts stripped the gens de couleur of their newly won civil rights. None of these decrees were published or executed in St. Domingue, but, by midsummer, word began to reach the colony of the French intention to restore slavery. The betrayal of Toussaint and news of French actions in Martinique undermined the collaboration of leaders such as ": null
    },
    {
        "Dessalines": "Jean-Jacques Dessalines"
    },
    {
        ", ": null
    },
    {
        "Christophe": "Henri Christophe"
    },
    {
        ", and ": null
    },
    {
        "Pétion": "Alexandre Pétion"
    },
    {
        ". Convinced that the same fate lay in store for Saint-Domingue, these commanders and others once again battled Leclerc. With the French intent on reconquest and re-enslavement of the colonys black population, the war became a bloody struggle of atrocity and attrition. The rainy season brought ": null
    },
    {
        "yellow fever": "Yellow Fever"
    },
    {
        " and ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        ", which took a heavy toll on the invaders. By November, when Leclerc died of yellow fever, 24,000 French soldiers were dead and 8,000 were hospitalized, the majority from disease.      Afterwards, Leclerc was replaced by ": null
    },
    {
        "Donatien-Marie-Joseph de Vimeur, vicomte de Rochambeau": "Donatien-Marie-Joseph De Vimeur, Vicomte De Rochambeau"
    },
    {
        ". Rochambeau wrote to Napoleon that, to reclaim Saint-Domingue, France must declare the negroes slaves, and destroy at least 30,000 negroes and negresses.  In his desperation, he turned to increasingly wanton acts of brutality; the French burned alive, hanged, drowned, and tortured black prisoners, reviving such practices as burying blacks in piles of insects and boiling them in cauldrons of molasses. One night, at Port-Républican, he held a ball to which he invited the most prominent mulatto ladies and, at midnight, announced the death of their husbands. However, each act of brutality was repaid by the Haitian rebels. After one battle, Rochambeau buried 500 prisoners alive; Dessalines responded by hanging 500 French prisoners.  Rochambeaus brutal tactics helped unite black, mulatto, and mestizo soldiers against the French.     As the tide of the war turned toward the former slaves, Napoleon abandoned his dreams of restoring Frances New World empire. In 1803, war resumed between France and Britain, and with the ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        " firmly in control of the seas, reinforcements and supplies for Rochambeau never arrived in sufficient numbers. To concentrate on the war in Europe, Napoleon signed the ": null
    },
    {
        "Louisiana Purchase": "Louisiana Purchase"
    },
    {
        " in April, selling Frances North American possessions to the United States. The Haitian army, now led by Dessalines, devastated Rochembeau and the French army at the ": null
    },
    {
        "Battle of Vertières": "Battle Of Vertières"
    },
    {
        " on 18 November 1803.     On 1 January 1804 Dessalines then declared independence,  reclaiming the indigenous Taíno name of Haiti for the new nation. Most of the remaining French colonists fled ahead of the defeated French army, many migrating to ": null
    },
    {
        "Louisiana": "Louisiana"
    },
    {
        " or ": null
    },
    {
        "Cuba": "Cuba"
    },
    {
        ". Unlike Toussaint, Dessalines showed little equanimity with regard to the whites. In a final act of retribution, ": null
    },
    {
        "the remaining French were slaughtered by Haitian military forces": "1804 Haiti Massacre"
    },
    {
        ". Some 2,000 Frenchmen were massacred at Cap-Français, 900 in Port-au-Prince, and 400 at Jérémie. He issued a proclamation declaring, we have repaid these cannibals, war for war, crime for crime, outrage for outrage.      One exception was a military force of ": null
    },
    {
        "Poles": "Poles"
    },
    {
        " from the ": null
    },
    {
        "Polish Legions": "Polish Legions"
    },
    {
        " that had fought in Napoleons army.  A majority of Polish soldiers refused to fight against the Black inhabitants. At the time, there was a familiar situation going on back in their homeland, as these Polish soldiers were fighting for their liberty from the invading Russia, Prussia and Austria that began in 1772. As hopeful as the Haitians, many Poles were seeking union amongst themselves to win back their homeland. As a result, many Polish soldiers admired their enemy and decided to turn on the French army and join the ": null
    },
    {
        "Haiti": "Haiti"
    },
    {
        "an slaves, and participated in the Haitian revolution of 1804, supporting the principles of liberty for all the people. ": null
    },
    {
        "Władysław Franciszek Jabłonowski": "Władysław Franciszek Jabłonowski"
    },
    {
        " who was half-Black was one of the Polish generals at the time. Polish soldiers had a remarkable input in helping the Haitians in the retaliation fights against the French oppressor. They were spared the fate of other Europeans. For their loyalty and support for overthrowing the French, some Poles acquired Haitian citizenship after Haiti gained its Independence, and many of them settled there to never return to ": null
    },
    {
        "Poland": "Poland"
    },
    {
        ". It is estimated that around 500 of the 5280 Poles chose this option. Of the remainder, 700 returned to France to eventually return to Poland, and some – after capitulation – were forced to serve in British units. 160 Poles were later given permission to leave Haiti and some particular ones were sent to France at Haitian expense. To this day, many Polish Haitians still live in Haiti and are of ": null
    },
    {
        "mixed racial origin": "Mulatto"
    },
    {
        ", however some have blonde hair, light eyes, and other European features. Today, descendants of those Poles who stayed are living in ": null
    },
    {
        "Cazale": "Cazale"
    },
    {
        ", ": null
    },
    {
        "Fond-des-Blancs": "Fond-Des-Blancs"
    },
    {
        ", ": null
    },
    {
        "La Vallée-de-Jacmel": "La Vallée-De-Jacmel"
    },
    {
        ", ": null
    },
    {
        "La Baleine": "La Baleine"
    },
    {
        ", ": null
    },
    {
        "Port-Salut": "Port-Salut"
    },
    {
        " and ": null
    },
    {
        "Saint-Jean-du-Sud": "Saint-Jean-Du-Sud"
    },
    {
        ".     Despite the Haitian victory, France refused to recognize the newly independent countrys sovereignty until 1825, in exchange for 150  million gold francs. This fee, demanded as retribution for the lost property, —slaves, land, equipment etc.—of the former colonialists, was later reduced to 90  million. Haiti agreed to pay the price to lift a crippling embargo imposed by France, Britain, and the United States— but to do so, the Haitian government had to take out high interest loans. The debt was not repaid in full until 1947.                     Haiti is the worlds oldest black republic and one of the oldest republics in the Western Hemisphere.  Although Haiti actively assisted the independence movements of many Latin American countries – and secured a promise from the great liberator, ": null
    },
    {
        "Simón Bolívar": "Simón Bolívar"
    },
    {
        ", that he would free their slaves after winning independence from Spain – the nation of former slaves was excluded from the hemispheres first regional meeting of independent nations, held in ": null
    },
    {
        "Panama": "Panama"
    },
    {
        " in 1826. Furthermore, owing to entrenched opposition from Southern slave states, Haiti did not receive U.S. diplomatic recognition until 1862 – largely through the efforts of anti-slavery senator ": null
    },
    {
        "Charles Sumner": "Charles Sumner"
    },
    {
        " of Massachusetts.     Upon assuming power, General Dessalines authorized the Constitution of 1804. This constitution, in terms of social freedoms, called for:   Freedom of religion ;   All citizens of Haiti, regardless of skin color, to be known as Black .   White men were forbidden from possessing property or domain on Haitian soil. Should the French return to reimpose slavery, Article 5 of the constitution declared: At the first shot of the warning gun, the towns shall be destroyed and the nation will rise in arms.           On 22 September 1804, Dessalines, preferring Napoleons style rather than the more liberal yet vulnerable type of political government of the French Republican Radicals , proclaimed himself Emperor Jacques I. Yet two of his own advisers, ": null
    },
    {
        "Henri Christophe": "Henri Christophe"
    },
    {
        " and ": null
    },
    {
        "Alexandre Pétion": "Alexandre Pétion"
    },
    {
        ", helped provoke his assassination in 1806. The conspirators ambushed him north of ": null
    },
    {
        "Port-au-Prince": "Port-Au-Prince"
    },
    {
        " at Pont Larnage on 17 October 1806 en route to battle rebels to his regime.     The state created under Dessalines was the opposite of what the Haitian mass or the peasantry preferred. While both the elite leaders, such as Dessalines, as well as the Haitian population agreed the state should be built on the ideals of freedom and democracy, Jean-Jaques Dessalines, Haitian Declaration of Independence, 1804. From Duke Office of News and Communications,  . The 1805 Constitution of Haiti, May 20, 1805. Translation. From Webster University Faculty.  . these ideals in practice looked very different for both groups. The main reason for this difference in viewpoints of nationalisms come from the fact that one group lived as slaves, and the other did not. Mimi Sheller, Black Publics and Peasant Radicalism in Haiti and Jamaica , 5. For one, the economic and agricultural practices of Dessalines, and leaders after him, were based on the need to create a strong economic state, that was capable of maintaining a strong military. Mats Lundahl, Defense and Distribution: Agricultural Policy in Haiti during the Reign of Jean-Jaques Dessalines, 1804-1806, Scandinavian Economic History Review, 32, no. 2 , 86-87. For the elite leaders of Haiti, maintaining a strong military to ward off either the French or other colonial powers and ensure independence would create a free state. The leaders of Haiti tied independence from other powers as their notion of freedom.     However, the Haitian peasantry tied their notion of freedom to the land. Because of the mountainous terrain, Haitian slaves were able to cultivate their own small tracts of land. Thus, freedom for them was the ability to cultivate their own land within a subsistence economy. Unfortunately, because of the leaders’ desires, a system of coerced plantation agriculture emerged. James Franklin, the Present State of Hayti with remarks on its agriculture, commerce, laws, religion, finances and population , 189-190. Furthermore, while all Haitians desired a black republic, the cultural practices of African-Americans were a point of contention. Many within the Haitian population wanted to maintain their African heritage, which is a logical connection to wanting a black republic. However, the elites typically tried to prove the sophistication of Haitians through literature. Some authors wrote that the barbarism of Africa must be expelled, while maintaining African roots. Beaubrun Ardouin, Etudes sur l’historie d’Haiti : suivies de la vie du général J.M. Borgella , quoted in Erin Zavitz, Revolutionary narrations: Early Haitian historiography and the challenge of writing counter-history, Atlantic Studies, 14, no. 3 .     Furthermore, other authors tried to prove the civility of the elite Haitians by arguing that blacks were capable of establishing and running a government by changing and augmenting the history of the revolution to favor the mulatto and black elites, rather than the bands of slaves. Thomas Madiou, Histoire d’Haiti, 1847. Quoted in Erin Zavitz, Revolutionary narrations: Early Haitian historiography and the challenge of writing counter-history, Atlantic Studies, 14, no. 3 , 343. Furthermore, to maintain freedom and independence, the elites failed to provide a civil society that the Haitian mass desired. The Haitian peasants desired not only land freedom but also civil rights, such as voting and political participation as well as access to education. The state failed to provide those basic rights.     The state was essentially run by the military, which meant that it was very difficult for the Haitian population to participate in democratic processes. Most importantly, the state failed to provide proper access to education that a state consisting of former slaves would need. M.B. Bird, the Black Man or Haytian Independence , 220. It was nearly impossible for the former slaves to participate effectively because they lacked the basic literacy that was intentionally taken from them by French colonial rule. Through differing views on Haitian nationalism and freedom, the elites created a state that greatly favored them, over the Haitian population and the Haitian peasantry.            After the Dessalines coup détat, the two main conspirators divided the country in two rival regimes. Christophe created the ": null
    },
    {
        "authoritarian": "Authoritarianism"
    },
    {
        " State of Haiti": "State Of Haiti"
    },
    {
        " in the north, and the ": null
    },
    {
        "Gens de couleur": "Gens De Couleur"
    },
    {
        " Pétion helped establish the ": null
    },
    {
        "Republic of Haiti": "Haiti"
    },
    {
        " in the south. Christophe attempted to maintain a strict system of labor and agricultural production akin to the former plantations. Although, strictly speaking, he did not establish slavery, he imposed a semi-feudal system, fumage, in which every able man was required to work in plantations  to produce goods for the fledgling country. His method, though undoubtedly oppressive, produced the most revenues of the two governments.     By contrast, Pétion broke up the former colonial estates and parceled out the land into small holdings. In Pétions south, the ": null
    },
    {
        "gens de couleur": "Gens De Couleur"
    },
    {
        " minority led the government and feared losing popular support, and thus, sought to assuage class tensions with land redistribution. Because of the weak international position and its labor policies , Pétions government was perpetually on the brink of bankruptcy. Yet, for most of its time, it produced one of the most liberal and tolerant Haitian governments ever. In 1815, at a key period of ": null
    },
    {
        "Bolívars fight for Venezuelan independence": "Military Career Of Simón Bolívar"
    },
    {
        ", he gave the Venezuelan leader ": null
    },
    {
        "asylum": "Right Of Asylum"
    },
    {
        " and provided him soldiers and substantial material support. It also had the least of internal military skirmishes, despite its continuous conflicts with Christophes northern kingdom. In 1816, however, after finding the burden of the ": null
    },
    {
        "Senate": "Senate"
    },
    {
        " intolerable, he suspended the legislature and turned his post into ": null
    },
    {
        "President for Life": "President For Life"
    },
    {
        ". Not long after, he died of ": null
    },
    {
        "yellow fever": "Yellow Fever"
    },
    {
        ", and his assistant ": null
    },
    {
        "Jean-Pierre Boyer": "Jean-Pierre Boyer"
    },
    {
        " replaced him.        In this period, the eastern part of the island rose against the new powers following general Juan Sánchez Ramírezs claims of independence from France, which broke the Treaties of Bâle attacking Spain and prohibited commerce with Haiti. In the Palo Hincado battle , all the remaining French forces were defeated by Spanish-creole insurrectionists. On 9 July 1809, Santo Domingo was born. The government put itself under the control of Spain, earning it the nickname of España Boba .     In 1811, Christophe proclaimed himself King Henri I in the North and commissioned several extraordinary buildings. He even created a nobility class in the fashion of European monarchies. Yet in 1820, weakened by illness and with a decreasing support for his authoritarian regime, he killed himself with a silver bullet rather than face a coup détat. Immediately after, Pétions successor, Boyer, reunited Haiti through diplomatic tactics, and ruled as president until his overthrow in 1843.               Almost two years after Boyer had consolidated power in the west, in 1821, Santo Domingo declared independence from Spain and requested from Simón Bolívar inclusion in the ": null
    },
    {
        "Gran Colombia": "Gran Colombia"
    },
    {
        ". Boyer, however, responding to a party on the east that preferred Haiti over Colombia, occupied the ex-Spanish colony in January 1822, encountering no military resistance. In this way he accomplished the unity of the island, which was only carried out for a short period of time by ": null
    },
    {
        "Toussaint Louverture": "Toussaint Louverture"
    },
    {
        " in 1801. Boyers occupation of the Spanish side also responded to internal struggles among Christophes generals, to which Boyer gave extensive powers and lands in the east. This occupation, however, pitted the Spanish white elite against the iron fisted Haitian administration, and stimulated the emigration of many white wealthy families. The entire island remained under Haitian rule until 1844, when in the east a nationalist group called ": null
    },
    {
        "La Trinitaria": "La Trinitaria"
    },
    {
        " led a revolt that partitioned the island into ": null
    },
    {
        "Haiti": "Haiti"
    },
    {
        " on the west and ": null
    },
    {
        "Dominican Republic": "Dominican Republic"
    },
    {
        " on the east, based on what would appear to be a riverine territorial divide from the pre-contact period.     From 1824 to 1826, while the island was under one government, Boyer promoted the largest single ": null
    },
    {
        "free-Black immigration": "Haitian Emigration"
    },
    {
        " from the ": null
    },
    {
        "United States": "Thomas Jefferson And Haitian Emigration"
    },
    {
        " in which more than 6,000 immigrants settled in different parts of the island. Today remnants of these immigrants live throughout the island, but the larger number reside in ": null
    },
    {
        "Samaná": "Samaná Peninsula"
    },
    {
        ", a peninsula on the Dominican side of the island. From the governments perspective, the intention of the immigration was to help establish commercial and diplomatic relationships with the US, and to increase the number of skilled and agricultural workers in Haiti.        In exchange for diplomatic recognition from France, Boyer was forced to pay a huge indemnity for the loss of French property during the revolution. To pay for this, he had to float loans in France, putting Haiti into a state of debt. Boyer attempted to enforce production through the Code Rural, enacted in 1826, but peasant freeholders, mostly former revolutionary soldiers, had no intention of returning to the forced labor they fought to escape. By 1840, Haiti had ceased to export sugar entirely, although large amounts continued to be grown for local consumption as taffia-a raw rum. However, Haiti continued to export coffee, which required little cultivation and grew semi-wild.     The ": null
    },
    {
        "1842 Cap-Haïtien earthquake": "1842 Cap-Haïtien Earthquake"
    },
    {
        " destroyed the city, and the ": null
    },
    {
        "Sans-Souci Palace": "Sans-Souci Palace"
    },
    {
        ", killing 10,000 people. This was the third major earthquake to hit Western Hispaniola following the 1751 and 1770 Port-au-Prince earthquakes, and the last until the devastating earthquake of 2010.     Haiti went through a long period of oppression and instability following the presidency of Jean-Pierre Boyer. Likewise, in the Dominican Republic, a succession of ": null
    },
    {
        "strongmen": "Caudillo"
    },
    {
        " ruled harshly during the last half of the 19th century, crushed frequent uprisings, and repelled Haitian invasions.                            In 1843, a revolt, led by ": null
    },
    {
        "Charles Rivière-Hérard": "Charles Rivière-Hérard"
    },
    {
        ", overthrew Boyer and established a brief parliamentary rule under the ": null
    },
    {
        "Constitution of 1843": "1843 Constitution Of Haiti"
    },
    {
        ". Revolts soon broke out and the country descended into near chaos, with a series of transient presidents until March 1847, when General ": null
    },
    {
        "Faustin Soulouque": "Faustin I Of Haiti"
    },
    {
        ", a former slave who had fought in the rebellion of 1791, became president. He purged the military high command, established a secret police, and eliminated mulatto opponents. In August 1849, he grandiosely proclaimed himself as Haitis second emperor, Faustin I. Soulouques expansive ambitions led him to mount several invasions of the Dominican Republic. The new emperor had been called a rey de farsa by the Dominicans. The white and mulatto rulers of the Dominican Republic he considered as his natural enemies, and he could never consolidate his rule without this conquest, for his reign had been founded on domination and would stand only by it.  When in 1849 Soulouque led his first invasion into the Dominican Republic, President ": null
    },
    {
        "Buenaventura Báez": "Buenaventura Báez"
    },
    {
        " declared war on Haiti. The invasion included two ": null
    },
    {
        "marine": "Marines"
    },
    {
        " campaigns.  Soulouque launched his last campaign in December 1855. In January of the following year, a Haitian contingent of 6,000 soldiers was terribly defeated in the border town of Ouanaminthe. More than 1,000 men were killed, and many were wounded and declared missing on the way back to the capital.  The failure of that expedition hurt Soulouques image at home. When he rode into Port-au-Prince with what remained of his army he was loudly cursed by women who had lost their sons, brothers, and husbands in the war. Four years later, he was deposed by General ": null
    },
    {
        "Fabre Geffrard": "Fabre Geffrard"
    },
    {
        ", styled the Duke of Tabara.     Geffrards military government held office until 1867, and he encouraged a successful policy of national reconciliation. In 1860, he reached an agreement with the ": null
    },
    {
        "Vatican": "Roman Catholic Church"
    },
    {
        ", reintroducing official Roman Catholic institutions, including schools, to the nation. In 1867 an attempt was made to establish a constitutional government, but successive presidents ": null
    },
    {
        "Sylvain Salnave": "Sylvain Salnave"
    },
    {
        " and ": null
    },
    {
        "Nissage Saget": "Nissage Saget"
    },
    {
        " were overthrown in 1869 and 1874 respectively. A more workable constitution was introduced under ": null
    },
    {
        "Michel Domingue": "Michel Domingue"
    },
    {
        " in 1874, leading to a long period of democratic peace and development for Haiti. The debt to France was finally repaid in 1879, and Michel Domingues government peacefully transferred power to ": null
    },
    {
        "Lysius Salomon": "Lysius Salomon"
    },
    {
        ", one of Haitis abler leaders. Monetary reform and a cultural renaissance ensued with a flowering of Haitian art.     The last two decades of the 19th century were also marked by the development of a Haitian intellectual culture. Major works of history were published in 1847 and 1865. Haitian intellectuals, led by ": null
    },
    {
        "Louis-Joseph Janvier": "Louis-Joseph Janvier"
    },
    {
        " and ": null
    },
    {
        "Anténor Firmin": "Anténor Firmin"
    },
    {
        ", engaged in a war of letters against a tide of racism and ": null
    },
    {
        "Social Darwinism": "Social Darwinism"
    },
    {
        " that emerged during this period.     The Constitution of 1867 saw peaceful and progressive transitions in government that did much to improve the economy and stability of the Haitian nation and the condition of its people. Constitutional government restored the faith of the Haitian people in legal institutions. The development of industrial sugar and rum industries near ": null
    },
    {
        "Port-au-Prince": "Port-Au-Prince"
    },
    {
        " made Haiti, for a while, a model for economic growth in Latin American countries.   This period of relative stability and prosperity ended in 1911, when revolution broke out and the country slid once again into disorder and debt.     From 1911 to 1915, there were six different presidents, each of whom was killed or forced into exile.  The revolutionary armies were formed by cacos, peasant brigands from the mountains of the north, along the porous Dominican border, who were enlisted by rival political factions with promises of money to be paid after a successful revolution and an opportunity to plunder.     The United States was particularly apprehensive about the role of the German community in Haiti , who wielded a disproportionate amount of economic power. Germans controlled about 80% of the countrys international commerce; they also owned and operated utilities in Cap Haïtien and Port-au-Prince, the main ": null
    },
    {
        "wharf": "Wharf"
    },
    {
        " and a tramway in the capital, and a railroad serving the Plaine de Cul-du-Sac.     The German community proved more willing to integrate into Haitian society than any other group of white foreigners, including the French. A number married into the nations most prominent mulatto families, bypassing the constitutional prohibition against foreign land-ownership. They also served as the principal financiers of the nations innumerable revolutions, floating innumerable loans-at high interest rates-to competing political factions.     In an effort to limit German influence, in 1910–11, the US State Department backed a consortium of American investors, assembled by the ": null
    },
    {
        "National City Bank of New York": "Citibank"
    },
    {
        ", in acquiring control of the Banque Nationale dHaïti, the nations only commercial bank and the government treasury.     In February 1915, ": null
    },
    {
        "Vilbrun Guillaume Sam": "Vilbrun Guillaume Sam"
    },
    {
        " established a dictatorship, but in July, facing a new revolt, he massacred 167 political prisoners, all of whom were from elite families, and was lynched by a mob in ": null
    },
    {
        "Port-au-Prince": "Port-Au-Prince"
    },
    {
        " Fabre Geffrard": "Fabre Geffrard"
    },
    {
        " Charles Rivière-Hérard": "Charles Rivière-Hérard"
    },
    {
        " Michel Domingue": "Michel Domingue"
    },
    {
        " Lysius Salomon": "Lysius Salomon"
    },
    {
        "                             In 1915 the United States, responding to complaints to President ": null
    },
    {
        "Woodrow Wilson": "Woodrow Wilson"
    },
    {
        " from American banks to which Haiti was deeply in debt, occupied the country. The ": null
    },
    {
        "occupation of Haiti": "United States Occupation Of Haiti"
    },
    {
        " lasted until 1934. The US occupation was resented by Haitians as a loss of sovereignty and there were revolts against US forces. Reforms were carried out despite this.     Under the supervision of the United States Marines, the Haitian National Assembly elected ": null
    },
    {
        "Philippe Sudré Dartiguenave": "Philippe Sudré Dartiguenave"
    },
    {
        " president. He signed a treaty that made Haiti a de jure US protectorate, with American officials assuming control over the Financial Advisory, Customs Receivership, the Constabulary, the Public Works Service, and the Public Health Service for a period of ten years. The principal instrument of American authority was the newly created Gendarmerie dHaïti, commanded by American officers. In 1917, at the demand of US officials, the National Assembly was dissolved, and officials were designated to write a new constitution, which was largely dictated by officials in the ": null
    },
    {
        "US State Department": "United States Department Of State"
    },
    {
        " and ": null
    },
    {
        "US Navy Department": "United States Department Of The Navy"
    },
    {
        ". ": null
    },
    {
        "Franklin D. Roosevelt": "Franklin D. Roosevelt"
    },
    {
        ", Under-Secretary for the Navy in the ": null
    },
    {
        "Wilson": "Woodrow Wilson"
    },
    {
        " administration, claimed to have personally written the new constitution. This document abolished the prohibition on foreign ownership of land – the most essential component of Haitian law. When the newly elected National Assembly refused to pass this document and drafted one of its own preserving this prohibition, it was forcibly dissolved by Gendarmerie commandant ": null
    },
    {
        "Smedley Butler": "Smedley Butler"
    },
    {
        ". This constitution was approved by a plebiscite in 1919, in which less than 5% of the population voted. The US State Department authorized this plebiscite presuming that the people casting ballots would be 97% illiterate, ignorant in most cases of what they were voting for.      The Marines and Gendarmerie initiated an extensive road-building program to enhance their military effectiveness and open the country to US investment. Lacking any source of adequate funds, they revived an 1864 Haitian law, discovered by Butler, requiring peasants to perform labor on local roads in lieu of paying a road tax. This system, known as the ": null
    },
    {
        "corvée": "Corvée"
    },
    {
        ", originated in the unpaid labor that French peasants provided to their ": null
    },
    {
        "feudal": "Feudalism"
    },
    {
        " lords. In 1915, Haiti had  of road usable by automobile, outside the towns. By 1918, more than  of road had been built or repaired through the corvée system, including a road linking ": null
    },
    {
        "Port-au-Prince": "Port-Au-Prince"
    },
    {
        " to ": null
    },
    {
        "Cap-Haïtien": "Cap-Haïtien"
    },
    {
        ".  However, Haitians forced to work in the corvée labor-gangs, frequently dragged from their homes and harassed by armed guards, received few immediate benefits and saw this system of forced labor as a return to slavery at the hands of white men.     In 1919, a new caco uprising began, led by ": null
    },
    {
        "Charlemagne Péralte": "Charlemagne Péralte"
    },
    {
        ", vowing to drive the invaders into the sea and free Haiti.  The Cacos ": null
    },
    {
        "attacked Port-au-Prince": "Battle Of Port-Au-Prince"
    },
    {
        " in October but were driven back with heavy casualties. Afterwards, a ": null
    },
    {
        "Creole": "Haitian Creole Language"
    },
    {
        "-speaking American Gendarmerie officer and two US marines infiltrated Péraltes camp, killing him and photographing his corpse in an attempt to demoralize the rebels. Leadership of the rebellion passed to Benoît Batraville, a Caco chieftain from ": null
    },
    {
        "Artibonite": "Artibonite"
    },
    {
        ", who also launched an ": null
    },
    {
        "assault on the capital": "Battle Of Port-Au-Prince"
    },
    {
        ". His death in 1920 marked the end of hostilities. During Senate hearings in 1921, the commandant of the Marine Corps reported that, in the twenty months of active resistance, 2,250 Haitians had been killed. However, in a report to the Secretary of the Navy he reported the death toll as being 3,250.  Haitian historians have estimated the true number was much higher; one suggested, the total number of battle victims and casualties of repression and consequences of the war might have reached, by the end of the pacification period, four or five times that – somewhere in the neighborhood of 15,000 persons.      In 1922, Dartiguenave was replaced by ": null
    },
    {
        "Louis Borno": "Louis Borno"
    },
    {
        ", who ruled without a legislature until 1930. That same year, General ": null
    },
    {
        "John H. Russell, Jr.": "John H. Russell, Jr."
    },
    {
        ", was appointed High Commissioner. The Borno-Russel dictatorship oversaw the expansion of the economy, building over  of road, establishing an automatic telephone exchange, modernizing the nations port facilities, and establishing a public health service. ": null
    },
    {
        "Sisal": "Sisal"
    },
    {
        " was introduced to Haiti, and sugar and cotton became significant exports.  However, efforts to develop commercial agriculture had limited success, in part because much of Haitis labor force was employed at seasonal work in the more established sugar industries of ": null
    },
    {
        "Cuba": "Cuba"
    },
    {
        " and the ": null
    },
    {
        "Dominican Republic": "Dominican Republic"
    },
    {
        ". An estimated 30,000–40,000 Haitian laborers, known as braceros, went annually to the ": null
    },
    {
        "Oriente Province": "Oriente Province"
    },
    {
        " of Cuba between 1913 and 1931.  Most Haitians continued to resent the loss of sovereignty. At the forefront of opposition among the educated elite was LUnion Patriotique, which established ties with opponents of the occupation in the US itself, in particular the ": null
    },
    {
        "National Association for the Advancement of Colored People": "National Association For The Advancement Of Colored People"
    },
    {
        " .     The ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        " decimated the prices of Haitis exports and destroyed the tenuous gains of the previous decade. In December 1929, Marines in ": null
    },
    {
        "Les Cayes": "Les Cayes"
    },
    {
        " killed ten Haitians during a march to protest local economic conditions. This led ": null
    },
    {
        "Herbert Hoover": "Herbert Hoover"
    },
    {
        " to appoint two commissions, including one headed by a former US governor of the ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        " William Cameron Forbes": "William Cameron Forbes"
    },
    {
        ", which criticized the exclusion of Haitians from positions of authority in the government and constabulary, now known as the Garde dHaïti. In 1930, ": null
    },
    {
        "Sténio Vincent": "Sténio Vincent"
    },
    {
        ", a long-time critic of the occupation, was elected president, and the US began to withdraw its forces. The withdrawal was completed under US President ": null
    },
    {
        "Franklin D. Roosevelt": "Franklin D. Roosevelt"
    },
    {
        " , in 1934, under his ": null
    },
    {
        "Good Neighbor policy": "Good Neighbor Policy"
    },
    {
        " . The US retained control of Haitis external finances until 1947.  All three rulers during the occupation came from the countrys small ": null
    },
    {
        "mulatto": "Mulatto"
    },
    {
        " minority. At the same time, many in the growing black professional classes departed from the traditional veneration of Haitis French cultural heritage and emphasized the nations African roots, most notably ethnologist ": null
    },
    {
        "Jean Price-Mars": "Jean Price-Mars"
    },
    {
        " and the journal Les Griots, edited by Dr. ": null
    },
    {
        "François Duvalier": "François Duvalier"
    },
    {
        ".      The transition government was left with a better infrastructure, public health, education, and agricultural development as well as a democratic system. The country had fully democratic elections in 1930, won by ": null
    },
    {
        "Sténio Vincent": "Sténio Vincent"
    },
    {
        ". The Garde was a new kind of military institution in Haiti. It was a force manned overwhelmingly by blacks, with a United States-trained black commander, Colonel Démosthènes Pétrus Calixte. Most of the Gardes officers, however, were mulattoes. The Garde was a national organization; it departed from the regionalism that had characterized most of Haitis previous armies. In theory, its charge was apolitical—to maintain internal order, while supporting a popularly elected government. The Garde initially adhered to this role.                 President Vincent took advantage of the comparative national stability, which was being maintained by a professionalized military, to gain absolute power. A plebiscite permitted the transfer of all authority in economic matters from the legislature to the executive, but Vincent was not content with this expansion of his power. In 1935 he forced through the legislature a new constitution, which was also approved by plebiscite. The constitution praised Vincent, and it granted the executive sweeping powers to dissolve the legislature at will, to reorganize the judiciary, to appoint ten of twenty-one senators , and to rule by decree when the legislature was not in session. Although Vincent implemented some improvements in infrastructure and services, he brutally repressed his opposition, censored the press, and governed largely to benefit himself and a clique of merchants and corrupt military officers.     Under Calixte the majority of Garde personnel had adhered to the doctrine of political nonintervention that their Marine Corps trainers had stressed. Over time, however, Vincent and Dominican dictator ": null
    },
    {
        "Rafael Leónidas Trujillo Molina": "Rafael Trujillo"
    },
    {
        " sought to buy adherents among the ranks. Trujillo, determined to expand his influence over all of Hispaniola, in October 1937 ordered the indiscriminate butchery by the Dominican army of an estimated 14,000 to 40,000  Haitians on the Dominican side of the ": null
    },
    {
        "Massacre River": "Dajabón River"
    },
    {
        ". Some observers claim that Trujillo supported an abortive coup attempt by young Garde officers in December 1937. Vincent dismissed Calixte as commander and sent him abroad, where he eventually accepted a commission in the Dominican military as a reward for his efforts while on Trujillos payroll. The attempted coup led Vincent to purge the officer corps of all members suspected of disloyalty, marking the end of the apolitical military.              In 1941 Vincent showed every intention of standing for a third term as president, but after almost a decade of disengagement, the United States made it known that it would oppose such an extension. Vincent accommodated the Roosevelt administration and handed power over to ": null
    },
    {
        "Elie Lescot": "Elie Lescot"
    },
    {
        ".     Lescot was a mulatto who had served in numerous government posts. He was competent and forceful, and many considered him a sterling candidate for the presidency, despite his elitist background. Like the majority of previous Haitian presidents, however, he failed to live up to his potential. His tenure paralleled that of Vincent in many ways. Lescot declared himself commander in chief of the military, and power resided in a clique that ruled with the tacit support of the Garde. He repressed his opponents, censored the press, and compelled the legislature to grant him extensive powers. He handled all budget matters without legislative sanction and filled legislative vacancies without calling elections. Lescot commonly said that Haitis declared state-of-war against the Axis powers during World War II justified his repressive actions. Haiti, however, played no role in the war except for supplying the United States with raw materials and serving as a base for a United States Coast Guard detachment.     Aside from his authoritarian tendencies, Lescot had another flaw: his relationship with ": null
    },
    {
        "Rafael Trujillo": "Rafael Trujillo"
    },
    {
        ". While serving as Haitian ambassador to the ": null
    },
    {
        "Dominican Republic": "Dominican Republic"
    },
    {
        ", Lescot fell under the sway of Trujillos influence and wealth. In fact, it was Trujillos money that reportedly bought most of the legislative votes that brought Lescot to power. Their clandestine association persisted until 1943, when the two leaders parted ways for unknown reasons. Trujillo later made public all his correspondence with the Haitian leader. The move undermined Lescots already dubious popular support.     In January 1946, events came to a head when Lescot jailed the Marxist editors of a journal called La Ruche . This action precipitated student strikes and protests by government workers, teachers, and shopkeepers in the capital and provincial cities. In addition, Lescots mulatto-dominated rule had alienated the predominantly black Garde. His position became untenable, and he resigned on 11 January. Radio announcements declared that the Garde had assumed power, which it would administer through a three-member junta.            The Revolution of 1946 was a novel development in Haitis history, as the Garde assumed power as an institution, not as the instrument of a particular commander. The members of the junta, known as the Military Executive Committee , were Garde commander ": null
    },
    {
        "Colonel Franck Lavaud": "Franck Lavaud"
    },
    {
        ", ": null
    },
    {
        "Major Antoine Levelt": "Antoine Levelt"
    },
    {
        ", and ": null
    },
    {
        "Major Paul E. Magloire": "Paul E. Magloire"
    },
    {
        ", commander of the Presidential Guard. All three understood Haitis traditional way of exercising power, but they lacked a thorough understanding of what would be required to make the transition to an elected civilian government. Upon taking power, the junta pledged to hold free elections. The junta also explored other options, but public clamor, which included public demonstrations in support of potential candidates, eventually forced the officers to make good on their promise.     Haiti elected its National Assembly in May 1946. The Assembly set 16 August 1946, as the date on which it would select a president. The leading candidates for the office—all of whom were black—were ": null
    },
    {
        "Dumarsais Estimé": "Dumarsais Estimé"
    },
    {
        ", a former school teacher, assembly member, and cabinet minister under Vincent; ": null
    },
    {
        "Félix dOrléans Juste Constant": "Félix Dorléans Juste Constant"
    },
    {
        ", leader of the ": null
    },
    {
        "Haitian Communist Party": "Haitian Communist Party"
    },
    {
        " ; and former Garde commander ": null
    },
    {
        "Démosthènes Pétrus Calixte": "Démosthènes Pétrus Calixte"
    },
    {
        ", who stood as the candidate of a progressive coalition that included the Worker Peasant Movement . MOP chose to endorse Calixte, instead of a candidate from its own ranks, because the partys leader, ": null
    },
    {
        "Daniel Fignolé": "Daniel Fignolé"
    },
    {
        ", was only thirty-three years old—too young to stand for the nations highest office. Estimé, politically the most moderate of the three, drew support from the black population in the north, as well as from the emerging black middle class. The leaders of the military, who would not countenance the election of Juste Constant and who reacted warily to the populist Fignolé, also considered Estimé the safest candidate. After two rounds of polling, legislators gave Estimé the presidency.          Estimés election represented a break with Haitis political tradition. Although he was reputed to have received support from commanders of the Garde, Estimé was a civilian. Of humble origins, he was passionately anti-elitist and therefore generally antimulatto. He demonstrated, at least initially, a genuine concern for the welfare of the people. Operating under a new constitution that went into effect in November 1946, Estimé proposed, but never secured passage of, Haitis first social- security legislation. He did, however, expand the school system, encourage the establishment of rural cooperatives, raise the salaries of civil servants, and increase the representation of middle-class and lower-class blacks in the public sector. He also attempted to gain the favor of the Garde—renamed the Haitian Army in March 1947—by promoting Lavaud to brigadier general and by seeking United States military assistance.     Estimé eventually fell victim to two of the time-honored pitfalls of Haitian rule: elite intrigue and personal ambition. The elite had a number of grievances against Estimé. Not only had he largely excluded them from the often lucrative levers of government, but he also enacted the countrys first income tax, fostered the growth of labor unions, and suggested that vodou be considered as a religion equivalent to Roman Catholicism—a notion that the Europeanized elite abhorred. Lacking direct influence in Haitian affairs, the elite resorted to clandestine lobbying among the officer corps. Their efforts, in combination with deteriorating domestic conditions, led to a coup in May 1950.     To be sure, Estimé had hastened his own demise in several ways. His nationalization of the Standard Fruit banana concession sharply reduced the firms revenues. He alienated workers by requiring them to invest between 10 percent and 15 percent of their salaries in national-defense bonds. The president sealed his fate by attempting to manipulate the constitution in order to extend his term in office. Seizing on this action and the popular unrest it engendered, the army forced the president to resign on 10 May 1950. The same junta that had assumed power after the fall of Lescot reinstalled itself. An army escort conducted Estimé from the National Palace and into exile in Jamaica. The events of May 1946 made an impression upon the deposed minister of labor, François Duvalier. The lesson that Duvalier drew from Estimés ouster was that the military could not be trusted. It was a lesson that he would act upon when he gained power.            The power balance within the junta shifted between 1946 and 1950. Lavaud was the preeminent member at the time of the first coup, but Magloire, now a colonel, dominated after Estimés overthrow. When Haiti announced that its first direct elections would be held on 8 October 1950, Magloire resigned from the junta and declared himself a candidate for president. In contrast to the chaotic political climate of 1946, the campaign of 1950 proceeded under the implicit understanding that only a strong candidate backed by both the army and the elite would be able to take power. Facing only token opposition, Magloire won the election and assumed office on 6 December.     Magloire restored the elite to prominence. The business community and the government benefited from favorable economic conditions until Hurricane Hazel hit the island in 1954. Haiti made some improvements on its infrastructure, but most of these were financed largely by foreign loans. By Haitian standards, Magloires rule was firm, but not harsh: he jailed political opponents, including Fignolé, and shut down their presses when their protests grew too strident, but he allowed labor unions to function, although they were not permitted to strike. It was in the arena of corruption, however, that Magloire overstepped traditional bounds. The president controlled the sisal, cement, and soap monopolies. He and other officials built imposing mansions. The injection of international hurricane relief funds into an already corrupt system boosted graft to levels that disillusioned all Haitians. To make matters worse, Magloire followed in the footsteps of many previous presidents by disputing the termination date of his stay in office. Politicians, labor leaders, and their followers flocked to the streets in May 1956 to protest Magloires failure to step down. Although Magloire declared martial law, a general strike essentially shut down Port-au-Prince. Again like many before him, Magloire fled to Jamaica, leaving the army with the task of restoring order.       The period between the fall of Magloire and the election of Duvalier in September 1957 was a chaotic one, even by Haitian standards. Three provisional presidents held office during this interval; one resigned and the army deposed the other two, Franck Sylvain and Fignolé. Duvalier is said to have engaged actively in the behind-the-scenes intrigue that helped him to emerge as the presidential candidate that the military favored. The military went on to guide the campaign and the elections in a way that gave Duvalier every possible advantage. Most political actors perceived Duvalier—a medical doctor who had served as a rural administrator of a United States-funded anti-yaws campaign before entering the cabinet under Estimé—as an honest and fairly unassuming leader without a strong ideological motivation or program. When elections were finally organized, this time under terms of universal suffrage , Duvalier, a black, painted himself as the legitimate heir to Estimé. This approach was enhanced by the fact that Duvaliers only viable opponent, ": null
    },
    {
        "Louis Déjoie": "Louis Déjoie"
    },
    {
        ", was a mulatto and the scion of a prominent family. Duvalier scored a decisive victory at the polls. His followers took two-thirds of the legislatures lower house and all of the seats in the Senate.                 A former Minister of Health who had earned a reputation as a humanitarian while serving as an administrator in a U.S.-funded anti-": null
    },
    {
        "yaws": "Yaws"
    },
    {
        " campaign, ": null
    },
    {
        "François Duvalier": "François Duvalier"
    },
    {
        "  soon established another dictatorship. His regime is regarded as one of the most repressive and corrupt of modern times, combining violence against political opponents with exploitation of ": null
    },
    {
        "Vodou": "Haitian Vodou"
    },
    {
        " to instill fear in the majority of the population. Duvaliers paramilitary police, officially the Volunteers for National Security but more commonly known as the ": null
    },
    {
        "Tonton Macoutes": "Tonton Macoute"
    },
    {
        ", named for a Vodou monster, carried out political murders, beatings, and intimidation. An estimated 30,000 Haitians were killed by his government.  ": null
    },
    {
        "Duvalier employed rape": "Sexual Violence In Haiti"
    },
    {
        " as a political tool to silence political opposition.  Incorporating many  houngan s into the ranks of the Macoutes, his public recognition of Vodou and its practitioners and his private adherence to Vodou ritual, combined with his reputed private knowledge of magic and sorcery, enhanced his popular persona among the common people and served as a peculiar form of legitimization.     Duvaliers policies, designed to end the dominance of the mulatto elite over the nations economic and political life, led to massive emigration of educated people, deepening Haitis economic and social problems. However, Duvalier appealed to the black middle class of which he was a member by introducing public works into middle-class neighborhoods that previously had been unable to have paved roads, running water, or modern sewage systems. In 1964, Duvalier proclaimed himself President for Life .     The ": null
    },
    {
        "Kennedy": "John F. Kennedy"
    },
    {
        " administration suspended aid in 1961, after allegations that Duvalier had pocketed aid money and intended to use a ": null
    },
    {
        "Marine Corps": "Marine"
    },
    {
        " mission to strengthen the Macoutes. Duvalier also clashed with Dominican President ": null
    },
    {
        "Juan Bosch": "Juan Bosch"
    },
    {
        " in 1963, after Bosch provided aid and asylum to Haitian exiles working to overthrow his regime. He ordered the Presidential Guard to occupy the Dominican chancery in ": null
    },
    {
        "Pétion-Ville": "Pétion-Ville"
    },
    {
        " to apprehend an officer involved in a plot to kidnap his children, leading Bosch to publicly threaten to invade Haiti. However, the Dominican army, which distrusted Boschs leftist leanings, expressed little support for an invasion, and the dispute was settled by ": null
    },
    {
        "OAS": "Organization Of American States"
    },
    {
        " emissaries.     In 1971, Papa Doc entered into a 99-year contract with ": null
    },
    {
        "Don Pierson": "Don Pierson"
    },
    {
        " representing Dupont Caribbean Inc. of Texas for a ": null
    },
    {
        "free port": "Free Port"
    },
    {
        " project on the old ": null
    },
    {
        "buccaneer": "Buccaneer"
    },
    {
        " stronghold of ": null
    },
    {
        "Tortuga": "Freeport Tortuga"
    },
    {
        " island located some  off the north coast of the main Haitian island of Hispaniola.            On Duvaliers death in April 1971, power passed to his 19-year-old son ": null
    },
    {
        "Jean-Claude Duvalier": "Jean-Claude Duvalier"
    },
    {
        " . Under Jean-Claude Duvalier, Haitis economic and political condition continued to decline, although some of the more fearsome elements of his fathers regime were abolished. Foreign officials and observers also seemed more tolerant toward Baby Doc, in areas such as human-rights monitoring, and foreign countries were more generous to him with economic assistance. The United States restored its aid program in 1971. In 1974, Baby Doc expropriated the Freeport Tortuga project and this caused the venture to collapse. Content to leave administrative matters in the hands of his mother, Simone Ovid Duvalier, while living as a playboy, Jean-Claude enriched himself through a series of fraudulent schemes. Much of the Duvaliers wealth, amounting to hundreds of millions of dollars over the years, came from the Régie du Tabac , a tobacco monopoly established by Estimé, which expanded to include the proceeds from all government enterprises and served as a slush fund for which no balance sheets were ever kept.  His marriage, in 1980, to a beautiful mulatto divorcée, ": null
    },
    {
        "Michèle Bennett": "Michèle Bennett"
    },
    {
        ", in a $3  million ceremony, provoked widespread opposition, as it was seen as a betrayal of his fathers antipathy towards the mulatto elite. At the request of Michèle, Papa Docs widow Simone was expelled from Haiti. Baby Docs ": null
    },
    {
        "kleptocracy": "Kleptocracy"
    },
    {
        " left the regime vulnerable to unanticipated crises, exacerbated by endemic poverty, most notably the epidemic of ": null
    },
    {
        "African swine fever virus": "African Swine Fever Virus"
    },
    {
        "—which, at the insistence of ": null
    },
    {
        "USAID": "United States Agency For International Development"
    },
    {
        " officials, led to the slaughter of the ": null
    },
    {
        "creole pigs": "Creole Pig"
    },
    {
        ", the principal source of income for most Haitians; and the widely publicized outbreak of AIDS in the early 1980s. Widespread discontent in Haiti began in 1983, when ": null
    },
    {
        "Pope John Paul II": "Pope John Paul Ii"
    },
    {
        " condemned the regime during a visit, finally provoking a rebellion, and in February 1986, after months of disorder, the army forced Duvalier to resign and go into exile.                 From 1986 to early 1988 Haiti was ruled by a provisional military government under General Namphy. ": null
    },
    {
        "In 1987, a new constitution": ":S:Constitution Of Haïti"
    },
    {
        " was ratified, providing for an elected ": null
    },
    {
        "bicameral": "Bicameralism"
    },
    {
        " parliament, an elected president, and a prime minister, cabinet, ministers, and supreme court appointed by the president with parliaments consent. The Constitution also provided for political decentralization through the election of mayors and administrative bodies responsible for local government. The ": null
    },
    {
        "November 1987 elections": "Haitian Presidential Election, 1987"
    },
    {
        " were cancelled after troops massacred 30–300 voters on election day. Whitney, Kathleen Marie , Sin, Fraph, and the CIA: U.S. Covert Action in Haiti , Southwestern Journal of Law and Trade in the Americas, Vol. 3, Issue 2 , pp. 303–32, esp. p. 319. ": null
    },
    {
        "Jimmy Carter": "Jimmy Carter"
    },
    {
        " later wrote that Citizens who lined up to vote were mowed down by fusillades of terrorists’ bullets. Military leaders, who had either orchestrated or condoned the murders, moved in to cancel the election and retain control of the Government. ": null
    },
    {
        "Jimmy Carter": "Jimmy Carter"
    },
    {
        ", ": null
    },
    {
        "Carter Center": "Carter Center"
    },
    {
        ", 1 October 1990,  The election was followed several months later by the ": null
    },
    {
        "Haitian presidential election, 1988": "Haitian Presidential Election, 1988"
    },
    {
        ", which was boycotted by almost all the previous candidates, and saw turnout of just 4%.      The 1988 elections led to ": null
    },
    {
        "Professor Leslie Manigat": "Leslie Manigat"
    },
    {
        " becoming president, but three months later he too was ousted by the military. Further instability ensued, with several massacres, including the ": null
    },
    {
        "St Jean Bosco massacre": "St Jean Bosco Massacre"
    },
    {
        " in which the church of ": null
    },
    {
        "Jean-Bertrand Aristide": "Jean-Bertrand Aristide"
    },
    {
        " was attacked and burned down. During this period, the Haitian ": null
    },
    {
        "National Intelligence Service": "Service Dintelligence National"
    },
    {
        " , which had been set up and financed in the 80s by the ": null
    },
    {
        "Central Intelligence Agency": "Central Intelligence Agency"
    },
    {
        " as part of the war on drugs, participated in drug trafficking and political violence.        In December 1990, ": null
    },
    {
        "Jean-Bertrand Aristide": "Jean-Bertrand Aristide"
    },
    {
        ", a ": null
    },
    {
        "liberation theology": "Liberation Theology"
    },
    {
        " Roman Catholic priest, won 67% of the vote in ": null
    },
    {
        "elections": "Haitian General Election, 1990–1991"
    },
    {
        " that international observers deemed largely free and fair.   Aristides radical populist policies and the violence of his bands of supporters alarmed many of the countrys elite, and, in September 1991, he was overthrown in the ": null
    },
    {
        "1991 Haitian coup détat": "1991 Haitian Coup Détat"
    },
    {
        ", which brought General ": null
    },
    {
        "Raoul Cédras": "Raoul Cédras"
    },
    {
        " to power. The coup saw hundreds killed, and Aristide was forced into exile, his life saved by international diplomatic intervention.              An estimated 3,000–5,000 Haitians were killed during the period of military rule. The coup created a large-scale exodus of refugees to the United States. The ": null
    },
    {
        "United States Coast Guard": "United States Coast Guard"
    },
    {
        " interdicted a total of 41,342 Haitians during 1991 and 1992. Most were denied entry to the United States and repatriated back to Haiti. Aristide has accused the United States of backing the 1991 coup.   In response to the coup, the ": null
    },
    {
        "United Nations Security Council": "United Nations Security Council"
    },
    {
        " passed ": null
    },
    {
        "Resolution 841": "United Nations Security Council Resolution 841"
    },
    {
        " imposing ": null
    },
    {
        "international sanctions": "International Sanctions"
    },
    {
        " and an ": null
    },
    {
        "arms embargo": "Arms Embargo"
    },
    {
        " on Haiti.     On 16 February 1993, the ferry Neptune sank, drowning an estimated 700 passengers. This was the worst ferry disaster in Haitian history.        The military regime governed Haiti until 1994, and according to some sources included drug trafficking led by Chief of National Police ": null
    },
    {
        "Michel François": "Michel François"
    },
    {
        ". Various initiatives to end the political crisis through the peaceful restoration of the constitutionally elected government failed. In July 1994, as repression mounted in Haiti and a civilian human rights monitoring mission was expelled from the country, the United Nations Security Council adopted ": null
    },
    {
        "United Nations Security Council Resolution 940": "United Nations Security Council Resolution 940"
    },
    {
        ", which authorized member states to use all necessary means to facilitate the departure of Haitis military leadership and to restore Haitis constitutionally elected government to power.            In mid-September 1994, with U.S. troops prepared to enter Haiti by force for ": null
    },
    {
        "Operation Uphold Democracy": "Operation Uphold Democracy"
    },
    {
        ", President ": null
    },
    {
        "Bill Clinton": "Bill Clinton"
    },
    {
        " dispatched a negotiating team led by former President ": null
    },
    {
        "Jimmy Carter": "Jimmy Carter"
    },
    {
        " to persuade the authorities to step aside and allow for the return of constitutional rule. With intervening troops already airborne, Cédras and other top leaders agreed to step down. In October, Aristide was able to return. The ": null
    },
    {
        "Haitian general election, 1995": "Haitian General Election, 1995"
    },
    {
        " in June 1995 saw Aristides coalition, the Lavalas Political Organization, gain a sweeping victory, and ": null
    },
    {
        "René Préval": "René Préval"
    },
    {
        ", a prominent Aristide political ally, elected President with 88% of the vote. When Aristides term ended in February 1996, this was Haitis first ever transition between two democratically elected presidents.                 In late 1996, Aristide broke with Préval and formed a new political party, the Lavalas Family , which won ": null
    },
    {
        "elections in April 1997": "Haitian Legislative Election, 1997"
    },
    {
        " for one-third of the Senate and local assemblies, but these results were not accepted by the government. The split between Aristide and Préval produced a dangerous political deadlock, and the government was unable to organize the local and parliamentary elections due in late 1998. In January 1999, Préval dismissed legislators whose terms had expired – the entire Chamber of Deputies and all but nine members of the Senate, and Préval then ruled by decree.       In May 2000 the ": null
    },
    {
        "Haitian legislative election, 2000": "Haitian Legislative Election, 2000"
    },
    {
        " for the Chamber of Deputies and two-thirds of the Senate took place. The election drew a voter turnout of more than 60%, and the FL won a virtual sweep. However, the elections were marred by controversy in the Senate race over the calculation of whether Senate candidates had achieved the majority required to avoid a run-off election . The validity of the Electoral Councils post-ballot calculations of whether a majority had been attained was disputed. The ": null
    },
    {
        "Organization of American States": "Organization Of American States"
    },
    {
        " complained about the calculation and declined to observe the July run-off elections. The opposition parties, regrouped in the Democratic Convergence , demanded that the elections be annulled, and that Préval stand down and be replaced by a provisional government. In the meantime, the opposition announced it would boycott the ": null
    },
    {
        "November presidential and senatorial elections": "Haitian Presidential Election, 2000"
    },
    {
        ". Haitis main aid donors threatened to cut off aid. At the November 2000 elections, boycotted by the opposition, Aristide was again elected president, with more than 90% of the vote, on a turnout of around 50% according to international observers. The opposition refused to accept the result or to recognize Aristide as president.     Allegations emerged of drug trafficking reaching into the upper echelons of government, as it had done under the military regimes of the 1980s and early 1990s . Canadian police arrested Oriel Jean, Aristides security chief and one of his most trusted friends, for money laundering.  Beaudoin Ketant, a notorious international drug trafficker, Aristides close partner, and his daughters godfather, claimed that Aristide turned the country into a narco-country; its a one-man show; you either pay or you die . ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        ", 19 March 2004,      Aristide spent years negotiating with the ": null
    },
    {
        "Convergence Démocratique": "Convergence Démocratique"
    },
    {
        " on new elections, but the Convergences inability to develop a sufficient electoral base made elections unattractive, and it rejected every deal offered, preferring to call for a US invasion to topple Aristide.          Anti-Aristide protests in January 2004 led to violent clashes in Port-au-Prince, causing several deaths. In February, a revolt broke out in the city of ": null
    },
    {
        "Gonaïves": "Gonaïves"
    },
    {
        ", which was soon under rebel control. The rebellion then began to spread, and Cap-Haïtien, Haitis second-largest city, was captured. A mediation team of diplomats presented a plan to reduce Aristides power while allowing him to remain in office until the end of his constitutional term. Although Aristide accepted the plan, it was rejected by the opposition, which mostly consisted of Haitian businessmen and former members of the army .      On 29 February 2004, with rebel contingents marching towards Port-au-Prince, Aristide departed from Haiti. Aristide insists that he was essentially kidnapped by the U.S., while the U.S. ": null
    },
    {
        "State Department": "United States Department Of State"
    },
    {
        " maintains that he resigned from office. Aristide and his wife left Haiti on an American airplane, escorted by American diplomats and military personnel, and were flown directly to ": null
    },
    {
        "Bangui": "Bangui"
    },
    {
        ", capital of the ": null
    },
    {
        "Central African Republic": "Central African Republic"
    },
    {
        ", where he stayed for the following two weeks, before seeking ": null
    },
    {
        "asylum": "Right Of Asylum"
    },
    {
        " in a less remote location. This event was later characterized by Aristide as a kidnapping.     Though this has never been proven, many observers in the press and academia believe that the US has not provided convincing answers to several of the more suspicious details surrounding the coup, such as the circumstances under which the US obtained Aristides purported letter of resignation which, translated from ": null
    },
    {
        "Kreyòl": "Kreyòl"
    },
    {
        ", may not have actually read as a resignation.      Aristide has accused the U.S. of deposing him in concert with the Haitian opposition.  In a 2006 interview, he said the U.S. went back on their word regarding compromises he made with them over privatization of enterprises to ensure that part of the profits would go to the Haitian people and then relied on a disinformation campaign to discredit him.      Political organizations and writers, as well as Aristide himself, have suggested that the rebellion was in fact a foreign controlled coup détat. ": null
    },
    {
        "Caricom": "Caribbean Community"
    },
    {
        ", which had been backing the peace deal, accused the United States, France, and the International community of failing in Haiti because they allegedly allowed a controversially elected leader to be violently forced out of office. The international community stated that the crisis was of Aristides making and that he was not acting in the best interests of his country. They have argued that his removal was necessary for future stability in the island nation.     Some investigators claimed to have discovered extensive ": null
    },
    {
        "embezzlement": "Embezzlement"
    },
    {
        ", corruption, and ": null
    },
    {
        "money laundering": "Money Laundering"
    },
    {
        " by Aristide. It was claimed Aristide had stolen tens of millions of dollars from the country, though specific bank account documents proving this have yet to be presented.     None of the allegations about Aristides involvement in embezzlement, corruption, or money laundering schemes could be proven. The criminal court case brought against Aristide was quietly shelved, though various members of his Lavalas party languished for years in prison without charge or trial due to similar accusations   The Haitian government suspended the suit against Aristide on 30 Jun 2006 to prevent it from being thrown out for want of prosecution.       The government was taken over by ": null
    },
    {
        "Supreme Court": "Supreme Court Of Haiti"
    },
    {
        " Chief Justice": "Chief Justice"
    },
    {
        " Boniface Alexandre": "Boniface Alexandre"
    },
    {
        ". Alexandre petitioned the ": null
    },
    {
        "United Nations Security Council": "United Nations Security Council"
    },
    {
        " for the intervention of an international peacekeeping force. The Security Council passed a resolution the same day king note of the resignation of Jean-Bertrand Aristide as President of Haiti and the swearing-in of President Boniface Alexandre as the acting President of Haiti in accordance with the Constitution of Haiti and authorized such a mission.  As a vanguard of the official U.N. force, a force of about 1,000 ": null
    },
    {
        "U.S. Marines": "United States Marine Corps"
    },
    {
        " arrived in Haiti within the day, and Canadian and French troops arrived the next morning; the United Nations indicated it would send a team to assess the situation within days. These international troops have been criticized for cooperating with rebel forces, refusing to disarm them, and integrating former military and death-squad members into the re-militarized Haitian National Police force following the coup.     On 1 June 2004, the ": null
    },
    {
        "peacekeeping": "Peacekeeping"
    },
    {
        " mission was passed to ": null
    },
    {
        "MINUSTAH": "United Nations Stabilization Mission In Haiti"
    },
    {
        " and comprised a 7,000 strength force led by ": null
    },
    {
        "Brazil": "Brazil"
    },
    {
        " and backed by ": null
    },
    {
        "Argentina": "Argentina"
    },
    {
        ", Chile, ": null
    },
    {
        "Jordan": "Jordan"
    },
    {
        ", Morocco, ": null
    },
    {
        "Nepal": "Nepal"
    },
    {
        ", Peru, ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        ", Spain, ": null
    },
    {
        "Sri Lanka": "Sri Lanka"
    },
    {
        ", and ": null
    },
    {
        "Uruguay": "Uruguay"
    },
    {
        ".      Brazilian forces led the United Nations peacekeeping troops in Haiti composed of United States, France, Canada, and ": null
    },
    {
        "Chile": "Chile"
    },
    {
        " deployments. These peacekeeping troops were a part of the ongoing MINUSTAH operation.     In November 2004, the ": null
    },
    {
        "University of Miami School of Law": "University Of Miami School Of Law"
    },
    {
        " carried out a Human Rights Investigation in Haiti and documented serious human rights abuses. It stated that summary executions are a police tactic. Griffin Report – Haiti Human Rights Investigation, 11–21 November 2004 – By Thomas M. Griffin, ESQ. – Center for the Study of Human Rights, ": null
    },
    {
        "University of Miami School of Law": "University Of Miami School Of Law"
    },
    {
        " – –    It also suggested a disturbing pattern.     In March 2004, the Haiti Commission of Inquiry, headed by former US attorney-general ": null
    },
    {
        "Ramsey Clark": "Ramsey Clark"
    },
    {
        ", published its findings : Noting that 200 US special forces had travelled to the Dominican Republic for “military exercises” in February 2003, the commission accused the US of arming and training Haitian rebels there. With permission from the Dominican president, Hipólito Mejía, US forces trained near the border, in an area used by former soldiers of the disbanded Haitian army to launch attacks on Haitian state property.      On 15 October 2005, Brazil called for more troops to be sent due to the worsening situation in the country.      After Aristides overthrow, the violence in Haiti continued, despite the presence of peacekeepers. Clashes between police and Fanmi Lavalas supporters were common, and peacekeeping forces were accused of conducting a massacre against the residents of ": null
    },
    {
        "Cité Soleil": "Cité Soleil"
    },
    {
        " in July 2005. Several of the protests resulted in violence and deaths.         In the midst of the ongoing controversy and violence, however, the interim government planned legislative and executive elections. After being postponed several times, these were held in February 2006. The elections were won by ": null
    },
    {
        "René Préval": "René Préval"
    },
    {
        ", who had a strong following among the poor, with 51% of the votes.  Préval took office in May 2006.     In the spring of 2008, Haitians demonstrated against rising food prices. In some instances, the few main roads on the island were blocked with burning tires and the airport at Port-au-Prince was closed.  Protests and demonstrations by ": null
    },
    {
        "Fanmi Lavalas": "Fanmi Lavalas"
    },
    {
        " continued in 2009.                On 12 January 2010, Haiti suffered a devastating ": null
    },
    {
        "earthquake": "2010 Haiti Earthquake"
    },
    {
        ", magnitude 7.0 with a death toll estimated by the Haitian government at over 300,000, and by non-Haitian sources from 50,000 to 220,000. Aftershocks followed, including one of magnitude 5.9. The capital city, Port-au-Prince, was effectively leveled. A million Haitians were left homeless, and hundreds of thousands starved. The earthquake caused massive devastation, with most buildings crumbled, including Haitis presidential palace. The enormous death toll made it necessary to bury the dead in mass graves. Most bodies were unidentified and few pictures were taken, making it impossible for families to identify their loved ones. The spread of disease was a major secondary disaster. Many survivors were treated for injuries in emergency makeshift hospitals, but many more died of gangrene, malnutrition, and infectious diseases.             On 4 April 2011, a senior Haitian official announced that ": null
    },
    {
        "Michel Martelly": "Michel Martelly"
    },
    {
        " had won the ": null
    },
    {
        "second round of the election": "Haitian General Election, 2010–2011"
    },
    {
        " against candidate ": null
    },
    {
        "Mirlande Manigat": "Mirlande Manigat"
    },
    {
        ". Charles, Jacqueline.  Miami Herald 4 April 2011. Retrieved 4 Apr 2011. Michel Martelly also known by his stage name Sweet Micky is a former musician and businessman. Martellys administration was met with both anger and acclaim. On one hand, he and his associates were accused of being involved in money laundering and various other crimes resulting in countless demonstrations . Many criticized him for the slow progression of the reconstruction phase following the recent quake, or for taking credit for projects started in previous administrations. Some disliked him for his vulgar language and risque past which didnt seem to completely go away upon taking presidency. On the other hand, many believe that he was the most productive Haitian president since the Duvalier era. Under his administration, the majority of those left homeless following the quake were given new housing. He offered free education programs to large portions of the Haitian youth as well as an income program for Haitian mothers and students. The administration launched a massive reconstruction program involving principle administration district, Champs-de-Mars, that would modernize and rehabilitate various government buildings, public places, and parks. Michel Martelly put emphasis on foreign investment and business with his slogan Haiti is Open for Business . Perhaps one of the more major contributions made for the revitalization of the Haitian economy was their push for tourists. Minister of Tourism, ": null
    },
    {
        "Stéphanie Villedrouin": "Stéphanie Villedrouin"
    },
    {
        ", embarked on various competitive tourist projects, including the development of Ile-a-Vache, Jacmel, the north, south-west, and Cotes-des-Arcadins. Tourism had risen significantly between 2012 and 2016.  On 8 February 2016, Michel Martelly stepped down at the end of his term without a successor in place. BBC. BBC 8 February 2016. Retrieved 12 Feb 2016.          After the 2016 elections following Hurricane Mathew, Haitian voters re-visited the polls and elected Martellys appointed successor, ": null
    },
    {
        "Jovenel Moise": "Jovenel Moïse"
    },
    {
        ", as president. He was inaugurated on the grounds where the national palace had been on February 7, 2017. He went on to start the Caravan de Changement project, which aims to revitalize the industries and infrastructure of Haitis less popular areas however the actual impact of these efforts is debated. In recent months, Moïse has been implicated in the embezzlement of funds from the PetroCaribe program, as has his predecessor, Martelly.     On 7 July 2018 ": null
    },
    {
        "protests": "2018–19 Haitian Protests"
    },
    {
        " led by opposition politician ": null
    },
    {
        "Jean-Charles Moïse": "Jean-Charles Moïse"
    },
    {
        " began, demanding the resignation of Jovenel Moïse. Released in November 2017, a Senate probe of the period 2008-2016  revealed significant corruption had been funded with ": null
    },
    {
        "Venezuela": "Venezuela"
    },
    {
        "n loans through the ": null
    },
    {
        "Petrocaribe": "Petrocaribe"
    },
    {
        " program.  Significant protests broke out in February 2019 following a report from the court investigating the Petrocaribe Senate probe.  ": null
    }
]