[
    {
        "Djibouti": "Djibouti"
    },
    {
        " is a country in the ": null
    },
    {
        "Horn of Africa": "Horn Of Africa"
    },
    {
        ". It is bordered by ": null
    },
    {
        "Somalia": "Somalia"
    },
    {
        " to the southeast, ": null
    },
    {
        "Eritrea": "Eritrea"
    },
    {
        " and the ": null
    },
    {
        "Red Sea": "Red Sea"
    },
    {
        " to the north and northeast, ": null
    },
    {
        "Ethiopia": "Ethiopia"
    },
    {
        " to the west and south, and the ": null
    },
    {
        "Gulf of Aden": "Gulf Of Aden"
    },
    {
        " to the east.     In antiquity, the territory was part of the ": null
    },
    {
        "Land of Punt": "Land Of Punt"
    },
    {
        ". The Djibouti area, along with other localities in the Horn region, was later the seat of the medieval ": null
    },
    {
        "Adal": "Adal Sultanate"
    },
    {
        " and ": null
    },
    {
        "Ifat": "Ifat Sultanate"
    },
    {
        " Sultanates. In the late 19th century, the colony of ": null
    },
    {
        "French Somaliland": "French Somaliland"
    },
    {
        " was established following treaties signed by the ruling ": null
    },
    {
        "Somali": "Somalis"
    },
    {
        " and ": null
    },
    {
        "Afar": "Afar People"
    },
    {
        " Sultans with the French. It was subsequently renamed to the ": null
    },
    {
        "French Territory of the Afars and the Issas": "French Territory Of The Afars And The Issas"
    },
    {
        " in 1967. A decade later, the Djiboutian people voted for independence, officially marking the establishment of the ": null
    },
    {
        "Republic of Djibouti": "Republic Of Djibouti"
    },
    {
        ".          The Djibouti area has been inhabited since at least the ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " 12,000 years ago. Pottery predating the mid-2nd millennium BC has been found at ": null
    },
    {
        "Asa Koma": "Asa Koma"
    },
    {
        ", an inland lake area on the Gobaad Plain. The sites ware is characterized by punctate and incision geometric designs, which bear a similarity to the Sabir culture phase 1 ceramics from Malayba in ": null
    },
    {
        "Southern Arabia": "Southern Arabia"
    },
    {
        ".  Long-horned humpless cattle bones have also been discovered at Asa Koma, suggesting that domesticated cattle was present by around 3,500 years ago.  Rock art of what appear to be antelopes and a giraffe are likewise found at ": null
    },
    {
        "Dorra": "Dorra"
    },
    {
        " and ": null
    },
    {
        "Balho": "Balho"
    },
    {
        ".  A team of archaeologists discovered funds stone houses, the walls of a rectangular edifice with orienteer recess to ": null
    },
    {
        "Mecca": "Mecca"
    },
    {
        ". They have also updated shards of ceramics, chipped stone tools and a glass bead. The oldest engravings discovered to date are from the fourth or third millennium BC in the pre-": null
    },
    {
        "Islamic": "Islamic"
    },
    {
        " period, the most famous is the site of ": null
    },
    {
        "Handoga": "Handoga"
    },
    {
        " there where the ruins of a village squares subcircular dry stone delivered different objects.  An old settlement, Handoga is the site of numerous ancient ruins and buildings, many of obscure origins, including ceramic shards, matching vases used brazier , containers that can hold water, several choppers and ": null
    },
    {
        "microliths": "Microlith"
    },
    {
        ", blades, drills, trenchers basalt, rhyolite or obsidian. A team of archaeologists discovered an ": null
    },
    {
        "elephant": "Elephant"
    },
    {
        " 1.6 million years BC near the area. They also found a pearl orange coralline, three glass paste , but there were no ": null
    },
    {
        "metal": "Metal"
    },
    {
        " objects discovered.                Together with northern ": null
    },
    {
        "Somalia": "Somalia"
    },
    {
        ", ": null
    },
    {
        "Eritrea": "Eritrea"
    },
    {
        " and the ": null
    },
    {
        "Red Sea": "Red Sea"
    },
    {
        " coast of ": null
    },
    {
        "Sudan": "Sudan"
    },
    {
        ", Djibouti is considered the most likely location of the land known to the ancient ": null
    },
    {
        "Egyptians": "Egyptians"
    },
    {
        " as  Punt  . The old territorys first mention dates to the 25th century BC. Simson Najovits, Egypt, trunk of the tree, Volume 2, , p.258. The Puntites were a nation of people that had close relations with ": null
    },
    {
        "Ancient Egypt": "Ancient Egypt"
    },
    {
        " during the times of ": null
    },
    {
        "Pharaoh": "Pharaoh"
    },
    {
        " Sahure": "Sahure"
    },
    {
        " of the fifth dynasty and ": null
    },
    {
        "Queen": "Queen Regnant"
    },
    {
        " Hatshepsut": "Hatshepsut"
    },
    {
        " of the eighteenth dynasty. They traded not only in their own produce of incense, ": null
    },
    {
        "ebony": "Ebony"
    },
    {
        " and ": null
    },
    {
        "short-horned cattle": "Shorthorn"
    },
    {
        ", but also in goods from other neighbouring regions, including gold, ": null
    },
    {
        "ivory": "Ivory"
    },
    {
        " and animal skins. Tyldesley, Hatchepsut, p.147 According to the temple reliefs at ": null
    },
    {
        "Deir el-Bahari": "Deir El-Bahari"
    },
    {
        ", the Land of Punt at the time of Hatshepsut was ruled by King Parahu and Queen Ati. , vol. 1.             ": null
    },
    {
        "Islam": "Islam"
    },
    {
        " was introduced to the area early on from the ": null
    },
    {
        "Arabian peninsula": "Arabian Peninsula"
    },
    {
        ", shortly after the ": null
    },
    {
        "hijra": "Hijra"
    },
    {
        ". ": null
    },
    {
        "Zeilas": "Zeila"
    },
    {
        " two-": null
    },
    {
        "mihrab": "Mihrab"
    },
    {
        " Masjid al-Qiblatayn": "Masjid Al-Qiblatayn"
    },
    {
        " dates to the 7th century, and is the oldest ": null
    },
    {
        "mosque": "Mosque"
    },
    {
        " in the city.  In the late 9th century, ": null
    },
    {
        "Al-Yaqubi": "Al-Yaqubi"
    },
    {
        " wrote that ": null
    },
    {
        "Muslims": "Muslim"
    },
    {
        " were living along the northern Horn seaboard.  He also mentioned that the Adal kingdom had its capital in Zeila, a port city in the northwestern ": null
    },
    {
        "Awdal": "Awdal"
    },
    {
        " region abutting Djibouti.  This suggests that the ": null
    },
    {
        "Adal Sultanate": "Adal Sultanate"
    },
    {
        " with Zeila as its headquarters dates back to at least the 9th or 10th century. According to I.M. Lewis, the polity was governed by local dynasties consisting of Somalized Arabs or Arabized Somalis, who also ruled over the similarly-established ": null
    },
    {
        "Sultanate of Mogadishu": "Sultanate Of Mogadishu"
    },
    {
        " in the ": null
    },
    {
        "Benadir": "Benadir"
    },
    {
        " region to the south. Adals history from this founding period forth would be characterized by a succession of battles with neighbouring ": null
    },
    {
        "Abyssinia": "Ethiopian Empire"
    },
    {
        ". At its height, the Adal kingdom controlled large parts of modern-day ": null
    },
    {
        "Djibouti": "Djibouti"
    },
    {
        ", ": null
    },
    {
        "Somalia": "Somalia"
    },
    {
        ", ": null
    },
    {
        "Eritrea": "Eritrea"
    },
    {
        " and Ethiopia. Between ": null
    },
    {
        "Djibouti City": "Djibouti City"
    },
    {
        " and ": null
    },
    {
        "Loyada": "Loyada"
    },
    {
        " are a number of anthropomorphic and phallic ": null
    },
    {
        "stelae": "Stele"
    },
    {
        ". The structures are associated with graves of rectangular shape flanked by vertical slabs, as also found in ": null
    },
    {
        "Tiya": "Tiya"
    },
    {
        ", central ": null
    },
    {
        "Ethiopia": "Ethiopia"
    },
    {
        ". The Djibouti-Loyada stelae are of uncertain age, and some of them are adorned with a T-shaped symbol.  Additionally, archaeological excavations at Tiya have yielded tombs.  As of 1997, 118 stelae were reported in the area. Along with the stelae in the ": null
    },
    {
        "Hadiya Zone": "Hadiya Zone"
    },
    {
        ", the structures are identified by local residents as Yegragn Dingay or Grans stone , in reference to Imam ": null
    },
    {
        "Ahmad ibn Ibrahim al-Ghazi": "Ahmad Ibn Ibrahim Al-Ghazi"
    },
    {
        " , ruler of the ": null
    },
    {
        "Adal Sultanate": "Adal Sultanate"
    },
    {
        ".           The ": null
    },
    {
        "Ifat Sultanate": "Ifat Sultanate"
    },
    {
        " was a medieval kingdom in the Horn of Africa. Founded in 1285 by the ": null
    },
    {
        "Walashma dynasty": "Walashma Dynasty"
    },
    {
        ", it was centered in ": null
    },
    {
        "Zeila": "Zeila"
    },
    {
        ". J. Gordon Melton and Martin Baumann, Religions of the World, Second Edition: A Comprehensive Encyclopedia of Beliefs and Practices, page 2663 Asafa Jalata, State Crises, Globalisation, And National Movements In North-east Africa page 3-4 Ifat established bases in Djibouti and northern Somalia, and from there expanded southward to the ": null
    },
    {
        "Ahmar Mountains": "Ahmar Mountains"
    },
    {
        ". Its ": null
    },
    {
        "Sultan": "Sultan"
    },
    {
        " Umar Walashma is recorded as having conquered the Sultanate of ": null
    },
    {
        "Shewa": "Shewa"
    },
    {
        " in 1285. Taddesse Tamrat explains Sultan Umars military expedition as an effort to consolidate the Muslim territories in the Horn, in much the same way as Emperor ": null
    },
    {
        "Yekuno Amlak": "Yekuno Amlak"
    },
    {
        " was attempting to unite the Christian territories in the highlands during the same period. These two states inevitably came into conflict over Shewa and territories further south. A lengthy war ensued, but the Muslim sultanates of the time were not strongly unified. Ifat was finally defeated by Emperor ": null
    },
    {
        "Amda Seyon I": "Amda Seyon I"
    },
    {
        " of Ethiopia in 1332, and withdrew from Shewa.          Governor Abou Baker ordered the Egyptian garrison at ": null
    },
    {
        "Sagallo": "Sagallo"
    },
    {
        " to retire to ": null
    },
    {
        "Zeila": "Zeila"
    },
    {
        ". The cruiser Seignelay reached Sagallo shortly after the Egyptians had departed. French troops occupied the fort despite protests from the British Agent in ": null
    },
    {
        "Aden": "Aden"
    },
    {
        ", Major Frederick Mercer Hunter, who dispatched troops to safeguard British and Egyptian interests in ": null
    },
    {
        "Zeila": "Zeila"
    },
    {
        " and prevent further extension of French influence in that direction.  FRENCH SOMALI COAST Timeline   On the 14 April 1884 the Commander of the patrol sloop L’Inferent reported on the Egyptian occupation in the Gulf of Tadjoura. The Commander of the patrol sloop Le Vaudreuil reported that the Egyptians were occupying the interior between ": null
    },
    {
        "Obock": "Obock"
    },
    {
        " and ": null
    },
    {
        "Tadjoura": "Tadjoura"
    },
    {
        ". Emperor Johannes IV of Ethiopia signed an accord with the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " to cease fighting the Egyptians and to allow the evacuation of Egyptian forces from ": null
    },
    {
        "Ethiopia": "Ethiopia"
    },
    {
        " and the Somali Coast ports.   The Egyptian garrison was withdrawn from ": null
    },
    {
        "Tadjoura": "Tadjoura"
    },
    {
        ". Léonce Lagarde deployed a patrol sloop to ": null
    },
    {
        "Tadjoura": "Tadjoura"
    },
    {
        " the following night.             It was ": null
    },
    {
        "Rochet dHericourts": "Rochet Dhericourt"
    },
    {
        " exploration into ": null
    },
    {
        "Shoa": "Shoa, Ethiopia"
    },
    {
        " that marked the beginning of French interest in the Djiboutian coast of the ": null
    },
    {
        "Red Sea": "Red Sea"
    },
    {
        ". Further exploration by Henri Lambert, French Consular Agent at Aden, and Captain ": null
    },
    {
        "Fleuriot de Langle": "Fleuriot De Langle"
    },
    {
        " led to a treaty of friendship and assistance between France and the sultans of Raheita, ": null
    },
    {
        "Tadjoura": "Tadjoura"
    },
    {
        ", and Gobaad, from whom the French purchased the anchorage of ": null
    },
    {
        "Obock": "Obock"
    },
    {
        " in 1862.     Growing French interest in the area took place against a backdrop of British activity in Egypt and the opening of the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        " in 1869. Between 1883-87, ": null
    },
    {
        "France": "France"
    },
    {
        " signed various treaties with the then ruling ": null
    },
    {
        "Somali": "Somali People"
    },
    {
        " and ": null
    },
    {
        "Afar": "Afar People"
    },
    {
        "Sultans": "Sultan"
    },
    {
        ", which allowed it to expand the ": null
    },
    {
        "protectorate": "Protectorate"
    },
    {
        " to include the ": null
    },
    {
        "Gulf of Tadjoura": "Gulf Of Tadjoura"
    },
    {
        ". Raph Uwechue, Africa year book and whos who, , p. 209. Hugh Chisholm , The encyclopædia britannica: a dictionary of arts, sciences, literature and general information, Volume 25, , p. 383. ": null
    },
    {
        "Léonce Lagarde": "Léonce Lagarde"
    },
    {
        " was subsequently installed as the protectorates governor. In 1894, he established a permanent French administration in the ": null
    },
    {
        "city of Djibouti": "Djibouti"
    },
    {
        " and named the region Côte française des Somalis , a name which continued until 1967. The territorys border with Ethiopia, marked out in 1897 by France and ": null
    },
    {
        "Emperor Menelik II of Ethiopia": "Emperor Menelik Ii Of Ethiopia"
    },
    {
        ", was later reaffirmed by agreements with ": null
    },
    {
        "Emperor Haile Selassie I of Ethiopia": "Emperor Haile Selassie I Of Ethiopia"
    },
    {
        " in 1945 and 1954.     In 1889, a Russian by the name of Nikolay Ivanovitch Achinov Ashinov, Achinov, Atchinoff or Atchimoff   in Le Progrès Illustré , March 1, 1891 , arrived with settlers, infantry and an ": null
    },
    {
        "Orthodox": "Russian Orthodox Church"
    },
    {
        " priest to ": null
    },
    {
        "Sagallo": "Sagallo"
    },
    {
        " on the ": null
    },
    {
        "Gulf of Tadjoura": "Gulf Of Tadjoura"
    },
    {
        ". The French considered the presence of the Russians as a violation of their territorial rights and dispatched two ": null
    },
    {
        "gunboats": "Gunboat"
    },
    {
        ". The Russians were bombarded and after some loss of life, surrendered. The colonists were deported to ": null
    },
    {
        "Odessa": "Odessa"
    },
    {
        " and the dream of Russian expansion in East Africa came to an end in less than one year.        The administrative capital was moved from Obock in 1896. The city of ": null
    },
    {
        "Djibouti": "Djibouti, Djibouti"
    },
    {
        ", which had a harbor with good access that attracted trade caravans crossing East Africa, became the new administrative capital. The ": null
    },
    {
        "Franco-Ethiopian railway": "Franco-Ethiopian Railway"
    },
    {
        ", linking Djibouti to the heart of Ethiopia, began in 1897 and reached ": null
    },
    {
        "Addis Ababa": "Addis Ababa"
    },
    {
        " in June 1917, increasing the volume of trade passing through the port.          After the Italian ": null
    },
    {
        "invasion and occupation of Ethiopia": "Second Italo-Abyssinian War"
    },
    {
        " in the mid-1930s, constant border skirmishes occurred between French forces in French Somaliland and Italian forces in ": null
    },
    {
        "Italian East Africa": "Italian East Africa"
    },
    {
        ". In June 1940, during the early stages of ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", ": null
    },
    {
        "France fell": "Fall Of France"
    },
    {
        " and the colony was then ruled by the pro-": null
    },
    {
        "Axis": "Axis Powers"
    },
    {
        " Vichy government": "Vichy France"
    },
    {
        ".     British and Commonwealth forces fought the neighboring Italians during the ": null
    },
    {
        "East African Campaign": "East African Campaign"
    },
    {
        ". In 1941, the Italians were defeated and the Vichy forces in French Somaliland were isolated. The Vichy French administration continued to hold out in the colony for over a year after the Italian collapse. In response, the British blockaded the port of ": null
    },
    {
        "Djibouti City": "Djibouti City"
    },
    {
        " but it could not prevent local French from providing information on the passing ship convoys. In 1942, about 4,000 ": null
    },
    {
        "British troops": "British Troops"
    },
    {
        " occupied the city. A local battalion from French Somaliland participated in the ": null
    },
    {
        "Liberation of Paris": "Liberation Of Paris"
    },
    {
        " in 1944.       In 1958, on the eve of neighboring Somalias independence in 1960, a ": null
    },
    {
        "referendum": "French Somaliland Overseas Territory Referendum, 1958"
    },
    {
        " was held in Djibouti to decide whether or not to join the Somali Republic or to remain with France. The referendum turned out in favour of a continued association with France, partly due to a combined yes vote by the sizable Afar ethnic group and resident Europeans. Barrington, Lowell, , , p. 115  There were also reports of widespread ": null
    },
    {
        "vote rigging": "Vote Rigging"
    },
    {
        ", with the French expelling thousands of Somalis before the referendum reached the polls. Kevin Shillington, Encyclopedia of African history, , p. 360 . The majority of those who voted no were Somalis who were strongly in favour of joining a united Somalia as had been proposed by ": null
    },
    {
        "Mahmoud Harbi": "Mahmoud Harbi"
    },
    {
        ", Vice President of the Government Council. Harbi died in a plane crash two years later under mysterious circumstances. United States Joint Publications Research Service, Translations on Sub-Saharan Africa, Issues 464-492, , p.24.     In 1960, with the fall of the ruling Dini administration, ": null
    },
    {
        "Ali Aref Bourhan": "Ali Aref Bourhan"
    },
    {
        ", a Harbist politician, assumed the seat of Vice President of the Government Council of French Somaliland, representing the UNI party.   He would hold that position until 1966.     That same year, France rejected the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " recommendation that it should grant French Somaliland independence. In August, an official visit to the territory by then French President, General ": null
    },
    {
        "Charles de Gaulle": "Charles De Gaulle"
    },
    {
        ", was also met with demonstrations and rioting. A Political Chronology of Africa, , p.132. Newsweek, Volume 81, , p.254. In response to the protests, de Gaulle ordered another referendum.     On 19 March 1967, a ": null
    },
    {
        "second plebiscite": "French Somaliland Independence Referendum, 1967"
    },
    {
        " was held to determine the fate of the territory. Initial results supported a continued but looser relationship with France. Voting was also divided along ethnic lines, with the resident Somalis generally voting for independence, with the goal of eventual reunion with Somalia, and the Afars largely opting to remain associated with France. However, the referendum was again marred by reports of vote rigging on the part of the French authorities, American Universities Field Staff, Northeast Africa series, Volume 15, Issue 1, , p.3. with some 10,000 Somalis deported under the pretext that they did not have valid identity cards. ": null
    },
    {
        "Jean Strouse": "Jean Strouse"
    },
    {
        ", Newsweek, Volume 69, Issues 10-17, , p.48. According to official figures, although the territory was at the time inhabited by 58,240 Somali and 48,270 Afar, only 14,689 Somali were allowed to register to vote versus 22,004 Afar. Africa Research, Ltd, Africa contemporary record: annual survey and documents, Volume 1, , p.264. Somali representatives also charged that the French had simultaneously imported thousands of Afar nomads from neighboring ": null
    },
    {
        "Ethiopia": "Ethiopia"
    },
    {
        " to further tip the odds in their favor, but the French authorities denied this, suggesting that Afars already greatly outnumbered Somalis on the voting lists. Announcement of the plebiscite results sparked civil unrest, including several deaths. France also increased its military force along the frontier. Alvin J. Cottrell, Robert Michael Burrell, Georgetown University. Center for Strategic and International Studies, The Indian Ocean: its political, economic, and military importance, , p.166.          In 1967, shortly after the second referendum was held, the former Côte française des Somalis was renamed to Territoire français des Afars et des Issas. This was both in acknowledgement of the large Afar constituency and to downplay the significance of the Somali composition .     The French Territory of Afars and Issas also differed from French Somaliland in terms of government structure, as the position of governor changed to that of high commissioner. A nine-member council of government was also implemented.     With a steadily enlarging Somali population, the likelihood of a third referendum appearing successful had grown even more dim. The prohibitive cost of maintaining the colony and the fact that after 1975, France found itself to be the last remaining colonial power in Africa was another factor that compelled observers to doubt that the French would attempt to hold on to the territory.     On June 27, 1977, a ": null
    },
    {
        "third vote": "Afars And Issas Independence Referendum, 1977"
    },
    {
        " took place. A landslide 98.8% of the electorate supported disengagement from France, officially marking ": null
    },
    {
        "Djiboutis": "Djibouti"
    },
    {
        " independence.  African Elections Database ": null
    },
    {
        "Hassan Gouled Aptidon": "Hassan Gouled Aptidon"
    },
    {
        ", a Somali politician who had campaigned for a yes vote in the referendum of 1958, eventually became the nations first president .       In 1981, Aptidon turned the country into a one party state by declaring that his party, the Rassemblement Populaire pour le Progrès , was the sole legal one. A ": null
    },
    {
        "civil war": "Djiboutian Civil War"
    },
    {
        " broke out in 1991, between the government and a predominantly Afar rebel group, the ": null
    },
    {
        "Front for the Restoration of Unity and Democracy": "Front For The Restoration Of Unity And Democracy"
    },
    {
        " . The FRUD signed a peace accord with the government in December 1994, ending the conflict. Two FRUD members were made cabinet members, and in the presidential elections of 1999 the FRUD campaigned in support of the RPP.     Aptidon resigned as president 1999, at the age of 83, after being elected to a fifth term in 1997. His successor was his nephew, ": null
    },
    {
        "Ismail Omar Guelleh": "Ismail Omar Guelleh"
    },
    {
        ".     On May 12, 2001, President Ismail Omar Guelleh presided over the signing of what is termed the final peace accord officially ending the decade-long civil war between the government and the armed faction of the FRUD, led by Ahmed Dini Ahmed, an Afar nationalist and former Gouled political ally. The peace accord successfully completed the peace process begun on February 7, 2000 in Paris. ": null
    },
    {
        "Ahmed Dini Ahmed": "Ahmed Dini Ahmed"
    },
    {
        " represented the FRUD.      In the presidential election held April 8, 2005, Ismail Omar Guelleh was re-elected to a second 6-year term at the head of a multi-party coalition that included the FRUD and other major parties. A loose coalition of opposition parties again ": null
    },
    {
        "boycotted the election": "Election Boycott"
    },
    {
        ". Currently, political power is shared by a Somali president and an Afar prime minister, with an Afar career diplomat as Foreign Minister and other cabinet posts roughly divided. However, Issas are predominate in the government, civil service, and the ruling party. That, together with a shortage of non-government employment, has bred resentment and continued political competition between the Issa Somalis and the Afars. In March 2006, Djibouti held its first regional elections and began implementing a decentralization plan. The broad pro-government coalition, including FRUD candidates, again ran unopposed when the government refused to meet opposition preconditions for participation. In the 2008 elections, the opposition Union for a Presidential Majority party boycotted the election, leaving all 65 seats to the ruling RPP. Voter turnout figures were disputed. Guelleh was re-elected in the 2011 presidential election.     Due to its strategic location at the mouth of the ": null
    },
    {
        "Bab el Mandeb": "Bab El Mandeb"
    },
    {
        " gateway to the ": null
    },
    {
        "Red Sea": "Red Sea"
    },
    {
        " and the ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        ", Djibouti also hosts various foreign military bases. ": null
    },
    {
        "Camp Lemonnier": "Camp Lemonnier"
    },
    {
        " is a United States Naval Expeditionary Base,  situated at ": null
    },
    {
        "Djibouti-Ambouli International Airport": "Djibouti-Ambouli International Airport"
    },
    {
        " and home to the ": null
    },
    {
        "Combined Joint Task Force - Horn of Africa": "Combined Joint Task Force - Horn Of Africa"
    },
    {
        " of the ": null
    },
    {
        "U.S. Africa Command": "U.S. Africa Command"
    },
    {
        " .  In 2011, Japan also opened a local naval base staffed by 180 personnel to assist in marine defense. This initiative is expected to generate $30 million in revenue for the Djiboutian government. ": null
    }
]