[
    {
        "      The subject of  homosexuality and Judaism  dates back to the ": null
    },
    {
        "Torah": "Torah"
    },
    {
        ". The book of Vayikra  is traditionally regarded as classifying sexual intercourse between males as a  toeivah  that can be subject to capital punishment by the currently non-existent ": null
    },
    {
        "Sanhedrin": "Sanhedrin"
    },
    {
        " under  halakha  .             The issue has been a subject of contention within modern ": null
    },
    {
        "Jewish denominations": "Jewish Denominations"
    },
    {
        ", and has led to debate and division. Traditionally, Judaism has understood ": null
    },
    {
        "homosexual": "Homosexuality"
    },
    {
        " male intercourse as contrary to Judaism, and this opinion is still maintained by ": null
    },
    {
        "Orthodox Judaism": "Orthodox Judaism"
    },
    {
        ". On the other hand, ": null
    },
    {
        "Reconstructionist Judaism": "Reconstructionist Judaism"
    },
    {
        " and ": null
    },
    {
        "Reform Judaism": "Reform Judaism"
    },
    {
        " do not hold this view, and allow homosexual intercourse and ": null
    },
    {
        "same-sex marriage": "Same-Sex Marriage"
    },
    {
        ". ": null
    },
    {
        "Conservative Judaisms": "Conservative Judaism"
    },
    {
        " Committee on Jewish Law and Standards": "Committee On Jewish Law And Standards"
    },
    {
        ", which until December 2006 held the same position as Orthodoxy, recently issued multiple opinions under its philosophy of ": null
    },
    {
        "pluralism": "Pluralism"
    },
    {
        ", with one opinion continuing to follow the Orthodox position and another opinion substantially liberalizing its view of homosexual sex and relationships, while continuing to regard certain sexual acts as prohibited.     Allen Bennett became the first openly gay rabbi in the United States in 1978.  ": null
    },
    {
        "Lionel Blue": "Lionel Blue"
    },
    {
        " was the first British rabbi to publicly declare himself as gay, which he did in 1980.             The ": null
    },
    {
        "Book of Leviticus": "Book Of Leviticus"
    },
    {
        " refers to ": null
    },
    {
        "male homosexual sexual practices": "Gay Sexual Practices"
    },
    {
        " twice ": null
    },
    {
        "kedeshah": "Qedesha"
    },
    {
        ", nor shall any of the sons of Israel be a ": null
    },
    {
        "Kadesh": "Qedesha"
    },
    {
        ". This has been interpreted as prohibiting the sons of Israel from serving as a homosexual ": null
    },
    {
        "temple prostitute": "Temple Prostitute"
    },
    {
        ".      The story of ": null
    },
    {
        "Ruth and Naomi": "Ruth And Naomi"
    },
    {
        " in the Book of Ruth is also occasionally interpreted as the story of a lesbian couple,   , by ": null
    },
    {
        "Rebecca Alpert": "Rebecca Alpert"
    },
    {
        ", in Reading Ruth: Contemporary Women Reclaim a Sacred Story, edited by J. A. Kates and G.T. Reimer . while the biblical description of the relationship between ": null
    },
    {
        "David and Jonathan": "David And Jonathan"
    },
    {
        " in the Book of Kings is sometimes interpreted as male homosexual love.              Like many similar commandments, the stated punishment for willful violation was the ": null
    },
    {
        "death penalty": "Death Penalty"
    },
    {
        ", though minors under 13 years of age were exempt from this, as from any other penalty . However, even in Biblical times, it was very difficult to get a conviction that would lead to this prescribed punishment. The Jewish ": null
    },
    {
        "Oral Law": "Oral Torah"
    },
    {
        " states that capital punishment would be applicable only if two men were caught in the act of anal sex, if there were two witnesses to the act, if the men involved were warned that they committed a capital offense, and the two men — or the willing party, in case of rape — subsequently acknowledged the warning, but continued to engage in the prohibited act anyway. In fact, there is no account of capital punishment, in regards to this law, in Jewish history.     Rabbinic tradition understands the Torahs system of capital punishment to not be in effect for the past approximately 2,000 years, in the absence of a ": null
    },
    {
        "Sanhedrin": "Sanhedrin"
    },
    {
        " and ": null
    },
    {
        "Temple": "The Third Temple"
    },
    {
        ".      Classical rabbinic Jewish sources do not specifically mention that homosexual attraction is inherently sinful. However, someone who has had homosexual intercourse is considered to have violated a prohibition. If he does ": null
    },
    {
        "teshuva": "Teshuva"
    },
    {
        " , i. e., he ceases his forbidden actions, regrets what he has done, apologizes to God, and makes a binding resolution never to repeat those actions, he is seen to be forgiven by God. Maimonides, Mishneh Torah, Laws of Repentance, Chapter 2       Why lesbianism is not explicitly prohibited in the Bible has become a matter of interpretation. Suggestions range from the idea that in ancient times, only acts in which men emitted semen were defined as sexual, to the assumption that in biblical times, sexual attraction between women did not exist, to the belief that religious rules that apply to men automatically apply to women. Encyclopaedia Judaica | second edition | vol 12 | pg 661 | Lesbianism | Rebecca Alpert     Sexual liaisons between women are, however, viewed as forbidden by Orthodox ": null
    },
    {
        "rabbis": "Rabbinical Literature"
    },
    {
        ". This view is based on a ": null
    },
    {
        "Drash": "Midrash"
    },
    {
        " interpretation of the Biblical verse, Do not follow the ways of Egypt, where you once lived, nor of Canaan, where I will be bringing you. Do not follow any of their customs. .     The Talmud prohibits any activity which it defines as mesolelot or tribadism . The main concern in the Talmud was whether women who carried out acts were eligible to marry a member of ": null
    },
    {
        "the priesthood": "Kohanim"
    },
    {
        ". It was doubtful whether this activity removed their status as a virgin, or made them a harlot. Maimonides suggests that this behavior should not disqualify a woman from marrying a priest. Talmudic law limits the penalty for lesbianism to flagellation, rather than the death penalty. Encyclopaedia Judaica | vol 9 | second edition | pg 518 | Homosexuality       The ": null
    },
    {
        "Babylonian Talmud": "Babylonian Talmud"
    },
    {
        " is one of the few ancient religious texts that makes reference to ": null
    },
    {
        "same-sex marriage": "Same-Sex Marriage"
    },
    {
        "Midrash Rabba": "Midrash Rabba"
    },
    {
        " states: Rabbi Huna in the name of Rabbi Joseph The generation of the flood was not obliterated from the world until they wrote marriage contracts from males and beasts. Genesis Rabba, 26:5       The Pesikta Zutrasa interprets the reason for the prohibition in Leviticus against homosexuality in terms of homosexuality being non-procreative. ": null
    },
    {
        "Nachmanides": "Nachmanides"
    },
    {
        " and the author of the  Sefer Hachinuch  similarly follow this interpretation. Rabbi Joel Roth.  rabbinicalassembly.org 1992.     The ": null
    },
    {
        "Tosafot": "Tosafot"
    },
    {
        ", the ": null
    },
    {
        "Rosh": "Asher Ben Jehiel"
    },
    {
        " and the ": null
    },
    {
        "Ran": "Nissim Of Gerona"
    },
    {
        " understand the reason for the prohibition as that as a result of homosexuality, a man abandons his wife to pursue a homosexual relation.       While a variety of views regarding homosexuality as an inclination or status exist within the ": null
    },
    {
        "Orthodox Jewish": "Orthodox Judaism"
    },
    {
        " community, Orthodox Judaism generally prohibits homosexual conduct. While there is some disagreement about which male homosexual acts come under core prohibitions, the majority of Orthodox Judaism puts male-male ": null
    },
    {
        "anal sex": "Anal Sex"
    },
    {
        " in the category of yehareg veal yaavor, die rather than transgress , the small category of Biblically-prohibited acts which an Orthodox Jew is obligated under the laws of ": null
    },
    {
        "Self-sacrifice under Jewish Law": "Self-Sacrifice Under Jewish Law"
    },
    {
        " to die rather than do. Similarly, some consider lesbianism a martyrdom-demanding transgression if only based upon the principle of abizrayhu .  According to the Talmud, homosexual acts are forbidden between non-Jews as well, and this is included among the sexual restrictions of the ": null
    },
    {
        "Noachide laws": "Noachide Laws"
    },
    {
        ".  The archetypal model in Judaism is marital heterosexuality with celibacy, fornication, incest, bestiality and homosexuality seen to be part of a continuous prism of wrong.      In a speech given in 1986, the Lubavitcher Rebbe, Rabbi ": null
    },
    {
        "Menachem Mendel Schneerson": "Menachem Mendel Schneerson"
    },
    {
        ", discussed individuals who express an inclination towards a particular form of physical relationship in which the libidinal gratification is sought with members of ones own gender . He wrote that society and government must be to offer a helping hand to those who are afflicted with this problem .      Rabbi Dr. ": null
    },
    {
        "Immanuel Jakobovits": "Immanuel Jakobovits"
    },
    {
        ", in his entry Homosexuality in the  Encyclopedia Judaica  , describes the traditional opinion on homosexuality in this way: Jewish law rejects the view that homosexuality is to be regarded merely as a disease or as morally neutral.... Jewish law holds that no hedonistic ethic, even if called love , can justify the morality of homosexuality any more than it can legitimize ": null
    },
    {
        "adultery": "Adultery"
    },
    {
        " or ": null
    },
    {
        "incest": "Incest"
    },
    {
        ", however genuinely such acts may be performed out of love and by mutual consent. Rabbi ": null
    },
    {
        "Norman Lamm": "Norman Lamm"
    },
    {
        "  advocated  that some homosexuals should be viewed as diseased and in need of compassion and treatment, rather than willful rebels who should be ostracized. He distinguishes between six varieties of homosexuals, including genuine homosexuals who have strong preferential erotic feelings for members of the same sex , transitory and situational homosexuals who would prefer heterosexual intercourse but are denied it or seek gain in homosexuality, and heterosexuals who are merely curious.     When ": null
    },
    {
        "Steven Greenberg": "Steven Greenberg"
    },
    {
        ", who received Orthodox rabbinic ordination, publicly announced in 1999 that he was homosexual, there was a significant response from rabbis of all denominations reported in the Jewish newspapers. Rabbi ": null
    },
    {
        "Moshe Tendler": "Moshe Tendler"
    },
    {
        ", a leading rabbi at ": null
    },
    {
        "Yeshiva University": "Yeshiva University"
    },
    {
        ", stated, It is very sad that an individual who attended our yeshiva sunk to the depths of what we consider a depraved society.  As Greenberg has a ": null
    },
    {
        "rabbinic ordination": "Semichah"
    },
    {
        " from the Orthodox rabbinical seminary of Yeshiva University , he is generally described as the first openly gay Orthodox Jewish rabbi.       However, some Orthodox Jews, including many rabbis, dispute his being an Orthodox rabbi.      Orthodox Israeli rabbi ": null
    },
    {
        "Ron Yosef": "Ron Yosef"
    },
    {
        " became in 2009 the first Israeli Orthodox ": null
    },
    {
        "Rabbi": "Rabbi"
    },
    {
        " to come out, by appearing in Uvda , ": null
    },
    {
        "Israels": "Israel"
    },
    {
        " leading investigative television program, in an episode regarding ": null
    },
    {
        "conversion therapies": "Conversion Therapies"
    },
    {
        " in Israel.  Yosef remains in his position as a pulpit Rabbi.  Yosef testified that his Yemenite congregation did not accept him being a homosexual very easily and it took them a while to accept it. He stated that the younger generation strengthened and supported him, while the older generation had a more difficult experience. Yosef received death threats in the year leading up to the ": null
    },
    {
        "2009 Tel Aviv gay centre shooting": "2009 Tel Aviv Gay Centre Shooting"
    },
    {
        ".  In 2013, he stated he is in a relationship with a man. minute 00:39 in a radio interview with Razi Barkay here ": null
    },
    {
        "ganizati": "Ganizati"
    },
    {
        "Isur Mishkav Zacharas opposed to the homosexual ": null
    },
    {
        "orientation": "Sexual Orientation"
    },
    {
        " itselfprayer quorum": null
    },
    {
        "litici": "Litici"
    },
    {
        "i. e., rabbinic leadersseclusiontoeivassaovercoming and taming impulses for forbidden behaviorRCA": null
    },
    {
        "ganizati": "Ganizati"
    },
    {
        "ganizati": "Ganizati"
    },
    {
        "ganizati": "Ganizati"
    },
    {
        " Majesty  Masorti CJLSbut not all ": null
    },
    {
        "die rather than transgress": "Self-Sacrifice Under Jewish Law"
    },
    {
        " offense": null
    },
    {
        "b": "B"
    },
    {
        "now the ": null
    },
    {
        "American Jewish University": "American Jewish University"
    },
    {
        "mara datraequivalent to the CJLSCCARsanctification11 to 1, 1 abstentionrabbinical opinion2009RRAand OHALAH and the Rabbinic Pastors Association": null
    }
]