[
    {
        "                 Hoover Dam is a ": null
    },
    {
        "concrete": "Concrete"
    },
    {
        " arch-gravity dam": "Arch-Gravity Dam"
    },
    {
        " in the ": null
    },
    {
        "Black Canyon": "Black Canyon Of The Colorado"
    },
    {
        " of the ": null
    },
    {
        "Colorado River": "Colorado River"
    },
    {
        ", on the border between the U.S. states of ": null
    },
    {
        "Nevada": "Nevada"
    },
    {
        " and ": null
    },
    {
        "Arizona": "Arizona"
    },
    {
        ". It was constructed between 1931 and 1936 during the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        " and was dedicated on September 30, 1935, by President ": null
    },
    {
        "Franklin D. Roosevelt": "Franklin D. Roosevelt"
    },
    {
        ". Its construction was the result of a massive effort involving thousands of workers, and cost over one hundred lives. Originally known as Boulder Dam from 1933, it was officially renamed Hoover Dam, for ": null
    },
    {
        "President": "President Of The United States"
    },
    {
        " Herbert Hoover": "Herbert Hoover"
    },
    {
        ", by a joint resolution of Congress in 1947.     Since about 1900, the Black Canyon and nearby ": null
    },
    {
        "Boulder Canyon": "Boulder Canyon"
    },
    {
        " had been investigated for their potential to support a dam that would control floods, provide irrigation water and produce ": null
    },
    {
        "hydroelectric power": "Hydroelectric Power"
    },
    {
        ". In 1928, Congress authorized the project. The winning bid to build the dam was submitted by a consortium called ": null
    },
    {
        "Six Companies, Inc.": "Six Companies, Inc."
    },
    {
        ", which began construction of the dam in early 1931. Such a large concrete structure had never been built before, and some of the techniques were unproven. The torrid summer weather and lack of facilities near the site also presented difficulties. Nevertheless, Six Companies turned the dam over to the federal government on March 1, 1936, more than two years ahead of schedule.     Hoover Dam impounds ": null
    },
    {
        "Lake Mead": "Lake Mead"
    },
    {
        ", the largest reservoir in the United States by volume .  The dam is located near ": null
    },
    {
        "Boulder City, Nevada": "Boulder City, Nevada"
    },
    {
        ", a municipality originally constructed for workers on the construction project, about  southeast of ": null
    },
    {
        "Las Vegas": "Las Vegas"
    },
    {
        ", Nevada. The dams generators provide power for public and private utilities in Nevada, Arizona, and California. Hoover Dam is a major tourist attraction; nearly a million people tour the dam each year. The heavily traveled ": null
    },
    {
        "U.S. Route 93": "U.S. Route 93"
    },
    {
        " ran along the dams crest until October 2010, when the ": null
    },
    {
        "Hoover Dam Bypass": "Mike Ocallaghan–Pat Tillman Memorial Bridge"
    },
    {
        " opened.             As the United States developed the Southwest, the Colorado River was seen as a potential source of irrigation water. An initial attempt at diverting the river for irrigation purposes occurred in the late 1890s, when land speculator William Beatty built the ": null
    },
    {
        "Alamo Canal": "Alamo Canal"
    },
    {
        " just north of the Mexican border; the canal dipped into Mexico before running to a desolate area Beatty named the ": null
    },
    {
        "Imperial Valley": "Imperial Valley"
    },
    {
        ". Though water from the Imperial Canal allowed for the widespread settlement of the valley, the canal proved expensive to maintain. After a catastrophic breach that caused the Colorado River to fill the ": null
    },
    {
        "Salton Sea": "Salton Sea"
    },
    {
        ", the ": null
    },
    {
        "Southern Pacific Railroad": "Southern Pacific Railroad"
    },
    {
        " spent $3  million in 1906–07 to stabilize the waterway, an amount it hoped in vain would be reimbursed by the Federal Government. Even after the waterway was stabilized, it proved unsatisfactory because of constant disputes with landowners on the Mexican side of the border.          As the technology of ": null
    },
    {
        "electric power transmission": "Electric Power Transmission"
    },
    {
        " improved, the ": null
    },
    {
        "Lower Colorado": "Lower Colorado River Valley"
    },
    {
        " was considered for its ": null
    },
    {
        "hydroelectric": "Hydroelectric"
    },
    {
        "-power potential. In 1902, the ": null
    },
    {
        "Edison Electric Company of Los Angeles": "Southern California Edison"
    },
    {
        " surveyed the river in the hope of building a  rock dam which could generate . However, at the time, the limit of transmission of electric power was , and there were few customers within that limit. Edison allowed land options it held on the river to lapse—including an option for what became the site of Hoover Dam.     In the following years, the ": null
    },
    {
        "Bureau of Reclamation": "Bureau Of Reclamation"
    },
    {
        " , known as the Reclamation Service at the time, also considered the Lower Colorado as the site for a dam. Service chief ": null
    },
    {
        "Arthur Powell Davis": "Arthur Powell Davis"
    },
    {
        " proposed using dynamite to collapse the walls of Boulder Canyon,  north of the eventual dam site, into the river. The river would carry off the smaller pieces of debris, and a dam would be built incorporating the remaining rubble. In 1922, after considering it for several years, the Reclamation Service finally rejected the proposal, citing doubts about the unproven technique and questions as to whether it would in fact save money.               In 1922, the Reclamation Service presented a report calling for the development of a dam on the Colorado River for flood control and electric power generation. The report was principally authored by Davis, and was called the Fall-Davis report after Interior Secretary ": null
    },
    {
        "Albert Fall": "Albert Fall"
    },
    {
        ". The Fall-Davis report cited use of the Colorado River as a federal concern because the rivers basin covered several states, and the river eventually entered Mexico. Though the Fall-Davis report called for a dam at or near Boulder Canyon , the Reclamation Service found that canyon unsuitable. One potential site at Boulder Canyon was bisected by a ": null
    },
    {
        "geologic fault": "Geologic Fault"
    },
    {
        "; two others were so narrow there was no space for a construction camp at the bottom of the canyon or for a spillway. The Service investigated Black Canyon and found it ideal; a railway could be laid from the railhead in Las Vegas to the top of the dam site. Despite the site change, the dam project was referred to as the Boulder Canyon Project .     With little guidance on water allocation from the ": null
    },
    {
        "Supreme Court": "Supreme Court Of The United States"
    },
    {
        ", proponents of the dam feared endless litigation. A Colorado attorney proposed that the seven states which fell within the rivers basin form an ": null
    },
    {
        "interstate compact": "Interstate Compact"
    },
    {
        ", with the approval of Congress. Such compacts were authorized by ": null
    },
    {
        "Article I of the United States Constitution": "Article I Of The United States Constitution"
    },
    {
        " but had never been concluded among more than two states. In 1922, representatives of seven states met with then-": null
    },
    {
        "Secretary of Commerce": "United States Secretary Of Commerce"
    },
    {
        " Herbert Hoover": "Herbert Hoover"
    },
    {
        ". Initial talks produced no result, but when the Supreme Court handed down the  Wyoming v. Colorado  decision undermining the claims of the upstream states, they became anxious to reach an agreement. The resulting ": null
    },
    {
        "Colorado River Compact": "Colorado River Compact"
    },
    {
        " was signed on November 24, 1922.     Legislation to authorize the dam was introduced repeatedly by two California Republicans, Representative ": null
    },
    {
        "Phil Swing": "Phil Swing"
    },
    {
        " and Senator ": null
    },
    {
        "Hiram Johnson": "Hiram Johnson"
    },
    {
        ", but representatives from other parts of the country considered the project as hugely expensive and one that would mostly benefit California. The ": null
    },
    {
        "1927 Mississippi flood": "1927 Mississippi Flood"
    },
    {
        " made Midwestern and Southern congressmen and senators more sympathetic toward the dam project. On March 12, 1928, the failure of the ": null
    },
    {
        "St. Francis Dam": "St. Francis Dam"
    },
    {
        ", constructed by the city of Los Angeles, caused a disastrous flood that killed up to 600 people. As that dam was a curved-gravity type,  similar in design to the arch-gravity as was proposed for the Black Canyon dam, opponents claimed that the Black Canyon dams safety could not be guaranteed. Congress authorized a board of engineers to review plans for the proposed dam. The Colorado River Board found the project feasible, but warned that should the dam fail, every downstream Colorado River community would be destroyed, and that the river might change course and empty into the Salton Sea. The Board cautioned: To avoid such possibilities, the proposed dam should be constructed on conservative if not ultra-conservative lines.      On December 21, 1928, ": null
    },
    {
        "President Coolidge": "Calvin Coolidge"
    },
    {
        " signed the bill authorizing the dam. The Boulder Canyon Project Act appropriated $165  million for the Hoover Dam along with the downstream ": null
    },
    {
        "Imperial Dam": "Imperial Dam"
    },
    {
        " and ": null
    },
    {
        "All-American Canal": "All-American Canal"
    },
    {
        ", a replacement for Beattys canal entirely on the U.S. side of the border. It also permitted the compact to go into effect when at least six of the seven states approved it. This occurred on March 6, 1929, with Utahs ratification; Arizona did not approve it until 1944.          Even before Congress approved the Boulder Canyon Project, the Bureau of Reclamation was considering what kind of dam should be used. Officials eventually decided on a massive concrete ": null
    },
    {
        "arch-gravity dam": "Arch-Gravity Dam"
    },
    {
        ", the design of which was overseen by the Bureaus chief design engineer ": null
    },
    {
        "John L. Savage": "John L. Savage"
    },
    {
        ". The monolithic dam would be thick at the bottom and thin near the top, and would present a convex face towards the water above the dam. The curving arch of the dam would transmit the waters force into the abutments, in this case the rock walls of the canyon. The wedge-shaped dam would be  thick at the bottom, narrowing to  at the top, leaving room for a highway connecting Nevada and Arizona.     On January 10, 1931, the Bureau made the bid documents available to interested parties, at five dollars a copy. The government was to provide the materials; but the contractor was to prepare the site and build the dam. The dam was described in minute detail, covering 100  pages of text and 76  drawings. A $2  million ": null
    },
    {
        "bid bond": "Bid Bond"
    },
    {
        " was to accompany each bid; the winner would have to post a $5  million ": null
    },
    {
        "performance bond": "Performance Bond"
    },
    {
        ". The contractor had seven years to build the dam, or penalties would ensue.     The ": null
    },
    {
        "Wattis Brothers": "Wattis Brothers"
    },
    {
        ", heads of the ": null
    },
    {
        "Utah Construction Company": "Utah Construction Company"
    },
    {
        ", were interested in bidding on the project, but lacked the money for the performance bond. They lacked sufficient resources even in combination with their longtime partners, ": null
    },
    {
        "Morrison-Knudsen": "Morrison-Knudsen"
    },
    {
        ", which employed the nations leading dam builder, ": null
    },
    {
        "Frank Crowe": "Frank Crowe"
    },
    {
        ". They formed a joint venture to bid for the project with Pacific Bridge Company of ": null
    },
    {
        "Portland, Oregon": "Portland, Oregon"
    },
    {
        "; ": null
    },
    {
        "Henry J. Kaiser": "Henry J. Kaiser"
    },
    {
        " & W. A. ": null
    },
    {
        "Bechtel Company": "Bechtel Corporation"
    },
    {
        " of San Francisco; MacDonald & Kahn Ltd. of Los Angeles; and the J.F. Shea Company of Portland, Oregon. The joint venture was called ": null
    },
    {
        "Six Companies, Inc.": "Six Companies, Inc."
    },
    {
        " as Bechtel and Kaiser were considered one company for purposes of Six in the name. The name was descriptive and was an inside joke among the San Franciscans in the bid, where Six Companies was also a ": null
    },
    {
        "Chinese benevolent association in the city": "Chinese Consolidated Benevolent Association"
    },
    {
        ". There were three valid bids, and Six Companies bid of $48,890,955 was the lowest, within $24,000 of the confidential government estimate of what the dam would cost to build, and five million dollars less than the next-lowest bid.     The city of Las Vegas had lobbied hard to be the headquarters for the dam construction, closing its many ": null
    },
    {
        "speakeasies": "Speakeasy"
    },
    {
        " when the decision maker, Secretary of the Interior ": null
    },
    {
        "Ray Wilbur": "Ray Wilbur"
    },
    {
        ", came to town. Instead, Wilbur announced in early 1930 that a model city was to be built in the desert near the dam site. This town became known as ": null
    },
    {
        "Boulder City, Nevada": "Boulder City, Nevada"
    },
    {
        ". Construction of a rail line joining Las Vegas and the dam site began in September 1930.                       Soon after the dam was authorized, increasing numbers of unemployed people converged on southern Nevada. Las Vegas, then a small city of some 5,000, saw between 10,000 and 20,000 unemployed descend on it. A government camp was established for surveyors and other personnel near the dam site; this soon became surrounded by a squatters camp. Known as McKeeversville, the camp was home to men hoping for work on the project, together with their families. Another camp, on the flats along the Colorado River, was officially called Williamsville, but was known to its inhabitants as Ragtown . When construction began, Six Companies hired large numbers of workers, with more than 3,000 on the payroll by 1932 and with employment peaking at 5,251 in July 1934. Mongolian labor was prevented by the construction contract, while the number of blacks employed by Six Companies never exceeded thirty, mostly lowest-pay-scale laborers in a segregated crew, who were issued separate water buckets.     As part of the contract, Six Companies, Inc. was to build Boulder City to house the workers. The original timetable called for Boulder City to be built before the dam project began, but President Hoover ordered work on the dam to begin in March 1931 rather than in October. The company built bunkhouses, attached to the canyon wall, to house 480  single men at what became known as River Camp. Workers with families were left to provide their own accommodations until Boulder City could be completed, and many lived in Ragtown. The site of Hoover Dam endures extremely hot weather, and the summer of 1931 was especially torrid, with the daytime high averaging . Sixteen workers and other riverbank residents died of ": null
    },
    {
        "heat prostration": "Heat Prostration"
    },
    {
        " between June 25 and July 26, 1931.          The ": null
    },
    {
        "Industrial Workers of the World": "Industrial Workers Of The World"
    },
    {
        " , though much-reduced from their heyday as militant labor organizers in the early years of the century, hoped to unionize the Six Companies workers by capitalizing on their discontent. They sent eleven organizers, several of whom were arrested by Las Vegas police. On August 7, 1931, the company cut wages for all tunnel workers. Although the workers sent the organizers away, not wanting to be associated with the Wobblies , they formed a committee to represent them with the company. The committee drew up a list of demands that evening and presented them to Crowe the following morning. He was noncommittal. The workers hoped that Crowe, the general superintendent of the job, would be sympathetic; instead he gave a scathing interview to a newspaper, describing the workers as malcontents .     On the morning of the 9th, Crowe met with the committee and told them that management refused their demands, was stopping all work, and was laying off the entire work force, except for a few office workers and carpenters. The workers were given until 5  p.m. to vacate the premises. Concerned that a violent confrontation was imminent, most workers took their paychecks and left for Las Vegas to await developments. Two days later, the remainder were talked into leaving by law enforcement. On August 13, the company began hiring workers again, and two days later, the strike was called off. While the workers received none of their demands, the company guaranteed there would be no further reductions in wages. Living conditions began to improve as the first residents moved into Boulder City in late 1931.     A second labor action took place in July 1935, as construction on the dam wound down. When a Six Companies manager altered working times to force workers to take lunch on their own time, workers responded with a strike. Emboldened by Crowes reversal of the lunch decree, workers raised their demands to include a $1-per-day raise. The company agreed to ask the Federal government to supplement the pay, but no money was forthcoming from Washington. The strike ended.          Before the dam could be built, the ": null
    },
    {
        "Colorado River": "Colorado River"
    },
    {
        " needed to be diverted away from the construction site. To accomplish this, four diversion tunnels were driven through the canyon walls, two on the ": null
    },
    {
        "Nevada": "Nevada"
    },
    {
        " side and two on the ": null
    },
    {
        "Arizona": "Arizona"
    },
    {
        " side. These tunnels were  in diameter. Their combined length was nearly 16,000  ft, or more than . The contract required these tunnels to be completed by October 1, 1933, with a $3,000-per-day fine to be assessed for any delay. To meet the deadline, Six Companies had to complete work by early 1933, since only in late fall and winter was the water level in the river low enough to safely divert.     Tunneling began at the lower portals of the Nevada tunnels in May 1931. Shortly afterward, work began on two similar tunnels in the Arizona canyon wall. In March 1932, work began on lining the tunnels with concrete. First the base, or invert, was poured. ": null
    },
    {
        "Gantry crane": "Gantry Crane"
    },
    {
        "s, running on rails through the entire length of each tunnel were used to place the concrete. The sidewalls were poured next. Movable sections of steel forms were used for the sidewalls. Finally, using pneumatic guns, the overheads were filled in. The concrete lining is  thick, reducing the finished tunnel diameter to . The river was diverted into the two Arizona tunnels on November 13, 1932; the Nevada tunnels were kept in reserve for high water. This was done by exploding a temporary ": null
    },
    {
        "cofferdam": "Cofferdam"
    },
    {
        " protecting the Arizona tunnels while at the same time dumping rubble into the river until its natural course was blocked.     Following the completion of the dam, the entrances to the two outer diversion tunnels were sealed at the opening and halfway through the tunnels with large concrete plugs. The downstream halves of the tunnels following the inner plugs are now the main bodies of the spillway tunnels. The inner diversion tunnels were plugged at approximately one-third of their length, beyond which they now carry steel pipes connecting the intake towers to the power plant and outlet works. The inner tunnels outlets are equipped with gates that can be closed to drain the tunnels for maintenance.       To protect the construction site from the Colorado River and to facilitate the rivers diversion, two cofferdams were constructed. Work on the upper cofferdam began in September 1932, even though the river had not yet been diverted. The cofferdams were designed to protect against the possibility of the rivers flooding a site at which two thousand men might be at work, and their specifications were covered in the bid documents in nearly as much detail as the dam itself. The upper cofferdam was  high, and  thick at its base, thicker than the dam itself. It contained  of material.          When the cofferdams were in place and the construction site was drained of water, excavation for the dam foundation began. For the dam to rest on solid rock, it was necessary to remove ": null
    },
    {
        "accumulated erosion soils": "Fluvial"
    },
    {
        " and other loose materials in the riverbed until sound bedrock was reached. Work on the foundation excavations was completed in June 1933. During this excavation, approximately  of material was removed. Since the dam was an arch-gravity type, the side-walls of the canyon would bear the force of the impounded lake. Therefore, the side-walls were excavated too, to reach virgin rock, as weathered rock might provide pathways for water seepage. Shovels for the excavation came from the ": null
    },
    {
        "Marion Power Shovel Company": "Marion Power Shovel Company"
    },
    {
        ". Olberhelman, Olberhelman, and Lampe. Quail Lakes & Coal: Energy for Wildlife ... and the World, 2013, page 60     The men who removed this rock were called high scalers . While suspended from the top of the canyon with ropes, the high-scalers climbed down the canyon walls and removed the loose rock with ": null
    },
    {
        "jackhammers": "Jackhammers"
    },
    {
        " and ": null
    },
    {
        "dynamite": "Dynamite"
    },
    {
        ". Falling objects were the most common cause of death on the dam site; the high scalers work thus helped ensure worker safety. One high scaler was able to save a life in a more direct manner: when a government inspector lost his grip on a safety line and began tumbling down a slope towards almost certain death, a high scaler was able to intercept him and pull him into the air. The construction site had, even then, become a magnet for tourists; the high scalers were prime attractions and showed off for the watchers. The high scalers received considerable media attention, with one worker dubbed the Human Pendulum for swinging co-workers across the canyon. To protect themselves against falling objects, some high scalers took cloth hats and dipped them in tar, allowing them to harden. When workers wearing such headgear were struck hard enough to inflict broken jaws, they sustained no skull damage. Six Companies ordered thousands of what initially were called hard boiled hats  and strongly encouraged their use.     The cleared, underlying rock foundation of the dam site was reinforced with ": null
    },
    {
        "grout": "Grout"
    },
    {
        ", forming a ": null
    },
    {
        "grout curtain": "Grout Curtain"
    },
    {
        ". Holes were driven into the walls and base of the canyon, as deep as  into the rock, and any cavities encountered were to be filled with grout. This was done to stabilize the rock, to prevent water from seeping past the dam through the canyon rock, and to limit uplift —upward pressure from water seeping under the dam. The workers were under severe time constraints due to the beginning of the concrete pour, and when they encountered hot springs or cavities too large to readily fill, they moved on without resolving the problem. A total of 58 of the 393 holes were incompletely filled. After the dam was completed and the lake began to fill, large numbers of significant leaks into the dam caused the Bureau of Reclamation to look into the situation. It found that the work had been incompletely done, and was based on less than a full understanding of the canyons geology. New holes were drilled from inspection galleries inside the dam into the surrounding bedrock. It took nine years under relative secrecy to complete the supplemental grout curtain.              The first concrete was poured into the dam on June 6, 1933, 18  months ahead of schedule. Since concrete ": null
    },
    {
        "heats and contracts": "Thermal Expansion"
    },
    {
        " as it cures, the potential for uneven cooling and contraction of the concrete posed a serious problem. Bureau of Reclamation engineers calculated that if the dam were to be built in a single continuous pour, the concrete would take 125 years to cool, and the resulting stresses would cause the dam to crack and crumble. Instead, the ground where the dam would rise was marked with rectangles, and concrete blocks in columns were poured, some as large as  and  high. Each five-foot form contained a set of  steel pipes; cool riverwater would be poured through the pipes, followed by ice-cold water from a ": null
    },
    {
        "refrigeration": "Refrigeration"
    },
    {
        " plant. When an individual block had cured and had stopped contracting, the pipes were filled with ": null
    },
    {
        "grout": "Grout"
    },
    {
        ". Grout was also used to fill the hairline spaces between columns, which were grooved to increase the strength of the joints.     The concrete was delivered in huge steel buckets  and almost 7  feet in diameter; Crowe was awarded two patents for their design. These buckets, which weighed  when full, were filled at two massive concrete plants on the Nevada side, and were delivered to the site in special ": null
    },
    {
        "railcars": "Railroad Car"
    },
    {
        ". The buckets were then suspended from aerial ": null
    },
    {
        "cableways": "Cableway"
    },
    {
        "which were used to deliver the bucket to a specific column. As the required grade of ": null
    },
    {
        "aggregate": "Construction Aggregate"
    },
    {
        " in the concrete differed depending on placement in the dam , it was vital that the bucket be maneuvered to the proper column. When the bottom of the bucket opened up, disgorging  of concrete, a team of men worked it throughout the form. Although there are myths that men were caught in the pour and are entombed in the dam to this day, each bucket deepened the concrete in a form by only an inch, and Six Companies engineers would not have permitted a flaw caused by the presence of a human body.     A total of  of concrete was used in the dam before concrete pouring ceased on May 29, 1935. In addition,  were used in the power plant and other works. More than  of cooling pipes were placed within the concrete. Overall, there is enough concrete in the dam to pave a two-lane highway from San Francisco to New York. Concrete cores were removed from the dam for testing in 1995; they showed that Hoover Dams concrete has continued to slowly gain strength and the dam is composed of a durable concrete having a compressive strength exceeding the range typically found in normal mass concrete . Hoover Dam concrete is not subject to ": null
    },
    {
        "alkali–silica reaction": "Alkali–Silica Reaction"
    },
    {
        " , as the Hoover Dam builders happened to use nonreactive aggregate, unlike that at downstream ": null
    },
    {
        "Parker Dam": "Parker Dam"
    },
    {
        ", where ASR has caused measurable deterioration.              With most work finished on the dam itself , a formal dedication ceremony was arranged for September 30, 1935, to coincide with a western tour being made by President ": null
    },
    {
        "Franklin D. Roosevelt": "Franklin D. Roosevelt"
    },
    {
        ". The morning of the dedication, it was moved forward three hours from 2  p.m. Pacific time to 11  a.m.; this was done because ": null
    },
    {
        "Secretary of the Interior": "United States Secretary Of The Interior"
    },
    {
        " Harold L. Ickes": "Harold L. Ickes"
    },
    {
        " had reserved a radio slot for the President for 2  p.m. but officials did not realize until the day of the ceremony that the slot was for 2  p.m. Eastern Time. Despite the change in the ceremony time, and temperatures of , 10,000  people were present for the Presidents speech, in which he avoided mentioning the name of former President Hoover, who was not invited to the ceremony. To mark the occasion, a three-cent stamp was issued by the ": null
    },
    {
        "United States Post Office Department": "United States Post Office Department"
    },
    {
        "—bearing the name Boulder Dam , the official name of the dam between 1933 and 1947. After the ceremony, Roosevelt made the first visit by any American president to Las Vegas.     Most work had been completed by the dedication, and Six Companies negotiated with the government through late 1935 and early 1936 to settle all claims and arrange for the formal transfer of the dam to the Federal Government. The parties came to an agreement and on March 1, 1936, Secretary Ickes formally accepted the dam on behalf of the government. Six Companies was not required to complete work on one item, a concrete plug for one of the bypass tunnels, as the tunnel had to be used to take in irrigation water until the powerhouse went into operation.            There were 112  deaths reported as associated with the construction of the dam. The first was J. G. Tierney, a surveyor who drowned on December 20, 1922, while looking for an ideal spot for the dam. The last death on the projects official fatality list occurred on December 20, 1935, when an electricians helper, Patrick Tierney, the son of J. G. Tierney, fell from an intake tower. Included in the fatality list are three workers, one in 1932 and two in 1933, who took their own lives onsite.    Ninety-six of the deaths occurred during construction at the site. Of the 112  fatalities, 91 were Six Companies employees, three were BOR employees, and one was a visitor to the site, with the remainder employees of various contractors not part of Six Companies.     Not included in the official number of fatalities were deaths that were recorded as ": null
    },
    {
        "pneumonia": "Pneumonia"
    },
    {
        ". Workers alleged that this diagnosis was a cover for death from ": null
    },
    {
        "carbon monoxide": "Carbon Monoxide"
    },
    {
        " poisoning , and a classification used by Six Companies to avoid paying compensation claims. The sites diversion tunnels frequently reached , enveloped in thick plumes of vehicle exhaust gases. A total of 42  workers were recorded as having died from pneumonia and were not included in the above total; none were listed as having died from carbon monoxide poisoning. No deaths of non-workers from pneumonia were recorded in Boulder City during the construction period.       The initial plans for the facade of the dam, the power plant, the outlet tunnels and ornaments clashed with the modern look of an arch dam. The Bureau of Reclamation, more concerned with the dams functionality, adorned it with a ": null
    },
    {
        "Gothic": "Gothic Architecture"
    },
    {
        "-inspired ": null
    },
    {
        "balustrade": "Baluster"
    },
    {
        " and eagle statues. This initial design was criticized by many as being too plain and unremarkable for a project of such immense scale, so Los Angeles-based architect ": null
    },
    {
        "Gordon B. Kaufmann": "Gordon Kaufmann"
    },
    {
        ", then the supervising architect to the Bureau of Reclamation, was brought in to redesign the exteriors. Kaufmann greatly streamlined the design and applied an elegant ": null
    },
    {
        "Art Deco": "Art Deco"
    },
    {
        " style to the entire project. He designed sculpted turrets rising seamlessly from the dam face and clock faces on the intake towers set for the time in Nevada and Arizona  — both states are in different time zones, but since Arizona does not observe ": null
    },
    {
        "Daylight Saving Time": "Daylight Saving Time"
    },
    {
        ", the clocks display the same time for more than half the year.           At Kaufmanns request, Denver artist ": null
    },
    {
        "Allen Tupper True": "Allen Tupper True"
    },
    {
        " was hired to handle the design and decoration of the walls and floors of the new dam. Trues design scheme incorporated motifs of the ": null
    },
    {
        "Navajo": "Navajo People"
    },
    {
        " and ": null
    },
    {
        "Pueblo": "Pueblo"
    },
    {
        " tribes of the region. Although some were initially opposed to these designs, True was given the go-ahead and was officially appointed consulting artist. With the assistance of the National Laboratory of Anthropology, True researched authentic decorative motifs from Indian sand paintings, textiles, baskets and ceramics. The images and colors are based on Native American visions of rain, lightning, water, clouds, and local animals  — lizards, serpents, birds  — and on the Southwestern landscape of stepped mesas. In these works, which are integrated into the walkways and interior halls of the dam, True also reflected on the machinery of the operation, making the symbolic patterns appear both ancient and modern.     With the agreement of Kaufmann and the engineers, True also devised for the pipes and machinery an innovative color-coding which was implemented throughout all BOR projects. Trues consulting artist job lasted through 1942; it was extended so he could complete design work for the ": null
    },
    {
        "Parker": "Parker Dam"
    },
    {
        ", ": null
    },
    {
        "Shasta": "Shasta Dam"
    },
    {
        " and ": null
    },
    {
        "Grand Coulee": "Grand Coulee Dam"
    },
    {
        " dams and power plants. Trues work on the Hoover Dam was humorously referred to in a poem published in  The New Yorker , part of which read, lose the spark, and justify the dream; but also worthy of remark will be the color scheme .     Complementing Kaufmann and Trues work, sculptor ": null
    },
    {
        "Oskar J.W. Hansen": "Oskar J.W. Hansen"
    },
    {
        " designed many of the sculptures on and around the dam. His works include the monument of dedication plaza, a plaque to memorialize the workers killed and the ": null
    },
    {
        "bas-reliefs": "Relief"
    },
    {
        " on the elevator towers. In his words, Hansen wanted his work to express the immutable calm of intellectual resolution, and the enormous power of trained physical strength, equally enthroned in placid triumph of scientific accomplishment , because e building of Hoover Dam belongs to the sagas of the daring. Hansens dedication plaza, on the Nevada abutment, contains a sculpture of two winged figures flanking a flagpole.        Surrounding the base of the monument is a ": null
    },
    {
        "terrazzo": "Terrazzo"
    },
    {
        " floor embedded with a star map . The map depicts the Northern Hemisphere sky at the moment of President Roosevelts dedication of the dam. This is intended to help future astronomers, if necessary, calculate the exact date of dedication.  The  bronze figures, dubbed Winged Figures of the Republic , were both formed in a continuous pour. To put such large bronzes into place without marring the highly polished bronze surface, they were placed on ice and guided into position as the ice melted. Hansens bas-relief on the Nevada elevator tower depicts the benefits of the dam: flood control, navigation, irrigation, water storage, and power. The bas-relief on the Arizona elevator depicts, in his words, the visages of those Indian tribes who have inhabited mountains and plains from ages distant.            Excavation for the powerhouse was carried out simultaneously with the excavation for the dam foundation and abutments. The excavation of this U-shaped structure located at the downstream toe of the dam was completed in late 1933 with the first concrete placed in November 1933. Filling of Lake Mead began February 1, 1935, even before the last of the concrete was poured that May. The powerhouse was one of the projects uncompleted at the time of the formal dedication on September 30, 1935; a crew of 500  men remained to finish it and other structures. To make the powerhouse roof bombproof, it was constructed of layers of concrete, rock, and steel with a total thickness of about , topped with layers of sand and tar.     In the latter half of 1936, water levels in Lake Mead were high enough to permit power generation, and the first three ": null
    },
    {
        "Allis Chalmers": "Allis Chalmers"
    },
    {
        " built ": null
    },
    {
        "Francis turbine": "Francis Turbine"
    },
    {
        "-": null
    },
    {
        "generators": "Electric Generator"
    },
    {
        ", all on the Nevada side, began operating. In March 1937, one more Nevada generator went online and the first Arizona generator by August. By September 1939, four more generators were operating, and the dams power plant became the largest hydroelectricity facility in the world. The final generator was not placed in service until 1961, bringing the maximum generating capacity to 1,345 megawatts at the time. Original plans called for 16  large generators, eight on each side of the river, but two smaller generators were installed instead of one large one on the Arizona side for a total of 17. The smaller generators were used to serve smaller communities at a time when the output of each generator was dedicated to a single municipality, before the dams total power output was placed on the grid and made arbitrarily distributable.     Before water from Lake Mead reaches the turbines, it enters the intake towers and then four gradually narrowing ": null
    },
    {
        "penstocks": "Penstock"
    },
    {
        "which funnel the water down towards the powerhouse. The intakes provide a maximum ": null
    },
    {
        "hydraulic head": "Hydraulic Head"
    },
    {
        " of  as the water reaches a speed of about . The entire flow of the Colorado River passes through the turbines. The spillways and ": null
    },
    {
        "outlet works": "Outlet Works"
    },
    {
        " are rarely used. The jet-flow gates, located in concrete structures  above the river and also at the outlets of the inner diversion tunnels at river level, may be used to divert water around the dam in emergency or flood conditions, but have never done so, and in practice are used only to drain water from the penstocks for maintenance. Following an ": null
    },
    {
        "uprating": "Grid Energy Storagehydroelectric Dam Uprating"
    },
    {
        " project from 1986 to 1993, the total gross power rating for the plant, including two 2.4 ": null
    },
    {
        "megawatt": "Wattmegawatt"
    },
    {
        " Pelton turbine": "Pelton Turbine"
    },
    {
        "-generators that power Hoover Dams own operations is a maximum capacity of 2080 megawatts. The annual generation of Hoover Dam varies. The maximum net generation was 10.348 ": null
    },
    {
        "TWh": "Terawatt-Hour"
    },
    {
        " in 1984, and the minimum since 1940 was 2.648 TWh in 1956. The average power generated was 4.2 TWh/year for 1947–2008. In 2015, the dam generated 3.6 TWh.      The amount of electricity generated by Hoover Dam has been decreasing along with the ": null
    },
    {
        "falling water level in Lake Mead": "Lake Meaddrought And Water Usage Issues"
    },
    {
        " due to the prolonged drought in the 2010s and high demand for the Colorado Rivers water. Lake Mead fell to a new record low elevation of  on July 1, 2016 before beginning to rebound slowly.  Under its original design, the dam would no longer be able to generate power once the water level fell below , which might have occurred in 2017 had water restrictions not been enforced. To lower the minimum power pool elevation from , five wide-head turbines, designed to work efficiently with less flow, were installed.  Due to the low water levels, by 2014 it was providing power only during periods of peak demand. LADWP or base": null
    },
    {
        "3.38": "3.38"
    },
    {
        "BCPA": null
    }
]