[
    {
        "A horse breed is a ": null
    },
    {
        "selectively bred": "Selective Breeding"
    },
    {
        " population of ": null
    },
    {
        "domesticated": "Domestication"
    },
    {
        " horse": "Horse"
    },
    {
        "s, often with ": null
    },
    {
        "pedigrees": "Pedigree Chart"
    },
    {
        "recorded in a ": null
    },
    {
        "breed registry": "Breed Registry"
    },
    {
        ". However, the term is sometimes used in a very broad sense to define ": null
    },
    {
        "landrace": "Landrace"
    },
    {
        " animals, or ": null
    },
    {
        "naturally selected": "Natural Selection"
    },
    {
        " horses of a common ": null
    },
    {
        "phenotype": "Phenotype"
    },
    {
        " located within a limited geographic region. Depending on definition, hundreds of breeds exist today, developed for many different uses. Horse breeds are loosely divided into three categories based on general temperament: spirited hot bloods with speed and endurance; cold bloods, such as ": null
    },
    {
        "draft horses": "Draft Horse"
    },
    {
        "and some ": null
    },
    {
        "ponies": "Pony"
    },
    {
        ", suitable for slow, heavy work; and ": null
    },
    {
        "warmblood": "Warmblood"
    },
    {
        "s, developed from crosses between hot bloods and cold bloods, often focusing on creating breeds for specific riding purposes, particularly in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ".     Horse breeds are groups of horses with distinctive characteristics that are transmitted consistently to their offspring, such as ": null
    },
    {
        "conformation": "Equine Conformation"
    },
    {
        ", color, performance ability, or disposition. These inherited traits are usually the result of a combination of natural crosses and ": null
    },
    {
        "artificial selection": "Artificial Selection"
    },
    {
        " methods aimed at producing horses for specific tasks. Certain breeds are known for certain talents. For example, ": null
    },
    {
        "Standardbreds": "Standardbred Horse"
    },
    {
        "are known for their speed in ": null
    },
    {
        "harness racing": "Harness Racing"
    },
    {
        ". Some breeds have been developed through centuries of crossings with other breeds, while others, such as ": null
    },
    {
        "Tennessee Walking Horses": "Tennessee Walking Horse"
    },
    {
        "and ": null
    },
    {
        "Morgans": "Morgan Horse"
    },
    {
        ", developed from a ": null
    },
    {
        "single sire": "Foundation Bloodstock"
    },
    {
        " from which all current breed members descend. More than 300  horse breeds exist in the world today. Hedge Horse Conformation pp. 307–308            Modern horse breeds developed in response to a need for form to function , the necessity to develop certain physical characteristics to perform a certain type of work. Sponenberg, The Proliferation of Horse Breeds , p. 155 Thus, powerful but refined breeds such as the ": null
    },
    {
        "Andalusian": "Andalusian Horse"
    },
    {
        " or the ": null
    },
    {
        "Lusitano": "Lusitano"
    },
    {
        " developed in the ": null
    },
    {
        "Iberian peninsula": "Iberian Peninsula"
    },
    {
        " as riding horses that also had a great aptitude for ": null
    },
    {
        "dressage": "Dressage"
    },
    {
        ", while heavy draft horses such as the ": null
    },
    {
        "Clydesdale": "Clydesdale"
    },
    {
        " and the ": null
    },
    {
        "Shire": "Shire Horse"
    },
    {
        " developed out of a need to perform demanding ": null
    },
    {
        "farm": "Farm"
    },
    {
        " work and pull heavy wagons. Sponenberg, The Proliferation of Horse Breeds , pp. 156–57 Ponies of all breeds originally developed mainly from the need for a ": null
    },
    {
        "working animal": "Working Animal"
    },
    {
        " that could fulfill specific local draft and transportation needs while surviving in harsh environments. However, by the 20th century, many pony breeds had ": null
    },
    {
        "Arabian": "Arabian Horse"
    },
    {
        " and other blood added to make a more refined pony suitable for riding. Sponenberg, The Proliferation of Horse Breeds , pp. 155, 170-173 Other horse breeds developed specifically for light agricultural work, heavy and light carriage and road work, various equestrian disciplines, or simply as pets. Sponenberg, The Proliferation of Horse Breeds , p. 162          Horses have been ": null
    },
    {
        "selectively bred": "Selective Breeding"
    },
    {
        " since their ": null
    },
    {
        "domestication": "Domestication Of The Horse"
    },
    {
        ". Today, over 300 breeds of horses are known in the world. However, the concept of ": null
    },
    {
        "purebred": "Purebred"
    },
    {
        " bloodstock and a controlled, written ": null
    },
    {
        "breed registry": "Breed Registry"
    },
    {
        " only became of significant importance in modern times. Today, the standards for defining and registration of different breeds vary. Sometimes, purebred horses are called ": null
    },
    {
        "Thoroughbred": "Thoroughbred"
    },
    {
        "s, which is incorrect; Thoroughbred is a specific breed of horse, while a purebred is a horse with a defined ": null
    },
    {
        "pedigree": "Pedigree Chart"
    },
    {
        " recognized by a breed registry. Ensminger Horses and Horsemanship p. 424     An early example of people who practiced selective horse breeding were the ": null
    },
    {
        "Bedouin": "Bedouin"
    },
    {
        ", who had a reputation for careful breeding practices, keeping extensive pedigrees of their ": null
    },
    {
        "Arabian horses": "Arabian Horse"
    },
    {
        "and placing great value upon pure bloodlines. Edwards The Arabian, pp. 22–23 Though these pedigrees were originally transmitted by an ": null
    },
    {
        "oral tradition": "Oral Tradition"
    },
    {
        ", written pedigrees of Arabian horses can be found that date to the 14th century.  In the same period of the early ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        ", the ": null
    },
    {
        "Carthusian": "Carthusian"
    },
    {
        " monks of southern ": null
    },
    {
        "Spain": "Spain"
    },
    {
        " bred horses and kept meticulous pedigrees of the best bloodstock; the lineage survives to this day in the ": null
    },
    {
        "Andalusian horse": "Andalusian Horse"
    },
    {
        ".  One of the earliest formal registries was ": null
    },
    {
        "General Stud Book": "General Stud Book"
    },
    {
        " for Thoroughbreds, which began in 1791 and traced back to the Arabian stallions imported to England from the Middle East that became the ": null
    },
    {
        "foundation": "Foundation Bloodstock"
    },
    {
        " stallions for the breed.      Some breed registries have a ": null
    },
    {
        "closed stud book": "Closed Stud Book"
    },
    {
        ", where registration is based on pedigree, and no outside animals can gain admittance. For example, a registered ": null
    },
    {
        "Thoroughbred": "Thoroughbred"
    },
    {
        " or Arabian must have two registered parents of the same breed.       Other breeds have a partially closed stud book, but still allow certain infusions from other breeds. For example, the modern ": null
    },
    {
        "Appaloosa": "Appaloosa"
    },
    {
        " must have at least one Appaloosa parent, but may also have a ": null
    },
    {
        "Quarter Horse": "American Quarter Horse"
    },
    {
        ", Thoroughbred, or Arabian parent, so long as the offspring exhibits appropriate color characteristics.  The Quarter Horse normally requires both parents to be registered Quarter Horses, but allows ": null
    },
    {
        " Appendix ": "American Quarter Horse  Appendix   And   Foundation   Horses"
    },
    {
        " registration of horses with one Thoroughbred parent, and the horse may earn its way to full registration by completing certain performance requirements.        ": null
    },
    {
        "Open stud books": "Open Stud Book"
    },
    {
        "exist for horse breeds that either have not yet developed a rigorously defined standard phenotype, or for breeds that register animals that conform to an ideal via the process of passing a ": null
    },
    {
        "studbook selection": "Studbook Selection"
    },
    {
        " process. Most of the ": null
    },
    {
        "warmblood": "Warmblood"
    },
    {
        " breeds used in ": null
    },
    {
        "sport horse": "Sport Horse"
    },
    {
        " disciplines have open stud books to varying degrees. While pedigree is considered, outside bloodlines are admitted to the registry if the horses meet the set standard for the registry. These registries usually require a ": null
    },
    {
        "studbook selection": "Studbook Selection"
    },
    {
        " process involving judging of an individual animals quality, performance, and ": null
    },
    {
        "conformation": "Equine Conformation"
    },
    {
        " before registration is finalized.  A few registries, particularly some ": null
    },
    {
        "color breed": "Color Breed"
    },
    {
        " registries, are very open and will allow membership of all horses that meet limited criteria, such as coat color and species, regardless of pedigree or conformation.       Breed registries also differ as to their acceptance or rejection of breeding technology. For example, all ": null
    },
    {
        "Jockey Club": "Jockey Club"
    },
    {
        " Thoroughbred registries require that a registered Thoroughbred be a product of a natural mating, so-called live cover . A ": null
    },
    {
        "foal": "Foal"
    },
    {
        " born of two Thoroughbred parents, but by means of ": null
    },
    {
        "artificial insemination": "Artificial Insemination"
    },
    {
        " or ": null
    },
    {
        "embryo transfer": "Embryo Transfer"
    },
    {
        ", cannot be registered in the Thoroughbred studbook. However, since the advent of ": null
    },
    {
        "DNA": "Dna"
    },
    {
        " testing to verify parentage, most breed registries now allow artificial insemination, embryo transfer, or both. The high value of stallions has helped with the acceptance of these techniques because they allow a stallion to breed more mares with each collection and greatly reduce the risk of injury during mating.  ": null
    },
    {
        "Cloning": "Cloning"
    },
    {
        " of horses is highly controversial, and at the present time most mainstream breed registries will not accept cloned horses, though several cloned horses and mules have been produced.  Such restrictions have led to legal challenges in the United States, sometime based on state law and sometimes based on antitrust laws.        Horses can ": null
    },
    {
        "crossbreed": "Crossbreed"
    },
    {
        " with other ": null
    },
    {
        "equine": "Equine"
    },
    {
        " species to produce ": null
    },
    {
        "hybrid": "Hybrid"
    },
    {
        "s. These hybrid types are not breeds, but they resemble breeds in that crosses between certain horse breeds and other equine species produce characteristic offspring. The most common hybrid is the ": null
    },
    {
        "mule": "Mule"
    },
    {
        ", a cross between a jack and a ": null
    },
    {
        "mare": "Mare"
    },
    {
        ". A related hybrid, the ": null
    },
    {
        "hinny": "Hinny"
    },
    {
        ", is a cross between a stallion and a ": null
    },
    {
        "jenny": "Jenny"
    },
    {
        " .  Most other hybrids involve the ": null
    },
    {
        "zebra": "Zebra"
    },
    {
        " . With rare exceptions, most equine hybrids are ": null
    },
    {
        "sterile": "Infertility"
    },
    {
        " and cannot reproduce.  A notable exception is hybrid crosses between horses and Equus ferus przewalskii, commonly known as ": null
    },
    {
        "Przewalskis horse": "Przewalskis Horse"
    }
]