[
    {
        "Horses is the debut ": null
    },
    {
        "studio album": "Studio Album"
    },
    {
        " by American musician ": null
    },
    {
        "Patti Smith": "Patti Smith"
    },
    {
        ", released on November 10, 1975, on ": null
    },
    {
        "Arista Records": "Arista Records"
    },
    {
        ". Smith, a fixture of the then-burgeoning ": null
    },
    {
        "New York punk rock": "Punk Rocknew York City"
    },
    {
        " music scene, began recording Horses with her band in 1975 after being signed to ": null
    },
    {
        "Arista Records": "Arista Records"
    },
    {
        ", with ": null
    },
    {
        "John Cale": "John Cale"
    },
    {
        " being enlisted to produce the album. With its fusion of simplistic ": null
    },
    {
        "rock and roll": "Rock And Roll"
    },
    {
        " structures and Smiths freeform, ": null
    },
    {
        "Beat poetry": "Beat Poetry"
    },
    {
        "-infused lyrics, Horses was met with widespread critical acclaim upon its initial release. Despite a lack of airplay or a popular single to support the album, it nonetheless experienced modest commercial success, managing a top 50 placing on the US ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        ".     Horses has since been viewed by critics as one of the greatest and most influential albums not only in the history of the American punk rock movement, but also in the history of all rock and roll. Horses has also been cited as a key influence on a number of succeeding ": null
    },
    {
        "post-punk": "Post-Punk"
    },
    {
        ", and ": null
    },
    {
        "alternative rock": "Alternative Rock"
    },
    {
        " acts, including ": null
    },
    {
        "Siouxsie and the Banshees": "Siouxsie And The Banshees"
    },
    {
        ", ": null
    },
    {
        "Sonic Youth": "Sonic Youth"
    },
    {
        ", ": null
    },
    {
        "Hole": "Hole"
    },
    {
        ", ": null
    },
    {
        "The Smiths": "The Smiths"
    },
    {
        ", ": null
    },
    {
        "R.E.M.": "R.E.M."
    },
    {
        " and ": null
    },
    {
        "PJ Harvey": "Pj Harvey"
    },
    {
        ".          By 1975, Patti Smith and her band had established themselves as favorites in the ": null
    },
    {
        "New York": "New York City"
    },
    {
        " underground club scene. The band eventually caught the attention of industry executive ": null
    },
    {
        "Clive Davis": "Clive Davis"
    },
    {
        ", who was scouting for new talent to sign to his new just-launched label ": null
    },
    {
        "Arista Records": "Arista Records"
    },
    {
        " and later offered Smith a record deal. Recording sessions for Smiths debut album Horses began later that year, with Smith retaining her longtime backing band from a lengthy residency at the New York club ": null
    },
    {
        "CBGB": "Cbgb"
    },
    {
        "—": null
    },
    {
        "Jay Dee Daugherty": "Jay Dee Daugherty"
    },
    {
        " on drums, ": null
    },
    {
        "Lenny Kaye": "Lenny Kaye"
    },
    {
        " on guitar, ": null
    },
    {
        "Ivan Kral": "Ivan Kral"
    },
    {
        " on bass, and ": null
    },
    {
        "Richard Sohl": "Richard Sohl"
    },
    {
        " on keyboards.   Smith enlisted Welsh musician ": null
    },
    {
        "John Cale": "John Cale"
    },
    {
        ", formerly of ": null
    },
    {
        "The Velvet Underground": "The Velvet Underground"
    },
    {
        ", to serve as the albums producer, as she was impressed by the raw sound of his own albums, such as  Fear .     According to Smith, Horses was a conscious attempt to make a record that would make a certain type of person not feel alone. People who were like me, different  ... I wasnt targeting the whole world. I wasnt trying to make a hit record.  Recording sessions for the album were marked by frequent arguments between Smith and Cale, owing in part to their different work ethics. By the end of recording, and for some years immediately following the albums release, Smith was quick to downplay Cales contributions and suggested that she and her band ignored his suggestions entirely. In a 1976 interview with  Rolling Stone , Smith described the experience:             Cale would later recall that Smith initially struck him as someone with an incredibly volatile mouth who could handle any situation , and that as producer on Horses he wanted to capture the energy of her live performances, noting that there was a lot of power in Pattis use of language, in the way images collided with one another.  He described their working relationship during recording as confrontational and a lot like an immutable force meeting an immovable object . Smith herself would later attribute much of the tension between herself and Cale to her inexperience with formal studio recording, recalling that she was very, very suspicious, very guarded and hard to work with and made it difficult for him to do some of the things he had to do . She expressed gratitude for Cales persistence in recording and producing the band, noting that he would always leave much of the bands adolescent and honest flaws in and ultimately helped us in the birth of ourselves , calling him like a brother to me, a brother who gave me a helping hand.          In Smiths own words, Horses was conceived as three-chord ": null
    },
    {
        "rock": "Rock Music"
    },
    {
        " merged with the power of the word . Steve Huey of ": null
    },
    {
        "AllMusic": "Allmusic"
    },
    {
        " calls Horses essentially the first ": null
    },
    {
        "art punk": "Art Punk"
    },
    {
        " album.  Smith and her bands sound, spearheaded by the rudimentary guitar work of Lenny Kaye, drew on the simple aesthetics of ": null
    },
    {
        "garage rock": "Garage Rock"
    },
    {
        ", and the groups use of simplistic chord structures was emblematic of the ": null
    },
    {
        "punk rock": "Punk Rock"
    },
    {
        " scene associated with the band. Smith, however, used such structures as a basis for lyrical and musical improvisation in the albums songs, diverging from other contemporary punk acts who generally shied away from solos. Horses drew on genres such as rock and roll, ": null
    },
    {
        "reggae": "Reggae"
    },
    {
        ", and ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        ".  ": null
    },
    {
        "Redondo Beach": "Redondo Beach"
    },
    {
        " features a reggae backing track, while Birdland , which was improvised by the band in Electric Lady Studios, contains jazz and ": null
    },
    {
        "doo-wop": "Doo-Wop"
    },
    {
        " elements.     Reflecting Smiths background as a poet, the albums lyrics channel the French ": null
    },
    {
        "Symbolism": "Symbolism"
    },
    {
        " movement, incorporating influences from the works of ": null
    },
    {
        "Charles Baudelaire": "Charles Baudelaire"
    },
    {
        ", ": null
    },
    {
        "William Blake": "William Blake"
    },
    {
        ", and Smiths lifelong idol ": null
    },
    {
        "Arthur Rimbaud": "Arthur Rimbaud"
    },
    {
        ", and recall the revolutionary spirit of Rimbaud and resonate with the energy of ": null
    },
    {
        "Beat": "Beat Generation"
    },
    {
        " poetry, according to  CMJ s Steve Klinge.  Several of the albums songs— Redondo Beach , ": null
    },
    {
        "Free Money": "Free Money"
    },
    {
        " , Kimberly —were inspired by moments with members of Smiths family, while others— Break It Up , Elegie —were written about her idols. Smiths sisters provide the lyrical inspirations for Redondo Beach and Kimberly ; the former song, about despairing over a missing lover, was inspired by an incident in which Smiths sister Linda disappeared for the day following an argument with her, and the latter song was named after and dedicated to Smiths sister Kimberly.  Free Money is a recollection of Smiths childhood in ": null
    },
    {
        "New Jersey": "New Jersey"
    },
    {
        ".     Break It Up was written by Smith about ": null
    },
    {
        "Jim Morrison": "Jim Morrison"
    },
    {
        ", lead singer of ": null
    },
    {
        "The Doors": "The Doors"
    },
    {
        ", and based on her recollection of her visit of Morrisons grave in ": null
    },
    {
        "Père Lachaise Cemetery": "Père Lachaise Cemetery"
    },
    {
        ", ": null
    },
    {
        "Paris": "Paris"
    },
    {
        ", as well as a dream in which she witnessed Morrison stuck to a marble slab, trying and eventually succeeding in breaking free from the stone. Elegie was recorded on the death anniversary of rock musician ": null
    },
    {
        "Jimi Hendrix": "Jimi Hendrix"
    },
    {
        " and serves as a requiem to Hendrix, incorporating a line from his song ": null
    },
    {
        "1983": "1983..."
    },
    {
        " . Birdland was inspired by A Book of Dreams, a 1973 memoir of Austrian ": null
    },
    {
        "psychoanalyst": "Psychoanalyst"
    },
    {
        " Wilhelm Reich": "Wilhelm Reich"
    },
    {
        " by his son Peter, and revolves around a narrative in which Peter, at his fathers funeral, imagines leaving on a ": null
    },
    {
        "UFO": "Unidentified Flying Object"
    },
    {
        " piloted by his fathers spirit. Horses also features two adaptations of songs by other artists: ": null
    },
    {
        "Gloria": "Gloria"
    },
    {
        " , a radical retake on the ": null
    },
    {
        "Them": "Them"
    },
    {
        " song incorporating verses from Smiths own poem Oath , and Land , already a live favorite, which features the first verse of ": null
    },
    {
        "Chris Kenners": "Chris Kenner"
    },
    {
        " Land of a Thousand Dances": "Land Of A Thousand Dances"
    },
    {
        " . On the latter, Smith fuses the imagery of the Kenner song together with the experiences of the character Johnny, a reference to the ": null
    },
    {
        "homoerotic": "Homoeroticism"
    },
    {
        " protagonist of ": null
    },
    {
        "William S. Burroughs": "William S. Burroughs"
    },
    {
        " 1971 novel  The Wild Boys , while also alluding to Arthur Rimbaud and, less directly, Jimi Hendrix, whom she imagined to be dreaming a simple rock-and-roll song, and it takes him into all these other realms.             The cover photograph for Horses was taken using natural light by American photographer ": null
    },
    {
        "Robert Mapplethorpe": "Robert Mapplethorpe"
    },
    {
        ", a close friend of Smiths, at the ": null
    },
    {
        "Greenwich Village": "Greenwich Village"
    },
    {
        " penthouse apartment of his partner Sam Wagstaff.     Smith is depicted wearing a plain white shirt which she had purchased at ": null
    },
    {
        "the Salvation Army": "The Salvation Army"
    },
    {
        " on the ": null
    },
    {
        "Bowery": "Bowery"
    },
    {
        " and slinging a black jacket over her shoulder and her favorite black ribbon around her collar. Embedded on the jacket is a horse pin that Smiths friend ": null
    },
    {
        "Allen Lanier": "Allen Lanier"
    },
    {
        "  had given her.     Smith has described her pose on the cover as a mix of ": null
    },
    {
        "Baudelaire": "Charles Baudelaire"
    },
    {
        " and ": null
    },
    {
        "Sinatra": "Frank Sinatra"
    },
    {
        ".  The record company wanted to make various changes to the photo, but Smith overruled such attempts. The black and white treatment and unisex pose were a departure from the typical promotional images of girl singers of the time,  but Smith maintains that she wasnt making a big statement. Thats just the way I dressed.       Upon initial release, Horses was met with near-universal acclaim from music critics and publications. In a contemporary review for  Rolling Stone , ": null
    },
    {
        "John Rockwell": "John Rockwell"
    },
    {
        " wrote that Horses is wonderful in large measure because it recognizes the over-whelming importance of words in Smiths work, covering a range of themes far beyond what most rock records even dream of , and highlighted Smiths adaptations of rock standards as the most striking songs on the record.  In  Creem , ": null
    },
    {
        "Lester Bangs": "Lester Bangs"
    },
    {
        " wrote that Smiths music in its ultimate moments touches deep wellsprings of emotion that extremely few artists in rock or anywhere else are capable of reaching , and declared that with her wealth of promise and the most incandescent flights and stillnesses of this album she joins the ranks of people like ": null
    },
    {
        "Miles Davis": "Miles Davis"
    },
    {
        ", ": null
    },
    {
        "Charles Mingus": "Charles Mingus"
    },
    {
        ", or the ": null
    },
    {
        "Dylan": "Bob Dylan"
    },
    {
        " of ": null
    },
    {
        "Sad Eyed Lady": "Sad Eyed Lady Of The Lowlands"
    },
    {
        " and ": null
    },
    {
        "Royal Albert Hall": "The Bootleg Series Vol. 4: Bob Dylan Live 1966, The   Royal Albert Hall   Concert"
    },
    {
        ".   Village Voice  critic ": null
    },
    {
        "Robert Christgau": "Robert Christgau"
    },
    {
        " said, while the album does not capture Smiths humor, it gets the minimalist fury of her band and the revolutionary dimension of her singing just fine.      Horses mix of philosophical lyrics and rock and roll music did, however, attract some polarizing reactions, particularly from the British music press. A review of Horses from  Melody Maker  dismissed the album as precisely whats wrong with rock and roll right now.  Conversely, ": null
    },
    {
        "Jonh Ingham": "Jonh Ingham"
    },
    {
        " of  Sounds  published a five-star review of Horses, naming it the record of the year and one of the most stunning, commanding, engrossing platters to come down the turnpike since ": null
    },
    {
        "John Lennons": "John Lennon"
    },
    {
        "  Plastic Ono Band  .  ": null
    },
    {
        "Charles Shaar Murray": "Charles Shaar Murray"
    },
    {
        " of  NME  called it an album in a thousand and an important album in terms of what rock can encompass without losing its identity as a musical form, in that it introduces an artist of greater vision than has been seen in rock for far too long.      Commercially, Horses performed modestly, managing to peak at number 47 on the United States ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        " albums chart despite receiving virtually no airplay. At the end of 1975, Horses was voted the second best album of the year, behind ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        " and ": null
    },
    {
        "The Bands": "The Band"
    },
    {
        "  The Basement Tapes , in the ": null
    },
    {
        "Pazz & Jop": "Pazz  &  Jop"
    },
    {
        ", an annual poll of American critics nationwide, published in The Village Voice.  NME placed it at number thirteen on its year-end list of 1975s best albums.  In 1979, Robert Christgau ranked it at number 38 on his list of the best albums of the 1970s.           Following its release, Horses further cemented Smiths reputation as one of the biggest names of the ": null
    },
    {
        "New York punk rock scene": "Punk Rocknew York City"
    },
    {
        ", alongside contemporary acts such as the ": null
    },
    {
        "Ramones": "Ramones"
    },
    {
        ", ": null
    },
    {
        "Blondie": "Blondie"
    },
    {
        " and ": null
    },
    {
        "Talking Heads": "Talking Heads"
    },
    {
        ",  and it has since been cited as the first significant punk rock album. Horses is considered one of the key recordings of the early punk rock movement  and a landmark for punk and ": null
    },
    {
        "new wave music": "New Wave Music"
    },
    {
        " in general, inspiring a raw, almost amateurish energy for the former and critical, engaging reflexivity for the latter , according to writer Chris Smith in his book  101 Albums That Changed Popular Music .  The Observer  critic ": null
    },
    {
        "Simon Reynolds": "Simon Reynolds"
    },
    {
        " wrote, Pipping the ": null
    },
    {
        "Ramones first album": "Ramones"
    },
    {
        " to the post by five months, Horses is generally considered not just one of the most startling debuts in rock history but the spark that ignited the punk explosion. In  Variety , David Sprague wrote that Horses—which became the first major-label punk-rock album when Arista unleashed it in 1975—not only helped spread the gospel of Bowery art-punk around the world, it set the tone for smart, unbending female rockers of generations to come.      Various recording artists have specifically named Horses as an influence on their music. English ": null
    },
    {
        "post-punk": "Post-Punk"
    },
    {
        " band ": null
    },
    {
        "Siouxsie and the Banshees": "Siouxsie And The Banshees"
    },
    {
        " acknowledged that the song Carcass from their 1978 album  The Scream  was inspired by Horses.  ": null
    },
    {
        "Michael Stipe": "Michael Stipe"
    },
    {
        " of ": null
    },
    {
        "R.E.M.": "R.E.M."
    },
    {
        " bought the album as a high school student and says that it tore limbs off and put them back on in a whole different order , citing Smith as his primary inspiration for becoming a musician. ": null
    },
    {
        "Morrissey": "Morrissey"
    },
    {
        " and ": null
    },
    {
        "Johnny Marr": "Johnny Marr"
    },
    {
        " shared an appreciation for the record, and one of their early compositions for ": null
    },
    {
        "The Smiths": "The Smiths"
    },
    {
        ", The Hand That Rocks the Cradle , is a reworking of Kimberly . ": null
    },
    {
        "Courtney Love": "Courtney Love"
    },
    {
        " of ": null
    },
    {
        "Hole": "Hole"
    },
    {
        " stated that Horses helped inspire her to become a rock musician,  while ": null
    },
    {
        "Viv Albertine": "Viv Albertine"
    },
    {
        " of ": null
    },
    {
        "The Slits": "The Slits"
    },
    {
        " stated that Horses absolutely and completely changed life , adding: Us girls never stood in front of a mirror posing as if we had a guitar because we had no role models. So, when Patti Smith came along, it was huge. She was groundbreakingly different. ": null
    },
    {
        "PJ Harvey": "Pj Harvey"
    },
    {
        " stated in 1992 at the beginning of her career: I heard Horses once and it was brilliant – not so much her music as her delivery, her words, her articulation. Her honesty.      Horses has been considered by music critics to be one of the finest albums in recorded music history,  attaining high levels of critical success and influence in the years following its release despite modest sales figures. The album has been included in various publications lists of the greatest albums of the 1970s and of all time.  In 1992, NME ranked Horses at first place on its list of 20 Near-as-Damn-It Perfect Initial Efforts .  Q  magazine included it in its 2002 list of the 100 greatest punk albums.  In 2003, the album was ranked number 44 on  Rolling Stone  magazines list of ": null
    },
    {
        "the 500 greatest albums of all time": "The 500 Greatest Albums Of All Time"
    },
    {
        ",  maintaining the rating in a 2012 revised list.  In 2006,  Time  named it as one of the All-TIME 100 Albums,  and three years later, it was preserved by the ": null
    },
    {
        "Library of Congress": "Library Of Congress"
    },
    {
        " into the ": null
    },
    {
        "National Recording Registry": "National Recording Registry"
    },
    {
        " for being culturally, historically, or aesthetically significant.  In 2013, Rolling Stone ranked Horses number 10 on its list of the 100 best debut albums of all time, describing it as a declaration of committed mutiny, a statement of faith in the transfigurative powers of rock & roll.        For the 30th anniversary of Horses, a live version was recorded by Smith on June 25, 2005 in the ": null
    },
    {
        "Royal Festival Hall": "Royal Festival Hall"
    },
    {
        " at the ": null
    },
    {
        "Meltdown festival": "Meltdown"
    },
    {
        ", which Smith curated.  It followed the same running order as the original release of Horses, and featured accompaniment by original band members Lenny Kaye and Jay Dee Daugherty, as well as Tony Shanahan on bass guitar and piano, ": null
    },
    {
        "Tom Verlaine": "Tom Verlaine"
    },
    {
        " on guitar, and ": null
    },
    {
        "Flea": "Flea"
    },
    {
        " on bass guitar and ": null
    },
    {
        "trumpet": "Trumpet"
    },
    {
        ".  The live set was released on November 8, 2005 as the second disc of a double CD titled Horses/Horses, with the ": null
    },
    {
        "digitally remastered": "Remaster"
    },
    {
        " version of the original 1975 album, along with the bonus track ": null
    },
    {
        "My Generation": "My Generation"
    },
    {
        " , on the first disc. The album was recorded and mixed by ": null
    },
    {
        "Emery Dobyns": "Emery Dobyns"
    },
    {
        ".                       Band ": null
    },
    {
        "Patti Smith": "Patti Smith"
    },
    {
        "  – ": null
    },
    {
        "vocals": "Singing"
    },
    {
        ", ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " Jay Dee Daugherty": "Jay Dee Daugherty"
    },
    {
        "  – ": null
    },
    {
        "drums": "Drum Kit"
    },
    {
        ", consultant   ": null
    },
    {
        "Lenny Kaye": "Lenny Kaye"
    },
    {
        "  – guitar, ": null
    },
    {
        "bass guitar": "Bass Guitar"
    },
    {
        ", vocals   ": null
    },
    {
        "Ivan Kral": "Ivan Kral"
    },
    {
        "  – bass guitar, guitar, vocals   ": null
    },
    {
        "Richard Sohl": "Richard Sohl"
    },
    {
        "  – ": null
    },
    {
        "keyboards": "Keyboard Instrument"
    },
    {
        "     Additional personnel       ": null
    },
    {
        "John Cale": "John Cale"
    },
    {
        " – ": null
    },
    {
        "production": "Record Producer"
    },
    {
        " mastering": "Audio Mastering"
    },
    {
        " engineering": "Audio Engineering"
    },
    {
        "   Danny Fields": "Danny Fields"
    },
    {
        "  – photography   ": null
    },
    {
        "Bob Gruen": "Bob Gruen"
    },
    {
        "  – photography   Bob Heimall  – design    ": null
    },
    {
        "Allen Lanier": "Allen Lanier"
    },
    {
        "  – guitar, keyboards   ": null
    },
    {
        "Bob Ludwig": "Bob Ludwig"
    },
    {
        "  – mastering   ": null
    },
    {
        "Robert Mapplethorpe": "Robert Mapplethorpe"
    },
    {
        "  – photography   ": null
    },
    {
        "Tom Verlaine": "Tom Verlaine"
    },
    {
        "  – guitar   Sherri Whitmarsh  – design                                    ": null
    }
]