[
    {
        "            Huldrych Zwingli or Ulrich Zwingli was a leader of the ": null
    },
    {
        "Reformation in Switzerland": "Reformation In Switzerland"
    },
    {
        ", born during a time of emerging Swiss patriotism and increasing criticism of the ": null
    },
    {
        "Swiss mercenary system": "Swiss Mercenaries"
    },
    {
        ". He attended the ": null
    },
    {
        "University of Vienna": "University Of Vienna"
    },
    {
        " and the ": null
    },
    {
        "University of Basel": "University Of Basel"
    },
    {
        ", a scholarly center of ": null
    },
    {
        "Renaissance humanism": "Renaissance Humanism"
    },
    {
        ". He continued his studies while he served as a pastor in ": null
    },
    {
        "Glarus": "Glarus"
    },
    {
        " and later in ": null
    },
    {
        "Einsiedeln": "Einsiedeln, Switzerland"
    },
    {
        ", where he was influenced by the writings of ": null
    },
    {
        "Erasmus": "Erasmus"
    },
    {
        ".     In 1519, Zwingli became the pastor of the ": null
    },
    {
        "Grossmünster": "Grossmünster"
    },
    {
        " in ": null
    },
    {
        "Zürich": "Zürich"
    },
    {
        " where he began to preach ideas on reform of the Catholic Church. In his first public controversy in 1522, he attacked the ": null
    },
    {
        "custom of fasting": "Fasting And Abstinence In The Roman Catholic Church"
    },
    {
        " during ": null
    },
    {
        "Lent": "Lent"
    },
    {
        ". In his publications, he noted corruption in the ecclesiastical hierarchy, promoted clerical marriage, and attacked the use of images in places of worship. In 1525, he introduced a new communion liturgy to replace the ": null
    },
    {
        "Mass": "Mass"
    },
    {
        ". He also clashed with the ": null
    },
    {
        "Anabaptists": "Anabaptists"
    },
    {
        ", which resulted in their persecution. Historians have debated whether or not he turned Zürich into a theocracy. Robert Walton, Zwinglis Theocracy .     The Reformation spread to other parts of the Swiss Confederation, but several ": null
    },
    {
        "cantons": "Cantons Of Switzerland"
    },
    {
        " resisted, preferring to remain ": null
    },
    {
        "Catholic": "Roman Catholic Church"
    },
    {
        ". Zwingli formed an alliance of Reformed cantons which divided the Confederation along religious lines. In 1529, a war was averted at the last moment between the two sides. Meanwhile, Zwinglis ideas came to the attention of ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        " and other reformers. They met at the ": null
    },
    {
        "Marburg Colloquy": "Marburg Colloquy"
    },
    {
        " and agreed on many points of doctrine, but they could not reach an accord on the doctrine of the ": null
    },
    {
        "Real Presence of Christ": "Real Presence"
    },
    {
        " in the ": null
    },
    {
        "Eucharist": "Eucharist"
    },
    {
        ".     In 1531, Zwinglis alliance applied an unsuccessful food blockade on the Catholic cantons. The cantons responded with an attack at a moment when Zürich was ill-prepared, and Zwingli died on the battlefield. His legacy lives on in the ": null
    },
    {
        "confessions": "Reformed Christian Confessions Of Faith"
    },
    {
        ", liturgy, and church orders of the ": null
    },
    {
        "Reformed churches": "Reformed Churches"
    },
    {
        " of today.          The ": null
    },
    {
        "Swiss Confederation": "Old Swiss Confederacy"
    },
    {
        " in Huldrych Zwinglis time consisted of thirteen states  as well as affiliated areas and common lordships. Unlike the modern state of ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        ", which operates under a federal government, each of the thirteen cantons was nearly independent, conducting its own domestic and foreign affairs. Each canton formed its own alliances within and without the Confederation. This relative independence served as the basis for conflict during the time of the Reformation when the various cantons divided between different confessional camps. Military ambitions gained an additional impetus with the competition to acquire new territory and resources, as seen for example in the ": null
    },
    {
        "Old Zürich War": "Old Zürich War"
    },
    {
        " of 1440–1446.      The wider political environment in Europe during the 15th and 16th centuries was also volatile. For centuries the relationship with the Confederations powerful neighbour, France, determined the foreign policies of the Swiss. Nominally, the Confederation formed a part of the ": null
    },
    {
        "Holy Roman Empire": "Holy Roman Empire"
    },
    {
        ". However, through a succession of wars culminating in the ": null
    },
    {
        "Swabian War": "Swabian War"
    },
    {
        " in 1499, the Confederation had become de facto independent. As the two continental powers and minor regional states such as the ": null
    },
    {
        "Duchy of Milan": "Duchy Of Milan"
    },
    {
        ", the ": null
    },
    {
        "Duchy of Savoy": "Duchy Of Savoy"
    },
    {
        ", and the ": null
    },
    {
        "Papal States": "Papal States"
    },
    {
        " competed and fought against each other, there were far-reaching political, economic, and social consequences for the Confederation. During this time the ": null
    },
    {
        "mercenary pension system": "Swiss Mercenaries"
    },
    {
        " became a subject of disagreement. The religious factions of Zwinglis time debated vociferously the merits of sending young Swiss men to fight in foreign wars mainly for the enrichment of the cantonal authorities.      These internal and external factors contributed to the rise of a Confederation national consciousness, in which the term fatherland  began to take on meaning beyond a reference to an individual canton. At the same time, ": null
    },
    {
        "Renaissance humanism": "Renaissance Humanism"
    },
    {
        ", with its universal values and emphasis on scholarship , had taken root in the Confederation. Within this environment, defined by the confluence of Swiss ": null
    },
    {
        "patriotism": "Patriotism"
    },
    {
        " and humanism, Zwingli was born in 1484.               Huldrych Zwingli was born on 1 January 1484 in ": null
    },
    {
        "Wildhaus": "Wildhaus"
    },
    {
        ", in the ": null
    },
    {
        "Toggenburg": "Toggenburg"
    },
    {
        " valley of ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        ", to a family of farmers, the third child of nine. His father, Ulrich, played a leading role in the administration of the community .  Zwinglis primary schooling was provided by his uncle, Bartholomew, a cleric in ": null
    },
    {
        "Weesen": "Weesen"
    },
    {
        ", where he probably met ": null
    },
    {
        "Katharina von Zimmern": "Katharina Von Zimmern"
    },
    {
        ".  At ten years old, Zwingli was sent to ": null
    },
    {
        "Basel": "Basel"
    },
    {
        " to obtain his secondary education where he learned ": null
    },
    {
        "Latin": "Latin Language"
    },
    {
        " under Magistrate Gregory Bünzli. After three years in Basel, he stayed a short time in ": null
    },
    {
        "Bern": "Bern"
    },
    {
        " with the humanist, Henry Wölfflin. The ": null
    },
    {
        "Dominicans": "Dominican Order"
    },
    {
        " in Bern tried to persuade Zwingli to join their order and it is possible that he was received as a novice. ; . Potter mentions this possibility. Gäbler states that Zwingli did not refute later claims by opponents that he had been a monk in Bern. However, his father and uncle disapproved of such a course and he left Bern without completing his Latin studies. ;  He enrolled in the ": null
    },
    {
        "University of Vienna": "University Of Vienna"
    },
    {
        " in the winter semester of 1498 but was expelled, according to the universitys records. However, it is not certain that Zwingli was indeed expelled, and he re-enrolled in the summer semester of 1500; his activities in 1499 are unknown. . The word exclusus was added to his matriculation entry. Gäbler notes that without a date and reason, it does not conform to what was customary at the time. Zwingli continued his studies in Vienna until 1502, after which he transferred to the ": null
    },
    {
        "University of Basel": "University Of Basel"
    },
    {
        " where he received the Master of Arts degree  in 1506.      Zwingli was ordained in ": null
    },
    {
        "Constance": "Constance"
    },
    {
        ", the seat of the local diocese, and he celebrated his first ": null
    },
    {
        "Mass": "Mass"
    },
    {
        " in his hometown, Wildhaus, on 29 September 1506. As a young priest he had studied little theology, but this was not considered unusual at the time. His first ecclesiastical post was the pastorate of the town of ": null
    },
    {
        "Glarus": "Glarus"
    },
    {
        ", where he stayed for ten years. It was in Glarus, whose soldiers were used as mercenaries in Europe, that Zwingli became involved in politics. The Swiss Confederation was embroiled in various campaigns with its neighbours: the French, the Habsburgs, and the Papal States. Zwingli placed himself solidly on the side of the ": null
    },
    {
        "Roman See": "Holy See"
    },
    {
        ". In return, ": null
    },
    {
        "Pope Julius II": "Pope Julius Ii"
    },
    {
        " honoured Zwingli by providing him with an annual pension. He took the role of chaplain in several campaigns in Italy, including the ": null
    },
    {
        "Battle of Novara": "Battle Of Novara"
    },
    {
        " in 1513. However, the decisive defeat of the Swiss in the ": null
    },
    {
        "Battle of Marignano": "Battle Of Marignano"
    },
    {
        " caused a shift in mood in Glarus in favour of the French rather than the pope. Zwingli, the papal partisan, found himself in a difficult position and he decided to retreat to ": null
    },
    {
        "Einsiedeln": "Einsiedeln, Switzerland"
    },
    {
        " in the ": null
    },
    {
        "canton of Schwyz": "Canton Of Schwyz"
    },
    {
        ". By this time, he had become convinced that mercenary service was immoral and that Swiss unity was indispensable for any future achievements. Some of his earliest extant writings, such as The Ox and The Labyrinth , attacked the mercenary system using allegory and satire. His countrymen were presented as virtuous people within a French, imperial, and papal triangle. ;  Zwingli stayed in Einsiedeln for two years during which he withdrew completely from politics in favour of ecclesiastical activities and personal studies.       Zwinglis time as the pastor of Glarus and Einsiedeln was characterized by inner growth and development. He perfected his ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " and he took up the study of ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        ". His library contained over three hundred volumes from which he was able to draw upon ": null
    },
    {
        "classical": "Classics"
    },
    {
        ", ": null
    },
    {
        "patristic": "Patristic"
    },
    {
        ", and ": null
    },
    {
        "scholastic": "Scholasticism"
    },
    {
        " works. He exchanged scholarly letters with a circle of Swiss humanists and began to study the writings of Erasmus. Zwingli took the opportunity to meet him while Erasmus was in Basel between August 1514 and May 1516. Zwinglis turn to relative ": null
    },
    {
        "pacifism": "Pacifism"
    },
    {
        " and his focus on preaching can be traced to the influence of Erasmus.      In late 1518, the post of the Leutpriestertum of the ": null
    },
    {
        "Grossmünster": "Grossmünster"
    },
    {
        " at ": null
    },
    {
        "Zürich": "Zürich"
    },
    {
        " became vacant. The ": null
    },
    {
        "canons": "Canon"
    },
    {
        " of the foundation that administered the Grossmünster recognised Zwinglis reputation as a fine preacher and writer. His connection with humanists was a decisive factor as several canons were sympathetic to Erasmian reform. In addition, his opposition to the French and to mercenary service was welcomed by Zürich politicians. On 11 December 1518, the canons elected Zwingli to become the stipendiary priest and on 27 December he moved permanently to Zürich.            On 1 January 1519, Zwingli gave his first sermon in Zürich. Deviating from the prevalent practice of basing a sermon on the Gospel lesson of a particular Sunday, Zwingli, using ": null
    },
    {
        "Erasmus": "Erasmus"
    },
    {
        " New Testament as a guide, began to read through the ": null
    },
    {
        "Gospel of Matthew": "Gospel Of Matthew"
    },
    {
        ", giving his interpretation during the sermon, known as the method of  lectio continua .  He continued to read and interpret the book on subsequent Sundays until he reached the end and then proceeded in the same manner with the ": null
    },
    {
        "Acts of the Apostles": "Acts Of The Apostles"
    },
    {
        ", the New Testament ": null
    },
    {
        "epistles": "Epistles"
    },
    {
        ", and finally the ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        ". His motives for doing this are not clear, but in his sermons he used exhortation to achieve moral and ecclesiastical improvement which were goals comparable with Erasmian reform. Sometime after 1520, Zwinglis theological model began to evolve into an idiosyncratic form that was neither Erasmian nor ": null
    },
    {
        "Lutheran": "Lutheran"
    },
    {
        ". Scholars do not agree on the process of how he developed his own unique model.  One view is that Zwingli was trained as an Erasmian humanist and Luther played a decisive role in changing his theology. . Proponents of this view are Oskar Farner and Walther Köhler. Another view is that Zwingli did not pay much attention to Luthers theology and in fact he considered it as part of the humanist reform movement. . Proponents of this view are Arthur Rich and Cornelius Augustijn. A third view is that Zwingli was not a complete follower of Erasmus, but had diverged from him as early as 1516 and that he independently developed his theology. . A proponent of this view is Gottfried W. Locher.     Zwinglis theological stance was gradually revealed through his sermons. He attacked moral corruption and in the process he named individuals who were the targets of his denunciations. Monks were accused of indolence and high living. In 1519, Zwingli specifically rejected the ": null
    },
    {
        "veneration": "Veneration"
    },
    {
        " of saints and called for the need to distinguish between their true and fictional accounts. He cast doubts on hellfire, asserted that unbaptised children were not damned, and questioned the power of ": null
    },
    {
        "excommunication": "Excommunication"
    },
    {
        ". His attack on the claim that ": null
    },
    {
        "tithing": "Tithe"
    },
    {
        " was a divine institution, however, had the greatest theological and social impact.  This contradicted the immediate economic interests of the foundation. One of the elderly canons who had supported Zwinglis election, Konrad Hofmann, complained about his sermons in a letter. Some canons supported Hofmann, but the opposition never grew very large. Zwingli insisted that he was not an innovator and that the ": null
    },
    {
        "sole basis of his teachings was Scripture": "Sola Scriptura"
    },
    {
        ".       Within the ": null
    },
    {
        "diocese of Constance": "Bishopric Of Constance"
    },
    {
        ", Bernhardin Sanson was offering a special ": null
    },
    {
        "indulgence": "Indulgence"
    },
    {
        " for contributors to the building of ": null
    },
    {
        "St Peters": "St. Peters Basilica"
    },
    {
        " in Rome. When Sanson arrived at the gates of Zürich at the end of January 1519, parishioners prompted Zwingli with questions. He responded with displeasure that the people were not being properly informed about the conditions of the indulgence and were being induced to part with their money on false pretences. This was over a year after ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        " published his ": null
    },
    {
        "Ninety-five theses": "Ninety-Five Theses"
    },
    {
        " .  The council of Zürich refused Sanson entry into the city. As the authorities in Rome were anxious to contain the fire started by Luther, the Bishop of Constance denied any support of Sanson and he was recalled.      In August 1519, Zürich was struck by an outbreak of the ": null
    },
    {
        "plague": "Bubonic Plague"
    },
    {
        " during which at least one in four persons died. All of those who could afford it left the city, but Zwingli remained and continued his pastoral duties. In September, he caught the disease and nearly died. He described his preparation for death in a poem, Zwinglis Pestlied, consisting of three parts: the onset of the illness, the closeness to death, and the joy of recovery. The final verses of the first part read: see e.g.               In the years following his recovery, Zwinglis opponents remained in the minority. When a vacancy occurred among the canons of the Grossmünster, Zwingli was elected to fulfill that vacancy on 29 April 1521. In becoming a canon, he became a full citizen of Zürich. He also retained his post as the peoples priest of the Grossmünster.         The first public controversy regarding Zwinglis preaching broke out during the season of ": null
    },
    {
        "Lent": "Lent"
    },
    {
        " in 1522. On the first fasting Sunday, 9 March, Zwingli and about a dozen other participants consciously transgressed the fasting rule by cutting and distributing two smoked sausages . Zwingli defended this act in a sermon which was published on 16 April, under the title Von Erkiesen und Freiheit der Speisen . He noted that no general valid rule on food can be derived from the Bible and that to transgress such a rule is not a sin. The event, which came to be referred to as the ": null
    },
    {
        "Affair of the Sausages": "Affair Of The Sausages"
    },
    {
        ", is considered to be the start of the Reformation in Switzerland.  Even before the publication of this treatise, the diocese of Constance reacted by sending a delegation to Zürich. The city council condemned the fasting violation, but assumed responsibility over ecclesiastical matters and requested the religious authorities clarify the issue. The bishop responded on 24 May by admonishing the Grossmünster and city council and repeating the traditional position.      Following this event, Zwingli and other humanist friends petitioned the bishop on 2 July to abolish the requirement of celibacy on the clergy. Two weeks later the petition was reprinted for the public in German as Eine freundliche Bitte und Ermahnung an die Eidgenossen . The issue was not just an abstract problem for Zwingli, as he had secretly married a widow, ": null
    },
    {
        "Anna Reinhart": "Anna Reinhart"
    },
    {
        ", earlier in the year. Their cohabitation was well-known and their public wedding took place on 2 April 1524, three months before the birth of their first child.  They would eventually have four children: Regula, William, Huldrych, and Anna. As the petition was addressed to the secular authorities, the bishop responded at the same level by notifying the Zürich government to maintain the ecclesiastical order. Other Swiss clergymen joined in Zwinglis cause which encouraged him to make his first major statement of faith, Apologeticus Archeteles . He defended himself against charges of inciting unrest and heresy. He denied the ecclesiastical hierarchy any right to judge on matters of church order because of its corrupted state.           The events of 1522 brought no clarification on the issues. Not only did the unrest between Zürich and the bishop continue, tensions were growing among Zürichs Confederation partners in the ": null
    },
    {
        "Swiss Diet": "Tagsatzung"
    },
    {
        ". On 22 December, the Diet recommended that its members prohibit the new teachings, a strong indictment directed at Zürich. The city council felt obliged to take the initiative and find its own solution.       On 3 January 1523, the Zürich city council invited the clergy of the city and outlying region to a meeting to allow the factions to present their opinions. The bishop was invited to attend or to send a representative. The council would render a decision on who would be allowed to continue to proclaim their views. This meeting, the first Zürich disputation, took place on 29 January 1523.       The meeting attracted a large crowd of approximately six hundred participants. The bishop sent a delegation led by his ": null
    },
    {
        "vicar general": "Vicar General"
    },
    {
        ", ": null
    },
    {
        "Johannes Fabri": "Johann Faber"
    },
    {
        ". Zwingli summarised his position in the Schlussreden .  The Sixty-seven Articles are contained in , pp.  111–117. At Internet Archive. Accessed 13 March 2015. Fabri, who had not envisaged an academic disputation in the manner Zwingli had prepared for,  was forbidden to discuss high theology before laymen, and simply insisted on the necessity of the ecclesiastical authority. The decision of the council was that Zwingli would be allowed to continue his preaching and that all other preachers should teach only in accordance with Scripture.         In September 1523, ": null
    },
    {
        "Leo Jud": "Leo Jud"
    },
    {
        ", Zwinglis closest friend and colleague and pastor of ": null
    },
    {
        "St. Peterskirche": "St. Peter, Zürich"
    },
    {
        ", publicly called for the removal of statues of saints and other icons. This led to demonstrations and ": null
    },
    {
        "iconoclastic": "Iconoclasm"
    },
    {
        " activities. The city council decided to work out the matter of images in a second disputation. The essence of the ": null
    },
    {
        "mass": "Mass"
    },
    {
        " and its sacrificial character was also included as a subject of discussion. Supporters of the mass claimed that the eucharist was a true sacrifice, while Zwingli claimed that it was a commemorative meal. As in the first disputation, an invitation was sent out to the Zürich clergy and the bishop of Constance. This time, however, the lay people of Zürich, the dioceses of ": null
    },
    {
        "Chur": "Roman Catholic Diocese Of Chur"
    },
    {
        " and Basel, the University of Basel, and the twelve members of the Confederation were also invited. About nine hundred persons attended this meeting, but neither the bishop nor the Confederation sent representatives. The disputation started on 26 October 1523 and lasted two days.       Zwingli again took the lead in the disputation. His opponent was the aforementioned canon, Konrad Hofmann, who had initially supported Zwinglis election. Also taking part was a group of young men demanding a much faster pace of reformation, who among other things pleaded for replacing ": null
    },
    {
        "infant baptism": "Infant Baptism"
    },
    {
        " with ": null
    },
    {
        "adult baptism": "Credobaptism"
    },
    {
        ". This group was led by ": null
    },
    {
        "Conrad Grebel": "Conrad Grebel"
    },
    {
        ", one of the initiators of the ": null
    },
    {
        "Anabaptist": "Anabaptist"
    },
    {
        " movement. During the first three days of dispute, although the controversy of images and the mass were discussed, the arguments led to the question of whether the city council or the ecclesiastical government had the authority to decide on these issues. At this point, Konrad Schmid, a priest from ": null
    },
    {
        "Aargau": "Aargau"
    },
    {
        " and follower of Zwingli, made a pragmatic suggestion. As images were not yet considered to be valueless by everyone, he suggested that pastors preach on this subject under threat of punishment. He believed the opinions of the people would gradually change and the voluntary removal of images would follow. Hence, Schmid rejected the radicals and their iconoclasm, but supported Zwinglis position. In November the council passed ordinances in support of Schmids motion. Zwingli wrote a booklet on the evangelical duties of a minister, Kurze, christliche Einleitung , and the council sent it out to the clergy and the members of the Confederation.            In December 1523, the council set a deadline of ": null
    },
    {
        "Pentecost": "Pentecost"
    },
    {
        " in 1524 for a solution to the elimination of the mass and images. Zwingli gave a formal opinion in Vorschlag wegen der Bilder und der Messe . He did not urge an immediate, general abolition. The council decided on the orderly removal of images within Zürich, but rural congregations were granted the right to remove them based on majority vote. The decision on the mass was postponed.      Evidence of the effect of the Reformation was seen in early 1524. ": null
    },
    {
        "Candlemas": "Candlemas"
    },
    {
        " was not celebrated, processions of robed clergy ceased, worshippers did not go with palms or relics on ": null
    },
    {
        "Palm Sunday": "Palm Sunday"
    },
    {
        " to the ": null
    },
    {
        "Lindenhof": "Lindenhof"
    },
    {
        ", and ": null
    },
    {
        "triptychs": "Triptych"
    },
    {
        "remained covered and closed after ": null
    },
    {
        "Lent": "Lent"
    },
    {
        ".  Opposition to the changes came from Konrad Hofmann and his followers, but the council decided in favour of keeping the government mandates. When Hofmann left the city, opposition from pastors hostile to the Reformation broke down. The bishop of Constance tried to intervene in defending the mass and the veneration of images. Zwingli wrote an official response for the council and the result was the severance of all ties between the city and the diocese.      Although the council had hesitated in abolishing the mass, the decrease in the exercise of traditional piety allowed pastors to be unofficially released from the requirement of celebrating mass. As individual pastors altered their practices as each saw fit, Zwingli was prompted to address this disorganised situation by designing a communion liturgy in the German language. This was published in Aktion oder Brauch des Nachtmahls . Shortly before ": null
    },
    {
        "Easter": "Easter"
    },
    {
        ", Zwingli and his closest associates requested the council to cancel the mass and to introduce the new public order of worship. On ": null
    },
    {
        "Maundy Thursday": "Maundy Thursday"
    },
    {
        ", 13 April 1525, Zwingli celebrated communion under his new liturgy. Wooden cups and plates were used to avoid any outward displays of formality. The congregation sat at set tables to emphasise the meal aspect of the sacrament. The sermon was the focal point of the service and there was no organ music or singing. The importance of the sermon in the worship service was underlined by Zwinglis proposal to limit the celebration of communion to four times a year.      For some time Zwingli had accused ": null
    },
    {
        "mendicant": "Mendicant"
    },
    {
        " orders of hypocrisy and demanded their abolition in order to support the truly poor. He suggested the monasteries be changed into hospitals and welfare institutions and incorporate their wealth into a welfare fund. This was done by reorganising the foundations of the Grossmünster and ": null
    },
    {
        "Fraumünster": "Fraumünster"
    },
    {
        " and pensioning off remaining nuns and monks. The council secularised the church properties  and established new welfare programs for the poor. Zwingli requested permission to establish a Latin school, the Prophezei or ": null
    },
    {
        "Carolinum": "Carolinum, Zürich"
    },
    {
        ", at the Grossmünster. The council agreed and it was officially opened on 19 June 1525 with Zwingli and Jud as teachers. It served to retrain and re-educate the clergy. The ": null
    },
    {
        "Zürich Bible": "Zürich Bible"
    },
    {
        " translation, traditionally attributed to Zwingli and printed by ": null
    },
    {
        "Christoph Froschauer": "Christoph Froschauer"
    },
    {
        ", bears the mark of teamwork from the Prophecy school. According to , the first complete Bible was printed in 1531. Other sources say 1529 or 1530. See  and . Early editions were called the Froschauer Bible, see . Scholars have not yet attempted to clarify Zwinglis share of the work based on external and stylistic evidence.         Shortly after the second Zürich disputation, many in the ": null
    },
    {
        "radical wing of the Reformation": "Radical Reformation"
    },
    {
        " became convinced that Zwingli was making too many concessions to the Zürich council. They rejected the role of civil government and demanded the immediate establishment of a congregation of the faithful. ": null
    },
    {
        "Conrad Grebel": "Conrad Grebel"
    },
    {
        ", the leader of the radicals and the emerging Anabaptist movement, spoke disparagingly of Zwingli in private. On 15 August 1524 the council insisted on the obligation to baptise all newborn infants. Zwingli secretly conferred with Grebels group and late in 1524, the council called for official discussions. When talks were broken off, Zwingli published Wer Ursache gebe zu Aufruhr clarifying the opposing points-of-view.  On 17 January 1525 a public debate was held and the council decided in favour of Zwingli. Anyone refusing to have their children baptised was required to leave Zürich. The radicals ignored these measures and on 21 January, they met at the house of the mother of another radical leader, ": null
    },
    {
        "Felix Manz": "Felix Manz"
    },
    {
        ". Grebel and a third leader, ": null
    },
    {
        "George Blaurock": "George Blaurock"
    },
    {
        ", performed the first recorded Anabaptist ": null
    },
    {
        "adult baptisms": "Credobaptism"
    },
    {
        ".      On 2 February, the council repeated the requirement on the baptism of all babies and some who failed to comply were arrested and fined, Manz and Blaurock among them. Zwingli and Jud interviewed them and more debates were held before the Zürich council. Meanwhile, the new teachings continued to spread to other parts of the Confederation as well as a number of ": null
    },
    {
        "Swabia": "Swabia"
    },
    {
        "n towns. On 6–8 November, the last debate on the subject of baptism took place in the Grossmünster. Grebel, Manz, and Blaurock defended their cause before Zwingli, Jud, and other reformers. There was no serious exchange of views as each side would not move from their positions and the debates degenerated into an uproar, each side shouting abuse at the other.      The Zürich council decided that no compromise was possible. On 7 March 1526 it released the notorious mandate that no one shall rebaptise another under the penalty of death.  Although Zwingli, technically, had nothing to do with the mandate, there is no indication that he disapproved. Felix Manz, who had sworn to leave Zürich and not to baptise any more, had deliberately returned and continued the practice. After he was arrested and tried, he was executed on 5 January 1527 by being drowned in the ": null
    },
    {
        "Limmat": "Limmat"
    },
    {
        ". He was the first Anabaptist martyr; three more were to follow, after which all others either fled or were expelled from Zürich.   The descendants of the Zwinglian Reformation, the Reformed Church of Zürich, and the descendants of the Anabaptist movement  held a Reconciliation Conference at the Grossmünster on 26 June 2004. This link includes the conference program, and all statements made at that conference.             On 8 April 1524, five cantons, ": null
    },
    {
        "Lucerne": "Canton Of Lucerne"
    },
    {
        ", ": null
    },
    {
        "Uri": "Canton Of Uri"
    },
    {
        ", ": null
    },
    {
        "Schwyz": "Canton Of Schwyz"
    },
    {
        ", ": null
    },
    {
        "Unterwalden": "Unterwalden"
    },
    {
        ", and ": null
    },
    {
        "Zug": "Canton Of Zug"
    },
    {
        ", formed an alliance, die fünf Orte to defend themselves from Zwinglis Reformation. They contacted the opponents of Martin Luther including ": null
    },
    {
        "John Eck": "John Eck"
    },
    {
        ", who had debated Luther in the ": null
    },
    {
        "Leipzig Disputation": "Leipzig Disputation"
    },
    {
        " of 1519. Eck offered to dispute Zwingli and he accepted. However, they could not agree on the selection of the judging authority, the location of the debate, and the use of the Swiss Diet as a court. Because of the disagreements, Zwingli decided to boycott the disputation. On 19 May 1526, all the cantons sent delegates to ": null
    },
    {
        "Baden": "Baden, Switzerland"
    },
    {
        ". Although Zürichs representatives were present, they did not participate in the sessions. Eck led the Catholic party while the reformers were represented by ": null
    },
    {
        "Johannes Oecolampadius": "Johannes Oecolampadius"
    },
    {
        " of Basel, a theologian from ": null
    },
    {
        "Württemberg": "Württemberg"
    },
    {
        " who had carried on an extensive and friendly correspondence with Zwingli. While the debate proceeded, Zwingli was kept informed of the proceedings and printed pamphlets giving his opinions. It was of little use as the Diet decided against Zwingli. He was to be banned and his writings were no longer to be distributed. Of the thirteen Confederation members, ": null
    },
    {
        "Glarus": "Canton Of Glarus"
    },
    {
        ", ": null
    },
    {
        "Solothurn": "Canton Of Solothurn"
    },
    {
        ", ": null
    },
    {
        "Fribourg": "Canton Of Fribourg"
    },
    {
        ", and ": null
    },
    {
        "Appenzell": "Appenzell"
    },
    {
        " as well as the Five States voted against Zwingli. ": null
    },
    {
        "Bern": "Canton Of Bern"
    },
    {
        ", ": null
    },
    {
        "Basel": "Canton Of Basel"
    },
    {
        ", ": null
    },
    {
        "Schaffhausen": "Canton Of Schaffhausen"
    },
    {
        ", and ": null
    },
    {
        "Zürich": "Canton Of Zürich"
    },
    {
        " supported him.      The Baden disputation exposed a deep rift in the Confederation on matters of religion. The Reformation was now emerging in other states. The city of ": null
    },
    {
        "St Gallen": "St Gallen"
    },
    {
        ", an affiliated state to the Confederation, was led by a reformed mayor, ": null
    },
    {
        "Joachim Vadian": "Joachim Vadian"
    },
    {
        ", and the city abolished the mass in 1527, just two years after Zürich. In Basel, although Zwingli had a close relationship with Oecolampadius, the government did not officially sanction any reformatory changes until 1 April 1529 when the mass was prohibited. Schaffhausen, which had closely followed Zürichs example, formally adopted the Reformation in September 1529. In the case of Bern, ": null
    },
    {
        "Berchtold Haller": "Berchtold Haller"
    },
    {
        ", the priest at ": null
    },
    {
        "St Vincent Münster": "Münster Of Berne"
    },
    {
        ", and ": null
    },
    {
        "Niklaus Manuel": "Niklaus Manuel"
    },
    {
        ", the poet, painter, and politician, had campaigned for the reformed cause. But it was only after another disputation that Bern counted itself as a canton of the Reformation. Four hundred and fifty persons participated, including pastors from Bern and other cantons as well as theologians from outside the Confederation such as ": null
    },
    {
        "Martin Bucer": "Martin Bucer"
    },
    {
        " and ": null
    },
    {
        "Wolfgang Capito": "Wolfgang Capito"
    },
    {
        " from ": null
    },
    {
        "Strasbourg": "Strasbourg"
    },
    {
        ", ": null
    },
    {
        "Ambrosius Blarer": "Ambrosius Blarer"
    },
    {
        " from ": null
    },
    {
        "Constance": "Konstanz"
    },
    {
        ", and ": null
    },
    {
        "Andreas Althamer": "Andreas Althamer"
    },
    {
        " from ": null
    },
    {
        "Nuremberg": "Nuremberg"
    },
    {
        ". Eck and Fabri refused to attend and the Catholic cantons did not send representatives. The meeting started on 6 January 1528 and lasted nearly three weeks. Zwingli assumed the main burden of defending the Reformation and he preached twice in the Münster. On 7 February 1528 the council decreed that the Reformation be established in Bern.           Even before the Bern disputation, Zwingli was canvassing for an alliance of reformed cities. Once Bern officially accepted the Reformation, a new alliance, das Christliche Burgrecht  was created. . Potter also translates Burgrecht as Civic Union , while  translates it as Fortress Law . The first meetings were held in Bern between representatives of Bern, Constance, and Zürich on 5–6 January 1528. Other cities, including Basel, ": null
    },
    {
        "Biel": "Biel"
    },
    {
        ", ": null
    },
    {
        "Mülhausen": "Mülhausen"
    },
    {
        ", Schaffhausen, and St Gallen, eventually joined the alliance. The Five States felt encircled and isolated, so they searched for outside allies. After two months of negotiations, the Five States formed die Christliche Vereinigung with ": null
    },
    {
        "Ferdinand of Austria": "Ferdinand I, Holy Roman Emperor"
    },
    {
        " on 22 April 1529.          Soon after the Austrian treaty was signed, a reformed preacher, Jacob Kaiser, was captured in ": null
    },
    {
        "Uznach": "Uznach"
    },
    {
        " and executed in Schwyz. This triggered a strong reaction from Zwingli; he drafted Ratschlag über den Krieg for the government. He outlined justifications for an attack on the Catholic states and other measures to be taken. Before Zürich could implement his plans, a delegation from Bern that included Niklaus Manuel arrived in Zürich. The delegation called on Zürich to settle the matter peacefully. Manuel added that an attack would expose Bern to further dangers as Catholic ": null
    },
    {
        "Valais": "Valais"
    },
    {
        " and the Duchy of Savoy bordered its southern flank. He then noted, You cannot really bring faith by means of spears and halberds. . In ": null
    },
    {
        "Early Modern German": "Early Modern German"
    },
    {
        ", Warlich man mag mit spiess und halberten den glouben nit ingeben. Zürich, however, decided that it would act alone, knowing that Bern would be obliged to acquiesce. War was declared on 8 June 1529. Zürich was able to raise an army of 30,000 men. The Five States were abandoned by Austria and could raise only 9,000 men. The two forces met near ": null
    },
    {
        "Kappel": "Kappel Am Albis"
    },
    {
        ", but war was averted due to the intervention of Hans Aebli, a relative of Zwingli, who pleaded for an armistice.       Zwingli was obliged to state the terms of the armistice. He demanded the dissolution of the Christian Alliance; unhindered preaching by reformers in the Catholic states; prohibition of the pension system; payment of war reparations; and compensation to the children of Jacob Kaiser. Manuel was involved in the negotiations. Bern was not prepared to insist on the unhindered preaching or the prohibition of the pension system. Zürich and Bern could not agree and the Five States pledged only to dissolve their alliance with Austria. This was a bitter disappointment for Zwingli and it marked his decline in political influence.  The first Land Peace of Kappel, der erste Landfriede , ended the war on 24 June.              While Zwingli carried on the political work of the Swiss Reformation, he developed his theological views with his colleagues. The famous disagreement between Luther and Zwingli on the interpretation of the ": null
    },
    {
        "eucharist": "Eucharist"
    },
    {
        " originated when ": null
    },
    {
        "Andreas Karlstadt": "Andreas Karlstadt"
    },
    {
        ", Luthers former colleague from ": null
    },
    {
        "Wittenberg": "Wittenberg"
    },
    {
        ", published three pamphlets on the Lords Supper in which Karlstadt rejected the idea of a ": null
    },
    {
        "real presence": "Real Presence"
    },
    {
        " in the elements. These pamphlets, published in Basel in 1524, received the approval of Oecolampadius and Zwingli. Luther rejected Karlstadts arguments and considered Zwingli primarily to be a partisan of Karlstadt. Zwingli began to express his thoughts on the eucharist in several publications including de Eucharistia . Understanding that Christ had ascended to heaven and was sitting at the Fathers right hand, Zwingli criticized the idea that Christs humanity could be in two places at once. Unlike his divinity, Christs human body was not omnipresent and so could not be in heaven and at the same time be present in the elements. Timothy George, evangelical author, editor of Christianity Today and professor of Historical Theology at Beeson Divinity School at Samford University, has firmly refuted a long-standing misreading of Zwingli that erroneously claimed the Reformer denied all notions of real presence and believed in a memorial view of the Supper, where it was purely symbolic. George, Timothy. Theology of the Reformers . B & H Publishing Group.      By spring 1527, Luther reacted strongly to Zwinglis views in the treatise Dass Diese Worte Christi Das ist mein Leib etc. noch fest stehen wider die Schwarmgeister . The controversy continued until 1528 when efforts to build bridges between the Lutheran and the Zwinglian views began. ": null
    },
    {
        "Martin Bucer": "Martin Butzer"
    },
    {
        " tried to mediate while ": null
    },
    {
        "Philip of Hesse": "Philip Of Hesse"
    },
    {
        ", who wanted to form a political coalition of all Protestant forces, invited the two parties to ": null
    },
    {
        "Marburg": "Marburg"
    },
    {
        " to discuss their differences. This event became known as the ": null
    },
    {
        "Marburg Colloquy": "Marburg Colloquy"
    },
    {
        ".      Zwingli accepted Philips invitation fully believing that he would be able to convince Luther. In contrast, Luther did not expect anything to come out of the meeting and had to be urged by Philip to attend. Zwingli, accompanied by Oecolampadius, arrived on 28 September 1529, with Luther and ": null
    },
    {
        "Philipp Melanchthon": "Philipp Melanchthon"
    },
    {
        " arriving shortly thereafter. Other theologians also participated including Martin Bucer, ": null
    },
    {
        "Andreas Osiander": "Andreas Osiander"
    },
    {
        ", ": null
    },
    {
        "Johannes Brenz": "Johannes Brenz"
    },
    {
        ", and ": null
    },
    {
        "Justus Jonas": "Justus Jonas"
    },
    {
        ".  The debates were held from 1–4 October and the results were published in the fifteen Marburg Articles. The participants were able to agree on fourteen of the articles, but the fifteenth article established the differences in their views on the presence of Christ in the eucharist.  Professor George summarized the incompatible views, On this issue, they parted without having reached an agreement. Both Luther and Zwingli agreed that the bread in the Supper was a sign. For Luther, however, that which the bread signified, namely the body of Christ, was present “in, with, and under” the sign itself. For Zwingli, though, sign and thing signified were separated by a distance—the width between heaven and earth. George, Timothy. Theology of the Reformers . B & H Publishing Group.          The failure to find agreement resulted in strong emotions on both sides. “When the two sides departed, Zwingli cried out in tears, “There are no people on earth with whom I would rather be at one than the Wittenbergers.”” George, Timothy. Theology of the Reformers . B & H Publishing Group. Because of the differences, Luther initially refused to acknowledge Zwingli and his followers as Christians, Huldreich Zwingli, the Reformer of German Switzerland edited by Samuel Macauley Jackson et al., 1903, page 316                With the failure of the Marburg Colloquy and the split of the Confederation, Zwingli set his goal on an alliance with ": null
    },
    {
        "Philip of Hesse": "Philip Of Hesse"
    },
    {
        ". He kept up a lively correspondence with Philip. Bern refused to participate, but after a long process, Zürich, Basel, and Strasbourg signed a mutual defence treaty with Philip in November 1530. Zwingli also personally negotiated with Frances diplomatic representative, but the two sides were too far apart. France wanted to maintain good relations with the Five States. Approaches to Venice and Milan also failed.      As Zwingli was working on establishing these political alliances, ": null
    },
    {
        "Charles V": "Charles V, Holy Roman Emperor"
    },
    {
        ", the Holy Roman Emperor, invited Protestants to the ": null
    },
    {
        "Augsburg Diet": "Augsburg Diet"
    },
    {
        " to present their views so that he could make a verdict on the issue of faith. The Lutherans presented the ": null
    },
    {
        "Augsburg Confession": "Augsburg Confession"
    },
    {
        ". Under the leadership of Martin Bucer, the cities of Strasbourg, Constance, ": null
    },
    {
        "Memmingen": "Memmingen"
    },
    {
        ", and ": null
    },
    {
        "Lindau": "Lindau"
    },
    {
        " produced the ": null
    },
    {
        "Tetrapolitan Confession": "Tetrapolitan Confession"
    },
    {
        ". This document attempted to take a middle position between the Lutherans and Zwinglians. It was too late for the Burgrecht cities to produce a confession of their own. Zwingli then produced his own private confession, Fidei ratio in which he explained his faith in twelve articles conforming to the articles of the ": null
    },
    {
        "Apostles Creed": "Apostles Creed"
    },
    {
        ". The tone was strongly anti-Catholic as well as anti-Lutheran. The Lutherans did not react officially, but criticised it privately. Zwinglis and Luthers old opponent, ": null
    },
    {
        "Johann Eck": "Johann Eck"
    },
    {
        ", counter-attacked with a publication, Refutation of the Articles Zwingli Submitted to the Emperor.      When Philip of Hesse formed the ": null
    },
    {
        "Schmalkaldic League": "Schmalkaldic League"
    },
    {
        " at the end of 1530, the four cities of the Tetrapolitan Confession joined on the basis of a Lutheran interpretation of that confession. Given the flexibility of the leagues entrance requirements, Zürich, Basel, and Bern also considered joining. However, Zwingli could not reconcile the Tetrapolitan Confession with his own beliefs and wrote a harsh refusal to Bucer and Capito. This offended Philip to the point where relations with the League were severed. The Burgrecht cities now had no external allies to help deal with internal Confederation religious conflicts.      The peace treaty of the First Kappel War did not define the right of unhindered preaching in the Catholic states. Zwingli interpreted this to mean that preaching should be permitted, but the Five States suppressed any attempts to reform. The Burgrecht cities considered different means of applying pressure to the Five States. Basel and Schaffhausen preferred quiet diplomacy while Zürich wanted armed conflict. Zwingli and Jud unequivocally advocated an attack on the Five States. Bern took a middle position which eventually prevailed. In May 1531, Zürich reluctantly agreed to impose a food blockade. It failed to have any effect and in October, Bern decided to withdraw the blockade. Zürich urged its continuation and the Burgrecht cities began to quarrel among themselves.      On 9 October 1531, in a surprise move, the Five States declared war on Zürich. Zürichs mobilisation was slow due to internal squabbling and on 11 October, 3500 poorly deployed men encountered a Five States force nearly double their size near Kappel. Many pastors, including Zwingli, were among the soldiers. The battle lasted less than one hour and Zwingli was among the 500 casualties in the Zürich army.      Zwingli had considered himself first and foremost a soldier of Christ; second a defender of his country, the Confederation; and third a leader of his city, Zürich, where he had lived for the previous twelve years. Ironically, he died at the age of 47, not for Christ nor for the Confederation, but for Zürich.      In Tabletalk, Luther is recorded saying: They say that Zwingli recently died thus; if his error had prevailed, we would have perished, and our church with us. It was a judgment of God. That was always a proud people. The others, the papists, will probably also be dealt with by our Lord God. Luther Works Tabletalk No. 94: God’s Punishment of the Godless Erasmus wrote, We are freed from great fear by the death of the two preachers, Zwingli and ": null
    },
    {
        "Oecolampadius": "Oecolampadius"
    },
    {
        ", whose fate has wrought an incredible change in the mind of many. This is the wonderful hand of God on high. Oecolampadius had died on 24 November. Erasmus also wrote, If ": null
    },
    {
        "Bellona": "Bellona"
    },
    {
        " had favoured them, it would have been all over with us. ": null
    },
    {
        "Philip Hughes": "Philip Hughes"
    },
    {
        " , A Popular History of the Reformation, 1960 reprint, Garden City, NY: Image Books, Ch. 4, Luther. The First Protestants , Sec. v, Zwingli , p. 139.          According to Zwingli, the cornerstone of theology is the Bible. Zwingli appealed to scripture constantly in his writings. He placed its authority above other sources such as the ": null
    },
    {
        "ecumenical councils": "Ecumenical Councils"
    },
    {
        " or the ": null
    },
    {
        "Church Fathers": "Church Fathers"
    },
    {
        ", although he did not hesitate to use other sources to support his arguments.  The principles that guide Zwinglis interpretations are derived from his rationalist humanist education and his Reformed understanding of the Bible.  He rejected literalist interpretations of a passage, such as those of the Anabaptists, and used ": null
    },
    {
        "synecdoche": "Synecdoche"
    },
    {
        "  and analogies, methods he describes in A Friendly Exegesis . Two analogies that he used quite effectively were between baptism and ": null
    },
    {
        "circumcision": "Circumcision"
    },
    {
        " and between the eucharist and ": null
    },
    {
        "Passover": "Passover"
    },
    {
        ".  He also paid attention to the immediate context and attempted to understand the purpose behind it, comparing passages of scripture with each other.        Zwingli rejected the word sacrament in the popular usage of his time. For ordinary people, the word meant some kind of holy action of which there is inherent power to free the conscience from sin. For Zwingli, a sacrament was an initiatory ceremony or a pledge, pointing out that the word was derived from sacramentum meaning an oath.  In his early writings on baptism, he noted that baptism was an example of such a pledge. He challenged Catholics by accusing them of superstition when they ascribed the water of baptism a certain power to wash away sin. Later, in his conflict with the Anabaptists, he defended the practice of infant baptism, noting that there is no law forbidding the practice. He argued that baptism was a sign of a covenant with God, thereby replacing circumcision in the Old Testament.      Zwingli approached the eucharist in a similar manner to baptism. During the first Zürich disputation in 1523, he denied that an actual sacrifice occurred during the mass, arguing that Christ made the sacrifice only once and for all eternity. Hence, the eucharist was a memorial of the sacrifice . Huldreich Zwinglis Samtliche Werke, Vol. I, 460.6–10, as quoted in  Following this argument, he further developed his view, coming to the conclusion of the signifies interpretation for the words of the institution. He used various passages of scripture to argue against ": null
    },
    {
        "transubstantiation": "Transubstantiation"
    },
    {
        " as well as Luthers views, the key text being John 6:63, It is the Spirit who gives life, the flesh is of no avail . Zwinglis approach and interpretation of scripture to understand the meaning of the eucharist was one reason he could not reach a consensus with Luther.      The impact of Luther on Zwinglis theological development has long been a source of interest and discussion among Lutheran scholars, who seek to firmly establish Luther as the first Reformer. Zwingli himself asserted vigorously his independence of Luther and the most recent studies have lent credibility to this claim. Zwingli appears to have read Luthers books in search of confirmation from Luther for his own views. He agreed with the stand Luther took against the pope.  Like Luther, Zwingli was also a student and admirer of ": null
    },
    {
        "Augustine": "Augustine Of Hippo"
    },
    {
        ".        Zwingli enjoyed music and could play several instruments, including the ": null
    },
    {
        "violin": "Violin"
    },
    {
        ", ": null
    },
    {
        "harp": "Harp"
    },
    {
        ", ": null
    },
    {
        "flute": "Flute"
    },
    {
        ", ": null
    },
    {
        "dulcimer": "Dulcimer"
    },
    {
        " and ": null
    },
    {
        "hunting horn": "Hunting Horn"
    },
    {
        ". He would sometimes amuse the children of his congregation on his ": null
    },
    {
        "lute": "Lute"
    },
    {
        " and was so well known for his playing that his enemies mocked him as the evangelical lute-player and fifer . c. 152515291960literally: music departement1504-1575Zürich Consensus4 vols.1995 1519/2015221522152215231523152415241524 1523 15241525 152715281530153015311484–1531": null
    }
]