[
    {
        "   A hull is the ": null
    },
    {
        "watertight": "Watertight"
    },
    {
        " body of a ": null
    },
    {
        "ship": "Ship"
    },
    {
        " or boat. The hull may open at the top , or it may be fully or partially covered with a deck. Atop the deck may be a ": null
    },
    {
        "deckhouse": "Deckhouse"
    },
    {
        " and other ": null
    },
    {
        "superstructures": "Superstructure"
    },
    {
        ", such as a funnel, derrick, or ": null
    },
    {
        "mast": "Mast"
    },
    {
        ". The line where the hull meets the water surface is called the ": null
    },
    {
        "waterline": "Waterline"
    },
    {
        ".       There is a wide variety of hull types that are chosen for suitability for different usages, the hull shape being dependent upon the needs of the design. Shapes range from a nearly perfect box in the case of scow barges, to a needle-sharp surface of revolution in the case of a racing multihull sailboat. The shape is chosen to strike a balance between cost, hydrostatic considerations , hydrodynamics and special considerations for the ships role, such as the rounded bow of an ": null
    },
    {
        "icebreaker": "Icebreaker"
    },
    {
        " or the flat bottom of a ": null
    },
    {
        "landing craft": "Landing Craft"
    },
    {
        ".     In a typical modern steel ship, the hull will have watertight decks, and major transverse members called ": null
    },
    {
        "bulkheads": "Bulkhead"
    },
    {
        ". There may also be intermediate members such as ": null
    },
    {
        "girders": "Girders"
    },
    {
        ", ": null
    },
    {
        "stringers": "Wikt:Stringer"
    },
    {
        " and ": null
    },
    {
        "webs": "I-Beam"
    },
    {
        ", and minor members called ordinary transverse frames, frames, or longitudinals, depending on the ": null
    },
    {
        "structural arrangement": "Structural Arrangement"
    },
    {
        ". The uppermost continuous deck may be called the upper deck , weather deck , spar deck , ": null
    },
    {
        "main deck": "Main Deck"
    },
    {
        " , or simply deck . The particular name given depends on the context—the type of ship or boat, the arrangement, or even where it sails.     In a typical wooden sailboat, the hull is constructed of wooden planking, supported by transverse frames and bulkheads, which are further tied together by longitudinal stringers or ceiling. Often but not always there is a centerline longitudinal member called a ": null
    },
    {
        "keel": "Keel"
    },
    {
        ". In ": null
    },
    {
        "fiberglass": "Fiberglass"
    },
    {
        " or composite hulls, the structure may resemble wooden or steel vessels to some extent, or be of a ": null
    },
    {
        "monocoque": "Monocoqueboats And Ships"
    },
    {
        " arrangement. In many cases, composite hulls are built by sandwiching thin fiber-reinforced skins over a lightweight but reasonably rigid core of foam, balsa wood, impregnated paper honeycomb or other material.     Perhaps the earliest proper hulls were built by the ": null
    },
    {
        "Ancient Egypt": "Ancient Egypt"
    },
    {
        "ians, who by ": null
    },
    {
        "3000 BC": "30Th Century Bc"
    },
    {
        " knew how to assemble wooden ": null
    },
    {
        "planks": "Plank"
    },
    {
        " into a hull. Ward, Cheryl. Worlds Oldest Planked Boats, in  Archaeology  . ": null
    },
    {
        "Archaeological Institute of America": "Archaeological Institute Of America"
    },
    {
        ".        Hulls come in many varieties and can have composite shape, , but are grouped primarily as follows:   Chined and hard-chined. Examples are the flat-bottom , v-bottom, and multi-bottom hull . These types have at least one pronounced knuckle throughout all or most of their length.   Moulded, round bilged or soft-": null
    },
    {
        "chined": "Chine"
    },
    {
        ". These hull shapes all have smooth curves. Examples are the round bilge, semi-round bilge, and s-bottom hull.           ": null
    },
    {
        "buoyancy": "Buoyancy"
    },
    {
        ". Vessels that have this type of hull travel through the water at a limited rate that is defined by the waterline length. They are often, though not always, heavier than planing types.   Planing hull: here, the ": null
    },
    {
        "planing": "Planing"
    },
    {
        " hull form is configured to develop positive ": null
    },
    {
        "dynamic pressure": "Dynamic Pressure"
    },
    {
        " so that its ": null
    },
    {
        "draft decreases": "Draft"
    },
    {
        " with increasing speed. The dynamic lift reduces the wetted surface and therefore also the ": null
    },
    {
        "drag": "Drag"
    },
    {
        ". They are sometimes flat-bottomed, sometimes V-bottomed and more rarely, round-bilged. The most common form is to have at least one chine, which makes for more efficient planing and can throw spray down. Planing hulls are more efficient at higher speeds  , although they still require more energy to achieve these speeds. An effective planing hull must be as light as possible with flat surfaces that are consistent with good sea keeping. Sail boats that plane must also sail efficiently in displacement mode in light winds.   Semi-displacement, or semi-planing: here the hull form is capable of developing a moderate amount of dynamic lift; however, most of the vessels weight is still supported through buoyancy.       At present, the most widely used form is the round bilge hull. Zeilen: Van beginner tot gevorderde by Karel Heijnen     In the ": null
    },
    {
        "inverted bell": "Inverted Bell"
    },
    {
        " shape of the hull, with a smaller payload the ": null
    },
    {
        "waterline": "Waterline"
    },
    {
        " cross-section is less, hence the resistance is less and the speed is higher. With a higher payload the outward bend provides smoother performance in waves. As such, the inverted bell shape is a popular form used with planing hulls.          A chined hull consists of straight, smooth, tall, long, or short plates, timbers or sheets of ply, which are set at an angle to each other when viewed in transverse section. The traditional chined hull is a simple hull shape because it works with only straight planks bent into a curve. These boards are often bent lengthwise. Plywood chined boats made of 8x4 sheets have most bend along the long axis of the sheet. Only thin ply 3–6  mm can easily be shaped into a compound bend. Most home-made constructed boats are chined hull boats. Mass-produced chine powerboats are usually made of sprayed chop strand fibreglass over a wooden mold. The Cajun pirogue is an example of a craft with hard chines. Benefits of this type of hull is the low production cost and the fairly flat bottom, making the boat faster at ": null
    },
    {
        "planing": "Planing"
    },
    {
        ". Sail boats with chined hull make use of a dagger board or keel.     Chined hulls may have one of three shapes:   Flat-bottom chined hulls   Multi-chined hulls   V-bottom chined hulls. Sometimes called hard chine.     Each of these chine hulls has its own unique characteristics and use. The flat-bottom hull has high initial stability but high drag. To counter the high drag, hull forms are narrow and sometimes severely tapered at bow and stern. This leads to poor stability when heeled in a sailboat. This is often countered by using heavy interior ballast on sailing versions. They are best suited to sheltered inshore waters. Early racing power boats were fine forward and flat aft. This produced maximum lift and a smooth, fast ride in flat water, but this hull form is easily unsettled in waves. The multi chine hull approximates a curved hull form. It has less drag than a flat-bottom boat. Multi chines are more complex to build but produce a more seaworthy hull form. They are usually displacement hulls. V or arc-bottom chine boats have a Vshape between 6and 23degrees. This is called the deadrise angle. The flatter shape of a 6-degree hull will plane with less wind or a lower-horsepower engine but will pound more in waves. The deep Vform  is only suited to high-powered planing boats. They require more powerful engines to lift the boat onto the plane but give a faster, smoother ride in waves.   Displacement chined hulls have more wetted surface area, hence more drag, than an equivalent round-hull form, for any given displacement.                Smooth curve hulls are hulls which use, just like the curved hulls, a centreboard or an attached keel.     Semi round bilge hulls are somewhat less round. The advantage of the semi-round is that it is a nice middle between the S-bottom and chined hull. Typical examples of a semi-round bilge hull can be found in the ": null
    },
    {
        "Centaur": "Centaur"
    },
    {
        " and ": null
    },
    {
        "Laser": "Laser"
    },
    {
        " cruising ": null
    },
    {
        "dinghies": "Dinghies"
    },
    {
        ".          S-bottom hulls are hulls shaped like an s. In the s-bottom, the hull runs smooth to the keel. As there are no sharp corners in the fuselage. Boats with this hull have a fixed keel, or a kielmidzwaard . This is a short fixed keel, with a swing keel inside. Examples of cruising dinghies that use this s-shape are the ": null
    },
    {
        "Yngling": "Yngling"
    },
    {
        " and ": null
    },
    {
        "Randmeer": "Randmeer"
    },
    {
        ".        ": null
    },
    {
        "rudder": "Rudder"
    },
    {
        ", ": null
    },
    {
        "trim tabs": "Trim Tabuses In Boats"
    },
    {
        " or stabilizing fins may be fitted.   A ": null
    },
    {
        "keel": "Keel"
    },
    {
        " may be fitted on a hull to increase the transverse stability, directional stability or to create lift.   A forward protrusion below the waterline is called a ": null
    },
    {
        "bulbous bow": "Bulbous Bow"
    },
    {
        ". These are fitted on some hulls to reduce the ": null
    },
    {
        "wave making resistance": "Wave Making Resistance"
    },
    {
        " drag": "Drag"
    },
    {
        " and thereby increase ": null
    },
    {
        "fuel efficiency": "Fuel Efficiency"
    },
    {
        ". Bulbs fitted at the stern are less common but accomplish a similar task.         Baseline  is a level reference line from which vertical distances are measured.    Bow  is the front part of the hull.    Amidships  is the middle portion of the vessel in the fore and aft direction.    Port  is the left side of the vessel when facing the bow from on board.    Starboard  is the right side of the vessel when facing the bow from on board.    Stern  is the rear part of the hull.    Waterline  is an imaginary line circumscribing the hull that matches the surface of the water when the hull is not moving.             Hull forms are defined as follows:     Block measures that define the principal dimensions. They are:   ": null
    },
    {
        "Beam": "Beam"
    },
    {
        " or breadth  is the width of the hull.   ": null
    },
    {
        "Draft": "Draft"
    },
    {
        "  or  is the vertical distance from the bottom of the keel to the ": null
    },
    {
        "waterline": "Waterline"
    },
    {
        ".   ": null
    },
    {
        "Freeboard": "Freeboard"
    },
    {
        "  is depth plus the height of the keel structure minus draft.   ": null
    },
    {
        "Length at the waterline": "Length At The Waterline"
    },
    {
        "  is the length from the forwardmost point of the waterline measured in profile to the stern-most point of the waterline.   ": null
    },
    {
        "Length between perpendiculars": "Length Between Perpendiculars"
    },
    {
        "  is the length of the summer load waterline from the ": null
    },
    {
        "stern": "Stern"
    },
    {
        " post to the point where it crosses the ": null
    },
    {
        "stem": "Stem"
    },
    {
        ".    ": null
    },
    {
        "Length overall": "Length Overall"
    },
    {
        "  is the extreme length from one end to the other.   Moulded depth  is the vertical distance measured from the top of the keel to the underside of the upper deck at side. , Annex 1, Regulations for determining gross and net tonnages of ships, Reg. 2. In ships with rounded ": null
    },
    {
        "gunwales": "Gunwale"
    },
    {
        ", the upper measurement point is take to the point at which the planes of the deck and side plating intersect. Id., Reg. 2. Ships with stepped decks are measured to a line parallel with the upper part. Id., Reg. 2.     Form derivatives that are calculated from the shape and the block measures. They are:   ": null
    },
    {
        "Displacement": "Displacement"
    },
    {
        "  is the weight of water equivalent to the immersed volume of the hull.   Longitudinal centre of buoyancy  is the longitudinal distance from a point of reference to the centre of the displaced volume of water when the hull is not moving. Note that the longitudinal centre of gravity or centre of the weight of the vessel must align with the LCB when the hull is in equilibrium.   Longitudinal centre of flotation  is the longitudinal distance from a point of reference to the centre of the area of waterplane when the hull is not moving. This can be visualized as being the area defined by the waters surface and the hull.   Vertical centre of buoyancy  is the vertical distance from a point of reference to the centre of the displaced volume of water when the hull is not moving.   Volume  is the volume of water displaced by the hull.        Coefficients  help compare hull forms as well:     1C b VBTVL   B   TWLWL": null
    }
]