[
    {
        "Hultsfred Municipality  is a ": null
    },
    {
        "municipality": "Municipalities Of Sweden"
    },
    {
        " in ": null
    },
    {
        "Kalmar County": "Kalmar County"
    },
    {
        ", in south-eastern ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ". The seat is in the town of ": null
    },
    {
        "Hultsfred": "Hultsfred"
    },
    {
        ".     The present municipality was created in 1971 through the amalgamation of the market town  of Hultsfred with a number of surrounding municipalities. In 1863 there were eight entities in the area.     Hultsfred is known as the site of a major ": null
    },
    {
        "rock": "Rock And Roll"
    },
    {
        " festival in Sweden, the ": null
    },
    {
        "Hultsfred Festival": "Hultsfred Festival"
    },
    {
        ".       Basically every one of the localities of Hultsfred Municipality are situated on the railway. Besides Hultsfred, in the mid north of the municipality, there are the towns of ": null
    },
    {
        "Virserum": "Virserum"
    },
    {
        " in the south-west and other ever smaller settlements such as ": null
    },
    {
        "Lönneberga": "Lönneberga"
    },
    {
        ", ": null
    },
    {
        "Silverdalen": "Silverdalen"
    },
    {
        " and ": null
    },
    {
        "Målilla": "Målilla"
    },
    {
        ". The population of the municipality has however been decreasing with some 2,000 people in the last 10 years, as many people move to larger ": null
    },
    {
        "cities": "Cities Of Sweden"
    },
    {
        ", causing a decrease in nativity.     Much of the geography is taken up with forests, a notability for the entire province of ": null
    },
    {
        "Småland": "Småland"
    },
    {
        ", with some few scattered areas suitable for agriculture.       In the age known as the ": null
    },
    {
        "Nordic Bronze Age": "Nordic Bronze Age"
    },
    {
        ", the area had some shipping of furs to northern Germany and the ": null
    },
    {
        "Roman": "Ancient Rome"
    },
    {
        " army, but not much is known from that time other than the area being inhabited; there has also been older finds from 3000-4000 BC. However, from the medieval age, around 1100 AD, there still remains a few churches.     The area continued to be inhabited mainly by farmers until the 20th century. In the 17th and 18th there was some production of iron in Kalmar County, totalling about 10 mines; of those 2 were located to the municipality of Hultsfred. Hultsfred was a center for some military exercising companies during the 19th century, and some remaining building can be visited in the vicinity of Silverån. When the railroads through Sweden were built late in that century, Hultsfred received a population boost.     There are several folks museums around the area that keeps trace of its history.       There are eight ": null
    },
    {
        "urban areas": "Urban Areas In Sweden"
    },
    {
        " in Hultsfred Municipality.     In the table the localities are listed according to the size of the population as of December 31, 2005. The municipal seat is in bold characters.                   Hultsfred Municipality is ": null
    },
    {
        "twinned": "Twin Towns And Sister Cities"
    },
    {
        " with:    ": null
    },
    {
        "Rumia": "Rumia"
    },
    {
        ", ": null
    },
    {
        "Poland": "Poland"
    }
]