[
    {
        "        Iceman  is a fictional ": null
    },
    {
        "superhero": "Superhero"
    },
    {
        " appearing in ": null
    },
    {
        "American comic books": "American Comic Book"
    },
    {
        " published by ": null
    },
    {
        "Marvel Comics": "Marvel Comics"
    },
    {
        " and is a founding member of the ": null
    },
    {
        "X-Men": "X-Men"
    },
    {
        ". Created by writer ": null
    },
    {
        "Stan Lee": "Stan Lee"
    },
    {
        " and artist ": null
    },
    {
        "Jack Kirby": "Jack Kirby"
    },
    {
        ", the character first appeared in ": null
    },
    {
        "The X-Men": "Uncanny X-Men"
    },
    {
        " 1 .     Iceman is a member of a subspecies of humans known as ": null
    },
    {
        "mutants": "Mutant"
    },
    {
        ", who are born with superhuman abilities. He has the ability to manipulate ice and cold by freezing ": null
    },
    {
        "water vapor": "Water Vapor"
    },
    {
        " around him. This allows him to freeze objects, as well as turn his body into ": null
    },
    {
        "ice": "Ice"
    },
    {
        ". The character received widespread media attention when it was revealed that he was gay in  All-New X-Men  40.     The character has been frequently present in X-Men and ": null
    },
    {
        "Spider-Man": "Spider-Man"
    },
    {
        "-related ": null
    },
    {
        "comics": "American Comic Book"
    },
    {
        ", video games, animated series, and movies. ": null
    },
    {
        "Shawn Ashmore": "Shawn Ashmore"
    },
    {
        " portrayed Iceman in the ": null
    },
    {
        "X-Men films": "X-Men"
    },
    {
        ", and voices the character in  The Super Hero Squad Show .          Created by writer ": null
    },
    {
        "Stan Lee": "Stan Lee"
    },
    {
        " and artist/co-writer ": null
    },
    {
        "Jack Kirby": "Jack Kirby"
    },
    {
        ", the character first appeared in  X-Men  1 . Lee later admitted that Iceman was created essentially as a copy of the ": null
    },
    {
        "Human Torch": "Human Torch"
    },
    {
        ", only using the opposite element for his power.      Iceman was featured in two self-titled limited comic book miniseries, one in 1984-85 written by ": null
    },
    {
        "J. M. DeMatteis": "J. M. Dematteis"
    },
    {
        " and another in the 2000s by Andy Lanning and Dan Abnett, with art by ": null
    },
    {
        "Karl Kerschl": "Karl Kerschl"
    },
    {
        ". DeMatteis said of the first series, It was my idea, so there was no one to blame but myself. Ill just say that it was a mistake and if the series made any sense whatsoever it was due to ": null
    },
    {
        "Bob Budiansky": "Bob Budiansky"
    },
    {
        ". That was a case where the editors input was really needed - and Bob was a big help.      A mainstay in most X-Men titles, Iceman has been a main character in both Uncanny X-Men and the second volume of X-Men and was also featured in  The Champions  from 1975 to 1978  and  The New Defenders  from 1983 to 1986 as a member. He was a main character in the first volume of X-Factor, and a star in flashback stories when he was a teenager in X-Men: The Hidden Years and X-Men: First Class.     In April 2015, in issue 40 of All-New X-Men, a time-displaced version of the teenaged Iceman was revealed as ": null
    },
    {
        "gay": "Gay"
    },
    {
        " by his teammate, ": null
    },
    {
        "Jean Grey": "Jean Grey"
    },
    {
        ", who discerned this with her telepathic ability. Hanks, Henry. . . ": null
    },
    {
        "CNN": "Cnn"
    },
    {
        ". Retrieved June 12, 2015. This raised questions, because the characters adult, present-day counterpart had previously been portrayed dating women. In Uncanny X-Men 600, which was published in November that year, the young Iceman confronts his older self, who confirms that he is gay as well but repressed his true self, not wanting to be both gay and a mutant. Wong, Curtis M. . . ": null
    },
    {
        "The Huffington Post": "The Huffington Post"
    },
    {
        ". In 2017, Iceman received his first ongoing solo series, which focused on the adult Bobby Drake coming to terms with life as an out gay man, his Omega-level superpowers, his legacy as a hero and fighting some of the biggest villains in the Marvel Universe.  The book had been cancelled, with its last issue being in early 2018.  However, Marvel later reversed the decision and announced that a new book written by original writer Sina Grace will be a part of their Fresh Start initiative and will be released in 2019.                     Robert Louis Bobby Drake was born in ": null
    },
    {
        "Floral Park": "Floral Park, New York"
    },
    {
        ", ": null
    },
    {
        "Long Island": "Long Island"
    },
    {
        ", ": null
    },
    {
        "New York": "New York"
    },
    {
        ", to William Robert Drake and Madeline Beatrice Bass-Drake. His father is ": null
    },
    {
        "Irish-American": "Irish-American"
    },
    {
        " Catholic": "Catholic"
    },
    {
        ", and his mother is ": null
    },
    {
        "Jewish": "Jewish-American"
    },
    {
        ". Iceman 1 . Marvel Comics. Bobbys powers first manifested when he was on a date with Judy Harmon, and a local bully by the name of Rocky Beasely tried to take Judy away for himself. Knowing Judy could not put up a good fight, Bobby pointed his hand at Beasely and encased him in a block of ice. Later, the local townspeople, having heard of the incident, came looking for him in the form of an angry mob. The local sheriff had no choice but to put Bobby in jail for his own protection . While Bobby sat in his cell at the sheriff station, the outer wall was blown open, and a young man named ": null
    },
    {
        "Scott Summers": "Cyclops"
    },
    {
        " walked in and offered to take Bobby with him. After Bobby turned him down, the two mutants got into a short battle, which was soon ended by the arrival of ": null
    },
    {
        "Professor Charles Xavier": "Professor X"
    },
    {
        ". X-Men 44-46     After Xavier spoke with Bobby and his parents, Bobbys parents suggested that he go with Professor Xavier to his school for gifted youngsters . Bobby took the suggestion and left with Professor Xavier and Cyclops to become the second member of the ": null
    },
    {
        "X-Men": "X-Men"
    },
    {
        ". He is later joined by ": null
    },
    {
        "Henry Hank McCoy": "Beast"
    },
    {
        ", ": null
    },
    {
        "Jean Grey": "Jean Grey"
    },
    {
        ", and ": null
    },
    {
        "Warren Worthington III": "Warren Worthington Iii"
    },
    {
        " as the founding members of the X-Men. Drake remains self-conscious regarding the fact that he is the youngest member of the group. Appearing in his original snow covered form, he first battles ": null
    },
    {
        "Magneto": "Magneto"
    },
    {
        " along with the rest of the team, X-Men 1. Marvel Comics. and later the ": null
    },
    {
        "Brotherhood of Evil Mutants": "Brotherhood Of Mutants"
    },
    {
        ". X-Men 4 Bobby Drakes first girlfriend is Zelda. X-Men 7. Marvel Comics. Not long after, he takes on a new ice-covered form. X-Men 8 He then teams up with the ": null
    },
    {
        "Human Torch": "Human Torch"
    },
    {
        " for the first time. Strange Tales 120 The two would become close friends as time went on. With the X-Men, he visits the ": null
    },
    {
        "Savage Land": "Savage Land"
    },
    {
        " and meets ": null
    },
    {
        "Ka-Zar": "Ka-Zar"
    },
    {
        " for the first time. X-Men 10. Marvel Comics. He then battles the ": null
    },
    {
        "Juggernaut": "Juggernaut"
    },
    {
        ", X-Men 13. Marvel Comics. and is badly injured in his first battle against the ": null
    },
    {
        "Sentinels": "Sentinel"
    },
    {
        ". X-Men 14-17 He next battles Magneto by himself. X-Men 18. Marvel Comics. Later, he visits ": null
    },
    {
        "Subterranea": "Subterranea"
    },
    {
        " for the first time. X-Men 34. Marvel Comics. Then, he and Beast battle the ": null
    },
    {
        "Maha Yogi": "Maha Yogi"
    },
    {
        ". X-Men 47 During his original stint with the X-Men, Drake pursues a relationship with ": null
    },
    {
        "Lorna Dane": "Polaris"
    },
    {
        ", although the relationship does not last. Iceman is among the original X-Men captured by ": null
    },
    {
        "Krakoa": "Krakoa"
    },
    {
        ", leading to a new incarnation of X-Men of which he is not a member. With most of the original team, he quits the X-Men. X-Men 94. Marvel Comics.       Iceman moves to the American west coast to attend ": null
    },
    {
        "UCLA": "University Of California, Los Angeles"
    },
    {
        " and becomes a founding member of ": null
    },
    {
        "The Champions": "Champions"
    },
    {
        " of Los Angeles. Champions 1, October 1975. Marvel Comics. However, the Champions soon dissolve.  The Spectacular Spider-Man  17. Marvel Comics.     Iceman is then abducted by ": null
    },
    {
        "Master Mold": "Master Mold"
    },
    {
        ", and alongside Angel, he encounters the ": null
    },
    {
        "Hulk": "Hulk"
    },
    {
        ". The Incredible Hulk vol. 2 7. Marvel Comics. Iceman next aids the ": null
    },
    {
        "Thing": "Thing"
    },
    {
        " in battling the ": null
    },
    {
        "Circus of Crime": "Circus Of Crime"
    },
    {
        ". Marvel Two-in-One 76. Marvel Comics. Drake retires from life as a superhero to earn a college degree in accounting - but apparently at a college on the east coast, not UCLA.  Uncanny X-Men  145, page 10, panel 1. Marvel Comics. While in college, he briefly rejoins the X-Men to rescue the captives of ": null
    },
    {
        "Arcades": "Arcade"
    },
    {
        " henchman, Miss Locke. Uncanny X-Men 145-146. Marvel Comics.     Iceman is reunited with Beast, encounters ": null
    },
    {
        "Cloud": "Cloud"
    },
    {
        ", and then returns as a full-time superhero in an incarnation of the ": null
    },
    {
        "Defenders": "Defenders"
    },
    {
        " alongside his former teammates, Angel and Beast. Defenders 122-123, 125. Marvel Comics. He also battles ": null
    },
    {
        "Professor Powers": "Professor Power"
    },
    {
        " Secret Empire": "Secret Empire"
    },
    {
        " while with the Defenders. Defenders 127-129. Marvel Comics. After the Defenders disband, Drake embarks on his career as an accountant.     Some time later, Iceman encounters Mirage, the daughter of ": null
    },
    {
        "Oblivion": "Oblivion"
    },
    {
        ". Iceman journeys back in time and meets his parents before he was born, and battles Oblivion and Mirage. He then reconciles with his parents. Iceman 1-4. Marvel Comics.       The original X-Men, including Iceman, reunite to form the superhero team ": null
    },
    {
        "X-Factor": "X-Factor"
    },
    {
        ". X-Factor 1 . Marvel Comics. With this new team, he encounters ": null
    },
    {
        "Apocalypse": "Apocalypse"
    },
    {
        " for the first time. X-Factor 6. Marvel Comics.     During his time with the team, ": null
    },
    {
        "Loki": "Loki"
    },
    {
        " captures Bobby, hoping to use him to gain control over the ": null
    },
    {
        "Frost Giants": "Giants"
    },
    {
        ". Loki enhances Bobbys powers and then extracts them to restore the size of the ": null
    },
    {
        "Frost Giants": "Giants"
    },
    {
        ". Iceman is rescued by ": null
    },
    {
        "Thor": "Thor"
    },
    {
        ". Thor 377-378. Marvel Comics. Lokis tampering increases Bobbys powers to such an extent that he begins to lose control of his abilities. During a later battle with the ": null
    },
    {
        "Right": "The Right"
    },
    {
        ", he is fitted with a power-dampening belt which actually helps him control his abilities. Once able only to sheathe his own body in a protective coating of ice, Bobby finds he can encase the entirety of the ": null
    },
    {
        "Empire State Building": "Empire State Building"
    },
    {
        ". With time, Bobby gains sufficient control over his augmented powers and is able to stop using the inhibitor belt. Believing he has achieved his full potential, Bobby does not attempt to develop his abilities further.     With X-Factor, Bobby then defeats ": null
    },
    {
        "Apocalypses Horsemen": "Horsemen Of Apocalypse"
    },
    {
        ". X-Factor 19. Marvel Comics. Iceman helps watch over many of the younger superheroes, something he once was. Most notably, he and Beast help ": null
    },
    {
        "Boom Boom": "Tabitha Smith"
    },
    {
        " gain a more normal life. For a brief while, he also helps supervise the ": null
    },
    {
        "New Mutants": "New Mutants"
    },
    {
        " and their sister team, the ": null
    },
    {
        "X-Terminators": "X-Terminators"
    },
    {
        ". They, in turn, save him from the deadly kiss of ": null
    },
    {
        "Infectia": "Infectia"
    },
    {
        ". X-Factor 29-31. Marvel Comics.     Bobby also develops a romantic relationship with ": null
    },
    {
        "Opal Tanaka": "Opal Tanaka"
    },
    {
        ". After a session of ice sledding, she discovers threatening mail in her mailbox, a precursor to harassment by her cybernetically-enhanced relatives of the Tatsu Clan of the Yakuza, which Bobby helps her out with. X-Factor 63-64. Marvel Comics.     After the ": null
    },
    {
        "Muir Island Saga": "Muir Island Saga"
    },
    {
        " , Iceman rejoins the X-Men along with the rest of X-Factor. Uncanny X-Men 281; X-Men vol. 2 1       When he rejoined the X-Men it seemed that he learned to control his powers and no longer needed the inhibitor belt, this made him believe he reached the limit of his powers. X-Factor 70 The X-Men were separated into two groups, Iceman was placed in the gold team, led by ": null
    },
    {
        "Storm": "Storm"
    },
    {
        ", along with fellow original X-Men Jean Grey and Archangel. Uncanny X-Men 281. Marvel Comics.     One day he took Opal to eat with his parents, however his dad began humiliating her because of her Japanese heritage. The four are attacked by the Cyber-Samurai, which added to William Drakes prejudices about the girl. Uncanny X-Men 289. Marvel Comics. When Bobby came across ": null
    },
    {
        "Mikhail Rasputin": "Mikhail Rasputin"
    },
    {
        " he used his mutant abilities on him. Bobby discovered that his potential was still far from being reached as he converted his body into ice, not just covered by it. Uncanny X-Men 292. Marvel Comics. By turning his entire body to ice, instead of just wearing an icy exterior, Bobby now was capable of using his power in new, aggressive ways, adding spikes and padding to his ice structure. Uncanny X-Men 300. Marvel Comics.     Too busy with the many threats that the X-Men faced every day, Bobby let his relationship with Opal deteriorate and, when they finally saw each other again after weeks, it was only to save her from an attack by mutant haters. Annoyed that she could only gain his attention by nearly getting killed, Opal broke off their relationship. Uncanny X-Men 305. Marvel Comics.     Later, as he was checking on ": null
    },
    {
        "Emma Frost": "Emma Frost"
    },
    {
        " who was in a comatose state after the mutant ": null
    },
    {
        "Trevor Fitzroy": "Trevor Fitzroy"
    },
    {
        " unleashed the mutant-hunting Sentinels on Emma Frost and her students known as the ": null
    },
    {
        "Hellions": "Hellions"
    },
    {
        ", the mansion was hit by an electricity breakdown. Uncanny X-Men 311. Marvel Comics. Emma woke up disoriented, possessed Bobbys mind, and used his powers in ways Bobby never had; she froze an entire river and traveled through water. She was looking for her pupils but after finding out they were dead, she left Bobbys body. Uncanny X-Men 314. Marvel Comics.     Bobby invites Rogue to tag along on a visit to his parents. Wrongly assuming a romantic relation, his father disapproves of Rogue, verbally attacking them with the same prejudices he expressed with Opal. This time, Bobby had enough and left after telling his father that he should just accept the fact that he is a mutant and he would never fit the definition he has of normal. He was upset that Emma exhibited greater control of his powers than he had. Since Rogue was having problems with Gambit, the two of them go on a road trip to ease their minds.     During the Legion Quest, Iceman was one of the X-Men who went back in time to stop ": null
    },
    {
        "Legion": "Legion"
    },
    {
        " from killing Magneto. They succeed, but only partially. Legion does not kill Magneto, but instead accidentally murdered Xavier, his own father, years before Legion had been conceived much less born. This paradox caused the events of the ": null
    },
    {
        "Age of Apocalypse": "Age Of Apocalypse"
    },
    {
        ". At the last moment before the original reality ended, Icemans fellow X-Men, Rogue and Gambit shared a kiss. When reality resumed, Rogues mind-absorbing touch renders Gambit comatose. Having absorbed some secret haunting memories, she needs to get away from the X-Men and Iceman volunteers to join her on a road trip, though at the same time he was starting to see visions of Emma Frost. When Gambit awoke from his coma, he tracked them down and confronted Rogue about what she saw in his mind. She broke off their relationship, Iceman and Gambit returned to the X-Men. X-Men  45. Marvel Comics.     When the entity known as ": null
    },
    {
        "Onslaught": "Onslaught"
    },
    {
        " first appeared, Iceman was chosen as one of his test subjects, along with Storm, Cyclops and Wolverine. They were pitted against a servant of Onslaught named ": null
    },
    {
        "Post": "Post"
    },
    {
        ", in a specific battle area of harsh environment to test the extent of their abilities. They won and were returned to the mansion. However, Icemans chest had been shattered in his ice form during battle, making it impossible to change back to human form. X-Men 50. Marvel Comics. He confronted Emma Frost and demanded to know what she did to his powers in his body and how to save himself. She refused to help since she knew that Bobby would have to do it himself. When he captured her with his ice powers, she telepathically showed him his insecurities. By confronting Opal and his father in her simulation, Iceman realized that Emma was right and managed to transform back to his human body with his chest fully intact. Uncanny X-Men 331. Marvel Comics.     When Graydon Creed was running for President , Bobby was chosen to infiltrate in the campaign. His father stood out in a crowd and spoke in favor of the mutants, which came as a surprise to Bobby. His fathers connection with Bobby was discovered, so the people that worked for Graydon captured him and almost beat him to death. Bobby decided to stay away from the X-Men for a while to be with his dad. Uncanny X-Men 340. Marvel Comics.     Zero Tolerance came across and Bobby found and helped Cecilia Reyes who was trying to keep a secret that she was a mutant. They also joined with Charlotte Jones and the morlock Marrow. After Bastion was defeated, he took Cecilia and Marrow to the mansion, and soon left the X-Men again for a while to be with his parents. X-Men  69. Marvel Comics.     Much later, the X-Men found evidence in one of Destinys journals of a group known as the Twelve, including Xavier, Magneto, Cyclops, Phoenix, Iceman, Polaris, Storm, Cable, Bishop, Sunfire, Mikhail Rasputin and the ": null
    },
    {
        "Living Monolith": "Living Monolith"
    },
    {
        ". They also learned that the Apocalypses Horsemen had been kidnapping these mutants from around the globe. Iceman was captured in the woods near his home by Deathbird, who had become the Horseman War. X-Men 96. Marvel Comics. Gathering the remaining Twelve, the X-Men traveled to Egypt and confronted Apocalypse and the Skrulls. Apocalypse and his forces captured all of the Twelve during the battle, using them in a ritual to give the Chaos-Bringer a new body and incredible power. Magneto and Polaris created opposite magnetic polarities, Iceman, Storm, and Sunfire provided elemental extremes, Cyclops, Phoenix, and Cable gave the sheer power of family, Xavier represented the power of mind and Bishop and Mikhail stood for time and space, while the Monolith linked all their energies together. Nate Grey was to be Apocalypses new host, a powerhouse to store his massive lifeforce. The Twelve managed to free themselves and Cyclops sacrificed his own body and life force to keep Apocalypse from getting Nate. Though the new Apocalypse was defeated, Cyclops seemed lost forever. X-Men 97. Marvel Comics.     After that incident, Iceman helped the Beast to secretly enter Genosha, as he wanted to study the legacy-infected mutates. When the High Evolutionary released his anti-mutation wave, they were trapped in the war-ravaged country. With the aid of Magneto, they escaped and joined forces with the rest of the scattered X-Men. They raided the Evolutionarys satellite, disabled the mutation field and defeated Sinister, who had been manipulating the Evolutionary. Uncanny X-Men 379. Marvel Comics. X-Men  99. Marvel Comics. Uncanny X-Men 380. Marvel Comics.     Iceman was recruited by the living ship ": null
    },
    {
        "Prosh": "Prosh"
    },
    {
        ", along with other mutants, like Jean Grey, Mystique, Toad and Juggernaut, to preserve evolution and save it. In this journey Iceman developed his powers even further, which led him to no longer be afraid of the natural course of his powers and he returned to the X-Men. X-Men Forever 1-5. Marvel Comics. He joined a new team of X-Men, consisting of Angel, ": null
    },
    {
        "Nightcrawler": "Nightcrawler"
    },
    {
        ", Wolverine and Chamber. He was using his abilities in a whole new way now, just channeling the power and not turning his body into ice. Uncanny X-Men 395. Marvel Comics.          During a heated battle with a recently evolved ": null
    },
    {
        "Black Tom Cassidy": "Black Tom Cassidy"
    },
    {
        ", he received a chest wound. After returning to normal his chest did not fully recover and some parts of it remained icy, and he was unable to return them to normal. At first he became afraid of it but in time it made him gain a new attitude in life, even rude at some times. Uncanny X-Men 413. Marvel Comics.     Nobody seemed to realize it at the time, but evidently this was an early sign of Iceman undergoing a secondary mutation of his own. When he repeatedly tried to evade his regular medical check-ups, school nurse ": null
    },
    {
        "Annie Ghazikhanian": "Annie Ghazikhanian"
    },
    {
        " recognized that something odd was going on with him and pressured him to show her the wound. Bobby made her promise not to tell anyone and showed her that parts of his chest are now made of ice and he is unable to change them back to flesh and blood. Iceman wonders if he will entirely turn into ice on a permanent basis. Uncanny X-Men 415. Marvel Comics.     He developed an attitude that, to some of the newer addition to the X-Men, like ": null
    },
    {
        "Stacy X": "Stacy X"
    },
    {
        ", ": null
    },
    {
        "Juggernaut": "Juggernaut"
    },
    {
        " and ": null
    },
    {
        "Northstar": "Northstar"
    },
    {
        ", he comes across as rather arrogant, denouncing their status as team members, as they have not been around as long as he. Iceman even went as far as offending ": null
    },
    {
        "Nightcrawler": "Nightcrawler"
    },
    {
        " by claiming that only the original five, and no one else, has the right to call themselves an X-Man. Uncanny X-Men 420. Marvel Comics.     Bobby was further frustrated when Havok and Polaris announced their imminent wedding, him having carried a torch for Lorna for quite some time. In his frustration he turned to Annie, who had problems with the wedding too, as she was secretly in love with Havok. The nurse surprised him with the accusation of him being a racist - feeling comfortable as a mutant who could pass like a human when needed, opposed to being a fully obvious mutant or a mere human. With his secondary mutation manifesting, though, Iceman was in danger of losing this status. Shocked by the truth of her words, Bobby fully opened up about his fears, that as a man fully made of ice he could never feel the warmth of a physical relationship again. Touched, Annie allowed him to kiss her, but when Havok called off the wedding, wanting to be with Annie instead, she quickly dumped Bobby. Uncanny X-Men 426. Marvel Comics.     Upon encountering ": null
    },
    {
        "Azazel": "Azazel"
    },
    {
        " and his followers, Icemans body is shattered from the neck down. Afterward, he regains his entire ice form, but cannot change back to his human appearance. As a result, Bobby becomes both bitter and despondent because of this drastic change. Uncanny X-Men 429. Marvel Comics.       Iceman joins ": null
    },
    {
        "Rogues": "Rogue"
    },
    {
        " team after she tells him that she wants him as a member. Their first mission as a team is to fight a new threat, a powerful group known as the ": null
    },
    {
        "Children of the Vault": "Children Of The Vault"
    },
    {
        ". X-Men vol. 2 188 . Marvel Comics. The team is successful and during this time, Bobby learns that he can be completely destroyed but then pull himself back together again. It was shown several times during the arc.     The next mission for the team was to locate a man called Pandemic and defeat him. The team was again successful, but Rogue was infected with a virus called Strain 88. ": null
    },
    {
        "Cable": "Cable"
    },
    {
        " took the team, including Bobby, to his island so Rogue could get treatment. X-Men vol. 2 s 194-197. Marvel Comics.     While on Cables island, the team and Iceman began working to defeat the ": null
    },
    {
        "Shiar": "Shiar"
    },
    {
        " weapon known as the Hecatomb. During the chaos, he shared a passionate kiss with ": null
    },
    {
        "Mystique": "Mystique"
    },
    {
        ". X-Men vol. 2 190. Marvel Comics. Even as he did so, he saved many lives by containing the explosion of the Conquistador, and, later, the Hecatomb itself. X-Men vol. 2 199. Marvel Comics.       As the team recovers from Hecatomb attack in Rogues childhood home, it appears that Mystique and Iceman begin a romantic relationship. X-Men vol. 2 200. Marvel Comics. This was a front, as Mystique was using Iceman and the X-Men as a ": null
    },
    {
        "Marauder": "Marauders"
    },
    {
        " spy for ": null
    },
    {
        "Mister Sinister": "Mister Sinister"
    },
    {
        ". X-Men vol. 2 201. Marvel Comics. Marauders soon infiltrated the house; they attempt to gain access to ": null
    },
    {
        "Destinys Diaries": "Destiny The Books Of Truth"
    },
    {
        " on the order of Mr. Sinister . Bobby and ": null
    },
    {
        "Cannonball": "Cannonball"
    },
    {
        " escape from the Marauders in the ": null
    },
    {
        "X-Jet": "Blackbird"
    },
    {
        ", with help from ": null
    },
    {
        "Emma Frost": "Emma Frost"
    },
    {
        ". They are pursued by ": null
    },
    {
        "Sunfire": "Sunfire"
    },
    {
        "; they manage to get the better of him and take him prisoner, but not before he manages to cripple the jet. While Sunfire is unconscious, Iceman and Sam discuss the Mauraders plan to eliminate all precognitive mutants and anyone with knowledge of the future as well as retrieving Destinys Diaries before the Marauders can. During this time, Bobby displayed sub-atomic control of energy transfers when he prevented Sunfire from using his fire-based powers. X-Men vol. 2 202. Marvel Comics.     Cannonball and Bobby, telepathically prompted by Emma Frost, attempt to recover the diaries which are hidden in a dilapidated brewery. Mr. Sinister uses the reverse-engineered version of Xaviers ": null
    },
    {
        "Cerebro": "Cerebro"
    },
    {
        " to track the pair of X-Men to the brewery. The Marauders attack Cannonball and Iceman and overtake them. Bobby, while in his ice form, suffers a gunshot wound from Mystique, which severs one of his arms above the elbow. Mister Sinister, who takes Cannonball prisoner, attempts to telepathically erase his mind so that the X-Men will find him as an empty shell. Iceman attacks Sinister, distracting him, which allows both of the X-Men to escape. X-Men vol. 2 203. Marvel Comics.          The ": null
    },
    {
        "New X-Men": "New X-Men"
    },
    {
        " team decided to raid the headquarters of the ": null
    },
    {
        "Purifiers": "Purifiers"
    },
    {
        " in Washington, D.C., but were forced to retreat. ": null
    },
    {
        "Pixie": "Pixie"
    },
    {
        " teleported them back to the mansion in a rush, but the entire team was scattered between D.C. and Westchester. Iceman, after recovering from his injuries, volunteered to go look for them and was given telepathic directions by ": null
    },
    {
        "Emma Frost": "Emma Frost"
    },
    {
        ". New X-Men 45. Marvel Comics.     Iceman was successful in finding the New X-Men, most of them injured. On the way back, they found that the ": null
    },
    {
        "ONE Sentinels": "Sentinel Squad One"
    },
    {
        " guarding the ": null
    },
    {
        "Xavier Institute": "Xavier Institute For Higher Learning"
    },
    {
        " had become infected by nano-Sentinels and attacked the school. Iceman and New X-Man ": null
    },
    {
        "X-23": "X-23"
    },
    {
        " helped out in the battle with the ONE Sentinels. With the help of ": null
    },
    {
        "Dust": "Dust"
    },
    {
        " and X-23, the X-Men were able to survive this battle but the nano-Sentinel infected human escaped. Uncanny X-Men 493. Marvel Comics.     Soon, Iceman participated in the final battle against the Marauders, the ": null
    },
    {
        "Acolytes": "Acolytes"
    },
    {
        ", and ": null
    },
    {
        "Predator X": "Predator X"
    },
    {
        ". He was one of the X-Men who came running in to fight Predator X after it swallowed ": null
    },
    {
        "Wolverine": "Wolverine"
    },
    {
        " whole. However, he also witnesses his mentor, Professor Xavier, killed by Bishops bullet, which was not meant for him. X-Men 207. Marvel Comics.          Iceman arrives in ": null
    },
    {
        "San Francisco": "San Francisco"
    },
    {
        ", where he was set to meet ": null
    },
    {
        "Hepzibah": "Hepzibah"
    },
    {
        ", ": null
    },
    {
        "Warpath": "Warpath"
    },
    {
        ", and Angel. All four are caught in the effects of a citywide illusion created by ": null
    },
    {
        "Martinique Jason": "Mastermind"
    },
    {
        ", who used her powers to transform the city into a hippie paradise. Uncanny X-Men 495. Marvel Comics. Now calling himself Frosty , he and the others are sent by Martinique to confront Scott Summers and Emma Frost. Uncanny X-Men 498. Marvel Comics. Emma Frost is able to break up the illusion and free everyone. They eventually set up their base of operations in San Francisco as X-Men. Uncanny X-Men 499. Marvel Comics.          Iceman is one of the X-Men that assists in fighting the ": null
    },
    {
        "Skrull": "Skrull"
    },
    {
        " invasion in San Francisco. X-Men: Secret Invasion 1. Marvel Comics.     Iceman rescues Colossus from Venom Uncanny X-Men 513. Marvel Comics. and is later made a part of a team to battle Emma Frosts Dark X-Men. Uncanny X-Men 514 During the final battle on Utopia, Iceman teams up with the X-Students to take on Mimic. Dark Avengers/Uncanny X-Men: Exodus 1. Marvel Comics. Iceman had the labor of providing water to the population. He attempted to use humor to keep everyones spirits up even though he believed that the situation was helpless and that the X-Men were living in the last days of mutantkind. Bobby then helped defeat Predator X and also helped stop Selenes resurrected armys invasion of Utopia.       During the battle with Bastions Nimrod Sentinels, Iceman is severely injured following an attack from one of them that reversed his ice form and left him with burns on his body. X-Force 27. Marvel Comics. He is only there for a short time because his mutant powers help him minimize the injuries he suffered and he is seen back in battle alongside Psylocke and the other X-Men. Uncanny X-Men 525. Marvel Comics.       Early solicitations show that after Wolverine and Cyclops have a major falling out, Wolverine decides to branch off and open The Jean Grey School for Higher Learning back in New York. Iceman is the first person Wolverine approaches and recruits to his new X-Men squad as both a professor and teammate. Iceman is chosen because Wolverine feels he has the kind of spirit the new school needs.  Comic Vine.   . Newsarama.  He also has an off-and-on romantic relationship with Kitty Pryde. Wolverine and the X-Men 2. Marvel Comics.       When the ": null
    },
    {
        "Terrigen": "Terrigen"
    },
    {
        " became toxic for mutants, Iceman was one of the recruits in Storms new team dedicated to protecting mutants from the Terrigen by leading them to ": null
    },
    {
        "X-haven": "X-Mansionx-Haven"
    },
    {
        ". Extraordinary X-Men 1 Iceman mostly works alongside ": null
    },
    {
        "Nightcrawler": "Nightcrawler"
    },
    {
        ", helping him search for ": null
    },
    {
        "Colossus": "Colossus"
    },
    {
        " after he is transformed into one of ": null
    },
    {
        "Apocalypses": "Apocalypse"
    },
    {
        " new horsemen. Extraordinary X-Men 11 Iceman and Nightcrawler manage to track Colossus to ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", where he ambushes them and almost kills them until another squad of X-Men comes in to help. Extraordinary X-Men 14 After that Iceman joins the X-Men when they declare war against the Inhumans after discovering that in a matter of weeks the Terrigen will render earth as completely uninhabitable for mutants. Inhumans vs X-Men 1       Iceman is one of the few heroes summoned by ": null
    },
    {
        "Mr. Fantastic": "Mr. Fantastic"
    },
    {
        " to help the ": null
    },
    {
        "Future Foundation": "Future Foundation"
    },
    {
        " against the villainous being known as the Griever. However, Iceman is not one of the few heroes who were part of ": null
    },
    {
        "Fantastic Fours": "Fantastic Four"
    },
    {
        " expanded members, when one of the original four, ": null
    },
    {
        "Human Torch": "Human Torch"
    },
    {
        " noticed his presence during the battle. Iceman claims that he was with the Fantastic Four in an untold story during the Atlanteans past invasion led by Namor, but Human Torch replies that story Iceman made-up was not-canon . Fantastic Four 2 - 4            Following the ": null
    },
    {
        "war with the Phoenix Five": "Avengers Vs. X-Men"
    },
    {
        ", as Cyclops begins to lash out against government oppression of mutants, a chance comment by Bobby about how the old Cyclops wouldnt tolerate what he is currently doing inspires Beast to travel back in time and recruit ": null
    },
    {
        "the original five X-Men": "Uncanny X-Men1963–1970: Original Run"
    },
    {
        " to stop Cyclops. All-New X-Men 1. Marvel Comics. The team decides to stay in the present instead of returning into the past. They are now called the ": null
    },
    {
        "All-New X-Men": "All-New X-Men"
    },
    {
        " and led by ": null
    },
    {
        "Kitty Pryde": "Kitty Pryde"
    },
    {
        ". The past and present Bobby are particularly shocked when they see each other. The younger Bobby is especially shocked by the older Bobbys Omega level powers, like creating ice golems, and especially his future Ice Wizard self in the ": null
    },
    {
        "Battle of the Atom": "Battle Of The Atom"
    },
    {
        ". All-New X-Men 2. Marvel Comics. Eventually he and the All-New X-Men and the Guardians of the Galaxy travel to the Shiar Empire to rescue Jean Grey from a trial for the genocide that her future Dark Phoenix self committed. The team is then teleported into the ": null
    },
    {
        "Ultimate Marvel": "Ultimate Marvel"
    },
    {
        " universe, where he stumbles into ": null
    },
    {
        "Mole Mans": "Mole Manultimate Marvel"
    },
    {
        " lair. He proudly creates his first ice golem in order to escape.     Returning to their universe, the team are reunited with Cyclops when they are called upon to aid the Guardians of the Galaxy again in retrieving the fabled ": null
    },
    {
        "Black Vortex": "The Black Vortex"
    },
    {
        ". Cyclops, Iceman and Groot become superpowered by the Vortex before returning it to ": null
    },
    {
        "Captain Marvel": "Carol Danvers"
    },
    {
        ".     Later, the younger, time-displaced Bobby is forced to confront being gay by his teammate, Jean, who privately asks him why he calls women hot , when she knows via her psychic abilities that he is gay. This causes the younger Bobby to speculate as to the complicated identity issues faced by his older self and the decisions his older self may have made in the time between them. All-New X-Men 40. Marvel Comics. Together with the young Jean, the young Bobby confronts his older self, who admits to being gay, having concealed that part of himself so that he could have avoid being prejudiced against for another part of himself. Uncanny X-Men 600. Marvel Comics.     Bobby joins the time-displaced Cylcops, Angel and Beast, as well as ": null
    },
    {
        "Kid Apocalypse": "Kid Apocalypse"
    },
    {
        ", ": null
    },
    {
        "All-New Wolverine": "All-New Wolverine"
    },
    {
        " and ": null
    },
    {
        "Oya": "Oya"
    },
    {
        " as they road-trip around America trying to make their own mark on the world. Bobby is initially reluctant to talk about his sexuality with his teammates until Oya and Kid Apocalypse take him to a gay club in an attempt to make him more comfortable. He embarrasses himself and runs into Romeo, an Inhuman with the ability to manipulate and feel others emotions. Romeo makes Bobby more comfortable and the two begin a relationship. All New X-Men Vol. 2 13 The two are later caught in the middle when ": null
    },
    {
        "the X-Men declare war on the Inhumans": "Inhumans Vs. X-Men"
    },
    {
        ". Bobby joins the X-Men when they attack New Attilan but quickly breaks off from the battle to find Romeo, with the two escaping together.       After the ": null
    },
    {
        "X-Mens war against the Inhumans for the Terrigen": "Inhumans Vs. X-Men"
    },
    {
        " ends, Iceman joins the rest of the young X-Men on an attempted return to their original timeline but they quickly realize that theirs isnt part of the ": null
    },
    {
        "Earth 616": "Earth 616"
    },
    {
        " timeline, leaving them stuck in that present time with no knowledge where they were originally from. All-New X-Men 19 Upon learning this, Iceman joins the rest of the young X-Men and leaves the rest of the X-Men to find their place in the world. X-Men: Prime 1 Iceman then joins Magneto in ": null
    },
    {
        "Madripoor": "Madripoor"
    },
    {
        " along with the rest of the time-displaced X-Men; however, due to a lack of trust in their new leader, the X-Men make plans and train in case Magneto returns to his former villainous ways to kill them. Instead of training with his teammates, Iceman spends most of his time trying to reach out to his new ": null
    },
    {
        "Inhuman": "Inhuman"
    },
    {
        " boyfriend Romeo unsuccessfully, placing him into a stupor. X-Men: Blue 2          Iceman possesses the power to instantly decrease the temperature of ambient ": null
    },
    {
        "water vapor": "Water Vapor"
    },
    {
        " in his immediate environment to below zero degrees Celsius, thereby freezing it into ice. He is able to make ice that will not break unless he wills it to. In this manner he is able to quickly form a great variety of ice structures, including projectiles, shields, ladders, baseball bats, etc. Iceman often makes ice slides which form rapidly beneath and behind his feet, moving him along the slick surface at high speeds. He is also able to form exceedingly complicated structures within relative short time, such as miniature cities. Uncanny X-Men 319. Marvel Comics. Originally, Icemans own body temperature would lower dramatically when his powers were active, reaching  within a few tenths of a second . Iceman is immune to sub-zero temperatures; he is also able to perceive the ": null
    },
    {
        "thermal energy": "Thermal Energy"
    },
    {
        " level of objects around him. Because ": null
    },
    {
        "cold": "Cold"
    },
    {
        " is the absence of heat, Iceman does not actually emanate cold; rather, he decreases thermal energy. As mentioned by writer ": null
    },
    {
        "Mike Carey": "Mike Carey"
    },
    {
        ", Iceman is an ": null
    },
    {
        "Omega-level mutant": "Omega-Level Mutant"
    },
    {
        "... has powers that can influence the ecosystem of the entire world. Iceman has yet to tap into his full mutant potential, but over the years he has taken more interest in developing his abilities.     In his early appearances, Iceman generally covered his body in a thick layer of what appeared to be snow; hence he looked more like a traditional snowman than an ice-man. Upon further training in the use of his powers, he was able to fashion an armor of solid ice around his body when using his powers, which afforded him some degree of protection against concussive force and projectiles. Later on, he manifested the ability to convert the tissue of his body into organic ice. He sometimes augments his organic ice form with razor sharp adornments to his shoulders, elbows, knees, and fists. Iceman has also been able to move rapidly to another distant location while in his organic ice form, being able to deposit his bodily mass into a river and reconstitute his entire mass a great distance away in a matter of minutes . On one occasion, Iceman suffered a severe chest injury while in his ice form and was able to heal himself by converting back into his normal human form.     Iceman is also able to reconstitute his organic ice form if any part of it is damaged, or even if it is completely shattered, without permanently harming himself. He can temporarily add the mass of a body of water to his own, increasing his mass, size, and strength. He can survive not only as ice, but as liquid water and water vapor. He can also transform his body from a gaseous state back to a solid, although it is physically and mentally taxing. X-Men vol. 2 193. Marvel Comics. Iceman can also freeze sea water, as seen during the ": null
    },
    {
        "Operation: Zero Tolerance": "Operation: Zero Tolerance"
    },
    {
        " story arc": "Story Arc"
    },
    {
        ". While he usually does not use his powers in lethal ways, his powers are so vast that they extend to the molecular level, to the point that he can freeze all of the molecules of an object/being with a thought; he once froze every single molecule of water within the body of ": null
    },
    {
        "David Haller": "Legion"
    },
    {
        ". X-Men vol. 2 41. Marvel Comics. Iceman is also able to dissolve his own icy constructs.     Icemans powers were pushed to their limit while possessed by Emma Frost, who used Iceman to discover the fate of her ": null
    },
    {
        "Hellions": "Hellions"
    },
    {
        ". During this time Iceman was able to control all forms of moisture, freeze fluids inside peoples bodies, travel as a liquid, solid or gas. Not even the combined might of the X-Men Gold team was able to stop Emma Frost in Icemans body. Uncanny X-Men 313-314. Marvel Comics. Following this, Bobby confronted Emma about how she was able to use his powers so effectively. While together they made some initial progress, she refused to train him further. Instead he turned to Storm because they share similar elemental powers and she agreed to tutor him. X-Men vol. 2 48. Marvel Comics.     When Iceman was injected with Mister Sinisters neuro-inhibiter by Mystique, he was able to save himself by drawing in all of the ambient moisture around him, rapidly replacing his poisoned cells with healthy material before the injection could kill him. X-Men: Manifest Destiny 3. Marvel Comics.     During the 2013–2014 ": null
    },
    {
        "Battle of the Atom": "Battle Of The Atom"
    },
    {
        " storyline, Icemans future self revealed that he has the ability to create semi-independent ice structures that can act on their own, Wolverine and the X-Men 37. Marvel Comics. although one of these structures—demonstrating a Hulk-like physique and intellect—has gone on to join the future version of the Brotherhood. Wolverine and the X-Men 38. Marvel Comics.     Aside from his superhuman powers, Iceman is also a fair hand-to-hand combatant, and received combat training at Xaviers School as well as coaching from the ": null
    },
    {
        "Black Widow": "Black Widow"
    },
    {
        " and ": null
    },
    {
        "Hercules": "Hercules"
    },
    {
        " while serving with the ": null
    },
    {
        "Champions of Los Angeles": "Champions"
    },
    {
        ". Iceman has taken as much combat training as Cyclops or Beast. Richards, Dave . . ": null
    },
    {
        "Comic Book Resources": "Comic Book Resources"
    },
    {
        ".           According to writer Mike Carey one of Icemans best personality traits is that emotionally Bobby Drake is like the ice he manipulates -- not cold but transparent. Hes devastatingly honest. He is very up-front with his emotions and his thoughts all the time. Also, hes obviously incredibly brave both in terms of facing external, physical danger as well as facing up to unpleasant situations and admitting his own mistakes.       Iceman had a brief relationship with a Japanese-American New Yorker named Opal Tanaka. He subsequently exhibited strong feelings for his fellow X-Man ": null
    },
    {
        "Polaris": "Polaris"
    },
    {
        ", but she did not return those feelings, due to her feelings towards Havok. ": null
    },
    {
        "Northstar": "Northstar"
    },
    {
        " developed an unrequited crush for Iceman during their time on the same team, though Iceman never did find out about this. Iceman later had a brief relationship with the Xavier Schools nurse, Annie, but she eventually left him for Havok, who had just left Polaris at the altar. When Iceman attempted to rekindle his relationship with Polaris, that too ended abruptly, and Polaris returned to Havok. Iceman then had a relationship with the X-Mens enemy Mystique, who later betrayed him, despite her continued fixation on him, in as much as she stated that she would either kill him or cure him of his personal uncertainty.     Iceman has long-lasting friendships with ": null
    },
    {
        "Spider-Man": "Spider-Man"
    },
    {
        ", ": null
    },
    {
        "Firestar": "Firestar"
    },
    {
        " and the ": null
    },
    {
        "Human Torch": "Human Torch"
    },
    {
        ".       In All-New X-Men 40, the time-displaced Iceman is revealed to be gay, which eventually forces the youth to confront the adult version of himself about the matter. As both speak, the adult Iceman confirms the fact and that he had put all his energy into just being an X-Man as he couldnt cope with being a mutant and gay simultaneously. With the help of his younger self and Jean Grey, however, he finally comes to terms with his own sexuality, and comes out to fellow gay X-Man ": null
    },
    {
        "Anole": "Anole"
    },
    {
        " in Extraordinary X-Men 6. The end of the Extermination X-Men event saw the redirecting of the time displaced version of Bobby back into the closet when he returned to his original timeline alongside the other X-Men, due to a mind lock by Jean Grey, even though the current version retains his memories and remains an out gay man.            Iceman is Roberto Trefusis in the miniseries  Marvel 1602 , a member of the group of witchbreeds founded by ": null
    },
    {
        "Carlos Javier": "Carlos Javier"
    },
    {
        " and led by ": null
    },
    {
        "Scotius Summerisle": "Alternative Versions Of Cyclops1602"
    },
    {
        ". He is the nephew of naval commander ": null
    },
    {
        "Sir Francis Drake": "Francis Drake"
    },
    {
        ". As in the Marvel Universe, he generates ice and can assume a physical ice form.          In the ": null
    },
    {
        "Age of Apocalypse": "Age Of Apocalypse"
    },
    {
        " storyline, Bobby, along with the rest of the X-Men, is trained by ": null
    },
    {
        "Magneto": "Magneto Age Of Apocalypse"
    },
    {
        ". X-Men Chronicles 1 . Marvel Comics. Because Magneto is harder on his students than ": null
    },
    {
        "Professor X": "Professor X"
    },
    {
        ", Bobby lacks his 616-counterparts sense of humor. Instead, Bobby becomes very cold and inhuman, making his teammates feel uncomfortable. In addition to his normal abilities, Bobby is capable of breaking down his body and merging it with another body of water to travel great distances in a matter of seconds. He can bring others along through a process that he calls moisture ": null
    },
    {
        "molecular": "Molecule"
    },
    {
        " inversion , though it is a painful process for the passengers. Bobby is also able to reconstitute his body from broken pieces. Just before Apocalypses defeat, Colossus stormed right through Iceman, causing him to fall into pieces in an attempt to reach his sister. A couple of months later, Iceman, ": null
    },
    {
        "Exodus": "Exodus"
    },
    {
        ", ": null
    },
    {
        "Wild Child": "Wild Child"
    },
    {
        ", and ": null
    },
    {
        "Morph": "Kevin Sydney"
    },
    {
        " were sent on a secret mission by Magneto; for a time, only Wild Childs fate was revealed.     Iceman returned in the  Uncanny X-Force  arc The Dark Angel Saga , when the title team was forced to travel to the AoA reality. He abandoned the X-Men during a battle with the minions of Weapon X, who had by this time been transformed into that worlds new Apocalypse, a defection later revealed to be the result of Icemans having lost faith in his X-Mens ability to save their world. He was soon brought to Earth-616 by the Dark Beast, where he joined forces with Archangel on his quest to eradicate all life on Earth so he could create a new evolution process. Tired of seeing the people he cared about being killed fighting what he thought to be an unwinnable war, Drake agreed to help Archangel - despite the latters now being the mainstream Marvel Universes version of Drakes X-Mens arch-enemy, Apocalypse - in exchange for transport to the relative paradise that was Earth-616.     After X-Force defeated Archangel, Bobby managed to escape with McCoy and most of Archangels other minions, but eventually broke away from them and went into hiding, living a life of hedonistic bliss in ": null
    },
    {
        "Madripoor": "Madripoor"
    },
    {
        ". The Age of Apocalypse version of Nightcrawler - who, after being brought to Earth-616 along with the rest of his worlds X-Men to help take down Archangel, decided to stay behind there in order to track down and kill the various villains who also came to the mainstream Marvel Universe - eventually tracked Bobby down to execute him for his treason. Nightcrawler is quickly overwhelmed by Drakes avatars, but eventually forces Iceman into a factory boiler room, where theres not enough moisture in the air for him to effectively use his powers. Nightcrawler quickly disables his former friend, and shoves him into an incinerator, killing the once noble hero.     Earth X Earth X , Bobby had become trapped in his ice form, making him vulnerable to melting. He moves to the ": null
    },
    {
        "Arctic": "Arctic"
    },
    {
        " regions of Earth, and made an ice city for himself and the ": null
    },
    {
        "Inuit": "Inuit"
    },
    {
        ". Due to a series of events where Earths orbital path moves, Bobby is able to return to the ": null
    },
    {
        "United States": "United States"
    },
    {
        " to aid in the battle against the demon ": null
    },
    {
        "Mephisto": "Mephisto"
    },
    {
        ".       In the alternate timeline of the ": null
    },
    {
        "House of M": "House Of M"
    },
    {
        " storyline, Iceman was seen in Magnetos army during his rise to power. Civil War: House of M 1. Marvel Comics. Bobby later appears as one of the ": null
    },
    {
        "Horsemen": "Horsemen Of Apocalypsehouse Of M"
    },
    {
        " of ": null
    },
    {
        "Apocalypse": "Apocalypse"
    },
    {
        " because Apocalypse rescued Bobby from a mutant internment camp that his parents had sent him to. Magneto sends Apocalypse to dispose of his rival ": null
    },
    {
        "Black Panther": "Black Panther"
    },
    {
        "; when Apocalypse is attacked en route by Black Panthers allies, Iceman aids him by freezing ": null
    },
    {
        "Namor": "Namor"
    },
    {
        " solid and attempting to attack Storm, but he is severely injured by Sunfire. Black Panther Vol 4 7. Marvel Comics.     Marvel ZombiesMarvel Zombies: Dead Days alongside zombies Wolverine and Cyclops. Ultimately, he is seen attacking Magneto. But Iceman perished at the hands of the Master Of Magnetism himself when Iceman is cut apart.     Mutant X": null
    },
    {
        "Mutant X": "Mutant X"
    },
    {
        " universe, the ": null
    },
    {
        "Asgardian": "Asgard"
    },
    {
        " god ": null
    },
    {
        "Loki": "Loki"
    },
    {
        " amplified Bobbys powers to a dangerous level, leaving him unable to touch any living thing without killing it. Despite this, he retains a jovial and optimistic personality. When Havok has a disagreement with ": null
    },
    {
        "Magneto": "Magneto"
    },
    {
        " and decides to leave the X-Men, Ice-Man is one of those who follow him, becoming a founding member of the Six, who eventually come to be considered the worlds premiere mutant team. Mutant X 1 . Marvel Comics.     New ExilesNew Exiles 9. Marvel Comics.       In the alternate future witnessed in the ": null
    },
    {
        "Battle of the Atom": "Battle Of The Atom"
    },
    {
        " storyline, Icemans had truly evolved to become Sir Robert, the wizard-like Icemaster. As one of the most respected X-Men, he had incredible control over his powers and could even grow a beard! Though never outright mentioned, he may had a relationship with Kitty Pryde and even fathered a son with her, denoting the existence of Carmen Drake, a boy with the powers of both Iceman and Shadowcat. Wolverine and the X-Men 29 He has also developed the ability to create semi-independent ice structures that can act on their own, although one of these structures - demonstrating a Hulk-like physique and intellect - has gone on to join the future version of the Brotherhood, resulting in the Brotherhood using the duplicate to reinforce the illusion of themselves as the future X-Men. The duplicate Iceman was defeated by the O5 Iceman, the present Iceman, and the future Iceman during the battle in the past .     Icemaster later returned to the mainstream marvel universe and confronts Iceman about trusts and decisions. He does it in order to prevent him from doing the same mistakes Icemaster did in the future. Knowing he had little time left, Icemaster eventually revealed to Iceman that after beginning a relationship with Daken, they both led the X-Men to space in order to prevent the Shiar from overwhelm the Earth and lay waste to it. However Icemaster would discover that Dakens plan was actually to obtain the MKraan Crystal in the first place, killing in the process the other X-Men and later Deathbird herself. Icemaster attempts to stop Daken, but he is seconds too late as having the Nexus of all Realities made Daken a Thanos-level player in the cosmos, and he acted as such. Icemaster eventually became convinced, after seeing Bobbys character growth, that his present self had matured beyond what he remembered, leaving the future open for new decisions to be made. With his mission apparently completed, Icemaster turns into thin air soon afterwards. Uncanny X-Men: Winters End 1       In the alternate reality of X-Men: Ronin Iceman is a murderous ninja in the employ of the ": null
    },
    {
        "Hellfire Club": "Hellfire Club"
    },
    {
        ". He works with ": null
    },
    {
        "Pyro": "Pyro"
    },
    {
        " and ": null
    },
    {
        "Avalanche": "Avalanche"
    },
    {
        " as part of the Shadowcat Clan and battles the X-Men.       ": null
    },
    {
        "New Excalibur": "New Excalibur"
    },
    {
        " battles an evil counterpart of Iceman, who is a member of the ": null
    },
    {
        "Shadow-X": "Shadow-X"
    },
    {
        ", the X-Men of an alternate reality in which Professor X was possessed by the ": null
    },
    {
        "Shadow King": "Shadow King"
    },
    {
        ". They are brought to ": null
    },
    {
        "Earth-616": "Earth-616"
    },
    {
        " as a result of ": null
    },
    {
        "M-Day": "Decimation"
    },
    {
        ". He appeared to be mute and died during the final battle against Albion.       In Edge of Spider-verse: Web of Fear, a Spider-Man who is a member of the Captain Britain Corps witnesses Morlun about to kill Spider-Man. Later, a larger picture is shown of Firestar and Iceman lying dead, with Ms. Lion being left out, mourning her comrades. Amazing Spider-Man Vol. 3 8. Marvel Comics.       Iceman appears in  X-Men Noir  as one of the X Men, a crew of talented criminals. He is depicted as being very short-tempered and paranoid. He is dubbed Iceman , and angrily insists others refer to him that way, due to his custom of using an ": null
    },
    {
        "icepick": "Icepick"
    },
    {
        " as a weapon. X-Men Noir 1-4       In the ": null
    },
    {
        "Ultimate Marvel": "Ultimate Marvel"
    },
    {
        " continuity, Bobby Drake is the youngest founding member of the ": null
    },
    {
        "X-Men": "Ultimate X-Men"
    },
    {
        ". He ran away from his family at the peak of government-supported ": null
    },
    {
        "Sentinel": "Sentinel Ultimate Sentinels"
    },
    {
        " attacks, fearing his family would be killed in such an attack.     Ultimate Iceman never had the snowman look of his counterpart, instead generating a flexible ice armor from the beginning. Bobby establishes himself as a valuable asset, single-handedly taking out the ": null
    },
    {
        "Ultimates": "Ultimates"
    },
    {
        " once with a gigantic ice wall , as well as single-handedly halting an invasion by Colonel ": null
    },
    {
        "Wraith": "Kestrel"
    },
    {
        " and ": null
    },
    {
        "Weapon X": "Weapon X"
    },
    {
        ". He was only able to be stopped by ": null
    },
    {
        "Rogue": "Rogue Ultimate Rogue"
    },
    {
        ", who was in temporary possession of ": null
    },
    {
        "Marvel Girls": "Jean Greyultimate Jean Grey/Marvel Girl"
    },
    {
        " telepathy. Professor X has stated that Bobby is one of the three most powerful X-Men. During the World Tour arc, after enlarging his armor to form a gigantic ice troll, Bobby is greatly injured by ": null
    },
    {
        "Proteus": "Proteus"
    },
    {
        ", which resulted in a lawsuit issued by his parents against Xavier. Bobby eventually rebels against his parents, and later returns to the X-Men.     While Bobby was away from the X-Men on a vacation, he had a girlfriend, but ": null
    },
    {
        "Professor Xavier": "Alternative Versions Of Professor Xultimate Charles Xavier"
    },
    {
        " erased all memories of her from Bobbys mind when he told her too much about the X-Men . Upon her acceptance into the X-Men, Bobby begins to date ": null
    },
    {
        "Rogue": "Rogue Ultimate Rogue"
    },
    {
        ". The pair date for a considerable amount of time, but eventually break up due to Bobbys growing feelings for ": null
    },
    {
        "Shadowcat": "Kitty Prydeultimate Shadowcat"
    },
    {
        " and Rogues feelings for ": null
    },
    {
        "Gambit": "Alternative Versions Of Gambitultimate Gambit"
    },
    {
        ". Eventually Rogue leaves, and Bobby starts to date Kitty. After this, the two rekindle their relationship, but problems erupted.     In Ultimate X-Men 80, ": null
    },
    {
        "Bishop": "Bishop"
    },
    {
        " and ": null
    },
    {
        "Hammer": "Hammer Ultimate Eisenhower Canty"
    },
    {
        ", time-travelers from the future, comment on how powerful Bobby will one day become. Ultimate X-Men 80. Marvel Comics. Cyclops disbanded the X-Men in Ultimate X-Men 81 and Bishop and Storm created a new team. Iceman stayed at the Institute as a student only until Xavier returned and reformed his X-Men. Ultimate X-Men 81. Marvel Comics.     Professor X is later revealed to be alive and the X-Men return to the Xavier Institute, which is also when Iceman rejoins the X-Men line up. Jean Grey soon discovers that fellow X-Man, Colossus, is using a drug called Banshee to enhance his mutant abilities. The X-Men are highly against this, but Colossus manages to convince Rogue, Dazzler, Angel, Nightcrawler, and Cyclops to join him on his own X-Men team. Iceman remains on Professor Xs drug-free X-Men and fights the Banshee enhanced X-Men. Xaviers X-Men win and the two teams combine again with nobody using drugs. Ultimate X-Men 100 . Marvel Comics.     The Ultimatum Wave hits the X-Men next killing several of the X-Men . Magneto and the Brotherhood attack the world and Iceman helps the worlds heroes fight them off. Most of the X-Men die, but Iceman is able to survive Magnetos attack. He is last seen demolishing the X-Mansion alongside Rogue and Jean Grey and burying the deceased X-Men in its place. He finds it hard to destroy their home, but he feels it to be the right thing to do now that Professor Xavier is dead. Ultimate X-Men: Requiem. Marvel Comics.     Later, Bobby Drake is kicked out of his home for being a mutant. With nowhere else to go, Kitty suggests to Peter Parkers Aunt May that he move in with her, Peter, Gwen Stacy, and Johnny Storm . Aunt May agrees and enrolls Bobby at Midtown High under the guise of Bobby Parker, one of Peters cousins and shaves his hair off to help keep his, Peters and Johnnys secret identities safe.     Without knowing where to go after ": null
    },
    {
        "Peters death": "List Of Ultimate Spider-Man Story Arcsultimate Spider-Man"
    },
    {
        ", Bobby Drake asked Kitty Pride if Johnny could come with them searching for a place where to live and hide from authorities. They found the Morlock Tunnels where they live now and help mutants in danger. Firstly they rescued Rogue, who joined them, and later ": null
    },
    {
        "Jimmy Hudson": "Jimmy Hudson"
    },
    {
        " , came to them for help after escaping Strykers imprisonment along with other mutants he freed.     X-Men Fairy Tales X-Men Fairy Tales  , Iceman appears as a white wolf with icy breath named Kori . Before he is reached by ": null
    },
    {
        "Cyclops": "Alternative Versions Of Cyclopsx-Men: Fairy Tales"
    },
    {
        ", he appears to have lost faith in friendship.     X-Men: The End X-Men: The End , Iceman appears as one of the instrumental characters in the defeat of ": null
    },
    {
        "Cassandra Nova": "Cassandra Nova"
    },
    {
        " and ": null
    },
    {
        "Khan": "Khan"
    },
    {
        " and one of the few surviving X-Men.             The Sub-Mariner  portion of  The Marvel Super Heroes  episode Dr. Dooms Day . ": null
    },
    {
        "animated series": "List Of Animated Television Series"
    },
    {
        "  Spider-Man and His Amazing Friends , voiced by ": null
    },
    {
        "Frank Welker": "Frank Welker"
    },
    {
        ". In a few episodes, he appears with his and ": null
    },
    {
        "Firestars": "Firestar"
    },
    {
        " former teammates, the X-Men. In the episode Vengeance of Loki , hes revealed to be a government agent; his codename is Windchill Factor Zero . In the episode Mission: Save the Guardstar , ": null
    },
    {
        "Aurora Dante": "Aurora Dante"
    },
    {
        " was introduced. One entire episode was devoted to Icemans origin story. Throughout the series, Iceman has a romantic infatuation with ": null
    },
    {
        "Firestar": "Firestar"
    },
    {
        ".   He appeared in the ": null
    },
    {
        "1992 X-Men animated series": "X-Men"
    },
    {
        ", voiced by ": null
    },
    {
        "Denis Akiyama": "Denis Akiyama"
    },
    {
        ". He appears in the episode Cold Comfort as a former member of the team, who quit due to disagreements with Xavier. Iceman also appears in many flashbacks which include Sanctuary Part 1 and Xavier Remembers .   He appeared in the  X-Men: Evolution  animated series, voiced by ": null
    },
    {
        "Andrew Francis": "Andrew Francis"
    },
    {
        ". Iceman was meant to be the 8th X-Man of the show, but rejected in favor of ": null
    },
    {
        "Spyke": "Spyke"
    },
    {
        ". Not surprisingly, Iceman appeared more often when Spyke left. In the series, Iceman was a New Mutant and often acted as the unofficial leader of the ": null
    },
    {
        "New Mutants": "New Mutants"
    },
    {
        ", as he was the most adept of the group.   Iceman appears in  Wolverine and the X-Men , voiced by ": null
    },
    {
        "Yuri Lowenthal": "Yuri Lowenthal"
    },
    {
        ". He appears as a member of the X-Men who left after ": null
    },
    {
        "Professor X": "Professor X"
    },
    {
        " went M.I.A. after the Institute was destroyed. Wolverine and Beast went to re-recruit him back on to the X-Men but his parents refused to allow him to return to the team after what happened. Being 18, Bobby had the choice to either stay at home or return to the X-Men and he made the choice to rejoin the team. Since he is still in his teens, hes shown at times acting like a typical teenage boy . He is also not fond of reading and is a bit lazy as he was napping on a pile of books instead of giving them to Kitty to put away. He apparently has a crush on Shadowcat, as he is caught staring at her dreamily before asking her out for a bite to eat . It is also hinted she may share those feelings, as in episode 3 when Kitty elbows him for looking at Emma. In episode 20, someone similar to Iceman is shown as a member of the original five X-Men. Wolverine and the X-Men - Episode 1: Foresight   Iceman appears in the episode of  The Super Hero Squad Show  titled Mysterious Mayhem at Mutant Academy , with ": null
    },
    {
        "Shawn Ashmore": "Shawn Ashmore"
    },
    {
        " reprising his role as the character from the live action X-Men films. He is shown as a student at Xavier Academy and classified as the class clown. He has a starring role in the later episode The Ice Melt Cometh where he is needed to re-freeze the melted polar ice caps.           In the films,  X-Men ,  X2 ,  X-Men: The Last Stand , and  X-Men: Days of Future Past , he is played by ": null
    },
    {
        "Shawn Ashmore": "Shawn Ashmore"
    },
    {
        ". Bobby is one of the first students to reach out to ": null
    },
    {
        "Rogue": "Rogue"
    },
    {
        " and begins a romantic relationship with her. In X2, he has an uneasy friendship/rivalry with ": null
    },
    {
        "Pyro": "Pyro"
    },
    {
        ". His relationship with his family is also strained, and his brother actually turns Bobby in to the police out of jealousy. In X-Men: The Last Stand, his relationship with Rogue appears to be deteriorating, strained by their inability to have physical contact and by his close friendship with ": null
    },
    {
        "Kitty Pryde": "Kitty Pryde"
    },
    {
        ". During a battle with Pyro, now working for Magnetos Brotherhood, he achieves the ability to transform into his ice form from the comics. In the original dystopian timeline of  X-Men: Days of Future Past ,  Iceman is more powerful, transforming into ice and travelling on ice slides, but is nevertheless killed while fighting the ": null
    },
    {
        "Sentinels": "Sentinel"
    },
    {
        ". After Kitty and ": null
    },
    {
        "Wolverine": "Wolverine"
    },
    {
        " change the timeline, Iceman is seen once again in a relationship with Rogue at the Xavier Mansion. Bobbys scenes vary in the Days of Future Past known as The Rogue Cut, where he is killed by Sentinels while helping Rogue and Magneto to escape.        In the novelization for X-Men: The Last Stand, Iceman saves Pyro from the destruction of ": null
    },
    {
        "Dark Phoenix": "Dark Phoenix"
    },
    {
        ".       Iceman makes an appearance as a bonus level boss in the 1997  Fantastic Four  game.   Iceman has appeared in various video game adaptations, such as  X-Men: Children of the Atom  and the subsequent  Marvel vs. Capcom 2 . Notably, he is the only character in the game immune to chip damage from beam and fireball projectiles, however ": null
    },
    {
        "War Machines": "War Machine"
    },
    {
        " missiles are able to chip him.   He also has appeared as a playable character in  X-Men Legends , voiced by ": null
    },
    {
        "Darren Scott": "Darren Scott"
    },
    {
        ".  His skills could be improved in either ranged combat or melee combat . He can fly for short distances as his double-jump move allows him to use his ice slides.   Iceman appears as a playable character in  X-Men Legends II: Rise of Apocalypse , voiced by ": null
    },
    {
        "James Arnold Taylor": "James Arnold Taylor"
    },
    {
        ". He has special dialogue with ": null
    },
    {
        "Grizzly": "Grizzly"
    },
    {
        ". His powers include damaging frost attacks, ice fists, and strong melee combat.   Iceman is one of the three playable characters in  X-Men: The Official Game  , voiced by ": null
    },
    {
        "Shawn Ashmore": "Shawn Ashmore"
    },
    {
        " .   Iceman appears in  Marvel: Ultimate Alliance  as a playable character, retaining many of his moves from the Legends games, and voiced again by James Arnold Taylor. His Age of Apocalypse appearance , classic costume , original costume , and Bobby Drake  are alternate costumes for Iceman. In this game, he retains his X-Men Legends abilities, like that of creating ice slides instead of double-jumping. He has special dialogue with ": null
    },
    {
        "Black Widow": "Black Widow"
    },
    {
        ", ": null
    },
    {
        "Namor": "Namor"
    },
    {
        " , ": null
    },
    {
        "Namorita": "Namorita"
    },
    {
        ", ": null
    },
    {
        "Professor X": "Professor X"
    },
    {
        ", ": null
    },
    {
        "Gladiator": "Gladiator"
    },
    {
        ", ": null
    },
    {
        "Henry Pym": "Henry Pym"
    },
    {
        ", and ": null
    },
    {
        "Ymir": "Ymir"
    },
    {
        ". Also, at the beginning of ": null
    },
    {
        "Mephistos": "Mephisto"
    },
    {
        " Realm, he complains to Xavier about being in Mephistos Realm . A simulation disk has Iceman fighting ": null
    },
    {
        "Mysterio": "Mysterio"
    },
    {
        " in ": null
    },
    {
        "Mephistos": "Mephisto"
    },
    {
        " Realm and another one has Storm defending him and Wolverine from ": null
    },
    {
        "Hussar": "Hussar"
    },
    {
        " in Murderworld.    Iceman appears as a playable character in  Marvel: Ultimate Alliance 2 , voiced by ": null
    },
    {
        "Adam Bobrow": "Adam Bobrow"
    },
    {
        ". , www.behindthevoiceactors.com   Amongst many other mutants, Drake is seen going to the new mutant home - Taa II - led by ": null
    },
    {
        "Magneto": "Magneto"
    },
    {
        ", in Magnetos ending in  Marvel vs. Capcom 3 .   Iceman appears in  X-Men: Destiny , voiced by ": null
    },
    {
        "Jason Marsden": "Jason Marsden"
    },
    {
        ".   Iceman is a playable character in  Marvel Super Hero Squad Online . He is voiced by ": null
    },
    {
        "Shawn Ashmore": "Shawn Ashmore"
    },
    {
        ", who reprised his role of Iceman.   Iceman appears as a playable character in the 2012 ": null
    },
    {
        "fighting game": "Fighting Game"
    },
    {
        "  Marvel Avengers: Battle for Earth .   Iceman appears as a playable character in  Lego Marvel Super Heroes .    Iceman is a playable character in the ": null
    },
    {
        "Facebook": "Facebook"
    },
    {
        " game  Marvel: Avengers Alliance .   Iceman is a playable character in  Marvel Contest of Champions , appearing in a fully ice form.   Iceman is a playable character in  Marvel Heroes , voiced by James Arnold Taylor.   Iceman is a playbale character in the match-three mobile and PC game  Marvel Puzzle Quest . He was added to the game in September 2015.    Iceman appears as a playable character in Marvel Powers United VR, voiced by James Arnold Taylor.       Iceman was one of the superheroes portrayed in the 1987 live adaptation of the ": null
    },
    {
        "Spider-Man": "Spider-Man"
    },
    {
        " and ": null
    },
    {
        "Mary Janes": "Mary Jane Watson"
    },
    {
        " wedding performed at": "Spider-Mans Wedding"
    },
    {
        " Shea Stadium": "Shea Stadium"
    },
    {
        ". ": null
    }
]