[
    {
        "   thumb": "Image:Neal-Stephenson-In-The-Beginning.Jpg"
    },
    {
        "     In the Beginning... Was the Command Line is an essay by ": null
    },
    {
        "Neal Stephenson": "Neal Stephenson"
    },
    {
        " which was originally published online in 1999 and later made available in book form . The essay is a commentary on why the proprietary ": null
    },
    {
        "operating systems": "Operating System"
    },
    {
        " business is unlikely to remain profitable in the future because of competition from ": null
    },
    {
        "free software": "Free Software"
    },
    {
        ". It also analyzes the corporate/collective culture of the ": null
    },
    {
        "Microsoft": "Microsoft"
    },
    {
        ", ": null
    },
    {
        "Apple": "Apple Inc."
    },
    {
        ", and ": null
    },
    {
        "free software": "Free Software"
    },
    {
        " communities.         Stephenson explores the ": null
    },
    {
        "GUI": "Graphical User Interface"
    },
    {
        " as a metaphor in terms of the increasing interposition of abstractions between humans and the actual workings of devices  and explains the beauty ": null
    },
    {
        "hackers": "Hacker"
    },
    {
        " feel in good-quality tools. He does this with a ": null
    },
    {
        "car": "Car"
    },
    {
        " analogy. He compares four operating systems, ": null
    },
    {
        "Mac OS": "Classic Mac Os"
    },
    {
        " by ": null
    },
    {
        "Apple Computer": "Apple Computer"
    },
    {
        " to a luxury European car, ": null
    },
    {
        "Windows": "Microsoft Windows"
    },
    {
        " by ": null
    },
    {
        "Microsoft": "Microsoft"
    },
    {
        " to a ": null
    },
    {
        "station wagon": "Station Wagon"
    },
    {
        ", ": null
    },
    {
        "Linux": "Linux"
    },
    {
        " to a free ": null
    },
    {
        "tank": "Tank"
    },
    {
        ", and ": null
    },
    {
        "BeOS": "Beos"
    },
    {
        " to a ": null
    },
    {
        "batmobile": "Batmobile"
    },
    {
        ". Stephenson argues that people continue to buy the station wagon despite free tanks being given away, because people do not want to learn how to operate a tank; they know that the station wagon dealership has a machine shop that they can take their car to when it breaks down. Because of this attitude, Stephenson argues that Microsoft is not really a monopoly, as evidenced by the free availability of other choice OSes, but rather has simply accrued enough ": null
    },
    {
        "mindshare": "Mindshare"
    },
    {
        " among the people to have them coming back. He compares Microsoft to ": null
    },
    {
        "Disney": "Disney"
    },
    {
        ", in that both are selling a vision to their customers, who in turn want to believe in that vision.     Stephenson relays his experience with the ": null
    },
    {
        "Debian bug tracking system": "Debian Bug Tracking System"
    },
    {
        " . He then contrasts it with Microsofts approach. Debian developers responded from around the world within a day. He was completely frustrated with his initial attempt to achieve the same response from Microsoft, but he concedes that his subsequent experience was satisfactory. The difference he notes is that Debian developers are personally accessible and transparently own up to defects in their OS distribution, while Microsoft pretends errors dont exist.         The essay was written before the advent of ": null
    },
    {
        "Mac OS X": "Mac Os X"
    },
    {
        ". A recurring theme is the full power of the command line compared with easier to learn graphical user interfaces which are described as broken mixed metaphors for power users. He then mentions GUIs which allow traditional terminal windows to be used. In a ": null
    },
    {
        "Slashdot": "Slashdot"
    },
    {
        " interview in 2004, in response to the question:     ... have you embraced the new UNIX based MacOS X as the OS you want to use when you Just want to go to Disneyland ?     he replied:       I embraced ": null
    },
    {
        "OS X": "Mac Os X"
    },
    {
        " as soon as it was available and have never looked back. So a lot of In the Beginning...was the Command Line is now obsolete. I keep meaning to update it, but if Im honest with myself, I have to say this is unlikely.             With Neal Stephensons permission, Garrett Birkel responded to In the Beginning...was the Command Line in 2004, bringing it up to date and critically discussing Stephensons argument. ": null
    }
]