[
    {
        "                 The Industrial Revolution, now also known as the First Industrial Revolution, was the transition to new manufacturing processes in Europe and the United States, in the period from about 1760 to sometime between 1820 and 1840. This transition included going from ": null
    },
    {
        "hand production methods": "Craft Production"
    },
    {
        " to ": null
    },
    {
        "machines": "Machine"
    },
    {
        ", new ": null
    },
    {
        "chemical manufacturing": "Chemical Manufacturing"
    },
    {
        " and ": null
    },
    {
        "iron production": "Puddling"
    },
    {
        " processes, the increasing use of ": null
    },
    {
        "steam power": "Steam Power"
    },
    {
        " and ": null
    },
    {
        "water power": "Water Power"
    },
    {
        ", the development of ": null
    },
    {
        "machine tools": "Machine Tool"
    },
    {
        " and the rise of the ": null
    },
    {
        "mechanized": "Mechanization"
    },
    {
        " factory system": "Factory System"
    },
    {
        ". The Industrial Revolution also led to an unprecedented rise in the rate of population growth.     ": null
    },
    {
        "Textiles": "Textile"
    },
    {
        " were the dominant industry of the Industrial Revolution in terms of employment, value of output and ": null
    },
    {
        "capital": "Capital"
    },
    {
        " invested. The ": null
    },
    {
        "textile industry": "Textile Industry"
    },
    {
        " was also the first to use modern production methods.       The Industrial Revolution began in ": null
    },
    {
        "Great Britain": "Kingdom Of Great Britain"
    },
    {
        ", and many of the technological ": null
    },
    {
        "innovations": "Innovation"
    },
    {
        " were of British origin.  E. Anthony Wrigley, Reconsidering the Industrial Revolution: England and Wales. Journal of Interdisciplinary History 49.01 : 9–42. By the mid-18th century Britain was the worlds leading commercial nation,  controlling a global trading empire with ": null
    },
    {
        "colonies": "Territorial Evolution Of The British Empire"
    },
    {
        " in North America and the Caribbean, and with major military and political hegemony on the ": null
    },
    {
        "Indian subcontinent": "Indian Subcontinent"
    },
    {
        ", particularly with the ": null
    },
    {
        "proto-industrialised": "Proto-Industrialization"
    },
    {
        " Mughal Bengal": "Mughal Bengal"
    },
    {
        ", through the activities of the ": null
    },
    {
        "East India Company": "East India Company"
    },
    {
        ".    The development of trade and the rise of business were among the major causes of the Industrial Revolution.       The Industrial Revolution marks a major turning point in history; almost every aspect of daily life was influenced in some way. In particular, average income and population began to exhibit unprecedented sustained growth. Some economists say that the major effect of the Industrial Revolution was that the ": null
    },
    {
        "standard of living": "Standard Of Living"
    },
    {
        " for the general population in the western world began to increase consistently for the first time in history, although others have said that it did not begin to meaningfully improve until the late 19th and 20th centuries.     ": null
    },
    {
        "GDP per capita": "Lists Of Countries By Gdp Per Capita"
    },
    {
        " was broadly stable before the Industrial Revolution and the emergence of the modern ": null
    },
    {
        "capitalist": "Capitalism"
    },
    {
        " economy, while the Industrial Revolution began an era of per-capita ": null
    },
    {
        "economic growth": "Economic Growth"
    },
    {
        " in capitalist economies.  Economic historians are in agreement that the onset of the Industrial Revolution is the most important event in the ": null
    },
    {
        "history of humanity": "History Of The World"
    },
    {
        " since the ": null
    },
    {
        "domestication": "Domestication"
    },
    {
        " of animals and plants.     Although the ": null
    },
    {
        "structural change": "Structural Change"
    },
    {
        " from agriculture to industry is widely associated with the Industrial Revolution, in the United Kingdom it was already almost complete by 1760.      The precise start and end of the Industrial Revolution is still debated among historians, as is the pace of economic and ": null
    },
    {
        "social changes": "Social Change"
    },
    {
        ". ": null
    },
    {
        "Eric Hobsbawm": "Eric Hobsbawm"
    },
    {
        " held that the Industrial Revolution began in Britain in the 1780s and was not fully felt until the 1830s or 1840s, while ": null
    },
    {
        "T. S. Ashton": "T. S. Ashton"
    },
    {
        " held that it occurred roughly between 1760 and 1830. Rapid ": null
    },
    {
        "industrialization": "Industrialization"
    },
    {
        " first began in Britain, starting with mechanized spinning in the 1780s,  with high rates of growth in steam power and iron production occurring after 1800. ": null
    },
    {
        "Mechanized textile production": "Textile Industry"
    },
    {
        " spread from Great Britain to continental Europe and the United States in the early 19th century, with important centres of textiles, iron and coal emerging ": null
    },
    {
        "in Belgium": "Belgium"
    },
    {
        " and the United States and later textiles in France.     An economic recession occurred from the late 1830s to the early 1840s when the adoption of the original innovations of the Industrial Revolution, such as mechanized spinning and weaving, slowed and their markets matured. Innovations developed late in the period, such as the increasing adoption of locomotives, steamboats and steamships, ": null
    },
    {
        "hot blast iron smelting": "Hot Blast"
    },
    {
        " and new technologies, such as the ": null
    },
    {
        "electrical telegraph": "Electrical Telegraph"
    },
    {
        ", widely introduced in the 1840s and 1850s, were not powerful enough to drive high rates of growth. Rapid economic growth began to occur after 1870, springing from a new group of innovations in what has been called the ": null
    },
    {
        "Second Industrial Revolution": "Second Industrial Revolution"
    },
    {
        ". These new innovations included new ": null
    },
    {
        "steel making process": "Bessemer Process"
    },
    {
        " es, ": null
    },
    {
        "mass-production": "Mass-Production"
    },
    {
        ", ": null
    },
    {
        "assembly lines": "Assembly Line"
    },
    {
        ", ": null
    },
    {
        "electrical grid": "Electrical Grid"
    },
    {
        " systems, the large-scale manufacture of machine tools and the use of increasingly advanced machinery in steam-powered factories.              The earliest recorded use of the term Industrial Revolution seems to have been in a letter from 6 July 1799 written by French envoy ": null
    },
    {
        "Louis-Guillaume Otto": "Louis-Guillaume Otto"
    },
    {
        ", announcing that France had entered the race to industrialise. In his 1976 book  Keywords: A Vocabulary of Culture and Society , ": null
    },
    {
        "Raymond Williams": "Raymond Williams"
    },
    {
        " states in the entry for Industry : The idea of a new social order based on major industrial change was clear in ": null
    },
    {
        "Southey": "Robert Southey"
    },
    {
        " and ": null
    },
    {
        "Owen": "Robert Owen"
    },
    {
        ", between 1811 and 1818, and was implicit as early as ": null
    },
    {
        "Blake": "William Blake"
    },
    {
        " in the early 1790s and ": null
    },
    {
        "Wordsworth": "William Wordsworth"
    },
    {
        " at the turn of the century. The term Industrial Revolution applied to technological change was becoming more common by the late 1830s, as in ": null
    },
    {
        "Jérôme-Adolphe Blanquis": "Jérôme-Adolphe Blanqui"
    },
    {
        " description in 1837 of la révolution industrielle. BLANQUI Jérôme-Adolphe, Histoire de léconomie politique en Europe depuis les anciens jusquà nos jours, 1837,  ": null
    },
    {
        "Friedrich Engels": "Friedrich Engels"
    },
    {
        " in  The Condition of the Working Class in England  in 1844 spoke of an industrial revolution, a revolution which at the same time changed the whole of civil society . However, although Engels wrote in the 1840s, his book was not translated into English until the late 1800s, and his expression did not enter everyday language until then. Credit for popularising the term may be given to ": null
    },
    {
        "Arnold Toynbee": "Arnold Toynbee"
    },
    {
        ", whose 1881 lectures gave a detailed account of the term.     Economic historians and authors such as Mendels, Pomeranz and Kridte argue that the ": null
    },
    {
        "proto-industrialization": "Proto-Industrialization"
    },
    {
        " in parts of Europe, ": null
    },
    {
        "Islamic world": "Islamic World"
    },
    {
        ", ": null
    },
    {
        "Mughal India": "Mughal India"
    },
    {
        ", and ": null
    },
    {
        "China": "China"
    },
    {
        " created the social and economic conditions that led to the Industrial Revolution, thus emerging the ": null
    },
    {
        "Great Divergence": "Great Divergence"
    },
    {
        ".        Some historians, such as ": null
    },
    {
        "John Clapham": "John Clapham"
    },
    {
        " and ": null
    },
    {
        "Nicholas Crafts": "Nicholas Crafts"
    },
    {
        ", have argued that the economic and social changes occurred gradually and the term revolution is a misnomer. This is still a subject of debate among some historians.       The commencement of the Industrial Revolution is closely linked to a small number of innovations, beginning in the second half of the 18th century. By the 1830s the following gains had been made in important technologies:   Textiles – mechanised cotton spinning powered by steam or water increased the output of a worker by a factor of around 500. The ": null
    },
    {
        "power loom": "Power Loom"
    },
    {
        " increased the output of a worker by a factor of over 40.  The ": null
    },
    {
        "cotton gin": "Cotton Gin"
    },
    {
        " increased productivity of removing seed from cotton by a factor of 50. Large gains in productivity also occurred in spinning and weaving of wool and linen, but they were not as great as in cotton.    Steam power – the efficiency of ": null
    },
    {
        "steam engines": "Steam Engine"
    },
    {
        " increased so that they used between one-fifth and one-tenth as much fuel. The adaptation of stationary steam engines to rotary motion made them suitable for industrial uses.  The high pressure engine had a high power to weight ratio, making it suitable for transportation. Steam power underwent a rapid expansion after 1800.   Iron making – the substitution of ": null
    },
    {
        "coke": "Coke"
    },
    {
        " for charcoal greatly lowered the fuel cost of ": null
    },
    {
        "pig iron": "Pig Iron"
    },
    {
        " and ": null
    },
    {
        "wrought iron": "Wrought Iron"
    },
    {
        " production.  Using coke also allowed larger blast furnaces,   resulting in ": null
    },
    {
        "economies of scale": "Economies Of Scale"
    },
    {
        ". The steam engine began being used to pump water and to power blast air in the mid 1750s, enabling a large increase in iron production by overcoming the limitation of water power. The cast iron blowing cylinder was first used in 1760. It was later improved by making it double acting, which allowed higher ": null
    },
    {
        "blast furnace": "Blast Furnace"
    },
    {
        " temperatures. The ": null
    },
    {
        "puddling process": "Puddling"
    },
    {
        " produced a structural grade iron at a lower cost than the ": null
    },
    {
        "finery forge": "Finery Forge"
    },
    {
        ".  The ": null
    },
    {
        "rolling mill": "Rolling"
    },
    {
        " was fifteen times faster than hammering wrought iron. ": null
    },
    {
        "Hot blast": "Hot Blast"
    },
    {
        " greatly increased fuel efficiency in iron production in the following decades.   Invention of machine tools – The first ": null
    },
    {
        "machine tools": "Machine Tools"
    },
    {
        " were invented. These included the ": null
    },
    {
        "screw cutting lathe": "Screw Cutting Lathe"
    },
    {
        ", cylinder boring machine and the ": null
    },
    {
        "milling machine": "Milling"
    },
    {
        ". Machine tools made the economical manufacture of ": null
    },
    {
        "precision metal parts": "Interchangeable Parts"
    },
    {
        " possible, although it took several decades to develop effective techniques.                 In 1750 Britain imported 2.5 million pounds of raw cotton, most of which was spun and woven by cottage industry in Lancashire. The work was done by hand in workers homes or occasionally in shops of master weavers. In 1787 raw cotton consumption was 22 million pounds, most of which was cleaned, carded and spun on machines.  The British textile industry used 52 million pounds of cotton in 1800, which increased to 588 million pounds in 1850.      The share of value added by the cotton textile industry in Britain was 2.6% in 1760, 17% in 1801 and 22.4% in 1831. Value added by the British woollen industry was 14.1% in 1801. Cotton factories in Britain numbered approximately 900 in 1797. In 1760 approximately one-third of cotton cloth manufactured in Britain was exported, rising to two-thirds by 1800. In 1781 cotton spun amounted to 5.1 million pounds, which increased to 56 million pounds by 1800. In 1800 less than 0.1% of world cotton cloth was produced on machinery invented in Britain. In 1788 there were 50,000 spindles in Britain, rising to 7 million over the next 30 years.     Wages in ": null
    },
    {
        "Lancashire": "Lancashire"
    },
    {
        ", a core region for cottage industry and later factory spinning and weaving, were about six times those in India in 1770, when overall ": null
    },
    {
        "productivity": "Productivity"
    },
    {
        " in Britain was about three times higher than in India.       Parts of India, China, Central America, South America and the Middle-East have a long history of hand manufacturing ": null
    },
    {
        "cotton": "Cotton"
    },
    {
        " textiles, which became a major industry sometime after 1000 AD. In tropical and subtropical regions where it was grown, most was grown by small farmers alongside their food crops and was spun and woven in households, largely for domestic consumption. In the 15th century China began to require households to pay part of their taxes in cotton cloth. By the 17th century almost all Chinese wore cotton clothing. Almost everywhere cotton cloth could be used as a ": null
    },
    {
        "medium of exchange": "Medium Of Exchange"
    },
    {
        ". In India a significant amount of cotton textiles were manufactured for distant markets, often produced by professional weavers. Some merchants also owned small weaving workshops. India produced a variety of cotton cloth, some of exceptionally fine quality.      Cotton was a difficult raw material for Europe to obtain before it was grown on colonial plantations in the Americas. The early Spanish explorers found Native Americans growing unknown species of excellent quality cotton: sea island cotton  and upland green seeded cotton  Gossypium hirsutum . Sea island cotton grew in tropical areas and on barrier islands of Georgia and South Carolina, but did poorly inland. Sea island cotton began being exported from Barbados in the 1650s. Upland green seeded cotton grew well on inland areas of the southern U.S., but was not economical because of the difficulty of removing seed, a problem solved by the ": null
    },
    {
        "cotton gin": "Cotton Gin"
    },
    {
        ".  A strain of cotton seed brought from Mexico to Natchez, Mississippi in 1806 became the parent genetic material for over 90% of world cotton production today; it produced ": null
    },
    {
        "bolls": "Cotton Boll"
    },
    {
        " that were three to four times faster to pick.            The ": null
    },
    {
        "Age of Discovery": "Age Of Discovery"
    },
    {
        " was followed by a period of ": null
    },
    {
        "colonialism": "Colonialism"
    },
    {
        " beginning around the 16th century. Following the discovery of a trade route to India around southern Africa by the Portuguese, the Dutch established the Verenigde Oostindische Compagnie or ": null
    },
    {
        "Dutch East India Company": "Dutch East India Company"
    },
    {
        ", the worlds first ": null
    },
    {
        "transnational corporation": "Transnational Corporation"
    },
    {
        " and the first ": null
    },
    {
        "multinational enterprise": "Multinational Enterprise"
    },
    {
        " to issue ": null
    },
    {
        "shares": "Share"
    },
    {
        " of ": null
    },
    {
        "stock": "Stock"
    },
    {
        " to the public.  VOC at the ": null
    },
    {
        "National Library of the Netherlands": "National Library Of The Netherlands"
    },
    {
        " The British later founded the ": null
    },
    {
        "East India Company": "East India Company"
    },
    {
        ", along with smaller companies of different nationalities which established trading posts and employed agents to engage in trade throughout the Indian Ocean region and between the Indian Ocean region and North Atlantic Europe. One of the largest segments of this trade was in cotton textiles, which were purchased in India and sold in Southeast Asia, including the Indonesian archipelago, where spices were purchased for sale to Southeast Asia and Europe. By the mid-1760s cloth was over three-quarters of the East India Companys exports. Indian textiles were in demand in North Atlantic region of Europe where previously only wool and linen were available; however, the amount of cotton goods consumed in Western Europe was minor until the early 19th century.          By 1600 Flemish refugees began weaving cotton cloth in English towns where cottage spinning and weaving of wool and linen was well established; however, they were left alone by the ": null
    },
    {
        "guilds": "Guild"
    },
    {
        " who did not consider cotton a threat. Earlier European attempts at cotton spinning and weaving were in 12th-century Italy and 15th-century southern Germany, but these industries eventually ended when the supply of cotton was cut off. The ": null
    },
    {
        "Moors": "Moors"
    },
    {
        " in Spain grew, spun and wove cotton beginning around the 10th century.     British cloth could not compete with Indian cloth because Indias labour cost was approximately one-fifth to one-sixth that of Britains. In 1700 and 1721 the British government passed ": null
    },
    {
        "Calico Acts": "Calico Acts"
    },
    {
        " in order to ": null
    },
    {
        "protect": "Protectionism"
    },
    {
        " the domestic woollen and linen industries from the increasing amounts of cotton fabric imported from India.     The demand for heavier fabric was met by a domestic industry based around ": null
    },
    {
        "Lancashire": "Lancashire"
    },
    {
        " that produced ": null
    },
    {
        "fustian": "Fustian"
    },
    {
        ", a cloth with flax ": null
    },
    {
        "warp": "Warp"
    },
    {
        " and cotton ": null
    },
    {
        "weft": "Weft"
    },
    {
        ". Flax was used for the warp because wheel-spun cotton did not have sufficient strength, but the resulting blend was not as soft as 100% cotton and was more difficult to sew.      On the eve of the Industrial Revolution, spinning and weaving were done in households, for domestic consumption and as a cottage industry under the ": null
    },
    {
        "putting-out system": "Putting-Out System"
    },
    {
        ". Occasionally the work was done in the workshop of a master weaver. Under the putting-out system, home-based workers produced under contract to merchant sellers, who often supplied the raw materials. In the off season the women, typically farmers wives, did the spinning and the men did the weaving. Using the ": null
    },
    {
        "spinning wheel": "Spinning Wheel"
    },
    {
        ", it took anywhere from four to eight spinners to supply one hand loom weaver.         The ": null
    },
    {
        "flying shuttle": "Flying Shuttle"
    },
    {
        ", patented in 1733 by ": null
    },
    {
        "John Kay": "John Kay"
    },
    {
        ", with a number of subsequent improvements including an important one in 1747, doubled the output of a weaver, worsening the imbalance between spinning and weaving. It became widely used around Lancashire after 1760 when Johns son, ": null
    },
    {
        "Robert": "Robert Kay"
    },
    {
        ", invented the drop box, which facilitated changing thread colors.      ": null
    },
    {
        "Lewis Paul": "Lewis Paul"
    },
    {
        " patented the roller ": null
    },
    {
        "spinning frame": "Spinning Frame"
    },
    {
        " and the flyer-and-bobbin system for drawing wool to a more even thickness. The technology was developed with the help of John Wyatt of ": null
    },
    {
        "Birmingham": "Birmingham"
    },
    {
        ". Paul and Wyatt opened a mill in Birmingham which used their new rolling machine powered by a donkey. In 1743 a factory opened in ": null
    },
    {
        "Northampton": "Northampton"
    },
    {
        " with 50 spindles on each of five of Paul and Wyatts machines. This operated until about 1764. A similar mill was built by ": null
    },
    {
        "Daniel Bourn": "Daniel Bourn"
    },
    {
        " in ": null
    },
    {
        "Leominster": "Leominster"
    },
    {
        ", but this burnt down. Both Lewis Paul and Daniel Bourn patented ": null
    },
    {
        "carding": "Carding"
    },
    {
        " machines in 1748. Based on two sets of rollers that travelled at different speeds, it was later used in the first ": null
    },
    {
        "cotton spinning mill": "Cotton Mill"
    },
    {
        ". Lewiss invention was later developed and improved by ": null
    },
    {
        "Richard Arkwright": "Richard Arkwright"
    },
    {
        " in his ": null
    },
    {
        "water frame": "Water Frame"
    },
    {
        " and ": null
    },
    {
        "Samuel Crompton": "Samuel Crompton"
    },
    {
        " in his ": null
    },
    {
        "spinning mule": "Spinning Mule"
    },
    {
        ".      In 1764 in the village of Stanhill, Lancashire, ": null
    },
    {
        "James Hargreaves": "James Hargreaves"
    },
    {
        " invented the ": null
    },
    {
        "spinning jenny": "Spinning Jenny"
    },
    {
        ", which he patented in 1770. It was the first practical spinning frame with multiple spindles. R. Ray Gehani . Management of Technology and Operations . p. 63. John Wiley and Sons, 1998 The jenny worked in a similar manner to the spinning wheel, by first clamping down on the fibres, then by drawing them out, followed by twisting.  It was a simple, wooden framed machine that only cost about £6 for a 40-spindle model in 1792,  and was used mainly by home spinners. The jenny produced a lightly twisted yarn only suitable for ": null
    },
    {
        "weft": "Weft"
    },
    {
        ", not ": null
    },
    {
        "warp": "Warp"
    },
    {
        ".      The ": null
    },
    {
        "spinning frame": "Spinning Frame"
    },
    {
        " or water frame was developed by Richard Arkwright who, along with two partners, patented it in 1769. The design was partly based on a spinning machine built for Thomas High by clockmaker John Kay, who was hired by Arkwright.  For each spindle the water frame used a series of four pairs of rollers, each operating at a successively higher rotating speed, to draw out the fibre, which was then twisted by the spindle. The roller spacing was slightly longer than the fibre length. Too close a spacing caused the fibres to break while too distant a spacing caused uneven thread. The top rollers were leather-covered and loading on the rollers was applied by a weight. The weights kept the twist from backing up before the rollers. The bottom rollers were wood and metal, with fluting along the length. The water frame was able to produce a hard, medium count thread suitable for warp, finally allowing 100% cotton cloth to be made in Britain. A horse powered the first factory to use the spinning frame. Arkwright and his partners used water power at a factory in Cromford, Derbyshire in 1771, giving the invention its name.          ": null
    },
    {
        "Samuel Cromptons": "Samuel Crompton"
    },
    {
        " Spinning Mule": "Spinning Mule"
    },
    {
        " was introduced in 1779. Mule implies a hybrid because it was a combination of the spinning jenny and the water frame, in which the spindles were placed on a carriage, which went through an operational sequence during which the rollers stopped while the carriage moved away from the drawing roller to finish drawing out the fibres as the spindles started rotating.  Cromptons mule was able to produce finer thread than hand spinning and at a lower cost. Mule spun thread was of suitable strength to be used as warp, and finally allowed Britain to produce highly competitive yarn in large quantities.           Realising that the expiration of the Arkwright patent would greatly increase the supply of spun cotton and led to a shortage of weavers, Edmund Cartwright developed a vertical ": null
    },
    {
        "power loom": "Power Loom"
    },
    {
        " which he patented in 1785. In 1776 he patented a two-man operated loom which was more conventional.  Cartwright built two factories; the first burned down and the second was sabotaged by his workers. Cartwrights loom design had several flaws, the most serious being thread breakage. Samuel Horrocks patented a fairly successful loom in 1813. Horocks loom was improved by Richard Roberts in 1822 and these were produced in large numbers by Roberts, Hill & Co.      The demand for cotton presented an opportunity to planters in the Southern United States, who thought upland cotton would be a profitable crop if a better way could be found to remove the seed. ": null
    },
    {
        "Eli Whitney": "Eli Whitney"
    },
    {
        " responded to the challenge by inventing the inexpensive ": null
    },
    {
        "cotton gin": "Cotton Gin"
    },
    {
        ". A man using a cotton gin could remove seed from as much upland cotton in one day as would previously, working at the rate of one pound of cotton per day, have taken a woman two months to process. . Reprinted by McGraw-Hill, New York and London, 1926 ; and by Lindsay Publications, Inc., Bradley, Illinois, .      These advances were capitalised on by ": null
    },
    {
        "entrepreneurs": "Entrepreneur"
    },
    {
        ", of whom the best known is Richard Arkwright. He is credited with a list of inventions, but these were actually developed by such people as ": null
    },
    {
        "Thomas Highs": "Thomas Highs"
    },
    {
        " and ": null
    },
    {
        "John Kay": "John Kay"
    },
    {
        "; Arkwright nurtured the inventors, patented the ideas, financed the initiatives, and protected the machines. He created the ": null
    },
    {
        "cotton mill": "Cotton Mill"
    },
    {
        " which brought the production processes together in a factory, and he developed the use of powerfirst horse power and then ": null
    },
    {
        "water power": "Hydropower"
    },
    {
        "which made cotton manufacture a mechanised industry. Other inventors increased the efficiency of the individual steps of spinning so that the supply of ": null
    },
    {
        "yarn": "Yarn"
    },
    {
        " increased greatly. Before long ": null
    },
    {
        "steam power": "Watt Steam Engine"
    },
    {
        " was applied to drive textile machinery. ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        " acquired the nickname ": null
    },
    {
        "Cottonopolis": "Cottonopolis"
    },
    {
        " during the early 19th century owing to its sprawl of textile factories. G.E. Mingay . The Transformation of Britain, 1830–1939 . p. 25. Routledge, 1986     Although mechanization dramatically decreased the cost of cotton cloth, by the mid-19th century machine-woven cloth still could not equal the quality of hand-woven Indian cloth, in part due to the fineness of thread made possible by the type of cotton used in India, which allowed high thread counts. However, the high productivity of British textile manufacturing allowed coarser grades of British cloth to undersell hand-spun and woven fabric in low-wage India, eventually destroying the industry.       The earliest European attempts at mechanized spinning were with wool; however, wool spinning proved more difficult to mechanize than cotton. Productivity improvement in wool spinning during the Industrial Revolution was significant but was far less than that of cotton.             Arguably the first highly mechanised factory was ": null
    },
    {
        "John Lombes": "John Lombe"
    },
    {
        " water-powered silk mill": "Derby Industrial Museum"
    },
    {
        " at ": null
    },
    {
        "Derby": "Derby"
    },
    {
        ", operational by 1721. Lombe learned silk thread manufacturing by taking a job in Italy and acting as an industrial spy; however, because the Italian silk industry guarded its secrets closely, the state of the industry at that time is unknown. Although Lombes factory was technically successful, the supply of raw silk from Italy was cut off to eliminate competition. In order to promote manufacturing the Crown paid for models of Lombes machinery which were exhibited in the ": null
    },
    {
        "Tower of London": "Tower Of London"
    },
    {
        ".                      Bar iron was the commodity form of iron used as the raw material for making hardware goods such as nails, wire, hinges, horse shoes, wagon tires, chains, etc. and for structural shapes. A small amount of bar iron was converted into steel. ": null
    },
    {
        "Cast iron": "Cast Iron"
    },
    {
        " was used for pots, stoves and other items where its brittleness was tolerable. Most cast iron was refined and converted to bar iron, with substantial losses. Bar iron was also made by the ": null
    },
    {
        "bloomery": "Bloomery"
    },
    {
        " process, which was the predominant iron smelting process until the late 18th century.     In the UK in 1720 there were 20,500 tons of cast iron produced with charcoal and 400 tons with coke. In 1750 charcoal iron production was 24,500 and coke iron was 2,500 tons. In 1788 the production of charcoal cast iron was 14,000 tons while coke iron production was 54,000 tons. In 1806 charcoal cast iron production was 7,800 tons and coke cast iron was 250,000 tons.      In 1750 the UK imported 31,200 tons of bar iron and either refined from cast iron or directly produced 18,800 tons of bar iron using charcoal and 100 tons using coke. In 1796 the UK was making 125,000 tons of bar iron with coke and 6,400 tons with charcoal; imports were 38,000 tons and exports were 24,600 tons. In 1806 the UK did not import bar iron but exported 31,500 tons.        A major change in the iron industries during the era of the Industrial Revolution was the replacement of ": null
    },
    {
        "wood": "Wood"
    },
    {
        " and other bio-fuels with coal. For a given amount of heat, coal required much less labour to mine than cutting wood and converting it to charcoal,  and coal was much more abundant than wood, supplies of which were becoming scarce before the enormous increase in iron production that took place in the late 18th century.   By 1750 ": null
    },
    {
        "coke": "Coke"
    },
    {
        " had generally replaced charcoal in smelting of copper and lead, and was in widespread use in making glass. In the smelting and refining of iron, coal and ": null
    },
    {
        "coke": "Coke"
    },
    {
        " produced inferior iron to that made with charcoal because of the coals sulfur content. Low sulfur coals were known, but they still contained harmful amounts. Conversion of coal to coke only slightly reduces the sulfur content.  A minority of coals are coking.     Another factor limiting the iron industry before the Industrial Revolution was the scarcity of water power to power blast bellows. This limitation was overcome by the steam engine.     Use of coal in iron ": null
    },
    {
        "smelting": "Smelting"
    },
    {
        " started somewhat before the Industrial Revolution, based on innovations by Sir ": null
    },
    {
        "Clement Clerke": "Clement Clerke"
    },
    {
        " and others from 1678, using coal ": null
    },
    {
        "reverberatory furnaces": "Reverberatory Furnace"
    },
    {
        " known as cupolas. These were operated by the flames playing on the ": null
    },
    {
        "ore": "Ore"
    },
    {
        " and charcoal or ": null
    },
    {
        "coke": "Coke"
    },
    {
        " mixture, ": null
    },
    {
        "reducing": "Redox"
    },
    {
        " the ": null
    },
    {
        "oxide": "Oxide"
    },
    {
        " to metal. This has the advantage that impurities in the coal do not migrate into the metal. This technology was applied to ": null
    },
    {
        "lead": "Lead"
    },
    {
        " from 1678 and to ": null
    },
    {
        "copper": "Copper"
    },
    {
        " from 1687. It was also applied to iron foundry work in the 1690s, but in this case the reverberatory furnace was known as an air furnace.      By 1709 ": null
    },
    {
        "Abraham Darby": "Abraham Darby I"
    },
    {
        " made progress using coke to fuel his ": null
    },
    {
        "blast furnaces": "Blast Furnace"
    },
    {
        " at ": null
    },
    {
        "Coalbrookdale": "Coalbrookdale"
    },
    {
        ".  However, the coke ": null
    },
    {
        "pig iron": "Pig Iron"
    },
    {
        " he made was not suitable for making wrought iron and was used mostly for the production of ": null
    },
    {
        "cast iron": "Cast Iron"
    },
    {
        " goods, such as pots and kettles. He had the advantage over his rivals in that his pots, cast by his patented process, were thinner and cheaper than theirs.     Coke pig iron was hardly used to produce ": null
    },
    {
        "wrought iron": "Wrought Iron"
    },
    {
        " until 1755–56, when Darbys son ": null
    },
    {
        "Abraham Darby II": "Abraham Darby Ii"
    },
    {
        " built furnaces at ": null
    },
    {
        "Horsehay": "Horsehay"
    },
    {
        " and ": null
    },
    {
        "Ketley": "Ketley"
    },
    {
        " where low sulfur coal was available . These new furnaces were equipped with water-powered bellows, the water being pumped by ": null
    },
    {
        "Newcomen steam engines": "Newcomen Atmospheric Engine"
    },
    {
        ". The Newcomen engines were not attached directly to the blowing cylinders because the engines alone could not produce a steady air blast. Abraham Darby III installed similar steam-pumped, water-powered blowing cylinders at the Dale Company when he took control in 1768. The Dale Company used several Newcomen engines to drain its mines and made parts for engines which it sold throughout the country.      Steam engines made the use of higher-pressure and volume blast practical; however, the leather used in bellows was expensive to replace. In 1757, iron master ": null
    },
    {
        "John Wilkinson": "John Wilkinson"
    },
    {
        " patented a hydraulic powered ": null
    },
    {
        "blowing engine": "Blowing Engine"
    },
    {
        " for blast furnaces.    Based on the works of Joseph Needham The blowing cylinder for blast furnaces was introduced in 1760 and the first blowing cylinder made of cast iron is believed to be the one used at Carrington in 1768 that was designed by ": null
    },
    {
        "John Smeaton": "John Smeaton"
    },
    {
        ".  Cast iron cylinders for use with a piston were difficult to manufacture; the cylinders had to be free of holes and had to be machined smooth and straight to remove any warping. ": null
    },
    {
        "James Watt": "James Watt"
    },
    {
        " had great difficulty trying to have a cylinder made for his first steam engine. In 1774 John Wilkinson, who built a cast iron blowing cylinder for his iron works, invented a precision boring machine for boring cylinders. After Wilkinson bored the first successful cylinder for a ": null
    },
    {
        "Boulton and Watt": "Boulton And Watt"
    },
    {
        " steam engine in 1776, he was given an exclusive contract for providing cylinders. Author Simon Winchester dates the start of the Industrial Revolution to May 4, 1776, the day that John Wilkinson presented James Watt with his precision-made cylinder. . CNN.com After Watt developed a rotary steam engine in 1782, they were widely applied to blowing, hammering, rolling and slitting.      The solutions to the sulfur problem were the addition of sufficient limestone to the furnace to force sulfur into the slag and the use of low sulfur coal. Use of lime or limestone required higher furnace temperatures to form a free-flowing slag. The increased furnace temperature made possible by improved blowing also increased the capacity of blast furnaces and allowed for increased furnace height.  In addition to lower cost and greater availability, coke had other important advantages over charcoal in that it was harder and made the column of materials flowing down the blast furnace more porous and did not crush in the much taller furnaces of the late 19th century.       As cast iron became cheaper and widely available, it began being a structural material for bridges and buildings. A famous early example was the ": null
    },
    {
        "Iron Bridge": "The Iron Bridge"
    },
    {
        " built in 1778 with cast iron produced by ": null
    },
    {
        "Abraham Darby III": "Abraham Darby Iii"
    },
    {
        ". However, most cast iron was converted to ": null
    },
    {
        "wrought iron": "Wrought Iron"
    },
    {
        ".     Europe relied on the ": null
    },
    {
        "bloomery": "Bloomery"
    },
    {
        " for most of its wrought iron until the large scale production of cast iron. Conversion of cast iron was done in a ": null
    },
    {
        "finery forge": "Finery Forge"
    },
    {
        ", as it long had been. An improved refining process known as ": null
    },
    {
        "potting and stamping": "Potting And Stamping"
    },
    {
        " was developed, but this was superseded by ": null
    },
    {
        "Henry Corts": "Henry Cort"
    },
    {
        " puddling": "Puddling Furnace"
    },
    {
        " process. Cort developed two significant iron manufacturing processes: ": null
    },
    {
        "rolling": "Rolling"
    },
    {
        " in 1783 and ": null
    },
    {
        "puddling": "Puddling"
    },
    {
        " in 1784.  Puddling produced a structural grade iron at a relatively low cost.     ": null
    },
    {
        "Puddling": "Puddling"
    },
    {
        " was a means of decarburizing molten pig iron by slow oxidation in a reverberatory furnace by manually stirring it with a long rod. The decarburized iron, having a higher melting point than cast iron, was raked into globs by the puddler. When the glob was large enough, the puddler would remove it. Puddling was backbreaking and extremely hot work. Few puddlers lived to be 40.  Because puddling was done in a reverberatory furnace, coal or coke could be used as fuel. The puddling process continued to be used until the late 19th century when iron was being displaced by steel. Because puddling required human skill in sensing the iron globs, it was never successfully mechanised. Rolling was an important part of the puddling process because the grooved rollers expelled most of the molten slag and consolidated the mass of hot wrought iron. Rolling was 15 times faster at this than a ": null
    },
    {
        "trip hammer": "Trip Hammer"
    },
    {
        ". A different use of rolling, which was done at lower temperatures than that for expelling slag, was in the production of iron sheets, and later structural shapes such as beams, angles and rails.     The puddling process was improved in 1818 by Baldwyn Rogers, who replaced some of the sand lining on the reverberatory furnace bottom with iron oxide.  In 1838 ": null
    },
    {
        "John Hall": "Joseph Hall"
    },
    {
        " patented the use of roasted tap cinder for the furnace bottom, greatly reducing the loss of iron through increased slag caused by a sand lined bottom. The tap cinder also tied up some phosphorus, but this was not understood at the time.  Halls process also used iron scale or rust, which reacted with carbon in the molten iron. Halls process, called wet puddling, reduced losses of iron with the slag from almost 50% to around 8%.      Puddling became widely used after 1800. Up to that time British iron manufacturers had used considerable amounts of iron imported from Sweden and Russia to supplement domestic supplies. Because of the increased British production, imports began to decline in 1785 and by the 1790s Britain eliminated imports and became a net exporter of bar iron.     ": null
    },
    {
        "Hot blast": "Hot Blast"
    },
    {
        ", patented by ": null
    },
    {
        "James Beaumont Neilson": "James Beaumont Neilson"
    },
    {
        " in 1828, was the most important development of the 19th century for saving energy in making pig iron. By using preheated combustion air, the amount of fuel to make a unit of pig iron was reduced at first by between one-third using coke or two-thirds using coal;  however, the efficiency gains continued as the technology improved.  Hot blast also raised the operating temperature of furnaces, increasing their capacity. Using less coal or coke meant introducing fewer impurities into the pig iron. This meant that lower quality coal or ": null
    },
    {
        "anthracite": "Anthracite"
    },
    {
        " could be used in areas where coking coal was unavailable or too expensive;  however, by the end of the 19th century transportation costs fell considerably.     Shortly before the Industrial Revolution an improvement was made in the production of ": null
    },
    {
        "steel": "Steel"
    },
    {
        ", which was an expensive commodity and used only where iron would not do, such as for cutting edge tools and for springs. ": null
    },
    {
        "Benjamin Huntsman": "Benjamin Huntsman"
    },
    {
        " developed his ": null
    },
    {
        "crucible steel": "Crucible Steel"
    },
    {
        " technique in the 1740s. The raw material for this was blister steel, made by the ": null
    },
    {
        "cementation process": "Cementation Process"
    },
    {
        ".     The supply of cheaper iron and steel aided a number of industries, such as those making nails, hinges, wire and other hardware items. The development of ": null
    },
    {
        "machine tools": "Machine Tool"
    },
    {
        " allowed better working of iron, causing it to be increasingly used in the rapidly growing machinery and engine industries.               The development of the ": null
    },
    {
        "stationary steam engine": "Stationary Steam Engine"
    },
    {
        " was an important element of the Industrial Revolution; however, during the early period of the Industrial Revolution, most industrial power was supplied by water and wind. In Britain by 1800 an estimated 10,000 horsepower was being supplied by steam. By 1815 steam power had grown to 210,000  hp.      The first commercially successful industrial use of steam power was due to ": null
    },
    {
        "Thomas Savery": "Thomas Savery"
    },
    {
        " in 1698. He constructed and patented in London a low-lift combined vacuum and pressure water pump, that generated about one ": null
    },
    {
        "horsepower": "Horsepower"
    },
    {
        " and was used in numerous water works and in a few mines . Saverys pump was economical in small horsepower ranges, but was prone to boiler explosions in larger sizes. Savery pumps continued to be produced until the late 18th century.     The first successful piston steam engine was introduced by ": null
    },
    {
        "Thomas Newcomen": "Thomas Newcomen"
    },
    {
        " before 1712. A number of Newcomen engines were installed in Britain for draining hitherto unworkable deep mines, with the engine on the surface; these were large machines, requiring a significant amount of capital to build, and produced upwards of . They were also used to power municipal water supply pumps. They were extremely inefficient by modern standards, but when located where coal was cheap at pit heads, opened up a great expansion in coal mining by allowing mines to go deeper. Despite their disadvantages, Newcomen engines were reliable and easy to maintain and continued to be used in the coalfields until the early decades of the 19th century. By 1729, when Newcomen died, his engines had spread to Hungary in 1722, Germany, Austria, and Sweden. A total of 110 are known to have been built by 1733 when the joint patent expired, of which 14 were abroad. In the 1770s the engineer ": null
    },
    {
        "John Smeaton": "John Smeaton"
    },
    {
        " built some very large examples and introduced a number of improvements. A total of 1,454 engines had been built by 1800. L. T. C. Rolt and J. S. Allen, The Steam Engine of Thomas Newcomen . p. 145.        A fundamental change in working principles was brought about by ": null
    },
    {
        "Scotsman": "Scottish People"
    },
    {
        " James Watt": "James Watt"
    },
    {
        ". With financial support from his business partner ": null
    },
    {
        "Englishman": "English People"
    },
    {
        " Matthew Boulton": "Matthew Boulton"
    },
    {
        ", he had succeeded by 1778 in perfecting his ": null
    },
    {
        "steam engine": "Watt Steam Engine"
    },
    {
        ", which incorporated a series of radical improvements, notably the closing off of the upper part of the cylinder, thereby making the low-pressure steam drive the top of the piston instead of the atmosphere, use of a steam jacket and the celebrated separate steam condenser chamber. The separate condenser did away with the cooling water that had been injected directly into the cylinder, which cooled the cylinder and wasted steam. Likewise, the steam jacket kept steam from condensing in the cylinder, also improving efficiency. These improvements increased engine efficiency so that Boulton and Watts engines used only 20–25% as much coal per horsepower-hour as Newcomens. Boulton and Watt opened the ": null
    },
    {
        "Soho Foundry": "Soho Foundry"
    },
    {
        " for the manufacture of such engines in 1795.     By 1783 the Watt steam engine had been fully developed into a ": null
    },
    {
        "double-acting": "Single- And Double-Acting Cylinders"
    },
    {
        " rotative type, which meant that it could be used to directly drive the rotary machinery of a factory or mill. Both of Watts basic engine types were commercially very successful, and by 1800, the firm ": null
    },
    {
        "Boulton & Watt": "Boulton And Watt"
    },
    {
        " had constructed 496 engines, with 164 driving reciprocating pumps, 24 serving ": null
    },
    {
        "blast furnaces": "Blast Furnace"
    },
    {
        ", and 308 powering mill machinery; most of the engines generated from .     Until about 1800 the most common pattern of steam engine was the ": null
    },
    {
        "beam engine": "Beam Engine"
    },
    {
        ", built as an integral part of a stone or brick engine-house, but soon various patterns of self-contained rotative engines were developed, such as the ": null
    },
    {
        "table engine": "Table Engine"
    },
    {
        ". Around the start of the 19th century, at which time the Boulton and Watt patent expired, the Cornish engineer ": null
    },
    {
        "Richard Trevithick": "Richard Trevithick"
    },
    {
        " and the American ": null
    },
    {
        "Oliver Evans": "Oliver Evans"
    },
    {
        " began to construct higher-pressure non-condensing steam engines, exhausting against the atmosphere. High pressure yielded an engine and boiler compact enough to be used on mobile road and rail ": null
    },
    {
        "locomotives": "Locomotive"
    },
    {
        " and ": null
    },
    {
        "steam boats": "Steamboat"
    },
    {
        ".     The development of ": null
    },
    {
        "machine tools": "Machine Tool"
    },
    {
        ", such as the engine ": null
    },
    {
        "lathe": "Lathe"
    },
    {
        ", ": null
    },
    {
        "planing": "Planer"
    },
    {
        ", milling and shaping machines powered by these engines, enabled all the metal parts of the engines to be easily and accurately cut and in turn made it possible to build larger and more powerful engines.     Small industrial power requirements continued to be provided by animal and human muscle until widespread ": null
    },
    {
        "electrification": "Electrification"
    },
    {
        " in the early 20th century. These included ": null
    },
    {
        "crank": "Crank"
    },
    {
        "-powered, ": null
    },
    {
        "treadle": "Treadle"
    },
    {
        "-powered and horse-powered workshop and light industrial machinery.                      Pre-industrial machinery was built by various craftsmen": null
    },
    {
        "millwrights": "Millwright"
    },
    {
        " built water and windmills, ": null
    },
    {
        "carpenters": "Carpenter"
    },
    {
        " made wooden framing, and smiths and turners made metal parts. Wooden components had the disadvantage of changing dimensions with temperature and humidity, and the various joints tended to rack over time. As the Industrial Revolution progressed, machines with metal parts and frames became more common. Other important uses of metal parts were in firearms and threaded fasteners, such as machine screws, bolts and nuts. There was also the need for precision in making parts. Precision would allow better working machinery, interchangeability of parts and standardization of threaded fasteners.     The demand for metal parts led to the development of several ": null
    },
    {
        "machine tools": "Machine Tool"
    },
    {
        ". They have their origins in the tools developed in the 18th century by makers of clocks and watches and scientific instrument makers to enable them to batch-produce small mechanisms.     Before the advent of machine tools, metal was worked manually using the basic hand tools of hammers, files, scrapers, saws and chisels. Consequently, the use of metal machine parts was kept to a minimum. Hand methods of production were very laborious and costly and precision was difficult to achieve.     The first large precision machine tool was the cylinder ": null
    },
    {
        "boring machine": "Boring"
    },
    {
        " invented by ": null
    },
    {
        "John Wilkinson": "John Wilkinson"
    },
    {
        " in 1774. It used for boring the large-diameter cylinders on early steam engines. Wilkinsons boring machine differed from earlier ": null
    },
    {
        "cantilever": "Cantilever"
    },
    {
        "ed machines used for boring cannon in that the cutting tool was mounted on a beam that ran through the cylinder being bored and was supported outside on both ends.     The ": null
    },
    {
        "planing machine": "Planer"
    },
    {
        ", the ": null
    },
    {
        "milling machine": "Milling"
    },
    {
        " and the ": null
    },
    {
        "shaping machine": "Shaper"
    },
    {
        " were developed in the early decades of the 19th century. Although the milling machine was invented at this time, it was not developed as a serious workshop tool until somewhat later in the 19th century.     ": null
    },
    {
        "Henry Maudslay": "Henry Maudslay"
    },
    {
        ", who trained a school of machine tool makers early in the 19th century, was a mechanic with superior ability who had been employed at the ": null
    },
    {
        "Royal Arsenal": "Royal Arsenal"
    },
    {
        ", ": null
    },
    {
        "Woolwich": "Woolwich"
    },
    {
        ". He worked as an apprentice in the Royal Gun Foundry of ": null
    },
    {
        "Jan Verbruggen": "Jan Verbruggen"
    },
    {
        ". In 1774 ": null
    },
    {
        "Jan Verbruggen": "Jan Verbruggen"
    },
    {
        " had installed a ": null
    },
    {
        "horizontal boring machine": "Horizontal Boring Machine"
    },
    {
        " in Woolwich which was the first industrial size ": null
    },
    {
        "Lathe": "Lathe"
    },
    {
        " in the UK. Maudslay was hired away by ": null
    },
    {
        "Joseph Bramah": "Joseph Bramah"
    },
    {
        " for the production of high-security metal locks that required precision craftsmanship. Bramah patented a lathe that had similarities to the slide rest lathe. Maudslay perfected the slide rest lathe, which could cut machine screws of different thread pitches by using changeable gears between the spindle and the lead screw. Before its invention screws could not be cut to any precision using various earlier lathe designs, some of which copied from a template.  The slide rest lathe was called one of historys most important inventions. Although it was not entirely Maudslays idea, he was the first person to build a functional lathe using a combination of known innovations of the lead screw, slide rest and change gears.      Maudslay left Bramahs employment and set up his own shop. He was engaged to build the machinery for making ships pulley blocks for the ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        " in the ": null
    },
    {
        "Portsmouth Block Mills": "Portsmouth Block Mills"
    },
    {
        ". These machines were all-metal and were the first machines for ": null
    },
    {
        "mass production": "Mass Production"
    },
    {
        " and making components with a degree of ": null
    },
    {
        "interchangeability": "Interchangeable Parts"
    },
    {
        ". The lessons Maudslay learned about the need for stability and precision he adapted to the development of machine tools, and in his workshops he trained a generation of men to build on his work, such as ": null
    },
    {
        "Richard Roberts": "Richard Roberts"
    },
    {
        ", ": null
    },
    {
        "Joseph Clement": "Joseph Clement"
    },
    {
        " and ": null
    },
    {
        "Joseph Whitworth": "Joseph Whitworth"
    },
    {
        ".     ": null
    },
    {
        "James Fox": "James Fox"
    },
    {
        " of ": null
    },
    {
        "Derby": "Derby"
    },
    {
        " had a healthy export trade in machine tools for the first third of the century, as did ": null
    },
    {
        "Matthew Murray": "Matthew Murray"
    },
    {
        " of Leeds. Roberts was a maker of high-quality machine tools and a pioneer of the use of jigs and gauges for precision workshop measurement.     The effect of machine tools during the Industrial Revolution was not that great because other than firearms, threaded fasteners and a few other industries there were few mass-produced metal parts. The techniques to make mass-produced metal parts made with sufficient precision to be ": null
    },
    {
        "interchangeable": "Interchangeable Parts"
    },
    {
        " is largely attributed to a program of the U.S. Department of War which perfected ": null
    },
    {
        "interchangeable parts": "Interchangeable Parts"
    },
    {
        " for firearms in the early 19th century.      In the half century following the invention of the fundamental machine tools the ": null
    },
    {
        "machine industry": "Machine Industry"
    },
    {
        " became the largest industrial sector of the U.S. economy, by value added. Economics 323–2: Economic History of the United States Since 1865        The large-scale production of ": null
    },
    {
        "chemicals": "Chemical Substance"
    },
    {
        " was an important development during the Industrial Revolution. The first of these was the production of ": null
    },
    {
        "sulphuric acid": "Sulfuric Acid"
    },
    {
        " by the ": null
    },
    {
        "lead chamber process": "Lead Chamber Process"
    },
    {
        " invented by the Englishman ": null
    },
    {
        "John Roebuck": "John Roebuck"
    },
    {
        "  in 1746. He was able to greatly increase the scale of the manufacture by replacing the relatively expensive glass vessels formerly used with larger, less expensive chambers made of ": null
    },
    {
        "rivet": "Rivet"
    },
    {
        "ed sheets of ": null
    },
    {
        "lead": "Lead"
    },
    {
        ". Instead of making a small amount each time, he was able to make around  in each of the chambers, at least a tenfold increase.     The production of an ": null
    },
    {
        "alkali": "Alkali"
    },
    {
        " on a large scale became an important goal as well, and ": null
    },
    {
        "Nicolas Leblanc": "Nicolas Leblanc"
    },
    {
        " succeeded in 1791 in introducing a method for the production of ": null
    },
    {
        "sodium carbonate": "Sodium Carbonate"
    },
    {
        ". The ": null
    },
    {
        "Leblanc process": "Leblanc Process"
    },
    {
        " was a reaction of sulfuric acid with sodium chloride to give sodium sulfate and ": null
    },
    {
        "hydrochloric acid": "Hydrochloric Acid"
    },
    {
        ". The ": null
    },
    {
        "sodium sulfate": "Sodium Sulfate"
    },
    {
        " was heated with ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        "  and coal to give a mixture of sodium carbonate and ": null
    },
    {
        "calcium sulfide": "Calcium Sulfide"
    },
    {
        ". Adding water separated the soluble sodium carbonate from the calcium sulfide. The process produced a large amount of pollution . Nonetheless, this synthetic ": null
    },
    {
        "soda ash": "Sodium Carbonate"
    },
    {
        " proved economical compared to that from burning specific plants  or from ": null
    },
    {
        "kelp": "Kelp"
    },
    {
        ", which were the previously dominant sources of soda ash, and also to ": null
    },
    {
        "potash": "Potash"
    },
    {
        "  produced from hardwood ashes.     These two chemicals were very important because they enabled the introduction of a host of other inventions, replacing many small-scale operations with more cost-effective and controllable processes. Sodium carbonate had many uses in the glass, textile, soap, and ": null
    },
    {
        "paper": "Paper"
    },
    {
        " industries. Early uses for sulfuric acid included pickling iron and steel, and for ": null
    },
    {
        "bleach": "Bleach"
    },
    {
        "ing cloth.     The development of bleaching powder  by Scottish chemist ": null
    },
    {
        "Charles Tennant": "Charles Tennant"
    },
    {
        " in about 1800, based on the discoveries of French chemist ": null
    },
    {
        "Claude Louis Berthollet": "Claude Louis Berthollet"
    },
    {
        ", revolutionised the bleaching processes in the textile industry by dramatically reducing the time required for the traditional process then in use, which required repeated exposure to the sun in bleach fields after soaking the textiles with alkali or sour milk. Tennants factory at St Rollox, North ": null
    },
    {
        "Glasgow": "Glasgow"
    },
    {
        ", became the largest chemical plant in the world.     After 1860 the focus on chemical innovation was in ": null
    },
    {
        "dye": "Dye"
    },
    {
        "stuffs, and Germany took world leadership, building a strong chemical industry. Lion Hirth, State, Cartels and Growth: The German Chemical Industry p. 20 Aspiring chemists flocked to German universities in the 1860–1914 era to learn the latest techniques. British scientists by contrast, lacked research universities and did not train advanced students; instead, the practice was to hire German-trained chemists. Johann P. Murmann, Knowledge and competitive advantage:   the co-evolution of firms, technology, and national institutions  pp.  53–54          In 1824 ": null
    },
    {
        "Joseph Aspdin": "Joseph Aspdin"
    },
    {
        ", a British ": null
    },
    {
        "bricklayer": "Bricklayer"
    },
    {
        " turned builder, patented a chemical process for making ": null
    },
    {
        "portland cement": "Portland Cement"
    },
    {
        " which was an important advance in the building trades. This process involves ": null
    },
    {
        "sintering": "Sintering"
    },
    {
        " a mixture of ": null
    },
    {
        "clay": "Clay"
    },
    {
        " and ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        " to about , then ": null
    },
    {
        "grinding": "Grinding"
    },
    {
        " it into a fine powder which is then mixed with water, sand and ": null
    },
    {
        "gravel": "Gravel"
    },
    {
        " to produce ": null
    },
    {
        "concrete": "Concrete"
    },
    {
        ". Portland cement was used by the famous English engineer ": null
    },
    {
        "Marc Isambard Brunel": "Marc Isambard Brunel"
    },
    {
        " several years later when constructing the ": null
    },
    {
        "Thames Tunnel": "Thames Tunnel"
    },
    {
        ". Cement was used on a large scale in the construction of the ": null
    },
    {
        "London sewerage system": "London Sewerage System"
    },
    {
        " a generation later.             Another major industry of the later Industrial Revolution was ": null
    },
    {
        "gas lighting": "Gas Lighting"
    },
    {
        ". Though others made a similar innovation elsewhere, the large-scale introduction of this was the work of ": null
    },
    {
        "William Murdoch": "William Murdoch"
    },
    {
        ", an employee of Boulton & Watt, the ": null
    },
    {
        "Birmingham": "Birmingham"
    },
    {
        " steam engine": "Watt Steam Engine"
    },
    {
        " pioneers. The process consisted of the large-scale gasification of coal in furnaces, the purification of the gas , and its storage and distribution. The first gas lighting utilities were established in London between 1812 and 1820. They soon became one of the major consumers of coal in the UK. Gas lighting affected social and industrial organisation because it allowed factories and stores to remain open longer than with tallow candles or oil. Its introduction allowed nightlife to flourish in cities and towns as interiors and streets could be lighted on a larger scale than before.                A new method of producing glass, known as the ": null
    },
    {
        "cylinder process": "Cylinder Blown Sheet Glass"
    },
    {
        ", was developed in Europe during the early 19th century. In 1832 this process was used by the ": null
    },
    {
        "Chance Brothers": "Chance Brothers"
    },
    {
        " to create sheet glass. They became the leading producers of window and plate glass. This advancement allowed for larger panes of glass to be created without interruption, thus freeing up the space planning in interiors as well as the fenestration of buildings. ": null
    },
    {
        "The Crystal Palace": "The Crystal Palace"
    },
    {
        " is the supreme example of the use of sheet glass in a new and innovative structure.          A machine for making a continuous sheet of paper on a loop of wire fabric was patented in 1798 by Nicholas Louis Robert who worked for ": null
    },
    {
        "Saint-Léger Didot": "Saint-Léger Didot"
    },
    {
        " family in France. The paper machine is known as a Fourdrinier after the financiers, brothers Sealy and ": null
    },
    {
        "Henry Fourdrinier": "Henry Fourdrinier"
    },
    {
        ", who were ": null
    },
    {
        "stationers": "Stationers"
    },
    {
        " in London. Although greatly improved and with many variations, the Fourdriner machine is the predominant means of paper production today.     The method of ": null
    },
    {
        "continuous production": "Continuous Production"
    },
    {
        " demonstrated by the paper machine influenced the development of continuous rolling of iron and later steel and other ": null
    },
    {
        "continuous production": "Continuous Production"
    },
    {
        " processes.           The ": null
    },
    {
        "British Agricultural Revolution": "British Agricultural Revolution"
    },
    {
        " is considered one of the causes of the Industrial Revolution because improved agricultural productivity freed up workers to work in other sectors of the economy.      However, per-capita food supply in Europe was stagnant or declining and did not improve in some parts of Europe until the late 18th century.      Industrial technologies that affected farming included the ": null
    },
    {
        "seed drill": "Seed Drill"
    },
    {
        ", the ": null
    },
    {
        "Dutch plough": "British Agricultural Revolutionthe Dutch And Rotherham Swing  Plough"
    },
    {
        ", which contained iron parts, and the threshing machine.     The English lawyer ": null
    },
    {
        "Jethro Tull": "Jethro Tull"
    },
    {
        " invented an improved seed drill in 1701. It was a mechanical seeder which distributed seeds evenly across a plot of land and planted them at the correct depth. This was important because the yield of seeds harvested to seeds planted at that time was around four or five. Tulls seed drill was very expensive and not very reliable and therefore did not have much of an effect. Good quality seed drills were not produced until the mid 18th century.      Joseph Foljambes Rotherham plough  of 1730 was the first commercially successful iron plough.     The ": null
    },
    {
        "threshing machine": "Threshing Machine"
    },
    {
        ", invented by the Scottish engineer ": null
    },
    {
        "Andrew Meikle": "Andrew Meikle"
    },
    {
        " in 1784, displaced hand threshing with a ": null
    },
    {
        "flail": "Flail"
    },
    {
        ", a laborious job that took about one-quarter of agricultural labour.   It took several decades to diffuse      and was the final straw for many farm labourers, who faced near starvation, leading to the 1830 agricultural rebellion of the ": null
    },
    {
        "Swing Riots": "Swing Riots"
    },
    {
        ".     ": null
    },
    {
        "Machine tools": "Machine Tools"
    },
    {
        " and metalworking techniques developed during the Industrial Revolution eventually resulted in precision manufacturing techniques in the late 19th century for mass-producing agricultural equipment, such as reapers, binders and combine harvesters.          ": null
    },
    {
        "Coal mining": "History Of Coal Mining"
    },
    {
        " in Britain, particularly in ": null
    },
    {
        "South Wales": "South Wales"
    },
    {
        ", started early. Before the steam engine, ": null
    },
    {
        "pits": "Open-Pit Mining"
    },
    {
        " were often shallow ": null
    },
    {
        "bell pits": "Bell Pit"
    },
    {
        " following a seam of coal along the surface, which were abandoned as the coal was extracted. In other cases, if the geology was favourable, the coal was mined by means of an ": null
    },
    {
        "adit": "Adit"
    },
    {
        " or ": null
    },
    {
        "drift mine": "Drift Mining"
    },
    {
        " driven into the side of a hill. ": null
    },
    {
        "Shaft mining": "Shaft Mining"
    },
    {
        " was done in some areas, but the limiting factor was the problem of removing water. It could be done by hauling buckets of water up the shaft or to a ": null
    },
    {
        "sough": "Sough"
    },
    {
        " . In either case, the water had to be discharged into a stream or ditch at a level where it could flow away by gravity. The introduction of the steam pump by ": null
    },
    {
        "Thomas Savery": "Thomas Savery"
    },
    {
        " in 1698 and the ": null
    },
    {
        "Newcomen steam engine": "Newcomen Steam Engine"
    },
    {
        " in 1712 greatly facilitated the removal of water and enabled shafts to be made deeper, enabling more coal to be extracted. These were developments that had begun before the Industrial Revolution, but the adoption of ": null
    },
    {
        "John Smeatons": "John Smeaton"
    },
    {
        " improvements to the Newcomen engine followed by James Watts more efficient steam engines from the 1770s reduced the fuel costs of engines, making mines more profitable. The ": null
    },
    {
        "Cornish engine": "Cornish Engine"
    },
    {
        ", developed in the 1810s, was much more efficient than the ": null
    },
    {
        "Watt steam engine": "Watt Steam Engine"
    },
    {
        ".     Coal mining was very dangerous owing to the presence of ": null
    },
    {
        "firedamp": "Firedamp"
    },
    {
        " in many coal seams. Some degree of safety was provided by the ": null
    },
    {
        "safety lamp": "Safety Lamp"
    },
    {
        " which was invented in 1816 by Sir ": null
    },
    {
        "Humphry Davy": "Humphry Davy"
    },
    {
        " and independently by ": null
    },
    {
        "George Stephenson": "George Stephenson"
    },
    {
        ". However, the lamps proved a false dawn because they became unsafe very quickly and provided a weak light. Firedamp explosions continued, often setting off ": null
    },
    {
        "coal dust": "Coal Dust"
    },
    {
        "explosions": "Explosion"
    },
    {
        ", so casualties grew during the entire 19th century. Conditions of work were very poor, with a high casualty rate from rock falls.               At the beginning of the Industrial Revolution, inland transport was by navigable rivers and roads, with coastal vessels employed to move heavy goods by sea. ": null
    },
    {
        "Wagonways": "Wagonway"
    },
    {
        " were used for conveying coal to rivers for further shipment, but canals had not yet been widely constructed. Animals supplied all of the motive power on land, with sails providing the motive power on the sea. The first horse railways were introduced toward the end of the 18th century, with steam locomotives being introduced in the early decades of the 19th century. Improving sailing technologies boosted average sailing speed 50% between 1750 and 1830.      The Industrial Revolution improved Britains transport infrastructure with a turnpike road network, a canal and waterway network, and a railway network. Raw materials and finished products could be moved more quickly and cheaply than before. Improved transportation also allowed new ideas to spread quickly.               Before and during the Industrial Revolution navigation on several British rivers was improved by removing obstructions, straightening curves, widening and deepening and building navigation ": null
    },
    {
        "locks": "Lock"
    },
    {
        ". Britain had over 1,000 miles of navigable rivers and streams by 1750.      Canals and waterways allowed bulk materials to be economically transported long distances inland. This was because a horse could pull a barge with a load dozens of times larger than the load that could be drawn in a cart.      In the UK, canals began to be built in the late 18th century to link the major manufacturing centres across the country. Known for its huge commercial success, the ": null
    },
    {
        "Bridgewater Canal": "Bridgewater Canal"
    },
    {
        " in ": null
    },
    {
        "North West England": "North West England"
    },
    {
        ", which opened in 1761 and was mostly funded by ": null
    },
    {
        "The 3rd Duke of Bridgewater": "Francis Egerton, 3Rd Duke Of Bridgewater"
    },
    {
        ". From ": null
    },
    {
        "Worsley": "Worsley"
    },
    {
        " to the rapidly growing town of ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        " its construction cost £168,000 ,  but its advantages over land and river transport meant that within a year of its opening in 1761, the price of coal in Manchester fell by about half.  This success helped inspire a period of intense canal building, known as ": null
    },
    {
        "Canal Mania": "Canal Mania"
    },
    {
        ".  New canals were hastily built in the aim of replicating the commercial success of the Bridgewater Canal, the most notable being the ": null
    },
    {
        "Leeds and Liverpool Canal": "Leeds And Liverpool Canal"
    },
    {
        " and the ": null
    },
    {
        "Thames and Severn Canal": "Thames And Severn Canal"
    },
    {
        " which opened in 1774 and 1789 respectively.     By the 1820s a national network was in existence. Canal construction served as a model for the organisation and methods later used to construct the railways. They were eventually largely superseded as profitable commercial enterprises by the spread of the railways from the 1840s on. The last major canal to be built in the United Kingdom was the ": null
    },
    {
        "Manchester Ship Canal": "Manchester Ship Canal"
    },
    {
        ", which upon opening in 1894 was the largest ": null
    },
    {
        "ship canal": "Ship Canal"
    },
    {
        " in the world,  and opened Manchester as a ": null
    },
    {
        "port": "Port Of Manchester"
    },
    {
        ". However it never achieved the commercial success its sponsors had hoped for and signalled canals as a dying mode of transport in an age dominated by railways, which were quicker and often cheaper.     Britains canal network, together with its surviving mill buildings, is one of the most enduring features of the early Industrial Revolution to be seen in Britain.            France was known for having an excellent system of roads at the time of the Industrial Revolution; however, most of the roads on the European Continent and in the U.K. were in bad condition and dangerously rutted.  There exist everywhere roads suitable for hauling .": null
    },
    {
        "Robert Fulton": "Robert Fulton"
    },
    {
        " on roads in France     Much of the original British road system was poorly maintained by thousands of local parishes, but from the 1720s ": null
    },
    {
        "turnpike": "Toll Road"
    },
    {
        " trusts were set up to charge tolls and maintain some roads. Increasing numbers of main roads were turnpiked from the 1750s to the extent that almost every main road in England and Wales was the responsibility of a ": null
    },
    {
        "turnpike trust": "Turnpike Trusts"
    },
    {
        ". New engineered roads were built by ": null
    },
    {
        "John Metcalf": "John Metcalf"
    },
    {
        ", ": null
    },
    {
        "Thomas Telford": "Thomas Telford"
    },
    {
        " and most notably ": null
    },
    {
        "John McAdam": "John Loudon Mcadam"
    },
    {
        ", with the first ": null
    },
    {
        "macadam": "Macadam"
    },
    {
        "ised stretch of road being Marsh Road at Ashton Gate, Bristol in 1816. Richard Brown . Society and Economy in Modern Britain 1700–1850 p. 136. Routledge, 1991 The major turnpikes radiated from London and were the means by which the Royal Mail was able to reach the rest of the country. Heavy goods transport on these roads was by means of slow, broad wheeled, carts hauled by teams of horses. Lighter goods were conveyed by smaller carts or by teams of ": null
    },
    {
        "pack horse": "Packhorse"
    },
    {
        ". Stagecoaches carried the rich, and the less wealthy could pay to ride on ": null
    },
    {
        "carriers carts": "Un-Sprung Cart"
    },
    {
        ".                  Reducing friction was one of the major reasons for the success of railroads compared to wagons. This was demonstrated on an iron plate covered wooden tramway in 1805 at Croydon, England.   “A good horse on an ordinary turnpike road can draw two thousand pounds, or one ton. A party of gentlemen were invited to witness the experiment, that the superiority of the new road might be established by ocular demonstration. Twelve wagons were loaded with stones, till each wagon weighed three tons, and the wagons were fastened together. A horse was then attached, which drew the wagons with ease, six miles in two hours, having stopped four times, in order to show he had the power of starting, as well as drawing his great load.”          Railways were made practical by the widespread introduction of inexpensive ": null
    },
    {
        "puddled iron": "Puddling"
    },
    {
        " after 1800, the ": null
    },
    {
        "rolling mill": "Rolling"
    },
    {
        " for making rails, and the development of the high-pressure steam engine also around 1800.     Wagonways for moving coal in the mining areas had started in the 17th century and were often associated with canal or river systems for the further movement of coal. These were all horse drawn or relied on gravity, with a stationary steam engine to haul the wagons back to the top of the incline. The first applications of the steam ": null
    },
    {
        "locomotive": "Locomotive"
    },
    {
        " were on wagon or plate ways . Horse-drawn public railways did not begin until the early years of the 19th century when improvements to pig and wrought iron production were lowering costs. See: ": null
    },
    {
        "Metallurgy": "Industrial Revolutionmetallurgy"
    },
    {
        "     Steam locomotives began being built after the introduction of high-pressure steam engines after the expiration of the ": null
    },
    {
        "Boulton and Watt": "Boulton And Watt"
    },
    {
        " patent in 1800. High-pressure engines exhausted used steam to the atmosphere, doing away with the condenser and cooling water. They were also much lighter weight and smaller in size for a given horsepower than the stationary condensing engines. A few of these early locomotives were used in mines. Steam-hauled public railways began with the ": null
    },
    {
        "Stockton and Darlington Railway": "Stockton And Darlington Railway"
    },
    {
        " in 1825.     The rapid introduction of railways followed the 1829 ": null
    },
    {
        "Rainhill Trials": "Rainhill Trials"
    },
    {
        ", which demonstrated ": null
    },
    {
        "Robert Stephensons": "Robert Stephenson"
    },
    {
        " successful locomotive design and the 1828 development of ": null
    },
    {
        "Hot blast": "Hot Blast"
    },
    {
        ", which dramatically reduced the fuel consumption of making iron and increased the capacity the ": null
    },
    {
        "blast furnace": "Blast Furnace"
    },
    {
        ".     On 15 September 1830, the ": null
    },
    {
        "Liverpool and Manchester Railway": "Liverpool And Manchester Railway"
    },
    {
        " was opened, the first inter-city railway in the world and was attended by Prime Minister, the ": null
    },
    {
        "Duke of Wellington": "Arthur Wellesley, 1St Duke Of Wellington"
    },
    {
        ". Herbert L. Sussman . Victorian Technology: Invention, Innovation, and the Rise of the Machine . p. 2. ABC-CLIO, 2009 The railway was engineered by ": null
    },
    {
        "Joseph Locke": "Joseph Locke"
    },
    {
        " and ": null
    },
    {
        "George Stephenson": "George Stephenson"
    },
    {
        ", linked the rapidly expanding industrial town of ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        " with the port town of ": null
    },
    {
        "Liverpool": "Liverpool"
    },
    {
        ". The ": null
    },
    {
        "opening": "Opening Of The Liverpool And Manchester Railway"
    },
    {
        " was marred by problems, due to the primitive nature of the technology being employed, however problems were gradually ironed out and the railway became highly successful, transporting passengers and freight. The success of the inter-city railway, particularly in the transport of freight and commodities, led to ": null
    },
    {
        "Railway Mania": "Railway Mania"
    },
    {
        ".     Construction of major railways connecting the larger cities and towns began in the 1830s but only gained momentum at the very end of the first Industrial Revolution. After many of the workers had completed the railways, they did not return to their rural lifestyles but instead remained in the cities, providing additional workers for the factories.       Other developments included more efficient ": null
    },
    {
        "water wheels": "Water Wheel"
    },
    {
        ", based on experiments conducted by the British engineer ": null
    },
    {
        "John Smeaton": "John Smeaton"
    },
    {
        "    the beginnings of a machine industry      and the rediscovery of ": null
    },
    {
        "concrete": "Concrete"
    },
    {
        "  by ": null
    },
    {
        "John Smeaton": "John Smeaton"
    },
    {
        ", which had been lost for 1,300 years.                 Prior to the Industrial Revolution, most of the workforce was employed in agriculture, either as self-employed farmers as landowners or tenants, or as landless agricultural labourers. It was common for families in various parts of the world to spin yarn, weave cloth and make their own clothing. Households also spun and wove for market production. At the beginning of the Industrial Revolution India, China and regions of Iraq and elsewhere in Asia and the Middle East produced most of the worlds cotton cloth while Europeans produced wool and linen goods.     In Britain by the 16th century the ": null
    },
    {
        "putting-out system": "Putting-Out System"
    },
    {
        ", by which farmers and townspeople produced goods for market in their homes, often described as cottage industry, was being practiced. Typical putting out system goods included spinning and weaving. Merchant capitalists typically provided the raw materials, paid workers by the ": null
    },
    {
        "piece": "Piece Work"
    },
    {
        ", and were responsible for the sale of the goods. Embezzlement of supplies by workers and poor quality were common problems. The logistical effort in procuring and distributing raw materials and picking up finished goods were also limitations of the putting out system.      Some early spinning and weaving machinery, such as a ": null
    },
    {
        "40 spindle jenny": "Spinning Jenny"
    },
    {
        " for about six pounds in 1792, was affordable for cottagers.  Later machinery such as spinning frames, ": null
    },
    {
        "spinning mules": "Spinning Mule"
    },
    {
        " and power looms were expensive , giving rise to capitalist ownership of factories.     The majority of textile factory workers during the Industrial Revolution were unmarried women and children, including many orphans. They typically worked for 12 to 14 hours per day with only Sundays off. It was common for women take factory jobs seasonally during slack periods of farm work. Lack of adequate transportation, long hours and poor pay made it difficult to recruit and maintain workers. Many workers, such as displaced farmers and agricultural workers, who had nothing but their labour to sell, became factory workers out of necessity.      The change in the social relationship of the factory worker compared to farmers and cottagers was viewed unfavourably by ": null
    },
    {
        "Karl Marx": "Karl Marx"
    },
    {
        ", however, he recognized the increase in productivity made possible by technology.          Some economists, such as ": null
    },
    {
        "Robert E. Lucas, Jr.": "Robert Lucas, Jr."
    },
    {
        ", say that the real effect of the Industrial Revolution was that for the first time in history, the living standards of the masses of ordinary people have begun to undergo sustained growth  ... Nothing remotely like this economic behaviour is mentioned by the classical economists, even as a theoretical possibility. Others, however, argue that while growth of the economys overall productive powers was unprecedented during the Industrial Revolution, living standards for the majority of the population did not grow meaningfully until the late 19th and 20th centuries, and that in many ways workers living standards declined under early capitalism: for instance, studies have shown that real wages in Britain only increased 15% between the 1780s and 1850s, and that life expectancy in Britain did not begin to dramatically increase until the 1870s.   Similarly, the average height of the population declined during the Industrial Revolution, implying that their nutritional status was also decreasing. Real wages were not keeping up with the price of food.       During the Industrial Revolution, the ": null
    },
    {
        "life expectancy": "Life Expectancy"
    },
    {
        " of children increased dramatically. The percentage of the children born in London who died before the age of five decreased from 74.5% in 1730–1749 to 31.8% in 1810–1829.     The effects on living conditions of the industrial revolution have been very controversial, and were hotly debated by economic and social historians from the 1950s to the 1980s. A series of 1950s essays by ": null
    },
    {
        "Henry Phelps Brown": "Henry Phelps Brown"
    },
    {
        " and Sheila V. Hopkins later set the academic consensus that the bulk of the population, that was at the bottom of the social ladder, suffered severe reductions in their living standards. During 1813–1913, there was a significant increase in worker wages.          Chronic hunger and malnutrition were the norm for the majority of the population of the world including Britain and France, until the late 19th century. Until about 1750, in large part due to malnutrition, life expectancy in France was about 35 years and about 40 years in Britain. The United States population of the time was adequately fed, much taller on average and had life expectancy of 45–50 years although U.S. life expectancy declined by a few years by the mid 19th century. Food consumption per capita also declined during an episode known as the ": null
    },
    {
        "Antebellum Puzzle": "Antebellum Puzzle"
    },
    {
        ".     Food supply in Great Britain was adversely affected by the ": null
    },
    {
        "Corn Laws": "Corn Laws"
    },
    {
        " . The Corn Laws, which imposed tariffs on imported grain, were enacted to keep prices high in order to benefit domestic producers. The Corn Laws were repealed in the early years of the ": null
    },
    {
        "Great Irish Famine": "Great Famine"
    },
    {
        ".     The initial technologies of the Industrial Revolution, such as mechanized textiles, iron and coal, did little, if anything, to lower food prices. In Britain and the Netherlands, food supply increased before the Industrial Revolution due to better agricultural practices; however, population grew too, as noted by ": null
    },
    {
        "Thomas Malthus": "Thomas Malthus"
    },
    {
        ".           This condition is called the ": null
    },
    {
        "Malthusian trap": "Malthusian Trap"
    },
    {
        ", and it finally started to overcome by transportation improvements, such as canals, improved roads and steamships.  Railroads and steamships were introduced near the end of the Industrial Revolution.       The rapid population growth in the 19th century included the new industrial and manufacturing cities, as well as service centers such as ": null
    },
    {
        "Edinburgh": "Edinburgh"
    },
    {
        " and London. Gregory Clark, Shelter from the storm: housing and the industrial revolution, 1550–1909. Journal of Economic History 622 : 489–511. The critical factor was financing, which was handled by building societies that dealt directly with large contracting firms.  Christopher Powell, The British building industry since 1800: An economic history . Private renting from housing landlords was the dominant tenure. P. Kemp says this was usually of advantage to tenants. P. Kemp, Housing landlordism in late nineteenth-century Britain. Environment and Planning A 14.11 : 1437–47. People moved in so rapidly there was not enough capital to build adequate housing for everyone, so low-income newcomers squeezed into increasingly overcrowded slums. Clean water, sanitation, and public health facilities were inadequate; the death rate was high, especially infant mortality, and ": null
    },
    {
        "tuberculosis": "Tuberculosis"
    },
    {
        " among young adults. ": null
    },
    {
        "Cholera": "Cholera"
    },
    {
        " from polluted water and typhoid were endemic. Unlike rural areas, there were no famines such as the one that ": null
    },
    {
        "devastated Ireland": "Great Famine"
    },
    {
        " in the 1840s.  Anthony S. Wohl, The eternal slum: housing and social policy in Victorian London . Martin J. Daunton, House and home in the Victorian city: working-class housing, 1850–1914 .     A large exposé literature grew up condemning the unhealthy conditions. By far the most famous publication was by one of the founders of the Socialist movement,  The Condition of the Working Class in England  in 1844 ": null
    },
    {
        "Friedrich Engels": "Friedrich Engels"
    },
    {
        " described backstreet sections of Manchester and other mill towns, where people lived in crude shanties and shacks, some not completely enclosed, some with dirt floors. These shanty towns had narrow walkways between irregularly shaped lots and dwellings. There were no sanitary facilities. Population density was extremely high. Enid Gauldie, Cruel habitations: a history of working-class housing 1780–1918 However, not everyone lived in such poor conditions. The Industrial Revolution also created a middle class of businessmen, clerks, foremen and engineers who lived in much better conditions.     Conditions improved over the course of the 19th century due to new public health acts regulating things such as sewage, hygiene and home construction. In the introduction of his 1892 edition, Engels notes that most of the conditions he wrote about in 1844 had been greatly improved. For example, the ": null
    },
    {
        "Public Health Act 1875": "Public Health Act 1875"
    },
    {
        " led to the more sanitary ": null
    },
    {
        "byelaw terraced house": "Byelaw Terraced House"
    },
    {
        ".       In  The Condition of the Working Class in England  in 1844 ": null
    },
    {
        "Friedrich Engels": "Friedrich Engels"
    },
    {
        " described how untreated sewage created awful odours and turned the rivers green in industrial cities.     In 1854 ": null
    },
    {
        "John Snow": "John Snow"
    },
    {
        " traced a ": null
    },
    {
        "cholera": "Cholera"
    },
    {
        " outbreak in ": null
    },
    {
        "Soho": "Soho, London"
    },
    {
        " in London to faecal contamination of a public water well by a home cesspit. Snows findings that cholera could be spread by contaminated water took some years to be accepted, but his work led to fundamental changes in the design of public water and waste systems.       Pre-industrial water supply relied on gravity systems and pumping of water was done by water wheels. Pipes were typically made of wood. Steam powered pumps and iron pipes allowed the widespread piping of water to horse watering troughs and households.       The invention of the ": null
    },
    {
        "paper machine": "Paper Machine"
    },
    {
        " and the application of steam power to the industrial processes of ": null
    },
    {
        "printing": "Printing"
    },
    {
        " supported a massive expansion of newspaper and popular book publishing, which contributed to rising literacy and demands for mass political participation.          Consumers benefited from falling prices for clothing and household articles such as cast iron cooking utensils, and in the following decades, stoves for cooking and space heating. Coffee, tea, sugar, tobacco and chocolate became affordable to many in Europe. Watches and household clocks became popular consumer items.     Meeting the demands of the consumer revolution and growth in wealth of the middle classes in Britain, potter and entrepreneur ": null
    },
    {
        "Josiah Wedgwood": "Josiah Wedgwood"
    },
    {
        ", founder of ": null
    },
    {
        "Wedgwood": "Wedgwood"
    },
    {
        " fine china and porcelain, created goods such as ": null
    },
    {
        "tableware": "Tableware"
    },
    {
        ", which was starting to become a common feature on dining tables.     A growing consumer culture also saw people start to spend more money on entertainment. Increased literacy rates, industrialisation, and the ": null
    },
    {
        "invention of railway": "Railway"
    },
    {
        ", created a new market for cheap popular literature for the masses and the ability for it to be circulated on a large scale. ": null
    },
    {
        "Penny dreadfuls": "Penny Dreadful"
    },
    {
        " were created in the 1830s to meet this demand.  The Guardian described penny dreadfuls as “Britain’s first taste of mass-produced popular culture for the young”, and “the Victorian equivalent of video games”.  More than one million boys’ periodicals were sold per week.     In 1861, Welsh entrepreneur ": null
    },
    {
        "Pryce Pryce-Jones": "Pryce Pryce-Jones"
    },
    {
        " formed the first ": null
    },
    {
        "mail order": "Mail Order"
    },
    {
        " business, an idea which would change the nature of ": null
    },
    {
        "retail": "Retail"
    },
    {
        ". Selling Welsh ": null
    },
    {
        "flannel": "Flannel"
    },
    {
        ", he created mail order catalogues, with customers able to order by ": null
    },
    {
        "mail": "Mail"
    },
    {
        " for the first timethis following the ": null
    },
    {
        "Uniform Penny Post": "Uniform Penny Post"
    },
    {
        " in 1840 and the invention of the postage stamp  where there was a charge of one penny for carriage and delivery between any two places in the United Kingdom irrespective of distanceand the goods were delivered throughout the UK via the newly created railway system.  As the railway network expanded overseas, so did his business.       The Industrial Revolution was the first period in history during which there was a simultaneous increase in both population and per capita income.      According to ": null
    },
    {
        "Robert Hughes": "Robert Hughes"
    },
    {
        " in  The Fatal Shore , the ": null
    },
    {
        "population of England": "Demography Of England"
    },
    {
        " and Wales, which had remained steady at six million from 1700 to 1740, rose dramatically after 1740. The population of England had more than doubled from 8.3 million in 1801 to 16.8 million in 1850 and, by 1901, had nearly doubled again to 30.5 million. Improved conditions led to the population of Britain increasing from 10 million to 40 million in the 1800s. Europes population increased from about 100 million in 1700 to 400 million by 1900.          The growth of modern industry since the late 18th century led to massive ": null
    },
    {
        "urbanisation": "Urbanisation"
    },
    {
        " and the rise of new great cities, first in Europe and then in other regions, as new opportunities brought huge numbers of migrants from rural communities into urban areas. In 1800, only 3% of the worlds population lived in cities, compared to nearly 50% today . Manchester had a population of 10,000 in 1717, but by 1911 it had burgeoned to 2.3 million.       Womens historians have debated the effect of the Industrial Revolution and capitalism generally on the status of women. Eleanor Amico, ed. Readers guide to womens studies pp. 102–04, 306–08.  Taking a pessimistic side, ": null
    },
    {
        "Alice Clark": "Alice Clark"
    },
    {
        " argued that when capitalism arrived in 17th-century England, it lowered the status of women as they lost much of their economic importance. Clark argues that in 16th-century England, women were engaged in many aspects of industry and agriculture. The home was a central unit of production and women played a vital role in running farms, and in some trades and landed estates. Their useful economic roles gave them a sort of equality with their husbands. However, Clark argues, as capitalism expanded in the 17th century, there was more and more division of labour with the husband taking paid labour jobs outside the home, and the wife reduced to unpaid household work. Middle- and upper-class women were confined to an idle domestic existence, supervising servants; lower-class women were forced to take poorly paid jobs. Capitalism, therefore, had a negative effect on powerful women. Alice Clark, Working life of women in the seventeenth century .     In a more positive interpretation, ": null
    },
    {
        "Ivy Pinchbeck": "Ivy Pinchbeck"
    },
    {
        " argues that capitalism created the conditions for womens emancipation. Ivy Pinchbeck, Women Workers in the Industrial Revolution . Tilly and Scott have emphasised the continuity in the status of women, finding three stages in English history. In the pre-industrial era, production was mostly for home use and women produce much of the needs of the households. The second stage was the family wage economy of early industrialisation; the entire family depended on the collective wages of its members, including husband, wife and older children. The third or modern stage is the family consumer economy, in which the family is the site of consumption, and women are employed in large numbers in retail and clerical jobs to support rising standards of consumption. Louise Tilly and Joan Wallach Scott, Women, work, and family .     Ideas of thrift and hard work characterized middle-class families as the Industrial Revolution swept Europe. These values were displayed in Samuel Smiles book Self-Help, in which he states that the misery of the poorer classes was voluntary and self-imposed – the results of idleness, thriftlessness, intemperance, and misconduct.            In terms of social structure, the Industrial Revolution witnessed the triumph of a ": null
    },
    {
        "middle class": "Middle Class"
    },
    {
        " of industrialists and businessmen over a landed class of nobility and gentry. Ordinary working people found increased opportunities for employment in the new mills and factories, but these were often under strict working conditions with long hours of labour dominated by a pace set by machines. As late as the year 1900, most industrial workers in the United States still worked a 10-hour day , yet earned from 20% to 40% less than the minimum deemed necessary for a decent life; however, most workers in textiles, which was by far the leading industry in terms of employment, were women and children. For workers of the labouring classes, industrial life was a stony desert, which they had to make habitable by their own efforts.  Also, harsh working conditions were prevalent long before the Industrial Revolution took place. ": null
    },
    {
        "Pre-industrial society": "Pre-Industrial Society"
    },
    {
        " was very static and often cruel – ": null
    },
    {
        "child labour": "Child Labour"
    },
    {
        ", dirty living conditions, and long working hours were just as prevalent before the Industrial Revolution.               Industrialisation led to the creation of the ": null
    },
    {
        "factory": "Factory"
    },
    {
        ". The factory system contributed to the growth of urban areas, as large numbers of workers migrated into the cities in search of work in the factories. Nowhere was this better illustrated than the mills and associated industries of Manchester, nicknamed ": null
    },
    {
        "Cottonopolis": "Cottonopolis"
    },
    {
        " , and the worlds first industrial city.  Manchester experienced a six-times increase in its population between 1771 and 1831. Bradford grew by 50% every ten years between 1811 and 1851 and by 1851 only 50% of the population of Bradford was actually born there.      In addition, between 1815 and 1939, 20 percent of Europes population left home, pushed by poverty, a rapidly growing population, and the displacement of peasant farming and artisan manufacturing. They were pulled abroad by the enormous demand for labour overseas, the ready availability of land, and cheap transportation. Still, many did not find a satisfactory life in their new homes, leading 7 million of them to return to Europe.  This mass migration had large demographic effects: in 1800, less than one percent of the world population consisted of overseas Europeans and their descendants; by 1930, they represented 11 percent.  The Americas felt the brunt of this huge emigration, largely concentrated in the United States.     For much of the 19th century, production was done in small mills, which were typically ": null
    },
    {
        "water-powered": "List Of Watermills In The United Kingdom"
    },
    {
        " and built to serve local needs. Later, each factory would have its own steam engine and a chimney to give an efficient draft through its boiler.     In other industries, the transition to factory production was not so divisive. Some industrialists themselves tried to improve factory and living conditions for their workers. One of the earliest such reformers was ": null
    },
    {
        "Robert Owen": "Robert Owen"
    },
    {
        ", known for his pioneering efforts in improving conditions for workers at the ": null
    },
    {
        "New Lanark mills": "Robert Owenphilanthropy In New Lanark"
    },
    {
        ", and often regarded as one of the key thinkers of the ": null
    },
    {
        "early socialist movement": "Utopian Socialism"
    },
    {
        ".     By 1746 an integrated ": null
    },
    {
        "brass mill": "Brass Mill"
    },
    {
        " was working at ": null
    },
    {
        "Warmley": "Warmley"
    },
    {
        " near ": null
    },
    {
        "Bristol": "Bristol"
    },
    {
        ". Raw material went in at one end, was smelted into brass and was turned into pans, pins, wire, and other goods. Housing was provided for workers on site. ": null
    },
    {
        "Josiah Wedgwood": "Josiah Wedgwood"
    },
    {
        " and ": null
    },
    {
        "Matthew Boulton": "Matthew Boulton"
    },
    {
        "  were other prominent early industrialists, who employed the factory system.               The Industrial Revolution led to a population increase but the chances of surviving childhood did not improve throughout the Industrial Revolution, although infant mortality rates were reduced markedly. There was still limited opportunity for education and children were expected to work. Employers could pay a child less than an adult even though their productivity was comparable; there was no need for strength to operate an industrial machine, and since the industrial system was completely new, there were no experienced adult labourers. This made child labour the labour of choice for manufacturing in the early phases of the Industrial Revolution between the 18th and 19th centuries. In England and Scotland in 1788, two-thirds of the workers in 143 water-powered ": null
    },
    {
        "cotton mills": "Cotton Mill"
    },
    {
        " were described as children.     ": null
    },
    {
        "Child labour": "Child Labour"
    },
    {
        " existed before the Industrial Revolution but with the increase in population and education it became more visible. Many children were forced to work in relatively bad conditions for much lower pay than their elders, 10–20% of an adult males wage.     Reports were written detailing some of the abuses, particularly in the coal mines and textile factories, and these helped to popularise the childrens plight. The public outcry, especially among the upper and middle classes, helped stir change in the young workers welfare.     Politicians and the government tried to limit child labour by law but factory owners resisted; some felt that they were aiding the poor by giving their children money to buy food to avoid ": null
    },
    {
        "starvation": "Starvation"
    },
    {
        ", and others simply welcomed the cheap labour. In 1833 and 1844, the first general laws against child labour, the ": null
    },
    {
        "Factory Acts": "Factory Acts"
    },
    {
        ", were passed in Britain: Children younger than nine were not allowed to work, children were not permitted to work at night, and the work day of youth under the age of 18 was limited to twelve hours. Factory inspectors supervised the execution of the law, however, their scarcity made enforcement difficult. About ten years later, the employment of children and women in mining was forbidden. Although laws such as these decreased the number of child labourers, child labour remained significantly present in Europe and the United States until the 20th century.          The Industrial Revolution concentrated labour into mills, factories and mines, thus facilitating the organisation of combinations or ": null
    },
    {
        "trade unions": "Trade Union"
    },
    {
        " to help advance the interests of working people. The power of a union could demand better terms by withdrawing all labour and causing a consequent cessation of production. Employers had to decide between giving in to the union demands at a cost to themselves or suffering the cost of the lost production. Skilled workers were hard to replace, and these were the first groups to successfully advance their conditions through this kind of bargaining.     The main method the unions used to effect change was ": null
    },
    {
        "strike action": "Strike Action"
    },
    {
        ". Many strikes were painful events for both sides, the unions and the management. In Britain, the ": null
    },
    {
        "Combination Act 1799": "Combination Act 1799"
    },
    {
        " forbade workers to form any kind of trade union until its repeal in 1824. Even after this, unions were still severely restricted. One British newspaper in 1834 described unions as the most dangerous institutions that were ever permitted to take root, under shelter of law, in any country...      In 1832, the ": null
    },
    {
        "Reform Act": "Reform Act 1832"
    },
    {
        " extended the vote in Britain but did not grant universal suffrage. That year six men from ": null
    },
    {
        "Tolpuddle": "Tolpuddle"
    },
    {
        " in Dorset founded the Friendly Society of Agricultural Labourers to protest against the gradual lowering of wages in the 1830s. They refused to work for less than ten shillings a week, although by this time wages had been reduced to seven shillings a week and were due to be further reduced to six. In 1834 James Frampton, a local landowner, wrote to the Prime Minister, ": null
    },
    {
        "Lord Melbourne": "Viscount Melbourne"
    },
    {
        ", to complain about the union, invoking an obscure law from 1797 prohibiting people from swearing oaths to each other, which the members of the Friendly Society had done. James Brine, James Hammett, George Loveless, Georges brother James Loveless, Georges brother in-law Thomas Standfield, and Thomass son John Standfield were arrested, found guilty, and transported to Australia. They became known as the ": null
    },
    {
        "Tolpuddle Martyrs": "Tolpuddle Martyrs"
    },
    {
        ". In the 1830s and 1840s, the ": null
    },
    {
        "Chartist": "Chartism"
    },
    {
        " movement was the first large-scale organised working class political movement which campaigned for political equality and social justice. Its Charter of reforms received over three million signatures but was rejected by Parliament without consideration.     Working people also formed ": null
    },
    {
        "friendly societies": "Friendly Society"
    },
    {
        " and ": null
    },
    {
        "co-operative societies": "Cooperative"
    },
    {
        " as mutual support groups against times of economic hardship. Enlightened industrialists, such as ": null
    },
    {
        "Robert Owen": "Robert Owen"
    },
    {
        " also supported these organisations to improve the conditions of the working class.     Unions slowly overcame the legal restrictions on the right to strike. In 1842, a ": null
    },
    {
        "general strike": "General Strike"
    },
    {
        " involving cotton workers and colliers was organised through the Chartist movement which stopped production across Great Britain.     Eventually, effective political organisation for working people was achieved through the trades unions who, after the extensions of the franchise in 1867 and 1885, began to support socialist political parties that later merged to become the British ": null
    },
    {
        "Labour Party": "Labour Party"
    },
    {
        ".                  The rapid industrialisation of the English economy cost many craft workers their jobs. The movement started first with ": null
    },
    {
        "lace": "Lace"
    },
    {
        " and ": null
    },
    {
        "hosiery": "Hosiery"
    },
    {
        " workers near ": null
    },
    {
        "Nottingham": "Nottingham"
    },
    {
        " and spread to other areas of the textile industry owing to early industrialisation. Many weavers also found themselves suddenly unemployed since they could no longer compete with machines which only required relatively limited labour to produce more cloth than a single weaver. Many such unemployed workers, weavers, and others, turned their animosity towards the machines that had taken their jobs and began destroying factories and machinery. These attackers became known as Luddites, supposedly followers of ": null
    },
    {
        "Ned Ludd": "Ned Ludd"
    },
    {
        ", a folklore figure. The first attacks of the Luddite movement began in 1811. The Luddites rapidly gained popularity, and the British government took drastic measures, using the ": null
    },
    {
        "militia": "Militia"
    },
    {
        " or ": null
    },
    {
        "army": "Army"
    },
    {
        " to protect industry. Those rioters who were caught were tried and hanged, or ": null
    },
    {
        "transported": "Penal Transportation"
    },
    {
        " for life.     Unrest continued in other sectors as they industrialised, such as with agricultural labourers in the 1830s when large parts of southern Britain were affected by the ": null
    },
    {
        "Captain Swing": "Captain Swing"
    },
    {
        " disturbances. Threshing machines were a particular target, and ": null
    },
    {
        "hay": "Hay"
    },
    {
        "rick burning was a popular activity. However, the riots led to the first formation of ": null
    },
    {
        "trade unions": "Trade Union"
    },
    {
        ", and further pressure for reform.       The traditional centers of hand textile production such as India, parts of the Middle East and later China could not withstand the competition from machine-made textiles, which over a period of decades destroyed the hand made textile industries and left millions of people without work, many of whom starved.     The Industrial Revolution also generated an enormous and unprecedented economic division in the world, as measured by the share of manufacturing output.          Cheap cotton textiles increased the demand for raw cotton; previously, it had primarily been consumed in subtropical regions where it was grown, with little raw cotton available for export. Consequently, prices of raw cotton rose. Some cotton had been grown in the West Indies, particularly in ": null
    },
    {
        "Hispaniola": "Hispaniola"
    },
    {
        ", but Haitian cotton production was halted by the ": null
    },
    {
        "Haitian Revolution": "Haitian Revolution"
    },
    {
        " in 1791. The invention of the cotton gin in 1792 allowed Georgia green seeded cotton to be profitable, leading to the widespread growth of cotton ": null
    },
    {
        "plantations": "Plantation"
    },
    {
        " in the United States and Brazil. In 1791 world cotton production was estimated to be 490,000,000 pounds with U.S. production accounting to 2,000,000 pounds. By 1800, U.S. production was 35,000,000 pounds, of which 17,790,000 were exported. In 1945 the U.S. produced seven-eights of the 1,169,600,000 pounds of world production.      The Americas, particularly the U.S., had labour shortages and high priced labour, which made ": null
    },
    {
        "slavery": "Slavery"
    },
    {
        " attractive. Americas cotton plantations were highly efficient and profitable, and able to keep up with demand.  The U.S. Civil War created a cotton famine that led to increased production in other areas of the world, including new colonies in Africa.          The origins of the ": null
    },
    {
        "environmental movement": "Environmental Movement"
    },
    {
        " lay in the response to increasing levels of ": null
    },
    {
        "smoke": "Smoke"
    },
    {
        " pollution": "Pollution"
    },
    {
        " in the atmosphere during the Industrial Revolution. The emergence of great factories and the concomitant immense growth in ": null
    },
    {
        "coal consumption": "History Of Coal Mining"
    },
    {
        " gave rise to an unprecedented level of ": null
    },
    {
        "air pollution": "Air Pollution"
    },
    {
        " in industrial centers; after 1900 the large volume of industrial ": null
    },
    {
        "chemical": "Chemical"
    },
    {
        " discharges added to the growing load of untreated human waste.  The first large-scale, modern environmental laws came in the form of Britains ": null
    },
    {
        "Alkali Acts": "Alkali Acts"
    },
    {
        ", passed in 1863, to regulate the deleterious air pollution  given off by the ": null
    },
    {
        "Leblanc process": "Leblanc Process"
    },
    {
        ", used to produce ": null
    },
    {
        "soda ash": "Soda Ash"
    },
    {
        ". An Alkali inspector and four sub-inspectors were appointed to curb this pollution. The responsibilities of the inspectorate were gradually expanded, culminating in the Alkali Order 1958 which placed all major heavy industries that emitted ": null
    },
    {
        "smoke": "Smoke"
    },
    {
        ", grit, dust and fumes under supervision.     The manufactured gas industry began in British cities in 1812–1820. The technique used produced highly toxic effluent that was dumped into sewers and rivers. The gas companies were repeatedly sued in nuisance lawsuits. They usually lost and modified the worst practices. The City of London repeatedly indicted gas companies in the 1820s for polluting the Thames and poisoning its fish. Finally, Parliament wrote company charters to regulate toxicity. Leslie Tomory, The Environmental History of the Early British Gas Industry, 1812–1830. Environmental history 171 : 29–54. The industry reached the US around 1850 causing pollution and lawsuits. Joel A. Tarr, Toxic Legacy: The Environmental Impact of the Manufactured Gas Industry in the United States. Technology and culture 551 : 107–47.      In industrial cities local experts and reformers, especially after 1890, took the lead in identifying environmental degradation and pollution, and initiating grass-roots movements to demand and achieve reforms. Harold L. Platt, Shock cities: the environmental transformation and reform of Manchester and Chicago . Typically the highest priority went to water and air pollution. The ": null
    },
    {
        "Coal Smoke Abatement Society": "Environmental Protection Uk"
    },
    {
        " was formed in Britain in 1898 making it one of the oldest environmental NGOs. It was founded by artist Sir ": null
    },
    {
        "William Blake Richmond": "William Blake Richmond"
    },
    {
        ", frustrated with the pall cast by coal smoke. Although there were earlier pieces of legislation, the ": null
    },
    {
        "Public Health Act 1875": "Public Health Act 1875"
    },
    {
        " required all furnaces and fireplaces to consume their own smoke. It also provided for sanctions against factories that emitted large amounts of black smoke. The provisions of this law were extended in 1926 with the Smoke Abatement Act to include other emissions, such as soot, ash, and gritty particles and to empower local authorities to impose their own regulations. Brian William Clapp, An environmental history of Britain since the industrial revolution .       In his 1983 book  Nations and Nationalism , philosopher ": null
    },
    {
        "Ernest Gellner": "Ernest Gellner"
    },
    {
        " argues that the industrial revolution and economic modernization spurred the creation of nations.               The Industrial Revolution on ": null
    },
    {
        "Continental Europe": "Continental Europe"
    },
    {
        " came a little later than in Great Britain. In many industries, this involved the application of technology developed in Britain in new places. Often the technology was purchased from Britain or British engineers and entrepreneurs moved abroad in search of new opportunities. By 1809, part of the ": null
    },
    {
        "Ruhr Valley": "Ruhr"
    },
    {
        " in Westphalia was called Miniature England because of its similarities to the industrial areas of England. The German, Russian and Belgian governments all provided state funding to the new industries. In some cases , the different availability of resources locally meant that only some aspects of the British technology were adopted.         ": null
    },
    {
        "Belgium": "History Of Belgium"
    },
    {
        " was the second country, after Britain, in which the Industrial Revolution took place and the first in continental Europe: ": null
    },
    {
        "Wallonia": "Wallonia"
    },
    {
        " was the first region to follow the British model successfully. Starting in the middle of the 1820s, and especially after Belgium became an independent nation in 1830, numerous works comprising coke blast furnaces as well as puddling and rolling mills were built in the coal mining areas around ": null
    },
    {
        "Liège": "Liège"
    },
    {
        " and ": null
    },
    {
        "Charleroi": "Charleroi"
    },
    {
        ". The leader was a transplanted Englishman ": null
    },
    {
        "John Cockerill": "John Cockerill"
    },
    {
        ". His factories at ": null
    },
    {
        "Seraing": "Seraing"
    },
    {
        " integrated all stages of production, from engineering to the supply of raw materials, as early as 1825.     Wallonia exemplified the radical evolution of industrial expansion. Thanks to coal , the region geared up to become the 2nd industrial power in the world after Britain. But it is also pointed out by many researchers, with its  Sillon industriel , Especially in the ": null
    },
    {
        "Haine": "Haine"
    },
    {
        ", ": null
    },
    {
        "Sambre": "Sambre"
    },
    {
        " and ": null
    },
    {
        "Meuse": "Meuse"
    },
    {
        " valleys, between the ": null
    },
    {
        "Borinage": "Borinage"
    },
    {
        " and ": null
    },
    {
        "Liège": "Liège"
    },
    {
        ", there was a huge industrial development based on coal-mining and iron-making.... Philippe Raxhon wrote about the period after 1830: It was not propaganda but a reality the Walloon regions were becoming the second industrial power all over the world after Britain. The sole industrial centre outside the collieries and blast furnaces of Walloon was the old cloth-making town of ": null
    },
    {
        "Ghent": "Ghent"
    },
    {
        ". Michel De Coster, Professor at the ": null
    },
    {
        "Université de Liège": "University Of Liège"
    },
    {
        " wrote also: The historians and the economists say that Belgium was the second industrial power of the world, in proportion to its population and its territory But this rank is the one of Wallonia where the coal-mines, the blast furnaces, the iron and zinc factories, the wool industry, the glass industry, the weapons industry... were concentrated.     Sillon industriel, which runs from ": null
    },
    {
        "Mons": "Mons"
    },
    {
        " in the west, to ": null
    },
    {
        "Verviers": "Verviers"
    },
    {
        " in the east . Even if Belgium is the second industrial country after Britain, the effect of the industrial revolution there was very different. In Breaking stereotypes, Muriel Neven and Isabelle Devious say:     The industrial revolution changed a mainly rural society into an urban one, but with a strong contrast between northern and southern Belgium. During the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        " and the Early Modern Period, Flanders was characterised by the presence of large urban centres at the beginning of the nineteenth century this region , with an urbanisation degree of more than 30 per cent, remained one of the most urbanised in the world. By comparison, this proportion reached only 17 per cent in Wallonia, barely 10 per cent in most West European countries, 16 per cent in France and 25 per cent in Britain. Nineteenth century industrialisation did not affect the traditional urban infrastructure, except in ": null
    },
    {
        "Ghent": "Ghent"
    },
    {
        " Also, in ": null
    },
    {
        "Wallonia": "Wallonia"
    },
    {
        " the traditional urban network was largely unaffected by the industrialisation process, even though the proportion of city-dwellers rose from 17 to 45 per cent between 1831 and 1910. Especially in the ": null
    },
    {
        "Haine": "Haine"
    },
    {
        ", ": null
    },
    {
        "Sambre": "Sambre"
    },
    {
        " and ": null
    },
    {
        "Meuse": "Meuse"
    },
    {
        " valleys, between the ": null
    },
    {
        "Borinage": "Borinage"
    },
    {
        " and ": null
    },
    {
        "Liège": "Liège"
    },
    {
        ", where there was a huge industrial development based on coal-mining and iron-making, urbanisation was fast. During these eighty years the number of municipalities with more than 5,000 inhabitants increased from only 21 to more than one hundred, concentrating nearly half of the Walloon population in this region. Nevertheless, industrialisation remained quite traditional in the sense that it did not lead to the growth of modern and large urban centres, but to a conurbation of industrial villages and towns developed around a coal-mine or a factory. Communication routes between these small centres only became populated later and created a much less dense urban morphology than, for instance, the area around Liège where the old town was there to direct migratory flows.       The industrial revolution in France followed a particular course as it did not correspond to the main model followed by other countries. Notably, most French historians argue France did not go through a clear take-off. Instead, Frances economic growth and industrialisation process was slow and steady through the 18th and 19th centuries. However, some stages were identified by Maurice Lévy-Leboyer:   French Revolution and Napoleonic wars ,   industrialisation, along with Britain ,   economic slowdown ,   renewal of the growth after 1905.            Based on its leadership in chemical research in the universities and industrial laboratories, Germany, which was unified in 1871, became dominant in the worlds chemical industry in the late 19th century. At first the production of dyes based on ": null
    },
    {
        "aniline": "Aniline"
    },
    {
        " was critical.      Germanys political disunitywith three dozen statesand a pervasive conservatism made it difficult to build railways in the 1830s. However, by the 1840s, trunk lines linked the major cities; each German state was responsible for the lines within its own borders. Lacking a technological base at first, the Germans imported their engineering and hardware from Britain, but quickly learned the skills needed to operate and expand the railways. In many cities, the new railway shops were the centres of technological awareness and training, so that by 1850, Germany was self-sufficient in meeting the demands of railroad construction, and the railways were a major impetus for the growth of the new steel industry. Observers found that even as late as 1890, their engineering was inferior to Britains. However, German unification in 1870 stimulated consolidation, nationalisation into state-owned companies, and further rapid growth. Unlike the situation in France, the goal was support of industrialisation, and so heavy lines crisscrossed the Ruhr and other industrial districts, and provided good connections to the major ports of Hamburg and Bremen. By 1880, Germany had 9,400 locomotives pulling 43,000 passengers and 30,000 tons of freight, and pulled ahead of France. Allan Mitchell, Great Train Race: Railways and the Franco-German Rivalry, 1815–1914            During the period 1790–1815 Sweden experienced two parallel economic movements: an agricultural revolution with larger agricultural estates, new crops and farming tools and a commercialisation of farming, and a protoindustrialisation, with small industries being established in the countryside and with workers switching between agricultural work in summer and industrial production in winter. This led to economic growth benefiting large sections of the population and leading up to a consumption revolution starting in the 1820s. Between 1815 and 1850, the protoindustries developed into more specialised and larger industries. This period witnessed increasing regional specialisation with mining in ": null
    },
    {
        "Bergslagen": "Bergslagen"
    },
    {
        ", textile mills in Sjuhäradsbygden and forestry in ": null
    },
    {
        "Norrland": "Norrland"
    },
    {
        ". Several important institutional changes took place in this period, such as free and mandatory schooling introduced in 1842 , the abolition of the national monopoly on trade in handicrafts in 1846, and a stock company law in 1848.     From 1850 to 1890, Sweden experienced its “first” Industrial Revolution with a veritable explosion in export, dominated by crops, wood and steel. Sweden abolished most tariffs and other barriers to free trade in the 1850s and joined the gold standard in 1873. Large infrastructural investments were made during this period, mainly in the expanding rail road network, which was financed in part by the government and in part by private enterprises.  From 1890 to 1930, new industries developed with their focus on the domestic market: mechanical engineering, power utilities, ": null
    },
    {
        "papermaking": "Papermaking"
    },
    {
        " and textile.            The industrial revolution began about 1870 as ": null
    },
    {
        "Meiji period": "Meiji Period"
    },
    {
        " leaders decided to catch up with the West. The government built railroads, improved roads, and inaugurated a land reform programme to prepare the country for further development. It inaugurated a new Western-based education system for all young people, sent thousands of students to the United States and Europe, and hired more than 3,000 Westerners to teach modern science, mathematics, technology, and foreign languages in Japan .     In 1871, a group of Japanese politicians known as the ": null
    },
    {
        "Iwakura Mission": "Iwakura Mission"
    },
    {
        " toured Europe and the United States to learn western ways. The result was a deliberate state-led industrialisation policy to enable Japan to quickly catch up. The ": null
    },
    {
        "Bank of Japan": "Bank Of Japan"
    },
    {
        ", founded in 1882,  used taxes to fund model steel and textile factories. Education was expanded and Japanese students were sent to study in the west.     Modern industry first appeared in textiles, including cotton and especially silk, which was based in home workshops in rural areas. G.C. Allen, Short Economic History of Modern Japan                During the late 18th an early 19th centuries when the UK and parts of Western Europe began to industrialise, the US was primarily an agricultural and natural resource producing and processing economy.    The building of roads and canals, the introduction of steamboats and the building of railroads were important for handling agricultural and natural resource products in the large and sparsely populated country of the period.               Important American technological contributions during the period of the Industrial Revolution were the ": null
    },
    {
        "cotton gin": "Cotton Gin"
    },
    {
        " and the development of a system for making ": null
    },
    {
        "interchangeable parts": "Interchangeable Parts"
    },
    {
        ", the latter aided by the development of the ": null
    },
    {
        "milling machine": "Milling"
    },
    {
        " in the US. The development of machine tools and the system of interchangeable parts were the basis for the rise of the US as the worlds leading industrial nation in the late 19th century.     ": null
    },
    {
        "Oliver Evans": "Oliver Evans"
    },
    {
        " invented an automated flour mill in the mid-1780s that used ": null
    },
    {
        "control mechanisms": "Process Control"
    },
    {
        " and conveyors so that no labour was needed from the time grain was loaded into the elevator buckets until flour was discharged into a wagon. This is considered to be the first modern ": null
    },
    {
        "materials handling system": "Bulk Material Handling"
    },
    {
        " an important advance in the progress toward ": null
    },
    {
        "mass production": "Mass Production"
    },
    {
        ".     The United States originally used horse-powered machinery for small scale applications such as grain milling, but eventually switched to water power after textile factories began being built in the 1790s. As a result, industrialisation was concentrated in ": null
    },
    {
        "New England": "New England"
    },
    {
        " and the ": null
    },
    {
        "Northeastern United States": "Northeastern United States"
    },
    {
        ", which has fast-moving rivers. The newer water-powered production lines proved more economical than horse-drawn production. In the late 19th century steam-powered manufacturing overtook water-powered manufacturing, allowing the industry to spread to the Midwest.     ": null
    },
    {
        "Thomas Somers": "Thomas Somers"
    },
    {
        " and the ": null
    },
    {
        "Cabot Brothers": "Cabot Brothers"
    },
    {
        " founded the ": null
    },
    {
        "Beverly Cotton Manufactory": "Beverly Cotton Manufactory"
    },
    {
        " in 1787, the first cotton mill in America, the largest cotton mill of its era, and a significant milestone in the research and development of cotton mills in the future. This mill was designed to use horse power, but the operators quickly learned that the horse-drawn platform was economically unstable, and had economic losses for years. Despite the losses, the Manufactory served as a playground of innovation, both in turning a large amount of cotton, but also developing the water-powered milling structure used in Slaters Mill.     In 1793, ": null
    },
    {
        "Samuel Slater": "Samuel Slater"
    },
    {
        " founded the ": null
    },
    {
        "Slater Mill": "Slater Mill"
    },
    {
        " at ": null
    },
    {
        "Pawtucket, Rhode Island": "Pawtucket, Rhode Island"
    },
    {
        ". He had learned of the new textile technologies as a boy apprentice in ": null
    },
    {
        "Derbyshire": "Derbyshire"
    },
    {
        ", England, and defied laws against the emigration of skilled workers by leaving for New York in 1789, hoping to make money with his knowledge. After founding Slaters Mill, he went on to own 13 textile mills. ": null
    },
    {
        "Daniel Day": "Daniel Day"
    },
    {
        " established a wool carding mill in the ": null
    },
    {
        "Blackstone Valley": "Blackstone Valley"
    },
    {
        " at ": null
    },
    {
        "Uxbridge, Massachusetts": "Uxbridge, Massachusetts"
    },
    {
        " in 1809, the third woollen mill established in the US  The ": null
    },
    {
        "John H. Chafee": "John Chafee"
    },
    {
        " Blackstone River Valley National Heritage Corridor": "Blackstone Valley"
    },
    {
        " retraces the history of Americas Hardest-Working River, the Blackstone. The ": null
    },
    {
        "Blackstone River": "Blackstone River"
    },
    {
        " and its tributaries, which cover more than  from ": null
    },
    {
        "Worcester, Massachusetts": "Worcester, Massachusetts"
    },
    {
        " to ": null
    },
    {
        "Providence, Rhode Island": "Providence, Rhode Island"
    },
    {
        ", was the birthplace of Americas Industrial Revolution. At its peak over 1,100 mills operated in this valley, including Slaters mill, and with it the earliest beginnings of Americas Industrial and Technological Development.     ": null
    },
    {
        "Merchant Francis Cabot Lowell": "Francis Cabot Lowell"
    },
    {
        " from ": null
    },
    {
        "Newburyport, Massachusetts": "Newburyport, Massachusetts"
    },
    {
        " memorised the design of textile machines on his tour of British factories in 1810. Realising that the ": null
    },
    {
        "War of 1812": "War Of 1812"
    },
    {
        " had ruined his import business but that a demand for domestic finished cloth was emerging in America, on his return to the United States, he set up the ": null
    },
    {
        "Boston Manufacturing Company": "Boston Manufacturing Company"
    },
    {
        ". Lowell and his partners built Americas second cotton-to-cloth textile mill at ": null
    },
    {
        "Waltham, Massachusetts": "Waltham, Massachusetts"
    },
    {
        ", second to the ": null
    },
    {
        "Beverly Cotton Manufactory": "Beverly Cotton Manufactory"
    },
    {
        ". After his death in 1817, his associates built Americas first planned factory town, which they named after him. This enterprise was capitalised in a ": null
    },
    {
        "public stock offering": "Initial Public Offering"
    },
    {
        ", one of the first uses of it in the United States. ": null
    },
    {
        "Lowell, Massachusetts": "Lowell, Massachusetts"
    },
    {
        ", using  of canals and 10,000 horsepower delivered by the ": null
    },
    {
        "Merrimack River": "Merrimack River"
    },
    {
        ", is considered by some as a major contributor to the success of the American Industrial Revolution. The short-lived utopia-like ": null
    },
    {
        "Waltham-Lowell system": "Waltham-Lowell System"
    },
    {
        " was formed, as a direct response to the poor working conditions in Britain. However, by 1850, especially following the ": null
    },
    {
        "Irish Potato Famine": "Great Famine"
    },
    {
        ", the system had been replaced by poor immigrant labour.     A major U.S. contribution to industrialisation was the development of techniques to make ": null
    },
    {
        "interchangeable parts": "Interchangeable Parts"
    },
    {
        " from metal. Precision metal machining techniques were developed by the U.S. Department of War to make interchangeable parts for small firearms. The development work took place at the Federal Arsenals at Springfield Armory and Harpers Ferry Armory. Techniques for precision machining using machine tools included using fixtures to hold the parts in proper position, jigs to guide the cutting tools and precision blocks and gauges to measure the accuracy. The ": null
    },
    {
        "milling machine": "Milling Machine"
    },
    {
        ", a fundamental machine tool, is believed to have been invented by ": null
    },
    {
        "Eli Whitney": "Eli Whitney"
    },
    {
        ", who was a government contractor who built firearms as part of this program. Another important invention was the Blanchard lathe, invented by ": null
    },
    {
        "Thomas Blanchard": "Thomas Blanchard"
    },
    {
        ". The Blanchard lathe, or pattern tracing lathe, was actually a shaper that could produce copies of wooden gun stocks. The use of machinery and the techniques for producing standardised and interchangeable parts became known as the ": null
    },
    {
        "American system of manufacturing": "American System Of Manufacturing"
    },
    {
        ".     Precision manufacturing techniques made it possible to build machines that mechanised the shoe industry.  and the watch industry. The industrialisation of the watch industry started 1854 also in Waltham, Massachusetts, at the ": null
    },
    {
        "Waltham Watch Company": "Waltham Watch Company"
    },
    {
        ", with the development of machine tools, gauges and assembling methods adapted to the micro precision required for watches.               ": null
    },
    {
        "Steel": "Steel"
    },
    {
        " is often cited as the first of several new areas for industrial mass-production, which are said to characterise a Second Industrial Revolution , beginning around 1850, although a method for mass manufacture of ": null
    },
    {
        "steel": "Steel"
    },
    {
        " was not invented until the 1860s, when ": null
    },
    {
        "Sir Henry Bessemer": "Henry Bessemer"
    },
    {
        " invented a new furnace which could convert molten ": null
    },
    {
        "pig iron": "Pig Iron"
    },
    {
        " into steel in large quantities. However, it only became widely available in the 1870s after the process was modified to produce more uniform quality. Bessemer steel was being displaced by the ": null
    },
    {
        "open hearth furnace": "Open Hearth Furnace"
    },
    {
        " near the end of the 19th century.        This Second Industrial Revolution gradually grew to include chemicals, mainly the ": null
    },
    {
        "chemical industries": "Chemical Industry"
    },
    {
        ", ": null
    },
    {
        "petroleum": "Petroleum"
    },
    {
        " , and, in the 20th century, the ": null
    },
    {
        "automotive industry": "Automotive Industry"
    },
    {
        ", and was marked by a transition of technological leadership from Britain to the United States and Germany.     The increasing availability of economical petroleum products also reduced the importance of coal and further widened the potential for industrialisation.     A new revolution began with electricity and ": null
    },
    {
        "electrification": "Electrification"
    },
    {
        " in the ": null
    },
    {
        "electrical industries": "Electrical Power Industry"
    },
    {
        ". The introduction of ": null
    },
    {
        "hydroelectric power": "Hydroelectricity"
    },
    {
        " generation in the ": null
    },
    {
        "Alps": "Alps"
    },
    {
        " enabled the rapid industrialisation of coal-deprived northern Italy, beginning in the 1890s.     By the 1890s, industrialisation in these areas had created the first giant industrial corporations with burgeoning global interests, as companies like ": null
    },
    {
        "U.S. Steel": "U.S. Steel"
    },
    {
        ", ": null
    },
    {
        "General Electric": "General Electric"
    },
    {
        ", ": null
    },
    {
        "Standard Oil": "Standard Oil"
    },
    {
        " and ": null
    },
    {
        "Bayer AG": "Bayer"
    },
    {
        " joined the railroad and ship companies on the worlds ": null
    },
    {
        "stock markets": "Stock Market"
    },
    {
        ".            The causes of the Industrial Revolution were complicated and remain a topic for debate. Geographic factors include Britains vast mineral resources. In addition to metal ores, Britain had the highest quality coal reserves known at the time. Britain also had abundant water power and highly productive agriculture. Britain also had numerous seaports and navigable waterways.      Some historians believe the Industrial Revolution was an outgrowth of social and institutional changes brought by the end of ": null
    },
    {
        "feudalism": "Feudalism"
    },
    {
        " in ": null
    },
    {
        "Britain": "Great Britain"
    },
    {
        " after the ": null
    },
    {
        "English Civil War": "English Civil War"
    },
    {
        " in the 17th century, although feudalism began to break down after the ": null
    },
    {
        "Black Death": "Black Death"
    },
    {
        " of the mid 14th century, followed by other epidemics, until the population reached a low in the 14th century. This created labour shortages and led to falling food prices and a peak in real wages around 1500, after which population growth began reducing wages. Inflation caused by coinage debasement after 1540 followed by precious metals supply increasing from the Americas caused land rents to fall in real terms.      The ": null
    },
    {
        "Enclosure": "Enclosure"
    },
    {
        " movement and the ": null
    },
    {
        "British Agricultural Revolution": "British Agricultural Revolution"
    },
    {
        " made food production more efficient and less labour-intensive, forcing the farmers who could no longer be self-sufficient in agriculture into ": null
    },
    {
        "cottage industry": "Cottage Industry"
    },
    {
        ", for example ": null
    },
    {
        "weaving": "Weaving"
    },
    {
        ", and in the longer term into the cities and the newly developed ": null
    },
    {
        "factories": "Factory"
    },
    {
        ". The ": null
    },
    {
        "colonial expansion": "Colonialism"
    },
    {
        " of the 17th century with the accompanying development of international trade, creation of ": null
    },
    {
        "financial markets": "Financial Market"
    },
    {
        " and accumulation of ": null
    },
    {
        "capital": "Capital"
    },
    {
        " are also cited as factors, as is the ": null
    },
    {
        "scientific revolution": "Scientific Revolution"
    },
    {
        " of the 17th century. A change in marrying patterns to getting married later made people able to accumulate more human capital during their youth, thereby encouraging economic development.      Until the 1980s, it was universally believed by academic historians that technological innovation was the heart of the Industrial Revolution and the key enabling technology was the invention and improvement of the steam engine. However, recent research into the Marketing Era has challenged the traditional, supply-oriented interpretation of the Industrial Revolution.     ": null
    },
    {
        "Lewis Mumford": "Lewis Mumford"
    },
    {
        " has proposed that the Industrial Revolution had its origins in the ": null
    },
    {
        "Early Middle Ages": "Early Middle Ages"
    },
    {
        ", much earlier than most estimates. He explains that the model for standardised ": null
    },
    {
        "mass production": "Mass Production"
    },
    {
        " was the ": null
    },
    {
        "printing press": "Printing Press"
    },
    {
        " and that the archetypal model for the industrial era was the clock . He also cites the ": null
    },
    {
        "monastic": "Monasticism"
    },
    {
        " emphasis on order and time-keeping, as well as the fact that ": null
    },
    {
        "medieval": "Medieval"
    },
    {
        " cities had at their centre a church with bell ringing at regular intervals as being necessary precursors to a greater synchronisation necessary for later, more physical, manifestations such as the steam engine.     The presence of a large domestic market should also be considered an important driver of the Industrial Revolution, particularly explaining why it occurred in Britain. In other nations, such as France, markets were split up by local regions, which often imposed tolls and ": null
    },
    {
        "tariffs": "Tariff"
    },
    {
        " on goods traded among them. Internal tariffs were abolished by ": null
    },
    {
        "Henry VIII of England": "Henry Viii Of England"
    },
    {
        ", they survived in Russia until 1753, 1789 in France and 1839 in Spain.     Governments grant of limited ": null
    },
    {
        "monopolies": "Monopoly"
    },
    {
        " to inventors under a developing ": null
    },
    {
        "patent": "Patent"
    },
    {
        " system  is considered an influential factor. The effects of patents, both good and ill, on the development of industrialisation are clearly illustrated in the history of the ": null
    },
    {
        "steam engine": "Steam Engine"
    },
    {
        ", the key enabling technology. In return for publicly revealing the workings of an invention the patent system rewarded inventors such as ": null
    },
    {
        "James Watt": "James Watt"
    },
    {
        " by allowing them to monopolise the production of the first steam engines, thereby rewarding inventors and increasing the pace of technological development. However, monopolies bring with them their own inefficiencies which may counterbalance, or even overbalance, the beneficial effects of publicising ingenuity and rewarding inventors. Watts monopoly prevented other inventors, such as ": null
    },
    {
        "Richard Trevithick": "Richard Trevithick"
    },
    {
        ", ": null
    },
    {
        "William Murdoch": "William Murdoch"
    },
    {
        ", or ": null
    },
    {
        "Jonathan Hornblower": "Jonathan Hornblower"
    },
    {
        ", whom Boulton and Watt sued, from introducing improved steam engines, thereby retarding the spread of ": null
    },
    {
        "steam power": "Steam Power"
    },
    {
        ".             One question of active interest to historians is why the Industrial Revolution occurred in Europe and not in other parts of the world in the 18th century, particularly China, ": null
    },
    {
        "India": "Indian Subcontinent"
    },
    {
        ", and the Middle East , or at other times like in ": null
    },
    {
        "Classical Antiquity": "Classical Antiquity"
    },
    {
        " or the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ". A recent account argued that Europeans have been characterized for thousands of years by a freedom-loving culture originating from the aristocratic societies of early Indo-European invaders.  Many historians, however, have challenged this explanation as being not only Eurocentric, but also ignoring historical context. In fact, before the Industrial Revolution, there existed something of a global economic parity between the most advanced regions in the world economy.  These historians have suggested a number of other factors, including education, technological changes , modern government, modern work attitudes, ecology, and culture.     China was the worlds most technologically advanced country for many centuries; however, China stagnated economically and technologically and was surpassed by Western Europe before the ": null
    },
    {
        "Age of Discovery": "Age Of Discovery"
    },
    {
        ", by which time China banned imports and denied entry to foreigners. China was also a totalitarian society. China also heavily taxed transported goods. Based on the works of Joseph Needham /ref ref  /ref  ref  /ref  ref  /ref ref name Stark2005 /  ref  /ref  ref name professor /  ref name indiaresource /  ref  /ref  ref  /ref ref  /ref ref  /ref  ref name Stark2005  /ref  ref  /ref ref name David S. Landes 1969 / ref name David S. Landes 1969 /   ref name David S. Landes 1969 /  ref name Black / ref name Kiely /ref  ref name Was slavery the engine of economic growth? Digital History / ref name The Industrial Revolution by Pat Hudson, pg. 198 / ": null
    },
    {
        "ef /re": "Ef  /Re"
    },
    {
        " ref name dictatorship /  ref  /ref  ref name continuity / ref  /ref  ref name :0  /ref ref name :0 /  ref  /ref ref  /ref  ref name archive /  ref name Capital and Innovation: How Britain Became the First Industrial Nation /  ref  /ref  ref ": null
    }
]