[
    {
        "   Intercalation or embolism in timekeeping is the insertion of a leap day, week, or month into some calendar years to make the calendar follow the seasons or moon phases. ": null
    },
    {
        "Lunisolar calendars": "Lunisolar Calendar"
    },
    {
        " may require intercalations of both days and months.          The solar or ": null
    },
    {
        "tropical year": "Tropical Year"
    },
    {
        " does not have a whole number of days , but a ": null
    },
    {
        "calendar year": "Calendar Year"
    },
    {
        " must have a whole number of days. The most common way to reconcile the two is to vary the number of days in the calendar year.     In solar calendars, this is done by adding to a ": null
    },
    {
        "common year": "Common Year"
    },
    {
        " of 365 days, an extra day about every four years, causing a ": null
    },
    {
        "leap year": "Leap Year"
    },
    {
        " to have 366 days .     The ": null
    },
    {
        "Decree of Canopus": "Decree Of Canopus"
    },
    {
        ", which was issued by the pharaoh ": null
    },
    {
        "Ptolemy III Euergetes": "Ptolemy Iii Euergetes"
    },
    {
        " of ": null
    },
    {
        "Ancient Egypt": "Ancient Egypt"
    },
    {
        " in 239 BCE, decreed a solar leap day system; an Egyptian leap year was not adopted until 25 BC, when the Roman Emperor ": null
    },
    {
        "Augustus": "Augustus"
    },
    {
        " successfully instituted a reformed ": null
    },
    {
        "Alexandrian calendar": "Coptic Calendar"
    },
    {
        ".     In the ": null
    },
    {
        "Julian calendar": "Julian Calendar"
    },
    {
        ", as well as in the ": null
    },
    {
        "Gregorian calendar": "Gregorian Calendar"
    },
    {
        ", which improved upon it, intercalation is done by adding an extra day to February in each leap year. In the Julian calendar this was done every four years. In the Gregorian, years divisible by 100 but not 400 were exempted in order to improve accuracy. Thus, 2000 was a leap year; 1700, 1800, and 1900 were not.     Epagomenal From ἐπαγόμενος, epagomenos  + -al days are days within a solar calendar that are outside any regular month. Usually five epagomenal days are included within every year , but a sixth epagomenal day is intercalated every four years in some .     The ": null
    },
    {
        "Baháí calendar": "Baháí Calendar"
    },
    {
        " includes enough epagomenal days before the last month  to ensure that the following year starts on the ": null
    },
    {
        "March equinox": "March Equinox"
    },
    {
        ". These are known as the ": null
    },
    {
        "Ayyám-i-Há": "Ayyám-I-Há"
    },
    {
        ".       The solar year does not have a whole number of ": null
    },
    {
        "lunar months": "Lunar Month"
    },
    {
        " , so a lunisolar calendar must have a variable number of ": null
    },
    {
        "months": "Month"
    },
    {
        " in a year. Regular years have 12 months, but embolismic years insert a 13th intercalary or  leap  or  embolismic month every second or third year . Whether to insert an intercalary month in a given year may be determined using regular cycles such as the 19-year ": null
    },
    {
        "Metonic cycle": "Metonic Cycle"
    },
    {
        "  or using calculations of lunar phases . The ": null
    },
    {
        "Buddhist calendar": "Buddhist Calendar"
    },
    {
        " adds both an intercalary day and month on a usually regular cycle.          The ": null
    },
    {
        "tabular Islamic calendar": "Tabular Islamic Calendar"
    },
    {
        " usually has 12 lunar months that alternate between 30 and 29 days every year, but an intercalary day is added to the last month of the year 11 times within a 30-year cycle. Some historians also linked the pre-Islamic practice of ": null
    },
    {
        "Nasi": "Nasi"
    },
    {
        " to intercalation.     The ": null
    },
    {
        "Solar Hijri calendar": "Solar Hijri Calendar"
    },
    {
        " is based on solar calculations and is similar to the Gregorian calendar in its structure, and hence the intercalation, with the exception that the year date starts with the ": null
    },
    {
        "Hegira": "Hegira"
    },
    {
        ".        The ": null
    },
    {
        "International Earth Rotation and Reference Systems Service": "International Earth Rotation And Reference Systems Service"
    },
    {
        " can insert or remove ": null
    },
    {
        "leap seconds": "Leap Second"
    },
    {
        " from the last day of any month . These are sometimes described as intercalary.        ": null
    },
    {
        "ISO 8601": "Iso 8601"
    },
    {
        " includes a ": null
    },
    {
        "specification": "Iso Week Date"
    }
]