[
    {
        "   Internetwork Packet Exchange  is the ": null
    },
    {
        "network layer": "Network Layer"
    },
    {
        " protocol": "Protocol"
    },
    {
        " in the ": null
    },
    {
        "IPX/SPX": "Ipx/Spx"
    },
    {
        " protocol suite": "Protocol Stack"
    },
    {
        ". IPX is derived from ": null
    },
    {
        "Xerox Network Systems": "Xerox Network Systems"
    },
    {
        " IDP": "Xerox Network Systemsbasic Internetwork Protocol"
    },
    {
        ". It may act as a ": null
    },
    {
        "transport layer": "Transport Layer"
    },
    {
        " protocol as well.     The IPX/SPX protocol suite was very popular through the late 1980s into the mid-1990s because it was used by the ": null
    },
    {
        "Novell": "Novell, Inc."
    },
    {
        " NetWare": "Netware"
    },
    {
        " network operating system": "Network Operating System"
    },
    {
        ". Because of Novell NetWare popularity, the IPX became a prominent ": null
    },
    {
        "internetworking": "Internetworking"
    },
    {
        " protocol.     A big advantage of IPX was a small ": null
    },
    {
        "memory footprint": "Memory Footprint"
    },
    {
        " of the IPX driver, which was vital for ": null
    },
    {
        "DOS": "Dos"
    },
    {
        " and ": null
    },
    {
        "Windows": "Windows"
    },
    {
        " up to the version ": null
    },
    {
        "Windows 95": "Windows 95"
    },
    {
        " because of limited size of the ": null
    },
    {
        "conventional memory": "Conventional Memory"
    },
    {
        ". Another IPX advantage is an easy configuration of the client computers. However, IPX does not scale well for large networks such as the Internet, . and as such, IPX usage decreased as the boom of the ": null
    },
    {
        "Internet": "Internet"
    },
    {
        " made ": null
    },
    {
        "TCP/IP": "Tcp/Ip"
    },
    {
        " nearly universal. Computers and networks can run multiple ": null
    },
    {
        "network protocol": "Network Protocol"
    },
    {
        "s, so almost all IPX sites will be running TCP/IP as well to allow Internet connectivity.  It is also possible to run later Novell products without IPX, with the beginning of full support for both IPX and TCP/IP by NetWare version 5 . support.novell.com. in late 1998.       A big advantage of IPX protocol is its little or no need for configuration. In the time when protocols for ": null
    },
    {
        "dynamic host configuration": "Dynamic Host Configuration Protocol"
    },
    {
        " did not exist and the ": null
    },
    {
        "BOOTP": "Bootstrap Protocol"
    },
    {
        " protocol for centralized assigning of addresses was not common, the IPX network could be configured almost automatically. A client computer uses the MAC address of its network card as the node address and learns what it needs to know about the network topology from the servers or ": null
    },
    {
        "routers": "Router"
    },
    {
        " – routes are propagated by ": null
    },
    {
        "Routing Information Protocol": "Routing Information Protocol"
    },
    {
        ", services by ": null
    },
    {
        "Service Advertising Protocol": "Service Advertising Protocol"
    },
    {
        ".     A small IPX network administrator had to care only   to assign all servers in the same network the same network number,   to assign different network numbers to different frame formats in the same network,   to assign different network numbers to different interfaces of servers with multiple network cards ,   to assign different network numbers to servers in different interconnected networks,   to start router process on nodes with multiple network cards in more complex networks.         Each IPX packet begins with a header with the following structure:          The Packet Type values are:              An IPX address has the following structure:              The network number allows to address the IPX nodes which do not belong to the same network or cabling system. The cabling system is a network in which a ": null
    },
    {
        "data link layer": "Data Link Layer"
    },
    {
        " protocol can be used for communication. To allow communication between different networks, they must be connected with IPX ": null
    },
    {
        "routers": "Router"
    },
    {
        ". A set of interconnected networks is called an internetwork. Any ": null
    },
    {
        "Novell NetWare": "Novell Netware"
    },
    {
        " server may serve as an IPX router. Novell also supplied stand-alone routers. Multiprotocol routers of other vendors often support IPX routing. Using different ": null
    },
    {
        "frame formats": "Frame Formats"
    },
    {
        " in one cabling system is possible, but it works similarly as if separate cabling systems were used .     Logical networks are assigned a unique 32-bit address in the range 0x1 to 0xFFFFFFFE .   Hosts have a 48-bit node address, which is by default set to the last 4 bytes of the network interface card ": null
    },
    {
        "MAC address": "Mac Address"
    },
    {
        ". The node address is appended to the network number to create a unique ": null
    },
    {
        "network address": "Network Address"
    },
    {
        " for the host on the network.   Network number 00:00:00:00 means current network.   Broadcast network number is FF:FF:FF:FF.         The node number is used to address an individual computer in the network. Client stations use its network interface card ": null
    },
    {
        "MAC address": "Mac Address"
    },
    {
        " as the node number.     The value FF:FF:FF:FF:FF:FF may be used as a node number in a destination address to ": null
    },
    {
        "broadcast": "Broadcast Address"
    },
    {
        " a packet to all nodes in the current network .         The socket number serves to select a process or application in the destination node.   The presence of a socket number in the IPX address allows the IPX to act as a ": null
    },
    {
        "transport layer": "Transport Layer"
    },
    {
        " protocol, comparable with the ": null
    },
    {
        "User Datagram Protocol": "User Datagram Protocol"
    },
    {
        " in the ": null
    },
    {
        "Internet protocol suite": "Internet Protocol Suite"
    },
    {
        ".            The IPX network number is conceptually identical to the network part of the ": null
    },
    {
        "IP address": "Ip Address"
    },
    {
        " ; the node number has the same meaning as the bits of IP address with netmask bits set to 0. The difference is that the boundary between network and node part of address in IP is variable, while in IPX it is fixed. As the node address is usually identical to the MAC address of the network adapter, the ": null
    },
    {
        "Address Resolution Protocol": "Address Resolution Protocol"
    },
    {
        " is not needed in IPX.     For ": null
    },
    {
        "routing": "Routing"
    },
    {
        ", the entries in the IPX ": null
    },
    {
        "routing table": "Routing Table"
    },
    {
        " are similar to IP routing tables; routing is done by network address, and for each network address a network:node of the next router is specified in a similar fashion an IP address/netmask is specified in IP routing tables.     There are three routing protocols available for IPX networks. In early IPX networks, a version of ": null
    },
    {
        "Routing Information Protocol": "Routing Information Protocol"
    },
    {
        " was the only available protocol to exchange routing information. Unlike RIP for ": null
    },
    {
        "IP": "Internet Protocol"
    },
    {
        ", it uses delay time as the main metric, retaining the hop count as a secondary metric. Since NetWare 3, the ": null
    },
    {
        "NetWare Link Services Protocol": "Netware Link Services Protocol"
    },
    {
        " based on ": null
    },
    {
        "IS-IS": "Is-Is"
    },
    {
        " is available, which is more suitable for larger networks. ": null
    },
    {
        "Cisco": "Cisco"
    },
    {
        " routers implement an IPX version of ": null
    },
    {
        "EIGRP": "Enhanced Interior Gateway Routing Protocol"
    },
    {
        " protocol as well.        IPX can be transmitted over Ethernet using one of the following 4 frame formats or encapsulation types:     ": null
    },
    {
        "802.3 ": "Ethernet Framenovell Raw Ieee 802.3"
    },
    {
        " encapsulation comprises an IEEE 802.3 frame header immediately followed by IPX data. It is used in legacy systems, and can be distinguished by the first two bytes of the IPX header always containing a value of 0xFFFF, which cannot be interpreted as valid LLC Destination and Source ": null
    },
    {
        "Service Access Points": "Service Access Point"
    },
    {
        "in this location of the frame.   ": null
    },
    {
        "802.2 ": "Ethernet Frameieee 802.2 Llc"
    },
    {
        " comprises an IEEE 802.3 frame header followed by an ": null
    },
    {
        "LLC": "Logical Link Control"
    },
    {
        " header  followed by IPX data. The 0xE0 fields of the LLC header indicate NetWare .   ": null
    },
    {
        "802.2": "802.2"
    },
    {
        "  comprises an IEEE 802.3 frame header, an LLC header , a SNAP header , and IPX data. The 0xAA fields of the LLC header indicate SNAP , and the OUI 0x000000 in the SNAP header indicates an encapsulated ": null
    },
    {
        "EtherType": "Ethertype"
    },
    {
        ".   ": null
    },
    {
        "Ethernet II": "Ethernet Frameethernet Ii"
    },
    {
        " encapsulation comprises an Ethernet II frame header ": null
    }
]