[
    {
        "In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", the inverse limit  is a construction that allows one to glue together several related ": null
    },
    {
        "objects": "Mathematical Object"
    },
    {
        ", the precise manner of the gluing process being specified by morphisms between the objects. Inverse limits can be defined in any ": null
    },
    {
        "category": "Category"
    },
    {
        ", and they are a special case of the concept of a ": null
    },
    {
        "limit in category theory": "Limit"
    },
    {
        ".             We start with the definition of an  inverse system  of ": null
    },
    {
        "groups": "Group"
    },
    {
        " and ": null
    },
    {
        "homomorphisms": "Group Homomorphism"
    },
    {
        ". Let  be a ": null
    },
    {
        "directed": "Directed Set"
    },
    {
        " poset": "Poset"
    },
    {
        " . Let  i∈I be a ": null
    },
    {
        "family": "Indexed Family"
    },
    {
        " of groups and suppose we have a family of homomorphisms f ij : A j → A i for all i ≤ j , called bonding maps, with the following properties:   f ii is the identity on A i ,   f ik f ij ∘ f jk for all i ≤ j ≤ k.   Then the pair  is called an inverse system of groups and morphisms over I, and the morphisms f ij are called the transition morphisms of the system.     We define the inverse limit of the inverse system  as a particular ": null
    },
    {
        "subgroup": "Subgroup"
    },
    {
        " of the ": null
    },
    {
        "direct product": "Direct Product"
    },
    {
        " of the A i s:     : A         The inverse limit A comes equipped with natural projections π i : A → A i which pick out the ith component of the direct product for each i in I. The inverse limit and the natural projections satisfy a ": null
    },
    {
        "universal property": "Universal Property"
    },
    {
        " described in the next section.     This same construction may be carried out if the A i s are ": null
    },
    {
        "sets": "Set"
    },
    {
        ", John Rhodes & Benjamin Steinberg. The q-theory of Finite Semigroups. p. 133. . semigroups, topological spaces, ": null
    },
    {
        "rings": "Ring"
    },
    {
        ", ": null
    },
    {
        "modules": "Module"
    },
    {
        " , ": null
    },
    {
        "algebras": "Algebra Over A Field"
    },
    {
        " , etc., and the ": null
    },
    {
        "homomorphisms": "Homomorphism"
    },
    {
        "are morphisms in the corresponding ": null
    },
    {
        "category": "Category Theory"
    },
    {
        ". The inverse limit will also belong to that category.         The inverse limit can be defined abstractly in an arbitrary ": null
    },
    {
        "category": "Category"
    },
    {
        " by means of a ": null
    },
    {
        "universal property": "Universal Property"
    },
    {
        ". Let  be an inverse system of objects and ": null
    },
    {
        "morphisms": "Morphism"
    },
    {
        " in a category C . The inverse limit of this system is an object X in C together with morphisms π i : X → X i  satisfying π i f ij ∘ π j for all i ≤ j. The pair  must be universal in the sense that for any other such pair   there exists a unique morphism uY → X such that the diagram     ": null
    },
    {
        "Image:InverseLimit-01.png": "Image:Inverselimit-01.Png"
    },
    {
        "     commutes": "Commutative Diagram"
    },
    {
        " for all i ≤ j, for which it suffices to show that ψ i π i ∘ u for all i. The inverse limit is often denoted   : X   Xi   with the inverse system  being understood.     In some categories, the inverse limit of certain inverse systems does not exist. If it does, however, it is unique in a strong sense: given any two inverse limits X and X of an inverse system, there exists a unique isomorphism X & prime; → X commuting with the projection maps.     We note that an inverse system in a category C admits an alternative description in terms of functor s. Any partially ordered set I can be considered as a small category where the morphisms consist of arrows i → j if and only if i ≤ j. An inverse system is then just a contravariant functor I → C, and the inverse limit functor     C is a covariant functor .         The ring of p-adic integers is the inverse limit of the rings Z/p n Z with the index set being the natural number s with the usual order, and the morphisms being take remainder . That is, one considers sequences of integers such that each element of the sequence projects down to the previous ones, namely, that ni  nj   p whenever i .         The ": null
    },
    {
        "categorical dual": "Dual"
    },
    {
        " of an inverse limit is a ": null
    },
    {
        "direct limit": "Direct Limit"
    },
    {
        " . More general concepts are the ": null
    },
    {
        "limits and colimits": "Limit"
    }
]