[
    {
        "              Jamiroquai  are an English ": null
    },
    {
        "funk": "Funk"
    },
    {
        " and ": null
    },
    {
        "acid jazz": "Acid Jazz"
    },
    {
        " band from London, formed in 1992. Fronted by singer-songwriter ": null
    },
    {
        "Jay Kay": "Jay Kay"
    },
    {
        ", the band is best known for the song ": null
    },
    {
        "Canned Heat": "Canned Heat"
    },
    {
        " , featured in  Napoleon Dynamite , and for the iconic music video for the 1996 single ": null
    },
    {
        "Virtual Insanity": "Virtual Insanity"
    },
    {
        " which was named ": null
    },
    {
        "Video of the Year": "Mtv Video Music Award For Video Of The Year"
    },
    {
        " at the ": null
    },
    {
        "1997 MTV Video Music Awards": "1997 Mtv Video Music Awards"
    },
    {
        ". Their 1998 single, ": null
    },
    {
        "Deeper Underground": "Deeper Underground"
    },
    {
        " , reached number one in the UK. All eight of the bands albums have entered the UK top 10. Three of them, along with ": null
    },
    {
        "their greatest hits compilation": "High Times: Singles 1992–2006"
    },
    {
        ", charted at number 1.     The band débuted with ": null
    },
    {
        "When You Gonna Learn": "When You Gonna Learn"
    },
    {
        " under ": null
    },
    {
        "Acid Jazz records": "Acid Jazz Records"
    },
    {
        ", which led to Kay signing a record deal with ": null
    },
    {
        "Sony Soho 2 ": "S2Records"
    },
    {
        ". While under this label, the group released a string of million-selling albums containing singles that have entered various charts worldwide, while having moderate success in the US within the Dance charts. Over the years, Kay has consistently remained as the leader through several line-up changes.     With their sound influenced by ": null
    },
    {
        "black music": "List Of Musical Genres Of The African Diaspora"
    },
    {
        ", the group were one of the most prominent components in the London-based funk/acid jazz movement. They also drew from ": null
    },
    {
        "rock": "Rock Music"
    },
    {
        ", ": null
    },
    {
        "electronica": "Electronica"
    },
    {
        " and ": null
    },
    {
        "Latin music": "Latin Music"
    },
    {
        ", and have used live instrumentation over electronics. Their lyrics and visual concepts occasionally deal with social and environmental idealism. Although Kay had maintained these values, journalists have critiqued his lyrical motives on the groups more accessible material.     Jamiroquai have sold more than 26 million albums worldwide as of 2017. Their third album  Travelling Without Moving  , received a ": null
    },
    {
        "Guinness World Record": "Guinness World Records"
    },
    {
        " for the best-selling funk album in history. The group has won an ": null
    },
    {
        "Ivor Novello Award": "Ivor Novello Awards"
    },
    {
        " for Outstanding Song Collection from the ": null
    },
    {
        "British Academy of Songwriters, Composers, and Authors": "British Academy Of Songwriters, Composers, And Authors"
    },
    {
        ", as well as one ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        ", two ": null
    },
    {
        "MTV Video Music Awards": "Mtv Video Music Award"
    },
    {
        "and two ": null
    },
    {
        "Billboard Music Award": "Billboard Music Award"
    },
    {
        "s. They have also received sixteen ": null
    },
    {
        "Brit Award": "Brit Award"
    },
    {
        " nominations.              In 1986, ": null
    },
    {
        "Jason Jay Kay": "Jay Kay"
    },
    {
        ", who worked as a break-dancer, released a ": null
    },
    {
        "hip-hop": "Hip Hop"
    },
    {
        " single under the label ": null
    },
    {
        "StreetSounds": "Streetsounds"
    },
    {
        ". It was one of the many songs he sent to record companies. ": null
    },
    {
        "Kay, Jason": "Jason Kay"
    },
    {
        " . Emergency On Planet Earth 20th anniversary reissue booklet – ": null
    },
    {
        "Sony Music Entertainment": "Sony Music Entertainment"
    },
    {
        " During this time, Kay wrote ": null
    },
    {
        "When You Gonna Learn": "When You Gonna Learn"
    },
    {
        " , a song covering a variety of social issues. When he had it studio recorded, Kay fought with the producers who stripped the song down and produced it based on mainstream trends. With the track restored to his preference, the experience helped Kay to realise his own musical style. Dubbing himself as a funk kid , Kay wanted a proper live band with a proper live sound. The band would be named, Jamiroquai , a portmanteau of the words ": null
    },
    {
        "jam": "Jam Session"
    },
    {
        " and the name of a Native American confederacy, the ": null
    },
    {
        "Iroquois": "Iroquois"
    },
    {
        ".  He was signed to ": null
    },
    {
        "Acid Jazz Records": "Acid Jazz Records"
    },
    {
        " in 1991 after he sent a demo tape of himself covering a song by ": null
    },
    {
        "the Brand New Heavies": "The Brand New Heavies"
    },
    {
        ".   Afterwards, he gradually gathered band members, including his friend Wallis Buchanan who played the ": null
    },
    {
        "didgeridoo": "Didgeridoo"
    },
    {
        ". Kay was encouraged by his manager to enlist keyboardist ": null
    },
    {
        "Toby Smith": "Toby Smith"
    },
    {
        ", but he was not convinced because Smith had a tendency to play these very ravey acid housey chords. After the group performed as support act for the Brand New Heavies, Kay again met Smith, who persuaded Kay to let him join as the groups co-songwriter and keyboardist. Their first collaboration as songwriters was the anti-war song ": null
    },
    {
        "Too Young to Die": "Too Young To Die"
    },
    {
        " . During a 2012 interview, the Brand New Heavies denied rumours that Kay was rejected in an audition to become a singer for their band, which led to him forming his own group.        In 1992, Jamiroquai began their career by performing in the British club scene,  and released When You Gonna Learn as their debut single, which charted outside the UK Top 50 chart. It featured Brand New Heavies bassist Andrew Levy, who was replaced by ": null
    },
    {
        "Stuart Zender": "Stuart Zender"
    },
    {
        " by audition in the following year.    Following the success of the When You Gonna Learn , Kay was offered multiple major-label contracts and settled for a one million dollar, 8 album record deal with ": null
    },
    {
        "Sony Soho 2 ": "S2 Records"
    },
    {
        ".  Thompson pp. 308–310  He was the only member who signed under the contract as Jamiroquai,  but would share his royalties with his band members in accordance to their contributions. Under Sony, the band released their début album  Emergency on Planet Earth , and it entered the UK albums chart at number 1 with 1.3 million copies sold worldwide.   It was described by an ": null
    },
    {
        "AllMusic": "Allmusic"
    },
    {
        " reviewer as a psychedelic melange of tight funky rhythms, acid rock intimations, and 70s soul melodies.  The album laid the foundations for an acid-jazz sound that the band would continue to build upon for the next decade and a half , according to a critic for ": null
    },
    {
        "BBC Music": "Bbc Music"
    },
    {
        ". With the album having an ecologically charged concept,  the music video for When You Gonna Learn was banned in America for using footage of a ": null
    },
    {
        "Nazi party": "Nazi Party"
    },
    {
        ". Interview with Jay Kay – ": null
    },
    {
        "Behind the Music": "Behind The Music"
    },
    {
        " The albums second single, Too Young to Die entered the UK singles chart at number 10.        Jamiroquais original drummer Nick van Gelder was absent from the group for longer than expected, and was replaced by Derrick McKenzie, who recorded with the band in one take for his audition. Kay, Jason . The Return Of The Space Cowboy 20th anniversary reissue booklet – Sony Music Entertainment The group began writing songs for their second album  The Return of the Space Cowboy , but Kay fell into a creative block which was worsened by his increasing drug use,  and the initially complex nature of the album caused Sony to tell the band that none of sounded like singles . The bands turning point came with the album single ": null
    },
    {
        "Space Cowboy": "Space Cowboy"
    },
    {
        " , which was released in September 1994 and sold 114,000 copies and was the groups first number 1 in the US ": null
    },
    {
        "Dance Club Songs": "Dance Club Songs"
    },
    {
        " Chart.  The single additionally contained remixes by ": null
    },
    {
        "David Morales": "David Morales"
    },
    {
        ", which further put the single in club circulation.   The Return of the Space Cowboy  was issued a month later and ranked at number 2 in the UK chart.  ": null
    },
    {
        "Q": "Q"
    },
    {
        " stated that the album was an ebullient follow-up to storming debut. Q - 3 stars out of 5 - ...An ebullient follow-up to his storming debut... A  Rolling Stone  reviewer described the group jazzy soul pop so tight, it crackles.  The instrumentation of the album was said to be played by humans, not samplers , according to Josef Woodard from  Entertainment Weekly .  In a 1996 report by ": null
    },
    {
        "Billboard": "Billboard"
    },
    {
        ", The Return of the Space Cowboy sold 1.3 million copies worldwide.  Jamiroquai became popular in Europe and Japan with the singles Space Cowboy and ": null
    },
    {
        "Light Years": "Light Years"
    },
    {
        " , while they were primarily known in the United States within its club scene.  The albums fifth single ": null
    },
    {
        "Stillness in Time": "Stillness In Time"
    },
    {
        " , peaked at number 9 in the UK top-ten chart.  In the same year, Kay was featured in the track Lost Souls for ": null
    },
    {
        "Gurus": "Guru"
    },
    {
        "album ": null
    },
    {
        "Jazzmatazz, Vol. 2: The New Reality": "Gurus Jazzmatazz, Vol. 2: The New Reality"
    },
    {
        ".       Released in 1996,  Travelling Without Moving  sold 1.4 million copies in the US and reached number 24 in the ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        ".   It sold 3 million copies in Europe,  and peaked at number 2 in the UK albums chart; selling 1.2 million copies, and 8 million overall.  An album that contains symphonic and jungle elements, Kay aimed for a more accessible sound in comparison to the previous album. Kay, Jason . Travelling Without Moving 20th anniversary edition booklet – Sony Music Entertainment A review from Q magazine stated that Travelling Without Moving is tighter and more compact in its production , Q - 4 Stars - ...Tighter and more compact in its production than the epic funk arrangements of...The Return of the Space Cowboy....no-one with ears can deny Jason Kays musicality--hes an extraordinary singer, and proves it here... while critic ": null
    },
    {
        "Stephen Thomas Erlewine": "Stephen Thomas Erlewine"
    },
    {
        " commented that it doesnt have the uniform consistency of its predecessor.  The album single ": null
    },
    {
        "Virtual Insanity": "Virtual Insanity"
    },
    {
        " became popular for its music video; and it sold 356,000 copies and had been streamed 4.5 million times as of 2014.  It was preceded by ": null
    },
    {
        "Cosmic Girl": "Cosmic Girl"
    },
    {
        " , which sold 250,580 copies and peaked at number 6 in the UK. Cosmic Girl was followed by ": null
    },
    {
        "Alright": "Alright"
    },
    {
        " , which charted in the US Billboard ": null
    },
    {
        "Hot 100": "Hot 100"
    },
    {
        " at number 78.  In support of Travelling Without Moving, the group gave an international tour including the UK, Japan, Australia, Brazil and the US.     The group were preparing their fourth album,  Synkronized  , in Kays Chillington studio complex, built in his Buckinghamshire country house.  During its production, bassist Stuart Zender left Jamiroquai due to conflicts with Kay. Toby Smith said in an interview that while Zender had not been involved in the albums songwriting process, the group chose to scrap the recordings involving Zender.  He was replaced by ": null
    },
    {
        "Nick Fyffe": "Nick Fyffe"
    },
    {
        " for new bass tracks to avoid potential lawsuits. This member change resulted in what  Independent  writer ": null
    },
    {
        "Lisa Markwell": "Lisa Markwell"
    },
    {
        " thought was an collection of songs for Synkronized, while the album redirects the bands British tendency toward smoothed-out old black jams... according to ": null
    },
    {
        "Spin": "Spin"
    },
    {
        " magazine. Spin - 6 - ...redirects the bands British tendency toward smoothed-out old black jams....soaring strings, gyrating congas, hell-bent wah-wahs, and an undeniably live rhythm section thatll hustle your muscles and make you freak to the beat... It contained 1999s ": null
    },
    {
        "Canned Heat": "Canned Heat"
    },
    {
        " , which was their second number 1 in the US Dance Club Songs Chart,  and in 2004, appeared in a climactic dance scene of the comedy film  Napoleon Dynamite .   The 1998 single titled, ": null
    },
    {
        "Deeper Underground": "Deeper Underground"
    },
    {
        " was listed in the  Godzilla  soundtrack and was their first and only UK number 1, selling 339,100 copies. Synkronized sold 3 million copies and ranked number 1 in the UK albums chart and number 28 in the US Billboard 200.      A Funk Odyssey–Rock Dust Light Star   The group issued their 2001 follow-up,  A Funk Odyssey , a primarily disco record that explored rock and ": null
    },
    {
        "Latin music": "Latin Music"
    },
    {
        " influences.    It was released to generally mixed reviews,  with a  Billboard  magazine reviewer stating that the group continues to mine a musical playing field that pays homage to ": null
    },
    {
        "Stevie Wonder": "Stevie Wonder"
    },
    {
        ", ": null
    },
    {
        "Curtis Mayfield": "Curtis Mayfield"
    },
    {
        ", and ": null
    },
    {
        "Chic": "Chic"
    },
    {
        " ,  and  Mojo  writing that the album to unambitious disco stylings.  A Funk Odyssey was the last album to feature songwriter and keyboardist ": null
    },
    {
        "Toby Smith": "Toby Smith"
    },
    {
        " who left the group in the following year,  while guitarist Rob Harris joined and contributed to the albums songwriting, such as ": null
    },
    {
        "Corner of the Earth": "Corner Of The Earth"
    },
    {
        " . The band embarked on a world tour to promote the album, including locations in Europe, Hong Kong and Melbourne. They were accompanied by vocalist ": null
    },
    {
        "Beverley Knight": "Beverley Knight"
    },
    {
        ",   who was featured in A Funk Odyssey with the tracks, Love Foolosophy and Main Vein .  The album topped in the UK, the ": null
    },
    {
        "European Top 100": "European Top 100 Albums"
    },
    {
        ", and reached Top 10 charts in Germany, Ireland, Austria and Finland.  In the US, the album reached number 44 in the  Billboard 200  and topped the ": null
    },
    {
        "Dance/Electronic Albums": "Dance/Electronic Albums"
    },
    {
        " chart.  The accompanying singles ": null
    },
    {
        "Little L": "Little L"
    },
    {
        " and ": null
    },
    {
        "You Give Me Something": "You Give Me Something"
    },
    {
        " , both reached at number 2 in the US ": null
    },
    {
        "Hot Dance Music/Club Play": "Hot Dance Music/Club Play"
    },
    {
        " chart and sold 185,000 copies in the country.  The former single also peaked at number 1 in Spain.     Their sixth album titled  Dynamite , was released in 2005, and reached number 3 in the UK,  number 2 in the European Top 100 Albums chart,  and number 2 in the US Dance/Electronics Album chart. It was produced by ": null
    },
    {
        "Mike Spencer": "Mike Spencer"
    },
    {
        " and had been recorded in various locations in Europe and the US. The album was described by ": null
    },
    {
        "musicOMH": "Musicomh"
    },
    {
        " as a return of trademark blend of ’80s funk and pop sensibilities that techno sounds and fretless bass and funky guitar .  Its tracks ": null
    },
    {
        "Feels Just Like It Should": "Feels Just Like It Should"
    },
    {
        " and Love Blind were characterised as a fatter, dirtier sound than usual .  Since the release of the album, the groups line-up has consisted of Kay, Harris, drummer Derrick McKenzie, keyboardist ": null
    },
    {
        "Matt Johnson": "Matt Johnson"
    },
    {
        ", ": null
    },
    {
        "Paul Turner": "Paul Turner"
    },
    {
        " on bass guitar, and percussionist Sola Akingbola.      In 2006, the group announced their switch to ": null
    },
    {
        "Columbia Records": "Columbia Records"
    },
    {
        ".  A greatest hits collection,  High Times: Singles 1992–2006 , was issued in the same year and marked the end of Kays contract with ": null
    },
    {
        "Sony": "Sony Music"
    },
    {
        ".  It topped the UK album chart after its first week of release. The following year, Jamiroquai performed in the ": null
    },
    {
        "Gig in the Sky": "Gig In The Sky"
    },
    {
        ", a concert held on a private Boeing 757 in association with ": null
    },
    {
        "Sony Ericsson": "Sony Mobile"
    },
    {
        ".  The group thus currently holds the ": null
    },
    {
        "Guinness World Record": "Guinness World Records"
    },
    {
        " for fastest concert , performed on the aircraft whilst travelling at 1017  km/h .  They formerly held the record for the highest concert , which was then broken by ": null
    },
    {
        "the Black Eyed Peas": "The Black Eyed Peas"
    },
    {
        " performing in a ": null
    },
    {
        "Virgin Australia": "Virgin Australia"
    },
    {
        " aircraft.      Rock Dust Light Star  was released in 2010 under ": null
    },
    {
        "Mercury Records": "Mercury Records"
    },
    {
        ", described by Kay himself as a a real band record that the flow of our live performances .  Matt Collar commented in an AllMusic review of the album that the group were heading back to rock and organic soul roots ,  with a sound  The Telegraph  termed as Californian Seventies funk rock .  It ranked number 7 in the UK with 34,378 copies sold.   The album single ": null
    },
    {
        "White Knuckle Ride": "White Knuckle Ride"
    },
    {
        " was number 1 in Italy and also charted in the Netherlands and Switzerland, while its preceding single ": null
    },
    {
        "Blue Skies": "Blue Skies"
    },
    {
        " reached number 36 in the UK radio airplay chart. The following year also saw members Harris, Johnson, and Turner forming the sub-group ": null
    },
    {
        "Radio Silence": "Radio Silence"
    },
    {
        ", with their album Travelogue being released.       Automaton  Automaton  in 2017, their eighth studio album and the first in seven years. It was produced by Kay and member Matt Johnson, and has a heavy electronica influence, featuring retro synths, icy arpeggiated melodies, stompy house beats and bubbling basslines , according to a review by the  New Zealand Herald .  It reached number 4 in the UK and topped the US Dance/Electronic Albums chart.  The trailer for the albums ": null
    },
    {
        "eponymous single": "Automaton"
    },
    {
        " received more than 5 million views on ": null
    },
    {
        "YouTube": "Youtube"
    },
    {
        " and two shows that were scheduled in Paris and London sold out tickets in one minute.  In May, Kay seriously injured his spine.  Requiring surgery, it led to two shows in Tokyo for their Automaton Tour being rescheduled in September.      In January 2018, Jamiroquai released a track titled, Now We Are Alone on their official ": null
    },
    {
        "YouTube": "Youtube"
    },
    {
        " page. They gave their first US performance in 13 years at the 2018 ": null
    },
    {
        "Coachella Music Festival": "Coachella Valley Music And Arts Festival"
    },
    {
        " and were accompanied by ": null
    },
    {
        "Snoop Dogg": "Snoop Dogg"
    },
    {
        " on stage.           Jamiroquais sound is generally termed as ": null
    },
    {
        "acid-jazz": "Acid Jazz"
    },
    {
        ",  funk,  disco,   soul, ": null
    },
    {
        "house": "House Music"
    },
    {
        ",  and ": null
    },
    {
        "R & B": "Contemporary R & B"
    },
    {
        ".   Their sound has been described as having an anything-goes attitude, an approach that leaves the band open to anything .  The group, as well as Jay Kays vocals, have been frequently compared to ": null
    },
    {
        "Stevie Wonder": "Stevie Wonder"
    },
    {
        ".   He however has voiced against being compared to other artists.  Kay is the primary songwriter of Jamiroquai. Despite his lack of ability to play musical instruments, he would sing and scat melodies for his band members to transcribe to their instrumentation. During the 1990s, Jamiroquai incorporated a ": null
    },
    {
        "didgeridoo": "Didgeridoo"
    },
    {
        " to their sound. Played by Wallis Buchanan, it was considered as a distinctive element to their earlier musical style.  When asked about how the group maintained their success, Kay responded, By not worrying about staying relevant... Jamiroquai never really fitted into a trendy genre or anything.      For the bands live performances, Kay said that playing live is our forte and that he studio work a bit stiff in comparison. Robert Hillburn of the  Los Angeles Times  wrote that the live band comprised a 10-member musical team, including a deejay and a horn section , and that Kay asserts the confidence and command of a dancer with moves as fluid and surprising as ": null
    },
    {
        "Prince": "Prince"
    },
    {
        "’s .  Chauncey Hollingsworth of the  Chicago Tribune  said in a 1995 concert review that his ease in movement and vocal endurance was like a martial artists.  Hillburn additionally praised Kay for establishing a rapport with the audience. Upon the formation of Jamiroquai, the group intended to focus on the use of live instruments within a big band in contrast to computers and synthesisers. In response to criticism towards the group being retro or being funk , songwriter and keyboardist Toby Smith said thats what it sounds like when 10 musicians play live.     Jamiroquais sound is derived from various ": null
    },
    {
        "funk": "Funk"
    },
    {
        " influences from the ": null
    },
    {
        "1970s": "1970Sinmusicr & Bandurban"
    },
    {
        ", and Britain’s mid-80s rare-groove scene .  Kay was influenced by ": null
    },
    {
        "Sly Stone": "Sly Stone"
    },
    {
        ", ": null
    },
    {
        "Gil Scott-Heron": "Gil Scott-Heron"
    },
    {
        ", ": null
    },
    {
        "Roy Ayers": "Roy Ayers"
    },
    {
        ", and ": null
    },
    {
        "hip-hop": "Hip-Hop"
    },
    {
        " and its culture. A 2003 compilation titled  Late Night Tales: Jamiroquai  under ": null
    },
    {
        "Azuli Records": "Azuli Records"
    },
    {
        ", contains a selection of the bands ": null
    },
    {
        "soul": "Soul Music"
    },
    {
        ", funk and disco influences.  In an ": null
    },
    {
        "AllMusic": "Allmusic"
    },
    {
        " review for  Dynamite  , the album was described as having a grab bag aesthetic that collects sounds from ": null
    },
    {
        "Chic": "Chic"
    },
    {
        " and ": null
    },
    {
        "Parliament": "Parliament"
    },
    {
        " as ": null
    },
    {
        "Kajagoogoo": "Kajagoogoo"
    },
    {
        ", the ": null
    },
    {
        "Police": "The Police"
    },
    {
        ", and ": null
    },
    {
        "Terry Callier": "Terry Callier"
    },
    {
        ".  Kay said that the influences for Rock Dust Light Star were ": null
    },
    {
        "Rod Stewart": "Rod Stewart"
    },
    {
        ", ": null
    },
    {
        "Roxy Music": "Roxy Music"
    },
    {
        ", ": null
    },
    {
        "Pink Floyd": "Pink Floyd"
    },
    {
        " and ": null
    },
    {
        "the Rolling Stones": "The Rolling Stones"
    },
    {
        " in their more rock/disco phase.  Kay expressed his desire to maintain a distinctive sound for the group whilst referencing his influences: If you just sample ": null
    },
    {
        "Barry White": "Barry White"
    },
    {
        " or Sly Stone, that’s one thing; to get their spirit is different.          Jamiroquais lyrics have occasionally dealt with socially idealistic themes.  Emergency on Planet Earth  revolved around environmental awareness, while  The Return of the Space Cowboy  contained themes of homelessness, Native American rights and slavery. The central idea of  Automaton  was according to Kay: the rise of artificial intelligence and technology to forget the more pleasant, simple and eloquent things in life and in our environment including our relationship with one another as human beings.      However, critics accused the band of not staying true to their lyrical values; with arguments that the group focused more on boy-girl seductions and having fun instead of making social and environmental change,  and that Kays interest in sports cars went against their ecological themes. Larkin pp. 1985–1987 Kay said in an interview with  Muzik , that he was initially reluctant to release  Travelling Without Moving  as it adopted a motorcar concept, but added: just because I love to drive a fast car, that doesnt mean I believe in  He additionally stated in 1999 interview that after a while you realise that people wont boogie and dance to          Kay stated that the groups visual aesthetics are important. He assumes creative control over the groups music videos, such as editing, performing his own stunts and ensuring that they good after 10–15 years .  Called icons of the music-video format by Spencer Kornhaber from  The Atlantic ,  the group are especially known for their ": null
    },
    {
        "music video of Virtual Insanity ": "Virtual Insanitymusic Video"
    },
    {
        ", directed by ": null
    },
    {
        "Jonathan Glazer": "Jonathan Glazer"
    },
    {
        ". In the video, Kay: performed in a room where the floors, walls and furniture all moved simultaneously.      The bands frontman, Jay Kay, has worn various elaborate head-gear.  In a 1993 interview with  Melody Maker , he said that wearing head-gear gives him a spiritual power that the Iroquois called ": null
    },
    {
        "orenda": "Orenda"
    },
    {
        " and if isnt really going for it, Ill tug the hat down and come on all militant. The illuminating helmet that appears in the video for ": null
    },
    {
        "Automaton": "Automaton"
    },
    {
        " was designed by ": null
    },
    {
        "Moritz Waldemeyer": "Moritz Waldemeyer"
    },
    {
        " for Kay to control its lights and movements and to portray him as an endangered species .  He additionally wore Native American head-dresses, in which he had been accused of cultural appropriation.             Jamiroquai were a prominent component within the London-based funk/acid-jazz movement of the 1990s. Price III; Kernodle; Maxille pp. 480–481 They were the third best-selling UK act of the decade, after the ": null
    },
    {
        "Spice Girls": "Spice Girls"
    },
    {
        " and ": null
    },
    {
        "Oasis": "Oasis"
    },
    {
        ". As of February 2017, the group has sold more than 26 million albums worldwide.  Despite finding popularity in the UK with high-charting albums, in the US, the band faced declining record sales and an inability to keep their cultural relevance.  They sold 4.4 million albums in the UK and had US sales of 2.5 million copies sold as of 2010.  The group has had four albums that reached number 1 in the UK and three albums that entered the ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        " chart in the US. Among their albums included  Travelling Without Moving , which entered the ": null
    },
    {
        "Guinness World Records": "Guinness World Records"
    },
    {
        " as the best-selling funk album in history. Footman, Tim; Young, Mark C.; p.163 Front-man Kay was given a ": null
    },
    {
        "BMI Presidents Award": "Broadcast Music, Inc."
    },
    {
        ", in recognition of his profound influence on songwriting within the music industry. Artists who cite the group as an influence include ": null
    },
    {
        "Tyler, the Creator": "Tyler, The Creator"
    },
    {
        ",  ": null
    },
    {
        "Chance the Rapper": "Chance The Rapper"
    },
    {
        ",  ": null
    },
    {
        "Pharrell Williams": "Pharrell Williams"
    },
    {
        ", ": null
    },
    {
        "Anderson .Paak": "Anderson Paak"
    },
    {
        ",  ": null
    },
    {
        "SZA": "Sza"
    },
    {
        ",  ": null
    },
    {
        "Kamaal Williams": "Kamaal Williams"
    },
    {
        ",  and ": null
    },
    {
        "Calvin Harris": "Calvin Harris"
    },
    {
        ",  who had also remixed the groups material.          Emergency on Planet Earth     The Return of the Space Cowboy     Travelling Without Moving     Synkronized     A Funk Odyssey     Dynamite     Rock Dust Light Star     Automaton          ;Current members   ": null
    },
    {
        "Jay Kay": "Jay Kay"
    },
    {
        " – lead vocals   Derrick McKenzie – drums   Sola Akingbola – percussion   Rob Harris – guitar   ": null
    },
    {
        "Matt Johnson": "Matt Johnson"
    },
    {
        " – keyboards   ": null
    },
    {
        "Paul Turner": "Paul Turner"
    },
    {
        " – bass   Nate Williams – keyboards, guitar, backing vocals 1992–199319921992–2002; died 2017 1993-1998 ": null
    }
]