[
    {
        "        Jean-Michel Basquiat  was an American artist of ": null
    },
    {
        "Haitian": "Haitian Americans"
    },
    {
        " and ": null
    },
    {
        "Puerto Rican": "Puerto Ricans"
    },
    {
        " descent. Basquiat first achieved fame as part of ": null
    },
    {
        "SAMO": "Samo"
    },
    {
        ", an informal ": null
    },
    {
        "graffiti": "Graffiti"
    },
    {
        " duo who wrote enigmatic ": null
    },
    {
        "epigrams": "Epigram"
    },
    {
        " in the cultural hotbed of the ": null
    },
    {
        "Lower East Side": "Lower East Side"
    },
    {
        " of ": null
    },
    {
        "Manhattan": "Manhattan"
    },
    {
        " during the late 1970s, where ": null
    },
    {
        "rap": "Rap"
    },
    {
        ", ": null
    },
    {
        "punk": "Punk Visual Art"
    },
    {
        ", and ": null
    },
    {
        "street art": "Street Art"
    },
    {
        " coalesced into early ": null
    },
    {
        "hip-hop music": "Hip-Hop Music"
    },
    {
        " culture. By the 1980s, his ": null
    },
    {
        "neo-expressionist": "Neo-Expressionism"
    },
    {
        " paintings were being exhibited in galleries and museums internationally. The ": null
    },
    {
        "Whitney Museum of American Art": "Whitney Museum Of American Art"
    },
    {
        " held a retrospective of his art in 1992.     Basquiats art focused on dichotomies such as wealth versus poverty, integration versus segregation, and inner versus outer experience. He ": null
    },
    {
        "appropriated": "Appropriation"
    },
    {
        " poetry, drawing, and painting, and married text and image, ": null
    },
    {
        "abstraction": "Abstract Art"
    },
    {
        ", ": null
    },
    {
        "figuration": "Figurative Art"
    },
    {
        ", and historical information mixed with contemporary critique.     Basquiat used ": null
    },
    {
        "social commentary": "Social Commentary"
    },
    {
        " in his paintings as a tool for introspection and for identifying with his experiences in the black community of his time, as well as attacks on ": null
    },
    {
        "power structures": "Power"
    },
    {
        " and systems of racism. Basquiats visual poetics were acutely ": null
    },
    {
        "political": "Political Criticism"
    },
    {
        " and direct in their criticism of ": null
    },
    {
        "colonialism": "Colonialism"
    },
    {
        " and support for ": null
    },
    {
        "class struggle": "Class Conflict"
    },
    {
        ". He died of a ": null
    },
    {
        "heroin overdose": "Opioid Overdose"
    },
    {
        " at his art studio at the age of 27. On May 18, 2017, at a ": null
    },
    {
        "Sothebys": "Sothebys"
    },
    {
        " auction, a 1982 painting by Basquiat depicting a black skull with red and black rivulets  set a new record high for any American artist at auction, selling for $110.5 million. Basquiats art has inspired many in the ": null
    },
    {
        "hip hop music": "Hip Hop Music"
    },
    {
        " community such as Jay-Z.         Jean-Michel Basquiat was born in ": null
    },
    {
        "Brooklyn": "Brooklyn"
    },
    {
        ", New York, on December 22, 1960, shortly after the death of his older brother, Max. He was the second of four children of Matilde Basquiat  , Lodge Communications 185, Harry S Truman Lodge No.1066, ": null
    },
    {
        "F. & A.M.": "F. & A.M."
    },
    {
        ", December 4, 2008. New York, New York. Sad Tidings for Brother John Andrades. and Gérard Basquiat .   by James Fanelli, September 5, 2013, 6:27am.  by  The New York Times  . He had two younger sisters: Lisane, born in 1964, and Jeanine, born in 1967.      His father, Gérard Basquiat, was born in ": null
    },
    {
        "Port-au-Prince": "Port-Au-Prince"
    },
    {
        ", Haiti, and his mother, Matilde Basquiat, who was of Puerto Rican descent, was born in ": null
    },
    {
        "Brooklyn": "Brooklyn"
    },
    {
        ", New York. Matilde instilled a love for art in her young son by taking him to art museums in Manhattan and enrolling him as a junior member of the ": null
    },
    {
        "Brooklyn Museum of Art": "Brooklyn Museum"
    },
    {
        ".  Basquiat was a precocious child who learned how to read and write by the age of four and was a gifted artist. His teachers, including artist José Machado, noticed his artistic abilities, and his mother encouraged her sons artistic talent. By the age of 11, Basquiat was fully fluent in French, Spanish and English. In 1967, Basquiat started attending ": null
    },
    {
        "Saint Anns School": "Saint Anns School"
    },
    {
        ", an arts-oriented exclusive private school. Phoebe Hoban,  The New York Times Arthur C. Danto,  The Nation Lisa J. Curtis,  Brooklyn Paper There he met his friend Marc Prozzo; together they created a childrens book, written by Basquiat and illustrated by Prozzo. Basquiat became an avid reader of Spanish, French, and English texts and a good athlete, competing in track events.     In September 1968, at the age of seven, Basquiat was hit by a car while playing in the street. His arm was broken and he suffered several internal injuries; he eventually underwent a ": null
    },
    {
        "splenectomy": "Splenectomy"
    },
    {
        ".  While he was recuperating from his injuries, his mother brought him a copy of  Grays Anatomy  to keep him occupied. This book would prove to be influential in his future artistic outlook. His parents separated that year and he and his sisters were raised by their father.   by Lindsay Pollock . The family resided in ": null
    },
    {
        "Boerum Hill": "Boerum Hill"
    },
    {
        ", Brooklyn, for five years, then moved to ": null
    },
    {
        "San Juan, Puerto Rico": "San Juan, Puerto Rico"
    },
    {
        ", in 1974, where Basquiat studied at Saint Johns School in ": null
    },
    {
        "Condado": "Condado"
    },
    {
        ". After two years, they returned to New York City.       When he was 13, his mother was committed to a mental institution and thereafter spent her life in and out of institutions. Fretz, Eric.  . Greenwood Press, 2010. . Cf.  Due to his mothers instability and family unrest, at 15 Basquiat ran away from home.  He slept on park benches in ": null
    },
    {
        "Tompkins Square Park": "Tompkins Square Park"
    },
    {
        ", and was arrested and returned to the care of his father within a week.  Basquiat dropped out of ": null
    },
    {
        "Edward R. Murrow High School": "Edward R. Murrow High School"
    },
    {
        " in the 10th grade at the age of 17 and then attended ": null
    },
    {
        "City-As-School": "City-As-School"
    },
    {
        ", an alternative high school in Manhattan, home to many artistic students who failed at conventional schooling. His father banished him from the household for dropping out of high school and Basquiat stayed with friends in Brooklyn. He supported himself by selling T-shirts and homemade post cards.        Basquiats transition from being homeless and unemployed to becoming a prosperous artist took place in a short space of time. By 1980, he would be selling a single painting for up to $25,000.  In 1976, Basquiat and his friend Al Diaz began spray painting ": null
    },
    {
        "graffiti": "Graffiti"
    },
    {
        " on buildings in ": null
    },
    {
        "Lower Manhattan": "Lower Manhattan"
    },
    {
        ", working under the pseudonym ": null
    },
    {
        "SAMO": "Samo"
    },
    {
        ". The designs featured inscribed messages within his Untitled works such as Plush safe he think... SAMO and SAMO as an escape clause . In 1978, Basquiat worked for the Unique Clothing Warehouse in their art department at 718 Broadway in ": null
    },
    {
        "NoHo": "Noho, Manhattan"
    },
    {
        ", and at night he continued using the pseudonym SAMO , painting his original graffiti  art on neighborhood buildings. Uniques founder Harvey Russack discovered Basquiat painting a building one night, they became friends, and he offered him a day job. On December 11, 1978,  The Village Voice  published an article about the graffiti. Faflick, Philip. The SAMO Graffiti ... Boosh-Wah or CIA? Village Voice, December 11, 1978: p. 41. When Basquiat and Diaz ended their friendship, the SAMO project ended with the epitaph SAMO IS DEAD , inscribed on the walls of ": null
    },
    {
        "SoHo": "Soho, Manhattan"
    },
    {
        " buildings in 1979. Cf. Fretz, pp. 46–47.        In 1979, Basquiat appeared on the live ": null
    },
    {
        "public-access television": "Public-Access Television"
    },
    {
        " show  TV Party  hosted by ": null
    },
    {
        "Glenn OBrien": "Glenn Obrien"
    },
    {
        ", and the two started a friendship. Basquiat made regular appearances on the show over the next few years. That same year, Basquiat formed the ": null
    },
    {
        "noise rock": "Noise Rock"
    },
    {
        " band Test Pattern – which was later renamed Gray – which played at ": null
    },
    {
        "Arleen Schlosss": "Arleen Schloss"
    },
    {
        " open space, Wednesdays at As .  In October 1979, at the same club, Basquiat showed his SAMO montages using color Xerox copies of his works.     Other members of Gray included Shannon Dawson, ": null
    },
    {
        "Michael Holman": "Michael Holman"
    },
    {
        ", Nick Taylor, Wayne Clifford and ": null
    },
    {
        "Vincent Gallo": "Vincent Gallo"
    },
    {
        ", and the band performed at nightclubs such as ": null
    },
    {
        "Maxs Kansas City": "Maxs Kansas City"
    },
    {
        ", ": null
    },
    {
        "CBGB": "Cbgb"
    },
    {
        ", ": null
    },
    {
        "Hurrah": "Hurrah"
    },
    {
        " and the ": null
    },
    {
        "Mudd Club": "Mudd Club"
    },
    {
        ". In 1980, Basquiat starred in OBriens ": null
    },
    {
        "independent film": "Independent Film"
    },
    {
        "  Downtown 81 , originally titled New York Beat. That same year, Basquiat met ": null
    },
    {
        "Andy Warhol": "Andy Warhol"
    },
    {
        " at a restaurant. Basquiat presented to Warhol samples of his work, and Warhol was stunned by Basquiats mystique and allure.  Jean-Michel Basquiat: The Radiant Child , directed by ": null
    },
    {
        "Tamra Davis": "Tamra Davis"
    },
    {
        " . The two artists later collaborated. Downtown 81 featured some of Grays recordings on its soundtrack.  Andy Kellman. Downtown 81 Original Soundtrack. Retrieved January 16, 2008. Basquiat also appeared in the 1981 ": null
    },
    {
        "Blondie": "Blondie"
    },
    {
        " music video ": null
    },
    {
        "Rapture": "Rapture"
    },
    {
        ", in a role originally intended for ": null
    },
    {
        "Grandmaster Flash": "Grandmaster Flash"
    },
    {
        ",  on  Pop-Up Video . as a nightclub disc jockey.          During the early 1980s, Basquiat made his breakthrough as a solo artist. In June 1980, Basquiat participated in The Times Square Show, a multi-artist exhibition sponsored by ": null
    },
    {
        "Collaborative Projects Incorporated": "Colab"
    },
    {
        " and ": null
    },
    {
        "Fashion Moda": "Fashion Moda"
    },
    {
        " where he was noticed by various critics and curators. In particular Emilio Mazzoli, an Italian gallerist, saw the exhibition and invited Basquiat to Modena to have his world first solo show, that opened on May 23, 1981. In December 1981, ": null
    },
    {
        "Rene Ricard": "Rene Ricard"
    },
    {
        " published The Radiant Child in  Artforum  magazine.   At this time, Basquiat painted many pieces on found objects, such as discarded doors.     In March 1982, he painted in ": null
    },
    {
        "Modena": "Modena"
    },
    {
        ", Italy, for his second Italian exhibition. Starting in November, Basquiat worked from the ground-floor display and studio space ": null
    },
    {
        "Larry Gagosian": "Larry Gagosian"
    },
    {
        " had built below his ": null
    },
    {
        "Venice": "Venice, California"
    },
    {
        ", California home. There, Basquiat commenced a series of paintings for a 1983 show, his second at ": null
    },
    {
        "Gagosian Gallery": "Gagosian Gallery"
    },
    {
        " which was then in West Hollywood. Fred Hoffman ,   Los Angeles Times . He brought along his girlfriend, then-unknown aspiring singer ": null
    },
    {
        "Madonna": "Madonna"
    },
    {
        ".  Gagosian recalls, Everything was going along fine. Jean-Michel was making paintings, I was selling them, and we were having a lot of fun. But then one day Jean-Michel said, My girlfriend is coming to stay with me. I was a little concerned–one too many eggs can spoil an omelet, you know? So I said, Well, whats she like? And he said, Her name is Madonna and shes going to be huge. Ill never forget that he said that. So Madonna came out and stayed for a few months and we all got along like one big, happy family.  During this time, Basquiat took considerable interest in the work that ": null
    },
    {
        "Robert Rauschenberg": "Robert Rauschenberg"
    },
    {
        " was producing at ": null
    },
    {
        "Gemini G.E.L.": "Gemini G.E.L."
    },
    {
        " in West Hollywood, visiting him on several occasions and finding inspiration in the accomplishments of the painter.        In late 1981, Basquiat met Annina Nosei with his first exhibition in her gallery in a group show called Public Address with ": null
    },
    {
        "Keith Haring": "Keith Haring"
    },
    {
        " and ": null
    },
    {
        "Barbara Kruger": "Barbara Kruger"
    },
    {
        " among others, and he joined the Annina Nosei gallery and worked in a basement below the gallery toward his first American one-man show from March 6 to April 1, 1982.  At the time, and while dating others, Basquiat was living with his girlfriend , Suzanne Mallouk, who later specifically described his ": null
    },
    {
        "sexuality": "Sexual Orientation"
    },
    {
        " in ": null
    },
    {
        "Jennifer Clements": "Jennifer Clement"
    },
    {
        " book, Widow Basquiat, as: ... not monochromatic. It did not rely on visual stimulation, such as a pretty girl. It was a very rich multichromatic sexuality. He was attracted to people for all different reasons. They could be boys, girls, thin, fat, pretty, ugly. It was, I think, driven by intelligence. He was attracted to intelligence more than anything and to pain.      In 1983, Basquiat produced a ": null
    },
    {
        "12-inch": "12-Inch Single"
    },
    {
        " rap": "Rapping"
    },
    {
        " single featuring ": null
    },
    {
        "hip-hop": "Hip Hop Music"
    },
    {
        " artists ": null
    },
    {
        "Rammellzee": "Rammellzee"
    },
    {
        " and ": null
    },
    {
        "K-Rob": "K-Rob"
    },
    {
        ". Billed as Rammellzee vs. K-Rob, the single contained two versions of the same track: ": null
    },
    {
        "Beat Bop": "Beat Bop"
    },
    {
        " on the A-side with vocals, with the B-side adding an instrumental version.  The single was pressed in limited quantities on the one-off Tartown Record Company label. The singles cover featured Basquiats artwork, making the pressing highly desirable among both record and art collectors. A large number of photographs depict a 2-3 year collaboration between Warhol and Basquiat from 1983 and 1985 which included Olympic Rings , in which Warhol made some Olympic five-ring symbols rendered in the original primary colors and which Basquiat stylized with his graffiti style.  ": null
    },
    {
        "Gagosian Gallery": "Gagosian Gallery"
    },
    {
        ", London. Basquiat often painted in expensive ": null
    },
    {
        "Armani": "Armani"
    },
    {
        " suits; and he would even appear in public in the same paint-splattered clothes.  , Haworth Press, 2004, p. 299.           By 1986, Basquiat had left the Annina Nosei gallery and was showing at the ": null
    },
    {
        "Mary Boone": "Mary Boone"
    },
    {
        " gallery in SoHo. On February 10, 1985, he appeared on the cover of  The New York Times Magazine  in a feature titled New Art, New Money: The Marketing of an American Artist . Cathleen McGuigan, New Art, New Money , The New York Times Magazine, February 2005. In spite of his artistic success in this period, his emotional instability continued to haunt him and caused him to begin to use heroin frequently. Many of his peers speculated that his heroin use was a means of coping with the demands of his newfound fame, the exploitative nature of the art industry, and the pressures of being a black man in the white-dominated art world. Michael Wines, , The New York Times, August 27, 1988     Following his return from a trip to Hawaii in the last year of his life, Keith Haring reports meeting with Basquiat who was glad to tell Haring that he had finally kicked his dependence on drugs. Jean Michel Basquiat. Taschen Press . Page 440. Despite attempts at sobriety, he died on August 12, 1988, of a ": null
    },
    {
        "heroin overdose": "Opioid Overdose"
    },
    {
        " at his art studio on ": null
    },
    {
        "Great Jones Street": "Great Jones Street"
    },
    {
        " in Manhattans ": null
    },
    {
        "NoHo": "Noho, Manhattan"
    },
    {
        " neighborhood.    He was ": null
    },
    {
        "27 years old": "27 Club"
    },
    {
        ".      Basquiat was interred in Brooklyns ": null
    },
    {
        "Green-Wood Cemetery": "Green-Wood Cemetery"
    },
    {
        ", where ": null
    },
    {
        "Jeffrey Deitch": "Jeffrey Deitch"
    },
    {
        " made a graveside speech. Among those speaking at Basquiats memorial held at Saint Peters Church on November 3, 1988, was Ingrid Sischy who, as the editor of  Artforum  in the 1980s, got to know the artist well and commissioned a number of articles that introduced his work to the wider world.  Suzanne Mallouk recited sections of ": null
    },
    {
        "A. R. Pencks": "A. R. Penck"
    },
    {
        " Poem for Basquiat and ": null
    },
    {
        "Fab 5 Freddy": "Fab 5 Freddy"
    },
    {
        " read a poem by ": null
    },
    {
        "Langston Hughes": "Langston Hughes"
    },
    {
        ".   The New York Times  Books. The 300 guests included musicians ": null
    },
    {
        "John Lurie": "John Lurie"
    },
    {
        " and ": null
    },
    {
        "Arto Lindsay": "Arto Lindsay"
    },
    {
        "; artist ": null
    },
    {
        "Keith Haring": "Keith Haring"
    },
    {
        "; poet ": null
    },
    {
        "David Shapiro": "David Shapiro"
    },
    {
        "; ": null
    },
    {
        "Glenn OBrien": "Glenn Obrien"
    },
    {
        ", a writer; Fab 5 Freddy; and members of the band Gray, which Basquiat led in the late 1970s.  In memory of the late artist, Keith Haring created Pile of Crowns for Jean-Michel Basquiat .  In his memorial words for Basquiat, Haring stated: He truly created a lifetime of works in ten years. Greedily, we wonder what else he might have created, what masterpieces we have been cheated out of by his death, but the fact is that he has created enough work to intrigue generations to come. Only now will people begin to understand the magnitude of his contribution .            According to ": null
    },
    {
        "Franklin Sirmans": "Franklin Sirmans"
    },
    {
        ", Basquiat ": null
    },
    {
        "appropriated": "Appropriation"
    },
    {
        " poetry, drawing, and painting, and married text and image, ": null
    },
    {
        "abstraction": "Abstract Art"
    },
    {
        ", ": null
    },
    {
        "figuration": "Figurative Art"
    },
    {
        ", and historical information mixed with contemporary critique. Sirmans, Franklin. In the Cipher: Basquiat and Hip Hop Culture from the book Basquiat. Mayer, Marc . Merrell Publishers in association with the Brooklyn Museum, , pp. 91–105. Fred Hoffman hypothesizes that underlying Basquiats self-identification as an artist was his innate capacity to function as something like an ": null
    },
    {
        "oracle": "Oracle"
    },
    {
        ", distilling his perceptions of the outside world down to their essence and, in turn, projecting them outward through his creative acts. Additionally, continuing his activities as a graffiti artist, Basquiat often incorporated words into his paintings. Before his career as a painter began, he produced punk-inspired postcards for sale on the street, and became known for the political–poetical graffiti under the name of ": null
    },
    {
        "SAMO": "Samo"
    },
    {
        ". On one occasion Basquiat painted his girlfriends dress with the words Little Shit Brown . He would often draw on random objects and surfaces, including other peoples property. The conjunction of various media is an integral element of Basquiats art. His paintings are typically covered with text and codes of all kinds: words, letters, numerals, pictograms, logos, map symbols, diagrams and more.      Basquiats art focused on recurrent suggestive dichotomies , such as wealth versus poverty, integration versus segregation, and inner versus outer experience. Hoffman, Fred. The Defining Years: Notes on Five Key Works from the book Basquiat. Mayer, Marc . Merrell Publishers in association with the Brooklyn Museum, , pp. 129–139. A middle period from late 1982 to 1985 featured multi-panel paintings and individual canvases with exposed stretcher bars, the surface dense with writing, collage and imagery. The years 1984–85 were also the main period of the Basquiat–Warhol collaborations, even if, in general, they were not very well received by the critics. A major reference source used by Basquiat throughout his career was the book  Grays Anatomy , which his mother had given him while he was in the hospital aged seven. It remained influential in his depictions of internal human anatomy, and in its mixture of image and text. Other major sources were Henry Dreyfuss Symbol Sourcebook, ": null
    },
    {
        "Leonardo da Vincis": "Leonardo Da Vinci"
    },
    {
        " notebooks, and Burchard Brentjes African Rock Art.       A prominent theme in the early Basquiat portrayed historically prominent black figures, such as ": null
    },
    {
        "Charlie Parker": "Charlie Parker"
    },
    {
        ", who were identified by Basquiat as black heroes and saints. These were often identified with the iconographic depiction of crowns and halos to distinguish heroes and saints in Basquiats specially chosen pantheon. As the Art Daily described Basquiats show in the Bilbao Guggenheim: The show is divided into eight different sections on the Museums third floor and begins in Gallery 305, where his earliest creations are displayed under two themes: “Street as Studio” and “Heroes and Saints”. The urban landscape inspired the subject matter, approach, and materials used in these pieces . Art Daily. Jean-Michel Basquiat: Nows the Time on view at the Guggenheim Museum Bilbao.             In his short career, Basquiat produced around 1500 ": null
    },
    {
        "drawings": "Drawing"
    },
    {
        ", as well as around 600 paintings and many sculpture and mixed media works. Basquiat drew constantly, and often used objects around him as surfaces when paper was not immediately at hand.   Since childhood, Basquiat produced cartoon-inspired drawings when encouraged by his mothers interest in art, and drawing became a part of his expression as an artist.  Basquiats drawings were produced in many different media, most commonly ink, pencil, felt-tip or marker, and oil-stick. Basquiat sometimes used ": null
    },
    {
        "Xerox": "Xerox Art"
    },
    {
        " copies of fragments of his drawings to paste on to the canvas of larger paintings.      The first public showing of Basquiats paintings and drawings was in 1981: New York/New Wave, at ": null
    },
    {
        "PS1": "Ps1 Contemporary Art Center"
    },
    {
        " in Long Island City, brought together by ": null
    },
    {
        "Mudd Club": "Mudd Club"
    },
    {
        " co-founder and curator ": null
    },
    {
        "Diego Cortez": "Diego Cortez"
    },
    {
        ". It was a group show that included pieces by ": null
    },
    {
        "William Burroughs": "William S. Burroughs"
    },
    {
        ", ": null
    },
    {
        "David Byrne": "David Byrne"
    },
    {
        ", ": null
    },
    {
        "Keith Haring": "Keith Haring"
    },
    {
        ", ": null
    },
    {
        "Nan Goldin": "Nan Goldin"
    },
    {
        " and ": null
    },
    {
        "Robert Mapplethorpe": "Robert Mapplethorpe"
    },
    {
        ".   The article in Artforum magazine entitled Radiant Child written by ": null
    },
    {
        "Rene Ricard": "Rene Ricard"
    },
    {
        " after seeing the show at PS1, brought Basquiat to the attention of the art world.  In 1984 Basquiat immortalised Ricard in two drawings, Untitled  and Rene Ricard,  representing the tension that existed between them.     A poet as well as an artist, words featured heavily in his drawings and paintings, with direct references to racism, slavery, the people and street scene of 1980s New York including other artists, and black historical figures, musicians and sports stars, as his notebooks and many important drawings demonstrate.   Often Basquiats drawings were untitled, and as such to differentiate works a word written within the drawing is commonly in parentheses after Untitled, such as with Untitled . After Basquiat died of an overdose at the age of 27, his estate was controlled by his father Gérard Basquiat, who also oversaw the committee which authenticated artworks, and operated from 1993 to 2012 to review over 1000 works, the majority of which were drawings.               Heads and skulls are seen as significant focal points of many of Basquiats most seminal works. Two pieces, Untitled   and Untitled ,  held by the ": null
    },
    {
        "Broad Foundation": "Broad Foundation"
    },
    {
        " and ": null
    },
    {
        "Maezawa Foundation": "Yusaku Maezawa"
    },
    {
        ", respectively, can be seen as primary examples. In reference to the potent image depicted in both pieces, Fred Hoffman writes that Basquiat was likely, caught off guard, possibly even frightened, by the power and energy emanating from this unexpected image. Further investigation by Fred Hoffman of pieces like Masonic Lodge 1983 and Untitled in his book The Art of Jean-Michel Basquiat reveals a deeper interest in the artists fascination with heads that proves an evolution in the artists oeuvre from one of raw power to one of more refined cognizance. Hoffman, Fred. The Art of Jean-Michel Basquiat, Gallerie Enrico Navarra / 2017            According to Andrea Frohne, Basquiats painting Untitled  reclaims Egyptians as African and subverts the concept of ancient Egypt as the cradle of Western Civilization .   At the center of the painting, Basquiat depicts an Egyptian boat being guided down the ": null
    },
    {
        "Nile River": "Nile"
    },
    {
        " by ": null
    },
    {
        "Osiris": "Osiris"
    },
    {
        ", the Egyptian god of the earth and vegetation.  On the right panel of the painting appear the words Esclave, Slave, Esclave . Two letters of the word Nile are crossed out and Frohne suggests that, The letters that are wiped out and scribbled over perhaps reflect the acts of historians who have conveniently forgotten that Egyptians were black and blacks were enslaved.  On the left panel of the painting Basquiat has illustrated two ": null
    },
    {
        "Nubia": "Nubia"
    },
    {
        "n-style masks. The ": null
    },
    {
        "Nubians": "Nubian People"
    },
    {
        " historically were darker in skin color, and were considered to be slaves by the Egyptian people.  Throughout the rest of the painting, images of the ": null
    },
    {
        "Atlantic slave trade": "Atlantic Slave Trade"
    },
    {
        " are juxtaposed alongside images of the ": null
    },
    {
        "Egyptian slave trade": "Slavery In Ancient Egypt"
    },
    {
        " centuries before.  The sickle in the center panel is a direct reference to the slave trade in the United States, and slave labor under the plantation system. The word salt that appears on the right panel of the work refers to the Atlantic slave trade, as salt was another important commodity traded at that time.      Another of Basquiats pieces, Irony of Negro Policeman , is intended to illustrate how he believes African-Americans have been controlled by a predominantly ": null
    },
    {
        "Caucasian": "Caucasian Race"
    },
    {
        " society. Basquiat sought to portray that African-Americans have become complicit with the institutionalized forms of whiteness and corrupt white regimes of power years after the ": null
    },
    {
        "Jim Crow era": "Jim Crow Laws"
    },
    {
        " had ended.  This concept has been reiterated in additional Basquiat works, including his titled . However Basquiat found the idea of the “negro policeman” specifically ironic. The hat that frames the head of the Negro policeman resembles a cage, and represents what Basquiat believes are the constrained independent perceptions of African Americans at the time, and how constrained the policemans own perceptions were within white society. Basquiat drew upon his Haitian heritage by painting a hat that resembles the top hat associated with the  family of , who embody the powers of death in ": null
    },
    {
        "Vodou": "Haitian Vodou"
    },
    {
        ".   However, Kellie Jones, in her essay Lost in Translation: Jean-Michel in the Mix, posits that Basquiats mischievous, complex, and ": null
    },
    {
        "neologistic": "Neologism"
    },
    {
        " side, with regard to the fashioning of modernity and the influence and effluence of black culture are often elided by critics and viewers, and thus lost in translation. Lost in Translation: Jean-Michel in the Mix, by Kellie Jones, from the book Basquiat, edited by Marc Mayer, 2005, Merrell Publishers in association with the Brooklyn Museum, , pp. 163–179. The art historian ": null
    },
    {
        "Olivier Berggruen": "Olivier Berggruen"
    },
    {
        " situates in Basquiats anatomical screen prints, titled Anatomy, an assertion of vulnerability, one which creates an aesthetic of the body as damaged, scarred, fragmented, incomplete, or torn apart, once the organic whole has disappeared. Paradoxically, it is the very act of creating these representations that conjures a positive corporeal valence between the artist and his sense of self or identity.          Traditionally, the interpretation of Basquiats works at the visual level comes from the subdued emotional tone of what they represent compared to what is actually depicted. For example, the figures in his paintings, as stated by ": null
    },
    {
        "Stephen Metcalf": "Stephen Metcalf"
    },
    {
        ", are shown frontally, with little or no depth of field, and nerves and organs are exposed, as in an anatomy textbook. Are these creatures dead and being clinically dissected, one wonders, or alive and in immense pain? Stephen Metcalf ,   The Atlantic . In a similar vein, Jordana Moore Saggese states the action represented in the paintings of Basquiat have been referred to as a tribute to jazz indicating that, Parker, Gillespie, and the other musicians of the bebop era infamously appropriated both the harmonic structures of jazz standards, using them as a structure for their own songs, and repeated similar note patterns across several improvisations. Jordana Moore Saggese ,   Khan Academy .     A second recurrent reference to Basquiats aesthetics comes from the artist intention to share, in the words of Niru Ratnum, a highly individualistic, expressive view of the world . Niru Ratnam ,   The Spectator . ": null
    },
    {
        "David Bowie": "David Bowie"
    },
    {
        ", a collector of Basquiats works, stated that He seemed to digest the frenetic flow of passing image and experience, put them through some kind of internal reorganization and dress the canvas with this resultant network of chance. Ekow eshun ,   Independent . Basquiat seems to invite us to, in the words of Luis Alberto Mejia Clavijo, paint like a child, dont paint what is on the surface... Finally every energy you drop is marking a territory, is a traffic sign, is directing and feeding spirits. What seems like a mess for some of us in the Cartesian logic, it is maybe a clear spiritual route for some others. Luis Alberto Mejia Clavijo ,   Contemporary Art Theory . Fred Hoffman stated that a painting from Basquiat typically shows the artists vitality and energy being continually challenged by life-draining organisms. Fred Hoffman ,   American Suburb X . Reviews about his work have been written on the direct relation of painting and graffiti. Regarding the relation between painting and graffiti, ": null
    },
    {
        "Olivia Laing": "Olivia Laing"
    },
    {
        " states: Words jumped out at him, from the back of cereal boxes or subway ads, and he stayed alert to their subversive properties, their double and hidden meaning. Olivia Laing ,   The Guardian .     In the words of the Marc Mayer essay Basquiat in History , Basquiat speaks articulately while dodging the full impact of clarity like a ": null
    },
    {
        "matador": "Torero"
    },
    {
        ". We can read his pictures without strenuous effort—the words, the images, the colors and the construction—but we cannot quite fathom the point they belabor. Keeping us in this state of half-knowing, of mystery-within-familiarity, had been the core technique of his brand of communication since his adolescent days as the graffiti poet SAMO. To enjoy them, we are not meant to analyze the pictures too carefully. Quantifying the encyclopedic breadth of his research certainly results in an interesting inventory, but the sum cannot adequately explain his pictures, which requires an effort outside the purview of ": null
    },
    {
        "iconography": "Iconography"
    },
    {
        " ... he painted a calculated incoherence, calibrating the mystery of what such apparently meaning-laden pictures might ultimately mean. Basquiat, edited by Marc Mayer, 2005, Merrell Publishers in association with the Brooklyn Museum, , p. 50.       Basquiats first public exhibition in June 1980 was in the group effort The Times Square Show , held in a vacant building at 41st Street and Seventh Avenue, New York. In late 1981, Basquiat joined the Annina Nosei gallery in SoHo; his first one-person exhibition was in 1982 at that gallery.  MoMA Collection, New York. By then, he was showing regularly alongside other Neo-expressionist artists including ": null
    },
    {
        "Julian Schnabel": "Julian Schnabel"
    },
    {
        ", ": null
    },
    {
        "David Salle": "David Salle"
    },
    {
        ", ": null
    },
    {
        "Francesco Clemente": "Francesco Clemente"
    },
    {
        " and ": null
    },
    {
        "Enzo Cucchi": "Enzo Cucchi"
    },
    {
        ". He was represented in Los Angeles by the Gagosian gallery and throughout Europe by ": null
    },
    {
        "Bruno Bischofberger": "Bruno Bischofberger"
    },
    {
        ".     Major exhibitions of Basquiats work have included Jean-Michel Basquiat: Paintings 1981–1984 at the ": null
    },
    {
        "Fruitmarket Gallery": "Fruitmarket Gallery"
    },
    {
        ", Edinburgh , which traveled to the ": null
    },
    {
        "Institute of Contemporary Arts": "Institute Of Contemporary Arts"
    },
    {
        ", London, and ": null
    },
    {
        "Museum Boijmans Van Beuningen": "Museum Boijmans Van Beuningen"
    },
    {
        ", Rotterdam, in 1985; the two exhibits at ": null
    },
    {
        "Kestnergesellschaft": "Kestnergesellschaft"
    },
    {
        ", Hannover . The first retrospective to be held of his work was the Jean-Michel Basquiat exhibition at the ": null
    },
    {
        "Whitney Museum of American Art": "Whitney Museum Of American Art"
    },
    {
        " from October 1992 to February 1993. It subsequently traveled to the ": null
    },
    {
        "Menil Collection": "Menil Collection"
    },
    {
        ", Houston; the ": null
    },
    {
        "Des Moines Art Center": "Des Moines Art Center"
    },
    {
        ", Iowa; and the ": null
    },
    {
        "Montgomery Museum of Fine Arts": "Montgomery Museum Of Fine Arts"
    },
    {
        ", Alabama, from 1993 to 1994. The catalog for this exhibition, Marshall, Richard. Jean-Michel Basquiat, Abrams / Whitney Museum of American Art, 1992 . was edited by Richard Marshall and included several essays of different perspectives. Another exhibition, Basquiat, was mounted by the ": null
    },
    {
        "Brooklyn Museum": "Brooklyn Museum"
    },
    {
        ", New York, in 2005, and traveled to the ": null
    },
    {
        "Museum of Contemporary Art, Los Angeles": "Museum Of Contemporary Art, Los Angeles"
    },
    {
        ", and the ": null
    },
    {
        "Museum of Fine Arts, Houston": "Museum Of Fine Arts, Houston"
    },
    {
        ". Mayer, Marc, Hoffman Fred, et al. Basquiat, Merrell Publishers / Brooklyn Museum, 2005. From October 2006 to January 2007, the first Basquiat exhibition in Puerto Rico took place at the Museo de Arte de Puerto Rico , produced by ": null
    },
    {
        "ArtPremium": "Artpremium"
    },
    {
        ", Corinne Timsit and Eric Bonici.     Basquait and the Bayou, a 2014 show presented by the ": null
    },
    {
        "Ogden Museum of Southern Art": "Ogden Museum Of Southern Art"
    },
    {
        " in New Orleans, focused on the artists works with themes of the American South.  ": null
    },
    {
        "Brooklyn Museum": "Brooklyn Museum"
    },
    {
        " exhibited Basquiat: The Unknown Notebooks in April–August 2015.  In 2017, the ": null
    },
    {
        "Barbican Centre": "Barbican Centre"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        " exhibited https://www.barbican.org.uk/whats-on/2017/event/basquiat-boom-for-real Basquiat: Boom for Real. Basquiat remains an important source of inspiration for a younger generation of contemporary artists all over the world such as ": null
    },
    {
        "Rita Ackermann": "Rita Ackermann"
    },
    {
        " and Kader Attia, as shown, for example, at the exhibition Street and Studio: From Basquiat to Séripop co-curated by ": null
    },
    {
        "Cathérine Hug": "Cathérine Hug"
    },
    {
        " and Thomas Mießgang and previously exhibited at ": null
    },
    {
        "Kunsthalle Wien": "Kunsthalle Wien"
    },
    {
        " in 2010.      The ": null
    },
    {
        "Brant Foundation": "Brant Foundation"
    },
    {
        " in its Art Study Center from March 6 to May 15, 2019 hosted an extensive exhibit of Basquiats works with free admission, where all tickets were claimed for its full six weeks in advance of the opening of the exhibit.   In June 2019, the ": null
    },
    {
        "Solomon R. Guggenheim Museum": "Solomon R. Guggenheim Museum"
    },
    {
        " in New York presents Basquiats Defacement : The Untold Story        In a review for  The Telegraph , critic ": null
    },
    {
        "Hilton Kramer": "Hilton Kramer"
    },
    {
        " begins his first paragraph by stating that Basquiat had no idea what the word quality meant. The criticisms to follow relentlessly label Basquiat as a talentless hustler and a street-smart but otherwise invincibly ignorant arguing that art dealers of the time were as ignorant about art as Basquiat himself. In saying that Jean-Michels work never rose above that lowly artistic station of graffiti even when his paintings were fetching enormous prices, Kramer argued that graffiti art acquired a cult status in certain New York art circles. Kramer further opined that As a result of the campaign waged by these art-world entrepreneurs on Basquiats behalf—and their own, of course—there was never any doubt that the museums, the collectors and the media would fall into line when talking about the marketization of Basquiats name.      According to Sirmans, Basquiats visual poetics were acutely ": null
    },
    {
        "political": "Political Criticism"
    },
    {
        " and direct in their criticism of ": null
    },
    {
        "colonialism": "Colonialism"
    },
    {
        " and support for ": null
    },
    {
        "class struggle": "Class Conflict"
    },
    {
        ". As reviewed by Hoffman, Basquiat used ": null
    },
    {
        "social commentary": "Social Commentary"
    },
    {
        " in his paintings as a springboard to deeper truths about the individual . Art critic Bonnie Rosenberg compares Basquiats work to the emergence of American Hip Hop during the same era. She also mentions how Basquiat experienced a good taste of fame in his last years when he was a critically embraced and popularly celebrated artistic phenomenon. Rosenberg remarked that some people focused on the superficial exoticism of his work missing the fact that it held important connections to expressive precursors.  Shortly after his death,  The New York Times  indicated that Basquiat was the most famous of only a small number of young black artists who have achieved national recognition.        Notable private collectors of Basquiats work include ": null
    },
    {
        "David Bowie": "David Bowie"
    },
    {
        ", Mera and Donald Rubell,  ": null
    },
    {
        "Lars Ulrich": "Lars Ulrich"
    },
    {
        ",  ": null
    },
    {
        "Steven A. Cohen": "Steven A. Cohen"
    },
    {
        ", ": null
    },
    {
        "Laurence Graff": "Laurence Graff"
    },
    {
        ", ": null
    },
    {
        "John McEnroe": "John Mcenroe"
    },
    {
        ", ": null
    },
    {
        "Madonna": "Madonna"
    },
    {
        ", ": null
    },
    {
        "Debbie Harry": "Debbie Harry"
    },
    {
        ", ": null
    },
    {
        "Leonardo DiCaprio": "Leonardo Dicaprio"
    },
    {
        ",  ": null
    },
    {
        "Swizz Beatz": "Swizz Beatz"
    },
    {
        ",  ": null
    },
    {
        "Jay-Z": "Jay-Z"
    },
    {
        ",  and ": null
    },
    {
        "Johnny Depp": "Johnny Depp"
    },
    {
        ". France, Lisa Respers . . CNN.com. Retrieved June 11, 2016. Basquiat sold his first painting in 1981, and by 1982, spurred by the ": null
    },
    {
        "Neo-Expressionist": "Neo-Expressionist"
    },
    {
        " art boom, his work was in great demand. Basquiat was on the cover of  The New York Times Magazine  in 1985 which was unprecedented for any young African-American artist. Since Basquiats death in 1988, the market for his work has developed steadily—in line with overall art market trends—with a dramatic peak in 2007 when, at the height of the art market boom, the global auction volume for his work was over $115 million. Brett Gorvy, deputy chairman of Christies, is quoted describing Basquiats market as two-tiered. ... The most coveted material is rare, generally dating from the best period, 1981–83. Georgina Adam and Gareth Harris ,   The Art Newspaper .      In 2001 New York artist and con-artist Alfredo Martinez was charged by the Federal Bureau of Investigation with attempting to deceive two art dealers by selling them $185,000 worth of fake Basquiat drawings.  The charges against Martinez, which landed him in ": null
    },
    {
        "Manhattans Metropolitan Correction Center": "Metropolitan Correctional Center, New York"
    },
    {
        " on June 19, 2002, involved an alleged scheme to sell fake Basquiat drawings, accompanied by forged certificates of authenticity.  Until 2002, the highest amount paid for an original work of Basquiats was US$3,302,500, set on November 12, 1998, at ": null
    },
    {
        "Christies": "Christies"
    },
    {
        ". In 2002, Basquiats Profit I , a large piece measuring , was set for auction again at Christies by drummer ": null
    },
    {
        "Lars Ulrich": "Lars Ulrich"
    },
    {
        " of the ": null
    },
    {
        "heavy metal": "Heavy Metal Music"
    },
    {
        " band ": null
    },
    {
        "Metallica": "Metallica"
    },
    {
        ". It sold for US$5,509,500.  The proceedings of the auction are documented in the film  Metallica: Some Kind of Monster .     Between 2007 and 2012, the price of Basquiat artwork continued to steady grow up to $16.3 million dollars.  Charlotte Burns and Julia Michalska , Artprice survey reveals the twin peaks of power,  The Art Newspaper . Carol Vogel ,   The New York Times . Souren Melikian ,   International Herald Tribune . In 2013, Basquiats piece Dustheads sold for $48.8 million at Christies. In 2016 an untitled piece sold at Christies for $57.3 million to a Japanese businessman and collector, ": null
    },
    {
        "Yusaku Maezawa": "Yusaku Maezawa"
    },
    {
        ". Robin Pogrebin,   The New York Times  May 15, 2016  In 2017, Yusaku purchased Basquiats Untitled , a powerful depiction of a black skull with red and black rivulets, at auction for a record-setting US$110,487,500—the most ever paid for an American artwork    and the sixth most expensive artwork sold at an auction, surpassing Andy Warhols  Silver Car Crash  which sold in 2013 for $105 million.  Maezawas two record breaking purchases of Basquiat artworks in 2016 and 2017 total $170M USD.       The authentication committee of the estate of Jean-Michel Basquiat was formed by the gallery that was assigned to handle the artists estate and was dissolved in 2012. Daniel Grant ,   Baltimore Sun . Between 1994 and 2012, it reviewed over 2,000 works of art; the cost of the committees opinion was $100. The committee was headed by Gérard Basquiat. Members and advisers varied depending on who was available at the time when a piece was being authenticated, but they have included the curators and gallerists ": null
    },
    {
        "Diego Cortez": "Diego Cortez"
    },
    {
        ", ": null
    },
    {
        "Jeffrey Deitch": "Jeffrey Deitch"
    },
    {
        ", John Cheim, Richard Marshall, Fred Hoffman and Annina Nosei . Liza Ghorbani ,   New York Magazine .     In 2008 the authentication committee was sued by collector Gerard De Geer, who claimed the committee breached its contract by refusing to offer an opinion on the authenticity of the painting Fuego Flores ; Kate Taylor ,   New York Sun . after the lawsuit was dismissed, the committee ruled the work genuine. Georgina Adam and Riah Pryor ,   The Art Newspaper .  In early 2012, the committee announced that it would dissolve in September of that year and no longer consider applications.       Basquiats legacy has had influences upon literature, film, music, and fashion. Fashion outlets featuring Basquiats work have included clothing companies such as SPRZ NY of ": null
    },
    {
        "Uniqlo": "Uniqlo"
    },
    {
        ",  ": null
    },
    {
        "Urban Outfitters": "Urban Outfitters"
    },
    {
        ", and ": null
    },
    {
        "Redbubble": "Redbubble"
    },
    {
        ".       Basquiat starred in  Downtown 81 , a  vérité  movie written by ": null
    },
    {
        "Glenn OBrien": "Glenn Obrien"
    },
    {
        " and shot by ": null
    },
    {
        "Edo Bertoglio": "Edo Bertoglio"
    },
    {
        " in 1981, but not released until 1998.  ": null
    },
    {
        "Gagosian Gallery": "Gagosian Gallery"
    },
    {
        ", New York. In 1996, eight years after the artists death, a biographical film titled  Basquiat  was released, directed by ": null
    },
    {
        "Julian Schnabel": "Julian Schnabel"
    },
    {
        ", with actor ": null
    },
    {
        "Jeffrey Wright": "Jeffrey Wright"
    },
    {
        " playing Basquiat. David Bowie played the part of Andy Warhol. Schnabel was interviewed during the films script development as a personal acquaintance of Basquiat. Schnabel then purchased the rights to the project, believing that he could make a better film. Meet the Artist: Julan Schnabel , lecture given at Hirshhorn Museum, Washington, DC, May 13, 2011.     In 2006 the Equality Forum featured Jean-Michel Basquiat during LGBT history month.  A 2009 documentary film,  Jean-Michel Basquiat: The Radiant Child , directed by ": null
    },
    {
        "Tamra Davis": "Tamra Davis"
    },
    {
        ", was first screened as part of the 2010 ": null
    },
    {
        "Sundance Film Festival": "Sundance Film Festival"
    },
    {
        " and was shown on the ": null
    },
    {
        "PBS": "Pbs"
    },
    {
        " series  Independent Lens  in 2011.  Tamra Davis discussed her friendship with Basquiat in a ": null
    },
    {
        "Sothebys": "Sothebys"
    },
    {
        " video, Basquiat: Through the Eyes of a Friend . The American ": null
    },
    {
        "Public Broadcast Service": "Pbs"
    },
    {
        " broadcast a 90-minute documentary about Basquiat in the  American Masters  series, entitled Basquiat: Rage to Riches, on 14 September 2018.  . Public Broadcasting Service. Broadcast: 2018-09-14.       In 1991, poet ": null
    },
    {
        "Kevin Young": "Kevin Young"
    },
    {
        " produced a book, To Repel Ghosts, a compendium of 117 poems relating to Basquiats life, individual paintings, and social themes found in the artists work. He published a remix of the book in 2005. Kevin Young, To Repel Ghosts , Zoland Books, 2001. In 1995, writer Jennifer Clement wrote the biography Widow Basquiat, based on the narratives reconstructions told to her by Suzanne Mallouk. In 2005, poet ": null
    },
    {
        "M. K. Asante": "M. K. Asante"
    },
    {
        " published the poem SAMO , dedicated to Basquiat, in his book Beautiful. And Ugly Too. In 2017, the biography Radiant Child told Basquiats life from the perspective of a young prodigy and it won the ": null
    },
    {
        "Caldecott Medal": "Caldecott Medal"
    },
    {
        ".  In 2019, illustrator Paolo Parisi wrote the graphic novel Basquiat: A Graphic Novel, following Basquiats journey from street-art legend SAMO to international art-scene darling, up until his sudden death. Paolo Parisi, Basquiat: A Graphic Novel , , 2019.       Shortly after Basquiats death, guitarist ": null
    },
    {
        "Vernon Reid": "Vernon Reid"
    },
    {
        " of New York City ": null
    },
    {
        "funk metal": "Funk Metal"
    },
    {
        " band ": null
    },
    {
        "Living Colour": "Living Colour"
    },
    {
        " wrote a song called Desperate People , released on their album  Vivid . The song primarily addresses the drug scene of New York at that time. Vernon states that Basquiats death inspired him to write the song after receiving a phone call from ": null
    },
    {
        "Greg Tate": "Greg Tate"
    },
    {
        " informing Vernon of Basquiats death. ": null
    }
]