[
    {
        "     Jean-Jacques Ampère was a French ": null
    },
    {
        "philologist": "Philologist"
    },
    {
        " and man of letters.     Born in ": null
    },
    {
        "Lyon": "Lyon"
    },
    {
        ", he was the only son of the physicist ": null
    },
    {
        "André-Marie Ampère": "André-Marie Ampère"
    },
    {
        " . Jean-Jacques mother died while he was an infant. On his tomb at the cemetery of ": null
    },
    {
        "Montmartre": "Montmartre"
    },
    {
        ", Paris, he is named Jean-Jacques Antoine Ampère. His fathers father was also named Jean-Jacques Ampère .     He studied the ": null
    },
    {
        "folk songs": "Folk Song"
    },
    {
        "and popular poetry of the Scandinavian countries in an extended tour in northern Europe. Returning to France in 1830, he delivered a series of lectures on Scandinavian and early German poetry at the Athenaeum in ": null
    },
    {
        "Marseille": "Marseille"
    },
    {
        ". The first of these was printed as De lHistoire de la poésie , and was practically the first introduction of the French public to the Scandinavian and German epics.     Moving to Paris, he taught at the ": null
    },
    {
        "Sorbonne": "University Of Paris"
    },
    {
        ", and became professor of the history of French literature at the Collège de France. A journey in northern Africa was followed by a tour in ": null
    },
    {
        "Greece": "Greece"
    },
    {
        " and Italy, in company with ": null
    },
    {
        "Prosper Mérimée": "Prosper Mérimée"
    },
    {
        ", ": null
    },
    {
        "Jean de Witte": "Jean De Witte"
    },
    {
        " and ": null
    },
    {
        "Charles Lenormant": "Charles Lenormant"
    },
    {
        ". This bore fruit in his Voyage dantesque , which did much to popularize the study of ": null
    },
    {
        "Dante": "Dante Alighieri"
    },
    {
        " in France.     In 1848 he became a member of the ": null
    },
    {
        "Académie française": "Académie Française"
    },
    {
        ", and in 1851 he visited America. From this time he was occupied with his chief work, LHistoire romaine à Rome , until his death at ": null
    },
    {
        "Pau": "Pau, Pyrénées-Atlantiques"
    },
    {
        ".     The Correspondence et souvenirs of A-M and J-J Ampère was published in 1875. Notices of J-J Ampère are to be found in ": null
    },
    {
        "Sainte-Beuves": "Charles Augustin Sainte-Beuve"
    },
    {
        " Portraits littéraires, vol. iv., and Nouveaux Lundis, vol. xiii.; in P Mérimées Portraits historiques et littéraires ; and in ": null
    },
    {
        "Alexis de Tocquevilles": "Alexis De Tocqueville"
    },
    {
        " Recollections .          ": null
    }
]