[
    {
        "      Jeffrey Lynne is an English songwriter, singer, record producer, and multi-instrumentalist who co-founded the ": null
    },
    {
        "rock": "Rock Music"
    },
    {
        " band ": null
    },
    {
        "Electric Light Orchestra": "Electric Light Orchestra"
    },
    {
        " . The group formed in 1970 as an offshoot of ": null
    },
    {
        "the Move": "The Move"
    },
    {
        ", of which Lynne was also a member. Following the departure of ": null
    },
    {
        "Roy Wood": "Roy Wood"
    },
    {
        " in 1972, Lynne assumed sole leadership of the band and wrote, arranged and produced virtually all of its subsequent records. Before, Lynne was also involved with ": null
    },
    {
        "the Idle Race": "The Idle Race"
    },
    {
        " as a founding member and principal songwriter.     After ELOs original disbandment in 1986, Lynne released two solo albums:  Armchair Theatre  and  Long Wave  . Additionally, he began producing various artists. In 1988, under the pseudonyms Otis Wilbury and Clayton Wilbury, he co-founded the ": null
    },
    {
        "supergroup": "Supergroup"
    },
    {
        " Traveling Wilburys": "Traveling Wilburys"
    },
    {
        " with ": null
    },
    {
        "George Harrison": "George Harrison"
    },
    {
        ", ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        ", ": null
    },
    {
        "Roy Orbison": "Roy Orbison"
    },
    {
        ", and ": null
    },
    {
        "Tom Petty": "Tom Petty"
    },
    {
        ". Lynnes songwriting and production ": null
    },
    {
        "collaborations with former Beatles": "Jeff Lynne And The Beatles"
    },
    {
        " led him to co-produce their  Anthology  reunion singles from John Lennon demos ": null
    },
    {
        "Free as a Bird": "Free As A Bird"
    },
    {
        " and ": null
    },
    {
        "Real Love": "Real Love"
    },
    {
        " . In 2014, Lynne reformed ELO and resumed concert touring under the moniker Jeff Lynnes ELO .     Lynne produced all fifteen ELO singles that rose to the ": null
    },
    {
        "Top 10": "Record Chart"
    },
    {
        " record charts in the UK. His producing credits also include the UK or US Top 10 albums  Cloud Nine  ,  Mystery Girl  ,  Full Moon Fever  ,  Into the Great Wide Open  ,  Flaming Pie   and  Get Up!  . In 2014, Lynne received a star on the ": null
    },
    {
        "Birmingham Walk of Stars": "Birmingham Walk Of Stars"
    },
    {
        ", and was awarded a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "Hollywood Walk Of Fame"
    },
    {
        " the following year. He received three ": null
    },
    {
        "Ivor Novello Awards": "Ivor Novello Awards"
    },
    {
        " including the award for Outstanding Services to British Music.  . The Ivors. Retrieved 28 December 2017 In 2017, Lynne was inducted into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "Rock And Roll Hall Of Fame"
    },
    {
        " as a member of ELO.            Lynne was born to Nancy and Philip Lynne and grew up in ": null
    },
    {
        "Shard End": "Shard End"
    },
    {
        ", ": null
    },
    {
        "Birmingham": "Birmingham"
    },
    {
        ", England where he attended Alderlea Boys Secondary School.  As a native of Birmingham he has a flat ": null
    },
    {
        "Brummie": "Brummie"
    },
    {
        " accent.  His first guitar, an acoustic instrument, was bought for him by his father for £2.  He was still playing it in 2012. In 1963 he formed a group with Robert Reader and David Walsh using little more than Spanish guitars and cheap electrical instruments. They were originally named the Rockin Hellcats, then the Handicaps and finally the Andicaps. They practised at Shard End Community Centre and performed weekly. However, in 1964, Robert Reader and David Walsh left the band and Lynne brought in replacements. At the end of 1964, Lynne decided to leave the band to replace Mick Adkins of the local band the Chads .      Some time in or after 1965, he acquired his first item of studio recording equipment, a ": null
    },
    {
        "Bang & Olufsen": "Bang  &  Olufsen"
    },
    {
        " Beocord 2000 De Luxe stereo reel-to-reel tape recorder, which allowed multi-tracking between left and right channels.  He says it taught me how to be a producer . In 1966, Lynne joined the line-up of the Nightriders as guitarist, having responded to an advertisement in the ": null
    },
    {
        "Birmingham Evening Mail": "Birmingham Mail"
    },
    {
        ".  The band would soon change their name to ": null
    },
    {
        "the Idle Race": "The Idle Race"
    },
    {
        ". Despite recording two critically acclaimed albums with the band and producing the second, success eluded him. In 1970, Lynne accepted an offer from friend ": null
    },
    {
        "Roy Wood": "Roy Wood"
    },
    {
        " to join the line-up of the more successful band ": null
    },
    {
        "the Move": "The Move"
    },
    {
        ".        Lynne contributed many songs to ": null
    },
    {
        "the Moves": "The Move"
    },
    {
        " last two albums while formulating, with Roy Wood and ": null
    },
    {
        "Bev Bevan": "Bev Bevan"
    },
    {
        ", a band built around a fusion of rock and ": null
    },
    {
        "classical music": "Classical Music"
    },
    {
        " – a project which would eventually become the highly successful ": null
    },
    {
        "Electric Light Orchestra": "Electric Light Orchestra"
    },
    {
        " . The original idea was that both bands would exist in tandem. Bevan has, however, since suggested that Lynne had little interest in the Move, stating:      The only reason Jeff Lynne ever joined the Move was to form a new band. He was never interested in being a part of the Move. It was a good, money-earning band. It really subsidised the beginning of ELO for getting musicians in and recording and rehearsals and stuff. Jeff never wanted to be in the Move. He wanted to form a new band.       Problems led to Woods departure from ELO in 1972, after the bands ": null
    },
    {
        "eponymous first album": "The Electric Light Orchestra"
    },
    {
        ", leaving Lynne as the bands dominant creative force. Thereafter followed a succession of band personnel changes and increasingly popular albums: 1973s  ELO 2  and  On the Third Day , 1974s  Eldorado  and 1975s  Face the Music . By 1976s  A New World Record , Lynne had almost developed the roots of the group into a more complex and unique pop-rock sound mixed with studio strings, layered vocals, and tight, catchy pop singles. Lynnes now almost complete creative dominance as producer, songwriter, arranger, lead singer and guitarist could make ELO appear to be an almost solo effort. However, the ELO sound and the focus of Lynnes writing was also shaped by ": null
    },
    {
        "Louis Clarks": "Louis Clark"
    },
    {
        " and ": null
    },
    {
        "Richard Tandys": "Richard Tandy"
    },
    {
        " co-arranging, under Lynnes direction , and Bev Bevans drumming, while Richard Tandys integration of the ": null
    },
    {
        "Moog": "Moog Synthesizer"
    },
    {
        ", ": null
    },
    {
        "harmonium": "Pump Organ"
    },
    {
        ", and ": null
    },
    {
        "Mellotron": "Mellotron"
    },
    {
        ", with more novel keyboard technology, gave Lynnes songs a more symphonic sound. ": null
    },
    {
        "Kelly Groucutts": "Kelly Groucutt"
    },
    {
        " distinctive voice mixed with Lynnes to produce the classic ELO harmonic vocal sound.     The pinnacle of ELOs chart success and worldwide popularity was the expansive 1977 double album  Out of the Blue , which was largely conceived in a Swiss chalet during a two-week writing marathon.  The bands 1978 world tour featured an elaborate space ship set and laser light show. In order to recreate the complex instrumental textures of their albums, the band used pre-recorded supplemental backing tracks in live performances. Although that practice has now become commonplace, it caused considerable derision in the press of the time.  Lynne has often stated that he prefers the creative environment of the studio to the rigours and tedium of touring. In 1979, Lynne followed up the success of Out of the Blue with  Discovery , which held No. 1 in the UK for 5 weeks. The album is primarily associated with its two disco-flavoured singles  and with the titles word play on disco and very .  However, the remaining seven non-disco tracks on the album reflected Lynnes range as a pop-rock songwriter, including a heavy, mid-tempo rock anthem  that, despite its use of a drum loop, could be considered the antithesis of disco. Lynne later recalled his forays into dance music: I love the force of disco. I love the freedom it gave me to make different rhythms across it. I enjoyed that really steady driving beat. Just steady as a rock. I’ve always liked that simplicity in the bass drum.     In 1979, Lynne rejected an offer for ELO to headline the ": null
    },
    {
        "Knebworth Concert": "Knebworth Festival 1979"
    },
    {
        " in the UK, allowing ": null
    },
    {
        "Led Zeppelin": "Led Zeppelin"
    },
    {
        " to headline instead. In the absence of any touring to support Discovery, Lynne had time to contribute five tracks to the soundtrack for the 1980 film ": null
    },
    {
        "musical": "Musical Theatre"
    },
    {
        "  Xanadu . The score yielded three Top 40 singles: ": null
    },
    {
        "Im Alive": "Im Alive"
    },
    {
        " , ": null
    },
    {
        "All Over The World": "All Over The World"
    },
    {
        " , and the title track ": null
    },
    {
        "Xanadu": "Xanadu"
    },
    {
        " , which reached number one in the UK. Nevertheless, Lynne was not closely involved with the development of the film, and his material consequently had only superficial attachment to the plot. Xanadu performed weakly at the box office . Lynne subsequently disavowed his limited contribution to the project.           In 1981, Lynne took the band in a somewhat different direction with the science-fiction themed album  Time , reaching number one for two weeks in the UK, producing the second Top 3 single in less than two years. The strings were still featured, but with heavily synthesised textures. Following a marginally successful tour, Lynne kept this general approach with 1983s  Secret Messages  and a final contractually-obligated ELO album  Balance of Power  in 1986. Lynne discusses the contractually-obligated nature of the final albums on the short interview included with the Zoom DVD. ELO now had only three remaining official members , and Lynne began devoting more time to producing. During his time in the Electric Light Orchestra, Lynne did manage to release a few recordings under his own name. In 1976, Lynne covered ": null
    },
    {
        "the Beatles": "The Beatles"
    },
    {
        " songs ": null
    },
    {
        "With a Little Help from My Friends": "With A Little Help From My Friends"
    },
    {
        " and ": null
    },
    {
        "Nowhere Man": "Nowhere Man"
    },
    {
        " for  All This and World War II . In 1977, Lynne released his first solo single, the ": null
    },
    {
        "disco": "Disco"
    },
    {
        "-flavoured ": null
    },
    {
        "Doin That Crazy Thing": "Doin That Crazy Thing"
    },
    {
        " / ": null
    },
    {
        "Goin Down to Rio": "Goin Down To Rio"
    },
    {
        " . Despite ELOs high-profile at that time, it received little airplay and failed to chart.     In 1984, Lynne and Tandy contributed two original songs ": null
    },
    {
        "Video!": "Video!"
    },
    {
        " and Let It Run to the film  Electric Dreams  . Lynne also wrote the song The Story of Me, which was recorded by the ": null
    },
    {
        "Everly Brothers": "Everly Brothers"
    },
    {
        " on their comeback album  EB84 . Even before the official end of ELO, Lynne began his move toward focusing almost exclusively on studio production work. Lynne produced and wrote the 1983 top-40 hit ": null
    },
    {
        "Slipping Away": "Slipping Away"
    },
    {
        " for ": null
    },
    {
        "Dave Edmunds": "Dave Edmunds"
    },
    {
        " and played on sessions for Edmunds album, Information. Lynne also produced six tracks on Edmunds follow-up album in 1984,  Riff Raff . In contrast to the dense, boomy, ": null
    },
    {
        "baroque": "Baroque Pop"
    },
    {
        " sound of ELO, Lynnes post-ELO studio work has tended toward more minimal, acoustic instrumentation and a sparse, organic quality that generally favours light room ambience and colouration over artificial reverb, especially on vocals. Lynnes recordings also often feature the jangling compressed acoustic guitar sound pioneered by ": null
    },
    {
        "Roger McGuinn": "Roger Mcguinn"
    },
    {
        " and a heavily gated ": null
    },
    {
        "snare drum": "Snare Drum"
    },
    {
        " sound.       Lynnes influence by the Beatles was clearly evident in his ELO work, and the connection to the Beatles was strengthened when Lynne produced ": null
    },
    {
        "George Harrisons": "George Harrison"
    },
    {
        "  Cloud Nine . The latter was a successful comeback album for Harrison, released in 1987, featuring the popular singles ": null
    },
    {
        "Got My Mind Set on You": "Got My Mind Set On You"
    },
    {
        " , ": null
    },
    {
        "When We Was Fab": "When We Was Fab"
    },
    {
        " and ": null
    },
    {
        "This Is Love": "This Is Love"
    },
    {
        " , the last two of which were co-written by Lynne. Lynnes association with Harrison led to the 1988 formation of the ": null
    },
    {
        "Traveling Wilburys": "Traveling Wilburys"
    },
    {
        ", a studio ": null
    },
    {
        "supergroup": "Supergroup"
    },
    {
        " that also included ": null
    },
    {
        "Tom Petty": "Tom Petty"
    },
    {
        ", ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        " and ": null
    },
    {
        "Roy Orbison": "Roy Orbison"
    },
    {
        " and resulted in two albums , both produced by Harrison and Lynne. In 1988, Lynne also worked on Orbisons album  Mystery Girl , co-writing and producing Orbisons last major hit, ": null
    },
    {
        "You Got It": "You Got It"
    },
    {
        " , plus two other tracks on that album. For  Rock On! , the final ": null
    },
    {
        "Del Shannon": "Del Shannon"
    },
    {
        " album, Lynne co-wrote Walk Away and finished off several tracks after Shannons death.     In 1989, Lynne co-produced  Full Moon Fever  by Tom Petty, which included the hit singles ": null
    },
    {
        "Free Fallin": "Free Fallin"
    },
    {
        " , ": null
    },
    {
        "I Wont Back Down": "I Wont Back Down"
    },
    {
        " and ": null
    },
    {
        "Runnin Down a Dream": "Runnin Down A Dream"
    },
    {
        " , all co-written by Lynne. This album and Traveling Wilburys Vol. 1 received nominations for the ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        " for Best Album of the Year in 1989. The Traveling Wilburys won a Grammy for ": null
    },
    {
        "Best Rock Performance By a Duo or Group with Vocal": "Best Rock Performance By A Duo Or Group With Vocal"
    },
    {
        " that year.  Lynnes song ": null
    },
    {
        "One Way Love": "One Way Love"
    },
    {
        " was released as a single by ": null
    },
    {
        "Agnetha Fältskog": "Agnetha Fältskog"
    },
    {
        " and appeared on her second post-": null
    },
    {
        "ABBA": "Abba"
    },
    {
        " album,  Eyes of a Woman . Lynne co-wrote and produced the track ": null
    },
    {
        "Let It Shine": "Let It Shine"
    },
    {
        " for ": null
    },
    {
        "Beach Boys": "Beach Boys"
    },
    {
        " founder ": null
    },
    {
        "Brian Wilsons": "Brian Wilson"
    },
    {
        " first solo album": "Brian Wilson"
    },
    {
        " in 1988. Lynne also contributed three tracks to an album by ": null
    },
    {
        "Duane Eddy": "Duane Eddy"
    },
    {
        " and Falling in Love on  Land of Dreams  for ": null
    },
    {
        "Randy Newman": "Randy Newman"
    },
    {
        ".     In 1990, Lynne collaborated on the Wilburys follow up  Traveling Wilburys Vol. 3  and released his first solo album  Armchair Theatre . The album featured Harrison and Tandy and included the singles ": null
    },
    {
        "Every Little Thing": "Every Little Thing"
    },
    {
        " and Lift Me Up . It received some positive critical attention but little commercial success. Lynne also provided the song Wild Times to the motion picture soundtrack  Robin Hood: Prince of Thieves  in 1991. In 1991, Lynne returned to the studio with Petty, co-writing and producing the album  Into the Great Wide Open  for ": null
    },
    {
        "Tom Petty and the Heartbreakers": "Tom Petty And The Heartbreakers"
    },
    {
        ", which featured the singles ": null
    },
    {
        "Learning to Fly": "Learning To Fly"
    },
    {
        " and Into the Great Wide Open . The following year he produced two songs on Roy Orbisons posthumous album  King of Hearts , including the single ": null
    },
    {
        "I Drove All Night": "I Drove All Night"
    },
    {
        " .         In February 1994, Lynne worked with the three surviving Beatles on the  Anthology  album series. At Harrisons request, Lynne was brought in to assist in reevaluating ": null
    },
    {
        "John Lennons": "John Lennon"
    },
    {
        " original studio material. The songs ": null
    },
    {
        "Free as a Bird": "Free As A Bird"
    },
    {
        " and ": null
    },
    {
        "Real Love": "Real Love"
    },
    {
        " were created by digitally processing Lennons demos for the songs and overdubbing the three surviving band members to form a virtual Beatles reunion that the band had mutually eschewed during Lennons lifetime. Lynne has also produced records for ": null
    },
    {
        "Ringo Starr": "Ringo Starr"
    },
    {
        " and worked on ": null
    },
    {
        "Paul McCartneys": "Paul Mccartney"
    },
    {
        " Grammy nominated album  Flaming Pie .     Lynnes work in the 1990s also includes production of a 1993 album for singer-songwriter ": null
    },
    {
        "Julianna Raye": "Julianna Raye"
    },
    {
        " entitled Something Peculiar and production or songwriting contributions to albums by ": null
    },
    {
        "Roger McGuinn": "Roger Mcguinn"
    },
    {
        "  and ": null
    },
    {
        "Joe Cocker": "Joe Cocker"
    },
    {
        " , songs by ": null
    },
    {
        "Aerosmith": "Aerosmith"
    },
    {
        " , ": null
    },
    {
        "Tom Jones": "Tom Jones"
    },
    {
        " , ": null
    },
    {
        "Bonnie Tyler": "Bonnie Tyler"
    },
    {
        " , the film  Still Crazy , ": null
    },
    {
        "Hank Marvin": "Hank Marvin"
    },
    {
        " , Et Moi and the ": null
    },
    {
        "Tandy Morgan Band": "Tandy Morgan Band"
    },
    {
        " . In 1996, Lynne was officially recognised by his peers when he was awarded the ": null
    },
    {
        "Ivor Novello Award": "Ivor Novello Awards"
    },
    {
        " for Outstanding Contributions to British Music for a second time.     In the year 2000, Lynne reactivated ELO and released the retrospective box set  Flashback , containing many newly finished, previously unreleased tracks. The following year Lynne debuted the first new ELO album in fifteen years,  Zoom . The album featured guest appearances by ": null
    },
    {
        "Ringo Starr": "Ringo Starr"
    },
    {
        ", George Harrison and Richard Tandy, with Lynne multi-tracking a majority of the instruments and vocals. The album received positive reviews but had no hit singles. It was marketed as a return to the classic ELO sound  /ref  ref  /ref  ref nameAM/ ref nameAM/  ref nameAM/  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref nameAM/  ref  /ref  ref  /ref  ref  /ref  ref  /ref ref nameBillQ & A  /ref  ref name MBS /  ref name b-post  /ref  ref  /ref  ref  /ref  ref name b-post /  ref  /ref ref name Price  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref name jefflynneselo.com  /ref  ref name jefflynneselo.com /  ref  /ref  ref  /ref ref namefreebmd  /ref  ref  /ref   ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref  ref  /ref  ref  /ref ": null
    }
]