[
    {
        "               Jeffrey Lionel Dahmer , also known as the Milwaukee Cannibal or the Milwaukee Monster, was an American ": null
    },
    {
        "serial killer": "Serial Killer"
    },
    {
        " and ": null
    },
    {
        "sex offender": "Sex Offender"
    },
    {
        " who committed the ": null
    },
    {
        "rape": "Rape"
    },
    {
        ", ": null
    },
    {
        "murder": "Murder"
    },
    {
        ", and ": null
    },
    {
        "dismemberment": "Dismemberment"
    },
    {
        " of 17 men and boys from 1978 to 1991. Many of his later murders involved ": null
    },
    {
        "necrophilia": "Necrophilia"
    },
    {
        ", ": null
    },
    {
        "cannibalism": "Human Cannibalism"
    },
    {
        ", and the permanent preservation of body parts—typically all or part of the ": null
    },
    {
        "skeleton": "Skeleton"
    },
    {
        ".     Although he was diagnosed with ": null
    },
    {
        "borderline personality disorder": "Borderline Personality Disorder"
    },
    {
        ", ": null
    },
    {
        "schizotypal personality disorder": "Schizotypal Personality Disorder"
    },
    {
        ",  and a ": null
    },
    {
        "psychotic disorder": "Psychosis"
    },
    {
        ", Dahmer was found to be legally ": null
    },
    {
        "sane": "Sanity"
    },
    {
        " at his ": null
    },
    {
        "trial": "Trial"
    },
    {
        ". He was convicted of 15 of the 16 murders he had committed in ": null
    },
    {
        "Wisconsin": "Wisconsin"
    },
    {
        ", and was sentenced to 15 terms of ": null
    },
    {
        "life imprisonment": "Life Imprisonment"
    },
    {
        " on February 15, 1992. He was later sentenced to a 16th term of life imprisonment for an additional homicide committed in ": null
    },
    {
        "Ohio": "Ohio"
    },
    {
        " in 1978.     On November 28, 1994, Dahmer was beaten to death by ": null
    },
    {
        "Christopher Scarver": "Christopher Scarver"
    },
    {
        ", a fellow inmate at the ": null
    },
    {
        "Columbia Correctional Institution": "Columbia Correctional Institution"
    },
    {
        ".           Jeffrey Lionel Dahmer was born at the Evangelical Deaconess Hospital in ": null
    },
    {
        "Milwaukee, Wisconsin": "Milwaukee"
    },
    {
        ", United States, on May 21, 1960, the first of two sons born to Joyce Annette and Lionel Herbert Dahmer. Dahmers mother worked as a ": null
    },
    {
        "teletype machine": "Teleprinter"
    },
    {
        " instructor, and his father was a student at ": null
    },
    {
        "Marquette University": "Marquette University"
    },
    {
        ", working towards a degree in chemistry. His father was of ": null
    },
    {
        "German": "German Americans"
    },
    {
        " and ": null
    },
    {
        "Welsh": "Welsh Americans"
    },
    {
        " ancestry, and his mother was of ": null
    },
    {
        "Norwegian": "Norwegian Americans"
    },
    {
        " and ": null
    },
    {
        "Irish": "Irish Americans"
    },
    {
        " ancestry.      It has been claimed that Dahmer was deprived of attention as an infant.  Other sources, however, suggest that generally, Dahmer was doted upon as an infant and toddler by both parents, although his mother was known to be tense, greedy for both attention and pity, and argumentative with her husband and their neighbors.     As her son entered first grade, Joyce Dahmer began to spend an increasing amount of her time in bed recovering from weakness. Lionels university studies kept him away from home much of the time; when he was home, his wife demanded constant attention. She reportedly worked herself into a state of anxiety over trivial matters simply to appease her husband. On one occasion, Joyce Dahmer attempted suicide from an overdose of the ": null
    },
    {
        "Equanil": "Meprobamate"
    },
    {
        " pills to which she had become addicted. Consequently, neither parent devoted much time to their son.     Dahmer has been described as being an energetic and happy child until he became notably subdued after undergoing a ": null
    },
    {
        "double hernia": "Inguinal Hernia Surgery"
    },
    {
        " surgery, which was performed shortly before his fourth birthday.  He recalled his early years of family life as being of extreme tension which he noted between his parents, whom he observed to be constantly arguing with each other. At elementary school, he was regarded as both quiet and timid by his peers. On his first grade report card, one teacher described Dahmer as a reserved child whom she sensed felt neglected. This teacher did note that this sense of neglect seemed to stem from his mothers illnesses. Nonetheless, although largely reserved and uncommunicative in grade school, Dahmer did have a small number of friends.     From an early age, Dahmer manifested an interest in dead animals. Friends later recalled Dahmer initially collected large insects, such as dragonflies and butterflies, which he placed inside jars. Later, he collected ": null
    },
    {
        "animal carcasses from the roadside": "Roadkill"
    },
    {
        ", occasionally accompanied by one or more of his few friends; he dismembered these animals either at home or in an expanse of woodland behind the family home. According to one friend, Dahmer dismembered these animals and stored the parts in jars in the familys wooden toolshed, always explaining that he was curious as to how each animal fitted together .     In one instance, he ": null
    },
    {
        "decapitated": "Decapitation"
    },
    {
        " the carcass of a dog before nailing the animals body to a tree. He later impaled the skull of this dog upon a stake beside a wooden cross in woodland behind his house. Dahmers fascination with dead animals might have begun when, at the age of four, he noted his father removing animal bones from beneath the family home. According to Lionel Dahmer, his son was oddly thrilled by the sound the bones made, and instantly developed a fixation for playing with and collecting animal bones. He occasionally searched beneath and around the family home for additional bones. With live animals, he explored their bodies to discover where their bones were located.     The Dahmer family relocated to ": null
    },
    {
        "Doylestown, Ohio": "Doylestown, Ohio"
    },
    {
        ", in October 1966. At the time, Joyce Dahmer was pregnant with her second child. When she gave birth to a baby boy on December 18, 1966, Jeffrey was allowed to choose the name of the baby. He chose the name David for his younger brother. The same year, Lionel Dahmer achieved his degree and subsequently obtained employment as an ": null
    },
    {
        "analytical chemist": "Analytical Chemistry"
    },
    {
        " in the city of ": null
    },
    {
        "Akron, Ohio": "Akron, Ohio"
    },
    {
        ".      In 1968, the family relocated to ": null
    },
    {
        "Bath, Ohio": "Bath Township, Summit County, Ohio"
    },
    {
        ". Two years later, over a family meal of chicken, Dahmer asked his father what would happen if the bones of the chicken were to be placed in a bleach solution. Lionel Dahmer was, by this stage, concerned as to his elder sons placid and ": null
    },
    {
        "lethargic": "Lethargy"
    },
    {
        " attitude and his solitary existence; therefore, he was delighted at the initiative displayed by his son towards what he believed to be scientific curiosity. He willingly demonstrated to his son how to safely bleach and preserve animal bones. Dahmer used this knowledge regarding the cleansing and preserving of bones on many of the animal remains which he continued to avidly collect.       From his freshman year at ": null
    },
    {
        "Revere High School": "Revere High School"
    },
    {
        ", Dahmer was seen by his peers as an ": null
    },
    {
        "outcast": "Outcast"
    },
    {
        " with few friends. Many of Dahmers classmates later recollected being disturbed by the fact that he drank both beer and ": null
    },
    {
        "hard alcohol": "Distilled Beverage"
    },
    {
        ", which he smuggled into school inside the lining of his army fatigue jacket and concealed in his locker. This drinking occurred before, during, and after school, and was first noted when Dahmer was 14. On one occasion, a classmate observed Dahmer consuming a cup of ": null
    },
    {
        "gin": "Gin"
    },
    {
        " and asked him why he was drinking liquor in class, to which Dahmer casually replied, Its my medicine .  In his freshman year at Revere High School, Dahmer, although largely uncommunicative, was observed by staff to be a polite student who was known to be highly intelligent. He initially achieved only average grades, which staff attributed to his ": null
    },
    {
        "apathy": "Apathy"
    },
    {
        ". He was also known to have been a keen tennis player and to have briefly played in the high school band.        When he reached puberty, Dahmer discovered he was ": null
    },
    {
        "gay": "Homosexuality"
    },
    {
        ". He did not divulge his sexual orientation to his parents. In his early teens, he did engage in a brief relationship with another youth, although the pair never had intercourse. By his later admission, he began sexually fantasizing about dominating and controlling a completely submissive male partner. These fantasies gradually became intertwined with ": null
    },
    {
        "dissection": "Dissection"
    },
    {
        ".     On one occasion, when he was approximately 16 years old, Dahmer conceived a ": null
    },
    {
        "rape fantasy": "Rape Fantasy"
    },
    {
        " of rendering ": null
    },
    {
        "unconscious": "Unconsciousness"
    },
    {
        " a particular male jogger he found attractive, and then making sexual use of his unconscious body. To render the man unconscious, Dahmer concealed himself in bushes on the route he had noted the jogger took, baseball bat in hand, and lay in wait for him to run by. The jogger did not pass by on that particular day, however. Although Dahmer never attempted to implement this plan again, he later stated this was his first attempt to attack another individual.     Despite being regarded as a loner and an oddball among his peers at Revere High School, Dahmer became something of a ": null
    },
    {
        "class clown": "Wikt:Class Clown"
    },
    {
        " among some students due to the pranks he regularly staged—some of which were done to amuse his classmates, others apparently to simply attract attention. These pranks became known as Doing a Dahmer and included bleating, simulating ": null
    },
    {
        "epileptic seizures": "Epileptic Seizure"
    },
    {
        "or ": null
    },
    {
        "cerebral palsy": "Cerebral Palsy"
    },
    {
        ",  and knocking over items at school and at local stores. By 1977, Dahmers grades had declined, owing to his alcohol abuse and his continuing apathy toward academic and social interactions.     His parents hired a private tutor for their son, but the tutor only had limited success. The same year, Dahmers parents attended counseling sessions to try to resolve personal differences and thus save their marriage. The counseling was ultimately unsuccessful, and they decided to divorce. Although initially on amicable grounds, both of Dahmers parents began to quarrel frequently in the presence of their sons and, in early 1978, Lionel Dahmer moved out of the house.     In May 1978, Dahmer graduated from high school. A few weeks before his graduation, one of his teachers observed Dahmer sitting close to the school parking lot, drinking several cans of beer. When the teacher threatened to report the matter, Dahmer informed him he was experiencing a lot of problems at home and that the schools ": null
    },
    {
        "guidance counselor": "School Counselor"
    },
    {
        " was aware of them. Shortly after this incident, Joyce was awarded ": null
    },
    {
        "custody": "Child Custody"
    },
    {
        " of her younger son and vacated the family residence, moving in with family members of hers; Dahmer, having just turned 18, was legally an adult and therefore not subject to court custodial considerations.           Dahmer committed his first murder in the summer of 1978 at the age of 18, just three weeks after his graduation. At the time, he was living alone in the family home. Owing to his recent divorce from Dahmers mother, Dahmers father temporarily lived in a nearby motel and his mother had relocated to ": null
    },
    {
        "Chippewa Falls, Wisconsin": "Chippewa Falls, Wisconsin"
    },
    {
        ", with his younger brother David. On June 18, Dahmer picked up a hitchhiker named Steven Mark Hicks who was four days shy of his 19th birthday.  Dahmer lured the youth to his house on the pretext of the two young men drinking alcohol together. Hicks, who had been hitchhiking to a rock concert in Lockwood Corners, agreed to accompany Dahmer to his house. According to Dahmer, after several hours drinking and listening to music, Hicks wanted to leave and didnt want him to.      In response, Dahmer bludgeoned him with a 10  lb. ": null
    },
    {
        "dumbbell": "Dumbbell"
    },
    {
        ". Dahmer later stated he struck Hicks twice from behind with the dumbbell as Hicks sat upon a chair. When Hicks fell unconscious, Dahmer ": null
    },
    {
        "strangled": "Strangulation"
    },
    {
        " him to death with the bar of the dumbbell, then stripped the clothes from Hicks body before ": null
    },
    {
        "masturbating": "Masturbation"
    },
    {
        " as he stood above the corpse. The following day, Dahmer dissected Hicks body in his ": null
    },
    {
        "basement": "Basement"
    },
    {
        "; he later buried the remains in a shallow grave in his backyard before, several weeks later, unearthing the remains and ": null
    },
    {
        "paring": "Paring Knife"
    },
    {
        " the flesh from the bones. He dissolved the flesh in acid before flushing the solution down the toilet; he crushed the bones with a ": null
    },
    {
        "sledgehammer": "Sledgehammer"
    },
    {
        " and scattered them in the woodland behind the family home.       Six weeks after the murder of Hicks, Dahmers father and his fiancée returned to his home where they discovered Jeffrey living alone at the house. That August, Dahmer enrolled at ": null
    },
    {
        "Ohio State University": "Ohio State University"
    },
    {
        ", hoping to major in business. Dahmers sole term at Ohio State University was completely unproductive, largely because of his persistent alcohol abuse throughout the majority of the term. He received failing grades in Introduction to Anthropology, Classical Civilizations, and Administrative Science. The only course Dahmer was successful at was Riflery, having received a B- grade. His overall GPA was 0.45/4.0. On one occasion, Lionel Dahmer paid a surprise visit to his son, only to find his room strewn with empty liquor bottles. Despite his father having paid in advance for the second term, Dahmer dropped out of university after just three months.     In January 1979, on his fathers urging, Dahmer enlisted in the ": null
    },
    {
        "U.S. Army": "United States Army"
    },
    {
        ", where he trained as a medical specialist at ": null
    },
    {
        "Fort Sam Houston": "Fort Sam Houston"
    },
    {
        " in San Antonio, Texas. On July 13, 1979, he was stationed in ": null
    },
    {
        "Baumholder": "Baumholder"
    },
    {
        ", ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        ", where he served as a combat medic in ": null
    },
    {
        "2nd Battalion, 68th Armored Regiment": "68Th Armor Regiment"
    },
    {
        ", ": null
    },
    {
        "8th Infantry Division": "8Th Infantry Division"
    },
    {
        ".  According to published reports, in Dahmers first year of service, he was an average or slightly above average soldier.     Two soldiers attest to having been raped by Dahmer while in the army. One stated in 2010 that Dahmer had repeatedly raped him over a 17-month period while they were both stationed at Baumholder, while another soldier believes Dahmer drugged and raped him inside an ": null
    },
    {
        "armored personnel carrier": "Armored Personnel Carrier"
    },
    {
        " in 1979.   Owing to Dahmers alcohol abuse, his performance deteriorated and, in March 1981, he was deemed unsuitable for military service and was later discharged from the Army. He received an ": null
    },
    {
        "honorable discharge": "Honorable Discharge"
    },
    {
        ", as his superiors did not believe that any problems Dahmer had in the Army would be applicable to civilian life.     On March 24, 1981, Dahmer was sent to ": null
    },
    {
        "Fort Jackson": "Fort Jackson"
    },
    {
        ", South Carolina, for debriefing and provided with a plane ticket to travel anywhere in the country. Dahmer later told police he felt he could not return home to face his father, so he opted to travel to ": null
    },
    {
        "Miami Beach, Florida": "Miami Beach, Florida"
    },
    {
        ", both because he was tired of the cold  and in an attempt to live by his own means. In Florida, Dahmer found employment at a ": null
    },
    {
        "delicatessen": "Delicatessen"
    },
    {
        " and rented a room in a nearby motel. Dahmer spent most of his salary on alcohol, and was soon evicted from the motel for non-payment. He initially spent his evenings on the beach as he continued to work at the sandwich shop until phoning his father and asking to return to Ohio in September of the same year.       After his return to Ohio, Dahmer initially resided with his father and stepmother and insisted on being delegated numerous chores to occupy his time while he looked for work. He continued to drink heavily, and two weeks after his return Dahmer was arrested for ": null
    },
    {
        "drunk and disorderly conduct": "Public Intoxication"
    },
    {
        ", for which he was fined $60 and given a ": null
    },
    {
        "suspended 10-day jail sentence": "Suspended Sentence"
    },
    {
        ". Dahmers father tried unsuccessfully to wean his son off alcohol. In December 1981, Dahmers father and stepmother sent him to live with his grandmother in ": null
    },
    {
        "West Allis": "West Allis, Wisconsin"
    },
    {
        ", Wisconsin. Dahmers grandmother was the only family member to whom he displayed any affection. They hoped that her influence, plus the change of scenery, might inspire Dahmer to refrain from alcohol, find a job, and live responsibly.     Initially, Dahmers living arrangements with his grandmother were harmonious: he accompanied her to church; willingly undertook chores; actively sought work; and abided by most of her house rules . This new influence in his life initially brought results and, in early 1982, Dahmer found employment as a ": null
    },
    {
        "phlebotomist": "Phlebotomy"
    },
    {
        " at the Milwaukee Blood Plasma Center. He held this job for a total of 10 months before being laid off. He remained unemployed for over two years, during which he lived upon whatever money his grandmother gave him.     Shortly before losing his job, Dahmer was arrested for ": null
    },
    {
        "indecent exposure": "Indecent Exposure"
    },
    {
        ". On August 7, 1982, at ": null
    },
    {
        "Wisconsin State Fair Park": "Wisconsin State Fair Park"
    },
    {
        ", Dahmer was observed to expose himself to a crowd of 25 women and children. For this incident, he was convicted and fined $50 plus ": null
    },
    {
        "court costs": "Court Costs"
    },
    {
        ".     In January 1985, Dahmer was hired as a mixer at the Milwaukee Ambrosia Chocolate Factory, where he worked from 11 p.m to 7 a.m. six nights per week, with Saturday evenings off. Shortly after Dahmer found this employment, an incident occurred in which he was propositioned by another man while sitting reading in the West Allis Public Library. The stranger threw Dahmer a note offering to perform ": null
    },
    {
        "fellatio": "Fellatio"
    },
    {
        " upon him. Although Dahmer did not respond to this proposition, the incident stirred in his mind the fantasies of control and dominance he had developed as a teenager, and he began to familiarize himself with Milwaukees ": null
    },
    {
        "gay bar": "Gay Bar"
    },
    {
        "s, bookstores and ": null
    },
    {
        "gay bathhouse": "Gay Bathhouse"
    },
    {
        "s. He is also known to have stolen a male ": null
    },
    {
        "mannequin": "Mannequin"
    },
    {
        " from a store, which he briefly used for sexual stimulation, until his grandmother discovered the item stowed in a closet and demanded that he discard it.     By late 1985, he had begun to regularly frequent the bathhouses, which he later described as being relaxing places , but during his sexual encounters, he became frustrated at his partners moving during the sexual act. Following his arrest, he stated: I trained myself to view people as objects of pleasure instead of people . For this reason, beginning in June 1986, he administered ": null
    },
    {
        "sleeping pills": "Hypnotic"
    },
    {
        " to his partners, giving them liquor laced with the sedatives, then raping their unconscious bodies. After approximately 12 such instances, the bathhouses administration revoked Dahmers membership, and he began to use hotel rooms to continue this practice.     Shortly after his membership of the bathhouses was revoked, Dahmer read a report in a newspaper regarding the upcoming funeral of an 18-year-old male. He conceived the idea of stealing the freshly interred corpse and taking it home.  According to Dahmer, he attempted to dig the coffin from the ground, but found the soil too hard, before abandoning the plan.     In August 1986, Dahmer was arrested for masturbating in front of two 12-year-old boys as he stood close to the ": null
    },
    {
        "Kinnickinnic River": "Kinnickinnic River"
    },
    {
        ".  Dahmer initially admitted the offense and was again charged with indecent exposure, but quickly changed his story and claimed he had merely been urinating, unaware that there were witnesses. The charge was changed to ": null
    },
    {
        "disorderly conduct": "Disorderly Conduct"
    },
    {
        " and, on March 10, 1987, Dahmer was sentenced to one year of ": null
    },
    {
        "probation": "Probation"
    },
    {
        ", with additional instructions he was to undergo counseling.           On November 20, 1987, Dahmer—at the time residing with his grandmother in West Allis, Wisconsin—encountered a 25-year-old man from ": null
    },
    {
        "Ontonagon, Michigan": "Ontonagon, Michigan"
    },
    {
        " named Steven Tuomi at a bar and persuaded him to return to the Ambassador Hotel in Milwaukee, Wisconsin, where Dahmer had rented a room for the evening. According to Dahmer, he had no intention of murdering Tuomi, but rather intended to drug and rape him as he lay unconscious. The following morning, however, he awoke to find Tuomi lying beneath him on the bed, his chest crushed in and black and blue with bruises. Blood was also seeping from the corner of his mouth, and Dahmers fists and one forearm were extensively bruised. Dahmer stated he had no memory of having killed Tuomi,  and later informed investigators that he could not believe this had happened.     To dispose of Tuomis body, he purchased a large suitcase in which he transported the body to his grandmothers residence. There, one week later, he severed the head, arms, and legs from the torso, then filleted the bones from the body before cutting the flesh into pieces small enough to handle. He then placed the flesh inside plastic garbage bags. He wrapped the bones inside a sheet and pounded them into ": null
    },
    {
        "splinters": "Splinter"
    },
    {
        "with a sledgehammer. The entire dismemberment process took Dahmer approximately two hours to complete, and he disposed of all of Tuomis remains—excluding the severed head—in the trash.     For a total of two weeks following Tuomis murder, Dahmer retained the victims head wrapped in a blanket. After two weeks, Dahmer boiled the head in a mixture of Soilex  and bleach in an effort to retain the skull, which he then used as stimulus for masturbation. Eventually, the skull was rendered too brittle by this bleaching process, so Dahmer pulverized and disposed of it.       Following the murder of Tuomi, Dahmer began to actively seek victims, most of whom he encountered in or close to gay bars, and whom he typically lured to his grandmothers home. There, he drugged them before or shortly after engaging in sexual activity with them. Once he had rendered the victim unconscious with sleeping pills, he killed them by strangulation.     Two months after the murder of Steven Tuomi, Dahmer encountered a 14-year-old Native American ": null
    },
    {
        "male prostitute": "Male Prostitute"
    },
    {
        " named James Doxtator; Dahmer lured the youth to his home with an offer of $50 to pose for nude pictures. At Dahmers West Allis residence, the pair engaged in sexual activity before Dahmer drugged Doxtator and strangled him on the floor of the cellar. Dahmer left the body in the cellar for one week before dismembering it in much the same manner as he had with Tuomi. He placed all of Doxtators remains in the trash. He boiled the skull, and initially retained it before pulverizing it.     On March 24, 1988, Dahmer met a 22-year-old ": null
    },
    {
        "bisexual": "Bisexuality"
    },
    {
        " man named Richard Guerrero outside a gay bar called The Phoenix. Dahmer lured Guerrero to his grandmothers residence, although the incentive on this occasion was $50 to simply spend the remainder of the night with him; he then drugged Guerrero with sleeping pills and strangled him with a leather strap, with Dahmer then performing ": null
    },
    {
        "oral sex": "Oral Sex"
    },
    {
        " upon the corpse. Guerreros body was dismembered within 24  hours of his murder, with the remains again disposed of in the trash and the skull again retained before being pulverized several months later.     On April 23, Dahmer lured another young man to his house; however, after giving the victim a drugged coffee, both he and the victim heard Dahmers grandmother call, Is that you, Jeff?  Although Dahmer replied in a manner that led his grandmother to believe he was alone, his grandmother did observe that Dahmer was not alone. Because of this, Dahmer opted not to kill this particular victim, instead waiting until he had become unconscious before taking him to the County General Hospital.      In September 1988, Dahmers grandmother asked him to move out of her house because of his habit of bringing young men to her house late at night and the foul smells emanating from both the basement and the garage. Dahmer found a one-bedroom apartment on North 25th Street and moved into his new residence on September 25. The following day, Dahmer was arrested for drugging and ": null
    },
    {
        "sexually fondling": "Child Sexual Abuse"
    },
    {
        " a 13-year-old boy whom he had lured to his home on the pretext of posing nude for photographs. In January 1989, Dahmer was convicted of second-degree ": null
    },
    {
        "sexual assault": "Sexual Assault"
    },
    {
        " and of enticing a child for immoral purposes. Sentencing for the assault was suspended until May 1989. On March 20, Dahmer commenced a 10-day Easter absence from work, during which he moved back into his grandmothers home.     Two months after his conviction and two months prior to his sentencing for the sexual assault, Dahmer murdered his fifth victim. He was a ": null
    },
    {
        "mixed-race": "Mixed-Race"
    },
    {
        " 24-year-old aspiring model named Anthony Sears, whom Dahmer met at a gay bar on March 25, 1989. According to Dahmer, on this particular occasion, he was not looking to commit a crime; however, shortly before ": null
    },
    {
        "closing time": "Last Call"
    },
    {
        " that evening, Sears just started talking to me . Dahmer lured Sears to his grandmothers home, where the pair engaged in oral sex before Dahmer drugged and strangled Sears.     The following morning, Dahmer placed the corpse in his grandmothers bathtub, where he decapitated the body before attempting to ": null
    },
    {
        "flay": "Flaying"
    },
    {
        " the corpse. He then stripped the flesh from the body and pulverized the bones, which were again disposed of in the trash. According to Dahmer, he found Sears exceptionally attractive , and Sears was the first victim from whom he permanently retained any body parts: he preserved Sears head and genitalia in ": null
    },
    {
        "acetone": "Acetone"
    },
    {
        " and stored them in his work locker. When he moved to a new address the following year, he took the remains there.     On May 23, 1989, Dahmer was sentenced to five years probation and one year in the House of Correction, with ": null
    },
    {
        "work release": "Work Release"
    },
    {
        " permitted in order that he be able to keep his job; he was also required to register as a ": null
    },
    {
        "sex offender": "Sex Offender"
    },
    {
        ".     Two months before his scheduled release from the work camp, Dahmer was paroled from this regime.  On release, Dahmer temporarily moved back to his grandmothers home in West Allis before, in May 1990, moving into the Oxford Apartments, located on North 25th Street in Milwaukee. Although located in a high crime area, the apartment was close to his workplace, was furnished and, at $300 per month inclusive of all bills excluding electricity, was economical.           On May 14, 1990, Dahmer moved out of his grandmothers house and into 924 North 25th Street, Apartment 213, taking Anthony Sears ": null
    },
    {
        "mummified": "Mummification"
    },
    {
        " head and genitals with him. Within one week of his moving into his new apartment, Dahmer had killed his sixth victim, Raymond Smith. Smith was a 32-year-old male prostitute whom Dahmer lured to Apartment 213 with the promise of $50 for sex. At Dahmers apartment, he gave Smith a drink laced with seven sleeping pills and manually strangled him.     The following day, Dahmer purchased a Polaroid camera with which he took several pictures of Smiths body in suggestive positions before dismembering him in the bathroom. He boiled the legs, arms, and pelvis in a steel kettle with Soilex, which allowed him to then rinse the bones in his sink. He dissolved the remainder of Smiths skeleton—excluding the skull—in a container filled with acid. Dahmer later spray-painted Smiths skull, which he placed alongside the skull of Anthony Sears upon a black towel inside a metal filing-cabinet.     Approximately one week after the murder of Raymond Smith, on or about May 27, Dahmer lured another young man to his apartment. On this occasion, however, Dahmer himself accidentally consumed the drink laden with sedatives intended for consumption by his guest. When he awoke the following day, he discovered his intended victim had stolen several items of his clothing, $300, and a watch. Dahmer never reported this incident to the police, although on May 29, he divulged to his probation officer that he had been robbed.     In June 1990, Dahmer lured a 27-year-old acquaintance named Edward Smith to his apartment. He drugged and strangled Smith. On this occasion, rather than immediately acidifying the skeleton or repeating previous processes of bleaching , Dahmer placed Smiths skeleton in his freezer for several months in the hope it would not retain moisture. Freezing the skeleton did not remove moisture, and the skeleton of this victim would be acidified several months later. Dahmer accidentally destroyed the skull when he placed it in the oven to dry—a process that caused the skull to explode. Dahmer himself was to later inform police he had felt rotten about Smiths murder as he had been unable to retain any parts of his body.          Less than three months after the murder of Smith, Dahmer encountered a 22-year-old Chicago native named Ernest Miller on the corner of North 27th Street. Miller agreed to accompany Dahmer to his apartment for $50 and further agreed to allow him to listen to his heart and stomach. When Dahmer attempted to perform oral sex upon Miller, he was informed: Thatll cost you extra,  whereupon Dahmer gave his intended victim a drink laced with two sleeping pills.     On this occasion, he had only two sleeping pills to give his victim. Therefore, he killed Miller by slashing his ": null
    },
    {
        "carotid artery": "Carotid Artery"
    },
    {
        " with the same knife he used to dissect his victims bodies. Miller bled to death within minutes. Dahmer then posed the nude body for various suggestive Polaroid photographs before placing the body in his bathtub for dismemberment. Dahmer repeatedly kissed and talked to the severed head while he dismembered the remainder of the body.     He wrapped Millers heart, biceps, and portions of flesh from the legs in plastic bags and placed them in the fridge for later consumption. Dahmer boiled the remaining flesh and organs into a jelly-like substance using Soilex, which again enabled him to rinse the flesh off the skeleton, which he intended to retain. To preserve the skeleton, he placed the bones in a light bleach solution for 24  hours before allowing them to dry upon a cloth for one week; the severed head was initially placed in the refrigerator before also being stripped of flesh, then painted and coated with enamel.     Three weeks after the murder of Ernest Miller, on September 24, Dahmer encountered a 22-year-old man named David Thomas at the ": null
    },
    {
        "Grand Avenue Mall": "Shops Of Grand Avenue"
    },
    {
        " and persuaded him to return to his apartment for a few drinks, with additional money on offer if he would pose for photographs. In his statement to police after his arrest, Dahmer stated that, after giving Thomas a drink laden with sedatives, he did not feel attracted to him, but was afraid to allow him to awake in case he would be angry over having been drugged. Therefore, he strangled him and dismembered the body—intentionally retaining no body parts whatsoever. He photographed the dismemberment process and retained these photographs, which later aided in Thomass subsequent identification.     Following the murder of David Thomas, Dahmer did not kill anyone for almost five months, although on a minimum of five occasions between October 1990 and February 1991, he unsuccessfully attempted to lure men to his apartment. He is also known to have regularly complained of feelings of both ": null
    },
    {
        "anxiety": "Anxiety"
    },
    {
        " and depression to his probation officer throughout 1990; with frequent references to his sexuality, his solitary lifestyle, and financial difficulties. On several occasions, he is also known to have referred to harboring suicidal thoughts.       In February 1991, Dahmer observed a 17-year-old named Curtis Straughter standing at a bus stop near ": null
    },
    {
        "Marquette University": "Marquette University"
    },
    {
        ". According to Dahmer, he lured Straughter into his apartment with an offer of money for posing for nude photos, with the added incentive of sexual intercourse. Dahmer drugged and strangled Straughter with a leather strap, then dismembered him, with Dahmer retaining the youths skull, hands, and genitals and photographing each stage of the dismemberment process.     Less than two months later, on April 7, Dahmer encountered a 19-year-old named Errol Lindsey  walking to get a key cut. Lindsey was heterosexual. Dahmer lured Lindsey to his apartment, where he drugged him, drilled a hole in his skull and poured ": null
    },
    {
        "hydrochloric acid": "Hydrochloric Acid"
    },
    {
        " into it. According to Dahmer, Lindsey awoke after this experiment , saying: I have a headache. What time is it?       In response to this, Dahmer again drugged Lindsey, then strangled him. He decapitated Lindsey and retained his skull; he then flayed Lindseys body, placing the skin in a solution of cold water and salt for several weeks in the hope of permanently retaining it. Reluctantly, Dahmer disposed of Lindseys skin when he noted it had become too frayed and brittle.     By 1991, fellow residents of the Oxford Apartments had repeatedly complained to the manager of the Oxford Apartments, Sopa Princewill, of the foul smells emanating from Apartment 213, in addition to the sounds of falling objects and the occasional sound of a chainsaw.  Princewill did contact Dahmer in response to these complaints on several occasions, although Dahmer initially excused the odors emanating from his apartment as being caused by his freezer breaking, causing the contents to become spoiled . On later occasions, he informed Princewill that the reason for the resurgence of the odor was that several of his tropical fish had recently died, and that he would take care of the matter.     On the afternoon of May 26, 1991, Dahmer encountered a 14-year-old named Konerak Sinthasomphone on Wisconsin Avenue. He approached the youth with an offer of money to accompany him to his apartment to pose for Polaroid pictures. According to Dahmer, Sinthasomphone—the younger brother of the boy whom he had molested in 1988—was initially reluctant to the proposal, before changing his mind and accompanying Dahmer to his apartment, where the youth posed for two pictures in his underwear before Dahmer drugged him into unconsciousness and performed oral sex on him.     On this occasion, Dahmer drilled a single hole into Sinthasomphones skull, through which he injected hydrochloric acid into the ": null
    },
    {
        "frontal lobe": "Frontal Lobe"
    },
    {
        ". Before Sinthasomphone fell unconscious, Dahmer led the boy into his bedroom, where the body of 31-year-old Tony Hughes, whom Dahmer had killed three days earlier, lay naked on the floor. According to Dahmer, he believed saw this body, yet did not react to seeing the bloated corpse—likely because of the effects of the sleeping pills he had ingested and the hydrochloric acid Dahmer had injected through his skull. Sinthasomphone soon became unconscious, whereupon Dahmer drank several beers while lying alongside Sinthasomphone before leaving his apartment to drink at a bar, then purchase more alcohol.     In the early morning hours of May 27, Dahmer returned toward his apartment to discover Sinthasomphone sitting outside naked on the corner of 25th and State, talking in ": null
    },
    {
        "Lao": "Lao Language"
    },
    {
        ", with three distressed young women standing near him.  Dahmer approached the trio and explained to the women that Sinthasomphone  was his friend, and attempted to lead him to his apartment by the arm. The three women dissuaded Dahmer, explaining they had phoned 911.     Upon the arrival of two officers named ": null
    },
    {
        "John Balcerzak": "John Balcerzak"
    },
    {
        " and Joseph Gabrish, Dahmers demeanor relaxed: he informed the officers that Sinthasomphone was his 19-year-old boyfriend, that he had drunk too much following a quarrel,  and that he frequently behaved in this manner when ": null
    },
    {
        "intoxicated": "Alcohol Intoxication"
    },
    {
        ". The three women were exasperated and when one of the trio attempted to indicate to one of the officers that Sinthasomphone was bleeding from his buttocks and that he had seemingly struggled against Dahmers attempts to walk him to his apartment, the officer harshly informed her to butt out,  shut the hell up  and to not interfere, adding the incident was ": null
    },
    {
        "domestic": "Domestic Violence"
    },
    {
        ".      Against the protests of the three women, the officers simply covered Sinthasomphone with a towel and walked him to Dahmers apartment where, in an effort to verify his claim that he and Sinthasomphone were lovers, Dahmer showed the officers the two semi-nude Polaroid pictures he had taken of the youth the previous evening. The officers later reported having noted a strange scent reminiscent of excrement inside the apartment .  Dahmer stated that to investigate this, one officer simply peeked his head around the bedroom but really didnt take a good look. The officers then left, with a departing remark that Dahmer take good care of Sinthasomphone.     Had they conducted a background check on Dahmer, it would have revealed that he was a convicted ": null
    },
    {
        "child molester": "Child Molestation"
    },
    {
        " under probation. Upon the departure of the two police officers from his apartment, Dahmer again injected hydrochloric acid into Sinthasomphones brain. On this second occasion, the injection proved fatal. The following day, May 28, Dahmer took a days leave from work to devote himself to the dismemberment of the bodies of Sinthasomphone and Hughes. He retained both victims skulls.     On June 30, Dahmer traveled to Chicago, where he encountered a 20-year-old named Matt Turner at a bus station. Turner accepted Dahmers offer to travel to Milwaukee for a ": null
    },
    {
        "professional photo shoot": "Photo Shoot"
    },
    {
        ". At Dahmers apartment, Dahmer drugged, strangled and dismembered Turner and placed his head and internal organs in separate plastic bags in the freezer. Turner was not reported missing. Five days later, on July 5, Dahmer lured 23-year-old Jeremiah Weinberger from a Chicago bar to his apartment on the promise of spending the weekend with him. He drugged Weinberger and twice injected boiling water through his skull, sending him into a coma from which he died two days later.     On July 15, Dahmer encountered 24-year-old Oliver Lacy at the corner of 27th and Kilbourn. Lacy agreed to Dahmers ruse of posing nude for photographs and accompanied him to his apartment, where the pair engaged in tentative sexual activity before Dahmer drugged Lacy. On this occasion, Dahmer intended to prolong the time he spent with Lacy while alive. After unsuccessfully attempting to render Lacy unconscious with ": null
    },
    {
        "chloroform": "Chloroform"
    },
    {
        ", he phoned his workplace to request a days absence; this was granted, although the next day, he was suspended.     After strangling Lacy, Dahmer had sex with the corpse before dismembering him. He placed Lacys head and heart in the refrigerator and his skeleton in the freezer. Four days later, on July 19, Dahmer received word that he was fired. Upon receipt of this news, Dahmer lured 25-year-old Joseph Bradehoft to his apartment. Bradehoft was strangled and left lying on Dahmers bed covered with a sheet for two days. On July 21, Dahmer removed these sheets to find the head covered in maggots, whereupon he decapitated the body, cleaned the head and placed it in the refrigerator. He later acidified Bradehofts torso along with those of two other victims killed within the previous month.         On July 22, 1991, Dahmer approached three men with an offer of $100 to accompany him to his apartment to pose for nude photographs, drink beer and simply keep him company. One of the trio, 32-year-old Tracy Edwards, agreed to accompany him to his apartment. Upon entering Dahmers apartment, Edwards noted a foul odor and several boxes of hydrochloric acid on the floor, which Dahmer claimed to use for cleaning bricks. After some minor conversation, Edwards responded to Dahmers request to turn his head and view his tropical fish, whereupon Dahmer placed a handcuff upon his wrist. When Edwards asked, Whats happening? Dahmer unsuccessfully attempted to cuff his wrists together, then told Edwards to accompany him to the bedroom to pose for nude pictures. While inside the bedroom, Edwards noted nude male posters on the wall and that a ": null
    },
    {
        "videotape": "Videotape"
    },
    {
        " of  The Exorcist III  was playing;  he also noted a blue ": null
    },
    {
        "57-gallon drum": "Drum"
    },
    {
        " in the corner, from which a strong odor emanated.     Dahmer then brandished a knife and informed Edwards he intended to take nude pictures of him. In an attempt to appease Dahmer, Edwards unbuttoned his shirt, saying he would allow him to do so if he would remove the handcuffs and put the knife away. In response to this promise, Dahmer simply turned his attention towards the TV. Edwards observed Dahmer rocking back and forth and ": null
    },
    {
        "chant": "Chant"
    },
    {
        "ing before turning his attention back to him. He placed his head on Edwards chest, listened to his ": null
    },
    {
        "heartbeat": "Cardiac Cycle"
    },
    {
        " and, with the knife pressed against his intended victim, informed Edwards he intended to eat his heart.     In continuous attempts to prevent Dahmer from attacking him, Edwards repeated that he was Dahmers friend and that he was not going to run away. Edwards had decided he was going to either jump from a window or run through the unlocked front door upon the next available opportunity. When Edwards next stated he needed to use the bathroom, he asked if they could sit with a beer in the living room, where there was air conditioning, to which Dahmer consented, and the pair walked to the living room when Edwards exited the bathroom. Inside the living room, Edwards waited until he observed Dahmer have a momentary lapse of concentration before requesting to use the bathroom again. When Edwards rose from the couch, he noted Dahmer was not holding the handcuffs, whereupon Edwards punched him in the face, knocking Dahmer off balance, and ran out the front door.     At 11:30  p.m. on July 22, Edwards flagged down two Milwaukee police officers at the corner of North 25th Street. The officers noted Edwards had a handcuff attached to his wrist, whereupon Edwards explained to the officers that a freak had placed the handcuffs upon him and asked if the police could remove them. When the officers handcuff keys failed to fit the brand of handcuffs, Edwards agreed to accompany the officers to the apartment where, Edwards stated, he had spent the previous five hours before escaping.     When the officers and Edwards arrived at Apartment 213, Dahmer invited the trio inside and acknowledged he had indeed placed the handcuffs upon Edwards, although he offered no explanation as to why he had done so. At this point, Edwards divulged to the officers that Dahmer had also brandished a large knife upon him and that this had happened in the bedroom. Dahmer made no comment to this revelation, indicating to one of the officers, Rolf Mueller, that the key to the handcuffs was in his bedside dresser in the bedroom. As Mueller entered the bedroom, Dahmer attempted to pass Mueller to himself retrieve the key, whereupon the second officer present, Robert Rauth, informed him to back off .     In the bedroom, Mueller noted there was indeed a large knife beneath the bed. He also saw an open drawer which, upon closer inspection, contained scores of Polaroid pictures—many of which were of human bodies in various stages of dismemberment. Mueller noted the decor indicated they had been taken in the very apartment in which they were standing. He walked into the living room to show them to his partner, uttering the words, These are for real.      When Dahmer saw that Mueller was holding several of his Polaroids, he fought with the officers in an effort to resist arrest. The officers quickly overpowered him, cuffed his hands behind his back, and called a second squad car for backup. At this point, Mueller opened the refrigerator to reveal the freshly severed head of a black male on the bottom shelf. As Dahmer lay pinned on the floor beneath Rauth, he turned his head towards the officers and muttered the words: For what I did I should be dead.      A more detailed search of the apartment, conducted by the Criminal Investigation Bureau, revealed a total of four severed heads in Dahmers kitchen. A total of seven skulls—some painted, some bleached—were found in Dahmers bedroom and inside a closet. In addition, investigators discovered collected blood drippings upon a tray at the bottom of Dahmers refrigerator, plus two human hearts and a portion of arm muscle, each wrapped inside plastic bags upon the shelves. In Dahmers freezer, investigators discovered an entire torso, plus a bag of human organs and flesh stuck to the ice at the bottom.     Elsewhere in Apartment 213, investigators discovered two entire skeletons, a pair of severed hands, two severed and preserved penises, a mummified scalp and, in the 57-gallon drum, three further dismembered torsos dissolving in the acid solution. A total of 74 Polaroid pictures detailing the dismemberment of Dahmers victims were found. In reference to the recovery of body parts and artifacts at 924 North 25th Street, the ": null
    },
    {
        "chief medical examiner": "Coroner"
    },
    {
        " later stated: It was more like dismantling someones museum than an actual crime scene.        Beginning in the early hours of July 23, 1991, Dahmer was questioned by Detective Patrick Kennedy as to the murders he had committed and the evidence found at his apartment. Over the following two weeks, Kennedy and, later, Detective Patrick Murphy conducted numerous interviews with Dahmer which, when combined, totalled over 60 hours. Dahmer ": null
    },
    {
        "waived": "Waiver"
    },
    {
        " his right to have a lawyer present throughout his interrogations, adding he wished to confess all as he had created this horror and it only makes sense I do everything to put an end to it.  He readily admitted to having murdered 16 young men in Wisconsin since 1987, with one further victim—Steven Hicks—killed in Ohio back in 1978.     Most of the victims had been rendered unconscious prior to their murder, although some had died as a result of having acid or boiling water injected into their brain. As he had no memory of the murder of Tuomi, he was unsure whether he was unconscious when beaten to death, although he did concede it was possible that his viewing the exposed chest of Steven Tuomi while in a drunken stupor may have led him to unsuccessfully attempt to tear Tuomis heart from his chest. Almost all the murders Dahmer committed after moving into the Oxford Apartments had involved a ritual of posing the victims bodies in suggestive positions—typically with the chest thrust outwards—prior to dismemberment.     He readily admitted to performing ": null
    },
    {
        "necrophilia": "Necrophilia"
    },
    {
        " with several of his victims bodies, including performing sexual acts with their ": null
    },
    {
        "viscera": "Viscus"
    },
    {
        " as he dismembered their bodies in his bathtub. Having noted that much of the blood pooled inside his victims chest after death, Dahmer first removed their internal organs, then suspended the torso so the blood drained into his bathtub, before ": null
    },
    {
        "dicing": "Dicing"
    },
    {
        " any organs he did not wish to retain and paring the flesh from the body. The bones he wished to dispose of were pulverized or acidified, with Soilex and bleach solutions used to aid in the preservation of the skeletons and skulls he wished to keep. In addition, he confessed to having consumed the hearts, livers, biceps, and portions of thighs of several victims killed within the previous year.     Describing the increase in his rate of killing in the two months prior to his arrest, he stated he had been completely swept along  with his compulsion to kill, adding: It was an incessant and never-ending desire to be with someone at whatever cost. Someone good looking, really nice looking. It just filled my thoughts all day long.  When asked as to why he had preserved a total of seven skulls and the entire skeletons of two victims, Dahmer stated he had been in the process of constructing a private ": null
    },
    {
        "altar": "Altar"
    },
    {
        " of victims skulls which he had intended to display on the black table located in his living room and upon which he had photographed the bodies of many of his victims.     This display of skulls was to be adorned at each side with the complete skeletons of Ernest Miller and Oliver Lacy. The four severed heads found in his kitchen were to be removed of all flesh and used in this altar, as was the skull of at least one future victim. ": null
    },
    {
        "Incense sticks": "Incense"
    },
    {
        " were to be placed at each end of the black table, above which Dahmer intended to place a large blue lamp with extending blue globe lights. The entire construction was to be placed before a window covered with a black, opaque shower curtain, in front of which Dahmer intended to sit in a black leather chair. When asked in a November 18, 1991 interview who the altar was dedicated to, Dahmer replied: Myself ... It was a place where I could feel at home. He further described his intended altar as a place for ": null
    },
    {
        "meditation": "Meditation"
    },
    {
        ", from where he believed he could draw a sense of power, adding: If this had happened six months later, thats what they would have found.        On July 25, 1991, Dahmer was charged with four counts of ": null
    },
    {
        "first-degree murder": "First-Degree Murder"
    },
    {
        ". By August 22, he had been charged with a further 11 murders committed in the state of Wisconsin. On September 14, investigators in Ohio, having uncovered hundreds of bone fragments in woodland behind the address in which Dahmer had confessed to killing his first victim, formally identified two ": null
    },
    {
        "molars": "Molar"
    },
    {
        " and a ": null
    },
    {
        "vertebra": "Vertebral Column"
    },
    {
        " with X-ray records of Steven Mark Hicks.  Three days later, Dahmer was charged by authorities in Ohio with the murder of Steven Hicks.      Dahmer was not charged with the ": null
    },
    {
        "attempted murder": "Attempted Murder"
    },
    {
        " of Tracy Edwards, nor with the murder of Steven Tuomi. He was not charged with Tuomis murder because the Milwaukee County ": null
    },
    {
        "District Attorney": "District Attorney"
    },
    {
        " only brought charges where murder could be proven beyond a ": null
    },
    {
        "reasonable doubt": "Reasonable Doubt"
    },
    {
        " and Dahmer had no memory of actually committing this particular murder, for which no ": null
    },
    {
        "physical evidence": "Real Evidence"
    },
    {
        " of the crime existed. At a scheduled ": null
    },
    {
        "preliminary hearing": "Hearing"
    },
    {
        " on January 13, 1992,  Dahmer pleaded ": null
    },
    {
        "guilty but insane": "Insanity Defense"
    },
    {
        " to 15 counts of murder.       Jeffrey Dahmers trial began on January 30, 1992. He was tried in Milwaukee for the 15 counts of first-degree murder before Judge Laurence Gram. By pleading guilty on January 13 to the charges brought against him, Dahmer had waived his rights to an initial trial to establish guilt . The issue debated by opposing ": null
    },
    {
        "counsels": "Counsel"
    },
    {
        "at Dahmers trial was to determine whether he suffered from either a ": null
    },
    {
        "mental": "Mental Disorder"
    },
    {
        " or a ": null
    },
    {
        "personality disorder": "Personality Disorder"
    },
    {
        " the prosecution claiming that any disorders did not deprive Dahmer of the ability to appreciate the criminality of his conduct or to deprive him of the ability to resist his ": null
    },
    {
        "impulses": "Impulse"
    },
    {
        "; the defense arguing that Dahmer suffered from a mental disease and was driven by obsessions and impulses he was unable to control.     Defense experts argued that Dahmer was insane due to his necrophilic drive – his compulsion to have sexual encounters with corpses. Defense expert Dr. ": null
    },
    {
        "Fred Berlin": "Fred Berlin"
    },
    {
        " testified that Dahmer was unable to conform his conduct at the time that he committed the crimes because he was suffering from ": null
    },
    {
        "paraphilia": "Paraphilia"
    },
    {
        " or, more specifically, ": null
    },
    {
        "necrophilia": "Necrophilia"
    },
    {
        ". Dr. Judith Becker, a professor of psychiatry and psychology, was the second expert witness for the defense; Becker also diagnosed Dahmer with necrophilia. The final defense expert to testify, ": null
    },
    {
        "forensic psychiatrist": "Forensic Psychiatry"
    },
    {
        " Dr. Carl Wahlstrom, diagnosed Dahmer with ": null
    },
    {
        "borderline personality disorder": "Borderline Personality Disorder"
    },
    {
        ", ": null
    },
    {
        "schizotypal personality disorder": "Schizotypal Personality Disorder"
    },
    {
        ", necrophilia, ": null
    },
    {
        "alcohol dependence": "Alcohol Dependence"
    },
    {
        ", and a ": null
    },
    {
        "psychotic disorder": "Psychosis"
    },
    {
        ".       The prosecution rejected the defenses argument that Dahmer was insane. Forensic psychiatrist Dr. Phillip Resnick testified that Dahmer did not suffer from primary necrophilia because he preferred live sexual partners as evidenced by his efforts to create unresistant, submissive sexual partners devoid of rational thought and to whose needs he did not have to cater.  Another prosecution expert to testify, Dr. Fred Fosdel, testified to his belief that Dahmer was without mental disease or defect at the time he committed the murders. He described Dahmer as a calculating and cunning individual, able to differentiate between right and wrong, with the ability to control his actions.  Although Fosdel did state his belief that Dahmer suffered from paraphilia, his conclusion was that Dahmer was not a ": null
    },
    {
        "sadist": "Sadistic Personality Disorder"
    },
    {
        ".     The final witness to appear for the prosecution, forensic psychiatrist ": null
    },
    {
        "Park Dietz": "Park Dietz"
    },
    {
        ", began his testimony on February 12. Dietz testified that he did not believe Dahmer to be suffering from any mental disease or defect at the time that he committed the crimes, stating: Dahmer went to great lengths to be alone with his victim and to have no witnesses.  He explained that there was ample evidence that Dahmer prepared in advance for each murder, therefore, his crimes were not impulsive.  Although Dietz did concede any acquisition of a paraphilia was not a matter of personal choice, he also stated his belief that Dahmers habit of becoming intoxicated prior to committing each of the murders was significant, stating: If he had a compulsion to kill, he would not have to drink alcohol. He had to drink alcohol to overcome his inhibition, to do the crime which he would rather not do.     Dietz also noted that Dahmer strongly identified with evil and corrupt characters from both  Return of the Jedi  and The Exorcist III; particularly the level of power held by these characters. Expounding on the significance of these movies on Dahmers psyche and many of the murders committed at the Oxford Apartments, Dietz explained that Dahmer occasionally viewed scenes from these films before searching for a victim.  Dietz diagnosed Dahmer with ": null
    },
    {
        "substance use disorder": "Substance Use Disorder"
    },
    {
        ", paraphilia, and schizotypal personality disorder.     Two court-appointed mental health professionals—testifying independently of either prosecution or defense—were forensic psychiatrist George Palermo and clinical psychologist Samuel Friedman. Palermo stated that the murders were the result of a pent-up aggression within himself He killed those men because he wanted to kill the source of his homosexual attraction to them. In killing them, he killed what he hated in himself. Palermo concluded that Dahmer was a sexual sadist with ": null
    },
    {
        "antisocial personality disorder": "Antisocial Personality Disorder"
    },
    {
        ", but legally sane.     Friedman testified that it was a longing for companionship that caused Dahmer to kill. He stated, Mr. Dahmer is not ": null
    },
    {
        "psychotic": "Psychosis"
    },
    {
        ". He spoke kindly of Dahmer, describing him as Amiable, pleasant to be with, courteous, with a sense of humor, conventionally handsome, and charming in manner. He was, and still is, a bright young man.   He diagnosed Dahmer with a ": null
    },
    {
        "personality disorder not otherwise specified": "Personality Disorder Not Otherwise Specified"
    },
    {
        " featuring ": null
    },
    {
        "borderline": "Borderline Personality Disorder"
    },
    {
        ", ": null
    },
    {
        "obsessive-compulsive": "Obsessive-Compulsive Personality Disorder"
    },
    {
        ", and ": null
    },
    {
        "sadistic": "Sadistic Personality Disorder"
    },
    {
        " traits.      The trial lasted two weeks. On February 14, both counsels delivered their ": null
    },
    {
        "closing arguments": "Closing Argument"
    },
    {
        "to the jury. Each counsel was allowed to speak for two hours. Defense attorney Gerald Boyle argued first. Repeatedly harking to the testimony of the mental health professionals—almost all of whom had agreed Dahmer was suffering from a mental disease—Boyle argued that Dahmers compulsive killings had been a result of a sickness he discovered, not chose.  Boyle portrayed Dahmer as a desperately lonely and profoundly sick individual so out of control he could not conform his conduct any more.      Following the defense counsels 75-minute closing argument, Michael McCann delivered his closing argument for the prosecution, describing Dahmer as a sane man, in full control of his actions, who simply strove to avoid detection.  McCann argued that the act of murder was committed in hostility, anger, resentment, frustration, or hatred, and that the 15 victims for whose murder he was tried died merely to afford Dahmer a period of sexual pleasure. McCann further argued that by pleading guilty but insane to the charges, Dahmer was seeking to escape responsibility for his crimes.     On February 15, the court reconvened to hear the verdict: Dahmer was ruled to be sane and not suffering from a mental disorder at the time of each of the 15 murders for which he was tried, although in each count, two of the 12 jurors signified their ": null
    },
    {
        "dissent": "Dissent"
    },
    {
        ". On the first two counts, Dahmer was sentenced to life imprisonment plus ten years, , Time magazine, May 18, 1992 with the remaining 13 counts carrying a ": null
    },
    {
        "mandatory": "Mandate"
    },
    {
        " sentence of life imprisonment plus 70 years. The death penalty was not an option for Judge Gram to consider at the penalty phase as the State of Wisconsin had abolished capital punishment in 1853.     Upon hearing of Dahmers sentencing, his father Lionel and stepmother Shari requested to be allowed a ten-minute private meeting with their son before he was transferred to the ": null
    },
    {
        "Columbia Correctional Institution": "Columbia Correctional Institution"
    },
    {
        " in ": null
    },
    {
        "Portage": "Portage, Wisconsin"
    },
    {
        " to begin his sentence. This request was granted and the trio exchanged hugs and well-wishes before Dahmer was escorted away to begin his sentence.     Three months after his conviction for 15 murders in Milwaukee, Dahmer was ": null
    },
    {
        "extradited": "Extradition"
    },
    {
        " to Ohio to be tried for the murder of his first victim, Steven Hicks. In a court hearing lasting just 45 minutes,  Dahmer again pleaded guilty to the charges and was sentenced to a 16th term of life imprisonment on May 1, 1992.        Upon sentencing, Dahmer was transferred to the ": null
    },
    {
        "Columbia Correctional Institution": "Columbia Correctional Institution"
    },
    {
        " in ": null
    },
    {
        "Portage, Wisconsin": "Portage, Wisconsin"
    },
    {
        ". For the first year of his incarceration, Dahmer was placed in ": null
    },
    {
        "solitary confinement": "Solitary Confinement"
    },
    {
        " due to concerns for his physical safety should he come into contact with fellow inmates. With Dahmers consent, after one year in solitary confinement, he was transferred to a less secure unit, where he was assigned a two-hour daily work detail cleaning the toilet block.         Shortly after completing his lengthy confessions in 1991, Dahmer had requested to Detective Patrick Murphy that he be given a copy of the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        ". This request was granted and Dahmer gradually devoted himself to ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        " and became a ": null
    },
    {
        "born-again Christian": "Born Again"
    },
    {
        ". On his fathers urging, he also read ": null
    },
    {
        "creationist": "Creationist"
    },
    {
        " books from the ": null
    },
    {
        "Institute for Creation Research": "Institute For Creation Research"
    },
    {
        ".  In May 1994, Dahmer was ": null
    },
    {
        "baptized": "Baptism"
    },
    {
        " by ": null
    },
    {
        "Roy Ratcliff": "Roy Ratcliff"
    },
    {
        ", a minister in the ": null
    },
    {
        "Church of Christ": "Churches Of Christ"
    },
    {
        " and a graduate of ": null
    },
    {
        "Oklahoma Christian University": "Oklahoma Christian University"
    },
    {
        ", in the prison whirlpool.      Following his baptism, Ratcliff visited Dahmer on a weekly basis up until November 1994. Dahmer and Ratcliff regularly discussed the prospect of death, and Dahmer questioned whether he was ": null
    },
    {
        "sin": "Sin"
    },
    {
        "ning against God by continuing to live.  Referring to his crimes in a 1994 interview with ": null
    },
    {
        "Stone Phillips": "Stone Phillips"
    },
    {
        " on  Dateline NBC , Dahmer had stated: If a person doesnt think that there is a God to be accountable to, then whats the point of trying to modify your behavior to keep it within acceptable ranges? Thats how I thought anyway.      In July 1994, a fellow inmate, Osvaldo Durruthy, attempted to slash Dahmers throat with a razor embedded in a toothbrush as Dahmer returned to his cell from Roy Ratcliffs weekly church service conducted in the prison chapel.  Dahmer received superficial wounds and was not seriously hurt in this incident. According to Dahmers family, he had long been ready to die, and accepted any punishment which he might endure in prison. In addition to his father and stepmother maintaining regular contact, Dahmers mother, Joyce, also maintained regular contact with her son . Joyce Dahmer related that in her weekly phone calls, whenever she expressed concerns for her sons physical well-being, Dahmer responded with comments to the effect of: It doesnt matter, Mom. I dont care if something happens to me.       On the morning of November 28, 1994, Dahmer left his cell to conduct his assigned work detail. Accompanying him were two fellow inmates: ": null
    },
    {
        "Jesse Anderson": "Jesse Anderson"
    },
    {
        " and ": null
    },
    {
        "Christopher Scarver": "Christopher Scarver"
    },
    {
        ". The trio was left unsupervised in the showers of the prison gym for approximately 20  minutes. At approximately 8:10  a.m.  Dahmer was discovered on the floor of the bathrooms of the gym suffering from extreme head and facial wounds;  he had been severely bludgeoned about the head and face with a 20-inch metal bar.  His head had also been repeatedly struck against the wall in the assault. Although Dahmer was still alive and was rushed to a nearby hospital, he was pronounced dead one hour later. Anderson had also been beaten with the same instrument, and died two days later from his wounds.      Scarver, who was serving a life sentence for a murder committed in 1990, informed authorities he had first attacked Dahmer with the metal bar as he was cleaning a staff locker room, before attacking Anderson as he cleaned an inmate locker room. According to Scarver, Dahmer did not yell or make any noise as he was attacked. Immediately after attacking both men, Scarver, who was thought to be ": null
    },
    {
        "schizophrenic": "Schizophrenia"
    },
    {
        ", returned to his cell and informed a prison guard: God told me to do it. Jesse Anderson and Jeffrey Dahmer are dead.   Scarver was adamant he had not planned the attacks in advance,  although he later divulged to investigators he had concealed the 20-inch iron bar used to kill both men in his clothing shortly before the killings.     Upon learning of his death, Dahmers mother Joyce Flint responded angrily to the media: Now is everybody happy? Now that hes bludgeoned to death, is that good enough for everyone?  The response of the families of Dahmers victims was mixed, although it appears most were pleased with his death. The district attorney who prosecuted Dahmer cautioned against turning Scarver into a ": null
    },
    {
        "folk hero": "Folk Hero"
    },
    {
        ", noting that Dahmers death was still murder. On May 15, 1995, Scarver was sentenced to two additional terms of life imprisonment for the murders of Dahmer and Anderson.      Although Scarver had confessed in 1994 to having concealed the weapon used to kill Dahmer and Anderson in his clothing on the morning of the murders, in 2015, he publicly stated the murders of Dahmer and Anderson had resulted from a confrontation in which one of the two men had poked him in the back as the three had begun their assigned work detail. In this renewed account of events, Scarver claimed that the two had laughed at him when he had turned around in response before Dahmer and Anderson each walked to separate rooms to begin their cleaning duty, with Scarver following Dahmer toward the staff locker room.     Scarver alleges that immediately before murdering Dahmer, he had cornered him, presented a newspaper article detailing Dahmers crimes, and demanded that Dahmer answer whether the account was true. Scarver further alleged he had been revolted by Dahmers crimes and that Dahmer had been openly unrepentant; that Dahmer taunted prison employees and fellow inmates by shaping his prison food into imitations of severed limbs, complete with ketchup to simulate blood spattering; and that prison staff, knowing of Scarvers hatred for Dahmer, had deliberately left the two men unsupervised so that he could kill him.  Furthermore, Scarver stated that Dahmer was so disliked by fellow inmates that he required a personal escort of at least one ": null
    },
    {
        "guard": "Prison Guard"
    },
    {
        " whenever he was out of his cell to prevent inmates from attacking him.     Dahmer had stated in his ": null
    },
    {
        "will": "Will And Testament"
    },
    {
        " he wished for no services to be conducted and that he wished to be ": null
    },
    {
        "cremated": "Cremation"
    },
    {
        ".  In September 1995, Dahmers body was cremated, and his ashes divided between his parents.        Dahmers ": null
    },
    {
        "estate": "Estate"
    },
    {
        " was awarded to the families of 11 of his victims who had sued for damages. In 1996, Thomas Jacobson, a lawyer representing eight of the families, announced a planned auction of Dahmers estate. Although victims relatives stated the motivation was not greed, the announcement sparked controversy.   A civic group, Milwaukee Civic Pride, was quickly established in an effort to raise the funds to purchase and destroy Dahmers possessions. The group pledged $407,225, including a $100,000 gift by Milwaukee real estate developer Joseph Zilber, for purchase of Dahmers estate; five of the eight families represented by Jacobson agreed to the terms, and Dahmers possessions were subsequently destroyed and buried in an undisclosed Illinois ": null
    },
    {
        "landfill": "Landfill"
    },
    {
        ".      On August 5, 1991, a ": null
    },
    {
        "candlelight vigil": "Candlelight Vigil"
    },
    {
        " to celebrate and heal the Milwaukee community  was attended by more than 400 people. Present at the vigil were community leaders, gay rights activists, and family members of several of Dahmers victims. Organizers stated the purpose of the vigil was to enable Milwaukeeans to share their feelings of pain and anger over what happened .     The Oxford Apartments at 924 North 25th Street, where Dahmer had killed 12 of his victims, were demolished in November 1992.  The site is now a vacant lot. Alternate plans to convert the site into either a memorial garden, a playground, or to reconstruct new housing have failed to materialize.     Lionel Dahmer is retired and now lives with his second wife, Shari. Both have refused to change their surname and have professed their love of Jeffrey in spite of his crimes. In 1994, Lionel published a book, A Fathers Story, and donated a portion of the proceeds from his book to the victims families. Most of the families showed support for Lionel and Shari, although three families subsequently sued Lionel Dahmer: two for using their names in the book without obtaining prior consent;  and a third family—that of Steven Hicks—filing a ": null
    },
    {
        "wrongful death": "Wrongful Death Claim"
    },
    {
        " suit": "Lawsuit"
    },
    {
        " against Lionel Dahmer, Shari, and former wife Joyce, citing parental negligence as the cause for the claim.      Joyce Flint died of cancer in November 2000. Prior to her death, she had attempted suicide on at least one occasion.  Jeffreys younger brother, David, changed his surname and lives in anonymity.       Jeffrey Dahmer is known to have killed 17 young men between 1978 and 1991. Of these victims, 12 were killed in his North 25th Street apartment. Three further victims were murdered and dismembered at his grandmothers West Allis residence, with his first and second victims being murdered at his parents home in Bath, Ohio, and at the Ambassador Hotel in Wisconsin respectively. A total of 14 of Dahmers victims were from various ethnic minority backgrounds, with nine victims being black. Dahmer was adamant that the race of his victims was incidental to him and that it was the body form of a potential victim that attracted his attention.     Most of Dahmers victims were killed by strangulation after being drugged with sedatives, although his first victim was killed by a combination of bludgeoning and strangulation and his second victim was battered to death, with one further victim killed in 1990, Ernest Miller, dying of a combination of ": null
    },
    {
        "shock": "Acute Stress Reaction"
    },
    {
        " and blood loss due to his carotid artery being cut. Many of Dahmers victims killed in 1991 had holes bored into their skulls through which Dahmer injected hydrochloric acid or, later, boiling water, directly into the brain in an attempt to induce a permanent, submissive, unresistant state. On at least three occasions, this proved fatal although on none of these occasions was this Dahmers intention. June 18": null
    },
    {
        "Chippewa Lake Park": "Chippewa Lake Park"
    },
    {
        " in Bath, Ohio. By Dahmers admission, what caught his attention to Steven Hicks hitchhiking was the fact that the youth was bare-chested. He was bludgeoned with a dumbbell and strangled to death with this instrument before being dismembered. Remains pulverized and scattered in woodland behind Dahmers childhood home.       November 20January 16March 24 No remains were ever found.       March 25 His preserved skull and genitals were found in a filing cabinet at 924 North 25th Street following Dahmers arrest in 1991. May 20 The first victim to be killed at Dahmers North 25th Street apartment. Smith was a male sex worker whom Dahmer encountered at a tavern. Dahmer gave Smith a drink laced with sleeping pills, then strangled him on his kitchen floor. His skull was spray-painted and retained.   June 14 A known acquaintance of Dahmer who was last seen in his company at a party. Dahmer acidified Smiths skeleton; his skull was destroyed unintentionally when placed in the oven in an effort to remove moisture. No remains were ever found.   September 2": null
    },
    {
        "physique": "Physical Attractiveness"
    },
    {
        ". He was killed by having his carotid artery severed before being dismembered in the bathtub, with Dahmer storing his entire skeleton in the bottom drawer of a filing cabinet and his heart, biceps, and portions of his legs in the freezer for later consumption.   September 24 February 18April 7 His skull was found following Dahmers arrest.   May 24": null
    },
    {
        "deaf-mute": "Deaf-Mute"
    },
    {
        " whom Dahmer lured to his apartment upon the promise of posing nude for photographs. As Hughes was deaf, he and Dahmer communicated using handwritten notes. He was strangled and his body left on Dahmers bedroom floor for three days before being dismembered, with Dahmer photographing the dismemberment process. His skull was retained and identified from dental records. May 27June 30": null
    },
    {
        "Chicago Pride Parade": "Chicago Pride Parade"
    },
    {
        ". At a bus stop, he encountered a 20-year-old named Matt Turner and persuaded him to accompany him to Milwaukee to pose for a photo shoot. Turner was drugged, strangled, and then dismembered in the bathtub. His head and internal organs were put in the freezer and his torso subsequently placed in the 57-gallon drum Dahmer purchased on July 12. July 5 Weinbergers decapitated body was kept in the bathtub for a week before being dismembered; his torso was placed in the 57-gallon drum.   July 15 His skeleton was retained to adorn one side of the private shrine of skulls and skeletons Dahmer was in the process of creating when arrested one week later.   July 19": null
    },
    {
        "Minnesota": "Minnesota"
    },
    {
        " who was looking for work in Milwaukee at the time of his murder.  He was left on Dahmers bed for two days following his murder before, on July 21, being decapitated. His head was placed in the refrigerator and his torso in the 57-gallon drum.              The Secret Life: Jeffrey Dahmer  was released in 1993 and stars ": null
    },
    {
        "Carl Crew": "Carl Crew"
    },
    {
        " as Dahmer. ": null
    },
    {
        "Jeffrey Dahmer: The Secret Life": "Imdbtitle:0244782"
    },
    {
        " at imdb.com   The biographical film  Dahmer  was released in 2002. It stars ": null
    },
    {
        "Jeremy Renner": "Jeremy Renner"
    },
    {
        " in the title role and co-stars ": null
    },
    {
        "Bruce Davison": "Bruce Davison"
    },
    {
        " as Dahmers father, Lionel. Dahmer opened in theaters on June 21, 2002.   – IMDb. The DVD was released on October 27.  – IMDb    Raising Jeffrey Dahmer  was released in 2006. Revolving around the reactions of Dahmers parents following his arrest in 1991, it stars Rusty Sneary as Dahmer and co-stars Scott Cordes as Lionel.   In 2012, an independent documentary,  The Jeffrey Dahmer Files , premiered at the ": null
    },
    {
        "South by Southwest": "South By Southwest"
    },
    {
        " festival. It features interviews with Dahmers former neighbor, Pamela Bass, as well as Detective Patrick Kennedy, and the city ": null
    },
    {
        "medical examiner": "Medical Examiner"
    },
    {
        " Jeffrey Jentzen.  Los Angeles Times. March 10, 2012.   The ": null
    },
    {
        "Marc Meyers": "Marc Meyers"
    },
    {
        "-directed film, ": null
    },
    {
        "My Friend Dahmer": "My Friend Dahmer"
    },
    {
        ", premiered at the ": null
    },
    {
        "Tribeca Film Festival": "Tribeca Film Festival"
    },
    {
        " on April 25, 2017.  Based on ": null
    },
    {
        "the graphic novel": "My Friend Dahmer"
    },
    {
        " by ": null
    },
    {
        "John Backderf": "Derf"
    },
    {
        ", the film stars ": null
    },
    {
        "Ross Lynch": "Ross Lynch"
    },
    {
        " as Dahmer and chronicles his high school years and the events leading up to his first murder.                  The Trial of Jeffrey Dahmer was released in 1992. Directed by ": null
    },
    {
        "Elkan Allan": "Elkan Allan"
    },
    {
        ", this documentary largely focuses upon testimony delivered at Dahmers first trial. The documentary concludes with Dahmers addressing Judge Laurence Gram following his conviction.   The ": null
    },
    {
        "Investigation Discovery": "Investigation Discovery"
    },
    {
        " channel has also broadcast a documentary focusing upon Dahmer within its documentary series,  Most Evil . This documentary features excerpts of Dahmers 1994 interview with ": null
    },
    {
        "Stone Phillips": "Stone Phillips"
    },
    {
        " and was first broadcast in August 2006.   ": null
    },
    {
        "HLN": "Hln"
    },
    {
        " has broadcast an episode focusing upon Dahmers crimes as part of its investigative series, How it Really Happened. This episode, titled The Strange Case of Jeffrey Dahmer, was originally aired on March 31, 2017.    The digital cable and satellite television channel, ": null
    },
    {
        "Oxygen": "Oxygen"
    },
    {
        ", broadcast the two-part documentary, Dahmer on Dahmer: A Serial Killer Speaks, in November 2017. Produced and directed by Matthew Watts, the program features interviews with, among others, Dahmers father, stepmother, former classmates, psychiatrists who testified at his trial, and a homicide detective involved in the investigation.   Netflix Series Dark Tourist Season 1, Episode 3. Jul 20, 2018.         The Law of Remains  by experimental writer and director ": null
    },
    {
        "Reza Abdoh": "Reza Abdoh"
    },
    {
        " uses the techniques of ": null
    },
    {
        "Artauds": "Antonin Artaud"
    },
    {
        " Theatre of Cruelty": "Theatre Of Cruelty"
    },
    {
        " to depict the life and crimes of Dahmer.    Zombie by actor and writer Bill Connington, based on the ": null
    },
    {
        "novel of the same name": "Zombie"
    },
    {
        " by ": null
    },
    {
        "Joyce Carol Oates": "Joyce Carol Oates"
    },
    {
        ", uses Dahmer as the model for the central character. ": null
    }
]