[
    {
        "Count Johann von Werth , also Jan von Werth or in French Jean de Werth, was a German ": null
    },
    {
        "general": "General"
    },
    {
        " of ": null
    },
    {
        "cavalry": "Cavalry"
    },
    {
        " in the ": null
    },
    {
        "Thirty Years War": "Thirty Years War"
    },
    {
        ".       Werth was born in 1591 at ": null
    },
    {
        "Büttgen": "Büttgen"
    },
    {
        " in the ": null
    },
    {
        "Duchy of Jülich": "Duchy Of Jülich"
    },
    {
        " as the eldest son of lesser noble Johann von Wierdt and Elisabeth Streithoven. He had eight brothers and sisters. At an early age he left home to become a soldier of fortune in the Walloon cavalry in the ": null
    },
    {
        "Spanish Netherlands": "Spanish Netherlands"
    },
    {
        ". In 1622, at the taking of ": null
    },
    {
        "Jülich": "Jülich"
    },
    {
        ", he won promotion to the rank of lieutenant. He served as a colonel of cavalry in the ": null
    },
    {
        "Bavaria": "Bavaria"
    },
    {
        "n army in 1630. He obtained the command of a regiment, both titular and effective, in 1632, and in 1633 and 1634 laid the foundations of his reputation as a swift and terrible leader of ": null
    },
    {
        "cavalry": "Cavalry"
    },
    {
        " forays. His services were even more conspicuous in the great pitched ": null
    },
    {
        "Battle of Nördlingen ": "Battle Of Nördlingen"
    },
    {
        ", after which the emperor made him a Freiherr of the Empire, and the ": null
    },
    {
        "elector of Bavaria": "Maximilian I, Elector Of Bavaria"
    },
    {
        " gave him the rank of lieutenant field-marshal. About this time he armed his regiment with the ": null
    },
    {
        "musket": "Musket"
    },
    {
        " as well as the ": null
    },
    {
        "sword": "Sword"
    },
    {
        ".           In 1635 and 1636 Werths forays extended into ": null
    },
    {
        "Lorraine": "Lorraine"
    },
    {
        " and ": null
    },
    {
        "Luxembourg": "Luxembourg"
    },
    {
        ", after which he projected an expedition into the heart of France. Starting in July 1636, from the country of the lower ": null
    },
    {
        "Meuse": "Meuse River"
    },
    {
        ", he raided far and wide, and even urged his commander in chief, the cardinal infante, to plant the double eagle on the ": null
    },
    {
        "Louvre": "Louvre"
    },
    {
        " . Though this was not attempted. Werths horsemen appeared at Saint-Denis before the a French army of fifty thousand men at ": null
    },
    {
        "Compiègne": "Compiègne"
    },
    {
        " forced the invaders to retreat. The memory of this raid lasted long, and the name of Jean de Wert figures in folk-songs and serves as a bogey to quieten unruly children.     In 1637 Werth was once more in the ": null
    },
    {
        "Rhine": "Rhine"
    },
    {
        " valley, destroying convoys, relieving besieged towns and surprising the enemys camps. In February 1638 he defeated the ": null
    },
    {
        "Weimar": "Weimar, Germany"
    },
    {
        " troops in an engagement at ": null
    },
    {
        "Rheinfelden": "Rheinfelden"
    },
    {
        ", but shortly afterwards was made prisoner by ": null
    },
    {
        "Bernhard of Saxe-Weimar": "Bernhard Of Saxe-Weimar"
    },
    {
        ". His hopes of being exchanged for the ": null
    },
    {
        "Swedish": "Sweden"
    },
    {
        " field marshal ": null
    },
    {
        "Gustaf Horn": "Gustaf Horn"
    },
    {
        " were disappointed for Bernhard had to deliver up his captive to the French. The terrible Jean de Wert was brought to Paris, amidst great rejoicings from the country people. He was lionized by the society of the capital, visited in prison by high ladies. So light was his captivity that he said that nothing bound him but his word of honour. His release, which was delayed until March 1642 because the imperial government feared to see Horn at the head of the Swedish army and would not allow an exchange.     When at last Werth reappeared in the field it was as general of cavalry in the imperial and Bavarian and ": null
    },
    {
        "Cologne": "Cologne"
    },
    {
        " services. His first campaign against the French marshal ": null
    },
    {
        "Guebriant": "Jean-Baptiste Budes, Comte De Guébriant"
    },
    {
        " was uneventful, but his second in which Baron ": null
    },
    {
        "Franz von Mercy": "Franz Von Mercy"
    },
    {
        " was his commander-in-chief, ended with the ": null
    },
    {
        "battle of Tuttlingen": "Battle Of Tuttlingen"
    },
    {
        " in which Werth was instrumental in a surprise victory. In 1644 he was in the lower Rhine country, but he returned to Mercys headquarters in time to fight in the ": null
    },
    {
        "battle of Freiburg": "Battle Of Freiburg"
    },
    {
        ". In the following year he played a decisive role in the ": null
    },
    {
        "second battle of Nördlingen": "Second Battle Of Nördlingen"
    },
    {
        ". Mercy was killed in this action, and Werth temporarily commanded the defeated arm until succeeded by Field-marshal ": null
    },
    {
        "Geleen": "Gottfried Huyn Von Geleen"
    },
    {
        ". Werth was disappointed, but remained thoroughly loyal to his soldierly code of honour, and found an outlet for his anger in renewed military activity.     In 1647 differences arose between the elector and the emperor as to the allegiance due from the Bavarian troops, in which, after long hesitation, Werth, fearing that the cause of the Empire and of the Catholic religion would be ruined if the elector resumed control of the troops, attempted to take his men over the Austrian border. But they refused to follow and, escaping with great difficulty from the electors vengeance, Werth found a refuge in Austria. The emperor was grateful for his conduct in this affair, ordered the elector to rescind his ban, and made Werth a count. The last campaign of the war was uneventful, and shortly after its close he retired to live on the estates which he had bought in the course of his career, and on one of these, ": null
    },
    {
        "Benatek": "Benátky Nad Jizerou"
    },
    {
        "  NE of ": null
    },
    {
        "Prague": "Prague"
    },
    {
        " in ": null
    },
    {
        "Bohemia": "Bohemia"
    },
    {
        ", a gift from the emperor, he died on 16 of January 1652.  He was buried in the church of Nativity of the Virgin Mary in Benátky.                  Johann von Werths life became a popular legend in the ": null
    },
    {
        "Rhineland": "Rhineland"
    },
    {
        " and ": null
    },
    {
        "Cologne": "Cologne"
    },
    {
        " that is frequently reenacted at ": null
    },
    {
        "Karneval": "Carnival In Germany, Switzerland And Austria"
    },
    {
        " time:     The poor peasant Jan fell in love with Griet but she wanted a wealthier partner and declined his offer of marriage. Devastated by her rejection he came upon an army recruiter and signed up to go to war. Through hard work and good fortune he rose to become a general, celebrating several victories. After taking the fort at Hermannstein he was leading his triumphant troops into Cologne through ": null
    },
    {
        "St. Severins Gate": ":De:Severinstorburg"
    },
    {
        ", when he saw his former love Griet selling fruit at a market. Griet was filled with regret at turning down such a successful person and exclaimed Jan, who would have thought it? to which he replied Griet, the person who should have done it! and turns away.      The story has several variants. It has inspired many songs including one in 2001 by the rock band ": null
    },
    {
        "BAP": "Bap"
    },
    {
        ". Jan von Werths name has been used for centuries to name military and recreational organisations, particularly groups of mounted marksmen at ": null
    },
    {
        "Schützenfests": "Schützenfest"
    },
    {
        " and Karneval.       ": null
    }
]