[
    {
        "                     Johannes Brahms  was a German composer, pianist, and conductor of the ": null
    },
    {
        "Romantic period": "Romantic Period"
    },
    {
        ". Born in ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        " into a ": null
    },
    {
        "Lutheran": "Lutheranism"
    },
    {
        " family, Brahms spent much of his professional life in Vienna. His reputation and status as a composer are such that he is sometimes grouped with ": null
    },
    {
        "Johann Sebastian Bach": "Johann Sebastian Bach"
    },
    {
        " and ": null
    },
    {
        "Ludwig van Beethoven": "Ludwig Van Beethoven"
    },
    {
        " as one of the ": null
    },
    {
        "Three Bs": "Three Bs"
    },
    {
        " of music, a comment originally made by the nineteenth-century conductor ": null
    },
    {
        "Hans von Bülow": "Hans Von Bülow"
    },
    {
        ".     Brahms composed for symphony orchestra, chamber ensembles, piano, organ, and voice and chorus. A virtuoso pianist, he premiered many of his own works. He worked with some of the leading performers of his time, including the pianist ": null
    },
    {
        "Clara Schumann": "Clara Schumann"
    },
    {
        " and the violinist ": null
    },
    {
        "Joseph Joachim": "Joseph Joachim"
    },
    {
        " . Many of his works have become staples of the modern concert repertoire. An uncompromising perfectionist, Brahms destroyed some of his works and left others unpublished.     Brahms has been considered, by his contemporaries and by later writers, as both a traditionalist and an innovator. His music is firmly rooted in the structures and compositional techniques of the ": null
    },
    {
        "Classical": "Classical Period"
    },
    {
        " masters. While many contemporaries found his music too academic, his contribution and craftsmanship have been admired by subsequent figures as diverse as ": null
    },
    {
        "Arnold Schoenberg": "Arnold Schoenberg"
    },
    {
        " and ": null
    },
    {
        "Edward Elgar": "Edward Elgar"
    },
    {
        ". The diligent, highly constructed nature of Brahmss works was a starting point and an inspiration for a generation of composers. Embedded within his meticulous structures, however, are deeply romantic motifs.              Brahmss father, Johann Jakob Brahms , was from the town of ": null
    },
    {
        "Heide": "Heide"
    },
    {
        " in Holstein. The family name was also sometimes spelt Brahmst or Brams, and derives from Bram, the German word for the shrub ": null
    },
    {
        "broom": "Genisteae"
    },
    {
        ". Swafford , p. 7. Against the familys will, Johann Jakob pursued a career in music, arriving in Hamburg in 1826, where he found work as a jobbing musician and a ": null
    },
    {
        "string": "String Instrument"
    },
    {
        " and ": null
    },
    {
        "wind": "Wind Instrument"
    },
    {
        " player. In 1830, he married Johanna Henrika Christiane Nissen , a seamstress 17 years older than he was. In the same year he was appointed as a ": null
    },
    {
        "horn": "Natural Horn"
    },
    {
        " player in the Hamburg militia. Hofmann , pp. 3–4. Eventually he became a ": null
    },
    {
        "double-bass": "Double-Bass"
    },
    {
        " player in the ": null
    },
    {
        "Stadttheater Hamburg": "Hamburg State Opera"
    },
    {
        " and the ": null
    },
    {
        "Hamburg Philharmonic Society": "Philharmoniker Hamburg"
    },
    {
        ". As Johann Jakob prospered, the family moved over the years to ever better accommodation in Hamburg. Hofmann , pp. 4–8. Johannes Brahms was born in 1833; his sister Elisabeth had been born in 1831 and a younger brother Fritz Friedrich was born in 1835. Swafford , pp. 14–16. Fritz also became a pianist; overshadowed by his brother, he emigrated to ": null
    },
    {
        "Caracas": "Caracas"
    },
    {
        " in 1867, and later returned to Hamburg as a teacher. Musgrave , p. 13.     Johann Jakob gave his son his first musical training; Johannes also learnt to play the violin and the basics of playing the ": null
    },
    {
        "cello": "Cello"
    },
    {
        ". From 1840 he studied piano with Otto Friedrich Willibald Cossel . Cossel complained in 1842 that Brahms could be such a good player, but he will not stop his never-ending composing. At the age of 10, Brahms made his debut as a performer in a private concert including ": null
    },
    {
        "Beethovens": "Ludwig Van Beethoven"
    },
    {
        " quintet for piano and winds": "Quintet For Piano And Winds"
    },
    {
        " Op. 16 and a ": null
    },
    {
        "piano quartet": "Piano Quartet"
    },
    {
        " by ": null
    },
    {
        "Mozart": "Wolfgang Amadeus Mozart"
    },
    {
        ". He also played as a solo work an ": null
    },
    {
        "étude": "Étude"
    },
    {
        " of ": null
    },
    {
        "Henri Herz": "Henri Herz"
    },
    {
        ". By 1845 he had written a ": null
    },
    {
        "piano sonata": "Piano Sonata"
    },
    {
        " in G minor. Hofmann , pp. 9–11. His parents disapproved of his early efforts as a composer, feeling that he had better career prospects as a performer. Hofmann , p. 12.     From 1845 to 1848 Brahms studied with Cossels teacher, the pianist and composer ": null
    },
    {
        "Eduard Marxsen": "Eduard Marxsen"
    },
    {
        " . Marxsen had been a personal acquaintance of Beethoven and ": null
    },
    {
        "Schubert": "Franz Schubert"
    },
    {
        ", admired the works of Mozart and ": null
    },
    {
        "Haydn": "Joseph Haydn"
    },
    {
        ", and was a devotee of the music of ": null
    },
    {
        "J. S. Bach": "Johann Sebastian Bach"
    },
    {
        ". Marxsen conveyed to Brahms the tradition of these composers and ensured that Brahmss own compositions were grounded in that tradition. Swafford , p. 26. In 1847 Brahms made his first public appearance as a solo pianist in Hamburg, playing a fantasy by ": null
    },
    {
        "Sigismund Thalberg": "Sigismund Thalberg"
    },
    {
        ". His first full piano recital, in 1848, included a ": null
    },
    {
        "fugue": "Fugue"
    },
    {
        " by Bach as well as works by Marxsen and contemporary virtuosi such as ": null
    },
    {
        "Jacob Rosenhain": "Jacob Rosenhain"
    },
    {
        ". A second recital in April 1849 included Beethovens ": null
    },
    {
        "Waldstein sonata": "Piano Sonata No. 21"
    },
    {
        " and a waltz fantasia of his own composition, and garnered favourable newspaper reviews. Hofmann , pp. 17–18.     Brahmss compositions at this period are known to have included piano music, chamber music and works for male voice choir. Under the pseudonym G. W. Marks, some piano arrangements and fantasies were published by the Hamburg firm of Cranz in 1849. The earliest of Brahmss works which he acknowledged  date from 1851. However Brahms was later assiduous in eliminating all his early works; even as late as 1880 he wrote to his friend Elise Giesemann to send him his manuscripts of choral music so that they could be destroyed. Hofmann , pp. 16, 18–20.     Persistent stories of the impoverished adolescent Brahms playing in bars and brothels have only anecdotal provenance, Including allegedly tales told by Brahms himself to Clara Schumann and others; see Jan Swafford, ,  New York Review of Books  18 March 1999, NWRB website, accessed 1 July 2018. and many modern scholars dismiss them; the Brahms family was relatively prosperous, and Hamburg legislation very strictly forbade music in, or the admittance of minors to, brothels. Swafford , passim. Hofmann pp. 12–14.          In 1850 Brahms met the Hungarian violinist ": null
    },
    {
        "Ede Reményi": "Ede Reményi"
    },
    {
        " and accompanied him in a number of recitals over the next few years. This was his introduction to gypsy-style music such as the  csardas , which was later to prove the foundation of his most lucrative and popular compositions, the two sets of  Hungarian Dances  . Swafford , pp. 56, 62; Musgrave , p. 45. 1850 also marked Brahmss first contact with ": null
    },
    {
        "Robert Schumann": "Robert Schumann"
    },
    {
        "; during Schumanns visit to Hamburg that year, friends persuaded Brahms to send the former some of his compositions, but the package was returned unopened. Swafford , pp. 56–57.     In 1853 Brahms went on a concert tour with Reményi. In late May the two visited the violinist and composer ": null
    },
    {
        "Joseph Joachim": "Joseph Joachim"
    },
    {
        " at ": null
    },
    {
        "Hanover": "Hanover"
    },
    {
        ". Brahms had earlier heard Joachim playing the solo part in ": null
    },
    {
        "Beethovens violin concerto": "Violin Concerto"
    },
    {
        " and been deeply impressed. Swafford , p. 49. Brahms played some of his own solo piano pieces for Joachim, who remembered fifty years later: Never in the course of my artists life have I been more completely overwhelmed . Swafford , p. 64. This was the beginning of a friendship which was lifelong, albeit temporarily derailed when Brahms took the side of Joachims wife in their divorce proceedings of 1883. Swafford , pp. 494–95. Brahms also admired Joachim as a composer, and in 1856 they were to embark on a mutual training exercise to improve their skills in double ": null
    },
    {
        "counterpoint": "Counterpoint"
    },
    {
        ", ": null
    },
    {
        "canons": "Canon"
    },
    {
        ", ": null
    },
    {
        "fugues": "Fugue"
    },
    {
        ", preludes or whatever . Musgrave , p. 67. Bozarth notes that products of Brahmss study of counterpoint and early music over the next few years included dance pieces, preludes and fugues for organ, and neo-": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        " and neo-": null
    },
    {
        "Baroque": "Baroque Music"
    },
    {
        " choral works.     After meeting Joachim, Brahms and Reményi visited ": null
    },
    {
        "Weimar": "Weimar"
    },
    {
        ", where Brahms met ": null
    },
    {
        "Franz Liszt": "Franz Liszt"
    },
    {
        ", ": null
    },
    {
        "Peter Cornelius": "Peter Cornelius"
    },
    {
        ", and ": null
    },
    {
        "Joachim Raff": "Joachim Raff"
    },
    {
        ", and where Liszt performed Brahmss Op. 4 Scherzo ": null
    },
    {
        "at sight": "Sight-Reading"
    },
    {
        ". Reményi claimed that Brahms then slept during Liszts performance of his own ": null
    },
    {
        "Sonata in B minor": "Sonata In B Minor"
    },
    {
        "; this and other disagreements led Reményi and Brahms to part company. Swafford , pp. 67, 71     Brahms visited ": null
    },
    {
        "Düsseldorf": "Düsseldorf"
    },
    {
        " in October 1853, and, with a letter of introduction from Joachim, Gál , p.  7 was welcomed by Schumann and his wife ": null
    },
    {
        "Clara": "Clara Schumann"
    },
    {
        ". Schumann, greatly impressed and delighted by the 20-year-olds talent, published an article entitled Neue Bahnen in the 28 October issue of the journal  Neue Zeitschrift für Musik  nominating Brahms as one who was fated to give expression to the times in the highest and most ideal manner . Schumann , pp. 199–200. This praise may have aggravated Brahmss self-critical standards of perfection and dented his confidence. He wrote to Schumann in November 1853 that his praise will arouse such extraordinary expectations by the public that I dont know how I can begin to fulfil them . Avins , p. 24 While in Düsseldorf, Brahms participated with Schumann and Schumanns pupil ": null
    },
    {
        "Albert Dietrich": "Albert Dietrich"
    },
    {
        " in writing a movement each of a ": null
    },
    {
        "violin sonata": "Violin Sonata"
    },
    {
        " for Joachim, the ": null
    },
    {
        "F-A-E Sonata": "F-A-E Sonata"
    },
    {
        " , the letters representing the initials of Joachims personal motto Frei aber einsam . Swafford , pp. 81–82.     Schumanns accolade led to the first publication of Brahmss works under his own name. Brahms went to ": null
    },
    {
        "Leipzig": "Leipzig"
    },
    {
        " where ": null
    },
    {
        "Breitkopf & Härtel": "Breitkopf  &  Härtel"
    },
    {
        " published his Opp. 1–4 , whilst ": null
    },
    {
        "Bartholf Senff": "Bartholf Senff"
    },
    {
        " published the ": null
    },
    {
        "Third Piano Sonata Op. 5": "Piano Sonata No. 3"
    },
    {
        " and the Six Songs Op. 6. In Leipzig, he gave recitals including his own first two piano sonatas, and met with among others ": null
    },
    {
        "Ferdinand David": "Ferdinand David"
    },
    {
        ", ": null
    },
    {
        "Ignaz Moscheles": "Ignaz Moscheles"
    },
    {
        ", and ": null
    },
    {
        "Hector Berlioz": "Hector Berlioz"
    },
    {
        ". Bozarth , §2: New Paths . Swafford , p. 89     After Schumanns attempted suicide and subsequent confinement in a mental sanatorium near ": null
    },
    {
        "Bonn": "Bonn"
    },
    {
        " in February 1854 , Brahms based himself in Düsseldorf, where he supported the household and dealt with business matters on Claras behalf. Clara was not allowed to visit Robert until two days before his death, but Brahms was able to visit him and acted as a go-between. Brahms began to feel deeply for Clara, who to him represented an ideal of womanhood. Their intensely emotional ": null
    },
    {
        "platonic relationship": "Platonic Love"
    },
    {
        " lasted until Claras death. In June 1854 Brahms dedicated to Clara his Op. 9, the Variations on a Theme of Schumann. Clara continued to support Brahmss career by programming his music in her recitals. Swafford , pp. 180, 182.     After the publication of his Op. 10 ": null
    },
    {
        "Ballades": "Ballades, Op. 10"
    },
    {
        " for piano, Brahms published no further works until 1860. His major project of this period was the ": null
    },
    {
        "Piano Concerto in D minor": "Piano Concerto No. 1"
    },
    {
        ", which he had begun as a work for two pianos in 1854 but soon realized needed a larger-scale format. Based in Hamburg at this time, he gained, with Claras support, a position as musician to the tiny court of ": null
    },
    {
        "Detmold": "Detmold"
    },
    {
        ", the capital of the ": null
    },
    {
        "Principality of Lippe": "Principality Of Lippe"
    },
    {
        ", where he spent the winters of 1857 to 1860 and for which he wrote his two ": null
    },
    {
        "Serenades": "Serenades"
    },
    {
        " . In Hamburg he established a womens choir for which he wrote music and conducted. To this period also belong his first two Piano Quartets  and the first movement of the ": null
    },
    {
        "third Piano Quartet": "Piano Quartet No. 3"
    },
    {
        ", which eventually appeared in 1875.     The end of the decade brought professional setbacks for Brahms. The premiere of the First Piano Concerto in Hamburg on 22 January 1859, with the composer as soloist, was poorly received. Brahms wrote to Joachim that the performance was a brilliant and decisive – failure... forces one to concentrate ones thoughts and increases ones courage...But the hissing was too much of a good thing... Swafford , pp. 189–90. At a second performance, audience reaction was so hostile that Brahms had to be restrained from leaving the stage after the first movement. Swafford , p. 211. As a consequence of these reactions Breitkopf and Härtel declined to take on his new compositions. Brahms consequently established a relationship with other publishers, including ": null
    },
    {
        "Simrock": "N. Simrock"
    },
    {
        ", who eventually became his major publishing partner. Brahms further made an intervention in 1860 in the debate on the future of German music which seriously misfired. Together with Joachim and others, he prepared an attack on Liszts followers, the so-called ": null
    },
    {
        "New German School": "New German School"
    },
    {
        " . In particular they objected to the rejection of traditional musical forms and to the rank, miserable weeds growing from Liszt-like fantasias . A draft was leaked to the press, and the Neue Zeitschrift für Musik published a ": null
    },
    {
        "parody": "Parody"
    },
    {
        " which ridiculed Brahms and his associates as backward-looking. Brahms never again ventured into public musical polemics. Swafford , pp. 206–11.     Brahmss personal life was also troubled. In 1859 he became engaged to Agathe von Siebold. The engagement was soon broken off, but even after this Brahms wrote to her: I love you! I must see you again, but I am incapable of bearing fetters. Please write me ... whether ... I may come again to clasp you in my arms, to kiss you, and tell you that I love you. They never saw one another again, and Brahms later confirmed to a friend that Agathe was his last love . Musgrave , pp. 52–53.       Brahms had hoped to be given the conductorship of the Hamburg Philharmonic, but in 1862 this post was given to the ": null
    },
    {
        "baritone": "Baritone"
    },
    {
        " Julius Stockhausen": "Julius Stockhausen"
    },
    {
        ". .Musgrave , pp. 27, 31. In autumn 1862 Brahms made his first visit to Vienna, staying there over the winter. There he became an associate of two close members of Wagners circle, his earlier friend Peter Cornelius and ": null
    },
    {
        "Karl Tausig": "Karl Tausig"
    },
    {
        ", and of ": null
    },
    {
        "Joseph Hellmesberger Sr.": "Joseph Hellmesberger Sr."
    },
    {
        " and ": null
    },
    {
        "Julius Epstein": "Julius Epstein"
    },
    {
        ", respectively the Director and head of violin studies, and the head of piano studies, at the ": null
    },
    {
        "Vienna Conservatoire": "Vienna Conservatoire"
    },
    {
        ". Brahmss circle grew to include the notable critic ": null
    },
    {
        "Eduard Hanslick": "Eduard Hanslick"
    },
    {
        ", the conductor ": null
    },
    {
        "Hermann Levi": "Hermann Levi"
    },
    {
        " and the surgeon ": null
    },
    {
        "Theodor Billroth": "Theodor Billroth"
    },
    {
        ", who were to become amongst his greatest advocates. Musgrave , pp. 39–41.        In January 1863 Brahms met Richard Wagner for the first time, for whom he played his  Handel Variations  Op. 24, which he had completed the previous year. The meeting was cordial, although Wagner was in later years to make critical, and even insulting, comments on Brahmss music. Swafford , pp. 265–69. Brahms however retained at this time and later a keen interest in Wagners music, helping with preparations for Wagners Vienna concerts in 1862/63, Bozarth , §3 First maturity and being rewarded by Tausig with a manuscript of part of Wagners  Tannhäuser  . Swafford , p. 401. The Handel Variations also featured, together with the first Piano Quartet, in his first Viennese recitals, in which his performances were better-received by the public and critics than his music. Musgrave , p. 39.     Although Brahms entertained the idea of taking up conducting posts elsewhere, he based himself increasingly in Vienna and soon made it his home. In 1863, he was appointed conductor of the ": null
    },
    {
        "Wiener Singakademie": "Wiener Singakademie"
    },
    {
        ". He surprised his audiences by programming much work of the early German masters such as ": null
    },
    {
        "Heinrich Schütz": "Heinrich Schütz"
    },
    {
        " and J. S. Bach, and other early composers such as ": null
    },
    {
        "Giovanni Gabrieli": "Giovanni Gabrieli"
    },
    {
        "; more recent music was represented by works of Beethoven and ": null
    },
    {
        "Felix Mendelssohn": "Felix Mendelssohn"
    },
    {
        ". Brahms also wrote works for the choir, including his Motet, Op. 29. Finding however that the post encroached too much of the time he needed for composing, he left the choir in June 1864. Swafford , pp. 277–79, 283. From 1864 to 1876 he spent many of his summers in ": null
    },
    {
        "Lichtental": "Lichtental"
    },
    {
        ", today part of ": null
    },
    {
        "Baden-Baden": "Baden-Baden"
    },
    {
        ", where Clara Schumann and her family also spent some time. His house in Lichtental, where he worked on many of his major compositions including  A German Requiem  and his middle-period chamber works, is preserved as a museum. Hofmann , p. 40; , on website of the Schumann Portal, accessed 22 December 2016.     In February 1865 Brahmss mother died, and he began to compose his large choral work A German Requiem Op. 45, of which six movements were completed by 1866. Premieres of the first three movements were given in Vienna, but the complete work was first given in ": null
    },
    {
        "Bremen": "Bremen"
    },
    {
        " in 1868 to great acclaim. A seventh movement was added for the equally successful Leipzig premiere , and the work went on to receive concert and critical acclaim throughout Germany and also in England, Switzerland and Russia, marking effectively Brahmss arrival on the world stage. Brahms also experienced at this period popular success with works such as his first set of Hungarian Dances , the ": null
    },
    {
        "Liebeslieder Walzer, Op. 52": "Liebeslieder Walzer, Op. 52"
    },
    {
        ", , and his collections of ": null
    },
    {
        "lied": "Lied"
    },
    {
        "er . Following such successes he finally completed a number of works that he had wrestled with over many years such as the cantata ": null
    },
    {
        "Rinaldo": "Rinaldo"
    },
    {
        " , his ": null
    },
    {
        "first two string quartets": "Two String Quartets, Op. 51"
    },
    {
        " Op. 51 nos. 1 and 2 , the third piano quartet , and most notably his ": null
    },
    {
        "first symphony": "Symphony No. 1"
    },
    {
        " which appeared in 1876, but which had been begun as early as 1855. Becker , pp. 174–79. Bozarth . §4, At the summit     From 1872 to 1875, Brahms was director of the concerts of the Vienna ": null
    },
    {
        "Gesellschaft der Musikfreunde": "Gesellschaft Der Musikfreunde"
    },
    {
        ". He ensured that the orchestra was staffed only by professionals, and conducted a repertoire which ran from Bach to the nineteenth century composers who were not of the New German School; these included Beethoven, ": null
    },
    {
        "Franz Schubert": "Franz Schubert"
    },
    {
        ", Mendelssohn, Schumann, Joachim, ": null
    },
    {
        "Ferdinand Hiller": "Ferdinand Hiller"
    },
    {
        ", ": null
    },
    {
        "Max Bruch": "Max Bruch"
    },
    {
        " and himself . 1873 saw the premiere of his orchestral  Variations on a Theme by Haydn , originally conceived for two pianos, which has become one of his most popular works. Swafford , p. 383.          Brahmss ": null
    },
    {
        "first symphony": "Symphony No. 1"
    },
    {
        ", Op. 68, appeared in 1876, though it had been begun in the early 1860s. During the decade it evolved very gradually; the finale may not have begun its conception until 1868. Musgrave , pp. 42–43. Brahms was cautious and typically self-deprecating about the symphony during its creation, writing to his friends that it was long and difficult , not exactly charming and, significantly long and in ": null
    },
    {
        "C Minor": "C Minor"
    },
    {
        " , which, as ": null
    },
    {
        "Richard Taruskin": "Richard Taruskin"
    },
    {
        " points out, made it clear that Brahms was taking on the model of models ": null
    },
    {
        "Beethovens Fifth": "Symphony No. 5"
    },
    {
        ". Taruskin , p. 694.     In May 1876, Cambridge University offered to grant honorary degrees of Doctor of Music to both Brahms and Joachim, provided that they composed new pieces as theses and were present in Cambridge to receive their degrees. Brahms was averse to traveling to England, and requested to receive the degree in absentia, offering as his thesis the previously performed symphony. Brahms: Symphony No. 1/Tragic Overture/Academic Festival Overture,  by Robert Pascall to Naxos 8.557428 But of the two, only Joachim went to England and only he was granted a degree. Brahms acknowledged the invitation by giving the manuscript score and parts of ": null
    },
    {
        "his first symphony": "Symphony No. 1"
    },
    {
        " to Joachim, who led the performance at Cambridge March 8, 1877 . Programme, 1916–1917, pp.  205–06     Despite the warm reception the first symphony received, Brahms remained dissatisfied and extensively revised the second movement before the work was published. There followed a succession of well-received orchestral works; the ": null
    },
    {
        "Second Symphony": "Symphony No. 2"
    },
    {
        " Op. 73 , the ": null
    },
    {
        "Violin Concerto": "Violin Concerto"
    },
    {
        " Op. 77 , dedicated to Joachim who was consulted closely during its composition, and the  Academic Festival Overture   and  Tragic Overture  of 1880. The commendation of Brahms by Breslau as the leader in the art of serious music in Germany today led to a bilious comment from Wagner in his essay On Poetry and Composition : I know of some famous composers who in their concert masquerades don the disguise of a street-singer one day, the hallelujah periwig of ": null
    },
    {
        "Handel": "Georg Frideric Handel"
    },
    {
        " the next, the dress of a Jewish ": null
    },
    {
        "Czardas": "Czardas"
    },
    {
        "-fiddler another time, and then again the guise of a highly respectable symphony dressed up as Number Ten . Taruskin , p. 729.     Brahms was now recognised as a major figure in the world of music. He had been on the jury which awarded the Vienna State Prize to the composer ": null
    },
    {
        "Antonín Dvořák": "Antonín Dvořák"
    },
    {
        " three times, first in February 1875, and later in 1876 and 1877 and had successfully recommended Dvořák to his publisher, Simrock. The two men met for the first time in 1877, and Dvořák dedicated to Brahms his ": null
    },
    {
        "String Quartet, Op. 44": "String Quartet No. 9"
    },
    {
        " of that year. Swafford , pp. 444–46 He also began to be the recipient of a variety of honours; ": null
    },
    {
        "Ludwig II of Bavaria": "Ludwig Ii Of Bavaria"
    },
    {
        " awarded him the ": null
    },
    {
        "Maximilian Order for Science and Art": "Bavarian Maximilian Order For Science And Art"
    },
    {
        " in 1874, and the music loving ": null
    },
    {
        "Duke George of Meiningen": "Georg Ii, Duke Of Saxe-Meiningen"
    },
    {
        " awarded him in 1881 the Commanders Cross of the Order of the House of Meiningen. Musgrave , p. xv; Musgrave , p. 171; Swafford , p. 467     At this time Brahms also chose to change his image. Having been always clean-shaven, in 1878 he surprised his friends by growing a beard, writing in September to the conductor ": null
    },
    {
        "Bernhard Scholz": "Bernhard Scholz"
    },
    {
        " I am coming with a large beard! Prepare your wife for a most awful sight. Hofmann , p. 57. The singer ": null
    },
    {
        "George Henschel": "George Henschel"
    },
    {
        " recalled that after a concert I saw a man unknown to me, rather stout, of middle height, with long hair and a full beard. In a very deep and hoarse voice he introduced himself as Musikdirektor Müller... an instant later, we all found ourselves laughing heartily at the perfect success of Brahmss disguise . The incident also displays Brahmss love of practical jokes. Musgrave , pp. 4, 6     In 1882 Brahms completed his ": null
    },
    {
        "Piano Concerto No. 2": "Piano Concerto No. 2"
    },
    {
        ", Op. 83, dedicated to his teacher Marxsen. Brahms was invited by ": null
    },
    {
        "Hans von Bülow": "Hans Von Bülow"
    },
    {
        " to undertake a premiere of the work with the ": null
    },
    {
        "Meiningen Court Orchestra": "Meiningen Court Orchestra"
    },
    {
        "; this was the beginning of his collaboration with Meiningen and with von Bülow, who was to rank Brahms as one of the ": null
    },
    {
        "Three Bs": "Three Bs"
    },
    {
        "; in a letter to his wife he wrote You know what I think of Brahms: after Bach and Beethoven the greatest, the most sublime of all composers. Swafford , pp. 465–66. The following years saw the premieres of his ": null
    },
    {
        "Third Symphony": "Symphony No. 3"
    },
    {
        " Op. 90 and his ": null
    },
    {
        "Fourth Symphony": "Symphony No. 4"
    },
    {
        " Op. 98 . ": null
    },
    {
        "Richard Strauss": "Richard Strauss"
    },
    {
        ", who had been appointed assistant to von Bülow at Meiningen, and had been uncertain about Brahmss music, found himself converted by the Third Symphony and was enthusiastic about the Fourth: a giant work, great in concept and invention. Musgrave , p. 252. Another, but cautious, supporter from the younger generation was ": null
    },
    {
        "Gustav Mahler": "Gustav Mahler"
    },
    {
        " who first met Brahms in 1884 and remained a close acquaintance; he rated Brahms as superior to ": null
    },
    {
        "Anton Bruckner": "Anton Bruckner"
    },
    {
        ", but more earth-bound than Wagner and Beethoven. Musgrave , pp. 253–54.     In 1889, ": null
    },
    {
        "Theo Wangemann": "Adelbert Theodor Wangemann"
    },
    {
        ", a representative of the American inventor ": null
    },
    {
        "Thomas Edison": "Thomas Edison"
    },
    {
        ", visited the composer in Vienna and invited him to make an experimental recording. Brahms played an abbreviated version of his first Hungarian Dance and of ": null
    },
    {
        "Josef Strausss": "Josef Strauss"
    },
    {
        "  Die Libelle  on the piano. Although the spoken introduction to the short piece of music is quite clear, the piano playing is largely inaudible due to heavy ": null
    },
    {
        "surface noise": "Surface Noise"
    },
    {
        ".  Analysts and scholars remain divided as to whether the voice that introduces the piece is that of Wangemann or of Brahms. A denoised version of the recording was produced at ": null
    },
    {
        "Stanford University": "Stanford University"
    },
    {
        ".  by ": null
    },
    {
        "Jonathan Berger": "Jonathan Berger"
    },
    {
        "      In that same year, Brahms was named an ": null
    },
    {
        "honorary citizen of Hamburg": "List Of Honorary Citizens Of Hamburg"
    },
    {
        ".   Retrieved 14 October 2019          Brahms had become acquainted with ": null
    },
    {
        "Johann Strauss II": "Johann Strauss Ii"
    },
    {
        ", who was eight years his senior, in the 1870s, but their close friendship belongs to the years 1889 and after. Brahms admired much of Strausss music, and encouraged the composer to sign up with his publisher Simrock. In autographing a fan for Strausss wife Adele, Brahms wrote the opening notes of  The Blue Danube  ": null
    },
    {
        "waltz": "Waltz"
    },
    {
        ", adding the words unfortunately not by Johannes Brahms . Lamb , pp. 869–70     After the successful Vienna premiere of his ": null
    },
    {
        "Second String Quintet": "String Quintet No. 2"
    },
    {
        ", op. 111, in 1890, the 57-year-old Brahms came to think that he might retire from composition, telling a friend that he had achieved enough; here I had before me a carefree old age and could enjoy it in peace. Swafford , pp. 568–69. He also began to find solace in escorting the mezzo-soprano ": null
    },
    {
        "Alice Barbi": "Alice Barbi"
    },
    {
        " and may have proposed to her . Swafford , p. 569. His admiration for ": null
    },
    {
        "Richard Mühlfeld": "Richard Mühlfeld"
    },
    {
        ", clarinettist with the Meiningen orchestra, revived his interest in composing and led him to write the ": null
    },
    {
        "Clarinet Trio": "Clarinet Trio"
    },
    {
        ", Op.  114, ": null
    },
    {
        "Clarinet Quintet": "Clarinet Quintet"
    },
    {
        ", Op.  115 , and the two ": null
    },
    {
        "Clarinet Sonatas": "Clarinet Sonatas"
    },
    {
        ", Op.  120 . Brahms also wrote at this time his final cycles of piano pieces, Opp.  116–19, the  Vier ernste Gesänge  , Op.  121 , Swafford , pp. 607–08. and the ": null
    },
    {
        "Eleven Chorale Preludes": "Eleven Chorale Preludes"
    },
    {
        " for organ, Op.  122 . The last of these is a setting of O Welt ich muss dich lassen , , and are the last notes that Brahms wrote. Bond , p. 898. Many of these works were written in his house in ": null
    },
    {
        "Bad Ischl": "Bad Ischl"
    },
    {
        ", where Brahms had first visited in 1882 and where he spent every summer from 1889 onwards. Hofmann , p. 42.        In the summer of 1896 Brahms was diagnosed as having ": null
    },
    {
        "jaundice": "Jaundice"
    },
    {
        ", and later in the year his Viennese doctor diagnosed him as having ": null
    },
    {
        "cancer of the liver": "Hepatocellular Carcinoma"
    },
    {
        " . Swafford , pp. 614–15. His last public appearance was on 3 March 1897, when he saw ": null
    },
    {
        "Hans Richter": "Hans Richter"
    },
    {
        " conduct his ": null
    },
    {
        "Symphony No. 4": "Symphony No. 4"
    },
    {
        ". There was an ovation after each of the four movements. He made the effort, three weeks before his death, to attend the premiere of Johann Strausss operetta  Die Göttin der Vernunft  in March 1897. His condition gradually worsened and he died on 3 April 1897, in Vienna, aged 63. Brahms is buried in the ": null
    },
    {
        "Zentralfriedhof": "Zentralfriedhof"
    },
    {
        " in Vienna, under a monument designed by ": null
    },
    {
        "Victor Horta": "Victor Horta"
    },
    {
        " with sculpture by ": null
    },
    {
        "Ilse von Twardowski": "Ilse Von Twardowski"
    },
    {
        ". , details              Brahms maintained a classical sense of form and order in his works, in contrast to the opulence of the music of many of his contemporaries. Thus, many admirers saw him as the champion of traditional forms and pure music , as opposed to the New German embrace of ": null
    },
    {
        "programme music": "Programme Music"
    },
    {
        ".     Brahms venerated Beethoven; in the composers home, a marble bust of Beethoven looked down on the spot where he composed, and some passages in his works are reminiscent of Beethovens style. Brahmss ": null
    },
    {
        "First Symphony": "Symphony No. 1"
    },
    {
        " bears strongly the influence of Beethovens ": null
    },
    {
        "Fifth Symphony": "Symphony No. 5"
    },
    {
        ", as the two works are both in ": null
    },
    {
        "C  minor": "C & Nbsp;Minor"
    },
    {
        " and end in the struggle towards a ": null
    },
    {
        "C  major": "C & Nbsp;Major"
    },
    {
        " triumph. The main theme of the finale of the First Symphony is also reminiscent of the main theme of the finale of Beethovens ": null
    },
    {
        "Ninth": "Symphony No. 9"
    },
    {
        ", and when this resemblance was pointed out to Brahms he replied that any dunce Brahms used the German word Esel , of which one translation is donkey and another is dunce : Cassells New German Dictionary, Funk and Wagnalls, New York and London, 1915 could see that. In 1876, when the work was premiered in Vienna, it was immediately hailed as Beethovens Tenth . Indeed, the similarity of Brahmss music to that of late Beethoven had first been noted as early as November 1853 in a letter from ": null
    },
    {
        "Albert Dietrich": "Albert Dietrich"
    },
    {
        " to ": null
    },
    {
        "Ernst Naumann": "Ernst Naumann"
    },
    {
        ".       Brahms was a master of ": null
    },
    {
        "counterpoint": "Counterpoint"
    },
    {
        ". For Brahms, ... the most complicated forms of counterpoint were a natural means of expressing his emotions, writes ": null
    },
    {
        "Geiringer": "Karl Geiringer"
    },
    {
        ". As Palestrina or Bach succeeded in giving spiritual significance to their technique, so Brahms could turn a ": null
    },
    {
        "canon": "Canon"
    },
    {
        " in motu contrario or a canon per augmentationem into a pure piece of lyrical poetry. Geiringer , p. 159 Writers on Brahms have commented on his use of counterpoint. For example, of Op. 9, Variations on a Theme by Robert Schumann, Geiringer writes that Brahms displays all the resources of contrapuntal art . Geiringer, p. 210. In the A Major piano quartet Opus 26, Swafford notes that the third movement is demonic-canonic , echoing Haydns famous minuet for string quartet called the Witchs Round. Swafford , p. 159. Swafford further opines that thematic development, counterpoint, and form were the dominant technical terms in which Brahms... thought about music . Swafford , p. xviii     Allied to his skill in counterpoint was his subtle handling of rhythm and meter. The New Grove Dictionary of Music speculates that the his contact with Hungarian and gypsy folk music as a teenager led to his lifelong fascination with the irregular rhythms, triplet figures and use of rubato in his compositions. ”Brahms,” article in Sadie, S. ,   The New Grove Dictionary of Music. Oxford University Press. The ": null
    },
    {
        "Hungarian Dances": "Hungarian Dances"
    },
    {
        " are among Brahmss most-appreciated pieces. Gal, pp. 17, 204 According to Michael Musgrave only one composer rivals him in the advanced nature of his rhythmic thinking, and that is ": null
    },
    {
        "Stravinsky": "Stravinsky"
    },
    {
        ". Musgrave, M. The Music of Brahms. London, Routledge.     His consummate skills in counterpoint and rhythm are richly present in A German Requiem, a work that was partially inspired by his mothers death in 1865 , but which also incorporates material from a symphony which he started in 1854 but abandoned following Schumanns suicide attempt. He once wrote that the Requiem belonged to Schumann . The first movement of this abandoned symphony was re-worked as the first movement of the First Piano Concerto.     Brahms loved the classical composers Mozart and Haydn. He collected first editions and autographs of their works and edited performing editions. He studied the music of pre-classical composers, including ": null
    },
    {
        "Giovanni Gabrieli": "Giovanni Gabrieli"
    },
    {
        ", ": null
    },
    {
        "Johann Adolph Hasse": "Johann Adolph Hasse"
    },
    {
        ", ": null
    },
    {
        "Heinrich Schütz": "Heinrich Schütz"
    },
    {
        ", ": null
    },
    {
        "Domenico Scarlatti": "Domenico Scarlatti"
    },
    {
        ", ": null
    },
    {
        "George Frideric Handel": "George Frideric Handel"
    },
    {
        ", and, especially, ": null
    },
    {
        "Johann Sebastian Bach": "Johann Sebastian Bach"
    },
    {
        ". His friends included leading musicologists, and, with ": null
    },
    {
        "Friedrich Chrysander": "Friedrich Chrysander"
    },
    {
        ", he edited an edition of the works of ": null
    },
    {
        "François Couperin": "François Couperin"
    },
    {
        ". Brahms also edited works by ": null
    },
    {
        "C.  P.  E. Bach": "Carl Philipp Emanuel Bach"
    },
    {
        " and ": null
    },
    {
        "W.  F. Bach": "Wilhelm Friedemann Bach"
    },
    {
        ". He looked to older music for inspiration in the art of ": null
    },
    {
        "counterpoint": "Counterpoint"
    },
    {
        "; the themes of some of his works are modelled on ": null
    },
    {
        "Baroque": "Baroque Music"
    },
    {
        " sources such as Bachs  The Art of Fugue  in the fugal finale of ": null
    },
    {
        "Cello Sonata No. 1": "Cello Sonata No. 1"
    },
    {
        " or the same composers Cantata No. 150 in the passacaglia theme of the ": null
    },
    {
        "Fourth Symphonys": "Symphony No. 4"
    },
    {
        " finale. Peter Phillips hears affinities between Brahmss rhythmically charged contrapuntal textures and those of Renaissance masters such as ": null
    },
    {
        "Giovanni Gabrieli": "Giovanni Gabrieli"
    },
    {
        " and ": null
    },
    {
        "William Byrd": "William Byrd"
    },
    {
        ". Referring to Byrds Though Amaryllis dance, Philips remarks that “the  in this piece so excited ": null
    },
    {
        "E. H. Fellowes": "E. H. Fellowes"
    },
    {
        " that he likened them to Brahmss compositional style.” Phillips, P. sleeve note to English Madrigals, 25th anniversary edition, CD recording, Gimell Records.     The early Romantic composers had a major influence on Brahms, particularly Schumann, who encouraged Brahms as a young composer. During his stay in Vienna in 1862–63, Brahms became particularly interested in the music of ": null
    },
    {
        "Franz Schubert": "Franz Schubert"
    },
    {
        ". ": null
    },
    {
        "James Webster": "James Webster"
    },
    {
        ", Schuberts sonata form and Brahmss first maturity , 19th-Century Music 3 , pp.  52–71. The latters influence may be identified in works by Brahms dating from the period, such as the two piano quartets Op.  25 and Op.  26, and the ": null
    },
    {
        "Piano Quintet": "Piano Quintet"
    },
    {
        " which alludes to Schuberts ": null
    },
    {
        "String Quintet": "String Quintet"
    },
    {
        " and ": null
    },
    {
        "Grand Duo": "Sonata In C Major For Piano Four-Hands, D 812"
    },
    {
        " for piano four hands. ": null
    },
    {
        "Donald Francis Tovey": "Donald Francis Tovey"
    },
    {
        ", Franz Schubert , rpt. in Essays and Lectures on Music , p.  123. Cf. his similar remarks in Tonality in Schubert , rpt. ibid., p.  151. The influence of ": null
    },
    {
        "Chopin": "Frédéric Chopin"
    },
    {
        " and ": null
    },
    {
        "Mendelssohn": "Felix Mendelssohn"
    },
    {
        " on Brahms is less obvious, although occasionally one can find in his works what seems to be an allusion to one of theirs . H.V. Spanner, What is originality? , The Musical Times 93 , pp.  310–11.     Brahms considered giving up composition when it seemed that other composers innovations in extended tonality resulted in the rule of tonality being broken altogether. Although ": null
    },
    {
        "Wagner": "Richard Wagner"
    },
    {
        " became fiercely critical of Brahms as the latter grew in stature and popularity, he was enthusiastically receptive of the early Variations and Fugue on a Theme by Handel; Brahms himself, according to many sources, Swafford deeply admired Wagners music, confining his ambivalence only to the dramaturgical precepts of Wagners theory.     Brahms wrote settings for piano and voice of 144 German folk songs, and many of his lieder reflect folk themes or depict scenes of rural life.                 Brahms wrote a number of major works for orchestra, including two ": null
    },
    {
        "Serenades": "Serenades"
    },
    {
        ", four ": null
    },
    {
        "symphonies": "Symphony"
    },
    {
        ", two ": null
    },
    {
        "piano concertos": "Piano Concerto"
    },
    {
        " , a ": null
    },
    {
        "Violin Concerto": "Violin Concerto"
    },
    {
        ", a ": null
    },
    {
        "Double Concerto": "Double Concerto"
    },
    {
        " for violin and cello, and two companion orchestral overtures, the  Academic Festival Overture  and the  Tragic Overture .     His large choral work  A German Requiem  is not a setting of the liturgical Missa pro defunctis but a setting of texts which Brahms selected from the ": null
    },
    {
        "Luther Bible": "Luther Bible"
    },
    {
        ". The work was composed in three major periods of his life. An early version of the second movement was first composed in 1854, not long after Robert Schumanns attempted suicide, and this was later used in his first piano concerto. The majority of the Requiem was composed after his mothers death in 1865. The fifth movement was added after the official premiere in 1868, and the work was published in 1869.     His works in ": null
    },
    {
        "variation": "Variation"
    },
    {
        " form include, among others, the  Variations and Fugue on a Theme by Handel  and the  Paganini Variations , both for solo piano, and the  Variations on a Theme by Haydn   in versions for two pianos and for orchestra. The final movement of the ": null
    },
    {
        "Fourth Symphony": "Symphony No. 4"
    },
    {
        ", Op.  98, is formally a ": null
    },
    {
        "passacaglia": "Passacaglia"
    },
    {
        ".     His ": null
    },
    {
        "chamber": "Chamber Music"
    },
    {
        " works include three string quartets, two string quintets, two string sextets, a clarinet quintet, a clarinet trio, a ": null
    },
    {
        "horn trio": "Horn Trio"
    },
    {
        ", a piano quintet, three piano quartets, and four piano trios . He composed several instrumental sonatas with piano, including three for violin, two for cello, and two for clarinet . His solo piano works range from his early ": null
    },
    {
        "piano sonatas": "Piano Sonata"
    },
    {
        " and ": null
    },
    {
        "ballades": "Ballade"
    },
    {
        " to his late sets of character pieces. Brahms was a significant ": null
    },
    {
        "Lied": "Lied"
    },
    {
        "er composer, who wrote over 200 of them. His ": null
    },
    {
        "chorale preludes for organ": "Eleven Chorale Preludes"
    },
    {
        ", Op.  122, which he wrote shortly before his death, have become an important part of the organ repertoire. They were published posthumously in 1902. The last of this set is a setting of the chorale, O Welt ich muss dich lassen , O world I now must leave thee and were the last notes he wrote.     Brahms was an extreme ": null
    },
    {
        "perfectionist": "Perfectionism"
    },
    {
        ". He destroyed many early works – including a violin sonata he had performed with Reményi and violinist ": null
    },
    {
        "Ferdinand David": "Ferdinand David"
    },
    {
        " – and once claimed to have destroyed 20 string quartets before he issued his official First in 1873. Over the course of several years, he changed an original project for a symphony in D minor into his ": null
    },
    {
        "first piano concerto": "Piano Concerto No. 1"
    },
    {
        ". In another instance of devotion to detail, he laboured over the official First Symphony for almost fifteen years, from about 1861 to 1876. Even after its first few performances, Brahms destroyed the original slow movement and substituted another before the score was published.      Another factor that contributed to his perfectionism was Schumanns early enthusiasm, which Brahms was determined to live up to. Schumanns early approbation was a challenge to the composers self-confidence, and may have contributed to the delay in producing the First Symphony.     Brahms strongly preferred writing ": null
    },
    {
        "absolute music": "Absolute Music"
    },
    {
        " that does not refer to an explicit scene or narrative, and he never wrote an opera or a symphonic poem.     Despite his mastery of large, complex musical structures, some of his most popular compositions during his lifetime were small-scale works that were readily accessible to the contemporary market for domestic music-making. Among these lighter works are his sets of popular dances, the  Hungarian Dances , the ": null
    },
    {
        "Waltzes for piano duet ": "Sixteen Waltzes, Op. 39"
    },
    {
        ", and the  Liebeslieder Walzer, Op. 52 .       Brahms looked both backward and forward; his output was often bold in its exploration of harmony and rhythm. As a result, he was an influence on composers of both conservative and modernist tendencies. Within his lifetime, his idiom left an imprint on several composers within his personal circle, who strongly admired his music, such as Heinrich von Herzogenberg , Robert Fuchs , and Julius Röntgen , as well as on Gustav Jenner , who was his only formal composition pupil. Antonín Dvořák, who received substantial assistance from Brahms, deeply admired his music and was influenced by it in several works, such as the Symphony No. 7 in D minor and the F minor Piano Trio. Features of the Brahms style were absorbed in a more complex synthesis with other contemporary trends by Hans Rott , Wilhelm Berger , Max Reger and Franz Schmidt , whereas the British composers Hubert Parry and Edward Elgar and the Swede Wilhelm Stenhammar all testified to learning much from Brahms. As Elgar said, I look at the Third Symphony of Brahms, and I feel like a pygmy. MacDonald, Brahms , p.  406.     Ferruccio Busoni s early music shows much Brahmsian influence, and Brahms took an interest in him, though Busoni later tended to disparage Brahms. Towards the end of his life, Brahms offered substantial encouragement to Ernő Dohnányi and to Alexander von Zemlinsky . Their early chamber works show a thoroughgoing absorption of the Brahmsian idiom. Zemlinsky, moreover, was in turn the teacher of Arnold Schoenberg, and Brahms was apparently impressed by drafts of two movements of Schoenbergs early Quartet in D major which Zemlinsky showed him in 1897. In 1933, Schoenberg wrote an essay Brahms the Progressive , which drew attention to his fondness for motivic saturation and irregularities of rhythm and phrase; in his last book , he analysed Brahmss enriched harmony and exploration of remote tonal regions. These efforts paved the way for a re-evaluation of his reputation in the 20th century. Schoenberg went so far as to orchestrate one of Brahmss piano quartets. Schoenbergs pupil Anton Webern , in his 1933 lectures, posthumously published under the title The Path to the New Music, claimed Brahms as one who had anticipated the developments of the Second Viennese School , and Weberns own Op.  1, an orchestral passacaglia , is clearly in part a homage to, and development of, the variation techniques of the passacaglia-finale of Brahmss Fourth Symphony. Ann Scott Thematic transmutation in the music of Brahms: A matter of musical alchemy. Journal of Musicological Research, 15:177–206. has shown how Brahms anticipated the procedures of the serialists by redistributing melodic fragments between instruments, as in the first movement of the Clarinet Sonata, Op.120 No. 2.     Brahms was honoured in the German hall of fame, the Walhalla memorial . On 14 September 2000, he was introduced there as the 126th rühmlich ausgezeichneter Teutscher and 13th composer among them, with a bust by sculptor .       Brahms was baptised into the Lutheran church as an infant, and was confirmed at aged fifteen , but has been described as an agnostic and a humanist. Swafford, 2012, p. 327: He continued, in high theological mode. Brahms was not about to put up with that sort of thing. He was a humanist and an agnostic, and his Requiem was going to express that, Reinthaler or no. The devout Catholic Antonín Dvořák wrote in a letter: Such a man, such a fine soul – and he believes in nothing! He believes in nothing! Swafford, 1997 When asked by conductor Karl Reinthaler to add additional explicitly religious text to his ": null
    },
    {
        "German Requiem": "A German Requiem"
    }
]