[
    {
        "                John Milton  was an English poet and intellectual, who served as a civil servant for the ": null
    },
    {
        "Commonwealth of England": "Commonwealth Of England"
    },
    {
        " under its Council of State and later under ": null
    },
    {
        "Oliver Cromwell": "Oliver Cromwell"
    },
    {
        ". He wrote at a time of religious flux and political upheaval, and is best known for his ": null
    },
    {
        "epic poem": "Epic Poetry"
    },
    {
        "  Paradise Lost  , written in ": null
    },
    {
        "blank verse": "Blank Verse"
    },
    {
        ".     Writing in English, Latin, Greek, and Italian, he achieved international renown within his lifetime, and his celebrated  Areopagitica  , written in condemnation of ": null
    },
    {
        "pre-publication censorship": "Prior Restraint"
    },
    {
        ", is among historys most influential and impassioned defences of ": null
    },
    {
        "freedom of speech": "Freedom Of Speech"
    },
    {
        " and ": null
    },
    {
        "freedom of the press": "Freedom Of The Press"
    },
    {
        ". His desire for freedom extended into his style: he introduced new words to the English language, and was the first modern writer to employ non-rhymed verse outside of the theatre or translations.     ": null
    },
    {
        "William Hayleys": "William Hayley"
    },
    {
        " 1796 biography called him the greatest English author , McCalman 2001 p. 605. and he remains generally regarded as one of the preeminent writers in the English language , Contemporary Literary Criticism. . though critical reception has oscillated in the centuries since his death . ": null
    },
    {
        "Samuel Johnson": "Samuel Johnson"
    },
    {
        " praised Paradise Lost as a poem which...with respect to design may claim the first place, and with respect to performance, the second, among the productions of the human mind , though he  described Miltons politics as those of an acrimonious and surly republican .  Poets such as ": null
    },
    {
        "William Blake": "William Blake"
    },
    {
        ", ": null
    },
    {
        "William Wordsworth": "William Wordsworth"
    },
    {
        " and ": null
    },
    {
        "Thomas Hardy": "Thomas Hardy"
    },
    {
        " revered him.          The phases of Miltons life parallel the major historical and political divisions in ": null
    },
    {
        "Stuart": "House Of Stuart"
    },
    {
        " Britain. Milton studied, travelled, wrote poetry mostly for private circulation, and launched a career as pamphleteer and publicist under the increasingly personal rule of ": null
    },
    {
        "Charles I": "Charles I Of England"
    },
    {
        " and its breakdown into constitutional confusion and war. The shift in accepted attitudes in government placed him in public office under the ": null
    },
    {
        "Commonwealth of England": "Commonwealth Of England"
    },
    {
        ", from being thought dangerously radical and even heretical, and he even acted as an official spokesman in certain of his publications. The ": null
    },
    {
        "Restoration": "English Restoration"
    },
    {
        " of 1660 deprived Milton, now completely blind, of his public platform, but this period saw him complete most of his major works of poetry.     Miltons views developed from his very extensive reading, as well as travel and experience, from his student days of the 1620s to the ": null
    },
    {
        "English Civil War": "English Civil War"
    },
    {
        ". Masson 1859 pp. v–vi. By the time of his death in 1674, Milton was impoverished and on the margins of English intellectual life, yet famous throughout Europe and unrepentant for his political choices.               John Milton was born in Bread Street, London on 9 December 1608, the son of composer ": null
    },
    {
        "John Milton": "John Milton"
    },
    {
        " and his wife Sarah Jeffrey. The senior John Milton moved to London around 1583 after being disinherited by his devout Catholic father Richard the Ranger Milton for embracing Protestantism. In London, the senior John Milton married Sarah Jeffrey and found lasting financial success as a ": null
    },
    {
        "scrivener": "Scrivener"
    },
    {
        ".  He lived in and worked from a house on ": null
    },
    {
        "Bread Street": "Bread Street"
    },
    {
        ", where the ": null
    },
    {
        "Mermaid Tavern": "Mermaid Tavern"
    },
    {
        " was located in ": null
    },
    {
        "Cheapside": "Cheapside"
    },
    {
        ". The elder Milton was noted for his skill as a musical composer, and this talent left his son with a lifelong appreciation for music and friendships with musicians such as ": null
    },
    {
        "Henry Lawes": "Henry Lawes"
    },
    {
        ". Lewalski 2003 p. 3.     Miltons fathers prosperity provided his eldest son with a private tutor, ": null
    },
    {
        "Thomas Young": "Thomas Young"
    },
    {
        ", a Scottish Presbyterian with an M.A. from the University of St. Andrews. Research suggests that Youngs influence served as the poets introduction to religious radicalism. Skerpan-Wheeler, Elizabeth. John Milton. British Rhetoricians and Logicians, 1500–1660: Second Series. Ed. Edward A. Malone. Detroit: Gale, 2003. Dictionary of Literary Biography Vol. 281. Literature Resource Center. After Youngs tutorship, Milton attended ": null
    },
    {
        "St Pauls School": "St Pauls School"
    },
    {
        " in London. There he began the study of Latin and Greek, and the classical languages left an imprint on both his poetry and prose in English .          Miltons first datable compositions are two psalms done at age 15 at ": null
    },
    {
        "Long Bennington": "Long Bennington"
    },
    {
        ". One contemporary source is the  Brief Lives  of ": null
    },
    {
        "John Aubrey": "John Aubrey"
    },
    {
        ", an uneven compilation including first-hand reports. In the work, Aubrey quotes Christopher, Miltons younger brother: When he was young, he studied very hard and sat up very late, commonly till twelve or one oclock at night . Aubrey adds, His complexion exceeding faire—he was so faire that they called him the Lady of Christs College. Dick 1962 pp. 270–75.     In 1625, Milton began attending ": null
    },
    {
        "Christs College, Cambridge": "Christs College, Cambridge"
    },
    {
        ". He graduated with a B.A. in 1629,  ranking fourth of 24  honours graduates that year in the University of Cambridge. Hunter 1980 p. 99. Preparing to become an ": null
    },
    {
        "Anglican": "Anglicanism"
    },
    {
        " priest, Milton stayed on and obtained his ": null
    },
    {
        "Master of Arts degree": "Master Of Arts"
    },
    {
        " on 3 July 1632.     Milton may have been ": null
    },
    {
        "rusticated": "Rustication"
    },
    {
        " in his first year for quarrelling with his tutor, Bishop ": null
    },
    {
        "William Chappell": "William Chappell"
    },
    {
        ". He was certainly at home in London in the Lent Term 1626; there he wrote his Elegia Prima, a first Latin ": null
    },
    {
        "elegy": "Elegy"
    },
    {
        ", to Charles Diodati, a friend from St Pauls. Based on remarks of ": null
    },
    {
        "John Aubrey": "John Aubrey"
    },
    {
        ", Chappell whipt Milton. This story is now disputed, though certainly Milton disliked Chappell. Wedgwood 1961 p. 178. Historian ": null
    },
    {
        "Christopher Hill": "Christopher Hill"
    },
    {
        " cautiously notes that Milton was apparently rusticated, and that the differences between Chappell and Milton may have been either religious or personal. Hill 1977 p. 34. It is also possible that, like ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        " four decades later, Milton was sent home because of the ": null
    },
    {
        "plague": "Plague"
    },
    {
        ", by which Cambridge was badly affected in 1625. In 1626, Miltons tutor was Nathaniel Tovey.     At Cambridge, Milton was on good terms with ": null
    },
    {
        "Edward King": "Edward King"
    },
    {
        ", for whom he later wrote ": null
    },
    {
        "Lycidas": "Lycidas"
    },
    {
        " . He also befriended Anglo-American dissident and theologian ": null
    },
    {
        "Roger Williams": "Roger Williams"
    },
    {
        ". Milton tutored Williams in Hebrew in exchange for lessons in Dutch. Pfeiffer 1955 pp. 363–73. Despite developing a reputation for poetic skill and general erudition, Milton experienced alienation from his peers and university life as a whole. Having once watched his fellow students attempting comedy upon the college stage, he later observed they thought themselves gallant men, and I thought them fools. Milton 1959 pp. 887–88.     Milton was disdainful of the university curriculum, which consisted of stilted formal debates conducted in Latin on abstruse topics. His own corpus is not devoid of humour, notably his sixth ": null
    },
    {
        "prolusion": "Wikt:Prolusion"
    },
    {
        " and his epitaphs on the death of ": null
    },
    {
        "Thomas Hobson": "Thomas Hobson"
    },
    {
        ". While at college, he wrote a number of his well-known shorter English poems, among them On the Morning of Christs Nativity , his Epitaph on the admirable Dramaticke Poet, W. Shakespeare ,  LAllegro , and  Il Penseroso .               Upon receiving his M.A. in 1632, Milton retired to ": null
    },
    {
        "Hammersmith": "Hammersmith"
    },
    {
        ", his fathers new home since the previous year. He also lived at ": null
    },
    {
        "Horton": "Horton, Berkshire"
    },
    {
        ", Berkshire, from 1635 and undertook six years of self-directed private study. Hill argues that this was not retreat into a rural idyll; Hammersmith was then a suburban village falling into the orbit of London, and even Horton was becoming deforested and suffered from the plague. Hill 1977 p. 38. He read both ancient and modern works of theology, philosophy, history, politics, literature, and science in preparation for a prospective poetical career. Miltons intellectual development can be charted via entries in his ": null
    },
    {
        "commonplace book": "Commonplace Book"
    },
    {
        " , now in the ": null
    },
    {
        "British Library": "British Library"
    },
    {
        ". As a result of such intensive study, Milton is considered to be among the most learned of all English poets. In addition to his years of private study, Milton had command of Latin, Greek, Hebrew, French, Spanish, and Italian from his school and undergraduate days; he also added Old English to his linguistic repertoire in the 1650s while researching his History of Britain, and probably acquired proficiency in Dutch soon after. Lewalski 2003 p. 103.          Milton continued to write poetry during this period of study; his  Arcades  and  Comus  were both commissioned for ": null
    },
    {
        "masques": "Masques"
    },
    {
        " composed for noble patrons, connections of the Egerton family, and performed in 1632 and 1634 respectively. Comus argues for the virtuousness of ": null
    },
    {
        "temperance": "Temperance"
    },
    {
        " and ": null
    },
    {
        "chastity": "Chastity"
    },
    {
        ". He contributed his ": null
    },
    {
        "pastoral": "Pastoral"
    },
    {
        " elegy": "Elegy"
    },
    {
        "  Lycidas  to a memorial collection for one of his fellow-students at Cambridge. Drafts of these poems are preserved in Miltons poetry notebook, known as the Trinity Manuscript because it is now kept at ": null
    },
    {
        "Trinity College": "Trinity College, Cambridge"
    },
    {
        ", Cambridge.     In May 1638, Milton embarked upon a tour of France and Italy that lasted until July or August 1639. Chaney 1985 and 2000. His travels supplemented his study with new and direct experience of artistic and religious traditions, especially Roman Catholicism. He met famous theorists and intellectuals of the time, and was able to display his poetic skills. For specific details of what happened within Miltons ": null
    },
    {
        "grand tour": "Grand Tour"
    },
    {
        " , there appears to be just one ": null
    },
    {
        "primary source": "Primary Source"
    },
    {
        " Defensio Secunda . There are other records, including some letters and some references in his other prose tracts, but the bulk of the information about the tour comes from a work that, according to ": null
    },
    {
        "Barbara Lewalski": "Barbara Lewalski"
    },
    {
        ", was not intended as autobiography but as rhetoric, designed to emphasise his sterling reputation with the learned of Europe. Lewalski 2003 pp. 87–88.     He first went to ": null
    },
    {
        "Calais": "Calais"
    },
    {
        " and then on to Paris, riding horseback, with a letter from diplomat ": null
    },
    {
        "Henry Wotton": "Henry Wotton"
    },
    {
        " to ambassador ": null
    },
    {
        "John Scudamore": "John Scudamore"
    },
    {
        ". Through Scudamore, Milton met ": null
    },
    {
        "Hugo Grotius": "Hugo Grotius"
    },
    {
        ", a Dutch law philosopher, playwright, and poet. Milton left France soon after this meeting. He travelled south from ": null
    },
    {
        "Nice": "Nice, France"
    },
    {
        " to ": null
    },
    {
        "Genoa": "Genoa"
    },
    {
        ", and then to ": null
    },
    {
        "Livorno": "Livorno"
    },
    {
        " and ": null
    },
    {
        "Pisa": "Pisa"
    },
    {
        ". He reached Florence in July 1638. While there, Milton enjoyed many of the sites and structures of the city. His candour of manner and erudite neo-Latin poetry earned him friends in Florentine intellectual circles, and he met the astronomer ": null
    },
    {
        "Galileo": "Galileo"
    },
    {
        " who was under ": null
    },
    {
        "house arrest": "House Arrest"
    },
    {
        " at ": null
    },
    {
        "Arcetri": "Arcetri"
    },
    {
        ", as well as others. Lewalski 2003 pp. 88–94. Milton probably visited the Florentine Academy and the ": null
    },
    {
        "Accademia della Crusca": "Accademia Della Crusca"
    },
    {
        " along with smaller academies in the area, including the Apatisti and the ": null
    },
    {
        "Svogliati": "Svogliati"
    },
    {
        ".          He left Florence in September to continue to Rome. With the connections from Florence, Milton was able to have easy access to Romes intellectual society. His poetic abilities impressed those like Giovanni Salzilli, who praised Milton within an epigram. In late October, Milton attended a dinner given by the ": null
    },
    {
        "English College, Rome": "English College, Rome"
    },
    {
        ", despite his dislike for the ": null
    },
    {
        "Society of Jesus": "Society Of Jesus"
    },
    {
        ", meeting English Catholics who were also guests—theologian ": null
    },
    {
        "Henry Holden": "Henry Holden"
    },
    {
        " and the poet ": null
    },
    {
        "Patrick Cary": "Patrick Cary"
    },
    {
        ". Chaney 1985 and 2000 and Lewalski p. 96. He also attended musical events, including oratorios, operas, and melodramas. Milton left for ": null
    },
    {
        "Naples": "Naples"
    },
    {
        " toward the end of November, where he stayed only for a month because of the Spanish control. Chaney 1985 p. 244–51 and Chaney 2000 p. 313. During that time, he was introduced to Giovanni Battista Manso, patron to both ": null
    },
    {
        "Torquato Tasso": "Torquato Tasso"
    },
    {
        " and to ": null
    },
    {
        "Giambattista Marino": "Giambattista Marino"
    },
    {
        ". Lewalski 2003 pp. 94–98.     Originally, Milton wanted to leave Naples in order to travel to ": null
    },
    {
        "Sicily": "Sicily"
    },
    {
        " and then on to Greece, but he returned to England during the summer of 1639 because of what he claimed in Defensio Secunda Lewalski 2003 p. 98. were sad tidings of civil war in England. Milton 1959 Vol. IV part I pp. 618–19. Matters became more complicated when Milton received word that his childhood friend Diodati had died. Milton in fact stayed another seven months on the continent, and spent time at ": null
    },
    {
        "Geneva": "Geneva"
    },
    {
        " with Diodatis uncle after he returned to Rome. In Defensio Secunda, Milton proclaimed that he was warned against a return to Rome because of his frankness about religion, but he stayed in the city for two months and was able to experience ": null
    },
    {
        "Carnival": "Carnival"
    },
    {
        " and meet ": null
    },
    {
        "Lukas Holste": "Lukas Holste"
    },
    {
        ", a Vatican librarian who guided Milton through its collection. He was introduced to Cardinal ": null
    },
    {
        "Francesco Barberini": "Francesco Barberini"
    },
    {
        " who invited Milton to an opera hosted by the Cardinal. Around March, Milton travelled once again to Florence, staying there for two months, attending further meetings of the academies, and spending time with friends. After leaving Florence, he travelled through Lucca, Bologna, and Ferrara before coming to ": null
    },
    {
        "Venice": "Venice"
    },
    {
        ". In Venice, Milton was exposed to a model of Republicanism, later important in his political writings, but he soon found another model when he travelled to Geneva. From Switzerland, Milton travelled to Paris and then to Calais before finally arriving back in England in either July or August 1639. Lewalski 2003 pp. 99–109.               On returning to England where the ": null
    },
    {
        "Bishops Wars": "Bishops Wars"
    },
    {
        " presaged further armed conflict, Milton began to write prose ": null
    },
    {
        "tracts": "Tract"
    },
    {
        " against ": null
    },
    {
        "episcopacy": "Episcopacy"
    },
    {
        ", in the service of the ": null
    },
    {
        "Puritan": "Puritan"
    },
    {
        " and ": null
    },
    {
        "Parliamentary": "Long Parliament"
    },
    {
        " cause. Miltons first foray into polemics was Of Reformation touching Church Discipline in England , followed by Of Prelatical Episcopacy, the two defences of ": null
    },
    {
        "Smectymnuus": "Smectymnuus"
    },
    {
        " , and  The Reason of Church-Government Urged against Prelaty . He vigorously attacked the High-church party of the Church of England and their leader ": null
    },
    {
        "William Laud": "William Laud"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        ", with frequent passages of real eloquence lighting up the rough controversial style of the period, and deploying a wide knowledge of church history.     He was supported by his fathers investments, but Milton became a private schoolmaster at this time, educating his nephews and other children of the well-to-do. This experience and discussions with educational reformer ": null
    },
    {
        "Samuel Hartlib": "Samuel Hartlib"
    },
    {
        " led him to write his short tract  Of Education  in 1644, urging a reform of the national universities.     In June 1642, Milton paid a visit to the manor house at ": null
    },
    {
        "Forest Hill, Oxfordshire": "Forest Hill, Oxfordshire"
    },
    {
        ", and returned with 16-year-old bride Mary Powell.   Lobel 1957 pp. 122–34. Mary found life difficult with the severe 35-year-old schoolmaster and pamphleteer, and she returned to her family a month later. She did not return until 1645, partly because of the outbreak of the ": null
    },
    {
        "Civil War": "First English Civil War"
    },
    {
        ".     In the meantime, her desertion prompted Milton to publish ": null
    },
    {
        "a series of pamphlets": "Miltons Divorce Tracts"
    },
    {
        " over the next three years arguing for the legality and morality of divorce.  In 1643, Milton had a brush with the authorities over these writings, in parallel with ": null
    },
    {
        "Hezekiah Woodward": "Hezekiah Woodward"
    },
    {
        ", who had more trouble. Lewalski 2003 pp. 181–82, 600. It was the hostile response accorded the divorce tracts that spurred Milton to write  Areopagitica; A speech of Mr. John Milton for the Liberty of Unlicencd Printing, to the Parlament of England , his celebrated attack on pre-printing censorship. In Areopagitica, Milton aligns himself with the parliamentary cause, and he also begins to synthesize the ideal of neo-Roman liberty with that of Christian liberty. Ann Hughes, Milton, Areopagitica, and the Parliamentary Cause, The Oxford Handbook of Milton, ed. Nicholas McDowell and Nigel Smith, Oxford University Press, 2009 Blair Hoxby, Areopagitica and Liberty, The Oxford Handbook of Milton, ed. Nicholas McDowell and Nigel Smith, Oxford University Press, 2009       With the parliamentary victory in the Civil War, Milton used his pen in defence of the republican principles represented by the Commonwealth.  The Tenure of Kings and Magistrates  defended the right of the people to hold their rulers to account, and implicitly sanctioned the ": null
    },
    {
        "regicide": "Regicide"
    },
    {
        "; Miltons political reputation got him appointed Secretary for Foreign Tongues by the Council of State in March 1649. His main job description was to compose the English Republics foreign correspondence in Latin, but he also was called upon to produce propaganda for the regime and to serve as a censor. C. Sullivan, Milton and the Beginning of Civil Service, in Literature in the Public Service , Ch. 2.          In October 1649, he published  Eikonoklastes , an explicit defence of the regicide, in response to the  Eikon Basilike , a phenomenal best-seller popularly attributed to Charles I that portrayed the King as an innocent Christian ": null
    },
    {
        "martyr": "Martyr"
    },
    {
        ". Milton tried to break this powerful image of Charles I . A month later, however, the exiled ": null
    },
    {
        "Charles II": "Charles Ii Of England"
    },
    {
        " and his party published the defence of monarchy Defensio Regia pro Carolo Primo, written by leading humanist ": null
    },
    {
        "Claudius Salmasius": "Claudius Salmasius"
    },
    {
        ". By January of the following year, Milton was ordered to write a defence of the English people by the ": null
    },
    {
        "Council of State": "English Council Of State"
    },
    {
        ". Milton worked more slowly than usual, given the European audience and the English Republics desire to establish diplomatic and cultural legitimacy, as he drew on the learning marshalled by his years of study to compose a riposte.     On 24 February 1652, Milton published his Latin defence of the English people  Defensio pro Populo Anglicano , also known as the First Defence. Miltons pure Latin prose and evident learning exemplified in the First Defence quickly made him a European reputation, and the work ran to numerous editions. von Maltzahn 1999 p. 239. He addressed his Sonnet 16 to The Lord Generall Cromwell in May 1652 beginning Cromwell, our chief of men... , although it was not published until 1654.      In 1654, Milton completed the second defence of the English nation Defensio secunda in response to an anonymous Royalist tract  Regii Sanguinis Clamor ad Coelum Adversus Parricidas Anglicanos  a work that made many personal attacks on Milton.  The second defence praised ": null
    },
    {
        "Oliver Cromwell": "Oliver Cromwell"
    },
    {
        ", now Lord Protector, while exhorting him to remain true to the principles of the Revolution. ": null
    },
    {
        "Alexander Morus": "Alexander Morus"
    },
    {
        ", to whom Milton wrongly attributed the Clamor , published an attack on Milton, in response to which Milton published the autobiographical Defensio pro se in 1655. Milton held the appointment of Secretary for Foreign Tongues to the Commonwealth Council of State until 1660, although after he had become totally blind, most of the work was done by his deputies, Georg Rudolph Wecklein, then Philip Meadows, and from 1657 by the poet ": null
    },
    {
        "Andrew Marvell": "Andrew Marvell"
    },
    {
        ".      By 1652, Milton had become totally blind; John Leonard, in the introduction to Paradise Lost , Penguin Classics page ix 2000 the cause of his blindness is debated but bilateral ": null
    },
    {
        "retinal detachment": "Retinal Detachment"
    },
    {
        " or ": null
    },
    {
        "glaucoma": "Glaucoma"
    },
    {
        " are most likely.  His blindness forced him to dictate his ": null
    },
    {
        "verse": "Verse"
    },
    {
        " and prose to ": null
    },
    {
        "amanuenses": "Amanuensis"
    },
    {
        " who copied them out for him; one of these was poet Andrew Marvell. One of his best-known sonnets is presumed to date from this period,  When I Consider How My Light is Spent , titled by a later editor, Bishop John Newton, On His Blindness .        Cromwells death in 1658 caused the English Republic to collapse into feuding military and political factions. Milton, however, stubbornly clung to the beliefs that had originally inspired him to write for the Commonwealth. In 1659, he published  A Treatise of Civil Power , attacking the concept of a state-dominated church , as well as Considerations touching the likeliest means to remove hirelings, denouncing corrupt practises in church governance. As the Republic disintegrated, Milton wrote several proposals to retain a non-monarchical government against the wishes of parliament, soldiers, and the people.       A Letter to a Friend, Concerning the Ruptures of the Commonwealth, written in October 1659, was a response to ": null
    },
    {
        "General Lamberts": "John Lambert"
    },
    {
        " recent dissolution of the ": null
    },
    {
        "Rump Parliament": "Rump Parliament"
    },
    {
        ".   Proposals of certain expedients for the preventing of a civil war now feared, written in November 1659.    The Ready and Easy Way to Establishing a Free Commonwealth , in two editions, responded to ": null
    },
    {
        "General Moncks": "George Monck, 1St Duke Of Albemarle"
    },
    {
        " march towards London to restore the ": null
    },
    {
        "Long Parliament": "Long Parliament"
    },
    {
        " . The work is an impassioned, bitter, and futile ": null
    },
    {
        "jeremiad": "Jeremiad"
    },
    {
        " damning the English people for backsliding from the cause of ": null
    },
    {
        "liberty": "Liberty"
    },
    {
        " and advocating the establishment of an authoritarian rule by an ": null
    },
    {
        "oligarchy": "Oligarchy"
    },
    {
        " set up by unelected parliament.     Upon the ": null
    },
    {
        "Restoration": "English Restoration"
    },
    {
        " in May 1660, Milton went into hiding for his life, while a warrant was issued for his arrest and his writings were burnt. He re-emerged after ": null
    },
    {
        "a general pardon": "Indemnity And Oblivion Act"
    },
    {
        " was issued, but was nevertheless arrested and briefly imprisoned before influential friends intervened, such as Marvell, now an MP. Milton married for a third and final time on 24 February 1663, marrying Elizabeth Minshull, aged 24, a native of ": null
    },
    {
        "Wistaston": "Wistaston"
    },
    {
        ", Cheshire. He spent the remaining decade of his life living quietly in London, only retiring to a cottage during the ": null
    },
    {
        "Great Plague of London": "Great Plague Of London"
    },
    {
        "—": null
    },
    {
        "Miltons Cottage": "Miltons Cottage"
    },
    {
        " in ": null
    },
    {
        "Chalfont St. Giles": "Chalfont St. Giles"
    },
    {
        ", his only extant home.     During this period, Milton published several minor prose works, such as the grammar textbook Art of Logic and a History of Britain. His only explicitly political tracts were the 1672 Of True Religion, arguing for ": null
    },
    {
        "toleration": "Toleration"
    },
    {
        " , and a translation of a Polish tract advocating an elective monarchy. Both these works were referred to in the ": null
    },
    {
        "Exclusion": "Exclusion Bill"
    },
    {
        " debate, the attempt to exclude the heir presumptive from the throne of England—": null
    },
    {
        "James, Duke of York": "James, Duke Of York"
    },
    {
        "—because he was Roman Catholic. That debate preoccupied politics in the 1670s and 1680s and precipitated the formation of the ": null
    },
    {
        "Whig party": "British Whig Party"
    },
    {
        " and the ": null
    },
    {
        "Glorious Revolution": "Glorious Revolution"
    },
    {
        ".     Milton died of kidney failure on 8 November 1674 and was buried in the church of ": null
    },
    {
        "St Giles-without-Cripplegate": "St Giles-Without-Cripplegate"
    },
    {
        ", ": null
    },
    {
        "Fore Street": "Fore Street, London"
    },
    {
        ", London.  According to an early biographer, his funeral was attended by his learned and great Friends in London, not without a friendly concourse of the Vulgar. Toland 1932 p. 193. A monument was added in 1793, sculpted by ": null
    },
    {
        "John Bacon the Elder": "John Bacon"
    },
    {
        ".       Milton and his first wife Mary Powell had four children:   Anne   Mary   John   Deborah      Mary Powell died on 5 May 1652 from complications following Deborahs birth. Miltons daughters survived to adulthood, but he always had a strained relationship with them.     On 12 November 1656, Milton was married to Katherine Woodcock at ": null
    },
    {
        "St Margarets, Westminster": "St Margarets, Westminster"
    },
    {
        ". Milton, John, in Journal of the Society of Arts, 8 November 1867, p. 755 She died on 3 February 1658, less than four months after giving birth to her daughter Katherine, who also died.     Milton married for a third time on 24 February 1663 to Elizabeth Mynshull or Minshull , the niece of Thomas Mynshull, a wealthy apothecary and philanthropist in Manchester. The marriage took place at St Mary Aldermary in the City of London. Despite a 31-year age gap, the marriage seemed happy, according to John Aubrey , and lasted more than 12 years until Miltons death. Samuel Johnson, however, claims that Mynshull was a domestic companion and attendant and that Miltons nephew Edward Phillips relates that Mynshull oppressed his children in his lifetime, and cheated them at his death . Johnson 1826 Vol. I 86.     His nephews, Edward and John Phillips , were educated by Milton and became writers themselves. John acted as a secretary, and Edward was Miltons first biographer.       Miltons poetry was slow to see the light of day, at least under his name. His first published poem was On Shakespeare , anonymously included in the Second Folio edition of William Shakespeare s plays in 1632. An annoted copy of the First Folio has been suggested to contain marginal notes by Milton. Flood, Alison, , The Guardian, 16 September 2019 Milton collected his work in ": null
    },
    {
        "1645 Poems": "1645 Poems"
    },
    {
        " in the midst of the excitement attending the possibility of establishing a new English government. The anonymous edition of Comus was published in 1637, and the publication of Lycidas in 1638 in Justa Edouardo King Naufrago was signed J. M. Otherwise. The 1645 collection was the only poetry of his to see print until ": null
    },
    {
        "Paradise Lost": "Paradise Lost"
    },
    {
        " appeared in 1667.     Paradise Lost": null
    },
    {
        "magnum opus": "Masterpiece"
    },
    {
        ", the blank-verse epic poem ": null
    },
    {
        "Paradise Lost": "Paradise Lost"
    },
    {
        ", was composed by the blind and impoverished Milton from 1658 to 1664 , with small but significant revisions published in 1674 . As a blind poet, Milton dictated his verse to a series of aides in his employ. It has been argued that the poem reflects his personal despair at the failure of the Revolution yet affirms an ultimate optimism in human potential. Some literary critics have argued that Milton encoded many references to his unyielding support for the Good Old Cause . Hill 1977.     On 27 April 1667, Milton sold the publication rights for Paradise Lost to publisher Samuel Simmons for £5 , with a further £5 to be paid if and when each print run sold out of between 1,300 and 1,500 copies. The first run was a quarto edition priced at three shilling s per copy , published in August 1667, and it sold out in eighteen months.     Milton followed up the publication Paradise Lost with its sequel ": null
    },
    {
        "Paradise Regained": "Paradise Regained"
    },
    {
        ", which was published alongside the tragedy ": null
    },
    {
        "Samson Agonistes": "Samson Agonistes"
    },
    {
        " in 1671. Both of these works also resonate with Miltons post-Restoration political situation. Just before his death in 1674, Milton supervised a second edition of Paradise Lost, accompanied by an explanation of why the poem rhymes not , and prefatory verses by Andrew Marvell . In 1673, Milton republished his 1645 Poems, as well as a collection of his letters and the Latin prolusions from his Cambridge days.       An unfinished religious manifesto, ": null
    },
    {
        "De doctrina christiana": "De Doctrina Christiana"
    },
    {
        ", probably written by Milton, lays out many of his heterodox theological views, and was not discovered and published until 1823. Miltons key beliefs were idiosyncratic, not those of an identifiable group or faction, and often they go well beyond the orthodoxy of the time. Their tone, however, stemmed from the Puritan emphasis on the centrality and inviolability of conscience. See, for instance, Barker, Arthur. Milton and the Puritan Dilemma, 1641–1660. Toronto: University of Toronto Press, 1942: 338 and passim; Wolfe, Don M. Milton in the Puritan Revolution. New York: T. Nelson and Sons, 1941: 19. He was his own man, but he was anticipated by Henry Robinson in Areopagitica.       While Miltons beliefs are generally considered to be consistent with Protestant Christianity, Stephen Fallon argues that by the late 1650s, Milton may have at least toyed with the idea of monism or animist materialism, the notion that a single material substance which is animate, self-active, and free composes everything in the universe: from stones and trees and bodies to minds, souls, angels, and God. Stephen Fallon, Milton Among the Philosophers , p. 81. Fallon claims that Milton devised this position to avoid the mind-body dualism of Plato and Descartes as well as the mechanistic determinism of Hobbes . According to Fallon, Miltons monism is most notably reflected in Paradise Lost when he has angels eat and apparently engage in sexual intercourse and the De Doctrina, where he denies the dual natures of man and argues for a theory of Creation ex Deo .       Milton was a passionately individual Christian Humanist poet. He appears on the pages of seventeenth century English Puritanism, an age characterized as the world turned upside down. He is a Puritan and yet is unwilling to surrender conscience to party positions on public policy. Thus, Miltons political thought, driven by competing convictions, a Reformed faith and a Humanist spirit, led to enigmatic outcomes. Milton’s apparently contradictory stance on the vital problems of his age, arose from religious contestations, to the questions of the divine rights of kings. In both the cases, he seems in control, taking stock of the situation arising from the polarization of the English society on religious and political lines. He fought with the Puritans against the Cavaliers i.e. the King’s party, and helped win the day. But the very same constitutional and republican polity, when tried to curtail freedom of speech, Milton, given his humanistic zeal, wrote Areopagitica . . . thu     Miltons political thought may be best categorized according to respective periods in his life and times. The years 1641–42 were dedicated to church politics and the struggle against episcopacy. After his divorce writings, Areopagitica, and a gap, he wrote in 1649–54 in the aftermath of the execution of Charles I , and in polemic justification of the regicide and the existing Parliamentarian regime. Then in 1659–60 he foresaw the Restoration, and wrote to head it off. Blair Worden, Literature and Politics in Cromwellian England: John Milton, Andrew Marvell and Marchamont Nedham , p. 154.     Miltons own beliefs were in some cases both unpopular and dangerous, and this was true particularly to his commitment to republicanism . In coming centuries, Milton would be claimed as an early apostle of liberalism. Milton and Republicanism, ed. David Armitage, Armand Himy, and Quentin Skinner . According to James Tully:         A friend and ally in the pamphlet wars was Marchamont Nedham . Austin Woolrych considers that although they were quite close, there is little real affinity, beyond a broad republicanism , between their approaches. Austin Woolrych , Commonwealth to Protectorate , p. 34. Blair Worden remarks that both Milton and Nedham, with others such as Andrew Marvell and James Harrington , would have taken their problem with the Rump Parliament to be not the republic itself, but the fact that it was not a proper republic. Worden p. 149. Woolrych speaks of the gulf between Miltons vision of the Commonwealths future and the reality . Austin Woolrych, Commonwealth to Protectorate , p. 101. In the early version of his ": null
    },
    {
        "History of Britain": "History Of Britain"
    },
    {
        ", begun in 1649, Milton was already writing off the members of the Long Parliament as incorrigible. G. E. Aylmer , The Interregnum: The Quest for Settlement 1646–1660 , p. 17.     He praised Oliver Cromwell as the Protectorate was set up; though subsequently he had major reservations. When Cromwell seemed to be backsliding as a revolutionary, after a couple of years in power, Milton moved closer to the position of Sir Henry Vane , to whom he wrote a sonnet in 1652. Christopher Hill, Gods Englishman , p. 200. The group of disaffected republicans included, besides Vane, John Bradshaw , John Hutchinson , Edmund Ludlow , Henry Marten , Robert Overton , Edward Sexby and John Streater ; but not Marvell, who remained with Cromwells party. Milton had already commended Overton, along with Edmund Whalley and Bulstrode Whitelocke , in ": null
    },
    {
        "Defensio Secunda": "Defensio Secunda"
    },
    {
        ". William Riley Parker and Gordon Campbell, Milton , p. 444. Nigel Smith writes that         As Richard Cromwell fell from power, he envisaged a step towards a freer republic or free commonwealth , writing in the hope of this outcome in early 1660. Milton had argued for an awkward position, in the ": null
    },
    {
        "Ready and Easy Way": "The Ready And Easy Way To Establish A Free Commonwealth"
    },
    {
        ", because he wanted to invoke the Good Old Cause and gain the support of the republicans, but without offering a democratic solution of any kind. Blair Worden, Literature and Politics in Cromwellian England: John Milton, Andrew Marvell and Marchamont Nedham , Ch. 14, Milton and the Good Old Cause. His proposal, backed by reference to the oligarchical Dutch and Venetian constitutions, was for a council with perpetual membership. This attitude cut right across the grain of popular opinion of the time, which swung decisively behind the restoration of the Stuart monarchy that took place later in the year. Austin Woolrych, Last Quest for Settlement 1657–1660, p. 202, in G. E. Aylmer , The Interregnum: The Quest for Settlement 1646–1660 , p. 17. Milton, an associate of and advocate on behalf of the regicides, was silenced on political matters as Charles II returned.         Milton was neither a clergyman nor a theologian; however, theology, and particularly English Calvinism, formed the great palette on which John Milton created his greatest thoughts. John Milton wrestled with the great doctrines of the Church amidst the theological crosswinds of his age. The great Poet was undoubtedly Reformed . However, Miltons Calvinism had to find expression in a broad-spirited Humanism. Like many Renaissance artists before him, Milton attempted to integrate Christian theology with classical modes. In his early poems, the poet narrator expresses a tension between vice and virtue, the latter invariably related to Protestantism. In Comus, Milton may make ironic use of the Caroline court masque by elevating notions of purity and virtue over the conventions of court revelry and superstition. In his later poems, Miltons theological concerns become more explicit.     His use of biblical citation was wide-ranging; Harris Fletcher, standing at the beginning of the intensification of the study of the use of scripture in Miltons work , notes that typically Milton clipped and adapted biblical quotations to suit the purpose, giving precise chapter and verse only in texts for a more specialized readership. As for the plenitude of Miltons quotations from scripture, Fletcher comments, For this work, I have in all actually collated about twenty-five hundred of the five to ten thousand direct Biblical quotations which appear therein . Miltons customary English Bible was the Authorized King James . When citing and writing in other languages, he usually employed the Latin translation by Immanuel Tremellius , though he was equipped to read the Bible in Latin, in Greek, and in Hebrew, including the Targumim or Aramaic paraphrases of the Old Testament, and the Syriac version of the New, together with the available commentaries of those several versions .     Milton embraced many heterodox Christian theological views. He has been accused of rejecting the Trinity , believing instead that the Son was subordinate to the Father, a position known as Arianism ; and his sympathy or curiosity was probably engaged by Socinianism : in August 1650 he licensed for publication by William Dugard the ": null
    },
    {
        "Racovian Catechism": "Racovian Catechism"
    },
    {
        ", based on a non-trinitarian creed. Lewalski, Life of Milton, p. 253. William Bridges Hunter, A Milton Encyclopedia , Vol. VIII, p. 13. Miltons alleged Arianism, like much of his theology, is still subject of debate and controversy. Rufus Wilmot Griswold argued that In none of his great works is there a passage from which it can be inferred that he was an Arian; and in the very last of his writings he declares that the doctrine of the Trinity is a plain doctrine in Scripture. John Milton, The Prose Works of John Milton: With a Biographical Introduction by Rufus Wilmot Griswold. In Two Volumes . Vol. 1. The Prose Works of John Milton, Biographical introduction In Areopagitica, Milton classified Arians and Socinians as errorists and schismatics alongside Arminians and Anabaptists . W.F. Draper, The Religious Life and Opinions of John Milton. In The Bibliotheca Sacra and Biblical Repository, Volume 17 p. 38. A source has interpreted him as broadly Protestant, if not always easy to locate in a more precise religious category.     In his 1641 treatise, ": null
    },
    {
        "Of Reformation": "Of Reformation"
    },
    {
        ", Milton expressed his dislike for Catholicism and episcopacy, presenting Rome as a modern Babylon , and bishops as Egyptian taskmasters. These analogies conform to Miltons puritanical preference for Old Testament imagery. He knew at least four commentaries on GenesisRenaissance Commentaries on Genesis and Some Elements of the Theology of Paradise Lost, PMLA, Vol. 56, No. 1 , pp. 151–64.     Through the Interregnum , Milton often presents England, rescued from the trappings of a worldly monarchy, as an elect nation akin to the Old Testament Israel , and shows its leader, Oliver Cromwell , as a latter-day Moses . These views were bound up in Protestant views of the Millennium , which some sects, such as the Fifth Monarchists predicted would arrive in England. Milton, however, would later criticise the worldly millenarian views of these and others, and expressed orthodox ideas on the prophecy of the Four Empires . Walter S. H. Lim, John Milton, Radical Politics, and Biblical Republicanism , p. 141.     The Restoration of the Stuart monarchy in 1660 began a new phase in Miltons work. In Paradise Lost, ": null
    },
    {
        "Paradise Regained": "Paradise Regained"
    },
    {
        " and ": null
    },
    {
        "Samson Agonistes": "Samson Agonistes"
    },
    {
        ", Milton mourns the end of the godly Commonwealth . The Garden of Eden may allegorically reflect Miltons view of Englands recent Fall from Grace , while Samson s blindness and captivity—mirroring Miltons own lost sight—may be a metaphor for Englands blind acceptance of Charles II as king.   Illustrated by Paradise Lost is mortalism , the belief that the soul lies dormant after the body dies. John Rogers, The Matter of Revolution , p. xi.     Despite the Restoration of the monarchy, Milton did not lose his personal faith; Samson shows how the loss of national salvation did not necessarily preclude the salvation of the individual, while Paradise Regained expresses Miltons continuing belief in the promise of Christian salvation through Jesus Christ.     Though he maintained his personal faith in spite of the defeats suffered by his cause, the ": null
    },
    {
        "Dictionary of National Biography": "Dictionary Of National Biography"
    },
    {
        " recounted how he had been alienated from the Church of England by Archbishop William Laud, and then moved similarly from the Dissenters by their denunciation of religious tolerance in England.     Writing of the enigmatic and often conflicting views of Milton in the Puritan age, David Daiches wrote convincingly, Christian and Humanist, Protestant, patriot and heir of the golden ages of Greece and Rome, he faced what appeared to him to be the birth-pangs of a new and regenerate England with high excitement and idealistic optimism.” A fair theological summary may be: that John Milton was a Puritan, though his tendency to press further for liberty of conscience, sometimes out of conviction and often out of mere intellectual curiosity, made the great man, at least, a vital if not uncomfortable ally in the broader Puritan movement.       Milton called in the ": null
    },
    {
        "Areopagitica": "Areopagitica"
    },
    {
        " for the liberty to know, to utter, and to argue freely according to conscience, above all liberties . Hill, C. Milton and the English Revolution. Faber & Faber. 1977. pp. 155–57 Milton argued for disestablishment as the only effective way of achieving broad toleration . Rather than force a mans conscience, government should recognise the persuasive force of the gospel. Hunter, William Bridges. A Milton Encyclopedia, Volume 8 . pp. 71, 72. .           Milton wrote The Doctrine and Discipline of Divorce in 1643, at the beginning of the English Civil War. In August of that year, he presented his thoughts to the Westminster Assembly of Divines , which had been created by the Long Parliament to bring greater reform to the Church of England. The Assembly convened on 1 July against the will of King Charles I.     Miltons thinking on divorce caused him considerable trouble with the authorities. An orthodox Presbyterian view of the time was that Miltons views on divorce constituted a one-man heresy :         Even here, though, his originality is qualified: Thomas Gataker had already identified mutual solace as a principal goal in marriage. Christopher Hill , Milton and the English Revolution , p. 127. Milton abandoned his campaign to legitimise divorce after 1645, but he expressed support for ": null
    },
    {
        "polygamy": "Polygamy"
    },
    {
        " in the  De Doctrina Christiana , the theological treatise that provides the clearest evidence for his views. John Milton, The Christian Doctrine in Complete Poems and Major Prose, ed. Merritt Hughes , pp. 994–1000; Leo Miller, John Milton among the Polygamophiles .     Milton wrote during a period when thoughts about divorce were anything but simplistic; rather, there was active debate among thinkers and intellectuals at the time. However, Miltons basic approval of divorce within strict parameters set by the biblical witness was typical of many influential Christian intellectuals, particularly the Westminster divines. Milton addressed the Assembly on the matter of divorce in August 1643,  at a moment when the Assembly was beginning to form its opinion on the matter. In the Doctrine & Discipline of Divorce, Milton argued that divorce was a private matter, not a legal or ecclesiastical one. Neither the Assembly nor Parliament condemned Milton or his ideas. In fact, when the Westminster Assembly wrote the Westminster Confession of Faith they allowed for divorce in cases of infidelity or abandonment. Thus, the Christian community, at least a majority within the Puritan sub-set, approved of Miltons views.     Nevertheless, reaction among Puritans to Miltons views on divorce was mixed. ": null
    },
    {
        "Herbert Palmer": "Herbert Palmer"
    },
    {
        ", a member of the ": null
    },
    {
        "Westminster Assembly": "Westminster Assembly"
    },
    {
        ", condemned Milton in the strongest possible language:          Palmer expressed his disapproval in a sermon addressed to the Westminster Assembly. The Scottish commissioner Robert Baillie described Palmers sermon as one of the most Scottish and free sermons that ever I heard any where. Baillie, Letters and Journals, Edinburgh, 1841, II, 220.       History was particularly important for the political class of the period, and Lewalski considers that Milton more than most illustrates a remark of ": null
    },
    {
        "Thomas Hobbes": "Thomas Hobbes"
    },
    {
        " on the weight placed at the time on the classical Latin historical writers ": null
    },
    {
        "Tacitus": "Tacitus"
    },
    {
        ", ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ", ": null
    },
    {
        "Sallust": "Sallust"
    },
    {
        " and ": null
    },
    {
        "Cicero": "Cicero"
    },
    {
        ", and their republican attitudes. Lewalski, Life of Milton, p. 199. Milton himself wrote that Worthy deeds are not often destitute of worthy relaters , in Book II of his History of Britain. A sense of history mattered greatly to him: Nicholas Von Maltzahn, Miltons History of Britain: republican historiography in the English Revolution, Oxford: Clarendon Press, 1991            Once Paradise Lost was published, Miltons stature as epic poet was immediately recognised. He cast a formidable shadow over English poetry in the 18th and 19th centuries; he was often judged equal or superior to all other English poets, including ": null
    },
    {
        "Shakespeare": "Shakespeare"
    },
    {
        ". Very early on, though, he was championed by ": null
    },
    {
        "Whigs": "Whig"
    },
    {
        ", and decried by ": null
    },
    {
        "Tories": "Tories"
    },
    {
        "Edmund Ludlow": "Edmund Ludlow"
    },
    {
        " he was claimed as an early Whig, ": null
    },
    {
        "Kevin Sharpe": "Kevin Sharpe"
    },
    {
        ", Remapping Early Modern England: The Culture of Seventeenth-century Politics , p. 7. while the High Tory Anglican minister ": null
    },
    {
        "Luke Milbourne": "Luke Milbourne"
    },
    {
        " lumped Milton in with other Agents of Darkness such as ": null
    },
    {
        "John Knox": "John Knox"
    },
    {
        ", ": null
    },
    {
        "George Buchanan": "George Buchanan"
    },
    {
        ", ": null
    },
    {
        "Richard Baxter": "Richard Baxter"
    },
    {
        ", ": null
    },
    {
        "Algernon Sidney": "Algernon Sidney"
    },
    {
        " and ": null
    },
    {
        "John Locke": "John Locke"
    },
    {
        ". ": null
    },
    {
        "J. P. Kenyon": "J. P. Kenyon"
    },
    {
        ", Revolution Principles , p. 77. The political ideas of Milton, Locke, Sidney, and ": null
    },
    {
        "James Harrington": "James Harrington"
    },
    {
        " strongly influenced the ": null
    },
    {
        "Radical Whigs": "Radical Whigs"
    },
    {
        ", whose ideology in turn was central to the ": null
    },
    {
        "American Revolution": "American Revolution"
    },
    {
        ". ": null
    },
    {
        "Robert Middlekauff": "Robert Middlekauff"
    },
    {
        " , The Great Cause: The American Revolution, 1763–1789, Revised and Expanded Edition, Oxford University Press, , pp. 51, 136ff Modern scholars of Miltons life, politics, and work are known as Miltonists: his work is the subject of a very large amount of academic scholarship .             ": null
    },
    {
        "John Dryden": "John Dryden"
    },
    {
        ", an early enthusiast, in 1677 began the trend of describing Milton as the poet of the ": null
    },
    {
        "sublime": "Sublime"
    },
    {
        ".  Drydens The State of Innocence and the Fall of Man: an Opera is evidence of an immediate cultural influence. In 1695, ": null
    },
    {
        "Patrick Hume": "Patrick Hume"
    },
    {
        " became the first editor of Paradise Lost, providing an extensive apparatus of annotation and commentary, particularly chasing down allusions. Joseph M. Levine, The Battle of the Books: History and Literature in the Augustan Age , p. 247.     In 1732, the classical scholar ": null
    },
    {
        "Richard Bentley": "Richard Bentley"
    },
    {
        " offered a corrected version of Paradise Lost.  Bentley was considered presumptuous, and was attacked in the following year by ": null
    },
    {
        "Zachary Pearce": "Zachary Pearce"
    },
    {
        ". ": null
    },
    {
        "Christopher Ricks": "Christopher Ricks"
    },
    {
        " judges that, as critic, Bentley was both acute and wrong-headed, and incorrigibly eccentric ; ": null
    },
    {
        "William Empson": "William Empson"
    },
    {
        " also finds Pearce to be more sympathetic to Bentleys underlying line of thought than is warranted. ": null
    },
    {
        "Christopher Ricks": "Christopher Ricks"
    },
    {
        ", Miltons Grand Style , pp. 9, 14, 57. William Empson, Some Versions of Pastoral , p. 147.     There was an early, partial translation of Paradise Lost into German by ": null
    },
    {
        "Theodore Haak": "Theodore Haak"
    },
    {
        ", and based on that a standard verse translation by Ernest Gottlieb von Berge. A subsequent prose translation by ": null
    },
    {
        "Johann Jakob Bodmer": "Johann Jakob Bodmer"
    },
    {
        " was very popular; it influenced Friedrich Gottlieb Klopstock. The German-language Milton tradition returned to England in the person of the artist ": null
    },
    {
        "Henry Fuseli": "Henry Fuseli"
    },
    {
        ".     Many enlightenment thinkers of the 18th century revered and commented on Miltons poetry and non-poetical works. In addition to John Dryden, among them were ": null
    },
    {
        "Alexander Pope": "Alexander Pope"
    },
    {
        ", ": null
    },
    {
        "Joseph Addison": "Joseph Addison"
    },
    {
        ", ": null
    },
    {
        "Thomas Newton": "Thomas Newton"
    },
    {
        ", and ": null
    },
    {
        "Samuel Johnson": "Samuel Johnson"
    },
    {
        ". For example, in  The Spectator , Nos 267, 273, 279, 285, 291, 297, 303, 309, 315, 321, 327, 333, 339, 345, 351, 357, 363, and 369. Joseph Addison wrote extensive notes, annotations, and interpretations of certain passages of Paradise Lost. ": null
    },
    {
        "Jonathan Richardson, senior": "Jonathan Richardson"
    },
    {
        ", and Jonathan Richardson, the younger, co-wrote a book of criticism. Explanatory Notes and Remarks on Miltons Paradise Lost . In 1749, Thomas Newton published an extensive edition of Miltons poetical works with annotations provided by himself, Dryden, Pope, Addison, the Richardsons and others. Newtons edition of Milton was a culmination of the honour bestowed upon Milton by early Enlightenment thinkers; it may also have been prompted by Richard Bentleys infamous edition, described above. Samuel Johnson wrote numerous essays on Paradise Lost, and Milton was included in his  Lives of the Most Eminent English Poets  . In  The Age of Louis XIV , ": null
    },
    {
        "Voltaire": "Voltaire"
    },
    {
        " said Milton remains the glory and the wonder  of England. Voltaire, Le Siecle de Louis XIV 2, Paris: Garnier-Flammarion, 1966, p.66.            ": null
    },
    {
        "William Blake": "William Blake"
    },
    {
        " considered Milton the major English poet. Blake placed ": null
    },
    {
        "Edmund Spenser": "Edmund Spenser"
    },
    {
        " as Miltons precursor, and saw himself as Miltons poetical son. ": null
    },
    {
        "S. Foster Damon": "S. Foster Damon"
    },
    {
        ", A Blake Dictionary , p. 274. In his  Milton: A Poem in Two Books , Blake uses Milton as a character.       ": null
    },
    {
        "Edmund Burke": "Edmund Burke"
    },
    {
        " was a theorist of the ": null
    },
    {
        "sublime": "Sublime"
    },
    {
        ", and he regarded Miltons description of Hell as exemplary of sublimity as an ": null
    },
    {
        "aesthetic": "Aesthetics"
    },
    {
        " concept. For Burke, it was to set alongside mountain-tops, a storm at sea, and ": null
    },
    {
        "infinity": "Infinity"
    },
    {
        ". Bill Beckley, Sticky Sublime , p. 63. In The Beautiful and the Sublime, he wrote: No person seems better to have understood the secret of heightening, or of setting terrible things, if I may use the expression, in their strongest light, by the force of a judicious obscurity than Milton. Part II, Section I: .     The ": null
    },
    {
        "Romantic poets": "Romanticism"
    },
    {
        " valued his exploration of ": null
    },
    {
        "blank verse": "Blank Verse"
    },
    {
        ", but for the most part rejected his religiosity. ": null
    },
    {
        "William Wordsworth": "William Wordsworth"
    },
    {
        " began his sonnet London, 1802 with Milton! thou shouldst be living at this hour  and modelled  The Prelude , his own blank verse epic, on Paradise Lost. ": null
    },
    {
        "John Keats": "John Keats"
    },
    {
        " found the yoke of Miltons style uncongenial; Thomas N. Corns, A Companion to Milton , p. 474. he exclaimed that Miltonic verse cannot be written but in an artful or rather artists humour. Leader, Zachary. Revision and Romantic Authorship . Oxford: Oxford University Press, 1999. 298. . Keats felt that Paradise Lost was a beautiful and grand curiosity , but his own unfinished attempt at epic poetry,  Hyperion , was unsatisfactory to the author because, amongst other things, it had too many Miltonic inversions . In  The Madwoman in the Attic , ": null
    },
    {
        "Sandra Gilbert": "Sandra Gilbert"
    },
    {
        " and ": null
    },
    {
        "Susan Gubar": "Susan Gubar"
    },
    {
        " note that ": null
    },
    {
        "Mary Shelleys": "Mary Shelley"
    },
    {
        " novel  Frankenstein  is, in the view of many critics, one of the key Romantic readings of Paradise Lost. Cited from the original in J. Paul Hunter , Frankenstein by Mary Shelley , p. 225.       The Victorian age witnessed a continuation of Miltons influence, ": null
    },
    {
        "George Eliot": "George Eliot"
    },
    {
        " Nardo, Anna K. George Eliots Dialogue with Milton. and ": null
    },
    {
        "Thomas Hardy": "Thomas Hardy"
    },
    {
        " being particularly inspired by Miltons poetry and biography. Hostile 20th-century criticism by ": null
    },
    {
        "T. S. Eliot": "T. S. Eliot"
    },
    {
        " and ": null
    },
    {
        "Ezra Pound": "Ezra Pound"
    },
    {
        " did not reduce Miltons stature. ": null
    },
    {
        "Printz-Påhlson, Göran": "Göran Printz-Påhlson"
    },
    {
        ". Letters of Blood and Other Works in English.  pp. 10–14 F. R. Leavis, in The Common Pursuit, responded to the points made by Eliot, in particular the claim that the study of Milton could be of no help: it was only a hindrance , by arguing, As if it were a matter of deciding not to study Milton! The problem, rather, was to escape from an influence that was so difficult to escape from because it was unrecognized, belonging, as it did, to the climate of the habitual and natural. Leavis, F. R. The Common Pursuit.  & printsecfrontcovervonepage & q & ffalse ": null
    },
    {
        "Harold Bloom": "Harold Bloom"
    },
    {
        ", in  The Anxiety of Influence , wrote that Milton is the central problem in any theory and history of poetic influence in English . ": null
    },
    {
        "Harold Bloom": "Harold Bloom"
    },
    {
        ", The Anxiety of Influence: A theory of poetry , p. 33.     Miltons  Areopagitica  is still cited as relevant to the ": null
    },
    {
        "First Amendment to the United States Constitution": "First Amendment To The United States Constitution"
    },
    {
        ".  A quotation from Areopagitica— A good book is the precious lifeblood of a master spirit, embalmed and treasured up on purpose to a life beyond life —is displayed in many public libraries, including the ": null
    },
    {
        "New York Public Library": "New York Public Library"
    },
    {
        ".     The title of ": null
    },
    {
        "Philip Pullmans": "Philip Pullman"
    },
    {
        "  His Dark Materials  trilogy is derived from a quotation, His dark materials to create more worlds , line 915 of Book II in Paradise Lost. Pullman was concerned to produce a version of Miltons poem accessible to teenagers,  and has spoken of Milton as our greatest public poet .      Titles of a number of other well-known literary works are also derived from Miltons writings. Examples include ": null
    },
    {
        "Thomas Wolfes": "Thomas Wolfe"
    },
    {
        "  Look Homeward, Angel , ": null
    },
    {
        "Aldous Huxleys": "Aldous Huxley"
    },
    {
        "  Eyeless in Gaza , ": null
    },
    {
        "Arthur Koestlers": "Arthur Koestler"
    },
    {
        "  Darkness at Noon , and ": null
    },
    {
        "William Goldings": "William Golding"
    },
    {
        "  Darkness Visible . Rosen, J. Return to Paradise . The New Yorker, 2 June 2008, pp. 72–6.     T. S. Eliot believed that of no other poet is it so difficult to consider the poetry simply as poetry, without our theological and political dispositions... making unlawful entry . Eliot 1947 p. 63.            Miltons use of ": null
    },
    {
        "blank verse": "Blank Verse"
    },
    {
        ", in addition to his stylistic innovations influenced later poets. At the time, poetic blank verse was considered distinct from its use in verse drama, and  Paradise Lost  was taken as a unique examplar. Saintsbury 1908 ii. 443. Said ": null
    },
    {
        "Isaac Watts": "Isaac Watts"
    },
    {
        " in 1734, Mr. Milton is esteemed the parent and author of blank verse among us . Watts 1810 iv. 619. Miltonic verse might be synonymous for a century with blank verse as poetry, a new poetic terrain independent from both the drama and the ": null
    },
    {
        "heroic couplet": "Heroic Couplet"
    },
    {
        ".     Lack of rhyme was sometimes taken as Miltons defining innovation. He himself considered the rhymeless quality of  Paradise Lost  to be an extension of his own personal liberty:          This pursuit of freedom was largely a reaction against conservative values entrenched within the rigid heroic couplet. Gordon 2008 p. 234. Within a dominant culture that stressed elegance and finish, he granted primacy to freedom, breadth and imaginative suggestiveness, eventually developed into the romantic vision of sublime terror. Reaction to Miltons poetic worldview included, grudgingly, acknowledgement that of poets resemblance to classical writers . Blank verse came to be a recognised medium for religious works and for translations of the classics. Unrhymed lyrics like ": null
    },
    {
        "Collins": "William Collins"
    },
    {
        "  Ode to Evening   were not uncommon after 1740. Dexter 1922 p. 46.     A second aspect of Miltons blank verse was the use of unconventional rhythm:          Before Milton, the sense of regular rhythm  ... had been knocked into the English head so securely that it was part of their nature . Saintsbury 1916 p. 101. The Heroick measure , according to ": null
    },
    {
        "Samuel Johnson": "Samuel Johnson"
    },
    {
        ", is pure  ... when the accent rests upon every second syllable through the whole line   The repetition of this sound or percussion at equal times, is the most complete harmony of which a single verse is capable , Johnson 1751 no. 86. ": null
    },
    {
        "Caesura": "Caesura"
    },
    {
        "l pauses, most agreed, were best placed at the middle and the end of the line. In order to support this symmetry, lines were most often octo- or deca-syllabic, with no ": null
    },
    {
        "enjambed": "Enjambed"
    },
    {
        " endings. To this schema Milton introduced modifications, which included ": null
    },
    {
        "hypermetric": "Hypermetric"
    },
    {
        "al ": null
    },
    {
        "syllables": "Syllable"
    },
    {
        " , ": null
    },
    {
        "inversion": "Inversion"
    },
    {
        " or slighting of ": null
    },
    {
        "stresses": "Stress"
    },
    {
        ", and the shifting of pauses to all parts of the line. Dexter 1922 p. 57. Milton deemed these features to be reflective of the transcendental union of order and freedom . Saintsbury 1908 ii. 458–59. Admirers remained hesitant to adopt such departures from traditional metrical schemes: The English  ... had been writing separate lines for so long that they could not rid themselves of the habit . Dexter 1922 p. 59. Isaac Watts preferred his lines distinct from each other, as did ": null
    },
    {
        "Oliver Goldsmith": "Oliver Goldsmith"
    },
    {
        ", ": null
    },
    {
        "Henry Pemberton": "Henry Pemberton"
    },
    {
        ", and ": null
    },
    {
        "Scott of Amwell": "Scott Of Amwell"
    },
    {
        ", whose general opinion it was that Miltons frequent omission of the initial unaccented foot was displeasing to a nice ear . Saintsbury 1916 p. 114. It was not until the late 18th century that poets  began to appreciate the composition of Miltons harmony  ... how he loved to vary his pauses, his measures, and his feet, which gives that enchanting air of freedom and wilderness to his versification . Gray 1748 Observations on English Metre.          While ": null
    },
    {
        "neo-classical": "Neoclassicism"
    },
    {
        " diction was as restrictive as its ": null
    },
    {
        "prosody": "Prosody"
    },
    {
        ", and narrow imagery paired with uniformity of sentence structure resulted in a small set of 800 nouns circumscribing the vocabulary of 90% of heroic couplets ever written up to the eighteenth century, Hobsbaum 1996 p. 40. and tradition required that the same adjectives attach to the same nouns, followed by the same verbs, Miltons pursuit of liberty extended into his vocabulary as well. It included many Latinate ": null
    },
    {
        "neologisms": "Neologism"
    },
    {
        ", as well as obsolete words already dropped from popular usage so completely that their meanings were no longer understood. In 1740, ": null
    },
    {
        "Francis Peck": "Francis Peck"
    },
    {
        " identified some examples of Miltons old words . They included self-same , hue , minstrelsy , murky , carol , and chaunt . Among Miltons naturalized Latin words were humid , orient , hostil , facil , fervid , jubilant , ire , bland , reluctant , palpable , fragil , and ornate . Peck 1740 pp. 110–11. The Miltonian dialect , as it was called, was emulated by later poets; Pope used the diction of Paradise Lost in his ": null
    },
    {
        "Homer": "Homer"
    },
    {
        " translation, while the lyric poetry of Gray and Collins was frequently criticised for their use of obsolete words out of Spenser and Milton . Scott 1785 63. The language of ": null
    },
    {
        "Thomsons": "James Thomson"
    },
    {
        " finest poems  was self-consciously modelled after the Miltonian dialect, with the same tone and sensibilities as Paradise Lost. Following to Milton, English poetry from Pope to ": null
    },
    {
        "John Keats": "John Keats"
    },
    {
        " exhibited a steadily increasing attention to the connotative, the imaginative and poetic, value of words. Saintsbury 1908 ii. 468.         Miltons ": null
    },
    {
        "ode": "Ode"
    },
    {
        " At a solemn Musick was set for choir and orchestra as  Blest Pair of Sirens  by ": null
    },
    {
        "Hubert Parry": "Hubert Parry"
    },
    {
        " , and Miltons poem On the Morning of Christs Nativity was set as a large-scale choral work by ": null
    },
    {
        "Cyril Rootham": "Cyril Rootham"
    },
    {
        " . Milton also wrote the hymn ": null
    },
    {
        "Let us with a gladsome mind": "Let Us With A Gladsome Mind"
    },
    {
        ", a versification of Psalm 136. His LAllegro and Il Penseroso, with additional material, were magnificently set by Handel .                1629:  On the Morning of Christs Nativity   On Shakespeare   On Arriving at the Age of Twenty-Three   LAllegro   Il Penseroso   A Mask Presented at Ludlow Castle, 1634 , commonly known as  Comus     1637:  Lycidas   Poems of Mr John Milton, Both English and Latin   When I Consider How My Light is Spent    On the Late Massacre in Piedmont   Paradise Lost   Paradise Regained   Samson Agonistes   Poems, & c, Upon Several Occasions   Of Reformation     Of Prelatical Episcopacy     Animadversions     The Reason of Church-Government Urged against Prelaty     Apology for Smectymnuus     Doctrine and Discipline of Divorce     Judgement of Martin Bucer Concerning Divorce     Of Education     Areopagitica     Tetrachordon     Colasterion     The Tenure of Kings and Magistrates     Eikonoklastes     Defensio pro Populo Anglicano  First Defence    Defensio Secunda  Second Defence    A Treatise of Civil Power     The Likeliest Means to Remove Hirelings from the Church     The Ready and Easy Way to Establish a Free Commonwealth     Brief Notes Upon a Late Sermon     Accedence Commenced Grammar     The History of Britain     Artis logicae plenior institutio  Art of Logic    Of True Religion     Epistolae Familiaries     Prolusiones    A brief History of Moscovia, and other less known Countries lying Eastward of Russia as far as Cathay, gathered from the writings of several Eye-witnesses    De Doctrina Christiana        ": null
    }
]