[
    {
        "              John Donne  was an English poet and ": null
    },
    {
        "cleric": "Clergy"
    },
    {
        " in the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ".     He is considered the pre-eminent representative of the ": null
    },
    {
        "metaphysical poets": "Metaphysical Poets"
    },
    {
        ". His works are noted for their strong, sensual style and include ": null
    },
    {
        "sonnets": "Sonnet"
    },
    {
        ", love poems, religious poems, ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " translations, ": null
    },
    {
        "epigrams": "Epigram"
    },
    {
        ", ": null
    },
    {
        "elegies": "Elegy"
    },
    {
        ", songs, satires and ": null
    },
    {
        "sermons": "Sermon"
    },
    {
        ". His poetry is noted for its vibrancy of language and inventiveness of ": null
    },
    {
        "metaphor": "Metaphor"
    },
    {
        ", especially compared to that of his contemporaries. Donnes style is characterised by abrupt openings and various paradoxes, ironies and dislocations. These features, along with his frequent dramatic or everyday speech rhythms, his tense syntax and his tough eloquence, were both a reaction against the smoothness of conventional Elizabethan poetry and an adaptation into English of European baroque and mannerist techniques. His early career was marked by poetry that bore immense knowledge of English society and he met that knowledge with sharp criticism. Another important theme in Donnes poetry is the idea of true religion, something that he spent much time considering and about which he often theorized. He wrote secular poems as well as erotic and love poems. He is particularly famous for his mastery of metaphysical ": null
    },
    {
        "conceits": "Conceit"
    },
    {
        ".     Despite his great education and poetic talents, Donne lived in poverty for several years, relying heavily on wealthy friends. He spent much of the money he inherited during and after his education on womanising, literature, pastimes, and travel. In 1601, Donne secretly married Anne More, with whom he had twelve children. In 1615 he was ordained deacon and then ": null
    },
    {
        "Anglican": "Anglican"
    },
    {
        " priest, although he did not want to take Holy Orders and only did so because the king ordered it. In 1621, he was appointed the ": null
    },
    {
        "Dean of St Pauls": "Dean Of St Pauls"
    },
    {
        " Cathedral in London. He also served as a member of Parliament in 1601 and in 1614.              Donne was born in London in 1572, into a ": null
    },
    {
        "recusant": "Recusant"
    },
    {
        " Roman Catholic family when practice of that religion was illegal in England. Donne was the third of six children. His father, also named John Donne, was of Welsh descent and a warden of the ": null
    },
    {
        "Ironmongers Company": "Ironmongers Company"
    },
    {
        " in the ": null
    },
    {
        "City of London": "City Of London"
    },
    {
        ". However, he avoided unwelcome government attention out of fear of persecution.      His father died in 1576, when Donne was four years old, leaving his mother, Elizabeth Heywood, with the responsibility of raising the children alone. Heywood was also from a ": null
    },
    {
        "recusant": "Recusancy"
    },
    {
        " Roman Catholic family, the daughter of ": null
    },
    {
        "John Heywood": "John Heywood"
    },
    {
        ", the playwright, and sister of the Reverend ": null
    },
    {
        "Jasper Heywood": "Jasper Heywood"
    },
    {
        ", a Jesuit priest and translator. She was also a great-niece of ": null
    },
    {
        "Thomas More": "Thomas More"
    },
    {
        ". A few months after her husband died, Donnes mother married Dr. John Syminges, a wealthy widower with three children of his own. Donne thus acquired a stepfather.     Donne was educated privately; however, there is no evidence to support the popular claim that he was taught by ": null
    },
    {
        "Jesuits": "Society Of Jesus"
    },
    {
        ". In 1583, at the age of 11, he began studies at ": null
    },
    {
        "Hart Hall": "Hart Hall"
    },
    {
        ", now ": null
    },
    {
        "Hertford College, Oxford": "Hertford College, Oxford"
    },
    {
        ". After three years of studies there, Donne was admitted to the ": null
    },
    {
        "University of Cambridge": "University Of Cambridge"
    },
    {
        ", where he studied for another three years. Donne, however, could not obtain a degree from either institution because of his Catholicism, since he refused to take the ": null
    },
    {
        "Oath of Supremacy": "Oath Of Supremacy"
    },
    {
        " required to graduate. In 1591 he was accepted as a student at the ": null
    },
    {
        "Thavies Inn": "Thavies Inn"
    },
    {
        " legal school, one of the ": null
    },
    {
        "Inns of Chancery": "Inns Of Chancery"
    },
    {
        " in London. On 6 May 1592 he was admitted to ": null
    },
    {
        "Lincolns Inn": "Lincolns Inn"
    },
    {
        ", one of the ": null
    },
    {
        "Inns of Court": "Inns Of Court"
    },
    {
        ".     In 1593, five years after the defeat of the ": null
    },
    {
        "Spanish Armada": "Spanish Armada"
    },
    {
        " and during the intermittent ": null
    },
    {
        "Anglo-Spanish War ": "Anglo-Spanish War"
    },
    {
        ", Queen Elizabeth issued the first English statute against sectarian dissent from the Church of England, titled An Act for restraining Popish recusants . It defined Popish recusants as those convicted for not repairing to some Church, Chapel, or usual place of Common Prayer to hear Divine Service there, but forbearing the same contrary to the tenor of the laws and statutes heretofore made and provided in that behalf . Donnes brother Henry was also a university student prior to his arrest in 1593 for harbouring a Catholic priest, ": null
    },
    {
        "William Harrington": "William Harrington"
    },
    {
        ", and died in ": null
    },
    {
        "Newgate Prison": "Newgate Prison"
    },
    {
        " of ": null
    },
    {
        "bubonic plague": "Bubonic Plague"
    },
    {
        ", leading Donne to begin questioning his Catholic faith.     During and after his education, Donne spent much of his considerable inheritance on women, literature, pastimes and travel. Although no record details precisely where Donne travelled, he did cross Europe and later fought alongside the ": null
    },
    {
        "Earl of Essex": "Earl Of Essex"
    },
    {
        " and Sir ": null
    },
    {
        "Walter Raleigh": "Walter Raleigh"
    },
    {
        " against the Spanish ": null
    },
    {
        "at Cadiz ": "Capture Of Cádiz"
    },
    {
        " and ": null
    },
    {
        "the Azores ": "Islands Voyage"
    },
    {
        ", and witnessed the loss of the Spanish flagship, the  San Felipe .  According to his earliest biographer,        By the age of 25 he was well prepared for the diplomatic career he appeared to be seeking. He was appointed chief secretary to the ": null
    },
    {
        "Lord Keeper of the Great Seal": "Lord Keeper Of The Great Seal"
    },
    {
        ", Sir ": null
    },
    {
        "Thomas Egerton": "Thomas Egerton, 1St Viscount Brackley"
    },
    {
        ", and was established at Egertons London home, ": null
    },
    {
        "York House, Strand": "York House, Strand"
    },
    {
        " close to the ": null
    },
    {
        "Palace of Whitehall": "Palace Of Whitehall"
    },
    {
        ", then the most influential social centre in England.       During the next four years Donne fell in love with Egertons niece Anne More, and they were secretly married just before Christmas in 1601, against the wishes of both Egerton and ": null
    },
    {
        "George More": "George More"
    },
    {
        ", who was Lieutenant of the Tower and Annes father. Upon discovery, this wedding ruined Donnes career, getting him dismissed and put in ": null
    },
    {
        "Fleet Prison": "Fleet Prison"
    },
    {
        ", along with the Church of England priest ": null
    },
    {
        "Samuel Brooke": "Samuel Brooke"
    },
    {
        ", who married them, and the man who acted as a witness to the wedding. Donne was released shortly thereafter when the marriage was proved to be valid, and he soon secured the release of the other two. Walton tells us that when Donne wrote to his wife to tell her about losing his post, he wrote after his name: John Donne, Anne Donne, Un-done. It was not until 1609 that Donne was reconciled with his father-in-law and received his wifes ": null
    },
    {
        "dowry": "Dowry"
    },
    {
        ".          After his release, Donne had to accept a retired country life in a small house in ": null
    },
    {
        "Pyrford": "Pyrford"
    },
    {
        ", Surrey, owned by Annes cousin, Sir ": null
    },
    {
        "Francis Wooley": "Francis Wooley"
    },
    {
        ", where they resided until the end of 1604. In spring 1605 they moved to another small house in ": null
    },
    {
        "Mitcham, London": "Mitcham, London"
    },
    {
        ", where he scraped a meager living as a lawyer, while Anne Donne bore a new baby almost every year. Though he also worked as an assistant pamphleteer to ": null
    },
    {
        "Thomas Morton": "Thomas Morton"
    },
    {
        " writing anti-Catholic pamphlets, Donne was in a constant state of financial insecurity.     Anne gave birth to 12 children in 16 years of marriage, ; indeed, she spent most of her married life either pregnant or ": null
    },
    {
        "nursing": "Breastfeeding"
    },
    {
        ". The 10 surviving children were Constance, ": null
    },
    {
        "John": "John Donne The Younger"
    },
    {
        ", ": null
    },
    {
        "George": "George Donne"
    },
    {
        ", Francis, Lucy , Bridget, Mary, Nicholas, Margaret, and Elizabeth. Three died before they were ten. In a state of despair that almost drove him to kill himself, Donne noted that the death of a child would mean one mouth fewer to feed, but he could not afford the burial expenses. During this time, Donne wrote but did not publish  Biathanatos , his defence of suicide. His wife died on 15 August 1617, five days after giving birth to their twelfth child, a still-born baby. Donne mourned her deeply, and wrote of his love and loss in his ": null
    },
    {
        "17th": "S:En:Holy Sonnets"
    },
    {
        " Holy Sonnet": "Holy Sonnets"
    },
    {
        ".       In 1602 John Donne was elected as Member of Parliament for the ": null
    },
    {
        "constituency of Brackley": "Brackley"
    },
    {
        ", but membership was not a paid position. Queen ": null
    },
    {
        "Elizabeth I": "Elizabeth I"
    },
    {
        " died in 1603, being succeeded by King ": null
    },
    {
        "James VI": "James Vi"
    },
    {
        " of Scotland as King James I of England. The fashion for coterie poetry of the period gave Donne a means to seek patronage, and many of his poems were written for wealthy friends or patrons, especially MP Sir ": null
    },
    {
        "Robert Drury": "Robert Drury"
    },
    {
        " of ": null
    },
    {
        "Hawsted": "Hawsted"
    },
    {
        " , whom he met in 1610 and became Donnes chief patron, furnishing him and his family an apartment in his large house in ": null
    },
    {
        "Drury Lane": "Drury Lane"
    },
    {
        ".     In 1610 and 1611 Donne wrote two ": null
    },
    {
        "anti-Catholic": "Anti-Catholic"
    },
    {
        "polemics": "Polemic"
    },
    {
        ":  Pseudo-Martyr  and  Ignatius His Conclave  for Morton. He then wrote two Anniversaries,  An Anatomy of the World  and Of the Progress of the Soul for Drury.     Donne sat as an MP again, for ": null
    },
    {
        "Taunton": "Taunton"
    },
    {
        ", in the ": null
    },
    {
        "Addled Parliament": "Addled Parliament"
    },
    {
        " of 1614 but though he attracted five appointments within its business he made no recorded speech.    Although James was pleased with Donnes work, he refused to reinstate him at court and instead urged him to take holy orders. At length, Donne acceded to the kings wishes, and in 1615 was ordained priest in the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ".        In 1615 Donne was awarded an honorary doctorate in divinity from ": null
    },
    {
        "Cambridge University": "Cambridge University"
    },
    {
        ", and became a ": null
    },
    {
        "Royal Chaplain": "Ecclesiastical Household"
    },
    {
        " in the same year, and a Reader of Divinity at Lincolns Inn in 1616, where he served in the chapel as minister until 1622. In 1618 he became chaplain to ": null
    },
    {
        "Viscount Doncaster": "James Hay, 1St Earl Of Carlisle"
    },
    {
        ", who was on an embassy to the ": null
    },
    {
        "princes of Germany": ":Category:German Princes"
    },
    {
        ". Donne did not return to England until 1620. In 1621 Donne was made ": null
    },
    {
        "Dean of St Pauls": "Dean Of St Pauls"
    },
    {
        ", a leading and well-paid position in the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ", which he held until his death in 1631. At the same time he became Rector of a number of parishes, including Blunham, in Bedfordshire. Blunham Parish Church has an imposing stained glass window commemorating Donne, designed by Derek Hunt. During his period as dean his daughter Lucy died, aged eighteen. In late November and early December 1623 he suffered a nearly fatal illness, thought to be either typhus or a combination of a cold followed by a period of fever. During his convalescence he wrote a series of meditations and prayers on health, pain, and sickness that were published as a book in 1624 under the title of  Devotions upon Emergent Occasions . One of these meditations, ": null
    },
    {
        "Meditation XVII": "S:Meditation Xvii"
    },
    {
        ", contains the well known phrases No man is an Iland  and ": null
    },
    {
        "...for whom the bell tolls": "For Whom The Bell Tolls"
    },
    {
        " . In 1624 he became ": null
    },
    {
        "vicar": "Vicar"
    },
    {
        " of ": null
    },
    {
        "St Dunstan-in-the-West": "St Dunstan-In-The-West"
    },
    {
        ", and 1625 a ": null
    },
    {
        "prolocutor": "Prolocutor"
    },
    {
        " to ": null
    },
    {
        "Charles I": "Charles I Of England"
    },
    {
        ". He earned a reputation as an eloquent preacher and 160 of his sermons have survived, including ": null
    },
    {
        "Deaths Duel": "Deaths Duel"
    },
    {
        ", his famous ": null
    },
    {
        "sermon": "S:Deaths Duell, Or A Consolation To The Soul, Against The Dying Life And The Living Death Of The Body"
    },
    {
        " delivered at the ": null
    },
    {
        "Palace of Whitehall": "Palace Of Whitehall"
    },
    {
        " before King ": null
    },
    {
        "Charles I": "Charles I Of England"
    },
    {
        " in February 1631.       Donne died on 31 March 1631 and was buried in ": null
    },
    {
        "old St Pauls Cathedral": "Old St Pauls Cathedral"
    },
    {
        ", where a memorial statue of him by ": null
    },
    {
        "Nicholas Stone": "Nicholas Stone"
    },
    {
        " was erected with a Latin epigraph probably composed by himself. The memorial was one of the few to survive the ": null
    },
    {
        "Great Fire of London": "Great Fire Of London"
    },
    {
        " in 1666 and is now in ": null
    },
    {
        "St Pauls Cathedral": "St Pauls Cathedral"
    },
    {
        ". The statue was claimed by Izaac Walton in his biography to have been modelled from the life by Donne in order to suggest his appearance at the resurrection; it was to start a vogue in such monuments during the course of the 17th century. In 2012 a ": null
    },
    {
        "bust of the poet": "John Donne Memorial"
    },
    {
        " by Nigel Boonham was unveiled outside in the cathedral churchyard.       Donnes earliest poems showed a developed knowledge of English society coupled with sharp criticism of its problems. His satires dealt with common ": null
    },
    {
        "Elizabethan": "Elizabethan England"
    },
    {
        " topics, such as corruption in the legal system, mediocre poets, and pompous courtiers. His images of sickness, vomit, manure, and ": null
    },
    {
        "plague": "Bubonic Plague"
    },
    {
        " reflected his strongly satiric view of a society populated by fools and knaves. His third satire, however, deals with the problem of true religion, a matter of great importance to Donne. He argued that it was better to examine carefully ones religious convictions than blindly to follow any established tradition, for none would be saved at the ": null
    },
    {
        "Final Judgment": "Final Judgment"
    },
    {
        ", by claiming A Harry, or a Martin taught this.      Donnes early career was also notable for his erotic poetry, especially his ": null
    },
    {
        "elegies": "Elegy"
    },
    {
        ", in which he employed unconventional ": null
    },
    {
        "metaphors": "Metaphor"
    },
    {
        ", such as a ": null
    },
    {
        "flea biting two lovers being compared to sex": "The Flea"
    },
    {
        ". Donne did not publish these poems, although they circulated widely in manuscript form. One such, a previously unknown manuscript that is believed to be one of the largest contemporary collections of Donnes work , was found at ": null
    },
    {
        "Melford Hall": "Melford Hall"
    },
    {
        " in November 2018.      Some have speculated that Donnes numerous illnesses, financial strain, and the deaths of his friends all contributed to the development of a more somber and ": null
    },
    {
        "pious": "Piety"
    },
    {
        " tone in his later poems. The change can be clearly seen in ": null
    },
    {
        "An Anatomy of the World": "S:An Anatomy Of The World—The First Anniversery"
    },
    {
        " , a poem that Donne wrote in memory of Elizabeth Drury, daughter of his patron, Sir Robert Drury of Hawstead, Suffolk. This poem treats Elizabeths demise with extreme gloominess, using it as a symbol for the ": null
    },
    {
        "Fall of Man": "Fall Of Man"
    },
    {
        " and the destruction of the ": null
    },
    {
        "universe": "Universe"
    },
    {
        ".     The increasing gloominess of Donnes tone may also be observed in the religious works that he began writing during the same period. Having converted to the ": null
    },
    {
        "Anglican Church": "Anglican Church"
    },
    {
        ", Donne quickly became noted for his sermons and religious poems. Towards the end of his life Donne wrote works that challenged death, and the fear that it inspired in many men, on the grounds of his belief that those who die are sent to ": null
    },
    {
        "Heaven": "Heaven"
    },
    {
        " to live eternally. One example of this challenge is his Holy Sonnet X, ": null
    },
    {
        "Death Be Not Proud": "Death Be Not Proud"
    },
    {
        " . Even as he lay dying during ": null
    },
    {
        "Lent": "Lent"
    },
    {
        " in 1631, he rose from his sickbed and delivered the ": null
    },
    {
        "Deaths Duel sermon": "Deaths Duel"
    },
    {
        ", which was later described as his own funeral sermon. Deaths Duel portrays life as a steady descent to suffering and death; death becomes merely another process of life, in which the winding sheet of the womb is the same as that of the grave. Hope is seen in salvation and immortality through an embrace of God, Christ and the ": null
    },
    {
        "Resurrection": "Resurrection"
    },
    {
        ".       His work has received much criticism over the years, especially concerning his metaphysical form. Donne is generally considered the most prominent member of the ": null
    },
    {
        "metaphysical poets": "Metaphysical Poets"
    },
    {
        ", a phrase coined in 1781 by ": null
    },
    {
        "Samuel Johnson": "Samuel Johnson"
    },
    {
        ", following a comment on Donne by ": null
    },
    {
        "John Dryden": "John Dryden"
    },
    {
        ". Dryden had written of Donne in 1693: He affects the metaphysics, not only in his satires, but in his amorous verses, where nature only should reign; and perplexes the minds of the fair sex with nice speculations of philosophy, when he should engage their hearts, and entertain them with the softnesses of love.  In Life of Cowley , Johnson refers to the beginning of the seventeenth century in which there appeared a race of writers that may be termed the metaphysical poets . Donnes immediate successors in poetry therefore tended to regard his works with ambivalence, with the ": null
    },
    {
        "Neoclassical poets": "Neoclassical Poets"
    },
    {
        " regarding his conceits as abuse of the ": null
    },
    {
        "metaphor": "Metaphor"
    },
    {
        ". However he was revived by ": null
    },
    {
        "Romantic poets": "Romantic Poets"
    },
    {
        " such as ": null
    },
    {
        "Coleridge": "Samuel Taylor Coleridge"
    },
    {
        " and ": null
    },
    {
        "Browning": "Robert Browning"
    },
    {
        ", though his more recent revival in the early twentieth century by poets such as ": null
    },
    {
        "T. S. Eliot": "T. S. Eliot"
    },
    {
        " and critics like ": null
    },
    {
        "F R Leavis": "F R Leavis"
    },
    {
        " tended to portray him, with approval, as an anti-Romantic.     Donne is considered a master of the ": null
    },
    {
        "metaphysical conceit": "Metaphysical Conceit"
    },
    {
        ", an extended metaphor that combines two vastly different ideas into a single idea, often using imagery. An example of this is his equation of lovers with saints in ": null
    },
    {
        "The Canonization": "The Canonization"
    },
    {
        " . Unlike the conceits found in other Elizabethan poetry, most notably ": null
    },
    {
        "Petrarchan": "Petrarchan"
    },
    {
        " conceits, which formed clichéd comparisons between more closely related objects , ": null
    },
    {
        "metaphysical": "Metaphysics"
    },
    {
        " conceits go to a greater depth in comparing two completely unlike objects. One of the most famous of Donnes conceits is found in ": null
    },
    {
        "A Valediction: Forbidding Mourning": "A Valediction: Forbidding Mourning"
    },
    {
        " where he compares the apartness of two separated lovers to the working of the legs of a ": null
    },
    {
        "compass": "Compass"
    },
    {
        ".     Donnes works are also witty, employing ": null
    },
    {
        "paradox": "Paradox"
    },
    {
        "es, ": null
    },
    {
        "puns": "Pun"
    },
    {
        ", and subtle yet remarkable analogies. His pieces are often ironic and cynical, especially regarding love and human motives. Common subjects of Donnes poems are love , death , and religion.     John Donnes poetry represented a shift from classical forms to more personal poetry. Donne is noted for his ": null
    },
    {
        "poetic metre": "Poetic Metre"
    },
    {
        ", which was structured with changing and jagged rhythms that closely resemble casual speech .     Some scholars believe that Donnes literary works reflect the changing trends of his life, with love ": null
    },
    {
        "poetry": "Poetry"
    },
    {
        " and satires from his youth and religious ": null
    },
    {
        "sermons": "Sermons"
    },
    {
        " during his later years. Other scholars, such as ": null
    },
    {
        "Helen Gardner": "Helen Gardner"
    },
    {
        ", question the validity of this dating—most of his poems were published posthumously . The exception to these is his Anniversaries, which were published in 1612 and  Devotions upon Emergent Occasions  published in 1624. His sermons are also dated, sometimes specifically by date and year.          Donne is commemorated as a priest in the ": null
    },
    {
        "calendar": "Calendar Of Saints"
    },
    {
        " of the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        " and in the ": null
    },
    {
        "Calendar of Saints": "Calendar Of Saints"
    },
    {
        " of the ": null
    },
    {
        "Evangelical Lutheran Church in America": "Evangelical Lutheran Church In America"
    },
    {
        " on 31 March.     During his lifetime several likenesses were made of the poet. The earliest was the anonymous portrait of 1594 now in the ": null
    },
    {
        "National Portrait Gallery, London": "National Portrait Gallery, London"
    },
    {
        " which has been recently restored. One of the earliest Elizabethan portraits of an author, the fashionably dressed poet is shown darkly brooding on his love. The portrait was described in Donnes will as that picture of myne wych is taken in the shaddowes , and bequeathed by him to ": null
    },
    {
        "Robert Kerr, 1st Earl of Ancram": "Robert Kerr, 1St Earl Of Ancram"
    },
    {
        ". Other paintings include a 1616 head and shoulders after ": null
    },
    {
        "Isaac Oliver": "Isaac Oliver"
    },
    {
        ", also in the National Portrait Gallery, and a 1622 head and shoulders in the ": null
    },
    {
        "Victoria and Albert Museum": "Victoria And Albert Museum"
    },
    {
        ". In 1911 the young ": null
    },
    {
        "Stanley Spencer": "Stanley Spencer"
    },
    {
        " devoted a visionary painting to John Donne arriving in heaven which is now in the ": null
    },
    {
        "Fitzwilliam Museum": "Fitzwilliam Museum"
    },
    {
        ".       After Donnes death, a number of poetical tributes were paid to him, of which one of the principal was his friend ": null
    },
    {
        "Lord Herbert of Cherburys": "Lord Herbert Of Cherbury"
    },
    {
        " Elegy for Doctor Donne . Posthumous editions of Donnes poems were accompanied by several Elegies upon the Author over the course of the next two centuries. Six of these were written by fellow churchmen, others by such courtly writers as ": null
    },
    {
        "Thomas Carew": "Thomas Carew"
    },
    {
        ", ": null
    },
    {
        "Sidney Godolphin": "Sidney Godolphin"
    },
    {
        " and ": null
    },
    {
        "Endymion Porter": "Endymion Porter"
    },
    {
        ". In 1963 came ": null
    },
    {
        "Joseph Brodskys": "Joseph Brodsky"
    },
    {
        " The Great Elegy for John Donne .     Beginning in the 20th century, several historical novels appeared taking as their subject various episodes in Donnes life. His courtship of Anne More is the subject of ": null
    },
    {
        "Elizabeth Gray Vinings": "Elizabeth Gray Vining"
    },
    {
        " Take Heed of Loving Me: A novel about John Donne and Maeve Harans The Lady and the Poet . Both characters also make interspersed appearances in ": null
    },
    {
        "Mary Noviks": "Mary Novik"
    },
    {
        "  Conceit  , where the main focus is on their rebellious daughter Pegge. English treatments include ": null
    },
    {
        "Garry OConnors": "Garry Oconnor"
    },
    {
        " Deaths Duel: a novel of John Donne , which deals with the poet as a young man. He also plays a significant role in Christie Dickasons The Noble Assassin , a novel based on the life of Donnes patron and his lover, ": null
    },
    {
        "Lucy Russell, Countess of Bedford": "Lucy Russell, Countess Of Bedford"
    },
    {
        ". Finally there is Bryan Crocketts Loves Alchemy: a John Donne Mystery , in which the poet, blackmailed into service in Robert Cecils network of spies, attempts to avert political disaster and at the same time outwit Cecil.       There were musical settings of Donnes lyrics even during his lifetime and in the century following his death. These included ": null
    },
    {
        "Alfonso Ferrabosco the youngers": "Alfonso Ferrabosco The Younger"
    },
    {
        " ; ": null
    },
    {
        "John Coopers": "John Cooper"
    },
    {
        " ; ": null
    },
    {
        "Henry Lawes": "Henry Lawes"
    },
    {
        " ; ": null
    },
    {
        "John Dowlands": "John Dowland"
    },
    {
        " ;  and settings of ": null
    },
    {
        "A Hymn to God the Father": "A Hymn To God The Father"
    },
    {
        " by ": null
    },
    {
        "John Hilton the younger": "John Hilton The Younger"
    },
    {
        "  and ": null
    },
    {
        "Pelham Humfrey": "Pelham Humfrey"
    },
    {
        " .  After the 17th century there were no more until the start of the 20th century with ": null
    },
    {
        "Havergal Brian": "Havergal Brian"
    },
    {
        " , ": null
    },
    {
        "Eleanor Everest Freer": "Eleanor Everest Freer"
    },
    {
        " and Walford Davies among the earliest. In 1916–18, the composer ": null
    },
    {
        "Hubert Parry": "Hubert Parry"
    },
    {
        " set Donnes Holy Sonnet 7 to music in his choral work,  Songs of Farewell .  In 1945, ": null
    },
    {
        "Benjamin Britten": "Benjamin Britten"
    },
    {
        " set nine of Donnes Holy Sonnets in his ": null
    },
    {
        "song cycle": "Song Cycle"
    },
    {
        " for voice and piano  The Holy Sonnets of John Donne . Among them is also the choral setting of Negative Love that opens  Harmonium  by John Adams.      There have been settings in popular music as well. One is the version of the song Go and Catch a Falling Star on ": null
    },
    {
        "John Renbourns": "John Renbourn"
    },
    {
        " debut album  John Renbourn  , in which the last line is altered to False, ere I count one, two, three .  On their 1992 album Duality, the English ": null
    },
    {
        "Neoclassical Dark Wave": "Neoclassical Dark Wave"
    },
    {
        " band ": null
    },
    {
        "In The Nursery": "In The Nursery"
    },
    {
        " used a recitation of the entirety of Donnes A Valediction: Forbidding Mourning for the track Mecciano  and an augmented version of A Fever for the track Corruption.    Prose texts by Donne have also been set to music. In 1954, ": null
    },
    {
        "Priaulx Rainier": "Priaulx Rainier"
    },
    {
        " set some in her  Cycle for Declamation  for solo voice.  In 2009, the American ": null
    },
    {
        "Jennifer Higdon": "Jennifer Higdon"
    },
    {
        " composed the choral piece  On the Death of the Righteous , based on Donnes sermons.  Still more recent is the Russian minimalist ": null
    },
    {
        "Anton Batagovs": "Anton Batagov"
    },
    {
        " I Fear No More, selected songs and meditations of John Donne .         Biathanatos     Pseudo-Martyr     Ignatius His Conclave     Devotions upon Emergent Occasions    Poems          ": null
    }
]