[
    {
        "                 Georg Henri Anton Joris Ivens was a ": null
    },
    {
        "Dutch documentary film": "Dutch Documentary Film"
    },
    {
        "maker and ": null
    },
    {
        "propagandist": "Propagandist"
    },
    {
        " Among the notable films he directed or co-directed are  A Tale of the Wind ,  The Spanish Earth ,  Rain , ...A Valparaiso,  Misère au Borinage  ,  17th Parallel: Vietnam in War ,  The Seine Meets Paris ,  Far from Vietnam , Pour le Mistral and  How Yukong Moved the Mountains .       Born Georg Henri Anton Ivens  into a wealthy family, Ivens went to work in one of his fathers photo supply shops and from there developed an interest in film. Under the direction of his father, he completed his first film at 13; in college he studied economics with the goal of continuing his fathers business, but an interest in class issues distracted him from that path. He met photographer ": null
    },
    {
        "Germaine Krull": "Germaine Krull"
    },
    {
        " in Berlin in 1923, and entered into a ": null
    },
    {
        "marriage of convenience": "Marriage Of Convenience"
    },
    {
        " with her between 1927 and 1943 so that Krull could hold a Dutch passport and could have a veneer of married respectability without sacrificing her autonomy. Sichel, Kim. Germaine Krull: Photographer of Modernity. Cambridge, Massachusetts: MIT Press, 1999. Pages 41 and 70. .     Originally his work focused on technique, especially in  Rain  , a 10-minute short filmed over 2 years, and in  The Bridge  . Around this time, along with ": null
    },
    {
        "Menno ter Braak": "Menno Ter Braak"
    },
    {
        " and others, he was involved in the creation of the Dutch Film League  based in Amsterdam. The League drew foreign filmmakers to the Netherlands such as ": null
    },
    {
        "Alberto Cavalcanti": "Alberto Cavalcanti"
    },
    {
        ", ": null
    },
    {
        "René Clair": "René Clair"
    },
    {
        ", ": null
    },
    {
        "Sergei Eisenstein": "Sergei Eisenstein"
    },
    {
        ", ": null
    },
    {
        "Vsevolod Pudovkin": "Vsevolod Pudovkin"
    },
    {
        ", and ": null
    },
    {
        "Dziga Vertov": "Dziga Vertov"
    },
    {
        ", who also became his friends.     In 1929, Ivens went to the Soviet Union and was invited to direct a film on a topic of his own choosing which was the new industrial city of ": null
    },
    {
        "Magnitogorsk": "Magnitogorsk"
    },
    {
        ". Before commencing work, he returned to the Netherlands to make Industrial Symphony for Philips Electric which is considered to be a film of great technical beauty. Erik Barnouw. Documentary. New York: Oxford University Press, 2nd revised edition, 1993. pp.: 133-134 He returned to the Soviet Union to make the film about Magnitogorsk, Song of Heroes  in 1931 with music composed by ": null
    },
    {
        "Hanns Eisler": "Hanns Eisler"
    },
    {
        ". This was the first film on which Ivens and Eisler worked together. It was a propaganda film about this new industrial city where masses of forced laborers and communist youth worked for Stalins Five Year Plan.   With ": null
    },
    {
        "Henri Storck": "Henri Storck"
    },
    {
        ", Ivens made  Misère au Borinage  , a documentary on life in a coal mining region. In 1943, he also directed two Allied propaganda films for the ": null
    },
    {
        "National Film Board of Canada": "National Film Board Of Canada"
    },
    {
        ", including Action Stations, about the ": null
    },
    {
        "Royal Canadian Navys": "Royal Canadian Navy"
    },
    {
        " escorting of convoys in the ": null
    },
    {
        "Battle of the Atlantic": "Battle Of The Atlantic"
    },
    {
        ".          From 1936 to 1945, Ivens was based in the United States. For ": null
    },
    {
        "Pare Lorentzs": "Pare Lorentz"
    },
    {
        " U.S. Film Service": "U.S. Film Service"
    },
    {
        ", in the year 1940, he made a documentary film on ": null
    },
    {
        "rural electrification": "Rural Electrification"
    },
    {
        " called Power and the Land. It focused on a family, the Parkinsons, who ran a business providing milk for their community. The film showed the problem in the lack of electricity and the way the problem was fixed. Ivens was, however, known for his anti-": null
    },
    {
        "fascist": "Fascism"
    },
    {
        " and other ": null
    },
    {
        "propaganda films": "Propaganda Film"
    },
    {
        ", including  The Spanish Earth , for the Spanish ": null
    },
    {
        "Republicans": "Republican Faction"
    },
    {
        ", co-written with ": null
    },
    {
        "Ernest Hemingway": "Ernest Hemingway"
    },
    {
        " and music by ": null
    },
    {
        "Marc Blitzstein": "Marc Blitzstein"
    },
    {
        " and ": null
    },
    {
        "Virgil Thomson": "Virgil Thomson"
    },
    {
        ". ": null
    },
    {
        "Jean Renoir": "Jean Renoir"
    },
    {
        " did the French narration for the film and Hemingway did the English version only after ": null
    },
    {
        "Orson Welless": "Orson Welles"
    },
    {
        " sounded too theatrical.. This film was financed by ": null
    },
    {
        "Archibald MacLeish": "Archibald Macleish"
    },
    {
        ", ": null
    },
    {
        "Fredric March": "Fredric March"
    },
    {
        ", ": null
    },
    {
        "Florence Eldridge": "Florence Eldridge"
    },
    {
        ", ": null
    },
    {
        "Lillian Hellman": "Lillian Hellman"
    },
    {
        ", ": null
    },
    {
        "Luise Rainer": "Luise Rainer"
    },
    {
        ", ": null
    },
    {
        "Dudley Nichols": "Dudley Nichols"
    },
    {
        ", ": null
    },
    {
        "Franchot Tone": "Franchot Tone"
    },
    {
        " and other Hollywood movie stars, moguls, and writers who composed a group known as the ": null
    },
    {
        "Contemporary Historians": "Contemporary Historians"
    },
    {
        ".  Spanish Earth  was shown at the ": null
    },
    {
        "White House": "White House"
    },
    {
        " on July 8, 1937 after Ivens, Hemingway, ": null
    },
    {
        "Martha Gellhorn": "Martha Gellhorn"
    },
    {
        ", had had dinner with President ": null
    },
    {
        "Franklin D. Roosevelt": "Franklin D. Roosevelt"
    },
    {
        ", ": null
    },
    {
        "Eleanor Roosevelt": "Eleanor Roosevelt"
    },
    {
        " and ": null
    },
    {
        "Harry Hopkins": "Harry Hopkins"
    },
    {
        ". The Roosevelts loved the film but said that it needed more propaganda. This 1937 documentary was considered his masterpiece.     In 1938 he traveled to China.  The 400 Million  depicted the history of modern China and the Chinese resistance during the ": null
    },
    {
        "Second Sino-Japanese War": "Second Sino-Japanese War"
    },
    {
        ", including dramatic shots of the ": null
    },
    {
        "Battle of Taierzhuang": "Battle Of Taierzhuang"
    },
    {
        ". ": null
    },
    {
        "Robert Capa": "Robert Capa"
    },
    {
        " did camerawork, ": null
    },
    {
        "Sidney Lumet": "Sidney Lumet"
    },
    {
        " worked on the film as a reader, ": null
    },
    {
        "Hanns Eisler": "Hanns Eisler"
    },
    {
        " wrote the musical score, and ": null
    },
    {
        "Fredric March": "Fredric March"
    },
    {
        " provided the narration. It, too, had been financed by the same people as those of Spanish Earth. Its chief fundraiser was ": null
    },
    {
        "Luise Rainer": "Luise Rainer"
    },
    {
        ", recipient of the best actress ": null
    },
    {
        "Oscar": "Academy Award"
    },
    {
        " two years in a row; and the entire group called themselves this time, History Today, Inc . The ": null
    },
    {
        "Guomindang": "Guomindang"
    },
    {
        " government censored the film, fearing that it would give too much credit to left-wing forces. European Foundation Joris Ivens.   Ivens was also suspected of being a friend of ": null
    },
    {
        "Mao Zedong": "Mao Zedong"
    },
    {
        " and especially ": null
    },
    {
        "Zhou Enlai": "Zhou Enlai"
    },
    {
        ". Martha Gellhorn. A Memoir: Travels with Myself and Another. New York: Penguin Putnam, Inc, 1978. p.:52     In early 1943, ": null
    },
    {
        "Frank Capra": "Frank Capra"
    },
    {
        " hired Ivens to supervise the production of Know Your Enemy: Japan  for his U.S. War Department film series  Why We Fight . The films commentary was written largely by ": null
    },
    {
        "Carl Foreman": "Carl Foreman"
    },
    {
        ". Capra fired Ivens from the project because he felt that his approach was too sympathetic toward the Japanese. The films release was held up because there were concerns that ": null
    },
    {
        "Emperor Hirohito": "Emperor Hirohito"
    },
    {
        " was being depicted as a war criminal, and there was a policy shift to portray the Emperor more favorably after the war as a means of maintaining order in post-war Japan.     With the emerging Red Scare of the late 1940s, Ivens was forced to leave the country in the early months of the Truman administration. Ivens leftist politics also put the kibosh on his first feature film project which was to have starred ": null
    },
    {
        "Greta Garbo": "Greta Garbo"
    },
    {
        ". In fact, ": null
    },
    {
        "Walter Wanger": "Walter Wanger"
    },
    {
        ", the films producer, was adamant about running out of town.         In 1946, commissioned to make a Dutch film about Indonesian independence, Ivens resigned in protest over what he considered ongoing ": null
    },
    {
        "imperialism": "Imperialism"
    },
    {
        "; the Dutch were in his view resisting decolonization. Instead, Ivens filmed  Indonesia Calling  in secret. For around a decade Ivens lived in Eastern Europe, working for several studios there. His position concerning Indonesia and his taking sides for the ": null
    },
    {
        "Eastern Bloc": "Eastern Bloc"
    },
    {
        " in the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        " annoyed the Dutch government. Over a period of many years, he was obliged to renew his passport every three or four months. According to later mythology however, he lost his passport for ten years, which is not true, as demonstrated by the fact that he was able to travel to New York City to sit by the bedside of his old friend ": null
    },
    {
        "Paul Robeson": "Paul Robeson"
    },
    {
        " when he was ill.     From 1965 to 1970 he filmed two propaganda films about North Vietnam during the war: he made  17e parallèle: La guerre du peuple   and he participated in the collective work  Loin du Vietnam  . He was awarded the ": null
    },
    {
        "Lenin Peace Prize": "Lenin Peace Prize"
    },
    {
        " for the year 1967.     From 1971 to 1977, he shot  How Yukong Moved the Mountains , a 763-minute propaganda documentary about the ": null
    },
    {
        "Cultural Revolution": "Cultural Revolution"
    },
    {
        " in China. He was given unprecedented access because of his pro-communist views and his old personal friendships with ": null
    },
    {
        "Zhou Enlai": "Zhou Enlai"
    },
    {
        " and ": null
    },
    {
        "Mao Zedong": "Mao Zedong"
    },
    {
        ".     He spoke to ": null
    },
    {
        "Radio Netherlands": "Radio Netherlands"
    },
    {
        " about his life and work in a wide-ranging interview.      In 1988 Ivens received the ": null
    },
    {
        "Golden Lion Honorary Award": "Golden Lion"
    },
    {
        " at the ": null
    },
    {
        "Venice Film Festival": "Venice Film Festival"
    },
    {
        ".  He then received the ": null
    },
    {
        "Order of the Netherlands Lion": "Order Of The Netherlands Lion"
    },
    {
        " in January 1989, and died on 28 June that year. Shortly before his death he released the last of more than 40 films  Une histoire de vent  . A statue of Ivens by sculptor ": null
    },
    {
        "Bryan McCormack": "Bryan Mccormack"
    },
    {
        " was erected in the ": null
    },
    {
        "Parc de Saint-Cloud": "Parc De Saint-Cloud"
    },
    {
        " in Paris in 2010.        The Flaming Arrow   O, Sunland   The Sunhouse   Film Sketchbook   The Sick Town   Instruction Films Micro Camera, University Leiden   Movement Studies in Paris   Filmstudy Zeedijk   The Street   Ice Skating    The Bridge     Rain    Breakers   Poor Drenthe   Pile Diving   Zonneland   We are building   Second Union Film   Zuiderzee   Tribune Film   Concrete Construction   Donogoo-Tonka   Philips Radio   Creosote   Komsomol,   New Earth    Borinage     The Spanish Earth    The 400 Million   New Frontiers   Power and the Land Released to DVD as part of a compilation. See    Our Russian Front   Action Stations   Corvette Port Arthur    Know Your Enemy: Japan     Indonesia Calling    The First Years   Friendship Triumphs   Peace Tour 1952   Chagall    The Song of the Rivers    My Child   The Windrose / Rose of the Winds   The war of the 600 Million People   Letters from China   LItalia non è un paese povero   Demain à Nanguila   Carnet de viaje   Pueblo en armas   Le petit chapiteau   Le train de la victoire   ...A Valparaiso   Le mistral   Rotterdam Europoort   Le ciel - La terre    Far from Vietnam    Une histoire de ballon    17th Parallel: Vietnam in War    Le people et ses fusills    How Yukong Moved the Mountains    Les ouigours   Les Kazaks   The Drugstore    A Tale of the Wind    ": null
    }
]