[
    {
        "           Joseph Cheshire Cotten Jr. was an American film, stage, radio and television actor. Cotten achieved prominence on ": null
    },
    {
        "Broadway": "Broadway Theatre"
    },
    {
        ", starring in the original stage productions of  The Philadelphia Story  and  Sabrina Fair .     He first gained worldwide fame in three ": null
    },
    {
        "Orson Welles": "Orson Welles"
    },
    {
        " films:  Citizen Kane  ,  The Magnificent Ambersons  , and  Journey into Fear  , for which Cotten was also credited with the screenplay. He went on to become one of the leading Hollywood actors of the 1940s, appearing in films such as  Shadow of a Doubt  ,  Love Letters  ,  Duel in the Sun  ,  Portrait of Jennie  ,  The Third Man  and  Niagara  . One of his final films was ": null
    },
    {
        "Michael Ciminos": "Michael Cimino"
    },
    {
        "  Heavens Gate  .             Joseph Cotten was born in 1905 in ": null
    },
    {
        "Petersburg": "Petersburg, Virginia"
    },
    {
        ", ": null
    },
    {
        "Virginia": "Virginia"
    },
    {
        ", the first of three boys born for Joseph Cheshire Cotten, Sr., an assistant postmaster, and Sally Willson Cotten.   He grew up in the ": null
    },
    {
        "Tidewater region": "Tidewater Region"
    },
    {
        " and showed an aptitude for drama and a gift for storytelling.     In 1923, when Cotten was 18, his family arranged for him to receive private lessons at the Hickman School of Expression in Washington, D.C., and underwrote his expenses. Joseph Cotten, 88, Dies Starred in Citizen Kane, The Third Man:   Los Angeles Times 7 Feb 1994.       Cotten earned spending money playing professional football on Sundays, for $25 a quarter. After graduation, he earned enough money as a lifeguard at Wilcox Lake to pay back his familys loan, with interest.      He moved to Miami in 1925 and worked as an advertising salesman for The Miami Herald at $35 a week. He started performing at the Miami Civic Theatre, and worked there for five years, also reviewing the shows for the Herald.       Cotten moved to New York and went to work for ": null
    },
    {
        "David Belasco": "David Belasco"
    },
    {
        " as an assistant stage manager. He understudied ": null
    },
    {
        "Melvyn Douglas": "Melvyn Douglas"
    },
    {
        " in  Tonight or Never  then took over Douglas role for the Copley Theatre in Boston, where he worked on over 30 plays. Joseph Cotten, Film and Stage Actor, Dies; Starred in Citizen Kane, The Third Man:   Weil, Martin. The Washington Post 7 Feb 1994: d07.     Cotten struggled to find work in the depression so turned to modeling and acting in industrial films. He also performed on radio. Cotten made his Broadway debut in 1932 in Absent Friends which ran for 88 performances.      He followed it with  Jezebel  , staged by ": null
    },
    {
        "Katherine Cornell": "Katherine Cornell"
    },
    {
        " and ": null
    },
    {
        "Guthrie McClintic": "Guthrie Mcclintic"
    },
    {
        ", which only had a short run.      He was in Loose Moments which ran for 8 performances.        In 1934, Cotten met and became friends with ": null
    },
    {
        "Orson Welles": "Orson Welles"
    },
    {
        ", a fellow cast member on ": null
    },
    {
        "CBS Radios": "Cbs Radio"
    },
    {
        "  The American School of the Air .  Welles regarded Cotten as a brilliant comic actor,   and gave him the starring role in his ": null
    },
    {
        "Federal Theatre Project": "Federal Theatre Project"
    },
    {
        " farce,  Horse Eats Hat    .  Cotten was sure that Horse Eats Hat won him the notice of his future Broadway co-star, ": null
    },
    {
        "Katharine Hepburn": "Katharine Hepburn"
    },
    {
        ".      Cotten said Welles later told him Youre very lucky to be tall and thin and have curly hair. You can also move about the stage without running into the furniture. But these are fringe assets, and Im afraid youll never make it as an actor. But as a star, I think you well might hit the jackpot. Obituary: Joseph Cotten   Rule, Vera. The Guardian 8 Feb 1994.     In 1937, Cotten became an inaugural member of Welless ": null
    },
    {
        "Mercury Theatre": "Mercury Theatre"
    },
    {
        " company, starring in its Broadway productions  Caesar  as Publius; it ran for 157 performances.     He followed it with  The Shoemakers Holiday  and  Dantons Death  for Welles. Cotten also performed in radio dramas presented on  The Mercury Theatre on the Air  and  The Campbell Playhouse .     Cotten made his film debut in the Welles-directed short,  Too Much Johnson , a comedy that was intended to complement the aborted 1938 Mercury stage production of ": null
    },
    {
        "William Gillettes": "William Gillette"
    },
    {
        " 1890 play. The film was never screened in public and was lost until 2013.      The Philadelphia Story": null
    },
    {
        "Katharine Hepburns": "Katharine Hepburn"
    },
    {
        " Tracy Lord in the original production of ": null
    },
    {
        "Philip Barrys": "Philip Barry"
    },
    {
        "  The Philadelphia Story . The play ran for 417 performances at the ": null
    },
    {
        "Shubert Theatre": "Shubert Theatre"
    },
    {
        ", and in the months before its extensive national tour a ": null
    },
    {
        "film version": "The Philadelphia Story"
    },
    {
        " was to be made by MGM. Cotten went to Hollywood, but discovered there that his stage success in The Philadelphia Story translated to, in the words of his agent ": null
    },
    {
        "Leland Hayward": "Leland Hayward"
    },
    {
        ", spending a solid year creating the ": null
    },
    {
        "Cary Grant": "Cary Grant"
    },
    {
        " role. Hayward suggested that they call Cottens good pal, Orson Welles. Hes been making big waves out here, Hayward said. Maybe nobody in Hollywood ever heard of the Shubert Theatre in New York, but everybody certainly knows about the Mercury Theatre in New York.      Citizen Kane War of the Worlds  1938 ": null
    },
    {
        "Halloween": "Halloween"
    },
    {
        " radio broadcast, Welles gained a unique contract with ": null
    },
    {
        "RKO Pictures": "Rko Pictures"
    },
    {
        ". The two-picture deal promised full creative control for the young director below an agreed budget limit, and Welless intention was to feature the ": null
    },
    {
        "Mercury Players": "Mercury Theatre"
    },
    {
        " in his productions. Shooting had still not begun on a Welles film after a year, but after a meeting with writer ": null
    },
    {
        "Herman J. Mankiewicz": "Herman J. Mankiewicz"
    },
    {
        " Welles had a suitable project.     In mid-1940, filming began on  Citizen Kane , portraying the life of a press magnate who starts out as an ": null
    },
    {
        "idealist": "Idealism"
    },
    {
        " but eventually turns into a corrupt, lonely old man. The film featured Cotten prominently in the role of Kanes best friend ": null
    },
    {
        "Jedediah Leland": "Sources For Citizen Kanejedediah Leland"
    },
    {
        ", eventually a drama critic for one of Kanes papers.     When released on May 1, 1941, Citizen Kane — based in part on the life of ": null
    },
    {
        "William Randolph Hearst": "William Randolph Hearst"
    },
    {
        " — did not do much business at theaters; Hearst owned numerous major newspapers, and forbade them to carry advertisements for the film. Nominated for nine ": null
    },
    {
        "Academy Awards": "Academy Awards"
    },
    {
        " in 1942, the film won only for Best Screenplay, for Mankiewicz and Welles. Citizen Kane launched the film careers of the Mercury Players, including ": null
    },
    {
        "Agnes Moorehead": "Agnes Moorehead"
    },
    {
        " , ": null
    },
    {
        "Ruth Warrick": "Ruth Warrick"
    },
    {
        " , and ": null
    },
    {
        "Ray Collins": "Ray Collins"
    },
    {
        " . However, Cotten was the only one of the four to find major success as a lead in Hollywood outside of Citizen Kane; Moorehead and Collins became successful character film actors and Warrick spent decades in a career in daytime television.     ": null
    },
    {
        "Alexander Korda": "Alexander Korda"
    },
    {
        " then hired Cotten to play ": null
    },
    {
        "Merle Oberons": "Merle Oberon"
    },
    {
        " leading man in  Lydia  . I didnt care about the movies, really, Cotten said later. I was tall. I had curly hair. I could talk. It was easy to do.     The Magnificent Ambersons and Journey Into Fear The Magnificent Ambersons  . After the commercial disappointment of Citizen Kane, RKO was apprehensive about the new film, and after poor preview responses, cut it by nearly an hour before its release. Though at points the film appeared disjointed, it was well received by critics. Despite the critical accolades Cotten received for his performance, he was again snubbed by the Academy.     Cotten was cast in the ": null
    },
    {
        "Nazi": "Nazism"
    },
    {
        "-related thriller  Journey into Fear  based on the novel by ": null
    },
    {
        "Eric Ambler": "Eric Ambler"
    },
    {
        ". It was originally scripted by ": null
    },
    {
        "Ben Hecht": "Ben Hecht"
    },
    {
        " but Welles, who was supervising, disliked it, and he rewrote it with Cotten.  Released by RKO, the Mercury production was directed by ": null
    },
    {
        "Norman Foster": "Norman Foster"
    },
    {
        ". It was a collaborative effort due to the difficulties shooting the film and the pressures related to Welless imminent departure to South America to begin work on  Its All True .        ": null
    },
    {
        "Alfred Hitchcock": "Alfred Hitchcock"
    },
    {
        " hired Cotten to play a charming serial killer in  Shadow of a Doubt  . It was made for Universal Pictures, who for whom Cotten then appeared in  Hers to Hold  , as ": null
    },
    {
        "Deanna Durbins": "Deanna Durbin"
    },
    {
        " leading man.     After Welless return he and Cotten co-produced  The Mercury Wonder Show  for members of the U.S. armed services. Opening August 3, 1943, the all-star magic and variety show was presented in a tent at 9000 Cahuenga Boulevard in Hollywood. Featured were Welles , Cotten , ": null
    },
    {
        "Rita Hayworth": "Rita Hayworth"
    },
    {
        " , ": null
    },
    {
        "Agnes Moorehead": "Agnes Moorehead"
    },
    {
        " and others. Tickets were free to servicemen, and more than 48,000 of them had seen show by September 1943.        In late 1943, Cotten visited Welless office and said that producer ": null
    },
    {
        "David O. Selznick": "David O. Selznick"
    },
    {
        " wanted to make two or three films with him, but that he wanted him under his own contract. Welles then tore up Cottens contract with Mercury Productions, saying, He can do more for you than I can. Good luck! , Orson Welles: The Man Who Was Magic. Lybrary.com, 2005,  Cotten signed a long term deal with Selznick.     Selznick loaned out Cotten and ": null
    },
    {
        "Ingrid Bergman": "Ingrid Bergman"
    },
    {
        " to ": null
    },
    {
        "MGM": "Mgm"
    },
    {
        " for the thriller  Gaslight  which was a major hit. Selznick then put Cotten in a wartime drama  Since You Went Away  alongside ": null
    },
    {
        "Claudette Colbert": "Claudette Colbert"
    },
    {
        ", ": null
    },
    {
        "Jennifer Jones": "Jennifer Jones"
    },
    {
        " and ": null
    },
    {
        "Shirley Temple": "Shirley Temple"
    },
    {
        "; it was another major success.  accessed 1 Jan 2014     Selznick followed this up by teaming Cotten with ": null
    },
    {
        "Ginger Rogers": "Ginger Rogers"
    },
    {
        " and Temple in  Ill Be Seeing You  , another melodrama. ": null
    },
    {
        "Hal Wallis": "Hal Wallis"
    },
    {
        " borrowed Cotten and Jones to make  Love Letters  . Exhibitors voted him the 17th most popular star in the United States in 1945. Bing Crosby Again Box-Office Leader: Van Johnson Second in Film Poll of Exhibitors Rogers Wins for Westerns .  The New York Times . December 28, 1945. p. 21.     Selznick used Cotten, Jennifer Jones and ": null
    },
    {
        "Gregory Peck": "Gregory Peck"
    },
    {
        " in  Duel in the Sun  , an epic Western that was hugely popular at the box office.     ": null
    },
    {
        "Dore Schary": "Dore Schary"
    },
    {
        ", who had worked for Selznick, went to run RKO and hired Cotten for  The Farmers Daughter  , where he was ": null
    },
    {
        "Loretta Youngs": "Loretta Young"
    },
    {
        " leading man. Cotten then made  Portrait of Jennie  for Selznick, co starring with Jones; Cotten played a melancholy artist who becomes obsessed with a girl who might have died many years before. His performance won Cotten the International Prize for Best Actor at the 1949 Venice International Film Festival. Joseph Cotten;Obituary   The Times; London 8 Feb 1994.     The Third Man The Third Man  , produced by Korda and Selznick. Cotten portrays a writer of ": null
    },
    {
        "pulp fiction": "Pulp Magazine"
    },
    {
        " who travels to postwar ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        " to meet his friend Harry Lime . When he arrives, he is told that Lime has died. Determined to prove to the police that his friend was murdered, he uncovers an even darker secret.          Cotten then reunited with Hitchcock and Ingrid Bergman in  Under Capricorn  as an Australian landowner with a shady past; it was a box office disappointment. So too was  Beyond the Forest  with ": null
    },
    {
        "Bette Davis": "Bette Davis"
    },
    {
        " at Warner Bros. SELZNICK STARS TO DO MOVIES FOR WARNERS   Special to THE NEW YORK TIMES.. New York Times 21 Feb 1949: 18. NEWS OF THE SCREEN   By THOMAS F. BRADYS New York Times 22 June 1948: 22.     Cotten co-starred with ": null
    },
    {
        "Joan Fontaine": "Joan Fontaine"
    },
    {
        " in  September Affair  for Hal Wallis. Selznick loaned him to 20th Century Fox for the dark ": null
    },
    {
        "Civil War": "American Civil War"
    },
    {
        " Western  Two Flags West  , then to RKO for  Walk Softly, Stranger  which reunited him with ": null
    },
    {
        "Alida Valli": "Alida Valli"
    },
    {
        " from The Third Man. It was a huge flop. Jewell, Richard and Vernon Harbin, The RKO Story. New Rochelle, New York: Arlington House, 1982, p. 253.     At Fox he did  Half Angel  with Young, then did another with Wallis at Paramount,  Peking Express  and went to MGM for  The Man with a Cloak  with ": null
    },
    {
        "Barbara Stanwyck": "Barbara Stanwyck"
    },
    {
        ". He had a cameo in Welles  Othello  . METRO FILM LEAD TO JOSEPH COTTEN: Studio Signs Actor for Role in Man With the Cloak-- Markie Directing Movie Of Local Origin   By THOMAS F. BRADY New York Times 20 Feb 1951: 21.     Cotten did a Western at Universal,  Untamed Frontier  , during the filming of which he was injured. Joseph Cotten, Injured on Set, Returns to L.A.   Los Angeles Times 21 Dec 1951: A1. He did a thriller for ": null
    },
    {
        "Andrew L. Stone": "Andrew L. Stone"
    },
    {
        ",  The Steel Trap  , which reunited with Teresa Wright from Shadow of a Doubt. SCANNING COTTENS TERRITORY   By HOWARD THOMPSON. New York Times 23 Nov 1952: X4.     At Fox he was in the ": null
    },
    {
        "Marilyn Monroe": "Marilyn Monroe"
    },
    {
        " vehicle  Niagara  , after ": null
    },
    {
        "James Mason": "James Mason"
    },
    {
        " turned down the role. He narrated  Egypt by Three  and was reunited with Stone in  A Blueprint for Murder  .     Sabrina Fair and television Sabrina Fair , opposite ": null
    },
    {
        "Margaret Sullavan": "Margaret Sullavan"
    },
    {
        ". The production ran November 11, 1953 – August 21, 1954, and was the basis of the ": null
    },
    {
        "Billy Wilder": "Billy Wilder"
    },
    {
        " film  Sabrina , which starred ": null
    },
    {
        "Humphrey Bogart": "Humphrey Bogart"
    },
    {
        " and ": null
    },
    {
        "Audrey Hepburn": "Audrey Hepburn"
    },
    {
        ".  He and Sullivan did a TV production of  State of the Union  for  Producers Showcase  directed by ": null
    },
    {
        "Arthur Penn": "Arthur Penn"
    },
    {
        ".     Cotten made  Special Delivery  in West Germany, did a TV adaptation of  Broadway  for  The Best of Broadway  directed by ": null
    },
    {
        "Franklin J. Schaffner": "Franklin J. Schaffner"
    },
    {
        ". He appeared in episodes of  Celebrity Playhouse ,  The Ford Television Theatre ,  Star Stage ,  Alfred Hitchcock Presents  and  General Electric Theater . Joseph Cotten Arrives in Germany for Role   Los Angeles Times 18 Nov 1954: 21.     In 1955 Cotten hosted The 20th Century Fox Hour on television.     In 1956, Cotten starred in the ": null
    },
    {
        "NBC": "Nbc"
    },
    {
        " anthology series On Trial  . It ran for 41 episodes. Joseph Cottens Toughest TV Role Is Playing a Guy Named Joseph Cotten   Thomas, Bob. Chicago Daily Tribune 19 May 1956: d5.     He returned to features with  The Bottom of the Bottle  ,  The Killer Is Loose  and  The Halliday Brand  .     He guest starred on  Jane Wyman Presents The Fireside Theatre ,  Telephone Time ,  Playhouse 90 ,  Schlitz Playhouse ,  Zane Grey Theater ,  Suspicion , and  Westinghouse Desilu Playhouse . He made a ": null
    },
    {
        "cameo": "Cameo Role"
    },
    {
        " appearance in Welless Touch of Evil  and a starring role in the film adaptation of ": null
    },
    {
        "Jules Vernes": "Jules Verne"
    },
    {
        "  From the Earth to the Moon  .     Cotten had another success on Broadway when he appeared in  Once More, With Feeling  which ran for 263 performances. Joseph Cotten Stars With Arlene Francis: Once More, With Feeling   By Edwin F. Melvin. The Christian Science Monitor8 Oct 1958: 7. For the third time Cotten was in a Broadway hit but did not reprise his role in the film version - ": null
    },
    {
        "Yul Brynner": "Yul Brynner"
    },
    {
        " did.          In 1960, Cotten married British actress ": null
    },
    {
        "Patricia Medina": "Patricia Medina"
    },
    {
        " after his first wife, Lenore Kipp, died of ": null
    },
    {
        "leukemia": "Leukemia"
    },
    {
        " earlier in the year. Joseph Cotten and Patricia Medina to Wed Hopper, Hedda. Los Angeles Times 8 Oct 1960: 4.     Cotten had a supporting role in the films  The Angel Wore Red  and  The Last Sunset  , the latter directed by ": null
    },
    {
        "Robert Aldrich": "Robert Aldrich"
    },
    {
        ", and guest starred on  The DuPont Show with June Allyson ,  Checkmate ,  The Barbara Stanwyck Show ,  Bus Stop ,  Theatre 62  ,  Dr. Kildare ,  Wagon Train , and  Saints and Sinners .     Cotten returned to Broadway to appear in Calculated Risk , which ran for 221 performances and meant he had to turn down a role in a film Harrigans Halo. Films, Stage Joust Over Joseph Cotten: Star Plans to Divide Time; Kruger Sets Lion and Lamb   Scott, John L. Los Angeles Times ; Los Angeles, Calif. 6 July 1962: C9.  He guest starred on  The Great Adventure , and  77 Sunset Strip , and did the pilot  Alexander the Great  . Joseph Cotten Starring   The Christian Science Monitor 20 June 1962: 6.     After some time away from film, Cotten returned in the ": null
    },
    {
        "horror": "Horror Films"
    },
    {
        " classic  Hush… Hush, Sweet Charlotte  for Aldrich, with ": null
    },
    {
        "Bette Davis": "Bette Davis"
    },
    {
        ", ": null
    },
    {
        "Olivia de Havilland": "Olivia De Havilland"
    },
    {
        " and ": null
    },
    {
        "Agnes Moorehead": "Agnes Moorehead"
    },
    {
        ".       Cotten was top billed in  The Great Sioux Massacre  and  The Tramplers  , but back to support parts for  The Money Trap  and  The Oscar  . He was top billed in  Brighty of the Grand Canyon  , directed by Foster,  The Cruel Ones  ,  Some May Live  and  Gangsters 70  . Joseph Cotten---Hell Gladly Meet Fame and Fortune Half Way   Alpert, Don. Los Angeles Times 13 June 1965: n4.     He guest starred on  Cimarron Strip ,  Ironside , and  Journey to the Unknown  and had a support role in  Jack of Diamonds  . He had the lead in  White Comanche  and  Latitude Zero  and supported in the TV movies  The Lonely Profession  ,  Cutters Trail  . TV Today:: Joseph Cottens Feet Arent Clay   Kramer, Carol. Chicago Tribune 13 Oct 1969: c15.       Cotten was in  The Name of the Game , It Takes a Thief,  NET Playhouse ,  The Grasshopper  ,  Tora! Tora! Tora! , The Virginian,  Assault on the Wayne  ,  Do You Take This Stranger?  ,  City Beneath the Sea  ,  The Abominable Dr. Phibes  ,  Lady Frankenstein  , and  The Screaming Woman  with de Havilland. Joseph Cotten: His Accents on Acting   Los Angeles Times 18 July 1968: f16.     He had lead roles in  Doomsday Voyage  ,  Baron Blood  , and  The Scopone Game  and was in  The Devils Daughter  , Joseph Cotten signs   Los Angeles Times 20 Oct 1972: d26.  The Streets of San Francisco ,  Soylent Green  ,  A Delicate Balance  ,  The Rockford Files ,  Syndicate Sadists  ,  The Timber Tramps  ,  The Lindbergh Kidnapping Case  ,  A Whisper in the Dark  ,  Origins of the Mafia  ,  Twilights Last Gleaming  for Aldrich,  Airport 77 ,  Aspen  ,  The Hardy Boys/Nancy Drew Mysteries ,  Last In, First Out  ,  Caravans  ,  Indagine su un delitto perfetto  ,  Screamers  ,  Concorde Affaire 79  ,  Guyana: Cult of the Damned  ,  Churchill and the Generals  ,  Tales of the Unexpected  and  Fantasy Island . Joseph Cotten to Guest in Hardy Boys   Los Angeles Times 31 Mar 1978: g19. Joseph Cotten Cast as Coin Collector   Los Angeles Times2 Oct 1972: d20.     I was in a lot of junk, he admitted later. I get nervous when I dont work.       Cottens final performances included  The Hearse  ,  Casino  ,  Heavens Gate  ,  The Love Boat  ,  The Survivor  , shot in Australia, and  Delusion  . Cotten suffered a stroke in 1981 which caused him to temporarily lose his voice.        On June 8, 1981, Cotten experienced a ": null
    },
    {
        "heart attack": "Heart Attack"
    },
    {
        " followed by a ": null
    },
    {
        "stroke": "Stroke"
    },
    {
        " that affected his ": null
    },
    {
        "brains speech center": "Language Processing In The Brain"
    },
    {
        ". He began years of therapy which in time made it possible for him to speak again. As he began to recover, he and Orson Welles talked on the phone each week for a couple of hours. He was strong and supportive, Cotten wrote, and whenever I used the wrong word he would say, Thats a much better word, Jo, Im going to use it. He and Welles would meet for lunch and reminisce, and when Cotten said he had written a book Welles asked for the manuscript and read it that same night.      In a phone conversation on October 9, 1985, Welles told his friend and mentor Roger Hill that Cotten had written a book, and Hill asked how it read. Gentle, witty, and self-effacing, just like Jo, Welles replied. My only complaint is that its too brief.  Welles died the following day. Somewhere among his possessions is a manuscript of this book, Cotten wrote on the last page of his autobiography, published in 1987 under the title Vanity Will Get You Somewhere.   Joseph Cotten, on the High Road: Fighting Back From a Stroke, the Actor Promotes a Gentle Memoir Actor Joseph Cotten   By Stephanie Mansfield Washington Post Staff Writer. The Washington Post 17 June 1987: B1.     In 1990, Cottens ": null
    },
    {
        "larynx": "Larynx"
    },
    {
        " was removed due to ": null
    },
    {
        "cancer": "Cancer"
    },
    {
        ".  He died on February 6, 1994, of ": null
    },
    {
        "pneumonia": "Pneumonia"
    },
    {
        ", at the age of 88.  He was buried at ": null
    },
    {
        "Blandford Cemetery": "Blandford Cemetery"
    },
    {
        " in ": null
    },
    {
        "Petersburg": "Petersburg, Virginia"
    },
    {
        ", ": null
    },
    {
        "Virginia": "Virginia"
    },
    {
        ".        At the ": null
    },
    {
        "10th Venice International Film Festival": "10Th Venice International Film Festival"
    },
    {
        ", Cotten was given the ": null
    },
    {
        "Volpi Cup for Best Actor": "Volpi Cup For Best Actor"
    },
    {
        " for his performance in the film  Portrait of Jennie  . He was also given a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "Hollywood Walk Of Fame"
    },
    {
        " in 1960.       Cotten was portrayed by ": null
    },
    {
        "Tim Robbins": "Tim Robbins"
    },
    {
        " in the 1985 TV film  Malice in Wonderland , ": null
    },
    {
        "James Tupper": "James Tupper"
    },
    {
        " in the film  Me and Orson Welles   and by ": null
    },
    {
        "Matthew Glave": "Matthew Glave"
    },
    {
        " in the television series  Feud  , which depicts the filming of  Whatever Happened to Baby Jane .                            :TV movies are listed in the film credits section.     ": null
    }
]