[
    {
        "           Jules Gabriel Verne  was a French novelist, poet, and playwright.     Vernes collaboration with the publisher ": null
    },
    {
        "Pierre-Jules Hetzel": "Pierre-Jules Hetzel"
    },
    {
        " led to the creation of the  Voyages extraordinaires , a widely popular series of scrupulously researched adventure novels including  Journey to the Center of the Earth  ,  Twenty Thousand Leagues Under the Sea  , and  Around the World in Eighty Days  .     Verne is generally considered a major literary author in France and most of Europe, where he has had a wide influence on the literary ": null
    },
    {
        "avant-garde": "Avant-Garde"
    },
    {
        " and on ": null
    },
    {
        "surrealism": "Surrealism"
    },
    {
        ". His reputation is markedly different in ": null
    },
    {
        "Anglophone regions": "English-Speaking World"
    },
    {
        ", where he has often been labeled a writer of ": null
    },
    {
        "genre fiction": "Genre Fiction"
    },
    {
        " or ": null
    },
    {
        "childrens books": "Childrens Books"
    },
    {
        ", largely because of the highly abridged and altered ": null
    },
    {
        "translations": "Jules Verneenglish Translations"
    },
    {
        " in which his novels have often been printed.     Verne has been the ": null
    },
    {
        "second most-translated author in the world": "List Of Most-Translated Individual Authors"
    },
    {
        " since 1979, ranking between ": null
    },
    {
        "Agatha Christie": "Agatha Christie"
    },
    {
        " and ": null
    },
    {
        "William Shakespeare": "William Shakespeare"
    },
    {
        ". He has sometimes been called the Father of Science Fiction , a title that has also been given to ": null
    },
    {
        "H. G. Wells": "H. G. Wells"
    },
    {
        ", ": null
    },
    {
        "Mary Shelley": "Mary Shelley"
    },
    {
        ", and ": null
    },
    {
        "Hugo Gernsback": "Hugo Gernsback"
    },
    {
        ".              Verne was born on 8 February 1828, on Île Feydeau, a small artificial island on the ": null
    },
    {
        "Loire River": "Loire River"
    },
    {
        " within the town of ": null
    },
    {
        "Nantes": "Nantes"
    },
    {
        ", in No. 4 Rue Olivier-de-Clisson, the house of his maternal grandmother Dame Sophie Allotte de la Fuÿe. His parents were Pierre Verne, an attorney originally from ": null
    },
    {
        "Provins": "Provins"
    },
    {
        ", and Sophie Allote de la Fuÿe, a Nantes woman from a local family of navigators and shipowners, of distant ": null
    },
    {
        "Scottish": "Scottish People"
    },
    {
        " descent. In 1829, the Verne family moved some hundred meters away to No. 2 Quai Jean-Bart, where Vernes brother Paul was born the same year. Three sisters, Anna , Mathilde , and Marie would follow.     In 1834, at the age of six, Verne was sent to boarding school at 5 Place du Bouffay in Nantes. The teacher, Mme Sambin, was the widow of a naval captain who had disappeared some 30 years before. Mme Sambin often told the students that her husband was a shipwrecked castaway and that he would eventually return like ": null
    },
    {
        "Robinson Crusoe": "Robinson Crusoe"
    },
    {
        " from his desert island paradise. The theme of the ": null
    },
    {
        "Robinsonade": "Robinsonade"
    },
    {
        " would stay with Verne throughout his life and appear in many of his novels, including  The Mysterious Island  ,  Second Fatherland  , and  The School for Robinsons  .     In 1836, Verne went on to École Saint‑Stanislas, a Catholic school suiting the pious religious tastes of his father. Verne quickly distinguished himself in mémoire , geography, Greek, Latin, and singing. In the same year, 1836, Pierre Verne bought a ": null
    },
    {
        "vacation house": "Vacation House"
    },
    {
        " at 29 Rue des Réformés in the village of Chantenay on the ": null
    },
    {
        "Loire River": "Loire River"
    },
    {
        ". In his brief memoir Souvenirs denfance et de jeunesse , Verne recalled a deep fascination with the river and with the many ": null
    },
    {
        "merchant vessels": "Merchant Vessel"
    },
    {
        " navigating it. He also took vacations at ": null
    },
    {
        "Brains": "Brains, Loire-Atlantique"
    },
    {
        ", in the house of his uncle Prudent Allotte, a retired shipowner, who had gone around the world and served as mayor of Brains from 1828 to 1837. Verne took joy in playing interminable rounds of the ": null
    },
    {
        "Game of the Goose": "Game Of The Goose"
    },
    {
        " with his uncle, and both the game and his uncles name would be memorialized in two late novels .     Legend has it that in 1839, at the age of 11, Verne secretly procured a spot as ": null
    },
    {
        "cabin boy": "Cabin Boy"
    },
    {
        " on the three-mast ship Coralie with the intention of traveling to the Indies and bringing back a coral necklace for his cousin Caroline. The evening the ship set out for the Indies, it stopped first at ": null
    },
    {
        "Paimboeuf": "Paimboeuf"
    },
    {
        " where Pierre Verne arrived just in time to catch his son and make him promise to travel only in his imagination . It is now known that the legend is an exaggerated tale invented by Vernes first biographer, his niece Marguerite Allotte de la Füye, though it may have been inspired by a real incident.      In 1840, the Vernes moved again to a large apartment at No. 6 Rue Jean-Jacques-Rousseau, where the familys youngest child, Marie, was born in 1842. In the same year Verne entered another religious school, the Petit Séminaire de Saint-Donatien, as a lay student. His unfinished novel Un prêtre en 1839 , written in his teens and the earliest of his prose works to survive, describes the seminary in disparaging terms. From 1844 to 1846, Verne and his brother were enrolled in the Lycée Royal in Nantes. After finishing classes in rhetoric and philosophy, he took the ": null
    },
    {
        "baccalauréat": "Baccalauréat"
    },
    {
        " at ": null
    },
    {
        "Rennes": "Rennes"
    },
    {
        " and received the grade Fairly good on 29 July 1846.     By 1847, when Verne was 19, he had taken seriously to writing long works in the style of ": null
    },
    {
        "Victor Hugo": "Victor Hugo"
    },
    {
        ", beginning Un prêtre en 1839 and seeing two verse tragedies, Alexandre VI and La Conspiration des poudres , to completion. However, his father took it for granted that Verne, being the firstborn son of the family, would not attempt to make money in literature but would instead inherit the family law practice.     In 1847, Vernes father sent him to Paris, primarily to begin his studies in ": null
    },
    {
        "law school": "Law School"
    },
    {
        ", and secondarily to distance him temporarily from Nantes. His cousin Caroline, with whom he was in love, was married on 27 April 1847, to Émile Dezaunay, a man of 40, with whom she would have five children.     After a short stay in Paris, where he passed first-year law exams, Verne returned to Nantes for his fathers help in preparing for the second year . While in Nantes, he met Rose Herminie Arnaud Grossetière, a young woman one year his senior, and fell intensely in love with her. He wrote and dedicated some 30 poems to her, including La Fille de lair , which describes her as blonde and enchanting / winged and transparent . His passion seems to have been reciprocated, at least for a short time, but Grossetières parents frowned upon the idea of their daughter marrying a young student of uncertain future. They married her instead to Armand Terrien de la Haye, a rich landowner 10 years her senior, on 19 July 1848.     The sudden marriage sent Verne into deep frustration. He wrote a hallucinatory letter to his mother, apparently composed in a state of half-drunkenness, in which under pretext of a dream he described his misery. This requited but aborted love affair seems to have permanently marked the author and his work, and his novels include a significant number of young women married against their will , to such an extent that the scholar Christian Chelebourg attributed the recurring theme to a Herminie complex . The incident also led Verne to bear a grudge against his birthplace and Nantes society, which he criticized in his poem La sixième ville de France .       In July 1848, Verne left Nantes again for Paris, where his father intended him to finish law studies and take up law as a profession. He obtained permission from his father to rent a furnished apartment at 24 Rue de lAncienne-Comédie, which he shared with Édouard Bonamy, another student of Nantes origin. ": null
    }
]