[
    {
        "        The Julian calendar, proposed by ": null
    },
    {
        "Julius Caesar": "Julius Caesar"
    },
    {
        " in 708": null
    },
    {
        "AUC": "Ab Urbe Condita"
    },
    {
        " , was a reform of the ": null
    },
    {
        "Roman calendar": "Roman Calendar"
    },
    {
        ". It took effect on , by edict. It was designed with the aid of ": null
    },
    {
        "Greek mathematicians": "Greek Mathematics"
    },
    {
        " and ": null
    },
    {
        "Greek astronomers": "Greek Astronomy"
    },
    {
        " such as ": null
    },
    {
        "Sosigenes of Alexandria": "Sosigenes Of Alexandria"
    },
    {
        ".     The calendar was the predominant calendar in the Roman world, most of Europe, and in European settlements in the Americas and elsewhere, until it was ": null
    },
    {
        "gradually replaced": "Adoption Of The Gregorian Calendar"
    },
    {
        " by the ": null
    },
    {
        "Gregorian calendar": "Gregorian Calendar"
    },
    {
        ", promulgated in 1582 by ": null
    },
    {
        "Pope Gregory XIII": "Pope Gregory Xiii"
    },
    {
        ". The Julian calendar is still used in parts of the ": null
    },
    {
        "Eastern Orthodox Church": "Eastern Orthodox Church"
    },
    {
        ", in parts of ": null
    },
    {
        "Oriental Orthodoxy": "Oriental Orthodoxy"
    },
    {
        " and ": null
    },
    {
        "Anabaptism": "Anabaptism"
    },
    {
        ", as well as by the ": null
    },
    {
        "Berbers": "Berbers"
    },
    {
        ".      During the 20th and 21st centuries, a date according to the Julian calendar is 13 days earlier than its corresponding Gregorian date.            History": null
    },
    {
        "intercalary month": "Intercalary Month"
    },
    {
        ", the ": null
    },
    {
        "Mensis Intercalaris": "Mercedonius"
    },
    {
        ", was sometimes inserted between February and March. This intercalary month was formed by inserting 22 or 23 days after the first 23 days of February; the last five days of February, which counted down toward the start of March, became the last five days of Intercalaris. The net effect was to add 22 or 23 days to the year, forming an intercalary year of 377 or 378 days. T H Key, A Dictionary of Greek and Roman Antiquities , London, 1875, available at . Some say the mensis intercalaris always had 27 days and began on either the first or the second day after the Terminalia . Blackburn, B & Holford-Strevens, L The Oxford Companion to the Year, Oxford University Press, 1999, reprinted with corrections, 2003, pp. 669–70.     According to the later writers ": null
    },
    {
        "Censorinus": "Censorinus"
    },
    {
        " and ": null
    },
    {
        "Macrobius": "Macrobius"
    },
    {
        ", the ideal intercalary cycle consisted of ordinary years of 355 days alternating with intercalary years, alternately 377 and 378 days long. In this system, the average Roman year would have had  days over four years, giving it an average drift of one day per year relative to any ": null
    },
    {
        "solstice": "Solstice"
    },
    {
        " or equinox. Macrobius describes a further refinement whereby, in one 8-year period within a 24-year cycle, there were only three intercalary years, each of 377 days . This refinement averages the length of the year to 365.25 days over 24 years.     In practice, intercalations did not occur systematically according to any of these ideal systems, but were determined by the ": null
    },
    {
        "pontifices": "Pontifex Maximus"
    },
    {
        ". So far as can be determined from the historical evidence, they were much less regular than these ideal schemes suggest. They usually occurred every second or third year, but were sometimes omitted for much longer, and occasionally occurred in two consecutive years.     If managed correctly this system could have allowed the Roman year to stay roughly aligned to a tropical year. However, since the pontifices were often politicians, and because a Roman magistrates term of ": null
    },
    {
        "office": "Official"
    },
    {
        " corresponded with a calendar year, this power was prone to abuse: a pontifex could lengthen a year in which he or one of his political allies was in office, or refuse to lengthen one in which his opponents were in power. Censorinus,      If too many intercalations were omitted, as happened after the ": null
    },
    {
        "Second Punic War": "Second Punic War"
    },
    {
        " and during the ": null
    },
    {
        "Civil Wars": "Roman Civil Wars"
    },
    {
        ", the calendar would drift out of alignment with the tropical year. Moreover, because intercalations were often determined quite late, the average Roman citizen often did not know the date, particularly if he were some distance from the city. For these reasons, the last years of the pre-Julian calendar were later known as years of confusion . The problems became particularly acute during the years of Julius Caesars pontificate before the reform, 63–46  BC, when there were only five intercalary months , none of which were during the five Roman years before 46  BC.     Caesars reform was intended to solve this problem permanently, by creating a calendar that remained aligned to the sun without any human intervention. This proved useful very soon after the new calendar came into effect. ": null
    },
    {
        "Varro": "Varro"
    },
    {
        " used it in 37  BC to fix calendar dates for the start of the four seasons, which would have been impossible only 8 years earlier. Varro,  A century later, when ": null
    },
    {
        "Pliny": "Pliny The Elder"
    },
    {
        " dated the ": null
    },
    {
        "winter solstice": "Winter Solstice"
    },
    {
        " to 25 December because the sun entered the 8th degree of Capricorn on that date, Pliny, Natural History:  this stability had become an ordinary fact of life.       Although the approximation of  days for the tropical year had been known for a long time  ancient ": null
    },
    {
        "solar calendars": "Solar Calendar"
    },
    {
        "had used less precise periods, resulting in gradual misalignment of the calendar with the seasons.     The ": null
    },
    {
        "octaeteris": "Octaeteris"
    },
    {
        ", a cycle of 8 lunar years popularised by ": null
    },
    {
        "Cleostratus": "Cleostratus"
    },
    {
        "  which was used in some early Greek calendars, notably in ": null
    },
    {
        "Athens": "Attic Calendar"
    },
    {
        ", is 1.53 days longer than eight Julian years. The length of nineteen years in the ": null
    },
    {
        "cycle of Meton": "Metonic Cycle"
    },
    {
        " was 6,940 days, six hours longer than the mean Julian year. The mean Julian year was the basis of the ": null
    },
    {
        "76-year cycle": "Callippic Cycle"
    },
    {
        " devised by ": null
    },
    {
        "Callippus": "Callippus"
    },
    {
        " to improve the Metonic cycle.     In Persia after the reform in the ": null
    },
    {
        "Persian calendar": "Iranian Calendarsold Persian Calendar"
    },
    {
        " by introduction of the Persian Zoroastrian calendar in 503  BC and afterwards, the first day of the year  slipped against the vernal equinox at the rate of approximately one day every four years. Hartner, Willy. The young Avestan and Babylonian calendars and the antecedents of precession. Journal for the History of Astronomy 10 : 1. pp.  1–22. ": null
    },
    {
        "doi:10.1177/002182867901000102": "Doi:10.1177/002182867901000102"
    },
    {
        " Stern, Sacha. Calendars in antiquity: Empires, states, and societies. Oxford University Press, 2012., p. 178.     Likewise in the ": null
    },
    {
        "Egyptian calendar": "Egyptian Calendar"
    },
    {
        ", a fixed year of 365 days was in use, drifting by one day against the sun in four years. An unsuccessful attempt to add an extra day every fourth year was made in 238  BC . Caesar probably experienced this wandering or vague calendar in that country. He landed in the Nile delta in October 48  BC and soon became embroiled in the Ptolemaic dynastic war, especially after ": null
    },
    {
        "Cleopatra": "Cleopatra Vii"
    },
    {
        " managed to be introduced to him in ": null
    },
    {
        "Alexandria": "Alexandria"
    },
    {
        ".     Caesar imposed a peace, and a banquet was held to celebrate the event. Lucan,  Pharsalia :  ": null
    },
    {
        "Lucan": "Lucan"
    },
    {
        " depicted Caesar talking to a wise man called ": null
    },
    {
        "Acoreus": "Acoreus"
    },
    {
        " during the feast, stating his intention to create a calendar more perfect than that of Eudoxus . Émile Biémont, Rythmes du temps, astronomie et calendriers, éd. De Boeck , 2000 , p. 224. But the war soon resumed and Caesar was attacked by the Egyptian army for several months until he achieved victory. He then enjoyed a long cruise on the Nile with Cleopatra before leaving the country in June 47  BC. Suetonius,      Caesar returned to Rome in 46  BC and, according to ": null
    },
    {
        "Plutarch": "Plutarch"
    },
    {
        ", called in the best philosophers and mathematicians of his time to solve the problem of the calendar. Plutarch, . Pliny says that Caesar was aided in his reform by the astronomer ": null
    },
    {
        "Sosigenes of Alexandria": "Sosigenes Of Alexandria"
    },
    {
        " Pliny, Natural History:  who is generally considered the principal designer of the reform. Sosigenes may also have been the author of the astronomical almanac published by Caesar to facilitate the reform. Encyclopædia Britannica . Eventually, it was decided to establish a calendar that would be a combination between the old Roman months, the fixed length of the Egyptian calendar, and the  days of the Greek astronomy. According to Macrobius, Caesar was assisted in this by a certain Marcus Flavius. Macrobius,  .          Caesars reform only applied to the ": null
    },
    {
        "Roman calendar": "Roman Calendar"
    },
    {
        ". However, in the following decades many of the local civic and provincial calendars of the empire and neighbouring client kingdoms were aligned to the Julian calendar by transforming them into calendars with years of 365 days with an extra day intercalated every four years. This section is based on S. Stern, Calendars in Antiquity pp. 259–297. The reformed calendars typically retained many features of the unreformed calendars. In many cases, the New Year was not on 1 January, the leap day was not on the bissextile day, the old month names were retained, the lengths of the reformed months did not match the lengths of Julian months, and, even if they did, their first days did not match the first day of the corresponding Julian month. Nevertheless, since the reformed calendars had fixed relationships to each other and to the Julian calendar, the process of converting dates between them became quite straightforward, through the use of conversion tables known as hemerologia. Studied in detail in W. Kubitschek, Die Kalendarbücher von Florenz, Rom und Leyden . Several of the reformed calendars are only known through surviving hemerologia.     The three most important of these calendars are the Alexandrian calendar, the Asian calendar and the Syro-Macedonian calendar. Other reformed calendars are known from Cappadocia, Cyprus and the cities of Syria and Palestine. Most reformed calendars were adopted under Augustus, though the calendar of ": null
    },
    {
        "Nabatea": "Nabatea"
    },
    {
        " was reformed after the kingdom became the Roman province of Arabia in AD 106. There is no evidence that local calendars were aligned to the Julian calendar in the western empire. Unreformed calendars continued to be used in ": null
    },
    {
        "Gaul": "Coligny Calendar"
    },
    {
        ", Greece, Macedon, the Balkans and parts of Palestine, most notably in Judea.     The Alexandrian calendar adapted the Egyptian calendar by adding a 6th epagomenal day as the last day of the year in every fourth year, falling on 29 August preceding a Julian bissextile day. It was otherwise identical to the Egyptian calendar. The first leap day was in 22  BC, and they occurred every four years from the beginning, even though Roman leap days occurred every three years at this time . This calendar influenced the structure of several other reformed calendars, such as those of the cities of Gaza and Ascalon in Palestine, Salamis in Cyprus, and the province of Arabia. It was adopted by the ": null
    },
    {
        "Coptic church": "Coptic Orthodox Church Of Alexandria"
    },
    {
        " and remains in use both as the liturgical calendar of the Coptic church and as the civil calendar of ": null
    },
    {
        "Ethiopia": "Ethiopia"
    },
    {
        ".     The Asian calendar was an adaptation of the ": null
    },
    {
        "Macedonian calendar": "Ancient Macedonian Calendar"
    },
    {
        " used in the province of Asia and, with minor variations, in nearby cities and provinces. It is known in detail through the survival of decrees promulgating it issued in 8 BC by the proconsul ": null
    },
    {
        "Paullus Fabius Maximus": "Paullus Fabius Maximus"
    },
    {
        ". It renamed the first month Dios as Kaisar, and arranged the months such that each month started on the ninth day before the kalends of the corresponding Roman month; thus the year began on 23 September, Augustus birthday. Since Greek months typically had 29 or 30 days, the extra day of 31-day months was named Sebaste—the emperors day—and was the first day of these months. The leap day was a second Sebaste day in the month of Xandikos, i.e., 24 February. This calendar remained in use at least until the middle of the fifth century AD.     The Syro-Macedonian calendar was an adaptation of the Macedonian calendar used in Antioch and other parts of Syria. The months were exactly aligned to the Julian calendar, but they retained their Macedonian names and the year began in Dios November until the fifth century, when the start of the year was moved to Gorpiaios September.     These reformed calendars generally remained in use until the fifth or sixth century. Around that time most of them were replaced as civil calendars by the Julian calendar, but with a year starting in September to reflect the year of the ": null
    },
    {
        "indiction": "Indiction"
    },
    {
        " cycle.     The Julian calendar spread beyond the borders of the Roman Empire through its use as the Christian liturgical calendar. When a people or a country was converted to Christianity, they generally also adopted the Christian calendar of the church responsible for conversion. Thus, Christian Nubia and Ethiopia adopted the Alexandrian calendar, while Christian Europe adopted the Julian calendar, in either the Catholic or Orthodox variant. Starting in the 16th century, European settlements in the Americas and elsewhere likewise inherited the Julian calendar of the mother country, until they adopted the Gregorian reform. The last country to adopt the Julian calendar was the Ottoman Empire, which used it for financial purposes for some time under the name ": null
    },
    {
        "Rumi calendar": "Rumi Calendar"
    },
    {
        " and dropped the escape years which tied it to Muslim chronology in 1840.           The first step of the reform was to realign the start of the calendar year to the tropical year by making 46  BC  445 days long, compensating for the intercalations which had been missed during Caesars pontificate. This year had already been extended from 355 to 378 days by the insertion of a regular ": null
    },
    {
        "intercalary month": "Intercalary Month"
    },
    {
        " in February. When Caesar decreed the reform, probably shortly after his return from the ": null
    },
    {
        "African campaign": "Battle Of Thapsus"
    },
    {
        " in late Quintilis , he added 67 more days by inserting two extraordinary intercalary months between November and December. It is not known why he decided that 67 was the correct number of days to add, nor whether he intended to align the calendar to a specific astronomical event such as the winter solstice. ": null
    },
    {
        "Ideler": "Ideler"
    },
    {
        " suggested  that he intended to align the winter solstice to a supposedly traditional date of 25 December. The number may compensate for three omitted intercalary months . It also made the distance from 1 March 46  BC, the original New Years Day in the Roman calendar, to 1 January 45  BC 365 days.     These months are called Intercalaris Prior and Intercalaris Posterior in letters of ": null
    },
    {
        "Cicero": "Cicero"
    },
    {
        " written at the time; there is no basis for the statement sometimes seen that they were called ": null
    },
    {
        "Undecimber": "Undecimber"
    },
    {
        " and ": null
    },
    {
        "Duodecimber": "Duodecember"
    },
    {
        " , terms that arose in the 18th century over a millennium after the Roman Empires collapse. E.g., ... we have a sidelight on what was involved in the year of confusion as it was called. According to Dion Cassius, the historian, there was a governor in Gaul who insisted that, in the lengthened year, two months extra taxes should be paid. The extra months were called Undecimber and Duodecimber. . The eponymous dating of the cited passage  shows that it actually refers to an event of 15  BC, not 46  BC. Their individual lengths are unknown, as is the position of the ": null
    },
    {
        "Nones": "Nones"
    },
    {
        " and ": null
    },
    {
        "Ides": "Ides"
    },
    {
        " within them. J. Rüpke, The Roman Calendar from Numa to Constantine: Time, History and the Fasti, 117f., suggests, based on the ritual structures of the calendar, that 5 days were added to November and that the two intercalary months each had 31 days, with Nones and Ides on the 7th and 15th.     Because 46  BC was the last of a series of irregular years, this extra-long year was, and is, referred to as the last year of confusion . The new calendar began operation after the realignment had been completed, in 45  BC. ": null
    },
    {
        "William Smith": "William Smith"
    },
    {
        ",  Dictionary of Greek and Roman Antiquities : LatinThe new moon was on 2 January 45  BC  at 00:21 UTC, according to ": null
    },
    {
        "IMCCE": "Institut De Mécanique Céleste Et De Calcul Des Éphémérides"
    },
    {
        "  .Augusti.e., non-leap yearSee ": null
    },
    {
        "Sacroboscos theory on month lengths ": "Sacroboscos Theory On Month Lengths"
    },
    {
        " for stories purporting otherwise.Latin27 April in the pre-Julian calendara.d. VIII Kal. Oct.a.d. IX Kal. Oct.F – see ": null
    },
    {
        "Roman calendar": "Roman Calendarcharacter Of The Day"
    },
    {
        "Latin": null
    },
    {
        "ri": "Ri"
    },
    {
        "the sixth doubled day before the Kalends of Marchand EnglishJCP 41 718–73323 Februarywhich would be 24 to 28 February in a common year and the 25th to 29th in a leap yearcalculators of Easter": null
    },
    {
        "man l": "Man L"
    },
    {
        "2004US magazine1919Augustand therefore inferior toJuly": null
    },
    {
        "lend": "Lend"
    },
    {
        "lend": "Lend"
    },
    {
        "on the 15th rather than 13thLatinLatinLatinLatinRome, 1963Latin": null
    },
    {
        "l": "L"
    },
    {
        "365.24217 days2013, p. 58715 May 2013Even then, the Gregorian calendar diverges from astronomical observations by one day in 3,030 years365.25 days365.2425 days13 March Gregorian13 March Gregoriani.e. on 29 February Julian or 14 March Gregorian23 FebruaryFebruary 42  BCFebruary 41  BC19611583Kal. Ian. AUC 709disregarding a momentary fiddling in December of 41 19942000as opposed to travellers from RomeGreekJuliani.e., five days before the end of FebruaryJulyAugustLatinJanuary to December1931January to December winter month 1997Anglo-Saxon hornung-sunu, Old Norse hornungr spring month , ": null
    },
    {
        "Lent": ":Wikt:Lent"
    },
    {
        " month  ": null
    },
    {
        "Easter": ":Wikt:Easter"
    },
    {
        " month  ": null
    },
    {
        "joy": ":Wikt:Appendix:Proto-Germanic/Wunjō"
    },
    {
        "-month , a corruption of Winnimanoth pasture-month  ": null
    },
    {
        "fallow": ":Wikt:Brache"
    },
    {
        "-month  hay month  ": null
    },
    {
        "reaping": ":Wikt:Earnian"
    },
    {
        " month  wood month  vintage month  harvest month  holy month see ": null
    },
    {
        "Roman calendar": "Roman Calendar"
    },
    {
        "so-called post-consular dating": null
    },
    {
        " Ro": "Ro"
    },
    {
        "AUC": null
    },
    {
        "ference da": "Ference Da"
    },
    {
        "Latin1943Munich, 1972Stuttgart, 1993after ": null
    },
    {
        "Diocletian": "Diocletian"
    },
    {
        "Oxford, 2008": null
    },
    {
        "ristiani": "Ristiani"
    },
    {
        "30 August after an Alexandrian leap yearAM 7000or an equivalent nameaffiliated with the ": null
    },
    {
        "Roman Catholic Church": "Roman Catholic Church"
    },
    {
        "in twelve columns containing 28 to 31 days eachthe Nativity of ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        "the ": null
    },
    {
        "Incarnation of Jesus": "Annunciation"
    },
    {
        "see the ": null
    },
    {
        "Liturgical year": "Liturgical Year"
    },
    {
        " article for more detailsapproximatelythe ": null
    },
    {
        "equinox": "Equinox"
    },
    {
        "1917866–871918See ": null
    },
    {
        "Calendar Act 1750": "Calendar  Act 1750"
    },
    {
        "a form which cannot easily be reproduced here in ASCII textFor more detail, see ": null
    },
    {
        "Dual dating": "Dual Dating"
    },
    {
        " for fiscal purposes25 Marchdenoting Old Style, Julian or New Style, Gregoriane.g., Spain, Portugal, Poland, most of Italyincluding the ": null
    },
    {
        "American colonies": "United States"
    },
    {
        "GregorianJulianJulianGregorianJulianGregorianJulianGregorian": null
    },
    {
        "astthe baptism of [[Jesus]] by [[John the Baptist]]6 Janua": "Astthe Baptism Of [[Jesus]] By [[John The Baptist]]6 Janua"
    },
    {
        "most of them in ": null
    },
    {
        "eastern": "Eastern Europe"
    },
    {
        " or ": null
    },
    {
        "southeastern Europe": "Southeastern Europe"
    },
    {
        "with the exception of the ": null
    },
    {
        "Estonian Orthodox Church": "Estonian Apostolic Orthodox Church"
    },
    {
        "   and the ": null
    },
    {
        "Finnish Orthodox Church": "Finnish Orthodox Church"
    },
    {
        "from 1924 to 2014; it is still permitted to use the Revised Julian calendar in parishes that want itin 1963although some OCA parishes are permitted to use the Julian calendarfrom 15 June 2014which is 7 January Gregorian until 2100": null
    },
    {
        "a": "A"
    },
    {
        "6 January": "January 6"
    },
    {
        " Julian/19 January Gregorian5–10 March": null
    },
    {
        "lid": "Lid"
    }
]