[
    {
        "     John Charles Julian Lennon is an English singer, musician and photographer, son of ": null
    },
    {
        "The Beatles": "The Beatles"
    },
    {
        " member ": null
    },
    {
        "John Lennon": "John Lennon"
    },
    {
        " and his first wife ": null
    },
    {
        "Cynthia": "Cynthia Lennon"
    },
    {
        ".     He was the direct inspiration for three Beatles songs: ": null
    },
    {
        "Lucy in the Sky with Diamonds": "Lucy In The Sky With Diamonds"
    },
    {
        " , ": null
    },
    {
        "Hey Jude": "Hey Jude"
    },
    {
        " , and ": null
    },
    {
        "Good Night": "Good Night"
    },
    {
        " . His parents divorced in 1968.     He is half-brother to ": null
    },
    {
        "Sean Lennon": "Sean Lennon"
    },
    {
        ". He has produced a number of albums starting with  Valotte  , as well as a documentary film WhaleDreamers on an environmental theme. Lennon has also held exhibitions of his photography.       Julian Lennon was born on 8 April 1963 in ": null
    },
    {
        "Liverpool": "Liverpool"
    },
    {
        ". He was named after his paternal grandmother, ": null
    },
    {
        "Julia Lennon": "Julia Lennon"
    },
    {
        ". ": null
    },
    {
        "The Beatles": "The Beatles"
    },
    {
        " manager, ": null
    },
    {
        "Brian Epstein": "Brian Epstein"
    },
    {
        ", was his godfather.     Lennon inspired one of his fathers most famous songs, ": null
    },
    {
        "Lucy in the Sky with Diamonds": "Lucy In The Sky With Diamonds"
    },
    {
        " , whose lyrics describe a picture the boy had drawn, a ": null
    },
    {
        "watercolor painting": "Watercolor Painting"
    },
    {
        " of his friend, Lucy ODonnell, from nursery school, surrounded by stars. Another composition of his father inspired by him was the lullaby ": null
    },
    {
        "Good Night": "Good Night"
    },
    {
        " , the closing song of  The Beatles  . In 1967, he attended the set of the Beatles film  Magical Mystery Tour .     When Julian was five years old in 1968, his parents divorced following his fathers infidelity with Japanese ": null
    },
    {
        "multimedia": "Multimedia"
    },
    {
        " artist ": null
    },
    {
        "Yoko Ono": "Yoko Ono"
    },
    {
        ".    John Lennon married Ono on 20 March 1969, and Julian has a younger half-brother, ": null
    },
    {
        "Sean Lennon": "Sean Lennon"
    },
    {
        ", and a stepsister, Kyoko Chan Cox.     ": null
    },
    {
        "Paul McCartney": "Paul Mccartney"
    },
    {
        " wrote ": null
    },
    {
        "Hey Jude": "Hey Jude"
    },
    {
        " to console him over the divorce; originally called Hey Jules , McCartney changed the name because he thought that Jude was an easier name to sing. ": null
    },
    {
        "Barry Miles": "Barry Miles"
    },
    {
        " . Paul McCartney: Many Years From Now. New York: Henry Holt & Company, 465. . After his parents divorce, Julian had almost no contact with his father until the early 1970s when, at the request of his fathers then short-term girlfriend, ": null
    },
    {
        "May Pang": "May Pang"
    },
    {
        " , he began to visit his father regularly. John Lennon bought him a ": null
    },
    {
        "Gibson Les Paul": "Gibson Les Paul"
    },
    {
        " guitar and a ": null
    },
    {
        "drum machine": "Drum Machine"
    },
    {
        " for Christmas 1973, and encouraged his interest in music by showing him some chords.  Lennon p345       Following ": null
    },
    {
        "his fathers murder": "Murder Of John Lennon"
    },
    {
        " on 8 December 1980, Julian Lennon voiced anger and resentment towards him, saying, Ive never really wanted to know the truth about how dad was with me. There was some very negative stuff talked about me ... like when he said Id come out of a whisky bottle on a Saturday night. Stuff like that.  You think, wheres the love in that? Paul and I used to hang about quite a bit ... more than Dad and I did. We had a great friendship going and there seems to be far more pictures of me and Paul playing together at that age than there are pictures of me and my dad.     Lennon chafed at hearing his fathers peace and love stance perpetually celebrated. He told the Daily Telegraph, I have to say that, from my point of view, I felt he was a hypocrite , he said, Dad could talk about peace and love out loud to the world but he could never show it to the people who supposedly meant the most to him: his wife and son. How can you talk about peace and love and have a family in bits and pieces—no communication, adultery, divorce? You cant do it, not if youre being true and honest with yourself.      Lennon was excluded from his fathers will. However, a trust of £100,000 was created by his father to be shared between Julian and his half brother ": null
    },
    {
        "Sean": "Sean Lennon"
    },
    {
        ".   Julian sued his fathers estate and in 1996 reached a settlement agreement reportedly worth £20 million.     By 2009, Lennons feelings toward his father had mellowed considerably. Recalling his renewed contact with his father in the mid-1970s, he said, Dad and I got on a great deal better then. We had a lot of fun, laughed a lot and had a great time in general when he was with ": null
    },
    {
        "May Pang": "May Pang"
    },
    {
        ". My memories of that time with Dad and May are very clear — they were the happiest time I can remember with him.        Lennon was educated at ": null
    },
    {
        "Ruthin School": "Ruthin School"
    },
    {
        ", a boarding ": null
    },
    {
        "independent school": "Independent School"
    },
    {
        " in the town of ": null
    },
    {
        "Ruthin": "Ruthin"
    },
    {
        " in ": null
    },
    {
        "Denbighshire": "Denbighshire"
    },
    {
        " in ": null
    },
    {
        "North Wales": "North Wales"
    },
    {
        ".                     Lennon made his musical debut at age 11 on his fathers album  Walls and Bridges  playing drums on Ya-Ya , later saying, Dad, had I known you were going to put it on the album, I wouldve played much better! Pang, Loving John, Warner, 1983 In the 1980s, according to ": null
    },
    {
        "AllMusic": "Allmusic"
    },
    {
        ", he parlayed a remarkable vocal similarity to his father into a successful singing career .      Lennon enjoyed immediate success with his debut album,  Valotte , released in 1984. Produced by ": null
    },
    {
        "Phil Ramone": "Phil Ramone"
    },
    {
        ", it spawned two top 10 hits, the title track and ": null
    },
    {
        "Too Late for Goodbyes": "Too Late For Goodbyes"
    },
    {
        " , and earned Lennon a nomination for the ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        " for Best New Artist in 1985. Music videos for the two hits were made by film director ": null
    },
    {
        "Sam Peckinpah": "Sam Peckinpah"
    },
    {
        " and producer ": null
    },
    {
        "Martin Lewis": "Martin Lewis"
    },
    {
        ". After the albums release, Paul McCartney sent Lennon a telegram wishing him good luck.      His second album, 1986s  The Secret Value of Daydreaming , was panned by critics. However, it reached number 32 on the ": null
    },
    {
        "Billboard 200": "Billboard 200"
    },
    {
        " chart, and produced the single Stick Around , which was Lennons first number 1 single on the US ": null
    },
    {
        "Album Rock Tracks": "Album Rock Tracks"
    },
    {
        " chart. He recorded the song Because , previously recorded by ": null
    },
    {
        "The Dave Clark Five": "The Dave Clark Five"
    },
    {
        ", in the UK for Clarks 1986 musical  Time .     On 1 April 1987, Julian Lennon appeared as the Baker in ": null
    },
    {
        "Mike Batts": "Mike Batt"
    },
    {
        " musical  The Hunting of the Snark  .  The ": null
    },
    {
        "all-star lineup": "The Hunting Of The Snark Original London Cast"
    },
    {
        " included ": null
    },
    {
        "Roger Daltrey": "Roger Daltrey"
    },
    {
        ", ": null
    },
    {
        "Justin Hayward": "Justin Hayward"
    },
    {
        " and ": null
    },
    {
        "Billy Connolly": "Billy Connolly"
    },
    {
        ", with ": null
    },
    {
        "John Hurt": "John Hurt"
    },
    {
        " as the narrator. The performance, a musical benefit at Londons ": null
    },
    {
        "Royal Albert Hall": "Royal Albert Hall"
    },
    {
        " in aid of the deaf, was attended by the ": null
    },
    {
        "Duchess of York": "Sarah, Duchess Of York"
    },
    {
        ".  Although Lennon never achieved the same level of success in the US as he had enjoyed with Valotte, his 1989 single Now Youre in Heaven peaked at number 5 in Australia and gave him his second number 1 hit on the Album Rock Tracks chart in the US.     In 1991, ": null
    },
    {
        "George Harrison": "George Harrison"
    },
    {
        " played guitar on Lennons album  Help Yourself , which included the single Saltwater although he was not directly credited. The single ": null
    },
    {
        "Saltwater": "Saltwater"
    },
    {
        " reached number 6 in the UK and topped the Australian singles charts for four weeks. During this time, Lennon contributed a cover of ": null
    },
    {
        "the Rolling Stones": "The Rolling Stones"
    },
    {
        " Ruby Tuesday": "Ruby Tuesday"
    },
    {
        " to the soundtrack of the television series  The Wonder Years .     Lennon left the music business for several years in the 1990s. He followed his interests in cooking, sailing and sculpting. After he began his performing career, there was occasionally unfounded media speculation that Lennon would undertake performances with McCartney, Harrison and ": null
    },
    {
        "Ringo Starr": "Ringo Starr"
    },
    {
        ". In the  Beatles Anthology  series in 1995, the three surviving Beatles confirmed there was never an idea of having Julian sit in for his father as part of a Beatles reunion, with McCartney saying, Why would we want to subject him to all of this?     In May 1998, Lennon released the album  Photograph Smile  to little commercial success. Music critic ": null
    },
    {
        "Stephen Thomas Erlewine": "Stephen Thomas Erlewine"
    },
    {
        " praised the album as well-crafted and melodic , and concluded by saying that it was the kind of music that would receive greater praise if it werent made by the son of a Beatle .  In 2002, he recorded a version of ": null
    },
    {
        "When Im Sixty-Four": "When Im Sixty-Four"
    },
    {
        " , from the Beatles  Sgt. Peppers Lonely Hearts Club Band  album, for an ": null
    },
    {
        "Allstate Insurance": "Allstate"
    },
    {
        " commercial.     In 2006 he ventured into Internet businesses, including MyStore.com with ": null
    },
    {
        "Todd Meagher": "Todd Meagher"
    },
    {
        " and Bebo founder ": null
    },
    {
        "Michael Birch": "Michael Birch"
    },
    {
        ".  In 2009 Lennon created a new partnership with Meagher and Birch called theRevolution, LLC. Through this company, Lennon released a tribute song and EP, Lucy , honouring the memory of Lucy Vodden , the little girl who inspired the song Lucy in the Sky with Diamonds , with 50 per cent of the proceeds going to fund ": null
    },
    {
        "Lupus": "Lupus"
    },
    {
        " research.          In October 2011, Lennon released the album  Everything Changes . In 2012 he worked with music film director ": null
    },
    {
        "Dick Carruthers": "Dick Carruthers"
    },
    {
        " on the feature-length video documentary Through the Picture Window, which followed Lennons journey in the making of Everything Changes and includes interviews with ": null
    },
    {
        "Steven Tyler": "Steven Tyler"
    },
    {
        ", ": null
    },
    {
        "Bono": "Bono"
    },
    {
        ", and Paul Buchanan from ": null
    },
    {
        "The Blue Nile": "The Blue Nile"
    },
    {
        ". Through the Picture Window was also released as an app in all formats with bespoke videos for all 14 tracks from the album.          Lennons first-ever tour in early 1985 was documented as part of the film Stand By Me: A Portrait Of Julian Lennon  — a film profile started by ": null
    },
    {
        "Sam Peckinpah": "Sam Peckinpah"
    },
    {
        ", but completed by ": null
    },
    {
        "Martin Lewis": "Martin Lewis"
    },
    {
        " after Peckinpahs death. Lennon has appeared in several other films including  The Rolling Stones Rock and Roll Circus  ,  Cannes Man  ,  Imagine: John Lennon  ,  Chuck Berry : Hail! Hail! Rock n Roll  , and a cameo in  Leaving Las Vegas  as a bartender. Julian provided the voice for the title role in the animated film  David Copperfield .  He was also the voice of the main character Toby the Teapot in the animated special The Real Story of Im a Little Teapot .     Lennon is also the producer of the documentary called WhaleDreamers  about an ": null
    },
    {
        "aboriginal": "Indigenous Australians"
    },
    {
        " tribe in Australia and its special relationship to whales. It also touches on many environmental issues. This film has received many awards  and was shown at the 2007 Cannes Film Festival.       After photographing his half-brother Seans music tour in 2007, Lennon took up a serious interest in photography.      On 17 September 2010,  Lennon opened an exhibition of 35 photographs called Timeless: The Photography of Julian Lennon with help from long-time friend and fellow photographer ": null
    },
    {
        "Timothy White": "Timothy White"
    },
    {
        ". Originally scheduled to run from 17 September to 10 October,  the Morrison Hotel Gallery extended it a week to end 17 October.  The photographs include shots of his brother Sean and U2 frontman ": null
    },
    {
        "Bono": "Bono"
    },
    {
        ".     Lennons Horizons series was featured at the Emmanuel Fremin Gallery, NYC, 12 March – 2 May 2015.        Shortly after the death of his father, Lennon began collecting Beatles memorabilia. In 2010, he published a book describing his collection, entitled: Beatles Memorabilia: The Julian Lennon Collection.         Lennon founded The White Feather Foundation in 2009. Its mission embraces environmental and humanitarian issues and in conjunction with partners from around the world helps to raise funds for the betterment of all life, and to honour those who have truly made a difference.  Its name came from a conversation Lennon once had with his father. Dad once said to me that should he pass away, if there was some way of letting me know he was going to be OK – that we were all going to be OK – the message would come to me in the form of a white feather. ... the white feather has always represented peace to me.              Lennon has been quoted as having a reasonably cordial relationship with Ono, while getting along very well with her son, his half-brother ": null
    },
    {
        "Sean": "Sean Lennon"
    },
    {
        ". Julian saw Sean perform live for the first time in Paris, on 12 November 2006 at La Boule Noire and he and Sean spent time together on Seans tour in 2007.      Julian has never married nor has children of his own, revealing that his difficult relationship with his famous father had discouraged him from doing so. He said that, unlike his father, he wanted to be mature enough to cope with fatherhood. “He was young and didn’t know what the hell he was doing, Julian said. Thats the reason I haven’t had children yet. I didn’t want to do the same thing. No, I’m not ready. I want to know who I am first.”      In commemoration of John Lennons 70th birthday and as a statement for peace, Lennon and his mother, Cynthia, unveiled the ": null
    },
    {
        "John Lennon Peace Monument": "John Lennon Peace Monument"
    },
    {
        " in his home town of Liverpool, on 9 October 2010.      Lennon remains friends with his fathers former bandmate, Paul McCartney, though they experienced a public falling out in 2011 when Lennon was not invited to McCartneys wedding to ": null
    },
    {
        "Nancy Shevell": "Nancy Shevell"
    },
    {
        ".               Source:       Dave Clarks Time: Original Soundtrack     Mike Batts The Hunting of the Snark  ; vocals on song Midnight Smoke    Hail! Hail! Rock n Roll  ; vocals on song Johnny B. Goode    The Wonder Years: Music From the Emmy Award-Winning Show & Its Era  ; vocals on song Ruby Tuesday   Toy Matinee|Toy Matinee ; vocals on songs Turn It On Salvador and Things She Said   ": null
    },
    {
        "Mr. Hollands Opus – Soundtrack": "Mr. Hollands Opussoundtrack Releases"
    },
    {
        " ; co-wrote and vocals on Coles Song   Lennon... and Proud of It – A Conversation with Julian Lennon   ": null
    },
    {
        "Hisss": "Hisss"
    },
    {
        " - co-wrote and vocals on song Sway   ": null
    },
    {
        "Shine On! Songs Volume One": "Sosv1"
    },
    {
        " ": null
    }
]