[
    {
        "     The Kipsigis  are a ": null
    },
    {
        "Nilotic": "Nilotic"
    },
    {
        " people living predominantly in ": null
    },
    {
        "Bomet": "Bomet"
    },
    {
        ", ": null
    },
    {
        "Kericho": "Kericho"
    },
    {
        ", ": null
    },
    {
        "Narok": "Narok"
    },
    {
        ", ": null
    },
    {
        "Nakuru": "Nakuru"
    },
    {
        " and ": null
    },
    {
        "Laikipia": "Laikipia"
    },
    {
        " counties of Kenya. Some also live in ": null
    },
    {
        "Angata-Baragoi": "Angata-Baragoi"
    },
    {
        " and ": null
    },
    {
        "Northern Tanzania": "Northern Tanzania"
    },
    {
        ". Alongside other Southeastern Nilotes, the Kipsigis make up a group colloquially and academically referred to as  Kalenjin  which can be translated to mean I tell you. In mid 19 th century AD, the Kipsigis were known to have been called ": null
    },
    {
        "Lumbwa": "Lumbwa People"
    },
    {
        " which they shared with ": null
    },
    {
        "Lloikop people": "Loikop People"
    },
    {
        " , ": null
    },
    {
        "Yaaku people": "Yaaku People"
    },
    {
        ", ": null
    },
    {
        "Okiek": "Okiek People"
    },
    {
        ", ": null
    },
    {
        "Doko": "Doko People"
    },
    {
        " and ": null
    },
    {
        "Agumaba people": "Agumba People"
    },
    {
        "  but by 20th century, it clearly was the term used to identify the Kipsigis but with also a connotation to identify the Wakuavi Maasai of Tanzania.     Other names include: ": null
    },
    {
        "Kipsikis": "Kipsikis"
    },
    {
        ", ": null
    },
    {
        "Ilparakuyo": "Ilparakuyo"
    },
    {
        ", ": null
    },
    {
        "Baraguyu": "Baraguyu Language"
    },
    {
        ", ": null
    },
    {
        "Kwavi": "Kwavi People"
    },
    {
        ", ": null
    },
    {
        "Lumbwa": "Lumbwa People"
    },
    {
        " or ": null
    },
    {
        "Iloikop": "Iloikop Wars"
    },
    {
        ".     Their ": null
    },
    {
        "first language": "First Language"
    },
    {
        " is ": null
    },
    {
        "Kipsigis": "Kipsigis Language"
    },
    {
        ", which belongs to the ": null
    },
    {
        "Nilo-Saharan": "Nilo-Saharan Languages"
    },
    {
        " language family; their second language is mostly Swahili and English. Like many other Nilotes, Kipsigis have challenges with spoken and written languages and thus in the Kenyan pop culture, they are often attributed to an annoying or funny accent when speaking the second languages.   The Kipsigis are ": null
    },
    {
        "monotheistic": "Monotheism"
    },
    {
        " which made it easier for them to convert to Christianity. The traditional occupation of the Kipsigis is ": null
    },
    {
        "herding": "Herding"
    },
    {
        ". In pre-colonial Kipsigis society, there was a warrior element. Living on the Western Highlands at an altitude of 1500 to 2000m, the Kipsigis now also grow maize, wheat, ": null
    },
    {
        "pyrethrum": "Pyrethrum"
    },
    {
        " and tea.           The name Kipsigis seems to be owned by the Kipsigis people in a legend where they describe a dispute among the immediate families who they say immigrated them into Kenyan Rift Valley highlands. In this legend, the disputes led to dispersion where Keiyo may have delegated themselves a duty to milk cattle, Tugen to shelter away, Nandi at that time referred to as Chepngal which can mean those who say a lot and Kipsigis implying they put more importance in fertility and repopulation.   The name Kipsigis can be translated as prolific or the ones who bear many chilren where Kip is the masculine name prefix and sigis implying the process of giving birth.     According to the Swahili traders and alien visitors, the Kipsigis would have seemed as part of the Nandi as were all the other Kalenjin tribes and in this accord, Kalenjin was referred to as Nandi-Speaking communities. Apparently, the Kipsigis were recorded to be called ": null
    },
    {
        "Lumbwa": "Lumbwa People"
    },
    {
        " by legends from Meru community and by the British.           The origin of the Kipsigis is compact with the origin of other Southeastern Nilotes. From archeological and linquistic studies, their origin is in Eastern Sudan with scientific evidence dating to 6000BCE.   The earliest area in the ": null
    },
    {
        "Great Lakes region": "Great Lakes Region"
    },
    {
        " that is recognized as inhabited by the Southern Nilotic speakers lies in the present day Jie and Dodoth country in Uganda. In oral culture among the Kalenjin, they identify their origin to be Mount Elgon and so do the Kipsigis.     The Kipsigis was initially a single group and identity with the Nandi until 1800 when the Nandi community was separated by a wedge of Uasin Ngishu Maasai in Kipchorian River ; the resulting community in Nyando became Kipsgis.     The Kipsigis valued songs more than story telling as it was an easy medium to communicate and preserve history. There are two interesting and confusing songs:   Kichome echek tulwenyon, tulwet-aap Araran/Ararat: We love, us, our mountain, mount Ararat/Araran.   Ndamo riret ab Musa; to maki-sobje: Were it not for Musas sea, we wouldnt have been saved.     These two offer a glimpse of an early origin of the Kalenjin in general but it has not been understood as to what timeline the activities in the songs took place. It has been understood colloquially to the events of Noahs flooding and Moses passage through the Red sea. It also unclear how these songs got passed to the Kipsigis or if it had meaning to Kalenjin as a whole.     The arrival of the Southern Nilotes on the East African archaeological scene is correlated with the appearance of the prehistoric lithic industry and pottery tradition referred to as the Elmenteitan culture. The bearers of the Elmenteitan culture developed a distinct pattern of land use, hunting and pastoralism on the western plains of Kenya during the East African Pastoral Neolithic. Its earliest recorded appearance dates to the ninth century BC .   It is thought that around the fifth and sixth centuries BC, the speakers of the Southern Nilotic languages split into two major divisions - the proto-Kalenjin and the proto-Datooga. The former took shape among those residing to the north of the Mau range while the latter took shape among sections that moved into the Mara and Loita plains south of the western highlands.   While few large-scale excavations have been done on sites outside the Central Rift, regional surveys indicate that the population was far denser in the southern highlands during this time.   The Datooga were specialized pastoralists on considerable scale, spreading their settlements westward after 400BC across the Mara plains and as far as southeastern Lake Nyanza. Their presence on the Mara and Loita plains would continue through to the seventeenth century AD when they were driven south by the Maasai during the Il-Tatua wars. Archaeological and linguistic evidence point to significant differences in ways of life between the Elmenteitan culture and the Savanna Pastoral Neolithic cultures that had preceded them in Kenya.     EMet ab KipsigisTulwab Kipsigis meaning Mount Kipsigis which is located in ": null
    },
    {
        "Londiani Junction": "Londiani Junction"
    },
    {
        " in ": null
    },
    {
        "Kericho": "Kericho"
    },
    {
        ". The hill has had other names in the past including: Tulwab Monyis meaning the mountain of the penis and Tulwab Lagok or Tulawab Ngetik meaning The Mount of Children or The Mount of Uncircumcised Boys, respectively.     Whilst academia and archaeology find the Sirikwa as a pastoral neolithic period of the Kalenjin, among the Kipsigis, they mention living with a group of people they refer as ": null
    },
    {
        "Sirikwa": "Sirikwa"
    },
    {
        ". The Sirkwa are said to have dug up circular parameters where they kept their cattle and made huts on top of the parameters. It is also said that the Sirikwa had a thing about red ants, their appearance made them migrate as it was a bad omen for them. It is also told that the Sirikwa migrated Southward toward Tanzania. The ": null
    },
    {
        "Iraqw": "Iraqw People"
    },
    {
        " of ": null
    },
    {
        "Tanzania": "Tanzania"
    },
    {
        " actually do confirm to be the ": null
    },
    {
        "Sirikwa": "Sirikwa Culture"
    },
    {
        " who interacted with the ": null
    },
    {
        "Kalenjin": "Kalenjin People"
    },
    {
        " before migrating to Tanzania. The ": null
    },
    {
        "Sirgoik clan": "Sirgoik Clan"
    },
    {
        " of the Kipsigis are thought to be adopted group of ": null
    },
    {
        "Iraqw": "Iraqw People"
    },
    {
        " families.     Archaeological and linguistic research indicate that the Kipsigis may have occupied a region extending from Nandi hills eastwards toward Mount Kenya and a southern projection to much of Maasai land. This is founded in a legend by the Meru community of Kenya where they claim their ancestors interacted with a group of people they referred to as ": null
    },
    {
        "Lumbwa": "Lumbwa"
    },
    {
        ". The reduction of the area occupied by the Kipsigis can be attributed to the rise of the Maasai community which cut them off from mount Kenya all the way to Laikipia.         The Kipsigis are a very religious group of people. They were monotheistic before the advent of conversion to Christianity. Theism was accompanied with no need for proof. Their God is known as Asis which can be derived from the word- Asista meaning the sun. Previous translations state that Asis means the darlzing one but to darzle is coined by the term lili.   Asis has nine attributes/names including:     1. Asis - Sunny     This is the common name for the Kalenjins deity.     2. Cheptalel - She who can be white     Thought of God with human nature. This attribute is coined by a legend which includes the sacrificing of girl which resulted in answer of rain after a severe drought. Cheptalel is the protagonist in the legend.     3. Chepopkooiyo - She from halo     Kooiyo is derived from halo usually around the sun on a humid day. A halo around the sun was an important omen among the Kalenjin during war. By observing appearance of a halo before going to war, the Kalenjin would decided whether to go or not go to war. Chepopkooiyo thus implies the God of war.     4. Chepomirchiio - she who leads war     It literally means the one who leads wars, or the god of hosts. He/she protects and leads armies.     5. Chepkeelyen Sogool - she with nine legs     Nine is devine to the Kalenjin, it symbolizes infinity. It also has a meaning of nine rays of the sun as it rises which relates to a Maasai attribute of god called Isyet with the same meaning.     6. Chemalus - She who never looses/she who is wise     It can literally mean she who has a high intelligent quotient, never loses a riddle, always correct, never defeated. He/she is invoked in legal proceeds.     7. Chebokimabai - She who dries millet     This attribute invokes a prayer for warm and sunny climate to dry harvest of millet.     8. Weerit Neoo - The eldest son Cheboo - She who is big/large Chepkochor - She who rises  Tororot - The lifted, the promoted. Kaapkoros - Shrine   This was the common places of worship among the Kipsigis. The currently known and remembered shrines include: Kapkoros in Bomet, Kapkoros in Chepkechei, Tulwab Kipsgis  and Tulwab Bureti.   Mabwaita - family alter   This was a household family alter positioned to the east of the house as one exited through the main door . It was continuously maintained and replenished by the initiated members of the household in a process called Kisoop mabwaiita- to heal/ give life to the alter. It is an erected structure composing of branches and vines of trees of sacred importance and purpose to the Kipsigis.   Sach-Ooran- Crossroads       They were men from specific clans who did not partake of war. They prayed for the community and lead the processions of the harvest ceremonies.     Women were seen as acceptable beings to god as they bore no or less sins compared to men and thus, they believed a prayer by a woman would be granted effectively compared to a prayer by a man. This was the reason why women were the ones who prayed for their families in their homestead alter. The Kipsigis women were also rain-makers and rain chasers. they would practice a communal prayer in a river while naked and this would paranormally bring or avert rain.       The Kipsigis have a circular view of life. They were a superstitious as well as spiritual community. They considered all life as sacred. They believed that the natural world is all connected and that a good deed never goes unnoticed. Similarly bad deeds lead to consequences in various forms. This view ensures that all members of the community act in a morally upright manner.     1. :Agenge: It has no significance     2. : Aeng : It is a good number. It symbolizes marriage and is a reciprocal/multiple to the masculine number .     3. :Somok: It is a feminine number and a feminine symbol. It was also the maximum number of acquital for offences, the fourth resulted in death by execution.     4. : Angwan: Four is a masculine and military number.     5. : Muut: It is associated with biology and physiology i.e, five fingers on hands and feet.     6. : Lo: It is a neutral number     7. : Tisaap: It is associated with the seven age sets.     8. : Sisit: It has no significance     9. : Sogool: It is a divine number. It is also a complete number     10. : Taman: It is not significant as it is a round off figure i.e 9+1     Kiptaman ak Sogol literally means ten and nine but it means a thousand and one times ; Although Bogol means and equals a hundred, Bogolai means or implies Thanks a million.     The Kipsigis would tell their location in respect to the rising place of the sun and plotting the four cardinal points descriptively by their position in relation to the east. The Kipsigis are also said to have been able the navigate at night by plotting the appearance of various constellations of the stars.     Kongasiis ak Cherongo   Murot Tai ak Murot Katam       The Kipsigis made provisions for habitation in regard and respect of the availability of grazing land, the size of cattle, the size and type of family. Houses were primary grass-thatched huts usually clustered together. There would also be a bomet in which the cattle slept.       A male was given four set of names. First two after birth: the first based on time, place or weather of the time of birth, usually proceeded by a Kip prefix; and a second being an attribute of a reincarnated ancestor. A third name was a borrowed name from a local hero. A fourth name was given to males after initiation which is based on the first name of the father where if the father was Kiprotich, the son would be called Arap Rotich. Naming of the females followed a similar process.          The Kipsigis had a relaxed attitude to dress codes for children and thus tribal nudism among the uncircumcised youth was common. An initiated Kipsigis, especially a woman had very strict code of dressing that where right from neck down to the knee had to be clothed. Men however were supposed to wear a garment that would conceal their groin and butts. Both men and women would adorn themselves earrings, necklaces, bangles and bells. ": null
    },
    {
        "Shukas": "Kanga"
    },
    {
        " for men started becoming a common item of attire for men replacing the hides when the missionaries arrived in Kipsigis land         MenjoChoret -stealingKitunji Tolochjust completed initiationKabwatereretratetMuseetwho may have traveled or was in waras proxywhich translates to marriage for might                                               The Segit or totem is Ngokto  Kaptebeswet in Belgut/Ainamoi, Fort-Ternan a smaller clan       in Bomet County: Motigo, Cheptagum, Kipkeigei, Kapsabul, Tarakwa, Singorwet, Kapkoros, Chemaner, Tegat, Sotik, Silibwet Olbutyo, Chebunyo, Nyambugo, Kipreres and others in Kericho, Nandi, Narok, and Nakuru Counties and even in Tanzania and some in South Sudantotem is Kimaketiet , concentrated in Belgut Kericho, originated from NandiCrested Cranein Bomet, Nakuru, Narok and Kericho Counties: Chemaner, Tegat, Singorwet, Gelegele, Chebole, Kapkimolwa, Sigor, Kipreres, Chelemei, Sogoo, Koiwa, Kirenget, Olengurone, Mauche, Njoro, Dikirr and Loliondo in TanzaniaKericho, Kipkelion, Londiani, Bureti, Bomet found in Roret, kapkatet, kapkelek, Kabartegan, chemist, chemoiwa, sondu and nandi chepkumnyat found in kericho, bureti, bomet and rongai   oondo in Kipsigisreferred to in Kipsigis as Kosibonarmy/legionYotiik, Seegeik and SogooldaiikKiptayat/KiptaiinikNganymetyeet, Pirtiich, Oldimdo/Lumweet and KipeelbanyngamotikLogeetBobeekKulumbenikKuumiikespecially the hunting partespecially the gathering part": null
    },
    {
        "09147816146": "09147816146"
    },
    {
        "Mee Kipsigis ne-ki mee tereet, ko me Nandi ne-ki mee Sotet: May the Kipsigiss die the manner of broken pot and may the Nandi die the manner of a broken calabashBritishHis protagonistic role in this agreement has been argued by some Kipsigis that it was because his origin is among tha Abagusii people- his clan is Zoigoek meaning they were adopted from Abagusiicurrently Sotik and Chepalungu constituenciesprobably because he was a member of ": null
    },
    {
        "Talaai clan": "Talaai Clan"
    },
    {
        " and the shift of boundary would alter his clans legacydeceased, alive, retired and active         North, West and Central portions of Kericho countySouth portions of Kericho county, Sotik constituency and Dikiir ConstituencyChepalungu, Bomet Central and Bomet East": null
    },
    {
        "lecommunicati": "Lecommunicati"
    }
]