[
    {
        "        A knout  is a heavy ": null
    },
    {
        "scourge": "Scourge"
    },
    {
        "-like multiple ": null
    },
    {
        "whip": "Whip"
    },
    {
        ", usually made of a bunch of ": null
    },
    {
        "rawhide": "Rawhide"
    },
    {
        " thongs attached to a long handle, sometimes with metal wire or hooks incorporated. The English word stems from a spelling-pronunciation of a French transliteration of the Russian word кнут , which simply means whip .          Some claim it was a ": null
    },
    {
        "Tatar": "Tatars"
    },
    {
        " invention and was introduced into Russia in the 15th century, perhaps by Grand Duke ": null
    },
    {
        "Ivan III the Great": "Ivan Iii Of Russia"
    },
    {
        " . Others trace the word to ": null
    },
    {
        "Varangians": "Varangian"
    },
    {
        " and derive it from the ": null
    },
    {
        "Swedish": "Swedish Language"
    },
    {
        " knutpiska, a kind of whip with knots. Still others maintain it is of generic ": null
    },
    {
        "Germanic": "Germanic Languages"
    },
    {
        " origin, not necessarily Scandinavian, comparing it with the German Knute, Dutch knoet and with Old Norse knutr, Anglo-Saxon cnotta and English knot.     The Russian knout had different forms. One was a lash of rawhide,  long, attached to a wooden handle,  long. The lash ended in a metal ring, to which was attached a second lash as long, ending also in a ring, to which in turn was attached a few inches of hard leather ending in a beak-like hook. Another kind consisted of many thongs of skin plaited and interwoven with wire, ending in loose wired ends, like the ": null
    },
    {
        "cat-o-nine tails": "Cat-O-Nine Tails"
    },
    {
        ".          A variation, known as the great knout, consisted of a handle about  long, to which was fastened a flat leather thong about twice the length of the handle, terminating with a large copper or brass ring to which was affixed a strip of hide about  broad at the ring, and terminating at the end of  in a point. This was soaked in milk and dried in the sun to make it harder.     Knouts were used in Russia for flogging as formal ": null
    },
    {
        "corporal punishment": "Judicial Corporal Punishment"
    },
    {
        " of criminals and political offenders. The victim was tied to a post or on a triangle of wood and stripped, receiving the specified number of strokes on the back. A sentence of 100 or 120 lashes was equivalent to a death sentence. Even twenty lashes could maim, and with the specially extended Great Knout, twenty blows could kill, with death sometimes being attributed to the breaking of the spine.     The executioner was usually a criminal who had to pass through a probation and regular training, being let off his own penalties in return for his services. ": null
    },
    {
        "Peter the Great": "Peter The Great"
    },
    {
        " is traditionally accused of knouting his son ": null
    },
    {
        "Alexis": "Alexei Petrovich"
    },
    {
        " to death; the latter was tortured by knouting to extract confessions.     Emperor ": null
    },
    {
        "Nicholas I": "Nicholas I Of Russia"
    },
    {
        " abolished the punishment by knout in 1845, and replaced it with the pleti, ": null
    },
    {
        "lashes": "Flagellation"
    },
    {
        " with three thongs which could end in lead balls. They were later abolished throughout Russia and reserved for the penal settlements, mainly in Siberia. Prisoners transported to Siberia in the late 19th century were sometimes branded on their foreheads with irons with the letters VRNK meaning V thief, R robber, and NK punished by the knout. This branding led to the Siberian slang word varnok , meaning either a settler or deportee.        The dreaded instrument became synonymous in Western European languages with what was seen as the tyrannical cruelty of the autocratic government of Russia, much as the  sjambok  brought to mind the ": null
    },
    {
        "apartheid": "Apartheid"
    },
    {
        " government of South Africa or the ": null
    },
    {
        "bullwhip": "Bullwhip"
    },
    {
        " was associated with the period of ": null
    },
    {
        "slavery": "Slavery"
    },
    {
        " and ": null
    },
    {
        "Jim Crow laws": "Jim Crow Laws"
    },
    {
        " in America.     The expression under the knout is used to designate any harsh ": null
    },
    {
        "totalitarianism": "Totalitarianism"
    },
    {
        ", and by extension its equivalent in a private context, e.g., a grim patriarch ruling his household with an iron rod . In Dutch, onder de knoet houden is commonly used for strict party discipline, e.g., eliminating actual debate when passing a law ": null
    }
]