[
    {
        "               or more specifically jinli or , are colored varieties of the Amur carp  that are kept for decorative purposes in outdoor ": null
    },
    {
        "koi ponds": "Koi Pond"
    },
    {
        " or ": null
    },
    {
        "water gardens": "Water Garden"
    },
    {
        ".     Koi is an informal group name of the colored variants of C. rubrofuscus. Several varieties are recognized by the Japanese. Koi varieties are distinguished by coloration, patterning, and scalation. Some of the major colors are white, black, red, orange, yellow, blue, and cream. The most popular category of koi is the Gosanke, which is made up of the ": null
    },
    {
        "Kohaku": "Kohaku"
    },
    {
        ", Taisho Sanshoku, and Showa Sanshoku varieties.       ": null
    },
    {
        "Carp": "Carp"
    },
    {
        " are a large group of fish originally found in ": null
    },
    {
        "Central Europe": "Central Europe"
    },
    {
        " and ": null
    },
    {
        "Asia": "Asia"
    },
    {
        ". ": null
    },
    {
        "Various carp species": "Asian Carp"
    },
    {
        " were originally ": null
    },
    {
        "domesticated": "Domestication"
    },
    {
        " in ": null
    },
    {
        "East Asia": "East Asia"
    },
    {
        ", where they were used as food fish. Carp are ": null
    },
    {
        "coldwater fish": "Coldwater Fish"
    },
    {
        ", and their ability to survive and adapt to many climates and water conditions allowed the domesticated species to be propagated to many new locations, including Japan. Natural color mutations of these carp would have occurred across all populations. Carp were first bred for color mutations in ": null
    },
    {
        "China": "China"
    },
    {
        " more than a thousand years ago, where ": null
    },
    {
        "selective breeding": "Selective Breeding"
    },
    {
        " of the ": null
    },
    {
        "Prussian carp": "Prussian Carp"
    },
    {
        "  led to the development of the ": null
    },
    {
        "goldfish": "Goldfish"
    },
    {
        " .      The Amur carp , a member of the cyprinid family ": null
    },
    {
        "species complex": "Species Complex"
    },
    {
        " native to ": null
    },
    {
        "East Asia": "East Asia"
    },
    {
        ", was ": null
    },
    {
        "aquaculture": "Aquaculture"
    },
    {
        "d as a food fish at least as long ago as the fifth century BC in China, and ": null
    },
    {
        "Jin Dynasty": "Jin Dynasty"
    },
    {
        " texts mentioned carp with various colors.   The Amur carp was previously recognized as a subspecies of the common carp , but recent authorities treat it as a separate species under the name C. rubrofuscus.     Amur carp were first bred for color in Japan in the 1820s, in the town of ": null
    },
    {
        "Ojiya": "Ojiya,Niigata"
    },
    {
        " in the ": null
    },
    {
        "Niigata Prefecture": "Niigata Prefecture"
    },
    {
        " on the northeastern coast of ": null
    },
    {
        "Honshu": "Honshu"
    },
    {
        " Island. The outside world was unaware of the development of color variations in Japanese koi until 1914, when the Niigata koi were exhibited at an annual exposition in ": null
    },
    {
        "Tokyo": "Tokyo"
    },
    {
        ". From that time, interest in koi spread throughout Japan. From this original handful of koi, all other Nishikigoi varieties were bred, with the exception of the Ogon variety , which was developed relatively recently.     The hobby of keeping koi eventually spread worldwide. They are sold in many pet aquarium shops, with higher-quality fish available from specialist dealers.   Collecting koi has become a social hobby. Passionate hobbyists join clubs, share their knowledge and help each other with their koi.        The words koi and nishikigoi come from the ": null
    },
    {
        "Japanese": "Japanese Language"
    },
    {
        " reading of Classical Chinese words 鯉 and 錦鯉 respectively. In both languages, the former can refer to many ": null
    },
    {
        "Asian carp": "Asian Carp"
    },
    {
        " species. In Japanese, koi is a ": null
    },
    {
        "homophone": "Homophone"
    },
    {
        " for another word that means affection or love , so koi are symbols of love and friendship in Japan. The first mention of the word 錦鯉 dates back to Tang Dynasty China:        In the past, koi were commonly believed to have been bred from the ": null
    },
    {
        "common carp": "Common Carp"
    },
    {
        " . Extensive ": null
    },
    {
        "hybridization": "Hybrid"
    },
    {
        " between different populations, coupled with widespread translocations, have muddled the historical ": null
    },
    {
        "zoogeography": "Zoogeography"
    },
    {
        " of the common carp and ": null
    },
    {
        "its relatives": "Cyprinus"
    },
    {
        ". Traditionally, ": null
    },
    {
        "Amur carp": "Cyprinus Rubrofuscus"
    },
    {
        "  were considered a ": null
    },
    {
        "subspecies": "Subspecies"
    },
    {
        " of the common carp, often under the scientific name C. carpio haematopterus. However, they differ in ": null
    },
    {
        "meristics": "Meristics"
    },
    {
        " from the common carp of Europe and Western Asia,  leading recent authorities to recognize them as a separate species, C. rubrofuscus .   Although one study of ": null
    },
    {
        "mitochondrial DNA": "Mitochondrial Dna"
    },
    {
        " was unable to find a clear genetic structure matching the geographic populations ,  others based on mtDNA, ": null
    },
    {
        "microsatellite": "Microsatellite"
    },
    {
        " DNA and ": null
    },
    {
        "genomic DNA": "Genomic Dna"
    },
    {
        " found a clear separation between the European/West Asian population and the East Asian population, with koi belonging in the latter.    Consequently, recent authorities have suggested that the ancestral species of the koi is C. rubrofuscus  or at least an East Asian carp species instead of C. carpio.  Regardless, a ": null
    },
    {
        "taxonomic": "Taxonomy"
    },
    {
        " review of  Cyprinus  carp from eastern and southeastern Asia may be necessary, as the genetic variations do not fully match the currently recognized species pattern, with one study of mtDNA suggesting that koi are close to the Southeast Asian carp, but not necessarily the Chinese.           Koi varieties are distinguished by coloration, patterning, and scalation. Some of the major colors are white, black, red, yellow, blue, and cream. Although the possible colors are virtually limitless, breeders have identified and named a number of specific categories. The most notable category is Gosanke, which is made up of the Kohaku, Taisho Sanshoku, and Showa Sanshoku varieties.     New koi varieties are still being actively developed.  Ghost koi developed in the 1980s have become very popular in the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        "; they are a ": null
    },
    {
        "hybrid": "Hybrid"
    },
    {
        " of wild carp and Ogon koi, and are distinguished by their metallic scales. ": null
    },
    {
        "Butterfly koi": "Butterfly Koi"
    },
    {
        " , also developed in the 1980s, are notable for their long and flowing fins. They are hybrids of koi with ": null
    },
    {
        "Asian carp": "Asian Carp"
    },
    {
        ". Butterfly koi and ghost koi are considered by some to be not true nishikigoi.     The major named varieties include:       is a white-skinned koi, with large red markings on the top. The name means red and white ; kohaku was the first ornamental variety to be established in Japan .     is very similar to the kohaku, except for the addition of small black markings called . This variety was first exhibited in 1914 by the koi breeder Gonzo Hiroi, during the reign of the ": null
    },
    {
        "Taishō Emperor": "Taishō Emperor"
    },
    {
        ". In the United States, the name is often abbreviated to just Sanke . The kanji, 三色, may be read as either sanshoku or as sanke .    is a black koi with red  and white  markings. The first Showa Sanke was exhibited in 1927, during the reign of the ": null
    },
    {
        "Shōwa Emperor": "Shōwa Emperor"
    },
    {
        ". In America, the name is often abbreviated to just Showa . The amount of shiroji on Showa Sanke has increased in modern times , to the point that it can be difficult to distinguish from Taisho Sanke. The kanji, 三色, may be read as either sanshoku or as sanke.  is any koi with a solitary red patch on its head. The fish may be a Tanchō Shōwa, Tanchō Sanke, or even Tanchō Goshiki. It is named for the Japanese ": null
    },
    {
        "red-crowned crane": "Red-Crowned Crane"
    },
    {
        " , which also has a red spot on its head.   , tea-colored , this koi can range in color from pale olive-drab green or brown to copper or bronze and more recently, darker, subdued orange shades. Famous for its docile, friendly personality and large size, it is considered a sign of good luck among koi keepers.    koi is light blue above and usually red below, but also occasionally pale yellow or cream, generally below the lateral line and on the cheeks. The Japanese name means pale greenish-blue, ": null
    },
    {
        "spring onion": "Spring Onion"
    },
    {
        " color, or ": null
    },
    {
        "indigo": "Indigo"
    },
    {
        ".    is a black koi with white, red, or yellow markings, in a ": null
    },
    {
        "zebra": "Zebra"
    },
    {
        " color pattern. The oldest attested form is the yellow form, called  in the 19th century, but renamed  by Elizaburo Hoshino, an early 20th-century koi breeder. The red and white versions are called  and  , respectively. The word utsuri means to print . Genetically, it is the same as Showa, but lacking either red pigment  or white pigment .    is a white-, red-, or yellow-skinned koi with black markings . The Japanese name means tortoise shell , and is commonly written as 鼈甲. The white, red, and yellow varieties are called ,  and , respectively. It may be confused with the Utsuri.    is a dark koi with red  hi pattern. The Japanese name means five colors . It appears similar to an Asagi, with little or no hi below the lateral line and a Kōhaku Hi pattern over reticulated scales. The base color can range from nearly black to very pale, sky blue.    means autumn green ; the Shūsui was created in 1910 by Yoshigoro Akiyama（": null
    },
    {
        "秋山　吉五郎": ":Ja:秋山　吉五郎"
    },
    {
        ", by crossing Japanese Asagi with German ": null
    },
    {
        "mirror carp": "Mirror Carp"
    },
    {
        ". The fish has no scales, except for a single line of large mirror scales dorsally, extending from head to tail. The most common type of Shūsui has a pale, ": null
    },
    {
        "sky-blue": "Sky-Blue"
    },
    {
        "/gray color above the lateral line and red or orange below the lateral line and on the cheeks.    is a koi with metallic scales. The name translates into English as gold and silver scales ; it is often abbreviated to Ginrin. Ginrin versions of almost all other varieties of koi occur, and they are fashionable. Their sparkling, glittering scales contrast to the smooth, even, metallic skin and scales seen in the Ogon varieties. Recently, these characteristics have been combined to create the new ginrin Ogon varieties.    is a catch-all term for koi that cannot be put into one of the other categories. This is a competition category, and many new varieties of koi compete in this one category. It is also known as .  is a metallic koi of one color only . The most commonly encountered colors are gold, platinum, and orange. Cream specimens are very rare. Ogon compete in the Kawarimono category and the Japanese name means gold . The variety was created by Sawata Aoki in 1946 from wild carp he caught in 1921.     （literally nine tattooed dragons is a black doitsu-scaled fish with curling white markings. The patterns are thought to be reminiscent of Japanese ink paintings of dragons. They famously change color with the seasons. Kumonryu compete in the Kawarimono category.    is a light blue/gray koi with copper, bronze, or yellow  pattern, reminiscent of autumn leaves on water. The Japanese name means fallen leaves .    is a white fish with a Kohaku-style pattern with blue or black-edged scales only over the hi pattern. This variety first arose in the 1950s as a cross between a Kohaku and an Asagi. The most commonly encountered Koromo is an Ai Goromo, which is colored like a Kohaku, except each of the scales within the red patches has a blue or black edge to it. Less common is the Budo-Goromo, which has a darker hi overlay that gives it the appearance of bunches of grapes. Very rarely seen is the Tsumi-Goromo, which is similar to Budo-Goromo, but the hi pattern is such a dark burgundy that it appears nearly black.    is a koi with colored markings over a metallic base or in two metallic colors.   Kikokuryū is a metallic-skinned version of the Kumonryu.   Kin-Kikokuryū is a metallic-skinned version of the Kumonryu with a Kohaku-style hi pattern developed by Mr. Seiki Igarashi of Ojiya City. At least six different genetic subvarieties of this general variety are seen.   Ghost koi , a hybrid of Ogon and wild carp with metallic scales, is considered by some to be not nishikigoi.   ": null
    },
    {
        "Butterfly koi": "Butterfly Koi"
    },
    {
        "  is a hybrid of koi and Asian carp with long flowing fins. Various colorations depend on the koi stock used to cross. It also is considered by some to not be nishikigoi.    originated by crossbreeding numerous different established varieties with scaleless ": null
    },
    {
        "German carp": "German Carp"
    },
    {
        " . Also written as 独逸鯉, four main types of Doitsu scale patterns exist. The most common type has a row of scales beginning at the front of the dorsal fin and ending at the end of the dorsal fin . The second type has a row of scales beginning where the head meets the shoulder and running the entire length of the fish . The third type is the same as the second, with the addition of a line of scales running along the lateral line of the fish, also referred to as mirror koi . The fourth type is referred to as armor koi and is completely covered with very large scales that resemble plates of armor. It also is called Kagami-goi         ": null
    },
    {
        "Goldfish": "Goldfish"
    },
    {
        " were developed in ": null
    },
    {
        "China": "China"
    },
    {
        " more than a thousand years ago by ": null
    },
    {
        "selectively breeding": "Selectively Breeding"
    },
    {
        " Prussian carp for color ": null
    },
    {
        "mutations": "Mutation"
    },
    {
        ". By the ": null
    },
    {
        "Song dynasty": "Song Dynasty"
    },
    {
        " , yellow, orange, white, and red-and-white colorations had been developed. Goldfish  and ": null
    },
    {
        "Prussian carp": "Prussian Carp"
    },
    {
        "  are now considered different species. Goldfish were introduced to Japan in the 16th century and to Europe in the 17th century. Koi, though, were developed from Amur carp in Japan in the 1820s. Koi are domesticated Amur carp  that are selected or culled for color; they are not a different species, but a subspecies, and will revert to the original coloration within a few generations if allowed to breed freely.     The length of a koi can average up to about 3.28 feet. On average they also grow about 2 centimeters per month.  On the other hand, goldfish may only grow to be around a foot. In general, goldfish tend to be smaller than koi, and have a greater variety of body shapes and fin and tail configurations. Koi varieties tend to have a common body shape, but have a greater variety of coloration and color patterns. They also have prominent ": null
    },
    {
        "barbels": "Barbels"
    },
    {
        " on the lip. Some goldfish varieties, such as the ": null
    },
    {
        "common goldfish": "Common Goldfish"
    },
    {
        ", ": null
    },
    {
        "comet goldfish": "Comet Goldfish"
    },
    {
        ", and ": null
    },
    {
        "shubunkin": "Shubunkin"
    },
    {
        ", have body shapes and coloration that are similar to koi, and can be difficult to tell apart from koi when immature. Goldfish and koi can interbreed; however, as they were developed from different species of carp, their offspring are sterile.            The Amur carp is a hardy fish, and koi retain that durability. Koi are coldwater fish, but benefit from being kept in the  range, and do not react well to long, cold, winter temperatures; their immune systems are very weak below 10  °C. Koi ponds usually have a metre or more of depth in areas of the world that become warm during the summer, whereas in areas that have harsher winters, ponds generally have a minimum of . Specific pond construction has been evolved by koi keepers intent on raising show-quality koi.     The bright colors of koi put them at a severe disadvantage against predators; a white-skinned Kohaku is a visual dinner bell against the dark green of a pond. ": null
    },
    {
        "Herons": "Heron"
    },
    {
        ", ": null
    },
    {
        "kingfishers": "Kingfisher"
    },
    {
        ", ": null
    },
    {
        "otters": "Otter"
    },
    {
        ", ": null
    },
    {
        "raccoons": "Raccoon"
    },
    {
        ", ": null
    },
    {
        "cats": "Cat"
    },
    {
        ", ": null
    },
    {
        "fox": "Fox"
    },
    {
        "es, ": null
    },
    {
        "badgers": "Badger"
    },
    {
        ", and ": null
    },
    {
        "hedgehogs": "Hedgehog"
    },
    {
        " are all capable of emptying a pond of its fish. A well-designed outdoor pond has areas too deep for herons to stand, overhangs high enough above the water that mammals cannot reach in, and shade trees overhead to block the view of aerial passers-by. It may prove necessary to string nets or wires above the surface. A pond usually includes a ": null
    },
    {
        "pump": "Pump"
    },
    {
        " and ": null
    },
    {
        "filtration": "Koi Pond"
    },
    {
        " system to keep the water clear.     Koi are an omnivorous fish. They eat a wide variety of foods, including peas, lettuce, and watermelon. Koi food is designed not only to be nutritionally balanced, but also to float so as to encourage them to come to the surface. When they are eating, koi can be checked for parasites and ulcers. Naturally, koi are bottom feeders with a mouth configuration adapted for that. Some koi have a tendency to eat mostly from the bottom, so food producers create a mixed sinking and floating combination food. Koi recognize the persons feeding them and gather around them at feeding times. They can be trained to take food from ones hand. In the winter, their digestive systems slow nearly to a halt, and they eat very little, perhaps no more than nibbles of algae from the bottom. Feeding is not recommended when the water temperature drops below .   Care should be taken by hobbyists that proper oxygenation, pH stabilization, and off-gassing occur over the winter in small ponds, so they do not perish. Their appetites do not come back until the water becomes warm in the spring.     Koi have been reported to achieve ages of 100–200 years.  One famous scarlet koi named ": null
    },
    {
        "Hanako": "Hanako"
    },
    {
        " was owned by several individuals, the last of whom was Komei Koshihara. In July 1974, a study of the ": null
    },
    {
        "growth rings": "Identification Of Aging In Fishscales"
    },
    {
        " of one of the kois scales reported that Hanako was 226 years old.  Some sources give an accepted age for the species at little more than 50 years.         Koi are very hardy. With proper care, they resist many of the parasites that affect more sensitive tropical fish species, such as  Trichodina , Epistylis , and  Ichthyophthirius multifiliis  infections. Water pH is important for maintaining kois health.  Water changes help reduce the risk of diseases and keep koi from being stressed. Two of the biggest health concerns among koi breeders are the ": null
    },
    {
        "koi herpes virus": "Koi Herpes Virus"
    },
    {
        " and ": null
    },
    {
        "rhabdovirus": "Rhabdovirus"
    },
    {
        " carpio, which causes ": null
    },
    {
        "spring viraemia of carp": "Spring Viraemia Of Carp"
    },
    {
        " . No treatment is known for either disease. Some koi farms in Israel use the KV3 vaccine, developed by Prof. M. Kotler from the ": null
    },
    {
        "Hebrew University of Jerusalem": "Hebrew University Of Jerusalem"
    },
    {
        " and produced by Kovax, to immunise fish against KHV. Israel is currently the only country in the world to vaccinate koi against the KHV. The vaccine is injected into the fish when they are under one year old, and is accentuated by using an ": null
    },
    {
        "ultraviolet": "Ultraviolet"
    },
    {
        " light. The vaccine has a 90% success rate . KoVax Ltd. – Specializes in Aqua culture vaccines development and Manufacturing. and when immunized, the fish cannot succumb to a KHV outbreak and neither can the immunised koi pass KHV onto other fish in a pond. Reynolds, Paula . mitchkoi.co.uk Only ": null
    },
    {
        "biosecurity": "Biosecurity"
    },
    {
        " measures such as prompt detection, ": null
    },
    {
        "isolation": "Isolation"
    },
    {
        ", and ": null
    },
    {
        "disinfection": "Disinfection"
    },
    {
        " of tanks and equipment can prevent the spread of the disease and limit the loss of fish stock. In 2002, spring viraemia struck an ornamental koi farm in ": null
    },
    {
        "Kernersville, North Carolina": "Kernersville, North Carolina"
    },
    {
        ", and required complete depopulation of the ponds and a lengthy quarantine period. For a while after this, some koi farmers in neighboring states stopped importing fish for fear of infecting their own stocks. . Impact Worksheet•17 July 2002 . koisale.com.       When koi naturally breed on their own they tend to spawn in the spring and summer seasons. The male will start following the female, swimming right behind her and nudging her. After the female koi releases her eggs they sink to the bottom of the pond and stay there. A sticky outer shell around the egg helps keep it in place so it does not float around. Although the female can produce many spawns, many of the fry do not survive due to being eaten by others. On average if the egg survives around 4–7 days the fry will be hatched from the egg.       Like most fish, koi reproduce through spawning in which a female lays a vast number of eggs and one or more males fertilize them. Nurturing the resulting offspring is a tricky and tedious job, usually done only by professionals. Although a koi breeder may carefully select the parents they wish based on their desired characteristics, the resulting fry nonetheless exhibit a wide range of color and quality.     Koi produce thousands of offspring from a single spawning. However, unlike cattle, purebred dogs, or more relevantly, goldfish, the large majority of these offspring, even from the best champion-grade koi, are not acceptable as nishikigoi or may even be genetically defective. These unacceptable offspring are culled at various stages of development based on the breeders expert eye and closely guarded trade techniques. Culled fry are usually destroyed or used as feeder fish , while older culls, within their first year between 3 and 6 inches long , are often sold as lower-grade, pond-quality koi.     The semi-randomized result of the kois reproductive process has both advantages and disadvantages for the breeder. While it requires diligent oversight to narrow down the favorable result that the breeder wants, it also makes possible the development of new varieties of koi within relatively few generations.               Koi have been accidentally or deliberately released into the wild in every continent except ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        ". They quickly revert to the natural coloration of an Amur carp within a few generations. In many areas, they are considered an ": null
    },
    {
        "invasive species": "Invasive Species"
    },
    {
        " and a ": null
    },
    {
        "pest": "Pest"
    },
    {
        ". In the state of Queensland in Australia, they are considered noxious fish. . daff.qld.gov.au.     Koi greatly increase the ": null
    },
    {
        "turbidity": "Turbidity"
    },
    {
        " of the water because they are constantly stirring up the substrate. This makes waterways unattractive, reduces the abundance of aquatic plants, and can render the water unsuitable for swimming or drinking, even by livestock. In some countries, koi have caused so much damage to waterways that vast amounts of money and effort have been spent trying to eradicate them, largely unsuccessfully. . usgs.gov.     In many areas of North America, koi are introduced into the artificial water hazards and ponds on golf courses to keep water-borne insect larvae under control through predation.       The koi is symbolic in ": null
    },
    {
        "Japanese culture": "Culture Of Japan"
    },
    {
        " and is closely associated with the countrys national identity. The koi is a symbol of luck, prosperity, and good fortune in Japan.     In ": null
    },
    {
        "Sri Lanka": "Sri Lanka"
    },
    {
        ", interior courtyards most often have one or several fish ponds dedicated to koi.  Sri Lanka is the sixth largest cultivator of ornamental fish in the world after Singapore, Hong Kong, Malaysia, Thailand and the Philippines. ": null
    }
]