[
    {
        "        Kowtow, which is borrowed from kau tau in Cantonese , is the act of deep respect shown by ": null
    },
    {
        "prostration": "Prostration"
    },
    {
        ", that is, ": null
    },
    {
        "kneeling": "Kneeling"
    },
    {
        " and bowing so low as to have ones head touching the ground. In ": null
    },
    {
        "East Asian": "East Asia"
    },
    {
        " culture, the kowtow is the highest sign of reverence. It was widely used to show reverence for ones elders, superiors, and especially the ": null
    },
    {
        "Emperor": "Emperor Of China"
    },
    {
        ", as well as for religious and cultural objects of worship. In modern times, usage of the kowtow has been reduced; though it has recently seen a resurgence in popularity.       An alternative Chinese term is ketou; however, the meaning is somewhat altered: kou  has the general meaning of knock, whereas ke  has the general meaning of touch upon , tou  meaning head. The date of this customs origin is probably sometime between the ": null
    },
    {
        "Spring and Autumn period": "Spring And Autumn Period"
    },
    {
        ", or the ": null
    },
    {
        "Warring States period": "Warring States Period"
    },
    {
        " of Chinas history because it was a custom by the time of the ": null
    },
    {
        "Qin dynasty": "Qin Dynasty"
    },
    {
        " .        In ": null
    },
    {
        "Imperial Chinese": "Imperial Era Of Chinese History"
    },
    {
        " protocol, the kowtow was performed before the Emperor of China. Depending on the solemnity of the situation different grades of kowtow would be used. In the most solemn of ceremonies, for example at the coronation of a new Emperor, the Emperors subjects would undertake the ceremony of the three kneelings and nine kowtows , the so-called grand kowtow, which involves kneeling from a standing position three times, and each time, performing the kowtow three times while kneeling. ": null
    },
    {
        "Immanuel Hsu": "Immanuel C. Y. Hsu"
    },
    {
        " describes the full kowtow as three kneelings and nine knockings of the head on the ground .         As government officials represented the majesty of the Emperor while carrying out their duties, commoners were also required to kowtow to them in formal situations. For example, a commoner brought before a local magistrate would be required to kneel and kowtow. A commoner is then required to remain kneeling, whereas a person who has earned a degree in the ": null
    },
    {
        "Imperial examinations": "Imperial Examination"
    },
    {
        "is permitted a seat.     Since one is required by ": null
    },
    {
        "Confucian philosophy": "Confucianism"
    },
    {
        " to show great reverence to ones parents and grandparents, children may also be required to kowtow to their elderly ancestors, particularly on special occasions. For example, at a wedding, the marrying couple was traditionally required to kowtow to both sets of parents, as acknowledgement of the debt owed for their nurturing.     ": null
    },
    {
        "Confucius": "Confucius"
    },
    {
        " believed there was a natural harmony between the body and mind and therefore, whatever actions were expressed through the body would be transferred over to the mind.  Because the body is placed in a low position in the kowtow, the idea is that one will naturally convert to his or her mind a feeling of respect. What one does to oneself influences the mind. Confucian philosophy held that respect was important for a society, making bowing an important ritual.         The kowtow, and other traditional forms of reverence, were much maligned after the ": null
    },
    {
        "May Fourth Movement": "May Fourth Movement"
    },
    {
        ". Today, only vestiges of the traditional usage of the kowtow remain. In many situations, the standing ": null
    },
    {
        "bow": "Bowing"
    },
    {
        " has replaced the kowtow. For example, some, but not all, people would choose to kowtow before the grave of an ancestor, or while making traditional offerings to an ancestor. Direct descendants may also kowtow at the funeral of an ancestor, while others would simply bow. During a wedding, some couples may kowtow to their respective parents, though the standing bow is today more common. In extreme cases, the kowtow can be used to express profound gratitude, apology, or to beg for forgiveness.      The kowtow remains alive as part of a formal induction ceremony in certain traditional trades that involve apprenticeship or discipleship. For example, ": null
    },
    {
        "Chinese martial arts": "Chinese Martial Arts"
    },
    {
        " schools often require a student to kowtow to a master. Likewise, traditional performing arts often also require the kowtow.           Prostration is a general practice in ": null
    },
    {
        "Buddhism": "Buddhism"
    },
    {
        ", and not restricted to China. The kowtow is often performed in groups of three before Buddhist statues and images or tombs of the dead. In Buddhism it is more commonly termed either worship with the crown or casting the five limbs to the earth —referring to the two arms, two legs and forehead. For example, in certain ceremonies, a person would perform a sequence of three sets of three kowtows—stand up and kneel down again between each set—as an extreme gesture of respect; hence the term three kneelings and nine head knockings . Also, some Buddhist ": null
    },
    {
        "pilgrims": "Pilgrimage"
    },
    {
        " would kowtow once for every three steps made during their long journeys, the number three referring to the ": null
    },
    {
        "Triple Gem": "Triple Gem"
    },
    {
        " of Buddhism, the ": null
    },
    {
        "Buddha": "Buddhahood"
    },
    {
        ", the ": null
    },
    {
        "Dharma": "Dharma"
    },
    {
        ", and the ": null
    },
    {
        "Sangha": "Sangha"
    },
    {
        ". Prostration is widely practiced in India by Hindus to give utmost respect to their deities in temples and to parents and elders. Nowadays in modern times people show the regards to elders by bowing down and touching their feet.       The word kowtow came into English in the early 19th century to describe the bow itself, but its meaning soon shifted to describe any abject submission or groveling. The term is still commonly used in English with this meaning, disconnected from the physical act and the East Asian context.     The kowtow was a significant issue for diplomats, since it was required to come into the presence of the ": null
    },
    {
        "Emperor of China": "Emperor Of China"
    },
    {
        ", but it meant submission before him. The British embassies of ": null
    },
    {
        "George Macartney, 1st Earl Macartney": "George Macartney, 1St Earl Macartney"
    },
    {
        " and ": null
    },
    {
        "William Pitt Amherst, 1st Earl Amherst": "William Pitt Amherst, 1St Earl Amherst"
    },
    {
        " were allegedly unsuccessful, partly because kowtowing would mean acknowledging their King as a subject of the ": null
    },
    {
        "Emperor": "Emperor Of China"
    },
    {
        ".     Dutch ambassador ": null
    },
    {
        "Isaac Titsingh": "Isaac Titsingh"
    },
    {
        " did not refuse to kowtow during the course of his 1794–1795 mission to the imperial court of the ": null
    },
    {
        "Qianlong Emperor": "Qianlong Emperor"
    },
    {
        ". van Braam Houckgeest, Andreas Everardus. . , Vol. I . pp. 285 in original . The members of the Titsingh mission, including ": null
    },
    {
        "Andreas Everardus van Braam Houckgeest": "Andreas Everardus Van Braam Houckgeest"
    },
    {
        " and ": null
    },
    {
        "Chrétien-Louis-Joseph de Guignes": "Chrétien-Louis-Joseph De Guignes"
    },
    {
        ", made every effort to conform with the demands of the complex Imperial court etiquette.     On two occasions, the kowtow was performed by Chinese envoys to a foreign ruler – specifically the Russian Tsar. To-Shih, Qing emissary to Russia whose mission to Moscow took place in 1731, kowtowed before Tsarina ": null
    },
    {
        "Anna": "Anna Of Russia"
    },
    {
        ", as per instructions by the ": null
    },
    {
        "Yongzheng Emperor": "Yongzheng Emperor"
    },
    {
        ", as did Desin, who led another mission the next year to the new Russian capital at St. Petersburg. Hsu, Immunel C.-Y. , The Rise of Modern China, New York, Oxford University Press, pp. 115–118 Hsu notes that the ": null
    },
    {
        "Kangxi Emperor": "Kangxi Emperor"
    },
    {
        ", Yongzhengs predecessor, explicitly ordered that Russia be given a special status in Qing foreign relations by not being included among tributary states, i.e. recognition as an implicit equal of China.     The kowtow was often performed in intra-Asian diplomatic relations as well. In 1636, after being defeated by the invading Manchus, King Injo of Joseon was forced to surrender by kowtowing three times to pledge tributary status to the Qing Emperor, Hong Taiji. As was customary of all Asian envoys to Qing China, Joseon envoys kowtowed three times to the Qing emperor during their visits to China, continuing until 1896, when the Korean Empire withdrew its tributary status from Qing as a result of the First Sino-Japanese War.      The King of the ": null
    },
    {
        "Ryukyu Kingdom": "Ryukyu Kingdom"
    },
    {
        " also had to kneel three times on the ground and touch his head nine times to the ground , to show his allegiance to the Chinese emperors. ": null
    }
]