[
    {
        "                    The Krupp family , a prominent 400-year-old ": null
    },
    {
        "German": "Germany"
    },
    {
        " dynasty": "Dynasty"
    },
    {
        " from ": null
    },
    {
        "Essen": "Essen"
    },
    {
        ", is famous for their production of ": null
    },
    {
        "steel": "Steel"
    },
    {
        ", ": null
    },
    {
        "artillery": "Artillery"
    },
    {
        ", ": null
    },
    {
        "ammunition": "Ammunition"
    },
    {
        " and other ": null
    },
    {
        "armaments": "Armaments"
    },
    {
        ". The ": null
    },
    {
        "family business": "Family Business"
    },
    {
        ", known as Friedrich Krupp AG , was the largest company in Europe at the beginning of the 20th century, and was important to weapons development and production in both ": null
    },
    {
        "world wars": "World War"
    },
    {
        ". One of the most powerful dynasties in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        "an history, Krupp flourished for 400 years as the premier weapons manufacturer of ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ". From the ": null
    },
    {
        "Thirty Years War": "Thirty Years War"
    },
    {
        " until the end of the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        ", it produced ": null
    },
    {
        "battleships": "Battleship"
    },
    {
        ", ": null
    },
    {
        "U-boats": "U-Boat"
    },
    {
        ", ": null
    },
    {
        "tanks": "Tank"
    },
    {
        ", ": null
    },
    {
        "howitzers": "Howitzer"
    },
    {
        ", ": null
    },
    {
        "guns": "Gun"
    },
    {
        ", utilities, and hundreds of other commodities.     The dynasty began in 1587 when a trader named Arndt Krupp moved to ": null
    },
    {
        "Essen": "Essen"
    },
    {
        " and joined the merchants guild. He began buying vacated real estate from families who fled the city due to the ": null
    },
    {
        "Black Death": "Black Death"
    },
    {
        ", and became one of the citys richest men. His descendants produced small guns during the ": null
    },
    {
        "Thirty Years War": "Thirty Years War"
    },
    {
        ", and eventually acquired ": null
    },
    {
        "fulling": "Fulling"
    },
    {
        " mills, ": null
    },
    {
        "coal mines": "Coal Mine"
    },
    {
        ", and an ": null
    },
    {
        "iron forge": "Finery Forge"
    },
    {
        ". During the ": null
    },
    {
        "Napoleonic Wars": "Napoleonic Wars"
    },
    {
        ", ": null
    },
    {
        "Friedrich Krupp": "Friedrich Krupp"
    },
    {
        " founded the Gusstahlfabrik and produced ": null
    },
    {
        "smelted": "Smelting"
    },
    {
        " steel in 1816, turning the company into a major industrial power. This laid the foundations for the steel empire that would come to dominate the world for nearly a century under his son ": null
    },
    {
        "Alfred": "Alfred Krupp"
    },
    {
        ". Krupp became the arms manufacturer for the ": null
    },
    {
        "Kingdom of Prussia": "Kingdom Of Prussia"
    },
    {
        " in 1859, and later the ": null
    },
    {
        "German Empire": "German Empire"
    },
    {
        ".     Krupp was a pioneering company for workers rights. Alfred Krupp initiated a system of unprecedented ": null
    },
    {
        "benefits": "Employee Benefit"
    },
    {
        " and social programs for workers who pledged loyalty to the company, including on-site technical and manual training; accident, sickness and life insurance; housing ; recreational facilities and parks; schools; bath houses and department stores. Widows and orphans were guaranteed an income if their husbands or fathers were killed.     The company also produced steel used to build railroads in the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", capped the ": null
    },
    {
        "Chrysler Building": "Chrysler Building"
    },
    {
        " in 1929, and was the first to travel to the bottom of the ": null
    },
    {
        "Mariana Trench": "Mariana Trench"
    },
    {
        ". During the ": null
    },
    {
        "Third Reich": "Nazi Germany"
    },
    {
        ", Krupp supported ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        " and the ": null
    },
    {
        "use of slave labor": "Forced Labour Under German Rule During World War Ii"
    },
    {
        ", as employed for carrying out the ": null
    },
    {
        "Holocaust": "Holocaust"
    },
    {
        ", including in the ": null
    },
    {
        "Auschwitz death camp": "Auschwitz Concentration Camp"
    },
    {
        ". After the war, Krupp was rebuilt from scratch and again became one of the wealthiest companies in Europe. However, a recession in 1967 caused the company severe profit loss. In 1999 it merged with ": null
    },
    {
        "Thyssen AG": "Thyssen Ag"
    },
    {
        " to form the industrial ": null
    },
    {
        "conglomerate": "Conglomerate"
    },
    {
        " ThyssenKrupp AG": "Thyssenkrupp"
    },
    {
        ".     Historically, the Krupp company has been controversial because of its association with wars in Europe. As a major weapons supplier to multiple sides in various conflicts, the Krupps were sometimes blamed for the wars themselves or the degree of carnage that ensued.         ": null
    },
    {
        "Friedrich Krupp": "Friedrich Krupp"
    },
    {
        " launched the familys metal-based activities, building a pioneering ": null
    },
    {
        "steel": "Steel"
    },
    {
        " foundry": "Foundry"
    },
    {
        " in Essen in 1810. His son ": null
    },
    {
        "Alfred": "Alfred Krupp"
    },
    {
        " , known as the Cannon King or as Alfred the Great , invested heavily in new technology to become a significant manufacturer of steel rollers and railway tyres. He also invested in fluidized hotbed technologies  and acquired many mines in Germany and ": null
    },
    {
        "France": "France"
    },
    {
        ". Unusual for the era, he provided social services for his workers, including subsidized housing and health and retirement benefits.        The company began to make steel cannons in the 1840s—especially for the Russian, Turkish, and Prussian armies. Low non-military demand and government subsidies meant that the company specialized more and more in weapons: by the late 1880s the manufacture of armaments represented around 50% of Krupps total output. When Alfred started with the firm, it had five employees. At his death twenty thousand people worked for Krupp—making it the worlds largest industrial ": null
    },
    {
        "company": "Company"
    },
    {
        " and the ": null
    },
    {
        "largest private company in the German empire": "List Of German Companies By Employees In 1907"
    },
    {
        ".     Krupps had a Great Krupp Building with an exhibition of guns at the Columbian Exposition in 1893.        In the 20th century the company was headed by ": null
    },
    {
        "Gustav Krupp von Bohlen und Halbach": "Gustav Krupp Von Bohlen Und Halbach"
    },
    {
        " , who assumed the surname of Krupp when he married the Krupp heiress, ": null
    },
    {
        "Bertha Krupp": "Bertha Krupp"
    },
    {
        ". After ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        " came to power in Germany in 1933, the Krupp works became the center for German rearmament. In 1943, by a special order from Hitler, the company reverted to a sole-proprietorship, with Gustav and Berthas eldest son ": null
    },
    {
        "Alfried Krupp von Bohlen und Halbach": "Alfried Krupp Von Bohlen Und Halbach"
    },
    {
        " as proprietor. After Germanys defeat, Gustav was senile and incapable of standing trial, and the ": null
    },
    {
        "Nuremberg Military Tribunal": "Nuremberg Military Tribunal"
    },
    {
        " convicted Alfried as a ": null
    },
    {
        "war criminal": "War Criminal"
    },
    {
        " in the ": null
    },
    {
        "Krupp Trial": "Krupp Trial"
    },
    {
        " for plunder and for his companys use of ": null
    },
    {
        "slave labor": "Forced Labor In Germany During World War Ii"
    },
    {
        ". It sentenced him to 12 years in prison and ordered him to sell 75% of his holdings. In 1951, as the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        " developed and no buyer came forward, the U.S. occupation authorities released him, and in 1953 he resumed control of the firm.     In 1968, the company became a ": null
    },
    {
        "corporation": "Corporation"
    },
    {
        ". In 1999, the Krupp Group merged with its largest competitor, ": null
    },
    {
        "Thyssen AG": "Thyssen Ag"
    },
    {
        "; the combined company—": null
    },
    {
        "ThyssenKrupp": "Thyssenkrupp"
    },
    {
        ", became Germanys ": null
    },
    {
        "fifth-largest firm": "List Of Companies Of Germany"
    },
    {
        " and one of the largest steel producers in the world.           The Krupp family first appeared in the historical record in 1587, when Arndt Krupp joined the merchants ": null
    },
    {
        "guild": "Guild"
    },
    {
        " in Essen. Arndt, a trader, arrived in town just before an epidemic of the ": null
    },
    {
        "Black Death plague": "Black Death"
    },
    {
        " and became one of the citys wealthiest men by purchasing the property of families who fled the epidemic. After he died in 1624, his son Anton took over the family business; Anton oversaw a ": null
    },
    {
        "gunsmith": "Gunsmith"
    },
    {
        "ing operation during the ": null
    },
    {
        "Thirty Years War": "Thirty Years War"
    },
    {
        " , which was the first instance of the familys long association with arms manufacturing.     For the next century the Krupps continued to acquire property and became involved in municipal politics in Essen. By the mid-18th-century, Friedrich Jodocus Krupp, Arndts great-great-grandson, headed the Krupp family. In 1751, he married Helene Amalie Ascherfeld ; Jodocus died six years later, which left his widow to run the business: a family first. The Widow Krupp greatly expanded the familys holdings over the decades, acquiring a ": null
    },
    {
        "fulling": "Fulling"
    },
    {
        " mill, shares in four ": null
    },
    {
        "coal mines": "Coal Mine"
    },
    {
        ", and an ": null
    },
    {
        "iron forge": "Finery Forge"
    },
    {
        " located on a stream near Essen.                In 1807 the progenitor of the modern Krupp firm, ": null
    },
    {
        "Friedrich Krupp": "Friedrich Krupp"
    },
    {
        ", began his commercial career at age 19 when the Widow Krupp appointed him manager of the forge. Friedrichs father, the widows son, had died 11 years previously; since that time, the widow had tutored the boy in the ways of commerce, as he seemed the logical family heir. Unfortunately, Friedrich proved too idiotic for his own good, and quickly ran the formerly profitable forge into the ground. The widow soon had to sell it away.     In 1810, the widow died, and in what would prove a disastrous move, left virtually all the Krupp fortune and property to Friedrich. Newly enriched, Friedrich decided to discover the secret of cast steel. ": null
    },
    {
        "Benjamin Huntsman": "Benjamin Huntsman"
    },
    {
        ", a clockmaker from ": null
    },
    {
        "Sheffield": "Sheffield"
    },
    {
        ", had pioneered a process to make ": null
    },
    {
        "crucible steel": "Crucible Steel"
    },
    {
        " in 1740, but the British had managed to keep it secret, forcing others to import steel. When ": null
    },
    {
        "Napoleon": "Napoleon I Of France"
    },
    {
        " began his blockade of the ": null
    },
    {
        "British Empire": "British Empire"
    },
    {
        " , British steel became unavailable, and Napoleon offered a prize of four thousand francs to anyone who could replicate ": null
    },
    {
        "the British process": "English Crucible Steel"
    },
    {
        ". This prize piqued Friedrichs interest.     Thus, in 1811 Friedrich founded the Krupp Gusstahlfabrik . He realized he would need a large facility with a ": null
    },
    {
        "power source": "Power"
    },
    {
        " for success, and so he built a ": null
    },
    {
        "mill": "Watermill"
    },
    {
        " and ": null
    },
    {
        "foundry": "Foundry"
    },
    {
        " on the ": null
    },
    {
        "Ruhr River": "Ruhr River"
    },
    {
        ", which unfortunately proved an unreliable stream. Friedrich spent a significant amount of time and money in the small, ": null
    },
    {
        "waterwheel": "Waterwheel"
    },
    {
        "-powered facility, neglecting other Krupp business, but in 1816 he was able to produce ": null
    },
    {
        "smelted": "Smelting"
    },
    {
        " steel. He died in Essen, 8 October 1826 age 39.        Alfred Krupp , son of Friedrich Carl, was born in Essen in 1812. His fathers death forced him to leave school at the age of fourteen and take on responsibility for the steel works. Prospects were daunting: his father had spent a considerable fortune in the attempt to cast steel in large ingots, and to keep the works going the widow and family lived in extreme frugality. The young director laboured alongside the workmen by day and carried on his fathers experiments at night, while occasionally touring Europe trying to promote Krupp products and make sales. It was during a stay in England that young Alfried became enamored of the country and adopted the English spelling of his name.     For years, the works made barely enough money to cover the workmens wages. Then, in 1841, Alfreds brother Hermann invented the ": null
    },
    {
        "spoon-roller": "Blanking And Piercing"
    },
    {
        "—which Alfred ": null
    },
    {
        "patent": "Patent"
    },
    {
        "ed, bringing in enough money to enlarge the factory, steel production, and ": null
    },
    {
        "cast steel": "Cast Steel"
    },
    {
        " blocks. In 1847 Krupp made his first ": null
    },
    {
        "cannon": "Cannon"
    },
    {
        " of cast steel. At the ": null
    },
    {
        "Great Exhibition": "Great Exhibition"
    },
    {
        " of 1851, he exhibited a ": null
    },
    {
        "6 pounder": "6 Pounder"
    },
    {
        " made entirely from ": null
    },
    {
        "cast steel": "Cast Steel"
    },
    {
        ", and a solid flawless ": null
    },
    {
        "ingot": "Ingot"
    },
    {
        " of steel weighing , more than twice as much as any previously cast. He surpassed this with a  ingot for the ": null
    },
    {
        "Paris Exposition": "Exposition Universelle"
    },
    {
        " in 1855. Krupps exhibits caused a sensation in the engineering world, and the Essen works became famous.      In 1851, another successful innovation, no-weld ": null
    },
    {
        "railway tyres": "Railway Tires"
    },
    {
        ", began the companys primary revenue stream, from sales to railways in the United States. Alfred enlarged the factory and fulfilled his long-cherished scheme to construct a ": null
    },
    {
        "breech-loading cannon": "Rifled Breech-Loader"
    },
    {
        " of cast steel. He strongly believed in the superiority of ": null
    },
    {
        "breech-loaders": "Breech-Loading"
    },
    {
        ", on account of improved accuracy and speed, but this view did not win general acceptance among military officers, who remained loyal to tried-and-true ": null
    },
    {
        "muzzle-loaded": "Muzzleloader"
    },
    {
        " bronze cannon. Alfred soon began producing breech loading ": null
    },
    {
        "howitzers": "Howitzer"
    },
    {
        ", one of which he gifted to the ": null
    },
    {
        "Prussian court": "Prussian Court"
    },
    {
        ".     Indeed, unable to sell his steel cannon, Krupp gave it to ": null
    },
    {
        "the King of Prussia": "Frederick William Iv Of Prussia"
    },
    {
        ", who used it as a decorative piece. The kings brother ": null
    },
    {
        "Wilhelm": "Wilhelm I, German Emperor"
    },
    {
        ", however, realized the significance of the innovation. After he became regent in 1859, Prussia bought its first 312 steel cannon from Krupp, which became the main arms manufacturer for the Prussian military.     Prussia used the advanced technology of Krupp to defeat both Austria and France in the ": null
    },
    {
        "German Wars of Unification": "Unification Of Germany"
    },
    {
        ". The French high command refused to purchase Krupp guns despite ": null
    },
    {
        "Napoleon IIIs": "Napoleon Iii"
    },
    {
        " support. The ": null
    },
    {
        "Franco-Prussian war": "Franco-Prussian War"
    },
    {
        " was in part a contest of Kruppstahl versus bronze cannon. The success of German artillery spurred the first international ": null
    },
    {
        "arms race": "Arms Race"
    },
    {
        ", against ": null
    },
    {
        "Schneider-Creusot": "Schneider-Creusot"
    },
    {
        " in France and ": null
    },
    {
        "Armstrong": "Armstrong Whitworth"
    },
    {
        " in England. Krupp was able to sell, alternately, improved artillery and improved steel shielding to countries from Russia to Chile to Siam.     In the ": null
    },
    {
        "Panic of 1873": "Panic Of 1873"
    },
    {
        ", Alfred continued to expand, including the purchase of Spanish mines and Dutch shipping, making Krupp the biggest and richest company in Europe but nearly bankrupting it. He was bailed out with a 30 million Mark loan from a consortium of banks arranged by the Prussian State Bank.     In 1878 and 1879 Krupp held competitions known as Völkerschiessen, which were firing demonstrations of cannon for international buyers. These were held in ": null
    },
    {
        "Meppen": "Meppen, Germany"
    },
    {
        ", at the largest ": null
    },
    {
        "proving ground": "Proving Ground"
    },
    {
        " in the world; privately owned by Krupp. He took on 46 nations as customers. At the time of his death in 1887, he had 75,000 employees, including 20,200 in Essen. In his lifetime, Krupp manufactured a total of 24,576 guns; 10,666 for the German government and 13,910 for export.     Krupp established the Generalregulativ as the firms basic constitution. The company was a ": null
    },
    {
        "sole proprietorship": "Sole Proprietorship"
    },
    {
        ", inherited by ": null
    },
    {
        "primogeniture": "Primogeniture"
    },
    {
        ", with strict control of workers. Krupp demanded a loyalty oath, required workers to obtain written permission from their foremen when they needed to use the toilet and issued proclamations telling his workers not to concern themselves with national politics. In return, Krupp provided social services that were unusually liberal for the era, including ": null
    },
    {
        "colonies": "Workers Housing"
    },
    {
        " with parks, schools and recreation grounds - while the widows and orphans and other ": null
    },
    {
        "benefit schemes": "Employee Benefit"
    },
    {
        " insured the men and their families in case of illness or death. Essen became a large ": null
    },
    {
        "company town": "Company Town"
    },
    {
        " and Krupp became a de facto ": null
    },
    {
        "state within a state": "State Within A State"
    },
    {
        ", with Kruppianer as loyal to the company and the Krupp family as to the nation and the ": null
    },
    {
        "Hohenzollern family": "House Of Hohenzollern"
    },
    {
        ". Krupps ": null
    },
    {
        "paternalist": "Paternalism"
    },
    {
        " strategy was adopted by ": null
    },
    {
        "Bismarck": "Otto Von Bismarck"
    },
    {
        " as government policy, as a preventive against ": null
    },
    {
        "Social Democratic": "Social Democratic Party Of Germany"
    },
    {
        " tendencies, and later influenced the development and adoption of  Führerprinzip  by ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        ".     The Krupp social services program began about 1861, when it was found that there were not sufficient houses in the town for firm employees, and the firm began building dwellings. By 1862 ten houses were ready for foremen, and in 1863 the first houses for workingmen were built in Alt Westend. Neu Westend was built in 1871 and 1872. By 1905, 400 houses were provided, many being given rent free to widows of former workers. A ": null
    },
    {
        "cooperative society": "Cooperative Society"
    },
    {
        " was founded in 1868 which became the Consum-Anstalt. Profits were divided according to amounts purchased. A boarding house for single men, the Ménage, was started in 1865 with 200 boarders and by 1905 accommodated 1000. Bath houses were provided and employees received free medical services. Accident, life, and sickness  insurance societies  were formed, and the firm contributed to their support. Technical and manual training schools were provided.      Krupp was also held in high esteem by the kaiser, who dismissed ": null
    },
    {
        "Julius von Verdy du Vernois": "Julius Von Verdy Du Vernois"
    },
    {
        " and his successor ": null
    },
    {
        "Hans von Kaltenborn": "Hans Von Kaltenborn-Stachau"
    },
    {
        " for rejecting Krupps design of the ": null
    },
    {
        "C-96 field gun": "7.7 Cm Fk 96"
    },
    {
        ", quipping, I’ve canned three War Ministers because of Krupp, and still they don’t catch on!       Krupp proclaimed he wished to have a man come and start a ": null
    },
    {
        "counter-revolution": "Counter-Revolution"
    },
    {
        " against Jews, socialists and liberals. In some of his odder moods, he considered taking the role himself. According to historian ": null
    },
    {
        "William Manchester": "William Manchester"
    },
    {
        ", his great grandson, Krupp would interpret these outbursts as a prophecy fulfilled by the coming of ": null
    },
    {
        "Hitler": "Hitler"
    },
    {
        ".     Krupps marriage was not a happy one. His wife Bertha , was unwilling to remain in polluted Essen in ": null
    },
    {
        "Villa Hügel": "Villa Hügel"
    },
    {
        ", the mansion which Krupp designed. She spent most of their married years in resorts and spas, with their only child, a son.                After Krupps death in 1887, his only son, ": null
    },
    {
        "Friedrich Alfred": "Friedrich Alfred Krupp"
    },
    {
        ", carried on the work. The father had been a hard man, known as Herr Krupp since his early teens. Friedrich Alfred was called Fritz all his life, and was strikingly dissimilar to his father in appearance and personality. He was a philanthropist, a rarity amongst Ruhr industrial leaders. Part of his philanthropy supported the study of ": null
    },
    {
        "eugenics": "Eugenics"
    },
    {
        ", part of progressive thought.     Fritz was a skilled businessman, though of a different sort from his father. Fritz was a master of the subtle sell, and cultivated a close rapport with the Kaiser, ": null
    },
    {
        "Wilhelm II": "Wilhelm Ii, German Emperor"
    },
    {
        ". Under Fritzs management, the firms business blossomed further and further afield, spreading across the globe. He focused on arms manufacturing, as the US railroad market purchased from its own growing steel industry.     Fritz Krupp authorized many new products that would do much to change history. In 1890 Krupp developed ": null
    },
    {
        "nickel steel": "Nickel Steel"
    },
    {
        ", which was hard enough to allow thin battleship armor and cannon using ": null
    },
    {
        "Nobels improved gunpowder": "Ballistite"
    },
    {
        ". In 1892, Krupp bought Gruson in a hostile ": null
    },
    {
        "takeover": "Takeover"
    },
    {
        ". It became Krupp-Panzer and manufactured armor plate and ships’ turrets. In 1893 ": null
    },
    {
        "Rudolf Diesel": "Rudolf Diesel"
    },
    {
        " brought his new engine to Krupp to construct. In 1896 Krupp bought ": null
    },
    {
        "Germaniawerft": "Friedrich Krupp Germaniawerft"
    },
    {
        " in ": null
    },
    {
        "Kiel": "Kiel"
    },
    {
        ", which became Germanys main warship builder and built the first German ": null
    },
    {
        "U-boat": "U-Boat"
    },
    {
        " in 1906.     Fritz married Magda and they had two daughters: ": null
    },
    {
        "Bertha": "Bertha Krupp"
    },
    {
        " and Barbara ; the latter married ": null
    },
    {
        "Tilo Freiherr von Wilmowsky": "Tilo Freiherr Von Wilmowsky"
    },
    {
        " in 1907.     Fritz was arrested on 15 October 1902 by Italian police at his retreat on the Mediterranean island of ": null
    },
    {
        "Capri": "Capri"
    },
    {
        ", where he enjoyed the companionship of forty or so adolescent Italian boys. He had a subsequent publicity disaster and was found dead in his chambers not long after. It was alleged suicide, but foul play was suspected and details of the event were vague. His wife was institutionalized for insanity. Manchester, pp.  226-227               Upon Fritzs death, his teenage daughter ": null
    },
    {
        "Bertha": "Bertha Krupp"
    },
    {
        " inherited the firm. In 1903, the firm formally incorporated as a ": null
    },
    {
        "joint-stock company": "Joint-Stock Company"
    },
    {
        ", Fried. Krupp Grusonwerk AG. However, Bertha owned all but four shares. ": null
    },
    {
        "Kaiser Wilhelm II": "Wilhelm Ii, German Emperor"
    },
    {
        " felt it was unthinkable for the Krupp firm to be run by a woman. He arranged for Bertha to marry ": null
    },
    {
        "Gustav von Bohlen und Halbach": "Gustav Krupp Von Bohlen Und Halbach"
    },
    {
        ", a Prussian courtier to the Vatican and grandson of American Civil War General ": null
    },
    {
        "Henry Bohlen": "Henry Bohlen"
    },
    {
        ". By imperial proclamation at the wedding, Gustav was given the additional surname Krupp, which was to be inherited by ": null
    },
    {
        "primogeniture": "Primogeniture"
    },
    {
        " along with the company.     In 1911, Gustav bought Hamm Wireworks to manufacture barbed wire. In 1912, Krupp began manufacturing stainless steel. At this time 50% of Krupps armaments were sold to Germany, and the rest to 52 other nations. The company had invested worldwide, including in cartels with other international companies. ": null
    },
    {
        "Essen": "Essen"
    },
    {
        " was the company headquarters. In 1913 Germany jailed a number of military officers for selling secrets to Krupp, in what was known as the Kornwalzer scandal. Gustav was not himself penalized and fired only a single director, Otto Eccius.     After ": null
    },
    {
        "Archduke Franz Ferdinand": "Archduke Franz Ferdinand Of Austria"
    },
    {
        " was assassinated in 1914, Krupp bought his villa Blühnbach, in ": null
    },
    {
        "Werfen": "Werfen"
    },
    {
        " in the Austrian Alps, and which was a former residence of the ": null
    },
    {
        "Archbishops of Salzburg": "Archbishopric Of Salzburg"
    },
    {
        ".          Gustav led the firm through ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ", concentrating almost entirely on artillery manufacturing, particularly following the loss of overseas markets as a result of the Allied blockade. ": null
    },
    {
        "Vickers": "Vickers"
    },
    {
        " of England naturally suspended ": null
    },
    {
        "royalty payments": "Royalty Payment"
    },
    {
        " during the war .     In 1916, the German government seized Belgian industry and conscripted Belgian civilians for forced labor in the Ruhr. These were novelties in modern warfare and in violation of the ": null
    },
    {
        "Hague Conventions": "Hague Conventions"
    },
    {
        ", to which Germany was a signatory. During the war, ": null
    },
    {
        "Friedrich Krupp Germaniawerft": "Friedrich Krupp Germaniawerft"
    },
    {
        " produced 84 U-boats for the German navy, as well as the Deutschland submarine freighter, intended to ship raw material to Germany despite the blockade. In 1918 the Allies named Gustav a ": null
    },
    {
        "war criminal": "War Criminal"
    },
    {
        ", but the trials never proceeded.     After the war, the firm was forced to renounce arms manufacturing. Gustav attempted to reorient to consumer products, under the slogan Wir machen alles! , but operated at a loss for years. The company laid off 70,000 workers but was able to stave off Socialist unrest by continuing severance pay and its famous social services for workers. The company opened a dental hospital to provide steel teeth and jaws for wounded veterans. It received its first contract from the Prussian State railway, and manufactured its first locomotive.     In 1920, the Ruhr Uprising occurred in reaction to the ": null
    },
    {
        "Kapp Putsch": "Kapp Putsch"
    },
    {
        ". The ": null
    },
    {
        "Ruhr Red Army": "Ruhr Red Army"
    },
    {
        ", or Rote Soldatenbund, took over much of the demilitarized ": null
    },
    {
        "Rhineland": "Rhineland"
    },
    {
        " unopposed. Krupps factory in ": null
    },
    {
        "Essen": "Essen"
    },
    {
        " was occupied, and independent republics were declared, but the German ": null
    },
    {
        "Reichswehr": "Reichswehr"
    },
    {
        " invaded from ": null
    },
    {
        "Westphalia": "Westphalia"
    },
    {
        " and quickly restored order. Later in the year, Britain oversaw the dismantling of much of Krupps factory, reducing capacity by half and shipping industrial equipment to France as ": null
    },
    {
        "war reparations": "War Reparations"
    },
    {
        ".     In the ": null
    },
    {
        "hyperinflation of 1923": "Inflation In The Weimar Republic"
    },
    {
        ", the firm printed Kruppmarks for use in Essen, which was the only stable currency there. France and Belgium ": null
    },
    {
        "occupied the Ruhr": "Occupation Of The Ruhr"
    },
    {
        " and established martial law. French soldiers inspecting Krupps factory in Essen were cornered by workers in a garage, opened fire with a machine gun, and killed thirteen. This incident spurred reprisal killings and sabotage across the Rhineland, and when Krupp held a large, public funeral for the workers, he was fined and jailed by the French. This made him a national hero, and he was granted an amnesty by the French after seven months.     Although Krupp was a monarchist at heart, he cooperated with the ": null
    },
    {
        "Weimar Republic": "Weimar Republic"
    },
    {
        "; as a munitions manufacturer his first loyalty was to the government in power. He was deeply involved with the ": null
    },
    {
        "Reichswehrs": "Reichswehr"
    },
    {
        " evasion of the ": null
    },
    {
        "Treaty of Versailles": "Treaty Of Versailles"
    },
    {
        ", and secretly engaged in arms design and manufacture. In 1921 Krupp bought ": null
    },
    {
        "Bofors": "Bofors"
    },
    {
        " in Sweden as a ": null
    },
    {
        "front company": "Front Organization"
    },
    {
        " and sold arms to neutral nations including the Netherlands and Denmark. In 1922, Krupp established Suderius AG in the Netherlands, as a front company for shipbuilding, and sold submarine designs to neutrals including the Netherlands, Spain, Turkey, Finland, and Japan. German Chancellor ": null
    },
    {
        "Wirth": "Joseph Wirth"
    },
    {
        " arranged for Krupp to secretly continue designing artillery and tanks, coordinating with army chief ": null
    },
    {
        "von Seeckt": "Hans Von Seeckt"
    },
    {
        " and navy chief Paul Behncke. Krupp was able to hide this activity from Allied inspectors for five years, and kept up his engineers’ skills by hiring them out to Eastern European governments including Russia.     In 1924, the Raw Steel Association was established in Luxembourg, as a quota-fixing cartel for coal and steel, by France, Britain, Belgium, Luxembourg, Austria, Czechoslovakia, and Germany. Germany, however, chose to violate quotas and pay fines, in order to monopolize the Ruhrs output and continue making high-grade steel. In 1926, Krupp began the manufacture of ": null
    },
    {
        "Widia": "Cemented Carbide"
    },
    {
        " cobalt-tungsten carbide. In 1928, German industry under Krupp leadership put down a general strike, locking out 250,000 workers, and encouraging the government to cut wages 15%. In 1929, the Chrysler Building was capped with Krupp steel.     Gustav and especially Bertha were initially skeptical of Hitler, who was not of their class. Gustavs skepticism toward the Nazis waned when Hitler dropped plans to nationalize business, the Communists gained seats in the 6 November elections, and Chancellor ": null
    },
    {
        "Kurt von Schleicher": "Kurt Von Schleicher"
    },
    {
        " suggested a planned economy with price controls. Despite this, as late as the day before President ": null
    },
    {
        "Paul von Hindenburg": "Paul Von Hindenburg"
    },
    {
        " appointed Hitler Chancellor, Gustav warned him not to do so. However, after Hitler won power, Gustav became enamoured with the Nazis  to a degree his wife and subordinates found bizarre.     In 1933, Hitler made Gustav chairman of the Reich Federation of German Industry. Gustav ousted Jews from the organization and disbanded the board, establishing himself as the sole-decision maker. Hitler visited Gustav just before the ": null
    },
    {
        "Röhm purge": "Night Of Long Knives"
    },
    {
        " in 1934, which among other things eliminated many of those who actually believed in the socialism of National Socialism.  Gustav supported the Adolf Hitler Endowment Fund of German Industry , administrated by ": null
    },
    {
        "Bormann": "Martin Bormann"
    },
    {
        ", who used it to collect millions of Marks from German businessmen. As part of Hitlers secret rearmament program, Krupp expanded from 35,000 to 112,000 employees.     Gustav was alarmed at Hitlers aggressive foreign policy after the ": null
    },
    {
        "Munich Agreement": "Munich Agreement"
    },
    {
        ", but by then he was fast succumbing to senility and was effectively displaced by his son Alfried. He was indicted at the ": null
    },
    {
        "Nuremberg Trials": "Nuremberg Trials"
    },
    {
        " but never tried, due to his advanced dementia. He was thus the only German to be accused of being a war criminal after both world wars. He was nursed by his wife in a roadside inn near Blühnbach until his death in 1950, and then cremated and interred quietly, since his adopted name was at that time one of the most notorious in the ": null
    },
    {
        "American Zone": "Allied-Occupied Germany"
    },
    {
        ".             As the eldest son of ": null
    },
    {
        "Bertha Krupp": "Bertha Krupp"
    },
    {
        ", Alfried was destined by family tradition to become the sole heir of the Krupp concern. An amateur photographer and Olympic sailor, he was an early supporter of Nazism among German industrialists, joining the SS in 1931, and never disavowing his allegiance to Hitler.     His fathers health began to decline in 1939, and after a stroke in 1941, Alfried took over full control of the firm, continuing its role as main arms supplier to Germany at war. In 1943, Hitler decreed the ": null
    },
    {
        "Lex Krupp": "Lex Krupp"
    },
    {
        ", authorizing the transfer of all Berthas shares to Alfried, giving him the name Krupp and dispossessing his siblings.     During the war, Krupp was allowed to take over many industries in occupied nations, including Arthur Krupp steel works in ": null
    },
    {
        "Berndorf, Austria": "Berndorf, Lower Austria"
    },
    {
        ", the Alsacian Corporation for Mechanical Construction , Robert Rothschilds tractor factory in France, ": null
    },
    {
        "Škoda Works": "Škoda Works"
    },
    {
        " in Czechoslovakia, and Deutsche Schiff- und Maschinenbau AG  in ": null
    },
    {
        "Bremen": "Bremen"
    },
    {
        ". This activity became the basis for the charge of plunder at the war crimes trial of Krupp executives after the war.     As another ": null
    },
    {
        "war crime": "War Crime"
    },
    {
        ", Krupp used slave labor, both POWs and civilians from occupied countries, and Krupp representatives were sent to concentration camps to select laborers. Treatment of Slavic and Jewish slaves was particularly harsh, since they were considered ": null
    },
    {
        "sub-human in Nazi Germany": "Racial Policy Of Nazi Germany"
    },
    {
        ", and Jews were targeted for ": null
    },
    {
        "extermination through labor": "Extermination Through Labor"
    },
    {
        " . The number of slaves cannot be calculated due to constant fluctuation but is estimated at 100,000, at a time when the free employees of Krupp numbered 278,000. The highest number of Jewish slave laborers at any one time was about 25,000 in January 1943.     In 1942–1943, Krupp built the Berthawerk factory , near the ": null
    },
    {
        "Markstadt forced labour camp": "Labor Camp"
    },
    {
        ", for production of artillery ": null
    },
    {
        "fuses": "Fuse"
    },
    {
        ". Jewish women were used as slave labor there, leased from the ": null
    },
    {
        "SS": "Schutzstaffel"
    },
    {
        " for 4 Marks a head per day. Later in 1943 it was taken over by Union Werke.     In 1942, although Russia in retreat relocated many factories to the Urals, steel factories were simply too large to move. Krupp took over production, including at the Molotov steel works near ": null
    },
    {
        "Kharkov": "Kharkiv"
    },
    {
        " and ": null
    },
    {
        "Kramatorsk": "Kramatorsk"
    },
    {
        " in eastern Ukraine, and at mines supplying the iron, manganese, and chrome vital for steel production.     The ": null
    },
    {
        "battle of Stalingrad": "Battle Of Stalingrad"
    },
    {
        " in 1942 convinced Krupp that Germany would lose the war, and he secretly began liquidating 200 million Marks in government bonds. This allowed him to retain much of his fortune and hide it overseas.     Beginning in 1943, ": null
    },
    {
        "Allied bombers targeted the main German industrial district": "Strategic Bombing During World War Ii"
    },
    {
        " in the ": null
    },
    {
        "Ruhr": "Ruhr"
    },
    {
        ". Most damage at Krupps works was actually to the slave labor camps, and German tank production continued to increase from 1,000 to 1,800 per month. However, by the end of the war, with a manpower shortage preventing repairs, the main factories were out of commission.     On 25 July 1943 the ": null
    },
    {
        "Royal Air Force": "Royal Air Force"
    },
    {
        " attacked the Krupp Works with 627 heavy bombers, dropping 2,032 long tons of bombs in an ": null
    },
    {
        "Oboe": "Oboe"
    },
    {
        "-marked attack. Upon his arrival at the works the next morning, Gustav Krupp suffered a fit from which he never recovered.           After the war, the Ruhr became part of the ": null
    },
    {
        "British Zone of occupation": "Allied-Occupied Germany"
    },
    {
        ". The British dismantled Krupps factories, sending machinery all over Europe as ": null
    },
    {
        "war reparations": "War Reparations"
    },
    {
        ". The Russians seized Krupps Grusonwerk in Magdeburg, including the formula for ": null
    },
    {
        "tungsten steel": "Tungsten Carbide"
    },
    {
        ". ": null
    },
    {
        "Germaniawerft": "Friedrich Krupp Germaniawerft"
    },
    {
        " in Kiel was dismantled, and Krupps role as an arms manufacturer came to an end. ": null
    },
    {
        "Allied High Commission": "Allied High Commission"
    },
    {
        " Law 27, in 1950, mandated the ": null
    },
    {
        "decartelization": "Decartelization"
    },
    {
        " of German industry.           Meanwhile, Alfried was held in ": null
    },
    {
        "Landsberg prison": "Landsberg Prison"
    },
    {
        ", where Hitler had been imprisoned in 1924. At the ": null
    },
    {
        "Krupp Trial": "Krupp Trial"
    },
    {
        ", held in 1947–1948 in Nuremberg following the main ": null
    },
    {
        "Nuremberg trials": "Nuremberg Trials"
    },
    {
        ", Alfried and most of his co-defendants were convicted of crimes against humanity , while being acquitted of crimes against peace, and conspiracy. Alfried was condemned to 12 years in prison and the forfeiture of all property both real and personal, making him a pauper. Two years later, on 31 January 1951, ": null
    },
    {
        "John J. McCloy": "John J. Mccloy"
    },
    {
        ", High Commissioner of the American zone of occupation, issued an amnesty to the Krupp defendants. Much of Alfrieds industrial empire was restored, but he was forced to transfer some of his fortune to his siblings, and he renounced arms manufacturing.     By this time, ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        "’s ": null
    },
    {
        "Wirtschaftswunder": "Wirtschaftswunder"
    },
    {
        " had begun, and the ": null
    },
    {
        "Korean War": "Korean War"
    },
    {
        " had shifted the United Statess priority from ": null
    },
    {
        "denazification": "Denazification"
    },
    {
        " to ": null
    },
    {
        "anti-Communism": "Anti-Communism"
    },
    {
        ". German industry was seen as integral to ": null
    },
    {
        "western Europe": "Western Europe"
    },
    {
        "’s economic recovery, the limit on steel production was lifted, and the reputation of Hitler-era firms and industrialists was rehabilitated.     In 1953 Krupp negotiated the Mehlem agreement with the governments of the US, Great Britain and France. Hitlers ": null
    },
    {
        "Lex Krupp": "Lex Krupp"
    },
    {
        " was upheld, reestablishing Alfried as sole proprietor, but Krupp mining and steel businesses were sequestered and pledged to be divested by 1959. There is scant evidence that Alfried intended to fulfill his side of the bargain, and he continued to receive royalties from the sequestered industries.        Despite having only 16,000 employees and 16,000 pensioners, Alfried refused to cut pensions. He ended unprofitable businesses including shipbuilding, railway tyres, and farm equipment. He hired ": null
    },
    {
        "Berthold Beitz": "Berthold Beitz"
    },
    {
        ", an insurance executive, as the face of the company, and began a public relations campaign to promote Krupp worldwide, omitting references to Nazism or arms manufacturing. Beginning with ": null
    },
    {
        "Adenauer": "Konrad Adenauer"
    },
    {
        ", he established personal diplomacy with heads of state, making both open and secret deals to sell equipment and engineering expertise. Expansion was significant in the ": null
    },
    {
        "former colonies": "Decolonization Of Africa"
    },
    {
        " of Great Britain and behind the ": null
    },
    {
        "Iron Curtain": "Iron Curtain"
    },
    {
        ", in countries eager to industrialize but suspicious of ": null
    },
    {
        "NATO": "Nato"
    },
    {
        ". Krupp built rolling mills in Mexico, paper mills in Egypt, foundries in Iran, refineries in Greece, a vegetable oil processing plant in Sudan, and its own steel plant in Brazil. In India, Krupp rebuilt ": null
    },
    {
        "Rourkela": "Rourkela"
    },
    {
        " in ": null
    },
    {
        "Odisha": "Odisha"
    },
    {
        " as company town similar to his own Essen. In West Germany, Krupp made jet fighters in Bremen, as a joint venture with ": null
    },
    {
        "United Aircraft": "United Technologies Corporation"
    },
    {
        ", and built an ": null
    },
    {
        "atomic reactor": "Avr Reactor"
    },
    {
        " in Jülich, partly funded by the government. The company expanded to 125,000 employees worldwide, and in 1959 Krupp was the fourth largest in Europe , and the 12th largest in the world.     1959 was also Krupps deadline to sell his sequestered industries, but he was supported by other Ruhr industrialists, who refused to place bids. Krupp not only took back control of those companies in 1960, he used a shell company in Sweden to buy the Bochumer Verein für Gussstahlfabrikation AG, in his opinion the best remaining steel manufacturer in West Germany. The ": null
    },
    {
        "Common Market": "European Economic Community"
    },
    {
        " allowed these moves, effectively ending the Allied policy of ": null
    },
    {
        "decartelization": "Decartelization"
    },
    {
        ". Alfried was the richest man in Europe, and among the worlds handful of billionaires.     The treatment of Jews during the war had remained an issue. In 1951, Adenauer acknowledged that unspeakable crimes were perpetrated in the name of the German people, which impose upon them the obligation to make moral and material amends. Negotiations with the ": null
    },
    {
        "Claims Conference": "Claims Conference"
    },
    {
        " resulted in the ": null
    },
    {
        "Reparations Agreement between Israel and West Germany": "Reparations Agreement Between Israel And West Germany"
    },
    {
        ". ": null
    },
    {
        "IG Farben": "Ig Farben"
    },
    {
        ", ": null
    },
    {
        "Siemens": "Siemens"
    },
    {
        ", Krupp, ": null
    },
    {
        "AEG": "Aeg"
    },
    {
        ", ": null
    },
    {
        "Telefunken": "Telefunken"
    },
    {
        ", and ": null
    },
    {
        "Rheinmetall": "Rheinmetall"
    },
    {
        " separately provided compensation to Jewish slave laborers, but Alfried refused to consider compensation to non-Jewish slave laborers.     In the mid-1960s, a series of blows ended the special status of Krupp. A recession in 1966 exposed the companys overextended credit and turned Alfrieds cherished mining and steel companies into loss-leaders. In 1967, the ": null
    },
    {
        "West German Federal Tax Court": "Judiciary Of Germany"
    },
    {
        " ended sales tax exemptions for private companies, of which Krupp was the largest, and voided the Hitler-era exemption of the company from inheritance tax. Alfrieds only son, ": null
    },
    {
        "Arndt von Bohlen und Halbach": "Arndt Von Bohlen Und Halbach"
    },
    {
        " , would not develop an interest in the family business and was willing to renounce his inheritance. Alfried arranged for the firm to be reorganized as a ": null
    },
    {
        "corporation": "Corporation"
    },
    {
        " and a ": null
    },
    {
        "foundation": "Foundation"
    },
    {
        " for scientific research, with a generous pension for Arndt. Although Arndt was homosexual, like his great-grandfather Friedrich Krupp, he married but was childless. He was an alcoholic and died of cancer in 1986, aged 48, 399 years after Arndt Krupp arrived in Essen.       Alfried had married twice, both ending in divorce, and by family tradition he had excluded his siblings from company management. He died in Essen in 1967, and the companys transformation was completed the next year, capitalized at 500 million DM, with Beitz in charge of the ": null
    },
    {
        "Alfried Krupp von Bohlen und Halbach Foundation": "Alfried Krupp Von Bohlen Und Halbach Foundation"
    },
    {
        " and chairman of the corporations board until 1989. Between 1968 and 1990 the foundation awarded grants totaling around 360 million DM. In 1969, the coal mines were transferred to ": null
    },
    {
        "Ruhrkohle AG": "Rag Aktiengesellschaft"
    },
    {
        ". Stahlwerke Südwestfalen was bought for stainless steel, and ": null
    },
    {
        "Polysius AG": "Polysius Ag"
    },
    {
        " and Heinrich Koppers for engineering and the construction of industrial plants.     In the early 1980s, the company spun off all its operating activities and was restructured as a holding company. VDM Nickel-Technologie was bought in 1989, for high-performance materials, mechanical engineering and electronics. That year, Gerhard Cromme became chairman and chief executive of Krupp. After its hostile takeover of rival steelmaker ": null
    },
    {
        "Hoesch AG": "Hoesch Ag"
    },
    {
        " in 1990–1991, the companies were merged in 1992 as Fried. Krupp AG Hoesch Krupp, under Cromme. After closing one main steel plant and laying off 20,000 employees, the company had a steelmaking capacity of around eight million metric tons and sales of about 28 billion DM . The new Krupp had six divisions: steel, engineering, plant construction, automotive supplies, trade, and services. After two years of heavy losses, a modest net profit of 40 million DM followed in 1994.     In 1997 Krupp attempted a hostile takeover of the larger Thyssen, but the bid was abandoned after resistance from Thyssen management and protests by its workers. Nevertheless, Thyssen agreed to merge the two firms flat steel operations, and Thyssen Krupp Stahl AG was created in 1997 as a jointly owned subsidiary . About 6,300 workers were laid off. Later that year, Krupp and Thyssen announced a full merger, which was completed in 1999 with the formation of ": null
    },
    {
        "ThyssenKrupp": "Thyssenkrupp"
    },
    {
        " AG. Cromme and Ekkehard Schulz were named co-chief executives of the new company, operating worldwide in three main business areas: steel, capital goods , and services .           The unexpected ": null
    },
    {
        "victory of Prussia over France": "Franco-Prussian War"
    },
    {
        "  demonstrated the superiority of ": null
    },
    {
        "breech-loaded": "Breech-Loading Weapon"
    },
    {
        " steel cannon over ": null
    },
    {
        "muzzle-loaded": "Muzzleloader"
    },
    {
        " brass. Krupp artillery was a significant factor at the battles of ": null
    },
    {
        "Wissembourg": "Battle Of Wissembourg"
    },
    {
        " and ": null
    },
    {
        "Gravelotte": "Battle Of Gravelotte"
    },
    {
        ", and was used during the siege of Paris. Krupps ": null
    },
    {
        "anti-balloon guns": "Anti-Aircraft Warfareearliest Use"
    },
    {
        " were the first ": null
    },
    {
        "anti-aircraft": "Anti-Aircraft Warfare"
    },
    {
        " guns. Prussia fortified the major North German ports with batteries that could hit French ships from a distance of 4,000 yards, inhibiting invasion.       Krupps construction of the ": null
    },
    {
        "Great Venezuela Railway": "Great Venezuela Railway"
    },
    {
        " from 1888 to 1894 raised Venezuelan national debt. Venezuelas suspension of debt payments in 1901 led to ": null
    },
    {
        "gunboat diplomacy": "Gunboat Diplomacy"
    },
    {
        " of the ": null
    },
    {
        "Venezuela Crisis of 1902–1903": "Venezuela Crisis Of 1902–1903"
    },
    {
        ". Tomz, Michael Enforcement by Gunboats Stanford University p.189       Russia and the Ottoman Empire both bought large quantities of Krupp guns. By 1887, Russia had bought 3,096 Krupp guns, while the Ottomans bought 2,773 Krupp guns. By the start of the ": null
    },
    {
        "Balkan wars": "Balkan Wars"
    },
    {
        " the largest export market for Krupp worldwide was Turkey, which purchased 3,943 Krupp guns of various types between 1854 and 1912. The 2nd largest customer in the Balkans was Romania, which purchased 1,450 guns in the same period, while Bulgaria purchased 517 pieces, Greece 356, Austria-Hungary 298, Montenegro 25, and Serbia just 6 guns.           Krupp produced most of the artillery of the Imperial German Army, including its heavy siege guns: the 1914 420  mm ": null
    },
    {
        "Big Bertha": "Big Bertha"
    },
    {
        ", the 1916 ": null
    },
    {
        "Langer Max": "38 Cm Sk L/45   Max"
    },
    {
        ", and the seven ": null
    },
    {
        "Paris Guns": "Paris Gun"
    },
    {
        " in 1917 and 1918. In addition, ": null
    },
    {
        "Friedrich Krupp Germaniawerft": "Friedrich Krupp Germaniawerft"
    },
    {
        " built German warships and submarines in Kiel. During the war Krupp modified also the design of an existing ": null
    },
    {
        "Langer Max": "38 Cm Sk L/45   Max"
    },
    {
        " gun which they built in ": null
    },
    {
        "Koekelare": "Lange Max Museum"
    },
    {
        ". The gun called ": null
    },
    {
        "Batterie Pommern": "Batterie Pommern"
    },
    {
        " was the largest gun of the world in 1917 and was able to shoot shells of ±750  kg from ": null
    },
    {
        "Koekelare": "Koekelare"
    },
    {
        " to ": null
    },
    {
        "Dunkirk": "Dunkirk"
    },
    {
        ".   Before World War I Krupp had a contract with the British armaments company Vickers and Son Ltd. to supply Vickers-constructed Maxim machine guns. Conversely, from 1902 Krupp was contracted by Vickers to supply its patented fuses to Vickers bullets. It is known that wounded and deceased German soldiers were found to have spent Vickers bullets with the German inscription Krupps patent zünder lying around their bodies.       Krupp received its first order for 135 ": null
    },
    {
        "Panzer I": "Panzer I"
    },
    {
        " tanks in 1933, and during World War II made ": null
    },
    {
        "tanks": "Panzer Iv"
    },
    {
        ", artillery, naval guns, armor plate, munitions and other armaments for the German military. ": null
    },
    {
        "Friedrich Krupp Germaniawerft": "Friedrich Krupp Germaniawerft"
    },
    {
        " shipyard launched the ": null
    },
    {
        "cruiser": "Cruiser"
    },
    {
        " Prinz Eugen": "German Cruiser Prinz Eugen"
    },
    {
        ", as well as many of Germanys ": null
    },
    {
        "U-boats": "U-Boat"
    },
    {
        " using preassembled parts supplied by other Krupp factories in a process similar to the construction of the US ": null
    },
    {
        "liberty ships": "Liberty Ship"
    },
    {
        ".     In the 1930s, Krupp developed two 800  mm ": null
    },
    {
        "railway guns": "Railway Gun"
    },
    {
        ", the ": null
    },
    {
        "Schwerer Gustav": "Schwerer Gustav"
    },
    {
        " and the ": null
    },
    {
        "Dora": "Dora"
    },
    {
        ". These guns were the biggest artillery pieces ever fielded by an army during wartime, and weighed almost 1,344 tons. They could fire a 7-ton shell over a distance of 37 kilometers. More crucial to the operations of the German military was Krupps development of the famed ": null
    },
    {
        "88 mm": "88 Mm Gun"
    },
    {
        " anti-aircraft cannon which found use as a notoriously effective anti-tank gun.     In an address to the ": null
    },
    {
        "Hitler Youth": "Hitler Youth"
    },
    {
        ", ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        " stated In our eyes, the German boy of the future must be slim and slender, as fast as a greyhound, tough as leather and hard as Krupp steel      During the war Germanys industry was heavily bombed. The germans built large-scale night-time decoys like the ": null
    },
    {
        "Krupp decoy site": "Krupp Decoy Site"
    },
    {
        " which was a German decoy-site of the ": null
    },
    {
        "Krupp": "Krupp"
    },
    {
        " steel works in ": null
    },
    {
        "Essen": "Essen"
    },
    {
        ". During World War II, it was designed to divert Allied ": null
    },
    {
        "airstrikes": "Airstrike"
    },
    {
        " from the actual production site of the arms factory.     Krupp Industries employed workers conscripted by the Nazi regime from across Europe. These workers were initially paid, but as Nazi fortunes declined ": null
    },
    {
        "they were kept as slave workers": "Forced Labour Under German Rule During World War Ii"
    },
    {
        ". They were abused, beaten, and starved by the thousands, as detailed in the book  The Arms of Krupp . Nazi Germany kept two million French POWs captured in 1940 as forced laborers throughout the war. They added compulsory workers from occupied nations, especially in metal factories. The shortage of volunteers led the Vichy government of France to deport workers to Germany, where they constituted 15% of the labor force by August 1944. The largest number worked in the giant Krupp steel works in ": null
    },
    {
        "Essen": "Essen"
    },
    {
        ". Low pay, long hours, frequent bombings, and crowded air raid shelters added to the unpleasantness of poor housing, inadequate heating, limited food, and poor medical care, all compounded by harsh Nazi discipline. In an affidavit provided at the Nuremberg Trials following the war, Dr. Wilhelm Jaeger, the senior doctor for the Krupp slaves, wrote, Sanitary conditions were atrocious. At Kramerplatz only ten childrens toilets were available for 1200 inhabitants. . . Excretion contaminated the entire floors of these lavatories. The Tatars and Kirghiz suffered most; they collapsed like flies bad housing, the poor quality and insufficient quantity of food, overwork and insufficient rest. . . Countless fleas, bugs and other vermin tortured the inhabitants of these camps. . . Shirer, William L. The Rise and Fall of the Third Reich. New York: Simon and Schuster, Inc. 1959. pp. 949. The survivors finally returned home in the summer of 1945 after their liberation by the allied armies. Françoise Berger, Lexploitation de la Main-doeuvre Française dans lindustrie Siderurgique Allemande pendant la Seconde Guerre Mondiale, Revue Dhistoire Moderne et Contemporaine 503 pp 148-181     Krupp industries was ": null
    },
    {
        "prosecuted after the end of war": "Krupp Trial"
    },
    {
        " for its support to the ": null
    },
    {
        "Nazi regime": "Nazi Germany"
    },
    {
        " and use of forced labour.       Krupps trucks were once again produced after the war, but so as to minimize the negative wartime connotations of the Krupp name they were sold as Südwerke trucks from 1946 until 1954, when the Krupp name was considered rehabilitated.     Krupp Steel Works of Essen, Germany, manufactured the spherical pressure chamber of the dive vessel  Trieste , Prophetically, the 1870 novel ": null
    },
    {
        "Twenty Thousand Leagues Under the Sea": "Twenty Thousand Leagues Under The Sea"
    },
    {
        " remarks that Captain Nemos submarine was made of steel from Krupp of Prussia. the first vessel to take humans to the ": null
    },
    {
        "deepest known point": "Challenger Deep"
    },
    {
        " in the oceans, accomplished in 1960. This was a heavy duty replacement for the original pressure sphere and was manufactured in three finely machined sections: an equatorial ring and two hemispherical caps. The sphere weighed 13 tonnes in air with walls that were 12.7 centimetres thick.     Krupp Steel Works was also contracted in the mid-1960s to construct the ": null
    },
    {
        "Effelsberg 100-m Radio Telescope": "Effelsberg 100-M Radio Telescope"
    },
    {
        ", which, from 1972 to 2000 was the largest fully steerable ": null
    },
    {
        "radio telescope": "Radio Telescope"
    },
    {
        " in the world. Max Planck Institute for Radio Astronomy | Radio Telescope Effelsberg | History             Krupp was the first company to patent a seamless, reliable and strong enough railway tyre for rail freight. Krupp received original contracts in the United States and enjoyed a period of technological superiority while also contributing the majority of rail to the new continental railway system. Nearly all railroads were using Krupp rails, the New York Central, Illinois Central, Delaware and Hudson, Maine Central, Lake Shore and Michigan Southern, ": null
    },
    {
        "Bangor and Aroostook": "Bangor And Aroostook Railroad"
    },
    {
        ", Great Northern, Boston and Albany, Florida and East Coast, Texas and Pacific, Southern Pacific, and Mexican National. Manchester, pp. 67, 141              In 1893, a mechanical engineer by the name of ": null
    },
    {
        "Rudolf Diesel": "Rudolf Diesel"
    },
    {
        " approached Gustav with a patent for a new kind of internal combustion engine employing autoignition of the fuel . He also included his text Theorie und Konstruktion eines rationellen Wärmemotors . Four years later, the first 3-horsepower diesel engine was produced. Manchester, p. 199       The common English pronunciations are  or .  The common German pronunciations are  or . Thus the u is usually treated as ": null
    },
    {
        "short": "Vowel Length"
    },
    {
        " in both languages, corresponding logically with the doubled ": null
    },
    {
        "consonant": "Consonant"
    },
    {
        " that follows. A British documentary on the Krupp family and firm included footage of German-speakers of the 1930s who would have had speaking contact with the family, which attests the long , thus  or , rather than what would be the regular German ": null
    },
    {
        "spelling pronunciation": "Spelling Pronunciation"
    },
    {
        ",  or . The documentarys narration used the English  equivalent, . This would seem to indicate that the short u is a ": null
    },
    {
        "spelling pronunciation": "Spelling Pronunciation"
    },
    {
        ", but it is nonetheless the most common treatment.       ": null
    }
]