[
    {
        "     A laser is constructed from three principal parts:     An energy source ,   A gain medium or  laser medium , and   Two or more mirrors that form an  optical resonator .       The pump source is the part that provides energy to the ": null
    },
    {
        "laser": "Laser"
    },
    {
        " system. Examples of pump sources include electrical discharges, flashlamps, arc lamps, light from another laser, chemical reactions and even explosive devices. The type of pump source used principally depends on the gain medium, and this also determines how the energy is transmitted to the medium. A ": null
    },
    {
        "helium–neon laser": "Helium–Neon Laser"
    },
    {
        " uses an electrical discharge in the helium-neon gas mixture, a Nd:YAG laser uses either light focused from a ": null
    },
    {
        "xenon flash lamp": "Xenon Flash Lamp"
    },
    {
        " or ": null
    },
    {
        "diode lasers": "Laser Diode"
    },
    {
        ", and excimer lasers use a chemical reaction.       The gain medium is the major determining factor of the wavelength of operation, and other properties, of the laser. Gain media in different materials have linear spectra or wide spectra. Gain media with wide spectra allow tuning of the laser frequency. There are hundreds if not thousands of different gain media in which laser operation has been achieved . The gain medium is excited by the pump source to produce a ": null
    },
    {
        "population inversion": "Population Inversion"
    },
    {
        ", and it is in the gain medium where spontaneous and ": null
    },
    {
        "stimulated emission": "Stimulated Emission"
    },
    {
        " of photons takes place, leading to the phenomenon of optical gain, or amplification.     Examples of different gain media include:   Liquids, such as dye lasers. These are usually ": null
    },
    {
        "organic": "Organic Chemistry"
    },
    {
        " chemical ": null
    },
    {
        "solvents": "Solvents"
    },
    {
        ", such as ": null
    },
    {
        "methanol": "Methanol"
    },
    {
        ", ": null
    },
    {
        "ethanol": "Ethanol"
    },
    {
        " or ": null
    },
    {
        "ethylene glycol": "Ethylene Glycol"
    },
    {
        ", to which are added chemical dyes such as ": null
    },
    {
        "coumarin": "Coumarin"
    },
    {
        ", ": null
    },
    {
        "rhodamine": "Rhodamine"
    },
    {
        ", and ": null
    },
    {
        "fluorescein": "Fluorescein"
    },
    {
        ". The exact chemical configuration of the dye molecules determines the operation wavelength of the ": null
    },
    {
        "dye laser": "Dye Laser"
    },
    {
        ".   Gases, such as ": null
    },
    {
        "carbon dioxide": "Carbon Dioxide"
    },
    {
        ", ": null
    },
    {
        "argon": "Argon"
    },
    {
        ", ": null
    },
    {
        "krypton": "Krypton"
    },
    {
        " and mixtures such as ": null
    },
    {
        "helium": "Helium"
    },
    {
        " & ndash;": null
    },
    {
        "neon": "Neon"
    },
    {
        ". These lasers are often pumped by electrical discharge.   Solids, such as ": null
    },
    {
        "crystals": "Crystal"
    },
    {
        "and ": null
    },
    {
        "glass": "Glass"
    },
    {
        "es. The solid host materials are usually doped with an impurity such as ": null
    },
    {
        "chromium": "Chromium"
    },
    {
        ", ": null
    },
    {
        "neodymium": "Neodymium"
    },
    {
        ", ": null
    },
    {
        "erbium": "Erbium"
    },
    {
        " or ": null
    },
    {
        "titanium": "Titanium"
    },
    {
        " ion": "Ion"
    },
    {
        "s. Typical hosts include ": null
    },
    {
        "YAG": "Yag"
    },
    {
        " , YLF , ": null
    },
    {
        "sapphire": "Sapphire"
    },
    {
        " and various glasses. Examples of solid-state laser media include Nd:YAG, ": null
    },
    {
        "Ti:sapphire": "Ti-Sapphire Laser"
    },
    {
        ", Cr:sapphire , Cr:LiSAF , Er:YLF, Nd:glass, and Er:glass. Solid-state lasers are usually pumped by flashlamps or light from another laser.   ": null
    },
    {
        "Semiconductor": "Semiconductor"
    },
    {
        "s, a type of solid, crystal with uniform dopant distribution or material with differing dopant levels in which the movement of ": null
    },
    {
        "electrons": "Electron"
    },
    {
        " can cause laser action. Semiconductor lasers are typically very small, and can be pumped with a simple electric current, enabling them to be used in consumer devices such as ": null
    },
    {
        "compact disc": "Compact Disc"
    },
    {
        " players. See ": null
    },
    {
        "laser diode": "Laser Diode"
    },
    {
        ".          The optical resonator, or  optical cavity , in its simplest form is two parallel mirrors placed around the gain medium, which provide ": null
    },
    {
        "feedback": "Feedback"
    },
    {
        " of the light. The mirrors are given ": null
    },
    {
        "optical coatings": "Optical Coating"
    },
    {
        "which determine their reflective properties. Typically, one will be a ": null
    },
    {
        "high reflector": "Optical Coatinghigh-Reflection Coatings"
    },
    {
        ", and the other will be a ": null
    },
    {
        "partial reflector": "Partial Reflector"
    },
    {
        ". The latter is called the ": null
    },
    {
        "output coupler": "Output Coupler"
    },
    {
        ", because it allows some of the light to leave the cavity to produce the lasers output beam.     Light from the medium, produced by ": null
    },
    {
        "spontaneous emission": "Spontaneous Emission"
    },
    {
        ", is reflected by the mirrors back into the medium, where it may be amplified by ": null
    },
    {
        "stimulated emission": "Stimulated Emission"
    },
    {
        ". The light may reflect from the mirrors and thus pass through the gain medium many hundreds of times before exiting the cavity. In more complex lasers, configurations with four or more mirrors forming the cavity are used. The design and alignment of the mirrors with respect to the medium is crucial for determining the exact operating wavelength and other attributes of the laser system.     Other optical devices, such as spinning mirrors, modulators, filters, and absorbers, may be placed within the optical resonator to produce a variety of effects on the laser output, such as altering the wavelength of operation or the production of pulses of laser light.     Some lasers do not use an optical cavity, but instead rely on very high optical gain to produce significant ": null
    },
    {
        "amplified spontaneous emission": "Amplified Spontaneous Emission"
    },
    {
        " without needing feedback of the light back into the gain medium. Such lasers are said to be ": null
    },
    {
        "superluminescent": "Superluminescence"
    },
    {
        ", and emit light with low ": null
    },
    {
        "coherence": "Coherence"
    },
    {
        " but high ": null
    },
    {
        "bandwidth": "Bandwidth"
    }
]