[
    {
        "         Lavrentiy Pavlovich Beria  was a ": null
    },
    {
        "Soviet": "Soviet Union"
    },
    {
        " politician": "Politician"
    },
    {
        ", ": null
    },
    {
        "Marshal of the Soviet Union": "Marshal Of The Soviet Union"
    },
    {
        " and ": null
    },
    {
        "state security": "State Security"
    },
    {
        " administrator, chief of the Soviet security and ": null
    },
    {
        "secret police": "Secret Police"
    },
    {
        " apparatus  under ": null
    },
    {
        "Joseph Stalin": "Joseph Stalin"
    },
    {
        " during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", and promoted to deputy premier under Stalin from 1941. He later officially joined the ": null
    },
    {
        "Politburo": "Politburo Of The Communist Party Of The Soviet Union"
    },
    {
        " in 1946.     Beria was the longest-lived and most influential of Stalins secret police chiefs, wielding his most substantial influence during and after ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ". Following the ": null
    },
    {
        "Soviet invasion of Poland": "Soviet Invasion Of Poland"
    },
    {
        " in 1939 he was responsible for organizing the ": null
    },
    {
        "Katyn massacre": "Katyn Massacre"
    },
    {
        ".  He simultaneously administered vast sections of the Soviet state and acted as the de facto ": null
    },
    {
        "Marshal of the Soviet Union": "Marshal Of The Soviet Union"
    },
    {
        " in command of NKVD field units responsible for ": null
    },
    {
        "barrier troops": "Barrier Troops"
    },
    {
        " and ": null
    },
    {
        "Soviet partisan": "Soviet Partisan"
    },
    {
        " intelligence and sabotage operations on the ": null
    },
    {
        "Eastern Front": "Eastern Front"
    },
    {
        " during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ". Beria administered the vast expansion of the ": null
    },
    {
        "Gulag": "Gulag"
    },
    {
        " labor camps": "Labor Camps"
    },
    {
        " and was primarily responsible for overseeing the secret detention facilities for scientists and engineers known as  sharashka s.     He attended the ": null
    },
    {
        "Yalta Conference": "Yalta Conference"
    },
    {
        " with Stalin, who introduced him to U.S. President ": null
    },
    {
        "Franklin D. Roosevelt": "Franklin D. Roosevelt"
    },
    {
        " as our ": null
    },
    {
        "Himmler": "Heinrich Himmler"
    },
    {
        " . After the war, he organized the Communist takeover of the state institutions in ": null
    },
    {
        "Central Europe": "Central Europe"
    },
    {
        " and ": null
    },
    {
        "Eastern Europe": "Eastern Europe"
    },
    {
        " and political repressions in these countries. Berias uncompromising ruthlessness in his duties and skill at producing results culminated in his success in overseeing the ": null
    },
    {
        "Soviet atomic bomb project": "Soviet Atomic Bomb Project"
    },
    {
        ". Stalin gave it absolute priority and the project was completed in under five years.      After Stalins death in March 1953, Lavrentiy Beria became ": null
    },
    {
        "First Deputy Premier of the Soviet Union": "First Deputy Premier Of The Soviet Union"
    },
    {
        " and head of the ": null
    },
    {
        "Ministry of Internal Affairs": "Ministry Of Internal Affairs Of The Soviet Union"
    },
    {
        ". In this dual capacity, he formed a ": null
    },
    {
        "troika": "Triumvirate"
    },
    {
        " alongside ": null
    },
    {
        "Georgy Malenkov": "Georgy Malenkov"
    },
    {
        " and ": null
    },
    {
        "Vyacheslav Molotov": "Vyacheslav Molotov"
    },
    {
        " that briefly led the country in Stalins place. However, in a ": null
    },
    {
        "coup détat": "Coup Détat"
    },
    {
        " launched by ": null
    },
    {
        "Nikita Khrushchev": "Nikita Khrushchev"
    },
    {
        " with help from ": null
    },
    {
        "Marshal of the Soviet Union": "Marshal Of The Soviet Union"
    },
    {
        " Georgy Zhukov": "Georgy Zhukov"
    },
    {
        " in June 1953, Beria was ultimately removed from power and subsequently arrested on charges of 357 counts of rape and ": null
    },
    {
        "treason": "Treason"
    },
    {
        ". He was sentenced to death and was executed by ": null
    },
    {
        "Pavel Batitsky": "Pavel Batitsky"
    },
    {
        " on December 23, 1953.        Beria was born in ": null
    },
    {
        "Merkheuli": "Merkheuli"
    },
    {
        ", near ": null
    },
    {
        "Sukhumi": "Sukhumi"
    },
    {
        ", in the ": null
    },
    {
        "Sukhum Okrug": "Sukhum Okrug"
    },
    {
        " of the ": null
    },
    {
        "Kutais Governorate": "Kutais Governorate"
    },
    {
        " . He was from the ": null
    },
    {
        "Mingrelian": "Mingrelians"
    },
    {
        " ethnic group and grew up in a ": null
    },
    {
        "Georgian Orthodox": "Georgian Orthodox"
    },
    {
        " family.  Berias mother, Marta ": null
    },
    {
        "Jaqeli": "Jaqeli"
    },
    {
        " , was deeply religious and church-going . She was previously married and widowed before marrying Berias father, Pavel Khukhaevich Beria , a landowner from ": null
    },
    {
        "Abkhazia": "Abkhazia"
    },
    {
        ". Beria also had a brother , and a ": null
    },
    {
        "deaf": "Deaf"
    },
    {
        " sister named Anna.     In his autobiography, Lavrentiy Beria mentioned only his sister and his niece, implying that his brother was dead or had no relationship with Beria after he left Merkheuli. Beria attended a technical school in Sukhumi, and joined the ": null
    },
    {
        "Bolsheviks": "Bolshevik"
    },
    {
        "in March 1917 while a student in the ": null
    },
    {
        "Baku Polytechnicum": "Baku Polytechnicum"
    },
    {
        " . As a student, Beria distinguished himself in mathematics and the sciences. The Polytechnicums curriculum concentrated on the ": null
    },
    {
        "petroleum industry": "Petroleum Industry"
    },
    {
        ".     Beria also worked for the anti-Bolshevik ": null
    },
    {
        "Mussavatists": "Mussavatist"
    },
    {
        "in ": null
    },
    {
        "Baku": "Baku"
    },
    {
        ". After the ": null
    },
    {
        "Red Army": "Red Army"
    },
    {
        " captured the city on 28 April 1920, Beria was saved from execution because there was not enough time to arrange his shooting and replacement, and ": null
    },
    {
        "Sergei Kirov": "Sergei Kirov"
    },
    {
        " possibly intervened.  While in prison, he formed a connection with Nina Gegechkori  his cellmates niece, and they eloped on a train.  She was 17, a trained scientist from an aristocratic family.        In 1919, at the age of twenty, Beria started his career in ": null
    },
    {
        "state security": "State Security"
    },
    {
        " when the security service of the ": null
    },
    {
        "Azerbaijan Democratic Republic": "Azerbaijan Democratic Republic"
    },
    {
        " hired him while still a student at the Polytechnicum. In 1920 or 1921 Beria joined the ": null
    },
    {
        "Cheka": "Cheka"
    },
    {
        ", the original Bolshevik ": null
    },
    {
        "secret police": "Secret Police"
    },
    {
        ". At that time, a Bolshevik revolt took place in the ": null
    },
    {
        "Menshevik": "Menshevik"
    },
    {
        "-controlled ": null
    },
    {
        "Democratic Republic of Georgia": "Democratic Republic Of Georgia"
    },
    {
        ", and the Red Army subsequently ": null
    },
    {
        "invaded": "Red Army Invasion Of Georgia"
    },
    {
        ". The Cheka became heavily involved in the conflict, which resulted in the defeat of the Mensheviks and the formation of the ": null
    },
    {
        "Georgian SSR": "Georgian Soviet Socialist Republic"
    },
    {
        ". By 1922, Beria was deputy head of the Georgian branch of Chekas successor, the ": null
    },
    {
        "OGPU": "State Political Directorate"
    },
    {
        ".     In 1924, he led the repression of a ": null
    },
    {
        "Georgian nationalist uprising": "August Uprising"
    },
    {
        ", after which up to 10,000 people were executed. For this display of Bolshevik ruthlessness, Beria was appointed head of the secret-political division of the ": null
    },
    {
        "Transcaucasian": "South Caucasus"
    },
    {
        " OGPU and was awarded the ": null
    },
    {
        "Order of the Red Banner": "Order Of The Red Banner"
    },
    {
        ".     In 1926, Beria became head of the Georgian OGPU; ": null
    },
    {
        "Sergo Ordzhonikidze": "Sergo Ordzhonikidze"
    },
    {
        ", head of the Transcaucasian party, introduced him to fellow-Georgian Iosef Dzhughashvili, later known as ": null
    },
    {
        "Joseph Stalin": "Joseph Stalin"
    },
    {
        ". As a result, Beria became an ally in Stalins rise to power. During his years at the helm of the Georgian OGPU, Beria effectively destroyed the intelligence networks that ": null
    },
    {
        "Turkey": "Turkey"
    },
    {
        " and ": null
    },
    {
        "Iran": "Iran"
    },
    {
        " had developed in the Soviet Caucasus, while successfully penetrating the governments of these countries with his agents. He also took over Stalins holiday security.          Beria was appointed Secretary of the Communist Party in Georgia in 1931, and for the whole Transcaucasian region in 1932. He became a member of the ": null
    },
    {
        "Central Committee of the Communist Party of the Soviet Union": "Central Committee Of The Communist Party Of The Soviet Union"
    },
    {
        " in 1934. During this time, he began to attack fellow members of the Georgian Communist Party, particularly ": null
    },
    {
        "Gaioz Devdariani": "Gaioz Devdariani"
    },
    {
        ", who served as Minister of Education of the Georgian SSR. Beria ordered the executions of Devdarianis brothers George and Shalva, who held important positions in the Cheka and the Communist Party respectively.     He reportedly won Stalins favour in the early 1930s, after faking a conspiracy to assassinate the Soviet leader that he then claimed to have foiled. By 1935, Beria had become one of Stalins most trusted subordinates. He cemented his place in Stalins entourage with a lengthy oration titled, On the History of the Bolshevik Organisations in Transcaucasia , which emphasized Stalins role.When Stalins purge of the Communist Party and government began in 1934 after the assassination of ": null
    },
    {
        "Leningrad": "Leningrad"
    },
    {
        " party boss ": null
    },
    {
        "Sergei Kirov": "Sergei Kirov"
    },
    {
        " , Beria ran the purges in Transcaucasia. He used the opportunity to settle many old scores in the politically turbulent Transcaucasian republics.     In June 1937, he said in a speech, Let our enemies know that anyone who attempts to raise a hand against the will of our people, against the will of the party of ": null
    },
    {
        "Lenin": "Vladimir Lenin"
    },
    {
        " and Stalin, will be mercilessly crushed and destroyed.  cited by , biographical index, editor Vyacheslav Rumyantsev               In August 1938, Stalin brought Beria to Moscow as deputy head of the Peoples Commissariat for Internal Affairs , the ministry which oversaw the ": null
    },
    {
        "state security": "National Security"
    },
    {
        " and police forces. Under ": null
    },
    {
        "Nikolai Yezhov": "Nikolai Yezhov"
    },
    {
        ", the NKVD carried out the ": null
    },
    {
        "Great Purge": "Great Purge"
    },
    {
        "enemies of the people": "Enemy Of The People"
    },
    {
        ". By 1938, however, the oppression had become so extensive that it was damaging the infrastructure, economy and even the armed forces of the Soviet state, prompting Stalin to wind the purge down. Stalin had voted to appoint ": null
    },
    {
        "Georgy Malenkov": "Georgy Malenkov"
    },
    {
        " as head of the NKVD, but he was overruled. In September, Beria was appointed head of the Main Administration of State Security of the NKVD, and in November he succeeded Yezhov as NKVD head. Yezhov was executed in 1940 and one account says he was personally strangled by Beria.  The NKVD was purged next, with half of its personnel replaced by Beria loyalists, many of them from the ": null
    },
    {
        "Caucasus": "Caucasus"
    },
    {
        ".     Although Berias name is closely identified with the Great Purge because of his activities while deputy head of the NKVD, his leadership of the organisation marked an easing of the repression begun under Yezhov. Over 100,000 people were released from the labour camps. The government officially admitted that there had been some injustice and excesses during the purges, which were blamed entirely on Yezhov. The liberalisation was only relative: arrests and executions continued, and in 1940, as war approached, the pace of the purges again accelerated. During this period, Beria supervised deportations of people identified as political enemies from Poland and the ": null
    },
    {
        "Baltic states": "Baltic States"
    },
    {
        " after Soviet occupation of those regions.     In March 1939, Beria became a candidate member of the Communist Partys ": null
    },
    {
        "Politburo": "Politburo"
    },
    {
        ". Although he did not become a full member until 1946, he was already one of the senior leaders of the Soviet state. In 1941, Beria was made a Commissar General of State Security, the highest quasi-military rank within the Soviet police system of that time, effectively comparable to a ": null
    },
    {
        "Marshal of the Soviet Union": "Marshal Of The Soviet Union"
    },
    {
        ".     On 5 March 1940, after the ": null
    },
    {
        "Gestapo–NKVD Third Conference": "Gestapo–Nkvd Conferences"
    },
    {
        " was held in ": null
    },
    {
        "Zakopane": "Zakopane"
    },
    {
        ", Beria sent a note to Stalin in which he stated that the Polish prisoners of war kept at camps and prisons in western Belarus and Ukraine were enemies of the Soviet Union, and recommended their execution. Rotfeld, Adam Daniel; Torkunov, Anatoly. White Spots—Black Spots: Difficult Matters in Polish-Russian Relations, 1918–2008 . University of Pittsburgh Press, 2015 Most of them were military officers, but there were also intelligentsia, doctors, priests, and others in a total of 22,000 people. With Stalins approval, Berias NKVD executed them in what became known as the ": null
    },
    {
        "Katyn massacre": "Katyn Massacre"
    },
    {
        ".     From October 1940 to February 1942, the NKVD under Beria carried out a ": null
    },
    {
        "new purge": "Purge Of The Red Army In 1941"
    },
    {
        " of the Red Army and related industries. In February 1941, Beria became ": null
    },
    {
        "Deputy Chairman": "Deputy Premier Of The Soviet Union"
    },
    {
        " of the ": null
    },
    {
        "Council of Peoples Commissars": "Council Of Peoples Commissars"
    },
    {
        ", and in June, following ": null
    },
    {
        "Nazi Germanys invasion of the Soviet Union": "Operation Barbarossa"
    },
    {
        ", he became a member of the ": null
    },
    {
        "State Defense Committee": "State Defense Committee"
    },
    {
        " . During ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", he took on major domestic responsibilities and mobilized the millions of people imprisoned in NKVD Gulag camps into wartime production. He took control of the manufacture of armaments, and  aircraft and aircraft engines. This was the beginning of Berias alliance with Malenkov, which later became of central importance.     In 1944, as the Germans were driven from Soviet soil, Beria was in charge of dealing with the various ethnic minorities accused of anti-sovietism and/or collaboration with the invaders, including the ": null
    },
    {
        "Balkars": "Balkars"
    },
    {
        ", ": null
    },
    {
        "Karachays": "Karachays"
    },
    {
        ", ": null
    },
    {
        "Chechens": "Chechen People"
    },
    {
        ", ": null
    },
    {
        "Ingush": "Ingush People"
    },
    {
        ", ": null
    },
    {
        "Crimean Tatars": "Crimean Tatars"
    },
    {
        ", ": null
    },
    {
        "Kalmyks": "Kalmyks"
    },
    {
        ", ": null
    },
    {
        "Pontic Greeks": "Greeks In Kazakhstan"
    },
    {
        ", and ": null
    },
    {
        "Volga Germans": "Volga Germans"
    },
    {
        ".  All these groups were deported to ": null
    },
    {
        "Soviet Central Asia": "Soviet Central Asia"
    },
    {
        "      In December 1944, Berias NKVD was assigned to supervise the ": null
    },
    {
        "Soviet atomic bomb project": "Soviet Atomic Bomb Project"
    },
    {
        " , which built and tested a bomb by 29 August 1949. The project was extremely labour-intensive. At least 330,000 people, including 10,000 technicians, were involved. The ": null
    },
    {
        "Gulag": "Gulag"
    },
    {
        " system provided tens of thousands of people for work in ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        " mines and for the construction and operation of uranium processing plants. They also constructed test facilities, such as those at ": null
    },
    {
        "Semipalatinsk": "Semipalatinsk Test Site"
    },
    {
        " and in the ": null
    },
    {
        "Novaya Zemlya": "Novaya Zemlya"
    },
    {
        " archipelago. The NKVD also ensured the necessary security for the project.     In July 1945, as Soviet police ranks were converted to a military uniform system, Berias rank was officially converted to that of ": null
    },
    {
        "Marshal of the Soviet Union": "Marshal Of The Soviet Union"
    },
    {
        ". Although he had never held a traditional military command, Beria made a significant contribution to the victory of the Soviet Union in World War II through his organization of wartime production and his use of partisans. Stalin personally never thought much of it, and neither commented publicly on his performance nor awarded him recognition , as he did for most other Soviet Marshals.     Abroad, Beria had met with ": null
    },
    {
        "Kim Il-sung": "Kim Il-Sung"
    },
    {
        ", the future leader of ": null
    },
    {
        "North Korea": "North Korea"
    },
    {
        ", several times when the Soviet troops had declared war on Japan and occupied the northern half of Korea from August 1945. Beria recommended that Stalin install a communist leader in the occupied territories.                 With Stalin nearing 70, a concealed struggle for succession amongst his entourage dominated Kremlin politics in the post-war years. At the end of the war, ": null
    },
    {
        "Andrei Zhdanov": "Andrei Zhdanov"
    },
    {
        " seemed the most likely candidate. Zhdanov had served as the Communist Party leader in Leningrad during the war, and by 1946 had charge of all cultural matters. After 1946, Beria formed an alliance with Malenkov to counter Zhdanovs rise.     In January 1946, Beria resigned as chief of the NKVD while retaining general control over national security matters as Deputy Prime Minister and Curator of the Organs of State Security under Stalin. However, the new NKVD chief, ": null
    },
    {
        "Sergei Kruglov": "Sergei Kruglov"
    },
    {
        ", was not a Beria man. Also, by the summer of 1946, Berias man ": null
    },
    {
        "Vsevolod Nikolayevich Merkulov": "Vsevolod Nikolayevich Merkulov"
    },
    {
        " was replaced as head of the ": null
    },
    {
        "Ministry for State Security ": "Ministry For State Security"
    },
    {
        " by ": null
    },
    {
        "Viktor Abakumov": "Viktor Semyonovich Abakumov"
    },
    {
        ". Abakumov had headed ": null
    },
    {
        "SMERSH": "Smersh"
    },
    {
        " from 1943 to 1946; his relationship with Beria involved close collaboration , but also rivalry. Stalin had begun to encourage Abakumov to form his own network inside the MGB to counter Berias dominance of the power ministries. Parrish, 1996 Kruglov and Abakumov moved expeditiously to replace Berias men in the security apparatus leadership with new people. Very soon, Deputy Minister Stepan Mamulov of the Soviet Ministry of Internal Affairs was the only close Beria ally left outside foreign intelligence, on which Beria kept a grip. In the following months, Abakumov started carrying out important operations without consulting Beria, often working in tandem with Zhdanov, and on Stalins direct orders. These operations were aimed by Stalin—initially tangentially, but with time more directly–at Beria.     One of the first such moves involved the ": null
    },
    {
        "Jewish Anti-Fascist Committee": "Jewish Anti-Fascist Committee"
    },
    {
        " affair, which commenced in October 1946 and eventually led to the murder of ": null
    },
    {
        "Solomon Mikhoels": "Solomon Mikhoels"
    },
    {
        " and the arrest of many other members. This affair damaged Beria; not only had he championed the creation of the committee in 1942, but his own entourage included a substantial number of Jews. ": null
    },
    {
        "citation needed": "Citation Needed"
    },
    {
        "     After Zhdanov died suddenly in August 1948, Beria and Malenkov consolidated their power by means of a purge of Zhdanovs associates in the so-called ": null
    },
    {
        "Leningrad Affair": "Leningrad Affair"
    },
    {
        " . Those executed included Zhdanovs deputy, ": null
    },
    {
        "Alexey Kuznetsov": "Alexey Kuznetsov"
    },
    {
        "; the economic chief, ": null
    },
    {
        "Nikolai Voznesensky": "Nikolai Voznesensky"
    },
    {
        "; the Party head in Leningrad, Pyotr Popkov; and the Prime Minister of the ": null
    },
    {
        "Russian Republic": "Russian Soviet Federative Socialist Republic"
    },
    {
        ", ": null
    },
    {
        "Mikhail Rodionov": "Mikhail Rodionov"
    },
    {
        ".     During the postwar years, Beria supervised installation of Communist regimes in the countries of ": null
    },
    {
        "Eastern Europe": "Eastern Europe"
    },
    {
        " and hand-picked the Soviet-backed leaders.  Starting in 1948, Abakumov initiated several investigations against these leaders, which culminated with the arrest in November 1951 of ": null
    },
    {
        "Rudolf Slánský": "Rudolf Slánský"
    },
    {
        ", ": null
    },
    {
        "Bedřich Geminder": "Bedřich Geminder"
    },
    {
        ", and others in ": null
    },
    {
        "Czechoslovakia": "Czechoslovakia"
    },
    {
        ". These men were frequently accused of ": null
    },
    {
        "Zionism": "Zionism"
    },
    {
        ", ": null
    },
    {
        "rootless cosmopolitan": "Rootless Cosmopolitan"
    },
    {
        "ism , and providing weapons to ": null
    },
    {
        "Israel": "Israel"
    },
    {
        ". Such charges deeply disturbed Beria, as he had directly ordered the sale of large amounts of Czech arms to Israel. Altogether, 14 Czechoslovak Communist leaders, 11 of them Jewish, were tried, convicted, and executed . Similar investigations in Poland and other Soviet satellite countries occurred at the same time.     In 1951, Abakumov was replaced by ": null
    },
    {
        "Semyon Ignatyev": "Semyon Ignatyev"
    },
    {
        ", who further intensified the anti-Semitic campaign. On 13 January 1953, the biggest anti-semitic affair in the Soviet Union started with an article in  Pravda  – it began what became known as the ": null
    },
    {
        "Doctors plot": "Doctors Plot"
    },
    {
        ", in which a number of the countrys prominent Jewish physicians were accused of poisoning top Soviet leaders and arrested. Concurrently, the Soviet press began an anti-semitic propaganda campaign, euphemistically termed the struggle against rootless cosmopolitanism . Initially, 37 men were arrested, but the number quickly grew into hundreds. Scores of Soviet Jews were dismissed from their jobs, arrested, sent to the Gulag, or executed. The Doctors plot was presumably invented by Stalin as an excuse to dismiss Beria and replace him with Ignatiev or some other MGB functionary. A few days after Stalins death on 5 March 1953, Beria freed all the arrested doctors, announced that the entire matter was fabricated, and arrested the MGB functionaries directly involved.     In other international issues, Beria  correctly foresaw the victory of ": null
    },
    {
        "Mao Zedong": "Mao Zedong"
    },
    {
        " in the ": null
    },
    {
        "Chinese Civil War": "Chinese Civil War"
    },
    {
        " and greatly helped the ": null
    },
    {
        "Chinese Communists": "Communist Party Of China"
    },
    {
        " by letting them use Soviet-occupied ": null
    },
    {
        "Manchuria": "Manchuria"
    },
    {
        " as a staging area and arranging large weapons shipments to the ": null
    },
    {
        "Peoples Liberation Army": "Peoples Liberation Army"
    },
    {
        ", mainly from the recently captured equipment of the Japanese ": null
    },
    {
        "Kwantung Army": "Kwantung Army"
    },
    {
        ". Chang and Halliday, 2005        At Berias trial in 1953, it became known that he had committed numerous ": null
    },
    {
        "rapes": "Rape"
    },
    {
        "during the years he was NKVD chief.  ": null
    },
    {
        "Simon Sebag-Montefiore": "Simon Sebag-Montefiore"
    },
    {
        ", a biographer of Stalin, concluded the information reveals a sexual predator who used his power to indulge himself in obsessive depravity.  After his death, charges of sexual abuse and rape were disputed by people close to him including his wife Nina and his son Sergo.      His case files in the Soviet archives contained the official testimony from Colonel ": null
    },
    {
        "Rafael Semyonovich Sarkisov": "Rafael Semyonovich Sarkisov"
    },
    {
        " and Colonel Sardion Nikolaevich Nadaraia, two of Berias most senior NKVD bodyguards. They stated that, on warm nights during the war years, Beria was often driven slowly through the streets of Moscow in his armored ": null
    },
    {
        "Packard": "Packard"
    },
    {
        " limousine. He would point out young women to be detained and escorted to his mansion, where wine and a feast awaited them. After dining, Beria would take the women into his soundproofed office and rape them. Berias bodyguards reported that their duties included handing each victim a flower bouquet as she left Berias house. Accepting it implied that the sex had been consensual; refusal would mean arrest. In one incident, his chief bodyguard, Sarkisov, reported that a woman who had been brought to Beria rejected his advances and ran out of his office; Sarkisov mistakenly handed her the flowers anyway, prompting the enraged Beria to declare, Now its not a bouquet, its a wreath! May it rot on your grave! The NKVD arrested the woman the next day.     Women also submitted to Berias sexual advances in exchange for the promise of freeing their relatives from the Gulag. In one case, Beria picked up ": null
    },
    {
        "Tatiana Okunevskaya": "Tatiana Okunevskaya"
    },
    {
        ", a well-known Soviet actress, under the pretence of bringing her to perform for the ": null
    },
    {
        "Politburo": "Politburo"
    },
    {
        ". Instead he took her to his dacha, where he offered to free her father and grandmother from NKVD prison if she submitted. He then raped her, telling her: Scream or not, it doesnt matter.  Beria, however, already knew that her relatives had been executed months earlier. Okunevskaya was arrested shortly afterwards and sentenced to ": null
    },
    {
        "solitary confinement": "Solitary Confinement"
    },
    {
        " in the Gulag, which she survived.     Berias sexually predatory nature was well known to the Politburo, and though Stalin took an indulgent viewpoint , he said, I dont trust Beria. In one instance, when Stalin learned his daughter ": null
    },
    {
        "Svetlana": "Svetlana Stalin"
    },
    {
        " was alone with Beria at his house, he telephoned her and told her to leave immediately. When Beria complimented ": null
    },
    {
        "Alexander Poskrebyshevs": "Alexander Poskrebyshev"
    },
    {
        "daughter on her beauty, Poskrebyshev quickly pulled her aside and instructed her, Dont ever accept a lift from Beria.  After taking an interest in Marshal ": null
    },
    {
        "Kliment Voroshilovs": "Kliment Voroshilov"
    },
    {
        "daughter-in-law during a party at their summer dacha, Beria shadowed their car closely all the way back to the Kremlin, terrifying Voroshilovs wife.     Prior to and during the war, Beria directed Sarkisov to keep a running list of the names and phone numbers of his sexual encounters. Eventually, he ordered Sarkisov to destroy the list as a security risk, but the colonel retained a secret handwritten copy. When Berias fall from power began, Sarkisov passed the list to ": null
    },
    {
        "Viktor Abakumov": "Viktor Abakumov"
    },
    {
        ", the former wartime head of ": null
    },
    {
        "SMERSH": "Smersh"
    },
    {
        " and now chief of the ": null
    },
    {
        "MGB": "Ministry For State Security"
    },
    {
        " – the successor to the NKVD. Abakumov was already aggressively building a case against Beria. Stalin, who was also seeking to undermine Beria, was thrilled by the detailed records kept by Sarkisov, demanding: Send me everything this asshole writes down!  Sarkisov reported that Berias sexual appetite had led to him contracting ": null
    },
    {
        "syphilis": "Syphilis"
    },
    {
        " during the war, for which he was secretly treated without the knowledge of Stalin or the Politburo . Although the Russian government acknowledged Sarkisovs handwritten list of Berias victims on 17 January 2003, the victims names will not be released until 2028.     Evidence suggests that not only did Beria abduct and rape women, but that some were also murdered. His villa in Moscow is now the Tunisian Embassy . In the mid 1990s, routine work in the grounds turned up the skeletal remains of several young women buried in the gardens.  According to ": null
    },
    {
        "Martin Sixsmith": "Martin Sixsmith"
    },
    {
        ", in a ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " documentary, Beria spent his nights having teenagers abducted from the streets and brought here for him to rape. Those who resisted were strangled and buried in his wifes rose garden.      The testimony of Sarkisov and Nadaraia has been partially corroborated by Edward Ellis Smith, an American who served in the U.S. embassy in Moscow after the war. According to historian ": null
    },
    {
        "Amy Knight": "Amy Knight"
    },
    {
        ", Smith noted that Berias escapades were common knowledge among embassy personnel because his house was on the same street as a residence for Americans, and those who lived there saw girls brought to Berias house late at night in a limousine.        Khrushchev wrote in his memoirs that Beria had, immediately after Stalins stroke, gone about spewing hatred against and mocking him. When Stalin showed signs of consciousness, Beria dropped to his knees and kissed his hand. When Stalin fell unconscious again, Beria immediately stood and spat.     Stalins aide Vasili Lozgachev reported that Beria and Malenkov were the first members of the Politburo to see Stalins condition when he was found unconscious. They arrived at Stalins dacha at Kuntsevo at 03:00 on 2 March, after being called by Khrushchev and Bulganin. The latter two did not want to risk Stalins wrath by checking themselves. Lozgachev tried in futility to explain to Beria that the then-unconscious Stalin was sick and needed medical attention. Beria angrily dismissed his claims as panic-mongering and quickly left, ordering him, Dont bother us, dont cause a panic and dont disturb Comrade Stalin!  Calling a doctor was deferred for a full 12 hours after Stalin was rendered paralyzed, incontinent, and unable to speak. This decision is noted as extraordinary by the historian Simon Sebag-Montefiore, but also consistent with the standard Stalinist policy of deferring all decision-making without official orders from higher authority.     Berias decision to avoid immediately calling a doctor was tacitly supported by the rest of the Politburo, which was rudderless without Stalins micromanagement and paralyzed by a legitimate fear he would suddenly recover and wreak violent reprisal on anyone who had dared to act without his orders. Stalins suspicion of doctors in the wake of the ": null
    },
    {
        "Doctors Plot": "Doctors Plot"
    },
    {
        " was well known. At the time of his sickness, his private physician was already being tortured in the basement of the ": null
    },
    {
        "Lubyanka": "Lubyanka Building"
    },
    {
        " for suggesting the leader required more bed rest.     After Stalins death, Beria claimed to have killed him. This aborted a final purge of ": null
    },
    {
        "Old Bolsheviks": "Old Bolsheviks"
    },
    {
        " Mikoyan": "Anastas Mikoyan"
    },
    {
        " and ": null
    },
    {
        "Molotov": "Vyacheslav Molotov"
    },
    {
        ", for which Stalin had been laying the groundwork in the year prior to his death. Shortly after Stalins death, Beria announced triumphantly to the Politburo that he had done in and saved all , according to Molotovs memoirs. The assertion that Stalin was poisoned  by Berias associates has been supported by ": null
    },
    {
        "Edvard Radzinsky": "Edvard Radzinsky"
    },
    {
        " and other authors.  Faria, Miguel A.   Surg Neurol Int 2011, 2:161.     After Stalins death, Berias ambitions sprang into full force. In the uneasy silence following the cessation of Stalins last agonies, Beria was the first to dart forward to kiss his lifeless form . While the rest of Stalins inner circle stood sobbing unashamedly over the body, Beria reportedly appeared radiant , regenerated , and glistening with ill-concealed relish.  When Beria left the room, he broke the somber atmosphere by shouting loudly for his driver, his voice echoing with what Stalins daughter ": null
    },
    {
        "Svetlana Alliluyeva": "Svetlana Alliluyeva"
    },
    {
        " called the ring of triumph unconcealed. Alliluyeva noticed how the Politburo seemed openly frightened of Beria and unnerved by his bold display of ambition. Hes off to take power, Mikoyan recalled muttering to Khrushchev. That prompted a frantic dash for their own limousines to intercept him at the Kremlin.       After Stalins death, Beria was appointed ": null
    },
    {
        "First Deputy Premier": "First Deputy Premier Of The Soviet Union"
    },
    {
        " and reappointed head of the ": null
    },
    {
        "MVD": "Ministry Of Internal Affairs"
    },
    {
        ", which he merged with the MGB. His close ally Malenkov was the new ": null
    },
    {
        "Prime Minister": "Premier Of The Soviet Union"
    },
    {
        " and initially the most powerful man in the post-Stalin leadership. Beria was second most powerful, and given Malenkovs personal weakness, was poised to become the power behind the throne and ultimately leader himself. Khrushchev became Party Secretary. ": null
    },
    {
        "Voroshilov": "Kliment Voroshilov"
    },
    {
        " became Chairman of the ": null
    },
    {
        "Presidium of the Supreme Soviet": "Presidium Of The Supreme Soviet"
    },
    {
        " .     Beria undertook some measures of liberalization immediately after Stalins death. He reorganized the MVD and drastically reduced its economic power and penal responsibilities. A number of costly construction projects such as the ": null
    },
    {
        "Salekhard–Igarka Railway": "Salekhard–Igarka Railway"
    },
    {
        " were scrapped, and the remaining industrial enterprises became affiliated under corresponding economic ministries. The Gulag system was transferred to the ": null
    },
    {
        "Ministry of Justice": "Ministry Of Justice"
    },
    {
        ", and a mass release of over a million prisoners, almost half of the Gulag personnel, was announced, although political prisoners were excluded. The amnesty, however, led to a substantial increase in crime and would later be used against Beria by his rivals.       In an attempt to consolidate power, Beria also took steps to recognize the rights of non-Russian nationalities. He questioned the traditional policy of Russification and encouraged local officials to assert their own identities. He first turned to Georgia, where Stalins fabricated ": null
    },
    {
        "Mingrelian affair": "Mingrelian Affair"
    },
    {
        " was called off and the republics key posts were replaced by pro-Beria Georgians. Yet Berias policies in Ukraine alarmed Khrushchev, for whom Ukraine was a power base. Khrushchev then tried to draw Malenkov to his side, warning that Beria is sharpening his knives .     Khrushchev opposed the alliance between Beria and Malenkov, but he was initially unable to challenge them. Khrushchevs opportunity came in June 1953 when a spontaneous ": null
    },
    {
        "uprising": "Uprising Of 1953 In East Germany"
    },
    {
        " against the East German Communist regime broke out in ": null
    },
    {
        "East Berlin": "East Berlin"
    },
    {
        ". Based on Berias own statements, other leaders suspected that in the wake of the uprising, he might be willing to trade the reunification of Germany and the end of the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        " for massive aid from the United States, as had been received in World War II. The cost of the war still weighed heavily on the Soviet economy. Beria craved the vast financial resources that another relationship with the United States could provide. For example, Beria gave ": null
    },
    {
        "Estonia": "Estonia"
    },
    {
        ", ": null
    },
    {
        "Latvia": "Latvia"
    },
    {
        " and ": null
    },
    {
        "Lithuania": "Lithuania"
    },
    {
        " serious prospects of national autonomy, possibly similarly to other Soviet ": null
    },
    {
        "satellite states": "Satellite State"
    },
    {
        "in Europe.    Regarding East Germany Beria said, Its not even a real state but one kept in being only by Soviet troops.      The ": null
    },
    {
        "East German uprising": "Uprising Of 1953 In East Germany"
    },
    {
        " convinced ": null
    },
    {
        "Molotov": "Vyacheslav Molotov"
    },
    {
        ", Malenkov, and ": null
    },
    {
        "Nikolai Bulganin": "Nikolai Bulganin"
    },
    {
        " that Berias policies were dangerous and destabilizing to Soviet power. Within days of the events in Germany, Khrushchev persuaded the other leaders to support a Party  coup  against Beria; Berias principal ally Malenkov abandoned him.       On 26 June 1953, Beria was arrested and held in an undisclosed location near Moscow. Accounts of Berias fall vary considerably. By the most likely account, Khrushchev prepared an elaborate ambush, convening a meeting of the Presidium on 26 June, where he suddenly launched a scathing attack on Beria, accusing him of being a traitor and spy in the pay of British intelligence. Beria was taken completely by surprise. He asked, Whats going on, Nikita Sergeyevich? Why are you picking fleas in my trousers? Molotov and others quickly spoke against Beria one after the other, followed by a motion by Khrushchev for his instant dismissal.     When Beria finally realized what was happening and plaintively appealed to Malenkov to speak for him, his old friend and crony silently hung his head and refused to meet his gaze. Malenkov pressed a button on his desk as the pre-arranged signal to Marshal ": null
    },
    {
        "Georgy Zhukov": "Georgy Zhukov"
    },
    {
        " and a group of armed officers in a nearby room who burst in and arrested Beria. This fits an account related in      Beria was taken first to the Moscow ": null
    },
    {
        "guardhouse": "Military Prison"
    },
    {
        " and then to the ": null
    },
    {
        "bunker": "Bunker"
    },
    {
        " of the headquarters of ": null
    },
    {
        "Moscow Military District": "Moscow Military District"
    },
    {
        ". Defence Minister Nikolai Bulganin ordered the ": null
    },
    {
        "Kantemirovskaya Tank Division": "4Th Guards Kantemirovskaya Tank Division"
    },
    {
        " and ": null
    },
    {
        "Tamanskaya Motor Rifle Division": "2Nd Guards Tamanskaya Motor Rifle Division"
    },
    {
        " to move into Moscow to prevent security forces loyal to Beria from rescuing him. Many of Berias subordinates, proteges and associates were also arrested, among them ": null
    },
    {
        "Vsevolod Merkulov": "Vsevolod Merkulov"
    },
    {
        ", ": null
    },
    {
        "Bogdan Kobulov": "Bogdan Kobulov"
    },
    {
        ", ": null
    },
    {
        "Sergey Goglidze": "Sergo Goglidze"
    },
    {
        ", ": null
    },
    {
        "Vladimir Dekanozov": "Vladimir Dekanozov"
    },
    {
        ", Pavel Meshik, and Lev Vlodzimirskiy.  Pravda  did not announce Berias arrest until 10 July, crediting it to Malenkov and referring to Berias criminal activities against the Party and the State.     Beria and the others were tried by a special court presence  of the ": null
    },
    {
        "Supreme Court of the Soviet Union": "Supreme Court Of The Soviet Union"
    },
    {
        " on 23 December 1953 with no defense counsel and no right of appeal. Marshal ": null
    },
    {
        "Ivan Konev": "Ivan Konev"
    },
    {
        " was the chairman of the court.     Beria was found guilty of:   ": null
    },
    {
        "Treason": "Treason"
    },
    {
        ". It was alleged that he had maintained secret connections with foreign intelligence services. In particular, attempts to initiate peace talks with ": null
    },
    {
        "Hitler": "Adolf Hitler"
    },
    {
        " in 1941 through the ambassador of the ": null
    },
    {
        "Kingdom of Bulgaria": "Kingdom Of Bulgaria"
    },
    {
        " were classified as treason, though Beria had been acting on the orders of Stalin and Molotov. It was also alleged that Beria, who in 1942 helped organize ": null
    },
    {
        "the defense of the North Caucasus": "Battle Of The Caucasus"
    },
    {
        ", tried to let the Germans occupy the Caucasus. Berias suggestion to his assistants that to improve foreign relations it was reasonable to transfer the ": null
    },
    {
        "Kaliningrad Oblast": "Kaliningrad Oblast"
    },
    {
        " to Germany, ": null
    },
    {
        "part of Karelia": "Karelian Question In Finnish Politics"
    },
    {
        " to Finland, the ": null
    },
    {
        "Moldavian Soviet Socialist Republic": "Moldavian Soviet Socialist Republic"
    },
    {
        " to ": null
    },
    {
        "Romania": "Communist Romania"
    },
    {
        " and the ": null
    },
    {
        "Kuril Islands": "Kuril Islands"
    },
    {
        " to ": null
    },
    {
        "Japan": "Japan"
    },
    {
        " also formed part of the allegations against him.   ": null
    },
    {
        "Terrorism": "Terrorism"
    },
    {
        ". Berias participation in the ": null
    },
    {
        "Purge of the Red Army in 1941": "Purge Of The Red Army In 1941"
    },
    {
        " was classified as an act of terrorism.   Counter-revolutionary activity during the ": null
    },
    {
        "Russian Civil War": "Russian Civil War"
    },
    {
        ". In 1919 Beria worked in the security service of the ": null
    },
    {
        "Azerbaijan Democratic Republic": "Azerbaijan Democratic Republic"
    },
    {
        ". Beria maintained that he was assigned to that work by the ": null
    },
    {
        "Hummet": "Muslim Social Democratic Party"
    },
    {
        " party, which subsequently merged with the Adalat Party, the ": null
    },
    {
        "Ahrar Party": "Ahrar Party"
    },
    {
        ", and the ": null
    },
    {
        "Baku": "Baku"
    },
    {
        " Bolsheviks to establish the ": null
    },
    {
        "Azerbaijan Communist Party": "Azerbaijan Communist Party"
    },
    {
        ".     Beria and all the other defendants were sentenced to death on 23 December 1953. When the death sentence was carried out, Beria allegedly pleaded on his knees for mercy before collapsing to the floor and wailing and crying, but to no avail.  The other six defendants were executed by firing squad on the same day the trial ended.  Beria was executed separately. He was shot through the forehead by General ": null
    },
    {
        "Pavel Batitsky": "Pavel Batitsky"
    },
    {
        " who had to stuff a rag into Berias mouth to silence him. His final moments bore great similarity to those of his own predecessor, NKVD Chief ": null
    },
    {
        "Nikolai Yezhov": "Nikolai Yezhov"
    },
    {
        ", who begged for his life before his execution in 1940.  Berias body was subsequently cremated and the remains buried in a forest near Moscow.         ": null
    },
    {
        "Muhsin al-Shargabi": "South Yemen"
    },
    {
        ", head of the ": null
    },
    {
        "East German": "East German"
    },
    {
        "-trained internal security apparatus in Marxist ": null
    },
    {
        "South Yemen": "South Yemen"
    },
    {
        ", played a major role in establishing the police deep state in ": null
    },
    {
        "Aden": "Aden"
    },
    {
        " and had earned for himself the reputation of being the “Beria of South Yemen . He is suspected of playing a major role in the unrest in Aden.        Beria is the central character in Good Night, Uncle Joe by Canadian playwright David Elendune. The play is a fictionalised account of the events leading up to Stalins death.        Georgian film director ": null
    },
    {
        "Tengiz Abuladze": "Tengiz Abuladze"
    },
    {
        " based the character of dictator Varlam Aravidze on Beria in his 1984 film  Repentance . Although banned in the Soviet Union for its semi-allegorical critique of ": null
    },
    {
        "Stalinism": "Stalinism"
    },
    {
        ", it premiered at the ": null
    },
    {
        "1987 Cannes Film Festival": "1987 Cannes Film Festival"
    },
    {
        ", winning the ": null
    },
    {
        "FIPRESCI": "Fipresci"
    },
    {
        " Prize, ": null
    },
    {
        "Grand Prize of the Jury": "Grand Prix"
    },
    {
        ", and the ": null
    },
    {
        "Prize of the Ecumenical Jury": "Prize Of The Ecumenical Jury"
    },
    {
        ".      British actor ": null
    },
    {
        "Bob Hoskins": "Bob Hoskins"
    },
    {
        " played Beria in the 1991 film  Inner Circle . He was portrayed by ": null
    },
    {
        "Roshan Seth": "Roshan Seth"
    },
    {
        " in the 1992 film  Stalin  and, with an Irish accent, by ": null
    },
    {
        "David Suchet": "David Suchet"
    },
    {
        " in  Red Monarch .     ": null
    },
    {
        "Simon Russell Beale": "Simon Russell Beale"
    },
    {
        " played Beria in the 2017 satirical film  The Death of Stalin .        In the 1958 ": null
    },
    {
        "CBS": "Cbs"
    },
    {
        " production of The Plot to Kill Stalin for ": null
    },
    {
        "Playhouse 90": "Playhouse 90"
    },
    {
        ", Beria was portrayed by ": null
    },
    {
        "E. G. Marshall": "E. G. Marshall"
    },
    {
        ".     Beria appears in the third episode of the four-part 2007 BBC docudrama series  Nuclear Secrets , played by ": null
    },
    {
        "Boris Isarov": "Boris Isarov"
    },
    {
        ". In the 2008 BBC documentary series  World War II: Behind Closed Doors , Beria was portrayed by Polish actor .     He was also an important character in the 2013 Russian mini-series Kill Stalin, produced by Star Media.       ": null
    },
    {
        "Richard Condons": "Richard Condon"
    },
    {
        "1959 novel  The Manchurian Candidate  describes brainwashed Raymond Shaw, the perfectly prefabricated assassin, as this dream by Lavrenti Beria.     In the 1964 science fiction novel by Arkady and Boris Strugatsky,  Hard to Be a God , Beria is personified in the character Don Reba who serves as the kings minister of defence.     At the opening of ": null
    },
    {
        "Kingsley Amis": "Kingsley Amis"
    },
    {
        "  The Alteration , Lavrentiy Beria figures as Monsignor Laurentius , paired with the similarly black-clad cleric Monsignor Henricus of the Holy Office ; the one to whom Beria was compared by Stalin in our own timeline: ": null
    },
    {
        "Heinrich Himmler": "Heinrich Himmler"
    },
    {
        ". In the novel, both men are on the same side, serving an alternate-world Catholic Empire.     Beria is a significant character in the ": null
    },
    {
        "alternate history": "Alternate History"
    },
    {
        "/": null
    },
    {
        "alien invasion": "Alien Invasion"
    },
    {
        " novel series ": null
    },
    {
        "Worldwar": "Worldwar"
    },
    {
        " by ": null
    },
    {
        "Harry Turtledove": "Harry Turtledove"
    },
    {
        " as well as the  Axis of Time  series by ": null
    },
    {
        "John Birmingham": "John Birmingham"
    },
    {
        "     In the 1981 novel ": null
    },
    {
        "Noble House": "Noble House"
    },
    {
        " by ": null
    },
    {
        "James Clavell": "James Clavell"
    },
    {
        " set in 1963 ": null
    },
    {
        "Hong Kong": "Hong Kong"
    },
    {
        ", the main character Ian Dunross received from Alan Medford Grant a set of secret documents regarding a Soviet spy-ring in Hong Kong code-named Sevrin . The document was signed by an LB, believed by Grant to be Lavrentiy Beria .     Beria is a significant character in the opening chapters of the 1998 novel ": null
    },
    {
        "Archangel": "Archangel"
    },
    {
        " by British novelist ": null
    },
    {
        "Robert Harris": "Robert Harris"
    },
    {
        ".     Beria is a minor character in the 2009 novel  The Hundred-Year-Old Man Who Climbed Out the Window and Disappeared  by ": null
    },
    {
        "Jonas Jonasson": "Jonas Jonasson"
    },
    {
        ". Beria is described as the boss of the Soviet states security and is in attendance at a meal with the main character and Stalin. The 100-year-Old Man Who Climbed Out the Window and Disappeared, Jonas Jonasson, 2009. Piratförlaget, Sweden. English translation by Rod Bradbury, 2012. Harper Collins Publishers Ltd., Canada.     In 2012, his alleged personal diary from 1938 to 1953 was published in Russia. ": null
    }
]