[
    {
        "        In ": null
    },
    {
        "logic": "Logic"
    },
    {
        ", the law of non-contradiction   states that contradictory propositions cannot both be true in the same sense at the same time, e. g. the two propositions A is B and A is not B are mutually exclusive. ": null
    },
    {
        "Formally": "Logical Form"
    },
    {
        " this is expressed as the ": null
    },
    {
        "tautology": "Tautology"
    },
    {
        " ¬.     One reason to have this law is the ": null
    },
    {
        "principle of explosion": "Principle Of Explosion"
    },
    {
        ", which states that anything follows from a contradiction. The law is employed in a ": null
    },
    {
        "reductio ad absurdum": "Reductio Ad Absurdum"
    },
    {
        " proof.     To express the fact that the law is tenseless and to avoid ": null
    },
    {
        "equivocation": "Equivocation"
    },
    {
        ", sometimes the law is amended to say contradictory propositions cannot both be true at the same time and in the same sense .     It is one of the so called ": null
    },
    {
        "three laws of thought": "Lawofthoughtthethreetraditionallaws"
    },
    {
        ", along with its complement, the ": null
    },
    {
        "law of excluded middle": "Law Of Excluded Middle"
    },
    {
        ", and the ": null
    },
    {
        "law of identity": "Law Of Identity"
    },
    {
        ". The law of noncontradiction is logically equivalent to the law of excluded middle by ": null
    },
    {
        "De Morgans laws": "De Morgans Laws"
    },
    {
        ". However, no system of logic is built on just these laws, and none of these laws provide ": null
    },
    {
        "inference rules": "Rule Of Inference"
    },
    {
        ", such as ": null
    },
    {
        "modus ponens": "Modus Ponens"
    },
    {
        " or De Morgans laws.     The law of non contradiction and the law of excluded middle create a ": null
    },
    {
        "dichotomy": "Dichotomy"
    },
    {
        " in logical space , wherein the two parts are mutually exclusive and jointly exhaustive . The law of non-contradiction is merely an expression of the mutually exclusive aspect of that dichotomy, and the law of excluded middle, an expression of its jointly exhaustive aspect.          One difficulty in applying the law of non-contradiction is ambiguity in the propositions. For instance, if is not explicitly specified as part of the propositions A and B, then A may be B at one time, and not at another. A and B may in some cases be made to sound mutually exclusive linguistically even though A may be partly B and partly not B at the same time. However, it is impossible to predicate of the same thing, at the same time, and in the same sense, the absence and the presence of the same fixed quality.       According to both Plato and Aristotle,  ": null
    },
    {
        "Heraclitus": "Heraclitus"
    },
    {
        " was said to have denied the law of non-contradiction. This is quite likely  if, as Plato ": null
    },
    {
        "pointed out": "Law Of Contradictionplatos Synthesis"
    },
    {
        ", the law of non-contradiction does not hold for changing things in the world. If a philosophy of ": null
    },
    {
        "Becoming": "Becoming"
    },
    {
        " is not possible without change, then what is to become must already exist in the present object. In We step and do not step into the same rivers; we are and we are not , both Heraclituss and Platos object simultaneously must, in some sense, be both what it now is and have the potential of what it might become.      Unfortunately, so little remains of ": null
    },
    {
        "Heraclitus": "Heraclitus"
    },
    {
        " aphorisms that not much about his philosophy can be said with certainty. He seems to have held that strife of opposites is universal both within and without, therefore both opposite existents or qualities must simultaneously exist, although in some instances in different respects. The road up and down are one and the same implies either the road leads both ways, or there can be no road at all. This is the logical ": null
    },
    {
        "complement": "Complement"
    },
    {
        " of the law of non-contradiction. According to ": null
    },
    {
        "Heraclitus": "Heraclitus"
    },
    {
        ", change, and the constant conflict of opposites is the universal ": null
    },
    {
        "logos": "Logos"
    },
    {
        " of nature.       Personal subjective perceptions or judgments can only be said to be true at the same time in the same respect, in which case, the law of non-contradiction must be applicable to personal judgments.   The most famous saying of ": null
    },
    {
        "Protagoras": "Protagoras"
    },
    {
        " is: Man is the measure of all things: of things which are, that they are, and of things which are not, that they are not . . According to Platos  Theaetetus , section 152a.  However, Protagoras was referring to things that are used by or in some way related to humans. This makes a great difference in the meaning of his aphorism. Properties, social entities, ideas, feelings, judgments, etc. originate in the human mind. However, Protagoras has never suggested that man must be the measure of stars or the motion of the stars.       ": null
    },
    {
        "Parmenides": "Parmenides"
    },
    {
        " employed an ": null
    },
    {
        "ontological": "Ontological"
    },
    {
        " version of the law of non-contradiction to prove that being is and to deny the void, change, and motion. He also similarly disproved contrary propositions. In his poem ": null
    },
    {
        "On Nature": "On Nature"
    },
    {
        ", he said,      The nature of the ‘is’ or what-is in Parmenides is a highly contentious subject. Some have taken it to be whatever exists, some to be whatever is or can be the object of scientific inquiry. Curd, Patricia, Presocratic Philosophy , The Stanford Encyclopedia of Philosophy , Edward N. Zalta , URL        In Platos early dialogues, Socrates uses the ": null
    },
    {
        "elenctic method": "Socratic Methodmethod"
    },
    {
        " to investigate the nature or definition of ethical concepts such as justice or virtue. Elenctic refutation depends on a ": null
    },
    {
        "dichotomous": "Dichotomy"
    },
    {
        " thesis, one that may be divided into exactly two ": null
    },
    {
        "mutually exclusive": "Mutually Exclusive"
    },
    {
        " parts, only one of which may be true. Then Socrates goes on to demonstrate the contrary of the commonly accepted part using the law of non-contradiction. According to Gregory Vlastos, Gregory Vlastos, The Socratic Elenchus, Oxford Studies in Ancient Philosophy I, Oxford 1983, 27–58. the method has the following steps:   Socrates ": null
    },
    {
        "interlocutor": "Interlocutor"
    },
    {
        " asserts a thesis, for example, Courage is endurance of the soul , which Socrates considers false and targets for refutation.   Socrates secures his interlocutors agreement to further premises, for example, Courage is a fine thing and Ignorant endurance is not a fine thing .   Socrates then argues, and the interlocutor agrees, that these further premises imply the contrary of the original thesis, in this case, it leads to: courage is not endurance of the soul .   Socrates then claims that he has shown that his interlocutors thesis is false and that its negation is true.       ": null
    },
    {
        "Platos": "Plato"
    },
    {
        " version of the law of non-contradiction states that The same thing clearly cannot act or be acted upon in the same part or in relation to the same thing at the same time, in contrary ways . In this, Plato carefully phrases three ": null
    },
    {
        "axiom": "Axiom"
    },
    {
        "atic restrictions on action or reaction: 1": null
    }
]