[
    {
        "                 A library is a curated collection of sources of information and similar resources, selected by experts and made accessible to a defined community for reference or borrowing. It provides physical or digital access to material, and may be a physical location or a virtual space, or both. A librarys collection can include ": null
    },
    {
        "books": "Book"
    },
    {
        ", ": null
    },
    {
        "periodicals": "Periodical Literature"
    },
    {
        ", ": null
    },
    {
        "newspapers": "Newspaper"
    },
    {
        ", ": null
    },
    {
        "manuscripts": "Manuscript"
    },
    {
        ", ": null
    },
    {
        "films": "Film"
    },
    {
        ", ": null
    },
    {
        "maps": "Map Collection"
    },
    {
        ", ": null
    },
    {
        "prints": "Print Room"
    },
    {
        ", ": null
    },
    {
        "documents": "Document"
    },
    {
        ", ": null
    },
    {
        "microform": "Microform"
    },
    {
        ", ": null
    },
    {
        "CDs": "Compact Disc"
    },
    {
        ", ": null
    },
    {
        "cassettes": "Compact Cassette"
    },
    {
        ", ": null
    },
    {
        "videotapes": "Videotape"
    },
    {
        ", ": null
    },
    {
        "DVDs": "Dvd"
    },
    {
        ", ": null
    },
    {
        "Blu-ray Discs": "Blu-Ray"
    },
    {
        ", ": null
    },
    {
        "e-books": "E-Book"
    },
    {
        ", ": null
    },
    {
        "audiobooks": "Audiobook"
    },
    {
        ", ": null
    },
    {
        "databases": "Database"
    },
    {
        ", and other formats. Libraries range widely in size up to millions of items. In Latin and Greek, the idea of a ": null
    },
    {
        "bookcase": "Bookcase"
    },
    {
        " is represented by Bibliotheca and Bibliothēkē : derivatives of these mean library in many modern languages, e.g. French bibliothèque.     The first libraries consisted of ": null
    },
    {
        "archives": "Archive"
    },
    {
        " of the ": null
    },
    {
        "earliest form of writing": "Writingthe Beginning Of Writing"
    },
    {
        "—the ": null
    },
    {
        "clay tablets": "Clay Tablet"
    },
    {
        " in ": null
    },
    {
        "cuneiform script": "Cuneiform Script"
    },
    {
        " discovered in ": null
    },
    {
        "Sumer": "Sumer"
    },
    {
        ", some dating back to 2600 BC. Private or personal libraries made up of written books appeared in ": null
    },
    {
        "classical Greece": "Classical Greece"
    },
    {
        " in the 5th century BC. In the 6th century, at the very close of the ": null
    },
    {
        "Classical period": "Classical Antiquity"
    },
    {
        ", the great libraries of the Mediterranean world remained those of ": null
    },
    {
        "Constantinople": "Imperial Library Of Constantinople"
    },
    {
        " and ": null
    },
    {
        "Alexandria": "Library Of Alexandria"
    },
    {
        ".     A library is organized for use and maintained by a public body, an institution, a corporation, or a private individual. Public and institutional collections and services may be intended for use by people who choose not to—or cannot afford to—purchase an extensive collection themselves, who need material no individual can reasonably be expected to have, or who require professional assistance with their research. In addition to providing materials, libraries also provide the services of ": null
    },
    {
        "librarians": "Librarian"
    },
    {
        " who are experts at finding and organizing information and at interpreting information needs. Libraries often provide quiet areas for studying, and they also often offer common areas to facilitate group study and collaboration. Libraries often provide public facilities for access to their electronic resources and the ": null
    },
    {
        "Internet": "Internet"
    },
    {
        ".     Modern libraries are increasingly being redefined as places to get unrestricted access to ": null
    },
    {
        "information": "Information"
    },
    {
        " in many formats and from many sources. They are extending services beyond the physical walls of a building, by providing material accessible by electronic means, and by providing the assistance of librarians in navigating and analyzing very large amounts of information with a variety of digital resources. Libraries are increasingly becoming community hubs where programs are delivered and people engage in lifelong learning.          The ": null
    },
    {
        "history of libraries": "History Of Libraries"
    },
    {
        " began with the first efforts to organize collections of documents. Topics of interest include accessibility of the collection, acquisition of materials, arrangement and finding tools, the book trade, the influence of the physical properties of the different writing materials, language distribution, role in education, rates of literacy, budgets, staffing, libraries for specially targeted audiences, architectural merit, patterns of usage, and the role of libraries in a nations cultural heritage, and the role of government, church or private sponsorship. Since the 1960s, issues of computerization and digitization have arisen.          Many institutions make a distinction between a circulating or ": null
    },
    {
        "lending library": "Lending Library"
    },
    {
        ", where materials are expected and intended to be loaned to patrons, institutions, or other libraries, and a reference library where material is not lent out. Travelling libraries, such as the early horseback libraries of eastern Kentucky  and ": null
    },
    {
        "bookmobiles": "Bookmobiles"
    },
    {
        ", are generally of the lending type. Modern libraries are often a mixture of both, containing a general collection for circulation, and a reference collection which is restricted to the library premises. Also, increasingly, digital collections enable broader access to material that may not circulate in print, and enables libraries to expand their collections even without building a larger facility.               Academic libraries are generally located on college and university campuses and primarily serve the students and faculty of that and other academic institutions. Some academic libraries, especially those at public institutions, are accessible to members of the general public in whole or in part.        Academic libraries are libraries that are hosted in post-secondary educational institutions, such as colleges and universities. Their main function are to provide support in research and resource linkage for students and faculty of the educational institution. Specific course-related resources are usually provided by the library, such as copies of textbooks and article readings held on reserve . Some academic libraries provide resources not usually associated with libraries, such as the ability to check out laptop computers, web cameras, or scientific calculators.     Academic libraries offer workshops and courses outside of formal, graded coursework, which are meant to provide students with the tools necessary to succeed in their programs.  These workshops may include help with citations, effective search techniques, journal databases, and electronic citation software. These workshops provide students with skills that can help them achieve success in their academic careers , which they may not learn inside the classroom.        The academic library provides a quiet study space for students on campus; it may also provide group study space, such as meeting rooms. In North America, Europe, and other parts of the world, academic libraries are becoming increasingly digitally oriented. The library provides a gateway for students and researchers to access various resources, both print/physical and digital. Dowler, Lawrence . Gateways to knowledge: the role of academic libraries in teaching, learning, and research.  Academic institutions are subscribing to electronic journals databases, providing research and scholarly writing software, and usually provide computer workstations or computer labs for students to access journals, library search databases and portals, institutional electronic resources, Internet access, and course- or task-related software . Some academic libraries take on new roles, for instance, acting as an electronic repository for institutional scholarly research and academic knowledge, such as the collection and curation of digital copies of students theses and dissertations.   Moreover, academic libraries are increasingly acting as publishers on their own on a not-for-profit basis, especially in the form of fully ": null
    },
    {
        "Open Access": "Open Access"
    },
    {
        " institutional publishers.              Childrens libraries are special collections of books intended for juvenile readers and usually kept in separate rooms of general public libraries. Some childrens libraries have entire floors or wings dedicated to them in bigger libraries while smaller ones may have a separate room or area for children. They are an educational agency seeking to acquaint the young with the worlds literature and to cultivate a love for reading. Their work supplements that of the public schools.      Services commonly provided by public libraries may include storytelling sessions for infants, toddlers, preschool children, or after-school programs, all with an intention of developing early literacy skills and a love of books. One of the most popular programs offered in public libraries are summer reading programs for children, families, and adults. Udomisor, I., Udomisor, E., & Smith, E. . Management of Communication Crisis in a Library and Its Influence on Productivity. In Information and Knowledge Management     Another popular reading program for children is PAWS TO READ or similar programs where children can read to certified therapy dogs. Since animals are a calming influence and there is no judgment, children learn confidence and a love of reading. Many states have these types of programs: parents need simply ask their librarian to see if it is available at their local library.              A ": null
    },
    {
        "national or state library": "National Library"
    },
    {
        " serves as a national repository of information, and has the right of ": null
    },
    {
        "legal deposit": "Legal Deposit"
    },
    {
        ", which is a legal requirement that publishers in the country need to deposit a copy of each publication with the library. Unlike a public library, a national library rarely allows citizens to borrow books. Often, their collections include numerous rare, valuable, or significant works. There are wider definitions of a national library, putting less emphasis on the ": null
    },
    {
        "repository": "Institutional Repository"
    },
    {
        " character. Line, Maurice B.; Line, J. . Concluding notes . National libraries, Aslib, pp. 317–18 Lor, P.J.; Sonnekus, E.A.S. .  , ": null
    },
    {
        "IFLA": "International Federation Of Library Associations And Institutions"
    },
    {
        ". Retrieved on 10 January 2009.   The first national libraries had their origins in the royal collections of the sovereign or some other supreme body of the state.     Many national libraries cooperate within the National Libraries Section of the ": null
    },
    {
        "International Federation of Library Associations and Institutions": "International Federation Of Library Associations And Institutions"
    },
    {
        " to discuss their common tasks, define and promote common standards, and carry out projects helping them to fulfil their duties. The national libraries of Europe participate in ": null
    },
    {
        "The European Library": "European Library"
    },
    {
        " which is a service of the Conference of European National Librarians .               A public library provides services to the general public. If the library is part of a countywide library system, citizens with an active library card from around that county can use the library branches associated with the library system. A library can serve only their city, however, if they are not a member of the county public library system. Much of the materials located within a public library are available for borrowing. The library staff decides upon the number of items patrons are allowed to borrow, as well as the details of borrowing time allotted. Typically, libraries issue ": null
    },
    {
        "library cards": "Library Card"
    },
    {
        " to community members wishing to borrow books. Often visitors to a city are able to obtain a public library card.        Many public libraries also serve as community organizations that provide free services and events to the public, such as reading groups and toddler story time. For many communities, the library is a source of connection to a vast world, obtainable knowledge and understanding, and entertainment. According to a study by the ": null
    },
    {
        "Pennsylvania Library Association": "Pennsylvania Library Association"
    },
    {
        ", public library services play a major role in fighting rising illiteracy rates among youths. Celano, D., & Neumann, S.B. . The role of public libraries in childrens literacy development: An evaluation report. Pennsylvania, PA: Pennsylvania Library Association. Public libraries are protected and funded by the public they serve.        As the number of books in libraries have steadily increased since their inception, the need for compact storage and access with adequate lighting has grown. The  stack system  involves keeping a librarys collection of books in a space separate from the reading room. This arrangement arose in the 19th century. Book stacks quickly evolved into a fairly standard form in which the cast iron and steel frameworks supporting the bookshelves also supported the floors, which often were built of translucent blocks to permit the passage of light . The introduction of ": null
    },
    {
        "electrical lighting": "Electric Light"
    },
    {
        " had a huge impact on how the library ": null
    },
    {
        "operated": "Lighting In Libraries"
    },
    {
        ". The use of glass floors was largely discontinued, though floors were still often composed of metal grating to allow air to circulate in multi-story stacks. As more space was needed, a method of moving shelves on tracks was introduced to cut down on otherwise wasted aisle space.     ": null
    },
    {
        "Library 2.0": "Library 2.0"
    },
    {
        ", a term coined in 2005, is the librarys response to the challenge of Google and an attempt to meet the changing needs of users by using ": null
    },
    {
        "web 2.0": "Web 2.0"
    },
    {
        " technology. Some of the aspects of Library 2.0 include, commenting, tagging, bookmarking, discussions, use of online social networks by libraries, ": null
    },
    {
        "plug-ins": "Plug-In"
    },
    {
        ", and ": null
    },
    {
        "widgets": "Software Widget"
    },
    {
        ".  Inspired by web 2.0, it is an attempt to make the library a more user-driven institution.     Despite the importance of public libraries, they are routinely having their budgets cut by state legislature. Funding has dwindled so badly that many public libraries have been forced to cut their hours and release employees.         A reference library does not lend books and other items; instead, they must be read at the library itself. Typically, such libraries are used for research purposes, for example at a university. Some items at reference libraries may be historical and even unique. Many lending libraries contain a reference section , which holds books, such as dictionaries, which are common reference books, and are therefore not lent out.  Such reference sections may be referred to as reading rooms , which may also include newspapers and periodicals.  An example of a reading room is the Hazel H. Ransom Reading Room at the ": null
    },
    {
        "Harry Ransom Center": "Harry Ransom Center"
    },
    {
        " of the ": null
    },
    {
        "University of Texas at Austin": "University Of Texas At Austin"
    },
    {
        ", which maintains the papers of literary agent ": null
    },
    {
        "Audrey Wood": "Audrey Wood"
    },
    {
        ".  www.hrc.utexas.edu. Retrieved April 22, 2015.           A research library is a collection of materials on one or more subjects.  A research library supports scholarly or scientific research and will generally include ": null
    },
    {
        "primary": "Primary Source"
    },
    {
        " as well as ": null
    },
    {
        "secondary sources": "Secondary Source"
    },
    {
        "; it will maintain permanent collections and attempt to provide access to all necessary materials. A research library is most often an ": null
    },
    {
        "academic": "Academic Library"
    },
    {
        " or ": null
    },
    {
        "national library": "National Library"
    },
    {
        ", but a large ": null
    },
    {
        "special library": "Special Library"
    },
    {
        " may have a research library within its special field, and a very few of the largest public libraries also serve as research libraries. A large university library may be considered a research library; and in North America, such libraries may belong to the ": null
    },
    {
        "Association of Research Libraries": "Association Of Research Libraries"
    },
    {
        ".  In the United Kingdom, they may be members of ": null
    },
    {
        "Research Libraries UK ": "Research Libraries Uk"
    },
    {
        ".      A research library can be either a reference library, which does not lend its holdings, or a lending library, which does lend all or some of its holdings. Some extremely large or traditional research libraries are entirely reference in this sense, lending none of their materials; most academic research libraries, at least in the US and the UK, now lend books, but not periodicals or other materials. Many research libraries are attached to a parental organization and serve only members of that organization. Examples of research libraries include the ": null
    },
    {
        "British Library": "British Library"
    },
    {
        ", the ": null
    },
    {
        "Bodleian Library": "Bodleian Library"
    },
    {
        " at ": null
    },
    {
        "Oxford University": "University Of Oxford"
    },
    {
        " and the ": null
    },
    {
        "New York Public Library Main Branch": "New York Public Library Main Branch"
    },
    {
        " on 42nd Street in Manhattan, ": null
    },
    {
        "State Public Scientific Technological Library of the Sibirian Branch of the Russian Academy of Science": "State Public Scientific  &  Technological Library"
    },
    {
        ".              Digital libraries are libraries that house digital resources. They are defined as an organization and not a service that provide access to digital works, have a preservation responsibility to provide future access to materials, and provides these items easily and affordably.  The definition of a digital library implies that a digital library uses a variety of software, networking technologies and standards to facilitate access to digital content and data to a designated user community.  Access to digital libraries can be influenced by several factors, either individually or together. The most common factors that influence access are: The librarys content, the characteristics and information needs of the target users, the librarys digital interface, the goals and objectives of the librarys organizational structure, and the standards and regulations that govern library use. Access will depend on the users ability to discover and retrieve documents that interest them and that they require, which in turn is a preservation question. Digital objects cannot be preserved passively, they must be curated by digital librarians to ensure the trust and integrity of the digital objects.      One of the biggest considerations for digital librarians is the need to provide long-term access to their resources; to do this, there are two issues requiring watchfulness: Media failure and format obsolescence. With media failure, a particular digital item is unusable because of some sort of error or problem. A scratched CD-Rom, for example, will not display its contents correctly, but another, unscratched disk will not have that problem. Format obsolescence is when a digital format has been superseded by newer technology, and so items in the old format are unreadable and unusable. Dealing with media failure is a reactive process, because something is done only when a problem presents itself. In contrast, format obsolescence is preparatory, because changes are anticipated and solutions are sought before there is a problem.     Future trends in digital preservation include: Transparent enterprise models for digital preservation, launch of self-preserving objects, increased flexibility in digital preservation architectures, clearly-defined metrics for comparing preservation tools, and terminology and standards interoperability in real time.             All other libraries fall into the ": null
    },
    {
        "special library": "Special Library"
    },
    {
        " category. Many private businesses and public organizations, including hospitals, churches, museums, research laboratories, law firms, and many government departments and agencies, maintain their own libraries for the use of their employees in doing specialized research related to their work. Depending on the particular institution, special libraries may or may not be accessible to the general public or elements thereof. In more specialized institutions such as law firms and research laboratories, librarians employed in special libraries are commonly specialists in the institutions field rather than generally trained librarians, and often are not required to have advanced degrees in specifically library-related field due to the specialized content and clientele of the library.     Special libraries can also include womens libraries or LGBTQ libraries, which serve the needs of women and the LGBTQ community. ": null
    },
    {
        "Libraries and the LGBTQ community": "Libraries And The Lgbtq Community"
    },
    {
        " have an extensive history, and there are currently many libraries, archives, and special collections devoted to preserving and helping the LGBTQ community. Womens libraries, such as the Vancouver Womens Library or the ": null
    },
    {
        "Womens Library": "Womens Library"
    },
    {
        " @LSE are examples of womens libraries that offer services to women and girls and focus on womens history.        Some special libraries, such as governmental law libraries, hospital libraries, and military base libraries commonly are open to public visitors to the institution in question. Depending on the particular library and the clientele it serves, special libraries may offer services similar to research, reference, public, academic, or childrens libraries, often with restrictions such as only lending books to patients at a hospital or restricting the public from parts of a military collection. Given the highly individual nature of special libraries, visitors to a special library are often advised to check what services and restrictions apply at that particular library.     Special libraries are distinguished from ": null
    },
    {
        "special collections": "Special Collections"
    },
    {
        ", which are branches or parts of a library intended for rare books, manuscripts, and other special materials, though some special libraries have special collections of their own, typically related to the librarys specialized subject area.     For more information on specific types of special libraries, see ": null
    },
    {
        "law libraries": "Law Library"
    },
    {
        ", ": null
    },
    {
        "medical libraries": "Medical Library"
    },
    {
        ", ": null
    },
    {
        "music libraries": "Music Library"
    },
    {
        ", or ": null
    },
    {
        "transportation libraries": "Transportation Libraries"
    },
    {
        ".            Most libraries have materials arranged in a specified order according to a ": null
    },
    {
        "library classification": "Library Classification"
    },
    {
        " system, so that items may be located quickly and collections may be browsed efficiently.  Some libraries have additional galleries beyond the public ones, where reference materials are stored. These reference stacks may be open to selected members of the public. Others require patrons to submit a stack request , which is a request for an assistant to retrieve the material from the closed stacks: see ": null
    },
    {
        "List of closed stack libraries": "List Of Closed Stack Libraries"
    },
    {
        " .     Larger libraries are often divided into departments staffed by both paraprofessionals and professional librarians.   Circulation – Handles user accounts and the loaning/returning and shelving of materials. Morris, V. & Bullard, J. . Circulation Services. In Encyclopedia of Library and Information Sciences .   ": null
    },
    {
        "Collection Development": "Collection Development"
    },
    {
        " – Orders materials and maintains materials budgets.   Reference – Staffs a ": null
    },
    {
        "reference desk": "Reference Desk"
    },
    {
        " answering questions from users , instructing users, and developing library programming. Reference may be further broken down by user groups or materials; common collections are ": null
    },
    {
        "childrens literature": "Childrens Literature"
    },
    {
        ", ": null
    },
    {
        "young adult literature": "Young Adult Fiction"
    },
    {
        ", and ": null
    },
    {
        "genealogy": "Genealogy"
    },
    {
        " materials.   Technical Services – Works behind the scenes cataloging and processing new materials and deaccessioning ": null
    },
    {
        "weeded materials": "Weeding"
    },
    {
        ".   Stacks Maintenance – Re-shelves materials that have been returned to the library after patron use and shelves materials that have been processed by Technical Services. Stacks Maintenance also shelf reads the material in the stacks to ensure that it is in the correct library classification order.          Basic tasks in ": null
    },
    {
        "library management": "Library Management"
    },
    {
        " include the planning of acquisitions , library classification of acquired materials, preservation of materials , the deaccessioning of materials, patron borrowing of materials, and developing and administering library computer systems.  More long-term issues include the planning of the construction of new libraries or extensions to existing ones, and the development and implementation of outreach services and reading-enhancement services . Library materials like books, magazines, periodicals, CDs, etc. are managed by Dewey Decimal Classification Theory and modified Dewey Decimal Classification Theory is more practical reliable system for library materials management.      The ": null
    },
    {
        "International Organization for Standardization": "International Organization For Standardization"
    },
    {
        " has published several standards regarding the management of libraries through its Technical Committee 46 ,  which is focused on libraries, documentation and information centers, publishing, archives, records management, museum documentation, indexing and abstracting services, and information science . The following is a partial list of some of them:    ISO 2789:2006 Information and documentation—International library statistics   ISO 11620:1998 Information and documentation—Library performance indicators   ISO 11799:2003 Information and documentation—Document storage requirements for archive and library materials   ISO 14416:2003 Information and documentation—Requirements for binding of books, periodicals, serials, and other paper documents for archive and library use—Methods and materials   ISO/TR 20983:2003 Information and documentation—Performance indicators for electronic library services          Librarians have sometimes complained  that some of the library buildings which have been used to accommodate libraries have been inadequate for the demands made upon them. In general, this condition may have resulted from one or more of the following causes:   an effort to erect a ": null
    },
    {
        "monument": "Monument"
    },
    {
        "al building; most of those who commission library buildings are not librarians and their priorities may be different   to conform it to a type of ": null
    },
    {
        "architecture": "Architecture"
    },
    {
        " unsuited to library purposes   the appointment, often by competition, of an architect unschooled in the requirements of a library   failure to consult with the librarian or with library experts     Much advancement has undoubtedly been made toward cooperation between architect and librarian, and many good designers have made library buildings their specialty; nevertheless it seems that the ideal type of library is not yet realized—the type so adapted to its purpose that it would be immediately recognized as such, as is the case with school buildings. This does not mean that library constructions should conform rigidly to a fixed standard of appearance and arrangement, but it does mean that the exterior should express as nearly as possible the purpose and functions of the interior.                 Some patrons may not know how to fully use the librarys resources. This can be due to individuals unease in approaching a staff member. Ways in which a librarys content is displayed or accessed may have the most impact on use. An antiquated or clumsy search system, or staff unwilling or untrained to engage their patrons, will limit a librarys usefulness. In the ": null
    },
    {
        "public libraries": "Public Library"
    },
    {
        " of the United States, beginning in the 19th century, these problems drove the emergence of the ": null
    },
    {
        "library instruction": "Library Instruction"
    },
    {
        " movement, which advocated library user education.  One of the early leaders was ": null
    },
    {
        "John Cotton Dana": "John Cotton Dana"
    },
    {
        ".  The basic form of library instruction is sometimes known as ": null
    },
    {
        "information literacy": "Information Literacy"
    },
    {
        ".      Libraries should inform their users of what materials are available in their collections and how to access that information. Before the computer age, this was accomplished by the card ": null
    },
    {
        "catalogue": "Library Catalog"
    },
    {
        "—a cabinet containing many drawers filled with ": null
    },
    {
        "index cards": "Index Card"
    },
    {
        " that identified books and other materials. In a large library, the card catalogue often filled a large room.     The emergence of the ": null
    },
    {
        "Internet": "Internet"
    },
    {
        ", however, has led to the adoption of electronic catalogue databases , which allow users to search the librarys holdings from any location with Internet access.  This style of catalogue maintenance is compatible with new types of libraries, such as ": null
    },
    {
        "digital libraries": "Digital Library"
    },
    {
        " and ": null
    },
    {
        "distributed libraries": "Distributed Library"
    },
    {
        ", as well as older libraries that have been ": null
    },
    {
        "retrofitted": "Retrofitting"
    },
    {
        ". Electronic catalogue databases are criticized by some who believe that the old card catalogue system was both easier to navigate and allowed retention of information, by writing directly on the cards, that is lost in the electronic systems.      This argument is analogous to the debate over paper books and ": null
    },
    {
        "e-books": "E-Book"
    },
    {
        ". While libraries have been accused of precipitously throwing out valuable information in card catalogues, most modern ones have nonetheless made the move to electronic catalogue databases. Large libraries may be scattered within multiple buildings across a town, each having multiple floors, with multiple rooms housing the resources across a series of shelves. Once a user has located a resource within the catalogue, they must then use navigational guidance to retrieve the resource physically, a process that may be assisted through signage, maps, GPS systems, or RFID tagging.     ": null
    },
    {
        "Finland": "Finland"
    },
    {
        " has the highest number of registered book borrowers per capita in the world. Over half of Finlands population are registered borrowers.  In the US, public library users have borrowed on average roughly 15 books per user per year from 1856 to 1978. From 1978 to 2004, book circulation per user declined approximately 50%. The growth of audiovisuals circulation, estimated at 25% of total circulation in 2004, accounts for about half of this decline.  from galbithink.org               In the 21st century, there has been increasing use of the Internet to gather and retrieve data. The shift to digital libraries has greatly impacted the way people use physical libraries. Between 2002 and 2004, the average American academic library saw the overall number of transactions decline approximately 2.2%. Applegate, Rachel. Whose Decline? Which Academic Libraries are Deserted in Terms of Reference Transactions? Reference & User Services Quarterly; 2nd ser. 48 : 176–89. Print. Libraries are trying to keep up with the digital world and the new generation of students that are used to having information just one click away. For example, the University of California Library System saw a 54% decline in circulation between 1991 and 2001 of 8,377,000 books to 3,832,000. University of California Library Statistics 1990–91, University-wide Library Planning, University of California Office of the President : 12; University of California Library Statistics July 2001, 7,  . Retrieved 17 July 2005; University of California Library Statistics July 2004, 7,  . Retrieved 17 July 2005.     These facts might be a consequence of the increased availability of e-resources. In 1999–2000, 105 ARL university libraries spent almost $100  million on electronic resources, which is an increase of nearly $23  million from the previous year.   A 2003 report by the Open E-book Forum found that close to a million e-books had been sold in 2002, generating nearly $8  million in revenue. Striphas, Ted. The Late Age of Print: Everyday Book Culture From Consumerism to Control. New York City: Columbia University Press, 2009. Print. Another example of the shift to digital libraries can be seen in ": null
    },
    {
        "Cushing Academys": "Cushing Academy"
    },
    {
        " decision to dispense with its library of printed books—more than 20,000 volumes in all—and switch over entirely to digital media resources. Striphas, Ted. Books: An Outdated Technology? Weblog post. The Late Age of Print. 4 September 2009. Web. 19 November 2009.           One claim to why there is a decrease in the usage of libraries stems from the observation of the research habits of undergraduate students enrolled in colleges and universities. There have been claims that college undergraduates have become more used to retrieving information from the Internet than a traditional library. As each generation becomes more in tune with the Internet, their desire to retrieve information as quickly and easily as possible has increased. Finding information by simply searching the Internet could be much easier and faster than reading an entire book. In a survey conducted by NetLibrary, 93% of undergraduate students claimed that finding information online makes more sense to them than going to the library. Also, 75% of students surveyed claimed that they did not have enough time to go to the library and that they liked the convenience of the Internet. While the retrieving information from the Internet may be efficient and time saving than visiting a traditional library, research has shown that undergraduates are most likely searching only .03% of the entire web. Troll, Denise A. How and Why are Libraries Changing? Digital Library Federation. Library Information Technology – Carnegie Mellon, 9 January 2001. Web. 29 November 2009.  The information that they are finding might be easy to retrieve and more readily available, but may not be as in depth as information from other resources such as the books available at a physical library.     In the mid-2000s, Swedish company Distec invented a library book vending machine known as the ": null
    },
    {
        "GoLibrary": "Golibrary"
    },
    {
        ", that offers library books to people where there is no branch, limited hours, or high traffic locations such as ": null
    },
    {
        "El Cerrito del Norte": "El Cerrito Del Norte Station"
    },
    {
        " BART station": "Bay Area Rapid Transit"
    },
    {
        " in ": null
    },
    {
        "California": "California"
    },
    {
        ".          A library may make use of the ": null
    },
    {
        "Internet": "Internet"
    },
    {
        " in a number of ways, from creating their own ": null
    },
    {
        "library website": "Library Website"
    },
    {
        " to making the contents of its ": null
    },
    {
        "catalogues searchable online": "Online Public Access Catalog"
    },
    {
        ". Some specialised search engines such as ": null
    },
    {
        "Google Scholar": "Google Scholar"
    },
    {
        " offer a way to facilitate searching for academic resources such as journal articles and research papers. The ": null
    },
    {
        "Online Computer Library Center": "Oclc"
    },
    {
        " allows anyone to search the worlds largest repository of library records through its ": null
    },
    {
        "WorldCat": "Worldcat"
    },
    {
        " online database.  Accessed: 23 March 2010 Websites such as ": null
    },
    {
        "LibraryThing": "Librarything"
    },
    {
        " and ": null
    },
    {
        "Amazon": "Amazon.Com"
    },
    {
        " provide abstracts, reviews, and recommendations of books. Libraries provide computers and Internet access to allow people to search for information online.  Online information access is particularly attractive to younger library users.  Emerald Group Publishing Limited. Retrieved 25 February 2010   Accessed: 7 March 2010 ": null
    }
]