[
    {
        "             Limited overs cricket, also known as one-day cricket, is a version of the sport of ": null
    },
    {
        "cricket": "Cricket"
    },
    {
        " in which a match is generally completed in one day, which includes ": null
    },
    {
        "List A cricket": "List A Cricket"
    },
    {
        " and ": null
    },
    {
        "Twenty20 cricket": "Twenty20 Cricket"
    },
    {
        ". The name reflects the rule that in the match each team bowls a set maximum number of ": null
    },
    {
        "overs": "Over"
    },
    {
        ", usually between 20 and 50, although shorter and longer forms of limited overs cricket have been played.     The concept contrasts with ": null
    },
    {
        "Test": "Test Cricket"
    },
    {
        " and ": null
    },
    {
        "first-class": "First-Class Cricket"
    },
    {
        " matches, which can take up to five days to complete. One-day cricket is popular with spectators as it can encourage aggressive, risky, entertaining ": null
    },
    {
        "batting": "Batting"
    },
    {
        ", often results in cliffhanger endings, and ensures that a spectator can watch an entire match without committing to five days of continuous attendance.            Each team bats only once, and each ": null
    },
    {
        "innings": "Innings"
    },
    {
        " is limited to a set number of ": null
    },
    {
        "over": "Over"
    },
    {
        "s, usually fifty in a ": null
    },
    {
        "One Day International": "One Day International"
    },
    {
        " and between forty and sixty in a List A. List A is a classification of the limited-overs form of cricket, technically as the domestic level.     Despite its name, important one-day matches, international and domestic, often have two days set aside, the second day being a reserve day to allow more chance of the game being completed if a result is not possible on the first day .         As mentioned above, in almost all competitive one-day games, a restriction is placed on the number of overs that may be bowled by any one bowler. This is to prevent a side playing two top-class bowlers with extremely good stamina who can bowl throughout their opponents innings. The usual limitation is set so that a side must include at least five players who bowl. For example, the usual limit for twenty-over cricket is four overs per bowler, for forty-over cricket eight per bowler and for fifty-over cricket ten per bowler. There are exceptions: ": null
    },
    {
        "Pro Cricket": "Pro Cricket"
    },
    {
        " in the United States restricted bowlers to five overs each, thus leaving a side requiring only four bowlers.       The idea for a one-day, limited 50-over cricket tournament, was first played in the inaugural match of the All India Pooja Cricket Tournament in 1951 in the small town of ": null
    },
    {
        "Thrippunithura": "Thrippunithura"
    },
    {
        " in ": null
    },
    {
        "Kerala": "Kerala"
    },
    {
        ". It is thought to be the brain child of KV Kelappan Thampuran, a former cricketer and the first Secretary of the Kerala Cricket Association.  The one day limited over cricket game was later adapted and played between English county teams for the first instance on 2 May 1962. ": null
    },
    {
        "Leicestershire": "Leicestershire County Cricket Club"
    },
    {
        " beat ": null
    },
    {
        "Derbyshire": "Derbyshire County Cricket Club"
    },
    {
        " and ": null
    },
    {
        "Northamptonshire": "Northamptonshire County Cricket Club"
    },
    {
        " beat ": null
    },
    {
        "Nottinghamshire": "Nottinghamshire County Cricket Club"
    },
    {
        " over 65 overs in the Midlands Knock-Out Cup , which Northamptonshire went on to win a week later. The following year, the first full-scale one-day competition between first-class teams was played, the knock-out ": null
    },
    {
        "Gillette Cup": "C & G Trophy"
    },
    {
        ", won by ": null
    },
    {
        "Sussex": "Sussex County Cricket Club"
    },
    {
        ". The number of overs was reduced to 60 for the 1964 season. League one-day cricket also began in England, when the John Player ": null
    },
    {
        "Sunday League": "National League"
    },
    {
        " was started in 1969 with forty over matches. Both these competitions have continued every season since inauguration, though the sponsorship has changed. There is now one 50 over competition, which is called the Royal London One-Day Cup.     The first Limited Overs International or One-Day International match was played in Melbourne in 1971, and the quadrennial ": null
    },
    {
        "cricket World Cup": "Cricket World Cup"
    },
    {
        " began in 1975. Many of the packaging innovations, such as coloured clothing, were as a result of ": null
    },
    {
        "World Series Cricket": "World Series Cricket"
    },
    {
        ", a rebel series set up outside the cricketing establishment by Australian entrepreneur ": null
    },
    {
        "Kerry Packer": "Kerry Packer"
    },
    {
        ". For more details, see ": null
    },
    {
        "History of cricket": "History Of Cricket"
    },
    {
        ".     ": null
    },
    {
        "Twenty20": "Twenty20"
    },
    {
        ", a curtailed form of one-day cricket with 20 overs per side, was first played in England in 2003. It has proven very popular, and several Twenty20 matches have been played between national teams. It makes several changes to the usual ": null
    },
    {
        "laws of cricket": "Laws Of Cricket"
    },
    {
        ", including the addition of a ": null
    },
    {
        "bowl-out": "Bowl-Out"
    },
    {
        "  to decide the result of tied matches, which was subsequently dispensed in favour of a ": null
    },
    {
        "Super Over": "Super Over"
    },
    {
        ".     ": null
    },
    {
        "100-ball cricket": "100-Ball Cricket"
    },
    {
        ", another form of one-day cricket with 100 deliveries per side, will launch in England in 2020. It is designed to further shorten game time and hopes to attract a new audience. It makes further changes to the usual ": null
    },
    {
        "laws of cricket": "Laws Of Cricket"
    },
    {
        ", including the addition of one 10-ball over which is bowled by each side in addition to 15 traditional 6-ball overs.               ": null
    },
    {
        "One Day International": "One Day International"
    },
    {
        " matches are usually played in brightly coloured clothing often in a day-night format where the first innings of the day occurs in the afternoon and the second occurs under stadium lights.       Every four years, the ": null
    },
    {
        "Cricket World Cup": "Cricket World Cup"
    },
    {
        " involves all the Test-playing nations and other national sides who qualify through the ": null
    },
    {
        "ICC World Cup Qualifier": "Icc World Cup Qualifier"
    },
    {
        ". It usually consists of round-robin stages, followed by semi-finals and a final. The ": null
    },
    {
        "International Cricket Council": "International Cricket Council"
    },
    {
        " determines the venue far in advance.     The ": null
    },
    {
        "ICC Champions Trophy": "Icc Champions Trophy"
    },
    {
        " also involves all the Test-playing nations, and is held between World Cups. It usually consists of a round-robin group stage, semifinals, and a final.     Each Test-playing country often hosts triangular tournaments, between the host nation and two touring sides. There is usually a round-robin group stage, and then the leading two teams play each other in a final, or sometimes a best-of-three final. When there is only one touring side, there is still often a best-of-five or best-of-seven series of limited overs matches.     The ICC ": null
    },
    {
        "World Cricket League": "World Cricket League"
    },
    {
        " is an ODI competition for national teams with Associate or Affiliate status.         Domestic one-day competitions exist in almost every country where cricket is played.         List A cricket is a classification of the limited-overs form of the sport of ": null
    },
    {
        "cricket": "Cricket"
    },
    {
        ". Much as domestic ": null
    },
    {
        "first-class cricket": "First-Class Cricket"
    },
    {
        " is the level below international ": null
    },
    {
        "Test match": "Test Cricket"
    },
    {
        " cricket, so List A cricket is the domestic level of ": null
    },
    {
        "one-day cricket": "One-Day Cricket"
    },
    {
        " below ": null
    },
    {
        "One Day International": "One Day International"
    },
    {
        "s. Twenty20 matches do not qualify for the present.     Most cricketing nations have some form of domestic List A competition. The number of ": null
    },
    {
        "overs": "Over"
    },
    {
        "in List A cricket ranges from forty to sixty overs per side.     The ": null
    },
    {
        "Association of Cricket Statisticians and Historians": "Association Of Cricket Statisticians And Historians"
    },
    {
        " created this category for the purpose of providing an equivalent to first-class cricket, to allow the generation of career records and statistics for comparable one-day matches. Only the more important one-day competitions in each country, plus matches against a touring Test team, are included. The categorisation of cricket matches as List A was not officially endorsed by the ": null
    },
    {
        "International Cricket Council": "International Cricket Council"
    },
    {
        " until 2006, when the ICC announced that it and its member associations would be determining this classification in a manner similar to that done for first class matches. , from Cricinfo, 30 July 2006     Matches that qualify as List A:   One Day Internationals   Other international matches   Premier one-day tournaments in each country   Official matches of a touring Test team against main first-class teams   Matches that do not qualify as List A:   World Cup warm-up matches   Other Tourist matches   Festival and friendly matches          The  JLT One Day Cup  is a 50 overs tournament held since 1969. The sides that compete are the following:   ": null
    },
    {
        "New South Wales Blues": "New South Wales Cricket Team"
    },
    {
        ", representing ": null
    },
    {
        "New South Wales": "New South Wales"
    },
    {
        " Victorian Bushrangers": "Victorian Bushrangers"
    },
    {
        ", representing ": null
    },
    {
        "Victoria": "Victoria"
    },
    {
        " Southern Redbacks": "Southern Redbacks"
    },
    {
        ", representing ": null
    },
    {
        "South Australia": "South Australia"
    },
    {
        " Tasmanian Tigers": "Tasmanian Tigers"
    },
    {
        ", representing ": null
    },
    {
        "Tasmania": "Tasmania"
    },
    {
        " Queensland Bulls": "Queensland Bulls"
    },
    {
        ", representing ": null
    },
    {
        "Queensland": "Queensland"
    },
    {
        " Western Warriors": "Western Warriors"
    },
    {
        ", representing ": null
    },
    {
        "Western Australia": "Western Australia"
    },
    {
        "     In 2006 ": null
    },
    {
        "Cricket Australia": "Cricket Australia"
    },
    {
        " introduced the KFC Twenty20 Big Bash which was amongst the state teams . In 2011 this was expanded to the  KFC Twenty20 Big Bash League , consisting of teams based in the capital cities of Australia. The teams are as follows:   ": null
    },
    {
        "Adelaide Strikers": "Adelaide Strikers"
    },
    {
        "    Brisbane Heat": "Brisbane Heat"
    },
    {
        "    Hobart Hurricanes": "Hobart Hurricanes"
    },
    {
        "    Melbourne Renegades": "Melbourne Renegades"
    },
    {
        "    Melbourne Stars": "Melbourne Stars"
    },
    {
        "    Perth Scorchers": "Perth Scorchers"
    },
    {
        "    Sydney Sixers": "Sydney Sixers"
    },
    {
        "    Sydney Thunder": "Sydney Thunder"
    },
    {
        "        The  Dhaka Premier Division Cricket League  is sponsored by ": null
    },
    {
        "Walton": "Walton Group"
    },
    {
        ". It has been Bangladeshs List A competition since the 2013-14 season. Twelve teams compete; the bottom two are relegated each year and replaced by the top two from the league below. In 2017-18 the teams were:    ": null
    },
    {
        "Abahani Limited": "Abahani Limited Cricket Team"
    },
    {
        " Agrani Bank Cricket Club": "Agrani Bank Cricket Club"
    },
    {
        " Brothers Union": "Brothers Union Cricket Team"
    },
    {
        " Gazi Group Cricketers": "Gazi Group Cricketers"
    },
    {
        " Kala Bagan Krira Chakra": "Kala Bagan Krira Chakra"
    },
    {
        " Khelaghar Samaj Kallyan Samity": "Khelaghar Samaj Kallyan Samity"
    },
    {
        " Legends of Rupganj": "Legends Of Rupganj"
    },
    {
        " Mohammedan Sporting Club": "Mohammedan Sporting Club Cricket Team"
    },
    {
        " Prime Bank Cricket Club": "Prime Bank Cricket Club"
    },
    {
        " Prime Doleshwar Sporting Club": "Prime Doleshwar Sporting Club"
    },
    {
        " Sheikh Jamal Dhanmondi Club": "Sheikh Jamal Dhanmondi Club Cricket Team"
    },
    {
        " Shinepukur Cricket Club": "Shinepukur Cricket Club"
    },
    {
        "        Bangladeshs T20 competition is the  Bangladesh Premier League . It has been contested annually since the 2011-12 season. Seven teams take part:    ": null
    },
    {
        "Chittagong Vikings": "Chittagong Vikings"
    },
    {
        " Comilla Victorians": "Comilla Victorians"
    },
    {
        " Dhaka Dynamites": "Dhaka Dynamites"
    },
    {
        " Khulna Titans": "Khulna Titans"
    },
    {
        " Rajshahi Kings": "Rajshahi Kings"
    },
    {
        " Rangpur Riders": "Rangpur Riders"
    },
    {
        " Sylhet Sixers": "Sylhet Sixers"
    },
    {
        "     One-Day Cup  is a fifty-over limited overs cricket competition for the English first-class counties. It replaces the  ECB 40  from 2014 onwards, increasing the number of overs from 40 to 50 in order to bring the competition in line with ": null
    },
    {
        "One Day International": "One Day International"
    },
    {
        "s. The competition consists of two groups of nine teams, from which the top four teams from each group progress to the quarter-finals. Lords hosted the inaugural final of the competition on Saturday 20 September 2014. Unlike in the previous competition neither the national teams of ": null
    },
    {
        "Scotland": "Scotland National Cricket Team"
    },
    {
        " or the ": null
    },
    {
        "Netherlands": "Netherlands National Cricket Team"
    },
    {
        ", nor the ": null
    },
    {
        "Unicorns cricket team": "Unicorns Cricket Team"
    },
    {
        "—a team formed of players who do not have first-class contracts—will participate in the competition. One-Day Cup games have List A status.   The  t20 Blast  is a ": null
    },
    {
        "Twenty20": "Twenty20"
    },
    {
        " cricket league in England and Wales run by the ECB since 2014. The league consists of the 18 first-class county teams divided into two divisions of nine teams each, the top four teams from each group entering the knockout stage. The inaugural tournament was won by ": null
    },
    {
        "Birmingham Bears": "Warwickshire County Cricket Club"
    },
    {
        ". This tournament replaced the ": null
    },
    {
        "Friends Life t20": "Friends Life T20"
    },
    {
        " as the premier domestic Twenty20 competition of England and Wales.    The Hundred  is the title of an upcoming domestic city based ": null
    },
    {
        "100-ball": "100 Ball Cricket"
    },
    {
        " league due to launch in 2020.     Each county has a team representing them in each league and are as followed with their home ground:     North Group:     Birmingham Bears   Derbyshire Falcons   Durham Jets   Lancashire Lightning   Leicestershire Foxes   Northamptonshire Steelbacks   Nottinghamshire Outlaws   Worcestershire Rapids   Yorkshire Vikings     South Group:     Essex Eagles   Glamorgan Dragons   Gloucestershire   Hampshire Royals   Kent Spitfires   Middlesex   Somerset   Surrey   Sussex Sharks        Ranji Trophy  onedays – The teams in the five zones play each other and the zonal winners play in a round-robin format.    Deodhar Trophy  – Played amongst the five zones: ": null
    },
    {
        "East Zone": "East Zone Cricket Team"
    },
    {
        ", ": null
    },
    {
        "West Zone": "West Zone Cricket Team"
    },
    {
        ", ": null
    },
    {
        "North Zone": "North Zone Cricket Team"
    },
    {
        ", ": null
    },
    {
        "South Zone": "South Zone Cricket Team"
    },
    {
        " and ": null
    },
    {
        "Central Zone": "Central Zone Cricket Team"
    },
    {
        "  NKP Salve Challenger Trophy  – Three teams are involved – each team comprising a motley of players picked from across the country. The three teams are named India seniors, India A and India B or India Reds, India Greens and India Blues.    Indian Cricket League  – A Twenty20 league bankrolled by billionaire ": null
    },
    {
        "Subhash Chandra": "Subhash Chandra"
    },
    {
        " and run independently of the countrys governing body, the ": null
    },
    {
        "Board of Control for Cricket in India": "Board Of Control For Cricket In India"
    },
    {
        " . Launched in 2007 with teams in ": null
    },
    {
        "Mumbai": "Mumbai Champs"
    },
    {
        ", ": null
    },
    {
        "Chennai": "Chennai Superstars"
    },
    {
        ", ": null
    },
    {
        "Chandigarh": "Chandigarh Lions"
    },
    {
        ", ": null
    },
    {
        "Hyderabad": "Hyderabad Heroes"
    },
    {
        ", ": null
    },
    {
        "Kolkata": "Kolkata Tigers"
    },
    {
        " and ": null
    },
    {
        "Delhi": "Delhi Jets"
    },
    {
        ". It was closed down in 2009.    Indian Premier League  – The BCCIs response to the Indian Cricket League, this Twenty20 league launched in 2008 with teams in ": null
    },
    {
        "Mumbai": "Mumbai Indians"
    },
    {
        ", ": null
    },
    {
        "Bangalore": "Royal Challengers Bangalore"
    },
    {
        ", ": null
    },
    {
        "Chennai": "Chennai Super Kings"
    },
    {
        ", ": null
    },
    {
        "Delhi": "Delhi Daredevils"
    },
    {
        ", ": null
    },
    {
        "Hyderabad": "Deccan Chargers"
    },
    {
        ", ": null
    },
    {
        "Jaipur": "Rajasthan Royals"
    },
    {
        ", ": null
    },
    {
        "Kolkata": "Kolkata Knight Riders"
    },
    {
        " and ": null
    },
    {
        "Mohali": "Kings Xi Punjab"
    },
    {
        ". The league is explicitly designed to operate on a ": null
    },
    {
        "North American model": "Major Professional Sports Leagues Of The United States And Canada"
    },
    {
        " of privately owned franchises. There have since been a few changes to the line-up, with the addition of teams from ": null
    },
    {
        "Pune": "Pune Warriors India"
    },
    {
        " and ": null
    },
    {
        "Kochi": "Kochi Tuskers Kerala"
    },
    {
        " ; and the replacement of ": null
    },
    {
        "Deccan Chargers": "Deccan Chargers"
    },
    {
        " with ": null
    },
    {
        "Sunrisers Hyderabad": "Sunrisers Hyderabad"
    },
    {
        " in ": null
    },
    {
        "Hyderabad": "Hyderabad, India"
    },
    {
        ".       ": null
    },
    {
        "Nepal Premier League": "Nepal Premier League"
    },
    {
        " National League": "National League Cricket"
    },
    {
        " SPA Cup": "Spa Cup"
    },
    {
        "  Ford Trophy  is played annually between six teams based upon the first-class associations: Northern Knights, Auckland Aces, Central Stags, Wellington Firebirds, Canterbury Wizards and Otago Volts. Its name and format have changed over the years; it was first played in 1971-72 as the New Zealand Motor Corporation Knockout Tournament . It is now played as a double round-robin with team 1 gaining direct entry to the final and teams 2 and 3 contesting a semi-final. Games are played to ODI rules with many day-night matches.   Womens: The  Hallyburton Johnstone Shield  is played annually between six teams based upon the first-class associations: Northern Spirit, Auckland Hearts, Central Hinds, Wellington Blaze, Canterbury Magicians, Otago Sparks. The format is a double-round-robin with the winner determined by points.       The Pakistani domestic competition changes regularly, but for 2005–06 there are plans for three one-day tournaments for men:     NATIONAL BANK Cup ": null
    },
    {
        "Faisalabad Wolves": "Faisalabad Cricket Team"
    },
    {
        " Karachi Dolphins": "Karachi Cricket Teams"
    },
    {
        " Lahore Lions": "Lahore Cricket Teams"
    },
    {
        " Multan Tigers": "Multan Tigers"
    },
    {
        " Peshawar Panthers": "Peshawar Panthers"
    },
    {
        " Sialkot Stallions": "Sialkot Cricket Team"
    },
    {
        " Rawalpindi Rams": "Rawalpindi Cricket Team"
    },
    {
        "     Abbottabad Rhinos": "Abbottabad Rhinos"
    },
    {
        " Hyderabad Hawks": "Hyderabad Hawks"
    },
    {
        " Islamabad Leopards": "Islamabad Leopards"
    },
    {
        " Karachi Zebras": "Karachi Cricket Teams"
    },
    {
        " Lahore Eagles": "Lahore Cricket Teams"
    },
    {
        " Quetta Bears": "Quetta Bears"
    },
    {
        "    NATIONAL BANK Patrons Cup ": null
    },
    {
        "Allied Bank Limited": "Allied Bank Limited Cricket Team"
    },
    {
        " Habib Bank Limited": "Habib Bank Limited Cricket Team"
    },
    {
        " Pakistan International Airlines": "Pakistan International Airlines Cricket Team"
    },
    {
        "  NATIONAL BANK Twenty20 Cup Pakistan Super League    — a professional franchise Twenty20 mens cricket league. The league is headquartered in Lahore, consists of five franchises nominally representing cities in   Pakistan . It is operated by the Pakistan Cricket Board and was established in 2016.Following are the teams:   ": null
    },
    {
        "Islamabad United": "Islamabad United"
    },
    {
        " Karachi Kings": "Karachi Kings"
    },
    {
        " Lahore Qalandars": "Lahore Qalandars"
    },
    {
        " Peshawar Zalmi": "Peshawar Zalmi"
    },
    {
        " Quetta Gladiators": "Quetta Gladiators"
    },
    {
        " Multan Sultan": "Multan Sultan"
    },
    {
        "       The local competition in South Africa is the Standard Bank Cup played between 6 teams:    ": null
    },
    {
        "Dolphins": "Dolphins Cricket Team"
    },
    {
        "   Eagles": "Eagles Cricket Team"
    },
    {
        "   Lions": "Highveld Lions Cricket Team"
    },
    {
        "   Titans": "Titans Cricket Team"
    },
    {
        "   Warriors": "Warriors Cricket Team"
    },
    {
        "   Cape Cobras": "Cape Cobras"
    },
    {
        "      The games are 45-overs, and based on a home-and-away round-robin match system with semi-finals and a final. The Eagles were the winners of the 2004/2005 and 2005/2006 competitions.       20 teams compete in the Premier Limited-Overs Tournament, which is an expansion from 16 in the last season. Games are played over 50 overs per side, and the teams are divided into two groups, where each team meets the other once over a period of a month. The four top teams from each group qualify for the quarter-finals, and there is then a direct knock-out system until a winner is found after three knock-out stages. The competing teams are:      ": null
    },
    {
        "Bloomfield Cricket and Athletic Club": "Bloomfield Cricket And Athletic Club"
    },
    {
        " Burgher Recreation Club": "Burgher Recreation Club"
    },
    {
        " Chilaw Marians Cricket Club": "Chilaw Marians Cricket Club"
    },
    {
        " Colombo Cricket Club": "Colombo Cricket Club"
    },
    {
        " Colts Cricket Club": "Colts Cricket Club"
    },
    {
        " Galle Cricket Club": "Galle Cricket Club"
    },
    {
        " Moors Sports Club": "Moors Sports Club"
    },
    {
        " Nondescripts Cricket Club": "Nondescripts Cricket Club"
    },
    {
        " Panadura Sports Club": "Panadura Sports Club"
    },
    {
        " Ragama Cricket Club": "Ragama Cricket Club"
    },
    {
        " Sebastianites Cricket and Athletic Club": "Sebastianites Cricket And Athletic Club"
    },
    {
        " Sinhalese Sports Club": "Sinhalese Sports Club"
    },
    {
        " Tamil Union Cricket and Athletic Club": "Tamil Union Cricket And Athletic Club"
    },
    {
        "               The NAGICO Regional Super50 is the main regional one-day competition in the West Indies. In recent years, it has been run over a weeks time as a group stage followed by knock-out stages. ": null
    },
    {
        "Trinidad and Tobago": "Trinidad And Tobago Cricket Team"
    },
    {
        " have won the most titles.     ;Current teams           ": null
    },
    {
        "Combined Campuses": "Combined Campuses And Colleges Cricket Team"
    },
    {
        "          West Indies B": "West Indies B Cricket Team"
    },
    {
        "                The world record for the highest innings total in any List A limited overs match is 496 for 4 by Surrey against Gloucestershire in their ": null
    },
    {
        "Friends Provident Trophy": "Friends Provident Trophy"
    },
    {
        " 50-overs match at the ": null
    },
    {
        "Oval": "The Oval"
    },
    {
        ", London on 29 April 2007. That surpassed the 443 for nine by Sri Lanka against the Netherlands in their One Day International 50-overs match at Amstelveen on 4 July 2006, which was the record ODI score at the time. On 19 June 2018, England set a new international record, totalling 481 for 6 against Australia at Trent Bridge. The lowest ever total is 23 by Yorkshire against Middlesex at ": null
    },
    {
        "Headingley": "Headingley Cricket Ground"
    },
    {
        " in 1974 in a 40-overs match. The record low score in ODIs was set by Zimbabwe, who managed just 35 against Sri Lanka in Harare on 25 April 2004.     The most runs scored by both sides in any List A limited overs match is 872: Australia, batting first, scored 434 for four in 50 overs, and yet were beaten by South Africa who scored 438 for nine with a ball to spare during their ": null
    },
    {
        "One Day International at Johannesburg in 2006": "Australia In South Africa, 5Th Odi, 2006"
    },
    {
        ".     The highest individual innings is 268 by ": null
    },
    {
        "Ali Brown": "Ali Brown"
    },
    {
        " for Surrey against Glamorgan in a 50-overs match at The Oval in 2002. The best bowling figures are eight for 15 by ": null
    },
    {
        "Rahul Sanghvi": "Rahul Sanghvi"
    },
    {
        " for Delhi against Himachal Pradesh in a 50-overs match at Una in 1997.   The highest international individual innings is by Rohit Sharma who scored 264.   The highest score in any formal limited overs match is believed to be Uniteds 630 for five against Bay Area in a 45 overs match at ": null
    },
    {
        "Richmond, California": "Richmond, California"
    },
    {
        " in August 2006.      The most runs in an over was scored by ": null
    },
    {
        "Herschelle Gibbs": "Herschelle Gibbs"
    },
    {
        " of the South African cricket team when, in the ": null
    },
    {
        "2007 Cricket World Cup": "2007 Cricket World Cup"
    },
    {
        " in the West Indies, he hit 6 sixes in one over bowled by ": null
    },
    {
        "Daan van Bunge": "Daan Van Bunge"
    },
    {
        " of the Netherlands.      This record is shared by ": null
    },
    {
        "Yuvraj Singh": "Yuvraj Singh"
    },
    {
        " of India who achieved this feat in the ": null
    },
    {
        "2007 ICC World Twenty20": "2007 Icc World Twenty20"
    },
    {
        " in South Africa, he hit 6 sixes in an over bowled by ": null
    },
    {
        "Stuart Broad": "Stuart Broad"
    }
]