[
    {
        "        The Lunar Roving Vehicle  is a ": null
    },
    {
        "battery-powered": "Battery Electric Vehicle"
    },
    {
        " four-wheeled ": null
    },
    {
        "rover": "Rover"
    },
    {
        " used on the ": null
    },
    {
        "Moon": "Moon"
    },
    {
        " in the last three missions of the American ": null
    },
    {
        "Apollo program": "Apollo Program"
    },
    {
        "  during 1971 and 1972. They are popularly known as Moon buggies , a play on the words ": null
    },
    {
        "dune buggy": "Dune Buggy"
    },
    {
        " .     Built by Boeing, each LRV weighed 210 kg, could carry two astronauts, equipment and lunar samples, and had a designed top speed of 13 km/h. They were transported to the Moon folded up in the ": null
    },
    {
        "Lunar Modules": "Apollo Lunar Module"
    },
    {
        "Quadrant 1 Bay. After being unpacked, they were driven an average distance of 30 km on each of the three missions, without major incident.     These three LRVs remain on the Moon.         The concept of a ": null
    },
    {
        "lunar rover": "Lunar Rover"
    },
    {
        " predated Apollo, with a 1952–1954 series in  Colliers Weekly  magazine by ": null
    },
    {
        "Wernher von Braun": "Wernher Von Braun"
    },
    {
        " and others, ": null
    },
    {
        "Man Will Conquer Space Soon!": "Man Will Conquer Space Soon!"
    },
    {
        " In this, von Braun described a six-week stay on the Moon, featuring 10-ton tractor trailers for moving supplies.     In 1956, ": null
    },
    {
        "Mieczysław G. Bekker": "Mieczysław G. Bekker"
    },
    {
        " published two books on land locomotion. Bekker, Mieczyslaw G.; Theory of Land Locomotion, U. Michigan Press, 1956, and The Mechanics of Vehicle Mobility, U. Michigan Press, 1956 and 1962 At the time, Bekker was a ": null
    },
    {
        "University of Michigan": "University Of Michigan"
    },
    {
        " professor and a consultant to the ": null
    },
    {
        "U.S. Army Tank-Automotive Commands": "United States Army Tacom Life Cycle Management Command"
    },
    {
        "Land Locomotion Laboratory. The books provided much of the theoretical base for future lunar vehicle development.            In the February 1964 issue of  Popular Science , von Braun, then director of ": null
    },
    {
        "NASAs": "Nasa"
    },
    {
        " Marshall Space Flight Center": "Marshall Space Flight Center"
    },
    {
        " , discussed the need for a lunar surface vehicle, and revealed that studies had been underway at Marshall in conjunction with Lockheed, Bendix, Boeing, General Motors, Brown Engineering, Grumman, and Bell Aerospace. von Braun, Wernher;  Popular Science, February 1964, pp. 18–26     Beginning in the early 1960s, a series of studies centering on lunar mobility were conducted under Marshall. This began with the lunar logistics system , followed by the mobility laboratory , then the lunar scientific survey module , and finally the mobility test article . In early planning for the ": null
    },
    {
        "Apollo program": "Apollo Program"
    },
    {
        ", it had been assumed that two ": null
    },
    {
        "Saturn V": "Saturn V"
    },
    {
        " launch vehicles would be used for each lunar mission: one for sending the crew aboard a Lunar Surface Module to lunar orbit, landing, and returning, and a second for sending an LSM-Truck with all of the equipment, supplies, and transport vehicle for use by the crew while on the surface. All of the first Marshall studies were based on this dual-launch assumption, allowing a large, heavy, roving vehicle. Young, Anthony; Lunar and planetary rovers: the wheels of Apollo and the quest for Mars; Springer, 2007, pp. 30–57;      Grumman and Northrop, in the fall of 1962, began to design pressurized-cabin vehicles, with electric motors for each wheel. At about this same time Bendix and Boeing started their own internal studies on lunar transportation systems. Mieczysław Bekker, now with General Motors Defense Research Laboratories at ": null
    },
    {
        "Santa Barbara, California": "Santa Barbara, California"
    },
    {
        ", was completing a study for NASAs ": null
    },
    {
        "Jet Propulsion Laboratory": "Jet Propulsion Laboratory"
    },
    {
        " on a small, uncrewed lunar roving vehicle for the ": null
    },
    {
        "Surveyor program": "Surveyor Program"
    },
    {
        ". ": null
    },
    {
        "Ferenc Pavlics": "Ferenc Pavlics"
    },
    {
        ", originally from ": null
    },
    {
        "Hungary": "Hungary"
    },
    {
        ", used a wire-mesh design for resilient wheels, a design that would be followed in future small rovers. Bekker, Mieczyslaw G., and Ferenc Pavlics; Lunar Roving Vehicle Concept: A Case Study ; GMDRL Staff Paper SP63-205, May 1963     In early 1963, NASA selected Marshall for studies in an Apollo Logistics Support System . Following reviews of all earlier efforts, this resulted in a 10-volume report. Included was the need for a pressurized vehicle in the  weight range, accommodating two men with their expendables and instruments for traverses up to two weeks in duration. In June 1964, Marshall awarded contracts to Bendix and to Boeing, with GMs lab designated as the vehicle technology subcontractor.   Encyclopedia Astronautics Bell Aerospace was already under contract for studies of Lunar Flying Vehicles. Courter, Robert;  Popular Science, Nov. 1969, pp. 55–59, 190     Even as the Bendix and Boeing studies were underway, Marshall was examining a less ambitious surface exploration activity, the LSSM. This would be composed of a fixed, habitable shelter–laboratory with a small lunar-traversing vehicle that could either carry one man or be remotely controlled. This mission would still require a dual launch with the moon vehicle carried on the lunar truck”. Marshalls Propulsion and Vehicle Engineering lab contracted with Hayes International to make a preliminary study of the shelter and its related vehicle.  NASA CR-61049, Nov. 1964. Because of the potential need for an enclosed vehicle for enlarged future lunar explorations, those design efforts continued for some time, and resulted in several full-scale test vehicles.          With pressure from Congress to hold down Apollo costs, Saturn V production was reduced, allowing only a single launch per mission. Any roving vehicle would have to fit on the same lunar module as the astronauts. In November 1964, two-rocket models were put on indefinite hold, but Bendix and Boeing were given study contracts for small rovers. The name of the lunar excursion module was changed to simply the ": null
    },
    {
        "lunar module": "Apollo Lunar Module"
    },
    {
        ", indicating that the capability for powered excursions away from a lunar-lander base did not yet exist. There could be no mobile lab — the astronauts would work out of the LM. Marshall continued to also examine uncrewed robotic rovers that could be controlled from the Earth.     From the beginnings at Marshall, the Brown Engineering Company of ": null
    },
    {
        "Huntsville, Alabama": "Huntsville, Alabama"
    },
    {
        " had participated in all of the lunar mobility efforts. In 1965, Brown became the prime support contractor for Marshalls P & VE Laboratory. With an urgent need to determine the feasibility of a two-man self-contained lander, von Braun bypassed the usual procurement process and had P & VEs Advanced Studies Office directly task Brown to design, build, and test a prototype vehicle. Brown Builds Concept Of Lunar Vehicle, BECO Views, Vol. 9, Jan. 1966, p. 1 While Bendix and Boeing would continue to refine concepts and designs for a lander, test model rovers were vital for Marshall human factors studies involving spacesuit-clad astronauts interfacing with power, telemetry, navigation, and life-support rover equipment.     Browns team made full use of the earlier small-rover studies, and commercially available components were incorporated wherever possible. The selection of wheels was of great importance, and almost nothing was known at that time about the lunar surface. The Marshall Space Sciences Laboratory was responsible for predicting surface properties, and Brown was also prime support contractor for this lab; Brown set up a test area to examine a wide variety of wheel-surface conditions. To simulate Pavlics resilient wheel, a four-foot-diameter inner tube wrapped with nylon ski rope was used. On the small test rover, each wheel had a small electric motor, with overall power provided by standard truck batteries. A ": null
    },
    {
        "roll bar": "Rollover Protection Structure"
    },
    {
        " gave protection from overturn accidents.     In early 1966, Browns vehicle became available for examining human factors and other testing. Marshall built a small test track with craters and rock debris where the several different mock-ups were compared; it became obvious that a small rover would be best for the proposed missions. The test vehicle was also operated in remote mode to determine characteristics that might be dangerous to the driver, such as acceleration, bounce-height, and turn-over tendency as it traveled at higher speeds and over simulated obstacles. The test rovers performance under one-sixth gravity was obtained through flights on a KC-135A aircraft in a ": null
    },
    {
        "Reduced Gravity": "Reduced Gravity Aircraft"
    },
    {
        " parabolic": "Parabolic Trajectory"
    },
    {
        " maneuver; among other things, the need for a very soft wheel and suspension combination was shown. Although Pavlics wire-mesh wheels were not initially available for the reduced gravity tests, the mesh wheels were tested on various soils at the ": null
    },
    {
        "Waterways Experiment Station": "Waterways Experiment Station"
    },
    {
        " of the ": null
    },
    {
        "U.S. Army Corps of Engineers": "United States Army Corps Of Engineers"
    },
    {
        " at ": null
    },
    {
        "Vicksburg, Mississippi": "Vicksburg, Mississippi"
    },
    {
        ". Later, when wire-mesh wheels were tested on low-g flights, the need for wheel fenders to reduce dust contamination was found. The model was also extensively tested at the U.S. Armys ": null
    },
    {
        "Yuma Proving Ground": "Yuma Proving Ground"
    },
    {
        " in ": null
    },
    {
        "Arizona": "Arizona"
    },
    {
        ", as well as the Armys ": null
    },
    {
        "Aberdeen Proving Ground": "Aberdeen Proving Ground"
    },
    {
        " in ": null
    },
    {
        "Maryland": "Maryland"
    },
    {
        ".            During 1965 and 1967, the Summer Conference on Lunar Exploration and Science brought together leading scientists to assess NASAs planning for exploring the Moon and to make recommendations. One of their findings was that the LSSM was critical to a successful program and should be given major attention. At Marshall, von Braun established a Lunar Roving Task Team, and in May 1969, NASA approved the Manned Lunar Rover Vehicle Program as a Marshall hardware development. Saverio F. Sonny Morea was named Lunar Roving Vehicle Project Manager. Wright, Mike and Bob Jaques, Editors, Saverio Morea, Technical Editor;  3 April 2002, MSFC History Office.     On 11 July 1969, just before the successful Moon landing of ": null
    },
    {
        "Apollo 11": "Apollo 11"
    },
    {
        ", a ": null
    },
    {
        "request for proposal": "Request For Proposal"
    },
    {
        " for the final development and building the Apollo LRV was released by Marshall. Boeing, Bendix, Grumman, and Chrysler submitted proposals. Following three months of proposal evaluation and negotiations, Boeing was selected as the Apollo LRV prime contractor on 28 October 1969. Boeing would manage the LRV project under Henry Kudish in ": null
    },
    {
        "Huntsville, Alabama": "Huntsville, Alabama"
    },
    {
        ". As a major subcontractor, the General Motors Defense Research Laboratories in ": null
    },
    {
        "Santa Barbara, California": "Santa Barbara, California"
    },
    {
        ", would furnish the mobility system ; this effort would be led by GM Program Manager Samuel Romano and From the Moon to the Balloon, New Jerseys Amazing Aviation History, HV Pat Reilly, 1992 ": null
    },
    {
        "Ferenc Pavlics": "Ferenc Pavlics"
    },
    {
        ".  Boeing in ": null
    },
    {
        "Seattle, Washington": "Seattle, Washington"
    },
    {
        ", would furnish the electronics and navigation system. Vehicle testing would take place at the Boeing facility in ": null
    },
    {
        "Kent, Washington": "Kent, Washington"
    },
    {
        ", and the chassis manufacturing and overall assembly would be at the Boeing facility in Huntsville. Lunar Roving Vehicle, MSFC press release, 29 October 1969; Marshall Star, 3 November 1969     The first cost-plus-incentive-fee contract to Boeing was for $19,000,000 and called for delivery of the first LRV by 1 April 1971. Cost overruns, however, led to a final cost of $38,000,000, which was about the same as NASAs original estimate. Four lunar rovers were built, one each for Apollo missions 15, 16, and 17; and one used for spare parts after the ": null
    },
    {
        "cancellation of further Apollo missions": "Canceled Apollo Missions"
    },
    {
        ". Other LRV models were built: a static model to assist with ": null
    },
    {
        "human factors": "Human Factors"
    },
    {
        " design; an engineering model to design and integrate the subsystems; two one-sixth gravity models for testing the deployment mechanism; a one-gravity trainer to give the astronauts instruction in the operation of the rover and allow them to practice driving it; a mass model to test the effect of the rover on the LM structure, balance, and handling; a vibration test unit to study the LRVs durability and handling of launch stresses; and a qualification test unit to study integration of all LRV subsystems. A paper by Saverio Morea gives details of the LRV system and its development. Morea, Saverio F.;  Proc. 2nd Conference on Lunar Bases and Space Activities, 5–7 April 1988; NASA Conference Publications 3166, Vol. 1, pp. 619–632.          LRVs were used for greater surface mobility during the Apollo ": null
    },
    {
        "J-class": "List Of Apollo Missionsalphabetical Mission Types"
    },
    {
        " missions, ": null
    },
    {
        "Apollo 15": "Apollo 15"
    },
    {
        ", ": null
    },
    {
        "Apollo 16": "Apollo 16"
    },
    {
        ", and ": null
    },
    {
        "Apollo 17": "Apollo 17"
    },
    {
        ". The rover was first used on 31 July 1971, during the Apollo 15 mission. This greatly expanded the range of the lunar explorers. Previous teams of astronauts were restricted to short walking distances around the landing site due to the bulky space suit equipment required to sustain life in the lunar environment. The range, however, was operationally restricted to remain within walking distance of the lunar module, in case the rover broke down at any point. , NASA Document. The rovers were designed with a top speed of about , although ": null
    },
    {
        "Eugene Cernan": "Eugene Cernan"
    },
    {
        " recorded a maximum speed of , giving him the lunar land-speed record. Lyons, Pete; 10 Best Ahead-of-Their-Time Machines , Car and Driver, Jan. 1988, p.78     The LRV was developed in only 17 months and performed all its functions on the Moon with no major anomalies. Scientist-astronaut ": null
    },
    {
        "Harrison Schmitt": "Harrison Schmitt"
    },
    {
        " of Apollo 17 said, The Lunar Rover proved to be the reliable, safe and flexible lunar exploration vehicle we expected it to be. Without it, the major scientific discoveries of Apollo 15, 16, and 17 would not have been possible; and our current understanding of lunar evolution would not have been possible.     The LRVs experienced some minor problems. The rear ": null
    },
    {
        "fender": "Fender"
    },
    {
        " extension on the Apollo 16 LRV was lost during the missions second ": null
    },
    {
        "extra-vehicular activity": "Extra-Vehicular Activity"
    },
    {
        " at station 8 when ": null
    },
    {
        "John Young": "John Young"
    },
    {
        " bumped into it while going to assist ": null
    },
    {
        "Charles Duke": "Charles Duke"
    },
    {
        ". The dust thrown up from the wheel covered the crew, the console, and the communications equipment. High battery temperatures and resulting high power consumption ensued. No repair attempt was mentioned.     The fender extension on the Apollo 17 LRV broke when accidentally bumped by ": null
    },
    {
        "Eugene Cernan": "Eugene Cernan"
    },
    {
        " with a hammer handle. Cernan and Schmitt taped the extension back in place, but due to the dusty surfaces, the tape did not adhere and the extension was lost after about one hour of driving, causing the astronauts to be covered with dust. For their second EVA, a replacement fender was made with some EVA maps, duct tape, and a pair of clamps from inside the Lunar Module that were nominally intended for the moveable overhead light. This repair was later undone so that the clamps could be taken inside for the return launch. The maps were brought back to Earth and are now on display at the ": null
    },
    {
        "National Air and Space Museum": "National Air And Space Museum"
    },
    {
        ". The abrasion from the dust is evident on some portions of the makeshift fender.  NASA Document.  NASA Document.        The ": null
    },
    {
        "color TV camera": "Apollo Tv Camera"
    },
    {
        " mounted on the front of the LRV could be remotely operated by ": null
    },
    {
        "Mission Control": "Mission Control Center"
    },
    {
        " in pan and tilt axes as well as zoom. This allowed far better television coverage of the EVA than the earlier missions. On each mission, at the conclusion of the astronauts stay on the surface, the commander drove the LRV to a position away from the Lunar Module so that the camera could record the ascent stage launch. The camera operator in Mission Control experienced difficulty in timing the various delays so that the LM ascent stage was in frame through the launch. On the third and final attempt , the launch and ascent were successfully tracked.     NASAs rovers, left behind, are among the ": null
    },
    {
        "artificial objects on the Moon": "List Of Man-Made Objects On The Moon"
    },
    {
        ", as are the ": null
    },
    {
        "Soviet Unions": "Soviet Union"
    },
    {
        "uncrewed rovers,  Lunokhod 1  and  Lunokhod 2 .            The Apollo Lunar Roving Vehicle was an ": null
    },
    {
        "electric-powered vehicle": "Battery Electric Vehicle"
    },
    {
        " designed to operate in the low-gravity vacuum of the Moon and to be capable of traversing the lunar surface, allowing the Apollo astronauts to extend the range of their surface extravehicular activities. Three LRVs were used on the Moon, one on Apollo 15 by astronauts ": null
    },
    {
        "David Scott": "David Scott"
    },
    {
        " and ": null
    },
    {
        "Jim Irwin": "James Irwin"
    },
    {
        ", one on Apollo 16 by ": null
    },
    {
        "John Young": "John Young"
    },
    {
        " and ": null
    },
    {
        "Charles Duke": "Charles Duke"
    },
    {
        ", and one on Apollo 17 by ": null
    },
    {
        "Eugene Cernan": "Eugene Cernan"
    },
    {
        " and ": null
    },
    {
        "Harrison Schmitt": "Harrison Schmitt"
    },
    {
        ". The mission commander served as the driver, occupying the left-hand seat of each LRV. Features are available in papers by Morea, Baker, Baker, David; Lunar Roving Vehicle: Design Report, Spaceflight, Vol. 13, July 1971, pp. 234–240 and Kudish. Kudish, Henry. The Lunar Rover. Spaceflight. Vol. 12, July 1970, pp. 270–274         The Lunar Roving Vehicle had a ": null
    },
    {
        "mass": "Mass"
    },
    {
        " of , and was designed to hold a ": null
    },
    {
        "payload": "Payload"
    },
    {
        " of . This resulted in weights in the approximately one-sixth ": null
    },
    {
        "g": "G-Force"
    },
    {
        " on the lunar surface of  empty and  fully loaded. The frame was  long with a wheelbase of . The height of the vehicle was . The frame was made of ": null
    },
    {
        "2219 aluminium alloy": "2219 Aluminium Alloy"
    },
    {
        " tubing welded assemblies and consisted of a three-part chassis that was hinged in the center so it could be folded up and hung in the Lunar Module Quadrant 1 bay, which was kept open to space by omission of the outer skin panel. It had two side-by-side foldable seats made of tubular ": null
    },
    {
        "aluminium": "Aluminium"
    },
    {
        " with nylon webbing and aluminum floor panels. An armrest was mounted between the seats, and each seat had adjustable footrests and a ": null
    },
    {
        "Velcro": "Hook And Loop Fastener"
    },
    {
        "-fastened seat belt. A large mesh dish antenna was mounted on a mast on the front center of the rover. The suspension consisted of a double horizontal wishbone with upper and lower ": null
    },
    {
        "torsion bars": "Torsion Beam Suspension"
    },
    {
        " and a damper unit between the chassis and upper wishbone. Fully loaded, the LRV had a ground clearance of .            The wheels were designed and manufactured by General Motors Defense Research Laboratories in ": null
    },
    {
        "Santa Barbara, California": "Santa Barbara, California"
    },
    {
        ". Lunar Rover , brochure, Delco Electronics, Santa Barbara Operations,1972 ": null
    },
    {
        "Ferenc Pavlics": "Ferenc Pavlics"
    },
    {
        " was given special recognition by NASA for developing the resilient wheel .  . They consisted of a ": null
    },
    {
        "spun aluminum": "Spun Aluminum"
    },
    {
        " hub and a  diameter,  wide tire made of zinc-coated woven  diameter steel strands attached to the rim and discs of formed aluminum. ": null
    },
    {
        "Titanium": "Titanium"
    },
    {
        " chevrons covered 50% of the contact area to provide traction. Inside the tire was a  diameter bump stop frame to protect the hub. Dust guards were mounted above the wheels. Each wheel had its own electric drive made by Delco, a ": null
    },
    {
        "direct current": "Direct Current"
    },
    {
        " series-wound motor capable of  at 10,000 rpm, attached to the wheel via an 80:1 ": null
    },
    {
        "harmonic drive": "Harmonic Drive"
    },
    {
        ", and a mechanical brake unit. Each wheel could free-wheel in case of drive failure.     Maneuvering capability was provided through the use of front and rear steering motors. Each series-wound DC steering motor was capable of . The front and rear wheels could pivot in opposite directions to achieve a tight turning radius of , or could be decoupled so only front or rear would be used for steering.     Power was provided by two 36-volt ": null
    },
    {
        "silver-zinc": "Silver-Oxide Battery"
    },
    {
        " potassium hydroxide": "Potassium Hydroxide"
    },
    {
        " non-rechargeable batteries": "Primary Cell"
    },
    {
        " with a charge capacity of 121 ": null
    },
    {
        "A·h": "Ampere-Hour"
    },
    {
        " each , yielding a range of . These were used to power the drive and steering motors and also a 36-volt utility outlet mounted on the front of the LRV to power the communications relay unit or the TV camera. LRV batteries and electronics were passively cooled, using change-of-phase wax ": null
    },
    {
        "thermal capacitor": "Thermal Mass"
    },
    {
        " packages and reflective, upward-facing radiating surfaces. While driving, radiators were covered with mylar blankets to minimize dust accumulation. When stopped, the astronauts would open the blankets, and manually remove excess dust from the cooling surfaces with hand brushes.               A T-shaped hand controller situated between the two seats controlled the four drive motors, two steering motors, and brakes. Moving the stick forward powered the LRV forward, left and right turned the vehicle left or right, and pulling backwards activated the brakes. Activating a switch on the handle before pulling back would put the LRV into reverse. Pulling the handle all the way back activated a parking brake. The control and display modules were situated in front of the handle and gave information on the speed, heading, pitch, and power and temperature levels.     Navigation was based on continuously recording direction and distance through use of a ": null
    },
    {
        "directional gyro": "Heading Indicator"
    },
    {
        " and ": null
    },
    {
        "odometer": "Odometer"
    },
    {
        " and feeding this data to a computer that would keep track of the overall direction and distance back to the LM. There was also a Sun-shadow device that could give a manual heading based on the direction of the Sun, using the fact that the Sun moved very slowly in the sky.         Each rover was used on three traverses, one per day over the three-day course of each mission, with the individual performances logged as follows:        An operational constraint on the use of the LRV was that the astronauts must be able to walk back to the LM if the LRV were to fail at any time during the EVA . Thus, the traverses were limited in the distance they could go at the start and at any time later in the EVA. Therefore, they went to the farthest point away from the LM and worked their way back to it so that, as the life support consumables were depleted, their remaining walk back distance was equally diminished. This constraint was relaxed during the longest traverse on Apollo 17, based on the demonstrated reliability of the LRV and spacesuits on previous missions. A paper by Burkhalter and Sharp provides details on usage.             Astronaut deployment of the LRV from the LMs open Quadrant 1 bay was achieved with a system of pulleys and braked reels using ropes and cloth tapes. The rover was folded and stored in the bay with the underside of the chassis facing out. One astronaut would climb the egress ladder on the LM and release the rover, which would then be slowly tilted out by the second astronaut on the ground through the use of reels and tapes. As the rover was let down from the bay, most of the deployment was automatic. The rear wheels folded out and locked in place. When they touched the ground, the front of the rover could be unfolded, the wheels deployed, and the entire frame let down to the surface by pulleys.     The rover components locked into place upon opening. Cabling, pins, and tripods would then be removed and the seats and footrests raised. After switching on all the electronics, the vehicle was ready to back away from the LM.            Four flight-ready LRVs were manufactured, as well as several others for testing and training. Three were transported to and left on the Moon via the ": null
    },
    {
        "Apollo": "Apollo Program"
    },
    {
        " 15, 16, and 17 missions, with the fourth rover used for spare parts on the first three following the ": null
    },
    {
        "cancellation": "Canceled Apollo Missions"
    },
    {
        " of Apollo 18. Since only the upper stages of the lunar excursion modules could return to lunar orbit from the surface, the vehicles, along with the lower stages were abandoned. As a result, the only lunar rovers on display are test vehicles, trainers, and mock-ups.  The rover used on Apollo 15 was left at ": null
    },
    {
        "Hadley-Apennine": "Hadley–Apennine"
    },
    {
        " . The rover used on Apollo 16 was left at ": null
    },
    {
        "Descartes": "Descartes Highlands"
    },
    {
        " . The rover used on Apollo 17 was left at ": null
    },
    {
        "Taurus-Littrow": "Taurus-Littrow"
    },
    {
        "  and was seen by the ": null
    },
    {
        "Lunar Reconnaissance Orbiter": "Lunar Reconnaissance Orbiter"
    },
    {
        " during passes in 2009 and 2011.        Several rovers were created for testing, training, or validation purposes. The engineering mockup is on display at the ": null
    },
    {
        "Museum of Flight": "Museum Of Flight"
    },
    {
        " in ": null
    },
    {
        "Seattle, Washington": "Seattle, Washington"
    },
    {
        ". The Qualification Test Unit is on display at the ": null
    },
    {
        "National Air and Space Museum": "National Air And Space Museum"
    },
    {
        " in ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        " The rover used for vibration testing is on display in the Davidson Saturn V Center at the ": null
    },
    {
        "U.S. Space & Rocket Center": "U.S. Space  &  Rocket Center"
    },
    {
        " in ": null
    },
    {
        "Huntsville, Alabama": "Huntsville, Alabama"
    },
    {
        ". Additional test units are on display at the ": null
    },
    {
        "Johnson Space Center": "Johnson Space Center"
    },
    {
        " in ": null
    },
    {
        "Houston, Texas": "Houston, Texas"
    },
    {
        ", and the ": null
    },
    {
        "Kennedy Space Center Visitors Complex": "Kennedy Space Center Visitors Complex"
    },
    {
        " in ": null
    },
    {
        "Cape Canaveral, Florida": "Cape Canaveral, Florida"
    },
    {
        ".  Replicas of rovers are on display at the ": null
    },
    {
        "National Museum of Naval Aviation": "National Museum Of Naval Aviation"
    },
    {
        " in ": null
    },
    {
        "Pensacola, Florida": "Pensacola, Florida"
    },
    {
        ", the ": null
    },
    {
        "Evergreen Aviation & Space Museum": "Evergreen Aviation  &  Space Museum"
    },
    {
        " in ": null
    },
    {
        "McMinnville, Oregon": "Mcminnville, Oregon"
    },
    {
        ", and the ": null
    },
    {
        "Kansas Cosmosphere and Space Center": "Kansas Cosmosphere And Space Center"
    },
    {
        " in ": null
    },
    {
        "Hutchinson, Kansas": "Hutchinson, Kansas"
    },
    {
        ". A replica on loan from the Smithsonian Institution is on display at the ": null
    },
    {
        "Mission: Space": "Mission: Space"
    },
    {
        " attraction at ": null
    },
    {
        "Epcot": "Epcot"
    },
    {
        " at the ": null
    },
    {
        "Walt Disney World Resort": "Walt Disney World Resort"
    },
    {
        " near ": null
    },
    {
        "Orlando, Florida": "Orlando, Florida"
    },
    {
        ".          Image:Ap16 rover.ogv|": null
    },
    {
        "Apollo 16": "Apollo 16"
    },
    {
        " Commander John Young drives Lunar Rover 002   Image:Apollo 15 Lunar Rover training.ogg|Dave Scott and Jim Irwin train on Earth to use the Lunar Rover on ": null
    },
    {
        "Apollo 15": "Apollo 15"
    }
]