[
    {
        "         Lusitania  or Hispania Lusitana was an ancient Iberian ": null
    },
    {
        "Roman province": "Roman Province"
    },
    {
        " located where modern ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        "  and part of western ": null
    },
    {
        "Spain": "Spain"
    },
    {
        "  lie. It was named after the Lusitani or ": null
    },
    {
        "Lusitanian": "Lusitanians"
    },
    {
        " people .     Its capital was  Emerita Augusta  , and it was initially part of the ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        " province of ": null
    },
    {
        "Hispania Ulterior": "Hispania Ulterior"
    },
    {
        ", before becoming a province of its own in the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        ". Romans first came to the territory around the mid-2nd century BC.  A ": null
    },
    {
        "war with Lusitanian tribes": "Lusitanian War"
    },
    {
        " followed, from 155 to 139 BC. In 27 BC, the province was created.        The etymology of the name of the ": null
    },
    {
        "Lusitani": "Lusitanians"
    },
    {
        " remains unclear. Popular etymology connected the name to a supposed Roman demigod ": null
    },
    {
        "Lusus": "Lusus"
    },
    {
        ", whereas some early-modern scholars suggested that Lus was a form of the Celtic ": null
    },
    {
        "Lugus": "Lugus"
    },
    {
        " followed by another root tan-, supposed to mean tribe ,  while others derived the name from Lucis, an ancient people mentioned in ": null
    },
    {
        "Avienus Ora Maritima": "Avienus"
    },
    {
        " and from tan , or from tain, meaning a region or implying a country of waters , a root word that formerly meant a prince or sovereign governor of a region.        Ancient Romans, such as ": null
    },
    {
        "Pliny the Elder": "Pliny The Elder"
    },
    {
        "  and ": null
    },
    {
        "Varro": "Marcus Terentius Varro"
    },
    {
        " , speculated that the name Lusitania had Roman origins, as when Pliny says lusum enim Liberi Patris aut lyssam cum eo bacchantium nomen dedisse Lusitaniae et Pana praefectum eius universae Lusitania takes its name from the  Lusus  associated with Bacchus and the  Lyssa  of his ": null
    },
    {
        "Bacchantes": "Bacchantes"
    },
    {
        ", and ": null
    },
    {
        "Pan": "Pan"
    },
    {
        " is its governor.     Lusus is usually translated as game or play , while lyssa is a borrowing from the ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " λυσσα, frenzy or rage , and sometimes ": null
    },
    {
        "Rage": "Rage"
    },
    {
        " personified; for later poets, Lusus and Lyssa become flesh-and-blood companions of ": null
    },
    {
        "Bacchus": "Dionysus"
    },
    {
        ". ": null
    },
    {
        "Luís de Camões": "Luís De Camões"
    },
    {
        " epic  Os Lusíadas  , which portrays Lusus as the founder of Lusitania, extends these ideas, which have no connection with modern etymology.     In his work, ": null
    },
    {
        "Geography": "Geographica"
    },
    {
        ", the classical geographer ": null
    },
    {
        "Strabo": "Strabo"
    },
    {
        " suggests a change had occurred in the use of the name Lusitanian . He mentions a group who had once been called Lusitanians living north of the Douro river but were called in his day Callacans .             ": null
    }
]