[
    {
        "             Mancala is one of the oldest known games to still be widely played today. Mancala is a ": null
    },
    {
        "generic": "Wikt:Generic"
    },
    {
        " name for a family of two-player ": null
    },
    {
        "turn-based": "Turns, Rounds And Time-Keeping Systems In Games"
    },
    {
        " strategy": "Strategy Game"
    },
    {
        "board games": "Board Game"
    },
    {
        " played with small stones, beans, or seeds and rows of holes or pits in the earth, a board or other playing surface. The objective is usually to capture all or some set of the opponents pieces. Versions of the game date back to the 7th century, and evidence suggests the game existed in ancient Egypt.          The name is a classification or type of game, rather than any specific game. Some of the most popular ": null
    },
    {
        "mancala games": "List Of Mancala Games"
    },
    {
        " are:   ": null
    },
    {
        "Ali Guli Mane": "Ali Guli Mane"
    },
    {
        " or ": null
    },
    {
        "Pallanguzhi": "Pallanguzhi"
    },
    {
        ", played in Southern India.   It is also called Omanu Guntalu in Telugu, played in rural areas of Telangana, India.   ": null
    },
    {
        "Bao la Kiswahili": "Bao"
    },
    {
        " – played in most of ": null
    },
    {
        "East Africa": "East Africa"
    },
    {
        " including ": null
    },
    {
        "Kenya": "Kenya"
    },
    {
        ", ": null
    },
    {
        "Tanzania": "Tanzania"
    },
    {
        ", ": null
    },
    {
        "Comoros": "Comoros"
    },
    {
        ", ": null
    },
    {
        "Malawi": "Malawi"
    },
    {
        ", as well as some areas of ": null
    },
    {
        "DR Congo": "Democratic Republic Of The Congo"
    },
    {
        " and ": null
    },
    {
        "Burundi": "Burundi"
    },
    {
        ". Hyde , pp. 226-232   Gebeta - Ethiopian and Eritrea, especially in Tigrai.   ": null
    },
    {
        "Kalah": "Kalah"
    },
    {
        " – ": null
    },
    {
        "North American": "William Julius Champion, Jr."
    },
    {
        " variation, the most popular variant in the ": null
    },
    {
        "Western world": "Western World"
    },
    {
        ".   ": null
    },
    {
        "Oware": "Oware"
    },
    {
        "  – ": null
    },
    {
        "Ashanti": "Ashanti People"
    },
    {
        ", but played world-wide with close variants played throughout ": null
    },
    {
        "West Africa": "West Africa"
    },
    {
        "  and in the ": null
    },
    {
        "Caribbean": "Caribbean"
    },
    {
        ".      ": null
    },
    {
        "Toguz korgool": "Toguz Korgool"
    },
    {
        " or Toguz kumalak – played in Kyrgyzstan and Kazakhstan.   Igisoro, played in Rwanda.     A notable subtype of mancala are the ": null
    },
    {
        "Southeast Asian mancalas": "Southeast Asian Mancala"
    },
    {
        " like the Malaysian congkak, Indonesians congklak or dakon, and Filipino sungka, among others. They differ from other mancala types in that the players store is included in the placing of the seeds. The most common type has seven holes for each player, in addition to the player store holes. This version has identical rules throughout its range. But there are also numerous variations with the number of holes and rules by region. Sometimes more than one version can be played in a single locality.      Although more than 800 names of traditional mancala games are known, some names denote the same game, while some names are used for more than one game. Almost 200 modern invented versions have also been described.          Evidence of the game was uncovered in Israel in the city of Gedera in an excavated Roman bathhouse where pottery boards and rock cuts were unearthed dating back to between the 2nd and 3rd century AD. Among other early evidence of the game are fragments of a pottery board and several rock cuts found in ": null
    },
    {
        "Aksumite": "Kingdom Of Aksum"
    },
    {
        " areas in ": null
    },
    {
        "Matara": "Matara, Eritrea"
    },
    {
        "  and ": null
    },
    {
        "Yeha": "Yeha"
    },
    {
        " , which are dated by archaeologists to between the 6th and 7th century AD; the game may have been mentioned by ": null
    },
    {
        "Giyorgis of Segla": "Giyorgis Of Segla"
    },
    {
        " in his 14th century ": null
    },
    {
        "Geez": "Geez Language"
    },
    {
        " text Mysteries of Heaven and Earth, where he refers to a game called ": null
    },
    {
        "qarqis": "Qarqis"
    },
    {
        ", a term used in ": null
    },
    {
        "Geez": "Geez Language"
    },
    {
        " to refer to both Gebeta and Santaraz .      The similarity of some aspects of the game to ": null
    },
    {
        "agricultural": "Agriculture"
    },
    {
        " activity and the absence of a need for specialized equipment present the intriguing possibility that it could date to the beginnings of ": null
    },
    {
        "civilization": "Civilization"
    },
    {
        " itself; however, there is little verifiable evidence that the game is older than about 1300 years. Some purported evidence comes from the ": null
    },
    {
        "Kurna temple": "Kurna Temple"
    },
    {
        " graffiti": "Graffiti"
    },
    {
        " in Egypt, as reported by Parker in 1909 and Murray in his A History of Board-Games Other Than Chess. However, accurate dating of this graffiti seems to be unavailable, and what designs have been found by modern scholars generally resemble games common to the Roman world, rather than anything like Mancala.     Some historians believe that Mancala is the oldest game in the world based on the archaeological evidence found in ": null
    },
    {
        "Jordan": "Jordan"
    },
    {
        " that dates around 6000 BCE. The game might have been played by ancient ": null
    },
    {
        "Nabataeans": "Nabataeans"
    },
    {
        " and could have been an ancient version of the modern Mancala game.      Although the games existed in pockets in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        "—it is recorded as being played as early as the 17th century by merchants in ": null
    },
    {
        "England": "England"
    },
    {
        "—it has never gained much popularity in most regions, except in the Baltic area, where once it was a very popular game , and Bosnia, where it is called Ban-Ban and still played today. Mancala has also been found in Serbia and in Greece . Two Mancala tables from the early 18th century are to be found in ": null
    },
    {
        "Weikersheim Castle": "Weikersheim Castle"
    },
    {
        " in southern Germany.      The United States has a larger mancala-playing population. A traditional mancala game called Warra was still played in ": null
    },
    {
        "Louisiana": "Louisiana"
    },
    {
        " in the early 20th century, and a commercial version called ": null
    },
    {
        "Kalah": "Kalah"
    },
    {
        " became popular in the 1940s. In ": null
    },
    {
        "Cape Verde": "Cape Verde"
    },
    {
        ", mancala is known as ouril . It is played in the Islands and was brought to the United States by Cape Verdean immigrants. It is played to this day in Cape Verdean communities in New England.     Recent studies of Mancala rules have given insight into the distribution of Mancala. This distribution has been linked to migration routes, which may go back several hundred years.  There is evidence that the game was played in Egypt more than one thousand years B.C. It spread from Egypt through other parts of Africa, probably with traders moving up and down the Nile.  . Excavations in ": null
    },
    {
        "Lebanon": "Lebanon"
    },
    {
        " uncovered ": null
    },
    {
        "Phoenician": "Phoenicia"
    },
    {
        " mancala pieces dated from the 6th century B.C. Dated sixth century B.C., the statue was discovered lying on her stomach on a marble floor covering a drainage channel from the Roman period . Two rows of five holes etched into the back revealed that it was also used to support a board game called Mancala, derived from the Arabic word naqala, meaning literally move, said the lead archaeologist, thus referring to the explanations provided by ": null
    },
    {
        "Irving Finkel": "Irving Finkel"
    },
    {
        ", an expert on ancient games in the British Museum.        The word mancala comes from the ": null
    },
    {
        "Arabic": "Arabic Language"
    },
    {
        " word naqala meaning literally to move .    No one game exists with the name mancala; the name is a classification or type of game. This word is used in ": null
    },
    {
        "Syria": "Syria"
    },
    {
        ", ": null
    },
    {
        "Lebanon": "Lebanon"
    },
    {
        ", and ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", but is not consistently applied to any one game, and has been used for ": null
    },
    {
        "backgammon": "Backgammon"
    },
    {
        " in the ancient near east. Mancala is a game that first appeared in Africa, and later, the ancient near east.        Most mancala games share a common general game play. Players begin by placing a certain number of seeds, prescribed for the particular game, in each of the pits on the game board. A player may count their stones to plot the game. A turn consists of removing all seeds from a pit, sowing the seeds and capturing based on the state of board. The object of the game is to plant the most seeds in the bank. This leads to the English phrase count and capture sometimes used to describe the gameplay. Although the details differ greatly, this general sequence applies to all games.     If playing in capture mode, once a player ends his/her turn in an empty pit on his/her own side, he/she captures the opponents pieces directly across. Once captured, the player gets to put the seeds in his/her own bank. After capturing, the opponent forfeits a turn.           Equipment is typically a board, constructed of various materials, with a series of holes arranged in rows, usually two or four. The materials include clay and other shape-able materials. Some games are more often played with holes dug in the earth, or carved in stone. The holes may be referred to as depressions , pits , or houses . Sometimes, large holes on the ends of the board, called stores, are used for holding the pieces.     Playing pieces are seeds, beans, stones, ": null
    },
    {
        "cowry": "Cowry"
    },
    {
        " shells, half-marbles or other small undifferentiated counters that are placed in and transferred about the holes during play.     Board configurations vary among different games but also within variations of a given game; for example ": null
    },
    {
        "Endodoi": "Endodoi"
    },
    {
        " is played on boards from 2×6 to 2×10. The largest are Tchouba  with a board of 160 holes requiring 320 seeds; and En Gehé , played on longer rows with up to 50 pits and using 400 seeds. The most minimalistic variants are Nano-Wari and Micro-Wari, created by the Bulgarian ethnologue Assia Popova. The Nano-Wari board has eight seeds in just two pits; Micro-Wari has a total of four seeds in four pits.     With a two-rank board, players usually are considered to control their respective sides of the board, although moves often are made into the opponents side. With a four-rank board, players control an inner row and an outer row, and a players seeds will remain in these closest two rows unless the opponent captured them.       The objective of most two- and three-row mancala games is to capture more stones than the opponent; in four-row games, one usually seeks to leave the opponent with no legal move or sometimes to capture all counters in their front row.     At the beginning of a players turn, they select a hole with seeds that will be sown around the board. This selection is often limited to holes on the current players side of the board, as well as holes with a certain minimum number of seeds.        In a process known as sowing, all the seeds from a hole are dropped one-by-one into subsequent holes in a motion wrapping around the board. Sowing is an apt name for this activity, since not only are many games traditionally played with seeds, but placing seeds one at a time in different holes reflects the physical act of ": null
    },
    {
        "sowing": "Sowing"
    },
    {
        ". If the sowing action stops after dropping the last seed, the game is considered a single lap game.     Multiple laps or relay sowing is a frequent feature of mancala games, although not universal. When relay sowing, if the last seed during sowing lands in an occupied hole, all the contents of that hole, including the last sown seed, are immediately re-sown from the hole. The process usually will continue until sowing ends in an empty hole. Another common way to receive multiple laps is when the final seed sown lands in your designated hole.     Many games from the ": null
    },
    {
        "India": "India"
    },
    {
        "n subcontinent use pussa kanawa laps. These are like standard multilaps, but instead of continuing the movement with the contents of the last hole filled, a player continues with the next hole. A pussakanawa lap move will then end when a lap ends just prior to an empty hole.   If a player ends his stone with a point move he gets a free turn .       Depending on the last hole sown in a lap, a player may capture stones from the board. The exact requirements for capture, as well as what is done with captured stones, vary considerably among games. Typically, a capture requires sowing to end in a hole with a certain number of stones, ending across the board from stones in specific configurations, or landing in an empty hole adjacent to an opponents hole that contains one or more pieces.     Another common way of capturing is to capture the stones that reach a certain number of seeds at any moment.     Also, several games include the notion of capturing holes, and thus all seeds sown on a captured hole belong at the end of the game to the player who captured it.       Like other ": null
    },
    {
        "board games": "Board Gamepsychology"
    },
    {
        ", mancala games have led to psychological studies. Retschitzki has studied the cognitive processes used by awalé players.  Some of Restchitzkis results on memory and problem solving have recently been simulated by Fernand Gobet with the ": null
    },
    {
        "CHREST": "Chrest"
    },
    {
        " computer model.  ": null
    },
    {
        "De Voogt": "Alexander De Voogt"
    },
    {
        " has studied the psychology of Bao playing. ": null
    }
]