[
    {
        "   Mariculture is a specialized branch of ": null
    },
    {
        "aquaculture": "Aquaculture"
    },
    {
        " involving the cultivation of marine organisms for ": null
    },
    {
        "food": "Food"
    },
    {
        " and other products in the ": null
    },
    {
        "open ocean": "Open Ocean"
    },
    {
        ", an enclosed section of the ocean, or in tanks, ": null
    },
    {
        "ponds": "Ponds"
    },
    {
        " or ": null
    },
    {
        "raceways": "Raceway"
    },
    {
        " which are filled with ": null
    },
    {
        "seawater": "Seawater"
    },
    {
        ". An example of the latter is the farming of ": null
    },
    {
        "marine fish": "Fish"
    },
    {
        ", including ": null
    },
    {
        "finfish": "Finfish"
    },
    {
        " and ": null
    },
    {
        "shellfish": "Shellfish"
    },
    {
        " like ": null
    },
    {
        "prawns": "Prawns"
    },
    {
        ", or ": null
    },
    {
        "oysters": "Oysters"
    },
    {
        " and ": null
    },
    {
        "seaweed": "Seaweed"
    },
    {
        " in saltwater ponds. Non-food products produced by mariculture include: ": null
    },
    {
        "fish meal": "Fish Meal"
    },
    {
        ", ": null
    },
    {
        "nutrient agar": "Agar"
    },
    {
        ", ": null
    },
    {
        "jewellery": "Jewellery"
    },
    {
        " , and ": null
    },
    {
        "cosmetics": "Cosmetics"
    },
    {
        ".                     Similar to algae cultivation, shellfish can be farmed in multiple ways: on ropes, in bags or cages, or directly on the intertidal substrate. Shellfish mariculture does not require feed or fertilizer inputs, nor insecticides or antibiotics, making shellfish ": null
    },
    {
        "aquaculture": "Aquaculture"
    },
    {
        " a self-supporting system.  Shellfish can also be used in ": null
    },
    {
        "multi-species cultivation techniques": "Integrated Multi-Trophic Aquaculture"
    },
    {
        ", where shellfish can utilize waste generated by higher ": null
    },
    {
        "trophic level": "Trophic Level"
    },
    {
        " organisms.       After trials in 2012,    a commercial sea ranch was set up in ": null
    },
    {
        "Flinders Bay": "Flinders Bay"
    },
    {
        ", Western Australia to raise ": null
    },
    {
        "abalone": "Abalone"
    },
    {
        ". The ranch is based on an artificial reef made up of 5000  separate concrete units called abitats . The  abitats can host 400 abalone each. The reef is seeded with young abalone from an onshore hatchery.     The abalone feed on seaweed that has grown naturally on the habitats; with the ecosystem enrichment of the bay also resulting in growing numbers of dhufish, pink snapper, wrasse, Samson fish among other species.     Brad Adams, from the company, has emphasised the similarity to wild abalone and the difference from shore based aquaculture. Were not aquaculture, were ranching, because once theyre in the water they look after themselves.         Raising marine organisms under controlled conditions in exposed, high-energy ocean environments beyond significant coastal influence, is a relatively new approach to mariculture. Open ocean aquaculture uses cages, nets, or long-line arrays that are moored, towed or float freely. Research and commercial open ocean aquaculture facilities are in operation or under development in Panama, Australia, Chile, China, France, Ireland, Italy, Japan, Mexico, and Norway. As of 2004, two commercial open ocean facilities were operating in U.S. waters, raising ": null
    },
    {
        "Threadfin": "Threadfin"
    },
    {
        " near ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        " and ": null
    },
    {
        "cobia": "Cobia"
    },
    {
        " near ": null
    },
    {
        "Puerto Rico": "Puerto Rico"
    },
    {
        ". An operation targeting ": null
    },
    {
        "bigeye tuna": "Bigeye Tuna"
    },
    {
        " recently received final approval. All U.S. commercial facilities are currently sited in waters under state or territorial jurisdiction. The largest deep water open ocean farm in the world is raising cobia 12  km off the northern coast of Panama in highly exposed sites.         Enhanced Stocking is a Japanese principle based on ": null
    },
    {
        "operant conditioning": "Operant Conditioning"
    },
    {
        " and the migratory nature of certain species. The fishermen raise hatchlings in a closely knitted net in a harbor, sounding an underwater horn before each feeding. When the fish are old enough they are freed from the net to mature in the open sea. During spawning season, about 80% of these fish return to their birthplace. The fishermen sound the horn and then net those fish that respond. Arnason, Ragnar  In: The Economics of Ocean Ranching: Experiences, Outlook and Theory, FAO, Rome. .         In ": null
    },
    {
        "seawater": "Seawater"
    },
    {
        " pond mariculture, fish are raised in ponds which receive water from the sea. This has the benefit that the ": null
    },
    {
        "nutrition": "Nutrition"
    },
    {
        "  present in the seawater can be used. This is a great advantage over traditional fish farms for which the farmers buy feed . Other advantages are that ": null
    },
    {
        "water purification plants": "Organisms Used In Water Purification"
    },
    {
        " may be planted in the ponds to eliminate the buildup of ": null
    },
    {
        "nitrogen": "Nitrogen"
    },
    {
        ", from fecal and other contamination. Also, the ponds can be left unprotected from natural predators, providing another kind of filtering. Abend, Lisa   . Time          Mariculture has rapidly expanded over the last two decades due to new technology, improvements in formulated feeds, greater biological understanding of farmed species, increased water quality within closed farm systems, greater demand for ": null
    },
    {
        "seafood products": "Seafood Products"
    },
    {
        ", site expansion and government interest.   Ross, A. . Leaping in the Dark: A Review of the Environmental Impacts of Marine Salmon Farming in Scotland and Proposals for Change. Scottish Environment Link, Perth, Scotland. As a consequence, mariculture has been subject to some controversy regarding its social and environmental impacts.  Jennings, S., Kaiser, M.J., Reynolds, J.D. . Marine Fisheries Ecology. Blackwell, Victoria. Commonly identified environmental impacts from marine farms are:     Wastes from cage cultures;   Farm escapees and invasives;   Genetic pollution and disease and parasite transfer;   Habitat modification.     As with most farming practices, the degree of environmental impact depends on the size of the farm, the cultured species, stock density, type of feed, ": null
    },
    {
        "hydrography": "Hydrography"
    },
    {
        " of the site, and ": null
    },
    {
        "husbandry": "Husbandry"
    },
    {
        " methods.  The adjacent diagram connects these causes and effects.       Mariculture of ": null
    },
    {
        "finfish": "Finfish"
    },
    {
        " can require a significant amount of ": null
    },
    {
        "fishmeal": "Fishmeal"
    },
    {
        " or other high protein food sources. Originally, a lot of fishmeal went to waste due to inefficient feeding regimes and poor digestibility of formulated feeds which resulted in poor ": null
    },
    {
        "feed conversion ratios": "Feed Conversion Ratio"
    },
    {
        ". Forrest B, Keeley N, Gillespie P, Hopkins G, Knight B, Govier D. . Review of the ecological effects of marine finfish aquaculture: final report. Prepared for Ministry of Fisheries. Cawthron Report No. 1285.     In cage culture, several different methods are used for feeding farmed fish – from simple hand feeding to sophisticated computer-controlled systems with automated food dispensers coupled with in situ uptake sensors that detect consumption rates.  In coastal fish farms, overfeeding primarily leads to increased disposition of detritus on the seafloor , while in hatcheries and land-based farms, excess food goes to waste and can potentially impact the surrounding catchment and local coastal environment. This impact is usually highly local, and depends significantly on the settling velocity of waste feed and the current velocity and depth.       The impact of escapees from aquaculture operations depends on whether or not there are wild ": null
    },
    {
        "conspecifics": "Conspecifics"
    },
    {
        " or close relatives in the receiving environment, and whether or not the escapee is reproductively capable. Several different mitigation/prevention strategies are currently employed, from the development of infertile ": null
    },
    {
        "triploids": "Triploid"
    },
    {
        " to land-based farms which are completely isolated from any marine environment.    Escapees can adversely impact local ecosystems through ": null
    },
    {
        "hybridization": "Hybrid"
    },
    {
        " and loss of genetic diversity in native stocks, increase negative interactions within an ecosystem , disease transmission and habitat changes .     The accidental introduction of invasive species is also of concern. Aquaculture is one of the main vectors for invasives following accidental releases of farmed stocks into the wild.  One example is the Siberian sturgeon  which accidentally escaped from a fish farm into the ": null
    },
    {
        "Gironde Estuary": "Gironde Estuary"
    },
    {
        " following a severe storm in December 1999 .  ": null
    },
    {
        "Mollusc": "Mollusc"
    },
    {
        "an farming is another example whereby species can be introduced to new environments by ‘hitchhiking’ on farmed molluscs. Also, farmed molluscs themselves can become dominate predators and/or competitors, as well as potentially spread pathogens and parasites.       One of the primary concerns with mariculture is the potential for ": null
    },
    {
        "disease": "Disease"
    },
    {
        " and ": null
    },
    {
        "parasite": "Parasite"
    },
    {
        " transfer. Farmed stocks are often ": null
    },
    {
        "selectively bred": "Selectively Bred"
    },
    {
        " to increase disease and parasite resistance, as well as improving growth rates and quality of products. As a consequence, the ": null
    },
    {
        "genetic diversity": "Genetic Diversity"
    },
    {
        " within reared stocks decreases with every generation – meaning they can potentially reduce the genetic diversity within wild populations if they escape into those wild populations. Such ": null
    },
    {
        "genetic pollution": "Genetic Pollution"
    },
    {
        " from escaped aquaculture stock can reduce the wild populations ability to adjust to the changing natural environment. Species grown by mariculture can also harbour diseases and parasites which can be introduced to wild populations upon their escape. An example of this is the parasitic ": null
    },
    {
        "sea lice": "Sea Louse"
    },
    {
        " on wild and farmed Atlantic salmon in Canada.  Also, non-indigenous species which are farmed may have resistance to, or carry, particular diseases which could be spread through wild populations if they escape into those wild populations. Such ‘new’ diseases would be devastating for those wild populations because they would have no immunity to them.       With the exception of ": null
    },
    {
        "benthic": "Benthic"
    },
    {
        " habitats directly beneath marine farms, most mariculture causes minimal destruction to habitats. However, the destruction of ": null
    },
    {
        "mangrove": "Mangrove"
    },
    {
        " forests from the farming of shrimps is of concern. Globally, shrimp farming activity is a small contributor to the destruction of ": null
    },
    {
        "mangrove": "Mangrove"
    },
    {
        " forests; however, locally it can be devastating. ": null
    },
    {
        "Mangrove": "Mangrove"
    },
    {
        " forests provide rich matrices which support a great deal of biodiversity – predominately juvenile fish and crustaceans. Kaiser, M.J., Attrill, M.J., Jennings, S., Thomas, D.N., Barnes, D.K.A., Brierley, A.S., Polunin, N.V.C., Raffaelli, D.G., Williams, P.J.le B. . Marine Ecology: Processes, Systems and Impacts. Oxford University Press, New York. Furthermore, they act as buffering systems whereby they reduce coastal erosion, and improve water quality for in situ animals by processing material and ‘filtering’ sediments. Trujillo, A.P., Thurman, H.V. Essentials of Oceanography Ninth Edition. Pearson Prentice Hall. New Jersey.       In addition, ": null
    },
    {
        "nitrogen": "Nitrogen"
    },
    {
        " and ": null
    },
    {
        "phosphorus": "Phosphorus"
    },
    {
        " compounds from food and waste may lead to blooms of ": null
    },
    {
        "phytoplankton": "Phytoplankton"
    },
    {
        ", whose subsequent degradation can drastically reduce ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        " levels. If the ": null
    },
    {
        "algae": "Algae"
    },
    {
        " are toxic, ": null
    },
    {
        "fish": "Fish"
    },
    {
        " are killed and ": null
    },
    {
        "shellfish": "Shellfish"
    },
    {
        " contaminated.   UNEP, World Fisheries Trust. .  THE EFFECTS OF MARICULTURE ON BIODIVERSITY       Mariculture development must be sustained by basic and applied research and development in major fields such as nutrition , genetics , system management, product handling, and socioeconomics . One approach is closed systems that have no direct interaction with the local environment. However, investment and operational cost are currently significantly higher than open cages, limiting them to their current role as hatcheries.       Sustainable mariculture promises economic and environmental benefits. Economies of scale imply that ranching can produce fish at lower cost than industrial fishing, leading to better human diets and the gradual elimination of unsustainable fisheries. Fish grown by mariculture are also perceived to be of higher quality than fish raised in ponds or tanks, and offer more diverse choice of species. Consistent supply and quality control has enabled integration in food market channels.           ;Fish     European sea bass   Bigeye tuna   Cobia   Grouper   Snapper   Pompano   Salmon   Pearlspot   Mullet   Pomfret   Barramundi     ;Shellfish/Crustaceans     Abalone   Oysters   Prawn   Mussels     ;Plants   Seaweeds       Scientific literature on mariculture can be found in the following journals:     ": null
    },
    {
        "Applied and Environmental Microbiology": "Applied And Environmental Microbiology"
    },
    {
        "   Aquaculture": "Aquaculture"
    },
    {
        "   Aquaculture Research": "Aquaculture Research"
    },
    {
        "   Journal of Marine Science": "Journal Of Marine Science"
    },
    {
        "   Marine Resource Economics": "Marine Resource Economics"
    },
    {
        "   Ocean Shoreline Management": "Ocean Shoreline Management"
    },
    {
        "   Journal of Applied Phycology": "Journal Of Applied Phycology"
    },
    {
        "   Journal of Experimental Marine Biology and Ecology": "Journal Of Experimental Marine Biology And Ecology"
    },
    {
        "   Journal of Phycology": "Journal Of Phycology"
    },
    {
        "   Journal of Shellfish Research": "Journal Of Shellfish Research"
    },
    {
        "   Reviews in Fish Biology and Fisheries": "Reviews In Fish Biology And Fisheries"
    },
    {
        "   Reviews in Fisheries Science": "Reviews In Fisheries Science"
    }
]