[
    {
        "            Mary II was Queen ": null
    },
    {
        "of England": "List Of English Monarchs"
    },
    {
        ", ": null
    },
    {
        "Scotland": "List Of Scottish Monarchs"
    },
    {
        ", and ": null
    },
    {
        "Ireland": "List Of Irish Monarchs"
    },
    {
        ", co-reigning with her husband, King ": null
    },
    {
        "William III & II": "William Iii  &  Ii"
    },
    {
        ", from 1689 until her death. Popular histories usually refer to their joint reign as that of William and Mary.     Although their father ": null
    },
    {
        "James, Duke of York": "James, Duke Of York"
    },
    {
        ", was ": null
    },
    {
        "Roman Catholic": "Roman Catholic"
    },
    {
        ", Mary and her sister ": null
    },
    {
        "Anne": "Anne, Queen Of Great Britain"
    },
    {
        " were raised as ": null
    },
    {
        "Anglicans": "Anglicans"
    },
    {
        " at the wishes of their uncle, ": null
    },
    {
        "King Charles II": "Charles Ii Of England"
    },
    {
        ". He lacked legitimate children, making Mary second in the line of succession as Jamess eldest child. She married her ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        " first cousin, William of Orange, in 1677. Charles died in 1685 and James took the throne, making Mary ": null
    },
    {
        "heir presumptive": "Heir Presumptive"
    },
    {
        ". Jamess attempts at ": null
    },
    {
        "rule by decree": "Rule By Decree"
    },
    {
        " and the birth of his son, ": null
    },
    {
        "James Francis Edward Stuart": "James Francis Edward Stuart"
    },
    {
        ", led to his deposition in the ": null
    },
    {
        "Glorious Revolution": "Glorious Revolution"
    },
    {
        " and the adoption of the ": null
    },
    {
        "English Bill of Rights": "English Bill Of Rights"
    },
    {
        ".     William and Mary became king and ": null
    },
    {
        "queen regnant": "Queen Regnant"
    },
    {
        ". She wielded less power than him when he was in England, ceding most of her authority to him, though he heavily relied on her. She did, however, act alone when William was engaged in military campaigns abroad, proving herself to be a powerful, firm, and effective ruler. Her death left William as sole ruler until his own death in 1702, when he was succeeded by Marys sister Anne.       Mary, born at ": null
    },
    {
        "St Jamess Palace": "St Jamess Palace"
    },
    {
        " in London on 30 April 1662, was the eldest daughter of the Duke of York , and his first wife, ": null
    },
    {
        "Anne Hyde": "Anne Hyde"
    },
    {
        ". Marys uncle was ": null
    },
    {
        "King Charles II": "Charles Ii Of England"
    },
    {
        ", who ruled the three kingdoms of ": null
    },
    {
        "England": "Kingdom Of England"
    },
    {
        ", ": null
    },
    {
        "Scotland": "Kingdom Of Scotland"
    },
    {
        " and ": null
    },
    {
        "Ireland": "Kingdom Of Ireland"
    },
    {
        "; her maternal grandfather, ": null
    },
    {
        "Edward Hyde, 1st Earl of Clarendon": "Edward Hyde, 1St Earl Of Clarendon"
    },
    {
        ", served for a lengthy period as Charless chief advisor. She was baptised into the ": null
    },
    {
        "Anglican": "Anglicanism"
    },
    {
        " faith in the ": null
    },
    {
        "Chapel Royal": "Chapel Royal"
    },
    {
        " at St Jamess, and was named after her ancestor, ": null
    },
    {
        "Mary, Queen of Scots": "Mary, Queen Of Scots"
    },
    {
        ". Her godparents included her fathers cousin, ": null
    },
    {
        "Prince Rupert of the Rhine": "Prince Rupert Of The Rhine"
    },
    {
        ". Waller, p. 249 Although her mother bore eight children, all except Mary and her younger sister ": null
    },
    {
        "Anne": "Anne, Queen Of Great Britain"
    },
    {
        " died very young, and King Charles II had no legitimate children. Consequently, for most of her childhood, Mary was second in line to the throne after her father. Waller, p. 252      The Duke of York converted to Roman Catholicism in 1668 or 1669 and the Duchess about eight years earlier, but Mary and Anne were brought up as Anglicans, pursuant to the command of Charles II. Van der Kiste, p. 32 They were moved to their own establishment at ": null
    },
    {
        "Richmond Palace": "Richmond Palace"
    },
    {
        ", where they were raised by their governess ": null
    },
    {
        "Lady Frances Villiers": "Edward Villiers"
    },
    {
        ", with only occasional visits to see their parents at St Jamess or their grandfather Lord Clarendon at ": null
    },
    {
        "Twickenham": "Twickenham"
    },
    {
        ". Waller, p. 251 Marys education, from private tutors, was largely restricted to music, dance, drawing, French, and religious instruction. Waller, pp. 251–253 Her mother died in 1671, and her father remarried in 1673, taking as his second wife ": null
    },
    {
        "Mary of Modena": "Mary Of Modena"
    },
    {
        ", a Catholic who was only four years older than Mary. Waller, p. 255     From about the age of nine until her marriage, Mary wrote passionate letters to an older girl, ": null
    },
    {
        "Frances Apsley": "Frances Apsley"
    },
    {
        ", the daughter of courtier ": null
    },
    {
        "Sir Allen Apsley": "Allen Apsley"
    },
    {
        ". Mary signed herself Mary Clorine; Apsley was Aurelia. In time, Frances became uncomfortable with the correspondence, Van der Kiste, p. 34 and replied more formally. At the age of fifteen, Mary became betrothed to her cousin, the Protestant ": null
    },
    {
        "Stadtholder": "Stadtholder"
    },
    {
        " of ": null
    },
    {
        "Holland": "Holland"
    },
    {
        ", ": null
    },
    {
        "William III of Orange": "William Iii Of Orange"
    },
    {
        ". William was the son of the Kings late sister, ": null
    },
    {
        "Mary, Princess Royal": "Mary, Princess Royal And Princess Of Orange"
    },
    {
        ", and thus fourth in the line of succession after James, Mary, and Anne. Waller, p. 256 At first, Charles II opposed the alliance with the Dutch ruler—he preferred that Mary wed the heir to the French throne, the ": null
    },
    {
        "Dauphin Louis": "Louis, Dauphin Of France"
    },
    {
        ", thus allying his realms with Catholic France and strengthening the odds of an eventual Catholic successor in Britain; but later, under pressure from Parliament and with a coalition with the Catholic French no longer politically favourable, he approved the proposed union.  The Duke of York agreed to the marriage, after pressure from chief minister ": null
    },
    {
        "Lord Danby": "Thomas Osborne, 1St Duke Of Leeds"
    },
    {
        " and the King, who incorrectly assumed that it would improve Jamess popularity among Protestants. Van der Kiste, pp. 44–45 When James told Mary that she was to marry her cousin, she wept all that afternoon and all the following day . Marys chaplain, ": null
    },
    {
        "Dr Edward Lake": "Edward Lake"
    },
    {
        ", quoted in Waller, p. 257          William and a tearful Mary were married in St Jamess Palace by Bishop ": null
    },
    {
        "Henry Compton": "Henry Compton"
    },
    {
        " on 4 November 1677. Van der Kiste, pp. 47–48; Waller, p. 258 Mary accompanied her husband on a rough sea crossing back to the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        " later that month, after a delay of two weeks caused by bad weather. Van der Kiste, pp. 50–51; Waller, p. 259 ": null
    },
    {
        "Rotterdam": "Rotterdam"
    },
    {
        " was inaccessible because of ice, and they were forced to land at the small village of ": null
    },
    {
        "Ter Heijde": "Ter Heijde"
    },
    {
        ", and walk through the frosty countryside until met by coaches to take them to ": null
    },
    {
        "Huis Honselaarsdijk": "Huis Honselaarsdijk"
    },
    {
        ". Van der Kiste, p. 51; Waller, pp. 258–259 On 14 December, they made a formal entry to ": null
    },
    {
        "The Hague": "The Hague"
    },
    {
        " in a grand procession. Van der Kiste, p. 52     Marys animated and personable nature made her popular with the Dutch people, and her marriage to a Protestant prince was popular in Britain. Waller, pp. 257–259 She was devoted to her husband, but he was often away on campaigns, which led to Marys family supposing him to be cold and neglectful. Waller, pp. 259–262 Within months of the marriage Mary was pregnant; however, on a visit to her husband at the fortified city of ": null
    },
    {
        "Breda": "Breda"
    },
    {
        ", she suffered a miscarriage, which may have permanently impaired her ability to have children. Van der Kiste, pp. 55–58; Waller, p. 261 She suffered further bouts of illness that may have been miscarriages in mid-1678, early 1679, and early 1680. Van der Kiste, pp. 57, 58, 62 Her childlessness would be the greatest source of unhappiness in her life. Van der Kiste, p. 162; Waller, p. 262     From May 1684, King Charless illegitimate son, ": null
    },
    {
        "James Scott, Duke of Monmouth": "James Scott, 1St Duke Of Monmouth"
    },
    {
        ", lived in the Netherlands, where he was fêted by William and Mary. Monmouth was viewed as a rival to the Duke of York, and as a potential Protestant heir who could supplant the Duke in the line of succession. William, however, did not consider him a viable alternative and correctly assumed that Monmouth had insufficient support. Van der Kiste, pp. 72–73          Upon the death of Charles II without legitimate issue in February 1685, the Duke of York became king as James II in England and Ireland and James VII in Scotland. Mary was playing cards when her husband informed her of her fathers accession, and that she was ": null
    },
    {
        "heir presumptive": "Heir Presumptive"
    },
    {
        ". Van der Kiste, p. 76     When Charless illegitimate son the Duke of Monmouth assembled an invasion force at Amsterdam, and sailed for Britain, William informed James of the Dukes departure, and ordered English regiments in the Low Countries to return to Britain. Van der Kiste, p. 78 To Williams relief, Monmouth was defeated, captured and executed, but both he and Mary were dismayed by Jamess subsequent actions. Van der Kiste, p. 79     James had a controversial religious policy; his attempt to grant freedom of religion to non-": null
    },
    {
        "Anglicans": "Church Of England"
    },
    {
        " by suspending acts of Parliament by royal decree was not well received. Van der Kiste, p. 91 Mary considered such action illegal, and her chaplain expressed this view in a letter to the ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        ", ": null
    },
    {
        "William Sancroft": "William Sancroft"
    },
    {
        ", on her behalf. Waller, p. 265 She was further dismayed when James refused to help when the Catholic King of France, ": null
    },
    {
        "Louis XIV": "Louis Xiv"
    },
    {
        ", invaded ": null
    },
    {
        "Orange": "Principality Of Orange"
    },
    {
        " and persecuted ": null
    },
    {
        "Huguenot": "Huguenot"
    },
    {
        " refugees there. In an attempt to damage William, James encouraged his daughters staff to inform her that William was having an affair with ": null
    },
    {
        "Elizabeth Villiers": "Elizabeth Villiers"
    },
    {
        ", the daughter of her childhood governess Frances Villiers. Acting on the information, Mary waited outside Villierss room and caught her husband leaving it late at night. William denied adultery, and Mary apparently believed and forgave him. Van der Kiste, p. 81; Waller, p. 264 Possibly, Villiers and William were not meeting as lovers but to exchange diplomatic intelligence. Van der Kiste p. 64; Waller, p. 264 Marys staff was dismissed and sent back to Britain. Van der Kiste, p. 82; Waller, p. 264             Disgruntled Protestant politicians and noblemen were in contact with Marys husband as early as 1686. Van der Kiste, p. 86 After James took the step of forcing Anglican clergymen to read the ": null
    },
    {
        "Declaration of Indulgence": "Declaration Of Indulgence"
    },
    {
        "—the proclamation granting religious liberty to Catholics and ": null
    },
    {
        "dissenters": "Dissenter"
    },
    {
        "—from their churches in May 1688, his popularity plunged further. Alarm amongst Protestants increased when his wife, ": null
    },
    {
        "Mary of Modena": "Mary Of Modena"
    },
    {
        ", gave birth to a son—": null
    },
    {
        "James Francis Edward": "James Francis Edward Stuart"
    },
    {
        "—in June 1688, for the son would, unlike Mary and Anne, be raised a Roman Catholic. Some charged that the boy was supposititious , having been secretly smuggled into the Queens room in a bed-warming pan as a substitute for her stillborn baby. Van der Kiste, p. 92 Seeking information, Mary sent a pointed list of questions to her sister, Anne, regarding the circumstances of the birth. Annes reply, and continued gossip, seemed to confirm Marys suspicions that the child was not her natural brother, and that her father was conspiring to secure a Catholic succession. Van der Kiste, pp. 90, 94–95; Waller, pp. 268–269     On 30 June, the ": null
    },
    {
        "Immortal Seven": "Immortal Seven"
    },
    {
        " secretly requested William—then in the ": null
    },
    {
        "Dutch Republic": "Dutch Republic"
    },
    {
        " with Mary—to come to England with an army to depose James. Van der Kiste, pp. 93–94 William had made known earlier that a military intervention, for which he had been assembling forces, would be conditional on such an invitation. At first, William was still reluctant; possibly he was jealous of his wifes position as the heiress to the English Crown and feared she would become more powerful than he was. According to ": null
    },
    {
        "Gilbert Burnet": "Gilbert Burnet"
    },
    {
        ", however, Mary convinced her husband that she did not care for political power, and told him she would be no more but his wife, and that she would do all that lay in her power to make him King for life .  She would, she assured him, always obey her husband as she had promised to do in her marriage vows. Van der Kiste, p. 85; Waller, p. 266     William agreed to invade and issued a declaration which referred to Jamess newborn son as the pretended Prince of Wales . He also gave a list of grievances of the English people and stated that his proposed expedition was for the sole purpose of having a free and lawful Parliament assembled . Van der Kiste, p. 98 William and the Dutch army, without Mary who stayed behind in the Netherlands, finally landed on 5 November 1688, having been turned back by storms in October. Van der Kiste, pp. 100–102 The disaffected English Army and Navy went over to William, Van der Kiste, p. 104 and on 11 December the defeated King James attempted to flee, but was intercepted. A second attempt at flight, on 23 December, was successful; William deliberately allowed James to escape to France, where he lived in exile until his death. Van der Kiste, pp. 105–107     Mary was upset by the circumstances surrounding the deposition of her father, and was torn between concern for him and duty to her husband, but was convinced that her husbands actions, however unpleasant, were necessary to save the Church and State . Van der Kiste, p. 95; Waller, pp. 269–271 When Mary travelled to England after the New Year, she wrote of her secret joy at returning to her homeland, but that was soon checked with the consideration of my fathers misfortunes . Mary, quoted by Van der Kiste, p. 113 and Waller, p. 271 William ordered her to appear cheerful on their triumphant arrival in London. As a result, she was criticised by ": null
    },
    {
        "Sarah Churchill": "Sarah Churchill, Duchess Of Marlborough"
    },
    {
        " among others, for appearing cold to her fathers plight. Van der Kiste, p. 113; Waller, pp. 272–273 James, too, wrote a diatribe against her criticising her disloyalty, an action which deeply affected the pious Mary.       In January 1689, a ": null
    },
    {
        "Convention Parliament": "Convention Parliament"
    },
    {
        " summoned by the Prince of Orange assembled, and much discussion relating to the appropriate course of action ensued. Waller, p. 274 A party led by ": null
    },
    {
        "Lord Danby": "Thomas Osborne, 1St Duke Of Leeds"
    },
    {
        " held that Mary should be sole monarch, as the rightful hereditary heir, while William and his supporters were adamant that a husband could not be subject to his wife. Waller, pp. 274–275 William wished to reign as a king, rather than function as a mere consort of a queen. Van der Kiste, p. 108; Waller, p. 273 For her part, Mary did not wish to be queen regnant, believing that women should defer to their husbands, and knowing my heart is not made for a kingdom and my inclination leads me to a retired quiet life . Mary, quoted in Van der Kiste, p. 114 and Waller, p. 273     On 13 February 1689, Parliament passed the ": null
    },
    {
        "Declaration of Right": "Declaration Of Right, 1689"
    },
    {
        ", in which it deemed that James, by attempting to flee on 11 December 1688, had abdicated the government of the realm, and that the Throne had thereby become vacant.   Parliament offered the Crown not to Jamess eldest son, ": null
    },
    {
        "James Francis Edward": "James Francis Edward Stuart"
    },
    {
        " , but to William and Mary as joint sovereigns. The only precedent for a joint monarchy dated from the sixteenth century: when ": null
    },
    {
        "Queen Mary I": "Mary I Of England"
    },
    {
        " married ": null
    },
    {
        "Philip of Spain": "Philip Ii Of Spain"
    },
    {
        ", it was agreed that the latter would take the title of king, but only during his wifes lifetime, and restrictions were placed on his power. William, however, would be king even after his wifes death, and the sole and full exercise of the regal power executed by the said Prince of Orange in the names of the said Prince and Princess during their joint lives. The declaration was later extended to exclude not only James and his heirs from the throne, but all Catholics, since it hath been found by experience that it is inconsistent with the safety and welfare of this Protestant kingdom to be governed by a papist prince .     The ": null
    },
    {
        "Bishop of London": "Bishop Of London"
    },
    {
        ", ": null
    },
    {
        "Henry Compton": "Henry Compton"
    },
    {
        " , crowned William and Mary together at ": null
    },
    {
        "Westminster Abbey": "Westminster Abbey"
    },
    {
        " on 11 April 1689. Normally, the ": null
    },
    {
        "Archbishop of Canterbury": "Archbishop Of Canterbury"
    },
    {
        " performs coronations, but the incumbent Archbishop, ": null
    },
    {
        "William Sancroft": "William Sancroft"
    },
    {
        ", although an ": null
    },
    {
        "Anglican": "Anglican"
    },
    {
        ", refused to recognise the validity of James IIs removal.  Neither William nor Mary enjoyed the ceremony; she thought it all vanity and William called it Popish . Van der Kiste, p. 118 On the same day, the Convention of the ": null
    },
    {
        "Estates of Scotland": "Estates Of Scotland"
    },
    {
        "—which was much more divided than the English Parliament—finally declared that James was no longer King of Scotland, that no Papist can be King or Queen of this Realm , that William and Mary would be joint sovereigns, and that William would exercise sole and full power. The following day, they were proclaimed king and queen in Edinburgh. They took the Scottish coronation oath in London on 11 May.     Even after the declaration, there was still substantial support for James in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ". ": null
    },
    {
        "Viscount Dundee": "John Graham Of Claverhouse"
    },
    {
        " raised an army in the ": null
    },
    {
        "Scottish Highlands": "Scottish Highlands"
    },
    {
        " and won a convincing victory at ": null
    },
    {
        "Killiecrankie": "Battle Of Killiecrankie"
    },
    {
        " on 27 July. The huge losses suffered by Dundees troops, however, coupled with his fatal wounding at the start of the battle, served to remove the only effective resistance to William and the uprising was quickly crushed, suffering a resounding defeat the next month at the ": null
    },
    {
        "Battle of Dunkeld": "Battle Of Dunkeld"
    },
    {
        ".            In December 1689, Parliament passed one of the most important constitutional documents in English history, the ": null
    },
    {
        "Bill of Rights": "Bill Of Rights 1689"
    },
    {
        ". This measure—which restated and confirmed many provisions of the earlier Declaration of Right—established restrictions on the ": null
    },
    {
        "royal prerogative": "Royal Prerogative"
    },
    {
        "; it declared, among other things, that the Sovereign could not suspend laws passed by Parliament, levy taxes without parliamentary consent, infringe the ": null
    },
    {
        "right to petition": "Right To Petition"
    },
    {
        ", raise a standing army during peacetime without parliamentary consent, deny the ": null
    },
    {
        "right to bear arms": "Right To Bear Arms"
    },
    {
        " to Protestant subjects, unduly interfere with parliamentary elections, punish members of either House of Parliament for anything said during debates, require excessive bail, or inflict cruel or unusual punishments. The Bill of Rights also confirmed the succession to the throne. Following the death of either William III or Mary II, the other was to continue to reign. Next in the line of succession would be any children of the couple, to be followed by Marys sister Anne and her children. Last in the line of succession stood any children William III might have had from any subsequent marriage.      From 1690 onwards, William was often absent from England on campaign, each year generally from the spring until the autumn. In 1690, he fought ": null
    },
    {
        "Jacobites": "Jacobitism"
    },
    {
        " in Ireland. William had crushed the Irish Jacobites by 1692, but he continued with campaigns abroad to wage war against France in the Netherlands. Whilst her husband was away, Mary administered the government of the realm with the advice of a nine-member Cabinet Council. Van der Kiste, p. 138 See also the ": null
    },
    {
        "Absence of King William Act 1689": "Absence Of King William Act 1689"
    },
    {
        ". She was not keen to assume power and felt deprived of all that was dear to me in the person of my husband, left among those that were perfect strangers to me: my sister of a humour so reserved that I could have little comfort from her. Memoirs of Mary, Queen of England edited by R. Doebner , quoted in Van der Kiste, p. 138 Anne had quarrelled with William and Mary over money, and the relationship between the two sisters had soured. Van der Kiste, pp. 130–131       ": null
    }
]