[
    {
        "     Matilda of Tuscany  was a powerful ": null
    },
    {
        "feudal": "Feudalism"
    },
    {
        " Margravine of Tuscany": "Margrave Of Tuscany"
    },
    {
        ", ruler in northern Italy and the chief Italian supporter of ": null
    },
    {
        "Pope Gregory VII": "Pope Gregory Vii"
    },
    {
        " during the ": null
    },
    {
        "Investiture Controversy": "Investiture Controversy"
    },
    {
        "; in addition, she was one of the few medieval women to be remembered for her military accomplishments, thanks to which she was able to dominate all the territories north of the ": null
    },
    {
        "Papal States": "Papal States"
    },
    {
        ".     In 1076 she came into possession of a substantial territory that included present-day ": null
    },
    {
        "Lombardy": "Lombardy"
    },
    {
        ", ": null
    },
    {
        "Emilia": "Emilia"
    },
    {
        ", the ": null
    },
    {
        "Romagna": "Romagna"
    },
    {
        " and ": null
    },
    {
        "Tuscany": "Tuscany"
    },
    {
        ", and made the castle of ": null
    },
    {
        "Canossa": "Canossa"
    },
    {
        ", in the Apennines south of Reggio, the centre of her domains. Between 6 and 11 May 1111 she was crowned Imperial Vicar and Vice-Queen of Italy by ": null
    },
    {
        "Henry V, Holy Roman Emperor": "Henry V, Holy Roman Emperor"
    },
    {
        " at the Castle of Bianello . Every year, usually in the last Sunday of May, this episode is recreated in the ": null
    },
    {
        "Corteo Storico Matildico": "Corteo Storico Matildico"
    },
    {
        ".     Sometimes called la Gran Contessa or Matilda of Canossa after her ": null
    },
    {
        "ancestral": "Count Of Canossa"
    },
    {
        " castle of ": null
    },
    {
        "Canossa": "Canossa"
    },
    {
        ", Matilda was one of the most important figures of the ": null
    },
    {
        "Italian Middle Ages": "Italy In The Middle Ages"
    },
    {
        ". She lived in a period of constant battles, intrigues and ": null
    },
    {
        "excommunications": "Excommunication"
    },
    {
        ", and was able to demonstrate an extraordinary force, even enduring great pain and humiliation, showing an innate leadership ability.          In a miniature in the early twelfth-century Vita Mathildis by the monk ": null
    },
    {
        "Donizo": "Donizo"
    },
    {
        " , Matilda is referred to as Resplendent Matilda . Since the Latin word lucens is similar to lucensis , this may also be a reference to Matildas origins. She was descended from the nobleman ": null
    },
    {
        "Sigifred of Lucca": "Sigifred Of Lucca"
    },
    {
        ",   and was the youngest of the three children of ": null
    },
    {
        "Margrave Boniface III of Tuscany": "Boniface Iii, Margrave Of Tuscany"
    },
    {
        ", ruler of a substantial territory in Northern Italy and one of the most powerful vassals of the ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        " Henry III": "Henry Iii, Holy Roman Emperor"
    },
    {
        ". Matildas mother, ": null
    },
    {
        "Beatrice of Lorraine": "Beatrice Of Lorraine"
    },
    {
        ", was the Emperors first cousin and closely connected to the imperial household. Renowned for her learning, Matilda was literate in ": null
    },
    {
        "Latin": "Latin Language"
    },
    {
        ", as well as reputed to speak ": null
    },
    {
        "German": "Middle High German"
    },
    {
        " and ": null
    },
    {
        "French": "Old French"
    },
    {
        ". The extent of Matildas education in military matters is debated. It has been asserted that she was taught strategy, tactics, riding and wielding weapons, but recent scholarship challenges these claims.     Following the death of their father in 1052, Matildas brother, ": null
    },
    {
        "Frederick": "Frederick, Margrave Of Tuscany"
    },
    {
        ", inherited the family lands and titles under the ": null
    },
    {
        "regency": "Regency"
    },
    {
        " of their mother. Matildas sister, Beatrice, died the next year, making Matilda ": null
    },
    {
        "heir presumptive": "Heir Presumptive"
    },
    {
        " to Fredericks personal holdings. In 1054, determined to safeguard the interests of her children as well as her own, her mother married ": null
    },
    {
        "Godfrey the Bearded": "Godfrey, Duke Of Upper Lorraine"
    },
    {
        ", a distant kinsman who had been stripped of the ": null
    },
    {
        "Duchy of Upper Lorraine": "Duchy Of Upper Lorraine"
    },
    {
        " after openly rebelling against Emperor Henry III.     Henry was enraged by Beatrice of Lorraines unauthorised union with his most vigorous adversary and took the opportunity to have her arrested, along with Matilda, when he marched south to attend a ": null
    },
    {
        "synod": "Synod"
    },
    {
        " in Florence on ": null
    },
    {
        "Pentecost": "Pentecost"
    },
    {
        " in 1055. Fredericks rather suspicious death soon thereafter made Matilda the last member of the ": null
    },
    {
        "House of Canossa": "House Of Canossa"
    },
    {
        ". Mother and daughter were taken to Germany, but Godfrey successfully avoided capture. Unable to defeat him, Henry sought a rapproachment. The Emperors death in October 1056, which brought to throne the underage ": null
    },
    {
        "Henry IV": "Henry Iv, Holy Roman Emperor"
    },
    {
        ", seems to have accelerated the negotiations. Godfrey was reconciled with the crown and recognized as Margrave of Tuscany in December, while Beatrice and Matilda were released. By the time she and her mother returned to Italy, in the company of ": null
    },
    {
        "Pope Victor II": "Pope Victor Ii"
    },
    {
        ", Matilda was formally acknowledged as heir to the greatest territorial lordship in the southern part of the Empire.     Matildas mother and stepfather became heavily involved in the series of disputed papal elections during their regency, supporting the ": null
    },
    {
        "Gregorian Reforms": "Gregorian Reforms"
    },
    {
        ". Godfreys brother Frederick became ": null
    },
    {
        "Pope Stephen IX": "Pope Stephen Ix"
    },
    {
        ", while both of the following two popes, ": null
    },
    {
        "Nicholas II": "Pope Nicholas Ii"
    },
    {
        " and ": null
    },
    {
        "Alexander II": "Pope Alexander Ii"
    },
    {
        ", had been Tuscan bishops. Matilda made her first journey to ": null
    },
    {
        "Rome": "Rome"
    },
    {
        " with her family in the entourage of Nicholas in 1059. Godfrey and Beatrice actively assisted them in dealing with ": null
    },
    {
        "antipopes": "Antipope"
    },
    {
        ", while the adolescent Matildas role remains unclear. A contemporary account of her stepfathers 1067 expedition against ": null
    },
    {
        "Prince Richard I of Capua": "Richard I Of Capua"
    },
    {
        " on behalf of the papacy mentions Matildas participation in the campaign, describing it as the first service that the most excellent daughter of Boniface offered to the blessed prince of the apostles.           In 1069, as Godfrey the Bearded lay dying in ": null
    },
    {
        "Verdun": "Verdun"
    },
    {
        ", Beatrice and Matilda hastened to reach Lorraine, anxious to ensure a smooth transition of power. Matilda was present at her stepfathers deathbed, and on that occasion she is for the first time clearly mentioned as the wife of her stepbrother, ": null
    },
    {
        "Godfrey the Hunchback": "Godfrey The Hunchback"
    },
    {
        ", to whom she had been betrothed since childhood. The marriage proved a failure; the death of their only child shortly after birth in August 1071 and Godfreys physical deformity may have helped fuel deep animosity between the spouses.     By the end of 1071, Matilda had left her husband and returned to Tuscany. Matildas bold decision to repudiate her husband came at a cost, but ensured her independence. Beatrice started preparing Matilda for rule by holding court jointly with her and, eventually, encouraging her to issue charters on her own as countess  and duchess .     Godfrey fiercely protested the separation and demanded that Matilda come back to him, which she repeatedly refused. The Duke descended into Italy in 1072, determined to enforce the marriage. He sought the help of both Matildas mother and her ally, the newly elected ": null
    },
    {
        "Pope Gregory VII": "Pope Gregory Vii"
    },
    {
        ", promising military aid to the latter. Matildas resolution was unshakable, and Godfrey returned to Lorraine alone, losing all hope by 1074. Rather than supporting the Pope as promised, Godfrey turned his attention to imperial affairs. Meanwhile, the conflict later known as the ": null
    },
    {
        "Investiture Controversy": "Investiture Controversy"
    },
    {
        " was brewing between Gregory and Henry, with both men claiming the right to appoint bishops and abbots within the Empire. Matilda and Godfrey soon found themselves on opposing sides of the dispute, leading to a further detoriation of their difficult relationship. German chroniclers, writing of the ": null
    },
    {
        "synod held at Worms": "Synod Of Worms"
    },
    {
        " in January 1076, even suggested that Godfrey inspired Henrys allegation of a licentious affair between Gregory and Matilda.         Matilda became a widow on 26 February 1076. Godfrey the Hunchback was assassinated in Flanders while ": null
    },
    {
        "answering the call of nature": "Excretion"
    },
    {
        " . Having been accused of adultery with the Pope the previous month, Matilda was suspected of ordering her estranged husbands death. She could not have known about the proceedings at the Synod of Worms at the time, however, since the news took three months to reach the Pope himself, and it is more likely that Godfrey was killed at the instigation of an enemy nearer to him. Within two months, Beatrice was dead as well. Matildas power was considerably augmented by these deaths; she was now the undisputed heir of all her parents ": null
    },
    {
        "allodial lands": "Allodial Land"
    },
    {
        ". Her inheritance would have been threatened had Godfrey survived her mother, but she now enjoyed the privileged status of a widow. It seemed unlikely, however, that Henry would formally invest her with the margraviate.     Between 1076 and 1080, Matilda travelled to Lorraine to lay claim to her husbands estate in ": null
    },
    {
        "Verdun": "Verdun"
    },
    {
        ", which he had willed to his sister ": null
    },
    {
        "Idas": "Ida Of Lorraine"
    },
    {
        " son, ": null
    },
    {
        "Godfrey of Bouillon": "Godfrey Of Bouillon"
    },
    {
        ". Godfrey of Bouillon also disputed her right to ": null
    },
    {
        "Stenay": "Stenay"
    },
    {
        " and ": null
    },
    {
        "Mosay": "Mosay"
    },
    {
        ", which her mother had received as ": null
    },
    {
        "dowry": "Dowry"
    },
    {
        ". The quarrel between aunt and nephew over the episcopal county of Verdun was eventually settled by ": null
    },
    {
        "Theoderic": "Theoderic Of Verdun"
    },
    {
        ", ": null
    },
    {
        "Bishop of Verdun": "Bishop Of Verdun"
    },
    {
        ", who enjoyed the right to nominate the counts. He easily found in favor of Margravine Matilda, as such verdict happened to please both Pope Gregory and King Henry. Matilda then proceeded to ": null
    },
    {
        "enfeoff": "Feoffment"
    },
    {
        " Verdun to her husbands pro-reform cousin, ": null
    },
    {
        "Albert III of Namur": "Albert Iii, Count Of Namur"
    },
    {
        ". The deep animosity between Matilda and her nephew is thought to have prevented her from travelling to ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        " during the ": null
    },
    {
        "First Crusade": "First Crusade"
    },
    {
        ", led by him in the late 1090s.               The disagreement between Pope Gregory VII and King Henry IV culminated in the aftermath of the Synod of Worms in February 1076. Gregory declared Henry ": null
    },
    {
        "excommunicated": "Excommunicated"
    },
    {
        ", releasing all his subjects from allegiance to him and providing the perfect reason for rebellion against his rule. Insubordinate southern German princes gathered in ": null
    },
    {
        "Trebur": "Trebur"
    },
    {
        ", awaiting the Pope. Matildas first military endeavor, as well as the first major task altogether as ruler, turned out to be protecting the Pope during his perilous journey north. Gregory could rely on nobody else; as the sole heir to the Attonid patrimony, Matilda controlled all the Apennine ": null
    },
    {
        "passes": "Mountain Pass"
    },
    {
        " and nearly all the rest that connected ": null
    },
    {
        "central Italy": "Central Italy"
    },
    {
        " to the ": null
    },
    {
        "north": "Northern Italy"
    },
    {
        ". The Lombard bishops, who were also excommunicated for taking part in the synod and whose sees bordered Matildas domain, were keen to capture Gregory. Gregory was aware of the danger, and recorded that all his advisors except Matilda counselled him against travelling to Trebur.     Henry had other plans, however. He decided to descend into Italy and intercept Gregory, who was thus delayed. The German dukes held a council by themselves and informed the King that he had to submit to the Pope or be replaced. Henrys predecessors dealt easily with troublesome pontiffs - they simply deposed them, and the excommunicated Lombard bishops rejoiced at this prospect. When Matilda heard about Henrys approach, she urged Gregory to take refuge in the ": null
    },
    {
        "Castle of Canossa": "Castle Of Canossa"
    },
    {
        ", her familys eponymous stronghold. Gregory took her advice. It soon became clear that the intention behind Henrys ": null
    },
    {
        "walk to Canossa": "Walk To Canossa"
    },
    {
        " was to show ": null
    },
    {
        "penance": "Penance"
    },
    {
        ". By 25 January 1077, the King stood barefoot in the snow before the gates of Matildas castle, accompanied by his mother-in-law, Margravine ": null
    },
    {
        "Adelaide of Susa": "Adelaide Of Susa"
    },
    {
        ". He remained there, humbled, until 28 January, when Matilda convinced the Pope to see him. Matilda and Adelaide brokered a deal between the men.  Henry was taken back into the Church, with the margravines acting as sponsors and formally swearing to the agreement.     In 1079, Matilda gave the Pope all her domains, in open defiance of Henry IVs claims both as the overlord of some of those domains, and as her close relative. Two years later the fortunes of Papacy and Empire turned again: in 1080 Henry IV summoned a council in ": null
    },
    {
        "Brixen": "Brixen"
    },
    {
        ", which deposed Gregory VII. The following year the Emperor decided to travel again to Italy to reinstate his overlordship over his territories. He also declared Matilda, on account of her 1079 donation to the Church, forfeit and be banned from the Empire; although this wasnt enough to eliminate her as a source of trouble, for she retained substantial ": null
    },
    {
        "allodial": "Allodial"
    },
    {
        " holdings. On 15 October 1080 near ": null
    },
    {
        "Volta Mantovana": "Volta Mantovana"
    },
    {
        " the Imperial troops  defeated the troops loyal to Gregory VII and controlled by Matilda. This was the first serious military defeat of Matilda . Paolo Golinelli: Sant’Anselmo, Mantova e la lotta per le investiture, 1987.     Matilda, however, didnt surrender. While Gregory VII was forced into exile, she, retaining control over all the western passes in the Apennines, could force Henry IV to approach Rome via ": null
    },
    {
        "Ravenna": "Ravenna"
    },
    {
        "; even with this route open, the Emperor would find it hard to besiege Rome with a hostile territory at his back. In December 1080 the citizens of Lucca, then the capital of Tuscany, had revolted and driven out her ally Bishop ": null
    },
    {
        "Anselm": "Anselm Of Lucca"
    },
    {
        ". She is believed to have commissioned the renowned ": null
    },
    {
        "Ponte della Maddalena": "Ponte Della Maddalena"
    },
    {
        " where the ": null
    },
    {
        "Via Francigena": "Via Francigena"
    },
    {
        " crosses the river ": null
    },
    {
        "Serchio": "Serchio"
    },
    {
        " at ": null
    },
    {
        "Borgo a Mozzano": "Borgo A Mozzano"
    },
    {
        " just north of ": null
    },
    {
        "Lucca": "Lucca"
    },
    {
        ".     Matilda remained Pope Gregory VIIs chief intermediary for communication with northern Europe even as he lost control of Rome and was holed up in the ": null
    },
    {
        "Castel SantAngelo": "Castel Santangelo"
    },
    {
        ". After Henry caught hold of the Popes seal, Matilda wrote to supporters in Germany only to trust papal messages that came through her.     Henry IVs control of Rome enabled him to enthrone Antipope Clement III, who, in turn, crowned him Emperor. After this, Henry IV returned to Germany, leaving it to his allies to attempt Matildas dispossession. These attempts floundered after Matilda  defeated them at ": null
    },
    {
        "Sorbara": "Bomporto"
    },
    {
        " near ": null
    },
    {
        "Modena": "Modena"
    },
    {
        " on 2 July 1084.     Gregory VII died in 1085, and Matildas forces, with those of Prince ": null
    },
    {
        "Jordan I of Capua": "Jordan I Of Capua"
    },
    {
        " , took to the field in support of a new pope, ": null
    },
    {
        "Victor III": "Pope Victor Iii"
    },
    {
        ". In 1087, Matilda led an expedition to Rome in an attempt to install Victor, but the strength of the imperial counterattack soon convinced the pope to withdraw from the city.         In 1088 Matilda was facing a new attempt at invasion by Henry IV, and decided to pre-empt it by means of a political marriage. In 1089 Matilda married ": null
    },
    {
        "Welf V": "Welf Ii, Duke Of Bavaria"
    },
    {
        ", who was probably fifteen to seventeen years old. Welf was heir to the Duchy of Bavaria. He was also a member of the ": null
    },
    {
        "Welf": "House Of Welf"
    },
    {
        " dynasty: the Welfs/Guelphs were important papal supporters from the eleventh to the fifteenth centuries in their conflict with the German emperors . Matilda and Welfs wedding was part of a network of alliances approved by the new pope, ": null
    },
    {
        "Urban II": "Pope Urban Ii"
    },
    {
        ", in order to effectively counter Henry IV.     ": null
    },
    {
        "Cosmas of Prague": "Cosmas Of Prague"
    },
    {
        " , included a letter in his Chronica Boemorum, which he claimed that Matilda sent to her future husband, but which is now thought to be spurious: W. Goez and E. Goez, Die Urkunden und Briefen der Markgraefin Mathilde von Tuszien , no. 140 , p. 361, accessible online at:  ; and J. Chodor, ‘Queens in Early Medieval Chronicles of East Central Europe’, East Central Europe 1: 21–23 , 9–50, at p. 32.     ::Not for feminine lightness or recklessness, but for the good of all my kingdom, I send you this letter: agreeing to it, you take with it myself and the rule over the whole of Lombardy. Ill give you so many cities, so many castles and noble palaces, so much gold and silver, that you will have a famous name, if you endear yourself to me; do not reproof me for boldness because I first address you with the proposal. Its reason for both male and female to desire a legitimate union, and it makes no difference whether the man or the woman broaches the first line of love, sofar as an indissoluble marriage is sought. Goodbye. Cosmas of Prague, Chronica Boemorum, II, ch. 32, MGH SS 9 p.88, accessible online in Latin and with an English translation at: .     After this, Matilda sent an army of thousands to the border of Lombardy to escort her bridegroom, welcomed him with honors, and after the marriage , she organized 120 days of wedding festivities, with such splendor that any other medieval rulers pale in comparison.     Cosmas also reports that for two nights after the wedding, Welf V, fearing witchcraft, refused to share the marital bed. The third day, Matilda appeared naked on a table especially prepared on sawhorses, and told him that everything is in front of you and there is no hidden malice. But the Duke was dumbfounded; Matilda, furious, slapped him and spat in his face, taunting him: Get out of here, monster, you dont deserve our kingdom, you vile thing, viler than a worm or a rotten seaweed, dont let me see you again, or youll die a miserable death.... Cosmas of Prague, Chronica Boemorum, II, ch.32, in   B. Bretholz and W. Weinberger, ed., Die Chronik der Böhmen des Cosmas von Prag, MGH SS rer Germ NS 2 , pp. 128f., accessible online at:  . Matilda and her young husband separated a few years later ; they had no children.     Later Matilda allied with the two sons of Henry IV, ": null
    },
    {
        "Conrad": "Conrad Ii Of Italy"
    },
    {
        " and ": null
    },
    {
        "Henry": "Henry V, Holy Roman Emperor"
    },
    {
        ", who rebelled against their father. This forced Henry to return to Italy, where he chased Matilda into the mountains. He was humbled before Canossa, this time in a military defeat in October 1092, from which his influence in Italy never recovered.            After several victories, including one against the ": null
    },
    {
        "Saxons": "Saxons"
    },
    {
        ", Henry IV prepared in 1090 his third descent to Italy, in order to inflict the final defeat on the Church. His route was the usual one, ": null
    },
    {
        "Brenner": "Brenner, South Tyrol"
    },
    {
        " and ": null
    },
    {
        "Verona": "Verona"
    },
    {
        ", along the border of Matildas possessions, which began outside the cities gates. The opposing armies would meet near Mantua. Matilda secured the loyalty of the townspeople by exempting them from some taxes, such as teloneo and ripatico, and with the promise of Lombard franchise, entailing the rights to hunt, fish and cut wood on both banks of the ": null
    },
    {
        "Tartaro": "Tartaro-Canalbianco-Po Di Levante"
    },
    {
        " river.     The Mantua people stood by Matilda until the so-called Holy Thursday betrayal , when the townspeople, won over by additional concessions from Henry, who had meanwhile besieged the city, sided with him. In 1092 Matilda escaped to the Reggiano ": null
    },
    {
        "Apennines": "Apennines"
    },
    {
        " and her most inexpugnable ": null
    },
    {
        "strongholds": "Stronghold"
    },
    {
        ". Since the times of ": null
    },
    {
        "Adalbert Atto": "Adalbert Atto"
    },
    {
        " the power of the Canossa family had been based on a network of castles, fortresses and fortified villages in the Val dEnza, forming a complex polygonal defense that had always resisted all attack from the Apennines. After several bloody battles with mutual defeats, the powerful imperial army was surrounded.     In spite of its fearful power, the Imperial army was defeated by Matildas liegemen. Among them were small landowners and holders of fortified villages, which remained completely loyal to the Canossas even against the Holy Roman Emperor. Their familiarity with the territory, their quick communications and maneuvering to all the high places of the Val dEnza gave them victory over Henrys might. It seems that Matilda personally participated, with a handful of chosen faithful men, to the battle, galvanizing the allies with the cry of Just War. The Imperial army was taken as in a vice in the meandering mountain creek. The overall import of Henrys rout was more than a military defeat. The Emperor realized it was impossible to penetrate those places, wholly different from the plains of the Po Valley or of Saxe. There he faced not boundaries drawn by the rivers of Central Europe, but steep trails, ravines, inaccessible places protecting Matildas fortresses, and high ": null
    },
    {
        "tower houses": "Tower House"
    },
    {
        ", whence the defenders could unload on anyone approaching missiles of all kinds: spears, arrows, perhaps even boiling oil, At the time, the oil was obtained only by cold pressing of the olives; was therefore very rare and expensive. javelins, stones.     After Matildas victory several cities, such as ": null
    },
    {
        "Milan": "Milan"
    },
    {
        ", ": null
    },
    {
        "Cremona": "Cremona"
    },
    {
        ", ": null
    },
    {
        "Lodi": "Lodi, Lombardy"
    },
    {
        " and ": null
    },
    {
        "Piacenza": "Piacenza"
    },
    {
        ", sided with her to free themselves of Imperial rule. In 1093 the Emperors eldest son, Conrad, supported by the Pope, Matilda and a group of Lombard cities, was crowned King of Italy. Matilda freed and even gave refuge to Henry IVs wife, ": null
    },
    {
        "Eupraxia of Kiev": "Eupraxia Of Kiev"
    },
    {
        ", who, at the urging of ": null
    },
    {
        "Pope Urban II": "Pope Urban Ii"
    },
    {
        ", made a public confession before the church ": null
    },
    {
        "Council of Piacenza": "Council Of Piacenza"
    },
    {
        ". She accused her husband of imprisoning her in Verona after forcing her to participate in orgies, and, according to some later accounts, of attempting a ": null
    },
    {
        "black mass": "Black Mass"
    },
    {
        " on her naked body. . Thanks to these scandals and division within the Imperial family, the prestige and power of Henry IV was increasingly weakened.     In 1095, Henry attempted to reverse his fortunes by seizing Matildas castle of Nogara, but the countesss arrival at the head of an army forced him to retreat. In 1097, Henry withdrew from Italy altogether, after which Matilda reigned virtually unchallenged, although she did continue to launch military operations to restore her authority and regain control of the towns that had remained loyal to the emperor. With the assistance of the French armies heading off to the ": null
    },
    {
        "First Crusade": "First Crusade"
    },
    {
        ", she was finally able to restore Urban to ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ". She ordered or led successful expeditions against ": null
    },
    {
        "Ferrara": "Ferrara"
    },
    {
        " , ": null
    },
    {
        "Parma": "Parma"
    },
    {
        " , ": null
    },
    {
        "Prato": "Prato"
    },
    {
        " and ": null
    },
    {
        "Mantua": "Mantua"
    },
    {
        " .         Henry IV died now defeated in 1106; and after the deposition and death of Conrad , his second son and new Holy Roman Emperor, Henry V, began to turn the fight against the Church and Italy. This time the attitude of Matilda against the imperial house had to change and she accepted the will of the Emperor. In 1111, on his way back to Germany, Henry V met her at the Castle of Bianello, near ": null
    },
    {
        "Reggio Emilia": "Reggio Emilia"
    },
    {
        ". Matilda confirmed him the inheritance rights over the fiefs that Henry IV disputed her, thus ending a fight that had lasted over twenty years. Henry V gave Matilda a new title: between 6 and 11 May 1111, the Emperor crowned Matilda as Imperial Vicar and Vice-Queen of Italy. This episode was the decisive step towards the ": null
    },
    {
        "Concordat of Worms": "Concordat Of Worms"
    },
    {
        ".       By legend Matilda of Canossa is said to have founded one hundred churches. Documents and local legend identify well over one hundred churches, monasteries, hospices, and bridges built or restored between the Alps and Rome by Matilda and her mother, Beatrice. Today, churches and monasteries in the regions of Lombardy, Reggio Emilia, Tuscany, and even the Veneto attribute their foundation to her. Built originally with hospices for travelers attached, these churches created a network that united the supporters of the Gregorian reform of the Roman Church which Matilda supported. Spike, 2015, Bologna This network also provided protection for pilgrims, merchants and travelers assisting the Renaissance in culture that occurred in the centuries after Matildas death.     Most of these churches continue today to be vital centers of their communities. They include rural churches located along the Po and Arno rivers, and their tributaries; churches built along the Apennine mountain passes which Matildas family controlled and those along the ancient highways of the via Emilia, the via Cassia, the via Aurelia and the via Francigena. Among these are monuments listed by UNESCO as among the heritage of our world, including churches in Florence, Ferrara, Lucca, Mantua, Modena, Pisa, Verona and Volterra. Her cultural legacy is enormous throughout Northern Italy. Spike, 2015, Florence     Some churches traditionally said to have been founded by Matilda include:     SantAndrea Apostolo of Vitriola, at ": null
    },
    {
        "Montefiorino": "Montefiorino"
    },
    {
        " .    SantAnselmo, Pieve di Coriano .   San Giovanni Decollato, at ": null
    },
    {
        "Pescarolo ed Uniti": "Pescarolo Ed Uniti"
    },
    {
        " .    Santa Maria Assunta, at ": null
    },
    {
        "Monteveglio": "Monteveglio"
    },
    {
        " .   San Martino in Barisano, near ": null
    },
    {
        "Forlì": "Forlì"
    },
    {
        ".   San Zeno, at ": null
    },
    {
        "Cerea": "Cerea"
    },
    {
        " .     It seems that even the foundation of the Church of San Salvaro in ": null
    },
    {
        "Legnago": "Legnago"
    },
    {
        "  was made by Matilda.          Matildas death from ": null
    },
    {
        "gout": "Gout"
    },
    {
        " in 1115 at ": null
    },
    {
        "Bondeno di Roncore": "Bondeno Di Roncore"
    },
    {
        " marked the end of an era in Italian politics. It is widely reported that she bequeathed her ": null
    },
    {
        "allodial property": "Allodial Title"
    },
    {
        " to the Pope. Unaccountably, however, this donation was never officially recognized in Rome and no record exists of it. Henry V had promised some of the cities in her territory that he would appoint no successor after he deposed her. In her place the leading citizens of these cities took control, and the era of the ": null
    },
    {
        "city-states in northern Italy": "Italian City-States"
    },
    {
        " began.     Matilda was at first buried in the ": null
    },
    {
        "Abbey of San Benedetto in Polirone": "Polirone Abbey"
    },
    {
        ", located in the town of ": null
    },
    {
        "San Benedetto Po": "San Benedetto Po"
    },
    {
        "; then, in 1633, at the behest of ": null
    },
    {
        "Pope Urban VIII": "Pope Urban Viii"
    },
    {
        ", her body was moved to ": null
    },
    {
        "Rome": "Rome"
    },
    {
        " and placed in ": null
    },
    {
        "Castel SantAngelo": "Castel Santangelo"
    },
    {
        ". Finally, in 1645 her remains were definitely deposited in the ": null
    },
    {
        "Vatican": "Vatican Hill"
    },
    {
        ", where they now lie in ": null
    },
    {
        "St. Peters Basilica": "St. Peters Basilica"
    },
    {
        ". She is one of only six women who have the honor of being buried in the Basilica, the others being Queen ": null
    },
    {
        "Christina of Sweden": "Christina, Queen Of Sweden"
    },
    {
        ", ": null
    },
    {
        "Maria Clementina Sobieska": "Maria Clementina Sobieska"
    },
    {
        " , ": null
    },
    {
        "St. Petronilla": "St. Petronilla"
    },
    {
        ", ": null
    },
    {
        "Queen Charlotte of Cyprus": "Queen Charlotte Of Cyprus"
    },
    {
        " and Agnesina Colonna Caetani.     A ": null
    },
    {
        "memorial tomb for Matilda": "Tomb Of Countess Matilda Of Tuscany"
    },
    {
        ", commissioned by ": null
    },
    {
        "Pope Urban VIII": "Pope Urban Viii"
    },
    {
        " and designed by ": null
    },
    {
        "Gianlorenzo Bernini": "Gianlorenzo Bernini"
    },
    {
        ", marks her burial place in St Peters and is often called the Honor and Glory of Italy.     After her death, an aura of legend came to surround Matilda. Church historians gave her the character of a semi-nun, solely dedicated to contemplation and faith. Some argue, instead, that she was a woman of strong passions of both spiritual and carnal nature .         She has been posited by some critics as the origin of the mysterious Matilda who appears to Dante gathering flowers in the ": null
    },
    {
        "earthly paradise": "Purgatoriothe Earthly Paradise"
    },
    {
        " in Dantes  Purgatorio .     The story of Matilda and Henry IV is the main plot device in ": null
    },
    {
        "Luigi Pirandellos": "Luigi Pirandello"
    },
    {
        " play  Enrico IV . She is the main historical character in ": null
    },
    {
        "Kathleen McGowans": "Kathleen Mcgowan"
    },
    {
        " novel The Book of Love .       ": null
    }
]