[
    {
        "            The McIntosh , McIntosh Red, or colloquially the Mac, is an ": null
    },
    {
        "apple": "Apple"
    },
    {
        " cultivar": "Cultivar"
    },
    {
        ", the national apple of Canada. The fruit has red and green skin, a tart flavour, and tender white flesh, which ripens in late September. In the 20th century it was the most popular cultivar in ": null
    },
    {
        "Eastern Canada": "Eastern Canada"
    },
    {
        " and ": null
    },
    {
        "New England": "New England"
    },
    {
        ", and is considered an all-purpose apple, suitable both for cooking and eating raw. ": null
    },
    {
        "Apple Inc.": "Apple Inc."
    },
    {
        " employee ": null
    },
    {
        "Jef Raskin": "Jef Raskin"
    },
    {
        " named the ": null
    },
    {
        "Macintosh": "Macintosh"
    },
    {
        " line of personal computers after the fruit.     ": null
    },
    {
        "John McIntosh": "John Mcintosh"
    },
    {
        " discovered the original McIntosh sapling on his ": null
    },
    {
        "Dundela": "South Dundas, Ontario"
    },
    {
        " farm in ": null
    },
    {
        "Upper Canada": "Upper Canada"
    },
    {
        " in 1811. He and his wife bred it, and the family started grafting the tree and selling the fruit in 1835. In 1870, it entered commercial production, and became common in northeastern North America after 1900. While still important in production, the fruits popularity fell in the early 21st century in the face of competition from varieties such as the ": null
    },
    {
        "Gala": "Gala"
    },
    {
        ". According to the ": null
    },
    {
        "US Apple Association": "Us Apple Association"
    },
    {
        " website it is one of the fifteen most popular apple cultivars in the United States.  by ": null
    },
    {
        "US Apple Association": "Us Apple Association"
    },
    {
        "         The McIntosh or McIntosh Red , is the most popular apple ": null
    },
    {
        "cultivar": "Cultivar"
    },
    {
        " in eastern Canada and the northeastern United States. It also sells well in eastern Europe.     A spreading tree that is moderately vigorous, the McIntosh bears annually or in alternate years. The tree is hardy to at least ": null
    },
    {
        "USDA": "United States Department Of Agriculture"
    },
    {
        " Hardiness zone": "Hardiness Zone"
    },
    {
        " 4a, or . 50% or more of its flowers die at  or below.          The McIntosh apple is a small- to medium-sized round fruit with a short stem. It has a red and green skin that is thick, tender, and easy to peel. Its white flesh is sometime tinged with green or pink and is juicy, tender, and firm, soon becoming soft. The flesh is easily bruised.     The fruit is considered all-purpose , suitable both for eating raw and for cooking. It is used primarily for dessert, and requires less time to cook than most cultivars. It is usually blended when used for juice.     The fruit grows best in cool areas where nights are cold and autumn days are clear; otherwise, it suffers from poor colour and soft flesh, and tends to fall from the tree before harvest. It stores for two to three months in air, but is prone to ": null
    },
    {
        "scald": "Apple Scald"
    },
    {
        ", flesh softening, chilling sensitivity, and ": null
    },
    {
        "coprinus rot": "Coprinopsis Psychromorbida"
    },
    {
        ". It can become ": null
    },
    {
        "mealy": "Wikt:Mealy"
    },
    {
        " when stored at temperatures below . The fruit is optimally stored in a ": null
    },
    {
        "controlled atmosphere": "Controlled Atmosphere"
    },
    {
        " in which temperatures are between , and air content is 1.5–4.5% oxygen and 1–5% carbon dioxide; under such conditions, the McIntosh will keep for five to eight months.         The McIntosh is most commonly cultivated in Canada, the United States, and eastern Europe. The parentage of the McIntosh is unknown, but the Snow Apple , Fall St Lawrence, and Alexander have been speculated. It is one of the top five apple cultivars used in cloning, and research indicates the McIntosh combines well for winter hardiness.     If unsprayed, the McIntosh succumbs easily to ": null
    },
    {
        "apple scab": "Apple Scab"
    },
    {
        ", which may lead to entire crops being unmarketable. It has generally low susceptibility to ": null
    },
    {
        "fire blight": "Fire Blight"
    },
    {
        ", ": null
    },
    {
        "powdery mildew": "Powdery Mildew"
    },
    {
        ", ": null
    },
    {
        "cedar-apple rust": "Gymnosporangium Juniperi-Virginianae"
    },
    {
        ", ": null
    },
    {
        "quince rust": "Gymnosporangium Clavipes"
    },
    {
        ", and ": null
    },
    {
        "hawthorn rust": "Gymnosporangium Globosum"
    },
    {
        ". It is susceptible to fungal diseases such as  Nectria  canker, ": null
    },
    {
        "brown rot": "Wood-Decay Fungus"
    },
    {
        ", ": null
    },
    {
        "black rot": "Black Rot"
    },
    {
        ", race 1 of ": null
    },
    {
        "apple rust": "Gymnosporangium Juniperi-Virginianae"
    },
    {
        " . It is moderately resistant to ": null
    },
    {
        "Pezicula bark rot": "Neofabraea Malicorticis"
    },
    {
        " and ": null
    },
    {
        "Alternaria leaf blotch": "Alternaria Mali"
    },
    {
        ", and resists brown leaf spot well.     The McIntosh is one of the most common cultivars used in cloning; a 1996 study found that the McIntosh was a parent in 101 of 439 cultivars selected, more than any other founding clone. It was used in over half of the Canadian cultivars selected, and was used extensively in the United States and Eastern Europe as well; rarely was it used elsewhere. Offspring of the McIntosh include: the ": null
    },
    {
        "Jersey Black": "Jersey Black"
    },
    {
        " hybrid the ": null
    },
    {
        "Macoun": "Macoun Apple"
    },
    {
        ", the ": null
    },
    {
        "Newtown Pippin": "Newtown Pippin"
    },
    {
        " hybrid the ": null
    },
    {
        "Spartan": "Spartan"
    },
    {
        ", the ": null
    },
    {
        "Cortland": "Cortland"
    },
    {
        "; the ": null
    },
    {
        "Empire": "Empire"
    },
    {
        "; the Jonamac, the Jersey Mac, the Lobo, the ": null
    },
    {
        "Melba": "Melba"
    },
    {
        ", the Summered, the Tydemans Red, and possibly the ": null
    },
    {
        "Paula Red": "Paula Red"
    },
    {
        ".         Apple trees were introduced to Canada at the ": null
    },
    {
        "Habitation at Port-Royal": "Habitation At Port-Royal"
    },
    {
        "  as early as 1606 by French settlers. Following its introduction, apple cultivation spread inland.     The McIntoshs discoverer, ": null
    },
    {
        "John McIntosh": "John Mcintosh"
    },
    {
        " , left his native ": null
    },
    {
        "Mohawk Valley": "Mohawk Valley"
    },
    {
        " home in New York State in 1796 to follow his love, Dolly Irwin, who had been taken to ": null
    },
    {
        "Upper Canada": "Upper Canada"
    },
    {
        " by her ": null
    },
    {
        "Loyalist": "United Empire Loyalist"
    },
    {
        " parents. She had died by the time he found her, but he settled as a farmer in Upper Canada. He married Hannah Doran in 1801, and they farmed along the ": null
    },
    {
        "Saint Lawrence River": "Saint Lawrence River"
    },
    {
        " until 1811, when McIntosh exchanged the land he had with his brother-in-law Edward Doran for a plot in ": null
    },
    {
        "Dundela": "South Dundas, Ontario"
    },
    {
        ".     While clearing the overgrown plot McIntosh discovered some wild apple seedlings on his farm. He transplanted the seedlings next to his house. One of the seedlings bore particularly good fruit. The McIntosh grandchildren dubbed the fruit it produced Grannys apple , as they often saw their grandmother taking care of the tree in the orchard. McIntosh was selling seedlings from the tree by 1820, but they did not produce fruit of the quality of the original.     John McIntoshs son Allan  learned ": null
    },
    {
        "grafting": "Grafting"
    },
    {
        " about 1835; with this cloning the McIntoshes could maintain the distinctive properties of the fruit of the original tree. Allan and brother Sandy , nicknamed Sandy the Grafter , increased production and promotion of the cultivar. Earliest sales were in 1835, and in 1836 the cultivar was renamed the McIntosh Red ; it entered commercial production in 1870. The apple became popular after 1900, when the first sprays for ": null
    },
    {
        "apple scab": "Apple Scab"
    },
    {
        " were developed. A house fire damaged the original McIntosh tree in 1894; it last produced fruit in 1908, and died and fell over in 1910.     Horticulturist William Tyrrell Macoun of the ": null
    },
    {
        "Central Experimental Farm": "Central Experimental Farm"
    },
    {
        " in ": null
    },
    {
        "Ottawa": "Ottawa"
    },
    {
        " is credited with popularizing the McIntosh in Canada. He stated the McIntosh needed no words of praise , that it was one of the finest appearing and best dessert apples grown . The Macoun, a hybrid of the McIntosh and Jersey Black grown by the Agricultural Experiment Station in Geneva, NY, was named for him in 1923. In the northeastern United States the McIntosh replaced a large number of ": null
    },
    {
        "Baldwins": "Baldwin"
    },
    {
        " that were killed in a severe winter in 1933–34. In the late 1940s, Canadian ambassador to the United Nations ": null
    },
    {
        "Andrew McNaughton": "Andrew Mcnaughton"
    },
    {
        " told Soviet Minister for Foreign Affairs ": null
    },
    {
        "Andrei Gromyko": "Andrei Gromyko"
    },
    {
        " that the McIntosh Red was Canadas best apple.     The McIntosh made up 40% of the Canadian apple market by the 1960s; and at least thirty varieties of McIntosh hybrid were known by 1970. Its popularity later waned in the face of competition from foreign imports; in the first decade of the 21st century, the ": null
    },
    {
        "Gala": "Gala"
    },
    {
        " accounted for 33% of the apple market in Ontario to the McIntoshs 12%, and the ": null
    },
    {
        "Northern Spy": "Northern Spy"
    },
    {
        " had become the preferred apple for pies.  Production remained important to Ontario, however, as  of McIntoshes were produced in 2010.     The original tree discovered by John McIntosh bore fruit for more than ninety years, and died in 1910. Horticulturalists from the ": null
    },
    {
        "Upper Canada Village": "Upper Canada Village"
    },
    {
        " heritage park saved cuttings from the last known first-generation McIntosh graft before it died in 2011 for producing clones.              The McIntosh has been designated the national apple of Canada. A popular subscription funded a plaque placed  from the original McIntosh tree in 1912. The ": null
    },
    {
        "Ontario Archaeological and Historic Sites Board": "Ontario Archaeological And Historic Sites Board"
    },
    {
        " replaced the plaque with a more descriptive one in 1962, and the ": null
    },
    {
        "Historic Sites and Monuments Board of Canada": "Historic Sites And Monuments Board Of Canada"
    },
    {
        " put up another in a park nearby in 2001, by a painted mural commemorating the fruit.     ": null
    },
    {
        "Apple Inc.": "Apple Inc."
    },
    {
        " employee ": null
    },
    {
        "Jef Raskin": "Jef Raskin"
    },
    {
        " named the ": null
    },
    {
        "Macintosh": "Macintosh"
    },
    {
        " line of personal computers after the McIntosh. He deliberately misspelled the name to avoid conflict with the hi-fi equipment manufacturer ": null
    },
    {
        "McIntosh Laboratory": "Mcintosh Laboratory"
    },
    {
        ". Apples attempt in 1982 to trademark the name Macintosh was nevertheless denied due to the phonetic similarity between Apples product and the name of the hi-fi manufacturer. Apple licensed the rights to the name in 1983, and bought the trademark in 1986.     In 1995 the ": null
    },
    {
        "Royal Canadian Mint": "Royal Canadian Mint"
    },
    {
        " commissioned Toronto artist ": null
    },
    {
        "Roger Hill": "Roger Hill"
    },
    {
        " to design a commemorative ": null
    },
    {
        "silver dollar": "Canadian Silver Dollar"
    },
    {
        " for release in 1996. Mint engraver Sheldon Beveridge engraved the image of a group of three McIntoshes and a McIntosh blossom which adorn one side with a ribbon naming the variety. An inscription on the edge reads 1796 Canada Dollar 1996 . Issued sheathed in a silver cardboard sleeve in a black leatherette case, 133,779 pieces of the proof were sold, as well as 58,834 pieces of the uncirculated version in a plastic capsule and silver sleeve.   ": null
    }
]