[
    {
        "         There are several kinds of means in various branches of ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        " .     For a ": null
    },
    {
        "data set": "Data Set"
    },
    {
        ", the ": null
    },
    {
        "arithmetic mean": "Arithmetic Mean"
    },
    {
        ", also called the ": null
    },
    {
        "mathematical expectation": "Expected Value"
    },
    {
        " or ": null
    },
    {
        "average": "Average"
    },
    {
        ", is the central value of a discrete set of numbers: specifically, the sum of the values divided by the number of values. The arithmetic mean of a set of numbers x 1 , x 2 , ..., x n  is typically denoted by   . If the data set were based on a series of observations obtained by ": null
    },
    {
        "sampling": "Sampling"
    },
    {
        " from a ": null
    },
    {
        "statistical population": "Statistical Population"
    },
    {
        ", the arithmetic mean is the sample mean to distinguish it from the mean of the underlying distribution, the population mean . Underhill, L.G.; Bradfield d. Introstat, Juta and Company Ltd.       In ": null
    },
    {
        "probability": "Probability"
    },
    {
        " and ": null
    },
    {
        "statistics": "Statistics"
    },
    {
        ", the population mean, or ": null
    },
    {
        "expected value": "Expected Value"
    },
    {
        ", is a measure of the ": null
    },
    {
        "central tendency": "Central Tendency"
    },
    {
        " either of a ": null
    },
    {
        "probability distribution": "Probability Distribution"
    },
    {
        " or of the ": null
    },
    {
        "random variable": "Random Variable"
    },
    {
        " characterized by that distribution.  In the case of a ": null
    },
    {
        "discrete probability distribution": "Discrete Probability Distribution"
    },
    {
        " of a random variable X, the mean is equal to the sum over every possible value weighted by the probability of that value; that is, it is computed by taking the product of each possible value x of X and its probability p, and then adding all these products together, giving     x p . Elementary Statistics by Robert R. Johnson and Patricia J. Kuby,  An analogous formula applies to the case of a ": null
    },
    {
        "continuous probability distribution": "Continuous Probability Distribution"
    },
    {
        ". Not every probability distribution has a defined mean; see the ": null
    },
    {
        "Cauchy distribution": "Cauchy Distribution"
    },
    {
        " for an example. Moreover, for some distributions the mean is infinite.     For a finite population, the population mean of a property is equal to the arithmetic mean of the given property while considering every member of the population. For example, the population mean height is equal to the sum of the heights of every individual divided by the total number of individuals. The sample mean may differ from the population mean, especially for small samples. The ": null
    },
    {
        "law of large numbers": "Law Of Large Numbers"
    },
    {
        " dictates that the larger the size of the sample, the more likely it is that the sample mean will be close to the population mean. Schaums Outline of Theory and Problems of Probability by Seymour Lipschutz and Marc Lipson,      Outside probability and statistics, a wide range of other notions of mean are often used in ": null
    },
    {
        "geometry": "Geometry"
    },
    {
        " and ": null
    },
    {
        "analysis": "Mathematical Analysis"
    },
    {
        "; examples are given below.                     The arithmetic mean  of a sample x1,x2,  , usually denoted by   , is the sum of the sampled values divided by the number of items in the sample     :           For example, the arithmetic mean of five values: 4, 36, 45, 50, 75 is:   :     42.       The ": null
    },
    {
        "geometric mean": "Geometric Mean"
    },
    {
        " is an average that is useful for sets of positive numbers that are interpreted according to their product and not their sum ; e.g., rates of growth.   :           For example, the geometric mean of five values: 4, 36, 45, 50, 75 is:   :     30.       The ": null
    },
    {
        "harmonic mean": "Harmonic Mean"
    },
    {
        " is an average which is useful for sets of numbers which are defined in relation to some ": null
    },
    {
        "unit": "Unit Of Measurement"
    },
    {
        ", for example ": null
    },
    {
        "speed": "Speed"
    },
    {
        " .     :   n       For example, the harmonic mean of the five values: 4, 36, 45, 50, 75 is     :     15.            AM, GM, and HM satisfy these inequalities:     :                 Equality holds if and only if all the elements of the given sample are equal.                In ": null
    },
    {
        "descriptive statistics": "Descriptive Statistics"
    },
    {
        ", the mean may be confused with the ": null
    },
    {
        "median": "Median"
    },
    {
        ", ": null
    },
    {
        "mode": "Mode"
    },
    {
        " or ": null
    },
    {
        "mid-range": "Mid-Range"
    },
    {
        ", as any of these may be called an average . The mean of a set of observations is the arithmetic average of the values; however, for ": null
    },
    {
        "skewed distributions": "Skewness"
    },
    {
        ", the mean is not necessarily the same as the middle value , or the most likely value . For example, mean income is typically skewed upwards by a small number of people with very large incomes, so that the majority have an income lower than the mean. By contrast, the median income is the level at which half the population is below and half is above. The mode income is the most likely income and favors the larger number of people with lower incomes. While the median and mode are often more intuitive measures for such skewed data, many skewed distributions are in fact best described by their mean, including the ": null
    },
    {
        "exponential": "Exponential Distribution"
    },
    {
        " and ": null
    },
    {
        "Poisson": "Poisson Distribution"
    },
    {
        " distributions.          The mean of a ": null
    },
    {
        "probability distribution": "Probability Distribution"
    },
    {
        " is the long-run arithmetic average value of a ": null
    },
    {
        "random variable": "Random Variable"
    },
    {
        " having that distribution. In this context, it is also known as the ": null
    },
    {
        "expected value": "Expected Value"
    },
    {
        ". For a ": null
    },
    {
        "discrete probability distribution": "Discrete Probability Distribution"
    },
    {
        ", the mean is given by     xP , where the sum is taken over all possible values of the random variable and P is the ": null
    },
    {
        "probability mass function": "Probability Mass Function"
    },
    {
        ". For a ": null
    },
    {
        "continuous distribution": "Continuous Probability Distribution"
    },
    {
        ",the mean is     xf  , where f is the ": null
    },
    {
        "probability density function": "Probability Density Function"
    },
    {
        ". In all cases, including those in which the distribution is neither discrete nor continuous, the mean is the ": null
    },
    {
        "Lebesgue integral": "Lebesgue Integration"
    },
    {
        " of the random variable with respect to its ": null
    },
    {
        "probability measure": "Probability Measure"
    },
    {
        ". The mean need not exist or be finite; for some probability distributions the mean is infinite , while others have no mean.           The ": null
    },
    {
        "generalized mean": "Generalized Mean"
    },
    {
        ", also known as the power mean or Hölder mean, is an abstraction of the quadratic, arithmetic, geometric and harmonic means. It is defined for a set of n positive numbers x i by     :         By choosing different values for the parameter m, the following types of means are obtained:   :      f-mean": null
    },
    {
        "generalized -mean": "Generalized F-Mean"
    },
    {
        "   :   f      and again a suitable choice of an invertible  will give   :        The ": null
    },
    {
        "weighted arithmetic mean": "Weighted Mean"
    },
    {
        " is used if one wants to combine average values from samples of the same population with different sample sizes:     :         The weights wi represent the sizes of the different samples. In other applications, they represent a measure for the reliability of the influence upon the mean by the respective values.       Sometimes a set of numbers might contain outliers, i.e., data values which are much lower or much higher than the others.   Often, outliers are erroneous data caused by ": null
    },
    {
        "artifacts": "Artifact"
    },
    {
        ". In this case, one can use a ": null
    },
    {
        "truncated mean": "Truncated Mean"
    },
    {
        ". It involves discarding given parts of the data at the top or the bottom end, typically an equal amount at each end and then taking the arithmetic mean of the remaining data. The number of values removed is indicated as a percentage of the total number of values.       The ": null
    },
    {
        "interquartile mean": "Interquartile Mean"
    },
    {
        " is a specific example of a truncated mean. It is simply the arithmetic mean after removing the lowest and the highest quarter of values.   :       xi     assuming the values have been ordered, so is simply a specific example of a weighted mean for a specific set of weights.          In some circumstances mathematicians may calculate a mean of an infinite  set of values. This can happen when calculating the mean value y  of a function f . Intuitively this can be thought of as calculating the area under a section of a curve and then dividing by the length of that section. This can be done crudely by counting squares on graph paper or more precisely by ": null
    },
    {
        "integration": "Integral"
    },
    {
        ". The integration formula is written as:     : y      f      Care must be taken to make sure that the integral converges. But the mean may be finite even if the function itself tends to infinity at some points.       ": null
    },
    {
        "Angles": "Angle"
    },
    {
        ", times of day, and other cyclical quantities require ": null
    },
    {
        "modular arithmetic": "Modular Arithmetic"
    },
    {
        " to add and otherwise combine numbers. In all these situations, there will not be a unique mean. For example, the times an hour before and after midnight are equidistant to both midnight and noon. It is also possible that no mean exists. Consider a ": null
    },
    {
        "color wheel": "Color Wheel"
    },
    {
        "—there is no mean to the set of all colors. In these situations, you must decide which mean is most useful. You can do this by adjusting the values before averaging, or by using a ": null
    },
    {
        "specialized approach for the mean of circular quantities": "Mean Of Circular Quantities"
    },
    {
        ".       The ": null
    },
    {
        "Fréchet mean": "Fréchet Mean"
    },
    {
        " gives a manner for determining the center of a mass distribution on a ": null
    },
    {
        "surface": "Surface"
    },
    {
        " or, more generally, ": null
    },
    {
        "Riemannian manifold": "Riemannian Manifold"
    },
    {
        ". Unlike many other means, the Fréchet mean is defined on a space whose elements cannot necessarily be added together or multiplied by scalars.   It is sometimes also known as the Karcher mean .           ": null
    },
    {
        "Arithmetic-geometric mean": "Arithmetic-Geometric Mean"
    },
    {
        " Arithmetic-harmonic mean": "Arithmetic-Harmonic Mean"
    },
    {
        " Cesàro mean": "Cesàro Mean"
    },
    {
        " Chisini mean": "Chisini Mean"
    },
    {
        " Contraharmonic mean": "Contraharmonic Mean"
    },
    {
        " Elementary symmetric mean": "Elementary Symmetric Mean"
    },
    {
        " Geometric-harmonic mean": "Geometric-Harmonic Mean"
    },
    {
        " Grand mean": "Grand Mean"
    },
    {
        " Heinz mean": "Heinz Mean"
    },
    {
        " Heronian mean": "Heronian Mean"
    },
    {
        " Identric mean": "Identric Mean"
    },
    {
        " Lehmer mean": "Lehmer Mean"
    },
    {
        " Logarithmic mean": "Logarithmic Mean"
    },
    {
        " Moving average": "Moving Average"
    },
    {
        " Neuman–Sándor mean": "Neuman–Sándor Mean"
    },
    {
        " Root mean square": "Root Mean Square"
    },
    {
        "   Rényis entropy": "Rényis Entropy"
    },
    {
        "    Spherical mean": "Spherical Mean"
    },
    {
        " Stolarsky mean": "Stolarsky Mean"
    },
    {
        " Weighted geometric mean": "Weighted Geometric Mean"
    },
    {
        " Weighted harmonic mean": "Weighted Harmonic Mean"
    },
    {
        "               The arithmetic mean of a ": null
    },
    {
        "population": "Statistical Population"
    },
    {
        ", or population mean, is often denoted μ. The sample mean   makes a good ": null
    },
    {
        "estimator": "Estimator"
    },
    {
        " of the population mean, as its expected value is equal to the population mean . The sample mean is a ": null
    },
    {
        "random variable": "Random Variable"
    },
    {
        ", not a constant, since its calculated value will randomly differ depending on which members of the population are sampled, and consequently it will have its own distribution. For a random sample of n ": null
    },
    {
        "independent": "Independence"
    },
    {
        " observations, the expected value of the sample mean is     :   E         and the variance of the sample mean is     :     n.     If the population is ": null
    },
    {
        "normally distributed": "Normal Distribution"
    },
    {
        ", then the sample mean is normally distributed:     :     N      If the population is not normally distributed, the sample mean is nonetheless approximately normally distributed if n is large and  σ 2 /n   ": null
    }
]