[
    {
        "           Mediation is a dynamic, structured, interactive process where a neutral third party assists disputing parties in resolving conflict through the use of specialized communication and negotiation techniques. All participants in mediation are encouraged to actively participate in the process. Mediation is a party-centered process in that it is focused primarily upon the needs, rights, and interests of the parties. The mediator uses a wide variety of techniques to guide the process in a constructive direction and to help the parties find their optimal solution. A mediator is facilitative in that she/he manages the interaction between parties and facilitates open communication. Mediation is also evaluative in that the mediator analyzes issues and relevant norms , while refraining from providing prescriptive advice to the parties .     Mediation, as used in law, is a form of ": null
    },
    {
        "alternative dispute resolution": "Alternative Dispute Resolution"
    },
    {
        " resolving disputes between two or more ": null
    },
    {
        "parties": "Party"
    },
    {
        " with concrete effects. Typically, a third party, the mediator, assists the parties to ": null
    },
    {
        "negotiate": "Negotiation"
    },
    {
        " a settlement. Disputants may mediate disputes in a variety of domains, such as commercial, legal, diplomatic, workplace, community and family matters.     The term mediation broadly refers to any instance in which a third party helps others reach agreement. More specifically, mediation has a structure, timetable and dynamics that ordinary negotiation lacks. The process is private and confidential, possibly enforced by law. Participation is typically voluntary. The mediator acts as a neutral third party and facilitates rather than directs the process. Mediation is becoming a more peaceful and internationally accepted solution in order to end conflict. Mediation can be used to resolve disputes of any magnitude.     The term mediation, however, due to language as well as national legal standards and regulations is not identical in content in all countries but rather has specific connotations and there are quite some differences between Anglo-Saxon definitions and other countries, especially countries with a civil, statutory law tradit.: Embedding Mediation and Dispute Resolution into Statutory Civil Law: The Example of Germany; in: Ian Macduff : Essays on Mediation – Dealing with Disputes in the 21st Century; Alphen aan den Rijn 2016, chapter 12 . ": null
    },
    {
        "Trenczek, T.": "Thomas Trenczek"
    },
    {
        ", Berning, D., Lenz, C. Mediation und Konfliktmanagement: Handbuch, Baden-Baden, Nomos Publishing House, p. 23.     Mediators use various techniques to open, or improve, ": null
    },
    {
        "dialogue": "Dialogue"
    },
    {
        " and ": null
    },
    {
        "empathy": "Empathy"
    },
    {
        " between disputants, aiming to help the parties reach an agreement. Much depends on the mediators skill and training. As the practice gained popularity, training programs, certifications and licensing followed, producing trained, professional mediators committed to the discipline.               The history of mediation goes back to Ancient Greece, where village elders used to mediate local disputes between the villagers. The activity of mediation appeared in very ancient times. The practice developed in ": null
    },
    {
        "Ancient Greece": "Ancient Greece"
    },
    {
        " , then in ": null
    },
    {
        "Roman": "Rome"
    },
    {
        " civilization": "Civilization"
    },
    {
        ".  recognized mediation. The Romans called mediators by a variety of names, including internuncius, medium, intercessor, philantropus, interpolator, conciliator, interlocutor, interpres, and finally mediator.      Now mediation is a form a professional service, and mediators are professionally trained for mediation.     In the UK mediation has seen a rise as a service since the  made it compulsory for separating couples to go through a  before hearing in the Court.     There are some important statistics provided regarding the growth of the UK commercial mediation market increased by 20% from 2016 to 2018; this refers to commercial mediations rather than those relating to small claims. There was also increased scheme-related activity, this included activity from ": null
    },
    {
        "NHS": "National Health Service"
    },
    {
        " Resolution and the ": null
    },
    {
        "Court of Appeal": "Court Of Appeal"
    },
    {
        ", which meant scheme related activity made up to be 37.5% of all mediation activities .     The statistics in 2018 also refer to increased success rates in mediation with 74% achieving settlement on the day of the mediation session, reflecting the speedy nature of mediation once again.        The benefits of mediation  include:     ; Cost : While a mediator may charge a fee comparable to that of an attorney, the mediation process generally takes much less time than moving a case through standard legal channels. While a case in the hands of a lawyer or a court may take months or years to resolve, mediation usually achieves a resolution in a matter of hours. Taking less time means expending less money on hourly fees and costs.     ; Confidentiality : While court hearings are public, mediation remains strictly confidential. No one but the parties to the dispute and the mediator or mediators know what happened. Confidentiality in mediation has such importance that in most cases the legal system cannot force a mediator to testify in court as to the content or progress of mediation. Many mediators destroy their notes taken during a mediation once that mediation has finished. The only exceptions to such strict confidentiality usually involve child abuse or actual or threatened criminal acts.     ; Control : Mediation increases the control the parties have over the resolution. In a court case, the parties obtain a resolution, but control resides with the judge or jury. Often, a judge or jury cannot legally provide solutions that emerge in mediation. Thus, mediation is more likely to produce a result that is mutually agreeable for the parties.     ; Compliance : Because the result is attained by the parties working together and is mutually agreeable, compliance with the mediated agreement is usually high. This further reduces costs, because the parties do not have to employ an attorney to force compliance with the agreement. The mediated agreement is, however, fully enforceable in a court of law.     ; Mutuality : Parties to a mediation are typically ready to work mutually toward a resolution. In most circumstances the mere fact that parties are willing to mediate means that they are ready to move their position. The parties thus are more amenable to understanding the other partys side and work on underlying issues to the dispute. This has the added benefit of often preserving the relationship the parties had before the dispute.     ; Support : Mediators are trained in working with difficult situations. The mediator acts as a neutral facilitator and guides the parties through the process. The mediator helps the parties think outside of the box for possible solutions to the dispute, broadening the range of possible solutions. See www.synergymedmw.com, www.mediation.com, www.mediate4you.com, www.mediate4u.info.            In addition to dispute resolution, mediation can function as a means of dispute prevention, such as facilitating the process of contract negotiation. Governments can use mediation to inform and to seek input from stakeholders in formulation or fact-seeking aspects of policy-making.     Mediation is applicable to disputes in many areas:        ; Family:   ": null
    },
    {
        "Prenuptial": "Prenuptial"
    },
    {
        "/Premarital agreements   Financial or budget disagreements   Separation   ": null
    },
    {
        "Divorce": "Divorcemediated Divorce"
    },
    {
        " Alimony": "Alimony"
    },
    {
        " Eldercare": "Eldercare"
    },
    {
        " business": "Business"
    },
    {
        "es   Adult sibling conflicts   Parent/adult children   Estates   ": null
    },
    {
        "Medical ethics": "Medical Ethics"
    },
    {
        " and end-of-life     ; Workplace:   ": null
    },
    {
        "Wrongful termination": "Wrongful Termination"
    },
    {
        " Workers compensation": "Workers Compensation"
    },
    {
        " Discrimination": "Discrimination"
    },
    {
        " Harassment": "Harassment"
    },
    {
        " Grievances": "Grievance"
    },
    {
        " Labor management": "Labor Dispute"
    },
    {
        "     ; Commercial:   Landlord/tenant   Homeowners associations   Builders/contractors/realtors/homeowners   ": null
    },
    {
        "Contracts": "Contract"
    },
    {
        "  Medical malpractice": "Medical Malpractice"
    },
    {
        " Personal injury": "Personal Injury"
    },
    {
        "Partnerships": "Partnership"
    },
    {
        "    ; Public disputes:   Environmental   Land-use     ; Other:   School conflicts   Violence-prevention   ": null
    },
    {
        "Victim-Offender mediation": "Restorative Justice"
    },
    {
        " Non-profit": "Non-Profit"
    },
    {
        " organizations   Faith communities        Within business and commercial mediation, frequently a distinction is made between ": null
    },
    {
        "business-to-business": "Business-To-Business"
    },
    {
        " , ": null
    },
    {
        "business-to-employee": "Business-To-Employee"
    },
    {
        " and business-to-consumer situations.           ADR, Alternative Dispute Resolution, began in industrial relations in Australia long before the arrival of the modern ADR movement.  One of the first statutes passed by the Commonwealth parliament was the Conciliation   and Arbitration Act 1904 . This allowed the Federal Government to pass laws on conciliation and arbitration for the prevention and settlement of industrial disputes extending beyond the limits of any one state. Conciliation has been the most prominently used form of ADR, and is generally far removed from modern mediation.     Significant changes in state policy took place from 1996 to 2007. The 1996 Workplace Relations Act sought to shift the industrial system away from a collectivist approach, where unions and the ": null
    },
    {
        "Australian Industrial Relations Commission": "Australian Industrial Relations Commission"
    },
    {
        " had strong roles, to a more decentralized system of individual bargaining between employers and employees.   The Act diminished the traditional role of the AIRC by placing the responsibility of resolving disputes at the enterprise level.  This allowed mediation to be used to resolve industrial relations disputes instead of traditional conciliation.     In industrial relations under the 2006 ": null
    },
    {
        "WorkChoices": "Workchoices"
    },
    {
        " amendments to the ": null
    },
    {
        "Workplace Relations Act": "Workplace Relations Act 1996"
    },
    {
        ". Examples of this use of mediation can be seen in recent enterprise bargaining negotiations.   The Australian government claimed the benefits of mediation to include the following:     HRM together with the political and economic changes undertaken by Australias Howard government created an environment where private ADR can be fostered in the workplace.       The decline of ": null
    },
    {
        "unionism": "Trade Unionism"
    },
    {
        " and the rise of the individual encouraged the growth of mediation. This is demonstrated in the industries with the lowest unionization rates such as in the private business sector having the greatest growth of mediation.       The 2006 Work Choices Act made further legislative changes to deregulate industrial relations. A key element of the new changes was to weaken the AIRC by encouraging competition with private mediation.     A great variety of disputes occur in the workplace, including disputes between staff members, allegations of harassment, contractual disputes and workers compensation claims.  At large, workplace disputes are between people who have an ongoing working relationship within a closed system, which indicate that mediation or a workplace investigation would be appropriate as dispute resolution processes. However the complexity of relationships, involving hierarchy, job security and competitiveness can complicate mediation.     ": null
    },
    {
        "Party-directed mediation": "Party-Directed Mediation"
    },
    {
        " is an emerging mediation approach particularly suited for disputes between co-workers, colleagues or peers, especially deep-seated interpersonal conflict, multicultural or multiethnic disputes. The mediator listens to each party separately in a pre-caucus or pre-mediation before ever bringing them into a joint session. Part of the pre-caucus also includes coaching and role plays. The idea is that the parties learn how to converse directly with their adversary in the joint session. Some unique challenges arise when organizational disputes involve supervisors and subordinates. The negotiated ": null
    },
    {
        "performance appraisal": "Performance Appraisal"
    },
    {
        " is a tool for improving communication between supervisors and subordinates and is particularly useful as an alternate mediation model because it preserves the hierarchical power of supervisors while encouraging dialogue and dealing with differences in opinion.  Party-Directed Mediation: Facilitating Dialogue Between Individuals by Gregorio Billikopf , University of California       Disputes involving neighbors often have no official resolution mechanism. Community mediation centers generally focus on neighborhood conflict, with trained local volunteers serving as mediators. Such organizations often serve populations that cannot afford to utilize the courts or professional ADR-providers. Community programs typically provide mediation for disputes between landlords and tenants, members of homeowners associations and small businesses and consumers. Many community programs offer their services for free or at a nominal fee.     Experimental community mediation programs using volunteer mediators began in the early 1970s in several major U.S. cities. These proved to be so successful that hundreds of programs were founded throughout the country in the following two decades. In some jurisdictions, such as California, the parties have the option of making their agreement enforceable in court.     In Australia mediation was incorporated extensively into family law Family Law Act 1975 and the 2006 Amendments Mandatory, http://www.comlaw.gov.au/Details/C2006A00046 subject to certain exceptions, Family Dispute Resolution Mediation is required before courts will consider disputed parenting arrangements. The Family Dispute Resolution Practitioners who provide this service are accredited by the Attorney-Generals Department. http://www.ag.gov.au/FamiliesAndMarriage/Families/FamilyDisputeResolution/Pages/default.aspx       A peer mediator is one who resembles the disputants, such as being of similar age, attending the same school or having similar status in a business. Purportedly, peers can better relate to the disputants than an outsider.     Peer mediation promotes social cohesion and aids development of protective factors that create positive school climates. The National Healthy School Standard highlighted the significance of this approach to reducing bullying and promoting pupil achievement. Schools adopting this process recruit and train interested students to prepare them.     Peace Pals is an empirically validated peer mediation program. The programs creator is Dr. Rita Schellenberg, counselor educator, counselor supervisor, and licensed school counselor. was studied over a 5-year period and revealed several positive outcomes including a reduction in elementary school violence and enhanced social skills, while creating a more positive, peaceful school climate.     Peer mediation helped reduce crime in schools, saved counselor and administrator time, enhanced self-esteem, improved attendance and encouraged development of leadership and problem-solving skills among students. Such conflict resolution programs increased in U.S. schools 40% between 1991 and 1999. Gerber, S 1999, Does peer mediation really work?, Professional School Counseling, 2, 3, 169     Peace Pals was studied in a diverse, suburban elementary school. Peer mediation was available to all students . Significant and long-term reductions in school-wide violence over a five-year period occurred. The reductions included both verbal and physical conflict. Mediator knowledge made significant gains pertaining to conflict, conflict resolution and mediation, which was maintained at 3-month follow-up. Additionally, mediators and participants viewed the Peace Pals program as effective and valuable, and all mediation sessions resulted in successful resolution.       The commercial domain remains the most common application of mediation, as measured by number of mediators and the total exchanged value. The result of business mediation is typically a bilateral contract .     Commercial mediation includes work in finance , insurance , ship-brokering , procurement and real estate . In some areas, mediators have specialized designations and typically operate under special laws. Generally, mediators cannot themselves practice commerce in markets for goods in which they work as mediators.     Procurement mediation comprises disputes between a public body and a private body. In common law jurisdictions only regulatory stipulations on creation of supply contracts that derive from the fields of State Aids or general administrative guidelines extend ordinary laws of commerce. The general law of contract applies in the UK accordingly. Procurement mediation occurs in circumstances after creation of the contract where a dispute arises in regard to the performance or payments. A Procurement mediator in the UK may choose to specialise in this type of contract or a public body may appoint an individual to a specific mediation panel.       In response to the Mabo decision, the Australian Government sought to engage the population and industry on Mabos implications for land tenure and use by enacting the Native Title Act 1993 , which required mediation as a mechanism to determine future native title rights. The process incorporated the Federal Court and the National Native Title Tribunal . Mediation can occur in parallel with legal challenges, such as occurred in Perth.     Some features of native title mediation that distinguish it from other forms include lengthy time frames, the number of parties and that statutory and case law prescriptions constrain some aspects of the negotiations.       Mediations effectiveness in trans-border disputes has been questioned, but an understanding of fundamental mediation principles points to the unlimited potential of mediation in such disputes. Mediators explicitly address and manage cultural and language differences in detail during the process. Voluntary referral to mediation is not required—much mediation to reach the table through binding contractual provisions, statutes, treaties, or international agreements and accords. The principle of voluntariness applies to the right of parties to self-determination once they are in the mediation—not to the mechanism for initiating the mediation process. Much mediation also results form mutual consent because they are non-binding and they encourage the exploration of interests and mutual benefits of an agreement. Because the parties, themselves, create the terms of agreement, compliance with mediated settlement agreements is relatively high. Any compliance or implementation issues can be addressed by follow-up mediation, regular compliance monitoring, and other processes.         Since the early 1980s a number of institutions in South Africa have championed mediation. The Independent Mediation Service of South Africa was established in 1984. It trained mediators who then worked through Local Dispute Resolution Committees set up as part of the National Peace Accord . Initial training was undertaken by the UKs ACAS. IMSSA covers mediation within unionised environments. The more recently created Commission for Conciliation, Mediation and Arbitration was formed as result of the Labour Relation Act No 66 1995, and replaced the Industrial Courts in handling large areas of employment disputes.     Informal processes that engage a community in more holistic solution-finding are growing.     After 1995, the country established a legal right to take an employment dispute to conciliation/mediation. Mediation agreements are binding in law. The process has grown from generally covering collective agreements such as for wages or terms and conditions, to encompass more individual matters including dismissal.               The mediators primary role is to act as a neutral third party who facilitates discussions between the parties. In addition, a mediator serves in an evaluative role when they analyze, assess the issues, and engage in reality-testing. A mediator is neutral and they are not the agent of any party. In their role, mediators do not offer prescriptive advice . Mediators also manage the interaction between the parties and encourage constructive communication through the use of specialized communication techniques.     Finally, the mediator should restrict pressure, aggression and intimidation, demonstrate how to communicate through employing good speaking and listening skills, and paying attention to non-verbal messages and other signals emanating from the context of the mediation and possibly contributing expertise and experience. The mediator should direct the parties to focus on issues and stay away from personal attacks.       The role of the parties varies according to their motivations and skills, the role of legal advisers, the model of mediation, the style of mediator and the culture in which the mediation takes place. Legal requirements may also affect their roles. In New South Wales the Law Society has published A guide to the rights and Responsibilities of participants. Party-directed mediation is an emerging approach involving a pre-caucus between the mediator and each of the parties before going into the joint session. The idea is to help the parties improve their interpersonal negotiation skills so that in the joint session they can address each other with little mediator interference. , by Gregorio Billikopf , University of California. , from Internet Archive       The parties first role is to consent to mediation, possibly before preparatory activities commence. Parties then prepare in much the same way they would for other varieties of negotiations. Parties may provide position statements, valuation reports and risk assessment analysis. The mediator may supervise/facilitate their preparation and may require certain preparations.       Mediation requires direct input from the parties. Parties must attend and participate in the mediation meeting. Some mediation rules require parties to attend in person. Participation at one stage may compensate for absence at another stage.       Choose an appropriate mediator, considering experience, skills, credibility, cost, etc. The criteria for mediator competence is under dispute. Competence certainly includes the ability to remain neutral and to move parties though various impasse-points in a dispute. The dispute is over whether expertise in the subject matter of the dispute should be considered or is actually detrimental to the mediators objectivity.     Preparatory steps for mediation can vary according to legal and other requirements, not least gaining the willingness of the parties to participate. To assist parties in preparing for commercial mediations, particularly in cross-border disputes where there can be very different understandings of the word mediation and the mediation process, the International Mediation Institute has posted an online evaluation form , which is designed to be used by parties working together with their counsel.     In some court-connected mediation programs, courts require disputants to prepare for mediation by making a statement or summary of the subject of the dispute and then bringing the summary to the mediation. In other cases, determining the matter at issue can become part of the mediation itself.     Consider having the mediator meet the disputants prior to the mediation meeting. This can reduce anxiety, improve settlement odds and increase satisfaction with the mediation process. Zutter, Deborah. Preliminary Mediation Practices. Bond University, Australia: Unpublished Thesis, 2004.     Ensure that all participants are ready to discuss the dispute in a reasonably objective fashion. Readiness is improved when disputants consider the viability of various outcomes.     Provide reasonable estimates of loss and/or damage.     Identify other participants. In addition to the disputants and the mediator, the process may benefit from the presence of counsel, subject-matter experts, interpreters, family, etc.     Secure a venue for each mediation session. The venue must foster the discussion, address any special needs, protect privacy and allow ample discussion time.     Ensure that supporting information such as pictures, documents, corporate records, pay-stubs, rent-rolls, receipts, medical reports, bank-statements, etc., are available.     Have parties sign a contract that addresses procedural decisions, including confidentiality, mediator payment, communication technique, etc.       The typical mediation has no formal compulsory elements, although some elements usually occur:     establishment of ground rules framing the boundaries of mediation   parties detail their stories   identification of issues   identify options   discuss and analyze solutions   adjust and refine proposed solutions   record agreement in writing     Individual mediators vary these steps to match specific circumstances, given that the law does not ordinarily govern mediators methods.             Ratification and review provide safeguards for mediating parties. They also provide an opportunity for persons not privy to the mediation to undermine the result.   Some mediated agreements require ratification by an external body—such as a board, council or cabinet. In some situations the sanctions of a court or other external authority must explicitly endorse a mediation agreement. Thus if a grandparent or other non-parent is granted residence rights in a family dispute, a court counselor will be required to furnish a report to the court on merits of the proposed agreement to aid the courts ultimate disposition of the case.   In other situations it may be agreed to have agreements reviewed by lawyers, accountants or other professional advisers.     The implementation of mediated agreements must comply with the statues and regulations of the governing jurisdiction.     Parties to a private mediation may also wish to obtain court sanction for their decisions. Under the Queensland regulatory scheme on court connected mediation, mediators are required to file with a registrar a certificate about the mediation in a form prescribed in the regulations. A party may subsequently apply to a relevant court an order giving effect to the agreement reached. Where court sanction is not obtained, mediated settlements have the same status as any other agreements.       Mediators may at their discretion refer one or more parties to psychologists, accountants, social workers or others for post-mediation professional assistance.       In some situations, a post-mediation debriefing and feedback session is conducted between co-mediators or between mediators and supervisors. It involves a reflective analysis and evaluation of the process. In many community mediation services debriefing is compulsory and mediators are paid for the debriefing session.       Mediation recognised that in addition to the fact of reaching a settlement, party satisfaction and mediator competence could be measured. Surveys of mediation parties reveal strong levels of satisfaction with the process. Of course, if parties are generally satisfied post-settlement, then such measures may not be particularly explanatory.           The educational requirements for accreditation as a mediator differ between accrediting groups and from country to country. In some cases legislation mandates requirements; in others professional bodies impose accreditation standards. Many US universities offer graduate studies in mediation, such as the       In Australia , for example, professionals wanting to practice in the area of family law must have tertiary qualifications in law or in social science, undertake 5 days training in mediation and engage in 10 hours of supervised mediation. Furthermore, they must also undertake 12 hours of education or training every 12 months.     Other institutions offer units in mediation across a number of disciplines such as law, social science, business and the humanities. Not all kinds of mediation-work require academic qualifications, as some deal more with practical skills than with theoretical knowledge. Membership organizations provide training courses. Internationally a similar approach to the training of mediators is taken by organizations such as the Centre for Effective Dispute Resolution , CEDR. Based in London, it has trained over 5000 CEDR mediators from different countries to date. https://www.cedr.com/docslib/2009AchievementsatCEDR3.pdf     No legislated national standards on the level of education apply to all practitioners organizations. However, organizations such as the National Alternative Dispute Resolution Advisory Council advocate for a wide scope on such issues. Other systems apply in other jurisdictions such as Germany, which advocates a higher level of educational qualification for practitioners of mediation.       Common elements of codes of conduct include:     informing participants as to the process of mediation   adopting a neutral stance   revealing any potential conflicts of interest   maintaining confidentiality within the bounds of the law   mindfulness of the psychological and physical wellbeing of all participants   directing participants to appropriate sources for legal advice   engaging in ongoing training   practising only in those fields in which they have expertise.       In Australia mediation codes of conduct include those developed by the Law Societies of South Australia and Western Australia and those developed by organisations such as Institute of Arbitrators & Mediators Australia and LEADR. The CPR/Georgetown Ethics Commission, the Mediation Forum of the Union International des Avocats, and the European Commission have promulgated codes of conduct for mediators.       In Canada codes of conduct for mediators are set by professional organizations. In Ontario three distinct professional organizations maintain codes of conduct for mediators. The Family Dispute Resolution Institute of Ontario and the Ontario Association of Family Mediators set standards for their members who mediate family matters and the Alternative Dispute Resolution Institute of Ontario who sets standards for their members.     The Alternative Dispute Resolution Institute of Ontario, a regional affiliate of the Alternative Dispute Resolution Institute of Canada, uses the code of conduct from the federal organization to regulate the conduct of its members. The Codes three objectives are to provide guiding principles for the conduct of mediators; to promote confidence in mediation as a process for resolving disputes; and to provide protection for members of the public who use mediators who are members of the institute.       In France, professional mediators have created an organization to develop a rational approach to conflict resolution. This approach is based on a scientific definition of a person and a conflict. These definitions help to develop a structured mediation process. Mediators have adopted a code of ethics which guarantees professionalism. Pratique de la médiation professionnelle, Jean-Louis Lascoux, ESF Sciences Humaines, 2001-2017. Code de la Médiation pour lorientation de la médiation, Agnès Tavel, Médiateurs Editeurs, 2009. Dictionnaire encyclopédique de la Médiation au service de la qualité relationnelle et de lEntente Sociale, Jean-Louis Lascoux, ESF Sciences Humaines, 2019.       In Germany, due to the Mediation Act of 2012, mediation as a process and the responsibilities of a mediator are legally defined. Based on the German language and the specific codification one has to take into account, that all persons who mediate in a conflict are tied to the provisions of the Mediation Act even if they call their approach/process not mediation but facilitation , conciliation , conflict counseling , consulting , conflict coaching or what so ever.   For example, according to sec. 2 and sec. 3 of the German Mediation Act, the mediator has certain information and disclosure obligations as well as limittions of practice. In particular, a person who has been in any form of counseling role to a party in this matter is not allowed to act as a mediator in the case .           A range of organizations within Australia accredit mediators. Standards vary according to the specific mediation and the level of specificity that is desired. Standards apply to particular ADR processes.     The National Mediator Accreditation System commenced operation on 1 January 2008. It is an industry-based scheme which relies on voluntary compliance by mediator organisations that agree to accredit mediators in accordance with the requisite standards.     Mediator organizations have varying ideals of what makes a good mediator which reflect the training and accreditation of that particular organization. Australia did not adopt a national accreditation system, which may lead to suboptimal choice of mediators.       According to sec. 6 German Mediation Act the German government on June 21, 2016 has released the German regulation about education and training of the so-called certified mediators which from Sept. 1, 2017 postulates a minimum of 120 hours of initial specialized mediator training as well as case supervision and further ongoing training of 40 hours within 4 years. Beyond this basic qualification, the leading mediation associations have agreed on quality standards higher than the minimum standards of the national regulation to certify their mediators. To become an accredited mediator of these associations one has to complete an accredited mediation training program of a minimum of 200 hours incl. 30 hours of supervision as well as ongoing training .           Mediator selection is of practical significance given varying models of mediation, mediators discretion in structuring the process and the impact of the mediators professional background and personal style on the result.     In community mediation programs the director generally assigns mediators. In New South Wales, for example, when the parties cannot agree on a mediator, the registrar contacts a nominating entity, such as the Bar Association which supplies the name of a qualified and experienced mediator.     As of 2006, formal mechanisms for objecting to the appointment of a particular mediator had not been established. Parties could ask the mediator to withdraw for reasons of conflict of interest . In some cases, legislation establishes criteria for mediators. In New South Wales, for example, the Family Law Act 1975 proscribes qualifications for mediators.       The following are useful criteria for selecting a mediator:   Personal attributes  patience, empathy, intelligence, optimism and flexibility   Qualifications  knowledge of the theory and practice of conflict, negotiation and mediation, mediation skills.   Experience   mediation experience, experience in the substantive area of dispute and personal life experience   Training   Professional background   Certification and its value   Suitability of the mediation model   Disclosure of potential Conflicts of Interest   Cost/fee       Contracts that specify mediation may also specify a third party to suggest or impose an individual. Some third parties simply maintain a list of approved individuals, while others train mediators. Lists may be open or a closed panel .     In the UK and internationally, lists are generally open, such as The Chartered Institute of Arbitrators , the Centre for Effective Dispute Resolution . Alternatively, private panels co-exist and compete for appointments e.g., Savills Mediation.       Legal liability may stem from a mediation. For example, a mediator could be liable for misleading the parties or for even inadvertently breaching confidentiality. Despite such risks, follow-on court action is quite uncommon. Only one case reached that stage in Australia as of 2006. Damage awards are generally compensatory in nature. Proper training is mediators best protection.     Liability can arise for the mediator from Liability in Contract; Liability in Tort; and Liability for Breach of Fiduciary Obligations.     Liability in Contract arises if a mediator breaches contract with one or more parties. The two forms of breach are failure to perform and anticipatory breach. Limitations on liability include the requirement to show actual causation.     Liability in Tort arises if a mediator influences a party in any way , defames a party, breaches confidentiality, or most commonly, is negligent. To be awarded damages, the party must show actual damage, and must show that the mediators actions were the actual cause of the damage.     Liability for Breach of Fiduciary Obligations can occur if parties misconceive their relationship with a mediator as something other than neutrality. Since such liability relies on a misconception, court action is unlikely to succeed.       As of 2008 Tapoohi v Lewenberg was the only case in Australia that set a precedent for mediators liability.     The case involved two sisters who settled an estate via mediation. Only one sister attended the mediation in person: the other participated via telephone with her lawyers present. An agreement was executed. At the time it was orally expressed that before the final settlement, taxation advice should be sought as such a large transfer of property would trigger capital gain s taxes.     Tapoohi paid Lewenberg $1.4 million in exchange for land. One year later, when Tapoohi realized that taxes were owed, she sued her sister, lawyers and the mediator based on the fact that the agreement was subject to further taxation advice.     The original agreement was verbal, without any formal agreement. Tapoohi, a lawyer herself, alleged that the mediator breached his contractual duty, given the lack of any formal agreement; and further alleged tortious breaches of his duty of care.     Although the court dismissed the summary judgment request, the case established that mediators owe a duty of care to parties and that parties can hold them liable for breaching that duty of care. Habersberger J held it not beyond argument that the mediator could be in breach of contractual and tortious duties. Such claims were required to be assessed at a trial court hearing.     This case emphasized the need for formal mediation agreements, including clauses that limit mediators liability.       Within the United States, the laws governing mediation vary by state. Some states have clear expectations for certification, ethical standards and confidentiality. Some also exempt mediators from testifying in cases theyve worked on. However, such laws only cover activity within the court system. Community and commercial mediators practising outside the court system may not have such legal protections. State laws regarding lawyers may differ widely from those that cover mediators. Professional mediators often consider the option of liability insurance .           Evaluative mediation is focused on providing the parties with an evaluation of their case and directing them toward settlement. During an evaluative mediation process, when the parties agree that the mediator should do so, the mediator will express a view on what might be a fair or reasonable settlement. The Evaluative mediator has somewhat of an advisory role in that s/he evaluates the strengths and weaknesses of each sides argument and makes some predictions about what would happen should they go to court. Facilitative and transformative mediators do not evaluate arguments or direct the parties to a particular settlement.     In Germany, due to national regulation evaluative mediation is seen as an oxymoron and not allowed by the German mediation Act. Therefore, in Germany mediation is purly facilitative.       Facilitative mediators typically do not evaluate a case or direct the parties to a particular settlement. Instead, the Facilitative mediator facilitates the conversation. These mediators act as guardian of the process, not the content or the outcome. During a facilitative mediation session the parties in dispute control both what will be discussed and how their issues will be resolved. Unlike the transformative mediator, the facilitative mediator is focused on helping the parties find a resolution to their dispute and to that end, the facilitative mediator provides a structure and agenda for the discussion.         Transformative mediation looks at conflict as a crisis in communication. Success is not measured by settlement but by the parties shifts toward personal strength, interpersonal responsiveness, constructive interaction, new understandings of themselves and their situation, critically examining the possibilities, feeling better about each other, and making their own decisions. Those decisions can include settlement agreements or not. Transformative mediation practice is focused on supporting empowerment and recognition shifts, by allowing and encouraging deliberation, decision-making, and perspective-taking. A competent transformative mediator practices with a microfocus on communication, identifying opportunities for empowerment and recognition as those opportunities appear in the parties own conversations, and responding in ways that provide an opening for parties to choose what, if anything, to do with them.       The narrative approach to mediation shares with narrative therapy an emphasis on constructing stories as a basic human activity in understanding our lives and conflict. This approach emphasizes the sociological/psychological nature of conflict-saturated narratives, and values human creativity in acting and reacting to these narratives. The narrative metaphor draws attention to the ways in which we use stories to make sense of our lives and our relationship. Narrative mediation advocates changing the way we speak about conflicts. In objectifying the conflict narrative, participants become less attached to the problem and more creative in seeking solutions. The person is not the problem; the problem is the problem according to narrative mediation.       Mediation has sometimes been utilized to good effect when coupled with arbitration , particularly binding arbitration , in a process called mediation/arbitration. The process begins as a standard mediation, but if mediation fails, the mediator becomes an arbiter.     This process is more appropriate in civil matters where rules of evidence or jurisdiction are not in dispute. It resembles, in some respects, criminal plea-bargaining and Confucian judicial procedure, wherein the judge also plays the role of prosecutor —rendering what, in Western European court procedures, would be considered an arbitral decision.     Mediation/arbitration hybrids can pose significant ethical and process problems for mediators. Many of the options and successes of mediation relate to the mediators unique role as someone who wields no coercive power over the parties or the outcome. The parties awareness that the mediator might later act in the role of judge could distort the process. Using a different individual as the arbiter addresses this concern.         Online mediation employs online technology to provide disputants access to mediators and each other despite geographic distance, disability or other barriers to direct meeting. Online approaches also facilitate mediation when the value of the dispute does not justify the cost of face-to-face contact. Online mediation can also combine with face-to-face mediation—to allow mediation to begin sooner and/or to conduct preliminary discussions.       Neutral mediators enter into a conflict with the main intention in ending a conflict. This goal tends to hasten a mediator to reach a conclusion. Biased mediators enter into a conflict with specific biases in favor of one party or another. Biased mediators look to protect their parties interest thus leading to a better, more lasting resolution.       Mediation is one of several approaches to resolving disputes. It differs from adversarial resolution processes by virtue of its simplicity, informality, flexibility, and economy. Mediation provides the opportunity for parties to agree terms and resolve issues by themselves, without the need for legal representation or court hearings.     Not all disputes lend themselves well to mediation. Success is unlikely unless: The International Mediation Institute has a decision tree on its website, which is designed to help the parties to jointly select the most suitable mediator out of several neutrals who have all achieved certain level of professional competency.   All parties are ready and willing to participate.   All parties have legal representation. Mediation includes no right to legal counsel.   All parties are of legal age and are legally competent to make decisions.       Conciliation sometimes serves as an umbrella term that covers mediation and facilitative and advisory dispute-resolution processes. Simkin, W. E., ; Mediation and the Dynamics of Collective Bargaining; Bureau of National Affairs Books, Washington DC, Neither process determines an outcome, and both share many similarities. For example, both processes involve a neutral third-party who has no enforcing powers.     One significant difference between conciliation and mediation lies in the fact that conciliators possess expert knowledge of the domain in which they conciliate. The conciliator can make suggestions for settlement terms and can give advice on the subject-matter. Conciliators may also use their role to actively encourage the parties to come to a resolution. In certain types of dispute the conciliator has a duty to provide legal information. This helps ensure that agreements comply with relevant statutory frameworks. Therefore, conciliation may include an advisory aspect.     Mediation is purely facilitative: the mediator has no advisory role. Instead, a mediator seeks to help parties to develop a shared understanding of the conflict and to work toward building a practical and lasting resolution. retrieved 2007-11-24     Both mediation and conciliation work to identify the disputed issues and to generate options that help disputants reach a mutually satisfactory resolution. They both offer relatively flexible processes. Any settlement reached generally must have the agreement of all parties. This contrasts with litigation , which normally settles the dispute in favour of the party with the strongest legal argument. In-between the two operates collaborative law , which uses a facilitative process where each party has counsel .       A counsellor generally uses therapeutic techniques. Some  such as a particular line of questioning  may be useful in mediation. But the role of the counsellor differs from the role of the mediator. The list below is not exhaustive but it gives an indication of important distinctions:     A mediator aims for clear agreement between the participants as to how they will deal with specific issues. A counsellor is more concerned with the parties gaining a better self-understanding of their individual behaviour.   A mediator, while acknowledging a persons feelings, does not explore them in any depth. A counsellor is fundamentally concerned about how people feel about a range of relevant experiences.   A mediator focuses upon participants future goals rather than a detailed analysis of past events. A counsellor may find it necessary to explore the past in detail to expose the origins and patterns of beliefs and behaviour.   A mediator controls the process but does not overtly try to influence the participants or the actual outcome. A counsellor often takes an intentional role in the process, seeking to influence the parties to move in a particular direction or consider specific issues.   A mediator relies on all parties being present to negotiate, usually face-to-face. A counsellor does not necessarily see all parties at the same time.   A mediator is required to be neutral. A counsellor may play a more supportive role, where appropriate.   Mediation requires both parties to be willing to negotiate. Counselling may work with one party even if the other is not ready or willing to participate.   Mediation is a structured process that typically completes in one or a few sessions. Counselling tends to be ongoing, depending upon participants needs and progress.       The technique of early neutral evaluation": null
    }
]