[
    {
        "            Medieval fortification refers to ": null
    },
    {
        "medieval": "Medieval Technology"
    },
    {
        " military methods that cover the development of ": null
    },
    {
        "fortification": "Fortification"
    },
    {
        " construction and use in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ", roughly from the fall of the ": null
    },
    {
        "Western Roman Empire": "Western Roman Empire"
    },
    {
        " to the ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        ". During this millennium, fortifications changed ": null
    },
    {
        "warfare": "Medieval Warfare"
    },
    {
        ", and in turn were modified to suit new ": null
    },
    {
        "tactics": "Military Tactics"
    },
    {
        ", ": null
    },
    {
        "weapons": "Weapon"
    },
    {
        "and ": null
    },
    {
        "siege": "Siege"
    },
    {
        " techniques.                 ": null
    },
    {
        "Towers": "Tower"
    },
    {
        "of medieval ": null
    },
    {
        "castles": "Castle"
    },
    {
        "were usually made of stone or sometimes wood. Often toward the later part of the era they included battlements and arrow loops. Arrow loops were vertical slits in the wall through which archers inside shot arrows at the attackers, but made it extremely difficult for attackers to get many arrows back through at the defenders.                 An exact nature of the walls of a medieval town or city would depend on the resources available for building them, the nature of the terrain, and the perceived threat. In northern ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ", early in the period, walls were likely to have been constructed of wood and proofed against small forces. Especially where stone was readily available for building, the wood will have been replaced by stone to a higher or lower standard of security. This would have been the pattern of events in the ": null
    },
    {
        "Five Boroughs": "Five Burghs"
    },
    {
        " of the ": null
    },
    {
        "Danelaw": "Danelaw"
    },
    {
        " in ": null
    },
    {
        "England": "England"
    },
    {
        ".     In many cases, the wall would have had an internal and an external  pomoerium . This was a strip of clear ground immediately adjacent the wall. The word is from the late ": null
    },
    {
        "medieval": "Medieval"
    },
    {
        ", derived from the classical ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " post murum .     An external pomoerium, stripped of bushes and building, gave defenders a clear view of what was happening outside and an unobstructed field of shot. An internal pomoerium gave ready access to the rear of the ": null
    },
    {
        "curtain wall": "Curtain Wall"
    },
    {
        " to facilitate movement of the ": null
    },
    {
        "garrison": "Garrison"
    },
    {
        " to a point of need. By the end of the sixteenth century, the word had developed further in common use, into pomery.        Also by that time, the medieval walls were no longer secure against a serious threat from an army, as they were not designed to be strong enough to resist cannon fire. They were sometimes rebuilt, as at ": null
    },
    {
        "Berwick on Tweed": "Berwick On Tweed"
    },
    {
        ", or retained for use against thieves and other threats of a lower order. Very elaborate and complex schemes for town defences were developed in the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        " and ": null
    },
    {
        "France": "France"
    },
    {
        ", but these belong mainly to the post-medieval periods. By 1600, the medieval wall is likely to have been seen more as a platform for displaying hangings and the pomery as a gathering ground for spectators, or as a source of building stone and a site for its use, respectively. However, a few, such as those of ": null
    },
    {
        "Carcassonne": "Carcassonne"
    },
    {
        " and ": null
    },
    {
        "Dubrovnik": "Dubrovnik"
    },
    {
        ", survived fairly well and have been restored to a nearly complete state.     Medieval walls that were no longer adequate for defending were succeeded by the ": null
    },
    {
        "star fort": "Star Fort"
    },
    {
        ". After the invention of the ": null
    },
    {
        "explosive shell": "Explosive Shell"
    },
    {
        ", star forts became obsolete as well.          ": null
    },
    {
        "Harbours": "Harbour"
    },
    {
        "or some sort of water access was often essential to the construction of medieval fortification. It was a direct route for trading and fortification. Having direct access to a body of water provided a route for resupply in times of war, an additional method of transportation in times of peace, and potential drinking water for a ": null
    },
    {
        "besiege": "Besiege"
    },
    {
        "d castle or fortification. The concept of rivers or harbours coming directly up to the walls of fortifications was especially used by the English as they constructed castles throughout ": null
    },
    {
        "Wales": "Wales"
    },
    {
        ".   There is evidence that harbours were fortified, with wooden structures in the water creating a semi-circle around the harbour, or jetties, as seen in an artists reconstruction of Hedeby, in Denmark, with an opening for ships to access the land. Usually, these wooden structures would have small bases at either end, creating a watch and defense platform.          ": null
    },
    {
        "Religion": "Religion"
    },
    {
        " was a central part of the lives of medieval soldiers, and ": null
    },
    {
        "churches": "Church"
    },
    {
        ", ": null
    },
    {
        "chapel": "Chapel"
    },
    {
        "s, ": null
    },
    {
        "monasteries": "Monastery"
    },
    {
        ", and other buildings of religious function were often included within the walls of any fortification, be it temporary or permanent. A place to conduct religious services was usually essential to the morale of the soldiers.          Motte-and-bailey was the prevalent form of castle during 11th and 12th centuries. A courtyard was protected by a ditch and a palisade . Often the entrance was protected by a lifting bridge, a ": null
    },
    {
        "drawbridge": "Drawbridge"
    },
    {
        " or a timber gate tower. Inside the bailey were stables, workshops, and a chapel.     The motte was the final refuge in this type of castle. It was a raised earth mound, and varied considerably, with these mounds being 3 metres to 30 metres in height , and from  in diameter. Toy, p.52. There was a tower on top of the motte. In most cases, the tower was made of timber, though some were also made of stones. Stone towers were found in natural mounds, as artificial ones were not strong enough to support stone towers. Larger mottes had towers with many rooms, including the great hall. Smaller ones had only a watch tower.          Construction could sometimes take decades. The string of Welsh castles ": null
    },
    {
        "Edward I of England": "Edward I Of England"
    },
    {
        " had built were an exception in that he focused much of the resources of his kingdom on their speedy construction. In addition to paid workers, forced levies of labourers put thousands of men on each site and shortened construction to a few years.          Nature could provide very effective defenses for the castle. For this reason many castles were built on larger hills, cliffs, close to rivers, lakes or even caves.       Materials that were used in the building of castles varied through history. Wood was used for most castles until 1066. They were cheap and were quick to construct. The reason wood fell into disuse as a material is that it is quite flammable. Soon stone became more popular.     Stone castles took years to construct depending on the overall size of the castle. Stone was stronger and of course much more expensive than wood. Most stone had to be quarried miles away, and then brought to the building site. But with the invention of the cannon and gunpowder, castles soon lost their power.          Costs for the walls depended on the material used. Wood would cost very little and was quick to build, but was weak. Stone was strong but very expensive and time-consuming to construct.       Manpower in the medieval era in Europe consisted mainly of serfs.                The height of walls varied widely by castle, but were often  thick. They were usually topped with ": null
    },
    {
        "crenellation": "Crenellation"
    },
    {
        " or ": null
    },
    {
        "parapets": "Parapet"
    },
    {
        "that offered protection to defenders. Some also featured ": null
    },
    {
        "machicolations": "Machicolation"
    },
    {
        "  which consisted of openings between a wall and a parapet, formed by ": null
    },
    {
        "corbel": "Corbel"
    },
    {
        "ling out the latter, allowing defenders to throw stones, boiling water, and so forth, upon assailants below. Some castles featured additional inner walls, as additional ": null
    },
    {
        "fortifications": "Fortification"
    },
    {
        "from which to mount a defense if outer walls were breached.             Any entrance through a wall, being an opening, forms an obvious weak point. To be practical, the entryway would have to accommodate supplies being brought through, yet difficult for attackers to breach. For example, passage over ditches or moats would have to be withdrawn to deny attackers. The use of multiple walls or ditches around an entrance would also make it difficult for defenders to use the entrance practically, necessitating better methods of control. Gates came in many forms, from the simple stone buttress and timber blocks,  to the massive and imposing stone archways and thick wooden doors most associated with medieval citadels.       A killing field was an area between the main wall and a secondary wall, so when the first wall was breached the attackers would run into the killing field to be confronted by another wall from which soldiers bombarded them. Soldiers would be positioned atop the second wall and armed with any variety of weapons, ranging from bows to crossbows to simple rocks.          A moat was a common addition to medieval fortifications, and the principal purpose was to simply increase the effective height of the walls and to prevent digging under the walls. In many instances, natural water paths were used as moats, and often extended through ditches to surround as much of the fortification as possible. Provided this was not so unnaturally contrived as to allow an attacker to drain the system, it served two defensive purposes. It made approaching the curtain wall of the castle more difficult and the undermining of the wall virtually impossible. To position a castle on a small island was very favorable from a defensive point of view, although it made deliveries of supplies and building materials more cumbersome and expensive.          A keep is a strong central tower which normally forms the heart of a castle. Often the keep is the most defended area of a castle, and as such may form the main habitation area for a noble or lord, or contain important stores such as the armoury or the main well.          Stairs were also constructed to contain trick or stumble steps. These were steps that had different rise height or tread depth from the rest and would cause anyone running up the stairs to stumble or fall, so slowing down the attackers progress.          A typical exterior wooden ": null
    },
    {
        "door": "Door"
    },
    {
        " might be made out of two layers of ": null
    },
    {
        "oak": "Oak"
    },
    {
        " planks. The grain of the wood would run vertically on the front layer and horizontally on the back, like a simple form of ": null
    },
    {
        "plywood": "Plywood"
    },
    {
        ". The two layers would be held together by iron studs, and the structure might be strengthened and stiffened with iron bands.     The studs themselves were pointed on the front so that attackers would damage their weapons  while trying to break through.       From the mid-15th century onwards, the power of cannons grew and medieval walls became obsolete as they were too thin to offer any realistic protection against prolonged ": null
    },
    {
        "bomb": "Bomb"
    },
    {
        "ardment.  As a consequence of this, medieval walls were often upgraded with the addition of artillery platforms or bastions, and battlements were replaced by thick parapets with ": null
    },
    {
        "embrasure": "Embrasure"
    },
    {
        "s. In many cases, the medieval walls were dismantled and their stonework, which was still valuable as construction material, was reused in the construction of the new fortifications.  The resulting space is often seen in old city centers of Europe even to this day, as broader streets often outline where the old wall once stood .     The transition between medieval and early modern fortification can be seen in the ": null
    },
    {
        "fortifications of Rhodes": "Fortifications Of Rhodes"
    },
    {
        " in Greece and the ": null
    },
    {
        "fortifications of Famagusta": "Fortifications Of Famagusta"
    },
    {
        " in Cyprus.        Just as modern military ": null
    },
    {
        "engineers": "Combat Engineer"
    },
    {
        " enhance field fortifications with obstacles such as ": null
    },
    {
        "barbed wire": "Wire Obstacle"
    },
    {
        ", medieval engineers used a number of obstacle types including ": null
    },
    {
        "abatis": "Abatis"
    },
    {
        ", ": null
    },
    {
        "caltrop": "Caltrop"
    },
    {
        "s, ": null
    },
    {
        "cheval de frise": "Cheval De Frise"
    },
    {
        ", and ": null
    },
    {
        "trou de loup": "Trou De Loup"
    },
    {
        ".      ": null
    },
    {
        "Trebuchet": "Trebuchet"
    },
    {
        " Cannon": "Cannon"
    },
    {
        " Mangonel": "Mangonel"
    },
    {
        " Ballista": "Ballista"
    },
    {
        " Catapult": "Catapult"
    }
]