[
    {
        "   Mendelevium is a ": null
    },
    {
        "synthetic element": "Synthetic Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Chemical Symbol"
    },
    {
        " Md  and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " 101. A metallic ": null
    },
    {
        "radioactive": "Radioactive"
    },
    {
        " transuranic": "Transuranic"
    },
    {
        " element in the ": null
    },
    {
        "actinide": "Actinide"
    },
    {
        " series, it is the first element by atomic number that currently cannot be produced in macroscopic quantities through ": null
    },
    {
        "neutron": "Neutron"
    },
    {
        " bombardment of lighter elements. It is the third-to-last actinide and the ninth ": null
    },
    {
        "transuranic element": "Transuranic Element"
    },
    {
        ". It can only be produced in ": null
    },
    {
        "particle accelerators": "Particle Accelerator"
    },
    {
        "by bombarding lighter elements with charged particles. A total of sixteen ": null
    },
    {
        "mendelevium isotopes": "Isotopes Of Mendelevium"
    },
    {
        " are known, the most stable being 258 Md with a ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of 51  days; nevertheless, the shorter-lived 256 Md  is most commonly used in chemistry because it can be produced on a larger scale.     Mendelevium was discovered by bombarding ": null
    },
    {
        "einsteinium": "Einsteinium"
    },
    {
        " with ": null
    },
    {
        "alpha particles": "Alpha Particle"
    },
    {
        "in 1955, the same method still used to produce it today. It was named after ": null
    },
    {
        "Dmitri Mendeleev": "Dmitri Mendeleev"
    },
    {
        ", father of the ": null
    },
    {
        "periodic table": "Periodic Table"
    },
    {
        " of the chemical elements. Using available ": null
    },
    {
        "microgram": "Microgram"
    },
    {
        " quantities of the isotope einsteinium-253, over a million mendelevium atoms may be produced each hour. The chemistry of mendelevium is typical for the late actinides, with a preponderance of the +3 oxidation state but also an accessible +2 oxidation state. All of the isotopes of mendelevium have relatively short half-lives, there are currently no uses for it outside basic scientific research, and only small amounts are produced.          Mendelevium was the ninth ": null
    },
    {
        "transuranic element": "Transuranic Element"
    },
    {
        " to be synthesized. It was first ": null
    },
    {
        "synthesized": "Discovery Of The Chemical Elements"
    },
    {
        " by ": null
    },
    {
        "Albert Ghiorso": "Albert Ghiorso"
    },
    {
        ", ": null
    },
    {
        "Glenn T. Seaborg": "Glenn T. Seaborg"
    },
    {
        ", ": null
    },
    {
        "Gregory Robert Choppin": "Gregory Robert Choppin"
    },
    {
        ", Bernard G. Harvey, and team leader ": null
    },
    {
        "Stanley G. Thompson": "Stanley G. Thompson"
    },
    {
        " in early 1955 at the University of California, Berkeley. The team produced 256 Md  when they bombarded an 253 ": null
    },
    {
        "Es": "Einsteinium"
    },
    {
        " target consisting of only a ": null
    },
    {
        "billion": "1,000,000,000"
    },
    {
        " einsteinium atoms with ": null
    },
    {
        "alpha particles": "Alpha Particle"
    },
    {
        "  in the ": null
    },
    {
        "Berkeley Radiation Laboratorys": "Berkeley Radiation Laboratory"
    },
    {
        "60-inch ": null
    },
    {
        "cyclotron": "Cyclotron"
    },
    {
        ", thus increasing the targets atomic number by two. 256 Md thus became the first isotope of any element to be synthesized one atom at a time. In total, seventeen mendelevium atoms were produced.  This discovery was part of a program, begun in 1952, that irradiated ": null
    },
    {
        "plutonium": "Plutonium"
    },
    {
        " with neutrons to transmute it into heavier actinides.  This method was necessary as the previous method used to synthesize transuranic elements, ": null
    },
    {
        "neutron capture": "Neutron Capture"
    },
    {
        ", could not work because of a lack of known ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        "ing ": null
    },
    {
        "isotopes of fermium": "Isotopes Of Fermium"
    },
    {
        " that would produce isotopes of the next element, mendelevium, and also due to the very short half-life to ": null
    },
    {
        "spontaneous fission": "Spontaneous Fission"
    },
    {
        " of 258 ": null
    },
    {
        "Fm": "Fermium"
    },
    {
        " that thus constituted a hard limit to the success of the neutron capture process.      To predict if the production of mendelevium would be possible, the team made use of a rough calculation. The number of atoms that would be produced would be approximately equal to the product of the number of atoms of target material, the targets cross section, the ion beam intensity, and the time of bombardment; this last factor was related to the half-life of the product when bombarding for a time on the order of its half-life. This gave one atom per experiment. Thus under optimum conditions, the preparation of only one atom of element 101 per experiment could be expected. This calculation demonstrated that it was feasible to go ahead with the experiment. The target material, einsteinium-253, could be produced readily from irradiating ": null
    },
    {
        "plutonium": "Plutonium"
    },
    {
        "half-life": "Half-Life"
    },
    {
        " meant that the element 101 experiments could be conducted in one week after the produced einsteinium was separated and purified to make the target. However, it was necessary to upgrade the cyclotron to obtain the needed intensity of 10 14 alpha particles per second; Seaborg applied for the necessary funds.        While Seaborg applied for funding, Harvey worked on the einsteinium target, while Thomson and Choppin focused on methods for chemical isolation. Choppin suggested using ": null
    },
    {
        "α-hydroxyisobutyric acid": "Α-Hydroxyisobutyric Acid"
    },
    {
        " to separate the mendelevium atoms from those of the lighter actinides. The actual synthesis was done by a recoil technique, introduced by Albert Ghiorso. In this technique, the einsteinium was placed on the opposite side of the target from the beam, so that the recoiling mendelevium atoms would get enough ": null
    },
    {
        "momentum": "Momentum"
    },
    {
        " to leave the target and be caught on a catcher foil made of gold. This recoil target was made by an electroplating technique, developed by Alfred Chetham-Strode. This technique gave a very high yield, which was absolutely necessary when working with such a rare and valuable product as the einsteinium target material. The recoil target consisted of 10 9 atoms of 253 Es which were deposited electrolytically on a thin gold foil. It was bombarded by 41  ": null
    },
    {
        "MeV": "Mev"
    },
    {
        "alpha particles": "Alpha Particle"
    },
    {
        "in the ": null
    },
    {
        "Berkeley cyclotron": "Berkeley Cyclotron"
    },
    {
        " with a very high beam density of 6×10 13 particles per second over an area of 0.05  cm 2 . The target was cooled by water or ": null
    },
    {
        "liquid helium": "Liquid Helium"
    },
    {
        ", and the foil could be replaced.      Initial experiments were carried out in September 1954. No alpha decay was seen from mendelevium atoms; thus, Ghiorso suggested that the mendelevium had all decayed by ": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        " to ": null
    },
    {
        "fermium": "Fermium"
    },
    {
        " and that the experiment should be repeated to search instead for ": null
    },
    {
        "spontaneous fission": "Spontaneous Fission"
    },
    {
        " events. The repetition of the experiment happened in February 1955.        On the day of discovery, 19 February, alpha irradiation of the einsteinium target occurred in three three-hour sessions. The cyclotron was in the ": null
    },
    {
        "University of California": "University Of California"
    },
    {
        " campus, while the Radiation Laboratory was on the next hill. To deal with this situation, a complex procedure was used: Ghiorso took the catcher foils from the cyclotron to Harvey, who would use ": null
    },
    {
        "aqua regia": "Aqua Regia"
    },
    {
        " to dissolve it and pass it through an ": null
    },
    {
        "anion": "Anion"
    },
    {
        "-exchange ": null
    },
    {
        "resin": "Resin"
    },
    {
        " column to separate out the ": null
    },
    {
        "transuranium elements": "Transuranium Element"
    },
    {
        "from the gold and other products.  The resultant drops entered a ": null
    },
    {
        "test tube": "Test Tube"
    },
    {
        ", which Choppin and Ghiorso took in a car to get to the Radiation Laboratory as soon as possible. There Thompson and Choppin used a ": null
    },
    {
        "cation": "Cation"
    },
    {
        "-exchange resin column and the α-hydroxyisobutyric acid. The solution drops were collected on ": null
    },
    {
        "platinum": "Platinum"
    },
    {
        " disks and dried under heat lamps. The three disks were expected to contain respectively the fermium, no new elements, and the mendelevium. Finally, they were placed in their own counters, which were connected to recorders such that spontaneous fission events would be recorded as huge deflections in a graph showing the number and time of the decays. There thus was no direct detection, but by observation of spontaneous fission events arising from its electron-capture daughter 256 Fm. The first one was identified with a hooray followed by a double hooray and a triple hooray . The fourth one eventually officially proved the chemical identification of the 101st element, mendelevium. In total, five decays were reported up till 4  a.m. Seaborg was notified and the team left to sleep. Additional analysis and further experimentation showed the produced mendelevium isotope to have mass 256 and to decay by electron capture to fermium-256 with a half-life of 1.5  h.          Being the first of the second hundred of the chemical elements, it was decided that the element would be named mendelevium after the Russian chemist ": null
    },
    {
        "Dmitri Mendeleev": "Dmitri Mendeleev"
    },
    {
        ", father of the ": null
    },
    {
        "periodic table": "Periodic Table"
    },
    {
        ". Because this discovery came during the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ", Seaborg had to request permission of the government of the ": null
    },
    {
        "United States": "United States"
    },
    {
        " to propose that the element be named for a Russian, but it was granted. The name mendelevium was accepted by the ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "International Union Of Pure And Applied Chemistry"
    },
    {
        " in 1955 with symbol Mv ,  which was changed to Md in the next IUPAC General Assembly .               In the ": null
    },
    {
        "periodic table": "Periodic Table"
    },
    {
        ", mendelevium is located to the right of the actinide ": null
    },
    {
        "fermium": "Fermium"
    },
    {
        ", to the left of the actinide ": null
    },
    {
        "nobelium": "Nobelium"
    },
    {
        ", and below the lanthanide ": null
    },
    {
        "thulium": "Thulium"
    },
    {
        ". Mendelevium metal has not yet been prepared in bulk quantities, and bulk preparation is currently impossible. Silva, pp. 1634–5 Nevertheless, a number of predictions and some preliminary experimental results have been done regarding its properties.     The lanthanides and actinides, in the metallic state, can exist as either divalent  or trivalent metals. The former have f n d 1 s 2 configurations, whereas the latter have f n+1 s 2 configurations. In 1975, Johansson and Rosengren examined the measured and predicted values for the ": null
    },
    {
        "cohesive energies": "Cohesive Energy"
    },
    {
        "  of the metallic ": null
    },
    {
        "lanthanides": "Lanthanide"
    },
    {
        "and ": null
    },
    {
        "actinide": "Actinide"
    },
    {
        "s, both as divalent and trivalent metals. Silva, pp. 1626–8  The conclusion was that the increased binding energy of the f 12 6d 1 7s 2 configuration over the f 13 7s 2 configuration for mendelevium was not enough to compensate for the energy needed to promote one 5f electron to 6d, as is true also for the very late actinides: thus ": null
    },
    {
        "einsteinium": "Einsteinium"
    },
    {
        ", ": null
    },
    {
        "fermium": "Fermium"
    },
    {
        ", mendelevium, and ": null
    },
    {
        "nobelium": "Nobelium"
    },
    {
        " were expected to be divalent metals. The increasing predominance of the divalent state well before the actinide series concludes is attributed to the ": null
    },
    {
        "relativistic": "Relativistic Quantum Chemistry"
    },
    {
        " stabilization of the 5f electrons, which increases with increasing atomic number.  ": null
    },
    {
        "Thermochromatographic": "Thermochromatography"
    },
    {
        " studies with trace quantities of mendelevium by Zvara and Hübener from 1976 to 1982 confirmed this prediction. In 1990, Haire and Gibson estimated mendelevium metal to have an ": null
    },
    {
        "enthalpy of sublimation": "Enthalpy Of Sublimation"
    },
    {
        " between 134 and 142  kJ/mol. Divalent mendelevium metal should have a ": null
    },
    {
        "metallic radius": "Metallic Radius"
    },
    {
        " of around . Like the other divalent late actinides , metallic mendelevium should assume a ": null
    },
    {
        "face-centered cubic": "Face-Centered Cubic"
    },
    {
        " crystal structure. Mendeleviums melting point has been estimated at 827  °C, the same value as that predicted for the neighboring element nobelium.  Its density is predicted to be around .       The chemistry of mendelevium is mostly known only in solution, in which it can take on the +3 or +2 ": null
    },
    {
        "oxidation state": "Oxidation State"
    },
    {
        "s. The +1 state has also been reported, but has not yet been confirmed. Silva, pp. 1635–6     Before mendeleviums discovery, ": null
    },
    {
        "Seaborg": "Glenn T. Seaborg"
    },
    {
        " and Katz predicted that it should be predominantly trivalent in aqueous solution and hence should behave similarly to other tripositive lanthanides and actinides. After the synthesis of mendelevium in 1955, these predictions were confirmed, first in the observation at its discovery that it ": null
    },
    {
        "eluted": "Elution"
    },
    {
        " just after fermium in the trivalent actinide elution sequence from a cation-exchange column of resin, and later the 1967 observation that mendelevium could form insoluble ": null
    },
    {
        "hydroxides": "Hydroxide"
    },
    {
        "and ": null
    },
    {
        "fluorides": "Fluoride"
    },
    {
        "that coprecipitated with trivalent lanthanide salts. Cation-exchange and solvent extraction studies led to the conclusion that mendelevium was a trivalent actinide with an ionic radius somewhat smaller than that of the previous actinide, fermium. Mendelevium can form ": null
    },
    {
        "coordination complex": "Coordination Complex"
    },
    {
        "es with 1,2-cyclohexanedinitrilotetraacetic acid .     In ": null
    },
    {
        "reducing": "Redox"
    },
    {
        " conditions, mendelevium can be easily reduced to mendelevium, which is stable in aqueous solution. The ": null
    },
    {
        "standard reduction potential": "Standard Reduction Potential"
    },
    {
        " of the E° couple was variously estimated in 1967 as −0.10  V or −0.20  V: later 2013 experiments established the value as .    In comparison, E° should be around −1.74  V, and E° should be around −2.5  V. Mendeleviums elution behavior has been compared with that of ": null
    },
    {
        "strontium": "Strontium"
    },
    {
        " and ": null
    },
    {
        "europium": "Europium"
    },
    {
        ".     In 1973, mendelevium was reported to have been produced by Russian scientists, who obtained it by reducing higher oxidation states of mendelevium with ": null
    },
    {
        "samarium": "Samarium"
    },
    {
        ". It was found to be stable in neutral water–": null
    },
    {
        "ethanol": "Ethanol"
    },
    {
        " solution and be ": null
    },
    {
        "homologous": "Homology"
    },
    {
        " to ": null
    },
    {
        "caesium": "Caesium"
    },
    {
        ". However, later experiments found no evidence for mendelevium and found that mendelevium behaved like divalent elements when reduced, not like the monovalent ": null
    },
    {
        "alkali metal": "Alkali Metal"
    },
    {
        "s. Nevertheless, the Russian team conducted further studies on the ": null
    },
    {
        "thermodynamics": "Thermodynamics"
    },
    {
        " of cocrystallizing mendelevium with alkali metal ": null
    },
    {
        "chloride": "Chloride"
    },
    {
        "s, and concluded that mendelevium had formed and could form mixed crystals with divalent elements, thus cocrystallizing with them. The status of the +1 oxidation state is still tentative.     Although E° was predicted in 1975 to be +5.4  V, suggesting that mendelevium could be oxidized to mendelevium, 1967 experiments with the strong oxidizing agent ": null
    },
    {
        "sodium bismuthate": "Sodium Bismuthate"
    },
    {
        " were unable to oxidize mendelevium to mendelevium.       A mendelevium atom has 101 electrons, of which at least three can act as ": null
    },
    {
        "valence electron": "Valence Electron"
    },
    {
        "s. They are expected to be arranged in the configuration f 13 7s 2 , although experimental verification of this electron configuration had not yet been made as of 2006. Silva, pp. 1633–4 In forming compounds, three valence electrons may be lost, leaving behind a f 12 core: this conforms to the trend set by the other actinides with their  5f n electron configurations in the tripositive state. The first ": null
    },
    {
        "ionization potential": "Ionization Potential"
    },
    {
        " of mendelevium was measured to be at most  ": null
    },
    {
        "eV": "Electronvolt"
    },
    {
        " in 1974, based on the assumption that the 7s electrons would ionize before the 5f ones;  this value has since not yet been refined further due to mendeleviums scarcity and high radioactivity. David R. Lide , CRC Handbook of Chemistry and Physics, 84th Edition. CRC Press. Boca Raton, Florida, 2003; Section 10, Atomic, Molecular, and Optical Physics; Ionization Potentials of Atoms and Atomic Ions The ionic radius of ": null
    },
    {
        "hexacoordinate": "Coordination Number"
    },
    {
        " Md 3+ had been preliminarily estimated in 1978 to be around 91.2  pm; 1988 calculations based on the logarithmic trend between ": null
    },
    {
        "distribution coefficients": "Distribution Coefficient"
    },
    {
        "and ionic radius produced a value of 89.6  pm, as well as an ": null
    },
    {
        "enthalpy of hydration": "Enthalpy Of Hydration"
    },
    {
        " of . Md 2+ should have an ionic radius of 115  pm and hydration enthalpy −1413  kJ/mol; Md + should have ionic radius 117  pm.            Sixteen isotopes of mendelevium are known, with mass numbers from 245 to 260; all are radioactive. Silva, pp. 1630–1 Additionally, five ": null
    },
    {
        "nuclear isomers": "Nuclear Isomer"
    },
    {
        "are known: 245m Md, 247m Md, 249m Md, 254m Md, and 258m Md.  Of these, the longest-lived isotope is 258 Md with a half-life of 51.5  days, and the longest-lived isomer is 258m Md with a half-life of 58.0  minutes.  Nevertheless, the shorter-lived 256 Md is more often used in chemical experimentation because it can be produced in larger quantities from ": null
    },
    {
        "alpha particle": "Alpha Particle"
    },
    {
        " irradiation of einsteinium. After 258 Md, the next most stable mendelevium isotopes are 260 Md with a half-life of 31.8  days, 257 Md with a half-life of 5.52  hours, 259 Md with a half-life of 1.60  hours, and 256 Md with a half-life of 1.17  hours. All of the remaining mendelevium isotopes have half-lives that are less than an hour, and the majority of these have half-lives that are less than 5  minutes.     The half-lives of mendelevium isotopes mostly increase smoothly from 245 Md onwards, reaching a maximum at 258 Md. Experiments and predictions suggest that the half-lives will then decrease, apart from 260 Md with a half-life of 31.8  days, as ": null
    },
    {
        "spontaneous fission": "Spontaneous Fission"
    },
    {
        " becomes the dominant decay mode due to the mutual repulsion of the protons posing a limit to the ": null
    },
    {
        "island of relative stability": "Island Of Stability"
    },
    {
        " of long-lived nuclei in the ": null
    },
    {
        "actinide": "Actinide"
    },
    {
        " series.      Mendelevium-256, the chemically most important isotope of mendelevium, decays through ": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        " 90% of the time and ": null
    },
    {
        "alpha decay": "Alpha Decay"
    },
    {
        " 10% of the time. It is most easily detected through the ": null
    },
    {
        "spontaneous fission": "Spontaneous Fission"
    },
    {
        " of its electron capture daughter ": null
    },
    {
        "fermium-256": "Fermium-256"
    },
    {
        ", but in the presence of other nuclides that undergo spontaneous fission, alpha decays at the characteristic energies for mendelevium-256  can provide more useful identification.       The lightest mendelevium isotopes are mostly produced through bombardment of ": null
    },
    {
        "bismuth": "Bismuth"
    },
    {
        " targets with heavy ": null
    },
    {
        "argon": "Argon"
    },
    {
        " ions, while slightly heavier ones are produced by bombarding ": null
    },
    {
        "plutonium": "Plutonium"
    },
    {
        " and ": null
    },
    {
        "americium": "Americium"
    },
    {
        " targets with lighter ions of ": null
    },
    {
        "carbon": "Carbon"
    },
    {
        " and ": null
    },
    {
        "nitrogen": "Nitrogen"
    },
    {
        ". The most important and most stable isotopes are in the range from 254 Md to 258 Md and are produced through bombardment of ": null
    },
    {
        "einsteinium": "Einsteinium"
    },
    {
        " isotopes with alpha particles: einsteinium-253, -254, and -255 can all be used. 259 Md is produced as a ": null
    },
    {
        "daughter": "Decay Product"
    },
    {
        " of 259 ": null
    },
    {
        "No": "Nobelium"
    },
    {
        ", and 260 Md can be produced in a ": null
    },
    {
        "transfer reaction": "Nuclear Reactiontransfer Reactions"
    },
    {
        " between einsteinium-254 and ": null
    },
    {
        "oxygen-18": "Oxygen-18"
    },
    {
        ". Typically, the most commonly used isotope 256 Md is produced by bombarding either einsteinium-253 or -254 with alpha particles: einsteinium-254 is preferred when available because it has a longer half-life and therefore can be used as a target for longer. Using available microgram quantities of einsteinium, ": null
    },
    {
        "femtogram": "Femtogram"
    },
    {
        " quantities of mendelevium-256 may be produced.     The recoil ": null
    },
    {
        "momentum": "Momentum"
    },
    {
        " of the produced mendelevium-256 atoms is used to bring them physically far away from the einsteinium target from which they are produced, bringing them onto a thin foil of metal  just behind the target in a vacuum. Silva, pp. 1631–3 This eliminates the need for immediate chemical separation, which is both costly and prevents reusing of the expensive einsteinium target. The mendelevium atoms are then trapped in a gas atmosphere , and a gas jet from a small opening in the reaction chamber carries the mendelevium along. Using a long ": null
    },
    {
        "capillary tube": "Capillary Tube"
    },
    {
        ", and including ": null
    },
    {
        "potassium chloride": "Potassium Chloride"
    },
    {
        " aerosols in the helium gas, the mendelevium atoms can be transported over tens of ": null
    },
    {
        "meters": "Meter"
    },
    {
        "to be chemically analyzed and have their quantity determined. The mendelevium can then be separated from the foil material and other ": null
    },
    {
        "fission products": "Fission Product"
    },
    {
        "by applying acid to the foil and then ": null
    },
    {
        "coprecipitating": "Coprecipitation"
    },
    {
        " the mendelevium with ": null
    },
    {
        "lanthanum fluoride": "Lanthanum Fluoride"
    },
    {
        ", then using a ": null
    },
    {
        "cation-exchange": "Cation-Exchange"
    },
    {
        " resin column with a 10% ": null
    },
    {
        "ethanol": "Ethanol"
    },
    {
        " solution saturated with ": null
    },
    {
        "hydrochloric acid": "Hydrochloric Acid"
    },
    {
        ", acting as an ": null
    },
    {
        "eluant": "Eluant"
    },
    {
        ". However, if the foil is made of gold and thin enough, it is enough to simply dissolve the gold in ": null
    },
    {
        "aqua regia": "Aqua Regia"
    },
    {
        " before separating the trivalent actinides from the gold using ": null
    },
    {
        "anion-exchange": "Anion-Exchange"
    },
    {
        " chromatography": "Chromatography"
    },
    {
        ", the eluant being 6  M  hydrochloric acid.     Mendelevium can finally be separated from the other trivalent actinides using selective elution from a cation-exchange resin column, the eluant being ammonia α-HIB. Using the gas-jet method often renders the first two steps unnecessary. The above procedure is the most commonly used one for the separation of transeinsteinium elements.     Another possible way to separate the trivalent actinides is via solvent extraction chromatography using bis- phosphoric acid as the stationary organic phase and ": null
    },
    {
        "nitric acid": "Nitric Acid"
    },
    {
        " as the mobile aqueous phase. The actinide elution sequence is reversed from that of the cation-exchange resin column, so that the heavier actinides elute later. The mendelevium separated by this method has the advantage of being free of organic complexing agent compared to the resin column; the disadvantage is that mendelevium then elutes very late in the elution sequence, after fermium.     Another method to isolate mendelevium exploits the distinct elution properties of Md 2+ from those of Es 3+ and Fm 3+ . The initial steps are the same as above, and employs HDEHP for extraction chromatography, but coprecipitates the mendelevium with terbium fluoride instead of lanthanum fluoride. Then, 50  mg of ": null
    },
    {
        "chromium": "Chromium"
    },
    {
        " is added to the mendelevium to reduce it to the +2 state in 0.1  M  hydrochloric acid with ": null
    },
    {
        "zinc": "Zinc"
    },
    {
        " or ": null
    },
    {
        "mercury": "Mercury"
    },
    {
        ". The solvent extraction then proceeds, and while the trivalent and tetravalent lanthanides and actinides remain on the column, mendelevium does not and stays in the hydrochloric acid. It is then reoxidized to the +3 state using ": null
    },
    {
        "hydrogen peroxide": "Hydrogen Peroxide"
    },
    {
        " and then isolated by selective elution with 2  M  hydrochloric acid and finally 6  M  hydrochloric acid . It is also possible to use a column of cationite and zinc amalgam, using 1  M  hydrochloric acid as an eluant, reducing Md to Md where it behaves like the ": null
    },
    {
        "alkaline earth metals": "Alkaline Earth Metals"
    },
    {
        ". Thermochromatographic chemical isolation could be achieved using the volatile mendelevium ": null
    },
    {
        "hexafluoroacetylacetonate": "Hexafluoroacetylacetonate"
    },
    {
        "International Commission on Radiological Protection": "International Commission On Radiological Protection"
    },
    {
        " has set annual exposure limits for the most stable isotope. For mendelevium-258, the ingestion limit was set at 9×10 5 ": null
    },
    {
        "becquerels": "Becquerel"
    },
    {
        ", and the inhalation limit at 6000 Bq. ": null
    }
]