[
    {
        "   Michel Tremblay, ": null
    },
    {
        "CQ": "National Order Of Quebec"
    },
    {
        " is a ": null
    },
    {
        "French Canadian": "French Canadian"
    },
    {
        " novelist": "Novelist"
    },
    {
        " and ": null
    },
    {
        "playwright": "Theatre"
    },
    {
        ".     He was born in ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ", ": null
    },
    {
        "Quebec": "Quebec"
    },
    {
        ", where he grew up in the ": null
    },
    {
        "French-speaking": "French Language"
    },
    {
        " neighbourhood of ": null
    },
    {
        "Plateau Mont-Royal": "The Plateau"
    },
    {
        "; at the time of his birth a neighbourhood with a working-class character and ": null
    },
    {
        "joual": "Joual"
    },
    {
        " dialect - something that would heavily influence his work. Tremblays first professionally produced play,  Les Belles-Sœurs , was written in 1965 and premiered at the Théâtre du Rideau Vert on August 28, 1968. It transformed the old guard of Canadian theatre and introduced ": null
    },
    {
        "joual": "Joual"
    },
    {
        " to the mainstream. It stirred up controversy by portraying the lives of working class women and attacking the strait-laced, deeply religious society of mid-20th century Quebec.       The most profound and lasting effects of Tremblays early plays, including Hosanna and La Duchesse de Langeais, were the barriers they toppled in Quebec society.  Until the ": null
    },
    {
        "Quiet Revolution": "Quiet Revolution"
    },
    {
        " of the early 1960s, Tremblay saw Quebec as a poor, working-class province dominated by an ": null
    },
    {
        "English-speaking": "English Language"
    },
    {
        " elite and the ": null
    },
    {
        "Roman Catholic Church": "Roman Catholic Church"
    },
    {
        ". Tremblays work was part of a vanguard of liberal, nationalist thought that helped create an essentially modern society. His most famous plays are usually centered on homosexual characters. The women are usually strong but possessed with demons they must vanquish. It is said he sees Quebec as a matriarchal society. He is considered one of the best playwrights for women. In the late 1980s,  Les Belles-soeurs  was produced in Scotland in ": null
    },
    {
        "Scots": "Scots Language"
    },
    {
        ", as The Guid-Sisters . His work has been translated into many languages, including ": null
    },
    {
        "Yiddish": "Yiddish"
    },
    {
        ", and including such works as Sainte-Carmen de la Main, Çta ton tour, Laura Cadieux, and Forever Yours, Marilou .     He has been ": null
    },
    {
        "openly": "Coming Out"
    },
    {
        " gay": "Gay"
    },
    {
        " throughout his public life, and he has written many novels  and plays  centred on gay characters.  In a 1987 interview with ": null
    },
    {
        "Shelagh Rogers": "Shelagh Rogers"
    },
    {
        " for ": null
    },
    {
        "CBC Radios": "Cbc Radio"
    },
    {
        " The Arts Tonight, he remarked that he has always avoided behaviours he has considered masculine; for example, he does not smoke and he noted that he was 45 years old and did not know how to drive a car. I think I am a rare breed, he said, A homosexual who doesnt like men. He claims one of his biggest regrets in life was not telling his mother that he was gay, before she died.     His latest play to receive wide acclaim is  For the Pleasure of Seeing Her Again , a funny and nostalgic play, centered on the memories of his mother. He later published the Plateau Mont-Royal Chronicles, a cycle of six novels including  The Fat Woman Next Door is Pregnant   and  The Duchess and the Commoner  . The second novel of this series,  Therese and Pierrette and the Little Hanging Angel  , was one of the novels chosen for inclusion in the French version of  Canada Reads , Le combat des livres, broadcast on ": null
    },
    {
        "Radio-Canada": "Canadian Broadcasting Corporation"
    },
    {
        " in 2005, where it was championed by ": null
    },
    {
        "union activist": "Trade Union"
    },
    {
        " Monique Simard": "Monique Simard"
    },
    {
        ".     Tremblay worked also on a television series entitled Le Cœur découvert , about the lives of a gay couple in Quebec, for the French-language TV network Radio-Canada. In 2005 he completed another novel cycle, the Cahiers , dealing with the changes that occurred in 1960s Montreal during the Quiet Revolution. In 2009 The Fat Woman Next Door was a finalist in CBCs prestigious Canada Reads competition.       For many years, Tremblay has believed that the only reasonable solution for Quebec is to separate from Canada. Once the ": null
    },
    {
        "Parti Québécois": "Parti Québécois"
    },
    {
        " was elected in Quebec, he softened his views on allowing his plays to be produced in English there. He made it clear, however, that that did not mean that he agreed with ": null
    },
    {
        "bilingualism": "Bilingualism In Canada"
    },
    {
        ", calling it stupid and stating that he thought it ridiculous to expect a housewife in Vancouver to be fluent in both English and French.   CBC  March 28, 1978     Despite his often outspoken views in public, Tremblays treatment of politics in his plays is subtle. Speaking of politics and the theatre in an ": null
    },
    {
        "CBC": "Canadian Broadcasting Corporation"
    },
    {
        " interview in 1978, Tremblay said:   I know what I want in the theatre. I want a real political theatre, but I know that political theatre is dull. I write fables.     In April 2006 he declared that he did not support the arguments put forward for the separation of Quebec. But he clarified his thoughts some time later by saying he was still a supporter of ": null
    },
    {
        "Quebec sovereignty": "Quebec Sovereignty Movement"
    },
    {
        ", though critical of the actual state of the debate, which in his opinion was too much focused on economic issues. In response to this, the columnist Marc Cassivi of  La Presse  wrote that there was only one closet a Quebec artist could never exit and that was the federalist one. ,  The Globe and Mail , April 15, 2006       Tremblay has received numerous awards in recognition of his work. These include the Prix Victor-Morin , the Prix France-Québec , the ": null
    },
    {
        "Chalmers Award": "Floyd S. Chalmers Canadian Play Awards"
    },
    {
        " and the ": null
    },
    {
        "Molson Prize": "Molson Prize"
    },
    {
        " .     He received the Lieutenant-Governors award for Ontario in 1976 and 1977. Tremblay was named the Montréalais le plus remarquable des deux dernières décennies dans le domaine du théâtre . In 1991 he was appointed Officier de lOrdre de France, and in the same year, Chevalier de lOrdre National du Québec . He is also a recipient of the Chevalier de lOrdre des Arts et des Lettres de France .     In 1999, Tremblay received a ": null
    },
    {
        "Governor Generals Performing Arts Award": "Governor Generals Performing Arts Award"
    },
    {
        ", Canadas highest honour in the performing arts.  This produced controversy when several well-known Quebec nationalists suggested that he should refuse the award. While he did not do this, he did admit, for the first time, that he had refused the ": null
    },
    {
        "Order of Canada": "Order Of Canada"
    },
    {
        " in 1990.     In 2000, Encore une fois, si vous le permettez  won a Chalmers Award and a ": null
    },
    {
        "Dora Mavor Moore Award": "Dora Mavor Moore Award"
    },
    {
        ".  Canadian Theatre Encyclopedia 2005-02-04           Note: Most titles also available in English translations  Contes pour buveurs attardés      La Cité dans lœuf      Ctà ton tour, Laura Cadieux      Le Cœur découvert      Les Vues animées      Douze coups de théâtre: récits      Le Cœur éclaté      Un ange cornu avec des ailes de tôle     La nuit des princes charmants      Le Fantôme de Don Carlos      Quarante-quatre minutes, quarante-quatre secondes      Hôtel Bristol New York, N.Y      LHomme qui entendait siffler une bouilloire      Bonbons assortis      Le Trou dans le mur      La Traversée du continent      La Traversée de la ville      La Traversée des sentiments      Le passage obligé     La grande mêlée     Au hazard la chance     Les clefs du Paradise    Chroniques du Plateau Mont-Royal, series of six novels:   : La grosse femme dà côté est enceinte     : Thérèse et Pierrette à lécole des Saints-Anges     : La Duchesse et le roturier     : Des nouvelles dÉdouard     : Le Premier Quartier de la lune     : Un objet de beauté     The Notebook Trilogy:   : Le Cahier noir     : Le Cahier rouge     : Le Cahier bleu         Note: Most titles also available in English translations   Le Train, 1964.   En pièces détachées, 1970.   Trois petits tourts, 1971.    À toi, pour toujours, ta Marie-Lou      Les Belles-Sœurs , 1968.   Demain matin, Montréal mattend, 1972.    Hosanna  et La Duchesse de Langeais, 1973.    Bonjour, là, bonjour, 1974.    Les Héros de mon enfance, 1976.   Sainte Carmen de la Main et Surprise ! Surprise !, 1976  Damnée Manon, sacrée Sandra, 1977.    LImpromptu dOutremont, 1980.    Les Anciennes Odeurs, 1981.    Albertine en cinq temps , 1984    Le Gars de Québec: daprès le Revizor de Gogol, 1985.    Le Vrai Monde ? , 1987.    Nelligan, 1990.   La Maison suspendue, 1990.    Marcel poursuivi par les chiens, 1992.    En circuit fermé, 1994.   Messe solennelle pour une pleine lune dété, 1996.   Encore une fois si vous permettez, 1998    LÉtat des lieux, 2002.   Impératif présent, 2003.   Bonbons assortis au théâtre, 2006    Le Paradis à la fin de vos jours, 2008   Fragments de mensonges inutiles, 2009   LOratorio de Noël, 2012       Françoise Durocher, waitress   ": null
    },
    {
        "Il était une fois dans lest": "Il Était Une Fois Dans Lest"
    },
    {
        "   Parlez-nous damour": "Parlez-Nous Damour"
    },
    {
        "   Le Soleil se lève en retard": "Le Soleil Se Lève En Retard"
    },
    {
        "   Ctà ton tour, Laura Cadieux": "Ctà Ton Tour, Laura Cadieux"
    },
    {
        "       Tremblay, Michel. . Birth of a Bookworm. Translated by Sheila Fischman. Talonbooks: Vancouver, BC. .   Tremblay, Michel. . Bambi and Me. Translated by Sheila Fischman. Talonbooks: Vancouver, BC. .   Renate Usmiani, Michel Tremblay. Douglas and McIntyre, 1982,  Cahiers de Théâtre JEU/Éditions Lansman, 1993.   ": null
    },
    {
        "Craig Walker": "Craig Walker"
    },
    {
        ", Michel Tremblay: Existential Mythopoeia, The Buried Astrolabe: Canadian Dramatic Imagination and Western Tradition. McGill-Queens UP, 2001,  , ": null
    }
]