[
    {
        "            John Michael Crichton  was an American author, screenwriter, and film director and producer best known for his work in the ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        ", ": null
    },
    {
        "thriller": "Thriller"
    },
    {
        ", and ": null
    },
    {
        "medical fiction": "Medical Fiction"
    },
    {
        " genres. His books have sold over 200 million copies worldwide, and over a dozen have been adapted into films.   His literary works are usually within the ": null
    },
    {
        "action genre": "Action Action Genre"
    },
    {
        " and heavily feature technology. His novels epitomize the ": null
    },
    {
        "techno-thriller": "Techno-Thriller"
    },
    {
        " genre of literature, often exploring technology and failures of human interaction with it, especially resulting in catastrophes with ": null
    },
    {
        "biotechnology": "Biotechnology"
    },
    {
        ". Many of his novels have medical or scientific underpinnings, reflecting his medical training and scientific background. He wrote, among other works,  The Andromeda Strain  ,  The Great Train Robbery  ,  Congo  ,  Sphere  ,  Jurassic Park  ,  Rising Sun  ,  Disclosure  ,  The Lost World  ,  Airframe  ,  Timeline  ,  Prey  ,  State of Fear  , and  Next  . Films he wrote and directed included  Westworld  ,  Coma  ,  The Great Train Robbery  ,  Looker  , and  Runaway  .       John Michael Crichton  was born on October 23, 1942, in Chicago, Illinois,   . ": null
    },
    {
        "IGN": "Ign"
    },
    {
        ". May 19, 2003.  to John Henderson Crichton, a journalist, and Zula Miller Crichton. He was raised on ": null
    },
    {
        "Long Island": "Long Island"
    },
    {
        ", in ": null
    },
    {
        "Roslyn, New York": "Roslyn, New York"
    },
    {
        ", and showed a keen interest in writing from a young age; at 14, he had an article about a trip he took to ": null
    },
    {
        "Sunset Crater": "Sunset Crater"
    },
    {
        " published in The New York Times.  CLIMBING UP A CINDER CONE: A Visit to Sunset Crater Makes A Novel Side Trip in Arizona   By MICHAEL CRICHTON. New York Times 17 May 1959: XX30.     Crichton later recalled, Roslyn was another world. Looking back, its remarkable what wasnt going on. There was no terror. No fear of children being abused. No fear of random murder. No drug use we knew about. I walked to school. I rode my bike for miles and miles, to the movie on Main Street and piano lessons and the like. Kids had freedom. It wasnt such a dangerous world... We studied our butts off, and we got a tremendously good education there. BIG MIKE MICHAEL CRICHTON WAS EASILY SPOTTED IN A ROSLYN HIGH CROWD By David Behrens Newsday 10 Oct 1995: B.04.       Crichton had always planned on becoming a writer and began his studies at ": null
    },
    {
        "Harvard College": "Harvard College"
    },
    {
        " in 1960. During his undergraduate study in literature, he conducted an experiment to expose a professor who he believed was giving him abnormally low marks and criticizing his literary style.  Informing another professor of his suspicions,  Crichton submitted an essay by ": null
    },
    {
        "George Orwell": "George Orwell"
    },
    {
        " under his own name. The paper was returned by his unwitting professor with a mark of B− .      He later said, Now Orwell was a wonderful writer, and if a B-minus was all he could get, I thought Id better drop English as my major.     His issues with the English department led Crichton to switch his undergraduate concentration; he obtained his bachelors degree in ": null
    },
    {
        "biological anthropology": "Biological Anthropology"
    },
    {
        "  summa cum laude  in 1964  and was initiated into the ": null
    },
    {
        "Phi Beta Kappa Society": "Phi Beta Kappa Society"
    },
    {
        ". He received a Henry Russell Shaw Traveling Fellowship from 1964 to 1965 and was a visiting lecturer in ": null
    },
    {
        "Anthropology": "Anthropology"
    },
    {
        " at the ": null
    },
    {
        "University of Cambridge": "University Of Cambridge"
    },
    {
        " in the United Kingdom in 1965.     Crichton later enrolled at ": null
    },
    {
        "Harvard Medical School": "Harvard Medical School"
    },
    {
        ".  By this time, he had become exceptionally tall; by his own account, he was approximately  tall in 1997.       Crichton later said about two weeks into medical school I realised I hated it. This isnt unusual since everyone hates medical school - even happy, practising physicians.         In 1965, while at medical school, Crichton wrote a novel,  Odds On . I wrote for furniture and groceries, he said later.      Odds On is a 215-page paperback novel which describes an attempted robbery in an isolated hotel on ": null
    },
    {
        "Costa Brava": "Costa Brava"
    },
    {
        ". The robbery is planned scientifically with the help of a ": null
    },
    {
        "critical path analysis": "Critical Path Method"
    },
    {
        " computer program, but unforeseen events get in the way.     Crichton submitted it to Doubleday, where a reader liked it but did not feel it was for that company; they passed it on to New American Library, who published it in 1966. Crichton used the pen name John Lange, because at that stage he planned to become a doctor and did not want his patients to worry he would use them for his plots. The name came from a fairy tale writer called ": null
    },
    {
        "Andrew Lang": "Andrew Lang"
    },
    {
        "; Crichton added an e to the surname and substituted his own real first name, John, for Andrew. The novel was successful enough to lead to a series of John Lange novels.       The second Lange novel,  Scratch One  , relates the story of Roger Carr, a handsome, charming, privileged man who practices law, more as a means to support his playboy lifestyle than a career. Carr is sent to ": null
    },
    {
        "Nice, France": "Nice, France"
    },
    {
        ", where he has notable political connections, but is mistaken for an assassin and finds his life in jeopardy, implicated in the world of terrorism. Crichton wrote the book while traveling through Europe on a travel fellowship. He visited the ": null
    },
    {
        "Cannes Film Festival": "Cannes Film Festival"
    },
    {
        " and ": null
    },
    {
        "Monaco Grand Prix": "Monaco Grand Prix"
    },
    {
        ", and then decided, any idiot should be able to write a ": null
    },
    {
        "potboiler": "Potboiler"
    },
    {
        " set in Cannes and Monaco , and wrote it in eleven days. He later described the book as no good .     His third John Lange novel,  Easy Go  , is the story of Harold Barnaby, a brilliant ": null
    },
    {
        "Egyptologist": "Egyptologist"
    },
    {
        " who discovers a concealed message while translating ": null
    },
    {
        "hieroglyphics": "Hieroglyphics"
    },
    {
        " informing him of an unnamed pharaoh whose tomb is yet to be discovered. Crichton later said the book earned him $1,500.      Crichton later said, My feeling about the Lange books is that my competition is in-flight movies. One can read the books in an hour and a half, and be more satisfactorily amused than watching ": null
    },
    {
        "Doris Day": "Doris Day"
    },
    {
        ". I write them fast and the reader reads them fast and I get things off my back.       A Case of Need A Case of Need  , a medical thriller in which a Boston pathologist, Dr. John Berry, investigates an apparent illegal abortion conducted by an obstetrician friend, which caused the early demise of a young woman. The novel had a different tone to the Lange books; accordingly, Crichton used the pen name Jeffrey Hudson , based on Sir ": null
    },
    {
        "Jeffrey Hudson": "Jeffrey Hudson"
    },
    {
        ", a famous 17th-century dwarf in the court of ": null
    },
    {
        "Queen consort": "Queen Consort"
    },
    {
        " Henrietta Maria": "Henrietta Maria Of France"
    },
    {
        " of Englandit would be turned into  The Carey Treatment .1969as J. Michael Crichton1969": null
    },
    {
        "ranorm": "Ranorm"
    },
    {
        "booknovel1972novel1972 TV film1972filmCGIfilm1973novel1978 film": null
    },
    {
        "veli": "Veli"
    },
    {
        "19781923-Current File1981video gameeverybody isfor ": null
    },
    {
        "Apple II": "Apple Ii"
    },
    {
        "for ": null
    },
    {
        "IBM PC": "Ibm Pc"
    },
    {
        " compatibles1984 film1984novel": null
    },
    {
        "98 fi": "98 Fi"
    },
    {
        "1989filmnovel": null
    },
    {
        "rassic Park charact": "Rassic Park Charact"
    },
    {
        "TV series": null
    },
    {
        "it": "It"
    },
    {
        "1997filmnovelnovelTV serieshe insisted on ": null
    },
    {
        "Julianna Margulies": "Julianna Margulies"
    },
    {
        " becoming a regular, for example": null
    },
    {
        " produc": "Produc"
    },
    {
        "Crichton novelnovel1996 film1996novel": null
    },
    {
        "03 fi": "03 Fi"
    },
    {
        "noveland by extension, ": null
    },
    {
        "complexity": "Complexity"
    },
    {
        "journalnovelnovel": null
    },
    {
        "themati": "Themati"
    },
    {
        " Jurassic Park  The Andromeda Strain  Airframe  Westworld novelvideo game": null
    },
    {
        "mputer scienti": "Mputer Scienti"
    },
    {
        "video game         57% vs. 30%, with 13% undecided46% vs. 42%, with 12% undecidedvery popular, even among the private jet-flying Eastsiders presentnot so sure about LindzennovelJurassic Park, The Lost World, Next, Congo1969, p.  3journal": null
    },
    {
        "urnali": "Urnali"
    },
    {
        "novel": null
    },
    {
        "erican magazi": "Erican Magazi"
    },
    {
        "The Writer Guild list the award for 1996TV series TV series 6  ft 9 in, or 206  cmAmerican magazine1965–19701978–19801981–19831987–2003born 19892005–2008": null
    },
    {
        "ited Stat": "Ited Stat"
    },
    {
        "19851978 film2d Cir. 19961996 film1996published posthumously on November 26, 2009novelnovelpublished posthumously in 2011": null
    }
]