[
    {
        "           A minute of arc, arcminute , arc minute, or minute arc is a unit of ": null
    },
    {
        "angular": "Angular Unit"
    },
    {
        " measurement equal to  of one ": null
    },
    {
        "degree": "Degree"
    },
    {
        ". Since one degree is  of a ": null
    },
    {
        "turn": "Turn"
    },
    {
        " , one minute of arc is  of a turn. The ": null
    },
    {
        "nautical mile": "Nautical Miles"
    },
    {
        " was originally defined as a minute of latitude on a hypothetical spherical Earth so the actual Earth circumference is very near 21 600 nautical miles. A minute of arc is  of a ": null
    },
    {
        "radian": "Radian"
    },
    {
        ".     A second of arc, arcsecond , or arc second is  of an arcminute,  of a degree,  of a turn, and   of a radian.     These units originated in ": null
    },
    {
        "Babylonian astronomy": "Babylonian Astronomy"
    },
    {
        " as ": null
    },
    {
        "sexagesimal": "Sexagesimal"
    },
    {
        " subdivisions of the degree; they are used in fields that involve very small angles, such as ": null
    },
    {
        "astronomy": "Astronomy"
    },
    {
        ", ": null
    },
    {
        "optometry": "Optometry"
    },
    {
        ", ": null
    },
    {
        "ophthalmology": "Ophthalmology"
    },
    {
        ", ": null
    },
    {
        "optics": "Optics"
    },
    {
        ", ": null
    },
    {
        "navigation": "Navigation"
    },
    {
        ", ": null
    },
    {
        "land surveying": "Land Surveying"
    },
    {
        ", and ": null
    },
    {
        "marksmanship": "Marksmanship"
    },
    {
        ".     To express even smaller angles, standard ": null
    },
    {
        "SI prefix": "Si Prefix"
    },
    {
        "es can be employed; the milliarcsecond and microarcsecond , for instance, are commonly used in astronomy.     The number of square arcminutes in a complete sphere is 4          square arcminutes .     The names minute and second have nothing to do with the identically named units of time ": null
    },
    {
        "minute": "Minute"
    },
    {
        " or ": null
    },
    {
        "second": "Second"
    },
    {
        " . The identical names reflect the ancient ": null
    },
    {
        "Babylonian number system": "Babylonian Number System"
    },
    {
        ", based on the number 60. Volume Library Vol. 1, Southwestern       The standard  symbol for marking the arcminute is the ": null
    },
    {
        "prime": "Prime"
    },
    {
        " , though a single quote is commonly used where only ": null
    },
    {
        "ASCII": "Ascii"
    },
    {
        " characters are permitted. One arcminute is thus written 1′. It is also abbreviated as arcmin or amin or, less commonly, the prime with a ": null
    },
    {
        "circumflex": "Circumflex"
    },
    {
        " over it .     The standard symbol for the arcsecond is the ": null
    },
    {
        "double prime": "Double Prime"
    },
    {
        " , though a double quote is commonly used where only ": null
    },
    {
        "ASCII": "Ascii"
    },
    {
        " characters are permitted. One arcsecond is thus written 1″. It is also abbreviated as arcsec or asec.          In ": null
    },
    {
        "celestial navigation": "Celestial Navigation"
    },
    {
        ", seconds of arc are rarely used in calculations, the preference usually being for degrees, minutes and decimals of a minute, for example, written as 42° 25.32′ or 42° 25.322′.   This notation has been carried over into ": null
    },
    {
        "marine GPS": "Global Positioning System"
    },
    {
        " receivers, which normally display latitude and longitude in the latter format by default.          The full ": null
    },
    {
        "moons": "Moon"
    },
    {
        " average ": null
    },
    {
        "apparent size": "Angular Diameter"
    },
    {
        " is about 31 arcminutes .     An arcminute is approximately the ": null
    },
    {
        "resolution of the human eye": "Visual Acuity"
    },
    {
        ".     An arcsecond is approximately the ": null
    },
    {
        "angle subtended": "Subtended Angle"
    },
    {
        " by a ": null
    },
    {
        "U.S. dime coin": "Dime"
    },
    {
        " at a distance of . ": null
    },
    {
        "Filippenko, Alex": "Alexei Filippenko"
    },
    {
        ", Understanding the Universe , Lecture 43, time 12:05, The Teaching Company, Chantilly, VA, USA, 2007. An arcsecond is also the angle subtended by   an object of diameter  at a distance of one ": null
    },
    {
        "astronomical unit": "Astronomical Unit"
    },
    {
        ",   an object of diameter  at one ": null
    },
    {
        "light-year": "Light-Year"
    },
    {
        ",   an object of diameter one astronomical unit  at a distance of one ": null
    },
    {
        "parsec": "Parsec"
    },
    {
        ", by definition.     A milliarcsecond is about the size of a dime atop the ": null
    },
    {
        "Eiffel Tower": "Eiffel Tower"
    },
    {
        " as seen from ": null
    },
    {
        "New York City": "New York City"
    },
    {
        ".     A microarcsecond is about the size of a period at the end of a sentence in the Apollo mission manuals left on the Moon as seen from Earth.     A nanoarcsecond is about the size of a penny on ": null
    },
    {
        "Neptunes": "Neptune"
    },
    {
        " moon ": null
    },
    {
        "Triton": "Triton"
    },
    {
        " as observed from Earth.     Also notable examples of size in arcseconds are:   ": null
    },
    {
        "Hubble Space Telescope": "Hubble Space Telescope"
    },
    {
        " has calculational resolution of 0.05 arcseconds and actual resolution of almost 0.1 arcseconds, which is close to the ": null
    },
    {
        "diffraction limit": "Diffraction Limit"
    },
    {
        ".    crescent ": null
    },
    {
        "Venus": "Venus"
    },
    {
        " measures between 60.2 and 66 seconds of arc.                Since antiquity the arcminute and arcsecond have been used in ": null
    },
    {
        "astronomy": "Astronomy"
    },
    {
        ". In the ": null
    },
    {
        "ecliptic coordinate system": "Ecliptic Coordinate System"
    },
    {
        ", latitude and longitude ; in the ": null
    },
    {
        "horizon system": "Horizontal Coordinate System"
    },
    {
        ", altitude and ": null
    },
    {
        "azimuth": "Azimuth"
    },
    {
        " ; and in the ": null
    },
    {
        "equatorial coordinate system": "Equatorial Coordinate System"
    },
    {
        ", ": null
    },
    {
        "declination": "Declination"
    },
    {
        " , are all measured in degrees, arcminutes and arcseconds. The principal exception is ": null
    },
    {
        "right ascension": "Right Ascension"
    },
    {
        " in equatorial coordinates, which is measured in time units of hours, minutes, and seconds.     The arcsecond is also often used to describe small astronomical angles such as the angular diameters of planets , the ": null
    },
    {
        "proper motion": "Proper Motion"
    },
    {
        " of stars, the separation of components of ": null
    },
    {
        "binary star systems": "Binary Star System"
    },
    {
        ", and ": null
    },
    {
        "parallax": "Parallax"
    },
    {
        ", the small change of position of a star in the course of a year or of a solar system body as the Earth rotates. These small angles may also be written in milliarcseconds , or thousandths of an arcsecond. The unit of distance, the ": null
    },
    {
        "parsec": "Parsec"
    },
    {
        ", named from the parallax of one arc second, was developed for such parallax measurements. It is the distance at which the mean radius of the Earths orbit would subtend an angle of one arcsecond.     The ESA ": null
    },
    {
        "astrometric": "Astrometry"
    },
    {
        " satellite ": null
    },
    {
        "Gaia": "Gaia Mission"
    },
    {
        ", launched in 2013, can approximate star positions to 7 microarcseconds .      Apart from the Sun, the star with the largest ": null
    },
    {
        "angular diameter": "Angular Diameter"
    },
    {
        " from Earth is ": null
    },
    {
        "R Doradus": "R Doradus"
    },
    {
        ", a ": null
    },
    {
        "red giant": "Red Giant"
    },
    {
        " with a diameter of 0.05 arcsecond. Because of the effects of atmospheric ": null
    },
    {
        "seeing": "Astronomical Seeing"
    },
    {
        ", ground-based ": null
    },
    {
        "telescopes": "Telescope"
    },
    {
        " will smear the image of a star to an angular diameter of about 0.5 arcsecond; in poor seeing conditions this increases to 1.5 arcseconds or even more. The dwarf planet ": null
    },
    {
        "Pluto": "Pluto"
    },
    {
        " has proven difficult to resolve because its ": null
    },
    {
        "angular diameter": "Angular Diameter"
    },
    {
        " is about 0.1 arcsecond.  Pluto Fact Sheet      Space telescopes are not affected by the Earths atmosphere but are ": null
    },
    {
        "diffraction limited": "Diffraction Limitdiffraction Limit Of Telescopes"
    },
    {
        ". For example, the ": null
    },
    {
        "Hubble Space Telescope": "Hubble Space Telescope"
    },
    {
        " can reach an angular size of stars down to about 0.1″. Techniques exist for improving seeing on the ground. ": null
    },
    {
        "Adaptive optics": "Adaptive Optics"
    },
    {
        ", for example, can produce images around 0.05 arcsecond on a 10  m class telescope.         Minutes and seconds of arc are also used in ": null
    },
    {
        "cartography": "Cartography"
    },
    {
        " and ": null
    },
    {
        "navigation": "Navigation"
    },
    {
        ". At ": null
    },
    {
        "sea level": "Sea Level"
    },
    {
        " one minute of arc along the ": null
    },
    {
        "equator": "Equator"
    },
    {
        " or a ": null
    },
    {
        "meridian": "Meridian"
    },
    {
        "  equals exactly one ": null
    },
    {
        "geographical mile": "Geographical Mile"
    },
    {
        " along the Earths equator or approximately .  A second of arc, one sixtieth of this amount, is roughly . The exact distance varies along ": null
    },
    {
        "meridian arcs": "Meridian Arc"
    },
    {
        " because the ": null
    },
    {
        "figure of the Earth": "Figure Of The Earth"
    },
    {
        " is slightly ": null
    },
    {
        "oblate": "Oblate Spheroid"
    },
    {
        " .     Positions are traditionally given using degrees, minutes, and seconds of arcs for ": null
    },
    {
        "latitude": "Latitude"
    },
    {
        ", the arc north or south of the equator, and for ": null
    },
    {
        "longitude": "Longitude"
    },
    {
        ", the arc east or west of the ": null
    },
    {
        "Prime Meridian": "Prime Meridian"
    },
    {
        ". Any position on or above the Earths ": null
    },
    {
        "reference ellipsoid": "Reference Ellipsoid"
    },
    {
        " can be precisely given with this method. However, when it is inconvenient to use ": null
    },
    {
        "base": "Radix"
    },
    {
        "-60 for minutes and seconds, positions are frequently expressed as decimal fractional degrees to an equal amount of precision. Degrees given to three decimal places  have about  the precision of degrees-minutes-seconds  and specify locations within about .         Related to cartography, property boundary ": null
    },
    {
        "surveying": "Surveying"
    },
    {
        " using the ": null
    },
    {
        "metes and bounds": "Metes And Bounds"
    },
    {
        " system relies on fractions of a degree to describe property lines angles in reference to ": null
    },
    {
        "cardinal directions": "Cardinal Direction"
    },
    {
        ". A boundary mete is described with a beginning reference point, the cardinal direction North or South followed by an angle less than 90 degrees and a second cardinal direction, and a linear distance. The boundary runs the specified linear distance from the beginning point, the direction of the distance being determined by rotating the first cardinal direction the specified angle toward the second cardinal direction. For example, North  65°  39′ 18″ West  85.69  feet would describe a line running from the starting point 85.69 feet in a direction 65° 39′ 18″ away from north toward the west.            The arcminute is commonly found in the ": null
    },
    {
        "firearms": "Firearm"
    },
    {
        " industry and literature, particularly concerning the accuracy of ": null
    },
    {
        "rifles": "Rifle"
    },
    {
        ", though the industry refers to it as minute of angle . It is especially popular with shooters familiar with the ": null
    },
    {
        "imperial measurement system": "Imperial Measurement System"
    },
    {
        " because 1  MOA is ": null
    },
    {
        "subtend": "Subtend"
    },
    {
        "ed by a sphere with a diameter of 1.047 ": null
    },
    {
        "inch": "Inch"
    },
    {
        "es at 100 ": null
    },
    {
        "yards": "Yard"
    },
    {
        " , a traditional distance on U.S. ": null
    },
    {
        "target ranges": "Shooting Range"
    },
    {
        ". The subtension is linear with the distance, for example, at 500 yards, 1  MOA is subtended by a sphere with a diameter of 5.235 inches, and at 1000 yards 1  MOA is subtended by a sphere with a diameter of 10.47 inches.   Since many modern ": null
    },
    {
        "telescopic sights": "Telescopic Sight"
    },
    {
        " are adjustable in half , quarter , or eighth  MOA increments, also known as clicks, zeroing and adjustments are made by counting 2, 4 and 8 clicks per MOA respectively.     For example, if the point of impact is 3 inches high and 1.5 inches left of the point of aim at 100 yards , the scope needs to be adjusted 3 MOA down, and 1.5 MOA right. Such adjustments are trivial when the scopes adjustment dials have a MOA scale printed on them, and even figuring the right number of clicks is relatively easy on scopes that click in fractions of MOA. This makes zeroing and adjustments much easier:   To adjust a  MOA scope 3 MOA down and 1.5 MOA right, the scope needs to be adjusted 3 × 2 6 clicks down and 1.5 x 2 3 clicks right   To adjust a  MOA scope 3 MOA down and 1.5 MOA right, the scope needs to be adjusted 3 x 4 12 clicks down and 1.5 × 4 6 clicks right   To adjust a  MOA scope 3 MOA down and 1.5 MOA right, the scope needs to be adjusted 3 x 8 24 clicks down and 1.5 × 8 12 clicks right     Another common system of measurement in firearm scopes is the ": null
    },
    {
        "milliradian": "Milliradian"
    },
    {
        " or mil. Zeroing a mil based scope is easy for users familiar with ": null
    },
    {
        "base ten": "Decimal"
    },
    {
        " systems. The most common adjustment value in mil based scopes is  mil .   To adjust a  mil scope 0.9 mil down and 0.4 mil right, the scope needs to be adjusted 9 clicks down and 4 clicks right .     One thing to be aware of is that some MOA scopes, including some higher-end models, are calibrated such that an adjustment of 1 MOA on the scope knobs corresponds to exactly 1 inch of impact adjustment on a target at 100 yards, rather than the mathematically correct 1.047 . This is commonly known as the Shooters MOA or Inches Per Hundred Yards . While the difference between one true MOA and one SMOA is less than half of an inch even at 1000 yards,  this error compounds significantly on longer range shots that may require adjustment upwards of 20–30 MOA to compensate for the bullet drop. If a shot requires an adjustment of 20 MOA or more, the difference between true MOA and SMOA will add up to 1 inch or more. In competitive target shooting, this might mean the difference between a hit and a miss.     The physical group size equivalent to m minutes of arc can be calculated as follows: group size tan  ×  distance. In the example previously given, for 1 minute of arc, and substituting 3,600  inches for 100 yards, 3,600 tan ≈ 1.047  inches. In ": null
    },
    {
        "metric units": "Metric Units"
    },
    {
        " 1 MOA at 100 metres ≈ 2.908 centimetres.     Sometimes, a precision firearms accuracy will be measured in MOA. This simply means that under ideal conditions i.e. no wind, match-grade ammo, clean barrel, and a vise or a benchrest used to eliminate shooter error, the gun is capable of producing a ": null
    },
    {
        "group of shots": "Shot Grouping"
    },
    {
        " whose center points fit into a circle, the average diameter of circles in several groups can be subtended by that amount of arc. For example, a 1 MOA rifle should be capable, under ideal conditions, of shooting an average 1-inch groups at 100 yards. Most higher-end rifles are warrantied by their manufacturer to shoot under a given MOA threshold with specific ammunition and no error on the shooters part. For example, Remingtons ": null
    },
    {
        "M24 Sniper Weapon System": "M24 Sniper Weapon System"
    },
    {
        " is required to shoot 0.8 MOA or better, or be rejected.     Rifle manufacturers and gun magazines often refer to this capability as sub-MOA, meaning it shoots under 1 MOA. This means that a single group of 3 to 5 shots at 100 yards, or the average of several groups, will measure less than 1 MOA between the two furthest shots in the group, i.e. all shots fall within 1 MOA. If larger samples are taken then group size typically increases, however this will ultimately average out. If a rifle was truly a 1 MOA rifle, it would be just as likely that two consecutive shots land exactly on top of each other as that they land 1 MOA apart. For 5-shot groups, based on 95% ": null
    },
    {
        "confidence": "Confidence Interval"
    },
    {
        ", a rifle that normally shoots 1 MOA can be expected to shoot groups between 0.58 MOA and 1.47 MOA, although the majority of these groups will be under 1 MOA. What this means in practice is if a rifle that shoots 1-inch groups on average at 100 yards shoots a group measuring 0.7 inches followed by a group that is 1.3 inches, this is not statistically abnormal.       The ": null
    },
    {
        "Metric System": "Metric System"
    },
    {
        " counterpart of the MOA is the ": null
    },
    {
        "milliradian": "Milliradian"
    },
    {
        " or mil, being equal to one 1000th of the target range, laid out on a circle that has the observer as centre and the target range as radius. The number of mils on a full such circle therefore always is equal to 2 ×  × 1000, regardless the target range. Therefore, 1 MOA ≈ 0.2908 mil. This means that an object which spans 1 mil on the ": null
    },
    {
        "reticle": "Reticle"
    },
    {
        " is at a range that is in metres equal to the objects size in millimetres . So there is no conversion factor required, contrary to the MOA system. A reticle with markings spaced with a one mil apart are collectively called a mil reticle. If the markings are round they are called mil-dots.     In the table below conversions from mil to metric values are exact , while conversions of minutes of arc to both metric and imperial values are approximate.            ≈ 1.047 inches   1′ ≈ 0.291  mil   1  mil ≈ 3.44′, so   mil ≈ ′   0.1  mil equals exactly 1  cm at 100  m, or approximately 0.36 inches at 100 yards       In humans, ": null
    },
    {
        "20/20 vision": "Normal Vision"
    },
    {
        " is the ability to resolve a ": null
    },
    {
        "spatial pattern": "Spatial Pattern"
    },
    {
        " separated by a ": null
    },
    {
        "visual angle": "Visual Angle"
    },
    {
        " of one minute of arc.   A 20/20 letter subtends 5 minutes of arc total.       The deviation from parallelism between two surfaces, for instance in ": null
    },
    {
        "optical engineering": "Optical Engineering"
    },
    {
        ", is usually measured in arcminutes or arcseconds.   In addition, arcseconds are sometimes used in ": null
    },
    {
        "rocking curve": "Rocking Curve"
    },
    {
        " x ray diffraction": "X Ray Diffraction"
    },
    {
        " measurements of high-quality ": null
    },
    {
        "epitaxial": "Epitaxy"
    },
    {
        " thin films.       Some measurement devices make use of arcminutes and arcseconds to measure angles when the object being measured is too small for direct visual inspection. For instance, a toolmakers ": null
    },
    {
        "optical comparator": "Optical Comparator"
    }
]