[
    {
        "                 Monica Samille Lewinsky is an American activist, television personality, fashion designer, and former ": null
    },
    {
        "White House": "White House"
    },
    {
        " intern. ": null
    },
    {
        "President": "President Of The United States"
    },
    {
        " Bill Clinton": "Bill Clinton"
    },
    {
        " admitted to having had what he called an inappropriate relationship with Lewinsky while she worked at the ": null
    },
    {
        "White House": "White House"
    },
    {
        " in 1995–1996. The affair and its repercussions  became known later as the ": null
    },
    {
        "Clinton–Lewinsky scandal": "Clinton–Lewinsky Scandal"
    },
    {
        ".     As a result of the public coverage of the political scandal, Lewinsky gained international celebrity status. She subsequently engaged in a variety of ventures that included designing a line of handbags under her name, being an advertising spokesperson for a ": null
    },
    {
        "diet": "Dieting"
    },
    {
        " plan, and working as a television personality. Lewinsky later decided to leave the public spotlight to pursue a masters degree in ": null
    },
    {
        "psychology": "Psychology"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        ". In 2014, she returned to public view as a social activist speaking out against ": null
    },
    {
        "cyberbullying": "Cyberbullying"
    },
    {
        ".       Lewinsky was born in ": null
    },
    {
        "San Francisco": "San Francisco"
    },
    {
        ", California, and grew up in an affluent family in ": null
    },
    {
        "Southern California": "Southern California"
    },
    {
        " in the ": null
    },
    {
        "Westside": "Westside"
    },
    {
        " Brentwood": "Brentwood, Los Angeles, California"
    },
    {
        " area of ": null
    },
    {
        "Los Angeles": "Los Angeles"
    },
    {
        " and in ": null
    },
    {
        "Beverly Hills": "Beverly Hills, California"
    },
    {
        ".   Her father is ": null
    },
    {
        "Bernard Lewinsky": "Bernard Lewinsky"
    },
    {
        ", an ": null
    },
    {
        "oncologist": "Oncology"
    },
    {
        ", who is the son of ": null
    },
    {
        "German Jews": "German Jews"
    },
    {
        " who escaped from ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        " and moved to ": null
    },
    {
        "El Salvador": "El Salvador"
    },
    {
        " and then to the United States when he was 14.  Her mother, born Marcia Kay Vilensky, is an author who uses the name Marcia Lewis. In 1996, she wrote her only book, the ": null
    },
    {
        "gossip": "Gossip"
    },
    {
        " biography,  The Private Lives of the Three Tenors . During the Lewinsky scandal, the press compared Lewis unproven hints that she had an affair with opera star ": null
    },
    {
        "Plácido Domingo": "Plácido Domingo"
    },
    {
        " to her daughters sexual relationship with Clinton.     Monicas maternal grandfather, Samuel M. Vilensky, was a ": null
    },
    {
        "Lithuanian Jew": "Lithuanian Jews"
    },
    {
        ", and Monicas maternal grandmother, Bronia Poleshuk, was born in the British Concession of ": null
    },
    {
        "Tianjin": "Tianjin"
    },
    {
        ", ": null
    },
    {
        "China": "China"
    },
    {
        ", to a Russian Jewish family.    Monicas parents acrimonious separation and divorce during 1987 and 1988 had a significant effect on her.  Her father later married his current wife, Barbara; her mother later married ": null
    },
    {
        "R. Peter Straus": "R. Peter Straus"
    },
    {
        ", a media executive and former director of the ": null
    },
    {
        "Voice of America": "Voice Of America"
    },
    {
        " under President ": null
    },
    {
        "Jimmy Carter": "Jimmy Carter"
    },
    {
        ".      The family attended ": null
    },
    {
        "Sinai Temple": "Sinai Temple"
    },
    {
        " in Los Angeles and Monica attended Sinai Akiba Academy, its religious school.  For her primary education she attended the ": null
    },
    {
        "John Thomas Dye School": "John Thomas Dye School"
    },
    {
        " in ": null
    },
    {
        "Bel-Air": "Bel Air, Los Angeles, California"
    },
    {
        ". At Pacific Hills School she won the Outstanding Junior of the Year award.   by Leonard Gill, March 15, 1999. Memphis Flyer book review. Retrieved December 18, 2006. She then attended ": null
    },
    {
        "Beverly Hills High School": "Beverly Hills High School"
    },
    {
        ", but for her senior year transferred to, and graduated from, ": null
    },
    {
        "Bel Air Prep": "Pacific Hills School"
    },
    {
        " in 1991.      Following high school graduation, Lewinsky attended ": null
    },
    {
        "Santa Monica College": "Santa Monica College"
    },
    {
        ", a two-year community college, and worked for the drama department at Beverly Hills High School and at a tie shop. In 1992, she allegedly began a five-year affair with Andy Bleiler, her married former high school drama instructor.  In 1993, she enrolled at ": null
    },
    {
        "Lewis & Clark College": "Lewis  &  Clark College"
    },
    {
        " in ": null
    },
    {
        "Portland, Oregon": "Portland, Oregon"
    },
    {
        ", graduating with a bachelors degree in psychology in 1995.     With the assistance of a family connection, Lewinsky got an unpaid summer ": null
    },
    {
        "White House": "White House"
    },
    {
        " internship in the office of ": null
    },
    {
        "White House Chief of Staff": "White House Chief Of Staff"
    },
    {
        " Leon Panetta": "Leon Panetta"
    },
    {
        ". Lewinsky moved to Washington, D.C. and took up the position in July 1995. She moved to a paid position in the ": null
    },
    {
        "White House Office of Legislative Affairs": "White House Office Of Legislative Affairs"
    },
    {
        " in December 1995.                Lewinsky stated that she had nine sexual encounters in the ": null
    },
    {
        "Oval Office": "Oval Office"
    },
    {
        " with President ": null
    },
    {
        "Bill Clinton": "Bill Clinton"
    },
    {
        " between November 1995 and March 1997. According to her testimony, these involved ": null
    },
    {
        "fellatio": "Fellatio"
    },
    {
        " and other sexual acts, but not sexual intercourse.      Clinton had previously been confronted with allegations of sexual misconduct during his time as Governor of Arkansas. Former Arkansas state employee ": null
    },
    {
        "Paula Jones": "Paula Jones"
    },
    {
        " filed a civil lawsuit against him alleging that he had sexually harassed her. Lewinskys name surfaced during the discovery phase of Jones case, when Jones lawyers sought to show a pattern of behavior by Clinton which involved inappropriate sexual relationships with other government employees.      In April 1996, Lewinskys superiors transferred her from the White House to the Pentagon because they felt that she was spending too much time around Clinton. At the Pentagon, she worked as an assistant to chief Pentagon spokesman ": null
    },
    {
        "Kenneth Bacon": "Kenneth Bacon"
    },
    {
        ". Lewinsky told co-worker ": null
    },
    {
        "Linda Tripp": "Linda Tripp"
    },
    {
        " about her relationship with Clinton, and Tripp began secretly recording their telephone conversations beginning in September 1997. Lewinsky left the Pentagon position in December 1997.  Lewinsky submitted an affidavit in the Paula Jones case in January 1998 denying any physical relationship with Clinton, and she attempted to persuade Tripp to lie under oath in that case. Tripp gave the tapes to Independent Counsel ": null
    },
    {
        "Kenneth Starr": "Kenneth Starr"
    },
    {
        ", adding to his on-going investigation into the ": null
    },
    {
        "Whitewater controversy": "Whitewater"
    },
    {
        ". Starr then broadened his investigation beyond the Arkansas land use deal to include Lewinsky, Clinton, and others for possible perjury and subornation of perjury in the Jones case. Tripp reported the taped conversations to literary agent ": null
    },
    {
        "Lucianne Goldberg": "Lucianne Goldberg"
    },
    {
        ". She also convinced Lewinsky to save the gifts that Clinton had given her during their relationship and not to dry clean a blue dress that was stained with Clintons semen. Under oath, Clinton denied having had a sexual affair , sexual relations , or a sexual relationship with Lewinsky.   Retrieved December 18, 2006.     News of the Clinton–Lewinsky relationship broke in January 1998. On January 26, 1998, Clinton stated, I did not have sexual relations with that woman, Miss Lewinsky in a nationally televised White House news conference. The matter instantly occupied the news media, and Lewinsky spent the next weeks hiding from public attention in her mothers residence at the ": null
    },
    {
        "Watergate complex": "Watergate Complex"
    },
    {
        ". News of Lewinskys affair with Andy Bleiler, her former high school drama instructor, also came to light, and he turned over to Starr various souvenirs, photographs, and documents that Lewinsky had sent him and his wife during the time that she was in the White House.     Clinton had also said, There is not a sexual relationship, an improper sexual relationship or any other kind of improper relationship The NewsHour with Jim Lehrer   which he defended as truthful on August 17, 1998 because of his use of the present tense, arguing it depends on what the meaning of the word is is .  Starr obtained a blue dress from Lewinsky with Clintons semen stained on it, as well as testimony from her that the President had inserted a cigar into her vagina. Clinton stated, I did have a relationship with Miss Lewinsky that was not appropriate , but he denied committing perjury because, according to Clinton, the legal definition of oral sex was not encompassed by sex per se.   by Steve Kangas. Retrieved February 12, 2006 In addition, he relied on the definition of sexual relations as proposed by the prosecution and agreed by the defense and by Judge ": null
    },
    {
        "Susan Webber Wright": "Susan Webber Wright"
    },
    {
        ", who was hearing the Paula Jones case. Clinton claimed that certain acts were performed on him, not by him, and therefore he did not engage in sexual relations. Lewinskys testimony to the Starr Commission, however, contradicted Clintons claim of being totally passive in their encounters.      Clinton and Lewinsky were both called before a grand jury; he testified via closed-circuit television, she in person. She was granted ": null
    },
    {
        "transactional immunity": "Transactional Immunity"
    },
    {
        " by the Office of the Independent Counsel in exchange for her testimony.          The affair led to ": null
    },
    {
        "pop culture": "Popular Culture"
    },
    {
        " celebrity for Lewinsky, as she had become the focus of a political storm. Her immunity agreement restricted what she could talk about publicly, but she was able to cooperate with ": null
    },
    {
        "Andrew Morton": "Andrew Morton"
    },
    {
        " in his writing of  Monicas Story , her biography which included her side of the Clinton affair. The book was published in March 1999; it was also excerpted as a cover story in ": null
    },
    {
        "Time magazine": "Time"
    },
    {
        ".  On March 3, 1999, ": null
    },
    {
        "Barbara Walters": "Barbara Walters"
    },
    {
        " interviewed Lewinsky on ABCs  20/20 . The program was watched by 70 million Americans, which ABC said was a record for a news show.  Lewinsky made about $500,000 from her participation in the book and another $1 million from international rights to the Walters interview, but was still beset by high legal bills and living costs.     In June 1999, ": null
    },
    {
        "Ms. magazine": "Ms. Magazine"
    },
    {
        " published a series of articles by writer Susan Jane Gilman,  sexologist ": null
    },
    {
        "Susie Bright": "Susie Bright"
    },
    {
        ",  and author-host ": null
    },
    {
        "Abiola Abrams": "Abiola Abrams"
    },
    {
        "  arguing from three generations of women whether Lewinskys behavior had any meaning for feminism. Also in 1999, Lewinsky declined to sign an autograph in an airport, saying, Im kind of known for something thats not so great to be known for.  She made a cameo appearance as herself in two sketches during the May 8, 1999, episode of ": null
    },
    {
        "NBCs": "Nbc"
    },
    {
        "  Saturday Night Live , a program that had lampooned her relationship with Clinton over the prior 16 months.     By her own account, Lewinsky had survived the intense media attention during the scandal period by ": null
    },
    {
        "knitting": "Knitting"
    },
    {
        ". In September 1999, she took this interest further by beginning to sell a line of handbags bearing her name,  under the company name The Real Monica, Inc.  They were sold online as well as at ": null
    },
    {
        "Henri Bendel": "Henri Bendel"
    },
    {
        " in New York, ": null
    },
    {
        "Fred Segal": "Fred Segal"
    },
    {
        " in California, and The Cross in London.  Lewinsky designed the bags—described by  New York  magazine as hippie-ish, reversible totes —and traveled frequently to supervise their manufacture in ": null
    },
    {
        "Louisiana": "Louisiana"
    },
    {
        ".     At the start of 2000, Lewinsky began appearing in television commercials for the diet company ": null
    },
    {
        "Jenny Craig, Inc.": "Jenny Craig, Inc."
    },
    {
        "  The $1 million endorsement deal, which required Lewinsky to lose 40 or more pounds in six months, gained considerable publicity at the time. Lewinsky said that despite her desire to return to a more private life, she needed the money to pay off legal fees, and she believed in the product. A ": null
    },
    {
        "Jenny Craig": "Jenny Craig"
    },
    {
        " spokesperson said of Lewinsky, She represents a busy active woman of today with a hectic lifestyle. And she has had weight issues and weight struggles for a long time. That represents a lot of women in America. The choice of Lewinsky as a role model proved controversial for Jenny Craig, and some of its private franchises switched to an older advertising campaign.  The company stopped running the Lewinsky ads in February 2000, concluded her campaign entirely in April 2000, and paid her only $300,000 of the $1 million contracted for her involvement.     Also at the start of 2000, Lewinsky moved to New York City, lived in the ": null
    },
    {
        "West Village": "West Village"
    },
    {
        ", and became an ": null
    },
    {
        "A-list": "A-List"
    },
    {
        " guest in the ": null
    },
    {
        "Manhattan": "Manhattan"
    },
    {
        " social scene. In February 2000, she appeared on ": null
    },
    {
        "MTVs": "Mtv"
    },
    {
        "  The Tom Green Show , in an episode in which the host took her to his parents home in ": null
    },
    {
        "Ottawa": "Ottawa"
    },
    {
        " in search of fabric for her new handbag business. Later in 2000, Lewinsky worked as a correspondent for ": null
    },
    {
        "Channel 5": "Channel 5"
    },
    {
        " in the UK, on the show Monicas Postcards, reporting on U.S. culture and trends from a variety of locations.      In March 2002, Lewinsky, no longer bound by the terms of her immunity agreement, appeared in the ": null
    },
    {
        "HBO": "Hbo"
    },
    {
        " special, Monica in Black and White , part of the  America Undercover  series. In it she answered a studio audiences questions about her life and the Clinton affair.      Lewinsky hosted the reality television dating program,  Mr. Personality , on ": null
    },
    {
        "Fox Television Network": "Fox Television Network"
    },
    {
        " in 2003,  where she advised young women contestants who were picking men hidden by masks.  Some Americans tried to organize a boycott of advertisers on the show, to protest Lewinskys capitalizing on her notoriety.  Nevertheless, the show debuted to very high ratings, and Alessandra Stanley wrote in  The New York Times  The ratings, however, slid downward each successive week,  and after the show completed its initial limited run, it did not reappear. The same year she appeared as a guest on the programs  V Graham Norton  in the UK,  High Chaparall  in Sweden, and  The View  and  Jimmy Kimmel Live!  in the U.S.      After Clintons autobiography,  My Life , appeared in 2004, Lewinsky said in an interview with the British tabloid  Daily Mail         By 2005, Lewinsky found that she could not escape the spotlight in the U.S., which made both her professional and personal life difficult. She stopped selling her handbag line and moved to London to study ": null
    },
    {
        "social psychology": "Social Psychology"
    },
    {
        " at the ": null
    },
    {
        "London School of Economics": "London School Of Economics"
    },
    {
        ". In December 2006, Lewinsky graduated with a ": null
    },
    {
        "Master of Science": "Master Of Science"
    },
    {
        " degree.   Her thesis was titled, In Search of the Impartial Juror: An Exploration of the Third-Person Effect and Pre-Trial Publicity.  For the next decade she tried to avoid publicity.       Lewinsky did correspond in 2009 with scholar ": null
    },
    {
        "Ken Gormley": "Ken Gormley"
    },
    {
        ", who was writing an in-depth study of the Clinton scandals, maintaining that Clinton had lied under oath when asked detailed and specific questions about his relationship with her.  In 2013, the items associated with Lewinsky that Bleiler had turned over to Starr were put up for auction by Bleilers ex-wife, who had come into possession of them.      During her decade out of the public eye, Lewinsky lived in London, Los Angeles, New York, and Portland but, due to her notoriety, had trouble finding employment in the communications and marketing jobs for nonprofit organizations where she had been interviewed.          In May 2014, Lewinsky wrote an essay for  Vanity Fair  magazine titled Shame and Survival , wherein she discussed her life and the scandal.   She continued to maintain that the relationship was mutual and wrote that while Clinton took advantage of her, it was a consensual relationship.  She added: I, myself, deeply regret what happened between me and President Clinton. Let me say it again: I. Myself. Deeply. Regret. What. Happened. However, she said it was now time to stick my head above the parapet so that I can take back my narrative and give a purpose to my past. The magazine later announced her as a Vanity Fair contributor, stating she would contribute to their website on an ongoing basis, on the lookout for relevant topics of interest .       In July 2014, Lewinsky was interviewed in a three-part television special for the ": null
    },
    {
        "National Geographic Channel": "National Geographic Channel"
    },
    {
        ", titled The 90s: The Last Great Decade. The series looked at various events of the 1990s, including the scandal that brought Lewinsky into the national spotlight. This was Lewinskys first such interview in more than ten years.      In October 2014, she took a public stand  against ": null
    },
    {
        "cyberbullying": "Cyberbullying"
    },
    {
        ", calling herself ": null
    },
    {
        "patient zero": "Index Case"
    },
    {
        " of online harassment. Speaking at a  Forbes  magazine 30 Under 30 summit about her experiences in the aftermath of the scandal, she said, Having survived myself, what I want to do now is help other victims of the shame game survive, too.  She said she was influenced by reading about the ": null
    },
    {
        "suicide of Tyler Clementi": "Suicide Of Tyler Clementi"
    },
    {
        ", a ": null
    },
    {
        "Rutgers University": "Rutgers University"
    },
    {
        " freshman, involving cyberbullying and joined ": null
    },
    {
        "Twitter": "Twitter"
    },
    {
        " to facilitate her efforts.   In March 2015, Lewinsky continued to speak out publicly against cyberbullying,  delivering a ": null
    },
    {
        "TED talk": "Ted Talk"
    },
    {
        " calling for a more compassionate Internet.   In June 2015, she became an ambassador and strategic advisor for anti-bullying organization ": null
    },
    {
        "Bystander Revolution": "Bystander Revolution"
    },
    {
        ".  The same month, she gave an anti-cyberbullying speech at the ": null
    },
    {
        "Cannes Lions International Festival of Creativity": "Cannes Lions International Festival Of Creativity"
    },
    {
        ".  In September 2015, Lewinsky was interviewed by ": null
    },
    {
        "Amy Robach": "Amy Robach"
    },
    {
        " on  Good Morning America , about Bystander Revolutions Month of Action campaign for National Bullying Prevention Month.  Lewinsky wrote the foreword  to an October 2017 book by Sue Scheff and Melissa Schorr, Shame Nation: The Global Epidemic of Online Hate.       In October 2017, Lewinsky tweeted the ": null
    },
    {
        "MeToo hashtag": "Me Too"
    },
    {
        " to indicate that she was a victim of sexual harassment and/or sexual assault, but did not provide details.  She wrote an essay in the March 2018 issue of Vanity Fair in which she did not directly explain why she used the MeToo hashtag in October. She did write that looking back at her relationship with Bill Clinton, although it was consensual, because he was 27 years older than her and in a position with a lot more power than she had, in her opinion the relationship constituted an abuse of power on Clintons part. She added that she had been diagnosed with ": null
    },
    {
        "post-traumatic stress disorder": "Post-Traumatic Stress Disorder"
    },
    {
        " due to the experiences involved after the relationship was disclosed.  In May 2018, Lewinsky was disinvited from an event hosted by  Town & Country  when Bill Clinton accepted an invitation to the event.      In September 2018, Lewinsky spoke at a conference in ": null
    },
    {
        "Jerusalem": "Jerusalem"
    },
    {
        ". Following her speech, she sat for a Q & A session with the host, journalist ": null
    },
    {
        "Yonit Levi": "Yonit Levi"
    },
    {
        ". The first question Levi asked was whether Lewinsky thinks that Clinton owes her a private apology. Lewinsky refused to answer the question, and walked off the stage. She later tweeted that the question was posed in a pre-event meeting with Levi, and Lewinsky told her that such a question was off limits. A spokesman for the ": null
    },
    {
        "Israel Television News Company": "Israel Television News Company"
    },
    {
        ", which hosted the conference and is Levis employer, responded that Levi had kept all the agreements she made with Lewinsky and honored her requests.      In 2019, she was interviewed by ": null
    },
    {
        "John Oliver": "John Oliver"
    },
    {
        " on ": null
    },
    {
        "his HBO show": "Last Week Tonight With John Oliver"
    },
    {
        ", where they discussed the importance of solving the problem of ": null
    },
    {
        "public shaming": "Public Humiliation"
    },
    {
        " and how her situation may have been different if social media had existed at the time that ": null
    },
    {
        "the scandal": "Clinton–Lewinsky Scandal"
    },
    {
        " broke in the late 1990s. ": null
    }
]