[
    {
        "        In ": null
    },
    {
        "music": "Music"
    },
    {
        ", there are two common meanings for tuning": null
    },
    {
        "Tuning practice": "Tuning Practice"
    },
    {
        ", the act of tuning an instrument or voice.   ": null
    },
    {
        "Tuning systems": "Tuning Systems"
    },
    {
        ", the various systems of ": null
    },
    {
        "pitches": "Pitch"
    },
    {
        " used to tune an instrument, and their theoretical bases.             Tuning is the process of adjusting the pitch of one or many tones from musical instruments to establish typical intervals between these tones. Tuning is usually based on a fixed reference, such as ": null
    },
    {
        "A 440  Hz": "A440"
    },
    {
        ". The term out of tune refers to a pitch/tone that is either too high  or too low  in relation to a given reference pitch. While an instrument might be in tune relative to its own range of notes, it may not be considered in tune if it does not match the chosen reference pitch. Some instruments become out of tune with temperature, humidity, damage, or just time, and must be readjusted or repaired.     Different methods of sound production require different methods of adjustment:   Tuning to a pitch with ones voice is called matching pitch and is the most basic skill learned in ": null
    },
    {
        "ear training": "Ear Training"
    },
    {
        ".   Turning ": null
    },
    {
        "pegs": "Tuning Peg"
    },
    {
        " to increase or decrease the ": null
    },
    {
        "tension": "Tension"
    },
    {
        " on strings so as to control the pitch. Instruments such as the harp, piano, and harpsichord require a wrench to turn the tuning pegs, while others such as the ": null
    },
    {
        "violin": "Violin"
    },
    {
        " can be tuned manually.   Modifying the length or width of the tube of a ": null
    },
    {
        "wind instrument": "Wind Instrument"
    },
    {
        ", ": null
    },
    {
        "brass instrument": "Brass Instrument"
    },
    {
        ", ": null
    },
    {
        "pipe": "Pan Pipes"
    },
    {
        ", ": null
    },
    {
        "bell": "Bell"
    },
    {
        ", or similar instrument to adjust the pitch.     The sounds of some instruments such as ": null
    },
    {
        "cymbals": "Cymbal"
    },
    {
        " are  inharmonic —they have irregular overtones not conforming to the ": null
    },
    {
        "harmonic series": "Harmonic Series"
    },
    {
        ".     Tuning may be done aurally by sounding two pitches and adjusting one of them to match or relate to the other. A ": null
    },
    {
        "tuning fork": "Tuning Fork"
    },
    {
        " or electronic tuning device may be used as a reference pitch, though in ensemble rehearsals often a ": null
    },
    {
        "piano": "Piano"
    },
    {
        " is used . ": null
    },
    {
        "Symphony orchestras": "Orchestra"
    },
    {
        " and ": null
    },
    {
        "concert bands": "Concert Band"
    },
    {
        " usually tune to an ": null
    },
    {
        "A": "A"
    },
    {
        "440 or a ": null
    },
    {
        "B♭": "B♭"
    },
    {
        ", respectively, provided by the principal ": null
    },
    {
        "oboist": "Oboe"
    },
    {
        " or ": null
    },
    {
        "clarinet": "Clarinet"
    },
    {
        "ist, who tune to the keyboard if part of the performance.    When only strings are used, then the principal string typically has sounded the tuning pitch, but some orchestras have used an electronic tone machine for tuning.     Interference ": null
    },
    {
        "beats": "Beat"
    },
    {
        " are used to objectively measure the accuracy of tuning. As the two pitches approach a harmonic relationship, the frequency of beating decreases. When tuning a unison or octave it is desired to reduce the beating frequency until it cannot be detected. For other intervals, this is dependent on the ": null
    },
    {
        "tuning system": "Tuning Systems"
    },
    {
        " being used.     ": null
    },
    {
        "Harmonics": "Harmonic"
    },
    {
        " may be used to facilitate tuning of strings that are not themselves tuned to the unison. For example, lightly touching the highest string of a cello at the middle  while bowing produces the same pitch as doing the same a third of the way down its second-highest string. The resulting unison is more easily and quickly judged than the quality of the perfect fifth between the fundamentals of the two strings.                   In ": null
    },
    {
        "music": "Music"
    },
    {
        ", the term open string refers to the fundamental note of the unstopped, full string.     The strings of a ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " are normally tuned to ": null
    },
    {
        "fourths": "Perfect Fourth"
    },
    {
        " , as are the strings of the ": null
    },
    {
        "bass guitar": "Bass Guitar"
    },
    {
        " and ": null
    },
    {
        "double bass": "Double Bass"
    },
    {
        ". ": null
    },
    {
        "Violin": "Violin"
    },
    {
        ", ": null
    },
    {
        "viola": "Viola"
    },
    {
        ", and ": null
    },
    {
        "cello": "Cello"
    },
    {
        " strings are tuned to ": null
    },
    {
        "fifths": "Perfect Fifth"
    },
    {
        ". However, non-standard tunings  exist to change the sound of the instrument or create other playing options.     To tune an instrument, often only one reference pitch is given. This reference is used to tune one string, to which the other strings are tuned in the desired intervals. On a guitar, often the lowest string is tuned to an E. From this, each successive string can be tuned by fingering the fifth fret of an already tuned string and comparing it with the next higher string played open. This works with the exception of the G string, which must be stopped at the fourth fret to sound B against the open B string above. Alternatively, each string can be tuned to its own reference tone.        Note that while the guitar and other modern stringed instruments with fixed frets are tuned in ": null
    },
    {
        "equal temperament": "Equal Temperament"
    },
    {
        ", string instruments without frets, such as those of the violin family, are not. The violin, viola, and cello are tuned to ": null
    },
    {
        "beatless": "Beat"
    },
    {
        " just perfect fifths and ensembles such as string quartets and orchestras tend to play in fifths based ": null
    },
    {
        "Pythagorean tuning": "Pythagorean Tuning"
    },
    {
        " or to compensate and play in equal temperament, such as when playing with other instruments such as the piano. For example, the cello, which is tuned down from ": null
    },
    {
        "A220": "A440"
    },
    {
        ", has three more strings and the just perfect fifth is about two ": null
    },
    {
        "cents": "Cent"
    },
    {
        " off from the equal tempered perfect fifth, making its lowest string, C-, about six cents more flat than the equal tempered C.     This table lists open strings on some common string instruments and their standard tunings from low to high unless otherwise noted.                Violin scordatura was employed in the 17th and 18th centuries by Italian and German composers, namely, ": null
    },
    {
        "Biagio Marini": "Biagio Marini"
    },
    {
        ", ": null
    },
    {
        "Antonio Vivaldi": "Antonio Vivaldi"
    },
    {
        ", ": null
    },
    {
        "Heinrich Ignaz Franz Biber": "Heinrich Ignaz Franz Biber"
    },
    {
        " , ": null
    },
    {
        "Johann Pachelbel": "Johann Pachelbel"
    },
    {
        " and ": null
    },
    {
        "Johann Sebastian Bach": "Johann Sebastian Bach"
    },
    {
        ", whose  Fifth Suite For Unaccompanied Cello  calls for the lowering of the A string to G. In ": null
    },
    {
        "Mozarts": "Wolfgang Amadeus Mozart"
    },
    {
        "  Sinfonia Concertante  in E-flat major , all the strings of the solo viola are raised one half-step, ostensibly to give the instrument a brighter tone so the solo violin does not overshadow it.     Scordatura for the violin was also used in the 19th and 20th centuries in works by ": null
    },
    {
        "Niccolò Paganini": "Niccolò Paganini"
    },
    {
        ", ": null
    },
    {
        "Robert Schumann": "Robert Schumann"
    },
    {
        ", ": null
    },
    {
        "Camille Saint-Saëns": "Camille Saint-Saëns"
    },
    {
        " and ": null
    },
    {
        "Béla Bartók": "Béla Bartók"
    },
    {
        ". In Saint-Saëns ": null
    },
    {
        "Danse Macabre": "Danse Macabre"
    },
    {
        " , the high string of the violin is lower half a tone to the E so as to have the most accented note of the main theme sound on an open string. In Bartóks Contrasts, the violin is tuned G-D-A-E to facilitate the playing of tritones on open strings.     American folk violinists of the ": null
    },
    {
        "Appalachians": "Appalachians"
    },
    {
        " and ": null
    },
    {
        "Ozarks": "Ozarks"
    },
    {
        " often employ alternate tunings for dance songs and ballads. The most commonly used tuning is A-E-A-E. Likewise banjo players in this tradition use many tunings to play melody in different keys. A common alternative banjo tuning for playing in D is A-D-A-D-E. Many Folk guitar players also used different tunings from standard, such as D-A-D-G-A-D, which is very popular for Irish music.     A musical instrument that has had its pitch deliberately lowered during tuning is said to be down-tuned or tuned down. Common examples include the electric guitar and electric bass in contemporary ": null
    },
    {
        "heavy metal music": "Heavy Metal Music"
    },
    {
        ", whereby one or more strings are often tuned lower than ": null
    },
    {
        "concert pitch": "Concert Pitch"
    },
    {
        ". This is not to be confused with electronically changing the ": null
    },
    {
        "fundamental frequency": "Fundamental Frequency"
    },
    {
        ", which is referred to as ": null
    },
    {
        "pitch shifting": "Pitch Shifting"
    },
    {
        ".          Many percussion instruments are tuned by the player, including ": null
    },
    {
        "pitched percussion instruments": "Pitched Percussion Instrument"
    },
    {
        " such as ": null
    },
    {
        "timpani": "Timpani"
    },
    {
        " and ": null
    },
    {
        "tabla": "Tabla"
    },
    {
        ", and ": null
    },
    {
        "unpitched percussion instruments": "Unpitched Percussion Instrument"
    },
    {
        " such as the ": null
    },
    {
        "snare drum": "Snare Drum"
    },
    {
        ".     Tuning pitched percussion follows the same patterns as tuning any other instrument, but tuning unpitched percussion does not produce a specific ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        ". For this reason and others, the traditional terms  tuned percussion  and  untuned percussion  are avoided in recent ": null
    },
    {
        "organology": "Organology"
    },
    {
        ".           A tuning system is the system used to define which ": null
    },
    {
        "tones": "Semitone"
    },
    {
        ", or ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        "es, to use when playing ": null
    },
    {
        "music": "Music"
    },
    {
        ". In other words, it is the choice of number and spacing of ": null
    },
    {
        "frequency": "Frequency"
    },
    {
        " values used.     Due to the ": null
    },
    {
        "psychoacoustic": "Psychoacoustics"
    },
    {
        " interaction of tones and ": null
    },
    {
        "timbres": "Timbre"
    },
    {
        ", various tone combinations sound more or less natural in combination with various timbres. For example, using harmonic timbres:   A tone caused by a vibration twice the frequency of another forms the natural sounding ": null
    },
    {
        "octave": "Octave"
    },
    {
        ".   A tone caused by a vibration three times the frequency of another forms the natural sounding ": null
    },
    {
        "perfect twelfth": "Perfect Twelfth"
    },
    {
        ", or ": null
    },
    {
        "perfect fifth": "Perfect Fifth"
    },
    {
        " when octave-reduced.   More complex musical effects can be created through other relationships. W. A. Mathieu Harmonic Experience: Tonal Harmony from Its Natural Origins to Its Modern Expression. Inner Traditions.     The creation of a tuning system is complicated because musicians want to make music with more than just a few differing tones. As the number of tones is increased, conflicts arise in how each tone combines with every other. Finding a successful combination of tunings has been the cause of debate, and has led to the creation of many different tuning systems across the world. Each tuning system has its own characteristics, strengths and weaknesses.          It is impossible to tune the twelve-note ": null
    },
    {
        "chromatic scale": "Chromatic Scale"
    },
    {
        " so that all ": null
    },
    {
        "intervals": "Interval"
    },
    {
        " are pure. For instance, three pure major thirds stack up to 125/64, which at 1159 cents is nearly a quarter tone away from the octave . So there is no way to have both the octave and the major third in just intonation for all the intervals in the same twelve-tone system. Similar issues arise with the fifth 3/2, and the minor third 6/5 or any other choice of harmonic-series based pure intervals.     Many different compromise methods are used to deal with this, each with its own characteristics, and advantages and disadvantages.     The main ones are:   ": null
    },
    {
        "Just intonation": "Just Intonation"
    },
    {
        "      : In just intonation, the frequencies of the scale notes are related to one another by simple numeric ratios, a common example of this being 1:1, 9:8, 5:4, 4:3, 3:2, 5:3, 15:8, 2:1 to define the ratios for the seven notes in a C major scale. In this example, though many intervals are pure, the interval from D to A is 40/27 instead of the expected 3/2. The same issue occurs with most just intonation tunings. This can be dealt with to some extent using alternative pitches for the notes. Even that, however, is only a partial solution, as an example makes clear: If one plays the sequence C G D A E C in just intonation, using the intervals 3/2, 3/4 and 4/5, then the second C in the sequence is higher than the first by a ": null
    },
    {
        "syntonic comma": "Syntonic Comma"
    },
    {
        " of 81/80. This is the infamous ": null
    },
    {
        "comma pump": "Comma Pump"
    },
    {
        " . Each time around the comma pump, the pitch continues to spiral upwards. This shows that it is impossible to keep to any small fixed system of pitches if one wants to stack musical intervals this way. So, even with adaptive tuning, the musical context may sometimes require playing musical intervals that are not pure. Instrumentalists with the ability to vary the pitch of their instrument may micro-adjust some of the intervals naturally; there are also systems for adaptive tuning in software . Harmonic fragment scales form a rare exception to this issue. In tunings such as 1:1 9:8 5:4 3:2 7:4 2:1, all the pitches are chosen from the harmonic series , so all the intervals are related to each other by simple numeric ratios.   ": null
    },
    {
        "Pythagorean tuning": "Pythagorean Tuning"
    },
    {
        "      : A Pythagorean tuning is technically a type of just intonation, in which the frequency ratios of the notes are all derived from the number ratio 3:2. Using this approach for example, the 12 notes of the Western chromatic scale would be tuned to the following ratios: 1:1, 256:243, 9:8, 32:27, 81:64, 4:3, 729:512, 3:2, 128:81, 27:16, 16:9, 243:128, 2:1. Also called 3-limit because there are no prime factors other than 2 and 3, this Pythagorean system was of primary importance in Western musical development in the Medieval and Renaissance periods. As with nearly all just intonation systems, it has a ": null
    },
    {
        "wolf interval": "Wolf Interval"
    },
    {
        ". In the example given, it is the interval between the 729:512 and the 256:243 . The major and minor thirds are also impure, but at the time when this system was at its zenith, the third was considered a dissonance, so this was of no concern. See also: ": null
    },
    {
        "Shí-èr-lǜ": "Shí-Èr-Lǜ"
    },
    {
        ".   ": null
    },
    {
        "Meantone temperament": "Meantone Temperament"
    },
    {
        "      : A system of tuning that averages out pairs of ratios used for the same interval . The best known form of this temperament is ": null
    },
    {
        "quarter-comma meantone": "Quarter-Comma Meantone"
    },
    {
        ", which tunes major thirds justly in the ratio of 5:4 and divides them into two whole tones of equal size – this is achieved by flattening the fifths of the Pythagorean system slightly . However, the fifth may be flattened to a greater or lesser degree than this and the tuning system retains the essential qualities of meantone temperament. Historical examples include 1/3-comma and 2/7-comma meantone.   ": null
    },
    {
        "Well temperament": "Well Temperament"
    },
    {
        "      : Any one of a number of systems where the ratios between intervals are unequal, but approximate to ratios used in just intonation. Unlike meantone temperament, the amount of divergence from just ratios varies according to the exact notes being tuned, so that C-E is probably tuned closer to a 5:4 ratio than, say, D-F. Because of this, well temperaments have no ": null
    },
    {
        "wolf intervals": "Wolf Interval"
    },
    {
        ".   ": null
    },
    {
        "Equal temperament": "Equal Temperament"
    },
    {
        "      : The standard twelve-tone equal temperament is a special case of meantone temperament , in which the twelve notes are separated by ": null
    },
    {
        "logarithm": "Logarithm"
    },
    {
        "ically equal distances :  . This is the most common tuning system used in Western music, and is the standard system used as a basis for ": null
    },
    {
        "tuning a piano": "Piano Tuning"
    },
    {
        ". Since this scale divides an octave into twelve equal-ratio steps and an octave has a frequency ratio of two, the frequency ratio between adjacent notes is then the ": null
    },
    {
        "twelfth root of two": "Twelfth Root Of Two"
    },
    {
        ", 2 1/12 , or ~1.05946309.... However, the octave can be divided into other than 12 equal divisions, some of which may be more harmonically pleasing as far as thirds and sixths are concerned, such as ": null
    },
    {
        "19 equal temperament": "19 Equal Temperament"
    },
    {
        " , ": null
    },
    {
        "31 equal temperament": "31 Equal Temperament"
    },
    {
        " and ": null
    },
    {
        "53 equal temperament": "53 Equal Temperament"
    },
    {
        " .   ": null
    },
    {
        "Tempered timbres": "Tempered Timbre"
    },
    {
        "   : A timbres partials can be tempered such that each of the timbres partials aligns with a note of a given tempered tuning. This alignment of tuning and timbre is a key component in the perception of consonance, William Sethares, Local Consonance and the Relationship between Timbre and Scale , Journal of the Acoustical Society of America, Vol. 94, No. 1 : 1218.  of which one notable example is the alignment between the partials of a harmonic timbre and a just intonation tuning. Hence, using tempered timbres, one can achieve a degree of consonance, in any tempered tuning, that is comparable to the consonance achieved by the combination of just intonation tuning and harmonic timbres. Tempering timbres in real time, to match a tuning that can change smoothly in real time, using the tuning-invariant fingering of an ": null
    },
    {
        "isomorphic keyboard": "Isomorphic Keyboard"
    },
    {
        ", is a central component of ": null
    },
    {
        "dynamic tonality": "Dynamic Tonality"
    },
    {
        ". Andrew Milne, William A. Sethares, Stefan Tiedje, Anthony Prechtl, and James Plamondon,  , Computer Music Journal, Spring 2009.     Tuning systems that are not produced with exclusively just intervals are usually referred to as  temperaments .       Natural overtone scale, a scale derived from the harmonic series.   ": null
    },
    {
        "Slendro": "Slendro"
    },
    {
        ", a ": null
    },
    {
        "pentatonic scale": "Pentatonic Scale"
    },
    {
        " used in ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        "n music.   ": null
    },
    {
        "Pelog": "Pelog"
    },
    {
        ", the other main gamelan scale.   ": null
    },
    {
        "43-tone scale": "Harry Partchs 43-Tone Scale"
    },
    {
        ", created by ": null
    },
    {
        "Harry Partch": "Harry Partch"
    },
    {
        ", an American ": null
    },
    {
        "composer": "Composer"
    },
    {
        ".   ": null
    },
    {
        "Bohlen–Pierce scale": "Bohlen–Pierce Scale"
    },
    {
        " Alpha": "Alpha Scale"
    },
    {
        ", ": null
    },
    {
        "beta": "Beta Scale"
    },
    {
        ", ": null
    },
    {
        "delta": "Delta Scale"
    },
    {
        ", and ": null
    },
    {
        "gamma scales": "Gamma Scale"
    },
    {
        " of ": null
    },
    {
        "Wendy Carlos": "Wendy Carlos"
    },
    {
        ".   ": null
    },
    {
        "Quarter tone scale": "Quarter Tone Scale"
    },
    {
        ".   ": null
    },
    {
        "Thirteenth Sound": "Thirteenth Sound"
    },
    {
        " 19 equal temperament": "19 Equal Temperament"
    },
    {
        " 22 equal temperament": "22 Equal Temperament"
    },
    {
        " 31 equal temperament": "31 Equal Temperament"
    },
    {
        " 53 equal temperament": "53 Equal Temperament"
    },
    {
        " Schismatic temperament": "Schismatic Temperament"
    },
    {
        " Miracle temperament": "Miracle Temperament"
    },
    {
        " Hexany": "Hexany"
    }
]