[
    {
        "           Music notation or musical notation is any system used to visually represent ": null
    },
    {
        "aurally": "Wikt:Aurally"
    },
    {
        " perceived ": null
    },
    {
        "music": "Music"
    },
    {
        " played with ": null
    },
    {
        "instruments": "Instrument"
    },
    {
        " or ": null
    },
    {
        "sung": "Singing"
    },
    {
        " by the ": null
    },
    {
        "human voice": "Human Voice"
    },
    {
        " through the use of written, printed, or otherwise-produced symbols.     Types and methods of notation have varied between cultures and throughout history, and much information about ancient music notation is fragmentary. Even in the same time period, such as in the 2010s, different styles of music and different cultures use different music notation methods; for example, for professional ": null
    },
    {
        "classical music": "Classical Music"
    },
    {
        " performers, ": null
    },
    {
        "sheet music": "Sheet Music"
    },
    {
        " using staves and noteheads is the most common way of notating music, but for professional ": null
    },
    {
        "country music": "Country Music"
    },
    {
        " session musician": "Session Musician"
    },
    {
        "s, the ": null
    },
    {
        "Nashville Number System": "Nashville Number System"
    },
    {
        " is the main method.     The symbols used include ancient symbols and ": null
    },
    {
        "modern symbols": "Modern Musical Symbols"
    },
    {
        " made upon any media such as symbols cut into stone, made in ": null
    },
    {
        "clay tablet": "Clay Tablet"
    },
    {
        "s, made using a pen on ": null
    },
    {
        "papyrus": "Papyrus"
    },
    {
        " or ": null
    },
    {
        "parchment": "Parchment"
    },
    {
        " or ": null
    },
    {
        "manuscript paper": "Manuscript Paper"
    },
    {
        "; printed using a ": null
    },
    {
        "printing press": "Printing Press"
    },
    {
        " , a ": null
    },
    {
        "computer printer": "Computer Printer"
    },
    {
        " or other ": null
    },
    {
        "printing": "Music Engraving"
    },
    {
        " or ": null
    },
    {
        "modern copying technology": "Photocopier"
    },
    {
        ".     Although many ancient cultures used symbols to represent ": null
    },
    {
        "melodies": "Melody"
    },
    {
        " and ": null
    },
    {
        "rhythm": "Rhythm"
    },
    {
        "s, none of them were particularly comprehensive, and this has limited todays understanding of their music. The seeds of what would eventually become modern western notation were sown in ": null
    },
    {
        "medieval": "Medieval Music"
    },
    {
        " Europe, starting with the ": null
    },
    {
        "Catholic Churchs": "Catholic Church"
    },
    {
        "goal for ecclesiastical uniformity. The church began notating ": null
    },
    {
        "plainchant": "Plainchant"
    },
    {
        " melodies so that the same chants could be used throughout the church. Music notation developed further in the ": null
    },
    {
        "Renaissance": "Renaissance Music"
    },
    {
        " and ": null
    },
    {
        "Baroque music": "Baroque Music"
    },
    {
        " eras. In the ": null
    },
    {
        "classical period": "Classical Period"
    },
    {
        " and the ": null
    },
    {
        "Romantic music era": "Romantic Music Era"
    },
    {
        " , notation continued to develop as new ": null
    },
    {
        "musical instrument technologies": "Music Technology"
    },
    {
        " were developed. In the ": null
    },
    {
        "contemporary classical music": "Contemporary Classical Music"
    },
    {
        " of the 20th and 21st century, music notation has continued to develop, with the introduction of ": null
    },
    {
        "graphical notation": "Graphical Notation"
    },
    {
        " by some modern composers and the use, since the 1980s, of computer-based ": null
    },
    {
        "score writer": "Scorewriter"
    },
    {
        " programs for notating music. Music notation has been adapted to many kinds of music, including classical music, ": null
    },
    {
        "popular music": "Popular Music"
    },
    {
        ", and ": null
    },
    {
        "traditional music": "Traditional Music"
    },
    {
        ".                 The earliest form of musical notation can be found in a ": null
    },
    {
        "cuneiform": "Cuneiform Script"
    },
    {
        " tablet that was created at ": null
    },
    {
        "Nippur": "Nippur"
    },
    {
        ", in ": null
    },
    {
        "Babylonia": "Babylonia"
    },
    {
        " , in about 1400 BC. The tablet represents fragmentary instructions for performing music, that the music was composed in harmonies of thirds, and that it was written using a ": null
    },
    {
        "diatonic scale": "Diatonic Scale"
    },
    {
        ". Kilmer & Civil 1986,. A tablet from about 1250 BC shows a more developed form of notation. Kilmer 1965,. Although the interpretation of the notation system is still controversial, it is clear that the notation indicates the names of strings on a ": null
    },
    {
        "lyre": "Lyre"
    },
    {
        ", the tuning of which is described in other tablets. West 1994, 161–63. Although they are fragmentary, these tablets represent the earliest notated ": null
    },
    {
        "melodies": "Melody"
    },
    {
        " found anywhere in the world. West 1994, 161.                 ": null
    },
    {
        "Ancient Greek": "Music Of Ancient Greece"
    },
    {
        " musical notation was in use from at least the 6th century BC until approximately the 4th century AD; several complete compositions and fragments of compositions using this notation survive. The notation consists of symbols placed above text syllables. An example of a complete composition is the ": null
    },
    {
        "Seikilos epitaph": "Seikilos Epitaph"
    },
    {
        ", which has been variously dated between the 2nd century BC to the 2nd century AD.     Three hymns by ": null
    },
    {
        "Mesomedes": "Mesomedes"
    },
    {
        " of ": null
    },
    {
        "Crete": "Crete"
    },
    {
        " exist in manuscript. The ": null
    },
    {
        "Delphic Hymns": "Delphic Hymns"
    },
    {
        ", dated to the 2nd century BC, also use this notation, but they are not completely preserved. Ancient Greek notation appears to have fallen out of use around the time of the ": null
    },
    {
        "Decline of the Western Roman Empire": "Decline Of The Western Roman Empire"
    },
    {
        ".               ": null
    },
    {
        "Byzantine": "Byzantine Empire"
    },
    {
        " music once included music for court ceremonies, but has only survived as vocal church music within various Orthodox traditions of monodic chant written down in Byzantine round notation . Printed chant books with a modern simplified version of round notation were published since the 1820s and also used in Greece and Constantinople and in Old Church Slavonic translation within the slavophone Balkans and later on the territory of the autocephalous foundation of ": null
    },
    {
        "Bulgaria": "National Awakening Of Bulgaria"
    },
    {
        ".     Since the 6th century Greek theoretical categories played a key role to understand and transmit Byzantine music, especially the tradition of Damascus had a strong impact on the pre-Islamic ": null
    },
    {
        "Near East": "Near East"
    },
    {
        " comparable to the impact coming from ": null
    },
    {
        "Persian music": "Persian Traditional Music"
    },
    {
        ". The earliest evidence are papyrus fragments of Greek tropologia. These fragments just present the hymn text following a modal signature or key .     Unlike Western notation Byzantine neumes used since the 10th century were always related to modal steps in relation to such a clef or modal key . Originally this key or the incipit of a common melody was enough to indicate a certain melodic model given within the ": null
    },
    {
        "echos": "Echos"
    },
    {
        ". Next to ": null
    },
    {
        "ekphonetic notation": "Ekphonetic Notation"
    },
    {
        ", only used in lectionaries to indicate formulas used during scriptural lessons, melodic notation developed not earlier than between the 9th and the 10th century, when a theta , oxeia or diple were written under a certain syllable of the text, whenever a longer melisma was expected. This primitive form was called “theta” or “diple notation”.     Today, one can study the evolution of this notation within Greek monastic chant books like those of the ": null
    },
    {
        "sticherarion": "Sticheron"
    },
    {
        " and the ": null
    },
    {
        "heirmologion": "Irmologion"
    },
    {
        " , while there was another gestic notation originally used for the asmatikon and kontakarion of the Constantinopolitan cathedral rite. The earliest books which have survived, are “kondakars” in Slavonic translation which already show an own notation system known as Kondakarian notation. See the section about the Slavic chant book ": null
    },
    {
        "kondakar": "Byzantinemusicthekievanrusandtheearliestmanuscriptsofthecathedralrite"
    },
    {
        " of the article Byzantine music. Only one Greek asmatikon written during the 14th century preserved this gestic notation based on the practice of cheironomia, and transcribed the gestic signs into sticherarion notation in a second row. Like the Greek alphabet notational signs are ordered left to right . The question of rhythm was entirely based on cheironomia . Basically those great signs indicated well-known melodical phrases given by gestures of the ": null
    },
    {
        "choirleaders": "Cantor"
    },
    {
        " of the cathedral rite. They existed once as part of an oral tradition, developed Kondakarian notation and became during the 13th century integrated into Byzantine round notation as a kind of universal notation system. After the decline of the Constantinopolitan cathedral rite during the fourth crusade , its books kontakarion and asmatikon had been written in monastic scriptoria using Byzantine round notation .     Today the main difference between Western and Eastern neumes is that Eastern notation symbols are differential rather than absolute, i.e. they indicate pitch steps , and the musicians know to deduce correctly, from the score and the note they are singing presently, which correct interval is meant. These step symbols themselves, or better phonic neumes , resemble brush strokes and are colloquially called gántzoi in ": null
    },
    {
        "Modern Greek": "Modern Greek"
    },
    {
        ".     Notes as pitch classes or modal keys are represented in written form only between these neumes . In modern notation they simply serve as an optional reminder and modal and tempo directions have been added, if necessary. In Papadic notation medial signatures usually meant a temporary change into another echos.     The so-called great signs were once related to cheironomic signs; according to modern interpretations they are understood as embellishments and microtonal attractions , both essential in Byzantine chant. See Maria Alexandru  for a historical discussion of the great signs and their modern interpretations.          Since ": null
    },
    {
        "Chrysanthos of Madytos": "Chrysanthos Of Madytos"
    },
    {
        " there are seven standard note names used for solfège  pá, vú, g h á, d h ē, ké, zō, nē, while the older practice still used the four enechemata or intonation formulas of the four echoi given by the modal signatures, the authentic or kyrioi in ascending direction, and the plagal or plagioi in descending direction . Chrysanthos  made a difference between his monosyllabic and the traditional polysyllabic parallage. With exception of vú and zō they do roughly correspond to Western solmization syllables as re, mi, fa, sol, la, si, do. Byzantine music uses the eight natural, non-tempered scales whose elements were identified by Ēkhoi, sounds , exclusively, and therefore the absolute pitch of each note may slightly vary each time, depending on the particular Ēkhos used. Byzantine notation is still used in many Orthodox Churches. Sometimes cantors also use transcriptions into Western or Kievan staff notation while adding non-notatable embellishment material from memory and sliding into the natural scales from experience, but even concerning modern neume editions since the reform of Chrysanthos a lot of details are only known from an oral tradition related to traditional masters and their experience.       In 1252, ": null
    },
    {
        "Safi al-Din al-Urmawi": "Safi Al-Din Al-Urmawi"
    },
    {
        " developed a form of musical notation, where ": null
    },
    {
        "rhythms": "Rhythm"
    },
    {
        "were represented by ": null
    },
    {
        "geometric": "Geometry"
    },
    {
        " representation. Many subsequent scholars of rhythm have sought to develop graphical geometrical notations. For example, a similar geometric system was published in 1987 by Kjell Gustafson, whose method represents a rhythm as a two-dimensional graph.                The scholar and music theorist ": null
    },
    {
        "Isidore of Seville": "Isidore Of Seville"
    },
    {
        ", while writing in the early 7th century, considered that unless sounds are held by the memory of man, they perish, because they cannot be written down. Isidore of Seville 2006, 95. By the middle of the 9th century, however, a form of neumatic notation began to develop in monasteries in Europe as a ": null
    },
    {
        "mnemonic": "Mnemonic"
    },
    {
        " device for ": null
    },
    {
        "Gregorian chant": "Gregorian Chant"
    },
    {
        ", using symbols known as ": null
    },
    {
        "neume": "Neume"
    },
    {
        "s; the earliest surviving musical notation of this type is in the Musica disciplina of ": null
    },
    {
        "Aurelian of Réôme": "Aurelian Of Réôme"
    },
    {
        ", from about 850. There are scattered survivals from the ": null
    },
    {
        "Iberian Peninsula": "Iberian Peninsula"
    },
    {
        " before this time, of a type of notation known as ": null
    },
    {
        "Visigothic neumes": "Neume"
    },
    {
        ", but its few surviving fragments have not yet been deciphered. Zapke 2007,  The problem with this notation was that it only showed melodic contours and consequently the music could not be read by someone who did not know the music already.          Notation had developed far enough to notate melody, but there was still no system for notating rhythm. A mid-13th-century treatise,  De Mensurabili Musica , explains a set of six ": null
    },
    {
        "rhythmic modes": "Rhythmic Modes"
    },
    {
        " that were in use at the time, Christensen 2002, 628. although it is not clear how they were formed. These rhythmic modes were all in triple time and rather limited rhythm in chant to six different repeating patterns. This was a flaw seen by German music theorist ": null
    },
    {
        "Franco of Cologne": "Franco Of Cologne"
    },
    {
        " and summarised as part of his treatise Ars cantus mensurabilis . He suggested that individual notes could have their own rhythms represented by the shape of the note. Not until the 14th century did something like the present system of fixed note lengths arise. The use of regular measures became commonplace by the end of the 17th century.     The founder of what is now considered the standard music staff was ": null
    },
    {
        "Guido dArezzo": "Guido Of Arezzo"
    },
    {
        ", . an Italian Benedictine monk who lived from about 991 until after 1033. He taught the use of ": null
    },
    {
        "solmization": "Solmization"
    },
    {
        " syllables based on a hymn to ": null
    },
    {
        "Saint John the Baptist": "Saint John The Baptist"
    },
    {
        ", which begins ": null
    },
    {
        "Ut Queant Laxis": "Ut Queant Laxis"
    },
    {
        " and was written by the ": null
    },
    {
        "Lombard": "Lombards"
    },
    {
        " historian ": null
    },
    {
        "Paul the Deacon": "Paul The Deacon"
    },
    {
        ". The first stanza is:     Ut queant laxis   resonare fibris,   Mira gestorum   famuli tuorum,   Solve polluti   labii reatum,   Sancte Iohannes.     Guido used the first syllable of each line, Ut, Re, Mi, Fa, Sol, La, and Si, to read notated music in terms of ": null
    },
    {
        "hexachords": "Guidonian Handhexachord In Middle Ages"
    },
    {
        "; they were not note names, and each could, depending on context, be applied to any note. In the 17th century, Ut was changed in most countries except France to the easily singable, open syllable Do, said to have been taken from the name of the Italian theorist ": null
    },
    {
        "Giovanni Battista Doni": "Giovanni Battista Doni"
    },
    {
        ",   but rather Do have been taken from the word Dominus in Latin with the meaning the Lord . McNaught 1893, 43.     Catholic monks developed the first forms of modern European musical notation in order to standardize liturgy throughout the worldwide Church, Hall, Neitz, and Battani 2003, p. 100. and an enormous body of religious music has been composed for it through the ages. This led directly to the emergence and development of European classical music, and its many derivatives. The ": null
    },
    {
        "Baroque": "Baroque"
    },
    {
        " style, which encompassed music, art, and architecture, was particularly encouraged by the post-Reformation Catholic Church as such forms offered a means of religious expression that was stirring and emotional, intended to stimulate religious fervor.                  Modern music notation is used by musicians of many different genres throughout the world. The staff acts as a framework upon which pitches are indicated by placing oval noteheads on the staff lines or between the lines. The pitch of the oval musical noteheads can be modified by ": null
    },
    {
        "accidentals": "Accidental"
    },
    {
        ". The duration is shown with different ": null
    },
    {
        "note value": "Note Value"
    },
    {
        "s, which can be indicated by the notehead being a stemless hollow oval , a hollow rectangle or stemless hollow oval with one or two vertical lines on either side , a stemmed hollow oval , or solid oval using stems to indicate ": null
    },
    {
        "quarter notes": "Quarter Note"
    },
    {
        " and stems with added flags or beams to indicate smaller subdivisions, and additional symbols such as ": null
    },
    {
        "dots": "Dotted Note"
    },
    {
        " and ": null
    },
    {
        "ties": "Tie"
    },
    {
        " which lengthen the duration of a note. Notation is read from left to right, which makes setting music for right-to-left scripts difficult.     A staff of written music generally begins with a ": null
    },
    {
        "clef": "Clef"
    },
    {
        ", which indicates the position of one particular note on the staff. The ": null
    },
    {
        "treble clef": "Treble Clef"
    },
    {
        " or G clef was originally a letter G and it identifies the second line up on the five line staff as the note G above middle C. The ": null
    },
    {
        "bass clef": "Bass Clef"
    },
    {
        " or F clef shows the position of the note F below middle C. While the treble and bass clef are the most widely used clefs, other clefs are used, such as the ": null
    },
    {
        "alto clef": "Alto Clef"
    },
    {
        "  and the ": null
    },
    {
        "tenor clef": "Tenor Clef"
    },
    {
        " . Notes representing a pitch outside of the scope of the five line staff can be represented using ": null
    },
    {
        "ledger line": "Ledger Line"
    },
    {
        "s, which provide a single note with additional lines and spaces. Some instruments use mainly one clef, such as violin and flute, which use ": null
    },
    {
        "treble clef": "Treble Clef"
    },
    {
        " and ": null
    },
    {
        "double bass": "Double Bass"
    },
    {
        " and ": null
    },
    {
        "tuba": "Tuba"
    },
    {
        ", which use ": null
    },
    {
        "bass clef": "Bass Clef"
    },
    {
        ". Some instruments regularly use both clefs, such as ": null
    },
    {
        "piano": "Piano"
    },
    {
        " and ": null
    },
    {
        "pipe organ": "Pipe Organ"
    },
    {
        ".     Following the clef, the ": null
    },
    {
        "key signature": "Key Signature"
    },
    {
        " on a staff indicates the ": null
    },
    {
        "key": "Key"
    },
    {
        " of the piece or song by specifying that certain notes are flat or sharp throughout the piece, unless otherwise indicated with ": null
    },
    {
        "accidentals": "Accidental"
    },
    {
        " added before certain notes. When a sharp is placed before a note, this makes that note one semitone higher. When a flat is placed before a note, this makes that note one semitone lower. ": null
    },
    {
        "Double sharps": "Double Sharp"
    },
    {
        "and ": null
    },
    {
        "double flats": "Double Flat"
    },
    {
        "are less common, but they are used. A double sharp is placed before a note to make it two semitones higher. A double flat is placed before a note to make it two semitones lower. A ": null
    },
    {
        "natural sign": "Natural Sign"
    },
    {
        " placed before a note renders that note in its natural form, which means that any sharps or flats applying to that note from the key signature or from accidentals are cancelled. Sometimes a ": null
    },
    {
        "courtesy accidental": "Courtesy Accidental"
    },
    {
        " is used in music where it is not technically required, to remind the musician of what pitch the key signature requires.     Following the key signature is the ": null
    },
    {
        "time signature": "Time Signature"
    },
    {
        ". The time signature typically consists of two numbers, with one of the most common being . The top 4 indicates that there are four beats per measure . The bottom 4 indicates that each of those beats are quarter notes. Measures divide the piece into groups of ": null
    },
    {
        "beats": "Beat"
    },
    {
        ", and the time signatures specify those groupings.  is used so often that it is also called ": null
    },
    {
        "common time": "Common Time"
    },
    {
        " , and it may be indicated with  rather than numbers. Other common time signatures are  ;  ;  and  . Many other time signatures exist, such as , , , , , and so on.     Many short ": null
    },
    {
        "classical music": "Classical Music"
    },
    {
        " pieces from the ": null
    },
    {
        "classical era": "Classical Period"
    },
    {
        " and songs from ": null
    },
    {
        "traditional music": "Traditional Music"
    },
    {
        " and ": null
    },
    {
        "popular music": "Popular Music"
    },
    {
        " are in one time signature for much or all of the piece. Music from the ": null
    },
    {
        "Romantic music": "Romantic Music"
    },
    {
        " era and later, particularly ": null
    },
    {
        "contemporary classical music": "Contemporary Classical Music"
    },
    {
        " and ": null
    },
    {
        "rock music": "Rock Music"
    },
    {
        " genres such as ": null
    },
    {
        "progressive rock": "Progressive Rock"
    },
    {
        " and the ": null
    },
    {
        "hardcore punk": "Hardcore Punk"
    },
    {
        " subgenre ": null
    },
    {
        "mathcore": "Mathcore"
    },
    {
        ", may use ": null
    },
    {
        "mixed meter": "Mixed Meter"
    },
    {
        "; songs or pieces change from one meter to another, for example alternating between bars of  and .     Directions to the player regarding matters such as ": null
    },
    {
        "tempo": "Tempo"
    },
    {
        " , ": null
    },
    {
        "dynamics": "Dynamics"
    },
    {
        " appear above or below the staff. Terms indicating the ": null
    },
    {
        "musical expression": "Musical Expression"
    },
    {
        " or feel to a song or piece are indicated at the beginning of the piece and at any points where the mood changes For vocal music, lyrics are written near the pitches of the melody. For short pauses , ": null
    },
    {
        "retakes": "Retake"
    },
    {
        " are added.     In music for ": null
    },
    {
        "ensembles": "Musical Ensemble"
    },
    {
        ", a ": null
    },
    {
        "score": "Sheet Music"
    },
    {
        " shows music for all players together, with the staves for the different instruments and/or voices stacked vertically. The ": null
    },
    {
        "conductor": "Conducting"
    },
    {
        " uses the score while leading an ": null
    },
    {
        "orchestra": "Orchestra"
    },
    {
        ", ": null
    },
    {
        "concert band": "Concert Band"
    },
    {
        ", ": null
    },
    {
        "choir": "Choir"
    },
    {
        " or other large ensemble. Individual performers in an ensemble play from parts which contain only the music played by an individual musician. A score can be constructed from a complete set of parts and vice versa. The process was laborious and time consuming when parts were hand-copied from the score, but since the development of ": null
    },
    {
        "scorewriter": "Scorewriter"
    },
    {
        " computer software in the 1980s, a score stored electronically can have parts automatically prepared by the program and quickly and inexpensively printed out using a computer printer.     A ": null
    },
    {
        "♭": "Flat"
    },
    {
        " in music lowers a pitch down one semitone. A ": null
    },
    {
        "♯": "Sharp"
    },
    {
        " in music raises a note one semitone. For example, a sharp on B would raise it to ": null
    },
    {
        "B♯": "B♯"
    },
    {
        " while a flat would lower it to ": null
    },
    {
        "B♭": "B♭"
    },
    {
        ".           ": null
    },
    {
        "Percussion notation": "Percussion Notation"
    },
    {
        " conventions are varied because of the wide range of percussion instruments. Percussion instruments are generally grouped into two categories: pitched  and non-pitched . The notation of non-pitched percussion instruments is less standardized. Pitched instruments use standard Western classical notation for the pitches and rhythms. In general, notation for unpitched percussion uses the five line staff, with different lines and spaces representing different ": null
    },
    {
        "drum kit": "Drum Kit"
    },
    {
        " instruments. Standard Western rhythmic notation is used to indicate the rhythm.   ": null
    },
    {
        "Figured bass": "Figured Bass"
    },
    {
        " notation originated in ": null
    },
    {
        "Baroque": "Baroque Music"
    },
    {
        " basso continuo": "Figured Bass"
    },
    {
        " parts. It is also used extensively in ": null
    },
    {
        "accordion": "Accordion"
    },
    {
        " notation. The bass notes of the music are conventionally notated, along with numbers and other signs that determine which chords the harpsichordist, organist or lutenist should improvise. It does not, however, specify the exact pitches of the harmony, leaving that for the performer to improvise.   A ": null
    },
    {
        "lead sheet": "Lead Sheet"
    },
    {
        " specifies only the melody, lyrics and harmony, using one staff with ": null
    },
    {
        "chord symbols": "Chord Notation"
    },
    {
        " placed above and lyrics below. It is used to capture the essential elements of a ": null
    },
    {
        "popular song": "Popular Music"
    },
    {
        " without specifying how the song should be arranged or performed.   A ": null
    },
    {
        "chord chart": "Chord Chart"
    },
    {
        " or chart contains little or no melodic or voice-leading information at all, but provides basic harmonic information about the ": null
    },
    {
        "chord progression": "Chord Progression"
    },
    {
        ". Some chord charts also contain rhythmic information, indicated using ": null
    },
    {
        "slash notation": "Slash Notation"
    },
    {
        " for full beats and rhythmic notation for rhythms. This is the most common kind of written music used by professional ": null
    },
    {
        "session musicians": "Session Musician"
    },
    {
        "playing ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " or other forms of ": null
    },
    {
        "popular music": "List Of Popular Music Genres"
    },
    {
        " and is intended primarily for the ": null
    },
    {
        "rhythm section": "Rhythm Section"
    },
    {
        " .   Simpler chord charts for songs may contain only the chord changes, placed above the lyrics where they occur. Such charts depend on prior knowledge of the melody, and are used as reminders in performance or informal ": null
    },
    {
        "group singing": "Group Singing"
    },
    {
        ". Some chord charts intended for ": null
    },
    {
        "rhythm section": "Rhythm Section"
    },
    {
        " accompanists contain only the chord progression.   The ": null
    },
    {
        "shape note": "Shape Note"
    },
    {
        " system is found in some church hymnals, ": null
    },
    {
        "sheet music": "Sheet Music"
    },
    {
        ", and song books, especially in the ": null
    },
    {
        "Southern United States": "Southern United States"
    },
    {
        ". Instead of the customary elliptical note head, note heads of various shapes are used to show the position of the note on the major scale. ": null
    },
    {
        "Sacred Harp": "Sacred Harp"
    },
    {
        " is one of the most popular tune books using shape notes.              Jeongganbo is a unique traditional musical notation system created during the time of ": null
    },
    {
        "Sejong the Great": "Sejong The Great"
    },
    {
        " that was the first East Asian system to represent rhythm, pitch, and time. Gnanadesikan 2011, .  Among various kinds of Korean traditional music, Jeong-gan-bo targets a particular genre, Jeong-ak .     Jeong-gan-bo tells the pitch by writing the pitchs name down in a box called jeong-gan . One jeong-gan is one beat each, and it can be split into two, three or more to hold half beats and quarter beats, and more. This makes it easy for the reader to figure out the beat.     Also, there are lots of markings indicating things such as ornaments. Most of these were later created by Ki-su Kim.             The Indian scholar and musical theorist ": null
    },
    {
        "Pingala": "Pingala"
    },
    {
        " , in his Chanda Sutra, used marks indicating long and short syllables to indicate meters in Sanskrit poetry.     A rock inscription from circa 7th–8th century CE at ": null
    },
    {
        "Kudumiyanmalai": "Kudumiyanmalai"
    },
    {
        ", Tamil Nadu contains an early example of a musical notation. It was first identified and published by archaeologist/epigraphist ": null
    },
    {
        "D. R. Bhandarkar": "D. R. Bhandarkar"
    },
    {
        " Bhandarkar, D. R Epigraphia Indica . Written in the Pallava-grantha script of the 7th century, it contains 38 horizontal lines of notations inscribed on a rectangular rock face . Each line of the notation contains 64 characters , written in groups of four notes. The basic characters for the seven notes, sa ri ga ma pa dha ni, are seen to be suffixed with the vowels a, i, u ,e. For example, in the place of sa, any one of sa, si, su or se is used. Similarly, in place of ri, any one of ra, ri, ru or re is used. Horizontal lines divide the notation into 7 sections. Each section contains 4 to 7 lines of notation, with a title indicating its musical mode. These modes may have been popular atleast from the 6th century CE and were incorporated into the Indian raga system that developed later. But some of the unusual features seen in this notation have been given several non-conclusive interpretations by scholars. Widdess, D. R , The Kudumiyamalai inscription: a source of early Indian music in notation – Musica Asiatica 2, Oxford University Press .     In the notation of Indian ": null
    },
    {
        "rāga": "Rāga"
    },
    {
        ", a solfege-like system called ": null
    },
    {
        "sargam": "Swara"
    },
    {
        " is used. As in Western solfege, there are names for the seven basic pitches of a major scale . The tonic of any scale is named Sa, and the dominant Pa. Sa is fixed in any scale, and Pa is fixed at a fifth above it . These two notes are known as achala swar .     Each of the other five notes, Re, Ga, Ma, Dha and Ni, can take a regular pitch, which is equivalent to its pitch in a standard major scale , or an altered pitch, either a half-step above or half-step below the shuddha pitch. Re, Ga, Dha and Ni all have altered partners that are a half-step lower .     Ma has an altered partner that is a half-step higher . Re, Ga, Ma, Dha and Ni are called vikrut swar . In the written system of Indian notation devised by Ravi Shankar, the pitches are represented by Western letters. Capital letters are used for the achala swar, and for the higher variety of all the vikrut swar. Lowercase letters are used for the lower variety of the vikrut swar.     Other systems exist for non-twelve-tone ": null
    },
    {
        "equal temperament": "Equal Temperament"
    },
    {
        " and non-Western music, such as the Indian  Swaralipi .                Znamenny Chant is a singing tradition used in the ": null
    },
    {
        "Russia": "Russia"
    },
    {
        "n ": null
    },
    {
        "Orthodox Church": "Orthodox Church"
    },
    {
        " which uses a hook and banner notation. Znamenny Chant is ": null
    },
    {
        "unison": "Unison"
    },
    {
        ", ": null
    },
    {
        "melisma": "Melisma"
    },
    {
        "tic ": null
    },
    {
        "liturgical": "Liturgy"
    },
    {
        " singing that has its own specific notation, called the stolp notation. The symbols used in the stolp notation are called   or  . Often the names of the signs are used to refer to the stolp notation. Znamenny melodies are part of a system, consisting of Eight Modes ; the melodies are characterized by fluency and well-balancedness. There exist several types of Znamenny Chant: the so-called Stolpovoy, Malyj and Bolshoy Znamenny Chant. Ruthenian Chant  is sometimes considered a sub-division of the Znamenny Chant tradition, with the ": null
    },
    {
        "Muscovite": "Grand Duchy Of Moscow"
    },
    {
        " Chant being the second branch of the same musical continuum.     Znamenny Chants are not written with notes , but with special signs, called Znamëna or Kryuki , as some shapes of these signs resemble hooks. Each sign may include the following components: a large black hook or a black stroke, several smaller black points and commas and lines near the hook or crossing the hook. Some signs may mean only one note, some 2 to 4 notes, and some a whole melody of more than 10 notes with a complicated rhythmic structure. The stolp notation was developed in ": null
    },
    {
        "Kievan Rus": "Kievan Rus"
    },
    {
        " as an ": null
    },
    {
        "East Slavic": "East Slavs"
    },
    {
        " refinement of the ": null
    },
    {
        "Byzantine": "Byzantine Music"
    },
    {
        " neumatic": "Neumatic"
    },
    {
        " musical notation.     The most notable feature of this notation system is that it records transitions of the melody, rather than ": null
    },
    {
        "note": "Musical Note"
    },
    {
        "s. The signs also represent a mood and a gradation of how this part of melody is to be sung Every sign has its own name and also features as a spiritual symbol. For example, there is a specific sign, called little dove , which represents two rising sounds, but which is also a symbol of the ": null
    },
    {
        "Holy Ghost": "Holy Ghost"
    },
    {
        ". Gradually the system became more and more complicated. This system was also ambiguous, so that almost no one, except the most trained and educated singers, could sing an unknown melody at sight. The signs only helped to reproduce the melody, not coding it in an unambiguous way.                  The earliest known examples of text referring to music in China are inscriptions on musical instruments found in the Tomb of ": null
    },
    {
        "Marquis": "Marquess"
    },
    {
        " Yi of Zeng . Sets of 41 chimestones and 65 bells bore lengthy inscriptions concerning pitches, scales, and transposition. The bells still sound the pitches that their inscriptions refer to. Although no notated musical compositions were found, the inscriptions indicate that the system was sufficiently advanced to allow for musical notation. Two systems of pitch nomenclature existed, one for relative pitch and one for absolute pitch. For relative pitch, a ": null
    },
    {
        "solmization": "Solmization"
    },
    {
        " system was used.  .     ": null
    },
    {
        "Gongche notation": "Gongche Notation"
    },
    {
        " used Chinese characters for the names of the scale.             Japanese music is highly diversified, and therefore requires various systems of notation. In Japanese ": null
    },
    {
        "shakuhachi": "Shakuhachi"
    },
    {
        " music, for example, glissandos and timbres are often more significant than distinct pitches, whereas ": null
    },
    {
        "taiko": "Taiko"
    },
    {
        " notation focuses on discrete strokes.     ": null
    },
    {
        "Ryukyuan": "Ryukyu Islands"
    },
    {
        " sanshin": "Sanshin"
    },
    {
        " music uses ": null
    },
    {
        "kunkunshi": "Kunkunshi"
    },
    {
        ", a notation system of ": null
    },
    {
        "kanji": "Kanji"
    },
    {
        " with each character corresponding to a finger position on a particular string.             Notation plays a relatively minor role in the oral traditions of ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        ". However, in ": null
    },
    {
        "Java": "Java"
    },
    {
        " and ": null
    },
    {
        "Bali": "Bali"
    },
    {
        ", several systems were devised beginning at the end of the 19th century, initially for archival purposes. Today the most widespread are cipher notations in which the pitches are represented with some subset of the numbers 1 to 7, with 1 corresponding to either highest note of a particular octave, as in ": null
    },
    {
        "Sundanese": "Sundanese Script"
    },
    {
        " gamelan": "Gamelan"
    },
    {
        ", or lowest, as in the ": null
    },
    {
        "kepatihan notation": "Kepatihan Notation"
    },
    {
        " of ": null
    },
    {
        "Java": "Java"
    },
    {
        "nese ": null
    },
    {
        "gamelan": "Gamelan"
    },
    {
        ".     Notes in the ranges outside the central octave are represented with one or more dots above or below the each number. For the most part, these cipher notations are mainly used to notate the skeletal melody  and vocal parts , although transcriptions of the elaborating instrument variations are sometimes used for analysis and teaching. Drum parts are notated with a system of symbols largely based on letters representing the vocables used to learn and remember drumming patterns; these symbols are typically laid out in a grid underneath the skeletal melody for a specific or generic piece.     The symbols used for drum notation are highly variable from place to place and performer to performer. In addition to these current systems, two older notations used a kind of staff: the ": null
    },
    {
        "Solo": "Surakarta"
    },
    {
        "nese script could capture the flexible rhythms of the ": null
    },
    {
        "pesinden": "Sindhen"
    },
    {
        " with a squiggle on a horizontal staff, while in ": null
    },
    {
        "Yogyakarta": "Yogyakarta"
    },
    {
        " a ladder-like vertical staff allowed notation of the balungan by dots and also included important drum strokes. In Bali, there are a few books published of ": null
    },
    {
        "Gamelan gender wayang": "Gamelan Gender Wayang"
    },
    {
        " pieces, employing alphabetical notation in the old Balinese script.     Composers and scholars both Indonesian and foreign have also mapped the ": null
    },
    {
        "slendro": "Slendro"
    },
    {
        " and ": null
    },
    {
        "pelog": "Pelog"
    },
    {
        " tuning": "Musical Tuning"
    },
    {
        " systems of gamelan onto the western staff, with and without various symbols for ": null
    },
    {
        "microtones": "Microtonal Music"
    },
    {
        ". The Dutch composer ": null
    },
    {
        "Ton de Leeuw": "Ton De Leeuw"
    },
    {
        " also invented a three line staff for his composition Gending. However, these systems do not enjoy widespread use.     In the second half of the twentieth century, Indonesian musicians and scholars extended cipher notation to other oral traditions, and a ": null
    },
    {
        "diatonic scale": "Diatonic And Chromatic"
    },
    {
        " cipher notation has become common for notating western-related genres . Unlike the cipher notation for gamelan music, which uses a fixed Do , Indonesian diatonic cipher notation is moveable-Do notation, so scores must indicate which pitch corresponds to the number 1 .       Image:Surakarta gamelan notation slendro.png|A short melody in slendro notated using the Surakarta method. Lindsay 1992, 43–45.   Image:Yogyakarta gamelan notation slendro.png|The same notated using the Yogyakarta method or chequered notation.   Image:Kepatihan gamelan notation slendro.png|The same notated using Kepatihan notation.   Image:Western gamelan notation slendro.png|The same approximated using Western notation.                 In pitch bracket notation music is written with melody lines and pitch brackets. Melody lines are like staff lines except they can change pitch by writing pitch brackets on them. Pitch brackets add or subtract scale steps to the melody line. The shape of the bracket , determines the number of scale steps to add. The direction of the bracket, opening or closing, determines whether to add or subtract scale steps. As a result of the mathematical nature of pitch bracket notation, arithmetic and algebra can be directly applied to the notation. Musical variations can be mathematically generated from their themes.          Cipher notation systems assigning Arabic numerals to the ": null
    },
    {
        "major scale": "Major Scale"
    },
    {
        " degrees have been used at least since the Iberian organ tablatures of the 16th-century and include such exotic adaptations as  Siffernotskrift . The one most widely in use today is the Chinese Jianpu, discussed in the ": null
    },
    {
        "main article": "Numbered Musical Notation"
    },
    {
        ". Numerals can of course also be assigned to different scale systems, as in the Javanese  kepatihan  notation ": null
    },
    {
        "described above": "Musical Notationindonesia"
    },
    {
        ".          Solfège is a way of assigning syllables to names of the musical scale. In order, they are today: Do Re Mi Fa Sol La Ti Do . The classic variation is: Do Re Mi Fa Sol La Si Do. The first Western system of functional names for the musical notes was introduced by ": null
    },
    {
        "Guido of Arezzo": "Guido Of Arezzo"
    },
    {
        " , using the beginning syllables of the first six musical lines of the Latin hymn ": null
    },
    {
        "Ut queant laxis": "Ut Queant Laxis"
    },
    {
        ". The original sequence was Ut Re Mi Fa Sol La, where each verse started a scale note higher. Ut later became Do . The equivalent syllables used in Indian music are: Sa Re Ga Ma Pa Dha Ni. See also: ": null
    },
    {
        "solfège": "Solfège"
    },
    {
        ", ": null
    },
    {
        "sargam": "Swara"
    },
    {
        ", ": null
    },
    {
        "Kodály hand signs": "Kodály Methodhand Signs"
    },
    {
        ".     ": null
    },
    {
        "Tonic sol-fa": "Tonic Sol-Fa"
    },
    {
        " is a type of notation using the initial letters of solfège.          The notes of the 12-tone scale can be written by their letter names A–G, possibly with a trailing sharp or flat symbol, such as A or B.          Tablature was first used in the ": null
    },
    {
        "Middle Ages": "Medieval Music"
    },
    {
        " for organ music and later in the ": null
    },
    {
        "Renaissance": "Renaissance Music"
    },
    {
        " for ": null
    },
    {
        "lute": "Lute"
    },
    {
        " music. Apel 1961, xxiii and 22. In most lute tablatures, a staff is used, but instead of pitch values, the lines of the staff represent the strings of the instrument. The ": null
    },
    {
        "frets": "Fret"
    },
    {
        "to finger are written on each line, indicated by letters or numbers. Rhythm is written separately with one or another variation of standard note values indicating the duration of the fastest moving part. Few seem to have remarked on the fact that tablature combines in one notation system both the physical and technical requirements of play with the unfolding of the music itself . In later periods, lute and guitar music was written with standard notation. Tablature caught interest again in the late 20th century for popular ": null
    },
    {
        "guitar": "Guitar"
    },
    {
        " music and other fretted instruments, being easy to transcribe and share over the internet in ": null
    },
    {
        "ASCII format": "Ascii Tab"
    },
    {
        ". Websites like ": null
    },
    {
        "OLGA": "Tablatureolga.Net"
    },
    {
        "   have archives of text-based popular music tablature.          Klavarskribo  is a music notation system that was introduced in 1931 by the ": null
    },
    {
        "Dutchman": "Netherlands"
    },
    {
        " Cornelis Pot. The name means keyboard writing in ": null
    },
    {
        "Esperanto": "Esperanto"
    },
    {
        ". It differs from conventional music notation in a number of ways and is intended to be easily readable. Many klavar readers are from the Netherlands.       Some chromatic systems have been created taking advantage of the layout of black and white keys of the standard piano keyboard. The staff is most widely referred to as piano roll , created by extending the black and white piano keys.       Over the past three centuries, hundreds of music notation systems have been proposed as alternatives to traditional western music notation. Many of these systems seek to improve upon traditional notation by using a chromatic staff in which each of the 12 pitch classes has its own unique place on the staff. Examples are the Ailler-Brennink notation, Jacques-Daniel Rochats ": null
    },
    {
        "Dodeka music notation": "Dodeka Music Notation"
    },
    {
        "   , Tom Reeds Twinline notation, Russell Ambroses Ambrose Piano Tabs,  Paul Morris Clairnote,  John Kellers Express Stave, and José A. Sotorrios Bilinear Music Notation. These notation systems do not require the use of standard key signatures, accidentals, or clef signs. They also represent interval relationships more consistently and accurately than traditional notation. The Music Notation Project has a website with information on many of these notation systems.           The term graphic notation refers to the contemporary use of non-traditional symbols and text to convey information about the performance of a piece of music. Practitioners include ": null
    },
    {
        "Christian Wolff": "Christian Wolff"
    },
    {
        ", ": null
    },
    {
        "Earle Brown": "Earle Brown"
    },
    {
        ", ": null
    },
    {
        "Anthony Braxton": "Anthony Braxton"
    },
    {
        ", ": null
    },
    {
        "John Cage": "John Cage"
    },
    {
        ", ": null
    },
    {
        "Morton Feldman": "Morton Feldman"
    },
    {
        ", ": null
    },
    {
        "Krzysztof Penderecki": "Krzysztof Penderecki"
    },
    {
        ", ": null
    },
    {
        "Cornelius Cardew": "Cornelius Cardew"
    },
    {
        ", and ": null
    },
    {
        "Roger Reynolds": "Roger Reynolds"
    },
    {
        ". See Notations, edited by John Cage and Alison Knowles, .          ": null
    },
    {
        "Simplified Music Notation": "Simplified Music Notation"
    },
    {
        " is an alternative form of musical notation designed to make ": null
    },
    {
        "sight-reading": "Sight Reading"
    },
    {
        " easier. It is based on ": null
    },
    {
        "classical staff notation": "Modern Musical Symbols"
    },
    {
        ", but incorporates ": null
    },
    {
        "sharps": "Sharp"
    },
    {
        " and ": null
    },
    {
        "flats": "Flat"
    },
    {
        " into the shape of the ": null
    },
    {
        "note heads": "Note Heads"
    },
    {
        ". ": null
    },
    {
        "Notes": "Musical Note"
    },
    {
        "such as ": null
    },
    {
        "double sharps": "Sharp"
    },
    {
        " and ": null
    },
    {
        "double flats": "Flat"
    },
    {
        " are written at the ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        " they are actually played at, but preceded by ": null
    },
    {
        "symbols": "Symbol"
    },
    {
        "called history signs that show they have been ": null
    },
    {
        "transposed": "Transposition"
    },
    {
        ".          ": null
    },
    {
        "Modified Stave Notation": "Modified Stave Notation"
    },
    {
        " is an alternative way of notating music for people who cannot easily read ordinary musical notation even if it is enlarged.          Parsons code is used to encode music so that it can be easily searched.          Braille music is a complete, well developed, and internationally accepted musical notation system that has symbols and notational conventions quite independent of print music notation. It is linear in nature, similar to a printed language and different from the two-dimensional nature of standard printed music notation. To a degree Braille music resembles musical markup languages  such as ": null
    },
    {
        "MusicXML": "Musicxml"
    },
    {
        "   or ": null
    },
    {
        "NIFF": "Notation Interchange File Format"
    },
    {
        ".       In ": null
    },
    {
        "integer notation": "Integer Notation"
    },
    {
        ", or the ": null
    },
    {
        "integer": "Integer"
    },
    {
        " model of pitch, all ": null
    },
    {
        "pitch class": "Pitch Class"
    },
    {
        "es and ": null
    },
    {
        "intervals": "Interval"
    },
    {
        "between pitch classes are designated using the numbers 0 through 11.       The standard form of rap notation is the flow diagram , where rappers line up their lyrics underneath beat numbers . Edwards 2009, 67. Hip-hop scholars also make use of the same flow diagrams that rappers use: the books How to Rap and How to Rap 2 extensively use the diagrams to explain raps triplets, flams, rests, rhyme schemes, runs of rhyme, and breaking rhyme patterns, among other techniques. Edwards 2013, 53. Similar systems are used by musicologists Adam Krims in his book Rap Music and the Poetics of Identity Krims 2001, 59–60. and Kyle Adams in his work on raps flow. Adams 2009. As rap revolves around a strong 4/4 beat, Edwards 2009, 69. with certain syllables aligned to the beat, all the notational systems have a similar structure: they all have four beat numbers at the top of the diagram, so that syllables can be written in-line with the beat.            Many computer programs have been developed for creating music notation . Music may also be stored in various digital file formats for purposes other than graphic notation output.       According to Philip Tagg and ": null
    },
    {
        "Richard Middleton": "Richard Middleton"
    },
    {
        ", musicology and to a degree European-influenced musical practice suffer from a notational centricity, a methodology slanted by the characteristics of notation. Tagg 1979, 28–32; Middleton 1990, 104–6. A variety of 20th- and 21st-century composers have dealt with this problem, either by adapting standard Western musical notation or by using graphic notation. These include ": null
    },
    {
        "George Crumb": "George Crumb"
    },
    {
        ", ": null
    },
    {
        "Luciano Berio": "Luciano Berio"
    },
    {
        ", ": null
    },
    {
        "Krzystof Penderecki": "Krzystof Penderecki"
    },
    {
        ", ": null
    },
    {
        "Earl Brown": "Earle Brown"
    },
    {
        ", ": null
    },
    {
        "John Cage": "John Cage"
    },
    {
        ", ": null
    },
    {
        "Witold Lutoslawski": "Witold Lutoslawski"
    },
    {
        ", and others. Pierce 1973, . Cogan 1976, ": null
    }
]