[
    {
        "               Music is an art form and ": null
    },
    {
        "cultural": "Culture"
    },
    {
        " activity whose medium is sound organized in time. General ": null
    },
    {
        "definitions of music": "Definitions Of Music"
    },
    {
        " include common elements such as ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        " , ": null
    },
    {
        "rhythm": "Rhythm"
    },
    {
        " , ": null
    },
    {
        "dynamics": "Dynamics"
    },
    {
        " , and the sonic qualities of ": null
    },
    {
        "timbre": "Timbre"
    },
    {
        " and ": null
    },
    {
        "texture": "Texture"
    },
    {
        " . Different ": null
    },
    {
        "styles or types": "Music Genre"
    },
    {
        " of music may emphasize, de-emphasize or omit some of these elements. Music is performed with a vast range of ": null
    },
    {
        "instruments": "Musical Instrument"
    },
    {
        " and vocal techniques ranging from singing to ": null
    },
    {
        "rapping": "Rapping"
    },
    {
        "; there are solely ": null
    },
    {
        "instrumental pieces": "Instrumental Music"
    },
    {
        ", ": null
    },
    {
        "solely vocal pieces": "A Capella"
    },
    {
        "  and pieces that combine singing and instruments. The word derives from ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " μουσική": "Wikt:Μουσικήancient Greek"
    },
    {
        " .    See ": null
    },
    {
        "glossary of musical terminology": "Glossary Of Musical Terminology"
    },
    {
        ".     In its most general form, the activities describing music as an art form or ": null
    },
    {
        "cultural": "Culture"
    },
    {
        " activity include the creation of works of music , the ": null
    },
    {
        "criticism of music": "Music Criticism"
    },
    {
        ", the ": null
    },
    {
        "study of the history of music": "Musicology"
    },
    {
        ", and the ": null
    },
    {
        "aesthetic examination of music": "Aesthetics Of Music"
    },
    {
        ". ": null
    },
    {
        "Ancient Greek": "Greek Philosophy"
    },
    {
        " and ": null
    },
    {
        "Indian philosophers": "Ancient Philosophyancient Indian Philosophers"
    },
    {
        " defined music as tones ordered horizontally as melodies and vertically as harmonies. Common sayings such as the ": null
    },
    {
        "harmony of the spheres": "Harmony Of The Spheres"
    },
    {
        " and it is music to my ears point to the notion that music is often ordered and pleasant to listen to. However, 20th-century composer ": null
    },
    {
        "John Cage": "John Cage"
    },
    {
        " thought that any sound can be music, saying, for example, There is no ": null
    },
    {
        "noise": "Noise"
    },
    {
        ", only sound.      The creation, performance, significance, and even the definition of music vary according to culture and social context. Indeed, throughout history, some new forms or styles of music have been criticized as not being music , including ": null
    },
    {
        "Beethovens": "Ludwig Van Beethoven"
    },
    {
        "  Grosse Fuge  ": null
    },
    {
        "string quartet": "String Quartet"
    },
    {
        " in 1825, Watson 2009, 109–10. early ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " in the beginning of the 1900s Reiland Rabaka. Hip Hops Amnesia: From Blues and the Black Womens Club Movement to Rap and the Hip Hop Movement . Lexington Books, 2012. p. 103 and ": null
    },
    {
        "hardcore punk": "Hardcore Punk"
    },
    {
        " in the 1980s. Manabe, Noriko. The Revolution Will Not Be Televised: Protest Music After Fukushima. Oxford University Press, 2015. p. 163. There are many types of music, including ": null
    },
    {
        "popular music": "Popular Music"
    },
    {
        ", ": null
    },
    {
        "traditional music": "Traditional Music"
    },
    {
        ", ": null
    },
    {
        "art music": "Art Music"
    },
    {
        ", ": null
    },
    {
        "music written for religious ceremonies": "Liturgical Music"
    },
    {
        " and ": null
    },
    {
        "work songs": "Work Song"
    },
    {
        "such as ": null
    },
    {
        "chantey": "Chantey"
    },
    {
        "s. Music ranges from strictly organized compositions–such as Classical music symphonies from the 1700s and 1800s, through to spontaneously played ": null
    },
    {
        "improvisational music": "Musical Improvisation"
    },
    {
        " such as ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        ", and ": null
    },
    {
        "avant-garde": "Avant-Garde"
    },
    {
        " styles of ": null
    },
    {
        "chance-based": "Aleatory"
    },
    {
        " contemporary music": "Contemporary Music"
    },
    {
        " from the 20th and 21st centuries.     Music can be divided into ": null
    },
    {
        "genres": "Music Genre"
    },
    {
        "  and genres can be further divided into ": null
    },
    {
        "subgenres": "Subgenre"
    },
    {
        " , although the dividing lines and relationships between music genres are often subtle, sometimes open to personal interpretation, and occasionally controversial. For example, it can be hard to draw the line between some early 1980s ": null
    },
    {
        "hard rock": "Hard Rock"
    },
    {
        " and ": null
    },
    {
        "heavy metal": "Heavy Metal Music"
    },
    {
        ". Within ": null
    },
    {
        "the arts": "The Arts"
    },
    {
        ", music may be classified as a ": null
    },
    {
        "performing art": "Performing Arts"
    },
    {
        ", a fine art or as an auditory art. Music may be played or sung and heard live at a ": null
    },
    {
        "rock concert": "Rock Concert"
    },
    {
        " or orchestra performance, heard live as part of a ": null
    },
    {
        "dramatic work": "Theatre Music"
    },
    {
        " , or it may be recorded and listened to on a radio, MP3 player, ": null
    },
    {
        "CD player": "Cd Player"
    },
    {
        ", ": null
    },
    {
        "smartphone": "Smartphone"
    },
    {
        " or as ": null
    },
    {
        "film score": "Film Score"
    },
    {
        " or TV show.     In many cultures, music is an important part of peoples way of life, as it plays a key role in ": null
    },
    {
        "religious ritual": "Religious Ritual"
    },
    {
        "s, ": null
    },
    {
        "rite of passage": "Rite Of Passage"
    },
    {
        " ceremonies , social activities  and cultural activities ranging from amateur ": null
    },
    {
        "karaoke": "Karaoke"
    },
    {
        " singing to playing in an amateur ": null
    },
    {
        "funk band": "Funk"
    },
    {
        " or singing in a community ": null
    },
    {
        "choir": "Choir"
    },
    {
        ". People may make music as a hobby, like a teen playing cello in a ": null
    },
    {
        "youth orchestra": "Youth Orchestra"
    },
    {
        ", or work as a professional musician or singer. The ": null
    },
    {
        "music industry": "Music Industry"
    },
    {
        " includes the individuals who create new songs and musical pieces , individuals who perform music , individuals who record music , individuals who organize concert tours, and individuals who sell recordings, ": null
    },
    {
        "sheet music": "Sheet Music"
    },
    {
        ", and scores to customers.          The word derives from ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " μουσική": "Wikt:Μουσικήancient Greek"
    },
    {
        " . In ": null
    },
    {
        "Greek mythology": "Greek Mythology"
    },
    {
        ", the nine ": null
    },
    {
        "Muses": "Muse"
    },
    {
        "were the goddesses who inspired literature, science, and ": null
    },
    {
        "the arts": "The Arts"
    },
    {
        " and who were the source of the knowledge embodied in the poetry, song-lyrics, and myths in the Greek culture. According to the Online Etymological Dictionary, the term music is derived from mid-13c., musike, from ": null
    },
    {
        "Old French": "Old French"
    },
    {
        " musique and directly from ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " musica the art of music, also including poetry . This is derived from the ...Greek mousike  of the Muses, from fem. of mousikos pertaining to the Muses, from Mousa Muse . Modern spelling from 1630s. In ": null
    },
    {
        "classical Greece": "Classical Greece"
    },
    {
        ", any art in which the Muses presided, but especially music and ": null
    },
    {
        "lyric poetry": "Lyric Poetry"
    },
    {
        ".           Music is composed and performed for many purposes, ranging from aesthetic pleasure, religious or ceremonial purposes, or as an entertainment product for the marketplace. When music was only available through ": null
    },
    {
        "sheet music": "Sheet Music"
    },
    {
        " scores, such as during the Classical and Romantic eras, music lovers would buy the ": null
    },
    {
        "sheet music": "Sheet Music"
    },
    {
        " of their favourite pieces and songs so that they could perform them at home on the piano. With the advent of sound recording, records of popular songs, rather than sheet music became the dominant way that music lovers would enjoy their favourite songs. With the advent of home ": null
    },
    {
        "tape recorders": "Tape Recorder"
    },
    {
        "in the 1980s and ": null
    },
    {
        "digital music": "Digital Music"
    },
    {
        " in the 1990s, music lovers could make tapes or ": null
    },
    {
        "playlists": "Playlist"
    },
    {
        "of their favourite songs and take them with them on a ": null
    },
    {
        "portable cassette player": "Cassette Player"
    },
    {
        " or MP3 player. Some music lovers create ": null
    },
    {
        "mix tapes": "Mix Tape"
    },
    {
        "of their favorite songs, which serve as a self-portrait, a gesture of friendship, prescription for an ideal party... an environment consisting solely of what is most ardently loved. Kirszner, Laurie G. . Patterns for College Writing. Bedford/St. Martins. p. 520.      Amateur musicians can compose or perform music for their own pleasure, and derive their income elsewhere. ": null
    },
    {
        "Professional musicians": "Professional Musician"
    },
    {
        "are employed by a range of institutions and organisations, including armed forces , churches and synagogues, symphony orchestras, broadcasting or ": null
    },
    {
        "film production": "Filmmaking"
    },
    {
        " companies, and ": null
    },
    {
        "music school": "Music School"
    },
    {
        "s. Professional musicians sometimes work as freelancers or ": null
    },
    {
        "session musician": "Session Musician"
    },
    {
        "s, seeking contracts and engagements in a variety of settings. There are often many links between amateur and professional musicians. Beginning amateur musicians take ": null
    },
    {
        "lessons": "Music Lesson"
    },
    {
        " with professional musicians. In community settings, advanced amateur musicians perform with professional musicians in a variety of ensembles such as community ": null
    },
    {
        "concert bands": "Concert Band"
    },
    {
        "and community orchestras.     A distinction is often made between music performed for a live audience and music that is performed in a studio so that it can be recorded and distributed through the music retail system or the broadcasting system. However, there are also many cases where a live performance in front of an audience is also recorded and distributed. Live concert recordings are popular in both classical music and in ": null
    },
    {
        "popular music": "Popular Music"
    },
    {
        " forms such as rock, where ": null
    },
    {
        "illegally taped live concerts": "Bootleg Recording"
    },
    {
        " are prized by music lovers. In the ": null
    },
    {
        "jam band": "Jam Band"
    },
    {
        " scene, live, improvised ": null
    },
    {
        "jam sessions": "Jam Session"
    },
    {
        "are preferred to studio recordings.                Composition is the act or practice of creating a song, an ": null
    },
    {
        "instrumental music": "Instrumental Music"
    },
    {
        " piece, a work with both singing and instruments, or another type of music. In many cultures, including Western classical music, the act of composing also includes the creation of ": null
    },
    {
        "music notation": "Music Notation"
    },
    {
        ", such as a ": null
    },
    {
        "sheet music score ": "Sheet Music"
    },
    {
        ", which is then performed by the composer or by other singers or musicians. In popular music and traditional music, the act of composing, which is typically called songwriting, may involve the creation of a basic outline of the song, called the ": null
    },
    {
        "lead sheet": "Lead Sheet"
    },
    {
        ", which sets out the ": null
    },
    {
        "melody": "Melody"
    },
    {
        ", ": null
    },
    {
        "lyrics": "Lyrics"
    },
    {
        " and ": null
    },
    {
        "chord progression": "Chord Progression"
    },
    {
        ". In classical music, the composer typically ": null
    },
    {
        "orchestrates": "Orchestration"
    },
    {
        " his or her own compositions, but in musical theatre and in pop music, songwriters may hire an arranger to do the orchestration. In some cases, a songwriter may not use notation at all, and instead compose the song in her mind and then play or record it from memory. In jazz and popular music, notable recordings by influential performers are given the weight that written scores play in classical music.     Even when music is notated relatively precisely, as in classical music, there are many decisions that a performer has to make, because notation does not specify all of the elements of music precisely. The process of deciding how to perform music that has been previously composed and notated is termed interpretation . Different performers interpretations of the same work of music can vary widely, in terms of the tempos that are chosen and the playing or singing style or ": null
    },
    {
        "phrasing": "Musical Phrasing"
    },
    {
        " of the melodies. Composers and songwriters who present their own music are interpreting their songs, just as much as those who perform the music of others. The standard body of choices and techniques present at a given time and a given place is referred to as ": null
    },
    {
        "performance practice": "Historically Informed Performance"
    },
    {
        ", whereas interpretation is generally used to mean the individual choices of a performer.     Although a musical composition often uses ": null
    },
    {
        "musical notation": "Musical Notation"
    },
    {
        " and has a single author, this is not always the case. A work of music can have multiple composers, which often occurs in ": null
    },
    {
        "popular music": "Popular Music"
    },
    {
        " when a band collaborates to write a song, or in musical theatre, when one person writes the melodies, a second person writes the lyrics, and a third person orchestrates the songs. In some styles of music, such as the ": null
    },
    {
        "blues": "Blues"
    },
    {
        ", a composer/songwriter may create, perform and record new songs or pieces without ever writing them down in music notation. A piece of music can also be composed with words, images, or computer programs that explain or notate how the singer or musician should create musical sounds. Examples range from avant-garde music that uses ": null
    },
    {
        "graphic notation": "Graphic Notation"
    },
    {
        ", to text compositions such as  Aus den sieben Tagen , to computer programs that select sounds for musical pieces. Music that makes heavy use of randomness and chance is called ": null
    },
    {
        "aleatoric music": "Aleatoric Music"
    },
    {
        ", and is associated with contemporary composers active in the 20th century, such as ": null
    },
    {
        "John Cage": "John Cage"
    },
    {
        ", ": null
    },
    {
        "Morton Feldman": "Morton Feldman"
    },
    {
        ", and ": null
    },
    {
        "Witold Lutosławski": "Witold Lutosławski"
    },
    {
        ". A more commonly known example of chance-based music is the sound of ": null
    },
    {
        "wind chimes": "Wind Chimes"
    },
    {
        " jingling in a breeze.     The study of composition has traditionally been dominated by examination of methods and practice of Western classical music, but the definition of composition is broad enough to include the creation of ": null
    },
    {
        "popular music": "Popular Music"
    },
    {
        " and ": null
    },
    {
        "traditional music": "Traditional Music"
    },
    {
        " songs and instrumental pieces as well as spontaneously ": null
    },
    {
        "improvised": "Music Improvisation"
    },
    {
        " works like those of ": null
    },
    {
        "free jazz": "Free Jazz"
    },
    {
        " performers and African percussionists such as ": null
    },
    {
        "Ewe drummers": "Ewe Drumming"
    },
    {
        ".             In the 2000s, music notation typically means the written expression of music notes and rhythms on paper using symbols. When music is written down, the pitches and rhythm of the music, such as the notes of a ": null
    },
    {
        "melody": "Melody"
    },
    {
        ", are notated. Music notation also often provides instructions on how to perform the music. For example, the sheet music for a song may state that the song is a slow blues or a fast swing , which indicates the tempo and the genre. To read music notation, a person must have an understanding of ": null
    },
    {
        "music theory": "Music Theory"
    },
    {
        ", ": null
    },
    {
        "harmony": "Harmony"
    },
    {
        " and the ": null
    },
    {
        "performance practice": "Performance Practice"
    },
    {
        " associated with a particular song or pieces genre.     Written notation varies with style and period of music. In the 2000s, notated music is produced as ": null
    },
    {
        "sheet music": "Sheet Music"
    },
    {
        " or, for individuals with computer ": null
    },
    {
        "scorewriter": "Scorewriter"
    },
    {
        " programs, as an image on a ": null
    },
    {
        "computer screen": "Computer Screen"
    },
    {
        ". In ancient times, music notation was put onto stone or clay tablets. To perform music from notation, a singer or instrumentalist requires an understanding of the rhythmic and pitch elements embodied in the symbols and the performance practice that is associated with a piece of music or a genre. In genres requiring ": null
    },
    {
        "musical improvisation": "Musical Improvisation"
    },
    {
        ", the performer often plays from music where only the ": null
    },
    {
        "chord changes": "Chord Progression"
    },
    {
        " and form of the song are written, requiring the performer to have a great understanding of the musics structure, harmony and the styles of a particular genre .     In Western art music, the most common types of written notation are scores, which include all the music parts of an ensemble piece, and parts, which are the music notation for the individual performers or singers. In popular music, jazz, and blues, the standard musical notation is the ": null
    },
    {
        "lead sheet": "Lead Sheet"
    },
    {
        ", which notates the melody, chords, ": null
    },
    {
        "lyrics": "Lyrics"
    },
    {
        " , and structure of the music. ": null
    },
    {
        "Fake books": "Fake Book"
    },
    {
        "are also used in jazz; they may consist of lead sheets or simply chord charts, which permit ": null
    },
    {
        "rhythm section": "Rhythm Section"
    },
    {
        " members to improvise an ": null
    },
    {
        "accompaniment": "Accompaniment"
    },
    {
        " part to jazz songs. Scores and parts are also used in popular music and jazz, particularly in large ensembles such as jazz ": null
    },
    {
        "big band": "Big Band"
    },
    {
        "s. In popular music, guitarists and electric bass players often read music notated in ": null
    },
    {
        "tablature": "Tablature"
    },
    {
        " , which indicates the location of the notes to be played on the instrument using a diagram of the guitar or bass fingerboard. Tabulature was also used in the Baroque era to notate music for the ": null
    },
    {
        "lute": "Lute"
    },
    {
        ", a stringed, fretted instrument.          ": null
    },
    {
        "Musical improvisation": "Musical Improvisation"
    },
    {
        " is the creation of spontaneous music, often within a pre-existing harmonic framework or chord progression. Improvisation is the act of instantaneous composition by performers, where compositional techniques are employed with or without preparation. Improvisation is a major part of some types of music, such as ": null
    },
    {
        "blues": "Blues"
    },
    {
        ", ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        ", and ": null
    },
    {
        "jazz fusion": "Jazz Fusion"
    },
    {
        ", in which instrumental performers improvise solos, melody lines and accompaniment parts. In the Western art music tradition, improvisation was an important skill during the Baroque era and during the Classical era. In the Baroque era, performers improvised ornaments and ": null
    },
    {
        "basso continuo": "Basso Continuo"
    },
    {
        " keyboard players improvised ": null
    },
    {
        "chord voicings": "Chord Voicing"
    },
    {
        "based on ": null
    },
    {
        "figured bass": "Figured Bass"
    },
    {
        " notation. In the Classical era, solo performers and singers improvised virtuoso ": null
    },
    {
        "cadenzas": "Cadenza"
    },
    {
        "during concerts. However, in the 20th and early 21st century, as common practice Western ": null
    },
    {
        "art music": "Art Music"
    },
    {
        " performance became institutionalized in symphony orchestras, opera houses and ballets, improvisation has played a smaller role. At the same time, some modern composers have increasingly included improvisation in their creative work. In ": null
    },
    {
        "Indian classical music": "Indian Classical Music"
    },
    {
        ", improvisation is a core component and an essential criterion of performances.          Music theory encompasses the nature and mechanics of music. It often involves identifying patterns that govern composers techniques and examining the ": null
    },
    {
        "language": "Language"
    },
    {
        " and ": null
    },
    {
        "notation": "Musical Notation"
    },
    {
        " of music. In a grand sense, music theory distills and analyzes the ": null
    },
    {
        "parameters": "Parameter"
    },
    {
        " or elements of music – rhythm, ": null
    },
    {
        "harmony": "Harmony"
    },
    {
        " , ": null
    },
    {
        "melody": "Melody"
    },
    {
        ", structure, ": null
    },
    {
        "form": "Musical Form"
    },
    {
        ", and ": null
    },
    {
        "texture": "Texture"
    },
    {
        ". Broadly, music theory may include any statement, belief, or conception of or about music.  People who study these properties are known as music theorists. Some have applied ": null
    },
    {
        "acoustics": "Acoustics"
    },
    {
        ", ": null
    },
    {
        "human physiology": "Human Physiology"
    },
    {
        ", and ": null
    },
    {
        "psychology": "Psychology"
    },
    {
        " to the explanation of how and why music is ": null
    },
    {
        "perceive": "Perceive"
    },
    {
        "d.          Music has many different fundamentals or elements. Depending on the definition of element being used, these can include: pitch, beat or pulse, tempo, rhythm, melody, harmony, texture, style, allocation of voices, timbre or color, dynamics, expression, articulation, form and structure. The elements of music feature prominently in the music curriculums of Australia, UK and US. All three curriculums identify pitch, dynamics, timbre and texture as elements, but the other identified elements of music are far from universally agreed. Below is a list of the three official versions of the elements of music :   Australia: pitch, timbre, texture, dynamics and expression, rhythm, form and structure. ACARA. . Music glossary. v7.5. Retrieved 28 May 2015, 2015, from      UK: pitch, timbre, texture, dynamics, duration, tempo, structure. Education.gov.uk. . Music – Schools. Retrieved 12 July 2013, from    USA: pitch, timbre, texture, dynamics, rhythm, form, harmony, style/articulation. NAfME. . Core music standards glossary.  /     In relation to the UK curriculum, in 2013 the term: appropriate ": null
    },
    {
        "musical notations": "Musical Notation"
    },
    {
        " was added to their list of elements and the title of the list was changed from the elements of music to the inter-related dimensions of music . The inter-related dimensions of music are listed as: pitch, duration, dynamics, tempo, timbre, texture, structure and appropriate musical notations. Gov.uk. . National curriculum in England: music programmes of study. Retrieved 6 January 2016, from      The phrase the elements of music is used in a number of different contexts. The two most common contexts can be differentiated by describing them as the rudimentary elements of music and the perceptual elements of music .       In the 1800s, the phrases the elements of music and the rudiments of music were used interchangeably. Clementi, M. . Introduction to the art of playing on the piano forte: Da Capo Pr. Cohen, D., & Dubnov, S. . ": null
    },
    {
        "Gestalt phenomena": "Gestalt Phenomena"
    },
    {
        " in musical texture: Springer .  The elements described in these documents refer to aspects of music that are needed in order to become a musician, Recent writers such as Estrella Estrella, E. . The Elements of music. Retrieved 15 Jan. 2015, 2015, from  seem to be using the phrase elements of music in a similar manner. A definition which most accurately reflects this usage is: the rudimentary principles of an art, science, etc.: the elements of grammar. Element. . In Dictionary.com unabridged. Retrieved 10 Jun 2015, from  The UKs curriculum switch to the inter-related dimensions of music seems to be a move back to using the rudimentary elements of music.       Since the emergence of the study of ": null
    },
    {
        "psychoacoustics": "Psychoacoustics"
    },
    {
        " in the 1930s, most lists of elements of music have related more to how we hear music than how we learn to play it or study it. C.E. Seashore, in his book Psychology of Music, Seashore, C. E. . Psychology of music: New York: Dover Publications. identified four psychological attributes of sound . These were: pitch, loudness, time, and timbre . He did not call them the elements of music but referred to them as elemental components . Nonetheless these elemental components link precisely with four of the most common musical elements: Pitch and timbre match exactly, loudness links with dynamics and time links with the time-based elements of rhythm, duration and tempo. This usage of the phrase the elements of music links more closely with Websters New 20th Century Dictionary definition of an element as: a substance which cannot be divided into a simpler form by known methods Webster, N. Websters New Twentieth Century Dictionary. Clevelend Ohio: The World Publishing Company. and educational institutions lists of elements generally align with this definition as well.     Although writers of lists of rudimentary elements of music can vary their lists depending on their personal priorities, the perceptual elements of music should consist of an established list of discrete elements which can be independently manipulated to achieve an intended musical effect. It seems at this stage that there is still research to be done in this area.          Some styles of music place an emphasis on certain of these fundamentals, while others place less emphasis on certain elements. To give one example, while ": null
    },
    {
        "Bebop": "Bebop"
    },
    {
        "-era ": null
    },
    {
        "jazz": "Jazz"
    },
    {
        " makes use of very complex chords, including ": null
    },
    {
        "altered dominants": "Altered Dominant"
    },
    {
        "and challenging ": null
    },
    {
        "chord progression": "Chord Progression"
    },
    {
        "s, with chords changing two or more times per bar and keys changing several times in a tune, ": null
    },
    {
        "funk": "Funk"
    },
    {
        " places most of its emphasis on rhythm and ": null
    },
    {
        "groove": "Groove"
    },
    {
        ", with entire songs based around a ": null
    },
    {
        "vamp": "Ostinatovamp"
    },
    {
        " on a single chord. While Romantic era classical music from the mid- to late-1800s makes great use of dramatic changes of dynamics, from whispering pianissimo sections to thunderous fortissimo sections, some entire Baroque dance suites for ": null
    },
    {
        "harpsichord": "Harpsichord"
    },
    {
        " from the early 1700s may use a single dynamic. To give another example, while some ": null
    },
    {
        "art music": "Art Music"
    },
    {
        " pieces, such as ": null
    },
    {
        "symphonies": "Symphony"
    },
    {
        " are very long, some pop songs are just a few minutes long.           ": null
    },
    {
        "Pitch": "Pitch"
    },
    {
        " is an aspect of a sound that we can hear, reflecting whether one musical sound, note or tone is higher or lower than another musical sound, note or tone. We can talk about the highness or lowness of pitch in the more general sense, such as the way a listener hears a piercingly high ": null
    },
    {
        "piccolo": "Piccolo"
    },
    {
        " note or ": null
    },
    {
        "whistling": "Whistling"
    },
    {
        " tone as higher in pitch than a deep thump of a ": null
    },
    {
        "bass drum": "Bass Drum"
    },
    {
        ". We also talk about pitch in the precise sense associated with musical ": null
    },
    {
        "melodies": "Melody"
    },
    {
        ", ": null
    },
    {
        "basslines": "Bassline"
    },
    {
        "and ": null
    },
    {
        "chords": "Chord"
    },
    {
        ". Precise pitch can only be determined in sounds that have a frequency that is clear and stable enough to distinguish from noise. For example, it is much easier for listeners to discern the pitch of a single note played on a piano than to try to discern the pitch of a ": null
    },
    {
        "crash cymbal": "Crash Cymbal"
    },
    {
        " that is struck.        A ": null
    },
    {
        "melody": "Melody"
    },
    {
        " is a series of pitches sounding in succession , often in a rising and falling pattern. The notes of a melody are typically created using pitch systems such as ": null
    },
    {
        "scales": "Musical Scale"
    },
    {
        " or ": null
    },
    {
        "modes": "Musical Mode"
    },
    {
        ". Melodies also often contain notes from the chords used in the song. The melodies in simple folk songs and traditional songs may use only the notes of a single scale, the scale associated with the tonic note or ": null
    },
    {
        "key": "Key"
    },
    {
        " of a given song. For example, a folk song in the key of C may have a melody that uses only the notes of the C major scale ": null
    }
]