[
    {
        "      A musical keyboard is the set of adjacent depressible levers or keys on a ": null
    },
    {
        "musical instrument": "Musical Instrument"
    },
    {
        ". Keyboards typically contain keys for playing the twelve notes of the Western ": null
    },
    {
        "musical scale": "Musical Scale"
    },
    {
        ", with a combination of larger, longer keys and smaller, shorter keys that repeats at the interval of an ": null
    },
    {
        "octave": "Octave"
    },
    {
        ". Depressing a key on the keyboard makes the instrument produce sounds—either by mechanically striking a string or tine , plucking a string , causing air to flow through a ": null
    },
    {
        "pipe organ": "Pipe Organ"
    },
    {
        ", striking a bell , or, on electric and ": null
    },
    {
        "electronic keyboards": "Electronic Keyboard"
    },
    {
        ", completing a circuit . Since the most commonly encountered ": null
    },
    {
        "keyboard instrument": "Keyboard Instrument"
    },
    {
        " is the ": null
    },
    {
        "piano": "Piano"
    },
    {
        ", the keyboard layout is often referred to as the piano keyboard.          The twelve notes of the Western ": null
    },
    {
        "musical scale": "Musical Scale"
    },
    {
        " are laid out with the lowest note on the left; An exception is the ": null
    },
    {
        "hurdy-gurdy": "Hurdy-Gurdy"
    },
    {
        ", whose crank is turned with the left hand. The longer keys  ": null
    },
    {
        "jut": "Wikt:Jut"
    },
    {
        " forward. Because these keys were traditionally covered in ": null
    },
    {
        "ivory": "Ivory"
    },
    {
        " they are often called the white notes or white keys. The keys for the remaining five notes—which are not part of the C major scale    are raised and shorter. Because these keys receive less wear, they are often made of black colored wood and called the black notes or black keys. The pattern repeats at the interval of an ": null
    },
    {
        "octave": "Octave"
    },
    {
        ".     The arrangement of longer keys for C major with intervening, shorter keys for the intermediate semitones dates to the 15th century. Many keyboard instruments dating from before the nineteenth century, such as harpsichords and pipe organs, have a keyboard with the colours of the keys reversed: the white notes are made of ebony and the black notes are covered with softer white bone. A few electric and electronic instruments from the 1960s and subsequent decades have also done this; Voxs electronic organs of the 1960s, Farfisas FAST portable organs, Hohners ": null
    },
    {
        "Clavinet": "Clavinet"
    },
    {
        " L, one version of Korgs Poly-800 synthesizer and Rolands digital harpsichords.     Some 1960s electronic organs used reverse colors or gray sharps or naturals to indicate the lower part of a single keyboard divided into two parts, each controlling a different ": null
    },
    {
        "registration": "Registration"
    },
    {
        " or sound. Such keyboards accommodate melody and contrasting accompaniment without the expense of a second ": null
    },
    {
        "manual": "Manual"
    },
    {
        ", and were a regular feature in Spanish and some English organs of the renaissance and baroque eras. The break was between ": null
    },
    {
        "middle C": "Middle C"
    },
    {
        " and ": null
    },
    {
        "C-sharp": "C♯"
    },
    {
        ", or outside of Iberia between B and C. Broken keyboards reappeared in 1842 with the ": null
    },
    {
        "harmonium": "Pump Organ"
    },
    {
        ", the split occurring at ": null
    },
    {
        "E4": "Scientific Pitch Notation"
    },
    {
        "/F4.     The reverse-colored keys on ": null
    },
    {
        "Hammond organs": "Hammond Organ"
    },
    {
        " such as the B3, C3 and A100 are latch-style ": null
    },
    {
        "radio buttons": "Radio Button"
    },
    {
        " for selecting pre-set sounds.          The chromatic range  of keyboard instruments has tended to increase. Harpsichords often extended over five octaves in the 18th century, while most pianos manufactured since about 1870 have 88 keys. Some modern pianos have even more notes . While modern synthesizer keyboards commonly have either 61, 76 or 88 keys, small MIDI controllers are available with 25 notes. Organs normally have 61 keys per manual, though some spinet models have 44 or 49. An organ ": null
    },
    {
        "pedalboard": "Pedal Keyboard"
    },
    {
        " is a keyboard with long pedals played by the organists feet. Pedalboards vary in size from 12 to 32 notes.     In a typical keyboard layout, black note keys have uniform width, and white note keys have uniform width and uniform spacing at the front of the keyboard. In the larger gaps between the black keys, the width of the natural notes C, D and E differ slightly from the width of keys F, G, A and B. This allows close to uniform spacing of 12 keys per octave while maintaining uniformity of seven natural keys per octave.     Over the last three hundred years, the octave span distance found on historical keyboard instruments  has ranged from as little as 125  mm to as much as 170  mm. Modern piano keyboards ordinarily have an octave span of 164–165  mm; resulting in the width of black keys averaging 13.7  mm and white keys about 23.5  mm wide at the base, disregarding space between keys. Several reduced-size standards have been proposed and marketed. A 15/16 size and the 7/8 DS Standard keyboard developed by ": null
    },
    {
        "Christopher Donison": "Christopher Donison"
    },
    {
        " in the 1970s and developed and marketed by ": null
    },
    {
        "Steinbuhler & Company": "Steinbuhler  &  Company"
    },
    {
        ". U.S. pianist ": null
    },
    {
        "Hannah Reimann": "Hannah Reimann"
    },
    {
        " has promoted piano keyboards with narrower octave spans and has a U.S. patent on the apparatus and methods for modifying existing pianos to provide interchangeable keyboards of different sizes. , August 10, 1998     There have been variations in the design of the keyboard to address technical and musical issues. The earliest designs of keyboards were based heavily on the notes used in ": null
    },
    {
        "Gregorian chant": "Gregorian Chant"
    },
    {
        " and as such would often include B and B both as diatonic white notes, with the B at the leftmost side of the keyboard and the B at the rightmost. Thus, an octave would have eight white keys and only four black keys. The emphasis on these eight notes would continue for a few centuries after the seven and five system was adopted, in the form of the ": null
    },
    {
        "short octave": "Short Octave"
    },
    {
        "meantone temperament": "Meantone Temperament"
    },
    {
        ", some harpsichords were constructed with the G and E keys split into two. One portion of the G key operated a string tuned to G and the other operated a string tuned to A, similarly one portion of the E key operated a string tuned to E, the other portion operating a string tuned to D. This type of keyboard layout, known as the ": null
    },
    {
        "enharmonic keyboard": "Enharmonic Keyboard"
    },
    {
        ", extended the flexibility of the harpsichord, enabling composers to write keyboard music calling for harmonies containing the so-called  wolf  fifth , but without producing aural discomfort in the listeners . The broken octave, a variation of the aforementioned short octave, similarly used split keys to add accidentals left out of the short octave. Other examples of variations in keyboard design include the ": null
    },
    {
        "Jankó keyboard": "Jankó Keyboard"
    },
    {
        " and the chromatic keyboard systems on the ": null
    },
    {
        "chromatic button accordion": "Chromatic Button Accordion"
    },
    {
        " and ": null
    },
    {
        "bandoneón": "Bandoneón"
    },
    {
        ".       Simpler electronic keyboards have switches under each key. Depressing a key connects a circuit, which triggers tone generation. Most keyboards use a ": null
    },
    {
        "keyboard matrix circuit": "Keyboard Matrix"
    },
    {
        ", in which eight rows and eight columns of wires cross — thus, 16 wires can provide 64 crossings, which the keyboard controller scans to determine which key was pressed. , The problem with this system is that it provides only a crude binary on/off signal for each key. Better electronic keyboards employ two sets of switches for each key that are slightly offset. By determining the timing between the activation of the first and second switches, the velocity of a key press can be determined — greatly improving the performance dynamic of a keyboard. The best electronic keyboards have dedicated circuits for each key, providing polyphonic aftertouch.     Advanced electronic keyboards may provide hundreds of key touch levels  and have 88 keys, as most pianos do.       Despite their visual similarity, different keyboard instrument types require different techniques. The piano hammer mechanism produces a louder note the faster the key is pressed, while the harpsichords plectrum mechanism does not perceptibly vary the volume of the note with different touch on the keyboard. The ": null
    },
    {
        "pipe organs": "Pipe Organ"
    },
    {
        " volume and timbre are controlled by the flow of air from the bellows and the stops preselected by the player. Players of these instruments therefore use different techniques to color the sound. An ": null
    },
    {
        "arranger keyboard": "Electronic Keyboard"
    },
    {
        " may be preset to produce any of a range of voices as well as percussion and other accompaniments that respond to chords played by the left hand.        Even though the keyboard layout is simple and all notes are easily accessible, playing requires skill. A proficient player has undertaken much training to play accurately and in ": null
    },
    {
        "tempo": "Tempo"
    },
    {
        ". Beginners seldom produce a passable rendition of even a simple piece due to lack of ": null
    },
    {
        "technique": "Wikt:Technique"
    },
    {
        ". The sequences of movements of the players hands can be very complicated. Problems include wide-spanned ": null
    },
    {
        "chords": "Chord"
    },
    {
        ", which can be difficult for people with small hands, chords requiring unusual hand positions that can initially be uncomfortable, and fast ": null
    },
    {
        "scales": "Musical Scale"
    },
    {
        ", ": null
    },
    {
        "trills": "Trill"
    },
    {
        " and ": null
    },
    {
        "arpeggios": "Arpeggio"
    },
    {
        ".     Playing instruments with velocity sensitive  keyboards may require finger independence, so that some fingers play harder while others play more softly. Pianists call this control of touch velocity voicing . Keyboardists speak of playing harder and softer, or with more or less force. This may accurately describe the players experience  but in the mechanics of the keyboard, ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " controls musical dynamics. The faster the player depresses the key, the louder the note. Players must learn to coordinate two hands and use them independently. Most music is written for two hands; typically the right hand plays the ": null
    },
    {
        "melody": "Melody"
    },
    {
        " in the ": null
    },
    {
        "treble": "Cleftreble Clef"
    },
    {
        " range, while the left plays an accompaniment of bass notes and chords in the ": null
    },
    {
        "bass": "Clefbass Clef"
    },
    {
        " range. Examples of music written for the left hand alone include several of ": null
    },
    {
        "Leopold Godowskys": "Leopold Godowsky"
    },
    {
        " 53 Studies on Chopins Etudes": "Studies On Chopins Études"
    },
    {
        ", ": null
    },
    {
        "Maurice Ravels": "Maurice Ravel"
    },
    {
        " Piano Concerto for the Left Hand": "Piano Concerto For The Left Hand"
    },
    {
        " and ": null
    },
    {
        "Sergei Prokofievs": "Sergei Prokofiev"
    },
    {
        " Piano Concerto No. 4 for the left hand": "Piano Concerto No. 4"
    },
    {
        ". In music that uses ": null
    },
    {
        "counterpoint": "Counterpoint"
    },
    {
        " technique, both hands play different melodies at the same time.          A number of percussion instruments—such as the ": null
    },
    {
        "xylophone": "Xylophone"
    },
    {
        ", ": null
    },
    {
        "marimba": "Marimba"
    },
    {
        ", ": null
    },
    {
        "vibraphone": "Vibraphone"
    },
    {
        ", or ": null
    },
    {
        "glockenspiel": "Glockenspiel"
    },
    {
        "— have pitched elements arranged in the keyboard layout. Rather than depress a key, the performer typically strikes each element with a mallet.     There are some examples of a musical keyboard layout used for non-musical devices. For example, some of the earliest ": null
    },
    {
        "printing telegraph": "Printing Telegraph"
    },
    {
        " machines used a layout similar to a piano keyboard. George M. Phelps,  Improvement in Telegraphic Machines issued November 1, 1859        There are some rare variations of keyboards with more or fewer than 12 keys per octave, mostly used in ": null
    },
    {
        "microtonal music": "Microtonal Music"
    },
    {
        ", after the discoveries and theoretical developments of musician and inventor ": null
    },
    {
        "Julián Carrillo": "Julián Carrillo"
    },
    {
        " .     Some free-reed instrument keyboards such as ": null
    },
    {
        "accordions": "Accordion"
    },
    {
        " and Indian ": null
    },
    {
        "harmoniums": "Pump Organ"
    },
    {
        " include microtones. Electronic music pioneer ": null
    },
    {
        "Pauline Oliveros": "Pauline Oliveros"
    },
    {
        " plays one of these. Egyptian belly-dance musicians like Hassam Ramzy use custom-tuned accordions so they can play traditional scales. The small ": null
    },
    {
        "Garmon": "Garmon"
    },
    {
        " accordion played in the ": null
    },
    {
        "Music of Azerbaijan": "Music Of Azerbaijan"
    }
]