[
    {
        "             is the ": null
    },
    {
        "capital": "Capital"
    },
    {
        " and the largest ": null
    },
    {
        "city": "Cities Of Japan"
    },
    {
        " of ": null
    },
    {
        "Nagasaki Prefecture": "Nagasaki Prefecture"
    },
    {
        " on the island of ": null
    },
    {
        "Kyushu": "Kyushu"
    },
    {
        " in Japan. It became a ": null
    },
    {
        "centre of colonial Portuguese and Dutch influence": "Nanban Trade"
    },
    {
        " in the 16th through 19th centuries and the ": null
    },
    {
        "Hidden Christian Sites in the Nagasaki Region": "Hidden Christian Sites In The Nagasaki Region"
    },
    {
        " have been recognized and included in the ": null
    },
    {
        "UNESCO World Heritage List": "World Heritage Sites In Japan"
    },
    {
        ". Part of Nagasaki was home to a major ": null
    },
    {
        "Imperial Japanese Navy": "Imperial Japanese Navy"
    },
    {
        " base during the ": null
    },
    {
        "First Sino-Japanese War": "First Sino-Japanese War"
    },
    {
        " and ": null
    },
    {
        "Russo-Japanese War": "Russo-Japanese War"
    },
    {
        ".     During ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", the American ": null
    },
    {
        "atomic bombings of Hiroshima and Nagasaki": "Atomic Bombings Of Hiroshima And Nagasaki"
    },
    {
        " made Nagasaki the second and, to date, last city in the world to experience a ": null
    },
    {
        "nuclear attack": "Nuclear Attack"
    },
    {
        " .      , the city has an estimated population of 412,643 and a population density of 1,017 people per km². The total area is .                  Nagasaki was a small fishing village set in a secluded harbor and had little historical significance until contact with ": null
    },
    {
        "Portuguese explorers": "Portuguese Explorers"
    },
    {
        " in 1543. An early visitor was ": null
    },
    {
        "Fernão Mendes Pinto": "Fernão Mendes Pinto"
    },
    {
        ", who came from ": null
    },
    {
        "Sagres": "Vila Do Bispo"
    },
    {
        " on a Portuguese ship which landed nearby in ": null
    },
    {
        "Tanegashima": "Tanegashima"
    },
    {
        ".        Soon after, ": null
    },
    {
        "Portuguese ships started sailing to Japan as regular trade freighters": "Nanban Trade"
    },
    {
        ", thus increasing the contact and trade relations between Japan and the rest of the world, and particularly with ": null
    },
    {
        "mainland China": "Ming China"
    },
    {
        ", with whom Japan had previously severed its commercial and political ties, mainly due to a number of incidents involving ": null
    },
    {
        "Wokou": "Wokou"
    },
    {
        " piracy in the ": null
    },
    {
        "South China Sea": "South China Sea"
    },
    {
        ", with the Portuguese now serving as intermediaries between the two Asian countries.     Despite the mutual advantages derived from these trading contacts, which would soon be acknowledged by all parties involved, the lack of a proper seaport in Kyūshū for the purpose of harboring foreign ships posed a major problem for both merchants and the Kyushu  daimyō s who expected to collect great advantages from the trade with the Portuguese.     In the meantime, ": null
    },
    {
        "Spanish": "Kingdom Of Navarre"
    },
    {
        " Jesuit missionary": "Society Of Jesus"
    },
    {
        " St. Francis Xavier": "Francis Xavier"
    },
    {
        " arrived in ": null
    },
    {
        "Kagoshima": "Kagoshima"
    },
    {
        ", South Kyūshū, in 1549, and soon initiated a thorough campaign of ": null
    },
    {
        "evangelization": "Mission"
    },
    {
        " throughout Japan, and left for ": null
    },
    {
        "China": "China"
    },
    {
        " in 1552 and died soon afterwards. His followers who remained behind converted a number of daimyōs. The most notable among them was ": null
    },
    {
        "Ōmura Sumitada": "Ōmura Sumitada"
    },
    {
        ". In 1569, Ōmura granted a permit for the establishment of a port with the purpose of harboring Portuguese ships in Nagasaki, which was finally set up in 1571, under the supervision of the ": null
    },
    {
        "Jesuit missionary Gaspar Vilela": "Jesuit Missionaries"
    },
    {
        " and ": null
    },
    {
        "Portuguese": "Portuguese People"
    },
    {
        " Captain-Major ": null
    },
    {
        "Tristão Vaz de Veiga": "Governor Of Macau"
    },
    {
        ", with Ōmuras personal assistance. Boxer, The Christian Century In Japan 1549–1650, p. 100–101     The little harbor village quickly grew into a diverse port city,  and Portuguese products imported through Nagasaki  were assimilated into popular Japanese culture. ": null
    },
    {
        "Tempura": "Tempura"
    },
    {
        " derived from a popular Portuguese recipe originally known as ": null
    },
    {
        "peixinho-da-horta": "Tempuraorigins"
    },
    {
        ", and takes its name from the Portuguese word, tempero, seasoning, and refers to the tempora quadragesima, forty days of Lent during which eating meat was forbidden, another example of the enduring effects of this cultural exchange. The Portuguese also brought with them many goods from ": null
    },
    {
        "China": "China"
    },
    {
        ".     Due to the instability during the ": null
    },
    {
        "Sengoku period": "Sengoku Period"
    },
    {
        ", Sumitada and Jesuit leader ": null
    },
    {
        "Alexandro Valignano": "Alexandro Valignano"
    },
    {
        " conceived a plan to pass administrative control over to the ": null
    },
    {
        "Society of Jesus": "Society Of Jesus"
    },
    {
        " rather than see the Catholic city taken over by a non-Catholic daimyō. Thus, for a brief period after 1580, the city of Nagasaki was a Jesuit colony, under their administrative and military control. It became a refuge for ": null
    },
    {
        "Christians": "Christians"
    },
    {
        " escaping maltreatment in other regions of Japan. Diego Paccheco, Monumenta Nipponica, 1970 In 1587, however, ": null
    },
    {
        "Toyotomi Hideyoshis": "Toyotomi Hideyoshi"
    },
    {
        " campaign to unify the country arrived in Kyūshū. Concerned with the large ": null
    },
    {
        "Christian": "Christianity"
    },
    {
        " influence in southern Japan, as well as the active and what was perceived as the arrogant role the Jesuits were playing in the Japanese political arena, Hideyoshi ordered the expulsion of all ": null
    },
    {
        "missionaries": "Missionaries"
    },
    {
        ", and placed the city under his direct control. However, the expulsion order went largely unenforced, and the fact remained that most of Nagasakis population remained openly practicing ": null
    },
    {
        "Catholic": "Catholicism"
    },
    {
        ".     In 1596, the Spanish ship  San Felipe  was wrecked off the coast of ": null
    },
    {
        "Shikoku": "Shikoku"
    },
    {
        ", and Hideyoshi learned from its pilot so says the Jesuit account that the ": null
    },
    {
        "Spanish": "Spain"
    },
    {
        " Franciscans": "Franciscans"
    },
    {
        " were the vanguard of an ": null
    },
    {
        "Iberian": "Iberian Union"
    },
    {
        " invasion of Japan. In response, Hideyoshi ordered the ": null
    },
    {
        "crucifixions": "Crucifixion"
    },
    {
        " of twenty-six Catholics in Nagasaki on February 5 of the next year . Portuguese traders were not ostracized, however, and so the city continued to thrive.      In 1602, ": null
    },
    {
        "Augustinian": "Augustinian"
    },
    {
        " missionaries also arrived in Japan, and when ": null
    },
    {
        "Tokugawa Ieyasu": "Tokugawa Ieyasu"
    },
    {
        " took power in 1603, Catholicism was still tolerated. Many Catholic  daimyō s had been critical allies at the ": null
    },
    {
        "Battle of Sekigahara": "Battle Of Sekigahara"
    },
    {
        ", and the Tokugawa position was not strong enough to move against them. Once ": null
    },
    {
        "Osaka Castle": "Osaka Castle"
    },
    {
        " had been taken and ": null
    },
    {
        "Toyotomi Hideyoshis": "Toyotomi Hideyoshi"
    },
    {
        " offspring killed, though, the Tokugawa dominance was assured. In addition, the ": null
    },
    {
        "Dutch": "Netherlands"
    },
    {
        " and ": null
    },
    {
        "English": "England"
    },
    {
        " presence allowed trade without religious strings attached. Thus, in 1614, ": null
    },
    {
        "Catholicism": "Catholicism"
    },
    {
        " was officially banned and all missionaries ordered to leave. Most Catholic daimyo ": null
    },
    {
        "apostatized": "Apostacy"
    },
    {
        ", and forced their subjects to do so, although a few would not renounce the religion and left the country for ": null
    },
    {
        "Macau": "Macau"
    },
    {
        ", ": null
    },
    {
        "Luzon": "Luzon"
    },
    {
        " and ": null
    },
    {
        "Japantowns": "Japantown"
    },
    {
        " in ": null
    },
    {
        "Southeast Asia": "Southeast Asia"
    },
    {
        ". A brutal campaign of persecution followed, with thousands of converts across Kyūshū and other parts of Japan killed, tortured, or forced to renounce their religion .     Catholicisms last gasp as an open religion and the last major military action in Japan until the ": null
    },
    {
        "Meiji Restoration": "Meiji Restoration"
    },
    {
        " was the ": null
    },
    {
        "Shimabara Rebellion": "Shimabara Rebellion"
    },
    {
        " of 1637. While there is no evidence that Europeans directly incited the rebellion, ": null
    },
    {
        "Shimabara Domain": "Shimabara Domain"
    },
    {
        " had been a Christian  han  for several decades, and the rebels adopted many Portuguese motifs and Christian ": null
    },
    {
        "icons": "Icon"
    },
    {
        ". Consequently, in Tokugawa society the word Shimabara solidified the connection between Christianity and disloyalty, constantly used again and again in Tokugawa propaganda. The Shimabara Rebellion also convinced many policy-makers that foreign influences were more trouble than they were worth, leading to the ": null
    },
    {
        "national isolation policy": "Sakoku"
    },
    {
        ". The Portuguese, who had been previously living on a specially constructed island-prison in Nagasaki harbour called ": null
    },
    {
        "Dejima": "Dejima"
    },
    {
        ", were expelled from the archipelago altogether, and the Dutch were moved from their base at ": null
    },
    {
        "Hirado": "Hirado"
    },
    {
        " into the trading island.       The ": null
    },
    {
        "Great Fire of Nagasaki": "Great Fire Of Nagasaki"
    },
    {
        " destroyed much of the city in 1663, including the ": null
    },
    {
        "Mazu": "Lin Moniang"
    },
    {
        " shrine at the ": null
    },
    {
        "Kofuku Temple": "Kofukuji"
    },
    {
        " patronized by the Chinese sailors and merchants visiting the port.      In 1720 the ban on Dutch books was lifted, causing hundreds of scholars to flood into Nagasaki to study European science and art. Consequently, Nagasaki became a major center of what was called  rangaku , or Dutch Learning . During the ": null
    },
    {
        "Edo period": "Edo Period"
    },
    {
        ", the ": null
    },
    {
        "Tokugawa shogunate": "Tokugawa Shogunate"
    },
    {
        " governed the city, appointing a  hatamoto , the  Nagasaki bugyō , as its chief administrator.        Consensus among historians was once that Nagasaki was Japans only window on the world during its time as a closed country in the Tokugawa era. However, nowadays it is generally accepted that this was not the case, since Japan interacted and traded with the ": null
    },
    {
        "Ryūkyū Kingdom": "Ryūkyū Kingdom"
    },
    {
        ", ": null
    },
    {
        "Korea": "Korea"
    },
    {
        " and ": null
    },
    {
        "Russia": "Russia"
    },
    {
        " through ": null
    },
    {
        "Satsuma": "Satsuma Domain"
    },
    {
        ", ": null
    },
    {
        "Tsushima": "Tsushima-Fuchū Domain"
    },
    {
        " and Matsumae respectively. Nevertheless, Nagasaki was depicted in contemporary art and literature as a cosmopolitan port brimming with exotic curiosities from the Western World. Cambridge Encyclopedia of Japan, ": null
    },
    {
        "Richard Bowring": "Richard Bowring"
    },
    {
        " and Haruko Laurie     In 1808, during the ": null
    },
    {
        "Napoleonic Wars": "Napoleonic Wars"
    },
    {
        " the British ": null
    },
    {
        "Royal Navy": "Royal Navy"
    },
    {
        " frigate ": null
    },
    {
        "HMS Phaeton": "Hms Phaeton"
    },
    {
        " entered Nagasaki Harbor": "Phaeton Incident"
    },
    {
        " in search of Dutch trading ships. The local magistrate was unable to resist the British demand for food, fuel, and water, later committing  seppuku  as a result. ": null
    },
    {
        "Laws were passed": "Edict To Repel Foreign Vessels"
    },
    {
        " in the wake of this incident strengthening coastal defenses, threatening death to intruding foreigners, and prompting the training of ": null
    },
    {
        "English": "English Language"
    },
    {
        " and ": null
    },
    {
        "Russian": "Russian Language"
    },
    {
        " translators.     The Tōjinyashiki or Chinese Factory in Nagasaki was also an important conduit for Chinese goods and information for the Japanese market. Various colourful Chinese merchants and artists sailed between the Chinese mainland and Nagasaki. Some actually combined the roles of merchant and artist such as 18th century ": null
    },
    {
        "Yi Hai": "Yi Hai"
    },
    {
        ". It is believed that as much as one-third of the population of Nagasaki at this time may have been Chinese. Screech, Timon. The Western Scientific Gaze and Popular Imagery in Later Edo Japan: The Lens Within the Heart. Cambridge: Cambridge University Press, 1996. p15.       With the ": null
    },
    {
        "Meiji Restoration": "Meiji Restoration"
    },
    {
        ", Japan opened its doors once again to foreign trade and diplomatic relations. Nagasaki became a ": null
    },
    {
        "treaty port": "Treaty Port"
    },
    {
        " in 1859 and modernization began in earnest in 1868. Nagasaki was officially proclaimed a city on April 1, 1889. With Christianity legalized and the ": null
    },
    {
        "Kakure Kirishitan": "Kakure Kirishitan"
    },
    {
        " coming out of hiding, Nagasaki regained its earlier role as a center for Roman Catholicism in Japan.      During the ": null
    },
    {
        "Meiji period": "Meiji Period"
    },
    {
        ", Nagasaki became a center of heavy industry. Its main industry was ": null
    },
    {
        "ship-building": "Ship-Building"
    },
    {
        ", with the dockyards under control of ": null
    },
    {
        "Mitsubishi Heavy Industries": "Mitsubishi Heavy Industries"
    },
    {
        " becoming one of the prime contractors for the ": null
    },
    {
        "Imperial Japanese Navy": "Imperial Japanese Navy"
    },
    {
        ", and with Nagasaki harbor used as an anchorage under the control of nearby ": null
    },
    {
        "Sasebo Naval District": "Sasebo Naval District"
    },
    {
        ". During ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", at the time of the nuclear attack, Nagasaki was an important industrial city, containing both plants of the Mitsubishi Steel and Arms Works, the Akunoura Engine Works, Mitsubishi Arms Plant, Mitsubishi Electric Shipyards, Mitsubishi Steel and Arms Works, Mitsubishi-Urakami Ordnance Works, several other small factories, and most of the ports storage and trans-shipment facilities, which employed about 90% of the citys labor force, and accounted for 90% of the citys industry. These connections with the Japanese ": null
    },
    {
        "war effort": "War Effort"
    },
    {
        " made Nagasaki a major target for ": null
    },
    {
        "strategic bombing": "Strategic Bombing"
    },
    {
        " by the ": null
    },
    {
        "Allies": "Allies Of World War Ii"
    },
    {
        " during the war.               For 12 months prior to the nuclear attack, Nagasaki had experienced five small-scale air attacks by an aggregate of 136 U.S. planes which dropped a total of 270 tons of ": null
    },
    {
        "high explosive": "High Explosive"
    },
    {
        ", 53 tons of ": null
    },
    {
        "incendiary": "Incendiary Device"
    },
    {
        ", and 20 tons of ": null
    },
    {
        "fragmentation bombs": "Fragmentation Bombs"
    },
    {
        ". Of these, a raid of August 1, 1945, was most effective, with a few of the bombs hitting the shipyards and dock areas in the southwest portion of the city, several hitting the Mitsubishi Steel and Arms Works, and six bombs landing at the Nagasaki Medical School and Hospital, with three direct hits on buildings there. While the damage from these few bombs was relatively small, it created considerable concern in Nagasaki and a number of people, principally school children, were evacuated to rural areas for safety, thus reducing the population in the city at the time of the atomic attack.        On the day of the nuclear strike the population in Nagasaki was estimated to be 263,000, which consisted of 240,000 Japanese residents, 10,000 Korean residents, 2,500 conscripted Korean workers, 9,000 Japanese soldiers, 600 conscripted Chinese workers, and 400 Allied ": null
    },
    {
        "POWs": "Prisoner Of War"
    },
    {
        ". That day, the ": null
    },
    {
        "Boeing B-29 Superfortress": "Boeing B-29 Superfortress"
    },
    {
        "  Bockscar , commanded by ": null
    },
    {
        "Major": "Major"
    },
    {
        " Charles Sweeney": "Charles Sweeney"
    },
    {
        ", departed from ": null
    },
    {
        "Tinians": "Tinian"
    },
    {
        " North Field": "North Field"
    },
    {
        " just before dawn, this time carrying a ": null
    },
    {
        "plutonium bomb": "Plutonium Bomb"
    },
    {
        ", code named ": null
    },
    {
        "Fat Man": "Fat Man"
    },
    {
        " . The primary target for the bomb was ": null
    },
    {
        "Kokura": "Kokuraworld War Ii"
    },
    {
        ", with the secondary target being Nagasaki, if the primary target was too cloudy to make a visual sighting. When the plane reached Kokura at 9:44  a.m. , the city was obscured by clouds and smoke, as the ": null
    },
    {
        "nearby city of Yahata": "Yahata, Fukuoka"
    },
    {
        " had been ": null
    },
    {
        "firebombed": "Firebombing"
    },
    {
        " on the previous day - the steel plant in Yahata also had their workforce intentionally set fire to containers of ": null
    },
    {
        "coal tar": "Coal Tar"
    },
    {
        ", to produce target-obscuring black smoke.  . Unable to make a bombing attack on visual due to the clouds and smoke and with limited fuel, the plane left the city at 10:30  a.m. for the secondary target. After 20 minutes, the plane arrived at 10:50  a.m. over Nagasaki, but the city was also concealed by clouds. Desperately short of fuel and after making a couple of bombing runs without obtaining any visual target, the crew was forced to use radar in order to drop the bomb. At the last minute, the opening of the clouds allowed them to make visual contact with a racetrack in Nagasaki, and they dropped the bomb on the citys ": null
    },
    {
        "Urakami Valley": "Urakami"
    },
    {
        " midway between the Mitsubishi Steel and Arms Works in the south, and the Mitsubishi-Urakami Ordnance Works in the north.  53 seconds after its release, the bomb exploded at 11:02  a.m. at an approximate altitude of 1,800 feet.      Less than a second after the detonation, the north of the city was destroyed and 35,000 people were killed.  Among the deaths were 6,200 out of the 7,500 employees of the Mitsubishi Munitions plant, and 24,000 others who worked in other war plants and factories in the city, as well as 150 Japanese soldiers. The industrial damage in Nagasaki was high, leaving 68–80% of the non-dock industrial production destroyed. It was the second and, to date, the last use of a ": null
    },
    {
        "nuclear weapon": "Nuclear Weapon"
    },
    {
        " in ": null
    },
    {
        "combat": "Combat"
    },
    {
        ", and also the second detonation of a plutonium bomb. The first combat use of a nuclear weapon was the ": null
    },
    {
        "Little Boy": "Little Boy"
    },
    {
        " bomb, which was dropped on the Japanese city of ": null
    },
    {
        "Hiroshima": "Hiroshima"
    },
    {
        " on August 6, 1945. The ": null
    },
    {
        "first plutonium bomb was tested": "Trinity"
    },
    {
        " in ": null
    },
    {
        "central New Mexico": "Central New Mexico"
    },
    {
        ", United States, on July 16, 1945. The Fat Man bomb was somewhat more powerful than the one dropped over Hiroshima, but because of Nagasakis more uneven terrain, there was less damage.  .        The city was rebuilt after the war, albeit dramatically changed. The pace of reconstruction was slow. The first simple emergency dwellings were not provided until 1946. The focus of redevelopment was the replacement of war industries with foreign trade, shipbuilding and fishing. This was formally declared when the Nagasaki International Culture City Reconstruction Law was passed in May 1949.  New temples were built, as well as new churches, owing to an increase in the presence of Christianity.  Some of the rubble was left as a memorial, such as a one-legged  torii  at ": null
    },
    {
        "Sannō Shrine": "Sannō Shrine"
    },
    {
        " and an arch near ": null
    },
    {
        "ground zero": "Ground Zero"
    },
    {
        ". New structures were also raised as memorials, such as the ": null
    },
    {
        "Atomic Bomb Museum": "Nagasaki Atomic Bomb Museum"
    },
    {
        ". Nagasaki remains primarily a port city, supporting a rich ": null
    },
    {
        "shipbuilding": "Shipbuilding"
    },
    {
        " industry.        On January 4, 2005, the towns of ": null
    },
    {
        "Iōjima": "Iōjima, Nagasaki"
    },
    {
        ", ": null
    },
    {
        "Kōyagi": "Koyagi, Nagasaki"
    },
    {
        ", ": null
    },
    {
        "Nomozaki": "Nomozaki, Nagasaki"
    },
    {
        ", ": null
    },
    {
        "Sanwa": "Sanwa, Nagasaki"
    },
    {
        ", ": null
    },
    {
        "Sotome": "Sotome, Nagasaki"
    },
    {
        " and ": null
    },
    {
        "Takashima": "Takashima, Nagasaki"
    },
    {
        "  were officially merged into Nagasaki.       Nagasaki and ": null
    },
    {
        "Nishisonogi Peninsulas": "Nishisonogi Peninsula"
    },
    {
        " are located within the city limits. The city is surrounded by the cities of ": null
    },
    {
        "Isahaya": "Isahaya, Nagasaki"
    },
    {
        " and ": null
    },
    {
        "Saikai": "Saikai, Nagasaki"
    },
    {
        ", and the towns of ": null
    },
    {
        "Togitsu": "Togitsu, Nagasaki"
    },
    {
        " and ": null
    },
    {
        "Nagayo": "Nagayo, Nagasaki"
    },
    {
        " in ": null
    },
    {
        "Nishisonogi District": "Nishisonogi District, Nagasaki"
    },
    {
        ".     Nagasaki lies at the head of a long bay that forms the best natural harbor on the island of Kyūshū. The main commercial and residential area of the city lies on a small plain near the end of the bay. Two rivers divided by a mountain spur form the two main valleys in which the city lies. The heavily built-up area of the city is confined by the terrain to less than .     Nagasaki has the typical ": null
    },
    {
        "humid subtropical climate": "Humid Subtropical Climate"
    },
    {
        " of Kyūshū and Honshū, characterized by mild winters and long, hot, and humid summers. Apart from ": null
    },
    {
        "Kanazawa": "Kanazawa, Ishikawa"
    },
    {
        " and ": null
    },
    {
        "Shizuoka": "Shizuoka, Shizuoka"
    },
    {
        " it is the wettest sizeable city in Japan. In the summer, the combination of persistent heat and high humidity results in unpleasant conditions, with ": null
    },
    {
        "wet-bulb temperatures": "Wet-Bulb Temperature"
    },
    {
        " sometimes reaching . In the winter, however, Nagasaki is drier and sunnier than ": null
    },
    {
        "Gotō": "Gotō, Nagasaki"
    },
    {
        " to the west, and temperatures are slightly milder than further inland in Kyūshū. Since records began in 1878, the wettest month has been July 1982, with  including  in a single day, whilst the driest month has been September 1967, with . Precipitation occurs year-round, though winter is the driest season; rainfall peaks sharply in June and July. August is the warmest month of the year. On January 24, 2016, a snowfall of  was recorded.         ": null
    },
    {
        "Nagasaki University": "Nagasaki University"
    },
    {
        " Nagasaki Institute of Applied Science": "Nagasaki Institute Of Applied Science"
    },
    {
        " Nagasaki University of Foreign Studies": "Nagasaki University Of Foreign Studies"
    },
    {
        "    Kwassui Womens College": "Kwassui College"
    },
    {
        "              The nearest airport is ": null
    },
    {
        "Nagasaki Airport": "Nagasaki Airport"
    },
    {
        " in the nearby city of ": null
    },
    {
        "Ōmura": "Ōmura, Nagasaki"
    },
    {
        ". The ": null
    },
    {
        "Kyushu Railway Company": "Kyushu Railway Company"
    },
    {
        " provides rail transportation on the ": null
    },
    {
        "Nagasaki Main Line": "Nagasaki Main Line"
    },
    {
        ", whose terminal is at ": null
    },
    {
        "Nagasaki Station": "Nagasaki Station"
    },
    {
        ". In addition, the ": null
    },
    {
        "Nagasaki Electric Tramway": "Nagasaki Electric Tramway"
    },
    {
        " operates five routes in the city. The ": null
    },
    {
        "Nagasaki Expressway": "Nagasaki Expressway"
    },
    {
        " serves vehicular traffic with interchanges at Nagasaki and Susukizuka. In addition, six ": null
    },
    {
        "national highways": "National Highways Of Japan"
    },
    {
        " crisscross the city: ": null
    },
    {
        "Route 34": "Route 34"
    },
    {
        ", ": null
    },
    {
        "202": "Route 202"
    },
    {
        ", ": null
    },
    {
        "206": "Route 206"
    },
    {
        ", ": null
    },
    {
        "251": "Route 251"
    },
    {
        ", ": null
    },
    {
        "324": "Route 324"
    },
    {
        ", and ": null
    },
    {
        "499": "Route 499"
    },
    {
        ".          On August 9, 1945 the population was estimated to be 263,000. As of March 1, 2017, the city had population of 425,723 and a population density of 1,000 persons per km 2 .       Nagasaki is represented in the ": null
    },
    {
        "J. League": "J. League"
    },
    {
        " of football with its local club, ": null
    },
    {
        "V-Varen Nagasaki": "V-Varen Nagasaki"
    },
    {
        ".      ": null
    },
    {
        "Basilica of the Twenty-Six Holy Martyrs of Japan": "Basilica Of The Twenty-Six Holy Martyrs Of Japan"
    },
    {
        " Confucius Shrine, Nagasaki": "Confucius Shrine, Nagasaki"
    },
    {
        " Shuhan Takashima": "Shuhan Takashima"
    },
    {
        " Hong Kong and Shanghai Banking Corporation": "Hong Kong And Shanghai Banking Corporation"
    },
    {
        " Nagasaki Branch   ": null
    },
    {
        "Glover Garden": "Glover Garden"
    },
    {
        " Fukusai-ji": "Fukusai-Ji"
    },
    {
        " Gunkanjima": "Hashima Island"
    },
    {
        " Kofukuji": "Kōfuku-Ji"
    },
    {
        " Megane Bridge": "Megane Bridge"
    },
    {
        " Mount Inasa": "Mount Inasa"
    },
    {
        " Nagasaki Atomic Bomb Museum": "Nagasaki Atomic Bomb Museum"
    },
    {
        "    Nagasaki Museum of History and Culture": "Nagasaki Museum Of History And Culture"
    },
    {
        "    Nagasaki National Peace Memorial Hall for the Atomic Bomb Victims": "Nagasaki National Peace Memorial Hall For The Atomic Bomb Victims"
    },
    {
        " Nagasaki Peace Park": "Nagasaki Peace Park"
    },
    {
        " Peace Pagoda": "Peace Pagoda"
    },
    {
        "    Nagasaki Chinatown": "Nagasaki Chinatown"
    },
    {
        " Nagasaki Subtropical Botanical Garden": "Nagasaki Subtropical Botanical Garden"
    },
    {
        " Nyoko-do Hermitage": "Nyoko-Do Hermitage"
    },
    {
        " Oranda-zaka": "Oranda-Zaka"
    },
    {
        " Sannō Shrine": "Sannō Shrine"
    },
    {
        " - One-legged stone  torii , sometimes called an arch or gateway   ": null
    },
    {
        "Sakamoto International Cemetery": "Sakamoto International Cemetery"
    },
    {
        " Shōfuku-ji": "Shōfuku-Ji"
    },
    {
        " Siebold Memorial Museum": "Siebold Memorial Museum"
    },
    {
        " Sōfuku-ji": "Sōfuku-Ji"
    },
    {
        " - Daiyūhōden and Daiippomon are national treasures of Japan.   ": null
    },
    {
        "Suwa Shrine": "Suwa Shrine"
    },
    {
        " Syusaku Endo Literature Museum": "Syusaku Endo Literature Museum"
    },
    {
        " Twenty-Six Martyrs Museum and Monument": "Twenty-Six Martyrs Museum And Monument"
    },
    {
        " Urakami Cathedral": "Urakami Cathedral"
    },
    {
        "  Sōfuku-ji": "Sōfuku-Ji"
    },
    {
        "               The ": null
    },
    {
        "Prince Takamatsu Cup Nishinippon Round-Kyūshū Ekiden": "Prince Takamatsu Cup Nishinippon Round-Kyūshū Ekiden"
    },
    {
        ", the worlds longest ": null
    },
    {
        "relay race": "Relay Race"
    },
    {
        ", begins in Nagasaki each November.     ": null
    },
    {
        "Kunchi": "Nagasaki Kunchi"
    },
    {
        ", the most famous festival in Nagasaki, is held from October 7–9.     The Nagasaki Lantern Festival,  celebrating the ": null
    },
    {
        "Chinese New Year": "Chinese New Year"
    },
    {
        ", is celebrated from February 18 to March 4.       ": null
    },
    {
        "Castella": "Castella"
    },
    {
        " Champon": "Champon"
    },
    {
        " Sara udon": "Sara Udon"
    },
    {
        " Chinese confections": "Chinese Dessertscandies"
    },
    {
        " Turkish rice       ": null
    },
    {
        "a": "A"
    }
]