[
    {
        "        Naomi Klein is a Canadian author, ": null
    },
    {
        "social activist": "Activism"
    },
    {
        ", and filmmaker known for her political analyses and criticism ": null
    },
    {
        "of corporate globalization": "Anti-Globalisation"
    },
    {
        " and ": null
    },
    {
        "of capitalism": "Criticism Of Capitalism"
    },
    {
        ".  On a three-year appointment from September 2018, she is the Gloria Steinem Chair in Media, Culture, and Feminist Studies at ": null
    },
    {
        "Rutgers University": "Rutgers University"
    },
    {
        ".       Klein first became known internationally for her book  No Logo  ;  The Take  , a documentary film about ": null
    },
    {
        "Argentinas occupied factories": "Workers Self-Managementthe F.C3.A1Bricas Recuperadas Movement"
    },
    {
        ", written by her, and directed by her husband ": null
    },
    {
        "Avi Lewis": "Avi Lewis"
    },
    {
        "; and significantly for  The Shock Doctrine  , a critical analysis of the history of ": null
    },
    {
        "neoliberal": "Neoliberalism"
    },
    {
        " economics that was adapted into a six-minute companion film by ": null
    },
    {
        "Alfonso": "Alfonso Cuarón"
    },
    {
        " and ": null
    },
    {
        "Jonás Cuarón": "Jonás Cuarón"
    },
    {
        ",  as well as a feature-length documentary by ": null
    },
    {
        "Michael Winterbottom": "Michael Winterbottom"
    },
    {
        ". Jones, Sam;  Guardian.co.uk, August 28, 2009     Kleins  This Changes Everything: Capitalism vs. the Climate  was a  New York Times Bestseller List  non-fiction bestseller and the winner of the ": null
    },
    {
        "Hilary Weston Writers Trust Prize for Nonfiction": "Hilary Weston Writers Trust Prize For Nonfiction"
    },
    {
        " in its year.  In 2016, Klein was awarded the ": null
    },
    {
        "Sydney Peace Prize": "Sydney Peace Prize"
    },
    {
        " for her activism on climate justice.  Klein frequently appears on global and national lists of top influential thinkers, including the 2014 Thought Leaders ranking compiled by the ": null
    },
    {
        "Gottlieb Duttweiler Institute": "Gottlieb Duttweiler Institute"
    },
    {
        ",   Prospect  magazines world thinkers 2014 poll,  and Macleans 2014 Power List.  She is a member of the board of directors of the climate activist group ": null
    },
    {
        "350.org": "350.Org"
    },
    {
        ".        Naomi Klein was born in ": null
    },
    {
        "Montreal": "Montreal"
    },
    {
        ", ": null
    },
    {
        "Quebec": "Quebec"
    },
    {
        ", and brought up in a ": null
    },
    {
        "Jew": "Jew"
    },
    {
        "ish family with a history of ": null
    },
    {
        "peace activism": "Peace Movement"
    },
    {
        ". Her parents were self-described ": null
    },
    {
        "hippies": "Hippies"
    },
    {
        " Klein, Naomi. No Logo , pp. 143-4. who ": null
    },
    {
        "moved to Montreal from the U.S.": "American Canadians"
    },
    {
        " in 1967 as ": null
    },
    {
        "war resisters": "Opposition To The U.S. Involvement In The Vietnam War"
    },
    {
        " to the ": null
    },
    {
        "Vietnam War": "Vietnam War"
    },
    {
        ".  Her mother, ": null
    },
    {
        "documentary film-maker": "Documentary Film"
    },
    {
        " Bonnie Sherr Klein": "Bonnie Sherr Klein"
    },
    {
        ", is best known for her ": null
    },
    {
        "anti-pornography": "Anti-Pornography Movement"
    },
    {
        " film  Not a Love Story .  Her father, Michael Klein, is a physician and a member of ": null
    },
    {
        "Physicians for Social Responsibility": "Physicians For Social Responsibility"
    },
    {
        ". Her brother, Seth Klein, is director of the ": null
    },
    {
        "British Columbia": "British Columbia"
    },
    {
        "n office of the ": null
    },
    {
        "Canadian Centre for Policy Alternatives": "Canadian Centre For Policy Alternatives"
    },
    {
        ".     Before World War II, her paternal grandparents were communists, but they began to turn against the Soviet Union after the ": null
    },
    {
        "Molotov–Ribbentrop Pact": "Molotov–Ribbentrop Pact"
    },
    {
        " in 1939. In 1942, her grandfather, an animator at ": null
    },
    {
        "Disney": "Disney"
    },
    {
        ", was fired after ": null
    },
    {
        "the 1941 strike": "Disney Animators Strike"
    },
    {
        ",  and had to switch to working in a shipyard instead.  By 1956 they had abandoned communism. Kleins father grew up surrounded by ideas of ": null
    },
    {
        "social justice": "Social Justice"
    },
    {
        " and ": null
    },
    {
        "racial equality": "Racial Equality"
    },
    {
        ", but found it difficult and frightening to be the child of Communists , a so-called ": null
    },
    {
        "red diaper baby": "Red Diaper Baby"
    },
    {
        ".     Kleins husband, ": null
    },
    {
        "Avi Lewis": "Avi Lewis"
    },
    {
        ", was born into a well-connected political and journalistic family; he works as a TV journalist and documentary filmmaker. The couples only child, son Toma, was born on June 13, 2012.          Klein spent much of her teenage years in ": null
    },
    {
        "shopping malls": "Shopping Mall"
    },
    {
        ", obsessed with ": null
    },
    {
        "designer labels": "Designer Label"
    },
    {
        ". As a child and teenager, she found it very oppressive to have a very public feminist mother and she rejected politics, instead embracing full-on ": null
    },
    {
        "consumerism": "Consumerism"
    },
    {
        " .     She has attributed her change in worldview to two catalysts. One was when she was 17 and preparing for the ": null
    },
    {
        "University of Toronto": "University Of Toronto"
    },
    {
        ", her mother had a stroke and became severely disabled. Naomi, her father, and her brother took care of Bonnie through the period in hospital and at home, making educational sacrifices to do so.  That year off prevented her from being such a brat .  The next year, after beginning her studies at the ": null
    },
    {
        "University of Toronto": "University Of Toronto"
    },
    {
        ", the second catalyst occurred: the 1989 ": null
    },
    {
        "École Polytechnique massacre": "École Polytechnique Massacre"
    },
    {
        " of female engineering students, which proved to be a wake-up call to ": null
    },
    {
        "feminism": "Feminism"
    },
    {
        ".      Kleins writing career began with contributions to  The Varsity , a student newspaper, where she served as editor-in-chief. After her third year at the University of Toronto, she dropped out of university to take a job at  The Globe and Mail , followed by an editorship at  This Magazine . In 1995, she returned to the University of Toronto with the intention of finishing her degree  but left academia for a journalism internship before acquiring the final credits required to complete her degree. Q & A Interview with Brian Lamb, on CSPAN, dated November 29, 2009,          No Logo   In 1999, Klein published the book  No Logo , which for many became a ": null
    },
    {
        "manifesto": "Manifesto"
    },
    {
        " of the ": null
    },
    {
        "anti-globalization": "Anti-Globalization"
    },
    {
        " movement. In it, she attacks ": null
    },
    {
        "brand": "Brand Name"
    },
    {
        "-oriented ": null
    },
    {
        "consumer culture": "Consumer Culture"
    },
    {
        " and the operations of large ": null
    },
    {
        "corporations": "Corporation"
    },
    {
        ". She also accuses several such corporations of unethically exploiting workers in the worlds poorest countries in pursuit of greater profits. In this book, Klein criticized ": null
    },
    {
        "Nike": "Nike, Inc."
    },
    {
        " so severely that Nike published a point-by-point response.  No Logo became an international bestseller, selling over one million copies in over 28 languages.     Fences and Windows      Kleins  Fences and Windows  is a collection of her articles and speeches written on behalf of the ": null
    },
    {
        "anti-globalization": "Anti-Globalization"
    },
    {
        " movement .      The Take    The Take  , a ": null
    },
    {
        "documentary film": "Documentary Film"
    },
    {
        " collaboration by Klein and Lewis, concerns factory workers in ": null
    },
    {
        "Argentina": "Argentina"
    },
    {
        " who ": null
    },
    {
        "took over a closed plant": "Recovered Factory"
    },
    {
        " and resumed production, operating as a ": null
    },
    {
        "collective": "Collective"
    },
    {
        ". The first African screening was in the Kennedy Road shack settlement in the South African city of ": null
    },
    {
        "Durban": "Durban"
    },
    {
        ", where the ": null
    },
    {
        "Abahlali baseMjondolo": "Abahlali Basemjondolo"
    },
    {
        " movement began.      An article in  Z Communications  criticized The Take for its portrayal of the Argentine general and politician ": null
    },
    {
        "Juan Domingo Perón": "Juan Domingo Perón"
    },
    {
        " arguing that he was falsely portrayed as a social democrat.      The Shock Doctrine      Kleins third book, The Shock Doctrine: The Rise of Disaster Capitalism, was published on September 4, 2007. The book argues that the free market policies of Nobel Laureate ": null
    },
    {
        "Milton Friedman": "Milton Friedman"
    },
    {
        " and the ": null
    },
    {
        "Chicago School of Economics": "Chicago School"
    },
    {
        " have risen to prominence in countries such as ": null
    },
    {
        "Chile, under Pinochet": "Military Government Of Chile"
    },
    {
        ", Poland, ": null
    },
    {
        "Russia, under Yeltsin": "Economy Of Russia"
    },
    {
        ". The book also argues that policy initiatives  were rushed through while the citizens of these countries were in shock from disasters, upheavals, or invasion. The book became an international and ": null
    },
    {
        "New York Times bestseller": "The New York Times Bestseller"
    },
    {
        " and was translated into 28 languages.      Central to the books thesis is the contention that those who wish to implement unpopular ": null
    },
    {
        "free market": "Free Market"
    },
    {
        " policies now routinely do so by taking advantage of certain features of the aftermath of major disasters, be they economic, political, military or natural. The suggestion is that when a society experiences a major shock there is a widespread desire for a rapid and decisive response to correct the situation; this desire for bold and immediate action provides an opportunity for unscrupulous actors to implement policies which go far beyond a legitimate response to disaster. The book suggests that when the rush to act means the specifics of a response will go unscrutinized, that is the moment when unpopular and unrelated policies will intentionally be rushed into effect. The book appears to claim that these shocks are in some cases intentionally encouraged or even manufactured.     Klein identifies the shock doctrine , elaborating on ": null
    },
    {
        "Joseph Schumpeter": "Joseph Schumpeter"
    },
    {
        ", as the latest in capitalisms phases of creative destruction .      The Shock Doctrine was adapted into a ": null
    },
    {
        "short film": "Short Film"
    },
    {
        " of the same name, released onto ": null
    },
    {
        "YouTube": "Youtube"
    },
    {
        ".  The original is no longer available on the site, however, a duplicate was published in 2008.  The film was directed by ": null
    },
    {
        "Jonás Cuarón": "Jonás Cuarón"
    },
    {
        ", produced and co-written by his father ": null
    },
    {
        "Alfonso Cuarón": "Alfonso Cuarón"
    },
    {
        ". The original video was viewed over one million times.      The publication of The Shock Doctrine increased Kleins prominence, with  The New Yorker  judging her the most visible and influential figure on the American left—what ": null
    },
    {
        "Howard Zinn": "Howard Zinn"
    },
    {
        " and ": null
    },
    {
        "Noam Chomsky": "Noam Chomsky"
    },
    {
        " were thirty years ago. On February 24, 2009, the book was awarded the inaugural ": null
    },
    {
        "Warwick Prize for Writing": "Warwick Prize For Writing"
    },
    {
        " from the ": null
    },
    {
        "University of Warwick": "University Of Warwick"
    },
    {
        " in England. The prize carried a cash award of £50,000.     This Changes Everything: Capitalism vs. the Climate   Kleins fourth book,  This Changes Everything: Capitalism vs. the Climate  was published in September 2014.  The book puts forth the argument that the hegemony of ": null
    },
    {
        "neoliberal": "Neoliberal"
    },
    {
        " market fundamentalism": "Market Fundamentalism"
    },
    {
        " is blocking any serious reforms to halt climate change and protect the environment. Rob Nixon . .  The New York Times . Retrieved December 7, 2014. Questioned about Kleins claim that capitalism and controlling climate change were incompatible, Benoit Blarel, manager of the Environment and Natural Resources global practice at the World Bank, said that the write-off of fossil fuels necessary to control climate change will have a huge impact all over and that the World Bank was starting work on this .  The book won the 2014 ": null
    },
    {
        "Hilary Weston Writers Trust Prize for Nonfiction": "Hilary Weston Writers Trust Prize For Nonfiction"
    },
    {
        ", . ": null
    },
    {
        "CBC Books": "Cbc Arts"
    },
    {
        ", October 14, 2014. and was a shortlisted nominee for the 2015 ": null
    },
    {
        "Shaughnessy Cohen Prize for Political Writing": "Shaughnessy Cohen Prize For Political Writing"
    },
    {
        ". .  The Globe and Mail , January 27, 2015.     No Is Not Enough: Resisting Trumps Shock Politics and Winning the World We Need No Is Not Enough : Resisting Trumps Shock Politics and Winning the World We Need was published in June 2017. It has also been published Internationally with the alternative subtitle Defeating the New Shock Politics.      The Battle for Paradise: Puerto Rico Takes on the Disaster CapitalistsThe Battle For Paradise: Puerto Rico Takes on the Disaster Capitalists covers what San Juan Mayor ": null
    },
    {
        "Carmen Yulín Cruz": "Carmen Yulín Cruz"
    },
    {
        " refers to as the post-Hurricane Maria unmasked colonialism leading to inequality and creating a fierce humanitarian crisis.      On Fire: The Case for a Green New Deal On Fire: The Case for a Green New Deal and it was published on September 17, 2019.  On Fire is a collection of essays focusing on climate change and the urgent actions needed to preserve the planet. Klein relates her meeting with ": null
    },
    {
        "Greta Thunberg": "Greta Thunberg"
    },
    {
        " in the opening essay in which she discusses the entrance of young people into those speaking out for climate awareness and change. She supports the ": null
    },
    {
        "Green New Deal": "Green New Deal"
    },
    {
        " throughout the book and in the final essay she discusses the ": null
    },
    {
        "2020 U.S. election": "2020 U.S. Election"
    },
    {
        " saying The stakes of the election are almost unbearably high. It’s why I wrote the book and decided to put it out now and why I’ll be doing whatever I can to help push people toward supporting a candidate with the most ambitious Green New Deal platform—so that they win the primaries and then the general.         Klein has written on various current issues, such as the ": null
    },
    {
        "Iraq War": "Iraq War"
    },
    {
        ". In a September 2004 article for  Harpers Magazine ,  she argues that, contrary to popular belief, the ": null
    },
    {
        "Bush administration": "George W. Bush Administration"
    },
    {
        " did have a clear plan for post-invasion Iraq, which was to build a completely unconstrained ": null
    },
    {
        "free market economy": "Free Market Economics"
    },
    {
        ". She describes plans to allow foreigners to extract wealth from Iraq, and the methods used to achieve those goals.   The film  War, Inc.  was partially inspired by her article, Baghdad Year Zero .      Kleins August 2004 Bring Najaf to New York , published in The Nation, argued that ": null
    },
    {
        "Muqtada Al Sadrs": "Muqtada Al Sadr"
    },
    {
        " Mahdi Army": "Mahdi Army"
    },
    {
        " represents the overwhelmingly mainstream sentiment in Iraq.  She went on to say Yes, if elected Sadr would try to turn Iraq into a ": null
    },
    {
        "theocracy": "Theocracy"
    },
    {
        " like Iran, but for now his demands are for direct elections and an end to foreign occupation . ": null
    },
    {
        "Marc Cooper": "Marc Cooper"
    },
    {
        ", a former Nation columnist, attacked the assertion that Al Sadr represented mainstream Iraqi sentiment and that American forces had brought the fight to the holy city of ": null
    },
    {
        "Najaf": "Najaf"
    },
    {
        ".  Cooper wrote that Klein should know better. All enemies of the U.S. occupation she opposes are not her friends. Or ours. Or those of the Iraqi people. I don’t think that Mullah Al Sadr, in any case, is much desirous of support issuing from secular Jewish feminist-socialists.       Klein signed a 2004 petition entitled, “We would vote for ": null
    },
    {
        "Hugo Chávez": "Hugo Chávez"
    },
    {
        ".”  In 2007 she described ": null
    },
    {
        "Venezuela": "Venezuela"
    },
    {
        " under the Chávez government as a country where citizens had renewed their faith in the power of democracy to improve their lives, and described Venezuela as a place sheltered by Chávezs policies from the economic shocks produced by capitalism.  Rather, according to Klein, Chávez protected his country from financial crisis by building “a zone of relative economic calm and predictability.”  According to reviewer ": null
    },
    {
        "Todd Gitlin": "Todd Gitlin"
    },
    {
        ", who described the overall argument of Kleins 2007 book  The Shock Doctrine  as more right than wrong, Klein is a romantic, who expected that the Chávez government would produce a bright future in which worker-controlled co-operatives would run the economy.  The Shock Doctrine was consistent with her prior thinking about ": null
    },
    {
        "globalization": "Globalization"
    },
    {
        ", and in that book she describes Chávez policies as an example of public control of some sectors of the economy as protecting poor people from harm caused by globalization.  After the ": null
    },
    {
        "collapse": "Crisis In Venezuela"
    },
    {
        " of the ": null
    },
    {
        "Venezuelan economy": "Economy Of Venezuela"
    },
    {
        " and alleged erosion of its democratic institutions under Chávez successor ": null
    },
    {
        "Nicolás Maduro": "Nicolás Maduro"
    },
    {
        ", Klein and other people who had supported Chávez were criticized by writers such as ": null
    },
    {
        "James Kirchick": "James Kirchick"
    },
    {
        "  and Mark Milke.          In March 2008, Klein was the keynote speaker at the first national conference of the ": null
    },
    {
        "Alliance of Concerned Jewish Canadians": "Independent Jewish Voices"
    },
    {
        ". In January 2009, during the ": null
    },
    {
        "Gaza War": "Gaza War"
    },
    {
        ", Klein supported the ": null
    },
    {
        "Boycott, Divestment and Sanctions": "Boycott, Divestment And Sanctions"
    },
    {
        " campaign against ": null
    },
    {
        "Israel": "Israel"
    },
    {
        ", arguing that the best strategy to end the increasingly bloody occupation is for Israel to become the target of the kind of global movement that put an end to apartheid in South Africa.      In summer 2009, on the occasion of the publication of the ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " translation of her book The Shock Doctrine, Klein visited Israel, the ": null
    },
    {
        "West Bank": "West Bank"
    },
    {
        ", and ": null
    },
    {
        "Gaza": "Gaza Strip"
    },
    {
        ", combining the promotion of her book and the BDS campaign. In an interview to the Israeli newspaper  Haaretz  she emphasized that it is important to her not to boycott Israelis but rather to boycott the normalization of Israel and the conflict.  In a speech in ": null
    },
    {
        "Ramallah": "Ramallah"
    },
    {
        " on June 27, she apologized to the ": null
    },
    {
        "Palestinians": "Palestinians"
    },
    {
        " for not joining the BDS campaign earlier.  Her remarks, particularly that even think we get one get-away-with-genocide-free card were characterized by Noam Schimmel, an op-ed columnist in  The Jerusalem Post , as violent and unethical , and as the most perverse of aspersions on Jews, an age-old stereotype of Jews as intrinsically evil and malicious.      Klein was also a spokesperson for the protest against the ": null
    },
    {
        "spotlight on Tel Aviv": "2009 Toronto International Film Festivalcontroversy Over Tel Aviv Spotlight"
    },
    {
        " at the ": null
    },
    {
        "2009 Toronto International Film Festival": "2009 Toronto International Film Festival"
    },
    {
        ", a spotlight that Klein said was a very selective and misleading portrait of Israel.                Since 2009, Kleins attention has turned to environmentalism, with particular focus on ": null
    },
    {
        "climate change": "Climate Change"
    },
    {
        ", the subject of her book  This Changes Everything  . , Democracy Now!, March 9, 2011. According to her website, the book and its accompanying film will be about how the ": null
    },
    {
        "climate crisis": "Climate Crisis"
    },
    {
        " can spur economic and political transformation. , Naomi Klein Official Web Site She sits on the board of directors of campaign group ": null
    },
    {
        "350.org": "350.Org"
    },
    {
        " 350.org Our Team:  and took part in their Do the Math tour in 2013, encouraging a divestment movement. , 350.org.     She has encouraged the ": null
    },
    {
        "Occupy movement": "Occupy Movement"
    },
    {
        " to join forces with the environmental movement, saying the financial crisis and the climate crisis have the same root—unrestrained corporate greed.  She gave a speech at ": null
    },
    {
        "Occupy Wall Street": "Occupy Wall Street"
    },
    {
        " where she described the world as upside down , where we act as if there is no end to what is actually finite—fossil fuels and the atmospheric space to absorb their emissions, and as if there are limits to what is actually bountiful—the financial resources to build the kind of society we need.      She has been a particularly vocal critic of the ": null
    },
    {
        "Athabasca oil sands": "Athabasca Oil Sands"
    },
    {
        " in Alberta, describing it in a ": null
    },
    {
        "TED talk": "Ted Talk"
    },
    {
        " as a form of terrestrial skinning.  On September 2, 2011, she attended the demonstration against the ": null
    },
    {
        "Keystone XL": "Keystone Xl"
    },
    {
        " pipeline outside the White House and was arrested.  Klein celebrated Obamas decision to postpone a decision on the ": null
    },
    {
        "Keystone pipeline": "Keystone Pipeline"
    },
    {
        " until 2013 pending an environmental review as a victory for the environmental movement.     She attended the ": null
    },
    {
        "Copenhagen Climate Summit of 2009": "2009 United Nations Climate Change Conference"
    },
    {
        ". She put the blame for the failure of Copenhagen on Barack Obama,  and described her own country, Canada, as a climate criminal.  She presented the Angry Mermaid Award to ": null
    },
    {
        "Monsanto": "Monsanto"
    },
    {
        ".      Writing in the wake of ": null
    },
    {
        "Hurricane Sandy": "Hurricane Sandy"
    },
    {
        " she warned that the climate crisis constitutes a massive opportunity for disaster capitalists and corporations seeking to profit from crisis. But equally, the climate crisis can be a historic moment to usher in the next great wave of progressive change, or a so-called Peoples Shock. The Nation,      On November 9, 2016, following the election of ": null
    },
    {
        "Donald Trump": "Donald Trump"
    },
    {
        " as the 45th ": null
    },
    {
        "President of the United States": "President Of The United States"
    },
    {
        ", Klein called for an international campaign to impose ": null
    },
    {
        "economic sanctions": "Economic Sanctions"
    },
    {
        " on the United States if his administration refuses to abide by the terms of the ": null
    },
    {
        "Paris Agreement": "Paris Agreement"
    },
    {
        ".           Klein contributes to  The Nation ,  In These Times ,  The Globe and Mail ,  This Magazine ,  Harpers Magazine , and  The Guardian , and is a senior contributor for  The Intercept .  She is a former Miliband Fellow and lectured at the ": null
    },
    {
        "London School of Economics": "London School Of Economics"
    },
    {
        " on the anti-globalization movement.  Her appointment as the inaugural Gloria Steinem Endowed Chair in Media, Culture and Feminist Studies at Rutgers University-New Brunswick began in October 2018 and runs for 3 years. The position is funded by foundations, endowments and individuals.     Klein ranked 11th in an internet poll of the ": null
    },
    {
        "top global intellectuals of 2005": "The 2005 Global Intellectuals Poll"
    },
    {
        ", a list of the worlds top 100 public intellectuals compiled by the  Prospect  magazine in conjunction with  Foreign Policy  magazine.  She was involved in ": null
    },
    {
        "2010 G-20 Toronto summit protests": "2010 G-20 Toronto Summit Protests"
    },
    {
        ", condemning police force and brutality. She spoke to a rally seeking the release of protesters in front of police headquarters on June 28, 2010.      On October 6, 2011, she visited ": null
    },
    {
        "Occupy Wall Street": "Occupy Wall Street"
    },
    {
        " and gave a speech declaring the protest movement the most important thing in the world .  On November 10, 2011, she participated in a panel discussion about the future of Occupy Wall Street with four other panelists, including ": null
    },
    {
        "Michael Moore": "Michael Moore"
    },
    {
        ", ": null
    },
    {
        "William Greider": "William Greider"
    },
    {
        ", and ": null
    },
    {
        "Rinku Sen": "Rinku Sen"
    },
    {
        ", in which she stressed the crucial nature of the evolving movement.    Klein also made an appearance in the British radio show  Desert Island Discs  on BBC Radio 4 in 2017.  In November 2017, the ": null
    },
    {
        "Democracy in Europe Movement 2025": "Democracy In Europe Movement 2025"
    },
    {
        " announced that Klein had been appointed to their Advisory Panel.      In November 2019, along with other public figures, Klein signed a letter supporting ": null
    },
    {
        "Labour Party": "Labour Party"
    },
    {
        " leader ": null
    },
    {
        "Jeremy Corbyn": "Jeremy Corbyn"
    },
    {
        " describing him as a beacon of hope in the struggle against emergent far-right nationalism, xenophobia and racism in much of the democratic world and endorsed him in the ": null
    },
    {
        "2019 UK general election": "2019 United Kingdom General Election"
    },
    {
        ".  In the same month, she  her endorsement of US presidential candidate ": null
    },
    {
        "Bernie Sanders": "Bernie Sanders"
    },
    {
        ", stating, I’ve written about my preferences but I have never formally endorsed a candidate for President in my life - never mind spoken at a . That ends today in Iowa. The world is on fire and our most credible hope of beating the arsonists is Bernie2020 NotMeUs       No Is Not Enough longlisted for the 2017 ": null
    },
    {
        "National Book Award for Nonfiction": "National Book Award For Nonfiction"
    },
    {
        " in the US   2014 ": null
    },
    {
        "Hilary Weston Writers Trust Prize for Nonfiction": "Hilary Weston Writers Trust Prize For Nonfiction"
    },
    {
        " for This Changes Everything  The Observer  Book of the Year, This Changes Everything This Changes Everything ": null
    },
    {
        "Warwick Prize for Writing": "Warwick Prize For Writing"
    },
    {
        ", for The Shock Doctrine The New York Times Critics’ Pick of the Year, The Shock Doctrine No Logo – Top 100 Non Fiction books of all-time list ,  The Guardian   Time  magazines list of Top 100 Non-Fiction books published since 1923, No Logo.   ": null
    },
    {
        "Sydney Peace Prize": "Sydney Peace Prize"
    },
    {
        ", 2016   Honorary doctorate, ": null
    },
    {
        "Saint Thomas University": "St. Thomas University"
    },
    {
        "    Honorary doctorate, ": null
    },
    {
        "University of Amsterdam": "University Of Amsterdam"
    },
    {
        "                           The Corporation     The Take     The Shock Doctrine    https://www.imdb.com/title/tt2385027/?refnvsr1 Catastroika    This Changes Everything ": null
    }
]