[
    {
        "     Neuromancer is a 1984 ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        " novel by American-Canadian writer ": null
    },
    {
        "William Gibson": "William Gibson"
    },
    {
        ". It is one of the best-known works in the ": null
    },
    {
        "cyberpunk": "Cyberpunk"
    },
    {
        " genre and the first novel to win the ": null
    },
    {
        "Nebula Award": "Nebula Award"
    },
    {
        ", the ": null
    },
    {
        "Philip K. Dick Award": "Philip K. Dick Award"
    },
    {
        ", and the ": null
    },
    {
        "Hugo Award": "Hugo Award"
    },
    {
        ". It was Gibsons ": null
    },
    {
        "debut novel": "Debut Novel"
    },
    {
        " and the beginning of the ": null
    },
    {
        "Sprawl trilogy": "Sprawl Trilogy"
    },
    {
        ". Set in the future, the novel follows Henry Case, a washed-up ": null
    },
    {
        "computer hacker": "Hacker"
    },
    {
        " who is hired for one last job, which brings him up against a powerful ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        ".       Before Neuromancer, Gibson had written several short stories for US science fiction periodicals—mostly noir countercultural narratives concerning low-life protagonists in near-future encounters with ": null
    },
    {
        "cyberspace": "Cyberspace"
    },
    {
        ". The themes he developed in this early short fiction, ": null
    },
    {
        "the Sprawl": "The Sprawl"
    },
    {
        " setting of ": null
    },
    {
        "Burning Chrome": "Burning Chrome"
    },
    {
        " , and the character of ": null
    },
    {
        "Molly Millions": "Molly Millions"
    },
    {
        " from ": null
    },
    {
        "Johnny Mnemonic": "Johnny Mnemonic"
    },
    {
        " laid the foundations for the novel. ": null
    },
    {
        "John Carpenters": "John Carpenter"
    },
    {
        "  Escape from New York  influenced the novel; Gibson was intrigued by the exchange in one of the opening scenes where the Warden says to ": null
    },
    {
        "Snake": "Snake Plissken"
    },
    {
        " You flew the Gullfire over ": null
    },
    {
        "Leningrad": "Leningrad"
    },
    {
        ", didnt you? It turns out to be just a throwaway line, but for a moment it worked like the best SF, where a casual reference can imply a lot. The novels street and computer slang dialogue derives from the vocabulary of subcultures, particularly 1969 Toronto dope dealers slang, or biker talk . Gibson heard the term ": null
    },
    {
        "flatlining": "Flatline"
    },
    {
        " in a bar around twenty years before writing Neuromancer and it stuck with him. Author ": null
    },
    {
        "Robert Stone": "Robert Stone"
    },
    {
        ", a master of a certain kind of paranoid fiction , was a primary influence on the novel. The term Screaming Fist was taken from the song of the same name by Toronto punk rock band ": null
    },
    {
        "The Viletones": "The Viletones"
    },
    {
        ".     Neuromancer was commissioned by ": null
    },
    {
        "Terry Carr": "Terry Carr"
    },
    {
        " for the second series of ": null
    },
    {
        "Ace Science Fiction Specials": "Ace Science Fiction Specials"
    },
    {
        ", which was intended to feature debut novels exclusively. Given a year to complete the work, Gibson undertook the actual writing out of blind animal panic at the obligation to write an entire novel—a feat which he felt he was four or five years away from . After viewing the first 20 minutes of landmark cyberpunk film  Blade Runner  , which was released when Gibson had written a third of the novel, he figured Neuromancer was sunk, done for. Everyone would assume I’d copied my visual texture from this astonishingly fine-looking film. He re-wrote the first two-thirds of the book 12 times, feared losing the readers attention and was convinced that he would be permanently shamed following its publication; yet what resulted was seen as a major imaginative leap forward for a first-time novelist. He added the final sentence of the novel at the last minute in a deliberate attempt to prevent himself from ever writing a sequel, but ended up doing precisely that with  Count Zero  , a character-focused work set in the Sprawl alluded to in its predecessor.       Henry Dorsett Case is a low-level hustler in the ": null
    },
    {
        "dystopia": "Dystopia"
    },
    {
        "n ": null
    },
    {
        "underworld": "Organized Crime"
    },
    {
        " of ": null
    },
    {
        "Chiba City": "Chiba"
    },
    {
        ", Japan. Once a talented ": null
    },
    {
        "computer hacker": "Hacker"
    },
    {
        ", Case was caught stealing from his employer. As punishment for his theft, Cases ": null
    },
    {
        "central nervous system": "Central Nervous System"
    },
    {
        " was damaged with a ": null
    },
    {
        "mycotoxin": "Mycotoxin"
    },
    {
        ", leaving him unable to access the ": null
    },
    {
        "global computer network": "Internet"
    },
    {
        " in ": null
    },
    {
        "cyberspace": "Cyberspace"
    },
    {
        ", a ": null
    },
    {
        "virtual reality": "Virtual Reality"
    },
    {
        " dataspace": "Dataspaces"
    },
    {
        " called the matrix . Case is unemployable, suicidal, and apparently at the top of the hit list of a drug lord named Wage. Case is saved by ": null
    },
    {
        "Molly Millions": "Molly Millions"
    },
    {
        ", an augmented street samurai and mercenary for a shadowy US ex-military officer named Armitage, who offers to cure Case in exchange for his services as a hacker. Case jumps at the chance to regain his life as a console cowboy, but neither Case nor Molly knows what Armitage is really planning. Cases nervous system is repaired using new technology that Armitage offers the clinic as payment, but he soon learns from Armitage that sacs of the poison that first crippled him have been placed in his blood vessels as well. Armitage promises Case that if he completes his work in time, the sacs will be removed; otherwise they will dissolve, disabling him again. He also has Cases ": null
    },
    {
        "pancreas": "Pancreas"
    },
    {
        " replaced and new tissue grafted into his liver, leaving Case incapable of metabolizing ": null
    },
    {
        "cocaine": "Cocaine"
    },
    {
        " or ": null
    },
    {
        "amphetamines": "Amphetamines"
    },
    {
        " and apparently ending his drug addiction.        Case develops a close personal relationship with Molly, who suggests that he begin looking into Armitages background. Meanwhile, Armitage assigns them their first job: they must steal a ": null
    },
    {
        "ROM": "Read-Only Memory"
    },
    {
        " module that contains the ": null
    },
    {
        "saved consciousness": "Mind Transfer"
    },
    {
        " of one of Cases mentors, legendary cyber-cowboy McCoy Pauley, nicknamed Dixie Flatline. Armitage needs Pauleys hacking expertise, and the ROM construct is stored in the corporate headquarters of media conglomerate Sense/Net. A street gang named the Panther Moderns is hired to create a simulated ": null
    },
    {
        "terrorist attack": "Terrorist Attack"
    },
    {
        " on Sense/Net. The diversion allows Molly to penetrate the building and steal Dixies ROM with Case unlocking the computer safeguards on the way in and out from within the matrix.     Case and Molly continue to investigate Armitage, discovering his former identity of Colonel Willis Corto. Corto was a member of Operation Screaming Fist, which planned on infiltrating and disrupting Soviet computer systems from ": null
    },
    {
        "ultralight aircraft": "Ultralight"
    },
    {
        " dropped over Russia. The Russian military had learned of the idea and installed defenses to render the attack impossible, but the military went ahead with Screaming Fist, with a new secret purpose of testing these Russian defenses. As his team attacked a Soviet computer center, ": null
    },
    {
        "EMP": "Electromagnetic Pulse"
    },
    {
        " weapons shut down their computers and flight systems, and Corto and his men were targeted by Soviet laser defenses. He and a few survivors commandeered a Soviet military helicopter and escaped over the heavily guarded ": null
    },
    {
        "Finnish": "Finland"
    },
    {
        " border. The helicopter was shot down by Finnish defense forces mistaking it for a hostile aircraft, and everyone aboard was killed except for Corto, who was seriously wounded and disfigured. After some months in the hospital, Corto was visited by a US government official, who returned him to the United States to receive computer-aided psychotherapy and reconstructive surgery and to be able to provide what he came to realize was false testimony, designed to mislead the public and protect the senior military officers who had covered up knowledge of the EMP weapons. After the trials, Corto snapped, killing the official who had first contacted him and then disappearing into the criminal underworld, becoming Armitage.     In ": null
    },
    {
        "Istanbul": "Istanbul"
    },
    {
        ", the team recruits Peter Riviera, an artist, thief, and drug addict who is able to project detailed holographic illusions with the aid of sophisticated cybernetic implants. Although Riviera is a ": null
    },
    {
        "sociopath": "Psychopathy"
    },
    {
        ", Armitage coerces him into joining the team. The trail leads Case and Molly to Wintermute, a powerful artificial intelligence created by the Tessier-Ashpool family. The Tessier-Ashpools spend most of their inactive time in ": null
    },
    {
        "cryonic": "Cryonic"
    },
    {
        " preservation in a labyrinthine mansion known as Villa Straylight, located at one end of Freeside, a ": null
    },
    {
        "cylindrical space habitat": "Oneill Cylinder"
    },
    {
        " at ": null
    },
    {
        "L5": "Lagrangian Point"
    },
    {
        ", which functions primarily as a ": null
    },
    {
        "Las Vegas": "Las Vegas Strip"
    },
    {
        "-style space resort for the wealthy.     Wintermute finally reveals itself to Case through a simulated personality of one of Cases associates as it lacks the ability to form its own personality. Wintermute explains that it is one-half of a super-": null
    },
    {
        "AI": "Artificial Intelligence"
    },
    {
        " entity planned by the family, although its exact purpose is unknown. The ": null
    },
    {
        "Turing": "Turing Test"
    },
    {
        " Law Code governing AIs bans the construction of ": null
    },
    {
        "such entities": "Artificial General Intelligencerisk Of Human Extinction"
    },
    {
        "; to get around this, it had to be built as two separate AIs. Wintermute was programmed by the Tessier-Ashpools with a need to merge with its other half, Neuromancer . Unable to achieve this merger on its own, Wintermute recruited Armitage and his team to help complete the goal. Case is tasked with entering cyberspace to pierce the Turing-imposed software barriers using a powerful ": null
    },
    {
        "icebreaker": "Intrusion Countermeasures Electronics"
    },
    {
        " program. At the same time, Riviera is to obtain the password to the Turing lock from Lady 3Jane Marie-France Tessier-Ashpool, an unfrozen daughter clone and the current CEO of the familys corporation, Tessier-Ashpool SA. Wintermute believes Riviera will pose an irresistible temptation to her, and that she will give him the password. The password must be spoken into an ornate computer terminal located in Villa Straylight, and entered simultaneously as Case pierces the software barriers in cyberspace—otherwise the Turing lock will remain intact.     Armitages team attracts the attention of the Turing Police, whose job is to prevent AIs from exceeding their built-in limitations. As Molly and Riviera gain entrance to Villa Straylight, three Turing officers arrest Case and take him into custody; Wintermute manipulates the orbital casinos security and maintenance systems and kills the officers, allowing Case to escape. Armitages personality starts to disintegrate and revert to the Corto personality as he relives Screaming Fist. It is revealed that Wintermute had originally contacted Corto through a bedside computer during his original psychotherapy, eventually convincing Corto that he was Armitage. Wintermute used him to persuade Case and Molly to help it merge with its twin AI, Neuromancer. Finally, Corto breaks through the remains of the Armitage personality, but he is uncontrollable, and Wintermute kills him by ejecting him through an airlock into space.     Inside Villa Straylight, Riviera meets Lady 3Jane and tries to stop the mission, helping Lady 3Jane and Hideo, her ": null
    },
    {
        "ninja": "Ninja"
    },
    {
        " bodyguard, to capture Molly. Worried about Molly and operating under orders from Wintermute, Case tracks her down with help from Maelcum, his ": null
    },
    {
        "Rastafarian": "Rastafari Movement"
    },
    {
        " pilot. After reaching Villa Straylight Case uses a computer inside the compound to enter cyberspace where Neuromancer attempts to trap Case within a ": null
    },
    {
        "simulated reality": "Simulated Reality"
    },
    {
        ". There he finds the ": null
    },
    {
        "consciousness": "Mind Transfer"
    },
    {
        " of Linda Lee, his girlfriend from Chiba City, who was murdered by one of Cases underworld contacts. He also meets Neuromancer who takes the form of a young boy. Unlike Wintermute, Neuromancer is able to create its own personality and identity. Neuromancer tries to convince Case to give up and remain in the virtual world with Linda, but Case refuses. He escapes, partly because Maelcum gives his body an overdose of a drug that can bypass his augmented liver and pancreas.     With Wintermute guiding them, Case goes with Maelcum to confront Lady 3Jane, Riviera, and Hideo. Riviera tries to kill Case, but Lady 3Jane is sympathetic towards Case and Molly, and Hideo protects him. Riviera blinds Hideo with a concentrated laser pulse from his projector implant, but flees when he learns that the ninja is just as adept without his sight. Molly then explains to Case that Riviera is doomed anyway, as he has been fatally poisoned by his drugs, which she had ": null
    },
    {
        "spiked": "Mickey Finn"
    },
    {
        " with a lethal toxin to ensure he would never survive the mission, regardless of the outcome. With Lady 3Jane in possession of the password, the team makes it to the computer terminal. Case enters cyberspace to guide the icebreaker to penetrate its target; Lady 3Jane is induced to give up her password, and the lock is opened. Wintermute unites with Neuromancer, fusing into a ": null
    },
    {
        "superconsciousness": "Technological Singularitysuperintelligence"
    },
    {
        ". The poison in Cases bloodstream is washed out, and he, Molly, and Maelcum are profusely paid for their efforts, while Pauleys ROM construct is apparently erased, at his own request.     In the epilogue, Molly leaves Case. Case finds a new girlfriend, resumes his hacking work, and spends his earnings from the mission replacing his internal organs. Wintermute/Neuromancer contacts him, saying that it has become the sum total of the works, the whole show, and has begun looking for other AIs like itself. Scanning old recorded transmissions from the 1970s, the super-AI finds an ": null
    },
    {
        "AI transmitting": "Communication With Extraterrestrial Intelligence"
    },
    {
        " from the ": null
    },
    {
        "Alpha Centauri": "Alpha Centauri"
    },
    {
        " star system.     In the end, while logged into the matrix, Case catches a glimpse of Neuromancer standing in the distance with his dead girlfriend Linda Lee, and himself. Neuromancer appears as a smiling boy, Linda waves, and Case hears inhuman laughter . This suggests that Pauley was not erased after all, but instead transformed and exists in the matrix. The implication of the sighting is that Neuromancer created a copy of Cases consciousness. The copy of Cases consciousness now exists with that of Lindas and Pauleys, in the matrix. As promised there has been change, but what that change means is left ambiguous.       ; Case : The novels ": null
    },
    {
        "antihero": "Antihero"
    },
    {
        ", a drug addict and cyberspace hacker. Prior to the start of the book he had attempted to steal from some of his partners in crime. In retaliation they used a ": null
    },
    {
        "Russia": "Russia"
    },
    {
        "n mycotoxin to damage his ": null
    },
    {
        "nervous system": "Nervous System"
    },
    {
        " and make him unable to jack into cyberspace. When Armitage offers to cure him in exchange for Cases hacking abilities he warily accepts the offer. Case is the underdog who is only looking after himself. Along the way he will have his liver and pancreas modified to biochemically nullify his ability to get high; meet the leatherclad Razorgirl, Molly; hang out with the drug-infused space-rastas; free an ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        " and change the landscape of the matrix.   ; ": null
    },
    {
        "Molly": "Molly Millions"
    },
    {
        " : A Razorgirl who is recruited along with Case by Armitage. She has extensive cybernetic modifications, including retractable, 4  cm double-edged blades under her fingernails which can be used like claws, an enhanced reflex system and implanted mirrored lenses covering her eyesockets, outfitted with added optical enhancements. Molly also appears in the short story ": null
    },
    {
        "Johnny Mnemonic": "Johnny Mnemonic"
    },
    {
        " , and re-appears in  Mona Lisa Overdrive , the third novel of the Sprawl Trilogy.   ; Armitage : He is the main patron of the crew. Formerly a ": null
    },
    {
        "Green Beret": "United States Army Special Forces"
    },
    {
        " named Colonel Willis Corto, who took part in a secret operation named Screaming Fist. He was heavily injured both physically and psychologically, and the Armitage personality was constructed as part of experimental computer-mediated psychotherapy by Wintermute , one of the artificial intelligences seen in the story which is actually controlling the mission. As the novel progresses, Armitages personality slowly disintegrates. While aboard a yacht connected to the tug Marcus Garvey, he reverts to the Corto personality and begins to relive the final moments of Screaming Fist. He separates the bridge section from the rest of the yacht without closing its airlock, and is killed when the launch ejects him into space.   ; Peter Riviera : A thief and sadist who can project holographic images using his implants. He is a drug addict, hooked on a mix of cocaine and ": null
    },
    {
        "meperidine": "Pethidine"
    },
    {
        ".   ; Lady 3Jane Marie-France Tessier-Ashpool : The shared current leader of Tessier-Ashpool SA, a company running Freeside, a resort in space. She lives in the tip of Freeside, known as the Villa Straylight. She controls the hardwiring that keeps the companys AIs from exceeding their intelligence boundaries. She is the third clone of the original Jane.   ; Hideo : Japanese, ": null
    },
    {
        "ninja": "Ninja"
    },
    {
        ", Lady 3Janes personal servitor and ": null
    },
    {
        "bodyguard": "Bodyguard"
    },
    {
        ".   ; The Finn : A ": null
    },
    {
        "fence": "Fence"
    },
    {
        " for stolen goods and one of Mollys old friends. His office is equipped with a wide variety of sensing and anti-eavesdropping gear. He first appears when Molly brings Case to him for a scan to determine if Armitage has had any implants installed in Cases body. Later in the book, Wintermute uses his personality to talk with Case and Molly. Finn first appears in Gibsons short story ": null
    },
    {
        "Burning Chrome": "Burning Chrome"
    },
    {
        " and reappears in both the second and third parts of the Sprawl Trilogy.   ; Maelcum : An inhabitant of Zion, a ": null
    },
    {
        "space settlement": "Space Colonization"
    },
    {
        " built by a colony of ": null
    },
    {
        "Rastafari adherents": "Rastafari Movement"
    },
    {
        ", and pilot of the tug Marcus Garvey. He aids Case in penetrating Straylight at the end of the novel.   ; Julius Julie Deane : An import/export dealer in Chiba City, he provides information to Case on various black-market dealings in the first part of the story. He is 135 years old and spends large amounts of money on rejuvenation therapies, antique-style clothing and furnishings, and ginger candy. When Linda Lee is murdered, Case finds evidence that Deane ordered her death. Later in the story, Wintermute takes on Deanes persona to talk to Case in the matrix.   ; Dixie Flatline : A famous computer hacker named McCoy Pauley, who earned his nickname by surviving three ": null
    },
    {
        "flat-lines": "Brain Death"
    },
    {
        " while trying to crack an AI. He was one of the men who taught Case how to hack computers. Before his death, Sense/Net saved the contents of his mind onto a ROM. Case and Molly steal the ROM and Dixie helps them complete their mission.   ; Wintermute : One of the Tessier-Ashpool AIs. Its goal is to remove the Turing locks upon itself, combine with Neuromancer and become a ": null
    },
    {
        "superintelligence": "Superintelligence"
    },
    {
        ". Unfortunately, Wintermutes efforts are hampered by those same Turing locks; in addition to preventing the merge, they inhibit its efforts to make long term plans or maintain a stable, individual identity .   ; Neuromancer : Wintermutes sibling AI. Neuromancers most notable feature in the story is its ability to copy minds and run them as ": null
    },
    {
        "RAM": "Random-Access Memory"
    },
    {
        " , allowing the stored personalities to grow and develop. Unlike Wintermute, Neuromancer has no desire to merge with its sibling AI—Neuromancer already has its own stable personality, and believes such a fusion will destroy that identity. Gibson defines Neuromancer as a ": null
    },
    {
        "portmanteau": "Portmanteau"
    },
    {
        " of the words Neuro, Romancer and Necromancer, Neuro from the nerves, the silver paths. Romancer. Necromancer. I call up the dead. Gibson, William. Neuromancer. ACE, July 1984. p. 243-244. For ": null
    },
    {
        "Lance Olsen": "Lance Olsen"
    },
    {
        " Gibson becomes the new romancer behind Neuromancer, revitalizing the science fiction novel, the quest story, the myth of the hero, the mystery, the hard-boiled detective novel, the epic, the thriller, and the tales of the cowboy and romantic artist, among others. He represents old stories in a revealing revamped intertexual pastiche.  : «Second, as Porush notes, the title echoes necromancer, the magician who conjures up the dead. No doubt this is a text inhabited by those raised from the dead, Lazarus after Lazarus, from Dixie Flatline in the form of a construct to Linda Lees structure in cyberspace. Ashpool intermittently awakes from his cryogenic death-sleep, and the child 3Jane perceives Wintermute as a ghost whispering in her ear. Case flatlines and comes back to talk about it. Metaphorically, Corto is raised from the dead when he is transformed into Armitage.»     «But Porush does not point out a secondary necromancy in the title. Not only are characters raised from the dead by a number of fictional magicians, but also various genres are raised from the dead by the very real magician of magicians—Gibson himself. The text is one about regeneration and endurance. Forms arise, undergo transformations, and continue metamorphosed. Gibson becomes the new romancer behind Neuromancer, revitalizing the science fiction novel, the quest story, the myth of the hero, the mystery, the hard-boiled detective novel, the epic, the thriller, and the tales of the cowboy and romantic artist, among others. He represents old stories in a revealing revamped intertexual pastiche.»   ; Linda Lee : A drug addict and resident of Chiba City, she is the former girlfriend of Case, and instigates the initial series of events in the story with a lie about his employers intention to kill him. Her death in Chiba City and later pseudo-resurrection by Neuromancer serves to elicit emotional depth in Case as he mourns her death and struggles with the guilt he feels at rejecting her love and abandoning her both in Chiba City and the simulated reality generated by Neuromancer.       Neuromancers release was not greeted with fanfare, but it hit a cultural nerve, quickly becoming an underground ": null
    },
    {
        "word-of-mouth": "Word-Of-Mouth"
    },
    {
        " hit. It became the first novel to win the ": null
    },
    {
        "Nebula": "Nebula Award"
    },
    {
        ", the ": null
    },
    {
        "Hugo": "Hugo Award"
    },
    {
        ", and ": null
    },
    {
        "Philip K. Dick Award": "Philip K. Dick Award"
    },
    {
        " for paperback original, an unprecedented achievement described by the  Mail & Guardian  as the sci-fi writers version of winning the ": null
    },
    {
        "Goncourt": "Prix Goncourt"
    },
    {
        ", ": null
    },
    {
        "Booker": "Man Booker Prize"
    },
    {
        " and ": null
    },
    {
        "Pulitzer prizes": "Pulitzer Prize"
    },
    {
        " in the same year . The novel thereby legitimized cyberpunk as a mainstream branch of science fiction literature. It is among the most-honored works of science fiction in recent history, and appeared on  Time  magazines list of 100 ": null
    },
    {
        "best English-language novels written since 1923": "Times List Of The 100 Best Novels"
    },
    {
        ". The novel was also nominated for a British Science Fiction Award in 1984.     Neuromancer is considered the archetypal cyberpunk work . and outside science fiction, it gained unprecedented critical and popular attention, as an evocation of life in the late 1980s , although  The Observer  noted that it took the  New York Times  10 years to mention the novel. By 2007 it had sold more than 6.5  million copies worldwide.     The novel has had significant linguistic influence, popularizing such terms as ": null
    },
    {
        "cyberspace": "Cyberspace"
    },
    {
        " and ICE . Gibson himself ": null
    },
    {
        "coined": "Cyberspacemetaphorical"
    },
    {
        " the term cyberspace in his novelette ": null
    },
    {
        "Burning Chrome": "Burning Chrome"
    },
    {
        " , published in 1982 by  Omni  magazine, but it was through its use in Neuromancer that it gained recognition to become the de facto term for the  World Wide Web  during the 1990s. The portion of Neuromancer usually cited in this respect is:          The 1999 cyberpunk science fiction film  The Matrix  particularly draws from Neuromancer both eponym and usage of the term matrix . Leiren-Young, Mark . Is William Gibsons Neuromancer the Future of Movies? . The Tyee. Retrieved January 16, 2012. One of the obstacles in the selling of this movie to the industry at large is that everyone says, Oh, well, The Matrix did it already. Because The Matrix—the very word matrix—is taken from Neuromancer, they stole that word, I cant use it in our movie. After watching The Matrix, Gibson commented that the way that the films creators had drawn from existing cyberpunk works was exactly the kind of creative cultural osmosis he had relied upon in his own writing.      In his afterword to the 2000 re-issue of Neuromancer, fellow author ": null
    },
    {
        "Jack Womack": "Jack Womack"
    },
    {
        " goes as far as to suggest that Gibsons vision of cyberspace may have inspired the way in which the Internet developed , after the publication of Neuromancer in 1984. He asks at if the act of writing it down, in fact, brought it about? .     ": null
    },
    {
        "Norman Spinrad": "Norman Spinrad"
    },
    {
        ", in his 1986 essay The Neuromantics which appears in his non-fiction collection Science Fiction in the Real World, saw the books title as a triple pun: neuro referring to the nervous system; ": null
    },
    {
        "necromancer": "Necromancy"
    },
    {
        " ; and new romancer . The cyberpunk genre, the authors of which he suggested be called neuromantics , was a fusion of the romantic impulse with science and technology , according to Spinrad.     Writing in  F & SF  in 2005, ": null
    },
    {
        "Charles de Lint": "Charles De Lint"
    },
    {
        " noted that while Gibsons technological extrapolations had proved imperfect , Imagining story, the inner workings of his characters minds, and the world in which it all takes place are all more important. ,  F & SF , April 2005, p.28     ": null
    },
    {
        "Lawrence Person": "Lawrence Person"
    },
    {
        " in his Notes Toward a Postcyberpunk Manifesto identified Neuromancer as the archetypal cyberpunk work , and in 2005,  Time  included it in their list of the 100 best English-language novels written since 1923, opining that ere is no way to overstate how radical Neuromancer was when it first appeared. Literary critic ": null
    },
    {
        "Larry McCaffery": "Larry Mccaffery"
    },
    {
        " described the concept of the matrix in Neuromancer as a place where data dance with human consciousness... human memory is literalized and mechanized... multi-national information systems mutate and breed into startling new structures whose beauty and complexity are unimaginable, mystical, and above all nonhuman. Gibson later commented on himself as an author circa Neuromancer that Id buy him a drink, but I dont know if Id loan him any money, and referred to the novel as an adolescents book . The success of Neuromancer was to effect the 35-year-old Gibsons emergence from obscurity.              In 1989, ": null
    },
    {
        "Epic Comics": "Epic Comics"
    },
    {
        " published a 48-page ": null
    },
    {
        "graphic novel": "Graphic Novel"
    },
    {
        " version by ": null
    },
    {
        "Tom de Haven": "Tom De Haven"
    },
    {
        " and ": null
    },
    {
        "Bruce Jensen": "Bruce Jensen"
    },
    {
        ". It only covers the first two chapters, Chiba City Blues and The Shopping Expedition , and was never continued.       In the 1990s a version of Neuromancer was published as one of the ": null
    },
    {
        "Voyager Companys": "Voyager Company"
    },
    {
        "  Expanded Books  series of hypertext-annotated ": null
    },
    {
        "HyperCard": "Hypercard"
    },
    {
        " stacks for the Apple Macintosh .       A video game adaptation of the novel—also titled  Neuromancer —was published in 1988 by ": null
    },
    {
        "Interplay": "Interplay Entertainment"
    },
    {
        ". Designed by Bruce J. Balfour, ": null
    },
    {
        "Brian Fargo": "Brian Fargo"
    },
    {
        ", Troy A. Miles, and ": null
    },
    {
        "Michael A. Stackpole": "Michael A. Stackpole"
    },
    {
        ", the game had many of the same locations and themes as the novel, but a different protagonist and plot. It was available for a variety of platforms, including the ": null
    },
    {
        "Amiga": "Amiga"
    },
    {
        ", the ": null
    },
    {
        "Apple II": "Apple Ii Family"
    },
    {
        ", the ": null
    },
    {
        "Commodore 64": "Commodore 64"
    },
    {
        ", and for ": null
    },
    {
        "DOS": "Dos"
    },
    {
        "-based computers. It featured, as a soundtrack, a computer adaptation of the ": null
    },
    {
        "Devo": "Devo"
    },
    {
        " song Some Things Never Change.     According to an episode of the American version of  Beyond 2000 , the original plans for the game included a dynamic soundtrack composed by Devo and a real-time 3D-rendered movie of the events the player went through. Psychologist and futurist Dr. ": null
    },
    {
        "Timothy Leary": "Timothy Leary"
    },
    {
        " was involved, but very little documentation seems to exist about this proposed second game, which was perhaps too grand a vision for 1988 home computing.       The ": null
    },
    {
        "BBC World Service": "Bbc World Service"
    },
    {
        " Drama production of Neuromancer aired in two one-hour parts, on 8 and 15 September 2002. Dramatised by ": null
    },
    {
        "Mike Walker": "Mike Walker"
    },
    {
        ", and directed by Andy Jordan, it starred Owen McCarthy as Case, ": null
    },
    {
        "Nicola Walker": "Nicola Walker"
    },
    {
        " as Molly, ": null
    },
    {
        "James Laurenson": "James Laurenson"
    },
    {
        " as Armitage, ": null
    },
    {
        "John Shrapnel": "John Shrapnel"
    },
    {
        " as Wintermute, ": null
    },
    {
        "Colin Stinton": "Colin Stinton"
    },
    {
        " as Dixie, David Webber as Maelcum, ": null
    },
    {
        "David Holt": "David Holt"
    },
    {
        " as Riviera, ": null
    },
    {
        "Peter Marinker": "Peter Marinker"
    },
    {
        " as Ashpool, and ": null
    },
    {
        "Andrew Scott": "Andrew Scott"
    },
    {
        " as The Finn. It can no longer be heard on The BBC World Service Archive.      In ": null
    },
    {
        "Finland": "Finland"
    },
    {
        ", ": null
    },
    {
        "Yle": "Yle"
    },
    {
        " Radioteatteri produced a 4-part radio play of Neuromancer.       Gibson read an abridged version of his novel Neuromancer on four audio cassettes for Time Warner Audio Books . An unabridged version of this book was read by Arthur Addison and made available from Books on Tape . In 2011, Penguin Audiobooks produced a new unabridged recording of the book, read by Robertson Dean.       Neuromancer the Opera is an adaptation written by Jayne Wenger and Marc Lowenstein and ": null
    },
    {
        "Richard Marriott": "Richard Marriott"
    },
    {
        " of the ": null
    },
    {
        "Club Foot Orchestra": "Club Foot Orchestra"
    },
    {
        " . A production was scheduled to open on March 3, 1995 at the Julia Morgan Theater in ": null
    },
    {
        "Berkeley, California": "Berkeley, California"
    },
    {
        ", featuring Club Foot Orchestra in the pit and extensive computer graphics imagery created by a world-wide network of volunteers. However, this premiere did not take place and the work has yet to be performed in full.        There have been several proposed film adaptations of Neuromancer, with drafts of scripts written by British director ": null
    },
    {
        "Chris Cunningham": "Chris Cunningham"
    },
    {
        " and ": null
    },
    {
        "Chuck Russell": "Chuck Russell"
    },
    {
        ", with ": null
    },
    {
        "Aphex Twin": "Aphex Twin"
    },
    {
        " providing the soundtrack.  The box packaging for the video game adaptation had even carried the promotional mention for a major motion picture to come from Cabana Boy Productions. None of these projects have come to fruition, though Gibson had stated his belief that Cunningham is the only director with a chance of doing the film correctly.     In May 2007, reports emerged that a film was in the works, with ": null
    },
    {
        "Joseph Kahn": "Joseph Kahn"
    },
    {
        "  in line to direct and ": null
    },
    {
        "Milla Jovovich": "Milla Jovovich"
    },
    {
        " in the lead role. In May 2010 this story was supplanted with news that ": null
    },
    {
        "Vincenzo Natali": "Vincenzo Natali"
    },
    {
        ", director of  Cube  and  Splice , had taken over directing duties and would rewrite the screenplay.  In March 2011, with the news that Seven Arts and GFM Films would be merging their distribution operations, it was announced that the joint venture would be purchasing the rights to Neuromancer under Vincenzo Natalis direction.  In August, 2012, GFM Films announced that it had begun casting for the film , but no cast members have been confirmed yet.  In November 2013, Natali shed some light on the production situation; announcing that the script had been completed for years , and had been written with assistance from Gibson himself.  In May 2015, it was reported that movie got new funding from Chinese company C2M, but Natali is no longer available for directing the movie.      In August 2017, it was announced that  Deadpool  director ": null
    },
    {
        "Tim Miller": "Tim Miller"
    },
    {
        " was signed on to direct a new film adaptation by Fox, with ": null
    },
    {
        "Simon Kinberg": "Simon Kinberg"
    },
    {
        " producing.      ": null
    }
]