[
    {
        "     Neutron activation analysis  is the ": null
    },
    {
        "nuclear": "Nuclear Reaction"
    },
    {
        " process used for determining the concentrations of ": null
    },
    {
        "elements": "Chemical Element"
    },
    {
        " in a vast amount of materials. NAA allows discrete ": null
    },
    {
        "sampling": "Sampling"
    },
    {
        " of elements as it disregards the chemical form of a sample, and focuses solely on its nucleus. The method is based on ": null
    },
    {
        "neutron activation": "Neutron Activation"
    },
    {
        " and therefore requires a source of ": null
    },
    {
        "neutrons": "Neutron"
    },
    {
        ". The sample is bombarded with neutrons, causing the elements to form radioactive isotopes. The ": null
    },
    {
        "radioactive emissions": "Radiation"
    },
    {
        " and radioactive decay paths for each element are well known. Using this information, it is possible to study spectra of the emissions of the radioactive sample, and determine the concentrations of the elements within it. A particular advantage of this technique is that it does not destroy the sample, and thus has been used for analysis of works of art and historical artifacts. NAA can also be used to determine the ": null
    },
    {
        "activity": "Radioactive Decayradioactive Decay Rates"
    },
    {
        " of a radioactive sample.     If NAA is conducted directly on irradiated samples it is termed Instrumental Neutron Activation Analysis . In some cases irradiated samples are subjected to chemical separation to remove interfering species or to concentrate the radioisotope of interest, this technique is known as Radiochemical Neutron Activation Analysis .     NAA can perform non-destructive analyses on solids, liquids, suspensions, slurries, and gases with no or minimal preparation. Due to the penetrating nature of incident neutrons and resultant gamma rays, the technique provides a true bulk analysis. As different radioisotopes have different half-lives, counting can be delayed to allow interfering species to decay eliminating interference. Until the introduction of ": null
    },
    {
        "ICP-AES": "Icp-Aes"
    },
    {
        " and ": null
    },
    {
        "PIXE": "Pixe"
    },
    {
        ", NAA was the standard analytical method for performing multi-element analyses with minimum detection limits in the sub-": null
    },
    {
        "ppm": "Parts Per Notation"
    },
    {
        " range. ": null
    },
    {
        "Accuracy": "Accuracy"
    },
    {
        " of NAA is in the region of 5%, and relative ": null
    },
    {
        "precision": "Accuracy And Precision"
    },
    {
        " is often better than 0.1%. There are two noteworthy drawbacks to the use of NAA; even though the technique is essentially non-destructive, the irradiated sample will remain radioactive for many years after the initial analysis, requiring handling and disposal protocols for low-level to medium-level radioactive material; also, the number of suitable activation nuclear reactors is declining; with a lack of irradiation facilities, the technique has declined in popularity and become more expensive.       Neutron activation analysis is a sensitive multi-": null
    },
    {
        "element": "Chemical Element"
    },
    {
        " analytical technique used for both ": null
    },
    {
        "qualitative": "Qualitative Data"
    },
    {
        " and ": null
    },
    {
        "quantitative": "Numerical Data"
    },
    {
        " analysis of major, minor, trace and rare elements. NAA was discovered in 1936 by ": null
    },
    {
        "Hevesy": "George De Hevesy"
    },
    {
        " and Levi, who found that samples containing certain ": null
    },
    {
        "rare earth elements": "Rare Earth Elements"
    },
    {
        " became highly ": null
    },
    {
        "radioactive": "Radioactive"
    },
    {
        " after exposure to a source of ": null
    },
    {
        "neutrons": "Neutrons"
    },
    {
        ".  This observation led to the use of induced radioactivity for the identification of elements. NAA is significantly different from other spectroscopic analytical techniques in that it is based not on electronic transitions but on nuclear transitions. To carry out an NAA analysis, the specimen is placed into a suitable irradiation facility and bombarded with neutrons. This creates artificial radioisotopes of the elements present. Following irradiation, the artificial ": null
    },
    {
        "radioisotopes": "Radionuclide"
    },
    {
        " decay with emission of particles or, more importantly ": null
    },
    {
        "gamma rays": "Gamma Ray"
    },
    {
        ", which are characteristic of the element from which they were emitted.     For the NAA procedure to be successful, the specimen or sample must be selected carefully. In many cases small objects can be irradiated and analysed intact without the need of sampling. But, more commonly, a small sample is taken, usually by drilling in an inconspicuous place. About 50  mg  is a sufficient sample, so damage to the object is minimised.   It is often good practice to remove two samples using two different drill bits made of different materials. This will reveal any contamination of the sample from the drill bit material itself. The sample is then encapsulated in a vial made of either high purity linear ": null
    },
    {
        "polyethylene": "Polyethylene"
    },
    {
        " or ": null
    },
    {
        "quartz": "Quartz"
    },
    {
        ".  These sample vials come in many shapes and sizes to accommodate many specimen types. The sample and a standard are then packaged and irradiated in a suitable reactor at a constant, known neutron ": null
    },
    {
        "flux": "Flux"
    },
    {
        ". A typical reactor used for activation uses ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        " fission": "Nuclear Fission"
    },
    {
        ", providing a high neutron flux and the highest available sensitivities for most elements. The neutron flux from such a reactor is in the order of 10 12 neutrons cm −2 s −1 . Pollard, A. M., Heron, C., 1996, Archaeological Chemistry. Cambridge, Royal Society of Chemistry. The type of neutrons generated are of relatively low ": null
    },
    {
        "kinetic energy": "Kinetic Energy"
    },
    {
        " , typically less than 0.5 ": null
    },
    {
        "eV": "Electronvolt"
    },
    {
        ". These neutrons are termed thermal neutrons. Upon irradiation, a thermal neutron interacts with the target nucleus via a non-elastic collision, causing neutron capture. This collision forms a compound nucleus which is in an excited state. The excitation energy within the compound nucleus is formed from the ": null
    },
    {
        "binding energy": "Binding Energy"
    },
    {
        " of the thermal neutron with the target nucleus. This excited state is unfavourable and the compound nucleus will almost instantaneously de-excite into a more stable configuration through the emission of a prompt particle and one or more characteristic prompt gamma photons. In most cases, this more stable configuration yields a radioactive nucleus. The newly formed radioactive nucleus now decays by the emission of both particles and one or more characteristic delayed gamma photons. This decay process is at a much slower rate than the initial de-excitation and is dependent on the unique half-life of the radioactive nucleus. These unique half-lives are dependent upon the particular radioactive species and can range from fractions of a second to several years. Once irradiated, the sample is left for a specific decay period, then placed into a detector, which will measure the nuclear decay according to either the emitted particles, or more commonly, the emitted gamma rays.       NAA can vary according to a number of experimental parameters. The kinetic energy of the neutrons used for irradiation will be a major experimental parameter. The above description is of activation by slow neutrons, slow neutrons are fully moderated within the reactor and have KE 0.5 MeV. Activation with fast neutrons is termed Fast NAA .   Another major experimental parameter is whether nuclear decay products are measured during neutron irradiation , or at some time after irradiation . PGNAA is generally performed by using a neutron stream tapped off the nuclear reactor via a beam port. Neutron fluxes from beam ports are the order of 10 6 times weaker than inside a reactor. This is somewhat compensated for by placing the detector very close to the sample reducing the loss in sensitivity due to low flux. PGNAA is generally applied to elements with extremely high neutron capture ": null
    },
    {
        "cross-sections": "Neutron Cross-Section"
    },
    {
        "; elements which decay too rapidly to be measured by DGNAA; elements that produce only stable ": null
    },
    {
        "isotopes": "Isotope"
    },
    {
        "; or elements with weak decay gamma ray intensities. PGNAA is characterised by short irradiation times and short decay times, often in the order of seconds and minutes.   DGNAA is applicable to the vast majority of elements that form artificial radioisotopes. DG analyses are often performed over days, weeks or even months. This improves sensitivity for long-lived radionuclides as it allows short-lived radionuclide to decay, effectively eliminating interference. DGNAA is characterised by long irradiation times and long decay times, often in the order of hours, weeks or longer.            a range of different sources can be used:   A nuclear reactor   An ": null
    },
    {
        "actinoid": "Actinoid"
    },
    {
        " such as ": null
    },
    {
        "californium": "Californium"
    },
    {
        " which emits neutrons through spontaneous fission   An alpha source such as ": null
    },
    {
        "radium": "Radium"
    },
    {
        " or ": null
    },
    {
        "americium": "Americium"
    },
    {
        ", mixed with ": null
    },
    {
        "beryllium": "Beryllium"
    },
    {
        "; this generates neutrons by a reaction   A D-T fusion reaction in a ": null
    },
    {
        "gas discharge tube": "Neutron Generator"
    },
    {
        "       Some reactors are used for the neutron irradiation of samples for ": null
    },
    {
        "radioisotope": "Radioisotope"
    },
    {
        " production for a range of purposes. The sample can be placed in an irradiation container which is then placed in the reactor; if epithermal neutrons are required for the irradiation then ": null
    },
    {
        "cadmium": "Cadmium"
    },
    {
        " can be used to filter out the thermal neutrons.       A relatively simple ": null
    },
    {
        "Farnsworth–Hirsch fusor": "Farnsworth–Hirsch Fusor"
    },
    {
        " can be used to generate neutrons for NAA experiments. The advantages of this kind of apparatus is that it is compact, often benchtop-sized, and that it can simply be turned off and on. A disadvantage is that this type of source will not produce the neutron flux that can be obtained using a reactor.       For many workers in the field a reactor is an item which is too expensive, instead it is common to use a neutron source which uses a combination of an alpha emitter and beryllium. These sources tend to be much weaker than reactors.       These can be used to create pulses of neutrons, they have been used for some activation work where the decay of the target isotope is very rapid. For instance in oil wells.        There are a number of detector types and configurations used in NAA. Most are designed to detect the emitted ": null
    },
    {
        "gamma radiation": "Gamma Ray"
    },
    {
        ". The most common types of gamma detectors encountered in NAA are the ": null
    },
    {
        "gas ionisation": "Proportional Counter"
    },
    {
        " type, ": null
    },
    {
        "scintillation": "Scintillation Counter"
    },
    {
        " type and the ": null
    },
    {
        "semiconductor": "Semiconductor"
    },
    {
        " type. Of these the scintillation and semiconductor type are the most widely employed. There are two detector configurations utilised, they are the planar detector, used for PGNAA and the well detector, used for DGNAA. The planar detector has a flat, large collection surface area and can be placed close to the sample. The well detector ‘surrounds’ the sample with a large collection surface area.     Scintillation-type detectors use a radiation-sensitive crystal, most commonly thallium-doped sodium iodide , which emits light when struck by gamma photons. These detectors have excellent sensitivity and stability, and a reasonable resolution.     Semiconductor detectors utilise the semiconducting element ": null
    },
    {
        "germanium": "Germanium"
    },
    {
        ". The germanium is processed to form a p-i-n ": null
    },
    {
        "diode": "Diode"
    },
    {
        ", and when cooled to ~77 ": null
    },
    {
        "K": "Kelvin"
    },
    {
        " by ": null
    },
    {
        "liquid nitrogen": "Liquid Nitrogen"
    },
    {
        " to reduce ": null
    },
    {
        "dark current": "Dark Current"
    },
    {
        " and detector noise, produces a signal which is proportional to the photon energy of the incoming radiation. There are two types of germanium detector, the lithium-drifted germanium or Ge , and the high-purity germanium or HPGe.   The semiconducting element ": null
    },
    {
        "silicon": "Silicon"
    },
    {
        " may also be used but germanium is preferred, as its higher atomic number makes it more efficient at stopping and detecting high energy gamma rays. Both Ge and HPGe detectors have excellent sensitivity and resolution, but Ge detectors are unstable at room temperature, with the lithium drifting into the ": null
    },
    {
        "intrinsic": "Intrinsic Semiconductor"
    },
    {
        " region ruining the detector. The development of undrifted high purity germanium has overcome this problem.     Particle detectors can also be used to detect the emission of ": null
    },
    {
        "alpha": "Alpha Particle"
    },
    {
        " and ": null
    },
    {
        "beta": "Beta Particle"
    },
    {
        " particles which often accompany the emission of a gamma photon but are less favourable, as these particles are only emitted from the surface of the sample and are often absorbed or attenuated by atmospheric gases requiring expensive ": null
    },
    {
        "vacuum": "Vacuum"
    },
    {
        " conditions to be effectively detected. Gamma rays, however, are not absorbed or attenuated by atmospheric gases, and can also escape from deep within the sample with minimal absorption.       NAA can detect up to 74 elements depending upon the experimental procedure, with minimum detection limits ranging from 0.1 to 1x10 6 ng g −1 depending on element under investigation. Heavier elements have larger nuclei, therefore they have a larger neutron capture cross-section and are more likely to be activated. Some nuclei can capture a number of neutrons and remain relatively stable, not undergoing transmutation or decay for many months or even years. Other nuclei decay instantaneously or form only stable isotopes and can only be identified by PGNAA.              Neutron Activation Analysis has a wide variety of applications including within the fields of ": null
    },
    {
        "archaeology": "Archaeology"
    },
    {
        ", ": null
    },
    {
        "soil science": "Soil Science"
    },
    {
        ", ": null
    },
    {
        "geology": "Geology"
    },
    {
        ", ": null
    },
    {
        "forensics": "Forensics"
    },
    {
        ", and the ": null
    },
    {
        "semiconductor industry": "Semiconductor Industry"
    },
    {
        ". Forensically, hairs subjected to a detailed forensic neutron analysis to determine whether they had sourced from the same individuals was first used in the trial of ": null
    },
    {
        "John Norman Collins": "Michigan Murders"
    },
    {
        ".      Archaeologists use NAA in order to determine the elements that comprise certain artifacts. This technique is used because it is nondestructive and it can relate an artifact to its source by its chemical signature. This method has proven to be very successful at determining trade routes, particularly for obsidian, with the ability of NAA to distinguish between chemical compositions. In agricultural processes, the movement of fertilizers and pesticides is influenced by surface and subsurface movement as it infiltrates the water supplies. In order to track the distribution of the fertilizers and pesticides, bromide ions in various forms are used as tracers that move freely with the flow of water while having minimal interaction with the soil. Neutron activation analysis is used to measure bromide so that extraction is not necessary for analysis. NAA is used in geology to aid in researching the processes that formed the rocks through the analysis of the rare earth elements and trace elements. It also assists in locating ore deposits and tracking certain elements. Neutron activation analysis is also used to create standards in the semiconductor industry. Semiconductors require a high level of purity, with contamination significantly reducing the quality of the semiconductor. NAA is used to detect trace impurities and establish contamination standards, because it involves limited sample handling and high sensitivity.   ": null
    }
]