[
    {
        "                     The New Testament  is the second part of the ": null
    },
    {
        "Christian biblical canon": "Christian Biblical Canons"
    },
    {
        ", the first being the ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        ". The New Testament discusses the teachings and person of ": null
    },
    {
        "Jesus": "Jesus In Christianity"
    },
    {
        ", as well as events in ": null
    },
    {
        "first-century Christianity": "Christianity In The 1St Century"
    },
    {
        ". Christians regard both the Old and New Testaments together as ": null
    },
    {
        "sacred scripture": "Religious Text"
    },
    {
        ".     The New Testament is a collection of Christian texts originally written in the ": null
    },
    {
        "Koine Greek": "Koine Greek"
    },
    {
        " language, at different times by various different authors. While the Old Testament canon varies somewhat between different ": null
    },
    {
        "Christian denominations": "Christian Denomination"
    },
    {
        ", the ": null
    },
    {
        "27-book canon": "Development Of The New Testament Canon"
    },
    {
        " of the New Testament has been almost universally recognized within ": null
    },
    {
        "Christianity": "Christianity"
    },
    {
        " since at least ": null
    },
    {
        "Late Antiquity": "Late Antiquity"
    },
    {
        ". Thus, in almost all Christian traditions today, the New Testament consists of 27 books: the four ": null
    },
    {
        "canonical gospels": "Canonical Gospels"
    },
    {
        " , the ": null
    },
    {
        "Acts of the Apostles": "Acts Of The Apostles"
    },
    {
        ", the fourteen ": null
    },
    {
        "epistles of Paul": "Pauline Epistles"
    },
    {
        ", the seven ": null
    },
    {
        "catholic epistles": "Catholic Epistles"
    },
    {
        ", and the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ".     The earliest known complete list of the 27 books of the New Testament is found in a letter written by ": null
    },
    {
        "Athanasius": "Athanasius"
    },
    {
        ", a 4th-century ": null
    },
    {
        "bishop": "Bishop"
    },
    {
        " of ": null
    },
    {
        "Alexandria": "Alexandria"
    },
    {
        ", dated to 367 AD.  The 27-book New Testament was first formally canonized during the councils of ": null
    },
    {
        "Hippo": "Council Of Hippo"
    },
    {
        " and ": null
    },
    {
        "Carthage": "Council Of Carthage"
    },
    {
        " in North Africa. ": null
    },
    {
        "Pope": "Pope"
    },
    {
        " Innocent I": "Innocent I"
    },
    {
        " ratified the same canon in 405, but it is probable that a Council in Rome in 382 under ": null
    },
    {
        "Pope Damasus I": "Pope Damasus I"
    },
    {
        " gave the same list first. These councils also provided the canon of the Old Testament, which included the ": null
    },
    {
        "apocryphal": "Biblical Apocrypha"
    },
    {
        " books. Introduction to the New Testament. Werner Georg Kummel. Abingdon Press. Nashville. 1993.     There is no ": null
    },
    {
        "scholarly consensus": "Scholarly Consensus"
    },
    {
        " on the date of composition of the latest New Testament texts. Conservative scholars ": null
    },
    {
        "John A. T. Robinson": "John Robinson Redating The New Testament"
    },
    {
        ", ": null
    },
    {
        "Dan Wallace": "Daniel B. Wallace"
    },
    {
        ", and ": null
    },
    {
        "William F. Albright": "William F. Albright"
    },
    {
        " dated all the books of the New Testament before 70 AD.  But most scholars date some New Testament texts much later than this. For example, ": null
    },
    {
        "Richard Pervo": "Richard Pervo"
    },
    {
        " dates ": null
    },
    {
        "Luke-Acts": "Luke-Acts"
    },
    {
        " to c. AD 115,  and ": null
    },
    {
        "David Trobisch": "David Trobisch"
    },
    {
        " places ": null
    },
    {
        "Acts": "Acts Of The Apostles"
    },
    {
        " in the mid- to late second century, contemporaneous with the publication of the first New Testament canon.  ...Acts provides information that makes it possible to identify Luke, the author of the Gospel, as the doctor who travels with Paul and to identify Mark as someone close to Peter and Paul. This canon consciousness suggests that the book of Acts was composed at a later date than is typically thought; this theory is supported by the first attestation of the book around 180 CE. - Trobisch 2007       The use of the phrase New Testament  to describe a collection of first and second-century Christian Greek scriptures can be traced back to ": null
    },
    {
        "Tertullian": "Tertullian"
    },
    {
        " in his work Against Praxeas .   If I fail in resolving this article by passages which may admit of dispute out of the Old Testament, I will take out of the New Testament a confirmation of our view, that you may not straightway attribute to the Father every possible which I ascribe to the Son. - ": null
    },
    {
        "Tertullian": "Tertullian"
    },
    {
        ", http://www.newadvent.org/fathers/0317.htm Against Praxeas 15 Irenaeus uses the phrase New Testament several times, but does not use it in reference to any written text. In Against Marcion , written c.  208  AD, Tertullian writes of: Tertullian. Chapter XIV . .        And Tertullian continues later in the book, writing: Tertullian. Chapter VI . . See also Tertullian, , chapters I, II, XIV. However, his meaning in chapter XX is less clear, and in chapters IX and XL he uses the term to mean new covenant.        By the ": null
    },
    {
        "4th century": "Christianity In The 4Th Century"
    },
    {
        ", the existence—even if not the exact contents—of both an Old and New Testament had been established. ": null
    },
    {
        "Lactantius": "Lactantius"
    },
    {
        ", a 3rd–4th century Christian author wrote in his early-4th-century Latin Institutiones Divinae .                    Each of the four ": null
    },
    {
        "gospels": "Gospels"
    },
    {
        " in the New Testament narrates the life, death, and resurrection of ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        " of ": null
    },
    {
        "Nazareth": "Nazareth"
    },
    {
        ". The word gospel derives from the ": null
    },
    {
        "Old English": "Old English Language"
    },
    {
        " gōd-spell  , meaning good news or glad tidings . The gospel was considered the good news of the coming ": null
    },
    {
        "Kingdom of Messiah": "Messiahchristianity"
    },
    {
        ", and the redemption through the life and death of Jesus, the central Christian message. Cross, F. L., ed . Gospel . The Oxford Dictionary of the Christian Church. New York: Oxford University Press. Gospel is a ": null
    },
    {
        "calque": "Calque"
    },
    {
        " of the ": null
    },
    {
        "Greek": "Koine Greek"
    },
    {
        " word , euangelion .     Starting in the late second century, the four narrative accounts of the life and work of Jesus Christ have been referred to as The Gospel of ... or The Gospel according to ... followed by the name of the supposed author. The first author to explicitly name the canonical gospels is ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        " of Lyon, ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        ", http://www.newadvent.org/fathers/0103311.htm Against Heresies III.11 who promoted the four canonical gospels in his book ": null
    },
    {
        "Against Heresies": "Against Heresies"
    },
    {
        ", written around 180. Due to its reference to ": null
    },
    {
        "Eleutherus": "Eleutherus"
    },
    {
        " as the current ": null
    },
    {
        "bishop of Rome": "Bishop Of Rome"
    },
    {
        ", the work is usually dated . ": null
    },
    {
        "Schaff, Philip": "Philip Schaff"
    },
    {
        "   ,  Ante-Nicene Fathers , Volume I, Against Heresies, ": null
    },
    {
        "William B. Eerdmans Publishing Company": "William B. Eerdmans Publishing Company"
    },
    {
        ". Whatever these admittedly early ascriptions may imply about the sources behind or the perception of these gospels, they are anonymous compositions.   The ": null
    },
    {
        "Gospel of Matthew": "Gospel Of Matthew"
    },
    {
        ", ascribed to the ": null
    },
    {
        "Apostle Matthew": "Matthew The Evangelist"
    },
    {
        ". This gospel begins with a ": null
    },
    {
        "genealogy of Jesus": "Genealogy Of Jesus"
    },
    {
        " and a story of his birth that includes a visit from ": null
    },
    {
        "magi": "Biblical Magi"
    },
    {
        " and a ": null
    },
    {
        "flight into Egypt": "Flight Into Egypt"
    },
    {
        ", and it ends with the ": null
    },
    {
        "commissioning of the disciples": "Great Commission"
    },
    {
        " by the resurrected Jesus.   The ": null
    },
    {
        "Gospel of Mark": "Gospel Of Mark"
    },
    {
        ", ascribed to ": null
    },
    {
        "Mark the Evangelist": "Mark The Evangelist"
    },
    {
        ". This gospel begins with the preaching of ": null
    },
    {
        "John the Baptist": "John The Baptist"
    },
    {
        " and the ": null
    },
    {
        "baptism of Jesus": "Baptism Of Jesus"
    },
    {
        ". Two different secondary endings were affixed to this gospel in the 2nd century.   The ": null
    },
    {
        "Gospel of Luke": "Gospel Of Luke"
    },
    {
        ", ascribed to ": null
    },
    {
        "Luke the Evangelist": "Luke The Evangelist"
    },
    {
        ", who was not one of ": null
    },
    {
        "the Twelve Apostles": "Twelve Disciplesthe Twelve Apostles"
    },
    {
        ", but was mentioned as a companion of the ": null
    },
    {
        "Apostle Paul": "Paul Of Tarsus"
    },
    {
        " and as a physician. Fitzmyer, Joseph A. . The Gospel according to Luke, Vol. 1. Anchor Bible Commentary series. New York: Doubleday. pp. 35–53. This gospel begins with parallel stories of the birth and childhood of ": null
    },
    {
        "John the Baptist": "John The Baptist"
    },
    {
        " and ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        " and ends with appearances of the resurrected Jesus and his ascension into heaven.   The ": null
    },
    {
        "Gospel of John": "Gospel Of John"
    },
    {
        ", ascribed to ": null
    },
    {
        "John the Evangelist": "John The Evangelist"
    },
    {
        ". This gospel begins with a philosophical prologue and ends with appearances of the resurrected Jesus. It is about Jesuss miracles.     The first three gospels listed above are classified as the ": null
    },
    {
        "Synoptic Gospels": "Synoptic Gospels"
    },
    {
        ". They contain similar accounts of the events in Jesuss life and his teaching, due to their literary interdependence. The Gospel of John is structured differently and includes stories of several miracles of Jesus and sayings not found in the other three.     These four gospels that were eventually included in the New Testament were only a few among many other early Christian gospels. The existence of such texts is even mentioned at the beginning of the Gospel of Luke. Other early Christian gospels such as the so-called ": null
    },
    {
        "Jewish-Christian Gospels": "Jewish-Christian Gospels"
    },
    {
        " or the ": null
    },
    {
        "Gospel of Thomas": "Gospel Of Thomas"
    },
    {
        ", also offer both a window into the context of ": null
    },
    {
        "early Christianity": "Early Christianity"
    },
    {
        " and may provide some assistance in the reconstruction of the ": null
    },
    {
        "historical Jesus": "Historical Jesus"
    },
    {
        ".       The ": null
    },
    {
        "Acts of the Apostles": "Acts Of The Apostles"
    },
    {
        " is a narrative of the apostles ministry and activity after ": null
    },
    {
        "Christs death": "Christs Death"
    },
    {
        " and resurrection, from which point it resumes and functions as a sequel to the ": null
    },
    {
        "Gospel of Luke": "Gospel Of Luke"
    },
    {
        ". Examining style, phraseology, and other evidence, modern scholarship generally concludes that Acts and the Gospel of Luke share the same author, referred to as ": null
    },
    {
        "Luke–Acts": "Luke–Acts"
    },
    {
        ". Luke-Acts does not name its author. Church tradition identified him as ": null
    },
    {
        "Luke the Evangelist": "Luke The Evangelist"
    },
    {
        ", the companion of Paul, but the majority of scholars reject this due to the many differences between Acts and the authentic Pauline letters. The most probable date of composition is around 80–100 AD, although some scholars date it significantly later, and there is evidence that it was still being substantially revised well into the 2nd century.       The epistles of the New Testament are considered by Christians to be divinely inspired and holy letters, written by the apostles and disciples of Christ, to either local congregations with specific needs, or to ": null
    },
    {
        "New Covenant": "New Covenant"
    },
    {
        " Christians in general, scattered about; or catholic epistles.          The Pauline letters to churches are the thirteen New Testament books that present ": null
    },
    {
        "Paul the Apostle": "Paul The Apostle"
    },
    {
        " as their author. Six of the letters are disputed. Four are thought by most modern scholars to be ": null
    },
    {
        "pseudepigraphic": "Pseudepigraphy"
    },
    {
        ", i.e., not actually written by Paul even if attributed to him within the letters themselves. Opinion is more divided on the other two disputed letters . ": null
    },
    {
        "Bassler, Jouette M.": "Jouette Bassler"
    },
    {
        " . Paul and his Letters . In Aune, David E. The Blackwell Companion to the New Testament. Wiley-Blackwell. p. 388. . These letters were written to Christian communities in specific cities or geographical regions, often to address issues faced by that particular community. Prominent themes include the relationship both to broader ": null
    },
    {
        "pagan": "Gentile"
    },
    {
        " society, to Judaism, and to other Christians. Roetzel, Calvin J. . The Letters of Paul: Conversations in Context . Louisville, Kentucky: Westminster John Knox. .   ": null
    },
    {
        "Epistle to the Romans": "Epistle To The Romans"
    },
    {
        " First Epistle to the Corinthians": "First Epistle To The Corinthians"
    },
    {
        " Second Epistle to the Corinthians": "Second Epistle To The Corinthians"
    },
    {
        " Epistle to the Galatians": "Epistle To The Galatians"
    },
    {
        " Epistle to the Ephesians": "Epistle To The Ephesians"
    },
    {
        "   Epistle to the Philippians": "Epistle To The Philippians"
    },
    {
        " Epistle to the Colossians": "Epistle To The Colossians"
    },
    {
        "   First Epistle to the Thessalonians": "First Epistle To The Thessalonians"
    },
    {
        " Second Epistle to the Thessalonians": "Second Epistle To The Thessalonians"
    },
    {
        "         The last four Pauline letters in the New Testament are addressed to individual persons. They include the following:   ": null
    },
    {
        "First Epistle to Timothy": "First Epistle To Timothy"
    },
    {
        "   Second Epistle to Timothy": "Second Epistle To Timothy"
    },
    {
        "   Epistle to Titus": "Epistle To Titus"
    },
    {
        "   Epistle to Philemon": "Epistle To Philemon"
    },
    {
        "       All of the above except for Philemon are known as the ": null
    },
    {
        "Pastoral epistles": "Pastoral Epistles"
    },
    {
        ". They are addressed to individuals charged with pastoral oversight of churches and discuss issues of Christian living, doctrine and leadership. They often address different concerns to those of the preceding epistles. These letters are believed by many to be pseudepigraphic. Some scholars will argue that the letters are genuinely Pauline, or at least written under Pauls supervision.       The ": null
    },
    {
        "Epistle to the Hebrews": "Epistle To The Hebrews"
    },
    {
        " addresses a Jewish audience who had come to believe that Jesus was the ": null
    },
    {
        "anointed one": "Messiahjudaism"
    },
    {
        "  who was predicted in the writings of the Hebrew Scriptures. The author discusses the superiority of the new covenant and the ministry of Jesus, to the ": null
    },
    {
        "Mosaic covenant": "Mosaic Covenant"
    },
    {
        "  and urges the readers in the practical implications of this conviction through the end of the epistle.     The book has been widely accepted by the Christian church as inspired by God and thus authoritative, despite the acknowledgment of uncertainties about who its human author was. Regarding authorship, although the Epistle to the Hebrews does not internally claim to have been written by the ": null
    },
    {
        "Apostle Paul": "Paul Of Tarsus"
    },
    {
        ", some similarities in wordings to some of the Pauline Epistles have been noted and inferred. In antiquity, some began to ascribe it to Paul in an attempt to provide the anonymous work an explicit apostolic pedigree. ": null
    },
    {
        "Attridge, Harold W.": "Harold W. Attridge"
    },
    {
        " . Hebrews. Hermeneia. Philadelphia: Fortress. pp. 1–6.     In the 4th century, ": null
    },
    {
        "Jerome": "Jerome"
    },
    {
        " and ": null
    },
    {
        "Augustine of Hippo": "Augustine Of Hippo"
    },
    {
        " supported ": null
    },
    {
        "Pauls authorship": "Authorship Of The Pauline Epistles"
    },
    {
        ". The Church largely agreed to include Hebrews as the fourteenth letter of Paul, and affirmed this authorship until the ": null
    },
    {
        "Reformation": "Protestant Reformation"
    },
    {
        ". The letter to the Hebrews had difficulty in being accepted as part of the Christian canon because of its anonymity. ": null
    },
    {
        "Lane, William L.": "William L. Lane"
    },
    {
        " . Hebrews 1–8. Word Biblical Commentary series, Vol. 47A. Dallas, Texas: Word Books. p. cliv. As early as the 3rd century, ": null
    },
    {
        "Origen": "Origen"
    },
    {
        " wrote of the letter, Men of old have handed it down as Pauls, but who wrote the Epistle God only knows.      Contemporary scholars often reject Pauline authorship for the epistle to the Hebrews, Ehrman, Bart D. . The New Testament: A Historical Introduction to the Early Christian Writings. Oxford University Press. p. 323. Scholars in the ancient world went about detecting forgeries in much the same way that modern scholars do. They looked to see whether the ideas and writing style of a piece conformed with those used by the author in other writings, and they examined the text for any blatant anachronisms, that is, statements about things that could not have existed at the time the alleged author was writing - Arguments of this kind were used by some Christian scholars of the third century to show that Hebrews was not written by Paul or the Book of Revelation by John the son of Zebedee. Modern scholars, as we will see, concur with these judgments. To be sure, neither of these books can be considered a forgery. Hebrews does not claim to be written by Paul , and the John who wrote Revelation does not claim to be the son of Zebedee . Are there other books in the New Testament, though, that can be considered forgeries? based on its distinctive style and theology, which are considered to set it apart from Pauls writings.        The ": null
    },
    {
        "Catholic epistles": "Catholic Epistles"
    },
    {
        " consist of both letters and treatises in the form of letters written to the church at large. The term ": null
    },
    {
        "catholic": "Catholic"
    },
    {
        " , used to describe these letters in the oldest manuscripts containing them, here simply means general or universal . The authorship of a number of these is disputed.   ": null
    },
    {
        "Epistle of James": "Epistle Of James"
    },
    {
        ", written by an author named James , often identified with ": null
    },
    {
        "James, the brother of Jesus": "James The Just"
    },
    {
        ".   ": null
    },
    {
        "First Epistle of Peter": "First Epistle Of Peter"
    },
    {
        ", ascribed to the ": null
    },
    {
        "Apostle Peter": "Saint Peter"
    },
    {
        ".   ": null
    },
    {
        "Second Epistle of Peter": "Second Epistle Of Peter"
    },
    {
        ", ascribed to the Apostle Peter, though widely considered not to have been written by him. Fornberg, Tord . An Early Church in a Pluralistic Society: A Study of 2 Peter. Coniectanea Biblica, New Testament Series 9. Lund: Gleerup.   ": null
    },
    {
        "First Epistle of John": "First Epistle Of John"
    },
    {
        ", ascribed to ": null
    },
    {
        "John the Apostle": "John The Apostle"
    },
    {
        ".   ": null
    },
    {
        "Second Epistle of John": "Second Epistle Of John"
    },
    {
        ", ascribed to John the Apostle.   ": null
    },
    {
        "Third Epistle of John": "Third Epistle Of John"
    },
    {
        ", ascribed to John the Apostle.   ": null
    },
    {
        "Epistle of Jude": "Epistle Of Jude"
    },
    {
        ", written under the name of ": null
    },
    {
        "Jude, the brother of Jesus and James": "Jude, Brother Of Jesus"
    },
    {
        ".          The final book of the New Testament is the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ", also known as the Apocalypse of John. In the New Testament canon, it is considered ": null
    },
    {
        "prophetical": "Bible Prophecy"
    },
    {
        " or ": null
    },
    {
        "apocalyptic literature": "Apocalyptic Literature"
    },
    {
        ". Its authorship has been attributed either to John the Apostle  or to another John designated ": null
    },
    {
        "John of Patmos": "John Of Patmos"
    },
    {
        " after the island where the text says the revelation was received . Some ascribe the writership date as circa 81–96 AD, and others at around 68 AD. ": null
    },
    {
        "Mounce, Robert": "Robert Mounce"
    },
    {
        " .  . The New International Commentary on the New Testament Series. Cambridge, UK: Eerdmans. pp. 15–16. . The work opens with letters to ": null
    },
    {
        "seven local congregations of Asia Minor": "Seven Churches Of Asia"
    },
    {
        " and thereafter takes the form of an ": null
    },
    {
        "apocalypse": "Apocalypse"
    },
    {
        ", a revealing of divine prophecy and mysteries, a literary genre popular in ancient Judaism and Christianity. For a detailed study of the Apocalypse of John, see Aune, David E. . Revelation, 3 volumes. Word Biblical Commentary series. Nashville, Tennessee: Thomas Nelson.                  ;Table notes           The order in which the books of the New Testament appear differs between some collections and ecclesiastical traditions. In the Latin West, prior to the ": null
    },
    {
        "Vulgate": "Vulgate"
    },
    {
        " , the four Gospels were arranged in the following order: Matthew, John, Luke, and Mark. The Syriac ": null
    },
    {
        "Peshitta": "Peshitta"
    },
    {
        " places the major Catholic epistles immediately after Acts and before the Pauline epistles.     The order of an early edition of the letters of Paul is based on the size of the letters: longest to shortest, though keeping 1 and 2 Corinthians and 1 and 2 Thessalonians together. The Pastoral epistles were apparently not part of the Corpus Paulinum in which this order originated and were later inserted after 2 Thessalonians and before Philemon. Hebrews was variously incorporated into the Corpus Paulinum either after 2 Thessalonians, after Philemon , or after Romans.     The New Testament of the 16th-century ": null
    },
    {
        "Luther Bible": "Luther Bible"
    },
    {
        " continues, to this day, to place Hebrews, James, Jude, and the Apocalypse last. This reflects the thoughts of the Reformer Martin Luther ": null
    },
    {
        "on the canonicity of these books": "Luthers Canon"
    },
    {
        ".            The books that eventually found a permanent place in the New Testament were not the only works of Christian literature produced in the earliest Christian centuries. The long process of ": null
    },
    {
        "canonization": "Development Of The New Testament Canon"
    },
    {
        " began early, sometimes with tacit reception of traditional texts, sometimes with explicit selection or rejection of particular texts as either acceptable or unacceptable for use in a given context .     Over the course of history, those works of early Christian literature that survived but that did not become part of the New Testament have been variously grouped by theologians and scholars. Drawing upon, though redefining, an older term used in ": null
    },
    {
        "early Christianity": "Early Christianity"
    },
    {
        " and among Protestants when referring to those books found in the Christian ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        " although not in the ": null
    },
    {
        "Jewish Bible": "Tanakh"
    },
    {
        ", modern scholars began to refer to these works of early Christian literature not included in the New Testament as apocryphal , by which was meant non-canonical.     Collected editions of these works were then referred to as the ": null
    },
    {
        "New Testament apocrypha": "New Testament Apocrypha"
    },
    {
        " . Typically excluded from such published collections are the following groups of works: ": null
    },
    {
        "The Apostolic Fathers": "Apostolic Fathers"
    },
    {
        ", the 2nd-century Christian apologists, ": null
    },
    {
        "the Alexandrians": "Alexandrian School"
    },
    {
        ", ": null
    },
    {
        "Tertullian": "Tertullian"
    },
    {
        ", ": null
    },
    {
        "Methodius of Olympus": "Methodius Of Olympus"
    },
    {
        ", ": null
    },
    {
        "Novatian": "Novatian"
    },
    {
        ", ": null
    },
    {
        "Cyprian": "Cyprian"
    },
    {
        ", martyrdoms, and ": null
    },
    {
        "the Desert Fathers": "Desert Fathers"
    },
    {
        ". Almost all other Christian literature from the period, and sometimes including works composed well into ": null
    },
    {
        "Late Antiquity": "Late Antiquity"
    },
    {
        ", are relegated to the so-called New Testament apocrypha.     Although not considered to be inspired by God, these apocryphal works were produced in the same ancient context and often using the same language as those books that would eventually form the New Testament. Some of these later works are dependent upon books that would later come to be in the New Testament or upon the ideas expressed in them. There is even an example of a ": null
    },
    {
        "pseudepigraph": "Pseudepigraph"
    },
    {
        "ical letter composed under the guise of a presumably lost letter of the Apostle Paul, the ": null
    },
    {
        "Epistle to the Laodiceans": "Epistle To The Laodiceans"
    },
    {
        ".          The books of the New Testament were all or nearly all written by ": null
    },
    {
        "Jewish Christians": "Jewish Christians"
    },
    {
        "—that is, Jewish disciples of Christ, who lived in the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        ", and under ": null
    },
    {
        "Roman occupation": "Judea"
    },
    {
        ".  Luke, who wrote the Gospel of Luke and the Book of Acts, is frequently thought of as an exception; scholars are divided as to whether Luke was a Gentile or a ": null
    },
    {
        "Hellenistic Jew": "Hellenistic Judaism"
    },
    {
        ". Strelan, Rick . Luke the Priest: The Authority of the Author of the Third Gospel. Farnham, ENG: Routledege-": null
    },
    {
        "Ashgate": "Ashgate Publishing"
    },
    {
        ". pp. 102–105. A few scholars identify the author of the Gospel of Mark as probably a Gentile, and similarly for the Gospel of Matthew, though most assert Jewish-Christian authorship. For discussion of Mark, see Schröter, Jens . Gospel of Mark . In Aune, David. The Blackwell Companion to the New Testament. New York: Wiley-Blackwell. pp. 281f. For discussion of Mark, see Hare, Douglas R. A. . Mark. Louisville, Kentucky: Westminster John Knox Press. pp. 3–5. For discussion of Matthew, see Repschinski, Boris . Forschungbericht: Matthew and Judaism . The Controversy Stories in the Gospel of Matthew. Göttingen, GER: Vandenhoeck & Ruprecht. pp. 13–61.              According to the large majority of ": null
    },
    {
        "critical scholars": "Biblical Criticism"
    },
    {
        ", none of the authors of the Gospels were eyewitnesses or even explicitly claimed to be eyewitnesses.    ": null
    },
    {
        "Bart D. Ehrman": "Bart D. Ehrman"
    },
    {
        " of the ": null
    },
    {
        "University of North Carolina": "University Of North Carolina"
    },
    {
        " has argued for a scholarly consensus that many New Testament books were not written by the individuals whose names are attached to them. Ehrman, Bart . Jesus, Interrupted. New York: Harper Collins. pp. 102–104. He further argues that names were not ascribed to the gospels until around 185 AD. Ehrman, Bart . Jesus: Apocalyptic Prophet of the New Millennium. Oxford, UK: Oxford University Press. pp. 43f. Ehrman, Bart D. The New Testament: A Historical Introduction to Early Christian Writings. Oxford University Press. p. 49. Other scholars concur. Sanders, E. P. . The Historical Figure of Jesus. Penguin. pp. 63–64.   Many scholars believe that none of the gospels were written in the region of ": null
    },
    {
        "Palestine": "Palestine"
    },
    {
        ". Theissen, Gerd . The Gospels in Context. London, ENG: Bloomsbury-Continuum. p. 290.     ": null
    },
    {
        "Christian tradition": "Christian Tradition"
    },
    {
        " identifies ": null
    },
    {
        "John the Apostle": "John The Apostle"
    },
    {
        " with ": null
    },
    {
        "John the Evangelist": "John The Evangelist"
    },
    {
        ", the supposed author of the ": null
    },
    {
        "Gospel of John": "Gospel Of John"
    },
    {
        ". Traditionalists tend to support the idea that the writer of the Gospel of John himself claimed to be an eyewitness in their commentaries of ": null
    },
    {
        "John 21": "John 21"
    },
    {
        "  however, this idea is rejected by the majority of modern scholars.      Most scholars hold to the ": null
    },
    {
        "two-source hypothesis": "Two-Source Hypothesis"
    },
    {
        ", which posits that the ": null
    },
    {
        "Gospel of Mark was the first gospel to be written": "Marcan Priority"
    },
    {
        ". On this view, the authors of the ": null
    },
    {
        "Gospel of Matthew": "Gospel Of Matthew"
    },
    {
        " and the ": null
    },
    {
        "Gospel of Luke": "Gospel Of Luke"
    },
    {
        " used as sources the ": null
    },
    {
        "Gospel of Mark": "Gospel Of Mark"
    },
    {
        " and a hypothetical ": null
    },
    {
        "Q document": "Q Document"
    },
    {
        " to write their individual gospel accounts.   Easton, M. G. Luke, Gospel According To . Eastons Bible Dictionary. Oak Harbor, Washington: Logos Research.   These three gospels are called the ": null
    },
    {
        "Synoptic Gospels": "Synoptic Gospels"
    },
    {
        ", because they include many of the same stories, often in the same sequence, and sometimes in exactly the same wording. Scholars agree that the Gospel of John was written last, by using a different tradition and body of testimony. In addition, most scholars agree that the author of Luke also wrote the ": null
    },
    {
        "Acts of the Apostles": "Acts Of The Apostles"
    },
    {
        ". Scholars hold that these books constituted two halves of a single work, ": null
    },
    {
        "Luke-Acts": "Luke-Acts"
    },
    {
        ".     All four gospels and the Acts of the Apostles are ": null
    },
    {
        "anonymous work": "Anonymous Work"
    },
    {
        "s.  The Gospel of John claims to be based on eyewitness testimony from the ": null
    },
    {
        "Disciple whom Jesus loved": "Disciple Whom Jesus Loved"
    },
    {
        ", but never names this character.           The Gospel of Luke and the Acts of the Apostles were both written by the same author, and are thus referred to as the Lucan texts. Horrell, D. G. . An Introduction to the Study of Paul. 2nd ed. London, ENG: Bloomsbury-T & T Clark. p. 7. Knox, W. L. . The Acts of the Apostles. pp. 2–15, for detailed arguments. The most direct evidence comes from the prefaces of each book; both were addressed to ": null
    },
    {
        "Theophilus": "Theophilus"
    },
    {
        ", and the preface to the Acts of the Apostles references my former book about the ministry of Jesus. Furthermore, there are linguistic and theological similarities between the two works, suggesting that they have a common author. Kenny, A. . A Stylometric Study of the New Testament. ": null
    },
    {
        "Schelle, Udo": "Udo Schnelle"
    },
    {
        ". The History and Theology of the New Testament Writings. p. 259. Bruce, F. F. . The Acts of the Apostles. p. 2.               The Pauline epistles are the thirteen books in the New Testament traditionally attributed to ": null
    },
    {
        "Paul of Tarsus": "Paul Of Tarsus"
    },
    {
        ". The anonymous Epistle to the Hebrews is, despite unlikely Pauline authorship, often functionally grouped with these thirteen to form a corpus of fourteen Pauline epistles.     Seven letters are generally classified as undisputed , expressing contemporary scholarly near consensus that they are the work of Paul: Romans, 1 Corinthians, 2 Corinthians, Galatians, Philippians, 1 Thessalonians and Philemon. Six additional letters bearing Pauls name do not currently enjoy the same academic consensus: Ephesians, Colossians, 2 Thessalonians, 1 Timothy, 2 Timothy and Titus.     While many scholars uphold the traditional view, some question whether the first three, called the Deutero-Pauline Epistles , are authentic letters of Paul. As for the latter three, the Pastoral epistles , some scholars uphold the traditional view of these as the genuine writings of the Apostle Paul; most, however, regard them as ": null
    },
    {
        "pseudepigrapha": "Pseudepigraphy"
    },
    {
        ". Ehrman , p. 385.     One might refer to the ": null
    },
    {
        "Epistle to the Laodiceans": "Epistle To The Laodiceans"
    },
    {
        " and the ": null
    },
    {
        "Third Epistle to the Corinthians": "Third Epistle To The Corinthians"
    },
    {
        " as examples of works identified as pseudonymous. Since the early centuries of the church, there has been debate concerning the authorship of the anonymous Epistle to the Hebrews, and contemporary scholars generally reject Pauline authorship.     The epistles all share common themes, emphasis, vocabulary and style; they exhibit a uniformity of doctrine concerning the ": null
    },
    {
        "Mosaic Law": "Ten Commandments"
    },
    {
        ", Jesus, faith, and various other issues. All of these letters easily fit into the chronology of Pauls journeys depicted in Acts of the Apostles.       The author of the ": null
    },
    {
        "Epistle of James": "Epistle Of James"
    },
    {
        " identifies himself in the opening verse as James, a servant of ": null
    },
    {
        "God": "God"
    },
    {
        " and of the Lord ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        " Christ . From the middle of the 3rd century, ": null
    },
    {
        "patristic": "Patristic"
    },
    {
        " authors cited the Epistle as written by ": null
    },
    {
        "James the Just": "James The Just"
    },
    {
        ". . 1914 Catholic Encyclopedia. Ancient and modern scholars have always been divided on the issue of authorship. Many consider the epistle to be written in the late 1st or early 2nd centuries.      The author of the ": null
    },
    {
        "First Epistle of Peter": "First Epistle Of Peter"
    },
    {
        " identifies himself in the opening verse as Peter, an ": null
    },
    {
        "apostle": "Apostle"
    },
    {
        " of Jesus Christ , and the view that the epistle was written by St. Peter is attested to by a number of ": null
    },
    {
        "Church Fathers": "Church Fathers"
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        " , ": null
    },
    {
        "Tertullian": "Tertullian"
    },
    {
        " , ": null
    },
    {
        "Clement of Alexandria": "Clement Of Alexandria"
    },
    {
        " and ": null
    },
    {
        "Origen of Alexandria": "Origen Of Alexandria"
    },
    {
        " . Unlike ": null
    },
    {
        "The Second Epistle of Peter": "The Second Epistle Of Peter"
    },
    {
        ", the authorship of which was debated in antiquity, there was little debate about Peters authorship of this first epistle until the 18th century. Although 2 Peter internally purports to be a work of the apostle, many biblical scholars have concluded that Peter is not the author.  For an early date and for a defense of the Apostle Peters authorship see Kruger, Kruger, M.J. . .  Journal of the Evangelical Theological Society . 42 : 645–671. Zahn, e.g. Zahn, S. T. Introduction to the New Testament, Vol. II. p. 250. Spitta, Spitta, F. . Der Zweite Brief des Petrus und der Brief des Judas. Bigg, Bigg, C. The Epistles of St Peter and St Jude . International Critical Commentary. and Green. e.g. Green, E. M. B. . 2 Peter Reconsidered.     The Epistle of Jude title is written as follows: Jude, a servant of Jesus Christ and a brother of James . The debate has continued over the authors identity as the apostle, the brother of Jesus, both, or neither. Bauckham, R. J. . Word Biblical Commentary, Vol. 50. Word Ltd. pp. 14ff.          The ": null
    },
    {
        "First Epistle of John": "First Epistle Of John"
    },
    {
        " is traditionally held to have been composed by ": null
    },
    {
        "John the Apostle": "John The Apostle"
    },
    {
        "  when the writer was in advanced age. The epistles content, language and conceptual style indicate that it may have had the same author as the Gospel of John, 2 John and 3 John.  ": null
    },
    {
        "Eusebius": "Eusebius"
    },
    {
        " claimed that the author of 2nd and 3rd John was not ": null
    },
    {
        "John the Apostle": "John The Apostle"
    },
    {
        ", but an elder John which refers either to the apostle at an advanced age or a hypothetical second individual . Eusebius. Chapter 39 . . Scholars today are divided on the issue.       The author of the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        " identifies himself several times as John . and states that he was on ": null
    },
    {
        "Patmos": "Patmos"
    },
    {
        " when he received his first vision. As a result, the author is sometimes referred to as ": null
    },
    {
        "John of Patmos": "John Of Patmos"
    },
    {
        ". The author has traditionally been identified with ": null
    },
    {
        "John the Apostle": "John The Apostle"
    },
    {
        " to whom the ": null
    },
    {
        "Gospel": "Gospel Of John"
    },
    {
        " and the ": null
    },
    {
        "epistles of John": "Epistles Of John"
    },
    {
        " were attributed. It was believed that he was exiled to the island of Patmos during the reign of the ": null
    },
    {
        "Roman emperor": "Roman Emperor"
    },
    {
        " Domitian": "Domitian"
    },
    {
        ", and there wrote Revelation. ": null
    },
    {
        "Justin Martyr": "Justin Martyr"
    },
    {
        " who was acquainted with ": null
    },
    {
        "Polycarp": "Polycarp"
    },
    {
        ", who had been mentored by John, makes a possible allusion to this book, and credits John as the source. Justin Martyr.  Dialogue with Trypho . Chapter LXXXI. ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        " assumes it as a conceded point. According to the Zondervan Pictorial Encyclopedia of the Bible, modern scholars are divided between the apostolic view and several alternative hypotheses put forth in the last hundred years or so. Tenney, Merrill C., gen. ed. . Revelation, Book of the . Zondervan Pictorial Encyclopedia of the Bible, Vol. 5 . Grand Rapids, Michigan: Zondervan. ": null
    },
    {
        "Ben Witherington": "Ben Witherington"
    },
    {
        " points out that linguistic evidence makes it unlikely that the books were written by the same person. Witherington, Ben . Revelation. Cambridge University Press. p. 2.            The earliest ": null
    },
    {
        "manuscripts": "Biblical Manuscript"
    },
    {
        " of New Testament books date from the late second to early third centuries .  These manuscripts place a clear ": null
    },
    {
        "upper limit": "Terminus Post Quem"
    },
    {
        " on the dating of New Testament texts. Explicit references to NT books in extra-biblical documents can push this upper limit down a bit further. ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        " of Lyon names and quotes from most of the books in the New Testament in his book ": null
    },
    {
        "Against Heresies": "Against Heresies"
    },
    {
        ", written around 180 AD. The ": null
    },
    {
        "Epistle of Polycarp to the Philippians": "Epistle Of Polycarp To The Philippians"
    },
    {
        ", written some time between 110 and ": null
    },
    {
        "Polycarps death": "Polycarp"
    },
    {
        " in 155-167 AD, quotes or alludes to most New Testament texts. Biblical scholar ": null
    },
    {
        "David Trobisch": "David Trobisch"
    },
    {
        " concludes in his survey of the evidence that no book of the New Testament could have been written later than 167 AD, the latest date for the martyrdom of ": null
    },
    {
        "Polycarp": "Polycarp"
    },
    {
        ".       Literary analysis of the New Testament texts themselves can be used to date many of the books of the New Testament to the mid- to late first century. The earliest works of the New Testament are the letters of the ": null
    },
    {
        "Apostle Paul": "Paul The Apostle"
    },
    {
        ". It can be determined that ": null
    },
    {
        "1 Thessalonians": "First Epistle To The Thessalonians"
    },
    {
        " is likely the earliest of these letters, written around 52 AD. ": null
    },
    {
        "Raymond E. Brown": "Raymond E. Brown"
    },
    {
        ", An Introduction to the New Testament, ": null
    },
    {
        "Anchor Bible": "Anchor Bible"
    },
    {
        ", 1997. pp. 456–466.          The major languages spoken by both Jews and Greeks in the ": null
    },
    {
        "Holy Land": "Holy Land"
    },
    {
        " at the ": null
    },
    {
        "time of Jesus": "Cultural And Historical Background Of Jesus"
    },
    {
        " were ": null
    },
    {
        "Aramaic": "Aramaic Of Jesus"
    },
    {
        " and ": null
    },
    {
        "Koine Greek": "Koine Greek"
    },
    {
        ", and also a colloquial dialect of ": null
    },
    {
        "Mishnaic Hebrew": "Mishnaic Hebrew"
    },
    {
        ". It is generally agreed by most scholars that the ": null
    },
    {
        "historical Jesus": "Historical Jesus"
    },
    {
        " primarily spoke ": null
    },
    {
        "Aramaic": "Aramaic Of Jesus"
    },
    {
        ",  perhaps also some ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " and ": null
    },
    {
        "Koine Greek": "Koine Greek"
    },
    {
        ". The majority view is that all of the books that would eventually form the New Testament were written in the Koine Greek language. Metzger, Bruce M.; Ehrman, Bart D. . The Text of the New Testament: Its Transmission, Corruption, and Restoration. 4th ed. Oxford University Press. Aland, K.; Aland, B. . The Text of the New Testament. Wm. B. Eerdmans Publishing. .     ": null
    },
    {
        "As Christianity spread": "Early Centers Of Christianity"
    },
    {
        ", these books were later translated into other languages, most notably, ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ", ": null
    },
    {
        "Syriac": "Syriac Language"
    },
    {
        ", and ": null
    },
    {
        "Egyptian Coptic": "Coptic Language"
    },
    {
        ". However, some of the ": null
    },
    {
        "Church Fathers": "Church Fathers"
    },
    {
        " Koester, Helmut . Introduction to the New Testament, Volume 2. Philadelphia. p. 172. imply or claim that Matthew was originally written in ": null
    },
    {
        "Hebrew": "Hebrew Gospel Of Matthew"
    },
    {
        " or ": null
    },
    {
        "Aramaic": "Aramaic Matthew"
    },
    {
        ", and then soon after was written in Koine Greek. Nevertheless, the Gospel of Matthew known today was composed in Greek and is neither directly dependent upon nor a translation of a text in a ": null
    },
    {
        "Semitic language": "Semitic Languages"
    },
    {
        ". Davies, W. D.; Allison, Dale C. . A Critical and Exegetical Commentary on The Gospel according to Saint Matthew, Vol. 1. Edinburgh: T & T Clark. pp. 33–58.          The process of canonization of the New Testament was complex and lengthy. In the initial centuries of ": null
    },
    {
        "early Christianity": "Early Christianity"
    },
    {
        ", there were many books widely considered by the church to be inspired, but there was no single formally recognized New Testament canon. Eusebius. Chapter 25 . . The process was characterized by a compilation of books that ": null
    },
    {
        "apostolic tradition": "Sacred Tradition"
    },
    {
        " considered authoritative in worship and teaching, relevant to the historical situations in which they lived, and consonant with the Old Testament. Gamble, Harry Y. . The New Testament Canon: Its Making and Meaning. Guides to Biblical Scholarship. Philadelphia: Fortress. Writings attributed to the apostles circulated among the ": null
    },
    {
        "earliest Christian communities": "Early Centers Of Christianity"
    },
    {
        " and the Pauline epistles were circulating, perhaps in collected forms, by the end of the ": null
    },
    {
        "1st century AD": "Christianity In The 1St Century"
    },
    {
        ". Three forms are postulated, from The Canon Debate, chapter 18, p. 300, note 21, attributed to Harry Y. Gamble: Marcions collection that begins with Galatians and ends with Philemon; Papyrus 46, dated about 200, that follows the order that became established except for reversing Ephesians and Galatians; and the letters to seven churches, treating those to the same church as one letter and basing the order on length, so that Corinthians is first and Colossians is last.     One of the earliest attempts at solidifying a canon was made by ": null
    },
    {
        "Marcion": "Marcion"
    },
    {
        ", circa 140 AD, who accepted only a modified version of Luke  and ten of Pauls letters, while rejecting the Old Testament entirely. His canon was largely rejected by other groups of Christians, notably the ": null
    },
    {
        "proto-orthodox Christians": "Proto-Orthodox Christianity"
    },
    {
        ", as was his theology, ": null
    },
    {
        "Marcionism": "Marcionism"
    },
    {
        ". ": null
    },
    {
        "Adolf von Harnack": "Adolf Von Harnack"
    },
    {
        ",  John Knox,  and ": null
    },
    {
        "David Trobisch": "David Trobisch"
    },
    {
        ", among other scholars, have argued that the church formulated its New Testament canon partially in response to the challenge posed by Marcion.     ": null
    },
    {
        "Polycarp": "Polycarp"
    },
    {
        ", ": null
    },
    {
        "Epistle of Polycarp to the Philippians": "Epistle Of Polycarp To The Philippians"
    },
    {
        ",  ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        "  Against Heresies , inter alia, 3.12.12 and ": null
    },
    {
        "Tertullian": "Tertullian"
    },
    {
        " Adversus Marcionem, inter alia, V.14 held the ": null
    },
    {
        "epistles of Paul": "Pauline Epistles"
    },
    {
        " to be divinely inspired scripture. Other books were held in high esteem but were gradually relegated to the status of ": null
    },
    {
        "New Testament apocrypha": "New Testament Apocrypha"
    },
    {
        ". Justin Martyr, in the mid ": null
    },
    {
        "2nd century": "Christianity In The 2Nd Century"
    },
    {
        ", mentions memoirs of the apostles as being read on Sunday alongside the ": null
    },
    {
        " writings of the prophets ": "Neviim"
    },
    {
        ". Justin Martyr. . Chapter 67.     The ": null
    },
    {
        "Muratorian fragment": "Muratorian Fragment"
    },
    {
        ", dated at between 170 and as late as the end of the 4th century , may be the earliest known New Testament canon attributed to mainstream Christianity. It is similar, but not identical, to the modern New Testament canon.     The oldest clear endorsement of Matthew, Mark, Luke, and John being the only legitimate gospels was written circa 180 AD. A four gospel canon  was asserted by Irenaeus, who refers to it directly  Irenaeus. . Against Heresies, Book III. Section 8. in his ": null
    },
    {
        "polemic": "Polemic"
    },
    {
        "  Against Heresies    The books considered to be authoritative by Irenaeus included the four gospels and many of the letters of Paul, although, based on the arguments Irenaeus made in support of only four authentic gospels, some interpreters deduce that the fourfold Gospel must have still been a novelty in Irenaeuss time.        By the early 200s, ": null
    },
    {
        "Origen": "Origen"
    },
    {
        " may have been using the same twenty-seven books as in the Catholic New Testament canon, though there were still disputes over the canonicity of the Letter to the Hebrews, Epistle of James, II Peter, II John and III John and the Book of Revelation, Noll, Mark A. . Turning Points. Baker Academic. pp. 36–37. known as the ": null
    },
    {
        "Antilegomena": "Antilegomena"
    },
    {
        ". Likewise, the ": null
    },
    {
        "Muratorian fragment": "Muratorian Fragment"
    },
    {
        " is evidence that, perhaps as early as 200, there existed a set of Christian writings somewhat similar to the twenty-seven book NT canon, which included four gospels and argued against objections to them. de Jonge, H. J. . The New Testament Canon . In de Jonge, H. J.; Auwers, J. M . The Biblical Canons. Leuven University Press. p. 315. Thus, while there was a good measure of debate in the ": null
    },
    {
        "Early Church": "Early Church"
    },
    {
        " over the New Testament canon, the major writings are claimed to have been accepted by almost all Christians by the middle of the ": null
    },
    {
        "3rd century": "Christianity In The 3Rd Century"
    },
    {
        ".      Origen was largely responsible for the collection of usage information regarding the texts that became the New Testament. The information used to create the late-4th-century ": null
    },
    {
        "Easter Letter": "Easter Letter"
    },
    {
        ", which declared accepted Christian writings, was probably based on the Ecclesiastical History of ": null
    },
    {
        "Eusebius of Caesarea": "Eusebius Of Caesarea"
    },
    {
        ", wherein he uses the information passed on to him by Origen to create both his list at HE 3:25 and Origens list at HE 6:25. Eusebius got his information about what texts were then accepted and what were then ": null
    },
    {
        "disputed": "Antilegomena"
    },
    {
        ", by the ": null
    },
    {
        "third-century churches throughout the known world": "Early Centers Of Christianity"
    },
    {
        ", a great deal of which Origen knew of firsthand from his extensive travels, from the library and writings of Origen. Bateman, C. G. . . Social Science Research Network.     In fact, Origen would have possibly included in his list of inspired writings other texts kept out by the likes of Eusebius—including the ": null
    },
    {
        "Epistle of Barnabas": "Epistle Of Barnabas"
    },
    {
        ", ": null
    },
    {
        "Shepherd of Hermas": "Shepherd Of Hermas"
    },
    {
        ", and ": null
    },
    {
        "1 Clement": "1 Clement"
    },
    {
        ". Notwithstanding these facts, Origen is not the originator of the idea of biblical canon, but he certainly gives the philosophical and literary-interpretative underpinnings for the whole notion. McGuckin, John A. . Origen as Literary Critic in the Alexandrian Tradition . In Perrone, L. . Origeniana Octava: Origen and the Alexandrian Tradition, Vol. 1. Bibliotheca Ephemeridum Theologicarum Lovaniensium 164. Leuven: Leuven University Press. pp. 121–37.       ": null
    },
    {
        "Eusebius": "Eusebius"
    },
    {
        ", circa 300, gave a detailed list of New Testament writings in his Ecclesiastical History , Chapter XXV:   : 1... First then must be put the holy quaternion of the gospels; following them the Acts of the Apostles... the epistles of Paul... the epistle of John... the epistle of Peter... After them is to be placed, if it really seem proper, the Book of Revelation, concerning which we shall give the different opinions at the proper time. These then belong among the accepted writings.     : 3 Among the disputed writings, which are nevertheless recognized by many, are extant the so-called epistle of James and that of Jude, also the second epistle of Peter, and those that are called the second and third of John, whether they belong to the evangelist or to another person of the same name. Among the rejected writings must be reckoned also the ": null
    },
    {
        "Acts of Paul": "Acts Of Paul"
    },
    {
        ", and the so-called ": null
    },
    {
        "Shepherd": "Shepherd Of Hermas"
    },
    {
        ", and the ": null
    },
    {
        "Apocalypse of Peter": "Apocalypse Of Peter"
    },
    {
        ", and in addition to these the extant ": null
    },
    {
        "epistle of Barnabas": "Epistle Of Barnabas"
    },
    {
        ", and the so-called ": null
    },
    {
        "Teachings of the Apostles": "Didache"
    },
    {
        "; and besides, as I said, the ": null
    },
    {
        "Apocalypse of John": "Book Of Revelation"
    },
    {
        ", if it seem proper, which some, as I said, reject, but which others class with the accepted books. And among these some have placed also the ": null
    },
    {
        "Gospel according to the Hebrews": "Gospel Of The Hebrews"
    },
    {
        "... And all these may be reckoned among the disputed books.     : 6... such books as the ": null
    },
    {
        "Gospels of Peter": "Gospel Of Peter"
    },
    {
        ", of ": null
    },
    {
        "Thomas": "Gospel Of Thomas"
    },
    {
        ", of ": null
    },
    {
        "Matthias": "Gospel Of Matthias"
    },
    {
        ", or of any others besides them, and the ": null
    },
    {
        "Acts of Andrew": "Acts Of Andrew"
    },
    {
        " and ": null
    },
    {
        "John": "Acts Of John"
    },
    {
        " and the other apostles... they clearly show themselves to be the fictions of heretics. Wherefore they are not to be placed even among the rejected writings, but are all of them to be cast aside as absurd and impious.     The Book of Revelation is counted as both accepted and disputed, which has caused some confusion over what exactly Eusebius meant by doing so. From other writings of the church fathers, it was disputed with several canon lists rejecting its canonicity. EH 3.3.5 adds further detail on Paul: Pauls fourteen epistles are well known and undisputed. It is not indeed right to overlook the fact that some have rejected the Epistle to the Hebrews, saying that it is disputed by the church of Rome, on the ground that it was not written by Paul. EH 4.29.6 mentions the ": null
    },
    {
        "Diatessaron": "Diatessaron"
    },
    {
        "Athanasius": "Athanasius"
    },
    {
        ", Bishop of Alexandria, gave a list of the books that would become the twenty-seven-book NT canon, and he used the word canonized  in regards to them. Brakke, David . Canon Formation and Social Conflict in Fourth Century Egypt: Athanasius of Alexandrias Thirty Ninth Festal Letter . Harvard Theological Review 87 : 395–419. The first council that accepted the present canon of the New Testament may have been the ": null
    },
    {
        "Synod of Hippo Regius": "Synod Of Hippo"
    },
    {
        " in North Africa ; the acts of this council, however, are lost. A brief summary of the acts was read at and accepted by the ": null
    },
    {
        "Council of Carthage ": "Council Of Carthage"
    },
    {
        " and the ": null
    },
    {
        "Council of Carthage ": "Council Of Carthage"
    },
    {
        ".  Revelation was added later in 419 at the subsequent synod of Carthage. These councils were under the authority of ": null
    },
    {
        "St. Augustine": "Augustine Of Hippo"
    },
    {
        ", who regarded the canon as already closed.   Augustine. De Civitate Dei. 22.8.     ": null
    },
    {
        "Pope Damasus Is": "Pope Damasus I"
    },
    {
        " Council of Rome": "Council Of Rome"
    },
    {
        " in 382, if the  Decretum Gelasianum  is correctly associated with it, issued a biblical canon identical to that mentioned above, or, if not, the list is at least a 6th-century compilation.  Likewise, Damasus commissioning of the Latin ": null
    },
    {
        "Vulgate": "Vulgate"
    },
    {
        " edition of the Bible, c. 383, was instrumental in the fixation of the canon in the West.  In c. 405, ": null
    },
    {
        "Pope Innocent I": "Pope Innocent I"
    },
    {
        " sent a list of the sacred books to a Gallic bishop, ": null
    },
    {
        "Exsuperius of Toulouse": "Exuperius"
    },
    {
        ". Christian scholars assert that, when these ": null
    },
    {
        "bishops": "Bishops"
    },
    {
        " and councils spoke on the matter, however, they were not defining something new but instead were ratifying what had already become the mind of the Church.       The New Testament canon as it is now was first listed by ": null
    },
    {
        "St. Athanasius, Bishop of Alexandria": "Athanasius Of Alexandria"
    },
    {
        ", in 367, in a letter written to his churches in Egypt, . Also cited is the ": null
    },
    {
        "Council of Rome": "Council Of Rome"
    },
    {
        ", but not without controversy. That canon gained wider and wider recognition until it was accepted at the ": null
    },
    {
        "Third Council of Carthage": "Third Council Of Carthage"
    },
    {
        " in 397 and 419.     Even this council did not settle the matter, however. Certain books, referred to as ": null
    },
    {
        "Antilegomena": "Antilegomena"
    },
    {
        ", continued to be questioned, especially ": null
    },
    {
        "James": "Epistle Of James"
    },
    {
        " and ": null
    },
    {
        "Revelation": "Book Of Revelation"
    },
    {
        ". Even as late as the 16th century, the Reformer ": null
    },
    {
        "Martin Luther": "Martin Luther"
    },
    {
        " questioned the ": null
    },
    {
        "Epistle of James": "Epistle Of James"
    },
    {
        ", the ": null
    },
    {
        "Epistle of Jude": "Epistle Of Jude"
    },
    {
        ", the ": null
    },
    {
        "Epistle to the Hebrews": "Epistle To The Hebrews"
    },
    {
        " and the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ". To this day, German-language ": null
    },
    {
        "Luther Bibles": "Luther Bible"
    },
    {
        "are printed with these four books at the end of the canon, rather than in their traditional order as in other editions of the Bible.     In light of this questioning of the canon of Scripture by Protestants in the 16th century, the ": null
    },
    {
        "Council of Trent": "Council Of Trent"
    },
    {
        " reaffirmed the traditional western canon , thus making the ": null
    },
    {
        "Canon of Trent": "Canon Of Trent"
    },
    {
        " and the ": null
    },
    {
        "Vulgate": "Vulgate"
    },
    {
        " Bible ": null
    },
    {
        "dogma": "Roman Catholic Dogma"
    },
    {
        " in the Catholic Church. Later, ": null
    },
    {
        "Pope Pius XI": "Pope Pius Xi"
    },
    {
        " on 2 June 1927 decreed the ": null
    },
    {
        "Comma Johanneum": "Comma Johanneum"
    },
    {
        " was open to dispute and ": null
    },
    {
        "Pope Pius XII": "Pope Pius Xii"
    },
    {
        " on 3 September 1943 issued the encyclical  Divino afflante Spiritu , which allowed translations based on other versions than just the Latin ": null
    },
    {
        "Vulgate": "Vulgate"
    },
    {
        ", notably in English the ": null
    },
    {
        "New American Bible": "New American Bible"
    },
    {
        ".     Thus, some claim that, from the ": null
    },
    {
        "4th century": "Christianity In The 4Th Centurydefining Scripture"
    },
    {
        ", there existed unanimity in the ": null
    },
    {
        "West": "Western Church"
    },
    {
        " concerning the New Testament canon ,  and that, by the ": null
    },
    {
        "5th century": "Christianity In The 5Th Century"
    },
    {
        ", the ": null
    },
    {
        "Eastern Church": "Eastern Church"
    },
    {
        ", with a few exceptions, had come to accept the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        " and thus had come into harmony on the matter of the canon.  Nonetheless, full dogmatic articulations of the canon were not made until the ": null
    },
    {
        "Canon of Trent": "Canon Of Trent"
    },
    {
        " of 1546 for ": null
    },
    {
        "Roman Catholicism": "Roman Catholicism"
    },
    {
        ", the ": null
    },
    {
        "Thirty-Nine Articles": "Thirty-Nine Articles"
    },
    {
        " of 1563 for the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ", the ": null
    },
    {
        "Westminster Confession of Faith": "Westminster Confession Of Faith"
    },
    {
        " of 1647 for ": null
    },
    {
        "Calvinism": "Calvinism"
    },
    {
        ", and the ": null
    },
    {
        "Synod of Jerusalem": "Synod Of Jerusalem"
    },
    {
        " of 1672 for the ": null
    },
    {
        "Greek Orthodox": "Greek Orthodox"
    },
    {
        ".     On the question of NT Canon formation generally, New Testament scholar Lee Martin McDonald has written that: McDonald, Lee M. . The Formation of the Christian Biblical Canon. Peabody, Massachusetts: Hendrickson. p. 116.        Christian scholars assert that when these bishops and councils spoke on the matter, they were not defining something new, but instead were ratifying what had already become the mind of the Church .     Some synods of the 4th century published lists of canonical books . The existing 27-book canon of the New Testament was reconfirmed  in the 16th century with the ": null
    },
    {
        "Council of Trent": "Council Of Trent"
    },
    {
        " of 1546,  Finally on 8 April 1546, by a vote of 24 to 15, with 16 abstensions, the Council issued a decree  in which, for the first time in the history of the church, the question of the contents of the Bible was made an absolute article of faith and confirmed by an anathema. the ": null
    },
    {
        "Thirty-Nine Articles": "Thirty-Nine Articles"
    },
    {
        " of 1563 for the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ", the ": null
    },
    {
        "Westminster Confession of Faith": "Westminster Confession Of Faith"
    },
    {
        " of 1647 for ": null
    },
    {
        "Calvinism": "Calvinism"
    },
    {
        ", and the ": null
    },
    {
        "Synod of Jerusalem": "Synod Of Jerusalem"
    },
    {
        " of 1672 for ": null
    },
    {
        "Eastern Orthodoxy": "Eastern Orthodoxy"
    },
    {
        ". Although these councils did include statements about the canon, when it came to the New Testament they were only reaffirming the existing canon, including the ": null
    },
    {
        "Antilegomena": "Antilegomena"
    },
    {
        ".     According to the  Catholic Encyclopedia  article on the Canon of the New Testament: The idea of a complete and clear-cut canon of the New Testament existing from the beginning, that is from Apostolic times, has no foundation in history. The Canon of the New Testament, like that of the Old, is the result of a development, of a process at once stimulated by disputes with doubters, both within and without the Church, and retarded by certain obscurities and natural hesitations, and which did not reach its final term until the dogmatic definition of the ": null
    },
    {
        "Tridentine Council": "Council Of Trent"
    },
    {
        ".      In 331, ": null
    },
    {
        "Constantine I": "Constantine I And Christianity"
    },
    {
        " commissioned Eusebius to deliver ": null
    },
    {
        "fifty Bibles": "Fifty Bibles Of Constantine"
    },
    {
        " for the ": null
    },
    {
        "Church of Constantinople": "Church Of Constantinople"
    },
    {
        ". ": null
    },
    {
        "Athanasius": "Athanasius"
    },
    {
        "  recorded Alexandrian scribes around 340 preparing Bibles for ": null
    },
    {
        "Constans": "Constans"
    },
    {
        ". Little else is known, though there is plenty of speculation. For example, it is speculated that this may have provided motivation for canon lists, and that ": null
    },
    {
        "Codex Vaticanus": "Codex Vaticanus Graecus 1209"
    },
    {
        " and ": null
    },
    {
        "Codex Sinaiticus": "Codex Sinaiticus"
    },
    {
        " may be examples of these Bibles. Together with the ": null
    },
    {
        "Peshitta": "Peshitta"
    },
    {
        " and ": null
    },
    {
        "Codex Alexandrinus": "Codex Alexandrinus"
    },
    {
        ", these are the earliest extant Christian Bibles.  There is no evidence among the ": null
    },
    {
        "canons of the First Council of Nicaea of any determination on the canon": "First Council Of Nicaeathe Biblical Canon"
    },
    {
        ".                  Like other literature from ": null
    },
    {
        "antiquity": "Classical Antiquity"
    },
    {
        ", the text of the New Testament was  preserved and transmitted in ": null
    },
    {
        "manuscripts": "Manuscripts"
    },
    {
        ". Manuscripts containing at least a part of the New Testament number in the thousands. The earliest of these are often very fragmentarily preserved. Some of these fragments have even been thought to date as early as the 2nd century . For the initial dating of P52, see Roberts, C. H. . An Unpublished Fragment of the Fourth Gospel in the John Rylands Library. Manchester: Manchester University Press; and Bell, H. Idris; Skeat, T. C. . Fragments of an Unknown Gospel and Other Early Christian Papyri. London: Trustees of the British Museum. Though see now Nongbri, Brent . The Use and Abuse of P52: Papyrological Pitfalls in the Dating of the Fourth Gospel . Harvard Theological Review 98The Oxford Handbook of Papyrology. Oxford: Oxford University Press. pp. 590–623.     For each subsequent century, more and more manuscripts survive that contain a portion or all of the books that were held to be part of the New Testament at that time , though occasionally these manuscripts contain other works as well . The date when a manuscript was written, however, does not necessarily reflect the date of the form of text it contains. That is, later manuscripts can, and occasionally do, contain older forms of text or older readings.     Some of the more important manuscripts containing an early text of books of the New Testament are:     The ": null
    },
    {
        "Chester Beatty Papyri": "Chester Beatty Papyri"
    },
    {
        "   The ": null
    },
    {
        "Bodmer Papyri": "Bodmer Papyri"
    },
    {
        "   Codex Bobiensis": "Codex Bobiensis"
    },
    {
        "   Uncial 0171": "Uncial 0171"
    },
    {
        "   Syriac Sinaiticus": "Syriac Sinaiticus"
    },
    {
        "   Schøyen Manuscript": "Schoyen Collection"
    },
    {
        " 2560   ": null
    },
    {
        "Codex Vaticanus": "Codex Vaticanus"
    },
    {
        "   Codex Sinaiticus": "Codex Sinaiticus"
    },
    {
        "   Codex Vercellensis": "Codex Vercellensis"
    },
    {
        "   Curetonian Gospels": "Curetonian Gospels"
    },
    {
        "   Garima Gospels": "Garima Gospels"
    },
    {
        "           Textual criticism": "Textual Criticism"
    },
    {
        " deals with the identification and removal of ": null
    },
    {
        "transcription": "Transcription"
    },
    {
        " errors in the ": null
    },
    {
        "texts": "Writing"
    },
    {
        " of ": null
    },
    {
        "manuscripts": "Manuscripts"
    },
    {
        ". Ancient ": null
    },
    {
        "scribes": "Scribes"
    },
    {
        " made errors or alterations .  The New Testament has been preserved in more than 5,800 ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " manuscripts, 10,000 ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " manuscripts and 9,300 manuscripts in various other ancient languages including ": null
    },
    {
        "Syriac": "Syriac Language"
    },
    {
        ", ": null
    },
    {
        "Slavic": "Slavic Languages"
    },
    {
        ", ": null
    },
    {
        "Ethiopic": "Ethiopic"
    },
    {
        " and ": null
    },
    {
        "Armenian": "Armenian Language"
    },
    {
        ". Even if the ": null
    },
    {
        "original Greek": "Greek New Testament"
    },
    {
        " versions were lost, the entire New Testament could still be assembled from the translations. Strobel, Lee . The Case for Christ. Chapter Three, when quoting biblical scholar ": null
    },
    {
        "Bruce Metzger": "Bruce Metzger"
    },
    {
        ".     In addition, there are so many quotes from the New Testament in early church documents and commentaries that the entire New Testament could also be assembled from these alone. Not all biblical manuscripts come from orthodox Christian writers. For example, the ": null
    },
    {
        "Gnostic": "Gnostic"
    },
    {
        " writings of ": null
    },
    {
        "Valentinus": "Valentinus"
    },
    {
        " come from the 2nd century AD, and these Christians were regarded as heretics by the mainstream church.  The sheer number of witnesses presents unique difficulties, but it also gives scholars a better idea of how close modern Bibles are to the original versions.     On noting the large number of surviving ancient manuscripts, ": null
    },
    {
        "Bruce Metzger": "Bruce Metzger"
    },
    {
        " sums up the view on the issue by saying The more often you have copies that agree with each other, especially if they emerge from different geographical areas, the more you can cross-check them to figure out what the original document was like. The only way theyd agree would be where they went back genealogically in a family tree that represents the descent of the manuscripts.       In attempting to determine the original text of the New Testament books, some modern textual critics have identified sections as additions of material, centuries after the gospel was written. These are called ": null
    },
    {
        "interpolations": "Interpolation"
    },
    {
        ". In modern translations of the Bible, the results of textual criticism have led to certain verses, words and phrases being left out or marked as not original. According to ": null
    },
    {
        "Bart D. Ehrman": "Bart D. Ehrman"
    },
    {
        ", These scribal additions are often found in late medieval manuscripts of the New Testament, but not in the manuscripts of the earlier centuries.      Most modern Bibles have footnotes to indicate passages that have disputed source documents. Bible Commentaries also discuss these, sometimes in great detail. While many variations have been discovered between early copies of biblical texts, almost all have no importance, as they are variations in spelling, punctuation, or grammar. Also, many of these variants are so particular to the Greek language that they would not appear in translations into other languages. For example, order of words often does not matter in Greek, so textual variants that flip the order of words often have no consequences.     Outside of these unimportant variants, there are a couple variants of some importance. The two most commonly cited examples are the ": null
    },
    {
        "last verses": "Mark 16"
    },
    {
        " of the Gospel of Mark Nave, Guy D. The Role and Function of Repentance in Luke-Acts. p. 194. Spong, John Shelby . . Christian Century. p. 918. Archived from  on 4 June 2011. Levine, Amy-Jill; Blickenstaff, Marianne . A Feminist Companion to John, Vol. II. Feminist Companion to the New Testament and Early Christian Writings, Vol. 5. A & C Black. p. 175. and the story of the ": null
    },
    {
        "adulterous woman": "Pericope Adulterae"
    },
    {
        " in the Gospel of John.  See note 139 on that page.  Pericope adulterae . In Cross, F. L. . The Oxford Dictionary of the Christian Church. New York: Oxford University Press. Many scholars and critics also believe that the ": null
    },
    {
        "Comma Johanneum": "Comma Johanneum"
    },
    {
        " reference supporting the ": null
    },
    {
        "Trinity": "Trinity"
    },
    {
        " doctrine in ": null
    },
    {
        "1 John": "1 John"
    },
    {
        " to have been a later addition. Ehrman , p. 166.  According to ": null
    },
    {
        "Norman Geisler": "Norman Geisler"
    },
    {
        " and William Nix, The New Testament, then, has not only survived in more manuscripts than any other book from antiquity, but it has survived in a purer form than any other great book—a form that is 99.5% pure           The often referred to Interpreters Dictionary of the Bible, a book written to prove the validity of the New Testament, says: A study of 150 Greek of the Gospel of Luke has revealed more than 30,000 different readings... It is safe to say that there is not one sentence in the New Testament in which the is wholly uniform. Parvis, M. M. Vol. 4. pp. 594–595. Most of the variation took place within the first three Christian centuries.       By the 4th century, textual families or types of text become discernible among ": null
    },
    {
        "New Testament manuscripts": "Biblical Manuscript"
    },
    {
        ". A text-type is the name given to a family of texts with similar readings due to common ancestors and mutual correction. Many early manuscripts, however, contain individual readings from several different earlier forms of text. Modern texual critics have identified the following text-types among textual witnesses to the New Testament: The ": null
    },
    {
        "Alexandrian text-type": "Alexandrian Text-Type"
    },
    {
        " is usually considered to generally preserve many early readings. It is represented, e.g., by ": null
    },
    {
        "Codex Vaticanus": "Codex Vaticanus Graecus 1209"
    },
    {
        ", ": null
    },
    {
        "Codex Sinaiticus": "Codex Sinaiticus"
    },
    {
        " and the ": null
    },
    {
        "Bodmer Papyri": "Bodmer Papyri"
    },
    {
        ".     The ": null
    },
    {
        "Western text-type": "Western Text-Type"
    },
    {
        " is generally longer and can be paraphrastic, but can also preserve early readings. The ": null
    },
    {
        "Western version of the Acts of the Apostles": "Acts Of The Apostlesmanuscripts"
    },
    {
        " is, notably, 8.5% longer than the Alexandrian form of the text. Examples of the Western text are found in ": null
    },
    {
        "Codex Bezae": "Codex Bezae"
    },
    {
        ", ": null
    },
    {
        "Codex Claromontanus": "Codex Claromontanus"
    },
    {
        ", ": null
    },
    {
        "Codex Washingtonianus": "Codex Washingtonianus"
    },
    {
        ", the ": null
    },
    {
        "Old Latin": "Vetus Latina"
    },
    {
        " , as well as in quotations by ": null
    },
    {
        "Marcion": "Marcion"
    },
    {
        ", ": null
    },
    {
        "Tatian": "Tatian"
    },
    {
        ", ": null
    },
    {
        "Irenaeus": "Irenaeus"
    },
    {
        ", ": null
    },
    {
        "Tertullian": "Tertullian"
    },
    {
        " and ": null
    },
    {
        "Cyprian": "Cyprian"
    },
    {
        ".     A text-type referred to as the ": null
    },
    {
        "Caesarean text-type": "Caesarean Text-Type"
    },
    {
        " and thought to have included witnesses such as ": null
    },
    {
        "Codex Koridethi": "Codex Koridethi"
    },
    {
        " and minuscule 565, can today be described neither as Caesarean nor as a text-type as was previously thought. However, the Gospel of Mark in ": null
    },
    {
        "Papyrus 45": "Papyrus 45"
    },
    {
        ", ": null
    },
    {
        "Codex Washingtonianus": "Codex Washingtonianus"
    },
    {
        " and in ": null
    },
    {
        "Family 13": "Family 13"
    },
    {
        " does indeed reflect a distinct type of text.     Increasing standardization of distinct text-types eventually gave rise to the ": null
    },
    {
        "Byzantine text-type": "Byzantine Text-Type"
    },
    {
        ". Since most manuscripts of the New Testament do not derive from the first several centuries, that is, they were copied after the rise of the Byzantine text-type, this form of text is found the majority of extant manuscripts and is therefore often called the Majority Text. As with all of the other text-types, the Byzantine can also occasionally preserve early readings.          ": null
    },
    {
        "Biblical criticism": "Biblical Criticism"
    },
    {
        " is the scholarly study and investigation of ": null
    },
    {
        "biblical writings": "Biblical Manuscript"
    },
    {
        " that seeks to make discerning judgments about these writings. Viewing biblical texts as having human rather than supernatural origins, it asks when and where a particular text originated; how, why, by whom, for whom, and in what circumstances it was produced; what influences were at work in its production; what sources were used in its composition; and what message it was intended to convey.     It will vary slightly depending on whether the focus is on the ": null
    },
    {
        "Old Testament": "Old Testament"
    },
    {
        ", the letters of the New Testament, or the ": null
    },
    {
        "Canonical Gospels": "Canonical Gospels"
    },
    {
        ". It also plays an important role in the quest for the ": null
    },
    {
        "historical Jesus": "Historical Jesus"
    },
    {
        ". It also addresses the physical text, including the meaning of the words and the way in which they are used, its preservation, history, and integrity. Biblical criticism draws upon a wide range of scholarly disciplines including ": null
    },
    {
        "archaeology": "Archaeology"
    },
    {
        ", ": null
    },
    {
        "anthropology": "Anthropology"
    },
    {
        ", ": null
    },
    {
        "folklore": "Folklore"
    },
    {
        ", ": null
    },
    {
        "linguistics": "Linguistics"
    },
    {
        ", ": null
    },
    {
        "Oral Tradition studies": "Christian Oral Tradition"
    },
    {
        ", history, and ": null
    },
    {
        "religious studies": "Religious Studies"
    },
    {
        ".          The ": null
    },
    {
        "textual variation": "Textual Variation"
    },
    {
        " among manuscript copies of books in the New Testament prompted attempts to discern the earliest form of text already in antiquity . The efforts began in earnest again during the ": null
    },
    {
        "Renaissance": "Renaissance"
    },
    {
        ", which saw a revival of the study of ancient Greek texts. During this period, modern ": null
    },
    {
        "textual criticism": "Textual Criticism"
    },
    {
        " was born. In this context, ": null
    },
    {
        "Christian humanists": "Christian Humanism"
    },
    {
        " such as ": null
    },
    {
        "Lorenzo Valla": "Lorenzo Valla"
    },
    {
        " and ": null
    },
    {
        "Erasmus": "Erasmus"
    },
    {
        " promoted a return to the original Greek of the New Testament. This was the beginning of modern ": null
    },
    {
        "New Testament textual criticism": "New Testament Textual Criticism"
    },
    {
        ", which over subsequent centuries would increasingly incorporate more and more manuscripts, in more languages , as well as citations of the New Testament by ancient authors and the New Testament text in ": null
    },
    {
        "lectionaries": "Lectionary"
    },
    {
        " in order to reconstruct the earliest recoverable form of the New Testament text and the history of changes to it. ": null
    },
    {
        "Metzger, Bruce M.": "Bruce M. Metzger"
    },
    {
        "; ": null
    },
    {
        "Ehrman, Bart D.": "Bart D. Ehrman"
    },
    {
        " . The Text of the New Testament: Its Transmission, Corruption, and Restoration. 4th ed. Oxford: Oxford University Press.          Books that later formed the New Testament, like other Christian literature of the period, originated in a literary context that reveals relationships not only to other Christian writings, but also to ": null
    },
    {
        "Graeco-Roman": "Classics"
    },
    {
        " and ": null
    },
    {
        "Jewish": "Judaismantiquity"
    },
    {
        " works. Of singular importance is the extensive use of and interaction with the ": null
    },
    {
        "Jewish Bible": "Tanakh"
    },
    {
        " and what would become the ": null
    },
    {
        "Christian Old Testament": "Old Testament"
    },
    {
        ". Both implicit and explicit citations, as well as countless allusions, appear throughout the books of the New Testament, from the Gospels and Acts, to the Epistles, to the Apocalypse. See, e.g., Stendahl, Krister . The School of St. Matthew and Its Use of the Old Testament. Uppsala and Lund; Marcus, Joel . The Way of the Lord: Christological Exegesis of the Old Testament in the Gospel of Mark. Edinburgh; Smith, D. Moody . The Use of the Old Testament in the New . In The Use of the Old Testament in the New and Other Essays: Studies in Honor of William Franklin Stinespring. Durham, North Carolina: Duke University Press. pp. 3–65; ": null
    },
    {
        "Juel, Donald": "Donald Juel"
    },
    {
        " . Messianic Exegesis: Christological Interpretation of the Old Testament in Early Christianity. Philadelphia: Fortress; and Barr, James . Old and New in Interpretation: A Study of the Two Testaments. London: SCM.       The first translations of the New Testament were made beginning already at the end of 2nd century. The earliest versions of the New Testament are the translations into the ": null
    },
    {
        "Syriac": "Syriac Language"
    },
    {
        ", ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ", and ": null
    },
    {
        "Coptic": "Coptic Language"
    },
    {
        " languages. ": null
    },
    {
        "Võõbus, Arthur": "Arthur Võõbus"
    },
    {
        " . Early Versions of the New Testament. Stockholm. pp. 1–128, 211–240. These three versions were made directly from the Greek, and are frequently cited in the apparatuses of modern critical editions.             Syriac was spoken in ": null
    },
    {
        "Syria": "Syria"
    },
    {
        ", and ": null
    },
    {
        "Mesopotamia": "Mesopotamia"
    },
    {
        ", and with dialect in ": null
    },
    {
        "Roman": "Syria Palaestina"
    },
    {
        " and ": null
    },
    {
        "Byzantine Palestine": "Palaestina Secunda"
    },
    {
        " where it was known as ": null
    },
    {
        "Jewish Palestinian Aramaic": "Jewish Palestinian Aramaic"
    },
    {
        ". Several Syriac translations were made and have come to us. Most of the Old Syriac, however, as well as the Philoxonian version have been lost.     ": null
    },
    {
        "Tatian": "Tatian"
    },
    {
        ", the Assyrian, created the ": null
    },
    {
        "Diatessaron": "Diatessaron"
    },
    {
        ", a ": null
    },
    {
        "gospel harmony": "Gospel Harmony"
    },
    {
        " written in Syriac around 170 AD and the earliest form of the gospel not only in Syriac but probably also in Armenian.     In the 19th century, manuscript evidence was discovered for an Old Syriac version of the four distinct gospels. These separated  gospels, though old, have been shown to be later than the Diatessaron. The Old Syriac gospels are fragmentarily preserved in two manuscripts: the 5th-century ": null
    },
    {
        "Curetonian Syriac": "Curetonian Gospels"
    },
    {
        " and the ": null
    },
    {
        "Sinaitic Syriac": "Syriac Sinaiticus"
    },
    {
        " from the 4th or 5th century.     No Old Syriac manuscripts of other portions of the New Testament survive, though Old Syriac readings, e.g. from the ": null
    },
    {
        "Pauline Epistles": "Pauline Epistles"
    },
    {
        ", can be discerned in citations made by Eastern fathers and in later Syriac versions. The Old Syriac version is a representative of the ": null
    },
    {
        "Western text-type": "Western Text-Type"
    },
    {
        ". The ": null
    },
    {
        "Peshitta": "Peshitta"
    },
    {
        " version was prepared in the beginning of the 5th century. It contains only 22 books .     The ": null
    },
    {
        "Philoxenian": "Philoxenian"
    },
    {
        " probably was produced in 508 for ": null
    },
    {
        "Philoxenus, Bishop of Mabung": "Philoxenus, Bishop Of Mabung"
    },
    {
        ".           The Gospels were likely translated into Latin as early as the last quarter of the 2nd century in North Africa . Not much later, there were also European Latin translations . There are about 80 Old Latin mansucripts. The ": null
    },
    {
        "Vetus Latina": "Vetus Latina"
    },
    {
        " versions often contain readings with a Western type of text.      The bewildering diversity of the Old Latin versions prompted ": null
    },
    {
        "Jerome": "Jerome"
    },
    {
        " to prepare another translation into Latin—the ": null
    },
    {
        "Vulgate": "Vulgate"
    },
    {
        ". In many respects it was merely a revision of the Old Latin. There are currently around 8,000 manuscripts of the Vulgate.          There are several dialects of the Coptic language: ": null
    },
    {
        "Bohairic": "Bohairic"
    },
    {
        " , ": null
    },
    {
        "Fayyumic": "Fayyumic"
    },
    {
        ", ": null
    },
    {
        "Sahidic": "Sahidic"
    },
    {
        " , ": null
    },
    {
        "Akhmimic": "Akhmimic"
    },
    {
        ", and others. The first translation was made by at least the 3rd century into the Sahidic dialect . This translation represents a mixed text, mostly ": null
    },
    {
        "Alexandrian": "Alexandrian Text-Type"
    },
    {
        ", though also with ": null
    },
    {
        "Western": "Western Text-Type"
    },
    {
        " readings.      A Bohairic translation was made later, but existed already in the 4th century. Though the translation makes less use of Greek words than the Sahidic, it does employ some Greek grammar . For this reason, the Bohairic translation can be helpful in the reconstruction of the early Greek text of the New Testament. ;           The continued spread of Christianity, and the foundation of national churches, led to the translation of the Bible—often beginning with books from the New Testament—into a variety of other languages at a relatively early date: ": null
    },
    {
        "Armenian": "Bible Translations Into Armenian"
    },
    {
        ", ": null
    },
    {
        "Georgian": "Bible Translations Into Georgian"
    },
    {
        ", ": null
    },
    {
        "Ethiopic": "Ethiopic"
    },
    {
        ", ": null
    },
    {
        "Persian": "Bible Translations Into Persian"
    },
    {
        ", ": null
    },
    {
        "Sogdian": "Bible Translations Into Sogdian"
    },
    {
        ", and eventually ": null
    },
    {
        "Gothic": "Gothic Bible"
    },
    {
        ", ": null
    },
    {
        "Old Church Slavonic": "Bible Translations Into Church Slavonic"
    },
    {
        ", ": null
    },
    {
        "Arabic": "Bible Translations Into Arabic"
    },
    {
        ", and ": null
    },
    {
        "Nubian": "Bible Translations Into Nubian"
    },
    {
        ". On the Armenian, Georgian, Ethiopic, Arabic, and Gothic, see             Historically, throughout the ": null
    },
    {
        "Christian world": "Christendom"
    },
    {
        " and in the context of ": null
    },
    {
        "Christian missionary activity": "Mission"
    },
    {
        ", the New Testament has been that part of the Christian Bible first translated into the ": null
    },
    {
        "vernacular": "Vernacular"
    },
    {
        ". The production of such translations grew out of the insertion of ": null
    },
    {
        "vernacular": "Vernacular"
    },
    {
        " glosses": "Gloss"
    },
    {
        " in biblical texts, as well as out of the production of ": null
    },
    {
        "biblical paraphrases": "Biblical Paraphrase"
    },
    {
        "and poetic renditions of stories from the life of Christ .     The 16th century saw the rise of ": null
    },
    {
        "Protestantism": "Protestantism"
    },
    {
        " and an explosion of translations of the New Testament into the ": null
    },
    {
        "vernacular": "Vernacular"
    },
    {
        ". Notable are those of ": null
    },
    {
        "Martin Luther": "Luther Bible"
    },
    {
        " , ": null
    },
    {
        "Jacques Lefèvre dÉtaples": "Jacques Lefèvre Détaples"
    },
    {
        " , the ": null
    },
    {
        "Froschau Bible": "Zürich Bible"
    },
    {
        " , ": null
    },
    {
        "William Tyndale": "Tyndale Bible"
    },
    {
        " , the ": null
    },
    {
        "Brest Bible": "Brest Bible"
    },
    {
        " , and the ": null
    },
    {
        "Authorized Version": "Authorized King James Version"
    },
    {
        " .     Most of these translations relied upon one of the printed editions of the Greek New Testament edited by ": null
    },
    {
        "Erasmus": "Erasmus"
    },
    {
        ", a form of this Greek text emerged as the standard and is known as the ": null
    },
    {
        "Textus Receptus": "Textus Receptus"
    },
    {
        ". This text, based on the majority of manuscripts is also used in the majority of translations that were made in the years 100 to 400 AD.     Translations of the New Testament made since the appearance of critical editions of the Greek text  have largely used them as their ": null
    },
    {
        "base text": "Source Text"
    },
    {
        ". Unlike the ": null
    },
    {
        "Textus Receptus": "Textus Receptus"
    },
    {
        ", these have a pronounced Alexandrian character. Standard critical editions are those of ": null
    },
    {
        "Souter": "Alexander Souter"
    },
    {
        ", Vogels, Bover, Merk, and ": null
    },
    {
        "Nestlé-Aland": "Novum Testamentum Graece"
    },
    {
        " .     Notable translations of the New Testament based on these most recent critical editions include the ": null
    },
    {
        "Revised Standard Version": "Revised Standard Version"
    },
    {
        " , ": null
    },
    {
        "La Bible de Jérusalem": ":Fr:La Bible De Jérusalem"
    },
    {
        " , the ": null
    },
    {
        "Einheitsübersetzung": "Einheitsübersetzung"
    },
    {
        " , the ": null
    },
    {
        "New American Bible": "New American Bible"
    },
    {
        " , the ": null
    },
    {
        "Traduction Oecuménique de la Bible": "Traduction Oecuménique De La Bible"
    },
    {
        " , and the ": null
    },
    {
        "New Revised Standard Version": "New Revised Standard Version"
    },
    {
        " .          Though all Christian churches accept the New Testament as scripture, they differ in their understanding of the nature, extent, and relevance of its authority. Views of the authoritativeness of the New Testament often depend on the concept of  inspiration , which relates to the role of God in the formation of the New Testament. Generally, the greater the role of God in ones doctrine of inspiration, the more one accepts the ": null
    },
    {
        "doctrine": "Doctrine"
    },
    {
        " of ": null
    },
    {
        "biblical inerrancy": "Biblical Inerrancy"
    },
    {
        " or authoritativeness of the Bible. One possible source of confusion is that these terms are difficult to define, because many people use them interchangeably or with very different meanings. This article will use the terms in the following manner:   Infallibility relates to the absolute correctness of the Bible in matters of doctrine.   Inerrancy relates to the absolute correctness of the Bible in factual assertions .   Authoritativeness relates to the correctness of the Bible in questions of practice in morality.          All of these concepts depend for their meaning on the supposition that the text of Bible has been properly interpreted, with consideration for the intention of the text, whether ": null
    },
    {
        "literal": "Literal And Figurative Language"
    },
    {
        " history, ": null
    },
    {
        "allegory": "Allegory"
    },
    {
        " or poetry, etc. Especially the doctrine of inerrancy is variously understood according to the weight given by the interpreter to scientific investigations of the world.       The notion of unity in diversity of Scripture claims that the Bible presents a noncontradictory and consistent message concerning God and redemptive history. The fact of diversity is observed in comparing the diversity of time, culture, authors perspectives, literary genre, and the theological themes.     Studies from many theologians considering the unity in diversity to be found in the New Testament have been collected and summarized by New Testament theologian ": null
    },
    {
        "Frank Stagg": "Frank Stagg"
    },
    {
        ". He describes them as some basic presuppositions, tenets, and concerns common among the New Testament writers, giving to the New Testament its unity in diversity :   The reality of God is never argued but is always assumed and affirmed   Jesus Christ is absolutely central: he is Lord and Savior, the foretold Prophet, the Messianic King, the Chosen, the way, the truth, and the light, the One through whom God the Father not only acted but through whom He came   The Holy Spirit came anew with Jesus Christ.   The Christian faith and life are a calling, rooted in divine election.   The plight of everyone as sinner means that each person is completely dependent upon the mercy and grace of God   Salvation is both Gods gift and his demand through Jesus Christ, to be received by faith   The death and resurrection of Jesus are at the heart of the total event of which he was the center   God creates a people of his own, designated and described by varied terminology and analogies   History must be understood eschatologically, being brought along toward its ultimate goal when the kingdom of God, already present in Christ, is brought to its complete triumph   In Christ, all of Gods work of creation, revelation, and redemption is brought to fulfillment Stagg, Frank . New Testament Theology. Broadman. .       For the ": null
    },
    {
        "Roman Catholic Church": "Roman Catholic Church"
    },
    {
        ", there are two modes of Revelation: Scripture and ": null
    },
    {
        "Tradition": "Apostolic Tradition"
    },
    {
        ". Both of them are interpreted by the teachings of the Church. The Roman Catholic view is expressed clearly in the ": null
    },
    {
        "Catechism of the Catholic Church": "Catechism Of The Catholic Church"
    },
    {
        " :     § 82: As a result the Church, to whom the transmission and interpretation of Revelation is entrusted, does not derive her certainty about all revealed truths from the holy Scriptures alone. Both Scripture and Tradition must be accepted and honoured with equal sentiments of devotion and reverence.     § 107: The inspired books teach the truth. Since therefore all that the inspired authors or sacred writers affirm should be regarded as affirmed by the Holy Spirit, we must acknowledge that the books of Scripture firmly, faithfully, and without error teach that truth which God, for the sake of our salvation, wished to see confided to the Sacred Scriptures.   In Catholic terminology the teaching office is called the ": null
    },
    {
        "Magisterium": "Magisterium"
    },
    {
        ". The Catholic view should not be confused with the two-source theory. As the Catechism states in §§ 80 and 81, Revelation has one common source ... two distinct modes of transmission. . Catechism of the Catholic Church. 2nd ed. 1997.     While many ": null
    },
    {
        "Eastern Orthodox": "Eastern Orthodox Church"
    },
    {
        " writers distinguish between Scripture and Tradition, Bishop Kallistos Ware says that for the Orthodox there is only one source of the Christian faith, Holy Tradition, within which Scripture exists. Ware, Kallistos . .The Orthodox Church. Penguin UK.     Traditional ": null
    },
    {
        "Anglicans": "Anglican Communion"
    },
    {
        " believe that Holy Scripture containeth all things necessary to salvation , , but also that the Catholic Creeds ought thoroughly to be received and believed , and that the Church hath authority in Controversies of Faith and is a witness and keeper of Holy Writ .  Classical Anglicanism, therefore, like Orthodoxy, holds that Holy Tradition is the only safe guardian against perversion and innovation in the interpretation of Scripture.     In the famous words of Thomas Ken, Bishop of Bath and Wells: As for my religion, I dye in the holy catholic and apostolic faith professed by the whole Church before the disunion of East and West, more particularly in the communion of the Church of England, as it stands distinguished from all Papal and Puritan innovations, and as it adheres to the doctrine of the Cross.       Following the doctrine of ": null
    },
    {
        "sola scriptura": "Sola Scriptura"
    },
    {
        ", Protestants believe that their traditions of faith, practice and interpretations carry forward what the scriptures teach, and so tradition is not a source of authority in itself. Their traditions derive authority from the Bible, and are therefore always open to reëvaluation. This openness to doctrinal revision has extended in ": null
    },
    {
        "Liberal": "Liberal Christianity"
    },
    {
        " Protestant traditions even to the reevaluation of the doctrine of Scripture upon which the Reformation was founded, and members of these traditions may even question whether the Bible is infallible in doctrine, inerrant in historical and other factual statements, and whether it has uniquely divine authority. However, the adjustments made by modern ": null
    },
    {
        "Protestants": "Protestantism"
    },
    {
        " to their doctrine of scripture vary widely.       Within the US, the ": null
    },
    {
        "Chicago Statement on Biblical Inerrancy": "Chicago Statement On Biblical Inerrancy"
    },
    {
        " is a statement, articulating evangelical views on this issue. Paragraph four of its summary states: Being wholly and verbally God-given, Scripture is without error or fault in all its teaching, no less in what it states about Gods acts in creation, about the events of world history, and about its own literary origins under God, than in its witness to Gods saving grace in individual lives.        ": null
    },
    {
        "Mainline": "Mainline"
    },
    {
        " American ": null
    },
    {
        "Protestant": "Protestant"
    },
    {
        " denominations, including the ": null
    },
    {
        "United Methodist Church": "United Methodist Church"
    },
    {
        ", ": null
    },
    {
        "Presbyterian Church USA": "Presbyterian Church Usa"
    },
    {
        ", ": null
    },
    {
        "The Episcopal Church": "Episcopal Church In The United States Of America"
    },
    {
        ", and ": null
    },
    {
        "Evangelical Lutheran Church in America": "Evangelical Lutheran Church In America"
    },
    {
        ", do not teach the doctrine of inerrancy as set forth in the Chicago Statement. All of these churches have more ancient doctrinal statements asserting the authority of scripture, but may interpret these statements in such a way as to allow for a very broad range of teaching—from evangelicalism to skepticism. It is not an impediment to ordination in these denominations to teach that the scriptures contain errors, or that the authors follow a more or less unenlightened ethics that, however appropriate it may have seemed in the authors time, moderns would be very wrong to follow blindly.     For example, ": null
    },
    {
        "ordination of women": "Ordination Of Women"
    },
    {
        " is universally accepted in the mainline churches, ": null
    },
    {
        "abortion": "Abortion"
    },
    {
        " is condemned as a grievous social tragedy but not always a personal ": null
    },
    {
        "sin": "Sin"
    },
    {
        " or a crime against an unborn person, and ": null
    },
    {
        "homosexuality": "Homosexuality"
    },
    {
        " is sometimes recognized as a genetic propensity or morally neutral preference that should be neither encouraged nor condemned. In North America, the most contentious of these issues among these churches at the present time is how far the ordination of gay men and lesbians should be accepted.     Officials of the Presbyterian Church USA report: We acknowledge the role of scriptural authority in the Presbyterian Church, but Presbyterians generally do not believe in biblical inerrancy. Presbyterians do not insist that every detail of chronology or sequence or prescientific description in scripture be true in literal form. Our confessions do teach biblical infallibility. Infallibility affirms the entire truthfulness of scripture without depending on every exact detail. Homosexual ordination vote widens gap between Presbyterian factions . ReligionToday. 20 June 2001.     Those who hold a more liberal view of the Bible as a human witness to the glory of God, the work of fallible humans who wrote from a limited experience unusual only for the insight they have gained through their inspired struggle to know God in the midst of a troubled world. Therefore, they tend not to accept such doctrines as inerrancy. These churches also tend to retain the social activism of their evangelical forebears of the 19th century, placing particular emphasis on those teachings of scripture that teach compassion for the poor and concern for ": null
    },
    {
        "social justice": "Social Justice"
    },
    {
        ".     The message of personal ": null
    },
    {
        "salvation": "Salvation"
    },
    {
        " is, generally speaking, of the good that comes to oneself and the world through following the New Testaments ": null
    },
    {
        "Golden Rule": "Ethic Of Reciprocity"
    },
    {
        " admonition to love others without hypocrisy or prejudice. Toward these ends, the spirit of the New Testament, more than the letter, is infallible and authoritative.     There are some movements that believe the Bible contains the teachings of Jesus but who reject the churches that were formed following its publication. These people believe all individuals can communicate directly with God and therefore do not need guidance or doctrines from a church. These people are known as ": null
    },
    {
        "Christian anarchists": "Christian Anarchism"
    },
    {
        ".       ": null
    },
    {
        "Messianic Judaism": "Messianic Judaism"
    },
    {
        " generally holds the same view of New Testament authority as evangelical Protestants.    According to the view of some Messianic Jewish congregations, Jesus did not annul the Torah, but that its interpretation is revised and ultimately explained through the Apostolic Scriptures.        ": null
    },
    {
        "Jehovahs Witnesses": "Jehovahs Witnesses"
    },
    {
        " accept the New Testament as divinely inspired Scripture, and as infallible in every detail, with equal authority as the Hebrew Scriptures. They view it as the written revelation and good news of the ": null
    },
    {
        "Messiah": "Messiah"
    },
    {
        ", the ": null
    },
    {
        "ransom sacrifice of Jesus": "Atonement In Christianity"
    },
    {
        ", and the ": null
    },
    {
        "Kingdom of God": "Kingdom Of God"
    },
    {
        ", explaining and expounding the Hebrew Bible, not replacing but vitally supplementing it. They also view the New Testament as the primary instruction guide for Christian living, and ": null
    },
    {
        "church discipline": "Church Discipline"
    },
    {
        ". They generally call the New Testament the Christian Greek Scriptures , and see only the covenants as old or new , but not any part of the actual Scriptures themselves. Equipped For Every Good Work . Brooklyn, New York: Watchtower Bible and Tract Society, Inc. International Bible Students Association. 1946. pp. 12–13.       ": null
    },
    {
        "Oneness Pentecostalism": "Oneness Pentecostalism"
    },
    {
        " subscribes to the common Protestant doctrine of  sola scriptura . They view the Bible as the inspired Word of God, and as absolutely ": null
    },
    {
        "inerrant": "Biblical Inerrancy"
    },
    {
        " in its contents . See, for example,  Dulle, Jason. . Institute for Biblical Studies. Retrieved 15 April 2013. They regard the New Testament as perfect and inerrant in every way, revealing the Lord Jesus Christ in the Flesh, and his Atonement, and which also explains and illuminates the Old Testament perfectly, and is part of the Bible canon, not because church councils or decrees claimed it so, but by witness of the Holy Spirit. Dulle, Jason. . Institute for Biblical Studies. Retrieved 15 April 2013. Dulle, Jason. . Institute for Biblical Studies. Retrieved 15 April 2013.       The ": null
    },
    {
        "Seventh-day Adventist Church": "Seventh-Day Adventist Church"
    },
    {
        " holds the New Testament as the inspired Word of God, with God influencing the thoughts of the Apostles in the writing, not necessarily every word though. The first fundamental belief of the Seventh-Day Adventist church stated that The Holy Scriptures are the ": null
    },
    {
        "infallible": "Biblical Infallibility"
    },
    {
        " revelation of will. ": null
    },
    {
        "Adventist theologians": "Seventh-Day Adventist Theology"
    },
    {
        " generally reject the verbal inspiration position on Scripture held by many conservative ": null
    },
    {
        "evangelical Christians": "Evangelical Christians"
    },
    {
        ". They believe instead that God inspired the thoughts of the biblical authors and apostles, and that the writers then expressed these thoughts in their own words.  This view is popularly known as thought inspiration , and most Adventist members hold to that view. According to Ed Christian, former  JATS  editor, few if any ": null
    },
    {
        "ATS": "Adventist Theological Society"
    },
    {
        " members believe in verbal inerrancy .      Regarding the teachings of the New Testament compared to the Old, and the application in the New Covenant, Adventists have traditionally taught that the ": null
    },
    {
        "Decalogue": "Ethical Decalogue"
    },
    {
        " is part of the moral law of God, which was not abrogated by the ministry and death of ": null
    },
    {
        "Jesus Christ": "Jesus Christ"
    },
    {
        ". Therefore, the fourth commandment concerning the Sabbath is as applicable to Christian believers as the other nine. Adventists have often taught a distinction between moral law and ceremonial law . According to Adventist beliefs, the moral law continues into the New Testament era , but the ceremonial law was done away with by Jesus.     How the ": null
    },
    {
        "Mosaic law": "Mosaic Law"
    },
    {
        " should be applied came up at Adventist conferences in the past, and Adventist theologians such as ": null
    },
    {
        "A. T. Jones": "A. T. Jones"
    },
    {
        " and ": null
    },
    {
        "E. J. Waggoner": "E. J. Waggoner"
    },
    {
        " looked at the problem addressed by Paul in ": null
    },
    {
        "Galatians": "Epistle To The Galatians"
    },
    {
        " as not the ceremonial law, but rather the wrong use of the law . They were opposed by ": null
    },
    {
        "Uriah Smith": "Uriah Smith"
    },
    {
        " and ": null
    },
    {
        "George Butler": "George Ide Butler"
    },
    {
        " at the 1888 Conference. Smith in particular thought the Galatians issue had been settled by Ellen White already, yet in 1890 she claimed justification by faith is the ": null
    },
    {
        "third angels message": "Three Angels Messages"
    },
    {
        " in verity.      Ellen White interpreted  as saying that the ceremonial law was nailed to the cross. White, Ellen . . Start Publishing LLC. p. 365.       Members of ": null
    },
    {
        "The Church of Jesus Christ of Latter-day Saints": "The Church Of Jesus Christ Of Latter-Day Saints"
    },
    {
        " believe that the New Testament, as part of the ": null
    },
    {
        "Christian biblical canon": "Christian Biblical Canons"
    },
    {
        ", is accurate as far as it is translated correctly .  They believe the Bible as originally revealed is the word of God, but that the processes of transcription and translation have introduced errors into the texts as currently available, and therefore they cannot be regarded as completely inerrant.   In addition to the Old and New Testaments, the ": null
    },
    {
        "Book of Mormon": "Book Of Mormon: Another Testament Of Jesus Christ"
    },
    {
        ", the ": null
    },
    {
        "Doctrine and Covenants": "Doctrine And Covenants"
    },
    {
        " and the ": null
    },
    {
        "Pearl of Great Price": "Pearl Of Great Price"
    },
    {
        " are considered part of their scriptural canon. Encyclopedia of Mormonism, Macmillan 1992, pp. 106–107         Despite the wide variety among ": null
    },
    {
        "Christian liturgies": "Christian Liturgy"
    },
    {
        ", texts from the New Testament play a role in almost all forms of ": null
    },
    {
        "Christian worship": "Christian Worship"
    },
    {
        ". In addition to some language derived from the New Testament in the ": null
    },
    {
        "liturgy": "Liturgy"
    },
    {
        " itself , the reading of extended passages from the New Testament is a practice common to almost all ": null
    },
    {
        "Christian worship": "Christian Worship"
    },
    {
        ", liturgical or not.     These ": null
    },
    {
        "readings": "Lection"
    },
    {
        " are most often part of an established ": null
    },
    {
        "lectionary": "Lectionary"
    },
    {
        " , and  include a non-gospel reading from the New Testament and culminate with a ": null
    },
    {
        "Gospel reading": "Gospel"
    },
    {
        ". No readings from the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ", however, are included in the standard ": null
    },
    {
        "lectionary": "Lectionary"
    },
    {
        " of the ": null
    },
    {
        "Eastern Orthodox churches": "Orthodox Church"
    },
    {
        ".     Central to the ": null
    },
    {
        "Christian liturgy": "Christian Liturgy"
    },
    {
        " is the celebration of the ": null
    },
    {
        "Eucharist": "Eucharist"
    },
    {
        " or Holy Communion . The ": null
    },
    {
        "Words of Institution": "Words Of Institution"
    },
    {
        " that begin this rite are drawn directly from 1 Corinthians 11:23–26. In addition, the communal recitation of the ": null
    },
    {
        "Lords Prayer": "Lords Prayer"
    },
    {
        " is also a standard feature of ": null
    },
    {
        "Christian worship": "Christian Worship"
    },
    {
        ".           Most of the influence of the New Testament upon ": null
    },
    {
        "the arts": "The Arts"
    },
    {
        " has come from the ": null
    },
    {
        "Gospels": "Gospels"
    },
    {
        " and the ": null
    },
    {
        "Book of Revelation": "Book Of Revelation"
    },
    {
        ". Literary expansion of the ": null
    },
    {
        "Nativity of Jesus": "Nativity Of Jesus"
    },
    {
        " found in the Gospels of Matthew and Luke began already in the 2nd century, and the portrayal of the Nativity has continued in various art forms to this day. The ": null
    },
    {
        "earliest Christian art": "Early Christian Art"
    },
    {
        " would often depict scenes from the New Testament such as the ": null
    },
    {
        "raising of Lazarus": "Raising Of Lazarus"
    },
    {
        ", the ": null
    },
    {
        "baptism of Jesus": "Baptism Of Jesus"
    },
    {
        " or the motif of the ": null
    },
    {
        "Good Shepherd": "Good Shepherd"
    },
    {
        ".     ": null
    },
    {
        "Biblical paraphrases": "Biblical Paraphrase"
    },
    {
        "and poetic renditions of stories from the life of Christ  became popular in the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", as did the portrayal of the ": null
    },
    {
        "arrest": "Arrest Of Jesus"
    },
    {
        ", ": null
    },
    {
        "trial": "Trial Of Jesus"
    },
    {
        " and ": null
    },
    {
        "execution": "Crucifixion Of Jesus"
    },
    {
        " of Jesus in ": null
    },
    {
        "Passion play": "Passion Play"
    },
    {
        "s. Indeed, the ": null
    },
    {
        "Passion": "Passion"
    },
    {
        " became a central theme in Christian ": null
    },
    {
        "art": "Crucifixion In The Arts"
    },
    {
        " and ": null
    },
    {
        "music": "Passion"
    },
    {
        ". The ": null
    },
    {
        "ministry": ":Category:Portrayals Of Jesus In Film"
    },
    {
        " and ": null
    },
    {
        "Passion": "Passion Film"
    },
    {
        " of Jesus, as portrayed in one or more of the ": null
    },
    {
        "New Testament Gospels": ":Category:Films Based On The Gospels"
    }
]