[
    {
        "                    Niels Henrik David Bohr  was a Danish ": null
    },
    {
        "physicist": "Physicist"
    },
    {
        " who made foundational contributions to understanding ": null
    },
    {
        "atomic structure": "Atomic Structure"
    },
    {
        " and ": null
    },
    {
        "quantum theory": "Old Quantum Theory"
    },
    {
        ", for which he received the ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " in 1922. Bohr was also a ": null
    },
    {
        "philosopher": "Philosopher"
    },
    {
        " and a promoter of scientific research.     Bohr developed the ": null
    },
    {
        "Bohr model": "Bohr Model"
    },
    {
        " of the ": null
    },
    {
        "atom": "Atom"
    },
    {
        ", in which he proposed that energy levels of ": null
    },
    {
        "electrons": "Electron"
    },
    {
        "are discrete and that the electrons revolve in stable orbits around the ": null
    },
    {
        "atomic nucleus": "Atomic Nucleus"
    },
    {
        " but can jump from one energy level to another. Although the Bohr model has been supplanted by other models, its underlying principles remain valid. He conceived the principle of ": null
    },
    {
        "complementarity": "Complementarity"
    },
    {
        "wave or a stream of particles": "Wave–Particle Duality"
    },
    {
        ". The notion of complementarity dominated Bohrs thinking in both science and philosophy.     Bohr founded the Institute of Theoretical Physics at the ": null
    },
    {
        "University of Copenhagen": "University Of Copenhagen"
    },
    {
        ", now known as the ": null
    },
    {
        "Niels Bohr Institute": "Niels Bohr Institute"
    },
    {
        ", which opened in 1920. Bohr mentored and collaborated with physicists including ": null
    },
    {
        "Hans Kramers": "Hans Kramers"
    },
    {
        ", ": null
    },
    {
        "Oskar Klein": "Oskar Klein"
    },
    {
        ", ": null
    },
    {
        "George de Hevesy": "George De Hevesy"
    },
    {
        ", and ": null
    },
    {
        "Werner Heisenberg": "Werner Heisenberg"
    },
    {
        ". He predicted the existence of a new ": null
    },
    {
        "zirconium": "Zirconium"
    },
    {
        "-like element, which was named ": null
    },
    {
        "hafnium": "Hafnium"
    },
    {
        ", after the Latin name for Copenhagen, where it was discovered. Later, the element ": null
    },
    {
        "bohrium": "Bohrium"
    },
    {
        " was named after him.     During the 1930s, Bohr helped refugees from ": null
    },
    {
        "Nazism": "Nazism"
    },
    {
        ". After ": null
    },
    {
        "Denmark was occupied by the Germans": "German Invasion Of Denmark"
    },
    {
        ", he had a famous meeting with Heisenberg, who had become the head of the ": null
    },
    {
        "German nuclear weapon project": "German Nuclear Weapon Project"
    },
    {
        ". In September 1943, word reached Bohr that he was about to be arrested by the Germans, and he fled to Sweden. From there, he was flown to Britain, where he joined the British ": null
    },
    {
        "Tube Alloys": "Tube Alloys"
    },
    {
        " nuclear weapons project, and was part of the British mission to the ": null
    },
    {
        "Manhattan Project": "Manhattan Project"
    },
    {
        ". After the war, Bohr called for international cooperation on nuclear energy. He was involved with the establishment of ": null
    },
    {
        "CERN": "Cern"
    },
    {
        " and the ": null
    },
    {
        "Research Establishment Risø of the Danish Atomic Energy Commission": "Risø Dtu National Laboratory For Sustainable Energy"
    },
    {
        " and became the first chairman of the ": null
    },
    {
        "Nordic Institute for Theoretical Physics": "Nordic Institute For Theoretical Physics"
    },
    {
        " in 1957.       Bohr was born in ": null
    },
    {
        "Copenhagen": "Copenhagen"
    },
    {
        ", Denmark, on 7 October 1885, the second of three children of ": null
    },
    {
        "Christian Bohr": "Christian Bohr"
    },
    {
        ",   a professor of ": null
    },
    {
        "physiology": "Physiology"
    },
    {
        " at the University of Copenhagen, and Ellen Adler Bohr, who came from a wealthy ": null
    },
    {
        "Danish Jewish": "Danish Jews"
    },
    {
        " family prominent in banking and parliamentary circles. He had an elder sister, Jenny, and a younger brother ": null
    },
    {
        "Harald": "Harald Bohr"
    },
    {
        ". Jenny became a teacher, while Harald became a ": null
    },
    {
        "mathematician": "Mathematician"
    },
    {
        " and ": null
    },
    {
        "footballer": "Association Football"
    },
    {
        " who played for the ": null
    },
    {
        "Danish national team": "Denmark National Football Team"
    },
    {
        " at the ": null
    },
    {
        "1908 Summer Olympics": "1908 Summer Olympics"
    },
    {
        " in London. Niels was a passionate footballer as well, and the two brothers played several matches for the Copenhagen-based ": null
    },
    {
        "Akademisk Boldklub": "Akademisk Boldklub"
    },
    {
        " , with Niels as ": null
    },
    {
        "goalkeeper": "Goalkeeper"
    },
    {
        ". There is no truth in the oft-repeated claim that Bohr emulated his brother, Harald, by playing for the Danish national team.         Bohr was educated at Gammelholm Latin School, starting when he was seven.  In 1903, Bohr enrolled as an undergraduate at ": null
    },
    {
        "Copenhagen University": "Copenhagen University"
    },
    {
        ". His major was physics, which he studied under Professor ": null
    },
    {
        "Christian Christiansen": "Christian Christiansen"
    },
    {
        ", the universitys only professor of physics at that time. He also studied astronomy and mathematics under Professor ": null
    },
    {
        "Thorvald Thiele": "Thorvald Thiele"
    },
    {
        ", and philosophy under Professor ": null
    },
    {
        "Harald Høffding": "Harald Høffding"
    },
    {
        ", a friend of his father.      In 1905, a gold medal competition was sponsored by the ": null
    },
    {
        "Royal Danish Academy of Sciences and Letters": "Royal Danish Academy Of Sciences And Letters"
    },
    {
        " to investigate a method for measuring the ": null
    },
    {
        "surface tension": "Surface Tension"
    },
    {
        " of liquids that had been proposed by ": null
    },
    {
        "Lord Rayleigh": "John Strutt, 3Rd Baron Rayleigh"
    },
    {
        " in 1879. This involved measuring the frequency of oscillation of the radius of a water jet. Bohr conducted a series of experiments using his fathers laboratory in the university; the university itself had no physics laboratory. To complete his experiments, he had to ": null
    },
    {
        "make his own glassware": "Glass Blowing"
    },
    {
        ", creating test tubes with the required ": null
    },
    {
        "elliptical": "Ellipse"
    },
    {
        " cross-sections. He went beyond the original task, incorporating improvements into both Rayleighs theory and his method, by taking into account the ": null
    },
    {
        "viscosity": "Viscosity"
    },
    {
        " of the water, and by working with finite amplitudes instead of just infinitesimal ones. His essay, which he submitted at the last minute, won the prize. He later submitted an improved version of the paper to the ": null
    },
    {
        "Royal Society": "Royal Society"
    },
    {
        " in London for publication in the  Philosophical Transactions of the Royal Society .      Harald became the first of the two Bohr brothers to earn a ": null
    },
    {
        "masters degree": "Masters Degree"
    },
    {
        ", which he earned for mathematics in April 1909. Niels took another nine months to earn his on the electron theory of metals, a topic assigned by his supervisor, Christiansen. Bohr subsequently elaborated his masters thesis into his much-larger ": null
    },
    {
        "Doctor of Philosophy": "Doctor Of Philosophy"
    },
    {
        " thesis. He surveyed the literature on the subject, settling on a model postulated by ": null
    },
    {
        "Paul Drude": "Paul Drude"
    },
    {
        " and elaborated by ": null
    },
    {
        "Hendrik Lorentz": "Hendrik Lorentz"
    },
    {
        ", in which the electrons in a metal are considered to behave like a gas. Bohr extended Lorentzs model, but was still unable to account for phenomena like the ": null
    },
    {
        "Hall effect": "Hall Effect"
    },
    {
        ", and concluded that electron theory could not fully explain the magnetic properties of metals. The thesis was accepted in April 1911,  and Bohr conducted his formal defence on 13 May. Harald had received his doctorate the previous year. Bohrs thesis was groundbreaking, but attracted little interest outside Scandinavia because it was written in Danish, a Copenhagen University requirement at the time. In 1921, the Dutch physicist ": null
    },
    {
        "Hendrika Johanna van Leeuwen": "Hendrika Johanna Van Leeuwen"
    },
    {
        " would independently derive a theorem from Bohrs thesis that is today known as the ": null
    },
    {
        "Bohr–van Leeuwen theorem": "Bohr–Van Leeuwen Theorem"
    },
    {
        ".        In 1910, Bohr met Margrethe Nørlund, the sister of the mathematician ": null
    },
    {
        "Niels Erik Nørlund": "Niels Erik Nørlund"
    },
    {
        ". Bohr resigned his membership in the ": null
    },
    {
        "Church of Denmark": "Church Of Denmark"
    },
    {
        " on 16 April 1912, and he and Margrethe were married in a civil ceremony at the town hall in ": null
    },
    {
        "Slagelse": "Slagelse"
    },
    {
        " on 1 August. Years later, his brother Harald similarly left the church before getting married. Bohr and Margrethe had six sons. The oldest, Christian, died in a boating accident in 1934, and another, Harald, died from childhood meningitis. ": null
    },
    {
        "Aage Bohr": "Aage Bohr"
    },
    {
        " became a successful physicist, and in 1975 was awarded the Nobel Prize in physics, like his father.  became a physician; , a chemical engineer; and ": null
    },
    {
        "Ernest": "Ernest Bohr"
    },
    {
        ", a lawyer.  Like his uncle Harald, Ernest Bohr became an Olympic athlete, playing ": null
    },
    {
        "field hockey": "Field Hockey"
    },
    {
        " for Denmark at the ": null
    },
    {
        "1948 Summer Olympics": "1948 Summer Olympics"
    },
    {
        " in London.               In September 1911, Bohr, supported by a fellowship from the ": null
    },
    {
        "Carlsberg Foundation": "Carlsberg Foundation"
    },
    {
        ", travelled to England. At the time, it was where most of the theoretical work on the structure of atoms and molecules was being done. He met ": null
    },
    {
        "J. J. Thomson": "J. J. Thomson"
    },
    {
        " of the ": null
    },
    {
        "Cavendish Laboratory": "Cavendish Laboratory"
    },
    {
        " and ": null
    },
    {
        "Trinity College, Cambridge": "Trinity College, Cambridge"
    },
    {
        ". He attended lectures on ": null
    },
    {
        "electromagnetism": "Electromagnetism"
    },
    {
        " given by ": null
    },
    {
        "James Jeans": "James Jeans"
    },
    {
        " and ": null
    },
    {
        "Joseph Larmor": "Joseph Larmor"
    },
    {
        ", and did some research on ": null
    },
    {
        "cathode ray": "Cathode Ray"
    },
    {
        "s, but failed to impress Thomson. He had more success with younger physicists like the Australian ": null
    },
    {
        "William Lawrence Bragg": "William Lawrence Bragg"
    },
    {
        ", and New Zealands ": null
    },
    {
        "Ernest Rutherford": "Ernest Rutherford"
    },
    {
        ", whose 1911 small central nucleus ": null
    },
    {
        "Rutherford model": "Rutherford Model"
    },
    {
        " of the ": null
    },
    {
        "atom": "Atom"
    },
    {
        " had challenged Thomsons 1904 ": null
    },
    {
        "plum pudding model": "Plum Pudding Model"
    },
    {
        ". Bohr received an invitation from Rutherford to conduct post-doctoral work at ": null
    },
    {
        "Victoria University of Manchester": "Victoria University Of Manchester"
    },
    {
        ", where Bohr met ": null
    },
    {
        "George de Hevesy": "George De Hevesy"
    },
    {
        " and ": null
    },
    {
        "Charles Galton Darwin": "Charles Galton Darwin"
    },
    {
        " .     Bohr returned to Denmark in July 1912 for his wedding, and travelled around England and Scotland on his honeymoon. On his return, he became a  privatdocent  at the University of Copenhagen, giving lectures on ": null
    },
    {
        "thermodynamics": "Thermodynamics"
    },
    {
        ". ": null
    },
    {
        "Martin Knudsen": "Martin Knudsen"
    },
    {
        " put Bohrs name forward for a  docent , which was approved in July 1913, and Bohr then began teaching medical students. His three papers, which later became famous as the trilogy , were published in  Philosophical Magazine  in July, September and November of that year.     He adapted Rutherfords nuclear structure to ": null
    },
    {
        "Max Plancks": "Max Planck"
    },
    {
        "quantum theory and so created his ": null
    },
    {
        "Bohr model": "Bohr Model"
    },
    {
        " of the atom.     Planetary models of atoms were not new, but Bohrs treatment was. Taking the 1912 paper by Darwin on the role of electrons in the interaction of alpha particles with a nucleus as his starting point,   he advanced the theory of electrons travelling in ": null
    },
    {
        "orbits": "Orbit"
    },
    {
        "around the atoms nucleus, with the chemical properties of each element being largely determined by the number of electrons in the outer orbits of its atoms. He introduced the idea that an electron could drop from a higher-energy orbit to a lower one, in the process emitting a ": null
    },
    {
        "quantum": "Quantum"
    },
    {
        " of discrete energy. This became a basis for what is now known as the ": null
    },
    {
        "old quantum theory": "Old Quantum Theory"
    },
    {
        ".           In 1885, ": null
    },
    {
        "Johann Balmer": "Johann Balmer"
    },
    {
        " had come up with his ": null
    },
    {
        "Balmer series": "Balmer Series"
    },
    {
        " to describe the visible ": null
    },
    {
        "spectral lines": "Spectral Line"
    },
    {
        "of a ": null
    },
    {
        "hydrogen": "Hydrogen"
    },
    {
        " atom:   :   R        n3,4,5,...   where λ is the wavelength of the absorbed or emitted light and R H is the ": null
    },
    {
        "Rydberg constant": "Rydberg Constant"
    },
    {
        ". Balmers formula was corroborated by the discovery of additional spectral lines, but for thirty years, no one could explain why it worked. In the first paper of his trilogy, Bohr was able to derive it from his model:   : RZ   where m e is the electrons mass, e is its charge, h is ": null
    },
    {
        "Plancks constant": "Plancks Constant"
    },
    {
        " and Z is the atoms ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " .     The models first hurdle was the ": null
    },
    {
        "Pickering series": "Pickering Series"
    },
    {
        ", lines which did not fit Balmers formula. When challenged on this by ": null
    },
    {
        "Alfred Fowler": "Alfred Fowler"
    },
    {
        ", Bohr replied that they were caused by ": null
    },
    {
        "ionised": "Ionization"
    },
    {
        " helium": "Helium"
    },
    {
        ", helium atoms with only one electron. The Bohr model was found to work for such ions. Many older physicists, like Thomson, Rayleigh and ": null
    },
    {
        "Hendrik Lorentz": "Hendrik Lorentz"
    },
    {
        ", did not like the trilogy, but the younger generation, including Rutherford, ": null
    },
    {
        "David Hilbert": "David Hilbert"
    },
    {
        ", ": null
    },
    {
        "Albert Einstein": "Albert Einstein"
    },
    {
        ", ": null
    },
    {
        "Enrico Fermi": "Enrico Fermi"
    },
    {
        ", ": null
    },
    {
        "Max Born": "Max Born"
    },
    {
        " and ": null
    },
    {
        "Arnold Sommerfeld": "Arnold Sommerfeld"
    },
    {
        " saw it as a breakthrough. The trilogys acceptance was entirely due to its ability to explain phenomena which stymied other models, and to predict results that were subsequently verified by experiments. Today, the Bohr model of the atom has been superseded, but is still the best known model of the atom, as it often appears in high school physics and chemistry texts.     Bohr did not enjoy teaching medical students. He decided to return to Manchester, where Rutherford had offered him a job as a ": null
    },
    {
        "reader": "Reader"
    },
    {
        " in place of Darwin, whose tenure had expired. Bohr accepted. He took a leave of absence from the University of Copenhagen, which he started by taking a holiday in ": null
    },
    {
        "Tyrol": "South Tyrol"
    },
    {
        " with his brother Harald and aunt Hanna Adler. There, he visited the ": null
    },
    {
        "University of Göttingen": "University Of Göttingen"
    },
    {
        " and the ": null
    },
    {
        "Ludwig Maximilian University of Munich": "Ludwig Maximilian University Of Munich"
    },
    {
        ", where he met Sommerfeld and conducted seminars on the trilogy. The First World War broke out while they were in Tyrol, greatly complicating the trip back to Denmark and Bohrs subsequent voyage with Margrethe to England, where he arrived in October 1914. They stayed until July 1916, by which time he had been appointed to the Chair of Theoretical Physics at the University of Copenhagen, a position created especially for him. His docentship was abolished at the same time, so he still had to teach physics to medical students. New professors were formally introduced to King ": null
    },
    {
        "Christian X": "Christian X"
    },
    {
        ", who expressed his delight at meeting such a famous football player.       In April 1917, Bohr began a campaign to establish an Institute of Theoretical Physics. He gained the support of the Danish government and the Carlsberg Foundation, and sizeable contributions were also made by industry and private donors, many of them Jewish. Legislation establishing the Institute was passed in November 1918. Now known as the ": null
    },
    {
        "Niels Bohr Institute": "Niels Bohr Institute"
    },
    {
        ", it opened on 3 March 1921, with Bohr as its director. His family moved into an apartment on the first floor.   Bohrs institute served as a focal point for researchers into ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " and related subjects in the 1920s and 1930s, when most of the worlds best known theoretical physicists spent some time in his company. Early arrivals included ": null
    },
    {
        "Hans Kramers": "Hans Kramers"
    },
    {
        " from the Netherlands, ": null
    },
    {
        "Oskar Klein": "Oskar Klein"
    },
    {
        " from Sweden, George de Hevesy from Hungary, ": null
    },
    {
        "Wojciech Rubinowicz": "Wojciech Rubinowicz"
    },
    {
        " from Poland and ": null
    },
    {
        "Svein Rosseland": "Svein Rosseland"
    },
    {
        " from Norway. Bohr became widely appreciated as their congenial host and eminent colleague. Klein and Rosseland produced the Institutes first publication even before it opened.        The Bohr model worked well for hydrogen, but could not explain more complex elements. By 1919, Bohr was moving away from the idea that electrons orbited the nucleus and developed ": null
    },
    {
        "heuristics": "Heuristic"
    },
    {
        "to describe them. The ": null
    },
    {
        "rare-earth elements": "Rare-Earth Element"
    },
    {
        "posed a particular classification problem for chemists, because they were so chemically similar. An important development came in 1924 with ": null
    },
    {
        "Wolfgang Paulis": "Wolfgang Pauli"
    },
    {
        "discovery of the ": null
    },
    {
        "Pauli exclusion principle": "Pauli Exclusion Principle"
    },
    {
        ", which put Bohrs models on a firm theoretical footing. Bohr was then able to declare that the as-yet-undiscovered element 72 was not a rare-earth element, but an element with chemical properties similar to those of ": null
    },
    {
        "zirconium": "Zirconium"
    },
    {
        ". He was immediately challenged by the French chemist ": null
    },
    {
        "Georges Urbain": "Georges Urbain"
    },
    {
        ", who claimed to have discovered a rare-earth element 72, which he called celtium . At the Institute in Copenhagen, ": null
    },
    {
        "Dirk Coster": "Dirk Coster"
    },
    {
        " and George de Hevesy took up the challenge of proving Bohr right and Urbain wrong. Starting with a clear idea of the chemical properties of the unknown element greatly simplified the search process. They went through samples from Copenhagens Museum of Mineralogy looking for a zirconium-like element and soon found it. The element, which they named ": null
    },
    {
        "hafnium": "Hafnium"
    },
    {
        "  turned out to be more common than gold.     In 1922, Bohr was awarded the ": null
    },
    {
        "Nobel Prize in Physics": "Nobel Prize In Physics"
    },
    {
        " for his services in the investigation of the structure of atoms and of the radiation emanating from them . The award thus recognised both the Trilogy and his early leading work in the emerging field of quantum mechanics. For his Nobel lecture, Bohr gave his audience a comprehensive survey of what was then known about the structure of the atom, including the ": null
    },
    {
        "correspondence principle": "Correspondence Principle"
    },
    {
        ", which he had formulated. This states that the behaviour of systems described by quantum theory reproduces ": null
    },
    {
        "classical physics": "Classical Physics"
    },
    {
        " in the limit of large ": null
    },
    {
        "quantum number": "Quantum Number"
    },
    {
        "s.     The discovery of ": null
    },
    {
        "Compton scattering": "Compton Scattering"
    },
    {
        " by ": null
    },
    {
        "Arthur Holly Compton": "Arthur Holly Compton"
    },
    {
        " in 1923 convinced most physicists that light was composed of ": null
    },
    {
        "photon": "Photon"
    },
    {
        "s, and that energy and momentum were conserved in collisions between electrons and photons. In 1924, Bohr, Kramers and ": null
    },
    {
        "John C. Slater": "John C. Slater"
    },
    {
        ", an American physicist working at the Institute in Copenhagen, proposed the ": null
    },
    {
        "Bohr–Kramers–Slater theory": "Bohr–Kramers–Slater Theory"
    },
    {
        " . It was more a programme than a full physical theory, as the ideas it developed were not worked out quantitatively. BKS theory became the final attempt at understanding the interaction of matter and electromagnetic radiation on the basis of the old quantum theory, in which quantum phenomena were treated by imposing quantum restrictions on a classical wave description of the electromagnetic field.       Modelling atomic behaviour under incident electromagnetic radiation using virtual oscillators at the absorption and emission frequencies, rather than the apparent frequencies of the Bohr orbits, led Max Born, ": null
    },
    {
        "Werner Heisenberg": "Werner Heisenberg"
    },
    {
        " and Kramers to explore different mathematical models. They led to the development of ": null
    },
    {
        "matrix mechanics": "Matrix Mechanics"
    },
    {
        ", the first form of modern ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        ". The BKS theory also generated discussion of, and renewed attention to, difficulties in the foundations of the old quantum theory. The most provocative element of BKS – that momentum and energy would not necessarily be conserved in each interaction, but only statistically – was soon shown to be in conflict with experiments conducted by ": null
    },
    {
        "Walther Bothe": "Walther Bothe"
    },
    {
        " and ": null
    },
    {
        "Hans Geiger": "Hans Geiger"
    },
    {
        ". In light of these results, Bohr informed Darwin that there is nothing else to do than to give our revolutionary efforts as honourable a funeral as possible .       The introduction of ": null
    },
    {
        "spin": "Spin"
    },
    {
        " by ": null
    },
    {
        "George Uhlenbeck": "George Uhlenbeck"
    },
    {
        " and ": null
    },
    {
        "Samuel Goudsmit": "Samuel Goudsmit"
    },
    {
        " in November 1925 was a milestone. The next month, Bohr travelled to ": null
    },
    {
        "Leiden": "Leiden"
    },
    {
        " to attend celebrations of the 50th anniversary of Hendrick Lorentz receiving his doctorate. When his train stopped in ": null
    },
    {
        "Hamburg": "Hamburg"
    },
    {
        ", he was met by Wolfgang Pauli and ": null
    },
    {
        "Otto Stern": "Otto Stern"
    },
    {
        ", who asked for his opinion of the spin theory. Bohr pointed out that he had concerns about the interaction between electrons and magnetic fields. When he arrived in Leiden, ": null
    },
    {
        "Paul Ehrenfest": "Paul Ehrenfest"
    },
    {
        " and Albert Einstein informed Bohr that Einstein had resolved this problem using ": null
    },
    {
        "relativity": "Theory Of Relativity"
    },
    {
        ". Bohr then had Uhlenbeck and Goudsmit incorporate this into their paper. Thus, when he met Werner Heisenberg and ": null
    },
    {
        "Pascual Jordan": "Pascual Jordan"
    },
    {
        " in ": null
    },
    {
        "Göttingen": "Göttingen"
    },
    {
        " on the way back, he had become, in his own words, a prophet of the electron magnet gospel .          Heisenberg first came to Copenhagen in 1924, then returned to Göttingen in June 1925, shortly thereafter developing the mathematical foundations of quantum mechanics. When he showed his results to Max Born in Göttingen, Born realised that they could best be expressed using ": null
    },
    {
        "matrices": "Matrix"
    },
    {
        ". This work attracted the attention of the British physicist ": null
    },
    {
        "Paul Dirac": "Paul Dirac"
    },
    {
        ", who came to Copenhagen for six months in September 1926. Austrian physicist ": null
    },
    {
        "Erwin Schrödinger": "Erwin Schrödinger"
    },
    {
        " also visited in 1926. His attempt at explaining quantum physics in classical terms using wave mechanics impressed Bohr, who believed it contributed so much to mathematical clarity and simplicity that it represents a gigantic advance over all previous forms of quantum mechanics .     When Kramers left the Institute in 1926 to take up a chair as professor of theoretical physics at the ": null
    },
    {
        "Utrecht University": "Utrecht University"
    },
    {
        ", Bohr arranged for Heisenberg to return and take Kramerss place as a  lektor  at the University of Copenhagen. Heisenberg worked in Copenhagen as a university lecturer and assistant to Bohr from 1926 to 1927.     Bohr became convinced that light behaved like both waves and particles, and in 1927, experiments confirmed the ": null
    },
    {
        "de Broglie hypothesis": "De Broglie Hypothesis"
    },
    {
        " that matter also behaved like waves. He conceived the philosophical principle of ": null
    },
    {
        "complementarity": "Complementarity"
    },
    {
        " He felt that it was not fully understood by professional philosophers.     In Copenhagen in 1927 Heisenberg developed his ": null
    },
    {
        "uncertainty principle": "Uncertainty Principle"
    },
    {
        ", which Bohr embraced. In a paper he presented at the ": null
    },
    {
        "Volta Conference": "Volta Conference"
    },
    {
        " at ": null
    },
    {
        "Como": "Como"
    },
    {
        " in September 1927, he demonstrated that the uncertainty principle could be derived from classical arguments, without quantum terminology or matrices. Einstein preferred the determinism of classical physics over the probabilistic new quantum physics to which he himself had contributed. Philosophical issues that arose from the novel aspects of quantum mechanics became widely celebrated subjects of discussion. Einstein and Bohr had ": null
    },
    {
        "good-natured arguments": "Bohr–Einstein Debates"
    },
    {
        " over such issues throughout their lives.     In 1914, ": null
    },
    {
        "Carl Jacobsen": "Carl Jacobsen"
    },
    {
        ", the heir to ": null
    },
    {
        "Carlsberg breweries": "Carlsberg Group"
    },
    {
        ", bequeathed his mansion to be used for life by the Dane who had made the most prominent contribution to science, literature or the arts, as an honorary residence . Harald Høffding had been the first occupant, and upon his death in July 1931, the Royal Danish Academy of Sciences and Letters gave Bohr occupancy. He and his family moved there in 1932. He was elected president of the Academy on 17 March 1939.     By 1929, the phenomenon of ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        " prompted Bohr to again suggest that the ": null
    },
    {
        "law of conservation of energy": "Law Of Conservation Of Energy"
    },
    {
        " be abandoned, but ": null
    },
    {
        "Enrico Fermis": "Enrico Fermi"
    },
    {
        "hypothetical ": null
    },
    {
        "neutrino": "Neutrino"
    },
    {
        " and the subsequent 1932 discovery of the ": null
    },
    {
        "neutron": "Neutron"
    },
    {
        " provided another explanation. This prompted Bohr to create a new theory of the ": null
    },
    {
        "compound nucleus": "Compound Nucleus"
    },
    {
        " in 1936, which explained how neutrons could be captured by the nucleus. In this model, the nucleus could be deformed like a drop of liquid. He worked on this with a new collaborator, the Danish physicist Fritz Kalckar, who died suddenly in 1938.      The discovery of ": null
    },
    {
        "nuclear fission": "Nuclear Fission"
    },
    {
        " by ": null
    },
    {
        "Otto Hahn": "Otto Hahn"
    },
    {
        " in December 1938  generated intense interest among physicists. Bohr brought the news to the United States where he opened the Fifth Washington Conference on Theoretical Physics with Fermi on 26 January 1939. When Bohr told ": null
    },
    {
        "George Placzek": "George Placzek"
    },
    {
        " that this resolved all the mysteries of ": null
    },
    {
        "transuranic elements": "Transuranic Elements"
    },
    {
        ", Placzek told him that one remained: the neutron capture energies of uranium did not match those of its decay. Bohr thought about it for a few minutes and then announced to Placzek, ": null
    },
    {
        "Léon Rosenfeld": "Léon Rosenfeld"
    },
    {
        " and ": null
    },
    {
        "John Wheeler": "John Archibald Wheeler"
    },
    {
        " that I have understood everything.  Based on his ": null
    },
    {
        "liquid drop model": "Liquid Drop Model"
    },
    {
        " of the nucleus, Bohr concluded that it was the ": null
    },
    {
        "uranium-235": "Uranium-235"
    },
    {
        " isotope and not the more abundant ": null
    },
    {
        "uranium-238": "Uranium-238"
    },
    {
        " that was primarily responsible for fission with thermal neutrons. In April 1940, ": null
    },
    {
        "John R. Dunning": "John R. Dunning"
    },
    {
        " demonstrated that Bohr was correct. In the meantime, Bohr and Wheeler developed a theoretical treatment which they published in a September 1939 paper on The Mechanism of Nuclear Fission .        Bohr read the 19th-century Danish ": null
    },
    {
        "Christian existentialist": "Christian Existentialist"
    },
    {
        " philosopher, ": null
    },
    {
        "Søren Kierkegaard": "Søren Kierkegaard"
    },
    {
        ". ": null
    },
    {
        "Richard Rhodes": "Richard Rhodes"
    },
    {
        " argued in  The Making of the Atomic Bomb  that Bohr was influenced by Kierkegaard through Høffding. In 1909, Bohr sent his brother Kierkegaards  Stages on Lifes Way  as a birthday gift. In the enclosed letter, Bohr wrote, It is the only thing I have to send home; but I do not believe that it would be very easy to find anything better  ... I even think it is one of the most delightful things I have ever read. Bohr enjoyed Kierkegaards language and literary style, but mentioned that he had some disagreement with ": null
    },
    {
        "Kierkegaards philosophy": "Philosophy Of Søren Kierkegaard"
    },
    {
        ". Some of Bohrs biographers suggested that this disagreement stemmed from Kierkegaards advocacy of Christianity, while Bohr was an ": null
    },
    {
        "atheist": "Atheist"
    },
    {
        ". ": null
    },
    {
        "David Favrholdt": "David Favrholdt"
    },
    {
        " argued that Kierkegaard had minimal influence over Bohrs work, taking Bohrs statement about disagreeing with Kierkegaard at face value, while Jan Faye argued that one can disagree with the content of a theory while accepting its general premises and structure.       The rise of ": null
    },
    {
        "Nazism": "Nazism"
    },
    {
        " in Germany prompted many scholars to flee their countries, either because they were Jewish or because they were political opponents of the Nazi regime. In 1933, the ": null
    },
    {
        "Rockefeller Foundation": "Rockefeller Foundation"
    },
    {
        " created a fund to help support refugee academics, and Bohr discussed this programme with the President of the Rockefeller Foundation, ": null
    },
    {
        "Max Mason": "Max Mason"
    },
    {
        ", in May 1933 during a visit to the United States. Bohr offered the refugees temporary jobs at the Institute, provided them with financial support, arranged for them to be awarded fellowships from the Rockefeller Foundation, and ultimately found them places at institutions around the world. Those that he helped included ": null
    },
    {
        "Guido Beck": "Guido Beck"
    },
    {
        ", ": null
    },
    {
        "Felix Bloch": "Felix Bloch"
    },
    {
        ", ": null
    },
    {
        "James Franck": "James Franck"
    },
    {
        ", George de Hevesy, ": null
    },
    {
        "Otto Frisch": "Otto Frisch"
    },
    {
        ", ": null
    },
    {
        "Hilde Levi": "Hilde Levi"
    },
    {
        ", ": null
    },
    {
        "Lise Meitner": "Lise Meitner"
    },
    {
        ", George Placzek, ": null
    },
    {
        "Eugene Rabinowitch": "Eugene Rabinowitch"
    },
    {
        ", ": null
    },
    {
        "Stefan Rozental": "Stefan Rozental"
    },
    {
        ", Erich Ernst Schneider, ": null
    },
    {
        "Edward Teller": "Edward Teller"
    },
    {
        ", ": null
    },
    {
        "Arthur von Hippel": "Arthur R. Von Hippel"
    },
    {
        " and ": null
    },
    {
        "Victor Weisskopf": "Victor Weisskopf"
    },
    {
        ".     In April 1940, early in the Second World War, ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        " invaded and occupied Denmark": "Occupation Of Denmark"
    },
    {
        ". To prevent the Germans from discovering ": null
    },
    {
        "Max von Laues": "Max Von Laue"
    },
    {
        "and James Francks gold Nobel medals, Bohr had de Hevesy dissolve them in ": null
    },
    {
        "aqua regia": "Aqua Regia"
    },
    {
        ". In this form, they were stored on a shelf at the Institute until after the war, when the gold was precipitated and the medals re-struck by the Nobel Foundation. Bohrs own medal had been donated to an auction to the Fund for Finnish Relief, and was auctioned off in March 1940, along with the medal of ": null
    },
    {
        "August Krogh": "August Krogh"
    },
    {
        ". The buyer later donated the two medals to the Danish Historical Museum in ": null
    },
    {
        "Frederiksborg Castle": "Frederiksborg Castle"
    },
    {
        ", where they are still kept.      Bohr kept the Institute running, but all the foreign scholars departed.          Bohr was aware of the possibility of using uranium-235 to construct an ": null
    },
    {
        "atomic bomb": "Atomic Bomb"
    },
    {
        ", referring to it in lectures in Britain and Denmark shortly before and after the war started, but he did not believe that it was technically feasible to extract a sufficient quantity of uranium-235. In September 1941, Heisenberg, who had become head of the ": null
    },
    {
        "German nuclear energy project": "German Nuclear Energy Project"
    },
    {
        ", visited Bohr in Copenhagen. During this meeting the two men took a private moment outside, the content of which has caused much speculation, as both gave differing accounts.   According to Heisenberg, he began to address nuclear energy, morality and the war, to which Bohr seems to have reacted by terminating the conversation abruptly while not giving Heisenberg hints about his own opinions. ": null
    },
    {
        "Ivan Supek": "Ivan Supek"
    },
    {
        ", one of Heisenbergs students and friends, claimed that the main subject of the meeting was ": null
    },
    {
        "Carl Friedrich von Weizsäcker": "Carl Friedrich Von Weizsäcker"
    },
    {
        ", who had proposed trying to persuade Bohr to mediate peace between Britain and Germany.  An interview with Ivan Supek relating to the 1941 Bohr  – Heisenberg meeting.     In 1957, Heisenberg wrote to ": null
    },
    {
        "Robert Jungk": "Robert Jungk"
    },
    {
        ", who was then working on the book  Brighter than a Thousand Suns: A Personal History of the Atomic Scientists . Heisenberg explained that he had visited Copenhagen to communicate to Bohr the views of several German scientists, that production of a nuclear weapon was possible with great efforts, and this raised enormous responsibilities on the worlds scientists on both sides.  When Bohr saw Jungks depiction in the Danish translation of the book, he drafted a letter to Heisenberg, stating that he never understood the purpose of Heisenbergs visit, was shocked by Heisenbergs opinion that Germany would win the war, and that atomic weapons could be decisive.      ": null
    },
    {
        "Michael Frayns": "Michael Frayn"
    },
    {
        "1998 play  Copenhagen  explores what might have happened at the 1941 meeting between Heisenberg and Bohr.  A ": null
    },
    {
        "BBC": "Bbc"
    },
    {
        " television film version": "Copenhagen"
    },
    {
        " of the play was first screened on 26 September 2002, with ": null
    },
    {
        "Stephen Rea": "Stephen Rea"
    },
    {
        " as Bohr, and ": null
    },
    {
        "Daniel Craig": "Daniel Craig"
    },
    {
        " as Heisenberg. The same meeting had previously been dramatised by the BBCs  Horizon  science documentary series in 1992, with ": null
    },
    {
        "Anthony Bate": "Anthony Bate"
    },
    {
        " as Bohr, and Philip Anthony as Heisenberg. Horizon: Hitlers Bomb, ": null
    },
    {
        "BBC Two": "Bbc Two"
    },
    {
        ", 24 February 1992 The meeting is also dramatized in the Norwegian/Danish/British miniseries  The Heavy Water War .        In September 1943, word reached Bohr and his brother Harald that the Nazis considered their family to be Jewish, since their mother was Jewish, and that they were therefore in danger of being arrested. The Danish resistance helped Bohr and his wife escape by sea to Sweden on 29 September. The next day, Bohr persuaded King ": null
    },
    {
        "Gustaf V of Sweden": "Gustaf V Of Sweden"
    },
    {
        " to make public Swedens willingness to provide asylum to Jewish refugees. On 2 October 1943, Swedish radio broadcast that Sweden was ready to offer asylum, and the mass ": null
    },
    {
        "rescue of the Danish Jews": "Rescue Of The Danish Jews"
    },
    {
        " by their countrymen followed swiftly thereafter. Some historians claim that Bohrs actions led directly to the mass rescue, while others say that, though Bohr did all that he could for his countrymen, his actions were not a decisive influence on the wider events. Eventually, over 7,000 Danish Jews escaped to Sweden.        When the news of Bohrs escape reached Britain, ": null
    },
    {
        "Lord Cherwell": "Lord Cherwell"
    },
    {
        " sent a telegram to Bohr asking him to come to Britain. Bohr arrived in Scotland on 6 October in a ": null
    },
    {
        "de Havilland Mosquito": "De Havilland Mosquito"
    },
    {
        " operated by the ": null
    },
    {
        "British Overseas Airways Corporation": "British Overseas Airways Corporation"
    },
    {
        " . The Mosquitos were unarmed high-speed bomber aircraft that had been converted to carry small, valuable cargoes or important passengers. By flying at high speed and high altitude, they could cross German-occupied Norway, and yet avoid German fighters. Bohr, equipped with parachute, flying suit and oxygen mask, spent the three-hour flight lying on a mattress in the aircrafts ": null
    },
    {
        "bomb bay": "Bomb Bay"
    },
    {
        ". During the flight, Bohr did not wear his flying helmet as it was too small, and consequently did not hear the pilots intercom instruction to turn on his oxygen supply when the aircraft climbed to high altitude to overfly Norway. He passed out from oxygen starvation and only revived when the aircraft descended to lower altitude over the North Sea. Bohrs son Aage followed his father to Britain on another flight a week later, and became his personal assistant.     Bohr was warmly received by ": null
    },
    {
        "James Chadwick": "James Chadwick"
    },
    {
        " and Sir ": null
    },
    {
        "John Anderson": "John Anderson, 1St Viscount Waverley"
    },
    {
        ", but for security reasons Bohr was kept out of sight. He was given an apartment at ": null
    },
    {
        "St Jamess Palace": "St Jamess Palace"
    },
    {
        " and an office with the British ": null
    },
    {
        "Tube Alloys": "Tube Alloys"
    },
    {
        " nuclear weapons development team. Bohr was astonished at the amount of progress that had been made. Chadwick arranged for Bohr to visit the United States as a Tube Alloys consultant, with Aage as his assistant. On 8 December 1943, Bohr arrived in ": null
    },
    {
        "Washington, D.C.": "Washington, D.C."
    },
    {
        ", where he met with the director of the ": null
    },
    {
        "Manhattan Project": "Manhattan Project"
    },
    {
        ", Brigadier General ": null
    },
    {
        "Leslie R. Groves, Jr.": "Leslie R. Groves, Jr."
    },
    {
        " He visited Einstein and Pauli at the ": null
    },
    {
        "Institute for Advanced Study": "Institute For Advanced Study"
    },
    {
        " in ": null
    },
    {
        "Princeton, New Jersey": "Princeton, New Jersey"
    },
    {
        ", and went to ": null
    },
    {
        "Los Alamos": "Los Alamos National Laboratory"
    },
    {
        " in ": null
    },
    {
        "New Mexico": "New Mexico"
    },
    {
        ", where the nuclear weapons were being designed. For security reasons, he went under the name of Nicholas Baker in the United States, while Aage became James Baker . In May 1944 the Danish resistance newspaper ": null
    },
    {
        "De frie Danske": "De Frie Danske"
    },
    {
        " reported that they had learned that the famous son of Denmark Professor Niels Bohr in October the previous year had fled his country via Sweden to London and from there travelled to ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        " from where he could be assumed to support the war effort.      Bohr did not remain at Los Alamos, but paid a series of extended visits over the course of the next two years. ": null
    },
    {
        "Robert Oppenheimer": "Robert Oppenheimer"
    },
    {
        " credited Bohr with acting as a scientific father figure to the younger men , most notably ": null
    },
    {
        "Richard Feynman": "Richard Feynman"
    },
    {
        ". Bohr is quoted as saying, They didnt need my help in making the atom bomb.  Oppenheimer gave Bohr credit for an important contribution to the work on ": null
    },
    {
        "modulated neutron initiator": "Modulated Neutron Initiator"
    },
    {
        "s. This device remained a stubborn puzzle, Oppenheimer noted, but in early February 1945 Niels Bohr clarified what had to be done.      Bohr recognised early that nuclear weapons would change international relations. In April 1944, he received a letter from ": null
    },
    {
        "Peter Kapitza": "Peter Kapitza"
    },
    {
        ", written some months before when Bohr was in Sweden, inviting him to come to the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ". The letter convinced Bohr that the Soviets were aware of the Anglo-American project, and would strive to catch up. He sent Kapitza a non-committal response, which he showed to the authorities in Britain before posting. Bohr met Churchill on 16 May 1944, but found that we did not speak the same language . Churchill disagreed with the idea of openness towards the Russians to the point that he wrote in a letter: It seems to me Bohr ought to be confined or at any rate made to see that he is very near the edge of mortal crimes.      Oppenheimer suggested that Bohr visit President ": null
    },
    {
        "Franklin D. Roosevelt": "Franklin D. Roosevelt"
    },
    {
        " to convince him that the Manhattan Project should be shared with the Soviets in the hope of speeding up its results. Bohrs friend, Supreme Court Justice ": null
    },
    {
        "Felix Frankfurter": "Felix Frankfurter"
    },
    {
        ", informed President Roosevelt about Bohrs opinions, and a meeting between them took place on 26 August 1944. Roosevelt suggested that Bohr return to the United Kingdom to try to win British approval. When Churchill and Roosevelt met at Hyde Park on 19 September 1944, they rejected the idea of informing the world about the project, and the aide-mémoire of their conversation contained a rider that enquiries should be made regarding the activities of Professor Bohr and steps taken to ensure that he is responsible for no leakage of information, particularly to the Russians .     In June 1950, Bohr addressed an Open Letter to the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " calling for international cooperation on nuclear energy.  •   In the 1950s, after the ": null
    },
    {
        "Soviet Unions first nuclear weapon test": "Rds-1"
    },
    {
        ", the ": null
    },
    {
        "International Atomic Energy Agency": "International Atomic Energy Agency"
    },
    {
        " was created along the lines of Bohrs suggestion. In 1957 he received the first ever ": null
    },
    {
        "Atoms for Peace Award": "Atoms For Peace Award"
    },
    {
        ".           With the war now ended, Bohr returned to Copenhagen on 25 August 1945, and was re-elected President of the Royal Danish Academy of Arts and Sciences on 21 September. At a memorial meeting of the Academy on 17 October 1947 for King ": null
    },
    {
        "Christian X": "Christian X Of Denmark"
    },
    {
        ", who had died in April, the new king, ": null
    },
    {
        "Frederick IX": "Frederick Ix Of Denmark"
    },
    {
        ", announced that he was conferring the ": null
    },
    {
        "Order of the Elephant": "Order Of The Elephant"
    },
    {
        " on Bohr. This award was normally awarded only to royalty and heads of state, but the king said that it honoured not just Bohr personally, but Danish science. Bohr designed his own ": null
    },
    {
        "coat of arms": "Coat Of Arms"
    },
    {
        " which featured a ": null
    },
    {
        "taijitu": "Taijitu"
    },
    {
        " and a motto in , opposites are complementary .       The Second World War demonstrated that science, and physics in particular, now required considerable financial and material resources. To avoid a ": null
    },
    {
        "brain drain": "Brain Drain"
    },
    {
        " to the United States, twelve European countries banded together to create ": null
    },
    {
        "CERN": "Cern"
    },
    {
        ", a research organisation along the lines of the national laboratories in the United States, designed to undertake ": null
    },
    {
        "Big Science": "Big Science"
    },
    {
        " projects beyond the resources of any one of them alone. Questions soon arose regarding the best location for the facilities. Bohr and Kramers felt that the Institute in Copenhagen would be the ideal site. ": null
    },
    {
        "Pierre Auger": "Pierre Victor Auger"
    },
    {
        ", who organised the preliminary discussions, disagreed; he felt that both Bohr and his Institute were past their prime, and that Bohrs presence would overshadow others. After a long debate, Bohr pledged his support to CERN in February 1952, and ": null
    },
    {
        "Geneva": "Geneva"
    },
    {
        " was chosen as the site in October. The CERN Theory Group was based in Copenhagen until their new accommodation in Geneva was ready in 1957. Victor Weisskopf, who later became the ": null
    },
    {
        "Director General of CERN": "List Of Directors General Of Cern"
    },
    {
        ", summed up Bohrs role, saying that there were other personalities who started and conceived the idea of ": null
    },
    {
        "CERN": "Cern"
    },
    {
        ". The enthusiasm and ideas of the other people would not have been enough, however, if a man of his stature had not supported it.       Meanwhile, Scandinavian countries formed the ": null
    },
    {
        "Nordic Institute for Theoretical Physics": "Nordic Institute For Theoretical Physics"
    },
    {
        " in 1957, with Bohr as its chairman. He was also involved with the founding of the ": null
    },
    {
        "Research Establishment Risø of the Danish Atomic Energy Commission": "Risø Dtu National Laboratory For Sustainable Energy"
    },
    {
        ", and served as its first chairman from February 1956.     Bohr died of heart failure at his home in ": null
    },
    {
        "Carlsberg": "Carlsberg"
    },
    {
        " on 18 November 1962.  He was cremated, and his ashes were buried in the family plot in the ": null
    },
    {
        "Assistens Cemetery": "Assistens Cemetery"
    },
    {
        " in the ": null
    },
    {
        "Nørrebro": "Nørrebro"
    },
    {
        " section of Copenhagen, along with those of his parents, his brother Harald, and his son Christian. Years later, his wifes ashes were also interred there. On 7 October 1965, on what would have been his 80th birthday, the Institute for Theoretical Physics at the University of Copenhagen was officially renamed to what it had been called unofficially for many years: the Niels Bohr Institute.            Bohr received numerous honours and accolades. In addition to the Nobel Prize, he received the ": null
    },
    {
        "Hughes Medal": "Hughes Medal"
    },
    {
        " in 1921, the ": null
    },
    {
        "Matteucci Medal": "Matteucci Medal"
    },
    {
        " in 1923, the ": null
    },
    {
        "Franklin Medal": "Franklin Medal"
    },
    {
        " in 1926,  the ": null
    },
    {
        "Copley Medal": "Copley Medal"
    },
    {
        " in 1938, the Order of the Elephant in 1947, the Atoms for Peace Award in 1957 and the ": null
    },
    {
        "Sonning Prize": "Sonning Prize"
    },
    {
        " in 1961. He became foreign member of the ": null
    },
    {
        "Royal Netherlands Academy of Arts and Sciences": "Royal Netherlands Academy Of Arts And Sciences"
    },
    {
        " in 1923,  and of the ": null
    },
    {
        "Royal Society": "Royal Society"
    },
    {
        " in 1926.  The Bohr models semicentennial was commemorated in Denmark on 21 November 1963 with a ": null
    },
    {
        "postage stamp": "Commemorative Stamp"
    },
    {
        " depicting Bohr, the hydrogen atom and the formula for the difference of any two hydrogen energy levels: h    -   . Several other countries have also issued postage stamps depicting Bohr. In 1997, the ": null
    },
    {
        "Danish National Bank": "Danish National Bank"
    },
    {
        " began circulating the ": null
    },
    {
        "500-krone banknote": "Banknotes Of Denmark, 1997 Series"
    },
    {
        " with the portrait of Bohr smoking a pipe.  An asteroid, ": null
    },
    {
        "3948 Bohr": "3948 Bohr"
    },
    {
        ", was named after him,  as was the ": null
    },
    {
        "Bohr lunar crater": "Bohr"
    },
    {
        " and ": null
    },
    {
        "bohrium": "Bohrium"
    },
    {
        ", the chemical element with atomic number 107.                           ": null
    }
]