[
    {
        "     Obelix  is a cartoon character and ": null
    },
    {
        "protagonist": "Protagonist"
    },
    {
        " in the French comic book series ": null
    },
    {
        "Asterix": "Asterix"
    },
    {
        ". He works as a ": null
    },
    {
        "menhir": "Menhir"
    },
    {
        " sculptor and deliveryman, and is ": null
    },
    {
        "Asterixs": "Asterix"
    },
    {
        "best friend. Obelix is noted for his fatness, the ": null
    },
    {
        "menhirs": "Menhir"
    },
    {
        "he carries around on his back and his superhuman strength. He fell into a cauldron of the Gauls magic potion when he was a baby, causing him to be the only Gaul in Asterixs village who is in a permanent state of superhuman strength. Because of this already enormous strength, Obelix is not allowed to drink the magic potion ever again, a ban he regards as being tremendously unfair. Other characteristics are his simplemindedness, his love and care for his dog ": null
    },
    {
        "Dogmatix": "Dogmatix"
    },
    {
        ", his anger when someone refers to him as being  fat , his enthusiasm for hunting and eating ": null
    },
    {
        "wild boar": "Wild Boar"
    },
    {
        "s, and beating up Romans. His catchphrase is:  Ils sont fous ces romains , which translates into These Romans are crazy! , although he considers nearly every other nationality to be just as strange.     The character was portrayed by actor ": null
    },
    {
        "Gérard Depardieu": "Gérard Depardieu"
    },
    {
        " in every Asterix live-action movie.       He is a large man who does not see himself as fat, preferring to call himself well covered or having a chest that has slipped a bit . From  Asterix and the Banquet  onwards—previously he had simply expressed ignorance of being fat, such as when he merely commented that he wished he had known he was too fat to pose as a lion in  Asterix the Gladiator —Obelix is so in denial over this matter that he usually does not even notice when other people refer to him as that fat one , and often shows total confusion over which fat person people are referring to. When he does understand the allusions are made on his behalf, he flies into a rage and starts beating up the person who said it. Sometimes, when he is in a bad mood, just hearing the word fat —even if it is not in reference to him—can quickly enrage him. Being called fat, or being hinted as being fat, is one of the main causes of conflicts between Asterix and Obelix which leads to more developing conflicts in which they must work together, once escalating to the point that Obelix actually gave Asterix ": null
    },
    {
        "amnesia": "Amnesia"
    },
    {
        " when he hit him too hard during an argument . Although they usually simply insult each other verbally they inevitably make up swiftly. Sometimes, Obelix can be so paranoid over the allusion of the word Fat that he can even break the ": null
    },
    {
        "fourth wall": "Fourth Wall"
    },
    {
        " with the mere mention of this. Visibly in  Asterix and the Black Gold , when the narrator points out that their vessel was pulled like a Big and fat fish , Obelix became clearly offended and yelled WHO IS FAT!? .         Obelix is Asterixs closest friend . He generally works as a menhir delivery man. His passions in life are hanging around with Asterix, hunting and eating wild boar, making and carrying his menhirs, and beating up Roman ": null
    },
    {
        "legionnaries": "Roman Legionary"
    },
    {
        " . Obelix has a little dog named ": null
    },
    {
        "Dogmatix": "Dogmatix"
    },
    {
        " , whom he adores. His ": null
    },
    {
        "parents": "Recurring Characters In Asterixgauls"
    },
    {
        " live now in ": null
    },
    {
        "Condate": "Rennes"
    },
    {
        "  and his distant cousin Metallurgix, a golden sickle maker, lives in ": null
    },
    {
        "Lutetia": "Lutetia"
    },
    {
        " .     Obelixs favourite food is roast wild ": null
    },
    {
        "boar": "Boar"
    },
    {
        " which he usually hunts with Asterix, but he has a voracious appetite, and will try eating nearly anything with few exceptions; in  Asterix and Obelix All at Sea  and  Asterix in Britain  he seems to not like boiled boar. In fact, he eats nuts and oysters in the shell, and is completely oblivious to drugs, spicy food and poison, possibly due to the permanent effects of the magic potion. However, when he consumes ": null
    },
    {
        "alcohol": "Ethanol"
    },
    {
        ", he gets very drunk very quickly, as seen for example in  Asterix in Britain  where he enjoys sampling different barrels of ": null
    },
    {
        "wine": "Wine"
    },
    {
        " trying to find a barrel containing magic potion, or in  Asterix and the Laurel Wreath , where both he and chief ": null
    },
    {
        "Vitalstatistix": "Recurring Characters In Asterixvitalstatistix"
    },
    {
        " get drunk during a banquet, much to shame of the latters wife Impedimenta. Although he has his own house, Obelix is occasionally shown staying overnight at Asterixs.     Obelix owns the quarry where he chisels the menhirs himself. It is never directly stated what the menhirs are used for, though it is hinted that they are just oversized knick-knacks; however they are probably a running-gag regarding the origins of the mystery surrounding Menhirs in ancient Europe, with the joke being that Obelix delivered them. Obelix usually trades the stones away for whatever he needs, resulting in the village having a literal field of menhirs.     Obelix is kind-hearted, but ": null
    },
    {
        "socially inept": "Socially Inept"
    },
    {
        "—possibly because his strength means that others have had to adapt to him instead of vice versa. He is still not completely aware of his own strength and almost invariably breaks any door he gently knocks on. He is frequently used as a human battering ram for opening locked doors or breaking through walls. Similarly, he is unaware that others do not share his superhuman strength, and shows great surprise when others are crushed by what he calls  a little menhir , or when Asterix attempts to explain to him that a small dog like Dogmatix cannot lift a menhir. He also has little interest in subjects of formal education or intellectual pursuits, since sheer strength usually solves his problems; he generally leaves any decisions to Asterix. However, Obelix is not completely stupid. In  Asterix and the Normans  he deduces from various clues that Cacofonix the bard has gone to Lutetia to pursue a career in popular music: this unusual display of intelligence on Obelixs part surprises Getafix. He also surprises Asterix in  Asterix and the Black Gold  by reeling off a dictionary definition of wild boar in conversation . He can also be quite dangerous when angered.     While cheerfully violent and enjoying a good fight, Obelix is far from brutal or sadistic: he tends to view fighting as a game and is generally friendly and polite towards his opponents. He extends this benevolence even towards the Romans, whom he rarely seems to view as oppressors but more as less-willing participants in his rough-housing. His other favored pastimes are dancing , and occasionally drinking goats milk to excess .     Like Asterix, Obelix is a bachelor, but he is easily smitten by a pretty face. He harbours a hopeless crush on ": null
    },
    {
        "Panacea": "Recurring Characters In Asterixgauls"
    },
    {
        ", the daughter of Soporifix , and occasionally other young women, most notably ": null
    },
    {
        "Mrs. Geriatrix": "Recurring Characters In Asterixmrs. Geriatrix"
    },
    {
        " . However, one may think that he will eventually find a mate and have children since in  Asterix and the Class Act , he is shown to be the founder of a long dynasty of French warriors that lasted well into the 20th century. Obelixs Family Tree in  Asterix and the Class Act      Obelixs trademark phrase is These Romans are crazy , although he has applied a variant of it to nearly every group hes met in his travels: These Britons are crazy , These Corsicans are crazy , etc. This remark is followed by him tapping his forehead. It is a parody of the quote These Gauls are crazy , which ": null
    },
    {
        "Julius Caesar": "Julius Caesar"
    },
    {
        " famously said while describing the Gauls fighting style during his conquest of the region.         Unlike the other villagers, Obelix has no need to drink the ": null
    },
    {
        "druid": "Druid"
    },
    {
        "Getafixs": "Recurring Characters In Asterixgetafix"
    },
    {
        "magic potion that gives superhuman strength, because he fell into the cauldron as a baby and its effect on him became permanent. Obelix is tall and massive. He is about  tall and he weighs more than . The story of that incident is told in  How Obelix Fell into the Magic Potion When he was a Little Boy . Since this effect was not intended or expected, Getafix refuses to allow him even one more drop except under the direst circumstances , which annoys Obelix greatly. . However, in  Asterix and Cleopatra , Getafix gives him a few drops to open a door in the ": null
    },
    {
        "Great Pyramids": "Great Pyramid Of Giza"
    },
    {
        "Labyrinth but he comments that he does not see much difference between before and after the potion though this is presumably because Obelix is used to accomplishing any physical task with ease.     Although it has been clearly stated by both Getafix  and Asterix  that the magic potion does NOT grant invulnerability , meaning that they could be injured by the Romans in their fights but their raw strength generally prevents the Romans getting the chance to do so, the same does not seem to be true of Obelix. He does not even notice when attackers attempt to knock him unconscious with blows to the head, when Roman spearheads are stuck in his bottom in  Asterix in Corsica  or when anyone else attempts to harm him in any way. This may imply that Obelix, either by stupidity or ignorance, simply does not notice or react to the pain that should be inflicted, or that the potion has enhanced his overall strength, since it has been shown to increase the drinkers endurance allowing them to run faster, to such a point where his muscles allow him to effortlessly absorb the attacks in question. Most of the occasions where Obelix demonstrates invulnerability include him being attacked physically rather than with sharp objects, as in ": null
    },
    {
        "Asterix and the Magic Carpet": "Asterix And The Magic Carpet"
    },
    {
        ", when an arrow accidentally hits his bottom and he yells in agony, and thus showing that Obelix isnt above physical pain.     Obelix does sometimes display twisted views, especially when it comes to the relationship between the Gauls and the Romans. As far as he is concerned the more Romans he can beat up the better and nobody should deny him this, not even the selfish Roman victims themselves:     In  Asterix in Britain , he dismisses the claim that the Romans have invaded ": null
    },
    {
        "Britain": "Caesars Invasions Of Britain"
    },
    {
        "; he believes that the Britons dragged the Romans over there in order to have all the fun for themselves. During a ": null
    },
    {
        "rugby": "Rugby Football"
    },
    {
        " match, Obelix is bored until he sees how violent the game can get, and is overjoyed, recommending that they play rugby in Gaul.   In  Asterix in Corsica , it is revealed that the villagers attack the Romans at least once a year in order to celebrate the Gaulish victory at ": null
    },
    {
        "Gergovia": "Gergovia"
    },
    {
        ". When the Romans leave their camps in order to avoid the attacks, Obelix sees this behaviour as crazy and detrimental to their friendly relationship.   In  Asterix and Obelix All at Sea , he has a dream in which the Romans pull out of Gaul. Hes horrified at the idea of such a dream coming true. He also declares that the idea of peace with the Romans is offensive to the memory of ": null
    },
    {
        "Vercingetorix": "Vercingetorix"
    },
    {
        ". Far more likely is the fact that peace will mean that he will not be able to bash the Romans anymore, a prospect he dreads. He then comments on the good sense of the Romans in attacking the village .   The ": null
    },
    {
        "Roman civil war": "Caesars Civil War"
    },
    {
        " between ": null
    },
    {
        "Caesar": "Julius Caesar"
    },
    {
        " and ": null
    },
    {
        "Pompey": "Pompey"
    },
    {
        " features in both  Asterix the Legionary  and  Asterix and the Actress . When he witnesses a battle between Roman troops, Obelix murmurs What a waste! . But this is not so much on the wasted lives as the fact that it means that he has fewer Romans to bash himself.       ": null
    },
    {
        "Gérard Depardieu": "Gérard Depardieu"
    },
    {
        " portrays Obelix in ": null
    },
    {
        "all four live-action French films": "Asterix Films"
    },
    {
        " based on various comics. For the animated films, he has been voiced by ": null
    },
    {
        "Jacques Morel": "Jacques Morel"
    },
    {
        " , ": null
    },
    {
        "Pierre Tornade": "Pierre Tornade"
    },
    {
        " , ": null
    },
    {
        "Jacques Frantz": "Jacques Frantz"
    },
    {
        " , and ": null
    },
    {
        "Guillaume Briat": "Guillaume Briat"
    },
    {
        " . In the English dubs of the animated films, he has been voiced by ": null
    },
    {
        "Hal Brav": "Hal Brav"
    },
    {
        ", ": null
    },
    {
        "Michael Kilgarriff": "Michael Kilgarriff"
    },
    {
        ", ": null
    },
    {
        "Billy Kearns": "Billy Kearns"
    },
    {
        ", ": null
    },
    {
        "Bernard Bresslaw": "Bernard Bresslaw"
    },
    {
        ", ": null
    },
    {
        "Rosey Grier": "Rosey Grier"
    },
    {
        ", ": null
    },
    {
        "Howard Lew Lewis": "Howard Lew Lewis"
    },
    {
        ", ": null
    },
    {
        "Brad Garrett": "Brad Garrett"
    },
    {
        ", ": null
    },
    {
        "C. Ernst Harth": "C. Ernst Harth"
    },
    {
        ", and, most recently, ": null
    },
    {
        "Nick Frost": "Nick Frost"
    },
    {
        "  .       Obelixs name is a pun on the French word obélisque , suggested by rotund physique and his habit of casually carrying heavy stone monuments  around with him. In fact obelisk is also a variant of the word ": null
    },
    {
        "obelus": "Dagger"
    },
    {
        " , a typographical mark often found in a companion role to that of the ": null
    },
    {
        "asterisk": "Asterisk"
    }
]