[
    {
        "     The Oberkommando des Heeres  was the High Command  of the ": null
    },
    {
        "German Army": "German Army"
    },
    {
        " during the Era of ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        ". It was founded in 1935 as a part of ": null
    },
    {
        "Adolf Hitlers": "Adolf Hitler"
    },
    {
        " re-militarisation of Germany. From 1938 OKH was, together with ": null
    },
    {
        "OKL": "Oberkommando Der Luftwaffe"
    },
    {
        "  and ": null
    },
    {
        "OKM": "Okm"
    },
    {
        " , formally subordinated to the ": null
    },
    {
        "OKW": "Okw"
    },
    {
        " , with the exception of the ": null
    },
    {
        "Waffen-SS": "Waffen-Ss"
    },
    {
        ". During the war, OKH had the responsibility of strategic planning of Armies and ": null
    },
    {
        "Army Groups": "Army Groups"
    },
    {
        ", while the General Staff of the OKH managed operational matters. Each German Army also had an  Armeeoberkommando , Army Command, or AOK. Until the German defeat at Moscow in December 1941, OKH and its staff was de facto the most important unit within the German war planning. ": null
    },
    {
        "OKW": "Okw"
    },
    {
        " then took over this function for theatres other than the German-Soviet front.   OKH commander held the title Oberbefehlshaber des Heeres . Following the ": null
    },
    {
        "Battle of Moscow": "Battle Of Moscow"
    },
    {
        ", after OKH commander Field Marshal ": null
    },
    {
        "Walther von Brauchitsch": "Walther Von Brauchitsch"
    },
    {
        " was excused, Hitler appointed himself as Commander-in-Chief of the Army.       Hitler had been the head of OKW since January 1938, using it to pass orders to ": null
    },
    {
        "the navy": "Kriegsmarine"
    },
    {
        " , ": null
    },
    {
        "air force": "Luftwaffe"
    },
    {
        " , and ": null
    },
    {
        "army": "German Army"
    },
    {
        " . After a major crisis developed in the ": null
    },
    {
        "Battle of Moscow": "Battle Of Moscow"
    },
    {
        ", Walther von Brauchitsch was dismissed , and Hitler appointed himself as head of the OKH while still retaining his position at the OKW. At the same time, he limited the OKHs authority to the Russian front, giving OKW direct authority over army units elsewhere. This enabled Hitler to declare that only he had complete awareness of Germanys strategic situation, should any general request a transfer of resources between the Russian front and another theater of operations.        In 1944, these elements were subordinate to the OKH:    C.-in-C. ": null
    },
    {
        "Reserve Army": "Replacement Army"
    },
    {
        " and Chief of Equipment ": null
    },
    {
        "Friedrich Fromm": "Friedrich Fromm"
    },
    {
        " Chef des Allgemeines Heeresamt Chef des Heereswaffenamtes ": null
    },
    {
        "hrmac": "Hrmac"
    },
    {
        "Chef des Heerespersonalamtes    ": null
    }
]