[
    {
        "An ode  is a type of ": null
    },
    {
        "lyrical stanza": "Lyric Poetry"
    },
    {
        ". It is an elaborately structured ": null
    },
    {
        "poem": "Poem"
    },
    {
        " praising or glorifying an event or individual, describing nature intellectually as well as emotionally. A classic ode is structured in three major parts: the  strophe , the  antistrophe , and the  epode . Different forms such as the homostrophic ode and the irregular ode also exist.     Greek odes were originally poetic pieces performed with musical accompaniment. As time passed on, they gradually became known as personal lyrical compositions whether sung or merely recited . The primary instruments used were the ": null
    },
    {
        "aulos": "Aulos"
    },
    {
        " and the ": null
    },
    {
        "lyre": "Lyre"
    },
    {
        " .     There are three typical forms of odes: the Pindaric, Horatian, and irregular. Pindaric odes follow the form and style of ": null
    },
    {
        "Pindar": "Pindar"
    },
    {
        ". Horatian odes follow conventions of ": null
    },
    {
        "Horace": "Horace"
    },
    {
        "; the ": null
    },
    {
        "odes of Horace": "Odes"
    },
    {
        " deliberately imitated the Greek lyricists such as ": null
    },
    {
        "Alcaeus": "Alcaeus"
    },
    {
        " and ": null
    },
    {
        "Anacreon": "Anacreon"
    },
    {
        ". Irregular odes use rhyme, but not the three-part form of the Pindaric ode, nor the two- or four-line ": null
    },
    {
        "stanza": "Stanza"
    },
    {
        " of the Horatian ode. The ode is a lyric poem. It conveys exalted and inspired emotions. It is a lyric in an elaborate form, expressed in a language that is imaginative, dignified and sincere. Like the lyric, an ode is of Greek origin.         The lyrics can be on various themes. The earliest odes in the English language, using the word in its strict form, were the Epithalamium and Prothalamium of ": null
    },
    {
        "Edmund Spenser": "Edmund Spenser"
    },
    {
        ".     In the 17th century, the most important original odes in English were by ": null
    },
    {
        "Abraham Cowley": "Abraham Cowley"
    },
    {
        ". These were ": null
    },
    {
        "iambic": "Iamb"
    },
    {
        ", but had irregular line length patterns and rhyme schemes. Cowley based the principle of his ": null
    },
    {
        "Pindariques": "Pindariques"
    },
    {
        " on an apparent misunderstanding of Pindars metrical practice but, nonetheless, others widely imitated his style, with notable success by ": null
    },
    {
        "John Dryden": "John Dryden"
    },
    {
        ".     With Pindars metre being better understood in the 18th century, the fashion for Pindaric odes faded, though there are notable actual Pindaric odes by ": null
    },
    {
        "Thomas Gray": "Thomas Gray"
    },
    {
        ",  and .       There was a time when meadow, grove, and stream,   The earth, and every common sight,   To me did seem   Apparelled in celestial light,   The glory and the freshness of a dream.   It is not now as it hath been of yore;—   Turn wheresoeer I may,   By night or day,   The things which I have seen I now can see no more....   Our birth is but a sleep and a forgetting:   The Soul that rises with us, our lifes Star,   Hath had elsewhere its setting,   And cometh from afar:   Not in entire forgetfulness,   And not in utter nakedness,   But trailing clouds of glory do we come   From God, who is our home...          Around 1800, ": null
    },
    {
        "William Wordsworth": "William Wordsworth"
    },
    {
        " revived Cowleys Pindarick for one of his finest poems, the  Intimations of Immortality  ode. Others also wrote odes: ": null
    },
    {
        "Samuel Taylor Coleridge": "Samuel Taylor Coleridge"
    },
    {
        ", ": null
    },
    {
        "John Keats": "John Keats"
    },
    {
        ", and ": null
    },
    {
        "Percy Bysshe Shelley": "Percy Bysshe Shelley"
    },
    {
        " who wrote odes with regular stanza patterns. Shelleys  Ode to the West Wind , written in fourteen line ": null
    },
    {
        "terza rima": "Terza Rima"
    },
    {
        " stanzas, is a major poem in the form. Perhaps the greatest odes of the 19th century, however, were Keatss Five Great Odes of 1819, which included ": null
    },
    {
        "Ode to a Nightingale": "Ode To A Nightingale"
    },
    {
        " , ": null
    },
    {
        "Ode on Melancholy": "Ode On Melancholy"
    },
    {
        " , ": null
    },
    {
        "Ode on a Grecian Urn": "Ode On A Grecian Urn"
    },
    {
        " , ": null
    },
    {
        "Ode to Psyche": "Ode To Psyche"
    },
    {
        " , and ": null
    },
    {
        "To Autumn": "To Autumn"
    },
    {
        " . After Keats, there have been comparatively few major odes in English. One major exception is the fourth verse of the poem  For the Fallen  by ": null
    },
    {
        "Laurence Binyon": "Laurence Binyon"
    },
    {
        ", which is often known as The Ode to the Fallen, or simply as The Ode.     W.H. Auden also wrote Ode, one of the most popular poems from his earlier career when he lived in London, in opposition to peoples ignorance over the reality of war. In an interview, Auden once stated that he had intended to title the poem My Silver Age in mockery of the supposedly imperial Golden age, however chose Ode as it seemed to provide a more sensitive exploration of warfare.     Ode on a Grecian Urn, while an ekphrasis, also functions as an ode to the artistic beauty the narrator observes. The English odes most common ": null
    },
    {
        "rhyme scheme": "Rhyme Scheme"
    },
    {
        " is ABABCDECDE.       ": null
    },
    {
        "Sharon Olds": "Sharon Olds"
    },
    {
        " Thomas Gray": "Thomas Gray"
    },
    {
        " John Keats": "John Keats"
    },
    {
        " Samuel Taylor Coleridge": "Samuel Taylor Coleridge"
    },
    {
        " William Wordsworth": "William Wordsworth"
    },
    {
        " Percy Bysshe Shelley": "Percy Bysshe Shelley"
    },
    {
        " Pablo Neruda": "Pablo Neruda"
    },
    {
        " Álvaro de Campos": "Álvaro De Campos"
    },
    {
        " Dorothy Regan Drake": "Dorothy Regan Drake"
    },
    {
        " William Shakespeare": "William Shakespeare"
    },
    {
        " Thomas Nashe": "Thomas Nashe"
    },
    {
        " John Donne": "John Donne"
    },
    {
        " Allen Tate": "Allen Tate"
    },
    {
        " Gary Soto": "Gary Soto"
    },
    {
        " Ronsard": "Ronsard"
    },
    {
        " Federico García Lorca": "Federico García Lorca"
    },
    {
        " Yajushi Vudatha": "Yajushi Vudatha"
    },
    {
        "          ": null
    }
]