[
    {
        "Operating system advocacy is the practice of attempting to increase the awareness and improve the perception of a ": null
    },
    {
        "computer": "Computer"
    },
    {
        " operating system": "Operating System"
    },
    {
        ". The motivation behind this may be to increase the number of users of a system, to assert the superiority of one choice over another or out of ": null
    },
    {
        "brand loyalty": "Brand Loyalty"
    },
    {
        ", pride in an operating systems abilities, or, with open source operating systems, political or philosophical reasons, or to persuade software vendors to ": null
    },
    {
        "port": "Porting"
    },
    {
        " specific applications or device drivers to the ": null
    },
    {
        "computing platform": "Computing Platform"
    },
    {
        ". It is generally done in support of increasing ": null
    },
    {
        "network effects": "Network Effects"
    },
    {
        " for the platform.     Operating system advocacy can vary widely in tone and form, from seriously studied and researched comparisons to ": null
    },
    {
        "heated debates": "Flaming"
    },
    {
        " on ": null
    },
    {
        "mailing lists": "Mailing List"
    },
    {
        " and other ": null
    },
    {
        "forums": "Internet Forum"
    },
    {
        ". Advocates are often normal users who devote their spare time to advocacy of their operating system of choice. Many have a deep and abiding interest in the use, design, and construction of operating systems and an emotional investment in their favorite operating system. One specific example is known as ": null
    },
    {
        "platform evangelism": "Platform Evangelism"
    },
    {
        ".     Operating system advocacy can be compared to advocacy in other fields, particularly ": null
    },
    {
        "browser": "Browser Wars"
    },
    {
        ", ": null
    },
    {
        "editor wars": "Editor War"
    },
    {
        ", ": null
    },
    {
        "programming languages": "Programming Language"
    },
    {
        ", and ": null
    },
    {
        "video game consoles": "Video Game Console"
    },
    {
        ", as well as the Ford vs. Chevy and similar debates in ": null
    },
    {
        "car culture": "Car Culture"
    },
    {
        ".       Due to the often emotional nature of advocacy debate and its sometimes narrow appeal to the wider user population, forums for discussion of advocacy are often separate from those for general discussion. Under the ": null
    },
    {
        "Usenet": "Usenet"
    },
    {
        " comp.os. and comp.sys. hierarchy, there are often .advocacy groups devoted exclusively to advocating their respective operating systems. Some of these groups, such as comp.sys.amiga.advocacy, can remain active even after their subject OS ceases to be a market force. The Guide to the Windows newsgroups exhorts Usenet posters not to get involved in arguments about Windows vs. OS/2 vs. Macintosh vs. NeXTSTEP except in the comp.os.ms-windows.advocacy group.      Operating system advocacy discussions, on Usenet and elsewhere, have spawned a variety of ": null
    },
    {
        "jargon": "Jargon"
    },
    {
        " describing commonly seen behaviour, including MicroDroid  and Amiga Persecution Complex .  The emotional form and negative characteristics often associated with operating system advocacy have led some to create guidelines explaining what they consider to be positive advocacy, such as the Linux Advocacy Guidelines  and the Guidelines for Effective OS/2 Advocacy.               ": null
    },
    {
        "FreeBSD": "Freebsd"
    },
    {
        " is served by a ": null
    },
    {
        "mailing list": "Mailing List"
    },
    {
        " specifically for advocacy discussion. Advocacy-related materials and links are provided on the , including a page of ": null
    },
    {
        "logos": "Logo"
    },
    {
        ".          As there are a large number of ": null
    },
    {
        "Linux distributions": "Linux Distribution"
    },
    {
        ", there are many organizations involved in ": null
    },
    {
        "Linux": "Linux"
    },
    {
        " advocacy, including companies directly involved in the development of distributions as well as purely advocacy-based groups, such as ": null
    },
    {
        "SEUL": "Seul"
    },
    {
        ". Promotion takes on a wide variety of forms from ": null
    },
    {
        "Tux": "Tux"
    },
    {
        " plush toys": "Stuffed Toy"
    },
    {
        " to ": null
    },
    {
        "t-shirts": "T-Shirt"
    },
    {
        " and ": null
    },
    {
        "posters": "Poster"
    },
    {
        ", and even to more unorthodox forms, such as body paints and video games.          From the ": null
    },
    {
        "1984 Super Bowl advertisement": "1984"
    },
    {
        " and Test Drive a Macintosh to the ": null
    },
    {
        "Apple Switch": "Apple Switch Ad Campaign"
    },
    {
        " and ": null
    },
    {
        "Get a Mac": "Get A Mac"
    },
    {
        " advertising campaigns, ": null
    },
    {
        "Apple Computer": "Apple Computer"
    },
    {
        " has a long history of advocating its platform through traditional media. This also covers advocacy of the ": null
    },
    {
        "Macintosh": "Macintosh"
    },
    {
        " hardware, peripherals and even lifestyle choices, with both fans and the company projecting an alternately ": null
    },
    {
        "hip": "Hip"
    },
    {
        ", entertaining, liberating lifestyle, while negatively portraying ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        ", ": null
    },
    {
        "IBM": "Ibm"
    },
    {
        ", or other competitors as anything from awkward and dated to totalitarian and sinister ": null
    },
    {
        "Big Brother": "Big Brother"
    },
    {
        " figure.              ": null
    },
    {
        "Neowin.net": "Neowin.Net"
    },
    {
        " wrote editorials opposing Windows-bashing in the media.  Microsoft has attempted to boost popularity of Windows 7 with a launch party program.        Like FreeBSD, the ": null
    },
    {
        "NetBSD": "Netbsd"
    },
    {
        " Foundation hosts a ": null
    },
    {
        "mailing list": "Mailing List"
    },
    {
        " especially for advocacy. This mailing list is automatically archived and made accessible online. The mailing list archives are  They also provide some official advocacy material, such as posters and flyers and an official powered by logo The advocacy page is  and the logo . with a license permitting use on any product running NetBSD.          Like FreeBSD and NetBSD, the ": null
    },
    {
        "OpenBSD": "Openbsd"
    },
    {
        " project provides a mailing list specifically intended for advocacy, advocacy@openbsd.org. It was created on July 21, 1998 for discussion of user groups, stickers, shirts and the promotion of OpenBSDs image and also to host all ": null
    },
    {
        "flame-worthy": "Flaming"
    },
    {
        " discussions. As a part of its advocacy, the project also maintains a list of consulting firms and individual consultants around the world on its website   and has produced a number of slogans, including Free, Functional & Secure , Secure by default , and Power. Security. Flexibility. Each OpenBSD release features an original song  and a variety of artwork.             Team OS/2  was a ": null
    },
    {
        "grassroots": "Grassroots"
    },
    {
        " organization conceived by an ": null
    },
    {
        "IBM": "Ibm"
    },
    {
        " employee and initially joined by other IBMers which quickly spread outside IBM. Whether IBM employees or not, Team OS/2 members initially volunteered their time and passion without official sanction from or connection to IBM. Members would promote OS/2 at trade shows, conferences, fairs, and in stores, participate in operating system discussions on ": null
    },
    {
        "CompuServe": "Compuserve"
    },
    {
        ", ": null
    },
    {
        "Prodigy": "Prodigy"
    },
    {
        ", ": null
    },
    {
        "Fidonet": "Fidonet"
    },
    {
        " and Usenet, throw parties, help users install OS/2, contact media figures to explain OS/2 and generate interest, and in general exercise creativity and initiative in helping popularize OS/2.     The industry dynamics that gave rise to such passionate advocacy were multi-faceted. Perhaps the leading cause was antipathy for the idea that Microsoft could and would establish a monopoly for Windows and DOS, widely deemed as far inferior to OS/2. Additionally, many users feared that IBM, who had proven eminently capable of developing a superior PC operating system, knew very little about consumer marketing in the high-tech marketplace or establishing even a superior product as a standard in the cut-throat, get-there-first-at-any-cost arena dominated by Microsoft. Finally, the mere fact that so many copies of Windows were shipping to users , coupled with the fact that so many in the industry had so much riding on the success of OS/2, created conditions ripe for so many trying to take matters into their own hands. The only spark that was needed for this combustible situation to ignite was an example of evangelism provided by the new IBM - a few employees who took empowerment seriously, able to coordinate their efforts through participation in TEAMOS2 FORUM, an ": null
    },
    {
        "internal IBM discussion group": "Ibm Vnet"
    }
]