[
    {
        "     Optic neuritis is a ": null
    },
    {
        "demyelinating": "Demyelination"
    },
    {
        " inflammation": "Inflammation"
    },
    {
        " of the ": null
    },
    {
        "optic nerve": "Optic Nerve"
    },
    {
        ". It is also known as ": null
    },
    {
        "optic papillitis": "Optic Papillitis"
    },
    {
        " and ": null
    },
    {
        "retrobulbar neuritis": "Retrobulbar Neuritis"
    },
    {
        " .  It is most often associated with ": null
    },
    {
        "multiple sclerosis": "Multiple Sclerosis"
    },
    {
        ", and it may lead to complete or partial loss of vision in one or both eyes.     Partial, transient vision loss can be an indication of early onset multiple sclerosis. Other possible diagnoses include: ": null
    },
    {
        "diabetes mellitus": "Diabetes Mellitus"
    },
    {
        ", low ": null
    },
    {
        "phosphorus": "Phosphorus"
    },
    {
        " levels, or ": null
    },
    {
        "hyperkalaemia": "Hyperkalaemia"
    },
    {
        ".          Major symptoms are sudden loss of vision , sudden blurred or foggy vision, and ": null
    },
    {
        "pain": "Pain"
    },
    {
        " on movement of the affected eye. Early symptoms that require investigation include symptoms from multiple sclerosis , episodes of disturbed/blackened rather than blurry indicate moderate stage and require immediate medical attention to prevent further loss of vision. Other early symptoms are reduced night vision, photophobia and red eyes. Many patients with optic neuritis may lose some of their color ": null
    },
    {
        "vision": "Visual Perception"
    },
    {
        " in the affected eye , with colors appearing subtly washed out compared to the other eye. Patients may also experience difficulties judging movement in depth which can be particular troublesome during driving or sport . Likewise transient worsening of vision with increase of body temperature  and glare disability are a frequent complaint. However, several case studies in children have demonstrated the absence of pain in more than half of cases in their pediatric study population, with the most common symptom reported simply as blurriness.   Other remarkable differences between the presentation of adult optic neuritis as compared to pediatric cases include more often unilateral optic neuritis in adults, while children much predominantly present with bilateral involvement.     On medical examination the head of the optic nerve can easily be visualized by a slit lamp with a high positive lens or by using direct ophthalmoscopy; however, frequently there is no abnormal appearance of the nerve head in optic neuritis , though it may be swollen in some patients . In many cases, only one eye is affected and patients may not be aware of the ": null
    },
    {
        "loss of color vision": "Color Vision Deficiency"
    },
    {
        " until they are asked to close or cover the healthy eye.       The ": null
    },
    {
        "optic nerve": "Optic Nerve"
    },
    {
        " comprises ": null
    },
    {
        "axons": "Axon"
    },
    {
        "that emerge from the ": null
    },
    {
        "retina": "Retina"
    },
    {
        " of the ": null
    },
    {
        "eye": "Human Eye"
    },
    {
        " and carry visual information to the primary visual nuclei, most of which is relayed to the ": null
    },
    {
        "occipital cortex": "Occipital Lobe"
    },
    {
        " of the ": null
    },
    {
        "brain": "Human Brain"
    },
    {
        " to be processed into vision. ": null
    },
    {
        "Inflammation": "Inflammation"
    },
    {
        " of the optic nerve causes loss of vision, usually because of the swelling and destruction of the ": null
    },
    {
        "myelin": "Myelin"
    },
    {
        " sheath covering the optic nerve.     The most common cause is ": null
    },
    {
        "multiple sclerosis": "Multiple Sclerosis"
    },
    {
        " or ischemic optic neuropathy due to thrombosis or embolism of the vessel that supplies the optic nerve.   Up to 50% of patients with MS will develop an episode of optic neuritis, and 20-30% of the time optic neuritis is the presenting ": null
    },
    {
        "sign of MS": "Multiple Sclerosis Signs And Symptoms"
    },
    {
        ". The presence of demyelinating white matter lesions on brain ": null
    },
    {
        "MRI": "Mri"
    },
    {
        " at the time of presentation of optic neuritis is the strongest predictor for developing clinically definite MS. Almost half of the patients with optic neuritis have white matter lesions consistent with multiple sclerosis.     Some other common causes of optic neuritis include infection , ": null
    },
    {
        "autoimmune disorders": "Autoimmune Disorder"
    },
    {
        " , ": null
    },
    {
        "methanol": "Methanol"
    },
    {
        " poisoning, ": null
    },
    {
        "Vitamin B 12 ": "Vitamin B12"
    },
    {
        " deficiency, and ": null
    },
    {
        "diabetes": "Diabetes"
    },
    {
        ", or an injury to the eye.      Less common causes are: papilledema, brain tumor or abscess in the occipital region, cerebral trauma or hemorrhage, meningitis, arachnoidal adhesions, sinus thrombosis, liver dysfunction, or late stage kidney disease.     ": null
    }
]