[
    {
        "                 Oscar Fingal OFlahertie Wills Wilde  was an Irish poet and playwright. After writing in different forms throughout the 1880s, the early 1890s saw him become one of the most popular playwrights in London. He is best remembered for his ": null
    },
    {
        "epigrams": "Epigrams"
    },
    {
        " and plays, his novel  The Picture of Dorian Gray , and the circumstances of his criminal conviction for gross indecency , imprisonment, and early death at age 46.     Wildes parents were successful ": null
    },
    {
        "Anglo-Irish": "Anglo-Irish"
    },
    {
        " intellectuals in ": null
    },
    {
        "Dublin": "Dublin"
    },
    {
        ". A young Wilde learned to speak fluent French and German. At university, Wilde read ": null
    },
    {
        "Greats": "Literae Humanioresgreats"
    },
    {
        "; he demonstrated himself to be an exceptional classicist, first at ": null
    },
    {
        "Trinity College Dublin": "Trinity College Dublin"
    },
    {
        ", then at ": null
    },
    {
        "Oxford": "Magdalen College, Oxford"
    },
    {
        ". He became associated with the emerging philosophy of ": null
    },
    {
        "aestheticism": "Aestheticism"
    },
    {
        ", led by two of his tutors, ": null
    },
    {
        "Walter Pater": "Walter Pater"
    },
    {
        " and ": null
    },
    {
        "John Ruskin": "John Ruskin"
    },
    {
        ". After university, Wilde moved to London into fashionable cultural and social circles.     As a spokesman for aestheticism, he tried his hand at various literary activities: he published a book of poems, lectured in the United States and Canada on the new English Renaissance in Art and interior decoration, and then returned to London where he worked prolifically as a journalist. Known for his biting wit, flamboyant dress and glittering conversational skill, Wilde became one of the best-known personalities of his day. At the turn of the 1890s, he refined his ideas about the supremacy of art in a series of dialogues and essays, and incorporated themes of decadence, duplicity, and beauty into what would be his only novel, The Picture of Dorian Gray . The opportunity to construct aesthetic details precisely, and combine them with larger social themes, drew Wilde to write drama. He wrote  Salome  in French while in Paris but it was refused a licence for England due to an absolute prohibition on the portrayal of Biblical subjects on the English stage. Unperturbed, Wilde produced four society comedies in the early 1890s, which made him one of the most successful playwrights of late-Victorian London.     At the height of his fame and success, while  The Importance of Being Earnest  was still being performed in London, Wilde had ": null
    },
    {
        "the Marquess of Queensberry": "John Douglas, 9Th Marquess Of Queensberry"
    },
    {
        " prosecuted for ": null
    },
    {
        "criminal libel": "Defamation"
    },
    {
        ". The Marquess was the father of Wildes lover, ": null
    },
    {
        "Lord Alfred Douglas": "Lord Alfred Douglas"
    },
    {
        ". The libel trial unearthed evidence that caused Wilde to drop his charges and led to his own arrest and trial for ": null
    },
    {
        "gross indecency": "Labouchere Amendment"
    },
    {
        " with men. After two more trials he was convicted and sentenced to two years ": null
    },
    {
        "hard labour": "Hard Labour"
    },
    {
        ", the maximum penalty, and was jailed from 1895 to 1897. During his last year in prison, he wrote  De Profundis  , a long letter which discusses his spiritual journey through his trials, forming a dark counterpoint to his earlier philosophy of pleasure. On his release, he left immediately for France, never to return to Ireland or Britain. There he wrote his last work,  The Ballad of Reading Gaol  , a long poem commemorating the harsh rhythms of prison life.            Oscar Wilde was born at 21 ": null
    },
    {
        "Westland Row": "Westland Row"
    },
    {
        ", Dublin , the second of three children born to Anglo-Irish Sir ": null
    },
    {
        "William Wilde": "William Wilde"
    },
    {
        " and ": null
    },
    {
        "Jane Wilde": "Jane Wilde"
    },
    {
        ", two years behind his brother ": null
    },
    {
        "William ": "Willie Wilde"
    },
    {
        ". Wildes mother had distant Italian ancestry, Hesketh Pearson, The Life of Oscar Wilde, reprinted by Penguin Books, 1985. p.  18. and under the pseudonym  Speranza  , wrote poetry for the revolutionary ": null
    },
    {
        "Young Irelanders": "Young Irelanders"
    },
    {
        " in 1848; she was a lifelong ": null
    },
    {
        "Irish nationalist": "Irish Nationalism"
    },
    {
        ".  She read the Young Irelanders poetry to Oscar and Willie, inculcating a love of these poets in her sons. Sandulescu Lady Wildes interest in the neo-classical revival showed in the paintings and busts of ancient Greece and Rome in her home.     William Wilde was Irelands leading ": null
    },
    {
        "oto": "Otology"
    },
    {
        "-": null
    },
    {
        "ophthalmologic": "Ophthalmology"
    },
    {
        " surgeon and was knighted in 1864 for his services as medical adviser and assistant commissioner to the censuses of Ireland.  He also wrote books about Irish archaeology and peasant folklore. A renowned philanthropist, his dispensary for the care of the citys poor at the rear of ": null
    },
    {
        "Trinity College, Dublin": "Trinity College, Dublin"
    },
    {
        ", was the forerunner of the Dublin Eye and Ear Hospital, now located at Adelaide Road. On his fathers side Wilde was descended from a Dutchman, Colonel de Wilde, who went to Ireland with ": null
    },
    {
        "King William of Oranges": "William Iii Of England"
    },
    {
        " invading army in 1690, and numerous Anglo-Irish ancestors. On his mothers side, Wildes ancestors included a bricklayer from ": null
    },
    {
        "County Durham": "County Durham"
    },
    {
        ", who emigrated to Ireland sometime in the 1770s.       Wilde was baptised as an infant in ": null
    },
    {
        "St. Marks Church, Dublin": "St. Marks Church, Dublin"
    },
    {
        ", the local ": null
    },
    {
        "Church of Ireland": "Church Of Ireland"
    },
    {
        "  church. When the church was closed, the records were moved to the nearby ": null
    },
    {
        "St. Anns Church, Dawson Street": "St. Anns Church, Dawson Street"
    },
    {
        ".  Davis Coakley mentions a second baptism by a Catholic priest, Father Prideaux Fox, who befriended Oscars mother circa 1859. According to Foxs testimony in Donahoes Magazine in 1905, Jane Wilde would visit his chapel in Glencree, County Wicklow, for Mass and would take her sons with her. She asked Father Fox in this period to baptise her sons. Davis Coakley. The Importance of Being Irish. 1994. pp 113–14.     Fox described it in this way:   I am not sure if she ever became a Catholic herself but it was not long before she asked me to instruct two of her children, one of them being the future erratic genius, Oscar Wilde. After a few weeks I baptized these two children, Lady Wilde herself being present on the occasion.     In addition to his children with his wife, Sir William Wilde was the father of three children born out of wedlock before his marriage: Henry Wilson, born in 1838 to one woman, and Emily and Mary Wilde, born in 1847 and 1849, respectively, to a second woman. Sir William acknowledged paternity of his illegitimate or natural children and provided for their education, arranging for them to be reared by his relatives rather than with his legitimate children in his family household with his wife. Ellmann     In 1855, the family moved to No. 1 ": null
    },
    {
        "Merrion Square": "Merrion Square"
    },
    {
        ", where Wildes sister, Isola, was born in 1857. The Wildes new home was larger. With both his parents success and delight in social life, the house soon became the site of a unique medical and cultural milieu . Guests at their ": null
    },
    {
        "salon": "Salon"
    },
    {
        " included ": null
    },
    {
        "Sheridan Le Fanu": "Sheridan Le Fanu"
    },
    {
        ", ": null
    },
    {
        "Charles Lever": "Charles Lever"
    },
    {
        ", ": null
    },
    {
        "George Petrie": "George Petrie"
    },
    {
        ", ": null
    },
    {
        "Isaac Butt": "Isaac Butt"
    },
    {
        ", ": null
    },
    {
        "William Rowan Hamilton": "William Rowan Hamilton"
    },
    {
        " and ": null
    },
    {
        "Samuel Ferguson": "Samuel Ferguson"
    },
    {
        ".     Until he was nine, Oscar Wilde was educated at home, where a French ": null
    },
    {
        "nursemaid": "Nursemaid"
    },
    {
        " and a German ": null
    },
    {
        "governess": "Governess"
    },
    {
        " taught him their languages. Richard Ellmann: Oscar Wilde p 18 He attended ": null
    },
    {
        "Portora Royal School": "Portora Royal School"
    },
    {
        " in ": null
    },
    {
        "Enniskillen": "Enniskillen"
    },
    {
        ", County Fermanagh, from 1864 to 1871. Ellmann Until his early twenties, Wilde summered at the villa, Moytura House, which his father had built in ": null
    },
    {
        "Cong, County Mayo": "Cong, County Mayo"
    },
    {
        ". Sandulescu There the young Wilde and his brother Willie played with ": null
    },
    {
        "George Moore": "George Moore"
    },
    {
        ".     Isola died at age nine of ": null
    },
    {
        "meningitis": "Meningitis"
    },
    {
        ". Wildes poem ": null
    },
    {
        "Requiescat": "S:Requiescat"
    },
    {
        " is written to her memory. Poems": null
    },
    {
        "Trinity College, Dublin": "Trinity College, Dublin"
    },
    {
        ", from 1871 to 1874, Ellmann sharing rooms with his older brother ": null
    },
    {
        "Willie Wilde": "Willie Wilde"
    },
    {
        ". Trinity, one of the leading classical schools, placed him with scholars such as ": null
    },
    {
        "R. Y. Tyrell": "Robert Yelverton Tyrrell"
    },
    {
        ", ": null
    },
    {
        "Arthur Palmer": "Arthur Palmer"
    },
    {
        ", ": null
    },
    {
        "Edward Dowden": "Edward Dowden"
    },
    {
        " and his tutor, Professor ": null
    },
    {
        "J. P. Mahaffy": "John Pentland Mahaffy"
    },
    {
        ", who inspired his interest in ": null
    },
    {
        "Greek literature": "Greek Literature"
    },
    {
        ". As a student Wilde worked with Mahaffy on the latters book Social Life in Greece. Sandulescu Wilde, despite later reservations, called Mahaffy my first and best teacher and the scholar who showed me how to love Greek things . Ellmann For his part, Mahaffy boasted of having created Wilde; later, he said Wilde was the only blot on my tutorship . Ellmann     The ": null
    },
    {
        "University Philosophical Society": "University Philosophical Society"
    },
    {
        " also provided an education, as members discussed intellectual and artistic subjects such as ": null
    },
    {
        "Dante Gabriel Rossetti": "Dante Gabriel Rossetti"
    },
    {
        " and ": null
    },
    {
        "Algernon Charles Swinburne": "Algernon Charles Swinburne"
    },
    {
        " weekly. Wilde quickly became an established member  – the members suggestion book for 1874 contains two pages of banter mocking Wildes emergent aestheticism. He presented a paper titled Aesthetic Morality . Ellmann At Trinity, Wilde established himself as an outstanding student: he came first in his class in his first year, won a scholarship by competitive examination in his second and, in his finals, won the Berkeley Gold Medal in Greek, the Universitys highest academic award. Coakley He was encouraged to compete for a ": null
    },
    {
        "demyship": "Demyship"
    },
    {
        " to ": null
    },
    {
        "Magdalen College, Oxford": "Magdalen College, Oxford"
    },
    {
        "  – which he won easily, having already studied Greek for over nine years.       At Magdalen, he read ": null
    },
    {
        "Greats": "Greats"
    },
    {
        " from 1874 to 1878, and from there he applied to join the ": null
    },
    {
        "Oxford Union": "Oxford Union"
    },
    {
        ", but failed to be elected. See pages 183–5 of Thomas Toughills The Ripper Code which mention Toughills research in the archives of the Oxford Union. This book also contains a photograph of Wildes unsuccessful entry in the Unions Probational Members Subscriptions for the period 1862–1890.      Attracted by its dress, secrecy, and ritual, Wilde petitioned the Apollo ": null
    },
    {
        "Masonic Lodge": "Masonic Lodge"
    },
    {
        " at Oxford, and was soon raised to the Sublime Degree of Master Mason . Ellmann During a resurgent interest in ": null
    },
    {
        "Freemasonry": "Freemasonry"
    },
    {
        " in his third year, he commented he would be awfully sorry to give it up if I secede from the Protestant Heresy . Ellmann Wildes active involvement in Freemasonry lasted only for the time he spent at Oxford; he allowed his membership of the Apollo University Lodge to lapse after failing to pay subscriptions.      Catholicism deeply appealed to him, especially its rich liturgy, and he discussed converting to it with clergy several times. In 1877, Wilde was left speechless after an audience with ": null
    },
    {
        "Pope Pius  IX": "Pope Pius Ix"
    },
    {
        " in Rome. Ellmann He eagerly read the books of ": null
    },
    {
        "Cardinal Newman": "John Henry Newman"
    },
    {
        ", a noted Anglican priest who had converted to Catholicism and risen in the church hierarchy. He became more serious in 1878, when he met the Reverend Sebastian Bowden, a priest in the ": null
    },
    {
        "Brompton Oratory": "Brompton Oratory"
    },
    {
        " who had received some high-profile converts. Neither his father, who threatened to cut off his funds, nor Mahaffy thought much of the plan; but mostly Wilde, the supreme individualist, balked at the last minute from pledging himself to any formal creed. On the appointed day of his baptism, Wilde sent Father Bowden a bunch of altar lilies instead. Wilde did retain a lifelong interest in Catholic theology and liturgy. Sandelsecu     While at Magdalen College, Wilde became particularly well known for his role in the ": null
    },
    {
        "aesthetic": "Aesthetic Movement"
    },
    {
        " and ": null
    },
    {
        "decadent movements": "Decadent Movement"
    },
    {
        ". He wore his hair long, openly scorned manly sports though he occasionally boxed, and he decorated his rooms with peacock feathers, lilies, sunflowers, blue china and other objets dart. He once remarked to friends, whom he entertained lavishly, I find it harder and harder every day to live up to my blue china. Ellmann The line quickly became famous, accepted as a slogan by aesthetes but used against them by critics who sensed in it a terrible vacuousness. Some elements disdained the aesthetes, but their languishing attitudes and showy costumes became a recognised pose. Breen pp22–23 Wilde was once physically attacked by a group of four fellow students, and dealt with them single-handedly, surprising critics. Ellmann By his third year Wilde had truly begun to develop himself and his myth, and considered his learning to be more expansive than what was within the prescribed texts. This attitude resulted in his being ": null
    },
    {
        "rusticated": "Rustication"
    },
    {
        " for one term, after he had returned late to a college term from a trip to Greece with Mahaffy. Ellmann     Wilde did not meet ": null
    },
    {
        "Walter Pater": "Walter Pater"
    },
    {
        " until his third year, but had been enthralled by his Studies in the History of the Renaissance, published during Wildes final year in Trinity. Ellmann Pater argued that mans sensibility to beauty should be refined above all else, and that each moment should be felt to its fullest extent. Years later, in  De Profundis , Wilde described Paters Studies... as that book that has had such a strange influence over my life . De Profundis, Holland/Hart-Davis He learned tracts of the book by heart, and carried it with him on travels in later years. Pater gave Wilde his sense of almost flippant devotion to art, though he gained a purpose for it through the lectures and writings of critic ": null
    },
    {
        "John Ruskin": "John Ruskin"
    },
    {
        ". Ellmann Ruskin despaired at the self-validating aestheticism of Pater, arguing that the importance of art lies in its potential for the betterment of society. Ruskin admired beauty, but believed it must be allied with, and applied to, moral good. When Wilde eagerly attended Ruskins lecture series The Aesthetic and Mathematic Schools of Art in Florence, he learned about aesthetics as the non-mathematical elements of painting. Despite being given to neither early rising nor manual labour, Wilde volunteered for Ruskins project to convert a swampy country lane into a smart road neatly edged with flowers.     Wilde won the 1878 ": null
    },
    {
        "Newdigate Prize": "Newdigate Prize"
    },
    {
        " for his poem ": null
    },
    {
        "Ravenna": "S:Ravenna"
    },
    {
        " , which reflected on his visit there the year before, and he duly read it at ": null
    },
    {
        "Encaenia": "Encaenia"
    },
    {
        ". Ellmann In November 1878, he graduated with a ": null
    },
    {
        "double first": "First Class Honours"
    },
    {
        " in his B.A. of Classical Moderations and ": null
    },
    {
        "Literae Humaniores": "Literae Humaniores"
    },
    {
        " . Wilde wrote to a friend, The dons are  beyond words  – the Bad Boy doing so well in the end! Letter to William Ward; Holland/Hart-Davis ; see also Ellmann              After graduation from Oxford, Wilde returned to Dublin, where he met again ": null
    },
    {
        "Florence Balcombe": "Florence Balcombe"
    },
    {
        ", a childhood sweetheart. She became engaged to ": null
    },
    {
        "Bram Stoker": "Bram Stoker"
    },
    {
        " and they married in 1878. Kifeather Wilde was disappointed but stoic: he wrote to her, remembering the two sweet years  – the sweetest years of all my youth during which they had been close. Letter to Florence Balcombe, Holland/Hart-Davis He also stated his intention to return to England, probably for good. This he did in 1878, only briefly visiting Ireland twice after that. Letter to Florence Balcombe, Holland/Hart-Davis ; See also Ellmann     Unsure of his next step, Wilde wrote to various acquaintances enquiring about Classics positions at Oxford or Cambridge. Holland/Hart-Davis The Rise of Historical Criticism was his submission for the Chancellors Essay prize of 1879, which, though no longer a student, he was still eligible to enter. Its subject, Historical Criticism among the Ancients seemed ready-made for Wilde  – with both his skill in composition and ancient learning  – but he struggled to find his voice with the long, flat, scholarly style. Ellmann Unusually, no prize was awarded that year.      With the last of his inheritance from the sale of his fathers houses, he set himself up as a bachelor in London. Ellmann The 1881 British Census listed Wilde as a boarder at 1 ": null
    },
    {
        "Tite Street": "Tite Street"
    },
    {
        ", Chelsea, where ": null
    },
    {
        "Frank Miles": "Frank Miles"
    },
    {
        ", a society painter, was the head of the household. Ancestry.com and The Church of Jesus Christ of Latter-day Saints. 1881 England Census Provo, UT, USA: Ancestry.com Operations Inc, 2004. Source Citation: Class: RG11; Piece: 78; Folio: 56; Page: 46; GSU roll: 1341017. Retrieved 2 March 2010. Wilde spent the next six years in London and Paris, and in the United States, where he travelled to deliver lectures.     He had been publishing lyrics and poems in magazines since entering Trinity College, especially in Kottabos and the  Dublin University Magazine . In mid-1881, at 27 years old, he published Poems, which collected, revised and expanded his poems. Ellmann     The book was generally well received, and sold out its first print run of 750 copies.  Punch  was less enthusiastic, saying The poet is Wilde, but his poetrys tame . By a tight vote, the ": null
    },
    {
        "Oxford Union": "Oxford Union"
    },
    {
        " condemned the book for alleged ": null
    },
    {
        "plagiarism": "Plagiarism"
    },
    {
        ". The librarian, who had requested the book for the library, returned the presentation copy to Wilde with a note of apology. Morley Hyde Biographer ": null
    },
    {
        "Richard Ellmann": "Richard Ellmann"
    },
    {
        " argues that Wildes poem ": null
    },
    {
        "Hélas!": "S:Hélas!"
    },
    {
        " was a sincere, though flamboyant, attempt to explain the dichotomies the poet saw in himself; one line reads: To drift with every passion till my soul Is a stringed lute on which all winds can play . Ellmann     The book had further printings in 1882. It was bound in a rich, enamel parchment cover and printed on hand-made Dutch paper; over the next few years, Wilde presented many copies to the dignitaries and writers who received him during his lecture tours. Mason            Aestheticism was sufficiently in vogue to be caricatured by ": null
    },
    {
        "Gilbert and Sullivan": "Gilbert And Sullivan"
    },
    {
        " in  Patience  . ": null
    },
    {
        "Richard DOyly Carte": "Richard Doyly Carte"
    },
    {
        ", an English impresario, invited Wilde to make a lecture tour of North America, simultaneously priming the pump for the US tour of Patience and selling this most charming aesthete to the American public. Wilde journeyed on the ": null
    },
    {
        "SS Arizona": "Ss Arizona"
    },
    {
        ", arriving 2 January 1882, and disembarking the following day.  2000:329–330Springfield1988:2051972:2321988:228equivalent to about £ in current value18851886and later executed1988:2731988:275": null
    },
    {
        "88:2": "88:2"
    },
    {
        "1988:247–248United Kingdom1914:2191988:2761997:911997:951914:2022000:4042000:4131996:85,861997": null
    },
    {
        "93–19": "93–19"
    },
    {
        "1988201819881914:360–362Vol. CXLVI, No. 885, July 18891914:61997:1091998:2801912:1011912:102": null
    },
    {
        "ston Public Libra": "Ston Public Libra"
    },
    {
        "1914:711997:9819961950:xifirst published 18851914:355-71950:x1914:105United Kingdom2011:12000:4412000: 433,435,438,441,4461914:3411997:1112000:43525 January 2009London1988:3161988:322play1988:323": null
    },
    {
        "d": "D"
    },
    {
        "John the Baptist": "John The Baptist"
    },
    {
        "1988:3261914:3711914:3691988:3441988:3471980:3601988:4041997:146his salary at The Womans World had been £6letter20002000:7022000:7031988:4212000:699–7001988:396the maintenance of alternative personas in the town and countryplayEd.1997:166-71988:398": null
    },
    {
        "t": "T"
    },
    {
        "Ed.1997:161who played Algernon1946:257Ed.1997:1651976:1022004:300": null
    },
    {
        "tt": "Tt"
    },
    {
        "1976, Jonathan Cape, London1984, Jonathan Cape, London1988:4151988:418equal to £ today1997:31997:82017 ": null
    }
]