[
    {
        "        Overgrazing occurs when plants are exposed to intensive ": null
    },
    {
        "grazing": "Grazing"
    },
    {
        " for extended periods of time, or without sufficient recovery periods. It can be caused by either ": null
    },
    {
        "livestock": "Livestock"
    },
    {
        " in poorly managed ": null
    },
    {
        "agricultural": "Agriculture"
    },
    {
        " applications, ": null
    },
    {
        "game reserves": "Game Reserve"
    },
    {
        ", or ": null
    },
    {
        "nature reserves": "Nature Reserve"
    },
    {
        ". It can also be caused by immobile, travel restricted populations of ": null
    },
    {
        "native": "Indigenous"
    },
    {
        " or ": null
    },
    {
        "non-native": "Introduced Species"
    },
    {
        " wild animals": "Wildlife"
    },
    {
        ". However, overgrazing is a controversial concept, based on equilibrium system theory.     It reduces the usefulness, ": null
    },
    {
        "productivity": "Primary Productivity"
    },
    {
        ", and ": null
    },
    {
        "biodiversity": "Biodiversity"
    },
    {
        " of the land and is one cause of ": null
    },
    {
        "desertification": "Desertification"
    },
    {
        " and ": null
    },
    {
        "erosion": "Erosion"
    },
    {
        ". Overgrazing is also seen as a cause of the spread of ": null
    },
    {
        "invasive species": "Invasive Species"
    },
    {
        " of ": null
    },
    {
        "non-native plants": "Invasive Plant"
    },
    {
        " and of ": null
    },
    {
        "weeds": "Weed"
    },
    {
        ". It is reversed or prevented by moving ": null
    },
    {
        "grazers": "Grazing"
    },
    {
        " in large herds, such as the American bison of the Great Plains,   or migratory ": null
    },
    {
        "Wildebeests": "Wildebeest"
    },
    {
        " of the African ": null
    },
    {
        "savannas": "Savanna"
    },
    {
        ", In ": null
    },
    {
        "balance": "Predator–Prey Equations"
    },
    {
        " with, and accompanied by, prides of ": null
    },
    {
        "keystone predators": "Keystone Speciespredators"
    },
    {
        ". or by ": null
    },
    {
        "holistic": "Holistic Management"
    },
    {
        " planned grazing.  by Terry Waghorn. Forbes. 20 December 2012.          ": null
    },
    {
        "Sustainable grassland production": "Sustainable Agriculture"
    },
    {
        " is based on ": null
    },
    {
        "grass": "Grass"
    },
    {
        " and grassland management, ": null
    },
    {
        "land management": "Land Management"
    },
    {
        ", animal management and livestock marketing. Grazing management, with ": null
    },
    {
        "sustainable agriculture": "Sustainable Agriculture"
    },
    {
        " and ": null
    },
    {
        "agroecology": "Agroecology"
    },
    {
        " practices, is the foundation of grassland-based livestock production since it affects both animal and plant health and productivity. There are several new grazing models and management systems that attempt to reduce or eliminate overgrazing like ": null
    },
    {
        "Holistic management": "Holistic Management"
    },
    {
        "   and ": null
    },
    {
        "Permaculture": "Permaculture"
    },
    {
        "   Overgrazing Can Hurt Environment, Your Pocketbook Ed Rayburn. 2000.       One indicator of overgrazing is that the animals run short of pasture. In some regions of the United States under continuous grazing, overgrazed pastures are predominated by short-grass species such as ": null
    },
    {
        "bluegrass": "Poa"
    },
    {
        " and will be less than 2-3  inches tall in the grazed areas. In other parts of the world, overgrazed pasture is typically taller than sustainably grazed pasture, with grass heights typically over 1 meter and dominated by unpalatable species such as  Aristida  or  Imperata . In all cases, palatable tall grasses such as ": null
    },
    {
        "orchard grass": "Orchard Grass"
    },
    {
        " are sparse or non-existent. In such cases of overgrazing, soil may be visible between plants in the stand, allowing erosion to occur, though in many circumstances overgrazed pastures have a greater sward cover than sustainably grazed pastures.       Under rotational grazing, overgrazed plants do not have enough time to recover to the proper height between grazing events. The animals resume grazing before the plants have restored carbohydrate reserves and grown back roots lost after the last ": null
    },
    {
        "defoliation": "Defoliation"
    },
    {
        ". The result is the same as under continuous grazing: in some parts of the United States tall-growing species die and short-growing species that are more subject to drought injury predominate the pasture, while in most other parts of the world tall, drought tolerant, unpalatable species such as  Imperata  or  Aristida  come to dominate. As the sod thins, weeds encroach into the pasture in some parts of the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", whereas in most other parts of the world overgrazing can promote thick swards of native unpalatable grasses that hamper the spread of weeds.     Another indicator of overgrazing in some parts of ": null
    },
    {
        "North America": "North America"
    },
    {
        " is that livestock run out of pasture, and hay needs to be fed early in the fall. In contrast, most areas of the world do not experience the same climatic regime as the continental United States and hay feeding is rarely conducted.     Overgrazing is also indicated in livestock performance and condition. Cows having inadequate pasture immediately following their ": null
    },
    {
        "calfs": "Calf"
    },
    {
        " weaning": "Weaning"
    },
    {
        " may have poor body condition the following season. This may reduce the health and vigor of cows and calves at ": null
    },
    {
        "calving": "Birth"
    },
    {
        ". Also, cows in poor body condition do not cycle as soon after calving, which can result in delayed breeding. This can result in a long calving season. With good cow genetics, nutrition, ideal seasons and controlled breeding 55% to 75% of the calves should come in the first 21 days of the calving season. Poor weaning weights of calves can be caused by insufficient pasture, when cows give less milk and the calves need pasture to maintain weight gain.          Overgrazing typically increases ": null
    },
    {
        "soil erosion": "Soil Erosion"
    },
    {
        ". C.Michael Hogan. 2009. . Encyclopedia of Earth. Sidney Draggan, topic ed.; Cutler J. Cleveland, ed., National council for Science and the Environment, Washington DC Reduction in soil depth, ": null
    },
    {
        "soil organic matter": "Soil Organic Matter"
    },
    {
        " and soil fertility impair the lands future natural and agricultural productivity. Soil fertility can sometimes be mitigated by applying the appropriate lime and ": null
    },
    {
        "organic fertilizers": "Organic Fertilizer"
    },
    {
        ". However, the loss of soil depth and organic matter takes centuries to correct. Their loss is critical in determining the soils water-holding capacity and how well pasture plants do during dry weather.     ": null
    },
    {
        "Native plant": "Native Plant"
    },
    {
        " grass": "Grass"
    },
    {
        " species, both individual ": null
    },
    {
        "bunch grass": "Bunch Grass"
    },
    {
        "es and in ": null
    },
    {
        "grasslands": "Grassland"
    },
    {
        ", are especially vulnerable.       In the ": null
    },
    {
        "continental United States": "Continental United States"
    },
    {
        ", to prevent overgrazing, match the forage supplement to the herds requirement. This means that a buffer needs to be in the system to adjust for the fastest growth of forages.     Another potential buffer is to plant warm-season perennial grasses such as ": null
    },
    {
        "switchgrass": "Switchgrass"
    },
    {
        ", which do not grow early in the season. This reduces the area that the livestock can use early in the season, making it easier for them to keep up with the cool-season grasses. The animals then use the warm-season grasses during the heat of the summer, and the cool-season grasses recover for fall grazing.     The grazing guidelines in the table are for rotationally grazed, cool-season forages. When using continuous grazing, manage pasture height at one-half the recommended turn-in height for rotational grazing to optimize plant health. The growth habit of some forage species, such as ": null
    },
    {
        "alfalfa": "Alfalfa"
    },
    {
        ", does not permit their survival under continuous grazing. When managing for legumes in the stand, it is beneficial to use rotational grazing and graze the stand close and then give adequate rest to stimulate the legumes growth.          Overgrazing is used as an example in the economic concept now known as the ": null
    },
    {
        "Tragedy of the Commons": "Tragedy Of The Commons"
    },
    {
        " devised in a 1968 paper by ": null
    },
    {
        "Garrett Hardin": "Garrett Hardin"
    },
    {
        ". Garrett Hardin, , Science, Vol. 162, No. 3859 , pp. 1243-1248. Also available  and  This cited the work of a Victorian economist who used the over-grazing of common land as an example of behaviour. Hardins example could only apply to unregulated use of land regarded as a common resource.     Normally, rights of use of Common land in England and Wales were, and still are, closely regulated, and available only to commoners . If excessive use was made of common land, for example in overgrazing, a common would be stinted , that is, a limit would be put on the number of animals each commoner was allowed to graze. These regulations were responsive to demographic and economic pressure; thus rather than let a common become degraded, access was restricted even further. This important part of actual historic practice was absent from the economic model of Hardin. Susan Jane Buck Cox - No tragedy on the Commons Journal of Environmental Ethics, Vol 7, Spring 1985    In reality the use of common land in England and Wales was a triumph of conserving a scarce resource using agreed custom and practice.        ": null
    },
    {
        "2010 Sahel famine": "2010 Sahel Famine"
    },
    {
        "     The violent ": null
    },
    {
        "herder–farmer conflicts in Nigeria": "Herder–Farmer Conflicts In Nigeria"
    },
    {
        ", ": null
    },
    {
        "Mali": "Mali"
    },
    {
        ", ": null
    },
    {
        "Sudan": "Sudanese Nomadic Conflicts"
    },
    {
        " and other countries in the ": null
    },
    {
        "Sahel": "Sahel"
    },
    {
        " region have been exacerbated by land degradation and overgrazing.         Overgrazing does not necessarily mean total ": null
    },
    {
        "denudation": "Denudation"
    },
    {
        " of the land. Overgrazing can also occur with native species. In the ": null
    },
    {
        "Australian Capital Territory": "Australian Capital Territory"
    },
    {
        ", ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " the local government, in 2013, authorised the culling of 1455 ": null
    },
    {
        "kangaroos": "Kangaroos"
    },
    {
        " due to overgrazing.        ": null
    }
]