[
    {
        "           Owain ab Gruffydd, lord of Glyndyfrdwy , or simply Owain Glyndŵr or Glyn Dŵr , was a ": null
    },
    {
        "Welsh": "Welsh People"
    },
    {
        " leader who instigated a fierce and long-running yet ultimately unsuccessful ": null
    },
    {
        "war of independence": "Glyndŵr Rising"
    },
    {
        " with the aim of ending ": null
    },
    {
        "English": "Kingdom Of England"
    },
    {
        " rule in ": null
    },
    {
        "Wales": "Wales In The Late Middle Ages"
    },
    {
        " during the ": null
    },
    {
        "Late Middle Ages": "Late Middle Ages"
    },
    {
        ". He was the last native Welshman to hold the title ": null
    },
    {
        "Prince of Wales": "Prince Of Wales"
    },
    {
        " .     Glyndŵr was a descendant of the Princes of ": null
    },
    {
        "Powys": "Kingdom Of Powys"
    },
    {
        " through his father ": null
    },
    {
        "Gruffudd Fychan II": "Gruffudd Fychan Ii"
    },
    {
        ", hereditary  Tywysog  of ": null
    },
    {
        "Powys Fadog": "Powys Fadog"
    },
    {
        " and Lord of ": null
    },
    {
        "Glyndyfrdwy": "Glyndyfrdwy"
    },
    {
        ", and of those of ": null
    },
    {
        "Deheubarth": "Deheubarth"
    },
    {
        " through his mother Elen ferch Tomas ap Llywelyn ab Owen.  On 16 September 1400, Glyndŵr instigated the ": null
    },
    {
        "Welsh Revolt": "Glyndŵr Rising"
    },
    {
        " against the rule of ": null
    },
    {
        "Henry IV of England": "Henry Iv Of England"
    },
    {
        ". The uprising was initially very successful and rapidly gained control of large areas of Wales, but it suffered from key weaknesses – particularly a lack of artillery, which made capturing defended fortresses difficult, and of ships, which made rebel-controlled coastlands vulnerable. The uprising was eventually suppressed by the superior resources of the English. Glyndŵr was driven from his last remaining strongholds in 1409, but he avoided capture; the last documented sighting of him was in 1412. He twice ignored offers of a pardon from his military nemesis, the new king ": null
    },
    {
        "Henry V of England": "Henry V Of England"
    },
    {
        ", and despite the large rewards offered, Glyndŵr was never betrayed to the English. His death was recorded by a former follower in the year 1415.     With his death Owain acquired a mythical status along with ": null
    },
    {
        "Cadwaladr": "Cadwaladr"
    },
    {
        ", Cynan and ": null
    },
    {
        "Arthur": "King Arthur"
    },
    {
        " as a folk hero awaiting the call to return and liberate his people. In ": null
    },
    {
        "William Shakespeares": "William Shakespeare"
    },
    {
        "play  Henry IV, Part 1 , the character of Owen Glendower is a wild and exotic king ruled by magic and emotion.  In the late 19th century, the ": null
    },
    {
        "Cymru Fydd": "Cymru Fydd"
    },
    {
        " movement recreated him as the father of ": null
    },
    {
        "Welsh nationalism": "Welsh Nationalism"
    },
    {
        ".            Glyndŵr was born around 1349 or 1359 to a prosperous ": null
    },
    {
        "landed family": "Landed Gentry"
    },
    {
        ", part of the Anglo-Welsh ": null
    },
    {
        "gentry": "Gentry"
    },
    {
        " of the ": null
    },
    {
        "Welsh Marches": "Welsh Marches"
    },
    {
        " in northeast Wales.  This group moved easily between Welsh and English societies and languages, occupying important offices for the ": null
    },
    {
        "Marcher Lords": "Marcher Lords"
    },
    {
        " while maintaining their position as uchelwyr — nobles descended from the pre-conquest Welsh royal dynasties — in traditional Welsh society. His father, ": null
    },
    {
        "Gruffydd Fychan II": "Gruffydd Fychan Ii"
    },
    {
        ", hereditary ": null
    },
    {
        "Tywysog": "Tywysog"
    },
    {
        " of ": null
    },
    {
        "Powys Fadog": "Powys Fadog"
    },
    {
        " and Lord of ": null
    },
    {
        "Glyndyfrdwy": "Glyndyfrdwy"
    },
    {
        ", died some time before 1370, leaving Glyndŵrs mother Elen ferch Tomas ap Llywelyn of ": null
    },
    {
        "Deheubarth": "Deheubarth"
    },
    {
        " a widow and Owain a young man of 16 years at most.     The young Owain ap Gruffydd was possibly fostered at the home of ": null
    },
    {
        "David Hanmer": "David Hanmer"
    },
    {
        ", a rising lawyer shortly to be a justice of the Kings Bench, or at the home of Richard FitzAlan, 3rd Earl of Arundel. Owain is then thought to have been sent to London to study law at the ": null
    },
    {
        "Inns of Court": "Inns Of Court"
    },
    {
        ".  He probably studied as a legal ": null
    },
    {
        "apprentice": "Apprentice"
    },
    {
        " for seven years. He was possibly in London during the ": null
    },
    {
        "Peasants Revolt": "Peasants Revolt"
    },
    {
        " of 1381. By 1383, he had returned to Wales, where he married David Hanmers daughter, ": null
    },
    {
        "Margaret": "Margaret Hanmer"
    },
    {
        ", started his large family and established himself as the Squire of ": null
    },
    {
        "Sycharth": "Sycharth"
    },
    {
        " and Glyndyfrdwy, with all the responsibilities that entailed.     Glyndŵr entered the English kings military service in 1384 when he undertook garrison duty under the renowned Welshman Sir Gregory Sais, or Sir Degory Sais, on the English–Scottish border at ": null
    },
    {
        "Berwick-upon-Tweed": "Berwick-Upon-Tweed"
    },
    {
        ".  In August 1385, he served King ": null
    },
    {
        "Richard II": "Richard Ii"
    },
    {
        " under the command of ": null
    },
    {
        "John of Gaunt": "John Of Gaunt"
    },
    {
        ", again in ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        ". On 3 September 1386, he was called to give evidence in the  Scrope v Grosvenor  trial at ": null
    },
    {
        "Chester": "Chester"
    },
    {
        ".  In March 1387, Owain was in southeast England under ": null
    },
    {
        "Richard FitzAlan, 11th Earl of Arundel": "Richard Fitzalan, 11Th Earl Of Arundel"
    },
    {
        ", in the English Channel at the defeat of a Franco-Spanish-Flemish fleet off the coast of ": null
    },
    {
        "Kent": "Kent"
    },
    {
        ". Upon the death in late 1387 of his father-in-law, Sir David Hanmer, knighted earlier that same year by Richard II, Glyndŵr returned to Wales as executor of his estate. He possibly served as a squire to Henry Bolingbroke , son of John of Gaunt, at the short, sharp ": null
    },
    {
        "Battle of Radcot Bridge": "Battle Of Radcot Bridge"
    },
    {
        " in December 1387. He had gained three years concentrated military experience in different theatres and seen at first hand some key events and people.     King Richard was distracted by a growing conflict with the ": null
    },
    {
        "Lords Appellant": "Lords Appellant"
    },
    {
        " from this time on. Glyndŵrs opportunities were further limited by the death of Sir Gregory Sais in 1390 and the sidelining of Richard FitzAlan, Earl of Arundel, and he probably returned to his stable Welsh estates, living there quietly for ten years during his forties. The ": null
    },
    {
        "bard": "Bard"
    },
    {
        " Iolo Goch": "Iolo Goch"
    },
    {
        " , himself a Welsh lord, visited Glyndŵr in the 1390s and wrote a number of odes to Owain, praising Owains liberality, and writing of ": null
    },
    {
        "Sycharth": "Sycharth"
    },
    {
        ", Rare was it there / to see a latch or a lock.       The names and number of Owain Glyndŵrs siblings cannot be certainly known. The following are given by the ": null
    },
    {
        "Jacob Youde William Lloyd": "Jacob Youde William Lloyd"
    },
    {
        "   Brother ": null
    },
    {
        "Tudur": "Tudur Ap Gruffudd"
    },
    {
        ", Lord of Gwyddelwern, born about 1362, died 11 March 1405 at a battle in Brecknockshire in the wars of his brother.   Brother Gruffudd who had a daughter and heiress, Eva.   Sister Lowri, also spelled Lowry, married ": null
    },
    {
        "Robert Puleston": "Robert Puleston"
    },
    {
        " of Emral.   Sister Isabel married Adda ap Iorwerth Ddu of Llys Pengwern.   Sister Morfudd married Sir Richard Croft of ": null
    },
    {
        "Croft Castle": "Croft Castle"
    },
    {
        ", in Herefordshire and, secondly, David ab Ednyfed Gam of Llys Pengwern.   Sister Gwenllian.     Tudur, Isabel and Lowri are given as his siblings by the more cautious R. R. Davies. That Owain Glyndŵr had another brother Gruffudd is likely; that he possibly had a third, Maredudd, is suggested by one reference.                In the late 1390s, a series of events began to push Owain towards rebellion, in what was later to be called the Welsh Revolt, the Glyndŵr Rising or the Last War of Independence. His neighbour, ": null
    },
    {
        "Baron Grey de Ruthyn": "Reginald Grey, 3Rd Baron Grey De Ruthyn"
    },
    {
        ", had seized control of some land, for which Glyndŵr appealed to the English Parliament. Owains petition for redress was ignored. Later, in 1400, Lord Grey informed Glyndŵr too late of a royal command to levy feudal troops for Scottish border service, thus enabling him to call the Welshman a traitor in London court circles.  Lord Grey was a personal friend of King Henry IV. Glyndŵr lost the legal case and was under personal threat. However, an alternative source states that Glyndŵr was under threat because he had written an angry letter to Lord Grey, boasting that he had stolen some of Lord Greys horses, and believing Lord Grey had threatened to burn and slay within his lands, he threatened retaliation in the same manner. Lord Grey then denied making the initial threat to burn and slay, and replied that he would take the incriminating letter to Henry IVs council, and that Glyndŵr would hang for the admission of theft and treason contained within the letter.  The deposed king, Richard II, had support in Wales, and in January 1400 serious civil disorder broke out in the English border city of Chester after the public execution of an officer of Richard II.      These events led to Owain formally assuming his ancestral title of Prince of Powys on 16 September 1400 at his ": null
    },
    {
        "Glyndyfrdwy": "Glyndyfrdwy"
    },
    {
        " estate. With a small band of followers which included his eldest son, his brothers-in-law, and the ": null
    },
    {
        "Bishop of St Asaph": "Bishop Of St Asaph"
    },
    {
        " in the town of ": null
    },
    {
        "Corwen": "Corwen"
    },
    {
        ", possibly in the church of SS Mael & Sulien, he launched an assault on Lord Greys territories. After a number of initial confrontations between King Henry IV and Owains followers in September and October 1400, the revolt began to spread. Much of northern and central Wales went over to Owain. Henry IV appointed ": null
    },
    {
        "Henry Percy": "Henry Hotspur Percy"
    },
    {
        " – the famous Hotspur – to bring the country to order. Hotspur issued an amnesty in March which applied to all rebels with the exception of Owain and his cousins, ": null
    },
    {
        "Rhys ap Tudur": "Rhys Ap Tudur"
    },
    {
        " and Gwilym ap Tudur, sons of Tudur ap Gronw . Both the Tudurs were pardoned after their capture of ": null
    },
    {
        "Edward I": "Edward I Of England"
    },
    {
        "’s great castle at ": null
    },
    {
        "Conwy": "Conwy"
    },
    {
        ". In June, Owain scored his first major victory in the field at ": null
    },
    {
        "Mynydd Hyddgen": "Mynydd Hyddgen"
    },
    {
        " on ": null
    },
    {
        "Pumlumon": "Pumlumon"
    },
    {
        ". Retaliation by Henry IV on the ": null
    },
    {
        "Strata Florida Abbey": "Strata Florida Abbey"
    },
    {
        " followed, but eventually led to Henrys retreat.        In 1402, the English Parliament issued the ": null
    },
    {
        "Penal Laws against Wales": "Penal Laws Against Wales 1402"
    },
    {
        ", designed to establish English dominance in Wales, but actually pushing many Welshmen into the rebellion. In the same year, Owain captured his archenemy, Baron Grey de Ruthyn. He held him for almost a year until he received a substantial ransom from Henry. In June 1402, Owain defeated an English force led by Sir ": null
    },
    {
        "Edmund Mortimer": "Edmund Mortimer, Son Of The 3Rd Earl"
    },
    {
        " at the ": null
    },
    {
        "Battle of Bryn Glas": "Battle Of Bryn Glas"
    },
    {
        ", where Mortimer was captured. Glyndŵr offered to release Mortimer for a large ransom but, in sharp contrast to his attitude to de Grey, Henry IV refused to pay. Mortimers nephew could be said to have had a greater claim to the English throne than Henry himself, so his speedy release was not an option. In response, Mortimer negotiated an alliance with Owain and married one of Owains daughters. It is also in 1402 that mention of the French and ": null
    },
    {
        "Bretons": "Brittany"
    },
    {
        " helping Owain was first heard. The French were certainly hoping to use Wales as they had used Scotland: as a base from which to fight the English.     In 1403 the revolt became truly national in Wales. Royal officials reported that Welsh students at ": null
    },
    {
        "Oxford University": "Oxford University"
    },
    {
        " were leaving their studies to join Owain, and Welsh labourers and craftsmen were abandoning their employers in England and returning to Wales. Owain could also draw on Welsh troops seasoned by the English campaigns in France and Scotland. Hundreds of Welsh ": null
    },
    {
        "archers": "Archery"
    },
    {
        " and experienced ": null
    },
    {
        "men-at-arms": "Men-At-Arms"
    },
    {
        " left English service to join the rebellion.        In 1404, Owain held court at ": null
    },
    {
        "Harlech": "Harlech"
    },
    {
        " and appointed ": null
    },
    {
        "Gruffydd Young": "Gruffydd Young"
    },
    {
        " as his ": null
    },
    {
        "Chancellor": "Chancellor"
    },
    {
        ". Soon afterwards, he called his first Parliament  of all Wales at ": null
    },
    {
        "Machynlleth": "Machynlleth"
    },
    {
        ", where he was crowned ": null
    },
    {
        "Prince of Wales": "Prince Of Wales"
    },
    {
        " and announced his national programme. He declared his vision of an independent Welsh state with a parliament and separate Welsh church. There would be two national universities and a return to the ": null
    },
    {
        "traditional law": "Cyfraith Hywel"
    },
    {
        " of ": null
    },
    {
        "Hywel Dda": "Hywel Dda"
    },
    {
        ". Senior churchmen and important members of society flocked to his banner. English resistance was reduced to a few isolated castles, walled towns and ": null
    },
    {
        "fortified manor house": "Fortified Manor House"
    },
    {
        "s.            In February 1405, Owain negotiated the ": null
    },
    {
        "Tripartite Indenture": "Tripartite Indenture"
    },
    {
        " with Edmund Mortimer and ": null
    },
    {
        "Henry Percy, Earl of Northumberland": "Henry Percy, 1St Earl Of Northumberland"
    },
    {
        ". The Indenture agreed to divide England and Wales among the three of them. Wales would extend as far as the rivers ": null
    },
    {
        "Severn": "River Severn"
    },
    {
        " and ": null
    },
    {
        "Mersey": "River Mersey"
    },
    {
        ", including most of ": null
    },
    {
        "Cheshire": "Cheshire"
    },
    {
        ", ": null
    },
    {
        "Shropshire": "Shropshire"
    },
    {
        " and ": null
    },
    {
        "Herefordshire": "Herefordshire"
    },
    {
        ". The ": null
    },
    {
        "Mortimer": "Mortimer"
    },
    {
        " Lords of March would take all of southern and western England and the ": null
    },
    {
        "Percys": "House Of Percy"
    },
    {
        " would take the north of England.  R. R. Davies noted that certain internal features underscore the roots of Glyndŵrs political philosophy in Welsh mythology: in it, the three men invoke prophecy, and the boundaries of Wales are defined according to Merlinic literature.     Although negotiations with the lords of Ireland were unsuccessful, Owain had reason to hope that the French and ": null
    },
    {
        "Bretons": "Bretons"
    },
    {
        " might be more welcoming. He dispatched ": null
    },
    {
        "Gruffydd Young": "Gruffydd Young"
    },
    {
        " and his brother-in-law , John Hanmer, to negotiate with the French. The result was a formal treaty that promised French aid to Owain and the Welsh. The immediate effect seems to have been that joint Welsh and Franco-Breton forces attacked and laid siege to ": null
    },
    {
        "Kidwelly Castle": "Kidwelly Castle"
    },
    {
        ". The Welsh could also count on semi-official fraternal aid from their fellow Celts in the then independent ": null
    },
    {
        "Brittany": "Brittany"
    },
    {
        " and Scotland. Scots and French ": null
    },
    {
        "privateers": "Privateer"
    },
    {
        "were operating around Wales throughout Owains war. Scottish ships had raided English settlements on the ": null
    },
    {
        "Llŷn Peninsula": "Lleyn Peninsula"
    },
    {
        " in 1400 and 1401. In 1403, a Breton squadron defeated the English in the Channel and devastated ": null
    },
    {
        "Jersey": "Jersey"
    },
    {
        ", ": null
    },
    {
        "Guernsey": "Guernsey"
    },
    {
        " and ": null
    },
    {
        "Plymouth": "Plymouth"
    },
    {
        ", while the French made a landing on the ": null
    },
    {
        "Isle of Wight": "Isle Of Wight"
    },
    {
        ". By 1404, they were raiding the coast of England, with Welsh troops on board, setting fire to ": null
    },
    {
        "Dartmouth": "Dartmouth, Devon"
    },
    {
        " and devastating the coast of ": null
    },
    {
        "Devon": "Devon"
    },
    {
        ".     1405 was the Year of the French in Wales. A formal treaty between Wales and France was negotiated. On the continent the French pressed the English as the French army invaded English Plantagenet ": null
    },
    {
        "Aquitaine": "Aquitaine"
    },
    {
        ". Simultaneously, the French landed in force at ": null
    },
    {
        "Milford Haven": "Milford Haven"
    },
    {
        " in ": null
    },
    {
        "west Wales": "West Wales"
    },
    {
        ". They marched through Herefordshire and on into ": null
    },
    {
        "Worcestershire": "Worcestershire"
    },
    {
        ". They met the English army just ten miles from ": null
    },
    {
        "Worcester": "Worcester"
    },
    {
        ". The armies took up battle positions daily and viewed each other from a mile without any major action for eight days. Then, for reasons that have never become clear, the Welsh retreated, and so did the French shortly afterwards.          By 1405, most French forces had withdrawn after politics in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " shifted toward the peace party. Early in the year, the Welsh forces, who had until then won several easy victories, suffered a series of defeats. English forces landed in ": null
    },
    {
        "Anglesey": "Anglesey"
    },
    {
        " from Ireland and would over time push the Welsh back, until the resistance in Anglesey formally ended toward the end of 1406.     At the same time, the English changed their strategy. Rather than focusing on punitive expeditions as favoured by his father, the young Prince Henry adopted a strategy of economic blockade. Using the castles that remained in English control, he gradually began to retake Wales while cutting off trade and the supply of weapons. By 1407 this strategy was beginning to bear fruit, even though by this time Owains rebel soldiers had achieved victories over the Kings men as far as ": null
    },
    {
        "Birmingham": "Birmingham"
    },
    {
        ", where the English were in retreat. In the autumn, Owains ": null
    },
    {
        "Aberystwyth Castle": "Aberystwyth Castle"
    },
    {
        " surrendered while he was away fighting. In 1409, it was the turn of ": null
    },
    {
        "Harlech Castle": "Harlech Castle"
    },
    {
        ". Edmund Mortimer died in the final battle, and Owains wife Margaret along with two of his daughters and three of Mortimers granddaughters were imprisoned in the ": null
    },
    {
        "Tower of London": "Tower Of London"
    },
    {
        ". They were all to die in the Tower before 1415.     Owain remained free, but he had lost his ancestral home and was a hunted prince. He continued the rebellion, particularly wanting to avenge his wife. In 1410, after a suicide raid into rebel-controlled ": null
    },
    {
        "Shropshire": "Shropshire"
    },
    {
        ", which took many English lives, some of the leading rebels are thought to have been captured.     In 1412, Owain led one of the final successful raiding parties with his most faithful soldiers and cut through the Kings men; and in an ambush in ": null
    },
    {
        "Brecon": "Brecon"
    },
    {
        " he captured, and later ransomed, a leading Welsh supporter of King Henrys, ": null
    },
    {
        "Dafydd Gam": "Dafydd Gam"
    },
    {
        " . This was the last time that Owain was seen alive by his enemies. As late as 1414, there were rumours that the ": null
    },
    {
        "Herefordshire": "Herefordshire"
    },
    {
        "-based ": null
    },
    {
        "Lollard": "Lollard"
    },
    {
        " leader Sir ": null
    },
    {
        "John Oldcastle": "John Oldcastle"
    },
    {
        " was communicating with Owain, and reinforcements were sent to the major castles in the north and south.     But by then things were changing. Henry IV died in 1413 and his son ": null
    },
    {
        "King Henry V": "Henry V Of England"
    },
    {
        " began to adopt a more conciliatory attitude to the Welsh. Royal pardons were offered to the major leaders of the revolt and other opponents of his fathers regime.       Nothing certain is known of Owain after 1412. Despite enormous rewards being offered, he was neither captured nor betrayed. He ignored royal pardons. Tradition has it that he died and was buried possibly in the church of Saints Mael and Sulien at ": null
    },
    {
        "Corwen": "Corwen"
    },
    {
        " close to his home, or possibly on his estate in ": null
    },
    {
        "Sycharth": "Sycharth"
    },
    {
        " or on the estates of his daughters husbands. — ": null
    },
    {
        "Kentchurch": "Kentchurch"
    },
    {
        " in south ": null
    },
    {
        "Herefordshire": "Herefordshire"
    },
    {
        " or ": null
    },
    {
        "Monnington": "Monnington On Wye"
    },
    {
        " in west Herefordshire.        In his book The Mystery of Jack of Kent and the Fate of Owain Glyndŵr, Alex Gibbon argues that the folk hero ": null
    },
    {
        "Jack of Kent": "Jack O Kent"
    },
    {
        ", also known as ": null
    },
    {
        "Siôn Cent": "Siôn Cent"
    },
    {
        " – the family ": null
    },
    {
        "chaplain": "Chaplain"
    },
    {
        " of the Scudamore family – was in fact Owain Glyndŵr himself. Gibbon points out a number of similarities between Siôn Cent and Glyndŵr and claims that Owain spent his last years living with his daughter Alys, passing himself off as an aging ": null
    },
    {
        "Franciscan friar": "Franciscan Friar"
    },
    {
        " and family tutor.  There are many folk tales of Glyndŵr donning disguises to gain advantage over opponents during the rebellion.      ": null
    },
    {
        "Adam of Usk": "Adam Of Usk"
    },
    {
        ", a one-time supporter of Glyndŵr, made the following entry in his Chronicle under the year 1415: After four years in hiding, from the king and the realm, Owain Glyndŵr died, and was buried by his followers in the darkness of night. His grave was discovered by his enemies, however, so he had to be re-buried, though it is impossible to discover where he was laid.     In 1875, the Rev. ": null
    },
    {
        "Francis Kilvert": "Francis Kilvert"
    },
    {
        " wrote in his diary that he saw the grave of Owen Glendower in the churchyard at ": null
    },
    {
        "Monnington": "Monnington On Wye"
    },
    {
        " rd by the church porch and on the western side of it ... It is a flat stone of whitish grey shaped like a rude obelisk figure, sunk deep into the ground in the middle of an oblong patch of earth from which the turf has been pared away, and, alas, smashed into several fragments.  6 April 1875     In 2006, Adrien Jones, the president of the Owain Glyndŵr Society, said, Four years ago we visited a direct descendant of Glyndŵr, a John Skidmore, at ": null
    },
    {
        "Kentchurch Court": "Kentchurch Court"
    },
    {
        ", near ": null
    },
    {
        "Abergavenny": "Abergavenny"
    },
    {
        ". He took us to Mornington Straddle, in ": null
    },
    {
        "Herefordshire": "Herefordshire"
    },
    {
        ", where one of Glyndŵrs daughters, Alice, lived. Mr Skidmore told us that he spent his last days there and eventually died there.... It was a family secret for 600 years and even Mr. Skidmores mother, who died shortly before we visited, refused to reveal the secret. Theres even a mound where he is believed to be buried at Mornington Straddle.            Owain married ": null
    },
    {
        "Margaret Hanmer": "Margaret Hanmer"
    },
    {
        ", also known by her ": null
    },
    {
        "Welsh": "Wales"
    },
    {
        " name Marred ferch Dafydd, daughter of Sir ": null
    },
    {
        "David Hanmer": "David Hanmer"
    },
    {
        " of Hanmer, early in his life.      Owains daughter ": null
    },
    {
        "Alys": "Alys Ferch Owain Glyndŵr"
    },
    {
        " had secretly married ": null
    },
    {
        "Sir John Scudamore": "John Scudamore"
    },
    {
        ", the Kings appointed Sheriff of Herefordshire. Somehow he had weathered the rebellion and remained in office. It was rumoured that Owain finally retreated to their home at Kentchurch.   A grandchild of the Scudamores was ": null
    },
    {
        "Sir John Donne": "Sir John Donne"
    },
    {
        " of ": null
    },
    {
        "Kidwelly": "Kidwelly"
    },
    {
        ", a successful ": null
    },
    {
        "Yorkist": "Yorkist"
    },
    {
        " courtier, diplomat and soldier, who after 1485 made an accommodation with his fellow Welshman, ": null
    },
    {
        "Henry VII": "Henry Vii Of England"
    },
    {
        ". Through the Donne family, many prominent English families are descended from Owain, including the De Vere family, successive holders of the title ": null
    },
    {
        "Earl of Oxford": "Earl Of Oxford"
    },
    {
        ", and the ": null
    },
    {
        "Cavendish": "House Of Cavendish"
    },
    {
        " family .     According to Lloyd, Owain and Margaret had five sons and four or five daughters:   ": null
    },
    {
        "Gruffudd": "Gruffudd Ab Owain Glyndŵr"
    },
    {
        ", born about 1375, was captured by the English, confined in Nottingham Castle, and taken to the ": null
    },
    {
        "Tower of London": "Tower Of London"
    },
    {
        " in 1410. He died in prison of ": null
    },
    {
        "bubonic plague": "Bubonic Plague"
    },
    {
        " about 1412.   Madog   ": null
    },
    {
        "Maredudd": "Maredudd Ab Owain Glyndŵr"
    },
    {
        ", whose date of birth is unknown, was still living in 1421 when he accepted a ": null
    },
    {
        "pardon": "Pardon"
    },
    {
        ".   Thomas   John   ": null
    },
    {
        "Alys": "Alys Ferch Owain Glyndŵr"
    },
    {
        " married ": null
    },
    {
        "Sir John Scudamore": "John Scudamore"
    },
    {
        ".  She was lady of Glyndyfrdwy and Cynllaith, and heiress of the Principalities of Powys, South Wales, and Gwynedd.   Jane, who married Lord Grey de Ruthin. ": null
    },
    {
        "Croft Castle": "Croft Castle"
    },
    {
        ", in Herefordshire.   Margaret, who married Sir Richard Monnington of Monnington, in Herefordshire.     Although not named by Lloyd, a fifth daughter, ": null
    },
    {
        "Catrin": "Catrin Ferch Owain Glyndŵr"
    },
    {
        ", is recorded elsewhere. She married ": null
    },
    {
        "Sir Edmund Mortimer": "Edmund Mortimer"
    },
    {
        ", son of ": null
    },
    {
        "Edmund Mortimer, 3rd Earl of March": "Edmund Mortimer, 3Rd Earl Of March"
    },
    {
        ", and died in 1413.     Owains sons were either taken prisoner or died in battle and had no issue. Owain had additional illegitimate children: David, Gwenllian, ": null
    },
    {
        "Ieuan": "Ieuan Ab Owain Glyndŵr"
    },
    {
        ", and Myfanwy.                     After Owains death, there was little resistance to English rule. The ": null
    },
    {
        "Tudor dynasty": "Tudor Dynasty"
    },
    {
        " saw Welshmen become more prominent in English society. In  Henry IV, Part 1 , ": null
    },
    {
        "Shakespeare": "William Shakespeare"
    },
    {
        " portrays him as Owen Glendower,  wild and exotic; a man who claims to be able to call spirits from the vasty deep, ruled by magic and tradition in sharp contrast to the more logical but highly emotional Hotspur. Shakespeare further notes Glyndŵr as being not in the roll of common men and a worthy gentleman,/Exceedingly well read, and profited/ In strange concealments, valiant as a lion/And as wondrous affable and as bountiful/As mines of India. .       With his death Owain acquired a mythical status along with ": null
    },
    {
        "Cadwaladr": "Cadwaladr"
    },
    {
        ", Cynan and ": null
    },
    {
        "Arthur": "King Arthur"
    },
    {
        " as the hero awaiting the call to return and liberate his people.  ": null
    },
    {
        "Thomas Pennant": "Thomas Pennant"
    },
    {
        ", in his Tours in Wales , searched out and published many of the legends and places associated with his memory.  Previously, ": null
    },
    {
        "George Owen": "George Owen Of Henllys"
    },
    {
        ", in his A Dialogue of the present Government of Wales had written against the Cruell lawes against Welshmen made by Henrie the ffourth in his attempts to quell the revolt.  But it was not until the late 19th century that Owains reputation was revived. The ": null
    },
    {
        "Young Wales": "Cymru Fydd"
    },
    {
        " movement recreated him as the father of Welsh nationalism. The discovery of Owains Great Seal and his letters to the French in the ": null
    },
    {
        "Bibliothèque Nationale": "Bibliothèque Nationale De France"
    },
    {
        " helped revise historical images of him as a purely local leader. In the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ", the ": null
    },
    {
        "Prime Minister": "Prime Minister"
    },
    {
        ", ": null
    },
    {
        "David Lloyd George": "David Lloyd George"
    },
    {
        ", unveiled a statue to him in ": null
    },
    {
        "Cardiff City Hall": "City Hall, Cardiff"
    },
    {
        " and a postcard showing Owain at the ": null
    },
    {
        "Battle of Mynydd Hyddgen": "Battle Of Mynydd Hyddgen"
    },
    {
        " Owen GlendowerIn 1808, the Royal Navy launched a 36-gun fifth-rate frigate, which it named . She served in the Baltic Sea during the Gunboat War where she participated in the seizure of Anholt Island, and then in the Channel. Between 1822 and 1824, she served in the West Africa Squadron chasing down slave ship s, capturing at least two.     thu in a late night vision. This is one of a number of such sketches known collectively as the Visionary Heads .     He is now remembered as a national hero and numerous small groups have adopted his symbolism to advocate independence or nationalism for Wales. For example, during the 1980s, a group calling themselves Meibion Glyndŵr claimed responsibility for the burning of English holiday homes in Wales.     The creation of the National Assembly for Wales brought him back into the spotlight and in 2000 celebrations were held all over Wales to commemorate the 600th anniversary of Glyndŵrs revolt, including an historic reenactment at the Millennium National Eisteddfod of Wales, Llanelli 2000. Stamps were issued with his likeness in 1974 and 2008 and streets, parks, and public squares were named after him throughout Wales. Owains personal standard — the quartered arms of Powys and Deheubarth rampant — began to be seen all over Wales, especially at rugby union matches against the English. A campaign exists to make 16 September, the date Owain raised his standard, a public holiday in Wales. An annual award for achievement in the arts and literature, the Glyndŵr Award , is named after him. In 2007, popular Welsh musicians the Manic Street Preachers wrote a song entitled 1404 based on Owain Glyndŵr. The song can be found on the CD single for Autumnsong . A statue of Owain Glyndŵr on horseback was installed in 2007 in The Square in Corwen , Denbighshire , to commemorate his life and his lasting influence on Wales. Also located on the Square in Corwen is the Owain Glyndwr Hotel . The waymarked long distance footpath Glyndŵrs Way runs through Mid Wales near to his homelands.     Owain Glyndŵr came 2nd in the 100 Welsh Heroes poll of 2003/4.   thu by Colin Spofforth.   In 2008, Glyndŵr University was established in Wrexham , Wales. Originally established as the Wrexham School of Science and Art in 1887, it was until the name change known as the North East Wales Institute or NEWI . Glyndŵr was born and lived much of his life around Wrexham and the Welsh Marches.     Glendower Residence, at the University of Cape Town in South Africa was named after Owain Glyndŵr. The residence was opened in 1993 having previously been the Glendower Hotel. It now houses 139 male and female undergraduate students.     RGC 1404 rugby union team is named in honour of the year Owain Glyndŵr was crowned Prince of Wales .       Glyndŵr has been featured in a number of works of modern fiction, including   John Cowper Powys : ": null
    },
    {
        "Owen Glendower": "Owen Glendower"
    },
    {
        "   Edith Pargeter : A Bloody Field by Shrewsbury   Martha Rofheart : Glendower Country http://openlibrary.org/books/ia:glendowercountry00rofh/Glendowercountryanovel   Rosemary Hawley Jarman : Crown in Candlelight   Roger Zelazny : ": null
    },
    {
        "A Night in the Lonesome October": "A Night In The Lonesome October"
    },
    {
        "   Malcolm Pryce: A Dragon to Agincourt – Y Lolfa   Rhiannon Ifans: Owain Glyndŵr: Prince of Wales   Rowland Williams: Owen Glendower: A Dramatic Biography and Other Poems   T.I. Adams: The Dragon Wakes: A Novel of Wales and Owain Glyndwr   Maggie Stiefvater : The Raven Cycle fantasy novels   N. Gemini Sasson: Uneasy Lies the Crown: A Novel of Owain Glyndwr   BBC TV Series ": null
    },
    {
        "Horrible Histories": "List Of Horrible Histories Episodes"
    },
    {
        ", series 5, episode 7, features a song about Glyndŵr   Terry Breverton : Owain Glyndŵr: The Story of the Last Prince of Wales     Glyndŵr was the hero of James Hills UK TV movie Owain, Prince of Wales, broadcast in 1983 in the early days of Channel 4/S4C.     Glyndŵr appeared briefly as a past Knight of the Word and a ghost who serves the Lady in Terry Brooks s ": null
    },
    {
        "Word/Void": "Shannara"
    },
    {
        " trilogy. In the books, he is John Ross s ancestor.     Glyndŵr appeared as an agent of the Light in Susan Cooper s novel Silver on the Tree, part of ": null
    },
    {
        "The Dark is Rising Sequence": "The Dark Is Rising Sequence"
    },
    {
        ".     For a study of the various ways Glyndŵr has been portrayed in Welsh-language literature of the modern period, see E. Wyn James, Glyndŵr a Gobaith y Genedl: Agweddau ar y Portread o Owain Glyndŵr yn Llenyddiaeth y Cyfnod Modern ": null
    }
]