[
    {
        "      Osborne Earl Ozzie Smith is an American former ": null
    },
    {
        "baseball": "Baseball"
    },
    {
        " shortstop": "Shortstop"
    },
    {
        " who played in ": null
    },
    {
        "Major League Baseball": "Major League Baseball"
    },
    {
        " for the ": null
    },
    {
        "San Diego Padres": "San Diego Padres"
    },
    {
        " and ": null
    },
    {
        "St. Louis Cardinals": "St. Louis Cardinals"
    },
    {
        " from 1978 to 1996. Nicknamed The Wizard for his defensive brilliance, Smith set major league records for career ": null
    },
    {
        "assists": "Assist"
    },
    {
        " and ": null
    },
    {
        "double plays": "Double Play"
    },
    {
        " by a shortstop , as well as the ": null
    },
    {
        "National League": "National League"
    },
    {
        " record with 2,511 career games at the position; Smith won the NL ": null
    },
    {
        "Gold Glove Award": "Gold Glove Award"
    },
    {
        " for play at shortstop for 13 consecutive seasons . A 15-time ": null
    },
    {
        "All-Star": "Major League Baseball All-Star Game"
    },
    {
        ", he accumulated 2,460 ": null
    },
    {
        "hits": "Hit"
    },
    {
        " and 580 ": null
    },
    {
        "stolen bases": "Stolen Base"
    },
    {
        "during his career, and won the NL ": null
    },
    {
        "Silver Slugger Award": "Silver Slugger Award"
    },
    {
        " as the best-hitting shortstop in 1987. He was elected to the ": null
    },
    {
        "Baseball Hall of Fame": "National Baseball Hall Of Fame And Museum"
    },
    {
        " in his first year of eligibility in 2002. He was also elected to the ": null
    },
    {
        "St. Louis Cardinals Hall of Fame": "St. Louis Cardinals Hall Of Fame Museum"
    },
    {
        " in the inaugural class of 2014.     Smith was born in ": null
    },
    {
        "Mobile, Alabama": "Mobile, Alabama"
    },
    {
        ", but his family moved to ": null
    },
    {
        "Watts, Los Angeles": "Watts, Los Angeles"
    },
    {
        ", when he was six years old. While participating in childhood athletic activities, Smith developed quick reflexes; he went on to play baseball in high school and college, at Los Angeles ": null
    },
    {
        "Locke High School": "Locke High School"
    },
    {
        " and ": null
    },
    {
        "Cal Poly-San Luis Obispo": "California Polytechnic State University, San Luis Obispo"
    },
    {
        " respectively. Drafted as an amateur player by the Padres, Smith made his major league debut in 1978. He quickly established himself as an outstanding fielder, and later became known for performing backflips on special occasions while taking his position at the beginning of a game. Smith won his first Gold Glove Award in 1980, and made his first All-Star Game appearance in 1981. When conflict with Padres ownership developed, he was traded to the Cardinals for shortstop ": null
    },
    {
        "Garry Templeton": "Garry Templeton"
    },
    {
        " in 1982.     Upon joining the Cardinals, Smith helped the ": null
    },
    {
        "team": "1982 St. Louis Cardinals Season"
    },
    {
        " win the ": null
    },
    {
        "1982 World Series": "1982 World Series"
    },
    {
        ". Three years later, his game-winning ": null
    },
    {
        "home run": "Home Run"
    },
    {
        " during Game 5 of the ": null
    },
    {
        "1985 National League Championship Series": "1985 National League Championship Series"
    },
    {
        " prompted broadcaster ": null
    },
    {
        "Jack Bucks": "Jack Buck"
    },
    {
        " Go crazy, folks! play-by-play call. Despite a ": null
    },
    {
        "rotator cuff": "Rotator Cuff"
    },
    {
        " injury during the 1985 season, Smith posted career highs in multiple offensive categories in 1987. Smith continued to earn Gold Gloves and All-Star appearances on an annual basis until 1993. During 1995 season, Smith had shoulder surgery and was out nearly three months. After tension with his new manager ": null
    },
    {
        "Tony La Russa": "Tony La Russa"
    },
    {
        " developed in 1996, Smith retired at seasons end, and his uniform number was subsequently retired by the Cardinals.     Smith served as host of the television show  This Week in Baseball  from 1997 to 1998.       Smith was born in ": null
    },
    {
        "Mobile, Alabama": "Mobile, Alabama"
    },
    {
        ", the second of Clovi and Marvella Smiths six children .  While the family lived in Mobile, his father worked as a sandblaster at ": null
    },
    {
        "Brookley Air Force Base": "Brookley Air Force Base"
    },
    {
        ". ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 6 When Smith was six his family moved to the ": null
    },
    {
        "Watts": "Watts, Los Angeles, California"
    },
    {
        " section of Los Angeles. His father became a delivery truck driver for ": null
    },
    {
        "Safeway": "Safeway Inc."
    },
    {
        " stores, while his mother became an aide at a ": null
    },
    {
        "nursing home": "Nursing Home"
    },
    {
        ". His mother was an influential part of his life who stressed the importance of education and encouraged him to pursue his dreams. ": null
    },
    {
        "Eisenbath 1999": "Eis99"
    },
    {
        ": 284–285      Smith played a variety of sports in his youth, but considered baseball to be his favorite. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 8 He developed quick reflexes through various athletic and leisure activity, such as bouncing a ball off the concrete steps in front of his house, moving in closer to reduce reaction time with each throw. ": null
    },
    {
        "Smith and Rains 2002": "Smi02"
    },
    {
        ": 24 When not at the local ": null
    },
    {
        "YMCA": "Ymca"
    },
    {
        " or playing sports, Smith sometimes went with friends to the neighborhood lumberyard, springboarding off inner tubes and doing flips into sawdust piles . ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 7 In 1965, at age 10, he endured the ": null
    },
    {
        "Watts Riots": "Watts Riots"
    },
    {
        " with his family, recalling that, We had to sleep on the floor because of all the sniping and looting going on. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 4     While Smith was attending ": null
    },
    {
        "junior high school": "Middle School"
    },
    {
        ", his parents divorced. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 9 Continuing to pursue his interest in baseball, he would ride the bus for nearly an hour to reach ": null
    },
    {
        "Dodger Stadium": "Dodger Stadium"
    },
    {
        ", cheering for the ": null
    },
    {
        "Los Angeles Dodgers": "Los Angeles Dodgers"
    },
    {
        " at about 25 games a year. Upon becoming a student at ": null
    },
    {
        "Locke High School": "Locke High School"
    },
    {
        ", Smith played on the basketball and baseball teams. Smith was a teammate of future ": null
    },
    {
        "National Basketball Association": "National Basketball Association"
    },
    {
        " player ": null
    },
    {
        "Marques Johnson": "Marques Johnson"
    },
    {
        " on the basketball team, and a teammate of future fellow Hall-of-Fame player ": null
    },
    {
        "Eddie Murray": "Eddie Murray"
    },
    {
        " on the baseball side. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 9–10 After high school Smith attended ": null
    },
    {
        "Cal Poly San Luis Obispo": "California Polytechnic State University"
    },
    {
        " in 1974 on a partial academic scholarship, and managed to ": null
    },
    {
        "walk-on": "Walk-On"
    },
    {
        " to the ": null
    },
    {
        "baseball team": "Cal Poly Mustangs Baseball"
    },
    {
        ".  In addition to his academic education, he learned to ": null
    },
    {
        "switch-hit": "Switch Hitter"
    },
    {
        " from Cal Poly coach Berdy Harr. Lang, Dave. There is Only 1 Ozzie Smith. St. Louis Cardinals Official 1993 Yearbook. 1993. 17 When Cal Polys starting shortstop broke his leg midway through the 1974 season, Smith subsequently took over the starting role. Later named an All-American athlete, he established school records in career ": null
    },
    {
        "at bats": "At Bat"
    },
    {
        " and career ": null
    },
    {
        "stolen bases": "Stolen Base"
    },
    {
        " before graduating in 1977.            Smith was playing semi-professional baseball in ": null
    },
    {
        "Clarinda, Iowa": "Clarinda, Iowa"
    },
    {
        ", when in June 1976 he was selected in the seventh round of the ": null
    },
    {
        "amateur entry draft": "1976 Major League Baseball Draft"
    },
    {
        " by the ": null
    },
    {
        "Detroit Tigers": "Detroit Tigers"
    },
    {
        ".  The parties could not agree on a contract; Smith wanted a $10,000  signing bonus, while the Tigers offered $8,500 .  Smith returned to Cal Poly for his senior year, then in the ": null
    },
    {
        "1977 draft": "1977 Major League Baseball Draft"
    },
    {
        " was selected in the fourth round by the ": null
    },
    {
        "San Diego Padres": "San Diego Padres"
    },
    {
        ", ultimately agreeing to a contract that included a $5,000 signing bonus . Smith spent his first year of professional baseball during 1977 with the Class A ": null
    },
    {
        "Walla Walla Padres": "Walla Walla Padres"
    },
    {
        " of the ": null
    },
    {
        "Northwest League": "Northwest League"
    },
    {
        ". ": null
    },
    {
        "Hummel 2007": "Hum07"
    },
    {
        ": 57–61          Smith began 1978 as a non-roster invitee to the San Diego Padres spring training camp in ": null
    },
    {
        "Yuma, Arizona": "Yuma, Arizona"
    },
    {
        ". Smith credited Padres manager ": null
    },
    {
        "Alvin Dark": "Alvin Dark"
    },
    {
        " for giving him confidence by telling reporters the shortstop job was Smiths until he proved he cant handle it. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 17 Even though Dark was fired in the middle of training camp, Smith made his ": null
    },
    {
        "Major League Baseball": "Major League Baseball"
    },
    {
        " debut on April 7, 1978. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 18      It did not take long for Smith to earn recognition in the major leagues, making what some consider his greatest fielding play only 10 games into his rookie season.  The Padres played host to the ": null
    },
    {
        "Atlanta Braves": "1978 Atlanta Braves Season"
    },
    {
        " on April 20, 1978, and with two out in the top of the fourth inning, Atlantas ": null
    },
    {
        "Jeff Burroughs": "Jeff Burroughs"
    },
    {
        " hit a ground ball up the middle.  Smith described the play by saying, He hit a ball back up the middle that everybody thought was going into center field. I instinctively broke to my left and dove behind second. As I was in the air, the ball took a bad hop and caromed behind me, but I was able to catch it with my bare hand. I hit the ground, bounced back up, and threw Burroughs out at first. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 21        During a roadtrip to ": null
    },
    {
        "Houston": "Houston"
    },
    {
        ", later in the season, Smith met a part-time usherette at the ": null
    },
    {
        "Astrodome": "Reliant Astrodome"
    },
    {
        " named Denise while making his way to the team bus outside the stadium. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 24–25 The couple developed a relationship that was sometimes long-distance in nature, and eventually decided to ": null
    },
    {
        "marry": "Marriage"
    },
    {
        ". It was also during the 1978 season that Smith introduced a signature move. Padres promotion director Andy Strasberg knew Smith could perform backflips, but that he only did them during practice before fans entered the stadium. Strasberg asked Smith to do a backflip for fans during Fan Appreciation Day on October 1, the Padres last home game of the season.  After conferring with veteran teammate ": null
    },
    {
        "Gene Tenace": "Gene Tenace"
    },
    {
        ", Smith went ahead with the backflip, and it proved to be wildly popular. Smith finished the 1978 season with a .258 batting average and .970 fielding percentage, placing second in ": null
    },
    {
        "National League Rookie of the Year": "Major League Baseball Rookie Of The Year Award"
    },
    {
        " voting to ": null
    },
    {
        "Bob Horner": "Bob Horner"
    },
    {
        ".      After working with a hitting instructor during the offseason, Smith failed to record a base hit in his first 32 at-bats of the 1979 season. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 28–31 Among players with enough at-bats to qualify for the 1979 National League Triple Crown, Smith finished the season last in batting average , home runs , and RBI . ": null
    },
    {
        "Spatz 2007": "Spa07"
    },
    {
        ": 141 Off the field, conflict developed between Padres ownership and the combination of Smith and his agent, Ed Gottlieb. The parties entered into a contract dispute before the 1980 season, and when negotiations lasted into spring training, the Padres renewed Smiths contract at his 1979 salary of $72,500 ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 34 Smiths agent told the Padres the shortstop would forgo the season to race in the Tour de France, despite the fact Smith admitted to The Break Room on 96.5 WCMF in Rochester, New York he had never heard of the Tour. Angered by the Padres attitude during those contract talks, Gottlieb took out a help-wanted ad in the ": null
    },
    {
        "San Diego Union": "The San Diego Union-Tribune"
    },
    {
        ", part of which read, Padre baseball player wants part-time employment to supplement income. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 35 When Joan Kroc, wife of Padres owner ": null
    },
    {
        "Ray Kroc": "Ray Kroc"
    },
    {
        ", publicly offered Smith a job as an assistant gardener on her estate, Smith and Gottliebs relationship with the organization deteriorated further. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 35–36     Meanwhile, Smith was winning recognition for his accomplishments on the field. In 1980, he set the single-season record for most assists by a shortstop , and began his string of 13 consecutive ": null
    },
    {
        "Gold Glove awards": "Rawlings Gold Glove Award"
    },
    {
        ". ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 37 Smiths fielding play prompted the Yuma Daily Sun to use the nickname The Wizard of Oz in a March 1981 feature article about Smith. ": null
    },
    {
        "Smith and Rains 2002": "Smi02"
    },
    {
        ": 22 While The Wizard of Oz nickname was an allusion to the ": null
    },
    {
        "1939 motion picture": "The Wizard Of Oz"
    },
    {
        " of the same name, Smith also came to be known as simply The Wizard during his playing career, as Smiths Baseball Hall of Fame plaque would later attest. ": null
    },
    {
        "Smith and Rains 2002": "Smi02"
    },
    {
        ": 25  In 1981, Smith made his first ": null
    },
    {
        "All-Star Game appearance": "1981 Major League Baseball All-Star Game"
    },
    {
        " as a reserve player.        While Smith was having problems with the Padres owners, the ": null
    },
    {
        "St. Louis Cardinals": "St. Louis Cardinals"
    },
    {
        " also found themselves unhappy with their shortstop, ": null
    },
    {
        "Garry Templeton": "Garry Templeton"
    },
    {
        ". Templetons relationship with ": null
    },
    {
        "Cardinal Nation": "Cardinal Nation"
    },
    {
        " had become increasingly strained and finally came to a head during a game at ": null
    },
    {
        "Busch Stadium": "Busch Memorial Stadium"
    },
    {
        " on August 26, 1981, when he made obscene gestures at fans, and had to be physically pulled off the field by manager ": null
    },
    {
        "Whitey Herzog": "Whitey Herzog"
    },
    {
        ". ": null
    },
    {
        "ONeill 2005": "Oneill05"
    },
    {
        ": 108 ": null
    },
    {
        "Herzog and Horrigan 1987": "Her87"
    },
    {
        ": 135–136     Given the task of overhauling the Cardinals by owner ": null
    },
    {
        "Gussie Busch": "Gussie Busch"
    },
    {
        " , Herzog was looking to trade Templeton when he was approached by Padres General Manager ": null
    },
    {
        "Jack McKeon": "Jack Mckeon"
    },
    {
        " at the 1981 ": null
    },
    {
        "baseball winter meetings": "Winter Meetings"
    },
    {
        ". ": null
    },
    {
        "Herzog and Horrigan 1987": "Her87"
    },
    {
        ": 119–120, 137 While McKeon had previously told Herzog that Smith was untouchable in any trade, the Padres were now so angry at Smiths agent Gottlieb that McKeon was willing to deal. ": null
    },
    {
        "Herzog and Horrigan 1987": "Her87"
    },
    {
        ": 137 McKeon and Herzog agreed in principle to a six-player trade, with Templeton for Smith as the centerpiece. It was then that Padres manager ": null
    },
    {
        "Dick Williams": "Dick Williams"
    },
    {
        " informed Herzog that a ": null
    },
    {
        "no-trade clause": "No-Trade Clause"
    },
    {
        " had been included in Smiths 1981 contract. ": null
    },
    {
        "Herzog and Pitts 1999": "Her99"
    },
    {
        ": 92–93 Upon learning of the trade, Smiths initial reaction was to invoke the clause and stay in ": null
    },
    {
        "San Diego": "San Diego"
    },
    {
        ", but he was still interested to hear what the Cardinals had to say. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 51 While the deal for the players beside Templeton and Smith went through, Herzog flew to San Diego to meet with Smith and Gottlieb over the Christmas holiday. ": null
    },
    {
        "Herzog and Horrigan 1987": "Her87"
    },
    {
        ": 138 Smith later recalled that, Whitey told me that with me playing shortstop for the St. Louis Cardinals, we could win the pennant. He made me feel wanted, which was a feeling I was quickly losing from the Padres. The mere fact that Whitey would come all the way out there to talk to us was more than enough to convince me that St. Louis was the place I wanted to be. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 52           On December 10, 1981, the Padres traded him along with a player to be named later and ": null
    },
    {
        "Steve Mura": "Steve Mura"
    },
    {
        " to the Cardinals for a player to be named later, ": null
    },
    {
        "Sixto Lezcano": "Sixto Lezcano"
    },
    {
        " and ": null
    },
    {
        "Garry Templeton": "Garry Templeton"
    },
    {
        ". The teams completed the trade on February 19, 1982, with the Padres sending ": null
    },
    {
        "Al Olmsted": "Al Olmsted"
    },
    {
        " to the Cardinals, and St. Louis sending ": null
    },
    {
        "Luis DeLeon": "Luis Deleon"
    },
    {
        " to the Padres.  ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 57 Herzog believed Smith could improve his offensive production by hitting more ground balls, and subsequently created a motivational tool designed to help Smith concentrate on that task. ": null
    },
    {
        "Smith and Rains 2002": "Smi02"
    },
    {
        ": 28–29 Approaching Smith one day during spring training, Herzog said, Every time you hit a fly ball, you owe me a buck. Every time you hit a ground ball, I owe you a buck. Well keep that going all year. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 61 Smith agreed to the wager, and by the end of the season had won close to $300 from Herzog. As the ": null
    },
    {
        "1982 season": "1982 St. Louis Cardinals Season"
    },
    {
        " got underway, Herzogs newly assembled team won 12 games in a row during the month of April, and finished the season atop the National League East division.  ": null
    },
    {
        "Leach 2008": "Lea08"
    },
    {
        ": 37 Herzog would later say of Smiths contributions that, If he saved two runs a game on defense, which he did many a night, it seemed to me that was just as valuable to the team as a player who drove in two runs a game on offense. ": null
    },
    {
        "Smith and Rains 2002": "Smi02"
    },
    {
        ": 6     Smith became a father for the first time during the 1982 season with the birth of his son O.J., today known as ": null
    },
    {
        "Nikko": "Nikko Smith"
    },
    {
        ", on April 28. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 65 Smith also developed a lasting friendship with teammate ": null
    },
    {
        "Willie McGee": "Willie Mcgee"
    },
    {
        " during the season, and Smith said he likes to think he helped Willie get over some of the rough spots of adjusting to the major leagues . ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 66 Smith later participated in the postseason for the first time when the ": null
    },
    {
        "Cardinals": "1982 St. Louis Cardinals Season"
    },
    {
        " faced the ": null
    },
    {
        "Atlanta Braves": "1982 Atlanta Braves Season"
    },
    {
        " in the best-of-five ": null
    },
    {
        "1982 National League Championship Series": "1982 National League Championship Series"
    },
    {
        " . Smith drove in the series first run by hitting a ": null
    },
    {
        "sacrifice fly": "Sacrifice Fly"
    },
    {
        " that scored McGee in Game 1, ultimately going five for nine in St. Louis three-game series sweep.      Just as Herzog had predicted when he told Smith the Cardinals would win the pennant with him on the team, Smith found himself as the teams starting shortstop in the best-of-seven ": null
    },
    {
        "1982 World Series": "1982 World Series"
    },
    {
        " against the ": null
    },
    {
        "Milwaukee Brewers": "1982 Milwaukee Brewers Season"
    },
    {
        ". During the contest Smith scored three runs, had five hits, and did not commit an error in the field. ": null
    },
    {
        "Rains 2003": "Rai03"
    },
    {
        ": 105 When St. Louis was trailing 3–1 with one out in the sixth inning of ": null
    },
    {
        "Game 7": "1982 World Seriesgame 7"
    },
    {
        ", Smith started a rally with a base hit to left field, eventually scoring the first of the teams three runs that inning.  The Cardinals scored two more runs in the 8th inning for a 6-3 win and the championship.     After the World Series championship, Smith and the Cardinals agreed on a new contract in January 1983 that paid Smith $1 million per year. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 81 Smith was voted in as the National Leagues starting shortstop in the ": null
    },
    {
        "All-Star Game": "1983 Major League Baseball All-Star Game"
    },
    {
        " for the first time in 1983, and at seasons end won a fourth consecutive Gold Glove Award. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 87 During July of the 1984 season, Smith went on the ": null
    },
    {
        "disabled list": "Disabled List"
    },
    {
        " with a broken wrist after being hit by a pitch during a game against the Padres. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 95  Smiths return to the lineup a month later was not enough to propel the Cardinals to a postseason berth.               In 1985, Smith amassed a .276 batting average, 31 stolen bases, and 591 assists in the field. The Cardinals as a team won 101 games during the season and earned another postseason berth.  Facing the ": null
    },
    {
        "Los Angeles Dodgers": "1985 Los Angeles Dodgers Season"
    },
    {
        " in the now best-of-seven ": null
    },
    {
        "NLCS": "1985 National League Championship Series"
    },
    {
        ", a split of the first four games set the stage for ": null
    },
    {
        "Game 5": "1985 Nlcsgame 5"
    },
    {
        " at Busch Stadium. With the score tied at two runs apiece in the bottom of the ninth inning, Dodgers manager ": null
    },
    {
        "Tommy Lasorda": "Tommy Lasorda"
    },
    {
        " called upon closer ": null
    },
    {
        "Tom Niedenfuer": "Tom Niedenfuer"
    },
    {
        " to pitch. Smith batted left-handed against Niedenfuer with one out. Smith, who had never hit a home run in his previous 3,009 left-handed major league at-bats, pulled an inside fastball down the right-field line for a walk-off home run, ending Game 5 in a 3–2 Cardinals victory. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 130 Smith said, I was trying to get an extra-base hit and get into scoring position. Fortunately, I was able to get the ball up. The home run not only prompted broadcaster ": null
    },
    {
        "Jack Bucks": "Jack Buck"
    },
    {
        " Go crazy folks play-by-play call, but was also later voted the greatest moment in Busch Stadium history by Cardinals fans.       After Smiths teammate ": null
    },
    {
        "Jack Clark": "Jack Clark"
    },
    {
        " hit a late-inning home run of his own in Game 6 to defeat the Dodgers, the Cardinals moved on to face the ": null
    },
    {
        "Kansas City Royals": "1985 Kansas City Royals Season"
    },
    {
        " in the ": null
    },
    {
        "1985 World Series": "1985 World Series"
    },
    {
        ". Once again sportswriters were quick to draw attention to Smiths outstanding defensive play instead of his 2 for 23 effort at the plate. ": null
    },
    {
        "Schoor 1990": "Sch90"
    },
    {
        ": 362 ": null
    },
    {
        "Schoor 1990": "Sch90"
    },
    {
        ": 418 After the Cardinals took a three-games-to-two advantage, a controversial ": null
    },
    {
        "Game 6": "1985 World Seriesgame 6"
    },
    {
        " call by umpire ": null
    },
    {
        "Don Denkinger": "Don Denkinger"
    },
    {
        " overshadowed the remainder of the Series . ": null
    },
    {
        "Nemec and Wisnia 2002": "Nem02"
    },
    {
        ": 433     What was not publicly known during the regular season and playoffs was that Smith had torn his ": null
    },
    {
        "rotator cuff": "Rotator Cuff"
    },
    {
        " after suffering an impingement in his right shoulder during the July 11–14 homestand against the Padres. ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 121  After suffering the impingement diving back into first base on a ": null
    },
    {
        "pickoff": "Pickoff"
    },
    {
        " throw, Smith altered his throwing motion to such a degree that the rotator cuff tear subsequently developed. The 510 , 180-pound Smith opted to forgo surgery and instead built up his arm strength via weightlifting, playing through whatever pain he encountered. Said Smith, I didnt tell anybody about the injury, because I wanted to keep playing and didnt want anybody thinking they could run on me or take advantage of the injury. I tried to do almost everything, except throw a baseball, left-handed: opening a door, turning on the radio—everything. It didnt get any better, but it was good enough that I didnt have to have surgery. ": null
    },
    {
        "Smith and Rains 2002": "Smi02"
    },
    {
        ": 43     Because of his injury, Smith let his then four-year-old son Nikko perform his traditional Opening Day backflip before the Cardinals first home game of the 1986 season. ": null
    },
    {
        "Rains and Reid 2002": "Rai02"
    },
    {
        ": 111 Smith made an eye-popping play later that season on August 4, during a game against the ": null
    },
    {
        "Philadelphia Phillies": "1986 Philadelphia Phillies Season"
    },
    {
        " at Busch Stadium. In the top of the ninth inning, Phillies pinch-hitter ": null
    },
    {
        "Von Hayes": "Von Hayes"
    },
    {
        " hit a short fly ball to left field, which was pursued by both Smith and left fielder ": null
    },
    {
        "Curt Ford": "Curt Ford"
    },
    {
        ". ": null
    },
    {
        "Hummel 2007": "Hum07"
    },
    {
        ": 85–87 Running with his back to home plate, Smith dove forward, simultaneously catching the ball while parallel to the ground and flying over the diving Ford, avoiding a collision by inches. St. Louis Cardinals 2005 Media Guide. Hadler Printing, 2005. C-26.            After hitting in either the second or eighth spot in the batting order for most of his time in St. Louis, Herzog made Smith the number-two hitter full-time during the 1987 season. ": null
    },
    {
        "Herzog and Pitts 1999": "Her87"
    },
    {
        ": 95 Over the course of the year, Smith accrued a .303 ": null
    },
    {
        "batting average": "Batting Average"
    },
    {
        ", 43 stolen bases, 75 ": null
    },
    {
        "RBI": "Runs Batted In"
    },
    {
        "s, 104 ": null
    },
    {
        "runs": "Run"
    },
    {
        " scored, and 40 ": null
    },
    {
        "doubles": "Double"
    },
    {
        ", good enough to earn him the ": null
    },
    {
        "Silver Slugger Award": "Silver Slugger Award"
    },
    {
        " at shortstop": "List Of Nl Silver Slugger Winners At Shortstop"
    },
    {
        ". In addition to winning the Gold Glove Award at shortstop for the eighth consecutive time, Smith posted a career-high ": null
    },
    {
        "on-base percentage": "On-Base Percentage"
    },
    {
        " of .392. Smith was also the leading vote-getter in the ": null
    },
    {
        "1987 All-Star Game": "1987 Major League Baseball All-Star Game"
    },
    {
        ". ": null
    },
    {
        "Smith and Rains 1988": "Smi88"
    },
    {
        ": 160 The Cardinals earned a postseason berth with 95 wins, and subsequently faced the ": null
    },
    {
        "San Francisco Giants": "1987 San Francisco Giants Season"
    },
    {
        " in the ": null
    },
    {
        "1987 National League Championship Series": "1987 National League Championship Series"
    },
    {
        ".  Smith contributed a triple during the series, and the Cardinals won the contest in seven games. ": null
    },
    {
        "Nemec and Wisnia 2002": "Nem02"
    },
    {
        ": 441     The ": null
    },
    {
        "1987 World Series": "1987 World Series"
    },
    {
        " matched the ": null
    },
    {
        "Cardinals": "1987 St. Louis Cardinals Season"
    },
    {
        " against the American League champion ": null
    },
    {
        "Minnesota Twins": "1987 Minnesota Twins Season"
    },
    {
        ". The home team won every game of the contest, as Minnesota won the series. ": null
    },
    {
        "Schoor 1990": "Sch90"
    },
    {
        ": 370–371 In 28 at-bats during the Series, Smith scored three runs and had two RBIs. Smith finished second in ": null
    },
    {
        "MVP": "Major League Baseball Most Valuable Player Award"
    },
    {
        " balloting to ": null
    },
    {
        "Andre Dawson": "Andre Dawson"
    },
    {
        ", who had played on the last-place ": null
    },
    {
        "Chicago Cubs": "1987 Chicago Cubs Season"
    },
    {
        ", largely because Smith and teammate ": null
    },
    {
        "Jack Clark": "Jack Clark"
    },
    {
        " split the first-place vote.  Following the 1987 season, Smith was awarded the largest contract in the ": null
    },
    {
        "National League": "National League"
    },
    {
        " at $2,340,000.      While the team did not see the postseason for the remainder of the decade, Smith continued to rack up All-Star appearances and Gold Gloves. Combined with the attention he received from his contract, Smith continued to be a national figure. Known as a savvy dresser, he made the April 1988 cover of  GQ  magazine. Boswell, Thomas. The Wizardry of Ozzie Smith. GQ. April 1988. Smith was witness to change within the Cardinal organization when owner ": null
    },
    {
        "Gussie Busch": "Gussie Busch"
    },
    {
        " died in 1989 and Herzog quit as manager during the 1990 season.  ": null
    },
    {
        "Hummel 2007": "Hum07"
    },
    {
        ": 121–123             ": null
    },
    {
        "Joe Torre": "Joe Torre"
    },
    {
        " became Smiths new manager in 1990, but the team did not reach the postseason during Torres nearly five-year tenure. ": null
    },
    {
        "Rains 2003": "Rai03"
    },
    {
        ": 251–252 While the Cardinals celebrated their 100th anniversary in 1992, Smith marked milestones of his own, stealing his 500th career base on April 26, then notching a triple on May 26 in front of the home crowd for his 2,000th hit. ": null
    },
    {
        "Rains 2003": "Rai03"
    },
    {
        ": 251 ": null
    },
    {
        "St. Louis": "1992 St. Louis Cardinals Season"
    },
    {
        " had a one-game lead in the National League East division on June 1, 1992, but injuries took their toll on the team, including Smiths two-week illness in late July after contracting ": null
    },
    {
        "chicken pox": "Chicken Pox"
    },
    {
        " for the first time.  As a testament to his national visibility during this time, Smith appeared in a 1992 episode of  The Simpsons  titled ": null
    },
    {
        "Homer at the Bat": "Homer At The Bat"
    },
    {
        " .  Smith became a free agent for the first time in his career on November 2, 1992, only to sign a new contract with the Cardinals on December 6.      Smith won his final Gold Glove in 1992, and his 13 consecutive Gold Gloves at ": null
    },
    {
        "shortstop": "List Of Nl Gold Glove Winners At Shortstop"
    },
    {
        " in the National League has yet to be matched.  The 1993 season marked the only time between 1981 and 1996 that Smith failed to make the All-Star team, and Smith finished the 1993 season with a .288 batting average and .974 fielding percentage. He appeared in 98 games during the ": null
    },
    {
        "strike-shortened": "1994–95 Major League Baseball Strike"
    },
    {
        " 1994 season, and later missed nearly three months of the 1995 season after shoulder surgery on May 31.   Smith was recognized for his community service efforts with the ": null
    },
    {
        "1994 Branch Rickey Award": "Branch Rickey Award"
    },
    {
        " and the ": null
    },
    {
        "1995 Roberto Clemente Award": "Roberto Clemente Award"
    },
    {
        ". In February 1994, Smith took on the role of honorary chairman and official spokesman for the Missouri Governors Council on Physical Fitness and Health.        As Smith entered the 1996 season, he finalized a divorce from his wife Denise during the first half of the year.  ": null
    },
    {
        "Rains and Reid 2002": "Rai02"
    },
    {
        ": 110 Meanwhile, manager ": null
    },
    {
        "Tony La Russa": "Tony La Russa"
    },
    {
        " began his first season with the Cardinals in tandem with a new ownership group. After General Manager ": null
    },
    {
        "Walt Jocketty": "Walt Jocketty"
    },
    {
        " acquired shortstop ": null
    },
    {
        "Royce Clayton": "Royce Clayton"
    },
    {
        " during the offseason, La Russa emphasized an open competition for the spot that would give the Cardinals the best chance to win. ": null
    },
    {
        "Rains 2009": "Rai09"
    },
    {
        ": 183–184 When spring training concluded, Smith had amassed a .288 batting average and zero errors in the field, and Clayton batted .190 with eight errors. Smith believed he had earned the position with his spring training performance, but La Russa disagreed, and awarded Clayton the majority of playing time in the ": null
    },
    {
        "platoon situation": "Platoon System"
    },
    {
        " that developed, where Smith typically saw action every third game. ": null
    },
    {
        "Rains 2009": "Rai09"
    },
    {
        ": 187 La Russa said, I think its fair to say he misunderstood how he compared to Royce in spring training ... When I and the coaches evaluated the play in spring training—the whole game—Royce started very slowly offensively and you could see him start to get better. By what he was able to do defensively and on the bases, Royce deserved to play the majority of the games. ": null
    },
    {
        "Rains 2009": "Rai09"
    },
    {
        ": 185–186     Smith missed the first month of the season with a ": null
    },
    {
        "hamstring": "Hamstring"
    },
    {
        " injury, and continued to harbor ill feelings toward La Russa that had developed after spring training ended. ": null
    },
    {
        "Rains 2009": "Rai09"
    },
    {
        ": 186–187 In a closed-door meeting in mid-May, La Russa asked Smith if he would like to be traded. Instead, Smith and his agent negotiated a compromise with Cardinals management, agreeing to a buyout of special provisions in his contract in conjunction with Smith announcing his retirement. The agreement prompted a press conference at Busch Stadium on June 19, 1996, during which Smith announced he would retire from baseball at seasons end. ": null
    },
    {
        "Rains 2003": "Rai03"
    },
    {
        ": 252        As Smith made his final tour of the National League, he was honored by many teams, and received a standing ovation at the ": null
    },
    {
        "1996 All-Star Game": "1996 Major League Baseball All-Star Game"
    },
    {
        " in Philadelphia. Between June 19 and September 1, Smiths batting average increased from .239 to .286.  On September 2 Smith tied a career high by scoring four runs, one of which was a home run, and another on a close play at ": null
    },
    {
        "home plate": "Home Plate"
    },
    {
        " in the bottom of the 10th inning against division leader ": null
    },
    {
        "Houston": "1996 Houston Astros Season"
    },
    {
        ". ": null
    },
    {
        "Hummel 2007": "Hum07"
    },
    {
        ": 129–135 The victory moved the ": null
    },
    {
        "Cardinals": "1996 St. Louis Cardinals Season"
    },
    {
        " to within a half game of Houston in the ": null
    },
    {
        "National League Central Division": "National League Central"
    },
    {
        ", and the Cardinals went on to win the division by six games.  The Cardinals held a special ceremony at Busch Stadium on September 28, 1996, before a game against the ": null
    },
    {
        "Cincinnati Reds": "1996 Cincinnati Reds Season"
    },
    {
        ", honoring Smith by retiring his uniform number. Noted for his ritual backflip before Opening Days, All-Star Games, and postseason games, Smith chose this occasion to perform it for one of the last times.     In the postseason, the Cardinals first faced the ": null
    },
    {
        "San Diego Padres": "1996 San Diego Padres Season"
    },
    {
        " in the ": null
    },
    {
        "1996 National League Division Series": "1996 National League Division Series"
    },
    {
        ". After sitting out Game  1, Smith got the start in Game  2 at Busch Stadium, helping his team go up two games in the series by notching a run, a hit and two walks at the plate, along with an assist and a putout in the field.  The Cardinals then swept the series by winning Game  3 in San Diego.     The Cardinals faced the ": null
    },
    {
        "Atlanta Braves": "1996 Atlanta Braves Season"
    },
    {
        " in the ": null
    },
    {
        "1996 National League Championship Series": "1996 National League Championship Series"
    },
    {
        ". Smith started Game 1 and subsequently registered three putouts and one assist in the field, but went hitless in four at-bats in the Cardinals 4–2 loss.  The Cardinals then won Games 2, 3, and 4, contests in which Smith did not appear.    Upon receiving the start in Game 5, Smith nearly duplicated his Game 1 performance with four putouts, one assist, and zero hits in four at-bats as part of another Cardinals defeat.  The Cardinals also failed to win Game 6 or Game 7 in Atlanta, ending their season.  When the Cardinals were trailing by 10 runs during Game 7 on October 17, Smith flied out to right field while pinch-hitting in the sixth inning, marking the end of his playing career.      Smith finished his career with distinctions ranging from the accumulation of more than 27.5 million votes in All-Star balloting, to holding the record for the most MLB at-bats without hitting a ": null
    },
    {
        "grand slam": "Grand Slam"
    },
    {
        ".        Upon retirement, Smith took over for ": null
    },
    {
        "Mel Allen": "Mel Allen"
    },
    {
        " as the host of the television series  This Week in Baseball   in 1997.  Smith also became ": null
    },
    {
        "color commentator": "Color Commentator"
    },
    {
        " for the local broadcast of Cardinals games on ": null
    },
    {
        "KPLR-TV": "Kplr-Tv"
    },
    {
        " from 1997 to 1999. Robinson, Tom. Ozzie Puts Down Glove, Picks Up Mike. The Virginian-Pilot. May 22, 1997: C1. Retrieved on December 28, 2007. When his stint on This Week in Baseball concluded, Smith then moved on to do work for ": null
    },
    {
        "CNN-SI": "Cnn Sports Illustrated"
    },
    {
        " beginning in 1999. ": null
    },
    {
        "Rains and Reid 2002": "Rai02"
    },
    {
        ": 109 After La Russa retired as manager of the Cardinals in 2011, Smith became active in the organization again, starting with his stint as a special instructor for the teams 2012 spring training camp.           On January 8, 2002 Smith learned via a phone call he had been elected to the ": null
    },
    {
        "Baseball Hall of Fame": "National Baseball Hall Of Fame And Museum"
    },
    {
        " on his first ballot by receiving 91.7% of the votes cast. ": null
    },
    {
        "Rains and Reid 2002": "Rai02"
    },
    {
        ": 107  As it happened, the ": null
    },
    {
        "Olympic torch": "Olympic Torch"
    },
    {
        " was passing through St. Louis on its way to ": null
    },
    {
        "Salt Lake City": "Salt Lake City"
    },
    {
        " for the ": null
    },
    {
        "2002 Winter Olympics": "2002 Winter Olympics"
    },
    {
        ", and Smith served as a torchbearer in a ceremony with ": null
    },
    {
        "St. Louis Rams": "St. Louis Rams"
    },
    {
        " quarterback ": null
    },
    {
        "Kurt Warner": "Kurt Warner"
    },
    {
        " that evening. ": null
    },
    {
        "Smith and Rains 2002": "Smi02"
    },
    {
        ": 18–19 Smith was inducted into the Hall of Fame during ceremonies on July 28, 2002. During his speech, he compared his baseball experiences with the characters from the novel  The Wonderful Wizard of Oz , after which his son Dustin presented his Hall of Fame plaque.  Days later on August 11, Smith was back at ": null
    },
    {
        "Busch Memorial Stadium": "Busch Memorial Stadium"
    },
    {
        " for the unveiling of a statue in his likeness made by sculptor ": null
    },
    {
        "Harry Weber": "Harry Weber"
    },
    {
        ".  Weber chose to emphasize Smiths defensive skills by showing Smith stretched horizontal to the ground while fielding a baseball. At the ceremony Weber told Smith, You spent half of your career up in the air. That makes it difficult for a sculptor to do something with it.     Smith has also been an entrepreneur in a variety of business ventures. Smith opened Ozzies restaurant and sports bar in 1988, started a youth sports academy in 1990, became an investor in a grocery store chain in 1999, and partnered with David Slay to open a restaurant in the early 2000s.  ": null
    },
    {
        "Rains and Reid 2002": "Rai02"
    },
    {
        ": 113   Of those businesses the youth academy remains in operation, with the restaurant having closed in 2010 after changing ownership and locations once.   Aside from appearing in numerous radio and television commercials in the St. Louis area since retiring from baseball, Smith authored a childrens book in 2006 and launched his own brand of salad dressing in 2008.      Besides the National Baseball Hall of Fame, Smith has been also inducted or honored in other halls of fame and recognitions. In 1999, he ranked number  87 on  The Sporting News list of the 100 Greatest Baseball Players, http://www.baseball-almanac.com/legendary/lisn100.shtml and finished third in voting at shortstop for the Major League Baseball All-Century Team . Smith 1998 : 189 He was honored with induction into the Missouri Sports Hall of Fame , Alabama Sports Hall of Fame and the St. Louis Walk of Fame , and received an honorary Doctor of Humane Letters degree from Cal Poly. In January 2014, the Cardinals announced Smith among 22 former players and personnel to be inducted into the St. Louis Cardinals Hall of Fame Museum for the inaugural class of 2014 .                       Smith is the father to three children from his marriage to former wife Denise; sons Nikko and Dustin, and daughter Taryn. Smith remains a visible figure around the St. Louis area, making varied appearances like playing the role of the Wizard in the St. Louis Municipal Opera s summer 2001 production of The Wizard of Oz. Rains and Reid 2002 : 114 Smith cheered on his son Nikko as he cracked the top 10 finalists of the 2005 edition of ": null
    },
    {
        "American Idol": "American Idol"
    },
    {
        ". Wald, Jaina. When its Idol time at Ozzies, folks go crazy for Nikko . St. Louis Post-Dispatch. April 6, 2005. E3. Retrieved on 2008-03-19. In 2012, Smith made news headlines again, when he sold all of his Gold Gloves at auction together for more than $500,000. ": null
    }
]