[
    {
        "              Phase Alternating Line  is a colour encoding system for ": null
    },
    {
        "analogue television": "Analog Television"
    },
    {
        " used in broadcast television systems in most countries broadcasting at 625-line / 50 field per second . It was one of three major analogue colour television standards, the others being ": null
    },
    {
        "NTSC": "Ntsc"
    },
    {
        " and ": null
    },
    {
        "SECAM": "Secam"
    },
    {
        ".     All the countries using PAL are currently in the ": null
    },
    {
        "process of conversion": "Digital Television Transition"
    },
    {
        ", or have already converted standards to ": null
    },
    {
        "DVB": "Digital Video Broadcasting"
    },
    {
        ", ": null
    },
    {
        "ISDB": "Isdb"
    },
    {
        " or ": null
    },
    {
        "DTMB": "Dtmb"
    },
    {
        ".     This page primarily discusses the PAL colour encoding system. The articles on ": null
    },
    {
        "broadcast television systems": "Broadcast Television Systems"
    },
    {
        " and analogue television further describe frame rates, image resolution and audio modulation.       PAL was adopted by all European countries, by all of Africa that had never been a ": null
    },
    {
        "French colony": "French Colonial Empire"
    },
    {
        ", by ": null
    },
    {
        "Argentina": "Argentina"
    },
    {
        ", ": null
    },
    {
        "Brazil": "Brazil"
    },
    {
        ", ": null
    },
    {
        "Paraguay": "Paraguay"
    },
    {
        ", and ": null
    },
    {
        "Uruguay": "Uruguay"
    },
    {
        ", by all of ": null
    },
    {
        "Asia": "Asia"
    },
    {
        ", and by ": null
    },
    {
        "Oceania": "Oceania"
    },
    {
        ".     There were some countries in those regions that did not adopt PAL. They were ": null
    },
    {
        "France": "France"
    },
    {
        ", ": null
    },
    {
        " countries": "Commonwealth Of Independent States"
    },
    {
        " that once were part of the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ", ": null
    },
    {
        "Japan": "Japan"
    },
    {
        ", ": null
    },
    {
        "Myanmar": "Myanmar"
    },
    {
        ", the ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        ", and ": null
    },
    {
        "Taiwan": "Taiwan"
    },
    {
        ".       In the 1950s, the Western European countries began plans to introduce colour television, and were faced with the problem that the ": null
    },
    {
        "NTSC": "Ntsc"
    },
    {
        " standard demonstrated several weaknesses, including colour tone shifting under poor transmission conditions, which became a major issue considering Europes geographical and weather-related particularities. To overcome NTSCs shortcomings, alternative standards were devised, resulting in the development of the PAL and SECAM standards. The goal was to provide a colour TV standard for the European picture frequency of 50 ": null
    },
    {
        "fields": "Field"
    },
    {
        " per second , and finding a way to eliminate the problems with NTSC.     PAL was developed by ": null
    },
    {
        "Walter Bruch": "Walter Bruch"
    },
    {
        " at ": null
    },
    {
        "Telefunken": "Telefunken"
    },
    {
        " in Hanover, ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        ", with important input from Dr. Kruse and . The format was patented by Telefunken in 1962, citing Bruch as inventor, and unveiled to members of the ": null
    },
    {
        "European Broadcasting Union": "European Broadcasting Union"
    },
    {
        " on 3 January 1963. When asked why the system was named PAL and not Bruch the inventor answered that a Bruch system would probably not have sold very well . The first broadcasts began in the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        " in June 1967, followed by West Germany later that year. The standard that defines the PAL system was last published by the ": null
    },
    {
        "International Telecommunication Union": "International Telecommunication Union"
    },
    {
        " in 1998 and has the title  The one BBC channel initially using the broadcast standard was ": null
    },
    {
        "BBC2": "Bbc Two"
    },
    {
        ", which had been the first UK TV service to introduce 625-lines in 1964. Telefunken PALcolour 708T was the first PAL commercial TV set. It was followed by Loewe-Farbfernseher S 920 & F 900.     Telefunken was later bought by the French electronics manufacturer ": null
    },
    {
        "Thomson": "Technicolour Sa"
    },
    {
        ". Thomson also bought the Compagnie Générale de Télévision where ": null
    },
    {
        "Henri de France": "Henri De France"
    },
    {
        " developed SECAM, the first ": null
    },
    {
        "European Standard": "European Committee For Standardization"
    },
    {
        " for colour television. Thomson, now called Technicolour SA, also owns the ": null
    },
    {
        "RCA brand": "Rca"
    },
    {
        " and licences it to other companies; ": null
    },
    {
        "Radio Corporation of America": "Rca"
    },
    {
        ", the originator of that brand, created the NTSC colour TV standard before Thomson became involved.     The term PAL was often used informally and somewhat imprecisely to refer to the 625-line/50  Hz  television system in general, to differentiate from the 525-line/60  Hz  system generally used with NTSC. Accordingly, ": null
    },
    {
        "DVDs": "Dvd"
    },
    {
        "were labelled as PAL or NTSC even though technically the discs carry neither PAL nor NTSC encoded signal. CCIR 625/50 and EIA 525/60 are the proper names for these standards; PAL and NTSC on the other hand are methods of encoding colour information in the signal.       Both the PAL and the NTSC system use a ": null
    },
    {
        "quadrature amplitude modulated": "Quadrature Amplitude Modulation"
    },
    {
        " subcarrier": "Subcarrier"
    },
    {
        " carrying the chrominance information added to the luminance video signal to form a ": null
    },
    {
        "composite video": "Composite Video"
    },
    {
        " baseband signal. The frequency of this subcarrier is 4.43361875 ": null
    },
    {
        "MHz": "Hertz"
    },
    {
        " for PAL and NTSC 4.43, compared to 3.579545  MHz for NTSC 3.58. The SECAM system, on the other hand, uses a frequency modulation scheme on its two line alternate colour subcarriers 4.25000 and 4.40625  MHz.     The name Phase Alternating Line describes the way that the phase of part of the colour information on the video signal is reversed with each line, which automatically corrects phase errors in the transmission of the signal by cancelling them out, at the expense of vertical frame colour resolution. Lines where the colour phase is reversed compared to NTSC are often called PAL or phase-alternation lines, which justifies one of the expansions of the acronym, while the other lines are called NTSC lines. Early PAL receivers relied on the human eye to do that cancelling; however, this resulted in a comb-like effect known as ": null
    },
    {
        "Hanover bars": "Hanover Bars"
    },
    {
        " on larger phase errors. Thus, most receivers now use a chrominance ": null
    },
    {
        "analogue delay line": "Analogue Delay Line"
    },
    {
        ", which stores the received colour information on each line of display; an average of the colour information from the previous line and the current line is then used to drive the picture tube. The effect is that phase errors result in ": null
    },
    {
        "saturation": "Colourfulness"
    },
    {
        " changes, which are less objectionable than the equivalent hue changes of NTSC. A minor drawback is that the vertical colour resolution is poorer than the NTSC systems, but since the human eye also has a colour resolution that is much lower than its brightness resolution, this effect is not visible. In any case, NTSC, PAL, and SECAM all have chrominance bandwidth reduced greatly compared to the luminance signal.                      The 4.43361875  MHz frequency of the colour carrier is a result of 283.75 colour clock cycles per line plus a 25  Hz offset to avoid interferences. Since the line frequency is 15625  Hz , the colour ": null
    },
    {
        "carrier frequency": "Carrier Frequency"
    },
    {
        " calculates as follows: 4.43361875  MHz 283.75 × 15625  Hz + 25  Hz.   The frequency 50 Hz is the optional refresh frequency of the monitor to be able to create an illusion of motion, while 625 lines means the vertical lines or resolution that the PAL system supports.   The original colour ": null
    },
    {
        "carrier": "Carrier Signal"
    },
    {
        " is required by the colour decoder to recreate the ": null
    },
    {
        "colour difference": "Colour Difference"
    },
    {
        " signals. Since the carrier is not transmitted with the video information it has to be generated locally in the receiver. In order that the ": null
    },
    {
        "phase": "Phase"
    },
    {
        " of this locally generated signal can match the transmitted information, a 10 cycle burst of colour ": null
    },
    {
        "subcarrier": "Subcarrier"
    },
    {
        " is added to the video signal shortly after the line sync pulse, but before the picture information, during the so-called ": null
    },
    {
        "back porch": "Analog Televisionstructure Of A Video Signal"
    },
    {
        ". This colour burst is not actually in phase with the original colour subcarrier, but leads it by 45  degrees on the odd lines and lags it by 45  degrees on the even lines. This ": null
    },
    {
        "swinging burst": "Burst Phase"
    },
    {
        " enables the colour decoder circuitry to distinguish the phase of the R-Y vector which reverses every line.       PAL usually has 576 visible lines compared with 486 lines with ": null
    },
    {
        "NTSC": "Ntsc"
    },
    {
        ", meaning that PAL has a 20% higher resolution, in fact it even has a higher resolution than Enhanced Definition standard . Most TV output for PAL and NTSC use interlaced frames meaning that even lines update on one field and odd lines update on the next field. Interlacing frames gives a smoother motion with half the frame rate. ": null
    },
    {
        "NTSC": "Ntsc"
    },
    {
        " is used with a ": null
    },
    {
        "frame rate": "Frame Rate"
    },
    {
        " of ": null
    },
    {
        "60i": "Interlaced Video"
    },
    {
        " or ": null
    },
    {
        "30p": "Progressive Scan"
    },
    {
        " whereas PAL generally uses ": null
    },
    {
        "50i": "Interlaced Video"
    },
    {
        " or ": null
    },
    {
        "25p": "Progressive Scan"
    },
    {
        "; both use a high enough ": null
    },
    {
        "frame rate": "Frame Rate"
    },
    {
        " to give the illusion of fluid motion. This is due to the fact that NTSC is generally used in countries with a ": null
    },
    {
        "utility frequency": "Utility Frequency"
    },
    {
        " of 60  Hz and PAL in countries with 50  Hz, although there are many exceptions. Both PAL and NTSC have a higher frame rate than film which uses 24 frames per second. PAL has a closer frame rate to that of film, so most films are sped up 4% to play on PAL systems, shortening the runtime of the film and, without adjustment, slightly raising the pitch of the audio track. Film conversions for NTSC instead use ": null
    },
    {
        "3:2 pull down": "Three-Two Pull Down"
    },
    {
        " to spread the 24 frames of film across 60 interlaced fields. This maintains the runtime of the film and preserves the original audio, but may cause worse interlacing artefacts during fast motion.     NTSC receivers have a ": null
    },
    {
        "tint control": "Tint Control"
    },
    {
        " to perform colour correction manually. If this is not adjusted correctly, the colours may be faulty. The PAL standard automatically cancels ": null
    },
    {
        "hue": "Hue"
    },
    {
        " errors by phase reversal, so a tint control is unnecessary yet Saturation control can be more useful. Chrominance phase errors in the PAL system are cancelled out using a 1H delay line resulting in lower saturation, which is much less noticeable to the eye than NTSC hue errors.     However, the alternation of colour information—": null
    },
    {
        "Hanover bars": "Hanover Bars"
    },
    {
        "—can lead to picture grain on pictures with extreme phase errors even in PAL systems, if decoder circuits are misaligned or use the simplified decoders of early designs . In most cases such extreme phase shifts do not occur. This effect will usually be observed when the transmission path is poor, typically in built up areas or where the terrain is unfavourable. The effect is more noticeable on UHF than VHF signals as VHF signals tend to be more robust.     In the early 1970s some Japanese set manufacturers developed decoding systems to avoid paying royalties to ": null
    },
    {
        "Telefunken": "Telefunken"
    },
    {
        ". The Telefunken licence covered any decoding method that relied on the alternating subcarrier phase to reduce phase errors. This included very basic PAL decoders that relied on the human eye to average out the odd/even line phase errors. One solution was to use a 1H ": null
    },
    {
        "analogue delay line": "Analogue Delay Line"
    },
    {
        " to allow decoding of only the odd or even lines. For example, the chrominance on odd lines would be switched directly through to the decoder and also be stored in the delay line. Then, on even lines, the stored odd line would be decoded again. This method effectively converted PAL to NTSC. Such systems suffered hue errors and other problems inherent in NTSC and required the addition of a manual ": null
    },
    {
        "hue": "Hue"
    },
    {
        " control.     PAL and NTSC have slightly divergent ": null
    },
    {
        "colour space": "Colourimetry"
    },
    {
        "s, but the colour decoder differences here are ignored.       The ": null
    },
    {
        "SECAM": "Secam"
    },
    {
        " patents predate those of PAL by several years . Its creator, Henri de France, in search of a response to known NTSC ": null
    },
    {
        "hue": "Hue"
    },
    {
        " problems, came up with ideas that were to become fundamental to both European systems, namely:   1val|5|uMHzcite web|titlePGC categories – Countries using PAL standard|urlhttp://www.dvd-replica.com/DVD/palnations.php|url-statusdead|archiveurlhttps://web.archive.org/web/20090422030617/http://www.dvd-replica.com/DVD/palnations.php|archivedate22 April 2009val|64.000|ulµscite web |titleHorizontal Blanking Interval of 405-, 525-, 625- and 819-Line Standards |urlhttp://www.pembers.freeserve.co.uk/World-TV-Standards/HBI.pdf |url-statusdead |archiveurlhttps://web.archive.org/web/20090529195823/http://www.pembers.freeserve.co.uk/World-TV-Standards/HBI.pdf |archivedate29 May 2009 cite web|titleNTSC, PAL, and SECAM Overview|urlhttp://www.deetc.isel.ipl.pt/Analisedesinai/sm/downloads/doc/ch08.pdfval|1.65|+0.4|-0.1|uµsval|4.7|0.20|uµsval|5.7|0.20|uµsval|51.95|+0.4|-0.1|uµsval|50|uHzval|0.576|ulmscite web|titleVertical Blanking Interval of 625-Line Standard |urlhttp://www.pembers.freeserve.co.uk/World-TV-Standards/VBI-625-PAL.pdf|accessdate2015-09-03|url-statusdead|archiveurlhttps://web.archive.org/web/20160428234231/http://www.pembers.freeserve.co.uk/World-TV-Standards/VBI-625-PAL.pdf|archivedate28 April 2016      ": null
    }
]