[
    {
        "Paleomaps are ": null
    },
    {
        "maps": "Map"
    },
    {
        " of continents and mountain ranges in the past based on ": null
    },
    {
        "plate reconstructions": "Plate Reconstruction"
    },
    {
        ". Until the 1960s, paleomaps were not very satisfactory, since it was difficult to understand many quite distinctive features. For example, huge ": null
    },
    {
        "river deltas": "River Delta"
    },
    {
        " seemed to be associated with what must have been rather small drainage basins. With the discovery of ": null
    },
    {
        "plate tectonics": "Plate Tectonics"
    },
    {
        ", it became apparent that land masses move relative to one another over time. Ancient geologic features started to make far more sense. It is now possible to construct maps that are probably fairly accurate for continental positions over several hundred million years. Before the ": null
    },
    {
        "Cambrian": "Cambrian"
    },
    {
        " Period, it becomes much more difficult since there are fewer rock exposures preserved. The state of large regions of the Earth becomes unknowable in the distant past. Where rocks are exposed, latitudes can often be determined from the orientation of preserved magnetic fields  but longitudes are based on projections that are increasingly uncertain as one gets further from the present.     Many published maps are associated in one way or another with the work of ": null
    },
    {
        "Christopher Scotese": "Christopher Scotese"
    },
    {
        ". The maps are useful since it is usually quite difficult to describe the location and orientation of geographical features using words alone.       For an overview of maps available on the Internet, see .   Scotese maintains a reasonable selection of maps on his website . Several Universities post similar maps made using Scoteses software.   Another important resource is the University of Chicago PaleoGeographic Atlas Project .        ": null
    }
]