[
    {
        "   Pan-Slavism, a movement which crystallized in the mid-19th century, is the ": null
    },
    {
        "political ideology": "Political Ideology"
    },
    {
        " concerned with the advancement of integrity and unity for the ": null
    },
    {
        "Slavic-speaking people": "Slavic People"
    },
    {
        "s. Its main impact occurred in the ": null
    },
    {
        "Balkans": "Balkans"
    },
    {
        ", where non-Slavic empires had ruled the ": null
    },
    {
        "South Slavs": "South Slav"
    },
    {
        "for centuries. These were mainly the ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        ", ": null
    },
    {
        "Austria-Hungary": "Austria-Hungary"
    },
    {
        " , the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        ", and ": null
    },
    {
        "Venice": "Republic Of Venice"
    },
    {
        ".       Extensive pan-Slavism began much like ": null
    },
    {
        "Pan-Germanism": "Pan-Germanism"
    },
    {
        ", both of which grew from the sense of unity and ": null
    },
    {
        "nationalism": "Nationalism"
    },
    {
        " experienced within ": null
    },
    {
        "ethnic groups": "Ethnic Group"
    },
    {
        "after the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        " and the consequent ": null
    },
    {
        "Napoleonic Wars": "Napoleonic Wars"
    },
    {
        " against European monarchies. Like other ": null
    },
    {
        "Romantic nationalist": "Romantic Nationalism"
    },
    {
        " movements, Slavic intellectuals and scholars in the developing fields of ": null
    },
    {
        "history": "History"
    },
    {
        ", ": null
    },
    {
        "philology": "Philology"
    },
    {
        ", and ": null
    },
    {
        "folklore": "Folklore"
    },
    {
        " actively encouraged the passion of their shared identity and ancestry. Pan-Slavism also co-existed with the ": null
    },
    {
        "Southern Slavic": "South Slavs"
    },
    {
        " independence.     Commonly used symbols of the Pan-Slavic movement were the ": null
    },
    {
        "Pan-Slavic colours": "Pan-Slavic Colours"
    },
    {
        " and the Pan-Slavic anthem,  Hey, Slavs .     The first pan-Slavists were the 16th-century Croatian writer ": null
    },
    {
        "Vinko Pribojević": "Vinko Pribojević"
    },
    {
        " and the 17th-century ": null
    },
    {
        "Aleksandar Komulović": "Aleksandar Komulović"
    },
    {
        ", ": null
    },
    {
        "Bartol Kašić": "Bartol Kašić"
    },
    {
        ", ": null
    },
    {
        "Ivan Gundulić": "Ivan Gundulić"
    },
    {
        " and ": null
    },
    {
        "Croatian": "Croats"
    },
    {
        " Catholic": "Catholic Church"
    },
    {
        " missionary ": null
    },
    {
        "Juraj Križanić": "Juraj Križanić"
    },
    {
        ". John M. Letiche and Basil Dmytryshyn: Russian Statecraft: The Politika of Iurii Krizhanich , Oxford and New York, 1985 ": null
    },
    {
        "Ivo Banac": "Ivo Banac"
    },
    {
        ": , Cornell University Press, 1988, pp. 71  Some of the earliest manifestations of Pan-Slavic thought within the ": null
    },
    {
        "Habsburg Monarchy": "Habsburg Monarchy"
    },
    {
        " have been attributed to ": null
    },
    {
        "Adam Franz Kollár": "Adam František Kollár"
    },
    {
        " and ": null
    },
    {
        "Pavel Jozef Šafárik": "Pavel Jozef Šafárik"
    },
    {
        ". Robert John Weston Evans, Chapter Nationality in East-Central Europe: Perception and Definition before 1848. Austria, Hungary, and the Habsburgs: Essays on Central Europe, c.1683-1867. 2006. The movement began following the end of the Napoleonic Wars in 1815. In the aftermath, the leaders of Europe sought to restore the pre-war ": null
    },
    {
        "status quo": "Status Quo"
    },
    {
        ". At the ": null
    },
    {
        "Congress of Vienna": "Congress Of Vienna"
    },
    {
        ", Austrias representative, ": null
    },
    {
        "Prince von Metternich": "Metternich"
    },
    {
        ", felt the threat to this status quo in Austria was the nationalists demanding independence from the empire. While their subjects were composed of numerous ethnic groups , most of the subjects were Slavs.          The ": null
    },
    {
        "First Pan-Slav congress": "Prague Slavic Congress, 1848"
    },
    {
        " was held in ": null
    },
    {
        "Prague": "Prague"
    },
    {
        ", ": null
    },
    {
        "Bohemia": "Bohemia"
    },
    {
        " in June, 1848, during the ": null
    },
    {
        "revolutionary movement of 1848": "Revolutions Of 1848"
    },
    {
        ". The Czechs had refused to send representatives to the ": null
    },
    {
        "Frankfurt Assembly": "Frankfurt Assembly"
    },
    {
        " feeling that Slavs had a distinct interest from the Germans. The ": null
    },
    {
        "Austroslav": "Austroslavism"
    },
    {
        ", ": null
    },
    {
        "František Palacký": "František Palacký"
    },
    {
        ", presided over the event. Most of the delegates were Czech and Slovak. Palacký called for the co-operation of the ": null
    },
    {
        "Habsburgs": "Habsburg"
    },
    {
        "and had also endorsed the Habsburg monarchy as the political formation most likely to protect the peoples of ": null
    },
    {
        "central Europe": "Central Europe"
    },
    {
        ". When the Germans asked him to declare himself in favour of their desire for national unity, he replied that he would not as this would weaken the Habsburg state: “Truly, if it were not that ": null
    },
    {
        "Austria": "Austrian Empire"
    },
    {
        " had long existed, it would be necessary, in the interest of ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ", in the interest of ": null
    },
    {
        "humanity": "All Humanity"
    },
    {
        " itself, to create it.”     The Pan-Slav congress met during the revolutionary turmoil of 1848. Young inhabitants of Prague had taken to the streets and in the confrontation, a stray bullet had killed the wife of ": null
    },
    {
        "Field Marshal": "Field Marshal"
    },
    {
        " Alfred I, Prince of Windisch-Grätz": "Alfred I, Prince Of Windisch-Grätz"
    },
    {
        ", the commander of the Austrian forces in Prague. Enraged, Windischgrätz seized the city, disbanded the congress, and established ": null
    },
    {
        "martial law": "Martial Law"
    },
    {
        " throughout Bohemia.                  The first Pan-Slavic convention was held in Prague on June 2 through 16, 1848. See Note 134 on page 725 of the Collected Works of Karl Marx and Frederick Engels: Volume 14 . The delegates at the Congress were specifically both ": null
    },
    {
        "anti-Austrian": "Austria-Hungaryethnic Relations"
    },
    {
        " and ": null
    },
    {
        "anti-Russian": "Russificationpoland And Lithuania"
    },
    {
        ". Still the Right —the moderately liberal wing of the Congress—under the leadership of ": null
    },
    {
        "František Palacký": "František Palacký"
    },
    {
        " , a Czech historian and politician, See the biographical note on page 784 of the Collected Works of Karl Marx and Frederick Engels: Volume 14. and ": null
    },
    {
        "Pavol Jozef Šafárik": "Pavol Jozef Šafárik"
    },
    {
        " , a Slovak philologist, historian and archaeologist, See the biographical note at page 787 of the Collected Works of Karl Marx and Frederick Engels: Volume 14 favored autonomy of the Slav lands within the framework of Austrian monarchy. See Note 134 on page 725 of the Collected Works of Karl Marx and Frederick Engels: Volume 14. In contrast the Left —the radical wing of the Congress—under the leadership of ": null
    },
    {
        "Karel Sabina": "Karel Sabina"
    },
    {
        " , a Czech writer and journalist, ": null
    },
    {
        "Josef Václav Frič": "Josef Václav Frič"
    },
    {
        ", a Czech nationalist, ": null
    },
    {
        "Karol Libelt": "Karol Libelt"
    },
    {
        " , a Polish writer and politician, and others, pressed for a close alliance with the revolutionary-democratic movement going on in Germany and Hungary in 1848.     A national rebirth in the Hungarian Upper Land  awoke in a completely new light, both before the Slovak Uprising in 1848 and after. The driving force of this rebirth movement were Slovak writers and politicians who called themselves Štúrovci, the followers of ": null
    },
    {
        "Ľudovít Štúr": "Ľudovít Štúr"
    },
    {
        ". As the Slovak nobility was ": null
    },
    {
        "Magyarized": "Magyarization"
    },
    {
        " and most Slovaks were merely farmers or priests, this movement failed to attract much attention. Nonetheless, the campaign was successful as a brotherly cooperation between the Croats and the Slovaks brought its fruit throughout the war. Most of the battles between Slovaks and Hungarians however, did not turn out in favor for the Slovaks who were logistically supported by the Austrians, but not sufficiently. The shortage of manpower proved to be decisive as well.     During the war, the ": null
    },
    {
        "Slovak National Council": "Slovak National Council"
    },
    {
        " brought its demands to the young Austrian emperor, ": null
    },
    {
        "Franz Joseph I": "Franz Joseph I Of Austria"
    },
    {
        ", who seemed to take a note of it and promised support for the Slovaks against the revolutionary radical Hungarians. However the moment the revolution was over, Slovak demands were forgotten. These demands included an autonomous land within the Austrian Empire called Slovenský kraj which would be eventually led by a Serbian prince. This act of ignorance from the Emperor convinced the Slovak and the Czech elite who proclaimed the concept of Austroslavism as dead.     Disgusted by the Emperors policy, in 1849, Ľudovít Štúr, the person who codified the first official ": null
    },
    {
        "Slovak language": "Slovak Language"
    },
    {
        ", wrote a book he would name Slavdom and the World of the Future. This book served as a manifesto where he noted that Austroslavism was not the way to go anymore. He also wrote a sentence that often serves as a quote until this day: Every nation has its time under Gods sun, and the ": null
    },
    {
        "linden": "Tilia"
    },
    {
        " is blossoming, while the ": null
    },
    {
        "oak": "Oaknational_Symbol"
    },
    {
        " bloomed long ago.       He expressed confidence in the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        " however, as it was the only country of Slavs that was not dominated by anybody else, yet it was one of the most powerful nations in the world. He often symbolized Slavs as being a tree, with minor Slavic nations being branches while the trunk of the tree was Russian. His Pan-Slavic views were unleashed in this book, where he stated that the land of Slovaks should be annexed by the Tsars empire and that eventually the population could be not only ": null
    },
    {
        "Russified": "Russification"
    },
    {
        ", but also converted into the rite of ": null
    },
    {
        "Orthodoxy": "Eastern Orthodox Church"
    },
    {
        ", religion originally spread by ": null
    },
    {
        "Cyril and Methodius": "Saints Cyril And Methodius"
    },
    {
        " during the times of ": null
    },
    {
        "Great Moravia": "Great Moravia"
    },
    {
        ", which served as an opposition to the ": null
    },
    {
        "Catholic": "Catholic Church"
    },
    {
        " missionaries from the ": null
    },
    {
        "Franks": "Franks"
    },
    {
        ". After the ": null
    },
    {
        "Hungarian invasion of Pannonia": "Hungarian Conquest Of The Carpathian Basin"
    },
    {
        ", Hungarians converted into Catholicism, which effectively influenced the Slavs living in ": null
    },
    {
        "Pannonia": "Pannonia"
    },
    {
        " and in the land south of the Lechs.     However, the Russian Empire often claimed Pan-Slavism as a justification for its aggressive moves in the Balkan Peninsula of Europe against the Ottoman Empire, which conquered and held the land of Slavs for centuries. This eventually led to the ": null
    },
    {
        "Balkan campaign": "Russo-Turkish War"
    },
    {
        " of the Russian Empire, which resulted in the entire Balkan being liberated from the Ottoman Empire, with the help and the initiative of the Russian Empire. Frederick Engels, Germany and Pan-Slavism contained in the Collected Works of Karl Marx and Frederick Engels: Volume 14, pp. 156-158. Pan-Slavism has some supporters among Czech and Slovak politicians, especially among the nationalistic and far-right ones, such as Peoples Party - Our Slovakia.     During ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ", captured Slavic soldiers were asked to fight against oppression in the Austrian Empire . Consequently, some did.      The creation of an independent ": null
    },
    {
        "Czechoslovakia": "Czechoslovakia"
    },
    {
        " made the old ideals of Pan-Slavism anachronistic. Relations with other Slavic states varied, sometimes being so tense it escalated into an armed conflict, such as with the ": null
    },
    {
        "Second Polish Republic": "Second Polish Republic"
    },
    {
        " where border clashes over ": null
    },
    {
        "Silesia": "Silesia"
    },
    {
        " resulted in a short hostile conflict, the ": null
    },
    {
        "Polish–Czechoslovak War": "Polish–Czechoslovak War"
    },
    {
        ". Even tensions between Czechs and Slovaks had appeared before and during the World War II.             Pan-Slavism in the south would often turn to Russia for support.  The Southern Slavic movement advocated the independence of the Slavic peoples in the ": null
    },
    {
        "Austro-Hungarian Empire": "Austro-Hungarian Empire"
    },
    {
        ", ": null
    },
    {
        "Republic of Venice": "Republic Of Venice"
    },
    {
        " and the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        ". Some Serbian intellectuals sought to unite all of the Southern, Balkan Slavs, whether ": null
    },
    {
        "Catholic": "Catholicism"
    },
    {
        " , or ": null
    },
    {
        "Orthodox": "Orthodox Church"
    },
    {
        " , ": null
    },
    {
        "Bulgarians": "Bulgarians"
    },
    {
        "Carniola": "Carniola"
    },
    {
        ", ": null
    },
    {
        "Styria": "Styria"
    },
    {
        ", ": null
    },
    {
        "Carinthia": "Carinthia"
    },
    {
        ", ": null
    },
    {
        "Gorizia and Gradisca": "Gorizia And Gradisca"
    },
    {
        ", ": null
    },
    {
        "Trieste": "Trieste"
    },
    {
        ", ": null
    },
    {
        "Istria": "Istria"
    },
    {
        " from Germany, Austria and Russiae.g. in Poland candidates from Związek Słowiański got no more than few thousands votes": null
    }
]