[
    {
        "           In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", a partial function from X to Y  is a ": null
    },
    {
        "function": "Function"
    },
    {
        " , for some ": null
    },
    {
        "subset": "Subset"
    },
    {
        " X of  X. It generalizes the concept of a function  by not forcing f to map every element of X to an element of Y . If , then f is called a total function for emphasizing that its domain is not a proper subset of X. Partial functions are often used when the exact ": null
    },
    {
        "domain": "Domain Of A Function"
    },
    {
        ", X, is not known . In ": null
    },
    {
        "real": "Real Analysis"
    },
    {
        " and ": null
    },
    {
        "complex analysis": "Complex Analysis"
    },
    {
        ", a partial function is generally called simply a function.     Specifically, we will say that for any , either:     or   f is undefined.   A partial function is a ": null
    },
    {
        "univalent relation": "Univalent Relation"
    },
    {
        ", a particular type of ": null
    },
    {
        "binary relation": "Binary Relation"
    },
    {
        " from X to Y.     For example, we can consider the ": null
    },
    {
        "square root": "Square Root"
    },
    {
        " function restricted to the ": null
    },
    {
        "integers": "Integer"
    },
    {
        "   : g          : g       Thus g is only defined for n that are ": null
    },
    {
        "perfect squares": "Square Number"
    },
    {
        " . So, , but g is undefined.       There are two distinct meanings in current mathematical usage for the notion of the ": null
    },
    {
        "domain": "Domain Of A Function"
    },
    {
        " of a partial function. Most mathematicians, including ": null
    },
    {
        "recursion theorists": "Recursion Theory"
    },
    {
        ", use the term domain of f for the set of all values x such that f is defined . But some, particularly ": null
    },
    {
        "category theorists": "Category Theory"
    },
    {
        ", consider the domain of a partial function fX  →  Y to be X, and refer to X  as the domain of definition. Similarly, the term ": null
    },
    {
        "range": "Range"
    },
    {
        " can refer to either the ": null
    },
    {
        "codomain": "Codomain"
    },
    {
        " or the image of a function.     A partial function is said to be ": null
    },
    {
        "injective": "Injective"
    },
    {
        " or ": null
    },
    {
        "surjective": "Surjective"
    },
    {
        " when the total function given by the restriction of the partial function to its domain of definition is injective or surjective respectively. A partial function may be both injective and surjective .     Because a function is trivially surjective when restricted to its image, the term ": null
    },
    {
        "partial bijection": "Partial Bijection"
    },
    {
        " denotes a partial function which is injective.      An injective partial function may be inverted to an injective partial function, and a partial function which is both injective and surjective has an injective function as inverse. Furthermore, a total function which is injective may be inverted to an injective partial function.     The notion of ": null
    },
    {
        "transformation": "Transformation"
    },
    {
        " can be generalized to partial functions as well. A partial transformation is a function , where both A and B are ": null
    },
    {
        "subsets": "Subset"
    },
    {
        " of some set X.       Total function is a ": null
    },
    {
        "synonym": "Synonym"
    },
    {
        " for ": null
    },
    {
        "function": "Function"
    },
    {
        ". The use of the adjective total is to suggest that it is a special case of a partial function . The adjective will typically be used for clarity in contexts where partial functions are common, for example in ": null
    },
    {
        "computability theory": "Computability Theory"
    },
    {
        ".       The set of all partial functions  from a set X to a set Y, denoted by , is the union of all total functions defined on subsets of X with same codomain Yc not contained in Y, so that the codomain is , an operation which is injective .       The first diagram at the top of the article represents a partial function that is not a total function since the element 1 in the left-hand set is not associated with anything in the right-hand set. Whereas, the second diagram represents a total function since every element on the left-hand set is associated with exactly one element in the right hand set.       Consider the ": null
    },
    {
        "natural logarithm": "Natural Logarithm"
    },
    {
        " function mapping the ": null
    },
    {
        "real numbers": "Real Number"
    },
    {
        " to themselves. The logarithm of a non-positive real is not a real number, so the natural logarithm function doesnt associate any real number in the codomain with any non-positive real number in the domain. Therefore, the natural logarithm function is not a total function when viewed as a function from the reals to themselves, but it is a partial function. If the domain is restricted to only include the ": null
    },
    {
        "positive reals": "Positive Reals"
    },
    {
        " , then the natural logarithm is a total function.       Subtraction of ": null
    },
    {
        "natural numbers": "Natural Numbers"
    },
    {
        "  can be viewed as a partial function:     : f:           : f x - y.     It is defined only when x   y .         In ": null
    },
    {
        "denotational semantics": "Denotational Semantics"
    },
    {
        " a partial function is considered as returning the ": null
    },
    {
        "bottom element": "Bottom Element"
    },
    {
        " when it is undefined.     In ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        " a partial function corresponds to a subroutine that raises an exception or loops forever. The ": null
    },
    {
        "IEEE floating point": "Ieee Floating Point"
    },
    {
        " standard defines a ": null
    },
    {
        "not-a-number": "Not-A-Number"
    },
    {
        " value which is returned when a floating point operation is undefined and exceptions are suppressed, e.g. when the square root of a negative number is requested.     In a ": null
    },
    {
        "programming language": "Programming Language"
    },
    {
        " where function parameters are ": null
    },
    {
        "statically typed": "Statically Typed"
    },
    {
        ", a function may be defined as a partial function because the languages ": null
    },
    {
        "type system": "Type System"
    },
    {
        " cannot express the exact domain of the function, so the programmer instead gives it the smallest domain which is expressible as a type and contains the true domain.         In ": null
    },
    {
        "category theory": "Category Theory"
    },
    {
        ", when considering the operation of ": null
    },
    {
        "morphism": "Morphism"
    },
    {
        " composition in ": null
    },
    {
        "concrete categories": "Concrete Categories"
    },
    {
        ", the composition operation   :           is a total function if and only if   has one element. The reason for this is that two morphisms f:X  Y and g:U  V can only be composed as g   f if YU , that is, the codomain of f must equal the domain of g .     The category of sets and partial functions is ": null
    },
    {
        "equivalent": "Equivalence Of Categories"
    },
    {
        " to but not ": null
    },
    {
        "isomorphic": "Isomorphism Of Categories"
    },
    {
        " with the category of ": null
    },
    {
        "pointed sets": "Pointed Set"
    },
    {
        " and point-preserving maps.  One textbook notes that This formal completion of sets and partial maps by adding “improper,” “infinite” elements was reinvented many times, in particular, in topology  and in ": null
    },
    {
        "theoretical computer science": "Theoretical Computer Science"
    },
    {
        ".      The category of sets and partial bijections is equivalent to its ": null
    },
    {
        "dual": "Opposite Category"
    },
    {
        ".  It is the prototypical ": null
    },
    {
        "inverse category": "Inverse Category"
    },
    {
        ".        ": null
    },
    {
        "Partial algebra": "Partial Algebra"
    },
    {
        " generalizes the notion of ": null
    },
    {
        "universal algebra": "Universal Algebra"
    },
    {
        " to partial ": null
    },
    {
        "operations": "Operation"
    },
    {
        ". An example would be a ": null
    },
    {
        "field": "Field"
    },
    {
        ", in which the multiplicative inversion is the only proper partial operation .      The set of all partial functions  on a given base set, X, forms a ": null
    },
    {
        "regular semigroup": "Regular Semigroup"
    },
    {
        " called the semigroup of all partial transformations , typically denoted by   .    The set of all partial bijections on X forms the ": null
    },
    {
        "symmetric inverse semigroup": "Symmetric Inverse Semigroup"
    },
    {
        ".       Charts in the ": null
    },
    {
        "atlases": "Atlas"
    },
    {
        " which specify the structure of ": null
    },
    {
        "manifolds": "Manifold"
    },
    {
        " and ": null
    },
    {
        "fiber bundles": "Fiber Bundle"
    },
    {
        " are partial functions. In the case of manifolds, the domain is the point set of the manifold. In the case of fiber bundles, the domain is the total space of the fiber bundle. In these applications, the most important construction is the ": null
    },
    {
        "transition map": "Atlas Transition Maps"
    }
]