[
    {
        "            A party is a gathering of people who have been invited by a ": null
    },
    {
        "host": "Hospitality"
    },
    {
        " for the purposes of ": null
    },
    {
        "socializing": "Socializing"
    },
    {
        ", ": null
    },
    {
        "conversation": "Conversation"
    },
    {
        ", ": null
    },
    {
        "recreation": "Recreation"
    },
    {
        ", or as part of a ": null
    },
    {
        "festival": "Festival"
    },
    {
        " or other commemoration of a special occasion. A party will typically feature ": null
    },
    {
        "food": "Food"
    },
    {
        " and ": null
    },
    {
        "beverages": "Beverages"
    },
    {
        ", and often ": null
    },
    {
        "music": "Music"
    },
    {
        " and ": null
    },
    {
        "dancing": "Dancing"
    },
    {
        " or other forms of ": null
    },
    {
        "entertainment": "Entertainment"
    },
    {
        ". In many Western countries, parties for teens and adults are associated with drinking alcohol such as ": null
    },
    {
        "beer": "Beer"
    },
    {
        ", ": null
    },
    {
        "wine": "Wine"
    },
    {
        ", or ": null
    },
    {
        "distilled spirits": "Distilled Spirits"
    },
    {
        ".       Some parties are held in ": null
    },
    {
        "honor": "Honor"
    },
    {
        " of a specific person, day, or event, such as a birthday party, a ": null
    },
    {
        "Super Bowl": "Super Bowl"
    },
    {
        " party, or a ": null
    },
    {
        "St. Patrick’s Day": "St. Patrick’S Day"
    },
    {
        " party. Parties of this kind are often called celebrations. A party is not necessarily a private occasion. Public parties are sometimes held in ": null
    },
    {
        "restaurants": "Restaurant"
    },
    {
        ", ": null
    },
    {
        "pubs": "Public House"
    },
    {
        ", ": null
    },
    {
        "beer gardens": "Beer Gardens"
    },
    {
        ", ": null
    },
    {
        "nightclubs": "Nightclub"
    },
    {
        " or ": null
    },
    {
        "bars": "Bar"
    },
    {
        ", and people attending such parties may be charged an admission fee by the host. Large parties in public streets may celebrate events such as ": null
    },
    {
        "Mardi Gras": "Mardi Gras"
    },
    {
        " or the signing of a ": null
    },
    {
        "peace treaty": "Peace Treaty"
    },
    {
        " ending a long war.                  A ": null
    },
    {
        "birthday": "Birthday"
    },
    {
        " party is a celebration of the ": null
    },
    {
        "anniversary": "Anniversary"
    },
    {
        " of the birth of the person who is being honored. The tradition started in the mid-nineteenth century but did not become popular until the mid-twentieth century.  Birthday parties are now a feature of many cultures.     In ": null
    },
    {
        "Western cultures": "Western Culture"
    },
    {
        ", birthday parties include a number of common rituals. The guests may be asked to bring a gift for the honored person. Party locations are often decorated with colorful decorations, such as ": null
    },
    {
        "balloons": "Balloon"
    },
    {
        " and streamers. A ": null
    },
    {
        "birthday cake": "Birthday Cake"
    },
    {
        " is usually served with lit candles that are to be blown out after a birthday wish has been made. The person being honored will be given the first piece of cake. While the birthday cake is being brought to the table, the song ": null
    },
    {
        "Happy Birthday to You": "Happy Birthday To You"
    },
    {
        " or some other birthday song is sung by the guests.     At parties for children, time is often taken for the gift opening wherein the individual whose birthday is celebrated opens each of the gifts brought. It is also common at childrens parties for the host to give parting gifts to the attendees in the form of goodie bags . Children and even adults sometimes wear colorful cone-shaped ": null
    },
    {
        "party hats": "Party Hat"
    },
    {
        ".     Birthday parties are often larger and more extravagant if they celebrate someone who has reached what is regarded in the culture as a milestone age, such as transition from childhood to adulthood. Examples of traditional ": null
    },
    {
        "coming of age": "Coming Of Age"
    },
    {
        " celebrations include the North American ": null
    },
    {
        "sweet sixteen party": "Sweet Sixteen"
    },
    {
        " and the Latin American ": null
    },
    {
        "quinceañera": "Quinceañera"
    },
    {
        ".             A surprise party is a party that is not made known beforehand to the person in whose honor it is being held.     Birthday surprise parties are the most common kind of surprise party. At most such parties, the guests will arrive an hour or so before the honored person arrives. Often, a friend in on the surprise will lead the honored person to the location of the party without letting on anything.     The guests might even conceal themselves from view, and when the honored person enters the room, they leap from hiding and all shout, Surprise! For some surprise birthday parties, it is considered to be a good tactic to shock the honored person. Streamers, ": null
    },
    {
        "silly string": "Silly String"
    },
    {
        ", and ": null
    },
    {
        "balloons": "Balloons"
    },
    {
        " may be used for this purpose. Evidence of a party, such as decorations and balloons, are not made visible from the exterior of the home, so that the person honored will suspect nothing.            A dinner party is a social gathering at which people eat ": null
    },
    {
        "dinner": "Dinner"
    },
    {
        " together, usually in the hosts home. At the most formal dinner parties, the dinner is served on a dining table with ": null
    },
    {
        "place settings": "Table Setting"
    },
    {
        ". Dinner parties are often preceded by a ": null
    },
    {
        "cocktail hour": "Cocktail Party"
    },
    {
        " in a living room or bar, where guests drink ": null
    },
    {
        "cocktails": "Cocktail"
    },
    {
        " while mingling and conversing.  ": null
    },
    {
        "Wine": "Wine"
    },
    {
        " is usually served throughout the meal, often with a different wine accompanying each course.     At less formal dinner parties, a ": null
    },
    {
        "buffet": "Buffet"
    },
    {
        " is provided. Guests choose food from the buffet and eat while standing up and conversing. Women guests may wear ": null
    },
    {
        "cocktail dress": "Cocktail Dress"
    },
    {
        "es; men may wear ": null
    },
    {
        "blazers": "Blazer"
    },
    {
        ".     At some informal dinner parties, the host may ask guests to bring food or ": null
    },
    {
        "beverages": "Drink"
    },
    {
        " . A party of this type is called a ": null
    },
    {
        "potluck": "Potluck"
    },
    {
        " or potluck dinner. In the United States, potlucks are very often held in churches and community centers.       A garden party is a party in a ": null
    },
    {
        "park": "Park"
    },
    {
        " or a ": null
    },
    {
        "garden": "Garden"
    },
    {
        ". An event described as a garden party is usually more formal than other outdoor gatherings, which may be called simply parties, ": null
    },
    {
        "picnics": "Picnic"
    },
    {
        ", ": null
    },
    {
        "barbecues": "Barbecue"
    },
    {
        ", etc. A garden party can be a prestigious event. For example, invitations by the ": null
    },
    {
        "British Sovereign": "British Sovereign"
    },
    {
        " to ": null
    },
    {
        "garden parties at Buckingham Palace": "Garden At Buckingham Palacegarden Parties"
    },
    {
        " are considered an honor. The President of France holds a garden party at the ": null
    },
    {
        "Palais de lElysée": "Palais De Lelysée"
    },
    {
        " in Paris on ": null
    },
    {
        "Bastille Day": "Bastille Day"
    },
    {
        ".          A cocktail party is a party at which ": null
    },
    {
        "cocktails": "Cocktail"
    },
    {
        " are served. It is sometimes called a cocktail reception . Women who attend a cocktail party may wear a ": null
    },
    {
        "cocktail dress": "Cocktail Dress"
    },
    {
        ". A ": null
    },
    {
        "cocktail hat": "Cocktail Hat"
    },
    {
        " is sometimes worn as a fashion statement.             In Anglo-American culture, a ": null
    },
    {
        "tea": "Tea"
    },
    {
        " party is a formal gathering for ": null
    },
    {
        "afternoon tea": "Tea Afternoon Tea"
    },
    {
        ". These parties were traditionally attended only by women, but men may also be invited. Tea parties are often characterized by the use of prestigious ": null
    },
    {
        "tableware": "Tableware"
    },
    {
        ", such as ": null
    },
    {
        "bone china": "Bone China"
    },
    {
        " and ": null
    },
    {
        "silver": "Silver"
    },
    {
        ". The table, whatever its size or cost, is made to look its prettiest, with cloth napkins and matching cups and plates.     In addition to tea, larger parties may serve punch or, in cold weather, hot chocolate. The tea is accompanied by a variety of easily managed foods. Thin ": null
    },
    {
        "sandwich": "Sandwich"
    },
    {
        "es such as ": null
    },
    {
        "cucumber": "Cucumber Sandwich"
    },
    {
        " or tomato, ": null
    },
    {
        "bananas": "Banana"
    },
    {
        ", ": null
    },
    {
        "cake slices": "Cake"
    },
    {
        ", ": null
    },
    {
        "buns": "Buns"
    },
    {
        ", and ": null
    },
    {
        "cookies": "Cookies"
    },
    {
        " are all common choices.          Formal receptions are parties that are designed to receive a large number of guests, often at prestigious venues such as ": null
    },
    {
        "Buckingham Palace": "Buckingham Palace"
    },
    {
        ", the ": null
    },
    {
        "White House": "White House"
    },
    {
        " or ": null
    },
    {
        "Government Houses of the British Empire and Commonwealth": "Government Houses Of The British Empire And Commonwealth"
    },
    {
        ". The hosts and any guests of honor form a ": null
    },
    {
        "receiving line": "Wedding Receptionreceiving Line"
    },
    {
        " in ": null
    },
    {
        "order of precedence": "Order Of Precedence"
    },
    {
        " near the entrance. Each guest is announced to the host who greets each one in turn as he or she arrives. Each guest properly speaks little more than his name and a conventional greeting or congratulation to each person in the receiving line. In this way, the line of guests progresses steadily without unnecessary delay. After formally receiving each guest in this fashion, the hosts may mingle with the guests.     Somewhat less formal receptions are common in academic settings, sometimes to honor a ": null
    },
    {
        "guest lecturer": "Guest Speaker"
    },
    {
        ", or to celebrate a special occasion such as retirement of a respected member of staff. Receptions are also common in ": null
    },
    {
        "symposium": "Symposium"
    },
    {
        " or ": null
    },
    {
        "academic conference": "Academic Conference"
    },
    {
        " settings, as an environment for attendees to mingle and interact informally. These gatherings may be accompanied by a sit-down dinner, or more commonly, a stand-up informal ": null
    },
    {
        "buffet": "Buffet"
    },
    {
        " meal.     Receptions are also held to celebrate ": null
    },
    {
        "exhibition openings": "Art Exhibition"
    },
    {
        " at ": null
    },
    {
        "art galleries": "Art Gallery"
    },
    {
        " or ": null
    },
    {
        "museums": "Museum"
    },
    {
        ". The featured artist or artists are often present, as well as the ": null
    },
    {
        "curators": "Curator"
    },
    {
        " who organized the exhibition. In addition or instead, a celebratory reception may be held partway through or at the end of an exhibition run. This alternative scheduling allows guests more time to see the exhibition in depth at their own pace, before meeting the featured guests. Some food is often served, as in academic gatherings.     Refreshments at a reception may be as minimal, such as coffee or lemonade, or as elaborate as those at a ": null
    },
    {
        "state dinner": "State Dinner"
    },
    {
        ".          In the 18th century, in France and England, it became fashionable for wealthy, well married ladies who had a residence in town to invite accomplished guests to visit their home in the evening, to partake of refreshments and cultural conversation. Soirées often included refined musical entertainment, and the term is still sometimes used to define a certain sophisticated type of evening party.     Society hostesses included actresses or other women with a larger-than-life reputation. The character of the hostess obviously determined the character of the soirée and the choice of guests.     Famous soirée hostesses include ": null
    },
    {
        "Hester Thrale": "Hester Thrale"
    },
    {
        ".             A dance is a social gathering at which the guests dance. It may be a casual, informal affair or a structured event, such as a ": null
    },
    {
        "school dance": "Prom"
    },
    {
        " or a charity ball. Dances usually take place during the evening. An afternoon dance is formally known as a ": null
    },
    {
        "tea dance": "Tea Dance"
    },
    {
        ". Some dances feature specific kinds of dancing, such as ": null
    },
    {
        "square dancing": "Square Dance"
    },
    {
        ".     A ": null
    },
    {
        "ball": "Ball"
    },
    {
        " is a large formal party that features ": null
    },
    {
        "ballroom dancing": "Ballroom Dance"
    },
    {
        ". Women guests wear ": null
    },
    {
        "ball gowns": "Ball Gown"
    },
    {
        "; men wear ": null
    },
    {
        "evening dress": "White Tie"
    },
    {
        ".          A block party is a public party that is attended by the residents of a specific city block or neighborhood. These parties are typically held in a city street that has been closed to traffic to accommodate the party. At some block parties, attendees are free to pass from house to house, socializing, and often drinking ": null
    },
    {
        "alcoholic beverages": "Alcoholic Beverages"
    },
    {
        ".       At a ": null
    },
    {
        "masquerade ball": "Masquerade Ball"
    },
    {
        ", guests wear ": null
    },
    {
        "masks": "Mask"
    },
    {
        " to conceal their identities. Guests at a ": null
    },
    {
        "costume party": "Costume Party"
    },
    {
        " or a fancy dress party wear costumes. These parties are sometimes associated with holiday events, such as ": null
    },
    {
        "Halloween": "Halloween"
    },
    {
        " and ": null
    },
    {
        "Mardi Gras": "Mardi Gras"
    },
    {
        ".       In ": null
    },
    {
        "English": "England"
    },
    {
        " and ": null
    },
    {
        "American": "United States"
    },
    {
        " culture during the ": null
    },
    {
        "Christmas": "Christmas"
    },
    {
        " season, it is traditional to have a Christmas caroling party. People go from door to door in a neighborhood and sing ": null
    },
    {
        "Christmas carols": "Christmas Carol"
    },
    {
        ". Some popular Christmas carols are ": null
    },
    {
        "We Wish You a Merry Christmas": "We Wish You A Merry Christmas"
    },
    {
        " , ": null
    },
    {
        "Deck the Halls": "Deck The Halls"
    },
    {
        " , ": null
    },
    {
        "The Twelve Days of Christmas": "The Twelve Days Of Christmas"
    },
    {
        " , ": null
    },
    {
        "Frosty the Snowman": "Frosty The Snowman"
    },
    {
        " , ": null
    },
    {
        "Jingle Bells": "Jingle Bells"
    },
    {
        " , ": null
    },
    {
        "Silver Bells": "Silver Bells"
    },
    {
        " , ": null
    },
    {
        "Santa Claus Is Coming to Town": "Santa Claus Is Coming To Town"
    },
    {
        " , and ": null
    },
    {
        "O Holy Night": "O Holy Night"
    },
    {
        " .     In Spain, this type of party is called El Aguinaldo. It is the same as in England and the United States, but the only difference is that the children who sing the carols are given tips.  Christmas songs are called villancicos in Spain; they are mainly sung by children at small parties.           ": null
    },
    {
        "Dance parties": "Dance Party"
    },
    {
        " are gatherings in bars or community centers where the guests dance to ": null
    },
    {
        "house music": "House Music"
    },
    {
        ", ": null
    },
    {
        "techno music": "Techno"
    },
    {
        ", or ": null
    },
    {
        "disco": "Disco"
    },
    {
        ". The music for dance parties is usually selected and played by a ": null
    },
    {
        "disc jockey": "Disc Jockey"
    },
    {
        ".     A spin-off of dance parties, the ": null
    },
    {
        "rave": "Rave"
    },
    {
        " involves dancing to loud ": null
    },
    {
        "house music": "House Music"
    },
    {
        ", ": null
    },
    {
        "techno music": "Techno"
    },
    {
        ", or ": null
    },
    {
        "industrial music": "Industrial Music"
    },
    {
        ". Rave parties may be attended by as few as a score of people in a basement or, more likely, by a few hundred people in a club, to as many as thousands in a large warehouse, field, or even tens of thousands in a sporting arena, amusement park, or other large space. Raves are associated with illegal drugs such as ": null
    },
    {
        "Ecstasy": "Ecstasy"
    },
    {
        " and ": null
    },
    {
        "psychedelic drugs": "Psychedelic Drugs"
    },
    {
        ".     A ": null
    },
    {
        "house party": "House Party"
    },
    {
        " is a party where a large group of people get together at a private home to socialize. House parties that involve the drinking of beer pumped from a ": null
    },
    {
        "keg": "Keg"
    },
    {
        " are called keg parties or keggers. These parties are popular in ": null
    },
    {
        "North America": "North America"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        ", and ": null
    },
    {
        "Australia": "Australia"
    },
    {
        " and are often attended by people under the ": null
    },
    {
        "legal drinking age": "Legal Drinking Age"
    },
    {
        ". Sometimes, even older party-goers run afoul of the law for having provided ": null
    },
    {
        "alcoholic beverages": "Alcoholic Beverage"
    },
    {
        " to ": null
    },
    {
        "minors": "Minor"
    },
    {
        ". Arrests may also be made for violating a ": null
    },
    {
        "noise": "Noise"
    },
    {
        " ordinance, for ": null
    },
    {
        "disorderly conduct": "Disorderly Conduct"
    },
    {
        ",  While it affects all adults who buy kegs, the proposed law is aimed at the 21-to-23-year-old crowd, particularly college students, who dont think twice about buying a keg or 10 for a weekend bash. Pittsburgh Post-Gazette, 2001-11-04. and even for operating a ": null
    },
    {
        "blind pig": "Speakeasy"
    },
    {
        " , an establishment that illegally sells alcoholic beverages.     On college campuses, parties are often hosted by ": null
    },
    {
        "fraternities": "College Fraternity"
    },
    {
        ".      Outdoor parties include bush parties and beach parties. Bush parties are held in a secluded area of a forest , where friends gather to ": null
    },
    {
        "drink": "Drinkingalcoholic Beverages"
    },
    {
        " and talk. These parties are often held around a ": null
    },
    {
        "bonfire": "Bonfire"
    },
    {
        ". Beach parties are held on a sandy shoreline of a lake, river, or sea, and also often feature a bonfire.     School-related parties for teenagers and young adults include ": null
    },
    {
        "proms": "Prom"
    },
    {
        " and ": null
    },
    {
        "graduation parties": "Graduation"
    },
    {
        ", which are held in honor of someone who has recently graduated from a school or university.          A pool party is a party in which the guests swim in a ": null
    },
    {
        "swimming pool": "Swimming Pool"
    },
    {
        ".       A singles dance party and mixer is a party which is organized for people who are not married and who want to find a partner for ": null
    },
    {
        "friendship": "Friendship"
    },
    {
        ", ": null
    },
    {
        "dating": "Dating"
    },
    {
        ", or ": null
    },
    {
        "sex": "Sexual Intercourse"
    },
    {
        ".     Usually a mixer game is played, to make it easy for people to meet each other. For example, each guest may be given a card with an inspiring quotation on it. The game is to find a potential partner who has the same quotation. Couples who have matching cards may be given a small prize.     These parties are sponsored by various organizations, both non-profit and for-profit.       A fundraising party, or fundraiser, is a party that is held for the purpose of collecting money that will be given to some person or to some institution, such as a ": null
    },
    {
        "school": "School"
    },
    {
        ", ": null
    },
    {
        "charity": "Charitable Organization"
    },
    {
        ", ": null
    },
    {
        "business": "Business"
    },
    {
        ", or ": null
    },
    {
        "political campaign": "Political Campaign"
    },
    {
        ". These parties are usually formal and consist of a dinner followed by speeches or by a presentation extolling whatever the money is being raised for.     It is very common to charge an admission fee for parties of this kind. This fee may be as high as several thousand dollars, especially if money is being raised for a ": null
    },
    {
        "political campaign": "Political Campaign"
    },
    {
        ".          In some places, parties to celebrate graduation from school, college or university are popular.        ": null
    },
    {
        "Bridal shower": "Bridal Shower"
    },
    {
        " Bachelor party": "Bachelor Party"
    },
    {
        "   Bachelorette party": "Bachelorette Party"
    },
    {
        "   Wedding reception": "Wedding Reception"
    },
    {
        " Divorce party": "Divorce Party"
    },
    {
        "       A shower is a party whose primary purpose is to give gifts to the guest of honor. Traditionally, a ": null
    },
    {
        "bridal shower": "Bridal Shower"
    },
    {
        " is a way for an engaged woman to be showered with gifts for her upcoming married life . Guests are expected to bring a small gift related to the upcoming life event. Themed games are a frequent sight at this sort of party. A new twist on the ": null
    },
    {
        "baby shower": "Baby Shower"
    },
    {
        " for a pregnant woman is the ": null
    },
    {
        "gender reveal party": "Gender Reveal Party"
    },
    {
        ", made possible by modern ultrasound technology.          A housewarming party may be held when a family, couple, or person moves into a new house or apartment. It is an occasion for the hosts to show their new home to their friends. Housewarming parties are typically informal and do not include any planned activities other than a tour of the new house or apartment. Invited family members and friends may bring gifts for the new home.       A welcome party is held for the purpose of welcoming a newcomer, such as a new club member, a new employee, or a familys new baby.       In many cultures, it is customary to throw a farewell party in honor of someone who is moving away or departing on a long trip . Retirement parties for departing co-workers fall into this category. Several are described in Japan in ": null
    },
    {
        "Shusaku Endos": "Shusaku Endo"
    },
    {
        " 1974 novel When I Whistle. Kuchibue wo Fuku Toki, translated by Van C. Gessel, 1979.       A cast party is a celebration following the final performance of a theatric event, such as a ": null
    },
    {
        "play": "Play"
    },
    {
        ", a ": null
    },
    {
        "musical": "Musical Theatre"
    },
    {
        ", or an ": null
    },
    {
        "opera": "Opera"
    },
    {
        ". A party of this kind may also be held following the end of shooting for a ": null
    },
    {
        "motion picture": "Film"
    },
    {
        " or after the seasons final episode of a ": null
    },
    {
        "television series": "Television Program"
    },
    {
        ". Cast parties are traditionally held for most theater performances, both professional and amateur.     Invited guests are usually restricted to performers, crew members, and a few others who did not participate in the performance, such as sponsors and donors who have helped fund the production.       A pre-party is a party that is held immediately before some event, such as a ": null
    },
    {
        "school dance": "Partner Dance"
    },
    {
        ", a ": null
    },
    {
        "wedding": "Wedding"
    },
    {
        ", a birthday party, or a ": null
    },
    {
        "bar mitzvah": "Bar Mitzvah"
    },
    {
        ". These parties are usually of short duration and sometimes involve getting ready for the event . Guests usually leave at the same time and arrive at the event together. Often people engage in ": null
    },
    {
        "pregaming": "Pregaming"
    },
    {
        " or drinking before an event or a night out, especially if the event lacks access to alcohol.          An after-party is a party that is held after a musical or theatrical performance or after some other event, such as a ": null
    },
    {
        "wedding": "Wedding"
    },
    {
        " or a ": null
    },
    {
        "school dance": "Dance Partyschool Dances"
    },
    {
        ". Guests are usually limited to friends of the host.                International ": null
    },
    {
        "Christmas": "Christmas"
    },
    {
        " Halloween": "Halloween"
    },
    {
        " International Friendship Day": "International Friendship Day"
    },
    {
        " Labour Day": "International Workers Day"
    },
    {
        " Mardi Gras": "Mardi Gras"
    },
    {
        " New Years Day": "New Years Day"
    },
    {
        " New Years Eve": "New Years Eve"
    },
    {
        "     Australia ": null
    },
    {
        "Australia Day": "Australia Day"
    },
    {
        " Grand Final Saturday": "Afl Grand Final"
    },
    {
        " Melbourne Cup Day": "Melbourne Cup Day"
    },
    {
        "     Canada ": null
    },
    {
        "Canada Day": "Canada Day"
    },
    {
        " Labour Day": "International Workers Day"
    },
    {
        " Thanksgiving": "Thanksgiving"
    },
    {
        " Victoria Day": "Victoria Day"
    },
    {
        "     France ": null
    },
    {
        "Bastille Day": "Bastille Day"
    },
    {
        " May Day": "International Workers Day"
    },
    {
        "     Germany ": null
    },
    {
        "German Unity Day": "German Unity Day"
    },
    {
        " May Day": "International Workers Day"
    },
    {
        " a.k.a. Tag der Arbeit ": null
    },
    {
        "Reformation Day": "Reformation Day"
    },
    {
        " Rosenmontag": "Rosenmontag"
    },
    {
        " a.k.a. Rose Monday, highlight of the ": null
    },
    {
        "German carnival": "Carnival In Germany, Switzerland And Austria"
    },
    {
        "     India ": null
    },
    {
        "Chaand Raat": "Chaand Raat"
    },
    {
        "   Christmas": "Christmas"
    },
    {
        " Diwali": "Diwali"
    },
    {
        " Labour Day": "International Workers Day"
    },
    {
        " Holi": "Holi"
    },
    {
        "     Iran and other ": null
    },
    {
        "Persified societies": "Persianate Society"
    },
    {
        " Nowruz": "Nowruz"
    },
    {
        "     Ireland ": null
    },
    {
        "Saint Patrick’s Day": "Saint Patrick’S Day"
    },
    {
        "     Israel ": null
    },
    {
        "Passover": "Passover"
    },
    {
        " Hanukkah": "Hanukkah"
    },
    {
        " Purim": "Purim"
    },
    {
        "     Mexico ": null
    },
    {
        "Cinco de Mayo": "Cinco De Mayo"
    },
    {
        " May Day": "International Workers Day"
    },
    {
        "     New Zealand ": null
    },
    {
        "Waitangi Day": "Waitangi Day"
    },
    {
        "     Pakistan ": null
    },
    {
        "Pakistan Day": "Pakistan Day"
    },
    {
        " Yom-e-Istiqlal": "Yom-E-Istiqlal"
    },
    {
        " Basant": "Basant"
    },
    {
        "     Scotland ": null
    },
    {
        "Hogmanay": "Hogmanay"
    },
    {
        "     Sweden ": null
    },
    {
        "Midsummer Eve": "Midsummer Eve"
    },
    {
        "     United Kingdom ": null
    },
    {
        "Guy Fawkes Night": "Guy Fawkes Night"
    },
    {
        " Labour Day": "International Workers Day"
    },
    {
        "     United States ": null
    },
    {
        "Independence Day": "Independence Day"
    },
    {
        ", a.k.a. the Fourth of July   ": null
    },
    {
        "Labor Day": "International Workers Day"
    },
    {
        " Super Bowl Sunday": "Super Bowl"
    },
    {
        " Thanksgiving": "Thanksgiving"
    },
    {
        "     Uruguay ": null
    },
    {
        "Nostalgia Night": "Nostalgia Night"
    },
    {
        ", the night before the ": null
    },
    {
        "Declaration of Independence": "History Of Uruguaystruggle For Independence"
    },
    {
        "             Christian ": null
    },
    {
        "Christmas": "Christmas"
    },
    {
        " Easter": "Easter"
    },
    {
        " Mardi Gras": "Mardi Gras"
    },
    {
        " Saint Patrick’s Day": "Saint Patrick’S Day"
    },
    {
        "   Islamic ": null
    },
    {
        "Eid al-Adha": "Eid Al-Adha"
    },
    {
        " Eid ul-Fitr": "Eid Ul-Fitr"
    },
    {
        "   Jewish ": null
    },
    {
        "Hanukkah": "Hanukkah"
    },
    {
        " Passover": "Passover"
    },
    {
        " Purim": "Purim"
    },
    {
        "           Exotic Erotic Ball": "Exotic Erotic Ball"
    },
    {
        " Burning Man": "Burning Man"
    },
    {
        " Full Moon Party": "Full Moon Party"
    },
    {
        " Lollapalooza": "Lollapalooza"
    },
    {
        " Nuit Blanche": "Nuit Blanche"
    },
    {
        " Woodstock Festival": "Woodstock Festival"
    },
    {
        " Soul Clap and Dance-Off": "Jonathan Toubin"
    },
    {
        "            ;": null
    },
    {
        "Game party": "Party Game"
    },
    {
        "   :A social gathering during which the guests play ": null
    },
    {
        "party games": "Party Game"
    },
    {
        " or ": null
    },
    {
        "board games": "Board Game"
    },
    {
        ".   ;": null
    },
    {
        "LAN party": "Lan Party"
    },
    {
        "   : A party that involves multi-player computer games and uses a ": null
    },
    {
        "Local Area Network": "Local Area Network"
    },
    {
        ".   ;": null
    },
    {
        "Party plan": "Party Plan"
    },
    {
        "   :A form of ": null
    },
    {
        "direct selling": "Direct Selling"
    },
    {
        ", in which a party is used to sell products .   ;": null
    },
    {
        "Political houseparty": "Political Houseparty"
    },
    {
        "   :A party that is hosted in a private home for the purpose of supporting a particular candidate, political party, or ballot measure, or to share information and opinions about an upcoming ": null
    },
    {
        "election": "Election"
    },
    {
        ".   ;": null
    },
    {
        "Sleepover party": "Sleepover"
    },
    {
        ", also called a pajama party or slumber party   :A party for which the guests are invited to stay overnight at the home of the host. These parties are usually for ": null
    },
    {
        "teenagers": "Adolescence"
    },
    {
        " or young children.   ;": null
    },
    {
        "Toga party": "Toga Party"
    },
    {
        "   :A party in which the guests wear ": null
    },
    {
        "toga": "Toga"
    },
    {
        " Denver": "Denver"
    }
]