[
    {
        "        A peace process is the set of sociopolitical negotiations, agreements and actions that aim to solve a specific armed conflict.       Prior to an armed conflict occurring, peace processes can include the prevention of an intra-state or inter-state dispute from escalating into military conflict. The ": null
    },
    {
        "United Nations Department of Peace Operations": "United Nations Department Of Peace Operations"
    },
    {
        " terms the prevention of disputes from escalating into armed conflicts as conflict prevention. In 2007, the United Nations Secretary-Generals Policy Committee classed both initial prevention of an armed conflict and prevention of the repeat of a solved conflict as ": null
    },
    {
        "peacebuilding": "Peacebuilding"
    },
    {
        ".     For peace processes to resolve an armed conflict, ": null
    },
    {
        "Izumi Wakugawa": "Izumi Wakugawa"
    },
    {
        ", advisor to the Japan-based ": null
    },
    {
        "International Peace Cooperation Program": "International Peace Cooperation Program"
    },
    {
        ", suggests a definition of a peace process as a mixture of politics, diplomacy, changing relationships, negotiation, mediation, and dialogue in both official and unofficial arenas , which he attributes to ": null
    },
    {
        "Harold H. Saunders": "Harold H. Saunders"
    },
    {
        " of the ": null
    },
    {
        "United States Institute of Peace": "United States Institute Of Peace"
    },
    {
        " . Wakugawa categorises these processes into two stages: the ceasing of armed conflict and the processes of sociological reorganisation.       Non-military processes for stopping an armed conflict stage are generally classed as ": null
    },
    {
        "peacemaking": "Peacemaking"
    },
    {
        ". Military methods by globally organised military forces of stopping a local armed conflict are typically classed as ": null
    },
    {
        "peace enforcement": "Peace Enforcement"
    },
    {
        ".       The prevention of the repeat of a solved conflict is usually classed as ": null
    },
    {
        "peacebuilding": "Peacebuilding"
    },
    {
        ". UNDPO defines peacebuilding to include measures address core issues that effect the functioning of society and the State . The use of neutral military forces to sustain ceasefires during this phase, typically by ": null
    },
    {
        "United Nations peacekeeping forces": "List Of United Nations Peacekeeping Missions"
    },
    {
        ", can be referred to as ": null
    },
    {
        "peacekeeping": "Peacekeeping"
    },
    {
        ".       The use of the terms peacemaking, peacekeeping and peacebuilding tends to be used broadly, with overlapping phases of various peace process mechanisms.          The construction of international institutions, especially during the twentieth century, has to a large degree been motivated by the desire to provide a broad global context of peacebuilding. This includes the ": null
    },
    {
        "League of Nations": "League Of Nations"
    },
    {
        " and the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        ", and regional institutions such as the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        ". Institutions involved in encouraging or overseeing some of the steps in specific peace processes include the ": null
    },
    {
        "United Nations Department of Peace Operations": "United Nations Department Of Peace Operations"
    },
    {
        ".       Many specific ": null
    },
    {
        "peace mechanisms": ":Category:Peace Mechanism"
    },
    {
        " can comprise the elements of peace processes. The ": null
    },
    {
        "Peace Accords Matrix": "Peace Accords Matrix"
    },
    {
        " of the ": null
    },
    {
        "Kroc Institute for International Peace Studies": "University Of Notre Damegraduate And Professional Schools"
    },
    {
        " at the ": null
    },
    {
        "University of Notre Dame": "University Of Notre Dame"
    },
    {
        ", ": null
    },
    {
        "United States": "United States"
    },
    {
        ", lists some of these as ": null
    },
    {
        "amnesties": "Amnesty"
    },
    {
        ", ": null
    },
    {
        "ceasefires": "Ceasefire"
    },
    {
        ", ": null
    },
    {
        "arms embargo": "Arms Embargo"
    },
    {
        "es, ": null
    },
    {
        "truth and reconciliation commissions": "Truth And Reconciliation Commission"
    },
    {
        " and reforms of the constitution, or of military, police, judicial or educational institutions or of the media. Other mechanisms include ": null
    },
    {
        "prisoner exchanges": "Prisoner Exchange"
    },
    {
        ", ": null
    },
    {
        "confidence-building measures": "Confidence-Building Measures"
    },
    {
        ", ": null
    },
    {
        "humanitarian corridors": "Humanitarian Corridor"
    },
    {
        ", ": null
    },
    {
        "peace treaties": "Peace Treaty"
    },
    {
        " and ": null
    },
    {
        "transitional justice": "Transitional Justice"
    },
    {
        ".       According to Neville Melvin Gertze of ": null
    },
    {
        "Namibia": "Namibia"
    },
    {
        ", speaking at an October 2019 meeting of the ": null
    },
    {
        "United Nations Security Council": "United Nations Security Council"
    },
    {
        ", peace agreements that are the result of negotiations including women are 35 percent more likely to last at least 15 years than those which are the result of men-only negotiations. At the same meeting, United Nations Secretary-General ": null
    },
    {
        "António Guterres": "António Guterres"
    },
    {
        " stated that women were excluded from peace processes, attacks against women human rights defenders had increased, and only a tiny percentage of funding for peacebuilding was given to ": null
    },
    {
        "womens": "Womens Rights"
    }
]