[
    {
        "   Pells equation  is any ": null
    },
    {
        "Diophantine equation": "Diophantine Equation"
    },
    {
        " of the form     : x2-ny21      where n is a given positive ": null
    },
    {
        "nonsquare": "Square Number"
    },
    {
        " integer": "Integer"
    },
    {
        " and integer solutions are sought for x and y. In ": null
    },
    {
        "Cartesian coordinates": "Cartesian Coordinates"
    },
    {
        ", the equation has the form of a ": null
    },
    {
        "hyperbola": "Hyperbola"
    },
    {
        "; solutions occur wherever the curve passes through a point whose x and y coordinates are both integers, such as the ": null
    },
    {
        "trivial solution": "Triviality"
    },
    {
        " with x    1 and y    0. ": null
    },
    {
        "Joseph Louis Lagrange": "Joseph Louis Lagrange"
    },
    {
        " proved that, as long as n is not a ": null
    },
    {
        "perfect square": "Square Number"
    },
    {
        ", Pells equation has infinitely many distinct integer solutions. These solutions may be used to accurately ": null
    },
    {
        "approximate": "Diophantine Approximation"
    },
    {
        " the ": null
    },
    {
        "square root": "Square Root"
    },
    {
        " of  n by ": null
    },
    {
        "rational numbers": "Rational Number"
    },
    {
        "of the form  x/y.     This equation was first studied extensively ": null
    },
    {
        "in India": "Indian Mathematics"
    },
    {
        ", starting with ": null
    },
    {
        "Brahmagupta": "Brahmagupta"
    },
    {
        ", who developed the ": null
    },
    {
        "chakravala method": "Chakravala Method"
    },
    {
        " to solve Pells equation and other quadratic indeterminate equations in his ": null
    },
    {
        "Brahma Sphuta Siddhanta": "Brahmasphutasiddhanta"
    },
    {
        " in 628, about a thousand years before Pells time. His Brahma Sphuta Siddhanta was translated into ": null
    },
    {
        "Arabic": "Arabic"
    },
    {
        " in 773 and was subsequently translated into ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " in 1126. ": null
    },
    {
        "Bhaskara II": "Bhaskara Ii"
    },
    {
        " in the 12th century and ": null
    },
    {
        "Narayana Pandit": "Narayana Pandit"
    },
    {
        " in the 14th century both found general solutions to Pells equation and other quadratic indeterminate equations. Solutions to specific examples of Pells equation, such as the ": null
    },
    {
        "Pell numbers": "Pell Number"
    },
    {
        "arising from the equation with n 2, had been known for much longer, since the time of ": null
    },
    {
        "Pythagoras": "Pythagoras"
    },
    {
        " in ": null
    },
    {
        "Greece": "Greek Mathematics"
    },
    {
        " and to a similar date in India. The name of Pells equation arose from ": null
    },
    {
        "Leonhard Euler": "Leonhard Euler"
    },
    {
        " mistakenly attributing ": null
    },
    {
        "Lord Brounckers": "Lord Brouncker"
    },
    {
        "solution of the equation to ": null
    },
    {
        "John Pell": "John Pell"
    },
    {
        ". As early as 1732–1733 Euler believed that John Pell had developed a method to solve Pells equation, even though Euler knew that Wallis had developed a method to solve it :    From p. 182:  At si a huiusmodi fuerit numerus, qui nullo modo ad illas formulas potest reduci, peculiaris ad invenienda p et q adhibenda est methodus, qua olim iam usi sunt Pellius et Fermatius.   From p. 183:  §. 19. Methodus haec extat descripta in operibus Wallisii, et hanc ob rem eam hic fusius non-expono.    Lettre IX. Euler à Goldbach, dated 10 August 1750 in:  From page 37:  Pro hujusmodi quaestionibus solvendis excogitavit D. Pell Anglus peculiarem methodum in Wallisii operibus expositam.     From p. 227:  §98. Hierzu hat vormals ein gelehrter Engländer, Namens Pell, eine ganz sinnreiche Methode erfunden, welche wir hier erklären wollen.    English translation:   See especially footnote 4. In Eulers Vollständige Anleitung zur Algebra , he presents a solution to Pells equation which was taken from John Wallis Commercium epistolicum, specifically, Letter 17  and Letter 19  of:    The letters are in Latin. Letter 17 appears on pp. 56–72. Letter 19 appears on pp. 81–91.   French translations of Wallis letters:  Letter 17 appears on pp. 457–480. Letter 19 appears on pp. 490–503.   Wallis letters showing a solution to the Pells equation also appear in volume 2 of Wallis Opera mathematica , which includes articles by John Pell:    Letter 17 is on pp. 789–798 ; letter 19 is on pp. 802–806. See also Pells articles, where Wallis mentions that Pells methods are applicable to the solution of Diophantine equations:   : De Algebra D. Johannis Pellii; & speciatim de Problematis imperfecte determinatis. , pp. 234–236.   : Methodi Pellianae Specimen. , pp. 238–244.   : Specimen aliud Methodi Pellianae. , pp. 244–246.   See also:   Whitford, Edward Everett The Pell equation, doctoral thesis, Columbia University ,         As early as 400 BC in India and Greece, mathematicians studied the numbers arising from the n    2 case of Pells equation,     : x2 - 2y21   and from the closely related equation   : x2 - 2y2 -1     because of the connection of these equations to the ": null
    },
    {
        "square root of 2": "Square Root Of 2"
    },
    {
        ". Indeed, if x and y are ": null
    },
    {
        "positive integers": "Natural Number"
    },
    {
        " satisfying this equation, then x/y is an approximation of . The numbers x and y appearing in these approximations, called ": null
    },
    {
        "side and diameter numbers": "Pell Number"
    },
    {
        ", were known to the ": null
    },
    {
        "Pythagoreans": "Pythagoreanism"
    },
    {
        ", and ": null
    },
    {
        "Proclus": "Proclus"
    },
    {
        " observed that in the opposite direction these numbers obeyed one of these two equations. Similarly, ": null
    },
    {
        "Baudhayana": "Baudhayana"
    },
    {
        " discovered that x 17, y 12 and x 577, y 408 are two solutions to the Pell equation, and that 17/12 and 577/408 are very close approximations to the square root of 2.     Later, ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        " approximated the ": null
    },
    {
        "square root of 3": "Square Root Of 3"
    },
    {
        " by the rational number 1351/780. Although he did not explain his methods, this approximation may be obtained in the same way, as a solution to Pells equation. .   ": null
    },
    {
        "Archimedess cattle problem": "Archimedess Cattle Problem"
    },
    {
        " involves solving a Pellian equation. It is now generally accepted that this problem is due to Archimedes.       Around AD 250, ": null
    },
    {
        "Diophantus": "Diophantus"
    },
    {
        " considered the equation     : a2 x2+cy2,   where a and c are fixed numbers and x and y are the variables to be solved for.   This equation is different in form from Pells equation but equivalent to it.   Diophantus solved the equation for  equal to , , , and . ": null
    },
    {
        "Al-Karaji": "Al-Karaji"
    },
    {
        ", a 10th-century Persian mathematician, worked on similar problems to Diophantus.     In Indian mathematics, ": null
    },
    {
        "Brahmagupta": "Brahmagupta"
    },
    {
        " discovered that   : 2 - N2   . Using this, he was able to compose triples and that were solutions of x2 - Ny2 k , to generate the new triples   : and .   Not only did this give a way to generate infinitely many solutions to x2 - Ny2 1 starting with one solution, but also, by dividing such a composition by k1k2 , integer or nearly integer solutions could often be obtained. For instance, for N92 , Brahmagupta composed the triple with itself to get the new triple . Dividing throughout by 64 gave the triple , which when composed with itself gave the desired integer solution . Brahmagupta solved many Pell equations with this method; in particular he showed how to obtain solutions starting from an integer solution of x2 - Ny2 k for k ±1, ±2, or ±4.      The first general method for solving the Pell equation  was given by ": null
    },
    {
        "Bhāskara II": "Bhāskara Ii"
    },
    {
        " in 1150, extending the methods of Brahmagupta. Called the ": null
    },
    {
        "chakravala method": "Chakravala Method"
    },
    {
        ", it starts by choosing two relatively prime integers a and b , then composing the triple with the trivial triple to get the triple , which can be scaled down to     :       When m is chosen so that   is an integer, so are the other two numbers in the triple. Among such m , the method chooses one that minimizes   , and repeats the process. This method always terminates with a solution . Bhaskara used it to give the solution x 1766319049, y  226153980 to the notorious N 61 case.     Several European mathematicians rediscovered how to solve Pells equation in the 17th century, apparently unaware that it had been solved almost five hundred years earlier in India. ": null
    },
    {
        "Pierre de Fermat": "Pierre De Fermat"
    },
    {
        " found how to solve the equation and in a 1657 letter issued it as a challenge to English mathematicians. In February 1657, Pierre de Fermat wrote two letters about Pells equation. One letter was addressed to Bernard Frénicle de Bessy, and the other was addressed to Kenelm Digby, whom it reached via Thomas White and then William Brouncker.    The letter to Frénicle appears on pp. 333–334; the letter to Digby, on pp. 334–335.   The letter in Latin to Digby is translated into French in:      Both letters are translated into English in:    In a letter to ": null
    },
    {
        "Kenelm Digby": "Kenelm Digby"
    },
    {
        ", ": null
    },
    {
        "Bernard Frénicle de Bessy": "Bernard Frénicle De Bessy"
    },
    {
        " said that Fermat found the smallest solution for N up to 150, and challenged ": null
    },
    {
        "John Wallis": "John Wallis"
    },
    {
        " to solve the cases N 151 or 313. Both Wallis and ": null
    },
    {
        "William Brouncker": "William Brouncker, 2Nd Viscount Brouncker"
    },
    {
        " gave solutions to these problems, though Wallis suggests in a letter that the solution was due to Brouncker. In January 1658, at the end of Epistola XIX , Wallis effusively congratulated Brouncker for his victory in a battle of wits against Fermat regarding the solution of Pells equation.   Et quidem cum Vir Nobilissimus, utut hac sibi suisque tam peculiaria putaverit, & altis impervia,  ut ab Anglis haud speraverit solutionem; profiteatur tamen quil sera pourtant ravi destre destrompé par cet ingenieux & scavant Signieur; erit cur & ipse tibi gratuletur. Me quod attinet, humillimas est quod rependam gratias, quod in Victoriae tuae partem advocare dignatus es, …   Note: The date at the end of Wallis letter is Jan. 20. 1657 ; however, that date was according to the old Julian calendar; when Britain finally ": null
    },
    {
        "adopted the Gregorian calendar in 1751": "Calendar  Act 1750"
    },
    {
        ", that date became January 30, 1658.     ": null
    },
    {
        "John Pells": "John Pell"
    },
    {
        "connection with the equation is that he revised ": null
    },
    {
        "Thomas Brankers": "Thomas Branker"
    },
    {
        " translation  of ": null
    },
    {
        "Johann Rahns": "Johann Rahn"
    },
    {
        "1659 book Teutsche Algebra Teutsch is a now obsolete referral to the German language, and here also to the, considered genuine, German culture area. Free E-book:  into English, with a discussion of Brounckers solution of the equation. ": null
    },
    {
        "Leonhard Euler": "Leonhard Euler"
    },
    {
        " mistakenly thought that this solution was due to Pell, as a result of which he named the equation after Pell.     The general theory of Pells equation, based on ": null
    },
    {
        "continued fractions": "Continued Fraction"
    },
    {
        "and algebraic manipulations with numbers of the form P+Q  was developed by Lagrange in 1766–1769. Solution dun Problème dArithmétique , in ": null
    },
    {
        "Joseph Alfred Serret": "Joseph Alfred Serret"
    },
    {
        " ,              Let   denote the sequence of ": null
    },
    {
        "convergents": "Convergent"
    },
    {
        " to the ": null
    },
    {
        "regular continued fraction": "Continued Fraction"
    },
    {
        " for   . This sequence is unique. Then the pair  solving Pells equation and minimizing x satisfies x 1 h i  and y 1 k i  for some i. This pair is called the fundamental solution. Thus, the fundamental solution may be found by performing the continued fraction expansion and testing each successive convergent until a solution to Pells equation is found.     As  describes, the time for finding the fundamental solution using the continued fraction method, with the aid of the ": null
    },
    {
        "Schönhage–Strassen algorithm": "Schönhage–Strassen Algorithm"
    },
    {
        " for fast integer multiplication, is within a logarithmic factor of the solution size, the number of digits in the pair . However, this is not a ": null
    },
    {
        "polynomial time algorithm": "Polynomial Time Algorithm"
    },
    {
        " because the number of digits in the solution may be as large as , far larger than a polynomial in the number of digits in the input value n .       Once the fundamental solution is found, all remaining solutions may be calculated algebraically from   : xk + yk   n k,   expanding the right side, ": null
    },
    {
        "equating coefficients": "Equating Coefficients"
    },
    {
        " of   on both sides, and equating the other terms on both sides. This yields the ": null
    },
    {
        "recurrence relations": "Recurrence Relation"
    },
    {
        "  :   x x1 xk + n y1 yk,   :   y x1 yk + y1 xk.       Although writing out the fundamental solution  as a pair of binary numbers may require a large number of bits, it may in many cases be represented more compactly in the form   : x1+y1  n     using much smaller integers a i , b i , and c i .     For instance, ": null
    },
    {
        "Archimedes cattle problem": "Archimedes Cattle Problem"
    },
    {
        " is equivalent to the Pell equation x2-410286423278424y21 , the fundamental solution of which has 206545 digits if written out explicitly. However, the solution is also equal to   : x1+y1  nu,   where   : u x1+y1  2   and x1 and y1 only have 45 and 41 decimal digits, respectively.      Methods related to the ": null
    },
    {
        "quadratic sieve": "Quadratic Sieve"
    },
    {
        " approach for ": null
    },
    {
        "integer factorization": "Integer Factorization"
    },
    {
        " may be used to collect relations between prime numbers in the number field generated by , and to combine these relations to find a product representation of this type. The resulting algorithm for solving Pells equation is more efficient than the continued fraction method, though it still takes more than polynomial time. Under the assumption of the ": null
    },
    {
        "generalized Riemann hypothesis": "Generalized Riemann Hypothesis"
    },
    {
        ", it can be shown to take time   :   O,   where N    log  n is the input size, similarly to the quadratic sieve .        showed that a ": null
    },
    {
        "quantum computer": "Quantum Computer"
    },
    {
        " can find a product representation, as described above, for the solution to Pells equation in polynomial time. Hallgrens algorithm, which can be interpreted as an algorithm for finding the group of units of a real ": null
    },
    {
        "quadratic number field": "Quadratic Number Field"
    },
    {
        ", was extended to more general fields by .       As an example, consider the instance of Pells equation for n 7; that is,   : x2-7y2 1   The sequence of convergents for the square root of seven are   :     Therefore, the fundamental solution is formed by the pair . Applying the recurrence formula to this solution generates the infinite sequence of solutions     :; ; ; ; ; ; ; ; ...      The smallest solution can be very large. For example, the smallest solution to x2-313y2 1 is , and this is the equation which Frenicle challenged Wallis to solve.  Values of n such that the smallest solution of x2-ny2 1 is greater than the smallest solution for any smaller value of n are   :1, 2, 5, 10, 13, 29, 46, 53, 61, 109, 181, 277, 397, 409, 421, 541, 661, 1021, 1069, 1381, 1549, 1621, 2389, 3061, 3469, 4621, 4789, 4909, 5581, 6301, 6829, 8269, 8941, 9949, ...    .         The following is a list of the smallest solution to x2 - ny2 1 with n ≤ 128. For square n, there is no solution except .                            Pells equation has connections to several other important subjects in mathematics.       Pells equation is closely related to the theory of ": null
    },
    {
        "algebraic number": "Algebraic Number"
    },
    {
        "s, as the formula   : x2 - n y2   is the ": null
    },
    {
        "norm": "Field Norm"
    },
    {
        " for the ": null
    },
    {
        "ring": "Ring"
    },
    {
        "   and for the closely related ": null
    },
    {
        "quadratic field": "Quadratic Field"
    },
    {
        "   . Thus, a pair of integers solves Pells equation if and only if x + y   is a ": null
    },
    {
        "unit": "Unit"
    },
    {
        " with norm 1 in   . ": null
    },
    {
        "Dirichlets unit theorem": "Dirichlets Unit Theorem"
    },
    {
        ", that all units of   can be expressed as powers of a single ": null
    },
    {
        "fundamental unit": "Fundamental Unit"
    },
    {
        " , is an algebraic restatement of the fact that all solutions to the Pell equation can be generated from the fundamental solution. The fundamental unit can in general be found by solving a Pell-like equation but it does not always correspond directly to the fundamental solution of Pells equation itself, because the fundamental unit may have norm −1 rather than 1 and its coefficients may be half integers rather than integers.       Demeyer mentions a connection between Pells equation and the ": null
    },
    {
        "Chebyshev polynomials": "Chebyshev Polynomials"
    },
    {
        "T i    and U i    are the Chebyshev polynomials of the first and second kind, respectively, then these polynomials satisfy a form of Pells equation in any ": null
    },
    {
        "polynomial ring": "Polynomial Ring"
    },
    {
        " Rx, with n x 2  −  1:     : Ti2 - U2 1.       Thus, these polynomials can be generated by the standard technique for Pell equations of taking powers of a fundamental solution:     : Ti + U   i.       It may further be observed that, if  are the solutions to any integer Pell equation, then x i  T i   and y i  y 1 U i  −  1  .       A general development of solutions of Pells equation x2-ny2 1 in terms of ": null
    },
    {
        "continued fractions": "Continued Fraction"
    },
    {
        "of   can be presented, as the solutions x and y are approximates to the square root of n and thus are a special case of continued fraction approximations for ": null
    },
    {
        "quadratic irrational": "Quadratic Irrational"
    },
    {
        "s.     The relationship to the continued fractions implies that the solutions to Pells equation form a ": null
    },
    {
        "semigroup": "Semigroup"
    },
    {
        " subset of the ": null
    },
    {
        "modular group": "Modular Group"
    },
    {
        ". Thus, for example, if p and q satisfy Pells equation, then     :   p & q   nq & p       is a matrix of unit ": null
    },
    {
        "determinant": "Determinant"
    },
    {
        ". Products of such matrices take exactly the same form, and thus all such products yield solutions to Pells equation. This can be understood in part to arise from the fact that successive convergents of a continued fraction share the same property: If p k−1 /q k−1 and p k /q k are two successive convergents of a continued fraction, then the matrix     :   p & p   q & q       has determinant k .     ": null
    },
    {
        "Størmers theorem": "Størmers Theorem"
    },
    {
        " applies Pell equations to find pairs of consecutive ": null
    },
    {
        "smooth number": "Smooth Number"
    },
    {
        "s. As part of this theory, ": null
    },
    {
        "Størmer": "Carl Størmer"
    },
    {
        " also investigated divisibility relations among solutions to Pells equation; in particular, he showed that each solution other than the fundamental solution has a ": null
    },
    {
        "prime factor": "Prime Factor"
    },
    {
        " that does not divide  n.     As Lenstra describes, Pells equation can also be used to solve ": null
    },
    {
        "Archimedes cattle problem": "Archimedes Cattle Problem"
    },
    {
        ".       The negative Pell equation is given by     : x2 - ny2 -1     It has also been extensively studied; it can be solved by the same method of continued fractions and will have solutions if and only if the period of the continued fraction has odd length. However it is not known which roots have odd period lengths and therefore not known when the negative Pell equation is solvable. A necessary condition for solvability is that n is not divisible by 4 or by a prime of form 4k  +  3. This is because the Pell equation implies that −1 is a ": null
    },
    {
        "quadratic residue": "Quadratic Residue"
    },
    {
        " modulo n. Thus, for example, x 2  −  3ny 2    −1 is never solvable, but x 2  −  5ny 2    −1 may be.     The first few numbers n for which x 2  −  ny 2    −1 is solvable are   :1, 2, 5, 10, 13, 17, 26, 29, 37, 41, 50, 53, 58, 61, 65, 73, 74, 82, 85, 89, 97, 101, 106, 109, 113, 122, 125, 130, 137, 145, 149, 157, 170, 173, 181, 185, 193, 197, 202, 218, 226, 229, 233, 241, 250, ... .      demonstrate that the proportion of square-free n divisible by k primes of the form 4m  +  1 for which the negative Pell equation is solvable is at least 40%. If the negative Pell equation does have a solution for a particular n, its fundamental solution leads to the fundamental one for the positive case by squaring both sides of the defining equation:     : 2 2     implies     : 2 - n2 1.       The related equation     : u2 - dv2   2     can be used to find solutions to the positive Pell equation for certain  d. ": null
    },
    {
        "Legendre": "Adrien-Marie Legendre"
    },
    {
        " proved that all primes of form d    4m  +  3 solve one case of , with the form 8m  +  3 solving the negative, and 8m  +  7 for the positive. Their fundamental solution then leads to the one for x 2 −dy 2    1. This can be shown by squaring both sides of     : 2 2     to get     : 2 - d2 4.     Since dv2 u2   2 from , it follows that     : 2 - d2 1,     and so the fundamental solutions to are smaller than those of the associated negative Pell equation. For example, u 2 -3v 2 -2 is  , so x 2  −  3y 2    1 has  . On the other hand, u 2  −  7v 2  2 is  , so x 2  −  7y 2 1 has     .     Another related equation,     : u2 - dv2   4     can also be used to find solutions to Pell equations for certain d, this time for the positive and negative case. For the following transformations,  if fundamental  are both ": null
    },
    {
        "odd": "Odd Number"
    },
    {
        ", then it leads to fundamental .     1. If u 2  −  dv 2 −4, and , then x 2  −  dy 2    −1.     Ex. Let d 13, then  and  .     2. If u 2  −  dv 2  4, and  , then x 2  −  dy 2    1.     Ex. Let d 13, then and .     3. If u 2  −  dv 2 −4, and  , then x 2  −  dy 2    1.     Ex. Let d 61, then  and  .     Especially for the last transformation, it can be seen how solutions to  are much smaller than , since the latter are ": null
    },
    {
        "sextic": "Sextic"
    },
    {
        " and ": null
    },
    {
        "quintic": "Quintic"
    },
    {
        " polynomials in terms of  u.       ": null
    }
]