[
    {
        "              Penguins  are a group of ": null
    },
    {
        "aquatic": "Water Bird"
    },
    {
        " flightless ": null
    },
    {
        "bird": "Bird"
    },
    {
        "s. They live almost exclusively in the ": null
    },
    {
        "Southern Hemisphere": "Southern Hemisphere"
    },
    {
        ", with only one species, the ": null
    },
    {
        "Galapagos penguin": "Galapagos Penguin"
    },
    {
        ", found north of the equator. Highly adapted for life in the water, penguins have ": null
    },
    {
        "countershaded": "Countershading"
    },
    {
        " dark and white ": null
    },
    {
        "plumage": "Plumage"
    },
    {
        ", and their wings have evolved into flippers. Most penguins feed on ": null
    },
    {
        "krill": "Krill"
    },
    {
        ", ": null
    },
    {
        "fish": "Fish"
    },
    {
        ", ": null
    },
    {
        "squid": "Squid"
    },
    {
        " and other forms of ": null
    },
    {
        "sea life": "Sea Life"
    },
    {
        " which they catch while swimming underwater. They spend roughly half of their lives on land and the other half in the sea.     Although almost all penguin species are native to the Southern Hemisphere, they are not found only in cold climates, such as Antarctica. In fact, only a few species of penguin live so far south. Several species are found in the ": null
    },
    {
        "temperate": "Temperate"
    },
    {
        " zone, and one species, the ": null
    },
    {
        "Galápagos penguin": "Galápagos Penguin"
    },
    {
        ", lives near the equator.     The largest living species is the ": null
    },
    {
        "emperor penguin": "Emperor Penguin"
    },
    {
        " :  on average, adults are about  tall and weigh . The smallest penguin species is the ": null
    },
    {
        "little blue penguin": "Little Penguin"
    },
    {
        " , also known as the fairy penguin, which stands around  tall and weighs . Among extant penguins, larger penguins inhabit colder regions, while smaller penguins are generally found in temperate or even tropical climates . Some ": null
    },
    {
        "prehistoric": "Prehistoric"
    },
    {
        " species attained enormous sizes, becoming as tall or as heavy as an adult human. These were not restricted to Antarctic regions; on the contrary, ": null
    },
    {
        "subantarctic": "Subantarctic"
    },
    {
        " regions harboured high diversity, and at least one giant penguin occurred in a region around 2,000  km south of the ": null
    },
    {
        "equator": "Equator"
    },
    {
        " 35  ": null
    },
    {
        "mya": "Mya"
    },
    {
        " , in a climate decidedly warmer than today.          The word penguin first appears in the 16th century as a synonym for ": null
    },
    {
        "great auk": "Great Auk"
    },
    {
        ".  When European explorers discovered what are today known as penguins in the Southern Hemisphere, they noticed their ": null
    },
    {
        "similar appearance": "Convergent Evolution"
    },
    {
        " to the great auk of the ": null
    },
    {
        "Northern Hemisphere": "Northern Hemisphere"
    },
    {
        ", and named them after this bird, although they are not closely related.     The etymology of the word penguin is still debated. The English word is not apparently of ": null
    },
    {
        "French": "French Language"
    },
    {
        ", ": null
    },
    {
        "Breton": "Breton Language"
    },
    {
        "  or ": null
    },
    {
        "Spanish": "Spanish Language"
    },
    {
        "  . Diccionario de la lengua española. rae.es origin , but first appears in English or Dutch.     Some dictionaries suggest a derivation from ": null
    },
    {
        "Welsh": "Welsh Language"
    },
    {
        " , head and , white ,  including the ": null
    },
    {
        "Oxford English Dictionary": "Oxford English Dictionary"
    },
    {
        ", the ": null
    },
    {
        "American Heritage Dictionary": "American Heritage Dictionary"
    },
    {
        ",  the ": null
    },
    {
        "Century Dictionary": "Century Dictionary"
    },
    {
        " and ": null
    },
    {
        "Merriam-Webster": "Merriam-Webster"
    },
    {
        ",  on the basis that the name was originally applied to the ": null
    },
    {
        "great auk": "Great Auk"
    },
    {
        ", either because it was found on ": null
    },
    {
        "White Head Island": "White Head Island"
    },
    {
        "  in Newfoundland, or because it had white circles around its eyes .     An alternative etymology links the word to ": null
    },
    {
        "Latin": "Latin Language"
    },
    {
        " , which means fat or oil .  Support for this etymology can be found in the alternative Germanic word for penguin,  or fat-goose , and the related Dutch word .     Adult male penguins are called cocks, females hens; a group of penguins on land is a waddle, and a similar group in the water is a raft.                       The number of extant penguin ": null
    },
    {
        "species": "Species"
    },
    {
        " is debated. Depending on which authority is followed, penguin ": null
    },
    {
        "biodiversity": "Biodiversity"
    },
    {
        " varies between 17 and 20 living species, all in the ": null
    },
    {
        "subfamily": "Subfamily"
    },
    {
        " Spheniscinae. Some sources consider the ": null
    },
    {
        "white-flippered penguin": "White-Flippered Penguin"
    },
    {
        " a separate  Eudyptula  species, while others treat it as a subspecies of the ": null
    },
    {
        "little penguin": "Little Penguin"
    },
    {
        "; ": null
    },
    {
        "Williams": "Williams"
    },
    {
        " the actual situation seems to be more complicated. Similarly, it is still unclear whether the ": null
    },
    {
        "royal penguin": "Royal Penguin"
    },
    {
        " is merely a colour morph of the ": null
    },
    {
        "macaroni penguin": "Macaroni Penguin"
    },
    {
        ". The status of the ": null
    },
    {
        "rockhopper penguins": "Rockhopper Penguin"
    },
    {
        "is also unclear.     Updated after Marples , Acosta Hospitaleche , and Ksepka et al. .     Subfamily Spheniscinae – modern penguins               Order Sphenisciformes     Basal and unresolved taxa     Anthropodyptes     Arthrodytes     Aprosdokitos  Hospitaleche, Reguero & Santillana 2017    Crossvallia     Ichthyopteryx  Wiman 1905    Inguza     Kaiika  Fordyce & Tomas 2011    Korora     Muriwaimanu     Nucleornis     Orthopteryx  Wiman 1905    Palaeoapterodytes     Pseudaptenodytes     Sequiwaimanu     Tasidyptes  Van Tets & O’Connor 1983 nomen dubium    Tereingaornis     Tonniornis     Wimanornis    Spheniscidae  Waimanu  Jones, Ando & Fordyce 2006    Kumimanu  Mayr, 2017    Delphinornis  Wiman 1905    Marambiornis  Myrcha et al. 2002    Mesetaornis  Myrcha et al. 2002    Perudyptes  Clarke et al. 2007    Anthropornis  Wiman 1905    Palaeeudyptes  Huxley 1859    Icadyptes  Clarke et al. 2007    Pachydyptes  Oliver 1930    Inkayacu  Clarke et al. 2010    Kairuku  Ksepka et al. 2012    Paraptenodytes  Ameghino 1891    Archaeospheniscus  Marples 1952    Duntroonornis  Marples 1953    Platydyptes  Marples 1952     Dege  Simpson 1979 – possibly Spheniscinae    Marplesornis  Simpson 1972   Subfamily Palaeospheniscinae      Eretiscus  Olson 1986    Palaeospheniscus  Moreno & Mercerat 1891 – includes Chubutodyptes Subfamily Spheniscinae   Spheniscidae gen. et sp. indet. CADIC P 21   Spheniscidae gen. et sp. indet.   ": null
    },
    {
        "Madrynornis": "Madrynornis"
    },
    {
        "     The Early Oligocene genus ": null
    },
    {
        "Cruschedula": "Cruschedula"
    },
    {
        " was formerly thought to belong to Spheniscidae, however reexamination of the holotype in 1943 resulted in the genus being placed in Accipitridae . Further examination in 1980 resulted in placement as Aves incertae sedis.       Some recent sources apply the phylogenetic taxon Spheniscidae to what here is referred to as Spheniscinae. Furthermore, they restrict the phylogenetic taxon Sphenisciformes to flightless taxa, and establish the phylogenetic taxon Pansphenisciformes as equivalent to the Linnean taxon Sphenisciformes, i.e., including any flying basal proto-penguins to be discovered eventually. Given that neither the relationships of the penguin subfamilies to each other nor the placement of the penguins in the avian phylogeny is presently resolved, this is confusing, so the established Linnean system is followed here.       thu , Tasmania   The evolution ary history of penguins is well-researched and represents a showcase of evolutionary biogeography . Although penguin bones of any one species vary much in size and few good specimens are known, the alpha taxonomy of many prehistoric forms still leaves much to be desired. Some seminal articles about penguin prehistory have been published since 2005; the evolution of the living genera can be considered resolved by now.     The basal penguins lived around the time of the Cretaceous–Paleogene extinction event somewhere in the general area of New Zealand and Byrd Land , Antarctica. Due to plate tectonics , these areas were at that time less than apart rather than the of today. The most recent common ancestor of penguins and their sister clade can be roughly dated to the Campanian – Maastrichtian boundary, around 70–68 mya. The exact divergence dates according to Baker et al. mentioned in this section are not as precisely resolved as it appears to be due to uncertainties of the molecular clock used.   What can be said as certainly as possible in the absence of direct evidence is that, by the end of the Cretaceous , the penguin lineage must have been evolutionarily well distinct, though much less so morphologically ; it is fairly likely that they were not yet entirely flightless at that time, as flightless birds have generally low resilience to the breakdown of trophic web s that follows the initial phase of mass extinctions because of their below-average dispersal capabilities .       The oldest known fossil penguin species is Waimanu manneringi, which lived in the early Paleocene epoch of New Zealand, or about 62 mya . While they were not as well-adapted to aquatic life as modern penguins, ": null
    },
    {
        "Waimanu": "Waimanu"
    },
    {
        " were generally loon -like birds but already flightless, with short wings adapted for deep diving. They swam on the surface using mainly their feet, but the wings were – as opposed to most other diving birds – already adapting to underwater locomotion.     Perudyptes from northern Peru was dated to 42 mya. An unnamed fossil from Argentina proves that, by the Bartonian , some 39–38 mya, Contra Baker et al. . primitive penguins had spread to South America and were in the process of expanding into Atlantic waters.       During the Late Eocene and the Early Oligocene , some lineages of gigantic penguins existed. Nordenskjoelds giant penguin was the tallest, growing nearly tall. The New Zealand giant penguin was probably the heaviest, weighing 80  kg or more. Both were found on New Zealand, the former also in the Antarctic farther eastwards.     Traditionally, most extinct species of penguins, giant or small, had been placed in the paraphyletic subfamily called Palaeeudyptinae . More recently, with new taxa being discovered and placed in the phylogeny if possible, it is becoming accepted that there were at least two major extinct lineages. One or two closely related ones occurred in Patagonia , and at least one other—which is or includes the paleeudyptines as recognized today – occurred on most Antarctic and Subantarctic coasts.     But size plasticity seems to have been great at this initial stage of penguin radiation : on Seymour Island , Antarctica, for example, around 10 known species of penguins ranging in size from medium to huge apparently coexisted some 35 mya during the Priabonian . It is not even known whether the gigantic palaeeudyptines constitute a monophyletic lineage, or whether gigantism was evolved independently in a much restricted Palaeeudyptinae and the Anthropornithinae – whether they were considered valid, or whether there was a wide size range present in the Palaeeudyptinae as delimited as usually done these days . The oldest well-described giant penguin, the -tall ": null
    },
    {
        "Icadyptes salasi": "Icadyptes Salasi"
    },
    {
        ", actually occurred as far north as northern Peru about 36 mya.     In any case, the gigantic penguins had disappeared by the end of the Paleogene , around 25 mya. Their decline and disappearance coincided with the spread of the Squalodontoidea and other primitive, fish-eating toothed whale s, which certainly competed with them for food, and were ultimately more successful. A new lineage, the Paraptenodytes , which includes smaller but decidedly stout-legged forms, had already arisen in southernmost South America by that time. The early Neogene saw the emergence of yet another morphotype in the same area, the similarly sized but more gracile Palaeospheniscinae , as well as the radiation that gave rise to the penguin biodiversity of our time.       Modern penguins constitute two undisputed clade s and another two more basal genera with more ambiguous relationships. To help resolve the evolution of this order , 19 high-coverage genomes that, together with 2 previously published genomes, encompass all extant penguin species have been sequenced . The origin of the Spheniscinae lies probably in the latest Paleogene, and geographically it must have been much the same as the general area in which the order evolved: the oceans between the Australia-New Zealand region and the Antarctic. Presumably diverging from other penguins around 40 mya, it seems that the Spheniscinae were for quite some time limited to their ancestral area, as the well-researched deposits of the Antarctic Peninsula and Patagonia have not yielded Paleogene fossils of the subfamily. Also, the earliest spheniscine lineages are those with the most southern distribution.     The genus ": null
    },
    {
        "Aptenodytes": "Aptenodytes"
    },
    {
        " appears to be the basalmost divergence among living penguins they have bright yellow-orange neck, breast, and bill patches; incubate by placing their eggs on their feet, and when they hatch the chicks are almost naked. This genus has a distribution centred on the Antarctic coasts and barely extends to some Subantarctic islands today.     ": null
    },
    {
        "Pygoscelis": "Pygoscelis"
    },
    {
        " contains species with a fairly simple black-and-white head pattern; their distribution is intermediate, centred on Antarctic coasts but extending somewhat northwards from there. In external morphology , these apparently still resemble the common ancestor of the Spheniscinae, as Aptenodytes autapomorph ies are in most cases fairly pronounced adaptations related to that genus extreme habitat conditions. As the former genus, Pygoscelis seems to have diverged during the Bartonian,   It is likely that, during the Bartonian, there was a near-synchronous but allopatric split between the ancestors of Aptenodytes, Pygoscelis, and the common ancestor of all remaining genera . but the range expansion and radiation that led to the present-day diversity probably did not occur until much later; around the Burdigalian stage of the Early Miocene , roughly 20–15 mya.     The genera ": null
    },
    {
        "Spheniscus": "Spheniscus"
    },
    {
        " and ": null
    },
    {
        "Eudyptula": "Eudyptula"
    },
    {
        " contain species with a mostly Subantarctic distribution centred on South America ; some, however, range quite far northwards. They all lack carotenoid colouration and the former genus has a conspicuous banded head pattern; they are unique among living penguins by nesting in burrows. This group probably radiated eastwards with the Antarctic Circumpolar Current out of the ancestral range of modern penguins throughout the Chattian , starting approximately 28 mya. While the two genera separated during this time, the present-day diversity is the result of a Pliocene radiation, taking place some 4–2 mya.     The Megadyptes–Eudyptes clade occurs at similar latitude s , has its highest diversity in the New Zealand region, and represents a westward dispersal. They are characterized by hairy yellow ornamental head feathers; their bills are at least partly red. These two genera diverged apparently in the Middle Miocene , but again, the living species of Eudyptes are the product of a later radiation, stretching from about the late Tortonian to the end of the Pliocene.       The geographical and temporal pattern or spheniscine evolution corresponds closely to two episodes of global cooling documented in the paleoclimatic record . The emergence of the Subantarctic lineage at the end of the Bartonian corresponds with the onset of the slow period of cooling that eventually led to the ice ages some 35 million years later. With habitat on the Antarctic coasts declining, by the Priabonian more hospitable conditions for most penguins existed in the Subantarctic regions rather than in Antarctica itself. Notably, the cold Antarctic Circumpolar Current also started as a continuous circumpolar flow only around 30 mya, on the one hand forcing the Antarctic cooling, and on the other facilitating the eastward expansion of ": null
    },
    {
        "Spheniscus": "Spheniscus"
    },
    {
        " to South America and eventually beyond. Despite this, there is no fossil evidence to support the idea of crown radiation from the Antarctic continent in the Paleogene, although DNA study favors such a radiation.     Later, an interspersed period of slight warming was ended by the Middle Miocene Climate Transition , a sharp drop in global average temperature from 14–12 mya, and similar abrupt cooling events followed at 8 mya and 4 mya; by the end of the Tortonian, the Antarctic ice sheet was already much like today in volume and extent. The emergence of most of todays Subantarctic penguin species almost certainly was caused by this sequence of Neogene climate shifts.       Penguin ancestry beyond ": null
    },
    {
        "Waimanu": "Waimanu"
    },
    {
        " ": null
    }
]