[
    {
        "           Personal jurisdiction is a courts jurisdiction over the parties to a lawsuit, as opposed to ": null
    },
    {
        "subject-matter jurisdiction": "Subject-Matter Jurisdiction"
    },
    {
        ", which is jurisdiction over the law and facts involved in the suit. If a court does not have personal jurisdiction over a party, its rulings or decrees cannot be enforced upon that party, except by ": null
    },
    {
        "comity": "Comity"
    },
    {
        "; i.e., to the extent that the sovereign which has jurisdiction over the party allows the court to enforce them upon that party. A court that has personal jurisdiction has both the authority to rule on the law and facts of a suit and the power to enforce its decision upon a party to the suit. In some cases, ": null
    },
    {
        "territorial jurisdiction": "Territorial Jurisdiction"
    },
    {
        " may also constrain a courts reach, such as preventing hearing of a case concerning events occurring on foreign territory between two citizens of the home jurisdiction.         Since there is no world government which all countries recognize to arbitrate disputes over jurisdiction, sovereign powers can find themselves in conflict over which is the more appropriate venue to hear a case, or which countrys laws should apply. These conflicts are sometimes resolved  de facto  by physical factors, such as which country has physical possession of a defendant or property, or sometimes by use of physical police or military force to seize people or property. A country with loose ": null
    },
    {
        "rule of law": "Rule Of Law"
    },
    {
        "   for example an ": null
    },
    {
        "absolute monarchy": "Absolute Monarchy"
    },
    {
        " with no independent judiciary   may arbitrarily choose to assert jurisdiction over a case without citing any particular justification. Such assertion can cause problems, such as encouraging other countries to take arbitrary actions over foreign citizens and property, or even provoking skirmishes or armed conflict.     In practice, many countries operate by one or another principles, either in written law or in practice, which communicate when the country will and will not assert jurisdiction:   treaty jurisdiction — An international ": null
    },
    {
        "treaty": "Treaty"
    },
    {
        " explicitly decides the issue.   ": null
    },
    {
        "territorial principle": "Territorial Principle"
    },
    {
        " — A country asserts jurisdiction over people, property, and events taking place on its own territory.   nationality principle — A country asserts jurisdiction over the conduct of its citizens, anywhere in the world.   passive personality principle — A country asserts jurisdiction over acts committed against its citizens, anywhere in the world.   protective principle — A country asserts jurisdiction over issues that affect its interests, such as conspiracies to overthrow its government, or resources critical to its economy    ": null
    },
    {
        "universal jurisdiction": "Universal Jurisdiction"
    },
    {
        " — A country asserts jurisdiction over certain acts committed by anyone, anywhere in the world. Usually reserved for exceptionally serious crimes, such as ": null
    },
    {
        "war crimes": "War Crime"
    },
    {
        "and ": null
    },
    {
        "crimes against humanity": "Crimes Against Humanity"
    },
    {
        ".     Different principles are applied by different countries, and different principles may be applied by the same country in different circumstances. Determination of whether or not a court has jurisdiction to hear a case is the first stage of a ": null
    },
    {
        "conflict of laws": "Conflict Of Laws"
    },
    {
        " proceeding, potentially followed by ": null
    },
    {
        "choice of law": "Choice Of Law"
    },
    {
        " to determine which jurisdictions laws apply. Executive prosecutorial authority and ": null
    },
    {
        "foreign policy": "Foreign Policy"
    },
    {
        " also play a role in scope and practical impact of jurisdiction choices.     Any assertion of jurisdiction based on anything other than the territorial principle is known as ": null
    },
    {
        "extraterritorial jurisdiction": "Extraterritorial Jurisdiction"
    },
    {
        ". Prosecution of a case against an out-of-territory defendant is known as assertion of ": null
    },
    {
        "long-arm jurisdiction": "Long-Arm Jurisdiction"
    },
    {
        ".     When a person commits a crime in a foreign country against the laws of that country, usually the host country is responsible for prosecution. The ": null
    },
    {
        "Vienna Convention on Consular Relations": "Vienna Convention On Consular Relations"
    },
    {
        " requires that the host country notify the foreign embassy, potentially allowing the foreign country to assist in legal defense and monitor conditions of detention.     Foreign diplomats enjoy ": null
    },
    {
        "diplomatic immunity": "Diplomatic Immunity"
    },
    {
        " in many countries based on the ": null
    },
    {
        "Vienna Convention on Diplomatic Relations": "Vienna Convention On Diplomatic Relations"
    },
    {
        " or bilateral agreement, and foreign military personnel may be subject to the jurisdiction of their home country based on a ": null
    },
    {
        "status of forces agreement": "Status Of Forces Agreement"
    },
    {
        " or ": null
    },
    {
        "Visiting Forces Agreement": "Visiting Forces Agreement"
    },
    {
        ".     If a person is not physically present in the country which wishes to prosecute a case, that country may either wait until the person enters the national territory, or pursue ": null
    },
    {
        "extradition": "Extradition"
    },
    {
        " by legal or extralegal means, and with or without a general extradition treaty. Some countries prefer to prosecute their own citizens for crimes committed abroad rather than extradite them. Other countries defer to the host country.     When a crime is committed outside the territory of any country, such as in ": null
    },
    {
        "Antarctica": "Antarctica"
    },
    {
        ", on watercraft in ": null
    },
    {
        "international waters": "International Waters"
    },
    {
        ", on aircraft in ": null
    },
    {
        "international airspace": "International Airspace"
    },
    {
        ", and on ": null
    },
    {
        "spacecraft": "Spacecraft"
    },
    {
        ", jurisdiction is usually determined by the nationality of defendants or victims, or by the ": null
    },
    {
        "flag state": "Flag State"
    },
    {
        " of the vessel. This is determined by the ": null
    },
    {
        "admiralty law": "Admiralty Law"
    },
    {
        " of the countries involved and in international agreements.         The concept of personal jurisdiction in English law has its origin in the idea that a monarch could not exercise power over persons or property located outside of his or her kingdom. Fundamental law in English constitutional history By ": null
    },
    {
        "John Wiedhofft Gough": "John Wiedhofft Gough"
    },
    {
        " Pg. 52 To some degree, this was a de facto rule; the monarchs men could not arrest people or seize property outside the kingdom without risking physical conflict with the soldiers and police of other kingdoms. Slowly this principle was incorporated into written law, but problems arose in cases where property owners could not be sued because they had left the kingdom or had died and therefore were not present within the kingdom at the time they were being sued. To solve this problem, the courts created another type of jurisdiction, called quasi in rem, that is, jurisdiction over the land itself, even if the person who owned the land was not in the country. However, this jurisdiction was limited to the settlement of debts owed by the owner of the land.     In the United States, the exercise of personal jurisdiction by a court must both comply with ": null
    },
    {
        "Constitutional": "U.S. Constitution"
    },
    {
        " limitations, and be authorized by a statute.   In the United Kingdom, the exercise of personal jurisdiction does not need a statutory basis, since the United Kingdom does not have a written constitution.              The intersection of ": null
    },
    {
        "American federalism": "Federalism In The United States"
    },
    {
        " and the rules and theories of jurisdiction inherited from the ": null
    },
    {
        "common law": "Common Law"
    },
    {
        " of England has resulted in a highly complex body of law respecting personal jurisdiction in the United States. These rules limit both state and federal courts in their ability to hear cases.         Three fundamentals of personal jurisdiction constrain the ability of courts in the United States to bind individuals or property to its decisions: consent, power, and notice. Pennoyer v. Neff, 95 U.S. 714;        The United States legal system is an ": null
    },
    {
        "adversarial system": "Adversarial System"
    },
    {
        ". Civil suits cannot be initiated by third parties, but must be filed by the aggrieved party who seeks redress. Generally, the action is initiated in the jurisdiction where the event occurred, where the defendant can be served or where the parties have agreed to have the case located. The filing of a complaint or prayer for relief is a voluntary action by the person aggrieved, and as a necessity of this request, the person seeking relief consents to be bound by the judgment of the court. The doctrine of consent is also extended to defendants who attend and litigate actions without challenging the courts personal jurisdiction. Consent may also derive from a pre-litigation agreement by the parties, such as a ": null
    },
    {
        "forum selection clause": "Forum Selection Clause"
    },
    {
        " in a contract . Doctrines such as ": null
    },
    {
        "claim preclusion": "Res Judicata"
    },
    {
        " prevent re-litigation of failed complaints in alternative forums. ": null
    },
    {
        "Claim preclusion": "Res Judicata"
    },
    {
        " does not, however, prevent the refiling of a claim that was filed in a court that did not have personal jurisdiction over the defendant.       In cases where a defendant challenges personal jurisdiction, a court may still exercise personal jurisdiction if it has independent power to do so.  This power is founded in the inherent nature of the State: ": null
    },
    {
        "sovereignty": "Sovereignty"
    },
    {
        " over affairs within its territory. .       The ": null
    },
    {
        "Fifth": "Fifth Amendment To The United States Constitution"
    },
    {
        " and ": null
    },
    {
        "Fourteenth Amendment to the United States Constitution": "Fourteenth Amendment To The United States Constitution"
    },
    {
        " preserve the right of the individual to due process. Due process requires that notice be given in a manner reasonably calculated to inform a party of the action affecting him. Originally, Notice was often exercised more forcefully, the defendant in a civil case sometimes being seized and brought before the court under a writ of  capias ad respondendum . Notice in such a case is inferred from consent of the defendant to go with the officer. Nowadays, when exercising power over an individual without consent, notice is usually given by formal delivery of suitable papers to the defendant .       Originally, jurisdiction over parties in the United States was determined by strict interpretation of the geographic boundaries of each states sovereign power. In Pennoyer v. Neff, the Supreme Court discussed that though each state ceded certain powers to the Federal Government or to no entity at all , the states retained all the other powers of sovereignty, including the exclusive power to regulate the affairs of individuals and property within its territory. Pennoyer, 95 U.S. at 722. Necessarily following from this, one states exercise of power could not infringe upon the sovereignty of another state. Thus, Constitutional limitations applied to the validity of state court judgments.     Three types of jurisdiction developed, collectively termed ": null
    },
    {
        "territorial jurisdiction": "Territorial Jurisdiction"
    },
    {
        " because of their reliance upon territorial control:  in personam  jurisdiction,  in rem  jurisdiction, and  quasi in rem  jurisdiction. Some sources refer to all three types of territorial jurisdiction as personal jurisdiction, since most actions against property bear, in the end, upon the rights and obligations of persons. See e.g., Friedenthal, Kane & Miller, Civil Procedure, ¶ 3.14 at 150 . Others continue to recognize the traditional distinction between personal jurisdiction and jurisdiction over property, even after Shaffer v. Heitner . See e.g., Blacks Law Dictionary, 6th ed., 1144 .     In personam jurisdiction referred to jurisdiction over a particular person . In personam jurisdiction, if held by a state court, permitted that court to rule upon any case over which it otherwise held jurisdiction. Under territorial jurisdiction, pure in personam jurisdiction could only be established by serving notice upon the individual while that individual was within the territory of the state. 95 U.S. at 724.     In rem jurisdiction referred to jurisdiction over a particular piece of property, most commonly real estate or land. Certain cases, notably government suits for unpaid property taxes, proceed not against an individual but against their property directly. Under territorial jurisdiction, in rem jurisdiction could be exercised by the courts of a state by seizing the property in question. Since an actual tract of land could not literally be brought into a courtroom as a person could, this was effected by giving notice upon the real property itself. In rem jurisdiction was thus supported by the assumption that the owner of that property, having a concrete economic interest in the property, had a duty to look after the affairs of their property, and would be notified of the pending case by such seizure. In rem jurisdiction was limited to deciding issues regarding the specific property in question.     Quasi in rem jurisdiction involved the seizure of property held by the individual against whom the suit was brought, and attachment of that property to the case in question. This form of territorial jurisdiction developed from the rationale of in rem jurisdiction, namely that seizure of the property was reasonably calculated to inform an individual of the proceedings against them.     Once a valid judgment was obtained against an individual, however, the plaintiff could pursue recovery against the assets of the defendant regardless of their location, as other states were obligated by the ": null
    },
    {
        "Full Faith and Credit Clause of the Constitution": "Full Faith And Credit Clause"
    },
    {
        " to recognize such a judgment . Violations by a rogue state could be checked via ": null
    },
    {
        "collateral attack": "Collateral Attack"
    },
    {
        "Pennoyer territorial jurisdictionPennoyer, extreme applications of territorial jurisdiction revealed imperfections in the doctrine, and societal changes began to present new problems as the United States national economy became more integrated by increasingly efficient multi-state transportation technology and business practices.     While determining the physical location of an individual for the purposes of in personam jurisdiction was easy enough, applying the same principle to non-physical entities became difficult. Courts were presented with the question of where a company was present and amenable to service for the purpose of in personam jurisdiction over the company.     Extension of quasi in rem jurisdiction led to extreme results that threatened the justification for the jurisdiction. Bearing in mind that territorial jurisdiction existed in a pre-industrial society where transportation across the country was difficult, long, and potentially treacherous, and consider the hypothetical wherein Alice owes Bob money, and Bob owes Carmel, a resident of New York, money. Carmel seeks to recover on Bobs debt to Carmel, however cannot do so because Bob avoids Carmel by travelling to California. Alice, however, happens to travel through New York. Carmel serves notice upon Alice, and attaches Alices debt to Bob to the proceeding. Alice can no more certainly provide notice to Bob in California than Carmel could provide, and the transient and involuntary exposure of Bob to being hauled into court in New York by this attachment seems to erode the original rationale of quasi in rem jurisdiction.     The US Supreme Court largely abolished the exercise of jurisdiction on the basis of quasi in rem in  Shaffer v. Heitner , . except in exceptional circumstances, which sometimes would arise while dealing with real property such as land, and when the owner of the land cannot be found.     International Shoe doctrine. The minimum contacts must be purposefully directed towards the state by the defendant. International Shoe, 326 U.S. at 319. This jurisdiction was initially limited to the particulars of the  International Shoe Co. v. Washington  holding, that is to jurisdictional inquiries regarding companies, but was soon extended to apply to all questions of personal jurisdiction. When an individual or entity has no minimum contacts with a forum State, the ": null
    },
    {
        "Due Process Clause": "Due Process Clause"
    },
    {
        " of the Fourteenth Amendment prohibits that State from acting against that individual, or entity. The lack of minimum contacts with the owner of property also constitutionally prohibits action against that property even when the property is located within the forum state. See Shaffer, 433 U.S. at 212.     What constitutes sufficient minimum contacts has been delineated in numerous cases which followed the International Shoe decision. For example, in  Hanson v. Denckla , the Court proclaimed the unilateral activity of those who claim some relationship with a nonresident cannot satisfy the requirement of contact with the forum State. The application of that rule will vary with the nature and quality of the defendants activity, but it is essential in each case that there be some act by which the defendant purposefully avails itself of the privilege of conducting activities within the forum State, thus invoking the benefits and protection of its laws. .     The additional requirement of purposeful availment ensures that a defendant will not be hauled into a jurisdiction solely as a result of random, fortuitous, or attenuated contacts, or of the unilateral activity of another party or a third person . See . Jurisdiction may, however, be exercised, under some circumstances, even though the defendant never physically entered the forum State. See, e.g.,  .     In addition, the claim must arise from those contacts that the defendant had with the forum state. In addition to the minimum contacts test asserted in ": null
    },
    {
        "International Shoe": "International Shoe"
    },
    {
        ", the assertion of specific personal jurisdiction must be reasonable. The Court in  World-Wide Volkswagen Corp. v. Woodson  asserted a five-part test for determining if the assertion of personal jurisdiction in a forum state was reasonable. This test considers: the burden on the defendant from litigating in the forum state; the interest of the forum state in having the case adjudicated there; the interests of the plaintiff in adjudicating in the forum state; the interests of the inter-state judiciary—that is, that a courts assertion of personal jurisdiction over an out-of state defendant would not overreach and preempt the interests and judicial sovereignty of another state; and the interests in preserving the judicial integrity of the several states—that is, ensuring one courts assertion of personal jurisdiction over an out of state defendant does not violate the Due Process Clause of the Fourteenth Amendment. .     In another recent case of  Goodyear Dunlop Tires Operations, S. A. v. Brown , Justice Ginsburg held that for the exercise of general jurisdiction in personam, the defendant must be essentially at home. This applies when the defendant has contacts with the forum state, but the claim that arises is not related to those contacts. For example, if ": null
    },
    {
        "Harrods": "Harrods"
    },
    {
        " sets up an office in California to export and sell goods there, and because of that someone gets injured, it would be amenable to suit in California for that injury. On the other hand, if someone is injured in Harrods in London and for some reason finds that California law is more favorable and decides to sue in California, the suit would not be maintainable since the contacts that Harrods has is not continuous and systematic, and they are not essentially at home in California.     This holding was reaffirmed in 2014 by the Supreme Court in  Daimler AG v. Bauman .       While the Pennoyer and later Shoe doctrines limit the maximum power of a sovereign state, courts must also have authorization to exercise the states power; an individual state may choose to not grant its courts the full power that the state is Constitutionally permitted to exercise.  Similarly, the jurisdiction of Federal courts are statutorily-defined. Thus, a particular exercise of personal jurisdiction must not only be permitted by Constitutional doctrine, but be statutorily authorized as well. Under Pennoyer, personal jurisdiction was authorized by statutes authorizing service of process, but these methods of service often lacked because they required such service to be effected by officers of the state, such as sheriffs – an untenable method for defendants located outside of the state but still subject to jurisdiction due to their contacts with the state. Subsequent to the development of the Shoe Doctrine, states have enacted so-called ": null
    },
    {
        "long-arm statute": "Long-Arm Statute"
    },
    {
        "s, by which courts in a state can serve process and thus exercise jurisdiction over a party located outside the state. The doctrine of International Shoe applies only in cases where there is no presence in the forum state. For example, if A committed a tort in State X. He is sued by B and B serves him with process just before he leaves State X before the flight was took off, the service would be valid and State X would have jurisdiction over A. If A did not comply with the final judgement passed by the courts of State X, B could enforce that judgement in the state where A resides under the full faith and credit clause of the US Constitution. There was one case where a defendant was served while the airplane was in the air over the forum State, and the federal district court held that this was valid service, since at law the territory of a state includes the airspace above the State.        ": null
    },
    {
        "Venue": "Venue"
    },
    {
        " and personal jurisdiction are closely related for practical purposes. A ": null
    },
    {
        "lawyer": "Lawyer"
    },
    {
        " should usually perform joint analysis of personal jurisdiction and venue issues. Personal jurisdiction is largely a constitutional requirement, though also shaped by state long-arm statutes and Rule 4 of the Federal Rules of Civil Procedure, while venue is purely statutory.     It is possible for either venue or personal jurisdiction to preclude a court from hearing a case. Consider these examples:     Personal jurisdiction is the limiting factor. In  World-Wide Volkswagen Corp. v. Woodson , the plaintiffs sued, in an ": null
    },
    {
        "Oklahoma": "Oklahoma"
    },
    {
        " state court, an automobile dealership based in ": null
    },
    {
        "New York": "New York"
    },
    {
        " for damages from an ": null
    },
    {
        "explosion": "Explosion"
    },
    {
        " that occurred on June 11, 1977, as the plaintiffs drove the ": null
    },
    {
        "car": "Car"
    },
    {
        " through Oklahoma. Had the plaintiffs sued in U.S. federal court sited in Oklahoma, personal jurisdiction against the dealership would have been unavailable, as the dealership did not have minimum contacts with the forum state. Venue, however, would have been proper under , the general federal venue statute, because Oklahoma was a state in which a substantial part of the events or omissions giving rise to the claim occurred. However, the United States Supreme Court found that the defendants did not have the minimum contacts with Oklahoma necessary to create personal jurisdiction there.   Venue is the limiting factor. Suppose Dale resides in California. Peter from ": null
    },
    {
        "Nevada": "Nevada"
    },
    {
        " wants to sue Dale for battery which Dale committed against Peter in California. Peter knows Dale is going to a week-long conference in ": null
    },
    {
        "South Carolina": "South Carolina"
    }
]