[
    {
        "   The Phanerozoic Eon is the current ": null
    },
    {
        "geologic eon": "Eon"
    },
    {
        " in the ": null
    },
    {
        "geologic time scale": "Geologic Time Scale"
    },
    {
        ", and the one during which abundant ": null
    },
    {
        "animal": "Animal"
    },
    {
        " and ": null
    },
    {
        "plant": "Plant"
    },
    {
        " life": "Life"
    },
    {
        " has existed. It covers  million years to the present, and began with the ": null
    },
    {
        "Cambrian": "Cambrian"
    },
    {
        " Period when animals first developed hard shells preserved in the fossil record. Its name was derived from the ": null
    },
    {
        "Ancient Greek": "Ancient Greek"
    },
    {
        " words   and  , meaning visible life, since it was once believed that life began in the ": null
    },
    {
        "Cambrian": "Cambrian"
    },
    {
        ", the first ": null
    },
    {
        "period": "Geological Period"
    },
    {
        " of this eon. The term Phanerozoic was coined in 1930 by the American geologist George Halcott Chadwick .   The time before the Phanerozoic, called the  Precambrian , is now divided into the ": null
    },
    {
        "Hadean": "Hadean"
    },
    {
        ", ": null
    },
    {
        "Archaean": "Archean"
    },
    {
        " and ": null
    },
    {
        "Proterozoic": "Proterozoic"
    },
    {
        " eons.     The time span of the Phanerozoic starts with the sudden appearance of fossilized evidence of a number of animal ": null
    },
    {
        "phyla": "Phylum"
    },
    {
        "; the ": null
    },
    {
        "evolution": "Evolution"
    },
    {
        " of those phyla into diverse forms; the emergence and ": null
    },
    {
        "development of complex plants": "Evolutionary History Of Plants"
    },
    {
        "; the ": null
    },
    {
        "evolution of fish": "Evolution Of Fish"
    },
    {
        "; the ": null
    },
    {
        "emergence of insects": "Phylogeny Of Insects"
    },
    {
        " and ": null
    },
    {
        "tetrapods": "Evolution Of Tetrapods"
    },
    {
        "; and the development of modern ": null
    },
    {
        "fauna": "Fauna"
    },
    {
        ". ": null
    },
    {
        "Plant": "Plant"
    },
    {
        " life on land appeared in the early Phanerozoic eon. During this time span, ": null
    },
    {
        "tectonic forces": "Plate Tectonics"
    },
    {
        " caused the continents to move and eventually collect into a single landmass known as ": null
    },
    {
        "Pangaea": "Pangaea"
    },
    {
        " , which then separated into the current continental landmasses.             The ": null
    },
    {
        "Proterozoic": "Proterozoic"
    },
    {
        "-Phanerozoic boundary is at   million years ago.  In the 19th  century, the boundary was set at time of appearance of the first abundant animal  ": null
    },
    {
        "fossils": "Fossil"
    },
    {
        "but several hundred groups  of metazoa of the earlier Proterozoic era have been identified since the systematic study of those forms started in the 1950s. Most ": null
    },
    {
        "geologists": "Geologist"
    },
    {
        "and ": null
    },
    {
        "paleontologists": "Paleontologist"
    },
    {
        "would probably set the Proterozoic-Phanerozoic boundary either at the classic point where the first ": null
    },
    {
        "trilobites": "Trilobite"
    },
    {
        "and reef-building animals  such as ": null
    },
    {
        "corals": "Coral"
    },
    {
        "and others appear; at the first appearance of a complex feeding burrow called  Treptichnus pedum ; or at the first appearance of a group of small, generally disarticulated, armored forms termed the ": null
    },
    {
        "small shelly fauna": "Small Shelly Fauna"
    },
    {
        ". The three different dividing points are within a few million years of each other.     In the older literature, the term Phanerozoic is generally used as a label for the time period of interest to paleontologists, but that use of the term seems to be falling into disuse in more modern literature.         The Phanerozoic is divided into three ": null
    },
    {
        "eras": "Era"
    },
    {
        ": the ": null
    },
    {
        "Paleozoic": "Paleozoic"
    },
    {
        ", ": null
    },
    {
        "Mesozoic": "Mesozoic"
    },
    {
        ", and ": null
    },
    {
        "Cenozoic": "Cenozoic"
    },
    {
        ", which are further subdivided into 12 periods. The Paleozoic features the rise of fish, amphibians and reptiles. The Mesozoic is ruled by the reptiles, and features the evolution of mammals, and more famously, dinosaurs, including birds. The Cenozoic is the time of the mammals, and more recently, humans.          The Paleozoic is a time in Earths history when complex life forms evolved, took their first breath of oxygen on dry land, and when the forerunners of all life on Earth began to diversify. There are six periods in the Paleozoic era: ": null
    },
    {
        "Cambrian": "Cambrian"
    },
    {
        ", ": null
    },
    {
        "Ordovician": "Ordovician"
    },
    {
        ", ": null
    },
    {
        "Silurian": "Silurian"
    },
    {
        ", ": null
    },
    {
        "Devonian": "Devonian"
    },
    {
        ", ": null
    },
    {
        "Carboniferous": "Carboniferous"
    },
    {
        " and ": null
    },
    {
        "Permian": "Permian"
    },
    {
        ".              The Cambrian is the first period of the Paleozoic Era and starts from . The Cambrian sparked a rapid expansion in evolution in an event known as the ": null
    },
    {
        "Cambrian explosion": "Cambrian Explosion"
    },
    {
        " during which the greatest number of creatures evolved in a single period in the history of Earth. Plants like algae evolved, and the fauna was dominated by armored arthropods, such as ": null
    },
    {
        "trilobite": "Trilobite"
    },
    {
        "s. Almost all marine phyla evolved in this period. During this time, the super-continent ": null
    },
    {
        "Pannotia": "Pannotia"
    },
    {
        " began to break up, most of which later recombined into the super-continent ": null
    },
    {
        "Gondwana": "Gondwana"
    },
    {
        ".           The Ordovician spans from 485 million years to 444 million years ago. The Ordovician was a time in Earths history in which many species still prevalent today evolved, such as primitive fish, ": null
    },
    {
        "cephalopod": "Cephalopod"
    },
    {
        "s, and ": null
    },
    {
        "coral": "Coral"
    },
    {
        ". The most common forms of life, however, were ": null
    },
    {
        "trilobite": "Trilobite"
    },
    {
        "s, snails and shellfish. More importantly, the first ": null
    },
    {
        "arthropods": "Arthropod"
    },
    {
        "crept ashore to colonize ": null
    },
    {
        "Gondwana": "Gondwana"
    },
    {
        ", a continent empty of animal life. By the end of the Ordovician, Gondwana had moved from the equator to the ": null
    },
    {
        "South Pole": "South Pole"
    },
    {
        ", and ": null
    },
    {
        "Laurentia": "Laurentia"
    },
    {
        " had collided with ": null
    },
    {
        "Baltica": "Baltica"
    },
    {
        ", closing the ": null
    },
    {
        "Iapetus Ocean": "Iapetus Ocean"
    },
    {
        ". The glaciation of Gondwana resulted in a major drop in sea level, killing off all life that had established along its coast. Glaciation caused a ": null
    },
    {
        "snowball Earth": "Snowball Earth"
    },
    {
        ", leading to the ": null
    },
    {
        "Ordovician–Silurian extinction": "Ordovician–Silurian Extinction Events"
    },
    {
        ", during which 60% of marine invertebrates and 25% of families became extinct. This is considered the first mass extinction and the second deadliest in the history of Earth.           The Silurian spans from 444 million years to 419 million years ago, which saw a warming from ": null
    },
    {
        "snowball Earth": "Snowball Earth"
    },
    {
        ". This period saw the mass evolution of fish, as jawless fish became more numerous, jawed fish evolved, and the first freshwater fish evolved, though arthropods, such as ": null
    },
    {
        "sea scorpions": "Eurypterid"
    },
    {
        ", remained the apex predators. Fully terrestrial life evolved, which included early arachnids, fungi, and centipedes. The evolution of ": null
    },
    {
        "vascular plants": "Vascular Plant"
    },
    {
        "  allowed plants to gain a foothold on land. These early terrestrial plants are the forerunners of all plant life on land. During this time, there were four continents: ": null
    },
    {
        "Gondwana": "Gondwana"
    },
    {
        " , ": null
    },
    {
        "Laurentia": "Laurentia"
    },
    {
        " , ": null
    },
    {
        "Baltica": "Baltica"
    },
    {
        " , and ": null
    },
    {
        "Siberia": "Siberia"
    },
    {
        " . The recent rise in sea levels provided new habitats for many new species.              The Devonian spans from 419 million years to 359 million years ago. Also informally known as the Age of the Fish , the Devonian features a huge diversification in fish, including armored fish like  Dunkleosteus  and ": null
    },
    {
        "lobe-finned fish": "Sarcopterygii"
    },
    {
        " which eventually evolved into the first ": null
    },
    {
        "tetrapod": "Tetrapod"
    },
    {
        "s. On land, plant groups diversified; the first trees and seeds evolved. By the Middle Devonian, shrub-like forests of primitive plants existed: ": null
    },
    {
        "lycophytes": "Lycopodiophyta"
    },
    {
        ", ": null
    },
    {
        "horsetails": "Equisetales"
    },
    {
        ", ": null
    },
    {
        "fern": "Fern"
    },
    {
        "s, and ": null
    },
    {
        "progymnosperm": "Progymnosperm"
    },
    {
        ". This event also allowed the diversification of arthropod life as they took advantage of the new habitat. The first amphibians also evolved, and the fish were now at the top of the food chain. Near the end of the Devonian, 70% of all species became extinct in an event known as the ": null
    },
    {
        "Late Devonian extinction": "Late Devonian Extinction"
    },
    {
        ", which is the second mass extinction known to have happened.              The Carboniferous spans from 359 million to 299 million years ago. During this period, average global temperatures were exceedingly high: the early Carboniferous averaged at about 20 degrees Celsius .  Tropical swamps dominated the Earth, and the large amounts of trees created much of the carbon that became coal deposits . The high oxygen levels caused by these swamps allowed massive arthropods, normally limited in size by their ": null
    },
    {
        "respiratory systems": "Respiratory System Of Insects"
    },
    {
        ", to proliferate. Perhaps the most important evolutionary development of the time was the evolution of ": null
    },
    {
        "amniotic egg": "Amniotic Egg"
    },
    {
        "s, which allowed amphibians to move farther inland and remain the dominant vertebrates throughout the period. Also, the first reptiles and ": null
    },
    {
        "synapsids": "Synapsid"
    },
    {
        "evolved in the swamps. Throughout the Carboniferous, there was a cooling pattern, which eventually led to the glaciation of ": null
    },
    {
        "Gondwana": "Gondwana"
    },
    {
        " as much of it was situated around the south pole, in an event known as the Permo-Carboniferous glaciation or the ": null
    },
    {
        "Carboniferous rainforest collapse": "Carboniferous Rainforest Collapse"
    },
    {
        ".              The Permian spans from 299 million to 252 million years ago and was the last period of the Paleozoic era. At its beginning, all continents came together to form the super-continent ": null
    },
    {
        "Pangaea": "Pangaea"
    },
    {
        ", surrounded by one ocean called ": null
    },
    {
        "Panthalassa": "Panthalassa"
    },
    {
        ". The Earth was very dry during this time, with harsh seasons, as the climate of the interior of Pangaea wasnt regulated by large bodies of water. Reptiles and ": null
    },
    {
        "synapsids": "Synapsid"
    },
    {
        "flourished in the new dry climate. Creatures such as  Dimetrodon  and  Edaphosaurus  ruled the new continent. The first conifers evolved, then dominated the terrestrial landscape. Nearing the end of the period,  Scutosaurus  and ": null
    },
    {
        "gorgonopsids": "Gorgonopsia"
    },
    {
        " filled the arid landmass. Eventually, they disappeared, along with 95% of all life on Earth in an event simply known as ": null
    },
    {
        "the Great Dying": "Permian–Triassic Extinction Event"
    },
    {
        " , the worlds third mass extinction event and the largest in its history.            The Mesozoic ranges from 252 million to 66 million years ago. Also known as the age of the ": null
    },
    {
        "dinosaurs": "Dinosaurs"
    },
    {
        " , the Mesozoic features the rise of reptiles on their 150-million-year conquest of the Earth on the land, in the seas, and in the air. There are three periods in the Mesozoic: Triassic, Jurassic, and Cretaceous.          The Triassic ranges from 252 million to 201 million years ago. The Triassic is a transitional time in Earths history between the ": null
    },
    {
        "Permian Extinction": "Permian Extinction"
    },
    {
        " and the lush Jurassic Period. It has three major epochs: Early Triassic, Middle Triassic and Late Triassic.      The Early Triassic lasted between 252 million to 247 million years ago, and was dominated by deserts as ": null
    },
    {
        "Pangaea": "Pangaea"
    },
    {
        " had not yet broken up, thus the interior was arid. The Earth had just witnessed a massive die-off in which 95% of all life became extinct. The most common life on Earth were  Lystrosaurus , ": null
    },
    {
        "labyrinthodont": "Labyrinthodont"
    },
    {
        "s, and  Euparkeria  along with many other creatures that managed to survive ": null
    },
    {
        "the Great Dying": "The Great Dying"
    },
    {
        ". ": null
    },
    {
        "Temnospondyli": "Temnospondyli"
    },
    {
        " flourished during this time and were dominant predators for much of the Triassic.       The Middle Triassic spans from 247 million to 237 million years ago. The Middle Triassic featured the beginnings of the breakup of ": null
    },
    {
        "Pangaea": "Pangaea"
    },
    {
        ", and the beginning of the Tethys Sea. The ecosystem had recovered from the devastation of the Great Dying. Phytoplankton, coral, and crustaceans all had recovered, and the reptiles began increasing in size. New aquatic reptiles, such as ": null
    },
    {
        "ichthyosaurs": "Ichthyosaur"
    },
    {
        "and ": null
    },
    {
        "nothosaur": "Nothosaur"
    },
    {
        "s, proliferated in the seas. Meanwhile, on land, pine forests flourished, as well as mosquitoes and fruit flies. The first ancient crocodilians evolved, which sparked competition with the large amphibians that had long ruled the freshwater world.      The Late Triassic spans from 237 million to 201 million years ago. Following the bloom of the Middle Triassic, the Late Triassic featured frequent rises of temperature, as well as moderate precipitation . The recent warming led to a boom of reptilian evolution on land as the first true dinosaurs evolved, as well as ": null
    },
    {
        "pterosaur": "Pterosaur"
    },
    {
        "s. By the end of the period the first gigantic dinosaurs had evolved and advanced pterosaurs colonised Pangaeas deserts.   The climactic change, however, resulted in a large die-out known as the ": null
    },
    {
        "Triassic–Jurassic extinction event": "Triassic–Jurassic Extinction Event"
    },
    {
        ", in which all ": null
    },
    {
        "archosaurs": "Archosaurs"
    },
    {
        " , most synapsids, and almost all large amphibians became extinct, as well as 34% of marine life in the fourth mass extinction event. The extinctions cause is debated.               The Jurassic ranges from 201 million to 145 million years ago, and features three major epochs: Early Jurassic, Middle Jurassic, and Late Jurassic.      The Early Jurassic Epoch spans from 201  million to 174  million years ago. The climate was much more humid than the Triassic, and as a result, the world was very tropical. In the oceans, ": null
    },
    {
        "plesiosaur": "Plesiosaur"
    },
    {
        "s, ichthyosaurs and ": null
    },
    {
        "ammonites": "Ammonite"
    },
    {
        "dominated the seas. On land, dinosaurs and other reptiles dominated the land, with species such as  Dilophosaurus  at the apex. The first true crocodiles evolved, pushing the large amphibians to near extinction. The reptiles rose to rule the world. Meanwhile, the first true mammals evolved, but never exceeded the height of a shrew.      The Middle Jurassic Epoch spans from 174  million to 163  million years ago. During this epoch, dinosaurs flourished as huge herds of sauropods, such as  Brachiosaurus  and  Diplodocus , filled the fern prairies of the Middle Jurassic. Many other predators rose as well, such as  Allosaurus . Conifer forests made up a large portion of the worlds forests. In the oceans, plesiosaurs were quite common, and ichthyosaurs were flourishing. This epoch was the peak of the reptiles.       The Late Jurassic Epoch spans from 163  million to 145  million years ago. The Late Jurassic featured a massive extinction of ": null
    },
    {
        "sauropods": "Sauropods"
    },
    {
        " and ichthyosaurs due to the separation of Pangaea into ": null
    },
    {
        "Laurasia": "Laurasia"
    },
    {
        " and ": null
    },
    {
        "Gondwana": "Gondwana"
    },
    {
        " in an extinction known as the Jurassic-Cretaceous extinction. Sea levels rose, destroying fern prairies and creating shallows. Ichthyosaurs became extinct whereas sauropods, as a whole, did not; in fact, some species, like  Titanosaurus , lived until the ": null
    },
    {
        "K–T extinction": "Cretaceous–Paleogene Extinction Event"
    },
    {
        ".  The increase in sea-levels opened up the Atlantic sea way which would continue to get larger over time. The divided world would give opportunity for the diversification of new dinosaurs.          The Cretaceous is the Phanerozoics longest period, and the last period the Mesozoic. It spans from 145 million to 66 million years ago, and is divided into two epochs: Early Cretaceous, and Late Cretaceous.       The Early Cretaceous Epoch spans from 145 million to 100 million years ago. The Early Cretaceous saw the expansion of seaways, and as a result, the decline and extinction of sauropods . Many coastal shallows were created, and that caused ichthyosaurs to die out. ": null
    },
    {
        "Mosasaurs": "Mosasaurs"
    },
    {
        " evolved to replace them as apex species of the seas. Some island-hopping dinosaurs, like  Eustreptospondylus , evolved to cope with the coastal shallows and small islands of ancient Europe. Other dinosaurs, such as  Carcharodontosaurus  and  Spinosaurus , rose to fill the empty space that the Jurassic-Cretaceous extinction had created. Of the most successful would be the  Iguanodon  which spread to every continent. Seasons came back into effect and the poles grew seasonally colder. Dinosaurs such as the  Leaellynasaura  inhabited the polar forests year-round, while many dinosaurs, such as the  Muttaburrasaurus , migrated there during summer . Since it was too cold for crocodiles, it was the last stronghold for large amphibians, such as the  Koolasuchus . In this epoch Pterosaurs reached their maximum diversity and grew larger, as species like  Tapejara  and  Ornithocheirus  took to the skies. The first true birds evolved, possibly sparking competition between them and the pterosaurs.     The Late Cretaceous Epoch spans from 100 million to 66 million years ago. The Late Cretaceous featured a cooling trend that would continue into the ": null
    },
    {
        "Cenozoic": "Cenozoic"
    },
    {
        " Era. Eventually, tropical ecology was restricted to the equator and areas beyond the tropic lines featured extreme seasonal changes of weather. Dinosaurs still thrived as new species such as  Tyrannosaurus ,  Ankylosaurus ,  Triceratops  and ": null
    },
    {
        "Hadrosaurs": "Hadrosaurs"
    },
    {
        " dominated the food web. Whether or not ": null
    },
    {
        "Pterosaurs": "Pterosaur"
    },
    {
        "went into a decline as birds radiated is debated; however, many families survived until the end of the Cretaceous, alongside new species such as the gigantic  Quetzalcoatlus .  Marsupials evolved within the large conifer forests as scavengers. In the oceans, ": null
    },
    {
        "Mosasaurs": "Mosasaurs"
    },
    {
        " ruled the seas to fill the role of the ichthyosaurs, and huge plesiosaurs, such as  Elasmosaurus , evolved. Also, the first flowering plants evolved. At the end of the Cretaceous, the ": null
    },
    {
        "Deccan Traps": "Deccan Traps"
    },
    {
        " and other volcanic eruptions were poisoning the atmosphere. As this was continued, it is thought that a large meteor smashed into Earth, creating the ": null
    },
    {
        "Chicxulub Crater": "Chicxulub Crater"
    },
    {
        " creating the event known as the ": null
    },
    {
        "K–T extinction": "Cretaceous–Paleogene Extinction Event"
    },
    {
        ", the fifth and most recent mass extinction event, during which 75% of life on Earth became extinct, including all non-avian dinosaurs. Every living thing with a body mass over 10 kilograms became extinct, and the age of the dinosaurs came to an end.            The Cenozoic featured the rise of mammals as the dominant class of animals, as the end of the age of the dinosaurs left significant evolutionary vacuums. There are three divisions of the Cenozoic: Paleogene, Neogene and Quaternary.          The Paleogene spans from the extinction of the non-avian dinosaurs, some 66 million years ago, to the dawn of the Neogene 23 million years ago. It features three ": null
    },
    {
        "epoch": "Epoch"
    },
    {
        "s: ": null
    },
    {
        "Paleocene": "Paleocene"
    },
    {
        ", ": null
    },
    {
        "Eocene": "Eocene"
    },
    {
        " and ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        ".      The Paleocene Epoch began with the ": null
    },
    {
        "K–T extinction": "Cretaceous–Paleogene Extinction Event"
    },
    {
        " event caused by the impact of a meteorite in the area of present-day ": null
    },
    {
        "Yucatan Peninsula": "Yucatan Peninsula"
    },
    {
        " and caused the destruction of 75% of all species on Earth. The Early Paleocene saw the recovery of the Earth from that event. The continents began to take their modern shape, but all continents were separated from each other. ": null
    },
    {
        "Afro-Eurasia": "Afro-Eurasia"
    },
    {
        " was separated by the ": null
    },
    {
        "Tethys Sea": "Tethys Sea"
    },
    {
        ", and the Americas were separated by the strait of Panama, as the Isthmus of Panama had not yet formed. This epoch featured a general warming trend, and jungles eventually reached the poles. The oceans were dominated by sharks as the large reptiles that had once ruled became extinct. Archaic mammals, such as ": null
    },
    {
        "creodonts": "Creodonts"
    },
    {
        " and early primates that evolved during the ": null
    },
    {
        "Mesozoic": "Mesozoic"
    },
    {
        " filled the world. Mammals were still quite small, meanwhile enormous crocodiles and snakes like  Titanoboa  radiated to fill the niche of top predator.     The Eocene Epoch ranged from 56 million to 34 million years ago. In the early Eocene, most land mammals were small and living in cramped jungles, much like the Paleocene. Among them were early primates, whales and horses along with many other early forms of mammals. At the top of the food chains were huge birds, such as  Gastornis . Carnivorous flightless birds continued to be top predators for much of the rest of the Cenozoic, until their extinction in the Quaternary period. The temperature was 30 degrees Celsius with little temperature gradient from pole to pole. In the Middle Eocene Epoch, the circum-Antarctic current between Australia and Antarctica formed which disrupted ocean currents worldwide, resulting in global cooling, and caused the jungles to shrink. This allowed mammals to grow; some such as whales to mammoth proportions, which were, by now, almost fully aquatic. Mammals like  Andrewsarchus  were now at the top of the food-chain and sharks were replaced by  Basilosaurus , whales, as rulers of the seas. The late Eocene Epoch saw the rebirth of seasons, which caused the expansion of savanna-like areas, along with the evolution of grass.   At the transition between the Eocene and Oligocene epochs there was a significant ": null
    },
    {
        "extinction event": "Eocene–Oligocene Extinction Event"
    },
    {
        ", the cause of which is debated.     The Oligocene Epoch spans from 34 million to 23 million years ago. The Oligocene was an important transitional period between the tropical world of the Eocene and more modern ecosystems. This period featured a global expansion of grass which had led to many new species to take advantage, including the first elephants, cats, dogs, marsupials and many other species still prevalent today. Many other species of plants evolved during this epoch also, such as the evergreen trees. The long term cooling continued and seasonal rains patterns established. Mammals continued to grow larger.  Paraceratherium , the largest land mammal to ever live evolved during this epoch, along with many other ": null
    },
    {
        "perissodactyl": "Perissodactyl"
    },
    {
        "s.             The Neogene spans from 23.03 million to 2.58 million years ago. It features 2 epochs: the Miocene, and the Pliocene.      The Miocene spans from 23.03 to 5.333 million years ago and is a period in which grass spread further across, effectively dominating a large portion of the world, diminishing forests in the process. Kelp forests evolved, leading to the evolution of new species, such as sea otters. During this time, ": null
    },
    {
        "perissodactyla": "Perissodactyla"
    },
    {
        " thrived, and evolved into many different varieties. Alongside them were the apes, which evolved into a 30 species. Overall, arid and mountainous land dominated most of the world, as did grazers. The ": null
    },
    {
        "Tethys Sea": "Tethys Sea"
    },
    {
        " finally closed with the creation of the Arabian Peninsula and in its wake left the Black, Red, Mediterranean and Caspian Seas. This only increased aridity. Many new plants evolved, and 95% of modern seed plants evolved in the mid-Miocene.      The Pliocene lasted from 5.333 to 2.58 million years ago. The Pliocene featured dramatic climactic changes, which ultimately led to modern species and plants. The Mediterranean Sea dried up for several thousand years in the ": null
    },
    {
        "Messinian salinity crisis": "Messinian Salinity Crisis"
    },
    {
        ". Along with these major geological events,  Australopithecus  evolved in Africa, beginning the human branch. The isthmus of Panama formed, and animals migrated between North and South America, wreaking havoc on the local ecology. Climatic changes brought savannas that are still continuing to spread across the world, Indian monsoons, deserts in East Asia, and the beginnings of the Sahara desert. The Earths continents and seas moved into their present shapes. The world map has not changed much since, save for changes brought about by the ": null
    },
    {
        "glaciations": "Glaciations"
    },
    {
        " of the Quaternary, such as the ": null
    },
    {
        "Great Lakes": "Great Lakes"
    },
    {
        ".            The Quaternary spans from 2.58 million years ago to present day, and is the shortest geological period in the ": null
    },
    {
        "Phanerozoic Eon": "Phanerozoic Eon"
    },
    {
        ". It features modern animals, and dramatic changes in the climate. It is divided into two epochs: the Pleistocene and the Holocene.      The Pleistocene lasted from 2.58 million to 11,700 years ago. This epoch was marked by ice ages as a result of the cooling trend that started in the Mid-Eocene. There were at least four separate glaciation periods marked by the advance of ice caps as far south as 40 degrees N latitude in mountainous areas. Meanwhile, Africa experienced a trend of desiccation which resulted in the creation of the Sahara, Namib, and Kalahari deserts. Many animals evolved including ": null
    },
    {
        "mammoth": "Mammoth"
    },
    {
        "s, ": null
    },
    {
        "giant ground sloths": "Giant Ground Sloths"
    },
    {
        ", ": null
    },
    {
        "dire wolves": "Dire Wolves"
    },
    {
        ", saber-toothed cats, and most famously  Homo sapiens . One hundred thousand years ago marked the end of one of the worst droughts of Africa, and led to the expansion of primitive human. As the Pleistocene drew to a close, a major extinction wiped out much of the worlds ": null
    },
    {
        "megafauna": "Megafauna"
    },
    {
        ", including some of the hominid species, such as Neanderthals. All the continents were affected, but Africa to a lesser extent. That continent retains many large animals, such as hippos. The extent to which Homo Sapiens were involved in this extinction is debated.      The Holocene began 11,700 years ago and lasts until to present day. All recorded history and the ": null
    },
    {
        "history of the world": "History Of The World"
    },
    {
        " lies within the boundaries of the Holocene epoch.  Human activity is blamed for a mass extinction that began roughly 10,000 years ago, though the species becoming extinct have only been recorded since the ": null
    },
    {
        "Industrial Revolution": "Industrial Revolution"
    },
    {
        ". This is sometimes referred to as the ": null
    },
    {
        "Sixth Extinction": "Sixth Extinction"
    },
    {
        " . More than 322 species have become extinct due to human activity since the Industrial Revolution.            It has been demonstrated that changes in biodiversity through the Phanerozoic correlate much better with the ": null
    },
    {
        "hyperbolic": "Hyperbolic Growth"
    },
    {
        " model  than with ": null
    },
    {
        "exponential": "Exponential Growth"
    },
    {
        " and ": null
    },
    {
        "logistic": "Logistic Distribution"
    },
    {
        " models . The latter models imply that changes in diversity are guided by a first-order ": null
    },
    {
        "positive feedback": "Positive Feedback"
    },
    {
        " or a ": null
    },
    {
        "negative feedback": "Negative Feedback"
    },
    {
        " that arises from resource limitation, or both. The hyperbolic model implies a second-order positive feedback. The hyperbolic pattern of the ": null
    },
    {
        "human population": "World Population"
    },
    {
        " growth arises from a second-order positive feedback, caused by the interaction of the population size and the rate of technological growth. See, e. g., ": null
    }
]