[
    {
        "                  In ": null
    },
    {
        "articulatory phonetics": "Articulatory Phonetics"
    },
    {
        ", the place of articulation  of a ": null
    },
    {
        "consonant": "Consonant"
    },
    {
        " is the point of contact where an ": null
    },
    {
        "obstruction": "Wikt:Obstruction"
    },
    {
        " occurs in the ": null
    },
    {
        "vocal tract": "Vocal Tract"
    },
    {
        " between an articulatory gesture, an active articulator , and a passive location . Along with the ": null
    },
    {
        "manner of articulation": "Manner Of Articulation"
    },
    {
        " and the ": null
    },
    {
        "phonation": "Phonation"
    },
    {
        ", it gives the consonant its distinctive sound.     The terminology in this article has been developed for precisely describing all the consonants in all the worlds spoken languages. No known language distinguishes all of the places described here so less precision is needed to distinguish the sounds of a particular language.       The human voice produces sounds in the following manner:     ": null
    },
    {
        "Air pressure": "Air Pressure"
    },
    {
        " from the ": null
    },
    {
        "lungs": "Human Lung"
    },
    {
        " creates a steady flow of air through the ": null
    },
    {
        "trachea": "Vertebrate Trachea"
    },
    {
        " , larynx and ": null
    },
    {
        "pharynx": "Human Pharynx"
    },
    {
        " .   The ": null
    },
    {
        "vocal folds": "Vocal Folds"
    },
    {
        " in the larynx vibrate, creating fluctuations in air pressure, known as ": null
    },
    {
        "sound wave": "Sound Wave"
    },
    {
        "s.   ": null
    },
    {
        "Resonances": "Acoustic Resonanceresonance Of A Tube Of Air"
    },
    {
        " in the vocal tract modify these waves according to the position and shape of the lips, jaw, tongue, ": null
    },
    {
        "soft palate": "Soft Palate"
    },
    {
        ", and other speech organs, creating ": null
    },
    {
        "formant": "Formant"
    },
    {
        " regions and so different qualities of ": null
    },
    {
        "sonorant": "Sonorant"
    },
    {
        "  sound.   Mouth radiates the sound waves into the environment.   Nasal cavity adds resonance to some sounds such as and to gives nasal quality of the so-called ": null
    },
    {
        "nasal consonants": "Nasal Consonants"
    },
    {
        ".       The  larynx  or voice box is a cylindrical framework of ": null
    },
    {
        "cartilage": "Cartilage"
    },
    {
        " that serves to anchor the ": null
    },
    {
        "vocal folds": "Vocal Folds"
    },
    {
        ". When the ": null
    },
    {
        "muscles": "Muscle"
    },
    {
        "of the vocal folds contract, the airflow from the lungs is impeded until the vocal folds are forced apart again by the increasing air pressure from the lungs. The process continues in a periodic cycle that is felt as a vibration . In singing, the vibration ": null
    },
    {
        "frequency": "Frequency"
    },
    {
        " of the vocal folds determines the ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        " of the sound produced. Voiced ": null
    },
    {
        "phonemes": "Phoneme"
    },
    {
        "such as the pure vowels are, by definition, distinguished by the buzzing sound of this periodic ": null
    },
    {
        "oscillation": "Oscillation"
    },
    {
        " of the vocal cords.     The lips of the mouth can be used in a similar way to create a similar sound, as any ": null
    },
    {
        "toddler": "Toddler"
    },
    {
        " or ": null
    },
    {
        "trumpeter": "Trumpeter"
    },
    {
        " can demonstrate. A rubber ": null
    },
    {
        "balloon": "Balloonballoons As Decoration Or Entertainment"
    },
    {
        ", inflated but not tied off and stretched tightly across the neck produces a squeak or buzz, depending on the ": null
    },
    {
        "tension": "Tension"
    },
    {
        " across the neck and the level of ": null
    },
    {
        "pressure": "Pressure"
    },
    {
        " inside the balloon. Similar actions with similar results occur when the vocal cords are contracted or relaxed across the larynx.       The passive place of articulation is the place on the more stationary part of the vocal tract where the articulation occurs and can be anywhere from the lips, upper teeth, gums, or roof of the mouth to the back of the throat. Although it is a continuum, there are several contrastive areas so languages may distinguish consonants by articulating them in different areas, but few languages contrast two sounds within the same area unless there is some other feature which contrasts as well. The following areas are contrastive:   The upper lip    The upper teeth, either on the edge of the teeth or inner surface    The ": null
    },
    {
        "alveolar ridge": "Alveolar Ridge"
    },
    {
        ", the gum line just behind the teeth    The back of the alveolar ridge    The ": null
    },
    {
        "hard palate": "Hard Palate"
    },
    {
        " on the roof of the mouth    The ": null
    },
    {
        "soft palate": "Soft Palate"
    },
    {
        " further back on the roof of the mouth    The ": null
    },
    {
        "uvula": "Uvula"
    },
    {
        " hanging down at the entrance to the throat    The throat itself, a.k.a. the ": null
    },
    {
        "pharynx": "Human Pharynx"
    },
    {
        "    The ": null
    },
    {
        "epiglottis": "Epiglottis"
    },
    {
        " at the entrance to the windpipe, above the voice box      The regions are not strictly separated. For instance, in some sounds in many languages, the surface of the tongue contacts a relatively large area from the back of the upper teeth to the alveolar ridge, which is common enough to have received its own name, . Likewise, the alveolar and post-alveolar regions merge into each other, as do the hard and soft palate, the soft palate and the uvula, and all adjacent regions. Terms like pre-velar , post-velar , and upper vs. lower pharyngeal may be used to specify more precisely where an articulation takes place. However, although a language may contrast pre-velar and post-velar sounds, it does not also contrast them with palatal and uvular sounds so contrasts are limited to the number above, if not always their exact location.       The articulatory gesture of the active place of articulation involves the more mobile part of the vocal tract, typically some part of the tongue or lips. The following areas are known to be contrastive:   The lower lip    Various parts of the front of the tongue ": null
    },
    {
        "tip of the tongue": "Tongue Tip"
    },
    {
        "    The upper front surface of the tongue just behind the tip, called the ": null
    },
    {
        "blade": "Tongue Blade"
    },
    {
        " of the tongue    The surface of the tongue under the tip    The body of the tongue    The base  root of the tongue and the throat      In ": null
    },
    {
        "bilabial consonants": "Bilabial Consonants"
    },
    {
        ", both lips move so the articulatory gesture brings the lips together, but by convention, the lower lip is said to be active and the upper lip passive. Similarly, in ": null
    },
    {
        "linguolabial consonants": "Linguolabial Consonant"
    },
    {
        "the tongue contacts the upper lip with the upper lip actively moving down to meet the tongue; nonetheless, the tongue is conventionally said to be active and the lip passive if for no other reason than that the parts of the mouth below the vocal tract are typically active, and those above the vocal tract are typically passive.     In dorsal gestures, different parts of the body of the tongue contact different parts of the roof of the mouth, but it cannot be independently controlled so they are all subsumed under the term dorsal. That is unlike coronal gestures involving the front of the tongue, which is more flexible.     The epiglottis may be active, contacting the pharynx, or passive, being contacted by the aryepiglottal folds. Distinctions made in these laryngeal areas are very difficult to observe and are the subject of ongoing investigation, and several still-unidentified combinations are thought possible.     The glottis acts upon itself. There is a sometimes fuzzy line between glottal, aryepiglottal, and epiglottal consonants and ": null
    },
    {
        "phonation": "Phonation"
    },
    {
        ", which uses these same areas.     Unlike the passive articulation, which is a continuum, there are five discrete active articulators: the lip , the flexible front of the tongue , the middle–back of the tongue , the root of the tongue together with the ": null
    },
    {
        "epiglottis": "Epiglottis"
    },
    {
        " , and the ": null
    },
    {
        "glottis": "Glottis"
    },
    {
        " . The articulators are discrete in that they can act independently of each other, and two or more may work together in what is called coarticulation . The distinction, however, between the various coronal articulations, laminal, apical, and subapical is a continuum, without clear boundaries.       The following table shows the possible combinations of active and passive articulators.     The possible locations for ": null
    },
    {
        "sibilants": "Sibilant"
    },
    {
        "as well as non-sibilants to occur are indicated in dashed red . For sibilants, there are additional complications involving ": null
    },
    {
        "tongue shape": "Tongue Shape"
    },
    {
        "; see the article on ": null
    },
    {
        "sibilants": "Sibilant Consonant"
    },
    {
        "for a chart of possible articulations.          A precise vocabulary of compounding the two places of articulation is sometimes seen. However, it is usually reduced to the passive articulation, which is generally sufficient. Thus dorsal–palatal, dorsal–velar, and dorsal–uvular are usually just called palatal , velar , and uvular . If there is ambiguity, additional terms have been invented, so subapical–palatal is more commonly called retroflex .     NOTE: Additional shades of passive articulation are sometimes specified using pre- or post-, for example prepalatal ": null
    }
]