[
    {
        "           In ": null
    },
    {
        "mathematics": "Mathematics"
    },
    {
        ", the polar coordinate system is a ": null
    },
    {
        "two-dimensional": "Dimension"
    },
    {
        " coordinate system": "Coordinate System"
    },
    {
        " in which each ": null
    },
    {
        "point": "Point"
    },
    {
        " on a ": null
    },
    {
        "plane": "Plane"
    },
    {
        " is determined by a ": null
    },
    {
        "distance": "Distance"
    },
    {
        " from a reference point and an ": null
    },
    {
        "angle": "Angle"
    },
    {
        " from a reference direction. The reference point  is called the pole, and the ": null
    },
    {
        "ray": "Ray"
    },
    {
        " from the pole in the reference direction is the polar axis. The distance from the pole is called the radial coordinate, radial distance or simply radius, and the angle is called the angular coordinate, polar angle, or  azimuth .  The radial coordinate is often denoted by r or ": null
    },
    {
        "ρ": "Rho"
    },
    {
        ", and the angular coordinate by ": null
    },
    {
        "φ": "Phi"
    },
    {
        ", ": null
    },
    {
        "θ": "Theta"
    },
    {
        ", or t. Angles in polar notation are generally expressed in either ": null
    },
    {
        "degrees": "Degree"
    },
    {
        " or ": null
    },
    {
        "radians": "Radian"
    },
    {
        " .     ": null
    },
    {
        "Grégoire de Saint-Vincent": "Grégoire De Saint-Vincent"
    },
    {
        " and ": null
    },
    {
        "Bonaventura Cavalieri": "Bonaventura Cavalieri"
    },
    {
        " independently introduced the concepts in the mid-seventeenth century, though the actual term polar coordinates has been attributed to ": null
    },
    {
        "Gregorio Fontana": "Gregorio Fontana"
    },
    {
        " in the 18th-century. The initial motivation for the introduction of the polar system was the study of ": null
    },
    {
        "circular": "Circular Motion"
    },
    {
        " and ": null
    },
    {
        "orbital motion": "Orbital Motion"
    },
    {
        ".     Polar coordinates are most appropriate in any context where the phenomenon being considered is inherently tied to direction and length from a center point. The Archimedean spiral for example is much simpler to express using polar forms. Moreover, many physical systems—such as those concerned with bodies moving around a central point or with phenomena originating from a central point—are simpler and more intuitive to model using polar coordinates.     The polar coordinate system is extended into three dimensions with two different coordinate systems, the ": null
    },
    {
        "cylindrical": "Cylindrical Coordinate System"
    },
    {
        " and ": null
    },
    {
        "spherical coordinate system": "Spherical Coordinate System"
    },
    {
        ". ": null
    },
    {
        "Alexis Clairaut": "Alexis Clairaut"
    },
    {
        " was the first to think of polar coordinates in three dimensions, and ": null
    },
    {
        "Leonhard Euler": "Leonhard Euler"
    },
    {
        " was the first to actually develop them.               The concepts of angle and radius were already used by ancient peoples of the first millennium ": null
    },
    {
        "BC": "Before Christ"
    },
    {
        ". The ": null
    },
    {
        "Greek astronomer": "Greek Astronomy"
    },
    {
        " and ": null
    },
    {
        "astrologer": "Astrologer"
    },
    {
        " Hipparchus": "Hipparchus"
    },
    {
        " created a table of ": null
    },
    {
        "chord": "Chord"
    },
    {
        " functions giving the length of the chord for each angle, and there are references to his using polar coordinates in establishing stellar positions.    In  On Spirals , ": null
    },
    {
        "Archimedes": "Archimedes"
    },
    {
        " describes the ": null
    },
    {
        "Archimedean spiral": "Archimedean Spiral"
    },
    {
        ", a function whose radius depends on the angle. The Greek work, however, did not extend to a full coordinate system.     From the 8th century AD onward, astronomers developed methods for approximating and calculating the direction to ": null
    },
    {
        "Mecca": "Mecca"
    },
    {
        " —and its distance—from any location on the Earth.    From the 9th century onward they were using ": null
    },
    {
        "spherical trigonometry": "Spherical Trigonometry"
    },
    {
        " and ": null
    },
    {
        "map projection": "Map Projection"
    },
    {
        " methods to determine these quantities accurately. The calculation is essentially the conversion of the ": null
    },
    {
        "equatorial polar coordinates": "Geodetic Coordinatescoordinates"
    },
    {
        " of Mecca  to its polar coordinates relative to a system whose reference meridian is the ": null
    },
    {
        "great circle": "Great Circle"
    },
    {
        " through the given location and the Earths poles, and whose polar axis is the line through the location and its ": null
    },
    {
        "antipodal point": "Antipodal Point"
    },
    {
        ". King . The calculations were as accurate as could be achieved under the limitations imposed by their assumption that the Earth was a perfect sphere.     There are various accounts of the introduction of polar coordinates as part of a formal coordinate system. The full history of the subject is described in ": null
    },
    {
        "Harvard": "Harvard University"
    },
    {
        " professor ": null
    },
    {
        "Julian Lowell Coolidges": "Julian Lowell Coolidge"
    },
    {
        " Origin of Polar Coordinates.  ": null
    },
    {
        "Grégoire de Saint-Vincent": "Grégoire De Saint-Vincent"
    },
    {
        " and ": null
    },
    {
        "Bonaventura Cavalieri": "Bonaventura Cavalieri"
    },
    {
        " independently introduced the concepts in the mid-seventeenth century. Saint-Vincent wrote about them privately in 1625 and published his work in 1647, while Cavalieri published his in 1635 with a corrected version appearing in 1653. Cavalieri first used polar coordinates to solve a problem relating to the area within an ": null
    },
    {
        "Archimedean spiral": "Archimedean Spiral"
    },
    {
        ". ": null
    },
    {
        "Blaise Pascal": "Blaise Pascal"
    },
    {
        " subsequently used polar coordinates to calculate the length of ": null
    },
    {
        "parabolic arcs": "Parabola"
    },
    {
        ".     In  Method of Fluxions  , Sir ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        " examined the transformations between polar coordinates, which he referred to as the Seventh Manner; For Spirals , and nine other coordinate systems.  In the journal  Acta Eruditorum  , ": null
    },
    {
        "Jacob Bernoulli": "Jacob Bernoulli"
    },
    {
        " used a system with a point on a line, called the pole and polar axis respectively. Coordinates were specified by the distance from the pole and the angle from the polar axis. Bernoullis work extended to finding the ": null
    },
    {
        "radius of curvature": "Radius Of Curvature"
    },
    {
        " of curves expressed in these coordinates.     The actual term polar coordinates has been attributed to ": null
    },
    {
        "Gregorio Fontana": "Gregorio Fontana"
    },
    {
        " and was used by 18th-century Italian writers. The term appeared in ": null
    },
    {
        "English": "English Language"
    },
    {
        " in ": null
    },
    {
        "George Peacocks": "George Peacock"
    },
    {
        " 1816 translation of ": null
    },
    {
        "Lacroixs": "Sylvestre François Lacroix"
    },
    {
        " Differential and Integral Calculus.   ": null
    },
    {
        "Alexis Clairaut": "Alexis Clairaut"
    },
    {
        " was the first to think of polar coordinates in three dimensions, and ": null
    },
    {
        "Leonhard Euler": "Leonhard Euler"
    },
    {
        " was the first to actually develop them.          The radial coordinate is often denoted by r or ": null
    },
    {
        "ρ": "Rho"
    },
    {
        ", and the angular coordinate by ": null
    },
    {
        "φ": "Phi"
    },
    {
        ", ": null
    },
    {
        "θ": "Theta"
    },
    {
        ", or t. The angular coordinate is specified as φ by ": null
    },
    {
        "ISO": "International Organisation For Standardisation"
    },
    {
        " standard ": null
    },
    {
        "31-11": "Iso 31-11"
    },
    {
        ". However, in mathematical literature the angle is often denoted by & theta; instead of φ.     Angles in polar notation are generally expressed in either ": null
    },
    {
        "degrees": "Degree"
    },
    {
        " or ": null
    },
    {
        "radians": "Radian"
    },
    {
        " . Degrees are traditionally used in ": null
    },
    {
        "navigation": "Navigation"
    },
    {
        ", ": null
    },
    {
        "surveying": "Surveying"
    },
    {
        ", and many applied disciplines, while radians are more common in mathematics and mathematical ": null
    },
    {
        "physics": "Physics"
    },
    {
        ".      The angle φ is defined to start at 0° from a reference direction, and to increase for rotations in either ": null
    },
    {
        "counterclockwise ": "Clockwise"
    },
    {
        " or ": null
    },
    {
        "clockwise ": "Clockwise"
    },
    {
        " orientation. In mathematics, e.g., the reference direction is usually drawn as a ": null
    },
    {
        "ray": "Ray"
    },
    {
        " from the pole horizontally to the right, and the polar angle increases to positive angles for ccw rotations, whereas in navigation  the 0°-heading is drawn vertically upwards and the angle increases for cw rotations. The polar angles decrease towards negative values for rotations in the respectively opposite orientations.       Adding any number of full ": null
    },
    {
        "turns": "Turn"
    },
    {
        " to the angular coordinate does not change the corresponding direction. Similarly, any polar coordinate is identical to the coordinate with the negative radial component and the opposite direction . Therefore, the same point  can be expressed with an infinite number of different polar coordinates  and , where n is an arbitrary ": null
    },
    {
        "integer": "Integer"
    },
    {
        ".  Moreover, the pole itself can be expressed as  for any angle φ.      Where a unique representation is needed for any point besides the pole, it is usual to limit r to positive numbers  ref  /ref ": null
    },
    {
        "ath /math math /mat": "Ath  /Math  Math  /Mat"
    },
    {
        " math /math ": null
    }
]