[
    {
        "   Pole vaulting is a ": null
    },
    {
        "track and field": "Track And Field"
    },
    {
        " event in which a person uses a long flexible pole  as an aid to jump over a ": null
    },
    {
        "bar": "Bar"
    },
    {
        ". Pole jumping competitions were known to the ": null
    },
    {
        "ancient Greeks": "Mycenaean Greece"
    },
    {
        ", ": null
    },
    {
        "Cretans": "Minoan Civilization"
    },
    {
        " and ": null
    },
    {
        "Celt": "Celt"
    },
    {
        "s. It has been a full medal event at the ": null
    },
    {
        "Olympic Games": "Olympic Games"
    },
    {
        " since ": null
    },
    {
        "1896": "Athletics At The 1896 Summer Olympics"
    },
    {
        " for men and since ": null
    },
    {
        "2000": "2000 Summer Olympics"
    },
    {
        " for women.     It is typically classified as one of the four major jumping events in ": null
    },
    {
        "athletics": "Sport Of Athletics"
    },
    {
        ", alongside the ": null
    },
    {
        "high jump": "High Jump"
    },
    {
        ", ": null
    },
    {
        "long jump": "Long Jump"
    },
    {
        " and ": null
    },
    {
        "triple jump": "Triple Jump"
    },
    {
        ". It is unusual among track and field sports in that it requires a significant amount of specialised equipment in order to participate, even at a basic level. A number of elite pole vaulters have had backgrounds in ": null
    },
    {
        "gymnastics": "Gymnastics"
    },
    {
        ", including world record breakers ": null
    },
    {
        "Yelena Isinbayeva": "Yelena Isinbayeva"
    },
    {
        " and ": null
    },
    {
        "Brian Sternberg": "Brian Sternberg"
    },
    {
        ", reflecting the similar physical attributes required for the sports. Rosenbaum, Mike. . About Track and Field. Retrieved on 25 January 2014. Rudman, Steve . . Sports Press NW. Retrieved on 2014-01-25. Running speed, however, may be the most dominant factor.               Poles were used as a practical means of passing over natural obstacles in marshy places such as the province of ": null
    },
    {
        "Friesland": "Friesland"
    },
    {
        " in the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        ", along the ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        ", and the great level of the ": null
    },
    {
        "Fens": "Fens"
    },
    {
        " across ": null
    },
    {
        "Cambridgeshire": "Cambridgeshire"
    },
    {
        ", ": null
    },
    {
        "Huntingdonshire": "Huntingdonshire"
    },
    {
        ", ": null
    },
    {
        "Lincolnshire": "Lincolnshire"
    },
    {
        " and ": null
    },
    {
        "Norfolk": "Norfolk"
    },
    {
        ". Artificial draining of these marshes created a network of ": null
    },
    {
        "open drains": "Open Drain"
    },
    {
        "or ": null
    },
    {
        "canals": "Canal"
    },
    {
        "intersecting each other. To cross these without getting wet, while avoiding tedious roundabout journeys over bridges, a stack of jumping poles was kept at every house and used for vaulting over the canals.     Distance pole vaulting competitions continue to be held annually in the lowlands around the ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        ". These far-jumping competitions  are not based on height.      In his book The Mechanics of the Pole Vault, ": null
    },
    {
        "Richard Ganslen": "Richard Ganslen"
    },
    {
        " reports that the London Gymnastic Society under Professor Voelker held measured pole vaulting events in 1826, involving 1,300 participants and recording heights up to .  Other early pole vaulting competitions where height was measured took place at the ": null
    },
    {
        "Ulverston Football and Cricket Club": "Ulverston"
    },
    {
        ", ": null
    },
    {
        "Lancashire, north of the sands": "Furness"
    },
    {
        "  in 1843. Turnbull, Simon . .  The Independent . Retrieved on 2009-06-15. Modern competition began around 1850 in ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", when pole vaulting was added to the exercises of the ": null
    },
    {
        "Turner": "Turners"
    },
    {
        " gymnastic clubs by ": null
    },
    {
        "Johann C. F. GutsMuths": "Johann Christoph Friedrich Gutsmuths"
    },
    {
        " and ": null
    },
    {
        "Friedrich L. Jahn": "Friedrich L. Jahn"
    },
    {
        ". In ": null
    },
    {
        "Great Britain": "Great Britain"
    },
    {
        ", it was first practiced at the Caledonian Games.     Initially, vaulting poles were made from stiff materials such as ": null
    },
    {
        "bamboo": "Bamboo"
    },
    {
        " or ": null
    },
    {
        "aluminum": "Aluminum"
    },
    {
        ". The introduction of flexible vaulting poles in the early 1950s made from composites such as ": null
    },
    {
        "fiberglass": "Fiberglass"
    },
    {
        " or ": null
    },
    {
        "carbon fiber": "Carbon Fiber"
    },
    {
        " allowed vaulters to achieve greater height.  Physical attributes such as speed, agility and strength are essential to pole vaulting effectively, but technical skill is an equally if not more important element. The object of pole vaulting is to clear a bar or crossbar supported upon two uprights without knocking it down.        In 2000, IAAF rule 260.18a was amended, so that world records can be set in a facility with or without roof . This rule was not applied retroactively,  With many indoor facilities not conforming to outdoor track specifications for size and flatness, the pole vault is the only world record set indoors.       Today, athletes compete in the pole vault as one of the four ": null
    },
    {
        "jumping": "Jumping"
    },
    {
        " events in ": null
    },
    {
        "track and field": "Track And Field"
    },
    {
        ". Because the ": null
    },
    {
        "high jump": "High Jump"
    },
    {
        " and pole vault are both vertical jumps, the competitions are conducted similarly. Each athlete can choose what height they would like to enter the competition. Once they enter, they have three attempts to clear the height. If a height is cleared, the vaulter advances to the next height, where they will have three more attempts. Once the vaulter has three consecutive misses, they are out of the competition and the highest height they cleared is their result. A no height , often denoted NH , refers to the failure of a vaulter to clear any bar during the competition.     Once the vaulter enters the competition, they can choose to pass heights. If a vaulter achieves a miss on their first attempt at a height, they can pass to the next height, but they will only have two attempts at that height, as they will be out once they achieve three consecutive misses. Similarly, after earning two misses at a height, they could pass to the next height, when they would have only one attempt.          The competitor who clears the highest height is the winner. If two or more vaulters have finished with the same height, the tie is broken by the number of misses at the final height. If the tied vaulters have the same number of misses at the last height cleared, the tie is broken by the total number of misses in the competition.     If there is still a tie for first place, a jump-off occurs to break the tie. Marks achieved in this type of jump-off are considered valid and count for any purpose that a mark achieved in a normal competition would.     If a tie in the other places still exists, a jump-off is not normally conducted, unless the competition is a qualifying meet, and the tie exists in the final qualifying spot. In this case, an administrative jump-off is conducted to break the tie, but the marks are not considered valid for any other purpose than breaking the tie.     A jump-off is a ": null
    },
    {
        "sudden death": "Sudden Death"
    },
    {
        " competition in which the tied vaulters attempt the same height, starting with the last attempted height. If both vaulters miss, the ": null
    },
    {
        "bar": "Bar"
    },
    {
        " goes down by a small increment, and if both clear, the bar goes up by a small increment. A jump-off ends when one vaulter clears and the other misses. Each vaulter gets one attempt at each height until one makes and one misses.     The equipment and rules for pole vaulting are similar to the ": null
    },
    {
        "high jump": "High Jump"
    },
    {
        ". Unlike high jump, however, the athlete in the vault has the ability to select the ": null
    },
    {
        "horizontal position": "Standards"
    },
    {
        " of the bar before each jump and can place it a distance beyond the back of the ": null
    },
    {
        "box": "Box"
    },
    {
        ", the metal pit that the pole is placed into immediately before takeoff. The range of distance the vaulter may place the standards varies depending on the level of competition.          If the pole used by the athlete dislodges the ": null
    },
    {
        "bar": "Bar"
    },
    {
        " from the uprights, a foul attempt is ruled, even if the athlete has cleared the height. An athlete does not benefit from quickly leaving the landing pad before the bar has fallen. The exception to this rule if the vaulter is vaulting outdoors and has made a clear effort to throw the pole back, but the wind has blown the pole into the bar; this counts as a clearance. This call is made at the discretion of the pole vault official. If the pole breaks during the execution of a vault, it is considered an equipment failure and is ruled a non-jump, neither a make nor a miss. Other types of equipment failure include the standards slipping down or the wind dislodging the bar when no contact was made by the vaulter.     Each athlete has a set amount of time in which to make an attempt. The amount of time varies by level of competition and the number of vaulters remaining. If the vaulter fails to begin an attempt within this time, the vaulter is charged with a time foul and the attempt is a miss.     Poles are manufactured with ratings corresponding to the vaulters maximum weight. Some organizations forbid vaulters to use poles rated below their weight as a safety precaution. The recommended weight corresponds to a flex rating that is determined by the manufacturer by placing a standardized amount of stress  on the pole and measuring how much the center of the pole is displaced. Therefore, two poles rated at the same weight are not necessarily the same stiffness.     Because pole stiffness and length are important factors to a vaulters performance, it is not uncommon for an elite vaulter to carry as many as ten poles to a competition. The effective properties of a pole can be changed by gripping the pole higher or lower in relation to the top of the pole. The left and right ": null
    },
    {
        "handgrips": "Grip"
    },
    {
        " are typically a bit more than shoulder width apart. Poles are manufactured for people of all skill levels and body sizes, with sizes as short as  to as long as , with a wide range of weight ratings. Each manufacturer determines the weight rating for the pole and the location of the maximum handhold band.     However speed is the most essential element to higher jumps, because the ": null
    },
    {
        "energy": "Kinetic Energy"
    },
    {
        " produced by the run is converted to ": null
    },
    {
        "vertical propulsion": "Gravitational Potential Energy"
    },
    {
        " . Assuming no loss of energy , this means that h  .       Competitive pole vaulting began using solid ": null
    },
    {
        "ash": "Fraxinus"
    },
    {
        " poles. As the heights attained increased, the bamboo poles gave way to tubular ": null
    },
    {
        "aluminum": "Aluminum"
    },
    {
        ", McCormick, Matthew. . Illumin. Retrieved on 25 January 2014. which was tapered at each end. Todays pole vaulters benefit from poles produced by wrapping pre-cut sheets of ": null
    },
    {
        "fiberglass": "Fiberglass"
    },
    {
        " that contains resin around a metal pole mandrel, to produce a slightly curved pole that bends more easily under the compression caused by an athletes take-off. The shape of the fiberglass sheets and the amount of fiberglass used is carefully planned to provide the desired length and stiffness of pole. Different fiber types, including carbon-fiber, are used to give poles specific characteristics intended to promote higher jumps. In recent years, carbon fiber has been added to the commonly used E-glass and S-glass materials to create a lighter pole.     As in the ": null
    },
    {
        "high jump": "High Jump"
    },
    {
        ", the landing area was originally a heap of sawdust or sand where athletes landed on their feet. As technology enabled higher vaults, mats evolved into bags of large chunks of foam. Todays high-tech mats are foam usually  thick. Mats are growing larger in area as well to minimize risk of injury. Proper landing technique is on the back or shoulders. Landing on the feet should be avoided, to eliminate the risk of injury to the lower extremities, particularly ankle sprains.     Rule changes over the years have resulted in larger landing areas and additional padding of all hard and unyielding surfaces.     The pole vault crossbar has evolved from a triangular aluminum bar to a round fiberglass bar with rubber ends. This is balanced on standards and can be knocked off when it is hit by a pole vaulter or the pole. Rule changes have led to shorter pegs and crossbar ends that are semi-circular.          Although many techniques are used by vaulters at various skill levels to clear the ": null
    },
    {
        "bar": "Bar"
    },
    {
        ", the generally accepted technical model can be broken down into several phases:       During the approach the pole vaulter sprints down the runway in such a way as to achieve maximum speed and correct position to initiate ": null
    },
    {
        "takeoff": "Takeoff"
    },
    {
        " at the end of the approach. Top class vaulters use approaches with 18 to 22 strides, often referred to as a step in which every other foot is counted as one step. The run-up to the vaulting pit begins forcefully with the vaulter running powerfully in a relaxed, upright position with knees lifted and torso leaning very slightly forward. The head, shoulders and hips are aligned, the vaulter increasing speed as the body becomes erect. The tip of the vaulting pole is angled higher than eye level until three paces from takeoff, when the pole tip descends efficiently, amplifying run speed as the pole is planted into the vault box. The faster the vaulter can run and the more efficient their take-off is, the greater the ": null
    },
    {
        "kinetic energy": "Kinetic Energy"
    },
    {
        " that can be achieved and used during the vault.       The plant and take off is initiated typically three steps out from the final step. Vaulters will usually count their steps backwards from their starting point to the box only counting the steps taken on the left foot except for the second step from the box, which is taken by the right foot. For example; a vaulter on a ten count would count backwards from ten, only counting the steps taken with the left foot, until the last three steps taken and both feet are counted as three, two, one. These last three steps are normally quicker than the previous strides and are referred to as the turn-over . The goal of this phase is to efficiently translate the ": null
    },
    {
        "kinetic energy": "Kinetic Energy"
    },
    {
        " accumulated from the approach into ": null
    },
    {
        "potential energy": "Potential Energy"
    },
    {
        " stored by the elasticity of the pole, and to gain as much initial vertical height as possible by jumping off the ground. The plant starts with the vaulter raising their arms up from around the hips or mid-torso until they are fully outstretched above the head, with the right arm extended directly above the head and the left arm extended perpendicular to the pole . At the same time, the vaulter is dropping the pole tip into the ": null
    },
    {
        "box": "Box"
    },
    {
        ". On the final step, the vaulter jumps off the trail leg which should always remain straight and then drives the front knee forward. As the pole slides into the back of the ": null
    },
    {
        "box": "Box"
    },
    {
        " the pole begins to bend and the vaulter continues up and forward, leaving the trail leg angled down and behind.       The swing and row simply consists of the vaulter swinging the trail leg forward and rowing the pole, bringing the top arm down to the hips, while trying to keep the trail leg straight to store more potential energy into the pole, the rowing motion also keeps the pole bent for a longer period of time for the vaulter to get into optimum position. Once in a U shape the left arm hugs the pole tight to efficiently use the recoil within the pole. The goal is to carry out these motions as thoroughly and as quickly as possible; it is a race against the unbending of the pole. Effectively, this causes a double ": null
    },
    {
        "pendulum": "Pendulum"
    },
    {
        " motion, with the top of the pole moving forward and pivoting from the ": null
    },
    {
        "box": "Box"
    },
    {
        ", while the vaulter acts as a second pendulum pivoting from the right hand. This action gives the vaulter the best position possible to be ejected off the pole. The swing continues until the hips are above the head and the arms are pulling the pole close to the chest; from there the vaulter shoots their legs up over the cross bar while keeping the pole close.         The extension refers to the extension of the hips upward with outstretched legs as the shoulders drive down, causing the vaulter to be positioned upside down. This position is often referred to as inversion . While this phase is executed, the pole begins to recoil, propelling the vaulter quickly upward. The hands of the vaulter remain close to the body as they move from the shins back to the region around the hips and upper torso.       The turn is executed immediately after or even during the end of the rockback. As the name implies, the vaulter turns 180° toward the pole while extending the arms down past the head and shoulders. Typically the vaulter will begin to angle their body toward the ": null
    },
    {
        "bar": "Bar"
    },
    {
        " as the turn is executed, although ideally the vaulter will remain as vertical as possible. A more accurate description of this phase of the vault may be the spin because the vaulter spins around an imaginary axis from head to toe.       This is often highly emphasized by spectators and novice vaulters, but it is the easiest phase of the vault and is a result of proper execution of previous phases. This phase mainly consists of the vaulter pushing off the pole and releasing it so it falls away from the ": null
    },
    {
        "bar": "Bar"
    },
    {
        " and mats. As the torso goes over and around the ": null
    },
    {
        "bar": "Bar"
    },
    {
        ", the vaulter is facing the bar. Rotation of the body over the bar occurs naturally, and the vaulters main concern is making sure that their arms, face and any other appendages do not knock the bar off as they go over. The vaulter should land near the middle of the foam landing mats, or ": null
    },
    {
        "pits": "Pit"
    },
    {
        ", face up.       BarBox in depth. The bottom of the box gradually slopes upward approximately  until it is level with the runway. The covering in the box ensures the pole will slide to the back of the box without catching on anything. The coverings lip overlaps onto the runway and ensures a smooth transition from all-weather surface so a pole being planted does not catch on the box.   Drive kneeGripJump footPitPlant positionPoleStandardsStepsSwing leg or trail leg Volzing ": null
    },
    {
        "Dave Volz": "Dave Volz"
    },
    {
        ", who made an art form of the practice and surprised many by making the U.S. Olympic team in 1992.            ;Key:          Correct as of July 2019 IAAF. Retrieved on 25 January 2014. IAAF. Retrieved on 25 January 2014.         Below is a list of vaults equal or superior to 6.00m.   Sergey Bubka also vaulted , , , , , , , , , , , and .   Renaud Lavillenie also vaulted , , , , , and .   Steve Hooker also vaulted and .   Piotr Lisek also vaulted and .   Radion Gataullin also vaulted .   Armand Duplantis also vaulted .   Maksim Tarasov also vaulted .   Sam Kendricks also vaulted .       Correct as of September 2019 IAAF. Retrieved on 25 January 2014. IAAF. Retrieved on 25 January 2014.         Below is a list of vaults equal or superior to 4.85m:   Yelena Isinbayeva also vaulted , , , , , , , , , , .   Jennifer Suhr also vaulted , , , , , , , , , .   Sandi Morris also vaulted , , , i , , , i , .   Eliza McCartney also vaulted , , , .   Katerina Stefanidi also vaulted , , , .   Anzhelika Sidorova also vaulted i , i , i , i , .   Katie Nageotte also vaulted i .   Fabiana Murer also vaulted .       The six metres club consists of pole vaulters who have reached at least 6.00. US unit calculator for unofficial in athletic events, hosted by USATF.org In 1985 Sergey Bubka became the first pole vaulter to clear six metres.           Three women have cleared 5 metres. Yelena Isinbayeva was the first to clear on July 22, 2005. On March 2, 2013, Jenn Suhr cleared indoors to become the second. Sandi Morris cleared 5.00 meters on September 9, 2016, to become the third.           This is a list of the first time a milestone height was cleared.                                         Known as the World Indoor Games                                       altitude.                                             ": null
    }
]