[
    {
        "The politics of Tajikistan  takes place in a framework of a ": null
    },
    {
        "presidential": "Presidential System"
    },
    {
        " republic": "Republic"
    },
    {
        ", whereby the ": null
    },
    {
        "President": "President Of Tajikistan"
    },
    {
        " is both ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " and ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ". ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in both the ": null
    },
    {
        "executive branch": "Executive Branch"
    },
    {
        " and the two chambers of parliament.       The August 1991 putsch widened the rift. Frustrated by daily demonstrations in front of the Supreme Soviet and the erosion of the governments authority, the regime appeared to support the Moscow putschists. Kadriddin Aslonov, then the chairman of the Supreme Soviet of Tajikistan, went on record in defence of the status quo when complaining to a journalist of Izvestia that the country is falling into chaos. This statement encapsulated the feeling of the republican leadership. Support for the putschists exasperated the already galvanised intelligentsia. A flood of demonstrators blocked roads adjacent to the building of the Supreme Soviet and forced Kahar Mahkamov to resign on 31 August 1991. Demonstrators, encouraged by the opposition parties but not entirely controlled by them, had far-reaching demands: the banning of the Communist party and the nationalization of its assets, the resignation of the entire government, the dissolution of the legislature and new elections.     During this turmoil Tajikistan ": null
    },
    {
        "declared its independence": "Independence Day"
    },
    {
        " from Soviet Union, on September 9, 1991 and promptly fell into a ": null
    },
    {
        "civil war": "Tajikistan Civil War"
    },
    {
        " from 1992  1997 between old-guard regits, and Islamists loosely organized as the ": null
    },
    {
        "United Tajik Opposition": "United Tajik Opposition"
    },
    {
        " . Other combatants and armed bands that flourished in this civil chaos simply reflected the breakdown of central authority rather than loyalty to a political faction. The height of hostilities occurred between 1992-93. By 1997, the predominantly Kulyabi-led Tajik government and the UTO successfully negotiated a power-sharing peace accord and implemented it by 2000.     Tajikistan is slowly rebuilding itself with an integrated government and continues to permit a ": null
    },
    {
        "Russia": "Russia"
    },
    {
        "n military presence to guard their border with Afghanistan and the basing of the ": null
    },
    {
        "Russian 201st Motorized Rifle Division": "201Stmotorrifledivision"
    },
    {
        " that never left Tajikistan when it became independent. Most of these Russian-led forces, however, are local Tajik non-commissioned officers and soldiers.     Both Tajikistans presidential and parliamentary elections, in 1999 and 2000, respectively, were widely considered to be flawed and unfair but peaceful. The inclusion of an Islamist party committed to secular government and several other parties in the Parliamentary elections represented an improvement in the Tajik peoples right to choose their government. Tajikistan is the only Central Asian country in which a religiously affiliated political party is represented in Parliament. President ": null
    },
    {
        "Emomali Rahmon": "Emomali Rahmon"
    },
    {
        ", while no longer specifically obliged—as he was under the peace accords—to allocate one-third of government positions to the UTO, has kept some former UTO officials in senior cabinet-level positions. While the government and the now incorporated former opposition continue to distrust each other, they have often found a way to work with each other and are committed to peacefully resolving their differences.     Prior to the overthrow of the ": null
    },
    {
        "Taliban": "Taliban"
    },
    {
        " in 2001, the civil war in ": null
    },
    {
        "Afghanistan": "Afghanistan"
    },
    {
        " produced cross-border effects that threatened to destabilize Tajikistans fragile and hard-won peace. In the summers of 1999 and 2000, the ": null
    },
    {
        "Islamic Movement of Uzbekistan": "Islamic Movement Of Uzbekistan"
    },
    {
        " used Tajikistan as a staging ground for an insurgency campaign against the government of ": null
    },
    {
        "Uzbekistan": "Uzbekistan"
    },
    {
        ". At the same time, Taliban advances in northern Afghanistan threatened to inundate Tajikistan with thousands of refugees. A constant flow of illegal narcotics continues to transit Tajikistan from Afghanistan on its way to Russian and European markets, leaving widespread violent crime, corruption, increased HIV incidence, and economic distortions in its wake. During 2002, stability in the country continued to increase, and the year was largely free of the assassinations and outbreaks of violence perpetrated by unreformed opposition members that plagued the country in previous years.       :The sections that follow incorporate text from the Library of Congress Country Study : , which is a United States government publication in the public domain .     | President   | Emomali Rahmon   | Peoples Democratic Party of Tajikistan   |16 November 1994   |-   | Prime Minister   | Kokhir Rasulzoda   | Peoples Democratic Party of Tajikistan   |23 November 2013   |UTOJanuary 2007Majlisi OliMajlisi namoyandagonfrom November through end of JuneMajlisi millimajlisialso called the Bar Association of the Republic of Tajikistan viloyat viloyati mukhtorin Tajik : Viloyati Mukhtori Kuhistoni BadakhshonRaiony Respublikanskogo Podchineniya in transliteration from Russian or in ; formerly known as Karotegin Province formerly Leninabadformerly Kurgan-Tyubeformerly Khorog, nohiya or raionvillage-level self-governing unitsmajlisPDPUTOIRPobserver": null
    }
]