[
    {
        "   The Politics of Bosnia and Herzegovina takes place in a framework of a ": null
    },
    {
        "parliamentary": "Parliamentary System"
    },
    {
        " representative democracy": "Representative Democracy"
    },
    {
        ", whereby ": null
    },
    {
        "executive power": "Executive Power"
    },
    {
        " is exercised by the ": null
    },
    {
        "Council of Ministers of Bosnia and Herzegovina": "Council Of Ministers Of Bosnia And Herzegovina"
    },
    {
        ". ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in both the Council of Ministers and the ": null
    },
    {
        "Parliamentary Assembly of Bosnia and Herzegovina": "Parliamentary Assembly Of Bosnia And Herzegovina"
    },
    {
        ". Members of the Parliamentary Assembly are chosen according to a ": null
    },
    {
        "proportional representation": "Proportional Representation"
    },
    {
        " system.     The ": null
    },
    {
        "judiciary": "Judiciary"
    },
    {
        " is independent of the executive and the legislature. The system of government established by the ": null
    },
    {
        "Dayton Accord": "Dayton Accord"
    },
    {
        " is an example of ": null
    },
    {
        "consociationalism": "Consociationalism"
    },
    {
        ", as representation is by elites who represent the countrys three major ": null
    },
    {
        "ethnic groups": "Ethnic Group"
    },
    {
        "termed constituent peoples, with each having a guaranteed share of power.     Bosnia and Herzegovina is divided into two Entities – the ": null
    },
    {
        "Federation of Bosnia and Herzegovina": "Federation Of Bosnia And Herzegovina"
    },
    {
        " and the ": null
    },
    {
        "Republika Srpska": "Republika Srpska"
    },
    {
        ", which are politically autonomous to an extent, as well as the district of ": null
    },
    {
        "Brčko": "Brčko District"
    },
    {
        ", which is jointly administered by both. The Entities have their own constitutions.    :See Political divisions of Bosnia and Herzegovina        Due to the ": null
    },
    {
        "Dayton Agreement": "Dayton Agreement"
    },
    {
        ", signed on 14 December 1995, Bosnia and Herzegovina forms an ": null
    },
    {
        "undeclared": "Declaration"
    },
    {
        " protectorate": "Protectorate"
    },
    {
        " with elements of ": null
    },
    {
        "hegemony": "Hegemony"
    },
    {
        " by neighboring ": null
    },
    {
        "Croatia": "Croatia"
    },
    {
        " and ": null
    },
    {
        "Serbia": "Serbia"
    },
    {
        " as co-signatories to the Agreement, where highest power is given to the ": null
    },
    {
        "High Representative for Bosnia and Herzegovina": "High Representative For Bosnia And Herzegovina"
    },
    {
        ". The intention of the Agreement was to retain Bosnias exterior border, while creating a joint multi-ethnic and democratic government based on proportional representation similar to the former socialist régime, and charged with conducting foreign, economic, and fiscal policy.     The Dayton Agreement established the Office of the ": null
    },
    {
        "High Representative": "High Representative For Bosnia And Herzegovina"
    },
    {
        " to oversee the implementation of the civilian aspects of the agreement. About 250 international and 450 local staff members are employed by the OHR.             The highest political authority in the country is the High Representative in Bosnia and Herzegovina, the chief executive officer for the international civilian presence in the country. The High Representative has power to remove government officials, including court justices, local government members, members of parliament, etc. From its establishment, the Office of the High Representative has sacked 192 Bosnian and Herzegovinian officials. The mandate of the High Representatives derives from the Dayton Agreement, as confirmed by the ": null
    },
    {
        "Peace Implementation Council": "Peace Implementation Council"
    },
    {
        ", a body with a Steering Board composed of representatives of ": null
    },
    {
        "Canada": "Canada"
    },
    {
        ", ": null
    },
    {
        "France": "France"
    },
    {
        ", ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", ": null
    },
    {
        "Italy": "Italy"
    },
    {
        ", ": null
    },
    {
        "Japan": "Japan"
    },
    {
        ", ": null
    },
    {
        "Russia": "Russia"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        ", the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", the ": null
    },
    {
        "presidency of the European Union": "Presidency Of The European Union"
    },
    {
        ", the ": null
    },
    {
        "European Commission": "European Commission"
    },
    {
        ", and the ": null
    },
    {
        "Organisation of Islamic Cooperation": "Organisation Of Islamic Cooperation"
    },
    {
        ". The Peace Implementation Council has established several criteria for the OHR to be closed, two of which have been completed but must be sustained until all five are completed.       The Chair of the ": null
    },
    {
        "Presidency of Bosnia and Herzegovina": "Presidency Of Bosnia And Herzegovina"
    },
    {
        " rotates amongst three members  every 8 months within their 4-year term. The three members of the ": null
    },
    {
        "Presidency": "Presidency Of Bosnia And Herzegovina"
    },
    {
        " are elected directly by the people, with Federation voters electing both the Bosniak and the Croat member, and Republika Srpska voters electing the Serb member. The Presidency serves as a collective ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        ". The Presidency is mainly responsible for the ": null
    },
    {
        "foreign policy": "Foreign Policy"
    },
    {
        " and proposing the ": null
    },
    {
        "budget": "Budget"
    },
    {
        ".       The Prime Minister, formally titled ": null
    },
    {
        "Chairman of the Council of Ministers of Bosnia and Herzegovina": "Council Of Ministers Of Bosnia And Herzegovina"
    },
    {
        ", is nominated by the Presidency and approved by the House of Representatives. He appoints the Minister of Foreign Affairs, the Minister of Foreign Trade and other ministers as may be appropriate , who assume the office upon the approval by the House of Representatives; also, the Chair appoints deputy ministers , who assume the office upon the approval by the House of Representatives.     The Council is responsible for carrying out policies and decisions in the fields of diplomacy, economy, inter-entity relations and other matters as agreed by the entities.     The two Entities have Governments that deal with internal matters not dealt with by the Council of Ministers.           Past international ": null
    },
    {
        "high representatives": "High Representative For Bosnia And Herzegovina"
    },
    {
        "Carl Bildt": "Carl Bildt"
    },
    {
        ", ": null
    },
    {
        "Carlos Westendorp": "Carlos Westendorp"
    },
    {
        ", ": null
    },
    {
        "Wolfgang Petritsch": "Wolfgang Petritsch"
    },
    {
        ", ": null
    },
    {
        "Paddy Ashdown": "Paddy Ashdown"
    },
    {
        ", ": null
    },
    {
        "Christian Schwarz-Schilling": "Christian Schwarz-Schilling"
    },
    {
        ", ": null
    },
    {
        "Miroslav Lajčák": "Miroslav Lajčák"
    },
    {
        ".     Members of the Presidency who stepped down under pressure from the Office of the High Representative: ": null
    },
    {
        "Mirko Šarović": "Mirko Šarović"
    },
    {
        ", ": null
    },
    {
        "Ante Jelavić": "Ante Jelavić"
    },
    {
        ", ": null
    },
    {
        "Dragan Čović": "Dragan Čović"
    },
    {
        ". ": null
    },
    {
        "Alija Izetbegović": "Alija Izetbegović"
    },
    {
        " also withdrew from the Presidency.     In February 2000, the Supreme Court ruled that the structure of the Council of Ministers was unconstitutional; a new structure is being negotiated.     Federation president and vice-president in 1999: ": null
    },
    {
        "Ejup Ganić": "Ejup Ganić"
    },
    {
        "   and ": null
    },
    {
        "Ivo Andrić-Lužanski": "Ivo Andrić-Lužanski"
    },
    {
        ".     Past RS presidents: ": null
    },
    {
        "Radovan Karadžić": "Radovan Karadžić"
    },
    {
        ", ": null
    },
    {
        "Biljana Plavšić": "Biljana Plavšić"
    },
    {
        ", ": null
    },
    {
        "Nikola Poplašen": "Nikola Poplašen"
    },
    {
        ", ": null
    },
    {
        "Mirko Šarović": "Mirko Šarović"
    },
    {
        ", ": null
    },
    {
        "Dragan Čavić": "Dragan Čavić"
    },
    {
        ", ": null
    },
    {
        "Milan Jelić": "Milan Jelić"
    },
    {
        ".     RS president ": null
    },
    {
        "Nikola Poplašen": "Nikola Poplašen"
    },
    {
        " was removed by the OHR on 5 March 1999.       The Parliamentary Assembly or Parliamentarna skupština is the main legislative body in Bosnia and Herzegovina. It consists of ": null
    },
    {
        "two chambers": "Bicameralism"
    },
    {
        "House of Peoples": "House Of Peoples Of Bosnia And Herzegovina"
    },
    {
        " or Dom naroda ": null
    },
    {
        "National House of Representatives": "House Of Representatives Of Bosnia And Herzegovina"
    },
    {
        " or Predstavnički dom/Zastupnički dom     The Parliamentary Assembly is responsible for:   enacting legislation as necessary to implement decisions of the Presidency or to carry out the responsibilities of the Assembly under the Constitution.   deciding upon the sources and amounts of revenues for the operations of the institutions of Bosnia and Herzegovina and international obligations of Bosnia and Herzegovina.   approving the budget for the institutions of Bosnia and Herzegovina.   deciding ratify treaties and agreements.   other matters as are necessary to carry out its duties of as are assigned to it by mutual agreement of the Entities.     Bosnia and Herzegovina did not have a permanent ": null
    },
    {
        "election law": "Election Law"
    },
    {
        " until 2001, during which time a draft law specified four-year terms for the state and first-order administrative division entity legislatures. The final election law was passed and publicized on 9 September 2001.       The House of Peoples includes 15 delegates who serve two-year terms. Two-thirds of delegates come from the Federation and one-third from the Republika Srpska . Nine constitutes a quorum in the House of Peoples, provided that at least three delegates from each group are present. Federation representatives are selected by the House of Peoples of the Federation, which has 58 seats , and whose members are delegated by cantonal assemblies to serve four-year terms. Republika Srpska representatives are selected by the 28-member Republika Srpska Council of Peoples, which was established in the Peoples Assembly of Republika Srpska; each constituent people has eight delegates, while four delegates are representatives of others .       The ": null
    },
    {
        "House of Representatives of Bosnia and Herzegovina": "House Of Representatives Of Bosnia And Herzegovina"
    },
    {
        " comprises 42 members elected under a system of ": null
    },
    {
        "proportional representation": "Proportional Representation"
    },
    {
        " for a four-year term. Two thirds of the members are elected from the Federation and one third from the Republika Srpska .     For the ": null
    },
    {
        "2010 elections": "2010 Bosnia And Herzegovina General Election"
    },
    {
        ", Voters in the Federation of Bosnia and Herzegovina elected twenty-one members in five multi-member constituencies by PR, while the remaining seven seats were allocated by compensatory PR. Voters in the Republika Srpska elected nine members in three multi-member constituencies by PR, while the five other seats were allocated by compensatory PR. , 17 December 2010, accessed 3 October 2012 .                        National House of Representatives:   elections held 12–13 September 1998:   seats by party/coalition – KCD 17, HDZ-BiH 6, SDP-BiH 6, Sloga 4, SDS 4, SRS-RS 2, DNZ 1, NHI 1, RSRS 1   elections held 5 October 2002:   percent of vote by party/coalition - SDA 21.9%, SDS 14.0%, SBiH 10.5%, SDP 10.4%, SNSD 9.8%, HDZ 9.5%, PDP 4.6%, others 19.3%   seats by party/coalition – SDA 10, SDS 5, SBiH 6, SDP 4, SNSD 3, HDZ 5, PDP 2, others 7     House of Peoples:   constituted 4 December 1998   constituted in fall 2000   constituted in January 2003   next to be constituted in 2007     Federation House of Representatives:   elections held fall 1998:   seats by party/coalition – KCD 68, HDZ-BiH 28, SDP-BiH 25, NHI 4, DNZ 3, DSP 2, BPS 2, HSP 2, SPRS 2, BSP 1, KC 1, BOSS 1, HSS 1   elections held 5 October 2002:   seats by party/coalition – SDA 32, HDZ-BiH 16, SDP 15, SBiH 15, other 20     Federation House of Peoples:   constituted November 1998   constituted December 2002     Republika Srpska National Assembly:   elections held fall 1998   seats by party/coalition – SDS 19, KCD 15, SNS 12, SRS-RS 11, SPRS 10, SNSD 6, RSRS 3, SKRS 2, SDP 2, KKO 1, HDZ-BiH 1, NHI 1   elections held fall 2000   elections held 5 October 2002   seats by party/coalition – SDS 26, SNSD 19, PDP 9, SDA 6, SRS 4, SPRS 3, DNZ 3, SBiH 4, SDP 3, others 6         The ": null
    },
    {
        "Constitutional Court of Bosnia and Herzegovina": "Constitutional Court Of Bosnia And Herzegovina"
    },
    {
        " is the supreme, final arbiter of constitutional matters. The court is composed of nine members: four selected by the House of Representatives of the Federation, two by the Peoples Assembly of Republika Srpska, and three are foreign citizens appointed by the President of the ": null
    },
    {
        "European Court of Human Rights": "European Court Of Human Rights"
    },
    {
        " after courtesy-consultation with the Presidency.     The initial term of appointee is 5 years, unless they resign or are removed by consensus of other judges. Appointed judges are not eligible for reappointment. Judges subsequently appointed will serve until the age of 70, unless they resign sooner or are removed. Appointments made 5 years into the initial appointments may be governed by a different regulation for selection, to be determined by the Parliamentary Assembly.     Proceedings of the Court are public, and decisions are published. Court rules are adopted by a majority in the Court. Court decisions are final and supposedly binding though this is not always the case, as noted. , Večernji list 3.1.2014     The Constitutional Court has jurisdiction over deciding in constitutional disputes that arise between the Entities or amongst Bosnia and Herzegovina and an Entity or Entities. Such disputes may be referred only by a member of the Presidency, the Chair of the Council of Ministers, the Chair or Deputy Chair of either of the chambers of the Parliamentary Assembly, or by one-fourth of the legislature of either Entity.     The Court also has appellate jurisdiction within the territory of Bosnia and Herzegovina.       The ": null
    },
    {
        "State Court of Bosnia and Herzegovina": "State Court Of Bosnia And Herzegovina"
    },
    {
        " consists of three divisions – Administrative, Appellate and Criminal – having jurisdiction over cases related to the state-level law and executive, as well as appellate jurisdiction over cases initiated in the entities.     A War Crimes Chamber was introduced in January 2005, and has adopted two cases transferred from the ICTY, as well as dozens of war crimes cases originally initiated in cantonal courts.     The State Court also deals with organized crime, and economic crime including corruption cases. For example, the former and 2014 member-elect of the Presidency ": null
    },
    {
        "Dragan Čović": "Dragan Čović"
    },
    {
        " is currently on trial for alleged involvement in organized crime.       The ": null
    },
    {
        "Human Rights Chamber for Bosnia and Herzegovina": "Human Rights Chamber For Bosnia And Herzegovina"
    },
    {
        "  existed between March 1996 and 31 December 2003. It was a judicial body established under the Annex 6 to the ": null
    },
    {
        "General Framework Agreement for Peace in Bosnia and Herzegovina": "General Framework Agreement For Peace In Bosnia And Herzegovina"
    },
    {
        " ": null
    }
]