[
    {
        "      The politics of Slovenia  takes place in a framework of a ": null
    },
    {
        "parliamentary": "Parliamentary System"
    },
    {
        " representative democratic": "Representative Democracy"
    },
    {
        " republic": "Republic"
    },
    {
        ", whereby the ": null
    },
    {
        "Prime Minister of Slovenia": "Prime Minister Of Slovenia"
    },
    {
        " is the ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ". ": null
    },
    {
        "Executive power": "Executive Power"
    },
    {
        " is exercised by the ": null
    },
    {
        "Government of Slovenia": "Government Of Slovenia"
    },
    {
        ". ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in the ": null
    },
    {
        "National Assembly": "National Assembly"
    },
    {
        " and in minor part in the ": null
    },
    {
        "National Council": "National Council"
    },
    {
        ". The ": null
    },
    {
        "judiciary of Slovenia": "Judiciary Of Slovenia"
    },
    {
        " is independent of the executive and the legislature.        As a young independent ": null
    },
    {
        "republic": "Republic"
    },
    {
        ",  Slovenia  pursued ": null
    },
    {
        "economic stabilization": "Economic Stability"
    },
    {
        " and further political openness, while emphasizing its Western outlook and central European heritage. Today, with a growing regional profile, a participant in the ": null
    },
    {
        "SFOR": "Sfor"
    },
    {
        " peacekeeping deployment in ": null
    },
    {
        "Bosnia": "Bosnia And Herzegovina"
    },
    {
        " and the ": null
    },
    {
        "KFOR": "Kosovo Force"
    },
    {
        " deployment in ": null
    },
    {
        "Kosovo": "Kosovo"
    },
    {
        ", and a charter ": null
    },
    {
        "World Trade Organization": "World Trade Organization"
    },
    {
        " member, Slovenia plays a role on the world stage quite out of proportion to its small size.     From 1998 to 2000, Slovenia occupied a nonpermanent seat on the ": null
    },
    {
        "UN Security Council": "Un Security Council"
    },
    {
        " and in that capacity distinguished itself with a constructive, creative, and consensus-oriented activism. Slovenia has been a member of the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " since May 1992 and of the ": null
    },
    {
        "Council of Europe": "Council Of Europe"
    },
    {
        " since May 1993. Slovenia signed an association agreement with the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " in 1996 and is a member of the ": null
    },
    {
        "Central European Free Trade Agreement": "Central European Free Trade Agreement"
    },
    {
        ". Slovenia also is a member of all major international financial institutions  as well as 40 other international organizations, among them the World Trade Organization, of which it is a founding member.     Since the breakup of the ": null
    },
    {
        "former Yugoslavia": "Socialist Federal Republic Of Yugoslavia"
    },
    {
        ", Slovenia has instituted a stable, multi-party, democratic political system, characterized by regular elections, a free press, and an excellent ": null
    },
    {
        "human rights": "Human Rights"
    },
    {
        " record. However, Slovenia is the only former Communist state that has never carried out ": null
    },
    {
        "lustration": "Lustration"
    },
    {
        ".  By ": null
    },
    {
        "Constitution of Slovenia": "Constitution Of Slovenia"
    },
    {
        " the country is a ": null
    },
    {
        "parliamentary democracy": "Parliamentary Democracy"
    },
    {
        " and a ": null
    },
    {
        "republic": "Republic"
    },
    {
        ". Within its government, power is shared between a directly elected president, a prime minister, and an incompletely bicameral legislature.   The legislative body is composed of the 90-member National Assembly—which takes the lead on virtually all legislative issues—and the National Council, a largely advisory body composed of representatives from social, economic, professional, and local interests. The Constitutional Court has the highest power of review of legislation to ensure its consistency with Slovenias constitution. Its nine judges are elected for 9-year terms.     In 1997, elections were held to elect both a president and representatives to Parliaments upper house, the National Council. ": null
    },
    {
        "Milan Kučan": "Milan Kučan"
    },
    {
        ", elected President of the Yugoslav Republic of Slovenia in 1990, led his country to independence in 1991. He was elected the first President of independent Slovenia in 1992 and again in November 1997 by a comfortable margin.     ": null
    },
    {
        "Janez Drnovšek": "Janez Drnovšek"
    },
    {
        " of the center-left ": null
    },
    {
        "Liberal Democratic Party of Slovenia": "Liberal Democratic Party Of Slovenia"
    },
    {
        " was reelected Prime Minister in the 15 October 2000 parliamentary elections. Drnovšeks coalition held an almost two-thirds majority in Parliament.     The government, most of the Slovenian polity, shares a common view of the desirability of a close association with the West, specifically of membership in both the European Union and ": null
    },
    {
        "NATO": "Nato"
    },
    {
        ". For all the apparent bitterness that divides left and right wings, there are few fundamental philosophical differences between them in the area of public policy. Slovenian society is built on consensus, which has converged on a social-democrat model. Political differences tend to have their roots in the roles that groups and individuals played during the years of communist rule and the struggle for independence.     As the most prosperous republic of the former Yugoslavia, Slovenia emerged from its brief ten-day war of secession in 1991 as an independent nation for the first time in its history. Since that time, the country has made steady but cautious progress toward developing a market economy. Economic reforms introduced shortly after independence led to healthy economic growth. Despite the halting pace of reform and signs of slowing GDP growth today, Slovenians now enjoy the highest ": null
    },
    {
        "per capita": "Per Capita"
    },
    {
        " income of all the transition economies of central Europe.     The Slovenians have pursued internal economic restructuring with caution. The first phase of ": null
    },
    {
        "privatization": "Privatization"
    },
    {
        " is now complete, and sales of remaining large state holdings are planned for next year. Trade has been diversified toward the West and the growing markets of central and eastern Europe. Manufacturing accounts for most employment, with machinery and other manufactured products comprising the major exports. Labor force surveys put unemployment at approximately 6.6% , with 106,153 registrations for unemployment assistance. ": null
    },
    {
        "Inflation": "Inflation"
    },
    {
        " has remained below double-digit levels, 6.1% and 8.9% . Gross domestic product grew by about 4.8% in 2000 and is expected to post a slightly lower rate of 4.5% in 2001, as export demand lags. The currency is stable, fully convertible, and backed by substantial reserves. The economy provides citizens with a good ": null
    },
    {
        "standard of living": "Standard Of Living"
    },
    {
        ".     Ten years after independence, Slovenia has made tremendous progress establishing democratic institutions, enshrining respect for human rights, establishing a ": null
    },
    {
        "market economy": "Market Economy"
    },
    {
        " and adapting its military to Western norms and standards. In contrast to its neighbors, civil tranquility and strong economic growth have marked this period. Upon achieving independence, Slovenia offered citizenship to all residents, regardless of ethnicity or origin, avoiding a sectarian trap that has caught out many central European countries. Slovenia willingly accepted refugees from the fighting in Bosnia and has since participated in international stabilization efforts in the region.     On the international front, Slovenia has advanced rapidly toward integration into the Euro-Atlantic community of nations. Invited to begin accession negotiations with the European Union in November 1998, Slovenia has achieve two of its primary foreign policy goals: membership in the EU and NATO. Slovenia also participates in the ": null
    },
    {
        "Southeast Europe Cooperation Initiative ": "Southeast Europe Cooperation Initiative"
    },
    {
        ".          Slovenia remains firmly committed to achieving NATO membership in a second round of enlargement. Slovenia has been an active participant in Partnership for Peace and has sought to demonstrate its preparedness to take on the responsibilities and burdens of membership in the Alliance. The ": null
    },
    {
        "United States": "United States"
    },
    {
        " looks to Slovenia to play a productive role in continuing security efforts throughout the region. It has done much– contributing to the success of IFOR, SFOR, efforts in ": null
    },
    {
        "Albania": "Albania"
    },
    {
        ", the ": null
    },
    {
        "Republic of Macedonia": "Republic Of Macedonia"
    },
    {
        ", ": null
    },
    {
        "Montenegro": "Montenegro"
    },
    {
        ", ": null
    },
    {
        "Kosovo": "Kosovo"
    },
    {
        ", and elsewhere– and has continued to expand actively its constructive regional engagement.     Slovenia is one of the focus countries for the United States southeast European policy, aimed at reinforcing regional stability and integration. The Slovenian Government is well-positioned to be an influential role model for other southeast European governments at different stages of reform and integration. To these ends, the United States urges Slovenia to maintain momentum on internal economic, political, and legal reforms, while expanding their international cooperation as resources allow. Although harmonization with EU law and standards will require great efforts, already underway, the EU accession process will serve to advance Slovenias structural reform agenda. U.S. and Allied efforts to assist Slovenias military restructuring and modernization efforts are ongoing.          The ": null
    },
    {
        "constitution": "Constitution"
    },
    {
        " was adopted on 23 December 1991, effective 23 December 1991.           ": null
    },
    {
        "President": "President Of Slovenia"
    },
    {
        " Borut Pahor": "Borut Pahor"
    },
    {
        " Social Democrats": "Social Democrats"
    },
    {
        " Prime Minister": "Prime Minister Of Slovenia"
    },
    {
        " Marjan Šarec": "Marjan Šarec"
    },
    {
        " List of Marjan Šarec": "List Of Marjan Šarec"
    },
    {
        " Državni zbornonsignatory userobserverguestassociate partner": null
    }
]