[
    {
        "   The politics of the state of ": null
    },
    {
        "San Marino": "San Marino"
    },
    {
        " takes place in a framework of a ": null
    },
    {
        "parliamentary": "Parliamentary System"
    },
    {
        " representative democratic": "Representative Democracy"
    },
    {
        " republic": "Republic"
    },
    {
        ", whereby the ": null
    },
    {
        "Captains Regent": "Captain Regent"
    },
    {
        " are the ": null
    },
    {
        "heads of state": "Head Of State"
    },
    {
        " and ": null
    },
    {
        "heads of government": "Head Of Government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ". ": null
    },
    {
        "Executive power": "Executive Power"
    },
    {
        " is exercised by the ": null
    },
    {
        "government": "Government"
    },
    {
        ". ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in both the government and the ": null
    },
    {
        "Grand and General Council": "Grand And General Council"
    },
    {
        ". The ": null
    },
    {
        "judiciary": "Judiciary"
    },
    {
        " is independent of the executive and the legislature.     ": null
    },
    {
        "San Marino": "San Marino"
    },
    {
        " was originally led by the ": null
    },
    {
        "Arengo": "Arengo"
    },
    {
        ", initially formed with the heads of each family. In the 13th century, power was given to the Great and General Council. In 1243, the first two ": null
    },
    {
        "Captains Regent": "Captain Regent"
    },
    {
        " were nominated by the Council and is still in use today.            The legislature of the republic is the Grand and General Council . The Council is a unicameral legislature which has 60 members with elections occurring every 5 years under a majoritarian representation system in a sole national constituency. Citizens eighteen years or older are eligible to vote. Besides general legislation, the Grand and General Council approves the budget and elects the Captains Regent, the State Congress, the Council of Twelve, the Advising Commissions, and the Government Unions. The Council also has the power to ratify treaties with other countries. The Council is divided into five different Advising Commissions consisting of 15 councilors which examine, propose, and discuss the implementation of new laws that are on their way to being presented on the floor of the Council.          Every six months, the Council elects two ": null
    },
    {
        "Captains Regent": "Captains Regent"
    },
    {
        " to be the heads of state. The foundational theory was to create a balance of power or, at least, reciprocal control. They serve a 6-month term. The investiture of the Captains Regent takes place on April 1 and October 1 in every year. Once this term is over, citizens have 3 days in which to file complaints about the Captains activities. If they warrant it, judicial proceedings against the ex-head of state can be initiated.     The practice of dual heads of state, according to the ": null
    },
    {
        "principle of Collegiality": "Collegialitycollegiality In The Roman Republic"
    },
    {
        ", as well as the frequent re-election of same, are derived directly from the customs of the ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        ". The Council is equivalent to the ": null
    },
    {
        "Roman Senate": "Roman Senate"
    },
    {
        "; the Captains Regent, to the ": null
    },
    {
        "consuls": "Roman Consul"
    },
    {
        " of ancient ": null
    },
    {
        "Rome": "Rome"
    },
    {
        ".          The Congress of State is the government of the country and wields the executive power. It is composed by a variable number of Secretaries of State, which by law cannot exceed the number of 10, that are appointed by the Grand and General Council at the beginning of the legislature. Because of this fact, also the areas of competence of the various Secretaries are not fixed, as some could be merged depending on the number of Secretaries. The law identifies 10 sectors of the public administration for which the secretaries are politically responsible:     ": null
    },
    {
        "Secretary of State for Foreign and Political Affairs": "Secretary Of State For Foreign And Political Affairs"
    },
    {
        " Secretary of State for Internal Affairs and Civil Defense": "Secretary Of State For Internal Affairs And Civil Defense"
    },
    {
        " Secretary of State for Finance, Budget and Programming, Information and Relations with the State Philatelic and Numismatic Office": "Secretary Of State For Finance, Budget And Programming, Information And Relations With The State Philatelic And Numismatic Office"
    },
    {
        " Secretary of State for Education, Culture, University and Justice": "Secretary Of State For Education, Culture, University And Justice"
    },
    {
        " Secretary of State for Territory, Environment and Agriculture": "Secretary Of State For Territory, Environment And Agriculture"
    },
    {
        " Secretary of State for Health and Social Security ": "Secretary Of State For Health And Social Security"
    },
    {
        " Secretary of State for Trade and Relations with the Town Council": "Secretary Of State For Trade And Relations With The Town Council"
    },
    {
        " Secretary of State for Communication, Transport, Relations with the Azienda Autonoma di Stato for Services, Tourism and Sport": "Secretary Of State For Communication, Transport, Relations With The Azienda Autonoma Di Stato For Services, Tourism And Sport"
    },
    {
        " Secretary of State for Industry and Crafts": "Secretary Of State For Industry And Crafts"
    },
    {
        " Secretary of State for Labour and Cooperation": "Secretary Of State For Labour And Cooperation"
    },
    {
        "     The Captains Regents participate to the Congress with coordination powers, but no voting right. While all the Secretaries are equally important on principle, over the years, the secretary of state for Foreign and Political Affairs has assumed many of the prerogatives of a prime minister or ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        ".             San Marino is a multi-party ": null
    },
    {
        "democratic republic": "Democratic Republic"
    },
    {
        ". The two main parties are the ": null
    },
    {
        "Sammarinese Christian Democratic Party": "Sammarinese Christian Democratic Party"
    },
    {
        " and the ": null
    },
    {
        "Party of Socialists and Democrats": "Party Of Socialists And Democrats"
    },
    {
        "  in addition to several other smaller parties. It is difficult for any party to gain a pure majority and most of the time the government is run by a coalition.     Because ": null
    },
    {
        "tourism": "Tourism"
    },
    {
        " accounts for more than 50% of the economic sector, the government relies not only on taxes and customs for revenue, but also on the sale of coins and postage stamps to collectors throughout the world. In addition, the Italian Government pays San Marino an annual budget subsidy provided under the terms of the Basic Treaty with ": null
    },
    {
        "Italy": "Italy"
    },
    {
        ".             The Council of Twelve  serves as the supreme tribunal of the republic. The ": null
    },
    {
        "Grand and General Council": "Grand And General Council"
    },
    {
        " elects the Council of Twelve, whose members remain in office until the next general election. The Council of Twelve has ": null
    },
    {
        "appellate jurisdiction": "Appellate Jurisdiction"
    },
    {
        " in the third instance. Two government inspectors represent the State in financial and patrimonial questions.          The Guarantors’ Panel on the Constitutionality of Rules  is the highest court of ": null
    },
    {
        "San Marino": "San Marino"
    },
    {
        " in matters of ": null
    },
    {
        "constitutional law": "Constitutional Law"
    },
    {
        ". The institution was established in February 2002, making it the youngest body of San Marino constitutional order. Its members are also elected by the ": null
    },
    {
        "Grand and General Council": "Grand And General Council"
    },
    {
        ".       The judicial system of San Marino is entrusted to foreign executives, both for historical and social reasons. The only native judges are the ": null
    },
    {
        "Justices of the Peace": "Justice Of The Peace"
    },
    {
        ", who handle only civil cases where sums involved do not exceed ": null
    },
    {
        "€": "Euro"
    },
    {
        "15,000.          San Marino carried out the last execution in its history in 1468 . The death penalty was abolished for murder on March 12, 1848, and for other crimes two years later.       The main issues confronting the current government include economic and administrative problems related to San Marinos status as a close financial and trading partner with Italy while at the same time remaining separated from the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " . The other priority issue will be to increase the transparency and efficiency in parliament and in relations among parliament, cabinet, and the Captains Regent.       ": null
    },
    {
        "Council of Europe": "Council Of Europe"
    },
    {
        ", ": null
    },
    {
        "ECE": "United Nations Economic Commission For Europe"
    },
    {
        ", ": null
    },
    {
        "ICAO": "Icao"
    },
    {
        ", ": null
    },
    {
        "ICC": "International Criminal Court"
    },
    {
        ", ICFTU, ": null
    },
    {
        "ICRM": "International Red Cross And Red Crescent Movement"
    },
    {
        ", IFRCS, ": null
    },
    {
        "ILO": "International Labour Organization"
    },
    {
        ", ": null
    },
    {
        "IMF": "International Monetary Fund"
    },
    {
        ", ": null
    },
    {
        "IOC": "Ioc"
    },
    {
        ", ": null
    },
    {
        "IOM": "International Organization For Migration"
    },
    {
        " , ": null
    },
    {
        "ITU": "International Telecommunication Union"
    },
    {
        ", ": null
    },
    {
        "OPCW": "Opcw"
    },
    {
        ", ": null
    },
    {
        "OSCE": "Organization For Security And Co-Operation In Europe"
    },
    {
        ", UN, ": null
    },
    {
        "UNCTAD": "Unctad"
    },
    {
        ", ": null
    },
    {
        "UNESCO": "Unesco"
    },
    {
        ", ": null
    },
    {
        "UPU": "Upu"
    },
    {
        ", ": null
    },
    {
        "WHO": "World Health Organization"
    },
    {
        ", ": null
    },
    {
        "WIPO": "Wipo"
    },
    {
        ", ": null
    },
    {
        "UNWTO": "World Tourism Organization"
    }
]