[
    {
        "The politics of Cameroon takes place in a framework of a ": null
    },
    {
        "unitary": "Unitary Republic"
    },
    {
        " presidential": "Presidential System"
    },
    {
        " republic": "Republic"
    },
    {
        ", whereby the ": null
    },
    {
        "President of Cameroon": "President Of Cameroon"
    },
    {
        " is both ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " and ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ". ": null
    },
    {
        "Executive power": "Executive Power"
    },
    {
        " is exercised by the government. ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in both the ": null
    },
    {
        "government": "Forms Of Government"
    },
    {
        " and the ": null
    },
    {
        "National Assembly of Cameroon": "National Assembly Of Cameroon"
    },
    {
        ".       The government adopted legislation in 1990 to authorize the formation of multiple ": null
    },
    {
        "political parties": "Political Party"
    },
    {
        " and ease restrictions on forming civil associations and private newspapers. Cameroons first multiparty legislative and presidential elections were held in 1992 followed by ": null
    },
    {
        "municipal": "Municipal"
    },
    {
        " elections in 1996 and another round of legislative and presidential elections in 1997. Because the government refused to consider opposition demands for an independent election commission, the three major opposition parties boycotted the October 1997 presidential election, which Biya easily won. The leader of one of the opposition parties, ": null
    },
    {
        "Bello Bouba Maigari": "Bello Bouba Maigari"
    },
    {
        " of the ": null
    },
    {
        "NUDP": "Nudp"
    },
    {
        ", subsequently joined the government.     Cameroon has a number of independent newspapers. ": null
    },
    {
        "Censorship": "Censorship"
    },
    {
        " was abolished in 1996, but the government sometimes seizes or suspends newspapers and occasionally arrests ": null
    },
    {
        "journalists": "Journalist"
    },
    {
        ". Although a 1990 law authorizes private radio and television stations, the government has not granted any licenses as of March 1998.     The Cameroonian Governments ": null
    },
    {
        "human rights": "Human Rights"
    },
    {
        " record has been improving over the years but remains flawed. There continue to be reported abuses, including beatings of detainees, arbitrary arrests, and illegal searches. The judiciary is frequently corrupt, inefficient, and subject to political influence.   Retrieved 2012-02-14.     Worthy of note is the fact that Cameroon is the only country in which two Constitutions are applicable side-by-side. For example, the 1972 Constitution designates the Prime Minister as constitutional successor of the Head of State in case of incapacity, death, resignation or unaccountable absence of the incumbent. Contrarily, the 1996 Constitutional Reform designates the President of the Senate as constitutional successor; but the Senate does not exist. Apart from increasing the presidential mandate from 5 years to 7 years, very few amendments of the 1996 Constitutional Reform have been applied.        ": null
    },
    {
        "President": "President Of Cameroon"
    },
    {
        " Paul Biya": "Paul Biya"
    },
    {
        " Cameroon Peoples Democratic Movement": "Cameroon Peoples Democratic Movement"
    },
    {
        " Prime Minister": "Prime Minister Of Cameroon"
    },
    {
        " Joseph Dion Ngute": "Joseph Dion Ngute"
    },
    {
        " Cameroon Peoples Democratic Movement": "Cameroon Peoples Democratic Movement"
    },
    {
        " g": "G"
    },
    {
        "vernme": "Vernme"
    },
    {
        "regardless of parliamentary representationabout 100 state-controlledthe Supreme CourtMarch/April, June/July, and November/December": null
    },
    {
        "meroe": "Mero"
    },
    {
        ".g. of women as domestic or women as cooks": null
    },
    {
        "mé Conventi": "Mé Conventi"
    },
    {
        "ganizati": "Ganizati"
    }
]