[
    {
        "   Politics of Guinea takes place in a framework of a ": null
    },
    {
        "presidential": "Presidential System"
    },
    {
        " representative democratic": "Representative Democracy"
    },
    {
        " republic": "Republic"
    },
    {
        ", whereby the ": null
    },
    {
        "President of Guinea": "President Of Guinea"
    },
    {
        " is both ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " and ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        " of ": null
    },
    {
        "Guinea": "Guinea"
    },
    {
        ". ": null
    },
    {
        "Executive power": "Executive Power"
    },
    {
        " is exercised by the government. Legislative power is vested in both the government and the ": null
    },
    {
        "National Assembly": "National Assembly Of Guinea"
    },
    {
        ".           A military dictatorship, led by then-Lt. Col. ": null
    },
    {
        "Lansana Conté": "Lansana Conté"
    },
    {
        " and styling itself the Military Committee of National Recovery , took control of Guinea in April 1984, shortly after the death of independent Guineas first president, ": null
    },
    {
        "Sékou Touré": "Sékou Touré"
    },
    {
        ". With Conté as president, the CMRN set about dismantling Tourés oppressive regime, abolishing the authoritarian constitution, dissolving the sole political party and its mass youth and womens organizations, and announcing the establishment of the Second Republic. The new government released all political prisoners and committed itself to the protection of ": null
    },
    {
        "human rights": "Human Rights"
    },
    {
        ". In order to reverse the steady economic decline under ": null
    },
    {
        "Tourés": "Sekou Toure"
    },
    {
        " rule, the CMRN reorganized the judicial system, decentralized the administration, promoted private enterprise, and encouraged foreign ": null
    },
    {
        "investment": "Investment"
    },
    {
        ".     In 1990, Guineans approved by referendum a new constitution that inaugurated the Third Republic, and established a ": null
    },
    {
        "Supreme Court": "Supreme Court"
    },
    {
        ". In 1991, the CMRN was replaced by a mixed military and civilian body, the Transitional Council for National Recovery , with ": null
    },
    {
        "Conté": "Lansana Conté"
    },
    {
        " as president and a mandate to manage a five-year transition to full civilian rule. The CTRN drafted laws to create republican institutions and to provide for independent ": null
    },
    {
        "political parties": "Political Parties"
    },
    {
        ", national elections, and ": null
    },
    {
        "freedom of the press": "Freedom Of The Press"
    },
    {
        ". Political party activity was legalized in 1992, when more than 40 political parties were officially recognized for the first time.     In December 1993, ": null
    },
    {
        "Conté": "Lansana Conté"
    },
    {
        " was elected to a 5-year term as president in the countrys first multi-party elections, which were marred by irregularities and lack of ": null
    },
    {
        "transparency": "Transparency"
    },
    {
        " on the part of the government. In 1995, Contés ruling PUP party won 76 of 114 seats in elections for the National Assembly amid opposition claims of irregularities and government tampering. In 1996, President Conté reorganized the government, appointing Sidya Touré to the revived post of Prime Minister and charging him with special responsibility for leading the governments economic reform program.   In the early hours of 23 December 2008, ": null
    },
    {
        "Aboubacar Somparé": "Aboubacar Somparé"
    },
    {
        ", the President of the National Assembly, announced on television that Conté had died at 6:45pm local time on 22 December after a long illness , , AFP, 23 December 2008.  without specifying the cause of death. , Associated Press , 23 December 2008.      According to Somparé, Conté hid his physical suffering for years in order to give happiness to Guinea. Conté had left the country for medical treatment on numerous occasions in the years preceding his death, and speculation about his health had long been widespread. Contrary to his usual practice, Conté did not appear on television to mark ": null
    },
    {
        "Tabaski": "Tabaski"
    },
    {
        " earlier in December 2008, and this sparked renewed speculation, as well as concern about the possibility of violence in the event of his death. At around the same time, a newspaper published a photograph suggesting that Conté was in poor physical condition and having difficulty standing up. The editor of that newspaper was arrested and the newspaper was required to print a photograph in which Conté looked healthy.     According to the constitution, the President of the National Assembly was to assume the Presidency of the Republic in the event of a vacancy, and a new presidential election was to be held within 60 days. Somparé requested that the President of the Supreme Court, ": null
    },
    {
        "Lamine Sidimé": "Lamine Sidimé"
    },
    {
        ", declare a vacancy in the Presidency and apply the constitution. , Guinéenews, 22 December 2008 .  Prime Minister Souaré and Diarra Camara, the head of the army, stood alongside Somparé during his announcement. , allAfrica.com, 23 December 2008. The government declared 40 days of national mourning , Guineenews, 22 December 2008 .  and Camara called on soldiers to remain calm. , Guineenews, 22 December 2008 .        Six hours after Somparé announced Contés death, a statement was read on television announcing ": null
    },
    {
        "a military coup détat": "2008 Guinean Coup Détat"
    },
    {
        ". , Associated Press, 23 December 2008.  This statement, read by Captain ": null
    },
    {
        "Moussa Dadis Camara": "Moussa Dadis Camara"
    },
    {
        " , AFP , 23 December 2008. on behalf of a group called National Council for Democracy, said that the government and the institutions of the Republic have been dissolved . The statement also announced the suspension of the constitution as well as political and union activity . In its place, the military said it had established a consultative council composed of civilian and military leaders.    On 27 September 2009, the day before planned demonstrations in the capital city ": null
    },
    {
        "Conakry": "Conakry"
    },
    {
        ", the government declared demonstrations illegal. Thousands of protestors defied the ban, assembling in a soccer stadium. 157 were left dead after the level of violence used by security forces escalated. , ": null
    },
    {
        "CBC News": "Cbc News"
    },
    {
        " Captain Moussa Camara told Radio France International on 28 September the shootings by members of his presidential guard were beyond his control. Those people who committed those atrocities were uncontrollable elements in the military, he said. Even I, as head of state in this very tense situation, cannot claim to be able to control those elements in the military.     On 3 December 2009 Captain Moussa Dadis Camara suffered a head wound in an attempted assassination in Conakry led by his aide-de-camp, Lieutenant Aboubacar Sidiki Diakité, who is known as Toumba. Captain Camara underwent surgery at a hospital in Morocco. Reports say Toumbas men opened fire on Captain Camara late Thursday at an army camp in the city of Conakry.         In a document released in 2010, an unknown source spoke with a U.S. diplomat and described the ethnicization of Guinea and the risk of conflict and violence like in ": null
    },
    {
        "Rwanda": "Rwanda"
    },
    {
        ". He stated that Dadis Camara has recruited mercenaries from South Africa and Israel and assembled them, along with some of his own men, in Forecariah, in the ethnically Sussu region in the west of the country, while Dadis was from the Forest region to the east. His militia numbered 2,000-3,000 and was   armed with weapons from Ukraine. The risk of conflict and destabilization threatened the entire region, he said.  .nyud.net/cable/2009/12/09RABAT988.html     After a meeting in ": null
    },
    {
        "Ouagadougou": "Ouagadougou"
    },
    {
        " on 13 and 14 January, Camara, Konaté and ": null
    },
    {
        "Blaise Compaoré": "Blaise Compaoré"
    },
    {
        ", President of Burkina Faso, produced a formal statement of twelve principles promising a return of Guinea to civilian rule within six months. It was agreed that the military would not contest the forthcoming elections.  On 21 January 2010 the military junta appointed ": null
    },
    {
        "Jean-Marie Doré": "Jean-Marie Doré"
    },
    {
        " as Prime Minister of a six-month transition government, leading up to elections. , Reuters, 21 January 2010.         The ": null
    },
    {
        "presidential election": "2010 Guinean Presidential Election"
    },
    {
        " was set to take place on 27 June and 18 July 2010, . Afrol.com. Retrieved on 28 June 2011.  . News.xinhuanet.com . Retrieved on 28 June 2011. it was held as being the first free and fair election since independence in 1958.     The first round took place normally on 27 June 2010 with ex Prime Minister ": null
    },
    {
        "Cellou Dalein Diallo": "Cellou Dalein Diallo"
    },
    {
        " and his rival ": null
    },
    {
        "Alpha Condé": "Alpha Condé"
    },
    {
        " emerging as the two runners-up for the second round.    However, due to allegations of electoral fraud, the second round of the election was postponed until 19 September 2010.  A delay until 10 October was announced by the electoral commission , subject to approval by ": null
    },
    {
        "Sékouba Konaté": "Sékouba Konaté"
    },
    {
        ". . Reuters.com. Retrieved on 28 June 2011. Yet another delay until 24 October was announced in early October. . English.aljazeera.net . Retrieved on 28 June 2011. Elections were finally held on 7 November. Voter turnout was high, and the elections went relatively smoothly. . Bbc.co.uk . Retrieved on 28 June 2011.     16 November 2010, ": null
    },
    {
        "Alpha Condé": "Alpha Condé"
    },
    {
        ", the leader of the opposition party ": null
    },
    {
        "Rally of the Guinean People": "Rally Of The Guinean People"
    },
    {
        " , was officially declared the winner of a 7 November run-off in Guineas presidential election. He had promised to reform the security sector and review mining contracts if elected. . IOL.co.za . Retrieved on 28 June 2011.         In February 2013, the Guinean opposition party announced it would be stepping down from the electoral process due to a lack of transparency over the company used in registering voters. Calling on citizens to protest nationwide, the ensuing week saw multiple clashes between police and protesters, resulting in at least nine deaths, some of those due to live fire from security forces.       The protests were also a result of the previous months political wrangling between Condés administration and the opposition; minor protests were quelled on the street, and opposition supporters were arbitrarily arrested, prompting the resignation of two Guinean opposition ministers in September 2012.  This month also saw the opposition parties announce their stepping down from the National Transitional Council, which is effectively an interim parliament, and that they would also boycott the national electoral commission. The president of the national electoral commission, Louceny Camara, also stepped down due to pressure from the opposition over his relationship with President Condé; Camara was rumoured to be his ally and a key figure in the presidents rumoured attempts to pre-rig the legislative polls.     The week after the protest saw another minor clash between protesters and security forces after a march to mark the funerals of the deceased was dispersed by tear gas and gunfire.     On 7 March 2013, the government postponed the 12 May election date indefinitely until the political tension eased and preparations for free and fair elections could be established.      Despite the election postponement, President Conde ordered a crackdown on those responsible for the violence, and on 10 March, a Guinean court ordered opposition leaders to appear at a hearing scheduled for 14 March, in which they would be questioned for their role in organising the protests. Former Prime Minister ": null
    },
    {
        "Sidya Toure": "Sidya Toure"
    },
    {
        " branded the summons as an illegal procedure for what was an authorised march and a manipulation of justice for political ends .        President ": null
    },
    {
        "Alpha Conde": "Alpha Conde"
    },
    {
        " derives support from Guineas second-largest ethnic group, the ": null
    },
    {
        "Malinke": "Malinke"
    },
    {
        ".  Guineas opposition is backed by some of the ": null
    },
    {
        "Fula": "Fula People"
    },
    {
        " ethnic group , who account for around 40 percent of the population.       The ": null
    },
    {
        "president of Guinea": "President Of Guinea"
    },
    {
        " is normally elected by popular vote for a five-year term; candidate must receive a majority of the votes cast to be elected president. The president governs ": null
    },
    {
        "Guinea": "Guinea"
    },
    {
        ", assisted by a ": null
    },
    {
        "council": "Privy Council"
    },
    {
        " of 25 civilian ": null
    },
    {
        "ministers": "Minister"
    },
    {
        " appointed by him. The government administers the country through eight regions, 33 ": null
    },
    {
        "prefectures": "Prefecture"
    },
    {
        ", over 100 ": null
    },
    {
        "subprefectures": "Subprefecture"
    },
    {
        ", and many districts . District-level leaders are elected; the president appoints officials to all other levels of the highly centralized administration.     Since the 2010 Presidential Elections, the head of state has been ": null
    },
    {
        "Alpha Condé": "Alpha Condé"
    },
    {
        ".       The ": null
    },
    {
        "National Assembly of Guinea": "National Assembly Of Guinea"
    },
    {
        ", the countrys legislative body, has not met since 2008 when it was dissolved after the military coup in December. ": null
    },
    {
        "Elections": "2013 Guinean Legislative Election"
    },
    {
        " have been postponed many times since 2007. In April 2012, President Condé postponed the elections indefinitely, citing the need to ensure that they were transparent and democratic .      The ": null
    },
    {
        "legislative elections": "2013 Guinean Legislative Election"
    },
    {
        " took place on 28 September 2013 and President Alpha Condes party, the Rally of the Guinean People, won with 53 seats.             Guinea is divided into seven ": null
    },
    {
        "administrative regions": "Regions Of Guinea"
    },
    {
        " and subdivided into thirty-three ": null
    },
    {
        "prefectures": "Prefectures Of Guinea"
    },
    {
        ". The national capital, Conakry, ranks as a special zone. The regions are ": null
    },
    {
        "Boké": "Boké Region"
    },
    {
        ", ": null
    },
    {
        "Faranah": "Faranah Region"
    },
    {
        ", ": null
    },
    {
        "Kankan": "Kankan Region"
    },
    {
        ", ": null
    },
    {
        "Kindia": "Kindia Region"
    },
    {
        ", ": null
    },
    {
        "Labé": "Labé Region"
    },
    {
        ", ": null
    },
    {
        "Mamou": "Mamou Region"
    },
    {
        ", ": null
    },
    {
        "Nzérékoré": "Nzérékoré Region"
    },
    {
        " and ": null
    },
    {
        "Conakry": "Conakry Region"
    },
    {
        ".                   See also ": null
    },
    {
        "2013 Guinean legislative election": "2013 Guinean Legislative Election"
    },
    {
        "       Guineas membership in the ": null
    },
    {
        "African Union": "African Union"
    },
    {
        " was suspended after the coup.       ": null
    },
    {
        "Agency for the French-Speaking Community": "Agency For The French-Speaking Community"
    },
    {
        ",   ": null
    },
    {
        "African, Caribbean, and Pacific Group of States": "African, Caribbean, And Pacific Group Of States"
    },
    {
        ",   ": null
    },
    {
        "African Development Bank": "African Development Bank"
    },
    {
        ",   ": null
    },
    {
        "Customs Cooperation Council": "Customs Cooperation Council"
    },
    {
        ",   ": null
    },
    {
        "Economic Commission for Africa": "Economic Commission For Africa"
    },
    {
        ",   ": null
    },
    {
        "Economic Community of West African States": "Economic Community Of West African States"
    },
    {
        ",   ": null
    },
    {
        "Food and Agriculture Organization": "Food And Agriculture Organization"
    },
    {
        ",   ": null
    },
    {
        "Group of 77": "Group Of 77"
    },
    {
        ",   ": null
    },
    {
        "International Bank for Reconstruction and Development": "International Bank For Reconstruction And Development"
    },
    {
        ",   ": null
    },
    {
        "International Civil Aviation Organization": "International Civil Aviation Organization"
    },
    {
        ",   ": null
    },
    {
        "International Criminal Court": "International Criminal Court"
    },
    {
        ",   ": null
    },
    {
        "International Confederation of Free Trade Unions": "International Confederation Of Free Trade Unions"
    },
    {
        ",   ": null
    },
    {
        "International Red Cross and Red Crescent Movement": "International Red Cross And Red Crescent Movement"
    },
    {
        ",   ": null
    },
    {
        "International Development Association": "International Development Association"
    },
    {
        ",   ": null
    },
    {
        "Islamic Development Bank": "Islamic Development Bank"
    },
    {
        ",   ": null
    },
    {
        "International Fund for Agricultural Development": "International Fund For Agricultural Development"
    },
    {
        ",   ": null
    },
    {
        "International Finance Corporation": "International Finance Corporation"
    },
    {
        ",   ": null
    },
    {
        "International Federation of Red Cross and Red Crescent Societies": "International Federation Of Red Cross And Red Crescent Societies"
    },
    {
        ",   ": null
    },
    {
        "International Labour Organization": "International Labour Organization"
    },
    {
        ",   ": null
    },
    {
        "International Monetary Fund": "International Monetary Fund"
    },
    {
        ",   ": null
    },
    {
        "International Maritime Organization": "International Maritime Organization"
    },
    {
        ",   ": null
    },
    {
        "International Telecommunications Satellite Organization": "International Telecommunications Satellite Organization"
    },
    {
        ",    ": null
    },
    {
        "International Criminal Police Organization": "International Criminal Police Organization"
    },
    {
        ",   ": null
    },
    {
        "International Olympic Committee": "International Olympic Committee"
    },
    {
        ",   ": null
    },
    {
        "International Organization for Migration": "International Organization For Migration"
    },
    {
        "  ,   ": null
    },
    {
        "International Organization for Standardization": "International Organization For Standardization"
    },
    {
        " ,   ": null
    },
    {
        "International Telecommunication Union": "International Telecommunication Union"
    },
    {
        ",   ": null
    },
    {
        "United Nations Mission for the Referendum in Western Sahara": "United Nations Mission For The Referendum In Western Sahara"
    },
    {
        ",   ": null
    },
    {
        "Non-Aligned Movement": "Non-Aligned Movement"
    },
    {
        ",   ": null
    },
    {
        "Organization of African Unity": "Organization Of African Unity"
    },
    {
        ",   ": null
    },
    {
        "Organisation of Islamic Cooperation": "Organisation Of Islamic Cooperation"
    },
    {
        ",   ": null
    },
    {
        "Organisation for the Prohibition of Chemical Weapons": "Organisation For The Prohibition Of Chemical Weapons"
    },
    {
        ",   United Nations,   ": null
    },
    {
        "United Nations Conference on Trade and Development": "United Nations Conference On Trade And Development"
    },
    {
        ",   ": null
    },
    {
        "United Nations Educational, Scientific, and Cultural Organization": "United Nations Educational, Scientific, And Cultural Organization"
    },
    {
        ",   ": null
    },
    {
        "United Nations Industrial Development Organization": "United Nations Industrial Development Organization"
    },
    {
        ",   ": null
    },
    {
        "Universal Postal Union": "Universal Postal Union"
    },
    {
        ",   ": null
    },
    {
        "World Confederation of Labour": "World Confederation Of Labour"
    },
    {
        ",   ": null
    },
    {
        "World Federation of Trade Unions": "World Federation Of Trade Unions"
    },
    {
        ",   ": null
    },
    {
        "World Health Organization": "World Health Organization"
    },
    {
        ",   ": null
    },
    {
        "World Intellectual Property Organization": "World Intellectual Property Organization"
    },
    {
        ",   ": null
    },
    {
        "World Meteorological Organization": "World Meteorological Organization"
    },
    {
        ",   ": null
    },
    {
        "World Tourism Organization": "World Tourism Organization"
    },
    {
        ",   ": null
    },
    {
        "World Trade Organization": "World Trade Organization"
    },
    {
        "   ": null
    }
]