[
    {
        "Politics of Kiribati takes place in a framework of a ": null
    },
    {
        "parliamentary": "Parliamentary System"
    },
    {
        " representative democratic": "Representative Democracy"
    },
    {
        " republic": "Republic"
    },
    {
        ", whereby the ": null
    },
    {
        "President of Kiribati": "President Of Kiribati"
    },
    {
        " is the ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        ", and of a ": null
    },
    {
        "multi-party system": "Multi-Party System"
    },
    {
        ". ": null
    },
    {
        "Executive power": "Executive Power"
    },
    {
        " is exercised by the government. ": null
    },
    {
        "Legislative power": "Legislative Power"
    },
    {
        " is vested in both the ": null
    },
    {
        "government": "Forms Of Government"
    },
    {
        " and the ": null
    },
    {
        "House of Assembly": "House Of Assembly Of Kiribati"
    },
    {
        ". The ": null
    },
    {
        "Judiciary": "Judiciary"
    },
    {
        " is independent of the executive and the legislature.   The constitution promulgated at independence on 12 July 1979, establishes the ": null
    },
    {
        "Republic of Kiribati": "Kiribati"
    },
    {
        " as a sovereign democratic republic and guarantees the fundamental rights of its citizens.          After each general election, the new Maneaba ni Maungatabu nominates three or four of its own members to stand as candidates for President . The voting public then elects the Beretitenti from among these candidates. The Beretitenti appoints a Kauoman-ni-Beretitenti and up to ten other Cabinet Ministers from among the members of the Maneaba.          ": null
    },
    {
        "The Cabinet": "Cabinet Of Kiribati"
    },
    {
        " is the top decision-making body in Kiribati, through which all functions of the government get their authority. Parliament can undo Cabinet decisions through a ": null
    },
    {
        "vote of no confidence": "Motion Of No Confidence"
    },
    {
        ", triggering a new election.     The current Cabinet consists of the following Ministers:          In ": null
    },
    {
        "Kiribati": "Kiribati"
    },
    {
        ", the Attorney General is defined by section 42 of the Constitution as the principal legal adviser to the Government.  The Constitution specifies: No person shall be qualified to hold or to act in the office of Attorney-General unless he is qualified to practise in Kiribati as an advocate in the High Court.     The Attorney General of Kiribati is also a member of Cabinet. According to a 2005 source, the Attorney General is designated by the Republic of Kiribati as the Central Authority who shall have the responsibility and power to receive requests for mutual legal assistance.                The unicameral ": null
    },
    {
        "House of Assembly": "House Of Assembly"
    },
    {
        "  has 46 members: 44 elected for a four-year term in single-seat and multi-seat ": null
    },
    {
        "constituencies": "Constituency"
    },
    {
        "; one appointed member from the ": null
    },
    {
        "Banaban community": "Banaba Island"
    },
    {
        " on ": null
    },
    {
        "Rabi Island": "Rabi Island"
    },
    {
        " in ": null
    },
    {
        "Fiji": "Fiji"
    },
    {
        ", and the Attorney-General in an ex officio capacity. The elected members of the Maneaba ni Maungatabu serve four-year terms. The Speaker of the Maneaba ni Maungatabu is elected by the members of the Maneaba from outside of its membership.   All citizens are eligible to vote at the age of 18.       The judicial system consists of magistrates courts, the High Court and the Court of Appeal. Beretitenti, acting in accordance with the advice of the Public Service Commission, makes all judicial appointments.       The Peoples Lawyer of Kiribati represents disadvantaged residents and those who are unable to access legal representation. Accordingly, the office represents clients in Land, Civil and Criminal Matters and act for them in the Magistrates and High Court as well as the Court of Appeal. The position had long been filled by expatriate lawyers who were volunteering from either Australia or New Zealand with the role...funded by the Australia Government through Australian Volunteers International.  In 2015, the role of The Peoples Lawyer changed in that it was now filled by a Kiribati citizen: Raweita Beniata .              ": null
    },
    {
        "Political parties": "List Of Political Parties In Kiribati"
    },
    {
        " have existed since 1985 but are more similar to informal coalitions in behavior. They do not have official platforms or party structures. Most candidates formally present themselves as independents. The website of the House of Assembly explains that in this way:  , House of Assembly of Kiribati   : There are four political parties in Kiribati, Boutokaan Te Koaua , Maurin Kiribati Party , Maneaban Te Mauri Party and Kiribati Tabomoa Party . The parties are loose groupings rather than disciplined blocks, with little or no structure. Members may change allegiance on a number of occasions during their tenure. It is also common for members to vote according to the special interests of their electorate on certain issues.      ": null
    },
    {
        "Kiribati Tabomoa Party": "Kiribati Tabomoa Party"
    },
    {
        " and ": null
    },
    {
        "Christian Democratic Party": "Christian Democratic Party"
    },
    {
        " merged into ": null
    },
    {
        "Maneaban Te Mauri": "Maneaban Te Mauri"
    },
    {
        "  in 2003, which later merged with ": null
    },
    {
        "Kiribati Independent Party": "Kiribati Independent Party"
    },
    {
        " into ": null
    },
    {
        "Karikirakean Te I-Kiribati": "Karikirakean Te I-Kiribati"
    },
    {
        "  in 2010, which later merged with ": null
    },
    {
        "Maurin Kiribati Party": "Maurin Kiribati Party"
    },
    {
        " to form ": null
    },
    {
        "Tobwaan Kiribati Party": "Tobwaan Kiribati Party"
    },
    {
        " , the only one facing  Boutokaan Te Koaua  .     A major source of conflict has been the protracted bid by the residents of ": null
    },
    {
        "Banaba Island": "Banaba Island"
    },
    {
        " to secede and have their island placed under the protection of Fiji. The governments attempts to placate the Banabans include several special provisions in the constitution, such as the designation of a Banaban seat in the legislature and the return of land previously acquired by the government for phosphate mining.            ": null
    },
    {
        "election": "2016 Kiribati Presidential Election"
    },
    {
        "     election": "Kiribati Parliamentary Election, 2015-16"
    }
]