[
    {
        "            The politics of Turkey takes place in a framework of a ": null
    },
    {
        "presidential": "Parliamentary System"
    },
    {
        " republic": "Democratic Republic"
    },
    {
        ", whereby the ": null
    },
    {
        "President of Turkey": "Prime Minister Of Turkey"
    },
    {
        " is the ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        " and the ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " who holds executive powers to issue executive decrees, appoint judges and heads of state institutions.     Turkeys political system is based on a separation of powers. Executive power is exercised by the ": null
    },
    {
        "Council of Ministers": "Cabinet Of Turkey"
    },
    {
        ". Legislative power is vested in the ": null
    },
    {
        "Grand National Assembly of Turkey": "Grand National Assembly Of Turkey"
    },
    {
        ". The judiciary is independent of the executive and the legislature. Its current ": null
    },
    {
        "constitution": "Constitution Of Turkey"
    },
    {
        " was adopted on 7 November 1982 after the Turkish constitutional referendum.   A major reform was passed in Parliament in 21 January 2017 and approved by referendum the following April reinforcing the role of the president.            The function of ": null
    },
    {
        "head of state": "Head Of State"
    },
    {
        " and ": null
    },
    {
        "head of government": "Head Of Government"
    },
    {
        " is performed by the president . A president is elected every five years on the principle of ": null
    },
    {
        "universal suffrage": "Universal Suffrage"
    },
    {
        " according to the current constitution. The president does not have to be a member of parliament, but he/she must be over 40 years old and hold a ": null
    },
    {
        "bachelors degree": "Bachelors Degree"
    },
    {
        ". The current ": null
    },
    {
        "president": "List Of Presidents Of Turkey"
    },
    {
        " Recep Tayyip Erdoğan": "Recep Tayyip Erdoğan"
    },
    {
        " was ": null
    },
    {
        "directly elected": "Directly Elected"
    },
    {
        " in the ": null
    },
    {
        "2018 presidential election": "2018 Turkish Presidential Election"
    },
    {
        ".   Executive power rests with the president and the ": null
    },
    {
        "Council of Ministers": "Council Of Ministers Of Turkey"
    },
    {
        ". Most ministers are members of Parliament. . The President of Turkey is the leader of the cabinet. The current holder of the position is ": null
    },
    {
        "Recep Tayyip Erdoğan": "Recep Tayyip Erdoğan"
    },
    {
        " of the ": null
    },
    {
        "Justice and Development Party": "Justice And Development Party"
    },
    {
        " .       Legislative power is invested in the 600-seat ": null
    },
    {
        "Grand National Assembly of Turkey": "Grand National Assembly Of Turkey"
    },
    {
        " , representing 81 provinces. The members are elected for a four-year term by mitigated ": null
    },
    {
        "proportional representation": "Proportional Representation"
    },
    {
        " with an ": null
    },
    {
        "election threshold": "Election Threshold"
    },
    {
        " of 10%. To be represented in Parliament, a party must win at least 10% of the national vote in a national parliamentary election. Independent candidates may run, and to be elected, they must only win enough to get one seat. The threshold is set to be reduced.        The political system of Turkey is highly centralized. However, as a member state of the ": null
    },
    {
        "Council of Europe": "Council Of Europe"
    },
    {
        ", Turkey is under an obligation to implement the ": null
    },
    {
        "European Charter of Local Self-Government": "European Charter Of Local Self-Government"
    },
    {
        ". In its 2011 report, the Monitoring Committee of the Council of Europe found fundamental deficits in implementation, in particular administrative tutelage and prohibition of the use of languages other than Turkish in the provision of public services.           The freedom and independence of the judicial system is protected within the constitution. There is no organization, person, or institution which can interfere in the running of the courts, and the executive and legislative structures must obey the courts decisions. The courts, which are independent in discharging their duties, must explain each ruling on the basis of the provisions of the Constitution, the laws, jurisprudence, and their personal convictions.     The Judicial system is highly structured. Turkish courts have no jury system; judges render decisions after establishing the facts in each case based on evidence presented by lawyers and prosecutors. For minor civil complaints and offenses, justices of the peace take the case. This court has a single judge. It has jurisdiction over misdemeanors and petty crimes, with penalties ranging from small fines to brief prison sentences. Three-judge courts of first instance have jurisdiction over major civil suits and serious crimes. Any conviction in a criminal case can be taken to a court of Appeals for judicial review.     Most courts are open to the public. When a case is closed to the public, the court has to declare the reason. Judge and prosecution structures are secured by the constitution. Except with their own consent, no judge or prosecutor can be dismissed, have his/her powers restricted, or be forced to retire. However, the retirement age restrictions do apply. The child courts have their own structure.     A judge can be audited for misconduct only with the Ministry of Justices permission, in which case a special task force of justice experts and senior judges is formed.     The ": null
    },
    {
        "Supreme Board of Judges and Prosecutors": "Supreme Board Of Judges And Prosecutors"
    },
    {
        " is the principal body charged with responsibility for ensuring judicial integrity, and determines professional judges acceptance and court assignments. Minister of justice, ": null
    },
    {
        "Sadullah Ergin": "Sadullah Ergin"
    },
    {
        " is the natural head of the Council according to the current constitution.     Turkey adopted a new national Judicial Networking System . The court decisions and documents will be accessible via the Internet.     Turkey accepts the ": null
    },
    {
        "European Court of Human Rights": "European Court Of Human Rights"
    },
    {
        " decisions as a higher court decision, provided they do not concern the occupation of northern Cyprus. Turkey also accepts as legally binding any decisions on international agreements.     There are several supreme courts with different subjects:     ": null
    },
    {
        "Yargıtay": "Yargıtay"
    },
    {
        " acts as the supreme court of judiciary tribunals . ": null
    },
    {
        "Danıştay": "Danıştay"
    },
    {
        " is the highest of administrative courts. ": null
    },
    {
        "Anayasa Mahkemesi": "Anayasa Mahkemesi"
    },
    {
        " examines the constitutionality of laws, decrees having the force of law , changes of parliamentary ": null
    },
    {
        "by-laws": "By-Law"
    },
    {
        " and several other acts of the parliament. ": null
    },
    {
        "Sayıştay": "Sayıştay"
    },
    {
        " is the court which examines the incomes and expenses of the administrative bodies and which acts in the name of parliament. The Military Court of Cassation and The Military High Court of Administration are the highest bodies to which appeals of decisions of military courts are to be made.       The Turkish Constitution is cumulatively built on the following principles:   ": null
    },
    {
        "Kemalism": "Kemalism"
    },
    {
        " Secularism": "Secularism"
    },
    {
        " Modernization": "Modernization"
    },
    {
        "     Most mainstream political parties are alternatively built either on the following principles:   ": null
    },
    {
        "Nationalism": "Nationalism"
    },
    {
        " Islamism": "Islamism"
    },
    {
        " Kemalism": "Kemalism"
    },
    {
        " Decentralization": "Decentralization"
    },
    {
        "     Other political ideas have also influenced Turkish politics and modern history. Of particular importance are:   ": null
    },
    {
        "Neoliberalism": "Neoliberalism"
    },
    {
        " Pan-Turkism": "Pan-Turkism"
    },
    {
        " Socialism": "Socialism"
    },
    {
        " Communism": "Communism"
    },
    {
        "     These principles are the continuum around which various – and often rapidly changing – political parties and groups have campaigned . On a superficial level, the importance which state officials attach to these principles and their posts can be seen in their response to breaches of ": null
    },
    {
        "protocol": "Protocol"
    },
    {
        " in official ceremonies.           Since 1950, parliamentary politics has been dominated by ": null
    },
    {
        "conservative": "Conservatism"
    },
    {
        " parties. Even the ruling ": null
    },
    {
        "AKP": "Justice And Development Party"
    },
    {
        ", although its core cadres come from the ": null
    },
    {
        "Islamist": "Islamist"
    },
    {
        " current, tends to identify itself with the tradition of the ": null
    },
    {
        "Democratic Party": "Democrat Party"
    },
    {
        " . The ": null
    },
    {
        "leftist": "Leftist"
    },
    {
        " parties, the most notable of which is the ": null
    },
    {
        "Republican Peoples Party": "Republican Peoples Party"
    },
    {
        " , with a stable ": null
    },
    {
        "electorate": "Constituency"
    },
    {
        ", draw much of their support from big cities, coastal regions, professional middle-class, and minority groups such as ": null
    },
    {
        "Alevis": "Alevi"
    },
    {
        ".          Since ": null
    },
    {
        "Mustafa Kemal Atatürk": "Mustafa Kemal Atatürk"
    },
    {
        " founded the modern secular Republic of Turkey in 1923, the Turkish military has perceived itself as the guardian of ": null
    },
    {
        "Atatürkçülük": "Atatürkçülük"
    },
    {
        ", the official state ideology. The TAF still maintains an important degree of influence over Turkish politics and the decision making process regarding issues related to Turkish national security, albeit decreased in the past decades, via the ": null
    },
    {
        "National Security Council": "National Security Council"
    },
    {
        ".     The military has had a record of intervening in politics. Indeed, it assumed power for several periods in the latter half of the 20th century. It executed ": null
    },
    {
        "coups détat": "Coup Détat"
    },
    {
        " in 1960": "1960 Turkish Coup Détat"
    },
    {
        ", ": null
    },
    {
        "in 1971": "1971 Turkish Coup Détat"
    },
    {
        ", and ": null
    },
    {
        "in 1980": "1980 Turkish Coup Détat"
    },
    {
        ". Most recently, it maneuvered the removal of an Islamic-oriented prime minister, ": null
    },
    {
        "Necmettin Erbakan": "Necmettin Erbakan"
    },
    {
        ", in 1997.      On 27 April 2007, in advance of 4 November 2007 presidential election, and in reaction to the politics of ": null
    },
    {
        "Abdullah Gül": "Abdullah Gül"
    },
    {
        ", who has a past record of involvement in ": null
    },
    {
        "Islamist": "Islamist"
    },
    {
        " political movements and banned Islamist parties such as the ": null
    },
    {
        "Welfare Party": "Refah Partisi"
    },
    {
        ", the army issued a statement of its interests. It said that the army is a party to arguments regarding ": null
    },
    {
        "secularism": "Secularism"
    },
    {
        "; that Islamism ran counter to the secular nature of the Turkish Republic, and to the legacy of ": null
    },
    {
        "Mustafa Kemal Atatürk": "Mustafa Kemal Atatürk"
    },
    {
        ". The Armys statement ended with a clear warning that the Turkish Armed Forces stood ready to intervene if the secular nature of the Turkish Constitution is compromised, stating that the ": null
    },
    {
        "Turkish Armed Forces": "Turkish Armed Forces"
    },
    {
        " maintain their sound determination to carry out their duties stemming from laws to protect the unchangeable characteristics of the Republic of Turkey. Their loyalty to this determination is absolute.      Contrary to outsider expectations, the Turkish populace is not uniformly averse to coups; many welcome the ejection of governments they perceive as unconstitutional.    Members of the military must also comply with the traditions of secularism, according to the US Commission on International Religious Freedom report in 2008, members who performed prayers or had wives who wore the headscarf, have been charged with “lack of discipline”.   United States Commission on International Religious Freedom. 2008. Retrieved on 2 May 2009.     Paradoxically, the military has both been an important force in Turkeys continuous Westernization but at the same time also represents an obstacle for Turkeys desire to join the EU. At the same time, the military enjoys a high degree of popular legitimacy, with continuous opinion polls suggesting that the military is the state institution that the Turkish people trust the most. ": null
    }
]