[
    {
        "     The Pongo de Manseriche is a gorge in northwest ": null
    },
    {
        "Peru": "Peru"
    },
    {
        ". The ": null
    },
    {
        "Marañón River": "Marañón River"
    },
    {
        " runs through this gorge  before it reaches the ": null
    },
    {
        "Amazon Basin": "Amazon Basin"
    },
    {
        ".     The Pongo de Manseriche is 3 miles long, located at 4° 27′ 30″ south latitude and 77° 34′ 51″ west longitude, just below the mouth of the ": null
    },
    {
        "Río Santiago": "Río Santiago"
    },
    {
        ", and between it and the old missionary station of Borja.     According to ": null
    },
    {
        "Captain Carvajal": "Melitón Carvajal"
    },
    {
        ", who descended the Pongo in the little steamer Napo, in 1868, it is a vast rent in the Andes about  deep, narrowing in places to a width of only , the precipices seeming to close in at the top. Through this dark canyon the Marañón leaps along, at times, at the rate of .     The Pongo de Manseriche was first discovered by the  Adelantado  ": null
    },
    {
        "Joan de Salinas": "Joan De Salinas"
    },
    {
        ". He fitted out an expedition at ": null
    },
    {
        "Loja": "Loja, Ecuador"
    },
    {
        " in Ecuador, descended the Rio Santiago to the Marañón, passed through the Pongo in 1557 and invaded the country of the ": null
    },
    {
        "Mayna": "Mayna"
    },
    {
        " Indians. Later, the missionaries of ": null
    },
    {
        "Cajamarca": "Cajamarca"
    },
    {
        " and ": null
    },
    {
        "Cusco": "Cusco"
    },
    {
        " established many missions in the ": null
    },
    {
        "Maynas": "Maynas Province"
    },
    {
        ", and made extensive use of the Pongo de Manseriche as an avenue of communication with their several convents on the ": null
    },
    {
        "Andean": "Andes"
    },
    {
        " plateau. According to their accounts, the huge rent in the Andes, the Pongo, is about five or six miles long, and in places not more than 80 feet wide, and is a frightful series of torrents and whirlpools interspersed with rocks. There is an ancient tradition of the indigenous people of the vicinity that one of their gods descended the Marañón and another ascended the Amazon to communicate with him. They opened the pass called the Pongo de Manseriche.                  ": null
    }
]