[
    {
        "         Pope Urban VI , born Bartolomeo Prignano , was head of the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        " and ruler of the ": null
    },
    {
        "Papal States": "Papal States"
    },
    {
        " from 8 April 1378 to his death in 1389. He was the most recent pope to be elected from outside the ": null
    },
    {
        "College of Cardinals": "College Of Cardinals"
    },
    {
        ". His reign, which began shortly after the end of the ": null
    },
    {
        "Avignon Papacy": "Avignon Papacy"
    },
    {
        ", was marked by immense conflict between rival factions as part of the ": null
    },
    {
        "Western Schism": "Western Schism"
    },
    {
        ".       Born in ": null
    },
    {
        "Itri": "Itri"
    },
    {
        ", Prignano was a devout ": null
    },
    {
        "monk": "Monk"
    },
    {
        " and learned ": null
    },
    {
        "casuist": "Casuist"
    },
    {
        ", trained at ": null
    },
    {
        "Avignon": "Avignon"
    },
    {
        ". On 21 March 1364 he was consecrated ": null
    },
    {
        "Archbishop of Acerenza": "Archbishop Of Acerenza"
    },
    {
        " in the ": null
    },
    {
        "Kingdom of Naples": "Kingdom Of Naples"
    },
    {
        ". He became ": null
    },
    {
        "Archbishop of Bari": "Archbishop Of Bari"
    },
    {
        " in 1377.  Vol. 15. New York: Robert Appleton Company, 1912. 23 December 2018     Prignano had developed a reputation for simplicity and frugality and a head for business when acting Vice-Chancellor. He also demonstrated a penchant for learning, and, according to Cristoforo di Piacenza, In a letter to his master, ": null
    },
    {
        "Lodovico Gonzaga": "House Of Gonzaga"
    },
    {
        " of Mantua; . he was without famiglia in an age of ": null
    },
    {
        "nepotism": "Nepotism"
    },
    {
        ", although once in the papal chair he elevated ": null
    },
    {
        "four cardinal-nephews": "List Of Cardinal-Nephews"
    },
    {
        " and sought to place one of them in control of Naples. His great faults undid his virtues: ": null
    },
    {
        "Ludwig von Pastor": "Ludwig Von Pastor"
    },
    {
        " summed up his character: He lacked Christian gentleness and charity. He was naturally arbitrary and extremely violent and imprudent, and when he came to deal with the burning ecclesiastical question of the day, that of reform, the consequences were disastrous. Pastor 122; on the urgency of reforms, see the contemporary letters of ": null
    },
    {
        "Catherine of Siena": "Catherine Of Siena"
    },
    {
        ".       On the death of ": null
    },
    {
        "Pope Gregory XI": "Pope Gregory Xi"
    },
    {
        " , a ": null
    },
    {
        "Roman": "Rome"
    },
    {
        " mob surrounded the papal ": null
    },
    {
        "conclave": "Papal Conclave, 1378"
    },
    {
        " to demand a Roman pope. The cardinals being under some haste and great pressure to avoid the return of the Papal seat to ": null
    },
    {
        "Avignon": "Avignon"
    },
    {
        ", Prignano was unanimously chosen Pope on 8 April 1378 as acceptable to the disunited Pastor 118. majority of French ": null
    },
    {
        "cardinals": "Catholic Cardinal"
    },
    {
        ", taking the name Urban VI. Not being a ": null
    },
    {
        "Cardinal": "Cardinal"
    },
    {
        ", he was not well known. Immediately following the conclave, most of the cardinals fled Rome before the mob could learn that not a Roman , but a subject of Queen ": null
    },
    {
        "Joan I of Naples": "Joan I Of Naples"
    },
    {
        ", had been chosen.     Though the coronation was carried out in scrupulous detail, leaving no doubt as to the legitimacy of the new pontiff, Pastor 119f. Bernhard Schimmelpfennig , https://books.google.com/books?id05HtCjTpAFsC The Papacy , p. 220. Quote: The next day, after Prignano had called upon them to do so, most of the cardinals came back to the palace and enthroned him. Prignano gave himself the name of Urban VI. The cardinals presented him with the customary petitions, and then took part in worship services being held not for the new pope but in celebration of Holy Week, before the new pontiff was crowned on Easter Sunday, April 18. The cardinals stayed at his court for the next three months, assisting him with liturgical functions. The curia that had remained in Rome likewise seemed to have acknowledged him. the French were not particularly happy with this move and began immediately to conspire against this Pope. Urban VI did himself no favors; whereas the cardinals had expected him pliant, he was considered arrogant and angry by many of his contemporaries. ": null
    },
    {
        "Dietrich of Nieheim": "Dietrich Of Nieheim"
    },
    {
        " reported the opinion of the cardinals that his elevation had turned his head, Pastor 122. and ": null
    },
    {
        "Froissart": "Froissart"
    },
    {
        ", ": null
    },
    {
        "Leonardo Aretino": "Leonardo Aretino"
    },
    {
        ", Tommaso de Acerno Tomasso de Acerno, De creatione Urbani VI opusculum. and St. ": null
    },
    {
        "Antoninus of Florence": "Antoninus Of Florence"
    },
    {
        " recorded similar conclusions. Drawn together by ": null
    },
    {
        "Alfred von Reumont": "Alfred Von Reumont"
    },
    {
        " , Pastor notes.       Immediately following his election, Urban began preaching intemperately to the cardinals , insisting that the business of the Curia should be carried on without gratuities and gifts, forbidding the cardinals to accept annuities from rulers and other lay persons, condemning the luxury of their lives and retinues, and the multiplication of ": null
    },
    {
        "benefices": "Benefice"
    },
    {
        " and bishoprics in their hands. Nor would he remove again to Avignon, thus alienating King ": null
    },
    {
        "Charles V of France": "Charles V Of France"
    },
    {
        ".     The cardinals were mortally offended. Five months after his election, the French cardinals met at ": null
    },
    {
        "Anagni": "Anagni"
    },
    {
        ", inviting Urban, who realized he would be seized, and perhaps slain. In his absence, they issued a manifesto of grievances on 9 August which declared his election invalid since they had been cowed by the mob into electing an Italian. Letters to the missing Italian cardinals followed on 20 August declaring the papal throne vacant . Then at ": null
    },
    {
        "Fondi": "Fondi"
    },
    {
        ", secretly supported by the king of France, Pastor 127;  the French cardinals proceeded to elect ": null
    },
    {
        "Robert of Geneva": "Robert Of Geneva"
    },
    {
        " as Pope on 20 September. Robert, a militant cleric who had succeeded ": null
    },
    {
        "Albornoz": "Gil Álvarez Carrillo De Albornoz"
    },
    {
        " as commander of the papal troops, took the name ": null
    },
    {
        "Clement VII": "Antipope Clement Vii"
    },
    {
        ", beginning the ": null
    },
    {
        "Western Schism": "Western Schism"
    },
    {
        ", which divided Catholic Christendom until 1417.     Urban was declared ": null
    },
    {
        "excommunicated": "Excommunication"
    },
    {
        " by the French ": null
    },
    {
        "antipope": "Antipope"
    },
    {
        " and was called the ": null
    },
    {
        "Antichrist": "Antichrist"
    },
    {
        " , while ": null
    },
    {
        "Catherine of Siena": "Catherine Of Siena"
    },
    {
        ", defending Pope Urban, called the cardinals devils in human form. ": null
    },
    {
        "Coluccio Salutati": "Coluccio Salutati"
    },
    {
        " identified the political nature of the withdrawal: Who does not see, the Chancellor openly addressed the French cardinals, that you seek not the true pope, but opt solely for a Gallic pontiff. Quis non videt vos non verum Papam quærere, sed solum Pontificem natione Gallicum exoptare . Opening rounds of argument were embodied in ": null
    },
    {
        "John of Legnanos": "John Of Legnano"
    },
    {
        " defense of the election, De fletu ecclesiæ, written and incrementally revised between 1378 and 1380, which Urban caused to be distributed in multiple copies, and in the numerous rebuttals that soon appeared.  Notes 38 surviving manuscripts of De fletu in full or in part, and three responses from French cardinals as wekll as Jean LeFevres De planctu bonorum , which played on the title and gave a point-by-point rebuttal. Events overtook the rhetoric, however; 26 new cardinals were created in a single day, and by an arbitrary alienation of the estates and property of the church, funds were raised for open war. The reduced and disordered finances at Rome, most of the records being retained at Avignon and most of the experienced members of the papal camera and treasury having followed Clement, is discussed by  At the end of May 1379 Clement went to Avignon, where he was more than ever at the mercy of the king of France. ": null
    },
    {
        "Louis I, Duke of Anjou": "Louis I, Duke Of Anjou"
    },
    {
        ", was granted a phantom kingdom of Adria to be carved out of papal Emilia and Romagna, if he could unseat the pope at Rome. Pastor 133.       Meanwhile, the ": null
    },
    {
        "War of the Eight Saints": "War Of The Eight Saints"
    },
    {
        ", carried on with spates of unprecedented cruelty to civilians, was draining the resources of Florence, though the city ignored the ": null
    },
    {
        "interdict": "Interdict"
    },
    {
        " placed upon it by Gregory, declared its churches open, and sold ecclesiastical property for 100,000 florins to finance the war. Bologna had submitted to the Church in August 1377, and Florence signed a treaty at ": null
    },
    {
        "Tivoli": "Tivoli, Lazio"
    },
    {
        " on 28 July 1378 at a cost of 200,000 florins indemnity extorted by Urban for the restitution of church properties, receiving in return the papal favor and the lifting of the disregarded interdict.     Urbans erstwhile patroness, Queen Joan I of Naples, deserted him in the late summer of 1378, Salvatore Fodale, La politica napoletana di Urbano VI 1976, treats the convoluted career of Urbans most important political course as invariably rational— in the face of the contemporary accounts — with copious quotes from original sources. in part because her former archbishop had become her ": null
    },
    {
        "feudal suzerain": "Feudalism"
    },
    {
        ". Urban now lost sight of the larger issues and began to commit a series of errors. He turned upon his powerful neighbor Joan, excommunicated her as an obstinate partisan of Clement, and permitted a crusade to be preached against her. Soon her enemy and cousin, the crafty and ambitious Pastor 136. ": null
    },
    {
        "Charles of Durazzo": "Charles Ii Of Hungary"
    },
    {
        ", representing the Sicilian Angevin line, was made sovereign over the ": null
    },
    {
        "Kingdom of Naples": "Kingdom Of Naples"
    },
    {
        " on 1 June 1381, and was crowned by Urban. Joans authority was declared forfeit, and Charles murdered her in 1382. In return for these favours, Charles had to promise to hand over ": null
    },
    {
        "Capua": "Capua"
    },
    {
        ", ": null
    },
    {
        "Caserta": "Caserta"
    },
    {
        ", ": null
    },
    {
        "Aversa": "Aversa"
    },
    {
        ", ": null
    },
    {
        "Nocera": "Nocera Inferiore"
    },
    {
        ", and ": null
    },
    {
        "Amalfi": "Amalfi"
    },
    {
        " to the popes nephew, , ": null
    },
    {
        "Francesco Moricotti Prignano": "Francesco Moricotti Prignano"
    },
    {
        ", of Vico, near Pisa; he was made a cardinal and called the Cardinal of Pisa; appointed governor of Campagna, 21 April 1380; Urbans constant assistant, he died in 1394. a thoroughly worthless and immoral man.   Once ensconced at Naples, Charles found his new kingdom invaded by Louis of Anjou and ": null
    },
    {
        "Amadeus VI of Savoy": "Amadeus Vi Of Savoy"
    },
    {
        "; hard-pressed, he reneged on his promises. In Rome, the ": null
    },
    {
        "Castel SantAngelo": "Castel Santangelo"
    },
    {
        " was besieged and taken, and Urban was forced to flee. In the fall of 1383 he was determined to go to Naples and press Charles in person. There he found himself virtually a prisoner. After a first reconciliation, with the death of Louis , Charles found himself freer to resist Urbans feudal pretensions, and relations took a turn for the worse. Urban was shut up in ": null
    },
    {
        "Nocera": "Nocera Inferiore"
    },
    {
        ", from the walls of which he daily fulminated his ": null
    },
    {
        "anathemas": "Anathema"
    },
    {
        " against his besiegers, with ": null
    },
    {
        "bell, book and candle": "Bell, Book And Candle"
    },
    {
        "; a price was set on his head.          Rescued by two Neapolitan barons who had sided for Louis, ": null
    },
    {
        "Raimondello Orsini": "Raimondo Del Balzo Orsini"
    },
    {
        " and Tommaso di Sanseverino, after six months of siege he succeeded in making his escape to ": null
    },
    {
        "Genoa": "Genoa"
    },
    {
        " with six galleys sent him by ": null
    },
    {
        "doge": "Doge Of Genoa"
    },
    {
        " Antoniotto Adorno": "Antoniotto Adorno"
    },
    {
        ". Several among his cardinals who had been shut up in ": null
    },
    {
        "Nocera": "Nocera Inferiore"
    },
    {
        " with him were determined to make a stand, proposing that the Pope, due to incapacity and obstinacy, be put in the charge of one of the cardinals. Urban had them seized, tortured and put to death, a crime unheard of through the centuries the chronicler ": null
    },
    {
        "Egidio da Viterbo": "Egidio Da Viterbo"
    },
    {
        " remarked. scelus nullo antea sæculo auditum  noted Pastor 137 note.     Urbans support had dwindled to the northern Italian states, Portugal, England, In England ": null
    },
    {
        "Richard II": "Richard Ii Of England"
    },
    {
        " lost no time in confiscating properties of the French cardinals, and subsequently Richard alone responded to Urbans call for a crusade against Clement in France. . and ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        " Charles IV": "Charles Iv, Holy Roman Emperor"
    },
    {
        ", who brought with him the support of most of the princes and abbots of Germany.     On the death of Charles of Naples on 24 February 1386, Urban moved to ": null
    },
    {
        "Lucca": "Lucca"
    },
    {
        " in December of the same year. The Kingdom of Naples was contended between a party favouring his son ": null
    },
    {
        "Ladislaus": "Ladislaus Of Naples"
    },
    {
        " and ": null
    },
    {
        "Louis II of Anjou": "Louis Ii Of Anjou"
    },
    {
        ". Urban contrived to take advantage of the anarchy which had ensued  to seize Naples for his nephew ": null
    },
    {
        "Francesco Moricotti Prignani": "Francesco Moricotti Prignani"
    },
    {
        ". In the meantime he was able to have ": null
    },
    {
        "Viterbo": "Viterbo"
    },
    {
        " and ": null
    },
    {
        "Perugia": "Perugia"
    },
    {
        " return to the Papal control.       In August 1388 Urban moved from Perugia with thousands of troops. To raise funds he had proclaimed a ": null
    },
    {
        "Jubilee": "Jubilee"
    },
    {
        " to be held in 1390. At the time of the proclamation, only 38 years had elapsed since the previous Jubilee, which was celebrated under ": null
    },
    {
        "Clement VI": "Pope Clement Vi"
    },
    {
        ". , The Catholic Encyclopedia Volume 8, 1910. Retrieved on 9 January 2010. During the march, Urban fell from his mule at ": null
    },
    {
        "Narni": "Narni"
    },
    {
        " and had to recover in early October in Rome, where he was able to oust the communal rule of the banderesi and restore the Papal authority. He died soon afterwards, likely of injuries caused by the fall, but not without rumors of poisoning. It is noteworthy that during the reconstruction of ": null
    },
    {
        "Saint Peters Basilica": "Saint Peters Basilica"
    },
    {
        ", Urbans remains were almost dumped out to be destroyed so his sarcophagus could be used to water horses. The sarcophagus was saved only when church historian ": null
    },
    {
        "Giacomo Grimaldi": "Giacomo Grimaldi"
    },
    {
        " arrived and, realizing its importance, ordered it preserved.      Pope Urban VIs successor was ": null
    },
    {
        "Pope Boniface IX": "Pope Boniface Ix"
    }
]