[
    {
        "     The Porsche 928 is a ": null
    },
    {
        "luxury": "Luxury Vehicle"
    },
    {
        " grand tourer": "Grand Tourer"
    },
    {
        " produced by ": null
    },
    {
        "Porsche AG": "Porsche Ag"
    },
    {
        " of Germany from 1978 to 1995. Originally intended to replace the companys iconic ": null
    },
    {
        "911": "Porsche 911"
    },
    {
        ", the 928 combined the power, poise, and handling of a ": null
    },
    {
        "sports car": "Sports Car"
    },
    {
        " with the refinement, comfort, and equipment of a ": null
    },
    {
        "luxury sedan": "Luxury Sedan"
    },
    {
        ". Porsche executives believed such a ": null
    },
    {
        "flagship": "Flagship"
    },
    {
        " would have wider appeal than the compact, quirky and sometimes difficult to drive 911.     The 928 has the distinction of being the companys first production V8 powered model and the only coupé powered by a front-mounted V8 engine.       By the late 1960s Porsche had firmly established itself as a manufacturer of high-performance ": null
    },
    {
        "sports cars": "Sports Cars"
    },
    {
        ". Executives, including owner ": null
    },
    {
        "Ferdinand Porsche": "Ferdinand Anton Ernst Porsche"
    },
    {
        ", were beginning to consider adding a luxury ": null
    },
    {
        "touring car": "Grand Tourer"
    },
    {
        " to the line-up due to the need of a car using less fuel and being more usable in the wake of the ": null
    },
    {
        "1970s oil crisis": "1970S Energy Crisis"
    },
    {
        ". Managing director ": null
    },
    {
        "Ernst Fuhrmann": "Ernst Fuhrmann"
    },
    {
        " was pressuring Ferdinand to approve development of the new model due to concerns that the then-current flagship model, the ": null
    },
    {
        "911": "Porsche 911"
    },
    {
        ", was reaching the limits of its potential. Fuhrmann believed that the future of the company relied upon grand touring cars with conventional engines rather than unconventional sports cars. Slumping sales of the 911 in the mid-1970s seemed to confirm that the model was approaching the end of its economic life cycle. Fuhrmann envisioned the new range-topping ": null
    },
    {
        "grand tourer": "Grand Tourer"
    },
    {
        " model as being the best possible combination of a sports coupé and a ": null
    },
    {
        "luxury sedan": "Luxury Sedan"
    },
    {
        ". This would set it apart from the 911, with its relatively spartan interior and true sports car performance. The targets were that the car had to compete on par with offerings from Mercedes-Benz and BMW while also being successful in the United States, Porsches main market at the time.          Ordered by Ferdinand Porsche to design a production-feasible concept for the new model, Fuhrmann initiated a design study in 1971, eventually yielding the 928 which was the first clean sheet design by the company for its own model; the ": null
    },
    {
        "356": "Porsche 356"
    },
    {
        " had evolved from the ": null
    },
    {
        "Volkswagen Beetle": "Volkswagen Beetle"
    },
    {
        ", the 911 was an evolution of the 356 and the ": null
    },
    {
        "924": "Porsche 924"
    },
    {
        " was the result of an abandoned project by ": null
    },
    {
        "Volkswagen": "Volkswagen"
    },
    {
        " and ": null
    },
    {
        "Audi": "Audi"
    },
    {
        ".     Several drivetrain layouts were considered during early development, including rear and ": null
    },
    {
        "mid-engine design": "Mid-Engine Design"
    },
    {
        "s, but most were dismissed because of technical and legislative difficulties. Having the engine, transmission, ": null
    },
    {
        "catalytic converter": "Catalytic Converter"
    },
    {
        " and exhaust all cramped into a small rear engine bay made emission and noise control difficult which were the problems Porsche had with the 911. After deciding that the mid-engine layout did not allow enough room in the passenger compartment, a ": null
    },
    {
        "front-engine, rear-wheel drive": "Front-Engine, Rear-Wheel-Drive Layout"
    },
    {
        " layout was chosen. Porsche may have feared that the U.S. government would soon ban the sale of ": null
    },
    {
        "rear-engine": "Rear-Engine Design"
    },
    {
        " cars in response to concern over safety problems with the rear-engine ": null
    },
    {
        "Chevrolet Corvair": "Chevrolet Corvair"
    },
    {
        ".     Porsche engineers wanted a large-displacement engine to power the 928, and prototype units were built with a 5-litre ": null
    },
    {
        "V8 engine": "V8 Engine"
    },
    {
        " rated at nearly . ": null
    },
    {
        "Ferdinand Piëch": "Ferdinand Piëch"
    },
    {
        " wanted this car to use a 4.6-litre 90 degree V10 engine with 88  mm bore spacing, a derivative of the Audi 5 cylinder engine, which in turn is based upon the Volkswagen EA827 unit. The Porsche board objected as this move would give rise to a rumour of a new 911 with a front-mounted six cylinder engine, but also it is theorized that the board wanted to maintain some distance from the Volkswagen group.      The resulting all-alloy M28 engine has multiple unusual features. Its bore spacing is 122  mm, and uses thick aluminium cylinder barrels, hence the lower displacement. The engine was designed for air flow first, thus the spark plugs are located at the top of the head. The four-bolt bearings are sizeable and are fed oil via grooves in the bottom surface of the block. The oil and water pumps are driven by the timing belt, and the design of the engine allows for sufficient air flow with a low bonnet.      The first two running prototypes of Porsches M28 V8 used one four-barrel ": null
    },
    {
        "carburetor": "Carburetor"
    },
    {
        " for initial testing. The cars were sold with the planned ": null
    },
    {
        "Bosch": "Robert Bosch Gmbh"
    },
    {
        " K-Jetronic ": null
    },
    {
        "fuel injection": "Fuel Injection"
    },
    {
        " system. When increasing concern within the company over price and availability of fuel during the ": null
    },
    {
        "oil crisis": "Energy Crisis"
    },
    {
        " of the 1970s became an issue of contention, smaller engines were considered in the interest of ": null
    },
    {
        "fuel economy": "Fuel Economy In Automobiles"
    },
    {
        ". A push began for the development of a 3.3  L  powerplant envisioned by Fuhrmann, but company engineers balked at this suggestion. Both sides finally settled on a 4.5  L, SOHC per bank 16-valve V8 rated at  , which they considered to have an acceptable compromise of performance and fuel economy.     The finished car debuted at the ": null
    },
    {
        "1977 Geneva Motor Show": "Geneva Motor Show1977"
    },
    {
        " before going on sale later that year as a 1978 model. Although it won early acclaim for its comfort, power and futuristic design, sales were slow. Base prices were much higher than that of the previous range-topping 911 model and the 928s front-engined, water-cooled design alienated many Porsche purists.     Fuhrmanns replacement, Peter Schutz, decided that the models should be sold side by side, feeling that the 911 still had potential in the companys line-up.  Legislation against rear-engined vehicles did not materialize. Although it never sold in the numbers Fuhrmann envisioned, the 928 developed an avid following and had an 18-year production run.                The 928 featured a large, front-mounted and water-cooled ": null
    },
    {
        "V8 engine": "V8 Engine"
    },
    {
        " driving the ": null
    },
    {
        "rear wheels": "Rear Wheel Drive"
    },
    {
        ". Originally ": null
    },
    {
        "displacing": "Engine Displacement"
    },
    {
        " 4.5  L and featuring a ": null
    },
    {
        "single overhead camshaft": "Single Overhead Camshaft"
    },
    {
        " design, it was rated at  for the North American market and  in other markets. Porsche upgraded the engine from mechanical to electronic ": null
    },
    {
        "fuel injection": "Fuel Injection"
    },
    {
        " in 1980 for US models, although power remained the same. This design marked a major change in direction for Porsche , whose cars had until then used only rear- or mid-mounted ": null
    },
    {
        "air-cooled": "Air-Cooled"
    },
    {
        " flat": "Flat Engine"
    },
    {
        " engines with four or six cylinders.     Porsche utilised a ": null
    },
    {
        "transaxle": "Transaxle"
    },
    {
        " in the 928 to help achieve 50/50 front/rear weight distribution, aiding the cars balance. Although it weighed more than the difficult-to-handle 911, its more neutral weight balance and higher power output gave it similar performance on the track. The 928 was regarded as the more relaxing car to drive at the time. It came with either a five-speed ": null
    },
    {
        "dog leg manual transmission": "Dog-Leg Gearbox"
    },
    {
        ", or a ": null
    },
    {
        "Mercedes-Benz": "Mercedes-Benz"
    },
    {
        "-derived ": null
    },
    {
        "automatic transmission": "Automatic Transmission"
    },
    {
        ", originally with three speeds, with four-speed from 1983 in North America and 1984 in other markets. More than 80% of the cars had the automatic transmission. Exact percentage of manual gearbox cars for entire production run is not known but it is believed to be between 15 and 20%.     The body, styled by Wolfgang Möbius under guidance of ": null
    },
    {
        "Anatole Lapine": "Anatole Lapine"
    },
    {
        ", was mainly galvanized steel, but the doors, front wing, front fenders, and hood were made of aluminium in order to make the car more lightweight. It had a substantial luggage area accessed via a large ": null
    },
    {
        "hatchback": "Hatchback"
    },
    {
        ". The new ": null
    },
    {
        "polyurethane": "Polyurethane"
    },
    {
        " elastic ": null
    },
    {
        "bumpers": "Bumper"
    },
    {
        " were integrated into the nose and tail and covered in body-coloured plastic; an unusual feature for the time that aided the car visually and reduced its ": null
    },
    {
        "drag": "Drag"
    },
    {
        ". Another unusual feature were the pop-up headlamps which were based on the units found on the ": null
    },
    {
        "Lamborghini Miura": "Lamborghini Miura"
    },
    {
        " and were integrated into the front wings.      The 928 qualified as a ": null
    },
    {
        "2+2": "2+2"
    },
    {
        ", having two small seats in the rear. Both rear seats could be folded down to enlarge the luggage area, and both the front and rear seats had sun visors for occupants. The rear seats are small and have very little leg room; they are only suitable for adults on very short trips or children. The 928 was also the first vehicle in which the instrument cluster moved along with the adjustable ": null
    },
    {
        "steering wheel": "Steering Wheel"
    },
    {
        " in order to maintain maximum instrument visibility.     The 928 included several other features such as the ": null
    },
    {
        "Weissach Axle": "Weissach Axle"
    },
    {
        " , a simple rear-wheel steering system that provides passive rear-wheel steering to increase stability while braking during a turn, and an unsleeved, silicon alloy engine block made of aluminium, which reduced weight and provided a highly durable cylinder bore.     Porsches design and development efforts paid off during the 1978 ": null
    },
    {
        "European Car of the Year": "European Car Of The Year"
    },
    {
        ",  where the 928 won ahead of the ": null
    },
    {
        "BMW 7 Series": "Bmw 7 Series"
    },
    {
        ", and the ": null
    },
    {
        "Ford Granada": "Ford Granada"
    },
    {
        ". The 928 is the only ": null
    },
    {
        "sports car": "Sports Car"
    },
    {
        " so far to have won this competition, where the usual winners are mainstream ": null
    },
    {
        "hatchbacks": "Hatchback"
    },
    {
        "and ": null
    },
    {
        "sedans/saloons": "Sedan"
    },
    {
        " from major European manufacturers. This is regarded as proof of how advanced the 928 was, compared to its contemporaries.       Styling was the same in both 1978 and 1979, with the body lacking both front and rear spoilers. From 1980 through 1986, front and rear spoilers were present on S models, rear spoilers being integrated into the hatch. From 1987 through 1995, the front spoiler was integrated into the nose and the rear spoiler became a separated wing rather than an integrated piece, and side skirts were added. The rear tail-light configuration was also different from previous models. GTS models had wider rear fenders added to give more room for 9-inch wide wheels. Another easily noticeable visual difference between versions is the style of the wheels. Early 928s had 15-inch or 16-inch phone dial -style wheels, while most 1980s 928s had 16-inch slotted flat disc wheels, CSs, SEs and 1989 GTs had 16-inch Club Sport wheels, later GTs had 16-inch Design 90 style wheels which were also option on same period S4s , the GTS used two variations of the 17-inch CUP wheels.                   Porsche introduced a refreshed 928 S into the European market in 1980 model year, although it was summer of 1982 and ": null
    },
    {
        "MY": "Model Year"
    },
    {
        " 1983 before the model reached North America. Externally, the S wore new front and rear ": null
    },
    {
        "spoilers": "Spoiler"
    },
    {
        " and sported wider wheels and tires than the older variant, but the main change for the 928 S was under the hood, where a revised 4.7 L engine was used. European versions debuted with , and were upgraded to  for the 1984 model year. From 1984 to 1986, the S model was called S2 in United Kingdom. These cars used Bosch LH-Jetronic fuel injection system and purely electronic Bosch ignition, the same systems used on the later 32-valve cars, though without the pollution controls. North American-spec 1983 and 1984 S models used among other differences, smaller valves, milder camshafts, smaller diameter intake manifolds, and additional pollution equipment in order to meet emissions regulations, and were limited to  as a result. Due to low grade fuel, the 16-valve low compression S engine was made for Australian market in the 1985 model year. It had a 9.3:1 compression ratio pistons as opposed to the normal 10.4:1 but used the same large intake, high lift cams, large valves etc. of other S engines.     As the faster European model was not available in the United States and Canada during the first three years of its existence, a Competition Group option was created to allow North American customers to have an S model lookalike with front and rear spoilers, 16-inch flat disc wheels, sport seats, sport springs and ": null
    },
    {
        "Bilstein Shock Absorbers": "Bilstein Shock Absorbers"
    },
    {
        ". Customers could specify paint and interior colours the same way as on a normal 928. Two cars were made in the late 1980 model year for U.S. with this option. The package was officially available in 1981 and 1982 model years and was canceled in 1983 when the S model became available for these markets. Many cars have had S model features added by subsequent owners, making original Competition Group cars difficult to distinguish without checking option codes.     In the 1982 model year, two special models were available for different markets. 202 Weissach Edition cars were sold in North America. Unusual features were champagne gold metallic paint, matching brushed gold flat disc wheels, two-tone leather interior, a plaque containing the production number on the dash and the extremely collectible three-piece Porsche luggage set. Its believed these cars were not made with S spoilers even though these were available in U.S. during this time period as part of the Competition Group option. The Weissach Edition option was also available for the US market 911 for the 1980 model year and 924 for the 1981 model year.     141 special 50th Jubilee 928 S models were available outside the U.S. and Canada to celebrate the companys 50-year existence as a car manufacturer. This model is also sometimes referred to as the Ferry Porsche Edition because his signature was embroidered into the front seats. It featured meteor metallic paint and was fitted with flat disc wheels, wine red leather and special striped fabric seat centers. Similar 911 and 924 specials were also made for world markets.     Porsche updated the North American 928 S for 1985, replacing the 4.7 L SOHC engine with a new 5.0 L DOHC unit sporting four valves per cylinder and producing . Seats were also updated to a new style, these cars are sometimes unofficially called S3 to distinguish them from 16-valve S models. European models kept a 4.7 L engine, which was somewhat more powerful as standard, though lower 9.3:1 compression 32-valve engine together with catalytic converters became an option in some European countries and Australia for 1986. In 1986, revised suspension settings, larger brakes with 4-piston callipers and modified exhaust system was available on the 928S, marking the final changes to old body style cars. These were straight from the 928S4, which was slated to debut a few months later. These changes came starting from VIN 1001, which means that the first thousand 1986 cars had the old brakes, but later cars had this equipment available. This later 1986 model is sometimes referred to as a 1986 or 1986.5 because of these changes. The name is a little misleading as more than 3/4 of the 1986 production had these updates.     The 928 S4 variant debuted in the second half of 1986 as a 1987 model, an updated version of the 5.0 L V8 for all markets producing , sporting a new single-disc ": null
    },
    {
        "clutch": "Clutch"
    },
    {
        " in ": null
    },
    {
        "manual transmission": "Manual Transmission"
    },
    {
        " cars, larger torque converter in cars equipped with automatic transmission cars and fairly significant styling updates which gave the car a cleaner, sleeker look. S4 was much closer to being a truly world car than previous models as only major differences for North American models were instrumentation in either kilometers or miles, lighting, front and rear bumper shocks and the availability of catalytic converters in many other markets. The Australian market version was the only one with different horsepower rating at  due to preparation for possible low grade fuel. Even this was achieved without engine changes.     A Club Sport variant which was up to  lighter became available to continental Europe and U.S. in 1988. This model was the toned down version of the 1987 factory prototype which had a lightened body. Also in 1987, the factory made five white lightweight S4 models with a manual transmission for racecar drivers who were on their payroll at the time . These were close to same as later actual Club Sport models and can also be considered prototypes for it. An SE , a sort of halfway point between a normally equipped S4 and the more race-oriented Club Sport, became available for the UK market. Its generally believed that these cars have more power than the usual S4. They utilize parts which later became known as GT pistons, cams and engine ECU programs. Some of them had stronger, short ratio manual transmission. The ": null
    },
    {
        "automatic transmission": "Automatic Transmission"
    },
    {
        " was not available for this model.     For the 1989 model year, a visible change inside was ": null
    },
    {
        "digital trip computer": "Trip Computer"
    },
    {
        " in the dashboard. At the same time Australian models received the same  engine management setup as other markets. Porsche debuted the 928 GT in the late winter 1988/89 after dropping the slow-selling CS and SE. In terms of equipment, the GT was like the 928 SE, having more equipment than a Club Sport model but less than a 928 S4 to keep the weight down somewhat. It had the ": null
    },
    {
        "ZF": "Zf Friedrichshafen Ag"
    },
    {
        " 40% ": null
    },
    {
        "limited-slip differential": "Limited Slip Differential"
    },
    {
        " as standard like the Club Sport and SE before it. Also, like the CS and SE, the GT was only available with a manual gearbox. European 1989 CS and GT wheels had an RDK tire pressure monitoring system as standard, which was also optional for the same year S4. For 1990 model year Porsche made RDK and a 0-100% variable ratio limited-slip called PSD standard in both GT and S4 models for all markets. This system is much like the one from the flagship ": null
    },
    {
        "959": "Porsche 959"
    },
    {
        " and gives the vehicle even more grip on the track. In 1990, the S4 was no longer available with a manual transmission.     The S4 and GT variants halted production at the end of the 1991 model year, making way for the final version of the 928. The 928 GTS was available for sale in late 1991 as a 1992 model in Europe and in spring of 1992 as an early 1993 model in North America. Changed ": null
    },
    {
        "bodywork": "Coachwork"
    },
    {
        ", larger front brakes and a new, more powerful 5.4 L, 350 PS engine were the big advertised changes; what Porsche wasnt advertising was the price. Loaded GTS models could eclipse US$100,000 in 1995, making them among the most expensive cars on the road at the time. This severely hampered sales despite the models high competency and long standard equipment list. Porsche discontinued the GTS model that year after shipping only 77 of them to the United States. Total worldwide production for all years was a little over 61,000 cars.     Second-hand models value decreased as a result of high maintenance costs due to spare parts that are expensive to manufacture. Many parts suppliers and enthusiast networks exist, especially in the United States, Germany and the UK.     ": null
    },
    {
        "Road and Track": "Road And Track"
    },
    {
        " magazine published a speculative piece in their April 2006 issue regarding the possibility of a new, 928-esque coupé that may debut on a shortened version of the ": null
    },
    {
        "Panameras": "Porsche Panamera"
    },
    {
        "platform sometime around 2011 or 2012 model year but this speculation remained uncredible as Porsche denied the possibility of any such model reaching production stage.          The evolution of the 928 during its 18 years of production was quite subtle. The tables below show the major differences, which were made to the nose, tail, interior, engine, and wheels.     1978 928 ": null
    },
    {
        "Engine displacement": "Engine Displacement"
    },
    {
        " Bosch": "Robert Bosch Gmbh"
    },
    {
        " K-Jetronic": "Jetronick-Jetronic"
    },
    {
        " fuel injection": "Fuel Injection"
    },
    {
        " DIN": "Din"
    },
    {
        "North America   only 928 in North AmericaS model only177  kW4.5221  kW4.7 S167  kWexcept North America177  kW": null
    },
    {
        "82–19": "82–19"
    },
    {
        " 928 in North AmericaS model only177  kW4.5221  kW4.7 S167  kW 928 in North AmericaS model only177  kW4.5221  kW4.7 S167  kW  3300 ": null
    },
    {
        "lb": "Pound"
    },
    {
        "221  kW174  kWfor North America4.5 L                ": null
    },
    {
        "rq": "Rq"
    },
    {
        "1, 2   | style text-align:left; background:e0e0e0; | 1978  82   | style text-align:right; background:e0e0e0; | 17,669   |-   | style text-align:left; background:f0f0f0; | 928 S  Count contains 2,219 so-called S3 US models made in 1985 model year and 877 1986 models made in early part of 1986 model year up to November 1985.   6": null
    }
]