[
    {
        "              The Potsdam Agreement  was the August 1945 agreement between three of the ": null
    },
    {
        "Allies of World War II": "Allies Of World War Ii"
    },
    {
        ", the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        ", the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", and the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ". It concerned the military occupation and reconstruction of ": null
    },
    {
        "Germany": "Allied-Occupied Germany"
    },
    {
        ", its ": null
    },
    {
        "borders": "Former Eastern Territories Of Germany"
    },
    {
        ", and the entire ": null
    },
    {
        "European Theatre of War": "European Theatre Of World War Ii"
    },
    {
        " territory. It also addressed Germanys ": null
    },
    {
        "demilitarisation": "Demilitarisation"
    },
    {
        ", ": null
    },
    {
        "reparations": "German Reparations For World War Ii"
    },
    {
        " and the prosecution of ": null
    },
    {
        "war criminals": "War Criminal"
    },
    {
        ".     Executed as a communiqué, the agreement was not a ": null
    },
    {
        "peace treaty": "Peace Treaty"
    },
    {
        " according to ": null
    },
    {
        "international law": "International Law"
    },
    {
        ", although it created accomplished facts. It was superseded by the ": null
    },
    {
        "Treaty on the Final Settlement with Respect to Germany": "Treaty On The Final Settlement With Respect To Germany"
    },
    {
        " signed on 12 September 1990.     As De Gaulle had not been invited to the Conference, the French resisted implementing the Potsdam Agreements within their occupation zone. In particular, the French refused to resettle any expelled Germans from the east. Moreover, the French did not accept any obligation to abide by the Potsdam Agreement in the proceedings of the Allied Control Council; in particular resisting all proposals to establish common policies and institutions across Germany as a whole, and anything that they feared might lead to the emergence of an eventual unified German government.        After the ": null
    },
    {
        "end of World War II in Europe": "End Of World War Ii In Europe"
    },
    {
        " , and the decisions of the earlier ": null
    },
    {
        "Tehran": "Tehran Conference"
    },
    {
        ", ": null
    },
    {
        "Casablanca": "Casablanca Conference"
    },
    {
        " and ": null
    },
    {
        "Yalta Conferences": "Yalta Conference"
    },
    {
        ", the Allies by the ": null
    },
    {
        "Berlin Declaration": "Berlin Declaration"
    },
    {
        " of June 5, 1945, had assumed supreme authority over Germany. In the Three Power Conference of Berlin  from 17 July to 2 August 1945, they agreed to and adopted the Protocol of the Proceedings, August 1, 1945, signed at ": null
    },
    {
        "Cecilienhof": "Cecilienhof"
    },
    {
        " Castle in ": null
    },
    {
        "Potsdam": "Potsdam"
    },
    {
        ". The signatories were General Secretary ": null
    },
    {
        "Joseph Stalin": "Joseph Stalin"
    },
    {
        ", President ": null
    },
    {
        "Harry S. Truman": "Harry S. Truman"
    },
    {
        ", and Prime Minister ": null
    },
    {
        "Clement Attlee": "Clement Attlee"
    },
    {
        ", who, as a result of the ": null
    },
    {
        "British general election of 1945": "1945 United Kingdom General Election"
    },
    {
        ", had replaced ": null
    },
    {
        "Winston Churchill": "Winston Churchill"
    },
    {
        " as the UKs representative. The three powers also agreed to invite ": null
    },
    {
        "France": "France"
    },
    {
        " and ": null
    },
    {
        "China": "Republic Of China"
    },
    {
        " to participate as members of the Council of Foreign Ministers established to oversee the agreement. The ": null
    },
    {
        "Provisional Government of the French Republic": "Provisional Government Of The French Republic"
    },
    {
        " accepted the invitation on August 7, with the key reservation that it would not accept a priori any commitment to the eventual reconstitution of a central government in Germany.             In the Potsdam Agreement the Allies agree:    Establishment of a ": null
    },
    {
        "Council of Foreign Ministers": "Council Of Foreign Ministers"
    },
    {
        ", also including France and China; tasked the preparation of a peace settlement for Germany, to be accepted by the Government of Germany once a government adequate for the purpose had been established.   :See the London Conference of Foreign Ministers and the ": null
    },
    {
        "Moscow Conference": "Moscow Conference"
    },
    {
        " which took place later in 1945.   The principles to govern the treatment of Germany in the initial control period.   :See ": null
    },
    {
        "European Advisory Commission": "European Advisory Commission"
    },
    {
        " and ": null
    },
    {
        "Allied Control Council": "Allied Control Council"
    },
    {
        "   A. Political principles.   : Post-war Germany to be divided into four Occupation Zones under the control of Britain, the Soviet Union, the United States and France; with the Commanders-in-chief of each countrys forces exercising sovereign authority over matters within their own zones, while exercising authority jointly through the Allied Control Council for Germany as a whole.   :": null
    },
    {
        "Democratization": "Democratization"
    },
    {
        ". Treatment of Germany as a single unit. Disarmament and ": null
    },
    {
        "Demilitarization": "Demilitarization"
    },
    {
        ". Elimination of all ": null
    },
    {
        "Nazi": "Nazism"
    },
    {
        " influence.   B. Economic principles.   :Reduction or destruction of all civilian heavy-industry with war-potential, such as shipbuilding, machine production and chemical factories. Restructuring of German economy towards agriculture and light-industry.   ": null
    },
    {
        "Reparations from Germany": "German Reparations For World War Ii"
    },
    {
        ".   :This section covered reparation claims of the USSR from the ": null
    },
    {
        "Soviet occupation zone": "Soviet Occupation Zone"
    },
    {
        " in Germany. The section also agreed that 10% of the industrial capacity of the western zones unnecessary for the German peace economy should be transferred to the Soviet Union within two years. The Soviet Union withdrew its previous objections to French membership of the Allied Reparations Commission, which had been established in Moscow following the Yalta conference.   Disposal of the ": null
    },
    {
        "German Navy": "Kriegsmarine"
    },
    {
        " and merchant marine.   :All but thirty submarines to be sunk and the rest of the German Navy was to be divided equally between the three powers.   :The German merchant marine was to be divided equally between the three powers, and they would distribute some of those ships to the other Allies. But until the end of the war with the ": null
    },
    {
        "Empire of Japan": "Empire Of Japan"
    },
    {
        " all the ships would remain under the authority of the Combined Shipping Adjustment Board and the United Maritime Authority.   City of ": null
    },
    {
        "Königsberg": "Königsberg"
    },
    {
        " and the adjacent area .   :The United States and Britain declared that they would support the transfer of Königsberg and the adjacent area to the Soviet Union at the peace conference.   War criminals   : This was a short paragraph and covered the creation of the ": null
    },
    {
        "London Charter": "London Charter"
    },
    {
        " and the subsequent ": null
    },
    {
        "Nuremberg Trials": "Nuremberg Trials"
    },
    {
        "Moscow Declaration": "Moscow Declaration"
    },
    {
        " of October 1943 have no particular geographical localization. The Three Governments reaffirm their intention to bring these criminals to swift and sure justice. They hope that the negotiations in London will result in speedy agreement being reached for this purpose, and they regard it as a matter of great importance that the trial of these major criminals should begin at the earliest possible date. The first list of defendants will be published before 1st September.   ": null
    },
    {
        "Austria": "Allied-Occupied Austria"
    },
    {
        "Vienna": "Vienna"
    },
    {
        ", and that Austria should not pay any reparations.   ": null
    },
    {
        "Poland": "Peoples Republic Of Poland"
    },
    {
        "   :There should be a ": null
    },
    {
        "Provisional Government of National Unity": "Provisional Government Of National Unity"
    },
    {
        " recognised by all three powers, and that those Poles who were serving in British Army formations should be free to return to Poland. The provisional western border should be the ": null
    },
    {
        "Oder–Neisse line": "Oder–Neisse Line"
    },
    {
        ", with territories to the east of this excluded from the Soviet Occupation zone and placed under Polish and Soviet civil administration. Poland would receive former German territories in the north and west, but the final delimitation of the western frontier of Poland should await the peace settlement; which eventually took place as the ": null
    },
    {
        "Treaty on the Final Settlement With Respect to Germany": "Treaty On The Final Settlement With Respect To Germany"
    },
    {
        " in 1990.   Conclusion on peace treaties and admission to the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        " organization.   :See ": null
    },
    {
        "Moscow Conference of Foreign Ministers": "Moscow Conference Of Foreign Ministers"
    },
    {
        " which took place later in 1945.   :It was noted that ": null
    },
    {
        "Italy": "Kingdom Of Italy"
    },
    {
        " had fought on the side of the Allies and was making good progress towards establishment of a democratic government and institutions and that after the peace treaty the three Allies would support an application from a democratic Italian government for membership of the United Nations. Further   : e three Governments have also charged the Council of Foreign Ministers with the task of preparing peace treaties for ": null
    },
    {
        "Bulgaria": "Kingdom Of Bulgaria"
    },
    {
        ", ": null
    },
    {
        "Finland": "Finland"
    },
    {
        ", ": null
    },
    {
        "Hungary": "Kingdom Of Hungary"
    },
    {
        " and ": null
    },
    {
        "Romania": "Kingdom Of Romania"
    },
    {
        ". The conclusion of Peace Treaties with recognized democratic governments in these States will also enable the three Governments to support applications from them for membership of the United Nations. The three Governments agree to examine each separately in the near future in the light of the conditions then prevailing, the establishment of diplomatic relations with Finland, Romania, Bulgaria, and Hungary to the extent possible prior to the conclusion of peace treaties with those countries.   :The details were discussed later that year at the Moscow Conference of Foreign Ministers and the treaties were signed in 1947 at the ": null
    },
    {
        "Paris Peace Conference": "Paris Peace Conference"
    },
    {
        "   :By that time the governments of Romania, Bulgaria, and Hungary were Communist.   Territorial Trusteeship   :Italian former colonies would be decided in connection with the preparation of a peace treaty for Italy. Like most of the other former European Axis powers the Italian peace treaty was signed at the 1947 Paris Peace Conference.   Revised ": null
    },
    {
        "Allied Control Commission": "Allied Control Commission"
    },
    {
        " procedure in Romania, Bulgaria, and Hungary   :Now that hostilities in Europe were at an end the Western Allies should have a greater input into the Control Commissions of Central and Eastern Europe, the Annex to this agreement included detailed changes to the workings of the ": null
    },
    {
        "Hungarian Control Commission": "Allied Commissionhungary"
    },
    {
        ".   Orderly transfer of German Populations   :Main article ": null
    },
    {
        "Flight and expulsion of Germans ": "Flight And Expulsion Of Germans"
    },
    {
        "   : The Three Governments, having considered the question in all its aspects, recognize that the transfer to Germany of German populations, or elements thereof, remaining in Poland, ": null
    },
    {
        "Czechoslovakia": "Czechoslovakia"
    },
    {
        " and Hungary, will have to be undertaken. They agree that any transfers that take place should be effected in an orderly and humane manner.   : German populations, or elements thereof, remaining in Poland refers to Germans living within the 1937 boundaries of Poland up to the ": null
    },
    {
        "Curzon line": "Curzon Line"
    },
    {
        " going East. In theory, that German ethnic population could have been expelled to the Polish temporarily administered territories of ": null
    },
    {
        "Silesia": "Silesia Province"
    },
    {
        ", ": null
    },
    {
        "Farther Pomerania": "Farther Pomerania"
    },
    {
        ", East Prussia and eastern ": null
    },
    {
        "Brandenburg": "Province Of Brandenburg"
    },
    {
        ".   :Because the ": null
    },
    {
        "Allied Occupation Zones in Germany": "Allied Occupation Zones In Germany"
    },
    {
        " were under great strain, the Czechoslovak government, the Polish provisional government and the control council in Hungary were asked to submit an estimate of the time and rate at which further transfers could be carried out having regard to the present situation in Germany and suspend further expulsions until these estimates were integrated into plans for an equitable distribution of these removed Germans among the several zones of occupation.   Oil equipment in Romania   ": null
    },
    {
        "Iran": "Iran"
    },
    {
        "   :Allied troops were to withdraw immediately from ": null
    },
    {
        "Tehran": "Tehran"
    },
    {
        " and that further stages of the withdrawal of troops from Iran should be considered at the meeting of the Council of Foreign Ministers to be held in London in September 1945.   The international zone of ": null
    },
    {
        "Tangier": "Tangier"
    },
    {
        ".   :The city of Tangier and the area around it should remain international and discussed further.   The Black sea straits.   :The ": null
    },
    {
        "Montreux Convention": "Montreux Convention"
    },
    {
        " should be revised and that this should be discussed with the Turkish government.   International inland waterways   European inland transport conference.   Directives to the military commanders on allied control council for Germany.   Use of Allied property for satellite reparations or war trophies   :These were detailed in Annex II   Military Talks   Annex I   Annex II     Moreover, towards concluding the ": null
    },
    {
        "Pacific Theatre of War": "Pacific War"
    },
    {
        ", the Potsdam Conference issued the ": null
    },
    {
        "Potsdam Declaration": "Potsdam Declaration"
    },
    {
        ", the Proclamation Defining Terms for Japanese Surrender wherein the Western Allies and the ": null
    },
    {
        "Nationalist China": "National Government Of The Republic Of China1927–49"
    },
    {
        " of General ": null
    },
    {
        "Chiang Kai-shek": "Chiang Kai-Shek"
    },
    {
        " asked Japan to surrender or be destroyed.       Already during the Potsdam Conference, on 30 July 1945, the ": null
    },
    {
        "Allied Control Council": "Allied Control Council"
    },
    {
        " was constituted in Berlin to execute the Allied resolutions :     ": null
    },
    {
        "Denazification": "Denazification"
    },
    {
        " of the German society to eradicate ": null
    },
    {
        "Nazi": "Nazism"
    },
    {
        " influence   ": null
    },
    {
        "Demilitarization": "Demilitarization"
    },
    {
        " of the former ": null
    },
    {
        "Wehrmacht": "Wehrmacht"
    },
    {
        " forces and the German ": null
    },
    {
        "arms industry": "Arms Industry"
    },
    {
        "; however, the circumstances of the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        " soon led to Germanys  Wiederbewaffnung  including the re-establishment of both the ": null
    },
    {
        "Bundeswehr": "Bundeswehr"
    },
    {
        " and the ": null
    },
    {
        "National Peoples Army": "National Peoples Army"
    },
    {
        " Democratization": "Democratization"
    },
    {
        ", including the formation of ": null
    },
    {
        "political parties": "Political Party"
    },
    {
        " and ": null
    },
    {
        "trade unions": "Trade Union"
    },
    {
        ", ": null
    },
    {
        "freedom of speech": "Freedom Of Speech"
    },
    {
        ", of the ": null
    },
    {
        "press": "Freedom Of The Press"
    },
    {
        " and ": null
    },
    {
        "religion": "Freedom Of Religion"
    },
    {
        " Decentralization": "Decentralization"
    },
    {
        " resulting in ": null
    },
    {
        "German federalism": "Federalism In Germany"
    },
    {
        ", along with disassemblement as part of the ": null
    },
    {
        "industrial plans for Germany": "Industrial Plans For Germany"
    },
    {
        ". Dismantling was stopped in ": null
    },
    {
        "West Germany": "West Germany"
    },
    {
        " in 1951 according to the ": null
    },
    {
        "Truman Doctrine": "Truman Doctrine"
    },
    {
        ", whereafter ": null
    },
    {
        "East Germany": "East Germany"
    },
    {
        " had to cope with the impact alone.       The northern half of the German province of ": null
    },
    {
        "East Prussia": "East Prussia"
    },
    {
        ", occupied by the ": null
    },
    {
        "Red Army": "Red Army"
    },
    {
        " during its ": null
    },
    {
        "East Prussian Offensive": "East Prussian Offensive"
    },
    {
        " followed by its ": null
    },
    {
        "evacuation": "Evacuation Of East Prussia"
    },
    {
        " in winter 1945, had already been incorporated into Soviet territory as the ": null
    },
    {
        "Kaliningrad Oblast": "Kaliningrad Oblast"
    },
    {
        ". The Western Allies promised to support the annexation of the territory north of the ": null
    },
    {
        "Braunsberg": "Braniewo"
    },
    {
        "–": null
    },
    {
        "Goldap": "Gołdap"
    },
    {
        " line when a Final German Peace Treaty was held.     The Allies had acknowledged the legitimacy of the Polish ": null
    },
    {
        "Provisional Government of National Unity": "Provisional Government Of National Unity"
    },
    {
        ", which was about to form a Soviet ": null
    },
    {
        "satellite state": "Satellite State"
    },
    {
        ". Urged by Stalin, the UK and the US gave in to put the German territories east of the ": null
    },
    {
        "Oder–Neisse line": "Oder–Neisse Line"
    },
    {
        " from the ": null
    },
    {
        "Baltic": "Baltic Sea"
    },
    {
        " coast west of ": null
    },
    {
        "Świnoujście": "Świnoujście"
    },
    {
        " up to the ": null
    },
    {
        "Czechoslovak": "Czechoslovakia"
    },
    {
        " border under Polish administration ; allegedly confusing the ": null
    },
    {
        "Lusatian Neisse": "Lusatian Neisse"
    },
    {
        " and the ": null
    },
    {
        "Glatzer Neisse": "Nysa Kłodzka"
    },
    {
        " rivers. The proposal of an Oder-": null
    },
    {
        "Bober": "Bóbr"
    },
    {
        "-": null
    },
    {
        "Queis": "Kwisa"
    },
    {
        " line was rejected by the Soviet delegation. The cession included the former ": null
    },
    {
        "Free City of Danzig": "Free City Of Danzig"
    },
    {
        " and the seaport of ": null
    },
    {
        "Stettin": "Szczecin"
    },
    {
        " on the mouth of the ": null
    },
    {
        "Oder": "Oder"
    },
    {
        " River , vital for the ": null
    },
    {
        "Upper Silesian Industrial Region": "Upper Silesian Industrial Region"
    },
    {
        ".     Post-war, Germany as a whole would consist solely of aggregate territories of the respective zones of occupation. As all former German territories east of the Oder-Neisse line were excluded from the Soviet Occupation Zone, they were consequently excluded from Germany as a whole.             In the course of the proceedings, ": null
    },
    {
        "Polish communists": "Polish Communism"
    },
    {
        " had begun to suppress the German population west of the Bóbr river to underline their demand for a border on the Lusatian Neisse. The Allied resolution on the orderly transfer of German population became the legitimation of the expulsion of Germans from the nebulous parts of ": null
    },
    {
        "Central Europe": "Central Europe"
    },
    {
        ", if they had not already fled from the advancing Red Army.     The expulsion of ethnic Germans by the Poles concerned, in addition to Germans within areas behind the 1937 Polish border in the West , the territories placed under Polish administration pending a Final German Peace Treaty, i.e. southern East Prussia , ": null
    },
    {
        "Farther Pomerania": "Farther Pomerania"
    },
    {
        ", the ": null
    },
    {
        "New March": "New March"
    },
    {
        " region of the former ": null
    },
    {
        "Province of Brandenburg": "Province Of Brandenburg"
    },
    {
        ", the districts of the Grenzmark ": null
    },
    {
        "Posen-West Prussia": "Posen-West Prussia"
    },
    {
        ", ": null
    },
    {
        "Lower Silesia": "Lower Silesia"
    },
    {
        " and those parts of ": null
    },
    {
        "Upper Silesia": "Upper Silesia"
    },
    {
        " that had remained with Germany after the 1921 ": null
    },
    {
        "Upper Silesia plebiscite": "Upper Silesia Plebiscite"
    },
    {
        ". It further affected the German minority living within the territory of the former ": null
    },
    {
        "Second Polish Republic": "Second Polish Republic"
    },
    {
        " in ": null
    },
    {
        "Greater Poland": "Greater Poland"
    },
    {
        ", eastern Upper Silesia, ": null
    },
    {
        "Chełmno Land": "Chełmno Land"
    },
    {
        " and the ": null
    },
    {
        "Polish Corridor": "Polish Corridor"
    },
    {
        " with Danzig.     The ": null
    },
    {
        "Germans in Czechoslovakia": "Germans In Czechoslovakia"
    },
    {
        " , known as ": null
    },
    {
        "Sudeten Germans": "Sudeten Germans"
    },
    {
        " but also ": null
    },
    {
        "Carpathian Germans": "Carpathian Germans"
    },
    {
        ", were expelled from the  Sudetenland  region where they formed a majority, from linguistic enclaves in central ": null
    },
    {
        "Bohemia": "Bohemia"
    },
    {
        " and ": null
    },
    {
        "Moravia": "Moravia"
    },
    {
        ", as well as from the city of ": null
    },
    {
        "Prague": "Prague"
    },
    {
        ".     Though the Potsdam Agreement only refers to Poland, Czechoslovakia and ": null
    },
    {
        "Hungary": "Kingdom Of Hungary"
    },
    {
        ", expulsions also occurred in ": null
    },
    {
        "Romania": "Kingdom Of Romania"
    },
    {
        ", where the ": null
    },
    {
        "Transylvanian Saxons": "Transylvanian Saxons"
    },
    {
        " were ": null
    },
    {
        "deported": "Deportation Of Germans From Romania After World War Ii"
    },
    {
        " and their property disseized, and in ": null
    },
    {
        "Yugoslavia": "Socialist Federal Republic Of Yugoslavia"
    },
    {
        ". In the Soviet territories, Germans not only were expelled from northern East Prussia  but also from the adjacent Lithuanian ": null
    },
    {
        "Klaipeda Region": "Klaipeda Region"
    },
    {
        " and other lands settled by ": null
    },
    {
        "Baltic Germans": "Baltic Germans"
    }
]