[
    {
        "            Prayer is an ": null
    },
    {
        "invocation": "Invocation"
    },
    {
        " or act that seeks to activate a ": null
    },
    {
        "rapport": "Rapport"
    },
    {
        " with an object of ": null
    },
    {
        "worship": "Worship"
    },
    {
        " through deliberate ": null
    },
    {
        "communication": "Communication"
    },
    {
        ". In the narrow sense, the term refers to an act of ": null
    },
    {
        "supplication": "Supplication"
    },
    {
        " or ": null
    },
    {
        "intercession": "Intercession"
    },
    {
        " directed towards a ": null
    },
    {
        "deity": "Deity"
    },
    {
        " , or a deified ": null
    },
    {
        "ancestor": "Ancestor Worship"
    },
    {
        ". More generally, prayer can also have the purpose of ": null
    },
    {
        "thanksgiving": "Thanksgiving"
    },
    {
        " or ": null
    },
    {
        "praise": "Praise"
    },
    {
        ", and in ": null
    },
    {
        "comparative religion": "Comparative Religion"
    },
    {
        " is closely associated with more abstract forms of ": null
    },
    {
        "meditation": "Meditation"
    },
    {
        " and with ": null
    },
    {
        "charms or spells": "Incantation"
    },
    {
        ". F.B. Jevons, An Introduction to the Study of Comparative Religion ,      Prayer can take a variety of forms: it can be part of a set ": null
    },
    {
        "liturgy": "Liturgy"
    },
    {
        " or ": null
    },
    {
        "ritual": "Ritual"
    },
    {
        ", and it can be performed alone or in groups. Prayer may take the form of a ": null
    },
    {
        "hymn": "Hymn"
    },
    {
        ", ": null
    },
    {
        "incantation": "Incantation"
    },
    {
        ", formal ": null
    },
    {
        "creed": "Creed"
    },
    {
        "al statement, or a spontaneous utterance in the praying person.     The act of prayer is attested in written sources as early as 5000 years ago. Today, most major ": null
    },
    {
        "religions": "Religion"
    },
    {
        " involve prayer in one way or another; some ritualize the act, requiring a strict sequence of actions or placing a restriction on who is permitted to pray, while others teach that prayer may be practised spontaneously by anyone at any time.     Scientific studies regarding the use of prayer have mostly concentrated on its effect on the healing of sick or injured people. The ": null
    },
    {
        "efficacy of prayer": "Efficacy Of Prayer"
    },
    {
        " in ": null
    },
    {
        "faith healing": "Faith Healing"
    },
    {
        " has been evaluated in numerous studies, with contradictory results.       The English term prayer is from ": null
    },
    {
        "Medieval Latin": "Medieval Latin"
    },
    {
        " precaria petition, prayer .    Via Old French prier, nominalised use of the Latin adjective precaria something obtained by entreating, something given as a favour , from precari to ask for, entreat . The ": null
    },
    {
        "Vulgate": "Vulgate"
    },
    {
        " Latin is  oratio , which translates Greek ": null
    },
    {
        "προσευχή": ":Wikt:Προσευχή"
    },
    {
        " Biblical synonyms or alternatives for προσευχή: εὐχή, δέησις, ἔντευξις, εὐχαριστία, αἴτημα, ἱκετηρία. Richard C. Trench, Synonyms of the New Testament, s.v. . in turn the ": null
    },
    {
        "Septuagint": "Septuagint"
    },
    {
        " translation of ": null
    },
    {
        "Biblical Hebrew": "Biblical Hebrew"
    },
    {
        "  tĕphillah. Strongs Concordance .          Various spiritual traditions offer a wide variety of devotional acts. There are morning and evening prayers, ": null
    },
    {
        "graces said over meals": "Grace"
    },
    {
        ", and reverent physical gestures. Some Christians bow their heads and fold their hands. Some ": null
    },
    {
        "Native Americans": "Native Americans In The United States"
    },
    {
        " regard dancing as a form of prayer.  Some ": null
    },
    {
        "Sufis": "Sufism"
    },
    {
        " whirl": "Sufi Whirling"
    },
    {
        ".  Hindus chant mantras.  Jewish prayer may involve ": null
    },
    {
        "swaying": "Shuckling"
    },
    {
        " back and forth and bowing. . This practice is known, in ": null
    },
    {
        "Yiddish": "Yiddish"
    },
    {
        ", as shuckling. ": null
    },
    {
        "Muslims": "Muslims"
    },
    {
        " practice  salat   in their prayers. Quakers keep silent.  Some pray according to standardized rituals and liturgies, while others prefer extemporaneous prayers. Still others combine the two.     ": null
    },
    {
        "Friedrich Heiler": "Friedrich Heiler"
    },
    {
        " is often cited in Christian circles for his systematic Typology of Prayer which lists six types of prayer: primitive, ritual, Greek cultural, philosophical, mystical, and prophetic.  Some forms of prayer require a prior ritualistic form of cleansing or purification such as in ": null
    },
    {
        "ghusl": "Ghusl"
    },
    {
        " and ": null
    },
    {
        "wudhu": "Wudhu"
    },
    {
        ". The New Encyclopedia of Islam. p. 20, Cyril Glassé     Prayer may be done privately and individually, or it may be done corporately in the presence of fellow believers. Prayer can be incorporated into a daily thought life , in which one is in constant communication with a god. Some people pray throughout all that is happening during the day and seek guidance as the day progresses. This is actually regarded as a requirement in several Christian denominations,  although enforcement is not possible nor desirable. There can be many different answers to prayer, just as there are many ways to interpret an answer to a question, if there in fact comes an answer. Some may experience audible, physical, or mental epiphanies. If indeed an answer comes, the time and place it comes is considered random.   Some outward acts that sometimes accompany prayer are: anointing with oil; See, for example,  ringing a bell;  burning incense or paper;  lighting a candle or candles; See, for example, facing a specific direction ; making the ": null
    },
    {
        "sign of the cross": "Sign Of The Cross"
    },
    {
        ". One less noticeable act related to prayer is ": null
    },
    {
        "fasting": "Fasting"
    },
    {
        ".     A variety of body postures may be assumed, often with specific meaning associated with them: standing; sitting; kneeling; prostrate on the floor; eyes opened; eyes closed; hands folded or clasped; hands upraised; holding hands with others; a laying on of hands and others. Prayers may be recited from memory, read from a book of prayers, or composed spontaneously as they are prayed. They may be said, chanted, or sung. They may be with musical accompaniment or not. There may be a time of outward silence while prayers are offered mentally. Often, there are prayers to fit specific occasions, such as the blessing of a meal, the birth or death of a loved one, other significant events in the life of a believer, or days of the year that have special religious significance. Details corresponding to specific traditions are outlined below.               Anthropologically, the concept of prayer is closely related to that of ": null
    },
    {
        "surrender": "Submission"
    },
    {
        " and ": null
    },
    {
        "supplication": "Supplication"
    },
    {
        ".   The traditional posture of prayer in medieval Europe is kneeling or supine with clasped hands, in antiquity more typically with raised hands. The early Christian prayer posture was standing, looking up to heaven, with outspread arms and bare head. This is the pre-Christian, pagan prayer posture . Certain Cretan and Cypriote figures of the Late Bronze Age, with arms raised, have been interpreted as worshippers. Their posture is similar to the flight posture, a crouching posture with raised hands, observed in schizophrenic patients and related to the universal ": null
    },
    {
        " hands up gesture": "List Of Gestures"
    },
    {
        " of surrender. The kneeling posture with clasped hands appears to have been introduced only with the beginning high medieval period, presumably adopted from a gesture of feudal homage. Russell, Claire; Russell, W.M.S. . Cultural Evolution of Behaviour . Netherlands Journal of Zoology. 40 : 745–62 doi:10.1163/156854290X00190.     Although prayer in its literal sense is not used in ": null
    },
    {
        "animism": "Animism"
    },
    {
        ", communication with the spirit world is vital to the animist way of life. This is usually accomplished through a ": null
    },
    {
        "shaman": "Shaman"
    },
    {
        " who, through a ": null
    },
    {
        "trance": "Trance"
    },
    {
        ", gains access to the spirit world and then shows the spirits thoughts to the people. Other ways to receive messages from the spirits include using ": null
    },
    {
        "astrology": "Astrology"
    },
    {
        " or contemplating ": null
    },
    {
        "fortune tellers": "Fortune Telling"
    },
    {
        " and healers.      Some of the oldest extant literature, such as the Sumerian temple hymns of ": null
    },
    {
        "Enheduanna": "Enheduanna"
    },
    {
        " are liturgy addressed to deities and thus technically prayer . The Egyptian ": null
    },
    {
        "Pyramid Texts": "Pyramid Texts"
    },
    {
        " of about the same period similarly contain spells or incantations addressed to the gods. In the loosest sense, in the form of ": null
    },
    {
        "magical thinking": "Magical Thinking"
    },
    {
        " combined with ": null
    },
    {
        "animism": "Animism"
    },
    {
        ", prayer has been argued as representing a ": null
    },
    {
        "human cultural universal": "Human Cultural Universal"
    },
    {
        ", which would have been present since the emergence of ": null
    },
    {
        "behavioral modernity": "Behavioral Modernity"
    },
    {
        ", by ": null
    },
    {
        "anthropologists": "Anthropology"
    },
    {
        " such as Sir ": null
    },
    {
        "Edward Burnett Tylor": "Edward Burnett Tylor"
    },
    {
        " and Sir ": null
    },
    {
        "James George Frazer": "James George Frazer"
    },
    {
        ".      Reliable records are available for the ": null
    },
    {
        "polytheistic": "Polytheism"
    },
    {
        " religions of the ": null
    },
    {
        "Iron Age": "Iron Age"
    },
    {
        ", most notably ": null
    },
    {
        "Ancient Greek religion": "Ancient Greek Religion"
    },
    {
        " . These religious traditions were direct developments of the earlier ": null
    },
    {
        "Bronze Age religions": "Prehistoric Religionbronze Age Europe"
    },
    {
        ".   Ceremonial prayer was highly formulaic and ": null
    },
    {
        "ritual": "Ritual"
    },
    {
        "ized.       In ancient polytheism, ": null
    },
    {
        "ancestor worship": "Ancestor Worship"
    },
    {
        " is indistinguishable from theistic worship .   Vestiges of ancestor worship persist, to a greater or lesser extent, in modern religious traditions throughout the world, most notably in Japanese ": null
    },
    {
        "Shinto": "Shinto"
    },
    {
        " and in ": null
    },
    {
        "Chinese folk religion": "Chinese Ancestor Worship"
    },
    {
        ". The practices involved in ": null
    },
    {
        "Shinto": "Shinto"
    },
    {
        " prayer are heavily influenced by Buddhism; ": null
    },
    {
        "Japanese Buddhism": "Japanese Buddhism"
    },
    {
        " has also been strongly influenced by Shinto in turn. Shinto prayers quite frequently consist of wishes or favors asked of the  kami , rather than lengthy praises or devotions. The practice of ": null
    },
    {
        "votive offering": "Votive Offering"
    },
    {
        " is also universal, and is attested at least since the Bronze Age. In Shinto, this takes the form of a small wooden tablet, called an  ema .     Prayers in ": null
    },
    {
        "Etruscan": "Etruscan Language"
    },
    {
        " were used in the Roman world by ": null
    },
    {
        "augurs": "Augur"
    },
    {
        " and other ": null
    },
    {
        "oracles": "Oracle"
    },
    {
        " long after Etruscan became a dead language. The ": null
    },
    {
        "Carmen Arvale": "Carmen Arvale"
    },
    {
        " and the ": null
    },
    {
        "Carmen Saliare": "Carmen Saliare"
    },
    {
        " are two specimens of partially preserved prayers that seem to have been unintelligible to their scribes, and whose language is full of ": null
    },
    {
        "archaisms": "Archaism"
    },
    {
        " and difficult passages. ": null
    },
    {
        "Frederic de Forest Allen": "Frederic De Forest Allen"
    },
    {
        ", Remnants of Early Latin .     Roman prayers and ": null
    },
    {
        "sacrifices": "Sacrifice"
    },
    {
        " were often envisioned as ": null
    },
    {
        "legal": "Religious Law"
    },
    {
        " bargains between deity and worshipper. The Roman principle was expressed as  do ut des ": null
    },
    {
        "Cato the Elders": "Cato The Elder"
    },
    {
        " treatise on ": null
    },
    {
        "agriculture": "Agriculture"
    },
    {
        " contains many examples of preserved traditional prayers; in one, a farmer addresses the unknown deity of a possibly sacred grove, and sacrifices a pig in order to placate the god or goddess of the place and beseech his or her permission to cut down some trees from the grove. e.g.: ": null
    },
    {
        "Catos": "Cato The Elder"
    },
    {
        " Mars Prayer, found in  De Agri Cultura  , English translation at:         ": null
    },
    {
        "Celtic": "Celtic Polytheism"
    },
    {
        ", ": null
    },
    {
        "Germanic": "Germanic Paganism"
    },
    {
        " and ": null
    },
    {
        "Slavic": "Slavic Paganism"
    },
    {
        " religions are recorded much later, and much more fragmentarily, than the religions of classical antiquity. They nevertheless show substantial parallels to the better-attested religions of the Iron Age. In the case of Germanic religion, the practice of prayer is reliably attested, but no actual liturgy is recorded from the early period. An Old Norse prayer is on record in the form of a dramatization in ": null
    },
    {
        "skaldic poetry": "Skaldic Poetry"
    },
    {
        ". This prayer is recorded in stanzas2 and3 of the poem  Sigrdrífumál , compiled in the 13th century  Poetic Edda  from earlier traditional sources, where the ": null
    },
    {
        "valkyrie": "Valkyrie"
    },
    {
        " Sigrdrífa": "Sigrdrífa"
    },
    {
        " prays to the gods and the ": null
    },
    {
        "earth": "Jörð"
    },
    {
        " after being woken by the hero ": null
    },
    {
        "Sigurd": "Sigurd"
    },
    {
        ".    A prayer to ": null
    },
    {
        "Odin": "Odin"
    },
    {
        " is mentioned in chapter2 of the  Völsunga saga  where King ": null
    },
    {
        "Rerir": "Rerir"
    },
    {
        " prays for a child. In stanza9 of the poem  Oddrúnargrátr , a prayer is made to kind ": null
    },
    {
        "wights": "Vættir"
    },
    {
        ", Frigg and ": null
    },
    {
        "Freyja": "Freyja"
    },
    {
        ", and many gods although since the poem is often considered one of the youngest poems in the Poetic Edda, the passage has been the matter of some debate. ": null
    },
    {
        "Grundy, Stephan": "Stephan Grundy"
    },
    {
        " . Freyja and Frigg as collected in Billington, Sandra. https://books.google.com/books?idIoW9yhkrFJoC & printsecfrontcover The Concept of the Goddess, p. 60. ": null
    },
    {
        "Routledge": "Routledge"
    },
    {
        "  In chapter 21 of  Jómsvíkinga saga , wishing to turn the tide of the ": null
    },
    {
        "Battle of Hjörungavágr": "Battle Of Hjörungavágr"
    },
    {
        ", ": null
    },
    {
        "Haakon Sigurdsson": "Haakon Sigurdsson"
    },
    {
        " eventually finds his prayers answered by the goddesses ": null
    },
    {
        "Þorgerðr Hölgabrúðr and Irpa": "Þorgerðr Hölgabrúðr And Irpa"
    },
    {
        ". Hollander, Lee . The saga of the Jómsvíkings, p. 100. ": null
    },
    {
        "University of Texas Press": "University Of Texas Press"
    },
    {
        "    Folk religion": "Folk Religion"
    },
    {
        " in the medieval period produced ": null
    },
    {
        "syncretisms": "Syncretism"
    },
    {
        " between pre-Christian and Christian traditions. An example is the 11th-century ": null
    },
    {
        "Anglo-Saxon": "Anglo-Saxon"
    },
    {
        " charm  Æcerbot  for the fertility of crops and land, or the medical  Wið færstice . ": null
    },
    {
        "Gordon, R.K.": "Gordon, R.K."
    },
    {
        " . Anglo-Saxon Poetry. Everymans Library 794. M. Dent & Sons, LTD. The 8th-century ": null
    },
    {
        "Wessobrunn Prayer": "Wessobrunn Prayer"
    },
    {
        " has been proposed as a Christianized pagan prayer and compared to the pagan  Völuspá  Lambdin, Laura C and Robert T. . Encyclopedia of Medieval Literature, p. 227. Greenwood Publishing Group  and the ": null
    },
    {
        "Merseburg Incantations": "Merseburg Incantations"
    },
    {
        ", the latter recorded in the 9th or 10th century but of much older traditional origins. Wells, C.J. . German, a Linguistic History to 1945: A Linguistic History to 1945, p. 51. ": null
    },
    {
        "Oxford University Press": "Oxford University Press"
    },
    {
        "      In ": null
    },
    {
        "Australian Aboriginal mythology": "Australian Aboriginal Mythology"
    },
    {
        ", prayers to the Great Wit are performed by the clever men and clever women , or kadji. These ": null
    },
    {
        "Aboriginal": "Australian Aborigines"
    },
    {
        " shamans use ": null
    },
    {
        "maban": "Maban"
    },
    {
        " or mabain, the material that is believed to give them their purported magical powers.  The ": null
    },
    {
        "Pueblo": "Puebloan Peoples"
    },
    {
        " Indians are known to have used ": null
    },
    {
        "prayer sticks": "Prayer Stick"
    },
    {
        ", that is, sticks with feathers attached as supplicatory offerings. The ": null
    },
    {
        "Hopi": "Hopi"
    },
    {
        " Indians used prayer sticks as well, but they attached to it a small bag of sacred meal.               The most common form of prayer is to directly appeal to a deity to grant ones requests. Some have termed this as the social approach to prayer. Greenberg, Moshe. Biblical Prose Prayer: As a Window to the Popular Religion of Ancient Israel. Berkeley: University of California Press, c1983      ": null
    },
    {
        "Atheist": "Atheist"
    },
    {
        " arguments against prayer are mostly directed against ": null
    },
    {
        "petitionary prayer": "Supplication"
    },
    {
        " in particular. ": null
    },
    {
        "Daniel Dennett": "Daniel Dennett"
    },
    {
        " argued that petitionary prayer might have the undesirable psychological effect of relieving a person of the need to take active measures. Surely it does the world no harm if those who can honestly do so pray for me! No, Im not at all sure about that. For one thing, if they really wanted to do something useful, they could devote their prayer time and energy to some pressing project that they can do something about      This potential drawback manifests in extreme forms in such cases as ": null
    },
    {
        "Christian Scientists": "Christian Scientists"
    },
    {
        " who rely on prayers instead of seeking medical treatment for family members for easily curable conditions which later result in death.      ": null
    },
    {
        "Christopher Hitchens": "Christopher Hitchens"
    },
    {
        " argued that praying to a god which is omnipotent and all-knowing would be presumptuous. For example, he interprets ": null
    },
    {
        "Ambrose Bierces": "Ambrose Bierce"
    },
    {
        " definition of prayer by stating that the man who prays is the one who thinks that god has arranged matters all wrong, but who also thinks that he can instruct god how to put them right.        In this view, prayer is not a conversation. Rather, it is meant to inculcate certain attitudes in the one who prays, but not to influence. Among Jews, this has been the approach of Rabbenu Bachya, Rabbi ": null
    },
    {
        "Yehuda Halevi": "Yehuda Halevi"
    },
    {
        ", ": null
    },
    {
        "Joseph Albo": "Joseph Albo"
    },
    {
        ", ": null
    },
    {
        "Samson Raphael Hirsch": "Samson Raphael Hirsch"
    },
    {
        ", and ": null
    },
    {
        "Joseph B. Soloveitchik": "Joseph B. Soloveitchik"
    },
    {
        ". This view is expressed by Rabbi ": null
    },
    {
        "Nosson Scherman": "Nosson Scherman"
    },
    {
        " in the overview to the ": null
    },
    {
        "Artscroll": "Artscroll"
    },
    {
        " Siddur": "Siddur"
    },
    {
        " .     Among Christian theologians, ": null
    },
    {
        "E.M. Bounds": "Edward Mckendree Bounds"
    },
    {
        " stated the educational purpose of prayer in every chapter of his book, The Necessity of Prayer. Prayer books such as the ": null
    },
    {
        "Book of Common Prayer": "Book Of Common Prayer"
    },
    {
        " are both a result of this approach and an exhortation to keep it.        In this view, the ultimate goal of prayer is to help train a person to focus on divinity through philosophy and intellectual contemplation . This approach was taken by the Jewish scholar and philosopher ": null
    },
    {
        "Maimonides": "Maimonides"
    },
    {
        " Guide to the Perplexed 3:51 and the other medieval rationalists. Sefer HaIkarim 4:18 It became popular in Jewish, Christian, and Islamic intellectual circles, but never became the most popular understanding of prayer among the laity in any of these faiths. In all three of these faiths today, a significant minority of people still hold to this approach.          In this approach, the purpose of prayer is to enable the person praying to gain a direct experience of the recipient of the prayer . This approach is very significant in Christianity and widespread in Judaism . In ": null
    },
    {
        "Eastern Orthodoxy": "Eastern Orthodoxy"
    },
    {
        ", this approach is known as ": null
    },
    {
        "hesychasm": "Hesychasm"
    },
    {
        ". It is also widespread in ": null
    },
    {
        "Sufi": "Sufi"
    },
    {
        " Islam, and in some forms of ": null
    },
    {
        "mysticism": "Mysticism"
    },
    {
        ". It has some similarities with the rationalist approach, since it can also involve ": null
    },
    {
        "contemplation": "Contemplation"
    },
    {
        ", although the contemplation is not generally viewed as being as rational or intellectual. Christian and Roman Catholic traditions also include an experiential approach to prayer within the practice of ": null
    },
    {
        "Lectio Divina": "Lectio Divina"
    },
    {
        ", historically a ": null
    },
    {
        "Benedictine": "Benedictine"
    },
    {
        " practice in which scripture is read aloud; actively meditated upon using the intellect possibly using the mind to place the listener within a relationship or dialogue with the text that was read; a prayer spoken; and finally concludes with ": null
    },
    {
        "contemplation": "Lectio Divinacontemplatio: Contemplate"
    },
    {
        ", a more passive experiential approach than the previous meditation, which is characterized by the ": null
    },
    {
        "Catechism of the Catholic Church": "Catechism Of The Catholic Church"
    },
    {
        " as an experience of consciously being attentive, and having a silent love toward God, which the individual experiences without demanding to receive an experience.  The experience of God within ": null
    },
    {
        "Christian mysticism": "Apophatic Theology"
    },
    {
        " has been contrasted with the concept of experiential religion or ": null
    },
    {
        "mystical experience": "Religious Experience"
    },
    {
        " because of a long history or authors living and writing about experience with the divine in a manner that identifies God as unknowable and ineffable, the language of such ideas could be characterized paradoxically as experiential , as well as without the phenomena of experience. The Darkness of God: Negativity in Christian Mysticism by Denys Turner 1998 Cambridge University Press      The notion of religious experience can be traced back to ": null
    },
    {
        "William James": "William James"
    },
    {
        ", who used a term called religious experience in his book,  The Varieties of Religious Experience . The origins of the use of this term can be dated further back.     In the 18th, 19th, and 20th centuries, several historical figures put forth very influential views that religion and its beliefs can be grounded in experience itself. While ": null
    },
    {
        "Kant": "Immanuel Kant"
    },
    {
        " held that ": null
    },
    {
        "moral experience": "Moral Obligation"
    },
    {
        " justified ": null
    },
    {
        "religious beliefs": "Religious Belief"
    },
    {
        ", ": null
    },
    {
        "John Wesley": "John Wesley"
    },
    {
        " in addition to stressing individual moral exertion thought that the religious experiences in the ": null
    },
    {
        "Methodist movement": "Methodist Movement"
    },
    {
        "  were foundational to religious commitment as a way of life. Issues in Science and Religion, ": null
    },
    {
        "Ian Barbour": "Ian Barbour"
    },
    {
        ", ": null
    },
    {
        "Prentice-Hall": "Prentice-Hall"
    },
    {
        ", 1966, pp. 68, 79     ": null
    },
    {
        "Wayne Proudfoot": "Wayne Proudfoot"
    },
    {
        " traces the roots of the notion of religious experience to the German theologian ": null
    },
    {
        "Friedrich Schleiermacher": "Friedrich Schleiermacher"
    },
    {
        " , who argued that religion is based on a feeling of the infinite. The notion of religious experience was used by Schleiermacher and ": null
    },
    {
        "Albert Ritschl": "Albrecht Ritschl"
    },
    {
        " to defend religion against the growing scientific and secular critique, and defend the view that human experience justifies ": null
    },
    {
        "religious beliefs": "Religious Belief"
    },
    {
        ".     Such religious empiricism would be later seen as highly problematic and was  — during the period in-between world wars  — famously rejected by ": null
    },
    {
        "Karl Barth": "Karl Barth"
    },
    {
        ". ": null
    },
    {
        "Issues in Science and Religion": "Issues In Science And Religion"
    },
    {
        ", ": null
    },
    {
        "Ian Barbour": "Ian Barbour"
    },
    {
        ", ": null
    },
    {
        "Prentice-Hall": "Prentice-Hall"
    },
    {
        ", 1966, pp. 114, 116–19 In the 20th century, religious as well as moral experience as justification for religious beliefs still holds sway. Some influential modern scholars holding this ": null
    },
    {
        "liberal theological": "Liberal Christianity"
    },
    {
        " view are ": null
    },
    {
        "Charles Raven": "Charles E. Raven"
    },
    {
        " and the Oxford physicist/theologian ": null
    },
    {
        "Charles Coulson": "Charles Coulson"
    },
    {
        ". ": null
    },
    {
        "Issues in Science and Religion": "Issues In Science And Religion"
    },
    {
        ", ": null
    },
    {
        "Ian Barbour": "Ian Barbour"
    },
    {
        ", ": null
    },
    {
        "Prentice-Hall": "Prentice-Hall"
    },
    {
        ", 1966, pp. 126–27     The notion of religious experience was adopted by many scholars of religion, of whom William James was the most influential.     The notion of experience has been criticised. Robert Sharf points out that experience is a typical Western term, which has found its way into Asian religiosity via western influences. The notion of experience introduces a false notion of duality between experiencer and experienced , whereas the essence of kensho is the realisation of the non-duality of observer and observed. Pure experience does not exist; all experience is mediated by intellectual and cognitive activity. The specific teachings and practices of a specific tradition may even determine what experience someone has, which means that this experience is not the proof of the teaching, but a result of the teaching. A pure consciousness without concepts, reached by cleaning the doors of perception , would be an overwhelming chaos of sensory input without coherence.                 In the Hebrew Bible prayer is an evolving means of interacting with ": null
    },
    {
        "God": "God"
    },
    {
        ", most frequently through a spontaneous, individual, unorganized form of petitioning and/or thanking. Standardized prayer such as is done today is non-existent, although beginning in ": null
    },
    {
        "Deuteronomy": "Deuteronomy"
    },
    {
        ", the Bible lays the groundwork for organized prayer, including basic liturgical guidelines, and by the Bibles later books, prayer has evolved to a more standardized form, although still radically different from the ": null
    },
    {
        "form practiced": "Tefillah"
    },
    {
        " by modern ": null
    },
    {
        "Jews": "Jews"
    },
    {
        ".     Individual prayer is described by the Tanakh two ways. The first of these is when prayer is described as occurring, and a result is achieved, but no further information regarding a persons prayer is given. In these instances, such as with ": null
    },
    {
        "Isaac": "Isaac"
    },
    {
        ",  ": null
    },
    {
        "Moses": "Moses"
    },
    {
        ",  ": null
    },
    {
        "Samuel": "Samuel"
    },
    {
        ",  and ": null
    },
    {
        "Job": "Job"
    },
    {
        ",  the act of praying is a method of changing a situation for the better. The second way in which prayer is depicted is through fully fleshed out episodes of prayer, where a persons prayer is related in full. Many famous biblical personalities have such a prayer, including every major character from ": null
    },
    {
        "Hannah": "Hannah"
    },
    {
        " to ": null
    },
    {
        "Hezekiah": "Hezekiah"
    },
    {
        ". Jewish Encyclopedia, Prayer,  & letterP          In the New Testament prayer is presented as a positive command . The ": null
    },
    {
        "People of God": "People Of God"
    },
    {
        " are challenged to include ": null
    },
    {
        "Christian prayer": "Christian Prayer"
    },
    {
        " in their everyday life, even in the busy struggles of marriage  as it brings people closer to ": null
    },
    {
        "God": "God In Christianity"
    },
    {
        ".     ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        " encouraged his ": null
    },
    {
        "disciples": "Disciple"
    },
    {
        " to pray in secret in their private rooms, using the ": null
    },
    {
        "Lords Prayer": "Lords Prayer"
    },
    {
        ", as a humble response to the prayer of the ": null
    },
    {
        "Pharisees": "Pharisees"
    },
    {
        ", whose practices in prayer were regarded as impious by the New Testament writers .     Throughout the ": null
    },
    {
        "New Testament": "New Testament"
    },
    {
        ", prayer is shown to be Gods appointed method by which we obtain what He has to bestow ": null
    }
]