[
    {
        "Preacher is an ": null
    },
    {
        "American comic book": "American Comic Book"
    },
    {
        " series published by ": null
    },
    {
        "Vertigo": "Vertigo"
    },
    {
        ", an ": null
    },
    {
        "imprint": "Imprint"
    },
    {
        " of ": null
    },
    {
        "DC Comics": "Dc Comics"
    },
    {
        ". The series was created by writer ": null
    },
    {
        "Garth Ennis": "Garth Ennis"
    },
    {
        " and artist ": null
    },
    {
        "Steve Dillon": "Steve Dillon"
    },
    {
        " with painted covers by ": null
    },
    {
        "Glenn Fabry": "Glenn Fabry"
    },
    {
        ".     The series consists of 75 issues in total - 66 regular, monthly issues, five ": null
    },
    {
        "one-shot specials": "One-Shot"
    },
    {
        " and a four-issue Preacher: Saint of Killers ": null
    },
    {
        "limited series": "Limited Series"
    },
    {
        ". The final monthly issue, number 66, was published in October 2000. The entire run has been collected in three series of trade paperbacks, an original run of nine volumes, a second run of six, and three special oversized Absolute volumes.            Preacher tells the story of ": null
    },
    {
        "Jesse Custer": "Jesse Custer"
    },
    {
        ", a preacher in the small ": null
    },
    {
        "Texas": "Texas"
    },
    {
        " town of Annville. Custer is accidentally possessed by the supernatural creature named Genesis, the infant of the unauthorized, unnatural coupling of an angel and a demon. The incident flattens Custers church and kills his entire congregation.     Genesis has no sense of individual will, but since it is composed of both pure goodness and pure evil, its power might rival that of God Himself, making Jesse Custer, bonded to Genesis, potentially the most powerful being in the universe.     Driven by a strong sense of right and wrong, Custer journeys across the United States attempting to literally find God, who abandoned Heaven the moment Genesis was born. He also begins to discover the truth about his new powers. They allow him, when he wills it, to command the obedience of those who hear and comprehend his words. He is joined by his old girlfriend ": null
    },
    {
        "Tulip OHare": "Tulip Ohare"
    },
    {
        ", as well as a hard-drinking Irish vampire named ": null
    },
    {
        "Cassidy": "Cassidy"
    },
    {
        ".     During the course of their journeys, the three encounter enemies and obstacles both sacred and profane, including ": null
    },
    {
        "The Saint of Killers": "The Saint Of Killers"
    },
    {
        ", an invincible, quick-drawing, perfect-aiming, come-lately ": null
    },
    {
        "Angel of Death": "Death"
    },
    {
        " answering only to He who sits on the throne ; a disfigured suicide attempt survivor turned rock-star named Arseface; a serial-killer called the Reaver-Cleaver; The Grail, a secret organization controlling the governments of the world and protecting the bloodline of Jesus; Herr Starr, ostensible Allfather of the Grail, a megalomaniac with a penchant for prostitutes, who wishes to use Custer for his own ends; several fallen angels; and Jesses own ": null
    },
    {
        "redneck": "Redneck"
    },
    {
        " family — particularly his nasty ": null
    },
    {
        "Cajun": "Cajun"
    },
    {
        " grandmother, her mighty bodyguard Jody, and the animal-loving T.C.                                       ": null
    },
    {
        "Garth Ennis": "Garth Ennis"
    },
    {
        ", feeling Preacher would translate perfectly as a film, sold the ": null
    },
    {
        "film rights": "Film Rights"
    },
    {
        " to ": null
    },
    {
        "Electric Entertainment": "Electric Entertainment"
    },
    {
        ". ": null
    },
    {
        "Rachel Talalay": "Rachel Talalay"
    },
    {
        " was hired to direct, with Ennis writing the script. Rupert Harvey and ": null
    },
    {
        "Tom Astor": "Tom Astor"
    },
    {
        " were set as producers. By May 1998, Ennis completed three drafts of the script, based largely on the Gone to Texas story arc.  The filmmakers found it difficult financing Preacher because investors found the idea religiously controversial. Ennis approached ": null
    },
    {
        "Kevin Smith": "Kevin Smith"
    },
    {
        " and ": null
    },
    {
        "Scott Mosier": "Scott Mosier"
    },
    {
        " to help finance the film under their ": null
    },
    {
        "View Askew Productions": "View Askew Productions"
    },
    {
        " banner. Ennis, Smith and Mosier ": null
    },
    {
        "pitch": "Pitch"
    },
    {
        "ed Preacher to ": null
    },
    {
        "Bob Weinstein": "Bob Weinstein"
    },
    {
        " at ": null
    },
    {
        "Miramax Films": "Miramax Films"
    },
    {
        ".     Weinstein was confused by the characterization of ": null
    },
    {
        "Jesse Custer": "Jesse Custer"
    },
    {
        ". Miramax also did not want to share the box office gross with Electric Entertainment, ultimately dropping the pitch. By May 2000, Smith and Mosier were still attached to produce with Talalay directing, but Smith did not know the status of Preacher, feeling it would languish in ": null
    },
    {
        "development hell": "Development Hell"
    },
    {
        ".  By then, Storm Entertainment, a UK-based production company known for their work on ": null
    },
    {
        "independent films": "Independent Films"
    },
    {
        ", joined the production with Electric Entertainment. In September 2001, the two companies announced Preacher had been ": null
    },
    {
        "greenlight": "Greenlight"
    },
    {
        "ed to commence ": null
    },
    {
        "pre-production": "Pre-Production"
    },
    {
        ", with filming to begin in November and Talalay still directing Ennis script.  The production and start dates were pushed back because of financial issues  of the $25 million projected budget.     ": null
    },
    {
        "James Marsden": "James Marsden"
    },
    {
        " was cast in the lead role as Jesse Custer sometime in 2002. He explained, It was something I never knew anything about, but once I got my hands on the comic books, I was blown away by it. In a March 2004 interview, Marsden said the filmmakers were hoping for filming to start the following August.  With the full-length film adaptation eventually abandoned with budgetary concerns, ": null
    },
    {
        "HBO": "Hbo"
    },
    {
        " announced in November 2006 that they commissioned ": null
    },
    {
        "Mark Steven Johnson": "Mark Steven Johnson"
    },
    {
        " and ": null
    },
    {
        "Howard Deutch": "Howard Deutch"
    },
    {
        " to produce a ": null
    },
    {
        "television pilot": "Television Pilot"
    },
    {
        ". Johnson was to write with Deutch directing.  Impressed with Johnsons pilot script, HBO had him write the ": null
    },
    {
        "series bible": "Bible"
    },
    {
        " for the first season.  Johnson originally planned to turn each comic book issue into a single episode on a ": null
    },
    {
        "shot-for-shot": "Shot-For-Shot"
    },
    {
        " basis. I gave the comics, and I said, Every issue is an hour. Garth Ennis said You dont have to be so beholden to the comic. And Im like, No, no, no. Its got to be like the comic.      Johnson also wanted to make sure that ": null
    },
    {
        "one-shots": "One-Shot"
    },
    {
        "were included as well.  Johnson changed his position, citing new storylines conceived by Ennis. Well, there would be nothing new to add if we did that, so Garth and I have been creating new stories for the series, he said. I love the book so much and I was telling Garth that he has to make the stories we are coming up with as comics because I want to see them. By August 2008, new ": null
    },
    {
        "studio executives": "Studio Executive"
    },
    {
        "at HBO decided to abandon the idea, finding it too stylistically dark and religiously controversial.  ": null
    },
    {
        "Columbia Pictures": "Columbia Pictures"
    },
    {
        " then purchased the film rights in October 2008 with ": null
    },
    {
        "Sam Mendes": "Sam Mendes"
    },
    {
        " planned to direct. ": null
    },
    {
        "Neal H. Moritz": "Neal H. Moritz"
    },
    {
        " and Jason Netter would have produced the film. The previous scripts written by Ennis would not have been used.           On November 16, 2013, it was announced that ": null
    },
    {
        "AMC": "Amc"
    },
    {
        " would be shooting a pilot for Preacher.  On November 18, 2013, BleedingCool confirmed that ": null
    },
    {
        "Seth Rogen": "Seth Rogen"
    },
    {
        " and ": null
    },
    {
        "Evan Goldberg": "Evan Goldberg"
    },
    {
        " had developed the series pilot with ": null
    },
    {
        "Sam Catlin": "Sam Catlin"
    },
    {
        ", and that it would be distributed by ": null
    },
    {
        "Sony Pictures Television": "Sony Pictures Television"
    },
    {
        ".   On February 7, 2014 it was made public that AMC was officially developing the series to television based on the pilot written by Seth Rogen and Evan Goldberg. Rogen has no plans to co-star in the series. On May 9, 2014, AMC announced that Preacher was picked up to series.  Preacher was slated to premiere mid to late 2015, as announced by Seth Rogen, with the script for the series complete and the pilot ordered by the studio.    Comic creators ": null
    },
    {
        "Steve Dillon": "Steve Dillon"
    },
    {
        " and ": null
    },
    {
        "Garth Ennis": "Garth Ennis"
    },
    {
        " were to work on this project as co-executive producer.   On April 17, 2015, Seth Rogen tweeted that ": null
    },
    {
        "Dominic Cooper": "Dominic Cooper"
    },
    {
        " was cast in the role of Jesse Custer, ": null
    },
    {
        "Joseph Gilgun": "Joseph Gilgun"
    },
    {
        " as Cassidy, ": null
    },
    {
        "Ruth Negga": "Ruth Negga"
    },
    {
        " as Tulip OHare, Ian Colletti as Arseface, and ": null
    },
    {
        "W. Earl Brown": "W. Earl Brown"
    },
    {
        " as Sheriff Hugo Root. On September 9, 2015, Seth Rogen announced via Twitter that the series ordered to a ten-episode season and was due to premiere in mid-2016.  The series premiered on AMC on Sunday, May 22, 2016. In 2017 a second season, with thirteen episodes, aired. In 2018, a ten-episode third season aired. In November 2018, the series was renewed for a final fourth season, with production relocating to Australia.       ": null
    },
    {
        "Stephen King": "Stephen King"
    },
    {
        " has said that his comic book series  The Dark Tower: The Gunslinger Born  was influenced by Preacher. Kings afterword to  The Dark Tower: The Gunslinger Born      The character Yorick from  Y: The Last Man , has a Zippo lighter with the words Fuck Communism engraved, identical to the one owned by Jesse Custer in Preacher. When asked about it he says its from this book I read once... a graphic novel. You know, like a comic book. The phrase originated as a 1963 satirical poster produced by  The Realist  magazines ": null
    },
    {
        "Paul Krassner": "Paul Krassner"
    },
    {
        ". Realist Archive Project ,  This lighter appears later in the series when Yorick and Agent 355 are being held by Russian agents at gunpoint, who find the lighter and take offense to it. Also, in volume 4 Safeword , Yorick says pardners , which is used several times in Preacher, in lieu of partners . Y: The Last Man, 55, May 2007     ": null
    },
    {
        "IGN": "Ign"
    },
    {
        " declared Preacher the third-greatest Vertigo comic, after  Saga of the Swamp Thing  and  Sandman .      Jesse Custer was ranked the 11th Greatest Comic Book Character by  Empire  magazine. , The 50 Greatest Comic Book Characters ,  Empire , accessed April 26, 2011. The Saint of Killers was ranked at number 42 on the same list. , The 50 Greatest Comic Book Characters , Empire": null
    }
]