[
    {
        "   Protactinium  is a ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        " Pa and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " 91. It is a dense, silvery-gray ": null
    },
    {
        "actinide": "Actinide"
    },
    {
        " metal which readily reacts with ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        ", water vapor and inorganic ": null
    },
    {
        "acids": "Acid"
    },
    {
        ". It forms various ": null
    },
    {
        "chemical compounds": "Chemical Compound"
    },
    {
        " in which protactinium is usually present in the ": null
    },
    {
        "oxidation state": "Oxidation State"
    },
    {
        " +5, but it can also assume +4 and even +3 or +2 states. Concentrations of protactinium in the Earths crust are typically a few parts per trillion, but may reach up to a few parts per million in some ": null
    },
    {
        "uraninite": "Uraninite"
    },
    {
        " ore deposits. Because of its scarcity, high radioactivity and high toxicity, there are currently no uses for protactinium outside scientific research, and for this purpose, protactinium is mostly extracted from spent ": null
    },
    {
        "nuclear fuel": "Nuclear Fuel"
    },
    {
        ".     Protactinium was first identified in 1913 by ": null
    },
    {
        "Kasimir Fajans": "Kasimir Fajans"
    },
    {
        " and ": null
    },
    {
        "Oswald Helmuth Göhring": "Oswald Helmuth Göhring"
    },
    {
        " and named brevium because of the short ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of the specific ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        " studied, i.e. protactinium-234. A more stable isotope of protactinium, 231 Pa, was discovered in 1917/18 by ": null
    },
    {
        "Otto Hahn": "Otto Hahn"
    },
    {
        " and ": null
    },
    {
        "Lise Meitner": "Lise Meitner"
    },
    {
        ", and they chose the name proto-actinium, but the ": null
    },
    {
        "IUPAC": "Iupac"
    },
    {
        " finally named it protactinium in 1949 and confirmed Hahn and Meitner as discoverers. The new name meant ": null
    },
    {
        "precursor": "Precursor"
    },
    {
        "  of ": null
    },
    {
        "actinium": "Actinium"
    },
    {
        " and reflected that actinium is a product of radioactive decay of protactinium. ": null
    },
    {
        "John Arnold Cranston": "John Arnold Cranston"
    },
    {
        "  is also credited with discovering the most stable isotope in 1915, but delayed his announcement due to being called up for service in the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ". . ": null
    },
    {
        "University of Glasgow": "University Of Glasgow"
    },
    {
        "     The longest-lived and most abundant naturally occurring ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        " of protactinium, protactinium-231, has a ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of 32,760 years and is a decay product of ": null
    },
    {
        "uranium-235": "Uranium-235"
    },
    {
        ". Much smaller trace amounts of the short-lived protactinium-234 and its ": null
    },
    {
        "nuclear isomer": "Nuclear Isomer"
    },
    {
        " protactinium-234m occur in the decay chain of ": null
    },
    {
        "uranium-238": "Uranium-238"
    },
    {
        ". Protactinium-233 results from the decay of ": null
    },
    {
        "thorium": "Thorium"
    },
    {
        "-233 as part of the chain of events used to produce ": null
    },
    {
        "uranium-233": "Uranium-233"
    },
    {
        " by neutron irradiation of thorium-232. It is an undesired intermediate product in thorium-based ": null
    },
    {
        "nuclear reactors": "Nuclear Reactor"
    },
    {
        " and is therefore removed from the active zone of the reactor during the breeding process. Analysis of the relative concentrations of various uranium, thorium and protactinium isotopes in water and minerals is used in ": null
    },
    {
        "radiometric dating": "Radiometric Dating"
    },
    {
        " of ": null
    },
    {
        "sediments": "Sediment"
    },
    {
        " which are up to 175,000 years old and in modeling of various geological processes.          In 1871, ": null
    },
    {
        "Dmitri Mendeleev": "Dmitri Mendeleev"
    },
    {
        " predicted": "Mendeleevs Predicted Elements"
    },
    {
        " the existence of an element between ": null
    },
    {
        "thorium": "Thorium"
    },
    {
        " and ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        ". The actinide element group was unknown at the time. Therefore, uranium was positioned below ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        " in group VI, and thorium below ": null
    },
    {
        "zirconium": "Zirconium"
    },
    {
        " in group IV, leaving the space below ": null
    },
    {
        "tantalum": "Tantalum"
    },
    {
        " in group V empty and, until the 1950s, ": null
    },
    {
        "periodic tables": "Periodic Table"
    },
    {
        " were published with this structure.  For a long time chemists searched for eka-tantalum as an element with similar chemical properties to tantalum, making a discovery of protactinium nearly impossible. Tantalums heavier analogue was later found to be the transuranic element ": null
    },
    {
        "dubnium": "Dubnium"
    },
    {
        " – which, however, does not react like tantalum, but like protactinium.      In 1900, ": null
    },
    {
        "William Crookes": "William Crookes"
    },
    {
        " isolated protactinium as an intensely radioactive material from uranium; however, he could not characterize it as a new chemical element and thus named it uranium-X .     Crookes dissolved ": null
    },
    {
        "uranium nitrate": "Uranium Nitrate"
    },
    {
        " in ": null
    },
    {
        "ether": "Diethyl Ether"
    },
    {
        ", and the residual aqueous phase contains most of the  and . His method was still used in the 1950s to isolate  and  from uranium compounds.  Protactinium was first identified in 1913, when ": null
    },
    {
        "Kasimir Fajans": "Kasimir Fajans"
    },
    {
        " and ": null
    },
    {
        "Oswald Helmuth Göhring": "Oswald Helmuth Göhring"
    },
    {
        " encountered the isotope 234 Pa during their studies of the decay chains of ": null
    },
    {
        "uranium-238": "Uranium-238"
    },
    {
        " →  →  → . They named the new element brevium  because of its short half-life, 6.7 hours for . ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1250 ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1254   ": null
    },
    {
        "Eric Scerri": "Eric Scerri"
    },
    {
        ", A tale of seven elements, , p.67–74 In 1917/18, two groups of scientists, ": null
    },
    {
        "Otto Hahn": "Otto Hahn"
    },
    {
        " and ": null
    },
    {
        "Lise Meitner": "Lise Meitner"
    },
    {
        " of ": null
    },
    {
        "Germany": "Germany"
    },
    {
        " and ": null
    },
    {
        "Frederick Soddy": "Frederick Soddy"
    },
    {
        " and John Cranston of ": null
    },
    {
        "Great Britain": "Great Britain"
    },
    {
        ", independently discovered another isotope of protactinium, 231 Pa, having a much longer half-life of about 32,000 years. Thus the name brevium was changed to protoactinium as the new element was part of the decay chain of uranium-235 as the parent of actinium . For ease of pronunciation, the name was shortened to protactinium by the ": null
    },
    {
        "IUPAC": "International Union Of Pure And Applied Chemistry"
    },
    {
        " in 1949. ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1251 The discovery of protactinium completed one of the last gaps in the early versions of the periodic table, proposed by Mendeleev in 1869, and it brought to fame the involved scientists. Shea, William R. , Springer, p. 213, .     ": null
    },
    {
        "Aristid von Grosse": "Aristid Von Grosse"
    },
    {
        " produced 2  milligrams of Pa 2 O 5 in 1927,  and in 1934 first isolated elemental protactinium from 0.1  milligrams of Pa 2 O 5 .  He used two different procedures: in the first one, protactinium oxide was irradiated by 35  keV electrons in vacuum. In another method, called the ": null
    },
    {
        "van Arkel–de Boer process": "Crystal Bar Process"
    },
    {
        ", the oxide was chemically converted to a ": null
    },
    {
        "halide": "Halide"
    },
    {
        "  and then reduced in a vacuum with an electrically heated metallic filament:      : 2 PaI 5 → 2 Pa + 5 I 2     In 1961, the ": null
    },
    {
        "United Kingdom Atomic Energy Authority": "United Kingdom Atomic Energy Authority"
    },
    {
        " produced 127  grams of 99.9% pure protactinium-231 by processing 60  tonnes of waste material in a 12-stage process, at a cost of about 500,000  USD. For many years, this was the worlds only significant supply of protactinium, which was provided to various laboratories for scientific studies. ": null
    },
    {
        "Oak Ridge National Laboratory": "Oak Ridge National Laboratory"
    },
    {
        " in the US provided protactinium at a cost of about 280  USD/gram.  from ": null
    },
    {
        "Los Alamos National Laboratory": "Los Alamos National Laboratory"
    },
    {
        ".           Twenty-nine ": null
    },
    {
        "radioisotopes": "Radioisotope"
    },
    {
        " of protactinium have been discovered, the most stable being 231 Pa with a ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of 32,760 years, 233 Pa with a half-life of 27 days, and 230 Pa with a half-life of 17.4 days. All of the remaining isotopes have half-lives shorter than 1.6 days, and the majority of these have half-lives less than 1.8 seconds. Protactinium also has two ": null
    },
    {
        "nuclear isomers": "Nuclear Isomer"
    },
    {
        ", 217m Pa and 234m Pa .      The primary ": null
    },
    {
        "decay mode": "Decay Mode"
    },
    {
        " for isotopes of protactinium lighter than the most stable isotope 231 Pa is ": null
    },
    {
        "alpha decay": "Alpha Decay"
    },
    {
        " and the primary mode for the heavier isotopes is ": null
    },
    {
        "beta decay": "Beta Decay"
    },
    {
        ". The primary ": null
    },
    {
        "decay products": "Decay Product"
    },
    {
        " of isotopes of protactinium lighter than 231 Pa are ": null
    },
    {
        "actinium": "Actinium"
    },
    {
        " isotopes and the primary decay products for the heavier isotopes of protactinium are ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        " isotopes.       Protactinium is one of the rarest and most expensive naturally occurring elements. It is found in the form of two isotopes – 231 Pa and 234 Pa, with the isotope 234 Pa occurring in two different energy states. Nearly all natural protactinium is protactinium-231. It is an ": null
    },
    {
        "alpha emitter": "Alpha Particle"
    },
    {
        " and is formed by the decay of uranium-235, whereas the ": null
    },
    {
        "beta radiating": "Beta Particle"
    },
    {
        " protactinium-234 is produced as a result of ": null
    },
    {
        "uranium-238 decay": ":File:Decay Chain.Png"
    },
    {
        ". Nearly all uranium-238 decays first to the shorter-lived 234m Pa isomer.  , Argonne National Laboratory, Human Health Fact Sheet, August 2005     Protactinium occurs in ": null
    },
    {
        "uraninite": "Uraninite"
    },
    {
        " at concentrations of about 0.3-3 ": null
    },
    {
        "parts": "Parts-Per Notation"
    },
    {
        " 231 Pa per million parts of ore. Whereas the usual content is closer to 0.3 ppm , some ores from the ": null
    },
    {
        "Democratic Republic of the Congo": "Democratic Republic Of The Congo"
    },
    {
        " have about 3 ppm. Protactinium is homogeneously dispersed in most natural materials and in water, but at much lower concentrations on the order of one part per trillion, that corresponds to the radioactivity of 0.1 picocuries /g. There is about 500 times more protactinium in sandy soil particles than in water, even the water present in the same sample of soil. Much higher ratios of 2,000 and above are measured in ": null
    },
    {
        "loam": "Loam"
    },
    {
        " soils and clays, such as ": null
    },
    {
        "bentonite": "Bentonite"
    },
    {
        ". Cornelis, Rita , John Wiley and Sons, pp. 520–521, .       Two major protactinium isotopes, 231 Pa and 233 Pa, are produced from thorium in ": null
    },
    {
        "nuclear reactors": "Nuclear Reactor"
    },
    {
        "; both are undesirable and are usually removed, thereby adding complexity to the reactor design and operation. In particular, 232 Th via  reactions produces 231 Th which quickly decays to 231 Pa. The last isotope, while not a transuranic waste, has a long half-life of 32,760 years and is a major contributor to the long-term ": null
    },
    {
        "radiotoxic": "Radiotoxic"
    },
    {
        "ity of spent nuclear fuel.     Protactinium-233 is formed upon neutron capture by 232 Th. It further either decays to uranium-233 or captures another neutron and converts into the non-fissile uranium-234.  233 Pa has a relatively long half-life of 27 days and high ": null
    },
    {
        "cross section": "Cross Section"
    },
    {
        " for neutron capture . Thus, instead of rapidly decaying to the useful 233 U, a significant fraction of 233 Pa converts to non-fissile isotopes and consumes neutrons, degrading ": null
    },
    {
        "the reactor efficiency": "Neutron Economy"
    },
    {
        ". To avoid this, 233 Pa is extracted from the active zone of thorium ": null
    },
    {
        "molten salt reactors": "Molten Salt Reactor"
    },
    {
        " during their operation, so that it only decays to 233 U. This is achieved using several meters tall columns of molten ": null
    },
    {
        "bismuth": "Bismuth"
    },
    {
        " with lithium dissolved in it. In a simplified scenario, lithium selectively reduces protactinium salts to protactinium metal which is then extracted from the molten-salt cycle, and bismuth is merely a carrier. It is chosen because of its low ": null
    },
    {
        "melting point": "Melting Point"
    },
    {
        " , low vapor pressure, good solubility for lithium and actinides, and immiscibility with molten ": null
    },
    {
        "halides": "Halide"
    },
    {
        ". Groult, Henri , Elsevier, pp. 562–565, .          Before the advent of nuclear reactors, protactinium was separated for scientific experiments from uranium ores. Nowadays, it is mostly produced as an intermediate product of ": null
    },
    {
        "nuclear fission": "Nuclear Fission"
    },
    {
        " in thorium high-temperature reactors:     : Th + n - ": null
    }
]