[
    {
        "           Pāramitā  or pāramī is perfection or completeness . While, technically, pāramī and pāramitā are both Pāli terms, ": null
    },
    {
        "Pali literature": "Pali Literature"
    },
    {
        " makes far greater reference to pāramī.       ": null
    },
    {
        "Donald S. Lopez, Jr.": "Donald S. Lopez, Jr."
    },
    {
        " describes the etymology of the term:          Theravada teachings on the pāramīs can be found in late canonical books and post-canonical ": null
    },
    {
        "commentaries": "Atthakatha"
    },
    {
        ".       In the ": null
    },
    {
        "Pāli Canon": "Pāli Canon"
    },
    {
        ", the  Buddhavaṃsa  of the  Khuddaka Nikāya  lists the ten perfections  as:      Dāna pāramī : generosity, giving of oneself    Sīla pāramī : virtue, morality, proper conduct    Nekkhamma pāramī : renunciation    Paññā pāramī : transcendental wisdom, insight, discernment    Viriya pāramī : energy, diligence, vigour, effort    Khanti pāramī : patience, tolerance, forbearance, acceptance, endurance    Sacca pāramī : truthfulness, honesty    Adhiṭṭhāna pāramī : determination, resolution    Mettā pāramī : goodwill, friendliness, loving-kindness    Upekkhā pāramī : equanimity, serenity     Two of the above ": null
    },
    {
        "virtue": "Virtue"
    },
    {
        "s, mettā and upekkhā, also are ": null
    },
    {
        "brahmavihāras": "Brahmavihara"
    },
    {
        ".       The Theravādin teachings on the pāramīs can be found in canonical books  and post-canonical ": null
    },
    {
        "commentaries": "Atthakatha"
    },
    {
        " written to supplement the Pāli Canon at a later time, and thus might not be an original part of the Theravādin teachings. Prose portions of the Jātakas originally did not form part of scriptures : Nalinaksha Dutt Buddhist Sects in India. Motilal Banarsidass Publishers , 2nd Edition: 224 Regarding the Cariyāpiṭaka, Horner , Cariyāpiṭaka section, p. vi, writes that it is nsidered to be post-": null
    },
    {
        "Asoka": "Asoka"
    },
    {
        "n.... The oldest parts of the  Sutta Piṭaka   do not have any mention of the pāramīs as a category . early literature did not refer to the pāramitās. Nalinaksha Dutt Buddhist Sects in India. Motilal Banarsidass Publishers , 2nd Edition: 228     Some scholars even refer to the teachings of the pāramīs as a semi-Mahāyāna teaching added to the scriptures at a later time in order to appeal to the interests and needs of the lay community and to popularize their religion. The incorporation of pāramis by the Theravādins in the Jātakas reveals that they were not immune from Mahāyānic influence. This happened, of course, at a much later date Nalinaksha Dutt Buddhist Sects in India. Motilal Banarsidass Publishers , 2nd Edition: 219 It is evident that the Hinayānists, either to popularize their religion or to interest the laity more in it, incorporated in their doctrines the conception of Bodhisattva and the practice of pāramitās. This was effected by the production of new literature: the Jātakas and Avadānas. Nalinaksha Dutt Buddhist Sects in India. Motilal Banarsidass Publishers , 2nd Edition: 251. The term Semi-Mahāyāna occurs here as a subtitle. However, these views rely on the early scholarly presumption of Mahāyāna originating with religious devotion and appeal to laity. More recently, scholars have started to open up early Mahāyāna literature, which is very ascetic and expounds the ideal of the monks life in the forest. As scholars have moved away from this limited corpus, and have begun to explore a wider range of Mahāyāna sutras, they have stumbled on, and have started to open up, a literature that is often stridently ascetic and heavily engaged in reinventing the forest ideal, an individualistic, antisocial, ascetic ideal that is encapsulated in the apparently resurrected image of wandering alone like a rhinoceros. Macmillan Encyclopedia of Buddhism : p. 494 Therefore, the practice of the pāramitās in Mahāyāna Buddhism may have been close to the ideals of the ascetic tradition of the ": null
    },
    {
        "śramaṇa": "Śramaṇa"
    },
    {
        ".       Bodhi maintains that, in the earliest Buddhist texts , those seeking ": null
    },
    {
        "the extinction of suffering": "Nirvana"
    },
    {
        "  pursued the ": null
    },
    {
        "noble eightfold path": "Noble Eightfold Path"
    },
    {
        ". As time went on, a ": null
    },
    {
        "backstory": "Backstory"
    },
    {
        " was provided for the ": null
    },
    {
        "multi-life": "Rebirth"
    },
    {
        " development of the ": null
    },
    {
        "Buddha": "Gautama Buddha"
    },
    {
        "; as a result, the ten perfections were identified as part of the path for the ": null
    },
    {
        "bodhisattva": "Bodhisattva"
    },
    {
        " . Over subsequent centuries, the pāramīs were seen as being significant for aspirants to both Buddhahood and ": null
    },
    {
        "arahantship": "Arhat"
    },
    {
        ". Bodhi summarizes:              In ": null
    },
    {
        "Mahāyāna": "Mahayana"
    },
    {
        " Buddhism, the ": null
    },
    {
        "Prajñapāramitā sūtras": "Prajnaparamita"
    },
    {
        ", the  Lotus Sutra  and a large number of other texts list the six perfections:      Dāna pāramitā    Śīla pāramitā    pāramitā    Vīrya pāramitā    Dhyāna pāramitā    Prajñā pāramitā     Note that this list is also mentioned by the Theravāda commentator ": null
    },
    {
        "Dhammapala": "Dhammapala"
    },
    {
        ", who says it is equivalent to the above list of ten. The passage is translated in Bodhi , p. 314.     In the  Ten Stages Sutra , four more pāramitās are listed:     :7.  Upāya pāramitā": null
    }
]