[
    {
        "          In ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        ", a queue is a ": null
    },
    {
        "collection": "Collection"
    },
    {
        " of entities that are maintained in a sequence and can be modified by the addition of entities at one end of the sequence and removal from the other end of the sequence. By convention, the end of the sequence at which elements are added is called the back or rear of the queue and the end at which elements are removed is called the head or front of the queue, analogously to the words used when people line up to wait for goods or services. The operation of adding an element to the rear of the queue is known as enqueue, and the operation of removing an element from the front is known as dequeue. Other operations may also be allowed, often including a  peek  or front operation that returns the value of the next element to be dequeued without dequeuing it.     The operations of a queue make it a ": null
    },
    {
        "first-in-first-out data structure": "Fifo"
    },
    {
        ". In a FIFO data structure, the first element added to the queue will be the first one to be removed. This is equivalent to the requirement that once a new element is added, all elements that were added before have to be removed before the new element can be removed. A queue is an example of a ": null
    },
    {
        "linear data structure": "Linear Data Structure"
    },
    {
        ", or more abstractly a sequential collection.   Queues are common in computer programs, where they are implemented as data structures coupled with access routines, as an ": null
    },
    {
        "abstract data structure": "Abstract Data Structure"
    },
    {
        " or in object-oriented languages as classes. Common implementations are ": null
    },
    {
        "circular buffers": "Circular Buffer"
    },
    {
        " and ": null
    },
    {
        "linked lists": "Linked List"
    },
    {
        ".     Queues provide services in ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        ", ": null
    },
    {
        "transport": "Transport"
    },
    {
        ", and ": null
    },
    {
        "operations research": "Operations Research"
    },
    {
        " where various entities such as data, objects, persons, or events are stored and held to be processed later. In these contexts, the queue performs the function of a ": null
    },
    {
        "buffer": "Buffer"
    },
    {
        ".   Another usage of queues is in the implementation of ": null
    },
    {
        "breadth-first search": "Breadth-First Search"
    },
    {
        ".     Queue implementation": null
    },
    {
        "pointers": "Pointer"
    },
    {
        " can implement or come with libraries for dynamic lists. Such ": null
    },
    {
        "data structures": "Data Structure"
    },
    {
        " may have not specified fixed capacity limit besides memory constraints. Queue overflow results from trying to add an element onto a full queue and queue underflow happens when trying to remove an element from an empty queue.     A bounded queue is a queue limited to a fixed number of items.      There are several efficient implementations of FIFO queues. An efficient implementation is one that can perform the operations—enqueuing and dequeuing—in ": null
    },
    {
        "O time": "Big O Notation"
    },
    {
        ".   ": null
    },
    {
        "Linked list": "Linked List"
    },
    {
        " doubly linked list": "Doubly Linked List"
    },
    {
        " has O insertion and deletion at both ends, so it is a natural choice for queues.   A regular singly linked list only has efficient insertion and deletion at one end. However, a small modification—keeping a pointer to the last node in addition to the first one—will enable it to implement an efficient queue.   A ": null
    },
    {
        "deque": "Double-Ended Queue"
    },
    {
        " implemented using a modified dynamic array       Queues may be implemented as a separate data type, or may be considered a special case of a ": null
    },
    {
        "double-ended queue": "Double-Ended Queue"
    },
    {
        " and not implemented separately. For example, ": null
    },
    {
        "Perl": "Perl"
    },
    {
        " and ": null
    },
    {
        "Ruby": "Ruby"
    },
    {
        " allow pushing and popping an array from both ends, so one can use push and unshift functions to enqueue and dequeue a list , although in some cases these operations are not efficient.     C++s ": null
    },
    {
        "Standard Template Library": "Standard Template Library"
    },
    {
        " provides a queue templated class which is restricted to only push/pop operations. Since J2SE5.0, Javas library contains a  interface that specifies queue operations; implementing classes include  and . PHP has an  class and third party libraries like ": null
    },
    {
        "beanstalkd": "Beanstalkd"
    },
    {
        " and ": null
    },
    {
        "Gearman": "Gearman"
    },
    {
        ".       A simple queue implemented in ": null
    },
    {
        "Ruby": "Ruby"
    }
]