[
    {
        "The connection between race and intelligence has been a subject of debate in both ": null
    },
    {
        "popular science": "Popular Science"
    },
    {
        " and ": null
    },
    {
        "academic research": "Academic Research"
    },
    {
        " since the inception of ": null
    },
    {
        "IQ": "Intelligence Quotient"
    },
    {
        " testing in the early 20th century. There remains some debate as to whether and to what extent differences in intelligence test scores reflect environmental factors as opposed to genetic ones, as well as to the definitions of what race and intelligence are, and whether they can be objectively defined. Currently, there is no non-": null
    },
    {
        "circumstantial evidence": "Circumstantial Evidence"
    },
    {
        " that these differences in test scores have a genetic component, although some researchers believe that the existing circumstantial evidence makes it at least plausible that hard evidence for a genetic component will eventually be found.     The first test showing differences in IQ test results between different population groups in the US was the tests of United States Army recruits in World War I. In the 1920s, groups of eugenics lobbyists argued that this demonstrated that African-Americans and certain immigrant groups were of inferior intellect to Anglo-Saxon whites due to innate biological differences, using this as an argument for policies of racial segregation. Soon, other studies appeared, contesting these conclusions and arguing instead that the Army tests had not adequately controlled for environmental factors such as socio-economic and educational ": null
    },
    {
        "inequality between blacks and whites": "Racial Inequality In The United States"
    },
    {
        ".     The debate reemerged again in 1969, when ": null
    },
    {
        "Arthur Jensen": "Arthur Jensen"
    },
    {
        " championed the view that for genetic reasons, Africans were less intelligent than whites and that ": null
    },
    {
        "compensatory education": "Compensatory Education"
    },
    {
        " for African-American children was therefore doomed to be ineffective. In 1994, the book  The Bell Curve  argued that social inequality in the United States could largely be explained as a result of IQ differences between races and individuals, and rekindled the public and scholarly debate with renewed force. During the debates following the books publication, the ": null
    },
    {
        "American Anthropological Association": "American Anthropological Association"
    },
    {
        " and the ": null
    },
    {
        "American Psychological Association": "American Psychological Association"
    },
    {
        " published official statements regarding the issue, both highly skeptical of many of the books claims, and the APA report called for more empirical research on the issue.                  Claims of races having different intelligence were used to justify ": null
    },
    {
        "colonialism": "Colonialism"
    },
    {
        ", ": null
    },
    {
        "slavery": "Slavery"
    },
    {
        ", ": null
    },
    {
        "racism": "Racism"
    },
    {
        ", ": null
    },
    {
        "social Darwinism": "Social Darwinism"
    },
    {
        ", and racial ": null
    },
    {
        "eugenic": "Eugenic"
    },
    {
        "s. Racial thinkers such as ": null
    },
    {
        "Arthur de Gobineau": "Arthur De Gobineau"
    },
    {
        " relied crucially on the assumption that black people were innately inferior to whites in developing their ideologies of ": null
    },
    {
        "white supremacy": "White Supremacy"
    },
    {
        ". Even enlightenment thinkers such as ": null
    },
    {
        "Thomas Jefferson": "Thomas Jefferson"
    },
    {
        ", a slave owner, believed blacks to be innately inferior to whites in physique and intellect.       The first practical intelligence test was developed between 1905 and 1908 by ": null
    },
    {
        "Alfred Binet": "Alfred Binet"
    },
    {
        " in France for school placement of children. Binet warned that results from his test should not be assumed to measure innate intelligence or used to label individuals permanently. Binets test was translated into English and revised in 1916 by ": null
    },
    {
        "Lewis Terman": "Lewis Terman"
    },
    {
        " and published under the name the ": null
    },
    {
        "Stanford–Binet Intelligence Scales": "Stanford–Binet Intelligence Scales"
    },
    {
        ". As Termans test was published, there was great concern in the United States about the abilities and skills of recent immigrants. Different immigrant nationalities were sometimes thought to belong to different races, such as ": null
    },
    {
        "Slavs": "Slavs"
    },
    {
        ". A different set of tests developed by ": null
    },
    {
        "Robert Yerkes": "Robert Yerkes"
    },
    {
        " were used to evaluate draftees for World War I, and researchers found that people from southern and eastern Europe scored lower than native-born Americans, that Americans from northern states had higher scores than Americans from southern states, and that black Americans scored lower than white Americans. The results were widely publicized by a lobby of anti-immigration activists, including the New York patrician and conservationist ": null
    },
    {
        "Madison Grant": "Madison Grant"
    },
    {
        ", who considered the ": null
    },
    {
        "Nordic race": "Nordic Race"
    },
    {
        " to be superior, but under threat of immigration by inferior breeds. In his influential work, A Study of American Intelligence, psychologist ": null
    },
    {
        "Carl Brigham": "Carl Brigham"
    },
    {
        " used the results of the Army tests to argue for a stricter immigration policy, limiting immigration to countries considered to belong to the Nordic race .     In the 1920s, states like Virginia enacted ": null
    },
    {
        "eugenic": "Eugenic"
    },
    {
        " laws, such as its ": null
    },
    {
        "1924 Racial Integrity Act": "Racial Integrity Act Of 1924"
    },
    {
        ", which established the ": null
    },
    {
        "one-drop rule": "One-Drop Rule"
    },
    {
        " as law. Many scientists reacted negatively to eugenicist claims linking abilities and moral character to racial or genetic ancestry. They pointed to the contribution of environment to test results . By the mid-1930s, many United States psychologists adopted the view that environmental and cultural factors played a dominant role in IQ test results, among them Carl Brigham, who repudiated his own previous arguments on the grounds that he realized that the tests were not a measure of innate intelligence. Discussion of the issue in the United States also influenced ": null
    },
    {
        "German": "Germans"
    },
    {
        " Nazi": "Nazi"
    },
    {
        " claims of the Nordics being a ": null
    },
    {
        "master race": "Master Race"
    },
    {
        " , influenced by Grants writings. As the American public sentiment shifted against the Germans, claims of racial differences in intelligence increasingly came to be regarded as problematic.  Anthropologists such as ": null
    },
    {
        "Franz Boas": "Franz Boas"
    },
    {
        ", and ": null
    },
    {
        "Ruth Benedict": "Ruth Benedict"
    },
    {
        " and ": null
    },
    {
        "Gene Weltfish": "Gene Weltfish"
    },
    {
        ", did much to demonstrate the unscientific status of many of the claims about racial hierarchies of intelligence. Nonetheless, a powerful eugenics and segregation lobby funded largely by textile-magnate ": null
    },
    {
        "Wickliffe Draper": "Wickliffe Draper"
    },
    {
        " continued to publicize studies using intelligence studies as an argument for eugenics, segregation, and anti-immigration legislation.          As the de-segregation of the American South gained traction in the 1950s, the debate about black intelligence resurfaced. ": null
    },
    {
        "Audrey Shuey": "Audrey Shuey"
    },
    {
        ", funded by Drapers ": null
    },
    {
        "Pioneer Fund": "Pioneer Fund"
    },
    {
        ", published a new analysis of Yerkes tests, concluding that blacks really were of inferior intellect to whites. This study was used by segregationists as an argument that it was to the advantage of black children to be educated separately from the superior white children. In the 1960s, the debate was further revived when ": null
    },
    {
        "William Shockley": "William Shockley"
    },
    {
        " publicly defended the argument that black children were innately unable to learn as well as white children. ": null
    },
    {
        "Arthur Jensen": "Arthur Jensen"
    },
    {
        " stimulated scholarly discussion of the issue with his  Harvard Educational Review  article, ": null
    },
    {
        "How Much Can We Boost IQ and Scholastic Achievement?": "How Much Can We Boost Iq And Scholastic Achievement?"
    },
    {
        "   Jensens article questioned remedial education for African-American children; he suggested their poor educational performance reflected an underlying genetic cause rather than lack of stimulation at home. Jensen continued to publish on the issue until his death in 2012.     Bell Curve debate The Bell Curve  , a book by ": null
    },
    {
        "Richard Herrnstein": "Richard Herrnstein"
    },
    {
        " and ": null
    },
    {
        "Charles Murray": "Charles Murray"
    },
    {
        ", who strongly emphasized the societal effects of low IQ . In 1994, a group of 52 researchers signed an editorial statement ": null
    },
    {
        "Mainstream Science on Intelligence": "Mainstream Science On Intelligence"
    },
    {
        " in response to the book. The Bell Curve also led to a 1995 report from the ": null
    },
    {
        "American Psychological Association": "American Psychological Association"
    },
    {
        ", ": null
    },
    {
        "Intelligence: Knowns and Unknowns": "Intelligence: Knowns And Unknowns"
    },
    {
        " , acknowledging a difference between mean IQ scores of whites and blacks as well as the absence of any adequate explanation of it, either environmental or genetic. The Bell Curve prompted the publication of several multiple-author books responding from a variety of points of view.  They include  The Bell Curve Debate  ,  Inequality by Design: Cracking the Bell Curve Myth  and a second edition of  The Mismeasure of Man  by ": null
    },
    {
        "Stephen Jay Gould": "Stephen Jay Gould"
    },
    {
        ". Jensens last book-length publication,  The g Factor: The Science of Mental Ability , was published a few years later in 1998.     The review article Thirty Years of Research on Race Differences in Cognitive Ability by ": null
    },
    {
        "Rushton": "J. Philippe Rushton"
    },
    {
        " and Jensen was published in 2005. The article was followed by a series of responses, some in support, some critical.  ": null
    },
    {
        "Richard Nisbett": "Richard Nisbett"
    },
    {
        ", another psychologist who had also commented at the time, later included an amplified version of his critique as part of the book Intelligence and How to Get It: Why Schools and Cultures Count .  Rushton and Jensen in 2010 made a point-by-point reply to this thereafter.  A comprehensive review article on the issue was published in the journal American Psychologist in 2012.     Some of the authors proposing genetic explanations for group differences have received funding from the ": null
    },
    {
        "Pioneer Fund": "Pioneer Fund"
    },
    {
        ", which was headed by Rushton until his death in 2012.    The ": null
    },
    {
        "Southern Poverty Law Center": "Southern Poverty Law Center"
    },
    {
        " lists the Pioneer Fund as a ": null
    },
    {
        "hate group": "Hate Group"
    },
    {
        ", citing the funds history, its funding of race and intelligence research, and its connections with ": null
    },
    {
        "racist": "Racist"
    },
    {
        " individuals. Other researchers have criticized the Pioneer Fund for promoting ": null
    },
    {
        "scientific racism": "Scientific Racism"
    },
    {
        ", ": null
    },
    {
        "eugenics": "Eugenics"
    },
    {
        " and ": null
    },
    {
        "white supremacy": "White Supremacy"
    },
    {
        ".             g and IQ tests   The concept of intelligence and the degree to which intelligence is measurable is a matter of debate. While there is some consensus about how to define intelligence, it is not universally accepted that it is something that can be unequivocally measured by a single figure.  A recurring criticism is that different societies value and promote different kinds of skills and that the concept of intelligence is therefore culturally variable and cannot be measured by the same criteria in different societies. Consequently, some critics argue that proposed relationships to other variables are necessarily tentative.      In relation to the study of racial differences in IQ test scores, it becomes a crucial question of what exactly it is that IQ tests measure. Arthur Jensen was a proponent of the view that there is a correlation between scores on all the known types of IQ tests, and that this correlation points to an underlying factor of ": null
    },
    {
        "general intelligence": "General Intelligence"
    },
    {
        ", or g. In most conceptions of g, it is considered to be fairly fixed in a given individual and unresponsive to training or other environmental influences. In this view, test score differences, especially in those tasks considered to be particularly g-loaded , reflect the test takers innate capability.     Other psychometricians argue that, while there may or may not be a general intelligence factor, performance on tests relies crucially on knowledge acquired through prior exposure to the types of tasks that such tests contain. This view would mean that tests cannot be expected to reflect only the innate abilities of a given individual, because the expression of potential will always be mediated by experience and cognitive habits. It also means that comparison of test scores from persons with widely different life experiences and cognitive habits is not an expression of their relative innate potentials.          The majority of anthropologists today consider race to be a sociopolitical phenomenon rather than a biological one, a view supported by considerable genetics research.  The current mainstream view in the social sciences and biology is that race is a social construction based on folk ideologies that construct groups based on social disparities and superficial physical characteristics.   state, Race is a socially constructed concept, not a biological one. It derives from peoples desire to classify. The concept of human races as natural and separate divisions within the human species has also been rejected by the ": null
    },
    {
        "American Anthropological Association": "American Anthropological Association"
    },
    {
        ". The official position of the AAA, adopted in 1998, is that advances in scientific knowledge have made it clear that human populations are not unambiguous, clearly demarcated, biologically distinct groups and that any attempt to establish lines of division among biological populations both arbitrary and subjective.      Race in studies of human intelligence is almost always determined using self-reports, rather than based on analyses of the genetic characteristics of the tested individuals. According to psychologist David Rowe, self-report is the preferred method for racial classification in studies of racial differences because classification based on genetic markers alone ignore the cultural, behavioral, sociological, psychological, and epidemiological variables that distinguish racial groups.  Hunt and Carlson write that Nevertheless, self-identification is a surprisingly reliable guide to genetic composition.  applied mathematical clustering techniques to sort genomic markers for over 3,600 people in the United States and Taiwan into four groups. There was almost perfect agreement between cluster assignment and individuals self-reports of racial/ethnic identification as white, black, East Asian, or Latino. Sternberg and Grigorenko disagree with Hunt and Carlsons interpretation of Tang, Tang et al.s point was that ancient geographic ancestry rather than current residence is associated with self-identification and not that such self-identification provides evidence for the existence of biological race.      Anthropologist ": null
    },
    {
        "C. Loring Brace": "C. Loring Brace"
    },
    {
        "  and geneticist ": null
    },
    {
        "Joseph Graves": "Joseph L. Graves"
    },
    {
        " disagree with the idea that cluster analysis and the correlation between self-reported race and genetic ancestry support biological race.  They argue that while it is possible to find biological and genetic variation corresponding roughly to the groupings normally defined as races, this is true for almost all geographically distinct populations. The cluster structure of the genetic data is dependent on the initial hypotheses of the researcher and the populations sampled. When one samples continental groups, the clusters become continental; if one had chosen other sampling patterns, the clusters would be different.  therefore concludes that, while differences in particular allele frequencies can be used to identify populations that loosely correspond to the racial categories common in Western social discourse, the differences are of no more biological significance than the differences found between any human populations .     ": null
    },
    {
        "Earl B. Hunt": "Earl B. Hunt"
    },
    {
        " agrees that racial categories are defined by social conventions, though he points out that they also correlate with clusters of both genetic traits and cultural traits. Hunt explains that, due to this, racial IQ differences are caused by these variables that correlate with race, and race itself is rarely a causal variable. Researchers who study racial disparities in test scores are studying the relationship between the scores and the many race-related factors which could potentially affect performance. These factors include health, wealth, biological differences, and education.        The study of human intelligence is one of the most controversial topics in psychology. It remains unclear whether group differences in intelligence test scores are caused by heritable factors or by other correlated demographic variables such as ": null
    },
    {
        "socioeconomic": "Socioeconomic"
    },
    {
        " status, ": null
    },
    {
        "education level": "Education"
    },
    {
        ", and motivation. .   Hunt and Carlson outlined four contemporary positions on differences in IQ based on race or ethnicity. The first is that these reflect real differences in average group intelligence, which is caused by a combination of environmental factors and heritable differences in brain function. A second position is that differences in average cognitive ability between races are caused entirely by social and/or environmental factors. A third position holds that differences in average cognitive ability between races do not exist, and that the differences in average test scores are the result of inappropriate use of the tests themselves. Finally, a fourth position is that either or both of the concepts of ": null
    },
    {
        "race": "Race"
    },
    {
        " and ": null
    },
    {
        "general intelligence": "General Intelligence Factor"
    },
    {
        " are poorly constructed and therefore any comparisons between races are meaningless.          In the United States, individuals identifying themselves as East Asian tend to have higher average IQ scores than do Caucasians, who, in turn, have higher average IQs than African Americans. Nevertheless, greater variation in IQ scores exists within each ethnic group than between them.      In response to the controversial 1994 book  The Bell Curve , the ": null
    },
    {
        "American Psychological Association": "American Psychological Association"
    },
    {
        " formed a task-force of eleven experts, which issued a report, ": null
    },
    {
        "Intelligence: Knowns and Unknowns": "Intelligence: Knowns And Unknowns"
    },
    {
        " in 1995. Regarding group differences, the report reaffirmed the consensus that differences within groups are much wider than difference between groups, and that that claims of ethnic difference in intelligence should be scrutinized carefully, as this had been used to justify racial discrimination. It also acknowledged limitations in the racial categories used, as these categories are neither consistently applied, nor homogeneous .     , in a review of the results of a total of 6,246,729 participants on other tests of cognitive ability or aptitude, found a difference in mean IQ scores between blacks and whites of 1.1 SD. Consistent results were found for college and university application tests such as the ": null
    },
    {
        "Scholastic Aptitude Test": "Scholastic Aptitude Test"
    },
    {
        " and ": null
    },
    {
        "Graduate Record Examination": "Graduate Record Examination"
    },
    {
        " , as well as for tests of job applicants in corporate sections and in the military .  According to the same study, ": null
    },
    {
        "East Asia": "East Asia"
    },
    {
        "ns have tended to score relatively higher on visuospatial subtests with lower scores in verbal subtests while ": null
    },
    {
        "Ashkenazi Jews score higher in verbal subtests": "Ashkenazi Jewish Intelligence"
    },
    {
        " with lower scores in visuospatial subtests. The few ": null
    },
    {
        "Amerindian": "Amerindian"
    },
    {
        " populations who have been systematically tested, including Arctic Natives, tend to score worse on average than white populations but better on average than black populations.      The racial groups studied in the United States and Europe are not necessarily ": null
    },
    {
        "representative samples": "Sampling"
    },
    {
        " for populations in other parts of the world. Cultural differences may also factor in IQ test performance and outcomes. Therefore, results in the United States and Europe do not necessarily correlate to results in other populations.           A number of studies have compared average IQ scores between the worlds nations, finding patterns of difference between continental populations similar to those associated with race. ": null
    },
    {
        "Richard Lynn": "Richard Lynn"
    },
    {
        " and ": null
    },
    {
        "Tatu Vanhanen": "Tatu Vanhanen"
    },
    {
        " have argued that populations in the third world, particularly populations in Africa, tend to have limited intelligence because of their genetic composition and that, consequently, education cannot be effective in creating social and economic development in third world countries. Lynn and Vanhanens studies have been severely criticized for relying on low quality data and for choosing sources in ways that seem to be biased severely towards underestimating the average IQ potential of developing nations, particularly in Africa.  Nonetheless there is a general consensus that the average IQ in developing countries is lower than in developed countries, but subsequent research has favored environmental explanations for this fact, such as lack of basic infrastructure related to health and education.     In the 2002 book  IQ and the Wealth of Nations , and  IQ and Global Inequality  in 2006, Richard Lynn and Tatu Vanhanen created estimates of average IQs for 113 nations. They estimated IQs of 79 other nations based on neighboring nations or via other means. They saw a consistent correlation between national development and national IQ averages. They found the highest national IQs among ": null
    },
    {
        "Western": "Western Country"
    },
    {
        " and ": null
    },
    {
        "East Asia": "East Asia"
    },
    {
        "n developed nations and the lowest national IQs in the worlds least developed nations among the indigenous peoples in the regions of Sub-Saharan Africa, Southeast Asia and Latin America.  In a meta-analysis of studies of IQ estimates in Sub-Saharan Africa,  concluded that Lynn and Vanhanen had relied on unsystematic methodology by failing to publish their criteria for including or excluding studies. They found that Lynn and Vanhanens exclusion of studies had depressed their IQ estimate for sub-Saharan Africa, and that including studies excluded in IQ and Global Inequality resulted in average IQ of 82 for sub-Saharan Africa, lower than the average in Western countries, but higher than Lynn and Vanhanens estimate of 67. Wicherts at al. conclude that this difference is likely due to sub-Saharan Africa having limited access to modern advances in education, nutrition and health care.     A 2010 systematic review by the same research team, along with ": null
    },
    {
        "Jerry S. Carlson": "Jerry S. Carlson"
    },
    {
        ", found that compared to American norms, the average IQ of sub-Saharan Africans was about 80. The same review concluded that the ": null
    },
    {
        "Flynn effect": "Flynn Effect"
    },
    {
        " had not yet taken hold in sub-Saharan Africa.     A 2007 meta-analysis by Rindermann found many of the same groupings and correlations found by Lynn and Vanhanen, with the lowest scores in sub-Saharan Africa, and a correlation of .60 between cognitive skill and GDP per capita.  considers Rindermanns analysis to be much more reliable than Lynn and Vanhanens. By measuring the relationship between educational data and social wellbeing over time, this study also performed a causal analysis, finding that when nations invest in education this leads to increased well-being later on. Kamin has also criticized Lynn and Vanhanens work on the IQs of sub-Saharan Africans.     Wicherts, Borsboom & Dolan argue that studies reporting support for evolutionary theories of intelligence based on national IQ data suffer from multiple fatal methodological flaws. For example, they state that such studies ...assume that the Flynn Effect is either nonexistent or invariant with respect to different regions of the world, that there have been no migrations and climatic changes over the course of evolution, and that there have been no trends over the last century in indicators of reproductive strategies . They also showed that a strong degree of confounding exists between national IQs and current national development status.     Similarly, Pesta & Poznanski showed that the average temperature of a given U.S. state is strongly associated with that states average IQ and other well-being variables, despite the fact that evolution has not had enough time to operate on non-Native American residents of the United States. They also noted that this association persisted even after controlling for race, and concluded that Evolution is therefore not necessary for temperature and IQ/well-being to co-vary meaningfully across geographic space.           For the past century raw scores on IQ tests have been rising; this score increase is known as the Flynn effect , named after ": null
    },
    {
        "James R. Flynn": "James Flynn"
    },
    {
        ". In the United States, the increase was continuous and approximately linear from the earliest years of testing to about 1998 when the gains stopped and some tests even showed decreasing test scores. For example, in the United States the average scores of blacks on some IQ tests in 1995 were the same as the scores of whites in 1945.  As one pair of academics phrased it, the typical African American today probably has a slightly higher IQ than the grandparents of todays average white American.  Note: this quote is from the authors introductory essay, not from the interviews.     Flynn has argued that given that these changes take place between one generation and the next it is highly unlikely that genetic factors could account for the increasing scores, which must then be caused by environmental factors. The Flynn Effect has often been used as an argument that the racial gap in IQ test scores must be environmental too, but this is not generally agreed – others have asserted that the two may have entirely different causes. A meta-analysis by Te Nijenhuis and ": null
    },
    {
        "van der Flier": "Henk Van Der Flier"
    },
    {
        " concluded that the Flynn effect and group differences in intelligence were likely to have different causes. They stated that the Flynn effect is caused primarily by environmental factors and that its unlikely these same environmental factors play an important role in explaining group differences in IQ.  The importance of the Flynn effect in the debate over the causes for the IQ gap lies in demonstrating that environmental factors may cause changes in test scores on the scale of 1 SD. This had previously been doubted.     A separate phenomenon from the Flynn effect has been the discovery that the IQ gap has been gradually closing over the last decades of the 20th century, as black test-takers increased their average scores relative to white test-takers. For instance, Vincent reported in 1991 that the black-white IQ gap was decreasing among children, but that it was remaining constant among adults. Similarly, a 2006 study by Dickens and Flynn estimated that the difference between mean scores of blacks and whites closed by about 5 or 6 IQ points between 1972 and 2002, a reduction of about one-third. In the same period, the educational achievement disparity also diminished. Neisser, Ulric . 1998. The rising curve: Long-term gains in IQ and related measures. Washington, DC, US: American Psychological Association However, this was challenged by Rushton & Jensen who claim the difference remains stable. In a 2006 study, Murray agreed with Dickens and Flynn that there has been a narrowing of the difference; Dickens and Flynns estimate of 3–6 IQ points from a base of about 16–18 points is a useful, though provisional, starting point . But he argued that this has stalled and that there has been no further narrowing for people born after the late 1970s. A subsequent study by Murray, based on the ": null
    },
    {
        "Woodcock–Johnson Tests of Cognitive Abilities": "Woodcock–Johnson Tests Of Cognitive Abilities"
    },
    {
        ", estimated that the black-white IQ difference decreased by about one-half of one standard deviation from those born in the 1920s to those born in the second half of the 1960s and early 1970s. Recent reviews by Flynn and Dickens , Mackintosh , and Nisbett et al. 2012 accept the gradual closing of the gap as a fact. In his review of the historical trends,  states: There is some variety in the results, but not a great deal. The African American means are about 1 standard deviation unit below the white means, and the Hispanic means fall in between.     Some studies reviewed by  found that rise in the average achievement of African Americans was caused by a reduction in the number of African American students in the lowest range of scores without a corresponding increase in the number of students in the highest ranges. A 2012 review of the literature found that the IQ gap had diminished by 0.33 standard deviations since first reported.     A 2013 analysis of the ": null
    },
    {
        "National Assessment of Educational Progress": "National Assessment Of Educational Progress"
    },
    {
        " found that from 1971 to 2008, the size of the black–white IQ gap in the United States decreased from 16.33 to 9.94 IQ points. It has also concluded however that, while IQ means are continuing to rise in all ethnic groups, this growth is occurring more slowly among 17-year-old students than among younger students and the black-white IQ gap is no longer narrowing. As of 2008, a study published in 2013 by Heiner Rindermann, Stefan Pinchelmann, and James Thompson have estimated the IQ means of 17-year-old black, white, and Hispanic students to range respectively from 90.45–94.15, 102.29–104.57 and 92.30–95.90 points. They explain that the gap may persist due to the ": null
    },
    {
        "crack epidemic": "Crack Epidemic"
    },
    {
        ", the degradation of ": null
    },
    {
        "African-American family structure": "African-American Family Structure"
    },
    {
        ", the rise of fraud in the educational system , the decrease in unskilled real wages and employment among African-Americans due to ": null
    },
    {
        "globalization": "Globalization"
    },
    {
        " and ": null
    },
    {
        "minimum wage": "Minimum Wage"
    },
    {
        " increases, differences in parental practices , and environmental conditions shaped by themselves. To resolve this, they ultimately recommend the reestablishment of meritoric principles and blindly graded objective central exams, as opposed to ": null
    },
    {
        "ethnically based policies": "Affirmative Action"
    },
    {
        ", in education.        The following environmental factors are some of those suggested as explaining a portion of the differences in average IQ between races. These factors are not mutually exclusive with one another, and some may, in fact, contribute directly to others. Furthermore, the relationship between genetics and environmental factors may be complicated. For example, the differences in socioeconomic environment for a child may be due to differences in genetic IQ for the parents, and the differences in average brain size between races could be the result of nutritional factors. All recent reviews agree that some environmental factors that are unequally distributed between racial groups have been shown to affect intelligence in ways that could contribute to the test score gap. However, currently, the question is whether these factors can account for the entire gap between white and black test scores, or only part of it. One group of scholars, including ": null
    },
    {
        "Richard E. Nisbett": "Richard E. Nisbett"
    },
    {
        ", ": null
    },
    {
        "James R. Flynn": "James Flynn"
    },
    {
        ", Joshua Aronson, Diane Halpern, William Dickens, Eric Turkheimer have argued that the environmental factors so far demonstrated are sufficient to account for the entire gap. ": null
    },
    {
        "Nicholas Mackintosh": "Nicholas Mackintosh"
    },
    {
        " considers this a reasonable argument, but argues that probably it is impossible to ever know for sure; another group including ": null
    },
    {
        "Earl B. Hunt": "Earl B. Hunt"
    },
    {
        " , ": null
    },
    {
        "Arthur Jensen": "Arthur Jensen"
    },
    {
        ", ": null
    },
    {
        "J. Philippe Rushton": "J. Philippe Rushton"
    },
    {
        " and ": null
    },
    {
        "Richard Lynn": "Richard Lynn"
    },
    {
        " have argued that this is impossible. Jensen and Rushton consider that it may account for as little as 20% of the gap. Meanwhile, while Hunt considers this a vast overstatement, he nonetheless considers it likely that some portion of the gap will eventually be shown to be caused by genetic factors.               Environmental factors including ": null
    },
    {
        "childhood lead exposure": "Lead Poisoningeffects On Children"
    },
    {
        ", low rates of ": null
    },
    {
        "breast feeding": "Breast Feeding"
    },
    {
        ",  and poor ": null
    },
    {
        "nutrition": "Nutrition"
    },
    {
        "   can significantly affect cognitive development and functioning. For example, childhood exposure to lead, associated with homes in poorer areas  causes an average IQ drop of 7 points,  and ": null
    },
    {
        "iodine deficiency causes a fall": "Cretinism"
    },
    {
        ", on average, of 12 IQ points.   Such impairments may sometimes be permanent, sometimes be partially or wholly compensated for by later growth. The first two years of life is the critical time for malnutrition, the consequences of which are often irreversible and include poor cognitive development, educability, and future economic productivity. , 2008. The African American population of the United States is statistically more likely to be exposed to many detrimental environmental factors such as poorer neighborhoods, schools, nutrition, and prenatal and postnatal health care.  Mackintosh points out that for American blacks infant mortality is about twice as high as for whites, and low birthweight is twice as prevalent. At the same time white mothers are twice as likely to breastfeed their infants, and breastfeeding is highly correlated with IQ for low birthweight infants. In this way a wide number of health related factors that influence IQ are unequally distributed between the two groups.     The ": null
    },
    {
        "Copenhagen consensus": "Copenhagen Consensus"
    },
    {
        " in 2004 stated that lack of both iodine and iron has been implicated in impaired brain development, and this can affect enormous numbers of people: it is estimated that one-third of the total global population are affected by ": null
    },
    {
        "iodine deficiency": "Iodine Deficiency"
    },
    {
        ". In developing countries, it is estimated that 40% of children aged four and under suffer from ": null
    },
    {
        "anaemia": "Anaemia"
    },
    {
        " because of insufficient iron in their diets.      Other scholars have found that simply the standard of nutrition has a significant effect on population intelligence, and that the Flynn effect may be caused by increasing nutrition standards across the world.  James Flynn has himself argued against this view.      Some recent research has argued that the retardation caused in brain development by ": null
    },
    {
        "infectious disease": "Infectious Disease"
    },
    {
        "s, many of which are more prevalent in non-white populations, may be an important factor in explaining the differences in IQ between different regions of the world.  The findings of this research, showing the correlation between IQ, race and infectious diseases was also shown to apply to the IQ gap in the US, suggesting that this may be an important environmental factor.      A 2013 meta-analysis by the World Health Organization found that, after controlling for maternal IQ, breastfeeding was associated with IQ gains of 2.19 points. The authors suggest that this relationship is causal but state that the practical significance of this gain is debatable; however, they highlight one study suggesting an association between breastfeeding and academic performance in Brazil, where breastfeeding duration does not present marked variability by socioeconomic position.  Colen and Ramey similarly find that controlling for sibling comparisons within families, rather than between families, reduces the correlation between breastfeeding status and WISC IQ scores by nearly a third, but further find the relationship between breastfeeding duration and WISC IQ scores to be insignificant. They suggest that much of the beneficial long-term effects typically attributed to breastfeeding, per se, may primarily be due to selection pressures into infant feeding practices along key demographic characteristics such as race and socioeconomic status.  Reichman estimates that no more than 3 to 4% of the black-white IQ gap can be explained by black-white disparities in low birth weight.        Several studies have proposed that a large part of the gap can be attributed to differences in quality of education.  and  ": null
    },
    {
        "Racial discrimination": "Racial Discrimination"
    },
    {
        " in education has been proposed as one possible cause of differences in educational quality between races.  According to a paper by Hala Elhoweris, Kagendo Mutua, Negmeldin Alsheikh and Pauline Holloway, teachers referral decisions for students to participate in ": null
    },
    {
        "gifted and talented": "Gifted Education"
    },
    {
        " educational programs were influenced in part by the students ethnicity.      The ": null
    },
    {
        "Abecedarian Early Intervention Project": "Abecedarian Early Intervention Project"
    },
    {
        ", an intensive early childhood education project, was also able to bring about an average IQ gain of 4.4 points at age 21 in the black children who participated in it compared to controls. ": null
    },
    {
        "Arthur Jensen": "Arthur Jensen"
    },
    {
        " agreed that the Abecedarian project demonstrates that education can have a significant effect on IQ, but also said that no educational program thus far has been able to reduce the black-white IQ gap by more than a third, and that differences in education are thus unlikely to be its only cause.      Rushton and Jensen argue that long-term follow-up of the ": null
    },
    {
        "Head Start Program": "Head Start Program"
    },
    {
        " found large immediate gains for blacks and whites but that these were quickly lost for the blacks although some remained for whites. They argue that also other more intensive and prolonged educational interventions have not produced lasting effects on IQ or scholastic performance.  Nisbett argues that they ignore studies such as  which found that at the age 12, 87% of black infants exposed to an intervention had IQs in the normal range compared to 56% of controls, and none of the intervention-exposed children were mildly retarded compared to 7% of controls. Other early intervention programs have shown IQ effects in the range of 4–5 points, which are sustained until at least age 8–15. Effects on academic achievement can also be substantial. Nisbett also argues that not only early age intervention can be effective, citing other successful intervention studies from infancy to college.      A series of studies by ": null
    },
    {
        "Joseph Fagan": "Joseph Fagan"
    },
    {
        " and Cynthia Holland measured the effect of prior exposure to the kind of cognitive tasks posed in IQ tests on test performance. Assuming that the IQ gap was the result of lower exposure to tasks using the cognitive functions usually found in IQ tests among African American test takes, they prepared a group of African Americans in this type of tasks before taking an IQ test. The researchers found that there was no subsequent difference in performance between the African-Americans and white test takers.   Daley and Onwuegbuzie conclude that Fagan and Holland demonstrate that differences in knowledge between blacks and whites for intelligence test items can be erased when equal opportunity is provided for exposure to the information to be tested . A similar argument is made by ": null
    },
    {
        "David Marks": "David Marks"
    },
    {
        " who argues that IQ differences correlate well with differences in literacy suggesting that developing literacy skills through education causes an increase in IQ test performance.       A 2003 study found that two variables — stereotype threat and the degree of educational attainment of childrens fathers — partially explained the black-white gap in cognitive ability test scores, undermining the hereditarian view that they stemmed from immutable genetic factors.        Different aspects of the socioeconomic environment in which children are raised have been shown to correlate with part of the IQ gap, but they do not account for the entire gap. According to a 2006 review, these factors account for slightly less than half of one standard deviation of the gap.  Generally the difference between mean test scores of blacks and whites is not eliminated when individuals and groups are matched on socioeconomic status , suggesting that the relationship between IQ and SES is not simply one in which SES determines IQ. Rather it may be the case that differences in intelligence, particularly parental intelligence, may also cause differences in SES, making separating the two factors difficult.   summarises data  showing that, jointly, SES and parental IQ account for the full gap . He argues the SES-linked components reflect parental occupation status, mothers verbal comprehension score and parent-child interaction quality. Hunt also reviews data showing that the correlation between home environment and IQ becomes weaker with age. Hart and Risley argue that in welfare, working-class, and professional families, children hear a large disparity in the amount of language in the age range of 0–3, and that by age 9 these differences lead to large differences in child outcomes.      Other research has focussed on different causes of variation within low SES and high SES groups.   D. C. Rowe. . The Limits of Family Influence: Genes, Experience and Behaviour. Guilford Press. London   In the US, among low-SES groups, genetic differences account for a smaller proportion variance in IQ than among higher SES populations.  Such effects are predicted by the  bioecological  hypothesis – that genotypes are transformed into phenotypes through nonadditive synergistic effects of the environment.   suggest that high SES individuals are more likely to be able to develop their full biological potential, whereas low SES individuals are likely to be hindered in their development by adverse environmental conditions. The same review also points out that adoption studies generally are biased towards including only high and high middle SES adoptive families, meaning that they will tend to overestimate average genetic effects. They also note that studies of adoption from lower-class homes to middle-class homes have shown that such children experience a 12–18 pt gain in IQ relative to children who remain in low SES homes. A 2015 study found that environmental factors accounted for the black-white gap in cognitive ability test scores.       A number of studies have reached the conclusion that IQ tests may be biased against certain groups.     The validity and reliability of IQ scores obtained from outside the United States and Europe have been questioned, in part because of the inherent difficulty of comparing IQ scores between cultures.   Several researchers have argued that cultural differences limit the appropriateness of standard IQ tests in non-industrialized communities.   a collection of articles by several authors discussing the limits of assessment by intelligence tests in different communities in the world. In particular,  describes the difficulties in devising and administering tests for Kalahari bushmen.     A 1996 report by the ": null
    },
    {
        "American Psychological Association": "American Psychological Association"
    },
    {
        " states that intelligence can be difficult to compare across cultures, and notes that differing familiarity with test materials can produce substantial differences in test results; it also says that tests are accurate predictors of future achievement for black and white Americans, and are in that sense unbiased. The view that tests accurately predict future educational attainment is reinforced by ": null
    },
    {
        "Nicholas Mackintosh": "Nicholas Mackintosh"
    },
    {
        " in his 1998 book IQ and Human Intelligence, : Despite widespread belief to the contrary, however, there is ample evidence, both in Britain and the USA, that IQ tests predict educational attainment just about as well in ethnic minorities as in the white majority. and by a 1999 literature review by .     James R. Flynn, surveying studies on the topic, notes that the weight and presence of many test questions depends on what sorts of information and modes of thinking are culturally valued.           ": null
    },
    {
        "Stereotype threat": "Stereotype Threat"
    },
    {
        " is the fear that ones behavior will confirm an existing ": null
    },
    {
        "stereotype": "Stereotype"
    },
    {
        " of a group with which one identifies or by which one is defined; this fear may in turn lead to an impairment of performance.  Testing situations that highlight the fact that intelligence is being measured tend to lower the scores of individuals from racial-ethnic groups who already score lower on average or are expected to score lower. Stereotype threat conditions cause larger than expected IQ differences among groups.  Psychometrician ": null
    },
    {
        "Nicholas Mackintosh": "Nicholas Mackintosh"
    },
    {
        " considers that there is little doubt that the effects of stereotype threat contribute to the IQ gap between blacks and whites.     A large number of studies have shown that systemically disadvantaged minorities, such as the African American minority of the United States, generally perform worse in the educational system and in intelligence tests than the majority groups or less disadvantaged minorities such as immigrant or voluntary minorities. The explanation of these findings may be that children of caste-like minorities, due to the systemic limitations of their prospects of social advancement, do not have ": null
    },
    {
        "effort optimism": "Effort Optimism"
    },
    {
        " , i.e. they do not have the confidence that acquiring the skills valued by majority society, such as those skills measured by IQ tests, is worthwhile. They may even deliberately reject certain behaviors that are seen as ": null
    },
    {
        "acting white": "Acting White"
    },
    {
        ".      Research published in 1997 indicates that part of the black-white gap in cognitive ability test scores is due to racial differences in test motivation.      However, attempts to replicate studies evincing significant effects of stereotype threat have not yielded the same results. In 2004 Sackett et al. found that eliminating stereotype threat does not eliminate the racial test performance gap, and in 2005 Tyson et al. found that African Americans have motivation similar to or even better than that of white Americans.   Self-affirmation exercises promoted by research scientists such as Geoffrey L. Cohen have not been shown to be effective by attempts to replicate his studies.  See also:   :    :   A 2015 meta-analysis conducted by Flore & Wicherts of studies on the relationship between gender and stereotype threat found the observed estimates to be inflated by ": null
    },
    {
        "publication bias": "Publication Bias"
    },
    {
        ", arguing the true effect to be most likely near zero.           Ongoing research aims to understand the contribution of genes to differences in intelligence. Currently there is no non-circumstantial evidence that the test score gap has a genetic component, although some researchers believe that the existing circumstantial evidence makes it plausible to believe that hard evidence for a genetic component will eventually appear. Growing evidence indicates that environmental factors, not genetic ones, are more important in explaining the racial IQ gap. Several lines of investigation have been followed in the attempt to ascertain whether there is a genetic component to the test score gap as well as its relative contribution to the magnitude of the gap.          Geneticist ": null
    },
    {
        "Alan R. Templeton": "Alan R. Templeton"
    },
    {
        " argues that the question about the possible genetic effects on the test score gap is muddled by the general focus on race rather than on populations defined by gene frequency or by geographical proximity, and by the general insistence on phrasing the question in terms of heritability.  Templeton points out that racial groups neither represent ": null
    },
    {
        "sub-species": "Sub-Species"
    },
    {
        " nor distinct ": null
    },
    {
        "evolutionary lineages": "Lineage"
    },
    {
        ", and that therefore there is no basis for making claims about the general intelligence of races. From this point of view the search for possible genetic influences on the black-white test score gap is a priori flawed, because there is no genetic material shared by all Africans or by all Europeans. , however, argues that by using genetic cluster analysis to correlate gene frequencies with continental populations it might be possible to show that African populations have a higher frequency of certain genetic variants that contribute to an average lower intelligence. Such a hypothetical situation could hold without all Africans carrying the same genes or belonging to a single evolutionary lineage. According to Mackintosh, a biological basis for the gap thus cannot be ruled out on a priori grounds.     Intelligence is a ": null
    },
    {
        "polygenic trait": "Polygenic Trait"
    },
    {
        ". This means that intelligence is under the influence of several genes, possibly several thousand. The effect of most individual genetic variants on intelligence is thought to be very small, well below 1% of the variance in g. Current studies using ": null
    },
    {
        "quantitative trait loci": "Quantitative Trait Loci"
    },
    {
        " have yielded little success in the search for genes influencing intelligence. ": null
    },
    {
        "Robert Plomin": "Robert Plomin"
    },
    {
        " is confident that QTLs responsible for the variation in IQ scores exist, but due to their small effect sizes, more powerful tools of analysis will be required to detect them.  Others assert that no useful answers can be reasonably expected from such research before an understanding of the relation between DNA and human phenotypes emerges.  Several candidate genes have been proposed to have a relationship with intelligence.   However, a review of candidate genes for intelligence published in  failed to find evidence of an association between these genes and general intelligence, stating there is still almost no replicated evidence concerning the individual genes, which have variants that contribute to intelligence differences .  In 2001, a review in the  Journal of Black Psychology  refuted eight major premises on which the hereditarian view regarding race and intelligence is based.      A 2005 literature review article by Sternberg, Grigorenko and Kidd stated that no gene has been shown to be linked to intelligence, so attempts to provide a compelling genetic link of race to intelligence are not feasible at this time .  and  concurred, both scholars noting that while several environmental factors have been shown to influence the IQ gap, the evidence for a genetic influence has been circumstantial, and according to Mackintosh negligible. Mackintosh however suggests that it may never become possible to account satisfyingly for the relative contributions of genetic and environmental factors. The 2012 review by  concluded that Almost no genetic polymorphisms have been discovered that are consistently associated with variation in IQ in the normal range . Hunt and several other researchers however maintain that genetic causes cannot be ruled out, and that new evidence may yet show a genetic contribution to the gap. Hunt concurs with Rushton and Jensen who considered the 100% environmental hypothesis to be impossible. Nonetheless, Nisbett and colleagues consider the entire IQ gap to be explained by the environmental factors that have thus far been demonstrated to influence it, and Mackintosh does not find this view to be unreasonable.            ": null
    },
    {
        "Twin studies": "Twin Studies"
    },
    {
        " of intelligence have reported high heritability values. However, these studies are based on questionable assumptions. When used in the context of human ": null
    },
    {
        "behavior genetics": "Behavior Genetics"
    },
    {
        ", the term heritability is highly misleading, as it does not convey any information about the relative importance of genetic or environmental factors on the development of a given trait, nor does it convey the extent to which that trait is genetically determined. Arguments in support of a genetic explanation of racial differences in IQ are sometimes fallacious. For instance, hereditarians have sometimes cited the failure of known environmental factors to account for such differences, or the high heritability of intelligence within races, as evidence that racial differences in IQ are genetic.      Psychometricians have found that intelligence is substantially heritable within populations, with 30–50% of variance in IQ scores in early childhood being attributable to genetic factors in analyzed US populations, increasing to 75–80% by late adolescence. In biology heritability is defined as the ratio of variation attributable to genetic differences in an observable ": null
    },
    {
        "trait": "Trait"
    },
    {
        " to the traits total observable variation. The heritability of a trait describes the proportion of variation in the trait that is attributable to genetic factors within a particular population. A heritability of 1 indicates that variation correlates fully with genetic variation and a heritability of 0 indicates that there is no correlation between the trait and genes at all. In psychological testing, heritability tends to be understood as the degree of correlation between the results of a test taker and those of their biological parents. However, since high heritability is simply a correlation between traits and genes, it does not describe the causes of heritability which in humans can be either genetic or environmental.     Therefore, a high heritability measure does not imply that a trait is genetic or unchangeable, however, as environmental factors that affect all group members equally will not be measured by heritability and the heritability of a trait may also change over time in response to changes in the distribution of genes and environmental factors. High heritability also doesnt imply that all of the heritability is genetically determined, but can also be due to environmental differences that affect only a certain genetically defined group .  The figure to the left demonstrates how heritability works. In both gardens the difference between tall and short cornstalks is 100% heritable as cornstalks that are genetically disposed for growing tall will become taller than those without this disposition, but the difference in height between the cornstalks to the left and those on the right is 100% environmental as it is due to different nutrients being supplied to the two gardens. Hence the causes of differences within a group and between groups may not be the same, even when looking at traits that are highly heritable. In his ": null
    },
    {
        "criticism of the Bell Curve": "The Bell Curvecognitive Sorting"
    },
    {
        ", ": null
    },
    {
        "Noam Chomsky": "Noam Chomsky"
    },
    {
        " further illustrated this with the example of women wearing earrings:     In regards to the IQ gap the question becomes whether racial groups can be shown to be influenced by different environmental factors that may account for the observed differences between them. Jensen originally argued that given the high heritability of IQ the only way that the IQ gap could be explained as caused by the environment would be if it could be shown that all blacks were subject to a single x-factor which affected no white populations while affecting all black populations equally.  Jensen considered the existence of such an x-factor to be extremely improbable, but Flynns discovery of the Flynn effect showed that in spite of high heritability environmental factors could cause considerable disparities in IQ between generations of the same population, showing that the existence of such an x-factor was not only possible but real.     Jensen has also argued that heritability of traits rises with age as the genetic potential of individuals becomes expressed. He sees this as related to the fact that the IQ gap between white and black test takers has been shown to appear gradually, with the gap widening as cohorts reach adulthood. This he sees as a further argument in favor of Spearmans hypothesis .     In contrast, Dickens and Flynn argued that the conventional interpretation ignores the role of ": null
    },
    {
        "feedback": "Feedback"
    },
    {
        " between factors, such as those with a small initial IQ advantage, genetic or environmental, seeking out more stimulating environments which will gradually greatly increase their advantage, which, as one consequence in their alternative model, would mean that the heritability figure is only in part due to direct effects of genotype on IQ.     Today researchers such as ,  and  consider that rather than a single factor accounting for the entire gap, probably many different environmental factors differ systematically between the environments of white and black people converge to create part of the gap and perhaps all of it. They argue that it does not make sense to talk about a single universal heritability figure for IQ, rather, they state, heritability of IQ varies between and within groups. They point specifically to studies showing a higher heritability of test scores in white and medium-high SES families, but considerably lower heritability for black and low-SES families. This they interpret to mean that children who grow up with limited resources do not get to develop their full genetic potential.     Multiple studies have been conducted over the past several decades to survey scientific estimates on the heritability of the IQ gap. A ": null
    },
    {
        "review by Snydermann and Rothman": "The Iq Controversy, The Media And Public Policy"
    },
    {
        " in 1988 found that 45% of the scientists they questioned believed the gap to be a product of genetic and environmental variation, 15% and 1% respectively entirely to environmental and genetic variation, while the remaining 38% either declined to answer or stated that the evidence was inconclusive. Snyderman & Rothman , cited in Eysenck . The heritability of intelligence was estimated on average to be 59.6% for white Americans and 57.0% for black Americans among those who answered that the evidence was sufficiently conclusive.  The Wall Street Journal published an ": null
    },
    {
        "editorial by Linda Gottfredson in 1994": "Mainstream Science On Intelligence"
    },
    {
        ", signed by 52 professors specializing in intelligence and allied fields, that estimated the heritability of individual variation to range between 40–80%, but also stating that there is no definitive answer to explain the racial gap.  Social psychologist ": null
    },
    {
        "Donald T. Campbell": "Donald T. Campbell"
    },
    {
        " criticized the report, arguing that it overstated the plausibility of genetic explanations and underestimated the extent of environmental differences between races.  A ": null
    },
    {
        "1995 report by the APA": "Intelligence: Knowns And Unknowns"
    },
    {
        " stated that there is more plausible evidence for an environmental than for a genetic explanation, but that there was no adequate explanation for the black-white IQ gap.   In a 2013 followup on Snyderman & Rothman, Rindermann et al. found the average and median estimates of the black-white IQ gap to be heritable by 47% and 50% respectively among surveyed scientists who believed that the available evidence allowed for a reasonable estimate. This survey however yielded a response rate of 18% compared to Snyderman & Rothmans 65% .           Spearmans hypothesis states that the magnitude of the black-white difference in tests of cognitive ability is entirely or mainly a function of the extent to which a test measures general mental ability, or g. The hypothesis was first formalized by ": null
    },
    {
        "Arthur Jensen": "Arthur Jensen"
    },
    {
        " who devised the statistical Method of Correlated Vectors to test it. Jensen holds that if Spearmans hypothesis holds true then some cognitive tasks have a higher g-load than others, and that these tasks are exactly the tasks in which the gap between black and white test takers are greatest. Jensen, and other psychometricians such as Rushton and Lynn, take this to show that the cause of g and the cause of the gap are the same—in their view genetic differences.      acknowledges that Jensen and Rushton have shown a modest correlation between g-loading, heritability, and the test score gap, but he does not accept that this demonstrates a genetic origin of the gap. He points out that it is exactly in those the tests that Rushton and Jensen consider to have the highest g-loading and heritability such as the Wechsler that has seen the highest increases due to the Flynn effect. This suggests that they are also the most sensitive to environmental changes. And in turn, if the highly g-loaded tests are both more liable to environmental influences and as Jensen argues, the ones where the black-white gap is most pronounced, it suggests in fact contrary to Jensens argument that the gap is most likely caused by environmental factors. Mackintosh also argues that Spearmans hypothesis, which he considers to be likely to be correct, simply shows that the test score gap is based on whatever cognitive faculty is central to intelligence, but not what this factor is.  make the same point, noting also that the increase in the IQ scores of black test takers is necessarily also an increase in g.     James  argues that there is an inherent flaw in Jensens argument that the correlation between g-loadings, test scores and heritability support a genetic cause of the gap. He points out that as the difficulty of a task increases a low performing group will naturally fall further behind, and heritability will therefore also naturally increase. The same holds for increases in performance which will first affect the least difficult tasks, but only gradually affect the most difficult ones. Flynn thus sees the correlation between in g-loading and the test score gap to offer no clue to the cause of the gap.      states that many of conclusions of Jensen, and his colleagues rest on the validity of Spearmans hypothesis, and the method of correlated vectors used to test it. Hunt points out that other researchers have found this method of calculation to produce false positive results, and that other statistical methods should be used instead. According to Hunt, Jensen and Rushtons frequent claim that Spearmans hypothesis should be regarded as empirical fact does not hold, and that new studies based on better statistical methods would be required to confirm or reject the hypothesis that the correlation between g-loading, heritability and the IQ gap is due to IQ gaps consisting mostly of g.       A number of studies have been done on the effect of similar rearing conditions on children from different races. The hypothesis is that by investigating whether black children adopted into white families demonstrated gains in IQ test scores relative to black children reared in black families. Depending on whether their test scores are more similar to their biological or adoptive families, that could be interpreted as either supporting a genetic or an environmental hypothesis. The main point of critique in studies like these however is whether the environment of black children—even when raised in white families—is truly comparable to the environment of white children. Several reviews of the ": null
    },
    {
        "adoption study": "Adoption Study"
    },
    {
        " literature has pointed out that it is perhaps impossible to avoid confounding of biological and environmental factors in this type of studies. Given the differing heritability estimates in medium-high SES and low-SES families,  argue that adoption studies on the whole tend to overstate the role of genetics because they represent a restricted set of environments, mostly in the medium-high SES range.     The ": null
    },
    {
        "Minnesota Transracial Adoption Study": "Minnesota Transracial Adoption Study"
    },
    {
        " examined the ": null
    },
    {
        "IQ": "Intelligence Quotient"
    },
    {
        " test scores of 122 ": null
    },
    {
        "adopted": "Adopted"
    },
    {
        " children and 143 nonadopted children reared by advantaged white families. The children were restudied ten years later.   The study found higher IQ for whites compared to blacks, both at age 7 and age 17.  cite the Minnesota study as providing support to a genetic explanation. Nonetheless, acknowledging the existence of confounding factors, Scarr and Weinberg the authors of the original study, did not themselves consider that it provided support for either the hereditarian or environmentalist view.     Three other adoption studies found contrary evidence to the Minnesota study, lending support to a mostly environmental hypothesis:    studied the out-of-wedlock children of black and white soldiers stationed in Germany after World War 2 and then raised by white German mothers in what has become known as the ": null
    },
    {
        "Eyferth study": "Eyferth Study"
    },
    {
        ". He found no significant differences in average IQ between groups.    studied black , white, and mixed-race children raised in British long-stay residential nurseries. Two out of three tests found no significant differences. One test found higher scores for non-whites.    compared black and mixed-race children adopted by either black or white middle-class families in the United States. Moore observed that 23 black and interracial children raised by white parents had a significantly higher mean score than 23 age-matched children raised by black parents , and argued that differences in early socialization explained these differences.     Rushton and Jensen have argued that unlike the Minnesota Transracial Adoption Study, these studies did not retest the children post-adolescence when heritability of IQ would presumably be higher.  however point out that the difference in heritability between ages 7 and 17 are quite small, and that consequently this is no reason to disregard Moores findings.     Frydman and Lynn showed a mean IQ of 119 for Korean infants adopted by Belgian families. After correcting for the ": null
    },
    {
        "Flynn effect": "Flynn Effect"
    },
    {
        ", the IQ of the adopted Korean children was still 10 points higher than the indigenous Belgian children.      Reviewing the evidence from adoption studies Mackintosh considers the studies by Tizard and Eyferth to be inconclusive, and the Minnesota study to be consistent only with a partial genetic hypothesis. On the whole he finds that environmental and genetic variables remain confounded and considers evidence from adoption studies inconclusive on the whole, and fully compatible with a 100% environmental explanation.       Most people have an ancestry from different geographic regions, particularly African Americans typically have ancestors from both Africa and Europe, with, on average, 20% of their genome inherited from European ancestors.  If racial IQ gaps have a partially genetic basis, one might expect blacks with a higher degree of European ancestry to score higher on IQ tests than blacks with less European ancestry, because the genes inherited from European ancestors would likely include some genes with a positive effect on IQ. Geneticist ": null
    },
    {
        "Alan Templeton": "Alan Templeton"
    },
    {
        " has argued that an experiment based on the Mendelian common garden design where specimens with different hybrid compositions are subjected to the same environmental influences, would be the only way to definitively show a causal relation between genes and IQ. Summarizing the findings of admixture studies, he concludes that it has shown no significant correlation between any cognitive and the degree of African or European ancestry.     Studies have employed different ways of measuring or approximating relative degrees of ancestry from Africa and Europe. One set of studies have used skin color as a measure, and other studies have used blood groups.  surveys the literature and argues that the blood groups studies may be seen as providing some support to the genetic hypothesis, even though the correlation between ancestry and IQ was quite low. He finds that studies by , Willerman, Naylor & Myrianthopoulos did not find a correlation between degree of African/European ancestry and IQ. The latter study did find a difference based on the race of the mother, with children of white mothers with black fathers scoring higher than children of black mothers and white fathers. Loehlin considers that such a finding is compatible with either a genetic or an environmental cause. All in all Loehlin finds admixture studies inconclusive and recommends more research.     Another study cited by , and by , was  study which found that adopted mixed-race childrens has test scores identical to children with two black parents—receiving no apparent benefit from their white ancestry. Rushton and Jensen find admixture studies to have provided overall support for a genetic explanation though this view is not shared by , , , , nor by .     Reviewing the evidence from admixture studies  considers it to be inconclusive because of too many uncontrolled variables.  quotes a statement by  to the effect that admixture studies have not provided a shred of evidence in favor of a genetic basis for the gap.          ": null
    },
    {
        "Mental chronometry": "Mental Chronometry"
    },
    {
        " measures the elapsed time between the presentation of a sensory stimulus and the subsequent behavioral response by the participant. This reaction time is considered a measure of the speed and efficiency with which the brain processes information.  Scores on most types of RT tasks tend to correlate with scores on standard IQ tests as well as with g, and no relationship has been found between RT and any other psychometric factors independent of g. The strength of the correlation with IQ varies from one RT test to another, but ": null
    },
    {
        "Hans Eysenck": "Hans Eysenck"
    },
    {
        " gives 0.40 as a typical correlation under favorable conditions.  According to Jensen individual differences in RT have a substantial genetic component, and heritability is higher for performance on tests that correlate more strongly with IQ.  Nisbett argues that some studies have found correlations closer to 0.2, and that the correlation is not always found.      Several studies have found differences between races in average reaction times. These studies have generally found that reaction times among black, Asian and white children follow the same pattern as IQ scores. Black-white differences in reaction time, however, tend to be small .  have argued that reaction time is independent of culture and that the existence of race differences in average reaction time is evidence that the cause of racial IQ gaps is partially genetic instead of entirely cultural. Responding to this argument in Intelligence and How to Get It, Nisbett has pointed to the  study in which a group of Chinese Americans had longer reaction times than a group of European Americans, despite having higher IQs. Nisbett also mentions findings in  and  suggesting that movement time correlates with IQ just as strongly as reaction time, and that average movement time is faster for blacks than for whites.  considers reaction time evidence unconvincing and points out that other cognitive tests that also correlate well with IQ show no disparity at all, for example the habituation/": null
    },
    {
        "dishabituation": "Dishabituation"
    },
    {
        " test. And he points out that studies show that rhesus monkeys have shorter reaction times than American college students, suggesting that different reaction times may not tell us anything useful about intelligence.          A number of studies have reported a moderate statistical correlation between differences in IQ and brain size between individuals in the same group. And some scholars have reported differences in average brain sizes between Africans, Europeans, and Asians. J. P. Rushton has argued that Africans on average have smaller brain cases and brains than Europeans, that Europeans have smaller brains than East Asians, and that this is evidence that the gap is biological in nature. Critics of Rushton have argued that Rushtons arguments rest on outdated data collected by unsound methods and should be considered invalid. Recent reviews by  and  consider that current data does show an average difference in brain size and head-circumference between American blacks and whites, but question whether this has any relevance for the IQ gap. Nisbett et al. argue that crude brain size is unlikely to be a good measure of IQ; for example, brain size also differs between men and women, but without well-documented differences in IQ. At the same time newborn black children have the same average brain size as whites, suggesting that the difference in average size could be accounted for by differences in postnatal environment. Several factors that reduce brain size have been demonstrated to disproportionately affect black children.     ": null
    },
    {
        "Earl Hunt": "Earl B. Hunt"
    },
    {
        " states that brain size is found to have a correlation of about .35 with intelligence among whites and cites studies showing that genes may account for as much as 90% of individual variation in brain size. According to Hunt, race differences in average brain size could potentially be an important argument for a possible genetic contribution to racial IQ gaps. Nonetheless, Hunt notes that Rushtons head size data would account for a difference of .09 standard deviations between black and white average test scores, less than a tenth of the 1.0 standard deviation gap in average scores that is observed. Wicherts, Borsboom, & Dolan argue that black-white differences in brain size are insufficient to explain 91% to 95% of the black-white IQ gap.       Archaeological evidence does not support claims by Rushton and others that blacks cognitive ability was inferior to whites during prehistoric times as a result of evolution.          The 1996 report of the APA commented on the ": null
    },
    {
        "ethics": "Ethics"
    },
    {
        " of research on race and intelligence.   as well as  have also discussed different possible ethical guidelines.   ": null
    },
    {
        "Nature": "Nature"
    },
    {
        " in 2009 featured two editorials on the ethics of research in race and intelligence by ": null
    },
    {
        "Steven Rose": "Steven Rose"
    },
    {
        " and ": null
    },
    {
        "Stephen J. Ceci": "Stephen J. Ceci"
    },
    {
        " and ": null
    },
    {
        "Wendy M. Williams": "Wendy M. Williams"
    },
    {
        " .       According to critics, research on group differences in IQ will reproduce the negative effects of social ideologies  that were justified in part on claimed hereditary racial differences.  ": null
    },
    {
        "Steven Rose": "Steven Rose"
    },
    {
        " maintains that the history of ": null
    },
    {
        "eugenics": "Eugenics"
    },
    {
        " makes this field of research difficult to reconcile with current ethical standards for science.     ": null
    },
    {
        "Linda Gottfredson": "Linda Gottfredson"
    },
    {
        " argues that suggestion of higher ethical standards for research into group differences in intelligence is a ": null
    },
    {
        "double standard": "Double Standard"
    },
    {
        " applied in order to undermine disliked results.  ": null
    },
    {
        "James R. Flynn": "James Flynn"
    },
    {
        " has argued that had there been a ban on research on possibly poorly conceived ideas, much valuable research on intelligence testing  would not have occurred.      Jensen and Rushton argued that the existence of biological group differences does not rule out, but raises questions about the worthiness of policies such as ": null
    },
    {
        "affirmative action": "Affirmative Action"
    },
    {
        " or placing a premium on diversity. They also argued for the importance of teaching people not to overgeneralize or ": null
    },
    {
        "stereotype": "Stereotype"
    },
    {
        " individuals based on average group differences, because of the significant overlap of people with varying intelligence between different races.     Some who hold the environmentalist viewpoint argue for increased interventions in order to close the gaps.  Nisbett argues that schools can be greatly improved and that many interventions at every age level are possible.  Flynn, arguing for the importance of the black subculture, writes that America will have to address all the aspects of black experience that are disadvantageous, beginning with the regeneration of inner city neighbourhoods and their schools. A resident police office and teacher in every apartment block would be a good start.  Researchers from both sides agree that interventions should be better researched.     Especially in developing nations, society has been urged to take on the prevention of cognitive impairment in children as of the highest priority. Possible preventable causes include ": null
    },
    {
        "malnutrition": "Malnutrition"
    },
    {
        ", ": null
    },
    {
        "infectious diseases": "Infectious Diseases"
    },
    {
        " such as ": null
    },
    {
        "meningitis": "Meningitis"
    },
    {
        ", ": null
    },
    {
        "parasites": "Parasites"
    },
    {
        ", cerebral ": null
    },
    {
        "malaria": "Malaria"
    },
    {
        ", ": null
    },
    {
        "in utero": "In Utero"
    },
    {
        " drug": "Drug"
    },
    {
        " and ": null
    },
    {
        "alcohol": "Alcohol"
    },
    {
        " exposure, newborn ": null
    },
    {
        "asphyxia": "Asphyxia"
    },
    {
        ", ": null
    },
    {
        "low birth weight": "Low Birth Weight"
    },
    {
        ", head injuries, ": null
    },
    {
        "lead poisoning": "Lead Poisoning"
    },
    {
        " and ": null
    },
    {
        "endocrine disorders": "Endocrine Disorders"
    },
    {
        ". ": null
    }
]