[
    {
        "              Rail transport or train transport is a means of ": null
    },
    {
        "transferring passengers and goods": "Transport"
    },
    {
        " on wheeled vehicles running on rails, which are located on ": null
    },
    {
        "tracks": "Track"
    },
    {
        ". In contrast to ": null
    },
    {
        "road transport": "Road Transport"
    },
    {
        ", where vehicles run on a prepared flat surface, rail vehicles  are directionally guided by the tracks on which they run. Tracks usually consist of ": null
    },
    {
        "steel": "Steel"
    },
    {
        " rails, installed on ": null
    },
    {
        "ties": "Railroad Tie"
    },
    {
        " set in ": null
    },
    {
        "ballast": "Track Ballast"
    },
    {
        ", on which the rolling stock, usually fitted with metal wheels, moves. Other variations are also possible, such as slab track. This is where the rails are fastened to a concrete foundation resting on a prepared subsurface.                          Rolling stock in a rail transport system generally encounters lower ": null
    },
    {
        "frictional resistance": "Friction"
    },
    {
        " than rubber-tired road vehicles, so passenger and freight cars can be coupled into longer ": null
    },
    {
        "train": "Train"
    },
    {
        "s. The ": null
    },
    {
        "operation": "Rail Transport Operations"
    },
    {
        " is carried out by a ": null
    },
    {
        "railway company": "Railway Company"
    },
    {
        ", providing transport between ": null
    },
    {
        "train stations": "Train Station"
    },
    {
        "or freight customer facilities. Power is provided by ": null
    },
    {
        "locomotives": "Locomotive"
    },
    {
        "which either draw ": null
    },
    {
        "electric power": "Electric Power"
    },
    {
        " from a ": null
    },
    {
        "railway electrification system": "Railway Electrification System"
    },
    {
        " or produce their own power, usually by ": null
    },
    {
        "diesel engine": "Diesel Engine"
    },
    {
        "s. Most tracks are accompanied by a ": null
    },
    {
        "signalling system": "Railway Signaling"
    },
    {
        ". Railways are a safe land transport system when compared to other forms of transport. According to , railways are the safest on both a per-mile and per-hour basis, whereas ": null
    },
    {
        "air transport": "Aviation"
    },
    {
        " is safe only on a per-mile basis. Railway transport is capable of high levels of passenger and cargo utilization and energy efficiency, but is often less flexible and more ": null
    },
    {
        "capital": "Capital"
    },
    {
        "-intensive than road transport, when lower traffic levels are considered.     The oldest known, man/animal-hauled railways date back to the 6th century BC in ": null
    },
    {
        "Corinth": "Corinth"
    },
    {
        ", ": null
    },
    {
        "Greece": "Greece"
    },
    {
        ". Rail transport then commenced in mid 16th century in ": null
    },
    {
        "Germany": "Germany"
    },
    {
        " in the form of horse-powered ": null
    },
    {
        "funiculars": "Funicular"
    },
    {
        "and ": null
    },
    {
        "wagonway": "Wagonway"
    },
    {
        "s. Modern rail transport commenced with the British development of the ": null
    },
    {
        "steam locomotives": "Steam Locomotive"
    },
    {
        "in the early 19th century. Thus the ": null
    },
    {
        "railway system in Great Britain": "Rail Transport In Great Britain"
    },
    {
        " is the oldest in the world. Built by ": null
    },
    {
        "George Stephenson": "George Stephenson"
    },
    {
        " and his son ": null
    },
    {
        "Roberts": "Robert Stephenson"
    },
    {
        "company ": null
    },
    {
        "Robert Stephenson and Company": "Robert Stephenson And Company"
    },
    {
        ", the ": null
    },
    {
        "Locomotion No. 1": "Locomotion No. 1"
    },
    {
        " is the first steam locomotive to carry passengers on a public rail line, the ": null
    },
    {
        "Stockton and Darlington Railway": "Stockton And Darlington Railway"
    },
    {
        " in 1825. George Stephenson also built the first public inter-city railway line in the world to use only the steam locomotives all the time, the ": null
    },
    {
        "Liverpool and Manchester Railway": "Liverpool And Manchester Railway"
    },
    {
        " which ": null
    },
    {
        "opened in 1830": "Opening Of The Liverpool And Manchester Railway"
    },
    {
        ". With steam engines, one could construct mainline railways, which were a key component of the ": null
    },
    {
        "Industrial Revolution": "Industrial Revolution"
    },
    {
        ". Also, railways reduced the costs of ": null
    },
    {
        "shipping": "Shipping"
    },
    {
        ", and allowed for fewer lost goods, compared with water transport, which faced occasional sinking of ships. The change from ": null
    },
    {
        "canals": "Canals"
    },
    {
        " to railways allowed for national markets in which prices varied very little from city to city. The spread of the railway network and the use of railway timetables, led to the standardisation of time in Britain based on Greenwich Mean Time. Prior to this, major towns and cities varied their local time relative to GMT. The invention and development of the railway in the United Kingdom was one of the most important technological inventions of the 19th century. The worlds first underground railway, the ": null
    },
    {
        "Metropolitan Railway": "Metropolitan Railway"
    },
    {
        " , opened in 1863.     In the 1880s, ": null
    },
    {
        "electrified": "Railway Electrification System"
    },
    {
        " trains were introduced, leading to electrification of tramways and rapid transit systems. Starting during the 1940s, the non-electrified railways in most countries had their steam locomotives replaced by ": null
    },
    {
        "diesel": "Diesel Fuel"
    },
    {
        "-electric locomotives, with the process being almost complete by the 2000s. During the 1960s, electrified ": null
    },
    {
        "high-speed railway systems": "High-Speed Rail"
    },
    {
        " were introduced in ": null
    },
    {
        "Japan": "Japan"
    },
    {
        " and later in some other countries. Many countries are in the process of replacing diesel locomotives with electric locomotives, mainly due to environmental concerns, a notable example being ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        ", which has completely electrified its network. Other forms of guided ground transport outside the traditional railway definitions, such as ": null
    },
    {
        "monorail": "Monorail"
    },
    {
        " or ": null
    },
    {
        "maglev": "Maglev"
    },
    {
        ", have been tried but have seen limited use.     Following a decline after ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " due to competition from cars and airplanes, rail transport has had a revival in recent decades due to road congestion and rising fuel prices, as well as governments ": null
    },
    {
        "investing in rail": "Rail Subsidies"
    },
    {
        " as a means of reducing ": null
    },
    {
        "CO 2 emissions": "Co2 Emissions"
    },
    {
        " in the context of concerns about ": null
    },
    {
        "global warming": "Global Warming"
    },
    {
        ".          The history of rail transport began in the 6th century BC in ": null
    },
    {
        "Ancient Greece": "Ancient Greece"
    },
    {
        ". It can be divided up into several discrete periods defined by the principal means of track material and motive power used.         Evidence indicates that there was 6 to 8.5  km long  Diolkos  paved trackway, which transported boats across the ": null
    },
    {
        "Isthmus of Corinth": "Isthmus Of Corinth"
    },
    {
        " in ": null
    },
    {
        "Greece": "Greece"
    },
    {
        " from around 600 BC. Verdelis, Nikolaos: Le diolkos de LIsthme , Bulletin de Correspondance Hellénique, Vol. 81 , pp. 526–529 Cook, R. M.: Archaic Greek Trade: Three Conjectures 1. The Diolkos , The Journal of Hellenic Studies, Vol. 99 , pp. 152–155 Drijvers, J.W.: Strabo VIII 2,1 : Porthmeia and the Diolkos , Mnemosyne, Vol. 45 , pp. 75–76 ": null
    },
    {
        "Raepsaet, G.": "Georges Raepsaet"
    },
    {
        " & Tolley, M.: Le Diolkos de l’Isthme à Corinthe: son tracé, son fonctionnement , Bulletin de Correspondance Hellénique, Vol. 117 , pp. 233–261  Wheeled vehicles pulled by men and animals ran in grooves in ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        ", which provided the track element, preventing the wagons from leaving the intended route. The Diolkos was in use for over 650 years, until at least the 1st century AD. The paved trackways were also later built in ": null
    },
    {
        "Roman Egypt": "Roman Egypt"
    },
    {
        ".                       In 1515, ": null
    },
    {
        "Cardinal Matthäus Lang": "Matthäus Lang"
    },
    {
        " wrote a description of the ": null
    },
    {
        "Reisszug": "Reisszug"
    },
    {
        ", a ": null
    },
    {
        "funicular": "Funicular"
    },
    {
        " railway at the ": null
    },
    {
        "Hohensalzburg Fortress": "Hohensalzburg Fortress"
    },
    {
        " in Austria. The line originally used wooden rails and a ": null
    },
    {
        "hemp": "Hemp"
    },
    {
        " haulage rope and was operated by human or animal power, through a ": null
    },
    {
        "treadwheel": "Treadwheel"
    },
    {
        ".  The line still exists and is operational, although in updated form and is possibly the oldest operational railway.         ": null
    },
    {
        "Wagonways": "Wagonway"
    },
    {
        "  using wooden rails, hauled by horses, started appearing in the 1550s to facilitate the transport of ore tubs to and from mines, and soon became popular in Europe. Such an operation was illustrated in Germany in 1556 by ": null
    },
    {
        "Georgius Agricola": "Georgius Agricola"
    },
    {
        " in his work ": null
    },
    {
        "De re metallica": "De Re Metallica"
    },
    {
        ". Georgius Agricola ,  De re metallica  , p. 156. This line used Hund carts with unflanged wheels running on wooden planks and a vertical pin on the truck fitting into the gap between the planks to keep it going the right way. The miners called the wagons Hunde from the noise they made on the tracks.      There are many references to their use in central Europe in the 16th century. Lewis, Early wooden railways, pp. 8–10. Such a transport system was later used by German miners at ": null
    },
    {
        "Caldbeck": "Caldbeck"
    },
    {
        ", ": null
    },
    {
        "Cumbria": "Cumbria"
    },
    {
        ", England, perhaps from the 1560s. Warren Allison, Samuel Murphy and Richard Smith, An Early Railway in the German Mines of Caldbeck in G. Boyes , Early Railways 4: Papers from the 4th International Early Railways Conference 2008 , pp. 52–69. A wagonway was built at ": null
    },
    {
        "Prescot": "Prescot"
    },
    {
        ", near ": null
    },
    {
        "Liverpool": "Liverpool"
    },
    {
        ", sometime around 1600, possibly as early as 1594. Owned by Philip Layton, the line carried coal from a pit near Prescot Hall to a terminus about half a mile away.  A funicular railway was also made at ": null
    },
    {
        "Broseley": "Broseley"
    },
    {
        " in ": null
    },
    {
        "Shropshire": "Shropshire"
    },
    {
        " some time before 1604. This carried coal for James Clifford from his mines down to the ": null
    },
    {
        "river Severn": "River Severn"
    },
    {
        " to be loaded onto barges and carried to riverside towns. Peter King, The First Shropshire Railways in G. Boyes , Early Railways 4: Papers from the 4th International Early Railways Conference 2008 , pp. 70–84. The ": null
    },
    {
        "Wollaton Wagonway": "Wollaton Wagonway"
    },
    {
        ", completed in 1604 by ": null
    },
    {
        "Huntingdon Beaumont": "Huntingdon Beaumont"
    },
    {
        ", has sometimes erroneously been cited as the earliest British railway. It ran from ": null
    },
    {
        "Strelley": "Strelley, Nottingham"
    },
    {
        " to ": null
    },
    {
        "Wollaton": "Wollaton"
    },
    {
        " near ": null
    },
    {
        "Nottingham": "Nottingham"
    },
    {
        ".      The ": null
    },
    {
        "Middleton Railway": "Middleton Railway"
    },
    {
        " in ": null
    },
    {
        "Leeds": "Leeds"
    },
    {
        ", which was built in 1758, later became the worlds oldest operational railway , albeit now in an upgraded form. In 1764, the first railway in the Americas was built in ": null
    },
    {
        "Lewiston, New York": "Lewiston, New York"
    },
    {
        ".          In the late 1760s, the ": null
    },
    {
        "Coalbrookdale": "Coalbrookdale"
    },
    {
        " Company began to fix plates of ": null
    },
    {
        "cast iron": "Cast Iron"
    },
    {
        " to the upper surface of the wooden rails. This allowed a variation of ": null
    },
    {
        "gauge": "Rail Gauge"
    },
    {
        " to be used. At first only ": null
    },
    {
        "balloon loops": "Balloon Loop"
    },
    {
        "could be used for turning, but later, movable points were taken into use that allowed for switching.         A system was introduced in which unflanged wheels ran on L-shaped metal plates – these became known as ": null
    },
    {
        "plateway": "Plateway"
    },
    {
        "s. ": null
    },
    {
        "John Curr": "John Curr"
    },
    {
        ", a Sheffield colliery manager, invented this flanged rail in 1787, though the exact date of this is disputed. The plate rail was taken up by ": null
    },
    {
        "Benjamin Outram": "Benjamin Outram"
    },
    {
        " for wagonways serving his canals, manufacturing them at his ": null
    },
    {
        "Butterley ironworks": "Butterley Company"
    },
    {
        ". In 1803, ": null
    },
    {
        "William Jessop": "William Jessop"
    },
    {
        " opened the ": null
    },
    {
        "Surrey Iron Railway": "Surrey Iron Railway"
    },
    {
        ", a double track plateway, erroneously sometimes cited as worlds first public railway, in south London.         Meanwhile, ": null
    },
    {
        "William Jessop": "William Jessop"
    },
    {
        " had earlier used a form of all-iron ": null
    },
    {
        "edge rail": "Edge Rail"
    },
    {
        " and flanged wheels successfully for an extension to the ": null
    },
    {
        "Charnwood Forest Canal": "Charnwood Forest Canal"
    },
    {
        " at ": null
    },
    {
        "Nanpantan": "Nanpantan"
    },
    {
        ", ": null
    },
    {
        "Loughborough": "Loughborough"
    },
    {
        ", ": null
    },
    {
        "Leicestershire": "Leicestershire"
    },
    {
        " in 1789. In 1790, Jessop and his partner Outram began to manufacture edge-rails. Jessop became a partner in the Butterley Company in 1790. The first public edgeway built was ": null
    },
    {
        "Lake Lock Rail Road": "Lake Lock Rail Road"
    },
    {
        " in 1796. Although the primary purpose of the line was to carry coal, it also carried passengers.     These two systems of constructing iron railways, the L plate-rail and the smooth edge-rail, continued to exist side by side until well into the early 19th century. The flanged wheel and edge-rail eventually proved its superiority and became the standard for railways.     Cast iron used in rails proved unsatisfactory because it was brittle and broke under heavy loads. The ": null
    },
    {
        "wrought iron": "Wrought Iron"
    },
    {
        " invented by ": null
    },
    {
        "John Birkinshaw": "John Birkinshaw"
    },
    {
        " in 1820 replaced cast iron. ": null
    },
    {
        "Wrought iron": "Wrought Iron"
    },
    {
        " was a ductile material that could undergo considerable deformation before breaking, making it more suitable for iron rails. But iron was expensive to produce until ": null
    },
    {
        "Henry Cort": "Henry Cort"
    },
    {
        " patented the ": null
    },
    {
        "puddling process": "Puddling"
    },
    {
        " in 1784. In 1783 Cort also patented the ": null
    },
    {
        "rolling process": "Rolling"
    },
    {
        ", which was 15 times faster at consolidating and shaping iron than hammering.  These processes greatly lowered the cost of producing iron and rails. The next important development in iron production was ": null
    },
    {
        "hot blast": "Hot Blast"
    },
    {
        " developed by ": null
    },
    {
        "James Beaumont Neilson": "James Beaumont Neilson"
    },
    {
        " , which considerably reduced the amount of ": null
    },
    {
        "coke ": "Coke"
    },
    {
        " or charcoal needed to produce pig iron.  Wrought iron was a soft material that contained slag or dross. The softness and dross tended to make iron rails distort and delaminate and they lasted less than 10 years. Sometimes they lasted as little as one year under high traffic. All these developments in the production of iron eventually led to replacement of composite wood/iron rails with superior all iron rails.     The introduction of the ": null
    },
    {
        "Bessemer process": "Bessemer Process"
    },
    {
        ", enabling steel to be made inexpensively, led to the era of great expansion of railways that began in the late 1860s. Steel rails lasted several times longer than iron.    Steel rails made heavier locomotives possible, allowing for longer trains and improving the productivity of railroads.  The Bessemer process introduced nitrogen into the steel, which caused the steel to become brittle with age. The ": null
    },
    {
        "open hearth furnace": "Open Hearth Furnace"
    },
    {
        " began to replace the Bessemer process near the end of the 19th century, improving the quality of steel and further reducing costs. Thus steel completely replaced the use of iron in rails, becoming standard for all railways.     The first passenger ": null
    },
    {
        "horsecar": "Horsecar"
    },
    {
        " or ": null
    },
    {
        "tram": "Tram"
    },
    {
        ", ": null
    },
    {
        "Swansea and Mumbles Railway": "Swansea And Mumbles Railway"
    },
    {
        " was opened between ": null
    },
    {
        "Swansea": "Swansea"
    },
    {
        " and ": null
    },
    {
        "Mumbles": "Mumbles"
    },
    {
        " in ": null
    },
    {
        "Wales": "Wales"
    },
    {
        " in 1807.  Horses remained the preferable mode for tram transport even after the arrival of steam engines until the end of the 19th century, because they were cleaner compared to steam driven trams which caused smoke in city streets.            In 1784 ": null
    },
    {
        "James Watt": "James Watt"
    },
    {
        ", a Scottish inventor and mechanical engineer, patented a design for a ": null
    },
    {
        "steam locomotive": "Steam Locomotive"
    },
    {
        ". Watt had improved the ": null
    },
    {
        "steam engine": "Steam Engine"
    },
    {
        " of ": null
    },
    {
        "Thomas Newcomen": "Thomas Newcomen"
    },
    {
        ", hitherto used to pump water out of mines, and developed a ": null
    },
    {
        "reciprocating engine": "Reciprocating Engine"
    },
    {
        " in 1769 capable of powering a wheel. This was a large ": null
    },
    {
        "stationary engine": "Stationary Engine"
    },
    {
        ", powering cotton mills and a variety of machinery; the state of boiler technology necessitated the use of low pressure steam acting upon a vacuum in the cylinder, which required a separate ": null
    },
    {
        "condenser": "Condenser"
    },
    {
        " and an ": null
    },
    {
        "air pump": "Air Pump"
    },
    {
        ". Nevertheless, as the construction of boilers improved, Watt investigated the use of high-pressure steam acting directly upon a piston, raising the possibility of a smaller engine that might be used to power a vehicle. Following his patent, Watts employee ": null
    },
    {
        "William Murdoch": "William Murdoch"
    },
    {
        " produced a working model of a self-propelled steam carriage in that year.         The first full-scale working railway ": null
    },
    {
        "steam locomotive": "Steam Locomotive"
    },
    {
        " was built in the United Kingdom in 1804 by ": null
    },
    {
        "Richard Trevithick": "Richard Trevithick"
    },
    {
        ", a British engineer born in ": null
    },
    {
        "Cornwall": "Cornwall"
    },
    {
        ". This used high-pressure steam to drive the engine by one power stroke. The transmission system employed a large ": null
    },
    {
        "flywheel": "Flywheel"
    },
    {
        " to even out the action of the piston rod. On 21 February 1804, the worlds first steam-powered railway journey took place when Trevithicks unnamed steam locomotive hauled a train along the tramway of the ": null
    },
    {
        "Penydarren": "Penydarren"
    },
    {
        " ironworks, near ": null
    },
    {
        "Merthyr Tydfil": "Merthyr Tydfil"
    },
    {
        " in ": null
    },
    {
        "South Wales": "South Wales"
    },
    {
        ".   Trevithick later demonstrated a locomotive operating upon a piece of circular rail track in ": null
    },
    {
        "Bloomsbury": "Bloomsbury"
    },
    {
        ", London, the  Catch Me Who Can , but never got beyond the experimental stage with railway locomotives, not least because his engines were too heavy for the cast-iron plateway track then in use.         The first commercially successful steam locomotive was ": null
    },
    {
        "Matthew Murrays": "Matthew Murray"
    },
    {
        " rack": "Rack Railway"
    },
    {
        " locomotive  Salamanca  built for the ": null
    },
    {
        "Middleton Railway": "Middleton Railway"
    },
    {
        " in ": null
    },
    {
        "Leeds": "Leeds"
    },
    {
        " in 1812. This twin-cylinder locomotive was light enough to not break the ": null
    },
    {
        "edge-rails": "Wagonway"
    },
    {
        " track and solved the problem of ": null
    },
    {
        "adhesion": "Rail Adhesion"
    },
    {
        " by a ": null
    },
    {
        "cog-wheel": "Cog-Wheel"
    },
    {
        " using teeth cast on the side of one of the rails. Thus it was also the first ": null
    },
    {
        "rack railway": "Rack Railway"
    },
    {
        ".     This was followed in 1813 by the locomotive  Puffing Billy  built by ": null
    },
    {
        "Christopher Blackett": "Blackett Of Wylam"
    },
    {
        " and ": null
    },
    {
        "William Hedley": "William Hedley"
    },
    {
        " for the ": null
    },
    {
        "Wylam": "Wylam"
    },
    {
        " Colliery Railway, the first successful locomotive running by ": null
    },
    {
        "adhesion": "Rail Adhesion"
    },
    {
        " only. This was accomplished by the distribution of weight between a number of wheels. Puffing Billy is now on display in the ": null
    },
    {
        "Science Museum": "Science Museum"
    },
    {
        " in London, making it the oldest locomotive in existence.         In 1814 ": null
    },
    {
        "George Stephenson": "George Stephenson"
    },
    {
        ", inspired by the early locomotives of Trevithick, Murray and Hedley, persuaded the manager of the ": null
    },
    {
        "Killingworth": "Killingworth"
    },
    {
        " colliery": "Coal Mining"
    },
    {
        " where he worked to allow him to build a ": null
    },
    {
        "steam-powered": "Steam Engine"
    },
    {
        " machine. Stephenson played a pivotal role in the development and widespread adoption of the steam locomotive. His designs considerably improved on the work of the earlier pioneers. He built the locomotive  Blücher , also a successful ": null
    },
    {
        "flange": "Flange"
    },
    {
        "d-wheel adhesion locomotive. In 1825 he built the locomotive  Locomotion  for the ": null
    },
    {
        "Stockton and Darlington Railway": "Stockton And Darlington Railway"
    },
    {
        " in the north east of England, which became the first public steam railway in the world in 1825, although it used both horse power and steam power on different runs. In 1829, he built the locomotive  Rocket , which entered in and won the ": null
    },
    {
        "Rainhill Trials": "Rainhill Trials"
    },
    {
        ". This success led to Stephenson establishing his company as the pre-eminent builder of steam locomotives for railways in Great Britain and Ireland, the United States, and much of Europe.   The first public railway which used only steam locomotives, all the time, was ": null
    },
    {
        "Liverpool and Manchester Railway": "Liverpool And Manchester Railway"
    },
    {
        ", built in 1830.     Steam power continued to be the dominant power system in railways around the world for more than a century.            The first known electric locomotive was built in 1837 by chemist ": null
    },
    {
        "Robert Davidson": "Robert Davidson"
    },
    {
        " of ": null
    },
    {
        "Aberdeen": "Aberdeen"
    },
    {
        " in Scotland, and it was powered by ": null
    },
    {
        "galvanic cells": "Galvanic Cell"
    },
    {
        ". Thus it was also the earliest battery electric locomotive. Davidson later built a larger locomotive named Galvani, exhibited at the ": null
    },
    {
        "Royal Scottish Society of Arts": "Royal Scottish Society Of Arts"
    },
    {
        " Exhibition in 1841. The seven-ton vehicle had two ": null
    },
    {
        "direct-drive": "Direct-Drive"
    },
    {
        " reluctance motor": "Reluctance Motor"
    },
    {
        "s, with fixed electromagnets acting on iron bars attached to a wooden cylinder on each axle, and simple ": null
    },
    {
        "commutators": "Commutator"
    },
    {
        ". It hauled a load of six tons at four miles per hour for a distance of . It was tested on the ": null
    },
    {
        "Edinburgh and Glasgow Railway": "Edinburgh And Glasgow Railway"
    },
    {
        " in September of the following year, but the limited power from batteries prevented its general use. It was destroyed by railway workers, who saw it as a threat to their job security.   Renzo Pocaterra, Treni, De Agostini, 2003        ": null
    },
    {
        "Werner von Siemens": "Werner Von Siemens"
    },
    {
        " demonstrated an electric railway in 1879 in Berlin. The worlds first electric tram line, ": null
    },
    {
        "Gross-Lichterfelde Tramway": "Gross-Lichterfelde Tramway"
    },
    {
        ", opened in ": null
    },
    {
        "Lichterfelde": "Lichterfelde"
    },
    {
        " near ": null
    },
    {
        "Berlin": "Berlin"
    },
    {
        ", Germany, in 1881. It was built by Siemens. The tram ran on 180 Volt DC, which was supplied by running rails. In 1891 the track was equipped with an ": null
    },
    {
        "overhead wire": "Overhead Line"
    },
    {
        " and the line was extended to ": null
    },
    {
        "Berlin-Lichterfelde West station": "Berlin-Lichterfelde West Station"
    },
    {
        ". The ": null
    },
    {
        "Volks Electric Railway": "Volks Electric Railway"
    },
    {
        " opened in 1883 in ": null
    },
    {
        "Brighton": "Brighton"
    },
    {
        ", England. The railway is still operational, thus making it the oldest operational electric railway in the world. Also in 1883, ": null
    },
    {
        "Mödling and Hinterbrühl Tram": "Mödling And Hinterbrühl Tram"
    },
    {
        " opened near Vienna in Austria. It was the first tram line in the world in regular service powered from an overhead line. Five years later, in the U.S. electric ": null
    },
    {
        "trolleys": "Tram"
    },
    {
        " were pioneered in 1888 on the ": null
    },
    {
        "Richmond Union Passenger Railway": "Richmond Union Passenger Railway"
    },
    {
        ", using equipment designed by ": null
    },
    {
        "Frank J. Sprague": "Frank Julian Sprague"
    },
    {
        ".             The first use of electrification on a main line was on a four-mile section of the ": null
    },
    {
        "Baltimore Belt Line": "Baltimore Belt Line"
    },
    {
        " of the ": null
    },
    {
        "Baltimore and Ohio Railroad": "Baltimore And Ohio Railroad"
    },
    {
        " in 1895 connecting the main portion of the B & O to the new line to ": null
    },
    {
        "New York": "New York City"
    },
    {
        " through a series of tunnels around the edges of Baltimores downtown. Electricity quickly became the power supply of choice for subways, abetted by the Spragues invention of multiple-unit train control in 1897. By the early 1900s most street railways were electrified.          The ": null
    },
    {
        "London Underground": "London Underground"
    },
    {
        ", the worlds oldest underground railway, opened in 1863, and it began operating electric services using a ": null
    },
    {
        "fourth rail": "Fourth Rail"
    },
    {
        " system in 1890 on the ": null
    },
    {
        "City and South London Railway": "City And South London Railway"
    },
    {
        ", now part of the ": null
    },
    {
        "London Underground": "London Underground"
    },
    {
        " Northern line": "Northern Line"
    },
    {
        ". This was the first major railway to use ": null
    },
    {
        "electric traction": "Railway Electrification In Great Britain"
    },
    {
        ". The worlds first deep-level electric railway, it runs from the ": null
    },
    {
        "City of London": "City Of London"
    },
    {
        ", under the ": null
    },
    {
        "River Thames": "River Thames"
    },
    {
        ", to ": null
    },
    {
        "Stockwell": "Stockwell"
    },
    {
        " in south London.       The first practical ": null
    },
    {
        "AC": "Alternating Current"
    },
    {
        " electric locomotive was designed by ": null
    },
    {
        "Charles Brown": "Charles Eugene Lancelot Brown"
    },
    {
        ", then working for ": null
    },
    {
        "Oerlikon": "Maschinenfabrik Oerlikon"
    },
    {
        ", Zürich. In 1891, Brown had demonstrated long-distance power transmission, using ": null
    },
    {
        "three-phase AC": "Three-Phase Electric Power"
    },
    {
        ", between a ": null
    },
    {
        "hydro-electric plant": "Hydroelectricity"
    },
    {
        " at ": null
    },
    {
        "Lauffen am Neckar": "Lauffen Am Neckar"
    },
    {
        " and ": null
    },
    {
        "Frankfurt am Main": "Frankfurt Am Main"
    },
    {
        " West, a distance of 280  km. Using experience he had gained while working for ": null
    },
    {
        "Jean Heilmann": "Heilmann Locomotive"
    },
    {
        " on steam-electric locomotive designs, Brown observed that ": null
    },
    {
        "three-phase motors": "Ac Motorthree-Phase Ac Synchronous Motors"
    },
    {
        " had a higher power-to-weight ratio than ": null
    },
    {
        "DC": "Direct Current"
    },
    {
        " motors and, because of the absence of a ": null
    },
    {
        "commutator": "Commutator"
    },
    {
        ", were simpler to manufacture and maintain. Heilmann evaluated both AC and DC electric transmission for his locomotives, but eventually settled on a design based on ": null
    },
    {
        "Thomas Edisons": "Thomas Edison"
    },
    {
        "DC system – Duffy , pp. 39–41 However, they were much larger than the DC motors of the time and could not be mounted in underfloor ": null
    },
    {
        "bogie": "Bogie"
    },
    {
        "s: they could only be carried within locomotive bodies.     In 1894, Hungarian engineer ": null
    },
    {
        "Kálmán Kandó": "Kálmán Kandó"
    },
    {
        " developed a new type 3-phase asynchronous electric drive motors and generators for electric locomotives. Kandós early 1894 designs were first applied in a short three-phase AC tramway in Evian-les-Bains , which was constructed between 1896 and 1898.          In 1896, Oerlikon installed the first commercial example of the system on the ": null
    },
    {
        "Lugano Tramway": "Trams In Lugano"
    },
    {
        ". Each 30-tonne locomotive had two  motors run by three-phase 750  V 40  Hz fed from double overhead lines. Three-phase motors run at constant speed and provide ": null
    },
    {
        "regenerative braking": "Regenerative Brake"
    },
    {
        ", and are well suited to steeply graded routes, and the first main-line three-phase locomotives were supplied by Brown  in 1899 on the 40  km ": null
    },
    {
        "Burgdorf–Thun line": "List Of Railway Electrification Systemsburgdorf-Thun Bahn"
    },
    {
        ", Switzerland.        Italian railways were the first in the world to introduce electric traction for the entire length of a main line rather than a short section. The 106  km ": null
    },
    {
        "Valtellina": "Valtellina"
    },
    {
        " line was opened on 4 September 1902, designed by Kandó and a team from the Ganz works. The electrical system was three-phase at 3  kV 15  Hz. In 1918,  Kandó invented and developed the ": null
    },
    {
        "rotary phase converter": "Rotary Phase Converter"
    },
    {
        ", enabling electric locomotives to use three-phase motors whilst supplied via a single overhead wire, carrying the simple industrial frequency single phase AC of the high voltage national networks.      An important contribution to the wider adoption of AC traction came from SNCF of France after World War II. The company conducted trials at AC 50 HZ, and established it as a standard. Following SNCFs successful trials, 50 HZ, now also called industrial frequency was adopted as standard for main-lines across the world.               Earliest recorded examples of an internal combustion engine for railway use included a prototype designed by ": null
    },
    {
        "William Dent Priestman": "William Dent Priestman"
    },
    {
        ", which was examined by ": null
    },
    {
        "Sir William Thomson": "Sir William Thomson"
    },
    {
        " in 1888 who described it as a  mounted upon a truck which is worked on a temporary line of rails to show the adaptation of a petroleum engine for locomotive purposes. .   In 1894, a  two axle machine built by ": null
    },
    {
        "Priestman Brothers": "Priestman Brothers"
    },
    {
        " was used on the ": null
    },
    {
        "Hull Docks": "Hull Docks"
    },
    {
        ".      In 1906, ": null
    },
    {
        "Rudolf Diesel": "Rudolf Diesel"
    },
    {
        ", ": null
    },
    {
        "Adolf Klose": "Adolf Klose"
    },
    {
        " and the steam and diesel engine manufacturer ": null
    },
    {
        "Gebrüder Sulzer": "Gebrüder Sulzer"
    },
    {
        " founded Diesel-Sulzer-Klose GmbH to manufacture diesel-powered locomotives. Sulzer had been manufacturing diesel engines since 1898. The Prussian State Railways ordered a diesel locomotive from the company in 1909. The worlds first diesel-powered locomotive was operated in the summer of 1912 on the ": null
    },
    {
        "Winterthur–Romanshorn railway": "Winterthur–Romanshorn Railway"
    },
    {
        " in Switzerland, but was not a commercial success. The locomotive weight was 95 tonnes and the power was 883  kW with a maximum speed of 100  km/h.    Small numbers of prototype diesel locomotives were produced in a number of countries through the mid-1920s.        A significant breakthrough occurred in 1914, when ": null
    },
    {
        "Hermann Lemp": "Hermann Lemp"
    },
    {
        ", a ": null
    },
    {
        "General Electric": "General Electric"
    },
    {
        " electrical engineer, developed and patented a reliable ": null
    },
    {
        "direct current": "Direct Current"
    },
    {
        " electrical control system . Lemp, Hermann. U.S. Patent No. 1,154,785, filed 8 April 1914, and issued 28 September 1915. Accessed via Google Patent Search at: on February 8, 2007. Lemps design used a single lever to control both engine and generator in a coordinated fashion, and was the ": null
    },
    {
        "prototype": "Prototype"
    },
    {
        " for all ": null
    },
    {
        "diesel–electric locomotive": "Diesel–Electric Locomotive"
    },
    {
        " control systems. In 1914, worlds first functional diesel–electric railcars were produced for the Königlich-Sächsische Staatseisenbahnen  by ": null
    },
    {
        "Waggonfabrik Rastatt": "Waggonfabrik Rastatt"
    },
    {
        " with electric equipment from ": null
    },
    {
        "Brown, Boveri & Cie": "Brown, Boveri  &  Cie"
    },
    {
        " and diesel engines from ": null
    },
    {
        "Swiss": "Switzerland"
    },
    {
        " Sulzer AG": "Sulzer"
    },
    {
        ". They were classified as ": null
    },
    {
        "DET 1 and DET 2": "Saxon Det 1-2"
    },
    {
        " . The first regular use of diesel–electric locomotives was in ": null
    },
    {
        "switching": "Switcher"
    },
    {
        " applications. General Electric produced several small switching locomotives in the 1930s  Westinghouse Electric and Baldwin collaborated to build switching locomotives starting in 1929.     In 1929, the ": null
    },
    {
        "Canadian National Railways": "Canadian National Railways"
    },
    {
        " became the first North American railway to use diesels in mainline service with two units, 9000 and 9001, from Westinghouse.          Although steam and diesel services reaching speeds up to 200  km/h were started before the 1960s in Europe, they were not very successful.        The first electrified ": null
    },
    {
        "high-speed rail": "High-Speed Rail"
    },
    {
        " Tōkaidō Shinkansen": "Tōkaidō Shinkansen"
    },
    {
        " was introduced in 1964 between ": null
    },
    {
        "Tokyo": "Tokyo"
    },
    {
        " and ": null
    },
    {
        "Osaka": "Osaka"
    },
    {
        " in Japan. Since then ": null
    },
    {
        "high-speed rail": "High-Speed Rail"
    },
    {
        " transport, functioning at speeds up to and above 300  km/h, has been built in Japan, Spain, France, Germany, Italy, the Peoples Republic of China, Taiwan , the ": null
    },
    {
        "United Kingdom": "United Kingdom"
    },
    {
        ", ": null
    },
    {
        "South Korea": "South Korea"
    },
    {
        ", ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        ", ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        " and the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        ". The construction of many of these lines has resulted in the dramatic decline of short haul flights and automotive traffic between connected cities, such as the London–Paris–Brussels corridor, Madrid–Barcelona, Milan–Rome–Naples, as well as many other major lines.     High-speed trains normally operate on ": null
    },
    {
        "standard gauge": "Standard Gauge"
    },
    {
        " tracks of ": null
    },
    {
        "continuously welded rail": "Continuously Welded Rail"
    },
    {
        " on ": null
    },
    {
        "grade-separated": "Grade Separation"
    },
    {
        " right-of-way": "Right-Of-Way"
    },
    {
        " that incorporates a large ": null
    },
    {
        "turning radius": "Minimum Railway Curve Radius"
    },
    {
        " in its design. While high-speed rail is most often designed for passenger travel, some high-speed systems also offer freight service.          A train is a connected series of rail vehicles that move along the track. Propulsion for the train is provided by a separate locomotive or from individual motors in self-propelled multiple units. Most trains carry a revenue load, although non-revenue cars exist for the railways own use, such as for ": null
    },
    {
        "maintenance-of-way": "Maintenance-Of-Way"
    },
    {
        " purposes. The ": null
    },
    {
        "engine driver": "Railroad Engineer"
    },
    {
        " controls the locomotive or other power cars, although ": null
    },
    {
        "people movers": "People Mover"
    },
    {
        "and some rapid transits are under automatic control.          Traditionally, trains are pulled using a locomotive. This involves one or more powered vehicles being located at the front of the train, providing sufficient ": null
    },
    {
        "tractive force": "Tractive Force"
    },
    {
        " to haul the weight of the full train. This arrangement remains dominant for freight trains and is often used for passenger trains. A ": null
    },
    {
        "push–pull train": "Push–Pull Train"
    },
    {
        " has the end passenger car equipped with a drivers cab so that the engine driver can remotely control the locomotive. This allows one of the locomotive-hauled trains drawbacks to be removed, since the locomotive need not be moved to the front of the train each time the train changes direction. A ": null
    },
    {
        "railroad car": "Railroad Car"
    },
    {
        " is a vehicle used for the haulage of either passengers or freight.     A multiple unit has powered wheels throughout the whole train. These are used for rapid transit and tram systems, as well as many both short- and long-haul passenger trains. A ": null
    },
    {
        "railcar": "Railcar"
    },
    {
        " is a single, self-powered car, and may be electrically-propelled or powered by a ": null
    },
    {
        "diesel engine": "Diesel Engine"
    },
    {
        ". Multiple units have a drivers cab at each end of the unit, and were developed following the ability to build ": null
    },
    {
        "electric motors": "Electric Motor"
    },
    {
        "and ": null
    },
    {
        "engines": "Engine"
    },
    {
        " small enough to fit under the coach. There are only a few freight multiple units, most of which are high-speed post trains.          ": null
    },
    {
        "Steam locomotives": "Steam Locomotive"
    },
    {
        "are locomotives with a ": null
    },
    {
        "steam engine": "Steam Engine"
    },
    {
        " that provides adhesion. ": null
    },
    {
        "Coal": "Coal"
    },
    {
        ", ": null
    },
    {
        "petroleum": "Petroleum"
    },
    {
        ", or ": null
    },
    {
        "wood": "Wood"
    },
    {
        " is burned in a ": null
    },
    {
        "firebox": "Firebox"
    },
    {
        ", boiling water in the ": null
    },
    {
        "boiler": "Fire-Tube Boiler"
    },
    {
        " to create pressurized steam. The steam travels through the ": null
    },
    {
        "smokebox": "Smokebox"
    },
    {
        " before leaving via the chimney or smoke stack. In the process, it powers a ": null
    },
    {
        "piston": "Piston"
    },
    {
        " that transmits power directly through a ": null
    },
    {
        "connecting rod": "Connecting Rod"
    },
    {
        " and a ": null
    },
    {
        "crankpin": "Crankpin"
    },
    {
        " on the ": null
    },
    {
        "driving wheel": "Driving Wheel"
    },
    {
        " or to a ": null
    },
    {
        "crank": "Crankshaft"
    },
    {
        " on a driving axle. Steam locomotives have been phased out in most parts of the world for economical and safety reasons, although many are preserved in working order by ": null
    },
    {
        "heritage railway": "Heritage Railway"
    },
    {
        "s.     ": null
    },
    {
        "Electric locomotives": "Electric Locomotive"
    },
    {
        "draw power from a stationary source via an ": null
    },
    {
        "overhead wire": "Overhead Lines"
    },
    {
        " or ": null
    },
    {
        "third rail": "Third Rail"
    },
    {
        ". Some also or instead use a ": null
    },
    {
        "battery": "Battery"
    },
    {
        ". In locomotives that are powered by high voltage ": null
    },
    {
        "alternating current": "Alternating Current"
    },
    {
        ", a ": null
    },
    {
        "transformer": "Transformer"
    },
    {
        " in the locomotive converts the high voltage, low current power to low voltage, high current used in the ": null
    },
    {
        "traction motors": "Electric Motor"
    },
    {
        " that power the wheels. Modern locomotives may use ": null
    },
    {
        "three-phase AC induction motors": "Electric Motorthree-Phase Ac Induction Motors"
    },
    {
        " or ": null
    },
    {
        "direct current": "Direct Current"
    },
    {
        " motors. Under certain conditions, electric locomotives are the most powerful traction. They are also the cheapest to run and provide less noise and no local air pollution. However, they require high capital investments both for the ": null
    },
    {
        "overhead lines": "Overhead Lines"
    },
    {
        " and the supporting infrastructure, as well as the generating station that is needed to produce electricity. Accordingly, electric traction is used on urban systems, lines with high traffic and for high-speed rail.     ": null
    },
    {
        "Diesel locomotives": "Diesel Locomotive"
    },
    {
        "use a diesel engine as the ": null
    },
    {
        "prime mover": "Prime Mover"
    },
    {
        ". The energy transmission may be either ": null
    },
    {
        "diesel-electric": "Diesel-Electric Transmission"
    },
    {
        ", diesel-mechanical or diesel-hydraulic but diesel-electric is dominant. ": null
    },
    {
        "Electro-diesel locomotives": "Electro-Diesel Locomotive"
    },
    {
        "are built to run as diesel-electric on unelectrified sections and as electric locomotives on electrified sections.     Alternative methods of motive power include ": null
    },
    {
        "magnetic levitation": "Maglev"
    },
    {
        ", horse-drawn, ": null
    },
    {
        "cable": "Funicular"
    },
    {
        ", gravity, ": null
    },
    {
        "pneumatics": "Pneumatics"
    },
    {
        " and ": null
    },
    {
        "gas turbine": "Gas Turbine"
    },
    {
        ".       A passenger train travels between stations where passengers may embark and disembark. The oversight of the train is the duty of a ": null
    },
    {
        "guard/train manager/conductor": "Conductor"
    },
    {
        ". Passenger trains are part of public transport and often make up the stem of the service, with buses feeding to stations. Passenger trains provide long-distance intercity travel, daily commuter trips, or local urban transit services. They even include a diversity of vehicles, operating speeds, right-of-way requirements, and service frequency. Passenger trains usually can be divided into two operations: intercity railway and intracity transit. Whereas intercity railway involve higher speeds, longer routes, and lower frequency , intracity transit involves lower speeds, shorter routes, and higher frequency . American Railway Engineering and Maintenance of Way Association Committee 24 – Education and Training. . Practical Guide to Railway Engineering. AREMA, 2nd Ed.      ": null
    },
    {
        "Intercity trains": "Inter-City Rail"
    },
    {
        " are long-haul trains that operate with few stops between cities. Trains typically have amenities such as a ": null
    },
    {
        "dining car": "Dining Car"
    },
    {
        ". Some lines also provide over-night services with ": null
    },
    {
        "sleeping car": "Sleeping Car"
    },
    {
        "s. Some long-haul trains have been given a ": null
    },
    {
        "specific name": "Lists Of Named Passenger Trains"
    },
    {
        ". ": null
    },
    {
        "Regional trains": "Regional Rail"
    },
    {
        " are medium distance trains that connect cities with outlying, surrounding areas, or provide a regional service, making more stops and having lower speeds. ": null
    },
    {
        "Commuter trains": "Commuter Rail"
    },
    {
        " serve suburbs of urban areas, providing a daily ": null
    },
    {
        "commuting": "Commuting"
    },
    {
        " service. ": null
    },
    {
        "Airport rail links": "Airport Rail Link"
    },
    {
        "provide quick access from city centres to ": null
    },
    {
        "airport": "Airport"
    },
    {
        "s.     ": null
    },
    {
        "High-speed rail": "High-Speed Rail"
    },
    {
        " are special inter-city trains that operate at much higher speeds than conventional railways, the limit being regarded at . High-speed trains are used mostly for long-haul service and most systems are in Western Europe and East Asia. The ": null
    },
    {
        "speed record": "Land Speed Record For Railed Vehicles"
    },
    {
        " is , set by a modified French ": null
    },
    {
        "TGV": "Tgv"
    },
    {
        ".   ": null
    },
    {
        "Magnetic levitation": "Maglev"
    },
    {
        " trains such as the Shanghai airport train use under-riding magnets which attract themselves upward towards the underside of a guideway and this line has achieved somewhat higher peak speeds in day-to-day operation than conventional high-speed railways, although only over short distances. Due to their heightened speeds, route alignments for high-speed rail tend to have shallower grades and broader curves than conventional railways.     Their high kinetic energy translates to higher horsepower-to-ton ratios ; this allows trains to accelerate and maintain higher speeds and negotiate steep grades as momentum builds up and recovered in downgrades . Since lateral forces act on curves, curvatures are designed with the highest possible radius. All these features are dramatically different from freight operations, thus justifying exclusive high-speed rail lines if it is economically feasible.     ": null
    },
    {
        "Higher-speed rail": "Higher-Speed Rail"
    },
    {
        " services are intercity rail services that have top speeds higher than conventional intercity trains but the speeds are not as high as those in the high-speed rail services. These services are provided after improvements to the conventional rail infrastructure in order to support trains that can operate safely at higher speeds.      ": null
    },
    {
        "Rapid transit": "Rapid Transit"
    },
    {
        " is an intracity system built in large cities and has the highest capacity of any passenger transport system. It is usually grade-separated and commonly built underground or elevated. At street level, smaller ": null
    },
    {
        "trams": "Tram"
    },
    {
        "can be used. ": null
    },
    {
        "Light rails": "Light Rail"
    },
    {
        "are upgraded trams that have step-free access, their own right-of-way and sometimes sections underground. ": null
    },
    {
        "Monorail": "Monorail"
    },
    {
        " systems are elevated, medium-capacity systems. A ": null
    },
    {
        "people mover": "People Mover"
    },
    {
        " is a driverless, grade-separated train that serves only a few stations, as a shuttle. Due to the lack of uniformity of rapid transit systems, route alignment varies, with diverse rights-of-way and ": null
    },
    {
        "geometric characteristics": "Track Geometry"
    },
    {
        " . For instance, the ": null
    },
    {
        "Chicago L": "Chicago L"
    },
    {
        " trains are designed with extremely short cars to negotiate the sharp curves in the ": null
    },
    {
        "Loop": "The Loop"
    },
    {
        ". New Jerseys ": null
    },
    {
        "PATH": "Port Authority Trans-Hudson"
    },
    {
        " has similar-sized cars to accommodate curves in the trans-Hudson tunnels. San Franciscos ": null
    },
    {
        "BART": "Bart"
    },
    {
        " operates large cars on its routes.               A freight train hauls ": null
    },
    {
        "cargo": "Cargo"
    },
    {
        " using ": null
    },
    {
        "freight cars": "Goods Wagon"
    },
    {
        " specialized for the type of goods. Freight trains are very efficient, with economy of scale and high energy efficiency. However, their use can be reduced by lack of flexibility, if there is need of transshipment at both ends of the trip due to lack of tracks to the points of pick-up and delivery. Authorities often encourage the use of cargo rail transport due to its fame.      ": null
    },
    {
        "Container trains": "Containerization"
    },
    {
        " have become the beta type in the US for bulk haulage. Containers can easily be transshipped to other modes, such as ships and trucks, using cranes. This has succeeded the ": null
    },
    {
        "boxcar": "Boxcar"
    },
    {
        " , where the cargo had to be loaded and unloaded into the train manually. The intermodal ": null
    },
    {
        "containerization": "Containerization"
    },
    {
        " of cargo has revolutionized the ": null
    },
    {
        "supply chain": "Supply Chain"
    },
    {
        " logistics": "Logistics"
    },
    {
        " industry, reducing ship costs significantly. In Europe, the ": null
    },
    {
        "sliding wall wagon": "Goods Vansliding Wall Wagons"
    },
    {
        " has largely superseded the ": null
    },
    {
        "ordinary covered wagons": "Goods Van"
    },
    {
        ". Other types of cars include ": null
    },
    {
        "refrigerator car": "Refrigerator Car"
    },
    {
        "s, ": null
    },
    {
        "stock cars": "Stock Car"
    },
    {
        " for livestock and ": null
    },
    {
        "autoracks": "Autorack"
    },
    {
        "for road vehicles. When rail is combined with road transport, a ": null
    },
    {
        "roadrailer": "Roadrailer"
    },
    {
        " will allow ": null
    },
    {
        "trailers": "Semi-Trailer"
    },
    {
        " to be driven onto the train, allowing for easy transition between road and rail.     ": null
    },
    {
        "Bulk handling": "Bulk Material Handling"
    },
    {
        " represents a key advantage for rail transport. Low or even zero transshipment costs combined with energy efficiency and low inventory costs allow trains to handle ": null
    },
    {
        "bulk": "Bulk Cargo"
    },
    {
        " much cheaper than by road. Typical bulk cargo includes coal, ore, grains and liquids. Bulk is transported in ": null
    },
    {
        "open-topped cars": "Gondola"
    },
    {
        ", ": null
    },
    {
        "hopper cars": "Hopper Car"
    },
    {
        "and ": null
    },
    {
        "tank car": "Tank Car"
    },
    {
        "s.              Railway tracks are laid upon land owned or leased by the railway company. Owing to the desirability of maintaining modest grades, rails will often be laid in circuitous routes in hilly or mountainous terrain. Route length and grade requirements can be reduced by the use of alternating ": null
    },
    {
        "cuttings": "Cutting"
    },
    {
        ", bridges and tunnels  – all of which can greatly increase the capital expenditures required to develop a right of way, while significantly reducing operating costs and allowing higher speeds on longer radius curves. In densely urbanized areas, railways are sometimes laid in tunnels to minimize the effects on existing properties.                  Track consists of two parallel steel rails, anchored ": null
    },
    {
        "perpendicular": "Perpendicular"
    },
    {
        " to members called ": null
    },
    {
        "ties": "Railroad Tie"
    },
    {
        " of timber, concrete, steel, or plastic to maintain a consistent distance apart, or ": null
    },
    {
        "rail gauge": "Rail Gauge"
    },
    {
        ". Rail gauges are usually categorized as ": null
    },
    {
        "standard gauge": "Standard Gauge"
    },
    {
        " , ": null
    },
    {
        "broad gauge": "Broad Gauge"
    },
    {
        ", and ": null
    },
    {
        "narrow gauge": "Narrow Gauge"
    },
    {
        ". In addition to the rail gauge, the tracks will be laid to conform with a ": null
    },
    {
        "Loading gauge": "Loading Gauge"
    },
    {
        " which defines the maximum height and width for railway vehicles and their loads to ensure safe passage through bridges, tunnels and other structures.     The track guides the conical, flanged wheels, keeping the cars on the track without active steering and therefore allowing trains to be much longer than road vehicles. The rails and ties are usually placed on a foundation made of compressed earth on top of which is placed a bed of ": null
    },
    {
        "ballast": "Track Ballast"
    },
    {
        " to distribute the load from the ties and to prevent the track from ": null
    },
    {
        "buckling": "Buckling"
    },
    {
        " as the ground settles over time under the weight of the vehicles passing above.     The ballast also serves as a means of drainage. Some more modern track in special areas is attached by ": null
    },
    {
        "direct fixation": "Direct Fixation"
    },
    {
        " without ballast. Track may be prefabricated or assembled in place. By ": null
    },
    {
        "welding": "Thermite Welding"
    },
    {
        " rails together to form lengths of ": null
    },
    {
        "continuous welded rail": "Continuous Welded Rail"
    },
    {
        ", additional wear and tear on rolling stock caused by the small surface gap at the joints between rails can be counteracted; this also makes for a quieter ride.     On curves the outer rail may be at a higher level than the inner rail. This is called superelevation or ": null
    },
    {
        "cant": "Cant"
    },
    {
        ". This reduces the forces tending to displace the track and makes for a more comfortable ride for standing livestock and standing or seated passengers. A given amount of superelevation is most effective over a limited range of speeds.     ": null
    },
    {
        "Turnouts": "Railroad Switch"
    },
    {
        ", also known as points and switches, are the means of directing a train onto a diverging section of track. Laid similar to normal track, a point typically consists of a ": null
    },
    {
        "frog": "Switch Frog"
    },
    {
        " , check rails and two switch rails. The switch rails may be moved left or right, under the control of the signalling system, to determine which path the train will follow.     Spikes in wooden ties can loosen over time, but split and rotten ties may be individually replaced with new wooden ties or concrete substitutes. Concrete ties can also develop cracks or splits, and can also be replaced individually. Should the rails settle due to soil subsidence, they can be lifted by specialized machinery and additional ballast tamped under the ties to level the rails.     Periodically, ballast must be removed and replaced with clean ballast to ensure adequate drainage. Culverts and other passages for water must be kept clear lest water is impounded by the trackbed, causing landslips. Where trackbeds are placed along rivers, additional protection is usually placed to prevent streambank erosion during times of high water. Bridges require inspection and maintenance, since they are subject to large surges of stress in a short period of time when a heavy train crosses.       The inspection of railway equipment is essential for the safe movement of trains. Many types of ": null
    },
    {
        "defect detectors": "Defect Detector"
    },
    {
        "are in use on the worlds railroads. These devices utilize technologies that vary from a simplistic paddle and switch to ": null
    },
    {
        "infrared": "Infrared"
    },
    {
        " and laser scanning, and even ": null
    },
    {
        "ultrasonic audio analysis": "Ultrasonic Testing"
    },
    {
        ". Their use has avoided many rail accidents over the 70 years they have been used.             ": null
    },
    {
        "Railway signalling": "Railway Signalling"
    },
    {
        " is a system used to control railway traffic safely to prevent trains from colliding. Being guided by fixed ": null
    },
    {
        "rails": "Track"
    },
    {
        " which generate low friction, trains are uniquely susceptible to collision since they frequently operate at speeds that do not enable them to stop quickly or within the drivers sighting distance; road vehicles, which encounter a higher level of friction between their rubber tyres and the road surface, have much shorter braking distances. Most forms of train control involve movement authority being passed from those responsible for each section of a rail network to the train crew. Not all methods require the use of signals, and some systems are specific to ": null
    },
    {
        "single track": "Single Track"
    },
    {
        " railways.     The signalling process is traditionally carried out in a ": null
    },
    {
        "signal box": "Signal Box"
    },
    {
        ", a small building that houses the ": null
    },
    {
        "lever frame": "Lever Frame"
    },
    {
        " required for the signalman to operate switches and signal equipment. These are placed at various intervals along the route of a railway, controlling specified sections of track. More recent technological developments have made such operational doctrine superfluous, with the centralization of signalling operations to regional control rooms. This has been facilitated by the increased use of computers, allowing vast sections of track to be monitored from a single location. The common method of ": null
    },
    {
        "block signalling": "Railway Signallingblocks"
    },
    {
        " divides the track into zones guarded by combinations of block signals, operating rules, and automatic-control devices so that only one train may be in a block at any time.          The electrification system provides electrical energy to the trains, so they can operate without a prime mover on board. This allows lower operating costs, but requires large capital investments along the lines. Mainline and tram systems normally have overhead wires, which hang from poles along the line. Grade-separated rapid transit sometimes use a ground ": null
    },
    {
        "third rail": "Third Rail"
    },
    {
        ".     Power may be fed as ": null
    },
    {
        "direct": "Direct Current"
    },
    {
        " or ": null
    },
    {
        "alternating current": "Alternating Current"
    },
    {
        ". The most common DC voltages are 600 and 750  V for tram and rapid transit systems, and 1,500  and 3,000  V for mainlines. The two dominant AC systems are ": null
    },
    {
        "15 kV AC": "15 Kv Ac Railway Electrification"
    },
    {
        " and ": null
    },
    {
        "25 kV AC": "25 Kv Ac Railway Electrification"
    },
    {
        ".               A ": null
    },
    {
        "railway station": "Railway Station"
    },
    {
        " serves as an area where passengers can board and alight from trains. A ": null
    },
    {
        "goods station": "Goods Station"
    },
    {
        " is a yard which is exclusively used for loading and unloading cargo. Large passenger stations have at least one building providing conveniences for passengers, such as purchasing tickets and food. Smaller stations typically only consist of a ": null
    },
    {
        "platform": "Railway Platform"
    },
    {
        ". Early stations were sometimes built with both passenger and goods facilities.      Platforms are used to allow easy access to the trains, and are connected to each other via ": null
    },
    {
        "underpass": "Underpass"
    },
    {
        "es, ": null
    },
    {
        "footbridges": "Footbridge"
    },
    {
        "and level crossings. Some large stations are built as ": null
    },
    {
        "culs-de-sac": "Cul-De-Sac"
    },
    {
        ", with trains only operating out from one direction. Smaller stations normally serve local residential areas, and may have connection to feeder bus services. Large stations, in particular ": null
    },
    {
        "central station": "Central Station"
    },
    {
        "s, serve as the main ": null
    },
    {
        "public transport hub": "Transport Hub"
    },
    {
        " for the city, and have transfer available between rail services, and to rapid transit, tram or bus services.                Since the 1980s, there has been an increasing trend to split up railway companies, with companies owning the rolling stock separated from those owning the infrastructure. This is particularly true in Europe, where this arrangement is required by the European Union. This has allowed open access by any train operator to any portion of the European railway network. In the UK, the railway track is state owned, with a public controlled body  running, maintaining and developing the track, while Train Operating Companies have run the trains since ": null
    },
    {
        "privatization in the 1990s": "Privatisation Of British Rail"
    },
    {
        ".      In the U.S., virtually all rail networks and infrastructure outside the ": null
    },
    {
        "Northeast Corridor": "Northeast Corridor"
    },
    {
        " are privately owned by freight lines. Passenger lines, primarily ": null
    },
    {
        "Amtrak": "Amtrak"
    },
    {
        ", operate as tenants on the freight lines. Consequently, operations must be closely synchronized and coordinated between freight and passenger railroads, with passenger trains often being dispatched by the host freight railroad. Due to this shared system, both are regulated by the ": null
    },
    {
        "Federal Railroad Administration": "Federal Railroad Administration"
    },
    {
        " and may follow the ": null
    },
    {
        "AREMA": "American Railway Engineering And Maintenance-Of-Way Association"
    },
    {
        " recommended practices for track work and ": null
    },
    {
        "AAR": "Association Of American Railroads"
    },
    {
        " standards for vehicles.       The main source of income for railway companies is from ": null
    },
    {
        "ticket": "Train Ticket"
    },
    {
        " revenue and shipment fees for cargo. Discounts and monthly passes are sometimes available for frequent travellers . Freight revenue may be sold per container slot or for a whole train. Sometimes, the shipper owns the cars and only rents the haulage. For passenger transport, ": null
    },
    {
        "advertisement": "Advertisement"
    },
    {
        " income can be significant.     Governments may choose to give subsidies to rail operation, since rail transport has fewer ": null
    },
    {
        "externalities": "Externalities"
    },
    {
        " than other dominant modes of transport. If the railway company is state-owned, the state may simply provide direct subsidies in exchange for increased production. If operations have been privatized, several options are available. Some countries have a system where the infrastructure is owned by a government agency or company  – with open access to the tracks for any company that meets safety requirements. In such cases, the state may choose to provide the tracks free of charge, or for a fee that does not cover all costs. This is seen as analogous to the government providing free access to roads. For passenger operations, a direct subsidy may be paid to a public-owned operator, or ": null
    },
    {
        "public service obligation": "Public Service Obligation"
    },
    {
        " tender may be helt, and a time-limited contract awarded to the lowest bidder. ": null
    },
    {
        "Total EU rail subsidies": "Rail Transport In Europesubsidies"
    },
    {
        " amounted to €73 billion in 2005.      ": null
    },
    {
        "Amtrak": "Amtrak"
    },
    {
        ", the US passenger rail service, and Canadas ": null
    },
    {
        "Via Rail": "Via Rail"
    },
    {
        " are private railroad companies chartered by their respective national governments. As private passenger services declined because of competition from automobiles and airlines, they became ": null
    },
    {
        "shareholders": "Shareholder"
    },
    {
        "of Amtrak either with a cash entrance fee or relinquishing their locomotives and rolling stock. The government subsidizes Amtrak by supplying start-up ": null
    },
    {
        "capital": "Capital"
    },
    {
        " and making up for losses at the end of the ": null
    },
    {
        "fiscal year": "Fiscal Year"
    },
    {
        ".            Trains can travel at very high speed, but they are heavy, are unable to deviate from the track and require a great distance to stop. Possible accidents include ": null
    },
    {
        "derailment": "Derailment"
    },
    {
        " , a collision with another train or collision with automobiles, other vehicles or pedestrians at ": null
    },
    {
        "level crossing": "Level Crossing"
    },
    {
        "s. The last accounts for the majority of rail accidents and casualties. The most important safety measures to prevent accidents are strict operating rules, e.g. ": null
    },
    {
        "railway signalling": "Railway Signalling"
    },
    {
        " and gates or ": null
    },
    {
        "grade separation": "Grade Separation"
    },
    {
        " at crossings. ": null
    },
    {
        "Train whistle": "Train Whistle"
    },
    {
        "s, bells or ": null
    },
    {
        "horns": "Train Horn"
    },
    {
        " warn of the presence of a train, while trackside signals maintain the distances between trains.     An important element in the safety of many high-speed inter-city networks such as Japans ": null
    },
    {
        "Shinkansen": "Shinkansen"
    },
    {
        " is the fact that trains only run on dedicated railway lines, without level crossings. This effectively eliminates the potential for collision with automobiles, other vehicles or pedestrians, vastly reduces the likelihood of collision with other trains and helps ensure services remain timely.       As in any ": null
    },
    {
        "infrastructure": "Infrastructure"
    },
    {
        " asset, railways must keep up with periodic inspection and maintenance in order to minimize effect of infrastructure failures that can disrupt freight revenue operations and passenger services. Because passengers are considered the most crucial cargo and usually operate at higher speeds, steeper grades, and higher capacity/frequency, their lines are especially important. Inspection practices include ": null
    },
    {
        "track geometry cars": "Track Geometry Car"
    },
    {
        "or walking inspection. Curve maintenance especially for transit services includes gauging, fastener tightening, and rail replacement.     Rail corrugation is a common issue with transit systems due to the high number of light-axle, wheel passages which result in grinding of the wheel/rail interface. Since maintenance may overlap with operations, maintenance windows  must be closely followed. In addition, passenger safety during maintenance work must be regarded at all times. At times, maintenance access problems can emerge due to tunnels, elevated structures, and congested cityscapes. Here, specialized equipment or smaller versions of conventional maintenance gear are used.     Unlike ": null
    },
    {
        "highways": "Highways"
    },
    {
        " or ": null
    },
    {
        "road networks": "Road Network"
    },
    {
        "where capacity is disaggregated into unlinked trips over individual route segments, railway capacity is fundamentally considered a network system. As a result, many components are causes and effects of system disruptions. Maintenance must acknowledge the vast array of a routes performance , lines capacity , trains throughput , and service features with shared passenger-freight tracks .                 Rail transport is an ": null
    },
    {
        "energy-efficient": "Energy Efficiency In Transport"
    },
    {
        "  but ": null
    },
    {
        "capital-intensive": "Capital Intensive"
    },
    {
        " means of mechanized land transport. The tracks provide smooth and hard surfaces on which the wheels of the train can roll with a relatively low level of friction being generated. Moving a vehicle on and/or through a medium requires that it overcomes resistance to its motion caused by friction. A land vehicles total resistance  is a ": null
    },
    {
        "quadratic function": "Quadratic Function"
    },
    {
        " of the vehicles speed:     :   R a + bv + cv2     where:   :R denotes total resistance   :a denotes initial constant resistance   :b denotes velocity-related constant   :c denotes constant that is function of shape, frontal area, and sides of vehicle   :v denotes velocity   :v 2 denotes velocity, squared     Essentially, resistance differs between vehicles contact point and surface of roadway. Metal wheels on metal rails have a significant advantage of overcoming resistance compared to rubber-tyred wheels on any road surface . In terms of cargo capacity combining speed and size being moved in a day:   human – can carry  for  per day, or 1 ": null
    },
    {
        "tmi": "Units Of Transportation Measurementpayload-Distance"
    },
    {
        "/day    horse and wheelbarrow – can carry 4 tmi/day   horse cart on good pavement – can carry 10 tmi/day   fully utility truck – can carry 20,000 tmi/day  , a railway and pipeline requires , and truck requires . However, at higher speeds, a railway overcomes the barge and proves most economical.     As an example, a typical modern wagon can hold up to  of freight on two four-wheel ": null
    },
    {
        "bogie": "Bogie"
    },
    {
        "s. The track distributes the weight of the train evenly, allowing significantly greater loads per ": null
    },
    {
        "axle": "Axle"
    },
    {
        " and wheel than in road transport, leading to less wear and tear on the permanent way. This can save energy compared with other forms of transport, such as road transport, which depends on the friction between rubber tyres and the road. Trains have a small frontal area in relation to the load they are carrying, which reduces ": null
    },
    {
        "air resistance": "Air Resistance"
    },
    {
        " and thus energy usage.     In addition, the presence of track guiding the wheels allows for very long trains to be pulled by one or a few engines and driven by a single operator, even around curves, which allows for ": null
    },
    {
        "economies of scale": "Economies Of Scale"
    },
    {
        " in both manpower and energy use; by contrast, in road transport, more than two ": null
    },
    {
        "articulations": "Articulated Vehicle"
    },
    {
        " causes ": null
    },
    {
        "fishtailing": "Fishtailing"
    },
    {
        " and makes the vehicle unsafe.          Considering only the energy spent to move the means of transport, and using the example of the urban area of ": null
    },
    {
        "Lisbon": "Lisbon"
    },
    {
        ", electric trains seem to be on average 20 times more efficient than automobiles for transportation of passengers, if we consider energy spent per passenger-distance with similar occupation ratios.  Considering an automobile with a consumption of around  of fuel, the average car in Europe has an occupancy of around 1.2 passengers per automobile and that ": null
    },
    {
        "one litre of fuel": "Fuel Efficiency"
    },
    {
        " amounts to about , equating to an average of  per passenger-km. This compares to a modern train with an average occupancy of 20% and a consumption of about , equating to  per passenger-km, 20 times less than the automobile.       Due to these benefits, rail transport is a major form of passenger and freight transport in many countries. It is ubiquitous in Europe, with an integrated network covering virtually the whole continent. In India, China, South Korea and Japan, many millions use trains as regular transport. In North America, freight rail transport is widespread and heavily used, but intercity passenger rail transport is relatively scarce outside the ": null
    },
    {
        "Northeast Corridor": "Northeast Corridor"
    },
    {
        ", due to increased preference of other modes, particularly automobiles and airplanes.     South Africa, northern Africa and Argentina have extensive rail networks, but some railways elsewhere in Africa and South America are isolated lines. Australia has a generally sparse network befitting its population density but has some areas with significant networks, especially in the southeast. In addition to the previously existing east-west transcontinental line in Australia, a line from north to south has been constructed. The highest railway in the world is the ": null
    },
    {
        "line to Lhasa": "Qingzang Railway"
    },
    {
        ", in Tibet,  partly running over permafrost territory. Western Europe has the highest railway density in the world and many individual trains there operate through several countries despite technical and organizational differences in each national network.              Railways are central to the formation of modernity and ideas of progress. Schivelbusch, G. The Railway Journey: Industrialization and Perception of Time and Space in the 19th Century. Oxford: Berg. The process of modernization in the 19th century involved a transition from a spatially oriented world to a time oriented world. Exact time was essential, and everyone had to know what the time was, resulting in clocks towers for railway stations, clocks in public places, pocket watches for railway workers and for travelers. Trains left on time . By contrast, in the premodern era, passenger ships left when the captain had enough passengers. In the premodern era, local time was set at noon, when the sun was at its highest. Every place east to west had a different time and that changed with the introduction of standard time zones. Printed time tables were a convenience for the travelers, but more elaborate time tables, called ": null
    },
    {
        "train orders,": "Train Order Operation"
    },
    {
        " were even more essential for the train crews, the maintenance workers, the station personnel, and for the repair and maintenance crews, who knew when to expect a train would come along. Most trackage was single track, with sidings and signals to allow lower priority trains to be sidetracked. Schedules told everyone what to do, where to be, and exactly when. If bad weather disrupted the system, telegraphers relayed immediate corrections and updates throughout the system. Just as railways as business organizations created the standards and models for modern big business, so too the railway timetable was adapted to myriad uses, such as schedules for buses ferries, and airplanes, for radio and television programs, for school schedules, for factory time clocks. The modern world was ruled by the clock and the timetable. Tony Judt, When the Facts Change: Essays 1995–2010 pp. 287–288.       According to historian ": null
    },
    {
        "Henry Adams": "Henry Adams"
    },
    {
        " the system of railroads needed:   :the energies of a generation, for it required all the new machinery to be created – capital, banks, mines, furnaces, shops, power-houses, technical knowledge, mechanical population, together with a steady remodelling of social and political habits, ideas, and institutions to fit the new scale and suit the new conditions. The generation between 1865 and 1895 was already mortgaged to the railways, and no one knew it better than the generation itself.    The impact can be examined through five aspects: shipping, finance, management, careers, and popular reaction.          Industry comes of age: Business, labor, and public policy, 1860–1897 pp. 52, 68–74.   Funding came from financiers throughout the Northeast, and from Europe, especially Britain.  About 10 percent of the funding came from the government, especially in the form of land grants that could be realized when a certain amount of trackage was opened. Kirkland, Industry comes of age pp. 57–68. The emerging American financial system was based on railroad bonds. New York by 1860 was the dominant financial market. The British invested heavily in railroads around the world, but nowhere more so than the United States; The total came to about $3 billion by 1914. In 1914–1917, they liquidated their American assets to pay for war supplies.  Saul Engelbourg, The man who found the money: John Stewart Kennedy and the financing of the western railroads .     The Railroad and the Space Program pp. 127–162     ": null
    },
    {
        "human capital": "Human Capital"
    },
    {
        ". They were very hard to replace, and were virtually guaranteed permanent jobs and provided with insurance and medical care. Hiring, firing, and wage rates were set not by foremen, but by central administrators, in order to minimize favoritism and personality conflicts. Everything was done by the book, whereby an increasingly complex set of rules dictated to everyone exactly what should be done in every circumstance, and exactly what their rank and pay would be. By the 1880s the career railroaders were retiring, and pension systems were invented for them.        Railways contribute to social vibrancy and economic competitiveness by transporting multitudes of customers and workers to ": null
    },
    {
        "city centres": "City Centre"
    },
    {
        "and ": null
    },
    {
        "inner suburbs": "Inner Suburbs"
    },
    {
        ". ": null
    },
    {
        "Hong Kong": "Hong Kong"
    },
    {
        " has recognized rail as the backbone of the ": null
    },
    {
        "public transit system": "Public Transit System"
    },
    {
        " and as such developed their franchised bus system and road infrastructure in comprehensive alignment with their rail services. Hong Kong Information Services Department of the Hong Kong SAR Government. Hong Kong 2009 Chinas large cities such as ": null
    },
    {
        "Beijing": "Beijing"
    },
    {
        ", ": null
    },
    {
        "Shanghai": "Shanghai"
    },
    {
        ", and ": null
    },
    {
        "Guangzhou": "Guangzhou"
    },
    {
        " recognize rail transit lines as the framework and bus lines as the main body to their metropolitan transportation systems. Hau H., Yun-feng G., Zhi-gang, L., Xiao-guang, Y. . Effect of Integrated Multi-Modal Transit Information on Modal Shift. Intelligent Transportation Systems , 2010 13th International IEEE Conference. 1753-1757pg. The Japanese ": null
    },
    {
        "Shinkansen": "Shinkansen"
    },
    {
        " was built to meet the growing traffic demand in the heart of Japans industry and economy situated on the ": null
    },
    {
        "Tokyo": "Tokyo"
    },
    {
        "-": null
    },
    {
        "Kobe": "Kobe"
    },
    {
        " line. Nishida, M., The Shinkansen High-Speed Rail Network of Japan. Proceedings of an IIASA Conference, 27–30 June 1977.          In the 1863-70 decade the heavy use of railways in the American Civil War, Christopher R. Gabel, Railroad Generalship: Foundations of Civil War Strategy . and in Germanys wars against Austria and France, Dennis E. Showalter, Railroads and Rifles: soldiers, technology, and the unification of Germany . provided a speed of movement unheard-of in the days of horses. During much of the 20th century, rail was a key element of war plans for rapid military ": null
    },
    {
        "mobilization": "Mobilization"
    },
    {
        ", allowing for the quick and efficient transport of large numbers of reservists to their mustering-points, and infantry soldiers to the front lines. David Stevenson, War by Timetable? The Railway Race Before 1914. Past and Present 162, no. 1 : 163–94. doi:10.1093/past/162.1.163. The Western Front in France during World War I required many trainloads of munitions a day. Denis Bishop and W. J. K. Davies, Railways and War Before 1918 ; Bishop and Davies, Railways and War Since 1917 . Rail yards and bridges in Germany and occupied France were major targets of Allied air power in World War II. Henry D. Lytton, Bombing Policy in the Rome and Pre-Normandy Invasion Aerial Campaigns of World War II: Bridge-Bombing Strategy Vindicated-and Railyard-Bombing Strategy Invalidated. Military Affairs 47.2 : 53+.  However, by the 21st century, rail transport – limited to locations on the same continent, and vulnerable to air attack – had largely been displaced by the adoption of ": null
    },
    {
        "aerial transport": "Airlift"
    },
    {
        ".       Railways channel growth towards dense city ": null
    },
    {
        "agglomerations": "Agglomerations"
    },
    {
        " and along their arteries, as opposed to ": null
    },
    {
        "highway": "Highway"
    },
    {
        " expansion, indicative of the U.S. transportation policy, which encourages development of ": null
    },
    {
        "suburbs": "Suburbs"
    },
    {
        " at the periphery, contributing to increased ": null
    },
    {
        "vehicle miles travelled": "Vehicle Miles Traveled"
    },
    {
        ", ": null
    },
    {
        "carbon emissions": "Carbon Emissions"
    },
    {
        ", development of ": null
    },
    {
        "greenfield": "Greenfield Land"
    },
    {
        " spaces, and depletion of ": null
    },
    {
        "natural reserve": "Natural Reserve"
    },
    {
        "s. These arrangements revalue city spaces, local ": null
    },
    {
        "taxes": "Taxes"
    },
    {
        ",  ": null
    },
    {
        "housing": "House"
    },
    {
        " values, and promotion of ": null
    },
    {
        "mixed use development": "Mixed Use Development"
    },
    {
        ". Squires, G. Ed. Urban Sprawl: Causes, Consequences, & Policy Responses. The Urban Institute Press. Puentes, R. . A Bridge to Somewhere: Rethinking American Transportation for the 21st Century. Brookings Institution Metropolitan Policy Report: Blueprint for American Prosperity series report.     The construction of the first railway of the Austro-Hungarian empire, from Vienna to Prague, came in 1837-1842 to promises of new prosperity. Construction proved more costly than anticipated, and it brought in less revenue because local industry did not have a national market. In town after town the arrival of railway angered the locals because of the noise, smell, and pollution caused by the trains and the damage to homes and the surrounding land caused by the engines soot and fiery embers. Almost all travel was local; ordinary people seldom had need of passenger trains. Chad Bryant, Into an Uncertain Future: Railroads and Vormärz Liberalism in Brno, Vienna, and Prague. Austrian History Yearbook 40 : 183-201. ": null
    }
]