[
    {
        "                    Sir Ralph Abercromby    was a Scottish soldier and politician. He twice served as MP for ": null
    },
    {
        "Clackmannanshire": "Clackmannanshire"
    },
    {
        ", rose to the rank of ": null
    },
    {
        "lieutenant-general": "Lieutenant-General"
    },
    {
        " in the ": null
    },
    {
        "British Army": "British Army"
    },
    {
        ", was appointed ": null
    },
    {
        "Governor of Trinidad": "Governor Of Trinidad"
    },
    {
        ", served as ": null
    },
    {
        "Commander-in-Chief, Ireland": "Commander-In-Chief, Ireland"
    },
    {
        ", and was noted for his services during the ": null
    },
    {
        "French Revolutionary Wars": "French Revolutionary Wars"
    },
    {
        ".       Abercromby was the eldest son of Mary Dundas , daughter of Ralph Dundas of Manour, ": null
    },
    {
        "Perthshire": "Perthshire"
    },
    {
        " and George Abercromby of ": null
    },
    {
        "Tullibody": "Tullibody"
    },
    {
        " House, ": null
    },
    {
        "Clackmannanshire": "Clackmannanshire"
    },
    {
        ". He was brother of the advocate ": null
    },
    {
        "Alexander Abercromby, Lord Abercromby": "Alexander Abercromby, Lord Abercromby"
    },
    {
        " and ": null
    },
    {
        "General Robert Abercromby": "Robert Abercromby Of Airthrey"
    },
    {
        ". He was born at ": null
    },
    {
        "Menstrie Castle": "Menstrie Castle"
    },
    {
        " in ": null
    },
    {
        "Clackmannanshire": "Clackmannanshire"
    },
    {
        ". ": null
    },
    {
        "Chambers Biographical Dictionary": "Chambers Biographical Dictionary"
    },
    {
        ", , page 4     Abercrombys education was begun by a private tutor, then continued at the school of Mr Moir in ": null
    },
    {
        "Alloa": "Alloa"
    },
    {
        ", then considered one of the best in Scotland despite its Jacobite leanings. After passing some time there, Ralph was sent to ": null
    },
    {
        "Rugby School": "Rugby School"
    },
    {
        ", where he remained until he was 18. He then became a student at the ": null
    },
    {
        "University of Edinburgh": "University Of Edinburgh"
    },
    {
        ". There he studied moral and natural philosophy and civil law, and was regarded by his professors as sound rather than brilliant.  He completed his studies at ": null
    },
    {
        "Leipzig University": "Leipzig University"
    },
    {
        " in Germany, from 1754, taking more detailed studies in ": null
    },
    {
        "civil law": "Civil Law"
    },
    {
        " with a view to a career as an ": null
    },
    {
        "advocate": "Advocate"
    },
    {
        ".        Abercromby was a ": null
    },
    {
        "Freemason": "Freemasonry"
    },
    {
        ". He was Initiated into Scottish Freemasonry in Lodge ": null
    },
    {
        "Canongate": "Canongate"
    },
    {
        " Kilwinning, No. 2, on 25 May 1753. History of Lodge Canongate Kilwinning, No. 2. Compiled from the Records, 1677-1888. P.237. By Allan MacKenzie. Edinburgh. Published 1888.       On returning from the continent, Abercromby expressed a strong preference for the military profession, and a ": null
    },
    {
        "cornets": "Cornet"
    },
    {
        " commission was accordingly obtained for him in the ": null
    },
    {
        "3rd Dragoon Guards": "3Rd Dragoon Guards"
    },
    {
        ". He served with his regiment in the ": null
    },
    {
        "Seven Years War": "Seven Years War"
    },
    {
        ", and thus, the opportunity afforded him of studying the methods of ": null
    },
    {
        "Frederick the Great": "Frederick Ii Of Prussia"
    },
    {
        ", which moulded his military character and formed his tactical ideas.      Abercromby rose through the intermediate grades to the rank of lieutenant-colonel of the regiment and ": null
    },
    {
        "brevet": "Brevet"
    },
    {
        " colonel in 1780, and in 1781, he became colonel of the newly raised ": null
    },
    {
        "Kings Irish infantry": "103Rd Regiment Of Foot"
    },
    {
        ". When that regiment was disbanded in 1783, he retired on ": null
    },
    {
        "half pay": "Half Pay"
    },
    {
        ". He also entered Parliament as MP for ": null
    },
    {
        "Clackmannanshire": "Clackmannanshire"
    },
    {
        " .      Abercromby was a strong supporter of the American cause in the ": null
    },
    {
        "American Revolutionary War": "American Revolutionary War"
    },
    {
        ", and remained in Ireland to avoid having to fight against the colonists. David Andress, The Savage Storm: Britain on me Brink in the Age of Napoleon p 61     When France declared war against Great Britain in 1793, Abercromby resumed his duties. He was appointed command of a brigade under the ": null
    },
    {
        "Duke of York": "Prince Frederick, 1St Duke Of York And Albany"
    },
    {
        " for service in the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        ", where he commanded the advanced guard in the action at ": null
    },
    {
        "Le Cateau": "Le Cateau-Cambrésis"
    },
    {
        ". During the 1794 withdrawal to Holland, he commanded the allied forces in the action at ": null
    },
    {
        "Boxtel": "Battle Of Boxtel"
    },
    {
        " and was wounded directing operations at Fort St Andries on the ": null
    },
    {
        "Waal": "Waal"
    },
    {
        ". In 1795, he was appointed a ": null
    },
    {
        "Knight of the Bath": "Order Of The Bath"
    },
    {
        " for his services.     That same year, he was appointed to succeed ": null
    },
    {
        "Sir Charles Grey": "Charles Grey, 1St Earl Grey"
    },
    {
        " as commander-in-chief of the British forces in the ": null
    },
    {
        "West Indies": "West Indies"
    },
    {
        ". In 1796, ": null
    },
    {
        "Grenada": "Grenada"
    },
    {
        " was suddenly attacked and taken by a detachment of the army under his orders. Afterwards, Abercromby secured possession of the settlements of ": null
    },
    {
        "Demerara": "Demerara"
    },
    {
        " and ": null
    },
    {
        "Essequibo": "Essequibo"
    },
    {
        " in South America, the islands of ": null
    },
    {
        "Saint Lucia": "Saint Lucia"
    },
    {
        ", ": null
    },
    {
        "Saint Vincent": "Saint Vincent"
    },
    {
        " and ": null
    },
    {
        "Trinidad": "Trinidad"
    },
    {
        ". A ": null
    },
    {
        "major assault": "Battle Of San Juan"
    },
    {
        " on the port of ": null
    },
    {
        "San Juan": "Battle Of San Juan"
    },
    {
        ", ": null
    },
    {
        "Puerto Rico": "Puerto Rico"
    },
    {
        ", in April 1797 failed  after fierce fighting where both sides suffered heavy losses.             Abercromby returned to Europe and, in reward for his services, was appointed colonel of the ": null
    },
    {
        "2nd Regiment of Dragoons": "Royal Scots Greys"
    },
    {
        ". He was also made ": null
    },
    {
        "Lieutenant-Governor of the Isle of Wight": "Lieutenant-Governor Of The Isle Of Wight"
    },
    {
        ", ": null
    },
    {
        "Governor of Fort George and Fort Augustus": "Governor Of Fort George And Fort Augustus"
    },
    {
        " in the Scottish Highlands, and promoted to the rank of Lieutenant-general. He again entered Parliament as member for Clackmannanshire from 1796 to 1798. From 1797 to 1798, he was Commander-in-Chief of the forces in ": null
    },
    {
        "Ireland": "Ireland"
    },
    {
        ".     To quote the biographic entry in the 1888 Encyclopædia Britannica,      After holding for a short period the office of ": null
    },
    {
        "commander-in-chief in Scotland": "Commander-In-Chief In Scotland"
    },
    {
        ", Abercromby, when the enterprise against the Dutch ": null
    },
    {
        "Batavian Republic": "Batavian Republic"
    },
    {
        " was resolved upon in 1799, was again called to command under the Duke of York. The ": null
    },
    {
        "Anglo-Russian invasion of Holland": "Anglo-Russian Invasion Of Holland"
    },
    {
        " in 1799 ended in disaster, but friend and foe alike confessed that the most decisive victory could not have more conspicuously proved the talents of this distinguished officer.     In 1801, Abercromby was sent with an army to recover ": null
    },
    {
        "Egypt from France": "Battle Of Alexandria"
    },
    {
        ". His experience in the Netherlands and the West Indies particularly fitted him for this new command, as was proved when he carried his army in health, in spirits, and with the requisite supplies to the destined scene of action despite great difficulties. The debarkation of the troops at ": null
    },
    {
        "Abukir": "Abukir"
    },
    {
        ", in the face of strenuous opposition, is justly ranked among the most daring and brilliant exploits of the British army.               In 1800 Abercromby commanded the expedition to the Mediterranean, and after some brilliant operations defeated the French in the ": null
    },
    {
        "Battle of Alexandria": "Battle Of Alexandria"
    },
    {
        ", 21 March 1801. During the action he was struck by a musket-ball in the thigh; but not until the battle was won and he saw the enemy retreating did he show any sign of pain. He was borne from the field in a hammock, cheered by the blessings of the soldiers as he passed, and conveyed on board the flag-ship ": null
    },
    {
        "HMS Foudroyant": "Hms Foudroyant"
    },
    {
        " which was moored in the harbour. The ball could not be extracted; mortification ensued, and seven days later, on 28 March 1801, he died.      Abercrombys old friend and commander, the Duke of York, paid tribute to Abercrombys memory in general orders: His steady observance of discipline, his ever-watchful attention to the health and wants of his troops, the persevering and unconquerable spirit which marked his military career, the splendour of his actions in the field and the heroism of his death, are worthy the imitation of all who desire, like him, a life of heroism and a death of glory. He was buried on St Johns Bastion within ": null
    },
    {
        "Fort Saint Elmo": "Fort Saint Elmo"
    },
    {
        " in ": null
    },
    {
        "Valletta": "Valletta"
    },
    {
        ", ": null
    },
    {
        "Malta": "Malta"
    },
    {
        ". The British military renamed it Abercrombies Bastion in his honour.  The adjacent curtain wall linking this bastion to the ": null
    },
    {
        "fortifications of Valletta": "Fortifications Of Valletta"
    },
    {
        ", originally called Santa Ubaldesca Curtain, was also renamed Abercrombies Curtain.          By a vote of the House of Commons, a monument was erected in Abercrombys honour in ": null
    },
    {
        "St Pauls Cathedral": "St Pauls Cathedral"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        ". His widow was created Baroness Abercromby of Tullibody and Aboukir Bay, and a pension of £2,000 a year was settled on her and her two successors in the title.     Abercromby Place in ": null
    },
    {
        "Edinburghs New Town": "New Town, Edinburgh"
    },
    {
        " is named in his honour.       On 17 November 1767, Abercromby married ": null
    },
    {
        "Mary Anne": "Mary Anne Menzies"
    },
    {
        ", daughter of ": null
    },
    {
        "John Menzies": "John Menzies"
    },
    {
        " and Ann, daughter of Patrick Campbell.  cites   cites  They had seven children. Of four sons, all four entered Parliament, and two saw military service.   Hon. Anne Abercromby   Hon. Mary Abercromby   Hon. Catherine Abercromby , married Thomas Buchanan of Powis Superintendent of Marines at Bombay. Logie: A Parish History by Menzies Fergusson   ": null
    },
    {
        "George Abercromby, 2nd Baron Abercromby": "George Abercromby, 2Nd Baron Abercromby"
    },
    {
        "    General Hon. ": null
    },
    {
        "Sir John Abercromby": "Sir John Abercromby"
    },
    {
        "   James Abercromby, 1st Baron Dunfermline": "James Abercromby, 1St Baron Dunfermline"
    },
    {
        "   Lt.-Col. Hon. ": null
    },
    {
        "Alexander Abercromby": "Alexander Abercromby"
    },
    {
        "            A ": null
    },
    {
        "public house": "Public House"
    },
    {
        " in central ": null
    },
    {
        "Manchester": "Manchester"
    },
    {
        ", the ": null
    },
    {
        "Sir Ralph Abercromby": "Sir Ralph Abercromby"
    },
    {
        ", is named after him. There is also a General Abercrombie pub with his portrait by ": null
    },
    {
        "John Hoppner": "John Hoppner"
    },
    {
        " as the sign off of the Blackfriars Bridge Road in London.      Three ships have been named ": null
    },
    {
        "HMS Abercrombie": "Hms Abercrombie"
    },
    {
        " after the general but using the variant spelling of his name.      Abercrombie Street in Port of Spain, Trinidad honours his name.     Abercromby Primary School in ": null
    },
    {
        "Tullibody": "Tullibody"
    },
    {
        " is named after him.     Abercromby Place in Edinburghs New Town is named after him.              ": null
    }
]