[
    {
        "         Ray Douglas Bradbury  was an American ": null
    },
    {
        "author": "Author"
    },
    {
        " and ": null
    },
    {
        "screenwriter": "Screenwriter"
    },
    {
        ". He worked in a variety of genres, including ": null
    },
    {
        "fantasy": "Fantasy"
    },
    {
        ", ": null
    },
    {
        "science fiction": "Science Fiction"
    },
    {
        ", ": null
    },
    {
        "horror": "Horror Fiction"
    },
    {
        ", and ": null
    },
    {
        "mystery fiction": "Mystery Fiction"
    },
    {
        ".     Predominantly known for writing the iconic ": null
    },
    {
        "dystopia": "Dystopia"
    },
    {
        "n novel  Fahrenheit 451  , and his science-fiction and horror-story collections,  The Martian Chronicles  ,  The Illustrated Man  , and  I Sing the Body Electric  , Bradbury was one of the most celebrated 20th- and 21st-century American writers. While most of his best known work is in ": null
    },
    {
        "fantasy fiction": "Fantasy Fiction"
    },
    {
        ", he also wrote in other genres, such as the coming-of-age novel  Dandelion Wine  and the fictionalized memoir  Green Shadows, White Whale  .     Recipient of numerous awards, including a 2007 ": null
    },
    {
        "Pulitzer Citation": "Pulitzer Prize Special Citations And Awards"
    },
    {
        ", Bradbury also wrote and consulted on screenplays and television scripts, including  Moby Dick  and  It Came from Outer Space . Many of his works were adapted to comic book, television, and film formats.     Upon his death in 2012,  The New York Times  called Bradbury the writer most responsible for bringing modern science fiction into the literary mainstream .           Bradbury was born on August 22, 1920,  in ": null
    },
    {
        "Waukegan, Illinois": "Waukegan, Illinois"
    },
    {
        ", p.141 Bloom, Harold Ray Bradbury 2010 Infobase Publishing to Esther  Bradbury , a ": null
    },
    {
        "Swedish immigrant": "Swedish American"
    },
    {
        ", and Leonard Spaulding Bradbury , Touponce, William F. Ray Bradbury. American Writers: A Collection of Literary Biographies, Supplement 4. Ed. A Walton Litz and Molly Weigel. New York: Charles Scribners Sons, 1996. Literature Resources from Gale. November 16, 2010. a power and telephone ": null
    },
    {
        "lineman": "Lineman"
    },
    {
        " of English ancestry. Certificate of Birth, Ray Douglas Bradbury, August 22, 1920, Lake County Clerks Record 4750. Although he was named after Rae Williams, a cousin on his fathers side, Ray Bradburys birth certificate spells his first name as Ray . He was given the middle name Douglas after the actor ": null
    },
    {
        "Douglas Fairbanks": "Douglas Fairbanks"
    },
    {
        ". Bradbury was related to the U.S. ": null
    },
    {
        "Shakespeare": "William Shakespeare"
    },
    {
        " scholar Douglas Spaulding The Spaulding Family Memorial, 1899 and descended from ": null
    },
    {
        "Mary Bradbury": "Mary Bradbury"
    },
    {
        ", who was tried at one of the ": null
    },
    {
        "Salem witch trials": "Salem Witch Trials"
    },
    {
        " in 1692.      Bradbury was surrounded by an extended family during his early childhood and formative years in ": null
    },
    {
        "Waukegan": "Waukegan"
    },
    {
        ". An aunt read him short stories when he was a child. Paradowski, Robert J. Ray Bradbury . Critical Survey of Short Fiction, Second Revised Edition 2001:1–5. EBSCO. November 8, 2010. This period provided foundations for both the author and his stories. In Bradburys works of fiction, 1920s Waukegan becomes Green Town , ": null
    },
    {
        "Illinois": "Illinois"
    },
    {
        ".     The Bradbury family lived in ": null
    },
    {
        "Tucson, Arizona": "Tucson, Arizona"
    },
    {
        ", during 1926–1927 and 1932–1933 while their father pursued employment, each time returning to ": null
    },
    {
        "Waukegan": "Waukegan"
    },
    {
        ". They eventually settled in ": null
    },
    {
        "Los Angeles": "Los Angeles"
    },
    {
        " in 1934 when Bradbury was 14 years old. The family arrived with only US$40 , which paid for rent and food until his father finally found a job making wire at a cable company for $14 a week . This meant that they could stay, and Bradbury, who was in love with Hollywood, was ecstatic.      Bradbury attended ": null
    },
    {
        "Los Angeles High School": "Los Angeles High School"
    },
    {
        " and was active in the drama club. He often roller-skated through Hollywood in hopes of meeting celebrities. Among the creative and talented people Bradbury met were special-effects pioneer ": null
    },
    {
        "Ray Harryhausen": "Ray Harryhausen"
    },
    {
        " and radio star ": null
    },
    {
        "George Burns": "George Burns"
    },
    {
        ". Bradburys first pay as a writer, at age 14, was for a joke he sold to George Burns to use on the  Burns and Allen  radio show.  by Susan King; Los Angeles Times, August 18, 2010            Throughout his youth, Bradbury was an avid reader and writer Litz, A. Walton. American Writers Supplement IV. New York: Charles Scribners Sons, 1996. Print. and knew at a young age that he was going into one of the arts.  Bradbury began writing his own stories at age 11 , during the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        " — sometimes writing on the only available paper, butcher paper.     In his youth, he spent much time in the ": null
    },
    {
        "Carnegie library": "List Of Carnegie Libraries In Illinois"
    },
    {
        " in ": null
    },
    {
        "Waukegan": "Waukegan"
    },
    {
        ", reading such authors as ": null
    },
    {
        "H. G. Wells": "H. G. Wells"
    },
    {
        ", ": null
    },
    {
        "Jules Verne": "Jules Verne"
    },
    {
        ", and ": null
    },
    {
        "Edgar Allan Poe": "Edgar Allan Poe"
    },
    {
        ". At 12, Bradbury began writing traditional horror stories and said he tried to imitate Poe until he was about 18.  In addition to comics, he loved ": null
    },
    {
        "Edgar Rice Burroughs": "Edgar Rice Burroughs"
    },
    {
        ", creator of  Tarzan of the Apes , Contemporary Authors Online. Ray Bradbury. Detroit: Gale, 2009. Web. especially Burroughs ": null
    },
    {
        "John Carter of Mars": "John Carter Of Mars"
    },
    {
        " series.  The Warlord of Mars  impressed him so much that at the age of 12, he wrote his own sequel. Heller, Terry. Magills Survey of American Literature. Revised Edition. Pasadena: Salem Press, 2006. Print. The young Bradbury was also a cartoonist and loved to illustrate. He wrote about ": null
    },
    {
        "Tarzan": "Tarzan"
    },
    {
        " and drew his own Sunday panels. He listened to the radio show  Chandu the Magician , and every night when the show went off the air, he would sit and write the entire script from memory.      As a teen in ": null
    },
    {
        "Beverly Hills": "Beverly Hills"
    },
    {
        ", he often visited his mentor and friend science-fiction writer ": null
    },
    {
        "Bob Olsen": "Bob Olsen"
    },
    {
        ", sharing ideas and maintaining contact. In 1936, at a secondhand bookstore in ": null
    },
    {
        "Hollywood": "Hollywood"
    },
    {
        ", Bradbury discovered a handbill promoting meetings of the ": null
    },
    {
        "Los Angeles Science Fiction Society": "Los Angeles Science Fiction Society"
    },
    {
        ". The article linked appears in the source, but this name conflicts with the groups web site. Excited to find there were others sharing his interest, Bradbury joined a weekly Thursday-night conclave at age 16.      Bradbury cited ": null
    },
    {
        "H. G. Wells": "H. G. Wells"
    },
    {
        " and ": null
    },
    {
        "Jules Verne": "Jules Verne"
    },
    {
        " as his primary science-fiction influences. Bradbury identified with Verne, saying, He believes the human being is in a strange situation in a very strange world, and he believes that we can triumph by behaving morally .    The Paris Review; Spring, 2009 Bradbury admitted that he stopped reading science-fiction books in his 20s and embraced a broad field of literature that included ": null
    },
    {
        "Alexander Pope": "Alexander Pope"
    },
    {
        " and poet ": null
    },
    {
        "John Donne": "John Donne"
    },
    {
        ". Bradbury had just graduated from high school when he met Robert Heinlein, then 31 years old. Bradbury recalled, He was well known, and he wrote humanistic science fiction, which influenced me to dare to be human instead of mechanical.     In young adulthood Bradbury read stories published in Astounding Science Fiction, and read everything by ": null
    },
    {
        "Robert A. Heinlein": "Robert A. Heinlein"
    },
    {
        ", ": null
    },
    {
        "Arthur C. Clarke": "Arthur C. Clarke"
    },
    {
        ", and the early writings of ": null
    },
    {
        "Theodore Sturgeon": "Theodore Sturgeon"
    },
    {
        " and ": null
    },
    {
        "A. E. van Vogt": "A. E. Van Vogt"
    },
    {
        ".       The family lived about four blocks from the ": null
    },
    {
        "Fox Uptown Theatre": "Fox Uptown Theatre"
    },
    {
        " on ": null
    },
    {
        "Western Avenue": "Western Avenue"
    },
    {
        " in ": null
    },
    {
        "Los Angeles": "Los Angeles"
    },
    {
        ", the flagship theater for ": null
    },
    {
        "MGM": "Mgm"
    },
    {
        " and ": null
    },
    {
        "Fox": "20Th Century Fox"
    },
    {
        ". There, Bradbury learned how to sneak in and watched previews almost every week. He rollerskated there, as well as all over town, as he put it, hell-bent on getting autographs from glamorous stars. It was glorious. Among stars the young Bradbury was thrilled to encounter were ": null
    },
    {
        "Norma Shearer": "Norma Shearer"
    },
    {
        ", ": null
    },
    {
        "Laurel and Hardy": "Laurel And Hardy"
    },
    {
        ", and ": null
    },
    {
        "Ronald Colman": "Ronald Colman"
    },
    {
        ". Sometimes, he spent all day in front of ": null
    },
    {
        "Paramount Pictures": "Paramount Pictures"
    },
    {
        " or ": null
    },
    {
        "Columbia Pictures": "Columbia Pictures"
    },
    {
        " and then skated to the ": null
    },
    {
        "Brown Derby": "Brown Derby"
    },
    {
        " to watch the stars who came and went for meals. He recounted seeing ": null
    },
    {
        "Cary Grant": "Cary Grant"
    },
    {
        ", ": null
    },
    {
        "Marlene Dietrich": "Marlene Dietrich"
    },
    {
        ", and ": null
    },
    {
        "Mae West": "Mae West"
    },
    {
        ", whom he learned made a regular appearance every Friday night, bodyguard in tow.      Bradbury relates the following meeting with ": null
    },
    {
        "Sergei Bondarchuk": "Sergei Bondarchuk"
    },
    {
        ", director of Soviet epic film series  War and Peace , at a ": null
    },
    {
        "Hollywood": "Hollywood"
    },
    {
        " award ceremony in Bondarchuks honor:               Bradburys first published story was ": null
    },
    {
        "Hollerbochens Dilemma": "Hollerbochens Dilemma"
    },
    {
        " , which appeared in the January 1938 number of ": null
    },
    {
        "Forrest J. Ackermans": "Forrest J Ackerman"
    },
    {
        " fanzine": "Fanzine"
    },
    {
        " Imagination!. In July 1939, Ackerman and his then-girlfriend ": null
    },
    {
        "Morojo": "Morojo"
    },
    {
        " gave 19-year-old Bradbury the money to head to New York for the ": null
    },
    {
        "First World Science Fiction Convention": "1St World Science Fiction Convention"
    },
    {
        " in ": null
    },
    {
        "New York City": "New York City"
    },
    {
        ", and funded Bradburys fanzine, titled  Futuria Fantasia .  Ray Bradbury Official website Bradbury wrote most of its four issues, each limited to under 100 copies. Between 1940 and 1947, he was a contributor to ": null
    },
    {
        "Rob Wagners": "Rob Wagner"
    },
    {
        "film magazine, Script.      Bradbury was free to start a career in writing, when owing to his bad eyesight, he was rejected admission into the military during ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ". Having been inspired by science-fiction heroes such as ": null
    },
    {
        "Flash Gordon": "Flash Gordon"
    },
    {
        " and ": null
    },
    {
        "Buck Rogers": "Buck Rogers"
    },
    {
        ", Bradbury began to publish science-fiction stories in fanzines in 1938. Bradbury was invited by Forrest J. Ackerman  to attend the ": null
    },
    {
        "Los Angeles Science Fiction Society": "Los Angeles Science Fiction Society"
    },
    {
        ", which at the time met at ": null
    },
    {
        "Cliftons Cafeteria": "Cliftons Cafeteria"
    },
    {
        " in downtown Los Angeles. This was where he met the writers ": null
    },
    {
        "Robert A. Heinlein": "Robert A. Heinlein"
    },
    {
        ", ": null
    },
    {
        "Emil Petaja": "Emil Petaja"
    },
    {
        ", ": null
    },
    {
        "Fredric Brown": "Fredric Brown"
    },
    {
        ", ": null
    },
    {
        "Henry Kuttner": "Henry Kuttner"
    },
    {
        ", ": null
    },
    {
        "Leigh Brackett": "Leigh Brackett"
    },
    {
        ", and ": null
    },
    {
        "Jack Williamson": "Jack Williamson"
    },
    {
        ".     In 1939, Bradbury joined ": null
    },
    {
        "Laraine Days": "Laraine Day"
    },
    {
        "Wilshire Players Guild, where for two years, he wrote and acted in several plays. They were, as Bradbury later described, so incredibly bad that he gave up playwriting for two decades.  Bradburys first paid piece, Pendulum , written with Henry Hasse, was published in the pulp magazine Super Science Stories in November 1941, for which he earned $15.      Bradbury sold his first story, The Lake , for $13.75 at 22, and became a full-time writer by 24. His first collection of short stories,  Dark Carnival , was published in 1947 by ": null
    },
    {
        "Arkham House": "Arkham House"
    },
    {
        ", a small press in ": null
    },
    {
        "Sauk City, Wisconsin": "Sauk City, Wisconsin"
    },
    {
        ", owned by writer ": null
    },
    {
        "August Derleth": "August Derleth"
    },
    {
        ". Reviewing Dark Carnival for the  New York Herald Tribune , ": null
    },
    {
        "Will Cuppy": "Will Cuppy"
    },
    {
        " proclaimed Bradbury suitable for general consumption and predicted that he would become a writer of the caliber of British fantasy author ": null
    },
    {
        "John Collier": "John Collier"
    },
    {
        ". Cuppy, Will, Review of Dark Carnival, New York Herald Tribune Books, May 25, 1947.     After a rejection notice from the pulp  Weird Tales , Bradbury submitted Homecoming to  Mademoiselle , which was spotted by a young editorial assistant named ": null
    },
    {
        "Truman Capote": "Truman Capote"
    },
    {
        ". Capote picked the Bradbury manuscript from a slush pile, which led to its publication. Homecoming won a place in the ": null
    },
    {
        "O. Henry Award": "O. Henry Award"
    },
    {
        " Stories of 1947. , by Dean Robinson – 6th floor; The New York Times, June 6, 2012     In ": null
    },
    {
        "UCLAs": "Ucla"
    },
    {
        " Powell Library": "Powell Library"
    },
    {
        ", in a study room with typewriters for rent, Bradbury wrote his classic story of a ": null
    },
    {
        "book burning": "Book Burning"
    },
    {
        " future, The Fireman, which was about 25,000 words long. It was later published at about 50,000 words under the name Fahrenheit 451, for a total cost of $9.80, due to the librarys typewriter-rental fees of ten cents per half-hour.      A chance encounter in a Los Angeles bookstore with the British expatriate writer ": null
    },
    {
        "Christopher Isherwood": "Christopher Isherwood"
    },
    {
        " gave Bradbury the opportunity to put  The Martian Chronicles  into the hands of a respected critic. Isherwoods glowing review  followed.       Bradbury attributed his lifelong habit of writing every day to two incidents. The first of these, occurring when he was three years old, was his mothers taking him to see ": null
    },
    {
        "Lon Chaneys": "Lon Chaney, Sr."
    },
    {
        "performance in  The Hunchback of Notre Dame . Paradowski, Robert J. Ray Bradbury. Critical Survey of Short Fiction, Second Revised Edition : UFO. November 10, 2010. The second incident occurred in 1932, when a carnival entertainer, one Mr. Electrico, touched the young man on the nose with an electrified sword, made his hair stand on end, and shouted, Live forever!  Bradbury remarked, I felt that something strange and wonderful had happened to me because of my encounter with Mr. Electrico... gave me a future...I began to write, full-time. I have written every single day of my life since that day 69 years ago. At that age, Bradbury first started to do ": null
    },
    {
        "magic": "Magic"
    },
    {
        ", which was his first great love. If he had not discovered writing, he would have become a magician. Terry Sanders film Ray Bradbury: Story of a Writer     Bradbury claimed a wide variety of influences, and described discussions he might have with his favorite poets and writers ": null
    },
    {
        "Robert Frost": "Robert Frost"
    },
    {
        ", ": null
    },
    {
        "William Shakespeare": "William Shakespeare"
    },
    {
        ", ": null
    },
    {
        "John Steinbeck": "John Steinbeck"
    },
    {
        ", ": null
    },
    {
        "Aldous Huxley": "Aldous Huxley"
    },
    {
        ", and ": null
    },
    {
        "Thomas Wolfe": "Thomas Wolfe"
    },
    {
        ". From Steinbeck, he said he learned how to write objectively and yet insert all of the insights without too much extra comment . He studied ": null
    },
    {
        "Eudora Welty": "Eudora Welty"
    },
    {
        " for her remarkable ability to give you atmosphere, character, and motion in a single line . Bradburys favorite writers growing up included ": null
    },
    {
        "Katherine Anne Porter": "Katherine Anne Porter"
    },
    {
        ", who wrote about the American South, ": null
    },
    {
        "Edith Wharton": "Edith Wharton"
    },
    {
        ", and ": null
    },
    {
        "Jessamyn West": "Jessamyn West"
    },
    {
        ". , Interviewed by Sam Weller; The Paris Review, Spring 2010     Bradbury was once described as a ": null
    },
    {
        "Midwest": "Midwest"
    },
    {
        " surrealist": "Surrealism"
    },
    {
        " and is often labeled a science-fiction writer, which he described as the art of the possible. Bradbury resisted that categorization, however:          Bradbury recounted when he came into his own as a writer, the afternoon he wrote a short story about his first encounter with death. When he was a boy, he met a young girl at the beach and she went out into the water and never came back. Years later, as he wrote about it, tears flowed from him. He recognized he had taken the leap from emulating the many writers he admired to connecting with his voice as a writer.  Point Loma Nazarene University, Writers Symposium By The Sea; The only science fiction I have written is Fahrenheit 451. Its the art of the possible. Science fiction is the art of the possible. It could happen. It has happened. Discussion of genres, finding ones voice. April 2001; Cosmos Learning, English Literature   I am not a science fiction writer. I am a fantasy writer. But the label got put on me and stuck. March 23, 2005     When later asked about the lyrical power of his prose, Bradbury replied, From reading so much poetry every day of my life. My favorite writers have been those whove said things well. He is quoted, If youre reluctant to weep, you wont live a full and complete life. , by Mick Mortlock; Oregon Live, June 6, 2012     In high school, Bradbury was active in both the poetry club and the drama club, continuing plans to become an actor, but becoming serious about his writing as his high school years progressed. Bradbury graduated from Los Angeles High School, where he took poetry classes with Snow Longley Housh, and short-story writing courses taught by Jeannet Johnson.  Ray Bradbury Online The teachers recognized his talent and furthered his interest in writing, Litz, A. Walton, and Molly Weigel, eds. American Writers . New York: Macmillan Library Reference. 1996. Print. but he did not attend college. Instead, he sold newspapers at the corner of South Norton Avenue and Olympic Boulevard. In regard to his education, Bradbury said:        He told  The Paris Review , You cant learn to write in college. Its a very bad place for writers because the teachers always think they know more than you do – and they dont.  The Paris Review     Bradbury described his inspiration as, My stories run up and bite me in the leg—I respond by writing them down—everything that goes on during the bite. When I finish, the idea lets go and runs off . Garg, Anu, A Word a Day, 2017.08.22, wordsmith.org       A reinvention of Waukegan, Green Town is a symbol of safety and home, which is often juxtaposed as a contrasting backdrop to tales of fantasy or menace. It serves as the setting of his semiautobiographical classics Dandelion Wine,  Something Wicked This Way Comes , and Farewell Summer, as well as in many of his short stories. In Green Town, Bradburys favorite uncle sprouts wings, traveling carnivals conceal supernatural powers, and his grandparents provide room and board to ": null
    },
    {
        "Charles Dickens": "Charles Dickens"
    },
    {
        ".  Perhaps the most definitive usage of the pseudonym for his hometown, in Summer Morning, Summer Night, a collection of short stories and vignettes exclusively about Green Town, Bradbury returns to the signature locale as a look back at the rapidly disappearing small-town world of the American heartland, which was the foundation of his roots. Sites from these works which still exist in Waukegan include his boyhood home, his grandparents home next door and, less than a block away, the famous ravine which Bradbury used as a ": null
    },
    {
        "metaphor": "Metaphor"
    },
    {
        " throughout his career.       Bradbury wrote many short essays on the culture and the arts, attracting the attention of critics in this field, but he used his fiction to explore and criticize his culture and society. Bradbury observed, for example, that Fahrenheit 451 touches on the alienation of people by media:        Bradbury stated the novel worked as a critique of the later development of ": null
    },
    {
        "political correctness": "Political Correctness"
    },
    {
        ":        In a 1982 essay, he wrote, People ask me to predict the Future, when all I want to do is prevent it . This intent had been expressed earlier by other authors,  who sometimes attributed it to him.     On May 24, 1956, Bradbury appeared on television in Hollywood on the popular quiz show  You Bet Your Life  hosted by ": null
    },
    {
        "Groucho Marx": "Groucho Marx"
    },
    {
        ". During his introductory comments and on-air banter with Marx, Bradbury briefly discussed some of his books and other works, including giving an overview of ": null
    },
    {
        "The Veldt": "The Veldt"
    },
    {
        " , his short story published six years earlier in  The Saturday Evening Post  under the title The World the Children Made .      Bradbury was a consultant for the American Pavilion at the ": null
    },
    {
        "1964 New York Worlds Fair": "1964 New York Worlds Fair"
    },
    {
        "  and for the original exhibit housed in ": null
    },
    {
        "Epcots": "Epcot"
    },
    {
        " Spaceship Earth": "Spaceship Earth"
    },
    {
        " geosphere at ": null
    },
    {
        "Walt Disney World": "Walt Disney World Resort"
    },
    {
        ".   Ray Bradbury. He also serves as a consultant, having collaborated, for example, in the design of a pavilion in the Epcot Center at Walt Disney World. Referring to Spaceship Earth  ...  Bradbury concentrated on detective fiction in the 1980s. Litz, A. Walton., and Molly V. Weigel. American Writers: a Collection of Literary Biographies. New York: Scribner, 1996. Print In the latter half of the 1980s and early 1990s, he also hosted  The Ray Bradbury Theater , a televised ": null
    },
    {
        "anthology series": "Anthology Series"
    },
    {
        " based on his short stories.     Bradbury was a strong supporter of public library systems, raising money to prevent the closure of several libraries in California facing budgetary cuts. He said libraries raised me , and shunned colleges and universities, comparing his own lack of funds during the Depression with poor contemporary students.  His opinion varied on modern technology. In 1985 Bradbury wrote, I see nothing but good coming from computers. When they first appeared on the scene, people were saying, Oh my God, Im so afraid. I hate people like that – I call them the neo-": null
    },
    {
        "Luddites": "Luddites"
    },
    {
        " , and In a sense, are simply books. Books are all over the place, and computers will be, too .  He resisted the conversion of his work into ": null
    },
    {
        "e-book": "E-Book"
    },
    {
        "s, saying in 2010, We have too many cellphones. Weve got too many internets. We have got to get rid of those machines. We have too many machines now .  When the publishing rights for Fahrenheit 451 came up for renewal in December 2011, Bradbury permitted its publication in electronic form provided that the publisher, ": null
    },
    {
        "Simon & Schuster": "Simon  &  Schuster"
    },
    {
        ", allowed the e-book to be digitally downloaded by any library patron. The title remains the only book in the Simon & Schuster catalog where this is possible.      Several comic-book writers have adapted Bradburys stories. Particularly noted among these were ": null
    },
    {
        "EC Comics": "Ec Comics"
    },
    {
        " line of horror and science-fiction comics. Initially, the writers plagiarized his stories, but a diplomatic letter from Bradbury about it led to the company paying him and negotiating properly licensed adaptations of his work. The comics featuring Bradburys stories included  Tales from the Crypt , Weird Science, Weird Fantasy, Crime Suspenstories, and Haunt of Fear.     Bradbury remained an enthusiastic playwright all his life, leaving a rich theatrical legacy, as well as literary. Bradbury headed the Pandemonium Theatre Company in Los Angeles for many years and had a five-year relationship with the Fremont Centre Theatre in South Pasadena.  by David Ng; Los Angeles Times, June 6, 2012     Bradbury is featured prominently in two documentaries related to his classic 1950s-1960s era: ": null
    },
    {
        "Jason V Brocks": "Jason V Brock"
    },
    {
        " Charles Beaumont: The Life of Twilight Zones Magic Man, French, Lawrence , March 24, 2010. Retrieved October 31, 2012. which details his troubles with ": null
    },
    {
        "Rod Serling": "Rod Serling"
    },
    {
        ", and his friendships with writers ": null
    },
    {
        "Charles Beaumont": "Charles Beaumont"
    },
    {
        ", ": null
    },
    {
        "George Clayton Johnson": "George Clayton Johnson"
    },
    {
        ", and most especially his dear friend ": null
    },
    {
        "William F. Nolan": "William F. Nolan"
    },
    {
        ", as well as Brocks The AckerMonster Chronicles!, which delves into the life of former Bradbury agent, close friend, mega-fan, and  Famous Monsters of Filmland  editor ": null
    },
    {
        "Forrest J Ackerman": "Forrest J Ackerman"
    },
    {
        ".     Bradburys legacy was celebrated by the bookstore ": null
    },
    {
        "Fahrenheit 451 Books": "Fahrenheit 451 Books"
    },
    {
        " in Laguna Beach, California, in the 1970s and 1980s. The grand opening of an annex to the store was attended by Bradbury and his favorite illustrator, ": null
    },
    {
        "Joseph Mugnaini": "Joseph Mugnaini"
    },
    {
        ", in the mid-1980s. The shop closed its doors in 1987, but in 1990, another shop with the same name opened in Carlsbad, California. Ray Riegert, Hidden Coast of California: The Adventurers Guide , p. 133.     In the 1980s and 90s, Bradbury served on the advisory board of the ": null
    },
    {
        "Los Angeles Student Film Institute": "Los Angeles Student Film Institute"
    },
    {
        ".            Bradbury was married to Marguerite McClure from 1947 until her death; they had four daughters:  Susan, Ramona, ": null
    },
    {
        "Bettina": "Bettina F. Bradbury"
    },
    {
        ", and Alexandra. Bradbury never obtained a ": null
    },
    {
        "drivers license": "Drivers License"
    },
    {
        ", but relied on public transportation or his bicycle.  He lived at home until he was 27 and married. His wife of 56 years, Maggie, as she was affectionately called, was the only woman Bradbury ever dated.     He was raised ": null
    },
    {
        "Baptist": "Baptist"
    },
    {
        " by his parents, who were themselves infrequent churchgoers. As an adult, Bradbury considered himself a delicatessen religionist who resisted categorization of his beliefs and took guidance from both Eastern and Western faiths. He felt that his career was a God-given thing, and Im so grateful, so, so grateful. The best description of my career as a writer is At play in the fields of the Lord.      Bradbury was a close friend of ": null
    },
    {
        "Charles Addams": "Charles Addams"
    },
    {
        ", and Addams illustrated the first of Bradburys stories about the Elliotts, a family that resembled Addams own ": null
    },
    {
        "Addams Family": "Addams Family"
    },
    {
        " placed in rural ": null
    },
    {
        "Illinois": "Illinois"
    },
    {
        ". Bradburys first story about them was Homecoming , published in the 1946 Halloween issue of  Mademoiselle , with Addams illustrations. Addams and he planned a larger collaborative work that would tell the familys complete history, but it never materialized, and according to a 2001 interview, they went their separate ways.   in IndieBound, fall 2001. In October 2001, Bradbury published all the Family stories he had written in one book with a connecting narrative,  From the Dust Returned , featuring a wraparound Addams cover of the original Homecoming illustration. Bradbury, Ray, From The Dust Returned: A Novel. William Morrow, 2001.     Another close friend was animator ": null
    },
    {
        "Ray Harryhausen": "Ray Harryhausen"
    },
    {
        ", who was ": null
    },
    {
        "best man": "Best Man"
    },
    {
        " at Bradburys wedding.  During a ": null
    },
    {
        "BAFTA": "Bafta"
    },
    {
        " 2010 awards tribute in honor of ": null
    },
    {
        "Ray Harryhausens": "Ray Harryhausen"
    },
    {
        "90th birthday, Bradbury spoke of his first meeting Harryhausen at Forrest J Ackermans house when they were both 18 years old. Their shared love for science fiction,  King Kong , and the ": null
    },
    {
        "King Vidor": "King Vidor"
    },
    {
        "-directed film  The Fountainhead , written by ": null
    },
    {
        "Ayn Rand": "Ayn Rand"
    },
    {
        ", was the beginning of a lifelong friendship. These early influences inspired the pair to believe in themselves and affirm their career choices. After their first meeting, they kept in touch at least once a month, in a friendship that spanned over 70 years.      Late in life, Bradbury retained his dedication and passion despite what he described as the devastation of illnesses and deaths of many good friends. Among the losses that deeply grieved Bradbury was the death of  Star Trek  creator ": null
    },
    {
        "Gene Roddenberry": "Gene Roddenberry"
    },
    {
        ", who was an intimate friend for many years. They remained close friends for nearly three decades after Roddenberry asked him to write for Star Trek, which Bradbury never did, objecting that he never had the ability to adapt other peoples ideas into any sensible form.     Bradbury suffered a stroke in 1999  that left him partially dependent on a wheelchair for mobility.  Despite this, he continued to write, and had even written an essay for  The New Yorker , about his inspiration for writing, published only a week prior to his death.  Bradbury made regular appearances at science-fiction conventions until 2009, when he retired from the circuit.        Bradbury chose a burial place at ": null
    },
    {
        "Westwood Village Memorial Park Cemetery": "Westwood Village Memorial Park Cemetery"
    },
    {
        " in Los Angeles, with a headstone that reads Author of Fahrenheit 451 .   On February 6, 2015,  The New York Times  reported that the house that Bradbury lived and wrote in for 50 years of his life, at 10265 Cheviot Drive in ": null
    },
    {
        "Cheviot Hills, Los Angeles": "Cheviot Hills, Los Angeles"
    },
    {
        ", California, had been demolished by the buyer, architect ": null
    },
    {
        "Thom Mayne": "Thom Mayne"
    },
    {
        ".        Bradbury died in Los Angeles, California, on June 5, 2012, at the age of 91, after a lengthy illness.  Bradburys personal library was willed to the ": null
    },
    {
        "Waukegan Public Library": "Waukegan Public Library"
    },
    {
        ", where he had many of his formative reading experiences.      The New York Times called Bradbury the writer most responsible for bringing modern science fiction into the literary mainstream. The  Los Angeles Times  credited Bradbury with the ability to write lyrically and evocatively of lands an imagination away, worlds he anchored in the here and now with a sense of visual clarity and small-town familiarity .  Bradburys grandson, Danny Karapetian, said Bradburys works had influenced so many artists, writers, teachers, scientists, and its always really touching and comforting to hear their stories .   The Washington Post  noted several modern day technologies that Bradbury had envisioned much earlier in his writing, such as the idea of ": null
    },
    {
        "banking ATMs": "Automatic Teller Machine"
    },
    {
        " and ": null
    },
    {
        "earbuds and Bluetooth headsets": "Headphones"
    },
    {
        " from Fahrenheit 451, and the concepts of ": null
    },
    {
        "artificial intelligence": "Artificial Intelligence"
    },
    {
        " within  I Sing the Body Electric .      On June 6, 2012, in an official public statement from the ": null
    },
    {
        "White House Press Office": "White House Press Office"
    },
    {
        ", President ": null
    },
    {
        "Barack Obama": "Barack Obama"
    },
    {
        " said:          Numerous Bradbury fans paid tribute to the author, noting the influence of his works on their own careers and creations.   Filmmaker ": null
    },
    {
        "Steven Spielberg": "Steven Spielberg"
    },
    {
        " stated that Bradbury was muse for the better part of sci-fi career.... On the world of science fiction and fantasy and imagination he is immortal .  Writer ": null
    },
    {
        "Neil Gaiman": "Neil Gaiman"
    },
    {
        " felt that the landscape of the world we live in would have been diminished if we had not had him in our world . Author ": null
    },
    {
        "Stephen King": "Stephen King"
    },
    {
        " released a statement on his website saying, Ray Bradbury wrote three great novels and three hundred great stories. One of the latter was called ": null
    },
    {
        "A Sound of Thunder": "A Sound Of Thunder"
    },
    {
        ". The sound I hear today is the thunder of a giants footsteps fading away. But the novels and stories remain, in all their resonance and strange beauty. . Stephen King. Retrieved June 7, 2012.             Bradbury is credited with writing 27 novels and over 600 short stories. More than eight million copies of his works, published in over 36 languages, have been sold around the world.       In 1949, Bradbury and his wife were expecting their first child. He took a Greyhound bus to New York and checked into a room at the YMCA for 50 cents a night. He took his short stories to a dozen publishers and no one wanted them. Just before getting ready to go home, Bradbury had dinner with an editor at Doubleday. When Bradbury recounted that everyone wanted a novel and he did not have one, the editor, coincidentally named Walter Bradbury, asked if the short stories might be tied together into a book-length collection. The title was the editors idea; he suggested, You could call it The Martian Chronicles. Bradbury liked the idea and recalled making notes in 1944 to do a book set on Mars. That evening, he stayed up all night at the YMCA and typed out an outline. He took it to the Doubleday editor the next morning, who read it and wrote Bradbury a check for $750. When Bradbury returned to Los Angeles, he connected all the short stories that became The Martian Chronicles.       What was later issued as a collection of stories and vignettes, Summer Morning, Summer Night, started out to be Bradburys first true novel. The core of the work was Bradburys witnessing of the American small-town life in the American heartland.     In the winter of 1955–56, after a consultation with his Doubleday editor, Bradbury deferred publication of a novel based on Green Town, the pseudonym for his hometown. Instead, he extracted 17 stories and, with three other Green Town tales, bridged them into his 1957 book Dandelion Wine. Later, in 2006, Bradbury published the original novel remaining after the extraction, and retitled it Farewell Summer. These two titles show what stories and episodes Bradbury decided to retain as he created the two books out of one.     The most significant of the remaining unpublished stories, scenes, and fragments were published under the originally intended name for the novel, Summer Morning, Summer Night, in 2007. , by Ray Bradbury; PS Publishing, 2007             From 1950 to 1954, 31 of Bradburys stories were adapted by ": null
    },
    {
        "Al Feldstein": "Al Feldstein"
    },
    {
        " for ": null
    },
    {
        "EC Comics": "Ec Comics"
    },
    {
        " and 16 of these were collected in the paperbacks,  The Autumn People  and  Tomorrow Midnight  , both published by ": null
    },
    {
        "Ballantine Books": "Ballantine Books"
    },
    {
        " with cover illustrations by ": null
    },
    {
        "Frank Frazetta": "Frank Frazetta"
    },
    {
        ".   Also in the early 1950s, adaptations of Bradburys stories were televised in several anthology shows, including  Tales of Tomorrow ,  Lights Out , Out There,  Suspense ,  CBS Television Workshop ,  Jane Wymans Fireside Theatre ,  Star Tonight , Windows and  Alfred Hitchcock Presents . The Merry-Go-Round , a half-hour film adaptation of Bradburys The Black Ferris , praised by Variety, was shown on Starlight Summer Theater in 1954 and NBCs Sneak Preview in 1956. During that same period, several stories were adapted for radio drama, notably on the science fiction anthologies  Dimension X  and its successor  X Minus One .          Producer ": null
    },
    {
        "William Alland": "William Alland"
    },
    {
        " first brought Bradbury to movie theaters in 1953 with  It Came from Outer Space , a ": null
    },
    {
        "Harry Essex": "Harry Essex"
    },
    {
        " screenplay developed from Bradburys screen treatment Atomic Monster . Three weeks later came the release of Eugène Louriés  The Beast from 20,000 Fathoms  , which featured one scene based on Bradburys ": null
    },
    {
        "The Fog Horn": "The Fog Horn"
    },
    {
        " , about a sea monster mistaking the sound of a fog horn for the mating cry of a female. Bradburys close friend Ray Harryhausen produced the stop-motion animation of the creature. Bradbury later returned the favor by writing a short story, Tyrannosaurus Rex , about a stop-motion animator who strongly resembled Harryhausen. Over the next 50 years, more than 35 features, shorts, and TV movies were based on Bradburys stories or screenplays.   Bradbury was hired in 1953 by director ": null
    },
    {
        "John Huston": "John Huston"
    },
    {
        " to work on the screenplay for his film version of ": null
    },
    {
        "Melvilles": "Herman Melville"
    },
    {
        "  Moby Dick  , which stars ": null
    },
    {
        "Gregory Peck": "Gregory Peck"
    },
    {
        " as Captain Ahab, ": null
    },
    {
        "Richard Basehart": "Richard Basehart"
    },
    {
        " as Ishmael, and ": null
    },
    {
        "Orson Welles": "Orson Welles"
    },
    {
        " as Father Mapple. A significant result of the film was Bradburys book  Green Shadows, White Whale , a semifictionalized account of the making of the film, including Bradburys dealings with Huston and his time in Ireland, where exterior scenes that were set in ": null
    },
    {
        "New Bedford, Massachusetts": "New Bedford, Massachusetts"
    },
    {
        ", were filmed.     Bradburys short story I Sing the Body Electric was adapted for the ": null
    },
    {
        "100th episode of The Twilight Zone": "I Sing The Body Electric"
    },
    {
        ". The episode was first aired on May 18, 1962.     Bradbury and director Charles Rome Smith co-founded the Pandemonium Theatre Company in 1964. Its first production was The World of Ray Bradbury, consisting of one-act adaptations of ": null
    },
    {
        "The Pedestrian": "The Pedestrian"
    },
    {
        " , The Veldt , and To the Chicago Abyss . It ran for four months at the Coronet Theatre in Los Angeles ; an off-Broadway production was presented in October 1965. Another Pandemonium Theatre Company production was mounted at the Coronet Theatre in 1965, again presenting adaptations of three Bradbury short stories: The Wonderful Ice Cream Suit, The Day It Rained Forever, and Device Out of Time. . The original cast for this production featured ": null
    },
    {
        "Booth Coleman": "Booth Coleman"
    },
    {
        ", ": null
    },
    {
        "Joby Baker": "Joby Baker"
    },
    {
        ", Fredric Villani, Arnold Lessing, Eddie Sallia, ": null
    },
    {
        "Keith Taylor": "Keith Taylor"
    },
    {
        ", ": null
    },
    {
        "Richard Bull": "Richard Bull"
    },
    {
        ", Gene Otis Shane, Henry T. Delgado, ": null
    },
    {
        "F. Murray Abraham": "F. Murray Abraham"
    },
    {
        ", Anne Loos, and ": null
    },
    {
        "Len Lesser": "Len Lesser"
    },
    {
        ". The director, again, was Charles Rome Smith.     ": null
    },
    {
        "Oskar Werner": "Oskar Werner"
    },
    {
        " and ": null
    },
    {
        "Julie Christie": "Julie Christie"
    },
    {
        " starred in  Fahrenheit 451  , an adaptation of Bradburys novel directed by ": null
    },
    {
        "François Truffaut": "François Truffaut"
    },
    {
        ".     In 1966, Bradbury helped ": null
    },
    {
        "Lynn Garrison": "Lynn Garrison"
    },
    {
        " create AVIAN, a specialist aviation magazine. For the first issue, Bradbury wrote a poem, Planes That Land on Grass .     In 1969,  The Illustrated Man  was brought to the big screen, starring ": null
    },
    {
        "Rod Steiger": "Rod Steiger"
    },
    {
        ", ": null
    },
    {
        "Claire Bloom": "Claire Bloom"
    },
    {
        ", and ": null
    },
    {
        "Robert Drivas": "Robert Drivas"
    },
    {
        ". Containing the prologue and three short stories from the book, the film received mediocre reviews. The same year, Bradbury approached composer ": null
    },
    {
        "Jerry Goldsmith": "Jerry Goldsmith"
    },
    {
        ", who had worked with Bradbury in dramatic radio of the 1950s and later scored the ": null
    },
    {
        "film version": "The Illustrated Man"
    },
    {
        ", to compose a ": null
    },
    {
        "cantata": "Cantata"
    },
    {
        "  Christus Apollo  based on Bradburys text.  The work premiered in late 1969, with the ": null
    },
    {
        "California Chamber Symphony": "California Chamber Symphony"
    },
    {
        " performing with narrator ": null
    },
    {
        "Charlton Heston": "Charlton Heston"
    },
    {
        " at ": null
    },
    {
        "UCLA": "University Of California, Los Angeles"
    },
    {
        ".      In 1972, The Screaming Woman was adapted as an ABC Movie-of-the-Week starring Olivia de Havilland.      The Martian Chronicles  became a three-part TV ": null
    },
    {
        "miniseries": "Miniseries"
    },
    {
        " starring ": null
    },
    {
        "Rock Hudson": "Rock Hudson"
    },
    {
        ", which was first broadcast by ": null
    },
    {
        "NBC": "Nbc"
    },
    {
        " in 1980. Bradbury found the miniseries just boring .      The 1982 television movie  The Electric Grandmother  was based on Bradburys short story I Sing the Body Electric .     The 1983 horror film  Something Wicked This Way Comes , starring ": null
    },
    {
        "Jason Robards": "Jason Robards"
    },
    {
        " and ": null
    },
    {
        "Jonathan Pryce": "Jonathan Pryce"
    },
    {
        ", is based on the Bradbury novel of the ": null
    },
    {
        "same name": "Something Wicked This Way Comes"
    },
    {
        ".     In 1984, Michael McDonough of Brigham Young University produced ": null
    },
    {
        "Bradbury 13": "Bradbury 13"
    },
    {
        " , a series of 13 audio adaptations of famous stories from Bradbury, in conjunction with National Public Radio. The full-cast dramatizations featured adaptations of The Ravine , Night Call, Collect , ": null
    },
    {
        "The Veldt": "The Veldt"
    },
    {
        " , There Was an Old Woman , Kaleidoscope , ": null
    },
    {
        "Dark They Were, and Golden-Eyed": "Dark They Were, And Golden-Eyed"
    },
    {
        " , The Screaming Woman , ": null
    },
    {
        "A Sound of Thunder": "A Sound Of Thunder"
    },
    {
        " , The Man , The Wind , The Fox and the Forest , ": null
    },
    {
        "Here There Be Tygers": "Here There Be Tygers"
    },
    {
        " , and The Happiness Machine . Voiceover actor ": null
    },
    {
        "Paul Frees": "Paul Frees"
    },
    {
        " provided narration, while Bradbury was responsible for the opening voiceover; Greg Hansen and Roger Hoffman scored the episodes. The series won a ": null
    },
    {
        "Peabody Award": "Peabody Award"
    },
    {
        " and two Gold Cindy awards, and was released on CD on May 1, 2010. The series began airing on ": null
    },
    {
        "BBC Radio 4 Extra": "Bbc Radio 4 Extra"
    },
    {
        " on June 12, 2011.     From 1985 to 1992, Bradbury hosted a ": null
    },
    {
        "syndicated": "Broadcast Syndication"
    },
    {
        " anthology television series,  The Ray Bradbury Theater , for which he adapted 65 of his stories. Each episode began with a shot of Bradbury in his office, gazing over mementoes of his life, which he states are used to spark ideas for stories. During the first two seasons, Bradbury also provided additional voiceover narration specific to the featured story and appeared on screen.     Deeply respected in the ": null
    },
    {
        "USSR": "Ussr"
    },
    {
        ", Bradburys fiction has been adapted into five episodes of the ": null
    },
    {
        "Soviet": "Soviet Union"
    },
    {
        " science-fiction TV series This Fantastic World which adapted the stories film version of I Sing The Body Electric , Fahrenheit 451, A Piece of Wood , To the Chicago Abyss , and Forever and the Earth .  In 1984 a cartoon adaptation of ": null
    },
    {
        "There Will Come Soft Rains": "There Will Come Soft Rains"
    },
    {
        " came out by ": null
    },
    {
        "Uzbek": "Uzbekistan"
    },
    {
        " director Nazim Tyuhladziev.  He made a film adaptation of ": null
    },
    {
        "The Veldt in 1987": "The Veldt"
    },
    {
        ".  In 1989, a cartoon adaptation of ": null
    },
    {
        "Here There Be Tygers": "Here There Be Tygers"
    },
    {
        " by director Vladimir Samsonov came out.      Bradbury wrote and narrated the 1993 animated television version of  The Halloween Tree , based on ": null
    },
    {
        "his 1972 novel": "The Halloween Tree"
    },
    {
        ".     The 1998 film  The Wonderful Ice Cream Suit , released by ": null
    },
    {
        "Touchstone Pictures": "Touchstone Pictures"
    },
    {
        ", was written by Bradbury. It was based on his story The Magic White Suit originally published in  The Saturday Evening Post  in 1957. The story had also previously been adapted as a play, a musical, and a 1958 television version.     In 2002, Bradburys own Pandemonium Theatre Company production of Fahrenheit 451 at Burbanks Falcon Theatre combined live acting with projected digital animation by the . In 1984, Telarium released a game for ": null
    },
    {
        "Commodore 64": "Commodore 64"
    },
    {
        " based on Fahrenheit 451.      In 2005, the film  A Sound of Thunder  was released, loosely based upon the short story of the same name. The film  The Butterfly Effect  revolves around the same theory as A Sound of Thunder and contains many references to its inspiration. Short film adaptations of A Piece of Wood and  The Small Assassin  were released in 2005 and 2007, respectively.     In 2005, it was reported that Bradbury was upset with filmmaker ": null
    },
    {
        "Michael Moore": "Michael Moore"
    },
    {
        " for using the title  Fahrenheit 9/11 , which is an allusion to Bradburys Fahrenheit 451, for his documentary about the ": null
    },
    {
        "George W. Bush administration": "Presidency Of George W. Bush"
    },
    {
        ". Bradbury expressed displeasure with Moores use of the title, but stated that his resentment was not politically motivated, though Bradbury was ": null
    },
    {
        "conservative-leaning": "Conservatism In The United States"
    },
    {
        " politically.  Bradbury asserted that he did not want any of the money made by the movie, nor did he believe that he deserved it. He pressured Moore to change the name, but to no avail. Moore called Bradbury two weeks before the films release to apologize, saying that the films marketing had been set in motion a long time ago and it was too late to change the title.      In 2008, the film  Ray Bradburys Chrysalis  was produced by Roger Lay Jr. for Urban Archipelago Films, based upon the short story of the same name. The film won the best feature award at the International Horror and Sci-Fi Film Festival in Phoenix. The film has international distribution by Arsenal Pictures and domestic distribution by Lightning Entertainment.     In 2010, The Martian Chronicles was adapted for radio by Colonial Radio Theatre on the Air.     Bradburys works and approach to writing are documented in ": null
    },
    {
        "Terry Sanders": "Terry Sanders"
    },
    {
        " film Ray Bradbury: Story of a Writer .     Bradburys poem Groon was voiced as a tribute in 2012.              The ": null
    },
    {
        "Ray Bradbury Award": "Ray Bradbury Award"
    },
    {
        " for excellency in screenwriting was occasionally presented by the ": null
    },
    {
        "Science Fiction and Fantasy Writers of America": "Science Fiction And Fantasy Writers Of America"
    },
    {
        " – presented to six people on four occasions from 1992 to 2009.  . The Locus Index to SF Awards: About the Awards. Locus Publications. Retrieved April 2, 2013. Beginning 2010, the Ray Bradbury Award for Outstanding Dramatic Presentation is presented annually according to Nebula Awards rules and procedures, although it is not a Nebula Award.  . SFWA. Retrieved April 2, 2013. Quote: Effective January 2009, here are the new rules for the Nebula Awards. The revamped Bradbury Award replaced the ": null
    },
    {
        "Nebula Award for Best Script": "Nebula Award For Best Script"
    },
    {
        ".     In 1972, an impact crater on the Moon was named ": null
    },
    {
        "Dandelion Crater": "Dandelion Crater"
    },
    {
        " by the ": null
    },
    {
        "Apollo 15": "Apollo 15"
    },
    {
        " astronauts, in honor of Bradburys novel Dandelion Wine.   In 1984, he received the ": null
    },
    {
        "Prometheus Award": "Prometheus Award"
    },
    {
        " for Fahrenheit 451.   Ray Bradbury Park was dedicated in Waukegan, Illinois, in 1990. He was present for the ribbon-cutting ceremony. The park contains locations described in Dandelion Wine, most notably the 113 steps . In 2009, a panel designed by artist Michael Pavelich was added to the park detailing the history of Ray Bradbury and Ray Bradbury Park.    An ": null
    },
    {
        "asteroid": "Asteroid"
    },
    {
        " discovered in 1992 was named ": null
    },
    {
        "9766 Bradbury": "9766 Bradbury"
    },
    {
        " in his honor.   In 1994, he received the ": null
    },
    {
        "Peggy V. Helmerich Distinguished Author Award": "Helmerich Award"
    },
    {
        ", presented annually by the ": null
    },
    {
        "Tulsa Library Trust": "Tulsa City-County Library"
    },
    {
        ".   In 1994, he won an ": null
    },
    {
        "Emmy Award": "Daytime Emmy Award"
    },
    {
        " for the screenplay  The Halloween Tree .   In 2000, he was awarded the Medal for Distinguished Contribution to American Letters from the National Book Foundation.  with his acceptance speech.   For his contribution to the motion picture industry, Bradbury was given a star on the ": null
    },
    {
        "Hollywood Walk of Fame": "Hollywood Walk Of Fame"
    },
    {
        " on April 1, 2002. . Press release, office of Mayor Hahn, April 1, 2002. Retrieved April 2, 2013.   In 2003, he received an honorary doctorate from ": null
    },
    {
        "Woodbury University": "Woodbury University"
    },
    {
        ", where he presented the Ray Bradbury Creativity Award each year until his death.    On November 17, 2004, Bradbury received the ": null
    },
    {
        "National Medal of Arts": "National Medal Of Arts"
    },
    {
        ", presented by President ": null
    },
    {
        "George W. Bush": "George W. Bush"
    },
    {
        " and ": null
    },
    {
        "Laura Bush": "Laura Bush"
    },
    {
        ".    Bradbury received a ": null
    },
    {
        "World Fantasy Award for Life Achievement": "World Fantasy Award For Life Achievement"
    },
    {
        " at the 1977 World Fantasy Convention and was named ": null
    },
    {
        "Gandalf Grand Master": "Gandalf Grand Master Award"
    },
    {
        " of Fantasy at the 1980 World Science Fiction Convention. In 1989 the ": null
    },
    {
        "Horror Writers Association": "Horror Writers Association"
    },
    {
        " gave him the fourth or fifth ": null
    },
    {
        "Bram Stoker Award for Lifetime Achievement": "Bram Stoker Award For Lifetime Achievement"
    },
    {
        " in ": null
    },
    {
        "horror fiction": "Horror Fiction"
    },
    {
        " and the ": null
    },
    {
        "Science Fiction Writers of America": "Science Fiction Writers Of America"
    },
    {
        " made him its 10th ": null
    },
    {
        "SFWA Grand Master": "Sfwa Grand Master"
    },
    {
        ". He won a ": null
    },
    {
        "First Fandom Hall of Fame Award": "First Fandom"
    },
    {
        " in 1996  and the ": null
    },
    {
        "Science Fiction and Fantasy Hall of Fame": "Emp Museumscience Fiction Hall Of Fame"
    },
    {
        " inducted him in 1999, its fourth class of two deceased and two living writers.   In 2005, he was awarded the degree of Doctor of Laws  by the ": null
    },
    {
        "National University of Ireland, Galway": "National University Of Ireland, Galway"
    },
    {
        ", at a conferring ceremony in Los Angeles.   On April 14, 2007, Bradbury received the ": null
    },
    {
        "Sir Arthur Clarke Awards": "Sir Arthur Clarke Award"
    },
    {
        "Special Award, given by Clarke to a recipient of his choice.   On April 16, 2007, Bradbury received a ": null
    },
    {
        "special citation by the Pulitzer Prize jury": "Pulitzer Prize Special Citations And Awards"
    },
    {
        " for his distinguished, prolific, and deeply influential career as an unmatched author of science fiction and fantasy. . The Pulitzer Prizes. Retrieved November 2, 2013.   In 2007, Bradbury was made a Commandeur of the ": null
    },
    {
        "Ordre des Arts et des Lettres": "Ordre Des Arts Et Des Lettres"
    },
    {
        " by the French government.    In 2008, he was named ": null
    },
    {
        "SFPA": "Science Fiction Poetry Association"
    },
    {
        " Grandmaster.    On May 17, 2008, Bradbury received the inaugural J. Lloyd Eaton Lifetime Achievement Award in Science Fiction, presented by the UCR Libraries at the 2008 ": null
    },
    {
        "Eaton Science Fiction Conference": "Eaton Award"
    },
    {
        ", Chronicling Mars . . Eaton Science Fiction Conference. ": null
    },
    {
        "University of California, Riverside": "University Of California, Riverside"
    },
    {
        " . Retrieved April 2, 2013.   On November 19, 2008, Bradbury was presented with the Illinois Literary Heritage Award by the Illinois Center for the Book.   In 2009, Bradbury was awarded an Honorary Doctorate by Columbia College Chicago.    In 2010, ": null
    },
    {
        "Spike TV": "Spike Tv"
    },
    {
        " Scream Awards": "2010 Scream Awards"
    },
    {
        " Comic-Con": "San Diego Comic-Con International"
    },
    {
        " Icon Award went to Bradbury   In 2012, the ": null
    },
    {
        "NASA": "Nasa"
    },
    {
        " Curiosity rover": "Curiosity Rover"
    },
    {
        " landing site    on the ": null
    },
    {
        "planet Mars": "Mars"
    },
    {
        " was named ": null
    },
    {
        "Bradbury Landing": "Bradbury Landing"
    },
    {
        " .     On December 6, 2012, the Los Angeles street corner at 5th and Flower Streets was named in his honor. Bob Pool, , Los Angeles Times, December 6, 2012   On February 24, 2013, Bradbury was honored at the ": null
    },
    {
        "85th Academy Awards": "85Th Academy Awards"
    },
    {
        " during that events In Memoriam segment.        Bradbury appeared in the documentary  The Fantasy Film Worlds of George Pal  , produced and directed by ": null
    },
    {
        "Arnold Leibovit": "Arnold Leibovit"
    },
    {
        ".": null
    }
]