[
    {
        "                The Red Sea  is a ": null
    },
    {
        "seawater": "Seawater"
    },
    {
        " inlet": "Inlet"
    },
    {
        " of the ": null
    },
    {
        "Indian Ocean": "Indian Ocean"
    },
    {
        ", lying between ": null
    },
    {
        "Africa": "Africa"
    },
    {
        " and ": null
    },
    {
        "Asia": "Asia"
    },
    {
        ". The connection to the ocean is in the south through the ": null
    },
    {
        "Bab el Mandeb": "Bab El Mandeb"
    },
    {
        " strait and the ": null
    },
    {
        "Gulf of Aden": "Gulf Of Aden"
    },
    {
        ". To the north lie the ": null
    },
    {
        "Sinai Peninsula": "Sinai Peninsula"
    },
    {
        ", the ": null
    },
    {
        "Gulf of Aqaba": "Gulf Of Aqaba"
    },
    {
        ", and the ": null
    },
    {
        "Gulf of Suez": "Gulf Of Suez"
    },
    {
        " . The Red Sea is a ": null
    },
    {
        "Global 200": "Global 200"
    },
    {
        " ecoregion": "Ecoregion"
    },
    {
        ". The sea is underlain by the ": null
    },
    {
        "Red Sea Rift": "Red Sea Rift"
    },
    {
        " which is part of the ": null
    },
    {
        "Great Rift Valley": "Great Rift Valley"
    },
    {
        ".     The Red Sea has a surface area of roughly 438,000  km 2 ,   is about 2250  km long and, at its widest point, 355  km wide. It has a maximum depth of  in the central Suakin Trough, Robert Dinwiddie: Ocean The Worlds Last Wilderness Revealed. Dorling Kindersley, London 2008, p. 452 and an average depth of 490  m . However, there are also extensive shallow shelves, noted for their marine life and ": null
    },
    {
        "corals": "Coral"
    },
    {
        ". The sea is the habitat of over 1,000 ": null
    },
    {
        "invertebrate": "Invertebrate"
    },
    {
        " species, and 200 soft and hard corals. It is the worlds northernmost ": null
    },
    {
        "tropical": "Tropics"
    },
    {
        " sea.       The ": null
    },
    {
        "International Hydrographic Organization": "International Hydrographic Organization"
    },
    {
        " defines the limits of the Red Sea as follows:      ::On the North. The Southern limits of the ": null
    },
    {
        "Gulfs of Suez": "Gulf Of Suez"
    },
    {
        " A line running from ": null
    },
    {
        "Ràs Muhammed": "Ras Muhammad National Park"
    },
    {
        " to the South point of ": null
    },
    {
        "Shadwan": "Shadwan"
    },
    {
        " Island and thence Westward on a parallel to the coast of ": null
    },
    {
        "Africa": "Africa"
    },
    {
        " and ": null
    },
    {
        "Aqaba": "Gulf Of Aqaba"
    },
    {
        " A line running from Ràs al Fasma Southwesterly to Requin Island  through ": null
    },
    {
        "Tiran Island": "Tiran Island"
    },
    {
        " to the Southwest point thereof and thence Westward on a parallel to the coast of the ": null
    },
    {
        "Sinai Peninsula": "Sinai Peninsula"
    },
    {
        " .   ::On the South. A line joining ": null
    },
    {
        "Husn Murad": "Hisn Murad"
    },
    {
        "  and ": null
    },
    {
        "Ras Siyyan": "Ras Siyyan"
    },
    {
        " .          Red Sea is a direct translation of the ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " Erythra Thalassa , ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " Mare Rubrum ,  , ": null
    },
    {
        "Somali": "Somali Language"
    },
    {
        " Badda Cas and ": null
    },
    {
        "Tigrinya": "Tigrinya Language"
    },
    {
        " Qeyyiḥ bāḥrī . The name of the sea may signify the seasonal blooms of the red-coloured  Trichodesmium erythraeum  near the waters surface.   A theory favoured by some modern scholars is that the name red is referring to the direction south, just as the ": null
    },
    {
        "Black Seas": "Black Sea"
    },
    {
        " name may refer to north. The basis of this theory is that some Asiatic languages used colour words to refer to the ": null
    },
    {
        "cardinal directions": "5 Cardinal Point"
    },
    {
        ".  ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        " on one occasion uses Red Sea and Southern Sea interchangeably. Schmitt 1996     The name in Hebrew  Yam Suph   is of biblical origin.   The name in  Phiom Enhah is connected to ": null
    },
    {
        "Ancient Egyptian": "Egyptian Language"
    },
    {
        " root ḥḥ which refers to water and sea  - Pa-yem Aa en Mu-Ked, the ancient Egyptian name of the Red Sea.      Historically, it was also known to western geographers as Mare Mecca , and Sinus Arabicus .  Some ancient geographers called the Red Sea the Arabian Gulf  or Gulf of Arabia.  Andrew E. Hill, John H. Walton , A survey of the Old Testament, p.32      The association of the Red Sea with the ": null
    },
    {
        "biblical": "Bible"
    },
    {
        " account of the Israelites ": null
    },
    {
        "crossing the Red Sea": "Crossing The Red Sea"
    },
    {
        " is ancient, and was made explicit in the ": null
    },
    {
        "Septuagint": "Septuagint"
    },
    {
        " translation of the ": null
    },
    {
        "Book of Exodus": "Book Of Exodus"
    },
    {
        " from ": null
    },
    {
        "Hebrew": "Hebrew"
    },
    {
        " to ": null
    },
    {
        "Koine Greek": "Koine"
    },
    {
        " in approximately the third century B.C. In that version, the  Yam Suph   is translated as Erythra Thalassa . Although reeds do not grow in the Red Sea today , Professor ": null
    },
    {
        "Colin Humphreys": "Colin Humphreys"
    },
    {
        " explains the discrepancy on the basis that a freshwater marsh of reeds could have existed around ": null
    },
    {
        "Aqaba": "Aqaba"
    },
    {
        ".      The Red Sea is one of four seas named in English after common ": null
    },
    {
        "color terms": "Color Term"
    },
    {
        " – the others being the ": null
    },
    {
        "Black Sea": "Black Sea"
    },
    {
        ", the ": null
    },
    {
        "White Sea": "White Sea"
    },
    {
        " and the ": null
    },
    {
        "Yellow Sea": "Yellow Sea"
    },
    {
        ". The direct rendition of the Greek Erythra thalassa in Latin as ": null
    },
    {
        "Mare Erythraeum": "Mare Erythraeum"
    },
    {
        " refers to the north-western part of the ": null
    },
    {
        "Indian Ocean": "Indian Ocean"
    },
    {
        ", and also to a region on ": null
    },
    {
        "Mars": "Mars"
    },
    {
        ".              The earliest known exploration of the Red Sea was conducted by ": null
    },
    {
        "ancient Egypt": "Ancient Egypt"
    },
    {
        "ians, as they attempted to establish commercial routes to ": null
    },
    {
        "Punt": "Land Of Punt"
    },
    {
        ". One such expedition took place around 2500 BCE, and another around 1500 BCE . Both involved long voyages down the Red Sea.  The biblical ": null
    },
    {
        "Book of Exodus": "Book Of Exodus"
    },
    {
        " tells the account of the ": null
    },
    {
        "Israelites": "Israelites"
    },
    {
        " crossing of a body of water": "Crossing The Red Sea"
    },
    {
        ", which the Hebrew text calls  Yam Suph  . Yam Suph was traditionally identified as the Red Sea. Rabbi ": null
    },
    {
        "Saadia Gaon": "Saadia Gaon"
    },
    {
        " , in his Judeo-Arabic translation of the Pentateuch, identifies the crossing place of the Red Sea as Baḥar al-Qulzum, meaning the ": null
    },
    {
        "Gulf of Suez": "Gulf Of Suez"
    },
    {
        ". Tafsir, Saadia Gaon, s.v. Exodus 15:22, et al.      In the 6th century BCE, ": null
    },
    {
        "Darius the Great of Persia": "Darius The Great Of Persia"
    },
    {
        " sent reconnaissance missions to the Red Sea, improving and extending navigation by locating many hazardous rocks and currents. A canal was built between the ": null
    },
    {
        "Nile": "Nile"
    },
    {
        " and the northern end of the Red Sea at ": null
    },
    {
        "Suez": "Suez"
    },
    {
        ". In the late 4th century BCE, ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " sent Greek naval expeditions down the Red Sea to the Indian Ocean. Greek navigators continued to explore and compile data on the Red Sea. ": null
    },
    {
        "Agatharchides": "Agatharchides"
    },
    {
        " collected information about the sea in the 2nd century BCE. The  Periplus of the Erythraean Sea  , a ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " periplus": "Periplus"
    },
    {
        " written by an unknown author around the 1st century , contains a detailed description of the Red Seas ports and sea routes.  The Periplus also describes how ": null
    },
    {
        "Hippalus": "Hippalus"
    },
    {
        " first discovered the direct route from the Red Sea to India.     The Red Sea was favored for ": null
    },
    {
        "Roman trade with India": "Roman Trade With India"
    },
    {
        " starting with the reign of ": null
    },
    {
        "Augustus": "Augustus"
    },
    {
        ", when the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        " gained control over the Mediterranean, ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", and the northern Red Sea. The route had been used by previous states but grew in the volume of traffic under the Romans. From Indian ports goods from ": null
    },
    {
        "China": "China"
    },
    {
        " were introduced to the Roman world. Contact between Rome and China depended on the Red Sea, but the route was broken by the ": null
    },
    {
        "Aksumite Empire": "Aksumite Empire"
    },
    {
        " around the 3rd century AD.        During the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        ", the Red Sea was an important part of the ": null
    },
    {
        "spice trade": "Spice Trade"
    },
    {
        " route. In 1183, ": null
    },
    {
        "Raynald of Châtillon": "Raynald Of Châtillon"
    },
    {
        " launched a raid down the Red Sea to attack the Muslim pilgrim convoys to Mecca. Mallett, Alex A Trip down the Red Sea with Reynald of Châtillon pages 141-153 from Journal of the Royal Asiatic Society, Volume 18, Issue 2, April 2008 pages 143-144. The possibility that Raynalds fleet might sack the holy cities of Mecca and Medina caused fury throughout the Muslim world. Mallett, Alex A Trip down the Red Sea with Reynald of Châtillon pages 141-153 from Journal of the Royal Asiatic Society, Volume 18, Issue 2, April 2008 pages 146-147. However, it appears that Reynalds target were the lightly armed Muslim pilgrim convoys rather the well guarded cities of Mecca and Medina, and the belief in the Muslim world that Reynald was seeking to sack the holy cities was due to the proximity of those cities to the areas that Raynald raided. Mallett, Alex A Trip down the Red Sea with Reynald of Châtillon pages 141-153 from Journal of the Royal Asiatic Society, Volume 18, Issue 2, April 2008 pages 152-153. In 1513, trying to secure that channel to Portugal, ": null
    },
    {
        "Afonso de Albuquerque": "Afonso De Albuquerque"
    },
    {
        " laid ": null
    },
    {
        "siege to Aden": "Siege Of Aden"
    },
    {
        " By M. D. D. Newitt, , p.87, Routledge, 2005,  but was forced to retreat. They cruised the Red Sea inside the ": null
    },
    {
        "Bab al-Mandab": "Bab Al-Mandab"
    },
    {
        ", as the first fleet from Europe in modern times to have sailed these waters.     In 1798, ": null
    },
    {
        "France": "France"
    },
    {
        " ordered General ": null
    },
    {
        "Napoleon": "Napoleon I"
    },
    {
        " to invade ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        " and take control of the Red Sea. Although he failed in his mission, the engineer ": null
    },
    {
        "Jean-Baptiste Lepère": "Jean-Baptiste Lepère"
    },
    {
        ", who took part in it, revitalised the plan for a canal which had been envisaged during the reign of the ": null
    },
    {
        "Pharaohs": "Pharaoh"
    },
    {
        ". Several canals were built in ancient times from the Nile to the Red Sea along or near the line of the present ": null
    },
    {
        "Sweet Water Canal": "Sweet Water Canal"
    },
    {
        ", but none lasted for long. The ": null
    },
    {
        "Suez Canal": "Suez Canal"
    },
    {
        " was opened in November 1869. After the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        ", the Americans and Soviets exerted their influence whilst the volume of oil tanker traffic intensified. However, the ": null
    },
    {
        "Six-Day War": "Six-Day War"
    },
    {
        " culminated in the closure of the Suez Canal from 1967 to 1975. Today, in spite of patrols by the major maritime fleets in the waters of the Red Sea, the Suez Canal has never recovered its supremacy over the Cape route, which is believed to be less vulnerable to piracy.          The Red Sea is between arid land, ": null
    },
    {
        "desert": "Desert"
    },
    {
        " and ": null
    },
    {
        "semi-desert": "Semi-Desert"
    },
    {
        ". Reef systems are better developed along the Red Sea mainly because of its greater depths and an efficient water circulation pattern. The Red Sea water mass-exchanges its water with the ": null
    },
    {
        "Arabian Sea": "Arabian Sea"
    },
    {
        ", ": null
    },
    {
        "Indian Ocean": "Indian Ocean"
    },
    {
        " via the ": null
    },
    {
        "Gulf of Aden": "Gulf Of Aden"
    },
    {
        ". These physical factors reduce the effect of high salinity caused by evaporation in the north and relatively hot water in the south.     The ": null
    },
    {
        "climate": "Climate"
    },
    {
        " of the Red Sea is the result of two monsoon seasons; a northeasterly monsoon and a southwesterly monsoon. Monsoon winds occur because of differential heating between the land and the sea. Very high surface temperatures and high salinities make this one of the warmest and saltiest bodies of seawater in the world. The average surface water temperature of the Red Sea during the summer is about  in the north and  in the south, with only about 2  °C variation during the winter months. The overall average water temperature is . Temperature and visibility remain good to around 200  m . The sea is known for its strong winds and unpredictable local currents.     The ": null
    },
    {
        "rainfall": "Rainfall"
    },
    {
        " over the Red Sea and its coasts is extremely low, averaging  per year. The rain is mostly short showers, often with thunderstorms and occasionally with dust ": null
    },
    {
        "storms": "Storm"
    },
    {
        ". The scarcity of rainfall and no major source of fresh water to the Red Sea result in excess evaporation as high as  per year and high salinity with minimal seasonal variation. A recent underwater expedition to the Red Sea offshore from ": null
    },
    {
        "Sudan": "Sudan"
    },
    {
        " and ": null
    },
    {
        "Eritrea": "Eritrea"
    },
    {
        " BBC 2": "Bbc 2"
    },
    {
        " television program Oceans 3/8 The Red Sea , 8 pm - 9 pm Wednesday 26 November 2008 found surface water temperatures  in winter and up to  in the summer, but despite that extreme heat, the coral was healthy with much fish life with very little sign of ": null
    },
    {
        "coral bleaching": "Coral Bleaching"
    },
    {
        ", with only 9% infected by  Thalassomonas loyana , the white plague agent. ": null
    },
    {
        "Favia favus": "Favia"
    },
    {
        " coral there harbours a virus, BA3, which kills T. loyana.  at ": null
    },
    {
        "New Scientist": "New Scientist"
    },
    {
        ", 7 July 2012.p.17.   Plans are afoot to use samples of these corals apparently heat-adapted ": null
    },
    {
        "commensal": "Commensal"
    },
    {
        " algae": "Algae"
    },
    {
        " to salvage bleached coral elsewhere.       The Red Sea is one of the saltiest bodies of water in the world, owing to high evaporation and low precipitation; no significant rivers or streams drain into the sea, and its southern connection to the ": null
    },
    {
        "Gulf of Aden": "Gulf Of Aden"
    },
    {
        ", an arm of the Indian Ocean, is narrow.  Its ": null
    },
    {
        "salinity": "Salinity"
    },
    {
        " ranges from between ~36  ": null
    },
    {
        "‰": "Per Mil"
    },
    {
        " in the southern part and 41  ‰ in the northern part around the ": null
    },
    {
        "Gulf of Suez": "Gulf Of Suez"
    },
    {
        ", with an average of 40  ‰.         In general, tide ranges between  in the north, near the mouth of the Gulf of Suez and  in the south near the Gulf of Aden, but it fluctuates between  and  away from the nodal point. The central Red Sea is therefore almost tideless, and as such the annual water level changes are more significant. Because of the small tidal range the water during high tide inundates the coastal ": null
    },
    {
        "sabkhas": "Sabkha"
    },
    {
        " as a thin sheet of water up to a few hundred metres rather than flooding the ": null
    },
    {
        "sabkhas": "Sabkha"
    },
    {
        " through a network of channels. However, south of Jeddah in the ": null
    },
    {
        "Shoiaba": "Shoiaba"
    },
    {
        " area, the water from the lagoon may cover the adjoining sabkhas as far as , whereas north of Jeddah in the ": null
    },
    {
        "Al-Kharrar": "Al-Kharrar"
    },
    {
        " area the sabkhas are covered by a thin sheet of water as far as . The prevailing north and northeast winds influence the movement of water in the coastal inlets to the adjacent sabkhas, especially during storms. Winter mean sea level is  higher than in summer. Tidal velocities passing through constrictions caused by reefs, sand bars and low islands commonly exceed 1–2  m/s . Coral reefs in the Red Sea are near Egypt, Eritrea, Israel, Saudi Arabia, and Sudan.       Detailed information regarding current data is lacking, partially because the currents are weak and both spatially and temporally variable. The variation of temporal and spatial currents is as low as  and are governed all by wind. During the summer, NW winds drive surface water south for about four months at a velocity of 15–20  cm/s , whereas in winter the flow is reversed resulting in the inflow of water from the Gulf of Aden into the Red Sea. The net value of the latter predominates, resulting in an overall drift to the north end of the Red Sea. Generally, the velocity of the tidal current is between 50–60  cm/s with a maximum of  at the mouth of the al-Kharrar Lagoon. However, the range of the north-northeast current along the Saudi coast is 8–29  cm/s .       The north part of the Red Sea is dominated by persistent north-west ": null
    },
    {
        "winds": "Winds"
    },
    {
        ", with speeds ranging between  and . The rest of the Red Sea and the ": null
    },
    {
        "Gulf of Aden": "Gulf Of Aden"
    },
    {
        " are subjected to regular and seasonally reversible winds. The wind ": null
    },
    {
        "regime": "Regime"
    },
    {
        " is characterized by seasonal and regional variations in ": null
    },
    {
        "speed": "Speed"
    },
    {
        " and ": null
    },
    {
        "direction": "Direction"
    },
    {
        " with average speed generally increasing northward. Patzer, W. C. , Wind-induced reversal in the Red Sea circulation, Deep Sea Research, 21, 109-121.     Wind is the driving force in the Red Sea to transport material as suspension or as bedload. Wind-induced currents play an important role in the Red Sea in resuspending bottom sediments and transferring materials from sites of dumping to sites of burial in quiescent environment of deposition. Wind-generated current ": null
    },
    {
        "measurement": "Measurement"
    },
    {
        " is therefore important in order to determine the sediment dispersal pattern and its role in the erosion and accretion of the coastal rock exposure and the submerged coral beds. Morcos, S. A. , Physical and chemical oceanography of the Red Sea,Oceanography and Marine Biology Annual Review, 8, 73-202.          The Red Sea was formed by the ": null
    },
    {
        "Arabian peninsula": "Arabian Peninsula"
    },
    {
        " being split from the ": null
    },
    {
        "Horn of Africa": "Horn Of Africa"
    },
    {
        " by movement of the ": null
    },
    {
        "Red Sea Rift": "Red Sea Rift"
    },
    {
        ". This split started in the ": null
    },
    {
        "Eocene": "Eocene"
    },
    {
        " and accelerated during the ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        ". The sea is still widening ,  and it is considered that it will become an ocean in time . In 1949, a deep water survey reported anomalously hot brines in the central portion of the Red Sea. Later work in the 1960s confirmed the presence of hot, 60  °C , saline brines and associated metalliferous muds. The hot solutions were emanating from an active subseafloor ": null
    },
    {
        "rift": "Rift"
    },
    {
        ". Lake Asal in Djibouti is eligible as an experimental site to study the evolution of the deep hot brines of the Red Sea.  Indeed, by observing the strontium isotope composition of the Red Sea brines, it is easy to deduce how these salt waters found at the bottom of the Red Sea could have evolved in a similar way to Lake Asal, which ideally represents their compositional extreme. The high salinity of the waters was not hospitable to living organisms. Degens, Egon T. , 1969, Hot Brines and Recent Heavy Metal Deposits in the Red Sea, 600 pp, Springer-Verlag     Sometime during the ": null
    },
    {
        "Tertiary": "Tertiary"
    },
    {
        " period, the ": null
    },
    {
        "Bab el Mandeb": "Bab El Mandeb"
    },
    {
        " closed and the Red Sea evaporated to an empty hot dry salt-floored sink. Effects causing this would have been:   A race between the Red Sea widening and ": null
    },
    {
        "Perim Island": "Perim Island"
    },
    {
        " erupting": "Volcano"
    },
    {
        " filling the Bab el Mandeb with ": null
    },
    {
        "lava": "Lava"
    },
    {
        ".   The lowering of world ": null
    },
    {
        "sea level": "Sea Level"
    },
    {
        " during the ": null
    },
    {
        "Ice Ages": "Ice Age"
    },
    {
        " because of much water being locked up in the ": null
    },
    {
        "ice caps": "Ice Cap"
    },
    {
        ".     A number of volcanic islands rise from the center of the sea. Most are dormant. However, in 2007, ": null
    },
    {
        "Jabal al-Tair island": "Jabal Al-Tair Island"
    },
    {
        " in the Bab el Mandeb strait erupted violently. Two new islands were formed in 2011 and 2013 in the ": null
    },
    {
        "Zubair Archipelago": "Zubair Group"
    },
    {
        ", a small chain of islands owned by Yemen. The first island, Sholan Island, emerged in an eruption in December 2011, the second island, Jadid, emerged in September 2013.          The Durwara 2 Field was discovered in 1963, while the Suakin 1 Field and the Bashayer 1A Field were discovered in 1976, on the Egyptian side of the Red Sea. The Barqan Field was discovered in 1969, and the Midyan Field in 1992, both within the Midyan Basin on the Saudi Arabian side of the Red Sea. The 20-m thick ": null
    },
    {
        "Middle Miocene": "Middle Miocene"
    },
    {
        " Maqna ": null
    },
    {
        "Formation": "Formation"
    },
    {
        " is an oil source rock in the basin. ": null
    },
    {
        "Oil seeps": "Oil Seep"
    },
    {
        " occur near the ": null
    },
    {
        "Farasan Islands": "Farasan Islands"
    },
    {
        ", the ": null
    },
    {
        "Dahlak Archipelago": "Dahlak Archipelago"
    },
    {
        ", along the coast of Eritrea, and in the southeastern Red Sea along the coasts of Saudi Arabia and Yemen.           In terms of mineral resources the major constituents of the Red Sea sediments are as follows:   Biogenic constituents:   :Nanofossils, ": null
    },
    {
        "foraminifera": "Foraminifera"
    },
    {
        ", ": null
    },
    {
        "pteropods": "Pteropod"
    },
    {
        ", siliceous fossils   Volcanogenic constituents:   :": null
    },
    {
        "Tuff": "Tuff"
    },
    {
        "ites, ": null
    },
    {
        "volcanic ash": "Volcanic Ash"
    },
    {
        ", ": null
    },
    {
        "montmorillonite": "Montmorillonite"
    },
    {
        ", ": null
    },
    {
        "cristobalite": "Cristobalite"
    },
    {
        ", ": null
    },
    {
        "zeolites": "Zeolite"
    },
    {
        "   Terrigenous constituents:   :": null
    },
    {
        "Quartz": "Quartz"
    },
    {
        ", ": null
    },
    {
        "feldspars": "Feldspar"
    },
    {
        ", rock fragments, ": null
    },
    {
        "mica": "Mica"
    },
    {
        ", heavy minerals, ": null
    },
    {
        "clay minerals": "Clay Minerals"
    },
    {
        "Sulfide minerals": "Sulfide Mineral"
    },
    {
        ", ": null
    },
    {
        "aragonite": "Aragonite"
    },
    {
        ", Mg-": null
    },
    {
        "calcite": "Calcite"
    },
    {
        ", protodolomite, ": null
    },
    {
        "dolomite": "Dolomite"
    },
    {
        ", quartz, ": null
    },
    {
        "chalcedony": "Chalcedony"
    },
    {
        ".   Evaporite minerals:   :": null
    },
    {
        "Magnesite": "Magnesite"
    },
    {
        ", ": null
    },
    {
        "gypsum": "Gypsum"
    },
    {
        ", ": null
    },
    {
        "anhydrite": "Anhydrite"
    },
    {
        ", ": null
    },
    {
        "halite": "Halite"
    },
    {
        ", ": null
    },
    {
        "polyhalite": "Polyhalite"
    },
    {
        " goethite": "Goethite"
    },
    {
        ", ": null
    },
    {
        "hematite": "Hematite"
    },
    {
        ", ": null
    },
    {
        "siderite": "Siderite"
    },
    {
        ", ": null
    },
    {
        "rhodochrosite": "Rhodochrosite"
    },
    {
        ", ": null
    },
    {
        "pyrite": "Pyrite"
    },
    {
        ", ": null
    },
    {
        "sphalerite": "Sphalerite"
    },
    {
        ", anhydrite.             The Red Sea is a rich and diverse ": null
    },
    {
        "ecosystem": "Ecosystem"
    },
    {
        ". More than ": null
    },
    {
        "1200 species of fish": "Fish Of The Red Sea"
    },
    {
        "  have been recorded in the Red Sea, and around 10% of these are found nowhere else.  This also includes 42 species of ": null
    },
    {
        "deepwater fish": "List Of Deep Water Fish Of The Red Sea"
    },
    {
        ".      The rich diversity is in part due to the  of ": null
    },
    {
        "coral reef": "Coral Reef"
    },
    {
        " extending along its ": null
    },
    {
        "coastline": "Coastline"
    },
    {
        "; these ": null
    },
    {
        "fringing reefs": "Fringing Reef"
    },
    {
        " are 5000–7000 years old and are largely formed of stony ": null
    },
    {
        "acropora": "Acropora"
    },
    {
        " and ": null
    },
    {
        "porites": "Porites"
    },
    {
        " corals. The reefs form platforms and sometimes ": null
    },
    {
        "lagoons": "Lagoon"
    },
    {
        " along the coast and occasional other features such as cylinders . These coastal reefs are also visited by ": null
    },
    {
        "pelagic": "Pelagic"
    },
    {
        " species of Red Sea fish, including some of the ": null
    },
    {
        "44 species of shark": "List Of Sharks In The Red Sea"
    },
    {
        ".     It contains 175 species of ": null
    },
    {
        "nudibranch": "Nudibranch"
    },
    {
        ", many of which are only found in the Red Sea.      The Red Sea also contains many offshore reefs including several true atolls. Many of the unusual offshore reef formations defy classic coral reef classification schemes, and are generally attributed to the high levels of tectonic activity that characterize the area.     The special ": null
    },
    {
        "biodiversity": "Biodiversity"
    },
    {
        " of the area is recognized by the ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        "ian government, who set up the ": null
    },
    {
        "Ras Mohammed National Park": "Ras Mohammed"
    },
    {
        " in 1983. The rules and regulations governing this area protect local marine life, which has become a major draw for ": null
    },
    {
        "diving": "Scuba Diving"
    },
    {
        " enthusiasts.     ": null
    },
    {
        "Divers": "Scuba Diving"
    },
    {
        " and ": null
    },
    {
        "snorkellers": "Snorkeller"
    },
    {
        " should be aware that although most Red Sea species are innocuous, a few are hazardous to humans: see ": null
    },
    {
        "Red Sea species hazardous to humans": "Red Sea Species Hazardous To Humans"
    },
    {
        ". Lieske, E. and Myers, R.F. Coral reef guide; Red Sea London, HarperCollins      Other marine habitats include ": null
    },
    {
        "sea grass": "Sea Grass"
    },
    {
        " beds, ": null
    },
    {
        "salt pans": "Dry Lake"
    },
    {
        ", ": null
    },
    {
        "mangroves": "Mangrove"
    },
    {
        " and ": null
    },
    {
        "salt marsh": "Salt Marsh"
    },
    {
        "es.       There is extensive demand for ": null
    },
    {
        "desalinated": "Desalination"
    },
    {
        " water to meet the needs of the population and the industries along the Red Sea.     There are at least 18 desalination plants along the Red Sea coast of Saudi Arabia which discharge warm ": null
    },
    {
        "brine": "Brine"
    },
    {
        " and treatment chemicals  that ": null
    },
    {
        "bleach": "Bleach"
    },
    {
        " and kill ": null
    },
    {
        "corals": "Coral"
    },
    {
        " and cause diseases in the fish. This is only localized, but it may intensify with time and profoundly impact the fishing industry. Mabrook, B. Environmental Impact of Waste Brine Disposal of Desalination Plants, Red Sea, Egypt , Desalination, 1994, Vol.97, pp.453-465.     The water from the Red Sea is also used by ": null
    },
    {
        "oil refineries": "Oil Refineries"
    },
    {
        " and ": null
    },
    {
        "cement": "Cement"
    },
    {
        " factories for cooling.       The Red Sea is part of the ": null
    },
    {
        "sea roads": "Sea Road"
    },
    {
        " between ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ", the ": null
    },
    {
        "Persian Gulf": "Persian Gulf"
    },
    {
        " and ": null
    },
    {
        "East Asia": "East Asia"
    },
    {
        ", and as such has heavy ": null
    },
    {
        "shipping traffic": "Shipping"
    },
    {
        ". Government-related bodies with responsibility to police the Red Sea area include the ": null
    },
    {
        "Port Said Port Authority": "Port Said Port Authority"
    },
    {
        ", ": null
    },
    {
        "Suez Canal Authority": "Suez Canal Authority"
    },
    {
        " and ": null
    },
    {
        "Red Sea Ports Authority": "Red Sea Ports Authority"
    },
    {
        " of ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", ": null
    },
    {
        "Jordan Maritime Authority": "Jordan Maritime Authority"
    },
    {
        ", ": null
    },
    {
        "Israel Port Authority": "Israel Port Authority"
    },
    {
        ", ": null
    },
    {
        "Saudi Ports Authority": "Saudi Ports Authority"
    },
    {
        " and ": null
    },
    {
        "Sea Ports Corporation": "Sea Ports Corporation, Sudan"
    },
    {
        " of ": null
    },
    {
        "Sudan": "Sudan"
    },
    {
        ".          : Length: ~ - 79% of the eastern Red Sea with numerous coastal inlets   : Maximum Width: ~ 306–355 km – Massawa   : Minimum Width: ~ 26–29 km - ": null
    },
    {
        "Bab el Mandeb": "Bab El Mandeb"
    },
    {
        " Strait   : Average Width: ~    : Average Depth: ~    : Maximum Depth: ~    : Surface Area: 438-450 x 10 2 km 2   : Volume: 215–251 x 10 3 km 3     : Approximately 40% of the Red Sea is quite shallow , and about 25% is under  deep.   : About 15% of the Red Sea is over  depth that forms the deep axial trough.   : Shelf breaks are marked by coral reefs   : Continental slope has an irregular profile    : Centre of Red Sea has a narrow trough            The sea is known for its ": null
    },
    {
        "recreational diving": "Recreational Diving"
    },
    {
        " sites, such as ": null
    },
    {
        "Ras Mohammed": "Ras Mohammed"
    },
    {
        ", ": null
    },
    {
        "SS Thistlegorm": "Ss Thistlegorm"
    },
    {
        " , ": null
    },
    {
        "Elphinstone Reef": "Elphinstone Reef"
    },
    {
        ", ": null
    },
    {
        "The Brothers": "The Brothers, Egypt"
    },
    {
        ", ": null
    },
    {
        "Daedalus Reef": "Daedalus Reef"
    },
    {
        ", ": null
    },
    {
        "St.Johns Reef": "St.Johns Reef"
    },
    {
        ", ": null
    },
    {
        "Rocky Island": "Rocky Island"
    },
    {
        " in ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        "  and less known sites in ": null
    },
    {
        "Sudan": "Sudan"
    },
    {
        " such as ": null
    },
    {
        "Sanganeb": "Sanganeb"
    },
    {
        ", ": null
    },
    {
        "Abington": "Abington, Sudan"
    },
    {
        ", ": null
    },
    {
        "Angarosh": "Angarosh"
    },
    {
        " and ": null
    },
    {
        "Shaab Rumi": "Shaab Rumi"
    },
    {
        ".     The Red Sea became a popular destination for diving after the expeditions of ": null
    },
    {
        "Hans Hass": "Hans Hass"
    },
    {
        " in the 1950s, and later by ": null
    },
    {
        "Jacques-Yves Cousteau": "Jacques-Yves Cousteau"
    },
    {
        ".  Popular tourist resorts include ": null
    },
    {
        "El Gouna": "El Gouna"
    },
    {
        ", ": null
    },
    {
        "Hurghada": "Hurghada"
    },
    {
        ", ": null
    },
    {
        "Safaga": "Safaga"
    },
    {
        ", ": null
    },
    {
        "Marsa Alam": "Marsa Alam"
    },
    {
        ", on the west shore of the Red Sea, and ": null
    },
    {
        "Sharm-el-Sheikh": "Sharm-El-Sheikh"
    },
    {
        ", ": null
    },
    {
        "Dahab": "Dahab"
    },
    {
        ", and ": null
    },
    {
        "Taba": "Taba, Egypt"
    },
    {
        " on the ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        "ian side of ": null
    },
    {
        "Sinaï": "Sinaï"
    },
    {
        ", as well as ": null
    },
    {
        "Aqaba": "Aqaba"
    },
    {
        " in ": null
    },
    {
        "Jordan": "Jordan"
    },
    {
        " and ": null
    },
    {
        "Eilat": "Eilat"
    },
    {
        " in ": null
    },
    {
        "Israel": "Israel"
    },
    {
        " in an area known as the ": null
    },
    {
        "Red Sea Riviera": "Red Sea Riviera"
    },
    {
        ".     The popular tourist beach of Sharm el-Sheikh was closed to all swimming in December 2010 due to several serious ": null
    },
    {
        "shark attacks": "2010 Sharm El Sheikh Shark Attacks"
    },
    {
        ", including a fatality. As of December 2010, scientists are investigating the attacks and have identified, but not verified, several possible causes including over-fishing which causes large sharks to hunt closer to shore, tourist boat operators who chum offshore for shark-photo opportunities, and reports of ships throwing dead livestock overboard. The seas narrowness, significant depth, and sharp drop-offs, all combine to form a geography where large deep-water sharks can roam in hundreds of meters of water, yet be within a hundred meters of swimming areas.        Tourism to the region has been threatened by occasional terrorist attacks, and by incidents related to food safety standards.         The Red Sea may be geographically divided into three sections: the Red Sea proper, and in the north, the Gulf of Aqaba and the Gulf of Suez. The six countries bordering the Red Sea proper are:     Eastern shore:             The Gulf of Suez is entirely bordered by Egypt. The Gulf of Aqaba borders Egypt, ": null
    },
    {
        "Israel": "Israel"
    },
    {
        ", ": null
    },
    {
        "Jordan": "Jordan"
    },
    {
        " and Saudi Arabia.     In addition to the standard geographical definition of the six countries bordering the Red Sea cited above, areas such as ": null
    },
    {
        "Somalia": "Somalia"
    },
    {
        " are sometimes also described as Red Sea territories. This is primarily due to their proximity to and geological similarities with the nations facing the Red Sea and/or political ties with said areas.         Towns and cities on the Red Sea coast include:        ": null
    },
    {
        "Al Hudaydah": "Al Hudaydah"
    },
    {
        "    Al Lith": "Al Lith"
    },
    {
        "    Al Qunfudhah": "Al Qunfudhah"
    },
    {
        "    Al-Qusair": "Al-Qusayr, Egypt"
    },
    {
        "    Al Wajh": "Al Wajh"
    },
    {
        "    Aqaba": "Aqaba"
    },
    {
        "    Asseb": "Asseb"
    },
    {
        "    Dahab": "Dahab"
    },
    {
        "    Duba": "Duba, Saudi Arabia"
    },
    {
        "    Eilat": "Eilat"
    },
    {
        "    El Gouna": "El Gouna"
    },
    {
        "     El Suweis": "Suez"
    },
    {
        "   / ": null
    },
    {
        "Halaib": "Halaib"
    },
    {
        "    Haql": "Haql"
    },
    {
        "    Hirgigo": "Hirgigo"
    },
    {
        "    Hurghada": "Hurghada"
    },
    {
        "    Jeddah": "Jeddah"
    },
    {
        "    Jazan": "Jizan"
    },
    {
        "    Marsa Alam": "Marsa Alam"
    },
    {
        "    Massawa": "Massawa"
    },
    {
        "    Moulhoule": "Moulhoule"
    },
    {
        "     Nuweiba": "Nuweiba"
    },
    {
        "    Port Safaga": "Port Safaga"
    },
    {
        "    Port Sudan": "Port Sudan"
    },
    {
        "    Rabigh": "Rabigh"
    },
    {
        "    Sharm el Sheikh": "Sharm El Sheikh"
    },
    {
        "    Soma Bay": "Soma Bay"
    },
    {
        "    Suakin": "Suakin"
    },
    {
        "    Taba": "Taba"
    },
    {
        "    Thuwal": "Thuwal"
    },
    {
        "    Yanbu": "Yanbu"
    },
    {
        "   ": null
    }
]