[
    {
        "The relativist fallacy, also known as the subjectivist fallacy, is claiming that something is true for one person but not true for someone else. The fallacy is supposed to rest on the ": null
    },
    {
        "law of noncontradiction": "Law Of Noncontradiction"
    },
    {
        ". The fallacy applies only to objective facts, or what are alleged to be objective facts, rather than to facts about personal tastes or subjective experiences, and only to facts regarded in the same sense and at the same time.     There are at least two ways to interpret the relativist fallacy : either as identical to ": null
    },
    {
        "relativism": "Relativism"
    },
    {
        " , or as the ": null
    },
    {
        "ad hoc": "Ad Hoc"
    },
    {
        " adoption of a relativist stance purely to defend a controversial position.     On the one hand, discussions of the relativist fallacy that portray it as identical to relativism  are themselves committing a commonly identified fallacy of informal logic—namely, ": null
    },
    {
        "begging the question": "Logical Fallacy/Begging The Question"
    },
    {
        " against an earnest, intelligent, logically competent relativist. It is itself a fallacy to describe a controversial view as a fallacy —not, at least, without arguing that it is a fallacy. In any event, it does not do to argue as follows:   To advocate relativism, even some sophisticated relativism, is to commit the relativist fallacy.   If one commits a fallacy, one says something false or not worth serious consideration.   Therefore, to advocate relativism, even some sophisticated relativism, is to say something false or not worth serious consideration.   This is an example of ": null
    },
    {
        "circular reasoning": "Circular Reasoning"
    },
    {
        ". The second step includes an ": null
    },
    {
        "argument from fallacy": "Argument From Fallacy"
    },
    {
        ".     On the other hand, if someone adopts a simple relativist stance as an ad hoc defense of a controversial or otherwise compromised position—saying, in effect, that what is true for you is not ": null
    },
    {
        "necessarily true": "Logical Truth"
    },
    {
        " for me, and thereby attempting to avoid having to mount any further defense of the position—one might be said to have committed a fallacy. The accusation of having committed a fallacy might rest on either of two grounds: the relativism on which the bogus defense rests is so simple and meritless that it straightforwardly contradicts the ": null
    },
    {
        "Law of Non-Contradiction": "Law Of Non-Contradiction"
    },
    {
        "; or the defense is an example of ad hoc reasoning. It puts one in the position of asserting or implying that truth or standards of logical consistency are relative to a particular thinker or group and that under some other standard, the position is correct despite its failure to stand up to logic.     Determining whether someone has committed a relativist fallacy—by any interpretation—requires distinguishing between things that are true for a particular person, and things that are true about that person. Take, for example, the statement proffered by Jim, More Americans than ever are overweight. One may introduce arguments for and against this proposition, based upon such things as standards of statistical analysis, the definition of overweight, etc. The position answers to objective logical debate. If Joe answers Jim, saying That may be true for you, but it is not true for me, he has given an answer that is fallacious as well as somewhat meaningless in the context of Jims original statement.     Conversely, take the new statement by Jim, who is  tall,  is grossly overweight. Joe, who is , and weighs an exact, well-conditioned , replies, That may be true for you, but it is not true for me. In this context, Joes reply is both meaningful and arguably accurate. As he is discussing something that is true about": null
    }
]