[
    {
        "        Rennet  is a complex set of ": null
    },
    {
        "enzymes": "Enzyme"
    },
    {
        " produced in the ": null
    },
    {
        "stomachs": "Stomach"
    },
    {
        " of ": null
    },
    {
        "ruminant": "Ruminant"
    },
    {
        "mammals": "Mammal"
    },
    {
        ". ": null
    },
    {
        "Chymosin": "Chymosin"
    },
    {
        ", its key component, is a ": null
    },
    {
        "protease enzyme": "Protease"
    },
    {
        " that ": null
    },
    {
        "curdles": "Curdling"
    },
    {
        " the ": null
    },
    {
        "casein": "Casein"
    },
    {
        " in ": null
    },
    {
        "milk": "Milk"
    },
    {
        ". In addition to chymosin, rennet contains other enzymes, such as ": null
    },
    {
        "pepsin": "Pepsin"
    },
    {
        " and a ": null
    },
    {
        "lipase": "Lipase"
    },
    {
        ".     Rennet is used to separate milk into solid ": null
    },
    {
        "curds": "Curds"
    },
    {
        "  and liquid ": null
    },
    {
        "whey": "Whey"
    },
    {
        ", and so is used in the production of most ": null
    },
    {
        "cheeses": "Cheese"
    },
    {
        ".       One of the main actions of rennet is its ": null
    },
    {
        "protease": "Protease"
    },
    {
        " chymosin": "Chymosin"
    },
    {
        " cleaving the kappa ": null
    },
    {
        "casein": "Casein"
    },
    {
        " chain.  Casein is the main protein of ": null
    },
    {
        "milk": "Milkproteins"
    },
    {
        ". Cleavage causes casein to stick to other cleaved casein molecules and form a network. It can cluster better in the presence of calcium and phosphate, which is why it is occasionally added in cheese making especially from calcium phosphate-poor goat milk. The solid truncated casein protein network traps other components of milk, such as fats and minerals, to create cheese.       ": null
    },
    {
        "Calf": "Calf"
    },
    {
        " rennet is extracted from the inner ": null
    },
    {
        "mucosa": "Mucosa"
    },
    {
        " of the fourth stomach chamber  of young, nursing calves as part of livestock butchering. These stomachs are a ": null
    },
    {
        "byproduct": "Byproduct"
    },
    {
        " of ": null
    },
    {
        "veal": "Veal"
    },
    {
        " production.  If rennet is extracted from older calves , the rennet contains less or no ": null
    },
    {
        "chymosin": "Chymosin"
    },
    {
        ", but a high level of ": null
    },
    {
        "pepsin": "Pepsin"
    },
    {
        " and can only be used for special types of milk and cheeses. As each ruminant produces a special kind of rennet to digest the milk of its own ": null
    },
    {
        "species": "Species"
    },
    {
        ", milk-specific rennets are available, such as kid goat rennet for ": null
    },
    {
        "goats": "Goat"
    },
    {
        " milk and ": null
    },
    {
        "lamb": "Domestic Sheep"
    },
    {
        " rennet for ": null
    },
    {
        "sheeps": "Sheep"
    },
    {
        " milk.       Dried and cleaned stomachs of young calves are sliced into small pieces and then put into salt water or ": null
    },
    {
        "whey": "Whey"
    },
    {
        ", together with some ": null
    },
    {
        "vinegar": "Vinegar"
    },
    {
        " or ": null
    },
    {
        "wine": "Wine"
    },
    {
        " to lower the ": null
    },
    {
        "pH": "Ph"
    },
    {
        " of the solution. After some time , the solution is filtered. The crude rennet that remains in the filtered solution can then be used to coagulate milk. About 1  g of this solution can normally coagulate 2 to 4 ": null
    },
    {
        "L": "Litre"
    },
    {
        " of milk.       Deep-frozen stomachs are milled and put into an enzyme-extracting solution. The crude rennet extract is then activated by adding acid; the enzymes in the stomach are produced in an ": null
    },
    {
        "inactive form": "Zymogen"
    },
    {
        " and are activated by the ": null
    },
    {
        "stomach acid": "Stomach Acid"
    },
    {
        ". The acid is then ": null
    },
    {
        "neutralized": "Neutralization"
    },
    {
        " and the rennet extract is filtered in several stages and concentrated until reaching a typical potency of about 1:15,000; meaning 1  g of extract can coagulate 15  kg of milk.     One kg of rennet extract has about 0.7 g of active enzymes – the rest is water and salt and sometimes ": null
    },
    {
        "sodium benzoate": "Sodium Benzoate"
    },
    {
        " ,   0.5% - 1.0% for preservation. Typically, 1  kg of cheese contains about 0.0003 g of rennet enzymes.       Because of the limited availability of mammalian stomachs for rennet production, cheese makers have sought other ways to coagulate milk since at least ": null
    },
    {
        "Roman": "Ancient Rome"
    },
    {
        " times. The many sources of enzymes that can be a substitute for animal rennet range from plants and fungi to microbial sources.  Cheeses produced from any of these varieties of rennet are suitable for ": null
    },
    {
        "lactovegetarians": "Lacto Vegetarianism"
    },
    {
        ". Fermentation-produced chymosin is used more often in industrial cheesemaking in North America and Europe today because it is less expensive than animal rennet.          Many plants have coagulating properties. ": null
    },
    {
        "Homer": "Homer"
    },
    {
        " suggests in the  Iliad  that the Greeks used an extract of ": null
    },
    {
        "fig": "Ficus"
    },
    {
        " juice to coagulate milk.  Other examples include several species of ": null
    },
    {
        "Galium": "Galium"
    },
    {
        ", ": null
    },
    {
        "dried caper leaves": "Caper"
    },
    {
        ", Mike, Tad, Capers: The Flower Inside , Epikouria Magazine, Fall/Winter 2006 ": null
    },
    {
        "nettles": "Urtica"
    },
    {
        ", ": null
    },
    {
        "thistles": "Thistle"
    },
    {
        ", ": null
    },
    {
        "mallow": "Malva"
    },
    {
        ", and ": null
    },
    {
        "ground ivy": "Glechoma Hederacea"
    },
    {
        ". Enzymes from thistle or  Cynara  are used in some traditional cheese production in the ": null
    },
    {
        "Mediterranean": "Mediterranean"
    },
    {
        ". Phytic acid, derived from unfermented ": null
    },
    {
        "soy": "Soy"
    },
    {
        "beans, or fermentation-produced chymosin may also be used.     ": null
    },
    {
        "Vegetable": "Vegetable"
    },
    {
        " rennet might be used in the production of ": null
    },
    {
        "kosher": "Kosher Foods"
    },
    {
        " and ": null
    },
    {
        "halal": "Halal"
    },
    {
        " cheeses, but nearly all kosher cheeses are produced with either microbial rennet or FPC. Commercial so-called vegetable rennets usually contain an extract from the ": null
    },
    {
        "mold": "Mold"
    },
    {
        "  Rhizomucor miehei .         Some molds such as  Rhizomucor miehei  are able to produce proteolytic enzymes. These molds are produced in a ": null
    },
    {
        "fermenter": "Fermenter"
    },
    {
        " and then specially concentrated and purified to avoid contamination with unpleasant byproducts of the mold growth.     The traditional view is that these coagulants result in bitterness and low yield in cheese, especially when aged for a long time. Over the years, microbial coagulants have improved a lot, largely due to the characterization and purification of secondary enzymes responsible for bitter peptide formation/non-specific proteolytic breakdown in cheese aged for long periods. Consequently, it has become possible to produce several high-quality cheeses with microbial rennet.      Cheeses produced this way are suitable for ": null
    },
    {
        "vegetarians": "Vegetarian"
    },
    {
        ", provided no animal-based alimentation was used during the production.         Because of the above imperfections of microbial and animal rennets, many producers sought other replacements of rennet. With genetic engineering it became possible to isolate rennet genes from animals and introduce them into certain ": null
    },
    {
        "bacteria": "Bacteria"
    },
    {
        ", ": null
    },
    {
        "fungi": "Fungi"
    },
    {
        ", or ": null
    },
    {
        "yeasts": "Yeasts"
    },
    {
        " to make them produce chymosin during fermentation. The genetically modified microorganism is killed after fermentation and chymosin isolated from the fermentation broth, so that the fermentation-produced chymosin used by cheese producers does not contain a GMO or any GMO DNA. FPC is identical to chymosin made by an animal, but is produced in a more efficient way. FPC products have been on the market since 1990 and, because the quantity needed per unit of milk can be standardized, are commercially viable alternatives to crude animal or plant rennets, as well as generally preferred to them.      Originally created by biotechnology company ": null
    },
    {
        "Pfizer": "Pfizer"
    },
    {
        ", FPC was the first artificially-produced enzyme to be registered and allowed by the ": null
    },
    {
        "US Food and Drug Administration": "Us Food And Drug Administration"
    },
    {
        ".  Staff, National Centre for Biotechnology Education, 2006.  In 1999, about 60% of US ": null
    },
    {
        "hard cheeses": "Hard Cheese"
    },
    {
        " were made with FPC,  and it has up to 80% of the global market share for rennet. E. Johnson, J. A. Lucey  J. Dairy Sci. 89: 1174–1178     The most widely used FPC is produced either by the fungus  Aspergillus niger  and commercialized under the trademark CHY-MAX  by the Danish company ": null
    },
    {
        "Chr. Hansen": "Chr. Hansen"
    },
    {
        ", or produced by  Kluyveromyces lactis  and commercialized under the trademark MAXIREN  by the Dutch company DSM.     FPC is chymosin B, so is more pure than animal rennet, which contains a multitude of proteins. FPC can provide several benefits to the cheese producer compared with animal or microbial rennet, such as higher production yield, better curd texture, and reduced bitterness.     Cheeses produced with FPC can be certified kosher   and halal, and are suitable for vegetarians if no animal-based alimentation was used during the chymosin production in the fermenter.         Many soft cheeses are produced without use of rennet, by coagulating milk with acid, such as ": null
    },
    {
        "citric acid": "Citric Acid"
    },
    {
        " or ": null
    },
    {
        "vinegar": "Vinegar"
    },
    {
        ", or the ": null
    },
    {
        "lactic acid": "Lactic Acid"
    },
    {
        " produced by ": null
    },
    {
        "soured milk": "Soured Milk"
    },
    {
        ". ": null
    },
    {
        "Cream cheese": "Cream Cheese"
    },
    {
        ", ": null
    },
    {
        "paneer": "Paneer"
    },
    {
        ", and ": null
    },
    {
        "rubing": "Rubing"
    },
    {
        " are traditionally made this way .   The acidification can also come from bacterial fermentation such as in ": null
    },
    {
        "cultured milk": "Cultured Milk"
    },
    {
        ".     ": null
    },
    {
        "Vegan alternatives to cheese": "Vegan Cheese"
    },
    {
        " are manufactured without using animal milk but instead use soy, wheat, rice or cashew. These can be coagulated with acid using sources such as vinegar or lemon juice.    ": null
    }
]