[
    {
        "In ": null
    },
    {
        "molecular biology": "Molecular Biology"
    },
    {
        ", restriction fragment length polymorphism  is a technique that exploits variations in ": null
    },
    {
        "homologous": "Homology"
    },
    {
        " DNA": "Dna"
    },
    {
        " sequences, known as ": null
    },
    {
        "polymorphisms": "Polymorphism"
    },
    {
        ", in order to distinguish individuals, populations, or species or to pinpoint the locations of ": null
    },
    {
        "genes": "Gene"
    },
    {
        " within a sequence.The term may refer to a polymorphism itself, as detected through the differing locations of ": null
    },
    {
        "restriction enzyme sites": "Restriction Site"
    },
    {
        ", or to a related laboratory technique by which such differences can be illustrated. In RFLP analysis, a DNA sample is digested into fragments by one or more ": null
    },
    {
        "restriction enzymes": "Restriction Enzyme"
    },
    {
        ", and the resulting restriction fragments are then separated by ": null
    },
    {
        "gel electrophoresis": "Gel Electrophoresis"
    },
    {
        " according to their size.     Although now largely obsolete due to the emergence of inexpensive ": null
    },
    {
        "DNA sequencing": "Dna Sequencing"
    },
    {
        " technologies, RFLP analysis was the first ": null
    },
    {
        "DNA profiling": "Dna Profiling"
    },
    {
        " technique inexpensive enough to see widespread application. RFLP analysis was an important early tool in ": null
    },
    {
        "genome mapping": "Genome Mapping"
    },
    {
        ", localization of genes for ": null
    },
    {
        "genetic disorders": "Genetic Disorder"
    },
    {
        ", determination of ": null
    },
    {
        "risk": "Genetic Testing"
    },
    {
        " for disease, and ": null
    },
    {
        "paternity testing": "Dna Paternity Testing"
    },
    {
        ".         The basic technique for the detection of RFLPs involves fragmenting a sample of DNA with the application of a ": null
    },
    {
        "restriction enzyme": "Restriction Enzyme"
    },
    {
        ", which can selectively cleave a DNA molecule wherever a short, ": null
    },
    {
        "specific": "Recognition Sequence"
    },
    {
        " sequence": "Nucleic Acid Sequence"
    },
    {
        " is recognized in a process known as a ": null
    },
    {
        "restriction digest": "Restriction Digest"
    },
    {
        ". The DNA fragments produced by the digest are then separated by length through a process known as ": null
    },
    {
        "agarose gel electrophoresis": "Agarose Gel Electrophoresis"
    },
    {
        " and transferred to a membrane via the ": null
    },
    {
        "Southern blot": "Southern Blot"
    },
    {
        " procedure. ": null
    },
    {
        "Hybridization": "Nucleic Acid Hybridization"
    },
    {
        " of the membrane to a labeled ": null
    },
    {
        "DNA probe": "Hybridization Probe"
    },
    {
        " then determines the length of the fragments which are ": null
    },
    {
        "complementary": "Complementarity"
    },
    {
        " to the probe. A restriction fragment length polymorphism is said to occur when the length of a detected fragment varies between individuals, indicating non-identical sequence homologies. Each fragment length is considered an ": null
    },
    {
        "allele": "Allele"
    },
    {
        ", whether it actually contains a ": null
    },
    {
        "coding region": "Coding Dna"
    },
    {
        " or not, and can be used in subsequent genetic analysis.                  There are two common mechanisms by which the size of a particular restriction fragment can vary. In the first schematic, a small segment of the ": null
    },
    {
        "genome": "Genome"
    },
    {
        " is being detected by a DNA probe . In allele A, the genome is cleaved by a restriction enzyme at three nearby sites , but only the rightmost fragment will be detected by the probe. In allele a, restriction site 2 has been lost by a ": null
    },
    {
        "mutation": "Mutation"
    },
    {
        ", so the probe now detects the larger fused fragment running from sites 1 to 3. The second diagram shows how this fragment size variation would look on a Southern blot, and how each allele might be inherited in members of a family.     In the third schematic, the probe and restriction enzyme are chosen to detect a region of the genome that includes a ": null
    },
    {
        "variable number tandem repeat": "Variable Number Tandem Repeat"
    },
    {
        " segment . In allele c, there are five repeats in the VNTR, and the probe detects a longer fragment between the two restriction sites. In allele d, there are only two repeats in the VNTR, so the probe detects a shorter fragment between the same two restriction sites. Other genetic processes, such as ": null
    },
    {
        "insertions": "Genetic Insertion"
    },
    {
        ", ": null
    },
    {
        "deletions": "Genetic Deletion"
    },
    {
        ", ": null
    },
    {
        "translocations": "Chromosomal Translocation"
    },
    {
        ", and ": null
    },
    {
        "inversions": "Chromosomal Inversion"
    },
    {
        ", can also lead to polymorphisms. RFLP tests require much larger samples of DNA than do ": null
    },
    {
        "short tandem repeat": "Short Tandem Repeat"
    },
    {
        " tests.         Analysis of RFLP variation in genomes was formerly a vital tool in genome mapping and genetic disease analysis. If researchers were trying to initially determine the chromosomal location of a particular disease gene, they would analyze the DNA of members of a family afflicted by the disease, and look for RFLP alleles that show a similar pattern of inheritance as that of the disease . Once a disease gene was localized, RFLP analysis of other families could reveal who was at risk for the disease, or who was likely to be a ": null
    },
    {
        "carrier": "Genetic Carrier"
    },
    {
        " of the mutant genes. RFLP test is used in identification and differentiation of organisms by analyzing unique patterns in genome. It is also used in identification of recombination rate in the loci between restriction sites.     RFLP analysis was also the basis for early methods of ": null
    },
    {
        "genetic fingerprinting": "Genetic Fingerprinting"
    },
    {
        ", useful in the identification of samples retrieved from ": null
    },
    {
        "crime": "Forensic"
    },
    {
        " scenes, in the determination of ": null
    },
    {
        "paternity": "Dna Paternity Testing"
    },
    {
        ", and in the characterization of ": null
    },
    {
        "genetic diversity": "Genetic Diversity"
    },
    {
        " or breeding patterns in animal populations.         The technique for RFLP analysis is, however, slow and cumbersome. It requires a large amount of sample DNA, and the combined process of probe labeling, DNA fragmentation, electrophoresis, blotting, hybridization, washing, and ": null
    },
    {
        "autoradiography": "Autoradiography"
    },
    {
        " can take up to a month to complete. A limited version of the RFLP method that used ": null
    },
    {
        "oligonucleotide probes": "Oligomer Restriction"
    },
    {
        " was reported in 1985.  The results of the ": null
    },
    {
        "Human Genome Project": "Human Genome Project"
    },
    {
        " have largely replaced the need for RFLP mapping, and the identification of many ": null
    },
    {
        "single-nucleotide polymorphisms": "Single-Nucleotide Polymorphism"
    },
    {
        " in that project has replaced the need for RFLP disease linkage analysis . The analysis of VNTR alleles continues, but is now usually performed by ": null
    },
    {
        "polymerase chain reaction": "Polymerase Chain Reaction"
    },
    {
        " methods. For example, the standard ": null
    },
    {
        "protocols": "National Dna Database"
    },
    {
        " for ": null
    },
    {
        "DNA fingerprinting": "Dna Fingerprinting"
    },
    {
        " involve PCR analysis of ": null
    },
    {
        "panels": "Codis"
    },
    {
        " of more than a dozen VNTRs.     RFLP is still used in marker-assisted selection. Terminal restriction fragment length polymorphism is a technique initially developed for characterizing bacterial communities in mixed-species samples. The technique has also been applied to other groups including soil fungi. TRFLP works by PCR amplification of DNA using primer pairs that have been labeled with fluorescent tags. The PCR products are then digested using RFLP enzymes and the resulting patterns visualized using a DNA sequencer. The results are analyzed either by simply counting and comparing bands or peaks in the TRFLP profile, or by matching bands from one or more TRFLP runs to a database of known species. The technique is similar in some aspects to ": null
    },
    {
        "temperature gradient": "Temperature Gradient Gel Electrophoresis"
    },
    {
        " or ": null
    },
    {
        "denaturing gradient gel electrophoresis": "Denaturing Gradient Gel Electrophoresis"
    },
    {
        " .     The sequence changes directly involved with an RFLP can also be analyzed more quickly by PCR. Amplification can be directed across the altered restriction site, and the products digested with the restriction enzyme. This method has been called ": null
    },
    {
        "Cleaved Amplified Polymorphic Sequence": "Cleaved Amplified Polymorphic Sequence"
    },
    {
        " . Alternatively, the amplified segment can be analyzed by ": null
    },
    {
        "allele-specific oligonucleotide": "Allele-Specific Oligonucleotide"
    },
    {
        " probes, a process that can often be done by a simple ": null
    },
    {
        "dot blot": "Dot Blot"
    }
]