[
    {
        "        Roman law is the ": null
    },
    {
        "legal": "Law"
    },
    {
        " system of ": null
    },
    {
        "ancient Rome": "Ancient Rome"
    },
    {
        ", including the legal developments spanning over a thousand years of ": null
    },
    {
        "jurisprudence": "Jurisprudence"
    },
    {
        ", from the ": null
    },
    {
        "Twelve Tables": "Twelve Tables"
    },
    {
        " , to the  Corpus Juris Civilis  ordered by Eastern Roman Emperor ": null
    },
    {
        "Justinian I": "Justinian I"
    },
    {
        ". Roman law forms the basic framework for ": null
    },
    {
        "civil law": "Civil Law"
    },
    {
        ", the most widely used legal system today, and the terms are sometimes used synonymously. The historical importance of Roman law is reflected by the continued use of ": null
    },
    {
        "Latin legal terminology": "List Of Legal Latin Terms"
    },
    {
        " in many legal systems influenced by it, including ": null
    },
    {
        "common law": "Common Law"
    },
    {
        ".     After the dissolution of the ": null
    },
    {
        "Western Roman Empire": "Western Roman Empire"
    },
    {
        ", the Roman law remained in effect in the ": null
    },
    {
        "Eastern Roman Empire": "Eastern Roman Empire"
    },
    {
        ". From the 7th century onward, the legal language in the East was Greek.     Roman law also denoted the legal system applied in most of ": null
    },
    {
        "Western Europe": "Western Europe"
    },
    {
        " until the end of the 18th century. In ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", Roman law practice remained in place longer under the ": null
    },
    {
        "Holy Roman Empire": "Holy Roman Empire"
    },
    {
        " . Roman law thus served as a basis for ": null
    },
    {
        "legal practice": "Civil Law"
    },
    {
        " throughout Western continental Europe, as well as in most former colonies of these European nations, including Latin America, and also in Ethiopia. English and ": null
    },
    {
        "Anglo-America": "Anglo-America"
    },
    {
        "n ": null
    },
    {
        "common law": "Common Law"
    },
    {
        " were influenced also by Roman law, notably in their Latinate legal glossary . In Germany, Art. 311 BGB Eastern Europe was also influenced by the jurisprudence of the Corpus Juris Civilis, especially in countries such as medieval Romania which created a new system, a mixture of Roman and local law. Also, Eastern European law was influenced by the ": null
    },
    {
        "Farmers Law": "Farmers Law"
    },
    {
        " of the ": null
    },
    {
        "medieval Byzantine legal system": "Byzantine Law"
    },
    {
        ".       Before the ": null
    },
    {
        "Twelve Tables": "Twelve Tables"
    },
    {
        " , private law comprised the Roman civil law  that applied only to Roman citizens, and was bonded to religion; undeveloped, with attributes of strict formalism, symbolism, and conservatism, e.g. the ritual practice of ": null
    },
    {
        "mancipatio": "Mancipatio"
    },
    {
        " . The jurist ": null
    },
    {
        "Sextus Pomponius": "Sextus Pomponius"
    },
    {
        " said, At the beginning of our city, the people began their first activities without any fixed law, and without any fixed rights: all things were ruled despotically, by kings .  It is believed that Roman Law is rooted in the ": null
    },
    {
        "Etruscan religion": "Etruscan Mythology"
    },
    {
        ", emphasizing ritual. ": null
    },
    {
        "Jenő Szmodis": "Jenő Szmodis"
    },
    {
        "The Reality of the Law – From the Etruscan Religion to the Postmodern Theories of Law; Ed. Kairosz, Budapest, 2005.; .          The first legal text is the ": null
    },
    {
        "Law of the Twelve Tables": "Twelve Tables"
    },
    {
        ", dating from the mid-5th century BC. The ": null
    },
    {
        "plebeian": "Plebeian"
    },
    {
        " tribune, C. Terentilius Arsa, proposed that the law should be written, in order to prevent magistrates from applying the law arbitrarily. A Short History of Roman Law , Olga Tellegen-Couperus pp. 19–20. After eight years of political struggle, the plebeian social class convinced the ": null
    },
    {
        "patricians": "Patrician"
    },
    {
        " to send a delegation to ": null
    },
    {
        "Athens": "Athens"
    },
    {
        ", to copy the ": null
    },
    {
        "Laws of Solon": "Solonian Constitution"
    },
    {
        "; they also dispatched delegations to other Greek cities for like reason. In 451 BC, according to the traditional story , ten Roman citizens were chosen to record the laws . While they were performing this task, they were given supreme political power , whereas the power of the magistrates was restricted. In 450 BC, the decemviri produced the laws on ten tablets , but these laws were regarded as unsatisfactory by the plebeians. A second decemvirate is said to have added two further tablets in 449 BC. The new Law of the Twelve Tables was approved by the peoples assembly.     Modern scholars tend to challenge the accuracy of Roman historians. They generally do not believe that a second decemvirate ever took place. The decemvirate of 451 is believed to have included the most controversial points of customary law, and to have assumed the leading functions in Rome. Furthermore, the question on the Greek influence found in the early Roman Law is still much discussed. Many scholars consider it unlikely that the patricians sent an official delegation to Greece, as the Roman historians believed. Instead, those scholars suggest, the Romans acquired Greek legislations from the Greek cities of ": null
    },
    {
        "Magna Graecia": "Magna Graecia"
    },
    {
        ", the main portal between the Roman and Greek worlds. The original text of the Twelve Tables has not been preserved. The tablets were probably destroyed when Rome was conquered and burned by the ": null
    },
    {
        "Gauls": "Gauls"
    },
    {
        " in 387 BC.     The fragments which did survive show that it was not a law code in the modern sense. It did not provide a complete and coherent system of all applicable rules or give legal solutions for all possible cases. Rather, the tables contained specific provisions designed to change the then-existing ": null
    },
    {
        "customary law": "Customary Law"
    },
    {
        ". Although the provisions pertain to all areas of law, the largest part is dedicated to ": null
    },
    {
        "private law": "Private Law"
    },
    {
        " and ": null
    },
    {
        "civil procedure": "Civil Procedure"
    },
    {
        ".          Many laws include  Lex Canuleia  ,  Leges Licinae Sextiae  ,  Lex Ogulnia  , and  Lex Hortensia  .     Another important statute from the Republican era is the  Lex Aquilia  of 286 BC, which may be regarded as the root of modern ": null
    },
    {
        "tort law": "Tort Law"
    },
    {
        ". However, Romes most important contribution to European legal culture was not the enactment of well-drafted statutes, but the emergence of a class of professional ": null
    },
    {
        "jurists": "Jurist"
    },
    {
        "  and of a legal science. This was achieved in a gradual process of applying the scientific methods of ": null
    },
    {
        "Greek philosophy": "Greek Philosophy"
    },
    {
        " to the subject of law, a subject which the Greeks themselves never treated as a science.     Traditionally, the origins of Roman legal science are connected to ": null
    },
    {
        "Gnaeus Flavius": "Gnaeus Flavius"
    },
    {
        ". Flavius is said to have published around the year 300 BC the formularies containing the words which had to be spoken in court to begin a legal action. Before the time of Flavius, these formularies are said to have been secret and known only to the priests. Their publication made it possible for non-priests to explore the meaning of these legal texts. Whether or not this story is credible, jurists were active and legal treatises were written in larger numbers before the 2nd century BC. Among the famous jurists of the republican period are ": null
    },
    {
        "Quintus Mucius Scaevola": "Quintus Mucius Scaevola Pontifex"
    },
    {
        " who wrote a voluminous treatise on all aspects of the law, which was very influential in later times, and ": null
    },
    {
        "Servius Sulpicius Rufus": "Servius Sulpicius Rufus"
    },
    {
        ", a friend of ": null
    },
    {
        "Marcus Tullius Cicero": "Marcus Tullius Cicero"
    },
    {
        ". Thus, Rome had developed a very sophisticated legal system and a refined legal culture when the Roman republic was replaced by the monarchical system of the ": null
    },
    {
        "principate": "Principate"
    },
    {
        " in 27 BC.       In the period between about 201 to 27 BC, we can see the development of more flexible laws to match the needs of the time. In addition to the old and formal ius civile a new juridical class is created: the  ius honorarium , which can be defined as The law introduced by the magistrates who had the right to promulgate edicts in order to support, supplement or correct the existing law.  With this new law the old formalism is being abandoned and new more flexible principles of  ius gentium  are used.     The adaptation of law to new needs was given over to juridical practice, to ": null
    },
    {
        "magistrates": "Roman Magistrate"
    },
    {
        ", and especially to the ": null
    },
    {
        "praetors": "Praetor"
    },
    {
        ". A praetor was not a legislator and did not technically create new law when he issued his edicts . In fact, the results of his rulings enjoyed legal protection  and were in effect often the source of new legal rules. A Praetors successor was not bound by the edicts of his predecessor; however, he did take rules from edicts of his predecessor that had proved to be useful. In this way a constant content was created that proceeded from edict to edict .     Thus, over the course of time, parallel to the civil law and supplementing and correcting it, a new body of praetoric law emerged. In fact, praetoric law was so defined by the famous Roman jurist Papinian : Ius praetorium est quod praetores introduxerunt adiuvandi vel supplendi vel corrigendi iuris civilis gratia propter utilitatem publicam . Ultimately, civil law and praetoric law were fused in the  Corpus Juris Civilis .          The first 250 years of the current era are the period during which Roman law and Roman legal science reached its greatest degree of sophistication. The law of this period is often referred to as the classical period of Roman law. The literary and practical achievements of the jurists of this period gave Roman law its unique shape.     The jurists worked in different functions: They gave legal opinions at the request of private parties. They advised the magistrates who were entrusted with the administration of justice, most importantly the praetors. They helped the praetors draft their ": null
    },
    {
        "edicts": "Edict"
    },
    {
        ", in which they publicly announced at the beginning of their tenure, how they would handle their duties, and the formularies, according to which specific proceedings were conducted. Some jurists also held high judicial and administrative offices themselves.     The jurists also produced all kinds of legal punishments. Around AD 130 the jurist ": null
    },
    {
        "Salvius Iulianus": "Salvius Iulianus"
    },
    {
        " drafted a standard form of the praetors edict, which was used by all praetors from that time onwards. This edict contained detailed descriptions of all cases, in which the praetor would allow a legal action and in which he would grant a defense. The standard edict thus functioned like a comprehensive law code, even though it did not formally have the force of law. It indicated the requirements for a successful legal claim. The edict therefore became the basis for extensive legal commentaries by later classical jurists like ": null
    },
    {
        "Paulus": "Paul"
    },
    {
        " and ": null
    },
    {
        "Ulpian": "Ulpian"
    },
    {
        ". The new concepts and legal institutions developed by pre-classical and classical jurists are too numerous to mention here. Only a few examples are given here:   Roman jurists clearly separated the legal right to use a thing from the factual ability to use and manipulate the thing . They also established the distinction between contract and tort as sources of legal obligations.   The standard types of contract regulated in most continental codes and the characteristics of each of these contracts were developed by Roman jurisprudence.   The classical jurist ": null
    },
    {
        "Gaius": "Gaius"
    },
    {
        " invented a system of private law based on the division of all material into personae , res and actiones . This system was used for many centuries. It can be recognized in legal treatises like ": null
    },
    {
        "William Blackstones": "William Blackstone"
    },
    {
        " Commentaries on the Laws of England and enactments like the ": null
    },
    {
        "French": "France"
    },
    {
        " Code civil": "Napoleonic Code"
    },
    {
        " or the ": null
    },
    {
        "German": "Germany"
    },
    {
        " BGB": "Bürgerliches Gesetzbuch"
    },
    {
        ".     The Roman Republic had three different branches:     ": null
    },
    {
        "Assemblies": "Legislative Assemblies Of The Roman Republic"
    },
    {
        " Senate": "Senate"
    },
    {
        " Consuls": "Roman Consul"
    },
    {
        "     The Assemblies could decide whether war or peace. The Senate had complete control over the Treasury, and the Consuls had the highest juridical power.        By the middle of the 3rd century, the conditions for the flourishing of a refined legal culture had become less favourable. The general political and economic situation deteriorated as the emperors assumed more direct control of all aspects of political life. The political system of the ": null
    },
    {
        "principate": "Principate"
    },
    {
        ", which had retained some features of the republican constitution, began to transform itself into the absolute monarchy of the ": null
    },
    {
        "dominate": "Dominate"
    },
    {
        ". The existence of a legal science and of jurists who regarded law as a science, not as an instrument to achieve the political goals set by the absolute monarch, did not fit well into the new order of things. The literary production all but ended. Few jurists after the mid-3rd century are known by name. While legal science and legal education persisted to some extent in the eastern part of the Empire, most of the subtleties of classical law came to be disregarded and finally forgotten in the west. Classical law was replaced by so-called ": null
    },
    {
        "vulgar law": "Vulgar Law"
    },
    {
        ".            ius civile , ius gentium , and ius naturale  – the ius civile  was the body of common laws that applied to Roman citizens and the ": null
    },
    {
        "Praetores Urbani": "Praetorpraetor Urbanus"
    },
    {
        ", the individuals who had jurisdiction over cases involving citizens. The ius gentium was the body of common laws that applied to foreigners, and their dealings with Roman citizens. The ": null
    },
    {
        "Praetores Peregrini": "Praetorpraetor Peregrinus"
    },
    {
        " were the individuals who had jurisdiction over cases involving citizens and foreigners. Jus naturale was a concept the jurists developed to explain why all people seemed to obey some laws. Their answer was that a ": null
    },
    {
        "natural law": "Natural Law"
    },
    {
        " instilled in all beings a common sense.    ius scriptum and ius non-scriptum  – meaning written and unwritten law, respectively. In practice, the two differed by the means of their creation and not necessarily whether or not they were written down. The ius scriptum was the body of statute laws made by the legislature. The laws were known as leges and plebiscita . Roman lawyers would also include in the ius scriptum the edicts of magistrates , the advice of the Senate , the responses and thoughts of jurists , and the proclamations and beliefs of the emperor . Ius non-scriptum was the body of common laws that arose from customary practice and had become binding over time.    ius commune and ius singulare  – Ius singulare is special law for certain groups of people, things, or legal relations , unlike general, ordinary, law . An example of this is the law about wills written by people in the military during a campaign, which are exempt of the solemnities generally required for citizens when writing wills in normal circumstances.    ius publicum and ius privatum  – ius publicum means public law and ius privatum means private law, where public law is to protect the interests of the Roman state while private law should protect individuals. In the Roman law ius privatum included personal, property, civil and criminal law; judicial proceeding was private process ; and crimes were private . Public law will only include some areas of private law close to the end of the Roman state. Ius publicum was also used to describe obligatory legal regulations . These are regulations that cannot be changed or excluded by party agreement. Those regulations that can be changed are called today ius dispositivum, and they are not used when party shares something and are in contrary.             The Roman Republics constitution or  mos maiorum  was an unwritten set of guidelines and principles passed down mainly through precedent. Concepts that originated in the Roman constitution live on in constitutions to this day. Examples include ": null
    },
    {
        "checks and balances": "Separation Of Powerschecksandbalances"
    },
    {
        ", ": null
    },
    {
        "the separation of powers": "Separation Of Powers"
    },
    {
        ", ": null
    },
    {
        "veto": "Veto"
    },
    {
        "es, ": null
    },
    {
        "filibusters": "Filibuster"
    },
    {
        ", ": null
    },
    {
        "quorum": "Quorum"
    },
    {
        " requirements, ": null
    },
    {
        "term limits": "Term Limits"
    },
    {
        ", ": null
    },
    {
        "impeachments": "Impeachment"
    },
    {
        ", ": null
    },
    {
        "the powers of the purse": "Power Of The Purse"
    },
    {
        ", and regularly scheduled ": null
    },
    {
        "elections": "Elections"
    },
    {
        ". Even some lesser used modern constitutional concepts, such as the block voting found in the ": null
    },
    {
        "electoral college": "Electoral College"
    },
    {
        " of the ": null
    },
    {
        "United States": "United States"
    },
    {
        ", originate from ideas found in the Roman constitution.     The constitution of the ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        " was not formal or even official. Its constitution was largely unwritten, and was constantly evolving throughout the life of the Republic. Throughout the 1st century BC, the power and legitimacy of the Roman constitution was progressively eroding. Even Roman constitutionalists, such as the ": null
    },
    {
        "senator": "Roman Senate"
    },
    {
        " Cicero": "Cicero"
    },
    {
        ", lost a willingness to remain faithful to it towards the end of the republic. When the ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        " ultimately ": null
    },
    {
        "fell": "Augustusfirst Settlement"
    },
    {
        " in the years following the ": null
    },
    {
        "Battle of Actium": "Battle Of Actium"
    },
    {
        " and ": null
    },
    {
        "Mark Antonys": "Mark Antony"
    },
    {
        " suicide, what was left of the Roman constitution died along with the Republic. The first ": null
    },
    {
        "Roman Emperor": "Roman Emperor"
    },
    {
        ", ": null
    },
    {
        "Augustus": "Augustus"
    },
    {
        ", attempted to manufacture the appearance of a constitution that still governed the Empire, by utilising that constitutions institutions to lend legitimacy to the ": null
    },
    {
        "Principate": "Principate"
    },
    {
        ", e.g. reusing prior grants of greater imperium to substantiate Augustus greater imperium over the Imperial provinces and the prorogation of different magistracies to justify Augustus receipt of tribunician power. The belief in a surviving constitution lasted well into the life of the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        ".          Stipulatio was the basic form of ": null
    },
    {
        "contract": "Contract"
    },
    {
        " in Roman law. It was made in the format of question and answer. The precise nature of the contract was disputed, as can be seen below.     Rei vindicatio is a legal action by which the ": null
    },
    {
        "plaintiff": "Plaintiff"
    },
    {
        " demands that the ": null
    },
    {
        "defendant": "Defendant"
    },
    {
        " return a thing that belongs to the plaintiff. It may only be used when plaintiff owns the thing, and the defendant is somehow impeding the plaintiffs possession of the thing. The ": null
    },
    {
        "plaintiff": "Plaintiff"
    },
    {
        " could also institute an actio furti to punish the ": null
    },
    {
        "defendant": "Defendant"
    },
    {
        ". If the thing could not be recovered, the ": null
    },
    {
        "plaintiff": "Plaintiff"
    },
    {
        " could claim damages from the ": null
    },
    {
        "defendant": "Defendant"
    },
    {
        " with the aid of the condictio furtiva . With the aid of the actio legis Aquiliae , the ": null
    },
    {
        "plaintiff": "Plaintiff"
    },
    {
        " could claim damages from the ": null
    },
    {
        "defendant": "Defendant"
    },
    {
        ". Rei vindicatio was derived from the ": null
    },
    {
        "ius civile": "Roman Lawius Civile, Ius Gentium, And Ius Naturale"
    },
    {
        ", therefore was only available to Roman citizens.          To describe a persons position in the legal system, Romans mostly used the expression togeus. The individual could have been a Roman citizen  unlike foreigners, or he could have been free  unlike slaves, or he could have had a certain position in a Roman family  either as the head of the family , or some lower member—alieni iuris—which lives by someone elses law. Two status types were senator and emperor.          The history of Roman Law can be divided into three systems of procedure: that of legis actiones, the formulary system, and cognitio extra ordinem. The periods in which these systems were in use overlapped one another and did not have definitive breaks, but it can be stated that the legis actio system prevailed from the time of the XII Tables until about the end of the 2nd century BC, that the formulary procedure was primarily used from the last century of the Republic until the end of the classical period , and that of cognitio extra ordinem was in use in post-classical times. Again, these dates are meant as a tool to help understand the types of procedure in use, not as a rigid boundary where one system stopped and another began.      During the republic and until the bureaucratization of Roman judicial procedure, the judge was usually a private person . He had to be a Roman male citizen. The parties could agree on a judge, or they could appoint one from a list, called album iudicum. They went down the list until they found a judge agreeable to both parties, or if none could be found they had to take the last one on the list.     No one had a legal obligation to judge a case. The judge had great latitude in the way he conducted the litigation. He considered all the evidence and ruled in the way that seemed just. Because the judge was not a jurist or a legal technician, he often consulted a jurist about the technical aspects of the case, but he was not bound by the jurists reply. At the end of the litigation, if things were not clear to him, he could refuse to give a judgment, by swearing that it wasnt clear. Also, there was a maximum time to issue a judgment, which depended on some technical issues .     Later on, with the bureaucratization, this procedure disappeared, and was substituted by the so-called extra ordinem procedure, also known as cognitory. The whole case was reviewed before a magistrate, in a single phase. The magistrate had obligation to judge and to issue a decision, and the decision could be appealed to a higher magistrate.                   When the centre of the Empire was moved to the ": null
    },
    {
        "Greek East": "Greek East"
    },
    {
        " in the 4th century, many legal concepts of Greek origin appeared in the official Roman legislation.  The influence is visible even in the law of persons or of the family, which is traditionally the part of the law that changes least. For example, ": null
    },
    {
        "Constantine": "Constantine The Great"
    },
    {
        " started putting restrictions on the ancient Roman concept of patria potestas, the power held by the male head of a family over his descendents, by acknowledging that persons in potestate, the descendents, could have proprietary rights. He was apparently making concessions to the much stricter concept of paternal authority under Greek-Hellenistic law. The  Codex Theodosianus  was a ": null
    },
    {
        "codification": "Codification"
    },
    {
        " of Constantian laws. Later emperors went even further, until Justinian finally decreed that a child in potestate became owner of everything it acquired, except when it acquired something from its father.     The codes of Justinian, particularly the  Corpus Juris Civilis  continued to be the basis of legal practice in the Empire throughout its so-called  Byzantine  history. ": null
    },
    {
        "Leo III the Isaurian": "Leo Iii The Isaurian"
    },
    {
        " issued a new code, the Ecloga,  in the early 8th century. In the 9th century, the emperors ": null
    },
    {
        "Basil I": "Basil I"
    },
    {
        " and ": null
    },
    {
        "Leo VI the Wise": "Leo Vi The Wise"
    },
    {
        " commissioned a combined translation of the Code and the Digest, parts of Justinians codes, into Greek, which became known as the ": null
    },
    {
        "Basilica": "Basilika"
    },
    {
        ". Roman law as preserved in the codes of Justinian and in the Basilica remained the basis of legal practice in Greece and in the courts of the ": null
    },
    {
        "Eastern Orthodox Church": "Eastern Orthodox Church"
    },
    {
        " even after the fall of the Byzantine Empire and the conquest by the Turks, and, along with the ": null
    },
    {
        "Syro-Roman law book": "Syro-Roman Law Book"
    },
    {
        ", also formed the basis for much of the  Fetha Negest , which remained in force in Ethiopia until 1931.          In the west, Justinians political authority never went any farther than certain portions of the Italian and Hispanic peninsulas. In ": null
    },
    {
        "Law codes": "Early Germanic Law"
    },
    {
        " were issued by the Germanic kings, however, the influence of early Eastern Roman codes on some of these is quite discernible. In many early Germanic states, Roman citizens continued to be governed by Roman laws for quite some time, even while members of the various Germanic tribes were governed by their own respective codes.     The  Codex Justinianus  and the ": null
    },
    {
        "Institutes of Justinian": "Institutes Of Justinian"
    },
    {
        " were known in Western Europe, and along with the earlier code of ": null
    },
    {
        "Theodosius II": "Theodosius Ii"
    },
    {
        ", served as models for a few of the Germanic law codes; however, the  Digest  portion was largely ignored for several centuries until around 1070, when a manuscript of the Digest was rediscovered in Italy. This was done mainly through the works of glossars who wrote their comments between lines , or in the form of marginal notes . From that time, scholars began to study the ancient Roman legal texts, and to teach others what they learned from their studies. The center of these studies was ": null
    },
    {
        "Bologna": "Bologna"
    },
    {
        ". The law school there gradually developed into Europes first university.     The students who were taught Roman law in Bologna found that many rules of Roman law were better suited to regulate complex economic transactions than were the customary rules, which were applicable throughout Europe. For this reason, Roman law, or at least some provisions borrowed from it, began to be re-introduced into legal practice, centuries after the end of the Roman empire. This process was actively supported by many kings and princes who employed university-trained jurists as counselors and court officials and sought to benefit from rules like the famous Princeps legibus solutus est .     There are several reasons that Roman law was favored in the Middle Ages. Roman law regulated the legal protection of property and the equality of legal subjects and their wills, and it prescribed the possibility that the legal subjects could dispose their property through testament.     By the middle of the 16th century, the rediscovered Roman law dominated the legal practice of many European countries. A legal system, in which Roman law was mixed with elements of ": null
    },
    {
        "canon law": "Canon Law"
    },
    {
        " and of Germanic custom, especially ": null
    },
    {
        "feudal law": "Feudal Law"
    },
    {
        ", had emerged. This legal system, which was common to all of continental Europe  was known as  Ius Commune . This Ius Commune and the legal systems based on it are usually referred to as ": null
    },
    {
        "civil law": "Civil Law"
    },
    {
        " in English-speaking countries.     Only ": null
    },
    {
        "England": "Kingdom Of England"
    },
    {
        " and the Nordic countries did not take part in the wholesale reception of Roman law. One reason for this is that the ": null
    },
    {
        "English legal system": "Common Lawhistory"
    },
    {
        " was more developed than its continental counterparts by the time Roman law was rediscovered. Therefore, the practical advantages of Roman law were less obvious to English practitioners than to continental lawyers. As a result, the English system of ": null
    },
    {
        "common law": "Common Law"
    },
    {
        " developed in parallel to Roman-based civil law, with its practitioners being trained at the ": null
    },
    {
        "Inns of Court": "Inns Of Court"
    },
    {
        " in London rather than receiving degrees in Canon or Civil Law at the Universities of ": null
    },
    {
        "Oxford": "University Of Oxford"
    },
    {
        " or ": null
    },
    {
        "Cambridge": "University Of Cambridge"
    },
    {
        ". Elements of Romano-canon law were present in England in the ": null
    },
    {
        "ecclesiastical courts": "Ecclesiastical Courts"
    },
    {
        " and, less directly, through the development of the ": null
    },
    {
        "equity": "Equity"
    },
    {
        " system. In addition, some concepts from Roman law made their way into the common law. Especially in the early 19th century, English lawyers and judges were willing to borrow rules and ideas from continental jurists and directly from Roman law.     The practical application of Roman law, and the era of the European Ius Commune, came to an end when national codifications were made. In 1804, the ": null
    },
    {
        "French civil code": "Napoleonic Code"
    },
    {
        " came into force. In the course of the 19th century, many European states either adopted the French model or drafted their own codes. In Germany, the political situation made the creation of a national code of laws impossible. From the 17th century, Roman law in Germany had been heavily influenced by domestic law, and it was called usus modernus Pandectarum. In some parts of Germany, Roman law continued to be applied until the German ": null
    },
    {
        "civil code": "Civil Code"
    },
    {
        "  went into effect in 1900.      Colonial expansion spread the civil law system.        Today, Roman law is no longer applied in legal practice, even though the legal systems of some countries like ": null
    },
    {
        "South Africa": "South Africa"
    },
    {
        " and ": null
    },
    {
        "San Marino": "San Marino"
    },
    {
        " are still based on the old  jus commune . However, even where the legal practice is based on a code, many rules deriving from Roman law apply: no code completely broke with the Roman tradition. Rather, the provisions of the Roman law were fitted into a more coherent system and expressed in the national language. For this reason, knowledge of the Roman law is indispensable to understand the legal systems of today. Thus, Roman law is often still a mandatory subject for law students in ": null
    },
    {
        "civil law jurisdictions": "Civil Law"
    },
    {
        ".     As steps towards a unification of the private law in the member states of the ": null
    },
    {
        "European Union": "European Union"
    },
    {
        " are being taken, the old jus commune": null
    }
]