[
    {
        "        The Roman Breviary  is the ": null
    },
    {
        "liturgical book": "Liturgical Book"
    },
    {
        " of the ": null
    },
    {
        "Latin liturgical rites": "Latin Liturgical Rites"
    },
    {
        " of the ": null
    },
    {
        "Catholic Church": "Catholic Church"
    },
    {
        " containing the public or canonical ": null
    },
    {
        "prayers": "Prayer"
    },
    {
        ", ": null
    },
    {
        "hymns": "Hymn"
    },
    {
        ", the ": null
    },
    {
        "Psalms": "Psalms"
    },
    {
        ", readings, and notations for everyday use, especially by bishops, priests, and deacons in the Divine Office .     The volume containing the daily hours of Catholic prayer was published as the Breviarium Romanum from its  editio princeps  in 1568 under ": null
    },
    {
        "Pope Pius V": "Pope Pius V"
    },
    {
        " until the reforms of ": null
    },
    {
        "Paul VI": "Paul Vi"
    },
    {
        " , when it became known as the ": null
    },
    {
        "Liturgy of the Hours": "Liturgy Of The Hours"
    },
    {
        ".   In the course of the Catholic ": null
    },
    {
        "Counter-Reformation": "Counter-Reformation"
    },
    {
        ", Pope Pius V imposed the use of the Roman Breviary, mainly based on the Breviarium secundum usum Romanae Curiae, on the whole Roman Catholic Church.   Exceptions are the ": null
    },
    {
        "Benedictines": "Benedictines"
    },
    {
        " and ": null
    },
    {
        "Dominicans": "Dominican Order"
    },
    {
        ", who have Breviaries of their own, and   two surviving local breviaries,   the ": null
    },
    {
        "Mozarabic": "Mozarabic Rite"
    },
    {
        " Breviary, once in use throughout all Spain, but now confined to a single foundation at ": null
    },
    {
        "Toledo": "Toledo, Spain"
    },
    {
        "; it is remarkable for the number and length of its hymns, and for the fact that the majority of its ": null
    },
    {
        "collects": "Collects"
    },
    {
        " are addressed to God the Son;   the ": null
    },
    {
        "Ambrosian": "Ambrosian Rite"
    },
    {
        " Breviary, now confined to Milan, where it owes its retention to the attachment of the clergy and people to their traditionary rites, which they derive from St Ambrose.       The Latin word breviarium generally signifies abridgement, compendium .   It has often been used this wider sense by Christian authors, e.g. Breviarium fidei, Breviarium in psalmos, Breviarium canonum, Breviarium regularum.     In liturgical language specifically, breviary  has a special meaning, indicating a book furnishing the regulations for the celebration of Mass or the canonical Office, and may be met with under the titles   Breviarium Ecclesiastici Ordinis, or Breviarium Ecclesiæ Romanæ.   In the 9th century, ": null
    },
    {
        "Alcuin": "Alcuin"
    },
    {
        " uses the word to designate an office abridged or simplified for the use of the laity. ": null
    },
    {
        "Prudentius of Troyes": "Prudentius Of Troyes"
    },
    {
        ", about the same period, composed a Breviarium Psalterii.   In an ancient inventory occurs Breviarium Antiphonarii, meaning Extracts from the Antiphonary . In the Vita Aldrici occurs sicut in plenariis et breviariis Ecclesiæ ejusdem continentur.   Again, in the inventories in the catalogues, such notes as these may be met with: Sunt et duo cursinarii et tres benedictionales Libri; ex his unus habet obsequium mortuorum et unus Breviarius, or, Præter Breviarium quoddam quod usque ad festivitatem S. Joannis Baptistæ retinebunt, etc.   ": null
    },
    {
        "Monte Cassino": "Monte Cassino"
    },
    {
        " in c. 1100 obtained a book titled Incipit Breviarium sive Ordo Officiorum per totam anni decursionem.     From such references, and from others of a like nature, Quesnel gathers that by the word Breviarium was at first designated a book furnishing the rubrics, a sort of ": null
    },
    {
        "Ordo": "Directorium"
    },
    {
        ". The title Breviary, as we employ it—that is, a book containing the entire canonical office—appears to date from the 11th century.     ": null
    },
    {
        "Pope Gregory VII": "Pope Gregory Vii"
    },
    {
        " having, indeed, abridged the order of prayers, and having simplified the Liturgy as performed at the Roman Court, this abridgment received the name of Breviary, which was suitable, since, according to the etymology of the word, it was an abridgment.   The name has been extended to books which contain in one volume, or at least in one work, liturgical books of different kinds, such as the Psalter, the Antiphonary, the Responsoriary, the Lectionary, etc.   In this connection it may be pointed out that in this sense the word, as it is used nowadays, is illogical; it should be named a Plenarium rather than a Breviarium, since, liturgically speaking, the word Plenarium exactly designates such books as contain several different compilations united under one cover.              The canonical hours of the Breviary owe their remote origin to the ": null
    },
    {
        "Old Covenant": "Old Covenant"
    },
    {
        " when God commanded the Aaronic priests to offer morning and evening sacrifices. Other inspiration may have come from Davids words in the Psalms Seven times a day I praise you , as well as, the just man meditates on the law day and night . Regarding Daniel Three times daily he was kneeling and offering prayers and thanks to his God .     In the early days of Christian worship the ": null
    },
    {
        "Sacred Scriptures": "Bible"
    },
    {
        " furnished all that was thought necessary, containing as it did the books from which the lessons were read and the psalms that were recited. The first step in the evolution of the Breviary was the separation of the Psalter into a choir-book. At first the president of the local church or the leader of the choir chose a particular psalm as he thought appropriate. From about the 4th century certain psalms began to be grouped together, a process that was furthered by the monastic practice of daily reciting the 150 psalms. This took so much time that the monks began to spread it over a week, dividing each day into hours, and allotting to each hour its portion of the Psalter. St Benedict in the 6th century drew up such an arrangement, probably, though not certainly, on the basis of an older Roman division which, though not so skilful, is the one in general use. Gradually there were added to these psalter choir-books additions in the form of antiphons, responses, collects or short prayers, for the use of those not skilful at improvisation and metrical compositions. ": null
    },
    {
        "Jean Beleth": "Jean Beleth"
    },
    {
        ", a 12th-century liturgical author, gives the following list of books necessary for the right conduct of the canonical office: the Antiphonarium, the Old and New Testaments, the Passionarius  and the Legendarius , the Homiliarius , the Sermologus and the works of the Fathers, besides, of course, the Psalterium and the Collectarium. To overcome the inconvenience of using such a library the Breviary came into existence and use. Already in the 9th century ": null
    },
    {
        "Prudentius, bishop of Troyes": "Prudentius, Bishop Of Troyes"
    },
    {
        ", had in a Breviarium Psalterii made an abridgment of the Psalter for the laity, giving a few psalms for each day, and Alcuin had rendered a similar service by including a prayer for each day and some other prayers, but no lessons or homilies.       The Breviary rightly so called, only dates from the 11th century; the earliest MS. containing the whole canonical office is of the year 1099 and is in the Mazarin library. Gregory VII , too, simplified the liturgy as performed at the Roman court, and gave his abridgment the name of Breviary, which thus came to denote a work which from another point of view might be called a Plenary, involving as it did the collection of several works into one. There are several extant specimens of 12th-century Breviaries, all Benedictine, but under Innocent III their use was extended, especially by the newly founded and active Franciscan order. These preaching friars, with the authorization of Gregory IX, adopted the Breviary hitherto used exclusively by the Roman court, and with it gradually swept out of Europe all the earlier partial books , etc., and to some extent the local Breviaries, like that of Sarum. Finally, ": null
    },
    {
        "Nicholas III": "Pope Nicholas Iii"
    },
    {
        " adopted this version both for the curia and for the basilicas of Rome, and thus made its position secure.     Before the rise of the ": null
    },
    {
        "mendicant orders": "Mendicant Orders"
    },
    {
        "  in the 13th century, the daily services were usually contained in a number of large volumes. The first occurrence of a single manuscript of the ": null
    },
    {
        "daily office": "Canonical Hours"
    },
    {
        " was written by the ": null
    },
    {
        "Benedictine": "Benedictine"
    },
    {
        " order at ": null
    },
    {
        "Monte Cassino": "Monte Cassino"
    },
    {
        " in ": null
    },
    {
        "Italy": "Italy"
    },
    {
        " in 1099. The Benedictines were not a mendicant order, but a stable, ": null
    },
    {
        "monastery": "Monastery"
    },
    {
        "-based order, and single-volume breviaries are rare from this early period.     The arrangement of the ": null
    },
    {
        "Psalms": "Psalms"
    },
    {
        " in the ": null
    },
    {
        "Rule of St. Benedict": "Rule Of St. Benedict"
    },
    {
        " had a profound impact upon the breviaries used by secular and monastic clergy alike, until 1911 when Pope ": null
    },
    {
        "Pius X": "Pius X"
    },
    {
        " introduced his reform of the Roman Breviary. In many places, every diocese, order or ecclesiastical province maintained its own edition of the breviary.     However, mendicant friars travelled frequently and needed a shortened, or abbreviated, daily office contained in one portable book, and single-volume breviaries flourished from the thirteenth century onwards. These abbreviated volumes soon became very popular and eventually supplanted the ": null
    },
    {
        "Catholic Churchs": "Catholic Church"
    },
    {
        " Curia": "Curia"
    },
    {
        " office, previously said by non-monastic ": null
    },
    {
        "clergy": "Clergy"
    },
    {
        ".          Before the advent of ": null
    },
    {
        "printing": "Printing"
    },
    {
        ", breviaries were written by hand and were often richly decorated with initials and miniature illustrations telling stories in the lives of ": null
    },
    {
        "Christ": "Christ"
    },
    {
        " or the ": null
    },
    {
        "saints": "Saint"
    },
    {
        ", or stories from the ": null
    },
    {
        "Bible": "Bible"
    },
    {
        ". Later printed breviaries usually have ": null
    },
    {
        "woodcut": "Woodcut"
    },
    {
        " illustrations, interesting in their own right but the poor relation of the beautifully ": null
    },
    {
        "illuminated": "Illuminated Manuscript"
    },
    {
        " breviaries.     The beauty and value of many of the Latin Breviaries were brought to the notice of English churchmen by one of the numbers of the Oxford  Tracts for the Times , since which time they have been much more studied, both for their own sake and for the light they throw upon the English Prayer-Book.     From a bibliographical point of view some of the early printed Breviaries are among the rarest of literary curiosities, being merely local. The copies were not spread far, and were soon worn out by the daily use made of them. Doubtless many editions have perished without leaving a trace of their existence, while others are known by unique copies. In Scotland the only one which has survived the convulsions of the 16th century is  Aberdeen Breviary , a Scottish form of the Sarum Office , revised by ": null
    },
    {
        "William Elphinstone": "William Elphinstone"
    },
    {
        " , and printed at Edinburgh by ": null
    },
    {
        "Walter Chapman": "Walter Chepman"
    },
    {
        " and ": null
    },
    {
        "Androw Myllar": "Androw Myllar"
    },
    {
        " in 1509–1510. Four copies have been preserved of it, of which only one is complete; but it was reprinted in facsimile in 1854 for the Bannatyne Club by the munificence of the ": null
    },
    {
        "Duke of Buccleuch": "Walter Montagu Douglas Scott, 5Th Duke Of Buccleuch"
    },
    {
        ". It is particularly valuable for the trustworthy notices of the early history of Scotland which are embedded in the lives of the national saints. Though enjoined by royal mandate in 1501 for general use within the realm of Scotland, it was probably never widely adopted. The new Scottish Proprium sanctioned for the Catholic province of St Andrews in 1903 contains many of the old Aberdeen collects and antiphons.     The Sarum or Salisbury Breviary itself was very widely used. The first edition was printed at Venice in 1483 by Raynald de Novimagio in folio; the latest at Paris, 1556, 1557. While modern Breviaries are nearly always printed in four volumes, one for each season of the year, the editions of the Sarum never exceeded two parts.       Until the ": null
    },
    {
        "Council of Trent": "Council Of Trent"
    },
    {
        " and the Catholic ": null
    },
    {
        "Counter-Reformation": "Counter-Reformation"
    },
    {
        ", every bishop had full power to regulate the Breviary of his own diocese; and this was acted upon almost everywhere. Each monastic community, also, had one of its own. ": null
    },
    {
        "Pope Pius V": "Pope Pius V"
    },
    {
        " , however, while sanctioning those which could show at least 200 years of existence, made the Roman obligatory in all other places. But the influence of the ": null
    },
    {
        "Roman rite": "Roman Rite"
    },
    {
        " has gradually gone much beyond this, and has superseded almost all the local uses. The Roman has thus become nearly universal, with the allowance only of additional offices for saints specially venerated in each particular diocese.   The Roman Breviary has undergone several revisions: The most remarkable of these is that by ": null
    },
    {
        "Francis Quignonez": "Francisco De Quiñones"
    },
    {
        ", cardinal of ": null
    },
    {
        "Santa Croce in Gerusalemme": "Santa Croce In Gerusalemme"
    },
    {
        " , which, though not accepted by Rome , formed the model for the still more thorough reform made in 1549 by the ": null
    },
    {
        "Church of England": "Church Of England"
    },
    {
        ", whose daily morning and evening services are but a condensation and simplification of the Breviary offices.   Some parts of the prefaces at the beginning of the English Prayer-Book are free translations of those of Quignonez. The Pian Breviary was again altered by ": null
    },
    {
        "Sixtus V": "Sixtus V"
    },
    {
        " in 1588, who introduced the revised ": null
    },
    {
        "Vulgate": "Vulgate"
    },
    {
        ", in 1602 by Clement VIII , especially as concerns the rubrics; and by ": null
    },
    {
        "Urban VIII": "Urban Viii"
    },
    {
        " , a purist who altered the text of certain hymns.     In the 17th and 18th centuries a movement of revision took place in France, and succeeded in modifying about half the Breviaries of that country. Historically, this proceeded from the labours of ": null
    },
    {
        "Jean de Launoy": "Jean De Launoy"
    },
    {
        " , le dénicheur des saints , and ": null
    },
    {
        "Louis Sébastien le Nain de Tillemont": "Louis Sébastien Le Nain De Tillemont"
    },
    {
        ", who had shown the falsity of numerous lives of the saints; while theologically it was produced by the Port Royal school, which led men to dwell more on communion with God as contrasted with the invocation of the saints. This was mainly carried out by the adoption of a rule that all antiphons and responses should be in the exact words of Scripture, which, of course, cut out the whole class of appeals to created beings. The services were at the same time simplified and shortened, and the use of the whole Psalter every week was made a reality. These reformed French Breviaries—e.g. the Paris Breviary of 1680 by Archbishop ": null
    },
    {
        "François de Harlay": "François De Harlay"
    },
    {
        " and that of 1736 by Archbishop ": null
    },
    {
        "Charles-Gaspard-Guillaume de Vintimille du Luc": "Charles-Gaspard-Guillaume De Vintimille Du Luc"
    },
    {
        " —show a deep knowledge of Holy Scripture, and much careful adaptation of different texts.       During the pontificate of ": null
    },
    {
        "Pius IX": "Pius Ix"
    },
    {
        " a strong Ultramontane movement arose against the French Breviaries of 1680 and 1736. This was inaugurated by ": null
    },
    {
        "Montalembert": "Charles Forbes René De Montalembert"
    },
    {
        ", but its literary advocates were chiefly ": null
    },
    {
        "Dom Gueranger": "Prosper Guéranger"
    },
    {
        ", a learned Benedictine monk, abbot of ": null
    },
    {
        "Solesmes": "Solesmes, Sarthe"
    },
    {
        ", and ": null
    },
    {
        "Louis Veuillot": "Louis Veuillot"
    },
    {
        " of the Univers; and it succeeded in suppressing them everywhere, the last diocese to surrender being Orleans in 1875. The Jansenist and Gallican influence was also strongly felt in Italy and in Germany, where Breviaries based on the French models were published at Cologne, Münster, Mainz and other towns. Meanwhile, under the direction of Benedict XIV , a special congregation collected much material for an official revision, but nothing was published. In 1902, under Leo XIII, a commission under the presidency of Monsignor ": null
    },
    {
        "Louis Duchesne": "Louis Duchesne"
    },
    {
        " was appointed to consider the Breviary, the Missal, the Pontifical and the Ritual.     Significant changes came in 1910 with the ": null
    },
    {
        "reform of the Roman Breviary by Pope Pius X": "Reform Of The Roman Breviary By Pope Pius X"
    },
    {
        ". This revision modified the traditional psalm scheme so that, while all 150 psalms were used in the course of the week, these were said without repetition. Those assigned to the Sunday office underwent the least revision, although noticeably fewer psalms are recited at Matins, and both Lauds and Compline are slightly shorter due to psalms being removed. Pius X was probably influenced by earlier attempts to eliminate repetition in the psalter, most notably the liturgy of the Benedictine congregation of St. Maur. However, since Cardinal Quignonezs attempt to reform the Breviary employed this principle—albeit with no regard to the traditional scheme—such notions had floated around in the western Church, and can particularly be seen in the Paris Breviary.     ": null
    },
    {
        "Pope Pius XII": "Pope Pius Xii"
    },
    {
        " introduced optional use of a new translation of the Psalms from the ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " to a more classical ": null
    },
    {
        "Latin": "Latin"
    },
    {
        ". Most breviaries published in the late 1950s and early 1960s used this Pian Psalter .     ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        " also revised the Breviary in 1960, introducing changes drawn up by his predecessor Pope Pius XII. The most notable alteration is the shortening of most feasts from nine to three lessons at Matins, keeping only the Scripture readings , followed by either the first part of the patristic reading or, for most feasts, a condensed version of the former second Nocturn, which was formerly used when a feast was reduced in rank and commemorated.       At the beginning stands the usual introductory matter, such as the tables for determining the date of Easter, the calendar, and the general rubrics. The Breviary itself is divided into four seasonal parts—winter, spring, summer, autumn—and comprises under each part:   the Psalter;   Proprium de Tempore ;   Proprium Sanctorum ;   Commune Sanctorum ;   Extra Services.     These parts are often published separately.          This psalm book is the very backbone of the Breviary, the groundwork of the Catholic prayer-book; out of it have grown the antiphons, responsories and versicles. Until the 1911 reform, the psalms were arranged according to a disposition dating from the 8th century, as follows: Psalms 1-108, with some omissions, were recited at Matins, twelve each day from Monday to Saturday, and eighteen on Sunday. The omissions were said at Lauds, Prime and Compline. Psalms 109-147 were said at Vespers, five each day. Psalms 148-150 were always used at Lauds, and give that hour its name. The text of this Psalter is that commonly known as the Gallican. The name is misleading, for it is simply the second revision made by Jerome of the old Itala version originally used in Rome. Jeromes first revision of the Itala , known as the Roman, is still used at St Peters in Rome, but the Gallican , thanks especially to St Gregory of Tours, who introduced it into Gaul in the 6th century, has ousted it everywhere else. The Antiphonary of Bangor proves that Ireland accepted the Gallican version in the 7th century, and the English Church did so in the 10th.     Following the 1911 reform, Matins was reduced to nine Psalms every day, with the other psalms redistributed throughout Prime, Terce, Sext, and Compline. For Sundays and special feasts Lauds and Vespers largely remained the same, Psalm 118 remained distributed at the Little Hours and Psalms 4, 90, and 130 were kept at Compline.     Proprium de Tempore The Proprium Sanctorum ": null
    },
    {
        "Leo XIII": "Leo Xiii"
    },
    {
        ", in view of archaeological and other discoveries. The third Nocturn consists of a homily on the Gospel which is read at that days Mass. Covering a great stretch of time and space, they do for the worshipper in the field of church history what the Scripture readings do in that of biblical history.     Commune Sanctorum Extra services ": null
    },
    {
        "Canonical Hours": "Canonical Hours"
    },
    {
        ". Each of the hours of the office is composed of the same elements, and something must be said now of the nature of these constituent parts, of which mention has here and there been already made. They are: psalms , antiphons, responsories, hymns, lessons, little chapters, versicles and collects.       Before the 1911 reform, the multiplication of saints festivals, with practically the same festal psalms, tended to repeat the about one-third of the Psalter, with a correspondingly rare recital of the remaining two-thirds. Following this reform, the entire Psalter is again generally recited each week, with the festal psalms restricted to only the highest-ranking feasts. As in the Greek usage and in the Benedictine, certain canticles like the Song of Moses , the ": null
    },
    {
        "Song of Hannah": "Song Of Hannah"
    },
    {
        " , the prayer of Habakkuk , the prayer of Hezekiah and other similar Old Testament passages, and, from the New Testament, the ": null
    },
    {
        "Magnificat": "Magnificat"
    },
    {
        ", the ": null
    },
    {
        "Benedictus": "Benedictus"
    },
    {
        " and the ": null
    },
    {
        "Nunc dimittis": "Nunc Dimittis"
    },
    {
        ", are admitted as psalms.       The antiphons are short liturgical forms, sometimes of biblical, sometimes of patristic origin, used to introduce a psalm. The term originally signified a chant by alternate choirs, but has quite lost this meaning in the Breviary.       The responsories are similar in form to the antiphons, but come at the end of the psalm, being originally the reply of the choir or congregation to the precentor who recited the psalm.       The hymns are short poems going back in part to the days of ": null
    },
    {
        "Prudentius": "Prudentius"
    },
    {
        ", ": null
    },
    {
        "Synesius": "Synesius"
    },
    {
        ", ": null
    },
    {
        "Gregory of Nazianzus": "Gregory Of Nazianzus"
    },
    {
        " and ": null
    },
    {
        "Ambrose": "Ambrose Of Milan"
    },
    {
        " , but mainly the work of medieval authors.       The lessons, as has been seen, are drawn variously from the Bible, the ": null
    },
    {
        "Acts of the Saints": "Acts Of The Saints"
    },
    {
        " and the ": null
    },
    {
        "Fathers of the Church": "Fathers Of The Church"
    },
    {
        ". In the primitive church, books afterwards excluded from the canon were often read, e.g. the letters of ": null
    },
    {
        "Clement of Rome": "Clement Of Rome"
    },
    {
        " and the ": null
    },
    {
        "Shepherd of Hermas": "Shepherd Of Hermas"
    },
    {
        ". In later days the churches of Africa, having rich memorials of martyrdom, used them to supplement the reading of Scripture. Monastic influence accounts for the practice of adding to the reading of a biblical passage some patristic commentary or exposition. Books of homilies were compiled from the writings of SS. ": null
    },
    {
        "Augustine": "Augustine Of Hippo"
    },
    {
        ", ": null
    },
    {
        "Hilary": "Hilary Of Poitiers"
    },
    {
        ", ": null
    },
    {
        "Athanasius": "Athanasius"
    },
    {
        ", ": null
    },
    {
        "Isidore": "Isidore Of Seville"
    },
    {
        ", ": null
    },
    {
        "Gregory the Great": "Pope Gregory I"
    },
    {
        " and others, and formed part of the library of which the Breviary was the ultimate compendium. In the lessons, as in the psalms, the order for special days breaks in upon the normal order of ferial offices and dislocates the scheme for consecutive reading. The lessons are read at Matins .       The little chapters are very short lessons read at the other hours.       The versicles are short responsories used after the little chapters in the minor hours. They appear after the hymns in Lauds and Vespers.       The collects come at the close of the office and are short prayers summing up the supplications of the congregation. They arise out of a primitive practice on the part of the bishop , examples of which are found in the ": null
    },
    {
        "Didachē": "Didache"
    },
    {
        " and in the letters of Clement of Rome and Cyprian. With the crystallization of church order improvisation in prayer largely gave place to set forms, and collections of prayers were made which later developed into ": null
    },
    {
        "Sacramentaries": "Sacramentary"
    },
    {
        " and ": null
    },
    {
        "Orationals": "Orational"
    },
    {
        ". The collects of the Breviary are largely drawn from the Gelasian and other Sacramentaries, and they are used to sum up the dominant idea of the festival in connection with which they happen to be used.       Before 1910, the difficulty of harmonizing the Proprium de Tempore and the Proprium Sanctorum, to which reference has been made, was only partly met in the thirty-seven chapters of general rubrics. Additional help was given by a kind of Catholic Churchmans Almanack, called the Ordo Recitandi Divini Officii, published in different countries and dioceses, and giving, under every day, minute directions for proper reading. In 1960, John XXIII simplified the rubrics governing the Breviary in order to make it easier to use.     Every cleric in Holy Orders, and many other members of religious orders, must publicly join in or privately read aloud the whole of the Breviary services allotted for each day. In large churches where they were celebrated the services were usually grouped; e.g. Matins and Lauds ; Prime, Terce , Sext, and None ; Vespers and Compline ; and from four to eight hours are thus spent in choir.     Lay use of the Breviary has varied throughout the Churchs history. In some periods laymen did not use the Breviary as a manual of devotion to any great extent. The late Medieval period saw the recitation of certain hours of the Little Office of the Blessed Virgin, which was based on the Breviary in form and content, becoming popular among those who could read, and ": null
    },
    {
        "Bishop Challoner": "Bishop Challoner"
    },
    {
        " did much to popularise the hours of Sunday Vespers and Compline in his Garden of the Soul in the eighteenth century. The Liturgical Movement in the twentieth century saw renewed interest in the Offices of the Breviary and several popular editions were produced, containing the vernacular as well as the Latin.     The complete pre-Pius X Roman Breviary was translated into English , French and German. Butes version is noteworthy for its inclusion of the skilful renderings of the ancient hymns by J.H. Newman, J.M. Neale and others. Several editions of the Pius X Breviary were produced during the twentieth century, including a notable edition prepared with the assistance of the sisters of ": null
    },
    {
        "Stanbrook Abbey": "Stanbrook Abbey"
    },
    {
        " in the 1950s. Two editions in English and Latin were produced in the following decade, which conformed to the rubrics of 1960, published by Liturgical Press and Benziger in the United States. These used the Pius XII psalter. ": null
    },
    {
        "Baronius Presss": "Baronius Press"
    },
    {
        " revised edition of the Liturgical Press edition uses the older Gallican psalter of St. Jerome. This edition was published and released in 2012 for pre-orders only. In 2013, the publication has resumed printing and is available on Baronius website.     Under Pope ": null
    },
    {
        "Benedict XVIs": "Benedict Xvi"
    },
    {
        " motu proprio": "Motu Proprio"
    },
    {
        " Summorum Pontificum": "Summorum Pontificum"
    },
    {
        ", Catholic bishops, priests, and deacons are again permitted to use the 1961 edition of the Roman Breviary, promulgated by ": null
    },
    {
        "Pope John XXIII": "Pope John Xxiii"
    },
    {
        " to satisfy their obligation to recite the ": null
    },
    {
        "Divine Office": "Liturgy Of The Hours"
    },
    {
        " every day.     In 2008, an i-breviary was launched, which combines the ancient breviaries with the latest computer technology.       1482. Breviarium Romanum. Albi, Johann Neumeister.   1494. Breviarium Romanum, Lyon, Perrinus Lathomi, Bonifacius Johannis & Johannes de Villa Veteri.   1502, Breviarium secundum comunem usus Romanum, Paris, Thielman Kerver.   1508. Breviarium secundum consuetudinem Romanam. Paris, Jean Philippe Jean Botcholdic, Gherard Berneuelt.   1509. Brevarium secundum ritum sacronsancte Romane ecclesie, Lyon, Ettienne Baland, Martin Boillon   1534. Breviarium Romanum, Paris, ": null
    },
    {
        "Yolande Bonhomme": "Yolande Bonhomme"
    },
    {
        ".     1535. Quignonius Breviary   :1535.  Breviarium Romanum Ex Decreto Sancrosancti Concilii Tridentini Restitutum ... editum et recognitum iuxta editionem venetiis Breviarium Romanum, nuper reformatum, in quo sacræ Scripturæ libri, probatæque Sanctorum historiæ eleganter beneque dispositæ leguntur; studio & labore Francisci Quignonii, Card. de licentia & facultate Pauli III. Pont. Max., Paris : Galliot Du Pré, Jean Kerbriant, Jean Petit   :1537. Breviarium Romanum nuper reformatum, Paris, Yolande Bonhomme.   ::     1570. Pian Breviary    :1570. Breviarium Romanum, ex decreto sacrosancti Concilii Tridentini restitutum, Pii V pontificis maximi jussu editum ; Antwerp, Christophe Plantin.     1629. ": null
    },
    {
        "Urban VIII": "Urban Viii"
    },
    {
        " Breviarium Romanum, ex decreto sacrosancti Concilii Tridentini restitutum, et Clementis VIII et Urbani VIII auctoritate recognitum, cum officiis sanctorum, novissime per Summos Pontifices usque ad hanc diem concessis; in quatuor Anni Tempora divisum.  .   1740.Breviarium Romanum cum Psalterium, proprio, & Officiis Sanctorum ad usum cleri Basilicae Vaticanae   Breviarium Romanum, ex decreto sacrosancti Concilii Tridentini restitutum, et Clementis VIII et Urbani VIII auctoritate recognitum, novis Officiis ex Indulto Apostolico huc usque concessis auctum  Breviarium Romanum, ex decreto sacrosancti Concilii Tridentini restitutum, et Clementis VIII et Urbani VIII auctoritate recognitum, com officiis sanctorum, novissime per Summos Pontifices usque ad hanc diem concessis, in quatuor Anni Tempora divisum   :   :   :   1828.   :   :   1861.   :   1888.   :     1908: Reform of the Roman Breviary by Pope Pius X   :   :   :   :   :     1960 .   :The Roman Breviary in English and Latin: A Bilingual Edition of the Breviarium Romanum with Rubrics in English Only": null
    }
]