[
    {
        "                 The Roman Kingdom, also referred to as the Roman monarchy, or the regal period of ancient Rome, was the earliest period of ": null
    },
    {
        "Roman history": "Ancient Rome"
    },
    {
        ", when the city and its territory were ruled by kings.     Little is certain about the kingdoms history, as no records and few inscriptions from the time of the kings survive, and the accounts of this period written during the ": null
    },
    {
        "Republic": "Roman Republic"
    },
    {
        " and ": null
    },
    {
        "Empire": "Roman Empire"
    },
    {
        " are thought to be based on oral tradition. According to these legends, the Roman Kingdom began with the citys ": null
    },
    {
        "founding": "Founding Of Rome"
    },
    {
        " circa 753 BC, with settlements around the ": null
    },
    {
        "Palatine Hill": "Palatine Hill"
    },
    {
        " along the river ": null
    },
    {
        "Tiber": "Tiber"
    },
    {
        " in central ": null
    },
    {
        "Italy": "Italy"
    },
    {
        ", and ended with the ": null
    },
    {
        "overthrow of the kings": "Overthrow Of The Roman Monarchy"
    },
    {
        " and the establishment of the Republic circa 509 BC.               The site of the founding of the Roman Kingdom  had a ": null
    },
    {
        "ford": "Ford"
    },
    {
        " where one could cross the river ": null
    },
    {
        "Tiber": "Tiber"
    },
    {
        " in central ": null
    },
    {
        "Italy": "Roman Italy"
    },
    {
        ". The Palatine Hill and hills surrounding it provided easily defensible positions in the wide fertile plain surrounding them. Each of these features contributed to the success of the city.     The traditional version of Roman history, which has come down to us principally through ": null
    },
    {
        "Livy": "Livy"
    },
    {
        " , ": null
    },
    {
        "Plutarch": "Plutarch"
    },
    {
        " , and ": null
    },
    {
        "Dionysius of Halicarnassus": "Dionysius Of Halicarnassus"
    },
    {
        " , recounts that a series of seven kings ruled the settlement in Romes first centuries. The traditional chronology, as codified by ": null
    },
    {
        "Varro": "Marcus Terentius Varro"
    },
    {
        " , allows 243 years for their combined reigns, an average of almost 35 years. Since the work of ": null
    },
    {
        "Barthold Georg Niebuhr": "Barthold Georg Niebuhr"
    },
    {
        ", modern scholarship has generally discounted this schema. The ": null
    },
    {
        "Gauls": "Gauls"
    },
    {
        " destroyed many of Romes historical records when they sacked the city after the ": null
    },
    {
        "Battle of the Allia": "Battle Of The Allia"
    },
    {
        " in 390 BC , and what remained eventually fell prey to time or to theft. With no contemporary records of the kingdom surviving, all accounts of the Roman kings must be carefully questioned.    Matyszak 2003, p. 12.          The kings, excluding ": null
    },
    {
        "Romulus": "Romulus"
    },
    {
        ", who according to legend held office by virtue of being the citys founder, were all elected by the people of Rome to serve for life, with none of the kings relying on military force to gain or keep the throne.     The insignia of the kings of Rome were twelve ": null
    },
    {
        "lictors": "Lictor"
    },
    {
        "wielding the ": null
    },
    {
        "fasces": "Fasces"
    },
    {
        " bearing axes, the right to sit upon a ": null
    },
    {
        "Curule chair": "Curule Chair"
    },
    {
        ", the purple ": null
    },
    {
        "Toga Picta": "Toga"
    },
    {
        ", red shoes, and a white ": null
    },
    {
        "diadem": "Diadem"
    },
    {
        " around the head. Of all these insignia, the most important was the purple toga.       The king was invested with supreme military, executive, and judicial authority through the use of ": null
    },
    {
        "imperium": "Imperium"
    },
    {
        ", formally granted to the king by the ": null
    },
    {
        "Comitia Curiata": "Comitia Curiata"
    },
    {
        " with the passing of the  Lex curiata de imperio  at the beginning of each kings reign. The imperium of the king was held for life and protected him from ever being brought to trial for his actions. As being the sole owner of imperium in Rome at the time, the king possessed ultimate ": null
    },
    {
        "executive power": "Executive Power"
    },
    {
        " and unchecked military authority as the ": null
    },
    {
        "commander-in-chief": "Commander-In-Chief"
    },
    {
        " of all Romes ": null
    },
    {
        "legions": "Roman Legion"
    },
    {
        ". Also, the laws that kept citizens safe from magistrates misuse of imperium did not exist during the monarchical period.     Another power of the king was the power to either appoint or nominate all officials to offices. The king would appoint a ": null
    },
    {
        "tribunus celerum": "Tribune"
    },
    {
        " to serve as both the tribune of Ramnes tribe in Rome and as the commander of the kings personal bodyguard, the ": null
    },
    {
        "Celeres": "Celeres"
    },
    {
        ". The king was required to appoint the tribune upon entering office and the tribune left office upon the kings death. The tribune was second in rank to the king and also possessed the power to convene the ": null
    },
    {
        "Curiate Assembly": "Curiate Assembly"
    },
    {
        " and lay legislation before it.     Another officer appointed by the king was the  praefectus urbi , who acted as the warden of the city. When the king was absent from the city, the prefect held all of the kings powers and abilities, even to the point of being bestowed with imperium while inside the city.     The king even received the right to be the only person to appoint ": null
    },
    {
        "patricians": "Patrician"
    },
    {
        " to the ": null
    },
    {
        "Senate": "Senate Of The Roman Kingdom"
    },
    {
        ".       What is known for certain is that the king alone possessed the right to the ": null
    },
    {
        "auspice": "Auspice"
    },
    {
        " on behalf of Rome as its chief ": null
    },
    {
        "augur": "Augur"
    },
    {
        ", and no public business could be performed without the will of the gods made known through auspices. The people knew the king as a mediator between them and the gods  and thus viewed the king with religious awe. This made the king the head of the ": null
    },
    {
        "national religion": "Roman Mythology"
    },
    {
        " and its chief executive. Having the power to control the ": null
    },
    {
        "Roman calendar": "Roman Calendar"
    },
    {
        ", he conducted all religious ceremonies and appointed lower religious offices and officers. It is said that Romulus himself instituted the augurs and was believed to have been the best augur of all. Likewise, King ": null
    },
    {
        "Numa Pompilius": "Numa Pompilius"
    },
    {
        " instituted the ": null
    },
    {
        "pontiffs": "Pontiff"
    },
    {
        "and through them developed the foundations of the ": null
    },
    {
        "religious dogma of Rome": "Religion In Ancient Rome"
    },
    {
        ".          Under the kings, the Senate and Curiate Assembly had very little power and authority. They were not independent since they lacked the right to meet together and discuss questions of state at their own will. They could be called together only by the king and could discuss only the matters that the king laid before them.     While the Curiate Assembly had the power to pass laws that had been submitted by the king, the Senate was effectively an honorary council. It could advise the king on his action but by no means could prevent him from acting. The only thing that the king could not do without the approval of the Senate and the Curiate Assembly was to declare war against a foreign nation.       The kings imperium both granted him military powers and qualified him to pronounce legal judgment in all cases as the chief justice of Rome. Though he could assign pontiffs to act as minor judges in some cases, he had supreme authority in all cases brought before him, both civil and criminal. This made the king supreme in times of both war and peace. While some writers believed there was no appeal from the kings decisions, others believed that a proposal for appeal could be brought before the king by any ": null
    },
    {
        "patrician": "Patrician"
    },
    {
        " during a meeting of the ": null
    },
    {
        "Curiate Assembly": "Roman Assemblies"
    },
    {
        ".     To assist the king, a council advised him during all trials, but this council had no power to control his decisions. Also, two criminal detectives were appointed by him as well as a two-man criminal court which oversaw cases of ": null
    },
    {
        "treason": "Treason"
    },
    {
        ". According to ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ", ": null
    },
    {
        "Lucius Tarquinius Superbus": "Lucius Tarquinius Superbus"
    },
    {
        ", the seventh and final king of Rome, judged capital criminal cases without the advice of counsellors, thereby creating fear amongst those who might think to oppose him. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ", ": null
    },
    {
        "Ab urbe condita": "Ab Urbe Condita Libri"
    },
    {
        ", ": null
    },
    {
        "1.49": "S:From The Founding Of The City/Book 149"
    },
    {
        "       Whenever a king died, Rome entered a period of interregnum. Supreme power of the state would devolve to the Senate, which was responsible for finding a new king. The Senate would assemble and appoint one of its own members—the ": null
    },
    {
        "interrex": "Interrex"
    },
    {
        "—to serve for a period of five days with the sole purpose of nominating the next king of Rome. If no king were nominated at the end of five days, with the Senates consent the interrex would appoint another Senator to succeed him for another five-day term. This process would continue until a new king was elected. Once the interrex found a suitable nominee to the kingship, he would bring the nominee before the Senate and the Senate would review him. If the Senate passed the nominee, the interrex would convene the Curiate Assembly and preside over it during the election of the King.     Once proposed to the Curiate Assembly, the people of Rome could either accept or reject him. If accepted, the king-elect did not immediately enter office. Two other acts still had to take place before he was invested with the full regal authority and power.     First, it was necessary to obtain the divine will of the gods respecting his appointment by means of the ": null
    },
    {
        "auspices": "Auspices"
    },
    {
        ", since the king would serve as high priest of Rome. This ceremony was performed by an ": null
    },
    {
        "augur": "Augur"
    },
    {
        ", who conducted the king-elect to the citadel where he was placed on a stone seat as the people waited below. If found worthy of the kingship, the augur announced that the gods had given favorable tokens, thus confirming the kings priestly character.     The second act which had to be performed was the conferral of the ": null
    },
    {
        "imperium": "Imperium"
    },
    {
        " upon the king. The Curiate Assemblys previous vote only determined who was to be king, and had not by that act bestowed the necessary power of the king upon him. Accordingly, the king himself proposed to the Curiate Assembly a law granting him imperium, and the Curiate Assembly by voting in favor of the law would grant it.     In theory, the people of Rome elected their leader, but the Senate had most of the control over the process.          According to legend, ": null
    },
    {
        "Romulus": "Romulus"
    },
    {
        " established the ": null
    },
    {
        "Senate": "Senate Of The Roman Kingdom"
    },
    {
        " after he founded Rome by personally selecting the most noble men to serve as a council for the city. As such, the Senate was the Kings advisory council as the ": null
    },
    {
        "Council of State": "Council Of State"
    },
    {
        ". The Senate was composed of 300 Senators, with 100 Senators representing each of the three ancient tribes of Rome: the Ramnes , Tities , and Luceres  tribes. Within each tribe, a Senator was selected from each of the tribes ten ": null
    },
    {
        "curiae": "Curiae"
    },
    {
        ". The king had the sole authority to appoint the Senators, but this selection was done in accordance with ancient custom.     Under the monarchy, the Senate possessed very little power and authority as the king held most of the political power of the state and could exercise those powers without the Senates consent. The chief function of the Senate was to serve as the kings council and be his legislative coordinator. Once legislation proposed by the king passed the Comitia Curiata, the Senate could either veto it or accept it as law. The king was, by custom, to seek the advice of the Senate on major issues. However, it was left to him to decide what issues, if any, were brought before them and he was free to accept or reject their advice as he saw fit. Only the king possessed the power to convene the Senate, except during the ": null
    },
    {
        "interregnum": "Interregnum"
    },
    {
        ", during which the Senate possessed the authority to convene itself.         ; Years BC      ImageSize width:800 height:75   PlotArea width:700 height:50 left:65 bottom:20   AlignBars justify     Colors   id:time value:rgb   id:period value:rgb   id:age value:rgb   id:era value:rgb   id:eon value:rgb   id:filler value:gray background bar   id:black value:black     Period from:-753 till:-509   TimeAxis orientation:horizontal   ScaleMajor unit:year increment:50 start:-753   ScaleMinor unit:year increment:5 start:-753     PlotData   align:center textcolor:black fontsize:10 mark: width:15 shift:     bar:Rulers color:era   from:-753 till:-716 text: ": null
    },
    {
        "Romulus": "Romulus"
    },
    {
        "   from:-716 till:-673 text: ": null
    },
    {
        "Numa": "Numa Pompilius"
    },
    {
        "   from:-673 till:-642 text: ": null
    },
    {
        "Tullus": "Tullus Hostilius"
    },
    {
        "   from:-642 till:-616 text: ": null
    },
    {
        "Ancus": "Ancus Marcius"
    },
    {
        "   from:-616 till:-579 text: ": null
    },
    {
        "Priscus": "Lucius Tarquinius Priscus"
    },
    {
        "   from:-579 till:-535 text: ": null
    },
    {
        "Servius": "Servius Tullius"
    },
    {
        "   from:-535 till:-509 text: ": null
    },
    {
        "Superbus": "Lucius Tarquinius Superbus"
    },
    {
        "     bar:   color:filler   from: -753 till: -673 text:Early   from: -673 till: -616 text:Middle   from: -616 till: -509 text:Late       :::Dates are approximate, consult particular article for details               Son of the ": null
    },
    {
        "Vestal Virgin": "Vestal Virgin"
    },
    {
        " Rhea Silvia": "Rhea Silvia"
    },
    {
        ", the legendary ": null
    },
    {
        "Romulus": "Romulus"
    },
    {
        " was Romes first king and the citys founder. After he and his twin brother ": null
    },
    {
        "Remus": "Romulus And Remus"
    },
    {
        " had deposed ": null
    },
    {
        "King Amulius": "Amulius"
    },
    {
        " of Alba and reinstated the kings brother and their grandfather ": null
    },
    {
        "Numitor": "Numitor"
    },
    {
        " to the throne, they decided to build a city in the area where they had been ": null
    },
    {
        "abandoned as infants": "Lupercal"
    },
    {
        ". After Remus was killed in a dispute, Romulus began building the city on the ": null
    },
    {
        "Palatine Hill": "Palatine Hill"
    },
    {
        ". His work began with fortifications. He permitted men of all classes to come to Rome as citizens, including slaves and freemen without distinction. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:8": "S:From The Founding Of The City/Book 18"
    },
    {
        " He is credited with establishing the citys religious, legal and political institutions. The kingdom was established by unanimous acclaim with him at the helm when Romulus called the citizenry to a council for the purposes of determining their government.  Everitt 2012, p. . Everitt 2012, p. 22-23.   Matyszak 2003, p. 17.     Romulus established the ": null
    },
    {
        "senate": "Roman Senate"
    },
    {
        " as an advisory council with the appointment of 100 of the most noble men in the community. These men he called patres , and their descendants became the ": null
    },
    {
        "patricians": "Patrician"
    },
    {
        ". To project command, he surrounded himself with attendants, in particular the twelve lictors. He may have chosen this number from the number of the birds who foretold his sovereignty He created three divisions of ": null
    },
    {
        "horsemen ": "Equites"
    },
    {
        ", called centuriesRamnes , Tities and Luceres . He also divided the populace into 30  curia e, named after 30 of the Sabine women who had intervened to end the war between Romulus and Tatius. The curiae formed the voting units in the ": null
    },
    {
        "popular assemblies": "Roman Assemblies"
    },
    {
        " . ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:8": "S:From The Founding Of The City/Book 18"
    },
    {
        ", ": null
    },
    {
        "13": "S:From The Founding Of The City/Book 113"
    },
    {
        "        Romulus was behind one of the most notorious acts in Roman history, the incident commonly known as ": null
    },
    {
        "the rape of the Sabine women": "The Rape Of The Sabine Women"
    },
    {
        ". To provide his citizens with wives, Romulus invited the neighboring tribes to a festival in Rome where the Romans committed a ": null
    },
    {
        "mass abduction": "Bride Kidnapping"
    },
    {
        " of young women from among the attendees. The account vary from 30 to 683 women taken, a significant number for a population of 3,000 Latins . War broke out when Romulus refused to return the captives. After the Sabines made three unsuccessful attempts to invade the hill settlements of Rome, the women themselves intervened during the ": null
    },
    {
        "Battle of the Lacus Curtius": "Battle Of The Lacus Curtius"
    },
    {
        " to end the war. The two peoples were united in a joint kingdom, with Romulus and the Sabine king ": null
    },
    {
        "Titus Tatius": "Titus Tatius"
    },
    {
        " sharing the throne. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:9–13": "S:From The Founding Of The City/Book 19"
    },
    {
        " Matyszak 2003, p. 19-20. Everitt 2012, p. 21-22. In addition to the war with the Sabines, Romulus ": null
    },
    {
        "waged war": "Roman-Etruscan Warswar With Fidenae And Veii Under Romulus"
    },
    {
        " with the Fidenates and Veientes and others. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:14–15": "S:From The Founding Of The City/Book 114"
    },
    {
        "     He reigned for thirty-seven ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , 1.21 or thirty-eight Plutarch Life of Romulus 29.7 years. According to the legend, Romulus vanished at age fifty-four while reviewing his troops on the Campus Martius. He was reported to have been taken up to Mt. Olympus in a whirlwind and made a god. After initial acceptance by the public, rumors and suspicions of foul play by the patricians began to grow. In particular, some thought that members of the nobility had murdered him, dismembered his body, and buried the pieces on their land. Livy Ab Urbe Book I ch.16 These were set aside after an ": null
    },
    {
        "esteemed nobleman": "Proculus Julius"
    },
    {
        " testified that Romulus had come to him in a vision and told him that he was the god ": null
    },
    {
        "Quirinus": "Quirinus"
    },
    {
        ". Plutarch Life of Romulus Book I ch. 28 He became, not only one of the ": null
    },
    {
        "three major gods of Rome": "Capitoline Triad"
    },
    {
        ", but the very likeness of the city itself. Everitt 2012, p. 24-25. Matyszak 2003, p. 20-21.       After Romulus died, there was an ": null
    },
    {
        "interregnum": "Interregnum"
    },
    {
        " for one year, during which ten men chosen from the senate governed Rome as successive  interreges . Under popular pressure, the Senate finally chose the Sabine ": null
    },
    {
        "Numa Pompilius": "Numa Pompilius"
    },
    {
        " to succeed Romulus, on account of his reputation for justice and piety. The choice was accepted by the Curiate Assembly. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:17–18": "S:From The Founding Of The City/Book 117"
    },
    {
        " Everitt 2012, p. 25-26. Matyszak 2003, p. 22.     Numas reign was marked by peace and religious reform. He constructed a new temple to ": null
    },
    {
        "Janus": "Janus"
    },
    {
        " and, after establishing peace with Romes neighbours, closed the doors of the temple to indicate a state of peace. They remained closed for the rest of his reign. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:19": "S:From The Founding Of The City/Book 119"
    },
    {
        " He established the ": null
    },
    {
        "Vestal Virgins": "Vestal Virgins"
    },
    {
        " at Rome, as well as the ": null
    },
    {
        "Salii": "Salii"
    },
    {
        ", and the ": null
    },
    {
        "flamines": "Flamen"
    },
    {
        " for ": null
    },
    {
        "Jupiter": "Jupiter"
    },
    {
        ", ": null
    },
    {
        "Mars": "Mars"
    },
    {
        " and Quirinus. He also established the office and duties of ": null
    },
    {
        "Pontifex Maximus": "Pontifex Maximus"
    },
    {
        ". Numa reigned for 43 years. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:20": "S:From The Founding Of The City/Book 120"
    },
    {
        " Matyszak 2003, p. 25. He reformed the ": null
    },
    {
        "Roman calendar": "Roman Calendar"
    },
    {
        " by adjusting it for the solar and lunar year, as well as by adding the months of January and February to bring the total number of months to twelve.       ": null
    },
    {
        "Tullus Hostilius": "Tullus Hostilius"
    },
    {
        " was as warlike as Romulus had been and completely unlike Numa as he lacked any respect for the gods. Tullus waged war against ": null
    },
    {
        "Alba Longa": "Alba Longaalban War With Rome"
    },
    {
        ", ": null
    },
    {
        "Fidenae and Veii": "Roman-Etruscan Warssecond War With Fidenae And Veii, Under Tullus Hostilius"
    },
    {
        " and the ": null
    },
    {
        "Sabines": "Roman-Sabine Warswar With Tullus Hostilius"
    },
    {
        ". During Tulluss reign, the city of Alba Longa was completely destroyed and Tullus integrated its population into Rome. Matyszak 2003, p. 26-28.     Tullus is attributed with constructing a new home for the Senate, the ": null
    },
    {
        "Curia Hostilia": "Curia Hostilia"
    },
    {
        ", which survived for 562 years after his death.     According to Livy, Tullus neglected the worship of the gods until, towards the end of his reign, he fell ill and became superstitious. However, when Tullus called upon Jupiter and begged assistance, Jupiter responded with a bolt of lightning that burned the king and his house to ashes. ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab urbe condita , ": null
    },
    {
        "1:31": "S:From The Founding Of The City/Book 131"
    },
    {
        " Matyszak 2003, p.29.     His reign lasted for 31 years.       Following the mysterious death of Tullus, the Romans elected a peaceful and religious king in his place, Numas grandson, ": null
    },
    {
        "Ancus Marcius": "Ancus Marcius"
    },
    {
        ". Much like his grandfather, Ancus did little to expand the borders of Rome and only fought wars to defend the territory. He also built Romes first prison on the ": null
    },
    {
        "Capitoline Hill": "Capitoline Hill"
    },
    {
        ". Matyszak 2003, p. 30.     Ancus further fortified the ": null
    },
    {
        "Janiculum": "Janiculum"
    },
    {
        " Hill on the western bank, and built the first bridge across the ": null
    },
    {
        "Tiber River": "Tiber River"
    },
    {
        ". He also founded the port of ": null
    },
    {
        "Ostia": "Ostia Antica"
    },
    {
        " on the ": null
    },
    {
        "Tyrrhenian Sea": "Tyrrhenian Sea"
    },
    {
        " and established Romes first salt works, as well as the citys first ": null
    },
    {
        "aqueduct": "Aqueduct"
    },
    {
        ". Rome grew, as Ancus used ": null
    },
    {
        "diplomacy": "Diplomacy"
    },
    {
        " to peacefully unite smaller surrounding cities into alliance with Rome. Thus, he completed the conquest of the Latins and relocated them to the ": null
    },
    {
        "Aventine Hill": "Aventine Hill"
    },
    {
        ", thus forming the ": null
    },
    {
        "plebeian": "Plebeian"
    },
    {
        " class of Romans. Matyszak 2003, p. 31.     He died a natural death, like his grandfather, after 25 years as king, marking the end of Romes Latin-Sabine kings.       ": null
    },
    {
        "Lucius Tarquinius Priscus": "Lucius Tarquinius Priscus"
    },
    {
        " was the fifth king of Rome and the first of ": null
    },
    {
        "Etruscan": "Etruria"
    },
    {
        " birth. After immigrating to Rome, he gained favor with Ancus, who later adopted him as son. Upon ascending the throne, he waged wars against the Sabines and Etruscans, doubling the size of Rome and bringing great treasures to the city. To accommodate the influx of population, the ": null
    },
    {
        "Aventine": "Aventine Hill"
    },
    {
        " and ": null
    },
    {
        "Caelian hills": "Caelian Hill"
    },
    {
        "were populated. Everitt 2012, p. 30     One of his first reforms was to add 100 new members to the Senate from the conquered Etruscan tribes, bringing the total number of senators to 200. He used the treasures Rome had acquired from the conquests to build great monuments for Rome. Among these were Romes great sewer systems, the ": null
    },
    {
        "Cloaca Maxima": "Cloaca Maxima"
    },
    {
        ", which he used to drain the swamp-like area between the Seven Hills of Rome. In its place, he began construction on the ": null
    },
    {
        "Roman Forum": "Roman Forum"
    },
    {
        ". He also founded the Roman games.     Priscus initiated great building projects, including the citys first bridge, the ": null
    },
    {
        "Pons Sublicius": "Pons Sublicius"
    },
    {
        ". Everitt 2012, p. 28 The most famous is the ": null
    },
    {
        "Circus Maximus": "Circus Maximus"
    },
    {
        ", a giant stadium for ": null
    },
    {
        "chariot": "Chariot"
    },
    {
        " races. After that, he started the building of the temple-fortress to the god Jupiter on the Capitoline Hill. However, before it was completed, he was killed by a son of Ancus Marcius, after 38 years as king. His reign is best remembered for introducing the Roman symbols of military and civil offices, and the ": null
    },
    {
        "Roman triumph": "Roman Triumph"
    },
    {
        ", being the first Roman to celebrate one. Matyszak 2003, p. 36.          Priscus was succeeded by his son-in-law ": null
    },
    {
        "Servius Tullius": "Servius Tullius"
    },
    {
        ", Romes second king of Etruscan birth, and the son of a slave. Like his father-in-law, Servius fought successful wars against the Etruscans. He used the booty to build the first wall all around the Seven Hills of Rome, the ": null
    },
    {
        "pomerium": "Pomerium"
    },
    {
        ". He also reorganized the army.     Servius Tullius instituted a new constitution, further developing the ": null
    },
    {
        "citizen classes": "Social Class In Ancient Rome"
    },
    {
        ". He instituted Romes first ": null
    },
    {
        "census": "Census"
    },
    {
        " which divided the population into five economic classes, and formed the ": null
    },
    {
        "Centuriate Assembly": "Roman Assemblies"
    },
    {
        ". He used the census to divide the population into four urban tribes based on location, thus establishing the ": null
    },
    {
        "Tribal Assembly": "Roman Assemblies"
    },
    {
        ". He also oversaw the construction of the temple to ": null
    },
    {
        "Diana": "Diana"
    },
    {
        " on the ": null
    },
    {
        "Aventine Hill": "Aventine Hill"
    },
    {
        ".     Servius’ reforms made a big change in Roman life: voting rights based on socio-economic status, favoring elites. However, over time, Servius increasingly favored the poor in order to gain support from ": null
    },
    {
        "pleb": "Pleb"
    },
    {
        "s, often at the expense of patricians. After a 44-year reign, Servius was killed in a conspiracy by his daughter ": null
    },
    {
        "Tullia": "Tullia Minor"
    },
    {
        " and her husband ": null
    },
    {
        "Lucius Tarquinius Superbus": "Lucius Tarquinius Superbus"
    },
    {
        ". Matyszak 2003, p. 38-39.       The seventh and final king of Rome was ": null
    },
    {
        "Lucius Tarquinius Superbus": "Lucius Tarquinius Superbus"
    },
    {
        ". He was the son of Priscus and the son-in-law of Servius whom he and his wife had killed. Matyszak 2003, p. 40.     Tarquinius waged a number of wars against Romes neighbours, including against the ": null
    },
    {
        "Volsci": "Volsci"
    },
    {
        ", ": null
    },
    {
        "Gabii": "Gabii"
    },
    {
        " and the ": null
    },
    {
        "Rutuli": "Rutuli"
    },
    {
        ". He also secured Romes position as head of the ": null
    },
    {
        "Latin": "Latin League"
    },
    {
        " cities. He also engaged in a series of public works, notably the completion of the ": null
    },
    {
        "Temple of Jupiter Optimus Maximus": "Temple Of Jupiter Optimus Maximus"
    },
    {
        ", and works on the ": null
    },
    {
        "Cloaca Maxima": "Cloaca Maxima"
    },
    {
        " and the ": null
    },
    {
        "Circus Maximus": "Circus Maximus"
    },
    {
        ". However, Tarquins reign is remembered for his use of violence and intimidation to control Rome, and his disrespect of Roman custom and the ": null
    },
    {
        "Roman Senate": "Roman Senate"
    },
    {
        ". Matyszak 2003, p. 41.     Tensions came to a head when the kings son, ": null
    },
    {
        "Sextus Tarquinius": "Sextus Tarquinius"
    },
    {
        ", raped ": null
    },
    {
        "Lucretia": "Lucretia"
    },
    {
        ", wife and daughter to powerful Roman nobles. Lucretia told her relatives about the attack, and committed suicide to avoid the dishonour of the episode. Four men, led by ": null
    },
    {
        "Lucius Junius Brutus": "Lucius Junius Brutus"
    },
    {
        ", and including ": null
    },
    {
        "Lucius Tarquinius Collatinus": "Lucius Tarquinius Collatinus"
    },
    {
        ", ": null
    },
    {
        "Publius Valerius Poplicola": "Publius Valerius Poplicola"
    },
    {
        ", and ": null
    },
    {
        "Spurius Lucretius Tricipitinus": "Spurius Lucretius Tricipitinus"
    },
    {
        " incited a revolution that ": null
    },
    {
        "deposed and expelled": "Overthrow Of The Roman Monarchy"
    },
    {
        " Tarquinius and his family from Rome in 509 BC. Matyszak 2003, p. 42.     Tarquin was viewed so negatively that the word for king,  rex , held a negative connotation in ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " language until the fall of the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        ".     Brutus and Collatinus became Romes first ": null
    },
    {
        "consuls": "Roman Consul"
    },
    {
        ", marking the beginning of the ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        ". This new government would survive for the next 500 years until the rise of ": null
    },
    {
        "Julius Caesar": "Julius Caesar"
    },
    {
        " and ": null
    },
    {
        "Caesar Augustus": "Caesar Augustus"
    },
    {
        ", and would cover a period during which Romes authority and area of control extended to cover great areas of Europe, North Africa, and the West Asia. Matyszak 2003, p. 43-45.               To replace the leadership of the kings, a new office was created with the title of ": null
    },
    {
        "consul": "Roman Consul"
    },
    {
        ". Initially, the consuls possessed all of the kings powers in the form of two men, elected for a one-year term, who could veto each others actions. Later, the consuls’ powers were broken down further by adding other ": null
    },
    {
        "magistrates": "Roman Magistrate"
    },
    {
        " that each held a small portion of the kings original powers. First among these was the ": null
    },
    {
        "praetor": "Praetor"
    },
    {
        ", which removed the consuls’ judicial authority from them. Next came the ": null
    },
    {
        "censor": "Roman Censor"
    },
    {
        ", which stripped from the consuls the power to conduct the census.     The Romans instituted the idea of a ": null
    },
    {
        "dictatorship": "Roman Dictator"
    },
    {
        ". A dictator would have complete authority over civil and military matters within the Roman imperium. Since he was not legally responsible for his actions as a dictator, he was unquestionable. However, the power of the dictator was so absolute that Ancient Romans were hesitant in electing one, reserving this decision only to times of severe emergencies. Although this seems similar to the roles of a king, dictators of Rome were limited to serving a maximum six-month term limit. Contrary to the modern notion of a dictator as a usurper, Roman dictators were freely chosen, usually from the ranks of consuls, during turbulent periods when one-man rule proved more efficient.     The kings religious powers were given to two new offices: the ": null
    },
    {
        "Rex Sacrorum": "Rex Sacrorum"
    },
    {
        " and the ": null
    },
    {
        "Pontifex Maximus": "Pontifex Maximus"
    },
    {
        ". The Rex Sacrorum was the  de jure  highest religious official for the Republic. His sole task was to make the annual sacrifice to Jupiter, a privilege that had been previously reserved for the king. The Pontifex Maximus, however, was the  de facto  highest religious official and held most of the kings religious authority. He had the power to appoint all ": null
    },
    {
        "vestal virgins": "Vestal Virgins"
    },
    {
        ", flamens, pontiffs, and even the Rex Sacrorum himself. By the beginning of the 1st century BC, the Rex Sacrorum was all but forgotten, and the Pontifex Maximus given almost complete religious authority over the Roman religion.        ": null
    },
    {
        "Livy": "Livy"
    },
    {
        ",  Ab Urbe Condita .     A Critical History of Early Rome: From Prehistory to the First Punic War. Berkeley: University of California Press, 2005.   Livy, Aubrey De Sélincourt, R. M Ogilvie, and S. P Oakley. The Early History of Rome: Books I-V of The History of Rome From Its Foundations. London: Penguin Books, 2002.   Miles, Gary B. Livy: Reconstructing Early Rome. Ithaca: Cornell University Press, 1995.   Neel, Jaclyn. Early Rome: Myth and Society: A Sourcebook. Hoboken: Wiley Blackwell, 2017.   Ogilvie, R. M. Early Rome and the Etruscans. Atlantic Highlands, N.J.: Humanities Press, 1976.        ": null
    },
    {
        "Frank, Tenney": "Tenney Frank"
    },
    {
        ". 1920.    about All Things Roman    ": null
    },
    {
        "History of Rome podcasts": "The History Of Rome"
    },
    {
        "                                                       ": null
    }
]