[
    {
        "           The Rosetta Stone is a ": null
    },
    {
        "granodiorite": "Granodiorite"
    },
    {
        " stele": "Stele"
    },
    {
        " discovered in 1799 which is inscribed with three versions of a ": null
    },
    {
        "decree": "Rosetta Stone Decree"
    },
    {
        " issued at ": null
    },
    {
        "Memphis, Egypt": "Memphis, Egypt"
    },
    {
        " in 196 BC during the ": null
    },
    {
        "Ptolemaic dynasty": "Ptolemaic Dynasty"
    },
    {
        " on behalf of King ": null
    },
    {
        "Ptolemy V Epiphanes": "Ptolemy V Epiphanes"
    },
    {
        ". The top and middle texts are in ": null
    },
    {
        "Ancient Egyptian": "Ancient Egyptian"
    },
    {
        " using ": null
    },
    {
        "hieroglyphic": "Egyptian Hieroglyphs"
    },
    {
        " and ": null
    },
    {
        "demotic": "Demotic"
    },
    {
        " scripts respectively, while the bottom is in ": null
    },
    {
        "Ancient Greek": "Ancient Greek"
    },
    {
        ". The decree has only minor differences among the three versions, so the Rosetta Stone became key to ": null
    },
    {
        "deciphering Egyptian hieroglyphs": "Decipherment Of Egyptian Hieroglyphs"
    },
    {
        ", thereby opening a window into ancient Egyptian history.     The stone was carved during the ": null
    },
    {
        "Hellenistic period": "Hellenistic Period"
    },
    {
        " and is believed to have originally been displayed within a temple, possibly at nearby ": null
    },
    {
        "Sais": "Sais, Egypt"
    },
    {
        ". It was probably moved in late antiquity or during the ": null
    },
    {
        "Mameluk period": "Mamluk Sultanate"
    },
    {
        ", and was eventually used as building material in the construction of ": null
    },
    {
        "Fort Julien": "Fort Julien"
    },
    {
        " near the town of Rashid  in the ": null
    },
    {
        "Nile Delta": "Nile Delta"
    },
    {
        ". It was discovered there in July 1799 by French soldier ": null
    },
    {
        "Pierre-François Bouchard": "Pierre-François Bouchard"
    },
    {
        " during the Napoleonic ": null
    },
    {
        "campaign in Egypt": "French Campaign In Egypt And Syria"
    },
    {
        ". It was the first Ancient Egyptian bilingual text recovered in modern times, and it aroused widespread public interest with its potential to decipher this previously untranslated hieroglyphic script. Lithographic copies and plaster casts began circulating among European museums and scholars. The British defeated the French and took the stone to London under the ": null
    },
    {
        "Capitulation of Alexandria": "Capitulation Of Alexandria"
    },
    {
        " in 1801. It has been on public display at the ": null
    },
    {
        "British Museum": "British Museum"
    },
    {
        " almost continuously since 1802 and is the most visited object there.     Study of the decree was already under way when the first full translation of the Greek text appeared in 1803. ": null
    },
    {
        "Jean-François Champollion": "Jean-François Champollion"
    },
    {
        " announced the transliteration of the Egyptian scripts in Paris in 1822; it took longer still before scholars were able to read Ancient Egyptian inscriptions and literature confidently. Major advances in the decoding were recognition that the stone offered three versions of the same text ; that the demotic text used phonetic characters to spell foreign names ; that the hieroglyphic text did so as well, and had pervasive similarities to the demotic ; and that phonetic characters were also used to spell native Egyptian words .     Three other fragmentary copies of the same decree were discovered later, and several similar Egyptian bilingual or trilingual inscriptions are now known, including three slightly earlier ": null
    },
    {
        "Ptolemaic decrees": "Ptolemaic Decrees"
    },
    {
        "Decree of Canopus": "Decree Of Canopus"
    },
    {
        " in 238 BC, and the ": null
    },
    {
        "Memphis decree of Ptolemy  IV": "Decree Of Memphis"
    },
    {
        ", c. 218 BC. The Rosetta Stone is no longer unique, but it was the essential key to modern understanding of ancient Egyptian literature and civilisation. The term Rosetta Stone is now used to refer to the essential clue to a new field of knowledge.       The Rosetta Stone is listed as a stone of black ": null
    },
    {
        "granodiorite": "Granodiorite"
    },
    {
        ", bearing three inscriptions  ... found at Rosetta in a contemporary catalogue of the artefacts discovered by the French expedition and surrendered to British troops in 1801. ": null
    },
    {
        "Bierbrier ": "Bierbrier99"
    },
    {
        " pp.  111–113 At some period after its arrival in London, the inscriptions were coloured in ": null
    },
    {
        "white chalk": "Chalk"
    },
    {
        " to make them more legible, and the remaining surface was covered with a layer of ": null
    },
    {
        "carnauba wax": "Carnauba Wax"
    },
    {
        " designed to protect it from visitors fingers. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  23 This gave a dark colour to the stone that led to its mistaken identification as ": null
    },
    {
        "black basalt": "Basalt"
    },
    {
        ". ": null
    },
    {
        "Synopsis ": "Synopsis"
    },
    {
        " pp.  113–114 These additions were removed when the stone was cleaned in 1999, revealing the original dark grey tint of the rock, the sparkle of its crystalline structure, and a ": null
    },
    {
        "pink vein": "Vein"
    },
    {
        " running across the top left corner. ": null
    },
    {
        "Miller et al. ": "Miller00"
    },
    {
        " pp.  128–132 Comparisons with the ": null
    },
    {
        "Klemm collection": "Rosemarie And Dietrich Klemm Collection"
    },
    {
        " of Egyptian rock samples showed a close resemblance to rock from a small granodiorite quarry at ": null
    },
    {
        "Gebel Tingar": "Gebel Tingar"
    },
    {
        " on the west bank of the ": null
    },
    {
        "Nile": "Nile"
    },
    {
        ", west of ": null
    },
    {
        "Elephantine": "Elephantine"
    },
    {
        " in the region of ": null
    },
    {
        "Aswan": "Aswan"
    },
    {
        "; the pink vein is typical of granodiorite from this region. ": null
    },
    {
        "Middleton and Klemm ": "Middleton03"
    },
    {
        " pp.  207–208     The Rosetta Stone is  high at its highest point,  wide, and  thick. It weighs approximately . ": null
    },
    {
        "The Rosetta Stone": "Bmrs"
    },
    {
        " It bears three inscriptions: the top register in Ancient Egyptian ": null
    },
    {
        "hieroglyph": "Hieroglyph"
    },
    {
        "s, the second in the Egyptian ": null
    },
    {
        "demotic": "Demotic"
    },
    {
        " script, and the third in ": null
    },
    {
        "Ancient Greek": "Ancient Greek Language"
    },
    {
        ". ": null
    },
    {
        "Ray ": "Ray69"
    },
    {
        " p.  3 The front surface is polished and the inscriptions lightly ": null
    },
    {
        "incised": "Incisedarchaeology And The Plastic Arts"
    },
    {
        " on it; the sides of the stone are smoothed, but the back is only roughly worked, presumably because this would have not been visible when it was erected. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  28            The Rosetta Stone is a fragment of a larger stele. No additional fragments were found in later searches of the Rosetta site. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  20 Owing to its damaged state, none of the three texts is absolutely complete. The top register, composed of Egyptian hieroglyphs, suffered the most damage. Only the last 14 lines of the hieroglyphic text can be seen; all of them are broken on the right side, and 12 of them on the left. Below it, the middle register of demotic text has survived best; it has 32 lines, of which the first 14 are slightly damaged on the right side. The bottom register of Greek text contains 54 lines, of which the first 27 survive in full; the rest are increasingly fragmentary due to a diagonal break at the bottom right of the stone. ": null
    },
    {
        "Budge ": "Budge69"
    },
    {
        " pp.  2–3     The full length of the hieroglyphic text and the total size of the original stele, of which the Rosetta Stone is a fragment, can be estimated based on comparable stelae that have survived, including other copies of the same order. The slightly earlier ": null
    },
    {
        "decree of Canopus": "Decree Of Canopus"
    },
    {
        ", erected in 238 BC during the reign of ": null
    },
    {
        "Ptolemy  III": "Ptolemy Iii Euergetes"
    },
    {
        ", is  and  wide, and contains 36 lines of hieroglyphic text, 73 of demotic text, and 74 of Greek. The texts are of similar length. ": null
    },
    {
        "Budge ": "Budgem"
    },
    {
        " p.  106 From such comparisons, it can be estimated that an additional 14 or 15 lines of hieroglyphic inscription are missing from the top register of the Rosetta Stone, amounting to another . ": null
    },
    {
        "Budge ": "Budgem"
    },
    {
        " p.  109 In addition to the inscriptions, there would probably have been a scene depicting the king being presented to the gods, topped with a winged disc, as on the Canopus Stele. These parallels, and a hieroglyphic sign for stela on the stone itself, O26 , suggest that it originally had a rounded top. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  26 The height of the original stele is estimated to have been about .          The stele was erected after the ": null
    },
    {
        "coronation": "Coronation"
    },
    {
        " of King ": null
    },
    {
        "Ptolemy  V": "Ptolemy V Epiphanes"
    },
    {
        " and was inscribed with a decree that established the divine cult of the new ruler. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  25 The decree was issued by a congress of priests who gathered at ": null
    },
    {
        "Memphis": "Memphis, Egypt"
    },
    {
        ". The date is given as 4 Xandikos in the ": null
    },
    {
        "Macedonian calendar": "Ancient Macedonian Calendar"
    },
    {
        " and 18 ": null
    },
    {
        "Mekhir": "Mekhir"
    },
    {
        " in the ": null
    },
    {
        "Egyptian calendar": "Egyptian Calendar"
    },
    {
        ", which corresponds to  . The year is stated as the ninth year of Ptolemy  Vs reign , which is confirmed by naming four priests who officiated in that year: ": null
    },
    {
        "Aetos son of Aetos": "Aetos Son Of Aetos"
    },
    {
        " was priest of the divine cults of ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        " and the five ": null
    },
    {
        "Ptolemies": "Ptolemaic Dynasty"
    },
    {
        " down to Ptolemy  V himself; the other three priests named in turn in the inscription are those who led the worship of ": null
    },
    {
        "Berenice Euergetis": "Berenice Ii"
    },
    {
        " , ": null
    },
    {
        "Arsinoe Philadelphos": "Arsinoe Ii Of Egypt"
    },
    {
        " , and ": null
    },
    {
        "Arsinoe Philopator": "Arsinoe Iii Of Egypt"
    },
    {
        ", mother of Ptolemy  V. ": null
    },
    {
        "Clarysse and Van der Veken ": "Clarysse83"
    },
    {
        " pp.  20–21 However, a second date is also given in the Greek and hieroglyphic texts, corresponding to , the official anniversary of Ptolemys coronation. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  29 The demotic text conflicts with this, listing consecutive days in March for the decree and the anniversary. It is uncertain why this discrepancy exists, but it is clear that the decree was issued in 196 BC and that it was designed to re-establish the rule of the Ptolemaic kings over Egypt. ": null
    },
    {
        "Shaw & Nicholson ": "Shawnicholson1995"
    },
    {
        " p.  247     The decree was issued during a turbulent period in Egyptian history. Ptolemy  V Epiphanes reigned from 204 to 181 BC, the son of ": null
    },
    {
        "Ptolemy  IV Philopator": "Ptolemy & Nbsp;Iv Philopator"
    },
    {
        " and his wife and sister Arsinoe. He had become ruler at the age of five after the sudden death of both of his parents, who were murdered in a conspiracy that involved Ptolemy  IVs mistress ": null
    },
    {
        "Agathoclea": "Agathoclea"
    },
    {
        ", according to contemporary sources. The conspirators effectively ruled Egypt as Ptolemy  Vs guardians ": null
    },
    {
        "Tyldesley ": "Tyldesley2006"
    },
    {
        " p.  194 ": null
    },
    {
        "Clayton ": "Clayton06"
    },
    {
        " p.  211 until a revolt broke out two years later under general ": null
    },
    {
        "Tlepolemus": "Tlepolemus"
    },
    {
        ", when Agathoclea and her family were lynched by a mob in Alexandria. Tlepolemus, in turn, was replaced as guardian in 201 BC by ": null
    },
    {
        "Aristomenes of Alyzia": "Aristomenes Of Alyzia"
    },
    {
        ", who was chief minister at the time of the Memphis decree. ": null
    },
    {
        "Bevan ": "Bevan27"
    },
    {
        "      Political forces beyond the borders of Egypt exacerbated the internal problems of the Ptolemaic kingdom. ": null
    },
    {
        "Antiochus  III the Great": "Antiochus & Nbsp;Iii The Great"
    },
    {
        " and ": null
    },
    {
        "Philip  V of Macedon": "Philip & Nbsp;V Of Macedon"
    },
    {
        " had made a pact to divide Egypts overseas possessions. Philip had seized several islands and cities in ": null
    },
    {
        "Caria": "Caria"
    },
    {
        " and ": null
    },
    {
        "Thrace": "Thrace"
    },
    {
        ", while the ": null
    },
    {
        "Battle of Panium": "Battle Of Panium"
    },
    {
        " had resulted in the transfer of ": null
    },
    {
        "Coele-Syria": "Coele-Syria"
    },
    {
        ", including ": null
    },
    {
        "Judaea": "Judea"
    },
    {
        ", from the Ptolemies to the ": null
    },
    {
        "Seleucids": "Seleucids"
    },
    {
        ". Meanwhile, in the south of Egypt, there was a long-standing revolt that had begun during the reign of Ptolemy  IV, led by ": null
    },
    {
        "Horwennefer": "Hugronaphor"
    },
    {
        " and by his successor ": null
    },
    {
        "Ankhwennefer": "Adikhalamani"
    },
    {
        ". ": null
    },
    {
        "Assmann ": "Assmann"
    },
    {
        " p.  376 Both the war and the internal revolt were still ongoing when the young Ptolemy  V was officially crowned at Memphis at the age of 12 and when, just over a year later, the Memphis decree was issued.          Stelae of this kind, which were established on the initiative of the temples rather than that of the king, are unique to Ptolemaic Egypt. In the preceding Pharaonic period it would have been unheard of for anyone but the divine rulers themselves to make national decisions: by contrast, this way of honoring a king was a feature of Greek cities. Rather than making his eulogy himself, the king had himself glorified and deified by his subjects or representative groups of his subjects. ": null
    },
    {
        "Clarysse ": "Clarysse99"
    },
    {
        " p.  51, with references there to ": null
    },
    {
        "Quirke and Andrews ": "Quirke69"
    },
    {
        " The decree records that Ptolemy  V gave a gift of silver and grain to the ": null
    },
    {
        "temples": "Egyptian Temple"
    },
    {
        ". ": null
    },
    {
        "Bevan ": "Bevan27"
    },
    {
        " pp.  264–265 It also records that there was particularly high ": null
    },
    {
        "flooding of the Nile": "Flooding Of The Nile"
    },
    {
        " in the eighth year of his reign, and he had the excess waters dammed for the benefit of the farmers. In return the priesthood pledged that the kings birthday and coronation days would be celebrated annually and that all the priests of Egypt would serve him alongside the other gods. The decree concludes with the instruction that a copy was to be placed in every temple, inscribed in the language of the gods , the language of documents , and the language of the Greeks as used by the Ptolemaic government. ": null
    },
    {
        "Ray ": "Ray69"
    },
    {
        " p.  136 ": null
    },
    {
        "Parkinson et al. ": "Parkinson70"
    },
    {
        " p.  30     Securing the favour of the priesthood was essential for the Ptolemaic kings to retain effective rule over the populace. The ": null
    },
    {
        "High Priests": "High Priest Of Ptah"
    },
    {
        " of ": null
    },
    {
        "Memphis": "Memphis, Egypt"
    },
    {
        "—where the king was crowned—were particularly important, as they were the highest religious authorities of the time and had influence throughout the kingdom. ": null
    },
    {
        "Shaw ": "Shaw00"
    },
    {
        " p.  407 Given that the decree was issued at Memphis, the ancient capital of Egypt, rather than Alexandria, the centre of government of the ruling Ptolemies, it is evident that the young king was anxious to gain their active support. ": null
    },
    {
        "Walker and Higgs ": "Walker2001"
    },
    {
        " p.  19 Thus, although the government of Egypt had been Greek-speaking ever since the ": null
    },
    {
        "conquests": "Wars Of Alexander The Greategypt"
    },
    {
        " of ": null
    },
    {
        "Alexander the Great": "Alexander The Great"
    },
    {
        ", the Memphis decree, like the three similar ": null
    },
    {
        "earlier decrees": "Ptolemaic Decrees"
    },
    {
        ", included texts in Egyptian to show its connection to the general populace by way of the literate Egyptian priesthood. ": null
    },
    {
        "Bagnall and Derow ": "Bagnall04"
    },
    {
        "     There can be no one definitive English translation of the decree, not only because modern understanding of the ancient languages continues to develop, but also because of the minor differences between the three original texts. Older translations by ": null
    },
    {
        "E. A. Wallis Budge": "E. A. Wallis Budge"
    },
    {
        " Budge ": "Budge70"
    },
    {
        "; ": null
    },
    {
        "Budge ": "Budge69"
    },
    {
        " and ": null
    },
    {
        "Edwyn R. Bevan": "Edwyn R. Bevan"
    },
    {
        " Bevan ": "Bevan27"
    },
    {
        " pp.   are easily available but are now outdated, as can be seen by comparing them with the recent translation by R. S. Simpson, which is based on the demotic text and can be found online, ": null
    },
    {
        "Simpson ": "Simpson"
    },
    {
        "; a revised version of ": null
    },
    {
        "Simpson ": "Simpson96"
    },
    {
        " pp.  258–271 or, best of all, with the modern translations of all three texts, with introduction and facsimile drawing, that were published by Quirke and Andrews in 1989. ": null
    },
    {
        "Quirke and Andrews ": "Quirke69"
    },
    {
        "     The stele was almost certainly not originally placed at ": null
    },
    {
        "Rashid": "Rosetta"
    },
    {
        " where it was found, but more likely came from a temple site farther inland, possibly the royal town of ": null
    },
    {
        "Sais": "Sais, Egypt"
    },
    {
        ". ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  14 The temple from which it originally came was probably closed around AD 392 when ": null
    },
    {
        "Roman emperor": "Roman Emperor"
    },
    {
        " Theodosius I": "Theodosius I"
    },
    {
        " ordered the closing of all non-Christian temples of worship. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  17 The original stele broke at some point, its largest piece becoming what we now know as the Rosetta Stone. Ancient Egyptian temples were later used as quarries for new construction, and the Rosetta Stone probably was re-used in this manner. Later it was incorporated in the foundations of a fortress constructed by the ": null
    },
    {
        "Mameluke": "Mamluk"
    },
    {
        " Sultan": "Sultan"
    },
    {
        " Qaitbay": "Qaitbay"
    },
    {
        " to defend the ": null
    },
    {
        "Bolbitine branch": "Nile Delta"
    },
    {
        " of the Nile at Rashid. There it lay for at least another three centuries until its rediscovery. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  20     Three other inscriptions relevant to the same Memphis decree have been found since the discovery of the Rosetta Stone: the ": null
    },
    {
        "Nubayrah Stele": "Nubayrah Stele"
    },
    {
        ", a stele found in ": null
    },
    {
        "Elephantine": "Elephantine"
    },
    {
        " and Noub Taha, and an inscription found at the ": null
    },
    {
        "Temple of Philae": "Philae"
    },
    {
        " . ": null
    },
    {
        "Clarysse ": "Clarysse99"
    },
    {
        " p.  42; ": null
    },
    {
        "Nespoulous-Phalippou ": "Nespoulous-Phalippou"
    },
    {
        " pp.  283–285 Unlike the Rosetta Stone, the hieroglyphic texts of these inscriptions were relatively intact. The Rosetta Stone had been deciphered long before they were found, but later Egyptologists have used them to refine the reconstruction of the hieroglyphs that must have been used in the lost portions of the hieroglyphic text on the Rosetta Stone.                 ": null
    },
    {
        "Napoleons": "Napoleon"
    },
    {
        "1798 ": null
    },
    {
        "campaign in Egypt": "French Campaign In Egypt And Syria"
    },
    {
        " inspired a burst of ": null
    },
    {
        "Egyptomania": "Egyptomania"
    },
    {
        " in Europe, and especially France. A corps of 167 technical experts , known as the  Commission des Sciences et des Arts , accompanied the ": null
    },
    {
        "French expeditionary army": "French Revolutionary Army"
    },
    {
        " to Egypt. On  1799, French soldiers under the command of Colonel dHautpoul were strengthening the defences of ": null
    },
    {
        "Fort Julien": "Fort Julien"
    },
    {
        ", a couple of miles north-east of the Egyptian port city of Rosetta . Lieutenant ": null
    },
    {
        "Pierre-François Bouchard": "Pierre-François Bouchard"
    },
    {
        " spotted a slab with inscriptions on one side that the soldiers had uncovered.  He and dHautpoul saw at once that it might be important and informed General ": null
    },
    {
        "Jacques-François Menou": "Jacques-François Menou"
    },
    {
        ", who happened to be at Rosetta. The find was announced to Napoleons newly founded scientific association in Cairo, the ": null
    },
    {
        "Institut dÉgypte": "Institut Dégypte"
    },
    {
        ", in a report by Commission member ": null
    },
    {
        "Michel Ange Lancret": "Michel Ange Lancret"
    },
    {
        " noting that it contained three inscriptions, the first in hieroglyphs and the third in Greek, and rightly suggesting that the three inscriptions were versions of the same text. Lancrets report, dated  1799, was read to a meeting of the Institute soon after . Bouchard, meanwhile, transported the stone to Cairo for examination by scholars. Napoleon himself inspected what had already begun to be called la Pierre de Rosette, the Rosetta Stone, shortly before his return to France in August 1799.     The discovery was reported in September in  Courrier de lÉgypte , the official newspaper of the French expedition. The anonymous reporter expressed a hope that the stone might one day be the key to deciphering hieroglyphs. In 1800 three of the Commissions technical experts devised ways to make copies of the texts on the stone. One of these experts was ": null
    },
    {
        "Jean-Joseph Marcel": "Jean-Joseph Marcel"
    },
    {
        ", a printer and gifted linguist, who is credited as the first to recognise that the middle text was written in the Egyptian ": null
    },
    {
        "demotic": "Demotic"
    },
    {
        " script, rarely used for stone inscriptions and seldom seen by scholars at that time, rather than ": null
    },
    {
        "Syriac": "Syriac Language"
    },
    {
        " as had originally been thought. It was artist and inventor ": null
    },
    {
        "Nicolas-Jacques Conté": "Nicolas-Jacques Conté"
    },
    {
        " who found a way to use the stone itself as a ": null
    },
    {
        "printing block": "Woodblock Printing"
    },
    {
        " to reproduce the inscription. ": null
    },
    {
        "Adkins ": "Adkins69"
    },
    {
        " p.  38 A slightly different method was adopted by ": null
    },
    {
        "Antoine Galland": "Antoine Galland"
    },
    {
        ". The prints that resulted were taken to Paris by General ": null
    },
    {
        "Charles Dugua": "Charles Dugua"
    },
    {
        ". Scholars in Europe were now able to see the inscriptions and attempt to read them. ": null
    },
    {
        "Gillispie ": "Gillispie87"
    },
    {
        " pp.  1–38     After Napoleons departure, French troops held off British and ": null
    },
    {
        "Ottoman": "Ottoman Empire"
    },
    {
        " attacks for another 18 months. In March 1801, the British landed at ": null
    },
    {
        "Aboukir Bay": "Abu Qir Bay"
    },
    {
        ". Menou was now in command of the French expedition. His troops, including the Commission, marched north towards the Mediterranean coast to meet the enemy, transporting the stone along with many other antiquities. He was defeated in battle, and the remnant of his army retreated to Alexandria where they were surrounded and besieged, the stone now inside the city. Menou surrendered on August 30. ": null
    },
    {
        "Wilson ": "Wilson"
    },
    {
        " vol. 2 pp.  274–284          After the surrender, a dispute arose over the fate of the French archaeological and scientific discoveries in Egypt, including the artefacts, biological specimens, notes, plans, and drawings collected by the members of the commission. Menou refused to hand them over, claiming that they belonged to the Institute. British General ": null
    },
    {
        "John Hely-Hutchinson": "John Hely-Hutchinson, 2Nd Earl Of Donoughmore"
    },
    {
        " refused to end the siege until Menou gave in. Scholars ": null
    },
    {
        "Edward Daniel Clarke": "Edward Daniel Clarke"
    },
    {
        " and ": null
    },
    {
        "William Richard Hamilton": "William Richard Hamilton"
    },
    {
        ", newly arrived from England, agreed to examine the collections in Alexandria and claimed to have found many artefacts that the French had not revealed. In a letter home, Clarke said that we found much more in their possession than was represented or imagined . ": null
    },
    {
        "Burleigh ": "Burleigh07"
    },
    {
        " p.  212     Hutchinson claimed that all materials were property of the ": null
    },
    {
        "British Crown": "The Crown"
    },
    {
        ", but French scholar ": null
    },
    {
        "Étienne Geoffroy Saint-Hilaire": "Étienne Geoffroy Saint-Hilaire"
    },
    {
        " told Clarke and Hamilton that the French would rather burn all their discoveries than turn them over, referring ominously to the destruction of the ": null
    },
    {
        "Library of Alexandria": "Library Of Alexandria"
    },
    {
        ". Clarke and Hamilton pleaded the French scholars case to Hutchinson, who finally agreed that items such as natural history specimens would be considered the scholars private property. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  21 ": null
    },
    {
        "Burleigh ": "Burleigh07"
    },
    {
        " p.  214 Menou quickly claimed the stone, too, as his private property. ": null
    },
    {
        "Budge ": "Budge69"
    },
    {
        " p.  2 Hutchinson was equally aware of the stones unique value and rejected Menous claim. Eventually an agreement was reached, and the transfer of the objects was incorporated into the ": null
    },
    {
        "Capitulation of Alexandria": "Capitulation Of Alexandria"
    },
    {
        " signed by representatives of the ": null
    },
    {
        "British": "British Army"
    },
    {
        ", ": null
    },
    {
        "French": "French Revolutionary Army"
    },
    {
        ", and ": null
    },
    {
        "Ottoman": "Ottoman Army"
    },
    {
        " forces.     It is not clear exactly how the stone was transferred into British hands, as contemporary accounts differ. Colonel ": null
    },
    {
        "Tomkyns Hilgrove Turner": "Tomkyns Hilgrove Turner"
    },
    {
        ", who was to escort it to England, claimed later that he had personally seized it from Menou and carried it away on a ": null
    },
    {
        "gun-carriage": "Limbers And Caissons"
    },
    {
        ". In a much more detailed account, Edward Daniel Clarke stated that a French officer and member of the Institute had taken him, his student John Cripps, and Hamilton secretly into the back streets behind Menous residence and revealed the stone hidden under protective carpets among Menous baggage. According to Clarke, their informant feared that the stone might be stolen if French soldiers saw it. Hutchinson was informed at once and the stone was taken away—possibly by Turner and his gun-carriage. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " pp.  21–22     Turner brought the stone to England aboard the captured French frigate ": null
    },
    {
        "HMS Egyptienne": "Hms Egyptienne"
    },
    {
        ", landing in ": null
    },
    {
        "Portsmouth": "Portsmouth"
    },
    {
        " in February 1802. ": null
    },
    {
        "Andrews ": "Andrews69"
    },
    {
        " p.  12 His orders were to present it and the other antiquities to King ": null
    },
    {
        "George  III": "George Iii Of The United Kingdom"
    },
    {
        ". The King, represented by ": null
    },
    {
        "War Secretary": "Secretary Of State For War And The Colonies"
    },
    {
        " Lord Hobart": "Robert Hobart, 4Th Earl Of Buckinghamshire"
    },
    {
        ", directed that it should be placed in the ": null
    },
    {
        "British Museum": "British Museum"
    },
    {
        ". According to Turners narrative, he and Hobart agreed that the stone should be presented to scholars at the ": null
    },
    {
        "Society of Antiquaries of London": "Society Of Antiquaries Of London"
    },
    {
        ", of which Turner was a member, before its final deposit in the museum. It was first seen and discussed there at a meeting on  1802.        In 1802, the Society created four plaster casts of the inscriptions, which were given to the universities of ": null
    },
    {
        "Oxford": "University Of Oxford"
    },
    {
        ", ": null
    },
    {
        "Cambridge": "University Of Cambridge"
    },
    {
        " and ": null
    },
    {
        "Edinburgh": "University Of Edinburgh"
    },
    {
        " and to ": null
    },
    {
        "Trinity College Dublin": "Trinity College, Dublin"
    },
    {
        ". Soon afterwards, prints of the inscriptions were made and circulated to European scholars. Before the end of 1802, the stone was transferred to the ": null
    },
    {
        "British Museum": "British Museum"
    },
    {
        ", where it is located today. New inscriptions painted in white on the left and right edges of the slab stated that it was Captured in Egypt by the ": null
    },
    {
        "British Army": "British Army"
    },
    {
        " in 1801 and Presented by King George  III .     The stone has been exhibited almost continuously in the British Museum since June 1802. During the middle of the 19th century, it was given the inventory number EA 24 , EA standing for Egyptian Antiquities . It was part of a collection of ancient Egyptian monuments captured from the French expedition, including a ": null
    },
    {
        "sarcophagus": "Sarcophagus"
    },
    {
        " of ": null
    },
    {
        "Nectanebo  II": "Nectanebo & Nbsp;Ii"
    },
    {
        " , the statue of a ": null
    },
    {
        "high priest of Amun": "High Priests Of Amun"
    },
    {
        " , and a large granite fist . ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " pp.  30–31 The objects were soon discovered to be too heavy for the floors of ": null
    },
    {
        "Montagu House": "Montagu House, Bloomsbury"
    },
    {
        " , and they were transferred to a new extension that was added to the mansion. The Rosetta Stone was transferred to the sculpture gallery in 1834 shortly after Montagu House was demolished and replaced by the building that now houses the British Museum. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  31 According to the museums records, the Rosetta Stone is its most-visited single object, ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  7 a simple image of it was the museums best selling postcard for several decades, and a wide variety of merchandise bearing the text from the Rosetta Stone is sold in the museum shops.           The Rosetta Stone was originally displayed at a slight angle from the horizontal, and rested within a metal cradle that was made for it, which involved shaving off very small portions of its sides to ensure that the cradle fitted securely. It originally had no protective covering, and it was found necessary by 1847 to place it in a protective frame, despite the presence of attendants to ensure that it was not touched by visitors. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  32 Since 2004 the conserved stone has been on display in a specially built case in the centre of the Egyptian Sculpture Gallery. A replica of the Rosetta Stone is now available in the ": null
    },
    {
        "Kings Library": "Kings Library"
    },
    {
        " of the British Museum, without a case and free to touch, as it would have appeared to early 19th-century visitors. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  50     The museum was concerned about ": null
    },
    {
        "heavy bombing in London": "German Strategic Bombing During World War I1917"
    },
    {
        " towards the end of the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        " in 1917, and the Rosetta Stone was moved to safety, along with other portable objects of value. The stone spent the next two years  below ground level in a station of the ": null
    },
    {
        "Postal Tube Railway": "London Post Office Railway"
    },
    {
        " at ": null
    },
    {
        "Mount Pleasant": "Royal Mail Mount Pleasant Sorting Office"
    },
    {
        " near ": null
    },
    {
        "Holborn": "Holborn"
    },
    {
        ".  Other than during wartime, the Rosetta Stone has left the British Museum only once: for one month in October 1972, to be displayed alongside Champollions  Lettre  at the ": null
    },
    {
        "Louvre": "Louvre"
    },
    {
        " in Paris on the 150th anniversary of the letters publication. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  47 Even when the Rosetta Stone was undergoing conservation measures in 1999, the work was done in the gallery so that it could remain visible to the public. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " pp.  50–51            Prior to the discovery of the Rosetta Stone and its eventual decipherment, the ancient ": null
    },
    {
        "Egyptian language": "Egyptian Language"
    },
    {
        " and script had not been understood since shortly before the ": null
    },
    {
        "fall of the Roman Empire": "Fall Of The Western Roman Empire"
    },
    {
        ". The usage of the ": null
    },
    {
        "hieroglyphic script": "Egyptian Hieroglyphs"
    },
    {
        " had become increasingly specialised even in the later ": null
    },
    {
        "Pharaonic period": "Ancient Egypt"
    },
    {
        "; by the ": null
    },
    {
        "4th century": "4Th Century"
    },
    {
        " AD, few Egyptians were capable of reading them. Monumental use of hieroglyphs ceased after the closing of all non-Christian temples in 391 by Roman Emperor ": null
    },
    {
        "Theodosius  I": "Theodosius I"
    },
    {
        "; the last known inscription is dated to , found at ": null
    },
    {
        "Philae": "Philae"
    },
    {
        " and known as the ": null
    },
    {
        "Graffito of Esmet-Akhom": "Graffito Of Esmet-Akhom"
    },
    {
        ". ": null
    },
    {
        "Ray ": "Ray69"
    },
    {
        " p.  11     Hieroglyphs retained their pictorial appearance, and classical authors emphasised this aspect, in sharp contrast to the ": null
    },
    {
        "Greek": "Greek Alphabet"
    },
    {
        " and ": null
    },
    {
        "Roman alphabets": "Latin Alphabet"
    },
    {
        ". In the ": null
    },
    {
        "5th century": "5Th Century"
    },
    {
        ", the priest ": null
    },
    {
        "Horapollo": "Horapollo"
    },
    {
        " wrote Hieroglyphica, an explanation of almost 200 ": null
    },
    {
        "glyph": "Glyph"
    },
    {
        "s. His work was believed to be authoritative, yet it was misleading in many ways, and this and other works were a lasting impediment to the understanding of Egyptian writing. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " pp.  15–16 Later attempts at decipherment were made by ": null
    },
    {
        "Arab historians": "List Of Muslim Historians"
    },
    {
        " in ": null
    },
    {
        "medieval Egypt": "Egypt In The Middle Ages"
    },
    {
        " during the 9th and 10th centuries. ": null
    },
    {
        "Dhul-Nun al-Misri": "Dhul-Nun Al-Misri"
    },
    {
        " and ": null
    },
    {
        "Ibn Wahshiyya": "Ibn Wahshiyya"
    },
    {
        " were the first historians to study hieroglyphs, by comparing them to the contemporary ": null
    },
    {
        "Coptic language": "Coptic Language"
    },
    {
        " used by ": null
    },
    {
        "Coptic": "Copts"
    },
    {
        " priests in their time. ": null
    },
    {
        "El Daly ": "Eldaly05"
    },
    {
        " pp.  65–75 ": null
    },
    {
        "Ray ": "Ray69"
    },
    {
        " pp.  15–18 The study of hieroglyphs continued with fruitless attempts at decipherment by European scholars, notably ": null
    },
    {
        "Johannes Goropius Becanus": "Johannes Goropius Becanus"
    },
    {
        " in the 16th century, ": null
    },
    {
        "Athanasius Kircher": "Athanasius Kircher"
    },
    {
        " in the 17th, and ": null
    },
    {
        "Georg Zoëga": "Georg Zoëga"
    },
    {
        " in the 18th. ": null
    },
    {
        "Ray ": "Ray69"
    },
    {
        " pp.  20–24 The discovery of the Rosetta Stone in 1799 provided critical missing information, gradually revealed by a succession of scholars, that eventually allowed ": null
    },
    {
        "Jean-François Champollion": "Jean-François Champollion"
    },
    {
        " to solve the puzzle that ": null
    },
    {
        "Kircher": "Athanasius Kircher"
    },
    {
        " had called the ": null
    },
    {
        "riddle of the Sphinx": "Sphinxthe Riddle Of The Sphinx"
    },
    {
        ".                  The ": null
    },
    {
        "Greek": "Ancient Greek"
    },
    {
        " text on the Rosetta Stone provided the starting point. Ancient Greek was widely known to scholars, but they were not familiar with details of its use in the ": null
    },
    {
        "Hellenistic": "Koine Greek"
    },
    {
        " period as a government language in Ptolemaic Egypt; large-scale discoveries of Greek ": null
    },
    {
        "papyri": "Papyrus"
    },
    {
        " were a long way in the future. Thus, the earliest translations of the Greek text of the stone show the translators still struggling with the historical context and with administrative and religious jargon. ": null
    },
    {
        "Stephen Weston": "Stephen Weston"
    },
    {
        " verbally presented an English translation of the Greek text at a ": null
    },
    {
        "Society of Antiquaries": "Society Of Antiquaries Of London"
    },
    {
        " meeting in April 1802. ": null
    },
    {
        "Budge ": "Budge69"
    },
    {
        " p.  1 ": null
    },
    {
        "Andrews ": "Andrews69"
    },
    {
        " p.  13     Meanwhile, two of the lithographic copies made in Egypt had reached the ": null
    },
    {
        "Institut de France": "Institut De France"
    },
    {
        " in Paris in 1801. There, librarian and antiquarian ": null
    },
    {
        "Gabriel de La Porte du Theil": "Gabriel De La Porte Du Theil"
    },
    {
        " set to work on a translation of the Greek, but he was dispatched elsewhere on Napoleons orders almost immediately, and he left his unfinished work in the hands of colleague ": null
    },
    {
        "Hubert-Pascal Ameilhon": "Hubert-Pascal Ameilhon"
    },
    {
        ". Ameilhon produced the first published translations of the Greek text in 1803, in both ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " and French to ensure that they would circulate widely. At ": null
    },
    {
        "Cambridge": "Cambridge"
    },
    {
        ", ": null
    },
    {
        "Richard Porson": "Richard Porson"
    },
    {
        " worked on the missing lower right corner of the Greek text. He produced a skilful suggested reconstruction, which was soon being circulated by the Society of Antiquaries alongside its prints of the inscription. At almost the same moment, ": null
    },
    {
        "Christian Gottlob Heyne": "Christian Gottlob Heyne"
    },
    {
        " in ": null
    },
    {
        "Göttingen": "Göttingen"
    },
    {
        " was making a new Latin translation of the Greek text that was more reliable than Ameilhons and was first published in 1803. It was reprinted by the Society of Antiquaries in a special issue of its journal Archaeologia in 1811, alongside Westons previously unpublished English translation, ": null
    },
    {
        "Colonel Turners": "Tomkyns Hilgrove Turner"
    },
    {
        " narrative, and other documents. ": null
    },
    {
        "Budge ": "Budge70"
    },
    {
        " pp.  27–28 ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  22            At the time of the stones discovery, Swedish diplomat and scholar ": null
    },
    {
        "Johan David Åkerblad": "Johan David Åkerblad"
    },
    {
        " was working on a little-known script of which some examples had recently been found in Egypt, which came to be known as ": null
    },
    {
        "demotic": "Demotic"
    },
    {
        ". He called it cursive Coptic because he was convinced that it was used to record some form of the ": null
    },
    {
        "Coptic language": "Coptic Language"
    },
    {
        " , although it had few similarities with the later ": null
    },
    {
        "Coptic script": "Coptic Alphabet"
    },
    {
        ". French Orientalist ": null
    },
    {
        "Antoine-Isaac Silvestre de Sacy": "Antoine Isaac Silvestre De Sacy"
    },
    {
        " had been discussing this work with Åkerblad when he received one of the early lithographic prints of the Rosetta Stone in 1801 from ": null
    },
    {
        "Jean-Antoine Chaptal": "Jean-Antoine Chaptal"
    },
    {
        ", French minister of the interior. He realised that the middle text was in this same script. He and Åkerblad set to work, both focusing on the middle text and assuming that the script was alphabetical. They attempted to identify the points where Greek names ought to occur within this unknown text, by comparing it with the Greek. In 1802, Silvestre de Sacy reported to Chaptal that he had successfully identified five names , while Åkerblad published an alphabet of 29 letters that he had identified from the Greek names in the demotic text. They could not, however, identify the remaining characters in the demotic text, which, as is now known, included ": null
    },
    {
        "ideographic": "Ideogram"
    },
    {
        " and other symbols alongside the phonetic ones. ": null
    },
    {
        "Robinson ": "Robinson09"
    },
    {
        "Johan David Åkerblads": "Johan David Åkerblad"
    },
    {
        "table of demotic phonetic characters and their ": null
    },
    {
        "Coptic": "Coptic Alphabet"
    },
    {
        "             Silvestre de Sacy eventually gave up work on the stone, but he was to make another contribution. In 1811, prompted by discussions with a Chinese student about ": null
    },
    {
        "Chinese script": "Chinese Character"
    },
    {
        ", Silvestre de Sacy considered a suggestion made by ": null
    },
    {
        "Georg Zoëga": "Jörgen Zoega"
    },
    {
        " in 1797 that the foreign names in Egyptian hieroglyphic inscriptions might be written phonetically; he also recalled that as early as 1761, ": null
    },
    {
        "Jean-Jacques Barthélemy": "Jean-Jacques Barthélemy"
    },
    {
        " had suggested that the characters enclosed in ": null
    },
    {
        "cartouches": "Cartouche"
    },
    {
        "in hieroglyphic inscriptions were proper names. Thus, when ": null
    },
    {
        "Thomas Young": "Thomas Young"
    },
    {
        ", foreign secretary of the ": null
    },
    {
        "Royal Society of London": "Royal Society"
    },
    {
        ", wrote to him about the stone in 1814, Silvestre de Sacy suggested in reply that in attempting to read the hieroglyphic text, Young might look for cartouches that ought to contain Greek names and try to identify phonetic characters in them. ": null
    },
    {
        "Robinson ": "Robinson09"
    },
    {
        " p.  61     Young did so, with two results that together paved the way for the final decipherment. In the hieroglyphic text, he discovered the phonetic characters p t o l m e s  that were used to write the Greek name Ptolemaios . He also noticed that these characters resembled the equivalent ones in the demotic script, and went on to note as many as 80 similarities between the hieroglyphic and demotic texts on the stone, an important discovery because the two scripts were previously thought to be entirely different from one another. This led him to deduce correctly that the demotic script was only partly phonetic, also consisting of ideographic characters derived from hieroglyphs. Youngs new insights were prominent in the long article Egypt that he contributed to the  Encyclopædia Britannica  in 1819. He could make no further progress, however. ": null
    },
    {
        "Robinson ": "Robinson09"
    },
    {
        " pp.  61–64     In 1814, Young first exchanged correspondence about the stone with ": null
    },
    {
        "Jean-François Champollion": "Jean-François Champollion"
    },
    {
        ", a teacher at ": null
    },
    {
        "Grenoble": "Grenoble"
    },
    {
        " who had produced a scholarly work on ancient Egypt. Champollion saw copies of the brief hieroglyphic and Greek inscriptions of the ": null
    },
    {
        "Philae obelisk": "Philae Obelisk"
    },
    {
        " in 1822, on which ": null
    },
    {
        "William John Bankes": "William John Bankes"
    },
    {
        " had tentatively noted the names Ptolemaios and Kleopatra in both languages. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " p.  32 From this, Champollion identified the phonetic characters k l e o p a t r a . ": null
    },
    {
        "Budge ": "Budge69"
    },
    {
        " pp.  3–6 On the basis of this and the foreign names on the Rosetta Stone, he quickly constructed an alphabet of phonetic hieroglyphic characters, completing his work on 14 September and announcing it publicly on 27 September in a lecture to the  Académie royale des Inscriptions et Belles-Lettres .  On the same day he wrote the famous  Lettre à M. Dacier  to ": null
    },
    {
        "Bon-Joseph Dacier": "Bon-Joseph Dacier"
    },
    {
        ", secretary of the Académie, detailing his discovery. In the postscript Champollion notes that similar phonetic characters seemed to occur in both Greek and Egyptian names, a hypothesis confirmed in 1823, when he identified the names of pharaohs ": null
    },
    {
        "Ramesses": "Ramesses I"
    },
    {
        " and ": null
    },
    {
        "Thutmose": "Thutmose I"
    },
    {
        " written in cartouches at ": null
    },
    {
        "Abu Simbel": "Abu Simbel Temples"
    },
    {
        ". These far older hieroglyphic inscriptions had been copied by Bankes and sent to Champollion by ": null
    },
    {
        "Jean-Nicolas Huyot": "Jean-Nicolas Huyot"
    },
    {
        ". From this point, the stories of the Rosetta Stone and the ": null
    },
    {
        "decipherment of Egyptian hieroglyphs": "Decipherment Of Egyptian Hieroglyphs"
    },
    {
        " diverge, as Champollion drew on many other texts to develop an Ancient Egyptian grammar and a hieroglyphic dictionary which were published after his death in 1832. ": null
    },
    {
        "Dewachter ": "Dewachter90"
    },
    {
        " p.  45          Work on the stone now focused on fuller understanding of the texts and their contexts by comparing the three versions with one another. In 1824 Classical scholar ": null
    },
    {
        "Antoine-Jean Letronne": "Jean Antoine Letronne"
    },
    {
        " promised to prepare a new literal translation of the Greek text for Champollions use. Champollion in return promised an analysis of all the points at which the three texts seemed to differ. Following Champollions sudden death in 1832, his draft of this analysis could not be found, and Letronnes work stalled. ": null
    },
    {
        "François Salvolini": "Francesco Salvolini"
    },
    {
        ", Champollions former student and assistant, died in 1838, and this analysis and other missing drafts were found among his papers. This discovery incidentally demonstrated that Salvolinis own publication on the stone, published in 1837, was ": null
    },
    {
        "plagiarism": "Plagiarism"
    },
    {
        ". Letronne was at last able to complete his commentary on the Greek text and his new French translation of it, which appeared in 1841. During the early 1850s, German Egyptologists ": null
    },
    {
        "Heinrich Brugsch": "Heinrich Karl Brugsch"
    },
    {
        " and ": null
    },
    {
        "Max Uhlemann": "Max Uhlemann"
    },
    {
        " produced revised Latin translations based on the demotic and hieroglyphic texts. The first English translation followed in 1858, the work of three members of the ": null
    },
    {
        "Philomathean Society": "Philomathean Society"
    },
    {
        " at the ": null
    },
    {
        "University of Pennsylvania": "University Of Pennsylvania"
    },
    {
        ".     Whether one of the three texts was the standard version, from which the other two were originally translated, is a question that has remained controversial. Letronne attempted to show in 1841 that the Greek version, the product of the Egyptian government under the Macedonian ": null
    },
    {
        "Ptolemies": "Ptolemies"
    },
    {
        ", was the original. Among recent authors, John Ray has stated that the hieroglyphs were the most important of the scripts on the stone: they were there for the gods to read, and the more learned of their priesthood . Philippe Derchain and Heinz Josef Thissen have argued that all three versions were composed simultaneously, while Stephen Quirke sees in the decree an intricate coalescence of three vital textual traditions . ": null
    },
    {
        "Quirke and Andrews ": "Quirke69"
    },
    {
        " p.  10 ": null
    },
    {
        "Richard Parkinson": "Richard B. Parkinson"
    },
    {
        " points out that the hieroglyphic version strays from archaic formalism and occasionally lapses into language closer to that of the demotic register that the priests more commonly used in everyday life. ": null
    },
    {
        "Parkinson ": "Parkinson70"
    },
    {
        " p.  13 The fact that the three versions cannot be matched word for word helps to explain why the decipherment has been more difficult than originally expected, especially for those original scholars who were expecting an exact bilingual key to Egyptian hieroglyphs. ": null
    },
    {
        "Parkinson et al. ": "Parkinson69"
    },
    {
        " pp.  30–31            Even before the Salvolini affair, disputes over precedence and plagiarism punctuated the decipherment story. Thomas Youngs work is acknowledged in Champollions 1822 Lettre à M. Dacier, but incompletely, according to early British critics: for example, ": null
    },
    {
        "James Browne": "James Browne"
    },
    {
        ", a sub-editor on the Encyclopædia Britannica , anonymously contributed a series of review articles to the  Edinburgh Review  in 1823, praising Youngs work highly and alleging that the unscrupulous Champollion plagiarised it. ": null
    },
    {
        "Parkinson et al. ": "Parkinson99"
    },
    {
        " pp.  35–38 ": null
    },
    {
        "Robinson ": "Robinson09"
    },
    {
        " pp.  65–68 These articles were translated into French by ": null
    },
    {
        "Julius Klaproth": "Julius Klaproth"
    },
    {
        " and published in book form in 1827. Youngs own 1823 publication reasserted the contribution that he had made. The early deaths of Young and Champollion did not put an end to these disputes. In his work on the stone in 1904 ": null
    },
    {
        "E. A. Wallis Budge": "E. A. Wallis Budge"
    },
    {
        " gave special emphasis to Youngs contribution compared with Champollions. ": null
    },
    {
        "Budge ": "Budge70"
    },
    {
        " vol. 1 pp.  59–134 In the early 1970s, French visitors complained that the portrait of Champollion was smaller than one of Young on an adjacent information panel; English visitors complained that the opposite was true. The portraits were in fact the same size.       Calls for the Rosetta Stone to be returned to Egypt were made in July 2003 by ": null
    },
    {
        "Zahi Hawass": "Zahi Hawass"
    },
    {
        ", then Secretary-General of Egypts ": null
    },
    {
        "Supreme Council of Antiquities": "Supreme Council Of Antiquities"
    },
    {
        ". These calls, expressed in the Egyptian and international media, asked that the stele be ": null
    },
    {
        "repatriated": "Art Repatriation"
    },
    {
        " to Egypt, commenting that it was the icon of our Egyptian identity . ": null
    },
    {
        "Edwardes and Milner ": "Edwardes03"
    },
    {
        " He repeated the proposal two years later in Paris, listing the stone as one of several key items belonging to Egypts cultural heritage, a list which also included: the iconic ": null
    },
    {
        "bust of Nefertiti": "Nefertiti Bust"
    },
    {
        " in the ": null
    },
    {
        "Egyptian Museum of Berlin": "Egyptian Museum Of Berlin"
    },
    {
        "; a statue of the ": null
    },
    {
        "Great Pyramid": "Great Pyramid Of Giza"
    },
    {
        " architect ": null
    },
    {
        "Hemiunu": "Hemiunu"
    },
    {
        " in the ": null
    },
    {
        "Roemer-und-Pelizaeus-Museum": "Roemer-Und-Pelizaeus-Museum"
    },
    {
        " in ": null
    },
    {
        "Hildesheim": "Hildesheim"
    },
    {
        ", Germany; the ": null
    },
    {
        "Dendera Temple Zodiac": "Dendera Zodiac"
    },
    {
        " in the ": null
    },
    {
        "Louvre": "Louvre"
    },
    {
        " in Paris; and the ": null
    },
    {
        "bust of Ankhhaf": "Ankhhaf"
    },
    {
        " in the ": null
    },
    {
        "Museum of Fine Arts": "Museum Of Fine Arts, Boston"
    },
    {
        " in ": null
    },
    {
        "Boston": "Boston, Massachusetts"
    },
    {
        ".      In 2005, the British Museum presented Egypt with a full-sized fibreglass colour-matched replica of the stele. This was initially displayed in the renovated ": null
    },
    {
        "Rashid National Museum": "Rashid National Museum"
    },
    {
        ", an Ottoman house in the town of ": null
    },
    {
        "Rashid": "Rosetta"
    },
    {
        " , the closest city to the site where the stone was found. ": null
    },
    {
        " Rose of the Nile ": "Rose05"
    },
    {
        " In November 2005, Hawass suggested a three-month loan of the Rosetta Stone, while reiterating the eventual goal of a permanent return. ": null
    },
    {
        "Huttinger ": "Huttinger05"
    },
    {
        " In December 2009, he proposed to drop his claim for the permanent return of the Rosetta Stone if the British Museum lent the stone to Egypt for three months for the opening of the ": null
    },
    {
        "Grand Egyptian Museum": "Grand Egyptian Museum"
    },
    {
        " at ": null
    },
    {
        "Giza": "Giza"
    },
    {
        " in 2013. ": null
    },
    {
        " Antiquities wish list ": "Antiquities05"
    },
    {
        "          As ": null
    },
    {
        "John Ray": "John D. Ray"
    },
    {
        " has observed, the day may come when the stone has spent longer in the British Museum than it ever did in Rosetta. ": null
    },
    {
        "Ray ": "Ray69"
    },
    {
        " p.  4 There is strong opposition among national museums to the repatriation of objects of international cultural significance such as the Rosetta Stone. In response to repeated Greek requests for return of the ": null
    },
    {
        "Elgin Marbles": "Elgin Marbles"
    },
    {
        " from the ": null
    },
    {
        "Parthenon": "Parthenon"
    },
    {
        " and similar requests to other museums around the world, in 2002 over 30 of the worlds leading museums  — including the British Museum, the Louvre, the ": null
    },
    {
        "Pergamon Museum": "Pergamon Museum"
    },
    {
        " in Berlin and the ": null
    },
    {
        "Metropolitan Museum": "Metropolitan Museum Of Art"
    },
    {
        " in New York City  — issued a joint statement declaring that objects acquired in earlier times must be viewed in the light of different sensitivities and values reflective of that earlier era and that museums serve not just the citizens of one nation but the people of every nation . ": null
    },
    {
        "Bailey ": "Bailey03"
    },
    {
        "       Various ancient bilingual or even trilingual ": null
    },
    {
        "epigraphical": "Epigraphical"
    },
    {
        " documents have sometimes been described as Rosetta stones , as they permitted the decipherment of ancient written scripts. For example, the bilingual ": null
    },
    {
        "Greek": "Greek Script"
    },
    {
        "-": null
    },
    {
        "Brahmi": "Brahmi"
    },
    {
        " coins of the ": null
    },
    {
        "Greco-Bactrian": "Greco-Bactrian"
    },
    {
        " king ": null
    },
    {
        "Agathocles": "Agathocles Of Bactria"
    },
    {
        " have been described as little Rosetta stones , allowing to secure the first steps towards the decipherment of the ": null
    },
    {
        "Brahmi script": "Brahmi Script"
    },
    {
        " by ": null
    },
    {
        "Christian Lassen": "Christian Lassen"
    },
    {
        ", thus unlocking ancient ": null
    },
    {
        "Indian epigraphy": "Indian Epigraphy"
    },
    {
        ".  The ": null
    },
    {
        "Behistun inscription": "Behistun Inscription"
    },
    {
        " has also been compared to the Rosetta stone, as it links the translations of three ancient ": null
    },
    {
        "Middle-Eastern": "Middle-Eastern"
    },
    {
        " languages: ": null
    },
    {
        "Old Persian": "Old Persian"
    },
    {
        ", ": null
    },
    {
        "Elamite": "Elamite Language"
    },
    {
        ", and ": null
    },
    {
        "Babylonian": "Babylonian Language"
    },
    {
        ".      The term Rosetta stone has been also used ": null
    },
    {
        "idiom": "Idiom"
    },
    {
        "atically to represent a crucial key in the process of decryption of encoded information, especially when a small but representative sample is recognised as the clue to understanding a larger whole. ": null
    },
    {
        "Oxford English dictionary ": "Oup"
    },
    {
        " s.v.   According to the  Oxford English Dictionary , the first figurative use of the term appeared in the 1902 edition of the  Encyclopædia Britannica  relating to an entry on the chemical analysis of ": null
    },
    {
        "glucose": "Glucose"
    },
    {
        ". Another use of the phrase is found in ": null
    },
    {
        "H. G. Wells": "H. G. Wells"
    },
    {
        " 1933 novel  The Shape of Things to Come , where the protagonist finds a manuscript written in ": null
    },
    {
        "shorthand": "Shorthand"
    },
    {
        " that provides a key to understanding additional scattered material that is sketched out in both ": null
    },
    {
        "longhand": "Longhand"
    },
    {
        " and on ": null
    },
    {
        "typewriter": "Typewriter"
    },
    {
        ".     Since then, the term has been widely used in other contexts. For example, ": null
    },
    {
        "Nobel laureate": "Nobel Laureate"
    },
    {
        " Theodor W. Hänsch": "Theodor W. Hänsch"
    },
    {
        " in a 1979  Scientific American  article on ": null
    },
    {
        "spectroscopy": "Spectroscopy"
    },
    {
        " wrote that the spectrum of the hydrogen atoms has proved to be the Rosetta Stone of modern physics: once this pattern of lines had been deciphered much else could also be understood . Fully understanding the key set of genes to the ": null
    },
    {
        "human leucocyte antigen": "Human Leucocyte Antigen"
    },
    {
        " has been described as the Rosetta Stone of immunology . ": null
    },
    {
        " International Team ": "International"
    },
    {
        " The flowering plant  Arabidopsis thaliana  has been called the Rosetta Stone of flowering time . ": null
    },
    {
        "Simpson and Dean ": "Simpson02"
    },
    {
        " A ": null
    },
    {
        "Gamma ray burst": "Gamma-Ray Burst"
    },
    {
        " found in conjunction with a ": null
    },
    {
        "supernova": "Supernova"
    },
    {
        " has been called a Rosetta Stone for understanding the origin of GRBs. ": null
    },
    {
        "Cooper ": "Cooper10"
    },
    {
        " The technique of ": null
    },
    {
        "Doppler echocardiography": "Doppler Echocardiography"
    },
    {
        " has been called a Rosetta Stone for clinicians trying to understand the complex process by which the ": null
    },
    {
        "left ventricle": "Left Ventricle"
    },
    {
        " of the ": null
    },
    {
        "human heart": "Human Heart"
    },
    {
        " can be filled during various forms of ": null
    },
    {
        "diastolic dysfunction": "Diastolic Dysfunction"
    },
    {
        ". ": null
    },
    {
        "Nishimura and Tajik ": "Nishimura98"
    },
    {
        "     The name has also become used in various forms of ": null
    },
    {
        "translation software": "Machine Translation"
    },
    {
        ". ": null
    },
    {
        "Rosetta Stone": "Rosetta Stone"
    },
    {
        " is a brand of language-learning software published by Rosetta Stone Inc., headquartered in ": null
    },
    {
        "Arlington County": "Arlington County, Virginia"
    },
    {
        ", US. ": null
    },
    {
        "Rosetta": "Rosetta"
    },
    {
        " is the name of a lightweight dynamic translator that enables applications compiled for ": null
    },
    {
        "PowerPC": "Powerpc"
    },
    {
        " processors to run on Apple systems using an ": null
    },
    {
        "x86": "X86"
    },
    {
        " processor. Rosetta is an online language translation tool to help localisation of software, developed and maintained by ": null
    },
    {
        "Canonical": "Canonical Ltd."
    },
    {
        " as part of the ": null
    },
    {
        "Launchpad": "Launchpad"
    },
    {
        " project. Similarly, ": null
    },
    {
        "Rosetta@home": "Rosetta@Home"
    },
    {
        " is a ": null
    },
    {
        "distributed computing project": "Distributed Computing"
    },
    {
        " for predicting protein structures from amino acid sequences . The ": null
    },
    {
        "Rosetta Project": "Rosetta Project"
    },
    {
        " brings language specialists and native speakers together to develop a meaningful survey and near-permanent archive of 1,500 languages, intended to last from AD 2000 to 12,000. The ": null
    },
    {
        "European Space Agencys": "European Space Agency"
    },
    {
        "  Rosetta  spacecraft was launched to study the ": null
    },
    {
        "comet": "Comet"
    },
    {
        " 67P/Churyumov–Gerasimenko": "67P/Churyumov–Gerasimenko"
    },
    {
        " in the hope that determining its composition will reveal the origin of the ": null
    },
    {
        "Solar System": "Solar System"
    }
]