[
    {
        "          Rotterdam  is a ": null
    },
    {
        "city": "List Of Cities In The Netherlands By Province"
    },
    {
        " and ": null
    },
    {
        "municipality": "List Of Municipalities Of The Netherlands"
    },
    {
        " in the ": null
    },
    {
        "Netherlands": "Netherlands"
    },
    {
        ". It is the second-largest Dutch city after ": null
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        ", and is located in the ": null
    },
    {
        "province": "Provinces Of The Netherlands"
    },
    {
        " of ": null
    },
    {
        "South Holland": "South Holland"
    },
    {
        ", at the mouth of the ": null
    },
    {
        "Nieuwe Maas": "Nieuwe Maas"
    },
    {
        " channel leading into the ": null
    },
    {
        "Rhine–Meuse–Scheldt delta": "Rhine–Meuse–Scheldt Delta"
    },
    {
        " at the ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        ". Its history goes back to 1270, when a ": null
    },
    {
        "dam": "Dam"
    },
    {
        " was constructed in the ": null
    },
    {
        "Rotte": "Rotte"
    },
    {
        ", after which people settled around it for safety. In 1340, Rotterdam was granted city rights by the ": null
    },
    {
        "Count of Holland": "Count Of Holland"
    },
    {
        ".     A major logistic and economic centre, Rotterdam is ": null
    },
    {
        "Europes": "Europe"
    },
    {
        "largest ": null
    },
    {
        "port": "Port Of Rotterdam"
    },
    {
        ", and had previously been the largest port of the world for a long time. It has a population of 634,660 and is home to 174 nationalities. ,  CBS StatLine , 2015 1,404,963 Greater Rijnmond  1,173,272 Rotterdam Metro  1,033,629 Rotterdam Urban     634,660 Rotterdam Municipality  Rotterdam is known for its ": null
    },
    {
        "Erasmus University": "Erasmus University Rotterdam"
    },
    {
        ", its riverside setting, lively cultural life, maritime heritage and modern architecture. The near-complete destruction of the city centre in the ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        " Rotterdam Blitz": "German Bombing Of Rotterdam"
    },
    {
        " has resulted in a varied architectural landscape, including sky-scrapers designed by renowned architects such as ": null
    },
    {
        "Rem Koolhaas": "Rem Koolhaas"
    },
    {
        ", ": null
    },
    {
        "Piet Blom": "Piet Blom"
    },
    {
        " and ": null
    },
    {
        "Ben van Berkel": "Ben Van Berkel"
    },
    {
        ".       The ": null
    },
    {
        "Rhine": "Rhine"
    },
    {
        ", ": null
    },
    {
        "Meuse": "Meuse"
    },
    {
        " and ": null
    },
    {
        "Scheldt": "Scheldt"
    },
    {
        " give waterway access into the heart of Western Europe, including the highly industrialized ": null
    },
    {
        "Ruhr": "Ruhr"
    },
    {
        ". The extensive distribution system including rail, roads, and waterways have earned Rotterdam the nicknames Gateway to Europe and Gateway to the World .    Rotterdam will host the ": null
    },
    {
        "Eurovision Song Contest 2020": "Eurovision Song Contest 2020"
    },
    {
        ".               The settlement at the lower end of the ": null
    },
    {
        "fen": "Fen"
    },
    {
        " stream  Rotte   dates from at least 900 CE. Around 1150, large ": null
    },
    {
        "floods": "Flood"
    },
    {
        "in the area ended development, leading to the construction of protective ": null
    },
    {
        "dikes": "Levee"
    },
    {
        " and dams, including Schielands Hoge Zeedijk along the northern banks of the present-day Nieuwe Maas. A dam on the Rotte was built in the 1260s and was located at the present-day Hoogstraat .     On 7 July 1340, Count ": null
    },
    {
        "Willem IV of Holland": "William Ii, Count Of Hainaut"
    },
    {
        " granted ": null
    },
    {
        "city rights": "City Rights In The Low Countries"
    },
    {
        " to Rotterdam, whose population then was only a few thousand.  Around the year 1350, a shipping canal, the  Rotterdamse Schie  was completed, which provided Rotterdam access to the larger towns in the north, allowing it to become a local trans-shipment centre between the Netherlands, ": null
    },
    {
        "England": "England"
    },
    {
        " and ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", and to ": null
    },
    {
        "urbanize": "Urbanization"
    },
    {
        ".           The port of Rotterdam grew slowly but steadily into a port of importance, becoming the seat of one of the six chambers of the Vereenigde Oostindische Compagnie , the ": null
    },
    {
        "Dutch East India Company": "Dutch East India Company"
    },
    {
        ".     The greatest spurt of growth, both in port activity and population, followed the completion of the ": null
    },
    {
        "Nieuwe Waterweg": "Nieuwe Waterweg"
    },
    {
        " in 1872. The city and harbor started to expand on the south bank of the river. The  Witte Huis  or White House skyscraper,  inspired by American office buildings and built in 1898 in the French Château-style, is evidence of Rotterdams rapid growth and success. When completed, it was the tallest office building in Europe, with a height of .             During ": null
    },
    {
        "World War I": "World War I"
    },
    {
        ", the city was the worlds largest spy centre because of Dutch neutrality and its strategic location in between Britain, Germany and German-occupied Belgium. Many spies who were arrested and executed in Britain were led by German secret agents operating from Rotterdam. ": null
    },
    {
        "MI6": "Mi6"
    },
    {
        " had its main European office on de Boompjes. From there the British coordinated espionage in Germany and occupied Belgium. During World War I, an average of 25,000 Belgian refugees lived in the city, as well as hundreds of German deserters and escaped Allied prisoners of war. Ruis, Edwin. Spynest.British and German Espionage from Neutral Holland 1914–1918. Brimscombe: The History Press, 2016.     During ": null
    },
    {
        "World War II": "World War Ii"
    },
    {
        ", the German army invaded the Netherlands on 10 May 1940. . ": null
    },
    {
        "Adolf Hitler": "Adolf Hitler"
    },
    {
        " had hoped to conquer the country in just one day, but his forces met unexpectedly fierce resistance. The Dutch army was forced to capitulate on 15 May 1940, following the ": null
    },
    {
        "bombing of Rotterdam": "Rotterdam Blitz"
    },
    {
        " on 14 May and the threat of bombing of other Dutch cities.   The heart of Rotterdam was almost completely destroyed by the ": null
    },
    {
        "Luftwaffe": "Luftwaffe"
    },
    {
        ". Some 80,000 civilians were made homeless and 900 were killed; a relatively low number due to the fact that many had fled the city because of the warfare and bombing going on in Rotterdam since the start of the invasion three days earlier. The City Hall survived the bombing. ": null
    },
    {
        "Ossip Zadkine": "Ossip Zadkine"
    },
    {
        " later attempted to capture the event with his statue  De Verwoeste Stad  . The statue stands near the Leuvehaven, not far from the ": null
    },
    {
        "Erasmusbrug": "Erasmusbrug"
    },
    {
        " in the centre of the city, on the north shore of the river Nieuwe Maas.     Rotterdam was gradually rebuilt from the 1950s through to the 1970s. It remained quite windy and open until the city councils from the 1980s on began developing an active architectural policy. Daring and new styles of ": null
    },
    {
        "apartment": "Apartment"
    },
    {
        "s, office buildings and recreation facilities resulted in a more ": null
    },
    {
        "livable": "Quality Of Life"
    },
    {
        " city centre with a new skyline. In the 1990s, the ": null
    },
    {
        "Kop van Zuid": "Kop Van Zuid"
    },
    {
        " was built on the south bank of the river as a new business centre. Rotterdam was voted 2015 European City of the Year by the Academy of Urbanism. A Guardian profile of Rem Koolhaas begins If you put the last 50 years of architecture in a blender, and spat it out in building-sized chunks across the skyline, you would probably end up with something that looked a bit like Rotterdam.             Rotterdam is divided into a northern and a southern part by the river ": null
    },
    {
        "Nieuwe Maas": "Nieuwe Maas"
    },
    {
        ", connected by : the Beneluxtunnel; the Maastunnel; the  Erasmusbrug  ; a subway tunnel; the Willemsspoortunnel ; the  Willemsbrug  ; the Koninginnebrug ; and the  Van Brienenoordbrug  . The former railway lift ": null
    },
    {
        "bridge": "Bridge"
    },
    {
        " De Hef is preserved as a monument in lifted position between the Noordereiland and the south of Rotterdam.     The city centre is located on the northern bank of the Nieuwe Maas, although recent urban development has extended the centre to parts of southern Rotterdam known as De Kop van Zuid . From its inland core, Rotterdam reaches the ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        " by a swathe of predominantly harbour area.     Built mostly behind dikes, large parts of the Rotterdam are below sea level. For instance, the Prins Alexander Polder in the northeast of Rotterdam extends  below sea level, or rather below ": null
    },
    {
        "Normaal Amsterdams Peil": "Normaal Amsterdams Peil"
    },
    {
        " or Amsterdam Ordnance Datum. The lowest point in the Netherlands  is situated just to the east of Rotterdam, in the municipality of ": null
    },
    {
        "Nieuwerkerk aan den IJssel": "Nieuwerkerk Aan Den Ijssel"
    },
    {
        ".        The ": null
    },
    {
        "Rotte": "Rotte"
    },
    {
        " river no longer joins the Nieuwe Maas directly. Since the early 1980s, when the construction of Rotterdam’s second subway line interfered with the Rotte’s course, its waters have been pumped through a pipe into the Nieuwe Maas via the Boerengat.      Between the summers of 2003 and 2008, an artificial ": null
    },
    {
        "beach": "Beach"
    },
    {
        " was created at the Boompjeskade along the Nieuwe Maas, between the Erasmus Bridge and the Willems Bridge. ": null
    },
    {
        "Swimming": "Human Swimming"
    },
    {
        " was not possible, digging pits was limited to the height of the layer of ": null
    },
    {
        "sand": "Sand"
    },
    {
        ", about . Alternatively people go the beach of ": null
    },
    {
        "Hoek van Holland": "Hook Of Holland"
    },
    {
        " or one of the beaches in ": null
    },
    {
        "Zeeland": "Zeeland"
    },
    {
        "Renesse": "Renesse"
    },
    {
        " or the ": null
    },
    {
        "Zuid Hollandse Eilanden": "Zuid Hollandse Eilanden"
    },
    {
        "Ouddorp": "Ouddorp"
    },
    {
        ", ": null
    },
    {
        "Oostvoorne": "Oostvoorne"
    },
    {
        ".     Rotterdam forms the centre of the ": null
    },
    {
        "Rijnmond": "Rijnmond"
    },
    {
        " conurbation, bordering the conurbation surrounding ": null
    },
    {
        "The Hague": "The Hague"
    },
    {
        " to the north-west. The two conurbations are close enough to be a single conurbation. They share the ": null
    },
    {
        "Rotterdam The Hague Airport": "Rotterdam The Hague Airport"
    },
    {
        " and a light rail system called ": null
    },
    {
        "RandstadRail": "Randstadrail"
    },
    {
        ". Consideration is being given to creating an official Metropolitan region Rotterdam The Hague , which would have a combined population approaching 2.5 million.     On its turn, the Rijnmond conurbation is part of the southern wing  of the ": null
    },
    {
        "Randstad": "Randstad"
    },
    {
        ", which is one of the most important economic and densely populated areas in the north-west of Europe. Having a population of 7.1 million, the Randstad is the ": null
    },
    {
        "sixth-largest": "List Of Metropolitan Areas In Europe"
    },
    {
        " urban area": "Urban Area"
    },
    {
        " in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        " . The Zuidvleugel, situated in the province of ": null
    },
    {
        "South Holland": "South Holland"
    },
    {
        ", has a population of around 3 million.       Rotterdam experiences a temperate ": null
    },
    {
        "oceanic climate": "Oceanic Climate"
    },
    {
        "  similar to all of the coastal areas in Netherlands. Located near to the coast, its climate is slightly milder than locations further inland. Winters are cool with frequent cold days, while the summers are mild to warm, with occasional hot temperatures. Temperatures above 30  °C are not rare during summer, while temperatures rarely drop below -5  °C during winter. The following climate box is from the airport, which is slightly cooler than the city, being surrounded by water canals which make the climate milder and with a higher ": null
    },
    {
        "Relative Humidity": "Relative Humidity"
    },
    {
        ". The city experiences the ": null
    },
    {
        "Urban heat island": "Urban Heat Island"
    },
    {
        " effect, especially inside the city centre.                      Overall the demographics differ per city area. According to a recent area analysis, the city centre has a singles population of 70%, between the ages of 20 and 40,  considerably more than other city areas. Also the city centre has a much larger population of people with higher education and higher income. Nonetheless, 80% of the homes are rented, not owned. The city centre also has a higher percentage of foreign-born citizens. The majority of shops are also run by foreign-born citizens. Gebiedsanalyse 2006, Centrumgebied, Gemeente Rotterdam. Page 7 and 9.          The ": null
    },
    {
        "municipality": "Municipality"
    },
    {
        " of Rotterdam is part of the ": null
    },
    {
        "Rotterdam-The Hague Metropolitan Area": "Rotterdam–The Hague Metropolitan Area"
    },
    {
        " which, as of 2015, covers an area of 1,130  km 2 , of which 990  km  km 2 is land, and has a population of approximately 2,563,197. As of 2019, the municipality itself occupies an area of 325.79  km 2 , 208.80  km 2 of which is land, and is home to 638,751 inhabitants.  Its population peaked at 731,564 in 1965, but the dual processes of ": null
    },
    {
        "suburbanization": "Suburbanization"
    },
    {
        " and ": null
    },
    {
        "counterurbanization": "Counterurbanization"
    },
    {
        " saw this number steadily decline over the next 2 decades, reaching 560,000 by 1985.   Although Rotterdam has experienced population growth since then, it has done so at a slower pace than comparable cities in the Netherlands, like Amsterdam, The Hague and Utrecht .     Rotterdam consists of 14 submunicipalities: ": null
    },
    {
        "Centrum": "Rotterdam Centrum"
    },
    {
        ", ": null
    },
    {
        "Charlois": "Charlois"
    },
    {
        " , ": null
    },
    {
        "Delfshaven": "Delfshaven"
    },
    {
        ", ": null
    },
    {
        "Feijenoord": "Feijenoord District"
    },
    {
        ", ": null
    },
    {
        "Hillegersberg-Schiebroek": "Hillegersberg-Schiebroek"
    },
    {
        ", ": null
    },
    {
        "Hoek van Holland": "Hook Of Holland"
    },
    {
        ", ": null
    },
    {
        "Hoogvliet": "Hoogvliet"
    },
    {
        ", ": null
    },
    {
        "IJsselmonde": "Ijsselmonde, Rotterdam"
    },
    {
        ", ": null
    },
    {
        "Kralingen-Crooswijk": "Kralingen-Crooswijk"
    },
    {
        ", ": null
    },
    {
        "Noord": "Noord, Rotterdam"
    },
    {
        ", ": null
    },
    {
        "Overschie": "Overschie"
    },
    {
        ", ": null
    },
    {
        "Pernis": "Pernis, Netherlands"
    },
    {
        ", and ": null
    },
    {
        "Prins Alexander": "Prins Alexander"
    },
    {
        " . One other area, ": null
    },
    {
        "Rozenburg": "Rozenburg"
    },
    {
        ", does have an official submunicipality status since 18 March 2010.     The current size of the municipality of Rotterdam is the result of the amalgamation of the following former municipalities,  some of which now are a submunicipality:     ": null
    },
    {
        "Delfshaven": "Delfshaven"
    },
    {
        "   Charlois": "Charlois"
    },
    {
        "   Kralingen": "Kralingen"
    },
    {
        "   Hoogvliet": "Hoogvliet"
    },
    {
        "   Pernis": "Pernis, Netherlands"
    },
    {
        "   Hillegersberg": "Hillegersberg"
    },
    {
        "   IJsselmonde": "Ijsselmonde, Rotterdam"
    },
    {
        "   Overschie": "Overschie"
    },
    {
        "   Schiebroek": "Schiebroek"
    },
    {
        "   Rozenburg": "Rozenburg"
    },
    {
        "       In the Netherlands, Rotterdam has the highest percentage of foreigners from non-industrialised nations. They form a large part of Rotterdams multi ethnic and multicultural diversity. 50.3% of the population are of non Dutch origins or have at least one parent born outside the country. There are 80,000 Muslims, constituting 13% of the population.  The mayor of Rotterdam, ": null
    },
    {
        "Ahmed Aboutaleb": "Ahmed Aboutaleb"
    },
    {
        ", is of Moroccan descent and is a practicing Muslim. The city is home to the largest Dutch Antillean community. The city also has its own ": null
    },
    {
        "China Town": "Chinatown"
    },
    {
        " at the West-Kruiskade, close to Rotterdam Centraal.          Christianity is the largest religion in Rotterdam, with 31.1% of the population identifying. The second and third largest religions are Islam and Hinduism , while about half of the population has no religious affiliation.     Since 1795 Rotterdam has hosted the chief congregation of the liberal Protestant brotherhood of ": null
    },
    {
        "Remonstrants": "Remonstrants"
    },
    {
        ". From 1955 it has been the see of the ": null
    },
    {
        "bishop of Rotterdam": "Bishop Of Rotterdam"
    },
    {
        " when the Rotterdam diocese was split from the ": null
    },
    {
        "Haarlem diocese": "Roman Catholic Diocese Of Haarlem-Amsterdam"
    },
    {
        ". Since 2010 the city is home to the largest mosque in the Netherlands, ": null
    },
    {
        "the Essalam mosque": ":Nl:Essalammoskee"
    },
    {
        ", .            Rotterdam has always been one of the main centres of the shipping industry in the Netherlands. From the Rotterdam Chamber of the ": null
    },
    {
        "VOC": "Dutch East India Company"
    },
    {
        ", the worlds first multinational, established in 1602, to the merchant shipping leader Royal ": null
    },
    {
        "Nedlloyd": "Nedlloyd"
    },
    {
        " established in 1970, with its corporate headquarters located in the landmark building the Willemswerf in 1988.  In 1997, Nedlloyd merged with the British shipping industry leader P & O forming the third largest merchant shipping company in the world. The Anglo-Dutch ": null
    },
    {
        "P & O Nedlloyd": "P & O Nedlloyd"
    },
    {
        " was bought by the Danish giant corporation AP Moller ": null
    },
    {
        "Maersk": "A. P. Moller-Maersk Group"
    },
    {
        " in 2005 and its Dutch operations are still headquartered in the Willemswerf.     Nowadays, well-known companies with headquarters in Rotterdam are consumers goods company ": null
    },
    {
        "Unilever": "Unilever"
    },
    {
        ", asset management firm ": null
    },
    {
        "Robeco": "Robeco"
    },
    {
        ", energy company ": null
    },
    {
        "Eneco": "Eneco Energie"
    },
    {
        ", dredging company ": null
    },
    {
        "Van Oord": "Van Oord"
    },
    {
        ", oil company ": null
    },
    {
        "Shell Downstream": "Shell Downstream"
    },
    {
        ", terminal operator ": null
    },
    {
        "Vopak": "Vopak"
    },
    {
        ", commodity trading company ": null
    },
    {
        "Vitol": "Vitol"
    },
    {
        " and architecture firm ": null
    },
    {
        "Office for Metropolitan Architecture": "Office For Metropolitan Architecture"
    },
    {
        ".   It is also home to the regional headquarters of chemical company ": null
    },
    {
        "LyondellBasell": "Lyondellbasell"
    },
    {
        ", commodities trading company ": null
    },
    {
        "Glencore": "Glencore"
    },
    {
        ", pharmaceutical company ": null
    },
    {
        "Pfizer": "Pfizer"
    },
    {
        ", logistics companies ": null
    },
    {
        "Stolt-Nielsen": "Stolt-Nielsen"
    },
    {
        ", electrical equipment company ": null
    },
    {
        "ABB Group": "Abb Group"
    },
    {
        " and consumer goods company ": null
    },
    {
        "Procter & Gamble": "Procter  &  Gamble"
    },
    {
        ". Furthermore, Rotterdam has the Dutch headquarters of ": null
    },
    {
        "Allianz": "Allianz"
    },
    {
        ", ": null
    },
    {
        "Maersk": "Maersk"
    },
    {
        ", ": null
    },
    {
        "Petrobras": "Petrobras"
    },
    {
        ", ": null
    },
    {
        "Samskip": "Samskip"
    },
    {
        ", ": null
    },
    {
        "Louis Dreyfus Group": "Louis Dreyfus Group"
    },
    {
        ", ": null
    },
    {
        "Aon": "Aon"
    },
    {
        " and ": null
    },
    {
        "MP Objects": "Mp Objects"
    },
    {
        ".     The City of Rotterdam makes use of the services of semi-government companies": null
    },
    {
        "Roteb": "Roteb"
    },
    {
        " and students of Rotterdam Business school   and the Port of Rotterdam Authority . Both these companies were once municipal bodies, now they are autonomous entities, owned by the City.     Being the largest port and one of the largest cities of the country, Rotterdam attracts many people seeking jobs, especially in the cheap labour segment. The citys unemployment rate is 12%, almost twice the national average.                   Rotterdam is the largest ": null
    },
    {
        "port": "Port"
    },
    {
        " in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ", with the rivers ": null
    },
    {
        "Meuse": "Meuse"
    },
    {
        " and ": null
    },
    {
        "Rhine": "Rhine"
    },
    {
        " providing excellent access to the ": null
    },
    {
        "hinterland": "Hinterland"
    },
    {
        " upstream reaching to ": null
    },
    {
        "Basel, Switzerland": "Basel"
    },
    {
        " and into France. In 2004 ": null
    },
    {
        "Shanghai": "Shanghai"
    },
    {
        " took over as the ": null
    },
    {
        "worlds busiest port": "Worlds Busiest Port"
    },
    {
        ". In 2006, Rotterdam was the worlds seventh largest ": null
    },
    {
        "container port": "Containerization"
    },
    {
        " in terms of ": null
    },
    {
        "twenty-foot equivalent units": "Twenty-Foot Equivalent Unit"
    },
    {
        " handled.      The ports main activities are ": null
    },
    {
        "petrochemical": "Petrochemical"
    },
    {
        " industries and general ": null
    },
    {
        "cargo": "Cargo"
    },
    {
        " handling and ": null
    },
    {
        "transshipment": "Transshipment"
    },
    {
        ". The harbour functions as an important transit point for ": null
    },
    {
        "bulk": "Bulk Material Handling"
    },
    {
        " materials between the European continent and overseas. From Rotterdam goods are transported by ship, river barge, train or road. In 2007, the  Betuweroute , a new fast freight ": null
    },
    {
        "railway": "Rail Transport"
    },
    {
        " from Rotterdam to ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", was completed.       Well-known streets in Rotterdam are the Lijnbaan , the Hoogstraat, the Coolsingel with the city hall, and the Weena, which runs from the Central Station to the Hofplein . A modern shopping venue is the Beurstraverse , better known by its informal name ": null
    },
    {
        "Koopgoot": "Koopgoot"
    },
    {
        " , which crosses the Coolsingel below street level": null
    },
    {
        "othing retail": "Othing Retail"
    },
    {
        "tterd": "Tterd"
    },
    {
        "EURamong others": null
    },
    {
        "udent associati": "Udent Associati"
    },
    {
        "generalfor childrenclinical, pre-clinical & health, 2017Universities of applied sciencesuni for music and danceAmerican International School of the Hague": null
    },
    {
        "American International School of Rotterdam": "American International School Of Rotterdam"
    },
    {
        "IBincluding the new Luxor": null
    },
    {
        "tterd": "Tterd"
    },
    {
        "which featured ": null
    },
    {
        "Jefferson Airplane": "Jefferson Airplane"
    },
    {
        ", ": null
    },
    {
        "The Byrds": "The Byrds"
    },
    {
        ", ": null
    },
    {
        "Canned Heat": "Canned Heat"
    },
    {
        ", ": null
    },
    {
        "Its a Beautiful Day": "Its A Beautiful Day"
    },
    {
        ", and ": null
    },
    {
        "Santana": "Santana"
    },
    {
        "RotterdamAmsterdamThe HagueRTC": null
    },
    {
        "ganizati": "Ganizati"
    },
    {
        "Rem Koolhaas": "Rem Koolhaas"
    },
    {
        "Netherlands Architecture Institute": "Netherlands Architecture Institute"
    },
    {
        "in Dutch ": null
    },
    {
        "Witte Huis": "Witte Huis"
    },
    {
        "192919091936": null
    },
    {
        "tterd": "Tterd"
    },
    {
        "tterd": "Tterd"
    },
    {
        "Rem Koolhaas": "Rem Koolhaas"
    },
    {
        "19962,600  ftthe Swan": null
    },
    {
        "tterd": "Tterd"
    },
    {
        "Netherlands Architecture Institute": "Netherlands Architecture Institute"
    },
    {
        "City of SportsMonaco at the Meusecurrent ": null
    },
    {
        "Champions league": "Uefa Champions League"
    },
    {
        "the Tubfounded 1902Feyenoord AmateursASO": null
    },
    {
        "wing cl": "Wing Cl"
    },
    {
        "seba": "Seba"
    },
    {
        "1907–1992sister ": null
    },
    {
        "rn 19": "Rn 19"
    },
    {
        "Summercarnavalsix-day track-cycling race27 Aprilsecond weekend of July Romantic music festival": null
    },
    {
        "ring road": "Ring Road"
    },
    {
        "therlan": "Therlan"
    },
    {
        "Ring North ": null
    },
    {
        "therlan": "Therlan"
    },
    {
        "Ring East- ": null
    },
    {
        "Antwerp": "Antwerp"
    },
    {
        " – ": null
    },
    {
        "Paris": "Paris"
    },
    {
        "therlan": "Therlan"
    },
    {
        "Ring South ": null
    },
    {
        "therlan": "Therlan"
    },
    {
        "Ring West- ": null
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        "therlan": "Therlan"
    },
    {
        "Amsterdam": "Amsterdam"
    },
    {
        " - ": null
    },
    {
        "therlan": "Therlan"
    },
    {
        "Antwerp": "Antwerp"
    },
    {
        " -formerly known as Zestienhoven": null
    },
    {
        "issing": "Issing"
    },
    {
        "also international trains to ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        "/": null
    },
    {
        "France": "France"
    },
    {
        "reopened as a metro line in 2019    norththe eastnorth-westnorth-eastsouth westsouth easteither direct or via a detourDutch RailwaysDutch Railways": null
    },
    {
        "Rotterdamse Elektrische Tram": "Rotterdamse Elektrische Tram"
    },
    {
        "A, B and CD and ERandstadrail": null
    },
    {
        "fore the Hoek van Holland extension in 20": "Fore The Hoek Van Holland Extension In 20"
    },
    {
        " RotterdamRotterdamruns only to the southern part of the cityRotterdamRotterdamRotterdamRotterdamRotterdamRotterdamRotterdamSchiedamRotterdamRotterdamRotterdamVlaardingenRotterdamRotterdamBarendrechtThe Castle, Sparta Stadiumpea soupice creamLine 20 since 1985since 1976since 1958since 1976since 1988since 1958since 1977since 1983since 1958since 1958since 1979since 1984since 1958 since 1940since 1945since 1991since 1991since 1950since 1991since 1936since 1983since 1961since 1984since 1945since 1991 since 1967since 1987since 1969since 1989  183518391998 film": null
    },
    {
        "ason": "Ason"
    },
    {
        " Guess Whos Coming to the Wedding? ": null
    },
    {
        " Anywhe": "Anywhe"
    }
]