[
    {
        "              Roy Kelton Orbison was an American singer, songwriter, and musician known for his impassioned singing style, complex song structures, and dark, emotional ballads. Many critics described his music as ": null
    },
    {
        "operatic": "Operatic"
    },
    {
        ", nicknaming him the ": null
    },
    {
        "Caruso": "Enrico Caruso"
    },
    {
        " of Rock": "Honorific Nicknames In Popular Musico"
    },
    {
        " and the Big O . While most male ": null
    },
    {
        "rock-and-roll": "Rock And Roll"
    },
    {
        " performers in the 1950s and 1960s projected a defiant masculinity, many of Orbisons songs conveyed vulnerability. He performed standing still, wearing black clothes to match his dyed black hair and dark sunglasses.     Orbison began singing in a ": null
    },
    {
        "rockabilly": "Rockabilly"
    },
    {
        " and ": null
    },
    {
        "country-and-western": "Country Music"
    },
    {
        " band in high school. He was signed by ": null
    },
    {
        "Sam Phillips": "Sam Phillips"
    },
    {
        ", of ": null
    },
    {
        "Sun Records": "Sun Records"
    },
    {
        ", in 1956, but his greatest success came with ": null
    },
    {
        "Monument Records": "Monument Records"
    },
    {
        ". From 1960 to 1966, 22 of his singles reached the  Billboard  Top 40, and he wrote or co-wrote almost all that rose to the Top 10, including ": null
    },
    {
        "Only the Lonely": "Only The Lonely"
    },
    {
        " , ": null
    },
    {
        "Running Scared": "Running Scared"
    },
    {
        " , ": null
    },
    {
        "Crying": "Crying"
    },
    {
        " , ": null
    },
    {
        "In Dreams": "In Dreams"
    },
    {
        " , and ": null
    },
    {
        "Oh, Pretty Woman": "Oh, Pretty Woman"
    },
    {
        " . Soon afterward, he was struck by a number of personal tragedies while his record sales declined.     In the 1980s, Orbison experienced a resurgence in popularity following the success of several ": null
    },
    {
        "cover versions": "Cover Version"
    },
    {
        " of his songs. In 1988, he co-founded the ": null
    },
    {
        "Traveling Wilburys": "Traveling Wilburys"
    },
    {
        ", a rock ": null
    },
    {
        "supergroup": "Supergroup"
    },
    {
        ", with ": null
    },
    {
        "George Harrison": "George Harrison"
    },
    {
        ", ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        ", ": null
    },
    {
        "Tom Petty": "Tom Petty"
    },
    {
        ", and ": null
    },
    {
        "Jeff Lynne": "Jeff Lynne"
    },
    {
        ". Orbison died of a heart attack in December 1988 at the age of 52. One month later, Orbisons song ": null
    },
    {
        "You Got It": "You Got It"
    },
    {
        " , co-written with Lynne and Petty, was released as a solo single and became his first hit to reach the U.S. Top 10 in nearly 25 years.     Orbisons honors include inductions into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "Rock And Roll Hall Of Fame"
    },
    {
        " in 1987, the ": null
    },
    {
        "Nashville Songwriters Hall of Fame": "Nashville Songwriters Hall Of Fame"
    },
    {
        " in the same year, the ": null
    },
    {
        "Songwriters Hall of Fame": "Songwriters Hall Of Fame"
    },
    {
        " in 1989, and the ": null
    },
    {
        "Musicians Hall of Fame and Museum": "Musicians Hall Of Fame And Museum"
    },
    {
        " in 2014.  Rolling Stone  placed him at number 37 on their list of the Greatest Artists of All Time and number 13 on their list of the 100 Greatest Singers of All Time. In 2002, Billboard magazine listed Orbison at number 74 in the Top 600 recording artists.            Orbison was born in ": null
    },
    {
        "Vernon, Texas": "Vernon, Texas"
    },
    {
        ", the middle son of Orbie Lee Orbison , an oil well driller and car mechanic, and Nadine Vesta Shults ,  a nurse. After the ": null
    },
    {
        "Great Depression": "Great Depression"
    },
    {
        ", the family moved to ": null
    },
    {
        "Fort Worth": "Fort Worth, Texas"
    },
    {
        " in 1942 to find work in the aircraft factories.  Orbison’s direct paternal ancestor was Thomas Orbison from ": null
    },
    {
        "Lurgan": "Lurgan"
    },
    {
        ", ": null
    },
    {
        "County Armagh": "County Armagh"
    },
    {
        ", ": null
    },
    {
        "Ulster": "Ulster"
    },
    {
        ", Ireland, who settled in ": null
    },
    {
        "Pennsylvania Colony": "Pennsylvania Colony"
    },
    {
        " in the mid-18th century.  - By John Kruth     Roy attended Denver Avenue Elementary School  until a polio scare prompted the family to return to Vernon, and then, in 1946, to ": null
    },
    {
        "Wink, Texas": "Wink, Texas"
    },
    {
        ". Orbison later described life in Wink as football, oil fields, oil, grease, and sand Escott, Colin . Biographical insert with The Legendary Roy Orbison CD box set. Sony. ASIN: B0000027E2. and expressed relief that he was able to leave the desolate town.  All the Orbison children had poor eyesight; Roy used thick corrective lenses from an early age. He was self-conscious about his appearance and began dyeing his nearly-white hair black when he was still young. Clayson, Alan, p. 3. He was quiet, self-effacing, and remarkably polite and obliging. Clayson, Alan, pp. 3, 9. He was always keen to sing, however. He considered his voice memorable, but not great.     On Roys sixth birthday, his father gave him a guitar. He later recalled that by the age of seven, I was finished, you know, for anything else ; music would be his life. Clayson, Alan, p. 7. His major musical influence as a youth was country music. He was particularly moved by ": null
    },
    {
        "Lefty Frizzells": "Lefty Frizzell"
    },
    {
        " singing, with its slurred syllables. Clayson, Alan, p. 21. . He also enjoyed ": null
    },
    {
        "Hank Williams": "Hank Williams"
    },
    {
        " and ": null
    },
    {
        "Jimmie Rodgers": "Jimmie Rodgers"
    },
    {
        ". One of the first musicians he heard in person was ": null
    },
    {
        "Ernest Tubb": "Ernest Tubb"
    },
    {
        ", playing on the back of a truck in Fort Worth. In West Texas, he was exposed to many forms of music: sepia , ": null
    },
    {
        "Tex-Mex": "Tejano Music"
    },
    {
        ", the orchestral arrangements of ": null
    },
    {
        "Mantovani": "Mantovani"
    },
    {
        ", and ": null
    },
    {
        "cajun": "Cajun"
    },
    {
        ". The cajun favorite ": null
    },
    {
        "Jole Blon": "Jole Blon"
    },
    {
        " was one of the first songs he sang in public. At the age of eight, he began singing on a local radio show. By the late 1940s, he was the shows host. Amburn, pp. 8, 9.     In high school, Orbison and some friends formed a band, the Wink Westerners. They played country standards and ": null
    },
    {
        "Glenn Miller": "Glenn Miller"
    },
    {
        " songs at local honky-tonks and had a weekly radio show on ": null
    },
    {
        "KERB": "Kerb"
    },
    {
        " in ": null
    },
    {
        "Kermit": "Kermit, Texas"
    },
    {
        ".  When they were offered $400 to play at a dance , Orbison realized he could make a living in music. After graduating from ": null
    },
    {
        "Wink High School": "Wink High School"
    },
    {
        ", he enrolled at ": null
    },
    {
        "North Texas State College": "University Of North Texas"
    },
    {
        " in ": null
    },
    {
        "Denton": "Denton, Texas"
    },
    {
        ", planning to study geology so that he could secure work in the oil fields if music did not pay. Amburn, pp. 29–30. When he heard that his schoolmate ": null
    },
    {
        "Pat Boone": "Pat Boone"
    },
    {
        " had signed a record deal, it further strengthened his resolve to become a professional musician. While at North Texas State College, Roy heard a song called Ooby Dooby , composed by ": null
    },
    {
        "Dick Penner": "Dick Penner"
    },
    {
        " and Wade Moore, and after his first year of college, he returned to Wink with Ooby Dooby in hand and continued performing with the Wink Westerners. Orbison then enrolled in ": null
    },
    {
        "Odessa Junior College": "Odessa College"
    },
    {
        ". As two members of the band quit, two new members were added, and the group won a talent contest and obtained their own television show on KMID-TV in Midland, Texas. The Wink Westerners kept performing on local TV, played dances on the weekends, and attended college during the day.     While living in Odessa, Orbison saw a performance by ": null
    },
    {
        "Elvis Presley": "Elvis Presley"
    },
    {
        ". ": null
    },
    {
        "Johnny Cash": "Johnny Cash"
    },
    {
        " toured the area in 1955 and 1956, appearing on the same local TV show as the Wink Westerners, and suggested that Orbison approach Sam Phillips at Sun Records. Orbison did so and was told, Johnny Cash doesnt run my record company!  The success of their KMID television show got them another show on KOSA-TV, and they changed their name to the Teen Kings. Due to the rejection from Sam Phillips, the Teen Kings recorded Ooby Dooby in 1956 for the Odessa-based ": null
    },
    {
        "Je–Wel": "Je–Wel"
    },
    {
        " label.  After the local record store owner Poppa Holifield played it for him over the telephone, Sam Phillips offered the Teen Kings a contract.               The Teen Kings went to ": null
    },
    {
        "Sun Studio": "Sun Studio"
    },
    {
        " in ": null
    },
    {
        "Memphis": "Memphis, Tennessee"
    },
    {
        ", where Phillips wanted to record Ooby Dooby again, in his studio. The song was released on Sun 242 in May 1956 and broke into the ": null
    },
    {
        "Billboard Hot 100": "Billboard Hot 100"
    },
    {
        ", peaking at number 59 and selling 200,000 copies. The Teen Kings toured with ": null
    },
    {
        "Sonny James": "Sonny James"
    },
    {
        ", ": null
    },
    {
        "Johnny Horton": "Johnny Horton"
    },
    {
        ", Carl Perkins, and Cash. Much influenced by Elvis Presley, Orbison performed frenetically, doing everything we could to get applause because we had only one hit record . Clayson, Alan p. 44. The Teen Kings also began writing songs in a rockabilly style, including ": null
    },
    {
        "Go! Go! Go!": "Go Go Go"
    },
    {
        " and Rockhouse . The band ultimately split over disputed writing credits and royalties, but Orbison stayed in Memphis and asked his 16-year-old girlfriend, Claudette Frady, to join him there. They stayed in Phillipss home, sleeping in separate rooms. In the studio, Orbison concentrated on the mechanics of recording. Phillips remembered being much more impressed with Orbisons mastery of the guitar than with his voice. Amburn, pp. 60–61. A ballad Orbison wrote, The Clown , met with a lukewarm response; after hearing it, Sun Records producer ": null
    },
    {
        "Jack Clement": "Jack Clement"
    },
    {
        " told Orbison that he would never make it as a ballad singer. Clayson, Alan, p. 45.     Orbison was introduced to Elvis Presleys social circle, once going to pick up a date for Presley in his purple Cadillac. Orbison wrote Claudette —about Claudette Frady, whom he married in 1957—and the ": null
    },
    {
        "Everly Brothers": "Everly Brothers"
    },
    {
        " recorded it as the B-side of ": null
    },
    {
        "All I Have to Do Is Dream": "All I Have To Do Is Dream"
    },
    {
        " . The first, and perhaps only, royalties Orbison earned from Sun Records enabled him to make a down payment on his own Cadillac. Increasingly frustrated at Sun, he gradually stopped recording. He toured music circuits around Texas and then quit performing for seven months in 1958. Clayson, Alan, p. 56.     For a brief period in the late 1950s, Orbison made his living at ": null
    },
    {
        "Acuff-Rose": "Acuff-Rose Music"
    },
    {
        ", a songwriting firm concentrating mainly on country music. After spending an entire day writing a song, he would make several demonstration tapes at a time and send them to ": null
    },
    {
        "Wesley Rose": "Wesley Rose"
    },
    {
        ", who would try to find musical acts to record them. Orbison attempted to sell to ": null
    },
    {
        "RCA Victor": "Rca Records"
    },
    {
        " his recordings of songs by other writers, working with and being in awe of ": null
    },
    {
        "Chet Atkins": "Chet Atkins"
    },
    {
        ", who had played guitar with Presley. One song he tried was Seems to Me , by ": null
    },
    {
        "Boudleaux Bryant": "Felice And Boudleaux Bryant"
    },
    {
        ". Bryants impression of Orbison was of a timid, shy kid who seemed to be rather befuddled by the whole music scene. I remember the way he sang then—softly, prettily but almost bashfully, as if someone might be disturbed by his efforts and reprimand him. Clayson, Alan, p. 62.     Playing shows at night and living with his wife and young child in a tiny apartment, Orbison often took his guitar to his car to write songs. The songwriter ": null
    },
    {
        "Joe Melson": "Joe Melson"
    },
    {
        ", an acquaintance of Orbisons, tapped on his car window one day in Texas in 1958, and the two decided to write some songs together. Clayson, pp. 68–69. In three recording sessions in 1958 and 1959, Orbison recorded seven songs at ": null
    },
    {
        "RCA Nashville": "Rca Studio B"
    },
    {
        ". Only two singles were judged worthy of release by RCA. Zak, p. 32. Wesley Rose brought Orbison to the attention of the producer ": null
    },
    {
        "Fred Foster": "Fred Foster"
    },
    {
        " at ": null
    },
    {
        "Monument Records": "Monument Records"
    },
    {
        ".         Orbison was one of the first recording artists to popularize the ": null
    },
    {
        "Nashville sound": "Nashville Sound"
    },
    {
        " , with a group of session musicians known as the ": null
    },
    {
        "A-Team ": "The Nashville A-Team"
    },
    {
        " The Nashville sound was developed by producers Chet Atkins, ": null
    },
    {
        "Owen Bradley": "Owen Bradley"
    },
    {
        " , Sam Phillips, and Fred Foster. Wolfe and Akenson, p. 24. Hoffmann and Ferstler, p. 779. In his first session for Monument in Nashville, Orbison recorded a song that RCA had refused, Paper Boy , backed by With the Bug , but neither charted. Zak, p. 33.     According to musician and author Albin Zak, the studio , the production by Foster, and the accompanying musicians gave Orbisons music a polished, professional sound  ... finally allow Orbisons stylistic inclinations free rein . Orbison requested a string section and with it, he recorded three new songs, the most notable of which was Uptown , written with Joe Melson. Lehman, p. 48. Impressed with the results, Melson later recalled, We stood in the studio, listening to the playbacks, and thought it was the most beautiful sound in the world. Clayson, Alan, pp. 70–71. The Rolling Stone Illustrated History of Rock and Roll states that the music Orbison made in Nashville brought a new splendor to rock , and compared the melodramatic effects of the orchestral accompaniment to the musical productions of ": null
    },
    {
        "Phil Spector": "Phil Spector"
    },
    {
        ". DeCurtis and Henke, p. 155.     Uptown reached only number 72 on the Billboard Top 100, and Orbison set his sights on negotiating a contract with an upscale nightclub somewhere. His initial success came just as the 50s rock-and-roll era was winding down. Starting in 1960, the charts in the United States came to be dominated by teen idols, novelty acts, and Motown girl groups. Lehman, p. 19.           Experimenting with a new sound, Orbison and Joe Melson wrote a song in early 1960 which, using elements from Uptown , and another song they had written called Come Back to Me , employed strings and the Anita Kerr doo-wop backing singers. Zak, p. 35. It also featured a note hit by Orbison in ": null
    },
    {
        "falsetto": "Falsetto"
    },
    {
        " that showcased a powerful voice which, according to biographer Clayson, came not from his throat but deeper within . Clayson, p. 77. The song was ": null
    },
    {
        "Only the Lonely ": "Only The Lonely"
    },
    {
        " . Orbison and Melson tried to pitch it to Elvis Presley and the Everly Brothers, but were turned down. Amburn p. 91. They instead recorded the song at RCAs Nashville studio, with sound engineer Bill Porter trying a completely new strategy, building the mix from the top down rather than from the bottom up, beginning with close-miked backing vocals in the foreground, and ending with the rhythm section soft in the background.  This combination became Orbisons trademark sound.     Only the Lonely shot to number two on the Billboard Hot 100 and hit number one in the UK and Australia. According to Orbison, the subsequent songs he wrote with Melson during this period were constructed with his voice in mind, specifically to showcase its range and power. He told Rolling Stone in 1988, I liked the sound of I liked making it sing, making the voice ring, and I just kept doing it. And I think that somewhere between the time of Ooby Dooby and Only the Lonely , it kind of turned into a good voice.  Its success transformed Orbison into an overnight star and he appeared on Dick Clarks Saturday Night Beechnut Show out of New York City. When Presley heard Only the Lonely for the first time, he bought a box of copies to pass to his friends. Amburn, p. 98. Melson and Orbison followed it with the more complex Blue Angel , which peaked at number nine in the US and number 11 in the UK. Im Hurtin , with I Cant Stop Loving You as the B-side, rose to number 27 in the US, but failed to chart in the UK.          Orbison was now able to move to Nashville permanently with his wife Claudette and two sons Roy DeWayne and Anthony King. Back in the studio, seeking a change from the pop sound of Only the Lonely and Im Hurtin , Orbison worked on a new song, ": null
    },
    {
        "Running Scared": "Running Scared"
    },
    {
        " , based loosely on the rhythm of ": null
    },
    {
        "Ravels": "Maurice Ravel"
    },
    {
        "  Boléro ; the song was about a man on the lookout for his girlfriends previous boyfriend, whom he feared would try to take her away. Orbison encountered difficulty when he found himself unable to hit the songs highest note without his voice breaking. He was backed by an orchestra in the studio and Porter told him he would have to sing louder than his accompaniment because the orchestra was unable to be softer than his voice. Clayson, Alan, pp. 81–82. Fred Foster then put Orbison in the corner of the studio and surrounded him with coat racks forming an improvised isolation booth to emphasize his voice. Orbison was unhappy with the first two takes. In the third, however, he abandoned the idea of using falsetto and sang the final high A naturally, so astonishing everyone present that the accompanying musicians stopped playing. On that third take, Running Scared was completed. Fred Foster later recalled, He did it, and everybody looked around in amazement. Nobody had heard anything like it before. Just weeks later Running Scared reached number one on the Billboard Hot 100 chart and number 9 in the UK. The composition of Orbisons following hits reflected Running Scared : a story about an emotionally vulnerable man facing loss or grief, with a crescendo culminating in a surprise climax that employed Orbisons dynamic voice.     Crying followed in July 1961 and reached number two; it was coupled with an up-tempo R & B song, Candy Man , written by Fred Neil and Beverley Ross, which reached the Billboard Top 30, staying on the charts for two months. While Orbison was touring Australia in 1962, an Australian DJ referred to him affectionately as The Big O , partly based on the big finishes to his dramatic ballads, and the moniker stuck with him thereafter. Orbisons second son was born the same year, and Orbison hit number four in the United States and number two in the UK with ": null
    },
    {
        "Dream Baby ": "Dream Baby"
    },
    {
        " , an upbeat song by country songwriter ": null
    },
    {
        "Cindy Walker": "Cindy Walker"
    },
    {
        ". . Also in 1962, he charted with The Crowd , Leah , and Workin for the Man , which he wrote about working one summer in the oil fields near Wink. Amburn, p. 32. His relationship with Joe Melson, however, was deteriorating over Melsons growing concerns that his own solo career would never get off the ground. Clayson, Alan, p. 91.            Orbison eventually developed an image that did not reflect his personality. He had no publicist in the early 1960s, therefore he had little presence in fan magazines, and his single sleeves did not feature his picture.  Life  called him an anonymous celebrity . Lehman, p. 18. After leaving his thick eyeglasses on an aeroplane in 1963, while on tour with the Beatles, Orbison was forced to wear his prescription Wayfarer sunglasses on stage and found that he preferred them. His biographers suggest that although he had a good sense of humor and was never morose, Orbison was very shy and suffered from severe ": null
    },
    {
        "stage fright": "Stage Fright"
    },
    {
        "; wearing sunglasses helped him hide somewhat. The sunglasses led some people to assume he was blind.  His black clothes and song lyrics emphasised the image of mystery and introversion. Clayson, Alan, pp. 102–103. Amburn, p. 108. His dark and brooding persona, combined with his tremulous voice in lovelorn ballads marketed to teenagers, made Orbison a star in the early 1960s. His string of top-40 hits continued with ": null
    },
    {
        "In Dreams": "In Dreams"
    },
    {
        " , Falling , and ": null
    },
    {
        "Mean Woman Blues": "Mean Woman Blues"
    },
    {
        " coupled with ": null
    },
    {
        "Blue Bayou": "Blue Bayou"
    },
    {
        " . Brown, Kutner, and Warwick, p. 645. According to the official Roy Orbison U.S. discography by Marcel Riesco, a rare alternate version of Blue Bayou was released in Italy. Orbison finished 1963 with a Christmas song written by ": null
    },
    {
        "Willie Nelson": "Willie Nelson"
    },
    {
        ", ": null
    },
    {
        "Pretty Paper": "Pretty Paper"
    },
    {
        " .     As In Dreams was released in April 1963, Orbison was asked to replace ": null
    },
    {
        "Duane Eddy": "Duane Eddy"
    },
    {
        " on a tour of the UK in top billing with the ": null
    },
    {
        "Beatles": "The Beatles"
    },
    {
        ". When he arrived in Britain, however, he realized he was no longer the main draw. He had never heard of the Beatles, and annoyed, asked rhetorically, Whats a Beatle, anyway? to which ": null
    },
    {
        "John Lennon": "John Lennon"
    },
    {
        " replied, after tapping his shoulder, I am . Amburn, p. 115. On the opening night, Orbison opted to go onstage first, although he was the more established act. The Beatles stood dumbfounded backstage as Orbison sang through 14 encores. Clayson, Alan, pp. 109–113. Finally, when the audience began chanting We want Roy! again, Lennon and McCartney physically held Orbison back. Amburn, p. 117. Starr later said, In ": null
    },
    {
        "Glasgow": "Glasgow"
    },
    {
        ", we were all backstage listening to the tremendous applause he was getting. He was just standing there, not moving or anything. Through the tour, however, the two acts quickly learned to get along, a process made easier by the fact that the Beatles admired his work. Lennon, John; McCartney, Paul; Harrison, George; Starr, Ringo . The Beatles Anthology. Chronicle. p. 94 Orbison felt a kinship with Lennon, but it was Harrison with whom he would later form a strong friendship.     Touring in 1963 took a toll on Orbisons personal life. His wife Claudette had an affair with the contractor who built their home in ": null
    },
    {
        "Hendersonville, Tennessee": "Hendersonville, Tennessee"
    },
    {
        ". Friends and relatives attributed the breakdown of the marriage to her youth and her inability to withstand being alone and bored. When Orbison toured Britain again in the fall of 1963, she joined him. Amburn, pp. 122–123. He was immensely popular wherever he went, finishing the tour in Ireland and Canada. Almost immediately, he toured Australia and New Zealand with ": null
    },
    {
        "the Beach Boys": "The Beach Boys"
    },
    {
        " and returned again to Britain and Ireland, where he was so besieged by teenaged girls that the Irish police had to halt his performances to pull the girls off him. Amburn, p. 125. He travelled to Australia again, this time with ": null
    },
    {
        "the Rolling Stones": "The Rolling Stones"
    },
    {
        ". ": null
    },
    {
        "Mick Jagger": "Mick Jagger"
    },
    {
        " later remarked, referring to a snapshot he took of Orbison in New Zealand, a fine figure of a man in the hot springs, he was. Amburn, p. 134.          Orbison also began collaborating with ": null
    },
    {
        "Bill Dees": "Bill Dees"
    },
    {
        ", whom he had known in Texas. With Dees, he wrote ": null
    },
    {
        "Its Over": "Its Over"
    },
    {
        " , a number-one hit in the UK and a song that would be one of his signature pieces for the rest of his career. When Claudette walked in the room where Dees and Orbison were writing to say she was heading for Nashville, Orbison asked if she had any money. Dees said, A pretty woman never needs any money . Amburn, p. 127. Just 40 minutes later, ": null
    },
    {
        "Oh, Pretty Woman": "Oh, Pretty Woman"
    },
    {
        " was completed. A riff-laden masterpiece that employed a playful growl he got from a ": null
    },
    {
        "Bob Hope": "Bob Hope"
    },
    {
        " movie, the epithet mercy Orbison uttered when he was unable to hit a note, it rose to number one in the fall of 1964 in the United States and stayed on the charts for 14 weeks. It rose to number one in the UK, as well, spending 18 weeks total on the charts. The single sold over seven million copies. Orbisons success was greater in Britain; as Billboard magazine noted, In a 68-week period that began on August 8, 1963, Roy Orbison was the only American artist to have a number-one single in Britain. He did it twice, with Its Over on June 25, 1964, and Oh, Pretty Woman on October 8, 1964. The latter song also went to number one in America, making Orbison impervious to the current chart dominance of British artists on both sides of the Atlantic. Amburn, p. 128.          Claudette and he divorced in November 1964 over her infidelities, but reconciled 10 months later. His contract with Monument was expiring in June 1965. Wesley Rose, at this time acting as Orbisons agent, moved him from Monument Records to ": null
    },
    {
        "Metro-Goldwyn-Mayer": "Metro-Goldwyn-Mayer"
    },
    {
        "  for $1 million, and the understanding that he would expand into television and films, as Elvis Presley had done. Orbison was a film enthusiast and, when not touring, writing or recording, dedicated time to seeing up to three films a day. Clayson, Alan, pp. 130–131.     Rose also became Orbisons producer. Fred Foster later suggested that Roses takeover was responsible for the commercial failure of Orbisons work at MGM. Engineer Bill Porter agreed that Orbisons best work could only be achieved with RCA Nashvilles A-Team. Orbisons first collection at MGM, an album titled There Is Only One Roy Orbison, sold fewer than 200,000 copies. With the onset of the ": null
    },
    {
        "British Invasion": "British Invasion"
    },
    {
        " in 1964–65, the direction of popular music shifted dramatically, and most performers of Orbisons generation were driven from the charts. Lehman, p. 14     While on tour again in the UK in 1966, Orbison broke his foot falling off a motorcycle in front of thousands of screaming fans at a race track; he performed his show that evening in a cast. Claudette traveled to England to accompany Roy for the remainder of the tour. It was now made public that the couple had happily remarried and were back together .     Orbison was fascinated with machines. He was known to follow a car that he liked and make the driver an offer on the spot. Amburn, p. 126.     Orbison and Claudette shared a love for motorcycles; she had grown up around them, but he claimed Elvis Presley had introduced him to motorcycles. Amburn, p. 54. Tragedy struck on June 6, 1966, however, when Orbison and Claudette were riding home from ": null
    },
    {
        "Bristol, Tennessee": "Bristol, Tennessee"
    },
    {
        ". She struck the door of a pickup truck which had pulled out in front of her on South Water Avenue in ": null
    },
    {
        "Gallatin, Tennessee": "Gallatin, Tennessee"
    },
    {
        ", and died instantly. Clayson, Alan, p. 139.     A grieving Orbison threw himself into his work, collaborating with ": null
    },
    {
        "Bill Dees": "Bill Dees"
    },
    {
        " to write music for  The Fastest Guitar Alive , a film that MGM had scheduled for him to star in as well. It was initially planned as a dramatic Western but was rewritten as a comedy. Lehman, pp. 108–109. Orbisons character was a spy who stole, and had to protect and deliver, a cache of gold to the Confederate Army during the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        ", and was outfitted with a guitar that turned into a rifle. The prop allowed him to deliver the line, I could kill you with this and play your funeral march at the same time , with—according to biographer Colin Escott— zero conviction . Orbison was pleased with the film, although it proved to be a critical and box office flop. While MGM had included five films in his contract, no more were made. Clayson, Alan, pp. 146–147. Amburn, pp. 151–153.     He recorded an album dedicated to the songs of ": null
    },
    {
        "Don Gibson": "Don Gibson"
    },
    {
        " and another of ": null
    },
    {
        "Hank Williams": "Hank Williams"
    },
    {
        " covers, but both sold poorly. During the counterculture era, with the charts dominated by artists like ": null
    },
    {
        "Jimi Hendrix": "Jimi Hendrix"
    },
    {
        ", ": null
    },
    {
        "Jefferson Airplane": "Jefferson Airplane"
    },
    {
        ", the ": null
    },
    {
        "Rolling Stones": "Rolling Stones"
    },
    {
        ", and ": null
    },
    {
        "the Doors": "The Doors"
    },
    {
        ", Orbison felt lost and directionless, later saying: didnt hear a lot I could relate to so I kind of stood there like a tree where the winds blow and the seasons change, and youre still there and you bloom again. Clayson, Alan, p. 152.     During a tour of England and playing ": null
    },
    {
        "Bournemouth": "Bournemouth"
    },
    {
        " on Saturday, September 14, 1968, he received the news that his home in Hendersonville, Tennessee, had burned down, and his two eldest sons had died. Clayson, Alan, pp. 161–63. The property was sold to ": null
    },
    {
        "Johnny Cash": "Johnny Cash"
    },
    {
        ", who demolished the building and planted an orchard on it. On March 25, 1969, Orbison married German teenager ": null
    },
    {
        "Barbara Jakobs": "Barbara Orbison"
    },
    {
        ", whom he had met several weeks before his sons deaths. Amburn, p. 163. Wesley , his youngest son with Claudette, was raised by Orbisons parents. Orbison and Barbara had a son  in 1970 and another  in 1975. Clayson, Alan, p. 178.         Orbison continued recording albums in the 1970s, but none of them sold more than a handful of copies, and by 1976, he had gone an entire decade without a charting album. Aside from a few minor hits in Australia, he also failed to produce any charting singles after the 1960s. His fortunes sank so low that he began to doubt his own talents and several of his 1970s albums were not released internationally due to low US sales. He left MGM Records in 1973 and signed a one-album deal with Mercury Records. Amburn, p. 170. Author Peter Lehman would later observe that his absence was a part of the mystery of his persona: Since it was never clear where he had come from, no one seemed to pay much mind to where he had gone; he was just gone. Lehman, p. 2. His influence was apparent, however, as several artists released covers of his songs, which proved popular. Orbisons version of ": null
    },
    {
        "Love Hurts": "Love Hurts"
    },
    {
        " , a song composed by Felice and Boudleaux Bryant and first recorded by the Everly Brothers, was remade by ": null
    },
    {
        "Gram Parsons": "Gram Parsons"
    },
    {
        " and ": null
    },
    {
        "Emmylou Harris": "Emmylou Harris"
    },
    {
        ", again by ": null
    },
    {
        "hard rock": "Hard Rock Music"
    },
    {
        " band ": null
    },
    {
        "Nazareth": "Nazareth"
    },
    {
        ", and by ": null
    },
    {
        "blues": "Blues"
    },
    {
        " adept ": null
    },
    {
        "Jim Capaldi": "Jim Capaldi"
    },
    {
        ". ": null
    },
    {
        "Sonny James": "Sonny James"
    },
    {
        " sent Only the Lonely to No. 1 on the country music charts. Amburn, pp. 167–168. ": null
    },
    {
        "Bruce Springsteen": "Bruce Springsteen"
    },
    {
        " ended his concerts with Orbison songs, and ": null
    },
    {
        "Glen Campbell": "Glen Campbell"
    },
    {
        " had a minor hit with a remake of Dream Baby .     A compilation of Orbisons greatest hits went to No. 1 in the UK in January 1976. The same year, he began to open concerts for the ": null
    },
    {
        "Eagles": "Eagles"
    },
    {
        ", who started as ": null
    },
    {
        "Linda Ronstadts": "Linda Ronstadt"
    },
    {
        " backup band. Ronstadt herself covered ": null
    },
    {
        "Blue Bayou": "Blue Bayou"
    },
    {
        " in 1977, her version reaching No. 3 on the Billboard charts and remaining in the charts for 24 weeks. Orbison credited this cover in particular for reviving his memory in the popular mind, if not his career. Amburn, p. 178. He signed again with Monument in 1976 and recorded ": null
    },
    {
        "Regeneration": "Regeneration"
    },
    {
        " with Fred Foster, but it proved no more successful than before.          In late 1977, Orbison was not feeling well and decided to overwinter in ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        ". While there, he checked into a hospital where testing discovered that he had severely obstructed ": null
    },
    {
        "coronary arteries": "Coronary Arteries"
    },
    {
        ". On January 18, 1978, Orbison underwent a triple ": null
    },
    {
        "coronary bypass": "Coronary Artery Bypass Surgery"
    },
    {
        ". He had suffered from ": null
    },
    {
        "duodenal ulcers": "Peptic Ulcer"
    },
    {
        " since as early as 1960 and had been a heavy smoker since adolescence. Clayson, Alan, pp. 3, 183–184. He felt revitalized following the triple bypass, but he continued to smoke, and his weight fluctuated for the remainder of his life.     In 1980, ": null
    },
    {
        "Don McLean": "Don Mclean"
    },
    {
        " charted with Crying  and his version unexpectedly went to the top of the charts at first in the Netherlands, afterward hitting No. 5 in the US and staying on the charts for 15 weeks; it was No. 1 in the UK for three weeks, and also topped the Irish Charts. Amburn, p. 182. Although he was all but forgotten in the US, Orbison reached the most unlikely places for a rock and roll legend, like ": null
    },
    {
        "Bulgaria": "Bulgaria"
    },
    {
        " for example in 1982. He was astonished to find that he was as popular there as he had been in 1964; he was forced to stay in his hotel room because he was mobbed on the streets of ": null
    },
    {
        "Sofia": "Sofia"
    },
    {
        ". Amburn, p. 183. In 1981, he and Emmylou Harris had won a ": null
    },
    {
        "Grammy Award": "Grammy Award"
    },
    {
        " for their duet That Lovin You Feelin Again  and things were picking up. It was his first such award, and he felt hopeful in making a full return to popular music. Clayson, Alan, p. 192. However, it would be several more years until this came to fruition. In the meantime, ": null
    },
    {
        "Van Halen": "Van Halen"
    },
    {
        " released a hard-rock cover of Oh, Pretty Woman on their 1982 album  Diver Down , again further exposing a younger generation to Orbisons legacy.              Orbison originally declined ": null
    },
    {
        "David Lynchs": "David Lynch"
    },
    {
        " request to allow the use of In Dreams for the film  Blue Velvet  . Amburn, p. 191. Lynch used it anyway ; the song served as one of several obsessions of a psychopathic character named ": null
    },
    {
        "Frank Booth": "Frank Booth"
    },
    {
        " . It was lip-synched by an ": null
    },
    {
        "effeminate": "Effeminacy"
    },
    {
        " drug dealer played by ": null
    },
    {
        "Dean Stockwell": "Dean Stockwell"
    },
    {
        ", after which Booth demanded the song be played over and over, once beating the protagonist while the song played. During filming, Lynch asked for the song to be played repeatedly to give the set a surreal atmosphere. Amburn, p. 193. Orbison was initially shocked at its use: he saw the film in a theater in Malibu and later said, I was mortified because they were talking about the candy-colored clown in relation to a dope deal  ... I thought, What in the world  ...? But later, when I was touring, we got the video out and I really got to appreciate what David gave to the song, and what the song gave to the movie—how it achieved this otherworldly quality that added a whole new dimension to In Dreams.     By 1987, Orbisons career was fully revived. He released an album of his re-recorded hits, titled  In Dreams: The Greatest Hits . Life Fades Away , a song he co-wrote with his friend ": null
    },
    {
        "Glenn Danzig": "Glenn Danzig"
    },
    {
        " and recorded, was featured in the film  Less Than Zero  .  He and ": null
    },
    {
        "k.d. lang": "K.D. Lang"
    },
    {
        " performed a duet of Crying for inclusion on the soundtrack to the film,  Hiding Out  ; the pair received a ": null
    },
    {
        "Grammy Award for Best Country Collaboration with Vocals": "Grammy Award For Best Country Collaboration With Vocals"
    },
    {
        " after Orbisons death.      Also in 1987, Orbison was inducted into the ": null
    },
    {
        "Nashville Songwriters Hall of Fame": "Nashville Songwriters Hall Of Fame"
    },
    {
        " and was initiated into the ": null
    },
    {
        "Rock and Roll Hall of Fame": "Rock And Roll Hall Of Fame"
    },
    {
        " by Bruce Springsteen, who concluded his speech with a reference to his own album  Born to Run ": null
    },
    {
        "Cocoanut Grove nightclub": "Ambassador Hotel"
    },
    {
        " in Los Angeles. They were joined by ": null
    },
    {
        "Jackson Browne": "Jackson Browne"
    },
    {
        ", ": null
    },
    {
        "T Bone Burnett": "T Bone Burnett"
    },
    {
        ", ": null
    },
    {
        "Elvis Costello": "Elvis Costello"
    },
    {
        ", ": null
    },
    {
        "Tom Waits": "Tom Waits"
    },
    {
        ", ": null
    },
    {
        "Bonnie Raitt": "Bonnie Raitt"
    },
    {
        ", ": null
    },
    {
        "Jennifer Warnes": "Jennifer Warnes"
    },
    {
        ", ": null
    },
    {
        "James Burton": "James Burton"
    },
    {
        ",  and ": null
    },
    {
        "k.d. lang": "K.D. Lang"
    },
    {
        ". Lang later recounted how humbled Orbison had been by the display of support from so many talented and busy musicians: Roy looked at all of us and said, If there is anything I can ever do for you, please call on me. He was very serious. It was his way of thanking us. It was very emotional. Amburn, p. 207. The concert was filmed in one take and aired on ": null
    },
    {
        "Cinemax": "Cinemax"
    },
    {
        " under the title  Roy Orbison and Friends: A Black and White Night ; it was released on video by Virgin Records, selling 50,000 copies. Amburn, p. 205.     Mystery Girl": null
    },
    {
        "Electric Light Orchestra": "Electric Light Orchestra"
    },
    {
        " bandleader ": null
    },
    {
        "Jeff Lynne": "Jeff Lynne"
    },
    {
        " on a new album. Lynne had just completed production work on George Harrisons  Cloud Nine  album, and all three ate lunch together one day when Orbison accepted an invitation to sing on a song of Harrisons new single. They subsequently contacted ": null
    },
    {
        "Bob Dylan": "Bob Dylan"
    },
    {
        ", who, in turn, allowed them to use a recording studio in his home. Along the way, Harrison made a quick visit to ": null
    },
    {
        "Tom Pettys": "Tom Petty"
    },
    {
        " residence to obtain his guitar; Petty and his band had backed Dylan on his last tour. Amburn, p. 218. By that evening, the group had written ": null
    },
    {
        "Handle with Care": "Handle With Care"
    },
    {
        " , which led to the concept of recording an entire album. They called themselves the ": null
    },
    {
        "Traveling Wilburys": "Traveling Wilburys"
    },
    {
        ", representing themselves as half-brothers with the same father. They gave themselves stage names; Orbison chose his from his musical hero, calling himself Lefty Wilbury after Lefty Frizzell. Clayson, Alan, pp. 206–207. Expanding on the concept of a traveling band of raucous musicians, Orbison offered a quote about the groups foundation in honor: Some people say Daddy was a cad and a bounder. I remember him as a Baptist minister. Amburn, p. 221.     Lynne later spoke of the recording sessions: Everybody just sat there going, Wow, its Roy Orbison!... Even though hes become your pal and youre hanging out and having a laugh and going to dinner, as soon as he gets behind that and hes doing his business, suddenly its shudder time. Clayson, Alan, p. 208. Orbison was given one solo track, ": null
    },
    {
        "Not Alone Any More": "Not Alone Any More"
    },
    {
        " , on the album. His contributions were highly praised by the press.  Traveling Wilburys Vol. 1  spent 53 weeks on the US charts, peaking at number three. It reached No. 1 in Australia and topped out at No. 16 in the UK. The album won a Grammy for ": null
    },
    {
        "Best Rock Performance by a Duo or Group": "Grammy Award For Best Rock Performance By A Duo Or Group With Vocal"
    },
    {
        ". Rolling Stone included it in the top 100 albums of the decade. Amburn, p. 222.     Orbison was in high demand for concerts and interviews once again, and was seemingly ecstatic about it. He began writing songs and collaborating with many musicians from his past and newer fans, to develop a solo album,  Mystery Girl .     Mystery Girl was co-produced by ": null
    },
    {
        "Jeff Lynne": "Jeff Lynne"
    },
    {
        ", whom Orbison considered the best producer he had ever collaborated with. Amburn, p. 213. ": null
    },
    {
        "Elvis Costello": "Elvis Costello"
    },
    {
        ", Orbisons son Wesley and others offered their songs to him. The biggest hit from the album was ": null
    },
    {
        "You Got It": "You Got It"
    },
    {
        " , written with Lynne and Tom Petty. It posthumously rose to No. 9 in the US and No. 3 in the UK.     In 2014, a demo of Orbisons The Way Is Love was released as part of the 25th-anniversary deluxe edition of Mystery Girl. The song was originally recorded on a stereo cassette player around 1986. Orbisons sons contributed instrumentation on the track along with Roys vocals; it was produced by ": null
    },
    {
        "John Carter Cash": "John Carter Cash"
    },
    {
        ".      Although the video for the Wilburys Handle with Care was filmed with Orbison, the video for ": null
    },
    {
        "End of the Line": "End Of The Line"
    },
    {
        " was filmed and released posthumously. During Orbisons vocal parts in End of the Line , the video shows a guitar in a rocking chair, next to Orbisons framed photo.          Orbison determinedly pursued his second chance at stardom, but he expressed amazement at his success: Its very nice to be wanted again, but I still cant quite believe it. Amburn, p. 223. He lost some weight to fit his new image and the constant demand of touring, as well as the newer demands of making videos. In the final three months of his life, he gave Rolling Stone magazine extensive access to his daily activities; he intended to write an autobiography and wanted ": null
    },
    {
        "Martin Sheen": "Martin Sheen"
    },
    {
        " to play him in a biopic. In November 1988, Mystery Girl was completed, and Traveling Wilburys Vol. 1 was rising up the charts. Around this time, Orbison confided in ": null
    },
    {
        "Johnny Cash": "Johnny Cash"
    },
    {
        " that he was having chest pains. He went to Europe, was presented with an award there, and played a show in ": null
    },
    {
        "Antwerp": "Antwerp"
    },
    {
        ", where footage for the video for You Got It was filmed. He gave several interviews a day in a hectic schedule. A few days later, a manager at a club in ": null
    },
    {
        "Boston": "Boston"
    },
    {
        " was concerned that he looked ill, but Orbison played the show, to another standing ovation. Amburn, pp. 227–228.     Orbison performed at the Front Row Theater in ": null
    },
    {
        "Highland Heights, Ohio": "Highland Heights, Ohio"
    },
    {
        ", on December 4. Exhausted, he returned to his home in Hendersonville to rest for several days before flying again to London to film two more videos for the Traveling Wilburys. On December 6, 1988, he spent the day flying ": null
    },
    {
        "model airplanes": "Model Aircraft"
    },
    {
        " with his sons and ate dinner at his mothers home in Hendersonville. Later that day, he died of a ": null
    },
    {
        "heart attack": "Heart Attack"
    },
    {
        ", at the age of 52. Clayson, Alan, p. 213.     A memorial for Orbison was held in Nashville, and another was held in Los Angeles. He was buried at ": null
    },
    {
        "Westwood Village Memorial Park Cemetery": "Westwood Village Memorial Park Cemetery"
    },
    {
        " Clayson, Alan, p. 215. Amburn, pp. 233–235. in an unmarked grave. On April 8, 1989, Orbison became the first deceased musician since ": null
    },
    {
        "Elvis Presley": "Elvis Presley"
    },
    {
        " to have two albums in the US Top Five at the same time, with the Traveling Wilburys album at number 4 and his own Mystery Girl at number 5.  In the United Kingdom, he achieved even greater posthumous success, with two solo albums in the Top 3 in the chart dated February 11, 1989, Mystery Girl at number 2 and the compilation The Legendary Roy Orbison at number 3.             Rock and roll in the 1950s was defined by a driving ": null
    },
    {
        "backbeat": "Beat Backbeat"
    },
    {
        ", heavy guitars, and lyrical themes that glorified youthful rebellion. Lehman, p. 8. Few of Orbisons recordings have these characteristics. The structure and themes of his songs defied convention, and his much-praised voice and performance style were unlike any other in rock and roll. Many of his contemporaries compared his music with that of classically trained musicians, although he never mentioned any classical music influences. Peter Lehman summarized it, writing, He achieved what he did not by copying classical music but by creating a unique form of popular music that drew upon a wide variety of music popular during his youth. Lehman, p. 58. Orbison was known as the ": null
    },
    {
        "Caruso": "Enrico Caruso"
    },
    {
        " of Rock": "Honorific Nicknames In Popular Musico"
    },
    {
        " Amburn, p. 97.  and the Big O .     Roys Boys LLC, a Nashville-based company founded by Orbisons sons to administer their fathers catalog and safeguard his legacy, announced a November 16, 2018 release of Unchained Melodies: Roy Orbison with the Royal Philharmonic Orchestra album as well as a fall 2018 Roy Orbison Hologram tour called In Dreams: Roy Orbison in Concert.            Music critic ": null
    },
    {
        "Dave Marsh": "Dave Marsh"
    },
    {
        " wrote that Orbisons compositions define a world unto themselves more completely than any other body of work in pop music . Lehman, p. 20. Orbisons music, like the man himself, has been described as timeless, diverting from contemporary rock and roll and bordering on the eccentric, within a hairs breadth of being weird. Lehman, p. 9. Peter Watrous, writing for the New York Times, declared in a concert review, He has perfected an odd vision of popular music, one in which eccentricity and imagination beat back all the pressures toward conformity . Watrous, Peter . Roy Orbison Mines Some Old Gold . The New York Times. p. 48.     In the 1960s, Orbison refused to splice edits of songs together and insisted on recording them in single takes with all the instruments and singers together. Lehman, p. 46. The only convention Orbison followed in his most popular songs is the time limit for radio fare in pop songs. Otherwise, each seems to follow a separate structure. Using the standard ": null
    },
    {
        "thirty-two-bar form": "Thirty-Two-Bar Form"
    },
    {
        " for verses and choruses, normal pop songs followed the verse-chorus-verse-chorus-bridge-verse-chorus structure. Where A represents the verse, B represents the chorus, and C the bridge, most pop songs can be represented by A-B-A-B-C-A-B, like Ooby Dooby and Claudette . Orbisons In Dreams was a song in seven movements that can be represented as Intro-A-B-C-D-E-F; no sections are repeated. In Running Scared , however, the entire song repeats to build suspense to a final climax, to be represented as A-A-A-A-B. Crying is more complex, changing parts toward the end to be represented as A-B-C-D-E-F-A-B-C-D-E-F. Lehman, p. 53. Although Orbison recorded and wrote standard structure songs before Only the Lonely , he claimed never to have learned how to write them:           ": null
    },
    {
        "Elton Johns": "Elton John"
    },
    {
        " songwriting partner and main lyricist ": null
    },
    {
        "Bernie Taupin": "Bernie Taupin"
    },
    {
        " wrote that Orbisons songs always made radical left turns , and ": null
    },
    {
        "k.d. lang": "K.D. Lang"
    },
    {
        " declared that good songwriting comes from being constantly surprised, such as how the entirety of Running Scared eventually depends on the final note, one word. Lehman, p. 52. Some of the musicians who worked with Orbison were confounded by what he asked them to do. The Nashville session guitarist ": null
    },
    {
        "Jerry Kennedy": "Jerry Kennedy"
    },
    {
        " stated, Roy went against the grain. The first time youd hear something, it wouldnt sound right. But after a few playbacks, it would start to grow on you.         Critic Dave Marsh categorizes Orbisons ballads into themes reflecting pain and loss, and dreaming. A third category is his uptempo rockabilly songs such as Go! Go! Go! and Mean Woman Blues that are more thematically simple, addressing his feelings and intentions in a masculine ": null
    },
    {
        "braggadocio": "Braggadocio"
    },
    {
        ". In concert, Orbison placed the uptempo songs between the ballads to keep from being too consistently dark or grim. Lehman, pp. 70–71.     In 1990, Colin Escott wrote an introduction to Orbisons biography published in a CD box set: Orbison was the master of compression. Working the singles era, he could relate a short story, or establish a mood in under three minutes. If you think thats easy—try it. His greatest recordings were quite simply perfect; not a word or note surplus to intention. After attending a show in 1988, Peter Watrous of The New York Times wrote that Orbisons songs are dreamlike claustrophobically intimate set pieces . Music critic Ken Emerson writes that the apocalyptic romanticism in Orbisons music was well-crafted for the films his songs appeared in the 1980s because the music was so over-the-top that dreams become delusions, and self-pity paranoia , striking a postmodern nerve . DeCurtis and Henke, p. 157. ": null
    },
    {
        "Led Zeppelin": "Led Zeppelin"
    },
    {
        " singer ": null
    },
    {
        "Robert Plant": "Robert Plant"
    },
    {
        " favored American R & B music as a youth, but beyond the black musicians, he named Elvis and Orbison especially as foreshadowing the emotions he would experience: The poignancy of the combination of lyric and voice was stunning. used drama to great effect and he wrote dramatically.     The loneliness in Orbisons songs that he became most famous for, he both explained and downplayed: I dont think Ive been any more lonely than anyone else  ... Although if you grow up in West Texas, there are a lot of ways to be lonely. His music offered an alternative to the postured masculinity that was pervasive in music and culture. ": null
    },
    {
        "Robin Gibb": "Robin Gibb"
    },
    {
        " of the ": null
    },
    {
        "Bee Gees": "Bee Gees"
    },
    {
        " stated, He made emotion fashionable, that it was all right to talk about and sing about very emotional things. For men to sing about very emotional things... Before that no one would do it. Orbison acknowledged this in looking back on the era in which he became popular: When came out I dont think anyone had accepted the fact that a man should cry when he wants to cry.              Orbison admitted that he did not think his voice was put to appropriate use until Only the Lonely in 1960, when it was able, in his words, to allow its flowering . Lehman, p. 50. Carl Perkins, however, toured with Orbison while they were both signed with Sun Records and recalled a specific concert when Orbison covered the ": null
    },
    {
        "Nelson Eddy": "Nelson Eddy"
    },
    {
        " and ": null
    },
    {
        "Jeanette MacDonald": "Jeanette Macdonald"
    },
    {
        " standard ": null
    },
    {
        "Indian Love Call": "Indian Love Call"
    },
    {
        " , and had the audience completely silenced, in awe. Lehman, p. 49. When compared to the Everly Brothers, who often used the same session musicians, Orbison is credited with a passionate intensity that, according to The Rolling Stone Illustrated History of Rock and Roll, made his love, his life, and, indeed, the whole world to be coming to an end—not with a whimper, but an agonized, beautiful bang .     Bruce Springsteen and ": null
    },
    {
        "Billy Joel": "Billy Joel"
    },
    {
        " both commented on the otherworldly quality of Orbisons voice. ": null
    },
    {
        "Dwight Yoakam": "Dwight Yoakam"
    },
    {
        " stated that Orbisons voice sounded like the cry of an angel falling backward through an open window . Lehman, p. 22. ": null
    },
    {
        "Barry Gibb": "Barry Gibb"
    },
    {
        " of ": null
    },
    {
        "The Bee Gees": "The Bee Gees"
    },
    {
        " went further to say that when he heard Crying for the first time, That was it. To me that was the voice of God. Hall, Mark. In Dreams: The Roy Orbison Story, Nashmount Productions Inc., 1999. Elvis Presley stated his voice was the greatest and most distinctive he had ever heard. Amburn, pp. 175, 193. Orbisons music and voice have been compared to opera by Bob Dylan, Tom Waits, and songwriter ": null
    },
    {
        "Will Jennings": "Will Jennings"
    },
    {
        ", among others. Dylan marked Orbison as a specific influence, remarking that there was nothing like him on radio in the early 1960s: Dylan, p. 33.           Likewise, Tim Goodwin, who conducted the orchestra that backed Orbison in Bulgaria, had been told that Orbisons voice would be a singular experience to hear. When Orbison started with Crying and hit the high notes, Goodwin stated: The strings were playing and the band had built up and, sure enough, the hair on the back of my neck just all started standing up. It was an incredible physical sensation. Amburn, p. 184. Bassist ": null
    },
    {
        "Jerry Scheff": "Jerry Scheff"
    },
    {
        ", who backed Orbison in his  A Black and White Night  concert, wrote about him, Roy Orbison was like an opera singer. His voice melted out of his mouth into the stratosphere and back. He never seemed like he was trying to sing, he just did it. Scheff, Jerry . Way Down: Playing Bass with Elvis, Dylan, the Doors & More. Backbeat Books. p. 33.     His voice ranged from ": null
    },
    {
        "baritone": "Baritone"
    },
    {
        " to ": null
    },
    {
        "tenor": "Tenor"
    },
    {
        ", and music scholars have suggested that he had a three- or four-octave range.      Orbisons severe stage fright was particularly noticeable in the 1970s and early 1980s. During the first few songs in a concert, the ": null
    },
    {
        "vibrato": "Vibrato"
    },
    {
        " in his voice was almost uncontrollable, but afterward, it became stronger and more dependable. Lehman, p. 24. This also happened with age. Orbison noticed that he was unable to control the tremor in the late afternoon and evenings, and chose to record in the mornings when it was possible.           Orbison often excused his motionless performances by saying that his songs did not allow instrumental sections so he could move or dance on stage, although songs like Mean Woman Blues did offer that. Lehman, p. 62. He was aware of his unique performance style even in the early 1960s when he commented, Im not a super personality—on stage or off. I mean, you could put workers like ": null
    },
    {
        "Chubby Checker": "Chubby Checker"
    },
    {
        " or ": null
    },
    {
        "Bobby Rydell": "Bobby Rydell"
    },
    {
        " in second-rate shows and theyd still shine through, but not me. Id have to be prepared. People come to hear my music, my songs. Thats what I have to give them. Clayson, Alan, p. 78.     Lang compared Orbison to a tree, with passive but solid beauty.  1980198619881989199019981987198719892010January 30, 20102014": null
    }
]