[
    {
        "        K-141 Kursk  was an ": null
    },
    {
        "Oscar II": "Oscar-Class Submarine"
    },
    {
        "-class nuclear-powered ": null
    },
    {
        "cruise missile submarine": "Cruise Missile Submarine"
    },
    {
        " of the ": null
    },
    {
        "Russian Navy": "Russian Navy"
    },
    {
        ".     On 12 August 2000, K-141 Kursk was ": null
    },
    {
        "lost when it sank": "Kursk Submarine Disaster"
    },
    {
        " in the ": null
    },
    {
        "Barents Sea": "Barents Sea"
    },
    {
        ", killing all 118 personnel on board.       K-141 Kursk was a Project 949A class Antey  submarine of the ": null
    },
    {
        "Oscar class": "Oscar-Class Submarine"
    },
    {
        ", known as the Oscar II by its ": null
    },
    {
        "NATO reporting name": "Nato Reporting Name"
    },
    {
        ", and was the penultimate submarine of the Oscar II class designed and approved in the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ". Construction began in 1990 at the ": null
    },
    {
        "Soviet Navy": "Soviet Navy"
    },
    {
        " military shipyards in ": null
    },
    {
        "Severodvinsk": "Severodvinsk"
    },
    {
        ", near ": null
    },
    {
        "Arkhangelsk": "Arkhangelsk"
    },
    {
        ", in the northern ": null
    },
    {
        "Russian SFSR": "Russian Sfsr"
    },
    {
        ". During the construction of K-141, the ": null
    },
    {
        "Soviet Union collapse": "Soviet Union Collapse"
    },
    {
        "d; work continued, and she became one of the first naval vessels completed after the collapse. K-141 was inherited by ": null
    },
    {
        "Russia": "Russia"
    },
    {
        " and launched in 1994, before being commissioned by the ": null
    },
    {
        "Russian Navy": "Russian Navy"
    },
    {
        " on December 30, as part of the ": null
    },
    {
        "Russian Northern Fleet": "Russian Northern Fleet"
    },
    {
        ". K-141 was named Kursk after ": null
    },
    {
        "the city": "Kursk"
    },
    {
        ", following the ": null
    },
    {
        "naming system": "Naming System"
    },
    {
        " for Soviet submarines.     Kursk was assigned to the ": null
    },
    {
        "home port": "Home Port"
    },
    {
        " of ": null
    },
    {
        "Vidyayevo": "Vidyayevo"
    },
    {
        ", ": null
    },
    {
        "Murmansk Oblast": "Murmansk Oblast"
    },
    {
        ".         The Antey design represented the highest achievement of Soviet nuclear submarine technology. They were the second-largest attack submarines ever built, after the  .  It was built to defeat an entire United States aircraft carrier group. A single ": null
    },
    {
        "Type 65 torpedo": "Type 65 Torpedo"
    },
    {
        " carried a  warhead powerful enough to sink an aircraft carrier.  Both missiles and torpedoes could be equipped with nuclear warheads. She was  longer than the preceding Oscar I-class of submarines. The senior officers had individual staterooms and the entire crew had access to a gymnasium.       The outer hull, made of high-": null
    },
    {
        "nickel": "Nickel"
    },
    {
        ", high-": null
    },
    {
        "chromium": "Chromium"
    },
    {
        " stainless steel": "Stainless Steel"
    },
    {
        "  thick, had exceptionally good resistance to corrosion and a weak ": null
    },
    {
        "magnetic": "Magnetic"
    },
    {
        " signature which helped prevent detection by U.S. ": null
    },
    {
        "magnetic anomaly detector": "Magnetic Anomaly Detector"
    },
    {
        " systems. There was a  gap to the -thick steel ": null
    },
    {
        "pressure hull": "Submarine Hullpressure Hull"
    },
    {
        ". N. A. Kursk Inner Hull Breached. Australian, The : Newspaper Source Plus. Web. 7 December 2011. She was designed to remain submerged for up to 120 days. The sail superstructure was reinforced to allow it to break through the Arctic ice.   The submarine was armed with 24 ": null
    },
    {
        "SS-N-19/P-700 Granit": "P-700 Granit"
    },
    {
        " cruise missiles, and eight ": null
    },
    {
        "torpedo tubes": "Torpedo Tube"
    },
    {
        "in the bow: four  and four . The Granit missiles with a range of , were capable of supersonic flight at altitudes over . They were designed to swarm enemy vessels and intelligently choose individual targets which terminated with a dive onto the target. The torpedo tubes could be used to launch either torpedoes or anti-ship missiles with a range of . Her weapons included 18 ": null
    },
    {
        "SS-N-16 Stallion ": "Rpk-6 Vodopad/Rpk-7 Veter"
    },
    {
        " anti-submarine missiles.     Kursk was part of Russias Northern Fleet, which had suffered funding cutbacks throughout the 1990s. Many of its submarines were anchored and rusting in ": null
    },
    {
        "Zapadnaya Litsa Naval Base": "Zapadnaya Litsa"
    },
    {
        ",  from ": null
    },
    {
        "Murmansk": "Murmansk"
    },
    {
        ". . Retrieved on 8 August 2007. Little work to maintain all but the most essential front-line equipment, including search and rescue equipment, had occurred. Northern Fleet sailors had gone unpaid in the mid-1990s.         During her five years of service, Kursk completed only one mission, a six-month deployment to the ": null
    },
    {
        "Mediterranean Sea": "Mediterranean Sea"
    },
    {
        " during the summer of 1999 to monitor the ": null
    },
    {
        "United States Sixth Fleet": "United States Sixth Fleet"
    },
    {
        " responding to the ": null
    },
    {
        "Kosovo crisis": "Kosovo War"
    },
    {
        ".   This was due to a lack of funds for fuel. As a result, many of her crew had spent little time at sea and were inexperienced.             Kursk joined the Summer-X exercise, the first large-scale naval exercise planned by the Russian Navy in more than a decade,  on 10 August 2000. It included 30 ships including the fleets flagship ": null
    },
    {
        "Pyotr Velikiy": "Russian Battlecruiser Pyotr Velikiy"
    },
    {
        " , four attack submarines,  and a flotilla of smaller ships. The crew had recently won a citation for its excellent performance and been recognized as the best submarine crew in the ": null
    },
    {
        "Northern Fleet": "Northern Fleet"
    },
    {
        ".  While it was on an exercise, Kursk loaded a full complement of combat weapons. It was one of the few ships authorized to carry a combat load at all times.         On the first day of the exercise, Kursk successfully launched a Granit missile armed with a dummy warhead. Two days later, on the morning of 12 August, Kursk prepared to fire ": null
    },
    {
        "dummy torpedo": "Dummy Torpedo"
    },
    {
        "es at the   . These practice torpedoes had no explosive warheads and were manufactured and tested at a much lower quality standard.  On 12 August 2000, at 11:28 local time , there was an explosion while preparing to fire. Rosenberg, Debra, et al. A Mystery In The Deep. Newsweek 136.9 : 34. Academic Search Premier. Web. 7 December 2011. The Russian Navys final report on the disaster concluded the explosion was due to the failure of one of Kursks hydrogen peroxide-fueled Type 65 torpedo es. Sviatov, George. The Kursks Loss Offers Lessons. U.S. Naval Institute Proceedings, 129.6 : 71. Academic Search Premier. Web. 7 December 2011. A subsequent investigation concluded that high-test peroxide , a form of highly concentrated hydrogen peroxide used as propellant for the torpedo, seeped through a faulty weld in the torpedo casing. When HTP comes into contact with a catalyst, it rapidly expands by a factor of 5000, generating vast quantities of steam and oxygen. The pressure produced by the expanding HTP ruptured the kerosene fuel tank in the torpedo and set off an explosion equal to of TNT . The submarine sank in relatively shallow water, bottoming at about off Severomorsk , at . A second explosion 135 seconds after the initial event was equivalent to 3-7 tons of TNT. The explosions blew a large hole in the hull and caused the first three compartments of the submarine to collapse, killing or incapacitating all but 23 of the 118 personnel on board.       The British and Norwegian navies offered assistance, but Russia initially refused all help. All 118 sailors and officers aboard Kursk died. The Russian Admiralty initially told the public that the majority of the crew died within minutes of the explosion, but on 21 August, Norwegian and Russian divers found 24 bodies in the ninth compartment, the turbine room at the stern of the boat. Captain-lieutenant Dmitri Kolesnikov wrote a note listing the names of 23 sailors who were alive in the compartment after the ship sank.     Kursk carried a potassium superoxide cartridge of a chemical oxygen generator ; these are used to absorb carbon dioxide and chemically release oxygen during an emergency. However, the cartridge became contaminated with sea water and the resulting chemical reaction caused a flash fire which consumed the available oxygen. The investigation showed that some men temporarily survived the fire by plunging under water, as fire marks on the bulkheads indicated the water was at waist level at the time. Ultimately, the remaining crew burned to death or suffocated.     Russian President Vladimir Putin , though immediately informed of the tragedy, was told by the navy that they had the situation under control and that rescue was imminent. He waited for five days before he ended his holiday at a presidential resort in Sochi on the Black Sea. Putin was only four months into his tenure as President, and the public and media were extremely critical of his decision to remain at a seaside resort. His highly favourable ratings dropped dramatically. The Presidents response appeared callous and the governments actions looked incompetent. A year later he said, I probably should have returned to Moscow, but nothing would have changed. I had the same level of communication both in Sochi and in Moscow, but from a PR point of view I could have demonstrated some special eagerness to return. – BBC News, 12 August 2001 Retrieved on 8 August 2007       thu     A consortium formed by the Dutch companies Mammoet and Smit International Smit website on , URL visited 12 February 2012 was awarded a contract by Russia to raise the vessel, excluding the bow. They modified the barge ": null
    },
    {
        "Giant 4": "Giant 4"
    },
    {
        " which raised Kursk and recovered the remains of the sailors.     During salvage operations in 2001, the team first cut the bow off the hull using a tungsten carbide -studded cable. As this tool had the potential to cause sparks which could ignite remaining pockets of reactive gases, such as hydrogen, the operation was executed with care. Most of the bow was abandoned and the rest of the vessel was towed to Severomorsk and placed in a floating dry dock for analysis.     The remains of Kursks reactor compartment was towed to Sayda Bay on Russias northern Kola Peninsula , where more than 50 reactor compartments were afloat at pier points, after a shipyard had removed all the fuel from the boat in early 2003.     Some torpedo and torpedo tube fragments from the bow were recovered and the rest was destroyed by explosives in 2002.       Notwithstanding the navys oft-stated position that a collision with a foreign vessel had triggered the event, a report issued by the government attributed the disaster to a torpedo explosion caused when high-test peroxide , a form of highly concentrated hydrogen peroxide , leaked from a faulty weld in the torpedos casing. The report found that the initial explosion destroyed the torpedo room compartment and killed everyone in the first compartment. The blast entered the second and perhaps the third and fourth compartments through an air conditioning vent. All of the 36 men in the command post located in the second compartment were immediately incapacitated by the blast wave and possibly killed. The first explosion caused a fire that raised the temperature of the compartment to more than . The heat caused the warheads of between five and seven additional torpedoes to detonate, creating an explosion equivalent to 2–3 tons of TNT that measured 4.2 on the Richter magnitude scale on seismographs across Europe and was detected as far away as Alaska .       Vice-Admiral Valery Ryazantsev differed with the governments official conclusion. He cited inadequate training, poor maintenance, and incomplete inspections that caused the crew to mishandle the weapon. During the examination of the wrecked sub, investigators recovered a partially burned copy of the safety instructions for loading HTP torpedoes, but the instructions were for a significantly different type of torpedo and failed to include essential steps for testing an air valve. The 7th Division, 1st Submarine Flotilla never inspected Kursks crews qualifications and readiness to fire HTP torpedoes. Kursks crew had no prior experience with HTP-powered torpedoes and had not been trained in handling or firing HTP-powered torpedoes. Due to their inexperience and lack of training, compounded by incomplete inspections and oversight, and because the Kursk": null
    }
]