[
    {
        "               The Russian Revolution was a period of ": null
    },
    {
        "political": "Political Revolution"
    },
    {
        " and ": null
    },
    {
        "social": "Social Revolution"
    },
    {
        " revolution": "Revolution"
    },
    {
        " across the territory of the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        " which started with the abolishment of ": null
    },
    {
        "monarchy": "List Of Russian Rulers"
    },
    {
        " in 1917 and concluded in 1923 after the ": null
    },
    {
        "Bolshevik": "Bolshevik"
    },
    {
        " establishment": "Treaty On The Creation Of The Ussr"
    },
    {
        " of the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        ", including national states of Ukraine, Azebaijan and others, and end of the ": null
    },
    {
        "civil war": "Russian Civil War"
    },
    {
        ".     It began during the Great War, with the ": null
    },
    {
        "February Revolution": "February Revolution"
    },
    {
        " that was focused in and around Petrograd , the capital of Russia at that time. The revolution erupted in the context of Russias major military losses during the ": null
    },
    {
        "First World War": "World War I"
    },
    {
        ", which resulted in much of the Russian Army being ready to mutiny. In the chaos, members of the ": null
    },
    {
        "Duma": "State Duma Of The Russian Empire"
    },
    {
        ", Russias parliament, assumed control of the country, forming the ": null
    },
    {
        "Russian Provisional Government": "Russian Provisional Government"
    },
    {
        ". It was dominated by the interests of large capitalists and the noble ": null
    },
    {
        "aristocracy": "Aristocracy"
    },
    {
        ". The army leadership felt they did not have the means to suppress the revolution, and ": null
    },
    {
        "Emperor": "Emperor Of Russia"
    },
    {
        " Nicholas II": "Nicholas Ii Of Russia"
    },
    {
        " abdicated his throne. Grassroots community assemblies called ": null
    },
    {
        "Soviets": "Soviet"
    },
    {
        ", which were dominated by soldiers and the urban industrial working class, initially permitted the Provisional Government to rule, but insisted on a prerogative to influence the government and control various ": null
    },
    {
        "militias": "Militia"
    },
    {
        ".     A period of ": null
    },
    {
        "dual power": "Dual Power"
    },
    {
        " ensued, during which the ": null
    },
    {
        "Provisional Government": "Russian Provisional Government"
    },
    {
        " held state power while the national network of Soviets, led by ": null
    },
    {
        "socialists": "Socialism"
    },
    {
        ", had the allegiance of the lower classes and, increasingly, the ": null
    },
    {
        "left": "Left-Wing Politics"
    },
    {
        "-leaning urban middle class. During this chaotic period, there were frequent mutinies, protests and strikes. Many socialist political organizations were engaged in daily struggle and vied for influence within the Duma and the Soviets, central among which were the ": null
    },
    {
        "Bolsheviks": "Bolsheviks"
    },
    {
        " led by ": null
    },
    {
        "Vladimir Lenin": "Vladimir Lenin"
    },
    {
        ". He campaigned for an immediate end of Russias participation in the Great War , granting land to the peasants, and providing bread to the urban workers. When the Provisional Government chose to continue fighting the war with Germany, the Bolsheviks and other socialist factions exploited the virtually universal disdain towards the war effort as justification to advance the revolution further. The Bolsheviks turned workers militias under their control into the ": null
    },
    {
        "Red Guards": "Red Guards"
    },
    {
        " , over which they exerted substantial control. Orlando Figes, A Peoples Tragedy, p370     The situation climaxed with the ": null
    },
    {
        "October Revolution": "October Revolution"
    },
    {
        " in 1917, a Bolshevik-led armed insurrection by workers and soldiers in Petrograd that successfully overthrew the Provisional Government, transferring all its authority to the Soviets. They soon relocated the national capital to ": null
    },
    {
        "Moscow": "Moscow"
    },
    {
        ". The Bolsheviks had secured a strong base of support within the Soviets and, as the supreme governing party, established a ": null
    },
    {
        "federal government": "Russian Soviet Federative Socialist Republic"
    },
    {
        " dedicated to reorganizing the former empire into the worlds first ": null
    },
    {
        "socialist state": "Socialist State"
    },
    {
        ", to practice ": null
    },
    {
        "Soviet democracy": "Soviet Democracy"
    },
    {
        " on a national and international scale. Their promise to end Russias participation in the First World War was fulfilled when the Bolshevik leaders signed the ": null
    },
    {
        "Treaty of Brest-Litovsk": "Treaty Of Brest-Litovsk"
    },
    {
        " with Germany in March 1918. To further secure the new state, the Bolsheviks established the ": null
    },
    {
        "Cheka": "Cheka"
    },
    {
        ", a secret police that functioned as a revolutionary security service to weed out, execute, or punish those considered to be enemies of the people in campaigns consciously modeled on those of the ": null
    },
    {
        "French Revolution": "French Revolution"
    },
    {
        ".     Soon after, ": null
    },
    {
        "civil war": "Russian Civil War"
    },
    {
        " erupted among the Reds , the ": null
    },
    {
        "Whites": "White Movement"
    },
    {
        " , the ": null
    },
    {
        "independence movements": "Pro-Independence Movements In Russian Civil War"
    },
    {
        ", and ": null
    },
    {
        "other socialist factions": "Left-Wing Uprisings Against The Bolsheviks"
    },
    {
        " opposed to the Bolsheviks. It continued for several years, during which the Bolsheviks defeated both the Whites and all rival socialists. Victorious, they reconstituted themselves as the ": null
    },
    {
        "Communist Party": "Communist Party Of The Soviet Union"
    },
    {
        ". They also established Soviet power in the newly independent republics of ": null
    },
    {
        "Armenia": "Armenian Soviet Socialist Republic"
    },
    {
        ", ": null
    },
    {
        "Azerbaijan": "Azerbaijan Soviet Socialist Republic"
    },
    {
        ", ": null
    },
    {
        "Belarus": "Byelorussian Soviet Socialist Republic"
    },
    {
        ", ": null
    },
    {
        "Georgia": "Georgian Soviet Socialist Republic"
    },
    {
        " and ": null
    },
    {
        "Ukraine": "Ukrainian Soviet Socialist Republic"
    },
    {
        ". They brought these jurisdictions into ": null
    },
    {
        "unification": "Treaty On The Creation Of The Ussr"
    },
    {
        " under the ": null
    },
    {
        "Union of Soviet Socialist Republics ": "Soviet Union"
    },
    {
        " in 1922. While many notable historical events occurred in Moscow and Petrograd, there were also major changes in cities throughout the state, and among national minorities throughout the empire and in the rural areas, where ": null
    },
    {
        "peasants": "Peasant"
    },
    {
        " took over and redistributed land.               The ": null
    },
    {
        "Russian Revolution of 1905": "Revolution Of 1905"
    },
    {
        " was said to be a major factor contributing to the cause of the Revolutions of 1917. The events of ": null
    },
    {
        "Bloody Sunday": "Bloody Sunday"
    },
    {
        " triggered nationwide protests and soldier mutinies. A council of workers called the ": null
    },
    {
        "St. Petersburg Soviet": "St. Petersburg Soviet"
    },
    {
        " was created in this chaos. Wood, The origins of the Russian Revolution, 1861–1917. London: Routledge. 1979. p. 18 While the 1905 Revolution was ultimately crushed, and the leaders of the St. Petersburg Soviet were arrested, this laid the groundwork for the later ": null
    },
    {
        "Petrograd Soviet": "Petrograd Soviet"
    },
    {
        " and other revolutionary movements during the lead up to 1917. The 1905 Revolution also led to the creation of a Duma , that would later form the Provisional Government following February 1917.      The outbreak of ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " prompted general outcry directed at ": null
    },
    {
        "Tsar Nicholas II": "Nicholas Ii Of Russia"
    },
    {
        " and the ": null
    },
    {
        "Romanov family": "House Of Romanov"
    },
    {
        ". While the nation was initially engaged in a wave of nationalism, increasing numbers of defeats and poor conditions soon flipped the nations opinion. The Tsar attempted to remedy the situation by taking personal control of the army in 1915. This proved to be extremely disadvantageous for the Tsar, as he was now held personally responsible for Russias continuing defeats and losses. In addition, ": null
    },
    {
        "Tsarina Alexandra": "Alexandra Feodorovna"
    },
    {
        ", left to rule in while the Tsar commanded at the front, was German born, leading to suspicion of collusion, only to be exacerbated by rumors relating to her relationship with the controversial mystic ": null
    },
    {
        "Grigori Rasputin": "Grigori Rasputin"
    },
    {
        ". Rasputins influence led to disastrous ministerial appointments and corruption, resulting in a worsening of conditions within Russia. This led to general dissatisfaction with the Romanov family, and was a major factor contributing to the retaliation of the Russian Communists against the royal family.     After the entry of the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        " on the side of the ": null
    },
    {
        "Central Powers": "Central Powers"
    },
    {
        " in October 1914, Russia was deprived of a major trade route through the ": null
    },
    {
        "Dardanelles": "Dardanelles"
    },
    {
        ", which further contributed to the economic crisis, in which Russia became incapable of providing ": null
    },
    {
        "munitions": "Munitions"
    },
    {
        " to their army in the years leading to 1917. However, the problems were primarily administrative, not industrial, as Germany was able to produce great amounts of munitions whilst constantly fighting on two major battlefronts. Wood, 1979. p. 24     The conditions during the war resulted in a devastating loss of morale within the Russian army and the general population of Russia itself. This was particularly apparent in the cities, owing to a lack of food in response to the disruption of agriculture. Food scarcity had become a considerable problem in Russia, but the cause of this did not lie in any failure of the ": null
    },
    {
        "harvests": "Harvests"
    },
    {
        ", which had not been significantly altered during wartime. The indirect reason was that the government, in order to finance the war, printed millions of ": null
    },
    {
        "ruble": "Ruble"
    },
    {
        " notes, and by 1917, inflation had made prices increase up to four times what they had been in 1914. Farmers were consequently faced with a higher cost of living, but with little increase in income. As a result, they tended to hoard their grain and to revert to ": null
    },
    {
        "subsistence farming": "Subsistence Agriculture"
    },
    {
        ". Thus the cities were constantly short of food. At the same time, rising prices led to demands for higher wages in the factories, and in January and February 1916, revolutionary ": null
    },
    {
        "propaganda": "Propaganda"
    },
    {
        ", in part aided by German funds, led to widespread strikes. This resulted in a growing criticism of the government, including an increased participation of workers in revolutionary parties.     Liberal parties too had an increased platform to voice their complaints, as the initial fervor of the war resulted in the Tsarist government creating a variety of political organizations. In July 1915, a Central War Industries Committee was established under the chairmanship of a prominent ": null
    },
    {
        "Octobrist": "October Revolution"
    },
    {
        ", ": null
    },
    {
        "Alexander Guchkov": "Alexander Guchkov"
    },
    {
        " , including ten workers representatives. The Petrograd Mensheviks agreed to join despite the objections of their leaders abroad. All this activity gave renewed encouragement to political ambitions, and in September 1915, a combination of Octobrists and ": null
    },
    {
        "Kadets": "Constitutional Democratic Party"
    },
    {
        " in the Duma demanded the forming of a responsible government. which the Tsar rejected. Wood, 1979. p. 25     All these factors had given rise to a sharp loss of confidence in the regime, even within the ruling class, growing throughout the war. Early in 1916, ": null
    },
    {
        "Guchkov": "Guchkov"
    },
    {
        " discussed with senior army officers and members of the Central War Industries Committee about a possible coup to force the abdication of the Tsar. In December, a small group of nobles assassinated ": null
    },
    {
        "Rasputin": "Rasputin"
    },
    {
        ", and in January 1917 the Tsars uncle, ": null
    },
    {
        "Grand Duke Nicholas": "Grand Duke Nicholas"
    },
    {
        ", was asked indirectly by ": null
    },
    {
        "Prince Lvov": "Georgy Lvov"
    },
    {
        " whether he would be prepared to take over the throne from his nephew, Tsar Nicholas II. None of these incidents were in themselves the immediate cause of the February Revolution, but they do help to explain why the monarchy survived only a few days after it had broken out.     Meanwhile, Socialist Revolutionary leaders in exile, many of them living in ": null
    },
    {
        "Switzerland": "Switzerland"
    },
    {
        ", had been the glum spectators of the collapse of international socialist solidarity. French and German Social Democrats had voted in favour of their respective governments war efforts. ": null
    },
    {
        "Georgi Plekhanov": "Georgi Plekhanov"
    },
    {
        " in ": null
    },
    {
        "Paris": "Paris"
    },
    {
        " had adopted a violently anti-German stand, while ": null
    },
    {
        "Alexander Parvus": "Alexander Parvus"
    },
    {
        " supported the German war effort as the best means of ensuring a revolution in Russia. The Mensheviks largely maintained that Russia had the right to defend herself against Germany, although ": null
    },
    {
        "Julius Martov": "Julius Martov"
    },
    {
        " , now on the left of his group, demanded an end to the war and a settlement on the basis of national self-determination, with no ": null
    },
    {
        "annexations": "Annexation"
    },
    {
        " or ": null
    },
    {
        "indemnities": "Indemnity"
    },
    {
        ".     It was these views of Martov that predominated in a manifesto drawn up by ": null
    },
    {
        "Leon Trotsky": "Leon Trotsky"
    },
    {
        " at a conference in ": null
    },
    {
        "Zimmerwald": "Zimmerwald"
    },
    {
        ", attended by 35 Socialist leaders in September 1915. Inevitably Vladimir Lenin, supported by ": null
    },
    {
        "Zinoviev": "Grigory Zinoviev"
    },
    {
        " and ": null
    },
    {
        "Radek": "Radek"
    },
    {
        ", strongly contested them. Their attitudes became known as the Zimmerwald Left. Lenin rejected both the defence of Russia and the cry for peace. Since the autumn of 1914, he had insisted that from the standpoint of the working class and of the labouring masses the lesser evil would be the defeat of the Tsarist Monarchy ; the war must be turned into a civil war of the proletarian soldiers against their own governments, and if a proletarian victory should emerge from this in Russia, then their duty would be to wage a revolutionary war for the liberation of the masses throughout Europe. Wood, 1979. p. 26            An elementary theory of property, believed by many peasants, was that land should belong to those who work on it. At the same time, peasant life and culture was changing constantly. Change was facilitated by the physical movement of growing numbers of peasant villagers who migrated to and from industrial and urban environments, but also by the introduction of city culture into the village through material goods, the press, and word of mouth. Scholarly literature on peasants is now extensive. Major recent works that examine themes discussed above Christine Worobec, Peasant Russia: Family and Community in the Post Emancipation Period ; Frank and Steinberg, eds., Cultures in Flux ; ": null
    },
    {
        "Barbara Alpern Engel": "Barbara Alpern Engel"
    },
    {
        ", Between the Fields and the City: Women, Work, and Family in Russia, 1861–1914 ; Jeffrey Burds, Peasant Dreams and Market Politics ; Stephen Frank, Crime, Cultural Conflict and Justice in Rural Russia, 1856–1914 .     Workers also had good reasons for discontent: overcrowded housing with often deplorable sanitary conditions, long hours at work , constant risk of injury and death from poor safety and sanitary conditions, harsh discipline , and inadequate wages . At the same time, urban industrial life had its benefits, though these could be just as dangerous as the hardships. There were many encouragements to expect more from life. Acquiring new skills gave many workers a sense of self-respect and confidence, heightening expectations and desires. Living in cities, workers encountered material goods they had never seen in villages. Most importantly, workers living in cities were exposed to new ideas about the social and political order. Among the many scholarly works on Russian workers, see especially , Labor and Society in Tsarist Russia: The Factory Workers of St. Petersburg, 1855–1870 ; Victoria Bonnell, Roots of Rebellion: Workers Politics and Organizations in St. Petersburg and Moscow, 1900–1914 .     The social causes of the Russian Revolution can be derived from centuries of oppression of the lower classes by the Tsarist regime and Nicholass failures in World War I. While rural agrarian peasants had been ": null
    },
    {
        "emancipated": "Emancipation Of The Serfs"
    },
    {
        " from ": null
    },
    {
        "serfdom": "Serfdom"
    },
    {
        " in 1861, they still resented paying redemption payments to the state, and demanded communal tender of the land they worked. The problem was further compounded by the failure of ": null
    },
    {
        "Sergei Wittes": "Sergei Witte"
    },
    {
        " land reforms of the early 20th century. Increasing peasant disturbances and sometimes actual revolts occurred, with the goal of securing ownership of the land they worked. Russia consisted mainly of poor farming peasants and substantial inequality of land ownership, with 1.5% of the population owning 25% of the land.     The rapid industrialization of Russia also resulted in urban overcrowding and poor conditions for urban industrial workers . Between 1890 and 1910, the population of the capital, Saint Petersburg, swelled from 1,033,600 to 1,905,600, with Moscow experiencing similar growth. This created a new proletariat which, due to being crowded together in the cities, was much more likely to protest and go on strike than the peasantry had been in previous times. In one 1904 survey, it was found that an average of 16 people shared each apartment in Saint Petersburg, with six people per room. There was also no running water, and piles of human waste were a threat to the health of the workers. The poor conditions only aggravated the situation, with the number of strikes and incidents of public disorder rapidly increasing in the years shortly before World War I. Because of late industrialization, Russias workers were highly concentrated. By 1914, 40% of Russian workers were employed in factories of 1,000+ workers . 42% worked in 100–1,000 worker enterprises, 18% in 1–100 worker businesses . ": null
    },
    {
        "Joel Carmichael": "Joel Carmichael"
    },
    {
        ", A short history of the Russian Revolution, pp. 23–24        World War I added to the chaos. Conscription across Russia resulted in unwilling citizens being sent off to war. The vast demand for factory production of war supplies and workers resulted in many more labor riots and strikes. Conscription stripped skilled workers from the cities, who had to be replaced with unskilled peasants. When famine began to hit due to the poor railway system, workers abandoned the cities in droves seeking food. Finally, the soldiers themselves, who suffered from a lack of equipment and protection from the elements, began to turn against the Tsar. This was mainly because, as the war progressed, many of the officers who were loyal to the Tsar were killed, being replaced by discontented conscripts from the major cities who had little loyalty to the Tsar.            Many sections of the country had reason to be dissatisfied with the existing autocracy. Nicholas II was a deeply conservative ruler and maintained a strict authoritarian system. Individuals and society in general were expected to show self-restraint, devotion to community, deference to the social hierarchy and a sense of duty to the country. Religious faith helped bind all of these tenets together as a source of comfort and reassurance in the face of difficult conditions and as a means of political authority exercised through the clergy. Perhaps more than any other modern monarch, Nicholas II attached his fate and the future of his dynasty to the notion of the ruler as a saintly and infallible father to his people. See, especially, Dominic Lieven, Nicholas II: Emperor of all the Russias ; Andrew Verner, The Crisis of the Russian Autocracy: Nicholas II and the 1905 Revolution ; Mark Steinberg and Vladimir Khrustalev, The Fall of the Romanovs: Political Dreams and Personal Struggles in a Time of Revolution ; Richard Wortman, Scenarios of Power, vol. 2 ; Orlando Figes, A Peoples Tragedy: The Russian Revolution 1891–1924, Part One.     This vision of the Romanov monarchy left him unaware of the state of his country. With a firm belief that his power to rule was granted by ": null
    },
    {
        "Divine Right": "Divine Right Of Kings"
    },
    {
        ", Nicholas assumed that the Russian people were devoted to him with unquestioning loyalty. This ironclad belief rendered Nicholas unwilling to allow the progressive reforms that might have alleviated the suffering of the Russian people. Even after the 1905 Revolution spurred the Tsar to decree limited civil rights and democratic representation, he worked to limit even these liberties in order to preserve the ultimate authority of the crown.     Despite constant oppression, the desire of the people for democratic participation in government decisions was strong. Since the ": null
    },
    {
        "Age of Enlightenment": "Age Of Enlightenment"
    },
    {
        ", Russian intellectuals had promoted Enlightenment ideals such as the dignity of the individual and the rectitude of democratic representation. These ideals were championed most vociferously by Russias liberals, although populists, Marxists, and anarchists also claimed to support democratic reforms. A growing opposition movement had begun to challenge the Romanov monarchy openly well before the turmoil of World War I.     Dissatisfaction with Russian autocracy culminated in the huge national upheaval that followed the ": null
    },
    {
        "Bloody Sunday": "Bloody Sunday"
    },
    {
        " massacre of January 1905, in which hundreds of unarmed protesters were shot by the Tsars troops. Workers responded to the massacre with a crippling general strike, forcing Nicholas to put forth the ": null
    },
    {
        "October Manifesto": "October Manifesto"
    },
    {
        ", which established a democratically elected parliament . Although the Tsar accepted the 1906 ": null
    },
    {
        "Fundamental State Laws": "Russian Constitution Of 1906"
    },
    {
        " one year later, he subsequently dismissed the first two Dumas when they proved uncooperative. Unfulfilled hopes of democracy fueled revolutionary ideas and violent outbursts targeted at the monarchy.     One of the Tsars principal rationales for risking war in 1914 was his desire to restore the prestige that Russia had lost amid the debacles of the ": null
    },
    {
        "Russo-Japanese War": "Russo-Japanese War"
    },
    {
        " . Nicholas also sought to foster a greater sense of national unity with a war against a common and old enemy. The Russian Empire was an agglomeration of diverse ethnicities that had demonstrated significant signs of disunity in the years before the First World War. Nicholas believed in part that the shared peril and tribulation of a foreign war would mitigate the social unrest over the persistent issues of poverty, inequality, and inhumane working conditions. Instead of restoring Russias political and military standing, ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " led to the slaughter of Russian troops and military defeats that undermined both the monarchy and Russian society to the point of collapse.       The outbreak of war in August 1914 initially served to quiet the prevalent social and political protests, focusing hostilities against a common external enemy, but this patriotic unity did not last long. As the war dragged on inconclusively, war-weariness gradually took its toll. Although many ordinary Russians joined anti-German demonstrations in the first few weeks of the war, hostility toward the Kaiser and the desire to defend their land and their lives did not necessarily translate into enthusiasm for the Tsar or the government. Allan Wildman, The End of the Russian Imperial Army, vol. 1 : 76–80 Hubertus Jahn, Patriotic Culture in Russia During World War I Figes, A Peoples Tragedy, 257–258.     Russias first major battle of the war was a disaster; in the 1914 ": null
    },
    {
        "Battle of Tannenberg": "Battle Of Tannenberg"
    },
    {
        ", over 30,000 Russian troops were killed or wounded and 90,000 captured, while Germany suffered just 12,000 casualties. However, ": null
    },
    {
        "Austro-Hungarian": "Austria-Hungary"
    },
    {
        " forces allied to Germany were driven back deep into the ": null
    },
    {
        "Galicia": "Battle Of Galicia"
    },
    {
        " region by the end of the year. In the autumn of 1915, Nicholas had taken direct command of the army, personally overseeing Russias main theatre of war and leaving his ambitious but incapable wife Alexandra in charge of the government. Reports of corruption and incompetence in the Imperial government began to emerge, and the growing influence of Grigori Rasputin in the Imperial family was widely resented.     In 1915, things took a critical turn for the worse when Germany shifted its focus of attack to the Eastern front. The superior German army  – better led, better trained, and better supplied  – was quite effective against the ill-equipped Russian forces, driving the Russians out of Galicia, as well as ": null
    },
    {
        "Russian Poland": "Congress Poland"
    },
    {
        " during the ": null
    },
    {
        "Gorlice–Tarnów Offensive": "Gorlice–Tarnów Offensive"
    },
    {
        " campaign. By the end of October 1916, Russia had lost between 1,600,000 and 1,800,000 soldiers, with an additional 2,000,000 prisoners of war and 1,000,000 missing, all making up a total of nearly 5,000,000 men.     These staggering losses played a definite role in the mutinies and revolts that began to occur. In 1916, reports of fraternizing with the enemy began to circulate. Soldiers went hungry, lacked shoes, munitions, and even weapons. Rampant discontent lowered morale, which was further undermined by a series of military defeats.          Casualty rates were the most vivid sign of this disaster. By the end of 1914, only five months into the war, around 390,000 Russian men had lost their lives and nearly 1,000,000 were injured. Far sooner than expected, inadequately trained recruits were called for active duty, a process repeated throughout the war as staggering losses continued to mount. The officer class also saw remarkable changes, especially within the lower echelons, which were quickly filled with soldiers rising up through the ranks. These men, usually of peasant or working-class backgrounds, were to play a large role in the politicization of the troops in 1917.     The army quickly ran short of rifles and ammunition , and by mid-1915, men were being sent to the front bearing no arms. It was hoped that they could equip themselves with arms recovered from fallen soldiers, of both sides, on the battlefields. The soldiers did not feel as if they were valuable, rather they felt as if they were expendable.     By the spring of 1915, the army was in steady retreat, which was not always orderly; desertion, plundering, and chaotic flight were not uncommon. By 1916, however, the situation had improved in many respects. Russian troops stopped retreating, and there were even some modest successes in the offensives that were staged that year, albeit at great loss of life. Also, the problem of shortages was largely solved by a major effort to increase domestic production. Nevertheless, by the end of 1916, morale among soldiers was even worse than it had been during the ": null
    },
    {
        "great retreat of 1915": "Great Retreat"
    },
    {
        ". The fortunes of war may have improved, but the fact of war remained which continually took Russian lives. The crisis in morale was rooted fundamentally in the feeling of utter despair that the slaughter would ever end and that anything resembling victory could be achieved. Wildman: The End of the Russian Imperial Army , pp. 85–89, 99–105, 106 .     The war did not only devastate soldiers. By the end of 1915, there were manifold signs that the economy was breaking down under the heightened strain of wartime demand. The main problems were food shortages and rising prices. Inflation dragged incomes down at an alarmingly rapid rate, and shortages made it difficult for an individual to sustain oneself. These shortages were a problem especially in the capital, ": null
    },
    {
        "St. Petersburg": "St. Petersburg"
    },
    {
        ", where distance from supplies and poor transportation networks made matters particularly worse. Shops closed early or entirely for lack of bread, sugar, meat, and other provisions, and lines lengthened massively for what remained. Conditions became increasingly difficult to afford food and physically obtain it.     Strikes increased steadily from the middle of 1915, and so did crime, but, for the most part, people suffered and endured, scouring the city for food. Working class women in St. Petersburg reportedly spent about forty hours a week in food lines, begging, turning to prostitution or crime, tearing down wooden fences to keep stoves heated for warmth, and continued to resent the rich.     Government officials responsible for public order worried about how long peoples patience would last. A report by the St. Petersburg branch of the security police, the ": null
    },
    {
        "Okhrana": "Okhrana"
    },
    {
        ", in October 1916, warned bluntly of the possibility in the near future of riots by the lower classes of the empire enraged by the burdens of daily existence. Doklad petrogradskogo okhrannogo otdeleniia osobomu otdelu departamenta politsii October 1916, Krasnyi arkhiv 17 , 4–35 .     Tsar Nicholas was blamed for all of these crises, and what little support he had left began to crumble. As discontent grew, the State Duma issued a warning to Nicholas in November 1916, stating that, inevitably, a terrible disaster would grip the country unless a constitutional form of government was put in place. Nicholas ignored these warnings and Russias Tsarist regime collapsed a few months later during the February Revolution of 1917. One year later, the Tsar and his entire family were executed.                     At the beginning of February, ": null
    },
    {
        "Petrograd": "Petrograd"
    },
    {
        " workers began several ": null
    },
    {
        "strikes": "Strike Action"
    },
    {
        " and ": null
    },
    {
        "demonstrations": "Demonstration"
    },
    {
        ". On , workers at ": null
    },
    {
        "Putilov": "Putilov Plant"
    },
    {
        ", Petrograds largest industrial plant, announced a strike. Service, 2005. p. 32.     The next day, a series of meetings and rallies were held for ": null
    },
    {
        "International Womens Day": "International Womens Day"
    },
    {
        ", which gradually turned into economic and political gatherings. Demonstrations were organised to demand ": null
    },
    {
        "bread": "Bread"
    },
    {
        ", and these were supported by the industrial working force who considered them a reason for continuing the strikes. The women workers marched to nearby factories bringing out over 50,000 workers on strike. , Fifth International 11 July 2007. By , virtually every industrial enterprise in Petrograd had been shut down, together with many commercial and service enterprises. Students, white-collar workers, and teachers joined the workers in the streets and at public meetings.     To quell the riots, the Tsar looked to the army. At least 180,000 troops were available in the capital, but most were either untrained or injured. Historian Ian Beckett suggests around 12,000 could be regarded as reliable, but even these proved reluctant to move in on the crowd, since it included so many women. It was for this reason that on , when the Tsar ordered the army to suppress the rioting by force, troops began to revolt. Beckett, 2007. p. 523. Although few actively joined the rioting, many officers were either shot or went into hiding; the ability of the garrison to hold back the protests was all but nullified, symbols of the Tsarist regime were rapidly torn down around the city, and governmental authority in the capital collapsed – not helped by the fact that Nicholas had prorogued the Duma that morning, leaving it with no legal authority to act. The response of the Duma, urged on by the liberal bloc, was to establish a Temporary Committee to restore law and order; meanwhile, the socialist parties established the Petrograd Soviet to represent workers and soldiers. The remaining loyal units switched allegiance the next day. Wade, 2005. pp. 40–43.     The Tsar directed the royal train back towards Petrograd, which was stopped on , by a group of revolutionaries at ": null
    },
    {
        "Malaya Vishera": "Malaya Vishera"
    },
    {
        ". When the Tsar finally arrived at in ": null
    },
    {
        "Pskov": "Pskov"
    },
    {
        ", the Army Chief ": null
    },
    {
        "Nikolai Ruzsky": "Nikolai Ruzsky"
    },
    {
        ", and the Duma deputies ": null
    },
    {
        "Alexander Guchkov": "Guchkov"
    },
    {
        " and ": null
    },
    {
        "Vasily Shulgin": "Vasily Shulgin"
    },
    {
        " suggested in unison that he abdicate the throne. He did so on , on behalf of himself, and then, having taken advice on behalf of his son, the ": null
    },
    {
        "Tsarevich": "Alexei Nikolaevich, Tsarevich Of Russia"
    },
    {
        ". Nicholas nominated his brother, the ": null
    },
    {
        "Grand Duke Michael Alexandrovich": "Grand Duke Michael Alexandrovich Of Russia"
    },
    {
        ", to succeed him. But the Grand Duke realised that he would have little support as ruler, so he declined the crown on , stating that he would take it only if that was the consensus of democratic action. Browder and Kerensky, 1961. p. 116. Six days later, Nicholas, no longer Tsar and addressed with contempt by the sentries as Nicholas Romanov , was reunited with his family at the ": null
    },
    {
        "Alexander Palace": "Alexander Palace"
    },
    {
        " at ": null
    },
    {
        "Tsarskoye Selo": "Tsarskoye Selo"
    },
    {
        ". Tames, 1972. He was placed under ": null
    },
    {
        "house arrest": "House Arrest"
    },
    {
        " with his family by the Provisional Government.     The immediate effect of the February Revolution was a widespread atmosphere of elation and excitement in Petrograd. Malone, 2004. p. 91. On , a provisional government was announced. The center-left was well represented, and the government was initially chaired by a liberal aristocrat, ": null
    },
    {
        "Prince Georgy Yevgenievich Lvov": "Georgy Lvov"
    },
    {
        ", a member of the ": null
    },
    {
        "Constitutional Democratic Party": "Constitutional Democratic Party"
    },
    {
        " . Service, 2005. p. 34. The socialists had formed their rival body, the ": null
    },
    {
        "Petrograd Soviet": "Petrograd Soviet"
    },
    {
        " four days earlier. The Petrograd Soviet and the Provisional Government competed for power over Russia.          dvoevlastiethe replacement of the monarchy by a republic, guaranteed civil rights, a democratic police and army, abolition of religious and ethnic discrimination, preparation of elections to a constituent assembly, and so onOxford, 1955; originally published in Russian in 1922": null
    },
    {
        "State Archive of the Russian Federation": "State Archive Of The Russian Federation"
    },
    {
        "dvoevlastiewhich developed into a nationwide movement with a national leadershipVTsIKSRPwhich, however, was no more successful than its predecessorsOn arrival back in Russia, these soldiers were either imprisoned or sent straight back into the front.as seen in the slogan all power to the Soviets Oxford University Press: London, 1980Progress Publishers: Moscow, 1974present-day St. PetersburgProgress Publishers: Moscow, 1972": null
    },
    {
        "Lev Kamenev": "Lev Kamenev"
    },
    {
        " and ": null
    },
    {
        "Grigory Zinoviev": "Grigory Zinoviev"
    },
    {
        " prominently dissenting Reds under clear Bolshevik dominance30 volumes199610 March 1921New York: Viking Press 1997Kronstadt Rebellion 1921 and Its Descendants in Finlandpeasants defending their property against the opposing forces": null
    },
    {
        "ss": "Ss"
    },
    {
        "wspap": "Wspap"
    },
    {
        "New York: Free Press, 1994New York: Knopf, 1993i.e. by means of revolution20032which still remains to this dayCDA2014now known as Southeast AsiaJuly 1972and the USSRIndiana University Press, 19971917-19231923-1953July 2017": null
    },
    {
        "stori": "Stori"
    },
    {
        "  1965 filmfilm1997 filmDLCnow Volgograd": null
    }
]