[
    {
        "   Rutherfordium is a ": null
    },
    {
        "synthetic": "Synthetic Element"
    },
    {
        " chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        " Rf and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " 104, named after New Zealand physicist ": null
    },
    {
        "Ernest Rutherford": "Ernest Rutherford"
    },
    {
        ". As a synthetic element, it is not found in nature and can only be created in a laboratory. It is ": null
    },
    {
        "radioactive": "Radioactive"
    },
    {
        "; the most stable known ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        ", 267 Rf, has a ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of approximately 1.3  hours.     In the ": null
    },
    {
        "periodic table": "Periodic Table"
    },
    {
        " of the elements, it is a ": null
    },
    {
        "d-block": "D-Block"
    },
    {
        " element and the second of the fourth-row ": null
    },
    {
        "transition element": "Transition Element"
    },
    {
        "s. It is a member of the ": null
    },
    {
        "7th period": "Period 7"
    },
    {
        " and belongs to the ": null
    },
    {
        "group 4 elements": "Group 4 Elements"
    },
    {
        ". Chemistry experiments have confirmed that rutherfordium behaves as the heavier ": null
    },
    {
        "homologue": "Homology"
    },
    {
        " to ": null
    },
    {
        "hafnium": "Hafnium"
    },
    {
        " in group 4. The chemical properties of rutherfordium are characterized only partly. They compare well with the chemistry of the other group 4 elements, even though some calculations had indicated that the element might show significantly different properties due to ": null
    },
    {
        "relativistic effects": "Relativistic Quantum Chemistry"
    },
    {
        ".     In the 1960s, small amounts of rutherfordium were produced in the ": null
    },
    {
        "Joint Institute for Nuclear Research": "Joint Institute For Nuclear Research"
    },
    {
        " in the former ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " and at ": null
    },
    {
        "Lawrence Berkeley National Laboratory": "Lawrence Berkeley National Laboratory"
    },
    {
        " in ": null
    },
    {
        "California": "California"
    },
    {
        ".  The priority of the discovery and therefore the ": null
    },
    {
        "naming of the element was disputed": "Element Naming Controversy"
    },
    {
        " between Soviet and American scientists, and it was not until 1997 that ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "International Union Of Pure And Applied Chemistry"
    },
    {
        " established rutherfordium as the official name for the element.           Rutherfordium was reportedly ": null
    },
    {
        "first detected": "Discovery Of The Chemical Elements"
    },
    {
        " in 1964 at the ": null
    },
    {
        "Joint Institute of Nuclear Research": "Jinr"
    },
    {
        " at ": null
    },
    {
        "Dubna": "Dubna"
    },
    {
        " . Researchers there bombarded a ": null
    },
    {
        "plutonium": "Plutonium"
    },
    {
        "-242 target with ": null
    },
    {
        "neon": "Neon"
    },
    {
        "-22 ": null
    },
    {
        "ions": "Ion"
    },
    {
        "and separated the reaction products by gradient thermochromatography after conversion to chlorides by interaction with ": null
    },
    {
        "ZrCl 4 ": "Zirconium Tetrachloride"
    },
    {
        ". The team identified ": null
    },
    {
        "spontaneous fission": "Spontaneous Fission"
    },
    {
        " activity contained within a volatile chloride portraying eka-hafnium properties. Although a half-life was not accurately determined, later calculations indicated that the product was most likely rutherfordium-259      : +  →  → Cl 4     In 1969, researchers at the ": null
    },
    {
        "University of California, Berkeley": "University Of California, Berkeley"
    },
    {
        " conclusively synthesized the element by bombarding a ": null
    },
    {
        "californium": "Californium"
    },
    {
        "-249 target with ": null
    },
    {
        "carbon-12": "Carbon-12"
    },
    {
        " ions and measured the alpha decay of 257 Rf, correlated with the daughter decay of ": null
    },
    {
        "nobelium": "Nobelium"
    },
    {
        "-253:    : +  →  + 4      The American synthesis was independently confirmed in 1973 and secured the identification of rutherfordium as the parent by the observation of ": null
    },
    {
        "K-alpha": "K-Alpha"
    },
    {
        " X-rays": "X-Rays"
    },
    {
        " in the elemental signature of the 257 Rf decay product, nobelium-253.                The Russian scientists proposed the name kurchatovium and the American scientists suggested the name rutherfordium for the new element.  In 1992, the ": null
    },
    {
        "IUPAC": "International Union Of Pure And Applied Chemistry"
    },
    {
        "/": null
    },
    {
        "IUPAP": "International Union Of Pure And Applied Physics"
    },
    {
        " Transfermium Working Group assessed the claims of discovery and concluded that both teams provided contemporaneous evidence to the synthesis of element 104 and that credit should be shared between the two groups.     The American group wrote a scathing response to the findings of the TWG, stating that they had given too much emphasis on the results from the Dubna group. In particular they pointed out that the Russian group had altered the details of their claims several times over a period of 20 years, a fact that the Russian team does not deny. They also stressed that the TWG had given too much credence to the chemistry experiments performed by the Russians and accused the TWG of not having appropriately qualified personnel on the committee. The TWG responded by saying that this was not the case and having assessed each point raised by the American group said that they found no reason to alter their conclusion regarding priority of discovery.  The IUPAC finally used the name suggested by the American team  which may in some way reflect a change of opinion.      As a consequence of the initial competing claims of discovery, an ": null
    },
    {
        "element naming controversy": "Element Naming Controversy"
    },
    {
        " arose. Since the Soviets claimed to have first detected the new element they suggested the name kurchatovium in honor of ": null
    },
    {
        "Igor Kurchatov": "Igor Kurchatov"
    },
    {
        " , former head of ": null
    },
    {
        "Soviet nuclear research": "Soviet Nuclear Research"
    },
    {
        ". This name had been used in books of the ": null
    },
    {
        "Soviet Bloc": "Soviet Bloc"
    },
    {
        " as the official name of the element. The Americans, however, proposed rutherfordium for the new element to honor ": null
    },
    {
        "Ernest Rutherford": "Ernest Rutherford, 1St Baron Rutherford Of Nelson"
    },
    {
        ", who is known as the father of ": null
    },
    {
        "nuclear physics": "Nuclear Physics"
    },
    {
        ". The International Union of Pure and Applied Chemistry  adopted unnilquadium as a temporary, ": null
    },
    {
        "systematic element name": "Systematic Element Name"
    },
    {
        ", derived from the Latin names for digits 1, 0, and 4. In 1994, IUPAC suggested the name dubnium to be used since rutherfordium was suggested for element 106 and IUPAC felt that the Dubna team should be recognized for their contributions. However, there was still a dispute over the names of elements 104–107. In 1997 the teams involved resolved the dispute and adopted the current name rutherfordium. The name  dubnium  was given to element 105 at the same time.                  Rutherfordium has no stable or naturally occurring isotopes. Several radioactive isotopes have been synthesized in the laboratory, either by fusing two atoms or by observing the decay of heavier elements. Sixteen different isotopes have been reported with atomic masses from 253 to 270 . Most of these decay predominantly through spontaneous fission pathways.        Out of isotopes whose half-lives are known, the lighter isotopes usually have shorter half-lives; half-lives of under 50 μs for 253 Rf and 254 Rf were observed. 256 Rf, 258 Rf, 260 Rf are more stable at around 10 ms, 255 Rf, 257 Rf, 259 Rf, and 262 Rf live between 1 and 5 seconds, and 261 Rf, 265 Rf, and 263 Rf are more stable, at around 1.1, 1.5, and 10 minutes respectively. The heaviest isotopes are the most stable, with 267 Rf having a measured half-life of about 1.3 hours.     The lightest isotopes were synthesized by direct fusion between two lighter nuclei and as decay products. The heaviest isotope produced by direct fusion is 262 Rf; heavier isotopes have only been observed as decay products of elements with larger atomic numbers, of which only 267 Rf has been confirmed. The heavy isotopes 266 Rf and 268 Rf have also been observed as ": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        " daughters of the ": null
    },
    {
        "dubnium": "Dubnium"
    },
    {
        " isotopes 266 Db and 268 Db, but have short half-lives to ": null
    },
    {
        "spontaneous fission": "Spontaneous Fission"
    },
    {
        ". It seems likely that the same is true of 270 Rf, a likely daughter of 270 Db.      In 1999, American scientists at the University of California, Berkeley, announced that they had succeeded in synthesizing three atoms of 293 Og.  These parent nuclei were reported to have successively emitted seven alpha particles to form 265 Rf nuclei, but their claim was retracted in 2001.  This isotope was later discovered in 2010 as the final product in the decay chain of 285 Fl.              Rutherfordium is the first ": null
    },
    {
        "transactinide element": "Transactinide Element"
    },
    {
        " and the second member of the 6d series of transition metals. Calculations on its ": null
    },
    {
        "ionization potential": "Ionization Potential"
    },
    {
        "s, ": null
    },
    {
        "atomic radius": "Atomic Radius"
    },
    {
        ", as well as radii, orbital energies, and ground levels of its ionized states are similar to that of ": null
    },
    {
        "hafnium": "Hafnium"
    },
    {
        " and very different from that of ": null
    },
    {
        "lead": "Lead"
    },
    {
        ". Therefore, it was concluded that rutherfordiums basic properties will resemble those of other ": null
    },
    {
        "group 4 element": "Group 4 Element"
    },
    {
        "s, below ": null
    },
    {
        "titanium": "Titanium"
    },
    {
        ", ": null
    },
    {
        "zirconium": "Zirconium"
    },
    {
        ", and hafnium. Some of its properties were determined by gas-phase experiments and aqueous chemistry. The oxidation state +4 is the only stable state for the latter two elements and therefore rutherfordium should also exhibit a stable +4 state. In addition, rutherfordium is also expected to be able to form a less stable +3 state. The ": null
    },
    {
        "standard reduction potential": "Standard Reduction Potential"
    },
    {
        " of the Rf 4+ /Rf couple is predicted to be higher than −1.7  V.     Initial predictions of the chemical properties of rutherfordium were based on calculations which indicated that the relativistic effects on the electron shell might be strong enough that the ": null
    },
    {
        "7p orbitals": "P Orbital"
    },
    {
        " would have a lower energy level than the ": null
    },
    {
        "6d orbitals": "D Orbital"
    },
    {
        ", giving it a ": null
    },
    {
        "valence electron": "Valence Electron"
    },
    {
        " configuration of 6d 1 7s 2 7p 1 or even 7s 2 7p 2 , therefore making the element behave more like ": null
    },
    {
        "lead": "Lead"
    },
    {
        " than hafnium. With better calculation methods and experimental studies of the chemical properties of rutherfordium compounds it could be shown that this does not happen and that rutherfordium instead behaves like the rest of the ": null
    },
    {
        "group 4 element": "Group 4 Element"
    },
    {
        "s.  Later it was shown in ab initio calculations with the high level of accuracy    that the Rf atom has the ground state with the 6d 2 7s 2 valence configuration and the low-lying excited 6d 1 7s 2 7p 1 state with the excitation energy of only 0.3÷0.5 eV.     In an analogous manner to zirconium and hafnium, rutherfordium is projected to form a very stable, ": null
    },
    {
        "refractory": "Refractory"
    },
    {
        " oxide, RfO 2 . It reacts with halogens to form tetrahalides, RfX 4 , which hydrolyze on contact with water to form oxyhalides RfOX 2 . The tetrahalides are volatile solids existing as monomeric tetrahedral molecules in the vapor phase.     In the aqueous phase, the Rf 4+ ion hydrolyzes less than titanium and to a similar extent as zirconium and hafnium, thus resulting in the RfO 2+ ion. Treatment of the halides with halide ions promotes the formation of complex ions. The use of chloride and bromide ions produces the hexahalide complexes  and . For the fluoride complexes, zirconium and hafnium tend to form hepta- and octa- complexes. Thus, for the larger rutherfordium ion, the complexes ,  and  are possible.       Rutherfordium is expected to be a solid under normal conditions and assume a ": null
    },
    {
        "hexagonal close-packed": "Hexagonal Close-Packed"
    },
    {
        " crystal structure , similar to its lighter ": null
    },
    {
        "congener": "Congener"
    },
    {
        " hafnium. It should be a very heavy metal with a ": null
    },
    {
        "density": "Density"
    },
    {
        " of around 23.2  g/cm 3 ; in comparison, the densest known element that has had its density measured, ": null
    },
    {
        "osmium": "Osmium"
    },
    {
        ", has a density of 22.61  g/cm 3 . This results from rutherfordiums high atomic weight, the ": null
    },
    {
        "lanthanide and actinide contractions": "Lanthanide Contraction"
    },
    {
        ", and ": null
    },
    {
        "relativistic effects": "Relativistic Quantum Chemistry"
    },
    {
        ", although production of enough rutherfordium to measure this quantity would be impractical, and the sample would quickly decay. The atomic radius for rutherfordium is expected to be around 150  ": null
    },
    {
        "pm": "Picometer"
    },
    {
        ". Due to the relativistic stabilization of the 7s orbital and destabilization of the 6d orbital, the Rf + and Rf 2+ ions are predicted to give up 6d electrons instead of 7s electrons, which is the opposite of the behavior of its lighter homologues. When under high pressure , rutherfordium is expected to transition to a ": null
    },
    {
        "body-centered cubic": "Body-Centered Cubic"
    },
    {
        " crystal structure; hafnium transforms to this structure at 71±1  GPa, but has an intermediate & omega; structure that it transforms to at 38±8  GPa that is lacking for rutherfordium.                    Early work on the study of the chemistry of rutherfordium focused on gas thermochromatography and measurement of relative deposition temperature adsorption curves. The initial work was carried out at Dubna in an attempt to reaffirm their discovery of the element. Recent work is more reliable regarding the identification of the parent rutherfordium radioisotopes. The isotope 261m Rf has been used for these studies, though the long-lived isotope 267 Rf may be advantageous for future experiments.  The experiments relied on the expectation that rutherfordium would begin the new 6d series of elements and should therefore form a volatile tetrachloride due to the tetrahedral nature of the molecule.   Rutherfordium chloride is more volatile than its lighter homologue ": null
    },
    {
        "hafnium chloride": "Hafnium Chloride"
    },
    {
        " because its bonds are more ": null
    },
    {
        "covalent": "Covalent Bond"
    },
    {
        ".     A series of experiments confirmed that rutherfordium behaves as a typical member of group 4, forming a tetravalent chloride and bromide as well as an oxychloride . A decreased volatility was observed for  when ": null
    },
    {
        "potassium chloride": "Potassium Chloride"
    },
    {
        " is provided as the solid phase instead of gas, highly indicative of the formation of nonvolatile  mixed salt.        Rutherfordium is expected to have the electron configuration f 14 6d 2 7s 2 and therefore behave as the heavier homologue of ": null
    },
    {
        "hafnium": "Hafnium"
    },
    {
        " in group 4 of the periodic table. It should therefore readily form a hydrated Rf 4+ ion in strong acid solution and should readily form complexes in ": null
    },
    {
        "hydrochloric acid": "Hydrochloric Acid"
    },
    {
        ", ": null
    },
    {
        "hydrobromic": "Hydrobromic Acid"
    },
    {
        " or ": null
    },
    {
        "hydrofluoric acid": "Hydrofluoric Acid"
    },
    {
        " solutions.     The most conclusive aqueous chemistry studies of rutherfordium have been performed by the Japanese team at ": null
    },
    {
        "Japan Atomic Energy Research Institute": "Japan Atomic Energy Research Institute"
    },
    {
        " using the isotope 261m Rf. Extraction experiments from hydrochloric acid solutions using isotopes of rutherfordium, hafnium, zirconium, as well as the pseudo-group 4 element ": null
    },
    {
        "thorium": "Thorium"
    },
    {
        " have proved a non-actinide behavior for rutherfordium. A comparison with its lighter homologues placed rutherfordium firmly in group 4 and indicated the formation of a hexachlororutherfordate complex in chloride solutions, in a manner similar to hafnium and zirconium.      : + 6  →      Very similar results were observed in hydrofluoric acid solutions. Differences in the extraction curves were interpreted as a weaker affinity for fluoride ion and the formation of the hexafluororutherfordate ion, whereas hafnium and zirconium ions complex seven or eight fluoride ions at the concentrations used:     : + 6  → ": null
    }
]