[
    {
        "     The Salian dynasty  was a ": null
    },
    {
        "dynasty": "Dynasty"
    },
    {
        " in the ": null
    },
    {
        "High Middle Ages": "High Middle Ages"
    },
    {
        ". The dynasty provided four ": null
    },
    {
        "German Kings": "List Of German Kings And Emperorskings"
    },
    {
        " , all of whom went on to be crowned ": null
    },
    {
        "Holy Roman Emperor": "Holy Roman Emperor"
    },
    {
        " ; as such, the term Salic dynasty is also used to refer to the ": null
    },
    {
        "Holy Roman Empire": "Holy Roman Empire"
    },
    {
        " of the time as a separate term.     After the death of the last ": null
    },
    {
        "Saxon": "Duchy Of Saxony"
    },
    {
        " of the ": null
    },
    {
        "Ottonian Dynasty": "Ottonian Dynasty"
    },
    {
        " in 1024, the ": null
    },
    {
        "elective": "Elective Monarchy"
    },
    {
        " titles of ": null
    },
    {
        "King of the Germans": "King Of The Germans"
    },
    {
        " and then three years later Holy Roman Emperor both passed to the first monarch of the Salian dynasty in the person of ": null
    },
    {
        "Conrad II": "Conrad Ii, Holy Roman Emperor"
    },
    {
        ", the only son of ": null
    },
    {
        "Count Henry of Speyer": "Henry Of Speyer"
    },
    {
        " and ": null
    },
    {
        "Adelheid of Alsace": "Adelheid Of Alsace"
    },
    {
        " . He was elected German King in 1024 and crowned Holy Roman Emperor on 26 March 1027.     The four Salian kings of the dynasty—": null
    },
    {
        "Conrad II": "Conrad Ii, Holy Roman Emperor"
    },
    {
        ", ": null
    },
    {
        "Henry III": "Henry Iii, Holy Roman Emperor"
    },
    {
        ", ": null
    },
    {
        "Henry IV": "Henry Iv, Holy Roman Emperor"
    },
    {
        ", and ": null
    },
    {
        "Henry V": "Henry V, Holy Roman Emperor"
    },
    {
        "—ruled the Holy Roman Empire from 1027 to 1125, and firmly established their monarchy as a major European power. They achieved the development of a permanent administrative system based on a class of public officials answerable to the crown.            ": null
    },
    {
        "Werner": "Werner V"
    },
    {
        " of ": null
    },
    {
        "Worms": "Worms, Germany"
    },
    {
        " and his son Duke ": null
    },
    {
        "Conrad the Red": "Conrad The Red"
    },
    {
        " of Lorraine, who died in 955, founded the ancestral dynasty. Conrad the Red married ": null
    },
    {
        "Liutgarde": "Liutgard Of Saxony"
    },
    {
        ", a daughter of ": null
    },
    {
        "Emperor Otto I": "Otto I, Holy Roman Emperor"
    },
    {
        ". Their son ": null
    },
    {
        "Otto I, Duke of Carinthia": "Otto I, Duke Of Carinthia"
    },
    {
        " ruled Carinthia from 978 to 1004.     Duke Otto had three sons: Bruno, who became ": null
    },
    {
        "Pope Gregory V": "Pope Gregory V"
    },
    {
        "; Conrad; and ": null
    },
    {
        "Henry": "Henry Of Speyer"
    },
    {
        ", count of ": null
    },
    {
        "Speyer": "Speyer"
    },
    {
        ". Henry was the father of the first Salian Emperor Conrad II.     ": null
    },
    {
        "Pope Leo IX": "Pope Leo Ix"
    },
    {
        " also had family ties to the dynasty, since his grandfather Hugo III was the brother of Adelheid, the grandmother of ": null
    },
    {
        "Henry III": "Henry Iii, Holy Roman Emperor"
    },
    {
        ".       After the death of the last Saxon Emperor ": null
    },
    {
        "Henry II": "Henry Ii, Holy Roman Emperor"
    },
    {
        " the first Salian regent Conrad II was elected by the majority of the ": null
    },
    {
        "Prince-electors": "Prince-Elector"
    },
    {
        "and was crowned German king in ": null
    },
    {
        "Mainz": "Mainz"
    },
    {
        " on 8 September 1024. Early in 1026 Conrad went to ": null
    },
    {
        "Milan": "Milan"
    },
    {
        ", where ": null
    },
    {
        "Ariberto": "Archbishop Aribert Of Milan"
    },
    {
        ", ": null
    },
    {
        "archbishop of Milan": "Archbishop Of Milan"
    },
    {
        ", crowned him ": null
    },
    {
        "king of Italy": "King Of Italy"
    },
    {
        ". When ": null
    },
    {
        "Rudolph III, King of Burgundy": "Rudolph Iii, King Of Burgundy"
    },
    {
        " died 1032, Conrad II also claimed this kingship on the basis of an inheritance Henry II had extorted from the former in 1006. Despite some opposition, the Burgundian and Provençal nobles paid homage to Conrad in ": null
    },
    {
        "Zürich": "Zürich"
    },
    {
        " in 1034. This Kingdom of Burgundy would become known as the ": null
    },
    {
        "Kingdom of Arles": "Kingdom Of Arles"
    },
    {
        " under Conrads successors.     Already in 1028 Conrad II had his son ": null
    },
    {
        "Henry III": "Henry Iii, Holy Roman Emperor"
    },
    {
        " elected and anointed king of Germany. Henrys tenure led to an overstatement of previously unknown sacral kingship. So during this reign ": null
    },
    {
        "Speyer Cathedral": "Speyer Cathedral"
    },
    {
        " was expanded to be the largest church in Western Christendom. Henrys conception of a legitimate power of royal disposition in the duchies was successful against the dukes, and thus secured royal control. However, in ": null
    },
    {
        "Lorraine": "Lorraine"
    },
    {
        ", this led to years of conflict, from which Henry emerged as the winner. But also in southern Germany a powerful opposition group was formed in the years 1052–1055. 1046 Henry ended the ": null
    },
    {
        "papal schism": "Schism"
    },
    {
        ", freed the Papacy from dependence on the Roman nobility, and laid the basis for its universal applicability. His early death in 1056 was long regarded as a disaster for the Empire.      The early Salians owed much of their success to their alliance with the ": null
    },
    {
        "Church": "Catholic Church"
    },
    {
        ", a policy begun by Otto I, which gave them the material support they needed to subdue rebellious dukes. In time, however, the Church came to regret this close relationship. The alliance broke down in 1075 during what came to be known as the ": null
    },
    {
        "Investiture Controversy": "Investiture Controversy"
    },
    {
        " , a struggle in which the reformist Pope, ": null
    },
    {
        "Gregory VII": "Pope Gregory Vii"
    },
    {
        ", demanded that Emperor ": null
    },
    {
        "Henry IV": "Henry Iv, Holy Roman Emperor"
    },
    {
        " renounce his rights over the Church in Germany. The pope also attacked the concept of monarchy by divine right and gained the support of significant elements of the German nobility interested in limiting imperial absolutism. More important, the pope forbade ecclesiastical officials under pain of excommunication to support Henry as they had so freely done in the past. In the end, Henry IV journeyed to ": null
    },
    {
        "Canossa": "Canossa"
    },
    {
        " in northern ": null
    },
    {
        "Italy": "Italy"
    },
    {
        " in 1077 to do penance and to receive absolution from the pope. However, he resumed the practice of lay investiture and arranged the election of an ": null
    },
    {
        "antipope": "Antipope"
    },
    {
        "  in 1080.     The monarchs struggle with the papacy resulted in a war that ravaged through the Holy Roman Empire from 1077 until the ": null
    },
    {
        "Concordat of Worms": "Concordat Of Worms"
    },
    {
        " in 1122. The reign of the last ruler of the Salian dynasty ": null
    },
    {
        "Henry V": "Henry V, Holy Roman Emperor"
    },
    {
        " coincided with the final phase of the great ": null
    },
    {
        "Investiture Controversy": "Investiture Controversy"
    },
    {
        ", which had pitted pope against emperor. By the settlement of the Concordat of Worms, Henry V surrendered to the demands of the second generation of ": null
    },
    {
        "Gregorian reform": "Gregorian Reform"
    },
    {
        "ers. This agreement stipulated that the pope would appoint high church officials but gave the German king the right to veto the papal choices. Imperial control of Italy was lost for a time, and the imperial crown became dependent on the political support of competing aristocratic factions. Feudalism also became more widespread as freemen sought protection by swearing allegiance to a lord. These powerful local rulers, having thereby acquired extensive territories and large military retinues, took over administration within their territories and organized it around an increasing number of castles. The most powerful of these local rulers came to be called princes rather than dukes.     According to the laws of the feudal system of the Holy Roman Empire, the king had no claims on the vassals of the other princes, only on those living within his familys territory. Lacking the support of the formerly independent vassals and weakened by the increasing hostility of the Church, the monarchy lost its pre-eminence. Thus the Investiture Contest strengthened local power in the Holy Roman Empire – in contrast to the trend in France and England, where centralized royal power grew. The Investiture Contest had an additional effect. The long struggle between emperor and pope hurt the Holy Roman Empires intellectual life, in this period largely confined to monasteries, and the empire no longer led or even kept pace with developments occurring in ": null
    },
    {
        "France": "France"
    },
    {
        " and ": null
    },
    {
        "Italy": "Italy"
    },
    {
        ". For instance, no universities were founded in the Holy Roman Empire until the fourteenth century.     The first ": null
    },
    {
        "Hohenstaufen": "House Of Hohenstaufen"
    },
    {
        " king ": null
    },
    {
        "Conrad III": "Conrad Iii Of Germany"
    },
    {
        " was a grandson of the Salian ": null
    },
    {
        "Henry IV, Holy Roman Emperor": "Henry Iv, Holy Roman Emperor"
    },
    {
        ".         ": null
    },
    {
        "Conrad II": "Conrad Ii, Holy Roman Emperor"
    },
    {
        " 1024–1039, crowned emperor on 26 March 1027   ": null
    },
    {
        "Henry III": "Henry Iii, Holy Roman Emperor"
    },
    {
        " 1039–1056, crowned emperor on 25 December 1046   ": null
    },
    {
        "Henry IV": "Henry Iv, Holy Roman Emperor"
    },
    {
        " 1056–1106, crowned emperor on 31 March 1084   ": null
    },
    {
        "Conrad ": "Conrad Ii Of Italy"
    },
    {
        " 1087–1098, nominal king under his father Henry IV   ": null
    },
    {
        "Henry V": "Henry V, Holy Roman Emperor"
    },
    {
        " 1106–1125, crowned emperor on 13 April 1111     Their regnal dates as emperor take into account elections and subsequent ": null
    },
    {
        "coronations": "Coronation Of The Holy Roman Emperor"
    },
    {
        ".                         ": null
    }
]