[
    {
        "   Samarium is a ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        "  Sm and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        "  62. It is a moderately hard silvery ": null
    },
    {
        "metal": "Metal"
    },
    {
        " that slowly oxidizes in air. Being a typical member of the ": null
    },
    {
        "lanthanide": "Lanthanide"
    },
    {
        " series, samarium usually assumes the ": null
    },
    {
        "oxidation state": "Oxidation State"
    },
    {
        " +3. Compounds of samarium are also known, most notably the ": null
    },
    {
        "monoxide": "Monoxide"
    },
    {
        " SmO, ": null
    },
    {
        "monochalcogenides": "Samarium Monochalcogenides"
    },
    {
        " SmS, SmSe and SmTe, as well as ": null
    },
    {
        "samarium iodide": "Samarium Iodide"
    },
    {
        ". The last compound is a common ": null
    },
    {
        "reducing agent": "Reducing Agent"
    },
    {
        " in ": null
    },
    {
        "chemical synthesis": "Chemical Synthesis"
    },
    {
        ". Samarium has no significant biological role but is only slightly toxic.     Samarium was discovered in 1879 by the French chemist ": null
    },
    {
        "Paul-Émile Lecoq de Boisbaudran": "Paul-Émile Lecoq De Boisbaudran"
    },
    {
        " and named after the mineral ": null
    },
    {
        "samarskite": "Samarskite"
    },
    {
        " from which it was isolated. The mineral itself was earlier named after a Russian mine official, Colonel ": null
    },
    {
        "Vassili Samarsky-Bykhovets": "Vassili Samarsky-Bykhovets"
    },
    {
        ", who thereby became the first person to have a chemical element named after him, albeit indirectly. Although classified as a ": null
    },
    {
        "rare-earth element": "Rare-Earth Element"
    },
    {
        ", samarium is the 40th most abundant element in the Earths crust and is more common than metals such as ": null
    },
    {
        "tin": "Tin"
    },
    {
        ". Samarium occurs with concentration up to 2.8% in several minerals including ": null
    },
    {
        "cerite": "Cerite"
    },
    {
        ", ": null
    },
    {
        "gadolinite": "Gadolinite"
    },
    {
        ", samarskite, ": null
    },
    {
        "monazite": "Monazite"
    },
    {
        " and ": null
    },
    {
        "bastnäsite": "Bastnäsite"
    },
    {
        ", the last two being the most common commercial sources of the element. These minerals are mostly found in China, the United States, Brazil, India, Sri Lanka and Australia; China is by far the world leader in samarium mining and production.     The major commercial application of samarium is in ": null
    },
    {
        "samarium–cobalt magnet": "Samarium–Cobalt Magnet"
    },
    {
        "s, which have ": null
    },
    {
        "permanent magnetization": "Magnet"
    },
    {
        " second only to ": null
    },
    {
        "neodymium magnet": "Neodymium Magnet"
    },
    {
        "s; however, samarium compounds can withstand significantly higher temperatures, above , without losing their magnetic properties, due to the alloys higher ": null
    },
    {
        "Curie point": "Curie Temperature"
    },
    {
        ". The radioactive ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        " samarium-153": "Samarium-153"
    },
    {
        " is the active component of the drug ": null
    },
    {
        "samarium lexidronam": "Samarium  Lexidronam"
    },
    {
        " , which kills cancer cells in the treatment of ": null
    },
    {
        "lung cancer": "Lung Cancer"
    },
    {
        ", ": null
    },
    {
        "prostate cancer": "Prostate Cancer"
    },
    {
        ", ": null
    },
    {
        "breast cancer": "Breast Cancer"
    },
    {
        " and ": null
    },
    {
        "osteosarcoma": "Osteosarcoma"
    },
    {
        ". Another isotope, ": null
    },
    {
        "samarium-149": "Samarium-149"
    },
    {
        ", is a strong ": null
    },
    {
        "neutron": "Neutron"
    },
    {
        " absorber and is therefore added to the ": null
    },
    {
        "control rods": "Control Rod"
    },
    {
        "of ": null
    },
    {
        "nuclear reactor": "Nuclear Reactor"
    },
    {
        "s. It is also formed as a decay product during the reactor operation and is one of the important factors considered in the reactor design and operation. Other applications of samarium include ": null
    },
    {
        "catalysis": "Catalysis"
    },
    {
        " of ": null
    },
    {
        "chemical reaction": "Chemical Reaction"
    },
    {
        "s, ": null
    },
    {
        "radioactive dating": "Samarium–Neodymium Dating"
    },
    {
        " and ": null
    },
    {
        "X-ray laser": "X-Ray Laser"
    },
    {
        "s.       Samarium is a ": null
    },
    {
        "rare earth metal": "Rare Earth Element"
    },
    {
        " having a hardness and density similar to those of ": null
    },
    {
        "zinc": "Zinc"
    },
    {
        ". With the boiling point of 1794  °C, samarium is the third most volatile lanthanide after ": null
    },
    {
        "ytterbium": "Ytterbium"
    },
    {
        " and ": null
    },
    {
        "europium": "Europium"
    },
    {
        "; this property facilitates separation of samarium from the mineral ore. At ambient conditions, samarium normally assumes a ": null
    },
    {
        "rhombohedral": "Rhombohedral"
    },
    {
        " structure . Upon heating to 731  °C, its crystal symmetry changes into ": null
    },
    {
        "hexagonally close-packed": "Hexagonal Crystal System"
    },
    {
        " , however the transition temperature depends on the metal purity. Further heating to 922  °C transforms the metal into a ": null
    },
    {
        "body-centered cubic": "Cubic Crystal System"
    },
    {
        "  phase. Heating to 300  °C combined with compression to 40  ": null
    },
    {
        "kbar": "Bar"
    },
    {
        " results in a double-hexagonally close-packed structure . Applying higher pressure of the order of hundreds or thousands of kilobars induces a series of phase transformations, in particular with a ": null
    },
    {
        "tetragonal": "Tetragonal Crystal System"
    },
    {
        " phase appearing at about 900  kbar. In one study, the dhcp phase could be produced without compression, using a nonequilibrium annealing regime with a rapid temperature change between about 400 and 700  °C, confirming the transient character of this samarium phase. Also, thin films of samarium obtained by vapor deposition may contain the hcp or dhcp phases at ambient conditions.     Samarium  are ": null
    },
    {
        "paramagnetic": "Paramagnetism"
    },
    {
        " at room temperature. Their corresponding effective magnetic moments, below 2": null
    },
    {
        "μ B ": "Bohr Magneton"
    },
    {
        ", are the 3rd lowest among the lanthanides after lanthanum and lutetium. The metal transforms to an ": null
    },
    {
        "antiferromagnetic": "Antiferromagnetism"
    },
    {
        " state upon cooling to 14.8  K.   Individual samarium atoms can be isolated by encapsulating them into ": null
    },
    {
        "fullerene": "Fullerene"
    },
    {
        " molecules.  They can also be doped between the C 60 molecules in the ": null
    },
    {
        "fullerene": "Fullerene"
    },
    {
        " solid, rendering it ": null
    },
    {
        "superconductive": "Superconductivity"
    },
    {
        " at temperatures below 8  K.  Samarium doping of ": null
    },
    {
        "iron-based superconductors": "Iron-Based Superconductor"
    },
    {
        "– the most recent class of ": null
    },
    {
        "high-temperature superconductors": "High-Temperature Superconductor"
    },
    {
        "– allows enhancing their transition temperature to 56  K, which is the highest value achieved so far in this series.        Freshly prepared samarium has a silvery luster. In air, it slowly oxidizes at room temperature and spontaneously ignites at 150  °C. Even when stored under ": null
    },
    {
        "mineral oil": "Mineral Oil"
    },
    {
        ", samarium gradually oxidizes and develops a grayish-yellow powder of the ": null
    },
    {
        "oxide": "Oxide"
    },
    {
        "-": null
    },
    {
        "hydroxide": "Hydroxide"
    },
    {
        " mixture at the surface. The metallic appearance of a sample can be preserved by sealing it under an inert gas such as ": null
    },
    {
        "argon": "Argon"
    },
    {
        ".     Samarium is quite electropositive and reacts slowly with cold water and quite quickly with hot water to form samarium hydroxide:   :2 Sm + 6 H 2 O → 2 Sm 3 + 3 H 2     Samarium dissolves readily in dilute ": null
    },
    {
        "sulfuric acid": "Sulfuric Acid"
    },
    {
        " to form solutions containing the yellow ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1243 to pale green Sm ions, which exist as 3+ complexes:      :2 Sm + 3 H 2 SO 4 → 2 Sm 3+ + 3 SO + 3 H 2     Samarium is one of the few lanthanides that exhibit the oxidation state +2. The Sm 2+ ions are blood-red in aqueous solution. ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1248                   The most stable oxide of samarium is the ": null
    },
    {
        "sesquioxide": "Sesquioxide"
    },
    {
        " Sm 2 O 3 . As many other samarium compounds, it exists in several crystalline phases. The trigonal form is obtained by slow cooling from the melt. The melting point of Sm 2 O 3 is rather high and therefore melting is usually achieved not by direct heating, but with ": null
    },
    {
        "induction heating": "Induction Heating"
    },
    {
        ", through a radio-frequency coil. The Sm 2 O 3 crystals of monoclinic symmetry can be grown by the flame fusion method  from the Sm 2 O 3 powder, that yields cylindrical boules up to several centimeters long and about one centimeter in diameter. The boules are transparent when pure and defect-free and are orange otherwise. Heating the metastable trigonal Sm 2 O 3 to 1900  °C converts it to the more stable monoclinic phase. Cubic Sm 2 O 3 has also been described.     Samarium is one of the few lanthanides that form a monoxide, SmO. This lustrous golden-yellow compound was obtained by reducing Sm 2 O 3 with samarium metal at elevated temperature and pressure above 50  kbar; lowering the pressure resulted in an incomplete reaction. SmO has the cubic rock-salt lattice structure. ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1239          Samarium forms trivalent ": null
    },
    {
        "sulfide": "Samarium Sulfide"
    },
    {
        ", ": null
    },
    {
        "selenide": "Selenide"
    },
    {
        " and ": null
    },
    {
        "telluride": "Telluride"
    },
    {
        ". Divalent chalcogenides SmS, SmSe and SmTe with cubic rock-salt crystal structure are also known. They are remarkable by converting from semiconducting to metallic state at room temperature upon application of pressure. Whereas the transition is continuous and occurs at about 20–30  kbar in SmSe and SmTe, it is abrupt in SmS and requires only 6.5  kbar. This effect results in spectacular color change in SmS from black to golden yellow when its crystals of films are scratched or polished. The transition does not change lattice symmetry, but there is a sharp decrease in the crystal volume. Beaurepaire, Eric , Springer, 2006  p. 393 It shows hysteresis, that is when the pressure is released, SmS returns to the semiconducting state at much lower pressure of about 0.4 kbar.        Samarium metal reacts with all the ": null
    },
    {
        "halogen": "Halogen"
    },
    {
        "s, forming trihalides: ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", pp. 1236, 1241   :2 Sm + 3 X 2 → 2 SmX 3     Their further reduction with samarium, lithium or sodium metals at elevated temperatures yields dihalides. The diiodide can also be prepared by heating SmI 3 , or by reacting the metal with ": null
    },
    {
        "1,2-diiodoethane": "1,2-Diiodoethane"
    },
    {
        " in anhydrous ": null
    },
    {
        "tetrahydrofuran": "Tetrahydrofuran"
    },
    {
        " at room temperature: ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1240   :Sm + ICH 2 -CH 2 I → SmI 2 + CH 2 CH 2 .     In addition to dihalides, the reduction also produces numerous ": null
    },
    {
        "non-stoichiometric": "Non-Stoichiometric Compound"
    },
    {
        " samarium halides with a well-defined crystal structure, such as Sm 3 F 7 , Sm 14 F 33 , Sm 27 F 64 , Sm 11 Br 24 , Sm 5 Br 11 and Sm 6 Br 13 .      As reflected in the table above, samarium halides change their crystal structures when one type of halide atoms is substituted for another, which is an uncommon behavior for most elements . Many halides have two major crystal phases for one composition, one being significantly more stable and another being metastable. The latter is formed upon compression or heating, followed by quenching to ambient conditions. For example, compressing the usual monoclinic samarium diiodide and releasing the pressure results in a PbCl 2 -type orthorhombic structure ,  and similar treatment results in a new phase of samarium triiodide .        ": null
    },
    {
        "Sintering": "Sintering"
    },
    {
        " powders of samarium oxide and boron, in vacuum, yields a powder containing several samarium boride phases, and their volume ratio can be controlled through the mixing proportion. The powder can be converted into larger crystals of a certain samarium boride using ": null
    },
    {
        "arc melting": "Electric Arc Furnace"
    },
    {
        " or ": null
    },
    {
        "zone melting": "Zone Melting"
    },
    {
        " techniques, relying on the different melting/crystallization temperature of SmB 6 , SmB 4 and SmB 66 . All these materials are hard, brittle, dark-gray solids with the hardness increasing with the boron content. Samarium diboride is too volatile to be produced with these methods and requires high pressure and low temperatures between 1140 and 1240  °C to stabilize its growth. Increasing the temperature results in the preferential formations of SmB 6 .       Samarium hexaboride is a typical intermediate-valence compound where samarium is present both as Sm 2+ and Sm 3+ ions at the ratio 3:7.  It belongs to a class of ": null
    },
    {
        "Kondo insulator": "Kondo Insulator"
    },
    {
        "s, that is at high temperatures , its properties are typical of a Kondo metal, with metallic electrical conductivity characterized by strong electron scattering, whereas at low temperatures, it behaves as a non-magnetic insulator with a narrow ": null
    },
    {
        "band gap": "Band Gap"
    },
    {
        " of about 4–14  meV.  The cooling-induced metal-insulator transition in SmB 6 is accompanied by a sharp increase in the ": null
    },
    {
        "thermal conductivity": "Thermal Conductivity"
    },
    {
        ", peaking at about 15  K. The reason for this increase is that electrons themselves do not contribute to the thermal conductivity at low temperatures, which is dominated by ": null
    },
    {
        "phonon": "Phonon"
    },
    {
        "s, but the decrease in electron concentration reduced the rate of electron-phonon scattering.      New research seems to show that it may be a ": null
    },
    {
        "topological insulator": "Topological Insulator"
    },
    {
        ".             Samarium ": null
    },
    {
        "carbides": "Carbide"
    },
    {
        "are prepared by melting a graphite-metal mixture in an inert atmosphere. After the synthesis, they are unstable in air and are studied also under inert atmosphere. Samarium monophosphide SmP is a ": null
    },
    {
        "semiconductor": "Semiconductor"
    },
    {
        " with the bandgap of 1.10  eV, the same as in ": null
    },
    {
        "silicon": "Silicon"
    },
    {
        ", and high electrical conductivity of ": null
    },
    {
        "n-type": "N-Type Semiconductor"
    },
    {
        ". It can be prepared by annealing at 1100  °C an evacuated quartz ampoule containing mixed powders of phosphorus and samarium. Phosphorus is highly volatile at high temperatures and may explode, thus the heating rate has to be kept well below 1  °C/min. Similar procedure is adopted for the monarsenide SmAs, but the synthesis temperature is higher at 1800  °C.     Numerous crystalline binary compounds are known for samarium and one of the group-14, 15 or 16 element X, where X is Si, Ge, Sn, Pb, Sb or Te, and metallic alloys of samarium form another large group. They are all prepared by annealing mixed powders of the corresponding elements. Many of the resulting compounds are non-stoichiometric and have nominal compositions Sm a X b , where the b/a ratio varies between 0.5 and 3.          Samarium forms a ": null
    },
    {
        "cyclopentadienide": "Cyclopentadiene"
    },
    {
        " Sm 3 and its chloroderivatives Sm 2 Cl and SmCl 2 . They are prepared by reacting samarium trichloride with NaC 5 H 5 in ": null
    },
    {
        "tetrahydrofuran": "Tetrahydrofuran"
    },
    {
        ". Contrary to cyclopentadienides of most other lanthanides, in Sm 3 some C 5 H 5 rings bridge each other by forming ring vertexes η 1 or edges η 2 toward another neighboring samarium atom, thereby creating polymeric chains. The chloroderivative Sm 2 Cl has a dimer structure, which is more accurately expressed as 2 Sm 2 2 . There, the chlorine bridges can be replaced, for instance, by iodine, hydrogen or nitrogen atoms or by CN groups. ": null
    },
    {
        "Greenwood": "Greenwood"
    },
    {
        ", p. 1249     The − ion in samarium cyclopentadienides can be replaced by the indenide − or ": null
    },
    {
        "cyclooctatetraenide": "Cyclooctatetraene"
    },
    {
        " 2− ring, resulting in Sm 3 or KSm 2 . The latter compound has a similar structure to that of ": null
    },
    {
        "uranocene": "Uranocene"
    },
    {
        ". There is also a cyclopentadienide of divalent samarium, Sm 2 – a solid that sublimates at about 85  °C. Contrary to ": null
    },
    {
        "ferrocene": "Ferrocene"
    },
    {
        ", the C 5 H 5 rings in Sm 2 are not parallel but are tilted by 40°.      ": null
    },
    {
        "Alkyls": "Alkyl"
    },
    {
        "and ": null
    },
    {
        "aryls": "Aryl"
    },
    {
        "of samarium are obtained through a ": null
    },
    {
        "metathesis reaction": "Metathesis Reaction"
    },
    {
        " in tetrahydrofuran or ": null
    },
    {
        "ether": "Diethyl Ether"
    },
    {
        "methyl": "Methyl"
    },
    {
        ".          Naturally occurring samarium has a ": null
    },
    {
        "radioactivity": "Radioactive Decay"
    },
    {
        " of 128  ": null
    },
    {
        "Bq": "Becquerel"
    },
    {
        "/g. It is composed of four stable ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        "s: 144 Sm, 150 Sm, 152 Sm and 154 Sm, and three extremely long-lived ": null
    },
    {
        "radioisotope": "Radioisotope"
    },
    {
        "s, 147 Sm , 148 Sm  and 149 Sm  sup /sup  ref name nubase / sup /sup ref name nubase / ref  /ref ref  /ref sup /sup sup /sup sup /sup  ref name nubase /  sup /sup sup /sup ": null
    },
    {
        "up /su": "Up  /Su"
    },
    {
        " sup /sup  sup /sup  sup /sup  sup /sup  ref name nubase  /ref  ref  /ref ref namebrit  /ref  ref nameCRC  /ref  ref  /ref ref  /ref ref nameiupac  /ref ref  /ref  ref namevan/  ref namebse  /ref ref  /ref ref  /ref ref namevan/ ref nameRSC/  ref namevan  /ref ref  /ref  ref nameRSC  /ref  ref nameprice/  ref nameemsley/ ref nameLA2/  ref nameCRC/  ref nameemsley/ ref nameLA2/ ref  /ref ref nameprice  /ref  ref namebrit/  ref /ref ref sub /sub sub /sub sub /sub /ref ref  /ref ref  /ref  ref nameLA2/ ": null
    },
    {
        "ub /su": "Ub  /Su"
    },
    {
        " sub /sub sub /sub sub /sub  ref nameemsley/  ref nameCRC/  ref  /ref  ref  /ref  ref nameemsley/ ref nameCRC/  ref nameemsley/  ref  /ref ref  /ref ref  /ref  sup /sup sup /sup sup /sup ref nameCRC/ ref nameLA2/ ref  /ref  ref  /ref sub /sub  ref namephysorgsamarium  /ref  ref  /ref ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref sup /sup sup /sup sup /sup  ref  /ref  ref  /ref  ref  /ref ref  /ref  ref  /ref ref  /ref  ref  /ref ref  /ref  ref nameemsley  /ref ref nameLA2 ": null
    }
]