[
    {
        "           Santorini , officially Thira  and classic Greek Thera , is an island in the southern ": null
    },
    {
        "Aegean Sea": "Aegean Sea"
    },
    {
        ", about 200  km southeast of ": null
    },
    {
        "Greeces": "Greece"
    },
    {
        " mainland. It is the largest island of a small, circular ": null
    },
    {
        "archipelago": "Archipelago"
    },
    {
        ", which bears the same name and is the remnant of a ": null
    },
    {
        "volcanic": "Volcano"
    },
    {
        " caldera": "Caldera"
    },
    {
        ". It forms the southernmost member of the ": null
    },
    {
        "Cyclades": "Cyclades"
    },
    {
        " group of islands, with an area of approximately 73  km 2 and a 2011 census population of 15,550. The municipality of Santorini includes the inhabited islands of Santorini and ": null
    },
    {
        "Therasia": "Therasia"
    },
    {
        ", as well as the uninhabited islands of ": null
    },
    {
        "Nea Kameni": "Nea Kameni"
    },
    {
        ", ": null
    },
    {
        "Palaia Kameni": "Palaia Kameni"
    },
    {
        ", ": null
    },
    {
        "Aspronisi": "Aspronisi"
    },
    {
        " and ": null
    },
    {
        "Christiana": "Christiana Island"
    },
    {
        ". The total land area is 90.623  km 2 .  Santorini is part of the ": null
    },
    {
        "Thira regional unit": "Thira"
    },
    {
        ".  Greece Ministry of Interior      The island was the site of one of the largest ": null
    },
    {
        "volcanic eruptions": "Volcanic Eruption"
    },
    {
        " in ": null
    },
    {
        "recorded history": "Recorded History"
    },
    {
        "Minoan eruption": "Minoan Eruption"
    },
    {
        " , which occurred about 3,600 years ago at the height of the ": null
    },
    {
        "Minoan civilization": "Minoan Civilization"
    },
    {
        ". The eruption left a large caldera surrounded by ": null
    },
    {
        "volcanic ash": "Volcanic Ash"
    },
    {
        " deposits hundreds of metres deep. It may have led indirectly to the collapse of the Minoan civilization on the island of ": null
    },
    {
        "Crete": "Crete"
    },
    {
        ",  to the south, through a gigantic ": null
    },
    {
        "tsunami": "Tsunami"
    },
    {
        ". Another popular theory holds that the Thera eruption is the source of the legend of ": null
    },
    {
        "Atlantis": "Atlantis"
    },
    {
        ". Charles Pellegrino, Unearthing Atlantis – An Archaeological Odyssey Vintage Books, 1991     It is the most active volcanic centre in the ": null
    },
    {
        "South Aegean Volcanic Arc": "South Aegean Volcanic Arc"
    },
    {
        ", though what remains today is chiefly a water-filled caldera. The volcanic arc is approximately  long and  wide. The region first became volcanically active around 3–4 million years ago, though volcanism on Thera began around 2 million years ago with the extrusion of ": null
    },
    {
        "dacitic": "Dacite"
    },
    {
        " lavas from vents around ": null
    },
    {
        "Akrotiri": "Akrotiri"
    },
    {
        ".            Santorini was named by the ": null
    },
    {
        "Latin Empire": "Latin Empire"
    },
    {
        " in the thirteenth century, and is a reference to ": null
    },
    {
        "Saint Irene": "Agape, Chionia, And Irene"
    },
    {
        ", from the name of the old ": null
    },
    {
        "cathedral": "Cathedral"
    },
    {
        " in the village of ": null
    },
    {
        "Perissa": "Perissa, Santorini"
    },
    {
        " – the name Santorini is a contraction of the name Santa Irini.  Before then, it was known as Kallístē , Strongýlē , C. Doumas . Thera and the Aegean world: papers presented at the second international scientific congress, Santorini, Greece, August 1978. London, 1978.   or Thēra. The name Thera was revived in the nineteenth century as the official name of the island and its main city, but the colloquial name Santorini is still in popular use.       The present municipality of Thera ,   which covers all settlements on the islands of Santorini and ": null
    },
    {
        "Therasia": "Therasia"
    },
    {
        ", was formed at the 2011 local government reform, by the merger of the former ": null
    },
    {
        "Oia": "Oia, Greece"
    },
    {
        " and Thera municipalities.     Oia is now called a  , within the municipality of Thera, and it consists of the local subdivisions  of Therasia and ": null
    },
    {
        "Oia": "Oia, Greece"
    },
    {
        ".     The municipality of Thera includes an additional 12 local subdivisions on Santorini island: Akrotiri, Emporio, Episkopis Gonia, Exo Gonia, ": null
    },
    {
        "Imerovigli": "Imerovigli"
    },
    {
        ", Karterados, Megalohori, Mesaria, Pyrgos Kallistis, Thera , Vothon, and Vourvoulos.             Santorinis primary industry is tourism. Agriculture also forms part of its economy, and the island sustains a wine industry, based on the indigenous ": null
    },
    {
        "Assyrtiko": "Assyrtiko"
    },
    {
        " grape variety. White varieties also include Athiri and Aidani, whereas red varieties include mavrotragano and mandilaria.                The Cyclades are part of a ": null
    },
    {
        "metamorphic": "Metamorphism"
    },
    {
        " complex that is known as the ": null
    },
    {
        "Cycladic Massif": "Cycladic Massif"
    },
    {
        ". The complex formed during the ": null
    },
    {
        "Miocene": "Miocene"
    },
    {
        " and was folded and metamorphosed during the ": null
    },
    {
        "Alpine orogeny": "Alpine Orogeny"
    },
    {
        " around 60 million years ago. Thera is built upon a small, non-volcanic ": null
    },
    {
        "basement": "Basement Rock"
    },
    {
        " that represents the former non-volcanic island, which was approximately . The basement rock is primarily composed of metamorphosed ": null
    },
    {
        "limestone": "Limestone"
    },
    {
        " and ": null
    },
    {
        "schist": "Schist"
    },
    {
        ", which date from the Alpine Orogeny. These non-volcanic rocks are exposed at ": null
    },
    {
        "Mikro Profititis Ilias": "Mikro Profititis Ilias"
    },
    {
        ", Mesa Vouno, the Gavrillos ridge, ": null
    },
    {
        "Pyrgos": "Pyrgos Kallistis"
    },
    {
        ", ": null
    },
    {
        "Monolithos": "Monolithos, Greece"
    },
    {
        ", and the inner side of the caldera wall between Cape Plaka and Athinios.     The metamorphic grade is a ": null
    },
    {
        "blueschist": "Blueschist"
    },
    {
        " facies": "Metamorphic Facies"
    },
    {
        ", which results from tectonic deformation by the ": null
    },
    {
        "subduction": "Subduction"
    },
    {
        " of the ": null
    },
    {
        "African Plate": "African Plate"
    },
    {
        " beneath the ": null
    },
    {
        "Eurasian Plate": "Eurasian Plate"
    },
    {
        ". Subduction occurred between the ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        " and the ": null
    },
    {
        "Miocene": "Miocene"
    },
    {
        ", and the metamorphic grade represents the southernmost extent of the Cycladic blueschist belt.         Volcanism on Santorini is due to the ": null
    },
    {
        "Hellenic Trench": "Hellenic Trench"
    },
    {
        " subduction zone": "Subduction Zone"
    },
    {
        " southwest of Crete. The ": null
    },
    {
        "oceanic crust": "Oceanic Crust"
    },
    {
        " of the northern margin of the ": null
    },
    {
        "African Plate": "African Plate"
    },
    {
        " is being subducted under Greece and the Aegean Sea, which is thinned ": null
    },
    {
        "continental crust": "Continental Crust"
    },
    {
        ". The subduction compels the formation of the ": null
    },
    {
        "Hellenic arc": "Hellenic Arc"
    },
    {
        ", which includes Santorini and other volcanic centres, such as ": null
    },
    {
        "Methana": "Methana Volcano"
    },
    {
        ", ": null
    },
    {
        "Milos": "Milos"
    },
    {
        ", and ": null
    },
    {
        "Kos": "Kos"
    },
    {
        ".              The island is the result of repeated sequences of ": null
    },
    {
        "shield volcano": "Shield Volcano"
    },
    {
        " construction followed by ": null
    },
    {
        "caldera collapse": "Caldera"
    },
    {
        ".  The inner coast around the caldera is a sheer precipice of more than  drop at its highest, and exhibits the various layers of solidified lava on top of each other, and the main towns perched on the crest. The ground then slopes outwards and downwards towards the outer perimeter, and the outer beaches are smooth and shallow. Beach sand colour depends on which geological layer is exposed; there are beaches with sand or pebbles made of solidified lava of various colours: such as the Red Beach, the Black Beach and the White Beach. The water at the darker coloured beaches is significantly warmer because the lava acts as a heat absorber.     The area of Santorini incorporates a group of islands created by volcanoes, spanning across Thera, Thirasia, Aspronisi, Palea, and Nea Kameni.          Santorini has erupted many times, with varying degrees of explosivity. There have been at least twelve large explosive eruptions, of which at least four were ": null
    },
    {
        "caldera": "Caldera"
    },
    {
        "-forming. The most famous eruption is the ": null
    },
    {
        "Minoan eruption": "Minoan Eruption"
    },
    {
        ", detailed below. Eruptive products range from ": null
    },
    {
        "basalt": "Basalt"
    },
    {
        " all the way to ": null
    },
    {
        "rhyolite": "Rhyolite"
    },
    {
        ", and the rhyolitic products are associated with the most explosive eruptions.     The earliest eruptions, many of which were ": null
    },
    {
        "submarine": "Submarine Eruption"
    },
    {
        ", were on the Akrotiri Peninsula, and active between 650,000 and 550,000 years ago. These are ": null
    },
    {
        "geochemically": "Geochemistry"
    },
    {
        " distinct from the later volcanism, as they contain ": null
    },
    {
        "amphiboles": "Amphibole"
    },
    {
        ".     Over the past 360,000 years there have been two major cycles, each culminating with two caldera-forming eruptions. The cycles end when the magma evolves to a rhyolitic composition, causing the most explosive eruptions. In between the caldera-forming eruptions are a series of sub-cycles. Lava flows and small explosive eruptions build up ": null
    },
    {
        "cones": "Volcanic Cone"
    },
    {
        ", which are thought to impede the flow of magma to the surface. This allows the formation of large magma chambers, in which the magma can evolve to more ": null
    },
    {
        "silicic": "Silicic"
    },
    {
        " compositions. Once this happens, a large explosive eruption destroys the cone. The Kameni islands in the centre of the lagoon are the most recent example of a cone built by this volcano, with much of them hidden beneath the water.                 The devastating volcanic eruption of Thera has become the most famous single event in the Aegean before the fall of ": null
    },
    {
        "Troy": "Troy"
    },
    {
        ". It may have been one of the largest volcanic eruptions on Earth in the last few thousand years, with an estimated VEI  of 6 according to the last studies published in 2006, confirming the prior values.   The violent eruption was centred on a small island just north of the existing island of Nea Kameni in the centre of the caldera; the caldera itself was formed several hundred thousand years ago by the collapse of the centre of a circular island, caused by the emptying of the magma chamber during an eruption. It has been filled several times by ": null
    },
    {
        "ignimbrite": "Ignimbrite"
    },
    {
        " since then, and the process repeated itself, most recently 21,000 years ago. The northern part of the caldera was refilled by the volcano, then collapsed once more during the Minoan eruption. Before the Minoan eruption, the caldera formed a nearly continuous ring with the only entrance between the tiny island of Aspronisi and Thera; the eruption destroyed the sections of the ring between Aspronisi and Therasia, and between Therasia and Thera, creating two new channels.     On Santorini, a deposit of white ": null
    },
    {
        "tephra": "Tephra"
    },
    {
        " thrown from the eruption is found lying up to  thick, overlying the soil marking the ground level before the eruption, and forming a layer divided into three fairly distinct bands indicating different phases of the eruption. Archaeological discoveries in 2006 by a team of international scientists revealed that the Santorini event was much more massive than previously thought; it expelled  of magma and rock into the Earths atmosphere, compared to previous estimates of only  in 1991, , URI Department of Communications and Marketing , Atlantis Eruption Twice as Big as Previously Believed, Study Suggests. producing an estimated  of tephra. Only the ": null
    },
    {
        "Mount Tambora": "Mount Tambora"
    },
    {
        " volcanic eruption of 1815, the ": null
    },
    {
        "181 AD eruption": "Hatepe Eruption"
    },
    {
        " of ": null
    },
    {
        "Lake Taupo": "Lake Taupo"
    },
    {
        ", and possibly ": null
    },
    {
        "Baekdu Mountains": "Baekdu Mountain"
    },
    {
        " 946 AD eruption have released more material into the atmosphere during the past 5,000 years.             ": null
    },
    {
        "Archaeological": "Archeology"
    },
    {
        ", ": null
    },
    {
        "seismological": "Seismology"
    },
    {
        ", and ": null
    },
    {
        "vulcanological": "Vulcanology"
    },
    {
        " evidence    has been presented linking the ": null
    },
    {
        "Atlantis": "Atlantis"
    },
    {
        " myth to Santorini. Speculation suggesting that Thera/Santorini was the inspiration for ": null
    },
    {
        "Platos": "Plato"
    },
    {
        " Atlantis began with the excavation of Akrotiri in the 1960s, and gained increased currency as reconstructions of the islands pre-eruption shape and landscape frescos located under the ash both strongly resembled Platos description. The possibility has been more recently popularized by television documentaries such as ": null
    },
    {
        "The History Channel": "History"
    },
    {
        " programme Lost Worlds , the ": null
    },
    {
        "Discovery Channels": "Discovery Channel"
    },
    {
        "  Solving History with Olly Steeds , and the BBCs Atlantis, The Evidence, which suggests that Thera is Platos Atlantis.  BBC.co.uk, Timewatch             Post-Minoan eruptive activity is concentrated on the Kameni islands, in the centre of the lagoon. They have been formed since the Minoan eruption, and the first of them broke the surface of the sea in 197 BC Nine subaerial eruptions are recorded in the historical record since that time, with the most recent ending in 1950.     In 1707 an undersea volcano breached the sea surface, forming the current centre of activity at Nea Kameni in the centre of the lagoon, and eruptions centred on it continue—the twentieth century saw three such, the last in 1950. Santorini was also struck by a devastating earthquake in 1956. Although the volcano is dormant at the present time, at the current active crater , steam and ": null
    },
    {
        "carbon dioxide": "Carbon Dioxide"
    },
    {
        " are given off.     Small tremors and reports of strange gaseous odours over the course of 2011 and 2012 prompted satellite radar technological analyses and these revealed the source of the symptoms; the magma chamber under the volcano was swelled by a rush of molten rock by 10 to 20 million cubic metres between January 2011 and April 2012, which also caused parts of the islands surface to rise out of the water by a reported 8 to 14 centimetres.  Scientists say that the injection of molten rock was equivalent to 20 years’ worth of regular activity.        Santorini has a ": null
    },
    {
        "semi-arid climate": "Semi-Arid Climate"
    },
    {
        "  with ": null
    },
    {
        "Mediterranean": "Hot-Summer Mediterranean Climate"
    },
    {
        " characteristics.  Total rainfall averages  per year. In the summer season, strong winds can also be observed.                         Excavations starting in 1967 at the ": null
    },
    {
        "Akrotiri": "Akrotiri"
    },
    {
        " site under the late Professor ": null
    },
    {
        "Spyridon Marinatos": "Spyridon Marinatos"
    },
    {
        " have made Thera the best-known ": null
    },
    {
        "Minoan": "Minoan Civilization"
    },
    {
        " site outside of ": null
    },
    {
        "Crete": "Crete"
    },
    {
        ", homeland of the culture. The island was not known as Thera at this time. Only the southern tip of a large town has been uncovered, yet it has revealed complexes of multi-level buildings, streets, and squares with remains of walls standing as high as eight metres, all entombed in the solidified ash of the famous eruption of Thera. The site was not a palace-complex as found in ": null
    },
    {
        "Crete": "Crete"
    },
    {
        ", but neither was it a conglomeration of merchants warehousing, as its excellent masonry and fine wall-paintings show. A loom-workshop suggests organized ": null
    },
    {
        "textile": "Textile"
    },
    {
        " weaving": "Weaving"
    },
    {
        " for export. This ": null
    },
    {
        "Bronze Age": "Bronze Age"
    },
    {
        " civilization thrived between 3000 and 2000 BC, reaching its peak in the period between 2000 and 1630 BC. , C. Michael Hogan, Akrotiri, The Modern Antiquarian .     Many of the houses in Akrotiri are major structures, some of them three stories high. Its streets, squares, and walls were preserved in the layers of ejecta, sometimes as tall as eight metres, indicating this was a major town. In many houses stone staircases are still intact, and they contain huge ceramic storage jars , mills, and pottery. Noted archaeological remains found in Akrotiri are wall paintings or ": null
    },
    {
        "fresco": "Fresco"
    },
    {
        "es, which have kept their original colour well, as they were preserved under many metres of volcanic ash. The town also had a highly developed drainage system and, judging from the fine artwork, its citizens were clearly sophisticated and relatively wealthy people.     Pipes with running water and ": null
    },
    {
        "water closets": "Water Closet"
    },
    {
        " found at Akrotiri are the oldest such utilities discovered. The pipes run in twin systems, indicating that Therans used both hot and cold water supplies; the origin of the hot water probably was ": null
    },
    {
        "geothermic": "Geothermal Power"
    },
    {
        ", given the ": null
    },
    {
        "volcanos": "Volcano"
    },
    {
        " proximity. The dual pipe system, the advanced architecture, and the apparent layout of the Akrotiri find resemble ": null
    },
    {
        "Platos": "Plato"
    },
    {
        " description of the legendary lost city of ": null
    },
    {
        "Atlantis": "Atlantis"
    },
    {
        ", further indicating the Minoans as the culture which primarily inspired the Atlantis legend.     Fragmentary wall-paintings at Akrotiri lack the insistent religious or mythological content familiar in Classical Greek décor. Instead, the Minoan frescoes depict ": null
    },
    {
        "Saffron": "Saffron"
    },
    {
        "-Gatherers , who offer their ": null
    },
    {
        "crocus": "Crocus"
    },
    {
        "-stamens to a seated lady, perhaps a ": null
    },
    {
        "goddess": "Goddess"
    },
    {
        ". Crocus has been discovered to have many medicinal values including the relief of menstrual pain. This has led many  archaeologists to believe that the fresco of the saffron/crocus gatherers is a coming of age fresco dealing with female pubescence. In another house are two ": null
    },
    {
        "antelopes": "Antelopes"
    },
    {
        ", painted with a kind of confident, flowing, decorative, calligraphic line, the famous fresco of a fisherman with his double strings of fish strung by their gills, and the flotilla of pleasure boats, accompanied by leaping ": null
    },
    {
        "dolphins": "Dolphins"
    },
    {
        ", where ladies take their ease in the shade of light canopies, among other frescoes.     The well preserved ruins of the ancient town are often compared to the spectacular ruins at ": null
    },
    {
        "Pompeii": "Pompeii"
    },
    {
        " in Italy. The canopy covering the ruins collapsed in an accident in September 2005, killing one tourist and injuring seven more. The site was closed for almost seven years while a new canopy was built. The site was re-opened in April 2012.     The oldest signs of human settlement are Late ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " , but c. 2000–1650 BC Akrotiri developed into one of the Aegeans major ": null
    },
    {
        "Bronze Age": "Bronze Age"
    },
    {
        " ports, with recovered objects that came not just from ": null
    },
    {
        "Crete": "Crete"
    },
    {
        ", but also from ": null
    },
    {
        "Anatolia": "Anatolia"
    },
    {
        ", ": null
    },
    {
        "Cyprus": "Cyprus"
    },
    {
        ", ": null
    },
    {
        "Syria": "Syria"
    },
    {
        ", and ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        ", as well as from the ": null
    },
    {
        "Dodecanese": "Dodecanese"
    },
    {
        " and the Greek mainland.               The ": null
    },
    {
        "Minoan eruption": "Minoan Eruption"
    },
    {
        " provides a fixed point for the chronology of the second millennium BC in the Aegean, because evidence of the eruption occurs throughout the region and the site itself contains material culture from outside. The eruption occurred during the Late Minoan  IA period at Crete and the Late Cycladic  I period in the surrounding islands.     Archaeological evidence, based on the established chronology of Bronze Age Mediterranean cultures, dates the eruption to around 1500 BC.  These dates, however, conflict with ": null
    },
    {
        "radiocarbon dating": "Radiocarbon Dating"
    },
    {
        " which indicates that the eruption occurred at about 1645–1600 BC.  For those, and other, reasons, the date of the eruption is disputed. For discussion, see ": null
    },
    {
        "Minoan eruptionEruption dating": "Minoan Eruptioneruption Dating"
    },
    {
        ".                           Santorini remained unoccupied throughout the rest of the Bronze Age, during which time the Greeks took over ": null
    },
    {
        "Crete": "Crete"
    },
    {
        ". At ": null
    },
    {
        "Knossos": "Knossos"
    },
    {
        ", in a LMIIIA context , seven ": null
    },
    {
        "Linear B": "Linear B"
    },
    {
        " texts while calling upon all the gods make sure to grant primacy to an elsewhere-unattested entity called qe-ra-si-ja and, once, qe-ra-si-jo. If the endings -ias and -ios represent an ethnic suffix, then this means The One From Qeras . If the initial consonant were aspirated, then Qhera- would have become Thera- in later Greek. Therasia and its ethnikon Therasios are both attested in later Greek; and, since -sos was itself a genitive suffix in the Aegean ": null
    },
    {
        "Sprachbund": "Sprachbund"
    },
    {
        ", Qeras could also shrink to Qera. An alternate view takes qe-ra-si-ja and qe-ra-si-jo as proof of androgyny, and applies this name by similar arguments to the legendary seer, ": null
    },
    {
        "Tiresias": "Teiresias"
    },
    {
        ", but these views are not mutually exclusive. If qe-ra-si-ja was an ethnikon first, then in following him/her/it the Cretans also feared whence it came. , Minoan Qe-Ra-Si-Ja. The Religious Impact of the Thera Volcano on Minoan Crete.      Probably after what is called the ": null
    },
    {
        "Bronze Age collapse": "Bronze Age Collapse"
    },
    {
        ", ": null
    },
    {
        "Phoenicians": "Phoenicians"
    },
    {
        " founded a site on Thera. ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        " reports that they called the island Callista and lived on it for eight generations. ": null
    },
    {
        "Hist.": "Histories"
    },
    {
        " IV.147 In the 9th century BC, ": null
    },
    {
        "Dorians": "Dorians"
    },
    {
        " founded the main Hellenic city on Mesa Vouno,  ": null
    },
    {
        "above sea level": "Above Mean Sea Level"
    },
    {
        ". This group later claimed that they had named the city and the island after their leader, ": null
    },
    {
        "Theras": "Theras"
    },
    {
        ". Today, that city is referred to as ": null
    },
    {
        "Ancient Thera": "Ancient Thera"
    },
    {
        ".     In his  Argonautica , written in Hellenistic Egypt in the 3rd century BC, ": null
    },
    {
        "Apollonius Rhodius": "Apollonius Rhodius"
    },
    {
        " includes an origin and sovereignty myth of Thera being given by ": null
    },
    {
        "Triton": "Triton"
    },
    {
        " in Libya to the Greek ": null
    },
    {
        "Argonaut": "Argonauts"
    },
    {
        " Euphemus": "Euphemus"
    },
    {
        ", son of ": null
    },
    {
        "Poseidon": "Poseidon"
    },
    {
        ", in the form of a clod of dirt. After carrying the dirt next to his heart for several days, Euphemus dreamt that he nursed the dirt with milk from his breast, and that the dirt turned into a beautiful woman with whom he had sex. The woman then told him that she was a daughter of Triton named Kalliste, and that when he threw the dirt into the sea it would grow into an island for his descendants to live on. The poem goes on to claim that the island was named Thera after Euphemus descendant ": null
    },
    {
        "Theras": "Theras"
    },
    {
        ", son of ": null
    },
    {
        "Autesion": "Autesion"
    },
    {
        ", the leader of a group of refugee settlers from ": null
    },
    {
        "Lemnos": "Lemnos"
    },
    {
        ".     The Dorians have left a number of inscriptions incised in stone, in the vicinity of the temple of ": null
    },
    {
        "Apollo": "Apollo"
    },
    {
        ", attesting to ": null
    },
    {
        "pederastic relations": "Pederasty In Ancient Greece"
    },
    {
        " between the authors and their lovers . These inscriptions, found by ": null
    },
    {
        "Friedrich Hiller von Gaertringen": ":De:Friedrich Hiller Von Gaertringen"
    },
    {
        ", have been thought by some archaeologists to be of a ritual, celebratory nature, because of their large size, careful construction and  – in some cases  – execution by craftsmen other than the authors. According to ": null
    },
    {
        "Herodotus": "Herodotus"
    },
    {
        ", ": null
    },
    {
        "Hist.": "Histories"
    },
    {
        " IV.149–165 following a drought of seven years, Thera sent out colonists who founded a number of cities in northern Africa, including ": null
    },
    {
        "Cyrene": "Cyrene, Libya"
    },
    {
        ". In the 5th century BC, Dorian Thera did not join the ": null
    },
    {
        "Delian League": "Delian League"
    },
    {
        " with ": null
    },
    {
        "Athens": "Athens"
    },
    {
        "; and during the ": null
    },
    {
        "Peloponnesian War": "Peloponnesian War"
    },
    {
        ", Thera sided with Dorian Sparta, against Athens. The Athenians took the island during the war, but lost it again after the ": null
    },
    {
        "Battle of Aegospotami": "Battle Of Aegospotami"
    },
    {
        ". During the Hellenistic period, the island was a major naval base for ": null
    },
    {
        "Ptolemaic Egypt": "Ptolemaic Egypt"
    },
    {
        ".       As with other Greek territories, Thera then was ruled by the ": null
    },
    {
        "Romans": "Ancient Rome"
    },
    {
        ". When the ": null
    },
    {
        "Roman Empire": "Roman Empire"
    },
    {
        " was divided, the island passed to the eastern side of the Empire which today is known as the ": null
    },
    {
        "Byzantine Empire": "Byzantine Empire"
    },
    {
        ". According to ": null
    },
    {
        "George Cedrenus": "George Cedrenus"
    },
    {
        ", the volcano erupted again in the summer of 727, the tenth year of the reign of ": null
    },
    {
        "Leo III the Isaurian": "Leo Iii The Isaurian"
    },
    {
        ". George Cedrenus, Σύνοψις ἱστορίων, Vol I, p. 795. He writes: In the same year, in the summer, a vapour like an ovens fire boiled up for days out of the middle of the islands of Thera and Therasia from the depths of the sea, and the whole place burned like fire, little by little thickening and turning to stone, and the air seemed to be a fiery torch. This terrifying explosion was interpreted as a divine omen against the worship of religious ": null
    },
    {
        "icons": "Icon"
    },
    {
        " Θεοφάνης Ομολογητής": "Θεοφάνης Ομολογητής"
    },
    {
        ", Χρονογραφία σελ. 621-622 : «ος την κατ’ αυτού θείαν οργήν υπέρ εαυτού λογισάμενος». Νικηφόρος σελ. 64 : «Ταύτά φασιν ακούσαντα τον βασιλέα υπολαμβάνειν θείας οργής είναι μηνύματα». Ιωάννης Παναγιωτόπουλος, «Το ηφαίστειο της Θήρας και η Eικονομαχία». Θεολογία 80 , 235-253 and gave the Emperor ": null
    },
    {
        "Leo III the Isaurian": "Leo Iii The Isaurian"
    },
    {
        " the justification he needed to begin implementing his ": null
    },
    {
        "Iconoclasm": "Byzantine Iconoclasm"
    },
    {
        " policy.     The name Santorini first appears  in the work of the Muslim geographer ": null
    },
    {
        "al-Idrisi": "Al-Idrisi"
    },
    {
        ", as Santurin , from the islands patron saint, ": null
    },
    {
        "Saint Irene": "Saint Irene"
    },
    {
        ".  In 1318–1331 and 1345–1360 it was raided by the ": null
    },
    {
        "Turkish": "Anatolian Beyliks"
    },
    {
        " principalities of ": null
    },
    {
        "Menteshe": "Menteshe"
    },
    {
        " and ": null
    },
    {
        "Aydın": "Aydınids"
    },
    {
        ", but did not suffer much damage. The island was held for some decades in the first half of the 13th century by the Venetian ": null
    },
    {
        "Barozzi family": "Barozzi Family"
    },
    {
        ", before its reconquest ca 1335 by the Duke of Naxos ": null
    },
    {
        "Niccolo Sanudo": "Niccolo Sanudo"
    },
    {
        ". Marina Koumanoudi, “Τhe Latins in the Aegean after 1204: Interdependence and Interwoven Interests,” in Urbs capta: Τhe Fourth Crusade and its Consequences, 2005, p.263 From the 15th century on, the suzerainty of the ": null
    },
    {
        "Republic of Venice": "Republic Of Venice"
    },
    {
        " over the island was recognized in a series of treaties by the ": null
    },
    {
        "Ottoman Empire": "Ottoman Empire"
    },
    {
        ", but this did not stop Ottoman raids, until it was captured by the Ottoman admiral ": null
    },
    {
        "Piyale Pasha": "Piyale Pasha"
    },
    {
        " in 1576, as part of a process of annexation of most remaining Latin possessions in the Aegean. It became part of the semi-autonomous domain of the Sultans Jewish favourite, ": null
    },
    {
        "Joseph Nasi": "Joseph Nasi"
    },
    {
        ". Santorini retained its privileged position in the 17th century, but suffered in turn from Venetian raids during the frequent ": null
    },
    {
        "Ottoman–Venetian wars": "Ottoman–Venetian Wars"
    },
    {
        " of the period, even though there were no Muslims on the island.     Santorini was captured briefly by the ": null
    },
    {
        "Russians": "Russian Empire"
    },
    {
        " under ": null
    },
    {
        "Alexey Orlov": "Alexei Grigoryevich Orlov"
    },
    {
        " during the ": null
    },
    {
        "Russo-Turkish War of 1768–1774": "Russo-Turkish War Of 1768–1774"
    },
    {
        ", but returned to Ottoman control after. Following the outbreak of the ": null
    },
    {
        "Greek War of Independence": "Greek War Of Independence"
    },
    {
        " on the Greek mainland in March 1821, in May Santorini followed suit, although the local Catholic population had its reservations. The island became part of the fledgling Greek state, rebelled against Governor ": null
    },
    {
        "Ioannis Kapodistrias": "Ioannis Kapodistrias"
    },
    {
        " in 1831, and became definitively part of the independent ": null
    },
    {
        "Kingdom of Greece": "Kingdom Of Greece"
    },
    {
        " in 1832, with the ": null
    },
    {
        "Treaty of Constantinople": "Treaty Of Constantinople"
    },
    {
        ".     The island is still home to a Catholic community and the seat of a ": null
    },
    {
        "Catholic bishopric": "Roman Catholic Diocese Of Santorini"
    },
    {
        ".       During the ": null
    },
    {
        "Second World War": "World War Ii"
    },
    {
        ", Santorini was occupied in 1941 by Italian forces, and in 1943 by those of the Germans. In 1944, the German and Italian garrison on Santorini was ": null
    },
    {
        "raided": "Raid On Santorini"
    },
    {
        " by a group of British ": null
    },
    {
        "Special Boat Service": "Special Boat Service"
    },
    {
        " Commandos, killing most of its men. Five locals were later shot in reprisal, including the mayor.            The ": null
    },
    {
        "1956 Amorgos earthquake": "1956 Amorgos Earthquake"
    },
    {
        " resulted in the demolition of many buildings in the north of Santorini, leading to the desertion of many of its villages. The expansion of ": null
    },
    {
        "tourism": "Tourism"
    },
    {
        " has resulted in the growth of the economy and population. The major settlements include ": null
    },
    {
        "Fira ": "Fira"
    },
    {
        ", ": null
    },
    {
        "Oia": "Oia, Greece"
    },
    {
        ", ": null
    },
    {
        "Emporio": "Emporeio"
    },
    {
        ", ": null
    },
    {
        "Kamari": "Kamari"
    },
    {
        ", ": null
    },
    {
        "Perissa": "Perissa, Santorini"
    },
    {
        ", ": null
    },
    {
        "Imerovigli": "Imerovigli"
    },
    {
        ", ": null
    },
    {
        "Pyrgos": "Pyrgos Kallistis"
    },
    {
        ", and ": null
    },
    {
        "Therasia": "Therasia"
    },
    {
        ". ": null
    },
    {
        "Akrotiri": "Akrotiri"
    },
    {
        " is a major archaeological site, with ruins from the Minoan era. Santorinis primary industry is ": null
    },
    {
        "tourism": "Tourism"
    },
    {
        ", particularly in the summer months. In 2007, the cruise ship  MS Sea Diamond  ran aground and sank inside the ": null
    },
    {
        "caldera": "Caldera"
    },
    {
        ". The islands ": null
    },
    {
        "pumice": "Pumice"
    },
    {
        " quarries have been closed since 1986, in order to preserve the caldera. Santorini was ranked the worlds top island for many magazines and travel sites, including the Travel+Leisure Magazine,  the BBC,  as well as the US News.  An estimated 2 million tourists visit annually.                     Santorini has no rivers, and water is scarce. Until the early 1990s locals filled water cisterns from the rain that fell on roofs and courts, from small springs, and with imported assistance from other areas of Greece. In recent years a ": null
    },
    {
        "desalination": "Desalination"
    },
    {
        " plant has provided running, yet non-potable, water to most houses. Since rain is rare on the island from mid-spring till mid-autumn, many plants depend on the scant moisture provided by the common, early morning fog condensing on the ground as ": null
    },
    {
        "dew": "Dew"
    },
    {
        ".            Because of its unique ecology and climate, and especially its volcanic ash soil, Santorini is home to unique and prized produce. ": null
    },
    {
        "Santorini tomato": "Santorini Tomato"
    },
    {
        "es are renowned; they are ": null
    },
    {
        "cherry tomato": "Cherry Tomato"
    },
    {
        "es that are extremely tasty and sweet, and with an intensely red, staining colour. ": null
    },
    {
        "Santorini fava ": "Fava Santorinis"
    },
    {
        " is a purée made of the hulled, then sun-dried, then boiled ": null
    },
    {
        "legume": "Legume"
    },
    {
        " Lathyrus clymenum": "Lathyrus Clymenum"
    },
    {
        " – not from the yellow ": null
    },
    {
        "split pea": "Split Pea"
    },
    {
        " as in the rest of Greece. The white ": null
    },
    {
        "eggplants": "Eggplant"
    },
    {
        " of Santorini are very sweet, with very few seeds, and can be eaten raw. The katsoúni is a unique local variety of large ": null
    },
    {
        "cucumber": "Cucumber"
    },
    {
        " which, if left unpicked when green, turn yellow and acquire a sweet taste almost indistinguishable from that of ": null
    },
    {
        "melon": "Melon"
    },
    {
        ".  ": null
    },
    {
        "Capers": "Caper"
    },
    {
        " with their unique flavor are used in Greek salads and other local dishes.     The cuisine of the island is an example of the cuisine of the Aegean islands, and most specifically of the ": null
    },
    {
        "Cyclades": "Cyclades"
    },
    {
        " .            The island remains the home of a small, but flourishing, ": null
    },
    {
        "wine": "Wine"
    },
    {
        " industry, based on the indigenous ": null
    },
    {
        "grape": "Grape"
    },
    {
        " variety, ": null
    },
    {
        "Assyrtiko": "Assyrtiko"
    },
    {
        ", with auxiliary cultivations of two other Aegean varietals,  Athiri  and  Aidani . The vines are extremely old and resistant to ": null
    },
    {
        "phylloxera": "Phylloxera"
    },
    {
        " , so the vines needed no replacement during the great ": null
    },
    {
        "phylloxera epidemic": "Phylloxera Epidemic"
    },
    {
        " of the late 19th century. In their adaptation to their habitat, such vines are planted far apart, as their principal source of moisture is dew, and they often are ": null
    },
    {
        "trained": "Trained"
    },
    {
        " in the shape of low-spiralling baskets, with the grapes hanging inside to protect them from the winds.     The viticultural pride of the island is the sweet and strong Vinsanto  , a dessert wine made from the best sun-dried Assyrtiko, Athiri, and Aidani grapes, and undergoing long barrel aging . It matures to a sweet, dark amber-orange, unctuous dessert wine that has achieved worldwide fame, possessing the standard Assyrtiko aromas of citrus and minerals, layered with overtones of nuts, raisins, figs, honey and tea.                White wines from the island are extremely dry with a strong, citrus scent and mineral and iodide salt aromas contributed by the ashy volcanic soil, whereas barrel aging gives to some of the white wines a slight ": null
    },
    {
        "frankincense": "Frankincense"
    },
    {
        " aroma, much like Vinsanto. It is not easy to be a winegrower in Santorini; the hot and dry conditions give the soil a very low productivity. The yield per hectare is only 10 to 20% of the yields that are common in ": null
    },
    {
        "France": "France"
    },
    {
        " or ": null
    },
    {
        "California": "California"
    },
    {
        ". The islands wines are standardised and protected by the Vinsanto and Santorini ": null
    },
    {
        "OPAP": "Protected Designation Of Originwines"
    },
    {
        " designations of origin.     A brewery, the ": null
    },
    {
        "Santorini Brewing Company": "Santorini Brewing Company"
    },
    {
        ", began operating out of Santorini in 2011, based in the islands wine region.          The traditional architecture of Santorini is similar to that of the other ": null
    },
    {
        "Cyclades": "Cyclades"
    },
    {
        ", with low-lying cubical houses, made of local stone and ": null
    },
    {
        "whitewash": "Whitewash"
    },
    {
        "ed or limewashed with various volcanic ashes used as colours. The unique characteristic is the common utilisation of the hypóskapha": null
    },
    {
        "pumice": "Pumice"
    },
    {
        ". These rooms are prized because of the high insulation provided by the air-filled pumice, and are used as living quarters of unique coolness in the summer and warmth in the winter. These are premium storage space for produce, especially for wine cellaring: the Kánava wineries of Santorini.     When strong earthquakes struck the island in 1956, half the buildings were completely destroyed and a large number suffered repairable damage. The underground dwellings along the ridge overlooking the caldera, where the instability of the soil was responsible for the great extent of the damage, needed to be evacuated. Most of the population of Santorini had to emigrate to Piraeus and Athens.   ": null
    },
    {
        "Themison of Thera": "Themison Of Thera"
    },
    {
        " Spyros Markezinis": "Spyros Markezinis"
    },
    {
        ", politician   ": null
    },
    {
        "Mariza Koch": "Mariza Koch"
    },
    {
        ", singer   ": null
    },
    {
        "Giannis Alafouzos": "Giannis Alafouzos"
    },
    {
        ", former president of ": null
    },
    {
        "Panathinaikos F.C.": "Panathinaikos F.C."
    },
    {
        "     The island was featured in The 2005 film ”The Sisterhood of the Traveling Pants“.     ": null
    },
    {
        "Santorini Film Festival": "Santorini Film Festival"
    },
    {
        " held annually at the open air cinema, Cinema Kamari in Santorini.               Bus services link Fira to most parts of the island.        Santorini has two ports: ": null
    },
    {
        "Athinios": "Athinios"
    },
    {
        " and Skala . Santorini Port Authority  Cruise ships anchor off Skala and passengers are transferred by local boatmen to shore at Skala where Fira is accessed by ": null
    },
    {
        "cable car": "Santorini Cable Car"
    },
    {
        ", on foot or by donkey.  Tour boats depart from Skala for Nea Kameni and other Santorini destinations. Santorini Port Authority                  Santorini is one of the few ": null
    },
    {
        "Cyclades": "Cyclades"
    },
    {
        " Islands with a major airport, which lies about  southeast of downtown Thera. The main asphalt runway is  in length, and the parallel taxiway was built to runway specification . It can accommodate ": null
    },
    {
        "Boeing 757": "Boeing 757"
    },
    {
        ", ": null
    },
    {
        "Boeing 737": "Boeing 737"
    },
    {
        ", ": null
    },
    {
        "Airbus 320": "Airbus 320"
    },
    {
        " series, ": null
    },
    {
        "Avro RJ": "Avro Rj"
    },
    {
        ", ": null
    },
    {
        "Fokker 70": "Fokker 70"
    },
    {
        ", and ": null
    },
    {
        "ATR 72": "Atr 72"
    },
    {
        " aircraft. Scheduled airlines include the new ": null
    },
    {
        "Olympic Air": "Olympic Air"
    },
    {
        ", ": null
    },
    {
        "Aegean Airlines": "Aegean Airlines"
    },
    {
        ", and ": null
    },
    {
        "Ryanair": "Ryanair"
    },
    {
        ", with chartered flights from other airlines during the summer, and with transportation to and from the air terminal available through buses, taxis, hotel car-pickups and rental cars.           ": null
    },
    {
        "Akrotiri": "Akrotiri, Santorini"
    },
    {
        " Ammoudi": "Ammoudi,"
    },
    {
        " Athinios": "Athinios"
    },
    {
        " Emporio": "Emporio"
    },
    {
        " Finika": "Finikia"
    },
    {
        " Fira": "Fira"
    },
    {
        " Firostefani": "Firostefani"
    },
    {
        " Imerovigli": "Imerovigli"
    },
    {
        " Kamari": "Kamari"
    },
    {
        " Karterados": "Karterados"
    },
    {
        " Messaria": "Messaria"
    },
    {
        " Monolithos": "Monolithos"
    },
    {
        " Oia": "Oia, Greece"
    },
    {
        " Perissa": "Perissa, Santorini"
    },
    {
        " Pyrgos Kallistis": "Pyrgos Kallistis"
    },
    {
        " Vothonas": "Vothonas"
    },
    {
        " Vourvoulos": "Vourvoulos"
    },
    {
        "   ": null
    }
]