[
    {
        "      A scabbard is a sheath for holding a ": null
    },
    {
        "sword": "Sword"
    },
    {
        ", ": null
    },
    {
        "knife": "Knife"
    },
    {
        ", or other large blade. As well, rifles may be stirespd in a scabbard by horse riders. Military ": null
    },
    {
        "cavalry": "Cavalry"
    },
    {
        " and ": null
    },
    {
        "cowboys": "Cowboy"
    },
    {
        "had scabbards for their ": null
    },
    {
        "saddle ring": "Saddle Ring"
    },
    {
        " carbine": "Carbine"
    },
    {
        " rifles and ": null
    },
    {
        "lever action rifles": "Leveraction"
    },
    {
        " on their horses for storage and protection. Scabbards have been made of many materials over the millennia, including ": null
    },
    {
        "leather": "Leather"
    },
    {
        ", ": null
    },
    {
        "wood": "Wood"
    },
    {
        ", and ": null
    },
    {
        "metals": "Metal"
    },
    {
        "such as ": null
    },
    {
        "brass": "Brass"
    },
    {
        " or ": null
    },
    {
        "steel": "Steel"
    },
    {
        ".     Most commonly, sword scabbards were worn suspended from a sword belt or shoulder belt called a ": null
    },
    {
        "baldric": "Baldric"
    },
    {
        ".          Wooden scabbards were usually covered in fabric or leather; the leather versions also usually bore metal fittings for added protection and carrying ease. Japanese blades typically have their sharp cutting edge protected by a wooden scabbard called a ": null
    },
    {
        "saya": "Japaneseswordmountingssaya"
    },
    {
        ". Many scabbards, such as ones the Greeks and Romans used, were small and light. They were designed for holding the sword rather than protecting it. All-metal scabbards were popular items for a display of wealth among elites in the European ": null
    },
    {
        "Iron Age": "Iron Age"
    },
    {
        ", and often intricately decorated. Little is known about the scabbards of the early Iron Age, due to their wooden construction. However, during the Middle and late Iron Ages, the scabbard became important especially as a vehicle for decorative elaboration. After 200 BC fully decorated scabbards became rare. How Ancient Europeans Saw The World p115,125 by Peter Wells A number of ancient scabbards have been recovered from ": null
    },
    {
        "weapons sacrifice": "Weapons Sacrifice"
    },
    {
        "s, a few of which had a lining of fur on the inside. p266 & p282 Lars Jorgensen et al 2003 The spoils of Victory - The north in the shadow of the Roman Empire Nationalmuseet The fur was probably kept oily, keeping the blade free from rust. The fur would also allow a smoother, quicker draw.               Entirely metal scabbards became popular in ": null
    },
    {
        "Europe": "Europe"
    },
    {
        " early in the 19th century and eventually superseded most other types. Metal was more durable than leather and could better withstand the rigours of field use, particularly among troops mounted on horseback. In addition, metal offered the ability to present a more military appearance, as well as the opportunity to display increased ornamentation. Nevertheless, leather scabbards never entirely lost favour among military users and were widely used as late as the ": null
    },
    {
        "American Civil War": "American Civil War"
    },
    {
        " .     Some military police forces, naval shore patrols, law enforcement and other groups used leather scabbards as a kind of ": null
    },
    {
        " truncheon": "Baton"
    },
    {
        ".     Scabbards were historically, albeit rarely, worn across the back, but only by a handful of Celtic tribes, and only with very short lengths of sword. This is because drawing a long, sharp blade over ones shoulder and past ones head from a scabbard on the back is relatively awkward, especially in a hurry, and the length of the arm sets a hard upper limit on how long a blade can be drawn at all in this way. Sheathing the sword again is even harder since it has to be done effectively blind unless the scabbard is taken off first. Common depictions of long swords being drawn from the back are a modern invention, born from safety and convenience considerations on a film set and typically enabled by creative editing, and have enjoyed such great popularity in fiction and fantasy that they are widely and incorrectly believed to have been common in Medieval times. Some more well-known examples of this include the back scabbard depicted in the film  Braveheart  and the back scabbard seen in the video game series  The Legend of Zelda . There is some limited data from woodcuts and textual fragments that Mongol light horse archers, Chinese soldiers, Japanese Samurai and European Knights wore a slung baldric over the shoulder, allowing longer blades such as greatswords/zweihanders and nodachi/ōdachi to be strapped across the back, though these would have to be removed from the back before the sword could be unsheathed.     In The Ancient Celts by Barry Cunliffe, Cunliffe writes, All these pieces of equipment mentioned in the texts, are reflected in the archaeological record and in the surviving iconography, though it is sometimes possible to detect regional variations . Among the ": null
    },
    {
        "Parisii": "Parisii"
    },
    {
        " of Yorkshire, for example, the ...sword was sometimes worn across the back and therefore had to be drawn over the shoulder from behind the head.         The metal fitting where the blade enters the leather or metal scabbard is called the throat, which is often part of a larger scabbard mount, or locket, that bears a carrying ring or stud to facilitate wearing the sword. The blades point in leather scabbards is usually protected by a metal tip, or ": null
    },
    {
        "chape": "Chape"
    },
    {
        ", which, on both leather and metal scabbards, is often given further protection from wear by an extension called a drag, or shoe": null
    }
]