[
    {
        "          The Scandinavian Peninsula  is a ": null
    },
    {
        "peninsula": "Peninsula"
    },
    {
        " of ": null
    },
    {
        "Eurasia": "Eurasia"
    },
    {
        " located in ": null
    },
    {
        "Northern Europe": "Northern Europe"
    },
    {
        ", which roughly comprises the mainland of ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ", the mainland of ": null
    },
    {
        "Norway": "Norway"
    },
    {
        ", and the northwestern area of ": null
    },
    {
        "Finland": "Finland"
    },
    {
        ".     The name of the peninsula is derived from the term ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        ", the cultural region of ": null
    },
    {
        "Denmark": "Denmark"
    },
    {
        ", ": null
    },
    {
        "Norway": "Norway"
    },
    {
        " and ": null
    },
    {
        "Sweden": "Sweden"
    },
    {
        ". That cultural name is in turn derived from the name of ": null
    },
    {
        "Scania": "Scania"
    },
    {
        ", the region at the southern extremity of the peninsula which was for centuries a part of Denmark, which is the ancestral home of the ": null
    },
    {
        "Danes": "Danes"
    },
    {
        ", and which is now part of Sweden. The derived term Scandinavian also refers to the ": null
    },
    {
        "Germanic peoples": "Germanic Peoples"
    },
    {
        " who speak ": null
    },
    {
        "North Germanic languages": "North Germanic Languages"
    },
    {
        ", considered to be a ": null
    },
    {
        "dialect continuum": "Dialect Continuum"
    },
    {
        " derived from ": null
    },
    {
        "Old Norse": "Old Norse"
    },
    {
        ". Haugen, Einar . The Scandinavian Languages: An Introduction to Their History. Cambridge, Massachusetts: Harvard University Press, 1976. Helle, Knut . Introduction . The Cambridge History of Scandinavia. Ed. E. I. Kouri et al. Cambridge University Press, 2003. . p. XXII. The name Scandinavia was used by classical authors in the first centuries of the Christian era to identify Skåne and the mainland further north which they believed to be an island. Olwig, Kenneth R. Introduction: The Nature of Cultural Heritage, and the Culture of Natural Heritage—Northern Perspectives on a Contested Patrimony . International Journal of Heritage Studies, Vol. 11, No. 1, March 2005, p. 3: The very name Scandinavia is of cultural origin, since it derives from the Scanians or Scandians , a people who long ago lent their name to all of Scandinavia, perhaps because they lived centrally, at the southern tip of the peninsula. Østergård, Uffe . The Geopolitics of Nordic Identity – From Composite States to Nation States . The Cultural Construction of Norden. Øystein Sørensen and Bo Stråth , Oslo: Scandinavian University Press 1997, 25-71. These modern North Germanic languages found in Scandinavia are ": null
    },
    {
        "Danish": "Danish Language"
    },
    {
        ", ": null
    },
    {
        "Norwegian": "Norwegian Language"
    },
    {
        ", and ": null
    },
    {
        "Swedish": "Swedish Language"
    },
    {
        "; additionally ": null
    },
    {
        "Faroese": "Faroese Language"
    },
    {
        " and ": null
    },
    {
        "Icelandic": "Icelandic Language"
    },
    {
        " belong to the same language group, but they are not part of the modern Scandinavian dialect continuum and are not intelligible with the other languages.     The Scandinavian Peninsula is the largest of the well-known peninsulas of ": null
    },
    {
        "Europe": "Europe"
    },
    {
        ", with a greater area than the ": null
    },
    {
        "Balkan": "Balkan Peninsula"
    },
    {
        ", ": null
    },
    {
        "Iberian": "Iberian Peninsula"
    },
    {
        " and ": null
    },
    {
        "Italian": "Italian Peninsula"
    },
    {
        " peninsulas. During the Ice Ages, the sea level of the ": null
    },
    {
        "Atlantic Ocean": "Atlantic Ocean"
    },
    {
        " dropped so much that the ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        ", the ": null
    },
    {
        "Gulf of Bothnia": "Gulf Of Bothnia"
    },
    {
        " and the ": null
    },
    {
        "Gulf of Finland": "Gulf Of Finland"
    },
    {
        " disappeared, and the countries now surrounding them, including Germany, Poland, the other Baltic countries and Scandinavia, were directly joined by land.                  The largest peninsula in Europe, the Scandinavian Peninsula is approximately  long with a width varying approximately from 370 to 805 kilometres . The ": null
    },
    {
        "Scandinavian mountain range": "Scandinavian Mountain Range"
    },
    {
        " generally defines the border between Norway and Sweden. The peninsula is bordered by several bodies of water including:     the ": null
    },
    {
        "Barents Sea": "Barents Sea"
    },
    {
        " to the north   the ": null
    },
    {
        "Norwegian Sea": "Norwegian Sea"
    },
    {
        " to the west   the ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        " and ": null
    },
    {
        "Baltic Sea": "Baltic Sea"
    },
    {
        " to the south   the Baltic Sea,  to the east.     Its highest elevation was ": null
    },
    {
        "Glittertinden": "Glittertinden"
    },
    {
        " in Norway at 2,470 metres above sea level, but since the glacier at its summit partially melted , the highest elevation is at 2,469 metres at ": null
    },
    {
        "Galdhøpiggen": "Galdhøpiggen"
    },
    {
        ", also in Norway. These mountains also have the largest ": null
    },
    {
        "glacier": "Glacier"
    },
    {
        " on the mainland of Europe, ": null
    },
    {
        "Jostedalsbreen": "Jostedalsbreen"
    },
    {
        ".     About one quarter of the Scandinavian Peninsula lies north of the ": null
    },
    {
        "Arctic Circle": "Arctic Circle"
    },
    {
        ", its northernmost point being at ": null
    },
    {
        "Cape Nordkyn": "Cape Nordkyn"
    },
    {
        ", ": null
    },
    {
        "Norway": "Norway"
    },
    {
        ".     The climate across Scandinavia varies from tundra  and subarctic in the north, with cool marine west coast climate in northwestern coastal areas reaching just north of ": null
    },
    {
        "Lofoten": "Lofoten"
    },
    {
        ", to humid continental in the central portion and marine west coast in the south and southwest.    The region is rich in timber, iron and copper with the best farmland in southern Sweden. Large petroleum and natural-gas deposits have been found off Norways coast in the ": null
    },
    {
        "North Sea": "North Sea"
    },
    {
        " and the Atlantic Ocean.     Much of the population of the Scandinavian Peninsula is naturally concentrated in its southern part, which is also its ": null
    },
    {
        "agricultural": "Agricultural"
    },
    {
        " region. The largest cities of the peninsula are ": null
    },
    {
        "Stockholm": "Stockholm"
    },
    {
        ", Sweden; ": null
    },
    {
        "Oslo": "Oslo"
    },
    {
        ", Norway; ": null
    },
    {
        "Gothenburg": "Gothenburg"
    },
    {
        ", Sweden; ": null
    },
    {
        "Malmö": "Malmö"
    },
    {
        ", Sweden and ": null
    },
    {
        "Bergen": "Bergen"
    },
    {
        ", Norway, in that order.       The Scandinavian Peninsula occupies part of the ": null
    },
    {
        "Baltic Shield": "Baltic Shield"
    },
    {
        ", a stable and large crust segment formed of very old, ": null
    },
    {
        "crystalline": "Crystalrocks"
    },
    {
        " metamorphic rock": "Metamorphic Rock"
    },
    {
        "s. Most of the soil covering this substrate was scraped by glaciers during the ": null
    },
    {
        "Ice Ages": "Ice Age"
    },
    {
        "of antiquity,  As a consequence of this scouring, the ": null
    },
    {
        "elevation": "Elevation"
    },
    {
        " of the land and the cool-to-cold ": null
    },
    {
        "climate": "Climate"
    },
    {
        ", a relatively small percentage of its land is ": null
    },
    {
        "arable": "Arable Land"
    },
    {
        ". Hobbs, Joseph J. and Salter, Christopher L.Essentials Of World Regional Geography,p. 108.Thomson Brooks/Cole.2005.     The ": null
    },
    {
        "glaciation": "Glaciation"
    },
    {
        " during the Ice Ages also deepened many of the river valleys, which were invaded by the sea when the ice melted, creating the noteworthy ": null
    },
    {
        "fjords": "Fjords"
    },
    {
        " of Norway. In the southern part of the peninsula, the glaciers deposited vast numbers of ": null
    },
    {
        "terminal moraine": "Terminal Moraine"
    },
    {
        "s, configuring a very chaotic landscape. Ostergren, Robert C., Rice, John G. The Europeans. Guilford Press. 2004. These terminal moraines covered all of what is now Denmark.          Although the Baltic Shield is mostly ": null
    },
    {
        "geologically": "Geology"
    },
    {
        " stable and hence resistant to the influences of other neighbouring tectonic formations, the weight of nearly four kilometres of ice during the Ice Ages caused all of the Scandinavian terrain to sink. When the ice sheet disappeared, the shield rose again, a tendency that continues to this day at a rate of about one metre per century. Conversely, the southern part has tended to sink to compensate, causing flooding of the ": null
    },
    {
        "Low Countries": "Low Countries"
    },
    {
        " and Denmark.     The crystalline substrate of the land and absence of soil in many places have exposed mineral deposits of metal ": null
    },
    {
        "ore": "Ore"
    },
    {
        "s, such as those of ": null
    },
    {
        "iron": "Iron"
    },
    {
        ", ": null
    },
    {
        "copper": "Copper"
    },
    {
        ", ": null
    },
    {
        "nickel": "Nickel"
    },
    {
        ", ": null
    },
    {
        "zinc": "Zinc"
    },
    {
        ", ": null
    },
    {
        "silver": "Silver"
    },
    {
        " and ": null
    },
    {
        "gold": "Gold"
    },
    {
        ". The very most valuable of these have been the deposits of ": null
    },
    {
        "iron ore": "Iron Ore"
    },
    {
        " in northwestern Sweden. In the 19th century these deposits prompted the building of a ": null
    },
    {
        "railway": "Rail Transport"
    },
    {
        " from northwestern Sweden to the Norwegian ": null
    },
    {
        "seaport": "Seaport"
    },
    {
        " of ": null
    },
    {
        "Narvik": "Narvik"
    },
    {
        " so that the iron ore could be exported by ship to places like southern Sweden, ": null
    },
    {
        "Germany": "Germany"
    },
    {
        ", ": null
    },
    {
        "Great Britain": "Uk"
    },
    {
        " and ": null
    },
    {
        "Belgium": "Belgium"
    },
    {
        " for smelting into iron and ": null
    },
    {
        "steel": "Steel"
    },
    {
        ". This railway is in a region of Norway and Sweden that otherwise does not have any railways because of the very rugged terrain, mountains and ": null
    },
    {
        "fjords": "Fjord"
    },
    {
        "of that part of Scandinavia.       The first recorded human presence in the southern area of the peninsula and Denmark dates from 12,000 years ago. Tilley, Christopher Y. Ethnography of the Neolithic: Early Prehistoric Societies in Southern Scandinavia, p. 9, Cambridge University Press. 2003.  As the ice sheets from the glaciation retreated, the climate allowed a ": null
    },
    {
        "tundra": "Tundra"
    },
    {
        " biome": "Biome"
    },
    {
        " that attracted ": null
    },
    {
        "reindeer": "Reindeer"
    },
    {
        " hunters. The climate warmed up gradually, favouring the growth of ": null
    },
    {
        "evergreen": "Evergreen"
    },
    {
        " trees first and then ": null
    },
    {
        "deciduous": "Deciduous"
    },
    {
        " forest which brought animals like ": null
    },
    {
        "aurochs": "Aurochs"
    },
    {
        ". Groups of hunter-fisher-gatherers started to inhabit the area from the ": null
    },
    {
        "Mesolithic": "Mesolithic"
    },
    {
        " , up to the advent of agriculture in the ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " .     The northern and central part of the peninsula is partially inhabited by the ": null
    },
    {
        "Sami": "Sami People"
    },
    {
        ", often referred to as Lapps or Laplanders, who began to arrive several thousand years after the Scandinavian Peninsula had already been inhabited in the south. In the earliest recorded periods they occupied the ": null
    },
    {
        "arctic": "Arctic"
    },
    {
        " and ": null
    },
    {
        "subarctic": "Subarctic"
    },
    {
        " regions as well as the central part of the peninsula as far south as ": null
    },
    {
        "Dalarna": "Dalarna"
    },
    {
        ", Sweden. They speak the ": null
    },
    {
        "Sami language": "Sami Languages"
    },
    {
        ", a non-": null
    },
    {
        "Indo-European language": "Indo-European Language"
    },
    {
        " of the ": null
    },
    {
        "Uralic": "Uralic Languages"
    },
    {
        " family which is related to ": null
    },
    {
        "Finnish": "Finnish Language"
    },
    {
        " and ": null
    },
    {
        "Estonian": "Estonian Language"
    },
    {
        ". The first inhabitants of the peninsula were the Norwegians on the west coast of Norway, the Danes in what is now southern and western Sweden and southeastern Norway, the ": null
    },
    {
        "Svear": "Swedes"
    },
    {
        " in the region around ": null
    },
    {
        "Mälaren": "Mälaren"
    },
    {
        " as well as a large portion of the present day eastern seacoast of Sweden and the ": null
    },
    {
        "Geats": "Geat"
    },
    {
        "in ": null
    },
    {
        "Västergötland": "Västergötland"
    },
    {
        " and ": null
    },
    {
        "Östergötland": "Östergötland"
    },
    {
        ". These peoples spoke closely related ": null
    },
    {
        "dialects": "Dialect"
    },
    {
        "of an Indo-European language, ": null
    },
    {
        "Old Norse": "Old Norse"
    },
    {
        ". Although political boundaries have shifted, descendants of these peoples still are the dominant populations in the peninsula in the early 21st century.              Although the ": null
    },
    {
        "Nordic countries": "Nordic Countries"
    },
    {
        " look back on more than 1,000 years of history as distinct political entities, the international boundaries came late and emerged gradually. It was not until the middle of the 17th century that Sweden had a secure outlet on the ": null
    },
    {
        "Kattegat": "Kattegat"
    },
    {
        " and control of the south Baltic coast. The Swedish and Norwegian boundaries were finally agreed and marked out in 1751. The Finnish-Norwegian border on the peninsula was established after extensive negotiation in 1809, and the common Norwegian-Russian districts were not partitioned until 1826. Even then the borders were still fluid, with Finland gaining access to the ": null
    },
    {
        "Barents Sea": "Barents Sea"
    },
    {
        " in 1920, but ceding this territory to the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " in 1944.      Denmark, Sweden and the ": null
    },
    {
        "Russian Empire": "Russian Empire"
    },
    {
        " dominated the ": null
    },
    {
        "political relationships": "Political Science"
    },
    {
        "on the Scandinavian Peninsula for centuries, with ": null
    },
    {
        "Iceland": "Iceland"
    },
    {
        ", Finland and Norway only gaining their full independence during the 20th century. The Kingdom of ": null
    },
    {
        "Norway": "Norway"
    },
    {
        " long held in ": null
    },
    {
        "personal union": "Personal Union"
    },
    {
        " by ": null
    },
    {
        "Denmark": "Denmark-Norway"
    },
    {
        " fell to ": null
    },
    {
        "Sweden": "United Kingdoms Of Sweden And Norway"
    },
    {
        " after the ": null
    },
    {
        "Napoleonic Wars": "Napoleonic Wars"
    },
    {
        " and only attained full independence in 1905. Having been an autonomous grand duchy within the Russian Empire since 1809, Finland declared independence during the Soviet revolution of Russia in 1917. Iceland declared its independence from Denmark in 1944, while Denmark was under the occupation of ": null
    },
    {
        "Nazi Germany": "Nazi Germany"
    },
    {
        ". Iceland was encouraged to do this by the British and American armed forces that were defending Iceland from Nazi invasion.     The ": null
    },
    {
        "Wehrmacht": "Wehrmacht"
    },
    {
        " invaded Norway in 1940 and the German Army occupied all of Norway until May 1945. With the acquiescence of the ": null
    },
    {
        "Kingdom of Sweden": "Kingdom Of Sweden"
    },
    {
        ", German troops moved from northern Norway, across northern Sweden, into Finland, which had become an ally of Nazi Germany. Then, in the spring of 1941, the German Army and the ": null
    },
    {
        "Finnish Army": "Finnish Army"
    },
    {
        " invaded the Soviet Union together. The Republic of Finland had a grievance against the Soviet Union because the ": null
    },
    {
        "Red Army": "Red Army"
    },
    {
        " had invaded southeastern Finland in the ": null
    },
    {
        "Winter War": "Winter War"
    },
    {
        " and had taken a large area of territory away from Finland.     Sweden remained a ": null
    },
    {
        "neutral country": "Neutral Country"
    },
    {
        " during the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        ", the ": null
    },
    {
        "Korean War": "Korean War"
    },
    {
        " and the ": null
    },
    {
        "Cold War": "Cold War"
    },
    {
        ", but chose to ally with Nazi Germany in the Second World war.     In 1945, Norway, Denmark and Iceland were founding members of the ": null
    },
    {
        "United Nations": "United Nations"
    },
    {
        ". Sweden joined the U.N. soon after. Finland joined during the 1950s. The first ": null
    },
    {
        "Secretary General of the United Nations": "Secretary General Of The United Nations"
    },
    {
        ", ": null
    },
    {
        "Trygve Lie": "Trygve Lie"
    },
    {
        ", was a Norwegian citizen. The second Secretary General of the United Nations, ": null
    },
    {
        "Dag Hammarskjöld": "Dag Hammarskjöld"
    },
    {
        ", was a Swedish citizen. Thus the people of the Scandinavian Peninsula had a strong influence in international affairs during the 20th century.     In 1949, Norway, Denmark and Iceland became founding members of the ": null
    },
    {
        "North Atlantic Treaty Organisation": "Nato"
    },
    {
        " for their defence against East Germany, the Soviet Union and all other potential invaders, and these three countries remain members as of 2011.     Sweden and Finland joined the ": null
    },
    {
        "European Union": "European Union"
    }
]