[
    {
        "      Seaborgium is a ": null
    },
    {
        "synthetic": "Synthetic Element"
    },
    {
        " chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        " Sg and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        " 106. It is named after the American ": null
    },
    {
        "nuclear chemist": "Nuclear Chemist"
    },
    {
        " Glenn T. Seaborg": "Glenn T. Seaborg"
    },
    {
        ". As a ": null
    },
    {
        "synthetic element": "Synthetic Element"
    },
    {
        ", it can be created in a laboratory but is not found in nature. It is also ": null
    },
    {
        "radioactive": "Radioactive"
    },
    {
        "; the most stable known ": null
    },
    {
        "isotope": "Isotope"
    },
    {
        ", 269 Sg, has a ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " of approximately 14  minutes.     In the ": null
    },
    {
        "periodic table": "Periodic Table"
    },
    {
        " of the elements, it is a ": null
    },
    {
        "d-block": "D-Block"
    },
    {
        " transactinide element": "Transactinide Element"
    },
    {
        ". It is a member of the ": null
    },
    {
        "7th period": "Period 7"
    },
    {
        " and belongs to the ": null
    },
    {
        "group 6 elements": "Group 6 Elements"
    },
    {
        " as the fourth member of the 6d series of ": null
    },
    {
        "transition metal": "Transition Metal"
    },
    {
        "s. Chemistry experiments have confirmed that seaborgium behaves as the heavier ": null
    },
    {
        "homologue": "Homology"
    },
    {
        " to ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        " in group 6. The chemical properties of seaborgium are characterized only partly, but they compare well with the chemistry of the other group 6 elements.     In 1974, a few atoms of seaborgium were produced in laboratories in the ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " and in the United States. The priority of the discovery and therefore the ": null
    },
    {
        "naming of the element was disputed": "Transfermium Wars"
    },
    {
        " between Soviet and American scientists, and it was not until 1997 that ": null
    },
    {
        "International Union of Pure and Applied Chemistry": "International Union Of Pure And Applied Chemistry"
    },
    {
        " established seaborgium as the official name for the element. It is one of only two elements named after a living person at the time of naming, the other being ": null
    },
    {
        "oganesson": "Oganesson"
    },
    {
        ", element 118.       Following claims of the observation of elements ": null
    },
    {
        "104": "Rutherfordium"
    },
    {
        " and ": null
    },
    {
        "105": "Dubnium"
    },
    {
        " in 1970 by ": null
    },
    {
        "Albert Ghiorso": "Albert Ghiorso"
    },
    {
        " et al. at the ": null
    },
    {
        "Lawrence Livermore National Laboratory": "Lawrence Livermore National Laboratory"
    },
    {
        ", a search for element 106 using oxygen-18 projectiles and the previously used californium-249 target was conducted. Several 9.1 MeV ": null
    },
    {
        "alpha decays": "Alpha Decay"
    },
    {
        "were reported and are now thought to originate from element 106, though this was not confirmed at the time. In 1972, the HILAC accelerator received equipment upgrades, preventing the team from repeating the experiment, and data analysis was not done during the shutdown.  This reaction was tried again several years later, in 1974, and the Berkeley team realized that their new data agreed with their 1971 data, to the astonishment of Ghiorso. Hence, element 106 could have actually been discovered in 1971 if the original data was analyzed more carefully.     Two groups claimed ": null
    },
    {
        "discovery of the element": "Discovery Of The Chemical Elements"
    },
    {
        ". Unambiguous evidence of element 106 was first reported in 1974 by a Russian research team in ": null
    },
    {
        "Dubna": "Dubna"
    },
    {
        " led by ": null
    },
    {
        "Yuri Oganessian": "Yuri Oganessian"
    },
    {
        ", in which targets of ": null
    },
    {
        "lead-208": "Lead-208"
    },
    {
        " and ": null
    },
    {
        "lead-207": "Lead-207"
    },
    {
        " were bombarded with accelerated ions of ": null
    },
    {
        "chromium-54": "Chromium-54"
    },
    {
        ". In total, fifty-one ": null
    },
    {
        "spontaneous fission": "Spontaneous Fission"
    },
    {
        " events were observed with a half-life between four and ten ": null
    },
    {
        "milliseconds": "Milliseconds"
    },
    {
        ". After having ruled out nucleon ": null
    },
    {
        "transfer reactions": "Nuclear Reactiontransfer Reactions"
    },
    {
        " as a cause for these activities, the team concluded that the most likely cause of the activities was the spontaneous fission of isotopes of element 106. The isotope in question was first suggested to be seaborgium-259, but was later corrected to seaborgium-260.      : +  →  + 2    : +  →  +      A few months later in 1974, researchers including Glenn T. Seaborg, ": null
    },
    {
        "Carol Alonso": "Carol Alonso"
    },
    {
        " and Albert Ghiorso at the ": null
    },
    {
        "University of California, Berkeley": "University Of California, Berkeley"
    },
    {
        ", and E. Kenneth Hulet from the Lawrence Livermore National Laboratory, also synthesized the element  by bombarding a ": null
    },
    {
        "californium": "Californium"
    },
    {
        "-249 target with ": null
    },
    {
        "oxygen-18": "Oxygen-18"
    },
    {
        " ions, using equipment similar to that which had been used for the synthesis of ": null
    },
    {
        "element 104": "Rutherfordium"
    },
    {
        " five years earlier, observing at least seventy ": null
    },
    {
        "alpha decay": "Alpha Decay"
    },
    {
        "s, seemingly from the isotope seaborgium-263m with a half-life of  seconds. The alpha daughter rutherfordium-259 and granddaughter nobelium-255 had previously been synthesised and the properties observed here matched with those previously known, as did the intensity of their production. The ": null
    },
    {
        "cross-section": "Cross-Section"
    },
    {
        " of the reaction observed, 0.3  ": null
    },
    {
        "nanobarns": "Barn"
    },
    {
        ", also agreed well with theoretical predictions. These bolstered the assignment of the alpha decay events to seaborgium-263m.     : +  →  + 4  →  +  →  +      A dispute thus arose from the initial competing claims of discovery, though unlike the case of the synthetic elements up to ": null
    },
    {
        "element 105": "Dubnium"
    },
    {
        ", neither team of discoverers chose to announce proposed names for the new elements, thus averting an ": null
    },
    {
        "element naming controversy": "Element Naming Controversy"
    },
    {
        " temporarily. The dispute on discovery, however, dragged on until 1992, when the IUPAC/IUPAP Transfermium Working Group , formed to put an end to the controversy by making conclusions regarding discovery claims for elements 101 to ": null
    },
    {
        "112": "Copernicium"
    },
    {
        ", concluded that the Soviet synthesis of seaborgium-260 was not convincing enough, lacking as it is in yield curves and angular selection results , whereas the American synthesis of seaborgium-263 was convincing due to its being firmly anchored to known daughter nuclei. As such, the TWG recognised the Berkeley team as official discoverers in their 1993 report.           Seaborg had previously suggested to the TWG that if Berkeley was recognised as the official discoverer of elements 104 and 105, they might propose the name kurchatovium for element 106 to honour the Dubna team, which had proposed this name for element 104 after ": null
    },
    {
        "Igor Kurchatov": "Igor Kurchatov"
    },
    {
        ", the former head of the ": null
    },
    {
        "Soviet nuclear research": "Soviet Nuclear Research"
    },
    {
        " programme. However, due to the worsening relations between the competing teams after the publication of the TWG report , this proposal was dropped from consideration by the Berkeley team. Hoffman, D.C., Ghiorso, A., Seaborg, G. T. The Transuranium People: The Inside Story, , 369–399 After being recognized as official discoverers, the Berkeley team started deciding on a name in earnest:          Seaborgs son Eric remembered the naming process as follows:          The name seaborgium and symbol Sg were announced at the 207th national meeting of the ": null
    },
    {
        "American Chemical Society": "American Chemical Society"
    },
    {
        " in March 1994 by Kenneth Hulet, one of the co-discovers. However, ": null
    },
    {
        "IUPAC": "Iupac"
    },
    {
        " resolved in August 1994 that an element could not be named after a living person, and Seaborg was still alive at the time. Thus, in September 1994, IUPAC recommended a set of names in which the names proposed by the three laboratories  with competing claims to the discovery for elements 104 to ": null
    },
    {
        "109": "Meitnerium"
    },
    {
        " were shifted to various other elements, in which rutherfordium , the Berkeley proposal for element 104, was shifted to element 106, with seaborgium being dropped entirely as a name.              This decision ignited a firestorm of worldwide protest for disregarding the historic discoverers right to name new elements, and against the new retroactive rule against naming elements after living persons; the American Chemical Society stood firmly behind the name seaborgium for element 106, together with all the other American and German naming proposals for elements 104 to 109, approving these names for its journals in defiance of IUPAC. At first, IUPAC defended itself, with an American member of its committee writing: Discoverers dont have a right to name an element. They have a right to suggest a name. And, of course, we didnt infringe on that at all. However, Seaborg responded:          Bowing to public pressure, IUPAC proposed a different compromise in August 1995, in which the name seaborgium was reinstated for element 106 in exchange for the removal of all but one of the other American proposals, which met an even worse response. Finally, IUPAC rescinded these previous compromises and made a final, new recommendation in August 1997, in which the American and German proposals for elements 104 to 109 were all adopted, including seaborgium for element 106, with the single exception of element 105, named dubnium to recognise the contributions of the Dubna team to the experimental procedures of transactinide synthesis. This list was finally accepted by the American Chemical Society, which wrote:          Seaborg commented regarding the naming:          Seaborg died a year and a half later, on 25 February 1999, at the age of 86.                 ": null
    },
    {
        "Superheavy elements": "Superheavy Element"
    },
    {
        "such as seaborgium are produced by bombarding lighter elements in ": null
    },
    {
        "particle accelerators": "Particle Accelerator"
    },
    {
        "that induces ": null
    },
    {
        "fusion reaction": "Fusion Reaction"
    },
    {
        "s. Whereas most of the isotopes of seaborgium can be synthesized directly this way, some heavier ones have only been observed as decay products of elements with higher ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        "s.      Depending on the energies involved, fusion reactions that generate superheavy elements are separated into hot and cold . In hot fusion reactions, very light, high-energy projectiles are accelerated toward very heavy targets , giving rise to compound nuclei at high excitation energy  that may either fission or evaporate several neutrons. In cold fusion reactions, the produced fused nuclei have a relatively low excitation energy , which decreases the probability that these products will undergo fission reactions. As the fused nuclei cool to the ": null
    },
    {
        "ground state": "Ground State"
    },
    {
        ", they require emission of only one or two neutrons, and thus, allows for the generation of more neutron-rich products.  The latter is a distinct concept from that of where nuclear fusion claimed to be achieved at room temperature conditions .      Seaborgium has no stable or naturally occurring isotopes. Several radioactive isotopes have been synthesized in the laboratory, either by fusing two atoms or by observing the decay of heavier elements. Twelve different isotopes of seaborgium have been reported with atomic masses 258–267, 269, and 271, three of which, seaborgium-261, 263, and 265, have known ": null
    },
    {
        "metastable state": "Metastable State"
    },
    {
        "s. All of these decay only through alpha decay and spontaneous fission, with the single exception of seaborgium-261 that can also undergo ": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        " to dubnium-261.     There is a trend toward increasing half-lives for the heavier isotopes; thus the heaviest three known isotopes, 267 Sg, 269 Sg, and 271 Sg, are also the longest-lived, having half-lives in minutes. Some other isotopes in this region are predicted to have comparable or even longer half-lives. Additionally, 263 Sg, 265 Sg, and 265m Sg have half-lives measured in seconds. All the remaining isotopes have half-lives measured in milliseconds, with the exception of the shortest-lived isotope, 261m Sg, with a half-life of only 92  microseconds.     The proton-rich isotopes from 258 Sg to 261 Sg were directly produced by cold fusion; all heavier isotopes were produced from the repeated alpha decay of the heavier elements ": null
    },
    {
        "hassium": "Hassium"
    },
    {
        ", ": null
    },
    {
        "darmstadtium": "Darmstadtium"
    },
    {
        ", and ": null
    },
    {
        "flerovium": "Flerovium"
    },
    {
        ", with the exceptions of the isotopes 263m Sg, 264 Sg, 265 Sg, and 265m Sg, which were directly produced by hot fusion through irradiation of actinide targets. The twelve isotopes of seaborgium have half-lives ranging from 92  microseconds for 261m Sg to 14  minutes for 269 Sg.         Seaborgium is expected to be a solid under normal conditions and assume a ": null
    },
    {
        "body-centered cubic": "Body-Centered Cubic"
    },
    {
        " crystal structure, similar to its lighter ": null
    },
    {
        "congener": "Congener"
    },
    {
        " tungsten. It should be a very heavy metal with a ": null
    },
    {
        "density": "Density"
    },
    {
        " of around 35.0  g/cm 3 , which would be the fourth-highest of any of the 118 known elements, lower only than ": null
    },
    {
        "bohrium": "Bohrium"
    },
    {
        " , ": null
    },
    {
        "meitnerium": "Meitnerium"
    },
    {
        " and ": null
    },
    {
        "hassium": "Hassium"
    },
    {
        " , the three following elements in the periodic table. In comparison, the densest known element that has had its density measured, ": null
    },
    {
        "osmium": "Osmium"
    },
    {
        ", has a density of only 22.61  g/cm 3 . This results from seaborgiums high atomic weight, the ": null
    },
    {
        "lanthanide and actinide contractions": "Lanthanide Contraction"
    },
    {
        ", and ": null
    },
    {
        "relativistic effects": "Relativistic Quantum Chemistry"
    },
    {
        ", although production of enough seaborgium to measure this quantity would be impractical, and the sample would quickly decay.       Seaborgium is the fourth member of the 6d series of transition metals and the heaviest member of ": null
    },
    {
        "group 6": "Group 6 Element"
    },
    {
        " in the periodic table, below ": null
    },
    {
        "chromium": "Chromium"
    },
    {
        ", ": null
    },
    {
        "molybdenum": "Molybdenum"
    },
    {
        ", and ": null
    },
    {
        "tungsten": "Tungsten"
    },
    {
        ". All the members of the group form a diversity of oxoanions. They readily portray their group oxidation state of +6, although this is highly oxidising in the case of chromium, and this state becomes more and more stable to reduction as the group is descended: indeed, tungsten is the last of the 5d transition metals where all four 5d electrons participate in ": null
    },
    {
        "metallic bonding": "Metallic Bonding"
    },
    {
        ".  As such, seaborgium should have +6 as its most stable oxidation state, both in the gas phase and in aqueous solution, and this is the only oxidation state that is experimentally known for it; the +5 and +4 states should be less stable, and the +3 state, the most common for chromium, would be the least stable for seaborgium.     This stabilisation of the highest oxidation state occurs in the early 6d elements because of the similarity between the energies of the 6d and 7s orbitals, since the 7s orbitals are relativistically stabilised and the 6d orbitals are relativistically destabilised. This effect is so large in the seventh period that seaborgium is expected to lose its 6d electrons before its 7s electrons . Because of the great destabilisation of the 7s orbital, Sg IV should be even more unstable than W IV and should be very readily oxidised to Sg VI . The predicted ionic radius of the hexacoordinate Sg 6+ ion is 65  pm, while the predicted atomic radius of seaborgium is 128  pm. Nevertheless, the stability of the highest oxidation state is still expected to decrease as Lr III & gt; Rf IV & gt; Db V & gt; Sg VI . Some predicted ": null
    },
    {
        "standard reduction potentials": "Standard Reduction Potential"
    },
    {
        "for seaborgium ions in aqueous acidic solution are as follows:          Seaborgium should form a very volatile ": null
    },
    {
        "hexafluoride": "Hexafluoride"
    },
    {
        " as well as a moderately volatile hexachloride , pentachloride , and oxychlorides SgO 2 Cl 2 and SgOCl 4 . SgO 2 Cl 2 is expected to be the most stable of the seaborgium oxychlorides and to be the least volatile of the group 6 oxychlorides, with the sequence MoO 2 Cl 2 & gt; WO 2 Cl 2 & gt; SgO 2 Cl 2 . The volatile seaborgium compounds SgCl 6 and SgOCl 4 are expected to be unstable to decomposition to seaborgium compounds at high temperatures, analogous to MoCl 6 and MoOCl 4 ; this should not happen for SgO 2 Cl 2 due to the much higher energy gap between the ": null
    },
    {
        "highest occupied": "Homo/Lumo"
    },
    {
        " and lowest unoccupied ": null
    },
    {
        "molecular orbital": "Molecular Orbital"
    },
    {
        "s, despite the similar Sg–Cl bond strengths .      Molybdenum and tungsten are very similar to each other and show important differences to the smaller chromium, and seaborgium is expected to follow the chemistry of tungsten and molybdenum quite closely, forming an even greater variety of oxoanions, the simplest among them being seaborgate, , which would form from the rapid hydrolysis of , although this would take place less readily than with molybdenum and tungsten as expected from seaborgiums greater size. Seaborgium should hydrolyse less readily than tungsten in ": null
    },
    {
        "hydrofluoric acid": "Hydrofluoric Acid"
    },
    {
        " at low concentrations, but more readily at high concentrations, also forming complexes such as SgO 3 F − and : complex formation competes with hydrolysis in hydrofluoric acid.       Experimental chemical investigation of seaborgium has been hampered due to the need to produce it one atom at a time, its short half-life, and the resulting necessary harshness of the experimental conditions.   The isotope 265 Sg and its isomer 265m Sg are advantageous for radiochemistry: they are produced in the 248 Cm reaction.      In the first experimental chemical studies of seaborgium in 1995 and 1996, seaborgium atoms were produced in the reaction 248 Cm 266 Sg, thermalised, and reacted with an O 2 /HCl mixture. The adsorption properties of the resulting oxychloride were measured and compared with those of molybdenum and tungsten compounds. The results indicated that seaborgium formed a volatile oxychloride akin to those of the other group 6 elements, and confirmed the decreasing trend of oxychloride volatility down group 6:     :Sg +  + 2 HCl →  +      In 2001, a team continued the study of the gas phase chemistry of seaborgium by reacting the element with O 2 in a H 2 O environment. In a manner similar to the formation of the oxychloride, the results of the experiment indicated the formation of seaborgium oxide hydroxide, a reaction well known among the lighter group 6 homologues as well as the pseudohomologue ": null
    },
    {
        "uranium": "Uranium"
    },
    {
        ".      :2 Sg + 3  → 2    : +  →      Predictions on the aqueous chemistry of seaborgium have largely been confirmed. In experiments conducted in 1997 and 1998, seaborgium was eluted from cation-exchange resin using a HNO 3 /HF solution, most likely as neutral SgO 2 F 2 or the anionic complex ion − rather than . In contrast, in 0.1 M ": null
    },
    {
        "nitric acid": "Nitric Acid"
    },
    {
        ", seaborgium does not elute, unlike molybdenum and tungsten, indicating that the hydrolysis of 6+ only proceeds as far as the cationic complex 2+ or + , while that of molybdenum and tungsten proceeds to neutral MO 2 2 CO": null
    }
]