[
    {
        "            Seinfeld is  an American ": null
    },
    {
        "sitcom": "Sitcom"
    },
    {
        " television series created by ": null
    },
    {
        "Larry David": "Larry David"
    },
    {
        " and ": null
    },
    {
        "Jerry Seinfeld": "Jerry Seinfeld"
    },
    {
        " for ": null
    },
    {
        "NBC": "Nbc"
    },
    {
        ". The show stars Seinfeld as ": null
    },
    {
        "a fictionalized version of himself": "Jerry Seinfeld"
    },
    {
        ", and mostly focuses on his personal life with a handful of friends and acquaintances, including best friend ": null
    },
    {
        "George Costanza": "George Costanza"
    },
    {
        " , friend and former girlfriend ": null
    },
    {
        "Elaine Benes": "Elaine Benes"
    },
    {
        " , and neighbor across the hall ": null
    },
    {
        "Cosmo Kramer": "Cosmo Kramer"
    },
    {
        " . Seinfeld is set predominantly in an apartment building in ": null
    },
    {
        "Manhattans": "Manhattan"
    },
    {
        " Upper West Side": "Upper West Side"
    },
    {
        " in New York City. It is often described as being a show about nothing , as many of its episodes are about the ": null
    },
    {
        "minutiae of daily life": "Slice Of Life"
    },
    {
        ".     Seinfeld was produced by West-Shapiro Productions and ": null
    },
    {
        "Castle Rock Entertainment": "Castle Rock Entertainment"
    },
    {
        " and ran from 1989 to 1998. In syndication, the series is distributed by ": null
    },
    {
        "Sony Pictures Television": "Sony Pictures Television"
    },
    {
        ". It was largely written by David and Seinfeld with script writers who included ": null
    },
    {
        "Larry Charles": "Larry Charles"
    },
    {
        ", ": null
    },
    {
        "Peter Mehlman": "Peter Mehlman"
    },
    {
        ", ": null
    },
    {
        "Gregg Kavet": "Gregg Kavet"
    },
    {
        ", ": null
    },
    {
        "Carol Leifer": "Carol Leifer"
    },
    {
        ", ": null
    },
    {
        "David Mandel": "David Mandel"
    },
    {
        ", ": null
    },
    {
        "Jeff Schaffer": "Jeff Schaffer"
    },
    {
        ", ": null
    },
    {
        "Steve Koren": "Steve Koren"
    },
    {
        ", ": null
    },
    {
        "Jennifer Crittenden": "Jennifer Crittenden"
    },
    {
        ", ": null
    },
    {
        "Tom Gammill": "Tom Gammill And Max Pross"
    },
    {
        ", ": null
    },
    {
        "Max Pross": "Tom Gammill And Max Pross"
    },
    {
        ", ": null
    },
    {
        "Dan OKeefe": "Dan Okeefe"
    },
    {
        ", ": null
    },
    {
        "Charlie Rubin": "Charlie Rubin"
    },
    {
        ", ": null
    },
    {
        "Marjorie Gross": "Marjorie Gross"
    },
    {
        ", ": null
    },
    {
        "Alec Berg": "Alec Berg"
    },
    {
        ", ": null
    },
    {
        "Elaine Pope": "Elaine Pope"
    },
    {
        ", and ": null
    },
    {
        "Spike Feresten": "Spike Feresten"
    },
    {
        ". A favorite among critics, the series led the ": null
    },
    {
        "Nielsen ratings": "Nielsen Ratings"
    },
    {
        " in seasons six and nine, and finished among the top two  every year from 1994 to 1998.     Seinfeld is widely regarded as one of the greatest and most influential sitcoms of all time. It has been ranked among the best television shows of all time in publications such as  Entertainment Weekly ,   Rolling Stone ,  and  TV Guide .   The shows most renowned episodes include ": null
    },
    {
        "The Chinese Restaurant": "The Chinese Restaurant"
    },
    {
        " , ": null
    },
    {
        "The Parking Garage": "The Parking Garage"
    },
    {
        " ,  and ": null
    },
    {
        "The Contest": "The Contest"
    },
    {
        " . TVs Top 100 Episodes of All Time and over 6.5 billion different people have watched an episode  TV Guide ; June 15, 2009; pp. 34–49. In 2013, the ": null
    },
    {
        "Writers Guild of America": "Writers Guild Of America"
    },
    {
        " voted it the No. 2 Best Written TV Series of All Time .  ": null
    },
    {
        "E!": "E!"
    },
    {
        " named the series the Number 1 reason the 90s ruled , , TV.com and quotes from numerous episodes have become catchphrases in popular culture.                ;Main    ": null
    },
    {
        "Jerry Seinfeld": "Jerry Seinfeld"
    },
    {
        "  – Jerry is a minor ": null
    },
    {
        "celeb": "Celebrity"
    },
    {
        " stand-up comedian": "Stand-Up Comedy"
    },
    {
        " who is often depicted as ": null
    },
    {
        "the voice of reason": "Everyman"
    },
    {
        " amidst the general insanity generated by the people in his world. The in-show character is a mild ": null
    },
    {
        "germaphobe": "Mysophobia"
    },
    {
        " and ": null
    },
    {
        "neat freak": "Obsessive–Compulsive Disorder"
    },
    {
        ", as well as an avid ": null
    },
    {
        "Superman": "Superman"
    },
    {
        ", ": null
    },
    {
        "New York Mets": "New York Mets"
    },
    {
        " and ": null
    },
    {
        "breakfast cereal": "Breakfast Cereal"
    },
    {
        " fan. Jerrys apartment is the center of a world visited by his eccentric friends and a focus of the show.    ": null
    },
    {
        "Elaine Benes": "Elaine Benes"
    },
    {
        "  – Elaine is Jerrys ex-girlfriend and later friend. She is attractive and genial, while also being humorous, arrogant and occasionally impulsive. She sometimes has a tendency to be too honest with people , which often gets her into trouble.  She usually gets caught up in her boyfriends quirks, eccentric employers unusual behaviors and idiosyncrasies, and the maladjustment of total strangers. She tends to make poor choices in men she chooses to date and is often overly reactive. First she works at Pendant Publishing with Mr. Lippman, is later hired as a personal assistant for Mr. Pitt, and later works for the J. Peterman catalogue as a glorified assistant. Elaine is popularly described as an amalgamation of Davids and Seinfelds girlfriends during their early days in New York as struggling comedians.   ": null
    },
    {
        "Cosmo Kramer": "Cosmo Kramer"
    },
    {
        "  – Kramer is Jerrys ": null
    },
    {
        "lovable rogue": "Lovable Rogue"
    },
    {
        " neighbor. His trademarks include his humorous upright ": null
    },
    {
        "pompadour hairstyle": "Pompadour Hairstyle"
    },
    {
        ", vintage clothes, and energetic sliding bursts through Jerrys apartment door. Kramer was heavily based on a neighbor of Davids during his amateur comedic years in Manhattan. At times, he appears ": null
    },
    {
        "naïve": "Naivety"
    },
    {
        ", gullible, and ignorant, and at other times, intelligent, understanding, and well-read; similarly, he is exaggeratedly successful, socially, with his charisma and laid-back personality. This is seen in his success with women and employers. He has been described as a hipster doofus . Although he never holds a steady job, he is rarely short of money and often invents wacky schemes that often work at first then eventually fail. Kramer is longtime friends with ": null
    },
    {
        "Newman": "Newman"
    },
    {
        ", and they work well together despite their differences.    ": null
    },
    {
        "George Costanza": "George Costanza"
    },
    {
        "  – George is Jerrys best friend, and has been since high school. He is miserly, dishonest, petty and envious of others achievements.  He is depicted as a loser who is perpetually insecure about his capabilities. He complains and lies easily about his profession, relationships and almost everything else, which usually creates trouble for him later. He often uses the alias Art Vandelay when lying or concocting a cover story. Despite these shortcomings, George has a sense of loyalty to his friends and success in dating women and eventually secures a successful career as Assistant to the Traveling Secretary for the ": null
    },
    {
        "New York Yankees": "New York Yankees"
    },
    {
        ".     ;Recurring      Many characters have made multiple appearances, like Jerrys nemesis ": null
    },
    {
        "Newman": "Newman"
    },
    {
        " and his ": null
    },
    {
        "Uncle Leo": "Uncle Leo"
    },
    {
        ". In addition to recurring characters, Seinfeld features numerous celebrities who appear as themselves or girlfriends, boyfriends, bosses and other acquaintances. Many actors who made guest appearances became household names later in their careers, or were already well known.       Many Seinfeld episodes are based on the writers real-life experiences, with the experiences reinterpreted for the characters storylines. For example, Georges storyline, ": null
    },
    {
        "The Revenge": "The Revenge"
    },
    {
        " , is based on Larry Davids experience at  Saturday Night Live .  ": null
    },
    {
        "The Contest": "The Contest"
    },
    {
        " is also based on Davids experiences. ": null
    },
    {
        "The Smelly Car": "The Smelly Car"
    },
    {
        " storyline is based on Peter Mehlmans lawyer friend, who could not get a bad smell out of his car. ": null
    },
    {
        "The Strike": "The Strike"
    },
    {
        " is based on Dan OKeefes dad, who made up his own holiday—": null
    },
    {
        "Festivus": "Festivus"
    },
    {
        ".  Other stories take on a variety of turns. ": null
    },
    {
        "The Chinese Restaurant": "The Chinese Restaurant"
    },
    {
        " consists of George, Jerry and Elaine waiting for a table throughout the entire episode.  ": null
    },
    {
        "The Boyfriend": "The Boyfriend"
    },
    {
        " , revolving around ": null
    },
    {
        "Keith Hernandez": "Keith Hernandez"
    },
    {
        ", extends through 2 episodes. ": null
    },
    {
        "The Betrayal": "The Betrayal"
    },
    {
        " is famous for using ": null
    },
    {
        "reverse chronology": "Reverse Chronology"
    },
    {
        ", and was inspired by a similar plot device in a ": null
    },
    {
        "Harold Pinter": "Harold Pinter"
    },
    {
        " play, ": null
    },
    {
        "Betrayal": "Betrayal"
    },
    {
        ".  Some stories were inspired by headlines and rumors, as explained in the DVD features Notes About Nothing , Inside Look , and Audio Commentary . In ": null
    },
    {
        "The Maestro": "The Maestro"
    },
    {
        " , Kramers lawsuit is roughly similar to the ": null
    },
    {
        "McDonalds coffee case": "Liebeck V. Mcdonalds Restaurants"
    },
    {
        ".  ": null
    },
    {
        "The Outing": "The Outing"
    },
    {
        " is based primarily on rumors that Larry Charles heard about Jerry Seinfelds sexuality.        The series was often described as a show about nothing .   However, Seinfeld in 2014 stated the pitch for the show, the real pitch, when Larry and I went to NBC in 1988, was we want to show how a comedian gets his material. The show about nothing was just a joke in an episode many years later, and Larry and I to this day are surprised that it caught on as a way that people describe the show, because to us its the opposite of that.  Much of the shows humor is based upon repeated use of irony, incongruity, and coincidence as plot devices for many of the individual episodes plots and humorous moments.     Seinfeld broke several conventions of ": null
    },
    {
        "mainstream": "Mainstream"
    },
    {
        " television. Larry David is credited with refusing to follow the predictable sitcom formula that would have a blossoming romantic relationship develop between Jerry and Elaine.  The show offers no growth or reconciliation to its characters. It eschews sentimentality.  An episode is typically driven by humor interspersed with the superficial conflicts of characters with peculiar dispositions. Many episodes revolve around the characters involvement in the lives of others with typically disastrous results. On the set, the notion that the characters should not develop or improve throughout the series was expressed as the no hugging, no learning rule. Also unlike most sitcoms, there are no moments of ": null
    },
    {
        "pathos": "Pathos"
    },
    {
        "; the audience is never made to feel sorry for any of the characters. Even ": null
    },
    {
        "Susans death": "The Invitations"
    },
    {
        " elicits no genuine emotions from anybody in the show.  Seinfeld does not shy away from making light of tough topics, from death to illness to handicaps.      The characters are thirty-something singles with vague identities, no roots, and conscious indifference to morals .  Usual conventions, like isolating the characters from the actors playing them and separating the characters world from that of the actors and audience, were broken. One such example is the ": null
    },
    {
        "story arc": "Story Arc"
    },
    {
        " where the characters promote a TV sitcom series named Jerry. The ": null
    },
    {
        "show within a show": "Show Within A Show"
    },
    {
        ", Jerry, was much like Seinfeld in that it was about nothing and Seinfeld played himself. The fictional Jerry was launched in the season four finale, but unlike Seinfeld, it wasnt picked up as a series. Jerry is one of many examples of ": null
    },
    {
        "metafiction": "Metafiction"
    },
    {
        " in the show. There are no fewer than twenty-two fictional movies featured, like Rochelle, Rochelle.  Because of these several elements, Seinfeld became the first TV series since  Monty Pythons Flying Circus  to be widely described as ": null
    },
    {
        "postmodern": "Postmodernism"
    },
    {
        ".      Jerry Seinfeld is an avid Abbott and Costello fan, and has cited the ": null
    },
    {
        "Abbott and Costello Show": "Abbott And Costello Show"
    },
    {
        " as an influence on Seinfeld. Everybody on the show knows Im a fan. Were always joking about how we do stuff from their show. George and I will often get into a riff that has the rhythm from the old Abbott and Costello shows. And sometimes Ill hit George in the chest the way Abbott would hit Costello. The series includes numerous references to the team. George Costanzas middle name is Louis, after Costello.  ": null
    },
    {
        "The Old Man": "The Old Man"
    },
    {
        " episode features a cantankerous character named Sid Fields as a tribute to the landlord on the teams TV show. Kramers friend is named Mickey Abbott. A copywriter for the J. Peterman catalog is named Eddie Sherman, after the teams longtime agent. In Episode 30, Kramer hears the famous Abbott and Costello line, His father was a mudder. His mother was a mudder.       Many terms were coined, popularized, or re-popularized in the series run and have become part of popular culture.   Notable catchphrases and terms include:     ": null
    },
    {
        "The Opposite": "The Opposite"
    },
    {
        "   Yada, yada, yada": "The Yada Yada"
    },
    {
        "   No soup for you!": "The Soup Nazi"
    },
    {
        "   These pretzels are making me thirsty": "The Alternate Side"
    },
    {
        "   Not that theres anything wrong with that!": "The Outing"
    },
    {
        "   You know, were living in a society!": "The Chinese Restaurant"
    },
    {
        "   Festivus": "Festivus"
    },
    {
        " Sponge-worthy": "The Sponge"
    },
    {
        " Are you master of your domain?": "The Contest"
    },
    {
        "   double-dipping": "Chips And Dipdouble-Dipping"
    },
    {
        " re-gifter": "Regift"
    },
    {
        " close-talker": "The Raincoats"
    },
    {
        " low-talker": "The Puffy Shirt"
    },
    {
        " man-hands": "The Bizarro Jerry"
    },
    {
        " Serenity Now!": "The Serenity Now"
    },
    {
        " shrinkage": "The Hamptons"
    },
    {
        " And you want to be my Latex Salesman?": "The Boyfriend"
    },
    {
        " Well, the Jerk Store called, and theyre running out of you!": "The Comeback"
    },
    {
        "     The lexicon of Seinfeldian code words and recurring phrases that evolved around particular episodes is referred to as ": null
    },
    {
        "Seinlanguage": "Seinlanguage"
    },
    {
        ", the title of Jerry Seinfelds best-selling book on humor.       A signature of Seinfeld is its theme music. Composed by ": null
    },
    {
        "Jonathan Wolff": "Jonathan Wolff"
    },
    {
        ", it consists of distinct solo ": null
    },
    {
        "sampled": "Sampling"
    },
    {
        " bass ": null
    },
    {
        "synthesizer": "Synthesizer"
    },
    {
        " riffs   which open the show and connect the scenes, often accompanied by ": null
    },
    {
        "beatboxing": "Beatboxing"
    },
    {
        ".  The bass synthesizer music eventually replaced the original piano/synth music by Jep Epstein when it was played again after the first broadcast of ": null
    },
    {
        "the pilot episode": "The Seinfeld Chronicles"
    },
    {
        ". The show lacked a traditional title track and the riffs were played over the first moments of dialogue or action. They vary throughout each episode and are played in an improvised funk style. An additional musical theme with an ensemble, led by a synthesized mid-range brass instrument, ends each episode.     In ": null
    },
    {
        "The Note": "The Note"
    },
    {
        " , the first episode of season three, the bumper music featured a ": null
    },
    {
        "scatting": "Scat Singing"
    },
    {
        " female jazz singer who sang a phrase that sounded like easy to beat . Jerry Seinfeld and executive producer Larry David both liked Wolffs additions, and three episodes were produced with this new style music. However, they had neglected to inform NBC and Castle Rock executives of the change, and when the season premiere aired, the executives were surprised and unimpressed, and requested that they return to the original style. The subsequent two episodes were redone, leaving this episode as the only one with additional music elements. Season 3 DVD: Inside Look of The Note In the commentary of The Note , Louis-Dreyfus facetiously suggests it was removed because the perceived lyric related closely to the low ratings at the time. Season 3 DVD: The Note commentary     In the final three seasons, the bits were tweaked slightly with more frantic rhythms; a bass guitar was added in addition to the sampled bass from earlier seasons. Throughout the show, the main theme could be restyled in different ways depending on the episode. For instance, in The Betrayal , part of which takes place in India, the theme is heard played on a ": null
    },
    {
        "sitar": "Sitar"
    },
    {
        ".               Seinfeld stood out from family and group ": null
    },
    {
        "sitcoms": "Situation Comedy"
    },
    {
        " of its time. The principal characters are not related by family or work connections but remain distinctively close friends throughout the series.        Many characters were based primarily on Seinfelds and Davids real-life acquaintances. Two prominent recurring characters were based on well-known people: ": null
    },
    {
        "Jacopo Peterman": "Jacopo Peterman"
    },
    {
        " of the ": null
    },
    {
        "J. Peterman": "The J. Peterman Company"
    },
    {
        " catalog ,  and ": null
    },
    {
        "George Steinbrenner": "George Steinbrenner"
    },
    {
        ", owner of the ": null
    },
    {
        "New York Yankees": "New York Yankees"
    },
    {
        ".  Many characters were introduced as new writers got involved with Seinfeld. Other characters based on real people include the ": null
    },
    {
        "Soup Nazi": "Soup Nazi"
    },
    {
        "  and ": null
    },
    {
        "Jackie Chiles": "Jackie Chiles"
    },
    {
        ", who was based on ": null
    },
    {
        "Johnnie Cochran": "Johnnie Cochran"
    },
    {
        ".      Seinfeld follows its own structure: story thread is presented at the beginning of every episode, which involves the characters starting in their own situations. Rapid scene-shifts between plot lines bring the stories together. Even though it does not follow a pattern as other sitcoms, the characters stories variously intertwine in each episode. Despite the separate plot strands, the narratives reveal the creators consistent efforts to maintain the intimacy among the small cast of characters. Gantz, Katherine.  Not That Theres Anything Wrong with That : Reading the Queer in Seinfeld. In Calvin Thomas . Straight with a Twist: Queer Theory and the Subject of Heterosexuality. Champaign. Illinois: University of Illinois Press.      The show maintains a strong sense of ": null
    },
    {
        "continuity": "Continuity"
    },
    {
        "—characters and plots from past episodes are often referenced or expanded on. Occasionally, story arcs span multiple episodes and even entire seasons, the most memorable being ": null
    },
    {
        "season four": "Seinfeld"
    },
    {
        ", which revolved around the ": null
    },
    {
        "pilot": "Television Pilot"
    },
    {
        " pitch to NBC by Jerry and George. Another example is Jerrys girlfriend Vanessa, who appears in ": null
    },
    {
        "The Stake Out": "The Stake Out"
    },
    {
        " and he ends the relationship when things do not work out in ": null
    },
    {
        "The Stock Tip": "The Stock Tip"
    },
    {
        " . Other examples are Kramer getting his jacket back and Elaine heading the Peterman catalog . ": null
    },
    {
        "Larry David": "Larry David"
    },
    {
        ", the head writer and executive producer for the first seven seasons, was praised for keeping a close eye on minor details and making sure the main characters lives remained consistent and believable.  Curb Your Enthusiasm —Davids later comedy series—expanded on this idea by following a specific theme for all but one season in the series.     A major difference between Seinfeld and sitcoms which preceded it is that the principal characters never learn from their mistakes. In effect, they are indifferent and even callous towards the outside world and sometimes one another. A ": null
    },
    {
        "mantra": "Mantra"
    },
    {
        " of the shows producers was: No hugging, no learning .   Entertainment Weekly s TV critic Ken Tucker has described them as a group dynamic rooted in jealousy, rage, insecurity, despair, hopelessness, and a touching lack of faith in ones fellow human beings . Tucker, Ken. The Fantastic 4 in Entertainment WeeklyEntertainment Weekly. May 4, 1998, p. 13. This leads to very few happy endings, except at somebody elses expense. More often in every episode, situations resolve with characters getting a justly deserved comeuppance .       thu   The show premiered as ": null
    },
    {
        "The Seinfeld Chronicles": "The Seinfeld Chronicles"
    },
    {
        " on July 5, 1989. After it aired, a pickup by NBC seemed unlikely and the show was offered to Fox , which declined to pick it up. Rick Ludwin , head of late night and special events for NBC, however, diverted money from his budget by canceling a Bob Hope television special , and the next 4 episodes were filmed. These episodes were highly rated as they followed summer re-runs of ": null
    },
    {
        "Cheers": "Cheers"
    },
    {
        " on Thursdays at 9:30  p.m., and the series was finally picked up. At one point NBC considered airing these episodes on Saturdays at 10:30  p.m., but gave that slot to a short-lived sitcom called FM. The series was renamed simply Seinfeld after the failure of short-lived 1990 ABC series The Marshall Chronicles. After airing the remaining four episodes of its first season the summer of 1990, NBC ordered thirteen more episodes. Larry David believed that he and Jerry Seinfeld had no more stories to tell, and advised Seinfeld to turn down the order, but Seinfeld agreed to the additional episodes. Season two was bumped off its scheduled premiere of January 16, 1991, due to the outbreak of the Gulf War . It settled into a regular time slot on Wednesdays at 9:30  p.m. and eventually flipped with veteran series ": null
    },
    {
        "Night Court": "Night Court"
    },
    {
        " to 9:00.     TV critics championed Seinfeld in its early seasons, even as it was slow to cultivate a substantial audience. For the first three seasons, Jerrys stand-up comedy act would bookend an episode, even functioning as cut scene s during the show. A few episodes set a benchmark for later seasons. The Deal establishes Jerry and Elaines relationship by setting rules about sleeping together and remaining friends. The Parking Garage was the first episode shot with no audience for the episode and, after The Chinese Restaurant , with not showing Jerrys apartment. The Keys contains a crossover to CBS show ": null
    },
    {
        "Murphy Brown": "Murphy Brown"
    },
    {
        ", marking the first such cooperation between rival networks. The Busboy introduces George, Kramer and Elaine as having their own storylines for the first time. Although Castle Rock Entertainments Glenn Padnick thought Jerry Seinfeld was too generous, showcasing his co-stars comedic talent became a trademark throughout the series.     Larry Charles wrote an episode for season two, The Bet , in which Elaine buys a gun from Kramers friend. This episode wasnt filmed because the content was deemed unacceptable, and was replaced by the episode The Phone Message . The Stranded , aired in season three, was intended for season two. In the beginning of this episode, Jerry clears up the continuity error over Georges real estate job.       Season four marked the sitcoms entry into the Nielsen ratings Top 30, coinciding with several popular episodes, such as The Bubble Boy in which George and the bubble boy argue over ": null
    },
    {
        "Trivial Pursuit": "Trivial Pursuit"
    },
    {
        ", and The Junior Mint in which Jerry and Kramer accidentally fumble a mint in the operating room. This was the first season to use a story arc of Jerry and George creating their own sitcom, Jerry. Also at this time, the use of Jerrys stand-up act slowly declined, and the stand-up segment in the middle of Seinfeld episodes was cut.     Much publicity followed the controversial episode, The Contest , an Emmy Award -winning episode written by co-creator Larry David, whose subject matter was considered inappropriate for prime time network TV. To circumvent this taboo, the word masturbation was never used in the script, instead substituted for by a variety of oblique references. Midway through that season, Seinfeld was moved from its original 9:00  p.m. time slot on Wednesdays to 9:30  p.m. on Thursdays, following ": null
    },
    {
        "Cheers": "Cheers"
    },
    {
        " again, which gave the show even more popularity. Ratings also sparked the move, as Tim Allens sitcom ": null
    },
    {
        "Home Improvement": "Home Improvement"
    },
    {
        " on ABC had aired at the same time and Improvement kept beating Seinfeld in the ratings. NBC moved the series after Ted Danson announced the end of Cheers and Seinfeld quickly surpassed the ratings of the 9:00  p.m. Cheers reruns that spring. The show won an Emmy Award for Outstanding Comedy Series in 1993, beating out its family-oriented, time-slot competitor ": null
    },
    {
        "Home Improvement": "Home Improvement"
    },
    {
        ", which was only in its second season on rival network ABC.     Season five was an even bigger ratings-hit, consisting of popular episodes, such as The Puffy Shirt in which Jerry feels embarrassed wearing a pirate shirt on ": null
    },
    {
        "The Today Show": "The Today Show"
    },
    {
        ", The Non-Fat Yogurt featuring Rudy Giuliani , the Republican then-mayor-elect of New York, and The Opposite in which George, doing the opposite of what his instincts tell him he should do, lands a job with the New York Yankees and Elaine leaves Pendant Publishing because of a comedy of errors that lead to its demise. Another story arc has George returning to live with his parents. In the midst of the story arc, Kramer creates and promotes his coffee table book . The show was again nominated for Outstanding Comedy Series, but lost to the Cheers spin-off ": null
    },
    {
        "Frasier": "Frasier"
    },
    {
        ", then in its first season. Seinfeld was nominated for the same award every year for its entire run but, after its win at the 45th Primetime Emmy Awards in 1994, always lost to Frasier, which went on to win a record thirty-nine Emmy Awards in its eleven-season run.       In season six, Andy Ackerman replaced Tom Cherones as director of the show. The series remained well-regarded and produced some of its most famous episodes, such as The Beard in which Jerry is put through a lie detector test to make him admit that he watched ": null
    },
    {
        "Melrose Place": "Melrose Place"
    },
    {
        ", The Switch in which Kramers mom, Babs, reveals that his first name is Cosmo, and The Understudy in which Elaine meets J. Peterman for the first time. Story arcs used in this season were Elaine working as a personal assistant to her eccentric boss Justin Pitt and Georges parents temporary separation. This was the first season in which Seinfeld reached No. 1 in the Nielsen Ratings. The use of Jerrys stand-up act declined with the end stand-up segment no longer appearing, as the storylines for all four characters grew denser.     In season seven, a story arc involved George getting engaged to his ex-girlfriend, Susan Ross, after the pilot Jerry proved unsuccessful. In it, George spends most of the season regretting and trying to get out of the engagement. Along with the regular half-hour episodes, two notable one-hour episodes were The Cadillac in which George plans to date award-winning actor Marisa Tomei and The Bottle Deposit with Elaine and Sue Ellen participating in a bidding war to buy JFKs golf clubs in an auction.       The shows ratings were still going strong in its final two seasons. Larry David left at the end of season seven, although he continued to voice Steinbrenner, so Seinfeld assumed Davids duties as showrunner , and, under the direction of a new writing staff, Seinfeld became a faster-paced show. The show no longer contained extracts of Jerry performing stand-up comedy—Jerry had no time or energy for this with his new responsibilities—and storylines occasionally delved into fantasy and broad humor. For example, in The Bizarro Jerry , Elaine is torn between exact opposites of her friends and Jerry dates a woman who has the now-famed man hands . Some notable episodes from season eight include The Little Kicks showing Elaines horrible dancing, and The Chicken Roaster which portrays the ": null
    },
    {
        "Kenny Rogers Roasters": "Kenny Rogers Roasters"
    },
    {
        " chicken restaurant which opened during that time. A story arc in this season involves Peterman going to Burma in The Foundation until he recovered from a nervous breakdown in The Money , followed by Elaine writing Petermans biography in The Van Buren Boys , which leads to Kramers parody of Kenny Kramers Reality Tour seen in The Muffin Tops .     The final season included episodes like The Merv Griffin Show in which Kramer converts his apartment into a talk-show studio and plays the character of talk-show host, The Betrayal that presents in reverse chronological order what happened to Sue Ellens wedding in India, and The Frogger in which George pushes a ": null
    },
    {
        "Frogger": "Frogger"
    },
    {
        " machine across the street, mimicking the action of the game itself. The last season included a story arc in which Elaine has an on/off relationship with Puddy . Despite the enormous popularity and willingness of the cast to return for a tenth season, Seinfeld decided to end the show after season nine, believing he would thereby be able to ensure the show would maintain its quality and go out on top. NBC offered him over $100 million for a tenth season, but Seinfeld declined.     A major controversy caused in this final season was the accidental burning of a Puerto Rican flag by Kramer in The Puerto Rican Day . This scene caused a furor among Puerto Ricans, and as a result, NBC showed this episode only once. Jerry Seinfeld defused the protestors by not letting this episode continue in syndication, as revealed in Inside Look on DVD. However, the episode would be added to the syndicated rerun package several years later uncut.         After nine years on the air, NBC and Jerry Seinfeld announced on December 25, 1997, that the series would end production the following spring in 1998. The announcement made the front page of the major New York newspapers, including the ": null
    },
    {
        "New York Times": "The New York Times"
    },
    {
        ". Jerry Seinfeld was featured on the cover of ": null
    },
    {
        "Time": "Time"
    },
    {
        " magazines first issue of 1998. The series ended with a seventy-five-minute episode written by co-creator and ex-executive producer Larry David, which aired on May 14, 1998. Before the finale, a forty-five-minute retrospective clip show, The Chronicle , was aired. The retrospective was expanded to an hour after the original airing and aired again on NBC as an hour-long episode, and has since aired in syndication.     It was the first episode since the finale of season seven, The Invitations , to feature opening and closing stand-up comedy acts by Jerry Seinfeld. The finale was filmed before an audience of NBC executives and friends of the show. The press and public were shut out of the taping in order to keep its plot secret; those who attended the shoot of the final episode were required to sign written vows of silence . The secrecy only seemed to increase speculation about how the series would end. The producers of the show tweaked the media about the hype, spreading a false rumor about Newman ending up in the hospital and Jerry and Elaine sitting in a chapel, presumably to marry.     The final episode enjoyed a historic audience, estimated at 76.3 million viewers making it the fourth most watched regular series finale in U.S. TV history, behind ": null
    },
    {
        "MASH": "Mash"
    },
    {
        ", ": null
    },
    {
        "Cheers": "Cheers"
    },
    {
        " and ": null
    },
    {
        "The Fugitive": "The Fugitive"
    },
    {
        ". However, the finale received mixed reviews from critics and fans of the show. The finale poked fun at the many rumors that were circulating, seeming to move into multiple supposed plots before settling on its true storyline—a lengthy trial where the gang is prosecuted for violating a Duty to Rescue law and sentenced to prison terms.     According to ": null
    },
    {
        "Forbes": "Forbes"
    },
    {
        " magazine, Jerry Seinfelds earnings from the show in 1998 came to US$267 million, including syndication earnings. He refused NBCs offer of $5 million per episode, or over $100 million total, to continue the show into a tenth season. The offer NBC made to Seinfeld was over three times higher per episode than anyone on TV had ever been offered before. Seinfeld told the network that he was not married nor had children, and wished to focus on his personal life. As reported in July 2007, he was the second-highest earner in the TV industry, earning at the time $60 million a year. The show became the first TV series to command over $1 million a minute for advertising–a mark previously attained only by the Super Bowl .       According to Barry Meyer , chairman of Warner Bros. Entertainment , Seinfeld made $2.7 billion through June 2010. the show has made an estimated $4.06 billion in syndication. Steve Bannon , who invested in the show, later said, We calculated what it would get us if it made it to syndication. We were wrong by a factor of five . In September 2019, it was announced Viacom had acquired cable syndication rights to the series, with it airing on Paramount Network , Comedy Central and TV Land beginning in October 2021.       Seinfeld began as a twenty-three-minute pilot titled ": null
    },
    {
        "The Seinfeld Chronicles": "The Seinfeld Chronicles"
    },
    {
        ". Created by Jerry Seinfeld and Larry David , developed by NBC executive Rick Ludwin, and produced by Castle Rock Entertainment , it was a mix of Seinfelds stand-up comedy routines and idiosyncratic, conversational scenes focusing on mundane aspects of everyday life like laundry, the buttoning of the top button on ones shirt and the effort by men to properly interpret the intent of women spending the night in Seinfelds apartment. Battaglio, Stephen . Annoying Disorienting Boring: On Seinfelds 25th anniversary an exclusive look at the memo that almost killed the show . ": null
    },
    {
        "TV Guide": "Tv Guide"
    },
    {
        ". pp. 18–19.     The pilot was filmed at Stage 8 of Desilu Cahuenga studios, the same studio where ": null
    },
    {
        "The Dick Van Dyke Show": "The Dick Van Dyke Show"
    },
    {
        " was filmed , and was recorded at Ren-Mar Studios in Hollywood . The pilot was first screened to a group of two dozen NBC executives in Burbank, California in early 1989. It didnt yield the explosion of laughter garnered by the pilots for the decades previous NBC successes like ": null
    },
    {
        "The Cosby Show": "The Cosby Show"
    },
    {
        " and ": null
    },
    {
        "The Golden Girls": "The Golden Girls"
    },
    {
        ". Brandon Tartikoff was not convinced that the show would work. A Jewish man from New York himself, Tartikoff characterized it as Too New York, too Jewish . Test audiences were even harsher. NBCs practice at the time was to recruit 400 households by phone to ask them to evaluate pilots it aired on an unused channel on its cable system. An NBC research department memo summarized the pilots performance among the respondents as weak , which Warren Littlefield , then second-in-command in NBCs entertainment division, called a dagger to the heart . Comments included, You cant get too excited about two guys going to the laundromat ; Jerrys loser friend George isnt a forceful character ; Jerry needs a stronger supporting cast ; and Why are they interrupting the stand-up for these stupid stories? Seinfeld and David didnt see the memo for several years, but after they became aware of it, they hung it in a bathroom on the set. Seinfeld comments, We thought, if someone goes in to use this bathroom, this is something they should see. It fits that moment.     Around the time the shows pilot was filmed, Castle Rock Entertainment, which produced the show, had also produced another pilot for NBC that featured Ann Jillian in her almost-similarly eponymous TV series . After The Seinfeld Chronicles tested poorly among audiences, Castle Rock then devoted their focus to Jillians series, which tested better with audiences and received a full-season order. Ann Jillian would last only a single season of 13 episodes and would be off the air by the end of 1990.     When NBC announced its 1989–90 primetime schedule in May 1989, The Seinfeld Chronicles was not included, but supporters of the show didnt give up on it. The pilot first aired on July 5, 1989, and finished second in its time slot against the CBS police drama ": null
    },
    {
        "Jake and the Fatman": "Jake And The Fatman"
    },
    {
        ", receiving a Nielsen rating of 10.9/19. The ratings didnt exhibit regional skew that Tartikoff predicted, much to the encouragement of the shows supporters. Despite the poor test results, Ludwin cancelled one of the Bob Hope specials budgeted for that season so that the entertainment division had the money to order four more episodes of The Seinfeld Chronicles, which formed the rest of the shows first season ; a move without which ": null
    },
    {
        "Chicago Tribune": "Chicago Tribune"
    },
    {
        " columnist Phil Rosenthal later stated there would be no Seinfeld. Although this was a very low order number for a new series , Castle Rock failed to find any other buyers when it shopped the show to other networks, and accepted the order. The show was renamed simply Seinfeld, but it wouldnt return to the airwaves until May 30, 1990, and it would be another three years before it became a Top 5-rated show. Preston Beckman, who was in charge of NBCs research department at the time, reminisced, The show was different. Nobody had seen anything like it. It wasnt unusual for poor-testing shows to get on the air, but it was very rare that they became hits.     When it was first repeated on July 5, 1990, it received a rating of 13.9/26. These ratings were high enough to secure a second season. NBC research showed that the show was popular with young male adults, a demographic sought after by advertisers. This gave NBC an incentive to keep broadcasting the show. One DVD reviewer, Britt Gillette, wrote that this initial episode exhibits the flashes of brilliance that made Seinfeld a cultural phenomenon.       There are two high-definition versions of Seinfeld. The first is that of the network TV versions in the original aspect ratio of 4:3 that were downscaled for the DVD releases. Syndicated broadcast stations and the cable network TBS began airing the syndicated version of Seinfeld in HD. Unlike the version used for the DVD, Sony Pictures cropped the top and bottom parts of the frame, while restoring previously cropped images on the sides, from the 35mm film source, to use the entire 16:9 frame.       Elizabeth Magnotta and Alexandra Strohl analyze the success of Seinfeld with recourse to the incongruity theory of humor: The Incongruity Theory claims that humor is created out of a violation of an expectation. For humor to result from this unexpected result, the event must have an appropriate emotional climate, the setting, characters, prior discourse, relationships of the characters, and the topic. Specifically, Magnotta and Strohl focus on The Marine Biologist , where George is embroiled in yet another lie, and on The Red Dot , where George tries to save a few dollars at Elaines expense by giving her a marked-down cashmere sweater.     Seinfeld has not reached the same level of popularity around the globe as it has reached in America. In “Translating Seinfeld”, Jennifer Armstrong notes that Seinfeld’s unique style of humor is apparently “too cultural and word-based to make for easy translation”. Carol Iannone sums up the legacy of this American hit in her Modern Age article “SeinfeldSeinfeld and Philosophy: A Book about Everything and Nothing. Some entries include The Jerry Problem and the Socratic Problem , Georges Failed Zest for Happiness : An Aristotelian Analysis , Elaines Moral Character , Kramer the Seducer, Making Something Out of Nothing: Seinfeld, Sophistry and the Tao , Seinfeld, Subjectivity , and Sartre , Mr. Peterman, the Wicked Witch of the West , and Me , and Minimally Decent Samaritans and Uncommon Law .         |-   |+ TV viewership in the United States   |-   ! rowspan 2 colspan 2 |Season   ! rowspan 2 |TV season   ! rowspan 2 |Episodes   ! rowspan 2 |Timeslot   ! colspan 2 |Original air dates   ! colspan 3 | Nielsen ratings   ! colspan 2 | Most watched episode   |-   ! Season premiere   ! Season finale   ! Rank   ! Rating   ! Viewers   ! Title   ! Viewers   |-   | style background:339be9 | || 1 || 1989–90 || 5 || Wednesday at 9:30 pm Thursday at 9:30 pm || July 5, 1989 || June 21, 1990 || rowspan || rowspan || 19.26 || The Stake Out   || 22.5   |-   | style background:f7d712; | || 2 || 1990–91 || 12 || Wednesday at 9:30 pm Thursday at 9:30 pm || January 23, 1991 || June 26, 1991 || 46 || 12.5 || 18.07 || The Apartment   || 24.7   |-   | style background:244d8d | || 3 || 1991–92 || 23 || Wednesday at 9:30 pm Wednesday at 9:00 pm || September 18, 1991 || May 6, 1992 || 42 || 12.5 || 17.66 || The Letter   || 22.3   |-   | style background:49a9a3 | || 4 || 1992–93 || 24 || Wednesday at 9:00 pm Wednesday at 9:30 pm Thursday at 9:30 pm Thursday at 8:00 pm Thursday at 8:30 pm || August 12, 1992 || May 20, 1993 || 25 || 13.7 || 20.91 || The Pilot   || 32.8   |-   | style background:4c5385 | || 5 || 1993–94 || 22 || Thursday at 9:00 pm Thursday at 9:30 pm || September 16, 1993 || May 19, 1994 || 3 || 19.6 || 29.59 || The Stall and The Marine Biologist   || 35.0   |-   | style background:6d9cb3 | || 6 || 1994–95 || 24 || Thursday at 9:00 pm Thursday at 9:30 pm || September 22, 1994 || May 18, 1995 || 1 || 20.6 || 30.06 || The Switch   || 36.6   |-   | style background:5f5758 | || 7 || 1995–96 || 24 || Thursday at 9:00 pm Thursday at 9:30 pm || September 21, 1995 || May 16, 1996 || 2 || 21.2 || 33.19 || The Engagement   || 37.6   |-   | style background:b5b7bc; | || 8 || 1996–97 || 22 || Thursday at 9:00 pm || September 19, 1996 || May 15, 1997 || 2 || 20.5 || 32.48 || The Money   || 37.3   |-   | style background:68471a | || 9 || 1997–98 || 24 || Thursday at 9:00 pm Thursday at 8:00 pm Thursday at 8:30 pm Thursday at 9:30 pm || September 25, 1997 || May 14, 1998 || 1 || 22.0 || 38.03 Excluding The Finale and The Clip Show || The Finale   || 76.3   |ComedyComedye.g., Junior Mints , Twix , Chuckles , Jujyfruits , bite size Three Musketeers , Snickers , Nestlé Chunky , Oh Henry! , Drakes Coffee Cake and PEZ e.g. Oh Henry! barse.g., Chuckles , Clark Bar , Twinkies voiced by Patrick Warburton , who played the role of Puddya portmanteau of Hennessy and Brannigans a parody of Beef-a-roni  ": null
    },
    {
        "gazi": "Gazi"
    },
    {
        "gazi": "Gazi"
    },
    {
        "companycompany": null
    },
    {
        " seri": "Seri"
    }
]