[
    {
        "        Sergei Mikhailovich Eisenstein  was a ": null
    },
    {
        "Soviet": "Soviet Union"
    },
    {
        " film director": "Film Director"
    },
    {
        " and ": null
    },
    {
        "film theorist": "Film Theory"
    },
    {
        ", a pioneer in the theory and practice of ": null
    },
    {
        "montage": "Montage"
    },
    {
        ". He is noted in particular for his ": null
    },
    {
        "silent films": "Silent Film"
    },
    {
        "  Strike  ,  Battleship Potemkin  and  October  , as well as the ": null
    },
    {
        "historical": "Historical Movie"
    },
    {
        " epics": "Epic Film"
    },
    {
        "  Alexander Nevsky  and  Ivan the Terrible  . In its decennial poll, the magazine  Sight & Sound  named his Battleship Potemkin the 11th greatest movie of all time.           Eisenstein  was born to a middle-class family in ": null
    },
    {
        "Riga": "Riga"
    },
    {
        ", Latvia , but his family moved frequently in his early years, as Eisenstein continued to do throughout his life. His father, the famous architect ": null
    },
    {
        "Mikhail Osipovich Eisenstein": "Mikhail Eisenstein"
    },
    {
        ", was born in ": null
    },
    {
        "Kiev Oblast": "Kiev Oblast"
    },
    {
        ", to a ": null
    },
    {
        "Jewish": "Jews"
    },
    {
        " merchant father, Osip, and his ": null
    },
    {
        "Swedish": "Sweden"
    },
    {
        " wife.  : «Киноведческие записки» 102/103, 2013; стр. 314—323. The family had converted to the Russian Orthodox Church. His mother, Julia Ivanovna Konetskaya, was from a ": null
    },
    {
        "Russian": "Russians"
    },
    {
        " Orthodox": "Orthodox Christian"
    },
    {
        " family.   She was the daughter of a prosperous merchant.  Julia left Riga the same year as the ": null
    },
    {
        "Russian Revolution of 1905": "Russian Revolution"
    },
    {
        ", taking Sergei with her to St. Petersburg.  Her son would return at times to see his father, who joined them around 1910.  Divorce followed and Julia left the family to live in France.  Eisenstein was raised as an Orthodox Christian, but became an atheist later on.       At the ": null
    },
    {
        "Petrograd": "Petrograd"
    },
    {
        " Institute of Civil Engineering, Eisenstein studied architecture and engineering, the profession of his father.  In 1918, he left school and joined the ": null
    },
    {
        "Red Army": "Red Army"
    },
    {
        " to serve the ": null
    },
    {
        "Bolshevik Revolution": "Russian Revolution"
    },
    {
        ", although his father Mikhail supported the opposite side.  This brought his father to Germany after the defeat of the Tsarist government, and Sergei to Petrograd, ": null
    },
    {
        "Vologda": "Vologda"
    },
    {
        ", and ": null
    },
    {
        "Dvinsk": "Dvinsk"
    },
    {
        ".  In 1920, Sergei was transferred to a command position in ": null
    },
    {
        "Minsk": "Minsk"
    },
    {
        ", after success providing ": null
    },
    {
        "propaganda": "Propaganda"
    },
    {
        " for the ": null
    },
    {
        "October Revolution": "October Revolution"
    },
    {
        ". At this time, he was exposed to ": null
    },
    {
        "Kabuki": "Kabuki"
    },
    {
        " theatre and studied ": null
    },
    {
        "Japanese": "Japanese Language"
    },
    {
        ", learning some 300 ": null
    },
    {
        "kanji": "Kanji"
    },
    {
        " characters, which he cited as an influence on his pictorial development.    These studies would lead him to travel to ": null
    },
    {
        "Japan": "Japan"
    },
    {
        ".            Eisenstein moved to Moscow in 1920, and began his career in theatre working for ": null
    },
    {
        "Proletkult": "Proletkult"
    },
    {
        ".  His productions there were entitled Gas Masks, Listen Moscow, and  Wiseman .  He worked as a designer for ": null
    },
    {
        "Vsevolod Meyerhold": "Vsevolod Meyerhold"
    },
    {
        ".  Eisenstein began his career as a theorist in 1923,  by writing The Montage of Attractions for art journal  LEF .  His first film,  Glumovs Diary  , was also made in that same year with ": null
    },
    {
        "Dziga Vertov": "Dziga Vertov"
    },
    {
        " hired initially as an instructor         Strike  was Eisensteins first full-length feature film.  Battleship Potemkin  was critically acclaimed worldwide. Mostly owing to this international renown, he was then able to direct  October   as part of a grand tenth anniversary celebration of the ": null
    },
    {
        "October Revolution": "October Revolution"
    },
    {
        " of 1917, and then  The General Line  . While critics outside Soviet Russia praised these works, Eisensteins focus in the films on structural issues such as camera angles, crowd movements, and ": null
    },
    {
        "montage": "Montage"
    },
    {
        " brought him and like-minded others such as ": null
    },
    {
        "Vsevolod Pudovkin": "Vsevolod Pudovkin"
    },
    {
        " and ": null
    },
    {
        "Alexander Dovzhenko": "Alexander Dovzhenko"
    },
    {
        " under fire from the Soviet film community. This forced him to issue public articles of self-criticism and commitments to reform his cinematic visions to conform to the increasingly specific doctrines of ": null
    },
    {
        "socialist realism": "Socialist Realism"
    },
    {
        ".       In the autumn of 1928, with October still under fire in many Soviet quarters, Eisenstein left the Soviet Union for a tour of Europe, accompanied by his perennial film collaborator ": null
    },
    {
        "Grigori Aleksandrov": "Grigori Aleksandrov"
    },
    {
        " and cinematographer ": null
    },
    {
        "Eduard Tisse": "Eduard Tisse"
    },
    {
        ". Officially, the trip was supposed to allow the three to learn about sound motion pictures and to present themselves as Soviet artists in person to the capitalist West. For Eisenstein, however, it was also an opportunity to see landscapes and cultures outside the Soviet Union. He spent the next two years touring and lecturing in Berlin, Zürich, London, and Paris.  In 1929, in Switzerland, Eisenstein supervised an educational documentary about abortion directed by Tisse, entitled Frauennot – Frauenglück.        In late April 1930, ": null
    },
    {
        "Jesse L. Lasky": "Jesse L. Lasky"
    },
    {
        ", on behalf of ": null
    },
    {
        "Paramount Pictures": "Paramount Pictures"
    },
    {
        ", offered Eisenstein the opportunity to make a film in the United States.  He accepted a short-term contract for $100,000 and arrived in Hollywood in May 1930, along with Aleksandrov and Tisse.     Eisenstein proposed a biography of munitions tycoon ": null
    },
    {
        "Basil Zaharoff": "Basil Zaharoff"
    },
    {
        " and a film version of  Arms and the Man  by ": null
    },
    {
        "George Bernard Shaw": "George Bernard Shaw"
    },
    {
        ", and more fully developed plans for a film of  Sutters Gold  by ": null
    },
    {
        "Blaise Cendrars": "Blaise Cendrars"
    },
    {
        ",  but on all accounts failed to impress the studios producers.  Paramount proposed a film version of ": null
    },
    {
        "Theodore Dreisers": "Theodore Dreiser"
    },
    {
        "  An American Tragedy .  This excited Eisenstein, who had read and liked the work, and had met Dreiser at one time in Moscow. Eisenstein completed a script by the start of October 1930,  but Paramount disliked it completely and, additionally, found themselves intimidated by Major ": null
    },
    {
        "Frank Pease": "Frank Pease"
    },
    {
        ",  president of the Hollywood Technical Directors Institute. Pease, an anti-communist, mounted a public campaign against Eisenstein. On October 23, 1930, by mutual consent , Paramount and Eisenstein declared their contract null and void, and the Eisenstein party were treated to return tickets to Moscow at Paramounts expense.      Eisenstein was thus faced with returning home a failure. The Soviet film industry was solving the sound-film issue without him; in addition, his films, techniques and theories, such as his ": null
    },
    {
        "formalist film theory": "Formalist Film Theory"
    },
    {
        ", were becoming increasingly attacked as ideological failures. Many of his theoretical articles from this period, such as  Eisenstein on Disney , have surfaced decades later as seminal scholarly texts used as curriculum in film schools around the world.     Eisenstein and his entourage spent considerable time with ": null
    },
    {
        "Charlie Chaplin": "Charlie Chaplin"
    },
    {
        ",  who recommended that Eisenstein meet with a sympathetic benefactor in the person of American socialist author ": null
    },
    {
        "Upton Sinclair": "Upton Sinclair"
    },
    {
        ".  Sinclairs works had been accepted by and were widely read in the USSR, and were known to Eisenstein. The two admired each other, and between the end of October 1930 and Thanksgiving of that year, Sinclair had secured an extension of Eisensteins absences from the USSR, and permission for him to travel to Mexico. The trip to Mexico was for Eisenstein to make a film produced by Sinclair and his wife ": null
    },
    {
        "Mary": "Mary Craig Sinclair"
    },
    {
        ", and three other investors organized as the Mexican Film Trust .              On 24 November 1930, Eisenstein signed a contract with the Trust upon the basis of his desire to be free to direct the making of a picture according to his own ideas of what a Mexican picture should be, and in full faith in Eisensteins artistic integrity.  The contract also stipulated that the film would be non-political , that immediately available funding came from Mary Sinclair in an amount of not less than Twenty-Five Thousand Dollars ,  that the shooting schedule amounted to a period of from three to four months , and most importantly that: Eisenstein furthermore agrees that all pictures made or directed by him in Mexico, all negative film and positive prints, and all story and ideas embodied in said Mexican picture, will be the property of Mrs. Sinclair... A codicil to the contract allowed that the Soviet Government may have the film free for showing inside the U.S.S.R.  Reportedly, it was verbally clarified that the expectation was for a finished film of about an hours duration.     By 4 December, Eisenstein was en route to Mexico by train, accompanied by Aleksandrov and Tisse. Later he produced a brief synopsis of the six-part film; this would come, in one form or another, to be the final plan he would settle on for his project. The title for the project, ¡Que viva México!, was decided on some time later still. Whilst in Mexico, he mixed socially with ": null
    },
    {
        "Frida Kahlo": "Frida Kahlo"
    },
    {
        " and ": null
    },
    {
        "Diego Rivera": "Diego Rivera"
    },
    {
        "; Eisenstein admired these artists and Mexican culture in general, and they inspired him to call his films moving frescoes .  The left-wing U.S. film community eagerly followed his progress within Mexico, as is chronicled within Chris Robes book Left of Hollywood: Cinema, Modernism, and the Emergence of U.S. Radical Film Culture. Left of Hollywood: Cinema, Modernism, and the Emergence of U.S. Radical Film Culture     After a prolonged absence, ": null
    },
    {
        "Joseph Stalin": "Joseph Stalin"
    },
    {
        " sent a telegram expressing the concern that Eisenstein had become a deserter.  Under pressure, Eisenstein blamed Mary Sinclairs younger brother, Hunter Kimbrough, who had been sent along to act as a line producer, for the films problems.  Eisenstein hoped to pressure the Sinclairs to insinuate themselves between him and Stalin, so Eisenstein could finish the film in his own way. The furious Sinclairs shut down production and ordered Kimbrough to return to the United States with the remaining film footage and the three Soviets to see what they could do with the film already shot; estimates of the extent of this range from 170,000 lineal feet with Soldadera unfilmed,  to an excess of 250,000 lineal feet.      For the unfinished filming of the novel of Soldadera, without incurring any cost, Eisenstein had secured 500 soldiers, 10,000 guns, and 50 cannons from the Mexican Army, but this was lost due to Sinclairs cancelling of production. When Eisenstein arrived at the American border, a customs search of his trunk revealed sketches and drawings of ": null
    },
    {
        "Jesus": "Jesus"
    },
    {
        " caricatures amongst other lewd pornographic material.   His re-entry visa had expired,  and Sinclairs contacts in Washington were unable to secure him an additional extension. Eisenstein, Aleksandrov, and Tisse were allowed, after a months stay at the ": null
    },
    {
        "U.S.-Mexico border": "U.S.-Mexico Border"
    },
    {
        " outside ": null
    },
    {
        "Laredo, Texas": "Laredo, Texas"
    },
    {
        ", a 30-day pass to get from Texas to New York, and thence depart for Moscow, while Kimbrough returned to Los Angeles with the remaining film.     Eisenstein toured the American South on his way to New York. In mid-1932, the Sinclairs were able to secure the services of ": null
    },
    {
        "Sol Lesser": "Sol Lesser"
    },
    {
        ", who had just opened his distribution office in New York, Principal Distributing Corporation. Lesser agreed to supervise post-production work on the miles of negative—at the Sinclairs expense—and distribute any resulting product. Two short ": null
    },
    {
        "feature films": "Feature Film"
    },
    {
        "and a ": null
    },
    {
        "short subject": "Short Subject"
    },
    {
        "—Thunder Over Mexico based on the Maguey footage,  Eisenstein in Mexico, and Death Day respectively—were completed and released in the United States between the autumn of 1933 and early 1934. Eisenstein never saw any of the Sinclair-Lesser films, nor a later effort by his first biographer, ": null
    },
    {
        "Marie Seton": "Marie Seton"
    },
    {
        ", called  Time in the Sun ,  released in 1940. He would publicly maintain that he had lost all interest in the project. In 1978, Gregori Aleksandrov released – with the same name in contravention to the copyright – his own version, which was awarded the Honorable Golden Prize at the 11th Moscow International Film Festival in 1979. Later, in 1998, Oleg Kovalov edited a free version of the film, calling it Mexican Fantasy .          Eisensteins foray into the West made the staunchly Stalinist film industry look upon him with a suspicion that would never completely disappear. He apparently spent some time in a mental hospital in ": null
    },
    {
        "Kislovodsk": "Kislovodsk"
    },
    {
        " in July 1933,  ostensibly a result of depression born of his final acceptance that he would never be allowed to edit the Mexican footage.  He was subsequently assigned a teaching position at the ": null
    },
    {
        "State Institute of Cinematography": "Gerasimov Institute Of Cinematography"
    },
    {
        " where he had taught earlier, and in 1933 and 1934 was in charge of writing the curriculum.      In 1935, Eisenstein was assigned another project,  Bezhin Meadow , but it appears the film was afflicted with many of the same problems as ¡Que viva México!. Eisenstein unilaterally decided to film two versions of the scenario, one for adult viewers and one for children; failed to define a clear shooting schedule; and shot film prodigiously, resulting in cost overruns and missed deadlines. ": null
    },
    {
        "Boris Shumyatsky": "Boris Shumyatsky"
    },
    {
        ", the de facto head of the Soviet film industry, finally called a halt to the filming and cancelled further production. What appeared to save Eisensteins career at this point was that Stalin ended up taking the position that the Bezhin Meadow catastrophe, along with several other problems facing the industry at that point, had less to do with Eisensteins approach to filmmaking as with the executives who were supposed to have been supervising him. Ultimately this came down on the shoulders of Shumyatsky,  who in early 1938 was denounced, arrested, tried and convicted as a traitor, and shot.       Eisenstein was thence able to ingratiate himself with Stalin for one more chance, and he chose, from two offerings, the assignment of a biopic of  Alexander Nevsky , with music composed by ": null
    },
    {
        "Sergei Prokofiev": "Sergei Prokofiev"
    },
    {
        ".  This time, he was assigned a co-scenarist, ": null
    },
    {
        "Pyotr Pavlenko": "Pyotr Pavlenko"
    },
    {
        ",  to bring in a completed script; professional actors to play the roles; and an assistant director, ": null
    },
    {
        "Dmitri Vasilyev": "Dmitri Ivanovich Vasilyev"
    },
    {
        ", to expedite shooting.     The result was a film critically well received by both the Soviets and in the West, which won him the ": null
    },
    {
        "Order of Lenin": "Order Of Lenin"
    },
    {
        " and the ": null
    },
    {
        "Stalin Prize": "State Stalin Prize"
    },
    {
        ".  It was an allegory and stern warning against the massing forces of Nazi Germany, well played and well made. The script had Nevsky utter a number of traditional Russian ": null
    },
    {
        "proverb": "Proverb"
    },
    {
        "s, verbally rooting his fight against the Germanic invaders in Russian traditions. Kevin McKenna. 2009. Proverbs and the Folk Tale in the Russian Cinema: The Case of Sergei Eisensteins Film Classic Aleksandr Nevsky. The Proverbial «Pied Piper» A Festschrift Volume of Essays in Honor of Wolfgang Mieder on the Occasion of His Sixty-Fifth Birthday, ed. by Kevin McKenna, pp. 277–92. New York, Bern: Peter Lang. This was started, completed, and placed in distribution all within the year 1938, and represented not only Eisensteins first film in nearly a decade but also his first sound film.     Within months of its release, Stalin entered into a ": null
    },
    {
        "pact": "Molotov–Ribbentrop Pact"
    },
    {
        " with Hitler, and Alexander Nevsky was promptly pulled from distribution. Eisenstein returned to teaching, and was assigned to direct ": null
    },
    {
        "Richard Wagners": "Richard Wagner"
    },
    {
        "  Die Walküre  at the ": null
    },
    {
        "Bolshoi Theatre": "Bolshoi Theatre"
    },
    {
        ". After the outbreak of war with Germany in 1941, Alexander Nevsky was re-released with a wide distribution and earned international success. With the war approaching Moscow, Eisenstein was one of many filmmakers evacuated to ": null
    },
    {
        "Alma-Ata": "Almaty"
    },
    {
        ", where he first considered the idea of making a film about Tsar Ivan IV. Eisenstein corresponded with Prokofiev from Alma-Ata, and was joined by him there in 1942. Prokofiev composed ": null
    },
    {
        "the score": "Ivan The Terrible"
    },
    {
        " for Eisensteins film and Eisenstein reciprocated by designing sets for an operatic rendition of  War and Peace  that Prokofiev was developing.        Eisensteins film  Ivan the Terrible , Part I, presenting ": null
    },
    {
        "Ivan IV of Russia": "Ivan The Terrible"
    },
    {
        " as a national hero, won Stalins approval ,  but the sequel, Ivan The Terrible, Part II, was criticized by various authorities and went unreleased until 1958. All footage from Ivan The Terrible, Part III was confiscated whilst the film was still incomplete, and most of it was destroyed, though several filmed scenes exist.         In 1934, in the Soviet Union, Eisenstein married filmmaker and screenwriter Pera Atasheva .    There have been debates about Eisensteins sexuality, with a film covering Eisensteins homosexuality allegedly running into difficulties in Russia.   Eisenstein never publicly acknowledged his homosexuality, but it has long been a subject of debate.  .       Eisenstein suffered a ": null
    },
    {
        "heart attack": "Myocardial Infarction"
    },
    {
        " on 2 February 1946, and spent much of the following year recovering. He died of a second heart attack on 11 February 1948, at the age of 50.  His body lay in state in the Hall of the Cinema Workers before being cremated on 13 February, and his ashes were buried in the ": null
    },
    {
        "Novodevichy Cemetery": "Novodevichy Cemetery"
    },
    {
        " in Moscow.        Eisenstein was a pioneer in the use of ": null
    },
    {
        "montage": "Soviet Montage Theory"
    },
    {
        ", a specific use of ": null
    },
    {
        "film editing": "Film Editing"
    },
    {
        ". He and his contemporary ": null
    },
    {
        "Lev Kuleshov": "Lev Kuleshov"
    },
    {
        ", two of the earliest film theorists, argued that montage was the essence of the cinema. His articles and books—particularly Film Form and The Film Sense—explain the significance of montage in detail.     His writings and films have continued to have a major impact on subsequent filmmakers. Eisenstein believed that editing could be used for more than just expounding a scene or moment, through a linkage of related images. Eisenstein felt the collision of shots could be used to manipulate the emotions of the audience and create film metaphors. He believed that an idea should be derived from the juxtaposition of two independent shots, bringing an element of collage into film. He developed what he called methods of montage :   Metric    Rhythmic    Tonal    Overtonal    Intellectual      Eisenstein taught film-making during his career at GIK where he wrote the curricula for the directors course;  his classroom illustrations are reproduced in Vladimir Nizhniĭs Lessons with Eisenstein. Exercises and examples for students were based on rendering literature such as ": null
    },
    {
        "Honoré de Balzacs": "Honoré De Balzac"
    },
    {
        "  Le Père Goriot .  Another hypothetical was the staging of the ": null
    },
    {
        "Haiti": "Haiti"
    },
    {
        "an struggle for independence as depicted in Anatolii Vinogradovs The Black Consul,  influenced as well by John Vandercooks Black Majesty.      Lessons from this scenario delved into the character of ": null
    },
    {
        "Jean-Jacques Dessalines": "Jean-Jacques Dessalines"
    },
    {
        ", replaying his movements, actions, and the drama surrounding him. Further to the didactics of literary and dramatic content, Eisenstein taught the technicalities of directing, photography, and editing, while encouraging his students development of individuality, expressiveness, and creativity.  Eisensteins pedagogy, like his films, was politically charged and contained quotes from ": null
    },
    {
        "Vladimir Lenin": "Vladimir Lenin"
    },
    {
        " interwoven with his teaching.      In his initial films, Eisenstein did not use professional actors. His narratives eschewed individual characters and addressed broad social issues, especially ": null
    },
    {
        "class conflict": "Class Conflict"
    },
    {
        ". He used stock characters, and the roles were filled with untrained people from the appropriate classes; he avoided casting ": null
    },
    {
        "stars": "Movie Star"
    },
    {
        ".  Eisensteins vision of ": null
    },
    {
        "communism": "Communism"
    },
    {
        " brought him into conflict with officials in the ruling regime of Stalin. Like many ": null
    },
    {
        "Bolshevik": "Bolshevik"
    },
    {
        " artists, Eisenstein envisioned a new society which would subsidize artists totally, freeing them from the confines of bosses and budgets, leaving them absolutely free to create, but budgets and producers were as significant to the Soviet film industry as the rest of the world. Due to the fledgling war, the revolution-wracked and isolated new nation didnt have the resources to nationalize its film industry at first. When it did, limited resources—both monetary and equipment—required production controls as extensive as in the capitalist world. ": null
    },
    {
        "Stalin Prizes": "State Stalin Prize"
    },
    {
        "– 1941 for the film  Alexander Nevsky  , 1946 for the first film of the series  Ivan the Terrible    Honored Artist of the ": null
    },
    {
        "RSFSR": "Russian Soviet Federative Socialist Republic"
    },
    {
        "  Order of Lenin": "Order Of Lenin"
    },
    {
        " – for the film Alexander Nevsky    ": null
    },
    {
        "Order of the Badge of Honour": "Order Of The Badge Of Honour"
    },
    {
        " Google Doodle": "Google Doodle"
    },
    {
        " – The doodle was released in celebration of his 120th birthday.           1923 Дневник Глумова    1925 Стачка    1925 Броненосец Потёмкин    1927 Октябрь «Десять дней, которые потрясли мир»    1929 Штурм Ля Сарраса    1929 Старое и новое «Генеральная линия»    1929 Frauennot - Frauenglück   1930  Romance sentimentale    1931 El Desastre en Oaxaca   1932 Да здравствует Мексика!    1937 Бежин луг    1938 Александр Невский    1944 Иван Грозный 1-я серия    1945 Иван Грозный 2-я серия         .   ; translated by Jay Leyda.   Eisenstein, Sergei , The Film Sense, New York: Hartcourt; translated by Jay Leyda.   Eisenstein, Sergei , Notes of a film director, Foreign Languages Pub. House; translated by X. Danko  .   Eisenstein, Sergei , Towards a Theory of Montage, British Film Institute.     ;In Russian, and available online   , ": null
    }
]