[
    {
        "      Shabbat , Shabbos , or the  Sabbath , is ": null
    },
    {
        "Judaisms": "Judaism"
    },
    {
        "day of rest and seventh day of the ": null
    },
    {
        "week": "Seven-Day Week"
    },
    {
        ". On this day, religious ": null
    },
    {
        "Jews": "Jews"
    },
    {
        ", ": null
    },
    {
        "Samaritans": "Samaritans"
    },
    {
        " and certain ": null
    },
    {
        "Christians": "Christians"
    },
    {
        "  remember the biblical ": null
    },
    {
        "creation of the heavens and the earth in six days": "Genesis Creation Narrative"
    },
    {
        " and look forward to a future ": null
    },
    {
        "Messianic Age": "Messianic Age"
    },
    {
        ".     Shabbat observance entails refraining from ": null
    },
    {
        "work activities": "Activities Prohibited On Shabbat"
    },
    {
        ", often with ": null
    },
    {
        "great rigor": "Shomer Shabbat"
    },
    {
        ", and engaging in restful activities to honor the day. Judaisms traditional position is that unbroken seventh-day Shabbat originated among the Jewish people, as their first and most sacred institution, though some suggest other origins. Variations upon Shabbat are widespread in Judaism and, with adaptations, throughout the ": null
    },
    {
        "Abrahamic": "Abrahamic Religions"
    },
    {
        " and many other ": null
    },
    {
        "religions": "Religions"
    },
    {
        ".     According to  halakha  , Shabbat is observed from a few minutes before sunset on ": null
    },
    {
        "Friday": "Friday"
    },
    {
        " evening until the appearance of three stars in the sky on Saturday night. ": null
    },
    {
        "Shulchan Aruch": "Shulchan Aruch"
    },
    {
        ", ": null
    },
    {
        "Orach Chayim": "Orach Chayim"
    },
    {
        " 293:2 Shabbat is ushered in by lighting candles and reciting a blessing. Traditionally, three ": null
    },
    {
        "festive meals": "Seudat Mitzvahseudat Shabbat And Seudat Yom Tov"
    },
    {
        " are eaten: in the evening, in the early afternoon, and late in the afternoon. The evening meal and the early afternoon meal typically begin with a blessing called  kiddush  and another blessing recited over two loaves of ": null
    },
    {
        "challah": "Challah"
    },
    {
        ". Shabbat is closed the following evening with a  havdalah  blessing.     Shabbat is a festive day when Jews exercise their freedom from the regular labors of everyday life. It offers an opportunity to contemplate the spiritual aspects of life and to spend time with family.          The word Shabbat derives from the Hebrew verb shavat . Although frequently translated as rest , another accurate translation of these words is ceasing , as resting is not necessarily denoted. The related modern Hebrew word shevita , has the same implication of active rather than passive abstinence from work. The notion of active cessation from labor is also regarded as more consistent with an ": null
    },
    {
        "omnipotent": "Omnipotent"
    },
    {
        "Gods": "Names Of God In Judaism"
    },
    {
        "activity on the seventh day of ": null
    },
    {
        "Creation according to Genesis": "Genesis Creation Narrative"
    },
    {
        ". Other significant connotations are to shevet which means sitting or staying, and to sheva meaning seven, as Shabbat is the seventh day of the week; the other days of the week do not have names but called by their ": null
    },
    {
        "ordinals": "Ordinal Number"
    },
    {
        ".            Sabbath is given special status as a holy day at the very beginning of the ": null
    },
    {
        "Torah": "Torah"
    },
    {
        " in . It is first commanded after ": null
    },
    {
        "the Exodus": "The Exodus"
    },
    {
        " from Egypt, in   and in  , as also in  . Sabbath is commanded and commended many more times in the Torah and ": null
    },
    {
        "Tanakh": "Tanakh"
    },
    {
        "; double the normal number of animal ": null
    },
    {
        "sacrifices": "Korban"
    },
    {
        " are to be offered on the day. Every Persons Guide to Shabbat, by Ronald H. Isaacs, Jason Aronson, 1998, p. 6 Sabbath is also described by the prophets ": null
    },
    {
        "Isaiah": "Isaiah"
    },
    {
        ", ": null
    },
    {
        "Jeremiah": "Jeremiah"
    },
    {
        ", ": null
    },
    {
        "Ezekiel": "Ezekiel"
    },
    {
        ", ": null
    },
    {
        "Hosea": "Hosea"
    },
    {
        ", ": null
    },
    {
        "Amos": "Amos"
    },
    {
        ", and ": null
    },
    {
        "Nehemiah": "Nehemiah"
    },
    {
        ".        The longstanding traditional Jewish position is that unbroken seventh-day Shabbat originated among the Jewish people, as their first and most sacred institution.  The origins of Shabbat and a seven-day week are not clear to scholars; the ": null
    },
    {
        "Mosaic": "Moses"
    },
    {
        " tradition claims an origin from the ": null
    },
    {
        "Biblical creation": "Creation According To Genesis"
    },
    {
        ".       Seventh-day Shabbat did not originate with the ": null
    },
    {
        "Egyptians": "Ancient Egypt"
    },
    {
        ", to whom it was unknown;  and other origin theories based on the day of ": null
    },
    {
        "Saturn": "Saturn"
    },
    {
        ", or on the ": null
    },
    {
        "planets": "Planets"
    },
    {
        " generally, have also been abandoned.      The first non-Biblical reference to Sabbath is in an ": null
    },
    {
        "ostracon": "Ostracon"
    },
    {
        " found in excavations at ": null
    },
    {
        "Mesad Hashavyahu": "Mesad Hashavyahu"
    },
    {
        ", which is dated 630 BCE.        For the Babylonian concept of sapattu or sabattu, see ": null
    },
    {
        "here": "Biblical Sabbathetymology"
    },
    {
        ".       Connection to Sabbath observance has been suggested in the designation of the seventh, fourteenth, nineteenth, twenty-first and twenty-eight days of a lunar month in an Assyrian religious calendar as a holy day, also called ‘evil days’ . The prohibitions on these days, spaced seven days apart, include abstaining from chariot riding, and the avoidance of eating meat by the King. On these days officials were prohibited from various activities and common men were forbidden to make a wish , and at least the 28th was known as a rest-day . Histoire du peuple hébreu . ": null
    },
    {
        "André Lemaire": "André Lemaire"
    },
    {
        ". Presses Universitaires de France 2009 , p. 66  The  Universal Jewish Encyclopedia  advanced a theory of ": null
    },
    {
        "Assyriologists": "Assyriologist"
    },
    {
        "like ": null
    },
    {
        "Friedrich Delitzsch": "Friedrich Delitzsch"
    },
    {
        "   that Shabbat originally arose from the ": null
    },
    {
        "lunar cycle": "Lunar Cycle"
    },
    {
        " in the ": null
    },
    {
        "Babylonian calendar": "Babylonian Calendar"
    },
    {
        "   containing four weeks ending in Sabbath, plus one or two additional unreckoned days per month.  The difficulties of this theory include reconciling the differences between an unbroken week and a lunar week, and explaining the absence of texts naming the lunar week as Sabbath in any language.          The Tanakh and ": null
    },
    {
        "siddur": "Siddur"
    },
    {
        " describe Shabbat as having three purposes:   To commemorate ": null
    },
    {
        "Gods": "Names Of God In Judaism"
    },
    {
        " creation of the universe": "Creation According To Genesis"
    },
    {
        ", on the seventh day of which God rested from his work;   To commemorate the Israelites ": null
    },
    {
        "redemption from slavery": "The Exodus"
    },
    {
        " in ": null
    },
    {
        "ancient Egypt": "Ancient Egypt"
    },
    {
        ";   As a taste of ": null
    },
    {
        "Olam Haba": "Olam Haba"
    },
    {
        " .     Judaism accords Shabbat the status of a joyous holy day. In many ways, Jewish law gives Shabbat the status of being the most important holy day in the Jewish calendar: One measure is the number of people called up to Torah readings at the Shachrit/morning service. Three is the smallest number, e.g. Mondays and Thursdays. Five on the Holy days of Passover, Shavuoth, Succoth. Yom Kippur: Six. Shabbat: Seven.   It is the first holy day mentioned in the Bible, and God was the first to observe it with the cessation of ": null
    },
    {
        "Creation": "Creation According To Genesis"
    },
    {
        " .   ": null
    },
    {
        "Jewish liturgy": "Jewish Services"
    },
    {
        " treats Shabbat as a bride and queen ; some sources described it as a king . The Talmud describes rabbis going out to greet the Shabbat Queen, and the ": null
    },
    {
        "Lekhah Dodi": "Lekhah Dodi"
    },
    {
        " poem describes Shabbat as a bride and queen . However, ": null
    },
    {
        "Maimonides": "Maimonides"
    },
    {
        "  speaks of greeting the Shabbat King , and two independent commentaries on Mishneh Torah quote the Talmud as speaking of the Shabbat King . The words King and Queen in Aramaic differ by just one letter, and it seems that these understandings result from different traditions regarding spelling the Talmudic word. See .   The ": null
    },
    {
        "Sefer Torah": "Sefer Torah"
    },
    {
        " is read during the ": null
    },
    {
        "Torah reading": "Torah Reading"
    },
    {
        " which is part of the Shabbat morning services, with a longer reading than during the week. The Torah is read over a yearly cycle of 54  parashioth , one for each Shabbat . On Shabbat, the reading is divided into seven sections, more than on any other holy day, including ": null
    },
    {
        "Yom Kippur": "Yom Kippur"
    },
    {
        ". Then, the ": null
    },
    {
        "Haftarah": "Haftarah"
    },
    {
        " reading from the Hebrew prophets is read.   A tradition states that the ": null
    },
    {
        "Jewish Messiah": "Jewish Messiah"
    },
    {
        " will come if every Jew properly observes two consecutive Shabbatoth. ": null
    },
    {
        "Shabbat": "Shabbat"
    },
    {
        " 118   The punishment in ancient times for desecrating Shabbat  is the most severe punishment in Jewish law. See e.g. Numbers 15:32–36.               Honoring Shabbat  on Preparation Day includes bathing, having a haircut and cleaning and beautifying the home .   According to Jewish law, Shabbat starts a few minutes before sunset. Candles are lit at this time. It is customary in many communities to light the candles 18 minutes before sundown , and most printed Jewish calendars adhere to this custom. The Kabbalat Shabbat service is a prayer service welcoming the arrival of Shabbat. Before Friday night dinner, it is customary to sing two songs, one greeting two Shabbat angels into the house Shabbat 119b and the other praising the woman of the house for all the work she has done over the past week. ": null
    },
    {
        "Proverbs": "Book Of Proverbs"
    },
    {
        " 31:10–31 After blessings over the wine and challah, a festive meal is served. Singing is traditional at Sabbath meals.  In modern times, many composers have written sacred music for use during the Kabbalat Shabbat observance, including ": null
    },
    {
        "Robert Strassburg": "Robert Strassburg"
    },
    {
        "  and ": null
    },
    {
        "Samuel Adler": "Samuel Adler"
    },
    {
        ".  .     According to ": null
    },
    {
        "rabbinic literature": "Rabbinic Literature"
    },
    {
        ", God via the Torah commands Jews to observe and remember Shabbat, and these two actions are symbolized by the customary two ": null
    },
    {
        "Shabbat candles": "Shabbat Candles"
    },
    {
        ". Candles are lit usually by the woman of the house . Some families light more candles, sometimes in accordance with the number of children. ": null
    },
    {
        "Shulchan Aruch": "Shulchan Aruch"
    },
    {
        ", ": null
    },
    {
        "Orach Chaim": "Orach Chaim"
    },
    {
        " 261.          Shabbat is a day of celebration as well as ": null
    },
    {
        "prayer": "Jewish Services"
    },
    {
        ". It is customary to eat three festive meals: Dinner on Shabbat eve , lunch on Shabbat day , and a third meal  in the late afternoon . It is also customary to wear nice clothing on Shabbat to honor the day.     On June 13, 2014, ": null
    },
    {
        "Am Yisrael Foundation": "Am Yisrael Foundation"
    },
    {
        "’s White City Shabbat organization set the ": null
    },
    {
        "Guinness World Record": "Guinness World Record"
    },
    {
        " for the worlds largest Shabbat dinner. Held at Hangar 11 at ": null
    },
    {
        "Tel Aviv Port": "Tel Aviv Port"
    },
    {
        ", the event was attended by 2,226 people, including ": null
    },
    {
        "Alan Dershowitz": "Alan Dershowitz"
    },
    {
        ", Tel Aviv mayor ": null
    },
    {
        "Ron Huldai": "Ron Huldai"
    },
    {
        ", Israeli basketball star ": null
    },
    {
        "Tal Brody": "Tal Brody"
    },
    {
        " and former US Ambassador ": null
    },
    {
        "Michael Oren": "Michael Oren"
    },
    {
        ". The event took almost a year of preparation and involved “60 days of crowd-sourced fundraising,  800 bottles of ": null
    },
    {
        "Israeli wine": "Israeli Wine"
    },
    {
        ", 80 bottles of vodka, 50 bottles of whiskey, 2,000 ": null
    },
    {
        "challah": "Challah"
    },
    {
        " rolls, 80 long tables, 1,800 pieces of chicken, 1,000 portions of beef and 250 vegetarian meals.” A total of 2,300 diners signed up for the dinner and another 3,000 were placed on the waiting list.      Many Jews attend synagogue services on Shabbat even if they do not do so during the week. Services are held on Shabbat eve , Shabbat morning , and late Shabbat afternoon .     With the exception of ": null
    },
    {
        "Yom Kippur": "Yom Kippur"
    },
    {
        ", which is referred to in the Torah as Shabbat of Shabbatoth , days of public fasting are postponed or advanced if they coincide with Shabbat. Mourners sitting  shivah  outwardly conduct themselves normally for the duration of the day and are forbidden to display public signs of mourning.     Although most Shabbat laws are restrictive, the fourth of the ": null
    },
    {
        "Ten Commandments": "Ten Commandments"
    },
    {
        " in ": null
    },
    {
        "Exodus": "Book Of Exodus"
    },
    {
        " is taken by the ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        " and ": null
    },
    {
        "Maimonides": "Maimonides"
    },
    {
        " to allude to the positive commandments of Shabbat. These include:   Honoring Shabbat : on Shabbat, wearing festive clothing and refraining from unpleasant conversation. It is customary to avoid talking on Shabbat about money, business matters, or secular things that one might discuss during the week.  Derived from .   Recitation of  kiddush  over a cup of ": null
    },
    {
        "wine": "Kosher Wine"
    },
    {
        " at the beginning of Shabbat meals, or at a reception after the conclusion of morning prayers .    Eating three festive meals. Meals begin with a blessing over two loaves of bread , usually of braided ": null
    },
    {
        "challah": "Challah"
    },
    {
        ", which is symbolic of the double portion of ": null
    },
    {
        "manna": "Manna"
    },
    {
        " that fell for the Jewish people on the day before Sabbath during their 40 years in the desert after ": null
    },
    {
        "the Exodus": "The Exodus"
    },
    {
        " from ": null
    },
    {
        "Egypt": "Ancient Egypt"
    },
    {
        ". It is customary to serve meat or fish, and sometimes both, for Shabbat evening and morning meals.  Seudah Shlishit  , generally a light meal that may be ": null
    },
    {
        "pareve": "Pareve"
    },
    {
        " or ": null
    },
    {
        "dairy": "Dairy"
    },
    {
        ", is eaten late Shabbat afternoon.   Enjoying Shabbat : Engaging in pleasurable activities such as eating, singing, spending time with the family and marital relations. Sometimes referred to as Shabbating .   Recitation of  havdalah .              Havdalah  is a Jewish religious ceremony that marks the symbolic end of Shabbat, and ushers in the new week. At the conclusion of Shabbat at nightfall, after the appearance of three stars in the sky, the havdalah blessings are recited over a cup of wine, and with the use of fragrant spices and a candle, usually braided. Some communities delay havdalah later into the night in order to prolong Shabbat. There are different customs regarding how much time one should wait after the stars have surfaced until the sabbath technically ends. Some people hold by 72 minutes later and other hold longer and shorter than that.          ": null
    },
    {
        "Jewish law ": "Halakha"
    },
    {
        " prohibits doing any form of melakhah  on Shabbat, unless an urgent human or medical need is life-threatening. Though melakhah is commonly translated as work in ": null
    },
    {
        "English": "English Language"
    },
    {
        ", a better definition is deliberate activity or skill and craftmanship . There are 39 categories of prohibited activities  listed in ": null
    },
    {
        "Mishnah": "Mishnah"
    },
    {
        " Tractate Shabbat": "Shabbat"
    },
    {
        " 7:2.     The term  shomer Shabbat  is used for a person who adheres to Shabbat laws consistently. The shomer Shabbat is an archetype mentioned in Jewish songs  and the intended audience for various treatises on Jewish law and practice for Shabbat .     There are often disagreements between Orthodox Jews and non-Orthodox Jews as to the practical observance of the Sabbath. The observance of the Sabbath is often seen as a benchmark for orthodoxy and indeed has legal bearing on the way a Jew is seen by an ": null
    },
    {
        "orthodox religious court": "Beit Din"
    },
    {
        " regarding their affiliation to Judaism. See ": null
    },
    {
        "Yosef Dov Soloveitchiks": "Yosef Dov Soloveitchik"
    },
    {
        " Beis HaLevi commentary on ": null
    },
    {
        "parasha": "Parasha"
    },
    {
        " Ki Tissa": "Ki Tissa"
    },
    {
        " for further elaboration regarding the legal ramifications.     The 39 categories of melakhah are:    ": null
    },
    {
        "cubits": "Cubit"
    },
    {
        "within public domain": null
    },
    {
        "dai": "Dai"
    },
    {
        "Ex. 35:4 ff.": null
    },
    {
        "dai": "Dai"
    },
    {
        "ophysic": "Ophysic"
    },
    {
        "gefilte fish": "Gefilte Fish"
    },
    {
        " is one solution to this problemscategory 37such as an ": null
    },
    {
        "incandescent bulb": "Incandescent Bulb"
    },
    {
        " or electric ovencategory 37i.e., baking, category 11category 36category 35category 34": null
    },
    {
        "Shabbat clocks": "Shabbat Clock"
    },
    {
        " like operating light switchescategory 39": null
    },
    {
        "Dynamic braking": "Dynamic Braking"
    },
    {
        " is also disabled if it is normally used, i.e., shunting energy collected from downward travel, and thus the gravitational potential energy of passengers, into a ": null
    },
    {
        "resistor": "Resistor"
    },
    {
        " network.": null
    },
    {
        "othi": "Othi"
    },
    {
        "pikuach nefeshJanuary 17, 2010excluding murder, idolatry, and forbidden sexual actsa patient who is ill but not critically so change or deviation  ex post facto hachnasat orchim, ": null
    },
    {
        "hospitality": "Hospitality"
    },
    {
        " commonly sung during or after a mealShabbat preceding ": null
    },
    {
        "Pesach": "Pesach"
    },
    {
        "Shabbat preceding ": null
    },
    {
        "Purim": "Purim"
    },
    {
        "Shabbat between ": null
    },
    {
        "Rosh Hashanah": "Rosh Hashanah"
    },
    {
        " and ": null
    },
    {
        "Yom Kippur": "Yom Kippur"
    },
    {
        "h D": "H D"
    }
]