[
    {
        "   In ": null
    },
    {
        "mechanics": "Mechanics"
    },
    {
        " and ": null
    },
    {
        "physics": "Physics"
    },
    {
        ", simple harmonic motion is a special type of ": null
    },
    {
        "periodic motion or oscillation": "Oscillation"
    },
    {
        " where the ": null
    },
    {
        "restoring force": "Restoring Force"
    },
    {
        " is directly ": null
    },
    {
        "proportional": "Proportionality"
    },
    {
        " to the ": null
    },
    {
        "displacement": "Displacement"
    },
    {
        " and acts in the ": null
    },
    {
        "direction": "Euclidean Vector"
    },
    {
        " opposite to that of ": null
    },
    {
        "displacement": "Displacement"
    },
    {
        ".     Simple harmonic motion can serve as a ": null
    },
    {
        "mathematical model": "Mathematical Model"
    },
    {
        " for a variety of motions, such as the oscillation of a ": null
    },
    {
        "spring": "Spring"
    },
    {
        ". In addition, other phenomena can be approximated by simple harmonic motion, including the motion of a ": null
    },
    {
        "simple pendulum": "Pendulum"
    },
    {
        " as well as ": null
    },
    {
        "molecular vibration": "Molecular Vibration"
    },
    {
        ". Simple harmonic motion is typified by the motion of a ": null
    },
    {
        "mass": "Mass"
    },
    {
        " on a ": null
    },
    {
        "spring": "Spring"
    },
    {
        " when it is subject to the linear ": null
    },
    {
        "elastic": "Elasticity"
    },
    {
        " restoring force given by ": null
    },
    {
        "Hookes law": "Hookes Law"
    },
    {
        ". The motion is ": null
    },
    {
        "sinusoidal": "Sinusoidal"
    },
    {
        " in time and demonstrates a single resonant frequency. For simple harmonic motion to be an accurate model for a pendulum, the net force on the object at the end of the pendulum must be proportional to the displacement. This is a good approximation when the angle of the swing is small.     Simple harmonic motion provides a basis for the characterization of more complicated motions through the techniques of ": null
    },
    {
        "Fourier analysis": "Fourier Analysis"
    },
    {
        ".       The motion of a ": null
    },
    {
        "particle": "Particle"
    },
    {
        " moving along a straight line with an ": null
    },
    {
        "acceleration": "Acceleration"
    },
    {
        " whose direction is always towards a ": null
    },
    {
        "fixed point": "Fixed Point"
    },
    {
        " on the line and whose magnitude is proportional to the distance from the fixed point is called simple harmonic motion           In the diagram, a ": null
    },
    {
        "simple harmonic oscillator": "Harmonic Oscillator"
    },
    {
        ", consisting of a weight attached to one end of a spring, is shown. The other end of the spring is connected to a rigid support such as a wall. If the system is left at rest at the ": null
    },
    {
        "equilibrium": "Mechanical Equilibrium"
    },
    {
        " position then there is no net ": null
    },
    {
        "force": "Force"
    },
    {
        " acting on the mass. However, if the mass is displaced from the equilibrium position, the spring ": null
    },
    {
        "exerts": "Exertion"
    },
    {
        " a restoring ": null
    },
    {
        "elastic": "Elasticity"
    },
    {
        " force that obeys ": null
    },
    {
        "Hookes law": "Hookes Law"
    },
    {
        ".     Mathematically, the restoring force  is given by   :     where  is the restoring elastic force exerted by the spring ,  is the ": null
    },
    {
        "spring constant": "Hookes Law"
    },
    {
        " , and  is the ": null
    },
    {
        "displacement": "Displacement"
    },
    {
        " from the equilibrium position .     For any simple mechanical harmonic oscillator:   When the system is displaced from its equilibrium position, a restoring force that obeys Hookes law tends to restore the system to equilibrium.     Once the mass is displaced from its equilibrium position, it experiences a net restoring force. As a result, it ": null
    },
    {
        "accelerates": "Acceleration"
    },
    {
        " and starts going back to the equilibrium position. When the mass moves closer to the equilibrium position, the restoring force decreases. At the equilibrium position, the net restoring force vanishes. However, at , the mass has ": null
    },
    {
        "momentum": "Momentum"
    },
    {
        " because of the acceleration that the restoring force has imparted. Therefore, the mass continues past the equilibrium position, compressing the spring. A net restoring force then slows it down until its ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " reaches zero, whereupon it is accelerated back to the equilibrium position again.     As long as the system has no ": null
    },
    {
        "energy": "Energy"
    },
    {
        " loss, the mass continues to oscillate. Thus simple harmonic motion is a type of ": null
    },
    {
        "periodic": "Frequency"
    },
    {
        " motion.   Note if the real space and phase space diagram are not co-linear, the phase space motion becomes elliptical. The area enclosed depends on the amplitude and the maximum momentum.       In ": null
    },
    {
        "Newtonian mechanics": "Newtonian Mechanics"
    },
    {
        ", for one-dimensional simple harmonic motion, the equation of motion, which is a second-order linear ": null
    },
    {
        "ordinary differential equation": "Ordinary Differential Equation"
    },
    {
        " with constant coefficients, can be obtained by means of ": null
    },
    {
        "Newtons 2nd law": "Newtons 2Nd Law"
    },
    {
        " and ": null
    },
    {
        "Hookes law": "Hookes Law"
    },
    {
        " for a ": null
    },
    {
        "mass": "Mass"
    },
    {
        " on a ": null
    },
    {
        "spring": "Spring"
    },
    {
        ".     : F  m  -kx,   where  is the ": null
    },
    {
        "inertial mass": "Massinertial Mass"
    },
    {
        " of the oscillating body,  is its ": null
    },
    {
        "displacement": "Displacement"
    },
    {
        " from the ": null
    },
    {
        "equilibrium": "Mechanical Equilibrium"
    },
    {
        " position, and  is a constant .     Therefore,   :   -      Solving the ": null
    },
    {
        "differential equation": "Differential Equation"
    },
    {
        " above produces a solution that is a ": null
    },
    {
        "sinusoidal function": "Sine Wave"
    },
    {
        ".   : x c1  + c2    This equation can be written in the form:   : x A    where   :       A             In the solution,  and  are two constants determined by the initial conditions , and the origin is set to be the equilibrium position. Each of these constants carries a physical meaning of the motion:  is the ": null
    },
    {
        "amplitude": "Amplitude"
    },
    {
        " ,  is the ": null
    },
    {
        "angular frequency": "Angular Frequency"
    },
    {
        ", and  is the initial ": null
    },
    {
        "phase": "Phase"
    },
    {
        ".     Using the techniques of ": null
    },
    {
        "calculus": "Calculus"
    },
    {
        ", the ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " and ": null
    },
    {
        "acceleration": "Acceleration"
    },
    {
        " as a function of time can be found:   : v   - A      Speed:   :     Maximum speed:    : a   - A       Maximum acceleration:      By definition, if a mass  is under SHM its acceleration is directly proportional to displacement.   : a -  x.   where   :       Since ,   : f       and, since  where  is the time period,   : T 2        These equations demonstrate that the simple harmonic motion is ": null
    },
    {
        "isochronous": "Wikt:Isochronous"
    },
    {
        " .       Substituting  with , the ": null
    },
    {
        "kinetic energy": "Kinetic Energy"
    },
    {
        "  of the system at time  is   : K   mv2   m    kA2     and the ": null
    },
    {
        "potential energy": "Potential Energy"
    },
    {
        " is   : U   k x2   k A2     In the absence of friction and other energy loss, the total ": null
    },
    {
        "mechanical energy": "Mechanical Energy"
    },
    {
        " has a constant value   : E K + U   k A2.          The following physical systems are some examples of ": null
    },
    {
        "simple harmonic oscillator": "Harmonic Oscillator"
    },
    {
        ".       A mass  attached to a spring of spring constant  exhibits simple harmonic motion in ": null
    },
    {
        "closed space": "Closed Space"
    },
    {
        ". The equation for describing the period   : T 2     shows the period of oscillation is independent of both the amplitude and ": null
    },
    {
        "gravitational acceleration": "Gravitational Acceleration"
    },
    {
        ", though in practice the amplitude should be small. The above equation is also valid in the case when an additional constant force is being applied on the mass, i.e. the additional constant force cannot change the period of oscillation.       Simple harmonic motion can be considered the one-dimensional ": null
    },
    {
        "projection": "Projection"
    },
    {
        " of ": null
    },
    {
        "uniform circular motion": "Uniform Circular Motion"
    },
    {
        ". If an object moves with angular speed  around a circle of radius  centered at the ": null
    },
    {
        "origin": "Origin"
    },
    {
        " of the -plane, then its motion along each coordinate is simple harmonic motion with amplitude  and angular frequency .            In the ": null
    },
    {
        "small-angle approximation": "Small-Angle Approximation"
    },
    {
        ", the motion of a simple pendulum is approximated by simple harmonic motion. The period of a mass attached to a pendulum of length  with gravitational acceleration g is given by   : T 2         This shows that the period of oscillation is independent of the amplitude and mass of the pendulum but not of the acceleration due to gravity, g , therefore a pendulum of the same length on the Moon would swing more slowly due to the Moons lower gravitational field strength. Because the value of g varies slightly over the surface of the earth, the time period will vary slightly from place to place and will also vary with height above sea level.     This approximation is accurate only for small angles because of the expression for ": null
    },
    {
        "angular acceleration": "Angular Acceleration"
    },
    {
        "  being proportional to the sine of the displacement angle:   : -m g l       where  is the ": null
    },
    {
        "moment of inertia": "Moment Of Inertia"
    },
    {
        ". When  is small,  and therefore the expression becomes   : -m g l       which makes angular acceleration directly proportional to , satisfying the definition of simple harmonic motion.          A Scotch yoke mechanism can be used to convert between rotational motion and linear reciprocating motion. The linear motion can take various forms depending on the shape of the slot, but the basic yoke with a constant rotation speed produces a linear motion that is simple harmonic in form.   ": null
    }
]