[
    {
        "   A snap is the backwards passing of the ball in ": null
    },
    {
        "gridiron football": "Gridiron Football"
    },
    {
        " at the start of ": null
    },
    {
        "play from scrimmage": "Play From Scrimmage"
    },
    {
        ".          The ball begins on the ground with its long axis parallel to the sidelines of the field, its ends marking each teams ": null
    },
    {
        "line of scrimmage": "Line Of Scrimmage"
    },
    {
        " in American football; in Canadian football, the line of scrimmage of the team without the ball is 1 yard past their side of the ball. The player snapping the ball delivers the ball to another player, and that action is the snap. The snapper may hand, throw, or even roll the ball to the other player. The snap must be a quick and continuous movement of the ball by one or both hands of the snapper, and the ball must leave the snappers hands. The various rules codes have additional requirements, all of which have the effect of requiring the ball to go backwards to a player behind the line of scrimmage . The snapper almost always passes the ball between his legs, but only in Canadian football is that required.     In the standard ": null
    },
    {
        "gridiron football formation": "Formation"
    },
    {
        ", the ": null
    },
    {
        "center/centre": "Center"
    },
    {
        " is the snapper and is situated in the middle of the line of scrimmage. Only in ": null
    },
    {
        "arena football": "Arena Football"
    },
    {
        " is the center required by rule to be the snapper. In other codes, a ": null
    },
    {
        "guard": "Guard"
    },
    {
        ", ": null
    },
    {
        "tackle": "Offensive Tackle"
    },
    {
        ", ": null
    },
    {
        "tight end": "Tight End"
    },
    {
        " or ": null
    },
    {
        "split end": "Wide Receiver"
    },
    {
        " can legally deliver the snap; such scenarios, known as an unbalanced line, are seldom used outside of ": null
    },
    {
        "trick plays": "Trick Play"
    },
    {
        " and novelties.        For a handed snap, the snapper will usually have his head up, facing opponents. For a thrown snap, especially in formations wherein the ball may be snapped to players in different positions, the snapper will commonly ": null
    },
    {
        "bend over": "Wikt:Bend Over"
    },
    {
        " looking between his legs. Because of the vulnerability of a player in such a position, the National Collegiate Athletic Association and the National Federation of State High School Associations have adopted rules providing that if a player is positioned at least 7 yards behind the neutral zone to receive a snap, opponents are not to deliberately contact the snapper until one second after the snap , or until the snapper has a chance to react . However, in professional football it is common for a center to be able to practice a single ": null
    },
    {
        " shotgun formation": "Shotgun Formation"
    },
    {
        " thrown snap enough to keep his head up and toss it blindly.     In the ": null
    },
    {
        "National Football League": "National Football League"
    },
    {
        " , the snap is considered a backward pass and not a handoff. This rule was highlighted in a preseason 2014 game between the ": null
    },
    {
        "Arizona Cardinals": "Arizona Cardinals"
    },
    {
        " and the ": null
    },
    {
        "Minnesota Vikings": "Minnesota Vikings"
    },
    {
        ", when ": null
    },
    {
        "Zach Bauman": "Zach Bauman"
    },
    {
        " picked up the ball from the turf after a bad snap and ran it six yards for a touchdown. Since the loose ball was a dropped backward pass and not a fumble, any player could pick up the ball and advance the ball—if it were a fumble, only the original carrier could advance the ball.           The team entitled to snap the ball will usually know in advance the moment when the snap is to occur as one of their players calls out signals, which usually include a loud sound such as hut voiced one or more times, the number of which they know; they are thus said to know the snap count . Therefore, they have a considerable advantage over their opponents. The Center is not, however, allowed to make motions simulating part of the snap action; therefore their opponents can be confident the first motion of the ball or the Centers hands is the beginning of the snap.     The snap count is decided on in the ": null
    },
    {
        "huddle": "Huddle"
    },
    {
        ", usually expressed as ...on . being the final words spoken by the quarterback after calling the play but before the huddle breaks and the players go to the ": null
    },
    {
        "line of scrimmage": "Line Of Scrimmage"
    },
    {
        ". The snap count allows offensive players to have a small head start. The defensive players want to predict the snap, and build up speed such that they cross the ": null
    },
    {
        "line of scrimmage": "Line Of Scrimmage"
    },
    {
        " exactly as the play begins, so as to increase their chances of getting a tackle for a loss or a sack. By varying the snap count, a quarterback forces the defensive players to react to the movement of the offensive players, or risk being called for an ": null
    },
    {
        "offsides": "Penalty Offside"
    },
    {
        " or ": null
    },
    {
        "encroachment": "Encroachment"
    },
    {
        " penalty. Unfortunately for the offense, this advantage can sometimes become a disadvantage. When faced with an exceptionally loud stadium, players may be unable to hear the snap count, and are forced to concentrate more on visual cues , or risk ": null
    },
    {
        "false start": "False Start"
    },
    {
        " penalties.     The offense must also be mindful of the ": null
    },
    {
        "play clock": "Play Clock"
    },
    {
        ". If they fail to snap the ball in time they incur a delay of game penalty. Also, with a dwindling play clock, the defense has better chances of guessing when the ball will be snapped. It is easier to predict when the ball will be snapped with 2 seconds left on the play clock, rather than 5 seconds.     The defensive team is not allowed to simulate, by calling out numbers, the offenses snap count. Successfully simulating the count would cause members of the offensive team to act too early ruining co-ordination of the play and inviting penalties. Current rules, unlike earlier rules, position officials so far from the line of scrimmage for 50 minutes of the 60-minute game that it is extremely difficult to hear if the defense is simulating the count.         The snap, the set ": null
    },
    {
        "scrum": "Scrum"
    },
    {
        " and ": null
    },
    {
        "ruck": "Rugby Union Gameplayruck"
    },
    {
        " in todays ": null
    },
    {
        "rugby union": "Rugby Union"
    },
    {
        ", and the ": null
    },
    {
        "play-the-ball": "Playing Rugby Leagueplay-The-Ball"
    },
    {
        " in ": null
    },
    {
        "rugby league": "Rugby League"
    },
    {
        " have common origins in ": null
    },
    {
        "rugby football": "Rugby Football"
    },
    {
        ". As the rules of rugbys scrimmage were written when the game came to North America, they had a significant flaw which was corrected by custom elsewhere, but by the invention of the snap in American football.  Why the Uncontested Scrimmage     The rule adopted by a committee for American football in 1880 first provided for the uncontested right of one side to play the ball by foot for a scrimmage. A certain use of the foot on the ball which had the same effect as heeling it back was known as a snap . Later in the 19th Century the option of snapping the ball back by hand was added. The option to play the ball with the foot was preserved, however, for several decades, although by early in the 20th Century it was restricted to kicking the ball forward. The kick forward in scrimmage was a surprise play which did not work against a prepared defense. Also for several decades alternatives to the scrimmage for playing the ball from across the sideline after it had gone out of bounds—a throw-in or fair , and bounding in —existed. Note also that until well into the 20th Century, rather than an official readying the ball for scrimmage, the side entitled to the snap had complete custody of the ball and could snap it from the required spot at any time; for instance, a tackled ball carrier might feign injury, then suddenly snap the ball while recumbent, there being no stance requirement yet. The neutral zone and the right of the Center not to be contacted by an opponent before the snap also was not an original feature. As the 20th Century drew to a close, the NCAA and National Federation of State High School Associations extended that protection to some time after the snap, in cases where a player is positioned at least 7 yards deep to receive a thrown snap.     Canadian football used the rugby scrimmage unaltered until near the end of the 19th Century, when, regionally at first, under the influence of the American scrimmage, the number of players in the scrimmage was limited to three—a centre scrimmager bound on either side by props called side scrimmagers . The centre scrimmager was later renamed the snap , and in intercollegiate play one side was given the right to put foot to ball first. Beginning regionally again and universally by 1923, the ": null
    },
    {
        "Burnside rules": "Burnside Rules"
    },
    {
        " led to the 3-man scrimmage being reduced to the centre alone, the number of players on the field being reduced commensurately from 14 to 12, and a snap rule and neutral zone similar to that of American football was adopted. In addition to the between-the-legs requirement noted above, for several years after the adoption of the hand snap, a hand-to-hand snap was illegal, the ball required to be thrown instead, in Canadian football. Apparently a complete break was desired from system of backheeling, and the T formation having gone into eclipse in American football at the time, the Canadian snap was modeled on the formations then in common use in the US, such as the single wing.     The game design rationale for requiring the snap to be a quick and continuous motion to the backfield is to eliminate the need for rules provisions for a live ball in scrimmage. In Rugby Union the ball may be retained by the forwards and played for a time via the foot in a scrummage or ": null
    },
    {
        "ruck": "Rugby Union Gameplayruck"
    },
    {
        ", or by the hands in a ": null
    },
    {
        "maul": "Rugby Union Gameplaymaul"
    },
    {
        ", necessitating additional restrictions on play and player positioning during those intervals. In American and Canadian football, the ball as it is put in play is only held in the line for a fraction of a second. The uncontested possession also, as ": null
    },
    {
        "Walter Camp": "Walter Camp"
    },
    {
        " pointed out, allows for better offensive and defensive planning by the side entitled to snap the ball and their opposition, respectively. A ": null
    },
    {
        "muffed": "Muffed Punt"
    }
]