[
    {
        "           The Snowy Mountains, known informally as The Snowies , is an ": null
    },
    {
        "IBRA": "Interim Biogeographic Regionalisation For Australia"
    },
    {
        " subregion": "Bioregion"
    },
    {
        " and the highest mountain range on the continent of mainland ": null
    },
    {
        "Australia": "Australia"
    },
    {
        ". It contains the Australian mainlands highest mountain, ": null
    },
    {
        "Mount Kosciuszko": "Mount Kosciuszko"
    },
    {
        ", which reaches to a height of  above sea level. The range also contains the five highest peaks on the Australian mainland , all of which are above . They are located in southern ": null
    },
    {
        "New South Wales": "New South Wales"
    },
    {
        " and are part of the larger ": null
    },
    {
        "Australian Alps": "Australian Alps"
    },
    {
        " and ": null
    },
    {
        "Great Dividing Range": "Great Dividing Range"
    },
    {
        ". Unusual for Australia, the mountain range experiences large natural snowfalls every winter. Snow normally falls during June, July, August and early September, with the snow cover melting by late spring. The Tasmanian highlands makes up the other alpine region present in Australia.     The range is host to the ": null
    },
    {
        "mountain plum-pine": "Mountain Plum-Pine"
    },
    {
        ", a low-lying type of conifer. It is considered to be one of the centres of the Australian ski industry during the winter months, with all four ": null
    },
    {
        "snow resorts": "Ski Resort"
    },
    {
        " in New South Wales being located in the region.      The ": null
    },
    {
        "Alpine Way": "Alpine Way"
    },
    {
        " and ": null
    },
    {
        "Snowy Mountains Highway": "Snowy Mountains Highway"
    },
    {
        " are the major roads through the Snowy Mountains region.            The mountain range is thought to have had Aboriginal occupation for 20,000 years. Large scale intertribal gatherings were held in the High Country during summer for collective feasting on the ": null
    },
    {
        "Bogong moth": "Bogong Moth"
    },
    {
        ". This practice continued until around 1865.      The area was first explored by Europeans in 1835, and in 1840, ": null
    },
    {
        "Edmund Strzelecki": "Paweł Edmund Strzelecki"
    },
    {
        " ascended Mount Kosciuszko and named it after the Polish patriot. High country stockmen followed who used the Snowy Mountains for grazing during the summer months. ": null
    },
    {
        "Banjo Patersons": "Banjo Paterson"
    },
    {
        " famous poem ": null
    },
    {
        "The Man From Snowy River": "The Man From Snowy River"
    },
    {
        " recalls this era. The cattle graziers have left a legacy of mountain huts scattered across the area. Today these huts are maintained by the National Parks and Wildlife Service or volunteer organisations like the ": null
    },
    {
        "Kosciuszko Huts Association": "Kosciuszko Huts Association"
    },
    {
        ".     In the 19th century ": null
    },
    {
        "gold": "Gold"
    },
    {
        " was mined on the high plains near ": null
    },
    {
        "Kiandra": "Kiandra, New South Wales"
    },
    {
        ". At its height this community had a population of about 4,000 people, and ran 14 hotels. Since the last resident left in 1974, Kiandra has become a ghost town of ruins and abandoned diggings.      The ": null
    },
    {
        "Kosciuszko National Park": "Kosciuszko National Park"
    },
    {
        " came into existence as the National Chase Snowy Mountains on 5 December 1906. In 1944 this became the Kosciuszko State Park, and then the Kosciuszko National Park in 1967.      Recreational skiing began at Kiandra in the 1860s and experienced a boom in the 20th century following the commencement of the construction of the ": null
    },
    {
        "Snowy Mountains Hydro-Electric Scheme": "Snowy Mountains Hydro-Electric Scheme"
    },
    {
        " between 1949 and 1976 which brought many European workers to the district and opened up access to the ranges.                 The discovery of gold at ": null
    },
    {
        "Kiandra": "Kiandra"
    },
    {
        " , in 1859, briefly enticed a population of thousands above the snowline and saw the introduction of recreational skiing to the Snowy Mountains around 1861.  The Kiandra Goldrush was short-lived, but the township remained a service centre for recreational and survival skiing for over a century. Australias first ": null
    },
    {
        "T-Bar": "T-Bar"
    },
    {
        " was installed at Kiandra in 1957, but the ski facilities were finally shifted up the hill to ": null
    },
    {
        "Selwyn Snowfields": "Selwyn Snowfields"
    },
    {
        " in 1978.  Steeper slopes and more reliable snows lie further to the south and in the 20th Century, the focus of recreational skiing in New South Wales shifted southward, to the ": null
    },
    {
        "Mount Kosciuszko": "Mount Kosciuszko"
    },
    {
        " region. The history of skiing at Kiandra has been the subject of several studies, including 1959s Historic Kiandra , written by the Kiandra Historical Society and Kiandra Goldfields to Skifields by Norman W. Clarke     The Kosciuszko Chalet was built at ": null
    },
    {
        "Charlotte Pass": "Charlotte Pass"
    },
    {
        " in 1930, giving relatively comfortable access to Australias highest terrain.   In 1964, Australia briefly boasted the Worlds Longest ": null
    },
    {
        "Chairlift": "Chairlift"
    },
    {
        " , designed to carry skiers from the Thredbo Valley to Charlotte Pass, but technical difficulties soon closed the facility.   At , Charlotte Pass has the highest village base elevation of any Australia ski resort and can only be accessed via over-snow transport in winter.  The growing number of ski enthusiasts heading to Charlotte Pass led to the establishment of a cafe at ": null
    },
    {
        "Smiggin Holes": "Smiggin Holes"
    },
    {
        " around 1939, where horse-drawn sleighs would deliver skiers to begin the arduous ski to the Kosciusko Chalet.  It was the construction of the vast ": null
    },
    {
        "Snowy Mountains Hydro-Electric Scheme": "Snowy Mountains Hydro-Electric Scheme"
    },
    {
        " from 1949 that really opened up the Snowy Mountains for large scale development of a ski industry and led to the establishment of ": null
    },
    {
        "Thredbo": "Thredbo"
    },
    {
        " and Perisher as leading Australian resorts.  The Construction of ": null
    },
    {
        "Guthega": "Guthega"
    },
    {
        " Dam brought skiers to the isolated Guthega district and a rope tow was installed there in 1957.       Skifields up by Kosciuskos side were also established during this period, though their existence is now little realised. ": null
    },
    {
        "The Australian Alpine Club": "Australian Alpine Club"
    },
    {
        " was founded in 1950 by ": null
    },
    {
        "Charles Anton": "Charles Anton"
    },
    {
        ". Huts were constructed in the Backcountry close to Mount Kosciusko, including ": null
    },
    {
        "Kunama Hut": "Kunama Hut"
    },
    {
        ", which opened for the 1953 season. A rope tow was installed on ": null
    },
    {
        "Mount Northcote": "Mount Northcote"
    },
    {
        " at the site and opened in 1954. The site proved excellent for speed skiing, but the hut was destroyed in an ": null
    },
    {
        "avalanche": "Avalanche"
    },
    {
        ", which also killed one person, in 1956.      Anton also recognised the potential of the ": null
    },
    {
        "Thredbo Valley": "Thredbo Valley"
    },
    {
        " for construction of a major resort and village, with good vertical terrain. Construction began in 1957. Today, Thredbo has 14 ski-lifts and possesses Australias longest ski resort run, the 5.9  km from Karels T-Bar to ": null
    },
    {
        "Friday Flat": "Friday Flat"
    },
    {
        "; Australias greatest vertical drop of 672  m; and the highest lifted point in Australia at 2037  m.       The last establishment of a major skifield in NSW came with the development of ": null
    },
    {
        "Mount Blue Cow": "Blue Cow, New South Wales"
    },
    {
        " in the 1980s. In 1987 the Swiss designed ": null
    },
    {
        "Skitube Alpine Railway": "Skitube Alpine Railway"
    },
    {
        " opened to deliver skiers from ": null
    },
    {
        "Bullocks Flat": "Bullocks Flat"
    },
    {
        ", on the ": null
    },
    {
        "Alpine Way": "Alpine Way"
    },
    {
        ", to Perisher Valley and to Blue Cow, which also opened in 1987. The operators of Blue Cow purchased Guthega in 1991, and the new combined resort later merged with Perisher-Smiggins to become the largest ski resort in the ": null
    },
    {
        "Southern Hemisphere": "Southern Hemisphere"
    },
    {
        ".  In 2009 Perisher had 48 lifts covering 1,245 hectares and four village base areas: Perisher Valley, Blue Cow, Smiggin Holes and Guthega.               The Snowy Mountains also feed the ": null
    },
    {
        "Murrumbidgee": "Murrumbidgee River"
    },
    {
        " and ": null
    },
    {
        "Murray": "Murray River"
    },
    {
        " rivers from the ": null
    },
    {
        "Tooma River": "Tooma River"
    },
    {
        ", ": null
    },
    {
        "Whites River": "Whites River"
    },
    {
        " and ": null
    },
    {
        "Yarrangobilly River": "Yarrangobilly River"
    },
    {
        ". The range is perhaps best known for the ": null
    },
    {
        "Snowy Mountains Scheme": "Snowy Mountains Scheme"
    },
    {
        ", a project to dam the Snowy River, providing both water for irrigation and ": null
    },
    {
        "hydroelectricity": "Hydroelectricity"
    },
    {
        ".     The project began in 1949 employing 100,000 men, two-thirds of whom came from thirty other countries during the post-World War II years. Socially this project symbolises a period during which Australia became an ethnic melting pot of the twentieth century but which also changed Australias character and increased its appreciation for a wide range of cultural diversity.      The Scheme built several temporary towns for its construction workers, several of which have become permanent: ": null
    },
    {
        "Cabramurra": "Cabramurra, New South Wales"
    },
    {
        " ; and ": null
    },
    {
        "Khancoban": "Khancoban, New South Wales"
    },
    {
        ". Additionally, the economy of ": null
    },
    {
        "Cooma": "Cooma, New South Wales"
    },
    {
        " has been sustained by the Scheme. Townships at ": null
    },
    {
        "Adaminaby": "Adaminaby"
    },
    {
        ", ": null
    },
    {
        "Jindabyne": "Jindabyne"
    },
    {
        " and ": null
    },
    {
        "Talbingo": "Talbingo"
    },
    {
        " were inundated by the construction of Lakes ": null
    },
    {
        "Eucumbene": "Lake Eucumbene"
    },
    {
        ", ": null
    },
    {
        "Jindabyne": "Lake Jindabyne"
    },
    {
        " and ": null
    },
    {
        "Talbingo": "Talbingo Dam"
    },
    {
        ".   Improved vehicular access to the High Country enabled ski-resort villages to be constructed at ": null
    },
    {
        "Thredbo": "Thredbo"
    },
    {
        " and ": null
    },
    {
        "Guthega": "Guthega"
    },
    {
        " in the 1950s by ex-Snowy Scheme workers who realised the potential for expansion of the Australian ski industry.     By 1974,  of tunnels and  of aqueducts connected the sixteen dams, seven power stations , and one pumping station.  . Retrieved on 28 February 2008. The ": null
    },
    {
        "American Society of Civil Engineers": "American Society Of Civil Engineers"
    },
    {
        " has rated the Snowy Scheme as a world-class civil engineering project .     The principal lakes created by the scheme include: ": null
    },
    {
        "Lake Eucumbene": "Lake Eucumbene"
    },
    {
        ", ": null
    },
    {
        "Blowering Dam": "Blowering Dam"
    },
    {
        ", ": null
    },
    {
        "Talbingo Dam": "Talbingo Dam"
    },
    {
        ", ": null
    },
    {
        "Lake Jindabyne": "Lake Jindabyne"
    },
    {
        " and ": null
    },
    {
        "Tantangara Dam": "Tantangara Dam"
    },
    {
        ".              The higher regions of the park experience an alpine climate which is unusual on mainland Australia. However, only the peaks of the main range are subject to consistent heavy winter snow. The climate station at ": null
    },
    {
        "Charlotte Pass": "Charlotte Pass, New South Wales"
    },
    {
        " recorded Australias lowest temperature of -23.0  °C on 28 June 1994.             Part of the mountains known as ": null
    },
    {
        "Main Range": "Main Range"
    },
    {
        " contains mainland Australias five ": null
    },
    {
        "glacial lakes": "Glacial Lake"
    },
    {
        ".  The largest of these lakes is ": null
    },
    {
        "Blue Lake": "Blue Lake"
    },
    {
        ", one of the headwaters of the ": null
    },
    {
        "Snowy River": "Snowy River"
    },
    {
        ". The other four glacial lakes are ": null
    },
    {
        "Lake Albina": "Lake Albina"
    },
    {
        ", ": null
    },
    {
        "Lake Cootapatamba": "Lake Cootapatamba"
    },
    {
        ", ": null
    },
    {
        "Club Lake": "Club Lake"
    },
    {
        " and Headley Tarn.     During the ": null
    },
    {
        "last ice age": "Quaternary Glaciation"
    },
    {
        ", which peaked about 20,000 years ago in the ": null
    },
    {
        "Pleistocene": "Pleistocene"
    },
    {
        " epoch": "Epoch"
    },
    {
        ", the highest peaks of the main range near Mount Kosciuszko experienced a climate which favoured the formation of ": null
    },
    {
        "glaciers": "Glacier"
    },
    {
        ", evidence of which can still be seen today. ": null
    },
    {
        "Cirques": "Cirque"
    },
    {
        "moraines": "Moraine"
    },
    {
        ", ": null
    },
    {
        "tarn lakes": "Tarn"
    },
    {
        ", ": null
    },
    {
        "roche moutonnées": "Roche Moutonnée"
    },
    {
        " and other glacial features can all be seen in the area. ": null
    },
    {
        "Lake Cootapatamba": "Lake Cootapatamba"
    },
    {
        ", which was formed by an ice spilling from Mount Kosciuszkos southern flank, is the highest lake on the Australian mainland. Lake Albina, Club Lake, ": null
    },
    {
        "Blue Lake": "Blue Lake"
    },
    {
        ", and Hedley Tarn also have glacial origins. West,D., Kosciuszko Natural Heritage.     There is some disagreement as to exactly how widespread Pleistocene glaciation was on the main range, and little or no evidence from earlier glacial periods exists. The David Moraine, a one kilometre long ridge running across Spencers Creek valley seems to indicate a larger glacier existed in this area at some time, however the glacial origin of this feature is disputed. Galloway, RW , Glaciation in the Snowy Mountains: A Re-appraisal     There is evidence of ": null
    },
    {
        "periglacial": "Periglacial"
    },
    {
        " activity in the area. ": null
    },
    {
        "Solifluction": "Solifluction"
    },
    {
        " appears to have created terraces on the north west flank of Mount Northcote. ": null
    },
    {
        "Frost heave": "Frost Heave"
    },
    {
        " is also a significant agent of ": null
    },
    {
        "soil erosion": "Soil Erosion"
    },
    {
        " in the Kosciuszko Area.            The Snowy Mountains cover a variety of climatic regions which support several distinct ": null
    },
    {
        "ecosystems": "Ecosystem"
    },
    {
        ". The alpine area above the ": null
    },
    {
        "tree line": "Tree Line"
    },
    {
        " is one of the most fragile and covers the smallest area. This area is a patchwork of alpine ": null
    },
    {
        "heaths": "Heath"
    },
    {
        ", ": null
    },
    {
        "herbfields": "Herbfield"
    },
    {
        ", ": null
    },
    {
        "feldmarks": "Feldmark"
    },
    {
        ", ": null
    },
    {
        "bogs": "Bog"
    },
    {
        " and ": null
    },
    {
        "fens": "Fen"
    },
    {
        ". The windswept ": null
    },
    {
        "feldmark": "Feldmark"
    },
    {
        " ecotope": "Ecotope"
    },
    {
        " is endemic to the alpine region, and covers a mere . It is most vulnerable to the wandering footsteps of unmindful tourists.         Many rare or threatened plant and animal species occur within the Snowy Mountains.  The ": null
    },
    {
        "Kosciuszko National Park": "Kosciuszko National Park"
    },
    {
        " is home to one of Australias most threatened species . The endangered ": null
    },
    {
        "mountain pygmy possum": "Mountain Pygmy Possum"
    },
    {
        " and the more common ": null
    },
    {
        "dusky antechinus": "Dusky Antechinus"
    },
    {
        " are located in the high country of the park.     By 2008, ": null
    },
    {
        "wild horse": "Brumby"
    },
    {
        " numbers in the National Park had reached 1,700 with that figure growing by 300 each year, resulting in park authorities coordinating their ": null
    },
    {
        "cull": "Cull"
    },
    {
        "ing and relocation.        The high country is dominated by alpine woodlands, characterised by the ": null
    },
    {
        "snow gum": "Eucalyptus Pauciflora"
    },
    {
        ". ": null
    },
    {
        "Montane": "Montane Forest"
    },
    {
        " and wet ": null
    },
    {
        "sclerophyll": "Sclerophyll"
    },
    {
        " forests also occur across the ranges, supporting large stands of ": null
    },
    {
        "alpine ash": "Eucalyptus Delegatensis"
    },
    {
        " and ": null
    },
    {
        "mountain gum": "Eucalyptus Regnans"
    },
    {
        ". In the southern ": null
    },
    {
        "Byadbo": "Byadbo, New South Wales"
    },
    {
        " wilderness area, dry sclerophyll and ": null
    },
    {
        "wattle": "Acacia"
    },
    {
        " forests predominate. Amongst the many different native trees in the park, the large ": null
    },
    {
        "Chinese elm": "Ulmus Parvifolia"
    },
    {
        " has become naturalised.       In summer 2003, the Australian Alps experienced their largest bushfires for over 60 years with an estimated 1.73 million hectares burning. The bushfires burnt across Victoria, New South Wales and the Australian Capital Territory during a drought that ranks as one of the worst in 103 years of official Australian weather records  . Fires are a natural feature of the parks ecosystem, but it will take some time for the region to return to its pre-2003 condition.      In November 2004, a committee The Snowy Mountains Bushfire Recovery Taskforce was set up by the NSW State Premiers Department to help residents in the region recover from the fires. The Taskforce commissioned Louise Darmody from Sound Memories to produce a documentary involving 26 people from the Snowy Mountains to talk about their experiences ": null
    }
]