[
    {
        "              Computer software, or simply software, is a collection of ": null
    },
    {
        "data": "Data"
    },
    {
        " or ": null
    },
    {
        "computer": "Computer"
    },
    {
        " instructions that tell the computer how to work. This is in contrast to ": null
    },
    {
        "physical hardware": "Computer Hardware"
    },
    {
        ", from which the system is built and actually performs the work. In ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        " and ": null
    },
    {
        "software engineering": "Software Engineering"
    },
    {
        ", computer software is all ": null
    },
    {
        "information": "Information"
    },
    {
        " processed by ": null
    },
    {
        "computer systems": "Computer System"
    },
    {
        ", ": null
    },
    {
        "programs": "Computer Program"
    },
    {
        " and ": null
    },
    {
        "data": "Data"
    },
    {
        ". Computer software includes ": null
    },
    {
        "computer programs": "Computer Program"
    },
    {
        ", ": null
    },
    {
        "libraries": "Library"
    },
    {
        " and related non-executable ": null
    },
    {
        "data": "Data"
    },
    {
        ", such as ": null
    },
    {
        "online documentation": "Software Documentation"
    },
    {
        " or ": null
    },
    {
        "digital media": "Digital Media"
    },
    {
        ". Computer hardware and software require each other and neither can be realistically used on its own.     At the lowest programming level, ": null
    },
    {
        "executable code": "Executable Code"
    },
    {
        " consists of ": null
    },
    {
        "machine language": "Machine Code"
    },
    {
        " instructions supported by an individual ": null
    },
    {
        "processor": "Microprocessor"
    },
    {
        "—typically a ": null
    },
    {
        "central processing unit": "Central Processing Unit"
    },
    {
        " or a ": null
    },
    {
        "graphics processing unit": "Graphics Processing Unit"
    },
    {
        " . A machine language consists of groups of ": null
    },
    {
        "binary values": "Binary Numbers"
    },
    {
        " signifying ": null
    },
    {
        "processor instructions": "Instruction"
    },
    {
        " that change the state of the computer from its preceding state. For example, an instruction may change the value stored in a particular storage location in the computer—an effect that is not directly observable to the user. An instruction ": null
    },
    {
        "may also invoke": "System Call"
    },
    {
        " one of many ": null
    },
    {
        "input or output operations": "Input/Output"
    },
    {
        ", for example displaying some text on a computer screen; causing state changes which should be visible to the ": null
    },
    {
        "user": "User"
    },
    {
        ". The processor ": null
    },
    {
        "executes": "Instruction Cycle"
    },
    {
        " the instructions in the order they are provided, unless it is instructed to ": null
    },
    {
        " jump to a different instruction": "Branch Instruction"
    },
    {
        ", or is ": null
    },
    {
        "interrupt": "Interrupt"
    },
    {
        "ed by the operating system. , most ": null
    },
    {
        "personal computers": "Personal Computer"
    },
    {
        ", ": null
    },
    {
        "smartphone": "Smartphone"
    },
    {
        " devices and ": null
    },
    {
        "servers": "Server"
    },
    {
        " have ": null
    },
    {
        "processors with multiple execution units": "Multi-Core Processor"
    },
    {
        " or ": null
    },
    {
        "multiple processors performing computation": "Multiprocessing"
    },
    {
        " together, and computing has become a much more ": null
    },
    {
        "concurrent": "Concurrent Computing"
    },
    {
        " activity than in the past.     The majority of software is written in ": null
    },
    {
        "high-level programming languages": "High-Level Programming Language"
    },
    {
        ". They are easier and more efficient for programmers because they are closer to ": null
    },
    {
        "natural languages": "Natural Language"
    },
    {
        " than machine languages.  High-level languages are translated into machine language using a ": null
    },
    {
        "compiler": "Compiler"
    },
    {
        " or an ": null
    },
    {
        "interpreter": "Interpreter"
    },
    {
        " or a combination of the two. Software may also be written in a low-level ": null
    },
    {
        "assembly language": "Assembly Language"
    },
    {
        ", which has strong correspondence to the computers machine language instructions and is translated into machine language using an ": null
    },
    {
        "assembler": "Assembly Language"
    },
    {
        ".          An outline  for what would have been the first piece of software was written by ": null
    },
    {
        "Ada Lovelace": "Ada Lovelace"
    },
    {
        " in the 19th century, for the planned ": null
    },
    {
        "Analytical Engine": "Analytical Engine"
    },
    {
        ". She created ": null
    },
    {
        "proofs": "Mathematical Proof"
    },
    {
        " to show how the engine would calculate ": null
    },
    {
        "Bernoulli Numbers": "Bernoulli Number"
    },
    {
        ". Because of the proofs and the algorithm, she is considered the first computer programmer.       The first theory about software—prior to creation of computers as we know them today—was proposed by ": null
    },
    {
        "Alan Turing": "Alan Turing"
    },
    {
        " in his 1935 essay On Computable Numbers, with an Application to the Entscheidungsproblem .     This eventually led to the creation of the academic fields of ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        " and ": null
    },
    {
        "software engineering": "Software Engineering"
    },
    {
        "; Both fields study software and its creation. Computer science is the theoretical study of computer and software , whereas software engineering is the application of engineering and development of software.     However, prior to 1946, software was not yet the programs stored in the memory of stored-program digital computers, as we now understand it. The first electronic computing devices were instead rewired in order to reprogram them.     In 2000, Fred Shapiro, a librarian at the Yale Law School, published a letter revealing that ": null
    },
    {
        "John Wilder Tukeys": "John Wilder Tukey"
    },
    {
        " 1958 paper The Teaching of Concrete Mathematics contained the earliest known usage of the term software found in a search of ": null
    },
    {
        "JSTORs": "Jstor"
    },
    {
        " electronic archives, predating the ": null
    },
    {
        "OEDs": "Oed"
    },
    {
        " citation by two years. This led many to credit Tukey with coining the term, particularly in obituaries published that same year, although Tukey never claimed credit for any such coinage. In 1995, Paul Niquette claimed he had originally coined the term in October 1953, although he could not find any documents supporting his claim. The earliest known publication of the term software in an engineering context was in August 1953 by Richard R. Carhart, in a ": null
    },
    {
        "Rand Corporation": "Rand Corporation"
    },
    {
        " Research Memorandum.               On virtually all computer platforms, software can be grouped into a few broad categories.          Based on the goal, computer software can be divided into:      Application software  which is software that uses the computer system to perform special functions or provide ": null
    },
    {
        "entertainment functions": "Video Game"
    },
    {
        " beyond the basic operation of the computer itself. There are many different types of application software, because the range of tasks that can be performed with a modern computer is so large—see ": null
    },
    {
        "list of software": "List Of Software"
    },
    {
        ".    System software  which is software for managing  computer hardware  behaviour, as to provide basic functionalities that are required by users, or for other software to run properly, if at all. System software is also designed for providing a platform for running application software,  and it includes the following:    Operating system s which are essential collections of software that manage resources and provides common services for other software that runs on top of them. ": null
    },
    {
        "Supervisory programs": "Supervisory Program"
    },
    {
        ", ": null
    },
    {
        "boot loaders": "Boot Loader"
    },
    {
        ", ": null
    },
    {
        "shells": "Shell"
    },
    {
        " and ": null
    },
    {
        "window systems": "Window System"
    },
    {
        " are core parts of operating systems. In practice, an operating system comes bundled with additional software so that a user can potentially do some work with a computer that only has one operating system.    Device driver s which operate or control a particular type of device that is attached to a computer. Each device needs at least one corresponding device driver; because a computer typically has at minimum at least one input device and at least one output device, a computer typically needs more than one device driver.    Utilities  which are computer ": null
    },
    {
        "programs": "Programs And Features"
    },
    {
        " designed to assist users in the maintenance and care of their computers.    Malicious software  or malware which is software that is developed to harm and disrupt computers. As such, malware is undesirable. Malware is closely associated with computer-related crimes, though some malicious programs may have been designed as ": null
    },
    {
        "practical jokes": "Practical Joke"
    },
    {
        ".       ": null
    },
    {
        "Desktop applications": "Desktop Applications"
    },
    {
        " such as ": null
    },
    {
        "web browsers": "Web Browser"
    },
    {
        " and ": null
    },
    {
        "Microsoft Office": "Microsoft Office"
    },
    {
        ", as well as ": null
    },
    {
        "smartphone": "Smartphone"
    },
    {
        " and ": null
    },
    {
        "tablet": "Tablet Computer"
    },
    {
        " applications .    ": null
    },
    {
        "JavaScript": "Javascript"
    },
    {
        " scripts are pieces of software traditionally embedded in ": null
    },
    {
        "web pages": "Web Pages"
    },
    {
        " that are run directly inside the ": null
    },
    {
        "web browser": "Web Browser"
    },
    {
        " when a web page is loaded without the need for a web browser plugin. Software written in other programming languages can also be run within the web browser if the software is either translated into JavaScript, or if a web browser plugin that supports that language is installed; the most common example of the latter is ": null
    },
    {
        "ActionScript": "Actionscript"
    },
    {
        " scripts, which are supported by the ": null
    },
    {
        "Adobe Flash": "Adobe Flash"
    },
    {
        " plugin.   ": null
    },
    {
        "Server software": "Server Software"
    },
    {
        ", including:   ": null
    },
    {
        "Web applications": "Web Application"
    },
    {
        ", which usually run on the ": null
    },
    {
        "web server": "Web Server"
    },
    {
        " and output dynamically generated web pages to web browsers, using e.g. ": null
    },
    {
        "PHP": "Php"
    },
    {
        ", ": null
    },
    {
        "Java": "Java"
    },
    {
        ", ": null
    },
    {
        "ASP.NET": "Asp.Net"
    },
    {
        ", or even ": null
    },
    {
        "JavaScript that runs on the server": "Node.Js"
    },
    {
        ". In modern times these commonly include some JavaScript to be run in the web browser as well, in which case they typically run partly on the server, partly in the web browser.   ": null
    },
    {
        "Plugins": "Plug-In"
    },
    {
        " and extensions are software that extends or modifies the functionality of another piece of software, and require that software be used in order to function;   ": null
    },
    {
        "Embedded software": "Embedded Software"
    },
    {
        " resides as ": null
    },
    {
        "firmware": "Firmware"
    },
    {
        " within ": null
    },
    {
        "embedded systems": "Embedded System"
    },
    {
        ", devices dedicated to a single use or a few uses such as ": null
    },
    {
        "cars": "Car"
    },
    {
        " and ": null
    },
    {
        "televisions": "Television"
    },
    {
        " .  In the embedded system context there is sometimes no clear distinction between the system software and the application software. However, some embedded systems run ": null
    },
    {
        "embedded operating systems": "Embedded Operating System"
    },
    {
        ", and these systems do retain the distinction between system software and application software .   ": null
    },
    {
        "Microcode": "Microcode"
    },
    {
        " is a special, relatively obscure type of embedded software which tells the processor itself how to execute machine code, so it is actually a lower level than machine code. It is typically proprietary to the processor manufacturer, and any necessary correctional microcode software updates are supplied by them to users . Thus an ordinary programmer would not expect to ever have to deal with it.          Programming tools are also software in the form of programs or applications that ": null
    },
    {
        "software developers": "Software Developer"
    },
    {
        "  use to create, ": null
    },
    {
        "debug": "Debugging"
    },
    {
        ", ": null
    },
    {
        "maintain": "Software Maintenance"
    },
    {
        " , or otherwise ": null
    },
    {
        "support": "Technical Support"
    },
    {
        " software.     Software is written in one or more programming languages; there are many programming languages in existence, and each has at least one implementation, each of which consists of its own set of programming tools. These tools may be relatively self-contained programs such as ": null
    },
    {
        "compilers": "Compiler"
    },
    {
        ", ": null
    },
    {
        "debuggers": "Debugger"
    },
    {
        ", ": null
    },
    {
        "interpreters": "Interpreter"
    },
    {
        ", ": null
    },
    {
        "linkers": "Linker"
    },
    {
        ", and ": null
    },
    {
        "text editors": "Text Editor"
    },
    {
        ", that can be combined together to accomplish a task; or they may form an ": null
    },
    {
        "integrated development environment": "Integrated Development Environment"
    },
    {
        " , which combines much or all of the functionality of such self-contained tools. IDEs may do this by either invoking the relevant individual tools or by re-implementing their functionality in a new way. An IDE can make it easier to do specific tasks, such as searching in files in a particular project. Many programming language implementations provide the option of using both individual tools or an IDE.            Users often see things differently from programmers. People who use modern general purpose computers  usually see three layers of software performing a variety of tasks: platform, application, and user software.     Platform software The ": null
    },
    {
        "Platform": "Platform"
    },
    {
        " includes the ": null
    },
    {
        "firmware": "Firmware"
    },
    {
        ", ": null
    },
    {
        "device drivers": "Device Driver"
    },
    {
        ", an ": null
    },
    {
        "operating system": "Operating System"
    },
    {
        ", and typically a ": null
    },
    {
        "graphical user interface": "Graphical User Interface"
    },
    {
        " which, in total, allow a user to interact with the computer and its ": null
    },
    {
        "peripherals": "Peripheral"
    },
    {
        " . Platform software often comes bundled with the computer. On a ": null
    },
    {
        "PC": "Personal Computer"
    },
    {
        " one will usually have the ability to change the platform software.   Application software ": null
    },
    {
        "Application software": "Application Software"
    },
    {
        " or Applications are what most people think of when they think of software. Typical examples include office suites and video games. ": null
    },
    {
        "Application software": "Application Software"
    },
    {
        " is often purchased separately from computer hardware. Sometimes applications are bundled with the computer, but that does not change the fact that they run as independent applications. Applications are usually independent programs from the operating system, though they are often tailored for specific platforms. Most users think of compilers, databases, and other system software as applications.   User-written software ": null
    },
    {
        "End-user development": "End-User Development"
    },
    {
        " tailors systems to meet users specific needs. User software include spreadsheet templates and ": null
    },
    {
        "word processor": "Word Processor"
    },
    {
        " templates. Even email filters are a kind of user software. Users create this software themselves and often overlook how important it is. Depending on how competently the user-written software has been integrated into default application packages, many users may not be aware of the distinction between the original packages, and what has been added by co-workers.          Computer software has to be loaded into the ": null
    },
    {
        "computers storage": "Computer Storage"
    },
    {
        " . Once the software has loaded, the computer is able to execute the software. This involves passing ": null
    },
    {
        "instructions": "Instruction"
    },
    {
        " from the ": null
    },
    {
        "application software": "Application Software"
    },
    {
        ", through the system software, to the hardware which ultimately receives the instruction as ": null
    },
    {
        "machine code": "Machine Code"
    },
    {
        ". Each instruction causes the computer to carry out an operation—moving ": null
    },
    {
        "data": "Data"
    },
    {
        ", carrying out a ": null
    },
    {
        "computation": "Computation"
    },
    {
        ", or altering the ": null
    },
    {
        "control flow": "Control Flow"
    },
    {
        " of instructions.     Data movement is typically from one place in memory to another. Sometimes it involves moving data between memory and registers which enable high-speed data access in the CPU. Moving data, especially large amounts of it, can be costly. So, this is sometimes avoided by using pointers to data instead. Computations include simple operations such as incrementing the value of a variable data element. More complex computations may involve many operations and data elements together.           Software quality is very important, especially for ": null
    },
    {
        "commercial": "Commercial Software"
    },
    {
        " and system software like ": null
    },
    {
        "Microsoft Office": "Microsoft Office"
    },
    {
        ", ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        " and ": null
    },
    {
        "Linux": "Linux"
    },
    {
        ". If software is faulty , it can delete a persons work, crash the computer and do other unexpected things. Faults and errors are called ": null
    },
    {
        "bugs": "Software Bug"
    },
    {
        " which are often discovered during alpha and beta testing. Software is often also a victim to what is known as ": null
    },
    {
        "software aging": "Software Aging"
    },
    {
        ", the progressive performance degradation resulting from a combination of unseen bugs.     Many bugs are discovered and eliminated through ": null
    },
    {
        "software testing": "Software Testing"
    },
    {
        ". However, software testing rarely—if ever—eliminates every bug; some programmers say that every program has at least one more bug .  In the ": null
    },
    {
        "waterfall": "Waterfall Model"
    },
    {
        " method of software development, separate testing teams are typically employed, but in newer approaches, collectively termed ": null
    },
    {
        "agile software development": "Agile Software Development"
    },
    {
        ", developers often do all their own testing, and demonstrate the software to users/clients regularly to obtain feedback. Software can be tested through ": null
    },
    {
        "unit testing": "Unit Testing"
    },
    {
        ", ": null
    },
    {
        "regression testing": "Regression Testing"
    },
    {
        " and other methods, which are done manually, or most commonly, automatically, since the amount of code to be tested can be quite large. For instance, ": null
    },
    {
        "NASA": "Nasa"
    },
    {
        " has extremely rigorous software testing procedures for many operating systems and communication functions. Many NASA-based operations interact and identify each other through command programs. This enables many people who work at NASA to check and evaluate functional systems overall. Programs containing command software enable hardware engineering and system operations to function much easier together.          The softwares license gives the user the right to use the software in the licensed environment, and in the case of ": null
    },
    {
        "free software licenses": "Free Software License"
    },
    {
        ", also grants other rights such as the right to make copies.     ": null
    },
    {
        "Proprietary software": "Proprietary Software"
    },
    {
        " can be divided into two types:     ": null
    },
    {
        "freeware": "Freeware"
    },
    {
        ", which includes the category of free trial software or ": null
    },
    {
        "freemium": "Freemium"
    },
    {
        " software . As the name suggests, freeware can be used free, although in the case of free trials or freemium software, this is sometimes only true for a limited period of time or with limited functionality.   software available for a fee, often inaccurately termed ": null
    },
    {
        "commercial software": "Commercial Software"
    },
    {
        " , which can only be legally used on purchase of a license.     ": null
    },
    {
        "Open source software": "Open Source Software"
    },
    {
        ", on the other hand, comes with a ": null
    },
    {
        "free software license": "Free Software License"
    },
    {
        ", granting the recipient the rights to modify and redistribute the software.          Software patents, like other types of patents, are theoretically supposed to give an inventor an exclusive, time-limited license for a detailed idea on how to implement a piece of software, or a component of a piece of software. Ideas for useful things that software could do, and user requirements, are not supposed to be patentable, and concrete implementations are not supposed to be patentable either—the latter are already covered by copyright, generally automatically. So software patents are supposed to cover the middle area, between requirements and concrete implementation. In some countries, a requirement for the claimed invention to have an effect on the physical world may also be part of the requirements for a software patent to be held valid—although since all useful software has effects on the physical world, this requirement may be open to debate. Meanwhile, American copyright law was applied to various aspects of the writing of the software code. Gerardo Con Díaz, The Text in the Machine: American Copyright Law and the Many Natures of Software, 1974–1978,” Technology and Culture 57 , 753–79.     Software patents are controversial in the software industry with many people holding different views about them. One of the sources of controversy is that the aforementioned split between initial ideas and patent does not seem to be honored in practice by patent lawyers—for example the patent for ": null
    },
    {
        "Aspect-Oriented Programming": "Aspect-Oriented Programming"
    },
    {
        " , which purported to claim rights over any programming tool implementing the idea of AOP, howsoever implemented. Another source of controversy is the effect on innovation, with many distinguished experts and companies arguing that software is such a fast-moving field that software patents merely create vast additional litigation costs and risks, and actually retard innovation. In the case of debates about software patents outside the United States, the argument has been made that large American corporations and patent lawyers are likely to be the primary beneficiaries of allowing or continue to allow software patents.          Design and implementation of software varies depending on the complexity of the software. For instance, the design and creation of ": null
    },
    {
        "Microsoft Word": "Microsoft Word"
    },
    {
        " took much more time than designing and developing ": null
    },
    {
        "Microsoft Notepad": "Microsoft Notepad"
    },
    {
        " because the latter has much more basic functionality.     Software is usually designed and created in ": null
    },
    {
        "integrated development environments": "Integrated Development Environment"
    },
    {
        " like ": null
    },
    {
        "Eclipse": "Eclipse"
    },
    {
        ", ": null
    },
    {
        "IntelliJ": "Intellij Idea"
    },
    {
        " and ": null
    },
    {
        "Microsoft Visual Studio": "Microsoft Visual Studio"
    },
    {
        " that can simplify the process and ": null
    },
    {
        "compile": "Compiler"
    },
    {
        " the software . As noted in a different section, software is usually created on top of existing software and the ": null
    },
    {
        "application programming interface": "Application Programming Interface"
    },
    {
        " that the underlying software provides like ": null
    },
    {
        "GTK+": "Gtk+"
    },
    {
        ", JavaBeans or ": null
    },
    {
        "Swing": "Swing"
    },
    {
        ". Libraries can be categorized by their purpose. For instance, the ": null
    },
    {
        "Spring Framework": "Spring Framework"
    },
    {
        " is used for implementing ": null
    },
    {
        "enterprise applications": "Enterprise Application"
    },
    {
        ", the ": null
    },
    {
        "Windows Forms": "Windows Forms"
    },
    {
        " library is used for designing graphical user interface applications like ": null
    },
    {
        "Microsoft Word": "Microsoft Word"
    },
    {
        ", and ": null
    },
    {
        "Windows Communication Foundation": "Windows Communication Foundation"
    },
    {
        " is used for designing ": null
    },
    {
        "web services": "Web Service"
    },
    {
        ". When a program is designed, it relies upon the API. For instance, a Microsoft Windows desktop application might call API functions in the ": null
    },
    {
        ".NET": ".Net Framework"
    },
    {
        " Windows Forms library like Form1.Close and Form1.Show  to close or open the application. Without these APIs, the programmer needs to write these functionalities entirely themselves. Companies like ": null
    },
    {
        "Oracle": "Oracle Corporation"
    },
    {
        " and ": null
    },
    {
        "Microsoft": "Microsoft"
    },
    {
        " provide their own APIs so that many applications are written using their ": null
    },
    {
        "software libraries": "Library"
    },
    {
        " that usually have numerous APIs in them.     ": null
    },
    {
        "Data structures": "Data Structure"
    },
    {
        " such as ": null
    },
    {
        "hash tables": "Hash Table"
    },
    {
        ", ": null
    },
    {
        "arrays": "Array Data Type"
    },
    {
        ", and ": null
    },
    {
        "binary trees": "Binary Tree"
    },
    {
        ", and ": null
    },
    {
        "algorithms": "Algorithm"
    },
    {
        " such as ": null
    },
    {
        "quicksort": "Quicksort"
    },
    {
        ", can be useful for creating software.     Computer software has special economic characteristics that make its design, creation, and distribution different from most other economic goods.       A person who creates software is called a ": null
    },
    {
        "programmer": "Programmer"
    },
    {
        ", ": null
    },
    {
        "software engineer": "Software Engineer"
    },
    {
        " or ": null
    },
    {
        "software developer": "Software Developer"
    },
    {
        ", terms that all have a similar meaning. More informal terms for programmer also exist such as coder and hacker although use of the latter word may cause confusion, because it is more often used to mean ": null
    },
    {
        "someone who illegally breaks into computer systems": "Hacker"
    },
    {
        ".          A great variety of software companies and programmers in the world comprise a software industry. Software can be quite a profitable industry: ": null
    },
    {
        "Bill Gates": "Bill Gates"
    },
    {
        ", the co-founder of ": null
    },
    {
        "Microsoft": "Microsoft"
    },
    {
        " was the richest person in the world in 2009, largely due to his ownership of a significant number of shares in Microsoft, the company responsible for ": null
    },
    {
        "Microsoft Windows": "Microsoft Windows"
    },
    {
        " and ": null
    },
    {
        "Microsoft Office": "Microsoft Office"
    },
    {
        " software products - both market leaders in their respective product categories.     Non-profit software organizations include the ": null
    },
    {
        "Free Software Foundation": "Free Software Foundation"
    },
    {
        ", ": null
    },
    {
        "GNU Project": "Gnu Project"
    },
    {
        " and the ": null
    },
    {
        "Mozilla Foundation": "Mozilla Foundation"
    },
    {
        ". Software standard organizations like the ": null
    },
    {
        "W3C": "W3C"
    },
    {
        ", ": null
    },
    {
        "IETF": "Ietf"
    },
    {
        " develop recommended software standards such as ": null
    },
    {
        "XML": "Xml"
    },
    {
        ", ": null
    },
    {
        "HTTP": "Http"
    },
    {
        " and ": null
    },
    {
        "HTML": "Html"
    },
    {
        ", so that software can interoperate through these standards.     Other well-known large software companies include ": null
    },
    {
        "Google": "Google"
    },
    {
        ", ": null
    },
    {
        "IBM": "Ibm"
    },
    {
        ", ": null
    },
    {
        "TCS": "Tata Consultancy Services"
    },
    {
        ", ": null
    },
    {
        "Infosys": "Infosys"
    },
    {
        ", ": null
    },
    {
        "Wipro": "Wipro"
    },
    {
        ", ": null
    },
    {
        "HCL Technologies": "Hcl Technologies"
    },
    {
        ", ": null
    },
    {
        "Oracle": "Oracle Corporation"
    },
    {
        ", ": null
    },
    {
        "Novell": "Novell"
    },
    {
        ", ": null
    },
    {
        "SAP": "Sap Ag"
    },
    {
        ", ": null
    },
    {
        "Symantec": "Nortonlifelock"
    },
    {
        ", ": null
    },
    {
        "Adobe Systems": "Adobe Systems"
    },
    {
        ", ": null
    },
    {
        "Sidetrade": "Sidetrade"
    },
    {
        " and ": null
    },
    {
        "Corel": "Corel"
    }
]