[
    {
        "Solomon Schechter  was a ": null
    },
    {
        "Moldavia": "Moldavia"
    },
    {
        "n-born American ": null
    },
    {
        "rabbi": "Rabbi"
    },
    {
        ", academic scholar and educator, most famous for his roles as founder and President of the ": null
    },
    {
        "United Synagogue of America": "United Synagogue Of America"
    },
    {
        ", President of the ": null
    },
    {
        "Jewish Theological Seminary of America": "Jewish Theological Seminary Of America"
    },
    {
        ", and architect of American ": null
    },
    {
        "Conservative Judaism": "Conservative Judaism"
    },
    {
        ".       He was born in ": null
    },
    {
        "Focşani": "Focşani"
    },
    {
        ", ": null
    },
    {
        "Moldavia": "Moldavia"
    },
    {
        "  to Rabbi Yitzchok Hakohen, a ": null
    },
    {
        "shochet": "Shochet"
    },
    {
        " and member of ": null
    },
    {
        "Chabad": "Chabad"
    },
    {
        " hasidim": "Hasidim"
    },
    {
        ". He was named after its founder, ": null
    },
    {
        "Shneur Zalman of Liadi": "Shneur Zalman Of Liadi"
    },
    {
        ". Schechter received his early education from his father who was a shochet . Reportedly, he learned to read ": null
    },
    {
        "Hebrew": "Hebrew Language"
    },
    {
        " by age 3, and by 5 mastered ": null
    },
    {
        "Chumash": "Chumash"
    },
    {
        ". He went to a ": null
    },
    {
        "yeshiva": "Yeshiva"
    },
    {
        " in ": null
    },
    {
        "Piatra Neamţ": "Piatra Neamţ"
    },
    {
        " at age 10 and at age thirteen studied with one of the major ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        "ic scholars, Rabbi ": null
    },
    {
        "Joseph Saul Nathanson": "Joseph Saul Nathanson"
    },
    {
        " of ": null
    },
    {
        "Lemberg": "Lviv"
    },
    {
        ".  at home.earthlink.net In his 20s, he went to the Rabbinical College in ": null
    },
    {
        "Vienna": "Vienna"
    },
    {
        ", where he studied under the more modern Talmudic scholar ": null
    },
    {
        "Meir Friedmann": "Meir Friedmann"
    },
    {
        ", before moving on in 1879 to undertake further studies at the  Berlin Hochschule für die Wissenschaft des Judentums  and at the ": null
    },
    {
        "University of Berlin": "University Of Berlin"
    },
    {
        ". In 1882, he was invited to ": null
    },
    {
        "Britain": "United Kingdom"
    },
    {
        ", to be ": null
    },
    {
        "tutor": "Tutor"
    },
    {
        " of ": null
    },
    {
        "rabbinics": "Rabbinics"
    },
    {
        " under ": null
    },
    {
        "Claude Montefiore": "Claude Montefiore"
    },
    {
        " in ": null
    },
    {
        "London": "London"
    },
    {
        ".       In 1890, after the death of ": null
    },
    {
        "Solomon Marcus Schiller-Szinessy": "Solomon Marcus Schiller-Szinessy"
    },
    {
        ", he was appointed to the faculty at ": null
    },
    {
        "Cambridge University": "Cambridge University"
    },
    {
        ", serving as a lecturer in ": null
    },
    {
        "Talmud": "Talmud"
    },
    {
        "ics and reader in Rabbinics.  To this day, the students of the Cambridge University Jewish Society hold an annual Solomon Schechter Memorial Lecture.     His greatest academic fame came from his excavation in 1896 of the papers of the ": null
    },
    {
        "Cairo Geniza": "Cairo Geniza"
    },
    {
        ", an extraordinary collection of over 100,000 pages of rare Hebrew religious manuscripts and medieval Jewish texts that were preserved at an ": null
    },
    {
        "Egypt": "Egypt"
    },
    {
        "ian synagogue. The find revolutionized the study of Medieval Judaism.     ": null
    },
    {
        "Jacob Saphir": "Jacob Saphir"
    },
    {
        " was the first Jewish researcher to recognize the significance of the Cairo Geniza, as well as the first to publicize the existence of the ": null
    },
    {
        "Midrash ha-Gadol": "Midrash Ha-Gadol"
    },
    {
        ". Schechter was alerted to the existence of the Genizas papers in May 1896 by two Scottish sisters, ": null
    },
    {
        "Mrs. Lewis and Mrs. Gibson": "Agnes And Margaret Smith"
    },
    {
        ", who showed him some leaves from the Geniza that contained the Hebrew text of ": null
    },
    {
        "Sirach": "Wisdom Of Sirach"
    },
    {
        ", which had for centuries only been known in ": null
    },
    {
        "Greek": "Greek Language"
    },
    {
        " and ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " translation. Soskice, Janet Sisters of Sinai. London: Vintage, 239 - 40 Letters, written at Schechters prompting, by Agnes Smith to  The Athenaeum  and  The Academy  quickly revealed the existence of another nine leaves of the same manuscript in the possession of ": null
    },
    {
        "Archibald Sayce": "Archibald Sayce"
    },
    {
        " at Oxford University. Soskice, Janet Sisters of Sinai. London: Vintage, 241 - 2 Schechter quickly found support for another expedition to the Cairo Geniza, and arrived there in December 1896 with an introduction from the Chief Rabbi, ": null
    },
    {
        "Hermann Adler": "Hermann Adler"
    },
    {
        ", to the Chief Rabbi of Cairo, Aaron Raphael Ben Shimon. Soskice, Janet Sisters of Sinai. London: Vintage, 246 He carefully selected for the ": null
    },
    {
        "Cambridge University Library": "Cambridge University Library"
    },
    {
        " a trove three times the size of any other collection: this is now part of the ": null
    },
    {
        "Taylor-Schechter Collection": "Charles Taylor"
    },
    {
        ". The find was instrumental in Schechter resolving a dispute with ": null
    },
    {
        "David Margoliouth": "David Samuel Margoliouth"
    },
    {
        " as to the likely Hebrew language origins of ": null
    },
    {
        "Sirach": "Sirach"
    },
    {
        ". Soskice, Janet Sisters of Sinai. London: Vintage, 240 - 41     Charles Taylor took a great interest in Solomon Schechters work in Cairo, and the  genizah  fragments presented to the University of Cambridge are known as the Taylor-Schechter Collection.  He was joint editor with Schechter of The Wisdom of Ben Sira, 1899. He published separately Cairo Genizah Palimpsests, 1900.     He became a Professor of Hebrew at ": null
    },
    {
        "University College London": "University College London"
    },
    {
        " in 1899 and remained until 1902 when he moved to the ": null
    },
    {
        "United States": "United States"
    },
    {
        " and was replaced by ": null
    },
    {
        "Israel Abrahams": "Israel Abrahams"
    },
    {
        ".       In 1902, traditional Jews reacting against the progress of the American ": null
    },
    {
        "Reform Judaism": "Reform Judaism"
    },
    {
        " movement, which was trying to establish an authoritative synod of American rabbis, recruited Schechter to become President of the ": null
    },
    {
        "Jewish Theological Seminary of America": "Jewish Theological Seminary Of America"
    },
    {
        " .     Schechter served as the second President of the JTSA, from 1902 to 1915, during which time he founded the United Synagogue of America, later renamed as the ": null
    },
    {
        "United Synagogue of Conservative Judaism": "United Synagogue Of Conservative Judaism"
    },
    {
        ".       Schechter emphasized the centrality of ": null
    },
    {
        "Jewish law": "Halakha"
    },
    {
        " in Jewish life in a speech in his inaugural address as President of the JTSA in 1902:     : Judaism is not a religion which does not oppose itself to anything in particular. Judaism is opposed to any number of things and says distinctly thou shalt not. It permeates the whole of your life. It demands control over all of your actions, and interferes even with your menu. It sanctifies the seasons, and regulates your history, both in the past and in the future. Above all, it teaches that disobedience is the strength of sin. It insists upon the observance of both the spirit and of the letter; spirit without letter belongs to the species known to the mystics as nude souls , wandering about in the universe without balance and without consistency...In a word, Judaism is absolutely incompatible with the abandonment of the ": null
    },
    {
        "Torah": "Torah"
    },
    {
        ".     Schechter, on the other hand, believed in what he termed Catholic Israel. The basic idea being that Jewish law, ": null
    },
    {
        "Halacha": "Halacha"
    },
    {
        ", is formed and evolves based on the behavior of the people. This concept of modifying the law based on national consensus is an untraditional viewpoint.     Schechter was an early advocate of ": null
    },
    {
        "Zionism": "Zionism"
    },
    {
        ". He was the chairman of the committee that edited the ": null
    },
    {
        "Jewish Publication Society of America Version": "Jewish Publication Society Of America Version"
    },
    {
        " of the ": null
    },
    {
        "Hebrew Bible": "Hebrew Bible"
    },
    {
        ".          Schechters name is synonymous with the findings of the Cairo Geniza. He placed the JTSA on an institutional footing strong enough to endure for over a century. He became identified as the foremost personality of Conservative Judaism and is regarded as its founder. A network of ": null
    },
    {
        "Conservative": "Conservative Judaism"
    },
    {
        "Jewish day schools": "Jewish Day School"
    },
    {
        " is named in his honor, as well as a summer camp in Olympia, Washington. There are several dozen ": null
    },
    {
        "Solomon Schechter Day Schools": "Solomon Schechter Day School Association"
    },
    {
        " across the United States and Canada.       Schechter, Solomon Studies in Judaism. 3 vols. London: A. & C. Black, 1896-1924   Schechter, Solomon Some Aspects of Rabbinic Theology London: A. and C. Black ": null
    }
]