[
    {
        "               A solstice is an event occurring when the ": null
    },
    {
        "Sun": "Sun"
    },
    {
        " appears to reach its most northerly or southerly ": null
    },
    {
        "excursion": "Sun Path"
    },
    {
        " relative to the ": null
    },
    {
        "celestial equator": "Celestial Equator"
    },
    {
        " on the ": null
    },
    {
        "celestial sphere": "Celestial Sphere"
    },
    {
        ". Two solstices occur annually, around June 21 and December 21. The ": null
    },
    {
        "seasons": "Season"
    },
    {
        " of the year are determined by reference to both the solstices and the ": null
    },
    {
        "equinox": "Equinox"
    },
    {
        "es.     The term solstice can also be used in a broader sense, as the day when this occurs. The day of a solstice in either hemisphere has either the most ": null
    },
    {
        "sunlight": "Sunlight"
    },
    {
        " of the year  or the least sunlight of the year  for any place other than the ": null
    },
    {
        "Equator": "Equator"
    },
    {
        ". Alternative terms, with no ambiguity as to which hemisphere is the context, are ": null
    },
    {
        "June solstice": "June Solstice"
    },
    {
        " and ": null
    },
    {
        "December solstice": "December Solstice"
    },
    {
        " , referring to the months in which they take place every year.      The word solstice is derived from the ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " sol and sistere , because at the solstices, the Suns ": null
    },
    {
        "declination": "Declination"
    },
    {
        " appears to stand still ; that is, the seasonal movement of the Suns ": null
    },
    {
        "daily path": "Sun Path"
    },
    {
        "  stops at a northern or southern limit before reversing direction.       For an observer on the ": null
    },
    {
        "North Pole": "North Pole"
    },
    {
        ", the Sun reaches the highest position in the sky once a year in June. The day this occurs is called the June solstice day. Similarly, for an observer on the ": null
    },
    {
        "South Pole": "South Pole"
    },
    {
        ", the Sun reaches the highest position on the December solstice day. When it is the ": null
    },
    {
        "summer solstice": "Summer Solstice"
    },
    {
        " at one Pole, it is the ": null
    },
    {
        "winter solstice": "Winter Solstice"
    },
    {
        " on the other. The Suns westerly motion never ceases as Earth is continually in rotation. However, the Suns motion in declination comes to a stop at the moment of solstice. In that sense, solstice means sun-standing .     This modern scientific word descends from a ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " scientific word in use in the late ": null
    },
    {
        "Roman Republic": "Roman Republic"
    },
    {
        " of the 1st century BC: solstitium. ": null
    },
    {
        "Pliny": "Pliny The Elder"
    },
    {
        " uses it a number of times in his  Natural History  with a similar meaning that it has today. It contains two Latin-language morphemes, sol, sun , and -stitium, stoppage .    The Romans used standing to refer to a component of the ": null
    },
    {
        "relative velocity": "Relative Velocity"
    },
    {
        " of the Sun as it is observed in the sky. Relative velocity is the motion of an object from the point of view of an observer in a ": null
    },
    {
        "frame of reference": "Frame Of Reference"
    },
    {
        ". From a fixed position on the ground, the Sun appears to orbit around Earth. The ": null
    },
    {
        "Principle of relativity": "Principle Of Relativity"
    },
    {
        " was first applied to inertial frames of reference by ": null
    },
    {
        "Albert Einstein": "Albert Einstein"
    },
    {
        ". Before then, the concepts of ": null
    },
    {
        "absolute space and time": "Absolute Space And Time"
    },
    {
        " applied by ": null
    },
    {
        "Isaac Newton": "Isaac Newton"
    },
    {
        " prevailed. The motion of the Sun across the sky is still called apparent motion in ": null
    },
    {
        "celestial navigation": "Celestial Navigation"
    },
    {
        " in deference to the Newtonian view, but the reality of the supposed real motion has no special laws to commend it, both are visually verifiable and both follow the same laws of physics.     To an observer in an ": null
    },
    {
        "inertial frame of reference": "Inertial Frame Of Reference"
    },
    {
        ", ": null
    },
    {
        "planet Earth is seen to rotate": "Earths Rotation"
    },
    {
        " about an ": null
    },
    {
        "axis": "Rotation"
    },
    {
        " and ": null
    },
    {
        "revolve": "Orbit"
    },
    {
        " around the Sun in an ": null
    },
    {
        "elliptical": "Ellipse"
    },
    {
        " path with the Sun at one ": null
    },
    {
        "focus": "Focus"
    },
    {
        ". Earths axis is ": null
    },
    {
        "tilted": "Axial Tilt"
    },
    {
        " with respect to the ": null
    },
    {
        "plane of Earths orbit": "Orbital Plane"
    },
    {
        " and this axis maintains a position that changes little with respect to the background of ": null
    },
    {
        "stars": "Star"
    },
    {
        ". An observer on Earth therefore sees a solar path that is the result of both rotation and revolution.          The component of the Suns motion seen by an earthbound observer caused by the revolution of the tilted axis – which, keeping the same angle in space, is oriented toward or away from the Sun – is an observed daily increment of the ": null
    },
    {
        "elevation": "Horizontal Coordinate System"
    },
    {
        " of the Sun at noon for approximately six months and observed daily decrement for the remaining six months. At maximum or minimum elevation, the relative yearly motion of the Sun perpendicular to the ": null
    },
    {
        "horizon": "Horizon"
    },
    {
        " stops and reverses direction.     Outside of the tropics, the maximum elevation occurs at the summer solstice and the minimum at the winter solstice. The path of the Sun, or ": null
    },
    {
        "ecliptic": "Ecliptic"
    },
    {
        ", sweeps north and south between the northern and southern hemispheres. The days are longer around the summer solstice and shorter around the winter solstice. When the Suns path crosses the ": null
    },
    {
        "equator": "Equator"
    },
    {
        ", the length of the nights at latitudes +L° and -L° are of equal length. This is known as an ": null
    },
    {
        "equinox": "Equinox"
    },
    {
        ". There are two solstices and two equinoxes in a tropical year. For an introduction to these topics of astronomy refer to   fixed in it . As long as no assumptions are made concerning the distances of those bodies from Earth or from each other, the sphere can be accepted as real and is in fact still in use. The Ancient Greeks use the term ηλιοστάσιο , meaning stand of the Sun.     The star s move across the inner surface of the celestial sphere along the circumference s of circle s in parallel planes Strabo II.5.2., aplaneis asteres kata parallēlōn pherontai kuklōn , the fixed stars are borne in parallel circles perpendicular to the Earths axis extended indefinitely into the heavens and intersecting the celestial sphere in a celestial pole. Strabo II.5.2, ho diautēs aksōn kai tou ouranou mesou tetagmenos , the axis through it extending through the middle of the sky The Sun and the planet s do not move in these parallel paths but along another circle, the ecliptic, whose plane is at an angle, the obliquity of the ecliptic , to the axis, bringing the Sun and planets across the paths of and in among the stars.     Cleomedes states: This translation cites this passage at the end of Book I Chapter 2 but other arrangements have it at the start of Chapter 3. In the Greek version of the passage starts Chapter 4. The band of the Zodiac  is at an oblique angle  because it is positioned between the tropical circles and equinoctial circle touching each of the tropical circles at one point ... This Zodiac has a determinable width ... that is why it is described by three circles: the central one is called heliacal .     The term heliacal circle is used for the ecliptic, which is in the center of the zodiacal circle, conceived as a band including the noted constellations named on mythical themes. Other authors use Zodiac to mean ecliptic, which first appears in a gloss of unknown author in a passage of Cleomedes where he is explaining that the Moon is in the zodiacal circle as well and periodically crosses the path of the Sun. As some of these crossings represent eclipse s of the Moon, the path of the Sun is given a synonym, the ekleiptikos  from ekleipsis": null
    }
]