[
    {
        "         is a ": null
    },
    {
        "video game developer": "Video Game Developer"
    },
    {
        " housed within the Japanese video game company ": null
    },
    {
        "Sega": "Sega"
    },
    {
        " as part of its  division. Sonic Team is best known for the long-running  Sonic the Hedgehog  series and games such as  Nights into Dreams  and  Phantasy Star Online .     The initial team, formed in 1990, was composed of staff from Segas Consumer Development division, including programmer ": null
    },
    {
        "Yuji Naka": "Yuji Naka"
    },
    {
        ", artist ": null
    },
    {
        "Naoto Ohshima": "Naoto Ohshima"
    },
    {
        ", and level designer ": null
    },
    {
        "Hirokazu Yasuhara": "Hirokazu Yasuhara"
    },
    {
        ". The team took the name Sonic Team in 1991 with the release of  Sonic the Hedgehog  for the ": null
    },
    {
        "Sega Genesis": "Sega Genesis"
    },
    {
        ". The game was a major success and contributed to millions of Genesis sales. The next Sonic games were developed by Naka and Yasuhara in America at ": null
    },
    {
        "Sega Technical Institute": "Sega Technical Institute"
    },
    {
        ", while Ohshima worked on  Sonic CD  in Japan. Naka returned to Japan in late 1994 to become the head of CS3, later renamed R & D No. 8. During this time, the division took on the Sonic Team brand but developed games that do not feature Sonic, such as Nights into Dreams and  Burning Rangers  .     Following the release of  Sonic Adventure  in 1998, some Sonic Team staff moved to the United States to form Sonic Team USA and develop  Sonic Adventure 2  . With Segas divestiture of its studios into separate companies, R & D No. 8 became SONICTEAM Ltd. in 2000, with Naka as CEO and Sonic Team USA as its subsidiary. Segas financial troubles led to several major structural changes in the early 2000s; the United Game Artists studio was absorbed by Sonic Team in 2003, and Sonic Team USA became Sega Studios USA in 2004. After ": null
    },
    {
        "Sammy Corporation": "Sammy Corporation"
    },
    {
        " purchased Sega in 2004, Sonic Team was reincorporated to become Segas GE1 research and development department, later renamed CS2.     Naka departed Sonic Team during the development of  Sonic the Hedgehog  , and Sega Studios USA was merged back into Sonic Team in 2008. The following decade was marked by Sonic titles of varying reception, with department head ": null
    },
    {
        "Takashi Iizuka": "Takashi Iizuka"
    },
    {
        " acknowledging that Sonic Team had prioritized shipping over quality.            Sonic the Hedgehog    In 1983, programmer ": null
    },
    {
        "Yuji Naka": "Yuji Naka"
    },
    {
        " was hired into Segas Consumer Development division.  His first project was  Girls Garden , which he and ": null
    },
    {
        "Hiroshi Kawaguchi": "Hiroshi Kawaguchi"
    },
    {
        " created as part of their training process.  For his next game,  Phantasy Star  for the ": null
    },
    {
        "Master System": "Master System"
    },
    {
        ", Naka created pseudo-3D animation effects.  He met artist ": null
    },
    {
        "Naoto Ohshima": "Naoto Ohshima"
    },
    {
        " while working on the game.      During the late 1980s and early 1990s, a rivalry formed between ": null
    },
    {
        "Sega": "Sega"
    },
    {
        " and ": null
    },
    {
        "Nintendo": "Nintendo"
    },
    {
        " due to the release of their ": null
    },
    {
        "16-bit": "16-Bit Era"
    },
    {
        "video game consoles": "Video Game Console"
    },
    {
        ": the ": null
    },
    {
        "Sega Genesis": "Sega Genesis"
    },
    {
        " and the ": null
    },
    {
        "Super Nintendo Entertainment System": "Super Nintendo Entertainment System"
    },
    {
        ".   Sega needed a mascot character that would be as synonymous with their brand as ": null
    },
    {
        "Mario": "Mario"
    },
    {
        " was to Nintendo. To distinguish themselves from Nintendo, Sega wanted a ": null
    },
    {
        "killer app": "Killer Application"
    },
    {
        " and character that could appeal to an older demographic than preteens, demonstrate the capabilities of the Genesis, and ensure commercial success in North America.     Some sources indicate Sega of Japan held an internal competition to submit characters designs for a mascot,  while designer ": null
    },
    {
        "Hirokazu Yasuhara": "Hirokazu Yasuhara"
    },
    {
        " said the direction was given only to himself, Ohshima, and Naka.  Ohshima designed a blue hedgehog named Sonic, who was inserted into a prototype game created by Naka. The Sonic design was refined to be less aggressive and appeal to a wider audience before the division began development on their platform game  Sonic the Hedgehog . According to Ohshima, Sega was looking for a game that would sell well in the United States as well as in Japan. Ohshima and Naka already had the game and character ready, with Ohshima having worked with Segas toy and stationery department on design ideas. Ohshima claims that the progress they had already made encouraged the company to select their proposal, as theirs was the only team to have put in a high amount of time and effort. This left him confident their proposal would be selected.      The Sonic the Hedgehog project began with just Naka and Ohshima, but grew to involve two programmers, two sound engineers, and three designers.  Yasuhara joined to supervise Naka and Ohshima and develop levels, and became the lead designer. He satisfied Nakas request for a simple, one-button design by having Sonic do damage by jumping.  Sonic the Hedgehog was released in 1991 and proved a major success, contributing to millions of sales of the Genesis. The development team took the name Sonic Team for the games release. Naka has referred to Sonic Team as only a team name at this point.          Shortly after the release of Sonic the Hedgehog, Naka, Yasuhara, and a number of other Japanese developers relocated to California to join ": null
    },
    {
        "Sega Technical Institute": "Sega Technical Institute"
    },
    {
        " , a development division established by ": null
    },
    {
        "Mark Cerny": "Mark Cerny"
    },
    {
        " intended as an elite studio combining the design philosophies of American and Japanese developers.  While Naka and Yasuhara developed  Sonic the Hedgehog 2  with STI, Ohshima worked on  Sonic CD , a sequel for the ": null
    },
    {
        "Sega CD": "Sega Cd"
    },
    {
        " add-on. Though Naka was not directly involved in the Sonic CD development, he exchanged design ideas with Ohshima.      Following the release of  Sonic & Knuckles  in 1994, Yasuhara quit, citing differences with Naka. Naka returned to Japan, having been offered a role as a producer. He was placed in charge of Segas Consumer Development Department 3, also known as CS3.  Naka was reunited with Ohshima and brought with him ": null
    },
    {
        "Takashi Iizuka": "Takashi Iizuka"
    },
    {
        ",  who had also worked with Nakas team at STI. In the mid-1990s, Sonic Team started work on new intellectual property, leading to the creation of  Nights into Dreams  and  Burning Rangers  for the ": null
    },
    {
        "Sega Saturn": "Sega Saturn"
    },
    {
        ". Naka stated that the release of Nights is when Sonic Team was truly formed as a brand.     The Saturn did not achieve the commercial success of the Genesis, so Sega focused its efforts on a new console, the ": null
    },
    {
        "Dreamcast": "Dreamcast"
    },
    {
        ", which debuted in Japan in 1998. The Dreamcast was seen as opportunity for Sonic Team to revisit the Sonic series, which had stalled in recent years. Sonic Team was originally creating a fully 3D Sonic game for the Saturn, but development moved to the Dreamcast to align with Segas plans. Takashi Iizuka led the project; Iizuka had long wanted to create a Sonic ": null
    },
    {
        "role-playing video game": "Role-Playing Video Game"
    },
    {
        " and felt the Dreamcast was powerful enough to achieve his vision. The game became  Sonic Adventure , launched in 1998, which became the bestselling Dreamcast game.     Around this time, CS3 was renamed to Sega Research and Development Department 8 .  While sometimes referred to as AM8 or Sega-AM8 ,  based on the R & D structure being titled the Sega Amusement Machine Research and Development teams, Sonic Team focused solely on home console games.  Until 2000, media referred to Sonic Teams designation as both R & D 8  and AM8.        In 1999, shortly after the release of Sonic Adventure, twelve Sonic Team members relocated to San Francisco to establish Sonic Team USA, while others remained in Japan. Shortly afterward, a number of key employees—including Ohshima—left Sega to form a new studio, ": null
    },
    {
        "Artoon": "Artoon"
    },
    {
        ". Sonic Team achieved success in the ": null
    },
    {
        "arcade game": "Arcade Game"
    },
    {
        " market in 1999 with the launch of ": null
    },
    {
        "rhythm game": "Rhythm Game"
    },
    {
        "  Samba de Amigo , released the following year for the Dreamcast. The studio also began developing ": null
    },
    {
        "online games": "Online Game"
    },
    {
        "; in 1999, they released  ChuChu Rocket! , a ": null
    },
    {
        "puzzle game": "Puzzle Video Game"
    },
    {
        " that made use of the Dreamcasts online capabilities. In 2000, Sonic Team launched the ": null
    },
    {
        "role-playing game": "Role-Playing Video Game"
    },
    {
        "  Phantasy Star Online  to critical and commercial success.     Sega began to restructure its studios as part of the dissolution of Sega Enterprises and spun off its software divisions into subsidiary companies. When the departments took new names, Naka felt it important to preserve the Sonic Team brand name, and the divisions new legal name as a company was SONICTEAM, Ltd. Naka was installed as the CEO, and Sonic Team USA became a subsidiary of the new company.     Despite a number of well-received games, Sega discontinued the Dreamcast in 2001 and exited the hardware business. Sega transitioned into a ": null
    },
    {
        "third-party developer": "Third-Party Developer"
    },
    {
        " and began developing games for multiple platforms. From 2000, Sonic Team in Japan began to release fewer games, with a few releases such as the puzzle game ": null
    },
    {
        "Puyo Pop": "Puyo Pop"
    },
    {
        " and the action game  Billy Hatcher and the Giant Egg . The company changes and lack of a Sega console affected Sonic Team; according to Naka, in a 2006 interview, Our approach was always to create strategic title concepts, which included the hardware. We do somewhat miss the idea of being able to address these constant challenges.     Early in 2003, Sega president Hideki Sato and COO Tetsu Kamaya announced they were stepping down from their roles, with Sato being replaced by Hisao Oguchi, the head of ": null
    },
    {
        "Hitmaker": "Sega Am3"
    },
    {
        ". As part of Oguchis restructuring plan, he announced his intention to consolidate Segas studios into four or five core operations.  Sonic Team was financially solvent and absorbed ": null
    },
    {
        "United Game Artists": "United Game Artists"
    },
    {
        ", another Sega subsidiary led by ": null
    },
    {
        "Tetsuya Mizuguchi": "Tetsuya Mizuguchi"
    },
    {
        " and known for the ": null
    },
    {
        "music games": "Music Video Game"
    },
    {
        "  Space Channel 5  and  Rez  .       In 2004, Japanese company ": null
    },
    {
        "Sammy": "Sammy Corporation"
    },
    {
        " acquired a controlling interest in Sega and formed ": null
    },
    {
        "Sega Sammy Corporation": "Sega Sammy Corporation"
    },
    {
        ". Prior to the merger, Sega began the process of re-integrating its subsidiaries into the main company.  Sonic Team USA became Sega Studios USA, while SONICTEAM Ltd. became Segas Global Entertainment 1 research and development division .   The team is still referred to as Sonic Team. Naka announced his departure on 8 May 2006 and formed a new studio, ": null
    },
    {
        "Prope": "Prope"
    },
    {
        ", to focus on creating original games. In a 2012 interview, Naka stated that a reason that he left the company was that he would have been required to continue making Sonic games, and he no longer wished to do that.  He left Sonic Team during the development of the 2006 game  Sonic the Hedgehog  , released as part of the 15-year anniversary of the Sonic franchise. Noted for its bugs and design flaws, Sonic the Hedgehog was panned, as was  Sonic Unleashed  . Both games were released for the ": null
    },
    {
        "PlayStation 3": "Playstation 3"
    },
    {
        " and ": null
    },
    {
        "Xbox 360": "Xbox 360"
    },
    {
        "; Sonic Team also developed a series of Sonic games for the ": null
    },
    {
        "Wii": "Wii"
    },
    {
        " and ": null
    },
    {
        "Nintendo DS": "Nintendo Ds"
    },
    {
        ", such as 2007s  Sonic and the Secret Rings .     By 2010, Sonic Team became CS Research and Development No. 2 , Sega Studios USA was reintegrated into the Japanese team, and Iizuka was installed as the head of the department.   After a series of poorly received Sonic releases, Sonic Team refocused on speed and more traditional side-scrolling in  Sonic the Hedgehog 4: Episode I  and  II ,  Sonic Generations , and  Sonic Colors , which all received better reviews. In 2015, Iizuka recognized in an interview with  Polygon  that Sonic Team had prioritized shipping games over quality, and had not had enough involvement in later third-party Sonic games, such as  Sonic Boom: Rise of Lyric . He hoped the Sonic Team logo would stand as a mark of quality ; he planned to release quality games and expand the Sonic brand, while retaining the modern Sonic design. In another interview, Iizuka stated that Sonic Team was not involved in the Sonic Boom and that they were developed by Sega of America from back in the day . Sonic Teams first Sonic game exclusive to ": null
    },
    {
        "smartphones": "Smartphone"
    },
    {
        ",  Sonic Runners , was released in 2015. An ": null
    },
    {
        "endless runner": "Endless Runner"
    },
    {
        ", it was designed to have more ": null
    },
    {
        "replay value": "Replay Value"
    },
    {
        " than other games in the genre.  Sonic Runners received mixed reviews  and was ": null
    },
    {
        "unprofitable": "List Of Commercial Failures In Video Gaming"
    },
    {
        ",  resulting in its discontinuation a year later.      In 2017, Sonic Team developed and released  Sonic Forces , and oversaw the development of  Sonic Mania  by ": null
    },
    {
        "Christian Whitehead": "Christian Whitehead"
    },
    {
        ". Forces was aimed at a broad audience of young and adult players, while Mania was focused on fans of the original Genesis games.  Mania became the best reviewed Sonic game in fifteen years  following nearly two decades of mixed reviews for the franchise.  At ": null
    },
    {
        "SXSW": "Sxsw"
    },
    {
        " in March 2019, Iizuka confirmed Sonic Team was also working on a new Sonic title.                Sega Studios USA, formerly Sonic Team USA, was a division of Sega and of Sonic Team while Sonic Team was a subsidiary company. It was founded when twelve Sonic Team members, including Takashi Iizuka, relocated to San Francisco, California, in 1999, and were set as a subsidiary of SONICTEAM Ltd. by 2000. The team worked on game development, translation,  and market studies in the United States,  until they returned to Japan and merged back into Sonic Team in 2008.      Sonic Team USA translated Sonic Adventure and tested ChuChu Rocket! in America before beginning work on  Sonic Adventure 2 . They took inspiration from their location in San Francisco, as well as Yosemite National Park and other areas of the United States. Sonic Adventure 2 was released on 20 June 2001,  and was ported to the GameCube.  The next Sonic Team USA project was  Sonic Heroes  , the first Sonic game developed for multiple platforms. Interview section.  Sonic Team USA took a different approach with Heroes from the Sonic Adventure games, focusing on gameplay more similar to the Genesis games to which even casual gamers could adapt.      After SONICTEAM Ltd. merged back into Sega in 2004, Sonic Team USA was renamed Sega Studios USA. The divisions next project was  Shadow the Hedgehog , released in 2005,  a spin-off starring ": null
    },
    {
        "Shadow": "Shadow The Hedgehog"
    },
    {
        ".  Unlike previous games, Shadow the Hedgehog was targeted at older players and featured different gameplay styles, including the use of guns and different endings to the game.  Shadow the Hedgehog was critically panned for its mature themes and level design,   but was a commercial success, selling at least 1.59 million units.       The final Sega Studios USA game was  Nights: Journey of Dreams , the sequel to Nights into Dreams and the first Nights game since the cancellation of Air Nights in 2000.   Iizuka felt it was important to retain the original games concepts while developing new mechanics, and released it on the ": null
    },
    {
        "Wii": "Wii"
    },
    {
        ", a more family-oriented console.   Journey of Dreams was also designed to have a more European feel, in contrast to the Sonic games, which were more American. The sound and CGI were completed by Sonic Team in Japan, while Sega Studios USA handled the rest of the development for the 2007 release.       Sega Studios USA oversaw the development of  Sonic Rivals  and  Sonic Rivals 2  by ": null
    },
    {
        "Backbone Entertainment": "Backbone Entertainment"
    },
    {
        ".  In 2008, Sega Studios USA merged with Sonic Team, making Iizuka the head of Sonic Team and a vice president of product development for Sega. In 2016, Iizuka relocated to Los Angeles to oversee development with the goal of making Segas studios in Los Angeles a centralized hub for the global brand .       Sonic Team has developed a number of video games, with many of them becoming bestsellers.   The studio is best known for its  Sonic the Hedgehog  series of platform games, which account for the majority of Sonic Teams work; the 1991 release of Sonic the Hedgehog is considered one of the most important moments in video game history, as it propelled Genesis sales and displaced Nintendo as the leading video game company.  Sonic Team have also developed a wide variety of other games, including ": null
    },
    {
        "action games": "Action Game"
    },
    {
        " such as Nights into Dreams, Burning Rangers, and Billy Hatcher and the Giant Egg, the online puzzle game ChuChu Rocket!, the online role-playing game Phantasy Star Online, and the music game Samba de Amigo. Phantasy Star Online is credited for introducing online ": null
    },
    {
        "RPGs": "Role-Playing Video Game"
    },
    {
        " to consoles and was the first online RPG for many players.   According to Sean Smith of  Retro Gamer , few companies could claim to have released as many ": null
    },
    {
        "AAA": "Aaa"
    },
    {
        " games over such a long period, especially between 1991 and 2000. Some Sonic Team games, such as the original Sonic games for the Genesis and Nights, are considered some of the ": null
    },
    {
        "best video games ever made.": "List Of Video Games Considered The Best"
    },
    {
        "   Iizuka has said Sonic Team would be open to developing a third Nights game or a sequel to  Knuckles Chaotix  , if Sega were to commission them.      Sega and Sonic Team have been criticized for their handling of Sonic the Hedgehog after the beginning of the ": null
    },
    {
        "3D era of video games": "Fifth Generation Of Video Game Consoles"
    },
    {
        ". Edwin Evans-Thirlwell of  Eurogamer  described the 3D Sonic games as 20-odd years of slowly accumulating bullshit , and that unlike Sonics main competitor, Nintendos ": null
    },
    {
        "Mario series": "Mario"
    },
    {
        ", Sonic in 3D never had a transcendental hit .  Zolani Stewart of  Kotaku  argued that Sonics portrayal starting with Sonic Adventure with the addition of voice acting and a greater focus on plot and character narrative changed Sonic into a flat, lifeless husk of a character, who spits out slogans and generally has only one personality mode, the radical attitude dude, the sad recycled image of vague 90s cultural concept.  Sega of America marketing director Al Nilsen and Sonic Mania developer Christian Whitehead said they felt the number of ": null
    },
    {
        "additional characters": "List Of Sonic The Hedgehog Characters"
    },
    {
        " added to the series was problematic, with Whitehead describing the characters as padding . In 2015, Sega CEO Haruki Satomi acknowledged that Sega had partially betrayed the trust of the longtime fans of their games and hoped to focus on quality over quantity.        ": null
    }
]