[
    {
        "           Sovereign immunity, or crown immunity, is a ": null
    },
    {
        "legal doctrine": "Legal Doctrine"
    },
    {
        " by which the ": null
    },
    {
        "sovereign": "Monarch"
    },
    {
        " or ": null
    },
    {
        "state": "State"
    },
    {
        " cannot commit a legal wrong and is immune from ": null
    },
    {
        "civil suit": "Lawsuit"
    },
    {
        " or ": null
    },
    {
        "criminal prosecution": "Criminal Law"
    },
    {
        ", strictly speaking in modern texts in its own courts. A similar, stronger rule as regards foreign courts is named ": null
    },
    {
        "state immunity": "State Immunity"
    },
    {
        ".     In its older sense, sovereign immunity is the original forebear of state immunity based on the classical concept of sovereignty in the sense that a sovereign could not be subjected without his or her approval to the ": null
    },
    {
        "jurisdiction": "Jurisdiction"
    },
    {
        " of another.     There are two forms of sovereign immunity:     immunity from suit    immunity from enforcement.     Immunity from suit means neither the sovereign/head of state in person nor any  in absentia  or representative form can be a defendant or subject of court proceedings, nor in most equivalent forums such as under arbitration awards and tribunal awards/damages. Immunity from enforcement means that even if a person succeeds in any way against their sovereign or state, they and the judgment may find itself without means of enforcement. ": null
    },
    {
        "Separation of powers": "Separation Of Powers"
    },
    {
        " or ": null
    },
    {
        "natural justice": "Natural Justice"
    },
    {
        " coupled with a political status other than a ": null
    },
    {
        "totalitarian": "Totalitarian"
    },
    {
        " state dictates there be broad exceptions to immunity such as statutes which expressly bind the state  and ": null
    },
    {
        "judicial review": "Judicial Review"
    },
    {
        ".     Furthermore, sovereign immunity of a state entity may be waived. A state entity may waive its immunity by:     prior written agreement   instituting proceedings without claiming immunity   submitting to jurisdiction as a defendant in a suit   intervening in or taking any steps in any suit .     In ": null
    },
    {
        "constitutional monarchies": "Constitutional Monarchy"
    },
    {
        " the sovereign is the historical origin of the authority which creates the courts. Thus the courts had no power to compel the sovereign to be bound by them as they were created by the sovereign for the protection of his or her subjects. This rule was commonly expressed by the popular ": null
    },
    {
        "legal maxim": "Legal Maxim"
    },
    {
        " rex non potest peccare, meaning the king can do no wrong .            There is no automatic Crown immunity in Australia and the Australian Constitution does not establish a state of unfettered immunity of the Crown in respect of the States and the Commonwealth. The ": null
    },
    {
        "Constitution of Australia": "Constitution Of Australia"
    },
    {
        " establishes items which the States and the Commonwealth legislate on independently of each other, in practice resulting in the States legislating on some things and the Commonwealth legislating on others. In some circumstances this can create ambiguity as to the applicability of legislation where there is no clearly established Crown immunity. The Australian Constitution does however, in ": null
    },
    {
        "s. 109": "Section 109 Of The Constitution Of Australia"
    },
    {
        ", declare that, When a law of a State is inconsistent with a law of the Commonwealth, the latter shall prevail, and the former shall, to the extent of the inconsistency, be invalid. Based on this, depending on the context of application and whether a particular statute infringes on the executive powers of the State or the Commonwealth the Crown may or may not be immune from any particular statute.     Many Acts passed in Australia, both at the State or the Federal level, contain a section declaring whether the Act binds the Crown, and, if so, in what respect:     Commonwealth Acts may contain wording similar to: This Act binds the Crown in each of its capacities , or specify a more restricted application.   State Acts may contain wording similar to: This Act binds the Crown in right of and, in so far as the legislative power of the Parliament of permits, the Crown in all its other capacities.     Whilst there is no ambiguity surrounding the first aspect of this declaration with respect to binding the Crown with respect to the State in question, there have been several cases in respect of the interpretation of the second aspect extending it to the Crown in its other capacities. Rulings by the ": null
    },
    {
        "High Court of Australia": "High Court Of Australia"
    },
    {
        " on specific matters of conflict between the application of States laws on Commonwealth agencies have provided the interpretation that the Crown in all of its other capacities includes the Commonwealth, therefore if a State Act contains this text then the act may bind the Commonwealth subject to the s. 109 test of inconsistency.     A landmark case which set a precedent for challenging broad Crown immunity and established tests for the applicability of State laws on the Commonwealth was  Henderson v Defence Housing Authority  in 1997. , discussed in  This case involved the arbitration of a dispute between Mr. Henderson and the Defence Housing Authority . Mr. Henderson owned a house which the DHA had leased to provide housing to members of the ": null
    },
    {
        "Australian Defence Force": "Australian Defence Force"
    },
    {
        " . Under the NSW Residential Tenancies Act 1997, , since replaced by the  Mr. Henderson sought orders from the ": null
    },
    {
        "Residential Tenancies Tribunal": "Residential Tribunal Of New South Wales"
    },
    {
        " to enter the premises for the purposes of conducting inspections. In response, DHA claimed that as a Commonwealth agency the legislation of NSW did not apply to it and further sought writs of prohibition attempting to restrain Mr. Henderson from pursuing the matter further. Up until this point the Commonwealth and its agencies claimed an unfettered immunity from State legislation and had used s. 109 to justify this position, specifically that the NSW Act was in conflict with the Act which created the DHA and s. 109 of the Constitution applied. Mr. Henderson took the case to the High Court and a panel of 7 justices to arbitrate the matter. By a majority decision of 6:1 the court ruled that the DHA was bound by the NSW Act on the basis that the NSW Act did not limit, deny or restrict the activities of the DHA but sought to regulate them, an important distinction which was further explained in the rulings of several of the justices. It was ruled that the NSW Act was one of general application and therefore the Crown could not be immune from it, citing other cases in which the same ruling had been made and that it was contrary to the rule of law. As a result of this case, the Commonwealth cannot claim a broad constitutional immunity from State legislation.     In practice, three tests have been developed to determine whether a State law applies to the Commonwealth :     does the law seek to merely regulate the activities of the Commonwealth as opposed to deny, restrict or limit them,   is the State law constructed such that the Act binds the Crown in respect of all of its capacities, and   is there no inconsistency between a State law and a Commonwealth law on the same matter.     If these three tests are satisfied then the Act binds the Crown in respect of the Commonwealth. It is important to note that in Australia there is no clear automatic Crown immunity or lack of it, as such there is a rebuttable presumption that the Crown is not bound by a statute, as noted in  Bropho v State of Western Australia .  The Crowns immunity may also apply to other parties in certain circumstances, as held in  Australian Competition and Consumer Commission v Baxter Healthcare .        Article 88 of the ": null
    },
    {
        "Constitution of Belgium": "Constitution Of Belgium"
    },
    {
        " states: The King’s person is ": null
    },
    {
        "inviolable": "Monarchy Of Belgiuminviolability"
    },
    {
        "; his ministers are accountable.        According to the constitution of Bhutan, the monarch is not answerable in a court of law for   his or her actions.        Canada inherited common law version of Crown immunity from British law. However, over time the scope of Crown immunity has been steadily reduced by statute law.  As of 1994, section 14 of the Alberta Interpretation Act  stated, No enactment is binding on Her Majesty or affects Her Majesty or Her Majestys rights or prerogatives in any manner, unless the enactment expressly states that it binds Her Majesty. Alberta Law Reform Institute.  . Report No. 71, July 1994. . Archived from  on 22 July 2013. Accessed 1 January 2018. However, in more recent times All Canadian provinces ... and the federal government  have now rectified this anomaly by passing legislation which leaves the Crown liable in tort as a normal person would be. Thus, the tort liability of the government is a relatively new development in Canada, statute-based, and is not a fruit of common law.      Since 1918, it has been held that provincial legislatures cannot bind the federal Crown, as ": null
    },
    {
        "Fitzpatrick CJ": "Charles Fitzpatrick"
    },
    {
        " noted in Gauthier v The King:          It has also been a constitutional convention that the ": null
    },
    {
        "Crown in right of each province": "Monarchy In The Canadian Provinces"
    },
    {
        " is immune from the jurisdiction of the courts in other provinces. However this is now in question.      ": null
    },
    {
        "Lieutenant Governors": "Lieutenant Governor"
    },
    {
        " do not enjoy the same immunity as the Sovereign in matters not relating to the powers of the office. In 2013, the ": null
    },
    {
        "Supreme Court": "Supreme Court Of Canada"
    },
    {
        " refused to hear the request of former Lieutenant Governor of Quebec ": null
    },
    {
        "Lise Thibault": "Lise Thibault"
    },
    {
        " to have charges against her dropped. She was being prosecuted by the ": null
    },
    {
        "Attorney General of Quebec": "Ministry Of Justice"
    },
    {
        " for misappropriation of public funds but invoked royal immunity on the basis that the Queen can do no wrong . As per convention, the court did not disclose its reasons for not considering the matter. Thibault later petitioned the ": null
    },
    {
        "Court of Quebec": "Court Of Quebec"
    },
    {
        " for the same motives. Judge St-Cyr again rejected her demand, noting that constitutional law does not grant a lieutenant-governor the same benefits as the Queen and that in her case, royal immunity would only apply to actions involving official state functions, not personal ones.  She was eventually declared guilty and sentenced to 18 months in jail but was granted conditional release after serving six months.        China has consistently claimed that a basic principle of international law is for states and their property to have absolute sovereign immunity. China objects to restrictive sovereign immunity. It is held that a state can waive its immunity by voluntarily stating so, but that should a government intervene in a suit , it should not be viewed as waiver of immunity.  Chinese state-owned companies considered instrumental to the state have claimed sovereign immunity in lawsuits brought against them in foreign courts before. Chinas view is that sovereign immunity is a lawful right and interest that their enterprises are entitled to protect.  Some examples of Chinese state-owned companies that have claimed sovereign immunity in foreign lawsuits are the ": null
    },
    {
        "Aviation Industry Corporation of China ": "Aviation Industry Corporation Of China"
    },
    {
        " and ": null
    },
    {
        "China National Building Material": "China National Building Material"
    },
    {
        ".        Article 13 of the ": null
    },
    {
        "Constitution of Denmark": "Constitution Of Denmark"
    },
    {
        " states: The King shall not be answerable for his actions; his person shall be sacrosanct. The Ministers shall be responsible for the conduct of the government; their responsibility shall be determined by Statute.  Accordingly, the ": null
    },
    {
        "monarch": "Monarchy Of Denmark"
    },
    {
        " cannot be sued in his or her personal capacity. On the other hand, this immunity from lawsuits does not extend to the state as such and article 63 explicitly authorises the courts to judge the executive authority: The courts of justice shall be empowered to decide any question relating to the scope of the executives authority; though any person wishing to question such authority shall not, by taking the case to the courts of justice, avoid temporary compliance with orders given by the executive authority.               The ": null
    },
    {
        "Holy See": "Holy See"
    },
    {
        ", of which the current ": null
    },
    {
        "pope": "Pope"
    },
    {
        " is head , claims sovereign immunity for the pope, supported by many international agreements.       In 2011, the Hong Kong Court of Final Appeal ruled that absolute sovereign immunity applies in Hong Kong, as the Court found that Hong Kong, as a ": null
    },
    {
        "Special Administrative Region": "Special Administrative Region"
    },
    {
        " of China, could not have policies on state immunity that was inconsistent with China. The ruling was an outcome of the Democratic Republic of the Congo v FG Hemisphere Associates case in 2011.      Democratic Republic of the Congo v FG Hemisphere Associates ": null
    },
    {
        "Société nationale délectricité": "Société Nationale Délectricité"
    },
    {
        " defaulted on payments of a debt owed to an energy company, Energoinvest. During arbitration, Energoinvest was awarded damages against the Congolese government and SNEL. This was reassigned by Energoinvest to FG Hemisphere Associates LLC.     FG Hemisphere subsequently learned that the Congolese government entered into a separate joint venture with Chinese companies later, in which the Congolese government would be paid US$221 million in mining entry fees. As a result, FG Hemisphere applied to collect these fees in order to enforce the earlier arbitral award. The Congolese government asserted sovereign immunity in the legal proceedings. This was eventually brought to the Hong Kong Court of Final Appeal, when the Congolese government fought to overturn an earlier Court of Appeal decision which had ruled that:   as restrictive sovereign immunity applied in Hong Kong, the Congolese government had no immunity in commercial proceedings.   if absolute sovereign immunity had applied in Hong Kong, the Congolese government had waived their sovereign immunity rights in this case.     The ": null
    },
    {
        "Hong Kong Court of Final Appeal": "Court Of Final Appeal"
    },
    {
        " ruled 3:2 that the Congolese government had not waived its immunity in the Hong Kong courts, and that as a Special Administrative Region of China, Hong Kong could not have policies on state immunity that was inconsistent with Chinas. Therefore, the doctrine of sovereign immunity applied in Hong Kong should be absolute, and may be invoked when jurisdiction is sought in the foreign court in relation to an application to enforce a foreign judgment or arbitral award, or when execution is sought against assets in the foreign state. This means that sovereign states are absolutely immune to the jurisdiction in Hong Kong courts, including in commercial claims, unless the state waives its immunity. In order to waive immunity, there must be express, unequivocal submission to the jurisdiction of the Hong Kong courts in the face of the court . Claimants should establish that the state party has waived their entitlement to immunity at the relevant stage, before proceedings can occur in court.       According to article 11 of the ": null
    },
    {
        "Constitution of Iceland": "Constitution Of Iceland"
    },
    {
        " the president can only be held accountable and be prosecuted with the consent of parliament.       According to Article 361 ": null
    },
    {
        "Constitution of India": "Constitution Of India"
    },
    {
        " no legal action in the court of law can be taken against ": null
    },
    {
        "President of India": "President Of India"
    },
    {
        " and ": null
    },
    {
        "Governors of states of India": "Governors Of States Of India"
    },
    {
        " as long as that person is holding either office. However, he/she can be impeached and then sued for his/her actions.       In Byrne v Ireland, the ": null
    },
    {
        "Irish Supreme Court": "Supreme Court"
    },
    {
        " declared that sovereign immunity had not survived the creation of the ": null
    },
    {
        "Irish Free State": "Irish Free State"
    },
    {
        " in 1922, and that accordingly the state could be sued for and held vicariously liable for the acts and omissions of its servants and agents. 1 IR 241       According to the ": null
    },
    {
        "Constitution": "Constitution Of Italy"
    },
    {
        ", the ": null
    },
    {
        "President": "President Of Italy"
    },
    {
        " of the ": null
    },
    {
        "Italian Republic": "Italian Republic"
    },
    {
        " is not accountable, and he is not responsible for any act of his office, unless he has committed ": null
    },
    {
        "high treason": "High Treason"
    },
    {
        " or attempted to subvert the Constitution, as stated in Article 90:           The Italian ": null
    },
    {
        "Penal Code": "Penal Code"
    },
    {
        " makes it a ": null
    },
    {
        "criminal offence": "Criminal Offence"
    },
    {
        " to insult the ": null
    },
    {
        "honor": "Honor"
    },
    {
        " and ": null
    },
    {
        "prestige": "Reputation"
    },
    {
        " of the President , and until 2006 it was an offence to publicly give the President responsibility for actions of the ": null
    },
    {
        "Government": "Cabinet Of Italy"
    },
    {
        " .     The Italian Constitutional Court has declared the partial incompatibility with the Italian Constitution of a law that forced courts to delay all trials against the Italian Prime Minister while he is in office. The revised version says that the trial hearings have to be scheduled in agreement between the Judge and the Government.       In ": null
    },
    {
        "Malaysia": "Malaysia"
    },
    {
        ", an ": null
    },
    {
        "amendment to the constitution": "1993 Amendments To The Constitution Of Malaysia"
    },
    {
        " in 1993 made it possible to bring proceedings against the ": null
    },
    {
        "king": "Yang Di-Pertuan Agong"
    },
    {
        " or any ruler of a component state in the Special Court. Prior to 1993, rulers, in their personal capacity, were immune from any proceedings brought against them.        Section 308 of the Nigerian constitution of 1999 provides immunity from court proceedings, i.e., proceedings that will compel their attendance in favour of elected executive officers, namely the President and his vice and the Governors of the states and the deputies. This immunity extends to acts done in their official capacities so that they are not responsible for acts done on behalf of the state. However, this immunity does not extend to acts done in abuse of the powers of their office of which they are liable upon the expiration of their tenure. It is important to note that the judiciary has absolute immunity for actions decisions taken in their official capacity.       Article 5 of the ": null
    },
    {
        "Constitution of Norway": "Constitution Of Norway"
    },
    {
        " states: The Kings person is sacred; he cannot be censured or accused. The responsibility   rests with his Council.    Accordingly, the ": null
    },
    {
        "monarch": "Monarchy Of Norway"
    },
    {
        " cannot be prosecuted or sued in his or her personal capacity, but this immunity does not extend to the state as such. Neither does immunity extend to the monarch in his capacity as an owner or stakeholder in real property, or as an employer, provided that the suit does not allege personal responsibility for the monarch. Fliflet: Grunnloven - kommentarutgave, p. 98       Article XVI, Section 3 of the ": null
    },
    {
        "Philippines Constitution": "Philippines Constitution"
    },
    {
        " states: The State may not be sued without its consent.        The ": null
    },
    {
        "Spanish monarch": "Monarchy Of Spain"
    },
    {
        " is personally immune from prosecution for acts committed by government ministers in the Kings name, according to Title II, Section 56, Subsection 3 of the ": null
    },
    {
        "Spanish Constitution of 1978": "Spanish Constitution Of 1978"
    },
    {
        ".            At the time of the June 2014 abdication of ": null
    },
    {
        "King Juan Carlos": "King Juan Carlos"
    },
    {
        " the Spanish constitution did not state whether an abdicated monarch retains his legal immunity,  but the government was planning to make changes to allow this.  Legislation has been passed, although unlike his previous immunity, the new legislation does not completely shield the former sovereign. Juan Carlos must answer to the supreme court, in a similar type of protection afforded to many high-ranking civil servants and politicians in Spain. The legislation stipulates that all outstanding legal matters relating to the former king be suspended and passed immediately to the supreme court.        By the ": null
    },
    {
        "Constitution of Sri Lanka": "Constitution Of Sri Lanka"
    },
    {
        ", the ": null
    },
    {
        "President of Sri Lanka": "President Of Sri Lanka"
    },
    {
        " has sovereign immunity .       Chapter 5, Article 8 of the ": null
    },
    {
        "Swedish Constitution": "Constitution Of Sweden"
    },
    {
        " states: The ": null
    },
    {
        "King": "Monarchy Of Sweden"
    },
    {
        " or Queen   who is Head of State cannot be prosecuted for his or her actions. Nor can a Regent be prosecuted for his or her actions as Head of State. This only concerns the King as a private person, since he does not appoint the government, nor do any public officials act in his name. It does not concern other members of the Royal Family, except in such cases as they are exercising the office of Regent when the King is unable to serve. It is a disputed matter among Swedish constitutional lawyers whether the article also implies that the King is immune against lawsuits in civil cases, which do not involve prosecution.       In Singapore, state immunities are codified in the , which closely resembles the United Kingdoms State Immunity Act 1978. Singapores State Immunity Act has phrases identical to that of Section 9 of United Kingdoms State Immunity Act, and does not allow a foreign state, which has agreed to submit a dispute to arbitration, to claim jurisdictional immunity in judicial proceedings relating to the agreed arbitration, i.e. where a State has agreed in writing to submit a dispute which has arisen, or may arise, to arbitration, the state is not immune as respects proceedings in the courts in Singapore which relate to the arbitration .     The ": null
    },
    {
        "President of Singapore": "President Of Singapore"
    },
    {
        " does to a certain extent have sovereign immunity subjected to clause 22k.           Historically, the general rule in the United Kingdom has been that ": null
    },
    {
        "the Crown": "The Crown"
    },
    {
        " has never been able to be prosecuted or proceeded against in either criminal or civil cases.  The only means by which civil proceedings could be brought were:   by way of ": null
    },
    {
        "petition of right": "Petition Of Right"
    },
    {
        ", which was dependent on the grant of the royal ": null
    },
    {
        "fiat": "Wikt:Fiat"
    },
    {
        " ;   by suits against the ": null
    },
    {
        "Attorney General": "Attorney General"
    },
    {
        " for a declaration; or   by actions against ministers or government departments where an Act of Parliament had specifically provided that immunity be waived.     The position was drastically altered by the ": null
    },
    {
        "Crown Proceedings Act 1947": "Crown Proceedings Act 1947"
    },
    {
        " which made the Crown liable as of right in proceedings where it was previously only liable by virtue of a grant of a fiat.  With limited exceptions, this had the effect of allowing proceedings for ": null
    },
    {
        "tort": "Tort"
    },
    {
        " and ": null
    },
    {
        "contract": "Contract"
    },
    {
        " to be brought against the Crown. Proceedings to bring writs of ": null
    },
    {
        "mandamus": "Mandamus"
    },
    {
        " and ": null
    },
    {
        "prohibition": "Prohibition"
    },
    {
        " were always available against ": null
    },
    {
        "ministers": "Minister"
    },
    {
        ", because their actions derive from the ": null
    },
    {
        "royal prerogative": "Royal Prerogative"
    },
    {
        ".     Criminal proceedings are still prohibited from being brought against ": null
    },
    {
        "Her Majestys Government": "Her Majestys Government"
    },
    {
        " unless expressly permitted by the Crown Proceedings Act.      As the Crown Proceedings Act only affected the law in respect of acts carried on by or on behalf of the British government, the monarch remains personally immune from criminal and civil actions.  However, civil proceedings can, in theory, still be brought using the two original mechanisms outlined above – by petition of right or by suit against the Attorney General for a declaration.        The monarch is immune from arrest in all cases; members of the ": null
    },
    {
        "royal household": "Royal Household"
    },
    {
        " are immune from arrest in civil proceedings.  No arrest can be made in the monarchs presence , or within the verges of a royal palace. When a royal palace is used as a residence , judicial processes cannot be executed within that palace.      The monarchs goods cannot be taken under a ": null
    },
    {
        "writ of execution": "Writ Of Execution"
    },
    {
        ", nor can ": null
    },
    {
        "distress": "Distraint"
    },
    {
        " be levied on land in their possession. ": null
    },
    {
        "Chattels": "Personal Property"
    },
    {
        " owned by the Crown, but present on anothers land, cannot be taken in execution or for distress. The Crown is not subject to ": null
    },
    {
        "foreclosure": "Foreclosure"
    },
    {
        ".            In United States law, state, federal and tribal governments generally enjoy immunity from lawsuits.  Local governments typically enjoy immunity from some forms of suit, particularly in ": null
    },
    {
        "tort": "Tort"
    },
    {
        ".     In the US, sovereign immunity falls into two categories:    Absolute immunity: Absolute immunity applies to acts that, if subject to challenge, would significantly affect the operation of government. See, e.g., ,  pursuant to which a government actor may not be sued for the allegedly wrongful act, even if that person acted maliciously or in bad faith; and   Qualified immunity: pursuant to which a government actor is shielded from liability only if specific conditions are met, as specified in statute or case law.    In some situations, sovereign immunity may have been waived by law.        The ": null
    },
    {
        "federal government": "Federal Government Of The United States"
    },
    {
        " has sovereign immunity and may not be sued anywhere in the United States unless it has waived its immunity or consented to suit. The United States has waived sovereign immunity to a limited extent, mainly through the ": null
    },
    {
        "Federal Tort Claims Act": "Federal Tort Claims Act"
    },
    {
        ", which waives the immunity if a tortious act of a federal employee causes damage, and the ": null
    },
    {
        "Tucker Act": "Tucker Act"
    },
    {
        ", which waives the immunity over claims arising out of contracts to which the federal government is a party.  The United States as a sovereign is immune from suit unless it unequivocally consents to being sued. United States v. Mitchell, 445 U.S. 535, 538 The United States Supreme Court in Price v. United States observed: It is an axiom of our jurisprudence. The government is not liable to suit unless it consents thereto, and its liability in suit cannot be extended beyond the plain language of the statute authorizing it. Price v. United States, 174 U.S. 373, 375-76 .       In  Hans v. Louisiana  , the ": null
    },
    {
        "Supreme Court of the United States": "Supreme Court Of The United States"
    },
    {
        " held that the ": null
    },
    {
        "Eleventh Amendment": "Eleventh Amendment To The United States Constitution"
    },
    {
        " re-affirms that states possess sovereign immunity and are therefore generally immune from being sued in federal court without their consent. In later cases, the Supreme Court has strengthened state sovereign immunity considerably. In  Blatchford v. Native Village of Noatak  , the court explained that          In  Alden v. Maine  , the Court explained that while it has        Writing for the Court in Alden, Justice ": null
    },
    {
        "Anthony Kennedy": "Anthony Kennedy"
    },
    {
        " argued that in view of this, and given the limited nature of congressional power delegated by the original unamended Constitution, the court could not conclude that the specific Article I powers delegated to Congress necessarily include, by virtue of the Necessary and Proper Clause or otherwise, the incidental authority to subject the States to private suits as a means of achieving objectives otherwise within the scope of the enumerated powers .     However, a consequence of Courts recognition of preratification sovereignty as the source of immunity from suit is that only States and arms of the State possess immunity from suits authorized by federal law .  Northern Insurance Company of New York v. Chatham County  . Thus, cities and municipalities lack sovereign immunity,  Jinks v. Richland County  , and counties are not generally considered to have sovereign immunity, even when they exercise a slice of state power.  Lake Country Estates, Inc. v. Tahoe Regional Planning Agency  . Nor are school districts, per  Mt. Healthy City School District Board of Education v. Doyle  .     Additionally, Congress can abrogate state sovereign immunity when it acts pursuant to powers delegated to it by any amendments ratified after the Eleventh Amendment. The ": null
    },
    {
        "abrogation doctrine": "Abrogation Doctrine"
    },
    {
        ", established by the Supreme Court in  Fitzpatrick v. Bitzer  , is most often implicated in cases that involve Section 5 of the ": null
    },
    {
        "Fourteenth Amendment": "Fourteenth Amendment To The United States Constitution"
    }
]