[
    {
        "   Spacecraft propulsion is any method used to accelerate ": null
    },
    {
        "spacecraft": "Spacecraft"
    },
    {
        " and artificial ": null
    },
    {
        "satellites": "Satellite"
    },
    {
        ". Space propulsion or in-space propulsion exclusively deals with propulsion systems used in the vacuum of space and should not be confused with ": null
    },
    {
        "launch vehicles": "Launch Vehicle"
    },
    {
        ". Several methods, both pragmatic and hypothetical, have been developed each having its own drawbacks and advantages.     Most satellites have simple reliable chemical thrusters  or ": null
    },
    {
        "resistojet rockets": "Resistojet Rocket"
    },
    {
        " for ": null
    },
    {
        "orbital station-keeping": "Orbital Station-Keeping"
    },
    {
        " and some use ": null
    },
    {
        "momentum wheels": "Momentum Wheel"
    },
    {
        " for ": null
    },
    {
        "attitude control": "Attitude Control"
    },
    {
        ". Soviet bloc satellites have used ": null
    },
    {
        "electric propulsion": "Electrically Powered Spacecraft Propulsion"
    },
    {
        " for decades, and newer Western geo-orbiting spacecraft are starting to use them for north-south station-keeping and orbit raising. Interplanetary vehicles mostly use chemical rockets as well, although a few have used ": null
    },
    {
        "ion thrusters": "Ion Thruster"
    },
    {
        " and ": null
    },
    {
        "Hall-effect thrusters": "Hall-Effect Thruster"
    },
    {
        "  to great success.          Artificial satellites are first ": null
    },
    {
        "launched": "Rocket Launch"
    },
    {
        " into the desired altitude by conventional liquid/solid propelled rockets after which the satellite may use onboard propulsion systems for orbital stationkeeping. Once in the desired orbit, they often need some form of ": null
    },
    {
        "attitude control": "Attitude Control"
    },
    {
        " so that they are correctly pointed with respect to the ": null
    },
    {
        "Earth": "Earth"
    },
    {
        ", the ": null
    },
    {
        "Sun": "Sun"
    },
    {
        ", and possibly some ": null
    },
    {
        "astronomical": "Astronomy"
    },
    {
        " object of interest.  They are also subject to ": null
    },
    {
        "drag": "Atmospheric Drag"
    },
    {
        " from the thin ": null
    },
    {
        "atmosphere": "Earths Atmosphere"
    },
    {
        ", so that to stay in orbit for a long period of time some form of propulsion is occasionally necessary to make small corrections .  Many satellites need to be moved from one orbit to another from time to time, and this also requires propulsion.  A satellites useful life is usually over once it has exhausted its ability to adjust its orbit.     For ": null
    },
    {
        "interplanetary travel": "Interplanetary Travel"
    },
    {
        ", a spacecraft can use its engines to leave Earths orbit. It is not explicitly necessary as the initial boost given by the rocket, gravity slingshot, monopropellant/bipropellent attitude control propulsion system are enough for the exploration of the solar system . Once it has done so, it must somehow make its way to its destination. Current interplanetary spacecraft do this with a series of short-term trajectory adjustments.  In between these adjustments, the spacecraft simply moves along its trajectory with a constant velocity. The most fuel-efficient means to move from one circular orbit to another is with a ": null
    },
    {
        "Hohmann transfer orbit": "Hohmann Transfer Orbit"
    },
    {
        "thrust": "Thrust"
    },
    {
        " in the direction of motion accelerates or decelerates the spacecraft into an elliptical orbit around the Sun which is tangential to its previous orbit and also to the orbit of its destination. The spacecraft falls freely along this elliptical orbit until it reaches its destination, where another short period of thrust accelerates or decelerates it to match the orbit of its destination.  Special methods such as ": null
    },
    {
        "aerobraking": "Aerobraking"
    },
    {
        " or aerocapture are sometimes used for this final orbital adjustment.         Some spacecraft propulsion methods such as ": null
    },
    {
        "solar sails": "Solar Sail"
    },
    {
        " provide very low but inexhaustible thrust;  an interplanetary vehicle using one of these methods would follow a rather different trajectory, either constantly thrusting against its direction of motion in order to decrease its distance from the Sun or constantly thrusting along its direction of motion to increase its distance from the Sun. The concept has been successfully tested by the Japanese ": null
    },
    {
        "IKAROS": "Ikaros"
    },
    {
        " solar sail spacecraft.     No spacecraft capable of short duration ": null
    },
    {
        "interstellar travel": "Interstellar Travel"
    },
    {
        " has yet been built, but many hypothetical designs have been discussed. Because interstellar distances are very great, a tremendous velocity is needed to get a spacecraft to its destination in a reasonable amount of time. Acquiring such a velocity on launch and getting rid of it on arrival remains a formidable challenge for spacecraft designers.          When in space, the purpose of a ": null
    },
    {
        "propulsion system": "Propulsion System"
    },
    {
        " is to change the velocity, or v, of a spacecraft. Because this is more difficult for more massive spacecrafts, designers generally discuss spacecraft performance in amount of change in momentum per unit of propellant consumed also called ": null
    },
    {
        "specific impulse": "Specific Impulse"
    },
    {
        ".  Higher the specific impulse, better the efficiency. Ion propulsion engines have high specific impulse and low thrust  whereas chemical rockets like ": null
    },
    {
        "monopropellant": "Monopropellant Rocket"
    },
    {
        " or ": null
    },
    {
        "bipropellant": "Bipropellant"
    },
    {
        " rocket engines have a low specific impulse but high thrust  .     When launching a spacecraft from Earth, a propulsion method must overcome a higher ": null
    },
    {
        "gravitational": "Gravity Drag"
    },
    {
        " pull to provide a positive net acceleration.    In orbit, any additional impulse, even very tiny, will result in a change in the orbit path.     1i.e. acceleration in the tangential/opposite in tangential directionspespneM+PP  vve12ee  vv e12  m v212km/sskgGJJ/kg                             ": null
    }
]