[
    {
        "      In ": null
    },
    {
        "physics": "Physics"
    },
    {
        ", spacetime is any ": null
    },
    {
        "mathematical model": "Mathematical Model"
    },
    {
        " which fuses the ": null
    },
    {
        "three dimensions of space": "Three-Dimensional Space"
    },
    {
        " and the one ": null
    },
    {
        "dimension": "Dimension"
    },
    {
        " of ": null
    },
    {
        "time": "Time"
    },
    {
        " into a single ": null
    },
    {
        "four-dimensional": "Four-Dimensional"
    },
    {
        " continuum": "Continuum"
    },
    {
        ". ": null
    },
    {
        "Spacetime diagrams": "Minkowski Diagram"
    },
    {
        " can be used to visualize ": null
    },
    {
        "relativistic": "Special Relativity"
    },
    {
        " effects, such as why different observers perceive where and when events occur differently.     Until the 20th century, it was assumed that the three-dimensional geometry of the universe was independent of one-dimensional time. However, in 1905, ": null
    },
    {
        "Albert Einstein": "Albert Einstein"
    },
    {
        " based ": null
    },
    {
        "his seminal work on special relativity": "Wikisource:Translation:On The Electrodynamics Of Moving Bodies"
    },
    {
        " on two postulates:     The laws of physics are ": null
    },
    {
        "invariant": "Invariant"
    },
    {
        " in all ": null
    },
    {
        "inertial systems": "Inertial Frame Of Reference"
    },
    {
        "   The ": null
    },
    {
        "speed of light": "Speed Of Light"
    },
    {
        " in a ": null
    },
    {
        "vacuum": "Vacuum"
    },
    {
        " is the same for all observers, regardless of the motion of the light source.     The logical consequence of taking these postulates together is the inseparable joining together of the four dimensions—hitherto assumed as independent—of space and time. Many counterintuitive consequences emerge: in addition to being independent of the motion of the light source, the speed of light has the same speed regardless of the frame of reference in which it is measured; the distances and even temporal ordering of pairs of events change when measured in different ": null
    },
    {
        "inertial frames of reference": "Inertial Frame Of Reference"
    },
    {
        " ; and the linear additivity of velocities no longer holds true.     Einstein framed his theory in terms of ": null
    },
    {
        "kinematics": "Kinematics"
    },
    {
        " . His theory was a breakthrough advance over ": null
    },
    {
        "Lorentzs 1904 theory of electromagnetic phenomena": "History Of Special Relativitylorentzs 1904 Model"
    },
    {
        " and ": null
    },
    {
        "Poincarés electrodynamic theory": "History Of Special Relativitypoincarés Dynamics Of The Electron"
    },
    {
        ". Although these theories included equations identical to those that Einstein introduced , they were essentially ad  hoc models proposed to explain the results of various experiments—including the famous ": null
    },
    {
        "Michelson–Morley interferometer experiment": "Michelson–Morley Experiment"
    },
    {
        "—that were extremely difficult to fit into existing paradigms.     In 1908, ": null
    },
    {
        "Hermann Minkowski": "Hermann Minkowski"
    },
    {
        "—once one of the math professors of a young Einstein in Zürich—presented a geometric interpretation of special relativity that fused time and the three spatial dimensions of space into a single four-dimensional continuum now known as ": null
    },
    {
        "Minkowski space": "Minkowski Space"
    },
    {
        ". A key feature of this interpretation is the formal definition of the spacetime interval. Although measurements of distance and time between ": null
    },
    {
        "events": "Event"
    },
    {
        " differ for measurements made in different reference frames, the spacetime interval is independent of the inertial frame of reference in which they are recorded.     Minkowskis geometric interpretation of relativity was to prove vital to Einsteins development of his 1915 ": null
    },
    {
        "general theory of relativity": "General Relativity"
    },
    {
        ", wherein he showed how ": null
    },
    {
        "mass and energy": "Stress–Energy Tensor"
    },
    {
        " curve": "Riemann Curvature Tensor"
    },
    {
        " flat spacetime into a ": null
    },
    {
        "pseudo-Riemannian manifold": "Pseudo-Riemannian Manifold"
    },
    {
        ".                             Non-relativistic ": null
    },
    {
        "classical mechanics": "Classical Mechanics"
    },
    {
        " treats ": null
    },
    {
        "time": "Time"
    },
    {
        " as a universal quantity of measurement which is uniform throughout space, and separate from space. Classical mechanics assumes that time has a constant rate of passage, independent of the ": null
    },
    {
        "observers": "Observer"
    },
    {
        " state of ": null
    },
    {
        "motion": "Motion"
    },
    {
        ", or anything external.  Furthermore, it assumes that space is Euclidean; it assumes that space follows the geometry of common sense.      In the context of ": null
    },
    {
        "special relativity": "Special Relativity"
    },
    {
        ", time cannot be separated from the three dimensions of space, because the observed rate at which time passes for an object depends on the objects ": null
    },
    {
        "velocity": "Velocity"
    },
    {
        " relative to the observer. ": null
    },
    {
        "General relativity": "General Relativity"
    },
    {
        " also provides an explanation of how ": null
    },
    {
        "gravitational fields": "Gravitational Fields"
    },
    {
        " can slow the passage of time for an object as seen by an observer outside the field.     In ordinary space, a position is specified by three numbers, known as ": null
    },
    {
        "dimensions": "Dimensionin Physics"
    },
    {
        ". In the ": null
    },
    {
        "Cartesian coordinate system": "Cartesian Coordinate System"
    },
    {
        ", these are called x, y, and z. A position in spacetime is called an event, and requires four numbers to be specified: the three-dimensional location in space, plus the position in time . Spacetime is thus ": null
    },
    {
        "four dimensional": "Four-Dimensional Space"
    },
    {
        ". An event is something that happens instantaneously at a single point in spacetime, represented by a set of coordinates x, y, z and t.     The word event used in relativity should not be confused with the use of the word event in normal conversation, where it might refer to an event as something such as a concert, sporting event, or a battle. These are not mathematical events in the way the word is used in relativity, because they have finite durations and extents. Unlike the analogies used to explain events, such as firecrackers or lightning bolts, mathematical events have zero duration and represent a single point in spacetime.     The path of a particle through spacetime can be considered to be a succession of events. The series of events can be linked together to form a line which represents a particles progress through spacetime. That line is called the particles world line.      Mathematically, spacetime is a  manifold , which is to say, it appears locally flat near each point in the same way that, at small enough scales, a globe appears flat.  An extremely large scale factor, c  relates distances measured in space with distances measured in time. The magnitude of this scale factor , along with the fact that spacetime is a manifold, implies that at ordinary, non-relativistic speeds and at ordinary, human-scale distances, there is little that humans might observe which is noticeably different from what they might observe if the world were Euclidean. It was only with the advent of sensitive scientific measurements in the mid-1800s, such as the ": null
    },
    {
        "Fizeau experiment": "Fizeau Experiment"
    },
    {
        " and the ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        ", that puzzling discrepancies began to be noted between observation versus predictions based on the implicit assumption of Euclidean space.              In special relativity, an observer will, in most cases, mean a frame of reference from which a set of objects or events are being measured. This usage differs significantly from the ordinary English meaning of the term. Reference frames are inherently nonlocal constructs, and according to this usage of the term, it does not make sense to speak of an observer as having a location. In Fig.  1 & 8209;1, imagine that the frame under consideration is equipped with a dense lattice of clocks, synchronized within this reference frame, that extends indefinitely throughout the three dimensions of space. Any specific location within the lattice is not important. The latticework of clocks is used to determine the time and position of events taking place within the whole frame. The term observer refers to the entire ensemble of clocks associated with one inertial frame of reference.   In this idealized case, every point in space has a clock associated with it, and thus the clocks register each event instantly, with no time delay between an event and its recording. A real observer, however, will see a delay between the emission of a signal and its detection due to the speed of light. To synchronize the clocks, in the ": null
    },
    {
        "data reduction": "Data Reduction"
    },
    {
        " following an experiment, the time when a signal is received will be corrected to reflect its actual time were it to have been recorded by an idealized lattice of clocks.     In many books on special relativity, especially older ones, the word observer is used in the more ordinary sense of the word. It is usually clear from context which meaning has been adopted.     Physicists distinguish between what one measures or observes , versus what one visually sees without such corrections. Failure to understand ": null
    },
    {
        "the difference between what one measures/observes versus what one sees": "Special Relativitymeasurement Versus Visual Appearance"
    },
    {
        " is the source of much error among beginning students of relativity.                 By the mid-1800s, various experiments such as the observation of the ": null
    },
    {
        "Arago spot": "Arago Spot"
    },
    {
        " and ": null
    },
    {
        "differential measurements of the speed of light in air versus water": "Fizeau–Foucault Apparatus"
    },
    {
        " were considered to have proven the wave nature of light as opposed to a ": null
    },
    {
        "corpuscular theory": "Corpuscular Theory Of Light"
    },
    {
        ".  Propagation of waves was then assumed to require the existence of a waving medium; in the case of light waves, this was considered to be a hypothetical ": null
    },
    {
        "luminiferous aether": "Luminiferous Aether"
    },
    {
        ". luminiferous from the Latin lumen, light, + ferens, carrying; aether from the Greek αἰθήρ , pure air, clear sky However, the various attempts to establish the properties of this hypothetical medium yielded contradictory results. For example, the ": null
    },
    {
        "Fizeau experiment": "Fizeau Experiment"
    },
    {
        " of 1851 demonstrated that the speed of light in flowing water was less than the sum of the speed of light in air plus the speed of the water by an amount dependent on the waters index of refraction. Among other issues, the dependence of the partial ": null
    },
    {
        "aether-dragging": "Aether-Dragging"
    },
    {
        " implied by this experiment on the index of refraction led to the unpalatable conclusion that aether simultaneously flows at different speeds for different colors of light.  The famous ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        " of 1887 showed no differential influence of Earths motions through the hypothetical aether on the speed of light, and the most likely explanation, complete aether dragging, was in conflict with the observation of ": null
    },
    {
        "stellar aberration": "Stellar Aberration"
    },
    {
        ".     ": null
    },
    {
        "George Francis FitzGerald": "George Francis Fitzgerald"
    },
    {
        " in 1889, and ": null
    },
    {
        "Hendrik Lorentz": "Hendrik Lorentz"
    },
    {
        " in 1892, independently proposed that material bodies traveling through the fixed aether were physically affected by their passage, contracting in the direction of motion by an amount that was exactly what was necessary to explain the negative results of the Michelson-Morley experiment.     By 1904, Lorentz had expanded his theory such that he had arrived at equations formally identical with those that Einstein were to derive later , but with a fundamentally different interpretation. As a theory of ": null
    },
    {
        "dynamics": "Dynamics"
    },
    {
        " , his theory assumed actual physical deformations of the physical constituents of matter.   Lorentzs equations predicted a quantity that he called local time, with which he could explain the ": null
    },
    {
        "aberration of light": "Aberration Of Light"
    },
    {
        ", the Fizeau experiment and other phenomena. However, Lorentz considered local time to be only an auxiliary mathematical tool, a trick as it were, to simplify the transformation from one system into another.     Other physicists and mathematicians at the turn of the century came close to arriving at what is currently known as spacetime. Einstein himself noted, that with so many people unraveling separate pieces of the puzzle, the special theory of relativity, if we regard its development in retrospect, was ripe for discovery in 1905.         An important example is ": null
    },
    {
        "Henri Poincaré": "Henri Poincaré"
    },
    {
        ",    who in 1898 argued that the simultaneity of two events is a matter of convention.   In 1900, he recognized that Lorentzs local time is actually what is indicated by moving clocks by applying an explicitly operational definition of clock synchronization assuming constant light speed. In 1900 and 1904, he suggested the inherent undetectability of the aether by emphasizing the validity of what he called the ": null
    },
    {
        "principle of relativity": "Principle Of Relativity"
    },
    {
        ", and in 1905/1906  he mathematically perfected Lorentzs theory of electrons in order to bring it into accordance with the postulate of relativity. While discussing various hypotheses on Lorentz invariant gravitation, he introduced the innovative concept of a 4-dimensional space-time by defining various ": null
    },
    {
        "four vector": "Four Vector"
    },
    {
        "s, namely ": null
    },
    {
        "four-position": "Four-Position"
    },
    {
        ", ": null
    },
    {
        "four-velocity": "Four-Velocity"
    },
    {
        ", and ": null
    },
    {
        "four-force": "Four-Force"
    },
    {
        ".  He did not pursue the 4-dimensional formalism in subsequent papers, however, stating that this line of research seemed to entail great pain for limited profit , ultimately concluding that three-dimensional language seems the best suited to the description of our world .  Furthermore, even as late as 1909, Poincaré continued to believe in the dynamical interpretation of the Lorentz transform.  For these and other reasons, most historians of science argue that Poincaré did not invent what is now called special relativity.     In 1905, Einstein introduced special relativity in its modern understanding as a theory of space and time. While his results are mathematically equivalent to those of Lorentz and Poincaré, it was Einstein who showed that the Lorentz transformations are not the result of interactions between matter and aether, but rather concern the nature of space and time itself. He obtained all of his results by recognizing that the entire theory can be built upon two postulates: The principle of relativity and the principle of the constancy of light speed.     Einstein performed his analysis in terms of ": null
    },
    {
        "kinematics": "Kinematics"
    },
    {
        " rather than dynamics. His seminal work introducing the subject was filled with vivid imagery involving the exchange of light signals between clocks in motion, careful measurements of the lengths of moving rods, and other such examples.       In addition, Einstein in 1905 superseded previous attempts of an ": null
    },
    {
        "electromagnetic mass": "Electromagnetic Mass"
    },
    {
        "-energy relation by introducing the general ": null
    },
    {
        "equivalence of mass and energy": "Equivalence Of Mass And Energy"
    },
    {
        ", which was instrumental for his subsequent formulation of the ": null
    },
    {
        "equivalence principle": "Equivalence Principle"
    },
    {
        " in 1907, which declares the equivalence of inertial and gravitational mass. By using the mass-energy equivalence, Einstein showed, in addition, that the gravitational mass of a body is proportional to its energy content, which was one of early results in developing ": null
    },
    {
        "general relativity": "General Relativity"
    },
    {
        ". While it would appear that he did not at first think geometrically about spacetime,   in the further development of general relativity Einstein fully incorporated the spacetime formalism.     When Einstein published in 1905, another of his competitors, his former mathematics professor ": null
    },
    {
        "Hermann Minkowski": "Hermann Minkowski"
    },
    {
        ", had also arrived at most of the basic elements of special relativity. ": null
    },
    {
        "Max Born": "Max Born"
    },
    {
        " recounted a meeting he had made with Minkowski, seeking to be Minkowskis student/collaborator:           Minkowski had been concerned with the state of electrodynamics after Michelsons disruptive experiments at least since the summer of 1905, when Minkowski and ": null
    },
    {
        "David Hilbert": "David Hilbert"
    },
    {
        " led an advanced seminar attended by notable physicists of the time to study the papers of Lorentz, Poincaré et al. However, it is not at all clear when Minkowski began to formulate the geometric formulation of special relativity that was to bear his name, or to which extent he was influenced by Poincarés four-dimensional interpretation of the Lorentz transformation. Nor is it clear if he ever fully appreciated Einsteins critical contribution to the understanding of the Lorentz transformations, thinking of Einsteins work as being an extension of Lorentzs work.         On 5 November 1907 , Minkowski introduced his geometric interpretation of spacetime in a lecture to the Göttingen Mathematical society with the title, The Relativity Principle . On 21 September 1908, Minkowski presented his famous talk, Space and Time ,  to the German Society of Scientists and Physicians. The opening words of Space and Time include Minkowskis famous statement that Henceforth, space for itself, and time for itself shall completely reduce to a mere shadow, and only some sort of union of the two shall preserve independence. Space and Time included the first public presentation of spacetime diagrams , and included a remarkable demonstration that the concept of the invariant interval , along with the empirical observation that the speed of light is finite, allows derivation of the entirety of special relativity.     The spacetime concept and the Lorentz group are closely connected to certain types of sphere , hyperbolic , or conformal geometries and their transformation groups already developed in the 19th century, in which invariant intervals analogous to the spacetime interval are used.     Einstein, for his part, was initially dismissive of Minkowskis geometric interpretation of special relativity, regarding it as überflüssige Gelehrsamkeit . However, in order to complete his search for general relativity that started in 1907, the geometric interpretation of relativity proved to be vital, and in 1916, Einstein fully acknowledged his indebtedness to Minkowski, whose interpretation greatly facilitated the transition to general relativity. Since there are other types of spacetime, such as the curved spacetime of general relativity, the spacetime of special relativity is today known as Minkowski spacetime.             In three-dimensions, the distance   between two points can be defined using the Pythagorean theorem :   : 2 2 + 2 + 2   Although two viewers may measure the x,y, and z position of the two points using different coordinate systems, the distance between the points will be the same for both . The distance is invariant .     In special relativity, however, the distance between two points is no longer the same if measured by two different observers when one of the observers is moving, because of Lorentz contraction . The situation is even more complicated if the two points are separated in time as well as in space. For example, if one observer sees two events occur at the same place, but at different times, a person moving with respect to the first observer will see the two events occurring at different places, because they are stationary, and the position of the event is receding or approaching. Thus, a different measure must be used to measure the effective distance between two events.     In four-dimensional spacetime, the analog to distance is the interval. Although time comes in as a fourth dimension, it is treated differently than the spatial dimensions. Minkowski space hence differs in important respects from four-dimensional Euclidean space . The fundamental reason for merging space and time into spacetime is that space and time are separately not invariant, which is to say that, under the proper conditions, different observers will disagree on the length of time between two events or the distance between the two events . But special relativity provides a new invariant, called the spacetime interval, which combines distances in space and in time. All observers who measure time and distance carefully will find the same spacetime interval between any two events. Suppose an observer measures two events as being separated in time by   t and a spatial distance   x . Then the spacetime interval 2 between the two events that are separated by a distance   in space and by   c  t in the ct -coordinate is:     : 2 2 - 2 , or for three space dimensions, 2 2 - 2 - 2 - 2     The constant   , the speed of light, converts the units used to measure time into units used to measure distance .     Note on nomenclature: Although for brevity, one frequently sees interval expressions expressed without deltas, including in most of the following discussion, it should be understood that in general, x means   , etc. We are always concerned with differences of spatial or temporal coordinate values belonging to two events, and since there is no preferred origin, single coordinate values have no essential meaning.     thu   The equation above is similar to the Pythagorean theorem, except with a minus sign between the 2 and the x2 terms. The spacetime interval is the quantity s2 , not s itself. The reason is that unlike distances in Euclidean geometry, intervals in Minkowski spacetime can be negative. Rather than deal with square roots of negative numbers, physicists customarily regard s2 as a distinct symbol in itself, rather than the square of something.     Because of the minus sign, the spacetime interval between two distinct events can be zero. If s2 is positive, the spacetime interval is timelike, meaning that two events are separated by more time than space. If s2 is negative, the spacetime interval is spacelike, meaning that two events are separated by more space than time. Spacetime intervals are zero when x       t . In other words, the spacetime interval between two events on the world line of something moving at the speed of light is zero. Such an interval is termed lightlike or null. A photon arriving in our eye from a distant star will not have aged, despite having spent years in its passage.     A spacetime diagram is typically drawn with only a single space and a single time coordinate. Fig.  2 & 8209;1 presents a spacetime diagram illustrating the world lines of two photons, A and B, originating from the same event and going in opposite directions. In addition, C illustrates the world line of a slower-than-light-speed object. The vertical time coordinate is scaled by   so that it has the same units as the horizontal space coordinate. Since photons travel at the speed of light, their world lines have a slope of ±1. In other words, every meter that a photon travels to the left or right requires approximately 3.3 nanoseconds of time.     Note on nomenclature: There are two sign conventions in use in the relativity literature:   : s2 2 - x2 - y2 - z2   : and   : s2 - 2 + x2 + y2 + z2     These sign conventions are associated with the metric signature s and A minor variation is to place the time coordinate last rather than first. Both conventions are widely used within the field of study.           thu   thu   To gain insight in how spacetime coordinates measured by observers in different reference frames compare with each other, it is useful to work with a simplified setup with frames in a standard configuration. With care, this allows simplification of the math with no loss of generality in the conclusions that are reached. In Fig.  2 & 8209;2, two Galilean reference frame s are displayed in relative motion. Frame S belongs to a first observer O, and frame S′ belongs to a second observer O′.   The x, y, z axes of frame S are oriented parallel to the respective primed axes of frame S′.   Frame S′ moves in the x-direction of frame S with a constant velocity v as measured in frame S.   The origins of frames S and S′ are coincident when time t 0 for frame S and t′ 0 for frame S′.     Fig.  2 & 8209;3a redraws Fig.  2 & 8209;2 in a different orientation. Fig.  2 & 8209;3b illustrates a spacetime diagram from the viewpoint of observer O. Since S and S′ are in standard configuration, their origins coincide at times t    0 in frame S and t′    0 in frame S. The ct′ axis passes through the events in frame S′ which have x′    0. But the points with x′    0 are moving in the x-direction of frame S with velocity v, so that they are not coincident with the ct axis at any time other than zero. Therefore, the ct′ axis is tilted with respect to the ct axis by an angle θ given by     :     v/c .     The x′ axis is also tilted with respect to the x axis. To determine the angle of this tilt, we recall that the slope of the world line of a light pulse is always  ±1. Fig.  2 & 8209;3c presents a spacetime diagram from the viewpoint of observer O′. Event P represents the emission of a light pulse at x′    0, ct′    −a. The pulse is reflected from a mirror situated a distance a from the light source , and returns to the light source at x′    0,  ct′    a .     The same events P, Q, R are plotted in Fig.  2 & 8209;3b in the frame of observer O. The light paths have slopes    1 and  −1 so that △PQR forms a right triangle. Since OP    OQ    OR, the angle between x′ and x must also be θ.     While the rest frame has space and time axes that meet at right angles, the moving frame is drawn with axes that meet at an acute angle. The frames are actually equivalent. The asymmetry is due to unavoidable distortions in how spacetime coordinates can map onto a Cartesian plane , and should be considered no stranger than the manner in which, on a Mercator projection of the Earth, the relative sizes of land masses near the poles are highly exaggerated relative to land masses near the Equator.               thu   In Fig. 2-4, event  O is at the origin of a spacetime diagram, and the two diagonal lines represent all events that have zero spacetime interval with respect to the origin event. These two lines form what is called the light cone of the event  O, since adding a second spatial dimension makes the appearance that of two right circular cones meeting with their apices at  O. One cone extends into the future .     thu   A light cone divides spacetime into separate regions with respect to its apex. The interior of the future light cone consists of all events that are separated from the apex by more time than necessary to cross their spatial distance at lightspeed; these events comprise the timelike future of the event  O. Likewise, the timelike past comprises the interior events of the past light cone. So in timelike intervals & Delta;ct is greater than & Delta;x, making timelike intervals positive. The region exterior to the light cone consists of events that are separated from the event  O by more space than can be crossed at lightspeed in the given time. These events comprise the so-called spacelike region of the event  O, denoted Elsewhere in Fig.  2 & 8209;4. Events on the light cone itself are said to be lightlike from  O. Because of the invariance of the spacetime interval, all observers will assign the same light cone to any given event, and thus will agree on this division of spacetime.     The light cone has an essential role within the concept of causality . It is possible for a not-faster-than-light-speed signal to travel from the position and time of  O to the position and time of D . It is hence possible for event  O to have a causal influence on event  D. The future light cone contains all the events that could be causally influenced by O. Likewise, it is possible for a not-faster-than-light-speed signal to travel from the position and time of A, to the position and time of O. The past light cone contains all the events that could have a causal influence on O. In contrast, assuming that signals cannot travel faster than the speed of light, any event, like e.g.  B or  C, in the spacelike region , cannot either affect event  O, nor can they be affected by event  O employing such signalling. Under this assumption any causal relationship between event  O and any events in the spacelike region of a light cone is excluded.             thu   All observers will agree that for any given event, an event within the given events future light cone occurs after the given event. Likewise, for any given event, an event within the given events past light cone occurs before the given event. The before-after relationship observed for timelike-separated events remains unchanged no matter what the reference frame of the observer, i.e. no matter how the observer may be moving. The situation is quite different for spacelike-separated events. Fig.  2 & 8209;4 was drawn from the reference frame of an observer moving at From this reference frame, event  C is observed to occur after event  O, and event  B is observed to occur before event  O. From a different reference frame, the orderings of these non-causally-related events can be reversed. In particular, one notes that if two events are simultaneous in a particular reference frame, they are necessarily separated by a spacelike interval and thus are noncausally related. The observation that simultaneity is not absolute, but depends on the observers reference frame, is termed the relativity of simultaneity .     Fig. 2-6 illustrates the use of spacetime diagrams in the analysis of the relativity of simultaneity. The events in spacetime are invariant, but the coordinate frames transform as discussed above for Fig.  2 & 8209;3. The three events are simultaneous from the reference frame of an observer moving at From the reference frame of an observer moving at the events appear to occur in the order From the reference frame of an observer moving at , the events appear to occur in the order . The white line represents a plane of simultaneity being moved from the past of the observer to the future of the observer, highlighting events residing on it. The gray area is the light cone of the observer, which remains invariant.     A spacelike spacetime interval gives the same distance that an observer would measure if the events being measured were simultaneous to the observer. A spacelike spacetime interval hence provides a measure of proper distance, i.e. the true distance   Likewise, a timelike spacetime interval gives the same measure of time as would be presented by the cumulative ticking of a clock that moves along a given world line. A timelike spacetime interval hence provides a measure of the proper time   .             thu     In Euclidean space , the set of points equidistant from some point form a circle or a sphere . In Minkowski spacetime , the points at some constant spacetime interval away from the origin form curves given by the two equations     : 2 - x2   s2  with s2  some positive real constant.     These equations describe two families of hyperbolae in an x  ct spacetime diagram, which are termed invariant hyperbolae.     In Fig.  2 & 8209;7a, each magenta hyperbola connects all events having some fixed spacelike separation from the origin, while the green hyperbolae connect events of equal timelike separation.     Fig.  2 & 8209;7b reflects the situation in Minkowski spacetime with the corresponding hyperboloids. Each timelike interval generates a hyperboloid of one sheet, while each spacelike interval generates a hyperboloid of two sheets.     The -dimensional boundary between space- and timelike hyperboloids, established by the events forming a zero spacetime interval to the origin, is made up by degenerating the hyperboloids to the light cone. In -dimensions the hyperbolae degenerate to the two grey 45°-lines depicted in Fig.  2 & 8209;7a.     Note on nomenclature: The magenta hyperbolae, which cross the x axis, are termed timelike hyperbolae because all distances to the origin along the hyperbola are timelike intervals. Because of that, these hyperbolae represent actual paths that can be traversed by particles in spacetime: between any two events on one hyperbola a causality relation is possible, because the inverse of the slope  representing the necessary speed   for all secants is less than c . On the other hand, the green hyperbolae, which cross the ct axis, are termed spacelike, because all intervals along these hyperbolae are spacelike intervals: no causality is possible between any two points on one of these hyperbolae, because all secants represent speeds larger than c .         thu   Fig. 2-8 illustrates the invariant hyperbola for all events that can be reached from the origin in a proper time of 5  meters . Different world lines represent clocks moving at different speeds. A clock that is stationary with respect to the observer has a world line that is vertical, and the elapsed time measured by the observer is the same as the proper time. For a clock traveling at 0.3c, the elapsed time measured by the observer is 5.24 meters , while for a clock traveling at 0.7c, the elapsed time measured by the observer is 7.00 meters . This illustrates the phenomenon known as time dilation . Clocks that travel faster take longer to tick out the same amount of proper time, and they travel further along the x  axis than they would have without time dilation. The measurement of time dilation by two observers in different inertial reference frames is mutual. If observer O measures the clocks of observer O′ as running slower in his frame, observer O′ in turn will measure the clocks of observer O as running slower.       thu   Length contraction , like time dilation, is a manifestation of the relativity of simultaneity. Measurement of length requires measurement of the spacetime interval between two events that are simultaneous in ones frame of reference. But events that are simultaneous in one frame of reference are, in general, not simultaneous in other frames of reference.     Fig. 2-9 illustrates the motions of a 1  m rod that is traveling at 0.5  c along the x axis. The edges of the blue band represent the world lines of the rods two endpoints. The invariant hyperbola illustrates events separated from the origin by a spacelike interval of 1  m. The endpoints O and B measured when    0 are simultaneous events in the S′ frame. But to an observer in frame S, events O and B are not simultaneous. To measure length, the observer in frame S measures the endpoints of the rod as projected onto the x-axis along their world lines. The projection of the rods world sheet onto the x axis yields the foreshortened length OC.     Drawing a vertical line through A so that it intersects the x axis demonstrates that, even as OB is foreshortened from the point of view of observer O, OA is likewise foreshortened from the point of view of observer O′. In the same way that each observer measures the others clocks as running slow, each observer measures the others rulers as being contracted.     In regards to mutual length contraction,  2 & 8209;9 illustrates that the primed and unprimed frames are mutually rotated by a hyperbolic angle . In a Cartesian plane , ordinary rotation leaves a circle unchanged. In spacetime, hyperbolic rotation preserves the hyperbolic metric . Because of this rotation, the projection of a primed meter-stick onto the unprimed x-axis is foreshortened, while the projection of an unprimed meter-stick onto the primed x′-axis is likewise foreshortened.             Mutual time dilation and length contraction tend to strike beginners as inherently self-contradictory concepts. If an observer in frame S measures a clock, at rest in frame S, as running slower than his, while S is moving at speed v in S, then the principle of relativity requires that an observer in frame S likewise measures a clock in frame S, moving at speed −v in S, as running slower than hers. How two clocks can run both slower than the other, is an important question that goes to the heart of understanding special relativity.     Basically, this apparent contradiction stems from not correctly taking into account the different settings of the necessary, related measurements. These settings allow for a consistent explanation of the only apparent contradiction. It is not about the abstract ticking of two identical clocks, but about how to measure in one frame the temporal distance of two ticks of a moving clock. It turns out that in mutually observing the duration between ticks of clocks, each moving in the respective frame, different sets of clocks must be involved. In order to measure in frame S the tick duration of a moving clock W , one uses two additional, synchronized clocks W 1 and W 2 at rest in two arbitrarily fixed points in S with the spatial distance d.   : Two events can be defined by the condition two clocks are simultaneously at one place , i.e., when W passes each W 1 and W 2 . For both events the two readings of the collocated clocks are recorded. The difference of the two readings of W 1 and W 2 is the temporal distance of the two events in S, and their spatial distance is d. The difference of the two readings of W is the temporal distance of the two events in S. In S these events are only separated in time, they happen at the same place in S. Because of the invariance of the spacetime interval spanned by these two events, and the nonzero spatial separation d in S, the temporal distance in S must be smaller than the one in S: the smaller temporal distance between the two events, resulting from the readings of the moving clock W, belongs to the slower running clock W.     Conversely, for judging in frame S the temporal distance of two events on a moving clock W , one needs two clocks at rest in S.   : In this comparison the clock W is moving by with velocity -v. Recording again the four readings for the events, defined by two clocks simultaneously at one place , results in the analogous temporal distances of the two events, now temporally and spatially separated in S, and only temporally separated but collocated in S. To keep the spacetime interval invariant, the temporal distance in S must be smaller than in S, because of the spatial separation of the events in S: now clock W is observed to run slower.     Obviously, the necessary recordings for the two judgements, with one moving clock and two clocks at rest in respectively S or S, involves two different sets, each with three clocks. Since there are different sets of clocks involved in the measurements, there is no inherent necessity that the measurements be reciprocally consistent such that, if one observer measures the moving clock to be slow, the other observer measures the ones clock to be fast.       Fig. 2-10 illustrates the previous discussion of mutual time dilation with Minkowski diagrams. The upper picture reflects the measurements as seen from frame S at rest with unprimed, rectangular axes, and frame S moving with v 0 , with unprimed, oblique axes, slanted to the left.     Each line drawn parallel to a spatial axis represents a line of simultaneity. All events on such a line have the same time value . Likewise, each line drawn parallel to a temporal axis represents a line of equal spatial coordinate values .     : One may designate in both pictures the origin O as the event, where the respective moving clock is collocated with the first clock at rest in both comparisons. Obviously, for this event the readings on both clocks in both comparisons are zero. As a consequence, the worldlines of the moving clocks are the slanted to the right ct′-axis and the slanted to the left ct-axes . The worldlines of W 1 and W 1 are the corresponding vertical time axes .     : In the upper picture the place for W 2 is taken to be A x sub /sub sub /sub 0, and so in this measurement the moving clock W passes W 2 in the event C.     : In the upper picture the ct-coordinate A t of the event A is labeled B, thus giving the elapsed time between the two events, measured with W 1 and W 2 , as OB. For a comparison, the length of the time interval OA, measured with W, must be transformed to the scale of the ct-axis. This is done by the invariant hyperbola through A, connecting all events with the same spacetime interval from the origin as A. This yields the event C on the ct-axis, and obviously: OC OC corresponds again to above.     The word measure is important. In classical physics an observer cannot affect an observed object, but the objects state of motion can affect the observers observations of the object.       Many introductions to special relativity illustrate the differences between Galilean relativity and special relativity by posing a series of paradoxes . These paradoxes are, in fact, ill-posed problems, resulting from our unfamiliarity with velocities comparable to the speed of light. The remedy is to solve many problems in special relativity and to become familiar with its so-called counter-intuitive predictions. The geometrical approach to studying spacetime is considered one of the best methods for developing a modern intuition.     The twin paradox is a thought experiment involving identical twins, one of whom makes a journey into space in a high-speed rocket, returning home to find that the twin who remained on Earth has aged more. This result appears puzzling because each twin observes the other twin as moving, and so at first glance, it would appear that each should find the other to have aged less. The twin paradox sidesteps the justification for mutual time dilation presented above by avoiding the requirement for a third clock. Nevertheless, the twin paradox is not a true paradox because it is easily understood within the context of special relativity.     The impression that a paradox exists stems from a misunderstanding of what special relativity states. Special relativity does not declare all frames of reference to be equivalent, only inertial frames. The traveling twins frame is not inertial during periods when she is accelerating. Furthermore, the difference between the twins is observationally detectable: the traveling twin needs to fire her rockets to be able to return home, while the stay-at-home twin does not. Even with no acceleration i.e. using one inertial frame O for constant, high-velocity outward journey and another inertial frame I for constant, high-velocity inward journey - the sum of the elapsed time in those frames is shorter than the elapsed time in the stationary inertial frame S. Thus acceleration and deceleration is not the cause of shorter elapsed time during the outward and inward journey. Instead the use of two different constant, high-velocity inertial frames for outward and inward journey is really the cause of shorter elapsed time total. Granted, if the same twin has to travel outward and inward leg of the journey and safely switch from outward to inward leg of the journey, the acceleration and deceleration is required. If the travelling twin could ride the high-velocity outward inertial frame and instantaneously switch to high-velocity inward inertial frame the example would still work. The point is that real reason should be stated clearly. The asymmetry is because of the comparison of sum of elapsed times in two different inertial frames to the elapsed time in a single inertial frame S.     thu   Deeper analysis is needed before we can understand why these distinctions should result in a difference in the twins ages. Consider the spacetime diagram of Fig.  2 & 8209;11. This presents the simple case of a twin going straight out along the x axis and immediately turning back. From the standpoint of the stay-at-home twin, there is nothing puzzling about the twin paradox at all. The proper time measured along the traveling twins world line from O to C, plus the proper time measured from C to B, is less than the stay-at-home twins proper time measured from O to A to B. More complex trajectories require integrating the proper time between the respective events along the curve to calculate the total amount of proper time experienced by the traveling twin.     Complications arise if the twin paradox is analyzed from the traveling twins point of view.     For the rest of this discussion, we adopt Weisss nomenclature, designating the stay-at-home twin as Terence and the traveling twin as Stella.     We had previously noted that Stella is not in an inertial frame. Given this fact, it is sometimes stated that full resolution of the twin paradox requires general relativity. This is not true.     : A pure SR analysis would be as follows: Analyzed in Stellas rest frame, she is motionless for the entire trip. When she fires her rockets for the turnaround, she experiences a pseudo force which resembles a gravitational force. Figs.  2 & 8209;6 and 2 & 8209;11 illustrate the concept of lines of simultaneity: Lines parallel to the observers x-axis represent sets of events that are simultaneous in the observer frame. In Fig.  2 & 8209;11, the blue lines connect events on Terences world line which, from Stellas point of view, are simultaneous with events on her world line. Throughout both the outbound and the inbound legs of Stellas journey, she measures Terences clocks as running slower than her own. But during the turnaround , a shift takes place in the angle of her lines of simultaneity, corresponding to a rapid skip-over of the events in Terences world line that Stella considers to be simultaneous with her own. Therefore, at the end of her trip, Stella finds that Terence has aged more than she has.     Although general relativity is not required to analyze the twin paradox, application of the Equivalence Principle of general relativity does provide some additional insight into the subject. We had previously noted that Stella is not stationary in an inertial frame. Analyzed in Stellas rest frame, she is motionless for the entire trip. When she is coasting her rest frame is inertial, and Terences clock will appear to run slow. But when she fires her rockets for the turnaround, her rest frame is an accelerated frame and she experiences a force which is pushing her as if she were in a gravitational field. Terence will appear to be high up in that field and because of gravitational time dilation , his clock will appear to run fast, so much so that the net result will be that Terence has aged more than Stella when they are back together. As will be discussed in the forthcoming section Curvature of time , the theoretical arguments predicting gravitational time dilation are not exclusive to general relativity. Any theory of gravity will predict gravitational time dilation if it respects the principle of equivalence, including Newtons theory.             This introductory section has focused on the spacetime of special relativity, since it is the easiest to describe. Minkowski spacetime is flat, takes no account of gravity, is uniform throughout, and serves as nothing more than a static background for the events that take place in it. The presence of gravity greatly complicates the description of spacetime. In general relativity, spacetime is no longer a static background, but actively interacts with the physical systems that it contains. Spacetime curves in the presence of matter, can propagate waves, bends light, and exhibits a host of other phenomena. A few of these phenomena are described in the later sections of this article.                   A basic goal is to be able to compare measurements made by observers in relative motion. Say we have an observer O in frame S who has measured the time and space coordinates of an event, assigning this event three Cartesian coordinates and the time as measured on his lattice of synchronized clocks . A second observer O′ in a different frame S′ measures the same event in her coordinate system and her lattice of synchronized clocks . Since we are dealing with inertial frames, neither observer is under acceleration, and a simple set of equations allows us to relate coordinates to . Given that the two coordinate systems are in standard configuration, meaning that they are aligned with parallel coordinates and that when , the coordinate transformation is as follows:   : x x - v t   : y y   : z z   : t t .     thu   Fig. 3-1 illustrates that in Newtons theory, time is universal, not the velocity of light. Consider the following thought experiment: The red arrow illustrates a train that is moving at 0.4  c with respect to the platform. Within the train, a passenger shoots a bullet with a speed of 0.4  c in the frame of the train. The blue arrow illustrates that a person standing on the train tracks measures the bullet as traveling at 0.8  c. This is in accordance with our naive expectations.     More generally, assume that frame S′ is moving at velocity v with respect to frame S. Within frame S′, observer O′ measures an object moving with velocity . What is its velocity u with respect to frame S? Since , , and , we can write . This leads to and ultimately   : u u - v    or     u u + v ,     which is the common-sense Galilean law for the addition of velocities.           thu   The composition of velocities is quite different in relativistic spacetime. To reduce the complexity of the equations slightly, we introduce a common shorthand for the ratio of the speed of an object relative to light,     :   v/c     Fig. 3-2a illustrates a red train that is moving forward at a speed given by . From the primed frame of the train, a passenger shoots a bullet with a speed given by , where the distance is measured along a line parallel to the red axis rather than parallel to the black x axis. What is the composite velocity u of the bullet relative to the platform, as represented by the blue arrow? Referring to Fig.  3 & 8209;2b:   From the platform, the composite speed of the bullet is given by .   The two yellow triangles are similar because they are right triangles that share a common angle & alpha;. In the large yellow triangle, the ratio .   The ratios of corresponding sides of the two yellow triangles are constant, so that . So and .   Substitute the expressions for b and r into the expression for u in step  1 to yield Einsteins formula for the addition of velocities:     :: u .     The relativistic formula for addition of velocities presented above exhibits several important features:   If and v are both very small compared with the speed of light, then the product /c 2 becomes vanishingly small, and the overall result becomes indistinguishable from the Galilean formula for the addition of velocities: u      +  v. The Galilean formula is a special case of the relativistic formula applicable to low velocities.   If is set equal to c, then the formula yields u    c regardless of the starting value of v. The velocity of light is the same for all observers regardless their motions relative to the emitting source.             thu     We had previously discussed, in qualitative terms, time dilation and length contraction. It is straightforward to obtain quantitative expressions for these effects. Fig.  3 & 8209;3 is a composite image containing individual frames taken from two previous animations, simplified and relabeled for the purposes of this section.     To reduce the complexity of the equations slightly, we see in the literature a variety of different shorthand notations for ct  :     :   ct and w ct are common.   :One also sees very frequently the use of the convention c 1.     thu   In Fig. 3-3a, segments OA and OK represent equal spacetime intervals. Time dilation is represented by the ratio OB/OK. The invariant hyperbola has the equation where k    OK, and the red line representing the world line of a particle in motion has the equation w    x/ & beta;    xc/v. A bit of algebraic manipulation yields OB OK /   .     The expression involving the square root symbol appears very frequently in relativity, and one over the expression is called the Lorentz factor, denoted by the Greek letter gamma   :   :           We note that if v is greater than or equal to c, the expression for   becomes physically meaningless, implying that c is the maximum possible speed in nature. Next, we note that for any v greater than zero, the Lorentz factor will be greater than one, although the shape of the curve is such that for low speeds, the Lorentz factor is extremely close to one.     In Fig. 3-3b, segments OA and OK represent equal spacetime intervals. Length contraction is represented by the ratio OB/OK. The invariant hyperbola has the equation , where k    OK, and the edges of the blue band representing the world lines of the endpoints of a rod in motion have slope 1/ & beta;    c/v. Event  A has coordinates      . Since the tangent line through A and B has the equation w    / & beta;, we have & gamma; & beta;k    / & beta; and   : OB/OK                   The Galilean transformations and their consequent commonsense law of addition of velocities work well in our ordinary low-speed world of planes, cars and balls. Beginning in the mid-1800s, however, sensitive scientific instrumentation began finding anomalies that did not fit well with the ordinary addition of velocities.     To transform the coordinates of an event from one frame to another in special relativity, we use the Lorentz transformations.     The Lorentz factor appears in the Lorentz transformations:   :     t &         x &       y & y     z & z         The inverse Lorentz transformations are:   :     t &         x &       y & y     z & z         When v ≪ c and x is small enough, the v 2 /c 2 and vx/c 2 terms approach zero, and the Lorentz transformations approximate to the Galilean transformations.     As noted before, when we write t   , x   and so forth, we most often really mean   t   ,   x   and so forth. Although, for brevity, we write the Lorentz transformation equations without deltas, it should be understood that x means & Delta;x, etc. We are, in general, always concerned with the space and time differences between events.     Note on nomenclature: Calling one set of transformations the normal Lorentz transformations and the other the inverse transformations is misleading, since there is no intrinsic difference between the frames. Different authors call one or the other set of transformations the inverse set. The forwards and inverse transformations are trivially related to each other, since the S frame can only be moving forwards or reverse with respect to . So inverting the equations simply entails switching the primed and unprimed variables and replacing v with −v.     Example: Terence and Stella are at an Earth-to-Mars space race. Terence is an official at the starting line, while Stella is a participant. At time , Stellas spaceship accelerates instantaneously to a speed of 0.5  c. The distance from Earth to Mars is 300 light-seconds . Terence observes Stella crossing the finish-line clock at . But Stella observes the time on her ship chronometer to be as she passes the finish line, and she calculates the distance between the starting and finish lines, as measured in her frame, to be 259.81 light-seconds .   1w,  xOr the other way around, of course.41longitudinal Doppler effect2 transverse Doppler effect 11+  s1-  r  dr/dt    0 where r is the distance between receiver and source 1 -   2 b 1 -   2 cdcdThe converse, however, is not true.bdm c2  indeed in any instrumentation whose use depends on high velocity particles, such as electron microscopes, old-fashioned color television sets, etc.also called 4 & 8209;momentumE/c,   px, py, pzE,   px, py, pz space translation symmetry time translation symmetry 12122vm              G c4    ref /ref  sup /sup sup /sup sup /sup sup /sup ": null
    }
]