[
    {
        "        In ": null
    },
    {
        "physics": "Physics"
    },
    {
        ", special relativity  is the generally accepted and experimentally confirmed ": null
    },
    {
        "physical theory": "Scientific Theory"
    },
    {
        " regarding the relationship between ": null
    },
    {
        "space and time": "Space And Time"
    },
    {
        ". In ": null
    },
    {
        "Albert Einsteins": "Albert Einstein"
    },
    {
        " original pedagogical treatment, it is based on two ": null
    },
    {
        "postulates": "Postulates"
    },
    {
        "invariant": "Invariant"
    },
    {
        " in all ": null
    },
    {
        "inertial frames of reference": "Inertial Frame Of Reference"
    },
    {
        " ; and   the ": null
    },
    {
        "speed of light": "Speed Of Light"
    },
    {
        " in a ": null
    },
    {
        "vacuum": "Vacuum"
    },
    {
        " is the same for all observers, regardless of the motion of the light source or observer.     Some of the work of Albert Einstein in special relativity is built on the earlier work by ": null
    },
    {
        "Hendrik Lorentz": "Hendrik Lorentz"
    },
    {
        ".     Special relativity was originally proposed by Albert Einstein in a paper published on 26 September 1905 titled ": null
    },
    {
        "On the Electrodynamics of Moving Bodies": "Annus Mirabilis Papersspecial Relativity"
    },
    {
        " . ": null
    },
    {
        "Albert Einstein": "Albert Einstein"
    },
    {
        "  , Annalen der Physik 17: 891; English translation  by ": null
    },
    {
        "George Barker Jeffery": "George Barker Jeffery"
    },
    {
        " and Wilfrid Perrett ; Another English translation ": null
    },
    {
        "On the Electrodynamics of Moving Bodies": "S:On The Electrodynamics Of Moving Bodies"
    },
    {
        " by ": null
    },
    {
        "Megh Nad Saha": "Megh Nad Saha"
    },
    {
        " . The incompatibility of ": null
    },
    {
        "Newtonian mechanics": "Newtonian Mechanics"
    },
    {
        " with ": null
    },
    {
        "Maxwells equations": "Maxwells Equations"
    },
    {
        " of ": null
    },
    {
        "electromagnetism": "Electromagnetism"
    },
    {
        " and, experimentally, the Michelson-Morley null result demonstrated that the historically hypothesized ": null
    },
    {
        "luminiferous aether": "Luminiferous Aether"
    },
    {
        " did not exist. This led to Einsteins development of special relativity, which corrects mechanics to handle situations involving all motions and especially those at a speed close to that of light . Today, special relativity is proven to be the most accurate model of motion at any speed when gravitational effects are negligible. Even so, the Newtonian model is still valid as a simple and accurate approximation at low velocities , for example, the everyday motions on Earth.     Special relativity has a wide range of consequences. These have been experimentally verified,  and include ": null
    },
    {
        "length contraction": "Length Contraction"
    },
    {
        ", ": null
    },
    {
        "time dilation": "Time Dilation"
    },
    {
        ", ": null
    },
    {
        "relativistic mass": "Mass In Special Relativity"
    },
    {
        ", ": null
    },
    {
        "mass–energy equivalence": "Mass–Energy Equivalence"
    },
    {
        ", ": null
    },
    {
        "a universal speed limit": "Speed Of Lightupper Limit On Speeds"
    },
    {
        ", the speed of causality and ": null
    },
    {
        "relativity of simultaneity": "Relativity Of Simultaneity"
    },
    {
        ". It has, for example, replaced the conventional notion of an absolute universal time with the notion of a time that is dependent on reference frame and ": null
    },
    {
        "spatial": "Space"
    },
    {
        " position. Rather than an invariant time interval between two events, there is an invariant ": null
    },
    {
        "spacetime interval": "Spacetime Interval"
    },
    {
        ". Combined with other laws of physics, the two postulates of special relativity predict the equivalence of ": null
    },
    {
        "mass": "Mass"
    },
    {
        " and ": null
    },
    {
        "energy": "Energy"
    },
    {
        ", as expressed in the ": null
    },
    {
        "mass–energy equivalence": "Mass–Energy Equivalence"
    },
    {
        " formula E    mc 2 .       A defining feature of special relativity is the replacement of the ": null
    },
    {
        "Galilean transformations": "Galilean Transformation"
    },
    {
        " of Newtonian mechanics with the ": null
    },
    {
        "Lorentz transformations": "Lorentz Transformation"
    },
    {
        ". Time and space cannot be defined separately from each other . Rather, space and time are interwoven into ": null
    },
    {
        "a single continuum known as spacetime ": "Space-Time Continuum"
    },
    {
        ". Events that occur at the same time for one observer can occur at different times for another.     Until Einstein developed ": null
    },
    {
        "general relativity": "General Relativity"
    },
    {
        ", introducing a curved spacetime to incorporate gravity, the phrase special relativity was not used. A translation sometimes used is restricted relativity ; special really means special case . Science and Common Sense, P. W. Bridgman, The Scientific Monthly, Vol. 79, No. 1 , pp. 32-39. The Electromagnetic Mass and Momentum of a Spinning Electron, G. Breit, Proceedings of the National Academy of Sciences, Vol. 12, p.451, 1926 Kinematics of an electron with an axis. Phil. Mag. 3:1-22. L. H. Thomas. Einstein himself, in The Foundations of the General Theory of Relativity, Ann. Phys. 49 , writes The word special is meant to intimate that the principle is restricted to the case... . See p. 111 of The Principle of Relativity, A. Einstein, H. A. Lorentz, H. Weyl, H. Minkowski, Dover reprint of 1923 translation by Methuen and Company.     The theory is special in that it only applies in the ": null
    },
    {
        "special case": "Special Case"
    },
    {
        " where the spacetime is flat , i.e., the ": null
    },
    {
        "curvature of spacetime": "Curvature Of Spacetime"
    },
    {
        ", described by the ": null
    },
    {
        "energy-momentum tensor": "Energy-Momentum Tensor"
    },
    {
        " and causing ": null
    },
    {
        "gravity": "Gravity"
    },
    {
        ", is negligible. Sean Carroll, Lecture Notes on General Relativity, ch. 1, Special relativity and flat spacetime,  Wald, General Relativity, p. 60: ...the special theory of relativity asserts that spacetime is the manifold ℝ 4 with a flat metric of Lorentz signature defined on it. Conversely, the entire content of special relativity ... is contained in this statement ... In order to correctly accommodate gravity, Einstein formulated general relativity in 1915. Special relativity, contrary to some historical descriptions, does accommodate ": null
    },
    {
        "accelerations": "Acceleration"
    },
    {
        " as well as ": null
    },
    {
        "accelerating frames of reference": "Rindler Coordinates"
    },
    {
        ".         Just as ": null
    },
    {
        "Galilean relativity": "Galilean Invariance"
    },
    {
        " is now accepted to be an approximation of special relativity that is valid for low speeds, special relativity is considered an approximation of general relativity that is valid for weak ": null
    },
    {
        "gravitational fields": "Gravitational Field"
    },
    {
        ", i.e. at a sufficiently small scale  and in conditions of ": null
    },
    {
        "free fall": "Free Fall"
    },
    {
        ". General relativity, however, incorporates ": null
    },
    {
        "noneuclidean geometry": "Noneuclidean Geometry"
    },
    {
        " in order to represent gravitational effects as the geometric curvature of spacetime. Special relativity is restricted to the flat spacetime known as ": null
    },
    {
        "Minkowski space": "Minkowski Space"
    },
    {
        ". As long as the universe can be modeled as a ": null
    },
    {
        "pseudo-Riemannian manifold": "Pseudo-Riemannian Manifold"
    },
    {
        ", a Lorentz-invariant frame that abides by special relativity can be defined for a sufficiently small neighborhood of each point in this ": null
    },
    {
        "curved spacetime": "Curved Spacetime"
    },
    {
        ".     ": null
    },
    {
        "Galileo Galilei": "Galileo Galilei"
    },
    {
        " had already postulated that there is no absolute and well-defined state of rest , a principle now called ": null
    },
    {
        "Galileos principle of relativity": "Galilean Invariance"
    },
    {
        ". Einstein extended this principle so that it accounted for the constant speed of light,  a phenomenon that had been observed in the ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        ". He also postulated that it holds for all the ": null
    },
    {
        "laws of physics": "Laws Of Physics"
    },
    {
        ", including both the laws of mechanics and of ": null
    },
    {
        "electrodynamics": "Electrodynamics"
    },
    {
        ".               Traditional two postulates approach to special relativity      Einstein discerned two fundamental propositions that seemed to be the most assured, regardless of the exact validity of the known laws of either mechanics or electrodynamics. These propositions were the constancy of the speed of light in a vacuum and the independence of physical laws from the choice of inertial system. In his initial presentation of special relativity in 1905 he expressed these postulates as:   The Principle of Relativity – the laws by which the states of physical systems undergo change are not affected, whether these changes of state be referred to the one or the other of two systems in uniform translatory motion relative to each other.   The Principle of Invariant Light Speed – ... light is always propagated in empty space with a definite velocity c which is independent of the state of motion of the emitting body . That is, light in vacuum propagates with the speed c in at least one system of inertial coordinates , regardless of the state of motion of the light source.     The constancy of the speed of light was motivated by ": null
    },
    {
        "Maxwells theory of electromagnetism": "Maxwells Theory Of Electromagnetism"
    },
    {
        " and the lack of evidence for the ": null
    },
    {
        "luminiferous ether": "Luminiferous Ether"
    },
    {
        ". There is conflicting evidence on the extent to which Einstein was influenced by the null result of the ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        ". ": null
    },
    {
        "Michael Polanyi": "Michael Polanyi"
    },
    {
        " Personal Knowledge: Towards a Post-Critical Philosophy, , footnote page 10–11: Einstein reports, via Dr N Balzas in response to Polanyis query, that The Michelson–Morley experiment had no role in the foundation of the theory. and ..the theory of relativity was not founded to explain its outcome at all.  In any case, the null result of the Michelson–Morley experiment helped the notion of the constancy of the speed of light gain widespread and rapid acceptance.     The derivation of special relativity depends not only on these two explicit postulates, but also on several tacit assumptions , including the ": null
    },
    {
        "isotropy": "Isotropy"
    },
    {
        " and ": null
    },
    {
        "homogeneity": "Homogeneity"
    },
    {
        " of space and the independence of measuring rods and clocks from their past history. Einstein, Fundamental Ideas and Methods of the Theory of Relativity , 1920     Following Einsteins original presentation of special relativity in 1905, many different sets of postulates have been proposed in various alternative derivations. For a survey of such derivations, see Lucas and Hodgson, Spacetime and Electromagnetism, 1990 However, the most common set of postulates remains those employed by Einstein in his original paper. A more mathematical statement of the Principle of Relativity made later by Einstein, which introduces the concept of simplicity not mentioned above is:        ": null
    },
    {
        "Henri Poincaré": "Henri Poincaré"
    },
    {
        " provided the mathematical framework for relativity theory by proving that ": null
    },
    {
        "Lorentz transformations": "Lorentz Transformations"
    },
    {
        " are a subset of his ": null
    },
    {
        "Poincaré group": "Poincaré Group"
    },
    {
        " of symmetry transformations. Einstein later derived these transformations from his axioms.     Many of Einsteins papers present derivations of the Lorentz transformation based upon these two principles. Einstein, On the Relativity Principle and the Conclusions Drawn from It, 1907; The Principle of Relativity and Its Consequences in Modern Physics , 1910; The Theory of Relativity , 1911; Manuscript on the Special Theory of Relativity, 1912; Theory of Relativity, 1913; Einstein, Relativity, the Special and General Theory, 1916; The Principal Ideas of the Theory of Relativity, 1916; What Is The Theory of Relativity?, 1919; The Principle of Relativity , 1921; Physics and Reality, 1936; The Theory of Relativity, 1949.                     ": null
    },
    {
        "Reference frames": "Frame Of Reference"
    },
    {
        " play a crucial role in relativity theory. The term reference frame as used here is an observational perspective in space which is not undergoing any change in motion , from which a position can be measured along 3 spatial axes . In addition, a reference frame has the ability to determine measurements of the time of events using a clock .     An ": null
    },
    {
        "event": "Event"
    },
    {
        " is an occurrence that can be assigned a single unique moment and location in space relative to a reference frame: it is a point in ": null
    },
    {
        "spacetime": "Spacetime"
    },
    {
        ". Since the speed of light is constant in relativity irrespective of reference frame, pulses of light can be used to unambiguously measure distances and refer back the times that events occurred to the clock, even though light takes time to reach the clock after the event has transpired.     For example, the explosion of a ": null
    },
    {
        "firecracker": "Firecracker"
    },
    {
        " may be considered to be an event . We can completely specify an event by its four spacetime coordinates: The time of occurrence and its 3-dimensional spatial location define a reference point. Lets call this reference frame S.     In relativity theory, we often want to calculate the coordinates of an event from differing reference frames. The equations that relate measurements made in different frames are called transformation equations.       To gain insight in how the spacetime coordinates measured by observers in different ": null
    },
    {
        "reference frames": "Inertial Frame Of Reference"
    },
    {
        " compare with each other, it is useful to work with a simplified setup with frames in a standard configuration.   With care, this allows simplification of the math with no loss of generality in the conclusions that are reached. In Fig.  2 & 8209;1, two ": null
    },
    {
        "Galilean reference frames": "Galilean Reference Frame"
    },
    {
        " are displayed in relative motion. Frame S belongs to a first observer O, and frame S′ belongs to a second observer O′.   The x, y, z axes of frame S are oriented parallel to the respective primed axes of frame S′.   Frame S′ moves, for simplicity, in a single direction: the x-direction of frame S with a constant velocity v as measured in frame S.   The origins of frames S and S′ are coincident when time t 0 for frame S and t′ 0 for frame S′.     Since there is no absolute reference frame in relativity theory, a concept of moving doesnt strictly exist, as everything may be moving with respect to some other reference frame. Instead, any two frames that move at the same speed in the same direction are said to be comoving. Therefore, S and S′ are not comoving.       The ": null
    },
    {
        "principle of relativity": "Principle Of Relativity"
    },
    {
        ", which states that physical laws have the same form in each ": null
    },
    {
        "inertial reference frame": "Inertial Reference Frame"
    },
    {
        ", dates back to ": null
    },
    {
        "Galileo": "Galileo Galilei"
    },
    {
        ", and was incorporated into Newtonian physics. However, in the late 19th century, the existence of ": null
    },
    {
        "electromagnetic waves": "Electromagnetic Radiation"
    },
    {
        " led some physicists to suggest that the universe was filled with a substance that they called ": null
    },
    {
        "aether": "Luminiferous Aether"
    },
    {
        " , which, they postulated, would act as the medium through which these waves, or vibrations, propagated . The aether was thought to be an ": null
    },
    {
        "absolute reference frame": "Preferred Frame"
    },
    {
        " against which all speeds could be measured, and could be considered fixed and motionless relative to Earth or some other fixed reference point. The aether supposedly possessed some wonderful properties: it was sufficiently elastic to support electromagnetic waves, and those waves could interact with matter, yet it offered no resistance to bodies passing through it . The results of various experiments, including the ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        " in 1887 , led to the theory of special relativity, by showing that the aether did not exist. Staley, Richard , Albert Michelson, the Velocity of Light, and the Ether Drift , Einsteins generation. The origins of the relativity revolution, Chicago: University of Chicago Press,  Einsteins solution was to discard the notion of an aether and the absolute state of rest. In relativity, any reference frame moving with uniform motion will observe the same laws of physics. In particular, the speed of light in vacuum is always measured to be c, even when measured by multiple systems that are moving at different velocities.       From the principle of relativity alone without assuming the constancy of the speed of light ": null
    },
    {
        "it can be shown": "Derivations Of The Lorentz Transformationsfrom Group Postulates"
    },
    {
        " that the spacetime transformations between inertial frames are either Euclidean, Galilean, or Lorentzian. In the Lorentzian case, one can then obtain relativistic interval conservation and a certain finite limiting speed. Experiments suggest that this speed is the speed of light in vacuum.  David Morin Introduction to Classical Mechanics, Cambridge University Press, Cambridge, chapter 11, Appendix I, .      Lorentz invariance as the essential core of special relativity             Einstein consistently based the derivation of Lorentz invariance on just the two basic principles of relativity and light-speed invariance. He wrote:        Thus many modern treatments of special relativity base it on the single postulate of universal Lorentz covariance, or, equivalently, on the single postulate of ": null
    },
    {
        "Minkowski spacetime": "Minkowski Spacetime"
    },
    {
        ". Das, A. The Special Theory of Relativity, A Mathematical Exposition, Springer, . Schutz, J. Independent Axioms for Minkowski Spacetime, Addison Wesley Longman Limited, .     Rather than considering universal Lorentz covariance to be a derived principle, this article considers it to be the fundamental postulate of special relativity. The traditional two-postulate approach to special relativity is presented in innumerable college textbooks and popular presentations.  Textbooks starting with the single postulate of Minkowski spacetime include those by Taylor and Wheeler  and by Callahan.  This is also the approach followed by the Wikipedia articles ": null
    },
    {
        "Spacetime": "Spacetime"
    },
    {
        " and ": null
    },
    {
        "Minkowski diagram": "Minkowski Diagram"
    },
    {
        ".         Define an ": null
    },
    {
        "event": "Spacetimebasic Concepts"
    },
    {
        " to have spacetime coordinates  in system S and  in a reference frame moving at a velocity v with respect to that frame, S′. Then the ": null
    },
    {
        "Lorentz transformation": "Lorentz Transformation"
    },
    {
        " specifies that these coordinates are related in the following way:   :     t &         x &         y & y     z & z ,       where   :       is the ": null
    },
    {
        "Lorentz factor": "Lorentz Factor"
    },
    {
        " and c is the ": null
    },
    {
        "speed of light": "Speed Of Light"
    },
    {
        " in vacuum, and the velocity v of S′, relative to S, is parallel to the x-axis. For simplicity, the y and z coordinates are unaffected; only the x and t coordinates are transformed. These Lorentz transformations form a ": null
    },
    {
        "one-parameter group": "One-Parameter Group"
    },
    {
        " of ": null
    },
    {
        "linear mappings": "Linear Mapping"
    },
    {
        ", that parameter being called ": null
    },
    {
        "rapidity": "Rapidity"
    },
    {
        ".     Solving the four transformation equations above for the unprimed coordinates yields the inverse Lorentz transformation:   :     t &       x &       y & y     z & z.         Enforcing this inverse Lorentz transformation to coincide with the Lorentz transformation from the primed to the unprimed system, shows the unprimed frame as moving with the velocity v′ −v, as measured in the primed frame.     There is nothing special about the x-axis. The transformation can apply to the y- or z-axis, or indeed in any direction parallel to the motion  and perpendicular; see the article ": null
    },
    {
        "Lorentz transformation": "Lorentz Transformation"
    },
    {
        " for details.     A quantity invariant under ": null
    },
    {
        "Lorentz transformations": "Lorentz Transformations"
    },
    {
        " is known as a ": null
    },
    {
        "Lorentz scalar": "Lorentz Scalar"
    },
    {
        ".     Writing the Lorentz transformation and its inverse in terms of coordinate differences, where one event has coordinates  and , another event has coordinates and , and the differences are defined as     :       x x2-x1   ,     t t2-t1   .   :       x x2-x1   ,       t t2-t1   .     we get     :       x       ,      t         .   :       x       ,     t         .     If we take differentials instead of taking differences, we get     :     dx       ,    dt         .   :     dx       ,   dt         .            Spacetime diagrams  are an extremely useful aid to visualizing how coordinates transform between different reference frames. Although it is not as easy to perform exact computations using them as directly invoking the Lorentz transformations, their main power is their ability to provide an intuitive grasp of the results of a relativistic scenario.     To draw a spacetime diagram, begin by considering two Galilean reference frames, S and S, in standard configuration, as shown in Fig.  2 & 8209;1.       Fig.  3 & 8209;1a. Draw the x and t axes of frame S. The x axis is horizontal and the t axis is vertical, which is the opposite of the usual convention in kinematics. The ct axis is scaled by a factor of c so that both axes have common units of length. In the diagram shown, the gridlines are spaced one unit distance apart. The 45° diagonal lines represent the worldlines of two photons passing through the origin at time t 0. The slope of these worldlines is 1 because the photons advance one unit in space per unit of time. Two events,   and   have been plotted on this graph so that their coordinates may be compared in the S and S frames.     Fig.  3 & 8209;1b. Draw the x and ct axes of frame S. The ct axis represents the worldline of the origin of the S coordinate system as measured in frame S. In this figure, v c/2. Both the ct and x axes are tilted from the unprimed axes by an angle     where   v/c. The primed and unprimed axes share a common origin because frames S and S had been set up in standard configuration, so that t0 when t0.     Fig.  3 & 8209;1c. Units in the primed axes have a different scale from units in the unprimed axes. From the Lorentz transformations, we observe that coordinates of in the primed coordinate system transform to in the unprimed coordinate system. Likewise, coordinates of in the primed coordinate system transform to in the unprimed system. Draw gridlines parallel with the ct axis through points as measured in the unprimed frame, where k is an integer. Likewise, draw gridlines parallel with the x axis through as measured in the unprimed frame. Using the Pythagorean theorem, we observe that the spacing between ct units equals   times the spacing between ct units, as measured in frame S. This ratio is always greater than 1, and ultimately it approaches infinity as     1.     Fig.  3 & 8209;1d. Since the speed of light is an invariant, the worldlines of two photons passing through the origin at time t 0 still plot as 45° diagonal lines. The primed coordinates of   and   are related to the unprimed coordinates through the Lorentz transformations and could be approximately measured from the graph , but the real merit of a Minkowski diagram is its granting us a geometric view of the scenario. For example, in this figure, we observe that the two timelike-separated events that had different x-coordinates in the unprimed frame are now at the same position in space.     While the unprimed frame is drawn with space and time axes that meet at right angles, the primed frame is drawn with axes that meet at acute or obtuse angles. The frames are actually equivalent. The asymmetry is due to unavoidable distortions in how spacetime coordinates map onto a ": null
    },
    {
        "Cartesian plane": "Cartesian Plane"
    },
    {
        ". By analogy, planar maps of the world are unavoidably distorted, but with experience and intuition, one learns to mentally account for these distortions.            The consequences of special relativity can be derived from the ": null
    },
    {
        "Lorentz transformation": "Lorentz Transformation"
    },
    {
        " equations.  These transformations, and hence special relativity, lead to different physical predictions than those of Newtonian mechanics at all relative velocities, and most pronounced when relative velocities become comparable to the speed of light. The speed of light is so much larger than anything most humans encounter that some of the effects predicted by relativity are initially ": null
    },
    {
        "counterintuitive": "Counterintuitive"
    },
    {
        ".       In Galilean relativity, length  and temporal separation between two events are independent invariants, the values of which do not change when observed from different frames of reference.     In special relativity, however, the interweaving of spatial and temporal coordinates generates the concept of an invariant interval, denoted as   s2 :     :   s2       c2   t2 - This concept is counterintuitive at least for the fact that, in contrast to usual concepts of ": null
    },
    {
        "distance": "Distance"
    },
    {
        ", it may assume negative values , and that the square-denotation is misleading. This negative square lead to, now not broadly used, concepts of ": null
    },
    {
        "imaginary time": "Minkowski Spacehistory"
    },
    {
        ". It is immediate that the negative of   s2 is also an invariant, generated by a variant of the ": null
    },
    {
        "metric signature": "Metric Signature"
    },
    {
        " of spacetime.     The interweaving of space and time revokes the implicitly assumed concepts of absolute simultaneity and synchronization across non-comoving frames.     The form of   s2 , being the difference of the squared time lapse and the squared spatial distance, demonstrates a fundamental discrepancy between Euclidean and spacetime distances. The invariance of this interval is a property of the general Lorentz transform , making it an ": null
    },
    {
        "isometry": "Isometry"
    },
    {
        " of spacetime. The general Lorentz transform extends the standard Lorentz transform  with all other ": null
    },
    {
        "translations": "Translation"
    },
    {
        ", ": null
    },
    {
        "reflections": "Reflection"
    },
    {
        ", and ": null
    },
    {
        "rotations": "Rotation"
    },
    {
        " between any Cartesian inertial frame.       In the analysis of simplified scenarios, such as spacetime diagrams, a reduced-dimensionality form of the invariant interval is often employed:     :   s2     c2   t2 -   x2     Demonstrating that the interval is invariant is straightforward for the reduced-dimensionality case and with frames in standard configuration:   : c2   t2 -   x2 c2   2   -   2   2   :   2   -   2     :   2 c2   t -   2 v2   t -   2   x +   2     2 c2   t   -   2   x     : c2   t -   x     The value of   s2 is hence independent of the frame in which it is measured.     In considering the physical significance of   s2 , there are three cases to note:  Δs 2  math c , and given the Lorentz transformation   x     , it is evident that there exists a v less than c for which   x 0 . In other words, given two events that are timelike separated, it is possible to find a frame in which the two events happen at the same place. In this frame, the separation in time,   s / c, is called the proper time.   Δs 2  c , and given the Lorentz transformation   t     , there exists a v less than c for which   t 0 . In other words, given two events that are spacelike separated, it is possible to find a frame in which the two events happen at the same time. In this frame, the separation in space,   , is called the proper distance, or proper length. For values of v greater than and less than c2   t /   x , the sign of   t changes, meaning that the temporal order of spacelike-separated events changes depending on the frame in which the events are viewed. The temporal order of timelike-separated events, however, is absolute, since the only way that v could be greater than c2   t /   x would be if v /math  sup /sup  math /math math /math math /math  math /math  ref name Ashby2003  /ref math /math ref nameMorin2007/  ref name Lin1979 group p  /ref  math /math math /math  ref  /ref  math /math math /math  math /math math /math  math /math  math /math math /math math /math  math /math math /math  math /math math /math math /math math /math  math /math math /math ref name Rindler0 /  math /math math /math  math /math math /math  math /math math /math math /math  math /math math /math math /math  math /math math /math math /math math /math  ref name Rindler0 / .   The resultant speed of two velocities with magnitude less than c is always a velocity with magnitude less than c.   If both |u v  are small with respect to the speed of light  then the intuitive Galilean transformations are recovered from the transformation equations for special relativity   Attaching a frame to a photon  requires special treatment of the transformations.     There is nothing special about the x direction in the standard configuration. The above formalism applies to any direction; and three orthogonal directions allow dealing with all directions in space by decomposing the velocity vectors to their components in these directions. See ": null
    },
    {
        "Velocity-addition formula": "Velocity-Addition Formula"
    },
    {
        " for details.               The composition of two non-collinear Lorentz boosts results in a Lorentz transformation that is not a pure boost but is the composition of a boost and a rotation.     Thomas rotation results from the relativity of simultaneity. In Fig.  4 & 8209;2a, a rod of length L in its rest frame  rises vertically along the y & 8209;axis in the ground frame.     In Fig.  4 & 8209;2b, the same rod is observed from the frame of a rocket moving at speed v to the right. If we imagine two clocks situated at the left and right ends of the rod that are synchronized in the frame of the rod, relativity of simultaneity causes the observer in the rocket frame to observe  the clock at the right end of the rod as being advanced in time by Lv/c2 , and the rod is correspondingly observed as tilted.       Unlike second-order relativistic effects such as length contraction or time dilation, this effect becomes quite significant even at fairly low velocities. For example, this can be seen in the ": null
    },
    {
        "spin of moving particles": "Spin–Orbit Interaction"
    },
    {
        ", where ": null
    },
    {
        "Thomas precession": "Thomas Precession"
    },
    {
        " is a relativistic correction that applies to the ": null
    },
    {
        "spin": "Spin"
    },
    {
        " of an elementary particle or the rotation of a macroscopic ": null
    },
    {
        "gyroscope": "Gyroscope"
    },
    {
        ", relating the ": null
    },
    {
        "angular velocity": "Angular Velocity"
    },
    {
        " of the spin of a particle following a ": null
    },
    {
        "curvilinear": "Curvilinear"
    },
    {
        " orbit to the angular velocity of the orbital motion.      Thomas rotation provides the resolution to the well-known meter stick and hole paradox .            In Fig.  4 & 8209;3, the time interval between the events A and B is time-like; i.e., there is a frame of reference in which events A and B occur at the same location in space, separated only by occurring at different times. If A precedes B in that frame, then A precedes B in all frames accessible by a Lorentz transformation. It is possible for matter to travel from the location of A, starting at the time of A, to the location of B, arriving at the time of B, so there can be a causal relationship .     The interval AC in the diagram is space-like; i.e., there is a frame of reference in which events A and C occur simultaneously, separated only in space. There are also frames in which A precedes C and frames in which C precedes A. However, there are no frames accessible by a Lorentz transformation, in which events A and C occur at the same location. If it were possible for a cause-and-effect relationship to exist between events A and C, then paradoxes of causality would result.     For example, if signals could be sent faster than light, then signals could be sent into the senders past .   A variety of causal paradoxes could then be constructed.        Consider the spacetime diagrams in Fig.  4 & 8209;4. A and B stand alongside a railroad track, when a high speed train passes by, with C riding in the last car of the train and D riding in the leading car. The world lines of A and B are vertical , distinguishing the stationary position of these observers on the ground, while the world lines of C and D are tilted forwards , reflecting the rapid motion of the observers C and D stationary in their train, as observed from the ground.   Fig.  4 & 8209;4a. The event of B passing a message to D , as the leading car passes by, is at the origin of Ds frame. D sends the message along the train to C in the rear car, using a fictitious instantaneous communicator . The worldline of this message is the fat red arrow along the -x axis, which is a line of simultaneity in the primed frames of C and D. In the ground frame the signal arrives earlier than it was sent.   Fig.  4 & 8209;4b. The event of C passing the message to A , who is standing by the railroad tracks, is at the origin of their frames. Now A sends the message along the tracks to B via an instantaneous communicator . The worldline of this message is the blue fat arrow, along the +x axis, which is a line of simultaneity for the frames of A and B. As seen from the spacetime diagram, B will receive the message before having sent it out, a violation of causality.      It is not necessary for signals to be instantaneous to violate causality. Even if the signal from D to C were slightly shallower than the x axis , it would still be possible for B to receive his message before he had sent it. By increasing the speed of the train to near light speeds, the ct and x axes can be squeezed very close to the dashed line representing the speed of light. With this modified setup, it can be demonstrated that even signals only slightly faster than the speed of light will result in causality violation.      Therefore, if ": null
    },
    {
        "causality": "Causality"
    },
    {
        " is to be preserved, one of the consequences of special relativity is that no information signal or material object can travel ": null
    },
    {
        "faster than light": "Faster Than Light"
    },
    {
        " in vacuum.     This is not to say that all faster than light speeds are impossible. Various trivial situations can be described where some things move faster than light.  For example, the location where the beam of a search light hits the bottom of a cloud can move faster than light when the search light is turned rapidly .   ,                In 1850, ": null
    },
    {
        "Hippolyte Fizeau": "Hippolyte Fizeau"
    },
    {
        " and ": null
    },
    {
        "Léon Foucault": "Léon Foucault"
    },
    {
        " independently established that light travels more slowly in water than in air, thus validating a prediction of ": null
    },
    {
        "Fresnels": "Augustin-Jean Fresnel"
    },
    {
        " wave theory of light": "Wave Theory Of Light"
    },
    {
        " and invalidating the corresponding prediction of Newtons ": null
    },
    {
        "corpuscular theory": "Corpuscular Theory Of Light"
    },
    {
        ".  The speed of light was measured in still water. What would be the speed of light in flowing water?     In 1851, Fizeau conducted an experiment to answer this question, a simplified representation of which is illustrated in Fig.  5 & 8209;1. A beam of light is divided by a beam splitter, and the split beams are passed in opposite directions through a tube of flowing water. They are recombined to form interference fringes, indicating a difference in optical path length, that an observer can view. The experiment demonstrated that dragging of the light by the flowing water caused displacement of the fringes, showing that the motion of the water had affected the speed of the light.     According to the theories prevailing at the time, light traveling through a moving medium would be a simple sum of its speed through the medium plus the speed of the medium. Contrary to expectation, Fizeau found that although light appeared to be dragged by the water, the magnitude of the dragging was much lower than expected. If u c/n is the speed of light in still water, and v is the speed of the water, and u is the water-bourne speed of light in the lab frame with the flow of water adding to or subtracting from the speed of light, then     : u     v    .     Fizeaus results, although consistent with Fresnels earlier hypothesis of ": null
    },
    {
        "partial aether dragging": "Aether Drag Hypothesis"
    },
    {
        ", were extremely disconcerting to physicists of the time. Among other things, the presence of an index of refraction term meant that, since n depends on wavelength, the aether must be capable of sustaining different motions at the same time. A variety of theoretical explanations were proposed to explain Fresnels dragging coefficient that were completely at odds with each other. Even before the ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        ", Fizeaus experimental results were among a number of observations that created a critical situation in explaining the optics of moving bodies.      From the point of view of special relativity, Fizeaus result is nothing but an approximation to , the relativistic formula for composition of velocities.     : u       c           v                 Because of the finite speed of light, if the relative motions of a source and receiver include a transverse component, then the direction from which light arrives at the receiver will be displaced from the geometric position in space of the source relative to the receiver. The classical calculation of the displacement takes two forms and makes different predictions depending on whether the receiver, the source, or both are in motion with respect to the medium. If the receiver is in motion, the displacement would be the consequence of the ": null
    },
    {
        "aberration of light": "Aberration Of Light"
    },
    {
        ". The incident angle of the beam relative to the receiver would be calculable from the vector sum of the receivers motions and the velocity of the incident light.  If the source is in motion, the displacement would be the consequence of ": null
    },
    {
        "light-time correction": "Light-Time Correction"
    },
    {
        ". The displacement of the apparent position of the source from its geometric position would be the result of the sources motion during the time that its light takes to reach the receiver.      The classical explanation failed experimental test. Since the aberration angle depends on the relationship between the velocity of the receiver and the speed of the incident light, passage of the incident light through a refractive medium should change the aberration angle. In 1810, Arago used this expected phenomenon in a failed attempt to measure the speed of light,  and in 1870, ": null
    },
    {
        "George Airy": "George Airy"
    },
    {
        " tested the hypothesis using a water-filled telescope, finding that, against expectation, the measured aberration was identical to the aberration measured with an air-filled telescope.  A cumbrous attempt to explain these results used the hypothesis of partial aether-drag,  but was incompatible with the results of the ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        ", which apparently demanded complete aether-drag.      Assuming inertial frames, the relativistic expression for the aberration of light is applicable to both the receiver moving and source moving cases. A variety of trigonometrically equivalent formulas have been published. Expressed in terms of the variables in Fig.  5 & 8209;2, these include      :          OR              OR                            The classical Doppler effect depends on whether the source, receiver, or both are in motion with respect to the medium. The relativistic Doppler effect is independent of any medium. Nevertheless, relativistic Doppler shift for the longitudinal case, with source and receiver moving directly towards or away from each other, can be derived as if it were the classical phenomenon, but modified by the addition of a ": null
    },
    {
        "time dilation": "Time Dilation"
    },
    {
        " term, and that is the treatment described here.       Assume the receiver and the source are moving away from each other with a relative speed v  as measured by an observer on the receiver or the source . Assume that the source is stationary in the medium. Then     : f fs   where cs is the speed of sound.     For light, and with the receiver moving at relativistic speeds, clocks on the receiver are ": null
    },
    {
        "time dilated": "Time Dilation"
    },
    {
        " relative to clocks at the source. The receiver will measure the received frequency to be     : fr   fs     where   :   v/c     and   :         is the ": null
    },
    {
        "Lorentz factor": "Lorentz Factor"
    },
    {
        ".     An identical expression for relativistic Doppler shift is obtained when performing the analysis in the reference frame of the receiver with a moving source.             The transverse Doppler effect is one of the main novel predictions of the special theory of relativity.     Classically, one might expect that if source and receiver are moving transversely with respect to each other with no longitudinal component to their relative motions, that there should be no Doppler shift in the light arriving at the receiver.     Special relativity predicts otherwise. Fig.  5 & 8209;3 illustrates two common variants of this scenario. Both variants can be analyzed using simple time dilation arguments. In Fig.  5 & 8209;3a, the receiver observes light from the source as being blueshifted by a factor of   . In Fig.  5 & 8209;3b, the light is redshifted by the same factor.         Time dilation and length contraction are not optical illusions, but genuine effects. Measurements of these effects are not an artifact of ": null
    },
    {
        "Doppler shift": "Doppler Shift"
    },
    {
        ", nor are they the result of neglecting to take into account the time it takes light to travel from an event to an observer.     Scientists make a fundamental distinction between measurement or observation on the one hand, versus visual appearance, or what one sees. The measured shape of an object is a hypothetical snapshot of all of the objects points as they exist at a single moment in time. The visual appearance of an object, however, is affected by the varying lengths of time that light takes to travel from different points on the object to ones eye.        For many years, the distinction between the two had not been generally appreciated, and it had generally been thought that a length contracted object passing by an observer would in fact actually be seen as length contracted. In 1959, James Terrell and ": null
    },
    {
        "Roger Penrose": "Roger Penrose"
    },
    {
        " independently pointed out that differential time lag effects in signals reaching the observer from the different parts of a moving object result in a fast moving objects visual appearance being quite different from its measured shape. For example, a receding object would appear contracted, an approaching object would appear elongated, and a passing object would have a skew appearance that has been likened to a rotation.     A sphere in motion retains the appearance of a sphere, although images on the surface of the sphere will appear distorted.         Fig.  5 & 8209;4 illustrates a cube viewed from a distance of four times the length of its sides. At high speeds, the sides of the cube that are perpendicular to the direction of motion appear hyperbolic in shape. The cube is actually not rotated. Rather, light from the rear of the cube takes longer to reach ones eyes compared with light from the front, during which time the cube has moved to the right. This illusion has come to be known as  Terrell rotation  or the Terrell–Penrose effect. Even though it has been many decades since Terrell and Penrose published their observations, popular writings continue to conflate measurement versus appearance. For example, Michio Kaku wrote in Einsteins Cosmos : ... imagine that the speed of light is only 20 miles per hour. If a car were to go down the street, it might look compressed in the direction of motion, being squeezed like an accordion down to perhaps 1 inch in length.     Another example where visual appearance is at odds with measurement comes from the observation of apparent ": null
    },
    {
        "superluminal motion": "Superluminal Motion"
    },
    {
        " in various ": null
    },
    {
        "radio galaxies": "Radio Galaxies"
    },
    {
        ", ": null
    },
    {
        "BL Lac objects": "Bl Lac Objects"
    },
    {
        ", ": null
    },
    {
        "quasars": "Quasars"
    },
    {
        ", and other astronomical objects that eject ": null
    },
    {
        "relativistic-speed jets": "Astrophysical Jet"
    },
    {
        " of matter at narrow angles with respect to the viewer. An apparent optical illusion results giving the appearance of faster than light travel.    In Fig.  5 & 8209;5, galaxy ": null
    },
    {
        "M87": "Messier 87"
    },
    {
        " streams out a high-speed jet of subatomic particles almost directly towards us, but Penrose–Terrell rotation causes the jet to appear to be moving laterally in the same manner that the appearance of the cube in Fig.  5 & 8209;4 has been stretched out.        Section ": null
    },
    {
        "Consequences derived from the Lorentz transformation": "Consequences Derived From The Lorentz Transformation"
    },
    {
        " dealt strictly with ": null
    },
    {
        "kinematics": "Kinematics"
    },
    {
        ", the study of the motion of points, bodies, and systems of bodies without considering the forces that caused the motion. This section discusses masses, forces, energy and so forth, and as such requires consideration of physical effects beyond those encompassed by the Lorentz transformation itself.            As an objects speed approaches the speed of light from an observers point of view, its ": null
    },
    {
        "relativistic mass": "Relativistic Mass"
    },
    {
        " increases thereby making it more and more difficult to accelerate it from within the observers frame of reference.     The energy content of an object at rest with mass m equals mc 2 . Conservation of energy implies that, in any reaction, a decrease of the sum of the masses of particles must be accompanied by an increase in kinetic energies of the particles after the reaction. Similarly, the mass of an object can be increased by taking in kinetic energies.     In addition to the papers referenced above—which give derivations of the Lorentz transformation and describe the foundations of special relativity—Einstein also wrote at least four papers giving ": null
    },
    {
        "heuristic": "Heuristic"
    },
    {
        " arguments for the equivalence of mass and energy, for .     Mass–energy equivalence is a consequence of special relativity. The energy and momentum, which are separate in Newtonian mechanics, form a ": null
    },
    {
        "four-vector": "Four-Vector"
    },
    {
        " in relativity, and this relates the time component to the space components in a non-trivial way. For an object at rest, the energy–momentum four-vector is . The momentum is equal to the energy multiplied by the velocity divided by c 2 . As such, the Newtonian mass of an object, which is the ratio of the momentum to the velocity for slow velocities, is equal to E/c 2 .     The energy and momentum are properties of matter and radiation, and it is impossible to deduce that they form a four-vector just from the two basic postulates of special relativity by themselves, because these dont talk about matter or radiation, they only talk about space and time. The derivation therefore requires some additional physical reasoning. In his 1905 paper, Einstein used the additional principles that Newtonian mechanics should hold for slow velocities, so that there is one energy scalar and one three-vector momentum at slow velocities, and that the conservation law for energy and momentum is exactly true in relativity. Furthermore, he assumed that the energy of light is transformed by the same Doppler-shift factor as its frequency, which he had previously shown to be true based on Maxwells equations. The first of Einsteins papers on this subject was Does the Inertia of a Body Depend upon its Energy Content? in 1905.  A. Einstein, Annalen der Physik. 18 Other authors suggest that the argument was merely inconclusive because it relied on some implicit assumptions.      Einstein acknowledged the controversy over his derivation in his 1907 survey paper on special relativity. There he notes that it is problematic to rely on Maxwells equations for the heuristic mass–energy argument. The argument in his 1905 paper can be carried out with the emission of any massless particles, but the Maxwell equations are implicitly used to make it obvious that the emission of light in particular can be achieved only by doing work. To emit electromagnetic waves, all you have to do is shake a charged particle, and this is clearly doing work, so that the emission is of energy. , A. Einstein, Annalen der Physik 23 : 371–384 In a letter to Carl Seelig in 1955, Einstein wrote I had already previously found that Maxwells theory did not account for the micro-structure of radiation and could therefore have no general validity. , Einstein letter to Carl Seelig, 1955.          Since one can not travel faster than light, one might conclude that a human can never travel farther from Earth than 40 light years if the traveler is active between the ages of 20 and 60. One would easily think that a traveler would never be able to reach more than the very few solar systems which exist within the limit of 20–40 light years from the earth. But that would be a mistaken conclusion. Because of time dilation, a hypothetical spaceship can travel thousands of light years during the pilots 40 active years. If a spaceship could be built that accelerates at a constant ": null
    },
    {
        "1g": "Gravity Of Earth"
    },
    {
        ", it will, after a little less than a year, be travelling at almost the speed of light as seen from Earth. This is described by:     : v       where v is the velocity at a time t, a is the acceleration of 1g and t is the time as measured by people on Earth.  Therefore, after one year of accelerating at 9.81 & thinsp;m/s 2 , the spaceship will be travelling at v 0.77c relative to Earth. Time dilation will increase the travellers life span as seen from the reference frame of the Earth to 2.7 years, but his lifespan measured by a clock travelling with him will not change. During his journey, people on Earth will experience more time than he does. A 5-year round trip for him will take 6.5 Earth years and cover a distance of over 6 light-years. A 20-year round trip for him will land him back on Earth having travelled for 335 Earth years and a distance of 331 light years.  A full 40-year trip at 1g will appear on Earth to last 58,000 years and cover a distance of 55,000 light years. A 40-year trip at 1.1g will take 148,000 Earth years and cover about 140,000 light years. A one-way 28 year trip at 1g acceleration could reach 2,000,000 light-years to the Andromeda Galaxy. This same time dilation is why a muon travelling close to c is observed to travel much farther than c times its ": null
    },
    {
        "half-life": "Half-Life"
    },
    {
        " .  . Library.thinkquest.org. Retrieved on 2013-04-24.          Theoretical investigation in ": null
    },
    {
        "classical electromagnetism": "Classical Electromagnetism"
    },
    {
        " led to the discovery of wave propagation. Equations generalizing the electromagnetic effects found that finite propagation speed of the E and B fields required certain behaviors on charged particles. The general study of moving charges forms the ": null
    },
    {
        "Liénard–Wiechert potential": "Liénard–Wiechert Potential"
    },
    {
        ", which is a step towards special relativity.     The Lorentz transformation of the ": null
    },
    {
        "electric field": "Electric Field"
    },
    {
        " of a moving charge into a non-moving observers reference frame results in the appearance of a mathematical term commonly called the ": null
    },
    {
        "magnetic field": "Magnetic Field"
    },
    {
        ". Conversely, the magnetic field generated by a moving charge disappears and becomes a purely electrostatic field in a comoving frame of reference. ": null
    },
    {
        "Maxwells equations": "Maxwells Equations"
    },
    {
        " are thus simply an empirical fit to special relativistic effects in a classical model of the Universe. As electric and magnetic fields are reference frame dependent and thus intertwined, one speaks of electromagnetic fields. Special relativity provides the transformation rules for how an electromagnetic field in one inertial frame appears in another inertial frame.     ": null
    },
    {
        "Maxwells equations": "Maxwells Equations"
    },
    {
        " in the 3D form are already consistent with the physical content of special relativity, although they are easier to manipulate in a ": null
    },
    {
        "manifestly covariant": "Manifestly Covariant"
    },
    {
        " form, i.e. in the language of ": null
    },
    {
        "tensor": "Tensor"
    },
    {
        " calculus.        Special relativity can be combined with ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " to form ": null
    },
    {
        "relativistic quantum mechanics": "Relativistic Quantum Mechanics"
    },
    {
        " and ": null
    },
    {
        "quantum electrodynamics": "Quantum Electrodynamics"
    },
    {
        ". It is an ": null
    },
    {
        "unsolved problem in physics": "List Of Unsolved Problems In Physics"
    },
    {
        " how ": null
    },
    {
        "general relativity": "General Relativity"
    },
    {
        " and quantum mechanics can be unified; ": null
    },
    {
        "quantum gravity": "Quantum Gravity"
    },
    {
        " and a ": null
    },
    {
        "theory of everything": "Theory Of Everything"
    },
    {
        " , which require a unification including general relativity too, are active and ongoing areas in theoretical research.     The early ": null
    },
    {
        "Bohr–Sommerfeld atomic model": "Bohr Modelrefinements"
    },
    {
        " explained the ": null
    },
    {
        "fine structure": "Fine Structure"
    },
    {
        " of ": null
    },
    {
        "alkali metal": "Alkali Metal"
    },
    {
        " atoms using both special relativity and the preliminary knowledge on ": null
    },
    {
        "quantum mechanics": "Quantum Mechanics"
    },
    {
        " of the time.      In 1928, ": null
    },
    {
        "Paul Dirac": "Paul Dirac"
    },
    {
        " constructed an influential ": null
    },
    {
        "relativistic wave equation": "Relativistic Wave Equation"
    },
    {
        ", now known as the ": null
    },
    {
        "Dirac equation": "Dirac Equation"
    },
    {
        " in his honour,  that is fully compatible both with special relativity and with the final version of quantum theory existing after 1926. This equation explained not only the intrinsic angular momentum of the electrons called  spin , it also led to the prediction of the ": null
    },
    {
        "antiparticle": "Antiparticle"
    },
    {
        " of the electron ,  and ": null
    },
    {
        "fine structure": "Fine Structure"
    },
    {
        " could only be fully explained with special relativity. It was the first foundation of  relativistic quantum mechanics . In non-relativistic quantum mechanics, spin is ": null
    },
    {
        "phenomenological": "Wikt:Phenomenological"
    },
    {
        " and cannot be explained.     On the other hand, the existence of antiparticles leads to the conclusion that relativistic quantum mechanics is not enough for a more accurate and complete theory of particle interactions. Instead, a theory of particles interpreted as quantized fields, called  quantum field theory , becomes necessary; in which particles can be ": null
    },
    {
        "created and destroyed": "Annihilation"
    },
    {
        " throughout space and time.            Special relativity in its ": null
    },
    {
        "Minkowski spacetime": "Minkowski Spacetime"
    },
    {
        " is accurate only when the ": null
    },
    {
        "absolute value": "Absolute Value"
    },
    {
        " of the ": null
    },
    {
        "gravitational potential": "Gravitational Potential"
    },
    {
        " is much less than c 2 in the region of interest.     In a strong gravitational field, one must use ": null
    },
    {
        "general relativity": "General Relativity"
    },
    {
        ". General relativity becomes special relativity at the limit of a weak field. At very small scales, such as at the ": null
    },
    {
        "Planck length": "Planck Length"
    },
    {
        " and below, quantum effects must be taken into consideration resulting in ": null
    },
    {
        "quantum gravity": "Quantum Gravity"
    },
    {
        ". However, at macroscopic scales and in the absence of strong gravitational fields, special relativity is experimentally tested to extremely high degree of accuracy The number of works is vast, see as example:      An overview can be found on    and thus accepted by the physics community. Experimental results which appear to contradict it are not reproducible and are thus widely believed to be due to experimental errors.     Special relativity is mathematically self-consistent, and it is an organic part of all modern physical theories, most notably ": null
    },
    {
        "quantum field theory": "Quantum Field Theory"
    },
    {
        ", ": null
    },
    {
        "string theory": "String Theory"
    },
    {
        ", and general relativity .     Newtonian mechanics mathematically follows from special relativity at small velocities – thus Newtonian mechanics can be considered as a special relativity of slow moving bodies. See ": null
    },
    {
        "classical mechanics": "Classical Mechanics"
    },
    {
        " for a more detailed discussion.     Several experiments predating Einsteins 1905 paper are now interpreted as evidence for relativity. Of these it is known Einstein was aware of the Fizeau experiment before 1905,  and historians have concluded that Einstein was at least aware of the Michelson–Morley experiment as early as 1899 despite claims he made in his later years that it played no role in his development of the theory.    The ": null
    },
    {
        "Fizeau experiment": "Fizeau Experiment"
    },
    {
        " measured the speed of light in moving media, with results that are consistent with relativistic addition of colinear velocities.   The famous ": null
    },
    {
        "Michelson–Morley experiment": "Michelson–Morley Experiment"
    },
    {
        " gave further support to the postulate that detecting an absolute reference velocity was not achievable. It should be stated here that, contrary to many alternative claims, it said little about the invariance of the speed of light with respect to the source and observers velocity, as both source and observer were travelling together at the same velocity at all times.   The ": null
    },
    {
        "Trouton–Noble experiment": "Trouton–Noble Experiment"
    },
    {
        " showed that the torque on a capacitor is independent of position and inertial reference frame.   The ": null
    },
    {
        "Experiments of Rayleigh and Brace": "Experiments Of Rayleigh And Brace"
    },
    {
        " showed that length contraction doesnt lead to birefringence for a co-moving observer, in accordance with the relativity principle.     ": null
    },
    {
        "Particle accelerators": "Particle Accelerator"
    },
    {
        " routinely accelerate and measure the properties of particles moving at near the speed of light, where their behavior is completely consistent with relativity theory and inconsistent with the earlier ": null
    },
    {
        "Newtonian mechanics": "Newtonian Mechanics"
    },
    {
        ". These machines would simply not work if they were not engineered according to relativistic principles. In addition, a considerable number of modern experiments have been conducted to test special relativity. Some examples:   ": null
    },
    {
        "Tests of relativistic energy and momentum": "Tests Of Relativistic Energy And Momentum"
    },
    {
        " – testing the limiting speed of particles   ": null
    },
    {
        "Ives–Stilwell experiment": "Ives–Stilwell Experiment"
    },
    {
        " – testing relativistic Doppler effect and time dilation   ": null
    },
    {
        "Experimental testing of time dilation": "Experimental Testing Of Time Dilation"
    },
    {
        " – relativistic effects on a fast-moving particles half-life   ": null
    },
    {
        "Kennedy–Thorndike experiment": "Kennedy–Thorndike Experiment"
    },
    {
        " – time dilation in accordance with Lorentz transformations   ": null
    },
    {
        "Hughes–Drever experiment": "Hughes–Drever Experiment"
    },
    {
        " – testing isotropy of space and mass   ": null
    },
    {
        "Modern searches for Lorentz violation": "Modern Searches For Lorentz Violation"
    },
    {
        " – various modern tests   Experiments to test ": null
    },
    {
        "emission theory": "Emission Theory"
    },
    {
        " demonstrated that the speed of light is independent of the speed of the emitter.   Experiments to test the ": null
    },
    {
        "aether drag hypothesis": "Aether Drag Hypothesis"
    },
    {
        " – no aether flow obstruction .                        Special relativity uses a flat 4-dimensional Minkowski space  – an example of a ": null
    },
    {
        "spacetime": "Spacetime"
    },
    {
        ". Minkowski spacetime appears to be very similar to the standard 3-dimensional ": null
    },
    {
        "Euclidean space": "Euclidean Space"
    },
    {
        ", but there is a crucial difference with respect to time.     In 3D space, the ": null
    },
    {
        "differential": "Differential"
    },
    {
        " of distance ds is defined by     : ds2 d    d  dx12 + dx22 + dx32,     where  are the differentials of the three spatial dimensions. In Minkowski geometry, there is an extra dimension with coordinate X 0 derived from time, such that the distance differential fulfills     : ds2 -dX02 + dX12 + dX22 + dX32,     where  are the differentials of the four spacetime dimensions. This suggests a deep theoretical insight: special relativity is simply a ": null
    },
    {
        "rotational symmetry": "Rotational Symmetry"
    },
    {
        " of our spacetime, analogous to the rotational symmetry of Euclidean space .  Just as Euclidean space uses a ": null
    },
    {
        "Euclidean metric": "Euclidean Metric"
    },
    {
        ", so spacetime uses a ": null
    },
    {
        "Minkowski metric": "Minkowski Metric"
    },
    {
        ". Basically, special relativity can be stated as the invariance of any spacetime interval when viewed from any inertial reference frame. All equations and effects of special relativity can be derived from this rotational symmetry  of Minkowski spacetime.     The actual form of ds above depends on the metric and on the choices for the X 0 coordinate.   To make the time coordinate look like the space coordinates, it can be treated as ": null
    },
    {
        "imaginary": "Imaginary Number"
    },
    {
        " .   According to ": null
    },
    {
        "Misner, Thorne and Wheeler": "Gravitation"
    },
    {
        " , ultimately the deeper understanding of both special and general relativity will come from the study of the Minkowski metric and to take , rather than a disguised Euclidean metric using ict as the time coordinate.     Some authors use , with factors of c elsewhere to compensate; for instance, spatial coordinates are divided by c or factors of c ±2 are included in the metric tensor.    These numerous conventions can be superseded by using ": null
    },
    {
        "natural units": "Natural Units"
    },
    {
        " where . Then space and time have equivalent units, and no factors of c appear anywhere.            If we reduce the spatial dimensions to 2, so that we can represent the physics in a 3D space     : ds2 dx12 + dx22 - c2 dt2,     we see that the ": null
    },
    {
        "null": "Null Geodesic"
    },
    {
        "geodesics": "Geodesic"
    },
    {
        " lie along a dual-cone defined by the equation;     : ds2 0 dx12 + dx22 - c2 dt2     or simply     : dx12 + dx22 c2 dt2,      which is the equation of a circle of radius  c  dt.         If we extend this to three spatial dimensions, the null geodesics are the 4-dimensional cone:     : ds2 0 dx12 + dx22 + dx32 - c2 dt2     so     : dx12 + dx22 + dx32 c2 dt2.        As illustrated in Fig.  10 & 8209;3, the null geodesics can be visualized as a set of continuous concentric spheres with radii    c  dt.     This null dual-cone represents the line of sight of a point in space. That is, when we look at the ": null
    },
    {
        "stars": "Star"
    },
    {
        " and say The light from that star which I am receiving is X years old , we are looking down this line of sight: a null geodesic. We are looking at an event a distance d   away and a time d/c in the past. For this reason the null dual cone is also known as the light cone.     The cone in the −t region is the information that the point is receiving, while the cone in the +t section is the information that the point is sending.     The geometry of Minkowski space can be depicted using ": null
    },
    {
        "Minkowski diagrams": "Minkowski Diagram"
    },
    {
        ", which are useful also in understanding many of the ": null
    },
    {
        "thought-experiments": "Thought Experiment"
    },
    {
        " in special relativity.     Note that, in 4d spacetime, the concept of the ": null
    },
    {
        "center of mass": "Center Of Mass"
    },
    {
        " becomes more complicated, see ": null
    },
    {
        "center of mass ": "Center Of Mass"
    },
    {
        ".             Above, the Lorentz transformation for the time coordinate and three space coordinates illustrates that they are intertwined. This is true more generally: certain pairs of timelike and spacelike quantities naturally combine on equal footing under the same Lorentz transformation.     The Lorentz transformation in standard configuration above, i.e. for a boost in the x direction, can be recast into matrix form as follows:     :     ct  x  y  z           & -  & 0 & 0    -  &   & 0 & 0    0 & 0 & 1 & 0    0 & 0 & 0 & 1           ct  x  y  z             ct-   x      x -     ct   y  z           In Newtonian mechanics, quantities which have magnitude and direction are mathematically described as 3d vectors in Euclidean space, and in general they are parametrized by time. In special relativity, this notion is extended by adding the appropriate timelike quantity to a spacelike vector quantity, and we have 4d vectors, or ": null
    },
    {
        "four vectors": "Four Vector"
    },
    {
        " , in Minkowski spacetime. The components of vectors are written using ": null
    },
    {
        "tensor index notation": "Tensor Index Notation"
    },
    {
        ", as this has numerous advantages. The notation makes it clear the equations are ": null
    },
    {
        "manifestly covariant": "Manifestly Covariant"
    },
    {
        " under the ": null
    },
    {
        "Poincaré group": "Poincaré Group"
    },
    {
        ", thus bypassing the tedious calculations to check this fact. In constructing such equations, we often find that equations previously thought to be unrelated are, in fact, closely connected being part of the same tensor equation. Recognizing other physical quantities as tensors simplifies their transformation laws. Throughout, upper indices are contravariant indices rather than exponents except when they indicate a square , and lower indices are covariant indices. For simplicity and consistency with the earlier equations, Cartesian coordinates will be used.     The simplest example of a four-vector is the position of an event in spacetime, which constitutes a timelike component ct and spacelike component , in a ": null
    },
    {
        "contravariant": "Covariance And Contravariance Of Vectors"
    },
    {
        " position": "Position Vector"
    },
    {
        " four vector": "Four Vector"
    },
    {
        " with components:     : X  .     where we define  so that the time coordinate has the same dimension of distance as the other spatial dimensions; so that space and time are treated equally. Jean-Bernard Zuber & Claude Itzykson, Quantum Field Theory, pg 5,  ": null
    },
    {
        "Charles W. Misner": "Charles W. Misner"
    },
    {
        ", ": null
    },
    {
        "Kip S. Thorne": "Kip S. Thorne"
    },
    {
        " & ": null
    },
    {
        "John A. Wheeler": "John A. Wheeler"
    },
    {
        ", Gravitation, pg 51,  ": null
    },
    {
        "George Sterman": "George Sterman"
    },
    {
        ", An Introduction to Quantum Field Theory, pg 4 ,  Now the transformation of the contravariant components of the position 4-vector can be compactly written as:     : X  X      where there is an ": null
    },
    {
        "implied summation": "Einstein Notation"
    },
    {
        " on   from 0 to 3, and   is a ": null
    },
    {
        "matrix": "Matrix"
    },
    {
        ".     More generally, all contravariant components of a ": null
    },
    {
        "four-vector": "Four-Vector"
    },
    {
        " T  transform from one frame to another frame by a ": null
    },
    {
        "Lorentz transformation": "Lorentz Transformation"
    },
    {
        "four-velocity": "Four-Velocity"
    },
    {
        " U  defined as the derivative of the position 4-vector with respect to ": null
    },
    {
        "proper time": "Proper Time"
    },
    {
        "relativistic energy": "Mass In Special Relativity"
    },
    {
        " E   and ": null
    },
    {
        "relativistic momentum": "Relativistic Momentum"
    },
    {
        "       of an object are respectively the timelike and spacelike components of a ": null
    },
    {
        "contravariant": "Covariance And Contravariance Of Vectors"
    },
    {
        " four momentum": "Four Momentum"
    },
    {
        " vector:     : P  m U  m      .     where m is the ": null
    },
    {
        "invariant mass": "Invariant Mass"
    },
    {
        ".     The ": null
    },
    {
        "four-acceleration": "Four-Acceleration"
    },
    {
        " is the proper time derivative of 4-velocity:     : A        The transformation rules for three-dimensional velocities and accelerations are very awkward; even above in standard configuration the velocity equations are quite complicated owing to their non-linearity. On the other hand, the transformation of four-velocity and four-acceleration are simpler by means of the Lorentz transformation matrix.     The ": null
    },
    {
        "four-gradient": "Four-Gradient"
    },
    {
        " of a ": null
    },
    {
        "scalar field": "Scalar Field"
    },
    {
        " φ transforms covariantly rather than contravariantly:     :     &   &   &       &   &   &       & +  & 0 & 0    +  &   & 0 & 0    0 & 0 & 1 & 0    0 & 0 & 0 & 1         which is the transpose of:     :               only in Cartesian coordinates. Its the ": null
    },
    {
        "covariant derivative": "Covariant Derivative"
    },
    {
        " which transforms in manifest covariance, in Cartesian coordinates this happens to reduce to the partial derivatives, but not in other coordinates.     More generally, the covariant components of a 4-vector transform according to the inverse Lorentz transformation:     : T   T      where   is the reciprocal matrix of   .     The postulates of special relativity constrain the exact form the Lorentz transformation matrices take.     More generally, most physical quantities are best described as ": null
    },
    {
        "tensors": "Tensor"
    },
    {
        ". So to transform from one frame to another, we use the well-known ": null
    },
    {
        "tensor transformation law": "Tensor"
    },
    {
        "      : T                 T     where   is the reciprocal matrix of   . All tensors transform by this rule.     An example of a four dimensional second order ": null
    },
    {
        "antisymmetric tensor": "Antisymmetric Tensor"
    },
    {
        " is the ": null
    },
    {
        "relativistic angular momentum": "Relativistic Angular Momentum"
    },
    {
        ", which has six components: three are the classical ": null
    },
    {
        "angular momentum": "Angular Momentum"
    },
    {
        ", and the other three are related to the boost of the center of mass of the system. The derivative of the relativistic angular momentum with respect to proper time is the relativistic torque, also second order ": null
    },
    {
        "antisymmetric tensor": "Antisymmetric Tensor"
    },
    {
        ".     The ": null
    },
    {
        "electromagnetic field tensor": "Electromagnetic Field Tensor"
    },
    {
        " is another second order antisymmetric ": null
    },
    {
        "tensor field": "Tensor Field"
    },
    {
        ", with six components: three for the ": null
    },
    {
        "electric field": "Electric Field"
    },
    {
        " and another three for the ": null
    },
    {
        "magnetic field": "Magnetic Field"
    },
    {
        ". There is also the ": null
    },
    {
        "stress–energy tensor": "Stress–Energy Tensor"
    },
    {
        " for the electromagnetic field, namely the ": null
    },
    {
        "electromagnetic stress–energy tensor": "Electromagnetic Stress–Energy Tensor"
    },
    {
        ".         The ": null
    },
    {
        "metric tensor": "Metric Tensor"
    },
    {
        " allows one to define the ": null
    },
    {
        "inner product": "Inner Product"
    },
    {
        " of two vectors, which in turn allows one to assign a magnitude to the vector. Given the four-dimensional nature of spacetime the ": null
    },
    {
        "Minkowski metric": "Minkowski Metric"
    },
    {
        " η has components  which can be arranged in a  matrix:     :       -1 & 0 & 0 & 0    0 & 1 & 0 & 0    0 & 0 & 1 & 0    0 & 0 & 0 & 1         which is equal to its reciprocal,   , in those frames. Throughout we use the signs as above, different authors use different conventions – see ": null
    },
    {
        "Minkowski metric": "Minkowski Metric"
    },
    {
        " alternative signs.     The ": null
    },
    {
        "Poincaré group": "Poincaré Group"
    },
    {
        " is the most general group of transformations which preserves the Minkowski metric:     :             and this is the physical symmetry underlying special relativity.     The metric can be used for ": null
    },
    {
        "raising and lowering indices": "Raising And Lowering Indices"
    },
    {
        " on vectors and tensors. Invariants can be constructed using the metric, the inner product of a 4-vector T with another 4-vector S is:     : TST  T        Invariant means that it takes the same value in all inertial frames, because it is a scalar , and so no Λ appears in its trivial transformation. The magnitude of the 4-vector T is the positive square root of the inner product with itself:     : |        One can extend this idea to tensors of higher order, for a second order tensor we can form the invariants:     : T,TT,TTT       similarly for higher order tensors. Invariant expressions, particularly inner products of 4-vectors with themselves, provide equations that are useful for calculations, because one doesnt need to perform Lorentz transformations to determine the invariants.         The coordinate differentials transform also contravariantly:     : dX  dX      so the squared length of the differential of the position four-vector dX μ  constructed using     : d  dX        -2+2+2+2      is an invariant. Notice that when the ": null
    },
    {
        "line element": "Line Element"
    },
    {
        " dX 2 is negative that  is the differential of ": null
    },
    {
        "proper time": "Proper Time"
    },
    {
        ", while when dX 2 is positive,  is differential of the ": null
    },
    {
        "proper distance": "Proper Distance"
    },
    {
        ".     The 4-velocity U μ has an invariant form:     : 2   U  U  -c2       which means all velocity four-vectors have a magnitude of c. This is an expression of the fact that there is no such thing as being at coordinate rest in relativity: at the least, you are always moving forward through time. Differentiating the above equation by τ produces:     : 2  U  0.     So in special relativity, the acceleration four-vector and the velocity four-vector are orthogonal.         The invariant magnitude of the ": null
    },
    {
        "momentum 4-vector": "Four-Momentum"
    },
    {
        " generates the ": null
    },
    {
        "energy–momentum relation": "Energy–Momentum Relation"
    },
    {
        "Newtons third law of motion": "Newtons Third Law Of Motion"
    },
    {
        ", both forces must be defined as the rate of change of momentum with respect to the same time coordinate. That is, it requires the 3D force defined above. Unfortunately, there is no tensor in 4D which contains the components of the 3D force vector among its components.     If a particle is not traveling at c, one can transform the 3D force from the particles co-moving reference frame into the observers reference frame. This yields a 4-vector called the ": null
    },
    {
        "four-force": "Four-Force"
    },
    {
        ". It is the rate of change of the above energy momentum ": null
    },
    {
        "four-vector": "Four-Vector"
    },
    {
        " with respect to proper time. The covariant version of the four-force is:     : F    m A      In the rest frame of the object, the time component of the four force is zero unless the ": null
    },
    {
        "invariant mass": "Invariant Mass"
    },
    {
        " of the object is changing in which case it is the negative of that rate of change of mass, times c. In general, though, the components of the four force are not equal to the components of the three-force, because the three force is defined by the rate of change of momentum with respect to coordinate time, i.e. dp/dt while the four force is defined by the rate of change of momentum with respect to proper time, i.e. dp/dτ.     In a continuous medium, the 3D density of force combines with the density of power to form a covariant 4-vector. The spatial part is the result of dividing the force on a small cell by the volume of that cell. The time component is −1/c": null
    }
]