[
    {
        "The star height problem in ": null
    },
    {
        "formal language theory": "Formal Language Theory"
    },
    {
        " is the question whether all ": null
    },
    {
        "regular languages": "Regular Language"
    },
    {
        "can be expressed using ": null
    },
    {
        "regular expressions": "Regular Expressionformal Language Theory"
    },
    {
        "of limited ": null
    },
    {
        "star height": "Star Height"
    },
    {
        ", i.e. with a limited nesting depth of ": null
    },
    {
        "Kleene star": "Kleene Star"
    },
    {
        "s. Specifically, is a nesting depth of one always sufficient? If not, is there an ": null
    },
    {
        "algorithm": "Algorithm"
    },
    {
        " to determine how many are required? The problem was raised by .       The first question was answered in the negative when in 1963, Eggan gave examples of regular languages of ": null
    },
    {
        "star height": "Star Height"
    },
    {
        " n for every n. Here, the star height h of a regular language L is defined as the minimum star height among all regular expressions representing L. The first few languages found by  are described in the following, by means of giving a regular expression for each language:     :     e1 & a1     e2 &     e3 &     e4 &             The construction principle for these expressions is that expression e is obtained by concatenating two copies of en , appropriately renaming the letters of the second copy using fresh alphabet symbols, concatenating the result with another fresh alphabet symbol, and then by surrounding the resulting expression with a Kleene star. The remaining, more difficult part, is to prove that for en there is no equivalent regular expression of star height less than n; a proof is given in .     However, Eggans examples use a large ": null
    },
    {
        "alphabet": "Alphabet"
    },
    {
        ", of size 2 n -1 for the language with star height n. He thus asked whether we can also find examples over binary alphabets. This was proved to be true shortly afterwards by .   Their examples can be described by an ": null
    },
    {
        "inductively defined": "Inductive Definition"
    },
    {
        " family of regular expressions over the binary alphabet   as follows  cf.  and by .       In contrast, the second question turned out to be much more difficult, and the question became a famous open problem in formal language theory for over two decades . For years, there was only little progress. The ": null
    },
    {
        "pure-group languages": "Pure-Group Language"
    },
    {
        "were the first interesting family of regular languages for which the star height problem was proved to be ": null
    },
    {
        "decidable": "Decidable Language"
    },
    {
        " . But the general problem remained open for more than 25 years until it was settled by ": null
    },
    {
        "Hashiguchi": "Kosaburo Hashiguchi"
    },
    {
        ", who in 1988 published an algorithm to determine the ": null
    },
    {
        "star height": "Star Height"
    },
    {
        " of any regular language. The algorithm wasnt at all practical, being of non-": null
    },
    {
        "elementary": "Elementary"
    },
    {
        " complexity. To illustrate the immense resource consumptions of that algorithm, Lombardy and Sakarovitch give some actual numbers:          Notice that alone the number 10 has 10 billion zeros when written down in ": null
    },
    {
        "decimal notation": "Decimal Notation"
    },
    {
        ", and is already by far larger than the ": null
    },
    {
        "number of atoms in the observable universe": "Observable Universematter Content"
    },
    {
        ".     A much more efficient algorithm than Hashiguchis procedure was devised by Kirsten in 2005. This algorithm runs, for a given ": null
    },
    {
        "nondeterministic finite automaton": "Nondeterministic Finite Automaton"
    },
    {
        " as input, within double-": null
    },
    {
        "exponential space": "Expspace"
    },
    {
        ". Yet the resource requirements of this algorithm still greatly exceed the margins of what is considered practically feasible.     This algorithm has been optimized and generalized to trees by Colcombet and Löding in 2008 , as part of the theory of regular cost functions.   It has been implemented in 2017 in the tool suite Stamina. Nathanaël Fijalkow, Hugo Gimbert, Edon Kelmendi, Denis Kuperberg:  . CIAA 2017: 101-112 Tool available at ": null
    }
]