[
    {
        "In ": null
    },
    {
        "statistics": "Statistics"
    },
    {
        ", a unit is one member of a set of entities being studied. It is the main source for the mathematical abstraction of a ": null
    },
    {
        "random variable": "Payment"
    },
    {
        " . Common examples of a unit would be a single person, animal, plant, manufactured item, or country that belongs to a larger collection of such entities being studied.     Units are often referred to as being either experimental units, sampling units or ": null
    },
    {
        "units of observation": "Unit Of Observation"
    },
    {
        "statistical population": "Statistical Population"
    },
    {
        ". This term is commonly used in ": null
    },
    {
        "opinion polling": "Opinion Polling"
    },
    {
        " and ": null
    },
    {
        "survey sampling": "Survey Sampling"
    },
    {
        ".     For example, in an experiment on educational methods, methods may be applied to classrooms of students. This would make the classroom as the experimental unit. Measurements of progress may be obtained from individual students, as observational units. But the treatment being applied to the class would not be applied independently to the individual students. Hence the student could not be regarded as the experimental unit. The class, or the teacher by method combination if the teacher had multiple classes, would be the appropriate experimental unit.     In most statistical studies, the goal is to generalize from the observed units to a larger set consisting of all comparable units that exist but are not directly observed. For example, if we randomly sample 100 people and ask them which candidate they intend to vote for in an election, our main interest is in the voting behavior of all eligible voters, not exclusively on the 100 observed units.     In some cases, the observed units may not form a sample from any meaningful population, but rather constitute a ": null
    },
    {
        "convenience sample": "Accidental Sampling"
    },
    {
        ", or may represent the entire population of interest. In this situation, we may study the units ": null
    },
    {
        "descriptively": "Descriptive Statistics"
    },
    {
        ", or we may study their ": null
    },
    {
        "dynamics": "Dynamic Model"
    },
    {
        " over time. But it typically does not make sense to talk about generalizing to a larger population of such units. Studies involving ": null
    },
    {
        "countries": "Country"
    },
    {
        " or ": null
    },
    {
        "business firms": "Business"
    },
    {
        " are often of this type. ": null
    },
    {
        "Clinical trials": "Clinical Trial"
    },
    {
        "also typically use convenience samples, however the aim is often to make inferences about the effectiveness of treatments in other patients, and given the inclusion and exclusion criteria for some clinical trials, the sample may not be representative of the majority of patients with the condition or disease.     In simple ": null
    },
    {
        "data": "Data"
    },
    {
        " sets, the units are in one-to-one correspondence with the data values. In more complex data sets, multiple measurements are made for each unit. For example, if blood pressure measurements are made daily for a week on each subject in a study, there would be seven data values for each statistical unit. Multiple measurements taken on an individual are not ": null
    },
    {
        "independent": "Independent And Identically Distributed Random Variables"
    },
    {
        " . Ignoring these dependencies during the analysis can lead to an inflated sample size or ": null
    },
    {
        "pseudoreplication": "Pseudoreplication"
    },
    {
        ".     While a unit is often the lowest level at which observations are made, in some cases, a unit can be further decomposed as a ": null
    },
    {
        "statistical assembly": "Statistical Assembly"
    },
    {
        ".     Many statistical analyses use quantitative ": null
    },
    {
        "data": "Data"
    },
    {
        " that have ": null
    },
    {
        "units of measurement": "Units Of Measurement"
    }
]