[
    {
        "               Stephen , often referred to as Stephen of Blois, was ": null
    },
    {
        "King of England": "King Of England"
    },
    {
        " from 22 December 1135 to his death. He was ": null
    },
    {
        "Count of Boulogne": "Count Of Boulogne"
    },
    {
        " from 1125 until 1147 and ": null
    },
    {
        "Duke of Normandy": "Duke Of Normandy"
    },
    {
        " from 1135 until 1144. His reign was marked by ": null
    },
    {
        "the Anarchy": "The Anarchy"
    },
    {
        ", a civil war with his cousin and rival, the ": null
    },
    {
        "Empress Matilda": "Empress Matilda"
    },
    {
        ", whose son, ": null
    },
    {
        "Henry II": "Henry Ii Of England"
    },
    {
        ", succeeded Stephen as the first of the ": null
    },
    {
        "Angevin kings of England": "Angevin Kings Of England"
    },
    {
        ".     Stephen was born in the ": null
    },
    {
        "County of Blois": "County Of Blois"
    },
    {
        " in central ": null
    },
    {
        "France": "France In The Middle Ages"
    },
    {
        "; his father, ": null
    },
    {
        "Count Stephen-Henry": "Count Stephen-Henry"
    },
    {
        ", died while Stephen was still young, and he was brought up by his mother, ": null
    },
    {
        "Adela": "Adela Of Normandy"
    },
    {
        ", daughter of ": null
    },
    {
        "William the Conqueror": "William The Conqueror"
    },
    {
        ". Placed into the court of his uncle, ": null
    },
    {
        "Henry I of England": "Henry I Of England"
    },
    {
        ", Stephen rose in prominence and was granted extensive lands. He married ": null
    },
    {
        "Matilda of Boulogne": "Matilda Of Boulogne"
    },
    {
        ", inheriting additional estates in ": null
    },
    {
        "Kent": "Kent"
    },
    {
        " and ": null
    },
    {
        "Boulogne": "Boulogne-Sur-Mer"
    },
    {
        " that made the couple one of the wealthiest in England. Stephen narrowly escaped drowning with Henry Is son, ": null
    },
    {
        "William Adelin": "William Adelin"
    },
    {
        ", in the sinking of the  White Ship  in 1120; Williams death left the succession of the English throne open to challenge. When Henry died in 1135, Stephen quickly crossed the ": null
    },
    {
        "English Channel": "English Channel"
    },
    {
        " and with the help of his brother ": null
    },
    {
        "Henry, Bishop of Winchester": "Henry, Bishop Of Winchester"
    },
    {
        " and ": null
    },
    {
        "Abbot of Glastonbury": "Abbot Of Glastonbury"
    },
    {
        ", took the throne, arguing that the preservation of order across the kingdom took priority over his earlier oaths to support the claim of Henry Is daughter, the Empress Matilda.     The early years of Stephens reign were largely successful, despite a series of attacks on his ": null
    },
    {
        "possessions in England and Normandy": "Angevin Empirebackground"
    },
    {
        " by ": null
    },
    {
        "David I of Scotland": "David I Of Scotland"
    },
    {
        ", ": null
    },
    {
        "Welsh": "Wales In The High Middle Ages"
    },
    {
        " rebels, and the Empress Matildas husband ": null
    },
    {
        "Geoffrey Plantagenet, Count of Anjou": "Geoffrey Plantagenet, Count Of Anjou"
    },
    {
        ". In 1138, the Empresss half-brother ": null
    },
    {
        "Robert of Gloucester": "Robert, 1St Earl Of Gloucester"
    },
    {
        " rebelled against Stephen, threatening civil war. Together with his close advisor, ": null
    },
    {
        "Waleran de Beaumont": "Waleran De Beaumont, 1St Earl Of Worcester"
    },
    {
        ", Stephen took firm steps to defend his rule, including arresting a powerful family of bishops. When the Empress and Robert invaded in 1139, Stephen was unable to crush the revolt rapidly, and it took hold in the south-west of England. Captured at the ": null
    },
    {
        "battle of Lincoln": "Battle Of Lincoln"
    },
    {
        " in 1141, he was abandoned by many of his followers and lost control of ": null
    },
    {
        "Normandy": "Duchy Of Normandy"
    },
    {
        ". He was freed only after his wife and ": null
    },
    {
        "William of Ypres": "William Of Ypres"
    },
    {
        ", one of his military commanders, captured Robert at the ": null
    },
    {
        "Rout of Winchester": "Rout Of Winchester"
    },
    {
        ", but the war dragged on for many years with neither side able to win an advantage.     Stephen became increasingly concerned with ensuring that his son ": null
    },
    {
        "Eustace": "Eustace Iv, Count Of Boulogne"
    },
    {
        " would inherit his throne. The King tried to convince ": null
    },
    {
        "the Church": "Catholic Church In England And Walesnorman Conquest Of England And Wales"
    },
    {
        " to agree to crown Eustace to reinforce his claim; ": null
    },
    {
        "Pope Eugene III": "Pope Eugene Iii"
    },
    {
        " refused, and Stephen found himself in a sequence of increasingly bitter arguments with his senior clergy. In 1153 the Empresss son, ": null
    },
    {
        "Henry FitzEmpress": "Henry Fitzempress"
    },
    {
        ", invaded England and built an alliance of powerful regional barons to support his claim for the throne. The two armies met at ": null
    },
    {
        "Wallingford": "Wallingford Castle"
    },
    {
        ", but neither sides barons were keen to fight another pitched battle. Stephen began to examine a negotiated peace, a process hastened by the sudden death of Eustace. Later in the year Stephen and Henry agreed to the ": null
    },
    {
        "Treaty of Winchester": "Treaty Of Winchester"
    },
    {
        ", in which Stephen recognised Henry as his heir in exchange for peace, passing over ": null
    },
    {
        "William": "William I, Count Of Boulogne"
    },
    {
        ", Stephens second son. Stephen died the following year. Modern historians have extensively debated the extent to which his personality, external events, or the weaknesses in the Norman state contributed to this prolonged period of civil war.              Stephen was born in ": null
    },
    {
        "Blois": "Blois"
    },
    {
        ", France, in either 1092 or 1096. Davis, p. 1; King , p. 5.  His father was ": null
    },
    {
        "Stephen-Henry": "Stephen, Count Of Blois"
    },
    {
        ", ": null
    },
    {
        "Count of Blois and Chartres": "Counts Of Blois"
    },
    {
        ", an important French nobleman, and an active ": null
    },
    {
        "crusader": "Crusades"
    },
    {
        ", who played only a brief part in Stephens early life. Davis, p. 1. During the ": null
    },
    {
        "First Crusade": "First Crusade"
    },
    {
        " Stephen-Henry had acquired a reputation for cowardice, and he returned to the Levant again in 1101 to rebuild his reputation; there he was killed at the ": null
    },
    {
        "battle of Ramlah": "Battle Of Ramla"
    },
    {
        ". Davis, p. 4. Stephens mother, ": null
    },
    {
        "Adela": "Adela Of Normandy"
    },
    {
        ", was the daughter of ": null
    },
    {
        "William the Conqueror": "William The Conqueror"
    },
    {
        " and ": null
    },
    {
        "Matilda of Flanders": "Matilda Of Flanders"
    },
    {
        ", famous amongst her contemporaries for her piety, wealth and political talent. She had a strong matriarchal influence on Stephen during his early years. King , p. 5.      France in the 12th century was a loose collection of counties and smaller polities, under the minimal control of the King of France. The Kings power was linked to his control of the rich province of ": null
    },
    {
        "Île-de-France": "Île-De-France"
    },
    {
        ", just to the east of Stephens home county of Blois. Duby, p. 192; Barlow, p. 111. In the west lay the three counties of ": null
    },
    {
        "Maine": "Maine"
    },
    {
        ", ": null
    },
    {
        "Anjou": "Anjou"
    },
    {
        " and ": null
    },
    {
        "Touraine": "Touraine"
    },
    {
        ", and to the north of Blois was the ": null
    },
    {
        "Duchy of Normandy": "Duchy Of Normandy"
    },
    {
        ", from which William the Conqueror had conquered England in 1066. Williams children were still fighting over the collective Anglo-Norman inheritance. Carpenter, p. 137. The rulers across this region spoke a similar language, albeit with regional dialects, followed the same religion, and were closely interrelated; they were also highly competitive and frequently in conflict with one another for valuable territory and the castles that controlled them. Barlow, p. 111; Koziol, p. 17; Thompson, p. 3.     Stephen had at least four brothers and one sister, along with two probable half-sisters. His eldest brother was ": null
    },
    {
        "William": "William, Count Of Sully"
    },
    {
        ", who under normal circumstances would have ruled Blois and Chartres. William was probably ": null
    },
    {
        "intellectually disabled": "Intellectually Disabled"
    },
    {
        ", and Adela instead had the counties pass to her second son, later also Count ": null
    },
    {
        "Theobald II of Champagne": "Theobald Ii Of Champagne"
    },
    {
        ".  Stephens remaining older brother, Odo, died young, probably in his early teens. His younger brother, ": null
    },
    {
        "Henry of Blois": "Henry Of Blois"
    },
    {
        ", was probably born four years after him. The brothers formed a close-knit family group, and Adela encouraged Stephen to take up the role of a feudal knight, whilst steering Henry towards a career in the church, possibly so that their personal career interests would not overlap. King , p. 5; Davis, p. 5. Unusually, Stephen was raised in his mothers household rather than being sent to a close relative; he was taught ": null
    },
    {
        "Latin": "Latin"
    },
    {
        " and riding, and was educated in recent history and ": null
    },
    {
        "Biblical stories": "Bible Story"
    },
    {
        " by his tutor, William the Norman. King , p. 9; Crouch , p. 241.          Stephens early life was heavily influenced by his relationship with his uncle ": null
    },
    {
        "Henry I": "Henry I Of England"
    },
    {
        ". Henry seized power in England following the death of his elder brother ": null
    },
    {
        "William Rufus": "William Rufus"
    },
    {
        ". In 1106 he invaded and captured the ": null
    },
    {
        "Duchy of Normandy": "Duchy Of Normandy"
    },
    {
        ", controlled by his eldest brother, ": null
    },
    {
        "Robert Curthose": "Robert Curthose"
    },
    {
        ", defeating Roberts army at the ": null
    },
    {
        "battle of Tinchebray": "Battle Of Tinchebray"
    },
    {
        ". Huscroft, p. 69. Henry then found himself in conflict with ": null
    },
    {
        "Louis VI of France": "Louis Vi Of France"
    },
    {
        ", who took the opportunity to declare Roberts son ": null
    },
    {
        "William Clito": "William Clito"
    },
    {
        " the Duke of Normandy. Huscroft, p. 70. Henry responded by forming a network of alliances with the western counties of France against Louis, resulting in a regional conflict that would last throughout Stephens early life. Adela and Theobald allied themselves with Henry, and Stephens mother decided to place him in Henrys court. King , p. 13. Henry fought his next military campaign in Normandy, from 1111 onwards, where rebels led by ": null
    },
    {
        "Robert of Bellême": "Robert Of Bellême"
    },
    {
        " were opposing his rule. Stephen was probably with Henry during the military campaign of 1112, when he was knighted by the King. He was present at court during the Kings visit to the ": null
    },
    {
        "Abbey of Saint-Evroul": "Abbey Of Saint-Evroul"
    },
    {
        " in 1113. King , p. 11. Stephen probably first visited England in either 1113 or 1115, almost certainly as part of Henrys court.     Henry became a powerful patron of Stephen, and probably chose to support him because Stephen was part of his extended family and a regional ally, yet not sufficiently wealthy or powerful in his own right to represent a threat to either the King or his heir, ": null
    },
    {
        "William Adelin": "William Adelin"
    },
    {
        ". Davis, p. 10. As a third surviving son, even of an influential regional family, Stephen still needed the support of a powerful patron to progress in life. With Henrys support, he rapidly began to accumulate lands and possessions. Following the battle of Tinchebray in 1106, Henry confiscated the ": null
    },
    {
        "County of Mortain": "County Of Mortain"
    },
    {
        " from ": null
    },
    {
        "William, Count of Mortain": "William, Count Of Mortain"
    },
    {
        ", and the ": null
    },
    {
        "Honour of Eye": "Honour Of Eye"
    },
    {
        ", a large lordship previously owned by ": null
    },
    {
        "Robert Malet": "Robert Malet"
    },
    {
        ". Davis, p. 7; King , p. 13. In 1113, Stephen was granted both the title and the honour, although without the lands previously held by William in England. The gift of the ": null
    },
    {
        "Honour of Lancaster": "Honour Of Lancaster"
    },
    {
        " also followed after it was confiscated by Henry from ": null
    },
    {
        "Roger the Poitevin": "Roger The Poitevin"
    },
    {
        ". Davis, p. 8. Stephen was also given lands in ": null
    },
    {
        "Alençon": "Alençon"
    },
    {
        " in southern Normandy by Henry, but the local Normans rebelled, seeking assistance from ": null
    },
    {
        "Fulk IV, Count of Anjou": "Fulk Iv, Count Of Anjou"
    },
    {
        ". King , p. 15. Stephen and his older brother Theobald were comprehensively beaten in the subsequent campaign, which culminated in the ": null
    },
    {
        "battle of Alençon": "Battle Of Alençon"
    },
    {
        ", and the territories were not recovered. Davis, p. 6; King , p. 15.     Finally, the King arranged for Stephen to marry ": null
    },
    {
        "Matilda": "Matilda Of Boulogne"
    },
    {
        " in 1125, the daughter and only heiress of the ": null
    },
    {
        "Count of Boulogne": "Count Of Boulogne"
    },
    {
        ", who owned both the important continental port of ": null
    },
    {
        "Boulogne": "Boulogne"
    },
    {
        " and vast estates in the north-west and south-east of England. In 1127, William Clito, a potential claimant to the English throne, seemed likely to become the ": null
    },
    {
        "Count of Flanders": "Count Of Flanders"
    },
    {
        "; Stephen was sent by the King on a mission to prevent this, and in the aftermath of his successful election, William Clito attacked Stephens lands in neighbouring Boulogne in retaliation. King , pp. 32–33. Eventually a truce was declared, and William Clito died the following year. King , p. 34.     White Ship and succession   In 1120, the English political landscape changed dramatically. Three hundred passengers embarked on the  White Ship  to travel from ": null
    },
    {
        "Barfleur": "Barfleur"
    },
    {
        " in Normandy to England, including the heir to the throne, William Adelin, and many other senior nobles. Bradbury, p. 1. Stephen had intended to sail on the same ship but changed his mind at the last moment and got off to await another vessel, either out of concern for overcrowding on board the ship, or because he was suffering from ": null
    },
    {
        "diarrhoea": "Diarrhoea"
    },
    {
        ". Bradbury, p. 2.  The ship foundered en route, and all but two of the passengers died, including William Adelin. Bradbury, p. 3.      With Adelin dead, the inheritance to the English throne was thrown into doubt. Rules of succession in western Europe at the time were uncertain; in some parts of France, male ": null
    },
    {
        "primogeniture": "Primogeniture"
    },
    {
        ", in which the eldest son would inherit a title, was becoming more popular. Barlow, p. 162. It was also traditional for the King of France to crown his successor whilst he himself was still alive, making the intended line of succession relatively clear, but this was not the case in England. In other parts of Europe, including Normandy and England, the tradition was for lands to be divided up, with the eldest son taking patrimonial lands—usually considered to be the most valuable—and younger sons being given smaller, or more recently acquired, partitions or estates. The problem was further complicated by the sequence of unstable Anglo-Norman successions over the previous sixty years—": null
    },
    {
        "William the Conqueror": "William The Conqueror"
    },
    {
        " had gained England by force, ": null
    },
    {
        "William Rufus": "William Rufus"
    },
    {
        " and ": null
    },
    {
        "Robert Curthose": "Robert Curthose"
    },
    {
        " had fought a war between them to establish their inheritance, and Henry had only acquired control of Normandy by force. There had been no peaceful, uncontested successions. Huscroft, pp. 65, 69–71; Carpenter, p. 124.     With William Adelin dead, Henry had only one other legitimate child, ": null
    },
    {
        "Matilda": "Empress Matilda"
    },
    {
        ", but as a woman she was at a substantial political disadvantage. Despite the King taking a second wife, ": null
    },
    {
        "Adeliza of Louvain": "Adeliza Of Louvain"
    },
    {
        ", it became increasingly unlikely that he would have another legitimate son, and he instead looked to Matilda as his intended heir. Bradbury, pp. 6–7. Matilda claimed the title of Holy Roman Empress through her marriage to ": null
    },
    {
        "Emperor Henry V": "Emperor Henry V"
    },
    {
        ", but her husband died in 1125, and she was remarried in 1128 to ": null
    },
    {
        "Geoffrey Plantagenet, Count of Anjou": "Geoffrey Plantagenet, Count Of Anjou"
    },
    {
        ", whose lands bordered the Duchy of Normandy. Barlow, p. 160. Geoffrey was unpopular with the Anglo-Norman elite: as an ": null
    },
    {
        "Angevin": "House Of Ingelger"
    },
    {
        " ruler, he was a traditional enemy of the Normans. Barlow, p. 161. At the same time, tensions continued to grow as a result of Henrys domestic policies, in particular the high level of revenue he was raising to pay for his various wars. Carpenter, p. 160. Conflict was curtailed, however, by the power of the Kings personality and reputation. Carpenter, p. 161; Stringer, p. 8.     Henry attempted to build up a base of political support for Matilda in both England and Normandy, demanding that his court take ": null
    },
    {
        "oaths": "Oath"
    },
    {
        " first in 1127, and then again in 1128 and 1131, to recognise Matilda as his immediate successor and recognise her descendants as the rightful rulers after her. Bradbury, p. 9; Barlow, p. 161. Stephen was amongst those who took this oath in 1127. King , pp. 30–31; Barlow, p. 161. Nonetheless, relations between Henry, Matilda, and Geoffrey became increasingly strained towards the end of the Kings life. Matilda and Geoffrey suspected that they lacked genuine support in England, and proposed to Henry in 1135 that the King should hand over the royal castles in Normandy to Matilda whilst he was still alive and insist on the Norman nobility swearing immediate allegiance to her, thereby giving the couple a much more powerful position after Henrys death. King , pp. 38–39. Henry angrily declined to do so, probably out of a concern that Geoffrey would try to seize power in Normandy somewhat earlier than intended. King , p. 38; Crouch , p. 162. A fresh rebellion broke out in southern Normandy, and Geoffrey and Matilda intervened militarily on behalf of the rebels. In the middle of this confrontation, Henry unexpectedly fell ill and died near ": null
    },
    {
        "Lyons-la-Forêt": "Lyons-La-Forêt"
    },
    {
        ".          Stephen was a well established figure in Anglo-Norman society by 1135. He was extremely wealthy, well-mannered and liked by his peers; he was also considered a man capable of firm action. King , p. 301. Chroniclers recorded that despite his wealth and power he was a modest and easy-going leader, happy to sit with his men and servants, casually laughing and eating with them. He was very pious, both in terms of his observance of religious rituals and his personal generosity to the church. Crouch , pp. 279–281. Stephen also had a personal ": null
    },
    {
        "Augustinian": "Augustinian"
    },
    {
        " confessor appointed to him by the Archbishop of Canterbury, who implemented a ": null
    },
    {
        "penitential regime": "Penance"
    },
    {
        " for him, and Stephen encouraged the new order of ": null
    },
    {
        "Cistercians": "Cistercians"
    },
    {
        " to form abbeys on his estates, winning him additional allies within the church. Barlow, p. 164.     Rumours about his fathers cowardice during the First Crusade, however, continued to circulate, and a desire to avoid the same reputation may have influenced some of Stephens rasher military actions. Barlow, p. 167. His wife, Matilda, played a major role in running their vast English estates, which contributed to the couple being the second-richest lay household in the country after the King and Queen. King , p. 24. The landless Flemish nobleman ": null
    },
    {
        "William of Ypres": "William Of Ypres"
    },
    {
        " had joined Stephens household in 1133. Bennett, pp. 102, 106; Amt, p. 86.     Stephens younger brother, ": null
    },
    {
        "Henry of Blois": "Henry Of Blois"
    },
    {
        ", had also risen to power under Henry I. Henry of Blois had become a ": null
    },
    {
        "Cluniac": "Cluny Abbey"
    },
    {
        " monk and followed Stephen to England, where the King made him ": null
    },
    {
        "Abbot of Glastonbury": "Abbot Of Glastonbury"
    },
    {
        ", the richest abbey in England. King , p. 29. The King then appointed him ": null
    },
    {
        "Bishop of Winchester": "Bishop Of Winchester"
    },
    {
        ", one of the richest bishoprics, allowing him to retain Glastonbury as well. The combined revenues of the two positions made Henry of Winchester the second-richest man in England after the King. Henry of Winchester was keen to reverse what he perceived as encroachment by the Norman kings on the rights of the church. Stringer, p. 66. The Norman kings had traditionally exercised a great deal of power and autonomy over the church within their territories. From the 1040s onwards, however, successive popes had put forward a reforming message that emphasised the importance of the church being governed more coherently and more hierarchically from the centre and established its own sphere of authority and jurisdiction, separate from and independent of that of the lay ruler , in the words of historian Richard Huscroft. Huscroft, p. 190.        When news began to spread of Henry Is death, many of the potential claimants to the throne were not well placed to respond. Geoffrey and Matilda were in Anjou, rather awkwardly supporting the rebels in their campaign against the royal army, which included a number of Matildas supporters such as Robert of Gloucester. Many of these barons had taken an oath to stay in Normandy until the late King was properly buried, which prevented them from returning to England. Crouch , p. 246. Stephens elder brother Theobald was further south still, in Blois. Barlow, pp. 163–164. Stephen, however, was in Boulogne, and when news reached him of Henrys death he left for England, accompanied by his military household. Robert of Gloucester had garrisoned the ports of Dover and Canterbury and some accounts suggest that they refused Stephen access when he first arrived. Barlow, p. 163; King , p. 43. Nonetheless Stephen probably reached his own estate on the edge of London by 8 December and over the next week he began to seize power in England. King , p. 43.     The crowds in London traditionally claimed a right to elect the King, and they proclaimed Stephen the new monarch, believing that he would grant the city new rights and privileges in return. King , p. 45. Henry of Blois delivered the support of the church to Stephen: Stephen was able to advance to ": null
    },
    {
        "Winchester": "Winchester"
    },
    {
        ", where ": null
    },
    {
        "Roger, Bishop of Salisbury": "Roger, Bishop Of Salisbury"
    },
    {
        " and ": null
    },
    {
        "Lord Chancellor": "Lord Chancellor"
    },
    {
        ", instructed the royal treasury to be handed over to Stephen. King , pp. 45–46. On 15 December, Henry delivered an agreement under which Stephen would grant extensive freedoms and liberties to the church, in exchange for the Archbishop of Canterbury and the Papal Legate supporting his succession to the throne. King , p. 46. There was the slight problem of the religious oath that Stephen had taken to support the Empress Matilda, but Henry convincingly argued that the late King had been wrong to insist that his court take the oath. Crouch , p. 247.     Furthermore, the late King had only insisted on that oath to protect the stability of the kingdom, and in light of the chaos that might now ensue, Stephen would be justified in ignoring it. Henry was also able to persuade ": null
    },
    {
        "Hugh Bigod": "Hugh Bigod, 1St Earl Of Norfolk"
    },
    {
        ", the late Kings royal steward, to swear that the King had changed his mind about the succession on his deathbed, nominating Stephen instead.  Stephens coronation was held a week later at ": null
    },
    {
        "Westminster Abbey": "Westminster Abbey"
    },
    {
        " on 22 December. King , p. 47.      Meanwhile, the Norman nobility gathered at ": null
    },
    {
        "Le Neubourg": "Le Neubourg"
    },
    {
        " to discuss declaring Theobald king, probably following the news that Stephen was gathering support in England. King , pp. 46–47. The Normans argued that the count, as the eldest grandson of William the Conqueror, had the most valid claim over the kingdom and the duchy, and was certainly preferable to Matilda.     Theobald met with the Norman barons and Robert of Gloucester at ": null
    },
    {
        "Lisieux": "Lisieux"
    },
    {
        " on 21 December. Their discussions were interrupted by the sudden news from England that Stephens coronation was to occur the next day. King , p. 47; Barlow, p. 163. Theobald then agreed to the Normans proposal that he be made king, only to find that his former support immediately ebbed away: the barons were not prepared to support the division of England and Normandy by opposing Stephen, who subsequently financially compensated Theobald, who in return remained in Blois and supported his brothers succession. Barlow, p. 163; Carpenter, p. 168.               Stephens new Anglo-Norman kingdom had been shaped by the ": null
    },
    {
        "Norman conquest of England": "Norman Conquest Of England"
    },
    {
        " in 1066, followed by the ": null
    },
    {
        "Norman expansion into south Wales": "Norman Invasion Of Wales"
    },
    {
        " over the coming years. Barlow, p. 86. Both the kingdom and duchy were dominated by a small number of major barons who owned lands on both sides of the ": null
    },
    {
        "English Channel": "English Channel"
    },
    {
        ", with the lesser barons beneath them usually having more localised holdings. Barlow, pp. 91–92. The extent to which lands and positions should be passed down through hereditary right or by the gift of the King was still uncertain, and tensions concerning this issue had grown during the reign of Henry I. Certainly lands in Normandy, passed by hereditary right, were usually considered more important to major barons than those in England, where their possession was less certain. Henry had increased the authority and capabilities of the central royal administration, often bringing in ": null
    },
    {
        "new men": "List Of Henry Is New Men"
    },
    {
        " to fulfil key positions rather than using the established nobility. Carpenter, p. 159. In the process he had been able to maximise revenues and contain expenditures, resulting in a healthy surplus and a famously large treasury, but also increasing political tensions. Carpenter, p. 155.      Stephen had to intervene in the north of England immediately after his coronation. ": null
    },
    {
        "David I of Scotland": "David I Of Scotland"
    },
    {
        " invaded the north on the news of Henrys death, taking ": null
    },
    {
        "Carlisle": "Carlisle"
    },
    {
        ", ": null
    },
    {
        "Newcastle": "Newcastle Upon Tyne"
    },
    {
        " and other key strongholds. Northern England was a disputed territory at this time, with the Scottish kings laying a traditional claim to ": null
    },
    {
        "Cumberland": "Cumberland"
    },
    {
        ", and David also claiming ": null
    },
    {
        "Northumbria": "Northumbria"
    },
    {
        " by virtue of his marriage to the daughter of ": null
    },
    {
        "Waltheof, Earl of Northumbria": "Waltheof, Earl Of Northumbria"
    },
    {
        ". Carpenter, p. 165. Stephen rapidly marched north with an army and met David at ": null
    },
    {
        "Durham": "Durham, England"
    },
    {
        ". King , p. 53. An agreement was made under which David would return most of the territory he had taken, with the exception of Carlisle. In return, Stephen confirmed Davids son ": null
    },
    {
        "Prince Henrys": "Henry, Earl Of Northumbria"
    },
    {
        " possessions in England, including the ": null
    },
    {
        "Earldom of Huntingdon": "Earldom Of Huntingdon"
    },
    {
        ".     Returning south, Stephen held his first royal court at Easter 1136. King , p. 57. A wide range of nobles gathered at Westminster for the event, including many of the Anglo-Norman barons and most of the higher officials of the church. King , pp. 57–60; Davis, p. 22. Stephen issued a new royal charter, confirming the promises he had made to the church, promising to reverse Henry Is policies on the ": null
    },
    {
        "royal forests": "Royal Forest"
    },
    {
        " and to reform any abuses of the royal legal system. Carpenter, p. 167. He portrayed himself as the natural successor to Henrys policies, and reconfirmed the existing seven earldoms in the kingdom on their existing holders. White , p. 78. The Easter court was a lavish event, and a large amount of money was spent on the event itself, clothes and gifts. Crouch , p. 250. Stephen gave out grants of land and favours to those present and endowed numerous church foundations with land and privileges. Crouch , p. 29; King , pp. 54–55. His accession to the throne still needed to be ratified by the Pope, however, and Henry of Blois appears to have been responsible for ensuring that testimonials of support were sent both from Stephens brother Theobald and from the French king Louis VI, to whom Stephen represented a useful balance to Angevin power in the north of France. Crouch , pp. 46–47. ": null
    },
    {
        "Pope Innocent II": "Pope Innocent Ii"
    },
    {
        " confirmed Stephen as king by letter later that year, and Stephens advisers circulated copies widely around England to demonstrate his legitimacy. Crouch , pp. 248–249.     Troubles continued across Stephens kingdom. After the Welsh victory at the ": null
    },
    {
        "battle of Llwchwr": "Battle Of Llwchwr"
    },
    {
        " in January 1136 and the successful ambush of ": null
    },
    {
        "Richard Fitz Gilbert de Clare": "Richard Fitz Gilbert De Clare"
    },
    {
        " in April, south Wales rose in rebellion, starting in east ": null
    },
    {
        "Glamorgan": "Glamorgan"
    },
    {
        " and rapidly spreading across the rest of south Wales during 1137. Carpenter, pp. 164–165; Crouch , p. 258. ": null
    },
    {
        "Owain Gwynedd": "Owain Gwynedd"
    },
    {
        " and ": null
    },
    {
        "Gruffydd ap Rhys": "Gruffydd Ap Rhys"
    },
    {
        " successfully captured considerable territories, including ": null
    },
    {
        "Carmarthen Castle": "Carmarthen Castle"
    },
    {
        ". Stephen responded by sending Richards brother Baldwin and the Marcher Lord Robert Fitz Harold of Ewyas into Wales to pacify the region. Neither mission was particularly successful, and by the end of 1137 the King appears to have abandoned attempts to put down the rebellion. Historian ": null
    },
    {
        "David Crouch": "David Crouch"
    },
    {
        " suggests that Stephen effectively bowed out of Wales around this time to concentrate on his other problems. Crouch , pp. 260, 262. Meanwhile, he had put down two revolts in the south-west led by ": null
    },
    {
        "Baldwin de Redvers": "Baldwin De Redvers"
    },
    {
        " and Robert of Bampton; Baldwin was released after his capture and travelled to Normandy, where he became an increasingly vocal critic of the King. Bradbury, pp. 27–32.     The security of Normandy was also a concern. Geoffrey of Anjou invaded in early 1136 and, after a temporary truce, invaded later the same year, raiding and burning estates rather than trying to hold the territory. Barlow, p. 168. Events in England meant that Stephen was unable to travel to Normandy himself, so ": null
    },
    {
        "Waleran de Beaumont": "Waleran De Beaumont, 1St Earl Of Worcester"
    },
    {
        ", appointed by Stephen as the lieutenant of Normandy, and Theobald led the efforts to defend the duchy. Crouch , pp. 46–47; Crouch , p. 252. Stephen himself only returned to the duchy in 1137, where he met with Louis VI and Theobald to agree to an informal regional alliance, probably brokered by Henry, to counter the growing Angevin power in the region. Crouch , p. 47. As part of this deal, Louis recognised Stephens son Eustace as Duke of Normandy in exchange for Eustace giving fealty to the French King. Barlow, p. 168; Stephen was less successful, however, in regaining the Argentan province along the Normandy and Anjou border, which Geoffrey had taken at the end of 1135. Davis, p. 27. Stephen formed an army to retake it, but the frictions between his Flemish mercenary forces led by William of Ypres and the local Norman barons resulted in a battle between the two halves of his army. Davis, p. 27; Bennett, p. 102. The Norman forces then deserted Stephen, forcing the King to give up his campaign. Davis, p. 28. He agreed to another truce with Geoffrey, promising to pay him 2,000 ": null
    },
    {
        "marks": "Mark"
    },
    {
        " a year in exchange for peace along the Norman borders.      In the years following his succession, Stephens relationship with the church became gradually more complex. The royal charter of 1136 had promised to review the ownership of all the lands that had been taken by the crown from the church since 1087, but these estates were now typically owned by nobles. Henry of Bloiss claims, in his role as Abbot of Glastonbury, to extensive lands in Devon resulted in considerable local unrest. In 1136, Archbishop of Canterbury ": null
    },
    {
        "William de Corbeil": "William De Corbeil"
    },
    {
        " died. Stephen responded by seizing his personal wealth, which caused some discontent amongst the senior clergy. Henry wanted to succeed to the post, but Stephen instead supported ": null
    },
    {
        "Theobald of Bec": "Theobald Of Bec"
    },
    {
        ", who was eventually appointed. The papacy named Henry ": null
    },
    {
        "papal legate": "Papal Legate"
    },
    {
        ", possibly as consolation for not receiving Canterbury. King , p. 317.     Stephens first few years as king can be interpreted in different ways. He stabilised the northern border with Scotland, contained Geoffreys attacks on Normandy, was at peace with Louis VI, enjoyed good relations with the church and had the broad support of his barons. Barlow, pp. 165, 167; Stringer, pp. 17–18. There were significant underlying problems, nonetheless. The north of England was now controlled by David and Prince Henry, Stephen had abandoned Wales, the fighting in Normandy had considerably destabilised the duchy, and an increasing number of barons felt that Stephen had given them neither the lands nor the titles they felt they deserved or were owed. Barlow, p. 168; Crouch , p. 264; Carpenter, p. 168. Stephen was also rapidly running out of money: Henrys considerable treasury had been emptied by 1138 due to the costs of running Stephens more lavish court and the need to raise and maintain his mercenary armies fighting in England and Normandy. Carpenter, p. 169.          Stephen was attacked on several fronts during 1138. First, ": null
    },
    {
        "Robert, Earl of Gloucester": "Robert, Earl Of Gloucester"
    },
    {
        ", rebelled against the King, starting the descent into civil war in England. An illegitimate son of Henry I and the half-brother of the Empress Matilda, Robert was one of the most powerful Anglo-Norman barons, controlling estates in Normandy. He was known for his qualities as a statesman, his military experience, and leadership ability. Barlow, p. 169. Robert had tried to convince Theobald to take the throne in 1135; he did not attend Stephens first court in 1136 and it took several summons to convince him to attend court at ": null
    },
    {
        "Oxford": "Oxford"
    },
    {
        " later that year. King , pp. 61–62. In 1138, Robert renounced his fealty to Stephen and declared his support for Matilda, triggering a major regional rebellion in ": null
    },
    {
        "Kent": "Kent"
    },
    {
        " and across the south-west of England, although Robert himself remained in Normandy. Stringer, p. 18. In France, Geoffrey of Anjou took advantage of the situation by re-invading Normandy. David of Scotland also invaded the north of England once again, announcing that he was supporting the claim of his niece the Empress Matilda to the throne, pushing south into ": null
    },
    {
        "Yorkshire": "Yorkshire"
    },
    {
        ".      Anglo-Norman warfare during the reign of Stephen was characterised by ": null
    },
    {
        "attritional": "Attrition Warfare"
    },
    {
        " military campaigns, in which commanders tried to seize key enemy castles in order to allow them to take control of their adversaries territory and ultimately win a slow, strategic victory. Bradbury, p. 71. The armies of the period centred on bodies of mounted, armoured ": null
    },
    {
        "knights": "Knight"
    },
    {
        ", supported by ": null
    },
    {
        "infantry": "Infantry"
    },
    {
        " and ": null
    },
    {
        "crossbow": "Crossbow"
    },
    {
        "men. Bradbury, p. 74. These forces were either ": null
    },
    {
        "feudal": "Feudal"
    },
    {
        " levies, drawn up by local nobles for a limited period of service during a campaign, or, increasingly, mercenaries, who were expensive but more flexible and often more skilled. These armies, however, were ill-suited to besieging castles, whether the older ": null
    },
    {
        "motte-and-bailey": "Motte-And-Bailey"
    },
    {
        " designs or the newer, stone-built ": null
    },
    {
        "keeps": "Keep"
    },
    {
        ". Existing siege engines were significantly less powerful than the later ": null
    },
    {
        "trebuchet": "Trebuchet"
    },
    {
        " designs, giving defenders a substantial advantage over attackers. As a result, slow sieges to starve defenders out, or ": null
    },
    {
        "mining operations": "Tunnel Warfare"
    },
    {
        " to undermine walls, tended to be preferred by commanders over direct assaults. Occasionally pitched battles were fought between armies but these were considered highly risky endeavours and were usually avoided by prudent commanders. The cost of warfare had risen considerably in the first part of the 12th century, and adequate supplies of ready cash were increasingly proving important in the success of campaigns. Stringer, pp. 24–25.          Stephens personal qualities as a military leader focused on his skill in personal combat, his capabilities in siege warfare and a remarkable ability to move military forces quickly over relatively long distances. Stringer, pp. 15–16; Davis, p. 127. In response to the revolts and invasions, he rapidly undertook several military campaigns, focusing primarily on England rather than Normandy. His wife Matilda was sent to Kent with ships and resources from Boulogne, with the task of retaking the key port of ": null
    },
    {
        "Dover": "Dover"
    },
    {
        ", under Roberts control. A small number of Stephens household knights were sent north to help the fight against the Scots, where Davids forces were defeated later that year at the ": null
    },
    {
        "battle of the Standard": "Battle Of The Standard"
    },
    {
        " in August by the forces of ": null
    },
    {
        "Thurstan": "Thurstan"
    },
    {
        ", the ": null
    },
    {
        "Archbishop of York": "Archbishop Of York"
    },
    {
        ". Carpenter, p. 166. Despite this victory, however, David still occupied most of the north. Stephen himself went west in an attempt to regain control of ": null
    },
    {
        "Gloucestershire": "Gloucestershire"
    },
    {
        ", first striking north into the ": null
    },
    {
        "Welsh Marches": "Welsh Marches"
    },
    {
        ", taking ": null
    },
    {
        "Hereford": "Hereford"
    },
    {
        " and ": null
    },
    {
        "Shrewsbury": "Shrewsbury"
    },
    {
        ", before heading south to ": null
    },
    {
        "Bath": "Bath, Somerset"
    },
    {
        ". The town of ": null
    },
    {
        "Bristol": "Bristol"
    },
    {
        " itself proved too strong for him, and Stephen contented himself with raiding and pillaging the surrounding area. The rebels appear to have expected Robert to intervene with support that year, but he remained in Normandy throughout, trying to persuade the Empress Matilda to invade England herself. Bradbury, p. 67. Dover finally surrendered to the queens forces later in the year. Crouch , p. 256.     Stephens military campaign in England had progressed well, and historian David Crouch describes it as a military achievement of the first rank . The King took the opportunity of his military advantage to forge a peace agreement with Scotland. Stephens wife Matilda was sent to negotiate another agreement between Stephen and David, called the ": null
    },
    {
        "treaty of Durham": "Treaty Of Durham"
    },
    {
        "; Northumbria and Cumbria would effectively be granted to David and his son Henry, in exchange for their fealty and future peace along the border. Unfortunately, the powerful ": null
    },
    {
        "Ranulf I, Earl of Chester": "Ranulf I, Earl Of Chester"
    },
    {
        ", considered himself to hold the traditional rights to Carlisle and Cumberland and was extremely displeased to see them being given to the Scots. Nonetheless, Stephen could now focus his attention on the anticipated invasion of England by Robert and Matildas forces. Carpenter, p. 170.          Stephen prepared for the ": null
    },
    {
        "Angevin": "Angevin Empire"
    },
    {
        " invasion by creating a number of additional ": null
    },
    {
        "earldoms": "List Of Earldoms"
    },
    {
        ". Bradbury, p. 52. Only a handful of earldoms had existed under Henry I and these had been largely symbolic in nature. Stephen created many more, filling them with men he considered to be loyal, capable military commanders, and in the more vulnerable parts of the country assigning them new lands and additional executive powers. Bradbury, p. 70.  He appears to have had several objectives in mind, including both ensuring the loyalty of his key supporters by granting them these honours, and improving his defences in key parts of the kingdom. Stephen was heavily influenced by his principal advisor, ": null
    },
    {
        "Waleran de Beaumont": "Waleran De Beaumont, 1St Earl Of Worcester"
    },
    {
        ", the twin brother of ": null
    },
    {
        "Robert of Leicester": "Robert De Beaumont, 2Nd Earl Of Leicester"
    },
    {
        ". The Beaumont twins and their younger brother and cousins received the majority of these new earldoms. Barlow, pp. 171–172; Crouch , p. 29. From 1138 onwards, Stephen gave them the earldoms of ": null
    },
    {
        "Worcester": "Earl Of Worcester"
    },
    {
        ", ": null
    },
    {
        "Leicester": "Earldom Of Leicester"
    },
    {
        ", ": null
    },
    {
        "Hereford": "Earl Of Hereford"
    },
    {
        ", ": null
    },
    {
        "Warwick": "Earldom Of Warwick"
    },
    {
        " and ": null
    },
    {
        "Pembroke": "Earl Of Pembroke"
    },
    {
        ", which—especially when combined with the possessions of Stephens new ally, Prince Henry, in Cumberland and Northumbria—created a wide block of territory to act as a ": null
    },
    {
        "buffer zone": "Buffer Zone"
    },
    {
        " between the troubled south-west, ": null
    },
    {
        "Chester": "Chester"
    },
    {
        ", and the rest of the kingdom. Barlow, p. 172. With their new lands, the power of the Beamounts grew to the point where David Crouch suggests that it became dangerous to be anything other than a friend of Waleran at Stephens court. Crouch , p. 43.     Stephen took steps to remove a group of bishops he regarded as a threat to his rule. The royal administration under Henry I had been headed by Roger, the ": null
    },
    {
        "Bishop of Salisbury": "Bishop Of Salisbury"
    },
    {
        ", supported by Rogers nephews, ": null
    },
    {
        "Alexander": "Alexander Of Lincoln"
    },
    {
        " and ": null
    },
    {
        "Nigel": "Nigel"
    },
    {
        ", the Bishops of ": null
    },
    {
        "Lincoln": "Bishop Of Lincoln"
    },
    {
        " and ": null
    },
    {
        "Ely": "Bishop Of Ely"
    },
    {
        " respectively, and Rogers son, ": null
    },
    {
        "Lord Chancellor": "Lord Chancellor"
    },
    {
        " Roger le Poer": "Roger Le Poer"
    },
    {
        ". Davis, p. 31. These bishops were powerful landowners as well as ecclesiastical rulers, and they had begun to build new castles and increase the size of their military forces, leading Stephen to suspect that they were about to defect to the Empress Matilda. Roger and his family were also enemies of Waleran, who disliked their control of the royal administration. In June 1139, Stephen held his court in Oxford, where a fight between ": null
    },
    {
        "Alan of Brittany": "Alan, 1St Earl Of Richmond"
    },
    {
        " and Rogers men broke out, an incident probably deliberately created by Stephen. Davis, p. 32. Stephen responded by demanding that Roger and the other bishops surrender all of their castles in England. This threat was backed up by the arrest of the bishops, with the exception of Nigel who had taken refuge in ": null
    },
    {
        "Devizes Castle": "Devizes Castle"
    },
    {
        "; the bishop only surrendered after Stephen besieged the castle and threatened to execute Roger le Poer. Yoshitake, p. 98. The remaining castles were then surrendered to the King.      Stephens brother, Henry of Blois, was alarmed by this, both as a matter of principle, since Stephen had previously agreed in 1135 to respect the freedoms of the church, and more pragmatically because he himself had recently built six castles and had no desire to be treated in the same way. Barlow, p. 173. As the papal legate, he summoned the King to appear before an ecclesiastical council to answer for the arrests and seizure of property. Henry asserted the Churchs right to investigate and judge all charges against members of the clergy. Stephen sent ": null
    },
    {
        "Aubrey de Vere II": "Aubrey De Vere Ii"
    },
    {
        " as his spokesman to the council, who argued that Roger of Salisbury had been arrested not as a bishop, but rather in his role as a baron who had been preparing to change his support to the Empress Matilda. The King was supported by ": null
    },
    {
        "Hugh of Amiens": "Hugh Of Amiens"
    },
    {
        ", ": null
    },
    {
        "Archbishop of Rouen": "Archbishop Of Rouen"
    },
    {
        ", who challenged the bishops to show how ": null
    },
    {
        "canon law": "Canon Law"
    },
    {
        " entitled them to build or hold castles. Aubrey threatened that Stephen would complain to the pope that he was being harassed by the English church, and the council let the matter rest following an unsuccessful appeal to Rome. The incident successfully removed any military threat from the bishops, but it may have damaged Stephens relationship with the senior clergy, and in particular with his brother Henry. Davis, p. 34; Barlow, p. 173.                    The Angevin invasion finally arrived in 1139. Baldwin de Redvers crossed over from Normandy to ": null
    },
    {
        "Wareham": "Wareham, Dorset"
    },
    {
        " in August in an initial attempt to capture a port to receive the Empress Matildas invading army, but Stephens forces forced him to retreat into the south-west. Davis, p. 39. The following month, however, the Empress was invited by the Dowager Queen Adeliza to land at ": null
    },
    {
        "Arundel": "Arundel"
    },
    {
        " instead, and on 30 September Robert of Gloucester and the Empress arrived in England with 140 knights.  The Empress stayed at ": null
    },
    {
        "Arundel Castle": "Arundel Castle"
    },
    {
        ", whilst Robert marched north-west to ": null
    },
    {
        "Wallingford": "Wallingford Castle"
    },
    {
        " and Bristol, hoping to raise support for the rebellion and to link up with ": null
    },
    {
        "Miles of Gloucester": "Miles Of Gloucester"
    },
    {
        ", a capable military leader who took the opportunity to renounce his fealty to the King. Davis, p. 40. Stephen promptly moved south, besieging Arundel and trapping Matilda inside the castle. Bradbury, p. 78.     Stephen then agreed to a truce proposed by his brother, Henry; the full details of the truce are not known, but the results were that Stephen first released Matilda from the siege and then allowed her and her household of knights to be escorted to the south-west, where they were reunited with Robert of Gloucester. The reasoning behind Stephens decision to release his rival remains unclear. Contemporary chroniclers suggested that Henry argued that it would be in Stephens own best interests to release the Empress and concentrate instead on attacking Robert, and Stephen may have seen Robert, not the Empress, as his main opponent at this point in the conflict. He also faced a military dilemma at Arundel—the castle was considered almost impregnable, and he may have been worried that he was tying down his army in the south whilst Robert roamed freely in the west. Bradbury, p. 79. Another theory is that Stephen released Matilda out of a sense of ": null
    },
    {
        "chivalry": "Chivalry"
    },
    {
        "; he was certainly known for having a generous, courteous personality and women were not normally expected to be targeted in Anglo-Norman warfare. Gillingham , p. 31.      Having released the Empress, Stephen focused on pacifying the south-west of England. Bradbury, p. 82; Davis, p. 47. Although there had been few new defections to the Empress, his enemies now controlled a compact block of territory stretching out from Gloucester and Bristol south-west into Devon and Cornwall, west into the Welsh Marches and east as far as Oxford and Wallingford, threatening London. Bradbury, p. 81. Stephen started by attacking ": null
    },
    {
        "Wallingford Castle": "Wallingford Castle"
    },
    {
        ", held by the Empresss childhood friend ": null
    },
    {
        "Brien FitzCount": "Brien Fitzcount"
    },
    {
        ", only to find it too well defended. Bradbury, p. 83. He then left behind some forces to blockade the castle and continued west into Wiltshire to attack ": null
    },
    {
        "Trowbridge Castle": "Trowbridge Castle"
    },
    {
        ", taking the castles of ": null
    },
    {
        "South Cerney": "List Of Castles In Gloucestershire"
    },
    {
        " and ": null
    },
    {
        "Malmesbury": "Malmesbury"
    },
    {
        " en route. Bradbury, pp. 82–83. Meanwhile, Miles of Gloucester marched east, attacking Stephens rearguard forces at Wallingford and threatening an advance on London. Davis, p. 42. Stephen was forced to give up his western campaign, returning east to stabilise the situation and protect his capital. Davis, p. 43.        At the start of 1140, Nigel, Bishop of Ely, whose castles Stephen had confiscated the previous year, rebelled against Stephen as well. Nigel hoped to seize ": null
    },
    {
        "East Anglia": "East Anglia"
    },
    {
        " and established his base of operations in the ": null
    },
    {
        "Isle of Ely": "Isle Of Ely"
    },
    {
        ", then surrounded by protective ": null
    },
    {
        "fenland": "The Fens"
    },
    {
        ". Stephen responded quickly, taking an army into the fens and using boats lashed together to form a causeway that allowed him to make a surprise attack on the isle. Bradbury, p. 88. Nigel escaped to Gloucester, but his men and castle were captured, and order was temporarily restored in the east. Robert of Gloucesters men retook some of the territory that Stephen had taken in his 1139 campaign. Bradbury, p. 90. In an effort to negotiate a truce, Henry of Blois held a peace conference at ": null
    },
    {
        "Bath": "Bath, Somerset"
    },
    {
        ", to which Stephen sent his wife. The conference collapsed over the insistence by Henry and the clergy that they should set the terms of any peace deal, which Stephen found unacceptable. Bradbury, p. 91.     ": null
    },
    {
        "Ranulf of Chester": "Ranulf De Gernon, 4Th Earl Of Chester"
    },
    {
        " remained upset over Stephens gift of the north of England to Prince Henry. Davis, p. 50. Ranulf devised a plan for dealing with the problem by ambushing Henry whilst the prince was travelling back from Stephens court to Scotland after Christmas. Stephen responded to rumours of this plan by escorting Henry himself north, but this gesture proved the final straw for Ranulf. Ranulf had previously claimed that he had the rights to ": null
    },
    {
        "Lincoln Castle": "Lincoln Castle"
    },
    {
        ", held by Stephen, and under the guise of a social visit, Ranulf seized the fortification in a surprise attack. Davis, pp. 50–51. Stephen marched north to Lincoln and agreed to a truce with Ranulf, probably to keep him from joining the Empresss faction, under which Ranulf would be allowed to keep the castle. Davis, p. 51. Stephen returned to London but received news that Ranulf, his brother and their family were relaxing in Lincoln Castle with a minimal guard force, a ripe target for a surprise attack of his own. Abandoning the deal he had just made, Stephen gathered his army again and sped north, but not quite fast enough—Ranulf escaped Lincoln and declared his support for the Empress. Stephen was forced to place the castle under siege.            While Stephen and his army besieged Lincoln Castle at the start of 1141, Robert of Gloucester and Ranulf of Chester advanced on the Kings position with a somewhat larger force. Davis, p. 52. When the news reached Stephen, he held a council to decide whether to give battle or to withdraw and gather additional soldiers: Stephen decided to fight, resulting in the ": null
    },
    {
        "Battle of Lincoln": "Battle Of Lincoln"
    },
    {
        " on 2 February 1141. The King commanded the centre of his army, with Alan of Brittany on his right and ": null
    },
    {
        "William of Aumale": "William Le Gros, 1St Earl Of Albemarle"
    },
    {
        " on his left. Bradbury, p. 105. Robert and Ranulfs forces had superiority in cavalry and Stephen dismounted many of his own knights to form a solid infantry block; he joined them himself, fighting on foot in the battle.  Stephen was not a gifted public speaker, and delegated the pre-battle speech to ": null
    },
    {
        "Baldwin of Clare": "Baldwin Of Clare"
    },
    {
        ", who delivered a rousing declaration. Bradbury, p. 104. After an initial success in which Williams forces destroyed the Angevins Welsh infantry, the battle went badly for Stephen. Bradbury, p. 108. Robert and Ranulfs cavalry encircled Stephens centre, and the King found himself surrounded by the enemy army. Many of his supporters, including Waleran de Beaumont and William of Ypres, fled from the field at this point but Stephen fought on, defending himself first with his sword and then, when that broke, with a borrowed battle axe. Bradbury, pp. 108–109. Finally, he was overwhelmed by Roberts men and taken away from the field in custody.      Robert took Stephen back to Gloucester, where the King met with the Empress Matilda, and was then moved to ": null
    },
    {
        "Bristol Castle": "Bristol Castle"
    },
    {
        ", traditionally used for holding high-status prisoners. King , p. 154. He was initially left confined in relatively good conditions, but his security was later tightened and he was kept in chains. The Empress now began to take the necessary steps to have herself crowned queen in his place, which would require the agreement of the church and her coronation at ": null
    },
    {
        "Westminster": "Westminster Cathedral"
    },
    {
        ". King , p. 155. Stephens brother Henry summoned a council at ": null
    },
    {
        "Winchester": "Winchester"
    },
    {
        " before Easter in his capacity as papal legate to consider the clergys view. He had made a private deal with the Empress Matilda that he would deliver the support of the church, if she agreed to give him control over church business in England. King , p. 156. Henry handed over the royal treasury, rather depleted except for Stephens crown, to the Empress, and ": null
    },
    {
        "excommunicate": "Excommunicate"
    },
    {
        "d many of Stephens supporters who refused to switch sides. King , p. 175; Davis, p. 57. Archbishop Theobald of Canterbury was unwilling to declare Matilda queen so rapidly, however, and a delegation of clergy and nobles, headed by Theobald, travelled to see Stephen in Bristol and consult about their moral dilemma: should they abandon their oaths of fealty to the King? Stephen agreed that, given the situation, he was prepared to release his subjects from their oath of fealty to him, and the clergy gathered again in Winchester after Easter to declare the Empress Lady of England and Normandy as a precursor to her coronation. King , p. 158; Carpenter, p. 171. When Matilda advanced to London in an effort to stage her coronation in June, though, she faced an uprising by the local citizens in support of Stephen that forced her to flee to Oxford, uncrowned. King , p. 163.     Once news of Stephens capture reached him, Geoffrey of Anjou invaded Normandy again and, in the absence of Waleran of Beaumont, who was still fighting in England, Geoffrey took all the duchy south of the ": null
    },
    {
        "river Seine": "River Seine"
    },
    {
        " and east of the ": null
    },
    {
        "river Risle": "Risle"
    },
    {
        ". Carpenter, p. 173; Davis, p. 68; Crouch , p. 47. No help was forthcoming from Stephens brother Theobald this time either, who appears to have been preoccupied with his own problems with France—the new French king, ": null
    },
    {
        "Louis VII": "Louis Vii"
    },
    {
        ", had rejected his fathers regional alliance, improving relations with Anjou and taking a more bellicose line with Theobald, which would result in war the following year. Crouch , p. 52. Geoffreys success in Normandy and Stephens weakness in England began to influence the loyalty of many Anglo-Norman barons, who feared losing their lands in England to Robert and the Empress, and their possessions in Normandy to Geoffrey. Davis, p. 67. Many started to leave Stephens faction. His friend and advisor Waleran was one of those who decided to defect in mid-1141, crossing into Normandy to secure his ancestral possessions by allying himself with the Angevins, and bringing Worcestershire into the Empresss camp. Davis, pp. 67–68. Walerans twin brother, Robert of Leicester, effectively withdrew from fighting in the conflict at the same time. Other supporters of the Empress were restored in their former strongholds, such as Bishop Nigel of Ely, or received new earldoms in the west of England. The royal control over the ": null
    },
    {
        "minting": "Mint"
    },
    {
        " of coins broke down, leading to coins being struck by local barons and bishops across the country. Blackburn, p. 199.        Stephens wife Matilda played a critical part in keeping the Kings cause alive during his captivity. Queen Matilda gathered Stephens remaining lieutenants around her and the royal family in the south-east, advancing into London when the population rejected the Empress. Crouch , p. 261. Stephens long-standing commander William of Ypres remained with the Queen in London; William Martel, the royal steward, commanded operations from ": null
    },
    {
        "Sherborne": "Sherborne"
    },
    {
        " in Dorset, and Faramus of Boulogne ran the royal household. Bennett, p. 106; Crouch , p. 261. The Queen appears to have generated genuine sympathy and support from Stephens more loyal followers. Henrys alliance with the Empress proved short-lived, as they soon fell out over political patronage and ecclesiastical policy; the bishop met the Queen at ": null
    },
    {
        "Guildford": "Guildford"
    },
    {
        " and transferred his support to her. Barlow, p. 176.     The Kings eventual release resulted from the Angevin defeat at the ": null
    },
    {
        "rout of Winchester": "Rout Of Winchester"
    },
    {
        ". Robert of Gloucester and the Empress besieged Henry in the city of Winchester in July. Bradbury, p. 121. Queen Matilda and William of Ypres then encircled the Angevin forces with their own army, reinforced with fresh troops from London. In the subsequent battle the Empresss forces were defeated and Robert of Gloucester himself was taken prisoner. Barlow, p. 177. Further negotiations attempted to deliver a general peace agreement but the Queen was unwilling to offer any compromise to the Empress, and Robert refused to accept any offer to encourage him to change sides to Stephen. Instead, in November the two sides simply exchanged Robert and the King, with Stephen releasing Robert on 1 November 1141. Crouch , p. 187 Stephen began re-establishing his authority. Henry held another church council, which this time reaffirmed Stephens legitimacy to rule, and a fresh coronation of Stephen and Matilda occurred at Christmas 1141.     At the beginning of 1142 Stephen fell ill, and by Easter rumours had begun to circulate that he had died. Bradbury, pp. 134, 136. Possibly this illness was the result of his imprisonment the previous year, but he finally recovered and travelled north to raise new forces and to successfully convince Ranulf of Chester to change sides once again. Barlow, p. 178. Stephen then spent the summer attacking some of the new Angevin castles built the previous year, including ": null
    },
    {
        "Cirencester": "Cirencester Castle"
    },
    {
        ", ": null
    },
    {
        "Bampton": "Bampton Castle, Oxfordshire"
    },
    {
        " and ": null
    },
    {
        "Wareham": "Wareham, Dorset"
    },
    {
        ". Bradbury, p. 136. In September, he spotted an opportunity to seize the Empress Matilda herself in ": null
    },
    {
        "Oxford": "Oxford"
    },
    {
        ". Oxford was a secure town, protected by walls and the ": null
    },
    {
        "river Isis": "River Isis"
    },
    {
        ", but Stephen led a sudden attack across the river, leading the charge and swimming part of the way. Bradbury, p. 137. Once on the other side, the King and his men stormed into the town, trapping the Empress in the castle. ": null
    },
    {
        "Oxford Castle": "Oxford Castle"
    },
    {
        ", however, was a powerful fortress and, rather than storming it, Stephen had to ": null
    },
    {
        "settle down for a long siege": "Siege Of Oxford"
    },
    {
        ", albeit secure in the knowledge that Matilda was now surrounded. Just before Christmas, the Empress left the castle unobserved, crossed the icy river on foot and made her escape to Wallingford. The garrison surrendered shortly afterwards, but Stephen had lost an opportunity to capture his principal opponent. Bradbury, pp. 137–138.          The war between the two sides in England reached a stalemate in the mid-1140s, while Geoffrey of Anjou consolidated his hold on power in Normandy. Davis, p. 78. 1143 started precariously for Stephen when he was besieged by Robert of Gloucester at ": null
    },
    {
        "Wilton Castle": "Wilton Castle"
    },
    {
        ", an assembly point for royal forces in ": null
    },
    {
        "Herefordshire": "Herefordshire"
    },
    {
        ". Bradbury, p. 139. Stephen attempted to break out and escape, resulting in the ": null
    },
    {
        "battle of Wilton": "Battle Of Wilton"
    },
    {
        ". Once again, the Angevin cavalry proved too strong, and for a moment it appeared that Stephen might be captured for a second time. Bradbury, p. 140. On this occasion, however, ": null
    },
    {
        "William Martel": "William Martel"
    },
    {
        ", Stephens steward, made a fierce rear guard effort, allowing Stephen to escape from the battlefield. Stephen valued Williams loyalty sufficiently to agree to exchange ": null
    },
    {
        "Sherborne Castle": "Sherborne Castle"
    },
    {
        " for his safe release—this was one of the few instances where Stephen was prepared to give up a castle to ransom one of his men. Bradbury, pp. 140–141.     In late 1143, Stephen faced a new threat in the east, when ": null
    },
    {
        "Geoffrey de Mandeville, Earl of Essex": "Geoffrey De Mandeville, Earl Of Essex"
    },
    {
        ", rose up in rebellion against him in East Anglia. Bradbury, p. 141. The King had disliked the Earl for several years, and provoked the conflict by summoning Geoffrey to court, where the King arrested him. He threatened to execute Geoffrey unless the Earl handed over his various castles, including the ": null
    },
    {
        "Tower of London": "Tower Of London"
    },
    {
        ", ": null
    },
    {
        "Saffron Walden": "Saffron Walden Castle"
    },
    {
        " and ": null
    },
    {
        "Pleshey": "Pleshey Castle"
    },
    {
        ", all important fortifications because they were in, or close to, London. Bradbury, p. 143. Geoffrey gave in, but once free he headed north-east into the Fens to the Isle of Ely, from where he began a military campaign against ": null
    },
    {
        "Cambridge": "Cambridge"
    },
    {
        ", with the intention of progressing south towards London. Bradbury, p. 144. With all of his other problems and with ": null
    },
    {
        "Hugh Bigod, 1st Earl of Norfolk": "Hugh Bigod, 1St Earl Of Norfolk"
    },
    {
        ", in open revolt in ": null
    },
    {
        "Norfolk": "Norfolk"
    },
    {
        ", Stephen lacked the resources to track Geoffrey down in the Fens and made do with building a screen of castles between Ely and London, including ": null
    },
    {
        "Burwell Castle": "Burwell Castle"
    },
    {
        ". Bradbury, p. 145.     For a period, the situation continued to worsen. Ranulf of Chester revolted once again in the summer of 1144, splitting up Stephens ": null
    },
    {
        "Honour of Lancaster": "Honour Of Lancaster"
    },
    {
        " between himself and Prince Henry. Barlow, p. 179. In the west, Robert of Gloucester and his followers continued to raid the surrounding royalist territories, and Wallingford Castle remained a secure Angevin stronghold, too close to London for comfort. Meanwhile, Geoffrey of Anjou finished securing his hold on southern Normandy and in January 1144 he advanced into ": null
    },
    {
        "Rouen": "Rouen"
    },
    {
        ", the capital of the duchy, concluding his campaign. Louis VII recognised him as Duke of Normandy shortly after. Amt, p. 7. By this point in the war, Stephen was depending increasingly on his immediate royal household, such as William of Ypres and others, and lacked the support of the major barons who might have been able to provide him with significant additional forces; after the events of 1141, Stephen made little use of his network of earls. Crouch , p. 269; White , p. 133.     After 1143 the war ground on, but progressing slightly better for Stephen. Bradbury, p. 158. Miles of Gloucester, one of the most talented Angevin commanders, had died whilst hunting over the previous Christmas, relieving some of the pressure in the west. Bradbury, p. 147. Geoffrey de Mandevilles rebellion continued until September 1144, when he died during an attack on Burwell. Bradbury, p. 146. The war in the west progressed better in 1145, with the King recapturing ": null
    },
    {
        "Faringdon Castle": "Faringdon Castle"
    },
    {
        " in Oxfordshire. In the north, Stephen came to a fresh agreement with Ranulf of Chester, but then in 1146 repeated the ruse he had played on Geoffrey de Mandeville in 1143, first inviting Ranulf to court, before arresting him and threatening to execute him unless he handed over a number of castles, including ": null
    },
    {
        "Lincoln": "Lincoln Castle"
    },
    {
        " and ": null
    },
    {
        "Coventry": "Coventry Castle"
    },
    {
        ". As with Geoffrey, the moment Ranulf was released he immediately rebelled, but the situation was a stalemate: Stephen had few forces in the north with which to prosecute a fresh campaign, whilst Ranulf lacked the castles to support an attack on Stephen. By this point, however, Stephens practice of inviting barons to court and arresting them had brought him into some disrepute and increasing distrust. Davis, p. 97.            England had suffered extensively from the war by 1147, leading later Victorian historians to call the period of conflict ": null
    },
    {
        "the Anarchy": "The Anarchy"
    },
    {
        " . The contemporary  Anglo-Saxon Chronicle  recorded how there was nothing but disturbance and wickedness and robbery . Huscroft, p. 76. Certainly in many parts of the country, such as ": null
    },
    {
        "Wiltshire": "Wiltshire"
    },
    {
        ", Berkshire, the ": null
    },
    {
        "Thames Valley": "Thames Valley"
    },
    {
        " and ": null
    },
    {
        "East Anglia": "East Anglia"
    },
    {
        ", the fighting and raiding had caused serious devastation. Barlow, p. 181. Numerous ": null
    },
    {
        "adulterine": "Adulterine Castle"
    },
    {
        " , or unauthorised, castles had been built as bases for local lords—the chronicler ": null
    },
    {
        "Robert of Torigny": "Robert Of Torigny"
    },
    {
        " complained that as many as 1,115 such castles had been built during the conflict, although this was probably an exaggeration as elsewhere he suggested an alternative figure of 126. Coulson, p. 69; Bradbury, p. 191. The previously centralised royal coinage system was fragmented, with Stephen, the Empress and local lords all minting their own coins. The royal ": null
    },
    {
        "forest law": "Royal Forestforest Law"
    },
    {
        " had collapsed in large parts of the country. Carpenter, p. 197. Some parts of the country, though, were barely touched by the conflict—for example, Stephens lands in the south-east and the Angevin heartlands around Gloucester and Bristol were largely unaffected, and David I ruled his territories in the north of England effectively. Stephens overall income from his estates, however, declined seriously during the conflict, particularly after 1141, and royal control over the ": null
    },
    {
        "minting": "Mint"
    },
    {
        " of new coins remained limited outside of the south-east and East Anglia. White , p. 43; Blackburn, p. 199. With Stephen often based in the south-east, increasingly ": null
    },
    {
        "Westminster": "Westminster"
    },
    {
        ", rather than the older site of ": null
    },
    {
        "Winchester": "Winchester"
    },
    {
        ", was used as the centre of royal government. Green, pp. 110–111, cited White, p. 132.     The character of the conflict in England gradually began to shift; as historian Frank Barlow suggests, by the late 1140s the civil war was over , barring the occasional outbreak of fighting. Barlow, p. 180. In 1147 Robert of Gloucester died peacefully, and the next year the Empress Matilda left south-west England for Normandy, both of which contributed to reducing the tempo of the war. The ": null
    },
    {
        "Second Crusade": "Second Crusade"
    },
    {
        " was announced, and many Angevin supporters, including Waleran of Beaumont, joined it, leaving the region for several years. Many of the barons were making individual peace agreements with each other to secure their lands and war gains. Davis, pp. 111–112. Geoffrey and Matildas son, the future King ": null
    },
    {
        "Henry II of England": "Henry Ii Of England"
    },
    {
        ", mounted a small mercenary invasion of England in 1147 but the expedition failed, not least because Henry lacked the funds to pay his men. Surprisingly, Stephen himself ended up paying their costs, allowing Henry to return home safely; his reasons for doing so are unclear. One potential explanation is his general courtesy to a member of his extended family; another is that he was starting to consider how to end the war peacefully, and saw this as a way of building a relationship with Henry. King , p. 243; Barlow, p. 180.     The young Henry FitzEmpress returned to England again in 1149, this time planning to form a northern alliance with Ranulf of Chester. King , p. 253. The Angevin plan involved Ranulf agreeing to give up his claim to ": null
    },
    {
        "Carlisle": "Carlisle"
    },
    {
        ", held by the Scots, in return for being given the rights to the whole of the Honour of Lancaster; Ranulf would give homage to both David and Henry FitzEmpress, with Henry having seniority. King , p. 254. Following this peace agreement, Henry and Ranulf agreed to attack ": null
    },
    {
        "York": "York"
    },
    {
        ", probably with help from the Scots. King , p. 255. Stephen marched rapidly north to York and the planned attack disintegrated, leaving Henry to return to Normandy, where he was declared duke by his father. Davis, p. 107; King , p. 255.      Although still young, Henry was increasingly gaining a reputation as an energetic and capable leader. His prestige and power increased further when he unexpectedly married the attractive ": null
    },
    {
        "Eleanor, Duchess of Aquitaine": "Eleanor, Duchess Of Aquitaine"
    },
    {
        ", the recently divorced wife of Louis VII, in 1152. The marriage made Henry the future ruler of a huge swathe of territory across France. Carpenter, p. 188.     In the final years of the war, Stephen began to focus on the issue of his family and the succession. King , p. 237. He wanted to confirm his eldest son, ": null
    },
    {
        "Eustace": "Eustace Iv, Count Of Boulogne"
    },
    {
        ", as his successor, although chroniclers recorded that Eustace was infamous for levying heavy taxes and extorting money from those on his lands. King , pp. 237–238. Stephens second son, ": null
    },
    {
        "William": "William I, Count Of Boulogne"
    },
    {
        ", was married to the extremely wealthy heiress ": null
    },
    {
        "Isabel de Warenne": "Isabel De Warenne, 4Th Countess Of Surrey"
    },
    {
        ". King , pp. 238–239. In 1148, Stephen built the ": null
    },
    {
        "Cluniac": "Cluniac"
    },
    {
        " Faversham Abbey": "Faversham Abbey"
    },
    {
        " as a resting place for his family. Both Stephens wife, Queen Matilda, and his older brother Theobald died in 1152. Bradbury, p. 206; Crouch , p. 275.          Stephens relationship with the church deteriorated badly towards the end of his reign. Davis, p. 98. The reforming movement within the church, which advocated greater autonomy from royal authority for the clergy, had continued to grow, while new voices such as the Cistercians had gained additional prestige within the monastic orders, eclipsing older orders such as the Cluniacs. Stephens dispute with the church had its origins in 1140, when Archbishop Thurstan of York died. An argument then broke out between a group of reformers based in York and backed by ": null
    },
    {
        "Bernard of Clairvaux": "Bernard Of Clairvaux"
    },
    {
        ", the head of the Cistercian order, who preferred William of Rievaulx as the new archbishop, and Stephen and his brother Henry, who preferred various Blois family relatives. Davis, pp. 99–100. The row between Henry and Bernard grew increasingly personal, and Henry used his authority as legate to appoint his nephew ": null
    },
    {
        "William of York": "William Of York"
    },
    {
        " to the post in 1144 only to find that, when ": null
    },
    {
        "Pope Innocent II": "Pope Innocent Ii"
    },
    {
        " died in 1145, Bernard was able to get the appointment rejected by Rome. Davis, p. 100. Bernard then convinced ": null
    },
    {
        "Pope Eugene III": "Pope Eugene Iii"
    },
    {
        " to overturn Henrys decision altogether in 1147, deposing William, and appointing ": null
    },
    {
        "Henry Murdac": "Henry Murdac"
    },
    {
        " as archbishop instead. Davis, p. 101.     Stephen was furious over what he saw as potentially precedent-setting papal interference in his royal authority, and initially refused to allow Murdac into England. Davis, pp. 101, 104. When Theobald, the Archbishop of Canterbury, went to consult with the Pope on the matter against Stephens wishes, the King refused to allow him back into England either, and seized his estates. Stephen also cut his links to the Cistercian order, and turned instead to the Cluniacs, of which Henry was a member. Davis, p. 103.     Nonetheless, the pressure on Stephen to get Eustace confirmed as his legitimate heir continued to grow. The King gave Eustace the County of Boulogne in 1147, but it remained unclear whether Eustace would inherit England. Davis, p. 105. Stephens preferred option was to have Eustace crowned while he himself was still alive, as was the custom in France, but this was not the normal practice in England, and ": null
    },
    {
        "Celestine II": "Celestine Ii"
    },
    {
        ", during his brief tenure as pope between 1143 and 1144, had banned any change to this practice. Since the only person who could crown Eustace was Archbishop Theobald, who refused to do so without agreement from the current pope, Eugene III, the matter reached an impasse.  At the end of 1148, Stephen and Theobald came to a temporary compromise that allowed Theobald to return to England. Theobald was appointed a papal legate in 1151, adding to his authority. King , pp. 263–264. Stephen then made a fresh attempt to have Eustace crowned at Easter 1152, gathering his nobles to swear fealty to Eustace, and then insisting that Theobald and his bishops anoint him king. King , p. 264. When Theobald refused yet again, Stephen and Eustace imprisoned both him and the bishops and refused to release them unless they agreed to crown Eustace. Theobald escaped again into temporary exile in ": null
    },
    {
        "Flanders": "Flanders"
    },
    {
        ", pursued to the coast by Stephens knights, marking a low point in Stephens relationship with the church.          Henry FitzEmpress returned to England again at the start of 1153 with a small army, supported in the north and east of England by Ranulf of Chester and Hugh Bigod. Bradbury, pp. 178–179. Stephens castle at ": null
    },
    {
        "Malmesbury": "Malmesbury Castle"
    },
    {
        " was besieged by Henrys forces, and the King responded by marching west with an army to relieve it. Bradbury, p. 180. He unsuccessfully attempted to force Henrys smaller army to fight a decisive battle along the ": null
    },
    {
        "river Avon": "River Avon, Bristol"
    },
    {
        ". In the face of the increasingly wintry weather, Stephen agreed to a temporary truce and returned to London, leaving Henry to travel north through the ": null
    },
    {
        "Midlands": "Midlands"
    },
    {
        " where the powerful Robert de Beaumont, Earl of Leicester, announced his support for the Angevin cause. Despite only modest military successes, Henry and his allies now controlled the south-west, the Midlands and much of the north of England. Bradbury, p. 181.     Over the summer, Stephen intensified the long-running siege of ": null
    },
    {
        "Wallingford Castle": "Wallingford Castle"
    },
    {
        " in a final attempt to take this major Angevin stronghold. Bradbury, p. 182. The fall of Wallingford appeared imminent and Henry marched south in an attempt to relieve the siege, arriving with a small army and placing Stephens besieging forces under siege themselves. Bradbury, p. 183. Upon news of this, Stephen gathered up a large force and marched from Oxford, and the two sides confronted each other across the ": null
    },
    {
        "River Thames": "River Thames"
    },
    {
        " at Wallingford in July. By this point in the war, the barons on both sides seem to have been eager to avoid an open battle. Bradbury, p. 183; King , p. 277; Crouch , p. 276. As a result, instead of a battle ensuing, members of the church ": null
    },
    {
        "brokered a truce": "Treaty Of Wallingford"
    },
    {
        ", to the annoyance of both Stephen and Henry.     In the aftermath of Wallingford, Stephen and Henry spoke together privately about a potential end to the war; Stephens son Eustace, however, was furious about the peaceful outcome at Wallingford. He left his father and returned home to Cambridge to gather more funds for a fresh campaign, where he fell ill and died the next month. King , pp. 278–279; Crouch , p. 276. Eustaces death removed an obvious claimant to the throne and was politically convenient for those seeking a permanent peace in England. It is possible, however, that Stephen had already begun to consider passing over Eustaces claim; historian Edmund King observes that Eustaces claim to the throne was not mentioned in the discussions at Wallingford, for example, and this may have added to his anger. King , p. 278.     Fighting continued after Wallingford, but in a rather half-hearted fashion. Stephen lost the towns of ": null
    },
    {
        "Oxford": "Oxford"
    },
    {
        " and ": null
    },
    {
        "Stamford": "Stamford, Lincolnshire"
    },
    {
        " to Henry while the King was diverted fighting Hugh Bigod in the east of England, but ": null
    },
    {
        "Nottingham Castle": "Nottingham Castle"
    },
    {
        " survived an Angevin attempt to capture it. Bradbury, p. 184. Meanwhile, Stephens brother Henry of Blois and Archbishop Theobald of Canterbury were for once unified in an effort to broker a permanent peace between the two sides, putting pressure on Stephen to accept a deal. King , pp. 279–280; Bradbury, p. 187. The armies of Stephen and Henry FitzEmpress met again at Winchester, where the two leaders would ratify the terms of a permanent peace in November. King , p. 280. Stephen announced the ": null
    },
    {
        "Treaty of Winchester": "Treaty Of Winchester"
    },
    {
        " in Winchester Cathedral: he recognised Henry FitzEmpress as his adopted son and successor, in return for Henry doing ": null
    },
    {
        "homage": "Homage"
    },
    {
        " to him; Stephen promised to listen to Henrys advice, but retained all his royal powers; Stephens remaining son, ": null
    },
    {
        "William": "William I, Count Of Boulogne"
    },
    {
        ", would do homage to Henry and renounce his claim to the throne, in exchange for promises of the security of his lands; key royal castles would be held on Henrys behalf by guarantors, whilst Stephen would have access to Henrys castles; and the numerous foreign mercenaries would be demobilised and sent home. King , pp. 280–283; Bradbury pp. 189–190; Barlow, pp. 187–188. Stephen and Henry sealed the treaty with a ": null
    },
    {
        "kiss of peace": "Kiss Of Peace"
    },
    {
        " in the cathedral. King , p. 281.         Stephens decision to recognise Henry as his heir was, at the time, not necessarily a final solution to the civil war. Bradbury, p. 211; Holt, p. 306. Despite the issuing of new currency and administrative reforms, Stephen might potentially have lived for many more years, whilst Henrys position on the continent was far from secure. Although Stephens son William was young and unprepared to challenge Henry for the throne in 1153, the situation could well have shifted in subsequent years—there were widespread rumours during 1154 that William planned to assassinate Henry, for example. Crouch , p. 277. Historian Graham White describes the treaty of Winchester as a precarious peace , in line with the judgement of most modern historians that the situation in late 1153 was still uncertain and unpredictable. White , p. 12, cited Bradbury, p. 211.     Certainly many problems remained to be resolved, including re-establishing royal authority over the provinces and resolving the complex issue of which barons should control the contested lands and estates after the long civil war. Davis, pp. 122–123. Stephen burst into activity in early 1154, travelling around the kingdom extensively. Amt, p. 19. He began issuing royal ": null
    },
    {
        "writs": "Writ"
    },
    {
        " for the south-west of England once again and travelled to ": null
    },
    {
        "York": "York"
    },
    {
        " where he held a major court in an attempt to impress upon the northern barons that royal authority was being reasserted. After a busy summer in 1154, however, Stephen travelled to ": null
    },
    {
        "Dover": "Dover"
    },
    {
        " to meet ": null
    },
    {
        "Thierry, Count of Flanders": "Thierry, Count Of Flanders"
    },
    {
        "; some historians believe that the King was already ill and preparing to settle his family affairs. King , p. 300. Stephen fell ill with a ": null
    },
    {
        "stomach disorder": "Stomach Disorder"
    },
    {
        " and died on 25 October at the ": null
    },
    {
        "local priory": "Dover Priory"
    },
    {
        ", being buried at ": null
    },
    {
        "Faversham Abbey": "Faversham Abbey"
    },
    {
        " with his wife Matilda and son Eustace.           After Stephens death, Henry II succeeded to the throne of England. Henry vigorously re-established royal authority in the aftermath of the civil war, dismantling castles and increasing revenues, although several of these trends had begun under Stephen. White , p. 137; Amt, p. 44. The destruction of castles under Henry was not as dramatic as once thought, and although he restored royal revenues, the economy of England remained broadly unchanged under both rulers. Stephens son William was confirmed as the ": null
    },
    {
        "Earl of Surrey": "Earl Of Surrey"
    },
    {
        " by Henry, and prospered under the new regime, with the occasional point of tension with Henry. Crouch , p. 281. Stephens daughter ": null
    },
    {
        "Marie I, Countess of Boulogne": "Marie I, Countess Of Boulogne"
    },
    {
        ", also survived her father; she had been placed in a convent by Stephen, but after his death she left and married. Stephens middle son, Baldwin, and second daughter, Matilda, had died before 1147 and were buried at ": null
    },
    {
        "Holy Trinity Priory, Aldgate": "Holy Trinity Priory, Aldgate"
    },
    {
        ". King , pp.xvi, 313. Stephen probably had three illegitimate sons, ": null
    },
    {
        "Gervase, Abbot of Westminster": "Gervase, Abbot Of Westminster"
    },
    {
        ", Ralph and Americ, by his mistress Damette; Gervase became abbot in 1138, but after his fathers death he was removed by Henry in 1157 and died shortly afterwards. Mason, pp. 37, 58; King , p. 98.          Much of the modern history of Stephens reign is based on accounts of ": null
    },
    {
        "chroniclers": "Chronicler"
    },
    {
        " who lived in, or close to, the middle of the 12th century, forming a relatively rich account of the period. King , p. 195. All of the main chronicler accounts carry significant regional biases in how they portray the disparate events. Several of the key chronicles were written in the south-west of England, including the  Gesta Stephani , or Acts of Stephen , and ": null
    },
    {
        "William of Malmesburys": "William Of Malmesbury"
    },
    {
        " Historia Novella, or New History . Davis, p. 146. In Normandy, ": null
    },
    {
        "Orderic Vitalis": "Orderic Vitalis"
    },
    {
        " wrote his Ecclesiastical History, covering Stephens reign until 1141, and ": null
    },
    {
        "Robert of Torigni": "Robert Of Torigni"
    },
    {
        " wrote a later history of the rest of the period. ": null
    },
    {
        "Henry of Huntingdon": "Henry Of Huntingdon"
    },
    {
        ", who lived in the east of England, produced the Historia Anglorum that provides a regional account of the reign. Davis, pp. 147, 150. The  Anglo-Saxon Chronicle  was past its prime by the time of Stephen, but is remembered for its striking account of conditions during the Anarchy . Davis, p. 151. Most of the chronicles carry some bias for or against Stephen, Robert of Gloucester or other key figures in the conflict. Davis, pp. 146–152. Those writing for the church after the events of Stephens later reign, such as ": null
    },
    {
        "John of Salisbury": "John Of Salisbury"
    },
    {
        " for example, paint the King as a tyrant due to his argument with the Archbishop of Canterbury; by contrast, clerics in Durham regarded Stephen as a saviour, due to his contribution to the defeat of the Scots at the ": null
    },
    {
        "battle of the Standard": "Battle Of The Standard"
    },
    {
        ". Barlow, p. 188. Later chronicles written during the reign of Henry II were generally more negative: ": null
    },
    {
        "Walter Map": "Walter Map"
    },
    {
        ", for example, described Stephen as a fine knight, but in other respects almost a fool. Stringer, p. 3. A number of ": null
    },
    {
        "charters": "Charter"
    },
    {
        " were issued during Stephens reign, often giving details of current events or daily routine, and these have become widely used as sources by modern historians. Chibnall , p. 1.     Historians in the ": null
    },
    {
        "Whiggish": "Whig History"
    },
    {
        " tradition that emerged during the ": null
    },
    {
        "Victorian era": "Victorian Era"
    },
    {
        " traced a progressive and ": null
    },
    {
        "universalist": "Universalist"
    },
    {
        " course of political and economic development in England over the medieval period. Dyer, p. 4; Coss, p. 81. ": null
    },
    {
        "William Stubbs": "William Stubbs"
    },
    {
        " focused on these constitutional aspects of Stephens reign in his 1874 volume the Constitutional History of England, beginning an enduring interest in Stephen and his reign. http://www.history.ac.uk/reviews/review/1038 Review of King Stephen, , David Crouch, Reviews in History. Retrieved 12 May 2011; Stubbs , cited http://www.history.ac.uk/reviews/review/1038 Review of King Stephen, , David Crouch, Reviews in History. Retrieved 12 May 2011. Stubbs analysis, focusing on the disorder of the period, influenced his student ": null
    },
    {
        "John Round": "John Horace Round"
    },
    {
        " to coin the term the Anarchy to describe the period, a label that, whilst sometimes critiqued, continues to be used today. http://www.history.ac.uk/reviews/review/1038 Review of King Stephen, , David Crouch, Reviews in History. Retrieved 12 May 2011; Kadish, p. 40; Round , cited http://www.history.ac.uk/reviews/review/1038 Review of King Stephen, , David Crouch, Reviews in History. Retrieved 12 May 2011.  The late-Victorian scholar ": null
    },
    {
        "Frederic William Maitland": "Frederic William Maitland"
    },
    {
        " also introduced the possibility that Stephens reign marked a turning point in English legal history—the so-called tenurial crisis .     Stephen remains a popular subject for historical study: David Crouch suggests that after ": null
    },
    {
        "King John": "John Of England"
    },
    {
        " he is arguably the most written-about medieval king of England . http://www.history.ac.uk/reviews/review/1038 Review of King Stephen, , David Crouch, Reviews in History. Retrieved 12 May 2011. Modern historians vary in their assessments of Stephen as a king. Historian ": null
    },
    {
        "R. H. C. Daviss": "R. H. C. Davis"
    },
    {
        " influential biography paints a picture of a weak king: a capable military leader in the field, full of activity and pleasant, but beneath the surface  ... mistrustful and sly , with poor strategic judgement that ultimately undermined his reign. Davis, p. 127. Stephens lack of sound policy judgement and his mishandling of international affairs, leading to the loss of Normandy and his consequent inability to win the civil war in England, is also highlighted by another of his biographers, David Crouch. Crouch , p. 58. Historian and biographer Edmund King, whilst painting a slightly more positive picture than Davis, also concludes that Stephen, while a stoic, pious and genial leader, was also rarely, if ever, his own man, usually relying upon stronger characters such as his brother or wife. King , pp. 338–339. Historian Keith Stringer provides a more positive portrayal of Stephen, arguing that his ultimate failure as king was the result of external pressures on the Norman state, rather than the result of personal failings. Stringer, pp. 86, 90.             Stephen and his reign have been occasionally used in historical fiction. Stephen and his supporters appear in ": null
    },
    {
        "Ellis Peters": "Ellis Peters"
    },
    {
        " historical detective series  Brother Cadfael , set between 1137 and 1145. Rielly, p. 62. Peters depiction of Stephens reign is an essentially local narrative, focused on the town of ": null
    },
    {
        "Shrewsbury": "Shrewsbury"
    },
    {
        " and its environs. Peters paints Stephen as a tolerant man and a reasonable ruler, despite his execution of the Shrewsbury defenders after the taking of the city in 1138. Rielly, p. 68. In contrast, he is depicted unsympathetically in both ": null
    },
    {
        "Ken Folletts": "Ken Follett"
    },
    {
        " historical novel  The Pillars of the Earth  and the ": null
    },
    {
        "TV mini-series": "The Pillars Of The Earth"
    },
    {
        " adapted from it. Turner, p. 122; Ramet, p. 108; http://tv.nytimes.com/2010/07/23/arts/television/23pillars.html?r2 Blood on Their Hands, and Sex on Their Minds, Mike Hale, The New York Times, published 22 July 2010. Retrieved 15 May 2011.         Stephen of Blois married ": null
    },
    {
        "Matilda of Boulogne": "Matilda Of Boulogne"
    },
    {
        " in 1125. They had five children: Weir, pp. 50–54.     Baldwin   Matilda , married in infancy to ": null
    },
    {
        "Waleran de Beaumont, Count of Meulan": "Waleran De Beaumont, Count Of Meulan"
    },
    {
        " Eustace IV, Count of Boulogne": "Eustace Iv, Count Of Boulogne"
    },
    {
        " , ruled Boulogne 1146–1153   ": null
    },
    {
        "William I, Count of Boulogne": "William I, Count Of Boulogne"
    },
    {
        " , ruled Boulogne 1153–1159   ": null
    },
    {
        "Marie I, Countess of Boulogne": "Marie I, Countess Of Boulogne"
    },
    {
        " , ruled Boulogne 1159–1182     King Stephens illegitimate children by his mistress Damette included:   ": null
    },
    {
        "Gervase, Abbot of Westminster": "Gervase, Abbot Of Westminster"
    },
    {
        "                                ": null
    }
]