[
    {
        "                  Stonehenge is a ": null
    },
    {
        "prehistoric": "Prehistoric"
    },
    {
        " monument": "Monument"
    },
    {
        " in ": null
    },
    {
        "Wiltshire": "Wiltshire"
    },
    {
        ", England,  west of ": null
    },
    {
        "Amesbury": "Amesbury"
    },
    {
        ". It consists of a ring of ": null
    },
    {
        "standing stones": "Standing Stones"
    },
    {
        ", each around  high,  wide, and weighing around 25 tons. The stones are set within ": null
    },
    {
        "earthworks": "Earthwork"
    },
    {
        " in the middle of the most dense complex of ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " and ": null
    },
    {
        "Bronze Age": "Bronze Age"
    },
    {
        " monuments in England, including several hundred  tumuli  .      ": null
    },
    {
        "Archaeologists": "Archaeology"
    },
    {
        " believe it was constructed from 3000 BC to 2000 BC. The surrounding circular earth bank and ditch, which constitute the earliest phase of the monument, have been dated to about 3100 BC. ": null
    },
    {
        "Radiocarbon dating": "Radiocarbon Dating"
    },
    {
        " suggests that the first ": null
    },
    {
        "bluestones": "Bluestone"
    },
    {
        " were raised between 2400 and 2200 BC,  although they may have been at the site as early as 3000 BC.     One of the most famous landmarks in the United Kingdom, Stonehenge is regarded as a ": null
    },
    {
        "British cultural icon": "List Of Cultural Icons Of England"
    },
    {
        ".  It has been a legally protected ": null
    },
    {
        "Scheduled Ancient Monument": "Scheduled Monument"
    },
    {
        " since 1882, when legislation to protect historic monuments was first successfully introduced in Britain. The ": null
    },
    {
        "site and its surroundings": "Stonehenge, Avebury And Associated Sites"
    },
    {
        " were added to ": null
    },
    {
        "UNESCOs": "Unesco"
    },
    {
        " list of ": null
    },
    {
        "World Heritage Sites": "World Heritage Site"
    },
    {
        " in 1986. Stonehenge is owned by ": null
    },
    {
        "the Crown": "The Crown"
    },
    {
        " and managed by ": null
    },
    {
        "English Heritage": "English Heritage"
    },
    {
        "; the ": null
    },
    {
        "surrounding land": "Stonehenge Landscape"
    },
    {
        " is owned by the ": null
    },
    {
        "National Trust": "National Trust For Places Of Historic Interest Or Natural Beauty"
    },
    {
        ".       Stonehenge could have been a ": null
    },
    {
        "burial ground": "Cemetery"
    },
    {
        " from its earliest beginnings.  Deposits containing human bone date from as early as 3000 BC, when the ditch and bank were first dug, and continued for at least another 500 years.        The  Oxford English Dictionary  cites ": null
    },
    {
        "Ælfrics": "Ælfric Of Eynsham"
    },
    {
        " tenth-century glossary, in which henge-cliff is given the meaning precipice , or stone, thus the stanenges or Stanheng not far from Salisbury recorded by eleventh-century writers are supported stones . ": null
    },
    {
        "William Stukeley": "William Stukeley"
    },
    {
        " in 1740 notes, Pendulous rocks are now called henges in Yorkshire...I doubt not, Stonehenge in Saxon signifies the hanging stones.  ": null
    },
    {
        "Christopher Chippindales": "Christopher Chippindale"
    },
    {
        " Stonehenge Complete gives the derivation of the name Stonehenge as coming from the ": null
    },
    {
        "Old English": "Old English Language"
    },
    {
        " words stān meaning stone , and either hencg meaning ": null
    },
    {
        "hinge": "Hinge"
    },
    {
        "  or henen meaning ": null
    },
    {
        "hang": "Hanging"
    },
    {
        " or ": null
    },
    {
        "gallows": "Gallows"
    },
    {
        " or instrument of torture . Like Stonehenges ": null
    },
    {
        "trilithons": "Trilithon"
    },
    {
        ", medieval gallows consisted of two uprights with a lintel joining them, rather than the inverted L-shape more familiar today.     The henge portion has given its name to a class of monuments known as ": null
    },
    {
        "henges": "Henge"
    },
    {
        ". Archaeologists define henges as earthworks consisting of a circular banked enclosure with an internal ditch. See the  . As often happens in archaeological terminology, this is a holdover from ": null
    },
    {
        "antiquarian": "Antiquarian"
    },
    {
        " use. Because its bank is inside its ditch, Stonehenge is not truly a henge site.     Despite being contemporary with true ": null
    },
    {
        "Neolithic": "Neolithic"
    },
    {
        " henges and ": null
    },
    {
        "stone circles": "Stone Circle"
    },
    {
        ", Stonehenge is in many ways atypical—for example, at more than  tall, its extant trilithons lintels, held in place with ": null
    },
    {
        "mortise and tenon": "Mortise And Tenon"
    },
    {
        " joints, make it unique.              ": null
    },
    {
        "Mike Parker Pearson": "Mike Parker Pearson"
    },
    {
        ", leader of the Stonehenge Riverside Project based at ": null
    },
    {
        "Durrington Walls": "Durrington Walls"
    },
    {
        ", noted that Stonehenge appears to have been associated with burial from the earliest period of its existence:          Stonehenge evolved in several construction phases spanning at least 1500 years. There is evidence of large-scale construction on and around the monument that perhaps extends the landscapes time frame to 6500 years. Dating and understanding the various phases of activity is complicated by disturbance of the natural ": null
    },
    {
        "chalk": "Chalk"
    },
    {
        " by ": null
    },
    {
        "periglacial": "Periglacial"
    },
    {
        " effects and animal burrowing, poor quality early ": null
    },
    {
        "excavation": "Excavation"
    },
    {
        " records, and a lack of accurate, scientifically verified dates. The modern phasing most generally agreed to by archaeologists is detailed below. Features mentioned in the text are numbered and shown on the plan, right.       Archaeologists have found four, or possibly five, large ": null
    },
    {
        "Mesolithic": "Mesolithic"
    },
    {
        "postholes": "Posthole"
    },
    {
        " , which date to around 8000 BC, beneath the nearby old tourist car-park in use until 2013. These held pine posts around  in diameter, which were erected and eventually rotted in situ. Three of the posts were in an east-west alignment which may have had ": null
    },
    {
        "ritual": "Ritual"
    },
    {
        " significance. Exon, 30-31; Southern, Patricia, The Story of Stonehenge,  , 2012, Amberley Publishing Limited,  Another Mesolithic astronomical site in Britain is the ": null
    },
    {
        "Warren Field": "Warren Field"
    },
    {
        " site in ": null
    },
    {
        "Aberdeenshire": "Aberdeenshire"
    },
    {
        ", which is considered the worlds oldest Lunar calendar, corrected yearly by observing the ": null
    },
    {
        "midwinter solstice": "Winter Solstice"
    },
    {
        ".  Similar but later sites have been found in ": null
    },
    {
        "Scandinavia": "Scandinavia"
    },
    {
        ". Exon, 30 A settlement that may have been contemporaneous with the posts has been found at ": null
    },
    {
        "Blick Mead": "Blick Mead"
    },
    {
        ", a reliable year-round spring  from Stonehenge.       ": null
    },
    {
        "Salisbury Plain": "Salisbury Plain"
    },
    {
        " was then still wooded, but 4,000 years later, during the earlier Neolithic, people built a ": null
    },
    {
        "causewayed enclosure": "Causewayed Enclosure"
    },
    {
        " at ": null
    },
    {
        "Robin Hoods Ball": "Robin Hoods Ball"
    },
    {
        " and ": null
    },
    {
        "long barrow": "Long Barrow"
    },
    {
        " tombs in the surrounding landscape. In approximately 3500 BC, a ": null
    },
    {
        "Stonehenge Cursus": "Stonehenge Cursus"
    },
    {
        " was built  north of the site as the first farmers began to clear the trees and develop the area. A number of other previously overlooked stone or wooden structures and burial mounds may date as far back as 4000 BC.   Charcoal from the ‘Blick Mead’ camp  from Stonehenge  has been dated to 4000 BC.  The ": null
    },
    {
        "University of Buckinghams": "University Of Buckingham"
    },
    {
        " Humanities Research Institute believes that the community who built Stonehenge lived here over a period of several millennia, making it potentially one of the pivotal places in the history of the Stonehenge landscape.           The first monument consisted of a circular bank and ditch ": null
    },
    {
        "enclosure": "Enclosure"
    },
    {
        " made of ": null
    },
    {
        "Late Cretaceous": "Late Cretaceous"
    },
    {
        "  Seaford ": null
    },
    {
        "Chalk": "Chalk"
    },
    {
        ", measuring about  in diameter, with a large entrance to the north east and a smaller one to the south. It stood in open ": null
    },
    {
        "grassland": "Grassland"
    },
    {
        " on a slightly sloping spot. The builders placed the bones of ": null
    },
    {
        "deer": "Deer"
    },
    {
        " and ": null
    },
    {
        "ox": "Ox"
    },
    {
        "en in the bottom of the ditch, as well as some worked ": null
    },
    {
        "flint": "Flint"
    },
    {
        " tools. The bones were considerably older than the antler picks used to dig the ditch, and the people who buried them had looked after them for some time prior to burial. The ditch was continuous but had been dug in sections, like the ditches of the earlier causewayed enclosures in the area. The chalk dug from the ditch was piled up to form the bank. This first stage is dated to around 3100 BC, after which the ditch began to silt up naturally. Within the outer edge of the enclosed area is a circle of 56 pits, each about  in diameter, known as the ": null
    },
    {
        "Aubrey holes": "Aubrey Holes"
    },
    {
        " after ": null
    },
    {
        "John Aubrey": "John Aubrey"
    },
    {
        ", the seventeenth-century ": null
    },
    {
        "antiquarian": "Antiquarian"
    },
    {
        " who was thought to have first identified them. The pits may have contained standing timbers creating a ": null
    },
    {
        "timber circle": "Timber Circle"
    },
    {
        ", although there is no excavated evidence of them. A recent excavation has suggested that the Aubrey Holes may have originally been used to erect a ": null
    },
    {
        "bluestone": "Bluestone"
    },
    {
        " circle.  If this were the case, it would advance the earliest known stone structure at the monument by some 500 years. A small outer bank beyond the ditch could also date to this period.     In 2013 a team of archaeologists, led by ": null
    },
    {
        "Mike Parker Pearson": "Mike Parker Pearson"
    },
    {
        ", excavated more than 50,000 cremated bone fragments, from 63 individuals, buried at Stonehenge.   These remains had originally been buried individually in the Aubrey holes, exhumed during a previous excavation conducted by ": null
    },
    {
        "William Hawley": "William Hawley"
    },
    {
        " in 1920, been considered unimportant by him, and subsequently re-interred together in one hole, Aubrey Hole 7, in 1935.  Physical and chemical analysis of the remains has shown that the cremated were almost equally men and women, and included some children. As there was evidence of the underlying chalk beneath the graves being crushed by substantial weight, the team concluded that the first bluestones brought from Wales were probably used as grave markers. ": null
    },
    {
        "Radiocarbon dating": "Radiocarbon Dating"
    },
    {
        " of the remains has put the date of the site 500 years earlier than previously estimated, to around 3000 BC. A 2018 study of the ": null
    },
    {
        "strontium": "Strontium"
    },
    {
        " content of the bones found that many of the individuals buried there around the time of construction had probably come from near the source of the bluestone in Wales and had not extensively lived in the area of Stonehenge before death.        Evidence of the second phase is no longer visible. The number of postholes dating to the early third millennium BC suggests that some form of timber structure was built within the enclosure during this period. Further standing timbers were placed at the northeast entrance, and a parallel alignment of posts ran inwards from the southern entrance. The postholes are smaller than the Aubrey Holes, being only around  in diameter, and are much less regularly spaced. The bank was purposely reduced in height and the ditch continued to silt up. At least twenty-five of the Aubrey Holes is known to have contained later, intrusive, ": null
    },
    {
        "cremation": "Cremation"
    },
    {
        " burials dating to the two centuries after the monuments inception. It seems that whatever the holes initial function, it changed to become a funerary one during Phase two. Thirty further cremations were placed in the enclosures ditch and at other points within the monument, mostly in the eastern half. Stonehenge is therefore interpreted as functioning as an ": null
    },
    {
        "enclosed cremation cemetery": "Enclosed Cremation Cemetery"
    },
    {
        " at this time, the earliest known cremation cemetery in the British Isles. Fragments of unburnt human bone have also been found in the ditch-fill. Dating evidence is provided by the late Neolithic ": null
    },
    {
        "grooved ware": "Grooved Ware"
    },
    {
        " pottery that has been found in connection with the features from this phase.            Archaeological excavation has indicated that around 2600 BC, the builders abandoned timber in favour of stone and dug two concentric arrays of holes  in the centre of the site. These stone sockets are only partly known ; however, they could be the remains of a double ring. Again, there is little firm dating evidence for this phase. The holes held up to 80 standing stones , only 43 of which can be traced today. It is generally accepted that the ": null
    },
    {
        "bluestones": "Bluestone"
    },
    {
        " , were transported by the builders from the ": null
    },
    {
        "Preseli Hills": "Preseli Hills"
    },
    {
        ",  away in modern-day ": null
    },
    {
        "Pembrokeshire": "Pembrokeshire"
    },
    {
        " in Wales. Another theory is that they were brought much nearer to the site as ": null
    },
    {
        "glacial erratics": "Glacial Erratics"
    },
    {
        " by the ": null
    },
    {
        "Irish Sea Glacier": "Irish Sea Glacier"
    },
    {
        "  although there is no evidence of glacial deposition within southern central England.  A 2019 publication announced that evidence of Megalithic quarrying had been found at quarries in Wales identified as a source of Stonehenges bluestone, indicating that the bluestone was quarried by human agency and not transported by glacial action.      The long-distance human transport theory was bolstered in 2011 by the discovery of a megalithic bluestone quarry at ": null
    },
    {
        "Craig Rhos-y-felin": "Craig Rhos-Y-Felin"
    },
    {
        ", near ": null
    },
    {
        "Crymych": "Crymych"
    },
    {
        " in Pembrokeshire, which is the most likely place for some of the stones to have been obtained. Other standing stones may well have been small ": null
    },
    {
        "sarsens": "Sarsen"
    },
    {
        " , used later as lintels. The stones, which weighed about two tons, could have been moved by lifting and carrying them on rows of poles and rectangular frameworks of poles, as recorded in China, Japan and India. It is not known whether the stones were taken directly from their quarries to Salisbury Plain or were the result of the removal of a venerated stone circle from Preseli to Salisbury Plain to merge two sacred centres into one, to unify two politically separate regions, or to legitimise the ancestral identity of migrants moving from one region to another . Each monolith measures around  in height, between  wide and around  thick. What was to become known as the ": null
    },
    {
        "Altar Stone": "Altar Stone"
    },
    {
        " is almost certainly derived from the ": null
    },
    {
        "Senni Beds": "Senni Beds"
    },
    {
        ", perhaps from  east of Mynydd Preseli in the Brecon Beacons.     The north-eastern entrance was widened at this time, with the result that it precisely matched the direction of the ": null
    },
    {
        "midsummer": "Midsummer"
    },
    {
        " sunrise and ": null
    },
    {
        "midwinter": "Winter Solstice"
    },
    {
        " sunset of the period. This phase of the monument was abandoned unfinished, however; the small standing stones were apparently removed and the Q and R holes purposefully backfilled. Even so, the monument appears to have eclipsed the site at ": null
    },
    {
        "Avebury": "Avebury"
    },
    {
        " in importance towards the end of this phase.     The ": null
    },
    {
        "Heelstone": "Heelstone"
    },
    {
        ", a ": null
    },
    {
        "Tertiary": "Tertiary"
    },
    {
        " sandstone, may also have been erected outside the north-eastern entrance during this period. It cannot be accurately dated and may have been installed at any time during phase 3. At first, it was accompanied by a second stone, which is no longer visible. Two, or possibly three, large ": null
    },
    {
        "portal stones": "Portal Stones"
    },
    {
        " were set up just inside the north-eastern entrance, of which only one, the fallen Slaughter Stone,  long, now remains. Other features, loosely dated to phase 3, include the four ": null
    },
    {
        "Station Stones": "Station Stones"
    },
    {
        ", two of which stood atop mounds. The mounds are known as ": null
    },
    {
        "barrows": "Tumulus"
    },
    {
        " although they do not contain burials. ": null
    },
    {
        "Stonehenge Avenue": "Stonehenge Avenue"
    },
    {
        ", a parallel pair of ditches and banks leading  to the ": null
    },
    {
        "River Avon": "River Avon"
    },
    {
        ", was also added. Two ditches similar to ": null
    },
    {
        "Heelstone Ditch": "Heelstone Ditch"
    },
    {
        " circling the Heelstone were later dug around the Station Stones.          During the next major phase of activity, 30 enormous ": null
    },
    {
        "Oligocene": "Oligocene"
    },
    {
        "-": null
    },
    {
        "Miocene": "Miocene"
    },
    {
        " sarsen stones  were brought to the site. They may have come from a quarry around  north of Stonehenge on the ": null
    },
    {
        "Marlborough Downs": "Marlborough Downs"
    },
    {
        ", or they may have been collected from a litter of sarsens on the ": null
    },
    {
        "chalk": "Chalk"
    },
    {
        " downs, closer to hand. The stones were ": null
    },
    {
        "dressed": "Ashlar"
    },
    {
        " and fashioned with ": null
    },
    {
        "mortise and tenon": "Mortise And Tenon"
    },
    {
        " joints before 30 were erected as a  diameter circle of standing stones, with a ring of 30 lintel stones resting on top. The lintels were fitted to one another using another woodworking method, the ": null
    },
    {
        "tongue and groove": "Tongue And Groove"
    },
    {
        " joint. Each standing stone was around  high,  wide and weighed around 25 tons. Each had clearly been worked with the final visual effect in mind; the ": null
    },
    {
        "orthostats": "Orthostat"
    },
    {
        " widen slightly towards the top in order that their perspective remains constant when viewed from the ground, while the lintel stones curve slightly to continue the circular appearance of the earlier monument.     The inward-facing surfaces of the stones are smoother and more finely worked than the outer surfaces. The average thickness of the stones is  and the average distance between them is . A total of 75 stones would have been needed to complete the circle and the trilithon horseshoe . It was thought the ring might have been left incomplete, but an exceptionally dry summer in 2013 revealed patches of parched grass which may correspond to the location of removed sarsens.  The lintel stones are each around  long,  wide and  thick. The tops of the lintels are  above the ground.     Within this circle stood five ": null
    },
    {
        "trilithons": "Trilithon"
    },
    {
        " of dressed ": null
    },
    {
        "sarsen": "Sarsen"
    },
    {
        " stone arranged in a horseshoe shape  across, with its open end facing northeast. These huge stones, ten uprights and five lintels, weigh up to 50 tons each. They were linked using complex jointing. They are arranged symmetrically. The smallest pair of trilithons were around  tall, the next pair a little higher, and the largest, single trilithon in the south-west corner would have been  tall. Only one upright from the Great Trilithon still stands, of which  is visible and a further  is below ground. The images of a dagger and 14 axeheads have been carved on one of the sarsens, known as stone 53; further carvings of axeheads have been seen on the outer faces of stones 3, 4, and 5. The carvings are difficult to date but are morphologically similar to late Bronze Age weapons. ": null
    },
    {
        "Early 21st-century laser scanning of the carvings": "Laser Scanning At Stonehenge"
    },
    {
        " supports this interpretation. The pair of trilithons in the north east are smallest, measuring around  in height; the largest, which is in the south-west of the horseshoe, is almost  tall.     This ambitious phase has been ": null
    },
    {
        "radiocarbon dated": "Carbon Dating"
    },
    {
        " to between 2600 and 2400 BC,  slightly earlier than the ": null
    },
    {
        "Stonehenge Archer": "Stonehenge Archer"
    },
    {
        ", discovered in the outer ditch of the monument in 1978, and the two sets of burials, known as the ": null
    },
    {
        "Amesbury Archer": "Amesbury Archer"
    },
    {
        " and the ": null
    },
    {
        "Boscombe Bowmen": "Boscombe Bowmen"
    },
    {
        ", discovered  to the west. Analysis of animal teeth found  away at ": null
    },
    {
        "Durrington Walls": "Durrington Walls"
    },
    {
        ", thought by Parker Pearson to be the builders camp, suggests that, during some period between 2600 and 2400 BC, as many as 4,000 people gathered at the site for the mid-winter and mid-summer festivals; the evidence showed that the animals had been slaughtered around nine months or 15 months after their spring birth. ": null
    },
    {
        "Strontium": "Strontium"
    },
    {
        " isotope analysis": "Isotope Analysis"
    },
    {
        " of the animal teeth showed that some had been brought from as far afield as the Scottish Highlands for the celebrations.  At about the same time, a large ": null
    },
    {
        "timber circle": "Timber Circle"
    },
    {
        " and a second avenue were constructed at ": null
    },
    {
        "Durrington Walls": "Durrington Walls"
    },
    {
        " overlooking the ": null
    },
    {
        "River Avon": "River Avon, Hampshire"
    },
    {
        ". The timber circle was oriented towards the rising Sun on the ": null
    },
    {
        "midwinter solstice": "Midwinter Solstice"
    },
    {
        ", opposing the solar alignments at Stonehenge. The avenue was aligned with the setting Sun on the ": null
    },
    {
        "summer solstice": "Summer Solstice"
    },
    {
        " and led from the river to the timber circle. Evidence of huge fires on the banks of the Avon between the two avenues also suggests that both circles were linked. They were perhaps used as a procession route on the longest and shortest days of the year. Parker Pearson speculates that the wooden circle at Durrington Walls was the centre of a land of the living, whilst the stone circle represented a land of the dead, with the Avon serving as a journey between the two.        Later in the Bronze Age, although the exact details of activities during this period are still unclear, the bluestones appear to have been re-erected. They were placed within the outer sarsen circle and may have been trimmed in some way. Like the sarsens, a few have timber-working style cuts in them suggesting that, during this phase, they may have been linked with lintels and were part of a larger structure.       This phase saw further rearrangement of the bluestones. They were arranged in a circle between the two rings of sarsens and in an oval at the centre of the inner ring. Some archaeologists argue that some of these bluestones were from a second group brought from Wales. All the stones formed well-spaced uprights without any of the linking lintels inferred in Stonehenge 3 III. The Altar Stone may have been moved within the oval at this time and re-erected vertically. Although this would seem the most impressive phase of work, Stonehenge 3 IV was rather shabbily built compared to its immediate predecessors, as the newly re-installed bluestones were not well-founded and began to fall over. However, only minor changes were made after this phase.       Soon afterwards, the northeastern section of the Phase 3 IV bluestone circle was removed, creating a horseshoe-shaped setting which mirrored the shape of the central sarsen Trilithons. This phase is contemporary with the ": null
    },
    {
        "Seahenge": "Seahenge"
    },
    {
        " site in Norfolk.          The ": null
    },
    {
        "Y and Z Holes": "Y And Z Holes"
    },
    {
        " are the last known construction at Stonehenge, built about 1600 BC, and the last usage of it was probably during the ": null
    },
    {
        "Iron Age": "Iron Age"
    },
    {
        ". ": null
    },
    {
        "Roman coins": "Roman Currency"
    },
    {
        " and ": null
    },
    {
        "medieval": "Medieval"
    },
    {
        " artefacts have all been found in or around the monument but it is unknown if the monument was in continuous use throughout ": null
    },
    {
        "British prehistory": "British Prehistory"
    },
    {
        " and beyond, or exactly how it would have been used. Notable is the massive Iron Age ": null
    },
    {
        "hillfort": "Hillfort"
    },
    {
        " Vespasians Camp": "Vespasians Camp"
    },
    {
        " built alongside the Avenue near the Avon. A decapitated seventh century ": null
    },
    {
        "Saxon": "Anglo-Saxons"
    },
    {
        " man was excavated from Stonehenge in 1923.  , BBC News , ABCE News , Fox News , New Scientist , Archeo News The site was known to scholars during the ": null
    },
    {
        "Middle Ages": "Middle Ages"
    },
    {
        " and since then it has been studied and adopted by numerous groups.             Stonehenge was produced by a culture that left no written records. Many aspects of Stonehenge, such as how it was built and which purposes it was used for, remain subject to debate. A number of myths surround the stones.  The site, specifically the great trilithon, the encompassing horseshoe arrangement of the five central trilithons, the heel stone, and the embanked avenue, are aligned to the sunset of the winter solstice and the opposing sunrise of the summer solstice.   A natural landform at the monuments location followed this line, and may have inspired its construction.  The excavated remains of culled animal bones suggest that people may have gathered at the site for the winter rather than the summer.  Further astronomical associations, and the precise astronomical significance of the site for its people, are a matter of speculation and debate.     There is little or no direct evidence revealing the construction techniques used by the Stonehenge builders. Over the years, various authors have suggested that supernatural or anachronistic methods were used, usually asserting that the stones were impossible to move otherwise due to their massive size. However, conventional techniques, using Neolithic technology as basic as ": null
    },
    {
        "shear legs": "Shear Legs"
    },
    {
        ", have been demonstrably effective at moving and placing stones of a similar size. How the stones could be transported by a prehistoric people without the aid of the wheel or a pulley system is not known. The most common theory of how prehistoric people moved megaliths has them creating a track of logs which the large stones were rolled along.  Another megalith transport theory involves the use of a type of sleigh running on a track greased with animal fat. Such an experiment with a sleigh carrying a 40-ton slab of stone was successful near Stonehenge in 1995. A team of more than 100 workers managed to push and pull the slab along the  journey from Marlborough Downs. Proposed functions for the site include usage as an astronomical observatory or as a religious site.     More recently two major new theories have been proposed. Professor ": null
    },
    {
        "Geoffrey Wainwright": "Geoffrey Wainwright"
    },
    {
        ", president of the ": null
    },
    {
        "Society of Antiquaries of London": "Society Of Antiquaries Of London"
    },
    {
        ", and ": null
    },
    {
        "Timothy Darvill": "Timothy Darvill"
    },
    {
        ", of ": null
    },
    {
        "Bournemouth University": "Bournemouth University"
    },
    {
        ", have suggested that Stonehenge was a place of healing—the primeval equivalent of ": null
    },
    {
        "Lourdes": "Lourdes"
    },
    {
        ".  They argue that this accounts for the high number of burials in the area and for the evidence of trauma deformity in some of the graves. However, they do concede that the site was probably multifunctional and used for ancestor worship as well.  Isotope analysis indicates that some of the buried individuals were from other regions. A teenage boy buried approximately 1550 BC was raised near the Mediterranean Sea; a metal worker from 2300 BC dubbed the Amesbury Archer grew up near the alpine foothills of Germany; and the Boscombe Bowmen probably arrived from Wales or Brittany, France.      On the other hand, Mike Parker Pearson of ": null
    },
    {
        "Sheffield University": "Sheffield University"
    },
    {
        " has suggested that Stonehenge was part of a ": null
    },
    {
        "ritual landscape": "Ritual Landscape"
    },
    {
        " and was joined to Durrington Walls by their corresponding avenues and the River Avon. He suggests that the area around Durrington Walls Henge was a place of the living, whilst Stonehenge was a domain of the dead. A journey along the Avon to reach Stonehenge was part of a ritual passage from life to death, to celebrate past ancestors and the recently deceased. Both explanations were first mooted in the twelfth century by ": null
    },
    {
        "Geoffrey of Monmouth": "Geoffrey Of Monmouth"
    },
    {
        ", who extolled the curative properties of the stones and was also the first to advance the idea that Stonehenge was constructed as a funerary monument. Whatever religious, mystical or spiritual elements were central to Stonehenge, its design includes a celestial observatory function, which might have allowed prediction of eclipse, solstice, equinox and other celestial events important to a contemporary religion.      There are other hypotheses and theories. According to a team of British researchers led by Mike Parker Pearson of the University of Sheffield, Stonehenge may have been built as a symbol of peace and unity , indicated in part by the fact that at the time of its construction, Britains Neolithic people were experiencing a period of cultural unification.      Researchers from the Royal College of Art in London have discovered that the monuments bluestones possess unusual acoustic properties  — when struck they respond with a loud clanging noise . According to Paul Devereux, editor of the journal Time and Mind: The Journal of Archaeology, Consciousness and Culture, this idea could explain why certain bluestones were hauled nearly —a major technical accomplishment at the time. In certain ancient cultures rocks that ring out, known as ": null
    },
    {
        "lithophones": "Lithophones"
    },
    {
        ", were believed to contain mystic or healing powers, and Stonehenge has a history of association with rituals. The presence of these ringing rocks seems to support the hypothesis that Stonehenge was a place for healing , as has been pointed out by Bournemouth University archaeologist Timothy Darvill, who consulted with the researchers. The bluestones of Stonehenge were quarried near a town in Wales called ": null
    },
    {
        "Maenclochog": "Maenclochog"
    },
    {
        ", which means ringing rock , where the local bluestones were used as church bells until the 18th century.             Researchers studying DNA extracted from Neolithic human remains across Britain determined that the ancestors of the people who built Stonehenge were farmers who came from the Eastern Mediterranean, traveling west from there. DNA studies indicate that they had a predominantly ": null
    },
    {
        "Aegean ancestry": "Aegean Civilization"
    },
    {
        ", although their agricultural techniques seem to have come originally from ": null
    },
    {
        "Anatolia": "Anatolia"
    },
    {
        ". These Aegean farmers then moved to Iberia before heading north, reaching Britain in about 4,000 BC. Paul Rincon,   BBC News website, 16 April 2019      These Neolithic migrants to Britain also may have introduced the tradition of building monuments using large megaliths, and Stonehenge was part of this tradition.     At that time, Britain was inhabited by groups of ": null
    },
    {
        "western hunter-gatherers": "Western Hunter-Gatherers"
    },
    {
        ", similar to the ": null
    },
    {
        "Cheddar Man": "Cheddar Man"
    },
    {
        ". When the farmers arrived, DNA studies show that these two groups did not seem to mix much. Instead, there was a substantial population replacement.     The ": null
    },
    {
        "Bell Beaker people": "Beaker Culture"
    },
    {
        " arrived later, around 2,500 BC, migrating from mainland Europe. The earliest British beakers were similar to those from the Rhine.  There was again a large population replacement in Britain. The Bell Beakers also left their impact on Stonehenge construction. Barry W. Cunliffe,  Oxford University Press, 2001. p.254 They are also associated with the ": null
    },
    {
        "Wessex culture": "Wessex Culture"
    },
    {
        ".     The latter appears to have had wide-ranging trade links with continental Europe, going as far as the ": null
    },
    {
        "Mycenaean Greece": "Mycenaean Greece"
    },
    {
        ". The wealth from such trade probably permitted the Wessex people to construct the second and third  phases of Stonehenge and also indicates a powerful form of social organisation. Dr Andrew Fitzpatrick,     Wessex Archaeology,   December 2012     The Bell Beakers were also associated with the ": null
    },
    {
        "tin": "Tin"
    },
    {
        " trade, which was Britains only unique export at the time. Tin was important because it was used to turn copper into bronze, and the Beakers derived much wealth from this.  p.146                The ": null
    },
    {
        "Heel Stone": "Heel Stone"
    },
    {
        " lies northeast of the sarsen circle, beside the end portion of Stonehenge Avenue.  It is a rough stone,  above ground, leaning inwards towards the stone circle. It has been known by many names in the past, including Friars Heel and Sun-stone .   At ": null
    },
    {
        "summer solstice": "Summer Solstice"
    },
    {
        " an observer standing within the stone circle, looking northeast through the entrance, would see the Sun rise in the approximate direction of the heel stone, and the Sun has often been photographed over it.     A ": null
    },
    {
        "folk tale": "Folklore"
    },
    {
        " relates the origin of the Friars Heel reference.       :The ": null
    },
    {
        "Devil": "Devil"
    },
    {
        " bought the stones from a woman in Ireland, wrapped them up, and brought them to Salisbury plain. One of the stones fell into the ": null
    },
    {
        "Avon": "River Avon, Hampshire"
    },
    {
        ", the rest were carried to the plain. The Devil then cried out, No-one will ever find out how these stones came here! A friar replied, That’s what you think! , whereupon the Devil threw one of the stones at him and struck him on the heel. The stone stuck in the ground and is still there.   Brewers Dictionary of Phrase and Fable  attributes this tale to Geoffrey of Monmouth, but though book eight of Geoffreys  Historia Regum Britanniae  does describe how Stonehenge was built, the two stories are entirely different.     The name is not unique; there was a monolith with the same name recorded in the nineteenth century by antiquarian ": null
    },
    {
        "Charles Warne": "Charles Warne"
    },
    {
        " at ": null
    },
    {
        "Long Bredy": "Long Bredy"
    },
    {
        " in Dorset. ": null
    },
    {
        "Warne, Charles": "Charles Warne"
    },
    {
        ", 1872, Ancient Dorset. Bournemouth.          In the twelfth century, ": null
    },
    {
        "Geoffrey of Monmouth": "Geoffrey Of Monmouth"
    },
    {
        " included a fanciful story in his  Historia Regum Britanniae  that attributed the monuments construction to the wizard ": null
    },
    {
        "Merlin": "Merlin"
    },
    {
        ". ": null
    },
    {
        "Historia Regum Britanniae, Book 8, ch. 10.": "S:History Of The Kings Of Britain/Book 8"
    },
    {
        " Geoffreys story spread widely, appearing in more and less elaborate form in adaptations of his work such as ": null
    },
    {
        "Waces": "Wace"
    },
    {
        " Norman French  Roman de Brut , ": null
    },
    {
        "Layamons": "Layamon"
    },
    {
        " Middle English  Brut , and the Welsh  Brut y Brenhinedd .     According to Geoffrey, the rocks of Stonehenge were healing rocks, called the Giants dance, which ": null
    },
    {
        "Giants": "Giant"
    },
    {
        " had brought from Africa to Ireland for their healing properties. The fifth-century king ": null
    },
    {
        "Aurelius Ambrosius": "Ambrosius Aurelianus"
    },
    {
        " wished to erect a memorial to 3,000 nobles slain in battle against the Saxons and buried at Salisbury, and, at Merlins advice, chose Stonehenge. The king sent Merlin, ": null
    },
    {
        "Uther Pendragon": "Uther Pendragon"
    },
    {
        " , and 15,000 knights, to remove it from Ireland, where it had been constructed on ": null
    },
    {
        "Mount Killaraus": "Mount Killaraus"
    },
    {
        " by the Giants. They slew 7,000 Irish, but as the knights tried to move the rocks with ropes and force, they failed. Then Merlin, using gear and skill, easily dismantled the stones and sent them over to Britain, where Stonehenge was dedicated. After it had been rebuilt near Amesbury, Geoffrey further narrates how first Ambrosius Aurelianus, then Uther Pendragon, and finally ": null
    },
    {
        "Constantine III": "Constantine Iii"
    },
    {
        ", were buried inside the Giants Ring of Stonehenge .     In another legend of Saxons and Britons, in 472, the invading king ": null
    },
    {
        "Hengist": "Hengist"
    },
    {
        " invited Brythonic warriors to a feast but treacherously ordered his men to draw their weapons from concealment and fall upon the guests, killing 420 of them. Hengist erected the stone monument—Stonehenge—on the site to show his remorse for the deed. Drawing on the writings of ": null
    },
    {
        "Nennius": "Nennius"
    },
    {
        ", the tale is noted in ": null
    },
    {
        "Spensers": "Edmund Spenser"
    },
    {
        " Faerie Queene, and given further circulation in ": null
    },
    {
        "William Dugdales": "William Dugdale"
    },
    {
        " Monasticon Anglicanum of 1655. Source:             Stonehenge has changed ownership several times since ": null
    },
    {
        "King Henry VIII": "King Henry Viii"
    },
    {
        " acquired ": null
    },
    {
        "Amesbury Abbey": "Amesbury Abbey"
    },
    {
        " and its surrounding lands. In 1540 Henry gave the estate to the ": null
    },
    {
        "Earl of Hertford": "Earl Of Hertford"
    },
    {
        ". It subsequently passed to ": null
    },
    {
        "Lord Carleton": "Lord Carleton"
    },
    {
        " and then the ": null
    },
    {
        "Marquess of Queensberry": "Marquess Of Queensberry"
    },
    {
        ". The Antrobus family of Cheshire bought the estate in 1824. During the ": null
    },
    {
        "First World War": "First World War"
    },
    {
        " an ": null
    },
    {
        "aerodrome": "Aerodrome"
    },
    {
        "  Francis Stewart Briggs, S. H. Harris,  , Hutchinson & Company Limited, 1938. Retrieved 11 June 2014. was built on the downs just to the west of the circle and, in the dry valley at Stonehenge Bottom, a main road junction was built, along with several cottages and a cafe. The Antrobus family sold the site after their last heir was killed in the fighting in France. The auction by ": null
    },
    {
        "Knight Frank & Rutley": "Knight Frank  &  Rutley"
    },
    {
        " estate agents in Salisbury was held on 21 September 1915 and included Lot 15. Stonehenge with about 30 acres, 2 rods, 37 perches of adjoining downland.           ": null
    },
    {
        "Cecil Chubb": "Cecil Chubb"
    },
    {
        " bought the site for £6,600  and gave it to the nation three years later. Although it has been speculated that he purchased it at the suggestion of—or even as a present for—his wife, in fact he bought it on a whim, as he believed a local man should be the new owner.          In the late 1920s a nationwide appeal was launched to save Stonehenge from the encroachment of the modern buildings that had begun to rise around it. The London Mercury Vol. XVII No. 98 1927 By 1928 the land around the monument had been purchased with the appeal donations and given to the National Trust to preserve. The buildings were removed , and the land returned to agriculture. More recently the land has been part of a grassland reversion scheme, returning the surrounding fields to native ": null
    },
    {
        "chalk grassland": "Chalk Grassland"
    },
    {
        ".             During the twentieth century, Stonehenge began to revive as a place of religious significance, this time by adherents of ": null
    },
    {
        "Neopagan": "Neopagan"
    },
    {
        "ism and ": null
    },
    {
        "New Age": "New Age"
    },
    {
        " beliefs, particularly the ": null
    },
    {
        "Neo-druids": "Neo-Druidism"
    },
    {
        ". The historian ": null
    },
    {
        "Ronald Hutton": "Ronald Hutton"
    },
    {
        " would later remark that it was a great, and potentially uncomfortable, irony that modern Druids had arrived at Stonehenge just as archaeologists were evicting the ancient Druids from it. ": null
    },
    {
        "Hutton 2009": "Hut09"
    },
    {
        ". p. 323. The first such Neo-druidic group to make use of the megalithic monument was the ": null
    },
    {
        "Ancient Order of Druids": "Ancient Order Of Druids"
    },
    {
        ", who performed a mass initiation ceremony there in August 1905, in which they admitted 259 new members into their organisation. This assembly was largely ridiculed in the press, who mocked the fact that the Neo-druids were dressed up in costumes consisting of white robes and fake beards. ": null
    },
    {
        "Hutton 2009": "Hut09"
    },
    {
        ". pp. 321–322.     Between 1972 and 1984, Stonehenge was the site of the ": null
    },
    {
        "Stonehenge Free Festival": "Stonehenge Free Festival"
    },
    {
        ". After the ": null
    },
    {
        "Battle of the Beanfield": "Battle Of The Beanfield"
    },
    {
        " in 1985, this use of the site was stopped for several years and ritual use of Stonehenge is now heavily restricted.  Some Druids have arranged an assembling of monuments styled on Stonehenge in other parts of the world as a form of Druidist worship.   retrieved 12 October 2012          When Stonehenge was first opened to the public it was possible to walk among and even climb on the stones, but the stones were roped off in 1977 as a result of serious erosion.  . The World Archaeological Congress Visitors are no longer permitted to touch the stones but are able to walk around the monument from a short distance away. English Heritage does, however, permit access during the summer and winter solstice, and the spring and autumn equinox. Additionally, visitors can make special bookings to access the stones throughout the year.  . English Heritage     The access situation and the proximity of the two roads have drawn widespread criticism, highlighted by a 2006 ": null
    },
    {
        "National Geographic": "National Geographic Society"
    },
    {
        " survey. In the survey of conditions at 94 leading World Heritage Sites, 400 conservation and tourism experts ranked Stonehenge 75th in the list of destinations, declaring it to be in moderate trouble .      As motorised traffic increased, the setting of the monument began to be affected by the proximity of the two roads on either side—the ": null
    },
    {
        "A344": "A344 Road"
    },
    {
        " to ": null
    },
    {
        "Shrewton": "Shrewton"
    },
    {
        " on the north side, and the ": null
    },
    {
        "A303": "A303"
    },
    {
        " to ": null
    },
    {
        "Winterbourne Stoke": "Winterbourne Stoke"
    },
    {
        " to the south. Plans to upgrade the A303 and close the A344 to restore the vista from the stones have been considered since the monument became a World Heritage Site. However, the controversy surrounding expensive re-routing of the roads has led to the scheme being cancelled on multiple occasions. On 6 December 2007, it was announced that extensive plans to build ": null
    },
    {
        "Stonehenge road tunnel": "Stonehenge Road Tunnel"
    },
    {
        " under the landscape and create a permanent visitors centre had been cancelled.   ": null
    },
    {
        "Hansard": "Hansard"
    },
    {
        " report of proceedings in the ": null
    },
    {
        "House of Commons": "British House Of Commons"
    },
    {
        " 6 December 2007        On 13 May 2009, the government gave approval for a £25  million scheme to create a smaller visitors centre and close the A344, although this was dependent on funding and local authority planning consent.  On 20 January 2010 Wiltshire Council granted planning permission for a centre  to the west and English Heritage confirmed that funds to build it would be available, supported by a £10m grant from the ": null
    },
    {
        "Heritage Lottery Fund": "Heritage Lottery Fund"
    },
    {
        ".  On 23 June 2013 the A344 was closed to begin the work of removing the section of road and replacing it with grass.   The centre, designed by ": null
    },
    {
        "Denton Corker Marshall": "Denton Corker Marshall"
    },
    {
        ", opened to the public on 18 December 2013.           The earlier rituals were complemented by the ": null
    },
    {
        "Stonehenge Free Festival": "Stonehenge Free Festival"
    },
    {
        ", loosely organised by the ": null
    },
    {
        "Politantric Circle": "Politantric Circle"
    },
    {
        ", held between 1972 and 1984, during which time the number of midsummer visitors had risen to around 30,000.  However, in 1985 the site was closed to festivalgoers by a ": null
    },
    {
        "High Court": "High Court Of Justice"
    },
    {
        " injunction.  A consequence of the end of the festival in 1985 was the violent confrontation between the police and ": null
    },
    {
        "New Age travellers": "New Age Travellers"
    },
    {
        " that became known as the ": null
    },
    {
        "Battle of the Beanfield": "Battle Of The Beanfield"
    },
    {
        " when police blockaded a convoy of travellers to prevent them from approaching Stonehenge. Beginning in 1985, the year of the Battle, no access was allowed into the stones at Stonehenge for any religious reason. This exclusion-zone policy continued for almost fifteen years: until just before the arrival of the twenty-first century, visitors were not allowed to go into the stones at times of religious significance, the ": null
    },
    {
        "winter": "Winter Solstice"
    },
    {
        " and ": null
    },
    {
        "summer": "Summer Solstice"
    },
    {
        "solstices": "Solstice"
    },
    {
        ", and the vernal and autumnal ": null
    },
    {
        "equinox": "Equinox"
    },
    {
        "es.      However, following a ": null
    },
    {
        "European Court of Human Rights": "European Court Of Human Rights"
    },
    {
        " ruling obtained by campaigners such as ": null
    },
    {
        "Arthur Uther Pendragon": "Arthur Uther Pendragon"
    },
    {
        ", the restrictions were lifted. The ruling recognizes that members of any genuine religion have a right to worship in their own church, and Stonehenge is a place of ": null
    },
    {
        "worship": "Worship"
    },
    {
        " to ": null
    },
    {
        "Neo-Druids": "Neo-Druidism"
    },
    {
        ", ": null
    },
    {
        "Pagans": "Paganism"
    },
    {
        " and other Earth based or old religions. The Roundtable meetings include members of the ": null
    },
    {
        "Wiltshire": "Wiltshire"
    },
    {
        " Police force, ": null
    },
    {
        "National Trust": "National Trust For Places Of Historic Interest Or Natural Beauty"
    },
    {
        ", ": null
    },
    {
        "English Heritage": "English Heritage"
    },
    {
        ", ": null
    },
    {
        "Pagans": "Paganism"
    },
    {
        ", ": null
    },
    {
        "Druids": "Druids"
    },
    {
        ", ": null
    },
    {
        "Spiritualists": "Spiritualists"
    },
    {
        " and others.     At the Summer Solstice 2003, which fell over a weekend, over 30,000 people attended a gathering at and in the stones. The 2004 gathering was smaller .                 Throughout recorded history, Stonehenge and its surrounding monuments have attracted attention from ": null
    },
    {
        "antiquarians": "Antiquarians"
    },
    {
        " and ": null
    },
    {
        "archaeologists": "Archaeologists"
    },
    {
        ". ": null
    },
    {
        "John Aubrey": "John Aubrey"
    },
    {
        " was one of the first to examine the site with a scientific eye in 1666, and in his plan of the monument, he recorded the pits that now bear his name, the ": null
    },
    {
        "Aubrey holes": "Aubrey Holes"
    },
    {
        ". ": null
    },
    {
        "William Stukeley": "William Stukeley"
    },
    {
        " continued Aubreys work in the early eighteenth century, but took an interest in the surrounding monuments as well, identifying the Cursus and the Avenue. He also began the excavation of many of the barrows in the area, and it was his interpretation of the landscape that associated it with the ": null
    },
    {
        "Druids": "Druids"
    },
    {
        ". Stukeley, William, 1740, Stonehenge A Temple Restord to the British Druids. London Stukeley was so fascinated with Druids that he originally named ": null
    },
    {
        "Disc Barrows": "Disc Barrow"
    },
    {
        " as Druids Barrows. The most accurate early plan of Stonehenge was that made by Bath architect ": null
    },
    {
        "John Wood": "John Wood, The Elder"
    },
    {
        " in 1740. Wood, John, 1747, Choir Guare, Vulgarly called Stonehenge, on Salisbury Plain. Oxford His original annotated survey has recently been computer redrawn and published.   Importantly Woods plan was made before the collapse of the southwest trilithon, which fell in 1797 and was restored in 1958.     ": null
    },
    {
        "William Cunnington": "William Cunnington"
    },
    {
        " was the next to tackle the area in the early nineteenth century. He excavated some 24 barrows before digging in and around the stones and discovered charred wood, animal bones, pottery and urns. He also identified the hole in which the Slaughter Stone once stood. ": null
    },
    {
        "Richard Colt Hoare": "Richard Colt Hoare"
    },
    {
        " supported Cunningtons work and excavated some 379 barrows on ": null
    },
    {
        "Salisbury Plain": "Salisbury Plain"
    },
    {
        " including on some 200 in the area around the Stones, some excavated in conjunction with ": null
    },
    {
        "William Coxe": "William Coxe"
    },
    {
        ". To alert future diggers to their work they were careful to leave initialled metal tokens in each barrow they opened. Cunningtons finds are displayed at the ": null
    },
    {
        "Wiltshire Museum": "Wiltshire Museum"
    },
    {
        ". In 1877 ": null
    },
    {
        "Charles Darwin": "Charles Darwin"
    },
    {
        " dabbled in archaeology at the stones, experimenting with the rate at which remains sink into the earth for his book  The Formation of Vegetable Mould Through the Action of Worms .     Stone 22 fell during a fierce storm on 31 December 1900.                   ": null
    },
    {
        "William Gowland": "William Gowland"
    },
    {
        " oversaw the first major restoration of the monument in 1901 which involved the straightening and concrete setting of sarsen stone number 56 which was in danger of falling. In straightening the stone he moved it about half a metre from its original position. Gowland also took the opportunity to further excavate the monument in what was the most scientific dig to date, revealing more about the erection of the stones than the previous 100 years of work had done. During the 1920 restoration ": null
    },
    {
        "William Hawley": "William Hawley"
    },
    {
        ", who had excavated nearby ": null
    },
    {
        "Old Sarum": "Old Sarum"
    },
    {
        ", excavated the base of six stones and the outer ditch. He also located a bottle of ": null
    },
    {
        "port": "Port Wine"
    },
    {
        " in the Slaughter Stone socket left by Cunnington, helped to rediscover Aubreys pits inside the bank and located the concentric circular holes outside the Sarsen Circle called the ": null
    },
    {
        "Y and Z Holes": "Y And Z Holes"
    },
    {
        ".      ": null
    },
    {
        "Richard Atkinson": "Richard J. C. Atkinson"
    },
    {
        ", ": null
    },
    {
        "Stuart Piggott": "Stuart Piggott"
    },
    {
        " and ": null
    },
    {
        "John F.S. Stone": "J.F.S. Stone"
    },
    {
        " re-excavated much of Hawleys work in the 1940s and 1950s, and discovered the carved axes and daggers on the Sarsen Stones. Atkinsons work was instrumental in furthering the understanding of the three major phases of the monuments construction.     In 1958 the stones were restored again, when three of the standing sarsens were re-erected and set in concrete bases. The last restoration was carried out in 1963 after stone 23 of the Sarsen Circle fell over. It was again re-erected, and the opportunity was taken to concrete three more stones. Later archaeologists, including ": null
    },
    {
        "Christopher Chippindale": "Christopher Chippindale"
    },
    {
        " of the ": null
    },
    {
        "Museum of Archaeology and Anthropology, University of Cambridge": "Museum Of Archaeology And Anthropology, University Of Cambridge"
    },
    {
        " and Brian Edwards of the ": null
    },
    {
        "University of the West of England": "University Of The West Of England"
    },
    {
        ", campaigned to give the public more knowledge of the various restorations and in 2004 English Heritage included pictures of the work in progress in its book Stonehenge: A History in Photographs.        In 1966 and 1967, in advance of a new car park being built at the site, the area of land immediately northwest of the stones was excavated by ": null
    },
    {
        "Faith": "Faith Vatcher"
    },
    {
        " and ": null
    },
    {
        "Lance Vatcher": "Lance Vatcher"
    },
    {
        ". They discovered the ": null
    },
    {
        "Mesolithic postholes": "Stonehengehistory"
    },
    {
        " dating from between 7000 and 8000 BC, as well as a  length of a ": null
    },
    {
        "palisade": "Palisade"
    },
    {
        " ditch  – a V-cut ditch into which timber posts had been inserted that remained there until they rotted away. Subsequent ": null
    },
    {
        "aerial archaeology": "Aerial Archaeology"
    },
    {
        " suggests that this ditch runs from the west to the north of Stonehenge, near the avenue.     Excavations were once again carried out in 1978 by Atkinson and ": null
    },
    {
        "John Evans": "John G. Evans"
    },
    {
        " during which they discovered the remains of the ": null
    },
    {
        "Stonehenge Archer": "Stonehenge Archer"
    },
    {
        " in the outer ditch,  and in 1979 ": null
    },
    {
        "rescue archaeology": "Rescue Archaeology"
    },
    {
        " was needed alongside the Heel Stone after a cable-laying ditch was mistakenly dug on the roadside, revealing a new stone hole next to the Heel Stone.     In the early 1980s ": null
    },
    {
        "Julian Richards": "Julian Richards"
    },
    {
        " led the ": null
    },
    {
        "Stonehenge Environs Project": "Stonehenge Environs Project"
    },
    {
        ", a detailed study of the surrounding landscape. The project was able to successfully date such features as ": null
    },
    {
        "the Lesser Cursus": "The Lesser Cursus"
    },
    {
        ", ": null
    },
    {
        "Coneybury Henge": "Coneybury Henge"
    },
    {
        " and several other smaller features.     In 1993 the way that Stonehenge was presented to the public was called a national disgrace by the House of Commons Public Accounts Committee. Part of English Heritages response to this criticism was to commission research to collate and bring together all the archaeological work conducted at the monument up to this date. This two-year research project resulted in the publication in 1995 of the monograph  Stonehenge in its landscape , which was the first publication presenting the complex stratigraphy and the finds recovered from the site. It presented a rephasing of the monument.        More recent excavations include a series of digs held between 2003 and 2008 known as the ": null
    },
    {
        "Stonehenge Riverside Project": "Stonehenge Riverside Project"
    },
    {
        ", led by Mike Parker Pearson. This project mainly investigated other monuments in the landscape and their relationship to the stones  — notably, Durrington Walls, where another Avenue leading to the River Avon was discovered. The point where the Stonehenge Avenue meets the river was also excavated and revealed a previously unknown circular area which probably housed four further stones, most likely as a marker for the starting point of the avenue. In April 2008 Tim Darvill of the University of Bournemouth and Geoff Wainwright of the Society of Antiquaries began another dig inside the stone circle to retrieve dateable fragments of the original bluestone pillars. They were able to date the erection of some bluestones to 2300 BC, although this may not reflect the earliest erection of stones at Stonehenge. They also discovered organic material from 7000 BC, which, along with the Mesolithic postholes, adds support for the site has been in use at least 4,000 years before Stonehenge was started. In August and September 2008, as part of the Riverside Project, Julian Richards and ": null
    },
    {
        "Mike Pitts": "Mike Pitts"
    },
    {
        " excavated Aubrey Hole 7, removing the cremated remains from several Aubrey Holes that had been excavated by Hawley in the 1920s, and re-interred in 1935. A licence for the removal of human remains at Stonehenge had been granted by the ": null
    },
    {
        "Ministry of Justice": "Ministry Of Justice"
    },
    {
        " in May 2008, in accordance with the Statement on burial law and archaeology issued in May 2008. One of the conditions of the licence was that the remains should be reinterred within two years and that in the intervening period they should be kept safely, privately and decently.       A new landscape investigation was conducted in April 2009. A shallow mound, rising to about  was identified between stones 54 and 10 , clearly separated from the natural slope. It has not been dated but speculation that it represents careless backfilling following earlier excavations seems disproved by its representation in eighteenth- and nineteenth-century illustrations. Indeed, there is some evidence that, as an uncommon geological feature, it could have been deliberately incorporated into the monument at the outset. A circular, shallow bank, little more than  high, was found between the Y and Z hole circles, with a further bank lying inside the Z circle. These are interpreted as the spread of spoil from the original Y and Z holes, or more speculatively as hedge banks from vegetation deliberately planted to screen the activities within.      In 2010, the ": null
    },
    {
        "Stonehenge Hidden Landscape Project": "Stonehenge Hidden Landscape Project"
    },
    {
        " discovered a henge-like monument less than  away from the main site.  This new hengiform monument was subsequently revealed to be located at the site of Amesbury 50 , a round barrow in the ": null
    },
    {
        "Cursus Barrows": "Cursus Barrows"
    },
    {
        " group.      In November 2011, archaeologists from University of Birmingham announced the discovery of evidence of two huge pits positioned within the ": null
    },
    {
        "Stonehenge Cursus": "Stonehenge Cursus"
    },
    {
        " pathway, aligned in celestial position towards midsummer sunrise and sunset when viewed from the Heel Stone. Boyle, Alan,  , msnbc.com Cosmic Log, 28 November 2011  , University of Birmingham Press Release, 26 November 2011 The new discovery is part of the Stonehenge Hidden Landscape Project which began in the summer of 2010. , University of Birmingham Press Release, 5 July 2010 The project uses non-invasive geophysical imaging technique to reveal and visually recreate the landscape. According to team leader Vince Gaffney, this discovery may provide a direct link between the rituals and astronomical events to activities within the Cursus at Stonehenge.     In December 2011, geologists from University of Leicester and the National Museum of Wales announced the discovery of the source of some of the ": null
    },
    {
        "rhyolite": "Rhyolite"
    },
    {
        " fragments found in the Stonehenge ": null
    },
    {
        "debitage": "Debitage"
    },
    {
        ". These fragments do not seem to match any of the standing stones or bluestone stumps. The researchers have identified the source as a  long rock outcrop called Craig Rhos-y-Felin , near ": null
    },
    {
        "Pont Saeson": "Pont Saeson"
    },
    {
        " in north ": null
    },
    {
        "Pembrokeshire": "Pembrokeshire"
    },
    {
        ", located  from Stonehenge.       In 2014 the ": null
    },
    {
        "University of Birmingham": "University Of Birmingham"
    },
    {
        " announced findings including evidence of adjacent stone and wooden structures and burial mounds, overlooked previously, that may date as far back as 4000 BC.  An area extending to  was studied to a depth of three metres with ": null
    },
    {
        "ground-penetrating radar": "Ground-Penetrating Radar"
    },
    {
        " equipment. As many as seventeen new monuments, revealed nearby, may be Late Neolithic monuments that resemble Stonehenge. The interpretation suggests a complex of numerous related monuments. Also included in the discovery is that the ": null
    },
    {
        "cursus track": "Cursus"
    },
    {
        " is terminated by two  wide extremely deep pits,  whose purpose is still a mystery.       ": null
    }
]