[
    {
        "In ": null
    },
    {
        "computer science": "Computer Science"
    },
    {
        ", string-searching algorithms, sometimes called string-matching algorithms, are an important class of ": null
    },
    {
        "string algorithms": "String Algorithms"
    },
    {
        " that try to find a place where one or several ": null
    },
    {
        "strings": "String"
    },
    {
        " are found within a larger string or text.     A basic example of string searching is when the pattern and the searched text are ": null
    },
    {
        "arrays": "Array Data Structure"
    },
    {
        " of elements of an ": null
    },
    {
        "alphabet": "Alphabet"
    },
    {
        "  Σ. Σ may be a human language alphabet, for example, the letters A through Z and other applications may use a binary alphabet or a DNA alphabet in ": null
    },
    {
        "bioinformatics": "Bioinformatics"
    },
    {
        ".     In practice, the method of feasible string-search algorithm may be affected by the string encoding. In particular, if a ": null
    },
    {
        "variable-width encoding": "Variable-Width Encoding"
    },
    {
        " is in use, then it may be slower to find the Nth character, perhaps requiring time proportional to N. This may significantly slow some search algorithms. One of many possible solutions is to search for the sequence of code units instead, but doing so may produce false matches unless the encoding is specifically designed to avoid it.       The most basic case of string searching involves one string, sometimes called the haystack, and one string, sometimes called the needle. The goal is to find one or more occurrences of the needle within the haystack. For example, one might search for to within:     Some books are to be tasted, others to be swallowed, and some few to be chewed and digested.     One might request the first occurrence of to , which is the fourth word; or all occurrences, of which there are 3; or the last, which is the fifth word from the end.     Very commonly, however, various constraints are added. For example, one might want to match needle only where it consists of one complete words—perhaps defined as not having other letters immediately adjacent on either side. In that case a search for hew or low should fail for the example sentence above, even though those literal strings do occur.     Another common example involves normalization . For many purposes, a search for a phrase such as to be should succeed even in places where there is something else intervening between the to and the be :   More than one space   Other whitespace characters such as tabs, non-breaking spaces, line-breaks, etc.   Less commonly, a hyphen or soft hyphen   In structured texts, ": null
    },
    {
        "tags": "Markup Language"
    },
    {
        " or even arbitrarily large but parenthetical things such as footnotes, list-numbers or other markers, embedded images, and so on.     Many symbol systems include characters that are synonymous :   Latin-based alphabets distinguish lower-case from upper-case, but for many purposes string search is expected to ignore the distinction.   Many languages include ": null
    },
    {
        "ligature": "Typographic Ligature"
    },
    {
        "s, where one composite character is equivalent to two or more other characters.   Many writing systems involve ": null
    },
    {
        "diacritical marks": "Diacritical Marks"
    },
    {
        " such as accents or ": null
    },
    {
        "vowel points": "Vowel Points"
    },
    {
        ", which may vary in their usage, or be of varying importance in matching.   DNA sequences can involve ": null
    },
    {
        "non-coding": "Non-Coding"
    },
    {
        " segments which may be ignored for some purposes, or polymorphisms that lead to no change in the encoded proteins, which may not count as a true difference for some other purposes.   Some languages have rules where a different character or form of character must be used at the start, middle, or end of words.     Finally, for strings that represent natural language, aspects of the language itself become involved. For example, one might wish to find all occurrences of a word despite it having alternate spellings, prefixes or suffixes, etc.     Another more complex type of search is ": null
    },
    {
        "regular expression": "Regular Expression"
    },
    {
        " searching, where the user constructs a pattern of characters or other symbols, and any match to the pattern should fulfill the search. For example, to catch both the American English word color and the British equivalent colour , instead of searching for two different literal strings, one might use a regular expression such as:     colou?r     where the ? conventionally makes the preceding character optional.     This article mainly discusses algorithms for the simpler kinds of string searching.     A similar problem introduced in the field of bioinformatics and genomics is the maximal exact matching .  Given two strings, MEMs are common substrings that cannot be extended left or right without causing a mismatch.        The various ": null
    },
    {
        "algorithms": "Algorithm"
    },
    {
        "can be classified by the number of patterns each uses.       Let m be the length of the pattern, n be the length of the searchable text and k & x7c;Σ & x7c; be the size of the alphabet.        :1.Asymptotic times are expressed using ": null
    },
    {
        "O, Ω, and Θ notation": "Big O Notation"
    },
    {
        ".     The  Boyer–Moore string-search algorithm  has been the standard benchmark for the practical string-search literature.        ": null
    },
    {
        "Aho–Corasick string matching algorithm": "Aho–Corasick String Matching Algorithm"
    },
    {
        "   Commentz-Walter algorithm": "Commentz-Walter Algorithm"
    },
    {
        "   Set-BOM   ": null
    },
    {
        "Rabin–Karp string search algorithm": "Rabin–Karp String Search Algorithm"
    },
    {
        "       Naturally, the patterns can not be enumerated finitely in this case. They are represented usually by a ": null
    },
    {
        "regular grammar": "Regular Grammar"
    },
    {
        " or ": null
    },
    {
        "regular expression": "Regular Expression"
    },
    {
        ".       Other classification approaches are possible. One of the most common uses preprocessing as main criteria.          Another one classifies the algorithms by their matching strategy:    Match the prefix first   Match the suffix first   Match the best factor first   Other strategy       A simple and inefficient way to see where one string occurs inside another is to check each place it could be, one by one, to see if its there. So first we see if theres a copy of the needle in the first character of the haystack; if not, we look to see if theres a copy of the needle starting at the second character of the haystack; if not, we look starting at the third character, and so forth. In the normal case, we only have to look at one or two characters for each wrong position to see that it is a wrong position, so in the average case, this takes ": null
    },
    {
        "O": "Big O Notation"
    },
    {
        " steps, where n is the length of the haystack and m is the length of the needle; but in the worst case, searching for a string like aaaab in a string like aaaaaaaaab , it takes ": null
    },
    {
        "O": "Big O Notation"
    },
    {
        "          In this approach, we avoid backtracking by constructing a ": null
    },
    {
        "deterministic finite automaton": "Deterministic Finite Automaton"
    },
    {
        " that recognizes stored search string. These are expensive to construct—they are usually created using the ": null
    },
    {
        "powerset construction": "Powerset Construction"
    },
    {
        "—but are very quick to use. For example, the ": null
    },
    {
        "DFA": "Deterministic Finite Automaton"
    },
    {
        " shown to the right recognizes the word MOMMY . This approach is frequently generalized in practice to search for arbitrary ": null
    },
    {
        "regular expression": "Regular Expression"
    },
    {
        "s.       ": null
    },
    {
        "Knuth–Morris–Pratt": "Knuth–Morris–Pratt Algorithm"
    },
    {
        " computes a ": null
    },
    {
        "DFA": "Deterministic Finite Automaton"
    },
    {
        " that recognizes inputs with the string to search for as a suffix, ": null
    },
    {
        "Boyer–Moore": "Boyer–Moore String Search Algorithm"
    },
    {
        " starts searching from the end of the needle, so it can usually jump ahead a whole needle-length at each step. Baeza–Yates keeps track of whether the previous j characters were a prefix of the search string, and is therefore adaptable to ": null
    },
    {
        "fuzzy string searching": "Fuzzy String Searching"
    },
    {
        ". The ": null
    },
    {
        "bitap algorithm": "Bitap Algorithm"
    },
    {
        " is an application of Baeza–Yates approach.       Faster search algorithms preprocess the text. After building a ": null
    },
    {
        "substring index": "Substring Index"
    },
    {
        ", for example a ": null
    },
    {
        "suffix tree": "Suffix Tree"
    },
    {
        " or ": null
    },
    {
        "suffix array": "Suffix Array"
    },
    {
        ", the occurrences of a pattern can be found quickly. As an example, a suffix tree can be built in   time, and all z occurrences of a pattern can be found in O time under the assumption that the alphabet has a constant size and all inner nodes in the suffix tree know what leaves are underneath them. The latter can be accomplished by running a ": null
    },
    {
        "DFS algorithm": "Depth-First Search"
    },
    {
        " from the root of the suffix tree.       Some search methods, for instance ": null
    },
    {
        "trigram search": "Trigram Search"
    },
    {
        ", are intended to find a closeness score between the search string and the text rather than a match/non-match . These are sometimes called ": null
    },
    {
        " fuzzy searches": "Approximate String Matching"
    }
]