[
    {
        "      Strontium is the ": null
    },
    {
        "chemical element": "Chemical Element"
    },
    {
        " with the ": null
    },
    {
        "symbol": "Symbol"
    },
    {
        "  Sr and ": null
    },
    {
        "atomic number": "Atomic Number"
    },
    {
        "  38. An ": null
    },
    {
        "alkaline earth metal": "Alkaline Earth Metal"
    },
    {
        ", strontium is a soft silver-white yellowish ": null
    },
    {
        "metal": "Metal"
    },
    {
        "lic element that is highly ": null
    },
    {
        "chemically reactive": "Reactivity"
    },
    {
        ". The metal forms a dark oxide layer when it is exposed to air. Strontium has physical and chemical properties similar to those of its two vertical neighbors in the periodic table, ": null
    },
    {
        "calcium": "Calcium"
    },
    {
        " and ": null
    },
    {
        "barium": "Barium"
    },
    {
        ". It occurs naturally mainly in the ": null
    },
    {
        "minerals": "Minerals"
    },
    {
        " celestine": "Celestine"
    },
    {
        " and ": null
    },
    {
        "strontianite": "Strontianite"
    },
    {
        ", and is mostly mined from these. While natural strontium is stable, the synthetic ": null
    },
    {
        " 90 Sr": "Strontium-90"
    },
    {
        " isotope": "Isotope"
    },
    {
        " is radioactive and is one of the most dangerous components of ": null
    },
    {
        "nuclear fallout": "Nuclear Fallout"
    },
    {
        ", as strontium is absorbed by the body in a similar manner to calcium. Natural stable strontium, on the other hand, is not hazardous to health.     Both strontium and strontianite are named after ": null
    },
    {
        "Strontian": "Strontian"
    },
    {
        ", a village in Scotland near which the mineral was discovered in 1790 by ": null
    },
    {
        "Adair Crawford": "Adair Crawford"
    },
    {
        " and ": null
    },
    {
        "William Cruickshank": "William Cruickshank"
    },
    {
        "; it was identified as a new element the next year from its crimson-red ": null
    },
    {
        "flame test": "Flame Test"
    },
    {
        " color. Strontium was first isolated as a metal in 1808 by ": null
    },
    {
        "Humphry Davy": "Humphry Davy"
    },
    {
        " using the then-newly discovered process of ": null
    },
    {
        "electrolysis": "Electrolysis"
    },
    {
        ". During the 19th century, strontium was mostly used in the production of sugar from ": null
    },
    {
        "sugar beet": "Sugar Beet"
    },
    {
        " . At the peak of production of television ": null
    },
    {
        "cathode ray tubes": "Cathode Ray Tubes"
    },
    {
        ", as much as 75 percent of strontium consumption in the United States was used for the faceplate glass.  With the replacement of cathode ray tubes with other display methods, consumption of strontium has dramatically declined.          Strontium is a ": null
    },
    {
        "divalent": "Divalent"
    },
    {
        " silvery metal with a pale yellow tint whose properties are mostly intermediate between and similar to those of its group neighbors ": null
    },
    {
        "calcium": "Calcium"
    },
    {
        " and ": null
    },
    {
        "barium": "Barium"
    },
    {
        ". Greenwood and Earnshaw, pp. 112–13 It is softer than calcium and harder than barium. Its melting and boiling points are lower than those of calcium ; barium continues this downward trend in the melting point , but not in the boiling point . The density of strontium is similarly intermediate between those of calcium and barium . C. R. Hammond The elements in  Three ": null
    },
    {
        "allotropes": "Allotropy"
    },
    {
        " of metallic strontium exist, with ": null
    },
    {
        "transition points": "Transition Point"
    },
    {
        " at 235 and 540  °C.       The ": null
    },
    {
        "standard electrode potential": "Standard Electrode Potential"
    },
    {
        " for the Sr 2+ /Sr couple is −2.89  V, approximately midway between those of the Ca 2+ /Ca and Ba 2+ /Ba couples, and close to those of the neighboring ": null
    },
    {
        "alkali metals": "Alkali Metal"
    },
    {
        ". Strontium is intermediate between calcium and barium in its reactivity toward water, with which it reacts on contact to produce ": null
    },
    {
        "strontium hydroxide": "Strontium Hydroxide"
    },
    {
        " and ": null
    },
    {
        "hydrogen": "Hydrogen"
    },
    {
        " gas. Strontium metal burns in air to produce both ": null
    },
    {
        "strontium oxide": "Strontium Oxide"
    },
    {
        " and ": null
    },
    {
        "strontium nitride": "Strontium Nitride"
    },
    {
        ", but since it does not react with ": null
    },
    {
        "nitrogen": "Nitrogen"
    },
    {
        " below 380  °C, at room temperature, it forms only the oxide spontaneously. Besides the simple oxide SrO, the ": null
    },
    {
        "peroxide": "Peroxide"
    },
    {
        " SrO 2 can be made by direct oxidation of strontium metal under a high pressure of oxygen, and there is some evidence for a yellow ": null
    },
    {
        "superoxide": "Superoxide"
    },
    {
        " Sr 2 . Greenwood and Earnshaw, p. 119 ": null
    },
    {
        "Strontium hydroxide": "Strontium Hydroxide"
    },
    {
        ", Sr 2 , is a strong base, though it is not as strong as the hydroxides of barium or the alkali metals. Greenwood and Earnshaw, p. 121 All four dihalides of strontium are known. Greenwood and Earnshaw, p. 117     Due to the large size of the heavy ": null
    },
    {
        "s-block": "S-Block"
    },
    {
        " elements, including strontium, a vast range of coordination numbers is known, from 2, 3, or 4 all the way to 22 or 24 in SrCd 11 and SrZn 13 . The Sr 2+ ion is quite large, so that high ": null
    },
    {
        "coordination numbers": "Coordination Number"
    },
    {
        " are the rule. Greenwood and Earnshaw, p. 115 The large size of strontium and barium plays a significant part in stabilising strontium complexes with ": null
    },
    {
        "polydentate": "Denticity"
    },
    {
        " macrocyclic": "Macrocycle"
    },
    {
        " ligands such as ": null
    },
    {
        "crown ethers": "Crown Ether"
    },
    {
        ": for example, while ": null
    },
    {
        "18-crown-6": "18-Crown-6"
    },
    {
        " forms relatively weak complexes with calcium and the alkali metals, its strontium and barium complexes are much stronger. Greenwood and Earnshaw, p. 124     Organostrontium compounds contain one or more strontium–carbon bonds. They have been reported as intermediates in ": null
    },
    {
        "Barbier-type": "Barbier Reaction"
    },
    {
        " reactions.    Although strontium is in the same group as magnesium, and ": null
    },
    {
        "organomagnesium compounds": "Organomagnesium Compound"
    },
    {
        " are very commonly used throughout chemistry, organostrontium compounds are not similarly widespread because they are more difficult to make and more reactive. Organostrontium compounds tend to be more similar to organo": null
    },
    {
        "europium": "Europium"
    },
    {
        " or organo": null
    },
    {
        "samarium": "Samarium"
    },
    {
        " compounds due to the similar ": null
    },
    {
        "ionic radii": "Ionic Radius"
    },
    {
        " of these elements . Most of these compounds can only be prepared at low temperatures; bulky ligands tend to favor stability. For example, strontium di": null
    },
    {
        "cyclopentadienyl": "Cyclopentadienyl"
    },
    {
        ", Sr 2 , must be made by directly reacting strontium metal with ": null
    },
    {
        "mercurocene": "Mercurocene"
    },
    {
        " or ": null
    },
    {
        "cyclopentadiene": "Cyclopentadiene"
    },
    {
        " itself; replacing the C 5 H 5 ligand with the bulkier C 5 5 ligand on the other hand increases the compounds solubility, volatility, and kinetic stability. Greenwood and Earnshaw, pp. 136–37     Because of its extreme reactivity with ": null
    },
    {
        "oxygen": "Oxygen"
    },
    {
        " and water, strontium occurs naturally only in compounds with other elements, such as in the minerals ": null
    },
    {
        "strontianite": "Strontianite"
    },
    {
        " and ": null
    },
    {
        "celestine": "Celestine"
    },
    {
        ". It is kept under a liquid ": null
    },
    {
        "hydrocarbon": "Hydrocarbon"
    },
    {
        " such as ": null
    },
    {
        "mineral oil": "Mineral Oil"
    },
    {
        " or ": null
    },
    {
        "kerosene": "Kerosene"
    },
    {
        " to prevent ": null
    },
    {
        "oxidation": "Oxidation"
    },
    {
        "; freshly exposed strontium metal rapidly turns a yellowish color with the formation of the oxide. Finely powdered strontium metal is ": null
    },
    {
        "pyrophoric": "Pyrophoric"
    },
    {
        ", meaning that it will ignite spontaneously in air at room temperature. Volatile strontium salts impart a bright red color to flames, and these salts are used in ": null
    },
    {
        "pyrotechnics": "Pyrotechnic"
    },
    {
        " and in the production of ": null
    },
    {
        "flares": "Flare"
    },
    {
        ". Like calcium and barium, as well as the alkali metals and the divalent ": null
    },
    {
        "lanthanides": "Lanthanide"
    },
    {
        " europium": "Europium"
    },
    {
        " and ": null
    },
    {
        "ytterbium": "Ytterbium"
    },
    {
        ", strontium metal dissolves directly in liquid ": null
    },
    {
        "ammonia": "Ammonia"
    },
    {
        " to give a dark blue solution.       Natural strontium is a mixture of four stable ": null
    },
    {
        "isotopes": "Isotope"
    },
    {
        ": 84 Sr, 86 Sr, 87 Sr, and 88 Sr. Their abundance increases with increasing ": null
    },
    {
        "mass number": "Mass Number"
    },
    {
        " and the heaviest, 88 Sr, makes up about 82.6% of all natural strontium, though the abundance varies due to the production of ": null
    },
    {
        "radiogenic": "Radiogenic"
    },
    {
        " 87 Sr as the daughter of long-lived beta-decaying 87 ": null
    },
    {
        "Rb": "Rubidium"
    },
    {
        ". Greenwood and Earnshaw, p. 19 Of the unstable isotopes, the primary decay mode of the isotopes lighter than 85 Sr is ": null
    },
    {
        "electron capture": "Electron Capture"
    },
    {
        " or ": null
    },
    {
        "positron emission": "Positron Emission"
    },
    {
        " to isotopes of rubidium, and that of the isotopes heavier than 88 Sr is ": null
    },
    {
        "electron emission": "Electron Emission"
    },
    {
        " to isotopes of ": null
    },
    {
        "yttrium": "Yttrium"
    },
    {
        ". Of special note are ": null
    },
    {
        " 89 Sr": "Strontium-89"
    },
    {
        " and ": null
    },
    {
        " 90 Sr": "Strontium-90"
    },
    {
        ". The former has a half-life of 50.6  days and is used to treat ": null
    },
    {
        "bone cancer": "Bone Cancer"
    },
    {
        " due to strontiums chemical similarity and hence ability to replace calcium.   While 90 Sr has been used similarly, it is also an isotope of concern in ": null
    },
    {
        "fallout": "Nuclear Fallout"
    },
    {
        " from ": null
    },
    {
        "nuclear weapons": "Nuclear Weapons"
    },
    {
        " and ": null
    },
    {
        "nuclear accidents": "Nuclear Accidents"
    },
    {
        " due to its production as a ": null
    },
    {
        "fission product": "Fission Product"
    },
    {
        ". Its presence in bones can cause bone cancer, cancer of nearby tissues, and ": null
    },
    {
        "leukemia": "Leukemia"
    },
    {
        ".  The ": null
    },
    {
        "1986 Chernobyl nuclear accident": "Chernobyl Accident"
    },
    {
        " contaminated about 30,000  km 2 with greater than 10 kBq/m 2 with 90 Sr, which accounts for 5% of the core inventory of 90 Sr.           Strontium is named after the Scottish village of ": null
    },
    {
        "Strontian": "Strontian"
    },
    {
        " , where it was discovered in the ores of the lead mines.  ": null
    },
    {
        "Thomas Charles Hope": "Thomas Charles Hope"
    },
    {
        " originally named the element strontianite, but the name was soon after shortened to strontium.      In 1790, ": null
    },
    {
        "Adair Crawford": "Adair Crawford"
    },
    {
        ", a physician engaged in the preparation of barium, and his colleague ": null
    },
    {
        "William Cruickshank": "William Cruickshank"
    },
    {
        ", recognised that the Strontian ores exhibited properties that differed from those in other heavy spars sources.  This allowed Adair to conclude on page 355 ...  it is probable indeed, that the scotch mineral is a new species of earth which has not hitherto been sufficiently examined. The physician and mineral collector ": null
    },
    {
        "Friedrich Gabriel Sulzer": "Friedrich Gabriel Sulzer"
    },
    {
        " analysed together with ": null
    },
    {
        "Johann Friedrich Blumenbach": "Johann Friedrich Blumenbach"
    },
    {
        " the mineral from Strontian and named it strontianite. He also came to the conclusion that it was distinct from the ": null
    },
    {
        "witherite": "Witherite"
    },
    {
        " and contained a new earth .  In 1793 ": null
    },
    {
        "Thomas Charles Hope": "Thomas Charles Hope"
    },
    {
        ", a professor of chemistry at the University of Glasgow proposed the name strontites. Although Thomas C. Hope had investigated strontium ores since 1791, his research was published in:      He confirmed the earlier work of Crawford and recounted: ...  Considering it a peculiar earth I thought it necessary to give it an name. I have called it Strontites, from the place it was found; a mode of derivation in my opinion, fully as proper as any quality it may possess, which is the present fashion. The element was eventually isolated by Sir ": null
    },
    {
        "Humphry Davy": "Humphry Davy"
    },
    {
        " in 1808 by the ": null
    },
    {
        "electrolysis": "Electrolysis"
    },
    {
        " of a mixture containing ": null
    },
    {
        "strontium chloride": "Strontium Chloride"
    },
    {
        " and ": null
    },
    {
        "mercuric oxide": "Mercuric Oxide"
    },
    {
        ", and announced by him in a lecture to the Royal Society on 30 June 1808.  In keeping with the naming of the other alkaline earths, he changed the name to strontium.      Many other early investigators examined strontium ore, among them:  Martin Heinrich Klaproth, Chemische Versuche über die Strontianerde , Crells Annalen no. ii, pp. 189–202 ; and Nachtrag zu den Versuchen über die Strontianerde , Crells Annalen no. i, p. 99 ; also       The first large-scale application of strontium was in the production of sugar from ": null
    },
    {
        "sugar beet": "Sugar Beet"
    },
    {
        ". Although a crystallisation process using strontium hydroxide was patented by ": null
    },
    {
        "Augustin-Pierre Dubrunfaut": "Augustin-Pierre Dubrunfaut"
    },
    {
        " in 1849  the large scale introduction came with the improvement of the process in the early 1870s. The German ": null
    },
    {
        "sugar industry": "Sugar Industry"
    },
    {
        " used the process well into the 20th century. Before ": null
    },
    {
        "World War I": "World War I"
    },
    {
        " the beet sugar industry used 100,000 to 150,000 tons of strontium hydroxide for this ": null
    },
    {
        "process": "Strontian Process"
    },
    {
        " per year.  The strontium hydroxide was recycled in the process, but the demand to substitute losses during production was high enough to create a significant demand initiating mining of strontianite in the ": null
    },
    {
        "Münsterland": "Münsterland"
    },
    {
        ". The mining of strontianite in Germany ended when mining of the ": null
    },
    {
        "celestine": "Celestine"
    },
    {
        " deposits in ": null
    },
    {
        "Gloucestershire": "Gloucestershire"
    },
    {
        " started.  These mines supplied most of the world strontium supply from 1884 to 1941. Although the celestine deposits in the ": null
    },
    {
        "Granada basin": "Granada Basin"
    },
    {
        " were known for some time the large scale mining did not start before the 1950s.      During atmospheric ": null
    },
    {
        "nuclear weapons testing": "Nuclear Weapons Testing"
    },
    {
        ", it was observed that strontium-90 is one of the ": null
    },
    {
        "nuclear fission products": "Nuclear Fission Product"
    },
    {
        " with a relative high yield. The similarity to calcium and the chance that the strontium-90 might become enriched in bones made research on the metabolism of strontium an important topic.               Strontium commonly occurs in nature, being the 15th most ": null
    },
    {
        "abundant element": "Abundance Of The Chemical Elements"
    },
    {
        " on Earth , estimated to average approximately 360  ": null
    },
    {
        "parts per million": "Parts Per Million"
    },
    {
        " in the ": null
    },
    {
        "Earths crust": "Abundance Of Elements In Earths Crust"
    },
    {
        "  and is found chiefly as the ": null
    },
    {
        "sulfate": "Sulfate"
    },
    {
        " mineral": "Mineral"
    },
    {
        " celestine and the ": null
    },
    {
        "carbonate": "Carbonate"
    },
    {
        " strontianite . Of the two, celestine occurs much more frequently in deposits of sufficient size for mining. Because strontium is used most often in the carbonate form, strontianite would be the more useful of the two common minerals, but few deposits have been discovered that are suitable for development.      In groundwater strontium behaves chemically much like calcium. At intermediate to acidic ": null
    },
    {
        "pH": "Ph"
    },
    {
        " Sr 2+ is the dominant strontium species. In the presence of calcium ions, strontium commonly forms ": null
    },
    {
        "coprecipitates": "Coprecipitation"
    },
    {
        " with calcium minerals such as ": null
    },
    {
        "calcite": "Calcite"
    },
    {
        " and anhydrite at an increased pH. At intermediate to acidic pH, dissolved strontium is bound to soil particles by ": null
    },
    {
        "cation exchange": "Cation-Exchange Capacity"
    },
    {
        ".      The mean strontium content of ocean water is 8  mg/l.   At a concentration between 82 and 90 µmol/l of strontium, the concentration is considerably lower than the calcium concentration, which is normally between 9.6 and 11.6  mmol/l.   It is nevertheless much higher than that of barium, 13  μg/l.            The three major producers of strontium as celestine as of 2015 are China , Spain , and Mexico ; Argentina and Morocco are smaller producers. Although strontium deposits occur widely in the United States, they have not been mined since 1959.     A large proportion of mined celestine is converted to the carbonate by two processes. Either the celestine is directly leached with sodium carbonate solution or the celestine is roasted with coal to form the sulfide. The second stage produces a dark-coloured material containing mostly ": null
    },
    {
        "strontium sulfide": "Strontium Sulfide"
    },
    {
        ". This so-called black ash is dissolved in water and filtered. Strontium carbonate is precipitated from the strontium sulfide solution by introduction of ": null
    },
    {
        "carbon dioxide": "Carbon Dioxide"
    },
    {
        ".  The sulfate is ": null
    },
    {
        "reduced": "Redox"
    },
    {
        " to the ": null
    },
    {
        "sulfide": "Sulfide"
    },
    {
        " by the ": null
    },
    {
        "carbothermic reduction": "Carbothermic Reduction"
    },
    {
        "oxide": "Oxide"
    },
    {
        " with ": null
    },
    {
        "aluminium": "Aluminium"
    },
    {
        ". The strontium is ": null
    },
    {
        "distilled": "Distillation"
    },
    {
        " from the mixture. Strontium metal can also be prepared on a small scale by ": null
    },
    {
        "electrolysis": "Electrolysis"
    },
    {
        " of a solution of ": null
    },
    {
        "strontium chloride": "Strontium Chloride"
    },
    {
        " in molten ": null
    },
    {
        "potassium chloride": "Potassium Chloride"
    },
    {
        " → Sr   :2 Cl − → Cl 2 + 2           Consuming 75% of production, the primary use for strontium is in glass for colour television ": null
    },
    {
        "cathode ray tubes": "Cathode Ray Tube"
    },
    {
        ", where it prevents ": null
    },
    {
        "X-ray": "X-Ray"
    },
    {
        " emission.   This application for strontium is declining because CRTs are being replaced by other display methods. This decline has a significant influence on the mining and refining of strontium. All parts of the CRT must absorb X-rays. In the neck and the funnel of the tube, lead glass is used for this purpose, but this type of glass shows a browning effect due to the interaction of the X-rays with the glass. Therefore, the front panel is made from a different glass mixture with strontium and barium to absorb the X-rays. The average values for the glass mixture determined for a recycling study in 2005 is 8.5% ": null
    },
    {
        "strontium oxide": "Strontium Oxide"
    },
    {
        " and 10% ": null
    },
    {
        "barium oxide": "Barium Oxide"
    },
    {
        ".      Because strontium is so similar to calcium, it is incorporated in the bone. All four stable isotopes are incorporated, in roughly the same proportions they are found in nature. However, the actual distribution of the isotopes tends to vary greatly from one geographical location to another. Thus, analyzing the bone of an individual can help determine the region it came from.   This approach helps to identify the ancient migration patterns and the origin of commingled human remains in battlefield burial sites.      87 Sr/ 86 Sr ratios are commonly used to determine the likely provenance areas of sediment in natural systems, especially in marine and fluvial environments. Dasch showed that surface sediments of Atlantic displayed 87 Sr/ 86 Sr ratios that could be regarded as bulk averages of the 87 Sr/ 86 Sr ratios of geological terranes from adjacent landmasses.  A good example of a fluvial-marine system to which Sr isotope provenance studies have been successfully employed is the River Nile-Mediterranean system.   Due to the differing ages of the rocks that constitute the majority of the Blue and White Nile, catchment areas of the changing provenance of sediment reaching the River Nile delta and East Mediterranean Sea can be discerned through strontium isotopic studies. Such changes are climatically controlled in the Late ": null
    },
    {
        "Quaternary": "Quaternary"
    },
    {
        ".     More recently, 87 Sr/ 86 Sr ratios have also been used to determine the source of ancient archaeological materials such as timbers and corn in Chaco Canyon, New Mexico.   87 Sr/ 86 Sr ratios in teeth may also be used to track animal migrations.       ": null
    },
    {
        "Strontium aluminate": "Strontium Aluminate"
    },
    {
        " is frequently used in ": null
    },
    {
        "glow in the dark": "Phosphorescence"
    },
    {
        " toys, as it is chemically and biologically inert.        ": null
    },
    {
        "Strontium carbonate": "Strontium Carbonate"
    },
    {
        " and other strontium ": null
    },
    {
        "salts": "Salt"
    },
    {
        " are added to fireworks to give a deep red colour.  This same effect identifies strontium ": null
    },
    {
        "cations": "Cations"
    },
    {
        " in the ": null
    },
    {
        "flame test": "Flame Test"
    },
    {
        ". Fireworks consume about 5% of the worlds production. MacMillan, J. Paul; Park, Jai Won; Gerstenberg, Rolf; Wagner, Heinz; Köhler, Karl and Wallbrecht, Peter Strontium and Strontium Compounds in Ullmanns Encyclopedia of Industrial Chemistry, Wiley-VCH, Weinheim. . Strontium carbonate is used in the manufacturing of hard ": null
    },
    {
        "ferrite": "Ferrite"
    },
    {
        " magnets.       ": null
    },
    {
        "Strontium chloride": "Strontium Chloride"
    },
    {
        " is sometimes used in toothpastes for sensitive teeth. One popular brand includes 10% total strontium chloride hexahydrate by weight.  Small amounts are used in the refining of zinc to remove small amounts of lead impurities. The metal itself has a limited use as a ": null
    },
    {
        "getter": "Getter"
    },
    {
        ", to remove unwanted gases in vacuums by reacting with them, although barium may also be used for this purpose. Greenwood and Earnshaw, p. 111     The ultra-narrow optical transition between the s 2 1 S 0 electronic ": null
    },
    {
        "ground state": "Ground State"
    },
    {
        " and the ": null
    },
    {
        "metastables": "Metastability"
    },
    {
        "5p 3 P 0 excited state of 87 Sr is one of the leading candidates for the future re-definition of the ": null
    },
    {
        "second": "Second"
    },
    {
        " in terms of an optical transition as opposed to the current definition derived from a microwave transition between different ": null
    },
    {
        "hyperfine": "Hyperfine Structure"
    },
    {
        " ground states of ": null
    },
    {
        " 133 Cs.": "Caesium"
    },
    {
        "  Current optical ": null
    },
    {
        "atomic clocks": "Atomic Clock"
    },
    {
        " operating on this transition already surpass the precision and accuracy of the current definition of the second.       ": null
    },
    {
        " 89 Sr": "Strontium-89"
    },
    {
        " is the active ingredient in ": null
    },
    {
        "Metastron": "Metastron"
    },
    {
        ",  a ": null
    },
    {
        "radiopharmaceutical": "Radiopharmaceutical"
    },
    {
        " used for bone pain secondary to ": null
    },
    {
        "metastatic": "Metastatic"
    },
    {
        " bone cancer": "Bone Cancer"
    },
    {
        ". The strontium is processed like calcium by the body, preferentially incorporating it into bone at sites of increased ": null
    },
    {
        "osteogenesis": "Osteogenesis"
    },
    {
        ". This localization focuses the radiation exposure on the cancerous lesion.        ": null
    },
    {
        " 90 Sr": "Strontium-90"
    },
    {
        " has been used as a power source for ": null
    },
    {
        "radioisotope thermoelectric generators": "Radioisotope Thermoelectric Generator"
    },
    {
        " . 90 Sr produces approximately 0.93 watts of heat per gram .  However, 90 Sr has one third the lifetime and a lower density than ": null
    },
    {
        " 238 Pu": "Plutonium-238"
    },
    {
        ", another RTG fuel. The main advantage of 90 Sr is that it is cheaper than 238 Pu and is found in ": null
    },
    {
        "nuclear waste": "Nuclear Waste"
    },
    {
        ". The ": null
    },
    {
        "Soviet Union": "Soviet Union"
    },
    {
        " deployed nearly 1000 of these RTGs on its northern coast as a power source for lighthouses and meteorology stations.            ": null
    },
    {
        "Acantharea": "Acantharea"
    },
    {
        ", a relatively large group of marine ": null
    },
    {
        "radiolaria": "Radiolaria"
    },
    {
        "n ": null
    },
    {
        "protozoa": "Protozoa"
    },
    {
        ", produce intricate mineral ": null
    },
    {
        "skeletons": "Skeleton"
    },
    {
        " composed of ": null
    },
    {
        "strontium sulfate": "Strontium Sulfate"
    },
    {
        ".  In biological systems, calcium is substituted in a small extent by strontium.    In the human body, most of the absorbed strontium is deposited in the bones. The ratio of strontium to calcium in human bones is between 1:1000 and 1:2000, roughly in the same range as in the blood serum.          The human body absorbs strontium as if it were its lighter congener calcium. Because the elements are chemically very similar, stable strontium isotopes do not pose a significant health threat. The average human has an intake of about two milligrams of strontium a day.  In adults, strontium consumed tends to attach only to the surface of bones, but in children, strontium can replace calcium in the mineral of the growing bones and thus lead to bone growth problems.      The ": null
    },
    {
        "biological half-life": "Biological Half-Life"
    },
    {
        " of strontium in humans has variously been reported as from 14 to 600 days,   1000 days,  18 years,  30 years  and, at an upper limit, 49 years.  The wide-ranging published biological half-life figures are explained by strontiums complex metabolism within the body. However, by averaging all excretion paths, the overall biological half-life is estimated to be about 18 years.  The elimination rate of strontium is strongly affected by age and sex, due to differences in ": null
    },
    {
        "bone metabolism": "Bone Metabolism"
    },
    {
        ".      The drug ": null
    },
    {
        "strontium ranelate": "Strontium Ranelate"
    },
    {
        " aids ": null
    },
    {
        "bone": "Bone"
    },
    {
        " growth, increases bone density, and lessens the incidence of vertebral, peripheral, and hip ": null
    },
    {
        "fractures": "Bone Fracture"
    },
    {
        ".   However, strontium ranelate also increases the risk of venous thromboembolism, pulmonary embolism, and serious cardiovascular disorders, including myocardial infarction. Its use is therefore now restricted.  Its beneficial effects are also questionable, since the increased bone density is partially caused by the increased density of strontium over the calcium which it replaces. Strontium also ": null
    },
    {
        "bioaccumulates": "Bioaccumulation"
    },
    {
        " in the body.  Despite restrictions on ": null
    },
    {
        "strontium ranelate": "Strontium Ranelate"
    },
    {
        ", strontium is still contained in some supplements.   There is not much scientific evidence on risks of strontium chloride when taken by mouth. Those with a personal or family history of blood clotting disorders are advised to avoid strontium.     Strontium has been shown to inhibit sensory irritation when applied topically to the skin.   Topically applied, strontium has been shown to accelerate the recovery rate of the epidermal permeability barrier . ": null
    }
]