[
    {
        "      Sulawesi , formerly known as Celebes , is one of the four ": null
    },
    {
        "Greater Sunda Islands": "Greater Sunda Islands"
    },
    {
        ". It is governed by ": null
    },
    {
        "Indonesia": "Indonesia"
    },
    {
        ". The ": null
    },
    {
        "worlds eleventh-largest island": "List Of Islands By Area"
    },
    {
        ", it is situated east of ": null
    },
    {
        "Borneo": "Borneo"
    },
    {
        ", west of the ": null
    },
    {
        "Maluku Islands": "Maluku Islands"
    },
    {
        ", and south of ": null
    },
    {
        "Mindanao": "Mindanao"
    },
    {
        " and the ": null
    },
    {
        "Sulu Archipelago": "Sulu Archipelago"
    },
    {
        ". Within Indonesia, only ": null
    },
    {
        "Sumatra": "Sumatra"
    },
    {
        ", ": null
    },
    {
        "Borneo": "Borneo"
    },
    {
        " and ": null
    },
    {
        "Papua": "Papua"
    },
    {
        " are larger in territory, and only ": null
    },
    {
        "Java": "Java"
    },
    {
        " and Sumatra have larger populations.     The landmass of Sulawesi includes four peninsulas: the northern ": null
    },
    {
        "Minahasa Peninsula": "Minahassa Peninsula"
    },
    {
        "; the ": null
    },
    {
        "East Peninsula": "East Peninsula, Sulawesi"
    },
    {
        "; the ": null
    },
    {
        "South Peninsula": "South Peninsula, Sulawesi"
    },
    {
        "; and the ": null
    },
    {
        "Southeast Peninsula": "Southeast Peninsula, Sulawesi"
    },
    {
        ". Three gulfs separate these peninsulas: the ": null
    },
    {
        "Gulf of Tomini": "Gulf Of Tomini"
    },
    {
        " between the northern Minahasa and East peninsulas; the ": null
    },
    {
        "Tolo Gulf": "Tolo Gulf"
    },
    {
        " between the East and Southeast peninsulas; and the ": null
    },
    {
        "Bone Gulf": "Bone Gulf"
    },
    {
        " between the South and Southeast peninsulas. The ": null
    },
    {
        "Strait of Makassar": "Strait Of Makassar"
    },
    {
        " runs along the western side of the island and separates the island from Borneo.            The name Sulawesi possibly comes from the words sula and besi and may refer to the historical export of ": null
    },
    {
        "iron": "Iron"
    },
    {
        " from the rich ": null
    },
    {
        "Lake Matano": "Lake Matano"
    },
    {
        " iron deposits": "Iron Ore"
    },
    {
        ". Watuseke, F. S. 1974. On the name Celebes. Sixth International Conference on Asian History, International Association of Historians of Asia, Yogyakarta, 26–30 August. Unpublished. The name came into common use in English following ": null
    },
    {
        "Indonesian independence": "Indonesian Independence"
    },
    {
        ".     The name Celebes was originally given to the island by ": null
    },
    {
        "Portuguese explorers": "Portuguese Explorers"
    },
    {
        ". While its direct translation is unclear, it may be considered a Portuguese rendering of the native name Sulawesi .        Sulawesi is the ": null
    },
    {
        "worlds eleventh-largest island": "List Of Islands By Area"
    },
    {
        ",  covering an area of . The central part of the island is ruggedly mountainous, such that the islands peninsulas have traditionally been remote from each other, with better connections by sea than by road. The three bays that divide Sulawesis peninsulas are, from north to south, the ": null
    },
    {
        "Tomini": "Bay Of Tomini"
    },
    {
        ", the ": null
    },
    {
        "Tolo": "Bay Of Tolo"
    },
    {
        " and the ": null
    },
    {
        "Boni": "Gulf Of Boni"
    },
    {
        ". These separate the ": null
    },
    {
        "Minahassa or Northern Peninsula": "Semenanjung Minahassa"
    },
    {
        ", the ": null
    },
    {
        "East Peninsula": "East Peninsula, Sulawesi"
    },
    {
        ", the ": null
    },
    {
        "Southeast Peninsula": "Southeast Peninsula, Sulawesi"
    },
    {
        " and the ": null
    },
    {
        "South Peninsula": "South Peninsula, Sulawesi"
    },
    {
        ".     The ": null
    },
    {
        "Strait of Makassar": "Strait Of Makassar"
    },
    {
        " runs along the western side of the island.  The island is surrounded by ": null
    },
    {
        "Borneo": "Borneo"
    },
    {
        " to the west, by the ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        " to the north, by ": null
    },
    {
        "Maluku": "Maluku Islands"
    },
    {
        " to the east, and by ": null
    },
    {
        "Flores": "Flores"
    },
    {
        " and ": null
    },
    {
        "Timor": "Timor"
    },
    {
        " to the south.       The ": null
    },
    {
        "Selayar Islands": "Selayar Islands"
    },
    {
        " make up a peninsula stretching southwards from Southwest Sulawesi into the ": null
    },
    {
        "Flores Sea": "Flores Sea"
    },
    {
        " are administratively part of Sulawesi. The ": null
    },
    {
        "Sangihe Islands": "Sangihe Islands"
    },
    {
        " and ": null
    },
    {
        "Talaud Islands": "Talaud Islands"
    },
    {
        " stretch northward from the northeastern tip of Sulawesi, while ": null
    },
    {
        "Buton Island": "Buton"
    },
    {
        " and its neighbours lie off its southeast peninsula, the ": null
    },
    {
        "Togian Islands": "Togian Islands"
    },
    {
        " are in the Gulf of Tomini, and ": null
    },
    {
        "Peleng Island": "Peleng Island"
    },
    {
        " and ": null
    },
    {
        "Banggai Islands": "Banggai Islands Regency"
    },
    {
        " form a cluster between Sulawesi and ": null
    },
    {
        "Maluku": "Maluku Islands"
    },
    {
        ". All the above-mentioned islands, and many smaller ones are administratively part of Sulawesis six provinces.            The island slopes up from the shores of the deep seas surrounding the island to a high, mostly non-volcanic, mountainous interior. Active volcanoes are found in the northern ": null
    },
    {
        "Minahassa Peninsula": "Minahassa Peninsula"
    },
    {
        ", stretching north to the ": null
    },
    {
        "Sangihe Islands": "Sangihe Islands"
    },
    {
        ". The northern peninsula contains several active volcanoes such as ": null
    },
    {
        "Mount Lokon": "Mount Lokon"
    },
    {
        ", ": null
    },
    {
        "Mount Awu": "Mount Awu"
    },
    {
        ", ": null
    },
    {
        "Soputan": "Soputan"
    },
    {
        " and ": null
    },
    {
        "Karangetang": "Karangetang"
    },
    {
        ".     According to ": null
    },
    {
        "plate reconstruction": "Plate Reconstruction"
    },
    {
        "s, the island is believed to have been formed by the collision of ": null
    },
    {
        "terranes": "Terrane"
    },
    {
        "from the ": null
    },
    {
        "Asian Plate": "Asian Plate"
    },
    {
        " and from the ": null
    },
    {
        "Australian Plate": "Australian Plate"
    },
    {
        " , with ": null
    },
    {
        "island arcs": "Island Arc"
    },
    {
        "previously in the Pacific .  Because of its several tectonic origins, various ": null
    },
    {
        "faults": "Fault"
    },
    {
        " scar the land and as a result the island is prone to ": null
    },
    {
        "earthquake": "Earthquake"
    },
    {
        "s.     Sulawesi, in contrast to most of the other islands in the ": null
    },
    {
        "biogeographical": "Biogeography"
    },
    {
        " region of ": null
    },
    {
        "Wallacea": "Wallacea"
    },
    {
        ", is not truly oceanic, but a composite island at the centre of the Asia-Australia ": null
    },
    {
        "collision zone": "Collision Zone"
    },
    {
        ". Parts of the island were formerly attached to either the ": null
    },
    {
        "Asia": "Asia"
    },
    {
        "n or ": null
    },
    {
        "Australian": "Australia"
    },
    {
        " continental margin and became separated from these areas by ": null
    },
    {
        "vicariant processes": "Vicariance"
    },
    {
        ". In the west, the opening of the ": null
    },
    {
        "Makassar Strait": "Makassar Strait"
    },
    {
        " separated West Sulawesi from ": null
    },
    {
        "Sundaland": "Sundaland"
    },
    {
        " in the ": null
    },
    {
        "Eocene": "Eocene"
    },
    {
        " c. 45 Mya. In the east, the traditional view of collisions of multiple ": null
    },
    {
        "micro-continent": "Micro-Continent"
    },
    {
        "al fragments sliced from New Guinea with an active volcanic margin in West Sulawesi at different times since the ": null
    },
    {
        "Early Miocene": "Early Miocene"
    },
    {
        " c. 20 Mya has recently been replaced by the hypothesis that extensional fragmentation has followed a single Miocene collision of West Sulawesi with the ": null
    },
    {
        "Sula Spur": "Sula Spur"
    },
    {
        ", the western end of an ancient folded belt of ": null
    },
    {
        "Variscan origin": "Variscan Orogeny"
    },
    {
        " in the Late Paleozoic.          Before October 2014, the settlement of South Sulawesi by modern humans had been dated to c. 30,000 BC on the basis of radiocarbon dates obtained from rock shelters in Maros. Ian Glover, Leang Burung 2: an Upper Palaeolithic rock shelter in South Sulawesi, Indonesia . Modern Quaternary Research in Southeast Asia 6:1–38; David Bulbeck, Iwan Sumantri, Peter Hiscock, Leang Sakapao 1; a second dated Pleistocene site from South Sulawesi, Indonesia . Modern Quaternary Research in Southeast Asia 18:111-28. No earlier evidence of human occupation had at that point been found, but the island almost certainly formed part of the land bridge used for the settlement of Australia and ": null
    },
    {
        "New Guinea": "New Guinea"
    },
    {
        " by at least 40,000 BCE. C.C. Macknight The emergence of civilization in South Celebes and elsewhere, in A. Reid and L. Castles Pre-Colonial state systems in Southeast Asia. Kuala Lumpur: Malaysian Branch of the ": null
    },
    {
        "Royal Asiatic Society": "Royal Asiatic Society"
    },
    {
        " Homo erectus  having reached Sulawesi; crude stone tools first discovered in 1947 on the right bank of the ": null
    },
    {
        "Walennae River": "Walennae River"
    },
    {
        " at ": null
    },
    {
        "Berru, Indonesia": "Berru, Indonesia"
    },
    {
        ", which were thought to date to the Pleistocene on the basis of their association with vertebrate fossils, Gert-Jan Bartstra, Susan Keates, Basoek, Bahru Kallupa On the dispersal of Homo sapiens in Eastern Indonesia: the Paleolithic of South Sulawesi .  Current Anthropology , 32: 317–21. are now thought to date to perhaps 50,000 BC. David Bulbeck, Iwan Sumantri, Peter Hiscock, Leang Sakapao 1; a second dated Pleistocene site from South Sulawesi, Indonesia . Modern Quaternary Research in Southeast Asia 18:111-28.        Following Peter Bellwoods model of a southward migration of Austronesian-speaking farmers , Peter Bellwood,1997, The prehistory of the Indo-Malaysian archipelago. . radiocarbon dates from caves in ": null
    },
    {
        "Maros": "Maros"
    },
    {
        " suggest a date in the mid-second millennium BC for the arrival of a group from east Borneo speaking a Proto-": null
    },
    {
        "South Sulawesi language": "South Sulawesi Languages"
    },
    {
        " . Initial settlement was probably around the mouth of the Sadan river, on the northwest coast of the peninsula, although the south coast has also been suggested. Bulbeck, F.D. 1992. A tale of two kingdoms; The historical archaeology of Gowa and Tallok, South Sulawesi, Indonesia. Ph.D thesis, ": null
    },
    {
        "The Australian National University": "The Australian National University"
    },
    {
        ".     Subsequent migrations across the mountainous landscape resulted in the geographical isolation of PSS speakers and the evolution of their languages into the eight families of the South Sulawesi language group.   If each group can be said to have a homeland, that of the ": null
    },
    {
        "Bugis": "Bugis"
    },
    {
        " – today the most numerous group – was around lakes ": null
    },
    {
        "Témpé": "Témpé"
    },
    {
        " and ": null
    },
    {
        "Sidénréng": "Sidénréng"
    },
    {
        " in the Walennaé depression. Here for some 2,000 years lived the linguistic group that would become the modern Bugis; the archaic name of this group was Ugiq. Despite the fact that today they are closely linked with the ": null
    },
    {
        "Makasar": "Makasar"
    },
    {
        ", the closest linguistic neighbours of the Bugis are the ": null
    },
    {
        "Toraja": "Toraja"
    },
    {
        ".     Pre-1200 Bugis society was most likely organised into chiefdoms. Some anthropologists have speculated these chiefdoms would have warred and, in times of peace, exchanged women with each other. Further, they have speculated that personal security would have been negligible and head-hunting an established cultural practice. The political economy would have been a mixture of hunting and gathering and swidden or shifting agriculture. Speculative planting of ": null
    },
    {
        "wet rice": "Wet Rice"
    },
    {
        " may have taken place along the margins of the lakes and rivers.        In Central Sulawesi, there are over 400 granite ": null
    },
    {
        "megalith": "Megalith"
    },
    {
        "s, which various archaeological studies have dated to be from 3000 BC to AD 1300. They vary in size from a few centimetres to around . The original purpose of the megaliths is unknown. About 30 of the megaliths represent human forms. Other megaliths are in form of large pots  and stone plates .   , retrieved 11 October 2010      In October 2014 it was announced that ": null
    },
    {
        "cave paintings": "Cave Painting"
    },
    {
        "in Maros had been dated as being about 40,000 years old. Dr Maxime Aubert, of ": null
    },
    {
        "Griffith University": "Griffith University"
    },
    {
        " in ": null
    },
    {
        "Queensland": "Queensland"
    },
    {
        ", ": null
    },
    {
        "Australia": "Australia"
    },
    {
        ", said that the minimum age for the outline of a hand was 39,900 years old, which made it the oldest ": null
    },
    {
        "hand stencil": "Hand Stencil"
    },
    {
        " in the world and added, Next to it is a pig that has a minimum age of 35,400 years old, and this is one of the oldest figurative depictions in the world, if not the oldest one.              Starting in the 13th century, access to prestige trade goods and to sources of iron started to alter long-standing cultural patterns and to permit ambitious individuals to build larger political units. It is not known why these two ingredients appeared together; one was perhaps the product of the other.     In 1367, several identified polities, located on the island, were mentioned in the Javanese manuscript ": null
    },
    {
        "Nagarakretagama": "Nagarakretagama"
    },
    {
        " dated from the ": null
    },
    {
        "Majapahit": "Majapahit"
    },
    {
        " period. Canto 14 mentioned polities including Gowa, Makassar, ": null
    },
    {
        "Luwu": "Luwu"
    },
    {
        " and Banggai. It seems that by the 14th century, polities in the island were connected in an archipelagic maritime trading network, centered in the Majapahit port in East Java. By 1400, a number of nascent agricultural principalities had arisen in the western Cenrana valley, as well as on the south coast and on the west coast near modern Parepare. Caldwell, I.A. 1988. South Sulawesi A.D. 1300–1600; Ten Bugis texts. Ph.D thesis, The Australian National University; Bougas, W. 1998. Bantayan; An early Makassarese kingdom 1200 -1600 AD. Archipel 55: 83–123; Caldwell, I. and W.A. Bougas 2004. The early history of Binamu and Bangkala, South Sulawesi. Bijdragen tot de Taal-, Land- en Volkenkunde 64: 456–510; Druce, S. 2005. The lands west of the lake; The history of Ajattappareng, South Sulawesi, AD 1200 to 1600. Ph.D thesis, the University of Hull.     The first Europeans to visit the island were the ": null
    },
    {
        "Portuguese": "Portuguese People"
    },
    {
        " sailors Simão de Abreu, in 1523, and Gomes de Sequeira in 1525, sent from the Moluccas in search of gold, which the islands had the reputation of producing. Crawfurd, J. 1856. A descriptive dictionary of the Indian islands and adjacent countries. London: Bradbury & Evans.  Luis Filipe F. R. Thomaz, The image of the Archipelago in Portuguese cartography of the 16th and early 17th centuries, Persee, 1995, Volume 49 pages: 83 A Portuguese base was installed in Makassar in the first decades of the 16th century, lasting until 1665, when it was taken by the Dutch. The Dutch had arrived in Sulawesi in 1605 and were quickly followed by the English, who established a factory in Makassar. Bassett, D. K. .and ruled a base in Makassar since the mid-16th century to the year 1665, when it was taken by the Dutch. English trade in Celebes, 1613–67. Journal of the Royal Asiatic Society 31: 1–39. From 1660, the Dutch were at war with ": null
    },
    {
        "Gowa": "Gowa"
    },
    {
        ", the major Makassar west coast power. In 1669, Admiral Speelman forced the ruler, Sultan Hasanuddin, to sign the ": null
    },
    {
        "Treaty of Bongaya": "Treaty Of Bongaja"
    },
    {
        ", which handed control of trade to the ": null
    },
    {
        "Dutch East India Company": "Dutch East India Company"
    },
    {
        ". The Dutch were aided in their conquest by the Bugis warlord Arung Palakka, ruler of the Bugis kingdom of ": null
    },
    {
        "Bone": "Bone State"
    },
    {
        ". The Dutch built a fort at Ujung Pandang, while Arung Palakka became the regional overlord and Bone the dominant kingdom. Political and cultural development seems to have slowed as a result of the status quo.     In 1905 the entire island became part of the Dutch state colony of the ": null
    },
    {
        "Netherlands East Indies": "Dutch East Indies"
    },
    {
        " until ": null
    },
    {
        "Japanese occupation": "Japanese Occupation Of Indonesia"
    },
    {
        " in the ": null
    },
    {
        "Second World War": "Second World War"
    },
    {
        ". During the ": null
    },
    {
        "Indonesian National Revolution": "Indonesian National Revolution"
    },
    {
        ", the Dutch Captain ": null
    },
    {
        "Turk Westerling": "Raymond Westerling"
    },
    {
        " led campaigns in which hundreds, maybe thousands died during the ": null
    },
    {
        "South Sulawesi Campaign": "South Sulawesi Campaign Of 1946–1947"
    },
    {
        ". Kahin , p. 145 Following the transfer of sovereignty in December 1949, Sulawesi became part of the ": null
    },
    {
        "federal": "Federal Government"
    },
    {
        " United States of Indonesia": "United States Of Indonesia"
    },
    {
        ", which in 1950 became absorbed into the ": null
    },
    {
        "unitary": "Unitary State"
    },
    {
        " Republic of Indonesia": "Republic Of Indonesia"
    },
    {
        ". Westerling, R. 1952. Challenge to Terror            The Portuguese were rumoured to have a fort in Parigi in 1555. Balinese of Parigi, Central Sulawesi , however she gives no source. The Kaili were an important group based in the ": null
    },
    {
        "Palu": "Palu River"
    },
    {
        " valley and related to the Toraja. Scholars relate that their control swayed under Ternate and Makassar, but this might have been a decision by the Dutch to give their vassals a chance to govern a difficult group. Padbruge commented that in the 1700s Kaili numbers were significant and a highly militant society. In the 1850s a war erupted between the Kaili groups, including the Banawa, in which the Dutch decided to intervene. A complex conflict also involving the Sulu Island pirates and probably Wyndham .     In the late 19th century the Sarasins journeyed through the Palu valley as part of a major initiative to bring the Kaili under Dutch rule. Some very surprising and interesting photographs were taken of shamans called Tadulako. Further Christian religious missions entered the area to make one of the most detailed ethnographic studies in the early 20th century. Kruyt & Adriani. A Swede by the name of ": null
    },
    {
        "Walter Kaudern": "Walter Kaudern"
    },
    {
        " later studied much of the literature and produced a synthesis. Erskine Downs in the 1950s produced a summary of Kruyts and Andrianis work: The religion of the Baree-Speaking Toradja of Central Celebes, which is invaluable for English-speaking researchers. One of the most recent publications is When the bones are left, a study of the material culture of central Sulawesi, Eija-Maija Kotilainen – History – 1992. offering extensive analysis. Also worthy of study are the brilliant works of Monnig Atkinson on the Wana shamans who live in the Mori area.       The 2000 census population of the provinces of Sulawesi was 14,946,488, about 7.25% of Indonesias total population.     By the 2010 Census the total had reached 17,371,782, and the latest official estimate is 19,573,800. The largest city is ": null
    },
    {
        "Makassar": "Makassar"
    },
    {
        ".       ": null
    },
    {
        "Islam": "Islam In Indonesia"
    },
    {
        " is the majority religion in Sulawesi. The conversion of the lowlands of the south western peninsula to Islam occurred in the early 17th century. The kingdom of Luwu in the Gulf of Bone was the first to accept Islam in February 1605; the Makassar kingdom of Goa-Talloq, centred on the modern-day city of ": null
    },
    {
        "Makassar": "Makassar"
    },
    {
        ", followed suit in September. Noorduyn, J. 1956. De Islamisering van Makasar. Bijdragen tot de Taal-, Land- en Volkenkunde 112: 247–66; Caldwell, I. 1995. Power, state and society in pre-Islamic South Sulawesi. Bijdragen tot de Taal-, Land- en Volkenkunde 151: 394–421 However, the ": null
    },
    {
        "Gorontalo": "Gorontaloan People"
    },
    {
        " and the ": null
    },
    {
        "Mongondow": "Mongondow People"
    },
    {
        " peoples of the northern peninsula largely converted to Islam only in the 19th century. Most Muslims are ": null
    },
    {
        "Sunni": "Sunni"
    },
    {
        "s.        ": null
    },
    {
        "Christians": "Christianity In Indonesia"
    },
    {
        " form a substantial minority on the island. According to the ": null
    },
    {
        "demographer": "Demography"
    },
    {
        " Toby Alice Volkman, 17% of Sulawesis population is ": null
    },
    {
        "Protestant": "Protestantism In Indonesia"
    },
    {
        " and less than 2% is ": null
    },
    {
        "Roman Catholic": "Roman Catholicism In Indonesia"
    },
    {
        ". Christians are concentrated on the tip of the northern peninsula around the city of ": null
    },
    {
        "Manado": "Manado"
    },
    {
        ", which is inhabited by the ": null
    },
    {
        "Minahasa": "Minahasa"
    },
    {
        ", a predominantly Protestant people, and the northernmost ": null
    },
    {
        "Sangir": "Sangir Islands"
    },
    {
        " and ": null
    },
    {
        "Talaud Islands": "Talaud Islands"
    },
    {
        ". The ": null
    },
    {
        "Toraja": "Toraja"
    },
    {
        " people of ": null
    },
    {
        "Tana Toraja": "Tana Toraja"
    },
    {
        " in Central Sulawesi have largely converted to Christianity since Indonesias independence. There are also substantial numbers of Christians around ": null
    },
    {
        "Lake Poso": "Lake Poso"
    },
    {
        " in Central Sulawesi, among the ": null
    },
    {
        "Pamona": "Pamona"
    },
    {
        " speaking peoples of Central Sulawesi, and near ": null
    },
    {
        "Mamasa": "Mamasa, Mamasa"
    },
    {
        ".     Though most people identify themselves as Muslims or Christians, they often subscribe to local beliefs and deities as well. It is not uncommon for both groups to make offerings to local gods, goddesses, and spirits.     Smaller communities of ": null
    },
    {
        "Buddhists": "Buddhism In Indonesia"
    },
    {
        " and ": null
    },
    {
        "Hindus": "Hinduism In Indonesia"
    },
    {
        " are also found on Sulawesi, usually among the ": null
    },
    {
        "Chinese": "Chinese Indonesian"
    },
    {
        ", ": null
    },
    {
        "Balinese": "Balinese People"
    },
    {
        " and ": null
    },
    {
        "Indian": "Indian Indonesian"
    },
    {
        " communities.              The island is subdivided into six ": null
    },
    {
        "provinces": "Provinces Of Indonesia"
    },
    {
        "Gorontalo": "Gorontalo"
    },
    {
        ", ": null
    },
    {
        "West Sulawesi": "West Sulawesi"
    },
    {
        ", ": null
    },
    {
        "South Sulawesi": "South Sulawesi"
    },
    {
        ", ": null
    },
    {
        "Central Sulawesi": "Central Sulawesi"
    },
    {
        ", ": null
    },
    {
        "Southeast Sulawesi": "Southeast Sulawesi"
    },
    {
        " and ": null
    },
    {
        "North Sulawesi": "North Sulawesi"
    },
    {
        ". West Sulawesi is a new province, created in 2004 from part of South Sulawesi. The largest cities on the island are ": null
    },
    {
        "Makassar": "Makassar"
    },
    {
        ", ": null
    },
    {
        "Manado": "Manado"
    },
    {
        ", ": null
    },
    {
        "Palu": "Palu"
    },
    {
        ", ": null
    },
    {
        "Kendari": "Kendari"
    },
    {
        ", ": null
    },
    {
        "Bitung": "Bitung"
    },
    {
        ", ": null
    },
    {
        "Gorontalo": "Gorontalo"
    },
    {
        ", ": null
    },
    {
        "Palopo": "Palopo"
    },
    {
        " and ": null
    },
    {
        "Baubau": "Baubau"
    },
    {
        ".                                Sulawesi is part of ": null
    },
    {
        "Wallacea": "Wallacea"
    },
    {
        ", meaning that it has a mix of both ": null
    },
    {
        "Indomalayan": "Indomalayan Realm"
    },
    {
        " and ": null
    },
    {
        "Australasian": "Australasian Realm"
    },
    {
        " species that reached the island by ": null
    },
    {
        "crossing deep-water oceanic barriers": "Oceanic Dispersal"
    },
    {
        ".   The flora includes one native eucalypt,  E. deglupta . There are 8 ": null
    },
    {
        "national parks": "List Of National Parks Of Indonesiasulawesi"
    },
    {
        " on the island, of which 4 are mostly ": null
    },
    {
        "marine": "Marine Park"
    },
    {
        ". The parks with the largest terrestrial area are ": null
    },
    {
        "Bogani Nani Wartabone": "Bogani Nani Wartabone National Park"
    },
    {
        " with 2,871  km 2 and ": null
    },
    {
        "Lore Lindu National Park": "Lore Lindu National Park"
    },
    {
        " with 2,290  km 2 . ": null
    },
    {
        "Bunaken National Park": "Bunaken National Park"
    },
    {
        ", which protects a rich coral ecosystem, has been proposed as an UNESCO ": null
    },
    {
        "World Heritage Site": "World Heritage Site"
    },
    {
        ".       Early in the Pleistocene, Sulawesi had a ": null
    },
    {
        "dwarf elephant": "Dwarf Elephant"
    },
    {
        " and a ": null
    },
    {
        "dwarf": "Insular Dwarfism"
    },
    {
        " form of  Stegodon , ; later both were replaced by larger forms.  A giant ": null
    },
    {
        "suid": "Suidae"
    },
    {
        ",  Celebochoerus , was also formerly present.  It is thought that many of the migrants to Sulawesi arrived via the ": null
    },
    {
        "Philippines": "Philippines"
    },
    {
        ", while Sulawesi in turn served as a way station for migrants to ": null
    },
    {
        "Flores": "Flores"
    },
    {
        ". Morwood & van Oosterzee ,  A Pleistocene faunal turnover is recognised, with the competitive displacement of several indigenous tarsiers by more recently arriving ones and by  Celebochoerus  by other medium-sized herbivores like the ": null
    },
    {
        "babirusa": "Babirusa"
    },
    {
        ", ": null
    },
    {
        "anoa": "Anoa"
    },
    {
        " and ": null
    },
    {
        "Celebes warty pig": "Celebes Warty Pig"
    },
    {
        ". Laurent A. F. Frantz; Anna Rudzinski; Abang Mansyursyah Surya Nugraha; Allowen Evin; James Burton; Ardern Hulme-Beaman; Anna Linderholm; Ross Barnett; Rodrigo Vega; Evan K. Irving-Pease; James Haile; Richard Allen; Kristin Leus; Jill Shephard; Mia Hillyer; Sarah Gillemot; Jeroen van den Hurk; Sharron Ogle; Cristina Atofanei; Mark G. Thomas; Friederike Johansson; Abdul Haris Mustari; John Williams; Kusdiantoro Mohamad; Chandramaya Siska Damayanti; Ita Djuwita Wiryadi; Dagmar Obbles; Stephano Mona; Hally Day; Muhammad Yasin; Stefan Meker; Jimmy A. McGuire; Ben J. Evans; Thomas von Rintelen; Simon Y. W. Ho; Jeremy B. Searle; Andrew C. Kitchener; Alastair A. Macdonald; Darren J. Shaw; Robert Hall; Peter Galbusera; Greger Larson . Synchronous diversification of Sulawesis iconic artiodactyls driven by recent geological events . Proceedings of the Royal Society B: Biological Sciences. 285 : 20172566. doi:10.1098/rspb.2017.2566. PMC 5904307 Freely accessible. .        There are 127 known extant native mammalian species in Sulawesi. A large percentage, 62% are ": null
    },
    {
        "endemic": "Endemism"
    },
    {
        ", meaning that they are found nowhere else in the world. The largest of these are the two species of ": null
    },
    {
        "anoa": "Anoa"
    },
    {
        " or dwarf buffalo. Other artiodactyl species inhabiting Sulawesi are the ": null
    },
    {
        "warty pig": "Celebes Warty Pig"
    },
    {
        " and the ": null
    },
    {
        "babirusas": "Babirusas"
    },
    {
        ", which are aberrant pigs. The only native ": null
    },
    {
        "carnivora": "Carnivora"
    },
    {
        "n is the ": null
    },
    {
        "Sulawesi palm civet": "Sulawesi Palm Civet"
    },
    {
        " . Primates present include a number of ": null
    },
    {
        "nocturnal": "Nocturnal"
    },
    {
        "tarsiers": "Tarsier"
    },
    {
        "  as well as ": null
    },
    {
        "diurnal": "Diurnality"
    },
    {
        "macaques": "Macaque"
    },
    {
        " . While most of Sulawesis mammals are ": null
    },
    {
        "placental": "Eutheria"
    },
    {
        " and have Asian relatives, several species of ": null
    },
    {
        "cuscus": "Cuscus"
    },
    {
        ", arboreal ": null
    },
    {
        "marsupials": "Marsupials"
    },
    {
        " of Australasian origin, are also present .     Sulawesi is home to a large number of endemic ": null
    },
    {
        "rodent": "Rodent"
    },
    {
        " genera. ": null
    },
    {
        "Murid": "Muridae"
    },
    {
        " rodent genera endemic to Sulawesi and immediately adjacent islands  are  Bunomys ,  Echiothrix ,  Margaretamys ,  Taeromys  and  Tateomys  as well as the single-species genera  Eropeplus ,  Hyorhinomys ,  Melasmothrix ,  Paucidentomys ,  Paruromys  and  Sommeromys . Endemic ": null
    },
    {
        "sciurid": "Sciuridae"
    },
    {
        " genera are  Hyosciurus ,  Prosciurillus ,  Rubrisciurus  and  Waiomys .     While over 20 bat species are present on Sulawesi, only a portion of these are endemic:  Rhinolophus tatar ,  Scotophilus celebensis  and the ": null
    },
    {
        "megabats": "Megabat"
    },
    {
        "  Acerodon celebensis ,  Boneia bidens ,  Dobsonia exoleta ,  Harpyionycteris celebensis ,  Neopteryx frosti ,  Rousettus celebensis  and  Styloctenium wallacei .     Several endemic shrews, the ": null
    },
    {
        "Sulawesi shrew": "Sulawesi Shrew"
    },
    {
        ", ": null
    },
    {
        "Sulawesi tiny shrew": "Sulawesi Tiny Shrew"
    },
    {
        " and the ": null
    },
    {
        "Sulawesi white-handed shrew": "Sulawesi White-Handed Shrew"
    },
    {
        ", are found on the island.          By contrast, Sulawesian bird species tend to be found on other nearby islands as well, such as ": null
    },
    {
        "Borneo": "Borneo"
    },
    {
        "; 31% of Sulawesis birds are found nowhere else. One endemic is the largely ground-dwelling, chicken-sized ": null
    },
    {
        "maleo": "Maleo"
    },
    {
        ", a ": null
    },
    {
        "megapode": "Megapode"
    },
    {
        " which sometimes uses hot sand close to the islands volcanic vents to incubate its eggs. An international partnership of conservationists, donors, and local people have formed the Alliance for Tompotika Conservation,  in an effort to raise awareness and protect the nesting grounds of these birds on the central-eastern arm of the island. Other endemic birds include the flightless ": null
    },
    {
        "snoring rail": "Snoring Rail"
    },
    {
        ", the ": null
    },
    {
        "fiery-browed starling": "Fiery-Browed Starling"
    },
    {
        ", the ": null
    },
    {
        "Sulawesi masked owl": "Sulawesi Masked Owl"
    },
    {
        ", the ": null
    },
    {
        "Sulawesi myna": "Sulawesi Myna"
    },
    {
        ", the ": null
    },
    {
        "satanic nightjar": "Satanic Nightjar"
    },
    {
        " and the ": null
    },
    {
        "grosbeak starling": "Grosbeak Starling"
    },
    {
        ". There are around 350 known bird species in Sulawesi.       The larger reptiles of Sulawesi are not endemic and include ": null
    },
    {
        "reticulated": "Reticulated Python"
    },
    {
        " and ": null
    },
    {
        "Burmese": "Burmese Python"
    },
    {
        " pythons, ": null
    },
    {
        "king cobra": "King Cobra"
    },
    {
        "s, ": null
    },
    {
        "water monitor": "Water Monitor"
    },
    {
        "s, ": null
    },
    {
        "sailfin lizard": "Hydrosaurus Amboinensis"
    },
    {
        "s,  ": null
    },
    {
        "saltwater crocodiles": "Saltwater Crocodile"
    },
    {
        "  and ": null
    },
    {
        "green sea turtle": "Green Sea Turtle"
    },
    {
        "s. An extinct giant ": null
    },
    {
        "tortoise": "Tortoise"
    },
    {
        ",  Megalochelys atlas , was formerly present, but disappeared by 840,000 years ago, possibly because of the arrival of humans.   Similarly, ": null
    },
    {
        "komodo dragons": "Komodo Dragon"
    },
    {
        "or similar lizards appear to have inhabited the island, being among its apex predators. Hocknull, S. A.; Piper, P. J.; van den Bergh, G. D.; Due, R. A.; Morwood, M. J.; Kurniawan, I. . Dragons paradise lost: palaeobiogeography, evolution and extinction of the largest-ever terrestrial lizards . PLOS One. 4 : e7241. Bibcode:2009PLoSO...4.7241H. doi:10.1371/journal.pone.0007241. PMC 2748693 Freely accessible. . The smaller snakes of Sulawesi include endemic forms such as  Calamaria boesemani ,  Calamaria muelleri ,  Calamaria nuchalis ,  Cyclotyphlops ,  Enhydris matannensis ,  Ptyas dipsas ,  Rabdion grovesi ,  Tropidolaemus laticinctus  and  Typhlops conradi . Similarly, the smaller lizards of Sulawesi include nonendemic species such as  Bronchocela jubata ,  Dibamus novaeguineae  and  Gekko smithii , as well as endemic species such as  Lipinia infralineolata  and  Luperosaurus iskandari .       The amphibians of Sulawesi include the endemic frogs  Hylarana celebensis ,  H. macrops ,  H. mocquardi ,  Ingerophrynus celebensis ,  Limnonectes arathooni ,  L. larvaepartus ,  L. microtympanum ,  Occidozyga celebensis ,  O. semipalmata  and  O. tompotika  as well as the endemic ": null
    },
    {
        "flying frogs": "Flying Frog"
    },
    {
        "  Rhacophorus edentulus  and  R. georgii .            Sulawesi is home to more than 70 ": null
    },
    {
        "freshwater fish": "Freshwater Fish"
    },
    {
        " species, Nguyen, T.T.T., and S. S. De Silva . Freshwater finfish biodiversity and conservation: an asian perspective. Biodiversity & Conservation 15: 3543–3568 including more than 55 endemics. Parenti, L.R. . . Prosiding Seminar Nasional Ikan IV: 1-10. Among these are the genus  Nomorhamphus , a ": null
    },
    {
        "species flock": "Species Flock"
    },
    {
        " of ": null
    },
    {
        "viviparous halfbeaks": "Viviparous Halfbeak"
    },
    {
        "containing 12 species that only are found on Sulawesi . http://www.nmnh.si.edu/rtp/students/1993/students1993louie.htm The Systematic Review of the Fish Genus Nomorhamphus – Louie, Kristina, research paper, Colgate University, Hamilton, New York, 1993  In addition to Nomorhamphus, the majority of Sulawesis freshwater fish species are ": null
    },
    {
        "ricefish": "Ricefish"
    },
    {
        "es, gobies  and ": null
    },
    {
        "Telmatherinid": "Telmatherinidae"
    },
    {
        " sail-fin silversides. The last family is almost entirely restricted to Sulawesi, especially the Malili Lake system, consisting of ": null
    },
    {
        "Matano": "Lake Matano"
    },
    {
        " and ": null
    },
    {
        "Towuti": "Lake Towuti"
    },
    {
        ", and the small ": null
    },
    {
        "Lontoa": "Lake Lontoa"
    },
    {
        " , ": null
    },
    {
        "Mahalona": "Lake Mahalona"
    },
    {
        " and ": null
    },
    {
        "Masapi": "Lake Masapi"
    },
    {
        ". Gray, S.M., and J.S. McKinnon . A comparative description of mating behavior in the endemic telmatherinid fishes of Sulawesis Malili Lakes. Environmental Biology of Fishes 75: 471–482 Another unusual endemic is  Lagusia micracanthus  from rivers in ": null
    },
    {
        "South Sulawesi": "South Sulawesi"
    },
    {
        ", which is the sole member of its genus and among the smallest ": null
    },
    {
        "grunters": "Terapontidae"
    },
    {
        ". Vari, P.R.; and Hadiaty, K.R. . http://rmbr.nus.edu.sg/rbz/biblio/60/60rbz157-162.pdf The Endemic Sulawesi Fish Genus Lagusia . The Raffles Bulletin of Zoology 60: 157–162 The ": null
    },
    {
        "gudgeon": "Eleotridae"
    },
    {
        "  Bostrychus microphthalmus  from the ": null
    },
    {
        "Maros": "Maros Regency"
    },
    {
        " Karst is the only described species of ": null
    },
    {
        "cave-adapted fish": "Cavefish"
    },
    {
        " from Sulawesi, Hoese, D.F., and M. Kottelat . Bostrychus microphthalmus, a new microphthalmic cavefish from Sulawesi . Ichthyol. Explor. Freshwaters 16: 183–191 but an apparently ": null
    },
    {
        "undescribed species": "Undescribed Species"
    },
    {
        " from the same region and genus also exists. Saturi, O.S. .   Mongabay-Indonesia. Retrieved 23 November 2012.          Many species of  Caridina  freshwater shrimp and ": null
    },
    {
        "parathelphusid": "Parathelphusidae"
    },
    {
        " freshwater crabs  are endemic to Sulawesi. von Rintelen, K., and Y. Cai . Radiation of endemic species flocks in ancient lakes: systematic revision of the freshwater shrimp Caridina H. Milne Edwards, 1837 from the ancient lakes Of Sulawesi, Indonesia, with the description of eight new species. Raffles Bulletin of Zoology 57: 343–452. Chia, O.C.K. and P.K.L. Ng . The freshwater crabs of Sulawesi, with descriptions of two new genera and four new species . Raffles Bulletin of Zoology 54: 381–428. Several of these species have become very popular in the aquarium hobby, and since most are restricted to a single lake system, they are potentially vulnerable to ": null
    },
    {
        "habitat loss": "Habitat Loss"
    },
    {
        " and ": null
    },
    {
        "overexploitation": "Overexploitation"
    },
    {
        ". There are also several endemic cave-adapted shrimp and crabs, especially in the Maros Karst. This includes  Cancrocaeca xenomorpha , which has been called the most highly ": null
    },
    {
        "cave-adapted": "Troglobite"
    },
    {
        " species of crab known in the world . Deharveng, L. , D. Guinot and P.K.L. Ng .  . ASEAN Regional Center for Biodiversity Conservation. Retrieved 13 November 2012.     The genus  Tylomelania  of ": null
    },
    {
        "freshwater snails": "Freshwater Snail"
    },
    {
        "is also endemic to Sulawesi, with the majority of the species restricted to ": null
    },
    {
        "Lake Poso": "Lake Poso"
    },
    {
        " and the Malili Lake system. von Rintelen , T., K. von Rintelen, and M. Glaubrecht . The species flock of the viviparous freshwater gastropod Tylomelania in the ancient lakes of Sulawesi, Indonesia: the role of geography, trophic morphology and color as driving forces in adaptive radiation. pp. 485–512 in: Glaubrecht, M., and H. Schneider, eds. . Evolution in Action: Adaptive Radiations and the Origins of Biodiversity. Springer Verlag, Heidelberg, Germany.       The ": null
    },
    {
        "Indonesian coelacanth": "Indonesian Coelacanth"
    },
    {
        " and the ": null
    },
    {
        "mimic octopus": "Mimic Octopus"
    },
    {
        " are present in the waters off Sulawesis coast.       Sulawesi island was recently the subject of an Ecoregional Conservation Assessment, coordinated by ": null
    },
    {
        "The Nature Conservancy": "The Nature Conservancy"
    },
    {
        ". Detailed reports about the vegetation of the island are available.   – Reports from the Nature Conservancys Indonesian Program and Texas Tech University, Department of Biological Sciences; 2004 The assessment produced a detailed and annotated list of conservation portfolio sites. This information was widely distributed to local government agencies and nongovernmental organizations. Detailed conservation priorities have also been outlined in a recent publication.  – Cannon, C.H. et al.     The lowland forests on the island have mostly been removed.  – mongabay.com Because of the relative geological youth of the island and its dramatic and sharp topography, the lowland areas are naturally limited in their extent. The past decade has seen dramatic conversion of this rare and endangered habitat. The island also possesses one of the largest outcrops of ": null
    },
    {
        "serpentine soil": "Serpentine Soil"
    },
    {
        " in the world, which support an unusual and large community of specialized plant species. Overall, the flora and fauna of this unique center of global biodiversity is very poorly documented and understood and remains critically threatened.     The islands of Pepaya, Mas and Raja islands, located in Sumalata Village - ": null
    },
    {
        "North Gorontalo Regency": "North Gorontalo Regency"
    },
    {
        " , have been named a nature reserve since the Dutch colonial time in 1936. Four of the only seven species of ": null
    },
    {
        "sea turtles": "Sea Turtle"
    },
    {
        "can be found in the islands, the worlds best turtle habitat. They include penyu hijau , penyu sisik , penyu tempayan  and penyu belimbing . In 2011, the habitat was threatened by human activities such as illegal poaching and fish bombing activities; furthermore, a lot of coral reefs, which represent a source of food for turtles, have been damaged.           The largest environmental issue in Sulawesi is ": null
    },
    {
        "deforestation": "Deforestation"
    },
    {
        ". In 2007, scientists found that 80 percent of Sulawesis forest had been lost or degraded, especially centered in the lowlands and the mangroves.  – mongabay.com Forests have been felled for logging and large agricultural projects. Loss of forest has resulted in many of Sulawesis endemic species becoming endangered. In addition, 99 percent of Sulawesis wetlands have been lost or damaged.     Other environmental threats included bushmeat hunting and mining. ": null
    }
]