[
    {
        "   The Supreme Court of Judicature Act 1873  was an ": null
    },
    {
        "act": "Act Of Parliament"
    },
    {
        " of the ": null
    },
    {
        "Parliament of the United Kingdom": "Parliament Of The United Kingdom"
    },
    {
        " in 1873. It reorganised the ": null
    },
    {
        "English court system": "English Court System"
    },
    {
        " to establish the ": null
    },
    {
        "High Court": "High Court Of England And Wales"
    },
    {
        " and the ": null
    },
    {
        "Court of Appeal": "Court Of Appeal Of England And Wales"
    },
    {
        ", and also originally provided for the abolition of the ": null
    },
    {
        "judicial functions of the House of Lords": "Judicial Functions Of The House Of Lords"
    },
    {
        " with respect to ": null
    },
    {
        "England": "England"
    },
    {
        ". It would have retained those functions in relation to ": null
    },
    {
        "Scotland": "Scotland"
    },
    {
        " and ": null
    },
    {
        "Ireland": "Ireland"
    },
    {
        " for the time being. However, the ": null
    },
    {
        "Gladstone": "William Ewart Gladstone"
    },
    {
        " Liberal": "Liberal Party"
    },
    {
        " government fell in 1874 before the act entered into force, and the succeeding ": null
    },
    {
        "Disraeli": "Benjamin Disraeli, 1St Earl Of Beaconsfield"
    },
    {
        " Conservative": "Conservative Party"
    },
    {
        " government suspended the entry into force of the act by means of further acts passed in 1874 and 1875.       One of the reasons that the Liberal government under Gladstone wanted to abolish the judicial aspect of the ": null
    },
    {
        "House of Lords": "House Of Lords"
    },
    {
        " was that it was concerned for the poor quality of ": null
    },
    {
        "judges": "Judge"
    },
    {
        " at this court. Judges at the House of Lords secured their position by mere virtue of the fact that their fathers were ": null
    },
    {
        "hereditary peers": "Hereditary Peer"
    },
    {
        " and so individuals would automatically inherit seats in the upper house rather than securing their position through merit. Therefore, some of the best ": null
    },
    {
        "lawyers": "Lawyer"
    },
    {
        " in the land were prohibited from sitting as judges in the upper house simply because of their parentage.       However, under the Conservative government, the 1874 and 1875 Acts retained the judicial aspect of the House of Lords and ensured the quality of judicial appointments to the House of Lords by legislating under the ": null
    },
    {
        "Appellate Jurisdiction Act 1876": "Appellate Jurisdiction Act 1876"
    },
    {
        ", for the mechanism of ": null
    },
    {
        "law lords": "Lords Of Appeal In Ordinary"
    },
    {
        ". The reigning monarch could appoint any individual to be a peer and thus a judge in the House of Lords. These judicial life peers would hold seats only for the duration of their life; their seat would not pass through their inheritance to their son. Thus, ": null
    },
    {
        "Queen Victoria": "Queen Victoria"
    },
    {
        " and subsequent monarchs were able to appoint leading lawyers to adjudicate in the House of Lords by making them life peers.       ": null
    },
    {
        "Lord Cairns": "Hugh Cairns, 1St Earl Cairns"
    },
    {
        ", Disraelis ": null
    },
    {
        "Lord Chancellor": "Lord Chancellor"
    },
    {
        ", sought to remove the ": null
    },
    {
        "House of Lords": "House Of Lords"
    },
    {
        " jurisdiction for Scottish and Irish appeals as well, which would have completely removed its judicial jurisdiction. However, the Lord Chancellor could not muster the necessary support in the Parliament for the bill as originally proposed in 1874 or when it was reintroduced in 1875. Finally, when it became clear that the English legal profession was firmly opposed to the reform proposals, the ": null
    },
    {
        "Appellate Jurisdiction Act 1876": "Appellate Jurisdiction Act 1876"
    },
    {
        " removed the provisions for the abolition of the judicial functions of the House of Lords, although it retained the provisions that established the ": null
    },
    {
        "High Court": "High Court Of Justice"
    },
    {
        " and the ": null
    },
    {
        "Court of Appeal": "Court Of Appeal Of England And Wales"
    }
]