[
    {
        "             Surfing is a ": null
    },
    {
        "surface water sport": "List Of Surface Water Sports"
    },
    {
        " in which the wave rider, referred to as a surfer, rides on the forward or face of a moving ": null
    },
    {
        "wave": "Wind Wave"
    },
    {
        ", which usually carries the surfer towards the ": null
    },
    {
        "shore": "Shore"
    },
    {
        ". Waves suitable for surfing are primarily found in the ": null
    },
    {
        "ocean": "Ocean"
    },
    {
        ", but can also be found in ": null
    },
    {
        "lakes": "Lake Surfing"
    },
    {
        " or ": null
    },
    {
        "rivers": "River Surfing"
    },
    {
        " in the form of a ": null
    },
    {
        "standing wave": "Standing Wave"
    },
    {
        " or ": null
    },
    {
        "tidal bore": "Tidal Bore"
    },
    {
        ". However, surfers can also utilize artificial waves such as those from boat wakes and the waves created in artificial ": null
    },
    {
        "wave pools": "Wave Pool"
    },
    {
        ".      The term surfing refers to the act of riding a wave with a board, regardless of the stance used. There are several types of boards. The ": null
    },
    {
        "native peoples of the Pacific": "Polynesian Culture"
    },
    {
        ", for instance, surfed waves on ": null
    },
    {
        "alaia": "Alaia"
    },
    {
        ", paipo, and other such craft, and did so on their belly and knees. The modern-day definition of surfing, however, most often refers to a surfer riding a wave standing up on a ": null
    },
    {
        "surfboard": "Surfboard"
    },
    {
        "; this is also referred to as stand-up surfing.     Another prominent form of surfing is ": null
    },
    {
        "body boarding": "Body Boarding"
    },
    {
        ", when a surfer rides a wave on a bodyboard, either lying on their belly, drop knee, or sometimes even standing up on a body board. Other types of surfing include knee boarding, surf matting , and using foils. ": null
    },
    {
        "Body surfing": "Body Surfing"
    },
    {
        ", where the wave is surfed without a board, using the surfers own body to catch and ride the wave, is very common and is considered by some to be the purest form of surfing.     Three major subdivisions within stand-up surfing are ": null
    },
    {
        "stand-up paddling": "Standup Paddleboarding"
    },
    {
        ", ": null
    },
    {
        "long boarding": "Surfboardlong Board"
    },
    {
        " and ": null
    },
    {
        "short boarding": "Surfboardshort Board"
    },
    {
        " with several major differences including the board design and length, the riding style, and the kind of wave that is ridden.     In ": null
    },
    {
        "tow-in surfing": "Tow-In Surfing"
    },
    {
        " , a motorized water vehicle such as a ": null
    },
    {
        "personal watercraft": "Personal Watercraft"
    },
    {
        ", tows the surfer into the wave front helping the surfer match a large waves speed, which is generally a higher speed than a self-propelled surfer can produce. Surfing-related sports such as ": null
    },
    {
        "paddle boarding": "Paddle Boarding"
    },
    {
        " and ": null
    },
    {
        "sea kayaking": "Sea Kayaking"
    },
    {
        " do not require waves, and other derivative sports such as ": null
    },
    {
        "kite surfing": "Kite Surfing"
    },
    {
        " and ": null
    },
    {
        "windsurfing": "Windsurfing"
    },
    {
        " rely primarily on wind for power, yet all of these platforms may also be used to ride waves. Recently with the use of ": null
    },
    {
        "V-drive": "V-Drive"
    },
    {
        " boats, ": null
    },
    {
        "Wakesurfing": "Wakesurfing"
    },
    {
        ", in which one surfs on the wake of a boat, has emerged. The ": null
    },
    {
        "Guinness Book of World Records": "Guinness Book Of World Records"
    },
    {
        " recognized a  wave ride by ": null
    },
    {
        "Garrett McNamara": "Garrett Mcnamara"
    },
    {
        " at ": null
    },
    {
        "Nazaré": "Nazaré, Portugal"
    },
    {
        ", ": null
    },
    {
        "Portugal": "Portugal"
    },
    {
        " as the largest wave ever surfed.                For hundreds of years, surfing was a central part of ancient ": null
    },
    {
        "Polynesian culture": "Polynesian Culture"
    },
    {
        ". Surfing may have first been observed by British explorers at ": null
    },
    {
        "Tahiti": "Tahiti"
    },
    {
        " in 1767. ": null
    },
    {
        "Samuel Wallis": "Samuel Wallis"
    },
    {
        " and the crew members of  were the first Britons to visit the island in June of that year. Another candidate is the botanist ": null
    },
    {
        "Joseph Banks": "Joseph Banks"
    },
    {
        " Fleming, F. . Off the Map: Tales of Endurance and Exploration, p. 154. Atlantic Monthly Press. being part of the ": null
    },
    {
        "first voyage of James Cook": "First Voyage Of James Cook"
    },
    {
        " on , who arrived on Tahiti on 10 April 1769. Lieutenant James King was the first person to write about the art of surfing on ": null
    },
    {
        "Hawaii": "Hawaii"
    },
    {
        " when he was completing the journals of Captain ": null
    },
    {
        "James Cook": "James Cook"
    },
    {
        " upon Cooks death in 1779.     When ": null
    },
    {
        "Mark Twain": "Mark Twain"
    },
    {
        " visited Hawaii in 1866 he wrote,   In one place we came upon a large company of naked natives, of both sexes and all ages, amusing themselves with the national pastime of surf-bathing. ": null
    }
]